{"Document Name":{"0":"Diary_0263","1":"Diary_0263","2":"Diary_0263","3":"Diary_0263","4":"Diary_0263","5":"Diary_0263","6":"Diary_0263","7":"Diary_0263","8":"Diary_0263","9":"Diary_0263","10":"Diary_0263","11":"Diary_0263","12":"Diary_0263","13":"Diary_0263","14":"Diary_0263","15":"Diary_0263","16":"Diary_0263","17":"Diary_0263","18":"Diary_0263","19":"Diary_0263","20":"Diary_0263","21":"Diary_0263","22":"Diary_0263","23":"Diary_0263","24":"Diary_0263","25":"Diary_0263","26":"Diary_0263","27":"Diary_0263","28":"Diary_0263","29":"Diary_0263","30":"Diary_0263","31":"Diary_0263","32":"Diary_0263","33":"Diary_0263","34":"Diary_0263","35":"Diary_0263","36":"Diary_0263","37":"Diary_0263","38":"Diary_0263","39":"Diary_0263","40":"Diary_0263","41":"Diary_0263","42":"Diary_0263","43":"Diary_0263","44":"Diary_0263","45":"Diary_0263","46":"Diary_0263","47":"Diary_0263","48":"Diary_0263","49":"Diary_0263","50":"Diary_0263","51":"Diary_0263","52":"Diary_0263","53":"Diary_0263","54":"Diary_0263","55":"Diary_0263","56":"Diary_0263","57":"Diary_0263","58":"Diary_0263","59":"Diary_0263","60":"Diary_0263","61":"Diary_0263","62":"Diary_0263","63":"Diary_0263","64":"Diary_0263","65":"Diary_0263","66":"Diary_0263","67":"Diary_0263","68":"Diary_0263","69":"Diary_0263","70":"Diary_0263","71":"Diary_0263","72":"Diary_0263","73":"Diary_0263","74":"Diary_0263","75":"Diary_0263","76":"Diary_0263","77":"Diary_0263","78":"Diary_0263","79":"Diary_0263","80":"Diary_0263","81":"Diary_0263","82":"Diary_0263","83":"Diary_0263","84":"Diary_0263","85":"Diary_0263","86":"Diary_0263","87":"Diary_0263","88":"Diary_0263","89":"Diary_0263","90":"Diary_0263","91":"Diary_0263","92":"Diary_0263","93":"Diary_0263","94":"Diary_0263","95":"Diary_0263","96":"Diary_0263","97":"Diary_0263","98":"Diary_0263","99":"Diary_0263","100":"Diary_0263","101":"Diary_0263","102":"Diary_0263","103":"Diary_0263","104":"Diary_0263","105":"Diary_0263","106":"Diary_0263","107":"Diary_0263","108":"Diary_0263","109":"Diary_0263","110":"Diary_0263","111":"Diary_0263","112":"Diary_0263","113":"Diary_0263","114":"Diary_0263","115":"Diary_0263","116":"Diary_0263","117":"Diary_0263","118":"Diary_0263","119":"Diary_0263","120":"Diary_0263","121":"Diary_0263","122":"Diary_0263","123":"Diary_0263","124":"Diary_0263","125":"Diary_0263","126":"Diary_0263","127":"Diary_0263","128":"Diary_0263","129":"Diary_0263","130":"Diary_0263","131":"Diary_0263","132":"Diary_0263","133":"Diary_0263","134":"Diary_0263","135":"Diary_0263","136":"Diary_0263","137":"Diary_0263","138":"Diary_0263","139":"Diary_0263","140":"Diary_0263","141":"Diary_0263","142":"Diary_0263","143":"Diary_0263","144":"Diary_0263","145":"Diary_0263","146":"Diary_0263","147":"Diary_0263","148":"Diary_0263","149":"Diary_0263","150":"Diary_0263","151":"Diary_0263","152":"Diary_0263","153":"Diary_0263","154":"Diary_0263","155":"Diary_0263","156":"Diary_0263","157":"Diary_0263","158":"Diary_0263","159":"Diary_0263","160":"Diary_0263","161":"Diary_0263","162":"Diary_0263","163":"Diary_0263","164":"Diary_0263","165":"Diary_0263","166":"Diary_0263","167":"Diary_0263","168":"Diary_0263","169":"Diary_0263","170":"Diary_0263","171":"Diary_0263","172":"Diary_0263","173":"Diary_0263","174":"Diary_0263","175":"Diary_0263","176":"Diary_0263","177":"Diary_0263","178":"Diary_0263","179":"Diary_0263","180":"Diary_0263","181":"Diary_0263","182":"Diary_0263","183":"Diary_0263","184":"Diary_0263","185":"Diary_0263","186":"Diary_0263","187":"Diary_0263","188":"Diary_0263","189":"Diary_0263","190":"Diary_0263","191":"Diary_0263","192":"Diary_0263","193":"Diary_0263","194":"Diary_0263","195":"Diary_0263","196":"Diary_0263","197":"Diary_0263","198":"Diary_0263","199":"Diary_0263","200":"Diary_0263","201":"Diary_0263","202":"Diary_0263","203":"Diary_0263","204":"Diary_0263","205":"Diary_0263","206":"Diary_0263","207":"Diary_0263","208":"Diary_0263","209":"Diary_0263","210":"Diary_0263","211":"Diary_0263","212":"Diary_0263","213":"Diary_0263","214":"Diary_0263","215":"Diary_0263","216":"Diary_0263","217":"Diary_0263","218":"Diary_0263","219":"Diary_0263","220":"Diary_0263","221":"Diary_0263","222":"Diary_0263","223":"Diary_0263","224":"Diary_0263","225":"Diary_0263","226":"Diary_0263","227":"Diary_0263","228":"Diary_0263","229":"Diary_0263","230":"Diary_0263","231":"Diary_0263","232":"Diary_0263","233":"Diary_0263","234":"Diary_0263","235":"Diary_0263","236":"Diary_0263","237":"Diary_0263","238":"Diary_0263","239":"Diary_0263","240":"Diary_0263","241":"Diary_0263","242":"Diary_0263","243":"Diary_0263","244":"Diary_0263","245":"Diary_0263","246":"Diary_0263","247":"Diary_0263","248":"Diary_0263","249":"Diary_0263","250":"Diary_0263","251":"Diary_0263","252":"Diary_0263","253":"Diary_0263","254":"Diary_0263","255":"Diary_0263","256":"Diary_0263","257":"Diary_0263"},"Date":{"0":"unknown","1":979.0,"2":980.0,"3":981.0,"4":992.0,"5":993.0,"6":994.0,"7":995.0,"8":998.0,"9":999.0,"10":1000.0,"11":1001.0,"12":1002.0,"13":1006.0,"14":1007.0,"15":1008.0,"16":1042.0,"17":1053.0,"18":1054.0,"19":1055.0,"20":1056.0,"21":1057.0,"22":1058.0,"23":1070.0,"24":1074.0,"25":1075.0,"26":1088.0,"27":1089.0,"28":1115.0,"29":1125.0,"30":1129.0,"31":1134.0,"32":1136.0,"33":1143.0,"34":1150.0,"35":1152.0,"36":1161.0,"37":1164.0,"38":1165.0,"39":1166.0,"40":1186.0,"41":1190.0,"42":1193.0,"43":1194.0,"44":1197.0,"45":1209.0,"46":1210.0,"47":1211.0,"48":1212.0,"49":1213.0,"50":1214.0,"51":1215.0,"52":1226.0,"53":1227.0,"54":1228.0,"55":1229.0,"56":1243.0,"57":1246.0,"58":1256.0,"59":1260.0,"60":1261.0,"61":1262.0,"62":1263.0,"63":1264.0,"64":1268.0,"65":1275.0,"66":1276.0,"67":1288.0,"68":1289.0,"69":1291.0,"70":1296.0,"71":1297.0,"72":1311.0,"73":1315.0,"74":1322.0,"75":1323.0,"76":1324.0,"77":1325.0,"78":1326.0,"79":1339.0,"80":1341.0,"81":1343.0,"82":1344.0,"83":1345.0,"84":1346.0,"85":1347.0,"86":1348.0,"87":1349.0,"88":1350.0,"89":1351.0,"90":1352.0,"91":1353.0,"92":1364.0,"93":1365.0,"94":1369.0,"95":1374.0,"96":1375.0,"97":1381.0,"98":1383.0,"99":1386.0,"100":1395.0,"101":1406.0,"102":1407.0,"103":1408.0,"104":1409.0,"105":1410.0,"106":1411.0,"107":1421.0,"108":1425.0,"109":1427.0,"110":1428.0,"111":1429.0,"112":1430.0,"113":1431.0,"114":1432.0,"115":1434.0,"116":1435.0,"117":1436.0,"118":1443.0,"119":1444.0,"120":1454.0,"121":1458.0,"122":1459.0,"123":1460.0,"124":1461.0,"125":1462.0,"126":1463.0,"127":1464.0,"128":1465.0,"129":1470.0,"130":1478.0,"131":1480.0,"132":1481.0,"133":1482.0,"134":1483.0,"135":1484.0,"136":1485.0,"137":1488.0,"138":1489.0,"139":1490.0,"140":1491.0,"141":1492.0,"142":1512.0,"143":1530.0,"144":1543.0,"145":1559.0,"146":1564.0,"147":1568.0,"148":1569.0,"149":1571.0,"150":1572.0,"151":1573.0,"152":1575.0,"153":1581.0,"154":1582.0,"155":1583.0,"156":1584.0,"157":1585.0,"158":1586.0,"159":1590.0,"160":1595.0,"161":1609.0,"162":1614.0,"163":1619.0,"164":1620.0,"165":1621.0,"166":1622.0,"167":1623.0,"168":1637.0,"169":1645.0,"170":1647.0,"171":1648.0,"172":1649.0,"173":1650.0,"174":1651.0,"175":1670.0,"176":1688.0,"177":1689.0,"178":1690.0,"179":1691.0,"180":1706.0,"181":1707.0,"182":1728.0,"183":1739.0,"184":1748.0,"185":1751.0,"186":1753.0,"187":1754.0,"188":1755.0,"189":1756.0,"190":1757.0,"191":1758.0,"192":1761.0,"193":1767.0,"194":1768.0,"195":1769.0,"196":1770.0,"197":1771.0,"198":1772.0,"199":1773.0,"200":1774.0,"201":1775.0,"202":1776.0,"203":1777.0,"204":1779.0,"205":1781.0,"206":1790.0,"207":1791.0,"208":1797.0,"209":1802.0,"210":1806.0,"211":1809.0,"212":1812.0,"213":1817.0,"214":1821.0,"215":1822.0,"216":1823.0,"217":1824.0,"218":1829.0,"219":1832.0,"220":1833.0,"221":1834.0,"222":1835.0,"223":1836.0,"224":1837.0,"225":1843.0,"226":1854.0,"227":1855.0,"228":1856.0,"229":1882.0,"230":1887.0,"231":1891.0,"232":1892.0,"233":1895.0,"234":1896.0,"235":1897.0,"236":1898.0,"237":1899.0,"238":1900.0,"239":1907.0,"240":1909.0,"241":1910.0,"242":1923.0,"243":1924.0,"244":1925.0,"245":1926.0,"246":1927.0,"247":1931.0,"248":1932.0,"249":1940.0,"250":1952.0,"251":1957.0,"252":1958.0,"253":1965.0,"254":1967.0,"255":1973.0,"256":2011.0,"257":2012.0},"Entry":{"0":"\n\n","1":"\n\nSailed from Sydney at noon on Sat Aug 19th. Tis a day I am not likely to forget in a hurry, but it was somewhat marred by the fact that there was not a soul on the wharf whom I knew except a few chaps from camp. The reasonof this was that I was an emergency man to the reinforcerment &was uncertain until 2 hours before the boat sailed as to whether I would be going or not. I did not like saying good bye to all my friends &then perhaps not sailing. Even if I had wished I could not possibly have said good bye to a lot of people as I only joined the reinforcement the day before they went down to the boat &then I was put on baggage guard at the boat the night before sailing &only gota few hours leave from 8pm to midnight. It took us the best part of Friday afternoon to put out all the hammocks\n\n\n\n& mess things etc &after tea we drew lots to see who would go ashore, ½ to go until 8pm &the remainder to go when they had returned: I drew the 2nd lot &had to wait until 8pm though some of the first half did not come back untilnext morning. Not for one moment did I doubt but that I would sail on the next day &sure enough when the troops marched on board at 10am on the","2":" there was one man missing in our reinforcement the","3":" of the","4":" Regt. He was a Russian &had been taken by the police on a charge of assaulting a woman, & so I got his place to my great delight as it would have broken my heart I think to have had to stay behind having got so near to sailing. There were quite a lot of troops who came on board at Sydneyincluding a reinforcement of the Camel Corps, a reinforcement of NZMR (119). 2 reinforcements of Queenslanders\n\n\n","5":" &11th L.H.) &a few engineers &WirelessSquadronmen. There was a huge crowd on the wharf &an hour before the ship left there were hundreds of streamers out from ship to shore. Perhaps if I had any friends there I might have felt the departure more keenly thanI did which was keenly enough but at the same time I did not like the thought of sailing with even a soul I knew to wish me Godspeed &without saying good bye to anyone. At last 12 oclock came & as the ship slowly drew away from the wharf under the influence of a couple of powerful tugsthe streamers began to break slowly at first but quicker &quicker as we got further out until there were only a few long ones left &when these finally snapped there was great cheering both from the wharf &from the boat. Once out from the wharf we swung round facing\n\n\n\nthe Heads &gradually got weigh on. The wharf and its cheering crowd with waving hankerchiefs, got smaller &smaller as we drew away until we finally lost sight of the wharf round a bend. There were many sad hearts that day, although there was not a tear to be seen. It made one think of what we were leaving &appreciate as we never had done before perhaps the good old place we were leaving. Of the men on the boat that day there were a great number who were not to see Sydney again &before many months were passed we were scattered all over Egypt, some having already found graves in the desert. We crossed the heads at about 2pm &when outside made a big swing southwards for Melbourne. We all stayed on deck to see the last of Sydney &when the Lighthouse on Southhead had faded away in the distance we went down below to\n\n\n\nexamine our quarters. Perhaps it is time I gave some idea of the ship was to be our home for the next five weeks &on which we had a really good time. The RMS \"Mooltan\" for that was her name was a P&Omail boat of 10,500 tons displacement. She had none of the brightly painted upper works that characterized these boats in pre war days, but from the top of her masts tothe waterline everything was of a dull grey colour like a warship is painted. Many &many a time I had seen this ship lyingat Circular Quay when I was at St. Josephs butlittle did I think in those days that I was to leave australia in her to go to the greatest war that has ever been in the history of the world.To most of us who had never previously been on a big ship she seemed like a huge floating\n\nmansion. I had once been to Melbourne (8 year before) in the \"Wyandra\" an inter state coaster of 4,500 tones but of her I have only a faint recollection. We carried 1st &2nd class passengers while the","6":" class part was reserved for troops. This had been converted into a troop deck extending from the fo'castle head to amidships, below the first saloon. A lot of the chaps had great difficulty in finding their way about down below butI did not have much trouble as I had been all over the ship prior to leaving Sydney. We had hammocks to sleep in with two blankets per man. In the day time these were rolled up &placed in receptacles for them in the corner of the mess deck. We drew our hammocks at 6 pm each night &put them away at 6 am each morning. Overhead on the roof were racks in which was a life belt\n\nfor everyman &also hooks on which to suspend our hammocks at night. On the floor were tables withforms, all fastened securely down, each table holding 14 men, 7 on either side. Underneath the table &running throughout its entire length was a broad wooden plank which was used as a receptacle for our plates &crockery etc. Each table was supplied with a bucket for drawing tea, while there were two bigdishes for meat &vegetables (tin)&one for pudding. In addition there were 2 enamel plates per man &a knife, fork &spoon each. To get upon deck we had a ladder up the hatchwayonto the \"well\" deck between the focastle head &the bridge. This method of egress could only be used in calm weather, as in rough weather the seas used to come over the bow &down the hatch wayonto our\n\ndeck. The well deck was considerably lower than the focastle & centre of the ship & as it was bounded on the other sides by the sides of the ship it thus gets its name, also because the hold goes down through the centre of it. Amid ships we had the use the hurricane decks extending from the well deck to the aft hatch & 2nd class quarters a distance of about 75 yards nearly on both sides of the ship. To get onto this deck one had to go up a commaion way to the boat deck","7":" class passengers only allowed here) along it for 7 or 8 yards & then down a flight of steps onto the hurricane deck. Later on we had a guard at top of the steps to prevent any loitering while going from the hurricane to the well deck & vice versa. The Mooltan had already had one escape from a Submarine in the Meditteranean\n\nbut owing to her superior speed was able to escape after a long chase in which she maintained a speed of 20 knots for some time. It was afterwards found that this had some what strained her engines & whenever afterwards she got up to 16 or 17 knots she used to vibrate a gread deal & sometimes you could hardly stand on the focastle head for the vibration. She was Sunk the following","8":" by a mine off Gibraltar. I was very sorry indeed when I heard of her going down as I had had a really good time on her for 5 weeks. The food on board was good but we did not fully appreciate it at the time & used to grumble some what. Many & many a time afterwards out on the desert I would have thought the same food luxurious. Still we never seem to know when we are well off & only appreciate\n\na good thing when we get something worse. Breakfast usually consisted of porridge, & bacon or steak. Had Pudding every day usually a plum duff one day & rice with fruit or figs the next. The duffs were fearfully heavy & were a good test of ones digestive powers. In addition we had plenty of butter jam & cheese & for dinner had either mutton, beef or stew & vegetables, &\nwel\nnever did we have the same dish continuously as in the\narmy\ncamps where it is practically\nstue\nstew, stew every day until one got to hate the sight of it. We had a canteen down below run by the ships management at which one could get coffee, lime juice, biscuits cakes sweets, & tobacco & cigarettes etc at very moderate prices. The Cigarettes & Tobacco were so much cheaper than on land as they were duty free.\n\nWe had a YMCA representative on board who did practically nothing to promote concerts & sports etc which he was there to do, but spent most of his time with the","9":"Class passengers & among the nurses we picked up on the way round Australia.\n\nHad a very calm trip round to Melbourne & no one was sick. Steamed through the Rip at about 6 am on","10":"& as we sailed up the Bay it began to drizzle with rain which was accompanied by a cold wind. Tied up to the wharf ar Port Melbourne at 9 am & immediately went ashore on leave until midnight. WSent to all the Public buildings not omitting the law Courts where we heard several cases going on. At night went to the theatre to see \"The Girl in the Train\". Melbourne gives one the impression of room & space as\n\n\n\nthe streets are much wider than those of Sydney & are laid out on a better principle - the Block System.Were not allowed ashore next day for some reason unknown. Towards sailing time a bitterly cold wind sprang up accompanied by rain which however did not prevent quite a large crowd assembling to see the boat off. At Melbourne we took on board some Wireless, Engineers & 50 nurses bound for Mesopotamia. Cleared the Rip just after dark & it was rather interesting to watch the searchlight from Queenscliff sweeping the sea sometimes lighting up the ship & sometimes on to the Pilot boat which accompanied us out to sea for some miles.\n\nHad an uneventful trip to Adelaide except for some cases of seasickness when we ran into a slight swell. Arrived at Adelaide on morning\n\nof 24th & berthed at the outer Harbour. We again got leave to go ashore, but by the time our special train reached the city it was midday. Tis just an hours journey to the city, through sandy waste land most of the way. Was rather taken up with Adelaide & prefer it to either Sydney or Melbourne as a city though it is very hot in summer I should say. The city seems so nice & clean, with a good tram service & wide sreet. The peculiarity of Adelaide is that all the buildings are down one long street, rather a novel idea I thought as in Sydney & Melbourne they are intersperced all through the city. Went to visit my uncle who ismanager of the Commercial Bank. Was very sorry that our time was so limited as we had only a few hours which would not allow of one going out\n\nto the hills or any of the Environs of the city. Had to be back on the ship by 5 pm but did not sail until about 9 pm. It took us 4 days to go round to Fremantle with rough seas & head winds all the way. Quite a lot of the chaps were sick but I was not so affected. Once we passed Cape Leewin the weather moderated & the remainder of the journey to Fremantle was through comparatively calm water. The town lies about half a mile inside the Breakwater at the entrance to the Swan River. A mile or so out from the Breakwater is Rottnest Island, which is used both as a pleasure resort & as an internment camp for German prisoners of war. As we only got in just before sundown & were to leave again at midnight we only had a few hours leave ashore. Would liked to have gone up the river to Perth but time would not permit.\n\nQuite a number of chaps got hoplessly drunk to celebrate the last port of call in Australia which a lot of us were destined never to see again.\n\nFremantle seemed a very uninteresting place indeed. We sailed at midnight of 28th & next morning were well out of sight of land, & for the next 9 days did not see a boat of any description ot even any land till we reached Colombo.\n\nThe weather was very hot going across the Indian Ocean, which was very calm all the way across. We slept up on deck at night after leaving Fremantle as it was almost unbearable at night down below. Our dress from now on was dungarees converted into shorts. shoes & singlets. For duty we did half an hours physical \"jerks\" every day & guard on the gangway about\n\nonce every 3 or 4 days. We used to be awakened every morning about 5 am by the hasears crying \"washee deckJohny\"& if we did not move it wouldresult in a wetting. For amusement we used to have Boxing Contests during the afternoon & concerts at night sometimes.\n\nAbout 2 days out from Fremantle a gloom was cast over the whole ship by the death of a young Westralian who had only come on board at Fremantle. His death was caused by Haemohage of the Brain as the result of over excertion in a boxing contest. He died within an hour of the contest. We buried him at sea next morning about breakfast time. The ship was stopped & lay rolling quietly on the swell while we stood at attention round the messtables as the body was lowered over the side.\n\nThe young chap in question was very well liked & put up a splendid fight against a man much heavier than himself. We used the well deck as a ring & had tarpaulins spread overhead to keep off the sun's rays.\n\nTwas about this time that I learned the rudiments of photography. One of my mates used to do a good deal & taught me how to develop etc. For a dark room we used a bathroom with the ventilators blocked up & all cracks etc covered to exclude light & in addition we put a red cape over the electric light. We would be shut in for about an hour at a time & at the expiration of that time would be absolutely dropping with persperation owing to the stuffiness of the room.\n\nFlying fish were very plentiful going across the\n\nIndian ocean. Arrived Colombo at sundown on 7th & left on night of","11":" Went ashore each day at 11 am for a route march along the seafront & then to the barracks where we were dismissed at 1 pm. We were then at liberty to roam around the town until 4 pm when we went back to barracks & thence to the ship.\n\nHad several rickshaw rides. They charge 1\/- per hour which is not too much considering that in that time they can cover quite a lot of ground at a fair trot. The natives drawing them are very wiry & seem tireless.\n\nSilk goods were very cheap here being obtainable at about","12":" the price one would pay in Australia. When buying anything you have to beat them do in price as their first price is about 3 times the real value of the article. As we did not like haggling over prices I think we paid a lot\n\nmore for things than they were worth.\n\nThe Cingalese are absolute pests & from childhood are taught to beg. Their favourite cry is \"me no father no mother no sister no brother no nothing give it one penny\".\n\nThe Barracks are fine, airy, & spacious buildings but almost empty when we were there. The Gardens on the outskirts of the town are very nice. The vegetation is all tropical & grows very dense.\n\nHorses are exceedingly scarce being conspicuous by their absence. Practically all vehicles are drawn by a small species of humped oxen, which are exceedingly strong. The native carts are covered over with wickerwork & are usually drawn by either one or 2 oxen.\n\nIn the centre of the main sq is a tall square shaped tower used as a town clock & as a lighthouse. The roads in & around Colombo\n\nare excellent & are easily kept in repair on account of there being no heavy traffic on them. The residences of the Europeans are about a mile or so outside the town & stand back off the road amidst dense vegetation.\n\nThere are no verandahs around the houses or shops but some few of the latter have awnings put out over the footpath.\n\nOn Saturday our last day in port a mate and myself went around the harbour in a boat visiting several of the ships in harbour, all anchored out of course. Had a good look over a French packet boat the M.M. Cordilline bound for Cochin China. She carries a 75 mm as a stern chaser for submarines. Her passengers were a motely crowd comprising Indians, Chinese, French & some French soldiers on their way to Singapore.\n\nShe was an exceedingly dirty ship & not to be compared to our steamer.\n\nNext we went to the Troopship A8, the Argyleshire bound for Australia. The next was a big dirty looking transport with a load of 600 mules on board from China to Italy & a Chinese crew. Near her was a small oil-steamer vey appropriately named the Castor.\n\nThe port seemed to be really too small for the amount of shipping that goes through there. The Harbour would be practically enclosed by a breakwater but for two breaks in it called the North & South entrances respectively. Tis usual to go in the Northern entrance & out through the Southern one.\n\nOn account of there being no wharves all the coal etc is taken to & fro by lighters. It took us a night & half the following day to coal, during which time we took on\n\nboard about 500 tons of coal.\n\nAt Colombo we lost the Nurses & Wireless who were bound for Mesopotamia.\n\nI had a swim around the ship one morning in company with some others but we were promptly ordered out on account of sharks which however go out to sea in the day time & come in to feed at night.\n\nAfter leaving Colombo we struck out in a N.W. direction for Aden. Had head winds & choppy seas until we struck the Gulf of Aden about a days sail from Aden.\n\nWe did not keep on the main trade route but took an unusual course. It took us almost 7 days to reach Aden, which is a couple of days over the scheduled time. The reason of the delay was that the boat from Bombay which was to meet us at Aden broke down & so we reduced speed to 12 knots so as not to get\n\n\n\ninto Aden too early. Near Aden the water is remarkably clear & we could see fish etc quite clearly to a remarkable depth. Sharks are very plentiful in these waters & even before going in we saw about 20 of the hammer headed variety while the harbour simply swarms with them .\n\nHad a route march ashore each day when it got cool. Aden, I think is the last place God made & he forgot to finish it.\n\nThe town or what little there is there lays at the foot of some rough, barren hills which comes down to the waters edge almost. There are a couple of hotels, a few other buildings, the rest being barracks & hospitals.\n\nOn Saturday afternoon a ship came in with a cargo of Chinese labourers for France, where they were to do agricultural work on account of the shortage\n\nof such labour existing there.\n\nLeft Aden about midnight & next morning on waking up found ourselves inside the Red Sea. Had fair breeze all the way up the Red Sea so that we did not get it as hot as is usually the case when going through this sea.Saw land on the first day but not so for the ensuing 2 days.\n\nThe Red Sea teems with fish, probably because it has never been fished to any extent & again on account of there being no market near at hand.\n\nDue to arrive at Suez on evening of","13":"\n\nGot into Suez at tea time & disembarked at 6 pm. Got a good send off when we left the ship, from the passengers & crew who assembled at the rail to bid us good bye.\n\nAs we neared the land & the ship, now a blaze of light - receeded, we felt very sorry indeed at leaving.\n\nSuch a good home, for such she had been for almost 5 weeks.\n\nEntrained in special trains for an unknown destination for which we left at 8 pm. At midnight we detrained at a place called Moascar (Arabic for camp) about a mile out of Ismailia. Marched¾ of a mile through heavy sand to the Isolation Camp, because we had had several cases of mumps on board.\n\nAbout a mile away is the Canal running through L Timsah which was a mile across & in which we used to swim.\n\nHave been doing drill while in Isolation Camp, including one week of mounted work. Were out in a sand storm one day & for about half an hour we could not see more than about 10 yards & got covered all over with dirt & sand, in our eyes, ears, etc.\n\nThe railway runs just past our camp & on\n\nthe other side of the line is a big Tommy camp containing anything up to 20,000 men.\n\nHad 3 inoculations in the first week. Tis pretty monotonous in Isolation, as we have no means of getting out for a swim or of going in to Ismailia. Nevertheless some of us did go out a few times down to the main detail camp & down swimming at night even.\n\nWon 100 yds Chmps of isolation camp today out of 16 starters. It was worth only about 10\/- to me.\n\nVoting for the Referendum took place on","14":" &","15":" but I did not have a vote.\n\nA riding school for young Tommy officers used to practise near our camp. They were awfully amusingas they all rode in Tod Sloan fashion (knees up) & none of them knew anything about riding. Their mounts (mules) used to take them all over the place & one evening in particular a young\n\nofficer of about 18 years of age was in great distress. His mule simply took him where it liked & eventually he had to get off & lead it back to the main lot.\n","16":" went out of Isolation today down into the main Details Camp. This is the main base camp for the L. Horse in Egypt.\n\nThe stables are made of light wood with rush work over the top. Each building is about 50 yds long & would hold as many horses or 75 perhaps. These stables were in 2 rows about 30 yards apart & ran the whole length of the camp in front of the tents, a distance of at least¾ of a mile. There were never many horses in the stables however.\n\nUsed to go swimming nearly every day in the Lake & I used to enjoy it immensely. On the way to the Lake we used to cross a fresh water canal about 25 yds wide that runs from P Said right to\n\nCairo almost through Ismailia & gets its name from that place. There was quite a lot of traffic on it - the old sailing boats with the big sails.\n\nI was to learn a lot more about Egypt in the future & the part these canals took in it. Have been in Ismailia a few times but do not think much of it. The European quarter is the only decent part, the native quarter being very dirty.\n\nThe natives all seem to have donkeys, very small animals about 3'6\" high which can carry very heavy loads in comparison to their size. Tis nothing to see a donkey coming along with a huge load up from under which all you can see is his head & legs. Also the men ride on top of this at times while the women carry great loads on their heads with the greatest of ease.\n","17":"\n\nDecided to take up signalling as I was tired of doing rifle exercises etc & accordingly entered the Signalling School which lasts 4 weeks & after which I go on to Big signalling school at Zeitoun for some weeks.\n\nSaw Ainslie Kingsford one day he came down for the day from Kantara (about 25 miles up the Canal) where the L. Horse are camped at present.\n\nI have been playing quite a lot of Rugby football since coming into details & am in the team representing the Details Camp. Have played against a Welsh team from the 53rdDivn, also a representative time from that Divn.\n\nDuring the former game the rain simply poured down for about 20 mins & needless to say we got soaked which however did not prevent us from carrying on. This is the first rain we have seen since coming to Egypt.\n\nHave played several matches against the N.Z.M.R. \n\nwho are fine players indeed.\n","18":"\n\nWent up to Zeitoun today on a Signalling Course. Zeitoun is about 8 miles out of Cairo & quite close to Heliopolis. Zeitoun is about 90 miles from Ismailia.\n\nA few miles from Moasen we began to come into the cultivated areas, which are irrigated from the main fresh water canal which follows the line & from which branches go out in all directions.\n\nTheir methods of irrigation are very rough but never the less effective. To raise the water from the canal onto the land, generally a height of 3 - 4 feet, they use two or three methods.\n\nOne method is to have a long pole pivoted on a perpendicular pole about 10 feet long. The top pole is so balanced by means of a weight of dried mud or something heavy on the end that when the bucket suspended on the other end is pulled down by the native & filled\n\nthe weight on the other end of the pole will raise it up. The native then emptiesit into his furrow & carries on again. This method is slow but time seems no object to them.\n","19":" Another method is to use a wheel (Horizontal) pivoted in the centre which is made to turn a wheel fitted with buckets on its rim, & fitted vertically against the other one. Pegs are used in place of cogs. As the Horizontal wheel is turned the pegs in it catch in those of the water wheel & thus turn it. As the wheel comes up & over the buckets empty into a trough. The flat wheel has an upright post about 3' high & from this a long pole about 12' long running out. A cow is hitched to this & made to walk around in a circle when it is required to raise the water.\n\nOn the rim of the vertical wheel is an endless chain of buckets. As the level wheel is turned the pegs on it interlace with those on the vertical wheel (like cogs) & so turn it. This type is generally used in wells etc for raising the water.\n","20":" Still another method is to get a cylinder about 8' long with a screw through it on the system of a corkscrew & turned by a handle at the top. One end rests in the water & the other empties into a furrow on top of the bank. These are very portable but slow.\n\nThe crops most in evidence at present are maize, sugar cane & some cotton. Saw some sheep with long tails & the wool of a dark brown colour. I should not think that the wool is of very good quality.\n\nCotton seems to be the main crop but as it is out of season at present have not seen any.\n\nTheir methods\n\nof ploughing are very crude being the same as used thousands of years ago. It is drawn by 2 oxen, an ox & a camel or even by a single camel. The plough itself is of wood but some have an iron ploughshare. The handle is a single piece of wood about 3 feet long. \n\nThe mainbar & the ploughshare are generally in one piece. As the soil in the Delta area is so very easy to work their ploughs are effective enough. They don't turn the soil over but simply tear through it.\n\nConsidering the primitiveness of their implements they achieve some good results. When ploughing is finished the natives go over the field with hoes breaking the clods.\n\nAbout 30 miles from Moascar is Tel-el-Kebar which used to be the main Australian Camp prior to the infantry going to France. There were some thing like 100,000 men in March.\n\nTis now deserted but the miles of huts are still standing.\n\nThe Zeitoun School of Instruction is one of the biggest of its kind in the Empire. Some of its various branches are M. Gun training;N.C.O. course; Cadet course for officers; Cavalry school; Artillery & Signalling school; & Stokes Gun. This latter is a very portable French mortar which can fire up to 30 shots a minute with extreme accuracy up to 500 yds. In appearance it is just like a piece of drain pipe stuck on a bed or foundation & can be elevated as required.\n\nThe total strength of the schools was something like 2,000, one fifth or more of which were signallers.\n\nThe tucker is not nearly as good as at Moascar & leaves plenty of room for improvement.\n\nWe are quartered in huts made of light timber & boarded roofs not meant to keep the rain out. Each hut holds about 40-50 men.\n\nJust a few minutes walk from the School is the big internment camp containing some 7 or 8 thousand prisoners of war of which the greatest majority are Turks. There are however some Austrians, Germans & Bulgarians.\n\nThe prisoners look very in their black woollen uniforms & red Fez caps & I don't think they would attempt to escape if given the chance even as they are so well treated. Tis a pity our prisoners are not treated as well in enemy countries.\n\nWe are about 7 miles from Cairo, the journey taking about 25 mins in one of the Electric railway cars or 10 mins by train from Helmiat stn. The fair on the tram is only½ PT","21":"& 1 PT","22":" Class.\n\nAmong the places that are very convenient for Soldiers are the Anzac Hostel & Esbekia Gardens. The former was the Bourse & is ideal for concerts & Picture shows etc, there being an entertainment\n\nof some sort every night. Also there are Billiard Tables, writing & reading room, Restaurant & Bed Rooms. The Tariff is very moderate & a good meal can be obtained for 7 PT.\n\nThe leading Hotels, Sheperds, The Grand Continental & the National, are fine places but the 2 former ones are out of bounds to all troops except officers.\n\nThe pyramids can be seen quite plainly from the School - a distance of easily 15 miles. From Cairo out is an hours journey by tram costing only 1 PT which is about the cheapest tram ride that I have have yet had.\n\nAll the way out & running par'l to the tramline is a fine hard metal road shaded by big trees growing on either side. This road was built by Napoleon & along this the Society of Cairo goes for its evening Constitutional drive etc.\n\nTis not much good me giving any Statistics regarding the Pyramids I suppose as one can get them from anywhere.\n\nThe highest is 460', we did not go inside any of the Pyramids as tis not very pleasant nor did we climb any of them. To go inside you must take off your boots & slide down a low slippery passage.\n\nThe Sphinx is quite close to the Pyramids, in a hollow caused by excavations made to expose it. Its nose is broken off, done it is said by Napoleon in Battle of Pyramids.\n\nThe pyramids were covered at one time with a smooth coating of Limestone but all of this except a little on the centre one had been removed to build the Citadel.\n\nAlso visited the Museum. It is a fine building about 3 times as big as Sydney Museum, & is a 2 storeyed building.\n\nIt contains mostly relics of Ancient Egypt as mummies etc & would be very interesting to one who is a student of archaeology. Personally I found it rather dull.\n\nThe mummies are by far the most interesting. They are made by a process of pickling. The internal oragans are removed through the side & the brain is taken out through the nose. The body was then filled with rags etc to give it an appearance of fulness. It was then swathed in bandages with the hands crossed on the breast. The bodies were covered with hieroglyphics to keep out evil spirit & to preserve the body.\n\nThe Paprus of which there was quite a good deal is very old & was made from a reed of the same name. Some of the articles in the museum were over 4,000 years old.\n\nWent to the Church at Heliopolis this morning","23":" Dec). It was a French Church (RC) & of unique architecture. It is very solidly built, of white stone with a small dome on each corner & a bigger one on the Centre of the roof.\n\nThe service was in French except of course the Mass which is in Latin & the choir consisted of French school boys. There is a service later in the morning in English for troops from the School of Instruction.\n\nReturned to Moascar about a week before Xmas as the school broke up for a fortnight.\n\nSaw a peculiar method of catching fish while down at Moascar this time. Onof the lake one day I saw a couple of boats containing natives who were stamping about trying to make as much row as they could. It seems that they had their nets on the surface of the\n\nwater, kept there by bamboo rods. The nets were placed in form of a circle inside which were the boats. The natives reckoned that by making such a row they would cause the fish to jump out of the water & so get caught in the nets if they failed to clear them.\n\nEvidently they must have some success at this method or they would not use it. The fish caught this way were mostly mullet which do a lot of jumping.\n","24":"El Arish was occupied yesterday without opposition.\n","25":"At Magdahlia - 30 miles up the El Arish wadi the Des Mtd Corps wiped out a post of 2,000 men taking 1,350 of them prisoners with only 136 casualties on our side.\n\nHad sports on Boxing Day consisting of Athletic & Horse events. Came","26":"in the 880 yards - the first one I had ever run in & our Regt came","27":" in Relay race.\n\nReturned to Zeitoun on","28":" The first few days of the New Year have been wet & bitterly cold.\n","29":"Des Mtd Corps had another sucess yesterday at Rafa, 32 miles up the coast from El Arish. 1,600 prisoners were taken with only 400 casualties on our side.\n\nThis Desert Mounted Corps is a mobile column consisting of Anzac Division, Imperial Division & the Camel Corps but was changed a few months later to the Anzac Div, Aust Div & Yeomanry Divn & Camel Corps.\n\nRafa was the occasion when mounted troops alone took a strongly fortified position. Prisoners have begun to arrive at the Prison Camp over the road 1,000 having so far arrived. They have been making an awful row since coming here & it may be because they have struck a\n\ngood home or because they have been telling the older men all the news. They have all been dished out with new uniforms.\n","30":"Went for a walk today to Makanich which is only a mile ot two from the School. Here we saw the Holy Well & the Virgins Tree where Joseph & Mary rested on their flight into Egypt.\n\nThere is a fine R.C. Church near by, on the inside walls of which are painted different events that occured during the flight.\n\nAbout a quarter of a mile from the Church is the Old Obelisk which is said to be a sister one to Cleopatra's Needle. It is 40' high & has an equal length below ground. It was originally at Heliopolis but was moved to its present position to commemorate some great event in ancient history but exactly what that event was I do not know.\n","31":"Wrote to Mr Elsworthy, the Red Cross Commissioner who is at Sheperds & had an answer today saying that he was going back to Australia in a couple of days time.\n","32":"Went out to the Citadel today. It is a fine place situated on the base of the Mokattam Hills overlooking Cairo & the River. The mosque is a beautiful place inside with something 5,000 lamps suspended inside from the roof. There are no seats inside or anything of that nature but just heavy carpet on the floor.\n\nFrom the top of it you can get a fine panoramic view of Cairo. I took some snaps & for the one inside I had to give it 40 seconds exposure. Some chaps with me who had only singlelenses in their cameras had to give it as much as 90 seconds exposure.\n\nAt the back of the Citadel are the quarries from which the stone necessary to build the place was taken.\n","33":"Had a game of football today with a team from Moascar, against the","34":"Aus Camel Regt. Scores 8- 8. I scored for our side & next day was so stiff & sore that I could hardly walk - due to lack of condition.\n","35":"Went up to the Barrage last Sunday. This is a big dam built across a junction of the Nile about 15 miles above Cairo. The wall across the delta is about½ mile long, has sluice gates throughout its length & a few big towers at intervals.\n\nThe two branches are respectively 500 & 600 yards long with about 130 arches in all. Its object is the same as the big Aswan Dam but until a couple of years ago was not a success.\n\nA light train line runs from the stn\n\nto the dam, a distance of 2 miles. There are beautiful gardens here also a small museum containing working models of various parts of the works. To get some snaps of the wall we rowed out across the Dam. Had to take it in two sections.\n","36":"\n\nSir Archibald Murray inspected the school today. The parade numbered about 2,000 in all & consisted of troops of all units on the front.\n\nA few days ago wentover the road to the Aus Remount Depot to see a buckjumping exhibition. Tis easily the best exhibition I have ever seen & contains some of Australia's best riders.\n","37":"\n\nReturned to Moascar. Details today & am going out to the Regiment in a day or so. The 42nd Divn is here now concentrating prior to going to France.\n","38":"\n\nLeft Moascarat 10.20 for Kantara. Left Kantara at 1 oclock in open truck for the regiment. Detrained at Bir El Abd where we camped for the night. This is a watering place on the railway 45 miles beyond Kantara.\n\nNext afternoon got horses which were brought in from the regt which is camped at a place called Bayud 7 miles out from Ber El Abd. The first chap I met from the Regiment was a chap named Thorpe who was at Hawkesbury in '15. Joined the Regimental signallers & was put on HQS.\n\nAt Bayud we go out on observation posts about 7 miles out, every","39":" day. We communicate by Helio.All supplies are brought out on camels which are the principal means of transport on the Sand. The water is always carried in metal cans called Fanates (?), shaped like a suitcase & of various sizes, & to contain 10, 12 or 15 gallons.\n\nA camel generally carries two of these. The camp is situated on the sides of a hollow in the sand at the bottom of which are some date palms & a few wells & rising abruptly behind the trees is a huge sandhill.\n\nThe country is all sandy undulating hills covered with a coarse kind of vegetation which grows to a height of about 3 feet. This place was the scene of a scrap after Romani & our Regt did the stunt 20 miles & as they got no H2O when getting there & so had to go back.\n\nHave been playing a lot of football here on the sand & it gets one in good condition. It has been very windy here during last few days & we cannot eat a meal on account of the sand blowing about. One day when we had just started dinner the tent blew down on top of us & spoilt our dinner.\n\nHeard on","40":" that the Turks had evacuated a place called Shellal which was\n\nsupposed to be very strongly fortified.\n\nThis was an exceedingly favourable time for me to join the regiment as I had a month wherein to get used to the way of things while the regt is resting, before we start the actual campaigning again.\n\nMoved over to another Hod. - Hod el Geeila, a distance of 7 miles, on","41":" & on","42":" we set out for El Arish.\n\nSet out on","43":" en route to El Arish, following the old caravan route across the desert that has been in use for hundreds & hundreds of years. Only did 15 miles today & camped at a place called Tillul. Next day was only a short stunt - 8 miles to a place called Mazar which we reached by dinner time.\n\nSet out next morning for Bardawal or Kilo 143 still following the old track & incidentilly the railway line. Arrived at 3 pm distance being 15 miles.\n\nTravelled very quick today as we were going over a continuation of a dried salt lakes most of the way. The railway line is not very\n\n\n\nSafe at present & there are breakdowns nearly every day on it. At Mazar took some snaps of a derailed engine.\n","44":"\n\nLeft at 8.30 for El Arish travelling along the beach practically all the way. Passed our aerodrome at Kilo 143. Just as we got to El Arish orKilo 153 a Taube came over very high up & on being fired at by our anti aircraft guns turned & went back. I did not see the machine, as it was along way off.\n\nWe camped just over the railway line & about 200 yds from the sea. Went in swimming about 3 times a day & played football almost every afternoon. Went in swimming my horse one day with my watch on & of course the water got into it & rusted it.\n\nThe surf is not much good & there is also a fair amount of under tow. We have played the machine gun Squadron & Field Ambulance Combined, result 0 - 0. The complete\n","45":" L H Bde is camped about here & consists ofthe 1st, 2nd & 3rd Regts, 1st L.H.F. Amb & 1st Machine Gun Squadron.\n","46":"\n\nOn","47":" had a Brigade Race meeting up the El Arish Wadi. It was very successful but the best event was the mule race. The mules were all shapes & sizes. The Bde Major won on a tiny mule & the Staff Capt came 2nd on a great big ungainly one.\n\nWe entered our mule for this, (Head Quarters Sigs Pack mule) but she followed a mule off the course about half way round. She has a head on her just like a tree. There were several impromptu bookies on the field & all of them did well.\n\n5th\n\nThe","48":" Bde arrived today & are camped up the Wadi. They have been recently formed at the Canal & treeked up the desert. They consist of the 4th, 12th & 11th Regiments.\n\nAfter a lot of chasing about saw Bob Stinson.\n\n6th\n\nLeft at 8.30 for Shiekh Zoawide a distance of 21 miles arriving there about 4 pm.\n\nSoon after leaving El Arish we began\n\n\n\n\n\n\n\n\n\n\n\nto get into decent cultivated country & the going was much easier than further down the line. Saw plenty of small patches of cultivated land, some sown with bailey.\n\nLeft again next morning at 8.30 & just as we were moving out a Taube came over head flying low. We scattered but he did not drop any bombs. All the morning we travelled through good grazing country with plenty of crops about.\n\nCrossed the Border into Palestine at 11.30 just near Rafa. Rode across the battle field which was now covered with crops which the Bedouins were harvesting. Halted at midday for lunch - our first meal in the land flowing with milk & honey which it certainly seems after the sand.Our horses appreciated the green crops very much as it was many a long day since they had had any.\n\nEntered Khan Yunis about 3.30 & camped about a mile beyong it &\n\non the edge of the sand dunes which run along the coast all the way for a width of about 2 miles.\n\nKhan Yunis is a small village with very narrow winding streets & mud huts. There is any amount of cactus about, it being used as hedges & fences. Khan Yunis is at the entrance of a valley which looks just lovely at present being covered with almond orchards & cultivated land.\n\nA Taube came over very low on the afternoon of our arrival & to spite our antis, turned his machine gun on us without hitting anyone however.\n\nWent out on outpost on our 2nd night here, for 24 hours. I was on an observation post all day with a Helio on a house top.\n\nSaw a good air scrap today about half a mile away. A Hun tackled 2 of our machines from above & brought one of them down near the 2nd Regt.\n\nFrom where we were we could just see into Gaza & during the day saw 6 of our planes bomb it, dropping about 40\n\nbombs which we could see bursting.\n\nSaw Jack Finn last night & had a long yarn to him. He is camped at Railhead which was shelled today by a Turkish high velocity gun. There were about 40 casualties.\n\nIntended going to see Jack on Monday evening 17th but we left after tea for Shellal . The whole Division went out. Travelled all night & got to our destination just before day light next morning.\n\nWhile watering in the wadi a Taube came over & bombed us, killing about 5 & wounding 20. I saw the bombs burst about 300 ydsaway.\n\nThe Anzac Divconsists of 1st & 2nd L.H. Bdes & N.Z.M.R.Bde, & 22nd Mtd Bde.\n\nWent out same night about 8.30 & after travelling all night got into position next morning at day break at a place called Erk & went into action just about sunrise on a line of ridges which we held all day. We could have advanced but our\n\norders were only to hold the positions & not to attack.\n\nI was with H.Q. & about a mile behind the line all day. They were shelling very constantly all day but did not do much damage around our quarters.\n\nA Taube dropped a bomb about 50 yds away from where I was lying at the phone & burst about 5 yds away from the Brigadier & his staff (Col Cox) without hitting anyone.Just where we were - in a wadi was Bde H.Q.s, our led horses & the Field Ambulance.\n\nDuring the afternoon a battery of Horse Artillery (18 pdns) the Leicesters galloped into action just about 100 yds away from us on an open piece of ground. They were quickly spotted by a Taube who dropped a smoke ball over them & in about 2 minutes they were being heavily shelled by Turkish Field Artillery. The shells were falling very close to us at times, some hitting the bank we were lying under,some were going over us & some just in front\n\nbut luckily none dropped in the wadi we were in.\n\nIt very quickly got too hot for the battery & they had to come out of action. it was great to see the way the teams came up at the gallop swing round limbered up & away in about 3 or 4 seconds, under heavy shell fire.All 6 guns were got away thus one at a time without a single casualty.\n\nThe Turks during the day had forced back the 2nd Bde on our right & towards evening were around the back of us & firing on us from behind so that under cover of darkness we cleared out.\n\nDuring the afternoon the","49":" &","50":" Regiments galloped out into action in front of us across the open ground. It was a grand sight to see the way they manouvered & opened out into close formation with the shells bursting among them. I reckon that it is a sight that will take some beating.\n\nThe Turks had a lot of calvary here & it was a Bde of these\n\nthat pushed back the","51":" Regt on our right.\n\nThe attack over Gaza way had not done well at all & at 3 pm the Turks counter attacked all along the line. Our casualties today all told were about 14,000. This could not be called a victory by any means & was a very servere knock back.\n\nWe travelled all night & just about daylight reached a position where I had been on outpost some days previous to the scrap, which was only 5 miles from Erk yet it took us all night to go there.We then turned in for a few hours much needed sleep as we hadhad none for 3 nights.\n\nWe were awakened at 8 am however & told to be ready to move in 15 min. Got saddled up & on the move & about 9 oclock as we were travelling along in close formation a Taube came along. As soon as he spotted us he turned & went home. About half an hour later 4 more came up one behind the other & dropped 16 bombs on us.\n\n\n\nwe did not have time to scatter & so just got off our horses & laid down as flat as one could get. Our casualties for the Bde were 75 horses killed, 5 killed & 30 wounded, some of whom died later on.\n\nJust after the Huns went away, 6 of our machines went over laden with bombs, one of the Huns was circling above them but did not attack, nor did they molest him as they had bigger work on hand. We heard later on that they bombed a Turkish Cavalry Bde, dropping 54 bombs on them with excellent results.\n\nThese Taubs are the most demoralising things used, I think, as apart from the damage they do they play up with ones nerves so you see a plane above you & when he drops a bomb you hear it whistling of course & are sure that it is going to fall on you head.\n\nQuite a lot of chaps get Taubitis. The Huns have some new machines now that are much faster than\n\nours.\n","52":"\n\nComing in from outpost tonight we saw one of our machines that had been out bombing brought down &burst into flames on landing.\n\n23rd.\n\nBombed again this morning (4 bombs) but no damage done beyond 2 men wounded &a couple of horses killed. Since we got cut up a few days ago, we adopt a new formation both when on the march & when bivouaced, called \"Taube Formation\".\n\nThe main idea is to keep as much distance as possible between troops thus presenting a Taube very poor target.\n\nHave been issued with gas masks just before the stunt as preventitive against our own gas or the enemys. We fired some thousands of gas shells at Gaza but it was not effective as it was not concentrated enough.\n\nTwo of our tanks were put out of action at Gaza on","53":" one on top of tank redoubtwhere it still remains. It was through following the tank into action that 2 Companys of our Camel Corps were annililated on by above\n\n7 men escaping. All the travelling is done at night now & only come home off a stunt in day time.\n","54":"\n\nWent out at 0330 this morning as Jacko wassuspected to make an attack. It did not come however & we had to ride back to camp. It is very hot & the dust of which there is a great deal makes ones mouth parched so that you drink far more water than you otherwise would &yet it does not quench the thirst. The dust gets in ones eyes also & at times you can hardly see out of them.\n\nWe have plenty of water when near the Wadi but very little when away from it as there is no means of getting it up.\n\nMoved out same night for Shellal into a position we are to occupy for sometime. Camped just over the wadi about 100 yds from where the 2nd Bde were bombed on","55":"\n\nThe horses have just been buried & the ground smells something awful at times when wind blows our way.\n\nThere is a plentiful supply in the wadi here, in fact all along it. This wadiGhuzze runs into the sea near Gaza & finishes up away down below Beersheeba. In winter it becomes a raging torrent but in summer just a chain of water hiles.\n\nJust where we have our H.Q.s is a hill that we use as an observation post all day. On top is the remains of an old Christian Church. The floor is of beautiful mozaic work & was covered by 3 or 4 feet of earth.\n\nThe designs were made of variegated coloured stone & consisted of a Leopard, Flamingo, Vase of Fruit, Serpent, Goat & Peacock. There was some Greek writing which several officers tried to translate without much success.\n\nSince we have been up on this hill I think every General & Staff officer on the front has been to see it. The whole floor has since gone back to Australia in a cement casting.\n","56":"\n\nBombed again this morning, 4 horses killed & 2 men killed. We have antics\n\nout here now which do some good shooting at times & keep the Huns well up at least.\n","57":"\n\nHuns made a moonlight raid last night, dropping about 40 bombs on a Hospital & Railhead. Their object was our aerodrome which they missed & got the hospital instead. There were about 40 casualties.\n\nNext night they repeated the performance & 1 bomb alone killed & wounded 70 infantry. Same night one came along our way machine gunning our chaps who were digging trenches.\n\nToday a Taube tackled 3 of our machines just out in front of us. One cleared off, one was brought down with a couple of bullets in his engine & a very light on fire. The pilot was burned badly but the machine was allright. The other machine hovered down low under cover of our machine guns, while the Hun circled above waiting for our machines to go up higher & yet afraid to come down on account of our machine guns. The machine was brought in during the night.\n\nThe Hun machine was much faster than ours & could manouvre with much greater ease.\n\nOur patrol brought in 2 Turkish prisoners this morning (14th). They were quite young & rather good looking. They were armed with Mauser Rifles (1916 pattern) 120 rounds ammunition & a saw edged bayonet each. There clothes were exceedingly rough & coarse material.\n","58":"\n\nThe 74th Divn have now taken over all the trenches we have been digging for the last month or so.\n\nMoved yesterday up the wadi to a place called Hisea 1 mile from Shellal. The water we were using at the last place has now been marked cholera infected, which explains why we were all so sick at H.Q.s for a few days. For some days I used to vomit up all my meals as soon as I had had them & feel alright again afterwards, & quite prepared to eat another good meal.\n\nWind & dust have been very bad during last few days & absolutely get into everything. You cannot keep clean as if you have a wash you are just as bad again in 5 minutes time.\n\n\n","59":"\n\nLeft this afternoon on a long stunt to a place called Asluj some 15 miles below Beersheeba. Set out at 2 pm on","60":" & did not get back to camp till midnight on","61":" riding practically all the time. We arrived at our destination at about 6 am next morning having covered about 43 miles.Going home however we went by a shorter route of about 37 miles. We must have travelled easily 80 miles on this stunt.\n\nMet with practically no opposition except for some shots fired at us by Bedouins of whom we saw a fair number.\n\nWe blew up a long railway bridge over a wadi at Asluj station. The Bridge has 15 spans in it & was well made of sandstone. We also blew up some miles of railway with gun cotton.\n\nQuite near the station was a village that had probably been used as a frontier post as it contained a big barracks that had been used by cavalry. The line was narrow gauge about 3'6\" & ran from Beersheeba to a place called\n\nAjua on the Border of Palestine & Sinai. It could be used as a jumping off ground for an attack on our communications at El Arish, say, as it is only about 40 miles from Ajua to El Arish. Altogether 20 miles of line & several bridges were destroyed.\n\nWe were on the extreme right of the whole force & while we were blowing up the line the other troops were making a feint attack on Beersheeba to distract attention from us.\n\nThe camel corps were down below us atAjua & were out for some days altogether.There were nearly 25,000 mounted troops on this stunt consisting of the Anzac Divn, Imp Mtd Divn & Camel Corps.\n\nAt 10 oclock the whole of Desert Column retired but we did not get home till midnight. We were awfully done up when we got home & it was easily the longest ride that ever I had done.\n\nFor the last 10 miles or so I could not sit in one position in the saddle for more than 5 minutes as I was so sore. To add to our miseries we got lost after dark & I am almost sure we passed one certain hill 3 times.\n\nI slept until dinner time next day.\n\nManaged to get several snaps of the bridge, one before it went up, 1 as it was going up & one after the explosion.\n\nWe saw quite a lot of sheep in one flock we counted over 300 & also got plenty of fowls & eggs.\n\nOn the way home we burnt a tremendous quantity of hay.\n","62":"\n\nWent back about 6 miles today for a spell of 9 days in reserve & 9 on the beach.\n","63":" of our planes chased & brought down a Hun. Two more today chased another one & only for the machine gun jamming would have brought it down. This is a welcome sign as it seems as ifwe are getting our own back a bit.\n","64":"\n\nWent down to the beach today for a swim & gave the horses one also.\n\nSome French Colonials at Khan Yunis as we were going through. They come from Morocco. They are very smart & have a good turn out. I don't think there is more than about a Battalion of them here at present. There are also some Italians here too about 1 Battalion. They are \"Bersaglient\" \n","65":"\n\nWas playing football yesterday against the","66":" Regt & during the game I received a kick on the right knee which necessitated me going to hospital next day.\n\nWent from our Field Ambulance to a Divisional Clearing Stn & from there on to a Field Hospital at Rafa where Istayed 2 days. The journey to Rafa was over rough ground & the swaying of the Ambulance made me quite sick.\n\nI was still Capt of the Regiment team & was rather unlucky in getting hurt when I did as our Bde went down to the beach for 10 days the next day after I left the Regt & I was looking forward so much to this trip.\n\nWent down to El Arish in a hospital train today","67":" Stayed the night there in No 2 Aus Stn Hopl & next morning went down to Kantara to No 24 Stationary Hospital.\n\nHad to wait here a few days before I could get on to the","68":" A.G.H. at Cairo.\n\nMy knee is doing well now & is nothing very serious just a slight touch of synovitis. Don't like this Hospital at Kantara at all & will be glad to get under\n\nour own people.\n","69":"\n\nLeft Kantara this morning at 8.30 in a fast hospital train & was in Cairo about 12.30. This is a beautiful train & they look after you very well on it.\n","70":"\n\nSick of being kept in bed & am to be allowed up tomorrow, I hope. The nights are very warm now & one does not need any bed clothes at all. They treat us very well in here & the nurses are kindness itself. The thing I appreciate most of all are the baths & that one can keep clean.Also you soon get rid of all septic sores, which I was never without at the regiment.\n\nThe","71":" AGH is a fine big building of 2 storeys & built on square system with a big quadrangle in the middle. Twas originally built by Napolean for barracks & is crest is still on the top of the main gate. The walls are remarkably thick - about 3' at least & running down the centre of the wards & supporting the roof are big pillars about 3'6\" square & one every 7 or 8 yards.\n\nThere is a namesake of mine in Hospital\n\nat present (but no relation) a Lieut McNamara from the 67th AFC who has the VC & is wounded. He landed in the Turkish lines & brought away the pilot of one of our machines that had been brought down.\n","72":"\n\nLeft the","73":" for Montazal Convelecent home, a few miles out from Alexandria & near Aboukir Bay. Tis a fine place - the Harem of the Sultan of Egypt before the war & now the Red Cross Convalescent Home. It is absolutely ideal for a convalescent home & is situated round the shores of a small bay that has only a small entrance & exit.\n\nThere are about 1,400 patients here at present about 100 of whom are Australians. The Block I happen to be in was donated by the Lismore District farmers. There are numerous buildings here which are used as wards & about 100 acres of fruit trees & woodlands.\n\nThe Bay is an ideal place for swimming, it being about 600 yds across to the breakwater where the water is as clear as crystal. A young Scotty & myself used to go over to the Breakwater for a\n\ncouple of hours every day.\n\nThere is a sailing boat here also & several rowing boats. We are not allowed outside the breakwater however. There is a certain amount of fishing done also but the fish are not very plentiful. Also have tennis courts & cricket pitches & I generally have a couple of sets of Tennis everyday.\n\nWe have concerts a couple of times a week as well as open air pictures. The tucker here is great, much better than in hospital & we have 4 meals a day.\n\nHave a fortnight here & good as it is it will be long enough for me as it gets monotonous. When we first arrived we thought we could easily do a couple of months in such a fine place but itsoon wore off & when I left on","74":" was not altogether sorry to be going.\n\nWent back to Moascar today,","75":" arriving there at about 10 pm that night.\n\nThe Last of Ramadan has just finished & now the natives are having 5 days feasting to make up for what they have lost in the past\n\nmonth. During the month of Ramadan the Egyptans fast from 3 in the morning until 7 pm at night. They take it very seriously & the greater majority of the natives keep the fast which is more than I could do I am sure.\n\nFasting is one of the 5 main points of their religion & Mahomedans adhere very strictly to the laws of their religion.\n","76":"\n\nWas innoculated this morning and has 2 full doses, 1of cholera & 1of Para Typhoid, receiving 1 in each arm. Was rather unwell during the day & was very feverish over night & my arms were very sore & stiff next day.\n\n25th\n\nGot a new rig out this morning as I am going back to the regiment today.\n\nSaw Bob Stenson today for a while, he is in details at present. He was very confident of getting his Commission as a pilot in the Sqdn. He was looking very well & had much benefited by his sojourn in Hospital & at Montazah.\n\nWent to Kantara by the afternoon train & left same night at 10 pm in a troop train. We were jammed in like flies, 35 men\n\n\n\nper truck. This is the hottest period of the year & as we are pretty soft after coming out of hospital we feel the heat.\n\nWhen we got to Rafa at 10 am next morning we had to march about 2 miles through heavy sand to a rest camp. We were just like wet socks when we got there & completely knocked up. We have to stay here 24 hours & go back to the regiment tomorrow.\n\nHad a good nights rest after the weary train journey & next morning marched back to the Station with ourkit up & 120 rounds of ammunition.\n\nIt was the hotest part of the day & we were wringing wet when we got to the Station. Got a train out to Shellal at dinner time & there we were met by men from the Rgt with horses which was camped about 5 miles away.\n\nThey have been having a very rough time out here lately & I am not sorry to have missed it.\n\nEx Capt Downs who was at Menangle in my time is over now & came out to join the 7thRegt today as a trooper as he could not come away with a commission.\n\nWe adopt a new formation when camped now (3 Sqdns)being in the shape of a hollow square, a squadron forming a side of it & HQ's & Sigs etc the remaining side of it,there being 3 squadrons in the Regiment. This formation presents an exceedingly small target to the Hun planes & tis a mere fluke if he does any damage,\n\n30th\n\nWe are in some redoubt at present X, Y & Z covering the extreme right flank of our line. The redoubts are about¾ of a mile apart & at the rear of them we have the horse lines.\n\nTis 3 miles from here to water in the wadi which is too far to go down & back twice a day so when the horses go down in the morning one man to 3 horses, the men take their dinner & after watering go out beyond the wadi grazing on the plain until about 2.30 when they come back & water.\n\nThere are 4 sigs here so that we only have to go down every fourth day, as one man takes our 4 horses.\n\nWe are to occupy these redoubts for a week at the end of which we will be relieved by another Regiment.\n\nWe have had a lot of reinforcements now on this front of men & guns & now have 7 infantry Divisions here the 10th 52nd 53rd 54th 60th 74th & 75th & 3 mounted Divisions forming the Desert Mounted Corps. The Inf Divns are grouped into 2 Army Corps the","77":" &","78":" There must be something like 25,000 men on this front now with about 800 guns.\n","79":"\n\nHave been back some days now from the Redoubts & have been on a couple of all night stunts out beyond the wadi, on one of these we ran into a Turkish redoubt before we knew it was there. The enemy opened a heavy fire but no one was hit.\n","80":" \n\nRegiment went over to Shellal Junct today to be deloused. They have a disenfecting train into which we put all our blankets & clothes for half an hour to be steamed & disenfected. While this is on you have to wear an overcoat or anything you like. The clothes are wet when they come out but very quickly dry on\n\n\n\nyour body.\n\nHeard a few days ago that the Mooltan was sunk off Gibraltar on","81":" by a mine, was very sorry to hear this.\n","82":"\n\nWent out on a stunt last night to a place below Beersheeba . We travelled all night, covering at least 25 miles & just after daylight got onto a hill 3 miles from Beersheeba . We had a rotten journey as we seemed to be stopping every quarter of an hour or so & we would no sooner lay down than we would have to go on again. I was with \"C\" Sqdn for this stunt & not with HQ's.\n\nWe crossed the Beersheeba Agua railway & went about a mile or so beyond it onto Hill 1160. We were engaged with the enemy at long range with machine guns & rifles.\n\nC Squadron was out in front today & was doing the scrapping. About 8 am they started to shell us from a hill about 2 miles in front of us & in about 2 minutes everyone was off the Hill with the exception of my mate & myself.\n\nThe first 2 shells lobbed about 10 yds away but hit no one.\n\n\n\nI was sending a message on the helio at the time & did not notice anything until they were all gone. The chap who had our horse did not stay with them, but cleared out. We had all our gear off our horses, including the packhorse & were just having breakfast when they started.\n\nWe got away eventually & I handed the message in when I got in to H.Q's, as I did not finish sending it. I did not get any breakfast however.\n\nWhen our men left the hill the enemy lengthened his range & got onto the Sqdn as they were going back across the plain to H.Q. They had a couple of men killed, 2 wounded & some horses killed.\n\nWe brought home about 20 Bedouins who had been firing on us. They were armed with Turkish Rifles of new pattern (1916).\n\nWe travelled about 50 miles on this stunt but it was worse than that of May 22nd owing to the heat & because we had no water & I had nothing to eat all day.\n\nCould not see Beersheeba owing to intervening hills. Got home on night of","83":" & went out again on","84":" on same stunt only our Regt was in reserve to the Bde.The other two Bdes 2nd & NZMR were on our left.\n\nGeneral Allenby was out today having a reconnaisance of the country & was accompanied by General Chauvel, Gen Chaytor (Anzac Divn) & our Brigadier Gen Cox. They came out all the way in motor cars of which there were 13 including a few armoured motor cars. They went back before dinner having had a good look round.\n\nThe","85":" Regt went up to where we were shelled a couple of days previously & did not have a shell fired at them.\n\nWent backhome by a short cut & got back to camp about 8 pm. We are going down to the beach on","86":" for a months spell.\n","87":"\n\nOutpost tonight & day patrol tomorrow morning.\n","88":"\n\nWe were not relieved until dinner time by the","89":" Mtd Bde (London Rough Riders) & did not get to the beach until 7.30 pm.\n\n\n\nRode about 20 miles that day, we watered at Shellal crossing on way back & noticed the wonderful improvements that had been made since we were there last time 3 months ago.\n\nThere is a big railway bridge over the wadi, also a traffic bridge for the wet season & a big dam, with a pumping plant on the bank of the water. Also they have big stone troughs there now for watering horses & the water laid on by pipes from the dam.\n\nAt the beach we are camped only 20 yds from the waters edge & are always in swimming. The whole Divn is scattered along the beach for about 4 miles. We get water for the horses by simply digging in the sand about 18\" when we get a plentiful supply of fresh water.\n","90":"\n\nWas called up tonight by the Colonel & told that I had been awarded the Military Medal for the stunt on the","91":" I got an awful shock & you could have knocked me down with a feather as I never dreamt for a\n\nminute that I had been recommended & in fact had expected to be \"for it\" for not finishing the message. I certainly don't think I deserve it.\n","92":"\n\nReceived a letter of congrats today from Gens Chauvel & Chaytor & a piece of ribbon. Sent this home as it would only have got soiled & dirty.\n\nWe were inspected today by Gen Chaytor Divn Commander & I had to brighten up our bits & stirrup irons for it. We cleaned them in the sand but they were just as bad again in a couple of days.\n\nThe","93":" Bde have just completed a Boxing Tournament which was very successful though there was not much talent there. Brig Gen Ryrie was referee & gave very good decisions. He is an ex-Champion amateur & knows a lot about the game.\n\nOur Bde starts a tourament tomorrow.\n","94":"\n\nA lot of the horses are getting sand colic, other wise they are doing pretty well. To prevent them eating sand we have muzzles for them now.\n","95":"\n\nInspected by Gen Chauvel today & of course had to clean our bits & stirrup irons again but they did not get much polishing.\n\nOur Boxing Tourmament lasted 2 nights but did not bring forth any white hopes etc. Perhaps the good men did not care to enter or else there is not much boxing talent among the L. Horse.\n\nWe had a Brigade Sports meeting on","96":" The main item of interest was a challenge race for £100 aside between 2 men of our Bde. One of them a Queenslander named Schoeler won easily by 6 yds,\n\nAfterwards the same man won practically everything in the Bde Championships including the 75 yds Chmps 100 yds; 220, hop, shin & jump, high jump, & long jump & won about£22 in prize money apart from his share of the£100 stakes. The stakes were raised by the men & officers of the regiment but I think he would get about£25 out of it.\n\nAt the finish they had a mule race\n\nwhich was exceedingly funny. Everyone was doing their best to frighten the mules & they were going everywhere. A very small mule won it.\n","97":"\n\nLeft the beach this morning for a new camp on the railway line from Rafa to Shellal. We were not altogether sorry to leave the beach as though we had had a good months rest we were beginning to get a bit tired of it.\n\nOne never seems to be content in the Army & we do not like to get stuck in one place for any length of time & yet we don't like the actual move.\n\nOur new camp is on an open plain the soil of which is a sandy loam & is very quickly churned up by the horses hoofs.\n\nPrior to our occupation in April the country was under crop & heavily grassed, but now all vistage of crop etc is gone & the top few inches of surface soil has been churned into fine dust.\n\nA strong wind blows in from the sea every afternoon after dinner & when the horses go to water they raise clouds of dust which spreads all\n\nover the plain, you cannot see 50 yds ahead of you when going to water & the dust gets down your nose & through parching you & fills your eyes & ears up.\n","98":"\n\nOur horses were out grazing today on the hills just to the west of the camp & something caused them to stampede. Away they went full gallop through the camp & away beyond it.\n\nThey were eventually pulled up about 2 miles from camp & 3 managed to break their necks. Twas a surprise to us as we did not think our horses had a gallop left in them.\n\nAll Regiments are being issued with 24 donkeys each now owing to lack of remounts. None have come over for 3 months & no more are expected until the end of this month.\n","99":"\n\nWent to 67th Sqdn AFC today as a wireless operator. I have been after this for some time now & passed my test when down on the beach. I rank as 2 AM & pay is increased to 8\/- per day.\n\n\n\n\n\n5\/- of which I must allot. Hope to stay in the aerodrome for a couple of months & have an easy time.\n\nThings are much more comfortable in here at the aerodrome than in the L Horse & the men have tents to sleep in (4 per tent) & also mess huts (marquees) for meals. By putting in 10 PTS each per pay we can get a lot of extras in grub & at least can have a pudding every day.\n","100":"\n\nThere was an air scrap this morning but on account of it being up in the sun we could not see it, but could hear the machine guns easily enough. It appears that 2 of our machines tackled 2 Huns. One cleared off home while the other stayed.\n\nThe one that stayed was brought down in our lines with holes through his engine & petrol tank.It was an Albatross Scout & the pilot was captured uninjured & the machine was intact.\n\nOne of our machines was badly knocked about & had trouble in reaching the drome.\n\nThis scrap caused great excitement & rejoicing as it was the first Hun machine to be brought down in our lines.\n\nBoth pilot & his machine were brought into our drome & the machine is being repaired preparatory to flying it. The pilot, a Prussian named Ober-Lieut Dietmach, was not a bad looking chap.\n\nHe mounts two machine guns on his machine synchronised to the engine & crossfiring in front about 300'. He uses armour piercing & tracer bullets. These tracer bullets are coated with phosthorus whichcatches alight when going through the air & will set a machine on fire if it hit it in a suitable place.\n\nThe pilot had hard luck as he had been in this country for 3 years & was going home to Germany in a few days time, on leave.\n","101":"\n\nOur fighters brought down another Hun Scout today. He surrended when he saw that he was outclassed but instead of landing in our\n\nlines as our pilot signalled him too, he kept heading for his own lines, so our machine emptied his machine gun into him at very close range & he dropped like a stone. The pilot was unrecognisable & his machine was smashed to atoms.\n\nThe air service here is improving now & we have some fine new fighting machines here - Bristol Fighters.\n\nWe have 4 Squadrons on this front now, 113 RFC (just lately come) 111 RFC (Fighting Squadron)","102":" Sqdn RFC & 67th AFC.\n\n113th &","103":" Sqdns do artillery co-operation work, 111ththe fighting & escort work & our Sqdn does bombing, reconnaisances & photography.\n\nOur Squadron has done more flying than any other here by a long way.\n","104":"\n\nWent out today to Shellal to join 181 HeavyBattery RGA in 96th Heavy Group, as wireless operators attached to the battery. There was another chap with me who was in charge.\n\nThus my dreams of staying in the aerodrome for a couple of months was\n\nrudely shattered. Our station is very portable & can be erected or dismantled in 15 or 20 minutes. It consists of a Short Wave Tuner MK111, 2 poles 20' high & an aerial of copper wire 60 yds long suspended between the two poles. This aerial wire is connected to our instruments.\n\nAlso we have 2 copper mesh mats about 12' long & 2' wide which we cover with earth & connect by a lead to our instrument.\n\nWe have a Bivoy made made in 1 piece which is much better than anything that the troops are issued with. We generally pitch the bivoy at the foot of the taller mast & have our aerial pointing in the direction the guns are going to shoot, as a rule.\n\nAlso as part of our equipment we have 6 canvas strips 13' x 2' which we use for signalling to the aeroplanes from the ground. Our instrument is simply for the receiving & we cannot transmit messages.\n\nOur station when in action will be pitched about 100 - 200 yds to the rear of the guns. We have horses to ride & they are easily the two biggest crocks in the battery. One - mine, has a reputation as a buck jumper but when I got on him he did not do a thing.\n\nThis battery has just come from Salonika where they were for about 9 months. They have 4 guns, 60 pounders eaching weighing about 7 tons when ready for travelling & with an extreme range of 13,500 yds(Once however we by digging in the trail got as much as 14,500 yds on) but the gun was sticking up just like an anti air craft gun.\n\nThe guns are drawn by horses, a gun team consisting of 14 heavy draught horses but when we had been on the move sometimes these were reduced to 10 or 12.\n\nIn the group towhich we are attached are 2 seige batteries of 6\" Howitzers, 2 batteries of 60 pounders & a battery of 4.5\" Howitzers.\n\nSince we joined them we have had a couple of test shoots to see if the guns have the right mixture in the recoiling chambers. On the","105":" test the guns were jumping something awful but were allrightthe","106":" time, as the oil in the buffers had been thickened in the meantime by the addition of some glycarine.\n","107":"\n\nMoved to Gamli a place in the Wadi just below Tel-el-Fara. We are going out any day now as the big stunt is starting soon. Our Heavy group is going to Beersheeba . There is great movement of troops now - getting ready for the attack.\n","108":"\n\nMoved out last night to a position 13 miles from Fara & 5 from Beersheeba .\n\nGot into position about 3 am put our stn up & then turned in for a sleep until 6 am when the attack started. We bombarded all day long on various targets as Batteries etc but mostly on redoubts & trenches. Just about dusk & after a couple of hours\n\nbombardment a general attack was made on the place by infantry in front & the Des Mounted Corps in the rear. The infantry were just getting held up on the","109":" line defences when the","110":" L H Bde charged at full gallop over the trenches right into the middle of the town.\n\nAfter this the Turks threw in & the town was ours. We captured about 2,000 men 20 guns & thousands & thousands of rounds of small arms & shell ammunition.\n\nIt was absolutely necessary to take the place on the first day as all the troops were depending on it for their water supply. We did excellent work at Beersheeba & put a couple of batteries out of action.\n\nThe enemy must have got a big surprise when our heavy guns opened out as he never dreamt that we could get our heavy guns up during a night. We had about 220 guns of all calibres concentrated on Beersheeba that day & the heabier did by far the most damage.\n\nWe did not enter Beersheeba but went next morning to a place about 6 or 7 miles to the left of Beersheeba & on the line to Gaza, over very heavy & rough country.\n\nGot into position about 4 pm & found that there was no infantry in front of us. We could see troops moving about at Irgig stn only 2 miles in front of us & thought they were our own.\n\nThe 10th Div was supposed to have been in front of us but did not arrive until just about dusk so that we had to withdraw our guns about 2,000 yds. Rather a peculiar position to be in for a Heavy Battery to be out in front of infantry but of course it was an unusual occurence.\n\nNext morning, November","111":" we had to go back to Karm 8 miles as our horses had had no water for over 48 hours & were nearly done. We were in just as bad a plight & could get only about a pint of water a day.\n\nThe 10th Div took Irgig this morning without much opposition.\n\n\n\nThey had not been in Beersheeba stunt & had marched up from Rafa which accounted for them being so late.\n\nWent back to Karm to give horses a few days spell but did not take the guns down.\n\nOn","112":" went back up to our guns setting out at about dinner time. After limbering up, the guns went on further, crossed the railway line at Irgig & got into position eventually about 3 am in the morning only¼ mile beyond the railway.\n\nHad to put our station up as we were to start early. Had a little breakfast about4.30, - the first bite we had had since the previous morning.\n\nWe opened fire at sunrise & continued until 9.30 am when we advanced the guns about 1¼ miles to a position they had taken earlier in the morning. During the day there was some severe fighting at places & about 400 prisoners & 4 guns were taken with some machine guns.\n\nAfter tea we went up 2\n\nmiles further. Got into position about 10 pm put ourstation up & turned in. On the way up we saw a big Turkish ammunition dump going up at Sheria .\n\nEarly this morning 7th we were in the bombardment & barrage on Sheria which it was necessary for us to take as it contained an unlimited water supply. The place was taken after very violent hand to hand fighting about 8 am.\n\nAdvanced again at 11 am about 1½ miles & got into a position about 2 miles from Sheria.\n\nThe L Horse (Aus Divn) went through this morning & are following up the retreating turks. They captured 2 5.9\" Howitzers this morning absolutely intact.\n\nThe plan now seems to beto swing round north of Gaza & envelope it as we have broken his C centre at Sheria while Beersheeba settled his right flank.\n\nThere was a combined army & navy bombardment of Gaza for 3 days but\n\nnot much fighting there.\n\nThe Turks evacuated Gaza during the night of the","113":" & got most of his stuff away. He left some thousands of rounds of ammunition both small arms& shells which he could not get away. If he had stayed in Gaza a day longer he would have been cut off which would have meant some thousands of men & guns surrendering.At Scheria we captured intact a Turkish hospital.\n\nAs we have been exceedingly short of water during the last few days I went over to Sheria wells last night","114":" with one of the Signallers taking about a dozen water bottles between us. I did not know where Scheria was as I had not seen the place in daylight & so had to trust myself to the Tommy & coming home we got lost completely. About midnight we struck a field hospital & stayed there until daylight when we found ourselves only½ a mile away from the battery.\n\nThis was the first occasion on which I\n\nhad ever been lost. There is an unlimited supply of water at Schenia which was a god send to us.\n\nThe infantry are now 7 miles beyond Sheria & the L Horse nearly 20 miles. The enemy is retreating very fast so that we cannot keep up with our heavy guns - on","115":" we went through Sheria & camped about a mile beyond it & only a couple of hundred yards from a Turkish field battery which had been captured intact.\n\nHad a good look round as there were any amount of stuff lying about a general dump in war. We are supposed to be here for 48 hours rest.\n\nThere are any amount of dead lying about & they are all swollen & black from the sun.\n\nThe battery near us had been taken at the point of the bayonet as the dead gunners were lying near the guns. They were mostly Austrians but some were Turks. 5 of them were still alive & had been laying there unattended for 3 days.\n\nThey were removed during the night to a Field Hospital for wounded Turks at Sheria.\n\nThere were hundreds of rifles & bayonets lying about including some saw edged ones. Also there were German Gas masks, Packs, eating implements, dishes etc & all kind of uniforms & clothing lying about.Every one was collecting souvenirs & needless to say I was one of them. The Infantry had got the best however as they were first in there.\n","116":"\n\nWord came through about 2 am this morning that we are to go back to Karm which will certainly spoil our 48 hrs rest.We cannot follow up in pursuit & so are going back for a spell to Karm which is 17 miles from here by road.\n\nAs we went through Sheria on our way back we saw about 500 prisoners including a General going back. They are an awful looking lot of men but some of them are of fine phisique.\n\nWe have not been doing well for grub lately, as the Q Master\n\n\n\ngenerally manages to get lost when going for rations & one night was going up to the front line for them until he was stopped. He was in the army 26 years & I reckon he is in his","117":" childhood.They bluff him at the dumps & whereas other people get break every day he brings back biscuits for this battery.\n\nWe went back 7 miles to Irgig today & go the remaining 10 to-morrow.\n\nWe had our horses taken away from us on the","118":" & so we refuse to walk the rest of the way. They left the guns at Irgig for a well & we stayed with them & had a very easy time with nothing to do & heaps of water only¼ mile away in the wadi.\n\nOn","119":" the guns went down to Karm where the remainder of the 96th H.A.G. was concentrated. We went down but did not walk, as we rode on the waggons.\n\nHad a good spell at Karm as there were anyamount of canteen about & so we lived well for the 10 days\n\nwe were at Karm. Received a big mail also at Karm the first we had had for almost 2 months.\n","120":"\n\nGot on the move again today our ultimate destination being Ramleh or Jaffa. We went across to Sheria & then along the Beersheeba road to Gaza. Did not enter the town however but went a few miles in rear of it onto the main road going up the coast. The Turkish railway starts about 4 miles beyond Gaza & runs parl to ours, which is now 16 miles beyond Gaza. We travelled 7 miles the first day, 16 the","121":" 6 on the","122":" day, 20 on the 4th.\n\nPassing along the road is a never ceasing stream of motor lorries & light Ford cars, carrying up supplies etc.\n\nThere are villages every 4 or 5 miles along the road but are very dirty & squalid. Oranges are very plentiful now & cost 1 piastre for 6 = approx 3 for d.The country we are passing through is very level, rich & well cultivated.\n\nUp at the front now they are not making much progress owing to lack of Heavy artillery which is now being rushed up.\n","123":"\n\nArrived at Junction Station today after only a 6 mile stunt. This is our","124":" day on the march. This place is the Junction for all the lines from Jaffa, Jerusalem & Gaza.\n\nThere were several fine buildings here which are now being used by us as Hospitals. An enormous quantity of building material was captured here some thousands of pounds worth, also some engines & rolling stock.The engines were all made in Belguim.\n\nWe are now about 34 miles beyond Gaza by road & during the whole of the treck of 55 miles we have only walked about 5 miles. The remainder of it we rode in cars or motor lorries. Our plan was to find the days destination then get in a motor car & go on ahead & wait for them or if we did\n\nnot know exactly where they were going so we went about 6 miles ahead & waited for them at a village. We found no difficulty in getting a ride as there are motors passing continually day & night.\n\nSome some chaps from the 1st Regt today & had a long yarn to them. The Regt has been cut up during the stunt & has so far had about 120 casualties.\n\nAinslie Kingsford has a commission now.\n","125":"\n\nWent on to Naanch today 5 miles beyond Junction & only 3 from Ramleh we are to camp here some days & then go into action just out beyond Ludd.\n\nTo celebrate my 21st birthday on","126":" only had Bully & biscuits. It had been very cold here during past few days & raining almost continuously.\n\nWent into Ramleh one afternoon & had a good look around. It is a fair sized place of about 4,000 inhabitants & has some decent buildings in it. It has plenty of shops etc but they do not contain much.\n\nOne building which used to be Turkish GHQ has a tall spire on it with a clock on each side of its 4 sides. Also in the town is an old tower the remains of an early Christian Church. At the foot of it are some underground chambers extending for some considerable distance, which I did not explore however.\n\nSurrounding the town are about 40 acres of almond orchards. A great deal of the land around here has been ploughed quite recently. The methods of ploughing are the same as back in Egypt & are very primative.\n\nOn the afternoon of the","127":" it fined up & we moved up to a position about 3 miles out from Ludd. The roads are so bad - just like quagmires that our guns were getting stuck everywhere. Were getting stuck everywhere.\n\nThe distance was only 7 miles but at 3 am next morning we were still a couple of miles short with 3 guns stuck along the road & the 4th upside down\n\nat the foot of a bank. It was bitterly cold during the night & we were thankful that it did not rain which would have only added to our trouble.\n\nNext day with the help of 100 men from the Essex Regt we managed to get the gun on to its wheels again & onto the road. It was undamaged luckily.The same night we went on & got all 4 guns into position before next morning.\n\nJerusalem was occupied on the","128":" & now our troops are some miles beyond it.\n\nWe were paid in notes a few days ago but they are useless. As we cannot get any change & if you want to buy anything you have to get 50 PT worth & share it around among several others who do the same thing in turns.\n\nWhatwe mostly buy is Jewish bread which is brown in colour, very open texture & costing 1\/- per 1lb loaf. Also we can buy oranges & Turkish tobacco which is not much chop as it is too green.\n\n\n","129":"\n\nMoved up 2,000 yds further today as we were out of range almost, our extreme range is 13,500 yds for which the trail of the gun must be tug down considerably to get the gun elevated to 30º or 32°.We can see Jaffa quite distinctly from here it lying across the plain 12 miles away.\n\nOur advanced section who are about a mile in front of us were shelled one morning for 2 hrs & had to move a few hundred yards.\n","130":"\n\nIt has been raining for last few days, intermittently. There was a very heavy bombardment last night over on the coast sector in which the navy participated.\n\nWe advanced some miles this morning capturing some hundreds of prisoners & the village of Mulebis .\n\nHad an issue of Australian butter (¼ lb each) today in lieuof bacon & also rabbits, we get these twice a week now & this will continue throughout the winter.\n","131":"\n\nLast night it simply poured for 3 hours or more & about 1 am our Bivvy which was situated\n\nin a wadi was flooded out. The water had been damming up at the back of it for some time & when it burst a torrent of water came rushing through the bivvy.\n\nAll I had time to grab was my breeches & cardigan jacket. Everything else was soaked including blanket, overcoat, tunic etc. My mate was just as badly off. He managed to get into a bivvy with some chaps until morning but I sat shivering in the Command post until day light.\n\nHad no chance to dry anything as it rained during the daywe could not even find a dry place to pitch our bivouac. During the afternoon we moved up into some caves on the side of the hill that our guns were below.\n\nWe lit a fire in here to try & dry our clothes but the smoke could not get out as there was only one entrance & it faced the wind so that we were nearly suffacated.\n\nHad to sleep the night there without anyblankets but it was dry which was some consulation.\n\nThere had been a general retirement by the enemy for the last couple\n\nof days for about 5 miles & we are hardly in range now.\n","132":"\n","133":" was the most miserable one that it has so far been my lot to experience. It rained all day practically & was very cold besides & we have had no mail since leaving Karm.Had bully & biscuits for dinner today.\n","134":"\n\nIt fined up yesterday so we got a chance to dry our clothes & blankets etc & do some much needed washing.\n\nRations are very short now owing to the railway line having been washed away & to the transport difficulties. The roads from here into Ludd are simply quagmires & the waggons have great difficulty in getting through it.\n\nThe roads can not really be called such as they are just tracks across ploughed land which is very soft & of a clay nature. It retains the water which gathers in great pools.\n\nAbout 15 men slept in our cave last night but it was too many as there is no ventilation in\n\nit though there was room enough for 20 men.\n\nThere are a lot of bugs in these caves which bite during the night & suck blood out, leaving a great black mark about the size of a three penny bit. Several of the chaps got covered with these, including my mate but I did not get any of the bites luckily.\n\nWe got out of the cave today","135":" & pitched our bivvy under a tree on top of the hill.\n\nOn","136":" we left for a position up the coast beyond Jaffa. To go to it across country would have only been about 7 miles, but we had to go round by the road to Ludd & Jaffa, as it was to boggy going across the plain.\n\nCamped 3 miles on the Ludd side of Jaffa the first day on the main road from Jaffa to Jerusalem. To get to this we had to get through some awful mud & slush but from now on the way will be much easier.\n\nNext morning","137":" we pressed on passing through Jaffa, without stopping or having a chance to see anything of it. The country around Jaffa is very rich & covered with orange\n\norchards. I have never yet seen oranges so prolific as in this locality & we no longer buythem as we can have them for the taking.\n\nThere are thousands of troops billeted in Jaffa which would bevery comfortable over the winter.\n\nThis quite a treat to see European women again with their nice white clear skins & decent clothing which makes a pleasant contrast with the native women.\n\nThe Europeans are mostly Jews & some are Germans there being a big German colony only a few miles north of Jaffa.\n\nThere are some nice buildings in the town & the streets are very clean, being cobbled & the footpaths asphalted.\n\nWent about 5 miles beyond the town & halted until sunset as we could not go the remaining 3 miles into our position until after dark. We got into position about 9 pm & turned in.The last 5 miles was through very heavy sand & our horses were absolutely done.\n\nIt took 44 of them to pull one gun into its position whereas at ordinary times 12 could do it easily.\n\nThis position is in the middle of an orange grove flanked on one side by almond orchards extending to the right for some hundreds of acres & on the other side by a Eucalyptus grove. These tress had all been imported from Australia & were being laid out in groves.\n\nIn front of the guns, about a mile, is the Jewish colony & village of Mulebis .\n\nThere are any amount of oranges to be had, just for the picking of them & we don't stint our selves either. All the orchards are irrigated during the summer months as it is so dry then & the soil retains no moisture so that the trees would soon die.\n\nThe water is stored in huge wells about 60' deep. The side of these have to be bricked to prevent them from falling in. The water is raised from these wells by means of pumping plants which are very numerous & it is distributed over the land by means\n\nof pipes. Most of the pumping plants were rendered useless by the retreating turks who took away some of the necessary parts. All these engines were of English manufacture.\n\nWent up into the village today","138":" & was rather disappointed in it. It is a scattered place nearly all the houses being made of wood. Some however being made of stone with either wood or tile roofs.\n\nThe people are all Jews & the universal language among them is German while only a few speak French. We can but quite a lot of things in there as dates, nuts, candles etc but everything is very dear. Change is very plentiful however which is quite a surprise to us.\n\nI got into conversation with one chap who had travelled a good deal as a sailor & who told some interesting facts about the Turks. They have only one meal a day it seems, consisting of some black bread made from ground Dura (a grain) &\n\na bowl of soup. They never give them any other regular rations & so they take these from the natives. This dura our people only use for feeding to the camels. It seems that the Turks were so short of fodder that they had to withdraw their cavalry from down Gaza way & send them up near Jerusalem.\n\nWhen they started to retreat from Gaza the German officers attached kept all the motor cars for them selves & the trains for their staff & belongings etc. The Turks got angry at this & at several places pelted them with stone & even fired on the Germans.\n\nOnly for the Germans among them & the Austrians on the guns they would surrender in hundreds. Tis these Germans & Austrians too who make them put up as much resistance as they do.The German General in command out here could not get on with the Turks & went back to Germany.\n\nOn the","139":" day in our new position my mate went down with fever which I also contacted a couple of days later.\n\nOn the","140":" day down my mate got up & went to a Hospital in the village, where they kept him for a few days & then sent him down to Jaffa. They did nothing at all for us in the battery, & did not even get a doctor down.\n\nI got up on the","141":" day but was very weak. Every week after this for about 6 weeks I would go down for a couple of days & when I got up again would be as weak as a chicken.\n\nThe doctors don't know exactly what the disease is but I reckon it was caused by the bites from the bugs. Since then men have alwaysbeen prohibited from sleeping in caves as that iswhere the disease originates.\n\nI have not seen a sickness that weakens one so quickly. I must have dropped over 2 stone in weight through it.\n\nHave seen a few air scraps here lately in all of which our machines came out winners.\n\nThe enemy shelled the village one day causing about 40 casualties, most of which were civilians.\n\nFor the remainder of that day there was a long string of cilvilians with their goods & chattel making for Jaffa.\n","142":"\n\nWas reading in an Australasian an account of tthe mosaic work that used to be at Shellal & which is now in Australia.\n","143":"\n\nTis becoming a regular thing now to have places up near the line where the troops get their blankets & clothes disinfected regularly & where they can have a hot disinfectant bath every 10 days or so. There is one in Mulebis that we go to.\n\nThe object of it is to keep down lice which are very plentiful in winter & which are supposed to cause cholera. As cholera is fairly rife up this way we have to be inoculated against it every 3 months.\n","144":"\n\nThe almond trees are in bloom now making a very pretty sight indeed & what a few weeks ago was a big area of seemingly dead trees is now a mass of white. There is hanrdly a piece of bare ground about now.\n\nAll the almond & orange orchards have just been ploughed giving theground a very fresh appearance. One cannot help noticing that the fruit trees are remarkably free from diseases. The oranges also never had any scale on them.\n\nThe ploughs they use up this way are the small type of orchard plough we use at home, but differ in this respect that they have only a single handle, which makes them very easy to handle. The soil is a sandy loam & is very easy to work.\n\nThe rainy season is drawing to a close now & ought to be all over in a month or so. All the rain comes from the S. West & comes up very rapidly. I have seen the sky without a cloud visible & then it be raining inside a quarter of an hour.\n\nOur Air Service has undergone a remarkable change during the last 3 months & we are absolutely superior in the air.\n\nOur Nieuports & SE 5's get all over the Huns & average at least one a day at times for some considerable time. We have quite a lot of anti air craft guns here also which give the Huns a very hot time & their barrage stops them every time.\n","145":"\n\nMoved up to a position in front of the village, only 1,500 yds behind the line. There is a battery of 18 pounders alongside us & on the other side","146":" Heavies also 60 pdrs. All these guns are on a 200 yds frontage.The field battery is going up closer for the stunt.\n\nThe enemy shelled us at 4 am on the morning we pulled in & tis likely to be a hot shop.\n\nThey have given us a dugout for the Huns, the first we have had. It is 6' x 6' x 6' with corrugated iron & 3 tons of earth on top.\n\nWas relieved the next afternoon to go on leave. Stayed at the 113 Sqdn aerodrome that night at Sarona only a couple of miles out of Jaffa, as we had to bring in another chap next day from a battery over near the coast.\n\nNext morning set out about 7 oclock for the battery & on the way out watched our barrage being put on a big hill they wanted to take. This is called Medjel Yaba .\n\nWe got into the aerodrome about 30 miles down the line, at 4 pm, having done the last 16 miles with a broken spring (we were in a Ford car).\n\nNext day heard at the 'Drome that the stunt had been very successful - 400 prisoners taken. Some machine guns & an advance of 3 miles on 11 mile frontage.\n\nWe buried 400 Turkish dead & yet only sustained about 2 casualties ourselves, due to the artillery fire which was very heavy.\n\nI expect to be in here for some days before going on leave as there are 2 away at present.\n","147":"\n\nLeft Medjel Stn (near the drome) on night train arriving at Kantara next morning. Slept in open truck but had a fair amount of room.\n\n\n\nWent on to Port Said by midday train as I wanted to see Dr Wood at the","148":" A.G.H. When I arrived there I found that he had not been to the hospital at all.\n\nHad a look round the harbour at the shipping etc, went on board a French torpedo boat & had a look round. They are exceedingly small things of about only 100 tons & I would not like to go to sea in one for anything.\n\nAlmost all the ships were painted with broad stripes along the sides which rendered them almost invisible a a few miles distance.\n\nWe had a sail for a while in a small yacht & went out to visit De Lesseps Statue. Saw several of our submarine chasers in harbour. They are very fast motor boats mounting a small quick firer in front. They only have a crew of 2 officers & 6 men.\n\nPort Said is a very dirty, dusty, uninteresting place with practically nothing to see excepting the shipping. Went to Cairo by the evening express 6.30 & got there at 11 pm.\n\nThe trams in Port Said are very much behind the time. They consist of only an old fashioned tram on rails drawn by 2 very insignificant donkeys.\n\nStayed the night at the New Khedival hotel & next afternoon went on to Alexandria by the 4.15 express. Arrived at Alex at 8 pm & stayed at the Windsor Hotel. It is the only English hotel in Alex is very nice & comfortable & costs 10\/- per day. They are not allowed to charge soldiers more than 10\/- per day by order of the Military Authorities & it is quite enough too.\n","149":"\n\nWent out shopping today as I had quite a lot of things to get. Shopping done properly would take a considerable time. To get an article at anything like its proper value you would have to go to 2 or 3 shops & find which is the lowest in price. They all have their own prices forsimilar articles.\n\nOne of the chaps wanted a certain kind of mirror &\n\npriced it at 3 shops. One charged 12 PT for it another 14 & the third 20PT & yet the mirror was exactly the same in all cases.\n\nThe same thing applied we found to many other things. They often have special prices for Australians too as they say we have more money. This is not really correct as we cannot draw more than 3\/- per day (L Horse 2\/-) but when our chaps do have any money they throw it about more than the Tommies.\n\nWent round the Harbour in a sailing boat one morning & took snaps of various things. Saw a big tramp with a huge hole in her side where a torpedo had hit her but in spite of this she had managed to get into port. Saw another steamer from which some one had removed the sea valves causing her to settle down. She had been down 6 weeks when I saw her but efforts were then being made to raise her.\n\nWent round some of the oldforts that had been sadly knocked about in\n\nthe bombardment of 1881. The walls of themwere very solidly made & were as much as 7' thick in places but they would last no time against modern H.E. shells.\n\nWent to the skating rink one afternoon. It was the first time that I had ever been on skates & in the first 5 minutes or so, I had about 12 busters. I began to improve however after a while.\n","150":"\n\nWent out to see the Catacombs this morning. These have only been excavated for the past 18 years. The lower catacombs were flooded from soakage from a lake near by.\n\nWent out to Nouza gardens the same afternoon with my mate & 2 Aus Sisters who were down in Alex on leave. They were very nice indeed & it was a pleasure to meet & talk to some Australians girls again. One of them was engaged to a young Officer who used to be in our Regiment & has 3 brothers in it.\n\nI was one of these the Major who recommended me for the M.M.\n\nSpent a really enjoyable day with them & after tea took them for a long motor ride.\n","151":"\n\nWent to church this morning to St Catherines Cathedral. It was Palm Sunday & the church was fearfully crowded. I went away & came back an hour later & found it nearly as bad then. Went to Benediction the same evening.Today was the first service I had been to since last August before I left the regiment.\n\nWe went to the Museum this afternoon but did not think a great deal of it. It is not nearly as big nor as interesting as Cairo Museum.\n\nLeft Alex on 8.15am train on","152":" & though we only had","153":" class tickets got into","154":" class carriage as soon as the train left the station. At Ben Ha we detrained & 5 minutes later caught another train going from Cairo to Port Said.\n\nSaw the 2 nurses we had met at Alex in a 1st class car & they invited us in. We got in & were not pulled up during the whole of the\n\njourney. Also had dinner on board the train in the Dining Car it costing us","155":" each.\n\nReached Kantara at 3 pm & at 6 left on the leave train across th desert. It consisted of open trucks with a rough boarded roof to break the power of the sun. We were packed in like sardines, 35 men per truck with hardly room to move & not much chance of sleeping.\n\nArrived back at Medjel next morning at 8 am. I had a great time during the week I was away living well & eating well but the journey back knocks all the benefit out of one.\n","156":"\n\nSaw MickyTuson & Bob Stinson last night as they camped near the aerodrome for the night en route for the front again, after some months \"spell\" or so called down at Gaza.\n","157":"\n\nHad a fly this morning. Went up in a British Fighter & was only up a quarter of an hour when we had to come down owing to engine trouble.\n\nWent up again in about 5 minutes time. We went up to about 8,000' & then the pilot signalled that he was going to do a stunt with me. Accordingly I gripped the rope inside the cockpit & the next thing I knew was that my heart seemed to come up into my mouth & we were falling at an awful rate, the machine twisting round & round.\n\nI learned afterwards from the pilot that we had done a spinning nose dive for 3,500'. When we came out of the dive I was violently sick for about 5 minutes & had no interest in anything for the remainder of the flight. I felt weak & giddy on landing but a good dinner fixed me up.\n","158":"\n\nLeft this morning to rejoin the battery which we found was still at Mulebis but was to move the following night for Medjel Yaba about 13 miles by road which we had only taken the day I went in on leave.\n\nOur position is at the foot of Medjel Yaba which is a village set\n\nnaked on a big hill.\n","159":"\n\nSaw an air scrap just in front of Medjel today, when 2 Huns & 1 of our Nieuport Scouts came down.\n","160":"\n\nThere was to have been a big stunt here today but it was put off at the last moment for some reason or other.\n\nJohnny has any amount of guns here now & nearly every morning wakes us up with an early morning drum fire.\n\nThe start of things in France may have something to do with the suspension of operations.\n","161":"\n\nTis rumoured that Johnny is to attack tomorrow to try & retake Jaffa. Everyone seems to have the wind up completely, why I don't know & our guns have been withdrawn to a position 2,000 yds in rear of Medjel on account of this.\n\nWe are just on the edge of the hills here & the hills are covered with stones of all sizes. To our left is a valley which runs down to Ludd. This is about 4 miles wide, is very\n\n\n\nlevel & it is through here that Johnny was expected to go as we had no guns & very few infantry on it. All the guns from both sides of the plain however were trained & the gunners stood to all night & at the waggon lines the horses were ready harnessed up all night.\n\nThe Field hospital behind us moved back 3 miles & the Group went back the same distance.\n","162":"\n\nMoved over to a position N of Mulebis & about 4 miles from it. We are beyond the Ajua River & only½ a mile beyond thefront line. We have a good natural cover however as we have our bivvy pitched in a wadi & the guns are on the bank of it.\n\nWe expect to get shelled here anyday as we have not got much cover in front of the guns to hide the smoke.\n\nWe travelled at night as usual & did not get into position until just before daylight. As usual we got stuck but managed to get out of it some how.\n\nThe country here is quite different from Medjel Yaba. Instead of rough rocky hills we have undulating sandy country covered with an abundance of grass & weeds.\n","163":"\n\nA Hun came over low this morning & set fire to two balloons suspended a mile or so in our rear. The occupants jumped out & landed safely by means of their parachutes.\n\nAs he dived at the balloons the Hun fired tracer bullets (incendiary) which caused the balloons to burst out into flames a couple of miniutes later. They were entirely burnt out before reaching the ground & all that was left of them was a big trail of black smoke in the sky.\n\nOur anti aircraft guns opened on the Hun but their shooting was most erratic. Tis usual to pull the balloon down on the approach of Huns but they must have been caught napping this time as no attempt\n\nwas made to get them down. Another balloon went up next day but was pulled a couple of days later & has not since gone up.\n\nThe reason is that we have not got enough antis here to protect them as some were sent over to the Jordan where the huns have been very busy against our L. Horse lately.\n","164":"\n\nWe were shelled today by a12cm gun. The 3rd shot was a direct hit on 1 gun & split the buffers apart. It could not have been a neater hit. 8 shells came over all together & all of them were very near the gun.The Sergt-Mjr was wounded. The gun crew was off the gun at the time or else theywould have all been wiped out.\n\nNext night we moved to a position about½ a mile away to our left rear & the battery whose place we took went into our position. They have been frightened to fire since going in there. (Our gun had to go\n\n(We are only 3 miles from the sea here) away the same night as it was knocked out & a week or so later we got one from our other section which has got a new gun.\n\n16th\n\nWe were shelled here today shrapnel & H.E. No damage done but some of the shells burst among the mens bivouacs & one went 25 ydfrom the gun.\n\nMay 20th\n\nThere have been a lot of changes on this front during the past 6 weeks. The 52nd,","165":" 74th & Yeomen Divns have gone to France while the","166":" &","167":" Indian Divns have taken their place. There are still more Indians coming up the line & down below there are also a couple of Divisions of Indian Cavalry.\n\nThe Indians are not much chop, the Ghurkas being easily the best of them. To every 3 battalions of Indians they put 1 of white troops & the Indians oftenclear out & leave the whites in the lurch. The Indians are good in attack but\n\ncannot stand heavy shelling. Tis rumoured that this front is to be held by Colonial troops & that the Australian Troops are coming back here & relieving all the English troops here. I wish it were true but one cannot believe all one hears.\n\nTis remarkable however how many of these rumours do come true. For instance we heard sometime ago that the Indians were coming here & were going to relieve the English Divns.\n\nNever get any news now as we are forbidden to take any enemy or Allied press on the wireless & no news is sent out here by our own people. We take the German press sent out by Vienna at 10 pm & get it translated by a corporal in the battery who speaks German & French fluently.\n\nWe never post it up as it would put our show away. Tis the only way we can ever learn anything that is going on on \nthis\n front even except in our immediate locality.\n","168":"\n\nThe River Auja has been put in bounds now for swimming & so we go down whenever we get the chance. As we cannot go together because one must always be at the stn during the day, we have an afternoon off in turn. The river is only half an hours walk from here. The river is a narrow swift running stream, almost too strong to swim against & not very deep, except in places. It is quite a treat to be able to get a decent swim.\n","169":"\n\nHave since learned that the Auja River has its source in some underground springs & an underground river which emerges at an old castle about 3 miles away. This accounts for it running so fast.\n\nFor the last couple of weeks there has been a plague of locusts here (Eastern plague locust) there being thousands of them & as a result of their ravages the herbage is dying off. They are about 1¼\" long - 2\", some having very short wings others having\n\nfull size wings, which are transparent & of a pinkish colour. When disturbed they rise & fly about 7 or 8 yards, very rarely going more than about 10 yds at one time. They have immense jaws & their hind legsare very well developed for jumping purposes. They are coloured like sand.\n\nIn the war news we have been receiving from Vienna during the last few days the Germans claim capture of Soissons & many other towns, 45,000 prisoners, 400 odd guns, thousands of machine guns & tremendous quantities of war material. Also the outer forts of Rheims have been taken & the city is almost surrounded. Am expecting anyday to hear of the capture or the capitulation of Rheims. They claim to have pushed the French back about 15 miles.\n","170":"\n\nDuring the last week or so we have been catching fish down in the Auja River, my mate caught a dozen one morning averaging abour a pound. A couple of\n\nmornings later I caught 6 including a big cat fish or mud fish weighing about 4 lbs. The fish are either carp or perch we are not sure which. Personally I think they must be carp. For bait we use locusts & fish with a rod & float. The river teems with fish.\n\nBetween fishing & swimming one can get some sport & diversion from the monotony of the work here. We go down every day now one spending the morning & the other the afternoon & next day vice-verse & so on.\n\nThere have been a couple of stunts on here during the last 10 days there object being to lessen somewhat the great area of no mans land excisting at present (about 3,000 yds) & to deprive the enemy of some of his best observation posts.\n","171":" far all objectives have been attained with comparatively slight losses, & consolidated against all counter attacks. The enemy did not like losing some of these points & in one case counter attacked 7 times.\n\nPrisoners amount to about 200 for both stunts but his losses due to\n\nour artillery fire in first stunt were very heavy amounting to at least 1,000.\n\nJune 23rd\n\nYesterday afternoon went to see the","172":" Divn monthly race meeting. Managed to get a horse from the groom of the adjutant of 261 Bde RFA (Jocks) & so rode over to the course about 3 miles over.\n\nThe races were very successful & well managed. The horses were nothing very extraordinary, there being only a few real good ones. There were 7 races in all there being plenty of entries & as many as a dozen or more starters in some races.\n\nThere were no bookies present, the totalisator being in vogue here. Considering the circumstances it was fairly successful. There was not a great deal of money about & as the favourites came in in most cases the dividends were not very high.\n\nS Wootton was riding but had a day off today. He has been very successful however at recent meetings. I did a little betting losing£1 on the day.\n\nThe distances mostly were short & the weight very high - catch weight over 10 & 11 stone. The main race - Jaffa Cup was a distance of 2 miles.\n\nAbout 6 pm a Hun came over to have a go at the balloon just behind us. Our anties put up a very heavy barrage round it but he was determined to get it & made 3 attacks on the balloon, the last being successful.\n\nI never expected him to come out of the barrage again as shells were bursting all round & over him & his machine must have been riddled. Twas a miracle almost that he survived the barrage.\n","173":" of our scouts came up as he attacked the balloon the","174":" time & one of them chased him home but could not catch him though he was gaining on him rapidly. The Hun flew very low & landed in a wadi a few miles inside his own lines the machine in all probability crashing. The pilot must have been wounded as the machine was wobbling a good deal going home.\n\nThe pilot was a very brave man & deserves all credit for his bravery but I don't think he will feel inclined to repeat the performance for some considerable time after the hot reception he received, our battery fired on the machine later on as one of our machines reported a large crowd round it.\n\nWhat the result was we don't know as it was getting dark. Even if our shells did not get it, the machine must have been so badly damaged, especially as it crashed, as to be be no longer serviceable.\n\nThis act was in retaliation for a shoot by our battery during the afternoon withballoon observation on an enemy motor transport convoy - 5 lorries being smashed up by direct hits & others damaged - a really good bit of shooting.\n\nJust before dusk an enemy machine was forced to land in our line due to engine trouble - over near the coast which somewhat sets off the preceeding event.\n\nAnother balloon went up within half an hour of the first one's destruction & has been up all day.\n\nA few days ago one of our scouts went over the enemy 'drome looking for fight & 4 enemy machines came up after him. He shot down 2 of them in flames & the others not wishing to share the same fate cleared off.\n","175":"\n\nWent to Jaffa this morning - it being about 2 hours ride distant. I had my heavy winter clothing & was in a bath of perspiration practically all the time I was in there.\n\nWas very disappointed in Jaffa as it did not come up to my expectations. The shops had a very poor supply of goods with very little variety. In fact it took me nearly 4 hours before I could get any fishing tackle. Went all round the town including the seafront of which I took several snaps.\n\nThere is really no harbour, ships having to lie out some distance, their cargoes being brought in in surf boats which come through a break in the reefwhich lies about\n\n¼ of a mile from the shore. In rough weather ships would have to put out to sea I should think.\n\nThere are only a few decent buildings including the Town Hall & a couple of buildings now being used as hospitals. Visited a nice but small Catholic Church in the town the first church I have been in this side of the Suez Canal.\n\nQuite a big part of the town is out of bounds to troops but I did not let that hinder me from seeing anything. A Light Railway runs from the landing place through some of the streets & thence on right up to the front here doing a good deal of useful work & saving a lot of motor convoys up this way.\n\nLearnt from some men of the Camel Corps that that body has been disbanded & converted into a new Bde of L Horse & to be armed with swords in addition to their rifles & bayonets.\n","176":"\n\nWe have been expecting a Turkish attack now for the last week or so but as yet it has not eventuated. They are expecting gas this time & have taken all precautions against it. We have even overhauled our gas masks in case they may be necessary.\n\nA Hun came over some days ago for the Balloon but was driven off by the anties. He evidently hoped to get in unobserved as he had rings on his lower planes which is contrary to all principles of the Hague Convention & if he was brought down could be shot as a spy.\n\nThis act was futile as he could not conceal the fact his machine was much different in appearance to ours & his engine was more powerful or at least made a much greater noise than our Scouts.\n\nOur people have been taking great care of the balloon lately & pull it down immediately\n\non the approach of Huns. Also in the evening when they bring it up close to the line there are two scouts doing a constant patrol around it.\n\nThey have become very keen lately as regards taking any enemy or allied press & promise all kinds of severe punishment to any offenders caught. We have had several officers around lately & so we have decided to lay low for a time & have put our coil away out of sight. We were told to destroy it but cannot see our way clear to do that.\n\nAnyhow tis not worth while risking a court martial just for sake of getting a little enemy press.\n\nJuly 25th\n\nAbout a week or so ago the German division attacked over near the Jordan. They were heavily replused & we took 350 of them prisoners also 150 Turks. This will mean a very serious blow to their prestige among the Turks.\n\nJaffa was shelled some days ago by an enemy submarine\n\nwhich fired 6 rounds into the town with what result I don't know. They have also been shelling Ludd lately at a range of between 12 & 15 miles. Don't know the calibre of the gun.\n","177":"\n\nSeveral nights ago we had an all night bombardment of Johnny's roads & back areas as they were expecting him to withdraw from his present position which has been made almost untenable by our artillery concentrating on his roads & interfereing very seriously with his transport.\n\nWe have splendid observation on his roads etc & every convoy that goes along is shelled. Our battery alone fires practically all day on transport, motor lorries, infantry etc, going along behind his line.\n\nTis expected that the Germans are to be withdrawn from this front also a lot of the Turkish artillery which is manned by Austrian & German\n\ngunners. If this happens it will leave him seriously weakened on this front.\n\nGreat preparations are going on now behind our line for the next big advance which is expected to come off next month. Two fine metal roads have been built practically up to the front line, one right on the coast the other a few miles inland.The Light railway has been pushed up to within a mile or so of the line.\n\nThere are great masses of cavalry down near Jaffa, all waiting for the push.The Brigade of Aus Cav is formed now & are training to use swords. There must be easily 30,000 cavalry from France & Meso, Yeomanry & L Horse.\n\nHave been doing a lot of fishing lately & have been averaging about 10 a day for last week or so. We are the only two in the battery who seems to be\n\nable to get any decent results though quite a lot of them try it.\n\nHave been getting great news during past few weeks from France & this morning heard that we had taken another 17,000 prisoners & 300 guns with great quantities of war material.\n\nReceived some mail a few days ago dated","178":" Last mail I had prior to this was of","179":"\n","180":"\n\nWe have 2 Handley Pge machines out here now. They flew from England to Egypt their actual time in the air being 36 hrs. One of them is to be sent to our Sqdn.\n\nSome mornings ago we had 7 huns over here. Two machines from our sqdn met them & brought down 4.\n\nOn","181":" of thismonth 2 of our machines tackled 4 up near Haifa bagging 2 of them.\n\nSent a cable on the","182":" to Dr - for£10 to go on leave.\n","183":"\n\nOne of our machines brought down 2 Huns one day last week. A Hun machine has had 2 attempts during\n\nthe past week to get the balloon but without success. The machine comes over with things on its wings looking like one of our machines.\n","184":"\n\nOur battery which has been separated (2 Sections) since Xmas joined up last night & we are staying with them.\n\nThere is a huge concentration of artillery going on along this Sector of the front. On a short front of about 7 or 8 miles we will have about 4 Bdes of Heavier (20 Batteries (4 guns each) & about 180 field guns. (There were about 400 guns in all.)\n\nFurther to the right in the hills by Medjel Yaba are some French 75 batteries. There is a French Division somewhere over there - The Light Horse - Anzac Division (including my old Regt) lay some 4 or 5 miles in rear of us.\n\nThe position we are in at present is a very open & exposed one & we are not to fire until the stunt starts. A heavy battery was shelled out of here about 5 months ago - being under direct observation from our right flank.\n\nWe are using a lot of new ideas out\n\nhere this time as motor machine gun batteries, aerial torpedoes etc & our flying machines are to machine gunning of troops & transport on an extensive scale having guns fitted for that purpose.\n","185":"\n\nFor past few days our fighting machines have been doing an all day patrol for Huns & guarding the Balloons. Tis our usual procedure to sweep the skies of huns before a stunt starts.\n\nWhile up the river fishing yesterday I saw a fine big beaver - the first I have ever seen alive either in captivity ot in its natural state. Did not have any firearms with me so could not shoot it though I would like to obtain the skin of one.\n\nThere are a fair number in the river but this is the first one I have seen. It came to the surface only a couple of yards from where I was sitting & remained on top for about½ a minute. There are any amount of tortoises in the river varying in size from 3\" to 2' across.\n\nthe back. Crabs also are very numerous along the banks of the river & I have seen them as much as 8\" long.\n","186":"Winter Campaign starts.\n\nAt 0400 this morning we started on the winter campaign. There was an intense bombardment from about 400 guns at least lasting an hour & lifting at various intervals. The first objectives were quickly gained & prisoners came over in hundreds.Have not yet any idea as to our haul of prisoners & guns but would be inclined to put it at about 2,000 prisoners & 40 guns.\n\nOur aircraft played a great part in this day's work, especially in artillery cooperation which resulted in all hunbatteries being quickly silenced or put out of action.\n\nOur bombing machines have been going backwards & forwards all day but not a hun machine have we seen, our air supremacy is absolutely over whelming.\n\nOur position tonight is about 5 miles in front of the position we occupied this morning. We moved forward at about 11 am.\n\n\n\non our way to our present position (alongside Kafa Saba in a fig orchard) we passed a captured battery of 4:2\" hows & in the same wood as we are in is a 4 gun battery of 77 mm guns. About¼ mile away is also a 5.9\" How.\n\nThe ground all around the guns here is simply pockmarked with shell holes - the result of this mornings work. Our artillery fire today was overwhelming & played tremendous havoc among Johnnies positions.Infantry men I have met say our Barrage this morning was absolutely the best they have ever experienced.\n\nWe are on very short rations of water for first few days only 2 bottles the first 4 days equal to a pint a day. Tis so hot trudging along that one could easily drink a gallon.\n\nMy mate & myself caught two turkish ponies this afternoon & are going to ride them during the advance, mine is a small Bay Turkish stallion & very sturdy.Tonight went over to Kafa Saba where we watered our ponies, had a good wash & refilled our bottles.\n","187":" far today we have captured Jiljulia , Kalkilih , Kafa Kasam, Kafa Saba, Bir adas & are getting well up into the hills. The L Horse are pushing up\n\nthe coast & we hope in a few days to have the whole Turkish army surrounded in the Mts.\n","188":"\n\nHad hardly got into bed last night when we had to pack up again & go on another 6 or 7 miles as the enemy was retreating so fast as to get out of range. On the way passed through Kalkilieh, a fair sized village & the Turkish railhead.\n\nWent into position just near a place called Hableh & alongside our position are 3 enemy field guns, the gunners of one of the guns having been bayoneted at their guns.We are in the hills now & tis very rocky &uneven.\n\nThe enemy seems to have retreated so fast during the day (yesterday) that they don't know exactly where he is.\n\nDid not get a wink of sleep last night as we did not get into this position until just before daybreak. One big advantage about travelling at night now is that the moon is almost full. We did not fire a shot all day as we were probably out of range when we got here.\n\nJust heard that our L. Horse at 10 am this morning were 10 miles from Haifa & that yesterday this Corps alone -","189":" - took 5,000 prisoners & 70 guns.\n\nWe are at least 20 miles behind the front line now & expect to get a full nights sleep tonight.\n\nOur aeroplanes have been passing to & fro all day long in fours & fives, on Bombing Raids & still we have not seen a Hun machine. Our air service had gone a long way towards the success of the stunt.\n\nWe are not meeting with the water difficulties which they prepared for & its just as well pleased we are too that such is not the case.\n","190":"\n\nHave not left Habelieh yet & are not likely to do so for some days as we are hopelessly out of the pursuit. The infantry have been having a pretty rough time owing to lack of water, as it cannot be got up to them as quick as they advance & there is not much where they are now.\n\nAnzac Divn took Nazareth at 6 am this morning & Haifa is expected to fall at any time. Some German troops (Jagers) are fighting vey stubbornly here now, but all the Turk thinks of is flight.\n\nEvery gun the Turks had - 71 - between Hableh & the sea on his first defensive system were taken which shows how swift was our first blow & they must have been surprised as in any amount of places we visited the occupants, has been disturbed in bed.\n\nWhile here we are going to see as much of the surrounding country on our ponies as possible.\n\nTis 2 yrs today since I landed in Egypt.\n","191":"\n\nLeft Hableh this morning & went back to Kafa Saba to be nearer the water supplies. Stayed here 3 days during which time we traversed the country side for miles around on our ponies.\n\nSaw a lot of Turkish guns & at Kalkili there are 20 5.9\" Hows alone. Saw 4 guns - old pattern German Cannon mad in 1872, 3, 4,5 yrs respectfully, calibre 12 cm. Twas one of these that knocked our gun out last May. They are practically obsolete & resemble the old guns on the forts at Alexandria.\n","192":"\n\nMoved up to Tul Keram this morning - 10 miles beyond Kalkili . This is a fair sized railway junction & boast a native & a Jewish village. On the road up we passed about 3,000 Turks & Germans going down the line.\n\nHad some heavy rain today & we got a proper soaking.\n\nThe total number of prisoners now is 60,000 & the L. Horse are reported to be a few miles from Damascus.\n\nWe expect to be moving on again to Haifa in a day or so.\n\nSome German prisoners whom we have questioned say that the Turks let them down here & laughed at us for saying we took Metz. The last German news they had had was that they were only a few miles from Paris.\n\nThe prisoners are a very ragged lot indeed a great number not having any boots ever & in nearly all cases their clothes consist of patchwork of all kinds & colours of material.\n\nTheir physique is better than any previous lots we have captured.\n","193":"\n\nWe were to have started on a 4 days trek to Haifa today but the move was cancelled late last night.\n\nTwas read out on a general parade today that Bulgaria had surrended & handed over her railways etc. The news was taken very quietly, almost as a matter of course.\n\nTis unofficially said that Turkey has surrended also. Though not confirmed yet, I think it only a matter of a few days before Turkey gives in asher position is rendered much more critical by the caving in of Bugaria.\n\nGeneral Allenby a few days ago entered Damascus in state & Beirut is expected to fall at any time now.\n\nThere are 50 guns parked down at Tul Keram Station & this with the 70 we saw at Kalkili makes 120 on this coastal sector.\n","194":" of them 5.9\" Hows which is a much higher number than we thought he had as he never used more than two or three on our sector, though he had any amount of them. Some of them are brand new - made at Krupps in 1917.\n\nThe flies are awfully bad up here - a hundred times worse than they used to be behind our own lines & we used to think them bad enough then.In some German & Turkish camps I have visited, in parts you could hardly see the ground for flies.\n\nFleas also are very numerous & you have only to step inside a native house & you yet covered with them.\n\nOn our way home from Kalkili , we stopped for shelter from the rain at an old Turkish telephone exchange & in a few minutes got covered with fleas. Since coming here we have been kept awake long hours at night by them.\n\nYesterday we sprinkled all our blankets & clothes with creosol, which effectively got rid of them.\n\nWentthrough the town of Tul Keram yesterday but found it much the same as all such native places. Tis not quite as big as Ramleh.\n\nMet some Christian Arabs in\n\nthe town. They speak fair English & said they were very glad indeed to be freed from the Turkish oppression.\n\nUp to the","195":" the official number of prisoners was 50,000 & the guns 360. At the time of our offensive starting the Turkish forces here were about 100,000 strong & consisted of the","196":" 7th & 8th Armies. The 7th & 8th armies were absolutely annihalted while the remnants of the 4th army escaped across the Jordan into the barren regions beyond where they got a bad mauling from Arab regulars & natives who rose against them & tis doubtful if any of them will get clear evetually.\n\nWe have possession now of a large portion of the Hedjaz running from Damacus south which effectively cut off any Turkish forces in the Hedjaz .\n\nWe are all wondering now what will happen to the troops here in the event of Turkey giving in. The general concensus of opinion is that the greater part of the forces here will go to Italy or to the Balkans.\n","197":"\n\nReceived orders unexpectedly last night to proceed to Haifa (4 days trek) & left this morning at 0900. Travelled slowly during the day as the horses are weak on account of being on½ rations & camped at 4.30 pm near an excellent water supply, having come about 13 miles.\n\nTodays journey brings us near the end of the plain of Sharon & tomorrow we will be in the hills again. During the whole day we passed through cultivated land which had only quite recently harvested. The crop is not unlike sorghum in many respects & though I am not certain I think it is a grain called \"Doura\".\n\nHad a heavy shower of rain this morning shortly before leaving. The ponies are in great fettle & are picking up wonderfully.\n","198":"\n\nReveille was at 03.00 am this morning & we were on the road before 4.30, it being still dark. After the first 4 miles we halted for an hour or so at the foot of the hills. It was a very steep pull for a mile or so & it took about 2 hours to get all the guns & waggons etc up.\n\nAt the top of the hill is the Jewish village of Zimmeran . From here one can get a fine view of the surrounding country overlooking the Plain of Sharon for miles & miles to the south, on the west of the sea being only a couple of miles away.\n\nWe are camped at the foot of the Hills just beyond the village but still in the Pass. The country around here is very nice indeed there being any amount of olive orchards about & mimosa hedges along the road sides are out in bloom.\n","199":"\n\nYesterday we left Zimmeran at 4 am travelled about 10 miles & camped at a place called Atlit on the beach. From here the road runs within a couple ofhundred yards of the sea all the way to Haifa.\n\nAtlit is only represented by the ruins of an ancient palace which has evidently been a beautiful place in its time. The buildings covers an area of about 2 acres & some parts are in a fair state of preservation, one part in particular is a section of a wall standing about 50' high, about\n\n\n\n9' thickness & composed of big blocks of stone about 4' x 2' x 2'. The ruins stand on a point of land & on either side is a small bay.This must have been a jolly fine place at one time.\n\nHad two good swims yesterday & enjoyed it immensley. Also gave our ponies a swim. This is the first occassion this year that I have been in the sea.\n\nToday we left again at 4 am & only travelled 5 miles & then camped. We are only 2 miles from Haifa but cannot go through in daylight on account of the congestion of traffic.We are leaving at about 3 am tomorrow as we must be through it by 5 am.\n\nI think the real reason however is that they want us to go through unseeen by the inhabitants. Already a lot of spies have been caught in Haifa.\n\nOur horses are in pretty bad condition as they are only on½ rations or less. We have only lost 3 or 4 so far however which is good considering the conditions under which we have been walking.\n\nBy starting off at 4 am we can get most of the days journey done ere the sun gets very strong.\n","200":" far we are the only heavy horse battery that has come over the pass at Zummeran.\n","201":"\n\nCame to Haifa last night. Our guns are on coast defence just on the northern outskirts of the town until the proper 4.7\" coast defence guns come up.\n\nJust across the road from us & at the foot of Mt Carmel is our aerodrome which is extremely convenient for us. On the point of Mt Carmel range which ends fairly abruptly only a couple of hundred yards from the sea is a lighthouse, which is now being used by our O.P. as a lookout for submarines.\n\nThe hill towersover the 'drome & is fairly steep. Running along the slope to the top is a made up road which has a fairly steep gradient. It takes about an hour to go to the top, walking.Near the Lighthouse is a monastery (German one) but the occupants are gone now.\n\nThe Bay of Haifa is a fairly deep one & Acre can be seen very distinctly across on the farther shore. Ships can lay in very close to the shore, but there is only one small stone pier for a landing place.\n\nThis morning there was a big hospital ship in which sailed with a full cargo during the day.\n\nOn top of the hill are 2 German Krupp 15 cm (6\") coast defence guns (1898 pattern) which are manned by our gunners now.\n\nThe town looks well from a distance with its white houses & red tiled roofs rising on the hill side & boasts two or three fine big buildings.\n\nToday","202":" ascended Mt Carmel to see the Lighthouse & Monastery of Elijah which we were not allowed inside as there is a guard on it in the absence of the monks. A splendid view is obtained from the Lighthouse of the town, the Bay of Acre, & the town of Acre in the distance.\n\nAlso went out to see the 5.9\" coast defence Krupp guns about 2 miles along the top of the mountains, only one is in working order, the other being in course of erection. The gun weighs about 25 tons & has a range of 17,000 metres. It is also absolutely intact except for the dial sight which the Germans no doubt took away with them.It fires armour piercing shells.\n\nToday","203":" went through Haifa on way to River Makupta, 2 miles beyond the town. We tried to do some fishing\n\nbut without success as it was too shallow near the banks & we did not have much time in which to explore it. Tomorrow afternoon we are going to spend in the town.\n","204":"\n\nSpent the afternoon of yesterday in town but was disappointed with it. The lower part of the town near the water front & railway yards is very dirty & much the same as any other native place. The streets are narrow & when traffic goes through it has to go through one street & back by another as there is no room to pass.\n\nThe shops at present contain very little & in the markets one can obtain plenty of tomatoes fairly cheap, dried figs, pommegranits, water melons, eggs at 3 for 1\/- & native bread. Everything is very dear, prices for the Military being much higher than for the civilian population.\n\nThe European or German & Jewish quarter is in higher ground at the rear of the town & is very nice & clean with plenty of trees about - almond & olive & the streets of this quarter are all planted with trees.\n\n\n\nThere are 2 or 3 fair sized hotels & now being used as HQ's by the military. Some fine big buildings are now being used as Hospitals for our & Turkish & German wounded.\n\nThe waterfront presents a very busy scene as yesterday 5 cargo steamers came in & are landing large quantities of supplies by means of lighters.\n\nA big Hospital ship came in yesterday, filled up during the day & sailed this morning just after daybreak having emptied the clearing stations here. The sick & wounded were taken out on big lighters to the ship which was anchored out about a¼ of a mile.\n\nThere are any amount of religious institutions in the town & this morning I went to mass 0615 at a German Convent.\n\nThe bay is an excellent swimming place & one can go out as far as desired in quiet water.\n","205":"\n\nThis morning I spent in looking over the Carmelite Monastery of Elijah on the point of the mount. This is a fine building & contains some dozens of rooms. Prior to our occupation it was used as a German HQ's, the monks\n\n\n\nhaving been twice ejected. Before departing the Germans looted the whole place & many of the rooms were turned upside down & the contents scattered all over the floor.\n\nThe chapel is a very fine place indeed, the high altar being better than anything I have yet seen. At the top of the altar & slightly in rear is a statue of our Lady with 2 angels kneeling at her feet, one on either side. Immediately in rear of the altar is a big room used as a Choir Room & the whole statue of the Virgin & the angels could be turned by some mechanical means to completely round, to face this.\n\nBelow the altar & in the solid rock is a receptacle cut out, & which contains the bones of all deceased monks for some considerable time past. It seems that when a monk dies he is buried in a near by cemetry & a few years later his bones are disinterred & placed in this receptacle below the altar.\n\nThey had a fine library at the monastry & this has not been interfered with very much. There are plenty of evidence of recent German occupation in the way of notices in German\n\nposted up on walls, doors, etc all over the building. They must have been a working order I think, as in underground rooms we saw carpenters shops, paint shops etc, a spirit making place.\n\nThe monks cubicles were of a fair size & moderately well furnished with bed, table, chairs etc.\n\nIn front of the monastery is a statue of Our lady erected by the Chilian Govt.\n\nThe L House buildings were really the Palace of Abdulla Pacha though I don't think much of it as apalace, for an ordinary residence it wouldbe fine.\n\nWe are getting fresh meat & bread at last & tis a great relief to us. Half the Gun detachment are in hospital now & everyone else is very weak. I have not been at all well lately & put it down to the grub we are getting.\n\nOur broad gauge railway is up as far as Tul Keram now which ought to ensure a plentiful supply of fresh rations up here.\n","206":"\n\nThe weather has broken now, the last few days being very overcast & accompanied by strong winds. Have not had much rain however.\n","207":"\n\nThe Handley Page Machine flew up here today from Ramleh. As she came over the mountain she looked just like a great bird floating along. She is a huge machine & to look at her you would not think she would rise off the ground.\n\nShe has 2, 360 HP Rolls Royce Engines, a crew of 5 & can carry a ton of bombs. She is sobig that one of our big hangars which ordinarily will hold 6 B. Fighters is not big enough for her. To get her in, her wings have to be folded back along the fuselage & even then it takes up the whole of the hangar.\n\nShe is very slow in the air only doing about 80 miles & seems to move very slowly. Though slow & clumsy in manouvering she is heavily armed & at times mounts as many as 8 or 10 machine guns, which would make her a very formidable opponent.\n\nToday, she was to go on to our advanced aerodrome about 150 miles up with a load of about 60 odd tins of petrol & some oil. She is fitted with wireless both sending & receiving, the latter not having been used yet however.\n","208":"\n\nToday at 12 am an armistice with Turkey was to start. The news was taken very quietly here there being no demonstrations except tonight for a time when a lot of flares & fireworks were sent up. We came back into the 'drometoday having left the battery for good.\n\nTis rumoured that we are going to England (Wireless only) which accounts for our being withdrawn & I sincerely hope it turns out to be true but the war may be over\nby Xmas\nbefore we get to England.\n\nSome of our chaps while out bombing fish this afternoon killed a shark about 7' long.\n","209":"\n\nYesterday an armistice was signed with Austria.\n\nSome of the mechanics here put a 20 HP Ford engine into a confiscated Turkish boat, with excellent results, attaining a speed of as much as 10 knots.\n\nWent for a trip across the bay in her this morning towards Acre but was disappointed in not landing as we were limited for time. It was not very rough, just a swell but it made me sea sick - afterward however I was quite alright. There were 8 on board & the boat went exceedingly well.\n","210":"\n\nLeft the aerodrome this morning on the initial stage of our journey to England. There are 26 all told - wireless operators - & 5 (1914) men going home to Australia.\n\nWe set off at 6.30 am in 2 motor lorries & reached Tul Keram at 10 am, after a very quick but rough & dusty 3½ hours travelling.\n\nAt Tul Keram had to sit down until about 2 pm before we knew that we could get a train down at all. We are travelling in usual way all jammed in an open truck with our kit. Can see no hope of getting any sleep tonight unless it is sitting up, as we are so packed in with kit etc.\n\nSince we left here early last month this place has undergone a wonderful transformation. Our broad guage railway is some miles beyond here now, the old Turkish line between here & Haifa being used until our line gets through.\n\nThere is a great dump of Turkish guns, waggons, ammunition, etc here including about 40 odd 5.9\" Howt.\n\nWas not sorry to leave Haifa as the weather\n\nduring the past few days has been very windy & cold & also there has been a good deal of sickness in the Sqdn lately.\n\nGot a train at 6 pm for Ludd & another one there at 0330 for Kantara. Ludd station is a huge place now being nearly as big in extent as Sydney station. The trip from Ludd down was a very dreary & monotonous one & we did not get into Kantara until 1750.\n\nAfter travelling intermittintly since 6.30 am yesterday morning we travelled about 270 miles. Stayed at Kantara for the night & next morning early went into Moascat 25 miles further down the canal. At Moascat we went into \"A\". Details pending embarkation overseas.\n","211":"\n\nAn armistice with Germany was signed yesterday, the news being received here without much demonstration or enthusiasum. We are very seriously afraid now that our trip to England will be cancelled owing to the armistice.\n\nAll the 1914 men are down here now awaiting embarkation any day for Australia.\n\nThis afternoon a party of about 20 returned prisoners from Turkey arrived here in camp. They have had a pretty rough time in captivity. Some being taken on the Peninsula & they look aged & was worn as a result of their treatment.\n\nThey said that they only had 2 meals a day - grain - & that only for parcels & money from home could not have existed even. They are very anxious to get home & will be sailing in a day or two with the '14 men.\n","212":"\n\nThe 1914 men & prisoners of war sailed today from Suez leaving here last night. There are about 1,000 in all.\n","213":"\n\nA lot of 1914 menwere given the option of furlough in England instead of going home immediately. A batch of 50 left here this morning to embark for England via Italy.\n\nWe are not going & I think we must have missed altogether now. Was on guard some days ago (24hours) at the Venercal compound. There are about\n\n240 in it at present.\n\nMoascar has not altered much & is just as quiet as ever. There are pictures every night & boxing once a week. There are a couple of good restaurants in the Camp now, one run by the camp authorities & any amount of canteens.\n\nTis still fairly warm here but I don't do much swimming as the lake is not very clean now. Tis rumoured that the Squadron is coming down to Heliopolis from Haifa.\n","214":"\n\nWent to Church this morning in Ismailia on the occasion of a thanksgiving service. This was the first time that I had been in the Church at Ismailia. Twas High Mass & among the congregation were a number of Marines off a French Cruiser laying in the Lake at present.\n\nGeneral Allenby went through this morning to Cairo to receive a public welcome. The whole camp here was lines up at the Station as his train steamed slowly through.\n\nThere has been quite a lot of speculation\n\n\n\nlately regarding demobilisation & the method they will adopt. We are all firmly of the opinion here that they will get us out of Egypt as quickly as possible owing to the great amount of sickness among our troops.\n\nRoughly there are only about 15,000 Australians here & as we will be taking no horses back it ought not to require many transports to take us home.\n\nI heard that the","215":" Bde alone are shooting 700 horses at least 25%. This comprises all old horses & those worn out. The remainder will in a all probability be sold in Palistine or Egypt while some will be used for food.\n\nTis rumoured here that the Anzac Divn at present at Ludd will all be across the Canal by the","216":" & that on the","217":" the \"Ceramic\" will sail for Australia with a full compliment.\n\nA lot of reinforcements came here yesterday - Nearly 700 & went into isolation. They had been on the water 8 weeks & looked very bad indeed. About 200 are in hospital & several deaths occured from meningitis.\n\nThey had some hundreds of horses on board & on the declaration of the armistice had to go back to Bombay & land them as they are of no use here now & once they came into Egypt they could not leave it again.\n","218":"\n\nWentup to Cairo on","219":" for 48 hrs leave to get my money from the Bank. Had a very good time but regretted that the leave was not7 days instead of 2.\n\nCaught a very heavy cold yesterday & can hardly speak today.\n\nHad a big mail in some days ago & I got 14 letters by it.\n\nWe leave here tomorrow to rejoin the Sqdn at Ramleh. Am sorry to leave here as I was getting used to it. The grub could not be improved on & tis fairly warm & also we have done practically nothing since we came here.\n\nOne of the Handley Page machines left Cairo a couple of days ago to fly to Bombay via Damascus & Baghdad. This would be a very nice trip if one could manage to go on it.\n\nAs soon as I rejoin the Sqdn I am applying for leave to Jerusalem.\n","220":"\n\nArrived at Sqdn yesterday morning at Ramleh. We are the only remaining Sqdn up here now & I don't expect that we shall be here very long.\n","221":"\n\nIt has been raining continuously now for 2 days & the camp is just like a quagmire. The camp is not pitched on high enough ground & consequently the water cannot get away quick enough. Everywhere one goes the mud is inches deep but fortunately it is not very sticky.\n\nSome of the showers have been extremely heavy, once or twice accompanied by hailstones & I reckon we must have had at least 8\" of rain up to the present. Tis so miserable here, nowhere to go & all we can do is lay in our tents all day & read or sleep.\n\nLuckily our tent keeps the rain out very well but even so everything is so damp.\n\nWe were to have gone to Jerusalem yesterday, but the rain prevented it & it may be a week or more bre we can get up there.\n","222":"\n\nSome days ago several of us put in for 3 days leave to go to Jerusalem but were turned down.\n\nToday however a party of 24 of us went up in a lorry.Left at 8 am arriving in Jerusalem about 10.30. The first 6 or 7 miles to Latronwas fairly level going but after passing Latron we began to climb & practically continued to do so all the way to Jerusalem.\n\nAt some places there were some careful manipulation. The road all the way was splendid & very free from dust owing to rain during the past few days. All the main roads of this country are splendid ones, much better than any we have in Australia, over such distance & under such conditions of rainfall etc.\n\nThese roads have to be built up in places & are just wide enough for 2 lorries to pass comfortably. The country we passed through was very bare & except for olive trees in places, there was no vegetation evident.\n\nOn nearing Jerusalem you cannot see it until you are right onto the City as it is hidden by a hill & as you go round it & turn the\n\nbend you are in the city. We went straight through to Bethlehem about 6 miles south of the city as we would just have time to visit it & get back to the city for dinner.\n\nAt Bethlehem, which turned out to be bigger than I expected, the main thing of consequence is the Church of the Nativity, being as its name indicates, the birth place of Christ. The church has three parts, the Greek Othordox, Armenian & Catholic.We saw the manger & the place where the star leading the wise men stoppedover.\n\nFrom near by we could see across the hills & the Jordan Valley, the Hills of Moab rising in the distance. Could not see into the valley however or the Dead Sea as they are down between the two lots of hills.\n\nOn the road out is a private residence of palatial dimensions which cost nearly£20,000 to build. Also on way out passed the Solomon's Pool at which Solomon was supposed to have been crowned King of Judea.\n\nReturning to the City we dispersed for lunch arranging to meet at 2.30 near the Fast Hotel\n\nto go & visit the Holy City.\n\nOn first entering the city we secured the services of a Cook's guide to show us round for the day. This chap, an Assyrian, speaks about 6 languages & knew his job well.\n\nWe went to the Carlton Restaurant for dinner & had a 3 course meal for 15 PTS (3\/-), consisting of Soup, Meat Pie (a few chips of potatoes, carrots & beans with some mince between two small pieces of pastry) & for dessert 2 small cakes with a fairly decent cup of tea to end up.One would not pay 6dfor the same in Australia, but this was about as good a dinner as you could procure anywhere in the City.\n\nAfter dinner we went for a stroll round the outer or New City till itwas time to go into the Old City. There was not much to see except that there were some very fine buildings in the City the size & appearance of which rather surprised me.\n\nDid not have time to got out to the Mount of Olives or to the Garden of Gethsemeneh though I would very much like to have done so.\n\nThere are a fair number of shops, but\n\nevery second one sells curios etc of the Holy Land, supposed to be made here. Some of it is, but quiet a lot is made in Birmingham or in Germany.\n\nThe old City is entirely enclosed by a wall & has 2 main gates or entrances, the Jaffa Gate & the Damascus Gate. We went in by the Jaffa Gate & came out the same way not seeing the Damascus Gate at all.\n\nThere are guards on all the gates & soldiers are not allowed in or out except in parties and an officer or a YMCA guide while the civilians of all nations alike & creeds can go in or out at will.\n\nAt the Jaffa Gate is the town of David surmounted by a four faced clock. On entering the old City the first place of importance which we struck was the fine Lutheran church - which was opened by the Kaiser while on his visit here some years ago.Thence we went on through the Bazaar to the Church of the Holy Sepulchre.\n\nThe market quarter has very narrow streets entirely shut off from sunlight by the\n\nbuildings rising on either side which are shops & residences above these perhaps. There seems no lack of foodstuffs especially vegetables, (onions, cabbages, turnips, radishes, etc) oranges, in addition to the rice, nuts, figs, etc always more or less in evidence.\n\nWe went all through the Church of the Holy Sepulchre, which is beyond my powers of description. As at Bethlehem it was divided into its 3 parts Greek, Armenian & R Catholic.\n\nWe saw the Sepulchre, the place where the cross rested, the place where the Centurian watched the crucifixion from & was converted etc. A statue we saw was ornamented with about£150,000 worth of jewellry.\n\nAfter leaving this church we went along the Via Dolorosa to the Church of \"Ecce Homo\", which is really a convent of the \n\nHere we saw part of the old Roman road through Jerusalem which has been preserved also some games of the Roman soldiers cut in the floor, one of the nuns there explained all\n\nabout it to us talking at the rate of about 19 to doz.\n\nOver the Altar in the chapel is the inscription in Latin \"Forgive them father for they know not what they do!\" & which they have to say every day during Mass.\n\nLeaving here we went on to the Mosque of Omar raised by the Caliph Omar in 7th Century & which is the","223":" centre of importance in the Mohamedan faith. Before going in we had to take off our boots as no one is allowed in wearing boots or shoes.\n\nInside this mosque is a big stone with a hole in the centre which is said by the Mohamedans to be the place where Mohammed ascended to Heaven. The rock was supposed to have tried to follow him in. The Hebrews believed that this was where the sacrifices used to be held, the hole in the rock being to drain the blood away.\n\nAlso there is a part of the rock supposed to have been the imprint of Mohammed's hand. Also a casket containing 3 hairs reputed to be hairs of Mohammed.The Rock is surrounded by a Lattice work screen.\n\nThe Dome of this mosque is a beautiful thing, wonderfully worked. Near by is the Mosque of El Aska, which was originally a Christian church raised about the","224":" century but which was taken over by the Mohammedans & converted into a mosque. On the walls are written the names of the Caliphs.\n\nThe next place we saw was the Wailing Place of the Jews which was not very well patronised this afternoon however, we could see the Garden of Gethsemeneh & the Mount of Olives just across the way but time did not admit us seeing them at close range.\n\nA day is realy not enough in which to see Jerusalem thoroughly but as it is all we could obtain it is better than not seeing it at all.\n\nI am very glad now that I have had a chance to see the Holy City both old & new & the places of such world wide interest, where Our Lord spent part of His life & where he died for us.\n\nWe left at 5 pm & got back to the drome about 7 pm.\n","225":"\n\nSome few days ago the L Horse over at Rischon had a set to with the inhabitants of a village. It appears that a couple of natives were caught thieving in the New Zealanders camp & shot a Sergt-Major who died a few hours later.\n\nThe N Z's sent next morning an ultimatum to the Shiekh of the village to hand over the murderer before sundown, to be dealt with. This was not complied with & at sundown about 1,200 men of 2 Anzac Divn surrounded the village & after sending away the women & children set to on the men, killing over 90 of them with rifles, pick handles, etc.The Horse Artillery (Scotties) attached to the Divn were in it also.\n\nThere is an inquiry on at present but I don't expect much will come of it. We did hear that the Divn was ordered back to the Jordan as a punishment & that they point blank refused to go but I can't vouch for the truth of this.\n\nYesterday three lorries went over from here to the Anzac Divn Races at Rischon about 8 miles away & I availed myself of the chance. We had a good afternoons sport, there being some splendid racing.\n\nThe best race of the day was the Steeplechase of about 2 miles which had a very large field. About 8 horses came down & several riders were injured. The race finally developed into a gruelling contest between two horses which kept together all the way until the last 100 yards or so when one sprinted in some lengths ahead of the other, which was done.\n\nI backed the winner. I had 4 bets on the day & 3 of them were wins & 1 second, thus clearing£5.\n\nI nearly missed the lorries coming home as I had to draw£3 on the last race & by the time I had drawn it, I had to run all the way to where the lorries had been left - about½ a mile & when I got there they had gone. I went along the road a few hundred yards & found one stuck so that I did not have to walk after all.\n","226":"\n\nThe","227":" was a wet day so the sports were postponed until","228":" was fine however &today though overcast all day, has been fine. For past two days the men have been having a wild & woolly time indeed. Nearly the whole squadron was drunk yesterday & last night, as unlimited quantities of beer (Bass) & wine (Richon) were obtainable, beer at 9PT per bottle & wine 12PT.\n\nWe had our Xmas dinner at 6 pm & it was a fine one too, & the cook must have put in a lot of work to prepare such a blow out. His efforts did not go unappreciated however, as the mess thanked him & drank his health etc.\n\nThe menu consisted of Soup Tomato, Roast Meat with 3 vegetables, Plum Pudding, Jelly & Custard.\n\nThe Concert at night was very good but was somewhat marred by the objectionable remarks & behaviour of some of the men in the audience who were drunk. The Concert was very well got up & must have required a\n\n\n\nlot of time for practice & for preparing the necessary paraphanalia. The second half of the programme consisted of a farce \"Going home\" the scene being the deck of the ship, with the actors in the guise of officers, nurses, men & ships complement. This was the best part of the concert.\n\nThe squadron orchestra were in attendance but were not up to their usual form, due no doubt to the dinner.Fortunately the Concert party were sober, or sufficiently so to do their parts properly.\n\nThere were a lot of officers present including the Brig Gen, the Major of Squadron & other officers.As is usual on these occasions several of the officers were \"told off\", peculiarities of characters speech etc being brought out. Also some including the CO & EO were called all kinds of nice names by some of the men & told off properly.\n\nOf course the only course open to them was to take it all & say nothing. We expected the CO to be counted out when he came round to the Mess Huts at dinner time but this did not eventuate.\n\nOn the","229":" there was a big review by General Allenby at Cairo & taking part in the proceedings was a formation of 100 machines. One chap an expert pilot & instructor was killed owing to the collapse of his machine while stunting.\n\nOur Squadron was not invited to participate in this affair as it was to be a show for the \"Training Squadrons\" ours being the only Squadron in the field now. 7 of our machines flew down to Cairo however as some of the officers wanted to see the celebrations. The flight - a non-stop one took just 3 hours the distance being about 300 miles.\n","230":"\n\nWe had the Squadron sportsmeeting this afternoon in fine weather & they were a great success. There were only 2 running events the 100 yds Sqdn Championship & a 120 yards open Championship. I won my heat in both events & came second in final 100 yards, being beaten by about 6\". Time 11","231":"\n\nIn final of 120 yds I came a dead heat with Tommie & so had to re-run it.\n\nIn the re run I beat the pistol & won by about 10 yds. The other chap entered a protest, which was upheld by the Committee & so we had to re run it again, although I would have been quite right in refusing as the other chap was quite in the wrong. However I won the","232":" re run by about 3 yds in 14 secs. Thus I won£8.10 on the day£6 for 120 yds &£2.10 for the 100 yds.\n\nIn the 100 yds I ran in sandshoes & would no doubt have won if I had had the proper spiked shoes that I used in the 120 yards. I had a lot of running to do, twice in the 100 yds & 4 times in 120 yds & so am pretty tired tonight but joyful.\n\nI think I was a surprise packet today but no one was more surprised than myself.\n","233":"\n\nWe have had no rain during the past 10 days it being very fine & very warm until yesterday morning which turned out to be very cold. It started raining after dinner & has continued intermittently since.\n\nThe Squadron is expected\n\nto be handing over any day now & proceeding to Kantara. Everything will be handed over including machines & we will only leave here with our own personal belongings.\n\nWe are supposed to be going to England & on account of this we have to do 1½ hours drill per day. The first morning this started we had to get up at 0545 am & so we counted them out & marched off parade.\n\nA couple of mornings later the early morning parade hour was altered to 0645. We do½ an hour before breakfast & an hour during the morning. Needless to say we don't take much interest in the drill.\n\nStarted a Rugby Football team after the New Year & it is now on a good firm basis though at first the men were not very enthusiastic about it. We played GHO Signals last week being beaten by 6 - 5. This match aroused a good deal of interest in the game since\n\nthen we have had a lot more chaps turn out to practice. We have not got much combination or condition yet but as the men are very keen now we should soon have a fine team. I am secretary & skipper, & am quite satisfied as I reckon we have the makings of an excellent team.\n\nHad intended going on 7 days leave to Damascus,Beyrout etc but now that the wet season has started properly I will have to postpone it, probably altogether.\n","234":"\n\nYesterday 2 mates & myself left Ludd on the 0720 officers train for Haifa. It had rained slightly overnight & was very threatening. The line to Haifa is a broad gauge one now, running along the sea coast when past Zimmerin in some places being only about 20 yds from the waters edge.\n\nAt Haifa, where it was raining still, the line runs on an esplanade on water edge, right round Bay into Stn. Arrived Haifa at 1020 & immediately got into a train on the narrow gauge 3'6\"\n\nthat was leaving for Damascus at 11. The carriages on the train, though the seats are hard, are very comfortable & travel very smoothly indeed - what a contrast to the way we have to travel going to Egypt in open cattle trucks, whereas coming up here we got a first class train.\n\nShortly after leaving Haifa & after skirting the Carmel Range we came out on to the Plain of Esdraelon, stopping at Afule & Beisan. This plain is very richindeed, the soil for the most part being chocolate in colour. At present it is looking at its best, everything being so green & fresh looking. As we were going along we saw natives ploughing in the rain though the soil was really not fit for ploughing on account of ofbeing so wet.\n\nThe country about Afule is about the richest I have so far seen. After leaving Beisan we crossed the Jordan River, near where it comes out of\n\nLake Tiberias , & our next stop was Samak which is on the shores of the lake, owing to the clouds & mist being so low it was impossible to see things very far away, & certainly not as well as well as in sunlight.\n\nAfter leaving Samak we started to climb. Tis really marvellous the way the line is built & is a fine piece of Engineering. There are about a dozen bridges to be crossed, over Gorges etc, the surroundings of them being splendid.\n\nAt one place looking up the side of the mountain you could see the line again some hundreds of feet above us.In about 5 minutes time we were up there looking down on the valley below. There are 6 tunnels on this climb & in one place one tunnel is right over the top of another one, the line almost doing a figure 8.\n\nThe climb was pretty slow on account of it raining continually & the line being so slippery.\n\nIt was wet & dark when we got to Deraa, & so could not see the place. Owing to the wet we could not take any snaps though we saw plenty of fine pictures. We arrived in Damascus at 2330, an hour late, due to the rain & went to the Orient Hotel for the night.\n\nThe morning turned out to be nice & fine & we hope it remains so. We will be here 2 days as there is no train to Beirut until Tuesday & another on Friday.\n\nWent through the Bazaar after Breakfast & had a good look round. The Bazaar is a tremendous big place & you can obtain there almost anything you want. They charge very high prices but you can generally beat them down to about half what they ask.\n\nIt is quite fine all day luckily & we managed to get several good photos. The city is awfully dirty the mud & slush being inches deep in all the streets & the smells in parts are enough to make one sick used as we are to Eastern towns.\n\nThere is a sytem of electric trams but it is a very poor one indeed. The town is also lit up by electric light.\n\nThe Administration of Damascus is in the hands of the Hedjaz troops. They were a big surprise to me as they are very well turned out in appearance with a good uniform & they are fair in phisique also. A lot of them are wearing English uniforms but most wear their own dress.\n\nWhat surprised me most about them is that a very big proportion are very fair in complexion while others are swathy & dark like the ordinary Arab or Bedouin.\n\nThe River Barada runs through the main part of the City, flowing very swiftly & disappearing underground in the Centre of the City, running beneath the city & outcrops comes up in places. There is an abundant supply of water everywhere throughout the city but it is not used nearly as advantageously as is possible.\n\nThe sanitary & drainage system is very bad indeed but there is no reason why Damascus should not be a very clean city indeed.\n\nThis hotel is a pretty rough one, which is only to be expected I suppose. The food is very poor indeed & one not being able to get a decent meal at all & we have to supply our own blankets. We have got to stay here tomorrow too, as there is no train to Beirut until Tuesday morning.\n\nOne day is all that one requires to see Damascus as there is practically nothing to be seen except the Bazaars.\n\n\n\nOur second day in Damascus was also fine & during the afternoon we went up onto the Hills at rear of the town & overlooking it. It gave a fine view of the city which seems to be in a huge plain covered with trees.\n\nLeft next morning at 7.30 for Beirut where we arrived at 7.00 pm having traversed a distance of about 90 odd miles in the 12 hours. The first part of the journey after leaving Damas is through the Valley of the Barada, which is rather narrow & has the road, river Barada & Railway running through it.\n\nThe River flows alongside the line & runs very swiftly. The valley has been planted very thickly with cedar trees? which grow very straight & make fine logs. This is the valley in which some of the","235":" L.H. Bde caught about 3,000 Turks & Germans & mowed them down from the sides of the hills with machine guns.\n\nAbout 15 miles out we reached the source of the Barada River at the foot of the Anti-Lebanon Range. Everywhere throughout this valley was a profusion of water, coming down the rocks from springs, from waterfalls & running everywhere.\n\nWe crossed the Anti-Lebanon Range which are only about 2,500' high & then ran down to the valley of the\n\nLeontes. There was snow on the mountains as we went over - the first time I have seen it. The valley of the Leontes is a valley about 10 - 15 miles wide, lying between two parl ranges of Mts the Lebanon & Anti-Lebanon. It is very rich indeed nearly every bit of it being under cultivation, & there are plenty of villages scattered about.\n\nStayed at Rayak about½ an hour & shortly afterwards started on the very steep climb up the Lebanon mountains. At Rayak one could see snow laying on the mountain tops on both sides.\n\nIt was not very cold at all except when one got out in the wind. Chaps at Rayak told us that the nights were very cold.\n\nShortly after leaving Rayak we started to climb the Lebanon Range. The ascent was very steep indeed & we had a rack engine on even then the pace was not above a walking pace. At the top is a tunnel & when we went through it we were on the downgrade.\n\nOn top we were going through the clouds & could not see more than about 200 yds at times. This was unfortunate as from the top there is a fine view of the mountain slopes & the Sea & Beyrout at the bottom. On top of the mountain is a big hotel, the Grand, 250 rooms, which is the summer resort for the people of Beyrout & also the Tourists.\n\nWe arrived in on time, the first time that this train has been up to time table.\n\nWent to stay at the Victoria Hotel, which is one of the best here & is on the sea front. The tariff is 60PT'sper day which is pretty stiff as compared with Egyptian Hotels, but of course conditions are much harder here.\n\nThe town is quite European being much cleaner than Damascus, & better drained on account of being built on the hill sides. There are electric trams which are run much better than in Damascus & the town is also lit by electricity.\n\nThe Harbour is very small but is a good one & boats can tie up alongside. There are still a couple of boats lying in the harbour, which were sunk by the Italians in 1912 during the Turco-Italian War.\n\nThere is no railway stn in this place, the train running down onto the Docks. There is a station out about 2 miles, which may be the main stn. Damascus has a fine big station whereas this place has not.\n\nIt rained heavily this morning until about 9 am when it cleared up & it has been fine all day. We went out to the American College to have a look around. It is a fine place, very extensively built on the sides of the hills & overlooking the sea. The main building is a 4 storied one & is very well built. From the tower one can get a fine view of Beirut & the mountains rising at the back. The price of tuition, boarding etc is£55 per annum which is\n\nvery reasonable considering what they get for it.\n\nThe course ranges from the primary stage upwards & one can take even the degrees of B.A., M.A., dentist, medicine, etc. I would have thought that it would be called a University but tis only a College. The Rooms of the boarders are very nice roomy & clean. The Professors are all American, except perhaps those for languages. The pupils are of all nationalities & tongues but the common language is English. Everyone is taught English & encouraged to speak it, for their own good.\n\nThe military have taken over a Turkish Baths & converted it into baths for the troops. We went round there & had a cold bath today as the hot water is off but tomorrow we are going round for a hot bath & cold one after. It is a good clean place & is a good idea.Tis not often they give such concessions to the Tommies.\n\nThere is no sign now of the want & poverty that was in evidence when our people took over the place.There is plenty of bread to be had & no scarcity of vegetables.\n\nThere are some decent tram rides to be had in & around Beirut notably out to the Dog River & to the Pine Forests. There are in Beyrout the best horses that I have seen over here. Some pairswe saw in carriages were worth about£100 each. Before the war there were several hundred\n\ncarriages in & around Beyrout but of course the Turkish Army took the best of them. They are bred in Tripoli & are taller than the Egyptian Arab & finerbuilt.\n\nIn the market place we were asking the price of vegetables etc in pre war days & from what we gathered living must have been very cheap. For instance cauliflowers before the war cost 1PT for 3 or 4 decent sized ones while eggs in summer were 60 for 1\/- & in winter 2 dozen per 1\/-. Bread also used to be about½ the price or even lessthan we paid for it in Australia.\n\nWe had to leave Beirut on Saturday morning","236":" for Haifa going by boat. Owing to the early hour at which we started we had to sleep on the wharf overnight & be on board by 0515 am.\n\nThe boat was a drifter or mine sweeper - only about 100 tons, with no accommodation for passengers. There were 30 officers & men going down to Haifa & we just had to sit anywhere we could.\n\nI was very sick indeed, in fact I don't think I was ever so sick before. It was not due to the rough sea as there was only a swell on but I think it must have been\n\n\n\ndue the size of the boat & to the fact that she was tossed about like a cork. I was not the only one sick, by any means.\n\nLeft Beirut at 0545 & reach Haifa at 3 pm the distance by sea being about 90 miles. At Haifa we got onto the officers train leaving at 8 pm & got to Ludd at 11 pm.\n\nWe were nor allowed to travel on the officers train unless we had tickets to go as officers batmen so we accosted officers going down who did not seem to have batmen, & asked them to get us the necessary ticket. They were very good about it & we all three had no trouble in getting tickets though we did not see any more of the officers afterwards.\n\nAt Ludd there was no car waiting so we had to walk back to the Sqdn, 2 miles away & carry our blankets & kit. It was 1 am before we got home & I was quite done up.\n\nWe were 24 hours over leave but have heard nothing of it since - I don't think we will be put up for being A.W. leave.\n\nTis possible now to go from Damascus to Cairo in 29 hours by train which is really good I think as the distance is about 580 - 600 miles.\n\nDamascus is out of bounds now to all tgroops owing to an outbreak of Typhus. Tis no wonder that half the city is not wiped out with it in its present unsanitary condition.\n","237":"\n\nLeft Ramleh on","238":" after handing over the aerodrome, machines, etc complete & came down by special train to Kantara.\n\nWe expected to be sailing on Monday by the \"Ceramic\" but it is off now & we will probably have to wait until the end of the month for the \"Port Sydney\". It seems that the Ceramic has on board some hundreds of cases if influenza & has to go into quarantine at Suez to be disinfected etc & the patients taken off her. However we may go on the Ceramic if she is only a couple of weeks in quarantine.\n","239":"\n\nLast Thursday went up to Cairo with a combined team from Palestine Bde to play the R.A.F. Cairo. We had 6 men in the team the remainder comprising officers from the other Squadrons.\n\nWe were up against a very strong combination & were beaten 11-0. I was knocked out in the first couple of minutes of the game - the first time since I have been since playing Rugby.\n\nHad 48 hours leave after the match & had a good time. I bought about£10 worth of stuff to send home.\n\nNo certainty yet as to when we are going home but it is the","240":" rumours says.\n","241":"\n\nGeneral Allenby came this morning to say good bye to the Squadron & to thank us for the good work done since he has been G.O.C.\n\nHe is a very big man, rough & ready but is a very poor hand at making a speech & he made several grammatical errors while addressing us. He gave us a lot of soft soap etc.\n\nWe are to sail now on","242":" by the \"Port Sydney\".\n\nFor the past 5 days the Rhamseen has been blowing & one can hardly see more than a hundred yards or so at time due to sand.\n","243":"\n\nWe go on the boat tomorrow morning at 9 am at Kantara landing place & leave at 11 or thereabouts. It is very hard to realise that we are leaving this country to go home as life here seems to have become the natural way of things, though none of us will be sorry to leave.\n\nWe have to pull down our own camp which has taken all day nearly. The only things left are a few tents which will be pulled down early in the morning.\n\nThe Khamseen has been blowing extra hard today accompanied by rain & at time one could not see more than 50 yds or so owing to sand which gets in ones eyes, ears, nose etc.\n\nSome Tommy A.S.C. drivers from over the road have been getting a lot of backsheesh during the past couple of days in way of primus stoves, clothing, etc as also have Indians from nearby camps.\n\nThe battleship \"New Zealand\" went through the Canal this morning en route to India & Australia.\n\nShe is about the biggest vessel to date to go through the Suez Canal, the Ceramic being next.\n\nAbout 20 NCO's & men left today for \"A\" details Moascar on leave to England. They get a months furlough on full pay & 6\/- per day sustenance allowance & reembark for Australia on completion of leave.\n\nWe were only notified of it a couple of days ago & as I have slipped twice already & we are going home in a day or so, I would not take it on.\n\nUp till a month ago I was extremely anxcious to go to Blighty but now would not take it on. Only 10% were to be allowed to go preference being given to men whose homes are in England or who have near relatives there.\n\nThere are a fair number of \"Pommies\" in the Sqdn and as I only wanted to go for pleasure probably would not have got a look in against them.\n\nHave had several good swims in the Canal during the past couple of weeks but the water is a little on the cold side as yet.\n\nDuring the last couple of days have received\n","244":" parcels, bundle of Bulletins & a \"Referee\". Am having any parcels that come for me after I sail sent on to \"Micky\" Tuson.\n","245":"\n\nSailed this afternoon at 4.30. During the morning we embarked about 1,000 men & officers at Kantara. This consists of 25 of our Squadron 600 leave men from \"A\" details Mosscar & convalescents.\n\nNeither of the Stinsons are on board. The Boat is of roughly 9,000 tons, being very roomy but very high out of the water on account of having no cargo on board.\n\nThe troop deck runs the entire length of the ship being just under the first deck.There is plenty of light & ventilation.The ships seems in excellent condition & very clean.\n\nThere is a tremendous amount of traffic in the Canal now, & yesterday at least 2 dozen boats must have gone past us in the Canal, some of them passenger boats.\n\nWhen passing through the Canal there is barely room for ships to pass so one has to pull up at certain places such as the Lake at Ismailia where there is plenty of room to allow of others passing from the opposite way.\n\nThe Canal is about 200 yds wide & a boat in the Centre going at 5 or 6 knots draws the water in towards it thus decreasing the level on the Canal banks. If the ships went too fast the water which banks up behind like a tidal wave would damage the banks considerably.\n\nIt takes about 18 hrs to go from P Said to Suez.\n\nOn first day out a chap from","246":" MG Sqdn shot himself twice in the chest. He was operated on & is recovering now. Tis said that he has had bad news from home, his mother & two sisters dying from P. Influenza.\n\nThe first day out was fairly cool but it has since warmed up but is not too hot yet.\n\nDiscipline on board is very lase & we have only one parade\n\na day at 0930 when orders are read.\n\nWe have averaged 13 knots per day & since starting with a favourable wind for 4 or 5 days.\n\nIn the Red Sea we met about 30 boats & passed one on each of the first 3 days.\n\nThe Mungaree is not bad at all. The first couple of days out it was light but as a result of our general complaint it was improved somewhat.375 cases of Comforts were put on at Port Said, consisting mainly of tinned fruit, syrup, jam, sauce & plenty of reading matter.\n\nThere is a fair amount of amusement on board. Our Concert party & orchastra are in full swing. Sports extending over 2 days have been held & a boxing tourament is starting in a few days.\n\nOf course the great old game of \"two up\" & Crown & Anchor are much in evidence & some fair sums of money have been lost at these. One chap headed the pennies 25 times in succession one night & won£46 at it. Had it been a very big school he would have\n\n\n\nwon some hundreds.\n\nThere is not much duty on board except Guards & fatigues. We don't do the guard but get fatigue every 3 days which is not bad.\n\nThere is plenty of room on board much more than we first thought. Our troop deck extends the entire length of the ship being just under the main deck, well lit & well ventilated. We sleep up on the main deck but are not allowed up on the boat deck, it being reserved for officers.\n","247":"\n\nOwing to a case of smallpox breaking out everyone on board had to be vacinated today. The Nurses & orderlies nursing the case have to be isolated. He will probably be put ashore at Colombo.\n\nYesterday evening saw the North Star very low down on the horizon. In a few days I expect it will disappear altogether & the Southern Cross becomes visible.\n\nSighted the Island of Socotrathis morning","248":" at 0900 but it was nearly 3 oclock before\n\nwe had passed it. It is a very barren looking place with a population of 4,500 who do a small trade in aloes, cochineal, etc.\n\nAn educational scheme is starting today with such subjects as lower maths, English, Bookkeeping & perhaps a limited number of others. I am down for bookkeeping, to pass the time away & agriculture too if there are enough to form a class.\n\nQuite a number of chaps have jobs on board - in cook-houses etc, to keep them occupied & fill in time. It does get monotomous on board & I get tired of reading & cannot settle my mind on it for any length of time.\n\nPassed the Laccadive Islands quite clossely on Sunday morning & got into Colombo at tea time on following day.\n\nWe have been taking in water & coal all last night & today & won't be leaving until early tomorrow.\n\nThe ship is under close quarantine & no one except the \"heads\" Captain, C.O. & Doctor have been allowed ashore.\n\nThe day coming into Colombo & the day in there were exceedingly hot & we had a couple of very heavy rain storms at night.\n\nIt was very hot indeed down below & sooner than sleep down below I walked about on deck half the night, until it cleared up & then slept on deck. The heat during these two days took a lot out of most of us.\n\nWe took about 1,600 tons of coal & 2 or 3 hundred tons of water. When we went into Colombo we were drawing 15' only at the bows & 17' coming out.\n\nLeft at 10.30 on","249":" & as soon as we got out to sea & got a bit of a breeze it became much cooler. We were jolly glad to get out of Colombo & started on our journey again.\n\nIt is expected that it will take us just about 12 days to Fremantle as the coal we took on is not very good.\n\nArrived Fremantle","250":" morning at 4 am. We did not go inside the port but lay out in the Gage Roads, as no troopships are allowed alongside the pier. The port authorities were greatly scared over the case of smallpox we had had& had the ship listed as quarantined days before we reached port & when we arrived the Port doctor examined every man on the ship.\n\nWe landed 80 West Australians who went into quarantine. Stayed in port all day leaving at 5.30 pm. We took some water, apples & fresh vegetables.\n\nOne of my mates has an uncle onshore & received a case of apples from him. Needless to say we appreciated these very much, the first we had tasted since leaving Australia in '16.\n\nFrom the way we were received at Fremantle it seems as if the returning troops are welcome in one way they are a unwelcome in other. Because we\n\nhad had a case of smallpox nearly 3 weeks ago, we were strictly quarantined & no one came near us or even sent us a message of welcome back home.\n\nWe rounded the Leevin today but did not find it very rough except for a heavy swell & kept close in to land all day. Owing to the ship being so light we were bouncing all over the place & half the time the propellors were out of the water. Owing to this we had to slaken speed somewhat.\n\nArrived in Adelaide about 4 pm the","251":" Were medically inspected again but the South Australians did not go ashore until 1 pm next day. We did not go into Outer Harbour but anchored outside.\n\nWe took about 600 tons of coal & left at midnight on","252":" Took on some papers which were very welcome also some fruit.\n\nOur next destination id Hobart.\n\nWe were innoculated today against Pneumonic Flu & were glad to get a chance to be done before going off.\n\nWe had a comparitively smooth trip down to Hobart, except for the South West Coast, where it was a bit rough. We did not see Hobart but pulled into the quarantine stn in Burns Bay.\n\nTis a very nice place indeed & everyone was admiring the locality & saying how nice it would be to spend a holiday round there.\n\nStayed in overnight & pulled ot at 11 am. We had itfairly choppy in Bass Strait & quite a lot were seasick. Arrived at Portsea quarantine stn about 2 am on","253":" & left after dinner. We put ashore over 300 in all.\n\nIt was very rough coming out of the Rip but during the night it died down.\n\nExpect to be in Sydney heads tomorrow morning about 7 am. Were innoculated todays & received certificates for it.\n\nArrived in Sydney on morning of","254":" at 10 am & anchored off Watsons Bay. It was a squally morning & raining most of the time.\n\nWe were a clean ship & expected not to go into quarantine camp. Landed during the afternoon & went up to a big canvas camp on top of North Head. We were in Mountain Battery tents - 6 in each only & we have straw mattresses to lie on. From our elevated position we can get an excellent view of Manly & the Harbour.\n\nThere is nothing to do except go fishing, tackle being issued for this. There is only one parade a day - 0930, to have temperatures taken.\n\nThe grub is fair but we will be glad to get out of here.\n\nExpect to get out on Monday next.\n","255":"\n\nLeft quarantine at 9 am arrived Anzac Buffet at 10.15 being met by motors at the wharf & taken in them to the Buffet. Met Mr Stinson, Mrs Stinson, Dr Nash, Uncle Arthur & Auntie.\n\nHad to report at the Barracks at 12 oclock for medical examination & discharge. In just about an hour I had been through the lot & received my discharge & a fairly good civilian suit (Don't think).\n\nAlso received a leave pass up to","256":" I get full pay & 3\/- per day sustenance allowance during the period & I have to be out of uniform for the expiration of my leave.\n","257":"\n\nToday sees the termination of my period of service in the A.I.F. as my discharge takes effect from today.\n\n\n\n"}}