{"Document Name":{"0":"Diary_0210","1":"Diary_0210","2":"Diary_0210","3":"Diary_0210","4":"Diary_0210","5":"Diary_0210","6":"Diary_0210","7":"Diary_0210","8":"Diary_0210","9":"Diary_0210","10":"Diary_0210","11":"Diary_0210","12":"Diary_0210","13":"Diary_0210","14":"Diary_0210","15":"Diary_0210","16":"Diary_0210","17":"Diary_0210","18":"Diary_0210","19":"Diary_0210","20":"Diary_0210","21":"Diary_0210","22":"Diary_0210","23":"Diary_0210","24":"Diary_0210","25":"Diary_0210","26":"Diary_0210","27":"Diary_0210","28":"Diary_0210","29":"Diary_0210","30":"Diary_0210","31":"Diary_0210","32":"Diary_0210","33":"Diary_0210","34":"Diary_0210","35":"Diary_0210","36":"Diary_0210","37":"Diary_0210","38":"Diary_0210","39":"Diary_0210","40":"Diary_0210","41":"Diary_0210","42":"Diary_0210","43":"Diary_0210","44":"Diary_0210","45":"Diary_0210","46":"Diary_0210","47":"Diary_0210","48":"Diary_0210","49":"Diary_0210","50":"Diary_0210","51":"Diary_0210","52":"Diary_0210","53":"Diary_0210","54":"Diary_0210","55":"Diary_0210","56":"Diary_0210","57":"Diary_0210","58":"Diary_0210","59":"Diary_0210","60":"Diary_0210","61":"Diary_0210","62":"Diary_0210","63":"Diary_0210","64":"Diary_0210","65":"Diary_0210","66":"Diary_0210","67":"Diary_0210","68":"Diary_0210","69":"Diary_0210","70":"Diary_0210","71":"Diary_0210","72":"Diary_0210","73":"Diary_0210","74":"Diary_0210","75":"Diary_0210","76":"Diary_0210","77":"Diary_0210","78":"Diary_0210","79":"Diary_0210","80":"Diary_0210","81":"Diary_0210","82":"Diary_0210","83":"Diary_0210","84":"Diary_0210","85":"Diary_0210","86":"Diary_0210","87":"Diary_0210","88":"Diary_0210","89":"Diary_0210","90":"Diary_0210","91":"Diary_0210","92":"Diary_0210","93":"Diary_0210","94":"Diary_0210","95":"Diary_0210","96":"Diary_0210","97":"Diary_0210","98":"Diary_0210","99":"Diary_0210","100":"Diary_0210","101":"Diary_0210","102":"Diary_0210","103":"Diary_0210"},"Date":{"0":"unknown","1":880.0,"2":881.0,"3":882.0,"4":883.0,"5":884.0,"6":885.0,"7":886.0,"8":887.0,"9":888.0,"10":889.0,"11":892.0,"12":893.0,"13":894.0,"14":895.0,"15":896.0,"16":897.0,"17":898.0,"18":899.0,"19":900.0,"20":901.0,"21":905.0,"22":906.0,"23":907.0,"24":908.0,"25":909.0,"26":910.0,"27":911.0,"28":912.0,"29":913.0,"30":914.0,"31":915.0,"32":916.0,"33":917.0,"34":918.0,"35":919.0,"36":923.0,"37":924.0,"38":925.0,"39":926.0,"40":928.0,"41":931.0,"42":933.0,"43":934.0,"44":935.0,"45":936.0,"46":937.0,"47":938.0,"48":939.0,"49":940.0,"50":941.0,"51":942.0,"52":943.0,"53":944.0,"54":949.0,"55":950.0,"56":952.0,"57":953.0,"58":954.0,"59":955.0,"60":956.0,"61":957.0,"62":958.0,"63":959.0,"64":960.0,"65":965.0,"66":967.0,"67":971.0,"68":974.0,"69":975.0,"70":977.0,"71":978.0,"72":979.0,"73":984.0,"74":986.0,"75":987.0,"76":988.0,"77":989.0,"78":993.0,"79":995.0,"80":996.0,"81":997.0,"82":998.0,"83":999.0,"84":1003.0,"85":1007.0,"86":1009.0,"87":1013.0,"88":1016.0,"89":1019.0,"90":1023.0,"91":1030.0,"92":1032.0,"93":1033.0,"94":1034.0,"95":1037.0,"96":1042.0,"97":1043.0,"98":1045.0,"99":1046.0,"100":1047.0,"101":1048.0,"102":1049.0,"103":1055.0},"Entry":{"0":"\n\nDiary\n\n","1":"\n\nSerapeum Egypt\n\nMy reason for not commencing a diary before was because life in Egypt is so monotonous when not actually on Service as we are now.\n\nWe left Polygon Camp Abassia last Tuesday & arrived here early Wednesday morning with difficulties facing us from the jump. The sand here is very fine & the wagons sank nearly box deep in it. Extra horses had to be pitched on & then numerous spells were necessary before the hard road was reached. The lead horses were then taken out & returned to the Station\n\n2\n\nto give the others a hand. The pontoon bridge was the next obstacle to negotiate but our horses took to it fairly well, it is only a couple of hundred yards long but there isn’t much to spare on either side of the wagon. We have since found out that it is a common thing for a horse or Camel to accidentally take to the water.\n\nOur camp site was already chosen, it is about 200 yards this side of the Canal, so we parked our wagons & two others & myself sauntered over to the Supply Depot looking for grubb. We saw one of our supply men & he fixed us up with a loaf of bread & tin of marmalade which disappeared wonderfully. I was starving so were the others\n\n3\n\nBreakfast was on soon after & I had another good snack with Eric Clarke. I took one of our tables out of the wagon & secured a couple of boxes.\n\nThe Adjutant came along after we had finished & told me to have our things brought over here to this hut where we soon made things a bit ship-shape.\n\nThere happened to be an empty tent on the lines so we dug ourselves in there (4 of us). That same afternoon we all went down to the Canal for a swim it was great after perspiring like we did all day. The water is lovely & clean but very salty. It is fairly shallow along the banks for a couple of yards but\n\n4\n\nit goes down to 30ft very suddenly. I haven’t missed an afternoon yet & don’t intend to if I can help it. It takes the rough edge off this place alright.\n\nThe flies are the dizzy, stick like glew to a blanket. The mess tables are just black with them before we have our meals its a wonder we don’t get Barcoo.\n\nWe do not mess with the 14th Coy. now as we are some distance away from them, at the Main Supply Depot. The cook here is first class, we are living well theres no doubt. The tea is one good point about it, he knows how to make it alright.\n\nThis is a very busy Depot\n\n5\n\nthey supply the whole Division. A light railway runs out to the battalions and to Railhead. From the Railhead, supplies are conveyed by camels to the lads in the trenches where an attack is soon expected by the Turks. They are on a water ration out there so things must be pretty rotten \nout there\n. We have plenty here because we have our own water-cart.\n\nThe Canal is a wonderful peice of work. The sand is banked up on this side & to see a mail steamer going through one would think it was cutting through the desert. On the other side there is a belt of trees & over there the Hd Qrs of the Division are quartered.\n\nThere are no bathing costumes\n\n6\n\nused here, so there is a general duck as a passenger steamer comes along. The warning is (Bob down before you’re spotted). The passengers, I believe, throw tins of cigarettes etc over to the lads when passing, I haven’t been there on such an occasion yet.\n\nHave just received parcel of Trench Shirts sent from home. All parcels sent to me have come to hand so far.\n\nSunday 14\/5\/16\n\nHad a bosker swim this morning went down at 6-30 it was a treat. Two cargo boats went through while we were there. Soon after we had finished breakfast the “Medina\" was sighted coming through the desert she looked great. \n\nIt’s a dirty windy day\n\n7\n\nthe dust would nearly choke you. Last night Horace & I went down to the Canal for a yarn it was fine in the moonlight. When I arrived back there was a letter from Ruth dated 31\/3\/16 & a parcel from Hilda Rees containing medical comforts. Have written my thanks to-day. \n\nHad a lovely swim this afternoon about 4 o’c. While we were there the “Ceramic\" came along packed with Troops among them was the 36th Battn. We were all swimming about some of them are very daring, wait until the boat is on top of them. They made an awful row from the ship & we responded.\n\nIt’s been an awful day but nice & cool to-night. Had a yarn with Eric & the lads\n\n8\n\nover at the Coy.\n","2":"\n\nNothing startling happened to-day, only hot wind & dust it was terrible. Was inoculated this afternoon & my arm is beginning to get stiff & sore. No mails at all to-day expect some to-morrow.\n\nEverything points to a speedy departure, our Egyptian money is to be changed into English. On everyone’s lip is the question “When are we going?\"\n\n17\/5\/16 9-15 am.\n\nI was on the point of writing up yesterday’s doings last night when an urgent despatch was required to be taken over to Divisional Hd Qrs. & I was the only one available.\n\n9\n\nI had a pass to go across in the Officer’s boat & rather enjoyed the trip. A steamer was seen coming down the Canal with her search-light full on. It was a lovely moonlight night but very warm. Coming back I hopped on one of our wagons this side of Canal (They “break\" the bridge even night) & rode back to Supply Depot. \n\nIt is lovely of a night to lie on the chaff stacks just in front of our door & yarn. It was a terrific day yesterday but a swim at about 4 o’c went well. To-day is going to be as bad I think, the sooner we get out of this Hell on Earth the better. \n\nHave just received 3 letters Dorie Little Ada & Ethel dated\n\n10\n\nend of March.\n\nWe have been issued with yellow tinted goggles by jove the lads on the wagons want them too the glare is awful.\n\nWent down for a swim at 4 o’c & swam across to have a closer view of two monitors at anchor. Soon after we arrived alongside they weighed anchor & stated off at a great pace. They called here for rations; we supplied the transport.\n\nAfter tea had a long yarn with Lieut Newman O.C. Railways. He knows Mosman well, has a brother living there. He is a fine cove reminds me of Geo Dowell. Later on \nBill\n Rodger & Horace called here with a water bottle filled with Cocoa. It was great \n","3":"\n\nwe added more milk to it from a tin I had.\n","4":"\n\nA little cooler to-day no hot wind. Rode up to YMCA hut on orderlies’ horse to get a couple of tins of peaches to give the lads a return treat for cocoa last night.\n\nJust before tea the “Mooltan\" went through & looked great. There ought to be more mail in a day or so.\n\nReceived a few papers yesterday amongst them was a Bulletin from Ruth with note from Cecil. \n\nThe lads came across & we had quite a party on the chaff stacks of the Depot (2 tins peaches & tin of milk).\n","5":"\n\nDid some washing this morning in the same water \n\n12\n\nas I washed in. There’s not too much fresh water about the place.\n\nA lovely cool night, will use the blankets to-night.\n\nReceived 5 letters after tea Ruth Eva Hobden, Dorie, Charlie McNamara Trish. Ruths contained the news of Doss’s wedding, it was dated","6":"\n","7":"\n\nA quiet day yesterday, Rodger & Bill called about 3-30 & I went down for a swim with them it was great. After tea they came across & we went down to the canteen & had some peaches & milk, quite a feed. Received a long letter from Doss telling me of the wedding. \n\nIt is pretty warm to-day & the flies are busy.\n","8":" to-day it’s like all other days here.\n","9":"\n","10":"\n\nVery quiet day to-day. Have just been across to the Coy & the lads are all going through their kit bags. We are only allowed to take 1 bag with us & consequently the kit has to be reduced. I’ve made arrangements to sneak a few extras away in a stationery box. Everything points to a speedy departure.\n","11":"\n\nVery busy these last few days nothing but the General Routine has happened. Marching out states & Embarkation Rolls are the order of the day.\n","12":"\n\nWent for a swim with Dud Otton this afternoon it was great. To-night The Colonel lectured us on our departure & warned us not to be absent when wanted & told us the penalty.\n","13":"\n","14":"\n\nWas kept going yesterday with request for Transport owing to the withdrawal of Battalion","15":" line transport. Was awakened early this morning on the same duty. They don’t care about it being Sunday, one forgets the days of the week here. \n","16":"\n\nEverything has been a bustle & is still so. Troops are beginning to move out so our wagons are kept at it. Parties of troops are continually marching past with kit bags & blankets to have them disinfected. Everywhere is excitement.\n","17":"\n\nThe","18":" Brigade are marching out to-day with","19":" flight we hope to go with the","20":" flight. The Headquarters of the Train leave to-day but\n","21":"\n\nI’m left behind as Transport Clerk but will join up again over there. I leave with the","22":" Coy. \n","23":" p.m. Thin brown lines have been passing by since tea time. The lads look in splendid nick, & as brown as the clothes they’re in. Each Battalion has its’ band & everyone seems very cheerful. It’s the thought of leaving this country I think. The Tommies are arriving to take over I don’t envy them a bit this is not a white man’s land. We are kept at it supplying transport as there’s only two Coys here to do it.\n","24":"\n\nThe","25":" Brigade marched out to-day & looked very fit. Our Coy shifted the whole Brigade in record time.\n\n16\n","26":"\n\nVery quiet day to-day but to-morrow will see things busy again as the 13th Bde leave. We entrain on Sunday so our time in Egypt is limited now. I haven’t received word from home for some time now I suppose it will pick us up in France. \n","27":"\n\nArrived Marseilles.\n","28":"\n\nQuite a lot has happened between the","29":" & present date but it is all so impressed on my memory that the need of a diary is out of the question.\n\nWe arrived at this little village of Merris in the north of France on the","30":" & are billetted in a cottage the front of which looks out over a lovely green paddock. A lady lives here whose husband has been killed & we have had a very\n","31":"\n\ninteresting talk with her. The boy works hard about the place & the back garden is a picture. He has all kinds of vegetables growing & a few fruit trees. From the back door you can see beautiful cultivated flats it reminds me of the Rouchell. We sat in the kitchen last night & yarned with our “landlady\" she speaks English fairly well.\n\nWe are not very far from the firing line guns can be heard distinctly. Last night we saw them shelling an aeroplane the schrapnel was bursting all round it. Our companies are split up all over the countryside. I haven’t seen Eric or Horace since leaving Abbeville. The Sgt & I cycled from there to this place a distance of about 80 miles\n","32":"\n\nWe travelled with the","33":" Coy but kept well ahead of them & enjoyed ourselves at each village we came to. It took 4 days for the convoy to get here so we had plenty of spells. The roads were excellent & the country beautiful. Every inch of the land is cultivated & is a grand sight. Poppies, cornflowers, buttercups & daisies grow abundantly in the wheat crops & the picture it presents is more easily imagined than described. The villages we passed through were very pretty & we secured a good bed each night. We had lovely weather all the way but it is trying to rain to-day. We camp in the front room\n","34":"\n\nA beautiful day to-day Sunday. A Corpus Christi was held in the village\n","35":"\n\nIt was very pretty the little kiddies looked great. This village (Merris) has suffered heavily in this war nearly everyone was in mourning. Heavy bombarding was heard yesterday – we are not many miles from the line. It rained a good deal yesterday but to-day has been perfect. Am writing this by daylight & it is now 10-15 p.m. the twilight is great over here.\n","36":"\n\nI forgot to mention about a village we passed through when cycling. The place was called Fruges & we made quite a hit. We were the first Australians, I think, to stop there & the people turned out well to see us. The kids ran\n","37":"\n\nin & told their mothers & all hands had a peep. We had a game of ball with some kiddies in the street & made ourselves generally agreeable. We put up at the Pub that night the Convoy was camped 10 miles back.\n","38":"\n\nHad a lovely spin in a car to Moolenacker yesterday it was great. That is where part of the","39":" are camped. This is a great place for rain alright & this is summer. What will the winter be like? My mail is coming to hand better now had some bosker long ones from home.\n","40":"\n\nLast night we saw several attempts to bring down an Aeroplane. We couldn’t tell whether it was ours or a German. He was game any way, they\n\nmust have fired over a hundred shells. They were spitting all round him first a flash & then a cloud of smoke but he sailed away seemingly unscathed. It was a beautiful night although a little cloudy. We went for a spin through the crops outside the village it was great.\n","41":"\n\nTook the bikes out for exercise last night & thoroughly enjoyed the ride along the country roads through the beautiful crops. Soon after we arrived back a heavy bombardment commenced not far from here. It shook the windows & doors & kept going until about 4 o’c this morning. It was believed to be in the vicinity of La Bassee. An occasional flash could be seen from the back door.\n","42":"\n\nIt was a beautiful night with a slight breeze blowing in our favor for a gas attack. My Gas Helmet is still hanging up behind the door ready for emergencies. I believe we are to move up closer in a day or so, to morrow perhaps. Another procession in the village this afternoon. The people practically live at the Church on Sundays.\n\nAfter tea they had a Gramophone going in the Kitchen & played a number of old hymns, Rock of Ages, Lead Kindly Light etc. There were 3 very elderly ladies here & several youngsters & the excitement was intense. How they laughed when Harry Lauder was put on. I stood back & enjoyed the scene. We are just beginning\n\n23\n\nto make ourselves at home here & we have to move on. The little kiddies are a bosker lot lovely rosy cheeks.\n\nRode over & saw Eric to-night the weather is glorious. I’m sitting on the window sill writing this by daylight 10 to 10 p.m. Our landlady gave us a bottle of Cider this morning it is A.1. Received 4 letters to-day 2 from home & 1 Dorie 1 Trish. The home letters were lovely & long.\n","43":"\n\nArrived safely here (Sailly) yesterday about dinner time. Are billeted in a bosker cottage & have a long room with folding doors, reminded me of home somewhat. The folk are very nice & seem fairly well to do. Sailly is a very dirty place & shows signs of bombardment. Received 13 letters yesterday\n\n24\n","44":" were from home, most of the others from unexpected sources. For breakfast I bought ½ lb steak & took it across the road to be cooked.\n","45":"\n\nHad a good fly round in a car to-day looking for a place that was hard to find. Called & had a yarn to Charlie Ferguson, gave me a tin of tobacco. Saw Eric this morning at the Coy & had a yarn.\n\nThere was a gas alarm last night at ½ past 12 but it didn’t reach us. I had my helmet handy in case it was a dinkum alarm.\n","46":"\n\nHave had a couple of good spins in a car these last couple of days it was great. Saw Norm Janson yesterday had a great yarn.\n","47":"\n\nReceived 4 parcels yesterday 2 from home & 2 from Dorie. Received another from home to-day with plenty of lollies no rain to-day for a wonder the sun was quite warm. \n","48":"\n\nHad a very quiet day yesterday, after tea went for a spin to the Coy & had a good yarn to the lads. About tea time a hostile Aeroplane was sighted right above us & our guns opened fire & the sky was a mass of bursting shells. We were afraid the bits would lob on us. A peice did drop over at the Coy quite close to one of the chaps. We have all been “under fire\".\n\n26\n","49":"\n\nHeavy bombarding last night, watched several aerial fights, schrapnel bursting right above us. The aeroplanes seemed to live charmed lives.\n\nSaw Sam marching through last night rode after him on the bike.\n","50":"\n\nLeft Sailly to-day & am back at Merris but only for the night.\n\nHad a great time the night before leaving Sailly the people at the house gave us a little send-off in the shape of a supper. The Adjutant joined us & we had a very lively time. Most of the fun was caused in trying to understand one another. They were grand people & were very sorry we had to leave, so was I.\n\n27\n","51":"\n\nCycled back to Merris Visited our old friends who welcomed us with open arms. Gave us cherries & opened a bottle of cider.\n","52":"\n\nStayed the night at Merris & cycled to Bailleul where we entrained for Candas at the time not knowing where we were going. We travelled in an empty wagon on a truck & made ourselves comfortable. There were 3 of us together & we sang nearly all the way. Cleared the floor of the wagon & had a dance what! how the people at the Village did laugh. We passed through lovely country very hilly & picturesque.\n","53":"\n\nArrived at Candas last night & from there cycled to\n","54":"\n\nthis village called Canaples, & are quartered in the “Town Hall\" & slept on the Mayor’s table. It is very dull & has rained a bit we move on again shortly. We are on the bank of a small stream here & it is very pretty. There is a little bridge across & it recalled to me the yarn “Why is the old rustic Bridge like\" etc. \n","55":"\n\nStill at Canaples but nothing exciting has happened. The weather has been perfect these last few days, it is a treat to be in the sun after the rainy dull weather we’ve had. \n\nLast night the Adjutant told me I could go for a joy ride this morning in the car if I could get up early enough. Stan was up in time you bet\n","56":"\n\nWe didn’t leave until 7 am but it was a beautiful crisp morning & I thoroughly enjoyed the trip. I was the only one beside the driver J Lean so I perched up in the front seat & let the sharp morning air whistle past my ears. The country looked beautiful as we whizzed through. We went to a place called Raincheval passed Talmas Naours etc. Arrived back here about 9-30. We sliced off some meat & had a good breakfast which we cooked ourselves.\n\nThis afternoon I rode up to see Eric Clarke & had a cup of coffee with him at an Estaminet near by. The weather continues to hold good. Have been issued with a water-proof cape & short British Warm.\n","57":"\n","58":"\n\nTo-night after tea a couple of other chaps & myself went looking for a bath. We found a beautiful clear stream & followed it up until we came to a bosker pool & in we went. Cold, gee it was cold but it made us feel fresh afterwards. \n\nWhen I got back the Corporal from the Post Office & I went for a spin into the country on bikes by jove it was lovely. I saw the first rabbit since landing in France, that is wild the people keep them in boxes. We went right up a gorgeous valley & could hear distinctly the sound of the guns. Had a cup of coffee at a dear little girls place near by here on the banks of the stream.\n","59":"\n\nWent for a glorious \nride\n walk\n","60":"\n\nlast night with the Doctor another officer & Corporal postman by jove it was a treat. Our object was to witness the bombardment a few miles distant & it was well worth while walking a few miles to see. The star shells lit up the sky & it looked like an immense fire-works display. The roar of the guns must have been deafening closer up it was just one continual roll jove they must have poured the metal in.\n\nThe view from the top of the hill was beautiful, the surrounding country looked great & we could see this little village right down in the valley. We passed through glorious wheat fields & the pure country air was very invigorating.\n\n32\n","61":"\n\nLeft Canaples & cycled to \nReprem\n Rubempré & are quartered in a very nice cottage with a beautiful garden. Had a very good trip through secured a new bike the night before I left, it is a beauty. We had to walk up one long hill near Talmas. It was fully a mile in length & very steep but the view from the top was great. There are two very pretty curly headed kiddies here & a very nice young lady but I don’t think we’ll be here long. Are following up the “Great Push\" & will be in it before long by all accounts.\n","62":"\n","63":" & a beautiful day. Last night I went for a spin\n\n33\n\nto a place called Warloy about 12 miles in a car it was great. Saw some old trenches on the way & several aeroplanes being peppered with shrapnel. \n\nArrived back about 10 o’c & had a good yarn to the folk here including the “petite fille\", who is very nice. Had a “du Vin Rouge\" & turned in. We are utilising a folding bed which we found here it is great lovely & soft but find it very hard to rise in the morning. \n\nThe weather now is perfect, yesterday was quite hot. There was a letter from Doss when I got back last night, there must be more about somewhere for me.\n","64":"\n\nHad a lovely quiet day yesterday the weather was beautiful. We spent most of\n\n34\n\nthe day in the garden it was great.\n\nLast night we sat out in front with the Adjutant, Doctor & Vet & had a real good yarn. They are 3 of the best especially the Adjutant (Capt Glasgow). The Dr shouted two bottles of beer. It is going to be another fine day to-day.\n","65":"\n\nStill at Rubempré but expect to move in a day or so. Our Division is about to take a place in the front line of trenches, we’ve just received word from the General. \n\nI saw in orders the other night the sad fate of Claud Boone my old Rowing Club skipper. He had just joined his Battalion as a second Lieut. He was one of the finest chaps it has been \n\n35\n\nmy lot to meet. I feel very much for his home folk. \n\nThe bombardment lately has been very severe, the large guns make this place rattle again. \n\nI have been for some great rides lately in the Car. Saw Reg White the other night it was like old times yarning with him. I get on well with the folk here sat up until 11 o’c last night trying to pick up a little French. The girl is charming What! by name Jeanne. We have great fun getting grass for the rabbits of an evening.\n","66":" Left Rubempré yesterday & cycled to this place called Senlis, a very old looking place with plenty of deserted houses, one of which we are\n\n36\n\nbilleted in. \n\nEvery move we creep up closer to the line & last night I strolled up to the top of the hill behind us & saw a sight which I’ll never forget. A fierce Artillery battle was raging a few miles off & the roar of the guns was deafening. It was a wonderful sight, the sky was illuminated with bursting shrapnel & star shells, a fascinating sight but one which made one think. \n\nI will very likely see more of it as I hear the HQrs. are moving to Albert a town that is shelled pretty constantly. We passed numerous Ambulance wagons on our way here full of wounded but the chaps were all smiles.\n","67":"\n\nWe have decided to stay\n\n37\n\nhere at Senlis as a billet couldnt be found for us in Albert. I went in with the Colonel the other day in the car to have a look round. The beautiful town is a wreck, they continue to shell it periodically. I saw the lovely Church with its’ steeple all damaged. The statue of the Virgin Mary at the top was hanging over pointing to the ground. We went through the town and called at the Tramway which conveys rations etc to the lads in the trenches manned by our horses & men. They have a very risky job & already one chap has been wounded, while several horses have gone under.\n\n38\n\nThe bombardment last night was terrific, this place rattled again. A good many shells were dropped very close here, the reason being we having a large gun close by, & they are trying to locate it.\n","68":"\n\nHad a couple of hours with Reg White last night. Took him round to see Eric. He is still the same old Darky. Have just received word about Sailly being ruined with Shell fire we just got out in time.\n","69":"\n\nWent for a spin in the car last night after tea to a placed called Warloy. It was a treat, didnt get back until about 11 o’c & then \nthe\n we set to & made a billy of cocoa & had a slice of toast.\n\n39\n","70":"\n\nLast night we had a poultry supper it was first Class. One of our motor drivers ran over them yesterday afternoon & our cook turned them out in great style.\n","71":"\n\nLeft Senlis this morning about 8-30 am for Canaples, our old haunt. We cycled all the way, called at Rubempre & had a couple of hours at our late billet there. Jeanne seemed very pleased to see us. \n\nThe wagon caught us up there & we had dinner & then pushed on for this place & arrived safely after experiencing my first puncture caused by a nail out of a Tommies boot. \n\nWe are not in the mairie this time but not far away from it.\n\n40\n\nCalled & saw my little girl by the babbling brook & received quite a welcome. It rained the day prior to leaving Senlis rendering the roads in parts practically impassable. It is raining now my water-proof cape is just it.\n","72":"\n\nStill raining & it looks like setting in. Felt pretty weary last night after 25 miles ride & slept like a top. \n","73":"\n\nWent for a lovely spin in the Napier last night to Senlis it was great. Called at our old billet in Rubempre coming back & had a wine. The Driver (J Lean) let her out coming home from there, gee, she did travel. Boiled the billy had a good cup of tea & turned in.\n\n41\n\nA Division of Grenadier Guards went through to-day, they looked fine.\n","74":" Left Canaples for Rubempre at 10 am per Motor Lorry. No billet there for us so had to turn to & build one with a large tarpaulin. It turned out very cosy I slept on the table.\n","75":"\n\nRained nearly all day, called to see the petite fille of the Estaminet. Went down for the mail after dinner & was lucky in getting 6 letters & a parcel containing cake & sweets. Spent the evening singing hymns it was great.\n","76":"\n\nLeft Rubempre early & are now quartered in our old billet at Senlis.\n\n42\n\nIt was rotten travelling by bike it rained nearly all the way rendering the roads in parts practically impassable. Encountered troops both coming & going which made matters worse.\n","77":"\n\nLast night we had a tip top sing song in the kitchen at the back it was great. Sang all the old songs accompanied by a mouth organ. I turned in about 10 o’c but they still kept it up. I was nearly asleep when one of the chaps brought me in a steaming hot cup of coffee it went down well. The kitchen is just off the office, very handy.\n","78":"\n\nThe skipper took me for a spin to Albert last night, went as far as the Tram dump. Coming back motored \nback\n right under-\n\n43\n\nneath the drooping Virgin. It was a lovely ride & the view from the top of the hill was wonderful. Star shells lit up the sky also the roadway. Had a cup of coffee when I got back it went down well. The Adjutant secured a German Howitzer shell case for me, the only souvenir I have of this Front (Somme). \n","79":"\n\nAm still in Senlis but am expecting a sudden move any minute.\n\nLast night about 30 shells were dropped near by landing amongst some horses & doing a fair amount of damage. This afternoon I rode up the hill & witnessed a German bombardment. They were lobbing them on top of the next rise\n\n44\n\nabout 1 mile away (airline) I should say. You could hear them singing through the air & then plonk & up would go mother earth. They were also firing shrapnel, you could see a huge mass of black smoke & then a terrific report. \n","80":"\n\nLeft Senlis at 9 am this morning & travelled per Motor Lorry to Rubempre & are camped in an old barn. We are only here for a day or so. Am in hopes of joining up with the other portion of the Coy. We are on our way to Ypres or somewhere near it.\n","81":"\n\nQuite a lot has happened since the 5th. I am writing this in our suite of rooms at Reninghelst (Flanders). Well to get back a few days\n\n45\n\nWe arrived at Rubempre safely on the","82":" & left again on the","83":" \n\nThe night before leaving three of us arranged an impromptu moonlight excursion into the country. All the heads were well out of the way so we commandeered the Napier Car & set-off. The party consisted of Jim Lean (Driver) Art Mitchell (Cook) & myself, a merry party & ready for anything. We soon boarded all untensils & eatables, also a box broken up into portable peices, as firewood is very scarce in these parts. When a tree is felled every chip is picked up. \n\nWell we were soon whizzing out into the country & drove across a field (wheat) \n\n46\n\nwhich had recently been cut, to a solitary tree slightly in a hollow. We soon had a fire blazing & the billy on. By this time the moon was well up & the picture we cut would be more easily imagined than described. We had Coffee & milk & it was great also French bread & issue butter & biscuits, I don’t remember ever enjoying a supper so much before. Jimmy Lean sprang a cigar each coming back & the three of us seated in the front looked the real thing. We arrived back about 10 pm after a very enjoyable evening.\n\nNext morning we left about 7-30 am in the Car for Reninghelst. The party this\n\n47\n\ntime consisted of The Adjt. Jim Lean, Tom Walsh & this. It was a lovely crisp morning & was great whizzing along at about 40 miles an hour. Made Doullens for bfast where I bought a pound of steak & had it cooked it went down well. Had dinner in Merris, our late landlady was very pleased to see me. We were the only soldiers in the town at the time it seemed very quiet & peaceful. \n\nOur next stop was this place, but pulled up about a mile & a half out of town at the other half of the Coy. The first two I saw were Rod & Bill Colman who were very pleased to see me. I was bombarded with questions\n\n48\n\nHack turned up later & I had tea with them & stayed there all next day & next night the reason was our stuff going astray. Came by Motor Lorry & turned up intact. \n\nWe are in very good quarters here, built by the Engineers of weatherboard. My friend & I have a nice bedroom with two home made beds so we are “home & dried\". Mitch is still cooking for us & is a dag. I was greeted with a huge mail the first day also numerous papers.\n\nWe are situated a few miles this side of Ypres near Poperinge. Had occasion to go into Steenvoorde yesterday in the car it was great.\n","84":"\n\nReceived more papers to-day.\n\n49\n","85":" The weather has been very cold lately, have all available clothes on every night. By jove it hurts getting out of a morning. More letters to hand to-day my mail is coming along splendidly now.\n","86":"\n\nLast night Hack called & we went for a ride into Poperinge about 3 miles away. It is a fine large place & shows \nplenty\n signs of street fighting & bombardment. It was alive with soldiers but very few civilians. We were on bikes so had to watch them very carefully this is a great place for bike thieves. Bought a Belgian Hand made lace H’chief & had a long yarn to the shop keepers, two charming Belgian lassies.\n","87":"\n\nHad a game of Crib last night. The skipper joined in & made\n\n50\n\na pleasant evening of it. The nights are very sharp now, all available clothes go on the bed before turning in. We are to be issued with an extra blanket to-day I believe très bon.\n\nThe Colonel returns to-day from leave in London. Have had Major Charlton Commanding in his absence.\n","88":"\n\nWent to Church last night first time for a long while. The speaker was great could have listened all night. Had some old hymns which took me back home.\n\nThe weather has been beautiful lately the days are quite warm.\n\n27-9-6.\n\nReported to-day that Thiepval has been taken. The Colonel brought the news from D.H.Q.\n\n51\n","89":"\n\nLast night just before tea a disabled Hostile observation balloon was seen to be adrift floating in our direction. Our aeroplanes were round it like sparrows, dropping bombs & using machine guns with good effect. It was pretty to watch them swooping & diving under it & over it for all the world like crows arround a carcase. She sank slowly & when near the earth burst into flames, finish of a German sausage. \n\nWe couldn’t distinguish the smiles of the Pilots as they flew past us on their way to the Aerodrome, which is not very far from here.\n","90":"\n\nAll clocks were put back one hour last night so had a long night’s sleep. It has been a beautiful day to-day\n\n52\n","91":"\n\nBill & Rodger called & we went to Church. It was great, the Archbishop of Perth preached, Chaplain in Chief of the Aust. Forces. Had a cup of coffee at Juliette’s place across the road.\n","92":"\n\nPromoted to Acting Corporal\n","93":"\n\nHad some great games of cards last night. Geo. Veitch came down & the Skipper joined in & with the W.O. made a four hander.\n\nThings are very quiet on this front no excitement at all lately, not even mail to break the monotony.\n\nAm a constant visitor across the road for coffee, they are very nice folk. The only lad has just turned 18 & he left this morning to join the Army. His mother is very much cut up so is Juliette, he was a nice lad.\n\n53\n","94":"\n\nFrank Goodear (Postal Staff) & I went in to Poperinghe on bikes this afternoon & stayed in there for tea. We had a good look round the old place. Had our photos taken by a very nice young lady. Coming back pulled up at a wayside cottage & had a lovely cup of coffee & a good yarn to the old folk. It is remarkable how fluently they speak English. Called in to see Juliette & had another cup of coffee there, we are gluttons for coffee. \n\nReceived 7 letters to-day, bosker ones from home & Tom. Was pleased to get Claude Boone’s photo have it pinned up in front of me.\n","95":"\n\nEric Clarke, Geo Veitch & I cycled into\n\n53\n\n54\n\nPoperinghe this afternoon. It was A.1.\n","96":"\n\nFirst frost this morning by jove it was cold. The duck-boards around the place looked lovely under a snow white crust. It has turned out a lovely day, beautiful in the sun. The Aeroplanes took advantage of the clear morning & were fairly active.\n","97":"\n\nFrost heavier this morning the house tops were snow white & glistened in the early morning sun. \n","98":"\n\nAm just about to turn in after a busy day. We leave to-morrow for Steenvoorde but only for a day or so from there we are making for the Somme\n\n55\n","99":"\n\nLeft Reninghelst by car on the","100":" for Steenvoorde. Arrived safely & left again on the","101":" for this place Ailly le Haut Cloche (Somme) Last night was our first night here as there were no billets. We billeted in Abbeville the previous night. Secured a tip top bed (two of us) it was just it.\n\nTo get back a few days. On arrival at Steenvoorde we were dumped on the","102":" Coy & as they were crowded out I had a look round the town. Enquired of the H Qrs Q.M. as to billets & he gave me a slip which fixed me up for both nights free. It was a lovely little room overlooking the square. A large double bed with clean sweet clothes & all bedroom conveniences, I fell\n\n56\n\non my feet alright. A Sgt tried to do me in for it with a slip but his had the wrong number. It was an Estaminet & the son was a lad about Nev’s size. He spoke fairly good English & asked what time I wished to be called each morning.\n","103":"\n\nGot away from Steenvoorde alright in the car & spent 3 or 4 days in Ailly le-Haut Clocher. Left there yesterday & are now in Vignacourt & have a very nice billet. Am a member of H Qrs NCO’s mess now & am living well. It’s not known how long we will be here.\n\nAt Ailly the folk where we messed were fine. Fell in love with Ernescile a rosy cheeked damsel with roguish eyes.\n\n"}}