{"Document Name":{"0":"Diary_0068","1":"Diary_0068","2":"Diary_0068","3":"Diary_0068"},"Date":{"0":"unknown","1":579.0,"2":580.0,"3":647.0},"Entry":{"0":"\n\n","1":"\n\nI wonder how poor O'Dell is getting on. They tell me that he had to be strapped to the stretcher before he got to the beach, he was off his head with pain. I have just been reading a \"Bulletin\" belonging to him. On one page I notice written in pencil \"Molly O'Dell\" Dear Mollie & My Dear Wife. Poor old chap, he sometimes spoke of her to me. He evidently thought the very world of\n\nI should not after all save my appetite for dinner for great things were to happen yesterday as Smithy, \"Rosie\" & I with some freinds were invited by one of Smith's freinds to go out to the Simla in the harbour & have dinner with them. I wondered how I would get on for funds","2":" being all I had but thought I would take the risk & any way in this \"Rosie\" proved a real darling. Five of us started off down to the wharf with big ideas of rowing a boat accross. (We had all just seen the old Doc who as I said obligingly had put us on Ordinary, but would have had a fit I am afraid had he known what we had in the wind). We got to the wharf & could not get a boat\n\nthem back & the New Zealanders had to retake the position again. The Ghurka went to get alongside the Aust. again. They say the Tommies retreated & left them to be cut up. Right through. Our chaps have shown well & one cannot help but be proud of them. Later on I hear that the Tommies have done well but all hands have lost heavily. There is one thing about the Tommie, he will always come again no matter how often he gets knocked back. But our lads wont be knocked back they stick it & fight it out. I heard but cant vouch for the truth that for one attack 15 Aust were put in with every pontoonof pommies to stiffen them up to it.\n\nAnzac\n","3":"\n\nWe have to do duty as orderlys in the telephone at DA 2MG now again, started today, it looks like as if they are trying to keep us down here, making work for us. While I was on duty this morning a shell (must have been from a Howitzer) landed fair in the center of the gully right in a chaps dug out, fortunately he was out & it was laughable this evening when he came back from work when he saw the remains, his blanket was scattered about the pen in six in bits so you can guess what the rest was like. Last night Davies & I went to the top of the hill &\n\nhad a look at a bit of a demonstration & bombardment which was going on, on the Left, it was a great sight but it was impossible to tell what was doing. This afternoon when we were up near \"Piffle Pore\" (Indian's Camp) a shell came over us, we heard it coming & bobbed, & burst with in a few feet of us, too close to be healthy. A sergeant came back to see if we had departed this life. Just now there has been a burst of rifle fire & bullets have been singing in close proximity. Last night an Areoplane dropped a bomb & again this morning but no damage, I think their shell fire has played up with us a bit though it was constant.\n\n"}}