{"Document Name":{"0":"Diary_0211","1":"Diary_0211","2":"Diary_0211","3":"Diary_0211","4":"Diary_0211","5":"Diary_0211","6":"Diary_0211","7":"Diary_0211","8":"Diary_0211","9":"Diary_0211","10":"Diary_0211","11":"Diary_0211","12":"Diary_0211","13":"Diary_0211","14":"Diary_0211","15":"Diary_0211","16":"Diary_0211","17":"Diary_0211","18":"Diary_0211","19":"Diary_0211","20":"Diary_0211","21":"Diary_0211","22":"Diary_0211","23":"Diary_0211","24":"Diary_0211","25":"Diary_0211","26":"Diary_0211","27":"Diary_0211","28":"Diary_0211","29":"Diary_0211","30":"Diary_0211","31":"Diary_0211","32":"Diary_0211","33":"Diary_0211","34":"Diary_0211","35":"Diary_0211","36":"Diary_0211","37":"Diary_0211","38":"Diary_0211","39":"Diary_0211","40":"Diary_0211","41":"Diary_0211","42":"Diary_0211","43":"Diary_0211","44":"Diary_0211","45":"Diary_0211","46":"Diary_0211","47":"Diary_0211","48":"Diary_0211","49":"Diary_0211","50":"Diary_0211","51":"Diary_0211","52":"Diary_0211","53":"Diary_0211","54":"Diary_0211","55":"Diary_0211","56":"Diary_0211","57":"Diary_0211","58":"Diary_0211","59":"Diary_0211","60":"Diary_0211","61":"Diary_0211","62":"Diary_0211","63":"Diary_0211","64":"Diary_0211","65":"Diary_0211","66":"Diary_0211","67":"Diary_0211","68":"Diary_0211","69":"Diary_0211","70":"Diary_0211","71":"Diary_0211","72":"Diary_0211","73":"Diary_0211","74":"Diary_0211","75":"Diary_0211","76":"Diary_0211","77":"Diary_0211","78":"Diary_0211","79":"Diary_0211","80":"Diary_0211","81":"Diary_0211","82":"Diary_0211","83":"Diary_0211","84":"Diary_0211","85":"Diary_0211","86":"Diary_0211","87":"Diary_0211","88":"Diary_0211","89":"Diary_0211","90":"Diary_0211","91":"Diary_0211","92":"Diary_0211","93":"Diary_0211","94":"Diary_0211","95":"Diary_0211","96":"Diary_0211","97":"Diary_0211","98":"Diary_0211","99":"Diary_0211","100":"Diary_0211","101":"Diary_0211","102":"Diary_0211","103":"Diary_0211"},"Date":{"0":"unknown","1":1064.0,"2":1065.0,"3":1066.0,"4":1067.0,"5":1068.0,"6":1071.0,"7":1074.0,"8":1075.0,"9":1076.0,"10":1077.0,"11":1089.0,"12":1102.0,"13":1103.0,"14":1109.0,"15":1122.0,"16":1123.0,"17":1165.0,"18":1180.0,"19":1181.0,"20":1182.0,"21":1184.0,"22":1185.0,"23":1186.0,"24":1199.0,"25":1203.0,"26":1204.0,"27":1205.0,"28":1206.0,"29":1207.0,"30":1211.0,"31":1214.0,"32":1215.0,"33":1216.0,"34":1221.0,"35":1222.0,"36":1223.0,"37":1233.0,"38":1243.0,"39":1247.0,"40":1248.0,"41":1249.0,"42":1255.0,"43":1264.0,"44":1265.0,"45":1268.0,"46":1273.0,"47":1274.0,"48":1275.0,"49":1277.0,"50":1278.0,"51":1280.0,"52":1281.0,"53":1282.0,"54":1294.0,"55":1296.0,"56":1298.0,"57":1305.0,"58":1308.0,"59":1319.0,"60":1322.0,"61":1325.0,"62":1328.0,"63":1330.0,"64":1342.0,"65":1343.0,"66":1344.0,"67":1347.0,"68":1352.0,"69":1353.0,"70":1354.0,"71":1355.0,"72":1360.0,"73":1365.0,"74":1366.0,"75":1367.0,"76":1369.0,"77":1370.0,"78":1382.0,"79":1383.0,"80":1384.0,"81":1387.0,"82":1390.0,"83":1393.0,"84":1404.0,"85":1405.0,"86":1411.0,"87":1414.0,"88":1415.0,"89":1420.0,"90":1428.0,"91":1429.0,"92":1436.0,"93":1444.0,"94":1445.0,"95":1448.0,"96":1459.0,"97":1460.0,"98":1461.0,"99":1473.0,"100":1474.0,"101":1475.0,"102":1480.0,"103":1481.0},"Entry":{"0":"\n\n","1":" Had a fairly good time in \nSteelingrade\n Vignacourt secured a good billet (front room). I joined the 11 other NCO’s mess there & we dined right opposite. Fell in love with the daughter \nthere\n a dark eyed kiddie about 9 years old. She was a lively kid gave me a card of their place as a souvenir.\n\nLeft Vignacourt on the 8th per French motor bus & travelled through beautiful country mostly pasture land with small flocks of sheep with their shepherds dotted about. It was lovely scenery. Passed through Amiens. Arrived safely at this place Ribemont after being carried on a few miles. It is a deserted dirty place but we are in a good place the\n\nVillage Chateau a fine big mansion. We have one of the back rooms which opens on to an old built up verandah covered in creepers. The grounds have been beautiful at one time but troops have cut it up a good deal. It would be an ideal spot to write a novel from I think Mrs Henry Wood and other \"deep\" authors must have resided in such a place.\n\nHad quite a Xmas last night received two parcels a couple of days ago & sank into them last night. Geo Veitch & a couple more lads of the coy. came along and all enjoyed the good things. Made a large hole in Dorie’s cake, it was great. The parcels were from home & Dorie.\n","2":" Bill & Rodger called last night & we finished up Dorie’s cake & ginger & then took a stroll to the ymca & joined in a few hymns. It was held in a tumble down old barn with candles for lights. Sang a lot of the old hymns with a violin for music, I thoroughly enjoyed it.\n\nWe heard today that Brig. Gen. Glasfurd","3":" Aus Inf Bde died of wounds received yesterday. By all accounts it was a chance shot. \n","4":" Left Ribemont per Daimler car with Adjutant & Major Charlton & are now in the much battered town of Albert in comfortable diggs. Have the front room of the house & a fire blazing in the grate. Well to do folk have lived here. At one time the furniture \n\nIs of the best. The place is full of gold framed mirrors. Have to light the candles at 4 pm. now the nights are very long.\n","5":" Took a walk to the Coy lines this afternoon. They are situated about \n\n1½ miles out in a sea of mud gee she is sticky. Found Rod & Bill digging a dugout for themselves. Jove it was cold the wind seemed to go right through you. Took to me sheep skin vest for the first time these are the things alright, the majority of our lads have them.\n\nGoing out I saw a sad sight. A burying pair were busy filling in a trench where lay wrapped in blankets & close together 6 of Canada’s sons. It brought the horrors of war \nindecipherable\n home to one.\n","6":" Nov.1916. A year ago today the old Persic steamed out of Sydney Heads. What a day it was, one that I’ll never forget.\n\nIt snowed this morning for the first time gee it was cold. Everywhere looked beautiful shrouded in the purest white. I indulged in a bit of a snowballing.\n\nOur fire is kept going all day, we would freeze only for it. Make cocoa before turning in. Every night the skipper was cook the first night Dorie’s tin is nearly done but have one from Home untouched yet.\n","7":" Heard that the other half of the old","8":" Coy. were nearby so took a stroll there this morning & found them\n\nSaw Tom Riordan but Eric Forbes was away. It was great seeing all the old faces again. We had a great yarn.\n","9":" 8 pm. Phone message just received saying that Eric Clarke was evacuated with wound in head & shell shock. Geo Veitch floated in here to-night suffering also from shell shock. They did a good bit of damage by all accounts up at the Supply Dump at Montanban.\n","10":" Sitting round the fire in Rue Peronne Albert. Shells of fairly large calibre are screaming & screeching over head & lobbing about 100 yards away making a terrible din. One wonders where the next will drop.\n","11":" Had a days leave in Amiens yesterday it was great. Left here about 8-30 am. in the Napier Car with Lt Hade & picked up two motor lorries at Ribenont in which we journeyed to the old city before mentioned. After briefing & loading the lorries with oil cake we parked them in a quiet street, & left orders to be ready to move at 5 pm. It was then about dinner time so we went in search of a grub house. Found a good place & partook of a sumptuous meal the best I’ve sat down to for a considerable time. We then wandered off to see the city. Visited the magnificent Cathedral a colossal\n\nstructure which opened my eyes to their utmost. The wonderful historic masonry is all protected with sandbags. The beautiful organ is set in at the back at a dizzy height but only half way from the arches ceiling so the height can be well imagined. The building towers above all the surrounding moderate sized places & can be seen from any part of the town & for miles before reaching it. It was indeed well worth a visit the mountings inside are gorgeous. What struck me more than anything were the windows they beat anything I’ve ever seen. It was a bright sunny day so the coloring shewed up to perfection.\n\nFrom there we sauntered round viewing the latest modes. Gee. Beautiful women & girls one has to see before believing. After being in these deserted villages for so long these fairly took my breath away.\n\nHad my hair cut alongside a French General wonderful!\n\nOn passing a photographers I suddenly decided to try my luck. Was met at the top of the stairs by a lovely girl, thought my heart would bruise my ribs. She spoke fairly good English so my bad French wasn’t necessary. She beckoned me to sit on her chair at the desk \nwhile\n to write my name etc while she directed operations at my elbow.\n\nI prolonged the \nagony\n bliss I assure you. Invited me to call back again that day but time would not permit. I was vain enough to think I scored a hit. Mr Wade was waiting for me & we strolled around with eyes well open. Had a light snack coffee & cakes for tea & made for our automobiles & were soon wending our way back leaving frivolity behind us. It is a beautiful road from Amiens to Albert straight as a dart with one exception place called Querrien where it bends & starts \n\noff a fresh. Tall trees border the road the whole distance, I’ll leave the rest to imagination.\n\nArrived back safely after transferring into another lorry at Ribemont. A good fire & hot cup of cocoa was waiting for me here & I tell you it was welcome after riding in the front seat of a lorry on a cold night.\n\nOn my pad were three letters. One in the welcome handwriting of Ida one from Ruth & one from my Belgian princess. Here endeth my day in Amiens \n","12":" Almost forgot about my diary but nothing except the daily routine has happened worth relating.\n\nHaven’t heard a word of Eric since he went to Hospital hope he is alright.\n\nIt is very cold again feels like another fall of snow.\n\nAm receiving a good many Xmas cards but only one of my home parcels have turned up so far.\n","13":" Freezingly cold; Snow began falling about 3 pm & in no time everywhere was white. It is a grand sight to see the white flakes fluttering to the ground. I stood out in it for quite a time. Hope it snows Xmas day.\n","14":" Spent a very enjoyable Xmas considering. Had a splendid spread in the officers mess room. Nuts & sweets of every description adorned the oval table. A juicy roast & green peas substituted Turkey finishing up with Plum Pudding jellied blanc mange preserved fruit & cream & had as much as one could eat. I was elected to sit at the head in the arm chair.\n\nThis was in Rue Peronne Albert have been here since the","15":" of last month. The tea was a success too. After tea Bill Ackland & Les Lee called & a little later Horace turned in so we had quite a little gathering in the office here all the Officers being out. Acko turned up Horts days ago gone. I was glad to see him also Les they are billeted only about 100 yards from here.\n\nReceived word from Eric the other day he is in Oxford England No 3 Southern Genl Hosp so spent Xmas in Blighty.\n\nNo snow fell today was hoping it would. \n\nMails disappointed us for Xmas may turn up before New Year.\n\n2-1\/17.Spent new years day in Amiens with Acko & had a splendid time. Partook of an excellent dinner our companions at table were a French Adjutant & his wife. The former spoke a little English & with my little French had quite an interesting conversation.\n\nRoamed round the old city sight-seeing myself having been there before acted as guide. \n\nOnly once did the place turn right around but were soon righted by a friendly kiddy.\n\nThe beautiful strains of an organ enticed us into a fairly large church but the service finished soon after we entered. We were both sorry the organ was lovely I was all out in goose flesh.\n\nWe went in per Motor Lorry & back by train part of the way the rest per buz wagon. It was in the train I met \"her\" – Usual thing I always meet \"her\" in train tram or boat but this one was indeed a peach growing at Corbie. There were a couple of French Soldiers in the carriage & one was a singer & sang a couple of very pretty songs & taught me the chorus of one. His fiancée wrote out the words & sent them to him. He was a jolly spark was sorry when they got out.\n\nWe detrained at Mericourt & there I met a driver of a motor lorry I knew so we were in lucks way. Arrived back in good order to find\n\nabout 12 letters awaiting me including a card from Joan. How I did enjoy myself. Dorrie judges the time well with a lovely New Year Card. Here endeth my second day in Amiens. Last New Year was spent in Cairo some traveller eh!\n\nThis afternoon the Major asked me would I like a spin in the car to Quarry near Montantang, where Eric was wounded. It is indeed a wonderful place from a military point of view. Mud mud mud as far as you can see with huts, tents, dug outs old trenches wagons horses & men its an interesting sight. Villages that were are not, having been rubbed clean off the map. Trees\n\nstripped bare with shell fire & in many cases only the stumps are left. The ground is all honey combed with shell holes. On our left going up half a dozen heavy batteries were spitting fire the spurts of flame only were visible. Soon after we arrived at Quarry the batteries all around us opened fire & for about ½ an hour the din was deafening. Fritz took it all without a word not a shell came over. Our grins gave him h-l.\n\nComing back the sun was setting & the sight from the Peronne road was one that will live in my memory. We passed old German trenches & also their grave yards cared for in that they are not interfered with. It was an eyeopener to travel through such country I assure you.\n","16":" Things very slow weather rotten. Cold driving rain blew all day adding more juice to the roads.\n\n23-1-17.Coldest day yet felt. After washing I walked 25 yards without my cap the result was combed fine ice out of my hair had a job to pull the comb through it. Dinkum. I leave to–night for Blighty so all is bustle.\n","17":" Have been back about 4 or 5 days. Spent a glorious time in London it is the spot alright everyone seemed happy an ideal place for a spell. All the ponds in the parks were frozen & ice sliding was the order of the day what a time we had.\n\nI went down to Oxford to see Eric, he looked splendid. My friend & I (Billy Cosgrove) also spent a day in Birmingham visited friends of his & they treated us like kings. The rest of the time we spent in good old London town. I stayed at 35 Inverness Tce Hyde Park with Mr Ferranti. The English girls are very nice we met some regular sports. Had two to see us off at Waterloo Station one was the Loddgate keepers daughter at Regents Park. Had a good trip across the Channel submarines were sighted but we slipped them. A boat from Harve turned back chased by them & another boat rammed one so we were lucky. Secured berths on\n\nthe Connaught coming back Chief Stoker’s bunk & they fed us up tip top, for a few bob it was worth it I assure you. We were at Havre about 4 days & they marched us about 6 miles on top of a hill to a Rest Camp (tents) gave us 3 blankets & bully & biscuits. We went forth scouting & discovered a Belgian family. Lady little girl (Blanche) & a soldier husband. They took us in & fed us & gave us bedding to put down in the kitchen. We paid them of course but we received great kindness at their hands they couldn’t do enough for us. Got them sugar (very scarce commodity) milk & fuel from the neighbouring cookhouse so were right in the boom.\n\nThe little girl Blanche was a darling about 6 years old, jove we had some games with her. She spoke English very well so did her mother both having spent 18 months in England. The father couldn’t speak a word & it was funny to hear the little kid interpreting she was a wonder. Would come in every morning & try to pull us out of bed. She could recite small pieces of poetry in English her favourite was \"my letter\". She would make us imaginary morning & afternoon tea with her toy set & sometimes would do us a dinner. We taught her how to play grab with the cards & several other games.\n\nHer mother gave us a photo each of herself & Blanche a very good one too taken in England.\n\nWe eventually left & secured a berth in a hospital train so our luck stuck to us on the way back as it did going & while over there. Gee it was cold at Havre though we peeled spuds for our hostess & in half an hour they were frozen that was in the kitchen incredible don’t you think? We washed in warm water but you had to hurry it didn’t stay warm long. Your towel would be like a board in a very short time if left in the wash-house. Ice was 5 or 6 inches thick on the roads & consequently very slippery. Snow was lying across where\n\nFound the Train in the same place it is over 3 months since we arrived here.\n","18":" Still in Albert. Two or three HEAVY shells lobbed quite close this morning disturbing our Ordnance Stores & wounding a Warrant Officer & a Sgt. They did make a clatter I assure you. \n\nThe germans are retreating along our front & our chaps are giving chase with good success.\n","19":" The above Warrant Officer succumbed to his wounds on the","20":" A fine chap he was too Owens by name.\n\nIn last nights orders my rank (Cpl) was confirmed from 1-3-17, anniversary of the formation of the Train.\n","21":" 25 to-day gee whiz. Received 6 letters yesterday but none to-day.\n","22":" Bapaume fell into our hands this morning, our lads took it","23":" Division). Good news from all fronts.\n","24":" Our lads are still advancing great excitement when the papers arrive.\n\nHeavy guns are being moved up quite a number went past today.\n\nWeather is unsettled, sunshining one minute & snowing the next. Its fairly cold but nothing like it has been.\n","25":" Moved from our billet in Rue Peronne Albert to this place 114 Rue Bapaume Albert expect to go to BAPAUME on the","26":" This is not a bad place a shell came through the roof & out the outside wall of the passage without exploding. It’s a three storied house so it \n\nmust have been some shell. You can see daylight right through it. It is the only damage done though so we are fortunate believe there are no buildings at all in Baupaume.\n","27":" Arrived safely n BAPAUME after a trip I shall never forget. We came by motor lorry & the sight was past all imagination. The village of Le Gars was completely demolished not the smallest portion of a wall standing it was enough to break ones heart. I thought of the folk that once lived there in peace & happiness. The fighting was very severe at this particular point the ground as far as you could see was pitted with shell holes a wonderful sight. \"Duds\" from 18 pounders were sticking in the trees bordering the main road from Albert. The\n\ntrees were all shattered & in some cases only stumps were left. German shells of huge calibre (\"duds\" & abandoned) were scattered all over the country as were small crosses marking the place where fell a soldier whose life was given for his country. One of our chaps was buried near the roadside & for a cross his rifle was stuck in the ground & a pick handle placed through the trigger guard on top was placed his steel helmet through which a bullet had passed. This was near Le Gars & it was near this spot I met Arch Hobden marching back with a section of stretcher bearers I got a shock to see him thought he was in England in one of the hospitals. He was in this great advance & his experiences will be worth hearing.\n\nA few miles before reaching here we saw several German dead, quite close to the road it was an awful spectacle.\n\nFritz has a railway running parallel to the road & our gunners must have got wind of a loaded train at a certain spot, they blew it to ---. Loading of numerous descriptions was scattered among the debris the whole train was a total wreck. We mined the road in several places causing huge mine craters but our Engineers soon had roads made round them.\n\nThis is the roughest billet we’ve ever been in. The town is in a shocking state. He blew every house up before leaving & left secret mines worked by\n\nclocks in the houses he spared. The Town Hall went skywards 7 days after the evacuation killing a good many including 7 Comforts Fund chaps who were running a Coffee stall there. Secret wires were found in the cellar of this \"mansion\". Experts were called in to examine & pronounced it safe still we are living in a delightful uncertainty. It was funny putting our beds down last night, gee it was breezy. Our Pay Sgt, McLaughlan & myself slept side by side on a once tiled floor. I secured a board & let down a folding table to sleep on. One was about an inch higher than the other but that was nothing I was dry. The Pay Sgt. Said as he turned in \"Oh well Stan if anything happens to me a cross made from a \n\nBacon box will do me.\" It would have been a poor lookout for me if anything had \nhave\n happened to him. His name is Coogan from Parramatta.\n\nThe Skipper comes back today after 4 days in Paris. I tell you I’m not sorry. No one came in to relieve him so I have been kept going.\n\nTwo chaps are digging outside & I just heard one say \"here’s a shank bone\" what callous hearted wretches soldiers are.\n","28":" An observation balloon escaped today & an anti-aircraft gun about 100 yards away opened fire but it was soon lost in the clouds. There is plenty of rain about & no billets for the place is in a mess, one \nwithout receiving\n could not imagine the destruction.\n\nFritz started shelling like h—l this morning & kept it up intermittently throughout the day. They were of large calibre & made a sickening noise singing through the air. They lobbed as close as 100 yards away making this old place rattle again. It is funny to see all hands duck the feeling is one not easily described. The majority of the shells were duds but those that did explode tore things about.\n\nA good many German prisoners went through to-day escorted by our lads also quite a number of our chaps went past wounded. There was a big stunt on last night the","29":" Btl. went over the \"bags\" & were successful in gaining their objective. It sent a \n\npeculiar feeling through me to see the empty motor ambulances going towards the line in the afternoon, it’s a cruel war alright. \n\nJove it was cold this morning I nearly froze in this draughty place to cap all it was very windy & didn’t it whistle thru the cracks. To-night about 5 pm it started snowing & it immediately became warmer. It is still snowing the heaviest fall we’ve ever had.\n","30":" A Taube came over this afternoon & descended on two of our balloons & sent them both to the ground in flames. He circled very low above our heads firing his machine gun the lads on the road rushed this place for shelter it was quite exciting. A large shell exploded close\n\nto the horse lines of one of our Coys.","31":" just across the road from us what a din. \n\nIt is unofficially reported that they got the Taube before mentioned hope it is true he would take some valuable information back else. He was a brave man though & deserves to live but would be safer as a prisoner.\n","32":" To-day was a sad day for us. Fritz has been shelling consistently for the last few days but to-day he lobbed a high explosive 8 inch shell into the farriers shop of our","33":" Coy. just across the road from us & killed 5 men (including my old friend H.O. Wilkinson who was with me in the Ofice for a time) & 16 horses. I hurried across & what a sight met my gaze.\n\nI shall never forget it. Dead horses mutilated severely were outstretched where they were tethered poor brutes it was an awful spectacle. I saw them carry away poor old Wilkins a breezy chap & loved by all. \n\nI was only there a few minutes when singing – bang!! went another one, & I saw bricks & timber high in the air in the direction of Train H.Q. a building obscured my view. I naturally hurried back but to find the place intact the shell blew the rear part, which was already in ruins, to smithereens. A lucky escape theres no doubt. We were in a hot corner alright & our Colonel ordered us to leave the vicinity until the shelling had finished the Bosche\n\nonly put a couple more in though.\n\nThe Coy. was ordered to move at once & I with Ferranti & a few more of the","34":" who had arrived by that time gave a hand & soon had them clear. We were in a direct line with a Railhead Fritz was feeling for. We remained there for the night & moved off early next morning & pitched our camp in the open near to the","35":" Coy. An exciting experience I assure you.\n\nThe poor chaps were buried next day in the Bapaume cemetery without any fuss. A clergyman officiated. They were all fine fellows. I shall never forget Easter Saturday. We were only a few days\n\nin our rough bivouac but it snowed nearly the whole time. Arch Hobden & Ern Victorsen popped in to see me one night I did get a surprise. Had a great yarn round the fire (an old drum) you can imagine how our tongues would wag. Saw some great air fights Fritz is pretty game in the air. \n\nWe left Bapaume yesterday","36":" & arrived here (Albert) same day & occupied the same billet we had before moving up. Our Division lost pretty heavily & are now in back area reinforcing.\n","37":" Anzac Day Am going to an Orgie at the","38":" Field Amblce to-night on invitation from Joe Hainwright Q.M.S. Was up\n\nthere a few nights ago & had a royal time. For supper we had Roast fowl & macaroni washed down with stout & champagne what a feed we had. Joe sings very well & plays the mandolin a little. I think we must have sung right through the Old Globe song book & finished up with \"The end of a Perfect Day\". Coogan just back from leave is coming with me tonight.\n\nReceived 19 letters a couple of days ago & 13 to-day they were held up somewhere. \n\nWe have had some glorious days lately something like good Aussie weather.\n","39":" Smith called to-night we had a great old yarn over old times our \"Albums\" much appreciated.\n","40":" Had a glorious swim in the River Arvere this afternoon it was a treat. The part where we (Charlie Ferguson & another Sgt) went in ran through the grounds of an old Chateau it was beautifully picturesque, the fruit trees were all in bloom & the garden trees looked grand, an ideal spot.\n\nReceived a letter from Eric saying he was booked for Australia lucky beggar.\n","41":" Left Albert for the North by Motor Lorry at 7 am & arrived here (Vieux Berguia) att 5 pm. A very pretty place, & hosts of nice girls & estaminets.\n","42":" Last night we (Coogan & myself) secured a tip top billet it was great between the sheets.\n\nIt was a lovely room with a big double bed & Coog & I tossed in together. Madame was waiting for us in the morning with a cup of coffee she was exceptionally nice. We are now billeted in the Village school have two front rooms & use of kitchen we are in clover the folk are goodo. Have secured two angle folding beds, tres fron. Went for a stroll with our Interpreter & visited quite a number of places the folk are tres tres gentile, hope our stay is not limited it is the nicest Village we have yet been in, the people are all so clean & the place is spotless. After we made our beds this afternoon I asked the 3 mademoiselles to have a look at our handiwork & they promptly tore into them\n\nand arranged the sheets to their liking laughing all the time they are great but elderly they were once sisters in a convent our Interpreter tells us. The darling little kiddies who come here to school gee I could dangle them all on my knee have already fallen in love with one little dear she has taken quite a fancy to me I think. \n","43":" Still at the school, the teachers residing here could not be nicer & the kiddies are lovely. Went for a ride on the bike last night with Horace to La Motte a beautiful little village in the centre of a large forrest It was a glorious ride.\n","44":" Moved from Vieux Berguin to-day to Bailleul & are billeted in a very fine house. The folk\n\nare refugees from Belgium & speak English very well. The little kiddie is a darling & loves dangling on one’s knees a very pretty kiddie with beautiful hair.\n\nExperienced a very touching good-bye at Vieux Berguin they were very sorry we had to leave. I was sorry too it was a very pleasant village all hands enjoyed their stay there.\n","45":" Had the afternoon off & sauntered forth on the bike to try & find Charlie Griffith & Acko & met with success. Found Acko on the corner near their camp & was told Griff would be already with his team any minute so we sat down on the edge of the ditch & waited. Sure enough he came along soon afterwards but did not notice me until \n\nhe was alongside & what a shock he got, nearly fell off the wagon. How did our tongues wag. We make arrangements to go into Steenwerck for tea but Griff found on arrival in camp he was on picquet so we dined quietly at the place on the corner where I found Ack. The conversation was pretty lively all wanting to talk at once, spent a very pleasant time. It’s great to meet Australians when y’re in a foreign land (Ginger Mick). I shall very probably see more of them now that we have joined forces with the","46":" Div. The weather is perfect & the country a picture.\n","47":" Fritz put about 30 heavy shells over last night & scared the devil out of the residents. They were all out in their night attire yapping like fish. The shells screeched right over our heads\n\nand caused very little damage. To-day quite a number trekked it for the station with their belongings & others have taken up their beds & walked to the nearest cellar. A sympathetic sight. The mother & little kiddie here are now sleeping in the cellar. The little kiddie is a darling beautiful wavy brown hairy & sweet face,\n","48":" Great excitement 2 or 3 Taubes came over & dropped bombs one dropping on an Ammunition Dump not very far away gee what a din terrific explosions were heard all day shattering most of the windows round about. When it first started the folk near by rushed this place to get in the cellar an unsafe place in my opinion. The girls were crying & all looked terribly scared a most exciting time\n","49":" Last night the big offensive started on this sector with huge success. All objectives were gained. (Messines)\n","50":" They were at it again last night it was a wonderful sight our heavies did pour it in making an awful din.\n","51":" Coog. Sid Mallett & myself rode over to Vieux Berguin on bikes & received a great welcome had a royal time.\n","52":" A repetition of","53":" only Horace came in place of Coog. We had a royal time they are very nice folk. Agnes is my girl ha! ha!\n","54":" Still in Bailleul. The early hours of this morning afforded great excitement. Fritz dropped a bomb & it exploded in a tree bordering the side of the road opposite this place & in a direct\n\nline with our window. A few holes were made in the wall above our heads but escaped uninjured. The window was smashed & the ceiling pitted with holes & we were covered in bits of glass, mortar & dust. I’ve never been awakened so suddenly before the report was terrific. The roads are very narrow so the explosion was delightfully close. The residents got a scare they lined up out in front yapping like fury we yelled out through the window \"Alle tout de suite\". They mobbed our room afterwards nice girls & all while we were still in bed we must have cut a funny picture.\n\nOur Anti Aircraft guns brought down a plane to-day from almost above our heads it was a grand sight. \n","55":" Harry Sneddon found me to-day we had a great old yarn.\n\nA letter from Eric saying he is leaving for Aussie end of this month & he also told me Jos Read had left for home poor me.\n\nReceived word of Fred Dowell’s death from Feve a couple of days ago it came as an awful shock I feel for his folk at home.\n","56":" Left Bailleul for Steenwerk by motor lorry are in a splendid billet.\n","57":" Still in Steenwerk. Have witnessed some good air fights here & Mrs Bosche delights us every night after dark with bombs & machine guns from Aeroplanes. Coog & I have a good bed & a kind lady cooks for Coy of us so we are well set here. \n","58":" to","59":" was spent at the Records office at Rouen where I spent a most enjoyable time. Visited the most important pleasure resorts Rom Seconis & La Bouville. It is a beautiful city & soldiers of all the Allied Nations are there in good numbers. It’s theatres are good one or two very warm though. The Style! Gee whizz! The gentler sex are very chic. Quite a number of English girls dressed in Khaki work in the Tommy Offices & they look very pretty shall never forget the trip to La Bouille it takes 2 hours by boat.\n\nFound the Train at the same spot Steenwerck.\n","60":" Jogging along as of old received a parcel from Dorie.\n","61":" Mr Bosche Has been keeping us busy with air raids of late he was over in great force last night & it was pretty to watch our search lights looking for them. They dropped a good many bombs nearby, one did some damage to a field Hospital.\n","62":" Yesterday was St Anna’s day & the Mademoiselle where we mess (Butts Coog Mac & I) is named Anna & it is customary to wish girls so named \"bon fete\" & she in reply kisses you, What! Last night I wandered round as is our want (was on my own last night) at 9 pm for a cup of coffee, before turning in. Well when I got there a reception was being held given by the French Gendarmes who also mess there. They dragged me in, heedless of my protestations. The table bristled with bottles, Champagne \n\n& du vin rouge (red wine) played a good part & the Gendarmes were already talkative & in good voice. A couple of them had very good voices & joined in heartily singing their National Anthem jove how they did they rap it out it takes a Frenchman to sing it alright. Mademoiselle Anna was systematically hugged & kissed & seemed rather to enjoy it. I was the only outsider there the party broke up about midnight. It was a new experience for me & I thoroughly enjoyed myself.\n\nThey are very nice people & cannot do enough for us.\n","63":" A mail to hand to-day 5 from home the first for over 6 \nmonths\n weeks.\n","64":" Moving to-morrow to DRANOUTRE Belgium all is bustle. Fritz is shelling one of our balloons\n","65":" Moved to DRANOUTRE Belgium by Motor Lorry I came up with the Skipper in the Napier it is not very far from STERNWENCK. The folk speak English splendidly & are particularly nice to us where we mess. We are the first Australians to be billeted with them.\n","66":" Reninghelor is not far from here so I borrowed the Skipper’s horse & set out to find my Belgian Lassie at the farm there. (Ha) A glorious ride & found my quarry but she was not at the farm. Received a great welcome at the hands of her sisters & enjoyed the products of the farm. My pony was greatly admired. Arrived back safely just before a fierce storm broke loose.\n","67":" Mac went on leave yesterday his second time am waiting anxiously for mine.\n","68":" The Bosche has afforded us great excitement of late. He comes over every night & lays \"eggs\" but our huge search lights are too good for him they find him every time & of course once in that strong beam of light he is blinded so drops all his bombs & makes for home. It is a grand sight they look like huge white birds with our guns greeting them on their way. One passed right over our heads the other night but fortunately for us he let loose his bombs before reaching us. It was a magnificent spectacle a sight of a life time. No mail since the","69":" of last month regarding our news from Home things are pretty crook.\n","70":" – Three letters from Home & a heart broken one from Dorie poor Kiddie she was frightfully cut up.\n","71":" Moved from DRANOUTRE to T20. C.44 (Sheet 28) near NEUVE EGLISE by motor lorry. Are billeted in a Nissen Bord hut in pretty surroundings. Have already had a feed of blue plumes.\n","72":" Great excitement to-day ending in a very narrow escape for me. A huge tree was blown right across the hut I was in smashing it to matchwood but I rose through the debris unscathed. I was the only occupant at the time had the adjutant been there he would certainly have been killed. Our papers & gear were scattered some & it took a couple of hours to clear everything but now we are again safely installed in another hut. It was the closest shave I have yet had.\n","73":" Moved from T20 C44 (near Neuve Eglise) to Caestre big motor lorry arriving there about midday. Found and egg shop & satisfied the pangs of hunger. Asked Madame there if she had a bed for the night & luckily for us she had.\n","74":" Moved from Caestre to Erny St Julien, a glorious trip through beautiful country. Had one mishap near Mametz the steering gear went crook. During the halt we dined by the wayside on the edge of a wheatfield. Arrived safely about 1 p.m. but all hands are very disappointed with the village it is such a quiet place. We are back for a rest but for how long we do not know. We are miles from anywhere but prettily situated the country looks beautiful.\n","75":" Our interpreter found us a good billet a very clean little room with a double bed slept like a log last night between the sheets( Coogan & I). The folk are very kind. Met us downstairs this morning with a huge bowl of coffee it was goodo. They fed us up with pears & plums the night before I was in my element. Fruit is fairly plentiful here.\n","76":" Leaving for Blighty to-morrow am all excitement. LEAVE","77":" to","78":" Britts (S. Sgt. Butterworth) is coming with me. \n","79":" Train left Ernie St Julien for Eblingham.\n","80":" Left Eblingham for Steenvoorde where I found them on my return same date after a glorious trip surpassing my previous leave.\n","81":" Moved from Steenvoorde to Hoograay near Reninghelst & are camped on an old Supply Dump.\n","82":" Our lads are doing splendidly on this big stunt now in progress. Saw 500 prisoners pass by to-day things are moving on the front.\n\nMack &’ I went to see my friend Lydre at Reninghelst to-night & received a great welcome. We helped her milk the cows (4) Mack milked one & I held the candle & laughed. There was Mack with his hat on & gas helmet across his shoulders & full uniform with a bucket between his knees working hard & Lydie breaking all records next to him it was a funny picture. It was quite dark & the perfume was none too pleasant.\n\nA glass of milk was handed round & afterwards a cup of coffee.\n","83":" Great excitement last night\n\nthe Bosche came over in great force flying right over our heads & dropping \nbob\n bombs delightfully close. Our searchlights quickly picked them up & then the Anti-aircraft guns & machine guns vaciously spoke. It was a deafening din but a grand sight. Where the huge beams of light crossed, Fritz was seen like a huge white bird of prey with shrapnel bursting all around him & machine guns using phosphorus bullets. It was a wonderful sight. During one period of the entertainment we all sought a ditch bordering the road. You are safe below the level of the ground unless one lobs right on you but then how unlucky. It was a weird feeling right underneath waiting for him to let one loose but he hadn’t any with our names on.\n","84":" This last week has been bitterly cold necessitating a fire (an old oil-drum). One thing, Fritz leaves us alone these wild nights & we are able to sleep peacefully.\n\nWe are moving tomorrow up near Ypres, but we will be well protected the Skipper tells us, in bomb proof shelters. We will be camped in a pig stye & we lads in a cowshed – sounds interesting. \n","85":" Moved to-day to H15 C58 (Sheet 28) in a fortified farmhouse & we are camping in a pig stye which has been cleaned out & sand bags arranged 3 deep up the sides & on the ceiling. It is black as night all day a very cheery place.\n","86":" Still at the old farm. Fritz comes over every night dropping bombs. Some of them delightfully close but so far have caused no casualties.\n\nQuite a number of our lads are on dangerous work in the forward area one chap (Cpl Townsend late","87":" Coy) was killed & another wounded also 5 horses have been destroyed.\n\nOne German treated us to a fine sight to-day. A flock of Taubes came over & unfortunately for them they met & were forced to engage in mortal combat with a scout party of our planes. Three of the enemy were brought down (from a height around 8000 feet). One in flames, fell quite close to us & it was immediately surrounded by souvenir hunters who tore the mangled remains of the Observer (who left the machine a few hundred feet from the ground) to pieces taking everything detachable even to his buttons, what callous hearted brutes men are. The victor landed nearby & had a look at his victims the \n\nwas penned down under the machine none of our planes were damaged.\n","88":" Saw in A.I.F. Orders to-day where Wal McMullen was killed in action.\n","89":" Left HIS C.5.8 our fortified homestead near YPRES per motor Lorry at 9 a.m. Dinner at AIRE & arrived at this dreamy village ERNY ST JULIEN about 7-30 p.m. This is our second stay here & old madam where we were billeted last time was very pleased to see us. We have the same room & boska Double bed & enjoy a good nights rest between the sheets. Coffee is laid on night & morning so things are bon.\n","90":" Last night Wally Watson rang up from Division & invited Mac & I to the first performance of the SMART SET","91":" Div. Concert Party) saying he had reserved two seats for us. We\n\nwent & thoroughly enjoyed the evening’s entertainment. All the heads were there & our seats were just behind them. It was an excellent show the singing & acting fine. Kerry & Dawes were the actors the former having played with Julius Knight so the talent was there alright. Foolish Ford of Wirths Circus was the comediam & a hard case he was too.\n\nThe show was held at BOMY, next village, so Mac & I walked, it only took us 20 minutes.\n\nMitchell, aforementioned in this rough diary, presided at the piano he is a brilliant pianist & plays accompaniments lovely.\n\nHad a yarn to the lads at D.H.Q. afterwards in their office (At }\n","92":" Another invitation to the show above mentioned last night.\n\n& had a royal time Cooy. Jack Lowick (from Mosman) & I had Dinner with the lads in D.H.Q. & dined wisely & well. They had a great spread it appears a few parcels had come to hand so we were in lucks way. Finished up with a cigar some style I tell you. Reserved seats at the \"Theatre\" which proved an excellent evenings entertainment. It was a change of programme last night. Very Good.\n","93":" Left Erny St Julien per motor Lorry arriving MACHY near CRECY about 2 p.m. We are on our way to GAMACHES for a long promised well earned rest. I’m not speaking for myself but the Infantry. We made a very good trip rested a while a HESDIN a very large town & had some hot coffee. We also stopped at several Wayside Inns en route having our Interpreter with us we \n\ngained admission between hours. The folk at Erny St Julien were very sorry to lose us & we them, they were most kind. Mademoiselle Germaine was very good to me she nursed a nasty boil on my neck and if I had been her brother she could not have done more.\n","94":" We are well set here for a few days our Interpreter fixed Coog & I up for a bed at the village school. It is a lovely room with 2 single beds spotlessly clean put in a very good night’s sleep. The apples here are bon am making a glutton of myself. It is very pretty country about here. Crecy is a quaint old village I thought of the old time wars as I passed through & thought how different things are now a days.\n","95":" Moved from MACHY to GAMACHES\n\nby motor lorry. Rested an hour in ABBEVILLE & had a good dinner with our Interpreter Andre Galopin a great pal of mine. He & I did all the billeting in this town which is a fair size of course fixed things for ourselves. Coog & I are well set in a lovely room with a huge bed & all conveniences. Andre is arranging a mess for 6 of us so we ought to put in a couple of very pleasant months. More anon.\n","96":" All is bustle word came through to be prepared to move at short notice probably to-morrow. Stiff luck we thought we were here for 2 0r 3 months. All hands are very comfy here but they couldn’t spare the old","97":" for any length of time.\n","98":" Moved from GAMACHES by motor lorry at 9-30 am. gee!\n\nit was a cold trip I nearly froze. We passed through Amiens & Albert & eventually arrived at PERONNE our destination. We all managed to squeeze into a hut but put in a very cold night the ground was quite damp. Everything was frozen next morning & we had a little trouble in obtaining a snack. It was about 11 o’c when we arrived & we stayed there all next day & night & following day until midday then we were conveyed here the coldest spot I think on Mother Earth. All are in huts we are fairly comfortable with a stove but the icy wind from the north blows through the cracks. Messing arrangements are good we mess with D.H.Q. clerks \n","99":" Snowed to-day for the first\n\nabout 6 inches welcomed us at the door \nin\n this morning jove it was bitterly cold. Had great fun snow balling finishing up by rolling half dozen, huge balls it kept the blood circulating. It was a pretty sight to see all the \"Bow\" huts covered.\n","100":" Word of another move, it’s the dizzy limit. Word came through that Capt Rigney is to be Adjt dating from","101":" it’s a hard knock after my long & pleasant associations with Capt Glasgow he is one of the whitest men I’ve met and it was with regret I said goodby to him, He is still on Train H.Q. doing Capt Rigney’s job.\n","102":" Had a splendid Xmas dinner at DHQ clerks mess & afterwards Horace Died Alton Coog. Jim Lean (Dvr) & myself motored Down to the","103":" Coy & had another spread there & a fine time. Butts was there & a number of old lads.\n\n"}}