{"Document Name":{"0":"Diary_0469","1":"Diary_0469","2":"Diary_0469","3":"Diary_0469","4":"Diary_0469","5":"Diary_0469","6":"Diary_0469","7":"Diary_0469","8":"Diary_0469","9":"Diary_0469","10":"Diary_0469","11":"Diary_0469","12":"Diary_0469","13":"Diary_0469","14":"Diary_0469","15":"Diary_0469","16":"Diary_0469","17":"Diary_0469","18":"Diary_0469","19":"Diary_0469","20":"Diary_0469","21":"Diary_0469","22":"Diary_0469","23":"Diary_0469","24":"Diary_0469","25":"Diary_0469","26":"Diary_0469","27":"Diary_0469","28":"Diary_0469","29":"Diary_0469","30":"Diary_0469","31":"Diary_0469","32":"Diary_0469","33":"Diary_0469","34":"Diary_0469","35":"Diary_0469","36":"Diary_0469","37":"Diary_0469","38":"Diary_0469","39":"Diary_0469","40":"Diary_0469","41":"Diary_0469","42":"Diary_0469","43":"Diary_0469","44":"Diary_0469","45":"Diary_0469","46":"Diary_0469","47":"Diary_0469","48":"Diary_0469","49":"Diary_0469","50":"Diary_0469","51":"Diary_0469","52":"Diary_0469","53":"Diary_0469","54":"Diary_0469","55":"Diary_0469","56":"Diary_0469","57":"Diary_0469","58":"Diary_0469","59":"Diary_0469","60":"Diary_0469","61":"Diary_0469","62":"Diary_0469","63":"Diary_0469","64":"Diary_0469","65":"Diary_0469","66":"Diary_0469","67":"Diary_0469","68":"Diary_0469","69":"Diary_0469","70":"Diary_0469","71":"Diary_0469","72":"Diary_0469","73":"Diary_0469","74":"Diary_0469","75":"Diary_0469","76":"Diary_0469","77":"Diary_0469","78":"Diary_0469","79":"Diary_0469","80":"Diary_0469","81":"Diary_0469","82":"Diary_0469","83":"Diary_0469","84":"Diary_0469","85":"Diary_0469","86":"Diary_0469","87":"Diary_0469","88":"Diary_0469","89":"Diary_0469","90":"Diary_0469","91":"Diary_0469","92":"Diary_0469","93":"Diary_0469","94":"Diary_0469","95":"Diary_0469","96":"Diary_0469","97":"Diary_0469","98":"Diary_0469","99":"Diary_0469","100":"Diary_0469"},"Date":{"0":"unknown","1":1382.0,"2":1383.0,"3":1384.0,"4":1385.0,"5":1386.0,"6":1387.0,"7":1388.0,"8":1389.0,"9":1390.0,"10":1391.0,"11":1392.0,"12":1393.0,"13":1394.0,"14":1395.0,"15":1396.0,"16":1397.0,"17":1398.0,"18":1399.0,"19":1400.0,"20":1401.0,"21":1402.0,"22":1403.0,"23":1404.0,"24":1405.0,"25":1406.0,"26":1407.0,"27":1408.0,"28":1409.0,"29":1410.0,"30":1411.0,"31":1412.0,"32":1413.0,"33":1414.0,"34":1415.0,"35":1416.0,"36":1417.0,"37":1418.0,"38":1419.0,"39":1420.0,"40":1421.0,"41":1422.0,"42":1423.0,"43":1424.0,"44":1425.0,"45":1428.0,"46":1429.0,"47":1430.0,"48":1431.0,"49":1432.0,"50":1433.0,"51":1434.0,"52":1435.0,"53":1436.0,"54":1437.0,"55":1438.0,"56":1439.0,"57":1440.0,"58":1441.0,"59":1442.0,"60":1443.0,"61":1444.0,"62":1445.0,"63":1446.0,"64":1447.0,"65":1448.0,"66":1449.0,"67":1450.0,"68":1451.0,"69":1452.0,"70":1453.0,"71":1454.0,"72":1455.0,"73":1457.0,"74":1458.0,"75":1459.0,"76":1460.0,"77":1461.0,"78":1462.0,"79":1463.0,"80":1464.0,"81":1465.0,"82":1466.0,"83":1467.0,"84":1468.0,"85":1469.0,"86":1470.0,"87":1471.0,"88":1472.0,"89":1473.0,"90":1474.0,"91":1475.0,"92":1476.0,"93":1477.0,"94":1478.0,"95":1479.0,"96":1480.0,"97":1481.0,"98":1482.0,"99":1483.0,"100":1484.0},"Entry":{"0":"\n\n","1":"\n\nThis is the 1143 day of the war.\n\nContinued from 19 September in Book VI\n\nWe left Tardinghem at 2.15 by motor lorry. There were some 25 lorries to convey the whole Battalion. We marched from the beach to the lorries at Tardinghem about 15 minutes march.\n\nThe tides go out a long way on the beach, once a day and once a night. There is also a little creek flowing into the sea, which has nice\n\nclean water in it. At low tide it looses itself on the beach. The sand has been all planted with marram grass and the tents were pitched behind a sand bank among the marram grass, and was well screened \nbehind\n from a view from the sea. Further along the beach, about 2 miles away, lies the German Submarine, and some of the lads visited it this morning and obtained some souvenirs, such as old bolts, pieces of brass etc. Charlie Charlies carried home a lump of iron for the purpose of getting a big brass nut off it, & left it in the lorry when he arrived at Blequin.\n\nWe came back by a slightly different rout at the start which was a little nearer, but it was 6 p.m. when we got home. We passed through Marquis La Dor and numerous villages on the way. The journey being about 27 miles.\n","2":" (1144)\n\nI went on sick parade this morning, and was given no duties on account of my hand which is swollen up, but not very painful. I cant shut it and have difficulty in holding the pen. I saw\n\nCpt. Davidson on the beach on Tuesday but was not speaking to him.\n\nWe were paid today. I drew 15 Francs 11\/-\n\nThis evening I went over to the farm house for a mess tin of milk. They were at tea. Fried potatoes, & meat. So I had tea with them, a plate of chips, some roast meat cold, a slice of bread & two glasses of cider. I expected to pay dear for it but the old lady refused to take any money for it. I was profuse in my thanks.\n\nVisions of failure explains Germany’s peace zeal. Ludendorff admits the serious plight of his armies, that his forces are dwindling his consumption of shells exceeds the production, & his troops are complaining. Germany is impotent on the seas, faced with failure under them, checked on the Western fronts, & in the air, and confronted with economic ruin. She sees the spectre of the fourth winter of war, in which she will receive no supplies from neutrals, handling American supplies as middle men. No wonder that her motto has become \"Peace before Christmas\".\n\nThe U boats have had by far their worst week of the war since they began their campaign of\n\nunrestricted piracy last February. Only 8 large ships were sunk last week, & only 20 submarines are at work at one time. Ludendorff in an army order urges \"Economy in men is even more important than economy in munitions\". Germany’s \"sacred union\" is vanishing at the dawn of disaster. Her political concord has completely disappeared. German newspapers are preaching peace, & publish articles showing that victory is impossible, & urge the evacuation of Belgium which is the key to peace. Germany began a war of offence. She is now fighting a war of defence, and every day she becomes more fearful that she may be beaten. Military defeat would kill militarism. The rulers of Germany will move Heaven & earth to prevent their own destruction. With the prospect of commercial supremacy in a disorganised Russia it is possible Germany may be willing to offer a large proportion of what the Allies demand. No peace, whatever its terms, can have any value unless those terms ensure the impossibility of another German attempt to wreck the world.\n\nFriday September 21. 1917. (1145)\n\nA beautiful day.\n\nI paraded sick again this\n\nmorning at 6.30 and was given no duties. I had a hot foment put on my hand which is to be renewed every 4 hours. \n\nAt Dixemude yesterday three Divisions of Australian troops went over the top, supported by the Black Watch & other troops. They gained all their objectives and were still going. It is rumoured that this Division is to go to their assistance in about a fortnight.\n\nThis is 1145 day of the war. When it goes 1177 days it course of 42 lunar months, according to scriptural prophiesy will be completed. Time will tell if this is the allotted duration of this dreadful & appaling war. I wrote to my dear wife this evening. Letter 93, 4 pages. I also sent a post card \"greetings from the trenches\" to my cousin, Mrs. Will Rilley, Coolaness, Irvenstoron, Ireland. The February reinforcements of the Victorian artillery that my brother is in is really the 14th of the","3":" Field Artillery Brigade. The \"Daily Express\" to day reports \"High explosive reply to the German Peace talk\". Great new offensive in Flanders. Advance of one mile into the German positions near the Menin road. \"Pill-boxes\" smashed. Enemy garrisons \"literally danced with Fury\". Valuable positions captured. Very few casualties. Our men \"went over\" very light, that is without packs & other heavy kit.\n\nOur aeroplanes were thick in the sky from dawn till dark. Visibility was unusually good, & they had exceptional opportunities for attacking enemy infantry, battery positions, and transport with their machine guns. Many tons of bombs were dropped behind the German lines, in addition to the systematic harassing of troops in forward lines. German aeroplanes were also active. Four of them cleverly camouflaged (disguised) in order to be undiscernible until only a few hundred feet above the ground, swept towards our lines from Polygon Wood in the morning, but were quickly chased away. The German version of the battle confirms Haigs report, and admits strong english attacks on a broad front. Heavy casualties were inflicted on the enemy & we have over 2000 prisoners – Prussians & Bavarians.\n","4":" (1146)\n\nThe weather is dull & cloudy.\n\nI again paraded sick, and am to have my hand dressed every four hours.\n\nThere is a rumour aflout that we are to return to the front next Thursday, and that we are going back to the same old place Neuve Eiglise.\n\nA \"Pill box\" is a field work in reinforced concrete largely used by the Germans in the defence of their Flanders line.\n\nbut still substantial. There are ventilating \nwalls\n shafts and flues for stoves, loop holes for machine guns and rifles, & magazines let into the concrete walls for bombs and ammunition. The structure is let into the ground for half its \nlength\n hight, so that the loop holes are almost flush with the ground level, & the entrance door has to be reached by a trench. Total concealment is impossible, because the loop holes must be above ground, and that leaves the massive roof standing out like a mound. Still, clever camouflage will do a lot, especially in the way of hiding the places from the observer in the air.\n\nThe Pill-box is really an Island fort and its resisting power is extraordinary; it will take a direct hit from the biggest shell and remain unbroken, though it often happens that the tremendous shock of the impact kills the whole of the garrison inside. There have been cases of the pill box being turned over by a big shell striking the ground in front and bursting underneath leaving the front loop holes staring up to the sky ready for the bombs which our men drop into them as an \n\ninvitation for the inmates to come outside.\n\nThe Hun builds his pill boxes in the foundations of the farm buildings, & then pulls the building down on the top of his concrete roof, thus adding enormously to their strength. In the pile of tumbled bricks & rafters it is hard indeed to pick out the places from which the machine gun spits. All over the marsh lands & the forests among the dykes and rivers and canals of Flanders, for mile on mile in depth, the farms are fortresses, and the pill-boxes stand thick as mushrooms in a September meadow. The older form of pill-boxes is known as the \"Uebu\", a name coined from the first letters of the long official German name. It is a strong point to be found in the original trench system, made of concrete with machine gun emplacements, fire steps for rifle men, posts for observers, and casements for the garrisons. Solid works they are, & used in connection with a less effective general system of defence.\n\nThe enemy has altered his system of trench warfare. The shell holes are his front lines. Behind this lightly held \n\nfront line the pill-boxes are placed in support, one behind another, each sustaining and covering the other by its fire. They are all built with the invariable German thoroughness; the workmanship is excellent, & the plans \nare\n provide for the utmost limits of strength and security. Never the less our men get through, as the Huns find to their cost and in many cases the pill box has become the thomb of the inmates.\n\nThere is strong indications that the war will end this year. Clear headed men in Germany now realize that the prolongation of the war means their countrys inevitable ruin. Every day that peace is postponed entails greater suffering and greater loss. Already the economic loss can only be retrieved by years of effort. These men are anxious to save what they can. Herr Ballin, the steamship magnate, is one of them. Count Bernstorff, the ex-ambassador of the U.S. is another. Strange to say, von Kuhlmann, the new Foreign Secretary is a third. Probably Michallis is a fourth. With the Socialists, they are fighting the von Tirpitz party, \n\nwhich has promised Germany that the U. Boat will compbell Great Britain to agree to a German peace. \"The atmosphere of peace which is being created in Germany, indicates that the more saner of the rulers realize that a German victory is impossible, and delay means ruination. Peace on the best terms possible and that this year is their only hope of refuge, another winter of war spells ruination, and they know it. They have been deceived so long by the war party, that when peace does come, the war Lords stand a fair chance of anilation at the hands of an awakened Germany. Thrones may totter, and princes pulled down and spurned. To save themselves from an angered people they may succeed in delaying peace for a while in the hope that something may turn up to save themselves, - but their doom is certain & sure, for the Allies are steadfast in their purpose that Militiarism shall be crushed in Germany, in order to save the World, & the German people as well, from the curse of another grim \n\nand world wide horrow. Whether peace is near or far rests with the German people.\n","5":" (1147)\n\nFine but cloudy.\n\nI again paraded sick this morning and got my hand dressed and was also given no duties. \n\nToday is my birthday. This is the first birthday I have spent in France and the second away from Australia. The other was spent at Lark Hill Salisbury Plains England. I hope and believe that I will spend the next in Australia. This day a year ago I thought that the war would be over by this time, and that my birthday would be spent in an atmosphere of peace. Though in this part of France it is peaceful enough, and one could hardly imagine, were it not from the number of soldiers about that a terrific war is raging not many miles from us.\n\nThe Central powers reply to the Pope’s Note has been received. Its tone is more concilatory, and favours compulsory arbitration after the war, and a gradual limitation of armaments & freedom of the seas.\n\nThe number of prisoners taken by us in the recent\n\nbig offensive now exceeds 3000. The enemy’s casualties have been enormous. \n\nI sent a French post card showing a French soldier in uniform to my father and also to Eric . \n\nTo day says the \"Chronicle\" is \"Blackberry Sunday being the nearest Sunday to Sept 21, the average date when the main crop of blackberries is ripe around London. Before the war this anniversary devoted to picking blackberries on the commons of Essex & Surrey, brought working class Londoners the final bean-feast of the year. The ripening of the blackberry crop is of very great importance this year in Germany, where the seeds are now used for making coffee.\" 22\/9\/17.\n\nMr. Mapleson our Transport officer, who has been on sick parade during the past few days, was sent to the Hospital to day. Mr. Boyland will fill his place for the time being. The boys lately have been saying that we must be due for the front again when he got sick. But joking apart, he looks a wreck and seems to be breaking up.\n\nThere was a football match this afternoon between the 37. Battalion and the 10th Field Ambulance. The Battalion won. Sunday football is becoming quite common now in the Brigade. I wonder what the people in Australia will think! There was also a 5 mile race.\n\nI sent a French post card to my dear wife today showing a photo of a typical French soldier. I said I was sending some more souvenirs which I have made out of the driving bands of German shells. . \n","6":" (1148.)\n\nA fine day.\n\nWe were issued with tobacco & cigarettes this morning. Our iron rations, Bully beef, & a tin of tea & sugar was issued to every man of the Transport section this morning to replace the supply that was called in a few weeks ago.\n\nI again paraded sick this morning & was given treatment & no duties.\n\nI received a letter from my brother Willie today, describing briefly his trip to Ireland. He had 8 days leave and had a good look around Dublin, Belfast and other Northern towns, and visited a lot of our relations there.\n\nI sent a packet of souvenirs to my wife this evening in a registered parcel. It cost 1 franc 3d for registration. The packet contained two souvenirs, serviette rings made from the driving bands of 5.9 German shells, & one ring made out of the stay wires of an enemy aeroplane.\n\nLieut McNicol lent me a book to night, a guide to Paris. He has been there lately.\n","7":" (1149.)\n\nA beautiful morning.\n\nReveille was at 5.30.\n\n1. \n\nOrders came through late last night that we were to move off at mid day today. Hasty preperations were made for a start. Equipment put together. Packed got ready & blankets rolled. Then waggons were loaded, and the stores removed. I packed 8 cases of shoes, although I was on no duties. I did not parade sick although I had the necessary parade stakes. Holmes returned yesterday and helped the other farriers to shoe some horses this morning.\n\nAt 1. p.m. we left Belguim and passed through Ledinghem, Drouville enroute to Merck St. Sievin, a railway town. We arrived at 5.15 after several stoppages on the road for the day was very hot and there were some very steep and long hills to cross over. After tea I had a look around the Village. It has a magnificent church and a fine stream of water passes through the Village which is spanned by a fine stone bridge. Lower down the stream there are two water wheels working a large Mill. There are a number of Estaminets & Dehitants.. At one of them I obtained a number of Post card views of the Village, & also some at a little shop.\n\nAt a late hour I went to bed, in a hay loft on top of a stack of sheaves. It was \"Tres bon\".\n","8":" Sept 26.1917. (1150)\n\nWe were up early and left Merck St. Sievin at 8.a.m after a hasty & scantly breakfast. We passed through the villages of Halte D Ouve , Ouve-Wilquin, Celety Bientiques, Wizernes, and Noir Carnet. Here we stopped an hour for dinner. This is a large town, with a busy railway station, many factories and many large quarries of white stone. All the country is very hilly, and the town is in a valley at the foot of a hill, the side of which has been quarried away leaving a perpendicular face of white stone, at the foot of which nestles the town. \n\nLeaving Wizernes we immediately passed through the town of Blendequen on the Vae-de l’Aa a little stream passing through both the afore mentioned towns. Then we passed through a long stretch of farming country, which appeared to be a very prosperous district. We passed long fields of sugar\n\nbeet, lucerne & turnips. The grain crops were harvested, stacked and most of them thatched. We passed one farm with 11 small stacks. The next village we went through was on the banks of a deep river. The Village was named \"Tout Asquin, and contained several large factories, there being 3 factory chimneys smoking, and a barge in the river. A railway passed through it. We went about 2 miles further and halted for the night, but we were two hours short of our destination, consequently we had no sleeping quarters within easy distance, so most of the Transport camped under the wagons, and I with F. Barclay camped in an old stable as it looked like rain, and the straw was inviting. Through some delay or misunderstanding we did not received orders to start at 7. instead of 8, & we lost an hour on the road. We followed the battalion all the way. We had tea just before dark.\n\nA report is circulated that there has been a big German air raid on London, and much damage done! This is a country plane, and I don’t know its name, but \n\nthere are only farm houses about and no shops. At dinner time today I bought some views of Blendecques.\n","9":" (1151.)\n\nRevallie 15 past 6.\n\nBreakfast 6.\n\nWe got away about 8. Oclock. The morning was damp and threatening rain, a little fell during the night. The morning soon cleared up and it turned out warm & very close. A lot of troops fell out during the march & we carried their packs & equipment in the limbers. We passed through Lynde, passed through the commune of Wallen Capelle, but did not enter the town. Here we were only 3 ½ kilometres from Staple where we camped one night when leaving the lines for Belquin. At Hondeghem we stopped for dinner. The 37. Battalion were forbidden to enter the Estaminet, which caused a lot of high language. We had about an hour for dinner. I rode a lot this morning and also yesterday evening. We travelled fully 8 miles this morning in the heat, and the Battalion is very tired, & a great many of them fell out. I consider myself lucky to be with the Transports as I have not to carry my pack\n\nor equipment, and often get a ride either on the limbre which is not allowed or on the Donkeys, when the driver acts as brakesman in my place. A New Zealand Battalion passed us here during the dinner hour. From here we can see the hill that is studded with windmills & on which there is also a large Monastry. We are now in the land of aeroplanes, and within hearing of the big guns & bursting shells. About 2.p.m we started off again and passed along country roads on the outskirts of villages until we came to St. Sylvestre-cappel. We passed through it, and it is rather a pretty little town, with a magnificent brick church large enough to be called a cathedral in Victoria, and we halted at 4.p.m. for the night in a fine grass paddock, and the mules & horses got a splendid feed of green suculent grass.\n\nI got a \"Chronicle\" on the road for we were all axious to get the news of the raid. \"The Kent & Essex coast was again crossed at various points & bombs dropped. The casualties have been 15 killed and 70 wounded. This is the second night in succession that raiding squadrons have\n\nbeen kept at bay by anti-aircraft guns. Only one or at most two got through the ring of fire on last Monday. Enemy airships crossed the Yorkshire & Lincolnshire coasts between midnight & 3. a.m. but got no distance inland. Little material damage was done.\n","10":" (1152.)\n\nThis morning is cold and frosty, and there is every prospect of another nice day.\n\nAfter an early breakfast we were ready to start at 8.30 which we did punctually. We slept in an old French barn along with the band. We had plenty of clean straw to sleep on.\n\nLast night I had a walk around St. Sylvestre Cappel. It has a magnificent church & I obtained 4 Postcard views of the village but could get none of the church or L’Eglise as the French call it.\n\nHere I bought a mirror for the small sum of 6d, which in most other French towns would 2 or 3 times as much. The price of Post cards vary. At Merck St. Sievin they were an ½d each, at St. Sylvestre Cappel 2 for 1 ½, while in most other towns they are 1d each.\n\nFrom St Sylvestre Cappel we passed on through another little village called\n\nPage 23\n\n Terdeghem, which consists of only a few houses. Our route was through country lanes and we passed some steam Trashings plants on the way. The engines were of the portable type and were a combination of the horizontal and vertical types of boilers with the engine on top. The next town we passed was Steenvourd, a fairly large place with the usual church spire in evidence. A little further on we pulled into a paddock where the whole Battalion was already there resting. Here we had dinner and stayed all the afternoon and were provided with tents for the night. During the afternoon we had a kit inspection of the whole Battalion, including the Transports. It was the first kit inspection for the Transports since they had been in France & the first for me since I was on board the ship. Many of the shops we passed yesterday & to day had the sign displayed in large letters \"Debit de Boissons\".\n\nOur camp is about a quarter of a mile away from the village of Winnazeele. The whole Battalion & H.Q.D. are together in a park.\n\nI had a walk around the\n\nvillage late this evening. The most imposing building in it is of course the church. I was inside of it for almost 5 minutes but only had a look from the back as there was a service on, mostly attended by soldiers & a few women. I obtained several Post card views of the place.\n\nI received a type written letter from Mr. Gamble tonight. I also received letters from K. & A. Miller while on the march.\n","11":" (1153.)\n\nCool and cloudy.\n\nToday we cleaned and oil-painted the Limbres, while the Drivers cleaned their harness. The Battalion done some physical exercises this morning.\n\nThis afternoon in the far distance I can see several observation baloons, so we are within an easy day’s journey from the firing line.\n\nI received this morning two letters from my wife dated July 17. & 18. No 78 & 79 respectively. I sent Field service Postcards in acknowledgement of all the letters I received this week. I also wrote to my dear wife, letter 94. \n\nWe were all issued with a white bag of biscuits to complete our issue of Iron rations.\n\nThere was a heavy bombardment last night on this front.\n","12":" (1154.)\n\nIt was exceedingly cold & frosty last night.\n\nThere was a terrific artillery duel last night which continued with great intensity all night and far into the morning, ending about 8. a.m. There has been a series of rushes by our troops on this sector every night since the","13":" and all our objectives have been gained and held. The Germans admit their losses, but try to minimise our gains to deceive their own people and Neutrals. There is great political strife in Germany and it is rumoured that a second and more concilatory peace reply will be sent to the Pope by Germany as a result of the great British gains on this front in Flanders. Haig is described by the \"Express\" as a great peace maker. If the weather only keeps fine for a few weeks longer, the enemy will be in a very serious plight indeed, and will be forced to evaculated Flanders, which means the loss of their U. boat bases and several aerodromes from which they make their attacks upon England.\n\nWar is a period of extreme activity followed by periods\n\nof rest and \"nothing doing\" to the casual observer, but in reality the period of rest is a period of great preperation.\n\nThere was another air raid at various points in Suffolk, Essex, and Kent. The majority of the raiders did not venture far inland, a few headed towards London, but failed to reach the metropolis. Casualties are not yet reported.\n\nWe were issued with matches tobacco & cigarettes today. Also with 2 green envelopes, the first for a long time.\n\nWe are to move from this camp to morrow morning, also the Battalion.\n","14":" (1155.)\n\nAnother month has gone by and the war still goes on but the initiative is still with us all along the line, and the prospect of the Allies being victorious this year is very bright. The enemy is on the defensive on all the fronts, even the Russian fronts, and Turkey & Austria-Hungary are in a bad way, while there are political & social discords in Germany.\n\nI am over 10 months in France and on the 3rd of this month will be 16 months since I left Victoria and am over 19 months in the army.\n\nI have had two birthdays in the army, one in England & the other in France at Blequin. I have spent one Christmas in France at Armentiers, and there is every prospect of spending another Christmas in the Army, but I am doubtful if it will be in France, for I believe the war will be over before then, & if not we will in all probability be removed from France to do Garrison duty somewhere else.\n\nCold and frosty last night but a very bright and beautiful morning. In fact we are getting remarkable nice weather during the past few weeks. This is greatly in our favour; for it enables us to bring up our artillery after & during every advance and is also of great benefit to the infantry and airmen, in fact all branches of the service.\n\nWe were to move out at 9. a.m. this morning, but it has been cancelled, & we don’t know when we are going.\n\nLast night & this morning there was a terrific bombardment of the enemies position. Early in the night several enemy aeroplanes flew over the camp & dropped bombs some distance away.\n\nA persistent furphy is afloat that Lens has fallen to the Canadians. Another is that the\n\nobjectives assigned to our Brigade has been evacuated by the enemy last night and that our services will not be required in that line. Our Brigade is practical held as storm troops to take positions & then hand them over to other troops generally English.\n\nA & B Company moved out this evening with full packs & picks & shovels to do fatigue work at the front. It is reported that the enemy has retired from 10 to 16 miles over marshey country that makes the work of getting up artillery to advanced positions slow & difficult. \n\nIt is impossible for the enemy to hold his position in the winter. He is now forced to either evacuated still further & give up the Belgain coast and hill as well or run the chance of being cut off and hopelessly beaten. In either case it will be the death stroke to his U. boat war on England & the shattering of his last hope.\n","15":" (1156)\n\nWe packed up, rolled our blankets and left Winnezeele punctually at 9. a.m. and after some delay on the road at the start proceeded to the front. We soon crossed the Frontier and into Belgium. The first village we passed through\n\nwas of course the village of Winnezeele, and the next Waton in Belgium, which is long village extending on both sides of the railway. In fact the railway passes up the Main street. The signs on the shops are all in Flemish which reminded me of the Dutch names in Cape Town. At the entrance to the town the village spreads out and there is the usual conspiciuous church. \n\nWe passed through several British camps, and more groups of houses along the main road, which we though were other villages but was really a continuation of Watou. In all these were numerous little shops, many of them of mushroom growth, & all catering for the wants of the soldiers, for the whole district for miles behind the firing line is full of soldiers. We halted for dinner alongside an ordinance worshop, devoted to the repair of guns. Here we saw a large number of chinese working.\n\nAs the cooks were late with the tea, we got some of the chinese. They were very liberal with it, but it had no milk, & the sugar was finished. We started again at 1. p.m. and after about an hour passed on the outskirts of Poperinghe, which is quite a respectable town, \n\nwith a large number of church spires and factory chimneys. The town appears to be little damaged. The people are distinctly Flemish and many wear wooden shoes. The road all the way was good but rather dusty for there was a continuous stream of motor lorries, motor two decker buses, Horse transports & troops, Red Cross cars etc passing us all along the rode. From Poperinghe the road was not so dusty, for it was wide, level and tarred, and lined on both sides with trees. It is an ideal road & appears to stand the heavy and constant traffic very well. About 5.30 OClock we had reached our destination unharnessed & parked the Limbres in a green grass paddock, and was ready for tea with a good appetite.\n\nWe saw 3 German prisoners after we passed Poperinghe being escorted to the rear. They were mere boys of small statue, and had a dejected appearance.\n\nDuring the past few days we have heard frightful stories of the awful cruelty & horrors of war. Of prisoners who sniffed our men being done to death, & in other cases of no prisoners being taken.\n\nTuesday\n","16":" (1157.)\n\nI was on picquet this morning from 3 to 6. – the first time for about a fortnight.\n\nEarly last night enemy aeroplanes were hovering around and dropping bombs. He kept it up for some hours and our archies were quite busy. Luckily no bombs fell in our camp, but I hear that many were killed a few nights ago in an adjoining camp. The country for miles around is one mass of camps. It is said that a quarter of a million men went over the top last Saturday night.\n\nThe enemy put over a lot of big shells to the N of us this morning; but the most of them were duds, evidently in quest of guns.\n\nWhile I was on picquet it was showery most of the time, and there is light misty rain today. Pat Ryan and I are in a camp together. We made it secure this morning against the rain. It is in a hole about 2 ft deep and about 8 ft. square. We covered it over with a limbre cover & old sheets of iron, and put some sand bags around the top. It is \"Tres bon\".\n\nWe found some tins of jam and bully beef in a ditch so are well provided with food. We also get an extra supply of rations at the front. This morning\n\nwe had fried bacon & porridge for breakfast. We found a tin of milk, in a safe place, and had it to the porridge. It was good.\n\nSome of the limbres were up at Ypres last night with rations & report that there is scarsely a house standing. Bombs were dropped in from of them coming back.\n\nI received a letter from my wife this morning dated July 23 & numbered 80.\n\nThe pack stunt was detailed to day and are to go up to the front to night about 2. a.m. leading pack mules & horses. The ration limbres went after tea & before dark. I narrowly missed being detailed for the pack stunt, and am to remain in the camp and do picquet duty every other night.\n","17":" (1158).\n\nA cold wet showery morning.\n\nEarly this morning about 3. a.m. the pack stunt made a start. They had some breakfast before starting and all hands were roused up to help them saddle the mules & get them away. They have not yet returned (11. a.m.) at time of writing.\n\nA rumour says that our Brigade have taken all their objectives. Also that the 39. BH. Transports lost a lot of mules and a few men, but we have not yet heard anything about our\n\nown transports.\n\nThere is an enormous amount of traffic on all the roads everywhere both day and night. I have seen the traffic both horse and motor thicker and denser than in any part of Melbourne at any time of the year. Around the wharfs there is not nearly so dense or the vehicles so numerous as on the road behind the lines, when a big push is on. They are bringing forward war supplies & returning generally empty for another load.\n\nAfter dinner most of our men returned. They were all safe. They lost one horse which was killed by a shell.\n\nI am on picquet to night from 9 to 12. \n\nI took an 18 pounder shell to pieces this evening after tea in our dugout. It had never been fired but had a live cap in it enclosed in a small brass box. The nose cap is a very complicated piece of machinery. It sure was . There are two caps in the nose piece. It contains 26 separate parts. \n","18":" (1159.)\n\nAbout 3. a.m. my mate Paddy Ryan was roused up to go away with a Limbre to the front. They got back safely before dinner. He was awfully shocked at the horrors of war, and the large number of dead he saw.\n\nI forgot to say yesterday that one of our horses was killed & several mules slightly injured.\n\nLast night and today there was intermittent artillery activity all along this front.\n\nIt was showery this morning but turned out fine this evening. There has been an unusually large number of our aeroplanes continually go over & returning from the enemy’s lines. Some German planes came over this evening and were engaged by archies & by our planes. Two were brought down, but don’t know whose they were, as the fight was a considerable distance off. I saw a paper this evening, the first since I left Winnezeele. The war cabinet has sanctioned a policy of reprisals, but the \"Express\" pointedly asks \"When?\".\n\nI was lucky today and received one letter dated July 24. No 81 from my wife & also 1 large packet of Tobacco, Havelock mixture, & 1 tin flake cut aromatic from W. Curtis.\n","19":" – (1160.).\n\nI was again on picquet last night. No. 1. shift, from 6 to 9. The first picquet is very dark now as the moon does not rise to late, but 2nd & 3rd picquet there is splendid moonlight, unless the moon is obscured by clouds.\n\nThe drivers were very busy early last night shifting the Q.M. stores & the cookers to another site so as to be more convenient for the Battalion who came out of the Trenches, or rather series of shell holes, last night. The cooks had hot soup ready for them.\n\nWe lost some officers and many wounded. Major Storey, Capt Toull were among the wounded, also Cpt. Moule.\n\nYesterday I volunteered to go on a pack stunt to the front, but my services were not required. I was the only one who has ever volunteered for the job in the Transports. But to day I was sent up, riding a small mule with N. Phillips. We met two other pack leaders from each of the other Battalions on the road & went off under the charge of a corporal in the 40. I changed my mount with Phillips, riding 1 mule and leading another. We went up through Ypres, which is a ruined city with not a solitiary civilian in it. It has been a magnificent city before the war with many buildings of great architectural beauty, but only fragments of the walls are now standing. Factories, cathedrals, chateaus, and houses are in ruins, most of them beyond repair. Passing through the city & over a canal we travelled along the Ypres-Menin road and Potifze road for several miles. At a dugout we saw a Brigade officer Mr. Whitehead, & got further instructions\n\nfrom him about the locality of Brigade Head Quarters, where we were going to remove some German machine guns that were recently captured. Proceeding all the road some distance we were stopped by a M.P. & could go no further, but had to return & take a bye track through shell holes and mud and eventually came on to the main road again. During this time our guns of all caliberies were bombarding the enemy, and the noise was incessent. Huge guns were being brought forward & put in position, and there was a constant stream of traffic of every description. Pack mules carrying shells, Limbres with supplies, road rollers, steam and oil driven, motor lorries cars, Service waggons, Field Ambulances, and Huge Tractors, and Troops going in and coming out. \nDuring\n Amongst it all our guns were in action and the enemy dropping shells. Eventually we came to the foot of the ridge over which we had to cross, and which the enemy was constantly shelling particularly the top and the road, at regular intervals. We got off leading the mules & made a dash for it. We reached the top in safety, passing dead and disembowled horses & mules,\n\ndead men, friend and enemy, all removed to the side of the road to let the traffic pass, which needless to say here was not so thick. Running & the mules trotting behind us, and spread along the road in a string, when suddenly a shell landed on the side of the road & burst. There was a tangle up. I got off the road and went round throught the shell holes to pass a bogged water tank. On the road again & off. At the start I was in the middle of the column, but now I was in the lead. At the oott of the ride I halted for the others. Phillips had lost one of his mules, and one man & his mules were missing. We went on through the valley to the foot of another ridge. No one knew the exact whereabouts B.H.Q. and we were told that we were too far ahead. So we went back about 1 ½ miles, went down a side road, & could not find it or anyone who knew. We decided to return. All this time we were walking through mud over our boots, occasionally the mules got boged, and rain was falling. We had the shell swept Hill to negociate again. We made another\n\ndash for it & when on the sumit another shell burst on the side of the road amongst us. No one was hit but some were thrown down. Hurrying on we safely crossed over, kept to the main road & reported to Mr. Whitehead that we could not find them. Mounted our mules & returned to the camp, travelling about 16 miles on the trip. In the mean time, the man who was missing. – He was a driver in another transport, had returned to our camp bringing back Phillips mule, but could give no account of what happened to the party. Anxiety prevailed in the camp, and it was the belief that I was wounded, for they had not known that Phillips & I had exchanged mounts. We arrived some time after dark, none the worse for our adventure, but Phillips paraded sick next morning. We had tea & went to bed.\n","20":" (1161.)\n\nThere was a heavy frost last night, & today it is showery. I was on the usual routine duty this morning. Philips paraded sick, but not one believes that there is anything wrong with him. A large number of enemy planes were over the camp last night, remaining for \n\nseveral hours and dropping bombs all the time. Some fell close to this camp.\n\nYesterday while we were on the pack stunt I saw a large number of our famous tanks bogged in the shell holes, some of them had direct hits, some were used for dugouts, and at one a number of men were working at it, taking it to pieces. All the time we were going up there were working parties and Royal Engineers repairing the roads, and oil driven road rollers were much in evidence rolling down the metal as it was being put on. Men were engaged in filling in great shell holes and others scraping the ever accumulating mud off. Many of the men so engaged were coloured West Indians. A constant stream of red cross men were going to and fro, and in one horse drawn ambulance the groans of the wounded were pitiful as the waggon jolted over the ruts and into the holes though the attendents were constant in their attentions to relieve their sufferings. All the time they were in danger of being blown up & the bursting shells added to their suffering.\n\nIn the air aeroplanes \n\n- fleets of them – were flying overhead either going or returning from the enemy’s lines.\n\nSaturdays \"Express\" reports 4446 prisoners, and 1000 corpses were found opposite the Australian sector. Their were futile sacrifice of enemy troops in great efforts to drive us back. The Hun is fighting hard. The slopes of Passchendaele Ridge are covered with his dead & still he fights, but his troops surrender on every opportunity. It is described as the Greatest English victory.\n\nThe Clocks were put back 1 hour this morning. Winter time. This evening has been very wet and stormy. And this is a wild rought night. I go on picquet in the morning at 3. a.m. until 6. a.m.\n","21":" (1162).\n\nIt is very windy and stormy to day but no rain is falling and the wind is drying up the mud. It was bright moonlight while I was on picquet this morning, & the mules were very quiet.\n\nAll last night and to day there is a continuous and heavy bombardment North of us by the French, getting ready for another big push between the river Lye and the sea.\n\nWe were paid to day. I drew 20 Francs 14\/8.\n\nSunday night the horses & mules were\n\nrugged for the first time since last Winter. To night the Brigade Transports also rugged theirs. There are a lot of Transports here (English) that have not yet started to rug their animals, although the nights are bitterly cold.\n","22":" (1163.)\n\nThere was again a heavy bombardment to the North of us last night & this morning. In fact it has been almost continuous for two days and nights.\n\nThe weather is cold & dreary. Heavy rain fell last night, and some of the men in the dug outs were flooded out. There is a foot of water this morning in some of the beds. We dug a well in the corner of ours and bailed it out every night, otherwise our bed would have been flooded. The wind is very fresh and strong. \n\nI wrote 4½ pages to my dear wife to day, letter 95 and sent it in the official green envelope. \n\nJust before dark the enemy sent over a number of aeroplanes, but they were quickly driven off. \n\nWe are to leave this camp in the morning to go closer to the Front.\n","23":" (1164.)\n\nRevellie. 4. a.m. Feed up & get an early breakfast were the orders for this morning. Then we removed the Q. M. stores from Vlamertinghe camp to one closer to the line on the outskirts of Ypres. My waggon was loaded with picks & shovels, and 9 bales of sand bags. When we came back we carted 8 loads of other stuff a short distance.\n\nThen had a hurried dinner packed up our blankets etc. and left for the new camp at Ypres. We arrived early, but it was not until after dark that our supper & tents arrived. As there were no pegs handy we did not put them up, but camped under waggons. \n\nIt was after dark when some of the waggons arrived here. The camp is a very poor one the ground being sopping wet and tramped into mud by our transports & troops.\n","24":" (1165)\n\nFine but cloudy. It was showery last night, but I did not get wet, for we had one tent spread under the pole, & another tent over it. In this 4 of us slept, dry & warm.\n\nAs we are surrounded by Batteries, there was one continual roar all night, the enemy being heavily shelled. We had not much sleep. Throughout the day there was lively artillery activity by the guns of various calibres around this camp.\n\nYesterday morning we passed two batches of German prisoners being escorted to the rear. They were all young men, and most of them boys, but nearly all were of good physique and very sturdy & healthy.\n\nWe put up our tents to day. The ground is very wet & muddy. However we got a grassy plot to erect them on.\n\nI received a letter from Kitty Martin dated October 1. A few days ago. \n\nThe boys are to go over the top early in the morning. It is just a week to day since they went over before.\n","25":" (1166.)\n\nI was on picquet this morning from 12 to 3. a.m. it was cold and very dark, but the sky was continually lit up with flares that the enemy was continually sending up on 3 sides of us for here we are in a horse shoe bend in the line, but at least 5 miles from our sector on the front. The flashes of our guns around also & bursting shells of the enemy also lit up the sky.\n\nThere was intermittent bombardment which towards morning increased \nto\n in intensity to drum fire and continued for many hours after daylight. At breakfast time word came back that we gained all our objectives, and were behind the enemys field guns. Our losses are said to be heavy, and red cross cars are continually coming in with wounded and returning again.\n\nThe pack stunt went out some time after I came off picquet. I woke the cook at 2. a.m. to get breakfast for them. At 10. a.m. only Ferguson had returned all covered with mud and one of his mules was badly cut by being boged in the mud among sticks. He reports the others safe when he left, but they were continually get their mules bogged. All the front is a quagmire of soft mud, and \n\nshell holes all linked together. Roads have ceased to exist, and many teams and guns are bogged on what was once a road. I washed the wounds of the mules ready for the vet to dress, and that is all I have done this morning for I was up very late, & there was plenty of others to clean up.\n\nIn the pack stunt last night we lost 2 mules and 1 horse and early this night Pat. O’Neil lost two draught horses. They got away from him in the mud while he was on a divisional stunt.\n","26":" (1167.)\n\nThere was a drizling rain last evening and night. There is a sea of mud all around the huts and through the horses lines. We have a long walk through mud, water & shell holes to the cook house 3 times a day for our meals. It is very annoying. There was the usual bombardment last night. Fritz put many shells near the camp early this morning. There are dozen of Transports camps adjoining us, our own Brigade and artillery Transports.\n\nI received a letter from my wife this morning No 82. dated Aug 1. She complains of not receiving any letters for 5 weeks, owing to a mail boat being sunk. I hope she is able to tell me she has got some in her next.\n\nTo day the war has been going on for 1167 days \nor 42 lunar months, including leap years.\n\nThere were heavy peals of thunder & a violent hail storm accompanied by strong winds this morning, and again in the afternoon there was more rain and Thunder.\n","27":" (1168).\n\nI was on picquet this morning from 12 to 3. a.m. Fortunately there was no rain while I was on, but as there was rain early in the night, the horse lines were a perfect quagmire. It was very cold especially the last hour. Transports of other Battalions were lost in the darkness & mud. A Limbre of the 3rd. was over an hour looking for a track, with the aid of a lantern.\n\nOur Battalion came out early last night, or rather the few that was left of them. Only about half the Battalion went into the Trenches & very few came out unwounded. Mr. Mc.Lean of Sheppertion was killed in action. I saw one of the 38 men, a mere boy come in while I was on picquet, he was covered with mud, and had been that way all the time he was in the trenches. He said many of the men had trench feet with the cold & wet. It was the worst stunt our Brigade ever experienced, the most costly and the least fruitful. I heard that in the 38 Battalion that only one man and an officer came out of one Company and the officer was wounded coming out. \n\nThis is absolutely the worst camp ever I have been in. the ground is all an occoon of mud, the shell holes full of water, and the roads a series of bog holes, with \n\nmud half way up to the knee. Fortunately the rain has kept off this morning. We took the horses & mules out to a paddock to graze, and they got a good feed, & a role. \n\n I had a tiff with the Sergeant this morning at breakfast. \n\nTo day enemy aeroplanes, a fleet of them came over 3 times dropping many bombs around our billets. Our archies kept up a barage on them but failed to hit any of them. Just before dark one darted from behind a cloud circuled around one of our baloons and set fire to it with incendary bullets. As the planes had good weather for observation we expect them over tonight.\n\nTo night I went with Trevena to take the Mess cart down to the Battalion. On the way a motor lorry ran into us and knocked some of the loading - officers valese & medicine chest – off & it fell it in the mud.\n","28":" 1169.\n\nAbout an hour after dark enemy aeroplanes came over dropping bombs. Our search lights were turned on them & the archies fired upon them. After we were in bed awhile the enemy shelled our billets and put several shells very close to our tents one about feet away from our tent and closer to other tents. There was a scatterment and bare feet were pattering in the mud. But all in our tent who went out waited to put on\n\ntheir boots. I put on my trousers but the boots looked too wet & cold \nand\n so I crawled back into the blankets, so did Darkie. At Intervals he kept up the shelling all night until morning. About 1 O’Clock all hands were wakened up to get ready for a shift as the Battalions were moving out. All the pack mules and Cookers with the Mess cart moved out at 4. a.m.\n\nWe are to have breakfast at 6 a.m. I have packed up my things and wrote up my diary while waiting.\n\nBill Mitchell, of A Company, was one who got up & went out, and has not yet returned.\n\nWe got away about 8. a.m. There was a lot of packing up to be done, and some things had to be left behind, for there was no room for them in the Limbres. When we were going out the enemy was occasionally putting in a few shells & later on we heard that an officer in the 40th. Batt. was killed.\n\nOn the road we passed through Ypres and went on to the Railway station at Flamertingbe where we were to train for our destination, but after waiting for several hours during which we had dinner we found that there was no train available and we would have to take the road all the way.\n\nThis is a very busy military station & the trains are all\n\nEnglish. We moved out about 2. p.m. and passed through Dickebusch and on to Poperinghe where the traffic was so dense that we took about 2 hours in passing through, but I took the opportunity to get a cup of tea, the 2nd since breakfast and some post cards of Ypres.\n\nDarkness was coming on when we got away from the town which is a large one with a magnificent cathedral. Then we passed through several villages and about 8.30 arrived at Eecke, where we halted for the night. On the way from Poperinghe to Eecke enemy aeroplanes came over and dropped bombs. I counted 14 of our search lights searching the sky in quest of them, & I could hear the sound & see the flashes of our guns firing upon the planes. \n\nAfter we unharnessed & fed up we had a cold tea, with nothing to drink and made our beds in an old smelly french barn.\n","29":" (1170.)\n\nCold cloudy & windy.\n\nRevallie 7.30.\n\nWe had a good breakfast of fried meat & bacon with bread butter & cheese.\n\nI had a headache this morning which I very seldom have. I attribute it to the dirty musty barn with pigs in the next compartment.\n\nWe got under way at 10. a.m. and passed through a number of villages\n\nincluding Hondenghen, and halted at Staple for dinner and a rest. Here we were able to get some good beer & porter.\n\nA lot of the country we passed through yesterday & this morning was devoted to hop growing, and all through France pigs abound everywhere. They are big ugly brutes, and generally red in colour like the Tamworth variety of pigs in Victoria.\n\nAfter dinner we started off again passing through several small villages Le Nieppe being one until we came to Arques where we halted for the night on the banks of a canal. There is a turn bridge with the axis in the centre of the canal and it was worked by a girl. We unharnessed & fed up before dark and while we were doing that several boats passed through, also a tug drawing 6 barges. The traffic on the river appears to be very busy, and the town a flourishing one. We had about a quarter of a mile to go to our billets, which is a clean looking barn & got our beds made just before dark. As the cooks could not get our tea ready before an hour I took a walk through the town & wrote these notes in a\n\nFrench barbers shop while waiting for a shave. I also obtained some P.C. of the town.\n","30":" (1171.)\n\nRevellie 6.45.\n\nWe groomed fed & watered our animals the first thing and then had a good breakfast of stew made out of fresh meat, & bread & jam & butter.\n\nI noticed that one of the streets is named Rue Miss Cavell, in honour of Nurse Cavell who was murdered by the Germans early in the war.\n\nA great string of boats is plying on the canal this morning. The river Lys runs through the town. We are to start at 9.30.\n\nLeaving Arques we crossed the canal, along the Rue Miss Cavelle, and passed out of the town, turned the corner at the brickfields, and headed for Blequin along the same road that we travelled last August on our first visit. At the Brickfields we had a good view of St. Omer which is only 3 k. away. The road is hilly and is lined with houses most of the way, in fact it is a string of Villages the chief of which are Blendicques, Wizernes, Lumbres, where we halted for dinner. Here I got some more P.C. There is a large brewery here. The next village is Nielles Lez Blequin, where there is a flour mill worked by a water wheel.\n\nThree kilometres further on we reached our destination Blequin in good time. It was showery during the latter part of the journey.\n\nI heard tonight that our recent stunt was a complete failure. It is reported that our Brigade lost 2,000 men being killed and wounded. The whole stunt was badly mismanaged. The artillery was not ready and did not know anything about the stunt until they got orders to fuse a certain number of shells. And it could not be done in the time. The result was that our barrage was not good and our men were slaughtered. Somebody has blundered. \n","31":" (1172.)\n\nA fine morning.\n\nIt is a relief to be here out of the mud of Ypres, & to feel that one is in safety again. Our Battalion will remain here some time to recuperate and to build it up to full strength again.\n\nWe are on the usual routine duties this morning.\n\nThere was a kit inspection of the Transport section this afternoon to ascertain Battle losses. Some of the men had a great many losses, but I was one of the fortunate ones and lost nothing. Most of the losses are due to carelessness.\n\nOn the road yesterday we passed a lot of Gurkers (Hindooes) sitting on the side of the road eating their dinner. In Blequin there are a lot of chinese camped. We see them everyday but they cannot speak much English. At Arques a Japanese flying came passed us on the road but I did not see it, for I was in an estaminet.\n","32":" (1173.)\n\nDull & cloudy, with light misty rain.\n\nI paraded sick this morning, because my feet have been sore for about a week, through being continually in the mud at Ypres & have broken out at the heels. I was given light duties, and had them dressed with Iodine.\n\nI wrote a letter to my wife today, letter 96, 5 pages. I sent it in the official green envelope. I included a German post card taken from a German prisoner. \n\nI also wrote to Cis tonight, in answer to her letter of August 7, No. 5. .\n\nWe were paid later tonight. I drew 20 Francs, 14.8. \n","33":" (1174.)\n\nIt is cold & frosty this morning.\n\nBetween 9 & 10 O’clock last night we were startled by the explosion of bursting bombs. There were 6 or 7 explosions in all. They were dropped by enemy planes and \nwere\n judging by the sounds, fell about a mile from this village.\n\nI sent silk post cards to the following today.\n\nL. Douglas, WGamble, W.Curtis, Miss K.E. Miller, Miss Alice Miller, Robert Wilson, Eric Wilson Maggie Kittson, and also to my wife & sister, 10 in all. \n\nIn the forenoon I went out and got some more French post cards and sent them to the following. My Mother Irene Ring. My Uncle. J.Gilmore, Kitty Gilmore, & Kitty Martin, making a total of 15 silk Postcards in all, cost 7 ½ francs.\n","34":" (1175.)\n\nFrosty last night. A fine day.\n\nThere was a half holiday yesterday and again this evening.\n\nWe are able to get the papers here as usual.\n\nI went for a walk with Dowden this afternoon. A good view can be obtained from the top of the ridges above the village.\n","35":" (1176.)\n\nIt is foggy this morning.\n\nThere are a lot of colds about. I paraded sick & got some medicine for my cough & also got my feet dressed. I was given light duties for the day. I made some cases today for Jim Lawler & myself out of cartridges. \n","36":" (1176)\n\nShowery this morning.\n\nI again paraded sick & was given light duties.\n\nThere was a wild rumour afloat last night that Holland had declared war on England. I don’t believe it & there is no strained relations between the two countries. The papers make no mention of it.\n\nThere was another air raid on England. 5 Zepelins have been brought down in France, three trapped. They were scattered, hunted, & smashed by French airmen & guns. The Zeppelins were lost in their return from England.\n\nTo day the war has been raging 42 lunar months – one prophecy of its duration, and yet there is no prospect of its immediate end, though I believe that it will eventually end as suddenly as it began.\n","37":" 1178\n\nI was on 4th. Picquet last night or rather this morning from 3 to 6. It was a fine night; the horses & mules\n\nquiet and I had an easy time.\n\nThere was the usual half holiday this evening. There was a foot-ball match between A. & B. Companies. W. Kiely played for B. Company, and sustained a kick over the eye, which necessitated medical attention. Thomas also played. These were the only two from the Transports. I did not go but stayed in & made several serviete rings. Also 2 match box covers for Bill Wilson.\n","38":" (1179.)\n\nIt was wet & cold last night with strong winds. There is a gale blowing today. The wind this morning blew down the cook house – an old tumble down shed with open sides.\n\nI made some bok fastenings today for the pioneers to fit to music boxes for the band. I made them out of scraps, using chain links for the Ds\n\nI bought 9 post cards from Private this morning. I wrote to my father today and sent it in the official green envelope. \n","39":" 1180\n\nShowery to day and last night.\n\nPhilipps came back last night from Ypres, but his mate Henry O’Neil is missing. He disappeared one evening. He has either cleared out or is in Hospital.\n\nI heard this morning that Captain Noule who was wounded at Ypres has since died of wounds.\n\nNo papers came to hand this morning.\n\nI wrote to my wife today, letter 97, to be posted in England by a Private in the Brigade named , 7 pages. \n","40":"\n\nFine but frosty.\n\nThe enemy has started a great offensive against Italy. Cadorna has great faith in his men, & says \"the blow of the enemy will find us steady & prepared\". The French have scored another great victory. 8 German Divisions are battered & 8000 prisoners taken. The thrust was in the region of Allemant and Chavignon. H.J. Greewald says it is the most important strategic success since the Marne.\n\nLast night I received a post card from my niece Maggie Kittson wishing me a happy birthday. I brassed 11 rings this evening and finished making a pair of . \n","41":" 1182.\n\nVery frosty this morning.\n\nThis morning I started to make a burnisher for polishing harness irons and steel work.\n\nThis afternoon there was the usual half holiday. Bill Wilson & I went for a walk past the Mayor’s House where the Brigadier resides on to the new rifle range that the chinese are making. There must be over a hundred of them digging picking & shovelling, while others are filling sandbags and revetting, and some are building houses. They are slow workmen but very neat. The officer over them spent 4 years in China & came\n\nfrom Sydney. He says the Chinese make splendid batmen.\n\nThe Germans under Mackensen have made a terrific onslaught & have reached Italian soil, taking 30,000 prisoners & 300 guns. General Cadorna is calm & confident. The British & French have gained more successes.\n","42":" (1183.\n\nCold & frosty this morning.\n\nLast night things were very merry at bed time through some of the boys getting too much Rum and coffee.\n\nI was working on the Burnisher this morning for a while, until I was called off to go with others to be examined by a board at 11. a.m. When we got there, there was so many to be examined that we were told to report again at 2. p.m. On the second parade I was asked a few questions and marked fit. Only one was sent to a board from the Transports for further examination and 8 from the Battalion.\n\nThere was an issue of tobacco & cigarettes today.\n","43":" 1184\n\nShowery all day.\n\nThis morning I was detailed with others to go to the 38 Transports to cut chaff. We got back at 1. a.m. The Germans continue their successes on the Italian front.\n","44":" 1185\n\nLast night we cleaned up our equipment for an inspection this morning at 9.30. by the Colonel. He was not satisfied and there is to be another inspection tomorrow when it is to be hoped everything will be cleaner. \n\nI finished making some serviette rings this evening.\n\nWe were paid to night. I drew 40 Francs = £ 1.9.4. 5 Francs is now worth 3\/8.\n\nAfter pay Bill Wilson & I walked to the next village Nielle-Lez-Blequin . I purchased a Table centre costing 18 Francs for my wife and at the New Zealand canteen we purchased fresh cake and biscuits. We had a few rums & then came home.\n","45":" 1186\n\nOccasional showers to day.\n\nWe are into another month and the war is raging as fierce and as strong as ever. There is no prospect of it ending this year unless the unexpected happens. This is the 1186 day of the war and all the opposing forces in the various fighting zones are infinitely stronger than during the first few week of the war. The British have made a new push on the Western front, and have attained successes that bring us over the west of Passchendaele. Our line has been pushed forward East of Trelcapelle.\n\nThe Italians have lost Udine and are retreating to a new line where plans have been prepared for Allied help. Things are in a bad way in Germany. Count Hertling has been elected Imperial Chancellor in place of Dr. Michaelis. Germany is faced with Bankruptcy. Britain’s war debt is £ 3,000,000,000, & Germany’s war debt £ 4,000,000,000. Austria is bankrupt & neither she nor Germany can pay interest on loans.\n\nI am on 4th picquet to night or rather to morrow morning from 3 to 6.\n\nI received a letter from Willie this evening dated Oct. 20. He is in the 42. Battery, in the horse lines when writing, but expected to be sent up to his Battery. His letter was very much censored. The number of his division being obliterated every time and also reference to other units, though his remarks were left intact.\n\nThursday\n Friday Nov. 2. 1917. 1187.\n\nShowery to day.\n\nI was on usual routine duties to day.\n\nI wrote to my wife tonight, letter 98. I also sent to my dear wife a parcel containing 1 table centre and 4 serviette rings made out of the driving bands of German shells. I also ordered through the Battalion a new book called \"Australia in the Great War\" a copy to be sent to my wife and also my sister, Mrs. Kittson. \n\nThere is a furphy afloat\n\nthat we are to go back to the front shortly, probably the 8th . Also that on Monday the unattached men in the transports are to do a few days drill.\n\nTo days papers report that Count Hertling has been rejected by the German Reichstag as Imperial Chancellor. This is a blow to the Kaiser.\n\nSaturday Nov. 3. 1917. 1188\n\nCold & showery all day.\n\nThere was the usual half holiday this afternoon & I spent the time rearranging my Pack & equipment and also in packing another parcel to be sent to my wife containing 3 needle cases made out of German cartridge cases, and also the end of a British brass 18 pounder shell case which would make a good dress makers hot iron stand. I got the other parcel censored by Lieut. Mc.Nicol this morning. \n","46":" 1189\n\nLight misty rain.\n\nThis afternoon being a half holiday I went for a walk with Bill Wilson around the hills passed the Chinese company making a New Rifle range. There I saw a chow operated on by another chow for varicose veins in the legs. He stood rigid while a needle was stuck in the vein and the blood spouted out.\n\nThis eased him & he went back to work.\n\nThis evening I made up a parcel to send to my wife containing 3 needle cases made out of German cartridge cases, 1 dress makers ironing stand made out of a brass shell case of an 18 pounder British shell, 2 German clips & 1 button, also 2 French D’oyleys.\n\nTo night I had a hot bath at a French farm house in a tub and paid 1 franc for it.\n\nMonday \nOct 5\n","47":" 1190\n\nA fine but cloudy day.\n\nAt dinner I with 6 others went for a bath with D. Company. Baths have been erected at Ledinghem about 1 kilometer away. It was a shower bath, the first I have had for months. I was oiling new harness this afternoon.\n\nI wrote to my wife tonight, letter 99, 4 pages. I also wrote to Willie in answer to his letter. \n\nAt tea time tonight, our officer Mr Boyland told the Sargeant that he was to go on London leave tonight. So he got very short notice.\n\nAn Australian mail came in this evening & I am expecting some letters.\n\nThe French have had a brilliant victory on the Aisne, and the Italians are now resisting the invaders.\n\nA German auxiliary cruiser has been sunk in the Cutbegat and 10 armed patrols destroyed by the British. On the Belgian coast an electrically controlled high speed boat was destroyed.\n","48":" 1191\n\nLight misty rain, which is changing the ground again into soft mud. A few fine days is sufficient to dry up the mud, but a few hours rain make it as bad as ever.\n\nThe Italians are holding the Tagliamento line firm and fruistrated German attempts to cross.\n\nI got Lieut McNicol to censor the parcel last night, & I sent it away this morning. It cost 9d to register it.\n\nThe Transport were inoculated this evening against diseases. They were all done except a few men.\n","49":" 1192.\n\nCold & showery today.\n\nVery few men were on parade this morning. They have very sore arms and headaches. I had very little sleep last night and was hot and feverish. I have a headache to day, and did not get up until 9. a.m. with the exception of a few minutes for breakfast.\n\nThere was the usual half holiday this afternoon but most of the Transports stayed in & nursed their arms. I made some rings out of the copper tube of the U. boat that was driven ashore on the French coast.\n\nTo night I had a letter from Willie dated Nov. 1. He was then in Hospital wounded (gas & shell shock) and was going to Blighty that day.\n","50":" 1193.\n\nFine but cloudy.\n\nThe Germans have pierced the Tagliamento line and the Italians have been forced to \n\nto retreat further back on a wide front. The position is serious & 6,000 more prisoners captured. British & French troops have arrived in Italy & received an enthusiastic welcome.\n\nWe are busy getting things ready in preparation for a move to the fighting zone tomorrow.\n\nI gave some of my old clothes away to a French blacksmith. \n","51":" 1194\n\nRevelle 6. a.m. instead of 6.30. fed our horses, had breakfast & rolled our blankets, then loaded the limbers, and got away about 10. a.m. The roads were very muddy and dirty especially where the traffic was heavy, but the rain kept off.\n\nWe took a different road this time, past the old flour mill near Blequin, and through the village of Vaudringhem and then on to Drionville where we halted for dinner. I was sitting eating my dinner on a plough watching the mules in my waggon when a french woman came out with a chair & another opened her door & invited me inside to the fire which was very acceptable.\n\nAbout 2. p.m. we left Drionville travelling along the same road as on the last journey until we came to Merck St. Lievin where we halted for the night.\n\n\t\n\nWe had time to feed up, make our beds in a nice dry barn, & have tea before dark. Afterwards we went out for a walk & had a few beers.\n","52":" 1195\n\nA wet cold miserable morning. We had breakfast in the rain, alongside the waggons, standing up in our overcoats. I am making these notes while we are waiting to start. We left Merck St. Lievin about 9.30 though we should have been away an hour sooner, but for waiting for the officers of the 4 Transports that are travelling together. The first village we passed through was Ouve and the next was Clety where a Portuguese Battalion is billited. We had dinner on the road near here. We passed through Herbelles, Inghem Erques, Winnves, Esqurietove and several other villages that I did not get the names of. It was an hour or more after dark before we reached our destination, the village of Boeseghem about 7. O’clock in pich dark and rain.\n\nThere was considerable difficulty & delay in finding the various billets in the dark & rain. Eventually we found them, unharnessed, fed up, & after another wait had tea. Our billet was a large barn with plenty of fresh straw. I am\n\non fourth picquet in the morning from 3 to 6. At 9. p.m to night the rain has stopped and it may be fine the rest of the night.\n","53":" 1196\n\nIt was fairly fine this morning while I was on picquet but it was very sloppy underfoot. There are some fine buildings on this farm particularly the cattle sheds. The cows are all stalled and bedded down like horses. They are fat & healthy looking. There is the usual pit around which are clustered all the other buildings in the form of a hollow square.\n\nThis place is evidently close to a manufacturing town for I can see the red glare of furnaces in the sky. \n\nWe left Boeseghem this morning about 9.30 & passed through Thiennes which is only 2-3 killometres away, then through Steenbecque 1.7 k further along the road and thence through the commune of Norbecque but not into the town. Steenbecque is a large village, & it being Sunday we met a lot of people going to church. At the church which is a large brick one there was a man with a stall selling merchandise. When we crossed the railway we went through a large forest called Le Parc, and crossed two streams on the way through, over which there were suspended\n\niron bridges. At these bridges there was the usual Estaminet and a few houses the first was Pont de Vin and the second Rue a Vin. On the way through Le Parc we stopped for dinner (bread & jam & cheese & tea) & eat it in the rain.\n\nThen we passed Pont de Poervain and through Coverque and then through the village of Vieux Berquin, a large one, until we came to a point midway between Bailleul and Steenwerck where we camped on a farm for the night, sleeping in a loft with a hard brick floor.\n","54":" 1197.\n\nThere was a very heavy frost last night and it is bitterly cold this morning. Ploughing is in full swing all through the country we passed through on Saturday and Sunday. Harvesting is finished and there are large stacks of beet root everywhere, also mangolds & turnips. These heaps are being covered over with straw and earth to protect them from the frost until they are carted to the factory. This is usually done when the ground is frozen hard. Some of the largest heaps of turnips I have ever seen are to be found in this district. At mid day yesterday we could see the observation baloons and throughout the day hear the bombardment of the big guns, and also to day and last night. We got a start about 10. a.m. and passed\n\nthrough Steenwerck, also Station de SteeNwerck and crossed the railway line and halted at our destination about 2. p.m. This camp is a splendid one, the best Transport camp that we have been in. There is every conveyance except a bath. There is even a mess room alongside the kitchen. For a long time we were in doubts if it was the right camp, which was fosted by the Q.M. staff getting orders not to unload their waggons until further orders. This is an artillery Horse camp and there is plenty of room for the horses, but the wagon space is rather limited. To night there is a heavy bombardment going on.\n","55":" 1198\n\nYesterday was a beautiful day, but today is dull & cloudy. This morning we are busy unloading, grooming, cleaning & putting this in order. The name of this camp is Rue de Sache. It is in Belgium about 3 miles from Steenwerck and on the frontier and main road. \nEvery\n Just across the road, where we get the water, it is French soil, and the people in the house are very nice, and can speak English fairly well.\n\nWe have stretchers to sleep in, but most of them are too narrow, & a few are too short, but these are trifles. The latest news from all the war fronts are very encouraging. Russia is not yet lost to the Allies. Korniloff, the general who was arrested for \n\ntreason, is assisting Kerensky, who is marching at the head of loyal troops to attack Lenin at Petrograde. Italy is holding up the Germans, and have two successes in the North. Haig has started a new offensive in Flanders. An advance has been made along the crest of the main Ridge North of Passchendaele. General Allenby has met with new victories in Palestine in the neighbourhood of Esduide, 25 miles north of Gaza, and captured enormous booty, war material & prisoners.\n\nI received a letter from my wife today 86, dated September 9, also one from Griffiths Brothers telling me they were forwarding a hamper sent by the people of Bridgewater. \n\nThere is a very heavy bombardment this evening which grew to great intensity to night.\n\nTonight I received a letter and a parcel of tobacco from my sister dated September 14, No. 6. \n","56":" 1199\n\nIt is foggy & cloudy today, and a sharp frost last night. This afternoon we went for a bath to a Bath run by a scotch Battalion. It was first class, hot showers etc. We were issued with new underpants, shirt & socks in exchange for our dirty one. We took up a collection for them.\n\nI received another letter from my wife this evening, 87 dated September 21.\n\nI wrote to my wife tonight 8 pages enclosing a pencil drawing of myself, No. 100. I also wrote to my brother Willie in England. \n\nOur Battalion went into the Trenches yesterday. The Transports took their ration to the \n\nStation and it was taken up by the train to the Dump. Mr. Boyling & Jim Lawless accompanied it. This is the first time that we have sent rations to the trenches by train.\n\nThere are some spasmodic bombardments to night by our artillery.\n","57":" 1200\n\n4th year of the war & 104th day or 1200 days in all.\n\nEarly this morning Byrns who was boarded at Blequin & found unfit was sent away this morning with some half dozen others including Harry Jaugernaut D. Company’s Cook, & D. White, the M.P.\n\nTo day Fred Barclay paraded sick and was sent into Hospital suffering from rupture. He did not know he had it until he saw the lump at the bath.\n\nMorrison was sent back to the Brigade today. He originally came from the Brigade as a batman to Colin Smith. He is now a driver.\n\nI received a letter from Annie McKinly today. \n","58":" 1201\n\nThe weather continues fine. There was a heavy bombardment all night, which increased to drum fire of great intensity in the morning and continued long after daylight.\n\nI received a letter from T. Douglas of Dookie College dated Sept. 9. 1917.\n","59":" 1202.\n\nCold and foggy this morning.The Germans are within range of Venice and have crossed the Piave River. There is scarcely any gun fire this morning. There was intermittent bombardment during the night.\n\nThis afternoon has been exceptionally quiet and there is no bombardment to night.\n\nI wrote to Tom Douglas, Miss Annie McKinly and my sister Mrs. Sally Kittson tonight. \n","60":" 1203.\n\nDull & foggy.\n\nThere was a church parade this morning for those who could get away. Protestants 9.30, R.C. 10 A.M.\n\nThere was also an inspection of the harness & horses by the A.S.C. and our vet Cpt. Davidson. One of our horses has the mange and the back stable were disinfected in consequence.\n\nFor months past we have had a plague of lice in our clothes. The bites itch very much & we have to frequently change our clothes & wash them, or they would crawl away. Now a kind of rash is breaking out on a lot of the men which is similar to scurvy. It is very itchy at night. The probable cause of it is a lack of sufficient vegetables, and clean clothes.\n\nThere is not much bombardment today, & none this morning. What there is is up towards Ypres and Passchendaele.\n","61":" 1204\n\nCold & cloudy.\n\nThe front is very quiet this morning.\n\nI have now 2 horses to look after, groom, water, & feed. Also 1 saddle to keep clean.\n\nI finished reading a book to night \"The Four Feathers\" a military tale by A.E.W. Mason. \n\nI am on picquet to night\n\nfrom 9 to 12.\n\nThere is a heavy bombardment to night in the direction of Ypres. \n\nThe flashes can be plainly seen.\n\nThere are a lot of complaints in the Transports about our food. There is not enough, no variety, and it is badly cooked. The Transport cook is the worst in the Battalion, and not very clean. The porridge is often raw and at other times burnt. While his hashes are often only warmed. His stews are often indistinguishable from soup unless he has named it. The tea is like dish water. There is some talk of parading to the officer about it. The pots and dixies are filthy, and the water for washing our mess tins is often greasy & luke warm instead of being clean & boiling. He should have no trouble in keeping things up to the mark, for there is a plentiful supply of water and a good cook house. He has a greasy assistant who wears spectacles, and spents most of his time sitting down or eating. In serving out the meals they are both as slow as funerals and measure out the allowance with niggerdly care. We should be on full rations now that the Battalion is in the Trenches. It is no better than when we were at Blequin. The fact of the matter is the Q.M. is running the Battalion as cheaply as possible.\n\nCpt. Gordon of the A.S.C. said yesterday that our Transports were the best in the Brigade, & easily came first for clean\n\n\t\n\nharness and horses. Our officers gave him a good dinner and plenty of \"Johnny Walker\". This is the first time that we came first. It is also the first time the Inspecting officer was so well treated.\n","62":" 1205\n\nA nice morning but rather fresh. \n\nWe had a good breakfast this morning for a wonder. There is a very heavy bombardment this afternoon which has increased to great violence to night in the direction of Passchendaele.\n\nI received another letter from my wife to night dated Aug 21. No 84. I wrote to my wife tonight letter 101, 6 pages. \n","63":" 1206\n\nThere is a change in the weather to day. There was some rain early this morning, & occasional misty showers during the day.\n\nI finished making a lot of finger rings for J. Mooney of the Q.M. store & L\/C Lawless.\n\nSergeant Partridge came back from leave in Scotland & England to day.\n\nI had another letter from T. Douglas today dated Sept 4.\n","64":" 1207.\n\nFine but cloudy. \n\nThere was another big bombardment last night & this morning.\n\nL\/C. J. Lawless was awarded the military Medal by Lieut Boyland to day for good work done in some of the recent stunts with the Pack mules. \n\nI heard today that Colonel Woods of our Battalion is to take charge of the 38 Battalion, who went away last February sick.\n\nI received another letter from my wife today dated August 26. \n","65":" 1208.\n\nA fine morning & nice day.\n\nThis morning we are 12 months in France. I hope we will not have to spend another year here. Part of this time was spent in Belgium. We are in Belgium now, right on the frontier.\n\nThere was an inspection of the Transports this morning by Major Robinson, the second in command. Special leave is granted to Paris. It will not effect Blighty leave. 2 men a week, & our transports have the first two weeks.\n\nHarry Wight came back last night from Hospital. He has been away 3 months, suffering from Typhoid Fever. He left us at Blequin.\n\nEnemy planes were over this evening and again about dark when they dropped bombs not far from this camp.\n\nSaturday Nov. 24. 1917. 1209\n\nA rough windy day.We were paid to day. I drew 20 francs.. 14\/8. This is the first pay we have received this month.\n\nI was out at an estaminet to night with W. Wilson & Trevenna and had a few drinks.\n\nThere is a notice put up in the estaminets in French & English notifying the Public that a few cases of hydrophobia has broken out and all dogs in the whole of Flanders not occupied by the enemy must be muzzled.\n\nThe British have won a great Battle Cambrai & taken upwards of 9000 prisoners. It is \n\nthe bigest bit into the German lines yet made in the time & shows that the Hindenburg line is not impregnable.\n\nI had a letter from Willie dated","66":" He is in Norwich Hospital and getting on well. His case was more severe than his first letter indicated. His battery was close up to Zonnebeke and they met with many casualties.\n","67":" 1210.\n\nCold & rough to day. We had a half holiday this afternoon & with W. Wilson & Trevena walked to Roumarna about 20 chains up the road. We had a few drinks purchased two loaves of bread & came home as it was very stormy.\n\nThe name of this camp Rue de Sal, and comprise a series of camps for each Battalion Transports. Our one is called Warrington lines & is the first on the road.\n\n I wrote to my brother Willie tonight. \n","68":" 1211\n\nIt was bitterly cold last night & this morning. I was on the usual routine work to day; feeding watering, & grooming horses, also cleaning officers saddles.\n\nI have finished making rings out of a copper petrol tube from the engine of the U. boat that was driven ashore on the beach at Tardinghem. \n\nOne of the huts in an adjoining transports camp was burned down to night after tea. (39)th\n","69":" 1212.\n\nThere was a very heavy \n\nand continuous bombardment last night, this morning and throughout the day.\n\nThere was a lot of rain early this morning and throughout the day. I am on 4th picquet to night or rather to morrow morning from 3 to 6.\n\nThere is good news from all the fronts. The Italians have changed from defence to attack. There are great victories in the neighbourhood of Cambrai. Bourbon wood is captured. All attacks at Passchendaele & Ypres have failed.\n","70":" 1213\n\nI had a busy time this morning on picquet, 2 draughts to feed, 11 men & an officer to call at 5.30. Got breakfast ready for 8 men & an officer who was going on leave. I was also hut orderly for the day.\n\nThe weather is again fine.\n\nDriver Roy Ward was sent to the hospital today with scavey. \n\nThursday Nov. 29. 1917. 1214\n\nA fine day.\n\nThe rings that I made have a great repitation. I have to make some for several of the officers.\n\nWe were paid to night . I drew 20 francs 14\/8.\n\nI received 2 letters from my wife today 88, October 6 and 89","71":" \n\nThe Battalion went into the trenches today & will remain there for 8 days.\n","72":" 1215\n\nA fine day. The weather \n\nis keeping remarkably fine. The boys hop over to night. There is some bombardment on. It started about 5.30. The sky is being continually lit up with vivid flashes, but there is not much noise as the wind is against us, & as it is the trenches that is being shelled the guns are mostly 18 pounders.\n\nDuring the past few days, enemy planes have been over here observing. To day one flying very low, came out of a cloud, evidently lost. It was immediately shelled, but escaped, flying towards inland.\n\nI wrote to Cis also Father to night. I also wrote to my wife tonight letter 102. \n","73":" 1216.\n\nCold with a few light showers today. There is a change brewing.This is the last month of the year. This time last year we never thought that we would be in France in a years time, or that we would be likely to spend a second Christmas here. We were looking forward to the war ending in a few months, just as we are now looking forward to it finishing early in the new year probably February or March. In the raid last night 3 of our men were killed by a bursting shell. A few prisoners were taken, and large numbers of the enemy slain. A look out tower of the enemies was blown down. Other Battalions were equally successful.\n","74":" 1217.\n\nA bitterly cold & windy day. There was an inspection this morning, & the usual half holiday in the evening. I stayed in the hut for it was too cold to go out.\n\nOrders came through to wear the hat badge on the side, instead of the front. Also to wear the side turned up. This is the way we wore the hats in Seymour until we got to Lark Hill. It is the Dinkum Anzac style, & is a vast improvement on the other way.\n\nI got a book of P.C.J Ploestreet\n\nI received a letter from my wife today dated October 8, No. 90, also 2 from my sister dated October 5 (7) and October 9 (8). I also had a letter from Willie dated Nov. 18. \n\nI was on second picquet to night from 9 to 12. it was cold & frosty, but I had a fire in an oil drum.\n","75":" 1218\n\nCold & frosty this morning with a bitterly cold wind all day. There was ice on the water at dinner time.\n\nThe chats (lice) still continue to trouble us very much.\n\nThere has been a heavy bombardment all day, & at intervals to night.\n\nIt now gets dark soon after 4. p.m. The sun is sinking lower in the sky every day.\n\nI had a feed of fried eggs, bread & coffee to night.\n","76":" 1219\n\nIt was very cold & frosty last night. There is ice every-\n\nwhere. About 9. O’Clock it started to snow very lightly, & continued at intervals for a few hours. It was the first snow I have seen this winter, though snow has fallen in other parts of France, & here at night.\n\nTo day all those who won medals were paraded, and accompanied by a guard of honour from the trenches marched to a spot not far from here and were presented by General Birdwood with their ribbons of honour.\n\nJ.D. Matthews & Charlie Charles went to Paris on indulgence leave.\n","77":" 1220\n\nCold & frosty. Clear sky. Thick ice everywhere, which remained all day.\n\nEnemy aeroplanes were about all day.\n\nAfter dinner I saw 3 enemy baloons float over our lines. One passed over our camp. They were very high up and were of a round pattern with cages hanging to them. They evidently broke away from their moorings or were realised on purpose. By some automatic arrangement newspapers printed in French were dropped out of them. They were dated Sept 15. They contained a list of names of French citizens who were killed by British shells in Lille and elsewhere.\n\nDuring the evening the enemy put over a lot of ranging shells.\n\nA Transport Officer and had a good time here tonight in company with two visiting officers. They had plenty of whisky. \n","78":" 1221.\n\nThe ground is all frozen hard & the water is covered with ice.\n\nWe washed the Hacks this evening with cresoil, an evil smelling prepEration to kill verman & disease.\n\nWe were issued with leather jackets this evening. They are made out of tanned sheepskins with the wool on.\n\nFriday\n I sent a parcel to my wife containing one German water bottle, rather battle worn. It cost 17d to register it.\n","79":" 1222.\n\nIt is not so cold this morning. I received a letter from Willie to day. He is still in the hospital at Norfolk & expects to be sent to Australia soon. \n\nI was on a chaff cutting parade today to the 38. Battalion camp.\n\nI wrote to Willie tonight. \n\nDuring the past week there has been some terrific battle in the neighbourhood of Cambrai, without decisive results. Latest news is to the effect that the British are smashing foe attacks, & have also a gain at Ypres.\n\nI wrote to my wife tonight letter 103 telling her (4 pages) that I have sent her a German water bottle yesterday. \n","80":" 1223.\n\nA fine morning. It is\n\nnot so cold now, and the ice is nearly all melted. There is nothing special to report today. The enemy fired a few shots at an observation baloon behind our Camps, but without result. Comfort funds cigarettes were distributed tonight. I answered two cards that were enclosed. They were addressed to N. White and Fred. J. Wilson.\n\nBryan Dowden & I went out to night and had a feed of eggs, Bock & bread in a french house. We went to another house & had another feed of eggs, chips & bock before we came home.\n","81":" 1224\n\n A showery day. There was an inspection of the harness & mules today. There was a half holiday, but it was too wet to go out.\n\nDuring the past few days I made a beautiful jug out of a Fritz shell cartridge case. The case was made at Dusseldorf in 1909 and was about 2 ½ in in diameter. I also finished making a flower vause for myself.\n\nI finished reading \"The Harvester\" a beautiful story by Gene Stratton Porter. The scene is in America in the woods & deals with country life, flowers plants & trees, and the realisation of a dream, and an ideal.\n","82":" 1225.\n\nThe Colonel was around this morning inspecting.\n\nTo morrow a poll of the soldiers in the A.I.F. in France will be \n\ntaken on conscription. Its provisions were explained by Lieut. Birrel this morning. \n\nI had a bath today & got a clean change of underclothing.\n\nA number of enemy planes were over at mid day & dropped some bombs, without any damage. One bomb from a Gotha fell near a Battalion on the march & splashed dirt \nover\n over them. \n\nI saw two round balloons high up float over from the enemy. They dropped some papers.\n","83":" 1226.\n\nI was on picquet this morning from 3 to 6. it was cold & frosty. But I had a fire.\n\nThe election for the referendum on conscription was held today. I voted for conscription.\n\nI was shouted a dinner of 4 eggs chips & bock today by Bryan Dowden & thoroughly enjoyed. It was a vast improvement on bread & jam.\n","84":" (1227).\n\nI was on chaff cutting to day at the 38. Transport stables. While there a large number of enemy planes (I counted 12 and there may have been more) and dropped bombs near Neuve Eglise. They flew over the stables. Later I heard that some of the bombs fell on a foot ball field and wounded 60 – killed 12, but these figures may not be correct.\n\nThis evening Bill Wilson, George Dods, and Cliff Thomson had to report back to there Companies. A batch from the Q.M. store also had to go. I am doing picquet for H. Ghent to night. From 9 to 12. I received 6 francs for doing it. It is the first time I \n\nhave bought a picquet.\n\nJerusalem has been taken by the British, on the 8th. The enemy had a brief success in Italy. The Germans have suffered a disaster by the explosion of a big chemical factory at Griesheim, Frankfurt. I forgot to say that one of the enemy planes was brought down in flames.\n","85":" 1228.\n\nIt was very cold on picquet last night. There was a white frost & ice on the water.\n\nWe were paid to day. I drew 20 francs. 14\/8. Charlie Charles & Jack Mathews came back from Paris leave last night. They much prefer Paris to Blighty, and enjoyed their holiday.\n","86":" 1229.\n\nWe left the camp at Rue de Sac, Romarin this morning and went to Hill side Camp, Neuve Eglise a few miles away arriving before dinner. This camp is much inferior to the last one, and the stables have not been completed, not having any roof on, although the rafters are up. The huts are also inferior, having low sides and no sand bag protection. They were also filthy. To night I went out with Alic Holmes & we had a feed of eggs.\n","87":" 1230\n\nIt was bitterly cold yesterday with misty rain, but it is much finer today.\n\nI saw Pte. Sylvester today. He is in the 6th Battalion, and has been a long time in Blighty. He has been only 2 months in France this time\n\nand is\n He was in the 6 Division while in England. When it was broke up he was sent back to France with reinforcements.\n","88":" 1231\n\nCold & frosty this morning with a sharp cold wind from the North.\n\nSome enemy planes came over at midday but were quickly driven off.\n\nI started to walk to Dranoutre to see Sylvester but I heard that his Battalion had moved into the lines so I turned back.\n","89":" 1232.\n\nThe ground and everything this morning was enveloped in a mantle of snow. Light flakes of snow continued all the morning. \n\nIt was so cold we took all the horses & mules out for exercise.\n\nYesterday I saw Sgt. Lear of Portland. He is in the 23 Battalion, & is one of the original men. George Thomson of Bridgewater is in the same Battalion.\n","90":" 1233.\n\nCold & frosty. The ground is frozen. We took the horses out for exercise this morning. Fritz attempted to raid the lines yesterday evening, but was repulsed. We took some prisoners. We could hear the machine guns at the stables. I am on 1st picquet tonight, from 6 to 9.\n\nFour of us were paraded today before Mr Boylan by the Sargeant \n\nfor being a few minutes late on first parade this morning. The charge was dismissed.\n","91":" 1234.\n\nCold & frosty this morning.\n\nFor some time I have been very itchey. I paraded to the Dr Collins this morning. He examined me & said I had the scaveys and sent me to the Steinwerck hospital. I am going in in a limbre.\n\nI went to the hospital after dinner to Steinwerck. Remained there for tea when I was sent away in an ambulance to a hospital \nat\n near Steinwerck and was put in the scabies ward. I had another tea & was given 5 blankets and a hot drink at 7. p.m.\n\nI had a letter from Willie yesterday dated Dec. 13. He is still at Norfolk hospital.\n","92":" 1235\n\nThere was a heavy fall of snow last night. It was bitterly cold & frosty all day, and the whole landscape remained covered with snow all day. The snow froze on the branches of the trees. The food in this hospital is excellent, and well cooked. We get 3 good meals a day, arroroot for breakfast & roast beef for dinner, sago for tea. In addition we get a cup of cocoa or coffee about 11 a.m. & again at 7. p.m. I had a hot bath this evening. The doctor says that I have only a very slight attack of scavey.\n\nI wrote to the Postal Orderly telling him not to send my mail away as I will be back soon. \n","93":" 1236\n\nA nice day. The ground is \n\ncovered with snow but there is no cold winds.\n\nThe Doctor was again round this morning, & looked at the new patients.\n\nI gave in all my clothes this morning to be fumingated, and am wearing hospital blues today.\n\nThe result of the Canadian election is a substantial majority in favour of the Borden Government & Conscription. The people have approved of compulsory military service & given a mandate to the Union Government to \"carry on\" that will hearten the fighting men, and prove to the Allies that she will see the war through to victory.\n\nThis afternoon I spent sorting out, reading and burning old letters.\n\nFriday\n","94":" (1237.)\n\nA dull morning, but it is not cold, and there is no wind. This afternoon the sky was blue and clear. The Sun shon out brightly. It is a lovely afternoon. Too good to be inside. It is so good a day for observation that a number of enemy planes ventured out. Some big guns are in action on this front.\n\nI wrote to Willie to day, also to my wife. Letter 104, 4 pages.\n\nWe all in this ward had a small bottle of Guinness extra stout for dinner.\n\nI had another hot bath this evening and to night anointed myself with sulphur ointment from head to foot. I forgot to say that\n\nwe all were hospital blues with a big cloak made out of a blanket, and a huge band tied around the middle which makes us look like Monks.\n","95":" 1238\n\nA nice day. Another heavy frost last night.\n\nThis morning I was removed from No 1. ward to No. 3 ward which is a large one with 25 beds. This is called a medical ward and is for convalescents, being the second stage in the cure. There are 22 patients in this ward. We were all issued with a bottle of Bass English ale which was splendid, also 2 packets of cigarettes. (Crayol), the third issue since I have been here. There was a concert here in the canteen given by the Anzac coves. It was well attended, but I have been at much better concerts in France. The programme items of a very low standard to put it mildly.\n","96":" 1239\n\nChristmas Eve. It is cold and frosty today. I had a hot bath this morning, the third since I have been here and another change of clothes, the second. We had another issue of cigarettes.\n","97":" 1240\n\nChristmas Day. 1917\n\nThis is the first Christmas I have spent in an hospital and the second in France.\n\nBefore dinner to day we were all issued with a Christmas box the gift of the \"Australian Red Cross Society\". It contained\n\na card embelished with the Kangaroo & Emu and with good wishes for a recovery and a termination of the war with victory, also 6 pkts of Capstan cigarettes, 1 tin Capstan tobacco 1 pipe, 1 pkt playing cards, 1 match box holder & 1 pkt of Griffiths chocolate, 1 handkerchief.\n\nTables were brought in for dinner which was served in proper style. An attempt was made at decoration by hanging up a bed cover on which was a boomerang with a Kangaroo and Emu on each side, done in cotton wool. Beneath were the words \"A Xmas Greeting\". The dinner was voted \"Tres bon\" by the patients. The first course was Tomato soup, the second roast Poultry, beef, ham and vegetables. The thirds course was plum pudding, followed by Jellies & fruit. The table was heavily laden with nuts, cigarettes beer and porter, two bottles to each man.\n\nTea was of the usual hospital fare. The dinner was given by the Colonel. During the dinner the Colonel & Major of the Hospital called in to see how we were getting on. He read a copy of a Message received from the King and Queen, also a long message from Sir Douglas Haig. Both messages came by the 12 O’Clock mail.\n\nTo night there was a very heavy \n\nfall of snow, some 6 inches falling in a few hours.\n\nThere was a fancy dress ball to night in the recreation room. A number of soldiers were dressed as girls & nurses and looked charming. The patients were not at it but but the \"ladies\" came in to see us.\n","98":" 1241\n\nBoxing Day.\n\nThe usual routine order prevails in the ward today. Some of the patients are sick, others are malingering as it is time for them to go out.\n\nI am to go to the tent this evening, and from there to my unit.\n\nThis evening J. Watson came into this hospital with scabies. He and Dick Sheenan paraded to the Doctor this morning. Sheenan was sent to another hospital suffering from zema. I had a feed of eggs & chips to night.\n","99":" 1242.\n\nThe Doctor came round this morning. I am to return to my unit to day, probably some time this evening. The Transport removed before Christmas from Neuve Eglise to Jesus Farm. During the past few nights our artillery straffed the enemy and on Chrstmas Eve British planes bombed Mannheim, a large German town on the Rhine, with effective results, that were observable.\n\nI left the hospital this evening about 2.30 with others and walked to the Battalion camp at Menin and from there to the \n\nTransports at Jesus Farm, about a kilometre away. I had to carry all my kit which was very heavy with suivenirs etc.\n","100":" 1243.\n\nA cold miserable day, especially in the afternoon.\n\nSeveral enemy observation planes were over today. The archie kept up a hot fire, & several of their duds fell near the stables. I heard that a piece of shrapnel fell through a hut and killed a soldier in another Division.\n\nI saw Mr Hunter today. He used to be Transport officer. He has been in England since June & only returned yesterday.\n\n"}}