{"Document Name":{"0":"Diary_0095","1":"Diary_0095","2":"Diary_0095","3":"Diary_0095","4":"Diary_0095","5":"Diary_0095","6":"Diary_0095","7":"Diary_0095","8":"Diary_0095","9":"Diary_0095","10":"Diary_0095","11":"Diary_0095","12":"Diary_0095","13":"Diary_0095","14":"Diary_0095","15":"Diary_0095","16":"Diary_0095","17":"Diary_0095","18":"Diary_0095","19":"Diary_0095","20":"Diary_0095","21":"Diary_0095","22":"Diary_0095","23":"Diary_0095","24":"Diary_0095","25":"Diary_0095","26":"Diary_0095","27":"Diary_0095","28":"Diary_0095","29":"Diary_0095","30":"Diary_0095","31":"Diary_0095","32":"Diary_0095","33":"Diary_0095","34":"Diary_0095","35":"Diary_0095","36":"Diary_0095","37":"Diary_0095","38":"Diary_0095","39":"Diary_0095","40":"Diary_0095","41":"Diary_0095","42":"Diary_0095","43":"Diary_0095","44":"Diary_0095","45":"Diary_0095","46":"Diary_0095","47":"Diary_0095","48":"Diary_0095","49":"Diary_0095","50":"Diary_0095","51":"Diary_0095","52":"Diary_0095","53":"Diary_0095","54":"Diary_0095","55":"Diary_0095","56":"Diary_0095","57":"Diary_0095","58":"Diary_0095","59":"Diary_0095","60":"Diary_0095","61":"Diary_0095","62":"Diary_0095","63":"Diary_0095","64":"Diary_0095","65":"Diary_0095","66":"Diary_0095","67":"Diary_0095","68":"Diary_0095","69":"Diary_0095","70":"Diary_0095","71":"Diary_0095","72":"Diary_0095","73":"Diary_0095","74":"Diary_0095","75":"Diary_0095","76":"Diary_0095","77":"Diary_0095","78":"Diary_0095","79":"Diary_0095","80":"Diary_0095","81":"Diary_0095","82":"Diary_0095","83":"Diary_0095","84":"Diary_0095","85":"Diary_0095","86":"Diary_0095","87":"Diary_0095","88":"Diary_0095","89":"Diary_0095","90":"Diary_0095","91":"Diary_0095","92":"Diary_0095","93":"Diary_0095","94":"Diary_0095","95":"Diary_0095","96":"Diary_0095","97":"Diary_0095","98":"Diary_0095","99":"Diary_0095","100":"Diary_0095","101":"Diary_0095","102":"Diary_0095","103":"Diary_0095","104":"Diary_0095","105":"Diary_0095","106":"Diary_0095","107":"Diary_0095","108":"Diary_0095","109":"Diary_0095","110":"Diary_0095","111":"Diary_0095","112":"Diary_0095","113":"Diary_0095","114":"Diary_0095","115":"Diary_0095","116":"Diary_0095","117":"Diary_0095","118":"Diary_0095","119":"Diary_0095","120":"Diary_0095","121":"Diary_0095","122":"Diary_0095","123":"Diary_0095","124":"Diary_0095","125":"Diary_0095","126":"Diary_0095","127":"Diary_0095","128":"Diary_0095","129":"Diary_0095","130":"Diary_0095","131":"Diary_0095"},"Date":{"0":"unknown","1":1463.0,"2":1464.0,"3":1465.0,"4":1466.0,"5":1467.0,"6":1468.0,"7":1469.0,"8":1470.0,"9":1471.0,"10":1472.0,"11":1473.0,"12":1474.0,"13":1475.0,"14":1476.0,"15":1477.0,"16":1478.0,"17":1479.0,"18":1480.0,"19":1481.0,"20":1482.0,"21":1483.0,"22":1484.0,"23":1485.0,"24":1486.0,"25":1487.0,"26":1488.0,"27":1489.0,"28":1490.0,"29":1491.0,"30":1492.0,"31":1493.0,"32":1494.0,"33":1495.0,"34":1496.0,"35":1497.0,"36":1498.0,"37":1499.0,"38":1500.0,"39":1501.0,"40":1502.0,"41":1505.0,"42":1506.0,"43":1507.0,"44":1508.0,"45":1509.0,"46":1510.0,"47":1511.0,"48":1512.0,"49":1513.0,"50":1514.0,"51":1515.0,"52":1516.0,"53":1517.0,"54":1519.0,"55":1520.0,"56":1521.0,"57":1522.0,"58":1523.0,"59":1524.0,"60":1525.0,"61":1526.0,"62":1527.0,"63":1528.0,"64":1529.0,"65":1530.0,"66":1531.0,"67":1532.0,"68":1533.0,"69":1534.0,"70":1535.0,"71":1536.0,"72":1539.0,"73":1540.0,"74":1541.0,"75":1542.0,"76":1543.0,"77":1544.0,"78":1545.0,"79":1546.0,"80":1550.0,"81":1551.0,"82":1552.0,"83":1553.0,"84":1554.0,"85":1555.0,"86":1559.0,"87":1560.0,"88":1561.0,"89":1566.0,"90":1569.0,"91":1570.0,"92":1571.0,"93":1572.0,"94":1576.0,"95":1577.0,"96":1587.0,"97":1588.0,"98":1589.0,"99":1590.0,"100":1591.0,"101":1592.0,"102":1593.0,"103":1622.0,"104":1623.0,"105":1624.0,"106":1625.0,"107":1626.0,"108":1627.0,"109":1630.0,"110":1631.0,"111":1632.0,"112":1633.0,"113":1634.0,"114":1635.0,"115":1636.0,"116":1637.0,"117":1640.0,"118":1641.0,"119":1644.0,"120":1645.0,"121":1663.0,"122":1664.0,"123":1665.0,"124":1666.0,"125":1678.0,"126":1681.0,"127":1720.0,"128":1721.0,"129":1722.0,"130":1723.0,"131":1724.0},"Entry":{"0":" \n\n","1":"\n\nMiserable day drizzling rain. the Black Prince went to the barracks & inspected same then came to II ours Sgt Majs & played up about same it was a regular picnic. his display of yelling the only thing that keeps us alive or rather up to dick. We have been strafed inasmuch that our lights have been cut off for 3 nights. \n\nGermans hoisted the red white & black flag today. persistent rumours about an armistice on the whole Russian front. ? we will soon see. also \n","2":"\n\nRaining of & on during the day Plenty of talk in German papers Re Russian armistice. I really think things will turn out trumps for the Allies (ours).\n\nGermans claims of the Cambri Battle up to the 7 inst to have taken 9000 Pris British 175 machine guns & 60 F. guns. there must be heavy fighting there.\n","3":"\n\nBlanket parade today laugh at some of same & a damn disgrace it is to see them. We were warned to treat all Germans issue with utmost care what have we got from them? letter from Mr Griffiths dated 1\/9\/17 also one not mine overcast day. but nippy.\n","4":"\n\nOn roll call we were told to put all our belongings out in the square by 9 oclock. Bags of sentrys. What a bustle. each company was marched out of compound & severely searched for well I suppose money etc. Laugh. it took until 12 oclock we we sent in by 10 tens & got our bowls & spoon. went for soup we had our kits searched they were finished at 6 oclock in the dark. it was a sharp day very cold on the feet. Donald with wood. I got a severe doing also. Plenty of German bread about.\n\nThe Russian business from one cane read between the lines it appears the Germans have sold another monkey. Another air raid over London 25 planes the damage done not know 6 people killed 2 planes brought down with crew of 3 each. Lights on again tonight. All the same workings\n","5":"\n\nBitterly cold this morning Boys in packet office had 1 brush up with the Commandant\n\nabout emptying fire barrel. they would not do it. told them to get men from the larger. Stopped bread issue (ours from Berne) but it was issued this afternoon.\n","6":"\n\nRaining again all day. no news\n","7":"\n\nThe Boss gave us a nice speech through the interpreter this morning. in future the man responsible for his bed (so that will be better). he will be straffed if \nthis\n his bed is not up to the mark.\n","8":"\n\nNews of Russia is still conflicting. Jerusalem has fallen & German east Africa is about mopped up. Great talk about exchange again three boat loads of German exchange pris to leave on 27\/12\/17 our boys are wondering when they will go to Holland\n","9":"\n\nNews of Buchanans speech to Russian news reporters splendid\n","10":"\n\nanother blanket parade today not long. German Chief of Police shot from behind the Germans\n\nsay they have reason to believe that pris of war did the trick (in E Prussia)\n\nblanket parade again\n","11":"\n\nBeautiful day just a bit nippy\n","12":"\n\nGlorious sunrise today crimson colour to a ball of fire or honey all the rest of sky was black, strange day. Books today\n","13":"\n\nHellish cold last night & this morning brought forth on of the sharpest frost I have hit (well it seemed to me so. cold all day. parade with bed tick, bolster it was cold. stand. Letter from James Coombs\n","14":"\n\nVery heavy or rather sharp frost a beauty\n","15":"\n\nJack Frost still with us all the fences & trees are white as can be & fog came over this afternoon & made it somewhat warmer\n","16":"\n\nBeautiful day\n","17":" Trying to snow today damn cold with it. We are to get for Xmas eve 1 pint \n\nof punch from the Commandant\n","18":"\n\nSnow again but only light wind blowing rather heavy we are allowed lights until 12 oclock tonight packet all day yesterday tins today last the first of the NCO were taken away to Soltau Central for Holland they were given 1 hours notice to pack up what excitement it caused here some of the old pris could not keep themselves in control. quite jubilant no wonder being penned up for 3 years. 8 went at 1 oclock this afternoon 18 at 5 PM. concert tonight extension of lights.\n","19":"\n\nChristmas day spuds & cabbage for dinner German Church service this evening\n","20":"\n\nBoxing day snowing like yesterday all day. we had extension of lights last night & \ntonight\n\n26\/12\/17\n\nuntil 12 oclock plenty of fun amongst ourselves\n","21":"\n\nSnow again today not nice it was very cold all day\n","22":"\n\nIt is hard to walk around the compound because of the frozen snow. The boys sliding on the ice\n","23":"\n\nNothing to note the ice still in all water holes\n","24":"\n\nThe old Wabbler & young on leave the Q Master is in charge. a beauty he is watchmaker would stop until one out paraded three times today hellish cold\n","25":"\n\nMore left for holland exchange today.\n","26":"\n\nMidnight service last night still cold Boys throw bucket of water on the ground & have made a fine slide they were at it all day 80 more men for holland\n\n1\/1\/18\n\nNews of peace conference our people will not attend same raid by our people over the Germans say unfortified town but they claim to have brought one machine down. They say in report that the English are barbarians because they did it, beautiful words they used about us. (RC made go to Church)\n","27":"\n\nStill freezing the boys have made a slide (ice) plenty of spills plenty of peace talk in German papers\n","28":"\n\nMore snow today but not for long. made the slide very slippery. very cold\n","29":"\n\nThe Lads added some water on the place where they slide last night & it was frozen this morning & a beauty she is I had a go & slid on Bingy Back in fact all way by on my feet\n","30":"\n\nNo bath again today 5\/ weeks\n\nsince we had an official one. Good news from \nPalestine\n Jerusalem General Allanby reports the Turks with German Reinf. attack but lost more ground as he attacked their flank went back four mile\n","31":"\n\nNothing of interest today other than the usual speech by young Wabbler about potato \nspe sp\n peelers wasting spuds when peeling same.\n","32":"\n\nBoys still sliding a treat I had another go but still fall over. I was knocked up afterwards one is not well by anymeans. little snow today. Still peace talk in papers.\n","33":"\n\nHeavy snow fall last night or early this morning. Boys using the shovel on it to removed same on to moor outside.\n\n8\/1\/18\n\nSpandish embassy here today in interest of the French not to see us\n\nHeavy snow Packets overcoats\n","34":"\n\nHeavy snow again this morning. shovelled up again Letter & Xmas card from Coombs card from Mrs & letter from Mother Flo & dated 21\/9\/17\n","35":"\n\nAnother heavy snow fall last night & continued all day.\n","36":"\n\nRain last night very strong wind with same Hellish cold this morning on parade we were kept for fully ½ hour Heavy snow storm about dinner time it did fall some had to wait quite a while for tin stuff beautiful game. sun came out for a few minutes this afternoon \nsnow\n it was freezing at one time & then thawing\n","37":"\n\nPlenty of snow again\n\n12\/1\/18\n\nSnowing again with plenty of wind to make it more pleasant All the boys out\n\n14\/1\/18\n\nto Schneverdingen to draw packets one party went of 20 for each wagon 3 in number Hell of a drop snow 1 foot deep back at 8 oclock\n","38":"\n\n14 men for Holland I went for a walk to station Beautiful to see snow sun out but not strong\n","39":"\n\nSnow again today bally wind\n","40":"\n\nI struck trouble 3 days in cells\n","41":"\n\nI came out of arrest 2 oclock today had dinner all camp went for packets carried same hell of a walk\n\nwe could not take wagons as they were too troublesome very tired \n\nno lights tonight no coal heds snow balled us.\n","42":"\n\nLetters dated 26\/8\/17 & 4\/9\/17 from mother one from Major 11\/9\/17 also Abel 22\/11\/17\n","43":"\n\nBeautiful day sun out thaw set in ground drying\n","44":"\n\nBeautiful day sun shining though very weak. another good tune by the (Boss old). \n","45":"\n\nGrand night last moonshine just like being by the sea side summer time. had a good walk the best for quite a while of course Schneverding does not count\n","46":"\n\nBeautiful day for this time of year no fun of late\n","47":"\n\nLast night a real summer one moonlight. another grand days news of Dardanelles naval scrap we our\n\npeople go the best end of the stick. news of trouble in Australia strike. also of Manchester ?\n","48":"\n\nGrand day again nothing to note otherwise \n","49":"\n\nBeautiful day again moonlight Last (L. Lillie) – footbal days ?\n","50":"\n\nKaiser birthday today Flag flying Fine day\n","51":"\n\nEletric light last night but not this morning. Heavy frost. grand day\n","52":"\n\nHeavy frost today. beautiful day.\n","53":"\n\nnews of big strike in Berlin rumour 250000 out. Roumania sticking into Russian. Heavy frost again fine day. Goebun refloated in the Dards German\n","54":"\n\nreport on strike Laughable so many per cent is quoted from different factories\n\n1\/2\/18\n\nVery sharp frost, plenty of excitement re the Empire strike as it is called in German. It is spreading from what we hear here\n","55":"\n\nLetters (2) Mother one from Strike still spreading which is the best news we have had for many a day they it appears the work people struck for more bread equal rights Polically & socially a peace with no annexion. it appears now to have turned into a polically channell.\n\nRussia as decided to throw in again with her allies heavy frost again today\n","56":"\n\nSharp frost again no sun today \nLetter from Lillie\n\nIce cream vendors making a move again in Italy a good affair from reports\n","57":"\n\nThe strikers are making a name for themselves turning tramcars over breaking windows etc. reports say half grown Boys are causing the trouble splendid news all around for us about same. (in & out) ? more for Holland today\n","58":"\n\nHad the tired feeling as regards writing G. Mc G. complaining about treatment of G. P in R. Laugh Schneverdingen three time this last week. strike supposed to have finished to paper surprises in Berlin\n","59":"\n\nLetters from Mother dated","60":" Dad","61":" Edie card Ashton card & letter\n","62":"\n\n at Schneverdengin Sgt & one of our Boys Bath today\n","63":"\n\nRaining today flea inspection (Boss promoted \n","64":"\n\nRaining nothing to note plenty of fleas\n","65":"\n\nStill raining off & on News of German at peace with Ucrean of Russia promises of more food to the public. no news of the strike movement.\n","66":"\n\nStill raining & the fleas worse fire parade to this afternoon no news of any description\n","67":"\n\nNothing of interest today\n","68":"\n\nLetter from dear old Nellie Farrell. Jack Aston card from Mother Xmas.\n","69":"\n\nVery sharp frost again to day & beautiful walk\n","70":"\n\nSharp frost again today sharp all night\n","71":"\n\nPlenty of rain the last three days & sleet\n","72":"\n\nStill raining of & on bust up in the British house of Parliment. Lloyd George Bonar Law. & Col. & morning post about Versays Conference high treason General mix up in & Russia. Aspargus cutting\n","73":"\n\nSchnevn today Raining hell of a trip. name for callers\n","74":"\n\nLetter from Fred card dated","75":" rcd 10\/- sent from R.C. S. not received yet. \nGeneral\n General visit\n","76":"\n\nFrench & English escaped did not know until this morning we had a to for a while this morning\n","77":"\n\nRaining again\n","78":"\n\nRaining\n","79":"\n\nSharp frost today\n","80":"\n\nMiss (letter) )\n\nraining (letter Coombs) 5\/1\/18\n","81":"\n\nSharp frost again Schneverdingen\n","82":"\n\nSharp frost this morn beautiful afternoon & evening\n\n(just lately peace with Russia)\n","83":"\n\nFair weather of late rather sharp at morn. our packet are given to us now with the exception of tins which we drawn\n","84":"\n\nLetter from Jim","85":" ()\n","86":"\n\nSchnever today & party for Holland French W.\n","87":"\n\nQuite a number off to Holland exchange\n","88":" to","89":"\n\nWorked for asparagus farm this morning Three years today since I left sydney\n","90":"\n\nWe left this morning for Hanover the City. raining while pulling the small waggon. we arrived at the central station at 7 oclock the changed trains to go a few miles out of town then we were driven through the city but it was dark . from what we could see it is a beautiful city in the parts of same\n\nwe arrived at our new home which was to be at 8.30 PM it is simply a or working larger \nno\n","91":"\n\nNo work this morning but started this afternoon spade work building up parapets or rather mounds for aspargus\n","92":"\n\nthe hours of work rise at 5 AM work at 6 AM. till 8.30. 8.30 till 9 coffee. 9 till 12 work. 12 till 1 dinner 1 till 3 work. 3 till 3.20 coffee 4 till 6 work. to long for the purpose we left Grossenvedermoor. will complain as the hours of work which\n\nwere not what we were told so we were sent into lager for two days & then back to old camp 23036 what a fine reception we received from the Q. Master F.W. & beautiful it was. made go to Schneverdingen for our kits. we struck a snow storm coming back which made matters worse. We to O. & I were made go into II B to sleep with Sgt laugh the good time we were here \n","93":" \/ 26\/18\n\nnothing of note here plenty of lies about the war\n","94":"\n\nPlenty of news about the German offensive it simply staggered me to think they could advance the distance they did in 8 days but they must have suffered for it in casualties of course we only hear of their side of the whole affair. received money order dated","95":" today\n\nfor 11 marks eleven\n","96":"\n\nFun this morning re Sgt Maj being detailed for Schnever. Letter from Mother dated","97":"\n","98":"\n\nNothing of note today\n\nKits at Schneverdingen\n","99":"\n\nFleas are more than numerous\n","100":"\n\nI have yes\n Year today since being captured\n","101":"\n\nNothing doing news of German push at \nArmenteer\n Armonenters 6000 Pris & 100 guns\n","102":"\n\nNo further news of yesterdays report. War. German Chancellor says they will drive the English out of France (When E H.\n\nI have had the tired feeling for close on","103":" a month fed up. German stopped on the old front of 16 they got a good go no doubt\n\nRing collected about three sundays ago a good go about Armentiers another good go there also. \n\nbeautiful weather here of late Grand day today. the village look grand trees nice & green. no letters for some time ","104":" from Mother about a week ago. Xmas card from 31st Militia Miss A V Scott Yarra Glen Vic dated 9\/9\/17 the exchange has started again men with 23 months or about.\n","105":" to 16\/\n\nnothing of note other than beautiful weather.\n","106":"\n\nVery hot. worst hail storm I have ever seen this afternoon. did not last long.\n\n18\/5\/18\n\nNothing doing\n Heap of letters\n\n19\/5\n\nMother letter dated 5\/15\/1\/18 Dads 20\/12\/17 & 5\/1\/18 Uncle Ted 5\/12\/17 Blue 10\/1\/18 from E. Mrs ","107":" ","108":" Letter E. all in a heap.\n","109":"\n\nNothing doing\n","110":"\n\nplenty of roumor rumour about\n\nRussia coming again 300000 B.F.O.ff.\n","111":"\n\nBeautiful storm today no news.\n","112":" to","113":"\n\nBeautiful weather the last 3 days we moved barracks\n","114":"\n\nLetters from Mother dated 10\/3\/18 Dad","115":" ","116":" Abel S.","117":" today grand weather\n","118":"\n\nTired feeling\n","119":"\n\nReceived the exchange rate","120":" Coombs\n","121":"\n\nGreat display today of military rule\n","122":"\n\nRain every day since","123":" plenty of so & so bombast about the war no save terrible roar about it in so & so \n\npaper. \n\nNews of young Ben killed at Bullecourt","124":"\n","125":"\n\nNothing to report between","126":" & above to day I went Soltau camp for eye treatment nothing doing what a beautiful sight see our boys there, camp filthy stopped \n","127":"\n\nAsked to be sent back to old camp wish complied with back again today\n","128":"\n","129":"\n\nwent to Schnev to see M.O. there about plenty of rain. news of our people giving the others a good go about the S.\n","130":"\n\n from A.R.C. through Coombs. also usual 3\/6-\n\nDiary fro","131":" was taken of me we having been\n\nsearched by the Germans which was a usual custom of theirs any time of day or night.\n\nA R Compton\n\n"}}