{"Document Name":{"0":"Diary_0094","1":"Diary_0094","2":"Diary_0094","3":"Diary_0094","4":"Diary_0094","5":"Diary_0094","6":"Diary_0094","7":"Diary_0094","8":"Diary_0094","9":"Diary_0094","10":"Diary_0094","11":"Diary_0094","12":"Diary_0094","13":"Diary_0094","14":"Diary_0094","15":"Diary_0094","16":"Diary_0094","17":"Diary_0094","18":"Diary_0094","19":"Diary_0094","20":"Diary_0094","21":"Diary_0094","22":"Diary_0094","23":"Diary_0094","24":"Diary_0094","25":"Diary_0094","26":"Diary_0094","27":"Diary_0094","28":"Diary_0094","29":"Diary_0094","30":"Diary_0094","31":"Diary_0094","32":"Diary_0094","33":"Diary_0094","34":"Diary_0094","35":"Diary_0094","36":"Diary_0094","37":"Diary_0094","38":"Diary_0094","39":"Diary_0094","40":"Diary_0094","41":"Diary_0094","42":"Diary_0094","43":"Diary_0094","44":"Diary_0094","45":"Diary_0094","46":"Diary_0094","47":"Diary_0094","48":"Diary_0094","49":"Diary_0094","50":"Diary_0094","51":"Diary_0094","52":"Diary_0094","53":"Diary_0094","54":"Diary_0094","55":"Diary_0094","56":"Diary_0094","57":"Diary_0094","58":"Diary_0094","59":"Diary_0094","60":"Diary_0094","61":"Diary_0094","62":"Diary_0094","63":"Diary_0094","64":"Diary_0094","65":"Diary_0094","66":"Diary_0094","67":"Diary_0094","68":"Diary_0094","69":"Diary_0094","70":"Diary_0094","71":"Diary_0094","72":"Diary_0094","73":"Diary_0094","74":"Diary_0094","75":"Diary_0094","76":"Diary_0094","77":"Diary_0094","78":"Diary_0094","79":"Diary_0094","80":"Diary_0094","81":"Diary_0094","82":"Diary_0094","83":"Diary_0094","84":"Diary_0094","85":"Diary_0094","86":"Diary_0094","87":"Diary_0094","88":"Diary_0094","89":"Diary_0094","90":"Diary_0094","91":"Diary_0094","92":"Diary_0094","93":"Diary_0094","94":"Diary_0094","95":"Diary_0094","96":"Diary_0094","97":"Diary_0094","98":"Diary_0094","99":"Diary_0094","100":"Diary_0094","101":"Diary_0094","102":"Diary_0094","103":"Diary_0094","104":"Diary_0094","105":"Diary_0094","106":"Diary_0094","107":"Diary_0094","108":"Diary_0094","109":"Diary_0094","110":"Diary_0094","111":"Diary_0094","112":"Diary_0094","113":"Diary_0094","114":"Diary_0094","115":"Diary_0094","116":"Diary_0094","117":"Diary_0094","118":"Diary_0094","119":"Diary_0094","120":"Diary_0094","121":"Diary_0094","122":"Diary_0094","123":"Diary_0094","124":"Diary_0094","125":"Diary_0094","126":"Diary_0094","127":"Diary_0094","128":"Diary_0094"},"Date":{"0":"unknown","1":1219.0,"2":1220.0,"3":1221.0,"4":1222.0,"5":1223.0,"6":1224.0,"7":1225.0,"8":1226.0,"9":1227.0,"10":1228.0,"11":1229.0,"12":1230.0,"13":1279.0,"14":1280.0,"15":1335.0,"16":1336.0,"17":1337.0,"18":1338.0,"19":1339.0,"20":1340.0,"21":1341.0,"22":1342.0,"23":1343.0,"24":1344.0,"25":1345.0,"26":1347.0,"27":1353.0,"28":1354.0,"29":1355.0,"30":1356.0,"31":1357.0,"32":1358.0,"33":1359.0,"34":1360.0,"35":1361.0,"36":1362.0,"37":1363.0,"38":1364.0,"39":1365.0,"40":1366.0,"41":1367.0,"42":1368.0,"43":1369.0,"44":1370.0,"45":1371.0,"46":1372.0,"47":1373.0,"48":1374.0,"49":1375.0,"50":1376.0,"51":1377.0,"52":1378.0,"53":1384.0,"54":1385.0,"55":1386.0,"56":1387.0,"57":1388.0,"58":1389.0,"59":1392.0,"60":1393.0,"61":1394.0,"62":1395.0,"63":1396.0,"64":1397.0,"65":1398.0,"66":1399.0,"67":1400.0,"68":1401.0,"69":1402.0,"70":1403.0,"71":1404.0,"72":1405.0,"73":1406.0,"74":1407.0,"75":1408.0,"76":1409.0,"77":1410.0,"78":1411.0,"79":1412.0,"80":1413.0,"81":1414.0,"82":1415.0,"83":1416.0,"84":1417.0,"85":1418.0,"86":1419.0,"87":1420.0,"88":1421.0,"89":1422.0,"90":1423.0,"91":1424.0,"92":1425.0,"93":1426.0,"94":1427.0,"95":1428.0,"96":1429.0,"97":1430.0,"98":1431.0,"99":1432.0,"100":1433.0,"101":1434.0,"102":1435.0,"103":1436.0,"104":1437.0,"105":1438.0,"106":1439.0,"107":1440.0,"108":1441.0,"109":1442.0,"110":1443.0,"111":1444.0,"112":1445.0,"113":1446.0,"114":1447.0,"115":1448.0,"116":1449.0,"117":1450.0,"118":1451.0,"119":1452.0,"120":1453.0,"121":1454.0,"122":1455.0,"123":1457.0,"124":1458.0,"125":1459.0,"126":1460.0,"127":1461.0,"128":1462.0},"Entry":{"0":"\n\n","1":"\n\nCaptured about 12.30 A.M. our artillery opened after we had called for it about an hour, but to late it was nice to be under our own barrage. of course we were prisoners by the above time in the Germans hands. We had run out of bombs & what a contrast between the supply of the Germans & ours. they had men lined along the trench right from the rear of their lines a splendid way to get same to the front line. re passing say a dozen at a time in a bag. we were taken through the village of Riencourt which was being smashed level with the ground as we passed through men being Blown to pieces of both nationalities awful sight worse I have seen. It is the first time I have seen the real thing as regards the effects of our artillery it did tickle our friends up. ??? we were taken under escort straight away through two small villages a hellish long walk. at last we arrived at our destination, I take it for the night, into a big village it was Ecourt St. Quentin. all \nscrche\n scorched & the Germans for any information etc. in a big court yard. snowing very heavily all the time & we arrived there about 5 oclock. somewhere about eight men were formed up in batches of 100 & marched to a big church near By. we got a piece of Brown bread. a cup of coffee. Boys drinking out of anything which would hold liquid re steel helmets. tin pots etc. it looks as though we will have to sit up all night 895 of us a good number wounded some very Bad. it was a tiled floor. very close in side fires. Women crying from village, full of .\n","2":"\n\nWe put in a rotten night. somebody smashed a door in ? Breakfast this morning about 9 oclock. Bread & coffee. We were put in again in fours & marched through village to a railway siding about 3 miles away We had mounted men as escort. French women crying giving the boys bread in fact anything that they could lay their hand on for them Beautiful morning rather nippy though We waited at this siding for quite 4 hours spending the arrival of a train for us. We were entrained in closed in trucks & started off. we stopped at Cambre for some reason or other ? Big place from all appearances. we disentrained about midnight at a place called Solomes a fair sized town from what one could see snowing. very stiff when walking. marched about 4 miles to a \nchatau\n Chateau. \n","3":"\n\nDrink of coffee. slept in the barn or top floor of the place concrete floor. for breakfast drink of coffee & piece of bread searched again. I had quite a number of private Photo’s taken from me of what use they could be I can never fathom We were formed up again in Btn & counted in the yard formed up again & set sail again for goodness knows where. we were marching until 6 oclock. that is from about 9 oclock hell of a march being as tired etc. French women & children giving the\n\n13\/4\/17\n\nboys bread cups in mortal thing to hold water also. Boys giving their badges away we passed through some fair sized villages. Passed some school children dressed alike all of them The teacher & priest if I remember correctly & the lads took off their hats to us I take it. pityful sight to see the sad look on the inhabitants faces whenever we passed but there was a ready smile for anyone who could speak french to them & say a word or two to encourage them. We arrived at Les Quesnoy where we are to camp for how long remains to be seen. From what one could see it is a big railway centre of we were put into a compound house converted. Bread & soup for tea what a pleasure to be able to lay down again on some straw. 15 in a room,\n","4":"\n\nusual\n Parade this morning for counting purposes. The for a wash & clothes to be fumigated. factory converted into such. well arranged. just across the road from compound. usual meals. today miday & evening count Parade\n","5":"\n\nIt was given out on parade for those who think they are not wel enough to work to fall out. about 50 of us did so & were marched through the town. \n\nvery old one from the looks of same into a\n\n15.4.17\n\nbarrack where German troops were stationed & inspected by M. Officer very smart one by the way he handled the men. We waited among the soldiers in waiting our turn to see him. One of our chaps could speak German? We went back to the compound & were told to be ready to move any time by an interpreter as we were going to Deutchland. (50 of us) usual soup coffee Bread in that order today. very cold here\n","6":"\n\nParade as usual this morning Party warned to be ready at 10 oclock for our train journey we started off with our belonging for a side about 1 mile or so away where we waited quite a while. We were asked where the black Aust. were. we had our Photos taken. (We have had them taken quite a number of times to date) 20 of us were lucky we got a third class carriage we entrained about 2 oclock for where in particular we do not know. Travelling very slow. from the following date till we arrived at our Destination cannot remember dates as we passed through different places. Mons, Brussells, Dusselldorf etc. we arrived at Minden station & disentrained \nfell in\n midnight & fell in marched off to the Gefangenenlager. snowing heavily again what a grueling walk to same\n","7":"\n\nWe arrived at camp above about 3 oclock straight into barracks & had a bit of a sleep which was beautiful after 3 days train journey. scenery was grand also the crops that were up at the time. Breakfast bread & coffee another bath & fumigation for us. My watch in fact everything went through same rather unlucky but from all appearances it did no harm after Bath those who did not have overcoats etc got issued with same, clogs Bowls etc dinner soup. Tea soup of some description very cold here but we have a couple of big stove arrangements burning merrily.\n","8":"\n\nWe were transferred to the N.C.O. block this afternoon about 5 oclock I had a beard on since the","9":" I looked pretty what few of us some 4 got a good reception best of all a fine tuck in in the good food line There is another Australian Sgt Maj Newman to wit, very flash from all appearances. 30 odd Sgt Maj here of all English regiments. some Canadian & S Africans All appearances a good\n","10":"\n\nsleep from the overcoats I have had lent to me besides my two (blankets German issue) stopped here at Minden until","11":" & then packed of to Dulmen down south about 100 kilos it appears we should have been sent there first instead of the above place Quite a decent trip to Dulmen. agriculture country enroute. We arrived at Dulmen about 9 oclock after travelling about \n12\n 9 hours. different camp altogether.\n","12":"\n\nanother bath today We stopped in this camp for about 6 weeks. rough time. we left Dulmen for Minden","13":" horrible trip back again passed through Munster Dusseldorf big cities. We arrived there at 1 oclock to night after 13 hours in the train Good feed when we got \nthere\n here. \n","14":" -11.6.17 N\n\nNews about the Messines stunt Back in the old camp again at last. Two parcels today the first usual camp routine here a walk one a week all sorts of\n\nrumours about the war here. laugh for a week about them. Letter from Bank 6 Btn. \n","15":"\n\nNews about the Russian advances & then the retirement. daily reports about the fighting. hellish dust storm here of late never seen anything like it\n","16":"\n\nSports today Bank Holiday News re exchange of Prisoners 1914 men also 18 \nmoths\n months. Beautiful days\n","17":"\n\nConcert last night. very hot today\n","18":"\n\nSports again today. Band performance last night.\n\nBand programme this evening very good. News about Flanders Battle \n\nstill plenty of rumours afloat. really keeps one alive.\n","19":"\n\nRaining very heavily today\n","20":"\n\nRain again\n","21":"\n\nGlorious day. walk this afternoon out of camp around the surrounding district. apples.\n","22":"\n\nRain again today\n","23":"\n\nBeautiful day. very close later on in the day 11000 A by I 2000 by \n\nRu Russian turn again so the tale goes trouble in Hanover Flag game chap ran across field of play\n","24":"\n\nlaugh humourous\n\nBetween","25":" &","26":" I have had the tired feeling there has been nothing of interest in this outfit other than a rumoured move. \n\n16.29\/8\/17\n\nnews about the Flanders stunt & plenty of talk about same (critisism)\n","27":"\n\nDust storm again\n","28":"\n\nVery hot today. gets very hot \nbefore\n about 7 oclock\n","29":"\n\nWindy & hot today. we went out for a walk this afternoon needless to say we perspired some during the walk. Nice & fresh now & again enroute. apples. galore. \n","30":"\n\nRumours of a move it is for sure this time? I wonder. dirty day today. Splendid war news from Italian & French front.\n","31":"\n\nAnnounced that we are to be ready to move sunday next or monday \nrain today\n of course the packing of kits are in full swing. \n\n 2 pair of sox or \n","32":"\n\nGerman equivalent. Parades Galore today counted about a dozen times. we are to move off tomorrow morning at 6 oclock Revillie at 2.30 AM \n","33":"\n\nwe fell in at 4 oclock pitch dark left camp 6 AM march\n\nto station rather solid great sight lumber etc entrained on trucks closed in with windows off to Soltau. Hannover. Forest English. beautiful agricultural district of the valley of Minden quite a contrast between Hanover uneventful trip passed through a big town. Soltau we arrived at 5 oclock right up to camp little walk sandy place Blankets issue. disgraceful sight to see how they were rushed Farine for tea. no fires allowed here. rough time from the looks of things\n","34":"\n\nHad a good sleep last night for once not troubled by fleas etc Coffee for breakfast parade this morning Blankets bowl issued again. messed about for quite two hours. \nhuts\n Camp\n\nopen space cleared all around \ncamp\n huts that are divided into 4 parts each holding 125 men. dinner mix up stew Bread issue \ntoday\n this afternoon Lads making fires Germans going dead mad etc. they are a growling crowd. Farine for tea hot water at 7 oclock very cold day. from 52 to 51 hut change New paliase to \nus\n all this afternoon & straw stuff issued also to make bed of we are in beds of 4. letter today.\n","35":"\n\nBelgiums are numerous here & news about Italian French & Englanders doing good work against. Coffee as usual for breakfast. rain this morn Parade also blankets & bowls to many been issued so it seems.\n\nBean stew for dinner & tea. hot water also fun about the fires again today. Drink of German beer from Belgium awful tack.\n","36":"\n\nRain again to day though only for a few hours. German tea for breakfast Bean stew for dinner. Farine for \n\n30\/8\/17\n\nBoys playing football in compound which is very small over the fence the ball used to go & the German sentry in the next compound would chase it. a great joke. Still good news from the icecream (vendors The Italians) also from the Frog Eaters. but no news from the Englanders.\n","37":"\n\nHellish cold last night raining slight. tea again for breakfast fishy stew for dinner. parade this afternoon for bath but were told to dismiss owing to a Blank parade at 8 oclock in the morning but no sooner we arrived back in our huts we were told to fall in again with Blankets Bowls spoon towels etc for inspection. after the usual messing around we got just about settled when the rain came down in a deluge of course it was a stampede to the huts we were not told to fall in again.\n","38":"\n\nThe party 1100 French English & Belgium Today or rather this morning 200 French Sgt went to a commando near Bremen. Bath to day hot one, it was beautiful German sentrys about 30. laugh. rain again very heavy\n","39":"\n\nSunday today very cold again we are getting the best food that I have seen given to Gefangener here of course one would not give it to pigs but there you are. we have all run out of stores not having any packets previous to leaving Minden this afternoon we had issued 1 pickled small cucumber stinking cheese coffee & of course our usual issue of Bread.\n","40":"\n\nLast night we had a concert the British got up at the last minute it was very good Laugh about drummy up requested not to take out of the . rain again today. plenty of rumours about again one about naval battle of course the Germans are supposed to have lost 5 Battleships\n","41":"\n\nFirst thing to greet the eyes this morn was flags all over the camp Germans supposed to have taken Riga in Russia\n\n4\/9\/17 cont\n\nGermans say that a telegram came into camp about the fall of Riga but they do not believe it. said I expect they want another war loan. Bread issue raised to day from 6 ½ to loaf to 5 ¼ per loaf the difference is hardly noticable. We are off to another camp tomorrow at noon. Where to? \n\n5\/9\/17\n\n4\/9\/17\n\nWe left Soltau camp 54 Sgt Maj for new camp about 2 oclock. we marched about 2 kilometres to railway station. some unpronounceable name. all civilians people moved out of carriage for us. we arrived at Schevningen about 9 kilometres train journey. Moor ground all around we marched to new camp 6 kils. hell of a walk cobble stones road arrived 6 oclock wait long time for officer to inspect us not allowed to take our belongings with us. \nroar\n beauty. slept in barrack by our selves. no tea.\n","42":"\n\nno sleep. inspected today beautiful turnout to be sure. it is a small camp 30 – 36 food awful. coffee for B. dinner sourc crou. hot water for tea. Bread issue. football match\n","43":"\n\nTwo parade a day. same menu as yesterday all goods moved out of barracks until 4 oclock.\n","44":"\n\nOrchestra gave us a few tunes last evening very nice. strafed about smoking in barracks. very windy today\n","45":"\n\nStrafed again about smoking one chap 3 days cells , no B or bed. Bath this afternoon not to bad. normal cabbage \n","46":"\n\nBoxing last night some good bouts Strafed about some chaps washing their bodies in the open. would be shocked. 20 years birthday today Menu peas spuds & meat.\n","47":" \nto 12\/9\/17 inclusive\n\nNothing of note other than the German ration 10\/9\/17 swede or mangrove \n\ncut into small slices awful muck usual war news all British attacks repulsed.\n","48":"\n\nNothing of note again\n rather cold today Germans down in the mouth over some-thing.\n","49":"\n\nPackets to hand today they are welcome some articles from Miss Dwane soap cigarettes chewing gum. sourcrou.\n","50":"\n\nLetter mail in last night but did not receive any. News about 7th German war loan confiscating all statues etc \nif\n any all bank money if people will not pay into same. that is what was read out to us by our English interpreter. swede again for dinner. usual daily routine other wise. football this afternoon. raining slightly during the day.\n","51":"\n\nBitterly cold driving wind with occasional rain showers cabbage & few spuds for dinner usual routine in tucker line otherwise.\n","52":"\n","53":"\n\nToday being the 6 day I have missed writing up this diary I guess it is about time I did so. Raining all day saturday likewise sunday windy on mondy in fact it has been (weather) rather boisterous up too today. we have had two football matches during the week. my hat a Commandant beautiful. \n\nWe have had no news of any sort as regards the war other than a copy of Hindenburg speech to the German people it is laughable about rich people having to much to eat & hiding gold etc. pleads to the masses to pull together & they will win the war within 6 month rumoured about Crowevski being made President of the Russian Republic. usual tucker line during the \nabov\n\naforesaid days. Commandant away for it is said 14 days base quite a lone without him. Men having to pay for their tin meats etc from Hanover Sands to Gross what beautiful people these are the General there promised them that same would be sent on free of charge now they have to pay for it. if not same will be distributed among prisoners at that camp. Will it?\n\nGeneral visited empty stomach Germans\n","54":"\n\nRain today. usual rumours about the wear. plenty of rot published by the German press about they are winning. One would not say so by the looks of things in \nthis\n & around this country they are just on the verge of collapse news about English bombardment in Flanders Cabbage for dinner\n","55":"\n\nusual barracks very cold today. news of British attack in which the Germans says that our people advanced 1 kilometre in one place. all other attacks they repulsed of course one knows all about that\n","56":"\n\nBeautiful day. nothing of interest other than that we are to have a football match today. \nyesterday\n potatoes & peas today & yesterday\n\nFootball match took place but was stopped on account of so many men stopping in camp. We had read out to us that a Russian was shot for try to escape also one for murder & one English shot for trying to escape. Football match will be continued \ntoday\n tomorrow on these conditions all go out or all stop in.\n","57":"\n\nClose day. no wind at all Zeppelin flew past our camp today it was miles away but it was quite distinct. could see the gondola swung under. \n\nFootball match took place fine game considering. Turnips & spuds for dinner.\n","58":"\n\nNothing of interest. beautiful day Tired feeling today usual occourance\n\n28\/917\n\nBeautiful day German aeroplane landed near camp laugh at the saying of our boys when he accended again News about aeroplane & zepp raids over London serious affair from English reports. Trouble about arbeit here to day 10 N.C.O. refused to work stilly stand with coats off etc\n","59":"\n\nN.C.O. still stand still but they had to give in, might just as well hit a brick wall.\n\nAust R.S.M. not reckonised nice affair through making complaint by letter to War Minister of Germany nice how do do. German General in camp to day complained to him with same result. there look like trouble brewing here\n","60":"\n\nGlorious day. just nice & nippy let one know that he is alive nothing of interest other than the usual German bombast\n","61":"\n\nabout the fighting\n","62":"\n\nHellish cold today. after the heavy mist or fog. \nit was\n after dinner the sun appeared. Dinner mangroves. football match today. Beautiful sunset. Ball of fire with two streaks of cloud across same at equal intervals of course that was only momentary\n","63":"\n\nBig letter mail yesterday I did not receive one single line. The trouble about N.C.O working they did one day at the job but were not sent there again\n\ntheir parcels are stopped & they are on fatigue every day indefinite period. No news war but strong rumours about Reichtag meeting which has broken into three distinct parties. also about peace demonstration at Frankfurt on Maine & another big town.\n","64":"\n\nNothing of interest other than thunder storm a few chaps sent for from Soltau for Swiss Board for exchanges Big mail today not a card even.\n","65":"\n\nThe storm of yesterday turned into a dandy storm with a few showers. it did blow a real bonzer. Very very cold today a driving wind with same. news about\n\n4\/10\/17\n\nFour or five aeroplane raids over London during the last few days. The boys here are swearing about \nit not\nsame. Really laughable to hear the sayings.\n","66":"\n\nAnother cold snap today a regular beauty it is. Electric light put into use at last. the first time that any light other than lights made of dripping.\n\nquestioned by the German interpreter\n","67":"\n\nJust like a promenade walking about behind the barbed wire with electric lights War news read out last night things are going well for us (Allies)\n\nTwo letters from Jim Coombs dated 1\/7\/17 22\/8\/17 one from Fred & Ryan\n","68":"\n\nCold again cuts one through. News of reprisals on Germans with aeroplanes which have been carried out\n\n7\/10\/17\n\nvery amusing to hear the Germans reports upon same. German report on General Maude giving the Turks a good toweling up in Mesopotamia 3000 unwounded 14 guns 200 camels also Aust. & Americans having a battle in France\n","69":"\n\nGerman Minister gave us a service today he was ordained in Liverpool Eng not a bad service. he held Communion Service afterwards. raining like the so & so all day. usual dinner today peas blood meat & peas.\n","70":"\n\nRain again today news of big battle in Flanders full details not to hand yet. We were paraded today & classed in to \ndifferent cou\n the countries we were born the reason we cannot understand\n","71":"\n\nVery sharp (the weather) rain showers off & on news to hand about revolution movement in the German army &\n\nnavy. It was given out in a speech by the German Chancellor in the Reich Stag & the demand him to prove it & some men of high office have been arrested as having spread the trouble\n","72":"\n\nRaining off & on all day news of Russian’s having minor succes 700 prisoners. got the tired feeling. news of German motor-boat in Sydney Harbour\n","73":"\n\nBitterly cold weather Reichstag trouble not over yet. sitting should have closed today but the session work will be finished before the house closes\n","74":"\n\nCold again. news of Aust troops doing another stunt in Flanders also about Reichstag having finished their Business & of Edison of USA inventing paint of some descr\n\ncription to make ships indistingushable at a distance Yank are laying 125 to 1 that no Allies ships \nare\n will be sunk. Germans says what a pity their young sailors are not allowed to bet.\n","75":"\n\nRaining again today & cold to accompany same. All Sgs & were asked the Trades Professions etc on parade this morning by the German interpreter. he said that only the truth was wanted Laughable \nabout\n they gave in waiter sanitary man municipal officer music hall artist barber etc another parade called today asked for volunteers for wood cutting in the nearby mountains he said it was a beautiful climate nobody fell out\n","76":"\n\nBeautiful day nice & nippy\n\n15\/10\/17\n\nGermans report 20,000 volunteer army\n\nLetter from Dad today dated 2\/6\/17 news of Mother in same not well Been to Brisbane. Envolope taken off our letters when delivered\n","77":"\n\nMore\n Another beautiful day Roosevelt paying visit to Italy Royal honours More squabbling in Germany. Socialists making a noise. News of von Kipple (Capelle) resigned. also of split in Hungarian Parliament. A German landing on a important island in Gulf of Riga. Russian war minister appeal to Russia saying the hour of trial has come & to make all sacrifices to attain their object. Squirrel on pole.\n","78":"\n\nBeautiful day. Commandan gave us a display of German language\n\n17\/10\/17\n\nnothing of interest doing other than England has stopped cable & telegram messages within Holland\n","79":"\n\nNippy day. braces one up somewhat. Germans take soup powders & ox cubes out of packets & put them in soup issued to us.? Fleas troublesome again. \n","80":"\n\nNothing of interest today other than packets arrived. I received the first one for a month today a letter from Mrs Groves dated 18\/5\/17. half of it cut away. Germans did put\ning\n soup powders in soup.\n","81":"\n\nVery\n heavy fog to greet the eyes this morning & did not lift until about 11 oclock. it was cold too standing about. Zeppelin passed in the distance sometimes. football match Monday & Wednesday\n","82":"\n\nAt roll call last night we fell in with german issue Bowls Spoon & wash basin what a fine display well the Commandant he gave us a bit of German culture awful things. The fog is still very heavy\n\n21\/10\/17\n\nAt roll call this morning we had another good turn from the Commandant it was beautiful about burning the german issue bread it was fine Letters given out today but I received none. War news read out last night Bollinley (?) paid a visit to the western front saw Haig & he is reported to have said he expect to finish this affair before Xmas. which year was not stated Russians by the report read out are getting a severe hiding Both on land & sea (G of Riga) The trouble with Holland & Britain seen acute Church service tonight\n","83":"\n\nMisty day with a few very light showers of rain. Money orders arrived today I was not mentioned I have had £ 1.10.0 per month starting from July & not received a penny up to date. Rumours of a\n\n22\/10\/17\n\npeace conference 27th this month, it is supposed to have been said by a German in this camp to one of the English arbuters & supposed to be a reliable fellow. War news tonight the Germans report of having landed on Dago Island also one of their Submarines sinking 16 ships in all 1 destroyer two cruisers 1 Yankee ship & a number of fishing smacks Their 7th war loan supposed to have reached 650 millions pounds sterling.\n","84":"\n\nMuggy\n cold day with few showers of & on. The weather looks as though we are on for a good deal of rain. War news on Russain getting a rough go in the Gulf of Riga. News of Zepp raid over England. Manchester Brum. Bristol London Notts etc good deal of damage done about 50 killed. They it appears struck a strong storm on their return journey & were put out\n\n23\/10\/17\n\nof their course & four were brought down in France so the Germans say & one is still missing. there is some argument as to where the other is.\n\nRussian arbuters & Socialists are supposed to have had a meeting on peace terms one would laugh for a month to hear about them.\n","85":"\n\nWe were given stand stilly for 1 hour the whole camp because the Black prince said we were late on parade also for one chap who got three days strong arrest for not standing to the wabblers (?) liking. he did have a a beautiful example of German kultur. it was bitterly cold. News of the 5 Zepp it appears to have landed in France some of the crew go off & she floated away & landed\n\nin Switzerland & the 4 men in same frozen to death. towards evening the wind was up to hurricane force. Ballon passed today.\n","86":"\n\nThe wabbler still has a good liver we say when he is like this that there is good news for us a regards the war. Meaning the Germans have got a good dusting up. Report of Russians losing another island in Gulf of Riga. Also the German reports say that the Russian navy is talking about going into Swedish waters to be interned until the end of war & the report goes on that the Swedes will take the boats but not the men as the food problem is serious in Sweden. Also of the Russian Navy commander being captured. The German always seem to be able & do make a good show when the public are uneasy. this is another one of the dramatic moves to gall them.\n","87":"\n 25\/10\/17\n\nBitterly cold today & the wind blowing very very heavy with rain showers. We got one box of peat to four fires daily. beautiful issue Plenty of gambling going on here amongst the boys Card gambling\n\n26\/10\/17\n\nNo rain today wind blowing now & again during the morning not unpleasant I received £ 1.0.0 32 marks from Jim Coombs through A.C. Coy cannot tell the date of despatch on card. I received 4 food packets today which is more than welcome, after living wholly one German food News to hand about French advance. up to date 7500 Prisoners & considerable Booty. Funny the Germans claimed of having shattered Both English & French\n\n26\/10\/17\n\nattacks the last week. lies again. Teeth attended.\n","88":"\n\nBeautiful day on the fresh side. Bath today we have a hot one twice a month. News to hand of Russian fleet giving the Germans feet a good toweling \n\n6 Destroyers 2 Battleships 1 trans in all with damaged 12. which needless to say is welcome news also other sundry news of that seat of war. French attack mentioned yesterday both Pris & Booty increased. 3 Staffs captured. German. & news of reinforced Austrian by Germans & Artillery giving the ice cream vendors a nasty defeat where they have broken through to date 10000 prisoners Italians\n","89":"\n\nGlorious day no wind sunshine just nippy. Letters today I did not receive any. Camp orchestra gave us a good programme today this afternoon Farewell Gadiators Viscount Nelson Bonnie Doon\n\n28\/10\/17\n\n& a few more that I do not know the name of. had two teeth filled today. German flag flown today must have had a victory some where it is rumoured that they have captured 30 000 Italians that is including yesterday total & 300 guns - Cook escaped\n","90":"\n\nBeautiful night last moonlight & just a bit nippy. But what a day today rain & wind from the N West a very rough day. Church last night Orchestra gave us a good programme yesterday afternoon. The report of yesterday is German the Italian report says they left the army to its fate but there is no mention by them that they are captured\n","91":"\n\nAnother fine day makes one feel alive which I must say one wants in this dismal hole. Plenty of rumour of Italian stunt by German it is now\n\n30\/10\/17\n\nreached 100,000, 700 guns. news of German retirement to Riga district to land. They (Germans) must have moved their forces from there for the Italian stunt. Fleas are troublesome again. The cook who escaped has been recaptured at Bremen. he travelled as a wounded soldier.\n","92":"\n\nBeautiful night last. Glorious day. The German reports on the Italian stunt are rather tall I think compared with the Italian report. Germans still retiring on Riga front.\n","93":"\n\nBeautiful night last but mist has hung about all day today We were asked to volunteer for work again which would be a benefit to us & the United Kingdom after the war we would taught same. Nothing startling to report other wise. Germans flag flying again today.\n","94":"\n\nBeautiful day Letters today I received three. No war news to hand Flag flying again\n","95":"\n\nMuggy day. Italian a getting a good dusting up from all reports of the Germans 180,000 Pris. & 1500 guns ? what sort Gas issued out for the Ice Cream vendors they must have got a good issue from the Germans. No reports from the Organ Grinders up to date other than they left their 2nd army & the remainder are retiring in good order. Received money from officer in stamps\n","96":"\n\nSun shine again today though no warmth in same. Letters again today received none again Signed reply about money being sent to me. it appears that it was sent to Dulmen, no reply to my\n\n4\/11\/17\n\nquestions. news of Italian stunt to hand by Italians whom claim to have retired in good order quite contary to the Germans version of same. Germans claim 200,000 Pris 1800 Guns? the advance have stopped it appears at. In the E channel the British claim to have sunk one Aux cruiser & 2 fishing smack German, with food stuffs abord no mention in German report. Germans still retiring in Riga front. It seems by the stunts the Germans are doing that they are a travelling Curcis shifting troops from one front to another Frog eaters advanced 15 kilometers in Flanders. During the month of Oct. British claim to have taken 9000 Pris \n40 guns\n a number of guns 40 T mortars more air raids on London 6 different Squadrons in all 30 machine reports of English say little or no damage?\n","97":"\n\nNothing of interest today mild weather\n","98":"\n\nLetters\n very nippy today no \nnews or interest here\n today\n","99":"\n\nsomebody burnt a broom hell of a row about what will be done to the doer of that action Laugh\n\n7\/11\/17\n\nLetters today no luck Raining all day sopping wet to wait to draw tins. Germans have forced so they said the River La Meta in Italy. they are booming up things there. News of L George General Robertson USA & French General having arrived at Rome. News of the French Report that 200 guns 220 mortars 700 m. guns Germans say that the guns etc were left because they were of no use to them ?\n","100":"\n\nShower of rain off & on during today rather cold too. Carboard off our packets etc carted away to the station Germans using it again\n","101":"\n\nRaining all day nothing interest to note.\n","102":"\n\nOvercast day. no rain during the morning. The afternoon was beautiful a real November one. The morning the Black Prince of gave us a good display of his temper it was beautiful about boxes not being taken.\n\nWar news on Western front all OK usual advances Mascottaria 240 officers 2000 odd men Turks taken pris by our people. Conflicting reports about Russian asking for peace. all lies as per usual We expect ice cream vendors still going back. In Italy we expect a big reverse to the Germans any day now\n","103":"\n\nBeautiful day four letters today one from REP Section Jim B Day. Board Eduecate 6 books are to be forwarded to Sgt Roberson 16th Bat AIF\n","104":"\n\nMist all day of course cold nothing of note\n","105":"\n\nRain again nothing of interest other than the ever flowing conflicting news of the doings of the Russian revolusi\nti\nonists. supposed to be in prison\n\nWe will not suffer running in the camp for water\n","106":"\n\nMist about all day very cold in fact it looked \nlike\n as though it was going to snow\n","107":"\n\nthe wabbler Commandant gave us a good speech it was a dandy about our beds. Good news in general about Russian C. has smashed McMillean party so the German report goes. All Russian is reported to have joined hands again. Lloyd George said in speech that the only address re peace terms is London The ice cream vendors it is reported to have given the sausage eaters a bit of a dust up in Italy. Reported that England threatened Holland by landing troops over gravel affair. News of exchange, old hand are jublian about same it is one of many reports to hand. Round about Palestine the Englanders are reported to have given the unspeakables a good hiding 10000 odd pris, war material. Also news of German West Africa\n","108":"\n\nstunt about on it last legs rounded up a few of the heads\n","109":"\n\nRaining all day nothing of interest other than as speech by the interpreter about washing in barracks etc.\n","110":"\n\nWe have had to side shows within the last 4 days it is quite a treat. Poor old Sgt Mgers all the time","111":" the wabblers came in to find the bread burning but missed it laugh a close go. Sg broke away from waggon party got 3 days cells quite a pantomine on the evidence. Splendid news to day from ice cream vendors. Russians told straight to carry on or to have a boycott for 10 years by the allies & have the Japanese at them\n","112":"\n\nnews of a battle near Heligoland nothing definite\n","113":"\n\nRaining since the night of","114":" of & on The ice cream vendors by the reports are giving the sausage eaters a go for their trouble. Plenty of German talk about General Smuts being a succesor to Lloyd George\n","115":"\n\nTalk about Russian asking for a seperate peace. Bitterly cold today.\n","116":"\n\nRain today of & on. news of British advance upon Cambre. see by reports they have taken at last Reincourt where our Brigade or what was left rather were captured 11\/4\/7\n","117":"\n\nLetters today one from none from home. letters handed out on parade\n","118":"\n\nSnow this morning beautiful\n\n26\/11\/17\n\nto see the moor covered also the bush near by huts etc The Russian business seems rather rotten we do not know what to believe about the reports are so conflicting\n","119":"\n\nGeneral Maud dead. More snow this morning only a light fall. rain during the day with a driving wind\n","120":"\n\nRain again today Letter from Mother dated 28\/7\/17. first books from Jim Coombs through red cross. War news good all round except Russia wanting peace so the German papers say Manofesto issued by Russian General to fight on.\n","121":"\n\nMiserable day slight rain all day. Russian affair still the same Germany will give\n\n29\/11\/17\n\npeace if Russia will \nreestabl\n re-establish the monachy. Good news from Palestine way Germans say the B. army there are short of food etc. gun etc they are four kilometres from Palestine it seems a good way to break the news to their \n","122":"\n\nRaining again Germans still giving hot air about Russia. I really think the whole affair is exagerated\n","123":"\n\nSnow today nothing of interest\n","124":"\n\nReischstag opened today Bill said that victory was still within their grasp (Germanys) & that Italy deserved the hiding she got & Emerson caught smoking this evening Young wabbler said he would\n\n2\/12\/17\n\nreport them\n\n2\/12\/17\n\nBitterly cold this morning had to stand out & listen to the display by the Prince at the chaps caught smoking in Barracks beautiful 48 hours light punishment. snow fell about dinner time in as many minutes then rain soon afterwards snow again\n","125":"\n\nLate last night snow fell heavily with a driving wind with it. Bitterly cold when snow stopped but not for long snow was driven just like dust in fact it came in bursts. the snow is about 5 inches thick but in place when wind swept same round about two feet.\n","126":"\n\nGerman report to hand taken 4000 pris 60 guns 100 machine gun from British near Cambria a day or so ago.\n\n4\/12\/17\n\nwhat a beautiful day not a one gust of wind sunshining beautiful snow still firm not with standing the snow. beautiful sight the bush near by absolutely covered with snow. came out of clink .\n","127":"\n\nanother beautiful day sunshine same as yesterday in anything still more sharper. Boys shovelling snow into heaps to cart it away so as when it thaws it will not be trouble in camp. the compound is just like glass through us continually walking around the square Still news of Russia taking of turning the game up. in fact in certain regions the Germans report of one Russian army having got an armistice with them but the remainder of the soldiers remain loyal to the treaty between the \n","128":"\n\nBitterly cold today the beauty having gone from then bush\n\n6\/12\/17\n\nopposite. the bleeding one & streaks of ice which was formed through the washing water. plenty of blisters one cannot walk with safety around this pig sty. beautiful place ?. Letters from Mother dated 10\/8\/17 Dad 11\/8\/17 Mrs Willshire 17\/6\/17 Grace MC 27\/7\/17 Mrs Sheath & red cross very welcome they are too\n\n"}}