{"Document Name":{"0":"Diary_0105","1":"Diary_0105","2":"Diary_0105","3":"Diary_0105","4":"Diary_0105","5":"Diary_0105","6":"Diary_0105","7":"Diary_0105","8":"Diary_0105","9":"Diary_0105","10":"Diary_0105","11":"Diary_0105","12":"Diary_0105","13":"Diary_0105","14":"Diary_0105","15":"Diary_0105","16":"Diary_0105","17":"Diary_0105","18":"Diary_0105","19":"Diary_0105","20":"Diary_0105","21":"Diary_0105","22":"Diary_0105","23":"Diary_0105","24":"Diary_0105","25":"Diary_0105","26":"Diary_0105","27":"Diary_0105","28":"Diary_0105","29":"Diary_0105","30":"Diary_0105","31":"Diary_0105","32":"Diary_0105","33":"Diary_0105","34":"Diary_0105","35":"Diary_0105","36":"Diary_0105","37":"Diary_0105","38":"Diary_0105","39":"Diary_0105","40":"Diary_0105","41":"Diary_0105","42":"Diary_0105","43":"Diary_0105","44":"Diary_0105","45":"Diary_0105","46":"Diary_0105","47":"Diary_0105","48":"Diary_0105","49":"Diary_0105","50":"Diary_0105","51":"Diary_0105","52":"Diary_0105","53":"Diary_0105","54":"Diary_0105","55":"Diary_0105","56":"Diary_0105","57":"Diary_0105","58":"Diary_0105","59":"Diary_0105","60":"Diary_0105","61":"Diary_0105","62":"Diary_0105","63":"Diary_0105","64":"Diary_0105","65":"Diary_0105","66":"Diary_0105","67":"Diary_0105","68":"Diary_0105","69":"Diary_0105","70":"Diary_0105","71":"Diary_0105","72":"Diary_0105","73":"Diary_0105","74":"Diary_0105","75":"Diary_0105","76":"Diary_0105","77":"Diary_0105","78":"Diary_0105","79":"Diary_0105","80":"Diary_0105","81":"Diary_0105","82":"Diary_0105","83":"Diary_0105","84":"Diary_0105","85":"Diary_0105","86":"Diary_0105","87":"Diary_0105","88":"Diary_0105","89":"Diary_0105","90":"Diary_0105","91":"Diary_0105","92":"Diary_0105","93":"Diary_0105","94":"Diary_0105","95":"Diary_0105","96":"Diary_0105","97":"Diary_0105","98":"Diary_0105","99":"Diary_0105","100":"Diary_0105","101":"Diary_0105","102":"Diary_0105","103":"Diary_0105","104":"Diary_0105","105":"Diary_0105","106":"Diary_0105","107":"Diary_0105","108":"Diary_0105","109":"Diary_0105","110":"Diary_0105","111":"Diary_0105","112":"Diary_0105","113":"Diary_0105","114":"Diary_0105","115":"Diary_0105","116":"Diary_0105","117":"Diary_0105","118":"Diary_0105","119":"Diary_0105","120":"Diary_0105","121":"Diary_0105","122":"Diary_0105","123":"Diary_0105","124":"Diary_0105","125":"Diary_0105","126":"Diary_0105","127":"Diary_0105","128":"Diary_0105","129":"Diary_0105","130":"Diary_0105","131":"Diary_0105","132":"Diary_0105","133":"Diary_0105","134":"Diary_0105","135":"Diary_0105","136":"Diary_0105","137":"Diary_0105","138":"Diary_0105","139":"Diary_0105","140":"Diary_0105","141":"Diary_0105","142":"Diary_0105","143":"Diary_0105","144":"Diary_0105","145":"Diary_0105","146":"Diary_0105","147":"Diary_0105","148":"Diary_0105","149":"Diary_0105","150":"Diary_0105","151":"Diary_0105","152":"Diary_0105","153":"Diary_0105","154":"Diary_0105","155":"Diary_0105","156":"Diary_0105","157":"Diary_0105","158":"Diary_0105","159":"Diary_0105","160":"Diary_0105","161":"Diary_0105","162":"Diary_0105","163":"Diary_0105","164":"Diary_0105","165":"Diary_0105","166":"Diary_0105","167":"Diary_0105","168":"Diary_0105","169":"Diary_0105"},"Date":{"0":"unknown","1":1074.0,"2":1075.0,"3":1076.0,"4":1077.0,"5":1078.0,"6":1079.0,"7":1080.0,"8":1081.0,"9":1082.0,"10":1083.0,"11":1085.0,"12":1086.0,"13":1087.0,"14":1088.0,"15":1089.0,"16":1090.0,"17":1091.0,"18":1092.0,"19":1093.0,"20":1094.0,"21":1095.0,"22":1096.0,"23":1097.0,"24":1098.0,"25":1099.0,"26":1100.0,"27":1101.0,"28":1102.0,"29":1103.0,"30":1104.0,"31":1105.0,"32":1106.0,"33":1107.0,"34":1108.0,"35":1109.0,"36":1110.0,"37":1111.0,"38":1112.0,"39":1113.0,"40":1114.0,"41":1116.0,"42":1117.0,"43":1118.0,"44":1119.0,"45":1120.0,"46":1121.0,"47":1122.0,"48":1123.0,"49":1124.0,"50":1125.0,"51":1126.0,"52":1127.0,"53":1128.0,"54":1129.0,"55":1130.0,"56":1131.0,"57":1132.0,"58":1133.0,"59":1134.0,"60":1135.0,"61":1136.0,"62":1137.0,"63":1138.0,"64":1139.0,"65":1140.0,"66":1141.0,"67":1142.0,"68":1143.0,"69":1144.0,"70":1145.0,"71":1146.0,"72":1149.0,"73":1150.0,"74":1151.0,"75":1152.0,"76":1153.0,"77":1154.0,"78":1155.0,"79":1156.0,"80":1157.0,"81":1158.0,"82":1159.0,"83":1160.0,"84":1161.0,"85":1162.0,"86":1163.0,"87":1164.0,"88":1165.0,"89":1166.0,"90":1167.0,"91":1168.0,"92":1169.0,"93":1170.0,"94":1171.0,"95":1172.0,"96":1173.0,"97":1174.0,"98":1178.0,"99":1179.0,"100":1180.0,"101":1181.0,"102":1182.0,"103":1183.0,"104":1184.0,"105":1185.0,"106":1186.0,"107":1187.0,"108":1188.0,"109":1189.0,"110":1190.0,"111":1191.0,"112":1192.0,"113":1193.0,"114":1194.0,"115":1195.0,"116":1196.0,"117":1197.0,"118":1198.0,"119":1199.0,"120":1200.0,"121":1201.0,"122":1202.0,"123":1203.0,"124":1204.0,"125":1205.0,"126":1206.0,"127":1207.0,"128":1208.0,"129":1209.0,"130":1210.0,"131":1211.0,"132":1212.0,"133":1213.0,"134":1214.0,"135":1215.0,"136":1216.0,"137":1217.0,"138":1218.0,"139":1219.0,"140":1220.0,"141":1221.0,"142":1222.0,"143":1223.0,"144":1236.0,"145":1237.0,"146":1238.0,"147":1239.0,"148":1240.0,"149":1241.0,"150":1242.0,"151":1243.0,"152":1244.0,"153":1245.0,"154":1246.0,"155":1247.0,"156":1251.0,"157":1252.0,"158":1253.0,"159":1260.0,"160":1261.0,"161":1262.0,"162":1263.0,"163":1265.0,"164":1266.0,"165":1267.0,"166":1271.0,"167":1272.0,"168":1273.0,"169":1274.0},"Entry":{"0":"\n\n1916\n\n","1":"\n\nWe left Lark Hill at 10.15 to entrain at Amesbury. Each man carried 220 rounds of ammunition, 2 gas Helmets, 1 steel helmet, Haversack, Water bottle, Web Equipment & Pack including a blanket & wore his overcoat. We marched four miles. Weather fine. We are now at Amesbury all on board the train. The signal to move off is about to be given 1.15 p.m.\n\nAt 1.15 our Train left & we drew into S— at 3. At 7.30 the ship left. The Crossing of the Channel was calm and uneventful. We landed at H—at 7 a.m.\n","2":"\n\nAfter a wait of 4 hours on the wharf we left for a rest camp situated out about six miles. The men had very heavy load each exceeding 110 lbs. weight & it told on them heavily but all got into camp. H— is a very fine town with an exceptionally big traffic in the harbour.\n\nThe Camp was very welcome notwithstanding the march. \n\nWe had a meal at a little French Café which was excellent.\n","3":"\n\nLeft camp again at 9 oclock, marched into the Station & entrained. It is now 2 oclock & we leave at 3 for 36 hr. journey. The men are in Cattle trucks each holding about 30 men. This is the first time they have had the experience of Cattle trucks & the comments are amusing.\n\nSpent all day on the Train & all night, travelling very slowly.\n","4":"\n\nStill in the train. The country is not much good and the houses poor. We are travelling up the coast. Passed through Abbeyville, Boulonge & the suburbs of Calais. Arrived at Balieul at 10 p.m. The Trenches are not far away. The flare lights & star shells light up the sky & the Guns can be heard quite distinctly.\n\nThe Batt. set out to walk 6 miles to Billets. The Guides lost them & it was 5 oclock before the men got to Billets. The sacks were very heavy and they were quite exhausted.\n","5":"\n\nWe billeted in Merris. I stayed at the old French priests place. The Town was at one time in the German hands & bears a few marks of the Bombardment. The Church & Convent were hit by shells. A levy of 5,000 francs was made on the Town & the priest Honore Beleyat was held as a hostage to be shot if it was not forthcoming. It was raised. Had hot bath this evening & turned in & slept soundly.\n","6":"\n\nOrders came early this morning to pack up & move to the trenches. Quite unexpected. Motor Transport conveyed us to Armentiers.\n\nWe were from 1 oclock till after dark before we found Billets & had to sleep without blankets on the floor. It was very cold. The Town has normally a populace of about 35,000 including Houplines suburb but there are less than 3,000 in it now. Houses are wrecked. Beautiful Buildings in ruins, Churches in a very bad way. Almost every church is in ruins & many lovely private homes smashed up. Half of our men went into the subsidiary trenches today.\n","7":"\n\nI found Chaplains McLean (Pres.) & Blamues (Meth.) both of New Zealand & had lunch with them & as they are leaving soon have secured their Billet. My kit has gone astray, I have no blankets nor fresh clothes.\n\nFound McCook homeless in town & brought him to our Billets & got a room for him next door.\n","8":"\n\nNo sign of my kit. Went out to trenches today. It is fairly quiet in the lines during the day. In the afternoon they shell fairly heavily & at night the machine guns are rattling all night.\n","9":"\n\nBatt. Hdqts. shifted billets also A & B Coys. Went out to Transport this afternoon to look for my kit but no sign of it.\n\nA Bible Class was held here this evening by N.Z. Chaplains. It was a very fine meeting.\n","10":"\n\nWent round the Billets to see the men.\n\nThey seem comfortable.\n\nNo tidings yet of my kit.\n\nHad tea with Blake & B Coy’s officers.\n","11":"\n\nVisited Billets & Batt. Hdqts., Hospital. There have been no serious casualties yet with our Brigade. Got on to the track of my kit today & got it tonight.\n","12":"\n\nVisited the Billets. This afternoon made arrangements for Church parade tomorrow with 35th & 36th at 9 oclock.\n\nTonight I heard for the first time the Gas alarm in the trenches. It is a kind of trumpet that sounds & the masks must be put on. It could not have been very serious as there were no further reports. It certainly did not reach the town. When the gas alarm is sounded in the town Bells ring & a horns blow. We all carry gas masks all day in case of alarm and have them \nready\n handy all night.\n\nMaclean got word to leave tomorrow morning.\n","13":"\n\nOur Parade was held this morning in an old mill which has been out of use since the war, an industry ruined and valuable machinery rusting. I spoke to about 60 men on \"Ye are the Body of Christ & members in particular for the Body is not one member but many\". The men listened very attentively & several promised to come to our Bible Class on Wednesday evening.\n\nVisited A & B Coys Billets. One of our men had a slight wound in the head & was saved by his steel helmet which caught the Bullet side on. It made a deep dent in it but \ndid\n was not penetrated. Sgnt. Earl of Armidale was Buried today by Capt. McCook, this the 1st casualty in our Brigade. McLean left for his new quarters today so we are here by ourselves now.\n\nWeather Foggy & dull & cold. Clothes on the line have been frozen for a couple of days. Some of our men went into the Trenches today.\n","14":"\n\nSome of our men went into the Trenches today. It has been raining slightly today. Went to the Baths this afternoon & had a hot bath. It was very refreshing. An old Brewery has been utilized. The Vats are filled with water & then steam is used to heat it up. The men go in leave their old underclothes & get a set of clean underclothes after their bath. After six days in the trenches you can imagine how this is appreciated.\n","15":"\n\nI went out to the Trenches today visited D & B Coy. & went into the Front trenches for the first time & had a peep at the German trenches through a periscope. It was quiet on the front \nyesterday\n today. Tonight there were 2 gas alarms but it didn’t reach the town.\n","16":"\n\nWent to the Trenches again this morning, took a few papers. I had lunch in Major Sneddons\n\nDug out & as we were at lunch Fritz began shelling us. He sent over quite a few. It gives one a queer sensation at first when shells fall near one, but the feeling is \"stay still & hope they will go anywhere else\". I went along nearly all our Front line yesterday. It is in a terrible condition in some places. It is just churned up with shell fire, wet & cold.\n\nGot back about dark very tired.\n","17":"\n\nVisited Hospital this morning, also looked out place for service. Raining slightly, cold.\n","18":"\n\nVisited the Trenches today, had lunch with Capt. Connell. A heavy bombardment began at 1.30 & continued till about dark. Great shells went screaming overhead & burst with a dull thud in the enemy’s trenches.\n\nMills looked in after Tea.\n","19":"\n\nVisited Hospital this morning, no casualties from our Batt.\n\nMade arrangements for services tomorrow. The Chaplains of 9th Bgde. met the Brigadier at 3 oclock. Instructions were that Battln. parades were to be held not denominational.\n","20":"\n\nI had a church parade this morning for the small units of the Bgde. but they were all working so I gathered about 30 men together in the Gas School Ecole Professionale & we had a very nice little service. Subject \"Ye are the Body of Xt\".\n\nThis afternoon the enemy shelled the town again. The big shells can be heard whistling before they break & it gives one a few moments anxiety as to whether they will fall on \nyou\n one or not. Three shells fell near our billets within 150 yards. Killed one man & wounded another. The people take refuge in the Cellars but we did not.\n\nI learnt that the enemy shelled other parts of the town this afternoon & two men were killed & 12 wounded. Guns are booming all round us.\n\nOne of our men was killed today, Pt. Thompson. Had service Y.M.C.A. at 6.30.\n","21":"\n\nAbout 1.15 this morning I was awakened by terrific gun fire which kept up incessantly till about 1.45 probably a bombardment prepatory to a raid.\n\nToday, so far 1.30 p.m., is cold but fine & clear with sun. The planes have been up this morning. Another of our men Hancock was killed yesterday evening, shell explosion. One is in the hospital suffering from shock. Visited Hospital this morning.\n\nWent to the Baths this afternoon & had a hot bath, quite a luxury.\n","22":"\n\nOur men came in yesterday from the trenches, many of them with heavy colds. I was round the Billets this morning & afternoon.\n\nSnow commenced to fall this morning\n\nbut did not last long. It was fairly heavy while it lasted.\n\nThings have been pretty quiet today.\n\nGot several letters from home.\n\nThe longer one is here the more does one realize the depressing effect of wars grim tragedy. Here is a fine town deserted. No children play in its battered streets, few vehicles are ever seen save the hand carts of vendors pulled by dogs, some delivering milk others collecting any old articles of value but there seems ever the stentorous hum of distant transport \nover the\n rumbling along the cobble stones carrying food & stores to the army.\n\nAt night which begins now at 4.30 the place is in total darkness, gloomy & silent & ghostly with its gaping walls where vicious shells have bitten off huge chunks of what were homes once & firesides where children romped.\n","23":"\n\nVisited Billets this morning.\n\nDull, cold. We had a Bible Class here tonight about 7 of us, but it will grow. We took the parable of the Sower & some very interesting thoughts were presented.\n\nWe are expecting a bombardment of the town.\n","24":"\n\nRaining. Went to Hospital this morning. Made arrangements also for place to hold service for Sunday.\n\nI had a funeral also, an Englishman of the Northumberland Fusiliers, Pt. J.H. Rukin.\n\nThis afternoon I rode to Steenwerck to see the representative of the Comforts fund re supplies. They have not yet come to hand. Difficulties being the carriage & transport.\n\nIt was about 7 miles over very bad roads. Our guns bombarded the enemy. This afternoon at 6 oclock we were expecting them to reply & shell the Town but so far nothing has come. This morning’s paper (13th) contained the offers of peace from Germany but I am confident nothing will come of it.\n","25":"\n\nVisited Billets this morning. Made up the personal effects of Pts. Hancock & Thompson & forwarded them to wife & Father respectively, also wrote letters to both.\n\nEverything fairly quiet today.\n","26":"\n\nThis morning we got news that the French had advanced 10 kilometers (6 miles) on a depth of 3 K 1 4\/5. This is their answer apparently to the German peace proposals.\n\nVisited Billets this morning. Weather fine & clear till midday then overcast & cold. Front very quiet.\n","27":"\n\nThis morning we had a visit from General Birdwood. He came very quietly & made an inspection. Our services were interfered with. I was expecting our men to go into the trenches so we should not have had a service. This afternoon I gathered a few men about 35 in one of the Billets & had a service. It was a nice little service. Text, \"Thou art Simon, thou shalt be Peter\".\n\nAt 6.30 I took the service at the Y.M.C.A. & gave an address on the same text. There were about 200 men present. We had a great time. 6 men signified their willingness to serve Christ.\n\nThe night was very foggy but fairly quiet in the front.\n","28":"\n\nWoke up with a sore chest.\n\nVisited Hospital this afternoon.\n","29":"\n\nThroat very sore. Had a bad night. Visited Trenches today. Had lunch with Major Sneddon. Went through A & B Coys support trenches. While I was chatting with Major Rodd the shells were bursting over B Coys support, shrapnel & high explosives. I was very tired when I got back.\n","30":"\n\nMy throat is very sore still & my back is aching badly. I stayed in this morning. This afternoon I went to the 33rd Billets to try & get some of the lads to come to Bible Class. I saw Fred Robinson, young Holloway & Melvaine. Bible Class tonight, 11 present, Fred, Holloway, Dains.\n","31":"\n\nThere has been heavy cannonading all day on our right, continuing till midnight. I visited the trenches today, went up to the front line of C Coy. It has been raining today.\n","32":"\n\nYesterday was the shortest day of the year, the longer days will be very welcome.\n\nI did not go to trenches today but visited the hospital.\n","33":"\n\nMr. McCook left this morning for Steenwerck with his battalion.\n\nCuttriss Chapln. of the 43 came in in McCook’s place. Cutriss has been transferred to the Pioneers. The Anglicans are insisting on a C of E with every Brigade. I went out to the trenches today & had lunch at B Coy Hdqtrs. It was raining again today & the wind was very strong.\n","34":"\n\nI was only able to get a very few men for service but we had a nice service &\n\nCommunion to follow.\n\nThis afternoon I made some inquiries about the mens Christmas dinner & I got extra vegetables for them & 70 cases of comforts will be opened.\n\nWe were unfortunate today. A few of our men had not come out of the trenches & a shell came over. Sgnt. Hillier was killed, Major Sneddon badly wounded, 4 of the 41 killed & 1 of 43 & several wounded. Two gun men were wounded also. I was at the hospital at 9 oclock & saw Major Sneddon & several others.\n","35":"\n\nToday is Christmas day – a queer Christmas. The parcels were distributed & were a source of pleasure to the men & with the little extra they had a good dinner & seem to be quite happy & cheerful. I was round the billets this afternoon. For our dinner we had some cold mutton & bread & butter. For dinner tonight we are opening our Christmas pudding.\n","36":" – Boxing day, one of Australia’s great holidays but here just a day of the week. Our men had a good Christmas & all seem satisfied. I visited all the Billets yesterday. Had a good hot bath at 8 oclock & turned in soon after. I am by myself just now & these long nights are a bit lonesome.\n","37":"\n\nI have been round the Billets & have announced about the Bible Class.\n\nThis afternoon I rode the Bike to the Casualty Clearing Station to see Major Sneddon. He was doing fairly well altho in much pain. Then I rode on to Steenwerck to see the Rep. Comforts fund, getting back about 4. The roads are very bad.\n\nIt has been fine today, a bit hazy, a fair amount of aerial activity.\n\nTonight the Bible Class met. There were 17 present & it was a fine meeting. Subject, Parables of mustard seed & Leaven. They stayed after and chatted.\n","38":"\n\nVisited Billets in the afternoon.\n","39":"\n\nTook reading matter to Billets.\n\nWeather fairly fine. Made arrangements re services for Sunday.\n\nFound 13 cases of comforts & had them taken to store.\n","40":"\n\nTook a walk round Billets, prepared for Sunday.\n\nSunday 31st\n\nWe had a fine parade this morning, about 500 men present. \", Jesus the same yesterday, today, forever\".\n\nAbout 40 men stayed to communion. Tonight we had a good service in the Y.M.C.A. Mills gave address, I led singing. At 8.30 the officers of the Batn. met at Au-Boeuf Cafe at a dinner, a reunion of the officers of our mess. We saw the old year out, reaching home about 1 a.m.\n\nThe New Year will usher in many changes & some of our number will probably be\n\nnumbered with the fallen.\n","41":"\n\nDull, cloudy, intermittent trench mortar activity on our right front all day.\n","42":"\n\nWeather dull but fine. Went round to Billets in the afternoon. McCook came in.\n","43":"\n\nI visited the Billets this morning & the Hospital this afternoon.\n\nTonight we held our Bible Class. The numbers continue to increase, tonight we had 19. It was difficult to find seating for them all, some sat on the floor. We took parables of Hidden treasure and pearl of great price. There was quite a long discussion on the subject.\n\nAfter the meeting I drew up a will form for a young fellow.\n","44":"\n\nRaining today.\n\nWent to see Comforts Fund rep. re issue of comforts.\n","45":"\n\nFuneral this afternoon. Weather fine.\n","46":"\n\nMeeting of Div. Chaplains re cemetry arrangements. Weather dull & cold.\n","47":"\n","48":"\n\nChurch parade this morning was small about 80 men present. Fatigue parties from both Battalions went out. About 15 stayed to sacrament. Mills came in during the afternoon. He had tea with me and stayed all night. We went to the Y.M.C.A. for service at 6.30. It was a fine service. Cutriss gave an address. Lew came home with us after church & we had supper & discussed Methodist conferences & Australian Methodism.\n","49":"\n\nVisited the Billets today of C & D. Most of the men were out near the trenches doing fatigue work stacking bricks from ruined buildings & clearing old buildings out.\n\nThis life at the front shorn of all the glamour & excitement of camp life finds the tender conscience of men & particularly the man who has been a Christian & has slipped away. A young man came to me yesterday & said he desired to get back again into the Christian experience of a year or two ago. He had drifted but a Christian wife at home was doing all she could by letter & prayer to keep him straight & a touching letter which told of the birth of a son last August made him decide again. He has promised to come to my Bible Class. His name is . O’Reilly came in after tea & we had a couple of games of chess & supper.\n","50":"\n\nThis morning I attended a class & watched a squad doing first aid bandaging.\n\nThis afternoon I visited the Hospital and the Cemetry where I had 3 burials, 3 men 10th Bde. I had tea with B Coys officers. Heavy shelling tonight.\n\nWednesday\n\nWent to Steenwerck today to draw some pay. Had lunch with McCook at 34th Transport. While there a German aeroplane came over behind\n\nthe clouds & attacked one of our Observation Baloons. It dropped a shell on it & it fell in flames. Our planes pursued the German & a lively duel took place but it escaped. Bible Class tonight, there were 24 present. The Guns are very active as I write.\n","51":"\n\nThis afternoon I went to the Comforts Fund store & made arrangements to visit the French Coffee Stall.\n\nIt has been raining & snowing all day. I issued cocoa & milk for men who were out in Trenches till after midnight. Got letter from Home.\n","52":"\n\nMills, Capt. Clarke & I visited Houplines Coffee stall & I made arrangements to take it over for our Brigade.\n\nWent to Cemetry afternoon. Made arrangements for J.C.L. Showery again today with snow.\n","53":"\n\nWent to Billets C & D today, B Hqts.\n\nShowery with snow, roads very bad & trenches very sloppy.\n","54":"\n\nOn account of failure to put in Church Notices in orders, the parade was very small. I \"stormed\" at B.H.Q. about it & there were apologies & promises of no recurrence of the mistake. Buried 2 men this afternoon.\n\nWent to Y.M.C.A. Service tonight. Still cold & freezing.\n\nSunday\n","55":"\n\nWent to Houplines today to\n Went to Comforts fund store this afternoon.\n","56":"\n\nA big budget of Aust. mail, one from Home dated","57":" R.H.R., W.B. May & pcd from Scotland.\n\nWent to Comforts fund this afternoon & made arrangements re transport of Batt. Cases (8).\n\nWent to Houplines to see about taking over Canteen. Taking over stock tomorrow. Still cold with snow lying about.\n","58":"\n\nThe ground was covered with snow to a depth of about 4 inches. It was a beautiful sight. Went & took delivery of Batt. cases & had them sent to store. This afternoon I went again\n\nto Houplines & took over the stock of Canteen & the Coffee stall, got back about 4 oclock. Went to Cemetry.\n\nBible Class tonight 12 present, one reported wounded.\n","59":"\n\nWent to Houplines today. Houplines is in a very battered condition. It is difficult to find one house that has not \nlarge\n holes through it. There are traces of hurried flights. Furniture, Books, beds have been left by the occupants. Babys toys, perambulators & other Childrens things tell their tale of tragedy. I was through a mill evidently a woolen mill. It is a very large place with machinery that must have cost \nmany\n hundreds of thousands of pounds. I was down in the Trenches today. There was a bombardment on & the crash of guns & screaming of shells were terrific.\n\nThe furniture of the old places at Houplines is used for firewood. I saw the leg of a table & part\n\nof a cabinet being put into the stove.\n\nThere were a good many men served with free drinks at the Cocoa Stall.\n","60":"\n\nHave been out at Houplines again today.\n\nSaturday 30th\n\nWent to Houplines to the Canteen. The General has authorized me to purchase stock for it. There is a great business done there but any day we expect it to be knocked out by shells. Went into Trenches.\n","61":"\n\nI was not able to get a parade of my men as they were in the trenches but I assisted in a service at the Cinema at 10. From there I went to a lecture given by some Colonel on the War Loan. The Colonel of our Batt. asked me to go & represent the Batt. & get what information I could.\n\nIn the afternoon I went to the Hospital hoping to see McMann & others who were wounded but they had gone on to casualty clearing.\n\nAt four oclock went to Y.M.C.A. & had the pleasure\n\nof hearing Dr. Kelman speak. He was very fine and it was a great treat.\n\nWent to Cemetry 3.0.\n\nAt night I took the service at the Y.M.C.A. & preached on \"Some more convenient day\". There were 12 young men who signified their determination to serve Christ. It was a splendid time.\n\nWrote a letter home at night.\n","62":"\n\nCapt. McCook & I went to Houplines to the Canteen & I went on down to the Trenches. Yesterday a shell killed the Colonel of the 36th & another officer. They were both buried this afternoon. At the Funeral were many officers & while there a messenger came to tell all officers to report to their Commanders at once & the guns began to boom all round. There was terrific bombardment. The Germans battered our trenches in the 36 lines & then came over in three waves. There was sharp fighting & they reached our front trenches but were\n\ndriven out again leaving two dead in the trenches & while returning were badly cut up crossing no mans land. They got a machine gun & one or two prisoners so they say. We had 11 killed & 25 wounded some were gassed. This is the first real daylight attack we have had. Our artillery they say was good. McCook & I went down to Houplines at 10 oclock tonight to make cocoa for the men who were working in the trenches & we stayed there till 4 oclock in the morning. The men greatly appreciated a cup of cocoa at that hour. It was a perishing night. The ground was frozen hard. On the way we called at the A. Dressing Station & saw a few wounded. Mr Carmichael was on the table when we got there. He was badly knocked about but had no bones broken. His face was badly scratched & his eyes were very sore. Evidently he was buried for a while. They say he stuck to his post splendidly & rumours\n\nwere going round that he had been either killed or captured.\n\nWe reached home at 5 a.m. Bullets were zipping past us as we walked along the road, they have an uncanny sound as they snip by. Baptised a lad this evening.\n\nTuesday\n\nWe did not get up very early. I did not go to the Trenches today. We went to the Hospital. A shell fell on Houplines road wounding four men. Arnie was only a few yards away riding down to the Canteen. He was greatly scared at the time & I don’t wonder. It is a cruel sensation to hear a shell coming at you. This afternoon went to Cemetry.\n","63":"\n\nWent to Trenches & cocoa stall. They were shelling Houplines. It is a bright day but bitterly cold & still frozen. I had three burials today, lads who were killed on \nSunday’s\n Monday’s raid.\n\nI buried two German bodies also.\n\nBible Class tonight. There were 21 present many new comers. It was a fine meeting. ","64":"\n This morning I did not go out. Mr. Lew had lunch with me & Capt. Clarke of Comforts fund called.\n\nWent to Bde. this afternoon.\n\nMade up accs. for Canteen, we had about 250 francs profit in the week which is very good. Still very cold & frozen.\n","65":"\n\nWent to Houplines this morning.\n\nThe people beyond Barb. Wire Square have had notice to quit and there has been a great evacuation, every available vehicle has been called into service & where there are neither Horses nor dogs available the inhabitants have to pull their effects in a hand cart, what it means who can tell. Perhaps to house troops for attack or reserves or perhaps to save lives of civilians when the town is bombarded. This afternoon we had a patriotic\n\nDemonstration in the Cinema","66":" Australia Day). Capts. McCook & Mills gave addresses. I read & prayed, Cutriss gave out the Hymns.\n\nMills came back with us to tea.\n","67":"\n\nI went to A & B Billets & arranged for Church parade tomorrow at 2 oclock. The weather continues very cold, the coldest snap residents say for many years. Today’s Times says that in Paris people are dying with the cold & I can well believe it if they are at all exposed. All the ponds are frozen over & our men are having some skating. The ice is quite 6 inches thick & snow has been lying on the ground for nearly a fortnight & is powdered like sand & the ground frozen hard. At the Cemetry today they had to use picks & chisels to a depth of over 1 foot in order to dig the graves, the ground here is usually saturated with water & can easily be dug with a spade. There were 17 degrees of frost, the Thermometer registered 10 degrees Farenheit & 7 to 8° below zero Centigrade.\n\nWe have been warned that the Germans are going to release gas, the wind is favourable. I hope it doesn’t come off. It is frightful stuff.\n","68":"\n\nI have no service this morning so had a lazy morning. My parade was at 2 oclock & it was very successful in point of numbers. I had the greater part of the Batt. present with Communion at the close. Went to Y.M.C.A. at night. Just as we were going to the Hall a heavy bombardment started. We were making a raid & for an hour & a half it was frightful. I cannot say much about the result of it. Some of our party met with disaster at the enemy’s uncut wire. There was a fairly heavy death roll & some casualties also.\n\nMonday\n\nWent down to Houplines to Cocoa stall. It was fairly quiet but later on in the day the Hun put over several shells on\n\non the house opposite.\n\nWent to Bde. tonight to help draw up scheme for Cemetry affairs.\n","69":"\n\nHave not been out much today. The weather continues as cold as ever. People say they have not had such cold weather for many years. Snow is falling again.\n","70":"\n\nWent to Bailleul to see Mr. Mann at the Hospital. Cemetry this afternoon. Class tonight, small 10, but a good meeting. Still very cold.\n","71":"\n\nWent to Houplines today to Canteen Brigade at 2 oclock.\n\nThen spent the rest of the afternoon at the Canteen purchasing stores.\n\nFriday\n\nWent to Houplines to Canteen. Weather fine, clear & very cold 10° below zero Centigrade, that is about 12° Farenheit. Canals & rivers all frozen over. Paris coal supply threatened.\n","72":"\n\nToday has been cold again & the frosty weather shows no sign of clearing. It keeps dry & clear. I went to the Canteen at Houplines today. We had a record days takings over 1100 Fr. I got home dog tired. Capt. McLean called.\n","73":"\n\nThe only parade I had was at the Transport, about 50 men gathered in the blacksmith shop & we had a real hearty service. I took part at the Y.M.C.A. service in the evening.\n","74":"\n\nHave been to Canteen again today. Weather still cold & glass below freezing. Matters have been fairly quiet for a few days now. Germany’s last card is about to be played, i.e., the \"ruthless submarine war\". Neutral vessels have been warned that they will be sunk at sight if found in the zone laid down\n\nby Germany & feeling is running high in America & other neutral countries. It looks as though America will have to declare war. Holland & Denmark are also very nervous as there are great numbers of German troops massed on their frontiers. What it all means we shall soon see. It will have an important effect on the end & will probably bring it much nearer than it seems.\n","75":"\n\nWent round the Billets today & arranged for a reading room in A & B. This afternoon I went to the Baths & had a nice hot bath & feel much better.\n","76":"\n\nI went to C & D Coys Billet & selected a room to be fixed up as a reading room then went into a house near by & gathered together tables & chairs\n\n& a stove.\n\nThis afternoon I went to the Canteen & took stock prior to handing over to Richard for a week.\n\nI went to see Capt Cuttriss about a Concert programme for Saturday night & have arranged for a concert in our Billets for Saturday.\n\nBible Class this evening, 18 present. It was a very fine meeting.\n","77":"\n\nWent to Billets today. Reading room going nicely. Bought Lamps to light it & got an issue of coal sent round. I had a funeral this afternoon.\n","78":"\n\nToday I have been at the Billets & Brigade Headquarters & arranged for services for Sunday afternoon. Had two funerals this afternoon. They recovered a body yesterday that had been buried since the","79":"\n\n& another is almost unearthed, all but the feet. They had to desist on account of enemy fire. The ground had frozen round the bodies as hard as stone & they had to be literally cut out of the earth as out of solid rock.\n\nThere is no sign of the cold weather breaking up. For four weeks now it has never gone above freezing pt. It has been mostly fine & clear.\n","80":"\n\nWent down to\n Today I have been busy fixing up a stage & getting a piano for our concert which eventuated tonight & was a success.\n","81":"\n\nI gave an address this morning at the Cinema to almost 60 men (raiders) on \"Casting all your anxiety on Him Xc\". This afternoon I had Church parade with our men & we had a splendid parade. The Brigadier (General Jobson)\n\nand our own Colonel & 7 of our officers were present. My text was \"How shall we sing the Lord’s song in a strange land\". Tonight I preached at the Y.M.C.A. so altogether I have had a full day. Weather still freezing.\n\nMonday\n\nToday a slight thaw set in but it began to snow again.\n\nI went to Houplines this morning. A lad came in this afternoon for a chat & tonight Jenkin one of our Vic. probationers also dropped in.\n","82":"\n\nThe weather was a little milder today but cold enough, the ground has become quite muddy, but tonight I noticed before dark that the water in the streets was coating with ice. I have been down to the trenches today & had lunch with Capt. Connell & called also at the Canteen.\n","83":"\n\nWent to Trenches & canteen today. Bible Class tonight, 18 present, parable Lost Sheep, Lost Coin.\n","84":"\n\nHave been to Houplines. It is my week at the Canteen. The Germans have been shelling today down there.\n","85":"\n\nThe Hun has been pretty busy again at Houplines, quite a lot of shells went over our Canteen & landed about 100 yards away. He is searching for guns evidently. He shelled our trenches with shrapnel this morning. Tonight at 8 oclock our guns opened a terrific bombardment which lasted ¾ of an hour. It sounded like a raid. Flares went up continuously from the German lines. The weather has been cold but not so cold as last week.\n","86":"\n\nI did not go out to Houplines. I had to have a hot bath & it took most of my morning. This afternoon I made arrangements for Sunday. The British War Loan closed yesterday.\n\nI hope it will be a success, I think it will. The guns have been fairly quiet but as I write, 10 p.m., there is a rumble of guns, heavy at times. Capt. McLean called today & Capt. Davidson who has been away with sciatica for 7 or 8 weeks, looked in this afternoon. I spent the evening working up an address on \"Watch Ye\" for tomorrow.\n","87":"\n\nToday I had 2 services, one at Houplines with C & D Coy who are billeted in an old Brewery. It was a very good service, the other with A & B in an old Factory near town. As the men had just come out of the Trenches, the numbers were not quite up to usual.\n","88":"\n\nHave been at Houplines again today. The weather is considerably milder & it rains occasionally & things are sloppy. I had lunch with Capt. Blake & B Coy’s Officers, drew pay today.\n","89":"\n\nVisited Billets & went to Canteen\n Did not go out today, was not too good.\n","90":"\n\nWent to Canteen, took stock & handed over management of Canteen to Richmond. Bible Class this evening, there were 20 present, topic the prodigal son. It was a good meeting & discussion was free. In order to back up his statement that it sometimes happens that only disaster will bring a man to himself, one chap quoted \"Ginger Mick\" by Dennis.\n","91":"\n\nVisited Billets today. Weather very sloppy. Two young chaps came in this evening for a yarn, Basham & Till. The front has been fairly quiet but a heavy bombardment is pending.\n","92":"\n\nThis morning about daybreak the bosh bombarded & raided on the 10th Bde. front. He got into the trenches but lost 2 men killed & 2 wounded prisoners. One of our men who was caught without his rifle had a struggle with the bosh & took his\n\nrifle & bayonet from him & bayoneted him. Our casualties were about 15. I don’t think any were killed. The report is that he raided with 50 men & was badly cut up by our barrage.\n\nToday the A.M.C. have been preparing for a big stunt to come off in a day or two. It will be the biggest on our front so far, we expect a big bombardment to commence tonight.\n\nI have arranged a church parade for tomorrow (Sat.) as the Bn. goes in on Sunday. The War loan is described as a success, no less than £720,000,000 being \nnew\n money.\n","93":"\n\nWent to Houplines. I had one service in C Corp. Billet, a brewery. We had about 200 men & it was a good service, then at 3 oclock I had a service in a factory with A & B. There were very few from B Coy., the Company had gone for a hot bath & as cleanliness is next etc., so they\n\nsay, they did the next best thing.\n","94":"\n\nLast night the 33rd had a raid, the Barrage was put on about 10.30 & was very solid. The raid was successful they say, but we lost about 6 men killed & 20 or so casualties. They say they found the bosch fastened to wires on his front line. (Not true 27th)\n\nI have been at Houplines today to the cocoa stall.\n\nThere was a good service at the Y.M.C.A. & we had Sacrament afterward to which over 100 men stayed. The weather is foggy, clearing occasionally & not very cold.\n","95":"\n\nI went to Div. Baths this morning & had a nice hot bath. Brigade this afternoon where I told them of having lost my bicycle.\n\nI went to Houplines this evening. There was a big raid on in which nearly 800 men\n\ntook part. The dummy bombardment began at 10\/50 to 11. It was terrific. We were sitting in one of the old houses at the Regimental aid post & the guns opened all around us, one burst & spattered shrapnell on our wall. At 11, it died down, we had one or two slight cases in.\n\nAt 12.30 the Bombardment proper began & the raid took place. The barrage was on from 12.30 to 1.45 & it was hell in the sense that word is used nowadays. Wounded began to come in soon after. I have never seen many casualties in the dressing room before but soon it was crowded with our strong able bodied fellows wounded badly some of them, & a heavy sickly smell of human blood mixed with mud and slush of the trenches. The Blackened faces of the raiders made the scene more gruesome. The Spirit of the men was marvellous. I got them\n\nhot cocoa & coffee & they were very grateful, some smoked their cigarette while deep ugly wounds were being attended to while others talked wildly and loudly in the hysteria of shock. Men with gaping wounds walked to the aid post & waited patiently to be dressed without a murmur.\n\n10 Germans were attended to, one or two of them badly wounded. They seemed very grateful for a hot drink & hot water bottles to their feet. They were not the strongest looking & appeared thin & weedy, but they had been terribly scared. Our men dressed their wounds & treated them with every kindness & made them comfortable. Gas was liberated by us between the Bombardments. Fritz must have been terribly rattled all night. During the second bombardment shells fell all round us, one which was fortunately a \"Dud\" landed on the\n\nold house next door about 6 yards from the dressing station which at that time was crowded with men. We finished up at about 6 oclock in the morning having passed through 70 wounded including the Germans.\n\nThe raid I fancy was a success although the left wing was held up by German bombers whose trench had escaped the strafe. The German trenches were battered to pieces & their losses must have been very heavy. Our killed are not yet counted up but I expect it will be about 30.\n\nAn aeroplane was up & dropped parachute lights indicating the gun positions of the Bosch.\n\nThe whole front was like a scene from fairyland with its star shells & red & green lights except for the screech of devilish shells & the roar of artillery.\n\nWent home at 7 in the morning. I began to feel tired then. Our Batt. on whose\n\nfront the raid was made had only one very slight casualty.\n","96":"\n\nSlept till one oclock. I have moved now to Houplines & am living at the Reg. Aid post. Arnie brought my things down today. It is not so comfortable as the town billet & a little more dangerous, bullets hum as they pass down our street after dark but I shall be able to see the men & do what I can for them if they are wounded.\n","97":"\n\nI am writing over a fire in my room. Today we have been fixing it up. Arnie has been fossicking in the old ruined houses & has found a mattress & some strips of hall carpet so it is fairly comfortable. We are just about 300 yards behind the subsidiary lines. At intervals today the guns have been pounding the enemy lines preventing working parties from\n\nrepairing them after the raid. He threw some back in retaliation. Three of our fellows came in with shell shock & one with shrapnell wound on buttock. I went to subsidiary line with Lt. Whitehead & watched them fire a belt \nof\n from machine gun.\n\nLater I was going to Batt. Headquarters & was nearly there when a heavy bombardment began. We hugged the parapet for about 10 minutes & at last decided that as the matter was not important it could wait till morning. The Germans sent in a lot of shells while we stood there.\n\n*Tonight has been quiet so far.\n","98":"\n\n*I wrote the above before I turned in, we were up at midnight. The bosch lashed our front line unmercifully with H.E. & shrapnell, D Coy. suffered, we were going hard attending to wounded men till about 2 oclock, some of them were very bad & would have a hard fight to\n\npull through. Capt. C-s orderley Richards was killed, a nice lad, a shell pierced the dug out in which were 3 officers & this lad, he was making them a cup of tea. The shell passed clean through & exploded after burying itself in the ground. The 3 officers were not even marked nor shocked but the lad was killed.\n\nThursday 1st\n\nToday has been pretty lively although it was quiet early in the night about midnight Fritz repeated the performance of last night & we were up till 3 oclock with 7 casualties. I have never seen such terrible sights as were one or two. It has been a hard week & we have had our heaviest losses this week. Two were killed & one died & one or two others will not pull through I’m afraid. It calmed down after & I turned in.\n","99":"\n\nI turned in this morning at 3 & slept till 9 & felt the strain a wee bit. Went to Canteen & helped till one oclock. Went to Armentiers & buried one of our lads (Noble). On my return Fritz was sending shrapnell\n\nover the roads so I waited in an old house & finally pushed on & got through.\n\nIt is very quiet so far tonight. I hope we can get a good nights rest.\n\nGot a budget of letters yesterday, one from Home.\n","100":"\n\nThis morning I went to Canteen & after lunch left Houplines for Armentiers. My kit came up & for another spell I am back in old billets. Our men came out early in the morning. The weather has turned very cold again, sharp white frosts & keen winds.\n","101":"\n\nWent to Billets for a few minutes, lunched at \"au Boef\" with Capt. Blake.\n\nThe weather has been nice & clear for a couple of days & quite cold. I had a service at the Y.M.C.A. tonight. Had a good time. Three men decided for Christ.\n","102":"\n\nI have been busy this morning looking over the kits of killed men.\n\nThis afternoon I had two services\n\nin Billets both were small as men were out on Fatigues & some at the baths. \nSharp frost this morning\n During the night snow fell & continued till nearly lunch-time, about an inch of snow. In the afternoon it began to thaw & was very sloppy.\n\nTuesday Mch.","103":"\n\nCold again this morning but clear. Spent the morning writing letters of sympathy to relatives of deceased soldiers, wrote 6. Have been to Cemetry this afternoon.\n","104":" Mch.","105":"\n\nThe weather is bitterly cold with a bleak wind, the glass is below freezing & has been all day. The ground is frozen hard again. I have been to Billets & B H.qtrs. this morning. Visited the Hospital this afternoon. We had a surprise this morning. The Bn. was expecting 7 days rest (?) or I should say out of the trenches for a while, they are in turn. They have to go out on working\n\nparties day & night & walk a long way to them. One of our lads, Gibbs, a Methodist boy was killed while out on a working party last night. Word came this morning that we had to go in to the trenches again tomorrow morning. We are taking over the front held by the","106":" That means all our Bn. will be in together. The 11th go to relieve the","107":" & the 10th are on the move somewhere. I hope it is out for a rest & that we follow.\n\nThe Bible Class was held this evening, there were only 7 present owing to the unsettled state of things. It was a good meeting.\n\nThursday 8th\n\nSnow was falling thickly this morning & covered the ground an inch deep. A strong wind rose about 9 oclock, & the day was very bleak & cold, the ground was frozen all day.\n\nI went to the cemetry this afternoon.\n\nShortly after I left the cemetry the Germans\n\nput 5 shells into a factory close by. I heard that there were several civilians killed & some wounded.\n\nHad a hot bath today, nearly boiling but it was good. Although the wind was very cold I am glad to say I feel no ill effects.\n\nGot several letters from Home today.\n\nFriday Mch. 9th\n\nNothing much doing today.\n\nWeather still cold. Snow falling slightly.\n\nSaturday Mch. 10th\n\nWent to Trenches this afternoon & made arrangements to go down tomorrow to line. It has not been quite so cold today, although in sheltered places the ice was unbroken all day.\n\nWe were expecting a big bombardment today at 3, but it did not come off probably the weather being very misty was not favourable.\n\nI heard today that the Anglicans\n\nhave appointed their man to this Bde., that means that either McCook or myself will have to go & we are wondering who it will be.\n\nThe Turks have been driven back to within 14 miles from Bagdad & our Cavalry are in hot pursuit & the Russians are driving them back also. I hope they can keep the pressure up till they capture the city.\n\nSunday Mch.","108":"\n\nToday has been a strange day. I have had no services. The Anglicans have appointed their man to our Brigade so it is a certainty that either McCook or I will be transferred somewhere else. I feel very sore about it & very annoyed with the Anglicans, they will now have 7 C of E Chaplains with the Division & Methodists will only have one (if I go) & Pres. two. I went to the Brigadier but the Military authorities have no power in the matter at least not in the Division.\n\nThis morning I witnessed a very thrilling air fight. A German plane came over our lines pretty high & though he escaped the fire of anti aircraft & made a terrific dive at one of our observation baloons, he dropped two bombs but did not succeed in hitting. He returned to the attack three times & at last succeeded in dropping a bomb on it then a flame rose & presently this huge thing sixty by seventy feet long was a great flame falling earthward. The men escaped by jumping out with parachutes. Our planes attacked but the German was a big battle plane & he got away. One of our planes was above him & it dropped at him like a stone & fired its machine gun, as it did, one of his which was guarding him pounced down upon ours then a most thrilling thing occurred. Our machine dropped almost vertically for some hundreds of feet, skimmed low & gradually rose again. I thought they\n\nhad brought it down but it was only a clever move. I have not seen much sign of the \"supremacy of the air\" that newspapers try to make out we have. The bosh has some great machines. I heard that we brought down 2 of his baloons & a plane yesterday. I went out to the Trenches yesterday & am now living at Square Farm at the subsidiary line with the Doctor. All day yesterday there was consistent bombardment with light & heavy guns. Shell followed shell screaming to the enemy lines & occasionally he lashed back with salvos of shrapnell on our lines & also threw a couple of shells into the Town. One officer told me they had a terrible night last night, he counted over 100 minenwerfers on his sector, each of these explodes & makes a terrific mess, holes 25 ft. by 10 ft. deep honeycomb our lines. Our casualties were very very slight notwithstanding one man killed & several wounded slightly. One lad told me in the\n\nhospital today. He was lifted out of the trench & blown up about 15 ft. in the air & fell outside our front line in no mans land.\n","109":"\n\nYesterday & today the weather has been quite mild almost warm sometimes & rain set in & fell heavily during the night. I went up to Town from here today & visited the hospital.\n\nThe British have entered Bagdad so the news runs. It will be a fine stroke. Got back almost dark. Things are very quiet as I write tonight.\n","110":"\n\nToday has been fairly quiet. Intermittent shelling all day. I went down to Batt. HQ this morning. This afternoon I did not do much. Now it is nearly 11 p.m. & we are waiting for a big raid on our Front at a quarter to 12. We have made provision for a good many wounded. There’s nothing I know of quite like this\n\nwaiting knowing that at a certain time the artillery which is silent now will open with a pandemonium of terrible bombardment. It will last 85 minutes & Hundreds of guns will pour all their devilish missiles into the opposing enemy & he will reply with his own guns & hell will be let loose on the battle field.\n\nAlready two cases have come through tonight, one lad rather bad the other with a nasty wound in the leg and small shrapnel marks right up from knee to Buttock. Even in such times the Australian humour will out & that is often a saving grace among them. While this lad was being dressed one of his mates at the door of the dug out was peering in & when he saw these scars from small pellets of shrapnel, he said, \"Why Bill its only a B- hornet that’s stung you\". Bill knew better.\n\nCapt. called in & is waiting a while. I was amused at a story he told of the humour\n\nof campaign life when men who are behind the line make their official position felt as much as possible.\n\nHis company had lost a primus stove, smashed in a bombardment & he requisioned for a new one. After some delay, an answer came like this, \"I am not clear about your requisition for a primus. I cannot understand how such a thing could be destroyed in action. Was it a hostile shell?\" He was very indignant & replied as follows. The requisition was signed by myself as C.O. of the company, that should be sufficient guarantee of good faith. The details are as follow.\n\nOn the – Mch. a shell known in the trenches as a 5.2 fell on a cookhouse near our gun emplacement. It was a \nhostile\n shell. When we had picked up from the ruins, one man killed & two wounded, we found at last the damaged primus. I shall be glad if you will forward new one.\n\nI mention this to show how officialdom sometimes makes unconsciously the most humorous (if it were not so annoying) requests\n\nfrom its safe position miles behind the line to the annoyance and disgust of many officers & men who daily face death in the trenches. As a consequence of all this delay, these men have been deprived of their only means of keeping their hot drinks going through the dead cold nights of anxiety & danger. Well it is getting on for time (zero time) & we expect that this will be a very heavy artillery preparation, some 18000 rounds, light & heavy, will be put over. I shall add the results later if I get through safely.\n","111":"\n\nPunctually the barrage began at 11.40 and continued till one oclock, looking back from the trenches towards the guns it was one continuous series of flashes, like lightening, in the distance and nearer as though some Devil of war was seized with violent coughing as flame after flame blinded our eyes & 18 pounder shells were belched forth without pause or cessation for an hour & a quarter.\n\nThe impact of the driven air was very strong at 200 yards away & the crashing rending screaming whining shells of every calibre hurtling through darkness is indescribable. The noise was deafening eclipsing all speech for a time.\n\nThe raiders went over but I feel it was a futile effort, they were met at the enemy front line by a terrible barrage of shrapnel & bombs & after wading waist deep in water & mud were compelled to retire leaving their dead for the time in no mans land. They got most of their wounded in & also most of their dead.\n\nThe Par. boys were pitiable objects, sodden wet clothes, caked from Head to feet with slimy mud, bleeding wounds and shell shocked nerves.\n\nWe had about 25 through our station. We were in an old stable as a dressing station with scarcely any protection but fortunately we were rather out of\n\nthe section of retaliation.\n\nIn the midst of the Bombardment a big fire occurred in Town & we could see the flames rising higher & higher reddening the murky night. A fine drizzling rain was falling. I do not think the fire had any connection with enemy bombardment (9\" F---). I got to bed at 4 oclock & got up at 10.\n\nThursday\n\nWe had 5 lads killed last night & another today. The enemy has been very bitter all day & has put over a lot of shells. We have had several wounded.\n\nI have been up to Armentiers today.\n\nWeather not very cold, showery.\n","112":"\n\nFairly quiet. He put over several shells just behind us. Had another trip up to town to the cemetry yesterday. Saw quite an exciting bit of anti aircraft shooting. A German plane came over & our guns got on to it & I think over 100 shells were fired at it all very close till at last he returned. It has been\n\na bright afternoon & the aircraft of both sides have been very busy.\n\nDuring the strafe on Wednesday, Capt C- told me they timed the shells bursting all about his lines & there were 600 in half an hour & 900 in an hour. That is a fair bombardment for a mans nerves. The Trenches are nothing but a chain of shell holes, very few were hit. One man was blown to pieces & a few wounded, but we have had a good many casualties for the week.\n","113":"\n\nThis morning I went to B.H.Q. in the line & have to go to town again this afternoon for a funeral. I find we were going out early tomorrow so I am packing up & going out tonight.\n","114":"\n\nHad good hot bath this morning & much appreciated & made arrangements for Service tomorrow. News of a Revolution in Russia has caused quite a stir but as it looks on the face of it I think\n\nit will prove to be the best thing. It will mean the liberation of these people from the yoke of serfdom.\n","115":"\n\nI went to Billets at 2 oclock & we had a fine service. I preached on \"A man shall be as a shadow of a great Rock, etc.\". This afternoon I went to the Y.M.C.A. at the transport & had tea with a nice crowd of chaps. I spoke & at the service at 7 preached on \"The Face of Jesus Christ\". It was a good meeting. \nMonday\n Bapaume fell today.\n\nMonday\n\nGood news today. Peronne has also been occupied & an advance on 45 mile front to a depth of 10 miles in some places. Evidently this move has been planned by the Germans. It is a matter of speculation when they will take up their new positions. They are burning & destroying towns & villages and poisoning\n\nwells as they retreat. The Turks in Messopotamia are also being hardly pressed. It is a real headlong rout for them.\n\nToday has been showery. I have not been out except to B.H.Q. & the Billets.\n","116":" Mch.","117":"\n\nThe weather is very cold again with sleet & snow occasionally. It cleared up towards the evening.\n\nThe Retreat of the Germans continues & it has spread over 100 miles of front. We shall soon know what it means. The Cavalry are operating & aeroplanes are very busy.\n\nI visited the Hospital this morning.\n","118":"\n\nCold, showery in the morning but fine towards evening.\n\nGerman Retreat continues.\n\nBible class this evening, 22 men present & a very fine meeting. There are rumours of big advances on the\n\nfront but I suppose we must wait till we get tomorrows news before we can verify it. Our men are all jubilant.\n","119":" Mch. 22\n\nToday is the anniversary of my wedding day, six years married. 4 months today since we arrived in France.\n\nIt was snowing heavily today but when it cleared the snow melted quickly. The German retreat still continues though a little more slowly on the British front, but rapidly on the French. Had lunch with A Coys officers. Crackenthorp, the great Chess player who is with the 36, came in this evening & we had a few games. Of course he won but I was not altogether discredited.\n","120":"\n\nWeather fine but cold. Have not been far today. Made arrangements for Church Parade for Tomorrow.\n\n(Venus) O.P.\n","121":"\n\nWeather fine. Had splendid Ch. parade today, about 450 men. Spoke on \"The Sword of the Lord & of Gideon\".\n","122":"\n\nOur Batt. went in this morning. I had a service in the Stables at the Transport with the men, mules, & horses. I hope I succeeded in reforming some of them. It doesn’t matter which class for I think none are perfect. They are a good lot of boys & appreciate these services.\n\nOur clocks & watches were put on an hour today.\n\nWent into the trenches this evening.\n\nMonday\n\nCold, snowing, showery. Went to Batt. H.Q. & up to town this afternoon. Heavy firing on our left all night. At Plugstreet.\n","123":"\n\nSqually, very cold with snow this morning. Very heavy firing on our left again last night.\n","124":"\n\nQuiet most of the day on our front. Dull showery, cold weather. Have been up in town today.\n","125":"\n\nSame as yesterday.\n","126":"\n\nThis morning I went up the trenches. Some of the names of the trenches might not to be forgotten, so I’ll describe my walk. After passing along the subsidiary line sometimes through slush & mud, I came to Quality St. Now this street suggests only one quality, that of straightness. It is a straight communication trench with no parapet so that one is exposed to enfilade fire from the bosh & to be seen quite plainly by the sniper, but that small inconvenience was remedied when we turned into Willow walk. This trench winds along a deep drain with an occasional willow growing nearby. Battered dug outs front it with even a suggestion of a residential area, till some blundering 5 inch shell intrudes and spoils the idyllic scene,\n\nnevertheless, from holes in the earth, dark & damp, voices greet us on our way. We come now to the cross roads quite a busy corner where Queensland road \ncreeps\n meanders round an old watercourse under what were once trailing willows but now are merely stumps & crosses road & saunters on by endless turnings to the front line along plank avenues. The poet says \"even the weariest river winds somewhere slow to the sea\" so do trenches ultimately reach the fringe of no mans land & the fence of British resistance where human pickets keep a foe at bay till he opens the panels himself & goes forward to victory. Our path turns away to the left into Japan road. We pass a battered dug out where three of our boys were killed in the big strafe a fortnight ago. On the walls of the trench rude dug outs burrow away into the earth. The sign of an occupant is generally a pair of gum boots with feet\n\ninside protruding almost on to the roadway, the head being away in the recesses of the dugout. At last we reached the entrance to S.P.Y. & after winding through a maze of trenches bearing the mark of a terrible strafe & in places leaving far too much of one exposed to the bullet of the sniper, we arrived at Capt. B’s Dugout. This is shell proof & is reached after descending about 8 steps. Its of concrete but even this is no home. Water was oozing out of the walls & dripping from above & this is the life. After chatting awhile I left him & returned to Square farm feeling that it was almost out in the country.\n\nWent to town this afternoon.\n","127":" Mch.","128":"\n\nFine morning. Came into Billets this evening.\n","129":"\n\nI had a service at Y.M.C.A. this evening, \"A man shall be as the Shadow of a Rock in a weary land\". It was a fine service. Br. Gel. English, Wesleyan Chaplain called.\n","130":"\n\nWent to Baths this morning. Had Church parade this afternoon. There was a splendid crowd of men, \"Who sh. separate us from Love of God wh. is in Xt Jesus\".\n","131":"\n\nSnowing heavily all night & this morning. Strong wind. Everything white. I went to Houplines this morning to the cocoa stall. 2 letters from Home.\n","132":"\n\nHouplines again today. British & French pushing in on the Somme & lower down.\n\nClass this evening, 20 present. We had the sacrament at the class. A splendid meeting.\n","133":"\n\nBeautiful fine day. Wrote letters Home in morning. Went to Batt. H.Q. afternoon.\n\nCrackenthorp & his friend came in & we had some games of chess.\n","134":"\n\nWent to Houplines to Cocoa stall. Visited Billets. Weather fine, keen wind, rain slight towards evening. Good Friday.\n","135":"\n\nWent to Houplines this morning perhaps for the last time as we expect to move in a day or two to St. Omer for training. Arranged for Church Services for Sunday. This afternoon I witnessed a thrilling fight in the air. A Squadron of 7 or 8 of our planes had been over the German lines and on returning were attacked by a squadron of theirs. One large very fast Bosh plane engaged one of ours at about 3,000 feet. Suddenly I saw a streamer of smoke from our plane & then it burst into flame and fell burning to the ground. It was terrible to witness & to know that two of our splendid fellows were in it. It seems impossible that they could escape certain death. I heard a rumour they brought their machine down alright but I think it impossible.\n","136":"\n\nWe had a somewhat troubled night. We went to Bed about 10.30 & at 11 I heard the hum of an aeroplane & got up. It was very low down & almost overhead. The night was bright moonlight, full moon. Suddenly I heard the Bombs fall & seven in quick succession fell round our Billet. They were big bombs & shook our place very much. During the early morning shells began to fall into the town & all day it has been very lively.\n\nToday is Easter Sunday. I had a very good parade at the Billets. The weather has been beautiful, clear & warm.\n","137":"\n\nNothing much doing today, but everybody is getting ready for the Road. Things have been quiet since yesterday. After Church parade yesterday, the enemy shelled the billets & several fell about the place, one \"Dud\" came right into our billet where\n\na lot of men were, pierced the roof, the floor above & buried itself 3 feet in the ground & did not explode.\n","138":"\n\nWe got away this morning at 7-30 & marched to Bailleul over very muddy roads. It was a bitterly cold day. Snow fell heavily on the station & it was a blizzard almost. We had a trip of 2½ hrs. to St. Omer by train in Horse boxes but it was not bad. We passed through St. Omer & on to Hallines by road about 5 miles where we billeted for the night. I stayed at the priest’s place, a quiet village.\n","139":"\n\nWe got away early today, the wind was very cold. We got snow & rain. At the lunch hour halt we practically took possession of a farm house where the womenfolk made us coffee & were very kind. Of course we paid them well. Then we marched on through driving snow down the hills & up again. After a while the column looked like a great white\n\ncaterpillar as the snow settled on the hats & uniform of the men. The roads became very muddy. Many of the men had blistered feet, some of them raw & bleeding, but they stuck to it & at last we landed at Alquines, a little quiet village where the men were billeted in stables, barns & sheds of all descriptions, wet & cold & footsore. We had great difficulty finding billets for the officers. I am at the priest’s place. He is not by any means hospitable but that does not matter. C’est la guerre.\n","140":"\n\nCold, windy, wet. Men have picked up wonderfully. I have had a stroll round Billets.\n","141":"\n\nWent to Boulonge today. I was up at 5 oclock & set out for a station 5 kilometres away. Eventually I found it but not because my French was \ngood\n but in spite of my French. I never felt so much like a foreigner in my\n\nlife before. That is hard for a Britisher to realise. This is a narrow gauge line which winds among the hills & through very pretty country. After 2½ hrs. (15 miles), we reached Boulonge. Boulonge is a fine place, beautiful beach & fine shops & in every way a prosperous busy town. I put the day in here & returned at 5 oclock. I missed the road at about dusk & after some difficulty, I managed to find my way home.\n","142":"\n\nReturned with cart to Serques station for my purchases & quickly disposed of them (cigs., Tobacco, etc.) on my return.\n\nWent to 36 Bat. H.Q. & made arrangements for Sunday. (1300 prisoners captured Arras.)\n","143":"\n\nToday has been wet & miserable. My parades have been much interfered with but I had 2, one with A Cy. 36 & D Cy. 35, both in big barns, & both well attended. Wrote Home tonight.\n\nAs I have not been able to keep a daily record of events while at Alquines, I will set down a general account of our stay. The past ten days has been a time of very solid training with a march of about 3 miles every day to the parade ground. Men have been instructed in Bomb throwing. Every man threw live bombs, fired Rifle grenades & most of them Lewis guns also, besides going through a course of musketry. Then followed Battalion drill & Brigade drill in preparation for \"going over the top\". Each Batt. & each Coy. in the Battn. had its place allotted & the practice was very satisfactory.\n\nA holiday was given the men on Tuesday last. It was a lovely spring day & the country looked fine, the trees bursting into bud & wild flowers peeking up by the roadside & overall an air of peace, which was quite inconsistent with the\n\nactual facts for a few miles away one of the bitterest battles of the war was being fought & in the ebb & flow of the tide of battle whole Divisions were submerged in its crimson flow.\n\nWe rode out to the quaint old town of Liques in the afternoon.\n\nNext morning we were away at 7 oclock for our 40 mile treck to the front again. We marched 14 miles & billetted in a suburb of St. Omer. Next day we did another 15 miles to a place outside Hazebrook & yesterday we came on a similar distance to our present billet in Huts at Steenwerk.\n\nTomorrow we move up to the line, we are once more within the sound of guns.\n\nI met Col. Green at Alquines & we had a day together at St. Omer. We had fine weather the latter part of our time & marching up which was good.\n\nWe remained in Huts till Sunday morning. On Saturday night I had a voluntary service in the Ch. Army hut & had a good time.\n","144":"\n\nUp at a quarter to five & we got away about 7 oclock. We marched to La Bizet through Armentiers & the Batt. is billeted in old houses. We are now in Belgium territory. I got a shake down for the night at Pont Nieppe.\n","145":"\n\nMorning early there was a heavy bombardment on our left. The 36 lost 5 men killed. The weather has been fine & warm today. A Bosh plane was brought down here today. I did not go far today as I wanted to rest.\n","146":"\n\nWeather fine & clear. Spring is upon us now & all the trees are coming into leaf. I went up to the subsidiary lines today, our men have strong points & are billeted in old ruins.\n\nOne platoon has to see that no messages are sent down stream to the Bosch, everything floating is caught in a net & inspected, every carcase of dead dog or cat is opened as messages are sometimes put inside the dead animal & it is thrown into the stream to drift down.\n\nThere has been great activity in the air today, 3 German planes & two baloons were brought down here. We have a wonderful little plane which looks like a small bird in the sky, but it is very speedy.\n","147":"\n\nToday I have been into Armentiers to see Mr. McCook. The bosch was shelling part of the town consistently, he got a few of our men. I have been up to the Batt. after tea this evening.\n","148":"\n\nWent to Steenwerck to see about Comforts for the Bn. & had several boxes cocoa & milk, sugar, Tobacco sent down.\n","149":"\n\nI have been round part of the lines today.\n","150":"\n\nWent to Batt. H.Q. in the trenches & on to B Coy & A Coy. I had a good view of the German lines through a telescope.\n\nThere is an old ruined railway station there in the lines. A train engine & carriages is standing at the station. It is riddled with Bullet & shrapnel but it is standing on the rails as if ready to go out. The Farmhouses are very close to the lines here & the farmers plough their land right up to the Support trenches.\n","151":"\n\nToday one service that I arranged for fell through but I had two others, both very near the front line, about 25 men at each, the first in an old cowshed & the second in an old house. The house had been badly knocked about. The Ceiling was hanging in shreds & the walls gaping with shell holes. I\n\nstood in a shell hole in the wall & we had a short service singing the old well known hymns, \"Nearer my God to thee\", \"Sun of my Soul\", etc. The wind was away from the German trenches so they could not hear the singing.\n\nLt. Coghill was wounded by a premature burst of a rifle grenade. I went to the Hospital & saw him. He has a bad fracture of the jaw.\n\nToday has been fine but a strong wind. Dusty. Letters from Home & Uralla.\n","152":"\n\nLast night word came through that there would be an intense bombardment at 20 to 9 p.m. & every gun up to 12 in. on the whole army front would open for five minutes. We were waiting for it but at 8.30 Fritz opened all along our front & we replied, the noise & thunder of guns was terrific & in the midst of it the gas signals were given & we got ready\n\nfor gas, but fortunately it did not come. Our casualties were one man killed & 4 or 5 slightly wounded. He raided on our right but I do not think he got in. It was probably only a coincidence that he opened up first, but one never knows. The inventions of the war for obtaining messages are marvellous. He can pick up our messages by inserting an instrument in the ground tho’ hundreds of yards away. It is not safe to speak in anything other than code or symbols. Of course we do the same getting range position & direction of guns from the sound recorded on delicate instruments miles away.\n\nI was up in the line today.\n","153":"\n\nWent to Armentiers today. They have been badly shelled there lately & have had a few casualties.\n","154":"\n\nWent to Armentiers again today, saw McCook.\n\nThe weather has been lovely for a\n\ncouple of weeks & consequently the trees are all out in leaf & flowers blooming beautifully.\n","155":" & Friday\n\nNothing much of importance.\n","156":"\n\nThere has been a fair amount of aerial activity today though the visibility is not very good. We brought down a German plane this morning.\n","157":"\n\nMy service this morning was not a great success (7-12). I had another service with the Engineers this evening at six oclock & though small it was a very nice service.\n\nThis week I have not kept a daily diary but there has been little of special interest. Twice in succession the Bosh raided the 34th & both times was unsuccessful. There were several casualties in the 34th but very slight on the whole. There has been the usual artillery duels. On Saturday\n\nwe lost poor Capt. Brown. He was killed by a shell explosion at Motor Car Corner. He was very highly respected & his loss was very keenly felt by the Batt. He was buried in Tancred Farm Cemetry.\n\nSome little excitement was caused by an attack on one of our baloons & one of Fritz’s planes appeared to be hit. It came down very low but I believe reached his lines.\n\nI have reason to think I shall shortly be moved form the Bde. It seems the Anglicans are going to put a man with this Bde. & in the 35th Bn.\n","158":"\n\nMy service this morning was better & again with the Engineers very good. The weather has been very good & the Lilac & flowers are blooming beautifully. Our men went into the Trenches tonight to the Supports.\n","159":"\n\nI went up to the 36th H.Q. in the line, had lunch and then went to see the boys in A Corp.\n","160":"\n\nI have been up to the lines again today. The Bosh put in a great number of shells this evening. We stood & watched them. I am sure he put 200 in one spot, evidently after a battery. There is a shrill whining sound as the shell comes over then an upheaval like a huge water spout flinging dust & dirt & mingling smoke & shell with it for 30 feet in the air, then the deafening crash. No doubt that will be put on to his score & probably tonight he will get about 6 times as much in return. Mills came in with his Batt. today.\n\nIt has been raining today & the place is a bit sloppy.\n","161":"\n\nOur men have now gone up to the wood at Ploegsteert and are camping in the wood under low canvas shelters.\n\nPlugstreet wood has been the scene of heavy fighting in this war. It is a beautiful tract of woodland, I suppose about a mile & a half square & just now looks very nice.\n\nAll the trees & shrubs are out in their green & birds of all kinds sing & chirp all day long. Through this lovely wood run tracks & tramlines, breastworks & trenches, many of them named after the streets & places of London, Picadilly Circus, Regent St., The Strand & so on. In one part stands a log hut, the Batt. H.Q. It seems a tradition that every Batt. occupying it should put something on its walls and so on the door is a fine painting of the Black Watch coat of arms, Durhams, English & Irish troops & then Australian. It is here that Bairnsfather, the war cartoonist, spent some time & there are some of his sketches. Some of those which have delighted thousands were made in this little log hut in the dense wood of Plugstreet. It is very noisy. A curious notice is found posted on\n\nthe trees that no one is to shoot game in these woods & yet the guns hidden in its thick seclusion are pounding away at \nliving\n human game beyond in the Bosch trenches & certainly the Bosch is not regarding the byelaws of the owner for he is repeatedly searching the wood with shells of all calibre in the hope of killing something. I had lunch up there in the bush.\n","162":"\n\nWent to Bailleul. It is about 10 kilometres form here & for 8 of that distance the road runs through a beautiful avenue of trees. The Town is like other French towns & does not impress me much. It was here where we disentrained on our first halt in France. Everywhere there are signs of a tremendous movement in the near future. For weeks past huge guns have been coming in day after day\n\n& on the road I passed about 20 great guns drawn by tractors with caterpillar wheels, 6 in., 9 in., 12 in. & field guns. Great huge things which will soon speak out death & destruction in the new offensive.\n\nNew Railways cross the road & run away up towards the front line. Trains are emptying their shells, great huge things from morning till night & stacks upon stacks of ammunition are piling up. Hundreds of Motor Lorries following at intervals of a few yards are going night & day loaded with shells to the dumps behind the lines. Aeroplanes like flocks of birds patrol all day & some at night. Troops marching in by thousands. Buildings going up like mushrooms & thousands of horses & mules in the lines. It will be a tremendous thrust. A Col. told me 25% more\n\nguns would be used here than at Arras & it would eclipse all else up to the present in this war. The greatest smash of all history. Think of it & all to kill & yet this stupendous might of man, what is it. The Almighty laughs at the puny strength of it all & in His own way will manifest his will. He is bringing everything into glorious life & fruitage at this season feeding the birds & marking the sparrows fall & man, his masterpiece is using all his ingenuity to bring to death.\n\nAway from these Heavy lines light \nelectric\n tramways thread their way right up to the front trenches & little motor engines are plying day & night with their train loads of stores & material.\n\nAway under the Hill called the Catacombs huge dugouts capable of holding a batt. are dug, all illuminated with\n\nElectric light & replete with offices, stores and Brigade Headquarters, Telephones & furniture, all gas proof & shell proof.\n\nFrom our lines underground out beyond the enemy’s system run tunnells to mines stored with tons of explosives all waiting the touch to explode them. I was told it is possible to walk 16 miles underground \nwith\n under the Bosch lines without coming to daylight. A rather curious story was told by the same informant of a mine that was being laid by us & when the ammunition was being stored in it, after a lot of labour carrying it in, somehow the heap did not seem to get any larger. It was found that the Bosch had tunnelled under also & had found the spot & was taking it out as we put it in so of course it had to cease.\n\nArtillery activity has been livelier lately. The Bosh replies pretty freely. He exploded a big dump about ¾ of a mile from here & the explosion was terrific scattering dust & shell casing for a great distance & occasionally he gets our guns, which is only to be expected. The surprise is that he does not get many more than he does they are so thick & often only a thin camouflage covers a six inch Howitzer. You imagine at other times you are approaching an ordinary Haystack when suddenly it sends out a deafening report. It is a battery.\n\nThe fields around Batterys that he has discovered are honeycomed with huge shell holes. One I saw measured about 20 feet across & was 12 feet deep, a huge thing. Houses tumble like a house of cards when one falls in it.\n","163":"\n\nYesterday we were very unfortunate, we lost 6 men killed & 4 wounded by the same shell. Today I buried seven men side by side in a little cemetry in the Plugstreet wood. The weather continues fine. It has been quite hot today.\n","164":"\n\nToday at 9.30 I went to Nieppe & conducted service in the Y.M.C.A. for some of our men. At 11, I rode out to the Transport for service, then on to Division at Steenwerk. At 6 I had service with the Engineers & 6.30 assisted with a service in the Y.M.C.A., Nieppe.\n","165":"\n\nWas out in Plugstreet wood & saw the men, had lunch there.\n\nOn Tuesday evening I got word to leave Steenwerk by the 7.30 train tomorrow, Wed. I had arranged to go to England for 10 days leave so I got busy & fixed up all my gear & left Steenwerk on Wednesday morning for the","166":" Brigade.\n\nWe had 2 hours on Hazebruck & then came on to Etaples – the Base, where I had to stay the night. There was an unusual rush of officers so it was difficult to get accommodation. I slept in a small hut on the floor. I was given one blanket, but managed to get another.\n\nWas up at 6 & caught the train at 7.30. I did not know where the 1st Bde. was, I simply went on to the Station indicated on the pass which was Albert & there I found they were out about 4 miles. Albert is or has been a good town but is badly knocked about. The fine cathedral is terribly battered and the tower still stands though very shaky. On the top there was once a huge figure, I suppose 20 feet or more high, of the Madonna holding in her hands towards heaven a baby, the holy child. It is of bronze & gilt. This had been hit at the base and now hangs head\n\ndownwards from the tower over the road. It is a great landmark. The town was quite deserted but the folk are creeping back to their battered homes. I reported to Bde. & got to my batt. which is the 4th.\n\nOn Friday I went out with them to sports & had a good time but it was very hot. I think I shall be very happy here. It is a fine Regiment well disciplined & very keen.\n","167":"\n\nWe had sports all the afternoon.\n","168":"\n\nMuriel’s Birthday. We had a Brigade parade at 10 oclock. I suppose there were about 3,000 men, the Brigadier & Staff Cols. & officers of all Batts. & it was all carried out in splendid order. Padre Jessup, C.E., read the lessons, I gave the address.\n\nThis afternoon I went over the old battlefield of Poziers. Lambert & I got\n\nhorses. We rode through Albert & up over the old British lines where the troops jumped over in the Somme offensive of 1916. The Bosch trenches were a couple of hundred yds. distant at the time & had a fine commanding view of the country right to Albert. We traversed the ground which is marked here & there with the small white cross of \"A British Soldier\", then a small cemetry & on through tangles of battered barbed wire till we came to a huge mine crater. This mine was laid by the Germans & was fired when the troops attacked. The crater is quite 90 feet deep & 150 feet in diameter. It makes one almost dizzy to look down into its depth. Away at the bottom is a plot squared off with a cross on it marking the spot where men have been buried. Close to this place is the spot where the East Surreys went over kicking their footballs.\n\nThe 4 footballs are now honoured trophies of these regiments, many of them fell in the attack. Here is the site of La Bassee. There is nothing but a tree trunk or the stumps of a hedge to show where a village of 6 or 700 inhabitants lived. We then went over to Poziers. This is a place of great historic interest to the Australians. Three attempts were made to take it before the Australians were called up & given the task. They took it after a few hours. Before it the ground is pitted with shell holes, every yard there is a shell crater, now the grass is growing on the old battlefield & many of our lads paid the greatest price at this spot & the Troops won great renown. The German dugouts are still to be seen, some of them going down 100 feet below the ground & their huge forts feet thick of reinforced concrete could not stand before our terrible artillery. There is not one vestige of the village left. It is difficult to find a brick, even they have\n\nbeen pounded to powder. Graves here & there tell the tale of loss. The bosch evidently thought it impossible for us to push him out. His earthworks & dugouts were of the most formidable character but he was driven back & back out of a very strong position to Baupaume almost. Here & there are to be seen what is left of the woods, only a few stumps now stand, big trees have been cut off as if by an axe & there is not a trace of the many villages that dotted this slope. We rode back & reached our Billet at Buire at 6 oclock.\n\nAt 7, I took a service in the Y.M.C.A. tent, there were only a few lads there but it was a good service.\n","169":"\n\nHave not done much today. Was expecting to go to England for 10 days but cannot go till tomorrow. The weather has been very hot.\n\nI left Albert in the Somme region on Tuesday afternoon by the leave train for 10 days in England. It was a very slow train. We reached Abbeyville at midnight & had to wait till 7 next morning for a train to Boulogne. We reached there at 12 oclock. I was glad to get a hot bath, shave & good meal. We crossed the Channel in the afternoon & landed at Folkestone, then on to London by train.\n\nReported at the A.I.F. H.Q. & stayed the night at the Y.M.C.A. at Belgrave Square. Next morning went & saw Col. Green & made a few purchases & left by the 10.30 train for Edinburgh travelling all night.\n\nHad a quiet day next day\n\n& since my coming have taken things easily & much appreciate the quiet & the surroundings in a country that is British & speaks one’s own tongue. The contrast between the English & French towns is very noticeable. I am going to Glasgow on Monday & am returning to London on Wednesday & then back again to the Front.\n\nThe \"push\" that I spoke of earlier in this record has taken place & so far has resulted in the capture of Messines & the Ridge & 7000 prisoners. My old unit has been in the thick of it. How I would have loved to have been there with them. I am anxiously watching for the casualty returns\n\nI hope they have not been too heavy.\n\nScotland is looking its very best now.\n\nToday I have been to Church & heard a good sermon in Leith Church (North Leith W. Free Church). The subject was \"The Merchantman seeking Godly pearls\".\n\n"}}