{"Document Name":{"0":"Diary_0349","1":"Diary_0349","2":"Diary_0349","3":"Diary_0349","4":"Diary_0349","5":"Diary_0349","6":"Diary_0349","7":"Diary_0349","8":"Diary_0349","9":"Diary_0349","10":"Diary_0349","11":"Diary_0349","12":"Diary_0349","13":"Diary_0349","14":"Diary_0349","15":"Diary_0349","16":"Diary_0349","17":"Diary_0349","18":"Diary_0349","19":"Diary_0349","20":"Diary_0349","21":"Diary_0349","22":"Diary_0349","23":"Diary_0349","24":"Diary_0349","25":"Diary_0349","26":"Diary_0349","27":"Diary_0349","28":"Diary_0349","29":"Diary_0349","30":"Diary_0349","31":"Diary_0349","32":"Diary_0349","33":"Diary_0349","34":"Diary_0349","35":"Diary_0349"},"Date":{"0":"unknown","1":493.0,"2":494.0,"3":495.0,"4":497.0,"5":498.0,"6":499.0,"7":500.0,"8":501.0,"9":502.0,"10":503.0,"11":504.0,"12":505.0,"13":507.0,"14":508.0,"15":510.0,"16":511.0,"17":512.0,"18":513.0,"19":514.0,"20":515.0,"21":516.0,"22":548.0,"23":549.0,"24":550.0,"25":551.0,"26":552.0,"27":553.0,"28":554.0,"29":555.0,"30":556.0,"31":558.0,"32":559.0,"33":566.0,"34":597.0,"35":598.0},"Entry":{"0":"\n\nThursday \n","1":"\n","2":"\n\nJoined my own bn. & dug in. Men joining bn. from all points. Reorganising. Many of my pals dead. Tommy Bell, a sig., was struck with shrapnel early on Sunday. Tommy Glew through back of head & into r-eye. Moved out of our dug out to another spot. We found by experience that it was too exposed to shrapnel, spending a very bad 10 mins. Worked late & made another dug out. Just as we finished Bert Travers was picked upon to help dig another trench in the firing line. Woke up midnight, & got equipment, on to move but told we should move in the morning so went to\n\nsleep again. Marines going up the valley to the firing line all night to relieve us. Next morning our bn. was relieved & moving further down the valley nearer to the beach we dug in to enjoy some rest. ","3":"\n To-day Saturday had a wash in the sea. Went along to where we landed & was extremely lucky to find my pack still there. We had been helping ourselves to each others packs. Had my first shave for a week. I had quite a nice long flowing beard. Travers cut my hair with a pair of nail scissors. Did some washing & mending & so now feel all sagani. The Indian Mounted Battery all doing good work.\n\nThere are Punjaubis, Sihks & Gurkas here. Several spies have been caught on the beach & there are many snipers behind our firing line. At night the warships play their searchlights as far inland as possible & upon the fort. All day they are firing. Without them we could have done nothing. Many brave deeds have been done. The N.Z’s captured 7 M.G’s & a mountain gun. Served out with a tot of rum each & cigs. last night. Tip top. We hear the French & Tommies have landed further down the peninsula & are working towards us hemming in the Turks. Lord Kitchener says he is very pleased with us, we have taken\n\npart in a great feat of arms & done all we had to do, no matter what cost.\n","4":"\n\nRelieved the Marines in the firing line. Last night\/This morn the Turks at 1.30 a.m. blew bugles & advanced with cries of 'Allah’. As a result there are a lot more of dead 'uns in front of the trench. We have very good trenches now. A few snipers about troubling us. Kitchener gave us 3 days with 30% losses to effect a landing. We did it in as many hrs.\n","5":"\n\nHad a fairly quiet night in our part of the line. Killed a few more. We take turns to watch half hr. on & half off every other man. A party\n\nof us 8 of us sneaked out in front of the firing line this morning & got to work with billhooks on the tallest bushes then we jumped into one of their trenches & examined a good length of it. It was full of dead. The bodies were very dead & every breeze told us they needed burying. We trundled a good many bodies including 2 of our 6th (O’Brien was one – Name on disc could not recog. features) in the trenches & threw earth on them. (Re O’Brien I know landed this morning & gave me a glad surprise by appearing in the flesh. He had been with some artillery up the Gulf making sham landings just to learn enemies positions etc. MacKay landed with him & was killed on the beach by a\n\nstray bullet.) Turks are dressed in various arrays & all of them appeared to have been big fellows. Found a dead German officer & took plans from him. Carl Nelson shot a sniper with a Germans revolver he had found. Finished off another sniper he shot yesterday morn in forehead. They always call upon Allah & Mahomet. 'Warspite’ arrived yesterday & 'Lizzie’ (Queen Eliz) shifted further down. We did not get many dead buried as we had to beat a hurried retreat. Relieved by 5th bn. at 11 a.m. & went down gully into dugouts. Travers & I arrived before the crowd & managed to collar 2 tins of bully, half a dry loaf of bread (put in stew we make) & best of all about 2 lbs \n\nof tea & 2 of sugar left by a RMLI fellow. The water supply is very scarce & sometimes the liquid we get out of pools on the surface is half mud. We also make small wells on the beach & drain the sea water. The transports also condense water & this is brought ashore in kerosene tins or by water boats. We get rum given to us (3 spoonsfull 1 tot per man) practically every day & much appreciate it. We are having some tobacco & cigs. given us. I hope they give us some matches (for fires) as they are getting scarce. Just after being relieved I was picked to go on guard but managed to miss it. I am not sorry because it\n\nwould mean another night without sleep. Heavy naval guns going off all last night away to the south where the Tommies & French are.\n","6":"\n\nResting & fatigue work. Pulled out of bed 10 p.m. to 1 a.m. digging a trench.\n","7":"\n\nWent into trenches at 10 a.m. & got relieved at 2.30 p.m. Occupied dugouts till 3.30 a.m. next morn after receiving 2 days iron rations.\n","8":"\n\nEmbarked per horse boats aboard gun boats etc. the whole of 2nd Brigade & sailed down the D’s to where the French & Tommies were. Saw many results of heavy bombarding forts guns graves, entanglements hors de combat. Helped to get some 60 lb guns into position.\n\nHeavy artillery firing all day supporting rifles. We have dug in. Ground saturated with water. Country fairly level & very pretty like England. Four farm houses in bits. Three big towers near us, don’t know what they are for.\n","9":"\n\nOnly way keep warm – shiver violently. Nearly frozen during night. Rested. Name of place we first landed at Gaba \nel\n Tepe.\n","10":"\n\nWritten under difficulty with left hand. Afternoon – told that we should have to fight with packs on – terrible weight. 3 p.m. Aus. started to advance carrying picks or shovels. We had no idea what our job was. It was to advance angst. a hill that we must take. This hill is 'impregnable’ & commands the whole peninsula. There is a village at the side of the hill. If no war on the\n\n(Written by a chum.)\n\ncountry would have been very pretty. We kept passing various troops in trenches Gurkhas etc. All over the ground were empty shell cases. The Lizzies were like a ship’s funnel, and contained balls as big as billiard balls. Soon afterwards we got into extended order, dropped our picks and fixed bayonets. By now we were under a deadly rifle fire. The ground was quite flat and there was no cover. Already we were tired with running such a long way with our packs on.\n\nAlround me my pals were dropping like flies. We rested in the trench that formed our firing line for about twenty seconds. The regulars occupied this trench. The word came along and on we pushed again as fast as our tired legs and short wind would let us. We were now within 450 yds. of the Turks F. line. Some of the beggars began to run. They don’t like the bayonet. I was running on when a bullet or something struck my arm and spun me half round. I\n\ndropped. There were dozens of ours lying dead or dying around me. I did not feel too bad and knew that I must try to stop the bleeding. However I did not dare to move for about half an hour because I only drew a hail of bullets or seemed to. It is a marvel how the wounded did not get hit time after time. At last I twisted a piece of rope round my arm and kept pulling it tight with my other hand. An Australian later tied a knot for me and put my pack in front of my\n\nhead. He put on my first field dressing. I did not trouble about my side. I now waited until the sun went down – about two hours. I believe I was unconscious part of the time. Our lads had \na gun\n gone on and held their ground. Kitchener does not believe too much in the Colonials but we have done everything just as was wanted and it is a fact that the Tommys would not leave their trench and advance up to us under what they\n\ncalled \"such a murderous fire\". I tried to drag my pack along but had to leave it. When I got on my feet I felt very weak and dizzy. I went a few paces and layed down beside another chap shot in the shoulder. He wanted me to help him back but I had to leave the poor fellow. I kept \non\n struggling along falling down after about every dozen paces. It took me about three hours to get to the first dressing station and a chap helped me half the way. Stretchers were\n\nvery scarce and were only being used for the worst cases. At the station I went to sleep in a dug-out. It was a poor dug-out and I expected to get hit again as bullets were flying about all night. \n\nNext morning ","11":"\n, I could not walk down the gully and was promised a stretcher. However I could not see any chance of getting one and growing a little stronger I got down to the next dressing station. Here I got my side dressed, and had several badges and buttons\n\npulled off my uniform by a damn Tommy 'to send to England’. I met Heiller here, shot in the thigh, and we walked about a quarter of a mile to a road. Here we got a lift in a limber. It took us so far & another one took us to the beach. It jolted us about but we did not mind that. We slept in the ward room all night & went aboard 'Braemar Castle’ on ","12":"\n. 843 of us aboard. Very kind. Set sail at night. (Sgts. Grey, Brack & McVee w.f.).\n","13":"\n\nSeveral died incl. Lt.\n\nRidgeway. Beautiful weather. Sleep all the time.\n","14":"\n\nArr. Alexandria. Very hot. Put worst cases off. Hospitals in Egypt full up. One large + ship arrv. just before us & another just after.\n","15":"\n\nSailed for Malta yesterday at 2 p.m. Weather cold & bright. At night all lights out fear a torpedo. Very little done to our wounds.\n","16":"\n","17":" p.m. arr’d Malta. Big island. Very pretty. Solid rock. All soil been imported. Plenty of guns. Brilliant sunshine. Landed at Valletta. Ladies gave us chocolate, lemonade, cigs. matches. Everybody very kind. Driven in motors\n\nseven miles to Imtarfa a village of 8 houses. The military barracks are serving as a hospital. Nice stone bldgs. In my room 14 beds & dining table in centre. Took the remains of my uniform off & donned flannel shirt blue flannel trousers & coat red handkerchief for neck & pair of leather slippers.\n","18":"\n\nHad a hot bath. It was needed. Felt Goodo. Had a shave for 1d. Had more cigs. given us & also from the people in Valletta each a parcel containing a magazine, tin of tobacco, box of matches, cigs. pencil bar of choc.\n","19":"\n\nExtra tucker ordered for me. Arm & side playing up a bit. Bits of lint\n\nstuffed right through both holes. The Maltese are practically all R.Cs. & bells are going all day & all night.\n","20":"\n\nHad side stiched up.\n","21":"\n\nHad 1 hole in arm stiched up. Told I was a serious case & should be tfd. to the proper hospital but told later I was to remain here. Some nurses arrd. today.\n","22":"\n\nHad a concert once a week & tobacco & cigs. given us but we are all tired of Malta. It is an unlovely spot. Walked to Citta Vechia one day. Very quiet village with a nice cathedral.\n\nThere are very few cows in the island, goats supplying the milk. It is risky however to drink this milk boiled or unboiled. Meditteranean or Malta fever has been traced to it. The goats are allowed to ramble along the streets & the owner calls one up to the customer’s door & milks it into the basin. I believe such customer has his own particular goat. The people are very poor. Perhaps the fact that there is 1 R.C. priest to each 10 persons explains why. The sun is very strong here & the glare from the\n\nrocks & roads troublesome. Had a trip to Valetta. Went into the Cathedral & saw some wonderful tapestries – the Gobelins – about the best in the world. Went aboard the 'Agamemnon’. She had come to Malta for repairs having been knocked about in the Dards. Heaps of French boats in the dock. \n","23":"\n\nLeft Malta for England on hospital ship 'Nyasa’ a British India St. Co. boat at 2 p.m.\n","24":"\n\nSea dead calm. Passing along North Africa coast. Saw also several islands early including\n\nPentaloupe a French penal settlement. 650 patients on board, 7 doctors & 80 on the staff. French battleship passed us. It was very hot during the evening & the ship was put about to try & get a breeze.\n","25":"\n\nUp to now sea has been dead calm but this morning a breeze has sprung up & it is nice & fresh. At breakfast time 2 submarines & a destroyer passed us.\n","26":"\n\nLand visible on European side. Sea dead calm. Very pleasant. We hugged the coast of Spain. Saw the snow capped Sierra\n\nNevada. Country all barren looking mountains. A good many villages to be seen.\n","27":"\n\nAt midnight last night we passed Gib. It was a bright moonlight night so we were able to see it clearly. A searchlight shone on us several times. The Spanish coast was quite near & Africa also showed up plainly. It has grown much cooler. Passed very close to Cape St. Vincent.\n","28":"\n\nPassed the Finisterre light at 9 p.m. & entered the Bay. Very calm.\n","29":"\n\nBuried a sailor died of dysentery.\n","30":"\n\nPassed the Ushant light at 2 a.m. this morn & enterred Channel. Met Dale’s son aboard – steward (pork pie shop)\n","31":"\n\nPassed Isle of Wight last night & entered \nalon\n Sthmpton Water about 8 p.m. Berthed this morning & all Colonials entrained at 11 a.m.\n","32":"\n\nLast night arrd. at Ducie Avenue Hospital, Manchester. Told to stop in bed to day – a bit off color. In bed for 3 days.\n","33":"\n\nMotored to Paddock House Oswaldtwistle. A private house run by the Red +. Allowed out in\n\ncharge of porter from 3 to 6.\n","34":"\n\nTreated very well indeed at Paddock House. Excellent food (Matron – Miss Yoxall Sisters Higson, McKechnie (night sis.) Barlow, Wildblood, McGronin. John Willie Bainbridge N.Z.R., Wilfred Kaye 'Dimple’ Jim Bak Never-Never, Jock Rae, Addison, Mary, Whip, Bleazard, Dad Garton, Dunaclaes. After leaving this hospital I spent some months in the Australian Hospital at Harefield during which time my arm was operated upon. On","35":" I sailed from Portland on the \"Star of England\" for Melbourne. We arrived here safely & I was discharged as permanently unfit on 5\/7\/16.\n\n"}}