{"Document Name":{"0":"Diary_0164","1":"Diary_0164","2":"Diary_0164","3":"Diary_0164","4":"Diary_0164","5":"Diary_0164","6":"Diary_0164","7":"Diary_0164","8":"Diary_0164","9":"Diary_0164","10":"Diary_0164","11":"Diary_0164","12":"Diary_0164","13":"Diary_0164","14":"Diary_0164","15":"Diary_0164","16":"Diary_0164","17":"Diary_0164","18":"Diary_0164","19":"Diary_0164","20":"Diary_0164","21":"Diary_0164","22":"Diary_0164","23":"Diary_0164","24":"Diary_0164","25":"Diary_0164","26":"Diary_0164","27":"Diary_0164","28":"Diary_0164","29":"Diary_0164","30":"Diary_0164","31":"Diary_0164","32":"Diary_0164","33":"Diary_0164","34":"Diary_0164","35":"Diary_0164","36":"Diary_0164","37":"Diary_0164","38":"Diary_0164","39":"Diary_0164","40":"Diary_0164","41":"Diary_0164","42":"Diary_0164","43":"Diary_0164","44":"Diary_0164","45":"Diary_0164","46":"Diary_0164","47":"Diary_0164","48":"Diary_0164","49":"Diary_0164","50":"Diary_0164","51":"Diary_0164","52":"Diary_0164","53":"Diary_0164","54":"Diary_0164","55":"Diary_0164","56":"Diary_0164","57":"Diary_0164","58":"Diary_0164","59":"Diary_0164","60":"Diary_0164","61":"Diary_0164","62":"Diary_0164","63":"Diary_0164","64":"Diary_0164","65":"Diary_0164","66":"Diary_0164","67":"Diary_0164","68":"Diary_0164","69":"Diary_0164","70":"Diary_0164","71":"Diary_0164","72":"Diary_0164","73":"Diary_0164","74":"Diary_0164","75":"Diary_0164","76":"Diary_0164","77":"Diary_0164","78":"Diary_0164","79":"Diary_0164","80":"Diary_0164","81":"Diary_0164","82":"Diary_0164","83":"Diary_0164","84":"Diary_0164","85":"Diary_0164","86":"Diary_0164","87":"Diary_0164","88":"Diary_0164","89":"Diary_0164","90":"Diary_0164","91":"Diary_0164","92":"Diary_0164","93":"Diary_0164","94":"Diary_0164","95":"Diary_0164","96":"Diary_0164","97":"Diary_0164","98":"Diary_0164","99":"Diary_0164","100":"Diary_0164","101":"Diary_0164","102":"Diary_0164","103":"Diary_0164","104":"Diary_0164","105":"Diary_0164","106":"Diary_0164","107":"Diary_0164","108":"Diary_0164","109":"Diary_0164","110":"Diary_0164","111":"Diary_0164","112":"Diary_0164","113":"Diary_0164","114":"Diary_0164","115":"Diary_0164","116":"Diary_0164","117":"Diary_0164","118":"Diary_0164","119":"Diary_0164","120":"Diary_0164","121":"Diary_0164","122":"Diary_0164","123":"Diary_0164","124":"Diary_0164","125":"Diary_0164","126":"Diary_0164","127":"Diary_0164","128":"Diary_0164","129":"Diary_0164","130":"Diary_0164","131":"Diary_0164","132":"Diary_0164","133":"Diary_0164","134":"Diary_0164","135":"Diary_0164","136":"Diary_0164","137":"Diary_0164","138":"Diary_0164","139":"Diary_0164","140":"Diary_0164","141":"Diary_0164","142":"Diary_0164","143":"Diary_0164","144":"Diary_0164","145":"Diary_0164","146":"Diary_0164","147":"Diary_0164","148":"Diary_0164","149":"Diary_0164","150":"Diary_0164","151":"Diary_0164"},"Date":{"0":"unknown","1":948.0,"2":949.0,"3":950.0,"4":951.0,"5":952.0,"6":953.0,"7":954.0,"8":955.0,"9":956.0,"10":957.0,"11":958.0,"12":959.0,"13":960.0,"14":961.0,"15":962.0,"16":963.0,"17":964.0,"18":965.0,"19":966.0,"20":967.0,"21":968.0,"22":969.0,"23":970.0,"24":971.0,"25":972.0,"26":973.0,"27":974.0,"28":975.0,"29":976.0,"30":977.0,"31":978.0,"32":979.0,"33":980.0,"34":981.0,"35":982.0,"36":983.0,"37":984.0,"38":985.0,"39":986.0,"40":987.0,"41":988.0,"42":989.0,"43":990.0,"44":991.0,"45":992.0,"46":993.0,"47":994.0,"48":995.0,"49":996.0,"50":997.0,"51":998.0,"52":999.0,"53":1000.0,"54":1001.0,"55":1002.0,"56":1003.0,"57":1004.0,"58":1005.0,"59":1006.0,"60":1007.0,"61":1008.0,"62":1009.0,"63":1010.0,"64":1011.0,"65":1012.0,"66":1013.0,"67":1014.0,"68":1015.0,"69":1016.0,"70":1017.0,"71":1018.0,"72":1019.0,"73":1020.0,"74":1021.0,"75":1023.0,"76":1024.0,"77":1025.0,"78":1026.0,"79":1027.0,"80":1028.0,"81":1029.0,"82":1030.0,"83":1031.0,"84":1032.0,"85":1033.0,"86":1034.0,"87":1035.0,"88":1036.0,"89":1037.0,"90":1038.0,"91":1039.0,"92":1040.0,"93":1041.0,"94":1042.0,"95":1043.0,"96":1044.0,"97":1045.0,"98":1046.0,"99":1047.0,"100":1048.0,"101":1049.0,"102":1050.0,"103":1051.0,"104":1052.0,"105":1053.0,"106":1054.0,"107":1055.0,"108":1056.0,"109":1057.0,"110":1058.0,"111":1059.0,"112":1060.0,"113":1061.0,"114":1062.0,"115":1063.0,"116":1064.0,"117":1065.0,"118":1066.0,"119":1067.0,"120":1068.0,"121":1069.0,"122":1070.0,"123":1071.0,"124":1072.0,"125":1073.0,"126":1074.0,"127":1075.0,"128":1076.0,"129":1077.0,"130":1078.0,"131":1079.0,"132":1080.0,"133":1081.0,"134":1082.0,"135":1083.0,"136":1085.0,"137":1086.0,"138":1087.0,"139":1088.0,"140":1089.0,"141":1090.0,"142":1091.0,"143":1092.0,"144":1093.0,"145":1094.0,"146":1095.0,"147":1096.0,"148":1097.0,"149":1098.0,"150":1099.0,"151":1100.0},"Entry":{"0":"\n","1":"\n\nReturned to the trenches at 3.30 am after being out for a few hours Bivovac but which was constantly disturbed by German Machine Guns sweeping across. wounded Pte Thied Manly wounded in hand behind the Parapet following behind me We took up positions & at 8 am began the Bombardment of German lines & it certainly was a sight to see the Bombs Trench Mortars & the whiz of shells. Almost deafening at times. Kept up till 4.40 Pm & then charged the German trenches which captured without any difficulty although in the face of a murderous Machine & Rifle Fire & a good many left, Wounded & dead in No Mans Land Had a pretty night of it in the Trenches & many of ours how missed getting hit especially from a German shells which were landing pretty close Were completely cut off by 4 am","2":" & was bombed fiercely by Germans & had surrender at 4.30 am 123 Men & 3 officers 2 Captains & 1 Lieut\n\n20 July \n\nMen marched through German Trenches & what sights met our eyes & then on to Head Quarters for examination & later to the Lille Citadel to await transportation to the Prisoner of War Camp.\n\nDisembark about 50 Tommies En route to \n\n. We were treated & by the Guards & had several drinks of water at different stages along the road about 7 miles . Arrived at Citadel 430. Had half loaf Bread & drink Coffee for supper.\n","3":"\n\nLille Citadel coffee for breakfast Soup Denny’s Weak Tea for Supper & Half loaf bread for the 24 hours. About 20 more Australians arrived that were taken after us making up a grant total of 150 men of 14th & 8th Brigade, 53-54-55 British & 1 man from 56 Batt. Knives & Razors taken from us Saw German Taube fly across the Prison. \n","4":"\n\nLeft the Lille Citadel for Germany at 2.30 Pm. Marched through the streets of Lille to the Railway Station & was struck by the cleanliness & beauty of the City. Saw a good deal of destruction about Railway Station from Shell Fire. Were placed & locked in 40 men to each Cattle truck but had small window for sightseeing Had a bowl of thick Barley Soup given us At Coln Belgium . Train stopped at Brussles for a couple of hours to let Hospital & troop trains pass through at Express Speed 2 Engines \n","5":"\n\nStill on Train saw 5 Hospital & 6 Troop trains pass us Passed Munster when where have learned is another P of War Camp for Non Com Officers. \n","6":"\n\nArrived at Station called Haltern & was told to detrain as our destination & was then marched to Dulman P of War Camp Was given us a Bowl of Soup 2 pieces of bread & wanted it too as all very Lumpy. After a bit of examination was marched off to a Bath House & had our clothes fumigated & after a good hot shower bath which was very much appreciated. Afterwards marched to Barracks in Block D & allotted 60 men to each Hut Good Hammock & a Stove in them &: very comfortable. Feel pretty miserable at being locked behind the Barbed Wire Chats all finished after Fumigation\n","7":"\n\nAllowed to write Prisoners of War Card home telling am P of W. old are allowed to write 2 letters & 4 Post Cards each month so am not badly done by. Can receive any amount of letters & P C in return No Restrictions South Africans captured day before us in next block to us.\n","8":"\n\nMade chums with a couple of Canadians & one has written his people to get as some food parcels from England which most of the old hands here live on as food not sufficient to keep you from hunger & likely to know it too as pinch of hunger very much already.\n","9":"\n\nA week today since captured & the only thing is how long am to remain healthy all though it cant last till Xmas but the older hands in this Camp give it 12 months still to go It is not cheerful news but still as some were Captured at Mons at beginning of War they are resigned to their fate to think it will go that long. Address is Dutman Camp Barrack 9B Coy 22 Group 3\n","10":"\n\nStill feel pretty glum but shall have to make the best of it Better when get used to the food. Meat is out of the question & is very much missed.\n","11":"\n\nBaxter Canadian gets Red Cross parcel & gives drink of Tea & slice Bread & jam Gee some luxury. 1st Inoculation today.\n","12":"\n\nGo to No 1 Camp for Church Parade but its really to see some fresh faces & hear of any news & find Any Aust know Met a chap from 20 Batt Met a few of the British Riflemen captured in Retreat from Mons & certainly that had a very bad time of it after capture.\n","13":"\n\nAllowed to write PC so sent one to the Aust Red Cross London for food Parcel. Expect to get one in 5 weeks Oh the wait.\n","14":"\n\nAllowed to write letter today so have written to Elsie as anxious of my money still being paid as expected am posted missing or dead but am very well alive & came through without a wound.\n","15":"\n\nWeather rather chilly & sharpens the appetite Quite like a football rush to get tucker\n","16":"\n\nToday is our 2 Week Weather still keeping cold. 2 Innoculation today.\n","17":"\n\nSame old Routine Fall in for Counting at 6 am, 2 Pm and 6 Pm.\n","18":"\n\nHot Bath & Clothes & Blankets are again fumigated & feel OK after it. Wish it was a daily routine instead of Weekly. The only drawback is the want of soap. Got hold of a few books to help while the time away. PC to hosp St John\n","19":"\n\nVisited No 1 Camp & had a feed Only one all the week worth eating Bread Butter & Bully Beef\n","20":"\n","21":"\n\nIssued with Forage Caps Badly needed cold with Bare Head. 12 Months ago today went into Camp Warwick Farm Sydney.\n","22":" t Wed\n\nNon English Prisoners arrive Quiet an assortment here at this Camp in the shape of Kitchner – & \n\nEnglish Irish Scotch Belgium French Welsh Lpool Irish (Kings) Russians, Senegalese South African Canadians Australian No. N Zealanders yet Algerians Martinque (Fn) Corsica\n","23":"\n\n3 weeks captured today.\n","24":"\n\nGermans issued us with New Shirt. Three French prisoners escaped last night. Holland is about 15 miles distant North.\n","25":" \n\nLooking forward to visiting No 1 Camp tomorrow to get a feed. PC Masonic Club Lpool.\n","26":"\n\nSaw Barber Had by bowl of Cocoa & 3 slices of Block Bread & Golden Syrup certainly was good Eat anything now.\n","27":"\n\nWas taken out with others to carry a few sods of Heather for making garden in the camp Quite to get a run out Only for a couple of hours.\n","28":"\n\nWrote letter to Father. Had rather a pleasant surprise in the shape of getting Boiled Potatoes in addition to the Soup.\n","29":"\n\nHad talk with Life Guardsman been Captured 2 years very interesting to hear of his experience Russian Officer to evade capture cut his throat French get 42 Biscuits per man for week French Government They would not give one away for their life & Charge 20 Pfennigs each for their 25 No money so cant buy.\n","30":"\n\nOne month captured today Getting rather an old hand & beginning to look for parcels next week & hope some turn up Dont lay too many hopes so shall not be disappointed\n","31":"\n\nAnother batch of Prisoners in the shape of Algerians The French we take no notice of now as they are being caught pretty near every day & all are stocked with overcoats & food Believe they come over the Parapet with their belongings & give themselves up. Have no love for the French Soldier after his ways here.\n","32":"\n\nOrder came through cancelling Camp Concert & believe its the same through Germany\n","33":"\n\nPC to Enid today Visited No 1 Camp PC to Chas Dixon D.A.C. France.\n","34":"\n\nReceived some Food Parcels from the Tommies No 1 Camp Not much when shared out but still was acceptable especially the Tea 18 Aust sent away Working Party, Farm Hands presumed Raining Pretty Heavilly.\n","35":"\n\nRained heavily all day.\n","36":"\n\nSent all our NCO’s away today to Minden Camp Germany.\n","37":"\n\nFive Weeks captured today.\n","38":"\n\nHot shower today Got cake soap from Swiss No 1 Camp so had a good clean bath.\n","39":"\n\nAnother working Party left today for an unknown destination PC Anderson Maria.\n","40":"\n\nDid not get across to No 1 today Rather disappointed\n","41":"\n\nHear that Roumania has come into the war on the Allies side & Italy has declared War on Germany This will no doubt help to hasten the end.\n","42":" Tuesday\n\nSaw 5 Zepplins pass across the camp between 4 & 6 oclock Pm & they certainly aroused a good deal of curiosity & excitement. One sailed down to about 100 feet over the Hub & was plainly seen. No L 16 it was. Were coming from direction of Holland & making South It was drizzling rain at the time & they were soon lost to sight\n\nThey are exactly built like a British Torpedo.\n","43":"\n\nNo Red Cross parcels yet.\n","44":"\n\n6 weeks captured today.\n\nPosted letter to Enid. Was at No 1 Camp Feed Bully Beef White Bread & Tea.\n","45":"\n\nAnother batch of 30 men told off to go away as working party\n","46":"\n\nSaw 2 Zepplins this Afternoon One had 3 Cradles to all other have saw had only 2.\n","47":"\n\nHad good Breakfast No 1 Camp White Bread Bacon Oxford Sausages Tea. Met a Mason among the crowd. Seems a real good chap.\n","48":"\n\nExpect Father to receive Prisoner of War Card. Had plenty of for Breakfast. 45 more go out on Working party. Got some Tin so feel pretty well after the soap & the drink.\n","49":"\n\nHad double share Cocoa Breakfast & plenty of Fish Soup Dinner & Bread & don’t feel as hungry as usual Hear from an Aust who received a Red Cross Letter that they were sending the parcels for the Australians in this Camp & believe they have arrived & are in the Truck to be unloaded. Good Cheer.\n","50":"\n\nHear of Big advance by French on Somme & capture of Machine Guns also Zepp. Zepp L2 flew over camp last night just at dusk. 8.30 Pm.\n","51":"\n\nCalled out today to go away Working Party saw French Dr. & to see German Dr. morning Not fit go out to work Issued with Wooden Clogs & underpants.\n","52":"\n\nTo see German Dr. 10 am tomorrow.\n","53":"\n\nPassed fit to go to work. Hard Luck? We expect to leave this Camp on Monday.\n","54":"\n\nAll leave for the usual Sunday Monday has been stopped. Shall be glad to get out & earn a few Marks for tobacco Money. Miss my usual meal & cup of tea very much at No 1 Camp.\n","55":"\n\nSelf & chum for big jug of Maizemeal for Breakfast from French German Taube flew across this Afternoon returned just on Dusk.\n","56":"\n\nHad 2 slices Bread & Half Frankfurt given me. Some of Red Cross parcels in Ans to letter of July 31st received by some of our chaps Expecting to get one too but has not arrived yet.\n","57":"\n\nLetter Received last night that the list of names published in Battalion is France, dated 29 August. 8 weeks today since & no parcels from Red Cross yet.\n","58":" \n\nPost Card from Aust Red Cross 3 Parcels coming & feel in good spirits Sinclair also 3 parcels & 1 Parcel from Lady Gawagh’s Fund Making, 7 in all between us. \n","59":" \n\nReceived Red Cross Parcel & eat the Fruit Cake & it was certainly a delicacy.\n","60":" the Sept Sat\n\nGerman Flag flying again Today & the Band playing God Save the King Tune for a Victory. Had a of Turkey Tea with & feel all the better for the meal.\n","61":"\n\nCabbage & Boiled Potatoes for Dinner & it went well with a Red Cross Camp Pie & Tomatoe Sauce.\n","62":"\n\nReceived Red Cross parcel No 10 Biscuits Jam & Tea for Supper awfully good.\n","63":" \n\nCocoa with Milk & Sugar Biscuits &am jam Breakfast. The Army Rations. Meat & Vegetables for lunch Potatoes Boiled Barley Bread Potted Meat Biscuits Jam Tea Certainly have had a good meal today.\n","64":"\n\nReceived 2 loaves Swiss White Bread also Card from Red Cross for another parcel Marked 12. Out this afternoon for walk doing gardening work. Received PC Parcel.\n","65":"\n\n9 Weeks captured Today. Had good Breakfast of Bread Butter & Jam Tea First time have not eaten German .\n","66":"\n\nA German Plane Flying across Camp Afternoon\n","67":"\n\nSaw 3 Zepps this Afternoon coming from direction of Holland.\n","68":" \n\nTurned 33 today. Today last year was in Training at Warwick Farm. Have been expecting RC Parcels & feel disappointed at not arriving as back on German Tucker again.\n","69":"\n\nSaw a Zepp L12 this Afternoon No packages today & feel pretty disappointed & hungry. Recd 2 PC from Red Cross. Clothes in one H.Q.\n","70":" \n\nJust heard that some Money at Camp Office for me. Got 3 Parcels 1 Tobacco & cigarette. Got word this morning that go from this Camp Working Party Saw Baloon & Taube fly across this afternoon\n","71":"\n\nRecd No 12 parcel from RC this morning\n","72":"\n\nReceived Clothes Parcel & its a good lot of underclothes Pipe Tob Cigarettes etc. Got word that leave for another camp but don’t feel sorry at all as sure to strike something better.\n","73":"\n\nLeft Dulman at 630 am Entrained at Dulman Railway Station 9 am for Posen in good Carriages. Had good feed Macaroni at 9 Pm Weather rather cold Issued with overcoats before leaving Camp. Gardelefon. \n","74":"\n\nPassed through Berlin Hot Coffee & Cheese 4 am Kruez at 3.3 PM. Boiled Cabbage & Meat. Rotten. Arrived at Schmufernupl Camp at 10 3 PM & get plenty Hot Tea from English Prisoners.\n","75":"\n\nHad a good reception from English & a good breakfast & Dinner Got a good deal of food & Cigarettes & tobacco. Feel very contented & the Camp is a good one.\n","76":"\n\nUpon arrival at this Camp the English Russian French & Belgium decided to give us food till our parcels & they are doing it right Royally. Had a concert tonight. Concluded at 11 3 PM for Buying Vegetables for us new Arrivals at the Canteen so wont eat German Food.\n","77":"\n\nThere is a working Party to go out tomorrow & sincerely hope am amongst the Crowd Getting splendid food from the Tommeys & they are a right Happy Lot.\n","78":"\n\nGot word today to leave on Working Party 5 am Tomorrow Expect last about 6 weeks \n\nat Beet Sugar Mill Sorry to leave Sinclair behind but he will get put out before the end of week.\n","79":"\n\nLeft Camp at 530 am Raining pretty heavily Arrived at Mill Amsee at 4 PM Travelled since 5 am on Cup of Coffee The wages paid is 30 Pf per day = 35(?) good money?\n","80":"\n\nUsing the shovel all day Food pretty good for German. Sleeping Barrack very good & clean & things generally should be alright.\n","81":"\n\nShifting steel Rails & launching steel Bayes Pretty tiring work.\n","82":"\n\nGet 2 papers from the Camp asking for news of Max & Jack Giles. As have not heard from either of them cant tell anything \n","83":"\n\nHelping to launch lighters & pretty heavy work but food not too bad Digging canals Afternoon\n","84":"\n\nStill on the lighters.\n","85":" \n\nStill on the lighters.\n","86":" \n\nStart work at 6 Pm Night Work. Wheeling line in Trucks fit ½ hr spell Midnight. Knock off 530 am\n","87":"\n\nGo sick today. Work too heavy.\n","88":"\n\n2 Packages from Lady Dodds. Draw 3 ½ Marks today.\n","89":" \n\nReceive 2 loaves Swiss Bread dated 17 Sept. Good Condition\n","90":" \n","91":" \n","92":"\n\nGo on Night Work again.\n","93":" \n\nFinish Work at 6 am. Very tired Go sick again.\n","94":" \n\nSaw Dr today. Going back to Camp Sick.\n","95":"\n","96":" \n\nGet 2 Red Cross Parcels today one containing 2 Blankets.\n","97":"\n\nGo back to Camp Tomorrow\n","98":" \n\nLeft Ansu. 1.30 Pm Changed at Brombey & wait of 5 hrs\n","99":"\n\nArrived at Camp 11.15 Pm.\n","100":" \n\nGlad to be back in Camp Sinclair still here sick. Hospital\n","101":" \n\nReceive parcel of Swiss Cheese.\n","102":"\n\nGet 6 Parcels today.\n","103":" \n\nGet 3 Parcels today.\n","104":"\n\nGet Swiss Cheese again today also overcoat & underclothes.\n","105":" \n\nSwiss Bread today.\n","106":" \n\nHad good Concert & Dance tonight in Barracks Room\n","107":"\n","108":"\n\nGood Concert Tonight. Very Lively.\n","109":" \n\nHad trip down Town with Parcels for Boys Working there\n","110":" \n\n4 PM return to Camp Sick from Amsu Hear Posen sent Russian Front Signalling Prisoners\n","111":" \n","112":"\n\nFatigue today Cutting Wood. Weather bitterly Cold.\n","113":"\n","114":"\n","115":"\n\nOn Camp fatigue this Morning.\n","116":"\n","117":" \n\nSinclair gets letter from Aust. Looking forward for my Letters any time Now.\n","118":" \n","119":" \n\nParcels arrive from Dulmen today & look forward to getting them morning.\n","120":" \n\n70 of us fit put in Cells for 5 days on Bread & water punished because men refused fatigue & could not get their names Spent a pretty miserable day & Night.\n","121":"\n\nGet released at 11 am as are putting us all out to work Names drawn but did not get picked. Get 9 parcels Crowd of drink 5 get put in Cells.\n","122":" \n\nHad breakfast of Fried Bacon & mashed potatoes Very nice A very lively night last night 5 get Cells.\n","123":"\n\nStarted snowing lightly today & the weather very cold\n","124":"\n\nSnowing Today & blowing a Hurricane. The heavest snow have had pleasure of seeing.\n","125":"\n\nFatigue today. Had dinner off Bacon & Mashed Potatoes. Very enjoyable. Go out to Work Tomorrow\n","126":"\n\nArrive at Grosendorf 3 PM Hard work I hear so intend to go back to Camp\n","127":" \n\nStart work at 6 am Shovelling the Beats & hard work it is too Get Barley South & small piece Roast Pork.\n","128":" \n\nHave been turned in sick all day Effects of heavy work yesterday. Only 20 Kilos off Russian Border. \n","129":" \n\nTurned in all day. Flags flying all day Half Mast death of Emperor of Austria.\n","130":"\n\nStill turned in Bed. The weather for past week has been like Spring weather again.\n","131":"\n\nBoys work from 6 PM last night till 12 today Dayshift goes on at 12 today & work through till 6 am tomorrow 18 hrs shift.\n\nStill turned in Sick & waiting for Dr.\n","132":"\n\nPackages have arrived today. See Dr & to go back to Camp\n","133":" \n\nCan hear the guns in the distance See Dr & go back to Camp Tomorrow. 2 Marks pay.\n","134":"\n\nStill at Sugar Factory Grossendorf. Hear today Turkey with Allies?\n","135":" \n\n2 of the sick go back Today. Still here.\n","136":" \n\nReceive 11 letters today. 2 From Enid posted posted through Rred Cross Switzerland for me. This is the first letter knowing am Prisoner of War. Feel in very good spirits.\n","137":"\n\nStill here at Factory & told shall have to wait till Factory finishes up on 5th Inst when all going back to Camp together.\n","138":"\n","139":" \n\nOfficer making arrangement to go back to Camp tomorrow but but lay in weight to it as put off many times\n","140":"\n\nAs thought still here at Factory. Received letter Elsie Syd Sept. 21.16 Receive 2 Parcels Food & Tobacco.\n","141":" \n\nOfficer gives me 1 Mark for piece of Soap.\n","142":" \n\nHear finish on Saturday & all go back Camp Sunday.\n","143":"\n","144":"\n\nSugar Factory has finished Go back to Camp Monday & not sorry to get away from here\n","145":" \n\nSnowing pretty heavily last night\n","146":"\n\nLeave for Camp at 9 30 Arrive back 5 PM.\n","147":"\n\nGlad to get back again.\n","148":" \n","149":" \n","150":"\n\nWrote Miss OConnor Red Cross Recd letter from Father\n","151":"\n\nParcel of Swiss Bread.\n\n2 Cards RC Boots & Xmas\n\n"}}