{"Document Name":{"0":"Diary_0412","1":"Diary_0412","2":"Diary_0412","3":"Diary_0412","4":"Diary_0412","5":"Diary_0412","6":"Diary_0412","7":"Diary_0412","8":"Diary_0412","9":"Diary_0412","10":"Diary_0412","11":"Diary_0412","12":"Diary_0412","13":"Diary_0412","14":"Diary_0412","15":"Diary_0412","16":"Diary_0412","17":"Diary_0412","18":"Diary_0412","19":"Diary_0412","20":"Diary_0412","21":"Diary_0412","22":"Diary_0412","23":"Diary_0412","24":"Diary_0412","25":"Diary_0412","26":"Diary_0412","27":"Diary_0412","28":"Diary_0412","29":"Diary_0412","30":"Diary_0412","31":"Diary_0412","32":"Diary_0412","33":"Diary_0412","34":"Diary_0412","35":"Diary_0412","36":"Diary_0412","37":"Diary_0412","38":"Diary_0412","39":"Diary_0412","40":"Diary_0412","41":"Diary_0412","42":"Diary_0412","43":"Diary_0412","44":"Diary_0412","45":"Diary_0412","46":"Diary_0412","47":"Diary_0412","48":"Diary_0412","49":"Diary_0412","50":"Diary_0412","51":"Diary_0412","52":"Diary_0412","53":"Diary_0412","54":"Diary_0412","55":"Diary_0412","56":"Diary_0412","57":"Diary_0412","58":"Diary_0412","59":"Diary_0412","60":"Diary_0412","61":"Diary_0412","62":"Diary_0412","63":"Diary_0412","64":"Diary_0412","65":"Diary_0412","66":"Diary_0412"},"Date":{"0":"unknown","1":469.0,"2":470.0,"3":471.0,"4":472.0,"5":473.0,"6":474.0,"7":475.0,"8":476.0,"9":477.0,"10":478.0,"11":479.0,"12":480.0,"13":481.0,"14":482.0,"15":483.0,"16":484.0,"17":485.0,"18":486.0,"19":487.0,"20":488.0,"21":489.0,"22":490.0,"23":491.0,"24":492.0,"25":493.0,"26":494.0,"27":495.0,"28":496.0,"29":497.0,"30":498.0,"31":499.0,"32":500.0,"33":501.0,"34":502.0,"35":503.0,"36":504.0,"37":505.0,"38":506.0,"39":507.0,"40":508.0,"41":509.0,"42":510.0,"43":511.0,"44":512.0,"45":513.0,"46":514.0,"47":515.0,"48":516.0,"49":517.0,"50":518.0,"51":519.0,"52":520.0,"53":521.0,"54":522.0,"55":523.0,"56":524.0,"57":525.0,"58":526.0,"59":527.0,"60":528.0,"61":529.0,"62":530.0,"63":531.0,"64":532.0,"65":533.0,"66":534.0},"Entry":{"0":"\n\n1915\n\n","1":"\nMonday -A day of fatigues. Packing etc. Afearful hot dusty drywind - sand etc as if a very infernohad arisen to bid us farewell. Left camp about 8 PM, what a relief. Had roughmount. On canteenduty arrived Cairo about 11.30. All entrained in quick time and left at 2.30 am. Tired - the carriages presented a rather scattered appearance. Had a short sleep - arrived at Alexandria at 9.30 am\n","2":"\nTuesday - Our first work was to unload horses &baggage.Had charge of party on wharf. You can imagine it was a relief to once again drink in of the cool fresh breeze ladenwith ozonne. The harbour was full of transport craft. Went below onthe\n\nCardiganshire to have a little breakfast. It was lovely to get a snackfree from the grit and sandof the desert. One of our humouristswho happened to be one of theadvance guards arrived at the ship the evening before us and a good meal of steak, green peas etc. was placed before him. He rather upset the Purser on the ship by putting it aside and saying I cant eat this. On asking the reasonthe Purser was greeted with the reply \"Why there's no sand in it.\"\n\nAll day loading uphorses and harness etc.Baggage wasto be put on the train again\n\n- sent to our Base. We had only such articles as we could put in our pockets and our small haversack and what we stoodup in. Old soldiers cantell how things left at the Base fare - they're generally missing and you're lucky if you ever get them again but some things were a little more straightened and I found Iwas in charge of Picquet. It was a trying evening as one horse was very sickand had to be watched and I had little or no sleepthe previous night on the train.\n","3":" -Feedingup & loading\n\nwas continued and in the afternoon \"mail\" was distributed, letters from home - how sweet. A muster roll at 4.30 to see everyone was on board. After tea Ihad a shower &felt refreshed. The coaldust is a dreadful nuisance at the wharf where we were berthed. I picked out a spot on deck to rollmyself up in a blanket - I retired - that sounds a bit civilized- early.\n\n8th\n- We did not move out as anticipated - our first duty wasfeeding up in stables. Our 7th was in a fair position outwith part of the Amm Column horses.\n\nIt was so refreshing early in the morn - so differant from thesandy surroundingswe had tosuffer for the past few months. An incident reflecting on American sympathy with Germany occurred at our wharf. An American craft was berthed below us - several of the crew who were on the wharf gave 3 cheers for the Kaiser as a number of our chaps went up the wharf. It did not take long for the lads to resent the cheer & a rush was made for the Americans who were thrown unceremoniously into the harbour. This rather quenched their enthusiasm\n\nfor the Kaiser as you can imagine. In the afternoon we loaded up ammmunition from a lighter which came alongside and later on all gunnershad to go below in the hold to fixthe fuseson to the shells. While engaged there we heard that rattle of the anchor and the vibrationof the engine soon followed and it conveyed to us the welcome news that we were off. I could not tell you how glad I felt. The trumpet sounded then general fall inand we rushed up the ladder to find\n\nthe lovely cool breeze as our ship steamed out. No sand, a total absence of that hot wind - one seemed as if in paradise to once again drink in the ozoneof the glorious ocean. Wewere immediately told off to different boat stations in case of accidents etc. and we learned that the Officer in charge was our Bomb Colonel of whom etc.There was not much sea on but the Cardiganshirejust dipped her nose gently as she rode each wave. Oh to be away from the wailing lilt of the Egyptian & Arab.\n\nOf course we did not know our destination but divinedit would be the Dardanelles. The Cardiganshire is a fine steamer of the Royal Mail Lineabout 10000 tons and the mess rooms allotted to us are well laid out and the menu good. Oh that absence of sand! On board we havethe 3rd Battery of the Amm Column, our","4":" Battery Headquarters, the ArmyMedicalmen & Army Service men & a few Infantry attached to our Battery. Dr Marks &Lieut. Urquhart left behind\n","5":" - It was a delightful\n\nmorning - cool - refreshing and a very calm sea. It is surprising how we had been blessed with such good weather while on the waterpart of our trip up till now. Our No. 1 was a little seasick and I hadcharge of the Driversin stables while the Gunnerswent belowto finish off fixing fusesto the shells. We were warned off todifferent boatsin case of collision or accidentsand we had an alarm during the day. Life belts had to be donned & a rush to the various parade stations.\n\nIn the afternoon we came in sight of land - Rhodes Island - I am told and I considered we must be entering the Aegean Sea. I was again in charge of Picquet in theevening. No one was allowed to sleep on deck on a\/c of passing along some Islands the natives of who were hostile.\n","6":" -Our ship was cutting out a great pace and last night averaged up to 8 knots. Sentries were posted all over the ship & a sharp lookout kept for submarines. Routine work was carried out all day\n\nand we passed several large rocky looking Islands which stood out boldly on the horizon against an azure sky with an equally blue sea for a foundation. Late in the afternoon we came in sight of Lemnos Island which we discovered was to be our concentration point before we landed with the other forces to operate in the forcing of the Dardanelles. A minesweeper approached as our ship was turned about & steamed off in another direction. After receiving certain orders we shaped\n\nour course to a certain channel & arrived off Lemnos where we anchored. In the distance inside the Inlet behind some rock protections a number of Cruisers & Transports were visible. It was a charming view to look upon - the green ridges sloping up from the waters edge and here & there could be seen white stone buildings. Far at the back the hills or mountains we may say rose in majestic glory. I hoped that when we steamed in - which Iam sure we wld do later - we would make the acquaintance of some of\n\nthe splendid scenery surrounding the etc.Lemnos is an Isld over which there wasdispute between Greece & Turkey after the Balkan war. Italy I understand owned it once. G. Britain took possession.\n","7":" - I rose early and just as dawn broke 5 other transports appeared on the horizon and approached us guided by several Torpedo Boats. We entered the harbour about 8 PM. It was a fine space of water\n\nand made a fine protection. Inside I counted about 60 steamers including about 12 Cruisers some of which were French. I suppose such a gathering of craft had never been seen there before. Several of the Cruisers showed evidence of recent encounters with the forts in the Dardanelles. In the undulating ridges of the country ashore could be seen finepatches of green vegetation butno sign of tree life in the distance.\n","8":" - We had to have all lights out on a\/c of\n\nsome rumour that a german airship had made its appearance during the day and was observed by one of the hydroplanes attached to our Cruisers. It is lovely weather just now - crisp - cool - very refreshing.\n\n12 April - To-day all our ships boats were lowered and crewed by our lads. It was practice& exercise at the same time. We ascertained that the Queen Elizabeth who we heard had done such great work at the Dardanelles was in the harbour and had only taken a little part in\n\nthe operations against the Forts. We were told that as no Infantry had occupied the Forts which had been shelled, the Turks had again taken possession. Part of our work when landed will be to hang on to these captured Forts. A party of O.C.left today in the Queen Elizabeth to see the effect of some shelling. This harbour of Mudros is only about 50 miles from where we are supposed to land. Our Boys came back \nwith\nfull of the cleanliness of the villages ashore.\n","9":" -I was on Picquet duty last night and we had heavy rain and I had to shift my bunk from the hatch into the enclosed part of the stables. On the first parade of the morning a letter was read from General Burwood pointing out the great work before us and the privations we may have to undergo. A warning was given to conserve drinking water as much as possible when we landed. Hepointed out our efforts would go down in history.\n\nThe matter of water seems a very serious one as on board we are only allowed to have water to drink. All washing and shaving water has to be salt. We all declare we will not shave, I am already developing a beard. During the day the clouds broke & it was delightful to look over the Harbour on to the landscape. The diaphaneous blue of the hills on the far horizon and the soft purple of the hills\n\nin between. There is much that will haunt me in connection with my visit to and association with the historical relics of Egypt but where we are now has a haunting beauty of a different nature. There is not the endless sand with a hazy sun immobile - silent but the green swards etc.\n","10":"- Today Iwent ashore with a Party of our men. It was amusingin these big ships boats to see how some\n\nof our men shaped - still we managed to reach the beach without provingwe were all landlubbers. It was delightful to get ashore - the greenery of the cultivated fields - the wild flowers. You can imagine what a contrast to the desert we had been working on for the last few months. I wandered along amidst the perfume of the Popies - Daisies & other flowers which dotted the green vegetation everywhere. It was a fairy land of beauty.\n\nSeveral of us went up to one of the villages - a clump of houses you might call it. It was somewhat similar to an Egyptian village but so much sweeter. Lachna - or some such name as that - one of the Greeks said it was all the residents seem to be of that nationality. These cottages were all of stone but had red tiled roofs - very rural looking. There was only narrow lanes between and there was Greek women sitting weaving\n\nthread from the raw cotton. They were very industrious and the bobbin was never idle. They were neatly dressed and clean & so were the children who sit round. Of course we were all very inquisitive and peeped into every corner possible. We could not get much satisfaction from the Greek Folk as they could not understand English. The church was a quaint affair and to my astonishment it had a lovely cut glass chandaleer to which candles were fixed. No seat there in the church\n\nso I came to the conclusion they stood or knelt in worship. On the outskirts of this village was a stone shed into which a spring emptied itself and here it appeared to be the Public washhouse. There were stone troughs and while we stood and watched several women brought clothes up on a wooden tray & pushed them into one of the stone troughs. Most of the washing consisted of beating the articles with a wooden patterarrangement. All over the hills adjoining the cultivated fields were\n\na kind of round stone building to which is fixed a large wheel on the outside & on the wheel sails are set to drive it round. By this means a wheel inside is revolved in an affair like a capstan head & this turns a large stone to grind barley or other grain. The whole of the top of the house can be moved around so that the wheel can be set according to the wind and the sails are thus set and filled. The flour comes down a bag shoot to another bag below which is gradually filled up. You can see\n\nabout four villages around the Harbour which are much the same as the one I have mentioned. This clustering together in these villages - how like the citification that we term civilization. There were a few sheep grazing peacefully here & there - indeed if one could only blot out the ships in the Harbour - the men in Khaki -\nhow peaceful the whole scene was\none could realise the peacefulness of simple nature as it was presented in this\n\nbeautiful little spot.\n","11":" -Still waiting for orders. Nothing of consequence to-day except we lowered a boat & our mad captain had to vist another ship with Dr Marks for beds. He kept us pulling about around ships in a strong head wind & most of us doing a quiet bit of tall swearing. I'm feel I'm getting awfully regimental in duties assigned to me etc.I also feel I'm getting a bit dirty. We are here now over a week & we only get awash when\n\nwe sneak it. Salt water isavailable but you can guess how this cleans you. I have also had to sleep in my clothes since I left Mena & this is something new for me to do for such a long period. A Rumour - probably a latrine type, states Turkey is sueing for peace & has been given 8 days. It has caused a lot of discussion as to whether we shall get in a shot against her.\n","12":" - It was an eventual day as we unloaded a number of horses on pontoons and also guns &wagons. Went ashore\n\nhooked in and went for a run as if attacking etc. It was good practice for the stupendous task before us. I understand we are to be given the most important work in the land parties against the Turks.\n","13":" -Several rumours or latrines as we call them were circulated to-day . One as to\n8 days armistice been given to\na Torpedo Boat of Turks attacking a transport & 60 of the British being drowned. We took on water to-day from the Sunik .\n","14":" - It is said an old campaigner always starts out with what he stands up in and an knife opener. The young campaigner provides the changes of linen & the tins for the old campaigner to open. I am afraid I'm a bit of an old campaigner as I have very little but what I stand up in, I had to buy a sweater off one of the crew as it has been too cold here. We had a church service this evening on board. It was a\n\ntalk by Pat Hare. During the day we received certain instructions about our landing in a few days under fire & I went to bed excited over the coming prospect.\n\nMonday 19th -Last night when just going to bed I was called by a chum - Corp Turton and invited to join him in a supper of boiled Fowl &a bottle of Porter. I was not slow in accepting & we sat out in the moonlight & talked over the incidents\n\nof our lives for hours on deck. It was delightful. Ialways thought that in the Southern Hemisphere that the infinite beauty of amoonlight night only existed there but I find it even goes to much higher latitudes. One cannot criticise the authorities too severely in not publishing a bulletin of news of the war. We are completely in the dark as to any authentic news. A little water - fresh was dolled out today to wash our clothes. We were\n\nsupposed to be washing them in salt - I say supposed. Horses were taken ashore today & guns shifted from one hold to another.\n\nTuesday 20th -We were served with emergency rations today - one days meal of biscuit - hard - tin of meat & a tin contg tea sugar & bovril. These are always carried in case our ordinary rations are not to hand when we take up a position. A rumour is in the wind we leave today for another Bay or to our landing place. Everything is ready. Cholera is supposed\n\nto have broken out on the Caledonia. We were all alloted to various landing boats.\n\nWednesday 21st April -We did not leave but are still awaiting orders. At dawn the breeze blew in the strength of a gale & the sea was fairly rough even in the Harbour. We have had plenty of rain.\n\nThursday 22nd -The excitement of the anticipated leaving is to bear especially as we are being put off from day to day. Our departure is again\n\npostponed till tomorrow. Oh the packing etc.\n\nFriday 23rd -We are to leave today. This is a circular letter sent out by Sir Ian Hamilton our General.\n","15":"\n\nSoldiers of France and of the King. Before us lies an adventure unprecedented in modern war. Together with our comrades of the Fleet we are about to force a landing upon an open beach in face of positions which have been vaunted by our enemies as impregnable. The landing will be made\n\nand by help of God & the Navy the positions will be stormed & the War brought one step nearer to a glorious close. \"Remember\" said Lord Kitchener when bidding adieu to your commander,\"Remeber once you set foot upon the Gallipoli Peninsula, you must fight the thing through to a finish.\"\n\nThe whole world will be watching our progress. Let us prove ourselves worthy of the great feat of arms entrusted to us.\n\nIan Hamilton\n\nGeneral\n\nWe lifted anchoredand you can understand the thrill, excitement as we steamed out between the manyships anchored in the Harbour. Our joy was shortlived as we just got outside and down went the pick to use one our well known nautical phrases. A number of other steamers came out and anchored near us. Several of the Cruisers and Torpedo had evidently got orders to proceed right in and they passed us in all their majesty to be followed later by Transports. I went to my blankets & you can hardly call it a bunk - on\n\ndeck hoping to wake up next morning off Gallipoli.\n\nSaturday 24th -We did not leave as anticipated but all day transports passed out guarded by Cruisers & Torpedoes. The Queen Elizabeth went out in all her splendour & was followed by a long train of Cruisers etc.It was indeed a majestic sight. In the afternoon Col Rothental informed us we were to land next morning in conjunction with the 3rd InfBrigade & said etc.Turned in early as we would have to shift early.\n\n16 Torpedo Destroyers\n\nBeagle - Bulldog - Foxhound - Scourge - Colne - Chemler - Usk - Ribble\n\n4 Torpedo Boats\n\nS1 Edenmore - S2 Comredian - S3 Trewellard - Sx3 Dunluce Castlle, S4 Eddystone, S6 Santorin\n\nAirships about 4 or 5\n\nB 161\n\nF1 - F2\n\nF3 - F4\n\nF5 - F6\n\nF7 La Province -F8 La Savore\n\n4 French Cruisers\n\nAskold Russian Cruiser\n\nSubmarines\nAE2 - 86\n\nB8 - 9 - 10 - 11- 27 - 28\n\nE 14 -15\n\nTransports\n\nB1 Caledonian - B2 Caledonia\n\nB3 Alaunia - B4 City of Edinburgh\n\nB5 Southland - B6 Aurania\n\nB7 Ardania - B8 Sussex\n\nB9 - B10\n\nB11 Vaderland - B9 Arragone\n\nB12 - B13\n\nB14\n\nNo. 1 Soudan,Hospital Ship\n\nNo. 1Guildford Castle, Hospital Ship\n\nNew Zealand\n\nV1 - V2 Braemare Castle\n\nV3 CawdorCastle - V4\n\nV5 Ayrshire - V6\n\nV7 - V8\n\nV9 - V10 Royal George\n\nH1 Arcadian - H2 Hussar\n\nA0 Osmaniah - A1 Ionian\n\nA2 Malela - A3 Deronha - A4 Suffolk\n\nA5 Hizan - A6 Pera- A7 Hessen\n\n8 Lake Michigan - 9 City of Benaur\n\n10 Derferlinger - 11 Minnewaska - 12 Novian\n\n13 Mashobra - 14 Galeka - 15 Clan Macgillivray - 16 Indian - 17Atlantian - 18 Cardiganshire\n","16":" Karros - 20 Itrea - 21 Armadale\n","17":" Achaia - 23 Stonus - 24 Annaberg\n","18":" - Haida Pascha - 29 Seang Bee\n\n30 Australian - 31 Seang Choon\n\n32 Californian - 33 - 34 Surada\n\n35 - 36 Anglo Egyptian\n\n37 Clan Macorquodale - 38 Hindu\n\n39 Hymettas - 40 Saldanha\n\nAgamemnon - Amethyst -Prince of Wales - Doris- QueenInflexible - Implacable - Lord Nelson -Queen Elizabeth - Triumph - Swiftsure -Ark Royal - Imogene - Majestic -Blenheim - Cornwallis - London -Bacchante - Golden Fleece - Canopus -Prince George - (Ocean & Irresistable sunk)\n\nDublin Fusiliers - Fus - RoyalIrish Royal Munsters -Inniskillen Fus - Bord Regt -S Wales Bord - Kings O SB - Essex Regt - 6 RoyalScots - Hampshires - Worcesters -Sth West Riding E - 2 Lowland E\n\n\n\n87 - 88 - 89 RAMC \n\n147 RFA \n\n10 - 97 - 368 Bty - 6 Guns\n\n12 Bty RFA\n","19":" - 26 - 97 Bty\n\nV L - T Bty R.H.A. \n\n460 Howitzer Bty - 12 Guns\n\nB Bty -6 Guns\n","20":" D.A.C. \n","21":"\n\nA day of great things.\n\nI woke about 1 am just as we were moving off. I turned over & had a few more hours sleep & about 4 am I was up again & the distant rolling of the boom\n\nof guns filled the air as we proceeded, it became more marked & boom boom boom etc. till we could see the flash of the guns from the warships. We stood off the Peninsular while a perfect hell of fire was poured ashore on to the Turkish Forts. It was certainly a sight that we will never forget. We were to land in the Zeros or Saros Gulf side & the British Inf & artillery were to attack inside & the French on the Asia Minor coast about Kum Kale vicinity. With planes we could view the land which looked cultivated in places\n\nIt was a most favourable morning for operations & we are all longing to know how the Infantry fared on landing etc. As we came nearer in shells from the Forts fell about 100 yds off us and our chaps were inclinedto treat the enemy's rangingwith contempt but it was not long before the shells fell all around us. The Howitzers shrieked over us - just at the stern of our ships and a few yards ahead dashing the spray feet into the air. The positionproved too warmfor us and we had to shift out also the Cruiser\n\nQueen and several other ships. One shell fell at the side of a Torpedo near us but luckily no one was hit. The H.M.S. Bacchante & Triumph appeared to be doing most of the attacking of the forts & we had several monoplanes overhead & acaptive balloon. We were still waiting for orders at lunch time amid the rolling & booming of the guns. My baptism of fire was an experience & it is wondered how instinctive we ducked as if to escape the hissing screaming monsters of death. We went in closer in the afternoon & we witnessed one\n\nof the most murderous fires possible, shrapnel was rained on our chaps persistently. We could only look on & see all the manoeuvres. It was a huge cliff of sand & rock a few yards from the shore & from here our men had to land & scale the heights driving the Turks before them. We were told by the sailors who took the men ashore that it was a wonderful charge. Nodoubt details are well known by this etc.At 4 PM we were preparing for shore etc. but we ordered to 'stand fast' after 2 Pontoons had been loaded.Just at sundown our airship had\n\nlocated 2 Turkish Batteries & several of the warships opened an incessant fire. The din was dreadful & our ship shivered from stem to stern. We were close in & one fort again opened fire on us showering shrapnel all round us but no one was hit. One could only hope that the sun would set on such an awful day to rise again with the calmness of nature as we knowher. I was on Picquet & had very little sleep. We had a visit from the Naval officers & all hands ordered to have boats at stand bye.\n","22":"\n\nThere was an\n\nincessant fire all night & a new daydawned with the boom boom of guns. As usual we had plenty of rumours aboard. We got orders to land our guns only & went ashore in Pontoons towed by naval pinnaces. Only gunners went as no horses were taken & we got a big cheer as we left the ship. I was in the second tow & when we got near the shore the enemy commenced to rain shrapnel over us. We had to take cover anywhere we could & as the pinnace was ordered to \ntake cover\ngo back to ship\n\nwe were left tied up to a buoy. There we stopped till recovered later by another Pinnace. Shrapnel still rained when we were ashore and it was decidedly interesting indeed. We worked like niggers & soon had all our material ashore. It was a matter of getting into the water boots, leggings &all & I had to let everything dry on me but no doubt the excitement kept me warm & I felt no ill effects. I was amongst a party who had to go up to the top of the ridge & start gun pits. We strolled up through the brush wood & in one part we had to pass over a piece\n\nof green vegetation. We were just on the edge of it & one of our men was shot through the leg (Eagle). Bullets were \"pinging\" all around us up till about 4 PM. Wewere at our gun pits & orders were revd to stop & take the guns further up on the ridge. This was right on the firing line of trenches a most unprecedented action in warfare. We did this just on dark & had our guns in position in a rough pit to fire that night.\n","23":"\n\n\nThis was a day in hell. We started firing on to the enemy's trenches on a\n\n\n\nfar ridge about 4 am & at the morning I had the pleasure if one could call it that of blowing up Turks. I could see the unfortunates dropping after the bursting of the shells. We did splendid work & the Infantry were greatly cheered. The sad features of war presented themselves very forcibly to me today. A poor Infantry man came up behind our gun & asked for the Colonel & a directed him & he stepped forward & immediately dropped with a bullet wound in the head & lay moaning & bleeding profusely. Later on our\n\nSergeant was shot while standing at our gun. Bullets pouring all over us. All the ground in front of us was covered with accoutrements & dead men here & there. The sun went down on the scene of carnage in its usual smilingway. We were up all night peppering away & as one longed for the night so we longed for the mornto break. In watching across the battle field in the early morning hours you get a fit of nerves & every minute you feel the enemy is going to charge.\n","24":"\n\n\nAnother day of carnage - shells - bullets & every possible instrument of death everywhere. We shelled the enemy's trenches all day with good effect. In the evening anattack was expected but it did not eventuate. I'm afraid a lot of our men fire at shadows in the evening. It was a bitterly cold night.\n","25":"\n\nAfter 3 days in our gun pit you can imagine the state of our apparel & person dirty - torn - tired etc. I lost all my blankets, mess tin\n\n& kit. Everything was left down at the foot of the ridge, things were taken by anyone who required them. Inthe mad rush that our Infantry made on the first day they dropped their kits as they went after the Turks & today several parties went out in front of our firing line& secured a number ofseveral Turkish ones. On inspection we found that they were well equipped & did not suggest that Turkey was in any way badly off\nneed\n financially. Through our glasses we could see several dead men about 200 yds in front.\n\nNo one can imagine the horrors of war until they have experienced it. Today was easier for us as our firing seemed to have had good effect. The Cruisers which were helping us from the harbour put in splendid work infiring over us right on to the enemys ridge beyond. The enemys trenches were just from 500 yds to 900 yds from us but at times they moved up to 200 yds in gullys & from there continually sniping at our men with disastrous effects. The Infantry were very pleased with the work we were doing & praised\n\nour 7th Battery in flattering terms. This afternoon we putour sentrys out so that we could get a little sleep& retire on to the beach for a wash - a luxury just now as my face had not tasted water for over 3 days. On going to the beach,Bullets were flying all around me & it is remarkable how calous one gets after a few days familiarity with warfare.\n\nThe swim was very refreshing notwithstanding the bullets fell around. One man was shot while washing at the waters edge in the morning.\n\nAfter washing I went along to the quarters where our","26":" were quartered & talked to Olly G & Lieut Charlie F. I was told about half of their men were wounded or killed. Both Webbs were wounded & Vic Saunders reported as missing.\n\nWhere we landed is called Kaba Tepe .\n","27":"\n\nI should imagine that if we ever get back to civil life we shall all have the\nhump\n. Digging stooping down - while on your knees in every conceivable position - creeping along bent down. Our Colonel about whom I have often written has been up to his old tricks.\n\n\n\nWe built our gun pit and also a sleeping apartment with a trench leading to the pit. Our worthy Col coolycame along & took possession of the apartment & trench for himself & staff. He never asked my permission & he stopped men going out through the trench to an outpost whichafforded protection in leaving the firing line. He wanted our sand bags etc. Gets.\n\nLast night was fairly quiet & we had the opportunity of getting a little sleep.\n\nAs far as accoutrements areconcerned things are a bit strained.We are even wearing Turkish items such as coats. Our trenches\n\nare some miles in length & orders are passed along etc.\n","28":"1915\n\nOlly G came into the trenches near us last night. We had a quiet night although we had a general alarm & at dawn they commenced to shell us & one came a few yards from us. We had some splendid shooting at the Turks as they came along the ridge. As far we can learn we are to be relieved by another Battery today.\n\nThe 9th Battery relieved us about 10 am & we went down to the beach & greatly enjoyed a dip. We then went &dug ourselves in on one of the\n\nridges facing the beach. After tea I went along the shore onbeachfor water & about 2 miles along was a scene of animated life. Hundreds of men & mules landing. There was thousands on the beach ridges - some making their dugouts others cooking- carrying to & fro all this while shells were bursting & bullets flying everywhere. One shell burst a few feet from me & a mule attached to a team going up the ridge was shot & fell down carrying the whole team down. I was on the path & had to jump on to the top of the cover to an\n\nIndians\ntent\ndug out - Fortunately there was no one in at the time. All these beach ridges are covered with fine shrubbery & wild flowers. Shrubs like holly etc. As I passed the Hospital on the beach there were dozens of wounded being treated.\n","29":"\n\nLast night I had a delightful rest nearour dug out, Corp Coleman, Bob, TedHowarth & myself together wenton the side of the ridge about 200 yds from the firing line. How pleasantto be able to remove boots & socks after about 8 days near the fightingand shelling did not interfere with our repose.\n\nAfter breakfast I went down to the beach - had another swim. Here I might say a tremendous amount of our causalities occurred through snipers hidden in the ridges near us & the beach. Several have been sighted& dealt with also German & Turkish spies. A number of prisoners have been captured & I saw several working for us under a guard.\n","30":"\n\nStill shelling on our ridge & on dug outs. Every day at dawn & sunset we get a fusilade of shrapnel & bullets over & around us. It ismarvelloussome are not wounded. While up on the gun last week the village of Maidos was set on\n\nfire by the naval guns & it burnt for several days. I am having all the dips in the brinyI can- one can hardly imagine that we could do this a few hundred yards from the firing line\n","31":"\n\nOur orders were to move back to our gun pits in the afternoon & I took the opportunity of having a good swim & getting water. We had about 1½miles to walk to getthe water sent ashore from the ships. Soakage water from the ridges could be obtained in several places near the beach.\n\nAt 4 pm we were called up to our gun pits again & were soon into harness observing the enemy. An attack was made on Kaba Tepe by the Naval Marines\n\nbut the place proved too warm & they were repulsed with 8 killed & 20 wounded.\n","32":"\n\nHad a quiet night last evening. While in charge of watch in pit Charlie Forterine came &we had a long chat.\n\nI observedthat just at the front of our gun in a prettyvalley the whole of the sward was covered with red Poppies. The contrast of the green & red was very charming & I wondered if the hues of the crimson had been deeppened by the blood spilt on the ridges in the immediate vicinity. I had a raspberryade today - made up of water put in a jam tin we\n\nhad just finished. The din of battle went on all day but we ate drank & slept as if it was a daily occurrence. Such is the habitof life.\n\nFinished up with a very warm few hours in the afternoon. We were shelled on all sides & our Col Rosenthal was wounded & also Major Burgess while in Headquarters Dugout. Sent us orderto search ridge.\n","33":"\n\nAnother very warm day for us. We were shelled right & left & had to retire to our dug outs. One shell broke the wheel of our gun - others were right in front a few yards. One came into our dug out etc. It was a veritable inferno. Capt Leslie\n\nknown as our mad captn was wounded badly alsoseveral others. The enemy seemed to be firing on us from Kaba Tepe & I spotted several running intoa dug out & we promptly put several shells there. We put in the night digging our gun pit deeper etc. to get more protection from the enemy's fire.\n\nFriday","34":"\n\nWe had it quiet till after dinner when the enemy's artillery gave us a warm time. Shells all around us some a few yds in front & at eitherside but no further damage. Down on the beach a number of horses were felled also Corp Crowther while sleeping in his dug out. Capt Leslie passed away. One feature of this war is the Hand Grenades used. One thought that this weapon was obsolete. The Turks\n\nthrow them into our Infantry trenches etc., the bursting of the bombs have done a lot of damage.\n","35":"\n\nHad a bad night. Very little sleep. Infantry men do not appear to realise their responsibilities. Asleep in trenches etc. About 10 am enemy opened their artillery on us & gave us the warmest time we have had yet. Shells bursting all around us & one landed in one of our guns & broke our trench & gear. We had just left the pit to be relieved by","36":" Battery for afew days. The Engineers were just at that time making a road to get our guns out but luckily no one was hit. Several shells blew up in our pit. There was a number of casualties on the beach. In\n\nthe afternoon I saw Olly Gray. Later on had a swim down on the beach. What a relief to once more take ones socks off & clothes.\n\nSunday 9th\n\nLast night we were woken up by a big explosion, 5 - 9th Infantry men were killed supposed to be caused by shell being left in an abandoned gun pit. After Breakfast Corpl & I walked down to the beach for fresh water. The ripplingnoise of the waves as they beat in on the sandy ground was somewhat deadenedbythe fearcebursting of the shells overhead. Four unfortunates were hit just near us- one had his earsblown off. I cannot understand how our leaders do not make an attack\n\nin anticipation of advancing. Something seems tobe wanting.\n\nJust now as we can wander round our lines & camp it is fineto look into the toughhard bitter faces of the old soldiers and what a contrast to the pink faced boys who are on their first campaign. How thisroughness of our war breeds comradeship.\n","37":"\n\nIt is very like rain & in fact it did sprinkle lightly last night. I was not too well - Dioarhea. Enemy bombarded us severely in the afternoon.\n","38":"\n\nWent back again to the gun pit.\n\n\n\nAvery quiet day. Commenced to rain in the evening.\n\nWednesday","39":"\n\nA dirty longmucky day. Mud sticks like glue. It was extremely cold - wind blowing overfrom off the snow clad mountns. We had orders to be ready to open fire at any moment - our gun to bombard the enemy's positions. It fined a little about 1 PM &we commenced to shell a large house in the distance thought to be a headquarters of the Turks. We fired about 30 rounds & hit the place about 6 times but the enemy soon had their guns trained on to us & gave us a warm\n\n\n\nreception. Our gun was badly damaged & I had the misfortune to be wounded. Corp C. &I were together & I was suddenly lifted off my feet & thrown heavily to the ground. What happened I could not say as I was bewildered & hardly able to speak. My left hip & leg felt gone & I crawled thusup to a dug out when the Dr - Capt Marks arrived. Corp C.found he was also wounded with a severe gash from shrapnel. In pulling myself together I found I was more bruised than wounded. My trousers were torn & pieces of shell had pierced from\n\nankle up to my shoulder blade. The hip & side of leg getting most of the injuries. One piece of shell cut through my boot on the right foot & made a wound there. In all I had 12 cuts Dr M. treated me & Corp C. We were then carried down to the Ambulance tent & afterwards I was carriedon to the Heang Choon , Corp C.going on to the Gascon Hospital Ship. I cannot speak too highly of the way the AMC stretcher Bearers & the Doctors & their assistants treated me. They did everything that it was possible to do & were most\n\n(\nThe thought struck me of what grand noble work is done often \n\nattentive & kind in every way. On going over to the ship anchored out I was laying on a stretcher along side other wounded & the rumbling of guns went on heavier than ever.\n\nI was put in a bed on the ship & sleptfairly well during the night.\n","40":"\n\nWoke up stiff & very sore & with hopes not to be long in my bed. By dark I was very tired of bed & laying on my back. I could not move on one side or the other as I could not\n\n & we only realise & appreciate its value when we require it ourselves.)\n\nlift my left leg. I had little or no appetite. All day cases were brought on board - the Seang Choon was only used for the first casualty cases - all the very serious cases being sent on to the Hospital Ship \"Gascon\". In the evening all lights were turned out as submarines ofthe enemys were reported in the neighbourhood. Our ship unfortunately did not have the lighted upcross to carry.\n","41":"\n\nStill very stiff & sore. Slept very little. It is about the first time for many years I have lainon my back for a day. The Turks were still reaping a great harvest as victims still arrived\n\nfrom the shore.\n","42":"\n\nStill in bed & unable to move much. I & others were told that we were to go on to the Gascon - all cases who were likely to be bed 14 to 21 days. The moving was awfully painful to me up &down the gangways in all kinds of positions. On arrival on the Gascon I found how much more convenient softer beds & a sweet nurse in charge. It was like heaven. My wounds were dressed etc. On being hoised upthe gangways the first scene to greet me was about 5 unfortunates laid out in Union Jacks.\n","43":"\n\nAnother day in bed. Our ward was filled up today. A C.of E. clergyman held service in the afternoon. Saw about 8 unfortunates wrapped up in Union Jacks consigned to another ship to be taken out & consigned to the deep outside.\n","44":"May\n\nLast night I essayedto get up & visit latrine. I managed fairly well but had to get help to get back. My leg will not bear too much weight & the muscles contract on lifting it. At 1 PM our anchor was weighed & we understand we are bound for Alexandria.\n","45":"\n\nBy the gentle throb of the\n\nengines our speed does not seem very fast. Of course one lost the pleasantness of the trip by being down in a ward surrounded by unfortunate sufferers. The weather seemed beautifully calm as the \"Gascon\" was very steady. In our ward we had 97 patients & we are No. 6 ward, how many more I do not know. I heard General Bridges passed away on board - his health was the result of an explosive bullet. It is in a certain sense amusingto seethe men in our ward hopping about here like kangaroos, others hobbling on crutches. I feel fairly well now except stiffness.\n\nWednesday","46":"\n\nWe expect to arrive at Alexandria this afternoon\n\nWe got orders to dress & it was a general scraping up of kits for those able to hop about. There is some talk of us going on to Heliopolis. We arrived at Alexandria at 5 PM. The same old familiar scenes of Egypt greeted one as we approached the wharf & I went in the 2nd load in a motor ambulance car & to our surprise were wheeled off to some hospital & found it was a Greek Institution. It was one of the funniest experiences I had ever had. We were all bundled into one operating room & bandages taken off. I dodged\n\nthe operation. One could not explain that wounds had been dressed that same morning. It was all move & bustle. They meant well but it was funny. We were bundled into a bath of ammonia & dressed in loose costumes & then put into bed. Nurses on every side.\n\nOne patient who was already in the institutionstated that he had asked for a pillow & one of the Greek wardsmen brought him a bed pan etc.\n","47":"\n\nIt is certainly an experience this noisy jabbering of foreign tongues. Our good Greek folk could not do enough for us.\n\nI did not sleep well last night. There is an old lady in charge of our ward - she is splendid but is always wanting to tuck you in. She is wonderfully nimble although she looks 70 years old. During the night we were woken to know if we required etc. They had us all awake about 4 am to wash us. I feel pretty well except for the stiffness of my leg. This hospital is immaculately clean & all the lady nurses apparently honorary are fluttering all around us all day & sheetsare pressed down, creasedout every half hour. The girls & women folk seem\n\nlike Society Ladies and chatter. We get lots of Greek visitors who generally give us sweets etc. General Maxwell was in today & talked with each of us.\n","48":"\n\nWhen we go to get wounds dressed there are about a dozen assistants - all jabbering around you - they are not gentle. It was a quiet day & I am getting about a little.\n","49":"\n\nA quiet day. Several strolls in the garden.\n\nPlenty of visitors. Scout Boys etc. Five fellows, Harry Turton & others called.\n","50":"\n\nAnother day in the hospital. They are not by any means gentle in dressing wounds etc. Les Pullen, Ted Carseldine etc.\n","51":"\n\nIn the afternoon as more casualties had arrived some had to be pushed out and I was one of the number. After dressing and waiting we were taken on a motor out to the Mustapha Convalescent Hospital about 4 miles out of Alexandria on the ocean beach. The run out was fine but the camp does not\n\n\n\nappear too inviting. It is all on that fine dustyground. We were issued with blankets, Towel etc. and assigned to different tents. I fell among the Phillistines. In my tent there was 11 British Tommies, I was the only innocent Australian. It was late after we had a little tea & I went to bed which was a mattress on a canvas covering on the ground. It was fairly comfortable and I lay half awake for some hours while the Tommies argued on military & other questions. I enjoyed listening to the drawl of the different shires - not two seemed to talk the same - I must say two of the number were brawlyIrish sons.\n\nTwo rolled home very late - they rolled mind you - walking was out of the question.\n","52":"\n\nWoke up early and ferreted round the camp till I found the wash place. In the camp there are hundreds of tents with convalescent cases. Our meals are served under a large open frame work building covered with canvas. Each tent has its table apportioned & mess orderlies take turns to get food from the cook House. There's plenty of bread, jam, Tea & meat. I had a shave, first for 2 weeks and was\n\ninspected by the Dr at the dressing tent about 11 am. I decided to go over to the Zihiriah Camp where our drivers are camped & I walked over about noon. It was very hot & dusty and I was glad to get there where my old comrades gave me a good welcome. They could not do enough for me and as I only had what I stood up they gave me such articles as they could.Everyone wanted to do something for me.Sam Gorlabeck ,I must especially thank also Bluey Youngman, Fred Harman & Corp Turton &Lieut Hodgerswho was in charge of our men,I cannot speak too highly, hewas very kind & told me of his endeavours to secure all of our\n\nwounded men of the Battery. Some Pay. In all likelihood he would get some of his own money from London and distribute it. Corp Turton & Alf accompanied me back to my tent at Mustapha - it was about a mile from Zihariah.\n\nThat evening Iwas greatly amused at the Tommies in our tent discussing how hard it was to understand some of the shires & their British dialects. The discussion appeared to be against Newcastle folk who some said were half Scotsmen.\n","53":"\n\nOne of those dreadful days in these cursed land of\n\nEgypt. Hot winds dusty and making it unbearable. I was glad to welcome the night when atmospherically the conditions improved a little. Bathing in the scorching summer sun etc\n","54":"\n\nAnother hot day. Can one wonder that any conditions - even the land of bullets & shells - is preferable to this. I went down to the beach todayand had a dip. I could not swim but just dipped myself in.\n","55":"\n\nAfter the Dr inspection, I dressed and stolea trip into Alexandria. I say stole as no leave is granted in our camp and one has to take\n\nFrench leave. The Police stopped me at the back gate through which I went and asked me if I was one of the convalescents and Isaid no I was from the horse camp. I had to say something & he took my word and I caught a train and I enjoyed the run into Alexandria. It is a fine little Town and I consider much cleaner than Cairo. I went to the Greek Hospital & saw the chums who were there when I was in the place. Took them a bottle of whisky etc. Had a good meal. Sent parcel to Mum. Visited Presbyterian Mission. I think the Train Service a splendid one. There are many\n\nfine gardens, charming Villas etc. P.Hodgers sent me a £1. Saw Les Bumpus& Ken Stewart.\n\nSaturday\n","56":"\n\nHad a dip in Briny. Srgt Braithwaite called.\n","57":"\n\nLes Bumpus & Ken Stewart called - a quiet day.\n\nMy opinion of the Convalescent Camp is not a very good one. There is a certain don't care attitude towards the inmates & as far as my impressions go it appears that it is a crime to get wounded. In this place we get enoughfood & there is\n\nlittle or no provision made to provide reading matter. There is aChurchArmy Tent in which are a few papers & writing materials. No leave is granted to any inmates & no pay given. It is the hardest thing in the world to get any item of clothing issued. The officers in charge do not seem to bear any love towards the Australians. I think we have too much of the independant spirit for most of them. They do not get that servile deference which many of the British Tommies have towards them.\n","58":"\n\nIt is much cooler today. Bumpus & Ken Stewart called up\n\ntoday.\n\nFinish letters home etc.\n\nHad a walk in Gardens with D Vernon. The lovely sweet smell of the honeysuckle, the Phlox, the Gladioli etc. What memories it brought back to me of dear old Qld - The fine Geraniums etc.\n\nPolice Band played at our grand camp every Tuesday & Thursday afternoon & made a pleasant break in the monotony of our hospital life.\n\nTuesday","59":"\n\nMy leg is feeling very fairly\n\nwell now although I'm afraid it will never be as strong again etc. Went out to city and posted belt etc. to Mum. Then took carriage out to Ras el TinHospital & saw Tom Braithwaite & Ted Coleman. Had a great chat with Teddy Coleman. Hospital lovely position on ocean edge, Lighthouse & old Forts etc. Alick Greythere. Came back to town & went to Hospital Ship Delta, saw Charlie Webb who was off to England.\n","60":"\n\nAlexandria compares well with Cairo as to cleanliness etc., of course it is scoured\n\nwith the ozone of the ocean etc.\n\nThursday 3rd June\n\nA swelling near one of my wounds & feels like a piece of shrapnel lead\n\nWrite 2nd letters to- Mum - Allan - Eric - J. Barr Phaire - Annie Elliott. Mrs Welbrie& Charlie - Mrs Aulebrooke.\n\nWrite","61":" letter to - A. Elliott & Eric - Pansy - Will McKean - Allan - Mum - Brionie Salen - Babe - Ern Faulkiner - Barr Phaire, Mrs Webb - Wildhaber - Harry - Maude - May - Flo & Talia - MissStewart - Barker - Fred Dickson - Woodward - Alonga, Fodens- Poole - S Russell - Douglas Hand- W Cato.\n","62":"\n\nA trip to Town etc. Egypt bathing in her scorching summer sun. Sent letters etc. Met Sergt Stewart, came home late - found they hadmoved me to another Tent A3 in place of A10. A number of my tent chums left that morning to be placed on board a hospital ship as assistants. They were all cases to be discharged later as not fit for service etc.\n","63":"\n\nNothing fresh. New cases arriving each day and batches leaving for the Base Details.\n","64":"\n\nFred Harmancalled up, went train ride and also out to Carver's Oasis. Lovely garden & residence.\n","65":"\n\nQuiet day. Ted Coleman arrived.\n","66":"\n\nKen Stewart and Les Bumpus left. Ted Coleman & I went down to Base. Good surf bathe. Muscles of leg still contract especially when overdoing or descending incline.\n\n"}}