{"Document Name":{"0":"Diary_0090","1":"Diary_0090","2":"Diary_0090","3":"Diary_0090","4":"Diary_0090","5":"Diary_0090","6":"Diary_0090","7":"Diary_0090","8":"Diary_0090","9":"Diary_0090","10":"Diary_0090","11":"Diary_0090","12":"Diary_0090","13":"Diary_0090","14":"Diary_0090","15":"Diary_0090","16":"Diary_0090","17":"Diary_0090","18":"Diary_0090","19":"Diary_0090","20":"Diary_0090","21":"Diary_0090","22":"Diary_0090","23":"Diary_0090","24":"Diary_0090","25":"Diary_0090","26":"Diary_0090","27":"Diary_0090","28":"Diary_0090","29":"Diary_0090","30":"Diary_0090","31":"Diary_0090","32":"Diary_0090","33":"Diary_0090","34":"Diary_0090","35":"Diary_0090","36":"Diary_0090","37":"Diary_0090","38":"Diary_0090","39":"Diary_0090","40":"Diary_0090","41":"Diary_0090","42":"Diary_0090","43":"Diary_0090","44":"Diary_0090","45":"Diary_0090","46":"Diary_0090","47":"Diary_0090","48":"Diary_0090","49":"Diary_0090","50":"Diary_0090","51":"Diary_0090","52":"Diary_0090","53":"Diary_0090","54":"Diary_0090","55":"Diary_0090","56":"Diary_0090","57":"Diary_0090","58":"Diary_0090","59":"Diary_0090","60":"Diary_0090","61":"Diary_0090","62":"Diary_0090","63":"Diary_0090","64":"Diary_0090","65":"Diary_0090","66":"Diary_0090","67":"Diary_0090","68":"Diary_0090","69":"Diary_0090","70":"Diary_0090","71":"Diary_0090","72":"Diary_0090","73":"Diary_0090"},"Date":{"0":"unknown","1":1922.0,"2":1923.0,"3":1924.0,"4":1925.0,"5":1926.0,"6":1927.0,"7":1928.0,"8":1929.0,"9":1930.0,"10":1931.0,"11":1932.0,"12":1933.0,"13":1934.0,"14":1936.0,"15":1937.0,"16":1938.0,"17":1940.0,"18":1941.0,"19":1942.0,"20":1943.0,"21":1944.0,"22":1953.0,"23":1954.0,"24":1955.0,"25":1956.0,"26":1958.0,"27":1959.0,"28":1960.0,"29":1961.0,"30":1962.0,"31":1963.0,"32":1964.0,"33":1966.0,"34":1967.0,"35":1968.0,"36":1969.0,"37":1970.0,"38":1971.0,"39":1972.0,"40":1973.0,"41":1974.0,"42":1975.0,"43":1976.0,"44":1977.0,"45":1978.0,"46":1979.0,"47":1980.0,"48":1981.0,"49":1982.0,"50":1984.0,"51":1985.0,"52":1986.0,"53":1988.0,"54":1989.0,"55":1990.0,"56":1991.0,"57":1992.0,"58":1993.0,"59":1994.0,"60":2002.0,"61":2004.0,"62":2005.0,"63":2006.0,"64":2007.0,"65":2029.0,"66":2030.0,"67":2031.0,"68":2032.0,"69":2033.0,"70":2034.0,"71":2035.0,"72":2036.0,"73":2037.0},"Entry":{"0":"\n\n","1":" No 8 Diary\n\nAfter breakfast I reported to the Orderly Room along with three others to proceed to the Hospital at a Prisoners of War Camp to pass the Doctor for Health Purposes at 9.30 and at 10 am we left and after 20 minutes walk arrived at the Camp and after each one had stripped off and satisfied the Dr. we had our Embarkation Papers signed, and returned to the Camp, and after Dinner the four of us left in a van with an Engine for Conchil le Temple Station three Kilos away at 2 Pm and arrived there at 2.20 and at 3 Pm. The Train arrived and soon we were off towards Calais, arriving at Boulogne well on time. The train pulled up alongside of the Station and another Engine was coupled on at the rear and in a few minutes left at 5 Pm and made a good run arriving at Calais at 6.30Pm when we detrained. The Military\n\nPolice were calling out, \"All men for the rest Camp to fall in, this arrangement did not suit us, as we desired to have a good Hot Tea in Town before going to the Camp, so we \nde\n dodged them by getting behind some carriages, and went out through the Goods Yard Gate, being bailed up by a French Gendarme. I spoke to him in French that we were Railway Men proceeding back to the R.O.D Depot for duty and he was satisfied and away we went up the town, making first for the Salvation Army Hostel where we had two Sausages and Potatoes and Tea, as we all were very hungry, we obtained a second helping which was 1 franc 50 centimes, making 3 francs \nfor\n for the \neach\n two serves, after coming out, one suggested that he could do with more, so we decided to go along to a French Cafe, and we each ordered two Eggs and chip Potatoes, which was very nicely cooked and each a small Bottle of Stout, this second Tea cost each 4 ½ Franc’s making 7 ½ Franc’s for our Tea which\n\nwe all enjoyed & had sufficient, it being now after 8 Pm we went for a quiet stroll making a few purchases and at 9 Pm we enquired our way to the Rest Camp, being shewn by a Sergeant Major and after 15 minutes walk arrived at the Camp and after a lot of winding about between the huts we eventually arrived at the Orderly Room and reported. This Camp is built on level ground and very large, Huts built of wood everywhere, one can easly get lost walking about, we were piloted by an Orderly for 3 Blankets and was given two chits one for Tea and one for \nSupper\n Breakfast. After obtaining the Blankets and being shewn the Hut, we all went around for a Dixie of Hot Tea and returned. The Hut was being filled up fast, with Men going on leave, and all hands started putting their Blankets down and turned in for the Night. I did not undress and laid on two Blankets, with one on the Top of me with my Great Coat, making a Pillow of my Boots & Leggings with my Cardigan & Muffler. \n\nAs it was good weather I slept very well only being disturbed by the Lads coming in by an early Leave Train from Belgium once, so at 7 am all hands were up & rolling up the Blankets and returning them to the Store, we paraded at 7.45 for Breakfast, having a large number of men going on Leave, I mist the first serve and had to wait until 8am when I managed to get a seat and had a Piece of Bacon, Tea, Bread & Butter & Jam, At 8.30 we were paraded and marched off to the Boat, which was only about 10\" walk. On reaching the entrance to the Wharf we passed through a Turnstile where our Passes were stamped and away along the Wharf, receiving two small Buns each for the voyage, and then down underneath showing our Passes again and receiving a card to put our Name & Nos & so on to be handed when coming off the Boat, Once on the Boat, each man was handed a Life Belt, for the Voyage, and made ourselves comfortable for the Trip. On looking \n","2":"\n\naround to see where we were, \nand\n I found out that we were alongside the Wharf opposite Calais Maratime Station, and the name of the Boat was the \"Arundel\" a Twin screw Boat of about 2000 Tons. At 9-15am all was on board and we left for Blighty. The Weather was cloudy and a little rain but no wind, so we had a good trip over. We did not know if we were making for Dover or Folkstone, anyhow after 1 ½ hours steaming at about 20 knots, and going through Mist, we arrived at the Wharf and it was Folkstone, we all were soon ashore and away along the Platform & up stairs and still continued on and eventually arrived at the Train and soon was aboard, At 11-15 am we pulled out and away, On the journey we passed through several long Tunnels, and in one long one the Train almost came to a stand, and we were somewhat alarmed, being an Engineman myself and the Train was moving steady I passed the opinion that repairs to the line\n\nwere being effected & the Train had to go slowly. After a while we passed through and away, going at a good rate from 40 to 45 miles an hour passing through some nice Scenery and beautiful Homes, which I always enjoy observing. We arrived at Victoria at 1.30 Pm and the Ausie’s were lined up and marched to Headquarters at Horseferry Road to be registered and receive our cheque also a change of Clothes and a Bath if necessary. I did not require either and after handing in my Pay Book, I received £4-10-0 which I was in credit and an advance of 2-10-0 making £7.0-0 for my Leave, with instructions in my Book only to receive 10 Francs a Pay until the £2-10-0 was made up. I then took my Departure and along to the Y.M.C.A close by for a Hot Dinner it being now two Pm. As were were somewhat hungry we enjoyed it, costing each 1\/6 for 3 courses. I here said Good Bye to my Pals and made for the Union Jack Club at Waterloo to book a Bed, but\n\nwas disappointed, as all Beds were engaged, so after a Wash & a shave and clean up I had some Tea and made my way to visit my Sick Sister. After the usual inquiries from the Police I eventually found the Street and Home, and soon was shewn into the Room, My Sister was quite pleased that I managed to get over, and my visit brightened her up a lot, I spent the evening with her, and was offered her flat as it was not occupied which I accepted. I said Good Night to her arranging to stay in London during my leave and seeing her each day. I then went back to the Club for my Valice and started out for Maida Vale, as it was not to late, I made a good journey and after arriving at \nthe\n my destination, I soon found out the House and introduced my self to the Caretaker and my flat was ready for me. It contains four rooms and every convenience’s, one is the Sitting Room and has a piano which I intend having a time on now & again. My word \ndid\n I did enjoy\n","3":"\n\nmy first night’s sleep in a beautiful large Bed with clean white sheets, after my long journey, it was grand after for so long sleeping between Blankets and not too clean at that. I awoke at 8 am \nafter\n feeling very refreshed and dressed & shaved and had a good hot wash, and then for a time for a half an hour on the Piano which I always enjoy. After leaving the Keys for my Room to be attended to, I went along and caught the Tube to Holborn where I intended having my Meals at the Y.M.C.A Rooms, which is very reasonable. The Ration Meals costing from 8d upwards according to what you desire. The Ladies there give their services voluntary and one is made very welcome and everything is served up well cooked and very clean. I must place on record my hearty appreciation of the kindness and attention shewn to the Troops on Leave, by these Ladies and Gentlemen who\nm\n in some cases have been assisting for over 3 years, not only in this Club but in every one \n\nI have had the pleasure of visiting whilst on leave. It was a promise of a nice day and \nI\n after Breakfast I went out and caught a Bus for the Strand. What a vast difference in the Traffic to my last visit last June, The War being over and a large number of Busses and Taxi Cabs being released, and the Crowds moving about, one had to be careful and wait his chance before crossing the streets. The Strand was a great sight with its beautiful shops filled with Wares of all kinds, and charming Women dressed stylish. The colours of the Busses and Taxi Cab’s newly painted and the costumes not forgetting the sprinkle of Kahki here and there, made a great impression to a Visitor. I strolled about until Lunch and then returned to the Y.M. After a little rest I again ventured out and paid my Sister a visit and found her a little better and cheerful, after a chat until 5Pm, I said Good Bye and back again this time walking to Holborn as the House is \nat\n near\n\nOxford Circus and only 20\" walk. After Tea I started out to make for Wood Green to visit some friends. After twice changing from one Tram to another and it being a little after six Pm and the crowds were all making home for Tea and what a crush, The Trams & Busses were packed and one was jostled here and there and bumps given and taken, it took me nearly two hours by this route to reach my destination and I was not glad, not by half to reach it. After leaving the Tram I was directed again by the Policeman, who I always fly to for directions, and what a releif it is because they are first class and know pretty well where every street is, one has only to stand and watch a Policeman on a corner, he is continually being approached by all and sundry, first it is this way, 3 to the Right and one to the left and so on, without these Gentleman a Visitor would be hopelessly lost in London and I must take my hat off to them. I arrived at my friends\n","4":"\n\nplace on good time ad found them all well, having received my letter during the Afternoon. I spent an enjoyable evening promenading with one of them until 10Pm when I said Good Night and this time I returned home quicker, first by Tram to Finsbury Park and then by Tube and Undergound arriving at the Flat about 11Pm and then turned in being tired after a very exciting Day. Up again at 8 am and away for Breakfast and I spent the Morning in the Club writing home to Australia, and after Lunch again spent the Afternoon with my Sister, leaving her at 5Pm, this time coming back by Tube, as it was now the busy time and I wanted to see the rush in the Tubes, I was not disappointed, it was a rush, The Stairways were crowded and the lifts continually full, and at the Entrance to the several platforms were blocked and the Barriers were across, one had to wait their turn, as soon as a train departed the Barrier was lifted and there a rush on to the \n\nPlatform. The Porters where shouting out,\" Right Along Please\" and \"stand back\". When a Train came in, a Porter would stand at the Entrance’s and direct the crowd. The People coming off first would pass in one direction and then a rush to get on, only one at a time through the Barrier and when the Train was full, the Gates on the Train would close, a ring of the Bell, and off she went, and the remainder of the crowd would have to wait until the next, being added to by others. This rush takes place every day, early morning, Tea Time and after the Shows, It took me over an hour to reach Holborn whereas I could have walked the distance in 20\". After a Wash and Brush Up, I had some Tea and then read the Paper until 7.30 when I went out across the road to the Holborn Theatre to see the second evening performance of a Variety Show. I joined the usual Queue and at 8-15 the first house came out and we went in. It did not take long \n","5":"\n\n to fill the House and the Performance started at 8.30 PM. This is a very pretty Theatre and fairly large, and with a splendid Orchestra, and good Artist’s. I spent a very enjoyable two hours, coming out at 10.30. It was a Variety Show. After obtaining some supper at the Club, I caught a Tube and changing at Piccadilly Circus for the Maida Vale Tube I arrived back at the Flat before Midnight. Away again at 9am for Breakfast, I then caught a Train for South Kensington Meuseum to visit the Science Dept. I reached there at 10.30 am, and the Weather being very wet and foggy, the light inside was very bad but still I spent a glorious time inspecting the Old Style of Locomotives dating from 1812 to the present date, the old Locomotive \"Puffing Billy\" built by George Stephensen is a comical looking concern and very interesting to an Engineman. The Cylinders to drive the Wheels are fixed up on the side of the boiler and by a lever from the \n\nPiston comes down on to the Wheel one on each side and is fixed on to a crank and between the Wheels underneath is a cogwheel with cogwheels on each side to the next Axle and by this method the Wheels are forced around going at a speed between 8 and 10 miles an hour. This Locomotive is well worth seeing, and in Glass Cases is Models of all kinds of Pumps, and Stationary Engines, and up to date Locomotives, all in working order, obtaining the power by compressed air, which is forced into the Cylinders and Steam Chests. An attendant came along and set them all going, and they looked well all working, in another portion of the building is models of modern steamers and beautifully finished off and are very pleasing to the Eye. The Painting and Workmanship of all these Models reflect great credit on the Makers and are very interesting to view. I spent a most enjoyable two hours here and intend paying another visit later on. I returned to Holborn for Lunch\n\nand then on my way to see my Sister, I visited Selfridges large Emporium in Oxford Street first to see the Huge Handley Page Aeroplane containing room for 17 People and the Mechanic’s. Only the Body was on view and splendidly finished. The Passenger space is about 40 ft by 5 ft and there are 17 Leather Arm Chairs and sitting in three were three young Ladies dressed in the latest fashions of Aeroplane \ncostumes\n Suits of Brown Leather and Caps to match, they all looked very nice in their Suits, the Crowds were directed along and around and then away. I spent over an hour strolling about on different Floors inspecting the different departments, which were well stocked with different wares, and the staff were all kept busy. I could not help admiring the beautiful Costumes and Hats of the latest fashions. I then went around and spent an hour with my Sister, and away then for Tea, afterwards making for Liecester Square\n","6":"\n\nto meet a Lady Freind to go with me to His Majesty Theatre to see \"Chu Chin Chow\" a beautiful Oriental play. My friend came along at 7-45Pm and having previously booked Seats we arrived at the Theatre at 8Pm and obtained our Seats and soon was comfortable. This is a very large Theatre a beautifully finished and well laid out. The House was crowded and the Play very interesting. The Oriental Scenes and beautiful costumes were a feature of the Evening, The Dancing and Singing was first class and each turn was well received. My friend and myself spent a very enjoyable evening at this Theatre, coming out at 11 PM, I put my friend on a Bus for Wood Green and left by tube for my Flat, reaching home before Midnight. \n\nThursday 6th\n \n","7":" \nHaving remained in London from. Since I last\n From Thursday 6th until Wednesday 19th I had been passing my time away in London and making entries in my \n\nDay to Day Diary, but unfortunately last Saturday I was releived of my Wallet containing all my notes of travels and experiences, so therefore I will try and do some writing from memory.\n","8":" After I came into Town and had Breakfast, I boarded a Bus outside for Oxford Circus, to do some business for my Sister. Whilst riding on the Bus I remarked to a Gentleman, how splendid these Bus Drivers handles the Bus in these crowded streets without any Accidents and no sooner uttered these words when the Bus stopped suddenly with a jerk and I then heard a crash, & on looking over the side, observed that we had knocked over a Lad on a Bicycle and that the Bicycle was crushed up and underneath the Bus and the Lad was thrown clear and not hurt. The usual crowd soon gathered around to hear the in’s and out’s of everything when the Policeman was taking all particulars, it was not long in getting the Bike\n\nclear which was smashed up very bad, and in a few moments I arrived at my destination and fulfilled my mission reporting to my Sister after Lunch. I spent the afternoon with her and after Tea I went alone to the London Pavilion to see the Revue \"As You Were\", This is another beautiful Play-house and fairly large and neatly decorated. I obtained a good seat in the Stalls, and spent an enjoyable evening, the Singing was very sweet and the Lady Actresses looked charming in their Dresses, also the Orchestra of 25 members played beautifully. At 10-45 it was over and I went down the Underground and caught a Train home to my Flat and turned in. Friday and Saturday I spent very quietly, only going out after Tea to Finsbury Park and met my friend and we walked along and went into the Marleborough Theatre to a Picture Show. We managed to get two good seats in the Circle and enjoyed a good couple of hours, The Pictures \n\nwere a first class lot and the Music was supplied by a Beautiful Organ accompanied by a small Orchestra, and the music was very sweet. This Theatre is fairly large and the Seats of Red Plush very comfortable. The small red coloured lights all about, made everything look cheerful. After the show concluded, I boarded a Tram with my friend and saw her home to Harrangay, returning back to Finsbury Park for the Tube to Maida Vale and back home once again.\n","9":" As arranged after Breakfast I walked along to Euston Station from Holburn and visited some friends for the day, A Sister of a Brother in Law in Australia. I was made very welcome, and before Lunch I went out for a Stroll with her Husband, who pointed out some places of interest in which my Brother-in-law was connected with before leaving for Australia. After a good Dinner which I enjoyed, their married Daughter, with her Husband and her only child\n\ncame along, and we all spent a grand evening talking of Relatives, and after saying Good Bye to the Old People I came away with the Young Couple and I left them at Baker St Tube after promising to visit them at their home at Willesden on the following Wednesday.\n\n","10":" being a fine day after lunch I went to Baker St and paid another visit to Madame Taussaud’s Wax-Works, which was crowded. I spent a pleasant two hours viewing the Wax Figures which I admired very much. They all are so beautifully finished off and the Dresses of the Lady figures very sweet. Afterwards I returned and remained with my Sister until about 6 Pm when I returned to Holborn for Tea.\n","11":" After lunch I caught a Tube to Convent Garden to see the Great Fruit Market, which was a sight. Heaps & Heaps of Cases of Fruit everywhere and Vegetables. It was not Sale time, so I quietly walked about for over an hour and then took a Tube to King’s\n\nCross to have Tea and spend an Evening with another family who has Relatives in Australia. It was the same family I visited two years ago next month before I went oversea’s to France. I found them all well and they made me very welcome, they are a jolly family, Husband, Wife, two nice daughters and a Son. I passed the evening away in giving them some of my experiences on Active Service. I had such a good time that it made me long for my Dear Old Home, which I hope I soon will return to. At 10 Pm I said Good Bye and thanked them all for their kindness, they directed me back to Holborn and on the way I witnessed a very smart turn out of a Borough Fire Brigade, who had received a call. I was just passing the building when a large Bell rung and in a moment the Huge Doors opened and \nin\n out came the Reel, followed by the Steam Engine, Ladder Wagon and the Ambulance and all was soon on their way. I continued on and after reaching Holborn I caught a Tube home.\n","12":" After seeing my Sister in the Morning who was very cheerful and progressing slowly. I had Lunch at Holborn and caught a Tube as arranged out to Willesdew Green arriving there at 2 Pm and after making inquiries I arrived at the House and found my friends awaiting me. After a Cup of Tea and Cake, it being a nice day, we all went for a Tram ride out to Hendon to see the large Air-Craft Depot. Before the Was it was open fields and now it is all occupied making Airoplanes of all Sizes. Several large Planes were up for a Trial fly. We walked about until the Whistle’s blew for knock off time and saw the large crowds coming out of the different works to catch their Trams and Bus’es home, it was a very interesting sight, they all have to line up two deep in long passage’s and their is no bustling or jostleing. Their were about 12 Tram’s waiting also several Buse’s, which soon filled & on their way. there is no mistake this Cue Bisiness is a splendid idea, and prevent’s a large number\n\nof accidents, as it takes a good hour to take all the crowd home, we decided to walk being only about 3 ½ miles to Willesden, and started on our way it was interesting to watch the crowds walking, riding on Tram’s, Buse’s, and Motor Wagons and Car’s, and further along there were other Cue’s waiting for their turn’s, we eventually arrived back at 6-15 Pm a little Tired, but after a rest and Tea, we were refreshed, During the evening I had a tune on their Piano and sang a couple of Songs also their daughter played several pieces and sang several songs. At 10.30 we had Supper and I prepared to depart, and my Host decided to come along & see me in my Bus, and I then said Good Bye to my Hostess and daughter, at the corner of the Street we waited for nearly 30\" & then found out that the last Bus had gone, so I had to set out and walk back to Maida Vale, my Host coming with me as far as Kilburn Park, where I said Good Bye and in another 30\" was back and in my Flat, being very\n\ntired after a good day. I soon was asleep and woke next Morning at 8 am. \n","13":" I took things very quiet all day and after Tea met my Lady Friend and went along to the Strand Theatre where I had booked seats previously, and had the pleasure of seeing a splendid Drama entitled. \"Scandal\" with Arthur Bourchier and Kyrlie Bellew in the principal characters, this is another Grand Theatre, very large and beautifully finished off, and the piece was well staged, in fact it was the best Drama I have seen for many a long day, we both enjoyed the play and was well satisfied, Miss Kyrlie Bellew being a very beautiful young woman and kept the house in a good humor all the evening, with her tricky sayings and graceful acting, supported well by Mr Bouchier and the rest of the Company. After coming out I put my friend on her Bus and returned home once again. \n","14":" was my worse day on my leave, everything going wrong, first after Breakfast I went along to our Headquarters to try & obtain an\n\nextension of my leave for 7 days, and only could have 3 days which I had to be thankful for, I then started out at 11 am for Willesden Jtn. to bring my Niece to see her Mother, but missed the Train at Earl’s Court and had to wait over an hour, which was \nwait\n not worth while waiting for the next, so came back and had Lunch, spending the Afternoon with my Sister and afterwards returned to the Y.M.C.A. at Holborn for my Tea, before going for Tea I went down to the Underground Lavatory for a Wash and Brush up, and while I was washing, my Tunic and Great Coat was hanging up, two Australian Boys left, and when I finished I missed my Wallet from my top Pocket in my Tunic containing my Extension Pass and my Pass to France also all my Family Photographs. I had no money in the Wallet fortunately, and was very much upset at losing all my Family Photograph’s, which I cannot replace. I hope the Mean swines will return my Photo’s and Passes as they are no good to them.\n\nThat was another set back and after I had my Tea having to meet my Lady friend at Finsbury Park at 7.30Pm, it came on to rain very heavy, and although I went out, my friend did not arrive, and it was just as well as I was too upset and was glad, so I came back and after some supper I returned to my Flat, disgusted with my Day.\n","15":" I brought my Niece in before lunch to see her Mother and returned with her after Tea getting out at Maida Vale and to my Flat.\n","16":" After Breakfast I went along and reported the loss of my Passe’s at our Headquarters at Horseferry Road, and after waiting over an hour they issued fresh ones to me; this time they gave me 7 days extension instead of three, which somewhat made up for my Misfortune on Saturday, now I can remain in London and see the March through London on Saturday next by the Guard’s Regiments, which I will be looking forward to. After Lunch it being a nice day, I went for several Bus rides through the busy streets, and\n\nwas very interested at the way the Traffic is handled by the Police at different points. I left one Bus at Piccadilly Circus, and watched the way the Police regulate the Traffic there, it is marvellous how it is all done, first one sees the police standing out in the Road with one arm extended and all the Traffic behind him stop, the police on his right let’s the Traffic cross and then he holds out his arm and then the Side Traffic is allowed to move and so on, Civilians are controlled the same as the vehicle’s, as while the Traffic is crossing, one cannot pass and has to wait, and this goes on all day long. it is a wonderful sight to a visitor. When it is a nice day the Main Streets are crowded and as the shops are now displaying Spring Goods the windows of the Large Emporium’s are beautifully dressed, especially Selfridges in Oxford St. Their windows are a sight, a large number containing Wax Figures of Women dressed in Magnificent Robes, and are a great attraction. Some Figures are sitting down, and\n\nothers standing up in real natural positions, of an Afternoon it is hard to walk along, there is such a crowd looking in the Windows, likewise inside, there are great crowds moving about, and all the Assistants are kept very busy. I returned to Holborn for Tea and later on I went out to Finsbury Park and met my friend and paid another visit to the Marliborough Theatre Picture Show and again spent a splendid evening seeing a good programe, as usual the place was crowded, and had to wait a little while for a Seat. After coming out we went and had some supper and took the Train back to Harrangay, where I said bye bye to my little friend and once more returned home to my Flat. \n","17":" I went out after Breakfast and brought my Niece in to see her Mother, calling in at Maison Lyons Oxford St where we had a Hot Dinner. This is a beautiful Restaurant and well up to date, the Fare is very reasonable, and an Orchestrar of five members play during the time Lunch is being\n\nserved, everything is served so clean and well cooked, After one is finished, they sit there and listen to the Music, the Ladies in large numbers smoking Cigarettes, my niece and myself remaining there for over an hour \nand\n enjoying the Music and then I took her along to spend the Afternoon with her Mother, and returned myself to the Y.M.C.A. at Holborn to pass the afternoon writing in my Diary. After Tea I returned for my niece and after the little Girl had said Good bye to her Mother away we went to catch a Train down the Tube, as it was a little after six the tubes were crowded and one had to wait in a Queue at the entrance for a Ticket, another victory for the Queue System, no pushing or jostling, only moving forward slowly and after the tickets were purchased away to the lift and as it only took a minute or so to fill a lift holding about 50 Persons, The Girl in charge would close to outer & inner doors, a lever moved and down we would go, with a humming sound, to the underground passages.\n\nAs soon as the lift stopped the two doors would open automaticly and out we would walk and away to the Trains, there are signboards everywhere for one’s guidance, only a few spaces and one would reach the platforms, at some places were the crowds are heavy. Iron gates are used to keep the platforms from being too crowded, as each Train arrived the platforms were emptied and soon refilled again. We eventually got on the platform and formed up in another Queue and after one Train had left, we caught the next, and soon arrived at Willesden Jtn. and after 10\" walk we arrived at the School were I left my niece after saying Goodbye. I then went along to the Willesden Hippodrome to see the Variety Show. I booked a Seat for the Second House and while waiting I went down the Saloon and had a drink and a read of the Newspaper, I was very comfortable. The Saloon being warm & cosy, At 8.15 the first house came out and the second filled up in a few moments. This Theatre is\n\nanother \nbeautiful\n fine place and very cosy and like the other Theatre’s. The painting and decorations were a pleasure to the Eye. Each turn by the Artists were well received and likewise the Orchestra of 12 performers, making altogether a first class show. The house came out at 10-45Pm and away I went to catch the last Train for Maida Vale calling in on my way for some Supper of Fish & Chip’s. I eventually arrived home at 11-45 Pm & turned in. Thursday and Friday I spent very quiet, only going along on Friday Evening to the Oxford Theatre with my friend to see the \"Night Watch\" a Naval Drama with Madge Titheradge the leading Lady. It was a splendid play and Miss Titheradge played her part splendid being recalled several times after each Act, the other members of the Coy supported her well. This play and \"Scandal\" were the best I have seen on my Tour’s. The Show was over at 11Pm and after seeing my friend off by a Bus I caught a Tube and soon was home again.\n","18":" Mch.22nd After breakfast I went along and stay a couple of hours with my Sister and then along to Holborn for Lunch and then away to Buckingham Palace to view the Great March of the Guards. All the morning the Weather was beautiful, the Sun Shining and it gave promise of a fine day, which London took advantage of. I walked down Kingsway towards the Strand and once in the Strand the Footpaths were lined with people waiting to see the procession, it was necessary to walk along the Road, Flag’s were flying everywhere and from every Window of the buildings could be seen people sitting waiting their time. I wendered my way along and into the Mall and towards the Statue of the late Queen Victoria and took up a position in front of the Palace to view the King taking the Salute, a splendid account on the March is given in the National News, written\n\nby Edward Thompson","19":" Batt. Coldstream Guards Who Marched in the Procession \n","20":" Mch","21":"\n\nHurrah For The Guards!\n\nEnthusiastic Scenes at Firt Official Pageant of Victory.\n\nPrince’s Great Welcome.\n\nThe streets of London were the setting of one of the most moving sights of the war yesterday when the march past of the Guards took place. \n\nOver 8000 Officers and Men took part and there were scenes of unbounded enthusiasm as the great procession passed through the streets of the West End and the City. The King took the Salute at Buckingham Palace and the Prince of Wales rode with the Guards as a member of Lord Cavan’s Staff.\n\nThe Prince was given a tremendous reception at every point of the route and his hand was continually at the salute.\n\nKhaki And Mufti\n\nGuards Fight their Battles over again.n\n\nLaudrecies Memories\n\nThat pleasure and pain are much akin was never better illustrated than in the wonderful march of the Guards through London. The music of countless bands, the gaily flagged streets, and the roars of welcome from thousands of cheering Londoners could not fail to send a thrill through the heart of every man privileged to take part in the ceremony. It was a veritable triumph which might well rival any pageant in the days of ancient Rome, yet our thoughts were turned most to comrades who could not take their place in the ranks, but whose glorious sacrifice alone made it possible for the survivors to comemorate the Guards greatest Victory.\n\nNever was there such a day of recollections. Friends who had not met since the dark days of the great retreat recalled the times when they fought from Mons to Landrecies, where two companies of Coldstreamers not merely withstood the full onslaught of the German army for hours, but actually drove\n\nthe Huns out of the town. We discussed our Victories with pardonable pride; there were no failures to record.\n\nCampbell’s Hunting Horn\n\nHow the Grenadiers held a waterlogged trench for 33 days, how Michael O’Leary shot the machine gun crew and took the German trench single handed, how Col Campbell won his V.C. by rallying his men with his hunting horn, was told over & over again. But ever the tinge of sadness crept in when inquiries were made for old squad chums of 1914, very few of whom ever returned to Chelsea, Wellington or Windsor. Ypres, Cambrai and the Somme had taken their deadly toll, quite apart from the original battalions who were practically wiped out at Landrecies, Festubert, on the Marno and on the Aisne.\n\nIt was a happy idea on the part of the authorities to arrange an impromptu luncheon at Chelsea Gardens where the First Guards Brigade concentrated. There was no formality; officers and privates hurried to greet each other, old friends who had not met for\n\nyears expressed heartfelt wishes at seeing each other back safely through.\n\nMany of the demobilised men came in khaki, but there was a fair sprinkling of mufti. One of the first \"civilians\" I saw across was Private Dobson, of the 2nd Coldstreamers wearing the ribbon and bronze cross which every soldier values more than any distinction on earth. He won one of the first V.C’s of the Brigade, for bringing in a wounded comrade at the risk of certain death.\n\nForm Fours\n\nIt was reminiscent of the old times when we heard the familiar order, \"Battalion will move to the right in fours, form fours.\" No one could ever forget the Guards’ training, and punctually to time the column set off on its triumphant journey.\n\nThe vast concourse outside Buckingham Palace sent up ringing cheers as the band struck up the National Anthem when the King and Queen appeared to take the salute. Then we heard the familiar strains of the Life Guards’ march, and\n\nthe Earl of Cavan, splendidly mounted, led his men through the gates of the forecourt.\n\nThe moment had come for London to let itself go, and it did so in no \ncertain\n uncertain fashion. A roar went up as the famous regimental colours were hoisted by the N.C.O’s. who had \"seen it right through.\" One of the first to salute was a Chelsea pensioner, whose appearance suggested that he might have fought in the Crimea. The heels came together with a click, the arm moved slowly, but there was pride in the old man’s tear dimmed eyes as he stood to attention when the colours were carried by. Members of the most exclusive clubs in London cheered themselves hoarse as the Guards swung down Pall Mall. The crowd lining the streets reserved a special effort for the Prince of Wales, who was everywhere received with unbounded enthusiasm. The Prince is a paradox. He retains his extremely youthful look, but almost everyone noticed that he had acquired a very manly appearance. He sat\n\nhis horse like a veteran - no easy matter, for in every yard of the long route the cheering was loud and continuous, an the Prince’s right hand had to be continually at the salute. He took all the evidences of his great popularity with the characteristic impassivity of the soldier, but a quick eye could detect the manifest pleasure in his face.\n\nA Naval Tribute\n\nHumorous episodes were not lacking. A jolly Jack Tar in the Strand raised a hearty laugh by telling the boys that it had cost him fourteen day’s pay to come up from Portsmouth but it was well worth it.\n\n\"Take that girl’s name, Sergeant,\" was a gag which caused a pretty flapper to suffuse with blushes in Trafalgar Square, where the bells of St Martin’s church rang out glorius peals of welcome.\n\nA simple \"Thank You\" was an inscription in the City which struck me as most appropriate, but everything seemed in harmony today.\n\nWhen a halt was made in Cannon Street the Coldstreamers were bombarded by a shower of Cigars and cigarettes, which were lighted on the spot. Smoking very wisely, was not \"verbotten,\" a privilege which was appreciated by no one more than the wounded and disabled men who filled the places of honour in the motor wagons.\n\nBy the time the return route was completed and we had reached Hyde Park Corner, many of us were as tired as in those weary days when we trudged up to the firing line from Bethune. With the order to dismiss a furore of hand-shaking broke out again. We wished each other the best of luck, and with that esprit-de-corps which has always characterised the Brigade we decided unanimously that, in the event of another war we would all join the Guards again.\n\nAfter the march every man of the House Hold Cavalry and the Guards Division was handed a message from the King expressing his high appreciation of their war records.\n\nI now add a few remarks of my experiences and impressions. When the King and Queen came out from the Palace to take the Salute, that was a moment I had always long for, to see the King and Queen in the flesh, as I had so often seen them in the Pictures. It gave me great pleasure to stand \"to attention\" when the band played the National Anthem and the Officers saluted the King. I stood among the crowd for a while watching the Troops on the March and as each Divisional Flag with a Wreath on the top was passing the Civilians took off their Hats out of respect for the fallen. I then walked along the Mall where a number of White Wooden Pillars were erected decorated with Flags of each division and Wreaths and names of places were the Guards had fought. These were erected on the side of the road, from the statue and along the Footpaths were huge crowds running into many thousands and with the cheering and waving of Hankies and coloured flags made an impressive sight. I decided to make for Holborn \n\nif possible to have a better view, and walked along back to Trafalgar Square were I was blocked by the vast crowds all around the square and on the steps of St Martin’s Church and the National Gallery, the ringing of the Bells were very sweet and a treat to listen to. I made an attempt to move along the Strand, but found it impossible, so took a side street down to the Embankment, where I boarded a Tram which runs under Kingsway and in a few minutes arrived at the underground platform of Holborn, and I left the Car and up into Kingsway and around into Holborn. It was then 2.45 Pm and a large crowd was also waiting there, I took up a position and waited the arrivals of the Guards , at 3-15Pm I could hear the cheering of the crowds in the distance and in a few minutes the Guards came into view with the Band playing. First came the Life Guards, a fine body of men then the","22":" and 2nd Coldstreams, 1st and 2nd Irish Guards, 1st and","23":" Grenadier Guards, and then the","24":" &","25":" Scotch Guards, each division receiving\n\nas each Division came along, it received an ovation and as the Prince approached the crowd let itself go and the Prince was continually saluting, also each lorry of wounded men were cheered. One pathetic sight was two boys in Mufti marching Blind, marching with their arm linked in one of the boys in Khaki. I stood watching them march by until after 4 Pm and it was fairly cold and my feet like Ice. I then went into the Y.M.C.A for Tea and while I was having Tea I could hear the Bands playing. It was a great procession & I thoroughly enjoyed it. After Tea I boarded a Bus for Willesden and spent the evening with Friends by the Fire and a t 10.30 Pm said Good Bye and returned to Maida Vale by Bus and soon was again in Bed.\n","26":" After having Breakfast at the Flat I came into the City and visited my Sister to say Good Bye as I was leaving next morning for France. I did not remain with her long as she was not too well and after wishing her a speedy recovery and good\n\nhealth , I came away to Holborn for Dinner. Afterwards I walked along to Gray’s Inn Road and boarded a car for an Afternoon’s outing. The first car came along was for Edmonton Town Hall 10 miles away, and I boarded it and rode on top, These cars are enclosed in with Glass and are very cosy. but the travel very slow which makes the journey somewhat monotonous, but the sights along the route with the long rows of shops and Terraces of Houses make up for it. I enjoyed the ride to Edmonton passing through Tottenham, and I came back with the car as far as Manor House, then I changed into an Enfield Car, riding on Top which was not enclosed . It was very cold on Top, a strong wind was blowing. I was glad when Enfield was reached, on the way I passed through Harringay, Wood Green, both very nice Suburbs and very clean, all these suburbs have their wide clean streets with pretty designed Houses of two & three story’s. I rode inside the Car on my return & reached Finsbury Park at 5 Pm, making a three \n\nhours interesting trip. I then returned by Tube to Holborn for Tea & a brush up, afterwards I returned at 6 Pm to Finsbury and met my Lady Friend for the last time of this leave. She arrived on Good time and we returned by Tube to Hyde Park Corner and went for a stroll in Hyde Park. It was fairly cold but still it did not keep the crowds away from promenading. We strolled along the Path and the Bank of the Serpentine and across the Bridge and out along Kensington Road. We then adjourned into an Hotel for a rest in the Saloon by the Fire and had a refresher, and remained there for over an hour, As it was after 8Pm we left and caught a tube back to Finsbury, and as the crowds were lined up outside two deep waiting for Trams and Bus’es we decided to walk back to Harringay, I remained with my friend until after 10Pm when I said Good bye and thanked her for her Companionship during my Leave and promised to see her on my next trip. I then boar-\n\nded a train for Finsbury and then the Tube for Maida Vale arriving home at 11.15Pm. As I was to rise early next morning, I had a loan of an alarm clock from the Caretaker and set it for 5 am and turned in. \n\nMonday 24th. The alarm woke me at 5am, I then dressed and with m Valice started for Victoria at 5.30 am arriving there at 6 am, where large number of boys were beginning to arrive. As my train did not leave until 7.30, I went out and upstairs to the Y.M.C.A for Breakfast and a smoke and read alongside of a Hot Pipe. The room was \nnice\n cosy and warm and I remained there until 7-15 am when out I went and took my Seat in the Train after I had my Pass stamped. The Train left at 7.35 fully loaded and did not stop until Folkstone was reached at 9.35am, travelling 75 miles in two hours. As soon as the Train was shunted into the station, we alighted and marching two deep along the Platform, through an arch way and down a flight of stairs and along\n\nthe Gangway, handing a Card with our Name, \nand address\n No & Regiment to an Officer, we boarded the Leave Boat, were each man received a life belt, our Train load completed the boat’s number of Troops, we were not long before we started on our journey. The name of the boat was Princess Clementine a Paddle Steamer very long & broad, after two sharp blasts were given the Crew let the lines go and we moved off at 10.35 am. The weather was very cold wit a strong wind blowing which meant to us a rough passage. After leaving Folkstone the Boat kept close in along the mainland and arrived off Dover at 11.15am, the sun now was shining and the White Cliffs at Dover were a pretty sight, once past Dover we turned and made straight across for Calais, the boat now was pitching very much and soon made an effect on the Troops, one after another made for the side, the movement of the Boat did not effect me and I was feeling well, in fact hungry and having a sandwich and some Cake\n\nI shared it with a comrade, who also had some sanwiches, and we both enjoyed our lunch, several Lads saw us eating and offered some to a Lad who only shook his head and tried to smile. It soon was all over and we arrived at Calais at 1Pm English time and two Pm French Time. On coming ashore at 1-20 I met three boys of my Company also returning from Leave, and we four kept together, we all decided not to go to the Rest Camp if possible, so I proposed to arrange for us to go to the Calais Rly Depot, on lining up on the Wharf, an Officer called out \"All Calais men this way\", we four stepped out , and the Officer asked me \"Where were we for\" I replied, \"Calais Depot Sir\" amd he replied \"Right away you go to your Depot\", and off we went towards the Town, we made straight for the Salvation Army Hostel in the Square for some Dinner, and after we had finished, made for the Station to find out what time a Train left for our Depot, we found out it was not until\n\n8.50 a Train for Paris, so we had to pass the time away until then, as it was very cold and windy. we made for the Church Army Hut, to have a rest and later on some Tea. I laid down on a seat and had a doze waking at 5Pm when we had some Tea Biscuits and a mug of Tea, and as there were a Picture Show in the Cinema Hall next door, starting at 5-45 Pm, we all went in paying ½ a franc admission, we saw a splendid programe and \ngood\n heard good music played on the Piano until 7-45Pm when the show terminated and after another drink of Tea and Biscuits we made our way to the Station, at 8.30 we had each to purchase a ticket as it was a French Passenger Train which cost us 1 ½ Franc’s and in a few moments we were aboard, The Train was a very long one and was \nfairly full\n just about crowded when it drew out at 8.50 Pm on its journey. We made a good run only stopping three times before Bolongne was reached at 10.30 Pm and after a wait\n\nto change Engines, at 10.45 we were off again and all hands settled down for some sleep, as we were in the rear coach next to the Break van, at every Station we could hear the Rear Chef calling out the Stations, so we were contented to wait until we arrived at our destination, \"Quend\" at 12-45, we were soon out and on our way, walking very brisk as it was very cold and windy, we arrived at Camp at 1-15 am and made straight for the Cookhouse and had a Mug of Hot Tea and some Toast, afterwards I obtained my Blankets from a chum in the Signal Cabin and made a Bed up on the floor and was soon down to it, sleeping very sound until 8am when I was up and had Breakfast and handed in my Pass. I then took my Blankets over to my hut and soon was comfortable again. As I was very tired and weary I spent the day laying down and resting. \n\nTuesday\n Wednesday I worked for 4 hrs Shed Driving.\n\nThursday 27th As we had a travelling Dentist and his staff \n\nwith three Van’s in the Depot, attending to the Boy’s teeth, I went over after Breakfast to see about having a Tooth filled, after the Officer had examined my Teeth, he decided to fill five altogether, doing one at once, and he gave me what for when he was drilling it. I was there about ½ an hour and have to go back tomorrow for another to be done. Things with us are very quiet, only three Engines working, in fact we are only waiting for a call to be drafted to England for Australia. As I enlisted in 1916, my name is on the first list to leave for the Base at La Havre, at any moment now, which I hope it will not be long. A large number of our young Lads have gone to England under the Educational Scheme, taking up different positions and we are only now 140 strong of our Original Company of 250.\n\nApril 2nd Wednesday. Since Sunday last I have been employed as Shed Driver in the Depot, putting Engines away, taking them down for Coal and doing any necessary\n\nShunting, working from 8am until 4 pm. Wednesday was an unfortunate day in Camp. As we have a fairly large number of German Prisoners working about the Camp doing fatigue work of all kinds, such as keeping the Huts clean and washing up our dishes and attending to the Fires, they are everywhere about the Camp, They are very clever doing Souvenier work, such as engraving and Polishing shell Cases of all sizes. At 12 noon I was placing some Engines away on a line in readiness to be sent down to Dieppe for Demobilisation to England, when all of a sudden I heard a loud explosion in the direction of the Fitter’s Van’s and German and our Boys all making in the direction of the Van’s. I knew at once an Accident had occurred, one of the boys came running towards me for my Assistance to render First Aid, and told me that a German Prisoner had been seriously injured in the Fitter’s van, having his right hand blown off and his chest riddled\n\nthrough a Nose Cap of a Shell exploding when he was doing something to the Cap. I hurried towards the Van, and found that two of our Boys had rendered First Aid, by stopping the Bleeding and Bandaging him up. I was ordered to shunt a van out, which I did at once, and after the Man was placed on a Stretcher, he was lifted into the Van and I started away for Rang de Fleurs about 5 miles, slowly as the road I was to run over was in very bad order, in the meantime the Doctor was rung up by Telephone at Rang de Fleurs. After a slow run I arrived there safe and the Dr. and two R.A.M.C Boys were waiting to receive the Man, who was \nconsious\n conscious all the time, and breathing very easy, After being examined by the Doctor, he was lifted out and put into a Red Cross Motor Car and taken straight away to the German Hospital at Etaples. I returned straight away to the Camp and we all had our Dinner, word came along during the\n\nEvening that the Wounded Man had Died, his Lungs had been penetrated and had Bled to Death. \n","27":" Being off duty all day and the Weather beautiful and somewhat warm I arranged with a Mate to pay Berck Plage, a Seaside Resort a visit, about 8 miles from the Camp. After a good Dinner we left at 2 pm for the Station at Quend and at 2-45 the Train came along and soon found room in a carriage. This Train as a rule is very long and always crowded, it only took fifteen minutes to reach Rang de Fleurs, where we had to change into a Metro Railway, which is a narrow Railway 3 ft 3 \" in width, with light Rolling Stock, there were three Carriages, of 8 compartments each one seating 10 Persons, and a small Locomotive. A good crowd detrained from the Broad Guage and we had to hurry to obtain a seat, just before leaving at 3.30 the Conduteress collected the Fares \nat 3d each\n which was 3d to Berck Plage. After about a 20\" run we arrived at our destination.\n\nAfter leaving the station we made towards the Beach passing through a Main Street, which was fairly crowded with Civilians with a fair \nspread\n number of Soldiers in Khaki. I was somewhat surprised at the size of this town and the fine \nbusiness\n Shop’s well stocked. Business is carried on as usual on Sunday’s as well as Week days. All the Shops were opened, before we turned off towards the Beach I was very interested in the Frontage of a Shop, which was built of Stone and the Cement Front was done in the form of Trunk’s of Trees and Limb’s, we thought at first it was genuine Wood, but on closer observation we found out it was cement. I would very much like a Photo of this frontage because it is \nunigue\n unique. After a few minutes walk we arrived at the Beach where a large crowd was promenading. This is the finest Beach I have seen in France, very wide and level and there were a large number of small carriages drawn by Donkey’s containing\n\nInvalid’s, all laying down, and a friend sitting in a Seat on the Side driving, in several cases the Invalid was doing the driving by holding a Mirror behind them, the Donkeys are very quiet and walk along very slowly, a fair number of French Soldiers injured in the spine were in these Carriages. I stopped and had a long chat with one who could speak good English, & he had been hit in the spine two years back and expected to be able to walk again in six months, other Carriages contained some very pretty French Women and they looked very nice and cheerful. A large number of beautiful French Damsels were promenading up and down others were sitting on the Beach and the little children were playing about and building castle’s in the Sand. All along the Beach are a large number of Bathing Houses which are well patronised in the Summer, and behind are a large number of beautiful Houses of all shades & styles, built on the Gothic System and are very pretty, at each\n\nend of the Esplanade are two magnificent Buildings which are used as Hospital’s for Cripples. we both walked about until 6Pm & then went up the Town for Tea, which consisted of Eggs and Chips, Bread & Butter and a Mug of Chocolate, all for 3 ½ Francs, which was very reasonable. We returned again to the Beach and went in search of Cockles, as the Tide was out, several Fishing Boats were high and dry, our luck was not to good, and we only found five Cockles, so we came back passing about 200 young Ladies from a Colledge out for a promenade. They all were well dressed and were singing French Songs. As it was just on 8pm and the Train did not leave until 9-15 pm we strolled around the streets in the meantime, After 8 oclock the Town is deserted everybody being indoors, at 9 pm we came to the station and after purchasing two tickets, we obtained a seat and left at 9.15 pm for Rang de Fleurs, This train runs at a good speed, one time\n\nwe were travelling at the rate of 25 miles per hour, we arrived at Rang de Fleurs and only had to wait a little while for the Main line Train and soon was aboard and left at 9-50 and arrived back at Quend at","28":" and reach Camp at 10.30 and after some supper turned in.\n\nMonday 7th A parade was called at 3.30Pm when the Officer Commanding informed the Coy that we would be leaving France for England between the 24th and 30th and perhaps within a month later, we will leave for Australia. The 6th Coy of New South Wales Railway Men \nare \n have finished up at their Depot in Belgium and are now living in Vans about ½ Mile from us, awaiting for the word to go to La Havre, We finish operating on Saturday the 12th and next week we will be preparing to move off, rumors are that \nwe\n all the Australian Railway Men have been recalled home as soon as possible, and we expect about 1200 will be going home on the same Boat. All Blighty Leave\n","29":"\n\nThursday 10th\n\nhas been cancelled and after Sunday next no more leave whatever will be granted to the Boys, All the boys are not pleased \"not half\" of their early Departure for home, we are all tired of this life and want to get home to our Home Folks in Australia. I hope my next record will be our departure from here so now I will close until then. \n","30":"\n\nI have been off duty since Monday and my turn came around to work again, as we only have three Engines out daily, we have plenty of time off duty. My work this day was on the Vrow Shunter working up at the No 2 Aerodrome, Royal Air Force, it is over three months since I was up at this place I noticed a vast difference, The work as far as the Railway is concerned is just about done with, all the large Hangers or Shed’s were almost empty of Material although a large number of Motor Cars of all sizes and in all sorts of condition are waiting to be shifted.\n\n \n\nTwo Companies of German Prisoners are employed loading Motor Cars and other Gear on to the Trucks, as this place is the Demobilisation Centre for the Boys of the Royal Air Force & there are a large number camped in Nessian Huts awaiting their turn, also a fair sprinkle of W.R.A.F. Girls working about the Officer’s Quarters. These Girls look well in their Blue and Khaki Caps and Uniforms with Brass Buttons and a pair of small wings on the shoulder straps. They flitter about from Hut to Hut like Butterfly’s from Flower to Flower in the spring. I was kept busy shunting about all the Afternoon placing Trucks were required and Marshalling the Loaded Trucks, At 6pm, my Train was ready consisting of between 20 to 30 Trucks of Motor Cars and Gear all bound for St Omer \nin France\n near Calais, and I brought them down to Conchil le Temple where the French Railway People take charge and work them to their destination, and then returned to \n\n \n\nmy Depot at Pende and signed off. Another move is made in the direction of our Departure. A number of covered vans arrived during the day which are intended to convey our Coy away to la Havre when we are ready to leave. At present the 6th Coy of N.S.Wales Men are now camped in Vans about ½ mile from here waiting for us to join them, they came down from Coutrai in Belgium last week having been releived by the Belgic Railway People. The","31":" Coy (Commonwealth) made up of Rly Men from all the Australian states, are still operating at Goudekerque and we expect them here any day. The","32":" Coy ( Victorian’s) are still up at St Jean in Belgium working as the Light Railways, and the may join us also before we leave France, as rumor’s go, all the Australian Railway Men have been recalled home as soon as possible and we are expected to sail in one Boat during next Month from England.\n\n \n","33":"\n\nAfter breakfast a number of Tommies arrived in the Camp forming the Advance Party which are going to releive our Coy.\n","34":" \n\nAfter lunch 10 Drivers and 10 Fireman came along from the \ndepot\n R.O.D. Depot at Calais to take up duty and next morning 16th the 10 Sets went to the end of the line to learn the road and 3 sets remained at Dowleger our Advance Depot and the balance returned, during the day our Boys after returning their Engine Clothes and surplus gear, started to get their clothes in order to move off when the time arrives, Orders are that we have to have exactly the issue what we arrived in France in","35":" By the time we leave France we will \nalmost two be two years in France and Belgium\n be Eleven Months in Belgium and \n12\n Twelve months in France working the Railways. Thursday April 17th \n\nThe Tommy Enginemen took over from us today and started working the Engines and in a day or two we expect them to releive our\n\n \n\nCookhouse Staff, also the Control Staff, The Canteen ceased operations on Monday Night 14th at 8.30 Pm, and between the time of closing and us leaving Camp, any Cigarettes, Tobacco, or other articles required will be obtained for us by the Canteen Staff. The Clerical Staff are preparing all the Paper’s ready for departure, so between now and next Thursday or Friday, we have to amuse ourselves in Camp the best we can. In the Hut where I camp \nare\n contain the Blacksmith Staff and we pass the time joking and barracking one another, of an Evening there are only three or four remain in the \nCamp\n Hut out of 12, the rest go promenading into the villages round about with the French Girls, at the same time there are always a few French Madam’s and Girls promenading about the Camp, on the scrounge, cadging whatever they can, they belong to the poor class of French, and are very ignorant, having had very little Education in their young Days, even the \n\n \n\nBoys and Girls have very little schooling and can hardly write their own name. \n\nEaster Saturday April 19th As I recorded in my Diary my first trip driving on Active Service. I was nearly forgetting my last, this trip was on last Monday with the Ration Train from the Depot \"Pende\" to Conchil le Temple and back along to Dowleger and return, I signed on at 7.30 am and prepared Engine 1803,W.D.2.8-0 with Fireman Whittingham and at 9am left Conchil with the first lot of Rations, The weather was very rough, Blowing very hard and very cold, my mate \nprepared\n obtained a small Tarpaulin and hung it on the back of the Cab and tied it down, we soon arrived at Conchil running Engine First and at 9.30 we started on our journey back, as we were now running Tender First, we soon felt the force of the Wind, we could hear the Coal being blown against the Tarpaulin and when one looked out, you would get hit in the face with flying\n\n \n\nCoal pieces, at the end of the yard we took a curve and started to get the Wind on the side, we knew we were in for a rough trip, After we left the Depot it started to rain, and all along the line the \nrain was\n wind was driving the Rain inside the Cab, it was not long before my mate was wet through, as the Tarpaulin only \nprevented a\n protected us a little, After a Wet Stormy Trip, that bad at times, we could not look out & keep our eyes open for the strong wind and rain, my hands were that wet and cold I could hardly handle the Regulater, At 11.30 am we arrived at the Junction of the French Line at a place called Couteville and now we only had another Mile to reach the end of our journey, and it was just as well as the Tarpaulin was torn several times and the cords broken and we were working under rotten conditions, we arrived at our destination at 11-45am and soon left the Engine and went \n\n \n\ninto the Ration Van for some Lunch, and a warm by the Fire in the Stove. After a spell of an hour, we both made another attempt to secure the Tarpaulin and prepared for our journey back, after doing the necessary oiling and Shunting we left for Conchil at 1.15Pm with 60 Covered Empty Vans and our 3 Ration Vans, and now it was more pleasant as we were running Engine first and the Wind was easing off a bit, after a good trip we arrived past the Depot and away to Conchil reaching there at 3-15 Pm and after stowing our Train away returned to the Depot and signed off at 4.30 Pm after a rough journey, in fact the worst trip I have had in France, & we were not sorry to finish, the weather now was grand. The Wind & rain had all gone and it was pleasant with promise of fine \nweathe\n few days as the pressure had worked around from the North West to North East.\n\n \n","36":" \"Good Friday\"\n\nAs I have stated before the No 2 Aerodrome which is the Demobilisation centre of the Royal Air Force, the Officer Commanding granted permission for several days sports. A portion of the Grounds were roped off and decorated with Flags of all colours and sizes, \nand \n with long coloured Poles making a pleasant sight to the eye. Our O.C. has granted permission for specials to be run up to the Aerodrome at Vron for our pleasure, starting from Conchil and picking up Boys of the 6th Aus Coy and Tommies in a Camp close by everyday. The first special was run on Thursday the 17th at 4.30Pm for us to witness several heats of a Boxing Tournament, \naf\n and a large number of Boys travelled by it, filling 6 vans, we arrived at Vron at 4.45Pm and made straight for the Stadium, and what a pleasant surprise we all had. The Stadium is in a large Hanger and it was crowded, the Ring in the Centre was well\n\n \n\nlaid out and the first 3 or 4 rows around the Ring was reserved for Officers and the rest were for the Rank and File. There were ample \nacco\n seating accomadation for all and there must have been between two to three thousand present to witness the Contests, a first class Orchestra of 20 Performers from No 1 Aerodrome Marquise, and they gave us several good tunes well played and much apreciated judging by the Applause given by the Boys. The Hanger was nicely decorated \nby\n with Flags and Streamers with Arc Lights and several small ones, and when all the lights were switched on, shining on the large number of Kahki Uniforms and Brass Buttons and neatly polished Badges all assisted to make a grand sight, Amongst the Boys there were a fair sprinkle of Lassies in their neat Uniforms of Kahi and Blue with caps to match and they took a great interest in the Contests. There was only two Contests with Feather Weights and the boys were unevenly matched and the issue was \n\n \n\ndecided in the first round. Each Contest was for 3 rounds of 2 minutes with a spell of 1 minute. The 3rd Contest was as Exhibition of Sparring and it was very laughable, the antics of the two were very amusing. At 5.30Pm the Contests came to a finish and all hands came away. At 7.30 the Aeros Concert Party was billed to give a performance in the Cinema, and in the meantime our Boys passed the time in kicking the Ball others promenaded about the Grounds, myself going over to the Canteen and then had a walk around the Camp. This Camp is well laid out. A Football Ground in the centre with a Main Road on one side with Officers Quarters and stores and then a large number of Nessian Huts around the other two sides. The W.R.A.F Girls are billeted in Nessian Huts on the opposite side to the Officers Quarters and is wired off, one can easly pick out the Girl’s Huts with the small coloured curtains hanging inside of the Windows. \n\n \n\nI returned at 6.30 and formed up in the Queue outside the Cinema Hall and at 7 Pm the doors opened and we all filed in, It did not take long to fill the Hall and at 7.30 when the Orchestra struck up a lively tune the place was packed, it was quiet a treat to see the W.R.A.F Girls all over the Hall. The seats raised at the back were filled with Officers and N.C.O’s with a fair number of Girls with two and three stripes on looking around one could hardly notice two or 3 girls together, they all mostly had Boys as companions. Several W.A.A.C.Girls came in and they did not receive a too good of a reception, several lads in the Hall started Hooting and I knew in an instant something was wrong, on making inquiries, I was told that when the W.R.A.F.Girls went promenading down to the village, the W.A.A.C. Girls hooted and hissed them when passing their Camp, evidently jealous of their positions, & that easly explained the Hooting in the Hall. The Aeros Concert\n\n \n\nParty put on a fair Show, some items were very poor and others favourably received. The Orchestra played several popular Tunes which the Boys soon joined in, and by the time the Show terminated at 9.30Pm, an enjoyable evening was spent. We all returned to our Vans and left just before 10Pm and soon was back into Camp.\n","37":" \"Good Friday\" \n\nThe Special Train left again at 1-45Pm again for Vron for us to see more Boxing Contests, a large number going up and when we arrived at the Stadium a few minutes after two Pm, \nthe\n it was crowded, still we all managed to obtain a good seat. At 2.30 \nthe first\n the Orchestra gave us a lively tune which put us all in a good humor, and then the first combatants put in an appearance, between 2.30 &4.30 there were 10 contests decided, Batam Weights, Feather Weights, Light Weights and Welter Weights, one or two contests were a bit onesided, but in the others\n\n \n\na good fight was put up by each lad. The decisions given by the Referee was well received and each Winner was well cheered, in these Contests the Referee sat down on a raised platform and gave instructions, which was freely commented on by the boys, I always thought that a Referee’s place is in the Ring with the Boxer’s, but it was not so in this case. A fair number of the Boys returned by the Special to Pende for Tea returning again at 6.45Pm for the Cinema. The Hall was again packed and a good set of Pictures was shewn. A good Pinaist gave us several good tunes during the Evening and the boys joined in some singing & others Whistling in between the Pictures great fun was caused by the Boys barracking one another and cheering all and sundry, a few Girls attended but I did not notice any W.A.A.C. Girls, their reception the night before was the cause of their absence. After the Show we all returned home after a first class day’s outing which will always be remembered by the Boys.\n\n \n","38":" A Special Train ran again to Vron for the boys to witness The Lena Ashwell’s Dramatic Party leaving the Depot at 6.45Pm. A large number journeyed on it arriving at Vron a little after 7 P m, we all obtained a good seat although the Hall was filling up fast. At 7.30 the Orchestra struck up a lively tune which the boys all joined in. The Hall was now just about packed Standing Room only was obtained at the back. The Drama staged was called \"General Post\" and 3 Ladies & 3 Gentleman formed the Party. It was a Militiary Play, a period prior to the War 1913&1915. and when Peace was declared 1919. The Party in their splendid acting interested the Boys right throughout, as each Act terminated, the Party were recalled again & again, and applauded, At 9-45 The Curtain was rung down for the last time and the \nHouse\n Boys were played out by a lively tune from the Orchestra, no doubt each one well satisfied and enjoyed a grand evening’s Entertainment.\n\n \n\nAs soon as all the Boys had joined the Train it started and soon we were all home again and after some Supper turned in.\n","39":" was spent very quiet in Camp, the weather was fairly cold with a strong Wind blowing. Some of the Boys went out promenading, but the majority remained in Camp.\n\nMonday\n","40":"\n\nNothing doing in Camp all day until 4 Pm when Tea was served, and at 4.30 another Special ran to Vron, and we all went up again, this time to witness the Final Contests in the N.C.O’s & Men Boxing Competitions, which started at 5 Pm in the Stadium, and again it was packed, and we were treated to several splendid contests, the first and last Bouts were decided in the first round, but the five others were very evenly fought out, and the Winners were cheered by their supporters. As there were a Ball for the Officers at 8.30Pm, we all returned by Train at 7Pm and finished the Evening playing Cards etc.\n\n \n","41":" A Parade was called at 10am for Medical Inspection by an Australian Medical Officer, we were called out in Alphabetical Order, and went into the Y.M.C.A Tent and had to strip to be measured and sounded by the M.O. and all marks on the body noted on the Embarkation History Sheet. At 3.30 we all had to parade again, and each Platoon 3 in all had their Photo’s taken by Serg. Major E. Howe and then formed up again near the Officer’s Quarters, where Lieut Colonel Paget on behalf of Brigadier General Cruickshank Chief Director of Railway Transport in France thank the Officer’s and Men of the Company for their good work in Belgium and France and wished the Coy a Safe & Pleasant journey back to Australia. Afterwards a Photo was taken of the Company on parade and then we were dismissed for Tea and away to Vron again to witness Miss Lena Ashwell’s Dramatic Party in a play entitled \"Billeted\" and we all spent a very enjoyable Evening, it was\n\n \n\nanother Militiary Drama and well acted by the Company.\n","42":" A Parade was called for 10 am to go before a Medical Board, but the Officers of the Board did not put in appearance at all, and we had to remain about, until 4 Pm when Tea was served and at 4.30 we left again for Vron to see the final Contests in the Officer’s Competitions. The first contest, was Light Weight, and then Middle Weight, Welter, and Heavy Weight, each Contest went the full three rounds, and well fought, a good fight each time was put up by the Officer’s, Afterwards we has to amuse ourselves until 7.30, in the meantime several of us were sitting down on a Seat having a chat, when all of a sudden our attention was attracted to a humming sound up in the Air, on looking up we saw an Aeroplane coming down in a circle just beyond a Wood, and the next moment heard a crash as the Plane struck the Ground, and then smoke started to arise, we all started to run over to it.\n\n \n\nMen were running towards it from all directions and as we got near the Wood, could see the Flames and smoke quiet clear and hear the Explosions of the ammunition and see the traceing bullets flying in all directions, we did not venture to close as the Machine was in flames and burning fiercely, we soon learnt that the Pilot and Mechanic had got clear with the exception of slight burn’s about the face and legs. The had a very lucky escape as the Plane stuck the tops of several Trees and somewhat broke the fall. After about \nan\n half an hour there was nothing left, only twisted parts and ashes, after we had satisfied our curiosity, we returned and formed up in a Queue waiting to go into the Hall, to witness the Presentation of Prizes won at the Sports, and another concert given by Miss Lena Ashwell’s Concert Party. At 8 Pm after another splendid tune given by the Orchestra the Curtain was drawn up to a packed house everywhere, we were lucky and got a good seat close up. On the stage was a long table with several large Silver Cups\n\n \n\nwith small miniature ones, and the Prizes were given out by Brigadier General Higgin’s assisted by Lieut Col Davis, both of the Royal \nFlying\n Air Force. As each Team and individual’s name were called out, they marched in on to the stage and facing the Officer’s stood to attention and saluted, repeating the Salute after receiving their Cup or Medal and then were marched off to a lot of cheering from their comrades. After a pleasant speech by the Brigadier General, thanking everybody for making the Sports the grand success it was and thanking Lieut Col Davis for coming over from Headquarters in England and giving them every assistance, he called for Three Cheers, which were heartily given by all the Boys, then Lieut Col Davis called for 3 Cheers for the Brigadier General, which were also given which proved that he is held in high esteem by all. The Curtain was then lowerd and way was made for the Concert. The Orchestra kept the boys in good humor by playing some lively tunes. At 8.45 the Curtain was raised again and the Concert started, The Party\n\n \n\nconsisted of 4 ladies, one playing the Piano, one a Violin, and one an Elocutionist and the \n other Lady\n other a Saprona, the last named sang four songs, \nand\n The Lady having a very sweet voice and very clear, and received a splendid reception, the Lady Violinist was a beautiful player, and handled her Instrument very well, likewise her efforts were encored over and over again. The Lady Elocutionist was very amusing in her recitations and caused a lot of laughter, being recalled again and again.\n\n At 10 Pm the National Anthem was sung and the boys came out each well satisfied of witnessing a splendid Evening’s Entertainment. These Dramatic and Concert Parties organised by Miss Lena Ashwell deserve every praise for their coming over amongst us and trying to make the boys forget they are away from their Homes and Families, and bring some Sunshine into their monotonous life on Active Service. It did not take us long to board our Train and soon was back at the Depot. \n\n \n","43":" 1919\n\nWe are still awaiting for the Medical Board to come along, and have to remain in Camp. After Tea this evening we all are to pack up and remove into the Vans, sleeping in them tonight ready to start on our journey to la Havre for Demobilisation, tomorrow morning about 9am.\n\nFriday 25th 1919 April\n\n Reveille was sounded at 5am. Breakfast was served at 6 am and we all had to be in the Vans before 6.45 as at at 7am the 6th Coy. was brought down and their Van’s were shunted on to the Rear of our Vans and at 8am the right away was blown and we move off amidst cheering and the exploding of detonators on the rails, in a few minutes we arrived at Conchil le Temple and there had to wait for the French Engine and Guards which duly arrived and we departed at 9.30 am passing through Abbeville and the outskirts of Amiens arriving at Bacouel at 12.30 Pm were we were shunted into the siding, as the Engine(a German Machine)\n\n \n\nwas in trouble owing to bad coal, and the fire had to be cleaned which took the Fireman over an hour, and a half and we left again at 2.30Pm, and the next stop was Romescamp at 3.55Pm where the Engine was changed for another, left again at 5.30 and after a good run we arrived at La Havre at 10.30Pm, we all were well down to it and asleep and was not disturbed until 6am.\n","44":"\n\n We had to roll up our blankets and put them in a heap on a ramp and our Kit Bags in a heap and then after a hot drink of Cocoa with a dash of Rum in it, we all formed up in fours out on the road No 5 Coy leading and left with a Guide at 6.20am for the Receiving Depot at No 3 Australian Base Depot, at Rouelles arriving there at 7am after one spell along the road, we all were formed up and then marched away to Huts, and after a good wash Breakfast was served at 8am, in a large Hut, we soon learnt that 1.2.3. &4th Coy’s. of Railways had arrived and were awaiting our arrival. After Dinner we were ordered to parade and hand in some clothes and would be issued\n\n \n\nwith new ones, also all spare Gear, such as Packs, Belts, Webequipment etc. also at 3Pm we had to go through the \"Delowser\", which means a Hot Bath and Medical Inspection, the Coy lined up and a Sergeant Major gave us certain instructions, how to go through the \"Delowser\", and then we marched to a Window and was handed a Bag for our Valuables and two pieces of Wood with numbers on with string attatched, and away through a Door where a Digger ask \nus\n each our number, and was shown a little space where to undress, one number had to be tied to our Boots, and the other around our Neck. We had to hang our Overcoat, Tunic & Trousers on a Bracket, when a German came along and took the Bracket along with the others and away they went into the Fumigater on a Trolly passing over charcoal Fumes to kill all Vermin, after removing our Underclothing another German collected them and we then walked along and handed in our Boots, to another German, and our Bag containing our Valuables over a counter and in our Turn marched into a room before the Doctor who\n\nexamined \nour\n each man for skin or Venereal Disease and our name ticked off a list and then in under Hot Showers with plenty of Soap, were we all had a good wash and coming out we received a Towel and then on giving our Number, we received our Boots, and a Sea Kit Bag containing a Flannel, Shirt, Drawers, and Sox’s, and then along came our Uniform from the Fumigator, and once dressed we went out and handed our Number at a Window and received our Bag of Valuables handing back the bag when empty, the whole process taking about ½ an hour, no waiting, no delay, and bustling, all working together like a piece of Machinery, which gave us all a good impression and opened our eyes at the number of Men handled so quick. After Tea we had to parade and March over with our Kit’s to No 1 A.B.D. Camp where 26 Men were put into Bow Hut and three Blankets supplied to each man. As there were a large number of Men in this Camp, word came along during the Evening for us to parade at 8 am for Breakfast, 2nd Sitting.\n","45":"\n","46":"\n\nAfter a cold night’s sleep, three Blankets not being enough to keep us warm, and large cracks in the floor of the Hut, I for one did a perish and intend hunting up some more Blankets during the day, we lined up about 8 am and marched in two deep into a large Dining Room, where a Digger directed us to the Table’s, 8 each side and we were well packed, in fact too many on each side and we hardly had room to move our arms, There are no arguments about Mess Orderlies, the two Men on the end have to serve out the Food which are in dishes on to plates and Tea into Cups and they are passed along, There are sufficient Table’s to seat 420 Men at one sitting, The System is good causing no delays and every man has his share. On coming out you bring along your Plate and cup and place them boxes provided and outside is a Bucket of Hot Water \nprovided\n to wash your knife, fork & spoon.\n\n During the day we renewed old acquaintances from other companies, & met plenty of friends. After Tea Pictures were held in the Cinema called the \"Mildura Hut\" and afterwards supper of Bread & Cheese &\n\nCocoa, I managed during the Day to get two more Blankets and slept much warmer all night. \nMonday\n All day Sunday it was very Wet & miserable.\n","47":"\n\nAll the morning it was wet & miserable, but after Dinner it cleared up a little, so I went with a chum into La Havre and while awaiting the Train, along came a Motor Wagon and a lot of us scrambled into it and had a ride into the Town, both of us had to do some business first and then we strolled around for a while, but it was still wet & miserable and we kept going until after 3Pm when we went into the Crystal Palace Y.M.C.A, a fine building with two rows of Galleries, the first is where Meals are provided, at reasonable rates and the 2nd Gallery is for Writing & Reading, at one end of the first Gallery is a Picture Screen and at the other is a Machine erected on a staging and Pictures were shewn at 7 Pm. After writing two letters we both had our Tea and as it was fine, we went out for a walk until 7 Pm. La Havre is very much like all the other French towns I have seen, with it’s narrow streets \n\nand Cobble stones, and has a fair size population. The Tramway Employee’s being on strike, no Car’s were run. A large number of people were out promenading with a fair sprinkling of \nKhaki\n Tommies & Aussie’s in Khaki. We returned again at 7 Pm and saw portion of a Picture having to leave at 8 Pm for the station to catch the Train for the Camp leaving at 8.30Pm arriving at the Camp at 9Pm and once again turned in.\n","48":"\n\nAfter Breakfast we received our new underclothes and after Dinner we went along for changes of clothes & Boots, and after Tea into the Cinema to Pictures and a Atheletic Demonstration by a Troupe of Aussie’s, who were very clever in Balancing, Club Swinging, Wrestling etc, and we all spent a very enjoyable Evening up to 8Pm when after Supper we again turned in.\n","49":"\n\nAll the morning I was busy writing in the Diary. After Dinner I took things easy for the Afternoon laying down reading. After Tea I went over to\n\nthe Lismore Recreation Hut in the Reception Camp where some Pictures were shewn from 5 to 7 Pm, then a Canadian Concert Party, entertained us until 8 Pm with several items which were well received. Afterwards I came back to Camp and had some Supper and turned in.\n","50":"\n\nDuring the night rain had set in and when we awoke it was wet and miserable. A Parade was called for 7 am when the roll was called to see if all hands were in Camp, it was raining all the time and we were kept on Parade for 45\" and the boys were very restless, as it was not the game to keep us standing in the Mud, after the roll was called, after a lot of barracking we were dismissed for Breakfast. We Paraded again at 11.30 when the Rain had stopped and each man was handed his Embarkation Card to be handed to the Officer on going on the Boat, After Dinner we each took our big Kit Bag away to a Wagon and at 1-15 Pm we all paraded with our Sea Kit Bags and were formed\n\nup and marched away to the Wagons and were told off in lots of 24 and two N.C.O’s for each Wagon, 24 Men in each Motor Wagon was any amount and we were not to crowded, after the Six companies had all got into the Wagon’s, which took about 40 Wagons we moved off at 1-45 Pm for La Havre, and after a good run of about five miles we arrived at the Wharf and paraded in respective Coy’s, and at 2.30 Pm a start was made to go aboard, No 1 Coy leading off in single file the other’s following. We embarked from exactly the same place as when we came first to France two year’s ago all but 10 days, it did not take long to have us all aboard and we soon made ourselves comfortable, the Weather now was fine and promised a good Trip. The name of the Boat was the St George and had two funnels and was about 4000 Tons, a number of Tommies and Scotch Canadians made up our full complement, and after Life belts were issued we all had our Tea, having been issued on marching out of Camp with a bag of Bread & Cheese also Jam and Bully\n\nBeef., the Tea provided from the Boat’s Cookhouse was first class and we all enjoyed it . After Tea was finished the Whistle was blown at 4-15 Pm and at 4.30 Pm the Boat pulled away and started out for Southampton and we all were not sorry to leave France for good as we all had just about enough of the Country, Customs and Habits, being a Public Holiday all over France, ","51":"\n large numbers were out promenading along the Wharves and as we steamed down the Harbour, Hankerchiefs were waved to us as farewell’s, the weather still fine with scattered clowds and a fair breeze was blowing against us, and we soon was well out in the channel, the Boat soon started pitching and made itself felt amongst the Boys, it \ntake\n did not take long before they were hanging over the sides feeding the fishes. At 6 Pm Blankets were issued out, two to each man, and the boys who were bad soon got well down to it down below. I stayed below reading an Aussie Paper until I did not feel to well and came up on deck for fresh air and soon felt\n\na lot better. I remained on deck all the Evening and at 10 Pm the Sandown Light on the Port side was sighted likewise \nthe\n a light off the Isle of Wight, we had made good progress doing 14 to 15 knots on hour. I went down below at 10.30 Pm and laid down and slept until Midnight when the Boat dropped anchor in the Southampton Estuary and I awoke. I went up on Deck and obtained a hot drink of Tea and had some Bread & cheese which I enjoyed. There were very few \nabout\n boys about, all being well asleep, up on deck and down below. I turned in again at 1 am and \nslept\n soon was fast asleep and at 6am order’s came along to roll up Blankets and draw Tea for Breakfast, which consisted of Bully and Bread, at 7 am the Boat weighed anchor and started up the Waters to Southampton and during the Trip we passed the Netley Hospital also a number of Mine Sweepers in two’s anchored together. We gradually came up to our Berth and made fast at 8.15 am and in a few minutes we started to go ashore and on reaching the end of the Gangway we were issued a Ticket for a Mug of Tea\n\na Bun and a piece of chocolate from the \nArmy\n Navy and \nNavy\n Army Canteen Board free, and we formed up in a Queue and received them, we were all now in a large shed and in a few minutes the first Train backed in and Nos 1.2.&3 Coy’s were marched off into the Train and soon was away on their journey to Codford. In the meantime an impromptu Orchestra was formed and Dancing was indulged in by all the Boys, some taking part and others looking on. \nThe remaining Coy’s had to fall in out\n The second Train backed into the end of the shed at 10 am and we were then marched \nthrough the long\n along the Shed passing the Canteen where we received each man a paper bag containing one packet of Biscuits, 2 bar’s of chocolate, a meat pastie and a piece of cheese which we all appreciated and up alongside of the Train, as there were plenty of accomodation for the Troops, only six were put into each compartment, being","52":" class and very comfortable and with cushions on the seats. A Gentleman from the Navy & Army Canteen Board handed each Man a card to post home to Relatives notifying\n\nof their safe arrival in Southampton from France. When all was ready the Train drew out at 10.30 am with the boys cheering the N & A.C Board for the \nir\n splendid reception they gave them. In a few minutes we were travelling along the Wharves passing the Magnificent Liner \"Mauritania\" \"Liverpool\" of 37.500 Tons with four funnels painted Red and she looked grand tied up to the Wharf and on the other side, we passed \nour\n the \" Western Australia\" also tied up to a Wharf. The Weather still keeping fine we all enjoyed the ride passing through splendid Agricultural Country, with its green fields and newly ploughed up land, with Hare’s and \nPeasants about in\n Pheasants moving about. One felt glad to be back in Dear Old England once again, we made our first stop at Salisbury at 11-40am for the Engine to take Water and left again at 11-45 am and arrived at Codford at 12.20 Pm where we detrained and shortly marched away in four’s to our Camp, passing through the Village of Codford where we passed numbers of Australians out Walking. After two spells along \n\nthe Road we arrived at No 3 Camp at 1-30 Pm and we got a shock to see Tents provided for us, after passing great numbers of Huts and Camp’s all along the road, the Boys soon made their objections known by calling out \"What about the Huts\" and \"What do we all want\" \"Huts\", when we were told off in eights for a Tent, we refused, and our O.C. informed the Colonel of our objections and away he went to Headquarters for further instructions. The other Coy’s came out of their Tents amp; supported us. After Dinner was served out in the open, along came the Officers from Headquarters, and we were formed up in a square and Brigadier General Rosenthal gave us an address of Welcome back from France, and thanked us for our Work over there, and explained why it was necessary for us to go into Tents for four days, before going on Leave, as we all desired to come to England rather than hang about over there also to inform us that, if all goes well we will leave in about six weeks time for Australia, also answered any questions and give any information we desired, when we told\n\nhim that no boards were in the Tents, he gave us a promise that he would try and arrange for some to go into the Huts. After being issued with Mattresses and 4 Blankets, word came along to our lines that the","53":" Coy could use the Huts for one night, and we soon shifted in, although several remained for the Night in Tents. After obtaining straw for the mattresses we soon made ourselves comfortable and being all tired turned in early.\n","54":"\n\nA General Parade of our Quota No 42 was called at 9am and we were marched away to No 4 Camp examined by a Medical Officer and innoculated on the left arm, afterwards being dismissed for the Day\n","55":"\n\nFrom last Saturday until today Thursday the time was passed very quietly in the Camp with the boys, the same every day, first a Parade and then dismissed for the day, after Dinner each\n\nday, the Boys would wander along the Road into the Village, visiting the Cinema, while others played Football in the Camp, and away up on top of a steep Hill is an excellent Football Ground where different Companies played one another. I strolled up on top one Afternoon when it was cool passing a large \"Rising Sun\" \nworked\n cut out on the slope of the Hill, 2 ½ chain’s in width by about 1 ¼ chain’s in depth, where the Turf was cut out, white stones were laid down and at the foot of the Crown. Black Ashes were also spread about, and from the Road way a distance of about 600 yds, the \"Rising Sun\" looked splendid and was commented favourably on by all the Boys. As we came into Codford from Southampton we could see the \"Rising Sun\" quite plan from the Train and little did we think that our Camp laid at the foot of it. After Dinner ","56":"\n Wednesday our Coy received their pay before going on leave. Whatever we had in our Pay Book to our credit \n\nwe received and those in arrears or under 4\/10\/- received only 4\/10\/-. Thursday, we were paid a further sum of 1\/4\/- being susistance allowance for 14 days.\n","57":" \n\n\"Revielle\" was sounded at 4.30 am and Breakfast was served at 5 am and after rolling up our Blankets \nand\n in ten’s, we had to put them with the Mattresses at the end of Tent’s and put our kit Bag’s in a Hut and be ready to fall in at 6am and receive our Passe’s and Railway Tickets’ and we then marched off at 6.20am for the station, Men proceeding to London leading and those for other part’s made up the second party. There were two Special Train’s, and as I was going only to London I went with the first lot and duly arrived at the Station at","58":" am and when all was ready the Train drew out at 7.30 ; as there were plenty of Carriages there were plenty of room only 6 men in each compartment,","59":" class which was very comfortable with it’s Cushion Seat’s.\n\nWe had a powerful Great Western Engine to haul the Train and we enjoyed the journey to London making three stop’s enroute, passing through beautiful Country, which was a treat to look at, what with Garden Nurseries and fields under Crop’s with the Green Hedges and Chestnut Tree’s and delightful Weather made the journey very interesting to the eye. We arrived at Paddington Station at 10.45 am and a lot of us went into the Free Buffet for a Cup of Tea, Biscuits or Sandwiches which we all enjoyed as we were somewhat hungry. I then said Goodbye to several friends and made my way by the Metropolitan Railway out to Willesden Green to my Sister’s house where I arrived a little after 12 noon. I found her and her daughter in good health and after a good Lunch \nI\n we spent the Afternoon quietly. Having an appointment to keep, after Tea I left by Bus for Finsbury Park \npassing\n. As it was a delightful Evening I rode on top of the Bus passing down Willesden Lane where\n\na large number of beautiful Home’s were built with nice Lawns and all kind’s of Ornamental Trees and turning then into Edgeware Road right away down to Marble Arch. The Traffic all along this road is very heavy especially through the Business part’s, Busses and Taxi Car’s going to and fro in large numbers. I continued past the Arch and down along Oxford Street into Holburn, \nall\n where the Traffic was very heavy and we were held up nearly at each intersection eventually arriving at the Holburn Tube where I caught a Train to Finsbury Park meeting my friend at the appointed place and we returned back to Hyde Park Corner and spent the evening promenading in the Park listening to the Music supplied by the Coldstream Guards’ Band. There were thousands walking about and sitting on the Chair’s which a charge of 1d is made for the Evening. This place is one of London’s beauty spots and largely availed off, along the Drive\n\nduring the Evening large numbers of Taxi Car’s and private Carriages were journeying up and down. The Band play’s regularly every Afternoon from 3 to 5 Pm and then from 7 until 9 Pm when the Crowd’s start to return to their homes. After spending an enjoyable evening we returned with the Crowd to Hyde park Corner where the traffic for some time was very thick, and one had to be very careful crossing the Road’s to Green Park or towards Victoria. We travelled by Tube back to Finsbury Park which was very packed and along to my friend’s home where I said Good Night and returned via Tube & Metro Railway to my home at Willesden. I arranged with my Sister to spend my 14 day’s leave with her and \nher daughter\n she being at liberty we both visited several places of Interest, including the Principal Theatre’s, \nand\n where we witnessed several splendid Drama’s and saw London’s best Dramatic Artists. The first Theatre visited was the \"Empire\" were the \"Lilac Diamond\" was\n\nplayed, then next to St James Theatre were \"Eyes of Youth\" was shewn, then to the Lyceum where \" The Naughty Wife\" was funny, also Fair & Warmer in the Lyric Theatre and lastly to \nthe\n Daly’s Theatre where \" The Maid of the Mountains\" was being played for over 1,000 times and still commands crowded Houses, which no wonder as the Scenery and Acting was a treat and the Music and Singing was worth coming a long way to hear. One After we both visited the Grafton Galleries where a large number of beautiful Paintings of Aeroplane’s and Airship’s and Observation Balloons, Fight’s in the Air and Bombing Railway Depot’s and the Enemy Lines where a feature of the Exhibition. Another lovely spot visited was Kew Garden’s which were at their best, the beautiful Green Lawns and Trees. Hedges and Flowers was a Glorius Sight and we spent a grand time walking about, and resting under the Shade of the Chestnut Tree’s. My Nephew \n\ncame up from Weymouth and I spent two days with him, riding about on the Train’s & Busses and visiting Cinema’s also my Brother came up on leave on Monday the","60":" \nalso\n from Weymouth and my Sister and him and I went out on Tuesday and Wednesday sightseeing, visiting the Park. After a splendid time my last Leave in England came to an end on Thursday the","61":" and I must confess I was getting really tired of my Holiday’s and to get back to Camp and prepare for my long journey home to Australia. \n","62":" Evening and all day Thursday I spent saying Good Bye to my friends in and around London and after Tea I thanked the Lady where my Sister was staying whose daughter gave me 3 nice books to read in Camp and finally saying Good Bye to my Sister who had given me a most enjoyable time, which I was very thankful for. I left at 6.30 Pm by Buss along Edgeware Road to Praed Street and then into the Paddington Station visiting the Buffet for a cup of Tea and was given a couple\n\nof Sandwiches. I passed out and through the Barrier and along to the Special Train waiting and as the Weather was hot and close I was glad to get a seat and have a rest. The long Train was packed and at 7.20 Pm the Whistle blew and we were off to our Camp once again. Once out of London the Train gained speed until we were travelling at 60 miles an hour in several places, cutting out the first 22 miles in 20 minutes, and as the Permanent Way was in good order we had a very comfortable ride, through lovely Country, and \npretty\n towns with it’s rows of Pretty Homes, and crossing the Thames several times with its overhanging Trees, passing a splendid Racecourse and getting a glimpse of Windsor Castle with the Union Jack flying from the Flagstaff on top of the Tower. After only two stop’s and a very interesting journey we arrived at Codford at 9.45 Pm coming down from London in 2 ½ hrs, all hands detrained and settled down to a three mile walk to No 2 \n\nCamp, but when we were passing No 3 Camp word came down the Road to return as our Quarter’s were altered to No 6 Camp. After a brief spell we all returned and arrived at the Camp at about 11 Pm, where we Alphabetically were allotted our Hut’s and Companie’s and after handing in our Passe’s we made for our respective Hut’s. We are now drafted into Companies for Each State we come from.\n","63":" \n\nAfter Breakfast we paraded for a Roll Call and to go and draw our Kit Bag’s which had been brought down to the Camp, also to go and be inoculated and then off duty for the day. There are 32 men in each Hut and we are not overcrowded and when we receive out Mattresses and having the Electric Light in each Hut, we will be comfortable until we leave for the Boat which we all hope will not be long. After Dinner I received \na\n 7 letters from Home and spent the Afternoon reading the news and my Papers.\n\nFrom","64":" until","65":" the Boys in Camp passed the time away quietly, parading for a Roll Call every Morning, and then were dismissed for the day. When not on Fatigue Work they played Cricket and laid down and took things easy generally until after Tea when most of them went out into the Village for a promenade, what with the Y.M.C.A. Soldiers Hut and the R.C. Hut and a Free Picture Show every Evening in the Salvation Army Hut, proceeded by Singing Hymns from 6.30 until 7.15 Pm and then Pictures until 9 Pm, also Two Bands gave several performance’s outside the Huts Likewise our Railway Band after being strengthened by additional players rendered some splendid Tunes. As I took on the duties of Mess Orderly of our Hut I had plenty to occupy my time, and enjoyed the Evening’s promenade, also I volunteered to assist to sweep out the Y.M.C.A Hut every\n\nEvening after 9Pm Closing time. All the time we were in Camp at this place we enjoyed beautiful Weather, the Evenings being cool. On","66":" I was instructed to stand bye with my Kit packed to join the Advance Party for the Boat, and during the Afternoon I paraded for my Boat Pay and was instructed to be ready to move off at 12 noon next day.\n","67":" \n\nAfter having an early dinner we the Advance Party paraded and we moved off at 12 noon, 28 strong placing our Heavy Kit bags in a Wagon, we marched to Codford Station and when the Train drew in at 12.45 Pm we joined it and at 1Pm we started on our journey to London and after a pleasant run of 3 hours arrived at Paddington Station, where a Guide from Head Quarters instructed us to proceed to the War Chest Club in Horseferry Road where we received 3 Tickets, 2 for Meals & 1 for a Bed and was told to fall in at 8.15 am to entrain for Surry Docks\n\nthen we were dismissed for the Evening. After having a Shave and a Brush Up and some Tea, I then caught a Bus out to Harringay to see a Friend & say Good Bye. As I was not expected I naturally gave her a surprise, anyhow we went for a walk into Finsbury Park and spent the evening chatting and watching the Boys flying their Kites, until 10 Pm when I came back with my Friend and bade her Good Bye until I am fortunate to manage another Trip to England. I returned by Bus to the Club and after Supper I turned in for the Night sleeping in a large Dormitory containing 500 Bed’s which were nearly all occupied by Australians on Leave.\n","68":" \n\nAfter a bad night’s rest due to me being in strange quarters and the Light being on all night I awoke and dressed at 7 am and after Breakfast I obtained my Kit Bag’s and at 8.15 am we lined up outside\n\nand was marched off to St James Park Tube were we took the Train to \nWaterloo\n Liverpool St Station, changing then into another for Surrey Dock’s arriving \nat the\n there at 9.45 am where we all put our Kits into a wagon and after 15 minutes walk we arrived at the Dock were our Boat was tied up. Our first glimpse of the Boat pleased us all as as she is a fairly large one of about 13,000 Tons, and named \"Konigin Luise\" belonging to the North German Loyd before the War and now being run in the interest of the Orient Line. It did not take us long to go aboard when we put our Kits down and awaited further orders. After a little while we were lined up and the Roll Called and then marched down to No 4 Troop Deck ahead of the First Saloon, our Party formed up into two Messe’s and Mess Orderlies were called for, so I volunteered for one and then we drew our Utensils and cutlery\n\nalso Hammocks & Blankets and after placing our Kits away, we were free until 1 Pm and then I had a good look over the Ship. We were all satisfied with our Quarters as everything is new and very clean and the Troop Deck is very wide and well ventilated, She is a splendid Boat and well fitted out and only if she is fast we will have a fast & pleasant Trip home to Australia going via the Cape. The Boys spent the Afternoon wandering about and after Tea several went ashore and up to London. I did not go ashore and spent the Evening sitting on deck watching the Loading going on. The Boat is taking 1,300 Troops and a large number of Passengers in the 1st 2nd &3rd Saloon’s mostly Families of Soldiers and Officers Wives. They are joining us either at Tilbury or Devonport where the Troops are coming aboard.\n","69":"\n\nAfter a br\nAfter Breakfast our Advance Party of\n\n28 Men were put into a Permanent Mess of 14 each and Orderlies for the Voyage was called for and I volunteered and will officiate for the Trip. We have got the best part of our Troop Deck, plenty of light and ventilation. There is accomadation for 480 Men and still plenty of room as it is very wide and everything is clean, the fittings all being new. I was a bit restless the first night sleeping in my Hammock, but was very comfortable and will soon get used to it. We draw Meals at 8 am 12 noon and 5 Pm and from all appearances the food is splendid, plenty of it and well cooked, The Bread is really delicious, we draw it at 7.30am, 5 long loaves per day and nice and fresh, quite a treat after the stale bread in France. All day long the Boys were doing Fatigue Work loading & stowing Red Cross stores and Y.M.C.A & Canteen Supplies. At 5 Pm High Tide, our Good Ship was pulled out of the Dock and backed down through the channel into the Thames which took them 1 ¼ hours as she is so long\n\nand Broad and just clearing in between the Lock Gates, once out into the River, two Tug’s in the lead assisted her \non\npart of the Way. A fair number of people lined the Channel and cheered us on our way and the boys returned the cheering. The Trip down the River was a treat for us all and very interesting, the large Docks on both sides containing large numbers of steamers, especially Tilbury Docks and Factories of every Description built on the edge of the Water, it took us 1 ¾ hours to make Tilbury where our Tug’s were let go and we continued at slow speed right out of the River and into the Channel. We all amused ourselves watching all there were to be seen until Bed Time when we slung our Hammocks and turned in at about 11 Pm.\n","70":" \n\nI was up and dressed at 7 am after sleeping \nvery\n splendid in my Hammock, and went up on deck and soon found that we were going very slow and it was raining with a thick Mist \n\nand the Fog Horn was blowing very frequent. I timed the Log by my Watch and it registered 1 Mile in five minutes, so at that rate we don’t expect to make Devonport until 4 am tomorrow. The sea is very calm and during the day it cleared up and it was enjoyable up on deck. The Boys are all well and their Appetites good so we are a happy Family. The Evening was spent playing Cards and Reading until Bed Time.\n\n","71":" \n\nAfter sleeping well in my Hammock I awoke and dressed at 7 am and when going up on Deck I could see that we were anchored at Plymouth close to three other large Steamers with Troops on board. During the Morning a Transport Officer came on board with a list of Men to sail by her, a little later I was sent for and was informed my name was not on the Roll, but was given the option of going away without my Papers or Pay Book and waiting for them to be sent out by a later boat, or going ashore\n\nto London and coming on in a week or two. My answer was, that I will remain on board and wait at home for my Papers, I was therefore placed on the Roll. At 12 noon the anchor was drawn up and we steamed slowly for Devonport up the Ply River and at 1 Pm we arrived and was made fast to the Wharf. A fair number of Families with their luggage was waiting on the Wharf, and the boys on board gave them a cheer and as each Motor Car arrived with a Digger and his Bride, they received a cheer and good natured barrack which all enjoyed. At 2 Pm the first Troop Train came alongside filled with Boys from several Camp’s including Codford where a large percentage of Railway Boys where left behind, only West Australians coming on, there were some \nbungling\n delay and a large number of Infantry Boys from the 16th, 44th & 51st Battalion came on and occupied the space No 4 Upper Deck reserved for the Railways. By this \n\ntime the Families were coming on board Aft and their luggage and at 3 Pm, the Railway’s came on board and were put down No 2 upper and lower Deck, through mismanagement of the Roll’s, the Boat was put back to sail at 11am Sunday, so some boys managed to get ashore for the Evening. As the number of Troops exceeded the Amount, word was passed around for any to volunteer to go ashore until a later boat and several N.C.O’s & Men gave in their names to go ashore in the Morning. The Evening \nwas\n passed very quietly and all hands were soon in their Hammocks, some sleeping on Deck everywhere.\n","72":"\n\n After a lot of waiting about due to the Messing arrangements not being in order Breakfast was served late and the Morning was taken up in getting the Men together who was going ashore and the Departure of the Boat was\n\nput back from noon until 6 Pm. During the Afternoon the Railway’s Band joined up with the 44th Band and gave us a few tunes to pass away the time. Tea was served at 5 Pm and well on time, The Siren blew and two Tug’s came alongside and in a few minutes the Lines were let go and we started on our long Voyage. On the Wharf a large number of Bluejackets were lined up \nand ch\n from the large number of Warships anchored in the Docks and River, Our Deck’s \nwere crowded\nand Rigging were crowded with Digger’s and cheers from the Wharf and Boats were returned by the Boys, whilst the Band on board played \"Good Bye-e-e\" and \"Auld Lang Syne\". After getting out into the River, the Boat turned and away we went with the Tug’s in the lead passing numbers of Warships whose Decks were lined with Jack Tar’s and they gave us three cheers which were\n\nreturned. Down the River we passed several training Ship,s for Boys, and the Boy’s were also lined up and at a Bugle Call an Officer Spoke through a Speaking Tube \"Farewell to the Australian Troop,s and a Safe journey home\" accompanied by three Ringing cheer’s from the Boys which was highly appreciated by the Troop’s on board. Greetings of farewell was waved from all sorts of Boats, Shape’s & Sizes and \"Coo’ee\" was heard from people along the Shore and answered from aboard, we \nleft\n let our Tug’s go at Plymouth and continued on in glorious weather, with a nice breeze blowing, we soon passed the Eddystone Lighthouse and Dear Old Blighty was being fast left behind. At 10.30Pm we passed the Lizard Lighthouse and the Main land soon was lost to view. All the Evening we maintained a speed of 12 nautical Miles per hour and hardly a movement of the\n\nBoat on the Water. I went along Aft and strolled amongst the Married Folk who were making themselves very comfortable in their Deck Chairs & on the Hatchway.\n","73":" \n\nWeather still fine and clear with only a few boys sick, although a large number of Women were Sick and very quiet. The Sea was very calm all day and the Boat was rolling slightly, during the Morning a Life belt parade was called but was messed up as the boy’s did not know were to line up and after a lot of barracking at the Officer’s expense they were dismissed and after instructions were issued we paraded again at 4 Pm with out belts, and was more satisfactory. Up to date the quantity and quality of food supplied to the Troops is very good and all are satisfied, likewise the parading of the Mess orderlies is now satisfactory and all grousing is done away with . After Tea I went aft \n\nand timed the log which registered 13 miles per hour while I was there the Deck Steward came along with the news \"Peace was signed at 5.30Pm today\" which was good news for all on board. I turned in my Hammock at 10 Pm after a pleasant day spent on board.\n\n"}}