{"Document Name":{"0":"Diary_0131","1":"Diary_0131","2":"Diary_0131","3":"Diary_0131","4":"Diary_0131","5":"Diary_0131","6":"Diary_0131","7":"Diary_0131","8":"Diary_0131","9":"Diary_0131","10":"Diary_0131","11":"Diary_0131","12":"Diary_0131","13":"Diary_0131","14":"Diary_0131","15":"Diary_0131","16":"Diary_0131","17":"Diary_0131","18":"Diary_0131","19":"Diary_0131","20":"Diary_0131","21":"Diary_0131","22":"Diary_0131","23":"Diary_0131","24":"Diary_0131","25":"Diary_0131","26":"Diary_0131","27":"Diary_0131","28":"Diary_0131","29":"Diary_0131","30":"Diary_0131","31":"Diary_0131","32":"Diary_0131","33":"Diary_0131","34":"Diary_0131","35":"Diary_0131","36":"Diary_0131","37":"Diary_0131","38":"Diary_0131","39":"Diary_0131","40":"Diary_0131","41":"Diary_0131","42":"Diary_0131","43":"Diary_0131","44":"Diary_0131","45":"Diary_0131"},"Date":{"0":"unknown","1":1746.0,"2":1747.0,"3":1753.0,"4":1754.0,"5":1755.0,"6":1756.0,"7":1757.0,"8":1758.0,"9":1759.0,"10":1760.0,"11":1761.0,"12":1762.0,"13":1764.0,"14":1768.0,"15":1769.0,"16":1770.0,"17":1771.0,"18":1772.0,"19":1773.0,"20":1774.0,"21":1775.0,"22":1776.0,"23":1777.0,"24":1778.0,"25":1779.0,"26":1780.0,"27":1781.0,"28":1791.0,"29":1796.0,"30":1797.0,"31":1802.0,"32":1803.0,"33":1804.0,"34":1805.0,"35":1830.0,"36":1831.0,"37":1842.0,"38":1843.0,"39":1844.0,"40":1847.0,"41":1848.0,"42":1849.0,"43":1850.0,"44":1851.0,"45":1852.0},"Entry":{"0":"\n\n","1":"\n\nThis is an unconscionable way in which to make use of a book given to us by a beneficent government for the express purpose of winning the war. But I justify myself with three reasons. \n\nX. The Army should not provide a book so obviously made for a diary.\n\nB. You cannot win a war on paper, which is what we seem to be attempting.\n\nY. I cannot get anything else suitable to use.\n\nHowever, enough, to it. A day or two ago while dozing in the early dawn I was woken up by a Turkish gun which started to shell the flat in front of us about ¼ mile off. It continued for about an hour\n\nand then knocked off, which gave me to think furiously, for, with this gun shelling from Shunet Nimrin which is just under the hills on the opposite side of the valley, the turk could make us very uncomfortable indeed as we would be under direct fire from direct observation & absolutely no cover.\n\nAnd also with Jane shelling from the N. & this gun from the E. our lot would be unenviable. So every night I have retired to my downy couch with the possible contingency of an already repulsive breakfast of cold greasy bacon rendered even more so by the advent of intermittent shells in addition.\n\nHowever he has not fired\n\nagain & of course the tale is that our 60 pdrs. have knocked him out.\n\nIt is very circumstantial too. For they say that some of the","2":" Bgde. saw the flash of the gun at Shunet Nimrin & laid information & hence the battery opened & got him. Certain it is that they engaged him all right, that was obvious but if they succeeded in knocking him out well – they were lucky; one gun is not a large target at about seven miles.\n\nOf other news there is not much. The Battle section of Des. Corps H.Q.s & the big evacuating motor Ambulances from the Anzac Clearing Station have all gone to Jaffa, which points to something big happening there.\n\nDown there in the valley it strikes me that we are putting up a big bluff. They have several dummy camps, they keep moving the bgdes. from place to place in each case leaving wooden horses standing on the old horse lines while the actual line is being held by a mess of odds & ends, such as a few battalions of the Zion Corps (Jews) & the B.W. 1 & 2. I think that the Anz. Mount. Division is the only cavalry division left here now.\n","3":"\n\nNothing more about my leave. I think that they are under some misapprehension. Woken up early this morning by that damned gun the Turks have on the opposite side of the valley. Put some H.E.S. & Shrapnel into Jericho & killed a Bedouin.\n\nThen switched onto D.H.Q. & killed 2 & wounded 3. Knocked off after Breakfast. But continued again for about two hours in the afternoon not doing much damage. Then in a inconsequent way he sent one shrapnel over after dark about an hour ago. Hope he does not keep it up all night, I cannot sleep now with things like that about. I used to be able to but now I shake like a leaf if one goes off anywhere near.\n","4":"\n\nI am writing this by the moonlight. It is just about full now.\n\nThe Big Stunt is now on from all accounts. We have advanced 6 miles on the front from Nablus to Jaffa, & here we are ready to move at an hour’s notice. The idea being I suppose to follow the Turk up & contribute\n\nour mite to his general discomfort as soon as he begins to retire as I imagine he must do if we can swing our Left Flank round.\n\nThis morning at dawn I was awoken by two shots from the big gun – shrapnel over Jericho & then he shut up & fired no more until this afternoon when they tell me that he fired six more up the river but I was up at the","5":" Bgde. & heard nothing so I hae me doots.\n\nThe weather has improved tremendously the last few days being much cooler. The nights now are just lovely.\n","6":"\n","7":" has just sent over two dud shrapnel near the Dump at Jericho from Shunet Nimrin in the hills opposite us. I think it must be the same old Jane who used to shell us from Nablus Direction as we have not had any more from that side since this one started.\n\nThe Stunt from all accounts is exceeding all expectations. We have captured some 10000 prisoners, 125 guns, Haifa & Nazareth are in our hands & we have blown up a bridge near the Sea of Gallilee . We have captured the Turkish G.H.Q. almost intact I believe & things sound very good indeed.\n\nWhile we have been sitting down here in this damned Jordan Valley being potted at by a big gun it almost makes one weep. The Australian Division has come\n\nin for all the good things as usual.\n\nFrom all accounts every road & railway is cut off from the Turks except the Nablus-Es Salt road & the Hedjaz Railway which is off the map on the other page but which runs from Ammon – 20 miles east of Jordan – to Damascus.\n\nThere is also I am told a line of enemy retreating from Nablus 6 miles long.\n","8":"\n\nThe Stunt develops apace. 22000 prisoners counted already. And since yesterday the N.Z.s & 1st Bgdes captured the only Bridge left between Nablus & Es Salt & now we have the whole Turkish Army with the exception of those across the Jordan & two battalions who escaped, surrounded close to Nablus. The prisoners who come in are in an awful state. Last night they tried to bring them in but a great number died from exhaustion on the way, & others are\n\nhelpless with malaria.\n\nJericho Jane did not fire this morning and I think that it is gone. The turks are now evacuating Shunet Nimrin & Es Salt & there is a rumour.\n","9":"\n\n10 p.m.\n\nI was interrupted just there by the news that we were going that same evening & thus I had no more time to write.\n\nWe set out that evening & reached Shunet Nimrin at about 3 a.m. next morning, here we stayed until 11 a.m. when we entered the hills. The fires lit by the evacuating Enemy were still burning & on turning a corner in the wadi we were delighted to see Jericho Jane lying on her side in the stream with a dead Turk alongside her.\n\nShe was just what I thought she\n\nwas – a 5.9 naval gun.\n\nThere was a line of transport about","10":" miles long travelling up the wadi, the road was very bad & the general confusion indescribable while from time to time we would come on a terrible stink & find that the whole of the road for a hundred yds. or so was a veritable shambles of dead Turks, oxen, overturned limbers, & all sorts of guns scattered in all directions, where our Aircraft had been bombing. Had it not been for that it would have been very pretty for the scenery is beautiful in parts especially in bright moonlight as we saw it.\n\nWhen we got to Es Salt the road turned on itself several times & our planes had evidently done fearful execution, there was any\n\nquantity of transport, a battery of guns, oxen, turks, all lying in the middle of the road in a heap, each telling so plainly its own little tale of pitiful tragedy. Here was one man dead, he had been hit in the head. His comrades had bound his head up & made him comfortable in the gutter by the side of the road where he had fallen, pillowing his wounded head on his haversack. Presently, after having watched his comrades going by him & covering his pain-glazed eyes with dust, he had died in frightful agony as witness the furrows he had ploughed in the dust with his writhings. And so on & so forth. For the first time in the war the scene sickened me, it was too much like butchery, they had not got a chance. And I was \n\nheartily glad when after halting on the road past Es Salt from 3 a.m. till 2 p.m., we came out on to the top of the hills onto more rolling open country which did not smell of things dead.\n\nComing along at a good pace we came about 9 miles past Es Salt towards Ammon & there made camp at about 4 p.m. They were fighting at \nEs Salt\n Ammon all day today & I now hear that it fell this afternoon yielding only 150 prisoners.\n","11":" I expect we shall move on again in a day or two.\n\nAmmon is on the Hadjaz Railway hence its importance.\n","12":"\n\nAin Suweileh \n\nWe are moving out again at daylight tomorrow morning for Amman or thereabouts. As far as I can find out everything is right into our\n\nhands now the Turks being too disorganised both literally & morally to attempt anything. We have captured at least 3000 prisoners out here amongst whom were 25 Italians who had been captured on the Italian front & were working on the roads. They were of course delighted. Reveille tomorrow at 4.30 a.m. so more anon.\n","13":"\n\nAmman\n\nWe have been here now since yesterday afternoon.\n\nThere is an enormous quantity of guns & material at the station amongst which are some 8\" howitzers.\n\nAfter we had captured all the turks who had retreated from Shunet Nimrin, as far as I can gather we just sat down\n\nand waited for the force of Turks operating against the Sherif of Mecca to the South of Amman (from 6-10000 as rumours say) to give themselves up, as we held their base & they had neither arms & food.\n\nWhich they did this afternoon so now there is nothing here to keep us from moving north towards Damascus.\n\nOur Forces are reported to be 9 miles from Damascus & expected to be entering tonight. So we have been in the curious position of carrying on fighting almost 100 miles behind the Front Line.\n\nWhat will happen now I don’t know. Unless the turks can provide & send a brand new Army down to oppose us there\n\nis nothing to stop us as far as I can see from advancing straight on.\n\nAmmon is a dirty little place but I got the surprise of my life on going through it.\n\nJust on the left as one goes through there is an almost perfect old Roman Ampitheatre. The Columns & peristyles of the entrance are still standing & most of the Auditorium is complete. Unfortunately a road now runs through what was the arena though some of that is also left. In fact it is probably as good a representation as you would see anywhere & probably the only one extant outside Italy.\n\nI think we move tomorrow sometime.\n","14":"\n\nOn the","15":" we rose at the ghostly hour of 4 a.m. & proceeded to Aziza, a town on the Hedjaz railway 18 miles South of Amman, with the","16":" Regt. as escort in case of being attacked by Bedouins. All available transport came with us for the purpose of moving Turkish Stores & Sick & wounded Prisoners to here.\n\nThe 5th Regt. who took the place must have got the deuce of a lot of loot, for it had evidently been a big Turkish base. As it was there were two train loads of guns, ammunition, stores, etc., at the Station.\n\nIt was quite a pleasant ride out there, in fact I quite enjoyed it – as much as one enjoys anything these days. By which I mean the weather was\n\nnice, the sun shining & a cool breeze & I had plenty to eat. Beautiful rolling rich country out there, would be extremely rich if properly cultivated. In fact a very good snap for some “shrewd head\" with plenty of money after the war.\n\nWe loaded up with wounded & sick prisoners the next morning & came back here.\n\nI was sorry for the poor devils, some were in a frightful state & an 18 mile ride in a springless G.S. waggon over a bad road is pure murder to a sick man. We buried five altogether on the road, I suppose which was pretty good all things considered. I thought more would die myself, about 1% as we must have taken nearly 500 back. But it was unpleasant to watch the poor devils, every bump must\n\nhave given some of them pure hell.\n\nWe got back here, Amman, last night & they say that we are staying here a week yet. A current rumour throughout the regts. now is that we are going back to Jericho & there the 1914 men & unfit horses are going to be sorted out. The fit horses & men are then going up north Damascus way & the 1914 men are going to Australia. I see in the Kia-ora News that the Furlough has been granted. Personally were it not for considering what disapointment it would cause at home I should be inclined to stay & see the war out. I don’t think it can be much longer now. Still I suppose a man had best “get in while the goings good\".\n\nAnd anyway it has not been offered me yet!\n\nI should be sorry to miss seeing Damascus which I hear fell on the","17":" yielding 7000 prisoners which must be just about all now. I don’t see what is to stop them going right ahead until Turkey \nthroughs\n throws it in.\n","18":"\n\nStill here & from all accounts & appearances likely to remain here for some two or three weeks.\n\nWe have moved camp up to the station about a mile east of Ammon.\n\nThis is an awful place. It has been the Turkish camp, there are several dead turks buried – or I should say covered \n\nin our lines, rubbish everywhere & literally lousy with fleas. Yesterday I picked dozens off myself & did not go to sleep until about 3 a.m. this morning. It is absolutely the worst place I have ever been in for fleas.\n\nThe sickness is tremendous here, 300 have gone away sick from the","19":" Regt. alone & only a slightly less percentage from the other two Regts. & this in the last week alone. All malaria. There is some talk of us garrisoning this place which God forbid. But anyway I think our chance of seeing Damascus yet awhile is very remote.\n\nWe took Beirut unopposed on the","20":" they are still going ahead in front.\n","21":"\n\nThis morning I heard a rumour that the war was practically over. At which I laughed scornfully. However it seems pretty right from the news sheets of today. Germany has apparently completely climbed down chiefly owing to pressure from her Allies I expect.\n\nTonight it is rumoured that Hostilities have ceased!!\n\nIn fact it has been a day of great news. If this is true, now comes the really irksome part of waiting until we can get home.\n\nTwill be some time too I am afraid. There is no word of our moving from this flea ridden spot yet. Though they can’t stay here much longer, the","22":" Regt. is reduced to about 1000 & the other Regts. are not much better.\n","23":"\n\nSuweileh \n\nThe last week or so we have been scratching ourselves & swearing at the fleas in a camp near the Station at . Now we are taking captured stuff back to Es Salt from Ahiman – the most antiquated collection of tinware called guns that you could imagine. Two guns are smooth bore & bear the inscription “Essen 1874\". We have halted here for the night & I am writing this by the light of a gorgeous full moon.\n\nHeard a most cheering thing this morning. Eedy the pay Sgt. from D.H.Q. came down this morning & he declares that it has gone through a branch of D.H.Q. that \nall\n 1914 men\n\nare to be in Moascar on the","24":" I wonder. However it is very nice to hear.\n","25":"\n\nNothing official has come out officially ‘de re ’14’ but the Xmas mail has to be in by Nov. 1st & they say that there is a boat going on the","26":" from Suez. So if there is anything in it at all we ought to hear in a few days. Personally I am afraid it is a fable or there would have been something official out about it by now. At present we are back at the Station at Amman. They say that we are moving shortly but I can see no signs of it at present. Tonight it has clouded over & it has rained a little during the afternoon\n","27":" I am afraid that the wet weather is on us in earnest now. It is unfortunate. I had hoped that we would be back at Wadi Hinane \nbefore\n where the other two Bgdes. have made what appears to be a permanent camp, before the rain came.\n\nNow there is every probability of an unpleasant wet trek in front of us over two ranges of mountains before we can get settled down & watertight.\n\nSuiweileh,","28":"\n\nWhat a wonderful Prophet I am. We moved today directly it started to rain & are now faced with the pleasant prospect of a wet dreary trek right to Beisan which is where we are heading I believe. And so well a fervent prayer for good weather, to bed.\n\nJerusalem,","29":"\n\nJust heard that the war with Turkey expired at 12 noon today. Many say that it is also official that Austria has thrown it in. Anyway our little show is over & we shall never see Damascus or Aleppo. So that’s that. And as a result nearly everyone is drunk. Should probably be the same myself were circumstances more favourable.\n","30":" curiously enough the last shots we shall see fired will be those five Duds which Jericho Jane put over before she ran away. We shall be here until the 5 or","31":" & then go down to Wadi Hinane, I believe.\n\nWadi Hinane,","32":"\n\nThis is my Nunc Dimittis. On the 6th we reached Wadi Hinane, on the","33":" there were alarms & excursions the outcome of which was that all the 1914 men of 32 Coy A.A.S.C. were to depart in the Evening. This set me thinking, I enquired & found that the","34":" Bgde. came into camp about 4 oclock so last night I went over to the ambulance after tea expecting to find them all drunk in anticipation. To my surprise no one knew anything about it, so I got busy, made them ‘phone to Bgde. & Division, the result being that a wire was received about 9 p.m. stating that one allotment was 12. There are only 8 of us left now so that was all right. We then cracked three bottles of Champagne on the strength of it &\n\nthat running out we finished off a bottle of Brandy. Quelle meler! So here I am today expecting to get word to go at any time. Hence now, O Lord, lettest thou they servant depart in peace according to thy word. For mine eyes have seen the Great War of all thy peoples, etc., etc.\n\nMoascar,","35":"\n\nWe have arrived down here after the usual nightmare of a trip in open trucks. We should get onto the boat some day this week from all accounts.\n\nS.S. Port Darwin\n\nAt Sea,","36":"\n\nI am an extraordinarily unlucky individual. However I am hoping all may yet be well. And I will explain why I make moan.\n\nOn the night of the","37":" we got into open Trucks again – a scandalous proceeding that side of the Canal – about 11 p.m. & started for Suez. It was the coldest ride I have ever experienced I think. We we shunted about the docks at Suez for a long time & did not get opposite our boat the “Port Darwin\" until daylight. We then got on as our names were called & ticked off etc., etc.\n\nWe started after dark that same evening.\n\nNow this is where my bad luck becomes prominent. Bear in mind\n\nthat in 4½ years active service in the Field I had only been in Hosp. once. Two days after coming aboard I got the Flu. Came out of Hosp. 4 or 5 days afterwards & then discovered that I couldn’t eat or smoke. I doped myself with everything I could think of to no purpose. I hung on till we reached Colombo, & then I got a pain in my chest & went to Hospital again & was diagnosed Pleurisy which I think was wrong as I am all right again now about 4 days afterwards. But by this time I am a perfect skeleton.\n\nIt was curious when we first got aboard, one was meeting fellows you had not seen for two and three years. \n\nThey reckon we will hit Melbourne on the","38":" But I may be dead from starvation before then.\n\nWe have already had two deaths on board. Everyone is Malaria-ridden, the most unhealthy looking crowd – the L.H., that is – that I have ever met.\n\nAt Sea,","39":"\n\nI can now eat again & smoke thank God. And shall probably be pushed out of hospital tomorrow.\n\nThe Stars in their courses to say nothing of the Stokers seem to be fighting against our getting home for Xmas. There has been a strong headwind & a fairly choppy sea the last two days & the day’s run has dropped from 260 to about 220, so if it does not improve we shall not get to Melbourne until the","40":" or","41":" which will effectually stop me from\n\ngetting home as I have to spend at least two days in Sydney to have a Turkish Bath & get any clothes etc. However Kismet. Still it is annoying I should have liked to be home for Xmas. This is a terribly dull boat. Nothing to do, nothing to read, and I believe that they will fete us in Melbourne & Sydney which means more time lost.\n","42":"\n\nI personally have now given up all hope of spending Xmas on land. We have only just reached Freemantle today owing to a heavy head wind & sea most of the way from Colombo. Also we have to undergo short quarantine of two or three days & call at Albany to put off the Westralians\n\nwho were knocked back from landing here at the last minute. The crowd are getting a bit touchy at this continued messing about. They have been most quiet & orderly up to now, but if we get messed about much more, it will require only the smallest thing to start them & the whole guts of this boat will come out & go overboard. All notices by the Skipper are signed R. Craven, master. Derisive notices are being continually being posted up as,\n\nWanted, eight strong oarsmen to row the Port Darwin to Melbourne before Xmas.\n\nSigned, R. Craven\n\nMixture.\n\nand,\n\n“All troops desirous of reaching Melbourne by Xmas may dive over the Port side of the Foc’sle head at 0600 tomorrow morning & proceed to swim immediately.\n\nIt must be clearly understood that all troops availing themselves of this order do so at their own risk.\n\nWar Office\n\ng1244x.\n\nAnd so on & so forth, some really witty & others merely silly.\n\nHowever, we will get ashore some day I suppose. Inshallah. El Hamid Lillah!\n\nS.S. Port Darwin\n\nMelbourne heads,","43":"\n\nWe arrived here yesterday & went to the quarantine station here. The quarantine Authorities came aboard with pads over their mouths & noses whereat there was much merriment & jocose remarks at their expense.\n\nThey have put us in quarantine for 3 days, so that all going well we shall leave on Tuesday morning & with luck should reach Sydney on Xmas day, where I at any rate shall call a halt for several days.\n\nMeanwhile we have our Temps. taken & are shut into an overpoweringly hot whaling room. It is an anxious time too for but Hush.\n\nPort Melbourne,","44":"\n","45":" p.m.\n\nWe had a very anxious time today until Lunch time when the Ship was pronounced clean & was cleared. \n\nWe arrived at Port Melbourne at about 5 p.m. & the Victorians Disembarked into motor cars & departed amidst much merriment. There was a band & a Naval guard of honour. It was quite a funny sight. Later on the whole of the Ship was given leave. I did not go as we disembark tomorrow & spend the night in the train & so I don’t consider that it is worth while dissipating tonight. However I took a walk onto the base of the quay & was talking to the Naval guard\n\nthere when up steps a gentleman & enquires if it would be possible to get a message to a friend of his on board ship. I was going back there so of course I offered to take the message. He thanked me, wrote a message & had bad taste enough to put a shilling on it for me. It took the wind out of my sails for a bit but I did not like to refuse it & so I sent it back by the sailor who accompanied me. But ye Gods, I must have developed into a very low down looking individual! But then, Australians have eyes to see & see not.\n\nTomorrow we disembark into the train & reach Sydney on Boxing morning.\n\nAnd so with grateful relief I will close this noble Oddysey. And though I have many pleasant memories of my wanderings I hope I may never wander again under the aegis of the Army. Inshallah! El Hamid Lillah! Khalass.\n\n"}}