{"Document Name":{"0":"Diary_0398","1":"Diary_0398","2":"Diary_0398","3":"Diary_0398","4":"Diary_0398","5":"Diary_0398","6":"Diary_0398","7":"Diary_0398","8":"Diary_0398","9":"Diary_0398","10":"Diary_0398","11":"Diary_0398","12":"Diary_0398","13":"Diary_0398","14":"Diary_0398","15":"Diary_0398","16":"Diary_0398","17":"Diary_0398","18":"Diary_0398","19":"Diary_0398","20":"Diary_0398","21":"Diary_0398","22":"Diary_0398","23":"Diary_0398","24":"Diary_0398","25":"Diary_0398","26":"Diary_0398","27":"Diary_0398","28":"Diary_0398","29":"Diary_0398","30":"Diary_0398","31":"Diary_0398","32":"Diary_0398","33":"Diary_0398","34":"Diary_0398","35":"Diary_0398","36":"Diary_0398","37":"Diary_0398","38":"Diary_0398","39":"Diary_0398","40":"Diary_0398","41":"Diary_0398","42":"Diary_0398","43":"Diary_0398","44":"Diary_0398","45":"Diary_0398","46":"Diary_0398","47":"Diary_0398","48":"Diary_0398","49":"Diary_0398","50":"Diary_0398","51":"Diary_0398","52":"Diary_0398","53":"Diary_0398","54":"Diary_0398","55":"Diary_0398","56":"Diary_0398","57":"Diary_0398","58":"Diary_0398","59":"Diary_0398","60":"Diary_0398","61":"Diary_0398","62":"Diary_0398","63":"Diary_0398","64":"Diary_0398","65":"Diary_0398","66":"Diary_0398","67":"Diary_0398","68":"Diary_0398","69":"Diary_0398","70":"Diary_0398","71":"Diary_0398","72":"Diary_0398","73":"Diary_0398","74":"Diary_0398","75":"Diary_0398","76":"Diary_0398","77":"Diary_0398","78":"Diary_0398","79":"Diary_0398","80":"Diary_0398","81":"Diary_0398","82":"Diary_0398","83":"Diary_0398","84":"Diary_0398","85":"Diary_0398","86":"Diary_0398","87":"Diary_0398","88":"Diary_0398","89":"Diary_0398","90":"Diary_0398","91":"Diary_0398","92":"Diary_0398","93":"Diary_0398","94":"Diary_0398","95":"Diary_0398","96":"Diary_0398","97":"Diary_0398","98":"Diary_0398","99":"Diary_0398","100":"Diary_0398","101":"Diary_0398","102":"Diary_0398","103":"Diary_0398","104":"Diary_0398","105":"Diary_0398","106":"Diary_0398","107":"Diary_0398","108":"Diary_0398","109":"Diary_0398","110":"Diary_0398","111":"Diary_0398","112":"Diary_0398","113":"Diary_0398","114":"Diary_0398","115":"Diary_0398","116":"Diary_0398","117":"Diary_0398","118":"Diary_0398","119":"Diary_0398","120":"Diary_0398","121":"Diary_0398","122":"Diary_0398","123":"Diary_0398","124":"Diary_0398","125":"Diary_0398","126":"Diary_0398","127":"Diary_0398","128":"Diary_0398","129":"Diary_0398","130":"Diary_0398","131":"Diary_0398","132":"Diary_0398","133":"Diary_0398","134":"Diary_0398","135":"Diary_0398","136":"Diary_0398","137":"Diary_0398","138":"Diary_0398","139":"Diary_0398","140":"Diary_0398","141":"Diary_0398","142":"Diary_0398","143":"Diary_0398"},"Date":{"0":"unknown","1":1204.0,"2":1205.0,"3":1206.0,"4":1207.0,"5":1208.0,"6":1209.0,"7":1210.0,"8":1211.0,"9":1212.0,"10":1213.0,"11":1214.0,"12":1215.0,"13":1216.0,"14":1217.0,"15":1218.0,"16":1219.0,"17":1220.0,"18":1221.0,"19":1222.0,"20":1223.0,"21":1224.0,"22":1225.0,"23":1226.0,"24":1227.0,"25":1228.0,"26":1229.0,"27":1230.0,"28":1231.0,"29":1232.0,"30":1233.0,"31":1234.0,"32":1235.0,"33":1236.0,"34":1237.0,"35":1238.0,"36":1240.0,"37":1241.0,"38":1242.0,"39":1243.0,"40":1244.0,"41":1245.0,"42":1246.0,"43":1247.0,"44":1248.0,"45":1249.0,"46":1250.0,"47":1251.0,"48":1252.0,"49":1253.0,"50":1254.0,"51":1255.0,"52":1256.0,"53":1257.0,"54":1258.0,"55":1259.0,"56":1260.0,"57":1261.0,"58":1262.0,"59":1263.0,"60":1264.0,"61":1265.0,"62":1266.0,"63":1267.0,"64":1268.0,"65":1269.0,"66":1270.0,"67":1271.0,"68":1272.0,"69":1273.0,"70":1274.0,"71":1275.0,"72":1276.0,"73":1277.0,"74":1278.0,"75":1279.0,"76":1280.0,"77":1281.0,"78":1282.0,"79":1283.0,"80":1284.0,"81":1285.0,"82":1286.0,"83":1287.0,"84":1288.0,"85":1289.0,"86":1290.0,"87":1291.0,"88":1292.0,"89":1293.0,"90":1294.0,"91":1295.0,"92":1298.0,"93":1299.0,"94":1300.0,"95":1302.0,"96":1303.0,"97":1304.0,"98":1305.0,"99":1306.0,"100":1307.0,"101":1308.0,"102":1309.0,"103":1310.0,"104":1311.0,"105":1312.0,"106":1313.0,"107":1314.0,"108":1315.0,"109":1316.0,"110":1317.0,"111":1318.0,"112":1319.0,"113":1320.0,"114":1321.0,"115":1322.0,"116":1323.0,"117":1324.0,"118":1325.0,"119":1326.0,"120":1327.0,"121":1328.0,"122":1329.0,"123":1330.0,"124":1331.0,"125":1332.0,"126":1333.0,"127":1334.0,"128":1335.0,"129":1336.0,"130":1337.0,"131":1338.0,"132":1339.0,"133":1340.0,"134":1341.0,"135":1342.0,"136":1343.0,"137":1344.0,"138":1345.0,"139":1346.0,"140":1347.0,"141":1348.0,"142":1349.0,"143":1350.0},"Entry":{"0":"\n\n","1":"\n\nPassed Eddystone Lighthouse. Arrived Plymouth about 1.45 a.m. Left boat about 10 a.m. – entrained in 3rd class carriages at Devonport Dockyard for Dinton nr. Salisbury. Arrived Dinton about 6 p.m. & at Hurdcott Camp No.11 about 8 p.m. Very cold, but carriages had steam heaters, made them very comfortable. Supplied at Queen St., Exeter with Buns & tea by Lady Mayoress & helpers.\n","2":"\n\nVery cold, frosty. Inspection in full marching order & dull during day.\n","3":"\n\nPlaced in contact as later developed mumps. Have drill, just the once during day though.\n","4":"\n\nLight fall of snow during day.\n","5":"\n\nVery cold, only ½ day drill. Did some sewing in afternoon.\n","6":"\n\nStill very cold – no church parade for contacts – sent washing down to farm at back of hut. About 3 p.m. went with Sowter over hill to south of camp. Small flakes of snow falling on top of hill. Splendid view of camps & scenery right along the valley, including some villages.\n","7":"\n\nAbout 6 inches snow fell during night. Came through window thus leaving good coating snow on my blankets. Drilled in hut during morning & route march in afternoon through Compton Chamberlain almost to Favant, passing numbers of camps.\n","8":"\n\nDrilled in the slush & snow on parade ground making feet very cold. In afternoon route march through Compton Chamberlain, Favant, Dinton & Barford back to camp; a distance of 9½ miles with full packs up.\n","9":"\n\nStill cold but drilled outside all day.\n","10":"\n\nHad Battalion drill as supposed to be reviewed by King at Bulford on Saturday.\n","11":"\n\nGood Friday & had a holiday.\n\nIn afternoon went with Smith, Strahan & Sowter to the church at Barford. It is 700 years old & has fine carvings on the altar. Has memorials engraved dated 1584, 1618 & numbers in the 1700s & early 1800s. Altogether was very interesting.\n","12":"\n\nFunniest Easter Saturday that I ever had. Paraded with full equipment, blankets, all belongings & changed our quarters to hut 20. Messed about on parade ground for about 2 hours before finally fixed up & during the process lumped our belongings all over the place. Weather not so cold & feet have not been warm since my arrival in England. In afternoon had route march to Barford. Roads being very hard, are inclined to make the feet sore. Saw aeroplane for 1st time.\n","13":"\n\nDaylight Saving started this morning. Reviewed at 11.30 a.m. by C.G. Wade from N.S.W. & some high military officers. Afternoon turned very cold & strong wind blowing. Took down laundry (with L.J. Smith) to the same farmhouse. Bought ½ mess tin full of cocoa from canteen for 3d. to wash down dinner. Plenty bread & soup for tea. Treacle & dripping rushed as usual but I got my share. Another aeroplane passed over camp this afternoon. Engines of it make tremendous noise.\n\nAssisted Pinchin adjust his equipment. After review Wade & party inspected around huts & mess room also kitchen. Had Miss Patman’s brother pointed out to me today. He is a sergeant.\n","14":"\n\nStrong wind blowing from West today which was exceptionally cold. Route march in afternoon about 1 mile beyond Barford towards Wilton. Storms of rain, sleet & snow passed over.\n","15":"\n\nLast night coldest night experienced so far & all the morning on the parade ground was very cold. Few flakes snow fell. Medical inspection in afternoon. Had neck of tunic made smaller during evening – cost 1\/6. Bitterly cold all day. Received letter & time table from Uncle Fred at Barrow.\n","16":"\n\nRained heavily during night making parade ground very slushy & slippery. Half day off in afternoon as going on picquet at 6.30 p.m., consequently missed a route march. About 9 p.m. party of men off \"Wiltshire\" arrived in camp.\n","17":"\n\nHeavy fall snow during night. Paraded sick with a cold, but not much satisfaction with it. Feel just as bad as ever, even after taking dose medicine & having throat painted. Received letter from Uncle Charlie in London. Had to parade sick again at 5 p.m. feeling very crook – temperature 102.\n\nDoctor gave me some tablets but not much good. Have to see him again in morning.\n","18":"\n\nSaw doctor in morning & sent to Fovant Hospital in ward 5. Feeling very off – case diagnosed as influenza. Temperature in morning 101 & in afternoon 100. Receiving good food.\n","19":"\n\nDid not sleep too well, feeling feverish & very restless. Temp. morning 100 & afternoon 101.2.\n","20":"\n\nHad another fairly bad night, but got in good sleep after 5 a.m. Temperature normal.\n","21":"\n\nSlept better last night & throat feeling much better. Case marked Tonsilitis.\n","22":"\n\nHad good sleep last night. Notice temperature slightly up & down all time. Throat feels much better in day time but becomes very sore when darkness comes.\n","23":"\n\nStill on the mend. Have not been ordered out of bed yet.\n","24":"\n\nGetting better & better every day. Weather outside does not seem nearly so cold.\n","25":"\n\nGot up today & enjoyed sitting in sun. Has been fine & sunshiney all day.\n","26":"\n\nHaving meals in dining hall today – get plenty to eat. Saw football match in afternoon.\n","27":"\n\nSunshine in morning but cloudy afternoon. During morning an aeroplane alighted in paddock close to hospital, but rose again before we had time to go & see it.\n","28":"\n\nNice fine but cloudy day. Expect to go out in day or two. Concert was given in dining hall during afternoon by visiting professionals & was very good.\n","29":"\n\nNice fine day. Went for walk in scrub adjoining hospital with \"Gunner\". In afternoon went over railway line & watched some \"Tommies\" playing Soccer.\n","30":"\n\nInclined to be cloudy. Being discharged tomorrow. Saw Rugby League match in afternoon between two Australian Pioneer teams.\n","31":"\n\nDischarged from hospital this morning. Came in Ambulance motor as far as No. 5 Camp & walked rest of way to No. 11. After dinner transferred to No. 12 Camp & in hut No. 13. Feeling very tired after walk. Rest of mates in No. 20 hut of 11 Camp in contact for another 24 days. Pennel & Brigden developing mumps.\n","32":"\n\nReported sick in morning & given light duty, but in meantime\n\nall non-contacts placed in draft for 6 division & had to march between 11 & 12 camps 4 times during the day – also handed in leather equipment & issued with the web.\n","33":"\n\nUp early in morning & marched to No. 11 with our full packs. Left our packs there & marched back for breakfast, then to No. 11 again & then marched to Dinton with packs up. Entrained there & went via Salisbury & Andover Junction to Ludgershall. Got out there & marched ½ mile to Windmill Hill Camp & joined up with D company 62nd Btn. of 6th Division. It is only a new camp of tents with wooden floors & everything is very rough so far & food very scarce. There are 13 in our tent which is a very tight squeeze.\n","34":"\n\nReveille at 7 a.m. & breakfast about 8 a.m. Had church parade at 9 a.m. & while it was on several aeroplanes were flying about. Afternoon went to Ludgershall to Soldiers Rest & sent p\/cards to Australia. After tea went with Ned to Y.M.C.A. at Perham Downs about 1½ miles across the valley.\n","35":"\n\nReveille 6.45 a.m. Breakfast about 7.30. Had little of everything in drill & lecture by Medical Officer. Afternoon dismissed about 3.45 p.m. Seven aeroplanes flew over all together & numbers of others about during the day. Went after tea to Ludgershall Y.M.C.A. & wrote a letter to find out Roy’s whereabouts.\n","36":"\n\nNice fine spring day. A big battle plane flew over in morning. After tea went to Perham Downs with Mooney for a hot bath.\n","37":"\n\nReveille 6.30 a.m. & food still very scarce. Several more aeroplanes flew over. Route march in afternoon about 4 miles. Paid 30\/- after tea, then went to the town with Dawson to post some letters.\n","38":"\n\nStarted at Bombing School this morning, also voted for Federal elections. Pay Books collected again in morning on account of shortage in money. After tea went to Perham Downs for hot bath. Then to Y.M.C.A. for some supper & note paper.\n","39":"\n\nGeneral clean out in tents this morning – no bombing class on account of medical inspection. Afternoon went route march about one mile. After tea went into Ludgershall for laundry.\n","40":"\n\nReveille 6 a.m. & ¾ hour physical exercise. Medical inspection during morning. After dinner walked to Tidworth & met Cale & Turner & several of the 9\/53 who have been transferred to the Veterinary Corps & are camped at Park House. Had tea with Cale. Bought pair of Fox’s Puttees 8\/9. During afternoon a terrific\n\neast wind sprang up & developed into a real Darling River dust storm, also making temperature very cold. Just before bed walked down to Ludgershall for cup of coffee.\n","41":"\n\nVery cold this morning but nice fine sunshine although windy. After dinner went to Perham for hot shower & after tea to Perham to Y.M.C.A. Still cold.\n","42":"\n\nFrosty early in morning. Practising bombing morning parade & afternoon ditto. After tea went to Ludgershall Y.M.C.A. for some stamps.\n","43":"\n\nVery cold. Making new bombing course during day. After tea an aeroplane fell 1½ miles from camp & was smashed. Went over to see it & while there met Mr. Southwell. He is in 66th Btn. & was originally in 62nd.\n","44":"\n\nBitterly cold in morning. Still working on bombing course during morning & afternoon till 3 p.m. when were dismissed for a football match between B & D Companies. After tea went to Perham for hot bath.\n","45":"\n\nRained during night & was not so cold in morning. Bombing practice during day. Heavy shower rain at dinner time. After tea went Y.M.C.A. Ludgershall & posted some letters. Pay Books collected preparatory to disembarkation leave. Three men shifted to other tents this afternoon.\n","46":"\n\nMuch warmer today. Afternoon went for short route march in morning saw two aeroplanes manoeuvring at battle practice. After tea went to Perham with Meldrum for bath.\n","47":"\n\nNice fine day, threatening rain in afternoon. After dinner went to Tidworth & after tea to Salv. Army Institute & Regt. Inst. at Perham Downs with Andy Ken.\n","48":"\n\nReveille at 7 a.m. After dinner washed my laundry & after tea went to Y.M.C.A. to post letters to Aust.\n","49":"\n\nAfter packing up everything & getting nicely dressed for leave, at last moment found leave was cancelled as had not given in money for rail fare. Will receive it later on though after we go to Wareham camp. After tea went to Y.M.C.A. to post letter to Uncle Fred.\n","50":"\n\nHad to drill with company this morning in drill order. After dinner had medical inspection, then detailed for inlying piquet. At 5.15 p.m. when piquet fell in it was overstrong so I was one of the fortunate ones to be dismissed. Then went to Perham Downs & washed hdcfs. & had hair cut.\n","51":"\n\nBitterly cold again. Paraded in full marching order. Notified that going on leave tomorrow\n\nhaving to report back at Wareham on Sunday. After tea went Perham for bath.\n","52":"\n\nCaught 10 a.m. train from Ludgershall & arrived Waterloo, London about 12 noon. Went Kings Cross by Tube & booked bed at Y.M.C.A. Then wired to Uncle Charlie & Uncle Will about the leave. Walked right down Grays Inn Road to Holborn then took Tube to the Bank & then went to Basinghall St. to Petersen Boesens but there were no parcels for me. Then went along Cheapside to St. Pauls which I looked at & inside for few minutes. Then went along Cannon St. & looked in at Cannon St. Rail Stn., then further along Cannon St. & Tower St. to the Tower of London which I thoroughly went over. Saw in it the Armouries, Crown Jewels, Sir Walter Raleigh’s Cell, Bloody Tower where Princes were murdered, Beauchamp Tower & all historical places. Then went along Tower Hill & on to the Tower Bridge. Came back then into Tower St. to Mark Lane Underground Rail Stn. & went to Charing Cross Stn. Looked over the big Rail Stn. there & then went to Trafalgar Square, Leicester Sq., Piccadilly Circus & along Regent St. to Oxford Circus. There took bus along Gt. Portland St. & Euston Rd.\n\nto Kings Cross Stn. to meet Uncle Charlie at 8 p.m. but he was out of town so waited till 9.30 p.m. & bought ticket to Filey then over to Y.M.C.A. to bed.\n","53":"\n\nUp at 3.45 a.m., had light breakfast & caught 4.55 a.m. train for York – stopped at Peterboro’, Grantham, Newark, Doncaster, Retford & Selby, arrived York about 10 a.m. Caught Scarboro train & changed at Seamer Junct. 3 miles from Scarboro & arrived Filey about 11.30 a.m. Walked to Muston about 2 miles & met some of the family. Uncle Will arrived home about 5.15 p.m. & after tea the two of us cycled to Layton to within 3 miles of Scarboro. Saw the birthplaces of different uncles also that of my father right on a beach near Scarboro. Saw a Mr. Goforth who went to school in Layton with Father & saw the family graves at Layton Church. Rode back to Muston via a road along the cliffs. Went to bed at about 9.30 p.m.\n","54":"\n\nSlept like a top, having a lovely feather bed & did not wake till 7.30 a.m. Left Muston 9 a.m., Uncle Will walking to Filey with me. Caught 9.56 a.m. train & went right into Scarboro.\n\nWalked round various streets & down to beach & on way back met a Mrs. Eyre (she stopped me in street) whose husband has a chemists shop in Scarboro. She is Australian but has lived there 18 yrs., coming from Mansfield, Victoria. She invited me to her home if ever I went to Scarboro again. Had lunch at Rowntrees & caught 1.20 p.m. express to York. At Kirkham Abbey passed old ruins. Arrived York about 2.30 p.m. & saw Cathedral in distance. Caught train 3.12 p.m. for London & arrived Kings Cross 7.30 p.m. only making one stop on journey – at Grantham. Had tea at Y.M.C.A. Kings Cross & took bus to Tottenham Court Road & booked bed at Y.M.C.A. there. Then walked about streets till bedtime.\n","55":"\n\nUp at 7.45 a.m. & after breakfast walked to Trafalgar Sq. via Charing Cross Rd. & met Uncle Charlie at 10 a.m. Went via Whitehall to Buckingham Palace & on way saw guard changed at Horse Guards & the guard changed at the Palace. While there saw some U.S.A. officers in khaki. Saw Victoria monument & went by St. James Palace to Pall Mall & along it to Trafalgar Square\n\n& the Strand to Y.M.C.A. near Charing Cross where I left my overcoat. Then went via Fleet St., Victoria St., & Bishopgate to Liverpool St. Stn. After looking over it went down through Petticoat Lane & came out into Aldgate where I saw the ancient pump. Bus then via Leadenhall St., Cornhill, Chpside, Newgate St., Holborn Viaduct, High Holborn, New Oxford St., to Charing Cross Road whence we went to Lyons Café in the Strand for dinner. Then went by Piccadilly to Hyde Park & listened to band for about hour. Then went across Park to Marble Arch & had afternoon tea at Lyons. Bus then via Park Lane & Grosvenor Place to Victoria St. Stn. which we looked over. Tram then for about ½ mile & walked to Horseferry Rd. where I inquired about Roy but found he sailed for Australia on Feby. 13th. Walked then past Parliament Houses & Westminster Abbey along Whitehall for tea at one of Lyons Rooms. Then got overcoat from Y.M.C.A. & went along Strand to Waterloo Brge. (passing Somerset House) & so to Waterloo Stn. when I caught 7 p.m. train for Wareham. Arrived Wareham at 10.50 p.m. & made my way to camp in dark & after fossicking about for ¾ hour found our\n\nhuts & blankets & then to sleep.\n","56":"\n\nUp at 6 a.m. & no early morning parade. Practically no parades at all during the day. Received letter from Miss P. dated Feby. 19th & a parcel of eatables from Uncle Fred. After tea went to Y.M.C.A.\n","57":"\n\nPlatoon drill in morning & route march in afternoon passing through Wareham. After tea looked around Wareham with Skelsey.\n","58":"\n\nFairly cold early in the morning. Heavy day of drill at the \"Bull-ring\". A bit of a strike at dinner time on a\/c of scarcity of food. Officers promised to have quantity & quality improved. After tea took stroll down to Y.M.C.A. & got caught in heavy rain. It is now raining heavily. Handed in our waterproof capes today.\n","59":"\n\nInclined to be windy today although fine. Had little bayonet drill in morning & in afternoon went for route march. Saw train containing 10 \"Tanks\" passing by. Went to Wareham after tea & then to Y.M.C.A. & went to bed.\n","60":"\n\nMuch warmer today & did a hard day’s work viz. Musketry, Bayonet fighting, Physical Training, Squad drill, and Bombing. After tea\n\nwent down the town with Meldrum.\n","61":"\n\nBeautiful day – warm yet mild. Only ½ days work. After dinner took washing to laundry & then went down town with Dawson. Posted Wareham History & London maps to Bourke, N.S.W. & sent some money to C\/wealth Bank. After tea went down town again & had good look around.\n","62":"\n\nReveille at 6.15 a.m. but stopped in bed till 7 a.m. as it was Sunday. No parades at all today. Rained heavily all day long & could not go out anywhere. Tea time it cleared up so walked to Stoborough.\n","63":"\n\nRained heavily all day so could not go on parade. After tea went to town for stroll.\n","64":"\n\nFine morning but rained after dinner so dismissed from parade. After tea take stroll beyond Rail Stn. towards Poole.\n","65":"\n\nFine today – practising with gas helmets now. After tea went to town & Y.M.C.A. for supper. They are having boxing contests in the hut tonight.\n","66":"\n\nAfter going to bed last night was roused up at 10.30 p.m. for telephone in B.O.R. & 3 of us had to sleep there all night each doing shifts of 2 hrs. 20 mins. each from 11 p.m. to 6 a.m. Missed early morning parade & went on all others. Had\n\ngas helmets on for about ½ hr. & had to double around & drill in them. Then at bombing school had live bombs to throw & I threw my first one. Received several letters from Australia – from Miss P., Ma & Aunt Sarah. Answered Aunts & after tea went to town & posted it.\n","67":"\n\nGas Lecture in morning. At dinner time issued with rifles & bayonets & took them on parade in afternoon. Rained about 3 o’clock so were dismissed, rained fairly heavily after tea when being paid.\n","68":"\n\nDid gardening fatigue in morning. After dinner went to town with Dawson & looked over both churches. One was founded by Saxons 701 A.D. In other saw stone coffin of Edward the Confessor murdered 1280 A.D. After tea took stroll down town & had supper at Salvation Army Hut.\n","69":"\n\nStill having cold nights – did not rise till 7 a.m. After dinner walked to Corfe Castle 4¼ miles away – it was built about 792 A.D. Walked there & back taking 1¼ hours each way. After tea went to town & posted number of post cards.\n","70":"\n\nBeautifull day. In morning had practice with Box Respirators, also Visual Training & Bombing. After dinner Bayonet fighting\n\n& rifle exercises. After tea went down town & met Taylor with whom had a drink. Went on Road picquet at 7.30 p.m. & went off 9.45 p.m.\n","71":"\n\nThrew more live bombs in morning & drill with box respirators. Received letters from Guild & Uncle Fred. Evening took stroll down the town.\n","72":"\n\nFine sunshine. Wrote home. After tea went down town.\n","73":"\n\nRather warm today. In morning went through real gas. One chap outed. After tea went down town. Wrote letter to Guild.\n","74":"\n\nWent route march for the day to Corfe Castle & back by different road, total 10 miles. Had dinner near the Castle & had 1 hour off to see it & the town. Extra good meals today. After tea went to town & read papers.\n","75":"\n\nFairly warm. Feet slightly sore after march. When came back from bull-ring at 12.30, Reg was waiting for me, had been waiting ¾ hour. Stopped about ¼ hr. then he motored to Bournemouth.\n","76":"\n\nWarm day – got up 7 a.m. In morning took stroll up valley & gathered nice wild flowers.\n\nSlept all afternoon. After tea went to Soldiers Institute in Wareham.\n","77":"\n\nWent to parade ground over the line & drilled. Knocked off 2 p.m.& mounted guard 7 p.m. Leave was cancelled at last minute on a\/c of camp removing. Received parcel of eatables from Uncle Fred.\n","78":"\n\nOn guard various times during day one officer under open arrest. Knocked off 7 p.m. & then went to Y.M.C.A. for supper.\n","79":"\n\nRoute march in morning – round trip via Holme Lane. When arrived back had some mail from Australia delivered to me. At tea time issued with extra boots & breeches. Took tunics down town to be altered but found shops all closed. Wrote to Miss R.\n","80":"\n\nFairly warm day. Down at bull-ring all the time. Paid after tea. Wrote to Uncle Fred.\n","81":"\n\nFair day’s work today. Saw airship. Musketry all afternoon & shooting at miniature range after tea. Received parcel of sox, hdcfs. & knee caps from Australia.\n","82":"\n\nMusketry all morning across the line. Changed to 32 hut after dinner then strolled down town and wrote to Minnie Lusc. After tea went down town again. Very warm day.\n","83":"\n\nHot day – morning went up valley & picked wild flowers. On way back called at farm house & the 5 of us had 3 drinks milk each. In afternoon scrubbed breeches. After tea strolled down town.\n","84":"\n\nRained heavily in morning & heavy thunder storm. Started with Lewis Guns. Musketry all afternoon in drill shed. Went down town after tea.\n","85":"\n\nRained heavily. Great cleaning out on a\/c of removing but had no parades. After tea went down town.\n","86":"\n\nReveille 3.45 a.m., breakfast 4.30 & moved off 5.30 a.m. en route to the Plain. Halted 10 a.m. for 2 hrs. & had dinner & arrived at Blandford at 2 p.m. – about 14 miles. Rained heavily in afternoon & got wet through as bivouaced in open. No leave granted to visit town but all allowed out at 7.45 p.m. Turned very cold. Passed through Shaftesbury.\n","87":"\n\nReveille 4.30 a.m., breakfast 5.15 & moved off 6 a.m. Marched 12 miles to near Shaftesbury via Iwerne Minister, Sturminister Newton. Rained heavily in morning & got wet through. In afternoon went with Taylor on the big hill & then down to the bridge. Had tea at a farm house which we enjoyed immensely, cost 1\/6 each. Turned out fine in afternoon. Not allowed into Shaftesbury although several tried to get in.\n","88":"\n\nReveille 4 a.m., breakfast 4.45 & moved off 6 a.m. Marched via Shaftesbury & Ludwell to Fovant Camp arriving at 1 p.m., doing 10 or 11 miles. Several dropped out in the last lap. 5 & 6 sections together again in 30 hut right alongside canteen. After tea went to Y.M.C.A. & B.E. hut & then to Fovant for a while.\n","89":"\n\nReveille 6.45 a.m, very cold all night. Went to 7 Hurdcott Camp (full marching order) & were reviewed by Lord Derby & couple of generals. Arrived back 11.45 a.m. & selected for Battalion Runner, a 24 hour job but sleep in own hut. Kept going till 11 p.m. Went to Hurdcott in afternoon & saw Reg. & met Palmer coming back.\n","90":"\n\nReveille 6.30 a.m. but did not get up till 7. Started having meals in dining hall. On duty all day as Btn. runner finishing 7.30 p.m. While on job as runner got job as Escort to Isle of Wight, going tomorrow.\n","91":"\n\nUp 5.30 a.m., early breakfast 6.15 a.m. & reported with Mooney at B.O.R. 6.45 a.m. to escort 2 prisoners to Isle of Wight. Kept waiting till 8 a.m. & took them to Dinton, thence 9.18 train to Salisbury. Went down Street in Salisbury to the Cathedral & had feed strawberries costing 7d. lb. – also had glass milk. Caught 10.48 train from Salisbury & went via Romsey & Eastleigh to Southampton West 11.59 a.m. Went down main street & Southampton (after having dinner) as far as the \n\nLewis Gun all morning. Afternoon had Extended Order & digging trenches. After tea walked to No. 11 Hurdcott Camp & saw L.J. Smith & Guild arriving back 9.30 p.m.\n","92":"\n\nOrdinary drill in morning. Rained dinner time, heavily so had rapid loading in a hut. After tea had Lewis gun lecture. Rained very heavily after tea.\n","93":"\n\nRained all day so had no parade – only a hut inspection & bombing lecture, was also very cold all day. Paid after tea.\n","94":"\n\nMusketry all morning. Afternoon went to Hurdcott but Reg was out also Sowter & Guild. Had a washing day after dinner. Stopped home in evening.\n","95":"\n\nUp 7 a.m. – Church Parade 8.30 a.m. Bought pr. breeches from Pratley for 7\/6 – nice fit. Afternoon went for stroll down Fovant. Fine sunshine all day.\n","96":"\n\nOn Lewis Guns all day. Left them 3 p.m. & came to hut & got cleaned up & received leave pass for Barrow. Caught 4.50 p.m. train from Dinton & 6.23 p.m. from Salisbury & ran to W’loo without a stop. Went per tube to Euston & booked bed at Y.M.C.A. & looked up trains at station.\n","97":"\n\nUp 3.30 a.m. & caught 4.55 a.m. train ex Euston & travelled via Willesden, Bletchley, Northampton, Rugby, Stafford,\n\nCrewe, Warrington, Wigan, Preston & Carnforth to Barrow arriving 2 p.m., Uncle Fred meeting me. Had dinner then went for walk around beach & promenade & eventually arrived back at 5.30 p.m. & had tea. After tea Uncle Fred, Aunt Anne & self went by electric train to Furness Abbey & looked over the ruins. Came back via Roose & arrived home 9 p.m. Nice soft feather bed at night.\n","98":"\n\nSlept well, up 6.30 a.m. Walked to station with Jack & caught 8.40 a.m. train for Carnforth & London arriving 4.30 p.m. Went Waterloo per tube & after waiting ¾ hour caught the 5.50 p.m. train for Salisbury & arrived at Dinton 8.26 p.m. & came straight to camp.\n","99":"\n\nOut on parade & struck a rotten officer named Lane. He was shaking us all up. Afternoon went with Lewis Gunners & finished 4.45 p.m. Had nice hot bath. After tea went to Fovant & bought grocery parcel to send to Uncle Fred. While there Meldrum came in so we had an ice cream.\n","100":"\n\nReveille 6 a.m. With Lewis Guns all day working on stoppages etc. After tea went to Fovant with Harrison.\n","101":"\n\nStill on Lewis Guns – finished parade 12 noon. After dinner warned as Btn. Runner so could not go out anywhere. On till 10 p.m.\n","102":"\n\nUp 7 a.m. & while at breakfast was taken sick. Had to be relieved from Runner job & laid down all day. Could not eat any dinner or tea. About 7 p.m. got up & had tea & cheese sandwich at canteen.\n","103":"\n\nFeeling better all day. Skirmishing on top of hill all day, having dinner there. Rained for ½ hour or so. After tea went to Fovant & got change from grocery shop.\n","104":"\n\nVery sick all night & paraded sick to Dr. at 7 a.m. Got dose castor oil. Went top of hill again for skirmishing but had to leave at dinner time as got very sick again.\n","105":"\n\nNot feeling too good on awakening. Went skirmishing again over the big hill but had to come down about 11 a.m. After tea wrote to Uncle Will.\n","106":"\n\nOn Parade Ground all today. Not too good in morning but better in afternoon. Received parcel from Australia sent per Griffiths Bros. All hands enjoyed the sweets, etc. in same. Lewis Gun lecture after tea.\n","107":"\n\nOn B Rifle Range all day – having dinner there. Did no good. After tea went to Fovant for washing. Paid after tea.\n","108":"\n\nOn Range again till 3.30 p.m. Came home & had bath then walked to Hurdcott but Reg had gone to France last Wednesday & others were all out. Had tea there & arrived back 6.30 p.m.\n","109":"\n\nUp 7 a.m. & Church Parade 8.30 a.m.\n\nRained dinner time & cold wind came up. At 8 p.m. took laundry to Fovant & then walked on to Fovant church. After tea went to Y.M.C.A. & heard service by E.A. Sellors from Chicago.\n","110":"\n\nOn range all day – only shot fairly well; inclined to have headache. Received Australian mail dated April. Wrote to Aunt Sarah.\n","111":"\n\nRow at breakfast time as food was spoilt, so in end served extra meal. On range all day, finished musketry course. Scored 123 out of possible 170.\n","112":"\n\nRained almost all night & nearly all day so stopped in huts all the time working on Lewis Gun. Wrote to Mr. Randell. Went stroll through Fovant after tea.\n","113":"\n\nRained slightly in morning, but turned out nice fine sunshine. On Lewis gun all day. After tea went for walk through Compton Chamberlayne & Dinton. Received letter from Uncle Fred.\n","114":"\n\nOn Parade ground all morning. Afternoon marched about 2 miles towards Teffont & on outpost work till midnight, having tea out there. Arrived back at 12.45 a.m. & had coffee & biscuits.\n","115":"\n\nReveille 7.30 a.m. Paraded as usual 9 a.m. & finished 12 noon. Afternoon walked to Teffont & saw Manor & Church. Came back short cut & called at farmhouse & had drink milk. After tea went to Fovant for washing & had photo taken.\n","116":"\n\nLearnt to play chess – been at it nearly all day. Went\n\nto Fovant 3.30 p.m. with laundry then went to Tipperary Hut & had some pastry. At 8.30 went to C.E. Hut with Taylor & had some supper.\n","117":"\n\nOn Lewis Gun all day out on range. After tea went with Palmer & James to Tipperary Hut & had fruit salad, etc. Received parcel pastry from Uncle Fred.\n","118":"\n\nLewis Gun all day – watching stoppages with live cartridges. After tea went to Tipperary Hut with Palmer & James for supper, then had game chess. \nWednesday\n Put up battalion colours.\n","119":"\n\nLewis Gun in morning & gun drill afternoon. Rained before tea. After tea went to Y.M.C.A. Wrote to Uncle Fred & Reg. Nancarrow.\n","120":"\n\nFiring Lewis Gun all day. After tea had dental inspection.\n","121":"\n\nFairly warm all day. Went out from 9 p.m. to 12 midnight on night stunt. Coffee & biscuits supplied for supper.\n","122":"\n\nOn Lewis Gun stoppages all morning. In afternoon went to Tisbury with Smith, Meldrum & Dawson. Had tea there & arrived back 9.15 p.m.\n","123":"\n\nReveille 6 a.m., up 7 a.m. Went with Palmer to farmhouse & had 2 each of pint mugs of milk, cost 2d. per mug. Rained in afternoon. Took laundry to Fovant. Posted photos to Australia etc.\n","124":"\n\nWent skirmishing over the hill all day. Afternoon & evening rained continuously. Paid after tea.\n","125":"\n\nRained all morning so did not go out on parade.\n","126":"\n\nAll day stunt between Wyley & Barford. Commenced raining 1 p.m. & rained all day. Left 3 p.m. & marching via Barford & Hurdcott arrived back at camp 4.30 p.m.\n","127":"\n\nRained all night. Lewis Gun all morning & afternoon. After tea went to Tipperary Hut with Palmer for supper. Still looking like rain.\n","128":"\n\nParade ground all morning. Had early dinner & went through gas chamber at Hurdcott. At 6 p.m. went on as battalion runner.\n","129":"\n\nReveille 7.30 a.m. as men out late skirmishing night before. On running all day finishing 6 p.m. Had bath then went down to Tipperary Hut for supper.\n","130":"\n\nUp 6.45 a.m. Went to farmhouse with 4 others & each had pint of milk. After dinner went to Teffont via Fovant going over grounds of the Manor. Called at farmhouse on way back & had pint of milk. Went to Y.M.C.A. after tea & posted booklets etc. to Bourke.\n","131":"\n\nVery muggy all day – foggy early in morning. Out all day skirmishing. After tea went to Y.M.C.A.\n","132":"\n\nSkirmishing all day. Bought tin peaches & had peaches & cream at Farmhouse. Wrote to Australia & C\/Wealth Bank. Had Camp Pie for supper. Recd. parcel groceries from Australia.\n","133":"\n\nMarched out 7.30 a.m. on a stunt\n\nbut rain set in so turned back near Dinton Stn. Had lectures & rifle drill in huts all day. Got slight pains in stomach again about dinner time. Rained all day.\n","134":"\n\nIn bed all day with gastritis. Tmpture. in evening 100.4. Dr. undecided whether to send me to hospital or not.\n","135":"\n\nFeeling slightly better but stopped in bed all day. So far have only had pint of milk & few biscuits since tea time Wednesday.\n","136":"\n\nFeeling much better but got \"No Duty\". Weekend leave was granted so caught 1.12 p.m. train from Dinton. Had to stay in Salisbury 2 hrs. then caught 3.30 p.m. train to Bournemouth arriving there 5.15 p.m. Looked about main street, promenade & pier & all about the place.\n","137":"\n\nUp 8 a.m. & after breakfast went to promenade for couple hours then back to town. Looked around streets then had dinner – roast duck etc. costing only 1\/7. After dinner met Tommy who had been to Yanco & Narrandera district & then went by train to Christchurch. Came back & had tea 5 p.m. then walked to Central Stn. catching 7 p.m. train for Salisbury – via Sthampton., Eastleigh & Romsey. Arrived Dinton 10.15 p.m. & camp 10.45 p.m. going to bed 11 p.m.\n","138":"\n\nOut on stunt all day arriving back 5 p.m. Received letters from Aunts Sara & Jane. Wrote to Aunt Jane.\n","139":"\n\nRained heavily during parade so had easy morning. Afternoon fine. Took laundry to Fovant after tea.\n","140":"\n\nCouple slight showers during morning.\n\nOut on stunt over big hill all day. Had feed blackberries. After tea went to Tipperary Hut.\n","141":"\n\nFine day. On Q.M. fatigue all day so missed all night stunt. Issued with new tunic & w\/proof sheet. Went to Y.M.C.A. after tea.\n","142":"\n\nHad easy day – men returned at dinner time. Heard today leaving for France next week. Recd. £10 from Bank through Paymaster.\n","143":"\n\nMuster parade this morning & detailed off for draft for France – 400 going from this btn. After dinner had hot bath & fixed up some of my clothes for France. Sent £12 to C\/Wealth Bank per registered post & posted parcel of things I want kept to Uncle Charlie in London.\n\n"}}