{"Document Name":{"0":"Diary_0403","1":"Diary_0403","2":"Diary_0403","3":"Diary_0403","4":"Diary_0403","5":"Diary_0403","6":"Diary_0403","7":"Diary_0403","8":"Diary_0403","9":"Diary_0403","10":"Diary_0403","11":"Diary_0403","12":"Diary_0403","13":"Diary_0403","14":"Diary_0403","15":"Diary_0403","16":"Diary_0403","17":"Diary_0403","18":"Diary_0403","19":"Diary_0403","20":"Diary_0403","21":"Diary_0403","22":"Diary_0403","23":"Diary_0403","24":"Diary_0403","25":"Diary_0403","26":"Diary_0403","27":"Diary_0403","28":"Diary_0403","29":"Diary_0403","30":"Diary_0403","31":"Diary_0403","32":"Diary_0403","33":"Diary_0403","34":"Diary_0403","35":"Diary_0403","36":"Diary_0403","37":"Diary_0403","38":"Diary_0403","39":"Diary_0403","40":"Diary_0403","41":"Diary_0403","42":"Diary_0403","43":"Diary_0403","44":"Diary_0403","45":"Diary_0403","46":"Diary_0403","47":"Diary_0403","48":"Diary_0403","49":"Diary_0403","50":"Diary_0403","51":"Diary_0403","52":"Diary_0403","53":"Diary_0403","54":"Diary_0403","55":"Diary_0403","56":"Diary_0403","57":"Diary_0403","58":"Diary_0403","59":"Diary_0403","60":"Diary_0403","61":"Diary_0403","62":"Diary_0403","63":"Diary_0403","64":"Diary_0403","65":"Diary_0403","66":"Diary_0403","67":"Diary_0403","68":"Diary_0403","69":"Diary_0403","70":"Diary_0403","71":"Diary_0403","72":"Diary_0403","73":"Diary_0403","74":"Diary_0403","75":"Diary_0403","76":"Diary_0403","77":"Diary_0403","78":"Diary_0403","79":"Diary_0403","80":"Diary_0403","81":"Diary_0403","82":"Diary_0403","83":"Diary_0403","84":"Diary_0403","85":"Diary_0403","86":"Diary_0403","87":"Diary_0403","88":"Diary_0403","89":"Diary_0403","90":"Diary_0403","91":"Diary_0403","92":"Diary_0403","93":"Diary_0403","94":"Diary_0403","95":"Diary_0403","96":"Diary_0403","97":"Diary_0403","98":"Diary_0403","99":"Diary_0403","100":"Diary_0403","101":"Diary_0403","102":"Diary_0403","103":"Diary_0403","104":"Diary_0403","105":"Diary_0403","106":"Diary_0403","107":"Diary_0403","108":"Diary_0403","109":"Diary_0403","110":"Diary_0403","111":"Diary_0403","112":"Diary_0403","113":"Diary_0403","114":"Diary_0403","115":"Diary_0403","116":"Diary_0403","117":"Diary_0403","118":"Diary_0403","119":"Diary_0403","120":"Diary_0403","121":"Diary_0403","122":"Diary_0403","123":"Diary_0403","124":"Diary_0403","125":"Diary_0403","126":"Diary_0403","127":"Diary_0403","128":"Diary_0403","129":"Diary_0403","130":"Diary_0403","131":"Diary_0403","132":"Diary_0403","133":"Diary_0403","134":"Diary_0403","135":"Diary_0403","136":"Diary_0403","137":"Diary_0403","138":"Diary_0403","139":"Diary_0403","140":"Diary_0403","141":"Diary_0403","142":"Diary_0403","143":"Diary_0403","144":"Diary_0403","145":"Diary_0403","146":"Diary_0403","147":"Diary_0403","148":"Diary_0403","149":"Diary_0403","150":"Diary_0403","151":"Diary_0403","152":"Diary_0403","153":"Diary_0403","154":"Diary_0403","155":"Diary_0403","156":"Diary_0403","157":"Diary_0403","158":"Diary_0403","159":"Diary_0403","160":"Diary_0403","161":"Diary_0403","162":"Diary_0403","163":"Diary_0403","164":"Diary_0403","165":"Diary_0403","166":"Diary_0403","167":"Diary_0403","168":"Diary_0403","169":"Diary_0403","170":"Diary_0403","171":"Diary_0403","172":"Diary_0403","173":"Diary_0403","174":"Diary_0403","175":"Diary_0403","176":"Diary_0403","177":"Diary_0403","178":"Diary_0403","179":"Diary_0403","180":"Diary_0403","181":"Diary_0403","182":"Diary_0403","183":"Diary_0403","184":"Diary_0403","185":"Diary_0403"},"Date":{"0":"unknown","1":1489.0,"2":1491.0,"3":1492.0,"4":1493.0,"5":1496.0,"6":1498.0,"7":1499.0,"8":1500.0,"9":1501.0,"10":1502.0,"11":1503.0,"12":1504.0,"13":1506.0,"14":1507.0,"15":1508.0,"16":1513.0,"17":1514.0,"18":1515.0,"19":1516.0,"20":1517.0,"21":1518.0,"22":1519.0,"23":1520.0,"24":1521.0,"25":1522.0,"26":1523.0,"27":1524.0,"28":1526.0,"29":1528.0,"30":1530.0,"31":1534.0,"32":1535.0,"33":1537.0,"34":1538.0,"35":1539.0,"36":1540.0,"37":1541.0,"38":1544.0,"39":1545.0,"40":1550.0,"41":1552.0,"42":1553.0,"43":1554.0,"44":1555.0,"45":1556.0,"46":1557.0,"47":1558.0,"48":1559.0,"49":1560.0,"50":1561.0,"51":1562.0,"52":1563.0,"53":1564.0,"54":1565.0,"55":1566.0,"56":1567.0,"57":1568.0,"58":1569.0,"59":1570.0,"60":1571.0,"61":1572.0,"62":1576.0,"63":1577.0,"64":1578.0,"65":1579.0,"66":1580.0,"67":1597.0,"68":1598.0,"69":1599.0,"70":1600.0,"71":1603.0,"72":1604.0,"73":1607.0,"74":1608.0,"75":1609.0,"76":1610.0,"77":1611.0,"78":1612.0,"79":1613.0,"80":1614.0,"81":1615.0,"82":1616.0,"83":1617.0,"84":1618.0,"85":1619.0,"86":1620.0,"87":1621.0,"88":1622.0,"89":1623.0,"90":1624.0,"91":1625.0,"92":1626.0,"93":1627.0,"94":1628.0,"95":1629.0,"96":1630.0,"97":1631.0,"98":1632.0,"99":1635.0,"100":1636.0,"101":1637.0,"102":1638.0,"103":1639.0,"104":1640.0,"105":1641.0,"106":1642.0,"107":1643.0,"108":1644.0,"109":1645.0,"110":1646.0,"111":1647.0,"112":1648.0,"113":1649.0,"114":1650.0,"115":1651.0,"116":1652.0,"117":1653.0,"118":1654.0,"119":1655.0,"120":1656.0,"121":1657.0,"122":1658.0,"123":1659.0,"124":1660.0,"125":1661.0,"126":1662.0,"127":1663.0,"128":1664.0,"129":1665.0,"130":1666.0,"131":1667.0,"132":1668.0,"133":1669.0,"134":1670.0,"135":1671.0,"136":1672.0,"137":1673.0,"138":1674.0,"139":1675.0,"140":1676.0,"141":1677.0,"142":1678.0,"143":1679.0,"144":1680.0,"145":1681.0,"146":1682.0,"147":1683.0,"148":1686.0,"149":1687.0,"150":1693.0,"151":1694.0,"152":1695.0,"153":1696.0,"154":1697.0,"155":1699.0,"156":1701.0,"157":1702.0,"158":1703.0,"159":1704.0,"160":1705.0,"161":1706.0,"162":1707.0,"163":1708.0,"164":1709.0,"165":1710.0,"166":1711.0,"167":1712.0,"168":1713.0,"169":1714.0,"170":1715.0,"171":1716.0,"172":1717.0,"173":1718.0,"174":1719.0,"175":1720.0,"176":1727.0,"177":1728.0,"178":1729.0,"179":1730.0,"180":1731.0,"181":1750.0,"182":1763.0,"183":1884.0,"184":1885.0,"185":1886.0},"Entry":{"0":"\n\n1918\n\n","1":"\n\nIn for a mysterious show. Have been asked by Gen Smythe V C, Dir. Com if I would undertake a desperate venture, which would probably cost me my life, but had a sporting chance.\n\nNature of job and place of operations not stated.\n","2":" Got word today to report at Corps H.Q. tomorrow.\n","3":"\n\nWent to Corp H.Q. there interviewed by Col. Byrne, a South African attached to \n\nthe War Office, about 20 Aust officers gathered there. Told it is to be a most secret show but as full of adventure as Drake’s voyages. Also that it was of great national importance.\n\nA young","4":" Lieut. there with MC, D.C.M, M.M. and Cross de Guerre\n\nAccepted.\n","5":" \n\nFreezing & all snow still awaiting orders re this secret stunt. Hope it comes off. Selected Alan Hitchcock to come with me.\n","6":"\n\nLeft France. Lt. Turner from","7":" Bde called at 6 am to go to Bolongne in Gen Smythe’s car. We set off at 7am after breakfast. Turner just out of line. Picked up Hitchcock at Wisques school. Arrived Bolongne 11am after an awful trip through the snow. Road all slush and mud. Arrived London 4pm, reported Horseferry Road, told report in morning.\n\nRecord trip Wood to London 6 am – 4pm\n","8":" Went to Church with Gracie, then Seven Kings at night. All very much surprised to see me. Stayed Seven Kings.\n","9":"\n\nReported A.I.F. H.Q.s. Jogged about town all day. Had lunch with Betty, caused quite a commotion on walking in on her and her pals at Wilkinsons for lunch.\n","10":"\n\nReported Tower of London (what a place). There medically examined with remainder of force. Canadian, S. African, New Zealander, Tommie and Aussies. Very gratifying \n\nafter 3 years of war to pass without a blemish. Went to Southerns at night, very nice people.\n","11":" Reported Tower. Wasted morning, but got lists of gear to bring, both Artic & Tropical outfits included. Where on earth are we off to with summer & artic outfits and told to bring a two years supply. Got us all thinking Russia, East Africa or North India.\n\nWent to theatre with Grace tonight. Dear \n","12":" Saw my old boss Mr. Maclellan today. Took me to Simpsons for dinner, Drury Lane at night, a good day.\n","13":"\n\nParty at Mannings tonight. Harry Fletcher and Mac from","14":" there. Kiss in the ring and goodness knows what a bonzer night.\n","15":"\n\nInspected at Tower by Gen. Sir William Robertson. A bunch of Russian officers on parade. (Russia wins). He gave us an address in which he said \"I am pleased to see you Gentlemen, for before me I see the cream of the British Army (B.S). Good luck and God speed.\n\nWent to Maid of the Mountains.\n","16":" routine. Report Tower in morning (still no definate idea as to our destination) theatres, dinner and what not galore. We had a party at Jims tonight, feeling very tired.\n","17":"\n\nSpent day at Jim’s Farm Rabbit Shooting.````\n","18":"\n\nLast full day in London. Col from War Office lectured on country of operation. Persia and Causicans. Went to Sporting Club with Jim Alright, Pat O’Keefe and Bandsman Blake. Pat wins in 2nd round . \n\nAir raid. Rushed round \n\n \n\nto Strand Palace Hotel, where a show. All the women rush basement in night attire. Ned and I shepherd 3 (good O).\n\nNo trains. Walk most of way to Liverpool St Station. wait for","19":" train. cold and tired only an hours sleep. Then packed up to be at Waterloo Station at 12 noon. Goodbyes & I wonder if I’ ll ever get back to dear old England. Why worry let the future care for itself.\n","20":"\n\nLeft England 7pm last night, arrived Cherbourg France 11pm anchored outside harbour until 7.30 am when we disembarked.\n\nGo into Rest Station.\n","21":"\n\nEntrained, off 2 pm. The day clear & fine. Hitchock, Turner Stableberg and I share a","22":" or 5th class carriage.\n","23":" \n\nStill travelling in this confounded dog-box – bitterly cold. Able to get a few extras at various canteens en route which adds to the usual ration.\n","24":"\n\nArrived St. Germain 8 a.m. Go into camp, Lyons not far but out of bounds, anyhow too tired to try any tricks.\n","25":"\n\nOn once more, much refreshed after a good bath and rest in the camp. The journey along the valley of the Rhone simply magnificent as spring is just making itself felt.\n","26":"\n\nRun thru Monte Carlo, Nice & Mentone, unfortunately it was dark, still the beautiful moonlight allowed us to see to a certain extent.\n\nAt every station where we stop, impromptu dances are in full swing, music provided by tin whistles, a banjo & an accordian. The \n\npeople are full of delight at these strange goings on of British Officers – the Russians seem a fine lot, & join in any fun that’s going.\n","27":"\n\nArrived at Faenza renowned for its beautiful China. Lunched at a very fine hotel, good music. Quite a stir created by one of our armoured car. Chaps taking a violin and playing beautifully great applause.\n","28":" \n\nArrived Toronto, furthest South in Italy. We go into camp & there are \n\nto wait for a boat to take us across to Egypt. The Bishop of Gibraltar lecturing here on the Caucasses had a yarn with him after, gave us cards of introduction to some people out there.\n","29":"\n\nEmbarked on the \"Malwar\" some 40 nurses on board. Food good & beds lovely.\n","30":" \n\nSplendid trip. We commence Russian classes, the Russian teaching us is a full blown Count who escaped after the Revolution, was one time an airman, walks lame on a\/c of a bad crash he once had.\n\nArrived Alexandria. The sands of the desert once more. How they call one! Had a great dinner, plenty of champaigne etc. a most excellent evening.\n","31":"\n\nOn baggage guard until we entrain at 7pm for Suez.\n","32":" \n\nArrived Suez and strange to say embark on the old ‘Nile\". Is this a good omen for she saved the good old","33":" on the trip to Gallipoli when the \"Southland\" was hit. Its good to see her, may she prove to be as lucky\n\nfor me this time as last.\n\nWe pushed off almost immediately.\n","34":" \n\nLecture by Aktar our Persian office on his country thru which we have to pass.\n","35":" \n\nDeck sports, lecture by Bray on the Caucases.\n","36":"\n\nPass Aden. Lecture by Russian officer \"The old Russian Army\".\n","37":" \n\nLecture by Armenian Sgt. on the Armenians. What an awful time these people have had. We all feel bucked about \n\nthe chance of being able to assist them.\n","38":" \n\nTrip fairly monotonous. Arrived here 1am for coal apparantly stay here all night.\n","39":"\n\nLeft 5pm. All the coaling is done at sea some distance from the land. Huge barges convey the coal to the ships side & natives carry it aboard in baskets carried on their heads.\n","40":"\n\nApparantly well up the Persian Gulf, as the water is more greenish in color & apparantly shallow. Russian classes continue which develop \n\nterrible heads.\n","41":"\n\nWe change over from the \"Nile\" to the Erin Pura which draws less water in order to cross the bar before the river. On guard.\n","42":"\n\nWe move up the Shal-el-Arab as the river is called, after the Euphrates junctions the Tigris. It is about ½ a mile or more wide. The banks are lined with beautiful green date palms, the stream swarms with craft of all descriptions. Hugh transports, Hospital ships, motor boats, and native boats of many designs.\n\nThe Dhow, which is something \n\nlike those on the Nile are in great abundance, and I am told do trips as far as Bombay.\n\nClose to the banks are smaller boats, some like canoes, propelled by poles, others dragged by a tow rope by natives on the bank.\n\nWe pass the junction of the Mahamarah where the Turks tried to block the river by sinking two large boats, but in sinking the current turned both slightly which did not bring about the desired.\n","43":"\n\nArrived at Ashar the port as it were of Bazrah. A long line of fine piers has been erected by the British to which are buoyed many large boats.\n\nWe disembark and go on to various camps. My particular one is at Makench where some of us camp with some Tommy ASC people. Latchford, Mills, Hitchcock, Turner, Hooper, Cameron, Stewart – Fraser and others there. The mud is a good foot thick all around & a great deal of work was required before we could say that we were comfy.\n\nThe ASC birds seem fairly decent, their food is not of the best, but the bar is excellent. \n","44":"\n ","45":"\n\nToday Hitchcock and I blow along to a Remount depot and ask the Colonel for horses. He gives us one each, but what horses? As soon as we mounted they bucked like fury and then boltt. We got into a narrow side road which is walled on either side. The first person we see is \"Pistol Pete\" the Colonel so called on a\/c of always having his six shooter attached.\n\nThen my nag goes like the wind, bowls over a gang of Arab road workers, narrowly misses banging into a car then crashed on a bend. I become unconscious and wake up with a scared Tommy enquiring about my health. Sprained my left wrist, split my top lip, skinned my face in \n\nfact my whole body. The nag is caught by a pal of my Tommie and I once more mount. The nag is bruised right along one side. We get into the open desert. Off he goes again. With less power in my arms I cannot hold the brute, but rush it into an irrigation stream about 4 feet deep, drenched to the skin. Tonight I sore and tired and the joke of the camp.\n\n ","46":"","47":" Have been too sore to move out of camp all plaster and slings but today managed a trip to Bazrah, about a mile or so from the River. Even more quaint than Cairo. The bazaars are narrow and winding and packed with all the cheap jack produce of the world. The whole street has\n\nroofs on with holes knocked thru here and there to light up the shops. Horsemen and rush here there and everywhere, the drivers and riders scattering the people by their hoarse cries.\n\nWe went to a picture theatre of all places in the East. The hall was a fair size and packed with Arabs. We go into the Reserve on the balcony at the rear of the place and see the show, drinking innumerable cups or rather glasses of coffee.\n\n ","48":"\n","49":" Inspected by G.O.C. Lines of Communication. I dodge the show being too much of a sight to be seen on such a parade.\n\nFeb","50":" Issued with swords today. Each of us know about as much about our sword as it knows about us. Russian classes still continue.\n\nThe advance party, including Hitchcock and Turner push on upstream today. Rotten luck I couldn’t go with them, still why growl.\n\n ","51":"","52":" Rained all night, tent flooded, but all had too good a night at the officers club to care much.\n\nPacking up ready to go.\n\n ","53":"","54":" We leave Ashar, by boarding a paddle steamer, our gear is on a raft attached \n\nto the left side of the boat while the NCOs travel on a similar affair lashed to the other side.\n\nAn enormous amount of energy is expended on the Arabs as they load our kit on the tub.\n\nThese people are remarkable for their strength & laziness. The loads \nthey\none carries would frighten two white men & on every opportunity they lose themselves in order to dodge work.\n\nThe river still continues to be wide & we pass innumerable depots and workshops on the banks.\n","55":"\n\nWe enter the Tigris proper leaving the Euphrates on our left. The latter appears to be wider at the junction but is unnavigable on a\/c of \n\na huge bridge which crosses the stream.\n","56":"\n\nThis morning we passed Ezra tomb which is erected on the left bank of the River. It came into sight some considerable time before we reached the spot, standing like a sentinel, casting off the suns rays from its blue enameled tiled dome. It stands inside a square mud wall, round about which are a number of date palms & appears to be in an excellent state of preservation, no doubt due to the fact that both Mohammend and Christian preserve the memory of this grand old Jew.\n\nQuite a number of Arab women are nearby, some of whom are extremely pretty in their quaint native dress.\n","57":"\n\nWe reach Amara, a large town on the river. Said to be noted for its wonderful brass work. We stay for three or four hours & go ashore. Latchford & wander across to the officers club, then cross the stream in a native boat & put in an hour at a picture show, filled with yabbering Arabs, the fat only to do ones sitting on the easy seats \nthat\nnear us. The pictures are antiquated but evidently enjoyed by the audience who became extremely excited at times. We nearly miss our boat but fortunately bribe a tommy motor boat driver to chase our craft which we board while on the move.\n","58":"\n\nWe pull into the bank to engage in sports. I took part in the relay & centipede races, running second in the latter. The old Colonel, (Donnan) looked a trick when stripped for the fray, coatless, hatless & with leggings discarded he looked a real battler. The tug-of-war resulted in officers","59":" Aust. Sgts","60":"\n","61":"\n\nPulled into the shore again, Latchford & I go for a stroll, others go goose shooting in a lagoon near the river. The days pass wearily being chiefly devoted to Russian & Persian classes.\n","62":"\n\nWe reach Ctesiphon an ancient capital of Mesopotamia south of Baghdad. Here Townsend fought the Turks before falling back\n\nback on Kut (which we visited two days ago and strolled over the old battlefield. On the bank the Turks commenced building an obelisk to commemorate their victory, but did not have time to finish the job).\n\nThe only remains here are the ruins of the Kings Palace and the wall around the city. The palace is remarkable in that its height is about 250 feet \nhigh\n & the stretch of the arch is about 150 feet. The whole of which is built of small bricks girded together with huge slabs of timber.\n\nWe had a good look at the irrigation system of the Arabs. Erected on the river bank is a pully over which the ropes run which draw the skins containing the water. A sloping ramp is excavated and two horses are harnessed to the ropes, each one taking the track alternately. The skins full of water are drawn to a beam \n\nlevel with the bank & opposite a small canal when by a contrivance they are tipped & the water flows along the canals thro the crops, primitive but useful.\n","63":"\n\nWe arrive at a camp south of Baghdad. This has been erected by the party that went ahead. Baghdad is about 5 miles away, the domes & minarets standing high above the forest of date trees. We turn in early.\n","64":"\n\nLatchford, Hitchcock & I make off for the famous city per boot but 500 yds along the road we bail up a military motor van which conveys us in safety to our destination. The city is much the same as Bazrah only much larger. A great number of Jews reside here and towards evening all the Jewesses are out airing themselves along the river\n\nThey are mad on colors & some of their loose gowns or capes vie with the rainbow for richness of color. We explore the Bazaars, which are laid out in section, such as the Brass Bazaar, the Boot Bazaar, the Softgoods Bazaar etc. All these are full of merchants & buyers who haggle over very bargain struck yet with all the hubbub its a place of fascinating interest.\n\nThe river is alive with all kinds of craft, from the nahre gophur a perfectly round boat made of skins stretched over bamboo, to the long river boat.\n\nThe population is most mixed being Jews, Arabs, Chaldean, Persians & Armenians, the Arab predominating in numbers.\n","65":"\n\nToday we devoted more time to Persian & are all hard at work at the various classes, such as Vickers Machine Gun, Lewis machine gun, sword exercises, & native transport loading, (donkey & camels). We went into Baghdad in the evening & explored the residential quarter. The streets are extremely narrow, & wind in all directions. The houses are built like those one sees in the plates of the time of Queen Elizabeth, the top storey jutting out above the lower, in many places it would be an easy matter to shake hands with the person in the top room in the opposite house. The smells & flies are terrible, sanitation being unknown.\n\nThere is one good street which the Turks constructed but hacking away right though the city running parallel with the river. This they\n\nsaid was to commemorate the fall of Kut but was really done as an easy means for transport thro the city. \n","66":"\n\nExplored the city again today picked up two Jewish boys who spoke English as our guides. Looked over the old Turkish Barracks on the further side of the city. They cover an extensive area of ground & are well built with fine parade grounds inside. The place is now used as an ASC depot by us. We strolled into a native dancing hall & there booked seats. The smell of the natives in the heat was terrific, but nevertheless we got good seats & saw the show, which commenced by two Arabs striking up some very wonderful music on their native fiddles and drums. About dancers \n\ntook part the ages ranging from 17 – 60. They kicked & stepped until the perspiration rolled down their faces and arms, not one of the crowd varying the steps or style of the dance. Finally the heat & smell drove us out.\n","67":"\n\nThe time has passed pretty monotonously \nthe\nWe have been fully employed at drill & languages with an occasional trip to Baghdad. Three days ago a big bunch of Turkish prisoners were marched through on their way to the embarking stage en route to India. They were a weary, half starved ill clad bunch.\n\nToday I got orders to proceed with the first party under\n\n \n\nMajor Staines D.S.O. Our destination I believe is Hamadan somewhere in North Persia, where we will meeting General Dunsterville. I was to go with the Transport section but am changed over to Capt Kay’s section.\n","68":"\n\nAt last the tent is comfortable & well banked up to keep the flood waters out so am able to record a few more incidents.\n\nWe left Baghdad at 9.30 on the night of the","69":" inst & got aboard a train. At some unearthly hour we are transferred to a train of open trucks which stick until 11am today and as it rained the whole time the trip was not too interesting. We pulled up at this place called Ruz and pitch our tents near an \n\nASC dump & after a couple of hours fixed up fairly comfortably especially after collaring some fuel from the dump with which we lit a fire and cooked a good feed. In my section are Capt Kay MC. (British OC Cap Fisher MC (Canadian Capt. Cockrain (British Capt Hooper MC & Scott-Olsen (Aust). We have one batman to every 3 officers poor devils they dont look too strong so we all grubtogether, one officer helping the boys each day. We are indeed a happy & contented lot.\n","70":"\n\nRained all day, confined to camp, cooking in the open simply heartbreaking.\n\nStill at Ruz. Yesterday it cleared considerably & today the ground is much drier.\n","71":"\n\nToday we left Ruz, journeying by Ford car to Kusr-u-Sherin on the Persian border. Quite a fleet of Fords conveyed us to the appointed place, & each was driven by an Indian who handled them to perfection.\n","72":"\n\nOn the outskirts of the camp are the ruins of the ancient city & wall. The wall or rather what remains of it is massive, being about 20 odd feet high by 3 feet thick. The most interesting of the ruins are those of two old castles built entirely of stone. One \n\ncovers a couple of acres of ground & only the stables built under the main building remains intact. The other is smaller & portion of the walls remain, which speaks well for the durability of the Persian stone.\n","73":"\n\nStill in Camp. Col. Heyworth D.S.O now in command. He came from Salonica to form this force. The time is passed by cooking & shooting expeditions among the foothills & swimming in the river which runs nearby. The only shooting one can get is a chance shot at a hyena or a fox, still this passes by the time.\n","74":"\n\nToday the Persian mule team brought along their mules and all day\n","75":" were practising the loading & unloading of kits. The mules are rather small but apparently very hardy. Strapped to their backs are huge straw stuffed pack saddles. The loads are attached by a long rope & first by doubling \nthe length then half the\n & throwing the loop over the saddle to the further side half the load is then caught by drawing the loose ends around the load & threading them thro other loop, the other side is then fixed in a similar manner, the whole being secured by a sursingle.\n","76":"\n\nPacking up ready to move tomorrow.\n","77":"\n\nMuster at 4am, a hurried breakfast, then tents were downed\n\n & gear loaded on the obstinate mules. Many loads crashed before they were properly secured which brought forth \"unfortunate\" language. My group is detailed for Advance Guard & we traps a distance of 18 or 19 miles to Seri-pul. The stream nearby is eagerly sought by all when camp is pitched when refreshes one considerably.\n\nThe people are desperately poor being in most cases mere skeletons with only rags to cover themselves.\n\nAfter tea we had a quick game of bridge then bed.\n","78":"\n\nWe pushed on to the foot of the Pia-Tak pass, the track was fairly good, much easier than yesterday, tho the heat in the deep valley is most oppressive.\n\nThe mountains & cliffs rise to a tremendous height on either side of the narrow valleys & ones impressions of the day were swift rivers, deep valleys & steep cliffs & razor back ridges.\n","79":"\n\nAn awful day, we faced the terrible Pia-Tak pass. A fairly good road has been constructed over this portion of the track & it \nwinds\nzig-zags to the heights above. On the left cliffs tower to the very heavens. To the right deep valley yawn.\n\nAfter tea Scott Olsen & I sat on a rock & drank in the wonderful beauties of the place.\n\nDown below, thousands of feet, lay the valley of yesterdays march. To the right & left tumbled crags rear their shrivelled heads upwards, wind rain snow has carved them into most fantastic shapes.\n\nOne could almost imagine that such a place was a stately cathedral supported on the sides by beautifully carved pillars. The cliffs & presicipes are awe inspiring as they seemingly have no bottom. Sunset was a sight that will never be forgotten. The colors & shadows thrown on the gray cliffs were simply bewitching.\n","80":"\n\nUp 5 am. got an early start. The scenery continues to be magnificent. One is struck with the non-existence of timber & the barrenness of the mountains. The valleys are extremely fertile & with spring are a blaze of color. Wildflowers are growing in great profusion & I am certain 20 varieties could be gathered in any 20 square yards.\n","81":" \n\nRained all last night - all were out more than once during the night guying up their tents & clearing drains. We rested until 10.30 am, a most welcome one too, then we cooked some food and moved off at 12.30 pm. Our camp tonight is on a rocky flat near a village called Karend & our bed promises to be anything but a soft one. Capt Kay & I strolled into the village in order to purchase some eggs. The inhabitants are a cut throat looking crowd, rendered more so in their rags & strange black felt hats, shaped like a beehive worn on the back of the head.\n","82":"\n\nA very trying day of 15 miles thro a dangerous pass which we had to piquet before \n\nthe main body could go thro. I unfortunately had charge of the right flank & climbing those heights in the heat nearly laid us out. We advanced from a flank as it were & extended taking the heights overlooking the pass from the right rear. Then when the column had passed through we came down & followed on as a rearguard.\n\nThe camp at night is laid out four square with gangways running east & west, north by south through the tents. Each of the four sections are responsible for the fronts of their own area & in case of alarm each man hurries to his appointed place facing outwards. Any height overlooking the camp is picqueted & sentries are also posted throughout the camp. Horses are only provided for group commanders & the C.O. the remainder of us slog it on foot.\n","83":"\n\nToday we had a short march & three regular meals for the first time since we took the track, usually we wait until we reach camp before having a meal & as water regulates the camping grounds. We often do 16 – 20 miles before or between meals. We were also able to purchase a quantity of eggs. Dick Hooper assisted by a Sgt. does the Q.M. job & generally rides ahead & purchases extra food for the party on arrival at camp\n","84":"\n\nThis morning we picked up a telegraph line repairing outfit with mules & G.S. limbers. My group were on rearguard work & our job was to see the limbers into camp. The first 10 miles \n\nwas along a long valley & as its rained all night, the clay stuck to the soles of our boots like loaves of bread. Then we came to a ridge over which we were forced to man handle the carts. The leading ones outstripped the others & Kay & I with two Sgts. had to wait for the remainder. It was now getting dark & we had had nothing to eat since 5 am. so we lit a fire, boiled a billy of tea & bought some eggs from some nomads whose camp was on the hillside. We then strolled across to the camp & were greeted with anything but a welcome. The shelters are fitted to poles being some funny canvas stuff like one sees in a packing case in civilization. Goats, fowls, sheep and dogs share them with the people with the result that there is several inches of filth on the floor. The people are almost \n\nnaked, while the children are completely so. We moved back on to the road much quicker than the trip to the village, the stench driving us away at the double. We got into camp about 7pm dead tired but after a good feed of stew felt much fresher.\n","85":"\n\n3 years today since leaving Aust. A much more pleasant trip today, the going being good & the day cool.\n","86":"\n\n17 miles brings us to Kermanshah the first big city we have yet seen. We pass thro same pretty gardens to the camp where there is a detachment of Aust wireless people. The camp overlooks the city which has as a background a high barrier of mountains, The place seems \n\nto be composed of mud houses, with a stately place in rear, near which are two silver minarettes which glisten in the sun. We rest here so heres for a good nights rest & a trip to the city tomorrow.\n","87":"\n\nHad a look over Kermanshah today & at present feel sick at the sights one saw & weary after tramping through the Bazaars. We left camp (Capt Scott Olsen & I) at 10 am & on the way down saw the first sights of the poverty of the people, for batches of them were out in the fields actually eating grass. Their bodies were nothing more than skin & bone, yet their stomachs were swollen to an awful extent. On reaching the Bazaars, the worst cases were either laying in the streets dead or dying. It was heartbreaking to\n\nto see a mother, almost too weak to stand, clinging to a dead child or \ndead\n children wailing over the bodies of their dead parents. Many were so weak that a push would fell them to the ground from which they could not rise without assistance. The Bazaar turns & twists along narrow streets the whole of which is covered over but here & there holes are pierced in the roof to admit light.\n\nThe market square was full of women trying to sell their scanty household effects. There seems to be a fair quantity of stuff in these bazaars, yet at least one fourth of the population is dying of starvation.\n","88":"\n\nRested all day but this evening Scott Olsen & I went to an Armenian Cafe & got a fine bottle of wine.\n","89":"\n\nTook to the Road again today. Roused at 4 am. Road good along the valley. We took a couple of Persian youngsters as servants. The one with Scotty & I boasts the name of Zilleman & is about 13 years old. A Regular little gun.\n","90":"\n\nEasy stage today, reached camp before the heat of midday. Nearby rises a huge cliff from which rushes water from several springs. Had a good swim.\n\nTho the place is now called Bisatoun, there still remains the ruins of an ancient city with its history carved in ancient lettering on the face of the cliff which rises at least 1500 feet.\n","91":"\n\nUp at 3am 18 miles today. The track very dusty & weather extremely hot. A party of nomads were sighted a few miles ahead when we started & and after going a couple of hours, a group of Kurds rushed them from a sheltered valley. Our advance guard hopped in & and the Kurds soon got tho about 20 remained on the road & cooly watched us pass. The Nomad outfit was a scream, about 30 people in all, driving a flock of sheep, a few cows & carrying all their paraphanalia, fowls tied by the legs in pairs slung over the backs of quiet sheep. The shelters strapped to the cows. The men riding small pack donkeys & the women walking carrying spare gear. We escorted them as far as our camp.\n","92":"\n\n23 miles today. Up at 3 am & on the track at 4 am. Not feeling too well today fairly knocked up tonight. Heat in the valleys intense therefore we all are as brown as berries. Dick Hooper pretty bad with dysentry. Also Young, Lake and Southgate our batmen. These lads require all the attention instead of being what they are supposed to be, but they do their best.\n","93":"\n\nEasy march of 8 miles taking advantage of a rest.\n","94":"\n\n18 miles today negotiated big pass, climbed 8000 feet. Road made by Russians, fairly good. Had to cross stream after coming down \n\nin to the flats 4 feet deep, great fun in jumping on top of the donkey’s loads. Just as camp was pitched storm blew up, all had to hang on to their tents like grim death.\n","95":"\n\nHamadan at last. 18 miles today. We camp in garden of the American Missionaries hospital. Lunched with few British Offices here, chicken & salad, what a treat.\n\nGeneral Dunsterville, known as Stalky addressed us in the afternoon. Told us how he went with a couple of Officers to Baku before the snows. Outlined the job & said we must be prepared to do anything asked of us.\n\nHe stands about 6 feet about 50 years old & a most fascinating personality. All very much amused when he told us that the Shah had given us notice to quit \n\nPersia, and his reply that he found Persia agreeable to his health & also to his officers & men that he had no intention of leaving & the only thing to do was to come & put us out. What a cheek as there can’t be more than 70 of us here at the present time.\n","96":"\n\nRested all day. Have absolutely gone in the hip. The march proved extremely severe owing to the heat & bad track. Food during the first stage to Kirmanshah, from there onwards we dispensed with the Gen ration of bully, biscuits & cheese & lived on the country. £1 a day is allowed to officers & 10\/- to Sgts. Capt Hooper was appointed Q.M. & his work in procuring food is of the highest order.\n","97":"\n\nOld Scotty & I had a look thro the bazaar with Zillaman as a sort of guide. The place is much the same as Kermanshah, tho here there is a Jewish quarter, with better shops & more up to date goods, which come via the Caspian. Poverty and starvation is just as rampant & Stalky has people on the job of famine relief. One meal a day is given to the people on road work & the surplus distributed to the people. It is said that a particular party calling themselves Democrats are right up against us on a\/c of saving the rabble, as they term these people from starvation.\n","98":"\n\nPaid a visit to the American Missionary quarter. Dr. Funk & his wife are apparently head of the show. They live in a rather nice sort of bungalow \n\n& provided quite a pleasant afternoon for us with afternoon tea thrown in when we had a great blow out on pancakes and honey.\n","99":"\n\nEdna’s birthday. Thoughts of home. Am really feeling a bit home sick today, thought I had overcome this, but at times it comes back.\n\nThis afternoon we held a sports meeting, where we had inter dominion competitions. The N.Zs scooped the pool. Tug of war & relay race with the Australians as runners up. Quite a big crowd of Jews & Armenians present, who were quite at a loss to understand the vanquished cheering the winners.\n","100":"\n\nMajor Starnes D.S.O. New Zealand with 30 men ordered to push on towards the Caspian. We are divided into \n\ntwo groups, Imperials & Colonials. I am given charge of the Colonials. The other officers of my group are Capt Scott Olsen, Capt Wilson, a South American explorer, Capt. Williams, a South Aust Rhodes Scholar & Dick Hooper attached for food. Sgt Carson an Aust acts as Sgt Major.\n","101":"\n\nPush off for Kasvin. This time we have camels for transport. They give us a beautiful time both in loading up & on the road where loads were continually falling off. Our march was to be one of 16 miles to some wells, but on arrival were empty which meant we had to push on 6 miles to the next water. Feeling a bit done up on the metallic Russian Road.\n","102":"\n\n16 miles. Food a bit short at village had two meals of chippatti & dripping today. Bread has long ceased to be our portion & in lieu thereof we go in for the native bread called chippatti which is made of rough flour & water shaped like a pancake only baked. Our other food is mutton eggs & honey and dried fruits.\n","103":"\n\n18 miles today, had a lot of trouble with the camels, load continually falling off, a very hard day.\n","104":"\n\nEasy march of 10 miles arrived in camp 10am. Plenty of food today & good rest.\n","105":"\n\n12 miles, thro pass evidence of Russians being massacred in that we passed three motor vans overturned on the road. Supposed to be dangerous country, so far so good. Plenty of food. A wagon pulled into the village this evening with 4 horses abreast & outfits like the Russian conveyances one sees on pictures. Feeling pretty fit.\n","106":"\n\nCamped at a village called Abba Garm, the native for boiling water. It is really a wonderful place. The road leads thro a big valley with the village on the right of the road. At the further end is a Russian post used in former days as a toll station. Nearby a huge rock covering about a quarter of an acre juts \n\nout. At intervals are numerous cold spring & at the end near the river are several boiling spring, one being only a couple of feet from a cold spring. Erected over the largest boiling spring is a stone building inside which is excavated a bath. We all went down & revelled in the waters, a real treat.\n","107":" \n\nA march of 12 miles fairly good going.\n","108":"\n\n19 Miles today in the broiling sun, had good feed & am turning in. Its now a case of bed before dark & out again before daylight & plodding along all day. Walking becomes mechanical & kills ones brain. Luckily Toby Williams has a number of small books one of which I read every day on the march, otherwise I would \n\ngo mad. Hardly a word is now spoken by one all day. All of us seem to have grown silent & at times fed up with each other, the eternal tramp, tramp fairly eats into the brain.\n","109":"\n\nArrived at a small village 4 miles south of Kasvin. All of us are utterly done up. The troop of Cavalry sent ahead of us are camped alongside.\n","110":"\n\nRested all day.\n","111":"\n\nScotty, Kay & I went into Kasvin. Bazaars first class & chockfull of food, particularly Persian baguette. We each bought two. The European quarter or rather Russian quarter is quite\n\ngood with up to date shops. We lunched at an hotel, had a great feed of soup, joints, sweets & a bottle of wine. Sent £34 home in a draft to Grace to look after when I return to London. I wonder if I’ll every get there. Also bought a pair of boots, dried fruits & rice. Starnes assembled us after tea & informed us that we could not push on to the Caspian owing to the fact that Kutchih Khan with 70,000 followers in the pay of Turks was barring the way. Our destination is now to be Bijah via Zengan where we pick up a wireless plant. Staines gave us all the chance to pull out & remain here if we wished as the journey from Zengan to Bijah was across unknown & hostile country. Not a man \n\nstepped out to stay. All these chaps have tons of guts.\n","112":"\n\n17 miles today. Felt sick when I left, dysentry and an awful head which I had all last night. Extremely hot, just done up. The road is back over the same track. Met 2nd party at night who are on their way up to garrison Kasvin. Picked up an Assistant Surgeon from the Cavalry, the first medico we have yet had.\n","113":"\n\nA1 today 18 miles over easy country, much richer and more populated.\n","114":"\n\n15 miles, terribly hot, country still fertile with plenty of vineyards & crops ready to harvest. Inhabitants appear\n\nto be very friendly.\n","115":"\n\n15 miles today, morning cool afternoon dusty. Found it hard to pitch camp in the wind.\n","116":" \n\n14 miles good camp.\n","117":"\n\nArrived Zenjan 18 miles absolutely done. This is a very pretty place nestling in a valley. We are camped in an orchard of a big place on a hill overlooking the city. The sight of trees a wonderful relief after such a tramp thro a treeless country with only barren mountains on either side of the road.\n","118":"\n\nBreakfast in bed, what a treat, rested all the morning. Scotty & I went into Zenjan in the afternoon. Usual bazaars tho their lingo beats us. It’s more \n\nTurkish than Persian. Not much foodstuffs in the bazaar & the people disinclined to sell anything to us. After tea Scotty & I went for a stroll & had the fright of our lives. We left our tunics & revolvers in camp & when wondering across the open two Turks rose from a Hullah. We rushed them & brought our first prisoners back in triumph. The Interpreter got to work & they stated that they are deserters who heard the British were about so came along to surrender.\n","119":"\n\nWe heard that there were more Turks about in Zenjan, so I obtained permission to take Sgts. Carson & Brophy along to see if we could collar any. We hunted about for a couple of hours without success\n\nand were about to leave when we ran into a bunch of them. We collared one each, the others bolted so we got off with our catch. The citizens were extremely nasty & tried to raise Cain but we pulled out our revolvers which quietened things. These bucks told the interpreter that they were down from Baku & had been wandering about for months living on a handful of grain a day.\n\nPacking up to move on tomorrow, we take over a wireless group of one Sgt. & 4 men. When we looked for our camels we discovered that they had bolted without their wages when they heard we were bound for Bijah.\n","120":"\n\nI am approved to command the convoy while Starnes & Seddon the Adjutant. Sketch a map of our \n\nroute. We have no maps & have to trust to a ‘Political Agent’ that Major Chaildecott our Intelligence Office has routed out. Fresh camels are procured but the bulk of our animals are mules. This trip \nis to\nto be undertaken is one where no Englishmen have been before. We had a bad day with our loads & camped after doing 18 miles.\n","121":"\n\nLeft the road today & took to Caravan route negotiated tremendously steep ridges & after doing 18 miles had an awful pinch before us. Water is scarce & full of alkalide. We camped on a plateau after doing 22 miles.\n\nThe growth of the wild flowers is remarkable & beautiful. Altogether the scenery is magnificent, especially when on the crest of a ridge where a view of the valleys can be obtained\n","122":"\n\n22 miles, a very hard day on hardly any food & brakish water no villages & road frightfully rough. We got down into a valley & followed a river which we had to ford by jumping on to the loaded mules. Many came off when in midstream. We crossed further on over a fine stone bridge apparently very ancient. Food again is very scarce & we are forced to make one meal spread over three.\n","123":"\n\n24 miles. Water very scarce & it’s frightfully hot reduced to sucking a stone to keep my mouth dry. Arrived at the first inhabited village & were able to get some grub including a sheep so had a good feed at night.\n\nWe were told that a Turkish \n\nconvoy of Rifles & ammun passed thro the place two days ago bound for Kutchik Khan. Rotten luck we didn’t meet them.\n","124":"\n\nArrived at Bijah much to the consternation of the Governor on a\/c of us coming in from the north due to us striking the main road north of Bijah. Camped on the outskirts near a poplar & and vine plantation. Plenty of food fresh water. Extremely tired dusty & footsore.\n\nThis last stage was a nightmare. Food was terribly scarce & the water nearly drove us mad. Thanks only to Capt Hooper we were able to get anything as he rode off from the beaten track to mountain villages & and got a little food, otherwise we would have had a very thin time.\n","125":"\n\nRested all the morning. Scotty & I explore the bazaar & town. The place is absolutely desolate & portion of the bazaar has been burnt by the Russians before their evacuation. Very little stuff of any description in the bazaar, and dire poverty rampant.\n\nThe surrounding country is rather pretty. Bijah itself is built at the head of a valley, running from the North East. To the North & NW the land rises to rolling hills, while the other part of the city is surrounded by steep mountains. A sentry group is posted on the heights above our camp, owing to its suitability as an O.P. which overlooks the road from the North, North west and South to Hamadan.\n\nFrom information received the people have been dying like flies owing to famine & cholera. Rained for about 5 minutes was the first we have seen since Kermanshar. \n","126":"\n\nMajor Starnes sent me to look for a billet on the further side of the town. Took Sgt. Brophy (Can) with me. We chose one that perhaps will be suitable on the further side of the city on the high ground. Had some difficulty in getting into the courtyard. First knocked which brought a woman who squealed & then ran. The old man came after a lot of persuasion & let us in. He first of all cleared all the women & absolutely shook with fear until we gave him some cigs. He then gave us tea. Evidently the Russians gave these people a pretty bad time, for he told us that we were ‘so different from the Russian Officers’ and apparently felt quite safe before we left.\n","127":"\n\nRested all day. Capt Fisher set off for Hamadan.\n","128":"\n\nWent out in a road reconnaisence today along the Hamadan Road. Took Sgts. Place & Cameron. Capt. Nicol (NZ) on another similar job with a couple of Sgts. We did about 10 miles of road by taking compass bearings & rough notes which I compiled into a sketch on return to camp. Mules provided for mounts. We rigged up stirrups with rope & the big saddles proved rather comfortable.\n","129":"\n\nRested\n","130":"\n\nWhile out today Y&&oung Brophy & I collected 3 Turkish deserters & we got some useful information. The Governor & his retinue paid the C.O. a call today. Major Chaidecott & the Zenjan Agent negotiating with them re our work.\n","131":"\n\nNothing doing as regards work. A little girl of about 12 years of age came along to the camp for washing. She struck me owing to her cleanliness & tidiness & pretty little face. I asked her what she was & she said ‘Turko’ the name of the tribes out back & also told me her story which was that she had walked from a village 17 miles away yesterday as all her people had died & on hearing that the English were in Bijah had come along to see if she could get any work. She then burst into tears asked if the English would punish her. I then took her to the Interpreter who verified what she had to say.\n\nKnowing that she would die if unprovided for, I arranged thru the Interpreter for her to go into a Persian home in Bijah for which I would pay 4 Francs a day (2\/6).\n","132":"\n\nNothing doing. My birthday forgot until 27th.\n","133":"\n\nThe lady of the house robbed my little lady & gave her no food. Such are the Persians. Went along with the Interpreter & gave that household hell. I guess all will be well in future.\n\nRoad reconnaisance again today, collecting information such as condition of roads, number of men required to improve or construct, streams, villages, population and crops.\n","134":"\n\nNothing doing.\n\nCapt. Kay commenced work in levy raising & Wilson on soup kitchen where we hope to feed 750 people daily free of charge.\n","135":"\n\nQuite an exciting day. Took my little lady to the Bazaar this afternoon in order to buy her some shoes & some material for dresses which the lady of the house promises to make up. Spent about an hour in the bazaar in buying shoes, material & beads & was just making out when a mob of Persians with the Commissioner of Police at their head rushed along and surround me. He gabbled off 60 to the minute about taking a Mohammadan woman thro a public bazaar. I could see that things were thick so told him to come along to his office while we sent for the Interpreter who came along. The position was that I have unwittingly ","136":" an\ncommitted an awful crime in taking a woman of Persia (aged 12) thro the bazaar in broad daylight & bought presents\n\nfor her. I pointed out to the Commissioner that our religions were fundamentally the same in that it is our duty to care for the helpless & after a lot of arguing he said he saw my motive & that I was innocent of any law or religion breaking but he would not let the kid take any of the stuff & told me how lucky I was that he happened to be walking thro the Bazaar as the crowd were gathering enough men to out me. Such is life. I left him in an indignant & dignified manner.\n","137":"\n\nPacking up ready to go into a Sirdah’s house arranged by Chaildecott.\n","138":"\n\nWe shift into our billet which Scotty has put into fairly decent order during the last couple of days. It is quite a large place surrounded by a big mud wall.\n\nThe house & outhouses take up 3 wings & the stables the other, being built in two story’s. Scotty & I have a large comfortable room. Dick Hooper & Toby Williams another, Wilson a small one, Kay & Fisher another. Starnes, Seddon, Chaildecott & Lieutenant Crawley-Boevey & old Wilson have small ones to themselves. The officers occupy the top floor & the Sgts the lower rooms.\n\nWe have got a large mess room also the Sgts. I was elected Mess President today & am arranging with a cook who swears he once cooked for the Shah. Got the old devil new clothes & cooking utensils. Scotty has built a fairly decent cookhouse & is now arranging to build another to bake bread, as one of the Sgts. thinks he can make bread from sour dough in lieu of yeast.\n","139":"\n\nDick Hooper busy with villagers in purchasing wheat & barley.\n\nMy cook got to work & turned out a fairly decent though weird meal in which he mixed green plums.\n\nMy little girl came along this evening the Commissioner has done nothing for her even tho he promised, so Scotty & I gave her some washing to do for which we paid her 10 Krans.\n","140":"\n\nThese damn Native cooks just about drive me mad. The old boy & his offsider commence by cooking first my dish & when that is done start another. He never thinks of cooking all the food at once & if left alone would boil the water for the tea after washing up.\n","141":"\n\nDiddler is out holding on a village with a N.Z. Sgt. Got wind today that the Kurds are going to raid the place. Diddler’s people (12 Kiwis) reckon they will fight so Starnes sent out another Sgt.\n\nMail today, 39 letters & 1 parcel. Good O. This is the first mail yet received which Fisher brought back from Hamadan.\n","142":"\n\nDead tired. The Gov. Sirdar, Com. of Police, Com of Postal Services, Com of Telegraph Service & others came along to dinner. The Sidah provided the goods, for which we paid. The meal commenced at 9 pm. & went on with intervals until 3 am\n\nduring which time Chaildecott made a speech outling our policy of famine relief work, road construction & levy raising. The Gov & Sirdah responded. McLean foolishly brought his cigarettes which came in the mail to light & the visitors blew them away in smoke in quick time. Mac is now swearing beautifully in his room. This afternoon he prided himself on being the only man with a supply of smokes (the rest of us are reduced to smoking dried Pomegranite skins). The dinner was a scream. Forks etc. were dispensed with & we eat with our hands native fashion; anyhow we hope for something as an outcome from the dinner as Starnes is finding it mighty difficult \n\nespecially as the Gov & Sidah are enemies, but tonight they promised to bury the hatchet & work with us.\n","143":"\n\nVery quiet here, tho tonight Diddler came in & told us that the Kurds attacked his village this morning & he gave them a go with his two Sgts. & 13 .. The Kurds retired & Diddle chased them for about 20 miles & then returned to write his report to find that tho he chased the main body of Kurds another group came round the back & carried off all the stock. He had one man killed & is only sure of killing one Kurdish horse.\n","144":"\n\nKay is transferred to the construction of a landing ground for aeroplanes. Fisher takes over his work. Wilson is busy \n\nat the Soup Kitchen. Scotty still patching up our happy home.\n\nStarnes & Chaildecott left this morning on a 3 day visit to a Head Priest in order to get his influence in raising a Kurdish force as our Persians are useless. Dick Hooper is busy at gathering grain. Old Wilson is now Paymaster & I attend to the feeding arrangements which owing to the scarcity of food is very hard indeed and only by the aid of a contractor am I able to get sufficient. Nicol is busy on preparing a map of the surrounding district & McLean went out into the Never Never to visit a chief. Toby Williams is assisting in training the levies\n\nThe Sgts are distributed over the general work.\n","145":"\n\nStill awfully slow same old work etc.\n","146":"\n\nNothing of interest to note except the arrival of 2 troops of British Cavalry. We hear rumours of something doing up about Lake Urmiah with the Armenians. Starnes is fed up owing to the hanging back of the Kurds who will only join us thru the Sidah who wants a big present.\n\nJuly 18th.\n\nWent for a ride with Chaildecott this morning. Tonight Seddon gave me orders to take over the command of a party of officers \n\n& proceed with Major Moore & escorted by the cavalry. Beyond the names of the party & the taking over of £45,000 and \t100,000 rounds of ammunition & 12 Lewis guns, no other information can be given until I am out on the road.\n\nI remonstrated at the meagerness of the orders but nothing more would be told me. I fancy it is not due to the secretness required but to the underhandedness of Seddon as he is proving himself to be a bit of a rotter. The order is so on a\/c of its vagueness that I can afford to put it down in this old diary.\n\n(over)\n\nCapt. S. G. Savige\n\nYou will be in charge of the Party detailed hereunder, proceeding with Major Moore\n\nCapt. S. G. Savige M.C. 24th Br A.I.F.\n\nCapt. E. Crawley-Boevey Yorkshire Regt.\n\nCapt. R. L. Kay M.C. 12th Cheshires\n\nCapt. E G Scott-Olsen 55 Bn A.I.F.\n\nR K Nicol M C. Wellington Rgt N.Z.E.F\n\nCapt. D. Wilson 2nd Royal Irish Fus\n\n11\/771 Sgt L. Barrell Wellington Regt. NZEF\n\n12\/3947 Sgt. F. Brophy Aukland Regt. NZEF\n\n33\/58 Sgt. H G. Tollen Canterbury Regt\n\n1764 Sgt. B F Murphy 28th Bn. A.I.F.\n\n5446 Sgt. A. G. France 6th E. Lanks\n\nC268451 Sgt J. Abrahams R.W. Kents\n\nC26851 Sgt. W. G. Beevis 2nd Horfold Regt.\n\n265279 Sgt. A. I. H. Todman 1\/9 Middlesex\n\n75341 Sgt. R. Casey 24th Canadian Regt.\n\n642141 Sgt. W. F. Brophy 75 Canadian\n\n265159 Sgt. A. W. H. Place 1\/9 Middlesex\n\n225091 Sgt. A. D. Cameron 10th Lotat Scouts Cameron Highlanders\n\n417 Sgt. J. Wallace 38th Bn A.I.F.\n\n165665 Pte. H. C. Southgate R C Sigs (Bat Capt Scott-Olsen)\n\n305000 Sgt B.W. Lake 4th S.W.B. (Bat Capt Savige)\n\n31118 Sgt. A. W. Smithson 2nd Herfolks (Bat Capt Kay)\n\n(2) Instructions as to time of departure transport etc will be issued later.\n","147":" You will draw from the Q.M. sufficient ammunition to make up 200 rounds per NCO & other ranks\n\nS Seddon Capt\n\nA\/Adj.\n\nIncluded in above\n\n34906 Sgt. A. Nimmo Otago Reg NZ EF\n\n2146 Sgt. H. G. Smith 40th Bn A.I.F.\n\nS. Seddon Capt\n\nAAdj.\n","148":"\n\nUp till 2am last night arranging details. Reveille 4.30 am. Took over money ammunition guns & horses for officers, mules for Sgts. Set off at 8 am escorted by one troop of Cavalry Major Moore & Capt Reid who arrived at Bijah 4 days ago set off with us. Lt Col Bridges in command of Cavalry","149":" Hussars) Camped at Ponja 20 miles.\n","150":" \n\nArrived at Kizil Bulahk 18 – 20 miles. Had a go at Crawley-Boevey. He is years senior to me & tried to come on seniority bounce & take command. Showed him my orders & threatened to send him back if he gave any trouble.\n\nGot the first idea of our job from Read. It appears that one of our airmen flew from Baghdad to Miana in stages & thence to Urmiah with the message that Slalty would send to the Jelus & Armenians surrounded about the Lake, a number of officers & Sgts to organise their Army of 15000 men also money. M.Gs & ammunition. Their contract is to break thro’ to Sain Kala where the cavalry are to escort me to & from there we push into Urmiah before the Turks again block the road. Capt Read who lived there in prewar days is to do the political work while I organise the army.\n","151":"\n\nArrived Takan Tepe. Rather a pretty place for Persia in that it has avenues of poplars leading to the town. Derives its name from a knoll just outside the town 18 miles. Major Chaildecott joins us from across country.\n","152":"\n\nArrived San Jud a long weary trek of 28 miles\n","153":"\n\nArrived Sain Kala 17 miles, pitched camp on outskirts of town hear a large River.\n","154":"\n\nNo sign of our friends. Buy over telegraph operator who agrees to bring us all telegrams to look thru’. Gov visited camp today.\n","155":"\n\nGov sent message thru telegram to Turkish commander stating that 700 British Troops here, actually 75 or so. Turk tells him to wait & see him drive the infidels away.\n\nCol Bridges decides on going back as the Armenians are now 4 days overdue, I go along & offer to take a patrol to the Lake 3 days off & try to get in touch with the people. Bridges says its impossible. I point out it can be done by travelling at night & following the river if needs be live on dry rice. Wont hear of it. I’m afraid he has got the wind up over the Turk telegram.\n\nTurned back. Utterly disappointed & fed up. San Jud\n","156":" Genja\n","157":" Taken Tepe. Persuaded Major Chaildecott to give me orders in the name of Major Stairnes to remain here as an advance post with the idea of trying to raise a force from the tribe here in order to break through to the Lake, or if they come thro’ be in close touch. The Governors Brother, a Sidar, paid us a visit & for a certain sum is willing to help.\n","158":"\n\nKay Nicol & I went along & paid our respects to the Gov this evening. Took 4 Sgts as bodyguards.\n\nUshered into a large brightly colored tent. Sgts. remain outside. We take along the Cavalry interpreter, who left him behind to help with 2\/3 of their troop as an escort until we raise a force. After a lot of delay we managed to get our point in, i.e. we wanted a few guides to show my officers to the various villages among the hills. We spent about 4 hours then had tea, fruit juice drinks of sherbert & and Mais (sour milk).\n\nThe part one has to maintain in these visits is ridiculous. For instance, Guide ahead with two officers in rear & 4 Sgts behind them, & even tho’ it is not a ¼ of a mile, one must ride. The Sgts are bricks & carried out their part of the farce excellently. They jump about as if the fear of God is in their hearts at the least look from & never give the show away.\n","159":"\n\nSent Kay & Nicol out levy raising. Wilson on compiling a map. Sgt. Place drawing a special sketch of a bridge which I intend to hold as my line of resistance if attacked. It is particularly adapted as by holding a low ridge with a few isolated posts one can command the further long stretch of slopes rising from the river in between while the flanks are protected by gorges in both cases.\n\nKingscote the I.O. & I \nwent\npaid a visit to a neighbouring Gov. reaching his place at about 11 am. His chief adviser appears to be a handsome old Arab wearing a green Turban. We stayed until all got hungry when he was forced to ask us to lunch. The meal was set on the rough table in our\n\nhonor & we got the chance to ask for salt which was our intention knowing that if he gave us his salt he was bound by his religion to protect us. We got it & a food, tho’ weird feed.\n\nEverything appears to be working satisfactorily.\n\nLater the Sidar just came across and said that he has got definite & accurate news that our friends are at Sain Kala. Got a special runner to ride back for Reid.\n","160":"\n\nNews confirmed by a traveller from the North. Scotty, who is acting as Q.M. buying rice dried fruit tea & sugar all day.\n\nMajor Moore & Reid came in at 8 pm having ridden close on 40 miles today. Immediately had \n\na conference, decided to push on to Urmiah with Reid while Moore return’ with the cavalry from Sain Kala. Read & I then drew up rough dispositions and decided to establish a post at Sej Bulahk in charge of Kingscote as this is the junction place of several telegraph lines. Crawley Boevey will garrison a post at Binab on the right towards Tabriz. Nicol is to do the same at Sadaka on the left, each will have 2 Sgts & 100 Christians. Their orders are to hold these places as long as possible in order to keep the road to the S,outh open. Ray Wilson & Scott Olsen with 9 Sgts. will accompany Read & I to Urmiah.\n\nAt 12.30am a messenger from the Christian C. in C. Agha Petros, rode in with a message stating that he arrived at Sain Kala this morning after defeating the Turks.\n","161":"\n\nMoved forward at 4 am all in great spirits. Pitched camp at a stream south of San Jud at 5pm. At 6.15 the first party of Christians under the command of a brother of Agha Petros rode in stating that the rest of them were only a few miles behind. About an hour later the Armenians & Syrians came into view. I don’t think any sight has impressed me so much in all my life as the sight of that long column riding towards us thru the valley. The whole show as divided into separate commands under a chief flying a red flag with a white cross in the centre. Agha Petros himself rode at the head surrounded by his staff. The flag was similar to the others but had a gold fringe all round it with the words in Armenian \"Trust\n\nGod & follow the Cross\" across the centre above the cross. The force swung off to the right & left of the road & picqueted their horses the men bivouacing in the open.\n\nAt about 9pm all the head men came along with Agha Petros & expressed great disappointment at our small numbers. We went into matters, such as future operations, provisions, payment of troops, who were without food etc until 2 am. Agha Petros told us how he defeated the Turks.\n\nHe left Urmiah & brushed aside the first Turkish defences. Then he advanced in three columns some miles apart towards Suldaz. On coming into contact with the Turks he established a line & sent a strong mounted force to capture & hold Suldaz the Turks H.Qrs. Before dawn \n\nhe attacked & drove the Turks back to Suldaz where the mounted men were waiting for them. Thus the Turks to the direct South of the Lake were utterly defeated.\n","162":"\n\nMoved forward. We first intended sending the cavalry back but Petros specially requested that they should accompany us to Sain Kala in order to show the people that the British were helping him. We agreed & pushed off at 10am after a series of conferences which commenced at 4am. The Cavalry road ahead in a compact body while the Christians furnished an escort for the convoy & a rear guard. We reached Sain Kala at dusk. Major Moore Read & I were ahead & on arriving at the poplar plantation near our old camp\n\nsouth of the town were dumbfounded to find a couple of hundred women & children from Urmiah. Agha Petros on riding up was amazed & all we could ascertain tonight is that the Turks had attacked Urmiah & and the people had evacuated.\n\nWe had conferences with the chiefs until midnight but as nothing can be found out about the true state of affairs we decided to sleep on it. Some Russians here.\n","163":"\n\nRead & I rode out with Agha Petros this morning along the road that the people were streaming in on. There are thousands here now, having come in during the night. The scenes on that 6 mile ride this morning were heartbreaking. The poor women rushed forward & kissed our hands & boots in very \n\njoy at the sight of us. We interviewed the Gov of the town 6 miles out & promised to protect his people should the Armenians cut up.\n\nTonight a Dr from Urmiah who speaks good English (in fact a great proportion of these people speak English either having been taught by the American missionaries or had been to the States) told us that everything went well for two days after Petros had left. Then the Armenians from Lake Van District & the Christian mountaineers, called Jelus, who were holding the line to the North, came in to the city. Dr. Shed, an American missionary, stopped them & and asked what the move was, they told him they were shifting camp. He saw that they were playing treacherously and got a promise from them that they \n\nwould return to their lines & wait there for 4 days, but during the night they cleared out with the Russian people & left the Syrians in the lurch. The Turks & Kurds got wind of what was doing & attacked capturing the Northern Suburbs. Dr. and Mrs. Shed hurried to people out on the road after the Armenians to avoid a massacre as Petros had nearly all the Syrian troops with him. At present Dr. Shed and his wife are controlling a rear guard but the Turks & Kurds are harassing the People.\n\nI put the proposition of sending out a rearguard to Moore & Petros & guarantee to save the people if Petros will supply 100 men under a chief. Agreed. I selected Scott Olsen & Nicol with 6 Sgts with 3 Lewis guns. We are to get \n\nhorses from the Cavalry, take 6 days supplies & & £100 in gold & ride out to the rear of the people & protect them.\n","164":"\n\nHaven’t had a minute to spare during the last few days let alone enter anything in this diary so will write a brief narrative of the last few terrible days.\n\n \nOn\n At dawn on","165":" we were at Agha Petros’s camp to pick up the 100 men. The chief was there who couldn’t speak English so we got hold of a chap who spoke English to act as interpreter.\n\nThe men with me were Capt Scott-Olsen (AIF) Capt Nicol M.O (NZ) Sgts Murphy D.C.M (A.I.F) Brophy (Can) Cameron (Loval Scouts) Place (Imperial) Nimmo (NZ) Casey (Can). We had 6 miles loaded with gear & an extra box of S A A.\n\nThese we handed over to two Syrians who were to follow on behind. The rest of us rode out to pick up the 100 men. 6 miles, no men, asked Chief why, he said they were camped on the left near the river a little ahead. Got there, no men. People streaming in in thousands. The women rush us kissing hands & feet& amp; calling down the blessing of God. Midday, no men, no food, but hear Dr. Shed is ahead fighting the Turks & Kurds. The villages en route all destroyed by Christians & in flames, many murdered Persians both male & female in all these places. At 4pm we reach Mrs. Shed who is looking after a bunch of wounded women. She said her husband was a little further back with a handful of men putting up a rearguard. Still no sign of our 100 men. Apparantly all the men \n\nwent back to save their families.\n\nWe then pushed on to. Shed & found him with 24 men as a Rearguard. I asked him why the others were not helping but he simply said \"They are Armenians & Syrians\". We urged him to go back to Sain Kala at once as he was wanted in handling the people there. I then took over these 24 & as Shed had had his last fight 18 miles further on decided to ride out & hide my force in the rough country & give them a go with the M.G’s trusting that the new weapon would lead the enemy to believe that British Troops were now in the field & bluff them off. The great anxiety was to get the people back to Sain Kala before the Turkish Commander at Maindab (who has 250 Turks & 250 Kurds) can get down on us. We rode on past Chailkanan to a village in a narrow valley 6 miles ahead. Before we got to the village we’d left our\n\nhorses tethered to the poplar trees on the outskirts & 2 miles South a long valley branches off to the right & apparantly joined the main one North of this village.\n","166":" I sent Nicol with Place & Nimmo with 12 Christians & a Lewis Gun to hold this valley in case the enemy were there or if we drove those out of the village to prevent them from doubling round on our rear. I then took Scott Olsen the other 4 Sgts 12 Christian & two guns forward to the Scrap. Sgt Murphy & a Russian officer with this party rode on as a sort of advance guard & when within 600 yds of the village were fired on. We moved up under cover of the dead ground & got our Lewis Guns into action, which had the effect of clearing the enemy from the village about 20 of them galloped \n\nover the rise about ½ a mile further on, so we occuppied the village & I posted a Christian on the ridge to the right as an observer & sent Murphy & Brophy with 4 Christians ahead to see what was doing beyond the ridge. They took a M.G with them & soon we heard it in action, so pushed up the other one & the rest of the men & got into action against about 75 of the enemy, who galloped over the ridge to the left. It was now dusk so I pulled back to Chal Kanain where we could get inside a house on the outskirts near water & protect ourselves far easier.\n\nPicking up Nicol we got back about 11 pm & selected a house near water surrounded by high mud walls. We had had nothing to eat since breakfast & no sign of the mules with our rations, so a couple \n\nof the Sgts. selected a sheep & stuck it up with a bayonet. We grilled the meat on long wires, had a drink of water & rolled up in some hay after feeding & watering the horses & posting an Armenian as sentry at the gate. At about 3am the mules turned up, Nimmo having gone out for them. At dawn we were astir & posted Cameron on the roof to keep a look out & looked to breakfast. I intended staying here until noon thus giving the refugees a start & resting the horses after the hard day before.\n\nHalf an hour later Cameron reported a group of about 100 horsemen riding towards us 6 miles to our left rear coming over the ridge over which we had driven the enemy the night before. Telling him to watch them as they had halted, we went on preparing breakfast. 10 minutes later he called \n","167":" up to the roof & there I saw hundreds of the enemy moving towards us over the ridges to the right & left. Away back towards Sain Kala were the moving people so I at once ordered boot & saddle, sending Nicol with one gun to the left of the village. Scott Olsen to the road in rear while the Chief, Brophy & I with a gun took the left flank among the poplars. Casey & Place stayed with some of the Christians to load the mules while Cameron remained on look out. Brophy & I got the gun into position & waited until 200 of the enemy got to the further edge of the plantation 600 yds away where they dismounted & sat down. I then turned 2 drums full into them knocking them & their horses right & left. The crowd hurriedly departed leaving the right clear.\n\nWe then rode on to the others & found Nicol doing the same on his flank. The Armenians with us with the exception of 2 & the Russian officer bolted. I sent Murphy back to hurry up the loading while the rest of us formed a line on a ridge a little to the rear where we could command the flank & protect the boys as they came out of the village. We got into action twice on the left & drove them off with M. G fire then we heard the gun in action in the village, shortly after they came into view leading the mules. Murphy had the gun & took up a position between us & the village he was no sooner there when a crowd of horsemen galloped out. Murphy knocked them back & again they tried with the same result. Then they got back & shot down all the mules but fortunately the lads got clear. Nicol went to their assistance & and was heard \n\nfalling without afterwards moving. Murphy who was near Nicol’s horse sent Nimmo back while he covered him. The horse was killed but Nimmo got clear & Murphy gave up his own horse to Nimmo to have another go. Again the horse was hit but again Nimmo got clear. \nWe then\n They then came back to us along a & we had a pretty stiff go before falling back to the next ridge. Cameron made another attempt afterwards, but the enemy was between him & Nicols in such force that I called him back.\n\nWe then fought from ridge to ridge 8 against at least 700 until they almost surrounded us & then would pull back to another position. Not once would the Christians come to our assistance even tho all the men were armed & when it got particularly hot. The chief & I bailed up 14 at the point of our revolvers & gave them the choice of riding with us in a charge in order to get the guns back to the next position a mile \n\nback or be shot there & then. They agreed to ride, so forming them up on the further side of one of the two columns of refugees we rode thru the people scattering all those mounted right & left & bluffing the enemy that a large force was charging. The enemy ducked over the ridge & Brophy & I stayed with the unfortunate women & urged them not to forsake their waggons drawn by buffalos with the grain & food. The guns got back & some time afterwards about noon a Sgt with 10 Russians rode out having intercepted my message to Moore stating the position & asking him to send the Cavalry out as we intended fighting a delaying action to give the cavalry a chance in the open. These few men were magnificent & gave us a chance for a breather. After 8 hours fighting over 20 odd miles of country. 50 Armenians were sent out by Petros who in showing themselves dispersed the enemy who at once \n\nretired. We bot back minus once officer killed, 3 horses killed (another hit during the fight) (but fortunately we collected a few stray mounts) & almost every round of ammunition used. Nothing to eat 36 hours & nothing to drink since daylight. The cavalry we met 700 yds from camp when I sent out to finish the chase.\n\nOn falling back into camp I discovered Moore packing up to clear but prevented this after telling him off as I considered it pure desertion of the people. At night we pulled back a mile to a ridge for better defence & all that day Shed & Petros assisted by Kay got the people on the move towards Bijah. We got into our new position shortly after dark. Dr. Shed who complained of feeling ill went ahead but unfortunately lost his way. We sent two Sgts out to find him & his wife. They returned about midnight stating the Dr. was 6 miles further on & very ill.\n\nThe Cavalry Dr went out & returned at dawn with Mrs. Shed stating the Dr had died during the night from Cholera. Thus are lost our right hand man & a Christian hero went to his Maker fighting for the cause until the end.\n\nAt dawn the outposts opened fire & on going to the ridge saw a party of the enemy in retreat. Moore feigned sickness & handed over to me. After altering the disposition we waited for the enemy without avail. We then pretended to dismantle the guns & retire, hiding just over the crest but without avail, they wouldn’t come on. At noon we set off on towards Taken Tepe hoping the people would be clear of a dangerous gorge a few miles back. The Cavalry rode on with the convoy while I with my people formed a rear guard.\n\nA patrol had been sent out \n\nunder a Cavalry officer at dawn with Scotty as guide to see if Nicol’s body could be brought in but on coming into action with a party of the enemy the cavalry officer retired much to Scotty’s disgust. We got the people clear of the gorge & camped near San Jud, which was now in ruins, destroyed by the Christians, with many of the inhabitants murdered. \n I will never forget the horrors of that day. The bulk of the Armenian & Syrian men had ridden ahead deserting their wives & families. The wounded women, the aged & weak children dropped by the wayside, not able to go another inch, calling on us to save their lives. We dismounted & got them up on our horses & mules yet hundreds had to be abandoned\n\nas our job was to save the greatest number & it would be hopeless trying to save the weakings as Bijah was the nearest city of refuge. Next day we rested. A group of Cavalry rode into a neighbouring village to buy provisions. 6 shots caused them to retire. In disgust I sent young Wallace & Casey with a couple of our muleteers into the same village where they purchased all we wanted the villages becoming pacified at the sight of our Persian muleteers. They thought the other people would treat them as the Christians had treated the people of San Jud.\n\nMoore in his fright wanted to push on early in the morning but I refused as my men & horses were done. Smith & Tollen were both down and \n\nill with fever & Kingscote is off color. At 5pm in the cool of the evening we moved on to Genja to find this place aflame. At dawn next morning we were on the track again, carrying women & children on our horses & walking ourselves reaching Taken Tepas at 4pm, and found Capt McLean with another Sgt there. Stairnes had moved them up with a detachment of Cavalry to go on with the levy raising started by us & thanks to their presence Taken Tepe was secure. Agha Petros had endeavoured to raise a force on the night of the","168":" but without \navail\nsuccess, so had ridden on here & had gathered about 50 of his kinsmen together. \n\nKingscote is dangerously ill with pneumonia. I sent Wilson & France out to a village 6 miles \n\nSouth to prevent the Christians from murdering or destroying. We pitched camp & now I am turning in feeling hopelessly tired.\n","169":"\n\nWilson sent a message in stating that 3-400 Tribesman were raiding the people. Took 6 Sgts 2 Guns & Petros’s 50 men out to them. Rode 20 miles & sighted the enemy who not seeing our full force on a\/c of the dust hiding the rear files, galloped to a ridge 4 miles east of the road. Too late to fight as it was falling dusk so came to the top of a ridge ½ mile west of the people & there extended to the neighbouring hillocks. At dark we lit a string of seemingly camp fires when they had died out returned to camp, trusting that the bluff of \n\nleading them to believe that a strong force is now with the people will work. Arrived camp 1 am cold, tired & hungry, a feed of warmed up stew & bed for me.\n","170":"\n\nMoved camp to cleaner ground, as the refugees have defiled this place.\n\nThis evening two girls came into camp practically stripped, one with a terrible hole thro her shoulder caused by a dum dum, the other wounded in the behind. So bathed the wounds with condy water. The poor girl hit in the shoulder has her wound all flyblown.\n\nNearly all my men sick including myself & Bijah 50 odd miles away.\n","171":"\n\nResting today. Cholera is raging amongst the people & Many of the women come along in the morning & afternoon to the Dr. ? (myself) established quite a reputation as such since taking the two girls in hand, their wounds now clean but the poor unfortunate shot thro the shoulder looks terribly ill. Gave the women one or two pills according to their size, look at their tongues & feel their pulse beforehand. The poor wretches have implicit faith in us.\n","172":"\n\nFrance who was out with Wilson died of cholera this afternoon. At 9 am Wilson sent along a note to say he was bad & asked for the Cavalry Dr. but he has his hands full with Kingscote & others, so couldn’t go. I sent Kay out with an extra mule to bring him into camp.\n\nKay returned at 5pm with his dead body. After tea we dug a grave & buried the poor chap by the light of a lantern after reading the burial service & firing 3 volleys. This is terrible & I am afraid we will all go next. All of us are ill. Smith, Todman and Tollan very ill indeed. I wonder how long we will last. Any how we will all play the game until the end of that I am sure. These boys are heroes & I love them all. May God be good to us. Getting on well at collecting grain & camels to take the worse cases among the refugees to Bijah. If all goes well tonight we start tomorrow thank God.\n","173":"\n\nLeft Taken Tepe this morning and we are now camped at Kizal Bulahk. Chaildecott joined us last night. Mrs. Shed is in the true sense of \n\nthe word a heroine in the way she helped us with the people today. Agha Petros brought along his 50 men whom I am using as an advance guard, Baggage guard & Rear Guard. Brovey & Scott Olsen are with the Refugees. Wilson we picked up en route & is in charge of the convoy. Kay is with the Rearguard & I am looking after the advance guard with Murphy & Brophy (Can).\n\nWe soon discovered that all the available Sgts would have to be placed amongst the people as we have 2 and 3 on each camel & when no one is looking the strongest throw the weaker ones off in order to have an easier ride. Smith & Tollen are both very ill. I almost despair of getting Smith to Bijah alive.\n\nAn Armenian preacher has his wife & family with us. Tonight the wife is very low as she has been ill for some time. Bound all the wounded ones in arrival at camp.\n","174":"\n\nPassed thro the most dangerous tract. Kizal Bulahk to Perga. Dead bodies are everywhere & all stripped & every spring is polluted with dead bodies & water is about 20 miles apart. Feeling very ill all day.\n","175":"\n\nArrived Bijah 6 pm done up & burning with fever. I hardly remember the details of the day but thank God we have got the people to safety. I’m done.\n\nA big mail waiting thank God for that cheer.\n","176":"\n\nHave been very ill with fever thought the end had come many times. Two Drs have been sent up from Hamadan to look after the people. Two hospitals established for them & one for us. All but Wilson out to it. I am afraid Smithson & Brophy N Z are done for.\n","177":"\n\nFeeling a bit better recommended for 2 weeks leave to Hamadan. Seddon blocked it. I am to take over a camp of 700 refugees tomorrow & hurry them on to Hamadan in batches as there is practically no food for them here.\n","178":"\n\nTook over the camp from Fisher. Had some trouble with the loafers & sponges who are waiting for mules to journey to Hamadan, but put the fear of God into their hearts.\n","179":"\n\n I am again running a temp and haven’t been able to eat a bite all day.\n","180":" \n\nFeet & ankles out like baloons. Guess its Berri Berri. Dr. says I must go to Hamadan with convoy tomorrow. Wonder if its better to use my revolver.\n","181":"\n\nColaba Bombay.\n\nThe old diary has been locked up in my valise which I haven’t been able to open since leaving Hamadan. I have lost all count of time since that day of","182":" when I did the 100 miles run in a Ford car to Hamadan. I must have been delerious when I got here. Woke up to find myself in a tent & above all a bed even if the blankets were full of lice. Influenza was raging during the three weeks I spent there & a lot of our people died including Lake, Brophy & Smithson. The Turks made a thrust at Zenjan & the Col in command at Hamadan \n\nwanted me to go up and take charge but was too ill & when I went for a walk I fainted after doing 500 yds. The missionaries (God bless them) especially Dr & Mrs. Funk did all they could for me & at last I persuaded the officials to let me take the chance on the run thro to Baghdad, which they did. Leaving Hamadan at 6 am we pushed on until dark & then camped out in the blue. My temp went up once more & next day I was exhausted on reaching Kermansbah where I was in bed for 4 days, then another stretch to Pia Tak, then Karnekan and Ruz where I anchored for 3 days & had real bread & jam. Then a night’s run on the train to Baghdad where I spent three weeks then on to Amara by boat where I stayed 4 days, then Batoun Amarah where I stayed a fortnight. Then by boat to Bombay. God alone knows what privations, hardship & horrors we endured on this stunt. Scott- Olsen got his M.C. Murphy a bar to his O.C.M. Nimmo a O.C.R. & Casey a M.M. while Moore the cur got on to Baghdad as soon as possible after our arrival at Bijah & wrote his report in such a way as if he did the whole show and did not recommend one of those I told him to.\n\nI am feeling much better now however \n\nmy heart is in a very bad way due to the straining of a valve, but I hope to get home pretty soon now. It’s heaven here to have the gentle touch of a woman’s hand as she ministers to one. What a curse this world would be without women.\n","183":"\n\nEgypt.\n\nJust received notification today that I’ve been award the D.S.O. for the Urmiah stunt. Left Bombay","184":" to join the","185":" but stopped here & am due to leave for Aust any day. What will home mean after the last 4 years.\n\n"}}