{"Document Name":{"0":"Diary_0518","1":"Diary_0518","2":"Diary_0518","3":"Diary_0518","4":"Diary_0518","5":"Diary_0518","6":"Diary_0518","7":"Diary_0518","8":"Diary_0518","9":"Diary_0518","10":"Diary_0518","11":"Diary_0518","12":"Diary_0518","13":"Diary_0518","14":"Diary_0518","15":"Diary_0518","16":"Diary_0518","17":"Diary_0518","18":"Diary_0518","19":"Diary_0518","20":"Diary_0518","21":"Diary_0518","22":"Diary_0518","23":"Diary_0518","24":"Diary_0518","25":"Diary_0518","26":"Diary_0518","27":"Diary_0518","28":"Diary_0518","29":"Diary_0518","30":"Diary_0518","31":"Diary_0518","32":"Diary_0518","33":"Diary_0518","34":"Diary_0518","35":"Diary_0518","36":"Diary_0518","37":"Diary_0518","38":"Diary_0518","39":"Diary_0518","40":"Diary_0518","41":"Diary_0518","42":"Diary_0518","43":"Diary_0518","44":"Diary_0518","45":"Diary_0518","46":"Diary_0518","47":"Diary_0518","48":"Diary_0518","49":"Diary_0518","50":"Diary_0518","51":"Diary_0518","52":"Diary_0518","53":"Diary_0518","54":"Diary_0518","55":"Diary_0518","56":"Diary_0518","57":"Diary_0518","58":"Diary_0518","59":"Diary_0518","60":"Diary_0518","61":"Diary_0518","62":"Diary_0518","63":"Diary_0518","64":"Diary_0518","65":"Diary_0518"},"Date":{"0":"unknown","1":1388.0,"2":1389.0,"3":1390.0,"4":1393.0,"5":1395.0,"6":1396.0,"7":1397.0,"8":1398.0,"9":1399.0,"10":1400.0,"11":1402.0,"12":1403.0,"13":1404.0,"14":1405.0,"15":1407.0,"16":1408.0,"17":1409.0,"18":1410.0,"19":1411.0,"20":1412.0,"21":1413.0,"22":1415.0,"23":1417.0,"24":1418.0,"25":1419.0,"26":1422.0,"27":1429.0,"28":1430.0,"29":1431.0,"30":1434.0,"31":1435.0,"32":1437.0,"33":1438.0,"34":1444.0,"35":1445.0,"36":1446.0,"37":1447.0,"38":1448.0,"39":1449.0,"40":1453.0,"41":1457.0,"42":1458.0,"43":1462.0,"44":1464.0,"45":1465.0,"46":1466.0,"47":1467.0,"48":1468.0,"49":1469.0,"50":1470.0,"51":1471.0,"52":1472.0,"53":1476.0,"54":1477.0,"55":1481.0,"56":1482.0,"57":1483.0,"58":1484.0,"59":1492.0,"60":1503.0,"61":1504.0,"62":1518.0,"63":1520.0,"64":1521.0,"65":1523.0},"Entry":{"0":"\n\n \n\n","1":" We are at Perham Downs in the overseas draft \n‘camp’. The food is good but the training is very hard and the \ndiscipline strict.\nThe camp is divided up into 4 divisions which are progressive \nbeing soft, medium, hard & draft. \nThere is a bull-\n\n \n\nring here where the usual training in Musketry, bombing. \nBayonet fighting Rapid wiring etc. is carried out.\nThe hours are from 6.30 am to 4.30 p.m. with usual breaks for \nmeals and two night stunts a week. P.J. for early morning. \nAfter breakfast each morning there is a brigade par-\n\n \n\nade and we do a few rifle exercises collectively and finish up \nwith what is called the \"mad mile\", but called by the authorities \n\"the instructional march\". It consists of a march round in diverse \nways, of the brigade. 2 batt’ns to the right & 2 to the left, in \ncolumn of route wheeling & interlacing, forming\n\n \n\na very picturesque pattern on the hillside.\nThe Depot & bugle bands play in turn during the march.\nThe commandant of the camp is Major Steele, better known as \n\"the Mad Major\", being the originator of the mad mile & \nbeing besides a very erratic officer, but good to the men \n \nSep 25th At midday\n\n \n\nwe left Perham for overseas, We arrived at Southampton at 4 \np.m. and boarded the \"Bonus Queen\" which left at 8 p.m. \narriving at Le Havre at 5 a.m. on the \n","2":" We then marched to the Aus Base which is about 7 miles \ndistant & allotted to the","3":" ADBD.\n","4":" Still at Le Havre and having a good time. There is a \n\n \n\nbull ring here also. \nI could write a lot of the morals of this place where immorality \nseems to be regarded as a virtue than a vice suffice is to say \nthat there is a society of ladies at the disposal of soldiers \n(W.a.a.C) who may obtain them on the production of pay book, \nand their signature.\n\n \n","5":" is allowed per month on each side and no charge is made. \n196 of the society were put out of action in a month.\nThis in addition to licensed & unlicensed houses.\n","6":" Went into Le Havre and had a tres bon time \nWe see a lot of the French dirigibles which are nearly as big as \nZeps which often come\n\n \n\nsailing over the camp.\n","7":" Have finished bull-ring and are classed out & will very \nlikely go to-morrow.\n","8":" Left","9":" A.D.B.D. for another taste of the front line at 9 am.\nLeft Le H. 4 p.m. \nWeather perceptibly colder going across France, in horse trucks \nas before.\n","10":" Detrained at Hazebrook marched\n\n \n\nto Morbecque camp. beaucoup rain slush mud etc. Did the \nusual gas rigmarole for a day or two on B.Beef & B. till \nthings were organised a bit.\nThere is a scarcity of canteens and places to get a feed. There \nis one feed shop in the town where you can get eggs at about 4 \ntimes the usual price if you have a few hours to spare.\n\n \n","11":" Wanted to go to a place and asked m’lle the way in all the \nFrench I knew, when I was finished she said \"Where do you \nwant to go\" in as good English as I could have handed her. \nSomewhat encouraging Eh What.\nSpend a lot of time knocking tasteless pears off the pear trees \nthat grow by the roadside & suffer inwardly accord-\n\n \n\ningly.\n","12":" Left Morbecque camp and marched to Harzebrook where \nwe entrained for the line at 4.30 p.m. Arrived at Poperinghe at \n7.0 p.m. \nWe were homeless and nobody seemed to know we existed, no \nguides to meet us, so we waited in the rain and cold for about 2 \nhours when officers somehow came to the conclusion that we\n\n \n\ncould not stay there all night, found us billets in a convent.\n","13":" In the morning we left at 8 a.m. for Ypres which is in \nBelgium about 10 kilos from Poperinghe.\nThe aeroplanes are far bigger and faster than any I have \npreviously seen, the main feature being the new British Triplane. \nYpres is simply a mass of devasted Brick-work, ruins, ruins as \nfar as the eye can see.\n\n \n\nWhere there are no buildings there are huge shell craters. \nDuds are lying about everywhere, flying pings, 18 lbers, and to \ngive an idea of the unlimited supply of shells there is a footpath \nmade out of 6? shells.\nThe long lines of motor transports which seem endless give one \nan idea of the vast supply system.\n","14":" As soon as we got to the battalion we got in touch with the \nband\n\n \n\nmaster and straightway re-instated in the band. \nIn the night we were housed in a dug-out made of boxes, but \nowing to being flooded out by the rains caused by the incessant \nshell fire we went down into a tent. \nThen they started to shell us and for about 4 or 5 hours shells \nlanded round us from 2 Fritz naval guns 20 miles distant. These \nare 6? armour piercing\n\n \n\nand search the ground systematically for guns and dumps. 2 \nmen were killed and 1 wounded out of the 50 that are left in \ncamp.\nThe boys went into the line and hopped over early this morning. \nWe won’t hear much until they come back, but we know Mr \nCarmichael is wounded again. \nThe barrages simply dwarf those of the Somme and are a \ncontinuous roll \n\n \n\nof drum fire while the whole front is lit up with the flashes as with \nelectric light.\nOut in the line (which is only known as a blue line on maps for \nthere are no trenches merely shell holes) men are lying about \neverywhere Fritzes, Scotties, Australians all either rotting or \nskeletons. \nPill boxes lie uprooted, tanks, some crawling some casualties. \nBig\n\n \n\ndugouts with room enough to train a battalion of men, some \neven with electric light plant. \nThere is an artificial tree made of steel with copper bark which is \na \ngerman\n Canadian observation post and \nlook-out. It is remarkably life-like.\n","15":" One of our guns has put one of those sleep chasers out of \naction so last night we only had one troubling us. May they do \nditto with\n\n \n\nof drum fire\n the other. In Ypres side by side lie the \nruins of the famous Cloth Hall & Cathedral. \nWe are camped about 200 yards from the famous Menin Rd \nalong which the german prisoners are brought from the front \nline.\n","16":" A fleet of Gothas came over this morning and there was a \nbattle in the air which lasted half an hour. Our anti-Aircraft Guns \nwas putting\n\n \n\nshells all round them but I think it is only the biggest fluke in the \nworld for them to bring one down. \nAccompanying the gothas were several fighting planes, which \nwere there to protect the Gothas while they did their observation \nand bomb-dropping.\n","17":" In the night Fritz put numerous bombs round the camp also \nmany shells to try and find the dumps.\n\n \n\nso far we have had no casualties in the band since I have come \nback, but 2 have been killed and several wounded in the \nbattalion. \nThe boys have been over the top in the direction of \nPasschendale ridge, advanced 3000 yds, but had to come back \nto the first objective owing to failures on the flanks. \nIn the 36th 113 men & 4 officers\n35th 85 men & 4 officers\n\n \n\nThis is proportionate throughout the entire attack, so it gives an \nidea of the heavy casualties inflicted upon us, and which must \nbe far less than Fritz’s, owing to the number of men Fritz had in \nthe line.\n\n15th Bombed and shelled again to-night. 4 killed & 6 \nwounded in adjoining lines. Saw one of our observation \nballoons brought down by a Fritz aeroplane. Our camp is well- \nnamed \"Hell-Fire Corner\"\n\n \n\nThe men descended in parachute. It was a fine sight to see the \nballoon come down in flames.\n","18":" Left at 3.45 p.m. and went back 3 miles the other side of \nYpres and pitched tents in the dark. \nSaw one of our aero’s bring down a Fritz plane from a great \nheight. One of the men was shot out of the plane and fell down \nand made a hole in the ground nearly\n\n \n\nas big as a shell hole. (Have not heard whether he was hurt) \nRushed over to have a look but apparently the whole of the \nB.E.F. & A.I.F. have got in before us. It was a new type of \nplane and an effort was made to keep the crowd back but the \ncrowd carted away the plane in portions a souvenirs. I have a \npiece of a plane the black is part of the distinguishing cross.\n\n \n","19":" Details have just reached us of Maj. Buchanan’s death. He \nwas the most fearless and admired officer in the batt. He was \nhit by an explosive bullet and said to a 34th Serg. \"Sergeant, \ngive my pay book to Major Blacklaw\" and then \"Sergeant I’m ","20":" Shoot me\" \"I cant\" said the sergeant \"All right Sergeant\" \nhe said and put a revolver bullet through his head.\n","21":" Fritz has just bombed and shelled \"Hell-\n\n \n\nfire corner, the camp we have just left, and the casualties were \n200. What a lucky escape for us. \nSpent the afternoon in salvaging. \nOut of 685 men who went into the trenches 83 answered roll call \nand 3 out of 16 officers. \nThe battalion’s rations were sent into the lines but they were all \nfed out of one co’s rations\n\n \n","22":" Left rest camp to go back to Leddingham, there to \nreorganise. It is a small scattered village 40 miles from Ypres. \nWe went out in motor buses and were shelled going out. We \npassed through Poperinghe, Steenworde, Caselle (army h’q’rs) \nand got to Leddingham 10 p.m.\n","23":" billeted in barns of French peasants, and play a \nprogramme every afternoon. Mac cooks for us so are living \nwell.\n\n \n","24":" As chat parades can be better described verbally than in \nwriting, I leave that for the pleasure of amusing fastidious friends \nof the future. ","25":" A Runner’s lot is not always a happy one \nThis is a page out of the life of one these unfortunates. \nACT I TRAGEDY \n\nTime – 2 a.m. \n\nScene – Dug-out of an erasable old major and an equally irr-\n\n \n\nitable captain \n\nEnter runner with dispatch. \n\nDisturbs major – a grunt, no more.\n\nTries again, ! ! ? * - Turns over on his side again. \n\nAnother shake. \n\nMajor jumps out of bed and with a few kicks, brushes, etc \n\nassails runner from the room. \n\nACT II COMEDY \n\nSCENE road. \n\nexcited runner & \n\n \n\nseveral of his mates\n\nDescribes Act I \n\n\"They cant do that\" he said \n\n\"But they have\" said one of his mates \n\n\"Have they\" he said \"But I tell you they cant\" \n\n\"They did anyway\" returned his mate \n\n\"I’ll see the sergeant\" he said \"They cant do that\" \n\nExit Runner leaving mates laughing, muttering \"They can’t do \n\nthat\" \n\nCurtain.\n\n \n ","26":" Mr Flynn, our bandmaster has been taken to hospital with a \ntouch of trench fever & trench feet. \nI don’t think I mentioned that our billet is an ex-pigsty & our \nneighbours pigs. \n","27":" In every French homestead is a square which is \nsurrounded by the house, stables, barns etc and in this square \nis thrown, slush straw, manure and \n\n \n\nin fact everything that smells. Bruce Bairnsfather has rightly \nnamed this square a rectangular smell. even dead sheep etc. \nare flung into this & considering the back door opens out \non to it and pigs roam off it into the house, it can hardly be \ncalled sanitary.\n","28":" Perhaps a word about the New German gas is worth \nrecording.\n\n \n\nIt’s most \"German\" feature is that it caries syphilis germs, \naccording to latest investigations. Contact with the gas causes \nlarge blisters, and at times even eats the flesh anywhere \nperspiration gathers. If the eyes are subjected to the gas, as \nwhen testing for gas, it is likely to cause temporary blindness, \nvery much resembling\n\n \n\nsandy blight.\n","29":" In these country villages where there has been a death, \na cross is placed on the gatepost & at times on the street \ncorner.\n","30":" Left Ledinghem for the line. Were conveyed in motor \nwagons to within 17 Kilos of our destination and billeted in a fine \nhouse in Vieux Berquin. We passed through, Happe, &\n\n \n\nseveral other towns but it is advisable not to record names.\n","31":" Rested at V.B. for the day.\n","32":" Left V.B. at noon in motor waggons for the line and \narrived at Rossignol Camp near Nieppe at 9 p.m.\n","33":" The men went into the line at 5 p.m. \nThe band remained out to do fatigue, guard & to practice.\n\n \n\nThe sector is called La Toquet, and within 3 hours of taking over \nour scouts discovered a sunken bridge over the canal 3 feet \nunder the water by which means the germans were able to \ncapture N.Z. patrols, Tommy mail sergeants with mail etc for the \nlast 3 months\n","34":" Two of our birds had their sentence read out to-day, both \nwere sentenced to be shot\n\n \n\nbut both had their sentences commuted to 10 years P.S. \nA Cowles was sent away to do his time, while J.H. Bagnell was \nsent to the front line, his sentence being suspended.\n","35":" The band went & played at Steenwurck at the","36":" \nBatt Aus Art. Camp. Were transported in G.S.Waggons, our \ninsides and seats suffering accordingly.\n","37":" The battalion came out of the line last\n\n \n\nnight. There has only been 5 casualties this spell in one being \nfatal\n","38":" We gave a concert to the battalion first night out which was \na great success.\n","39":" British have made a 5 mile advance near Cambrai, led by \nthe tanks whose motto was \"England expects that every tank \nthis day will do its damned-ist.\n\n \n","40":" We are still in our comfy huts in Rossignol camp near \nNieppe and all round us is the flash and roar of the heavy guns. \nTo the right of us is Armentieres, Houplines. In front La Toquet, \nLe Bizet, Plugsteert, and to our left Messines & \nPasschendale. This will give an idea of our position All round \nus the roar of the guns intermingle causing what is \n\n \n\ncalled drum-fire. The sky at times is lit up with a ruddy glow that \nis for all the world like an Australian sunset on a hot day. \nOur second concert last night was a great success.\n","41":" Orders came out this morning to turn up our hats and put \nthe badge in the side. \nWe have been\n\n \n\ntransferred to the first Army Corps.\n","42":" Taken in a M.T. to Steenwerck to play at a vaudeville show \nby \"Anzac Coves\". A permanent pierrot troupe. Billeted in town \nand having a fine time.\n","43":" Two German Balloons came over to day dropping \npamphlets containing glowing & exagger-\n\n \n\nated reports of German successes which did not in any way \nintimidate as was intended.\n","44":" The Colonel has been singing out because of the band \nbeing away & has asked for us through Division with a \nresult that we have packed up and return to Romarin to-day so \nare back with battn.\n\n \n","45":" A Fleet of 7 gothas came over dropping bombs. ","46":" small balloons were sent over which automatically releases \npamphlets.\n","47":" More gothas 10 this time. One got separated from the rest \nand made for Fritz’s line. One of our fighting planes darted out \nfrom the clouds & got over the Gotha\n\n \n\nand straightway a flame appeared on the gotha about the \nengine and in a short time down she came, the man tumbling \ndown in front of the machine. Our plane looked like a small \nspec over the huge gotha. \nThe remainder of the gothas went on a bomb-dropping \nexpedition with a result of 14 horses\n\n \n\nkilled, 1 man & 5 wounded. \nPlayed at football match between 36th &","48":" M.Gs. \nresult 3 – 3.\n","49":" Saw one of our dumps go up & got marching orders \nfor to-morrow.\n","50":" Left Romarin for Jesus Farm, the 2nd Div. taking over from \nus. \nHave heard the the plane that brought\n\n \n\ndown the Gotha on the","51":" was a \"Dolphin\", a new British plane \nof which there is only one on this front. It has been officially \nstated that 9 out of 10 of the Gothas were brought down, 3 \nbeing accounted for by the Dolphin\n","52":" Large fall of snow, and Cold weather generally. Rumor \n& the papers say that the Germans are\n\n \n\nmassing to make a big advance on this front. And preparations \nhave been made to meet it.\n","53":" The Germans bombard heavily every night all the way from \nArmentiers to Passchendaele, but the expected advance has \nnot taken place. \nWe can see the 2 lines of observation balloons, ours and Fritz, \nand often\n\n \n\nFritz puts over a shrapnel shell or two with the object of bringing \ndown our balloons. \nNearly every evening a squadron of our planes go on a bombing \nexpedition over Fritz’s support camps.\n","54":" The valves of our instruments are frozen every morning \nand we have to keep them warm or they will freeze again.\n\n \n","55":" Issued with plum puddings cigarettes raisins \netc. and with what we bought ourselves we had a fine time. A \nConcert all the afternoon.\n","56":" Went to Panto. Dick Whittington & his cat at \nSteenwork by Anzac Coves. The roads are frozen hard and you \nare risking your neck walking on it. The ground is so hard\n\n \n\nit will turn a pick\n\n1918","57":" How did we spend New Year ? riotously. At 12 we banged \ntins and made all sorts of rows, played Auld lang syne Shook \nhands with each other and generally acted like kids.","58":" \nI don’t think I quite did justice to Xmas so will continue\n\n \n\nHaving been provided with the aforementioned additions to our \ncommissariat department, we hied ourselves to the the nearest \nrefreshment bureau and there purchased several goblets of \nthirst quencher, and various viands. At dinner after having \ntoasted everyone we could think of we finished by toasting our-\n\n \n\nselves, and – er – I fear we waxed excessively convivial. After \ndinner everybody was called upon to sing or do something \nequally silly and although there was very little music there was \nplenty of noise. We applauded everybody because at this time \nof the year it is better to be polite than truthful. It is kinder \nanyway.\n\n \n\n3rdJan Shifted back to Merris for a rest. \nA few words about the snow. It is damnable stuff. It freezes the \nground and makes it hard enough to turn a pick. And if you fall !! \nWe made a slide over a frozen pond and if anyone is tired of life \nI advise them to take on sliding.\n\n \n\nThe winter is very wintry at present and my feet are more painful \nthan pleasant\n","59":" 2 of our aeroplane pilots tried to kiss one another in mid-air \n& thereby hangs a tale.\n","60":" Little did I think I would ever usurp the personality of a \nfemale but there it is c’est le guerre. I have been doing a little \nacting\n\n \n\nof late at battalion concerts in \"the Burglar and the Girl\" and \nseveral other sketches of tragic & comic nature. Of course \nI know my feet are rather small for the part, but the audience \nmust look at what I have got and take the rest for granted.\n","61":" We went to play at \"A\" Co’s billets last night and it was \nraining, not good\n\n \n\nold Aussie rain, but wet sloppy French stuff, and coming home \nthe road which led to our billets we were surprised to find it \nmetamorphosed into a river. Seeking a drier path by the \nroadside, I found the gutter i.e. 6 ft of water instead of 2 ft and \nsaid more about France in 2 minutes than I could have thought \nin a week.\n\n \n","62":" Left Meteren for canteen Corner, a muddy camp about ","63":" kilos from Steenwerck.\n","64":" Played at church parade and presentation of prizes by \nGeneral Birdwood, over 20 men were decorated with D.C.M’s \n& M M’s one with both.\n","65":" Left Canteen Corner for Blighty Leave.\n\n \n\n "}}