{"Document Name":{"0":"Diary_0280","1":"Diary_0280","2":"Diary_0280","3":"Diary_0280","4":"Diary_0280","5":"Diary_0280","6":"Diary_0280","7":"Diary_0280","8":"Diary_0280","9":"Diary_0280","10":"Diary_0280","11":"Diary_0280","12":"Diary_0280","13":"Diary_0280","14":"Diary_0280","15":"Diary_0280","16":"Diary_0280","17":"Diary_0280","18":"Diary_0280","19":"Diary_0280","20":"Diary_0280","21":"Diary_0280","22":"Diary_0280","23":"Diary_0280","24":"Diary_0280","25":"Diary_0280","26":"Diary_0280","27":"Diary_0280","28":"Diary_0280","29":"Diary_0280","30":"Diary_0280","31":"Diary_0280","32":"Diary_0280","33":"Diary_0280","34":"Diary_0280","35":"Diary_0280","36":"Diary_0280","37":"Diary_0280","38":"Diary_0280","39":"Diary_0280","40":"Diary_0280","41":"Diary_0280","42":"Diary_0280","43":"Diary_0280","44":"Diary_0280","45":"Diary_0280","46":"Diary_0280"},"Date":{"0":"unknown","1":640.0,"2":641.0,"3":642.0,"4":643.0,"5":644.0,"6":645.0,"7":646.0,"8":647.0,"9":648.0,"10":649.0,"11":673.0,"12":686.0,"13":687.0,"14":688.0,"15":689.0,"16":690.0,"17":691.0,"18":693.0,"19":699.0,"20":703.0,"21":704.0,"22":706.0,"23":707.0,"24":713.0,"25":714.0,"26":715.0,"27":716.0,"28":717.0,"29":718.0,"30":719.0,"31":720.0,"32":721.0,"33":722.0,"34":723.0,"35":728.0,"36":729.0,"37":730.0,"38":731.0,"39":733.0,"40":734.0,"41":735.0,"42":736.0,"43":764.0,"44":765.0,"45":766.0,"46":776.0},"Entry":{"0":"\n\n","1":"\n\nCairo\n\nYesterday I had leave and I went to Cairo and The Pyrimids and Sphinx, left Cairo By motor car after lunch time. We arrived at our Destination, we had a Drink and then we hired a guide and he explained everything to us. We went under the mids and also through the Temples and the Buried City. Things are very interesting here. There was three of us and we had a splendid time on Donkeys, motor cars and Carriages and Trams.\n\n22nd\/9\/16\n\nCairo\nTo Day I am going to the zooligical gardens measeum and citadal.\n\n23\/9\/16\n\nYesterday Seargent Major Rory and myself went out to the Cairo Zooligical gardens and we had a most interesting time. There is in this zoo various virities of Both animals and Birds, in one place there are about Eight Kangaroos, Presented By the 3rd A.L.H. regiment and a monkey presented By Pte Warren. All there were OK. The grounds are most Beautyful. I Don't know what spaces\n\nit covers But I should say 15 acres, it is all like the Australian Bush and the paths are very nice. They are all made out of pebbles and are formed into all sorts of flowers. To have a good look around this zoo it would take about 2 or 3 Days. The zoo is about three miles from Cairo and you can go By Either motor car Trams or Carriages. They have 2 of the pontoons taken from the Turks when they tried to enter Egypt last February. The occupants must have had a very warm reception as the pontoons were absolutly Riddled with Bullet and schrapnel.\n\nHeliopolis\nCairo\n\n23\/9\/15\nIam at present lying in No 2 Auxiliary Convalescent Depot, Heliopolis suffering from wounds that I received from the turks while fighting them on Gallipoli Peninsula. I was 4 months at the front and in that time I have been wounded twice, once on May the 3rd and again on August the 10th​. The former I received after our Brigade had made an attack up a very steep gulley. This was on May the 2nd. The 16th Battalion W.A. went out in front of us and carried there ridge at the point of\n\nDead mans ridge attack.\n\nthe Bayonet, singing Australia will be there and Tipperary. I Don't know what Hill they went through in this attack, But I will give an account as I seen it. The 13th Battalion went into the trenches on Friday and would have Been relieved on the Saturday at seven oclock. But we had orders to stand fast to advance that night as we were waiting for the order to move forward. Orders came to us that we were not going to advance that night, well we remained in the trenches till Sunday May 2nd when we again received\n\nDead mans ridge\n\norders to advance and take the ridge in front of us. As I said Before The 16th Battn. went out in front of us and then we followed about 10 minutes after. No sooner had we left our trenches before men Began to fall. This we had all got used to up the gulley. We pushed But we were Brought to a standstill. The men in front could not get over the Difficult ground quick Enough and men were falling very fast now. We could not get at the Enemy from our position, so we had to keep cool and wait until\n\nDead mans ridge attack\n\nwe were on higher ground. So once again we move forward and this time one German officer on our left kept calling out, Come on Otargo Boys, this way. Otargos are a N.Z. regiment and they were more to our left so one of our chaps took my rifle and called out several times advance one but the officers did not remain any longer. The Cliffs were that steep that we had to catch hold of roots and pull ourselves up on. On one occasion I went to catch a root as I thought But no sooner had I toughed it I found that I was\n\n\n\nDead mans ridge\n\ncatching hold of one of my Dead comrades feet. This made me as if I wanted to vomit. Anyhow we reached the top of the Cliff and we started to Dig ourselves in. I had to remain on top of the trench all night and the Bullets were coming very fast, how I Escaped getting hit I Don't know. In the morning 3rd of May I could see the Enemy coming up to attack us. Some had Indian turbanes round their Heads and some had Big Bushes on their Back so as to try and make us think were trees. I could\n\nDead mans ridge\n\nsee one chap in particular crawling up to our trenches with Bombs. I jumped into the trench and fired. I Don't think that chap will tell any more tales he was no more than 10 yards from our trench. I reported to the Seargent that the Enemy were coming up,but he would have that they were our own men. Any how it was not long before every rifle in that trench was speaking. The attack had Been repelled. Soon after I was sent off on a message and when I was returning a Corpral called me over into the Support\n\n\n\nDead mans ridge\n\ntrench. I jumped in and asked him for the makeings of a cigarette wich he gave me. I had Been smoking it a few minutes when crash and I got one in the left arm in a line with the heart. The Bullet remained in my arm, but I could just see the end of it. SoI pulled it out and Droped it in the Trench. I left then and went to get my arm Dressed at the Dressing Station. They sent me from there to the Beach where we were put on lighters and sent to the Hospital Ship Gascon. I remained on her for about\n\nDead mans ridge\n\nfour hours and thenI was transferred to the Glouster Castle were I agreed to go Back on shore again. I was put on another Ship, this time the Seang Bee wich to us from from Egypt to the Dardanelles early in April. From this ship I went Back to shore on Saturday May 8th,but I did not want any more like Sunday May 3rd, it was just Hell pure and simple with the gates open wide at that.\n\n23\/9\/15\n\nCairo\n\n23\/9\/15\n\nIn above I have described howI received my first wound. I will now give an account of the fighting from August 6th till the 16th when I received my wound.On Friday afternoon August the 6 the Brigader General had all the nom coms of the the Brigade on parade and he told them we were going to advance that night. This came as a surprise to us as we had not expected to advance till the Sunday night. He Explained Everything to us and told us that we must take\n\nAttack on Sari Bair\n\nAugust the 6th 1915\n\nat all cost Hill 971 and he also told us that the British were going to make another landing to the North of the peninsula this way Suvla Bay. The whole Brigade was on parade at about 9.pm. ready to march out to the asault. We left reserve gulley at 9-30 pm, the 13th Battalion in the lead and then came the 14th, 15th, 16th Behind us. We marched out along the Beach for 1½ miles and then we came to our No. 3 outpost wich had just attacked the turkish outpost and captured their trench\n\n\n\nSari Bair\n\nand a machine gun. From this point we turned to our right, we had not gone far Before we got in amongst the turks. No. 2 platoon was told off to charge the ridge in front of them and they carried the ridge with the loose of few men. Then we made forward again and orders we given for another charge. This time I charged and Capt. Lee was in charge of us. All this time the English were getting ashore very fast at their men landing, we were going at the turks all the time and Bullets were coming pretty fast.\n\nSari Bair\n\nI was just behind Capt. Lee when he fell and I believe he was hit on the wrist and knee. He never uttered a sound when he fell, he was gone. He was just walking over ridges after ridge and firing his revolver. One ridge us came to the turks were entrenched and we charged them 5 times before we took the trench from them. Our Major came up and someone called out, we have no one to lead us Major, and he replied, come on I will lead you and he Did.We had very\n\nSari Bair\n\nhard luck in the attack as we were right on top of some turkish guns wich they succedded in getting away. But never mind Better luck next time perhaps. Well on August 10th I was just preparing to cook some Dinner when I was wounded. The Bullet went in the right \nthighi\n thigh and through to the left were it remained until Aug. the","2":" when I was operated on at No. 1 Australian Hospital, Heliopolis. I have Beaten the turks again and they will have to waste another Bullet on me to kill.\n\nNo. 2 Auxiliary Hospital, Cairo, Egypt\n","3":"\n\nToday has been very quiet. There has been Church Service twice. I am still in Hospital at Heliopoli . Today there is a rumour going round that Bulgaria has gon in with the Central powers. This is rotten news as I thought she would come in on our side and now that she has gone against us it remains to Be seen if we can force the Dardanelles or not. We will certainly have a greater task than ever in front of us now than ever. Britain have in\n\n\n\n\n\n\n\nBulgaria\n\nmy opinion left things to late. I hope we get moveing quick as it is our only chance of success. We have lost a lot of men and it would be awful to think that we had lost them in vain, let us all hope that it will not be the case. No Doubt we will have Greece and Roumania in with us against Bulgaria and Turkey and I think that the former can Deal with the later allright.\n","4":"\n\nThe landing\n\nAs I have not kept a Diary of the fighting at Gallipoli I am going to give an account of things: as I can remember most of the important Events that accured from April the 25th until August the 10th when I was wounded a second time while we were making an advance on our left flank.\n\nGeo McClintock\n\nOn April the 25th 1915 we were going to make landing on hostile ground at about 9 o'clock on the above Date. We Steamed out of Lemnos harbour bound for Dardanelles. While\n\n\n\nThe Landing\n\nwe were some 35 miles from Dardanelles, we could hear the violent Bombardment that was taking place. When we arrived about noon we learnt that our Boys had Been ashore since 4 AM. This made us all very excited and we were all to get ashore to help our Brave comrades. There was 7 or 8 warships Bombarding for all they were worth. All this time we were on our transports waiting for the Destroyers to come and take us ashore. At last one came along side and took some of the 15 and 16th Battalion ashore.\n\nThe landing\n\nBut it Did not come Back for us, much to our Disappointment. At night we were still on Board. There we were waiting to land, Everything ready for the fray. We had on our Backs Bundles of wood as we believed wood was very scarce ashore. While we were \na\n waiting and watching the shore there flashed out a signal that told us that our Boys had gained the Hill. At this we cheered and cheered untill our throats were sore from shouting. Rain it Did that night and on our ship you could see the restless\n\nThe Landing\n\ntroops walking about with Blankets on to keep themselves warm and dry. Still no Boat came to take us off. Then we all went into the saloon and awaited Events. While we were there we had a Sing Song and it was great to see the spirits of the men. We had no sleep as we had orders to stand fast as we may go ashore any moment. That night as it turned out we Did not But remained on Board till \nSund\n Monday morning April 26th. We had a cup of tea for Breakfast as we\n\nThe Landing\n\nwere expected to be off Ship before that time so there was no preparations made for us. But we all took the tea with a smile as we knew that when we got ashore we may not get any for Days. 9 oclock aDestroyer came alongside and wanted to know if there was any infantry to go ashore and with a yell we all answered yes. Now we leave the good Seang Bee, as that was the name of the transport that carried the advance party of the 4th Brigade from Dusty Egypt. Now we are on the Destroyer sailing for the\n\nThe Landing\n\nland. While we were going ashore some of our Boys were killed from Bullets and schrapnel on chap was hit on his collar badge. The Badge was Bent but no injury to the wearer, he was lucky indeed. Well after a time we reached the shore and then we were marched along the Beach and took our packs off. I might mention that some of them never seen their packs again. Those that Did find them also found that they had all Been gone throug Before they found them again\n\nThe Landing\n\nby somebody that could not find his own. I was very lucky in mine, the only things that were missing were cigarettes, towel and one Bag of iron rations. Iron rations \nConist\n consist of one pound tin of Bulley Beef two oxo tubes for makeing Bovril with and tea sugar and Biscuits. We landed with 2 of these rations and with that and Bottle of water had to last us 3 Days. On the 2nd of May however I lost my pack while we were attacking the Turks. Of this attack I will give an account later. We now leave the Beach and go up to the trenches.\n\nThe landing\n\nWhile we were making our way up there was wounded coming Down fast from the firing line. Going up these gullies you could not But wonder how our men ever got so far inland as they Did. The gullies were not to good to walk along as there was plenty of mud in some of them. Anyhow we tried to keep on Dry ground as much as possible. The under growth here afforded splendid cover for the turkish snipers& wich they made the Best opportunity off. When we arrived at the\n\nThe landing\n\nfiring line, it turned out that we had lost our way. Lieutenent Pulling of No. 2 platoon A Company was in charge of us.When we could see that the Enemy were pressing us hard, I with four others started to Dig ourselves in. Their names were Pte Daynzey, Stanford, Walters and Franklin. While we were in our Dug out three shells Burst just on top of our Dug outs and covered us with Dirt from head to foot. I, all this time, I was shaking like a leaf, it was not because I was frightned\n\nThe landing\n\nbecaus I was not, my nearves had gone completely. Anyhow we got orders to get ready for a Bayonet charge from Major Brown. This officer belonged to the","5":" Battalion and he was a Brave officer. When I first seen him he was covered with Bandges on his head and face. Come on Boy he said, get into these Turks and rely on the Bayonet. Dont fire a shot if you can help it. All this time he was walking about the trench Exposed to the Turkish fire. I Dont think he knew what fear meant.Now we are in the trench with\n\nThe landing\n\nour Bayonets fixed ready to charge. When the order is given Pte Thompson is near me and we deside to have something to eat wich was Bulley Beef and Biscuits. I had just pulled these out of my Havesack and put it on the ground when the order came to stand fast. So we Did not get any lunch that time again. The order came, are you ready and we said yes. Then follow me, said Major Brown and with that we leapt out of the trench singing out Hurrah and making all sorts of row. We never got in\n\nLanding\n\nsight of any turks, oh Dear no, they have great respect for the Cold Steel. This was about 8 pm on April the 27th. Well we pushed forward again, we came to some Bits of trenches so we jumped in. Just before we went on this charge Private Thompson came up to me and said, come on Mac we will Die together. Those words were only spoken in jest, But they came true for my Dear Comrade Bill, as we called him, come running up to the trench and asked, is there any room in there Boys and as we were\n\nand what folled it\n\nthree Deep we told Bill to try and regain the support trench. All right, he replied and with that he jumped up and no sooner had he than he cried out, oh my God I am Badly wounded & he was shot through the groin and the Bullet struck a pouch of his Bandolier and set 5 cartridges off. On Wensday April the 28th we started to Dig our trenches Deeper and connect them. This was awful work as I was in a little Bit of hole with two other me on top of me nearly all night and my legs were cramped up\n\nConclusion\n\nsomething terriable. To connect these trenches, we had to lay on our Backs and dig for all we were worth. All this time we had no water since","6":" and we were nearly Dead for the want of water. Sometimes one or two Bottles of water would be passed along for someone further up the trench. A Seargent and his men were in one Section of the trench from Sunday till Wenesday with very little water. So you can just imagine for yourself what sort of time we had.\n\nfinished\n","7":"\n\nIn the early Stages of the fighting at Gallipoli, I forgot to mention that on the night of April the 27 the Turks attacked us, we let them come up within 30 feet of us and then we put a murderous fire into them and they suffered pretty Badly that night. In the morning when I went to pull my rifle off the parapet I found that my Bayonet had Been struck with a Bullet leaving about 2½ inches of Bayonet on my rifle. I Should have kept this as a Sovenir. But \nwe we\n I was too Excited to think of Souvenirs so I\n\n\n\npulled it off the rifle and threw it away. About 3 pm on April the","8":" I came out of that trench to go and find the 13th Battalion wich I belong too, it was when coming out of this trenches that some pals told me that Private Thompson was laying a few yards away Dead. This poor fellows Death was a sad one as he Died before he had time to fire a shot. From here I go with Pte Brown and Manley to find our Battalion. While we were leaving the trenches Schrapnel and Bullets\n\nwer coming in all Directions. We made our way to the Beach to find out where to go and find the Battalion. They were on Popes Post But we Did not join them until April the","9":" we were away from our Battalion for the first 5 days. We leave the beach on the above Date and go up Schrapnel Gulley and join the Battalion.\n\nfinished\n","10":"\n\nNo 2 Auxiliary Hospital\n\nStill there is no outlook of me getting away from here. I have been here a month now and I wish that they would Dischard me.\n\n\n\nBase Details Camp\nCairo\n","11":"\n\nI am out of hospital a fortnight now and camped over at the Base Camp wich is at Zeitoun and about 5 miles from Cairo.\n\nGallipoli","12":"\n\nI arrived Back here last night after 3 months absence in hospital. When I returned I Did not know the place it had altered so much while away. Coming along the Beach there are first class roads and a railway to fetch our Supplies, part of the way to the firing lines. I am on Durants Post with my Battalion\n\n\n\n\n\n\n\nwho have been holding this position since their return to Gallipoli from Lemnos. Durant's post is on top of a steep Hill with Hill 971 in front of us. Looking from here you can see tents out at Suvla Bay. They are hospitals and no Doubt they have a lot of paitints in them. Then again there are Hospital Ships and warships. This ground was in the turks hands up till August the","13":" when we had a big advance on our left and cleared our Enemy right out of it and gave them the fright of their lives no Doubt.\n\nThis place is wonderfully altered since I was here last. In a few Days time we are going to start and make winter quarters wich will be very comfortable.\nfinished\n\nLemnos Island\n","14":"\n\nWe arrived here at 2-30 today after 56 hours sail from Alexandria. On our way accross we were met with a Destroyer and it was zig zaging about looking for Submarines. Luckily we Did not meet any. I am at present on Board Ship & looking from here you can see Hospitals & on Shore Canadains, English and Australians\n\n\n\nand a great number of tents scattered all over the place. In the harbour there are all sorts of Ships including Hospitals Ships, warships, transports, trawlers, pinnaces, Barges . It is a City on the waves. We Expect to go ashore here to join up with our Battalion.\nfinished\n\nLemnos island\nBase Convalescent Camp\n\n22nd\/12\/15\n\nWe are still waiting to goon Board Ship. We were supposed to go yesterday but it was raining so the transports could not come for us as the ground was to muddy for the motor cars.\n\nBase Convalescent Camp\n\n22nd\/12\/15\n\nIt is just 12 months ago today since we left Dear old Australia and many things have happened in that time. Since then we made our famous landing at Gallipoli and some of my Best mates have Been killed. When we were Embarking at Port Melbourne some of those that were killed were all smiles, But they now rest in a lonely grave on Gallipoli.\nfinished\n\n\n\n23\/12\/15\n\nI am on Board the Hospital Ship Soudan and we are Bound for Malta wich we expect to reach on Saturday some time. At present the sea is splendid but we may run into heavey weather before we reach port. We came on Board this Ship last night from Mudros West Base Convalescent Camp where we did not get the best of treatmentby any means indeed.Lets hope that we get better at Malta any how we could not get treated much worse.\nfinished\n\nS.S. Minnewaska\n","15":"\n\nYesterday we came on Board this Ship and we are going Back to Gallipoli to have another go at the turks. This is not a bad Ship at all I suppose, she is about 20,000 tons. On our mess Decks there is very poor outlet. If a Submarine did happen to get at her there would be an appaling loss of life. There are about 2500 troops on Board independent of the Crew. I Dont know what they number But it must be a couple of hundred or more. There are on Board Ship\n\n\n\nAustralians, N. Zealand and British troops and about 500 mules. These mules are used for transport purposes in carring ammunition and food supply up to the firing line. The Sea is beautyfuly calm at present, but we may run into a rough sea before we reach Lemnos Island. This is the time for rough weather about here. The rougher it gets the safer it gets for us on Board. Submarines are pretty thick about here and we may meet one before we reach Lemnos. Only a few\n\nweeks ago the 7th and 8th reinforcements for the 13 Battalion we supposed to have been torpedoed. Of course it is only a roumour but there may be some truth in it. When we reach Lemnos we will know if its true. When the","16":" Brigade were on their way to Lemnos they struck a Sub and there were was a good many Drowned. I believe the G Brigadier dropped dead from shock. We are now 3 hours sail from Alexandria and the journey to Lemnos is 48 hours\n","17":" we have to go another 45 before we reach Lemnos. The last time that I was going this way was early in April before we made our name at Gallipoli. I was going over then with my mates who have been wounded or killed.One of them has gone back to Australia, his name is L.G. Mason. 58 on board, there are about 25 life Boatsso we will have a chance if we do happen to get torpedoed. I dont thinkwe will strike any and I dont mind telling you we eont want to either.\n\n\n\nOsmanieh, S.S. Minnewaska\n","18":"\n\nLemnos\n\nWe are now on Board Ship and the Distance from here to Gallipoli is 60 miles. We will reach there some time tonight and join up with our Battalion tomorrow morning. We were all on Ship yesterday and at the last moment we were told to get back to the Minnewaska. The weather was to rough to land us at Anzac. We may not get away to day, but there is a slight chance of doing so soon. Any how I hope that we reach there tonight, so that I will see some of my old pals again.\nfinished.\n","19":"\n\nLemnos Island\n\nAt present there are arriving here every Day troops from Gallipoli and I think that they must be leaving there for good and a good job too because they will never do any good there now. Gallipoli should have been won in May and so it would have been if England had have sent Enough men. But no England puts a handful of men on there and Expects them to Do the job, wich is asking too much indeed. England has a lot to learn yetin that line.\nfinished.\n\nSt Patricks Hospital\n\nMalta\n","20":"\n\nWe came into this hospital last night from Mudros wich we left on Thursday December the","21":" and arrived in Malta harbour on Saturday the","22":" about 2 pm. Christmas Day we spent on Board Ship (Soudan). For Dinner we had roast Beef, potatoes - pumpkin - and Plum Pudding and turkey. (Oh turkey) but we we were sick of turkey as we were having lumps of it since April the","23":" we had been haveing it for Eight months and then we had to withdrawbecause some turkeys are to hard to pluck. So lets have Chicken next Xmas.\n\nChristmas Day 1915\n\nMalta\n\nWe arrived in Malta at 2 pm today. Coming into this harbour you see lots of guns in the forts and I suppose there are hundreds you cant see. This place, looking from the harbour looks peculiar indeed. It is Built right on top of the waters edge high up on the rocks. Coming round the ship are a lot of Maltese Kids and they want you to thow money into the water and they will Dive for it and very sedom miss it. They, like the Natives of Colombo, are very good at this sort of game. When I get ashore I hope to get a good look at this place and see wich is Best, Malta or Egypt.\n","24":"\n\nMalta\n\nPresents received at Xmas time from England and Aust.\n\n1 tin of Cigarettes\n1 tin of Sweets\n1 pair of Socks\n1 cake of Soap\nwasher\nwriting matirial, pencil\nChristmas Card","25":" Box matches\nShaveing Brush. Shaveing Soap.\nTtooth-Brush, pipe. tobacco\nBoot laces\nAnd Several other Small items\n\nGeo McClintock\n","26":"\n\nMalta\n\nYesterday we were giveing a Drive and we went out to the orange gardens wich are about 4 miles from the hospital. The Gardens are very pretty indeed and well worth a trip too. On the way out you could not but wonder at the way the Maltese make paddocks. They are all partitioned off with Brick walls and some of them would not make a decent backyard. Maltese like the Egyptians are all for money. Going along the Streets in Either places you are stopped and asked for money, here it is the Children, but Egypt it is Everbody. G.M.\n\nLemnos island\n\nTroops are coming on the to island every day from Gallipoli. They are giveing up the Suvla Bay and Anzacs fronts. I dont know if they will do the same at Cape Helles or not but they will I believe bring them all away from the whole front on the peninsula. While I was there this month it snowed and it knows how to snow here when it starts. It started to snow on Sunday night and on Monday morning the Hills were covered with it. Our dud outs were all knocked \nwere\n in with the weight of the snow and by goast wasnt it\n\ncold. I know I was shivering like a leaf on trees on a windy Day. We Australians cannot possiable stand a winter on Gallipoli. The weather would kill more than Bullets would.\n","27":"\nOn Board Hospital Ship Soudan at Sea\n","28":"\n\nJust 12 months ago to day we were leaving Albany harbour for Egypt and the troopships came out in single file and when we were far Enough out at sea the ships formed up into three lines.\n\n\n\nIn all there was 18 Ships in all. Our Escort was the ill fated Submarine A.E. 2 wich was lost in the Dardnelles while crusing looking for Ships Bellonging to Allah. The Crew was taken to Constantinople as prisoners of war. We are likely to reach Malta some time tomorrow.\n\nLemnos island wich none of us were sorry to leave Because the treatment that we got there was something cruel. I was in the 3rd Canadain Hospital for a few days\n\nand all that we got to eat was for Breakfast porriage, about ½ Dozen Spoons fulls, no more & one slice of Bacon and tea without any sugar in it. For Dinner we received Stew and some rice pudding wichI think was made for pigs instead of human Beings. For tea we had some tea and Bread and jam. Putting the three meals together it would hardly make one Decent meal. A man is worse when he comes out before he went in to such places, and this is how they treat men after the he gose through at.\n\nThese are the rations that we get issued to us at the front.\n\nJam ¼ of a tin per Day.\nSugar, One ounce per Day, perhaps it may be two.\nBacon, 2 Slices per Day.\nBully Beef, you can get as much of this tack as you want.\nTea 2 ounces per Day.\nCheese about 3 ounces and it is not to good at that.\nSalt very little.\nBiscuits, of these there was an unlimited supply.\nRum about ¼ of a pint a week.\n\nThis ration is supposed to last us 24 hours\n\n\n","29":" you think it Enough for a man on active service. I Dont. I know and I only wish some of the heads had to live on it for a few weeks and I am sure they would make more complaints than the men. This food ration talk that you read about in the papers is all pure Bluff, let me tell you, the English Soldier Does not get Enough food and this is the cause that there is so much sickness amongst them.\n\nJust a few names of Posts around Anzac.\n\nQuinns post\nWalkers ridge\nSchrapnel Gulley\nPopes Hills\nCourtneys post\nDead mans ridge","30":" May, Wounded)\nSteels post\nLone Pine\nMonash Gulley\nAnzac Beach\nThe Death trap\nDurants post\nHerrings Post (Wounded","31":"\nJohnsons Jolly\nRest gulley\n\nContinued\n\nHells point, Chathams post, the Bluff, Tasman post, Browns Dip,Whites gulley\n\nName of guns that shell us\n\nLonely lizzie\nBeachy Bill\nWhistling rufus\nThe 75french.\n\nQuinns post is known to Every Australian and New Zealander who has Been to Gallipoli. The Enemy trenches are as near as 10 to 40 yards. This place used to be Hell, any time that you went into the trench you never Expected to come out alive as the turks used to just rain Bombs on us from their trench.\n\n\n\nThis is the kit that that I carried on April the 25th 1915\n\nRifle and Bayonet\nFull Webb Equipment\n1 Bundle of wood\nGreat coat, towel, Comb, Soap, rayzor, tooth Brush\n2 Shirts, 2 pairs underpants","32":" Belt, hat, Socks\nIron rations, Cigarettes, matches\nTooth powder, Handychief \nCap, comforter\n200 rounds of ammunition\nWater Bottle full\nLooking glass,Shaving Soap\nShaving Brush, 1 Extra pair of Boot laces and several other small items not worth mentioning.\n","33":"\n\nNew From Home\n\nI have received no letter from home now for over 3 months. Now it is seven months ago since I received a letter from home. This shows what sort of postal system we have in the army, our letters from one place to another. There must be 50 letters for me some where, But where God only knows, I am sure I Dont know where they are.\n\nGeorge.\n","34":"\n\nGallipoli Peninsula\n\nOn the above Date I was in the","35":" Clearing Station at Anzac. All that morning the turks were sending schrapnel over and some of it was coming close to the above stationary but it was not Done purposely for we had tons of ammunition close to the Hospital and not only that But General Headquarters and also a Wireless Station and a Battery of guns close By, and this was the turk objective in the afternoon.\n\nUnfortunately they put 6 and 28 inch Shells over into the Hospital and killed about 50 and wounded many. The turks cannot be blamed for this. They were after other things But missed and got us instead. One chap was sitting Down near me when the first Big Shell Bursted and he jumped singing out oh, oh. I Did not know what was wrong with him. I thought that he must have got a shock, but such was not the case, he had one of his fingers Blown off.\n\nAnd the English call this fair fighting. Well I Dont and it is not fair to the men in hospital and not fair to the Enemy. The turks fought us fair and I Dont think any one could fight fairer.\n\nBritish Causelties up till the end of November, 112297.\nOfficers killed, 1609.\nMen Killed or Died, 36670.\n\n\n\nMalta\n","36":"\n\nI have only briefly Described these attacks. If I was to write them in full it would take a Dozen of these books and therefore it would take to long to write out, so I am only just putting things as Brief as possible. So you will understand that it would take to much time and we have not too much of that to spare, but I am going to write the whole of my Experiences from April the 25\/1915\n\nup to the present January the 29th 1916, but it will not be all praise for the Army of that I can assure you.\n\nG. McClintock 63\nA Coy 13th Battalion","37":" Brigade","38":" A.I.F.\n\nWest Mudros\n","39":"\n\nIt has been raining today and it has made the ground very sloopy, it reminds me of the Black Soil out on the N.W. Plains of New South Wales, particular around Narrabri. You have only to walk about 100 yards and you have 2 ft of mud on your Boots and it is not to pleasant to be carring about with you. The rain Does not look like if it is going to knock off for some time yet. I hope it Does because it is so uncomfortable to get about in.\n\nGallipoli Peninsula\n","40":"\n\nToday on the peninsula is not too bad. The sun has come for the first time this week and in that time it has been snowing here, and it knows how to snow here when it starts and it is playing up with the Boys. Here the Doctors parade in the morning is a very big one. The men are suffering from frost Bite and it is not the best of complaints from what I have seen of it. The toes Drop off the feet.\n\nGallipoli\n\n26\/11\/15\n\nI have been back here a fortnight now and in that time things are pretty quiet. We are holding Durants post and Enemy trenches are up 75 yards from ours, so not many get hit. The shells will come and explode on the trenchbut then they Do not hit many. This last few Days a sniper has Been giving some trouble, one has killed two me, one the day before yesterday and another today.\n","41":"\n\nMudros island\n\nToday we were inspected By the C.O. of the Convalescent Camp and he marked me C. This makes it the 2nd time that I have been marked. This camp is called the Base Convalescent Camp and it is situated at Mudros west about 60 miles from Gallipoli Peninsula. This island is one mass of tents. When the french get wounded they go home to france and get cured there of their wounds. There is no french hospitals on this island at any rate.\n","42":"\n\nThis place is some thing awful. You can go no where here like you can in Egypt. Valletta wich is the main town our the island and when you go over there you can only go to the pictures and they are not to good. The sooner I get out of this place the Better I will like it. I hope to be in Egypt next week.\n\nCancelled\n\nMcClintock\n","43":"\n\nAustralian Hall, Malta\n","44":"\n\nThe above place was opened on the above Date By his Ex the Governor of the island \nLord Matheun\n Lord Mathuin who in his opening speech paid great praise to the Colonial troops and also to the Australian Government. There was a concert \nwich\n which was very good and it was packed to the Doors. The opening night all the Australians was invited. The Hall itself is very\n\n\n\nnice. The Curtain is beautiful, it Shows the Australian flag and Cupid with arm fulls of flowers and war ships with the coast of Gallipoli in the Background. I suppose it can hold 3 thousand troops and it will be a great Boon for the troops that come here Either wounded or sick. There is to be two concerts each week on Saturdays afternoon and night and During the week there are amusements and refreshments.\n","45":" thanks to the Commonwealth Government, the troops will be able to spend many an Enjoyable hour there.\n","46":"\n\nToday is very miserable it has been raining this last 4 Days and there is no sign of it clearing yet. The people here prayed for rain on Sunday and they have got what they asked for only too much of it. They ought to pray for peace and see if they are so successfull. I Dont\n\nthink they would be some how But they might be able to Do as much as Mr Ford the American peace Dove who is running all over the place making or trying to make a great advertisment for his cars. I wonder if the Germans have Started to sing Goot Straff, Mr Ford. Yet I Should think they are singing Goot Bless Mr Ford and Kaiser Bill and his Goot Straff cry, it seems to be that he is not heard.\n\n"}}