{"Document Name":{"0":"Diary_0303","1":"Diary_0303","2":"Diary_0303","3":"Diary_0303","4":"Diary_0303","5":"Diary_0303","6":"Diary_0303","7":"Diary_0303","8":"Diary_0303","9":"Diary_0303","10":"Diary_0303","11":"Diary_0303","12":"Diary_0303","13":"Diary_0303","14":"Diary_0303","15":"Diary_0303","16":"Diary_0303","17":"Diary_0303","18":"Diary_0303","19":"Diary_0303","20":"Diary_0303","21":"Diary_0303","22":"Diary_0303","23":"Diary_0303","24":"Diary_0303","25":"Diary_0303","26":"Diary_0303","27":"Diary_0303","28":"Diary_0303","29":"Diary_0303","30":"Diary_0303","31":"Diary_0303","32":"Diary_0303","33":"Diary_0303","34":"Diary_0303","35":"Diary_0303","36":"Diary_0303","37":"Diary_0303","38":"Diary_0303","39":"Diary_0303","40":"Diary_0303","41":"Diary_0303","42":"Diary_0303","43":"Diary_0303","44":"Diary_0303","45":"Diary_0303","46":"Diary_0303","47":"Diary_0303","48":"Diary_0303","49":"Diary_0303","50":"Diary_0303","51":"Diary_0303","52":"Diary_0303","53":"Diary_0303","54":"Diary_0303","55":"Diary_0303","56":"Diary_0303","57":"Diary_0303","58":"Diary_0303","59":"Diary_0303","60":"Diary_0303","61":"Diary_0303","62":"Diary_0303","63":"Diary_0303","64":"Diary_0303","65":"Diary_0303","66":"Diary_0303","67":"Diary_0303","68":"Diary_0303","69":"Diary_0303","70":"Diary_0303","71":"Diary_0303","72":"Diary_0303","73":"Diary_0303","74":"Diary_0303","75":"Diary_0303","76":"Diary_0303","77":"Diary_0303","78":"Diary_0303","79":"Diary_0303","80":"Diary_0303","81":"Diary_0303","82":"Diary_0303","83":"Diary_0303","84":"Diary_0303","85":"Diary_0303","86":"Diary_0303","87":"Diary_0303","88":"Diary_0303","89":"Diary_0303","90":"Diary_0303","91":"Diary_0303","92":"Diary_0303","93":"Diary_0303","94":"Diary_0303","95":"Diary_0303","96":"Diary_0303","97":"Diary_0303","98":"Diary_0303","99":"Diary_0303","100":"Diary_0303","101":"Diary_0303","102":"Diary_0303","103":"Diary_0303","104":"Diary_0303","105":"Diary_0303","106":"Diary_0303","107":"Diary_0303","108":"Diary_0303","109":"Diary_0303","110":"Diary_0303","111":"Diary_0303","112":"Diary_0303","113":"Diary_0303","114":"Diary_0303","115":"Diary_0303","116":"Diary_0303","117":"Diary_0303","118":"Diary_0303","119":"Diary_0303","120":"Diary_0303","121":"Diary_0303","122":"Diary_0303","123":"Diary_0303","124":"Diary_0303","125":"Diary_0303","126":"Diary_0303","127":"Diary_0303","128":"Diary_0303","129":"Diary_0303","130":"Diary_0303","131":"Diary_0303","132":"Diary_0303","133":"Diary_0303","134":"Diary_0303","135":"Diary_0303","136":"Diary_0303","137":"Diary_0303","138":"Diary_0303","139":"Diary_0303","140":"Diary_0303","141":"Diary_0303","142":"Diary_0303","143":"Diary_0303","144":"Diary_0303","145":"Diary_0303","146":"Diary_0303","147":"Diary_0303","148":"Diary_0303","149":"Diary_0303","150":"Diary_0303","151":"Diary_0303","152":"Diary_0303","153":"Diary_0303","154":"Diary_0303","155":"Diary_0303","156":"Diary_0303","157":"Diary_0303","158":"Diary_0303","159":"Diary_0303","160":"Diary_0303","161":"Diary_0303","162":"Diary_0303","163":"Diary_0303","164":"Diary_0303","165":"Diary_0303","166":"Diary_0303","167":"Diary_0303","168":"Diary_0303","169":"Diary_0303","170":"Diary_0303","171":"Diary_0303","172":"Diary_0303","173":"Diary_0303","174":"Diary_0303","175":"Diary_0303","176":"Diary_0303","177":"Diary_0303","178":"Diary_0303","179":"Diary_0303","180":"Diary_0303","181":"Diary_0303","182":"Diary_0303","183":"Diary_0303","184":"Diary_0303","185":"Diary_0303","186":"Diary_0303","187":"Diary_0303","188":"Diary_0303","189":"Diary_0303","190":"Diary_0303","191":"Diary_0303","192":"Diary_0303","193":"Diary_0303","194":"Diary_0303","195":"Diary_0303","196":"Diary_0303","197":"Diary_0303","198":"Diary_0303","199":"Diary_0303","200":"Diary_0303","201":"Diary_0303","202":"Diary_0303","203":"Diary_0303","204":"Diary_0303","205":"Diary_0303","206":"Diary_0303","207":"Diary_0303","208":"Diary_0303","209":"Diary_0303","210":"Diary_0303","211":"Diary_0303","212":"Diary_0303","213":"Diary_0303"},"Date":{"0":"unknown","1":863.0,"2":870.0,"3":871.0,"4":872.0,"5":873.0,"6":874.0,"7":875.0,"8":876.0,"9":877.0,"10":878.0,"11":879.0,"12":880.0,"13":881.0,"14":882.0,"15":884.0,"16":885.0,"17":886.0,"18":887.0,"19":888.0,"20":889.0,"21":890.0,"22":891.0,"23":892.0,"24":893.0,"25":896.0,"26":901.0,"27":902.0,"28":903.0,"29":904.0,"30":905.0,"31":916.0,"32":917.0,"33":918.0,"34":921.0,"35":932.0,"36":933.0,"37":939.0,"38":940.0,"39":941.0,"40":942.0,"41":943.0,"42":944.0,"43":945.0,"44":946.0,"45":951.0,"46":962.0,"47":971.0,"48":972.0,"49":974.0,"50":975.0,"51":976.0,"52":977.0,"53":979.0,"54":982.0,"55":985.0,"56":986.0,"57":987.0,"58":988.0,"59":989.0,"60":991.0,"61":993.0,"62":995.0,"63":997.0,"64":998.0,"65":999.0,"66":1000.0,"67":1001.0,"68":1002.0,"69":1003.0,"70":1004.0,"71":1005.0,"72":1006.0,"73":1007.0,"74":1008.0,"75":1009.0,"76":1010.0,"77":1011.0,"78":1012.0,"79":1013.0,"80":1014.0,"81":1018.0,"82":1024.0,"83":1025.0,"84":1026.0,"85":1027.0,"86":1028.0,"87":1036.0,"88":1037.0,"89":1038.0,"90":1039.0,"91":1040.0,"92":1041.0,"93":1042.0,"94":1043.0,"95":1053.0,"96":1054.0,"97":1055.0,"98":1056.0,"99":1057.0,"100":1058.0,"101":1059.0,"102":1060.0,"103":1062.0,"104":1064.0,"105":1065.0,"106":1066.0,"107":1067.0,"108":1068.0,"109":1073.0,"110":1078.0,"111":1080.0,"112":1081.0,"113":1085.0,"114":1086.0,"115":1098.0,"116":1099.0,"117":1100.0,"118":1101.0,"119":1102.0,"120":1103.0,"121":1104.0,"122":1105.0,"123":1106.0,"124":1108.0,"125":1109.0,"126":1110.0,"127":1113.0,"128":1115.0,"129":1116.0,"130":1117.0,"131":1118.0,"132":1119.0,"133":1120.0,"134":1121.0,"135":1122.0,"136":1123.0,"137":1124.0,"138":1125.0,"139":1126.0,"140":1127.0,"141":1128.0,"142":1129.0,"143":1130.0,"144":1131.0,"145":1132.0,"146":1133.0,"147":1134.0,"148":1135.0,"149":1136.0,"150":1137.0,"151":1138.0,"152":1139.0,"153":1140.0,"154":1153.0,"155":1154.0,"156":1155.0,"157":1156.0,"158":1171.0,"159":1172.0,"160":1173.0,"161":1174.0,"162":1175.0,"163":1176.0,"164":1177.0,"165":1178.0,"166":1179.0,"167":1180.0,"168":1181.0,"169":1182.0,"170":1183.0,"171":1184.0,"172":1185.0,"173":1186.0,"174":1187.0,"175":1188.0,"176":1189.0,"177":1190.0,"178":1191.0,"179":1192.0,"180":1193.0,"181":1194.0,"182":1195.0,"183":1197.0,"184":1198.0,"185":1199.0,"186":1200.0,"187":1201.0,"188":1204.0,"189":1205.0,"190":1209.0,"191":1210.0,"192":1211.0,"193":1212.0,"194":1213.0,"195":1214.0,"196":1215.0,"197":1216.0,"198":1217.0,"199":1218.0,"200":1219.0,"201":1220.0,"202":1221.0,"203":1222.0,"204":1230.0,"205":1231.0,"206":1232.0,"207":1233.0,"208":1234.0,"209":1235.0,"210":1240.0,"211":1241.0,"212":1242.0,"213":1243.0},"Entry":{"0":" \n\n","1":" 1916\n\nOn Tuesday just before mess the rumours that in future the Australians here were only to get 15F. a fortnight came out.\n\nMess was a hell of a rowdy meal and more talking-down went on than eating – anyhow the meat was rotten. Those drawing 1\/- a day don’t feel the pinch, but those drawing 2\/- almost to a man decided while it was only a rumour not to take anything at pay if it was true. Some of the arguments as to wether the authorities would be able to so reduce our pay, without a pays warning were not half bad, but as was most natural side issues were more argued on than the main idea. Even at 9am yesterday, just before pay the betting against the reduction was 2-1, but just before pay, the Col gave it out officially – and we took it like lambs: we really couldn’t take it any other way for the simple reason that his way of announcing it was as rotten: perhaps the Government is – as he says – hard up, but even so at least a pay’s notice should have been given. The generally accepted explanation is that the government feel that the money is more needed \nin\n Australia than \nby\n Australians abroad – which is damned unfair to us. Another explanation is that being the highest paid unit here jealousy by the French, but more by the Tommies is going to be stopped by reducing our pay to equal, or be more in proportion to them. Damn the Pommies anyhow, - it was their doing that our pay was reduced early in the campaign – from 5\/- to 2\/- a day while in Egypt.\n\nYesterday I was out in Marseille with Roach, Joe Rodgers and Alan Lewis – previously we’d arranged to go to the 5F pictures in the evening, but on starting out we’d cut this out on account of the 15.F cost. However the unexpected appearance of Parson Watson, alone, in shorts \n\nand\n a helmet, and the appearance of a stern street guide who’d take us there for 2F’s apiece divided us. – we knew Wilson wouldn’t come there so of two evils we chose the least. They weren’t bad though, and we had the satisfaction of seeing for 2F what the greater part of the camp had paid 5 for.\n\nAfter Notre Dame de Gard we had tea at 1.65 – most of the unit rolled up as usual – Roach and Rodgers disappeared in to the village and Alan and myself wandered round till 5.15. God alone knows how I managed it, but I arrived home with 3.60 francs – and 1.30 of that has to go to Bob for laundry and 1F to Jefferson.\n\nThis morning early I wrote a letter to the CO, something like this\n\nSir\n\nAnticipating yesterday the usual pay, I was in debt considerably to certain members of the unit – and in consideration of this, respectful application is made for payment of the remainder due – even should this necessitate the further reduction of following pay.\n\nUnexpectedness of the reduction is the only excuse I have to offer for this un-military like application. \n\nPte. F.M. Molony, 8087\n\n \"Nothin’ doin’\".\n\n- wether it will work or not remains to be seen. It ought to though – since Campbell got the full pay and he had been in clink for 14 days which if it hadn’t been cut down to 7 days would have left him there yesterday. Roach is in the same jam and Heaven alone knows how many more are in the same condition. \n\n\"Amen - Brother\" Cole was away \"for one --- hour\" this morning --- \"it’s a --- shame --- !\" and the water for tea, that should have been boiling at 12.55 was boiling at 1.40: the Messes roared – so did Colie. Three buckets each mess took down as usual at 12.45 and at about 1.20 each mess took away an empty. - at 1.30 another so only leaving one to be filled – the chaps naturally wouldn’t wait - but they left Colie their regards. Frank Hungerford was the last to take away an empty bucket and Cole saw him: it was the last straw. The Messes roaring, he losing his block, and then burning his finger made him tearful.\n\n\"Brother it breaks my --- heart – to see you taking that bucket away.\" !\n\n‘Well Coli it’s no use leaving it because all the mess have gone: said a rank.\n\n\"I know brother.\" (tearfully), - \"and that’s what breaks my heart.\" (masterly) \"its my fault, I know, but (tragically and with genuine feeling at being able to shoulder the blame onto other peoples shoulders) \"it’s ---- hard lines if a poor --- can’t get away for one --- hour without the --- letting the fire go out.\" and then masterly again. \" --- I suppose there’s only one thing to do, and that’s I’ll have never to go out!\"\n\n\"Amen – brother Cole’s heart breaking was like the Kaiser’s \"tears\" for Louvain.\n\nN.B. I should have written \"’eart\" not heart – thank the Lord he doesn’t come from \" our ‘arbour city\".\n\n \n","2":"\n\nBrother Cole was very funny one day on the Braemar Castle: he’d been \"Gawd stoning me\" with Sedj. when somehow or other he started off to an audience on the infinite superiority of the discipline in the English Army. (Cole’s been in several Armies so he’s the \"Man who Knows\") also on the various venereal diseases. – a S.A. parade that morning was the explanation of the last subject – always a strong one with us. Coli told several yarns all more or less possible but improbable, when he got onto the subject of smartness in carrying out of orders and especially the inteligence of horses and animals with regard to Military commands. From thence he got onto India and the elephant.\n\n\"Why, brother,\" he said \" do you know that in India when the Elephants hear the bugle call, up go their trunks --\"\n\n\"Short Arm inspection?\" says Lewis.\n\nColi froze: not another word would he say. Try as we could. – Lewis is always damned funny but he had been surpassing himself at Colis’ expense. – not another word could we get from Coli. Poor Lewis was nearly in tears -- as were we -- but Coli was firm.\n","3":"\n\n Coli’s famous for several oaths and mannerisms. – he’s a lewd old man in first stages of senile decay. \"Tickled – to - death\" an invariable reply when you say. \"Good day brother! (Brother because its his own especial property --\n\n\"A-men Brother – Tickled to – death\".\n\n\"Gawd stone me: and \" Gawd bless me\" and \" xxxx even. He also sings a song – \"all soldiers never die\".\n\nAll soldiers never die – never die never die\n\nAll soldiers never die, they fade away.\n\nThe meaning’s obscure but supposed to be funny.\n\nA number of chaps seem to possess copyrighted oaths – Roach – \"For true\" or with more expression for special occasions (the rule) \" Too bloody true.\"\n\nHungerford’s and Martins by adoption – \"My Luck\" ! With George \"My Luck\" is like ‘Am Roses’, \"Golly!\"\n","4":"\n\nLast night I wondered how it was that Bill wasn’t out with Smithy – Smithy hadn’t evidently waited for Bill and had gone on to a football match. – hence the coldness. The row raised a humorously cynical devil in Bill while Smithy was something like the night he had the Moet and Chand. - \"Fair dinkum,’ Bill I \nam\n Giddy.’\" - and then the attack of malaria afterwards. Bill started by damning Home Rule because of the reports in yesterdays papers – and Smithy objected; Peach added fuel to the fire by siding with Bill - and Smithy became pathetically funny.\n\nAt \"Lights out\" Smithy chucked a boot at the candle and knocked it into Bill’s cap: five minutes later there was the smell of something burning. Smithy became anxious and Peachy irritable: Bills cap was burning: but Bill was comfortable under the blanket. \"xxxx it!\" says Bill. Put it out Bill, it’ll burn!\" anxiously from Smithy.\n\n\"Let it!\" says Bill.\n\nPeach and Smithy became doubly anxious and finally said Bill to complain – \"Its like ‘ome Rule and Ireland – I never started the xxxxxxx thing!\" Anyhow I’ll get a new cap. – and if it its only a little ‘ole, I wont, so I’m goin’ to be like the Q.M.!\"\n\n(There’d been a fire a couple of days ago in the store and X’s sponsors all veered in favour of condemning Q.M. – it was to cover shortages. It was hard times though that the fire was put out too soon.\n\nThis morning at Mess they tried to get Smithy going on Ireland, but it wasn’t any good.\n\nDamn the English, but its rotten having to try siding with Ireland – and the to have to side with Mick Rooney.\n","5":"\n\nLast night read St Ives, R.L. Stevenson. Read last paragraph of Chapter XII and – \"God save Ireland.!\"\n","6":"\n\nBefore the \"wash-out\" tent was put up, one night Nicholson for the purpose got from the dispensary a per-chloride of Mercury tablet – and somehow or other, whoever gave it to him forgot to tell him how to use it. - and he forgot to ask. He took it to his tent and asked the chap \"Snow\" what to do with it: Snow didn’t know and Nick wasn’t certain if it was to be used dissolved on a wash or taken internally: he decided on the last – and swallowed it. This was about 11.30 pm.\n\n\"You ---- fool!\" says Snow, \"do you know what you’ve done – you’ve swallowed poison!\" Nick made one long dive to the nearest doctor’s tent. Since then he’s supposed to have sworn off women – he’ll have his work cut out – if he goes many times to Marseille.\n\n8.\n\n6. a.m. – Reveille - \"Christians awake.\"\n\n6.15 - ¼ hour - \"Art Thou weary\"\n\n6.25 - 5 minutes - \"Hark! How Heaven is calling.\"\n\n7 – Breakfast - Meekly wait and Murmur not\n\n(especially when Coli takes \"one --- hour off!\"\n\n8 – Fatigue - \"Here we suffer grief and Pain\"\n\n1 pm - Dinner - \"Come ye thankful people come!\"\n\n2 – Parade - \"So Labour on\"\n\n4.30 – Dinner - \"Praise God from whom all blessings flow\"\n","7":" – Tea - \"What means this anxious eager throng\"\n\n9.15 - Last Post - \"All are safely gathered in\" ??\n\n9.30 - Lights out - Peace perfect Peace\n\n10.30 - Insp of Guard - \"Sleep on Beloved!\" ???\n\nPicket in the Wassah. – \"Abide with Me\" with \"Lead thou me on\" to follow.\n\nCol. catches you in your tent during inspection, \"Stand up stand up for Jesus\".\n\nLecture by \"Man who Knows.\" – about once a month on either \"Venereal Disease\" or Camp Hygiene or Flies and Latrines – \"Tell me the Old Old story\". Inspection by Gen. Howse - \"When he cometh\" – trouble is he never does.\n","8":"\n\nIn this morning’s orders –\n\n\"All NCOs and men leaving the camp on duty or leave must do so properly dressed: in future waist belts must be worn. \n\nSaid the W.O. in explanation and comment, so robbing the guards’ fair name of its maidenhood \"any man going through the gate will be sent back without his belt!\" !!!!!!!!!!!\n","9":"\n\nRoachie has been disillusioned; one evening he \"hooked\" a girl in the village who proved herself square: the next evening again she proved herself as Marguerite and Roachie began to laud her virtue over the camp: the third evening was exciting but after it he was more full than ever over having been the only man in the unit to meet a square girl. Last night she of herself offered to lie with him for 5 Francs: poor Jake: \"Lord what fools these mortals be.\"\n","10":" \n\nIf it’s a question of going to hell, go to hell like a gentleman with your ancestors.\n\nR.L.S. in \"St Ives\"\n","11":"\n\nA Translation of a yarn by Anatole France in the last Lone Hand reminded me of an incident at Ghezireh. A patient received a letter from his wife asking if he’d like any cigarettes: he wrote back yes - and received by return the lovely reply – ‘What kind?\"\n","12":" \n\nSmithy drunk – I beg his pardon \"giddy\", tackles Home Rule\". The last time I was with him in Cairo the last memory of the night after the Egyptian Café was pulling the gharry driver up several times to tell him: \"The moving finger writ etc., or some other appropriate words from man. I woke up the next morning in Q.M. store on pile of mattresses.\n\n14. April 30 1916\n\nLast night Smithy had another attack of \"Ge I am giddy Bill – fair dinkum!\"\n\n- Smithy’s never drunk – he’s only giddy. Bill and he arrived home at about 9. – I was in bed – Bill left us for a minute and the first thing Smithy sighted was my illumination. He says \"How many candles have you got Frank?\" then \"If you’ve got 3 Roach’ll have a child!\" I had 4.\n\nBill didn’t turn up for about an hour and Roach was at Aix so Smithy settled down to give me a detailed account of Home Rule., Johnny Redmond and the fact that \"I’m not a Catholic Frank – I’m a Protestant to the backbone – but I like to see fair play. Now I was Sir somebody’s sub agent. – do you know what a sub agent is. It’s a \"(detailed definition of a sub agent and a recommencement of Home Rule, Johnny Redmond and ‘I’m not a Catholic etc.). Then after about 40 minutes of this he was ready for bed and couldn’t get in – I had (at his request) to \"tuck him in\": I did, and a minute later he had rolled out.\n\nThen anxiously urgently – \"Frank! Frank! I’m out of bed, put me in!\" I did.\n\nThen he made me promise if he wanted to pis and got out of bed I’d bring him back or put his greatcoat on – he immediately gave me a detailed account how once Peach and Bill hadn’t done the – he’d got a chill and they’d taken him down to the hosp. – (that night I’d mounted guard over him and then carried him with Peach – he evidently forgot - it was only a few nights back.)\n\nThen he started to talk of a \"bonzer little girl \"in the village – \"like my own little kiddie at home. Bill says he’s goin’ to marry her: I am too …. oh, but I can’t cos I’m married in Aussy.\n\nDuring that hour I got such an intimate history of his family, ambition and friends – his diseases, politics, Religion that for a time interested him more than Home Rule.\n\nWhen Peach and Bill came in, Smithy assured us all that \" Bill, Bill I don’t want Peach to see me. Frank and me understand each other – Don’t we Frank. Frank’s a Catholic but I like to see fair play. I’m a Protestant to the backbone but when \"- I etc. etc. Peach started to argue Ulsterism and Smithy became dogmatic – the final flare was when Peach brought out the astounding news that Redmond had been arrested for high treason\".\n\nPoor Smithy was anxiously pathetic.\n\n\"I don’t believe it Peach. When I was on the platform with Johnny Redmond at ----- \" etc. etc.\" he said then that he had no sympathy with the \" – (he couldn’t make head or tail of the word so substituted \"Frank knows,\" he said they were anarchists.\n\nTwice more he fell out of bed and twenty times more asked Bill and myself to put his great coat on, finishing each time with \"but I’d rather piss the bed. Then he had a row with Bill, - wept – and went to sleep.\n\nBill this morning sums his troubles up with \"Poor bloody me! Smithy’s vague something like the \"Lion in the uniform but a very lamb in civilian\" in the Girl in the Taxi.\n\nSmithy brought home with him a bottle of Malaga – he’d been ordered it by the doctor he said. He confided to me this morning that he wasn’t going to take it as a drink but as a medicine, it’d help him.\n\nSmithy is Bill’s greater responsibility – and he considers Bill’s future as \nhis\n special responsibility. He informed me that at first he object to Bill being engaged to an RC girl but \"Id like to marry herself if I could\" now.\n\n15. \n\nTonight, Roachie had to meet the two girls he talked up a few evenings ago.\n\nAbout half a dozen of us were still at Mess when over the wall I saw his head and shoulders and heard him call out to me. He dropped back into the lane, and I went over to the wall. I’d just got to within about 6 feet when I heard Milford call out. \"Just behind you Frank – I can see it from here.\" I didn’t instantly dig to what he meant, but in turning about saw the Col. and Capt. Ross coming across between the mess and myself straight for the nailed up gate in the wall, just below me.\n\nI picked up a rock and chucked it into the lane just as Roachie got to the top of the wall again. He saw me, started \"Frank – when he saw what I meant by the rock I’d chucked. I think he’s running still. The Col. just got down to the gate, saw it was still nailed and walked on satisfied to the next.\n\n16. ","13":" \n\nLast night Watson (the late office man) had his first night of orderly work.\n\nThe first case, (and only one since wards are not yet filled) was a chap who’d been knocked down in Marseille by the YMCA car. He was brought to the Hosp. and given over to Watson’s care: he was drunk as a lord and semi unconscious. Shortly after he’d got him to bed, he had to give him a bottle, and as the latrines were too far off, he just took it outside the lines and sprinkled it about. The Doctor came in. \"Underling has the man urinated yet\". \"Yes sir\" says W. \"Ah! You kept it? \"Er – yes sir!\" \"Ah then take it down to the Pathologist dept. in the morning.\" \"Yes sir!\" says he. The patient didn’t use the little bottle again so W. had to get it filled by another patient – and he took that down. Luckily the knocked down chap was dismissed this morning late.\n\n17.\n\nJust as we were getting out the lunch things through the trees came one of the Indians hopelessly drunk. – followed by his poor devil of a dog. I sang out to him . \"Hullo Johnny, hows the world treating you.\" And Johnny came over to us.\n\nJohnny’d been to town, got drunk and had a row with a tommy picket: the pickets were evidently sorry.\n\nI’ve always known that the Indian had little liking for the Tommy, but didn’t know their definite attitude towards them – that is of course individually. Johnny called them \"bloody --- !\" and his fist came down onto the table hard enough to smash his bone to pieces.\n\n\"And what about the Australian, Johnny?\" says Stan.\n\n\"Australian – Bon\" tenderly and sentimentally, says Johnny.\n\nHe gave us an account of how he’d polished off \"two Captains, two lieutenants and a sarg.\"\n\nIt appears that Johnny was behind a machine gun up North, when a Capt. told him he wasn’t using his ammunition fast enough.\n\nSays Johnny to us \" me told him me new – me been soldier 7 years – and me know nothing about it – all right. Me piff, piff, and he gone. Another come up and ask where Capt. is, me say me no know me no see him for one day.\" Then he told us this.\n\n\"Me fight for England! German good soldier, Tommy bloody --- Me help England, Australia, Canada, Russi, India all fight for England – if they don’t, German he think English\n\ngirl very nice. You comprenez?\" and his expression told more than his words. He was drunk royally so, and he was lying perhaps but for all that I’m jolly glad the individual Indian doesn’t feel towards us the individual hatred he feels for the Tommy. Why it is I don’t know.\n\n18.\n\nRoachie picked this book up yesterday – I’d left it alongside others on the Mess table. He read the title page: Pte F H Molony. 8087 \"---- Ge Frank you’re one of the \"Fair dinkum\". It was the number that did it. Roach on the ideal Australia – and the living essence of a Bacchante strip his perfectly developed slim body, crown him with vine leaves, let him continue with his usual manner and he’s the Antique Bacchante. He’s a cheerful liar, a gambler and a Don Juan, a summer muse and God knows what. He’s the living incarnation of Sir Walter Raleigh. Really it was Roach who spread his cloak for the same Queen and he who wrote the English History.\n\n19. May 4 1916\n\nYesterday Roach, Stott, Jefferson and self went for a swim behind breakwater round to left going into Marseille. Costume – underpants and Roachie a handkerchief. Roachie lost his ‘costume’ after second dive and didn’t worry to find it again. We were fooling round & swimming about 10 yds. out. He’s leaning against wall of breakwater in water up to the knees, suddenly he looked up: two girls were with their French soldiers standing above laughing at him: Roachie laughed back: and stayed there. \"There’s no moral modesty about these people is there!\", he said.\n\n20.\n\nToday at 9 Chadwick , McClaner, Roach and Morris paraded before O.C. re cut down monies – we went on reports – or rather unofficial report that Base detail had been fully paid. The original idea was that we should all parade but red tape putrocities decided us against it. My application of few days back in waste paper basket with this \"informed by Sgt. Ramsford this morning. Roachie expects his tenner this morning – if he does get it I’ll borrow a quid from him and call again.\n\n21. \n\nWhile over at the P.O. for an \"active service\" envelope I saw a pile of papers for wounded. I got out of it a Bulletin – March 2 addressed \"A Lonely Soldier – as Bill’d say, \"Well I bloody well was!\" God damn the war, there’s an exhibition of Low’s cartoons in at Anthony Horderns and I won’t be able to see them, let alone get any of them.\n\n22. \n\nAfter lunch \"Tommy\" brought Scotty and self over a large plate of ‘cutlets’. They’re made of Bully beef, bread, vinegar, onion, pepper, mustard and potato, and they’re fried or baked. They’re absolutely delicious. Yesterday while he was sober this time he told us of his shooting the 2 Cols. & 2 Capts. and 1 Lieut, \"it is my caste,\" \"any man he insult me, well I kill him,\" says Tommy – and he told us the other day he was a Christian. \"Truth!\" Lucky he doesn’t dislike us, its quite evident though he’s taken an instant fancy to us. I think its because we wouldn’t let him bring his dog \"E-cri\" about while he was drunk.\n\n23. \n\nSwapped with Middleton, The Secret Woman for Merrick’s \"All the world wondered\", I reckon, features in one of yarns, he’s exquisite.\n\n24. \n\nBill and Smithy wanted to go out to-night but had to tour the camp with a magnet to get the necessary ‘jelcosse’. Peach wasn’t having any: says he, \"I’ll have to get the Bailiffs in, Bill, I can see that\". \"You can’t\" says Bill, \"we only owe you 16\/- - and you could get in on for less ‘en a pound.\" \"Then lend us 4 more says Smithy \"and bring ‘em in\".\n\nBill’s troubles are either of a ‘coppery’ nature or an amorous nature. When the mail came in he got about 10 letters from different girls. \"Ethel\" hadn’t written and Bill’s going to \"Bloody well shun her\", then meditatively, \"I can’t write to Milly nicely because she’ll tell Ethel and that’d be \"bloody awful\". Poor Bill doesn’t know what to do. \"It’ll be bloody awful when I get back to Sydney, won’t it Frank\", says he. I’ve promised to get him a copy of Jacob’s \"Master of Craft\" but his case is even worse than the master of craft. Poor Bill and Smithy’s frightened his wife’ll get hold of some of his letters to other girls. Altogether Mac’s night was almost as funny as Smith’s night of \"giddiness\".\n\n25. May 5\n\nJonas evidently had a bit of the dew in him tonight: while we were at mess he came over and started a series of nuisance criticism of those absent and present. \"Where’s Watkins lately!\" I think he must be contemplating an assassination!\" etc. etc. and that sort of thing.\n\nHe left us and visited the cookhouse. \"You know Coli, an Australian’s equal to 5 Englishmen\" started it. Poor Coli! A crowd collected and while Jonas unlovely damned all Tommies and lauded us, Coli straffed him and his contention.\n\nJonas’s prompt contention was this: \"In all English papers the English soldier is \"Tommy Atkins\" – he’s pictured as dropping his aitches and generally making himself cheap. No Australian paper would continually stress this and (to Jonas) the obvious conclusion is that the Tommy is a cad.\n\nPeter’s opinion of Jonas was expressed the other day – \"He’s a good fel-low, but pulls Chrise (Christ’s) leg!\" Talking in the tent to Bill tonight about Coli and Jonas, Bill laughed. \"Hell, I like to hear chaps bite. You could hear Coli’s teeth snap couldn’t you!\" I never bite myself (too true) an’ I think Wal’s (Smithy) taking a tumble to himself.\n\n26. May 7.\n\nA Library in a tin (labelled \"British made\" – altho’ a dried vegetable tin).\n\n1. \"The Sentimental Bloke\" – Dennis received yesterday by post – now ancient history in the camp.\n\n2. \"Apollo\" ordered first week in Marseille and received a few days ago, 9F.\n\n3. \"The Passionate Crime\", Temple Thurston in new continental edition, 2F.\n\n4. The Antagonist, Temple Thurston, and\n\n5. Richard Furlong, Temple Thurston both purchased from Cain Soldiers Cap just before leaving and read on Braemar Castle.\n\n6. \"Picture of Dorian Gray\", Wilde and\n\n7. Intentions – borrowed from Jonas and not yet returned.\n\n8. \"All the World Wondered\" Les Merrick swapped for \"Secret Woman\" of Phillpotts.\n\n9. Keats\n\n10. Browning\n\n11. \"St. Ives\", R.L.S.\n\n12. \"Tartarin of Tarascon\", Alphonse Daudet and\n","14":" \"The Master\", I. Zangwill used to prop up one corner of bed (?).\n\nA few days ago I started to collect from the Bulletin’s \"Red Page\" all reviews of Russian and continental fiction etc. and the drawings of N. Lindsay and Low.\n","15":" 19, A Thing of the Past.\n","16":" \n\nWith 3F. borrowed from Peach yesterday afternoon I went into Marseille to see Louis Raemaekers exhibition of war cartoons. 1.50F. was for a new glass to – they’re damned expensive to keep up on15F. fortnight.\n\nEntrance 1F., Catalogue 1F. I merely entered for 1F.\n\nThe Cartoons – colored prints signed Louis Raemaekers were arranged as a frieze level with the eye right round the room numbering 1 to 100. No note of explanation accompanied the drawings, but in very few cases was this necessary.\n\nAs cartoonist – especially of the war – I’ve always looked to Lindsay and Low of the Bulletin – Partridge of Punch, Carter and Walker of America, and isolated – Dyson – his Kultur Cartoons – and Sullivan – his Kaiser Garland. Raemaeker I first heard mentioned by a patient at Ghezireh and he lent me an article from the Times – if I remember rightly hailing him as the cartoonist of the war. The first cartoons of his I saw were a few in number of Land and Water – especially drawn for the paper, but then disappointed more than equalled anticipation. Then early in April last in Blanchards bookshop in Marseille I saw 6 numbers of a collection – published in Dutch – of his work: 6 amongst the collection were in colour – the remainder in black and white; these were certainly a revelation to me and only the price and the instruction to Angus to keep me a set of his stuff stopped me then buying.\n\nLindsay’s type – his pagan goddesses, his Muses - his women – such girls and larrikins are all of the same great mother: its almost impossible to misplace his work. Dyson the same – although one of Lindsays I thought for the moment was his. Low is as rigorous as either, but his style at times might be mistaken for either Lindsays or Dysons.\n\nMinns is merely trading under his name as a colorist: his cartoon drawings are poor. Raemaekers is in this exhibition the Raemaekers of 100 moods but all moods of varying degrees of hatred and contempt for Germany and her land: some are humorous, satirical, but the terrible and horror filled ones prevail. Of the last, one in particular arrests: against a bloody wall two murdered men lean in death: on the floor is a demented woman with all hell in her eyes kneeling and vacantly staring above the corpse of a young girl, dead, stabbed in the side. Another picturing madness is of two soldiers in hospital beds demented by agony of mind from - a hospital nurse who has broken down, and the doctor in the background.\n\nTwo in particular are intensely fine pieces of beautiful design and color work. One – a study in sea green of dead bodies sinking, and last breath bubble rising: evidently, inspired by the . The uses of his mediums are as varied as his styles of using them. One in particular particularly appealed to me: it was No. 3 and represented the figure of death – and the scythe moving down the men at war: the horizon in flame and the figure surprisingly unconscious of the horror of his doing. The piece had for a background as actual a piece of color work in soft rose-buff as I’ve ever seen and the drawing of the figure was perfect. The cartoon had all the beauty of an etching, a water color and a pen work in it.\n\nOne of the cartoons was used as a poster – Germany’s last tango – W to E and from E to W. It was the already famous cartoon of Germans tangoing with the figure of death. There as in the ‘Mower’ cartoon the drawing of Death was superb.\n\nFar and away above all others is Raemaeker the cartoonist of the war.\n\n28\n\nYesterday after the exhibition of Raemaekers, I walked up to the large Cathedral fronting the Rue Cannebire. The first time I was inside was one Wednesday evening with George and Arthur Fellows. Their service was on and a few of the Altar lights were burning: at night, with the candles burning the altar appeared very beautiful crowned with an enormous sunburst, but by day, when it is seen that the sunburst hides part of two splendid windows the beauty of the altar becomes a nothing to the beauty partly hidden by it. The aisle windows – each as it were recessed by the pier columns supporting the vaulting are very beautiful – and are made up of numerous small scenes: the intense colors of the glass – vivid autumnal tones – blue and red reminded me more of the early station masterpieces of the renaissance with their predominating glow of gold and hot flesh colours. The Clerestory windows are very high, above the gallery, are not so minutely beautiful as those of the aisles. These are I think more modern. The windows of the Apse are high and long, and consist of 3 distinct ‘stories’: the lower and higher two being very long and brilliantly leaded stained glass while the middle ones are short and seemingly unfinished. At the side altar the windows are of lovely stained glass of blues and greens suggesting the background of Da Vinci’s \"La Gioconda\".\n\n29 May 9 1916\n\nJ. - walking back to camp tonight – you know Frank, in confidence, I’d give anything to lose my young ways: when I try to be older in the wards, the sisters want to know whats the matter, or if I’m sick, and when I dose they ruffle my hair and pull my ears: it’s rotten. I wish I looked older.\n\n30 May 10\n\nA few weeks ago France welcomed the Russians – on Monday she welcomed the Australians, N. Zealanders and S. Africans. About 100 of this unit were represented. At 1 p.m. we left camp, marched behind the N. Zealanders from the Anzac Base, to the Prado Opera house and halted: next halt was the Coliseum fountain. Waiting at the fountain small tricolours were presented to each man – and hundreds of women distributed bunches of flowers: by the time we were ready to march off - we were just on the outskirts of the city proper – we were so decorated with flowers that it was almost impossible to find room for more – we did though later. \n\nMarching into the city the crowd were terrific.\n\nThe steep abrupt rising façade of the buildings, absolutely uniform in color and varying very slightly in architectural details stand balcony and windows full of people clapping frantically and laughing at everything, halts were every few yards: there seemed no traffic management and the people were pressing closely on to us leaving very little room. We were shaking hands all along till we felt like at a public feed. Flowers in hundreds were scattered from the balconies and windows, and not a few women and girls broke through our ranks with trays of sweets and cakes.\n\nFlags and flowers were everywhere. Our officers were almost all the way presented with enormous bouquets more fitting for a comic opera star on a first night: they got rid of a lot of them by pelting back at the crowds small sprays taken from the bunches.\n\nThe saluting base was firm. The Marseillaise sent the people mad and we were almost suffocated.\n\nThe whole route – and it embraced all the principle streets of the city were packed and the flowers were all along the way.\n\nAt the Station right on top of the hill we halted in front of a large French hospital: here a French bugle band was playing and the music of it was splendid.\n\nChampagne was the next order, and we consumed royally of it. France was the general toast and \"It’s a terrible war\".\n\nThe march back was jolly tiring and by the time we got back to Camp we were dead beat but happy. The break was a purple patch in a field of dead sand.\n\n31\n\nAt the fountain – where flags were being given out, Capt. Ross discovered he hadn’t one.\n\n\"For Christ’s sake let us get one\", says he, \"otherwise they’ll think I’m not patriotic\", and he made a dive through the crowd.\n\nThen outside left one of the four in front of me marching back had on his arm a jolly decent little French girl – who dragged a howling kiddy along with her. Poor kid – Stan was having the time of his life but for the kid?\n\nWe halted. The girl halted and the kiddie howled.\n\n\"Hallo Kid!\" says a beautifully dressed and square \nlooking\n woman on the pavement. \"You’ve got a very nice girly there eh?\" \"and is that yours too?\" she asks. Poor Stan! He hasn’t heard even the beginning of that yet.\n\n32 \n\nPeter was talking to me the other day about Russian writers: Trotski, Tolstoi, Turgenev and other names came up. He summed up Artzstashof in his queer English: it amounted to this, \"Artzstashof he like a painter who paints a mountain and some trees so it look like when you are way away from it what the mountain look like when you see it: he not like a painter who make the picture more beautiful than the mountain. He like the French painters who you see in windows here in Marseille.\" Realism undoubtedly doesn’t appeal to Peter – though Post realisms do.\n\n33 \n\nOn Monday morning so as to have money if we were dismissed in Marseille as we expected, I borrowed 5F. from Geoff. Not being dismissed but marched back to camp I didn’t break it. Bill was going out and was scouting out money so I offered to lend him a couple of Francs: he had one and he gave me that – leaving 4: 2 he was to return. Next morning he was going into town and I asked him to call in at Raemaekers exhibition and get me a catalogue. He called in and paid for one to be sent on. While he was in town and the night before the 5 note was too much for him and it vanished. Geoff asked me to come into town just before lunch and I said I would: got dressed and asked Bill for the 2F. Poor Bill, he never got such a shock in all his life, he hadn’t a cent. He went out and God knows where he got it but he came back with 5 more and he, Geoff and myself went into town. Geoff handed me 1F. more. Thank God somebody’s got some money.\n\n34 \n\nHeard from Adelaide the other day, writes she –\n\n\"The last time I saw Betty she and Hazel were arguing about your colors. Betty said it was Cadburys Chocolate and Hazel Nestles Chocolate.\"\n\n35 \n\nTony up at the Officers Mess comes out with some weird sayings. Today he wanted the barrow but didn’t know the English word for it. Tony comes from Egypt. \"Where’s that one wheeled gharry\" says he and again he wanted the saw, \"Where’s that\" – making motions of sawing \"scissors\".\n\n36 \n\nBill was at Skin St. on Monday night & had a ‘good time\" - short though – he only had my 5F. The girl gave him a typical photograph of herself elaborately posed as Venus (?). (I beg her pardon – Sappho!) Bill showed it to me today. \"I’m goin’ to paint this in a panel when I get ‘ome\" says Bill, then reminiscently - \"To remind me of the pose\", (\"pose\" rolled out neatly). Then he laughed, \"wonder what Eth’ll think of it\", silence for a while: then a laugh and \"Hell ain’t it funny!\"\n\n37 May 13, 1916\n\nYesterday I’d got so sick and fed up with Military that I got away from camp at 8 a.m. and with half a loaf of bread and a hunk of cheese and two Books – Browning and Apollo, made into the mountains behind the camp. Most of the day I spent on top of one of the minor hills sunbaking and sleeping and reading and then I made down the other side and through a small village where I had a bottle of Beer & got back by a roundabout lane way to the camp: had a bath and then tea. Mail of 6 letters, one containing £1 so Military sickness cured for a few days. On the way back I came through the Chateau grounds next to the camp and had a good look at the two ruined little buildings capping one of the hills. They are quite undoubtedly very old and quite possibly even 200 years ago built. One is a small dark vaulted chamber inside a huge Pyramid and the other is quite graceful little Roman summerhouse – domed ceiling and 4 Porticoes, with long flight of steps leading up and down the hill to it. This is in very rundown state and only one pediment supported by 4 columns remains. A long avenue of Poplars, some dead and very grave, one lead to the bottom and along the flight of steps from the Chateau itself to the little building.\n\n38 \n\nTo take out and re fill a tooth that it took Mr. Thorne about 50 minutes to do, it took our dentist about 5 today. Some doing eh?\n\n39 May 17, 1916\n\nSince Saturday I’ve received two registered letters each containing P.O. for £1. To cash the first tried Cooks, then the Marseille P.O. and then a money changing shop in Rue Cannibire. They put me on to Cox & Co., Bankers who were closed. On following Monday, cashed it just before going to Aix en Provence with Jefferson.\n\nThe trip to Aix was most delightful and of the three churches visited two were most fascinating: one especially the Cathedral: there is a strange mixture of Romanesque, Gothic and Renaissance work with a built in Temple of Apollo – used as the Baptistery. The main altar, and Apse, long windowed and richly decorated after a style strongly suggestive of Saraceni, with its low bath like altar and small ivory Christ on a rosewood crucifix, and \n\nthe two angels supporting rays of candles – not unlike Michaelangelo’s angel – was one of the most beautiful and lovely I’ve seen. Tapestries, two lovely triptyches and marvellously carved doorways, the old Romanesque cloister of the X1 century and the grotesque surrounded Christ all made up some of the charm of the history and romance suggesting building.\n\n40 \n\nToday looking at an old Lone Hand – Jan. 1909, saw notice of publication of book of Hugh McCrae verse illustrated by N. Lindsay – limited edition £1.1.0. Must try and get hold of this if procurable. Lone Hand publishers.\n\n41 \n\nYesterday at the breakwater where we used to go swimming an R.I.M.C. man was drowned. The body is now lying in the Mortuary with the body of an Australian who died on a trooper to-day just as she entered Marseille Harbour. On the R.I.M.C. chap’s body a P.M. was to have been held to-day but owing to non turning up of a French doctor – whose presence is necessary owing to his having met his death in French waters – it is to be held tomorrow.\n\n42 \n\nYesterday evening at shop in Marseille bought a book of Rheims, 20F. Left it there to be bound in leather similar to binding of Michael Angelo: to be ready in 10 days. Hope the packing for next move is delayed till I get it. On Monday the packing commenced and all rumours were confirmed: and notification yet as to ultimate position but generally taken as within 15 miles of Firing line. \"Hoo Bloody ray.\" \n\n43 ","17":"\n\nIn the Book of Michael Angelo I sent home this week – the statue of David is pictured as wearing a figleaf: in the Musee de Longchamps there is a collosal reproduction in marble without: which is correct. Is it likely that a reproduction for a Gallery here is going to dispense with an item of the original or is it that when the figures of the Last Judgement were treated with the impossible drapery so dear to the Moralist, his ‘David’ was similarly treated:?\n\nThe reproduction is a collosal piece of work and very wonderful: its size and beautiful modelling have made a very great impression on me, and strengthened my desire to see the original in Rome.\n\n44 \n\nLast night after the Musee de Longchamps I had tea at 1.65 and then met T. Sloan – late 5th Field Amb. We jarred two hours over dinner and then went out to the Coffee shop. Then met some of 1st Field and they passed Tommy on to us to take home. Tommy was drunk. Tommy it seems has taken a liking to me because I remind him of his girl – and then it turned out that this girl – an Irish girl in America came from Clare and her name Molony: It’s a hell of a large world this.\n\n45 \n\nYesterday and today whole transport loads of men – S. Africans, Australians, N. Zealanders and Tommies were emptied into our camp – just across the avenue: they’re in isolation: one of their chaps has developed Typhus. There will most likely be more, since sickness is bound to break out amongst them – that our moving may be considerably delayed.\n\n46 \n\nSays Milford, \"There’s only two classes of people – those in gaol and those who ought to be.\"\n\n47 ","18":"\n\nWhen people and things assume the effect of an Alan Odle portfolio – classically \"You’re drunk you --- you’re drunk\".\n\n48 \n\nIn town to-day with Milford, at ‘Moullots’ I saw a delightful little impressionistic study more of a colour effect than anything else. We priced it: 60F. How the hell I’m going to manage it – with 25F. for Rheim – already ordered and to be ready next week. I don’t know but if its reasonably possible to raise the necessary I’ll get it. Marcel Armand is the painter \n\n49 Moullot, 29 Rue Parades\n\nTwo more publications of cartoons today – \"Boches\" and \"Encore des Boches\" by Ricardo Flores. Before sending them home I’ll get Jonas – already official \"Prostitutes letter translater\" in the Corps to translate the headings.\n\nFrom just a casual glance through \"Le drapeau est un symbole\" in \"Boches\" is the most striking. The centre cartoon of \"Boches\" is good but the subject a very general one.\n\n50 ","19":"\n\nAt the Y.M.C.A. Anzac Deluxe Band were to give a concert. The hall was crowded at 7.30 and about 40 sisters were amongst the men. We had been given the tip by one of the sisters in the Chateau that when Major Jeffries took the chair he was to be counted out: we went down to see it.\n\nOn time the Band came in and then Major Jeffries took the chair: at least 113 of the audience, including the majority of the sisters got up and walked out: the Band started and played to half the house and an increasing line of stragglers.\n\nThe concert continued and the second item was announced by Jeffries. The chaps who’d gone outside were at the time round about the stack and at the windows, not making any noise to speak of – wondering what Jeffries would do: an occasional cry of \"Come on you Anzacs!\" was all they saw. She, Sister Leman then seemed to take matters in hand and more than ¾ emptied the hall.\n\nJeffries then did a very foolish thing: he came out and ordered the men to disperse: naturally they couldn’t and he went back, to come out again and order them back to their lines. Then the event of the evening took place. Sister Leman and some others chased him up and told him to his face just what she and the men thought of him: what she said I didn’t hear all, but quite enough to judge the rest: Jeffries and one of the Lieuts. then disappeared.\n\nJonas had meanwhile come out and standing in amongst us told Sgt. Rainsford and Martin what had happened. Jonas was excited and slightly exaggerated. We beyond that nothing. Suddenly one of Jeffries Lieutenants lays his hand on Jonas, \"Come with me Corp.\" and Jonas was placed under close arrest – taken half way down to the guard room and released – luckily as there was no charge against him and he’s one of the most generally popular men in the unit. Just as he came back realised already talk of smashing up the guard room and releasing him took place.\n\nWith Jeffries away the concert recommenced and the hall was packed: then he came back again, this time with one Lt. Martin was cheered but when the crowd\n\nsighted Jeffries behind him they counted him out and again made for the door – as before quite orderly.\n\nMartin then ordered us No. 2 back to their lines and with that for the evening the crowds closed.\n\nThe sisters’ grievance against the man was that he had insulted them and ordered them back to camp from the hill: it seems that he found several of them there entertaining a number of the patients to afternoon tea. The place was out of bounds to patients but not to any member of No. 2 and he ordered them all back and the guard to 21 days for allowing patients to pass. In this there was a lot for and a lot against but his way of dealing was most tasteless and they took it as offensive.\n\nThis morning the sisters and others paraded too the outcome not known yet.\n\n51 \n\nYesterday while we were away – duty (?) most of the chaps were re-vaccinated: since the big camp of contact has opened next to us this has been considered necessary – although we were only done about a year ago. I was done this morning.\n\n52 \n\nThese riots etc. are seemingly quite common though it is very rarely that they assume the proportions of late night affairs. Milford at breakfast to a selected audience gave an account of Ed Pleasant’s little trouble coming out from Aust. The Colombo affair there must have been something similar in its staging to last night. I’d give sixpence to be at Anzac detail today and see what happens.\n\n53 \n\nChadwick says – \"Heaven for polite society and Hell for good fellowship\".\n\n54 ","20":"\n\nAn official motto should be assumed by No. 2 A.G.H. – \"The bigger the loafer, the better the job\".\n\n55 \n\nLooking through \"Apollo\" today, I came across this,\n\n‘The establishment of the Papal Court at Avignon in 1309 had created a centre of Italian art in the city, round which a local school grew up: …. Froment of Avignon, the painter of \"The Burning Bush\" in the Cathedral of Aix worked at the court of Rene of Anjou (1417-1450) who established himself in Provence after losing Naples and Sicily.’\n\nThat Froment’s Triptych should have been considered worthy of inclusion in Remark’s Apollo after its effect upon myself, with my own knowledge of the old Masters is certainly promising. The Rene of Anjou referred to, I should say judging from a painting in the Musee Longchamps here is the personage portrayed in the left wing of the Triptych of which the \"Burning Bush\" is the centre. The features are slightly similar to those of Antonello Da Messina’s \"Portrait of a Man\", page 17, Apollo.\n\n56 ","21":"\n\nOn \"sisters fatigue\" O’Flarity and \"Ike\" Johnston walked almost arm in arm \"up the aisle\", \"Fall in Bridesmaids\" says Joe and we did – to our sorrow!\n\n57 \n\nPeter at Mess tonight superbly damned Royston. \"Who?\" said Peter, \"Your friend\" says Bill Speers, \"Oh! he wery nice fellow\", damn Peter.\n\n58 \n\nConversation on prostitutes, venereal disease and camp \"favourites\" being exhausted Mess tonight turned on Germany, Verdun and the end next centuary. They’ll go on fighting till there’s only three men and a dog left\", I said. \"Dere will be no dog\" says Peter, \"They eat them already: I tink!\"\n\n59 ","22":"\n\nBill’s applied for home (England) leave. Says Bill of the Col. – \"If ‘e grants it I’ll give him a bottle of Moet ….\n\n60 \n\nPay parade, half through, was riotously broken up: a rat v. about 150 men. The rat died. Says somebody, \"If it takes all the hospital to kill a rat how many will it take to kill a German?\"\n\n61 ","23":"\n\nFive days ago I applied for all day leave for yesterday and got it approved by Col: O’Flarity approved it on Tuesday after due deliberation, and after inquiring minutely as to the exact wording of application. Yesterday morning, leave for Arles and Avignon was turned down by the head office at Marseille – I didn’t turn up on 8 a.m. parade. O’F. got mad and when I did turn up – thought it advisable – he partly contradicted his signature, said I’d obtained it under false pretention. If it hadn’t been for the hideously funny state of affairs that we should be working under a man who couldn’t either read or write.\n\nHad leave from 11 till 9.30 p.m. Bought 3 copies of La Bainolte and one more of cartoons.\n\n62 \n\nToday started another rumour that one of the Aux. in Egypt is leaving","24":" of next month and on arrival will take over the place. We are to go north to prepare for big offensive and then winter in England. On Parade this morning all English leave turned down.\n\nToday I wrote to Editor of Poetry Review for copy of one of late numbers, sent P.O. for 3\/- - in hopes of getting more than one.\n\n63 \n\nCame home last night to tent blown anyhow and everything ½\" in dust and washed out before midnight. Terrific thunderstorm – evidently one that passed Paris last few days.\n\n64 \n\nSpent greater part of this afternoon skating on thin ice – Anatole France and Daudet – with Sister B.J. and then later after helping S- to fix her tent was told to clean out G. the – or she’d report me. Ye Gods!!!\n\n65 ","25":"\n\nTwo days ago I sent a registered letter to \"The Poetry Review\" and today I get the receipt for a letter sent to \"The Poultry Run\". Help!\n\n66 \n\nPeter was today asked has he killed off superfluous germs. \"I put ‘em in alcohol\", says Peter, \"and now they drunk, den I take ‘em out and hit em on the head wif a hammer\".\n\n67 \n\nThe Indian W.O. went into the Path. Dept. as Peter’s Assistant: Peter objected and fired him out. The W.O. wanted to inoculate the goat with Typhe Bacula and Peter objected. \"You can inoculate that ass\" – pointing to one of the Laundry Asses – \"on your own\" says Peter in a moment of inspiration.\n\nToday the Potatoes were particularly awful. \"Oh dere people in Ireland will Mutiny\" says Peter – and the argument lasted half an hour.\n\n68 ","26":"\n\nSince last entry I’ve been in Hospital with Acute Tonsilitis. G. O’Neil came down one day with parcel and registered letter: signing them he told a tale of S. P-ins. S. P-s wanted her mail badly. \"Is there anything for me Postman\". \"Yes Sister you’ll have to sign for it!\" \"Oh, I’ll sign anything. O’Neil wrote on a paper, \"I’ll meet you one dark night\" – handed it across and she promptly signed it – without reading.\n\n69 \n\nFrom \"Mirage\" by Temple Thurston. M. le Vicomte of the days of the ‘Ancien regime’. The people of France dare not look back now. It is all in front for them, or not at all. ","27":" Pub. Too true.\n\n70 June 13\n\nBefore I wrote this, in bed tonight after full days work in ward, read through \"John Millington Synge\" by Francis Bickley – Modern Biographies series of Constable. Seemingly from eulogy of Synge’s interpretation of Irish language and the short extracts from his plays Temple Thurston in his Passionate Crime has slavishly borrowed from him or has closely followed his lead.\n\nLater I must get hold of books by some of the following – especially the first Mangan, Savage, Aubrey de Vere, Katherine Tynan, Lionel Johnson.\n\nOn the 9th – when I wrote to England for Studies in Architecture – which as events are turning out I’ll have to send home, I wrote another letter ordering \"The Poetical Works of Lionel Johnson\" now first collected, etc. etc. Luckily I cancelled it.\n\nThere’s one though if tomorrow’s visit to Cox’s turns out trumps I’ll order at once, and that’s \"A Little book of Irish Verse\" edited by Albert C. White, 1\/- - the price – considering the name is \nvery\n satisfactory.\n\n71 June 15\n\nCox’s had received back from Cairo the three Money Orders I’d changed with them: I had to write a guarantee to Cairo P.O. that Cox’s had already payed to me the monies. Hope I’ve heard last of it, but on back of both the last returned is the significant not paid to Paymaster A.I.F. Anyhow I’ve had the money and that’s all that interests me.\n\n72 Yesterday in Marseille bought Ian Hay’s \"The First Hundred Thousand\" and ordered off Blanchard the second volume of Bairnsfather’s \"More Fragments from France\" and in the Temple Series, Hamlet, Antony and Cleopatra, Romeo and Juliet and Julius Caezar.\n\n73 \n\n1.\n\nDark Rosaleen – Mangan\n\nOh my Dark Rosaleen\n\nDo not sigh, do not weep!\n\nThe Priests are on the Ocean green.\n\nThey march along the deep.\n\nThere’s wine from the royal Pope,\n\nUpon the ocean green:\n\nAnd Spanish ale shall give you hope,\n\nMy Dark Rosaleen!\n\nMy own Rosaleen!\n\nShall glad your heart, shall give you hope,\n\nShall give you health, and help and hope,\n\nMy Dark Rosaleen! \n\n3.\n\nAll day long in unrest,\n\nTo and fro, do I move.\n\nThe very soul within my breast\n\nIs wasted for you, love!\n\nThe heart in my bosom faints\n\nTo think of you my queen\n\nMy life of life, my saint of saints,\n\nMy dark Rosaleen!\n\nMy own Rosaleen\n\nTo hear your sweet and sad complaints,\n\nMy life, my love, my saint of saints,\n\nMy Dark Rosaleen.\n\n4.\n\nWoe and pain, pain and woe,\n\nAre my lot night and noon,\n\nTo see your bright face clouded so\n\nLike to the mournful moon.\n\nBut yet will I rear your throne,\n\nAgain in golden sheen;\n\nTis you shall reign, shall reign alone,\n\nMy Dark Rosaleen\n\nMy own Rosaleen.\n\nTis you shall have the golden throne,\n\nTis you shall reign, and reign alone,\n\nMy Dark Rosaleen.\n","28":"\n\nOver dews, over sands,\n\nWill I fly for your weal:\n\nYour holy delicate white hands\n\nShall girdle me with steel.\n\nAt home in your emerald bowers,\n\nFrom mornings dawn till e’ev\n\nYou’ll pray for me, my flower of flowers\n\nMy Dark Rosaleen!\n\nMy Fond Rosaleen!\n\nYou’ll think of me through daylights hours\n\nMy virgin flower, my flower of flowers,\n\nMy Dark Rosaleen!\n","29":"\n\nI could scale the blue air,\n\nI could plough the high hills,\n\nO, I could kneel all night in prayer,\n\nTo heal your many ills!\n\nAnd one beamy smile from you\n\nWould float like light between\n\nMy toils and me, my own, my true,\n\nMy Dark Rosaleen!\n\nMy Fond Rosaleen!\n\nWould give me life and soul anew,\n\nA second life, a soul anew,\n\nMy Dark Rosaleen\n","30":"\n\nO! the Erne shall run red\n\nWith redundance of blood,\n\nThe earth shall rock beneath our tread,\n\nAnd flames wrap hill and wood,\n\nAnd gun-peal and slogan cry,\n\nWake many a glen serene\n\nEre you shall fade, ere you shall die,\n\nMy Dark Rosaleen!\n\nMy own Rosaleen!\n\nThe judgement hour must first be nigh,\n\nEre you can fade, ere you can die,\n\nMy Dark Rosaleen!\n\n74 ","31":"\n\n\"Macbeth\" in the camp.\n\nMaj. Of Anzac Details\n\n\"Those he commands, move only in command, nothing in love.\n\nEnd of the War\n\nCome what, come may, \n\nTime and the hour runs through the roughest day.\n\nReport of leaving Mosset \n\nAll is confirmed, my Lord which was reported\n\n(not \"all\" though)\n\nHeld up by Picket in Lane\n\n\"Our lack is nothing but our leave\".\n\n75 ","32":"\n\nThe night before last from about 8.30 till 11.30 p.m. we kept awake yarning about making money: now and then we were kids – selling manure by Jeff and snails self. Bill colouring photographs, and Gallipoli Bill selling papers. From this we went on to Burglar experiences – we’d all had them but Bill’s was counted out.\n\n76 \n\nTomorrow 40 sisters leave here for the North, rumour has it that half of us leave on Wednesday. Tonight my second night as night orderly since specialling Phillips at Ghezireh 1915. (?) Last night I was up most of the night with a pneumonia case in A lines.\n\n77 \n\nTonight I walked up the hill with Bill B. He’d just received a letter from home dated","33":" and shared it with self. Affairs between he and H. are very strained, and have been for some considerable time. H. has evidently been writing home about working 40 hours at a stretch without rest and other \"war news\" – giving Bill credit for totally ignoring his work. Also Bill had about the date of the sending of this letter called for a Tenner: \"Now my boy take care of your money – its very very hard to get\", etc. etc., and then the typical ruled warning against women. I’d be willing to take a bet that 90% of letters to chaps here from home contained the stark view – warning – very veiled certainly against \"women\" and pleadings to take care of money. \"Whatever do you want money for\" is the tenor of half the home letters.\n\nMoney talks – yes but the lack of it darn well stinks.\n\n78 \n\nLatest is that 50 of us have to stay here till God knows when. Jonas is included in the 50. Hope I’m not.\n\n79 ","34":"\n\nGoing on duty a couple of nights ago I read in the Day report book that \"Brown was frightened of Nobbs\". Brown’s been wounded 4 times and Nobbs laughs at him whenever he comes into the ward. Brown’s 6.4 and Nobbs about 5.4.\n\n80 ","35":"\n\nBoulogne, Wimereax,","36":" ‘16\n\nLeft Marseille midday Thursday last and arrived here Saturday 7 p.m.: and took over at once No. 5 Convalescent of the tommies. The night was very clear and the cliffs of England – \"Blighty\" – could easily be seen.\n\nUnloading train, loading and unloading steam lorries of hosp. equip. all morning and part of afternoon of July 2, and the remainder of afternoon re stacking bales of bedding and tents. 100 beds equipped and notice sent on to the Front line casualty stations.\n","37":" 3, equipping more wards and convoy expected at 6 p.m.: arrived at 9.40 and about 120 admitted – wounds redressed, washed and sent on midnight to enship at Boulogne for \"Blighty\". More convoys arrived early this morning and evacuation and more convoys have been going on till 4.30 p.m. Wards are rapidly becoming equipped and in surgical wards 90% of work done by us. Sisters owing to disbandment at Mosset not available. All cases stretcher.\n\nWhat’s your mate? Shrapnel leg – arm – back, etc., a high explosive bullet, shells, gassed, liquid fired etc. Some cases horrible, especially shrapnel – torn legs and backs. Stink of men horrible and septic wounds everywhere.\n\n81 \n\nBought today here self long promised Confessions of Opium Eater, and Contingent Ditties of F. Brown of the Canadians: will read when have time. Cashed £2 money order at Cox Co. here.\n\n82 \n\nThe Fine Art Society are publishing an edition de luxe of Raemaekers cartoons at £6.6.0: must get hold of this through Time Book Club. Will write when have time.\n\n83 \n\nYesterday Mr. fd.: asked me how I was, \"Pretty well, Thanks Mr. A.\": \"Have you been going out lately Frank\" – in tone suggesting inquiry into origin of sore throat.\n\n\"No\".\n\n\"Then you’ve been saving your money!\"\n\n\"Just what I haven’t been doing old chap\" (hurriedly).\n\n\"Can’t you lend us a couple then?\" Ye Gods!!!\n\nAnother way.\n\nMake a bet we’ll be finished the war in 6 months: someone takes it up at 5F. \"Then if you can bet 5F. lend us a couple – will you old chap?\"\n\n84 ","38":"\n\nSister Taranhan over talking to the German Prisoner – Patient\":\n\n\"You speak very good English\"!\n\n\"Yes Madam! But I must remember my German, for I may need it in Australia in 4 years.\" - and for such a studied insult the Tommy guard didn’t even bayonet him.\n\nSince coming into contact with these Boshes all my sympathy for the owners of the legs in the incinerator - filled with machine gun bullets from the big offensive - has gone. Materlinck I follow now.\n\n85 \n\nLast night thinking and anticipating the pleasure of an hour’s reading of Brooke’s \"Poems\" on the cliffs with Wilson, I had a sudden presentiment of sudden accident & falling over and being then buried in one of the horrible Military coffins.\n\nLast night a Tommy Capt. was drowned in front No. 15 General – almost in front of the green capped cliffs.\n\n86 \n\nComing back from Boulogne a few nights back, with Aleck we went into a strange E.F.C. for tea: on the walls was a full set of Relitte’s drawings – adds. for De Reske Cigarettes: after duly admiring them for us an atrocious Tommy – a London Cockney, confided the astonishing news that he (Relitte) was \" – the ‘ottest man in Lunnon, an’ so refined two!\"\n\n87 \n\nOne of our chaps in the convoy tonight arrived with a smashed shoulder – high explosive shells – \"I’d give the --- what did this a fiver if I found ‘im,\" he said.\n\n88 \n\nA Tommy operated on yesterday evening had half an iron shoe from a Tommy boot and two nails an inch long taken from his thigh: these odd scraps the Germans are using in shells.\n\n89 \n\nAll \"shop talk\" out of hours is now forbidden. Talk is taken from Wilde’s and Chesterton’s science book of epigrams and paradoxes.\n\n90 ","39":"\n\nThere is a vast difference between the Australian and the Tommy: we see this here all day, and in a hundred different ways. For instance: the last three or four days our chaps have been withdrawn from this front and sent down to Etarps for a rest prior to being sent on to another front: rumour has it about Verdun – a terrific compliment if it is a fact, since the French have so far been very careful to keep it entirely under their own men. Trains of our chaps then have been passing here very regularly: passing they make a hideously melodious din – coo-ees and whistling and ironical cheers. Tommy trains pass with a farcical cheer. This is not by any means to suggest that Tommy is downhearted, he isn’t, but he accepts things more as inevitable than the Australians, he suggests the healthy full blooded lazy animal – our chaps the full blooded Elizabethean, damning everything and ridiculing everything. Another instance where our chaps contrast with the Tommies is amongst the wounded going home: Tommy accept it, and seems mildly pleased and glad of the respite: the \"Dinkum\" bubbles over and wants to make a splash – and to publically announce his home going. Perhaps it’s a bumptious manner but it appeals in the quarters.\n\nAustralians motto, crest, or what you will should be – will be \"Maleish\".\n\n91\n\nLibrary at present:\n\nKeats, Browning, Brookes, \"Poems\", \"Contingent Ditties\" by F. Brown: \"Poems\" Mcarthy (in Georgian Verse series), De Quinceys \"Confessions of an Opium Eater\": \"Macbeth\": Poe’s Poetical Works and \"Traffic\" by Temple Thurston.\n\n92\n\nI wrote to The Times Book Club re the Fine Art Society’s edition of Raemaekers Cartoons and today received the reply that the publishers had fixed the price at £10.10.0. Will I get it?\n\n93 July 15\n\nToday Sister Leman reminded me of the \"But for God’s sake don’t call me Aly,\" Bulletin sketch. Capt May’s war passing: \"Oh Jack!\", she sang out \"Two, three more cases for you\".\n\n94\n\nReceived today best letter I’ve yet received from Geoff. He writes of Bronte’s \"Shirley\" – \"It is one of our best Books, and the farther we go, the madder it gets, something like Boyle’s law – Vol. & Pressure = Constant. Shirley = no. of pages = constant. Rather flattering!\n\n95 July 16\n\nSeven\n \"Six days in the week shalt thou labour and on the Seventh shalt thou work!\" – the new 4th Commandment.\n\n96\n\nYesterday afternoon coming from getting my washing, the QM passed me: I had a shirt and tie from the Rag store, a pair of slacks, and in my washing a greatcoat, and a cardigan. Today from there I get a new Tunic, and a Red Cross warm jacket. I have a bosker British man in view: the chaps in hosp.\n\n97 July 17\n\nJonas at breakfast this morning was full of a new suggestion. No. 2 ward to disband at the finish, but to form a new colony – Literary, Artistic and Agricultural. With our crowd – Ye Gods!!\n\n98 July 21\n\nHad leave this afternoon – first half day’s leave since last week in June. Since 3 a.m. this morning there has been a terrific bombardment going on round Armentieres: at about 5 one monster report shook the ground: all day the guns have been rumbling and still they are keeping to it.\n\nI had tea with Geoff in Boulogne: we called for Curacao and Lemonade: Curacao was out – then the manageress arrived with her English: she had Curacao – the white Curacao: it was far far better than the coloured. I said it wasn’t: she it was. I said, \"Well it’s we who have to drink it –\" she snapped in – \"and it’s I who have to sell it\": we had it.\n\n99\n\nI saw a South African’s Pay book today 1\/- per day pay, 6d deferred. Ye Gods and I’ve just 2.75F. and ten days ago I had 40F.\n\nWriter Leacock in his latest on his month’s screw –\n\n\"Each month I used to take it from the bank, look at it, and then divide it up as fairly as possible among those who were entitled to receive a share of it\"\n\n100 \"Maleish\"\n\nWrote tonight to The Times Book Club and ordered a copy put aside of Raemaekers.\n\n101 July 23\n\nSome subjects round here for sketches, etc., songs, etc.\n\na. A Train of Guns and Ammunition – Guns mounted on trucks without sides – long lines of them – the train ending in about 7-12 horse boxes, with the centre panel out – filled with troops.\n\n(b) Three black smocked old men, perhaps very young chaps helping pushing a quaint cart filled with 5-8 coffins – bare, dull affairs – passing as here through fields of poppies and green.\n\n(c) Sketch of stretcher cases being removed from Ambulance – or newly arrived convoy of walking cases.\n\nHundreds of subjects are here for the doing – but they require a Branguin or Raemaeker.\n\n102\n\nGod knows too many of our chaps have gone through us the last few days. Their Peninsula name they’ve more than kept up but at what a cost. Talking to them, their legs and arms sceptic and black, they’re cheerful and game and they tell of charge and capturing and holding lines of trenches despaired of months past by the tommies. When I see them and they go out again in a day after dressed, I hate with all my heart those Australians fit who are not out here: some day they’ll know their failure.\n\nA chap we were dressing today - his arm half shot away and his fore arm ripped and torn, one arm full of channel of draining tubes and black with mallow and badness, merely smokes hard: to avoid the scene and perhaps is merely hysterical but what it all stands for is not.\n\nAnd our damned chaplain don’t seem to do more than a casual saunter round him and sightsee. God alone knows what they’re drawing their pay for – to provide gloves and uniforms for perhaps.\n\n103\n\nHarry’s dying: as I write this even he may be even buried – and then I’ve lost the best friend I’d have had. When I said goodbye in Nelson Street shortly after going into comb. before he went to Coonamble perhaps he knew we’d not see one another again. So suited to each other, yet our tastes hardly the same, now we’ll never stay in Provence together. I’ve had one letter from him, and one from Adelaide – and now Mother writes that the doctor says its merely a matter of 4 or six weeks – and he’ll write when he feels stronger. \"Oh God let him get stronger\" – not to write but to live.\n\n104\n\nReading \"The Weekly Despatch – July 23\". I read in the World of Books column – \"Anatole France is writing a new ‘Island of the Penguins’ about Europe at War: He is expected, I am told to follow the example of Huysmans, the Parisian Belgian, and take minor orders in the Roman Catholic Church – The author of \"Penguin Island\", The Revolt of the Angels – a famous Artist – yet the obvious end of such a man.\n\n105 July 25\n\nFrom the Trenches.\n\nTommy Chaplain wanted to find the Australians and asked their whereabouts of some of his own clan,\n\n\"Well – you go roun’ that corner, and you’ll see chaps wearing wristlet watches and calling each other B—s. They’re them\"!\n\nAnother\n\nA Chaplain was \"easing the last hours of a dying dinkum. He’d almost finished the usual stock \"comfort\" – \"Then for Christ’s sake mate don’t make such a song about it\", he got. This was vouched for as absolutely true.\n\n106\n\nMore sayings – copyrighted by individuals, \"All the best people are doin’ it\". Harry, but not original as he was inspired by Pollock – who has several of the sort, \"Oo-la-la\", Ratcliffe – last la drawn out. \"Delighted Aggie!\" Harcourt’s best on the Braemar castle, his \"shew a leg – shew a leg\" was almost the incident of the voyage.\n\nContemporary gags are,\n\n\"Then can you tell\" and \"And very nice too\".\n\n107\n\nTwo more \"poetry friends\" – Harry Douling and George Martin. For reading now when much reading there’s no time for, Poetry is ideal. Besides easing the mind after the day, it is now I find more easy to read and certainly more enjoyed than prose. This month I’ve read Poe, Brooke, Mcarthneys Poems, Boothroyd’s \"Apes and Peacocks\", G.K.C’s Poems and Chitanjala – seemingly a lot but very little – all read in bed – and most of it after 9 p.m.\n\n108 July 28\n\nJove our chaps are great – and when they get here they are as irrepressible as ever – and although the change to here is as from Hell to Heaven, it \"was so bloody good\" – then a recollection \"but bloody murder!\" As to the end they’re as optimistic as the Tommies but give it a good 8 months – some of course say less. Tommy – changed to have given it anything from a couple of months to life.\n\n109\n\nBehind the first line of captured trenches at Pozieres, on a Deutsch workshop one of our Bomb throwers blew himself up with a souvenir. \"I told him\" said this chap in the Pack store with us this morning, \"Curiosity killed the cat – an’ it did\".\n\n110 July 30\n\nThis afternoon I had off and spent it lying half way down the cliff on a ledge reading Keats and Max Beerbohm’s \"Dandies and Dandies\". It was great.\n\nFor about half an hour I had heard dull reports out in the Channel, and so left off reading and watched.\n\nThe sea and sky where one colour dull grey and a mist was on the horizon. Dimly like shadows, through this mist I could see several tiny looking ships. Suddenly half way between these ships and the shore, a collossal water spout shot up, and a most collosal report was heard: a mine had been exploded. The echo reverberated round and round the horizon, seemingly trying to escape beyond it.\n\nThe whole explosion looked for all the world like a slow moving picture – or a picture in grey – a Whistleresque.\n\nFor Beerbohm’s book – The Works of Max Beerbohm, ordered a few weeks back I had to borrow from Young: for McGill’s \"Songs of the Dead End\" from Alek and Geoff supplied the necessary for \"Book Bills of Narcissus\". If I see a copy in Boulogne I like, I’ll borrow the money and buy it.\n\nSongs of The Dead End, and Max Beerbohm are dated Marseille, June, and April.\n\nLies, Lies all Lies, to quote Browning.\n\n111\n\nThe latest is that most of us are to be sent into Field Ambulance and into the combatment work. Hope they give us a day’s notice while I’ve a couple of Francs to send this accursed library home. It may be time, more likely it is that we are going to change places with one of the field ambulances that has had a bad time.\n\n112\n\nOn the 28 I received from Cox’s a letter – addressed Lieut. – asking for reimbursement of £1 – a Money Order on Cairo they cashed for me, and the Cairo P.O. returned to them marked \"Paid to Headquarters in Egypt\". I went into Cox’s in Boulogne the same afternoon, but they didn’t seem to see that they should write to Headquarters. I wrote to Marseille instructing them to write to Head, (I went to Headquarters – got the Col. to sign it) – and apply for the money. Why the Pay Officer hasn’t notified me or our Paymaster is more than I can see.\n\n113 July 31\n\nWith the end of the month, I come to what will be the end of my small diary: entering in it is no pleasure, and it is as barren and uninteresting as the Dead Sea. Episodes daily, there are in plenty, but not for entering there. Such a one was yesterday.\n\nAn old woman and her daughter, an old woman that fortune has so buffetted about and harassed, that her mind has become stagnant, at the expense of the British Government came over to see her son who was dying here, of a ghastly shell explosion, which had almost completely shot away his both buttocks. As she entered the grounds, the morgue doors were being closed; her son had died 10 minutes before.\n\nTonight a big convoy of our chaps has come in: while they have been enduring hell, I’ve been reading Max Beerbohm and Le Galliene. I at times am ashamed, but what prophets it not to read what best appeals, and curtains what has been seen all day, when something must be read would be ridiculous. Thank Heavens our work here is of a more vital nature, and we’re not a general.\n\n114\n\nTwo letters last night – one from Mother & one from Father – the first for three weeks.\n\n115\n\nThe till lately-kept diary resolves itself into this,\n\nJan 1. Spent in Hosp. at Abbassiah: till dinner I didn’t know it was N. Years day, but the sq. 1\" of pudding intimated it.\n\nJan. 13. Discharged from Hosp. and on Jan. 14 on Q17 staff in office at Ghezireh.\n\nJan. 16. Did the Pyramid of Cheops: second visit: Len’s brother and self paid 3 P.T. to go into the King’s chamber: Like a labour meeting: such a crowd: Tommies in galore, and sweating profusely.\n\n(Coming out I was particularly careful to quietly wipe away any sweat, I sweated – the Tommies did it so disgustingly. However nobody called me \"chum\" when we got out & so the vanity passed.\n\nJan. 19. Borrowed £1 from A.J. (On this evening A.J. and a party – impromptu supper in hut, decided on conclusion of war to get their discharges in Egypt and after doing England, do America. All of the party, who were so enthusiastic as to start mapping costs, are now parted. A.J. with the 2nd Base crowd – England, I suppose, Fred with 1st L.H. F.A. God knows where, and then to France. I told them at the time that \"Man proposes and the Military disposes\".\n\nJan. 20. Went out with Dick through Cairo, and bought a shirt. (Marvellous – and I’m wearing it now first time for a long while.) To proceed – That supper at Groppi’s – much better than Saults: only just realising this. Again, wonderful discovery.\n\nJan. 22. Climbed Pyramid of Cheops. That night we got back late, and getting dinner from the kitchen I met Sister M.L.R. Tales of a most amorous\n\nnature, and a promise of a moonlight trip to Sphinx – then I had in mind money I’d cabled for. Such was my damned luck that when I’d paid what I owed, I’d nothing left and we couldn’t do the trip under £1 so had to ‘pass’ it. The night of the dinner made up for it though.\n\nJan. 24. A most auspicious occasion. Out with Capt Beers to 2nd Base and Anglo Egypt Bank. Caught by rain, ripped back in the Ford, got a bit wet. Beers took us in and gave us a whiskey and soda each. Felt Better! and a nice fellow. ‘Now let your bloody cat in.\" This was the first dinkum whiskey and soda I’ve had – and the last. Vermouth or Curacao will do me every time.\n\nJan. 29. George came up from Warden. Went out with Dick for afternoon: started with intention of going to see Ron at Maadi. Got as far as Babaluk. Had afternoon tea there and drove back through the Mouski to St. James. Had been there, swapped drinks with 2 1 L.H. chaps and spent evening in El Dorado – Realised in Camera.\n\nEnd of January\n\n116 (210) (225)\n\nThis evening, moving some tarpaulin, under one was a lovely moth. Brown and white banded large wings, a body and head of pure vermilion, and under wings of vermilion with large blackish circles.\n\nWhat a scheme for interior decoration. Deep rich nut brown walls – smooth, woodwork of white, hearth tiling of gold, curtains of vermilion – pictures in Gilt frames. Brass Jacobean candlestick – coloured wood cuts and etchings and books behind glass in white case on white shelves. Till this afternoon olive green and had it. Now it is this. The brown for the walls would be the difficulty, getting the exact shade. I think sepia Indian ink, used as a distemper on ordinary pale paper already hung would be successful. Bought paper, ordinary Brown paper (wrapping) while some shades would be good I don’t think would be good. The usual brown rough heavy velvet colour brown is horrible, unoriginal.\n\nHearth tiles of canary yellow, Dutch make in squares about 3\" should strike a rather happy note. Altogether the suggestion from the moth is worth working out.\n\n117 ","40":"\n\nReceived today a Money Order £2 and forwarded it on to Controller, Money Order Dept. G.P.O. London for exchange of one on Boulogne. For Record – No. 8265 - £2 on Cairo Egypt.\n\nPosted at Military P.O. in Boulogne parcel of books, and bought Seaman’s new booklet of Verse, and his \"Borrowed Plumes\" also Leacock’s \"Moonbeams from the Larger Lunacy\".\n\n118 Aug. 8\n\nWith today’s lot of clothing from the fumigator, in one of the much muddied tunics, unharmed, was a small black canvassed covered pocket book. The first entries were barren and uninteresting: details of platoon, etc. and – more interesting – details of construction of hand grenades, bombs etc.: following a list of names of men in ‘No. 12’ Platoon, and then came the diary. From notes at the back, \"left Boulogne Jan. 8 – marched to Abbeville to Ally-le-Clocher Jan. 9 1916\" etc. and from difference in writing the diary was evidently written up during rests. It started, and with a right through for times.\n\n\"I enlisted on Oct. 3 1914 and underwent a course of training in Stockport, Parading at 9.0 a.m. for Drill on Wood Bank, and at 2 p.m. on Cab Green. This continued until Nov. 22 when we left Stockport at 3.0 a.m. for Northampton which place we arrived at 7 a.m. …. Even entering the trenches, rests, and a trip home on leave is the same.\n\n\"We left Bethune by train at 2.30 a.m. and arrived at Boulogne at 10.15, and caught the Boat at 10.45, arrived in Folkstone 1 p.m. and arrived London 4 p.m. (interesting if we have the same trip) – \"and left again at 6 p.m. and arrived home at 9.30 p.m. on May 3rd. On May 5 I went up to Barrow in Furness and returned to Stockport, on the 6th and left at 2.30 p.m. on","41":" and broke my journey at Tamworth, where I spent a few hours, and then proceeded to London arriving at 4.0 a.m. May 10, and left at 7.30 for Folkstone where we went into a rest camp and left for Boulogne at 4.15 p.m. arriving at 6 p.m. and marched up to Camp. ….\"\n","42":" a trip home is dismissed. The Diary finishes –\n\n…\"on","43":" our artillery commenced a bombardment which lasted from 12 noon till 4 p.m.: and it ceased, but Fritz continued for another half hour, and knocked a dug-out in wounding 3 men and while I was going to get them – (he was stretcher bearer to his Co.), got knocked off my feet with the concussion of a shell which put me out for about an hour leaving me afterwards such a bit of a fat head and on","44":" I was taken to the first aid post suffering with Trench fever having a temp. of 102.4° and I was then taken to the advance Dressing station and from there by Motor to the 134th F.A. at Annezin just outside Bethune arriving with a temp. of 103.6°. I left the F.A. and went to the Casualty Clearing Station at Chocques on the","45":" and left on the 24 for the base at 10 a.m. and arrived at Boulogne at 6 p.m. and was taken from the Hosp. Train into the Ambulance and was taken to the","46":" Australian General Hospital at Wimereax, arriving at 6.45 and got put back into bed again. The Nurses in the Hosp. are all from Australia & are very nice – (ask Haynett). Got marked up for Blighty and left the Hospital by motor at …\"\n\nThere the Diary ends – \"Then I left for Pisa\".\n\nThe diary is very barren, very bald, but merely from association not. It is a frightful example of how deeply the discipline of the Eng. Army has eaten into the soul of the chaps, everything detached as to time and place.\n\nAs a curio I’d like to keep it but in common decency I’ll have to send it over to the beggar.\n\n119\n\nAlthough often in the evening I \"sat at g-s feet\" listening to words of wisdom or his urbane delivery, here I haven’t seen much of him. A few evenings ago passing his tent, he called me, if I had Wilde’s \"Ballad of Reading Gaol\". I hadn’t: for about an hour though it started a yarn on his stuff generally, and his art in particular. B-tt kept out. Whether he’s a genuinely ordained minister or not I don’t know but I have my doubts. At any rate by the Corps he’s looked upon as a Minister…. I shouldn’t like to have to sit out one of his sermons, but he’s not a bad subject for writing up. At Liverpool he was Sgt. Q.17 in the V.C. On the transport A.17, by virtue of his late stripes he was in the Q.17 dept. At Ghezireh – Day duty – in his spare time. Bible banging more than anything else. I was in the tent with he and Parson Wilson – they on day work me on night.\n\nWhen these two would get in the tent together, B seemed to consider it his bounden duty to convert Jack (Pres.) to the Church of Eng. – me for a day from Rome to London, but I beat him on the Infallibility Question (which I know nothing about).\n\n\"Listen Jack, there’s an article here I want you to read\" I heard him say to Wilson one day. (I was outwardly asleep.) A grunt from Jack, then \"You chaps don’t understand us. You don’t understand the most vital part of our doctrines.\"\n\nGod in Heaven above knows the vital difference in doctrine between London and Edinburgh, I don’t. In Mosset he was one of the sisters fatigue party and here the only one of No. 2 staff on general duties, with the Tommy fatigue party from details. \n\nHe has a violent horror for decent editions of all sorts. Everyman or leather is lessening to him whilst cloth 1\/- editions in every form and even better than leather for a library. The ‘library’ I can imagine. At Ghezireh his one redeeming quality, but it didn’t last beyond Ghezireh – buying books or books of the Bible and different editions of the bible. I horrified him once: I asked him for the loan of the book of Job. I said \"that and \"The Picture of Dorian Grey\" are two perfect pieces of English.\" If I hadn’t been damned already, the state of his mind would have done it on the spot.\n\nIn his book on \"Aspects of the Irish Question\", Brooke writes of a certain class of narrow, bigoted selfish priest, crawling to their Bishop and totally ignorant of modern philosophy – of these is B-tt.\n\n120\n\nYarning with Jonas back awhile he said, You know Molony, its awful to think that we’re here talking literature while the chaps are in Hell up the line, isn’t it? But what else is there: our work can’t be more than done, and when it is, lately there’s been no finish, but when there is, a book of verse such as Boothroyd’s \"Apes and Peacocks\" or Beerbohm’s works in bed is more than a tonic: to forget for a while the horrible dressings of the day, the stream of chaps passing through us – and the whole deadening position, is absolute Heaven.\n\n121\n\nBarrie’s, \"The New Dramatist\" in The Queen’s Gift Book is very fine, like all his Comedy.\n\n122\n\nThe latest is that the Australians, all of them, are going to England for the Winter to reorganise. After Pozieres this will have to be done. If there’s a reorganisation here I’ll try again for a Field Ambulance or if I can work it and Gordon goes, a Field Dressing Station. So far I haven’t spoken to him but if it seems desirable to do so I’ll use a spider web pseudo relationship to work it.\n\n123 ","47":"\n\nA late tale has it that Headquarters asked General Birdwood if he thought his Australians could take Lille. \"Yes!\" said the General, \"Pay them £2 and put the place out of bounds!\"\n\nAnother, from the same chap, a very typical chap from Etaples, was a certain Battalion, after being disembled in a charge at Pozieres, were lined up near a dressing station. A stiff Brig. General, a Tommy, got up on his car to make them a speech: He couldn’t: he just got down, shook the nearest chap’s hand said, \"God! I wish I was an Australian.\" True or not, the spirit of it is, even the Tommies, and the Territorials admit it. \"They’re some style\" they say, \"an’\" Gor. Blimey they’re good to fight with.\n\nIn the pack store, if their Kit has been destroyed, and there’s nothing near there in the old Army stuff you’ve got and you go to give them Tommy stuff with, \"It’s only till you get over to England, old chap\": its \"Oh Christ give ‘us some’ old stuff, I don’t want that\".\n\nThey’ve said in the papers that the war will bring us closer into touch with England, rather it will have the effect of making us more Australian, more individual and more independent. I’d sooner be an Australian than a Pericles, a Michael Angelo, or a Corot. We’re \"Birdwood’s Australians.\"\n\n124\n\nOf all war poetry the finest I’ve seen is G.K.C.’s first verse of A Wife in Flanders.\n\nLow and brown barns thatched and repatched and tattered,\n\nWhere I had seven sons until today,\n\nA little hill of hay your spur has scattered …\n\nThis is not Paris. You have lost your way.\n\nfinishing\n\nUnhappy, can I give you back your honour?\n\nThough I forgave would any man forget?\n\nWhile all the great green land has trampled on her\n\nThe treason and terror of the night we met.\n\nNot any more in vengeance or in pardon\n\nAn old wife bargains for a bean that’s hers\n\nYou have no word to break: no heart to harden.\n\nRide on and prosper. You have lost your spurs.\n\n125\n\nGod preserve me from the intellectual woman. This afternoon – off duty, after changing towel at the linen store prior to having a hot shower, I made over to the half opened boxes of the old library, for something to read on the cliffs here. One of the sisters was there, and started doling out suggestions. \"This is not bad, but worded rot, you know\", and \"Not bad, but nothing in it\", and \"No depth, but you can read it for 5 minutes\".\n\nIf I ever marry may the high Gods provide me a woman who is womanly, who can bear children, sew and play Chopin. Her art can be a minus quantity and her literary appreciation capable of nothing higher than Rex Beech or Robert Chambers and her Poet – her High Poet, Ella Wheeler Wilcox – let her be womanly, healthy, and averagely sober and I’ll be happy.\n\n126\n\nJonas gave a reading of extract from Shakespeare in his tent the other night to a most select and limited audience. I must get hold of Julius Caezer in the Temple series – its well printed, and of handy size and good get up.\n\nWhen Asche was first in Sydney, I heard Julius Caezer in the Town Hall, staged by his company, he as Caezer, Lily Brayton as Portia – against a setting of draped black.\n\nWhat a lovely scene, and what English is that between Brutus and Portia in the orchard. What a woman.\n\nWhile Wilde’s \"Truth of Masks\" essay appeals right through as correct on the staging and presentation of Shakespeare, I really think, from a most casual reading of some of his tragedies, that these draped backgrounds, throwing by contrast the players into splendid light are particularly appropriate. By a colouring of these draperies, and selection of appropriate contrasts, for many scenes, this would be the finest and best setting for the stage.\n\nPurple tapestries for Macbeth’s Castle in Act 2. Dulled reds and brown maidens for Dunsinane.\n\n127\n\nFive minutes ago, in a most illuminating argument on the ultimate good out of war, during a side issue, Barnes came out with the astounding announcement that Phidias was a clerk in a London shipping office working out his destiny – (his reincarnation of course he meant). Another astounding pronouncement was that there is nothing evil – all is good or good in the making. More tomorrow of J.B.-s.\n\n127A ","48":"\n\nIn the tent I asked Jimmy if he knew what J.B.S. was in civilian life: \"Oh he’s a very clever man\" says Jimmy, \"high up he’s something in the Fire Engine affair,\" – \"there aren’t many like him in Sydney\" – which was very naïve.\n\nI first came into contact with him at the A.D.H. at Abbassia while we were \"billeted\" on them – not \"patient-ed\". He, and, his crowd – they’re quite usual, were discussing Wilde’s De Profundis, and for some reason or other J, in his loud voice said, \"I’d be willing to shake hands with Oscar Wilde tomorrow\". The very arrogance and impertinence of this – and having previously yarned with Harry, sent me into the tent to find out what the argument was. J. – only having read De Profundis, knowing the scandal of Wilde, judging him by his greatest work, had said what I’d heard. His manner and infernal presumption, made one argue with him. I asked him if he didn’t think it presumptuous on his part to judge in a moral manner a man from one of his books. No, he thought not, in fact his opinion was that by his works know ye a man – a most absurd statement, and especially in reference to Wilde. He didn’t evidently see my point because he went on to say that he wasn’t narrow, he was he said \"very unconventional and quite a bohemian – namely a most serious bohemian – \"Pericles is a clerk in a shipping office working out his destiny\". Verily we saw some funny people in the rank when we came out without our guns.\n\n128\n\nBartlett a few days ago remarked on being able by a man’s works to read a man’s mind. Byron’s book of \"Confessions\" – a collection published by Murray was this Book. He’s lent it to me – I’d asked for it otherwise he’d not have considered it fit. He said, \"You can read the man’s mind from it, and its not a great one. Anyhow he never did anything that will last the century through\". God in Heaven, the world’s greatest Poet after Shakespeare not do anything: Don Juan, the Dramas and Tragedies, Childe Harold, has lovely love lyrics – not do anything.\n\nThank heavens I didn’t shew him what I felt. Several things I have learnt of late: \"Never shew your true feelings\". \"Placing your opinion in a shop window is bad form\" and \"Mind your own bloody business\" – or you’ll be so told to, and \"Never sweat\" – this last is disgusting – one of the things I object to in the Tommy.\n\n129\n\nTwo days ago finished : I couldn’t sleep so I lighted up and read a yarn in The Queens Gift Book. The yarn, illustrated by Rackham, was The Soul Fairies: the first remark of Arabella’s cured me – she evidently felt as I do, sick of everything and everyone. Thank you Miss Beatrice Harraden. The Soul Fairies are charming people and I liked their company.\n\n130\n\nI haven’t read ‘Dorian Grey’ since April, and I badly needed some of it in an argument a while ago – the chapter on the ancestors of Dorian, and on the wonder of Renaissance crime, Chap. XI I think. I must get hold if possible from Boulogne a copy.\n\n131 A Req. from a loner -\n\nWill you please send the Corp. round to mend the lockers and also one black kitten for the Patients. \"Good Christ\" says Teddy, \"What the bloody hells this – send them round one of Peter’s guinea pigs\".\n\nThe Black Cat’s Kittens seem violently sought after.\n\n132\n\nFather and Geoff went to Harry’s funeral on","49":" A letter from Father last night read me this.\n\nAs far as it was possible for me to love anyone I loved Harry – his bookishness and his character. More he knew of me myself than any one else, and he was the only chap I’d have liked going through this lazy record with.\n\nAnd the last and only letter I’ve had from him, received while at Ghezireh, is typewritten.\n\nWho else is there: Const. Vin and Gerald. Vin at the lines above, Gerald drawing £2.10.- a week and not worrying on the war, and Const. still working, but not fit for service.\n\nI cannot realise that Harry is dead, else I should feel it more deeply than I do.\n\n133 ","50":"\n\nAfter we’d been working without talking for about an hour yesterday morning, Alek looks out: \"For God’s sake wish us many happy returns Frank, - It’s my birthday, and not a soul knows\"!\n\nWe had tea in Wimereax at the jolly little Café – a broken omelette – we watched it being made – almost made it in fact as we have at the same place made them on cream: with it we had hot rolls, Café au lait and jam: it was delicious, a Rhemy Brandy, then a walk along the beach and then back to Wimereax for some Champagne – back to camp and then we drank his health.\n\n134\n\nYesterday received from controller M.O. Dept. London notification that the order had been forwarded to Camp for a new one payable at Boulogne. Have to call at Cox’s now in Boulogne re last for £2.\n\nToday I returned to Jonas Wilde’s \"Intentions\" he lent me during the first march of Mosset.\n\n135\n\nThe remnants of a library – Poe’s Poems, Keats and Browning, Macbeth, Antony & Cleopatra, Moonbeams from the Larger Lunacy, Aspects of the Irish Question, Times book catalogue, Apollo, Made in England, and Bernard Plumes, Poems G.K.C., Beerbohm’s works. Merriden have had on order now about a fortnight, Verhaeren’s Plays, The Yellow Book, Vol. 1, The Holy War – verse of Katherine Tynan and when published McGill’s Soldier Songs. Also several collections of cartoons – which will have to wait till I get some spare cash.\n\n136\n\nLast night I got a letter from The Times Book Club notifying me they had put me aside a copy of the de luxe edition of Raemaeker. When we get leave to England I must call on them and enquire as to price of binding etc. and as to shipping rates. I’d like to get that 20F. collection of cartoons. \"Le Guerre des Artist\" I saw in Marseille and have it bound in buckram – the present paper covers are too light for its size.\n\n137 ","51":"\n\nI am becoming more and more like Tommy every day: ‘things’ more often than not are far more interesting and pleasurable than people. What sympathy for instance approaches that of a well designed lounge chair, large, roomy and cool, and a well written, well bound essay, verse & more, and a portfolio of etchings and drawings, of State Express 999 Cigarettes and – nothing else. I read \"Quinneys\" while in camp in Liverpool over 12 months ago: next order to Merriden will include the stage version.\n\n138\n\nIt seems with the Beer Canteen opposite, that a few of our chaps consider it essential that they should, on pay nights, get stone drunk. The horrible stuff they serve and the work they’ve got to do makes their beans beastly ridiculous. To get drunk on liquors, wine and shandies, in good company, is pardonable and amusing. A table outside the Egyptian Bar entering the Classic Wassah, hurriedly served drinks, and the wonderful crowd makes an atmosphere particularly appropriate for slow dull eyed drinking. The first time I met Ron and his friend in Cairo, God alone knows how we got home, but after leaving them, driving home to Ghezireh in the gharry I distinctly remember stopping him several times to tell him.\n\nThe Moving Finger writes, etc., and that I’d fled him down the Nights and down the days, etc. It was the first time I was blind drunk and the whole process I thoroughly enjoyed.\n\n139 ","52":"\n\nThings between the sisters and the chaps seem now to be rapidly approaching a head. For too long they’ve had entirely their own way, and been supported every time by the Col. The amusing part is that in half the wards the work they do is of no medical value at all, and all the surgical wards at any rate could be, \nand\n much better and easier worked without them.\n\nHaynet’s at last settled – harsh, and for gross neglect of duty she’s been suspended, and if there’s any general inquiry she won’t be the only one.\n\nOne funny change has come in. Sister – reported Milford for drinking the patient’s ale – she promptly reported him for continually drinking the patient’s soda water. What a life.\n\n140 ","53":"\n\nTonight I went into Jonas’s tent to ask him about this religious festival of tomorrow they’ve been mentioning in orders. I got the information I was after, and a yarn started: I asked Jonas what he’d thought of Thurston’s Traffic. The book seems now to have passed round the reading crowd and the opinions have been rather different but all agreeing that it was \"realistic\" (sometimes called \"jolly hot\"). While J. was about half way through it about a week ago, I’d asked him what he thought of it, and he’d replied, ‘A book for little dirty minds!’ Now after he’s finished the book, his criticism is the same as mine, well written, and thought out, splendid in the descriptive opening – like in a small way Hardy’s \"Egdon Heath\" – but spoilt by its ultra realism. Instead of being satisfied with calling a spade a spade, he calls it a bloody shovel. It was the problematic side of the book though that I’d wanted J’s opinion on – and in getting it, he paid me the most appreciated compliment I’ve ever received. According to J. nobody in the corps, with the exception of 1 – perhaps, myself, and he, could appreciate the subtle point of the problem – and as it happened, we both again accepted it in the same light, that Nance’s sacrifice, her degradation and her faithfulness, were her crucifixion, and her salvation. As a problem book it is a very distinct problem.\n\n141\n\nHalf way through the last the lights were switched off from Headquarters while the searchlights hunted zepps. Worse luck they didn’t catch any. The rays are worked like the cogs of two wheels running together.\n\n142\n\nTonight the first night ward work I’ve done since Monsart. I’m in ward C. D. – both unequipped, and with a rush of patients in from the convoy of 7.30.\n\n143\n\nThrough the lines, along the Services tents at night, is a striking sight. At intervals of every two lines a copper with a on fire, and the long slender chimney curling out clouds of black smoke – hurricane lamps alongside the lines, buckets, the light from the service tents, and the added occasional hurried flicker of a carried lamp and a great shade, the night itself moonlit but greatly clouded. The long perspective of the lines and the fire lights make it very effective.\n\n144\n\nWhat a tent is the second one, Cathedral Ron – so christened by J. Clerg. Bt., Bible banging H.T., the inimitable J’s, the rake Rd. and the gentle P.M.L. Bt. and H.T. in bed at 7 p.m. – and kept awake till 11. The gentle P. telling delicately filthy stories. His superb detachment from it all. Bt. drunken snores, J. reading aloud Julius Caezar and poor B. scandalised at the gentle P. but feeling decorously naughty and fearfully fast.\n\nWhat will my new day abode be like! The Reincarnation B., myself the second, & my esteemed friend L.O’N. – L. the most superb idiot – old enough to know better and spectacled. In half an hour he explained in Arabic English Australian to a bewildered Frenchman that he was the 900 son of Lord Kitchener, finishing up with the one understandable word \"Compris?\" The start certainly promises well: Mfd. would make a good fourth but as yet my views are not quite sufficiently under control.\n\n145\n\nThe time is 1.39 a.m., Sunday 20, and 25 more are expected before 2.\n\n\"Praise God from whom all blessings flow.\"\n\nAnyhow I’ve got that letter to Cass off my mind, but its not posted yet.\n\n146 ","54":"\n\nIn today’s casualty lists, Roy’s name appears, R.O. Middleton, Australian Engineers.\n\n147\n\nTonight – what a comedy: and Reeve takes it as seriously as the President of a society for the preservation of public morals. What a badly stage managed scene was it when we came back from supper. F—waiting: writing at the table: 10 minutes silence: enter a night sister, hurriedly \"Why haven’t you been down to supper Sister: C—she’d been away at supper (?) when we left – M. took our place. \"I’ve been waiting for Special\", \"She’s been back half an hour\". \"Well she might have told me\" – and exit the two.\n\nLord what fools these mortals be, poor H—y. Mart asked her if she was going to be married, and the sequel – R—s tackled M. What a roar and a roundabout confusion, something like a scene from \"Measure for Measure\".\n\n148 ","55":"\n\nAt midnight last night, and till 4 this morning lights were out from Headquarters – luckily during that time there wasn’t a convoy. At about 2 or a little later we could see the searchlights of Blighty and shortly after the reports of bombs etc. It lasted quite 30-40 minutes, and then after a rest of about 25 started again. Coy England still smiles sweetly and smoothes the crease of her pale lavender gloves. \"How horrid of them – really one of these days we’ll have, simply have to smack these nasty zeppelin faces – we’ll send an aeroplane over Berlin and let them drop letters, like nice little Wilson – we’ll shew them.\" God what bloody hyperbole the English are. Results – Nothing in comparison to some and sudden sighting of stray.\n\n149 ","56":"\n\nAccording to a letter received today from the Mater a book of Frank Coffey’s letters and papers has been published including my Ghezireh letter to Aunty.\n\n150\n\nIn a review on \"Carnival\" one of the Critics wrote – to the effect – that ‘Carnival’ was one of those books he’d keep aside for his shelf of \"possessions for keeps\".\n\nThe suggestion, a shelf for ‘exceptions’ is good: how would it work out. To please the eye only – and in these cases books capable of such arrangement – Tuppy’s manner of reviewing a ‘parcel of books’ in Streets delightful \"Autobiography of a Boy\" would satisfy.\n\nTo start, McKenzie’s splendid \"Sinister Street\" – the two present volumes split up into the 4 separate parts, and bound under the title of each respective part, wine coloured or sage green buckram, suggestions for bindings.\n\nStreet’s \"Autobiography of a Boy\".\n\nHeine’s \"Florentine Nights\" and \"Gods in Exile\".\n\n\"The Golden Ass\"\n\nPater’s \"Imaginary Portraits\" & \"The Renaissance\"\n\nRuskin’s Seven Lamps of Architecture.\n\nBrooke’s Poems.\n\nBarrie’s \"Half Hours\" – the delightful \"Pantaloon\"\n\nWorks of Max Beerbohm.\n\n\"Belgium’s Agony\", Verhaeren\n\nKeats and Browning. Two ‘Everyman Library’ books.\n\n\"The Picture of Dorian Gray\" and \"Intentions\" (?)\n\n\"Hyssop\", M.T.H. Sadler.\n\n\"Ordeal of Richard Feverel\", Meredith.\n\n\"The Green Carnation\", Hichens.\n\n\"The Passionate Crime\", Temple Thurston.\n\n\"Life’s Handicap\", Kipling and his ‘Ballads’.\n\n\"Gods and Wood Things\", Allen.\n\n\"The Buried Temple\" – or perhaps in its place \"The Blue Bird\".\n\n\"Greek Art and National Life\", Smith.\n\nFinishing say with Temple Press editions of \"The Book of Job\" and \"Proverbs\".\n\nWilde’s Comedies – Shaw and A.K.C., and other essays of Pater – Anatole France. Many others could be added, but the shelf is to be small and the collection exclusive. Julius Caezar and Macbeth and Antony and Cleopatra and the Sonnetts with Thring’s ‘Agamemnon’ say would finish the list – which makes 33 books for one shelf (?).\n\n151 ","57":"\n\nBy last night’s mail came the catalogues of Philip Lee Warner – The Riccardi Press publisher. What superb productions are these editions – The Canterbury Tales – Marius the Epicurean and all the others. £2.12.6 and £3.3.0, vellum. Jove what a sensation it will be to possess them ‘apres la guerre’. Shall I ever? and and Winder’s Florentine Press books. Swinburne’s ‘Songs Before Sunrise’ and \"The Little Flowers of St. Francis\". To hold them and possess them. To constantly flatter and soothe the sight: après la guerre.\n\nThe canvas back gold lettered so perfect, but the vellum covered edition, jove it pays every time.\n\nHodder & Stoughton’s two productions in this line – Kipling’s Collected Verse and Thompson’s Collected Verse are fine, type and get up all to be desired but the binding itself – the strength of it – seems below the Riccardi Press standard. To turn from a shelf of Riccardi and Florentine Press books to a shelf of John Lanes well produced books – ye Gods what a comparison. Then what is it to be: the many decently produced or the very few perfectly produced.\n\nMore of a folio cabinet than a bookcase. Designed in a Jacobean style, on high turned legs, and containing three shelves – plate glass leaded (?) or in small frames? leaded I think – and filled with these perfect books.\n\nOh Arnold Bennet of Literary Taste pause before this wondrous altar and tremble – and pass on.\n\n‘Apres la Guerre’.\n\n152 \n\nA Tommy crowd took over Monsart. The new Tommy M.O. entered the ward: \"It is a treat, Major, to have our own men again and not a beastly Australian\". \"Yes Sister?\" He went on working. In conversation, \"What school were you through Major, Guys?\" \"No sister\". Later, \"Edinburgh?\" \"No Sister!\" and as he was leaving, \"I’m from an Australian varsity Sister – Sydney!\"\n\n153\n","58":" rarely do we get our own chaps that let in 90 cases out of one hundred call up North Walks etc. Tonight the","59":" of the convoy I asked \"What are you men?\" and got the answer \"A b-r-st-rd from the Bush!\" No doubt that he was.\n\n154 ","60":"\n\nF. after long fishing got out of us the words of the classic \"après la guerre\". Spud came in: and of course wanted a repetition. \"Wherever did you get hold of that\". \"Ah, at the ‘Wass’ ‘Wimereax’\". What does F. know about the ‘Wassah’.\n\n155\n\nPay yesterday, and for the first time since landing in France I haven’t had to pay out my division to deservers – not that I’m clear o one Jeff £1 and Cox & Co. will shortly be suing for their £3. Maleish.\n\nYesterday night I got at Merridens The Book of Eve – drawings by Fish, who illustrated \"Beyond the Beyond\" of Leacock so typically, and ‘Jude the Obscure’ and \"The , also two books of 20 each caricaturing of German uniforms. In future I’ll dash most of spare cash to continuing my cartoon collection.\n\n156\n\nKing, according to the result of an argument today prefers to get at the beauty of a book by widely dissecting it on the operating table of ideas successfully past. Incidentally he holds that no-one but the artist (creator in all works, Printing, Art and Drama) can fully appreciate his creation. Authentic criterion to no art and art is for the creator only. King’s a Theosophist though, and agrees with Barnes.\n\nIn all these Theosophical ideas and books, such as one B. lent me Sayings of Pythagoras, it occurs to me they harp too much on certain points and ignore others. Why a chap worships Pythagoras Axioms when he has the Book of Proverbs is beyond me.\n\n157\n\nFourty stretcher cases in an hour’s time and ten patients dying: what a life.\n\n158 ","61":"\n\nThis morning, turning in, King was reading some new books on Astrology and Horoscopes he’d lately received from England. He told our fortune from year and date of birth, and then by palm reading. According to the horoscope reading, many things he told of were true – some very untrue: but taken all round, as I know myself quite a deal was rather surprising.\n\nFrom my hand he told less – and more. I have to die young: say at between 50 and 55. I have had one love affair that is passed, and shall have or am in the middle of another, which will end in marriage – and two children – boys. Have I had a love affair? That depends: with M…? That I have always – of late at least – regarded more as a platonic friendship, yet at times I have taken it seriously, and several things of late and earlier have made it look otherwise. Yet I think – as far as I am concerned that has been or is being dismissed.\n\n If this means V. - and it followed on shortly after.\n\nWho is to be the final? H … ? That as it stands, as I am concerned is happy, yet as regards H …? well there is nonsense and nothing to make me think it will develop for some considerable time, ‘apres la guerre’ – when I shall certainly develop it as well as I can. She is ideal and real. I have an appreciation of things of beauty, yet for sheer art little real ability. That \nwas\n rough. All my dreams of a paying hobby – drawings in a delicately suggestive Beardslean manner for the Lone Hand Cover and such paper as ‘Gypsy’ – yet this and what he said following – ‘You shall make success if you sufficiently work for it’. This seems notorious: at the Tec. I could work – that Wilkie a hundred times impressed upon me. Lindsay has said the same – and I have had to admit it. Yet my failing is that interest fags if the subject\n\nengaged upon gets wearisome. Shall I make a success of Architecture: yes, I think so – or I’ll have myself to blame, and no excuse. I have the openings and the ability. ‘You are worrying about something you are interested in, and it is dangerous!’ Jove yes. Books. They’re my curse and blessing. Yet they are in a great way connected with Architecture. The collection I have got together before 1916 shows that – and the foundation of the next collection – The Genius of , The Riccardi books, Raemaeker and the La Warne books on Paintings. Yet here I must limit myself and keep to main issues and abandon bywaters.\n\n159\n\nThe three most intense and splendid experiences I’ve realised since coming away have been, 1. The scenery, the wonderful Mosques of Cairo, two in particular – both exquisite examples of lovely architecture. (2) The seeing at the Musee de Longchamps, Marseille, a colossal reproduction of Michael Angelo’s David – and in a most unsuitable gallery. Jove what a sight must the original be, and (3) the lovely Cathedral at Aix, especially its beautiful altar.\n\n160\n\nA chap, an Australian amongst Tommies, died in the ward this morning after hanging on some time: he had an explosive bullet in his lungs. \"Thank God he’s finished\", says one of the Tommies, \"now we’ll get some rest!\" and the chap who said it nearly dies as soon as his leg bandages are removed. The poor devil was a jolly good patient and he was as game as could be.\n\n161 ","62":"\n\nHarry, some time before I went into camp, one night we were talking books in my room at home, when the name Maeterlinck came up said, \"I’ve been reading his Mary Magdalene, Frank, and it’s wonderful, simply exquisite. I read it last month and remembered him.\"\n\n162\n\nWhat a frightful situation Hardy makes of \"Jude the Obscure\". In Holbrook Jackson’s \"The Eighteen Nineties\" he mentions the reception of the book and following this period I’ve long intended to read it.\n\nThe terrible part about the whole conception is that it is quite in accordance with human nature. It is very powerful, and even treacherous.\n\n163\n\n‘What are you Mac’ an Australian or a Soldier?\n\n164\n\nWe started ‘skating on thin ice’ about 2 a.m. this morning, and the best was this scene: a country school class being examined:\n\n‘Now children what is the meaning of vermin,’\n\nNo answer.\n\n\"Come, come, children – what is it that gets on the hens and worries them?\"\n\n\"Please sir\" (the usual squeak) the rooster.\"\n\n165 ","63":"\n\nA chap on Wright was asked what he’d passed coming down on the train. He was a bad dysentery case. \"Some trains and ambulances, and houses, an’\" – and we stopped him. Another chap a few nights ago had a broken patella, and the doctor told him: a bit later, I’d seen the chap didn’t know what the doctor had said. I went down to him and asked him what was the matter. \"A broken propeller the doctor said – what’s that.\"\n\n166\n\nBy King’s Horoscope of Keith, he’s to marry unhappily twice, die of an incurable disease, have at least one lawsuit, be buried at sea, and after financial losses receive an unexpected purse – from public subscriptions.\n\nThe lawsuit will presumably follow his murder of one of his wives.\n\n167\n\nYesterday evening, in the hope that \"The Hound of Heaven\" and \"Tom\" would be in, I went into Boulogne for the express purpose of calling at Merridens and getting them. The only one in though was The Hound of Heaven, and as I’ve been feeling a bit ‘Jude the Obscure’ – sick o’night – its an exceptionally well written and imagined (?) book, but it gets very deadening. I got a copy of Borrow’s Lavengro – in Murrays 1\/- edition which makes one of the most cheaply got together books for the money I’ve seen. So far I’ve only read the first few chapters but the delightfully typical \"Church of England\" preface makes me feel I’ll enjoy the book. As far as I’ve got it’s very delightful and very easy reading – though I’m thinking his elusive habit of forever \"they ing\", and \"thee ing\" when he’s looking back at people and places may get a little tiresome.\n\nHowever interrupted reading o’night may eradicate the habit.\n\n168\n\nTwo of the sisters had had their photographs taken – jolly decently in Rouen. F. shewed them to Ma Gould when she came round one night.\n\n\"What do you think of these Miss Gould?\" ‘Miss’ Gould put down the paper she’d picked up and looked at them. \"Um … what were you doing on nights.\" Um … Chaste and holy\".\n\n169\n\nAs I stand now, as regards Military income, reckoning 1\/- deferred as paid, (or to be paid), I’m about £10 in hand – which I’ve already asked to be cabled to London Commonwealth Bank about 4 weeks back.\n\n170\n\n\"The soldier saints who row on row\n\nBurn upward each to his point of Bliss\" quoted in \"Jude the Obscure\".\n\n170 ","64":"\n\nIn today’s mail, killed in action, 2nd Lieut. E.L. Louther.\n\nPoor old Eric: he’ll no more \"rock hop\" at Bondi, or Fish at Pussy Cat. He was an awfully decent chap, with two enthusiasms, fishing and the Military. At Pussy Cast he was a weekend fixture – he there always reminded me of a Tuke painting – standing on a high rock away from the shore, wearing an old pair of white shorts, a slim muscular brown body against a brilliant sea.\n\nTonight I got a letter from the Mater, and her first sentence was ‘have just had a visit from Mr. Louther – George is at No. 3 A.H. in England wounded in the knees … Eric was only slightly wounded in the arm and didn’t leave the firing line … Cyril is going to enlist.’\n\nThe last I saw of Eric was the night he came down to say good-bye – just after I’d miserably failed to get into the","65":" F.A. under Roth with the Bondi chaps. That night he’d been given a holt revolver and he, Gerald and myself spent the night admiring it.\n\n\"So long, Eric!\"\n\n171 ","66":"\n\nThree days ago Hobbes died. Yesterday he was buried: and today his Father and Mother arrived from England to see him … and found a numbered grave.\n\n172\n\nTonight I finished … a few minutes ago \"Jude the Obscure\" – the most consummate tragedy written.\n\n\"We are made a spectacle unto the world, and to angels, and to men.\"\n\n173\n\nWhen was the \"Hound of Heaven\" written? Hardy in his title pages generally places a piece of distinctive verse: The Return of the Native from Keats \"Endymion\".\n\nTo Susan I bade good morn…. Jude the Obscure. \"The letter killeth\". From The Hound of Heaven they would suit \"Jude the Obscure\".\n\nI fled Him, down the nights and down the days,\n\nI fled Him, down the arches of the years ….\n\nFinishing at\n\n\"All things betray thee: who betrayest Me\".\n\n174 ","67":"\n\nNo convoy last night and none so far tonight.\n\nLast night I read in Lord Redesdale’s Tales of Old Japan, \"The Forty Seven Ronins\" and till tonight have been converting it into a Russian Ballet in three episodes. 1. The Palace of Kira Kozuke No Suke, (2) the house of Oishi Kuranosuke, and (3) back again at (1). Finishing the Ballet with the beheading of Kira Kozuke No Suke on the darkened stage, at the end of 3. – omitting the offering of the head at the Tomb of Takumi No Kami and the death of the 47. With a little easing and tying the history would make a brilliant Ballet and certainly the theme is sufficiently barbaric and heroic.\n\n175\n\nF-S. has gone off duty and a jolly decent little girl has taken her place – R.Ems. Tonight we had an hour’s talk on the Tommy – not to Tommy’s advantage. Her attitude after a stay in several hosps. in England matches mine.\n\nAustralia a Nation, is it a \nvery\n great dream? The Native of the Pacific, Lord of the Isles.\n\n176\n\nIt’s the","68":" now, and I wrote the above in my last year, 22 in France, 21 in Liverpool.\n\n177\n\nI wonder where Jimmy Houston, Fred Russell, Tillett, Ven Crichton and all the rest of the Ghizerah crowd are .. that joined up the 1st L.H. F.A. when I was out at Abbassiah that I missed through getting mumps – the Canal scrap and to have been out of this unit and to have lived with the L.H. chaps.\n\nJimmy went into Ghizerah one day and I nearly wept for joy at seeing him. Jove he looked a lambkin – a dusty ragged and horse worn. The very picture of happiness and bubbling over with life. I wonder if he’s alive – and Fred, Crichton and the rest.\n\nHow they fooled us around at the Palace – 60 men to go to the Peninsula in a week – volunteers and all over many . The idea cut out and only 40 to go 4 weeks later – getting to Cairo station and then being turned back. I wonder if I’ll finish in No. 2 A.G.H. or get into one of the Field or Clearing Stations.\n\n178\n\nYesterday morning speaking to a chap in the ward – an Ulsterman about my own age who was one of the Ulster volunteers, he reminded me of the Introduction to ‘Lavengro’. Poor old Catholics – and far more of a Catholic (though in my a ‘Pope’) than all the Catholics in the unit – with one exception.\n\n179\n\nCarlson and Coleman have been \"Recommended in Despatches\" I read. What for? A Corp., a Tommy before we took over this base was awarded the D.C.M. for designing and arranging the gardens, (what do they think of them now?) and a baker at Boulogne got the same for baking bread.\n\n180\n\nStill lists in Base Orders come out of men who have been and shot for \"desertion\" and \"shewing cowardice in front of the enemy\". What is cowardice? and who are the officers in charge to judge. He who is without sin amongst us, tell him cast the first stone, and judge not, lest ye be judged, how could any of these officers answer then? by hiding behind Great Britain’s superb work of her holy genius, The book of Army Regulations, and her papers have the bloody hypocrisy of writing up the archaicness of German law of the tutilary – and of admiringly rescuing such yellow rags in \"My Life in the German Army\" by one who knows and holding up their hands\n\nIn horror at the startling revelations. What of the Tommy who was a while back sentenced to 90 days","69":" F. Punish and who underwent it for \"exceeding the speed limit\" in the car he was driving.\n\nBritons never never will be slaves – and this, or the first of volunteers.\n\n181\n\nOur chaps some with Birdwood is that they’re tired of his congratulatory speeches, of his promise of \"being seasick in three weeks\" and of his not treating them fairly. Where our own uniforms he promised us? My old cap – third hand when I got it over a year ago, will be more like I get again an Aussy one. The Tommy one they gave me last month is good but I like our own better.\n\n182 ","70":"\n\n\"This day walking with W. Bliss\". Up early midday and started out with intention of getting to Hardenne. Got to the end of first tram terminus, and walked about: eventually walked right over one of hills and back to Boulogne. Tea – \"and so to duty\". Tonight’s mail brought parcel written of in Mother’s last – silk shorts and flannel shirts, six cigarettes, etc.\n\n183\n\nYesterday had dinner with Alf and then a half hour drinking champagne with an Australian and Scottie met there. Its nice how our chaps get on with the Scotties – better than with any other . Back to camp and mail in – letters wishing the usual – and arriving at the night time.\n\n184\n\nToday called in at Cox’s and paid them up. Now have 60F. odd \"which brings me to a most pleasurable feeling\".\n\nV.A.D. – \"Virgins awaiting Destruction\".\n\n185\n\nGetting up a few days ago King said to me, \"I’m going to give up reading for a while\", and that night took his usual books to the ward with him. I decided likewise and ended likewise. Today as I was getting up he asked if I was going into Boulogne, if I was would I rate such and such a book for him, then he changed his mind, deciding to finish what he had. Tonight traming back, I met him and he’d been in to Merridens and ordered another 40 Francs worth – making 90F. in books this month. \n\nKing is what you would call a Scientific Bookman – he goes in for sciences and anthropology etc. One thing he said a few days ago certainly wouldn’t apply here – \"And I can say this, what few people can say, and that is I’ve read all the books in my library\".\n\n186\n\nBilly’s sent me for birthday Norma Murdoch’s \"Songs of the Open Air\" a collection I’ve wanted a long time.\n\n187\n\nYesterday Allan got a letter from S. Martin and the report of Mac’s death was true. He was shot through the head, and died 2 months later: he was a stretcher bearer in the 13th Field one day and at Ghizerah nearly a year. He was one of the few chaps in the unit who read books.\n\n188 ","71":"\n\nTonight I was talking to Douglas – a patient – and he talking of Canada. I asked him in what line he was in. He said \"a chauffeur – a gentleman’s chauffeur\" and continuing an account of his workings, he shewed a total absence of any independence and a spirit of deep respect for the people he worked for – and he’d seemed so directly the opposite. His attitude is different to me.\n\n189\n\nToday send order of","72":" to Times Book Club for Symons \"Spiritual Adventures\" and France’s \"The Amethyst Ring\".\n\nSymons has lately published a new volume of plays – \"Tragedies\" that has been rather well received by the ‘Times Literary Supplement’.\n\n190\n\nOne of Nina Murdoch’s I dedicate to xxxx.\n\n\"So we who did not know her mystic power\n\nNor discerned yet of the subtle web she wove\n\nHad foolish vows we could not keep an hour\n\nTrembled and laughed and kissed – and called it love.\"\n\n191\n\nIn today’s ‘Daily Mail’\n\n‘For disparaging the British Army in a public house, a Canadian soldier named Southern, who said he had no recollection of the matter and urged his undoubted loyalty was at Portsmouth yesterday sentenced to one month’s imprisonment.\n\nIn one opinion expressed and otherwise, how long would we get in the land of \"freedom of speech, and liberty\".\n\n192 ","73":"\n\nToday’s the Mater’s birthday. Many, many birthdays – under better days. Tonight I received two letters from home, one from Father and one from Mother.\n\n193\n\nThousands of miles away we’ve discovered a lovely country. Coming away from it we have found it, Australia.\n\n194 Sep. 19\n\nCame in a few nights ago one, A Taylor, of the R. Berks. He’s down as 21, but 3½ yrs. service – he was, or is in the permanent R.B. Talking to him, he turns out to be far different to the average tommy. He’s dark, black hair, clean well formed features, slim and finely built. He enlisted when he was 15 – hence age is about 18½ - that I guessed from his manner. Life in the R.B. is evidently – for the recruit, something like a chapter from the \"Life in the German Army\".\n\nOne thing spoils him: horrible tattoo mark of Brittania on his chest and small design on his arm – the usual type.\n\n195\n\nBill of The Play\n\nGerman Empire Theatre of Varieties.\n\nProprietor, Herr William Kaiser. Tel. 2.L.\n\nManager, Herr William Kaiser, 2nd Tel. 2.L.2.\n\nTreaties not guaranteed.\n\nChildren in arms not respected.\n\nComing, Coming.\n\nFarewell visit before going to St. Helena.\n\nUltimatum Willie\n\nThe greatest comedian the world has known, in all his latest successes including:\n\n\"My hopes Argonne\"\n\nMy Arsne Kind dearie O!\"\n\n\"Oh, Lorraine again!\"\n\n\"Has any body here seen Calais!\"\n\n\"Alsace where art thou!\"\n\n\"Don’t be Hun happy!\"\n\nHerr Gullem\n\nAnd his celebrated company of Actors direct from the Wolf. Pross Berican: in a 1 act play entitled \"Al-lies\".\n\nCount Branchoff\n\nThe Diplomatic Dandy, in his world famous Repertoire including:\n\n\"Why I left Austria, Hungry\"\n\n\"Ta Ta Bel Grade\"\n\n\"We all love Sophia\"\n\n\"Servia right. Servia jolly well right\"\n\nBaron von Wholegg\n\nThe great Illusionist and Contortionist, in a marvellous exposition of the \"Scrap of Paper\" trick, supported by the renowned Count Ben Handy.\n\nThe Crown Prince and Lost Company\n\nIn the screaming farce, \"The Sham-Pan Shifters\", an episode in the Partechnicon of the German Army.\n\nEngaged at enormous expense,\n\nGeneral von Pluck\n\nFirst time out of Europe in the popular song, \"Come Tsing Taw me.\n\nCount Rast Felon\n\nOn a flying visit in the great absurdity,\n\n\"Can we sea-plains\" or \"Berlin on the Spree\".\n\nAdmiral von Tripit and Hopit\n\nand Company in the stirring Naval Drama,\n\n\"Der Tag (or The Luggage Latch ) in 4 Acts.\n\nAct 1: Headquarters German Navy at Wilhelmaban Von Tripit and his \"gallant\" men at their daily work \"Der Tag!\"\n\nAct 2: The same\n\nAct 3: The same again please\n\nAct 4: The North Sea June 1, 1916, \"Der Tag\".\n\nEnter Adm. Jellico, Exit German Fleet!\n\nTo conclude with the stomach stirring Cantata,\n\n\"Deutschland unter Allies\n\nJa Deutschland in der Songs\"\n\nby the entire company.\n\n\"Got Mit Huns\"\n\nAcknowledgement to correspondent in Kobe.\n\n196\n\nThere are a couple of Trooper Bluegum’s in the 6 Litt., \n\n\"The Aust. Light Horse\", Maadi, 1915\n\nWe’ve left out little geegees back in Maadi,\n\nWe’ve started out on foot to fight the foe:\n\nFor ‘gravel crushing’ makes us strong and hardy,\n\nAnd where we’re wanted, there the L.H. go.\n\nOur Infantry have made Australia famous:\n\nLight Horsemen now are out to do their share\n\nAnd surely not a single soul can blame us,\n\nFor bulling where there’s shrapnel in the air.\n\nWe couldn’t see our comrades far out numbered,\n\nWhile we in wicked Cairo lived in ease. (?)\n\nWe might do well have stayed back home and slumbered,\n","74":" we’re off to bring the Kaiser to his knees.\n\nIt was pretty rotten parting with our horses,\n\nThe horses we have learned to love so well:\n\nBut Birdwood wants us badly with the forces,\n","75":" we’re off to send the Sultan in to – Constantinople.\n\nPretty obvious jingle.\n\n196\n\nMy Dug-Out\n\nThere’s a hole cut in the hill\n\nThat’s my Dug-out:\n\nAnd somehow I fear no ill,\n\nIn my dug-out.\n\nWhen the cannons roar like thunder,\n\nParapets are sent asunder,\n\nI just duck, and snuggle under,\n\nIn my dug out.\n\nFor I’m safe both day and night\n\nIn my dug-out:\n\nThough I feel a troglodyte\n\nIn a dug-out.\n\nStill it pays you to take care\n\nWhen there’s murder in the air,\n\nFor its close to Sari Bair\n\nIn my dug-out.\n\nNow and then the bullets zip\n\nIn my dug-out:\n\nbut I never get the pip\n\nIn my dug-out:\n\nFor it soon becomes a habit\n\nJust to burrow like a rabbit.\n\nIf a sandbags near, I grab it\n\nFor my dug-out.\n\nStrange the Turks have never found\n\nMy little dug-out.\n\nFor they drop their shells all round\n\nThat little dug-out:\n\nBut some day they’ll score a hit,\n\nHigh explosive – I am in it,\n\nBut in that I guess I’ll flit,\n\nFrom my dug-out.\n\nThere’s a photo on the wall, (Kershore ? me!)\n\nof my dug-out.\n\nShe’s the sweetest girl of all,\n\nFor my dug-out.\n\nAnd when the scrap is over,\n\nWe’ll just settle down in clover,\n\nFor she wants the Khaki live,\n\nFrom a dug-out.\n\nBetter:-\n\nCapt. Blackall, \"Dug-out\" in \"Songs from the Trenches\".\n\n196\n\nL.H. Signallers, Anzac 1915\n\nThere’s a song for the Engineers –\n\n(Signallers mark you are engineers).\n\nFor running a wire to the firing line\n\nDigging a sap, or exploding a mine\n\nAny old job, wet weather or fine,\n\nSend for the Engineers.\n\nAlways on hand for the hardest work,\n\nEngineers never were known to shirk:\n\nMaking a road through mud or mire\n\nBuilding a bridge under withering fire.\n\nWith a blazing log for a funeral pyre,\n\nAnd a farewell laugh at the Turk.\n\nSending a wireless out to the fleet,\n\nFlashing the morse so pretty and neat.\n\nIt’s all in the game the signallers play,\n\nFor honour and glory and 6\/- a day.\n\nAnd now and then some of them get in the way\n\nOf shrapnel – the task to complete.\n\nSpare then a thought for the Engineers,\n\n(Signallers mark you are engineers),\n\nStuck in the trench with a phone at their ears,\n\nWhen the hours seem days, and the nights seem years,\n\nWhen cheering L. Horsemen, spare some of your cheers,\n\nFor our Signalling Engineers.\n\n197\n","76":" night, after the beginning of the big move on the Somme, we had over 500 chaps in and 90% out again the next morning for Blighty.\n\n198\n\nTalking to a couple of our chaps from the Somme tonight up the line, they say this is known as the \"Blighty Station\".\n\n199\n\nMany thanks dear Betty for \"Songs \nfrom\n of the Open Air\". The wattle has unbound her \ngolden\n yellow hair. \n\nMaking such golden mist upon the air ….\n\nBut could the shaggy wood-god wake,\n\nAgain to his Arcadian task\n\nOf piping, you would see the mask,\n\nThat I have smiling worn so long\n\nDrop at the prelude to his song.\n\nAnd we should speed through glade and make\n\nA Dryad you - a Satyr I.\n\n200\n\nLena Ashwell’s party were giving Barrie’s \"The Twelve Pound Look\" at Rouen before an audience of patients, etc., and came to the part where the wife tells the husband his good points. \"You’re amiable – cheerful – chatty\" and they cannot tell why the whole crowd let out one solid roar.\n\n201 Sep. 20\n\nNewman – till Jonas’s enthusiasm – was merely a name – and a book, \"The Mystery of Newman\". (I’d asked of the ‘Mystery’ – hence his enthusiasm.)\n\nMerriden got me a copy of his \"Church of the Fathers\": so far I’ve read a few chaps. It is the \"Church of the Fathers\" of my Father – last in myself. Though essentially appealing, it scuttles me in its minor points as practised by a certain class. Must get another copy and have it rebound in scarlet leather. ","77":"\n\n202\n\nTalking to Maj. a few days back on getting a transfer to one of our clearing stations, or to a line detail: he said that as regards the sort of work we’d been doing the last months or so it had been far more strenuous and vital than that of any other field unit. Yet even so I’d much rather be with all our chaps – Tommies are not like ourselves – and you’d meet there more of the chaps you know.\n\nIn today’s casualty list are several names of Sydney chaps I knew – A.D. Savage, Thompson, Watkins, and Nancarrow.\n\n203 ","78":"\n\nRaids hereabouts the 21 and 22. That of 22 made the sky to the N. of us very beautiful with hundreds of star shells. The searchlights all round were arched over us and both nights the alarm guns at Boulogne went off. Nothing further happened both raids. Calais seemingly was the spot aimed at.\n\n204\n\nTonight Bartlett informed me Smith – back from England, had a look of a Turk fellow. They were Franks: tonight I read part of them – and they’re rather good.\n\n205\n\nGoing off duty this morning I called at Jonas’s tent to ask him who or what the Arians were – I’d read of in \"The Church of the Fathers\". B. was in the tent. Said Jonas, the Arian was a religion opposed to Catholicism that arose in the 4th Cent. – it was – (added he for B’s benefit) a bigger heresy for the time, spreading all over Europe – than Protestantism of the present day.\n\nI’ve never seen a man look so shocked as B.\n\n206 Sep. 25, a.m.\n\nExcitement very intense this morning after early parade. \"Fall out those who consider themselves unfit to carry stretchers.\" Complete – the strongest line in the unit quite kept up his reputation – and stepped out. 5 minutes after parade the tale was that we were transferring with a F .Amb. and were going on to the Somme immediately.\n\nIn reality all it was was this. Chaps had been put on the stretcher party. Complaints – in a few cases that they couldn’t do the work – hence it and George Reed wanted to find out those unfit for certain.\n\n207 p.m.\n\nTonight for first time majority of convoy was C. Lance Australian 3, 4, 6, 24 Batts., 8 Battery F. Art. and Engineers represented.\n\n208\n\nBarrie’s \"The Little White Bird\" half read. Barrie is the most charming and delicate comedy writer I’ve come across. Anatole France is charming in his \"Honey Bee\", but keeps in place shreds of his superb irony: Barrie is always good natured and exquisite.\n\n209\n\n\"Library in a Biscuit Tin – \"Osborne\".\n\n\"The Little White Bird\", Barrie. Marcus Aurelius. \"Diary of Great War\", S. Pepys Jnr. \"Poems & Ballades\", Masefield. \"Tales of Old Japan\", Lord Redesdale. \"The First Hundred Thousand\", Ian Hay, \"Macbeth\", \"Shakespeare\", Masefield, \"Songs of the Open Air\", Nina Murdoch, \"The Church of the Fathers\", Newman. \"The Hound of Heaven\" & Omar Khayyam. \"The Holy Flower\", Rider Haggard. \"Lavengro\": Barrow \"End Book\".\n\n210\n\nThe eternal problem of original room decoration has cropped up again – of course only in theory. The last design – 116 – suggested by a butterfly is out of Jacobean: in its place come a scheme of gold and black – gold walls, black woodwork and shelving for books – with a frieze and low dado of about 12\" in depth of a rich and grotesque chinese paper: curtains of rich fading green, and coarse full carpeting, a large rug, of colours carrying out the scheme of the frieze.\n\nThe chief difficulty with these colourings, is that pictures must necessarily be restricted and those finally chosen of an expensive nature – reproductions of Durer – perhaps – and a couple fantastic etchings. Brass gods & Buddha, etc. and Jacobean candlesticks to finish.\n\n211 ","79":"\n\n\"There’s all the chaps round about our district, marrying like fun, and us poor buggers out here, doesn’t it make you sick\", says King, this morning turning in, reading some home local rag.\n\nFrom the home papers, conscription seems occurring and what with the 3rd Div. being broken up to reinforce the 1, 2, 4 and","80":" things look very conscriptionist. If the vote for was left entirely to us, and not allowed the hysterical \"slacker\" hustle, it would be absolutely ruled out.\n\n\"We don’t want the B—s!\", I’ve heard plenty of the chaps say – and that’s the attitude of practically all of us.\n\n212\n\nWorking now with Jake – a jolly welcome change from the last , Spry.\n\n213\n\nIn Boulogne today with King. First port of call – needless to write. Called back after 6 and got – just arrived – \"Thurlong the Hun\", H. Robinson to arrive later. Also got Sardia’s \"French Renaissance\".\n\n214\n\nOne of Chadwick’s last songs – that help a little to take away the cheap vaudeville role from our concerts is \"You’ll get Heaps of lickings for the things you never did\".\n\n215 ","81":"\n\nTonight in the Service Tent:- the full States, W.A. – The Cpl. \"?\", S.A. the inimitable Jake & the Ashe, V. Capt. Elliot – the new M.O. and one of those Australian officers that are helping our name as much as our Inf., and self, N.S.W.\n\nElliot was a bit doubtful if he’d sent the usual – more than the usual to Blighty. \"Poor beggars they get so far it’d be pretty rotten if they couldn’t get any further.\"\n\n216\n\nPiper had the hyde to assert that 70% of our original chaps were Imperials – that’s just what they weren’t. 20% of the orig. undesirables may have been. The percentage I’d like to know – too many Pommys with us have this contagiously funny idea.\n\n217\n\nA few weeks ago Sir Arthur Currie gave it pretty hot in some presidential address on the chief English characteristic of intellectual decadence and lack of interest in decent arts, and of lack of heart. Last Thursday’s Times Lit. supplement commented on this in its leader, but as Englishly usual get away from the point, and took the opportunity of again stating the Germans for what they could easily state themselves.\n\nThe same thing happens in Ireland in regard to their \"wait and see\" policy. Ireland they from time immemorial wait damnably, misgiven to add to their own petty end, and the the result. M. as regard an \"after the war\" policy, in regard to suppressing Germany commercially they will as sure as eggs adopt the same wondrous policy \"wait and see\". Already – though the losing power Germany has called together her leading manufacturing men and \ntherefore\n involving an Apres le Guerre policy – laughing at England.\n\nI’ve read a deal of the Englishman’s explanation of his misjudgement by Europeans: their same judgement is the correct judgment. England is all they have thought and realised. Cold. Self opinionated, hypocritical and intellectually barren.\n\nHail to thee (to use Barron) G.B. Shaw, put crackers under their tails, pour hot oil in their ears, and strip them naked and laugh at them. Then perforce, as they do, they’ll sickly smile and when you’re not looking put their trousers and skirts on again.\n\nHe’s written a satire entitled \"Haney V.C.\" – so says one of the papers and the playing of it has been forbidden. Does he know the D.S.O’s and D.C.M’s awarded to men baking bread in Boulogne, and making gardens around the Convalescent camps?\n\n218\n\nWhen we were yarning tales of various sorts came up. Jake mentioned the tale of the \"Baksheesh\" hand at Lonesome Pine. He told it as a tale, Bullite told the same. At Ghezireh I heard it differently. The hand had become unearthed, projecting through to the sap and being palm upward, the sign \"Get it Baksheesh\" was put over it: Result, and Cigarette ends the major contribution.\n\n219 ","82":"\n\nLast night had to take Brandy twice: just after first convey’d finished, my mind went blank for over an hour. The rottenest sensation I’d ever yet had.\n\n220\n\nJakes getting a transfer to 43 Bat. – to join up his two brothers. If he gets it I’ll get Gordon to work it for a Clearance or a F. Amb.\n\n221\n\nYesterday for about the","83":" serious time the book again somehow or other still survived. Time and again I’ve intended to destroy it. God alone knows what it is, its certainly not a diary, or day journal. After I’d kept it a few days, it was intended as a collection of happenings – such as 2, 3, 5, 10 etc. Anyhow a chap never writes what he thinks or thinks what he writes – it’s the worn mask that results.\n\n222\n\nTonight received from Commonwealth Bank £2 from the Pater – gloves for winter guaranteed anyhow, the rest’ll melt I suppose. \"Maleish\".\n\n223\n\nTonight discovered another Brooke lover – S. Val – uh. She’s dead nuts on him and pretty well knows him by heart. Her others well read are Browning, Keats and Rozetti . Must let her have Murdoch’s \"Songs of the Open Air\".\n\n224 ","84":"\n\nJake, modelled as clay, cast in Bronze, a hat tattered short and improvised sandals. Post uncertain, but any he’d carry well. Is it an ambition too great, or may it be fulfilled? It stands with the idea of theatrical design – but takes a front place.\n\n225\n\nA nice design for a room: walls of Ivory, drapes of plum heavy silks, Frieze of 1½ gold designed band, woodwork black. Etchings, a colour print or two and a Botticelli Birth of Venus in Gold – brass candlesticks, etc. V.210.\n\n226 Oct. 6\n\nYesterday afternoon – couldn’t sleep, so got up shortly after 2 p.m. parade. Bathed, had lunch at Wimereax and made up for the Military Cemetary on the hills: it’s a serenely quiet lonely and lovely wind and sun spot, with none of the coldness of the usual Burial place.\n\n\"After life fitful fine they sleep well\" but Brooke is infinitely greater.\n\n\"If I should die, think only this of me\n\nThat there’s a spot of foreign soil that is forever England.\"\n\nBlow Bugle Blow are your rich dead.\n\nThose buried there lived compleat lives and, sordid though their lives may have been, at least for a while lived to die greatly.\n\nAt a distance apart are about 20 Graves of German dead – one name amongst the whole – a German Capt. whose epitaph is R.I.P.\n\n227 \n\n\"The Prayer\" – Edgar Wallace\n\nOh God of Battles! Lord of Might,\n\nA sentry in the silent night,\n\nI ‘oo ‘ave never prayed,\n\nKneel on the dew damp sand to say\n\nO, see me through the comin’ day –\n\nBut please remember, though I pray,\n\nTat I am not afraid!\n\nOh God of Battles! Lord of Might!\n\n\"Ere in the dusky starry light,\n\nMy inner self I’ve weighed:\n\nAn’ I ‘ave seen my guilt an’ sin;\n\nI’m black as black can be within,\n\nBut though I would forgiveness win,\n\nIt ain’t ‘cos I’m afraid.\n\nOh God of Battles! Lord of Might,\n\nKeep me tomorrow in your sight –\n\nFor I ‘ave erred an’ strayed,\n\nI’ve flouted you with gibe an’ sneer\n\nAt ‘ome with chums to laugh an Cheer,\n\nBut now I am alone – out ‘ere!\n\nBut still I ain’t afraid!\n\nO God of Battles! Lord of Might!\n\nThe en’mys camp fires twinkle bright.\n\nTomorrow Lord, your aid:\n\nThe Canteen was my Sunday School,\n\nThe drill book was my Golden rule:\n\nWot are they now? O, ‘elpless fool!\n\nBut still, I’m not afraid!\n\nOh God of Battles! Lord of Might!\n\nThe price of every thoughtless slight\n\nTomorrow will be paid!\n\nA voice is whispering in my heart –\n\n\"Tomorrow soul and soldier part!\"\n\nBut I – I’m not afraid!\n\nOh God of Battles! Lord of Might!\n\n‘ere in the silence of the night,\n\nMy ‘umble prayer is prayed!\n\nAll life an’ death is one to you,\n\nIf I must die – O ‘elp me to!\n\nIn that last moment see me through\n\nMy God, I am afraid.\n\n228 Oct. 7\n\nTonight’s mail brought to light – travelling since Sep. 19 – Symon’s \"Spiritual Adventures\" from Times Book Club sale.\n\nThe book – subtitled \"Studies in Temperament\" seems something in the manner of Pater’s Imaginary Portrait, in the manner only, not the style. \"A Prelude to Life\", half read, suggests the soul will be MacKenzie’s \"Sinister St.\", and in a lesser degree Sadler’s \"Hyssop\".\n\n229\n\nTonight Keith and Carmody left – transfers to the 4th F. Amb. At the beginning of the week Mick for the 1st, and early last month, or the month before, George and Max for the 13th: Max caught his first day in the area, a bullet through his head, and died 2 minutes later. Jake put in for the 44 Batt. and I’ve put in for the 1 M.F.A., and now won’t be sorry if it hangs fire till after the winter.\n\n230\n\nKing, Jake and self at tea in the village tonight argued ‘Predestination’, J. and self beat K. but the beggar won’t admit it.\n\n231\n\nHenry Lawson bursts forth again in the Bulletin of Aug. 10 with ‘In Flanders’. It’s a topping little piece and just in the proper manner for the ‘Dinkum’ literary tastes.\n\nThe only fault with Lawson is that we don’t get enough of him out here.\n\n232 Oct. 9\n\nOn the spur of the moment decided on seeing Jimmy – to put in with him for the 1st F.A. More chance with 2 applying in same transfer than one, and with the winter coming on, its more likely they’ll be ready for a change. Its certainly not a good time to exchange, but its more than up to us after a year’s base – or nearly base – work.\n\n233\n\nTonight’s mail – reg. letter from Mother. We often read letters aloud to each other and says Jake – \"Its no wonder Frank the Australians have such guts – with their women at home!\"\n\nSister Weigall’s one of those ‘bosker’ women – a woman in its most lovely sense.\n\n234\n\nFinished reading Symons \"Prelude to Life\": well, its not bad reading, but what a waste in parts: with those qualities and temperament, the portrait is not true – the ten contradictions are too unreal.\n\nThe idea – ‘The Prelude to Life’ idea is good: what would the Life itself bring forth – such a prelude that ended – \"Then I enlisted – \"\n\nTo two chaps I’ve met since 1915 I owe more than I know – infinitely more than they could possibly dream of - even if they had the chance: Jimmy Thurston a Melb. chap in the 1st L.H.F.A., and to Jake, ‘The Prelude to Life’ – as a prelude through to death; well if the death were in the field I would be content: nowhere wonderful has the prelude been but nowhere wholly sad. Two years ago, had the Life then commenced, well it would not have been ever middling good: Egypt and France, Transport and Camp experience have brought to a normal point an almost exaggerated aesthetic and spiritual sense, even perhaps the ending of Pater’s ‘Denys l’Auxerrois’ may have been mine – may now even if I remain here, and the transfer does not eventuate. Such an obsession – an obsession that kills – as Denys, has been mine – an obsession that became less an obsession after enlistment and the Transport.\n\nTo Harry I owed much before 1915, and to Butchart in 1911. To Harry I owed the slight merging of the aesthetic and the spiritual, and to Butch, what I owe to a far great extent to Jake. J. and B. similar types, as different to self as Chinese and Italian design.\n\n235 Oct. 11\n\nLawson’s\n\n\"And I am very sad tonight,\n\nBecause of many things.\"\n\nAbout sums up tonight’s feelings. J. is a bloody fool, and so consciously so. Seeing through C. as he does and knowing him from previous experiences, he’s a fool to play with such dirty fire. Clear gambling – the only thing he’s capable of I don’t mind, but when he’ll gamble with such an utter … Anyhow I managed to stop it tonight with he holding somewhere about £5.7.6 so that’s one satisfaction.\n\n236\n\nHow far will M. go? but the exaggeratedly maternal (?) ground we’re on is in itself a barrier. Thank the Lord G-s gone: she reminds me of one of de Maupassant’s yarns – a girl in a barge of 7 or 8 men: her case is similar: half a day dangling, each of us in a turn – and then the sickly sentiment clouded over a most unsentimental happening. That’s where she differs from de Maupassant’s heroine: she’d have shrugged her shoulders, laughed, \"La via\" and forgotten in new loves.\n\n237\n\nBowled King into the tent this morning in a hellish mood: snarled silence till he gets into bed, then:- \"What’s the lowest type of civilised humanity known?\" I dropped to the cause: Jake didn’t, and gave out – \"The Aborigine!\" King – ex – \"No! the C.C. bloody Tommy!\" – ‘here’s an example – I gave a chap a cup of tea, told him what it was, and he asked me what he’d do with it.\" I told ‘im to bath in it.\"\n\n238\n\nSymons Tragedies. ‘The Death of Agrippina’. The inevitable subject – Nero’s murder of his Mother, continually through the whole of its one act, closely follows Macbeth – the schrieking hellish night of Macbeth’s murder of Duncan and this becomes in its way, the Feast of Athena – Agrippina.\n\nAh\n\nNow I hear voices and a song:\n\n\"Goddess of Mercy\", that is not her office,\n\nWhat are they singing.\n\nAcmonia\n\nIt is of Orestes,\n\nBecause Athena freed him from his guilt at Athens, when the furies followed him.\n\nAgrippina\n\nThey followed him because he killed his mother. Then could Athena free him from his guilt, who could not free remembrances? A wild song ….\n\nNero\n\nI will not let you go.\n\nThe moment the atmosphere became changed with the song of Orestes, Nero hesitates … and is kept to his object by Poppaea. Right to the murder Macbeth has mainly been well used. The play finishes well and is a fine little piece of tragic portrayal.\n\n239\n\nWrote tonight to Betty forwarding Jake’s sister’s challenge for an ‘Apres la Guerre’ swimming championship – at Moonta or Bondi, S. Aus. or N. South.\n\n240\n\nSent home copies of \"The Anzac Book\" (tonight in Boulogne for 3.50 now selling in London for £1.1.0). \"Belgian Art in Exile\", \"The Eve Book\" and \"The Hun Hunted\".\n\nThe Anzac Book’s coming out again this year, a revised edition, bound in cloth. 50 copies have been allowed this unit – was one of first to put in, hope I get it, price 5\/-. Later copies are to be issued to the public, but not till all ours are out and fixed up.\n\n241\n\nTo finish the page,\n\nIn \"Death of Agrippina\",\n\nWhy does the King stand looking after her as if he did not see her, and as if he could see nothing else?\n\n242 Oct. 12\n\nCleaned out the tent – not before it needed it before turning in – and for first time for some time kept awake yarning. Says King, \"Do you know Swinburne.\"\n\nTold him I didn’t, I intended to, and had a week ago ordered a copy of his Poems and Ballads – which I didn’t intend getting. I’m off books; do you know that since Jake’s been working and in the tent I’ve hardly read anything: besides I’m not game to send them home. I’ve already sent away far too many.\"\n\nKing started to laugh: \"neither am I. If the dad saw these\" – (4 lots of his Astrological and Horoscopocial books, and about 7 or 8 Theosophical works) – \"he’d wonder ‘what the hell he’s up to now’\" and the Mater says, \"Well, well, I did think my son was a Christian\", and the grandma weeps because I wasn’t a better lad.\n\nKing is casting V’s horoscope: it does seem taking a mean advantage of the girl, but she asked for it. Symbolical Poetry certainly is dangerous ground for midnight subject – and especially pieces of Brownings and Keats like the ‘Confessional’ ‘In a Balcony’, a light word and Keats passionate songs. It’d be as well to introduce as Keith did some of Burns epitaphs.\n\nThe only thing is that if it naturally works to a head I’ll drop her afterwards – which I certainly don’t want to do. She’s a jolly girl and her unsentimental manner would make her love more than I’d like to fool with. Jake’s affair with C-n is a different thing: and he’s of a different composition to myself, where he’d stick to her, and change her motives from merely a tent chase to perhaps an ordinary love. Perhaps not the last because she’s certainly shewn herself in far too a doubtful light, not morally or anything idiotic like that, but in a beastly manner light. Another thing she’s so self opinionated and yet lazy, it’d be perhaps too publick – that is she’d lose her head and boast. J. really is rather a catch in some lights. Anyhow V. comes on next week, and if this new offensive starting tonight continues on, we’ll all be too rushed to worry much about Passion poems – and Nina Murdoch’s ‘Songs’. Though if things don’t of themselves develop as they are tending well I’ll ‘eat my hat’.\n\nThis is the most inane stuff to write, but Jake’s in love and I’ll explode if I don’t get it off my chest – and he’s the only one that could understand it – and certainly V., but, I wonder if that’s her game. Ye Gods: we’ll \"wait and see\".\n\n243\n\nI wonder if V. has raised her stakes. \"Those who play with fire are the only ones who don’t get burnt\" – and believe it?\n\n244 Oct. 12, a.m.\n\nG.W. breaks into a minor \"Hymn of ‘Ate\" in \"Blighty\" – calling the atrocity \"The Surrey Boys\".\n\nEveryone speaks of the Anzacs,\n\nOf their wonderful brave doings long,\n\nBut does anyone hear of the Surrey boys?\n\nWho were up on Suvla Bay?\n\n(A damned unhappy reference – least said of the Surrey boys there the better!)\n\nTheir work was as good and dangerous\n\nTheir trials and conditions as hard:\n\nBut they have not been feted in London,\n\nOr cheered on the French boulevarde.\n\nNo! they are working damned hard out in Egypt (\"What again?\")\n\nFrom civilisation away;\n\nIn the farthest unsanitary quarters,\n\nWhere the Arab himself will not stay.\n\nBut Tommys the boy to be cheerful, (Naughty! Naughty)\n\nAnd work like a slave night and day,\n\nAnd put up with sauce for a tanner,\n\nNot sure how - \nthat’s\n Anzacs pay.\"\n\nIts certainly as hard on the poor beggars – but they’re not as far from home.\n\nTonight got back from Orderly room application for 1st Field: Col.’s approved of transfer if we can get \"two men of good character\" to exchange with: will forward the paper to O.C. 1st and see what that will bring forth. Those chaps who have lately come into the unit from the 1st all say there are plenty of their men who are ready for the exchange. Though it may be that when it came to the point of leaving their original unit they’d back out.\n\n246\n\nLena Ashwell Concert Party at Y.M.C.A. tonight. What we had time to see was topping and the singing, best I’ve heard for months.\n\n247\n\nToday 12 months ago said good bye to Mother behind the Pres. Tent at Liverpool. They – Mother, Betty and Father in the car motored up and wanted me to come home for the night, but only went in the car as far as the Pres. tent where said good bye a year today: it doesn’t seem six months and it seems six years. I wonder how many of us that came away in the old Port Lincoln we’ll see go back. If we were to rake together B.2 mess here for dinner, as they’d talked about (Jake and self are going out to Wimille with V., so I’ll be missing) they’d get on to Harry, Sedj., Owen, Tom, Dick, Jack – out of 14. B.1 mess they’d get none, B.5 ?\n\n248\n\nTonight came out Hughes manifesto to the Aust. Troops re compulsion.\n\nIf they’re going to keep up our 5 divisions, well they’ll have to get it, yet I don’t think the chaps in the line will vote yes, but they’d be a sight fairer to themselves if they did vote ‘yes’. Yes well for one thing means the more even distribution of casualties, and the keeping up to strength. It will be a close go though.\n\n249\n\nDinkum Oils, A.C. Parten \n\n1. The ‘Dinkum oils’ come pouring in,\n\nMorning, noon, and night,\n\nStartling news of every kind,\n\nAll about the fight.\n\nThere’s a sample of the kind\n\nBased on a batman’s whisper soft,\n\nThen Rumours on the go.\n\n2. Russians capture twenty towns,\n\nFive Thousand Tommies Killed,\n\nNo recruits are offering now,\n\n‘Cause their feet are chilled.\n\nNo more harness to be cleaned,\n\nLeave to Ireland stopped,\n\nNo more beer is sold to troops,\n\nDags cut and chopped.\n\n3. We are going home quite soon,\n\nThe fleet is sunk again.\n\nAustralians all for India,\n\nGerman troops in Spain.\n\nDarcy’s training men in camp,\n\nThe Japs have got conscription,\n\nOn Batteries with the M.M.P’s,\n\nSurpass all man’s description.\n\n4. Greece is climbing off the fence,\n\nSmuts taken German west,\n\nTurks are in the Wassah,\n\nAustrians most distressed.\n\nBilly Hughes has died of gas\n\nFrom Politicians’ speeches.\n\nChedley’s clothes are soon to be\n\nThe fashion on the beaches.\n","85":" Bush fires from Canberra out\n\nThe Murrumbidgee’s dry.\n\nThe wowsers have another win,\n\nTwo million beer wasps die.\n\nShackleton has met his fate,\n\nThe Bulgars fly on bikes,\n\nThe Kaiser runs a \"two-up\" school,\n\nDutchmen flood their dyke.\n","86":" The King is now in New South Wales,\n\nAnd says he’s going to stay.\n\nZepplins bomb a few more bales,\n\nYanks are making hay,\n\nAnd this goes on for ever\n\nAnd seldom is it true.\n\nBut I know for a cert,\n\nTomorrow we’ll have stew.\n\n250\n\nRead \"Esther Kahn\" in Symon’s ‘Spiritual Adventures’. A fine little ‘Imaginary Portrait’ and just how far true of many such cases.\n\n251 ","87":"\n\nThis afternoon Jake and self out with Val and had most enjoyable afternoon for a long while, out to Wimille – half way along to next village – pulled up by Tommy A.S.C. motor, motored to back of Napoleon’s monument Boulogne, through valley, back through Wimille, tea at Wimereax and back to camp at 7.40 p.m. She’s a jolly little girl, and we all enjoyed each other’s company.\n\n252\n\nGeneral congratulations of the six of us left from B.3 Mess. Jack left last week for Blighty – staff job.\n\n253 ","88":"\n\nJake leaves,","89":" on the list for Blighty: self about end of next month. Cabled tonight to Pater for £15. Evidently letter of July asking for same to be cabled to Commonwealth Bank against leave didn’t arrive home.\n\n254\n\nIt’s a case of \"if you know of a better ‘ole go to it\". We’ve engaged a room at some hotel in Wimereax for sleeping in during the day: it is a bit satorial but we’ll have no chance in the 43rd and 1 F.Amb. so we’re going to – \n\n\"Make the most of what we yet may spend\n\nBefore we too into the dust descend.\"\n\n255\n\nTonight heard from Bill in No. 14 stationary. He’s booked for Blighty next week, must try and see him before he goes.\n\n256 ","90":"\n\nI wish I could see the ending: if tomorrow fine it will come quickly. Last night she – for some coffee: tonight for some quinine: and both nights spent the time yarning with Jake and self. Tonight’s subject – practicality in Death Bed Triologue. If then on tomorrow we’re to meet her at the Y.M.C.A. and over Wimille way look for pancakes: the \"aged S. African\" is to accompany us – for Jake.\n\nPersonally I can’t see why she should on to me: Jake said, and is this to satisfy her as she almost asks. But then does she want to prostitute Browning to her own ends and excuse herself as temperamental lover? Intellectually she’s well up, yet she is ready to declare the best poetry to suit her own ends. But the question is, to what end is she playing?\n\n257\n\nTurning in this morning we discussed her, and her aims: and our conclusion simply predicted what happened tonight. Then she shewed when I went down to the stacks with her that to a big extent she’d lost all sense of the fitness of things. I’d prefer to be altogether out of it: yet to back away now would be – to her - worse than going on. Certainly she must have seen, and can now see that I don’t want to take advantage of her insane curiosity.\n\nJ-s anxious as to how I’ll tackle married life. \"How’ll you manage when you’ve \ngot\n to stick to one.\" God knows, I don’t. But if she can play Chopin and keep sober things may turn out better than they usually are. Where he can stick to one after a conversation, there I’d sicken of her and lose all desire to know her. That’s what I’m sorry about with V. It’s always been the way though, even towards books and pictures – certainly to a lesser extent, yet the feeling has in many cases been quite clearly defined.\n\n258\n\nComing down last night for our room, we ran into Col. Mack in the hall, and tonight Capt. Allen, once we meet Dick on the stairs it’ll be all up – then the best again. ‘Maleish’.\n\n259 ","91":"\n\nThree ways there seems as way out. The direct way seems the letter, and I’ve written it. Just exactly how she’ll take it, I can’t imagine, but its bound to hurt her. The other two ways – one the\n\nmost certain without a doubt, but may turn never ending in consequences. Jake – even offered to let me take his leave next week and to change his course, and the other I don’t care to let him risk it.\n\nI understand her exactly now, and have even a physical aversion for her. Almost the same subject we discussed turning in these last two mornings, she brought up and ran them to death, with Jake I enjoyed them, with her it revolted me – yet she almost echoed our earlier yarnings. Its horrible to have had her confidence to the extent I have this afternoon and then to seemingly hurriedly ‘finish’ it – yet it’s the only honorable way. If her love is genuine – as I’m certain it is, it’d be worse for her in a week and horrible in a month if things carried on as lately. When she originally dropped the hint that she enjoyed walking, and we asked her to come out to Wimille with us, I looked forward rather to a jolly time for the three of us – not an introduction to a minor tragedy.\n\nAfter last night we decided to get her two books. Jake, ‘Don Juan’ and self, \"Venus and Adonis\". If I loved the girl it would be different, if I gave in to her now, or at any time it’d be mortal suicide. The sooner the transfer comes through the better.\n\n260 Oct. 19\n\nBetty’s Birthday\n\nJake brings back tonight a note addressed, \"To Jake’s stable companion\" – a hit at our Hotel. ‘Dear Lord, Pax’. Pa with untold till \"perhaps some day when I’ll need your help and sympathy\".\n\nSo the ironical note I struck in my note yesterday wasn’t too strong, but the tone generally was more necessary than I’d thought. The reply is very charming – and slightly pathetic.\n\n261\n\nLetters from home, one from Mother, first for long while. Gerald’s been evidently turned down altogether. Yet if he can hold a commission in the Military, why doesn’t he train at Liverpool. Tom still in camp,","92":" – Oct. 1916!!!\n\n262\n\nJake, gone to Blighty for 10 days leave, and today finishes our week at the Hotel . Instead of a week it seems more like ages but it’ll be a change getting back to a rolled up bed life again. Getting away was funny, but tragic. I had in all the world 2.78 – and was jolly hungry. I’d asked Jake to tip the room girl, but evidently he hadn’t or had too well: anyhow at 6 she wanted to bring me water, at 6.10 chocolate, and at 6.20 a massage and shampoo. Someone rang for her and I bolted. God knows what I’ve left – but hope its nothing essential. As a ‘souvenir’ she has at least a book of Newbolt I’ve not read and a hair comb.\n\nReceived tonight from Sister Weigall the gloves I’d asked her to get – arrived two pairs of Dents leathers – wool lined and fur lined – and a soft wool muffler – both gloves and muffler just the thing, and jolly decent. 20 F. \n\nWrote to Harold New, will try him for a name for transfer to First Field. In at the little Café Wimereax tonight for tea – three Tommies came and fearlessly ordered omelette of six eggs. I’d a vision of Jake and a shot of our 12 egg omelette in front of me, in reality ‘ rolls ‘em’ ! Somehow the Tommies there seemed very out of place – even the most casual observer would admit No. 2 owned the place – and shared it with six Tommy chaplains – two of them jolly decent chaps.\n\n263\n\nLast letter from Mother mentioned Doreen’s appearing in but omitted her address. Jake dead keen to meet her, so gave him a Dinkum introduction – hope to Heaven she at least remembers my name.\n\nIf he does manage to find her, I’ll lay a wager he’ll get on jolly well with her.\n\n264\n\nWrote to Gerald last night. I haven’t heard from him for over ten months. If he has been absolutely turned down for all services and that says, its jolly hard on him, and can feel for him in every way. But why doesn’t he manage a staff job at Liverpool – evidently Len has.\n\n265 Oct. 23\n\nComes in tonight Evans as a patient, in the same case as self about the middle of last month. That horribly curiously awful sensation at the back of the head, as though the brain were working quite independently of the body – a sense of compleat detachment from realities ordinary, and an insane longing to in a manner startling and fantastick and all. After that can say in if it hadn’t been for the brandy C. gave me I’d have had to have gone out to it.\n\n266\n\nInspection extraordinary and unexpectedly – full kit and blankets. King, very worried going through his stuff getting it ready – \"Now lets see, what have I got that doesn’t belong to me.\"\n\n267\n\nTonight arrives notification that cable sent last week has been forwarded Oct. 21. Will write to Commonwealth Bank tonight.\n\n268\n\nToday through headquarters sent home three new issues of the \"Anzac Book\". Sent Jake’s also. Not till these copies have been in Australia a month is the issue to the Public to date – an issue in aid of some Military fund.\n\n269\n\nLast night had to run the two lines, Jake’s and own, both were almost empty after late evacuation, and I left them full this morning. Hill’s in tonight in his place.\n\n270\n\nToday a Taube flew over – anti aircraft couldn’t hit it, it laughed and ‘imshied.\n\n271\n\nTime and time again has this book missed destroyal, yet there hardly seems anything in worth preserving – though it may be interesting for an evening. Apres la Guerre. ‘Apres la Guerre\" – shall there ever be an \"Apres\"? Shall we ever get back to the dear land where the waratahs grow and the wattle bough blooms on the hill? Its a consumation only to be wished. Sometimes the homecoming seems quite certain, but more often it becomes the impossible dream of compleatness never to be realised.\n\n272\n\nTonight no convoy yet in: reading Lavengro – left off beginning of Sep., started in Aug. Lavengro’s interesting, but oh so hopelessly lacking in a sense of humour. I’d imagine him serious in all things and bespectacled and not a little of the lost in him for all his learning and intellect.\n\nTonight finished first vol. and started 2nd – the three reprinted in the one book.\n\n273\n\nHome mail in – big one from Mater – one from Dad and one from Betty – Dear Bet, that Native Rose made my heart ache – and your \"poetry\", almost , so fine was it – whom did you take for your model, Keats or Rosetti? But the Native Rose will go with me till we all see the live Native Rose.\n\n274\n\nIn an Illustrated London News in the tent tonight saw for first time this year, some of Pennnell’s new work - and still – not unlike his series \"Panorama\". The last I saw of his was an exhibition at Anthony Horderns last year, of his Frank Temples and Pagan ruins. Some of these were exceptionally lovely. He and Brangwin are I should say the two leading impressionistic lithographers and etchers in the world. I don’t know whose I prefer, but Brangwin’s coloring and superb grouping would I think place him first. His lithographs are rougher than Pennell, but lose very little by that.\n\n275\n\nBirdwood’s manifesto to the A.I.F. re Conscription appeared on the board the day after yesterday – after the voting. It was far finer than Hughes prosaic appeal, and far more genuine – just the thing to appeal to our fellows – in distinct opposition to Hughes.\n\n276\n\nLibrary’s lowest its ever been – include two of V’s books, \"Child Harold\" and Rosetti, other Symon \"Tragedies\" and \"Spiritual Adventures\" (both read), \"Lavengro\" and Herodotus – last but not least – its been read in view of transfer – R.A.M.C. manual – opened first time since using it to sketch details of Mosque just before leaving Cairo.\n\n277 Oct. 26\n\nCard from Jake tonight – staying with Pearson at Surrey. Forwarded letter on to him.\n\n278\n\nSwinburne’s Ballads and Poems, first series, should be bound in Blood colored vellum, gilt lettered initial letter gold – and small Medusa head on cover. Beautiful yet soullessly sinister Ballads. Read tonight ‘Dolores’, The Pagan through and through - any of Browning’s Renaissance Paganism.\n\n279\n\nWith Swinburne’s Ballads tonight Frank Brett’s \"The Iron Age\" – in Blackwood’s \"Adventures All\" series. It is a beautifully produced little piece, formal, paper cover of dark blue and printed label back and front and paper all that’s desirable. Infinitely better production than Constable’s similar series – and the same price and as better again as MacDonald’s \"Little Books of Georgian Verse\". The Little books of Georgian verse lose in their cover, and in their spacing of page headings. Infinitely better than all novelty and originality in clear plain type and spacing – no attempted originality beyond that of good taste.\n\n280\n\nV. referred to Swinburne few days ago as very ultra, very cultured. She brought up a sandwich cake for us last night.\n\n281 Oct. 27\n\nReading finishing Symons Spiritual Adventures \"The Death of Peter Wyndham\". This is a fine little study of the temperament fascinated by the crudely sensual – yet a temperament purely creative. It is a somewhat novel explanation of the point of view of those modern men – mostly of the continent whose work runs to these scrolling studies – nudes hot flush colored – sharp uncanny shadows of green, purples and blues. ‘Color’ Magazine has placed a deal of these pictures before the English public – has indeed to a large extent taken the place of \"Jugend\".\n\nIn black and white work Lindsay to a certain extent follows Peter Wyndham – yet his work – his nude Venuses and Pagan Goddesses are of the purely voluptuous type.\n\n282\n\nStill the Bulletin is publishing The Australian Decalogue. In Aug. 17, I am Thy Native Land, Thou shalt have none other gods before me. People in two or three generations will not understand the spirit in which these most egotistical ‘Decalogues’ were composed, but such as the ones above are with no spontaneous – are our absolute ideals put into words. Perhaps we are a bombastic race, but we have a lot to be proud of – our country in particular and our men – our women – and our cities.\n\nWhen we were better known in Egypt we were in caps – there was no fear of losing our personalities in being taken for Tommies – here its hats all the while. Our hats as much as our badge of race as our Rising Sun.\n\n283\n\nNo word yet through of transfer – Charles says the old man turned the last lot down and the A.R.M.S. won’t allow any more to exchange. If the 1st failed will fall back on Jake’s fixing for the 12th.\n\n284\n\nWell there seems no advancement on the transfer: it seems impossible to get to the field, and as if it’ll mean No. 2 G.H. for \"Duration\".\n\nTonight’s Times publishes big lists, and we’re damnably safe here. Directly Jake gets back I’ll get him to try and fix for the 12th.\n\n285\n\nBecause I wasn’t interested in social reform King told me that – \"Of thy silent God thy soul is an unearthly shrine\".\n\n286 Oct. 29\n\nLatest \"Dinkums\"\n\nConscription lost by over 60000 votes midday counting and Melbourne (good for the Yarra) attempted to assassinate Hughes.\n\n287\n\nYarn tonight with Harry covered the Philosophy of Expectation – the Histories of Herodotus and Walter Pater. Hope to know Harry better \"Apres la Guerre\".\n\n288\n\nThe problem of the day – how to get back from V. my Browning, Keats and Nina Murdoch \"Songs of the Open Air\": think I’ll leave it to J.\n\n289\n\nA Tale from the Past.\n\nKing now put in charge of a mental at Ghezireh. All night the mental loaded A.S.C. wagons. One of the chaps went up to see that all was going well, and found King half out the window, the mental loading and unloading his bed. Joe waited a minute or so, then disappeared, shortly after he arrived back with another chap, to see the two mentals, still King was half out the window. Then after a minute he came in, \"It’s a b-lovely moon tonight, isn’t it?\"\n\n290\n\nWish I’d cut out and kept Lawson’s \"In Flanders\".\n\n\"An’ he will say gor blime, Gor Blime, Gor Blime,\n\nAn’ he will say gor blime, Gor Blime, Gor Blime,\n\nAn’ think it means good day.\"\n\netc. etc.\n\n281\n\nThat’s a queer and sinister photograph I’ve got of J., almost a Picture of Dorian Grey. Cover this one half and you have the early Dorian – and the real J. and in the other half you have the later Dorian – is there anything of J. in this half? There was at the time perhaps – but not after the photo was taken.\n\n292 Oct. 30, a.m.\n\nFinished during the night Vachell’s \"the Pinch of Prosperity\". Two nights ago, first night of the Quarantine of Love, C. found it in B. – the edition in Dent’s Wayfarer’s Library, and in the flyleaf, J. Watson, 8117, A.A.V.C., A.17 – the book I’d asked Jack for last Oct., 12 months on the A.17 in the Indian Ocean. \"The Pinch of Prosperity\", \"Quinneys\", \"The Hill\", \"John Virney\" and others of his I’ve read. \"The Hill\" was the first, read in 1911 while at the Grammar, recommended by Butch: I wonder if he’s still alive?\n\nIn \"The Pinch of Prosperity\" is easily seen Vachell’s inclination towards social comedy, and his plays published and acted should be good. \"Quinneys\" is amongst the best novels I’ve read – a fine book and finer character drawing.\n\n293\n\nFrom the British Austral Assocn.,","93":" last,\n\n\"A khaki’d mate from somewhere out at the back of Bourke informed me over our glasses at the canteen the other night that he and his mate would not be at all annoyed if the Belgiums change the name of their country to \"Billjim\". \"Look here\", he said speaking earnestly and with no lack of modesty, \"after the marvellous scrap they put up they deserve it. Australia’s proud to know them\". It was dinkum praise from a dinkum fighter. um – um. It’s a new way of looking at the word \"Billjim\" anyhow.\n\n294\n\nI’m in a line (not","94":" G.H.) moving out of time. \"For Gaud’s sake mate, try and move in step for a change.\"\n\nThe Brit. Australasian’s as good as a Time paper – and as rare.\n\n295\n\nOur room (late) at the Orion has grown in importance: yarning to me of the women, she wanted to know which ones of the staff were renting a cottage in Wimereax!!!!\n\n296\n\nHe is full of all the beauty of Paganism and when I used to him the word Pagan, didn’t know what I meant. If there is anything in reincarnation, which he calls rot - he’s an original \"wood thing\", possibly Pan, and in build and feature, animal lithness and build, he \nis\n Pan. How near to Bacchus was Pan? Bacchus he would never know, and Pan’s ‘armours’ are as his. Pan’s love of the Naid’s beauty is largely his, and his manner towards them the same. Yet civilisation has softened the grossness alive in Pan and produced J-., a Dinkum \"Billjim\".\n\n297 p.m.\n\nSince writing the above, the worst possible dream – a murderer fleeing through France – a more wonderful France of fantastic colors and designs of Renaissance Buildings – and in some awful dream manner a murderer and murdered too, fleeing justice with someone I hate.\n\nThree episodes in the dream, passing an awful fantastic Gothic ruin amongst dark trees, a seeming sudden awakening in a time – the coffins open, and shining horrible festering aged corpses with some hideous throbbing, matting mass on the head of each sucking life from the dead brain, and the third – entering a colossal church, wonderful as a Pogany drawing, dirty but with candled altars.\n\nThe whole hideously clear and damnable. Two days ago I had a similar one. This time J. had gone to some immense cathedral within France. God knows what suggested him, and in the way of dreams the church changed to the home church in Woollahra, with this difference: the floor was richly carpeted with the red carpet of the citadel Mosque of Mohamed Ali, and the entry of a stretcher bearing a chap bandaged, with his two legs off. I was in uniform and painfully aware of the red cross on my sleeve. Then Russ, and others of the unit appeared, all in civilians, and mostly alike, sitting back with a bunch of young sisters. The dream ended with the death of the man.\n\n298 ","95":"\n\nThis afternoon came back Jake after a rattling ten days with the Pearsons – fagged to sleep after less than an hour’s talk. Met Alf in the Strand, and since then he’s staying Pearson-way. Thanks to the Invisible Gods he’s back – after the chaps in C this morning he’s like a breath of fresh air after a thunderstorm.\n\n299 ","96":"\n\nTonight walked in to Boulogne and brought back Heath Robinson’s \"Hunlikely\" and a list of translations of Verhaeren – The Bodley Head 1915.\n\nKing’s got no sense of humour: one night I showed her – or rather drew her attention to some stack cut cigarette cards of Raemaeker’s Cartoons: the one of Germania Singalong with Death – From L. to L. – from L. to L., she thought represented Brittania and Germany – Britannia making the dance pace a little hot for Germany – Death.\n\nTonight I shewed her \"Hunlikely\": she went half through it without a smile, then, ‘Dear me – all about the Huns\". When she’d finished I said, \"That’s rather a good end page, did you notice it?\" she hadn’t and looked it up.\n\n\"Playing Tennis, a Concert and Fishing … No doubt they’ll soon be able to do that too.\" Help!\n\n300\n\n\"Did you wear your cap in Blighty Jake?\"\n\n\"No! your bloody hat’s your crown, Frank – you’ve got your hat – well you’re dressed.\"\n\nAt about two this afternoon he came into the tent, propped himself against me, and wrote to Dorothy – \"if you feel like I do you’d like .\"\n\n301\n\nCollection so far of satirical side of war, and satire cartoons, Hunlikely, 2, Eves Book, 3, The Hun Hunters, 4, Book of Hassah, 5, Big Willie and Little Willie. Must get hold of the three others published by Duckworths – all from Sketch and The Bystander papers.\n\n302\n\nThe","97":" Division, according to latest \"Dinkum\" leave Blighty","98":" for?\n\n303\n\nLong as unending threads, the long-drawn rain,\n\nInterminably, with its nails of grey,\n\nAthwart the dull grey day,\n\nRakes the green window-pane –\n\nSo infinitely, endlessly, the rain,\n\nThe long, long rain.\n\nThe rain.\n\nand\n\nHere comes the wind howling, that heralds dark weather,\n\nThe wind blowing infinite ore the heather,\n\nThe wind which has trumpet that heralds November.\n\nboth from \"Poems of Emile Verhaeren\" are on the last two weeks weather: long thin rain, heavy hail and wind, the wind – \"with distressful parting, and wailing with cold\".\n\n304\n\nIf I’m going to save for Blighty, what I must cut out are teas at the little Café, and above all books: yet of late the only ones I’ve bought have been Swinburne, Verhaeren and Hunlikely. Jake’s cutting out cigarettes, at least Turf and De Reske – but then he can smoke red cross stuff, Capstan, etc., and these I can’t enjoy: one luxury then I’ll allow myself.,Turf, they haven’t the insinuating flavour of De Reske, but I liked them a month ago before all others. They’re the same price as 999 State Express, and better – 3.50-50. This is the one and only luxury I’ll allow myself, and I’ll drop each second pay by not drawing it. If that £15 doesn’t come through I’ll be euchred. I’ll need at least £20 to see me through, 10 days Blighty.\n\n305\n\nWorking now, C and D self, Jake’s doing 1. Tonight nothing doing so far (midnight). It’s cold, a clear star brilliant night, and early in the evening a most peculiar cloud effect. The moon was hidden by those clouds running along with the horizon, the sky bone clear, except for a fantastically long thin cloud, strikingly like the compleat arm of a skeleton even to the long thin fingers, and the double line of the forearm. The whole and hardly visible.\n\n306 ","99":"\n\nComes back from Blighty tonight, Alf – he was finishing his stay at Pearsons. With him a letter for J., from D. and he after reading it – and again in the canteen – almost happy again. If he gets his transfer to the O.T.S., and his account transferred to Commonwealth, J.’s met his match.\n\n307 ","100":"\n\nThe rain – it raineth every day – but not till 4.30 p.m. – so for the first time for about 8 days we hadn’t to rig up waterproofs.\n\n308\n\nArrives today registered letter - £1 note, so indulged in tin of \"Turfs\". If it hadn’t been for the \"Bing Boys\" music, and Chadwick’s singing in the Recreation Tent, I’d have smoked the whole 50.\n\n309 ","101":"\n\nPen – now in Blighty – pinched two nights ago by a Tommy Sgt. Getting his Kit together I’d put it on his bunk, and then, then it went to Blighty.\n\n310\n\nTonight for the first time for two or three weeks we got some of our own chaps, N. Zealanders from . Nearly the whole convoy N. Zealanders - and Australians – the inevitable Tommy though quite visible.\n\n311\n\nThe greatest, and newest of all \"Dinkums\". It’s been known for some time that Col. Martin and most of his staff of U. bs are going to London – Col. Fry rumour has it till last night to take his place. Now with his U.bs and 40 of the staff, he’s going to Surrey, and those left behind, at the rate of 10 as required are going into the field. Other again \"Rumours\" would break up the most God forsaken unit in the A.I.F.\n\n312\n\nSuch miserable weather that we decided to break our promise to save and so to the little Café for tea, omelette and rolls and chocolate with Jake and Harry.\n\n313\n\nAdded to collection of ‘minor’ Cartoons of the war, Signaller Ellis Silas’s \"Crusading at Anzac, 1915\", not a bad little collection – interesting to us. One question it inspires: who \ndid\n invent the word Anzac. General Sir Birdwood says he did, and General Sir I. Hamilton said Silas did, by brazenly putting the five full stops. Who is right, Birdwood or Hamilton.\n\n314 ","102":"\n\nMoved today to new quarters, self found. Alf got in the key of the old small shack, and the old Col.’s room, Jake and self commandeered: it’s like Heaven (in our old sloth at home, as a matter of fact). How long we’ll manage to keep good our claim depends on how long we keep quiet, and how long it takes for authority to find a use for them. It was a case of \"If yer know of a better ‘ole, get to it\": we did – and found quite a representative collection of La Vie Parisian and the Spectator – the two papers mixed and the Spectator looking quite small with the experience.\n\n315 ","103":"\n\nLetters from home last night and two from Commonwealth bank, London – one that £10 had been received by cable to my account – simply means another cable and irritation here and at home, if they’d only done as I asked in June by letter, there’d have been no trouble. Leave in Blighty with £10 – ye Gods: suppose they think I’m going to spend it in Bristol quietly browsing architecturally, with the Hadleys. Maleish: tomorrow goes forth another cable – repeat Tenner.\n\n316\n\nSaw V. again tonight: talks of something particularly choice in Rosetti – in one of his translations from the Italian Poets – Swinburne she referred to somewhat back as \"very choice\" and I’ll swear \"Dolores\" was on her mind.\n\n317 ","104":"\n\nHome mail – next one sunk in Mediterranean – letters from home and amongst others Mr. Curtin and Hazel. Mr. Curtin’s very short and very sad – \"My Harry’s real pal\", is his postscript.\n\n315\n\nComes back from Blighty Syd – with J.’s photographs & guide books galore.\n\nWill Dyson has been attached to the A.I.F. as war Artist.\n\n319\n\nFinished on last night of C. lines existence, Balzac’s \"Eugenie Grandet\". The one other of his I’ve read is \"Honorine\" – a comparatively short tale. Grandet is a finely written character, but prefer Nanon to her, even though a minor character. Eugenie is fine, tragic in her wonderful sacrifice of nationality, and theatrical nowhere. Lent the book to Harry.\n\n320\n\nAbout the middle of Sept. gave to J. \"Jude the Obscure\" and he’s still sticking it.\n\n321\n\nThere was something supremely inimical in yesterday afternoon’s happenings. Place Jeff in my place, self in Jake’s, and the same thing happened at both Marseille repeatedly and here in Boulogne. Almost identically the positions were the same, and the result? – well different: insomuch as I know J. too well to carry the likeness to the end.\n\n322\n\nJonas – yarning the other morning with him, promised if he could to get me a special permit for the Tate gallery \"closed owing to the war\". His brother, an artist, and according to him, greater than Branguin, a follower of the Classic schools with a slight shading of Symbolism and Impressionism, and a caring man.\n\nIf possible must see while in Blighty the Tate, parts of the National, the Elgin Marbles, and the Assyrian Court and the furniture in the Victoria and Albert.\n\n323 ","105":"\n","106":" – specialling with E – transferred in morning to No. 14, stationary with mumps. If I’d known he had mumps I’d have slept with him – and got a transfer to England and been cut off the strength.\n\nJake and self had now as we’ve never had\n\nbefore which lasted from midnight 11 till last night at 8.30. He in the afternoon at the brothels and self at Wimille – and the room as pretty as possible – a cake of Val’s starting it.\n\nThe transfer to the 43rd came through yesterday to join up when they arrive in France. Before he goes he’s writing to Major Chaytor – 8 Field – to get me a transfer. Tonight he got from the same man a letter advising him to stay where he is – and a while back a cable from his Mater.\n\n324 ","107":"\n\nLast night C Line \"out of action\" and patients distributed, so slept: and all night from 10 till 7 this morning – with Jake’s blankets – and no duty till 8 this morning. This morning it snowed – a fitting comment of nature – and a saving one: at 4 we were to have met M.K. and J.M. – out behind Wimille – J. had 2 F. and I, 3.50 – that is out of the 20 we borrowed from King a day ago, we’ve now 5.50 – and J.’s made an appointment for the pictures on Sunday.\n\nIt’s too cold to do anything, let alone write for a while. I’ll read Swinburne and place nearby his influence on Nina Murdoch’s \"Songs of the Open Air\" – to assist in the task, a tin of Turf cigarettes and all my blankets.\n\n325\n\n\"Ah woe is me! that I should fondly part\n\nFrom my dear native land – Keats.\n\nNina writes,\n\nThe wattle has unbound her golden hair,\n\nMaking such golden mist upon the air,\n\nThe little breezes breathless with delight\n\nPass her a tip-toe lest she take to flight.\n\nAnd suddenly the sleeping scent is stirred \n\nBy the low liquid whistle of a mating bird.\n\nThe third and","108":" lines – and its\n\nThe wind and his trumpet that herald November,\n\nEndless and infinite crossing the downs,\n\nThen comes the wind\n\nThat teareth himself and doth fiercely dismember,\n\nWith heavy breaths turbulent smiting the towns,\n\nThe savage wind comes, the fierce wind of November – Verhaeren.\n\n326 ","109":"\n\nTonight our last set of dominoes: tomorrow Jake leaves for No. 25 at Flanders with Scotch and Pluintis: and the chances make it that Blighty may early follow.\n\nTonight’s mail with its £10 and word of another £10 is now as more edition de luxe than man.\n\nMaleish: I’ll be a philosopher, read Epictetus and be thankful for his, not Epictetus’s, but Jake’s bed.\n\n327\n\nJust on ten months ago since he arrived at Ghezireh, over ten or twelve weeks since we became pals. At Ghezireh the first months he wore on his shoulder, 1 L.H.F.A. – at the time Dearling and myself were getting our transfers through to the main unit.\n\nThe modelling of his forearms, his hands and Pagan slenderness and grace, made me anxious to know him – but right up till Monssot he remained almost apart from the unit, yet friendly with all, to a certain extent. On the Mediterranean he was with the rotten crowd, and of it as much as they: at Monssot he was still stuck to by the last of the crowd, and he stuck to them till the end of June. But even then, his worst period , he was with the shelter crowd – and a leader of the swimming, and the organiser of the carnival when he carried off the championships. When we arrived here, he was a wreck, stood it out for a while, carried himself, developed and was admitted to hospital and on discharge came on to duty with me – and we’ve stuck together since, to my benefit greatly and to his. Dear Jake, I owe you a clearer mind, a broader outlook and a deeper sympathy.\n\nChrist God, who savest man,\n\nSave most of men, Count Gismond\n\nWho saved me.\n\n328\n\nV.’s so far lent me –\n\nA Compleat Rosetti, Adam Lindsay Gordon, Child Harold’s Pilgrimage, Sax Rohmer’s \"The Yellow Claw\" & \"The Two Paths\" of Ruskin’s. Haven’t seen her for some time and don’t want to.\n\n329 ","110":"\n\nTonight, when I’ve a hundred entries – one. Walking from Boulogne, confidences with Harry after an afternoon and evening spent together, the pleasantest evening since Jake went away, and an evening compensating for the changes and disappointments since the morning of the 21.\n\nTo make this entry, unpacked for this journal my pack.\n\n330 ","111":"\n\nThe history of a Transfer – Applied for it with Smith about 3 months ago, and on the morning of the 21 last, the day Jake left for Flanders, it came through. Smith discovered the weather to be far too cold, and our unfitness: so the transfer was held up. Thompson was ready to take his place, and paraded yesterday, we were given men from details to instruct into the importance of ward work, we were to leave today, and today after chasing up half the unit officials discovered our movement order was for tomorrow at 9.30 a.m., and here it stands.\n\n331\n\nDinner last night of existence with Aristophanes, Petronius, Sanctorius, Apuleius, Rabelais and Boccaccio.\n\n332\n\nBig batch of letters from home dated","112":" back to","113":" Letters yesterday from Fred Pinnock in","114":" L.H.F.A. and from 14 F.Amb., ten chaps asking for transfer to here, one chap strange to say, by name Molony: passed letter on to Allan.\n\n333\n\nOut to Flanders the afternoon (intention) to see Jake.\n\n334\n\nV. showed me that particularly \"chosen pieces\" in Rosetti – when she thought I’d be gone in the morning. It was \"A Virgin declares her Beauty\" and more after Swinburne’s manner than anything I’ve read.\n\n335\n\nLongueval,","115":"\n\nTonight we’re out of the line, and back at the F.D.S. after 10 days at the Aid post at Bulls Trench, N. Flers.\n\n\"Shall we not say of a murderer\" asks Montague, \"that he has a handsome leg?\" Flers a ruin on the top of a little rise, shell shattered and filled with dead trees and bodies, from where we were, mostly towards evening, was a fantastick yet weirdly beautiful position. On the hillock ridge, to us it presented a silhouette of dead tall trees, sharp as etching lines, broken by an occasional abrupt rising stark piece of heavy walling. The foreground, ploughed through by saps and trenches, filled with shell holes, a rich brown midden, with an occasional relief of tiny escaped patches of green grass.\n\n336\n\nSome gems, heard one night, while Bib was finishing a term just at the north of our dugout. Bib’s hair at night looked something like the witch of Endor as seen through the eyes of a budding Bairnsfather. The cookhouse (?) being so exposed, the entrance that is, made it something in the nature of a general inquiring office for the 10 and 12 Batts.\n\nCasual writers and Bib, were responsible for more Red Page literature than Adams has ever been.\n\n\"Who looks after the dump mate?\"\n\n\"Dun know! – Looks after itself – an’ got blown up yesterday!\"\n\n\"10th Batt?\"\n\n\"Yes!\"\n\n\"Come on then, Keep touch, Keep Touch!\"\n\n\"Keep Touch be ---! I don’t care – if I never saw the – again.\"\n\n337\n\nThe \"Dugout\" when I get home: Brown walls, cream matt woodwork, gold ceiling, green curtains and fireplace tiles. Buff and vermilion rugs, and Books, Books, Books. The only book in the dugout was Keats.\n\n338\n\nLast night – our last, and most exciting carrying. Called up at 11 p.m., a shell had landed in the dugout on a ridge alongside Flers, of 4 M. Gunners, killing one and wounding another. One of the chaps came running down to our post, and our squad was sent out. When we got over to them, Fritz started a barrage of shells turn round the spot; we fixed the poor beggar up, pulled the dead boy out, and when Fritz had stopped, started out. Just as we’d reached our aid post, three high explosives landed in the valley we’d just passed, and as we started again for the second relay post, he landed a few more over. When we got back, we were mud to the shoulders and jolly surprised to find ourselves whole and kicking. When we’d fixed the wounded boy up, and were waiting our opportunity to get him along, one of the chaps asked the runner – whose come over to get us – when he was going to sleep.\n\n\"Not in these Mate\", and there was all the tenor of the unknown in his voice. \"I’ll just stay in and walk round\".\n\n\"But your poor mate, dead, mate, we’ll put him out on the parapet, and I’ll sleep in with you!\" \"Yes, he’s dead!\", if you’ll come in with me mate?\" Then he turned to the chap we’d put on the stretcher, \"Ow is it mate?\" Mate was all right and had some instructions – \"there’s a gold ring round Charlie’s – his – neck, he’d like his mother to have it – will you get it?\"\n\nIn the short time we were there tragedies untold were acted, and the active only boys – but boys with the hearts of lions, and Dinkum. All the discomforts in the world are compensated for by the simple \"Thank you mate\" of the chap when you’ve carried him to the next aid post.\n\n239 ","116":"\n\nWhen I got back to Ghezireh from Abbassiah last January from No. 4 Aux., Jimmy Houston had left, and had, with most of the Port Lincoln crowd, joined up the","117":" L.H.F.A. The next time I saw him was perhaps six or seven weeks later when he came up one day for a bath. (Oh, for a bath now.) Then he looked an unutterable, superb larrikin, leggings and boots lacking oil or polish for the time he’d left No. 2, worn to a standstill, Brushes worn through and in shreds, Tunic ripped and torn, and too small for him, and hat with all the stiffening knocked out of it. His color and expression were perfect, hands, face and neck rich ruddy brown, well worked up with dirt, and a week’s growth of beard. I envied him for his candid enjoyment of things and for he’s having genuinely roughed it. Yesterday, I’d realised his condition to a T, though instead of sand dirtied clothes, ours were mud soaked, and the experience is worth it.\n\n340\n\nOne night at Flers we thought Fritz had on some new \"jumping jack\" explosive, but it was only a shell landed into a grenade dump across the way – about 5 yards – from the dugout. One bomb landed in the next sap and didn’t explode: early the following morning, a party of Engineers going through passed it, and one of the boys kicked it. Bang! – and not a beggar got touched.\n\n341\n\nA couple of subjects for impressionistic studies. \n\n\"C.C.S.\". Under the ten flags at Buire, at the Anzac Rest Camp, a crowd of Inf. boys in varying dugouts, and a line of grey ambulance wagons.\n\n\"An Aid Post\", with the V shaped cross flag above the dugout entrance – pinned above the door, not flown on a pole.\n\nY.M.C.A. – a Y.M.C.A. dugout at Delville Wood, the only colour the red triangle.\n\n\"Traffic\" – Lines of communication, Lorries, Wagons, Water & Munitions, Troops, Mules, Horsemen, and mud.\n\n342\n\nThe only chap I met this stint I knew before was Dooli Banks. He was one of the party come down to inspect the new constructing Medical Dugout, to the N. of Flers. Just the same old Dooli, the Serj., a bit taller and a typical Australian – slight look sheepskin – but he’d stuck to his old felt – damn the shrapnell.\n\n343 ","118":"\n\nDuty now on evacuation staff. 24 hour shifts. First 12 hours about half a dozen cases, last about 30 cases – to be taken down from line to railhead for C.C.S. – through mud, slush, over a light rail, and mud, slush again.\n\n344\n\nYesterday during the early day read essay of R. Louis’ , \"Some Aspects of Robert Burns – a fascinating study and finely written. Another incarnation of Jake’s – Robert Burns. As Stevenson writes of Burns so I should want to write of Jake.\n\nDear old Jake, to you I owe more than to any other chap I’ve yet met – and to him by his influence my being in the 1st Field.\n\nBut Jake – now more than ever before do I realise how absurd it would have been for me to aspire with you to the O.T.C. To take the interest necessary for a commission in range, shell fire bombs. Somehow it is more than I could ever manage. Yesterday we were yarning round a brazier with one of our auxiliary men from Flers and the unaffected interest Syd took in the conversation fascinated me.\n\n345\n\nHeard yesterday that Bob Smith had applied for transfer to A.S.C. – then that he’d some time ago lost his leg. Bob was one of those physically beautiful types – a symphony of the surf – cleanly proportioned as a bronze of Prometheus a stern and nutty brown body.\n\n346\n\nTonight letter form Mother, and amongst others one from Clair. Here’s an extract from hers – following an account of her brother being killed at Pozieres – \"C.J.\" has been awfully good to me, he has done all in his power to cheer me up and help me to forget my sorrow, he has a new motor bike and is getting a side car – then you will hear some thrilling accounts of our trips, especially if it breaks down in the middle of the bush and I have to get out and push.\n\n347 ","119":"\n\nField yarns and tales, on the boys return will be dull and colourless without the enlightening bloodies, etc. – colourless that is beside the Aristophanean accounts of encounters and episodes that are the daily subjects in the huts and dugouts.\n\n348\n\nToday Syd went down to the Rest Camp at Buire and brought back with him parcels for the half section – and then for me one from Mat with John Oxenham’s \"Bess in Amber\" and one from Mother with a seaman’s cap – from Paris and Australia and one of gold from Merridens – three books – The Private Papers of Harry Rycroft, Vanity Fair and The Egoist, and I was so bankrupt in literature that I was painfully wading through David Copperfield – 533 pages of close type.\n","120":" now I stand after 3 small parcels. A Gold sovereign, a book, and 3 pairs of sox. To the high Gods, to Mother, Mother and Merridens high thanks. And I’m forgetting two letters, one from Elsie again – on card – and one from Jake.\n\n349 ","121":"\n\nThere’s an old grey horse behind just this side of the temporary prisoners compound – 200 yds. above us. Fritz has been shelling us since early this morning and the horse is still standing there, now with his ears back a still as a statue, now straining at his tether, and not windy whizz, back with a horrible jerk up his head.\n\n350\n\nToday, in place of the theory, the practice of building.\n\n351\n\nIn a wonderful monument of Doric severity and all Greek beauty to our Infantry boys – for the imagination to conceive one worthy of them – will some day appear in return of bronze Rupert Brook’s \"Blow Bugle Blow over your rich dead\".\n\nIn my mind’s eye I can see the whole magnificent structure, of details wonderful but not so wonderful as the entirety. A great circular Doric colonnade supporting a great dome – in rich grey trachyte, a frieze of Metopes sculptured in high square relief … and enshrined in this open Temple such a bronze as Rodin’s \"Thinker\".\n\n352 ","122":"\n\nLindsay – your cartoons are great – they’re part of the Bulletin’s great attraction to me, your bears and kookaburras - jove that last page was fine – we’ve laughed over – and with not all laughter in our hearts, but your last: \"Thumbs down\" in Oct. 19 number – that was too hard. The Bulli’s our paper right enough, lots that hurts. God if those who turned their \"Thumbs down\" unthinkingly could only see one part of the stark misery of mud, sun and water logged trenches – if they could see their Infantry living in hell for them – to know their names clean they’d be haunted by those sights till eternity closed in upon them. Sometimes carrying them their generous and now heartbroken have driven all my mind blank – blank but for one thought – and he’ll say \"Thanks digger! - Cobber\" when we’ve got him to the post - and mean it. \n\n353\n\nWrote to Jake today – and advised him to rest on his laurels, leave the O.T.C. and the 43 Batt. alone, and join up the 1st. If he does he’ll be satisfied.\n\n354 ","123":"\n\nLindsay’s Thumbs down cartoons.\n\n\"Cripes don’t ‘e get some expression into his people!\"\n\n\"Ah, that’s a bit over the fence, you wouldn’t think a man would put it on paper.\"\n\n\"An’ my boy, in from the line, shrapnel in the head\". The Bastards\": and another, with a laugh of no humour – \"An institution under strength, an’ has been since Pozieres. Thumbs down!\"\n\nLindsay, \"The Proposed Betrayal\" was a beautiful cartoon – in your best manner, but a hundred such will wipe out Thumbs down.\n\n355 ","124":"\n\nDear Bill - Things is crook – Jim.\n\nHalf a dozen of us \"chatting\" – and not saying a word – broke up a Bridge Party and a hunt on a large scale followed. I caught","125":" of them just hatched.\n\n356\n\nIf yarning over old times already fills such a decent morning, what will it be like \"après la guerre\". An evening in deep chairs, the Theatre, and another yarn till morning.\n\n\"In all pleasures, there is an element of cruelty\". What a terrible element of cruelty will be in the existence home – almost wholely cruel to those to whom none return. And the Spring offensive yet before us.\n\n357\n\nToday wrote to Merridens – and forwarded with the note 15 F. – ordering Burns Poems and Hamlet – both in Nelsons New Literary Library – and shows love among the artists, also Vachell’s Quinney as a play. When I can, no matter the condition, I’m going to keep what books I can with me.\n\n358 ","126":"\n\n\"Crool fortun’ ‘ad us snorted just a treat\".\n\nAfter the quietest and most boring day in the hut, at 5 yesterday afternoon went to report on duty at the evacuation tent for 24 hours duty, but it was a missing in anguish. Fritz had handed over his Christmas \"Iron Rations\" and we’d a full night of carrying. Three chaps died just after leaving dressing tent.\n\n359\n\nPushing the trucks – loaded with two stretcher cases, along the miniature rail from here to the rail head – especially by night – the prostrated figures – completely covered by the blankets – stiff and still, remind me of two things – the Florentine, and a picture in the Sydney Gallery, The Sons of – Clemis (?).\n\n360 ","127":"\n\nYesterday a Bath: for 5 minutes under a thin stream of hot water – 7½ hours travelling. Left Longueval at midday to catch train – trucks of wounded – at railhead, trucks all but two or three full of Tommy washing parties, so had to push in with them. Just this side of Fricourt engine shunted and got away before we’d realised it with the trucks of wounded, walked then to near Fricourt baths and caught motor lorry, left lorry as she turned away towards Fricourt village, and after 10 mins. walk caught another which left us at Meaulte’s railhead. Baths just near here at …. and run by some of our nursing sisters. Back, change and tea and dried figs, cake and biscuits from cookhouse and canteen near. Then down to railhead and caught truck train leaving Meaulte at 3.30 and arrived back at Dressing Station about 7.45 in time to go on duty. Easy night, two boys, too bad to carry, died during evening. Fritz shelling during the night and dropped seven or eight shells close round, one in our lines, and one between us and the cookhouse early this morning. Slept through it all – dead to the world.\n\n361 ","128":"\n\nAt the Quarry a few days ago working with a Pioneer Company. A Tommy officer calls up one of them for not saluting. \"Don’t you men \never\n salute?\"\n\n\"No, we cut that out months ago, digger!\"\n\n362\n\nSome things I hope to read of and know. Florentine History and more especially Florentine Art, Renaissance Art and Architecture of Italy and France, Elizabethans of England.\n\nThe literature of the last century, and the histories of all literary and artistic movements.\n\nAnd some books I hope to own. Most of those published by Len Warner in the Riccardo Press – some in vellum binding. various lines - in Len Warner edition. Don Quixote, 3rd edition in , most of Swinburne’s works, 1908 edition of Wilde in 14 vols. Verses in 26 vols. Barrie works and Max Beerbohm, and a library of reproductions of all important pictures and sculptures. Half of Bamforth publications, also many of the Country Life Library and Whistler, Smith’s Art of Making Enemies, Rabelais and Lindsay’s edition of Patronius.\n\nNow the New Year ruining old desires,\n\nThe thoughtful soul to solitude returns.\n\n163 \n\nThe year’s reading has been good, considering the circumstances, 4 of Hardy’s, 1½ Meredith, several of Temple Thurston, two of McKenzies and a deal of Poetry.\n\nNext year’s?\n\n164 ","129":"\n\nA quiet night: the bombardments expected only just a trifle above the usual when Battalions change over. Fritz landed about here very few shells and only one or two shrapnell.\n\nAt about 10 Cliff brought in two opened parcels – one belonging to Stevens now in N.Z. – the chap I exchanged with, and the other one to a chap dead, buried near Flers. For the contents amongst the 16 of us we drew no thanks, all prizes, but some duds – a tin of jam and a tin of Beans. I chose the jam.\n\nThis time last year so we’ve been talking this year – but in Sep. should see the end.\n\nBut between this and then there’ll be some big offensives, and some terrible losses for us. Will the Tanks be back again? It seems probable that they will, but once so improved that the slow one fades into insignificance: this because of the way the papers have so fully illustrated them. But Fritz? What has he got.\n\nJanuary 1917\n\nLongueval, A.D.S. 1st\n\n1\n\nGood old J. The best I heard for many a day was what Barton had to say. If you can get your transfer to here, we’ll be set.\n","130":" 4\n\nFrom the Bulli. of Oct. 26 – the results of a competition – a description of Billjim. The best printed on line of the typical Billjim.\n\n1 A Gay – Grey-eyed, graceful, generous gambler.\n\n2 An honest, humorous, honourable, handsome, happy of luck hard-won.\n","131":" A lion, lithe, lank, lazy, live, laughter, laring, large-eyed, long armed, larrikin, long necked, loose limbed, laconic, leg-pulling, lurid, lean.\n","132":" Nice, narrow hipped and nonchalant.\n","133":" A quick willed, red blooded resourceful rebel.\n","134":" A slim, sturdy, sinewy, slouching, sensitive, silent, self-reliant, soft hearted, sports loving, swash buckling, straight yarning, sturdy eyed, small chinned, sandy haired, super masculine, sentimental bloke.\n\n7 … only more so.\n\n3\n\nA young Fritz we took down the other day after his first bashfulness passed, anxiously asked confirmation of one of their \"Dinkums\".\n\n\"Do you send all the prisoners you capture to Australia?\"\n\n4\n\nBill’s just come into the tent – and in still another rig: Glengarry – cardigan, mauve underpants and knee gum boots.\n\nHeadgears\n\nSoft easy felts – well shaped and well dinted and otherwise, hardhatters, shams and caps – and the first day supplemented by enormous whites worn a hundred ways. The brim ever wide and soft, and of a lovely surface for decorative indelible words, \"Bill Smith – Enmore – Australia will be there\" impressionistically stitched on the under side and the brim caught up by a rose or a cigarette card – a patriotic button or a glaring breach. Then again the cap could be well worn and safely kept in position by simply turning under the sides, so leaving two chin jacks: or by turning under the whole, and so constructing a neat toque.\n\nThen comes the uniform issues and they gave us a cap and hat (Billjims already had both – from his cobber or he’d pinched ‘em) and we wore our caps to a standstill. On the transports we’d the wind and the sun. Egypt it was hot but we still stuck to the caps – but gave the hats more than a fly. Then the helmet.\n\nBy the time we’d reached France we’d not all of us both caps and hats, some had and for a while stuck to the cap. For a while: a day dammed the cap and the hat came into its forte and compleat glory. Our uniform became changed by the fitch fastened to the Tommy tunics - but we stuck to the hat. Tommy has adornable puttees, trousers and tunic but over our hat. Then to the line, and they gave us steel helmets – heavy and uncomfortable, with wide straps and deep lining. Uniforms can be easily summed up: Top gum boots – sheepskin, leather side and mufflers, a balaclava and helmet – or hats. Generally a waterproof sheet gracefully drooped from the shoulders – or with a hat in the centre is turned over the front and back, with a string tied round the waist.\n\nIn a late copy of the Bulli. in a paragraph on the use of a kerosene tin. What about the virtues of a helmet.\n\nA wash basin, and a seat, a pot and a candle holder – candles would be the tops and a diner and a tucker dump. A jewel of Bibs, describing a New Year’s day episode – \"I got ‘im a tin ‘at to spew in, but ‘e wouldn’t, an’ I put me finger in ’is mouth, an’ ‘e bit it so I said - you: … an’ … you too ‘e sez.\n\nA few nights ago 4 squads of us spent a good couple of hours reading from \"The Moods of Ginger Mick\" round the brazier at evacuation point – the \"Estaminet\". There were good readings and bad: Sapper and Syd the best, but we survived the others. There were laughs and silences and in the back we all knew someone else – and ourselves. Ginger Mick himself – in the section – and one of its best hearted and wholest men. This Ginger Mick, the Sentimental Bloke, a gallant gentleman, a hard doer and the best hearted fellow in the world – from the Loo.\n\nOne morning in at Flers we saw him making bacon sandwiches for boys waiting to see the Battalion doctor. Half the time we were there he used shell bits, made for our tea – then brought up water, \"the … wanted a drink so I ‘ad to let ‘im it\".\n\n6\n\nOne of the sisters of the 3rd has given A section another \"hit\". \"Stretcher bearing\" she snorted – \"Brute strength and ignorance is all that’s required\". Brute strength and ignorance. Bibs is \"sunny days will shine\" and sometimes a ride –\" but they’re a …. long while shinin’\". Man is \"well lads, things is crook\".\n\n7 Dec. 6\n\nTwo days ago started our chaps back to Buire. Tomorrow the rest of us go, and then leave to Amiens: perhaps. The latest Dinkums of importance are that from the A.D.M.S’s office comes word that the","135":" L.H. will be on the water within six weeks and the Kaiser dead.\n\nLast night we bombarded Fritz nearby right through – and he for a while returned the compliment – nearly getting our light railway. Carrying out on the heaviest night we’ve had, and some had cases went through.\n\n\"Things is crook – sadness is set in.\" A cold night, and snow.\n","136":"\n\nBig mail couple of nights ago – two from Father and one from Mother. \n\nOn Oct. 21 Grandma Molony died, I knew her well, yet in memory she’ll live on, saw her most – in the Morning Room at Burwood – intimidating stiff linens.\n","137":"\n\nIn last mail – from Jake, he’s taking Vansom’s admin. and is claiming Jim and Doug, and getting into O.T.C. – the damn fool.\n\nBut without both Jim and Doug he’ll have much to say on this.\n","138":"\n\n\"Well it seems yer’ bloody well right – again always calling chaps ----s.\"\n\n\"I’m not! I only call me cobbers …s, you ….!\"\n","139":"\n\nThe O.M. only dished us out 4 loaves between the 16 of us: rations for 24 hours.\n\nPlease give me a penny sir,\n\nMy Mother dear is dead.\n\nMy Father he’s a drunkard, sir,\n\nA Penny please for bread!\n\n-- a full chorus behind the tent.\n","140":"\n\nSome days back received from Merridens another small parcel of books: Shaw’s \"John Bull’s other Ireland\", Lucas’s \"A Little of Everything\" and MacGill’s \"Soldier Songs\" - songs in which he completely fails. Blackwell’s \"Songs from the Trenches\", infinitely better.\n","141":"\n\nOnce it was but rarely I’d think for long on ambitions and life \"Apres la Guerre\": now when the reality of the many chances of not returning, the longing for the ending and the restarting of home and civil life, daily pictures of that after fill my mind: and one of the most frequent scenes – strangely before a fire – is in my room comfortably arm-chaired and a large book open: then comes the many cravings in the same room of yarns over old times with many chaps - cravings of quiet and luxury. When all crudeness and blood is forgotten – forgotten? – and the lighter side only remembered.\n\n13\n\nNotice the entry – well 13 is my lucky number.\n","142":"\n\nLately seem to have gone all my desires for an exhaustive and compleat collection of war cartoons. Now instead of a collection of quantity, it shall be a collection of quality. Raemaeker, Dyson, Lindsay, Lewis , Sullivan and a few others of exceptional beauty of design or originality.\n","143":" \n\nThe Blue Mosque – below the citadel, the Sphinx and the Pyramids, midnight and a sky of slow embroidered densely deep blue, the Cathedral of Aix in Provence, and now three days ago, on Sunday the Cathedral of Amiens.\n\nAll the Gods ever with us and we heard high mass celebrated before a wondrous altar by marvellously robed Priests: a choir of white robed red cap’d boys and censor swingers in delicate laces: and the service between two high long walls of deep sandbags.\n\nAll the richer and more exquisite carvings and shrines, the choir stalls were hidden beneath flat walls of sandbags: but the brilliant stained windows, of the lustered apses were clear and unprotected.\n\nThe building is the realised conception of a madman. It is a creation ranking with all the best and greatest of the world’s Art. In a way it somehow recalled Rodin’s \"The Thinker\" and Michael Angelo’s \"David\" and Phidias’ \"Three Faces of the Parthenon\".\n","144":"\n\nIn Amiens a bookshop – Vachell’s latest, \"The Achievement of Time\", 5th serve of de Maupassant and Balzac’s \"The Wild Ass’s Skin\".\n\nAt a photograph shop spent 40 francs on pictures of the Cathedral.\n","145":"\n\nLast night a heavy fall of snow – today snow – balling – and no respect of red cross. Had Hunt alongside resulted in two – jolly fine big bricks. Good sport in the snow, but hares badly outnumbered by about 200: still they put up long and good fights, but ….\n","146":"\n\nThere are two Jews amongst the new reinducements says Bib – \"A Serj. – that’s crook – we’ve got the mob that killed Christ with us – what will we do.\"\n\nB’s in the cookhouse now.\n\nOne day in the incinerator comes up the W.O. to him and says – \n\n\"Where’ve you been Bib?\"\n\n\"Ere all the morning! I’ve …\"\n\n\"I didn’t mean that, what have you been doing, I haven’t seen you about for months.\"\n\n\"Oh, up the line and …\"\n\n\"Then do you like the job.\"\n\n\"It’s a ‘…’ of a job.\"\n\nAnd so Bib’s on a nice one – the cookhouse.\n\nOnce before B. came into the tent disconsolate and fed up. \"When’s sick parade, I’m goin’ sick.\"\n\n\"What’s up Bib?\"\n\n\"Nothin’ that … of an incinerator won’t burn, that’s all.\"\n","147":"\n\nAfter Jake, it’s a penance to see these native beggars under the showers: half of them have the lesses of ugly women: no muscle lines or symmetry. Of the whole twenty there’s not one worth a second study.\n","148":"\n\nLetters from home. Geoff wrote for particulars of the tank: Billy’s writing a novel, otherwise the family are well. Other letters from Sharpe, the Whittels and Joyce.\n","149":"\n\nSun worshippers – in a land where the sun is a God that is dead. Where nature has been shrouded and laid in a hideous grave by the spirit of Desolation, a land where once most lovely woods are ripped jagged, trunks and dead branches, gaping holes of sinister water and mud, where tall trees grew from deep grassed soil. \n\nOnly the skys are lovely, still blue and swirling clouds, white with rifts of pale gold\n\n.. the last fading glory of the Sun. Lister Lister has painted glory into his \"Golden Splendour of the Bush\" but the golden splendour of the Beach – Bondi of rushing wash and golden sand, no one has done. In the Bondi of memory. Nature has more adorable art and its wonderful and awful.\n\nBondi and its sunworshippers 1300 miles apart.\n\nBondi, the full brave sound of the name – to be there again, full length on the sand, a lovely December day every sense resting.\n\nSnow on the ground outside, a bluish sky: on the hills dull constant flashes of light and the low far heard sound of the Guns.\n","150":"\n\nDinkums yesterday finished in Arras, todays, Becourt, Hammel.\n\n23\n\nAlbert,","151":"\n\nThe coldest and a most miserable day. The water in our bottle in less than an hour frozen. This afternoon roaming round the city – and a good look at the Cathedral: a tawdry – an expensive building in a bastard Byzantine manner, hopelessly wrecked and ruined. The great gilt Virgin and child on the tower, leans over the street teters, at an angle of less than 60° with the perpendicular.\n\nHeld above, and her arms raised, the figure blesses all passing below.\n\nA Bairnsfather drawing – the cathedral, and ten Tommies.\n\n\"What did that\"\n\n\"lice!\"\n","152":"\n\nThe bilett in the Cathedral School house just across the square.\n\nThere is a picture in it.\n\nA Brazier – 17 around it – a high well proportioned room – tapestry walls and great north doorways.\n\nEdwards Post\n\nThe North Rd.\n","153":" \n\n11.25 p.m. – artillery and machinery gun fire: ","154":" Red flares the colour of winkles in – a big stunt in progress.\n\nNo two reports tally – all though along similar lines – a great advance, and new stations being established. \n\nThe stunt started early the evening of the 24 – the day Clarrie and self went down to Byzantine for a change and a bath – which didn’t meet us. Back to Edwards at about 4.30 – at 5.20 as we were finishing tea in the dressing room, Capt. Hunt elected me runner – to No. 1 Relay and Factory Corner – to change over posts immediately at the such, and to get things ready – the","155":" were going to hop over and the stint for the maze due.\n\nAt Edwards Post only Clarrie, Mon, self in Dressing Room, with the Babble and Batmen on duty squad – many other bearers at Turks Trench, Yarra Bank and near railway. Every minute from right we were expecting the Artillery to open fire – we knew the strength of the maze, the importance, and the value Fritz attached to it – and we knew that in some places he’d evacuated his strong point and front line, and heavily bombarded them. We padded improvised splints, unpacked shell dressings and gauze and wool, got out supplies of Morphine and bandages.\n\nA whole night of silence – two stretchers in early, but out of the stunt – at about 10 p.m., General Bennett’s batman in for Aspirin brought rumours that the maze and a whole division line had been taken without a shot fired – and the scouts couldn’t find Fritz. At 3 a.m. we got out blankets, sat up with them around us, and Capt. Hunt and Billie turned up with word of nothing doing, to get a sleep which we could. Two cases in at 6 – two signallers of the","156":" both badly knocked – one had a Mills in the pocket and laying run wires had fallen into a shell hole.\n\nClarrie and Mon carried on, I turned in down in the dugout: up at 11.30 runner again\n\nup to Factory Corner as guide and across to run and Post that had moved up to Yarra Bank at 4 in the morning. Fritz was shelling heavily all along the old taken lines, marching his dead, and using his heaviest metal. Back to Edwards, and the rush commenced. All night till 2 a.m., both slings in use, and a line waiting. Capt. Robinson and his off-sider in to give us a hand at 11 – Clarrie up with Jack to Factory Corner with splints and dressings, and dugout like a slaughter house – ankle deep in bloody gauze, muddied bandages, and cut off first field and shell dressings. At Turks dump one shell got a whole party, killed 9, two died here, and more that went through have one chance in a hundred. At 5 a.m. cases slackened off – and word came through that behind Bapaume Fritz was withdrawing. I turned in at 10, returned at 8 by Clarrie and Mon, till then all the lads we dressed had been wounded before 5 the day before.\n\nAll the elation of the success goes with the hell that it costs.\n\nMidnight, 26 – the artillery has slackened but no stretchers yet through.\n","157":" a.m.,","158":" Eight through – nothing fresh. Fritz is sending over tear shells galore, and heavy iron only. Our 18 pounder batteries since this morning this side of Flers going strong. Nothing yet of the result of the 11th’s work tonight.\n","159":" pounders established since late yesterday over Factory Corner way, last night slow and five cases through – considering advance.\n\nSamples of water from the second sullage through tonight from Bazentin – in bottle of German make and label, and a Fritz card for sample list and position of wells. \n\nMore reinforcements arrived for us tonight – three of them to night duty squad.\n\nSent down to Bazentin today, letter of 10 pages – to Mother – green envelope.\n\n26\n\nLibrary at present – Keats, and Ginger Mick – he’s missing though – somewhere in the big dugout.\n","160":"","161":"\n\n\"Everything’s tres bon but the flowers\" says one chap when we unbandaged his smashed leg.\n\n28\n\nOn the Yarra Bank carry. Robinson was knocked – neck and shoulder – carrying with Bib. Into a shell hole Bib drags Robbie – and sight Major Kay a far distance away. Bib stands up, waves his arms about, and yells \"Bill, Bill, over here\". Says the Major later in Bazentin telling the tale – \"He was singing out Bill, Bill, - but till I saw Bib didn’t think it was me – it was though\". Another of Bib’s typical adventures with the same chap, goes well in a dugout but not in a journal.\n","162":" 1, 1 a.m.\n\nHeavy shelling on our left: early in evening the Right had Fritz thinking – and worrying. The whole sky in that section brilliant with dazzling white flares, and bright red and occasional emerald ones. Shelling heavy early – now quiet.\n\nRead for third time lately, last act of \"Otho the Great\".\n\nLast week sent £1 note to Times Book Club, so as to have a credit for getting, sending matter over. Wrote with money for J. M. Barrie’s \"The Little Minister\", Temple Thurston’s \"City of Beautiful Nonsense\" and Masefield’s \"The Everlasting Mercy\", 1\/-, 1\/- and 3\/6, 6\/- in all. Next order to initiate, Flashback’s \"de Maupin\" .\n","163":"\n\nWhen we came in on Jan. 25 last, in No. 2 Relay dugout a coincidence: of the few books amongst us two were Everymans edition of the Balzac \"Eugene Grandet\" and \"The Wild Ass’s Skin\" belonging to Basil Burdett and self. Had a good old yarn – Book turning – and Book illustrations, Dulac, Rackham – then on to Aristophanes, Apuleius, Rabelais, to Barrie, Wilde, finishing with Newman’s Apologies and St. Augustine’s Confessions.\n\n32\n","164":" night, one chap through the D.S. – knocked in the leg, arm and head, started to laugh, for 5 minutes he was quiet and then off again. I asked him what the joke was, and got this –\n\n\"I can’t help laughing at the way the …s ran!\"\n\n33\n\nOn Sunday last, in the early afternoon, acting as Runner, over from the Yarra Bank and Bayonet Trench, some terrible sights. If they were brought before the peaceful public, how horrible and terrible would it all become to them. If they would merely see the chaps now – that once they farewelled, cheered and enthused over something of the horror of it would be theirs. But the papers and heads still churned out dope about several victories and local successes – including such incidents as the last raid here – before the stunt – when the 4th and 5 hopped over, and the 5th had casualties about 50% of their raiders.\n\nAnother striking – and a picture without the rotting bodies and bloody shelters with ten bodies in them – sights on the light rail, when two or three trucks of stretcher cases are being pushed down. The ten trucks and the stretchers with the men’s blanket covered and the chaps pushing, make a subject with all the relief of a cameo against the dull ground.\n\n34 ","165":"\n\nToday – till midday no casualties through. Clarrie and self up to F. Corner and on to Ligny Thilloy and the Farm. More craters near Farm, no casualties caused by its explosion – now occupied as villa district by our chaps. Called at the Relays – saw Bill, Peter and Syd. Bill in new trousers just arrived from Blighty. Back to Edwards Post and turned in after lunch. Near Seven Elms the Col. and his runner knocked this morning – he through the lungs and in the thigh – making 4th casualty this time in – Flowers the first and he knocked in the shoulder just behind us at Turks Trench the first day coming in. Stretchers in till midnight 6 Batts. in all – Bomb wounds. The night quiet.\n\n35\n\nThe North Road – the valley and once old residential site – now going in for closer settlement. Dugouts of all schools - terraces and some detached all along from No. 1 Relay (Rd.) to the Dump Corner. Just behind the old post – now in possession of 4 Artillery Officers a couple of 18 pounder test lines – the same over the Factory Corner Dugout and even along the road to the Farm. Bodies all along the old road – Fritz and Tommy and …. what we heard on Sunday is true.\n\nBilly down last night late and a cheerful tale of our unexplored dugout – they got down the steps and stopped – on the wall opposite entrance a black disc, with it, and chalked up \"Take Care\". Is it that Fritz \nhas\n some sense of humour, or is it some of our Engineers or Artillery’s mode of ensuring possession.\n\nAll the dead, N. Zealanders, Tommies and our boys from last Oct.’s charges near Bayonet Trench - Fritz’s old front line, to be buried. Prisoners started this yesterday.\n\nLast night a mail in – and for me one typed high pitched page from Lindsay.\n\n36 ","166":"\n\nFrom midnight till 8 a.m. we came through. Heavy bombardments over Seven Elms way and on our right. Furphy about 2nd Dvn. hop over. First batch through this morning early, started by young Fritz – a boy of less than 18 – on shoulder and hip. First field dressing over right hip, covered hole near hip joint about 2\" x 1\" and a great gush of blood from it. Padded it with gauze – a whole roll used and bandaged. Poor beggar was game but must have been in great pain. In amongst about ten following stretchers – one of our own boys – with his right foot shot away. Most of Fritz cases pretty bad – one officer knocked in leg kept me wide eyed: amongst the walkers, a little Corporal of the guards with a hunk of muscle out of his shoulder and the arm smashed a trifle – he’d bled badly, but his worry at the idea he had that he’d lost his arm seemed to pain him most. Dressed him, and relieved him of the weight of his two field dressings – so glad at my taping him for them. They’re poor, mostly bandage and gauze, wrapped in rough linen tied with string and dated 1914. No waterproof or covering air tight round them. One poor beggar shot in testicle half blown away: one stretcher that passed him, a Fritz shot through the head was his brother. The officer and Corporal both Iron Cross beggars from the Russian Front. \"The Russians are\" says the latter \"not so hard to fight as the\n\nFrench and English. That we were Australians surprised them.\n\nWith the last crowd through stiffness had set in: they’d captured the 5 men and machine guns of one of our strong points and then been captured themselves. Altogether Fritz’s two counter attacks this morning early disastrous failures and a getting back from the 5th casualties of their hop over late in February. Had a tin of beans at about 5 and turned in at 9 and duty. Till now I am 3rd, only two through, one of the 5th and a F.A. chap from the batteries over the D.S. at F. corner. The night quiet.\n\n37\n\nThis book I’d thought to finish with notes on 10 days Blighty – that was three months ago.\n\n38 ","167":"\n\nSlept whole of latter part of morning 2 a.m. till 8 a.m. – breakfast – and a tour of the evacuated country again with Clarrie’s souvenir hunting: bag – a Fritz cap, muddy and bloody, shot through front rim and one of thousands of flares, only one full brass case. Back at Edwards about 3.30, dinner of munchies and Beans, and turned in at 4.30 till 7.30. Duty. Sick through only till just before midnight, and then Syd. brought in Macdonald – knocked just outside No.2 Relay – where he’d gone today to relieve Perkins – knocked in the back of his head and part of brain protruding. Called up the Major, dressed him and sent him down to Bazentin. Squad left him at cough drop still alive but unconscious. Shell that got him or tear gas shell: since 9th Fritz had been putting them over, and the air still full of the tear gas.\n\nOpposite No. 1 Relay – where Fritz once had one of his whizz bang batteries got a good case: as a holder for flannel flowers, we’ll polish, it’d look great. The day’s been quiet and the night comparatively so. Poor old Mac – an original – I think of 1st G.H. No. 144 and only this morning had said that \"they can’t get me\".\n\n39\n\nTonight Ern cut my hair – not before it needed it. 1 in 4th, two of the 3rd chaps on duty squad are swapping tents.\n\nThis time last year – the early part of March we were clearing out Ghezireh Palace, packing for an unknown destination. April next I’ll have been 12 months in France, 3 at Marseille, 6 Boulogne, 3 in the field.\n\n40 ","168":"\n\nIn the night continuous bombardments both sides: no cases through after 1 a.m. Slept in. Bill knocked in thigh – same shell that killed Mac – poor beggar died at C.C.S., the wonder is that he got that far. Makes casualties to date 3 slightly remaining on duty: 1 slightly shell shocked: three badly knocked and evacuated, and two, the Colonel and Mac killed.\n\nRead till midnight between wards first few chapters of \"The Wonderful Year\".\n\n41 March 5\n\nQuiet night. Slept till midday. 2nd &","169":" relieved, we all from Edwards to F. Corner. Hunt asked me to Batman for him, decided to, but on understanding it was only till we were relieved. Clarrie and Mon permanent Gas Guard.\n\nBig home mail and last night letter from Ron. All at home well – and not at home – family split up for 6 weeks. Letter from Gerald – who sails early this year, Mat and Clare. Mat wrote long and cheerful letter dated Xmas day. Answered Ron’s tonight.\n\nExpect to be relieved within next few days, rumour has it we’re for Belgium, Ypres. Hope so. Syd’s been in Blighty sick, and is transferring to India, and Russ has been awarded the Military Cross.\n\nChucked reading \"Wonderful Year\" at","170":" chapter.\n\n18 Pounder Batteries over dugout making hell’s delight.\n\nIn the dad’s letter enclosure of cutting from Harold - on Chair of Architecture at home. Must find out more about it.\n\n42 March 6\n\nA quiet wonderful day: Batteries moved from above us – so now nights of comparative quietness. Saw in trench Inf. boy wearing colors of 18 Batt. – so chatted him about George, heard he was near, but exact whereabouts unknown: asked chap to tell him when he saw him, that I was enquiring after him. Later in the afternoon a runner from his Company called me up, and I went over with him to where he was quartered. Had tea with him, and a fair yarn. He’s changed as much as the English alphabet in the last century and looks topping. Saw snaps taken in Egypt of Russ, jolly fine of him and a good photo. Must try and get a copy. Apres, also one of Nic – changed out of all knowing. \n\nStrange that he didn’t know of Olga’s engagement – I put my both feet in it there pretty evidently.\n\n43 ","171":"\n\nOut to Luisenhof farm and the enormous crater – quite a Bairnfatherson sight - villas round its sides and a centrally placed cookhouse. The day dull and quiet.\n\n44\n\nIn the Dad’s last letter an enclosure on establishment of chair of Architecture at the Varsity. Apres it’ll be my luck to be too late to take it fully but with it in Sydney it’ll mean finer work and more competition. Must get hold of something – some text book or other of one of the allied arts and fag it up – \"Art\" by Bell or \"Works of Man\" or \"Studies in Architecture\" also Lethaby’s Architecture in Florence University Library. Will write to chap, Hoofe mentioned in Dad’s letter of same date in cutting.\n\n45\n\nSince writing the above, one letter of 4 pages home and one to Blighty, to the Hoofe chap with 10 F. for Craig’s \"Art of the Theatre\" and Lethaby’s \"Architecture\".\n\n46\n\nAh, love could thou and I with fate conspire,\n\nTo grasp this sorry scheme of things entire,\n\nWould not we shatter it to bits, and then\n\nRemould it nearer to the heart’s desire,\n\nBut … The moving finger writes and having writ\n\nMoves on … The sword proves mightier than the pen,\n\nAnd honors King supreme.\n\nThe stars of heaven gorgeously are lit,\n\nThe land is barren strewn with rotting dead,\n\nStill creation with a ghastly bloody lake\n\nFor love of man and honor’s sake Christ God\n\nFor all the sins wherewith the faces of man are blackened,\n\nMan’s forgiveness given …. and taken.\n\nThe argument was barren tonight – hence this effort.\n\n47 ","172":"\n\nThe main idea being a central living room court lit by two gable end lights. Roof beams as decoration – stained Flemish bark.\n\n48\n\nLast night’s sing song – \"We don’t want a girl from ruined Flers\", from Luisenhof, \"from smashed la Barque\", Thilloy, etc. – all the newly captured villages, and not a bad \"Old King Cole\" song – ranged as the \"House that Jack Built\" – a fairly compleat union – the final group – \n\nOld King Cole was a merry old soul,\n\nA merry old soul was he,\n\nHe called for his pipe and he called \n\nfor \nhis Fiddlers\n band and he\n\ncalled for his Colonels three.\n\nI want six weeks leave said the Col’s\n\nI want\n\nI want\n\nWe do all the work said the Subalterns\n\nCrown that man said the Serg. Major\n\nMen to the right in 4’s said the Serg.\n\nLeft, Right, Left, Right, Left said the Corporal,\n\nBeen, Been, Been, said the Privates,\n\nWhere is the wet canteen?\n\nFor there’s none so rare\n\nThat can compare\n\nAn’ the A.I.F. are where.\n\n49\n\nToday quiet and cold: snowing and then the sun – contradictions all day long: Heaven’s heaped up pearly clouds over a purple Flers – and cloudy yellow smoke and flashes of shrapnel – then clouds of earth for H.E.’s.\n\n50 ","173":"\n\nQuiet again and cold. Few casualties. Fritz again got the line, now nearly to Luisenhof.\n\n51 Becaudles, C.R.S., March 11\n","174":"\n\nFrom 8 p.m. last night surprises innumerable. At 8 a runner – Ern turned up with word of relief coming, the 6th F. Amb. In an hour they turned up and took possession. Left all rations and at 9.20 left our posts, Whizz-Bang Corner, Luisenhof and Factory Corner – and started on to the A.D.S. Arrived Byzantin le Petit about midnight – they’d tea and ready for us – and a rum issue and turned in.\n\nMarch 10. Up at about 9 a.m., word that A and C sections were to move off by train at midday for Fricourt or Becaudles and attach ourselves to the 7 F. Amb. Arrived Becaudles Rest Camp about 2 p.m. and hearing from Cliff some of us were elected for the wards. Harold and self took on Mess work (and a bonzer job it’s proved). Tea at 4.45 and half of the section in one party about 8 off to Albert to see the Dandy show there – the one run by the A.I.F. A good show, two Sydney chaps amongst them, Harold Williams and Jimmy Little both from Liverpool, which I was and both worth listening to with their encores. I’d like to see Little again in \"The Prayer\" but … such prurience not for us. Even his first piece - a war piece brings too much with it. Back at the station, supper – the basic biscuits from Meaulte and Albert and Byzantin – pres. fruit and de Reske cigarettes.\n\nLast night the first night since Jan. 24 slept with tunic off.\n\n52\n\nWalking down to Albert yarning with Bill and Reg. Reg breaks into song and a longing to dinner.\n\nFor the last week I’ve dreamed of nothing but song and dances, sumptuous ballroom and beautiful women. Ye Gods to dance again! And I’ve slept to visions of all publications of the Riccardi Press - the Florentine Press and half of Babford books being mine - to visions of a large roomed rambling cottage well back in its own ground, of pictures by only Australians, Lindsay, Mark & White and Thea Proctor other sketches, drawings and paintings and books and furnishings all working in one great scheme of beauty and and comfort. Who to preside over it all?\n\n53 ","175":"\n\nToday a lovely sunny brilliant day. Must try and get something to read. The books I sent to Harry for some while back should be arriving some time now.\n\nMust get again \"Picture of Dorian Gray\".\n\n54 ","176":"\n\nHeavy rain late in the evening – just after coming back from across the road at the 14 Field Station: there met Troy Hoofe – in the section owing to a rupture. To bed and a restless night – a wild night almost.\n\nAfter cleaning Mess room this morning – to Meaulte with Nick to for a bath and a change. Back as dinner was finishing – and got the oil – the Major was \"extremely satisfied\" with the Mess table and the colours\" (the nice man). Out for a short walk with Toby – to the canteen in the remaining ruins of the Becaudles church – just the main door and tower standing – all the walls of the church itself naspoo. A subject for a Branguinesque sketch – the Gothic door of the tower countered across – layers on the two strips.\n\nTonight writing – one completed to Mother – answering letters received last night and one to Mat answering Xmas letter.\n\nIn the mail last night one very welcome one from Harry – the books asked for are on their way. Tres Bon, and one from \"Your sincere friend Violet B. Larcry – now who the hell is Violet B. Larcry. My name and unit she’s got from Mr. Fraser – she’s sent me packet of fags and she and her sister entertained 2000 soldiers kiddies just near Xmas to own Xmas tree: she’s a V.A.D. and loves the work – and she’s in an admiring mood: \"I think you brave boys are just fine: the work you do and hardships you have to put up with, so the least we girls can do is to try and cheer you lot up ever such a little. VERY nice. Struth! and the letter addressed 2nd A.G.H.\n\nI’ll Asquith this – wait and see and answer when the fags arrive: the writing’s strangely different in half a dozen paragraphs … methinks I smell a rat.\n\nV.B. Larcry, \"Gorom Dale\", 22 Court Road, D’Bay,","177":"\n\n55\n\nYesterday afternoon I forgot before to enter it, over at the Military Cemetary close alongside the road, near the Rd., French one in the vanished churches ground. In the French civil cemetary are about 40 Porters graves alongside the strange old graves, and the tombs and crucifixes are the supports of elaborate entanglements.\n\nIn the B.E.F. cemetary alongside, few of our chaps buried, a fair number of N. Zealanders – killed in action from Aug. to end of Sept. 1916.\n\nPlain square dull wood crosses for the most part, the long lines are full of dignity and the usual grave yard feeling is finely absent.\n\n56 March 13\n\nLetters written to Joy, Doreen, & Geoff. Left Becordel with Bill, Nick, Toby and another for Albert. Tea and early show of \"Anzac Coves\", one of the best I’ve seen, equal to any Dandy show. Harold in good form also Jimmy Little but not given much chance. \"Tragic Tom\" good – especially little hectic new act since and . Several choruses good and for troops only. \"Isn’t it strange\" –\n\nWe’ll be out for a rest,\n\nAnd Anzac pays 10\/- a day,\n\nGen. Birdwood says so,\n\nAnd he knows best,\n\nTo-to-toodly-ay, etc., etc.\n\nCalled at old Aust. Hosp. and met S. Metcalfe` of 7th Field. A chap with a great garden\n\n56\n\nand the long expected, given up hope of – books from Merridens, Vol. V. of Shakespere and Burns in Nelson’s new centenary lit. Gallipoli by Masefield – have among the artists of Shaw, and Quinneys of Vachell.\n\nAlready Andy’s read half of Gallipoli and wonders at it. Bill and half the section after it. Quinneys a great piece of writing – I read first in Liverpool last","178":" months. Harry was keen on it when he read it and recommended.\n","179":" far Harry D’s parcel hasn’t yet arrived.\n\n57\n\nThe oil is that Baupaume has been occupied by our chaps. The prayers of the heavens go up that this is true.\n\n59\n\nOn the night of Monday, the first home letter directly addressed from the Dad and a great letter – one to be kept.\n\n59\n\nSyd. M. heard the \"typical Australian\" at a church service at the Anzac Cove hall in Albert. As I remember the telling of it ..\n\n\"He sat in front of us, and as he came in I heard him say to his mate, ‘Gaws ‘truth, this’s the first time I’ve been inside a church’ – the hall, you know it – ‘for 15 years. Its rather high church, there are two candles on either side of a crucifix, you know’. Well just as the Padre started his service, he knocked one of the candles over. The chap in front turns to his mate, - and in a whisper, not intending to be funny for the benefit of chaps around, he whispered – I’ll bet he said ‘---- it’ under ‘is breath.\"\n\n60\n\nIn his sleep talks: \"an Inf. song, sleeping next to Ridge – Come out of that bloody shell hole, Fritz!\"\n\n61\n\nLast night in Albert – having cocoa at C.F. Buffet watching passing mounted company of our chaps – from watering lines – couldn’t help but be struck by individual picture presented, consummate grace, as of young Kings – lords of all. The ride worthy and long. Even without looking for it, the difference in the mounted Tommy and in our men is obvious.\n\n62\n\nArrived as turning in – parcel of books from Harry D. – at Boulogne.\n\nLibrary now, \"The Honeysuckle\" by d’Annuzio, Keats, \"The Little Minister\", Barrie, \"City of Beautiful Nonsense\", Thurston, \"Love Among the Artists\", Shaw, Burns’ \"Shakespere\", Gallipoli\", Masefield.\n\n63 ","180":"\n\n‘Things were amok’: so Nick and self decided on a ‘beano’: champagne, cakes, biscuits, dates and preserved fruits: 10 Francs on each, and the marquee the banquetting hall. All the chaps jumped to it, we’d all promised ourselves a spread when we came out this time and Cliff joined in. Toby, Bill, Nick and self to Albert, packs up and we the purchasing party. Though we ‘came a grouter’ on the cakes, biscuits made up. It started sedately, ended extravagantly and splendidly. Champagne a tenth each and half doz. Burgundy as sweetener. Toasts were, Syd and Billy, the two new M.M.’s, proposed by Tommy, seconded by Nick, and \"The Sentimental Bloke and Australia\" proposed by self in place of recitation, – and drunk standing with no seconding. Apres? toasts informal: Bill obsessed by \"Alaska\" – Max on his audience, we theirs; presentation to Ridge of old and sang: Songs out of tune. We were all half gone – and Max took it hardly, when I told him to,\n\nTake thy face hence, I am sick at heart. \n\nOmar obsessed me and by time I’d finished, I was in bed.\n\nA bonzer evening and we go in again.\n\nshortly.\n\nThe Egyptians of old brought to their feasts the mummy of one dead – as a terrible reminder, and as an incentive too.\n\nMake the most of what ye yet may spend,\n\nBefore ye too into the dust descend.\n\nLast night once invisible but tangible were Hyssop, Poppea and a future.\n\n64 ","181":"\n\nOn the night of","182":" from Fricourt – \"The Everlasting Mercy\" of Masefield: read it in Mess Tent Sunday morning. Finished on 17 \"Quinneys\" – the second reading, and started Barrie’s \"Little Minister\". Tonight a letter from Times Book Club – \"Romance of Jean Chapel\" on its way. \"Prose Journal\" binding: !! Tonight – after going through gas at Gas School – at the Anzac Coves in Albert: H. Williams left the show – and tonight returns. Last night in at Church service in hall – but a barren sermon – goodly singing. Apse the band – and overture of \"Lohengrin\".\n\n65 ","183":"\n\nBorrowed \"The Bookman 1916\" Christmas number. Amongst best received and noted – \n\n\"Mr. Porter\" by Herbert Ward, Sketches etc. 7\/6, de luxe 21\/-\n\n\"The Girl and the Farm\", Phillpotts, illus. by Branguin in color & B & W, 6\/-, de luxe 42\/-\n\n\"Human Tragedy\", Anatole France, illus.","184":"\n\n\"The Antique Greek Dance\", Maurice Emmanuel, 15\/-\n\nTales from Hans C. Anderson, illus. by Harry Clarke, 20\/-, 30\/-, £3.3.0\n\n66\n\nWrote to Times Book Club for information on available books of Max Beerbohm, and to order Phillpotts \"Girl and the Farm\", 6\/- edition – and to order when ready copy of Brooke’s \"Poems\". Also to Merridens for \"Men of Letters\" by Dixon Scott and Wilde’s \"Ballade of Reading Gaol\". The day cold – the trees like pencil drawings in grey .\n\n67\n\nThe war’s progress? ‘Tres bon’. 8 p.m. – we’re all waiting for Tommy whose gone to Albert for the paper.\n\n68\n\nAveling Wood, N.E. Corner,","185":"\n\n\"The Chateau\"\n\n\"Holy Wars, you have struck it!\n\nAnd where’s the next and the other dump?\"\n\nCrucifix Corner, down the road, and\n\nLancashire Dump up there somewhere!\"\n\nThe two detailed first hopped out for the Chateau: then we turned, and down to Crucifix Corner. About half a mile further down we found it, one of those tall wrought iron crosses standing amongst tall trees formally arranged that, when the trees are green with the grass, are as beautiful in their emotional effect as any cathedral. This \"Crucifix Corner\" was not of these – the trees were there yes: but they were dead shattered trunks standing deep in mud.\n\nTwo men we left there.\n\nBilly and myself then for \"Lancashire Dump\".\n\nWe found it seemingly miles away – almost at the end of a long straight road – \"Lancashire Dump\" printed on a board – \"No bon, compris?\" pencilled underneath. It was a dump of picks, shovels, duckboards and trench frames: and the chap in charge, a R.E. man, knew nothing of our coming …. We spotted some long shacks, at the corner of the wood – and there, an old Tommy C.C.S. we decided on. Altogether we found there three guards – chaps of different Tommy Ambulances who’d lately arrived to \"take over and guard\": we were the fourth claimants to the guardianship. The best place for living we found unoccupied: an officers ward – six spring beds already made up, and three screens and a fire ready.\n\nMidday the A.D.M.S. – of one of the Tommy Divisions turned up and – \"wondered\". He knew nothing of us\n\nobviously he thought we were \"coming on the grouter\": he left us though, and later the Q.M. of one of the other guards turned up. He suggested we’d come to the wrong place - that we saw our O.C. This was a bit sudden, and we’re still here – spring beds brigade, a fire, and blankets innumerable – and a pillow with a clean pillow slip.\n\nThe days here as changeable as a bookman’s moods: snow and bitter cold – then sun and lovely warmth.\n\nAnd so to bed – after reading some more of \"The Little Minister\" of the whimsical Barrie.\n\n69\n\nFrom \"dug-out\" hunting the library’s grown, \"Ginger Mick\", \"Keats\", \"Burns\", \"Shakespere\", \"Little Minister\", \"Henry of Navarre\", \"City of Beautiful Nonsense\", \"The Master Mummer\", \"Barchester Towers\", & Nashs and other bags, \"Candle in the Wind\".\n\nLeft at Becordel with Nick parceled up, \"The Everlasting Mercy\" and \"The Honeysuckle\".\n\n70\n\nFor the perfection of text, this from \"The Times Book Club\" –\n\nWith regard to the \"Hermit of Zion Chapel, we regret that we are not able to trace such a work and \"Prose Fanciers\"? is reported by the publishers as binding. As we do not know when this is likely to be ready, we have ventured to send a copy of \"Romance of Zion Chapel\" and hope that in so doing, we have acted in accordance with your wishes.\n\n71 ","186":"\n\nLast night after several chapters of Barrie, read for a while Songs of Burns. Found one poem of perfection, \"Song of Death\" on page 437, Nelson edition.\n\nThou grim King of terrors, thou life’s gloomy foe,\n\nGo, frighten the coward and slave;\n\nGo, teach them to tremble, fell tyrant, but know\n\nNo terrors hast thou for the brave.\n\n72 Sunday, March 25\n\nTwelve months ago today – the start of our journey to France. The Dermatological left at 7.45, No. 3 Aux. at 8.15, Cain at 9.55, Alex at midday, the 26, and the arrival at Marseille at daybreak, April 1.\n\nIt was a perfect trip across, all but one day of rough weather in the Gulf of Lyons. Malta, passed on the 29, was a lovely sight, and a most wonderful colour effect. Life belt drill was at least one a day, and the evenings spent in singing to Nick’s violin accompaniment down on the aft deck ended the day well.\n\n73\n\nYesterday Billy and self to Becordel after rations – and in the hope of pay. While away one guard handed over to another, so we’re next. This morning the lot of the last lot turned up – and \"whatever are you Australians doin’ here!\" Posted while at Becordel letter to Mother.\n\n74\n\nAt Becordel – in the receiving hut found – and pocketed – a small pocket edition of \"The Imitation of Christ\" – Thomas A. Kempis. On the fly leaf the name of McGavin, Serj, 7th L.H., A.I.F. 1914 has a second claimant, F. Molony","187":" F. Amb., A.I.F., 1916, 1917. Tonight I started it, and finished the first chapter, make this entry.\n\nStudy therefore to withdraw thy heart from the love of visible things, and to turn itself to things invisible. For they, who follow their sensuality, defile conscience and lose the grace of God.\n\n75\n\nTo enter before one of the studies in Symons \"Spiritual Adventures: -\n\nWhat signifies making a great dispute about abstinence and obscure matters, for the being ignorant of which we shall not be questioned at the Day of Judgement and Revelation … for Kipling’s \"Tomalson\", Also A. Kempis, Chap. 3, 5B.\n\n76 Mon. 27\n\nJust been reading \"Ginger Mick\" – it’s a dag of a book, Max P.\n\n77 \"Senlis\" ","188":"\n\nYesterday from Aveluy Wood through Albert to Becordel: arrived there 15 minutes, orders to \"pack up\" again and parade at Orderley Room in 10 minutes – to guard another dump: this time an old Rest Station. Motored to here, Senlis, with Billy, Max and Blake – and a ‘cushier’ guard than Aveluy.\n\n78\n\nAt Becordel Toby had small parcel for self – Lethaby’s \"Architecture\", \"Art of Theatre\" of Craig’s out of print – so tonight wrote to Hoofe asking for Tagore’s \"The Hungry Stones\". Paid at Becordel 100 Francs.\n\n79\n\nThe Station, on the crest of a hill overlooking Senlis – a once typically French village in the hollow, amongst its trees, surrounding its church and Chateau.\n\nWe look over from the No. 5 F. Amb. of the Tommies – and few rations – margarine – half a case, Biscuits, Huntly and Palmers No. 5, a side of Beef (a mutton, I think beef), Bacon, ten hams, cases of Soup, Pork and Beans and Ideal Milk. Bread is only lacking – or will be in a few days: then if we can’t draw from the town Mayor – a part of the civilian population are back – if when later – we’ll have to draw from Becordel.\n\nThe N.E. corner of Aveluy Wood that we left yesterday was good, this is heaven: no comfort is lacking – even porrige, eggs and steak: \"Laus Deo\" – may it last for weeks – aye – months. Even a case of books we unearthed – amongst them two pocket editions of Shakespere and Locke’s \"Fortunate Youth\".\n\nThe civilian population: out of all the barns and old billeting cottages, say a dozen, are now occupied – and in half of these there’s a miniature canteen.\n\nThis morning early, say 7.30, Max woke us up: \"did we hear anyone?\" In one of the near huts there were high voices and high jinks: we turned over. Max volunteered to investigate. Silence after a few minutes – and then \"Ah, Bill! Bill\"!!\n\nWe turned out, and Max came in. Some of these \"French ----\" were pinching the stove from the Mess hut – half the meat had gone, also a case of Pork and Beans.\n\nWe went after them: they – two women 300 yards down just entering the fringe of village and two hang just behind them. We drove them to earth – their cottage – and looked for the town Mayor – and couldn’t find him. We came back – by the road this time – and round the corner full into us blows an old little dame, apron bulging with loot, and three hurricane lamps swinging on her arm. An officer in the camp had given them her!! Reluctantly after threats she gave up the booty – and then chased us for a \"souvenir\".\n\nThis afternoon under the portent of buying chocolate, I went into the cottage and traced the first looters too: when I opened the door, a woman, lank and ghastly faced, rose, recognised the hat, and started back. Thank the immortal God the\n\nTown Mayor wasn’t to be found. Poor devil it’d have meant something pretty hard for her – which for us, if she’d been successful in getting the stores away – with an inquiry and most likely nothing more.\n\nPoor devils, they fleece us when we buy from them, but it seems their gains aren’t too heavy for them to bear.\n\n80 ","189":"\n\nA quiet day – the water still but cross currents running under. However if storms are brewing they’ll break tomorrow.\n\nTonight down to the village to buy eggs of Madam for tea: in one street met two of the","190":" Div. boys, two Apollos seeking their Daphnes.\n\nFor tea tonight had over one of the 3rd Field chaps from a nearby village, a decent chap, dark and quiet.\n\n81 ","191":"\n\nMarch 30 – relieved by bearers of 7th Field at Senlis – and trucked across country, through Melincourt and Lavieville to Buire, at Lavieville had coffee, at little farmhouse, and heard all good of ‘Australians’ and much bad of Tommies. Slept in Regular hut.\n\n82\n\nWakened this morning – between 4 and 5 – someone outside with the oil that we were moving off some time during the morning, patients and all. We turned over –","192":" … and \"came a gutzer!\"\n\nAll day loading lorries and wagons, taking down tents, etc., and dismantling station. Tonight walked with Toby and Nick to Mericourt and there tea, eggs and coffee.\n\nTonight mail, 4 papers, one Bulletin and three old mail from Joyce.\n\nLast night another celebration – champagne and cake – Harold, Toby and self.\n\n83\n\nToday starts my second year of France.\n\n84\n\nThe hand of fate has heavily descended upon Jimmy Smith: yesterday in Mess I sighted him, and if it hadn’t been for his manner I’d have passed him, merely struck by an appearing close resemblance. One of Harry’s letters said he’d gone back to Australia. The tale – Blighty to be boarded, has refused to go before them, and he’s getting into a draft for France. Voila: (Entry 330)\n\nPaddy’s back in the same draft – and Jimmy’s lead them all to believe that he’s an 8th Field man …\n\n85 April 2\n\nStriking tents etc.: told off with Harold and Bill to parade orderley room 10 a.m. with packs etc. Just before met King: he’s up to Aveluy in the same car, and tonight a good yarn with him.\n\nNow just outside Aveluy, in the chateau of Baron Rothschild: once evidently a most perfectly serene chateau, now a wreck. Billetted in stables - elaborate buildings. Loft offers good suggestion for living room and studio.\n\nUnder hipped roof beams showing, studio under one mansard – Elizabethan stairs under other. Work out next time in line.\n\n86 ","193":"\n\nWalked to Albert – to Bonzer theatre with Clarrie, King, Stan, Johno last night: tonight in Albert again with Nick, and a good yarn – one of those that do you good.\n\nPaper has it that America an ally: opinions expressed by several of the lads – \"--- in the ---- we don’t want ‘em\".\n\n87\n\nConsider seriously mansard roofs and juggle with them against accepted modes of use.\n\n88 ","194":"\n\nGeoff’s Birthday, and Good Friday.\n\nLeft Aveluy about 1.30 p.m., marched full kit up to Byzantin le Petit, through Albert.\n\nWeather as changeable as a woman’s moods: lovely sunshine, cloud then to black and rain: sun again, and darkness again. Now it’s raining dully and stubbornly. Here there doesn’t seem to be a gun in any of the old places – already our old A.D.S. is being designed for a C.R.S., A.D.S. somewhere beyond Bapaume. The ‘oil’ is that we’re – the 1st Bearers, are not going on this stunt: Tomorrow will show.\n\nNew Col., Lt. Col. Brennen of","195":" F. Amb.: he’s now on leave in Blighty.\n\n89\n\nMail last night – \"The Girl and the Farm\", so far Romance of Zion Chapel hasn’t turned up yet. Finished \"Love Among the Artists\" and enjoyed it. It’s a book to be read in big doses and to think on.\n\nSent parcel of P.C.’s to Bett.\n\n90 April\n\nYesterday after breakfast, kits up, and from Byzantin le Petit, past High Wood, then on to the old light rail, past Turks Dump, along the North Road, past Factory Corner, Luisenhof Farm and the old crater, through Thilloy and into Bapaume.\n\nDog tired and weary, in the afternoon, Swiss tents to go up and \"tenting\" till 6 p.m. Then for a walk to the higher part of the city evidently over a strongly defended portion before the war a beauty spot, now devastated remains.\n\nBapaume ? a city of not one whole house, or not one place of beauty: everything, houses, church, Town Hall, residential districts, etc., all are rambling ruins.\n\nEven the trees on the boulevard, in places have been deliberately sawn down, not to be thrown across roads or for any military use but by mere futile rage and hate and love of \"Kaiser\". Every tree, that is pine tree has had the top sawn or chopped off.\n\nFritz! You’re ----: you’re a Boche.\n\n91\n\nVelu Tuesday after Easter\n\nMidmorning: now the line is comparatively quiet and little is in the air.\n\nSunday back in Bapaume, at the M.D.S. parade at 7 a.m., fatigue parade at 8.30. The morning paving a Swiss cottage tent – one of the three we’d put up the day before – with bricks, etc., and the afternoon filling and cleaning lamps and flame stoves.\n\nFor a walk then after tea to the remains of the Church – a solid stone building once – with more architectural pretension than architecture – now a roofless and half high wall wreck. Columns from the aisle all seem to have fallen towards the centre, and underneath thousands of old skulls strewn in one of the old vault chambers. Then to the Civil Cemetary – to see the Boche monument: a solid lental pin finishing in 4 steps and surrounded by a roughly hewn ball. On one side – that facing the annexe – the corner bounded by double line of Boche graves – is a strongly carved Iron Cross and a dedication in gilt sunk letters. By a name on the back the illustrious Architect is one Erkmann .\n\nRough sketch – Plan of position of Boche graves and monument. Main walk leads to Crucifix. Circle shaded monument of 1871 to the French Dead. Outer line - rim of trained trees, and two single parallels on either side of walk, double rim of graves. The French graves that interfered with their scheme? Across the smooth inscription face of the monument in hand writing. Fritz, you bloody ----.\n\nArrived back at the M.D.S. after walk about 7.30, and we moved off with full gear up at 8.15 – and around at Velu station – the rough wreck at midnight.\n\nBombardment such as I’ve not heard before about 4 a.m. yesterday.\n\nAt 6, back in Velu village and on squad work.\n\nFritz prisoners – about 200 saved the carrying situation – 4 of them to a\n\nstretcher.\n\nAll day receiving, dressing and loading cars for A.D.S.\n\nThe lads took the village Hermies in such a style as only they could – and they received their wounds as they always do.\n\nTurned in about midnight last night and up early this morning.\n\nRations, 1 load to 14 men and bacon in proportion. Rumours of all kinds around of big victories, of great prisoners and elation.\n\nThree died on stretchers here yesterday, and to be buried today.\n\nToday if I get the chance, I’ll read some of \"Romeo and Juliet\".\n\n92\n\nIn the Bapaume Cemetary, at the end of the main entry walk, behind the crucifix the Boche has a great semicircle of officers graves, graves of Majors, Capts. and Lieutenants, the ground over them is heavily hidden in trailed ivy, held in by a low wooden ledge, and each individual grave has its own separate headstone. These are perfection of their kind: about 3.4 high and 20\" wide, thick dull grey stone, reasonably simple and the proportions in lettering and plan design finely wrought.\n\nEach is different and glaringly so, different as the long terraces of houses and public buildings of Marseille.\n\n93\n\nYesterday morning left La for an outpost in the fields. Party, Capt. Lee, Billy, two others of squad, nice men, Finlay, Finnes, and two unknowns. Cold afternoon – snow and blizzard.\n\n94\n\nYesterday confirmed the word that one of our squads leaving for the Batt. had been knocked. The squad – Blaidem, Harry through the back the shell piece penetrating into the abdomen. Max and Jack Batchker the other two, the 4, one I don’t know.\n\n95\n\nThis afternoon over to the chateau near Velu to grout from the 3rd Batt. canteen. Managed cigarettes and but nothing else about.\n\n96\n\nCliff brings word of a big mail for us with tomorrow’s rations.\n\n97\n\nSome of the lighter side of our advance – of the Rabelaisian side.\n\nIn Bapaume – hanging from the window of one of the partially standing villas – a pair of women’s ---: underneath \"Australia will be there!\"\n\nHanging from the half remaining iron bracket of an old estaminet’s sign, a chamber – and the estaminet renamed, \"Chamber of Horrors\", and on an old post in the middle of a wreck, an old civilian hat – \"The one we’re all after\".\n\nAnd prisoners – the art of ratting them. New tales as told of Frank: Frank according now to tradition, on Monday \"bought 20 Boches for 5 francs\" and if his bag is the criteria, then he invested well. Frank’s speciality is watches.\n\nWe were yarning last night, Bill and self. Bill had just brought down a walker, and comparing notes of work during the after attack of Hermies.\n\nI said something about one of our chaps wearing a Boche cap – and so losing his turn for dressing. \"I remember that chap!\" says Bill – \"Frank sighted his arm lying over the blanket and secretly sighted a wallet. Frank dived at it – and \"Chuck it, lad – you’re the third that’s been after that.\"\n\n98\n\nMail tonight – 3 letters and one from Times Book Club. One from Mater, and Geoff and one Betty. Will keep Mater’s only.\n\nTimes B.C. sends list of Beerbohm’s work and will send for \"Yet Again\", 5\/-, Happy Hypocrite out of print.\n\nTroops till late – after rum issue round a brazier yarning. Capt. Lee leader and we spent a good night.\n\n99 April 13\n\n13 in the post, the date the 13, and the day Friday, and my 13th month in France – and my 3rd stunt.\n\n100\n\nNo. 100 entry last year – a letter to Times B. Club, this time one ordering Beerbohm’s \"Yet Again\".\n\n101\n\nBooks for expecting – from Merridens Wilde’s \"Ballad of Reading Gaol\" and Dixon Scott’s \"Man of Letters\". From Phyllis, W.B. Yeats \"Responsibilities and other Poems\" and from Hoofe Tagore’s \"Hungry Stones and other Tales\" and from Erskine Macdonalds, the last three numbers of The Poetry Review.\n\nFrom The Times Book Club le Gallienne’s Romance of Zion Chapel – but judging by its time in coming - napoo.\n\n102\n\nToday placed our position in the valley. The Post is equi-distant from the four villages – Beaumetz les Cambrai – Velu – Doignies and Hermies.\n\n103 1 a.m., April 14\n\nAt 8 p.m. yesterday Capt. North – M.O., 3rd Batt. turned up for advice about bearers for tonight – or this night’s stunt – an advance on the Div. front of 1000 yds. Billie runner to resting post to take them up to new R.L.R., once squad here up to first Relay, self runner back to Cliff’s post and wagon rendavous – for comforts and another Arab wagon. Back to post in evening and still waiting for cases. Capt. Lee turned in midnight and as yet nothing’s doing. The night earlier, quiet and cold: in this post the fire warm and in anticipation of blankets most desirable. Just after tea yesterday a Fritz observation baloon was brought down in flames – leaving a great cloud smoke query above the clear cut horizon.\n\nAt sunset the sky and plain effect very lovely: sky of a most weird blue green, and the hill a mellow green blue.\n\n104\n\nLate morning – The sum total of casualties, ten stretcher cases, one head, shoulder torn and big, and the other abdominal: both M. gun wounds. The whole endeavour, as far as we’ve the oil as yet seems an entire success. Very heavy bombardments all early now till daybreak on our left: when the second take over from the 4th.\n\n105\n\nIn the iron dugout behind – this morning the discussion turned on ‘Gutzers’ we’ve come - ours yesterday – we spent almost the entire day building surface dugouts – building in them fireplaces and even furnishing the main one with an ingle fireplace: and in the evening turning in time the two squads had to turn out and go up to the R.A.P. Bill and self runners and so here. This morning Capt. Lee has just gone up with a Major of the 2nd F. and our job in this place hangs in the balance.\n\n106\n\nBillie just asked Capt. Lee if he could get back to the A.D.S. to change his high boots for ankles. \"Oh, there’s a nice little Boche up there, he’s been dead 4 or 5 days but he’s got a jolly nice pair on!\" \"Oh, but they’re to the calf on!\" \"No they’re good ankle ones.\"\n\n107\n\nIn the grounds of a once beautiful chateau near Velu, a great Boche cemetary. Some fine crosses amongst the number, and some of the graves lately opened by his own shells. Tho’ when he possessed it, used the chateau as a C.C.S.\n\n108 April 15\n\nThis morning early heavy bombardments along this sector by the Boche. At 6 arrived one stretcher case – one of a ration fatigue of the 3rd Batt. – a 22 or 23rd Rein. – not yet allotted to any particular Coy. At about 7 word came that the main party had wandered into the Boche line, and there were a lot of wounded about. One squad left here and went up with stretchers to R.A.P. No word or rumour for about 2 hours – then they started to come through. About 18 stretchers came through – straight from the line and we acted as R.A.P. Amongst walkers, Ken Saxby, a rifle bullet through his R. Breast and out under his arm … had walked from the line without help and was exhausted when he arrived.\n\nFritz tried to advance, the","196":" Brigade, rumour has it has been badly cut up, and the 2 Batt. very low in strength.\n\nThe Boche had orders to advance 3 miles, he captured some of our guns where he got through, gleefully gloated over the trophies and then we recaptured them with 600 prisoners. In front already they’ve counted 2200 Boche dead. Now if he had advanced\n\nwhat would there have been between here and Bapaume ….\n\n109\n\nOne of the casualties passed by Cliff back at the chateau this morning – a tommy knocked by a bomb: he’d been after wood and lifting a small beam piece pulled a string tied to it and a Boche bomb. Directly I heard it I seemed to remember going exploring in a great palace, but in fear of a similar happening – explosive line attached to anything moved.\n\n110 ","197":"\n\nIt was the 5, 6, 7 Battery the Boche yesterday captured – and then in our rally we got them back. Killed about 1200 and of necessity had to capture 600 prisoners.\n\nThe Boche’s counterattack was the worst move he’s yet taken: it’s the first time we’ve been repulsed – and although we immediately got back all we’d lost, the boys swore that they’ll never again take prisoners.\n\n111\n\nBrown’s squad here from Cliff’s post in the wood. Davies’ squad up at next post relieving Nick’s squad: tomorrow Ern’s goes up to R.A.P., today he cooks …\n\n112\n\nThis morning fine and windy – went alone for a walk over hills near Hermies. If only the sun was alive, and the wind dead … the grass as in summer …\n\n113 April 17, ‘17\n\nA mail in tonight – one from Sister Weigall, one from Betty from Manly and one from Matt … Matt’s long, ready and newsy as usual.\n\nToday is the canal for water – to the A.D.S. for supplies for 2nd Batt. and so to bed.\n\nThe Boche – according to 2nd Boys, is massing before us on our R. Tomorrow we move from here to new position. Ern’s squad up all today building new dugout, and now tonight 4 more moving trees from road for Arab wagon to carry on. Yesterday we’re back to Cliff’s past, record time in rain and darkness to get from transport book of Stacpoole’s - Street of the Flute Player. Read 4 chapters and turned in. Only one case through – a Capt. sick: kept him against instr.\n\n114\n\nStrange dream last night of Gerald, and my advice to him re planning against the Boche with example tales from Factory Corner plyings, and a packet of photographs he brought from Aussy to me of Rosalind. R in strange unnatural garmentings. Also he’d several boxes of chocolate for me that somehow or other I didn’t get. Must answer his card by more than a \"whizz bang\".\n\n115\n\nWeather today as the weather on this same date last year – cold – damnably cold, rainy and miserable.\n\n116 ","198":"\n\nA clearer day than yesterday: left old station relay in the valley and moved up to sunken road this side of Hermies. Good dressing post. Billy and self on dressing, running, and alternately gas guard … Last night, after a dopey day turned in and alone in the dugout exploded a Hymn of Hate on the day, weather and the Boche.\n\n117\n\nOn Duty tonight first shift – 8 to midnight, last night on last – 4 till 8 a.m. Six through then, and three during the day. Finished this morning covering over mud outside, and this afternoon built up end wall of sandbags and on stretcher dugout. Tonight a mail – which I’ll read when Billy and Lofty have P.O.Q’d.\n\nThen – with the fire good – a comfortable seat and a decent home - if the Boche fail to knock any of the boys in.\n\n118 10 p.m.\n\nBilly and Lofty back for bed – and my letters read. One from Dad – 4 pages Feb. 6, one from Grandma 4 pages Feb. 10, and two from the Mater,","199":" page and 4 pages","200":" Now I’m in debt as to letters all round. Also amongst letters a paper – the Bulletin","201":"\n\n119\n\nThis is the stint – that back at Becordal after, the last 7 weeks in, I had such a feeling that I’d be better out of it for a while …\n\n120 Midnight 20-21 April 20\n\nThe past day warmer and brighter than any of last several. Full dugout early this morning – all French part of 2nd Batt. At 9 the 18 pounder batteries behind us brought up to in between our dugout two of their guns, and during day fired 18 50 rounds…. After 5 p.m. on the Boche replied with 4 11\" stuff had driven the battery out with before. The guns back to their positions early before darkness.\n\nGrouting in the village and about the R.A.P. Bay… 1 sandbag of white turnips, 1 perambulator… and a small number of daffodils. Grouted also, of importance above all these, some small exercise books for writing … one half filled by short sentences in French and Deutsch.\n\n121\n\n1.30 a.m. From Headquarters warning that we’re sending gas over at 3 – and Capt. Lee’s been grouting all day for a Bon helmet.\n\n122\n\n4.10 a.m. Finished Book 1 of \"Endymion\", read page on one of first poems in book and part of Lethaby’s Architecture. Last chapter of the book clear and well written and well readable.\n\nHalf an hour ago about bombardment in the sector quietened down – and this instant the 18 pounders behind have opened again. On the left by the shelling evidently the tommies have had and are still having a bit of a stunt.\n\n123 5.15 a.m. April 22\n\nYesterday about 20 T feet cases evacuated from 2nd Batt., no wounded. Now in the line the bad weather of last week and early this week is responsible for a terrible weakening of the Battalions. If it goes on much longer the","202":" will have to be withdrawn for a while – till reinforcements arrive … where from? God knows.\n\n124\n\nFrom a Sig. of the","203":" just in, wounded laying lines learn that \"Tim\" is an officer in that Batt. Must drop him a line. The Sig. chap here waiting is fixing his killed cobber’s papers and effects to send to his mother… of their son that sailed away a few papers and cards return.\n\nJust now, a shelling night. The Boche landed hereabouts a lot of his shells but did no damage.\n\n125\n\nMat in his last letter – of Tasmania from Goulburn – wondering at the beauty of a sunrise in the Island suddenly realises the difference in the peace and beauty than amid the horror and blood here … But even here beauty too as she ever was: even a hideously ruined, smashed and wreaked village has its beautiful effects – skeleton silhouettes against wonderful cloud banked skies – a skylark carolling over the rotting dead of no-mans land, and the bright sun patchy through the clouds on the endless hills.\n\n126\n\nTonight duty till midnight: now 9.40. There’s been the last half hour a heavy bombardment by the","204":" – and his S.O. have gone up. Now with exception of occasional long distance shell passing and our 18 pounders bark with short staccato choruses of machine gun, line quiet. To read and finish Hamlet.\n\nRumours of relief confirmed today and most probably the 32nd Tommy F.A. will relieve us tomorrow or Tuesday.\n\nA quiet uneventful day – at midnight last night I woke from a troubled sleep and lay awake till Lofty called me. A trip into Hermies for wood – one to the rail for coke and one to Cliff’s post to buy grouted books.\n\n127 ","205":"\n\nOne entry only -\n\nYesterday received in letters from home one from Geoff in answer to one I sent him from Longueval … and he doesn’t agree with what I wrote. Well I didn’t expect him to and may in this week write to the dad to advise him to let him come away.\n\n128 ","206":"\n\nYesterday morning parade at 9 a.m. and the morning filled in at Y.M.C.A. and about the camp – then building in at end of Marquee stage for the night’s concert. The afternoon at 1 p.m. fell in, and marched to Albert – 4 miles for a bath. Dinner in three \"Swiss Cottage\" tents – soup, Rabbit and sauce – Mutton and Beans – Dumpling and Custard – jelly and custard. Mess arranged in two long lines of tables – candlelight by candles every 3 feet. The concert good – in parts. George Ballard singing far and away above remainder of programme. Two sisters from 5th Army Operating Centre, between Capts. Lee and Hunt made several anxious moments for a lot of us when \"Humouresque\" was the item. If they hadn’t been there, I think it would have gone far better … that Antiphonean wit – loud and inconsequent so typical of the Army, and but absolutely impersonal would have without doubt filled half the programme.\n","207":" we were relieved from Hermies. The last happening there was the terrible wreckage of the bodies of an anti-aircraft crew. The shell must have landed directly alongside and the whole of the gun crew, in at the time were blown to pieces. We moved their bodies in blankets to a nearby quarry. Even for some time after he’d got the gun the Boche was still fielding for it … and at artillery he shines, there his courage and heroism is real and mighty. The way he counterattacked early after Hermies, the way he fought in the taking of Hermies shewed his real courage. It’s dead everywhere – half of whom had tried the \"Merry \" stunt.\n\nThe 33rd R.A.M.C. relieved us – they’ve been out of the line the last six months.\n\nMarched from Lebonquire to Bapaume – the night in that city of horror and terror and off the next morning – marching to Pozieres straight along the Albert-Bapaume Road. A cold night but a good sleep.\n\n130\n\nAt Bapaume a mail – one from Gerald and papers Bulletins from the Dad. Thomas Burke’s \"Limehouse Nights\" reviewed in Bulletin I must get. At Pozieres three \"Poetry Reviews\" and \"The Outpost\" (Poems) and Tagore’s \"Hungry Stones\". Read on the night of","208":" \"The Girl and the Farm\" in bed and yesterday morning sent it home.\n\n131 ","209":"\n\nWrote tonight to Violet Lancry, Phyllis & Jack: yesterday to Mother and in it advised her that as things stood it seemed the best thing for Geoff to be given his way. Sorry after I’d posted letter I’d not put it as I did.\n\nCold and windy. Fatigues filling shell holes. Kit inspection and the usual Military advice on differences – if you can’t make them up honourably then make them up dishonestly.\n\n132\n\nTonight’s mail \"Responsibilities\" by Yeats and a letter from Phyllis.\n\n133 ","210":"\n\nYesterday’s morning parade – Prizes 3 for each section for the \"nicestly dressed\". Paddy a winner and all his boys borrowed: result – he’d a day off. Consequently leave to Amiens – and he’s not back yet.\n\nToday parade at 2 full pack and gun up – all stuff left in Marquee …. Michael Hunt, M.C., again doubly proved himself an active member of a family barren of marriage for the last century.\n\n134\n\nReading lately the short tales in Tagore’s \"Hungry Stones\". Of short stories though almost all take their place with any of the great short stories. \"Victory\" and \"Life and Death\" are beautiful and \"Life & Death\" all terrible.\n\n135\n\nSunday morning Toby, Clarrie, Nick, Murph and self started out to walk to ‘where Thiepval was, and dead men are’: Nick and self discoursed on little green patch and lay savouring this hour – while the others went horror hunting.\n\n136 ","211":"\n\nA big stunt’s in the air: the oil is, and has been since Sunday, that 1000000 men are ‘going over’ – 20000000 in support and on a 90 mile front.\n\nFatigue – digging in the morning as usual, and gas helmet drill this afternoon. Leave to Amiens tomorrow ‘cut out’.\n\n132 ","212":"\n\nNew journal started, and this yet to be finished.\n\n138\n\nTo reconstruct from the day we left here – awakened early, and all bearers, motored up to the M.D.S. at Veulx.\n\nAt 8 a.m. all bearers left here (Pozieres) motored to Veulx, and there spent the whole day – a hot full summer day – waiting on one of the open spaces, overlooking ruined Veulx, waiting as reserves.\n\nAt 5 p.m. squads were made out, Billy, Hagan, Max and self. By 9 we were in the second sunken road in the fighting area, alongside an aid post waiting again. In a cloud of gas that the Boche sent over, Hagan and Medcalfe were gassed – so the squad broken. Ten more minutes waiting, then the whole two sections started forward again – through barrage of H.E. and shrapnel – machine gunfire and tear and cloud gas. It was a nightmare trip only describable by Poe. We arrived at the R.A.P. established in a railway embankment about 200 yds. long – and started carrying immediately.\n\nOur squad started again after Hagan’s packing up with Leask, Marley, Billy and self. After second carry, Leask was killed, and Marley badly wounded. The squad remade a third time – Roach and Mac, and continued on all the next day with relief at 9 p.m. Back then to the sunken road, our first hot drink, then on again through Norieul to another sunken road and then in rough funk holes, slept till morning of the third\n\nday till 10 a.m. There till 5 then back to first sunken Road carrying from there to wagon behind second ridge towards A.D.S.\n\nDuring that night I guided party of another Amb. to sunken road relay in valley from the R.A.P. (embankment) and acted as driver in between wagon trips. At midnight a Boche shell got two wagon loads of ammunit. – and shattered one 40 R.E.s, wounded terribly a lot more.\n\nAt 10 the","213":" morning, back to M.D.S., and turned in. Then the following day – night, day, and in again 6th morning back to old Embankment position. Carrying there all night and day – casualties though only half they were and shelling half as bad. No casualties. Returned at 10 p.m. the 7th evening, and back to sunken Road. Then at midnight on to A.D.S., and at 3 a.m. the 8th day on to M.D.S.\n\nWe had breakfast at 5 a.m. – and waited.\n\nThe M.D.S. was shelled the day before and was moving – and they shelled it again while we were there with damnable H.V. shells.\n\nWe left there at 11, by the light tram of the Decaulte track and arrived at Bapaume about 2 p.m. Had lunch, and marched on to Beaulincourt – joined up the 2nd F. Amb.\n\nSlept out that night in the open, and the next day, after an inspection by General Walker – and congratulations on the \"superb way we’d carried ourselves\" left for Pozieres.\n\nAt Pozieres they’d a surprise supper for us, and after it sleep, blessed sleep.\n\nThe morning we left here was the morning of the 4th Inst., a Friday.\n\n"}}