{"Document Name":{"0":"Diary_0434","1":"Diary_0434","2":"Diary_0434","3":"Diary_0434","4":"Diary_0434","5":"Diary_0434","6":"Diary_0434","7":"Diary_0434","8":"Diary_0434","9":"Diary_0434","10":"Diary_0434","11":"Diary_0434","12":"Diary_0434","13":"Diary_0434","14":"Diary_0434","15":"Diary_0434","16":"Diary_0434","17":"Diary_0434","18":"Diary_0434","19":"Diary_0434","20":"Diary_0434","21":"Diary_0434","22":"Diary_0434","23":"Diary_0434","24":"Diary_0434","25":"Diary_0434","26":"Diary_0434","27":"Diary_0434","28":"Diary_0434","29":"Diary_0434","30":"Diary_0434","31":"Diary_0434","32":"Diary_0434","33":"Diary_0434","34":"Diary_0434","35":"Diary_0434","36":"Diary_0434","37":"Diary_0434","38":"Diary_0434","39":"Diary_0434","40":"Diary_0434","41":"Diary_0434","42":"Diary_0434","43":"Diary_0434","44":"Diary_0434","45":"Diary_0434","46":"Diary_0434","47":"Diary_0434","48":"Diary_0434","49":"Diary_0434","50":"Diary_0434","51":"Diary_0434","52":"Diary_0434","53":"Diary_0434","54":"Diary_0434","55":"Diary_0434","56":"Diary_0434","57":"Diary_0434","58":"Diary_0434","59":"Diary_0434","60":"Diary_0434","61":"Diary_0434","62":"Diary_0434","63":"Diary_0434","64":"Diary_0434","65":"Diary_0434","66":"Diary_0434","67":"Diary_0434","68":"Diary_0434","69":"Diary_0434","70":"Diary_0434","71":"Diary_0434","72":"Diary_0434","73":"Diary_0434","74":"Diary_0434","75":"Diary_0434","76":"Diary_0434","77":"Diary_0434","78":"Diary_0434","79":"Diary_0434","80":"Diary_0434","81":"Diary_0434","82":"Diary_0434","83":"Diary_0434","84":"Diary_0434","85":"Diary_0434","86":"Diary_0434","87":"Diary_0434","88":"Diary_0434","89":"Diary_0434","90":"Diary_0434","91":"Diary_0434","92":"Diary_0434","93":"Diary_0434","94":"Diary_0434","95":"Diary_0434","96":"Diary_0434","97":"Diary_0434","98":"Diary_0434","99":"Diary_0434","100":"Diary_0434","101":"Diary_0434","102":"Diary_0434"},"Date":{"0":"unknown","1":1134.0,"2":1135.0,"3":1136.0,"4":1137.0,"5":1138.0,"6":1139.0,"7":1140.0,"8":1141.0,"9":1142.0,"10":1143.0,"11":1144.0,"12":1145.0,"13":1146.0,"14":1147.0,"15":1148.0,"16":1149.0,"17":1150.0,"18":1151.0,"19":1152.0,"20":1153.0,"21":1154.0,"22":1155.0,"23":1156.0,"24":1157.0,"25":1158.0,"26":1159.0,"27":1160.0,"28":1161.0,"29":1162.0,"30":1163.0,"31":1164.0,"32":1165.0,"33":1166.0,"34":1167.0,"35":1168.0,"36":1169.0,"37":1170.0,"38":1171.0,"39":1172.0,"40":1173.0,"41":1174.0,"42":1175.0,"43":1176.0,"44":1178.0,"45":1179.0,"46":1180.0,"47":1181.0,"48":1182.0,"49":1183.0,"50":1184.0,"51":1185.0,"52":1186.0,"53":1187.0,"54":1188.0,"55":1189.0,"56":1190.0,"57":1191.0,"58":1192.0,"59":1193.0,"60":1194.0,"61":1195.0,"62":1196.0,"63":1197.0,"64":1198.0,"65":1199.0,"66":1200.0,"67":1201.0,"68":1202.0,"69":1203.0,"70":1204.0,"71":1205.0,"72":1206.0,"73":1207.0,"74":1208.0,"75":1209.0,"76":1210.0,"77":1211.0,"78":1212.0,"79":1213.0,"80":1214.0,"81":1215.0,"82":1216.0,"83":1217.0,"84":1218.0,"85":1219.0,"86":1220.0,"87":1221.0,"88":1222.0,"89":1223.0,"90":1224.0,"91":1225.0,"92":1226.0,"93":1227.0,"94":1228.0,"95":1229.0,"96":1230.0,"97":1231.0,"98":1232.0,"99":1233.0,"100":1234.0,"101":1235.0,"102":1236.0},"Entry":{"0":"\n\n","1":"\n\nFri 19th\n\nNothing out of the ordinary happened till after tea tonight & then we received orders to be ready to move out at 8.30 tomorrow morning;\n\nIt is rumoured that the New Zealanders are at present getting 7 days leave & that we are also to get it in a few weeks time.\n","2":"\n\nSat 20th\n\nRose at 5.30 this morning & it was decided at the last moment to take our blankets on the limbers as we have to go to El Burj (8 miles East) A Troop of Engineers are coming with us to report on the prospects for water; I received orders to go to B.H.Q. before going out but found\n\nit was only Smith who wanted to see me about communications while out on the stunt. It has been a lovely day & we had an enjoyable trip picking up 16 Turkish deserters on the way, none of these had anything on them they say the Bedouins this side of Rafa take everything from them; We put down the horse lines about a mile East of \"El Burg well\" & are camped close by several fir trees.\n","3":"\n\nSun 21st\n\nEarly this morning our patrol met a Turk & an Assyrian jew coming in the jew had 3 wounds through the top of the back, also a bullet hole through the boot. He said he was\n\n21-1-17\n\nworking in conjunction with one of our spies, but as the Turks were getting very poorly fed & our planes were too fond of dropping bombs, he decided to come in with the spy & surrender; When 2 miles this side of Rafa Bedouins attempted to rob them, they showed fight the spy was badly wounded when the jew left him he says he killed 5 Bedouins & wounded three, on arriving at Sheikh Towaud he paid a jewish boy £1 to take him to El Arish on the donkey, he had a roll of Turkish notes besides several English & Turkish sovereigns; Good water can be obtained by sinking a couple of feet in the sand on the beach. Had orders today that we are to remain here indefinately. Captured several deserters today\n","4":"\n\nMon 22nd\n\nWe have had a cruel time of it today a heavy wind blowing the sand over us & it is coming up cloudy & very cold; Two deserters came along this morning they say they are practically starving, & we quite believed it by the quantity of bread & meat they consumed for dinner & they looked poor & half fed, I have a touch of a sore throat this afternoon & am taking a night shift on the ‘phone as we are still a man short on Head Quarters & the duties come rather hard on four of them; The Sqdns take it night about on Outpost.\n","5":"\n\nTue 23rd\n\nIt rained hard last night & by midnight our blankets were wet through & most of the men put in till morning walking about to keep themselves warm. I was on the ‘phone from 1 till 5 this morning & it was one of the worst nights I have ever put in, I woke up at 11 oclock with a splitting headache & sore throat & was aching all over by morning; Went to the Dr & was give a gargle & some pills & put in a cold miserable day; Snowy Wride & Locke took the \n\n23-1-17\n\npack horse in today to bring out the Sigs belonging to C Sqdn also went in for their gear; Maj Higginson has been left in charge of the Camp at El Arish, he has always been very unpopular & topped things up at Rafa by keeping B Sqdn well out of the fight & messengers were unable to find him during the fight. However he stood his Court Martial since & although he asserted he received orders direct from Division to remain in reserve, the case appears to have gone against him as he is wearing three stars (instead of the Crown) it is rumoured the court martial reverted him to Capt but there has \n\nbeen nothng in orders, & he is still Major as far as we know. He had been dubbed \"Woodrow Wilson\" since then, & B Sqdn as neutrals\n","6":"\n\nWed 24th\n\nI have a badly swollen throat & the Dr was thinking seriously of sending me off to Field Ambulance this morning but decided to give me till tomorrow to show an improvement; Two English Officers were out looking over the country today, a Taube flew over us today very high & received a warm welcome at El Arish from the Anti Air Craft guns. \n\nA few more Turkish deserters came in today\n","7":"\n\nThurs 25th\n\nThe two English Officers who were out yesterday were on leave. We came to the conclusion that they were either broke or \"dotty\" to put in leave out there; We had a couple of English Tank Officers out today to see how the country is for them they say the tanks could have taken Rafa in half an hour needless to say we are anxious to see them in action; I put today in between the blankets & am feeling a good deal better tonight than I was yesterday. Capt Weir has been posted to B.Sqdn & Higginson sent to details . Kater is coming from B.H.Q. as Adjutant.\n","8":"\n\nFri 26th.\n\nKater turned up & took over this morning; Frank Hobson (his groom) came with him. I went in to El Risa camp to straighten the gear up in there. Sgt Maj Wright, Sergt Chivers & Sgt Hayes went in with me on their way to the School of Instruction coming back to El Burj we halted to watch the Scottish Offficers playing our Field Ambulance football; Two enemy planes came over much lower than any I have seen for some time, they dropped no bombs & our Anti Air Craft guns were shooting well but failed to score a hit; The Field Ambulance won the match by 14 to 3; \n\nA few deserters \n\n26-1-17\n\nstill come in daily. & they are now complaining that 3 Bedouins mounted on horses at Rafa rob them & say they are working under orders from the English & are to hunt any Turks back who try to come in, they are also getting ill treated by the Bedouins.\n","9":"\n\nSat 27th\n\nHad a cruel time with my throat last night & slept in till 9 oclock this morning, then paraded to the Dr who said it is impossible to get cured here as he had not the right medicine, & by 10 oclock I was mounted & on my way to El Arish put in some time at the Camp waiting for some mail to\n\n27-1-17\n\nget sorted, & then went to the Field Ambulance & made myself conmfortable; One of the Sig Troop told me he saw a letter saying Sutherland had applied & received special permission to rejoin the Regt & would be back on Monday so that knocks any chance I had for a commission on the head\n","10":"\n\nSun 28th\n\nTwo enemy planes came over this morning flying high they kept well out to sea but were within range of the guns which did remarkably fine shooting but failed to bring either down.\n\nPut in a very quiet day lying down reading & writing\n","11":"\n\nMon 29th\n\nWas rather surprised this morning when Capt Parry came around to hear I was fit to go back to the Regt. So got my belongings together & made back to our old camp & had a quiet day; \n\nThe Regt arrived back at 3 oclock this afternoon, they were relieved by the 5th Yeomanry Brigade who also took out 2 Batteries of Artillery with then & enough Camel transports to move a Division.\n","12":"\n\nTue 30th\n\nTwo 60 pounder guns were brought up into position today by B.H.Q. nothing out of the ordinary happened my throat is still far from well & I am not feeling too fit;\n","13":"\n\nWed 31st\n\nThe foundation for the Railway is being laid down rapidly & is 3 miles East of El Arish, also a wirenetting road for the Infantry to march on; last night there was a false alarm aeroplane scare at 8 oclock. an enemy ‘plane was over early this morning & dropped 10 bombs, killing several Artillery horses & a couple of Tommies.\n","14":"\n\nThurs 1st\n\nThe Arillery has been firing today, getting the range of certain points; 2 Taubes paid us a visit today but dropped no bombs, six of our planes went out early this morning I went to Kilo 254 to the Ordnance \n\n1-2-17\n\ntrying to trace 8 miles of wire we left at Gererat & which has gone astray, had no success bought some goods from the E.F.Canteen & returned ; Lieut Sutherland was to have arrived today but did not turn up\n","15":"\n\nFrid 2nd\n\nMy throat is still a little sore, & half the Regt are suffering the same complaint. \n\nLieut Sutherland came back this afternoon looking very thin, & half dead; Browne went to the Camel Corps today & saw Jock Davidson & Moylan; A day or two ago the 5th Mtd. Bde sent in half a mile of wire in exchange for what we left out \n\nat El Burj. But as we left over a mile of Turkish wire which is much superior to our D3 wire I intend going out tomorrow to reel the Turkish wire in.\n","16":"\n\nSat 3rd\n\nLeask, Wride & I left here at 9 oclock this morning & had a very enjoyable ride to El Burj Went to the 5th Mtd Bde Head Qrs & after a good deal of arguing recovered all the Turkish wire. Had dinner there & returned, The Tommies are getting the wire road down in good style also the railway.\n\nAn enemy plane came over El Arish this morning but was out of range A mine was washed up on the beach today\n","17":"\n\nSun 4th\n\nA good many lads were down at the beach this morning taking photos of the mine, attempts were made last night to explode it with with machine gun bullets but without success & at dinner time today a charge of amanol exploded it. it was the biggest mine we have seen here; This mornng I was fixing a telephone line when an enemy plane flew over. & we soon had a shower of shrapnel pellets, caps & empty cases. the fire from our own guns are as bad as the bombs to contend with the nights are now very bright from the moon. & we are expecting a night air raid at anytime.\n","18":"\n\nMon 5th\n\nTook some horses down to M.V.S.to be clipped today & managed to get hit on the mouth by my horses head breaking two front teeth; The Padre has had a lot of books sent to him from England & is busy tonight distributing them; Sutherland told me this morning that he is going with the 4th Mtd Bde shortly which is forming up with Johnny Meredith as Brigadier. The 42nd Div (English) went back a few days ago & it is rumoured they are going to England & then to France we still have the 52nd (Scottish) with us & glad they are left instead of the English Troops. Lindsell went in to School of Instruction at \"Alex\" tonight.\n","19":"\n\nTue 6th\n\nPut in today cleaning up & checking equipment for Sutherlands edification; Artillery practice still continues & Field days by the Infantry. Heard this afternoon that we are to go back 60 miles & will be in a rest camp near Sagia, the majority of us would much sooner remain here as there is too much Regimental work in a rest Camp, we are counting on getting leave to Cario from Sagia Two of our ‘planes came in at 7 oclock tonight & was the cause of us standing to our horses as we thought they were enemy machines Got £12 worth of goods from the AIF Canteen today between Frost, Browne, Laney & myself.\n","20":"\n\nWed 7th\n\nAt 9 oclock this morning heavy artillery were firing from the Wadi El Arish when the Anti Air Craft guns opened up rapid fire at a Taube that appeared coming in at a great height between us & the sun the guns gave us a good exhibition of shooting at long range & the Taube made off followed by a couple of our planes who rose at sight of the enemy; \n\nOtherwise had a quiet day & pulled down our \"bivy\" this afternoon; There are plenty of clouds in the sky tonight & no danger of Taubes; Heard today that my application for a Commission went throught to Division without a hitch & should have had it a couple of days later when it fell void through Sutherland returning;\n","21":"\n\nThurs 8th\n\nHave decided to wait till we get settled again before I go to the Dentist we leave next Saturday morning ; the 1st Bde do not relish the idea of going back & Gen Cox put in today at Division to see if he could get it cancelled; The Railway line is going down but not as fast as we expected.\n","22":"\n\nFrid 9th\n\nFound my left foot slightly swollen this morning & rather sore went to Lumb & had it painted with iodine & knocked about barefooted this morning packing up ready to move, at dinner time my foot had swelled\n\n9-2-17\n\n& was very painful, so I saw the Dr. who put it down to rheumatism & told me I had better go through the Field Ambulance to go back by train, as no sick men were allowed to travel back without going through the Ambulance, at 3 oclock I found myself in the 1st L.H.F.A. who were packing up to move & at 4 oclock was taken to the 3rd Clearance Station on a sand cart with Hughie Harris, here we were put in a large tent on good beds & found Grainger & Nowland with us they were admitted yesterday; There are 10 of us in the tent & a merry lot, get very good attention; the Dr came around at 6 oclock & I had hot fomentations on my foot; Nowland was thrown off a mule a couple of nights ago & has a bad leg.\n","23":"\n\nSat 10th\n\nHad a few drops of rain this morning & I did not feel sorry that I have missed the 3 days treck back mounted. I have no swelling in the foot today & feel fit for anything Nowland was sent on today ; he has no pain in the leg but cannot use it; This is the best home I have had for some time & as the patients are all fine fellows life is not monotonous; We are getting the best of foods & want for nothing; One of the lads was taken out & operated on for appendicitis this afternoon I had hot fomentation twice today, but told the Dr. that I am fit for duty once more this evening.\n","24":"\n\nRained last night & cloudy today; I woke up during the night with pains in the foot & find it is sore & swollen again today. so the hot fomentations continue . I am on full diet & can find no faults with anything; We put the days in spinning yarns & reading; An enemy plane came in sight this afternoon & the Anti Air Craft guns fired a few shots but she did not come in close.\n","25":"\n\nMon 12th\n\nAn enemy plane came over early this morning from the West flying well out to sea the aircraft guns fired more shots at her than I have\n\never seen before. But she continued her journey apparently not touched; my foot seems to be fairly right again; One of the lads from here named Asker went in to Cairo today to be operated on. We are having a goodtime here amongst ourselves\n","26":"\n\nTue 13th\n\nTold the Dr. this morning that I was fit for duty & he said he would get me away on the first train tomorrow & advise the Regt. Got dressed this afternoon & went to the E.F.Canteen & bought a supply of cigarettes & sauce for the lads here. Aeroplanes have been going out today loaded with bombs\n","27":"\n\nWed 14th\n\nHarris is OK again & the Dr. says both he & I can go on the 9 oclock train tomorrow morning owing to a breakdown on the line no trains are running today. A lad named Martin (2nd Regt.) is also going back with us Our planes went out again this afternoon loaded with bombs\n","28":"\n\nThurs 15th\n\nLeft the Field Ambulance at 9 oclock this morning & at 10 was on our way to Bir-El-Abd where we left the train at 1 oclock (Martin (2nd Regt) left us at Nazar) Olson met me at Abd with my horse, collected some letters from Rich (the Postman) who\n\n15-2-17\n\nis camped by the station. Here we heard that a good many of the lads got drunk yesterday morning as the Regt camped here overnight & a good many lads were under arrest in consequence; We ran into a shower of rain or two on our way to Bayud but we arrived at the Camp at Bayud at 4.30 & found everything down & fairly comfortable; Johnny Meredith went from Bi-El-Abd to El Arish today & is expected back at the Regiment tomorrow; The Troops will get enough duties with patrols Outposts Etc to knock parades on the head; C Sqdn is at Harsanied & detached from the rest of the Regt. A. Sqdn of New Zealand Camel Corps are camped by us.\n\nFri 16th\n\nBrig.Gen. Meredith showed up here this morning we were formed up in hollow Square while he gave us some kid stakes for the work we have done. & said he only hopes the 4th Bde will prove themselves as good as the 1st; He also said that things in Australia are rotten & cold feet can be had by the bushel; We gave him 3 cheers when he was leaving; Sutherland said that Meredith told him that Jimmy Traill is in charge of the 4th Bde Sig Troop & that Meredith was not consulted in the matter. So things are likely to remain as they are; Capt Wordsworth went back with Meredith to Abd today he is getting the 4th Bde Machine gun Squadron. Some of the lads were\n","29":"\n\ntried today for their blow out at Bir-El-Abd but the sentences have been very light; Raining again this evening; 5% of the Regt can get leave to visit Cairo & I applied this afternoon for leave; Col Granville seemed to think I have had enough for the present, but recommended it.\n","30":"\n\nSat 17th\n\nSutherland went in to Bir-El-Abd this morning & this afternoon I went for a ride to Ruesat & Hill 286 with Capt Weir, Lieut Wright & Sergt.Major Lenehan, it was fine day & an enjoyable ride; The passes came back from B.H.Q. this evening & a note saying my application for leave was cut out, the lads \n\nwho are going leave here at 5.30 tomorrow morning for Abd & have to be back by Wednesday night, the next lot go on Thursday; Si Frost expects to get a Comission in a few days, & will be sent to Details (Moascar) for Instructional purposes; Sutherland has been trying to get the Squadron & Regimental H.Q.Sigs together & make a Sig Troop of them instead of working them in Squadrons, & has at last succeeded, through a brigade order, Col Granville & all the Sqdn leaders are against it, & the Sqdn Sigs also object, but I think it will be much better & it is to be given a trial; I heard tonight that Major Irwin is likely to get into trouble, as a message from Div Headquarters asked for an explanation\n\n17-2-17\n\nwhy the 2nd in Command of this Regt was detailed to go in charge of 5 men & take a trench which left the Regt without a Commander in the event of Granville being hit, the C.O. replied that he sent Major Irwin to C Sqdn with a message & gave him no orders to attack; Major Smith said Major Irwin collected 5 C Sqdn men without consulting him & rushed the trench & took it. & it now appears that Irwin will get into trouble for doing work that should have been left to a troop leader; Major Irwin jumped into the trench first & as he did so a Turkish Officer wounded him through the shoulder with a revolver bullet, Irwin shot the Officer dead & 11 Turks all that were left surrendered We have started the Sergeants mess going & it was opened today\n","31":"\n\nSun 18th\n\nI went to the Dr. this morning & got an order to go to the Field Ambulance at Abd to have my teeth attended to, went in at 11 oclock & arrived back in camp at 4.30 I also brought out a ‘phone as the C.O. wants one in his tent. The lads going on leave got away to to time this morning.\n","32":"\n\nMon 19th\n\nSent Cpl Leask & two men away with a pack mule (which we commandeered at El Arish) this morning to get posts to make a breast line for the Sig Troop & put in this morning putting it up Jack Wright returned from the School\n\nof Instruction this morning, with the news that Jessie is on night duty & for me not to apply for leave just yet so I am now glad my leave had been stopped; Wright is coming over tomorrow from Mageibra where C Sqdn is camped to see us.\n","33":"\n\nWright failed to put in an appearance today as his presence was required at Mageibra; The Sergts mess in going strong & we are living exceptionally well; 5 Sigs are to go to the next School of Instruction from here & our names went in today, Hillier, Mann, Olson, Pearson ( a supernumary) & myself so I am in \n\n20-2-17\n\nlucks way; The Sigs are getting a good deal of work now, & it will be heavy when 5 of us are away; A few reinforcements arrive ed for us this evening including one Sig; Frost & Leask are going in at 8 oclock tomorrow to go on leave; Frost`s Commission is expected at anytime.\n","34":"\n\nWed 21st.\n\nI went in to El Abd with the men going on leave today & were in there at 10 oclock; had dinner with Tancred, Poile, McKeown,& Frost. The men going on leave caught a train leaving Abd at 12.30 & as their leave does not commence till tomorrow morning they are getting \"Backsheesh\" as they will get to Cairo some\n\n21-2-17\n\ntime tonight. At 2 oclock I called at the Field Ambulance & got my teeth & was back in camp at Bayud at 4 P.M. The sand flies are very bad between here & Abd but nothing like they were last summer; A high sand ridge is close by the camp & along the top old machine gun positions are plentiful with heaps of empty shells & a few hundred yards East of the Camp dead camels & ponies & some graves show the guns of the 3rd L.H. Brigade did good work on Aug 9th last year when we were attacking Bir-El-Abd. Captain Harris told me tonight that he met Jessie at the 14th a few days ago; Major Lawrie & Lieut McDoodle came today to pay the Regt a visit.\n","35":"\n\nThurs 22nd\n\nJack Wright came over today & by all accounts he had a great time while in at the School . Heard today that we go in to the school next Saturday morning.\n","36":"\n\nFri 23rd\n\nWord came through this afternoon that men going to the school must catch the 8.20 train at Abd tomorrow morning, busy tonight handing over to Elliott & straightening things up as we have to get away from here at 5.30: There are a good many going in from this Regt for different courses.\n","37":"\n\nSat 24th\n\nLeft Bayud at 5.30 after rising at 4 feeding our horses & having breakfast, made the pace warm & arrived at Abd a few minutes after 7 caught the 8.20 train & played bridge on the way to Kantara arriving there at midday; Arrangements were made to stay at Kantara tonight but I slipped away with several others & caught a train about 1 oclock for Cairo arriving there at 5.30 Went to the Anzac Hostel & left my gear there & arranged for a bed then had dinner & a shave & drove around to the National to see Frost & Leask but found they had gone so rang up the 14th\n\n24-2-17\n\nA.G.H. & was told that Jessie was out for a walk & was off duty, so I caught a tram & went to Abbassia saw Hills & Jessie before they had dinner & found Leask & Frost had been out & had only just left per motor to catch the 6.30 train back; Hills is on night duty I went over to the Hospital with her from the Sisters Quarters & then went for a walk with Jessie; It was 10.30 when I left the Hospital & eleven before I arrived back at the Anzac had another dinner & went up to bed, the Anzac is filled right up on account of the men coming down on leave.\n","38":"\n\nSun 25\n\nThe sun was well up when I awoke this morning had breakfast & went up the street & bought a couple of singlets & a pair of tennis shoes, as I am wearing new boots & they are far from comfortable, then had a hot bath & caught a tram out to Heliopolis & walked to Zeitoun & reported at the school half an hour later the lads from Kantara arrived & I reported to Lieut Heegan that all the lads who came down yesterday had reported here this morning, I applied for a pass from 1 oclock this afternoon but was told I would probably\n\n25-2-17\n\nhave to wait till 3 oclock fo it. So I did not wait & went to Heliopolis at 1.30 had a general clean up & a shave & drove to Abbassia arriving there at 3 oclock put in till 4 yarning with some of the boys in Hospital & then took Hills for a garry drive around Heliopolis & Zeitoun arriving back at 5.30; I then drove back to Heliopolis for dinner & met Jessie at the Hospital at 8 oclock & drove into Cairo with her, arriving back at Abbassia at 10 P.M. I then drove back to Camp & after a good deal of hunting in the dark I managed to find the right hut & turned in\n","39":"\n\nMon 26th\n\nReveille at 5.30 & if one is slick enough it is possible to get a cup of tea & a wash before the parade at 6.15 had signalling work till 8.30 then dismissed breakfast at 8.45 & parade again at 9.30 till 1 P.M. dinner ten minutes later & parade again at 2.15 till 4 P.M. Anyone wanting leave after the days work is finished must have applications for leave in at 6 A.M. I did not apply this morning as I fancy I am better off without a pass; We had a passing in test this morning at 5 words a minute & one must get 98% for a pass, a good many failed including Olson & Pearson\n\n26-2-17\n\nwe had buzzer practise this afternoon & the men who failed this morning in the test were taken out & given another chance; As soon as we were dismissed from the 4 oclock parade I made for Heliopolis bought a new cap & tunic had dinner & a shave & went to Abbassia; Met Hills at the sisters ward & went across with her to the Hospital as she is on night duty & came back with Jessie. Met Sister Parson & a lad from the camel corps & the 4 of us came for a walk to Zietoun & back; It was 10.30 before I arrived in Camp & managed to find my own hut without much difficulty; I have had a slight touch of rheumatism in the foot again today.\n","40":"\n\nTue 27th\n\nReading flags this morning, we were to have had helio reading but the sky was too cloudy, a lecture this afternoon; & as soon as we were dismissed at 4 oclock I had dinner & went to the Remount Depot which is only a couple of hundred yards away met Les Regan went with him to Abbassia Police Barracks met Les Peake & found that Morgan was on duty at Heliopolis House, so we followed & got a good ducking on the way as it was raining fairly heavy; met Morgan also Sergt Proctor there & put in an hour or two yarning & arrived back in camp at 10 oclock.\n","41":"\n","42":"\n\nWe have quite a variety of work here during the day from doing A by numbers on the flag to helio tests; No parade after 1 oclock this afternoon for us, so I left here shortly after dinner saw Morgan Welch for a few minutes while going into Heliopolis engaged a car there as I had arranged to take Hills to the Citadel but found Hills was not to be called till late, (matrons orders) Saw Jessie for awhile (she is on day duty) & then arranged to take Cobb in place of Hills; Sister Fitzgerald went with us to the Anzac Hostel. He we had a cup of tea with Mrs R. who is in\n","43":"\n\ncharge of the Anzac & then Cobb & I went to the Citadel (after getting another car as the one I engaged from Heliopolis broke down just as we got into Cairo & had to finish the trip in a garry) returning to St. James for dinner at 7 oclock we then went to the Anzac as a Welch band was giving an entertainment but as Cobb had to report at Abbassia at 8 oclock we left at 7.45 & was back to time at 8.30 we had a spin through Heliopolis, It was ten oclock before I left the Hospital for Camp; It was very amusing the number of salutes I received during the day.\n","44":"\n\nThurs 1st\n\nIn addition to the usual parades we have been having at 6 oclock tonight we had a lamp parade & had some good practice till dark. I am Sergt of the guard tonight & have to fall the guard in at 8 oclock but I am going to sleep in my hut & let the guard carry on, it is only to see that no natives come on the scene as it is stated a good many rifles etc have been stolen from here. Went to a concert for awhile tonight & it was very good, held in one of the mess huts, Sergt Harris is coming out with the Nurses next Saturday.\n","45":"\n\nFri 2nd\n\nHad some tests this morning in Semaphore & Morse Flag reading, I topped the class with 100% Semaphore a 99½% with Morse. Lamp tests held tonight so could not get out & wrote up a few notes instead; Robertson came out today he is down on leave & said Lancy & Small & Kelly are also in Cairo.\n","46":"\n\nSat 3rd\n\nFlag wagging before breakfast then rifle examination followed by a Theory test, & then we were finished for the day. Sergt Harris & I did not apply for leave but just walked down to Heliopolis\n\n3-3-17\n\ncaught a tram arriving at Abbassia soon after one oclock; Found Dev High came from Kantara last evening but had to return this morning; Harris & I decided to go to Cairo & get a car, there we met Kingsford had the car engaged & was waiting for Kingsford to buy a new hat, when Cpl Brains & L\/Cpl Hicks (Police) came up & told us they wanted our name for wearing caps that were not issued, We told them our names but they wanted to see our passes, we told them we never had them, they then said we would have to go to the Soldiers Home & get a clearance pass to get back to Zeitoun .\n\nWhen we got to the Soldiers Home, (we found the covered with religious Texts such as Do unto others as you\n\n3-3-17\n\nwould have others do unto you etc.) We were told we would have to go to Kasr-El-Nil Barracks & see the officers in charge there, they gave me permission to ring the Hospital up & say we would not be back to Abbassia for some time; We then went to Kasr-el-Nil Barracks to find there was no officer in charge as they were all away at the races & that we would have to wait till a guard from Zeitoun came for us, I was again allowed to ring up the 14th as a great favour & managed to get Jessie on & told her that we would be not be out tonight; Three other lads were put in the guard room after we were admitted all on the same charge & perfectly sober; We had a good tea of bread jam & cheese & plenty of tea &\n\n3-3-17\n\nat 8 oclock the guard from Zeitoun arrived to take us back, we caught a tram to the Railway Station & then a train to Zeitoun where we arrived at 9..40 & told by the Orderly Officer that we were under open arrest & would be for the Orderly Room at 9 oclock Monday morning; We 2 met Satchell in \"Clink\" he was put in the night for being drunk, he serves in the Sergeants Mess at Camp so we were well represented; Harris & I had rather an amusing day but cannot say we enjoyed ourselves as much as we expected to; Kingsford went out to the Hospital afterwards & saw Ossie Hayes & reported\n","47":"\n\nSun 4th\n\nDid not get up till 7.30 this morning then had breakfast & Church Parade at 8.30; I went to the Church of England Service, the Service was rather interesting & very amusing to the Australians present as the Chaplain gave an outline of a man life who left England a member of the Church choir & with every prospects of a successful life But it was the old story, as soon as he got to Australia he got in with rough company & his life been wasted with drink & gambling; There was a general chuckle from the Australians & a good many of the Tommies, it was so pointed but the Chaplain apologised to the Australians before the last hymn & said he did not it for a slur on\n\n4-3-17\n\nAustralia but just an instance of a wasted life of a man now in the Camel Corps. Harris & I have been knocking around this afternoon consoling each other & faking a defence for tomorrow, we went to the YMCA this afternoon & found it a fine place & were served with cake & tea free.\n","48":"\n\nMon 5th\n\nHad to shave this morning before the 6.30 parade to make myself respectable looking & had a hurried breakfast to be at the Orderly Room on time, had to wait there for half an hour standing at ease waiting for our case, I was the first called on & had the charges read to me (1) Being improperly dressed by wearing a cap in \n\nplace of a hat; (2) For being in Cairo without a pass; & then asked me if I had anything to say.I told him I had no hat respectable enough to wear in town & bought a cap; & that I did not apply for a pass during the morning as I had no intention of going to town but two Sergts of the Regt came out at midday & Harris & I decided to go in with them & that we were arrested at 3 oclock & put in till 8.30 in the guard room; The Adj. told me I should have paraded for a special pass at dinner, & said the case was dismissed. Harris followed the Adj. asked him a few questions & also dismissed him. I sent a message to Jessie saying we got off Scot free & would probably see her next Wednesday\n","49":"\n\nput in the evening writing up notes..\n","50":"\n\nWed 7th\n\nReveille at 4.15 for some reason, most of the lads took no notice of it, but I got up had a wash & steak & eggs at the Canteen & wrote a letter before the 6.15 parade;\n\n Snowy Wride came out this morning, he is down on leave I gave him a letter of introduction to Jess & told him we would be at the National at 8 oclock tonight & have dinner with him & Matheson, We had an extra hour on helio work this afternoon & the lamps parade was cut out so, I got away early, reported\n\n7-3-17\n\nat the Hospital, & had to wait till Cobb came off duty at 8 oclock rang Matheson up to say we could not get in before 8.30 drove in, in a gharry & did not arrive till 8.45, after dinner we went for a moonlight spin to the Pyramids, arriving back at Abbassia about 11 P.M. left Jess & Cobb there & had an easy win in a race with another car back to Zeitoun; Matheson & Wride then went back to the National; \n\nI met the Sergt of Police on my way to the huts, he asked me if I had a pass I said yes till 9.30, he recognised me as he was Harris` & my escort from Kasr-El-Nil he is a good sort & did not try to detain me although I was wearing the cap.\n","51":"\n\nThurs 8th\n\nThis morning Sgt Browne, Frank Hobson, Snowy Wride, Jim Poole & Kennedy came out per motor to see me.We were doing flag practice when Wride walked across from the road & asked the Officer in charge of the parade if I could get away to see my Mother who was crippled & in the car, \n\nI found Hobson & Browne both merry, I put in till dinner time with them & promised to meet them at the National Hotel at 8 oclock tonight, but after the lamp parade I decided to go to Abbassia instead; Cobb & I went for a gharry ride around Heliopolis arriving back at the Hospital at 10 oclock; I was out again without a pass & managed to evade the police, they are getting\n\n8-3-17\n\nterribly strict, several lads are caught every night although they are properly dressed & quite sober This hut runs an average of one man every night in the guard room Had semaphore & morse flag tests this morning & if we get a 98% pass there is no need to have the test next week, also had lamp tests tonight\n","52":"\n\nFri 9th\n\nUsual work today & at 4.30 this afternoon Harris & I were yarning leaning against the Sergts Mess waiting for dinner when Sergt High came on the scene & askd me if I knew Sergt Tomlins, so Harris, High & I went over to the road & found Jessie\n\n& Hills waiting in a gharry. Harris could not get away tonight, but Jessie, Hills & High met me at the camp at 7.30 (after lamp parade) in a car, we went to the National for dinner. then went for a spin to the pyramids & Maadi they then came back & dropped me at Zeitoun at 11.30, before going to the 14th (no pass)\n","53":"\n\nSat 10th\n\nHad a Theory test this morning I hurried through it & got ready to go out but could not get a pass till 2 oclock. Harris & I got to Heliopolis & was abut to board a tram when we noticed; Jessie Hills & High drive up in a car, we went to the Nurses Club & ordered dinner for 6 oclock & then went for a\n\n10-3-17\n\nspin to Helouin after doing some shopping, passed Brains & Hicks & felt inclined to get out & have an argument but they gave us a smile of recognition & did not pass any remarks on us wearing caps; Had tea at the Tewfik Palace Hotel at Helouin arriving back at the Nurses Club at 6 oclock Cobb met us here at dinner, we then went to the concert at the Anzac Hostel & found it very good, the items were contributed by the Welch singers; We then engaged gharries & went for a drive across the Nile & back to Zeitoun; Harris & I left the party here & the girls & High went back to Abassia; High is only a kid & a fine little fellow, midnight before we got to bed tonight\n","54":"\n\nSun 11th\n\nChurch parade at 8 oclock this morning but I went over to the Remount Depot instead & had a yarn with Regan & left my legging with him as they want some repairs & wore his away in exchange. Received afternoon pass at 2 oclock & Harris & I went to the hospital & met Dev High there, put an hour or two yarning with some of the lads & then went to the Anzac Hostel for dinner had a hot bath & was back at Abassia by 8.30 Cobb could not come out tonight & Thompson came instead we drove in gharries to the Anzac Hostel for dinner had a hot bath & was back at Abbassia by 8.30 Cobb could not come out tonight & Thompson came instead we drove in gharries to the Anzac Hostel & back to Abbassia Our driver was slightly inebriated & gave us a lively spin till his near sider fell, but did no damage, Harris & I arrived back in camp at 11.30\n","55":"\n\nMon 12th\n\nUsual routine of work today Harris left here at 4.30 & took Hills in to Cairo. I went to the Hospital & met Sergt Hayes & Young there, Hayes should not be out yet, but got away to take some of the nurses for a spin; Young is the biggest rotter & most unpopular man in Egypt & has a bad attack of cold feet, he has been in Details for over 12 months now & has great objections to rejoining the Regt. An Aust. Mail came out to the Hospital this evening & Jessie & I put in till 10 oclock reading her letters from home & yarning. Hills & Vern. Arrived back at 10 oclock & Vern & I came back to camp together. Wrote to Meredith today; Dev High went back to Kantara this morning\n","56":"\n\nTue 13th\n\nHave a sore on right instep & went on sick parade this morning to get permission to wear shoes on parades; Last night when I came off lamp practise at 6 oclock one of the lads gave me an evelope addressed to Ben Woodhouse. He said he had given it to give to me & was sorry he could not wait till after the parade as he was in a hurry. I expected to meet him at the 14th AGH but was disappointed; I went to the Remounts this evening as soon as I had tea & arranged to go to Abbassia Barracks with Les Regan after lamp parade to see Morgan Welch Ben Woodhouse came on the scene soon after the parade & we went\n\n13-3-17\n\nto the Remounts & then to Abbassia stayed till 9.30 & then came back I went with Ben to his camp which is only about half a mile away & I am to go to the 14th tonight & make arrangements to meet Jessie later on. Ben appears to be a very nice lad;\n","57":"\n\nWed 14th\n\nHad some tests reading morse flag through telescopes before breakfast, it was very windy & difficult. There is a Field Day on today but does not affect us. But the N.C.O.s course are out & Vern. Harris is on night manoeuvres tonight I went to the 14th A.G.H. & found Hills is on night duty specialising sick Sisters\n","58":"\n\nThurs 15th\n\nMore tests today & tonight a lamp test. Harris & I then went to the 14th A.G.H. Hills is still on duty & Jessie Harris \n\nCobb & I went for a gharry drive arriving back at the Hospital at 10 oclock. Some of the lads have been enjoying themselves here the night before last. The Sergt of camp police came around & ordered the lads to be quiet after lights out as they were yarning, he was counted out in good style yesterday the Sergt in charge of the hut was up before the Adj. & reprimanded for allowing the boys to talk; Another night Verge (3rd Regt) & Hillier (1st Regt) had a race along the roof breaking several boards; \n\nbefore going in last\n\nnight I left a note for Ben Woodhouse asking him to get Saturday afternoon & evening off as we were arranging a party.\n","59":"\n\nFri 16th\n\nHad a theory test this afternoon having from 2 to 5 to finish but as I was in a hurry to go out I finished at 4 went to Abbassia & took Cobb to St James for dinner & then decided to see French war scenes at the Cosmograph we were late for the first session but went in & saw a few films & they are the best I have ever seen we then went for a gharry ride to Gezerieh but were not away long as Cobb had to \n\n16-3-17\n\nbe in at 10 oclock, while waiting for a tram at Abbassia the Welsh (Glamorgans) choir came on the scene all singing, they had been giving a concert at the Convalescent home & they kept it up till we got to Heliopolis was surprised to finds the lights still going when I got back to my hut & most of the lads rather merry, they are allowed to keep the lights late tonight on account of the School breaking up tomorrow for the majority of classes.\n","60":"\n\nSat 17th\n\nBen Woodhouse arrived here at 2 oclock this afternoon & he & I went down to the 14th A.G.H. & met\n\nVern. Harris there. He came out per car, Hills & Jessie & 3 other sisters went to Cairo with us & we left them at Opera Square, did some shopping & then Jessie, Hills, Vern, Ben, & I went for a spin to the pyramids, went through one of the tombs, Jessie & Hills had their fortunes told came back to St James for dinner & then to a concert at the Anzac Hostel which was very good. Hill had to be back at 6.30 so we took her back & brought Parsons in her place to dinner, we drove back to Abbassia in gharries; I found out today & Cobb & I arrived back at the Hospital at 9 oclock instead of 10 last night, by mistake; Ben had a pass till 10.30 tonight but it was after eleven when we got back;\n","61":"\n\nSun 18th\n\nI went to the Remounts this morning so soon as I had finished breakfast instead of going to church. Ben came over at 11 oclock this morning to say he cannot get away this afternoon, it was too late to apply for a pass when I got up this morning, so I faked an old one & at 2.30 I was at Abassia put in an hour yarning to Roper, James & Scott who are in hospital & then went across to the Sisters quarters. Harris came on the scene shortly afterwards & Hills, Cobb, Harris & I drove in to Cairo engaged a car & went to the Citadel, then for a spin around Gezerieh after tea at Groppis arriving back at Abbassia shortly after 6 oclock, left Hills there &\n\n18-3-17\n\nbrought Cobb back to the Anzac Hostel where she was to meet Sergt Marsh at 6.30 Harris & I met Kingsford there had dinner & the heard the Welsh choir giving a concert till 9 oclock & then came back early. Several coming merry last night had a few words with the Police at Heliopolis who tried to arrest them but found they could not as they made a fight of it; Tonight the Police got square as the whole Troop was waiting for the 10 oclock & 10.30 train they took all the passes from the lads as they got out & then allowed them to come on to camp several of the lads had faked passes, it will end in a riot here before long\n","62":"\n\nMon 19th\n\nStarted today on the Telephony Course; Ben Woodhouse came over this afternoon. I could not go out as I am Orderly Sergt today, so Ben went in to meet Jessie, he arrived at the 14th at twenty to seven & was told that Jessie was on duty till 8 oclock, so he did not think to wait but came back & was back in camp here before 8 oclock; Les Regan was over for an hour or two tonight; Ben left at 9.30 for his camp they expect to move away on Wednesday 140 lads were caught coming in late last night & a good many are for Orderly Room tomorrow\n","63":"\n\nTue 20th\n\nAll the lads who were caught by the police on Sunday night were on the mat this morning & they all had their leave stopped for a week Ben came down at 5.30 this afternoon we called at the 14th A.G.H. found Jessie on duty till 8 oclock so we went to Cairo had a game of billiards at the Anzac Hostel, then had tea & cake arriving back at the Hospital at 8.30 & put in till 10 oclock talking to Jessie in the garden, coming home per gharry the driver was drunk and driving close to another gharry commenced a duel with whips with the other driver both gharries at the gallop, getting out of Heliopolis we pulled the gharries up & the Officer gave our drunken driver a few lashes which sobered him considerably.\n","64":"\n\nWed 21st\n\nOn parade this morning all the lads from Moascar & Alexandria had to fall out & were counted. A rumor spread about yesterday that all the lads from the front line had to go back tomorrow but we took no notice of it but we began to think this morning when we were separated; & on parade this afternoon the Captain told us that all men in from the desert are to return to our units tomorrow on account of operations & that we would come back in a months time if we were not under the ground some of the troops leave at 4.30 AM some at 8.30 AM the 1st Regt men at 4.30 PM; Went to Abbassia this afternoon without waiting for a pass, & found\n\n21-3-17\n\nJessie, Hills & Cobb out. Ben came on the scene a little before 6 oclock & Hills, Jessie & Soar drove up a little later; Hills is on night duty & Jessie Soar, Ben & I went to the Cosmograph & saw the pictures out; Had dinner at the Nurses Club at 8.30 & then came back arriving in at 10, came back to Heliopolis per tram; Found things merry in camp several of the huts were holding a farewell concert; The Orderly Officer sent the Orderly Sergt over at 11.30 to stop the row but he was counted out & the concert continued; I am rather pleased the School is breakingup as another 3 weeks here in a months time is something to look forward to.\n","65":"\n\nThurs 22nd\n\nSlept in till we felt inclined to get up this morning & then went down to the Sergts Mess, squared up my Mess account; had a game of billiards then breakfast rolled up my belongings, went to the Remount Depot. Regan was on parade, then went to the Police Barracks saw Morgan, then to the 14th A.G.H. saw Jessie for a few minutes, came back to the barracks for dinner, then put in till 2 oclock at the remount Depot yarning to Regan & some of the rough riders; Came back to camp & went to the YMCA to get some sandwiches for the track. Ben Woodhouse came along at 2.30 & we were having a drink of tea at the Canteen when Mr Mathews\n\n22-3-17\n\ncame in & said Jessie was waiting in the car, so we went around to the R.S.M. & I told him I wanted to leave then & would meet the train in Cairo he agreed; said Goodby to Ben & Jessie Mathews & I went to the Hospital as I thought Hills was coming to Zeitoun station to see me off, but we did not meet her, but was told she had left twenty minutes earlier, so we went back to Zeitoun station but she was not there, so we went into the Cairo Station through Matarieh & found Hills on the station, Jessie had to be back on duty at 5 oclock so we parted at the station Mathews taking her back & Hills & I drove to Groppis` had afternoon\n\n22-3-17\n\ntea, then drove to the station the train left at 6.15 PM, I had a very enjoyable evening & the the best 3 weeks I have had in my life & it is the only time I have regretted leaving Cairo. We arrived at Kantara at 10.30PM & found Dev High waiting for me on the station (Jessie had sent him a wire) We went to Mrs Chisholms for a drink of cocoa & then to Dev`s home for the night; Heard that Vern Harris Kingsford & the rest of the lads only left here this morning Jessie & Florence sent \"The Sentimental Bloke:\" up for Dev also one for me. Besides a supply of sandwuiches & cakes for the journey\n","66":"\n\nFri 23rd\n\nRose after 8 oclock this morning & found Dev hard at work on the type-writer had breakfast & put the morning in lying on the bed smoking & reading, had dinner at 12 oclock & then Dev came with me to the station at Kantara East & I just managed to catch the 12.40 train to El Arish, had a cruel journey the trucks bumping & jolting all the way, arrived at El Arish at midnight & got off the train only a few hundred yards from where the Regt is camped; 3 lads from the 3rd Regt came down with me & knew where we are camped\n","67":"\n\nSat 24th\n\nShifted my belongings this morning to the tent occupied by Leask & Elliot & have decided to live with them, there was a parade this morning to dubbin saddlery & an inspection by the C.O. A football Competition has been started by the C.O. two teams from each Squadron & one from Headquarters & Sig Troop combined; Two teams played this afternoon; I put the afternoon in writing; a picture show gave an entertainment tonight by the YMCA I went & enjoyed them thoroughly a couple of films of Charlie Chaplin took very well; Found two parcels from home waiting for me today A Troop & 3 sigs Cabban, Reid,& Hargreave are camped at Bardawil\n","68":"\n\nSun 25th\n\nChurch parade at 8.45 this morning & I attended the service which was very dull; this afternoon I went on the phone to allow Bamford to get off to play football & I put in the afternoon writing; Murray who is in command of all the Troops in Egypt came out to El Arish this afternoon, the attack on Gaza commences tomorrow morning & we are to remain in camp in case we are called on in a hurry; It is rumoured that there are only 6000 Turks at Gaza, so it should not take much taking as we have so many infantry troops taking part. The Anzac Mounted Division are in reserve so the Tommies are out for a victory on their own; This afternoon\n\n25-3-117\n\nWilliamson B Sqdn rolled his blankets & started down the road towards Cairo, arriving at the Flying Corps hangars (Bardawil) 4 miles West of us; he told them he was going to England to fix up his affairs there & wanted an aeroplane to fly over to England they offered him a Bristol but he said he wanted a Taube they humoured him & put a guard over him; till a guard from here who had been sent to catch him arrived they brought him back & put him in the Field Ambulance, he has been very strange for some time & is quite dotty; but mad enough not to go East towards the enemy\n","69":"\n\nMon 26th\n\nThe attack on Gaza commenced this morning & all day we have been able to hear a continual rumble from the warboats shelling the enemy positions & a continual stream of aeroplanes going out loaded with bombs & coming back empty has been Kept up, all the mounted troops in the front line are at it besides the infantry, there are rumors of a good number of prisoners taken but get no official news through, tonight a message came to Bde Headqrs asking how many men we could raise as escort to prisoners, the reply was 17 officers & 250 men; Headquarters played a team from \n\n26-3-17\n\nA Squadron this afternoon, & we were beaten by 8 to Nil after a strenuous game, I then had a dip in the briny & after tea had some boxing with Cunes. Report came through tonight from the Flying Corps that the big guns did excellent work today; 18 pounder were of no use; The infantry (Scottish) made one of the finest charges on record over open ground to within 200 yds of the enemy`s front line of trenchs & then dug in; The Mounted Troops are behind Gaza cutting off the enemy, also stopping any reinforcements coming up, & the final assault is to be made tonight, & Gaza is expected to be in our hands before morning. A large number of Hospital vans came out today from Kantara.\n","70":"\n\nTue 27th\n\nThe machine gun & Field Amb. Combined played the Regt football this afternoon; it was a great game & resulted in a scoreless draw. The Mounted Troops East of Gaza withdrew today & allowed 9,000 Turkish reinforcements get into Gaza & then closed up again to stop them getting back or so the rumor goes, we have had no official news through & there appears to be more interest taken in football than in the fighting Went down for a dip this morning with several other Sigs. One of our planes was brought down in flames yesterday at Gaza; Two R.F.C. officers were killed\n","71":"\n\nWed 28th\n\nWent for a dip this morning before breakfast, after dinner we played No 1 team of A Sqdn & scored a win by 5 to Nil; Got through official news of operations on the 26th today.\n\nWe took 800 prisoners including 8 Austrian Officers & 48 other ranks & 8 Germans also a Turkish Divisional Copmmander & his staff taken by the 53 Division The N.Z. Mtd Rifles captured two 4.2 Krupp guns; The Anzac Mtd Division inflicted heavy losses in street fighting in Gaza & late in the day held most of the town but had to retire on account of reinforcements; The 2nd L.H. Bde inflicted heavy losses on the enemy leaving the town; Had a dip after the match this afternoon.\n","72":"\n\nThurs 29th\n\nHeadquarters had a win over No 2 Team of B Sqdn today by 5 points to Nil. Had a swim afterwards; This morning I had Roger shod, & attempted to ride him down to water bareback afterwards, he gave a fine exhibition of rooting & got me off 6 times & I had to give him best as I was completely knocked up, he is just a little too good for me without the saddle; No news of the scrap at Gaza today but it is rumoured that the 42nd Division have landed between Jafa & Gaza, 8 Tanks & a good number of armoured cars went out per train yesterday & more cars today Had a reply to letter I sent Meredith today.\n","73":"\n\nFri 30th\n\nBoth sides have dug in at Gaza, & trench fighting is the order of the day till the railway line catches up to keep up a supply of shells; the line is 6 miles from Gaza. Jimmy Leask received orders today to go back to Romani & join the 4th Bde Sig Troop. There were two football matches this afternoon but Headquarters were not in it, after tea tonight the H.R. team went to the ground & had some practice & getting instructions from our Capt.(McNamara); A horse race meeting is to take place next week & a good many were out testing their horses today; I am very stiff tonight on account of buckjump riding & football\n\n31-3-17\n\nSat 31st\n\nThis morning we had a kit inspection by the C.O.& afterwards all the Sigs had our photos taken which we intend to have enlarged & presented to Jimmy, Jimmy left at 11 AM on his way to Romani . No football today on account of sports meeting run by the 1st L.H.F.A. We had 5 men in the Sigs who entered (besides FitzMaurice of H.Q.) Locke, Mann, MacNamara, Upham & Hargrave, this was for the 100 yards Bde Championship, but only Locke & Upham started, Locke won his heat easily, & Upham run a dead heat in his, both running in the final; Locke finished third being beaten by Schooler 2nd Regt\n","74":"\n\nwho won with Wheeler (Field Amb) second there were 18 starters; The wrestling on horse back & obstacle race was very good, also the high jump, but only members of the Field Ambulance were allowed to compete in these. I have been very stiff & sore today, & fearing I have rheumatism I have been doping myself up with Sodical today\n","75":"\n\nSun 1st\n\nChurch parade this morning but I did not attend; & an inspection of the lines by the C.O.; This afternoon we played B Sqds (No.2 team) football & scored a win 5nil; No 1 team of A Sqdn defeated No 2 of C Sqdn\n","76":"\n\nMon 2nd\n\nHospital trains have been running backwards & forwards fairly constant & today we can hear the faint booming of guns probably from the warboats; No competition matches were played today on account of the 1st Regt playing the Field Ambulance & Machine Gun Sqdn it was a great game & resulted in a draw once more, they decided to play an extra 10 minutes, but even then there was no score. A lecture tonight in the YMCA every evening there is some entertainment there but I never go down as I have been putting in the evenings writing.\n","77":" (sic)\n\nTue 3rd\n\nWe were busy this morning overhauling gear & packing up all gear we cannot carry with us on \"Trek\" this was loaded on the limbers at 1 oclock this afternoon & taken to the Ordnance Dump, now we have 2 blankets, oilsheet, a spare pair of socks 1 spare shirt shaving kit & towel besides the clothes we stand in; The distant booming of guns continue & believe they are bombarding Gaza; This afternoon No 2 A defeated C2 & C1 drew with B1 a good deal of interest is being taken in the races which are to be run tomorrow; It will be impossible to finish the Competition before we move out.\n","78":"\n\nWed 4th\n\nAll men going to the races had to march down under an officer I decided to stay at home as I have a sore foot, the result of playing football in Tennis shoes & getting skin taken off the left ankle. I came on the phone at 12 oclock, & worked on till 6 being the only Sig in camp, a couple of enemy planes were reported from Bir El Abd & Nazar today, but they appear rather afraid of our guns to come too close over El Arish; Some Welsh lads coming through wounded counted the 3rd Regt out a few days ago, they are a fine lot to count anyone out, as this is\n\n4-4-17\n\nthe first scrap they have been in since leaving the Peninsula, & have been in disgrace ever since they landed at Suvla Bay, here it is reported by Gen.Murray that they went into action well, but they have not take Gaza yet; It is rumoured that the 53rd Div (Welsh) had orders to retire from one position & they did so in such a hurry that they left 42 machine guns behind as \"backsheesh\" for the Turks, but this is probably only a rumor; We get no official news through at all concerning the fighting Jack Wright has been running a book today & came out well on the right side of the ledger\n","79":"\n\nThurs 5th\n\nNo parades today or football as everyone is busy getting ready for the move; The 4th Bde came past this morning halting at the water troughs for dinner; Brig-Gen Meredith had dinner at our Officers Mess; Jimmy Leask gave us a call at dinner time but could not wait long as they were going on to El Risa Whisky came along on the train this afternoon & several of the lads are merry tonight\n","80":"\n\nFri 6th\n\n5 Oclock reveille this morning & fell in at 8.30 ready for the track; Had a good trip stopping at El Burj for dinner, the barley crops\n\n6-4-17\n\ncrops are all in head, but very low, but good feed for the horses the barley is sown in patches on the desert & no fences & we go over it as though it was not there. We arrived at Sheikh Towaid well before sundown & it seems strange to see the train constantly running backwards & forwards, when 8 weeks ago there was nothing but Bedouins here. It did not take so long to get the horses watered & our lines down & some of the lads went to the canteen ½ a mile away & got some fruit Etc so we are set up for the trek tomorrow. The Sig troop have to find piquet for Headquarters tonight\n","81":"\n\nSat 7th\n\nReveille at 5 oclock this morning & left Sheikh Towaid at 8.30 arriving at Rafa at 11.30 here we had dinner; This is fine country we are now in & the horses have no trouble getting a belly full of either grass or barley. We arrived at Khan Yunus at 4 PM & found it a much bigger & prettier place than we expected; We rode through the narrow dusty streets & found a fine water supply in the centre of the village watered our horses & came on 1½ miles where we camped a big area of the country here is taken up with orchards & gardens & it is a fine sight, in the centre are a large number of Hospital\n\ntents & the Railway station, & a good many tents scattered about. Two taubes flew over us today & there has been a good deal of anti air craft guns firing both ours & Turks. We are still 10 miles from Gaza but can hear the guns distinctly & the bombs; Had an argument tonight as the Sigs have to find Headqrs picket again tonight\n","82":"\n\nSun 8th\n\nOur planes were going backwards & forwards all last night bombing by the moonlight; & one of our planes gave them a visit soon after sunrise dropping several bombs at 9 oclock an enemy plane came over observing she was very high & a\n\n8-4-17\n\nfew shots were fired at her but she was out off range; Ossie Hayes came out per train yesterday from Hospital & brought me a letter from Jessie; The orchards are out of bounds to us; From a sand Hill East of our camp we can see in the distance the tents of the men in the front line, we are about two miles from the sea. The Anti air craft guns get a good deal of practice on both sides otherwise everything appears quiet. we have had a very quiet day for Easter Sunday & are on Bully Beef & biscuit ration; A few of the Sigs took a pack horse to the canteen soon after dinner & bought them out but they only had a few biscuits & chocolates. We have a job to keep the natives out of the lines, they come around for waste fodder etc, & make themselves a nuisance\n","83":"\n\nMon 9th\n\nEnemy planes very active again this morning coming over us a couple of times followed by a ring of smoke from bursting shells. Had a parade this morning to clean saddlery; Gen Chauvel came past today but did not call; There appears to be nothing doing at Gaza at present, a big supply of gas helmets were sent up some time ago & we believe we are going to use gas shells I received a parcel from Jessie today Snakes are rather plentiful here, Lindsay Rich killed one last night in the moonlight & we saw several during the last day or two\n","84":"\n\nTue 10th\n\nJack Athorn (Sutherlands groom) took bad yesterday & was sent into Hospital this morning a good many lads are complaining of pains in the kidneys (the same complaint as Athorn`s) & large sick parades are the order of the day; The 3rd L.H.Regt shifted camp a mile nearer the beach today ; & close to new wells just put down; This morning two Sig Stations went to the opposite side of Khan Yunus S.E. & were signalling back to camp for practice; This afternoon there was a swimming parade, all the horses were taken & watered on the way back as wells have been sunk between us & the beach; a mine was reported washed up on the beach this afternoon; I came on\n\n10-4-17\n\nthe phone soon after dinner to allow the Sigs go on the swimming parade; An enemy plane came right over the camp just before sundown this afternoon our gunner put shells all around him & we thought he was hit but he swerved to the right, & continued his flight with shells bursting very close he is the gamest enemy plane I have yet seen. Two respirators per man is being issued to the men in the front line & men from each Regt I reported to D.H.Q. yesterday for gas instruction; We are to use gas shells in the coming attack & we are told that it only takes one or two sniffs of the gas used to settle a man, & as the wind always blows from the Turks to our position there is a danger of some of us suffering\n","85":"\n\nWed 11th\n\nThe Taube paid us a visit again today & opened up with his machine gun on us doing no damage; A supply of goods came in to the canteen today & there has been a rush on in consequence; Sergt Hayes is the gas Sergt of this Regt. & has been putting in a good deal of time daily & the B.H.Q.overhauling Respirators etc. We had a Sigs parade this morning 5 Sigs going to the opposite side of Khan Yunus & sending back to camp per helio. Grazing parade this afternoon.\n","86":"\n\nThurs 12th\n\nThe 4th Bde are camped about 1½ miles East of us they arrived a couple of days ago; This morning at 11 oclock\n\n12-4-17\n\noclock the 1st Bde formed up & came to Goz-El.Taire after travelled for several miles over fine country with plenty of good horse feed growing, passing large camps of infantry & Egyptian Camel Transport Corps, the part these Egyptians have taken in the war on this front is under estimated by most, A large army of Egyptians are constantly on the go keeping up provisions & water to the troops, which would be hard to replace by white men, as they look like ants the numbers working on the railway in the Egyptian Labor Corps There are also a few British West Indies Troops on this front they are ideal soldiers when they are not under fire but they are not worth the tucker they eat in a tight corner; We\n\n12-4-17\n\narrived at out destination at 3 oclock & took over from a yeomanry Brigade & the Regts split up, a squadron at each post about a mile apart & are digging trenches. I ran a phone line to A Sqdn as soon as I arrived & had a lively time doing it as Roger is very lively. I then ran one to C Sqdn & we were linked up everywhere in a very short time. A good many mud buildings are scattered about here these are now deserted, & are the home of \"cockies\" the country is undulating & practically the whole of it is under cultivation & our horses are having an exceptionally good time in consequence, a good many motor cars (armoured & otherwise) are flying about this part of the world; We met some tommies bringing in a captured Turk. \n","87":"\n\nFri 13th\n\nLast night the troops were digging trenches all night; I had to send out sigs to two observation posts early this morning, all the horses were led into the barley for grazing this morning; We were in touch with all squadrons . B.H.Q. & the 2nd regt per Helio & had some good practice; At 9.30 Sutherland & I decided to visit the Obervation posts as we could get a view of Gaza from one of them, both Posts were on top of deserted mud buildings; lizards of every description can be seen on any of the buildings & there is nothing inside any of them but remnants of broken earthenware\n\n13-4-17\n\nvessels etc. from the first post we saw Gaza several miles away & it looks a fairly large place, on our way to the other Posts two miles away, we passed over barley crops that would yield from 3 to 4 bags per acre the land is ploughed with a camel on the end of a stick plough that a man can carry about, this plough only scratches the surface & does not even cut out the weeds & it is marvellous that the crops grow at all, couch grass grows everywhere, there is very little or no sand in the soil here, & very dusty on the roads where there is much traffic; Crossing a Wadi (Waterways that only runs after rain)\n\n13-4-17\n\nwith steep banks & only crossable at certain places, we came to the edge of a small village & found a patch of Echalots & in a mud building alongside two men apparently the owners; About this time machine guns began to rattle, & looking up we found quite close to us & only a few hundred feet in the air, two of our BE2C planes & a new enemy plane above them, our planes exchanged shots but were driven down, one landing at the 2nd L.H.Outpost, the other returning to its hangar; The Bosche had an easy win against odds; Our BE2C planes are too slow for fighting machines & are used for bomb droppings; The new German planes \n\n13-4-17\n\nhave a superiority of miles per hour over the fastest planes we have on this front which are the Martinsyde & Bristol; arriving in the village which consisted of only a few huts & orchards we found it deserted of natives excepting 2 men one old woman a \"bint\" about 18 years old & 15 young children, we found Upham & MacNamara on top of a roof & they advised us not to look through the houses as they did & only found fleas to their sorrow; Our horses have had no water since leaving Khan Yunus yesterday morning at 10 oclock so we mustered what little Arabic we knew & paid the native family a visit & told them we wanted water they offered us an earthernware\n\n13-4-17\n\njar full but when we said we wanted enough for two horse it was a case of \"mafish\"; One of the \"bints\" was busy crushing barley into flour with the aid of two stones, this was rather interesting & we put in some time watching the process & yarning to the old man, then gave them Backsheesh & came back to camp, had dinner, ran in the telephone wires & carried on with visual till a Bde of Tommies arrived at 2.30 to relieve us, the Regt moved off & I had to wait for some time till the Outposts came in, arriving back at Khan Yunus at 4.30 after a good trip & a very enjoyable 24 hours stunt; Our horses fared bad for water as they had none till we arrived back; In the\n\n13-4-17\n\nvillages & dotted all over the country are orchards with green apricots, peaches & figs but we are a little too early; all the orchards in villages have a hedge of prickly Pear which would take a good deal of negotiating & it is these orchards behind prickly pear the Turks have their positions in Gaza\n\nI`d sooner face barbed wire; 6 of our planes bombed Gaza about mid day today. They are paying off an old debt of the 12th when 2 Taubes bombed our hangars at Rafa, our planes drop a ton of bombs for every one we receive; Patrols from both sides patrol to Shellal & Beersheeba but no troops stationed at either place\n","88":"\n\nSat 14th\n\nSoon after sunrise this morning a heavy bombardment commenced at the front & continued for an hour. It proved to be Turkish guns firing on our infantry camps, railhead, & the Mounted Troops also got a few casualties amounting to about 20 all told; Taubes were over two or three times during the day as usual but dropped no bombs. The enemy guns were located today but were not fired on as we do not want them to alter their positions. The YMCA at Gaza camp was hit by a shell & has not been seen since, Jack Hillier (a sig) went into the Field Ambulance today with a boil on the knee & evacuates tomorrow.\n","89":"\n\nSun 15th\n\nA record sick parade this morning (120) a good many men have been sent away daily from here; A church parade was held this morning at 8 AM then an inspection of lines & horses; an inoculation for Cholera & a gas lecture taking up the day; at 11 oclock this morning the Turks commenced another bombardment but it did not last long; Planes very active as usual on both sides; We had a New Zealand Sergt lecturing on the gas, we were issued with gas helmets this morning ; we are preparing to move out tomorrow evening & expect to be fighting shortly;\n","90":"\n\nMon 16th\n\nPut today in overhauling gear & cleaning up generally getting ready to move out, some more heavy gun firing from the front at intervals during the day; Eleven reinforcements marched in today . Pearson came on the strength of the Sigs today in Hilliers place; Left Khan Yunus at 9 oclock tonight & commenced our trip to the front line \n","91":"\n\nTue 17th\n\nHad a rotten trip last night we had the New Zealand, 3rd Bde & 22nd Bde in front of us & it was halting & trotting all night, early this morning we halted some miles to the South of Gaza in a \n\n17-4-17\n\nbarley field here we had breakfast & a Taube flew over us very low & the went back. Our Batteries & Warboats commenced a bombardment on Gaza at daylight & has kept it up all day; Armored cars & motor ambulances are common here. After breakfast we continued our journey till we came to to Wadi El Guzzi. Here we found plenty of good water & while watering our horses & all bunched together the Taube flew over again very low dropping 3 bombs killing 4 men & wounding 10 besides killing a few horse; We camped for the afternoon West of the Wadi & then took up a position for the night in a\n\n17-4-17\n\nnatural fortress in which the Turks had already entrenched for us, no phones used here & the lamps are busy tonight as all the messages are going through visually. One has to be careful walking about in the dark as this hill is very steep & the top a network of trenches around the bottom of the hill holes 7 or 8 feet deep are dug close together which take some negotiating, Upham fell down one tonight but was not hurt; The bombardment tonight is the heaviest I have heard; Two Taubes came over just before sundown & emptied a few drums of ammunition at us but hit no one; The 2nd Regt have to tranmit all message through us\n","92":"\n\nWed 18th\n\nHad trouble getting messages through to the 2nd Regt before midnight last night on account of dust caused by Troops moving between us. 5 of our armoured car coming from the direction of the enemy caused some commotion in A Sqdn during the night; Received a message from the 7th L.H.Regt this morning asking for an Ambulance waggon as 3 of their lads were wounded early in the night & could not get them in. We were relieved at 7 oclock this morning by the 22nd Bde (Tommies) We cannot carry the quantity of grain we are now being issued with on account of the horses eating so much grass & barley\n\n18-4-17\n\nWe made ourselves comfortable close & West of the Wadi till 11 AM then crossed the Wadi & the Bde formed up two mile East of the Wadi just out of range of the enemy`s guns; we waited here till 2PM in the meantime a Tauble came over us, we expected a bomb from her, but she tried to get in on one of our guns it landed in the gun team killing 4 men & several horses. We expected to attack this afternoon, but received orders to come back West of the Wadi again at 2 oclock ; With several sigs I then went for a bath & filled water bottles, as we go out at 11 oclock tonight, & attack tomorrow morning.\n","93":"\n\nThurs 19th\n\nWere moved out in a hurry at 8.30 last night & formed up East of the Wadi, had a slow monotonous trip halting for long rests every hour, I managed to get a fair amount of sleep as the night was fairly warm, at 4.30 this morning we arrived at Irk & found a Tommy Bde (22nd) had taken over our post; The 1st Regt had pride of place with C. Sqdn leading the way, leaving a Wadi at Irk at 6.30 C Sqdn galloped two miles & took up a position on a ridge under shell fire but only lost one pack horse from shrapnel. They had a good position behind an old mud\n\nwall & although they were heavily shelled all the morning they received no casualties; B Sqdn took up a position on the right of C Sqdn at 8 oclock they were hid to view from the enemy as they were by a steep watercourse. The Turks wasted a good deal of ammunition trying to get onto them but with no success. I ran out a phone line from Regt Headqrs to C Sqdn close behind them & then had to run out another mile & a half to B Sqdn; The attack on Gaza commenced at 4.30 this morning ; Our men are still 1000 yards from the Turks & it is practically an artillery duel in this part of the front soon after dinner Turkish Cavalry were reported coming up to\n\nreinforce the Turks, Our Hotchkiss guns did good work on them at long range. A Battery of Artillery opened up close by us this afternoon & had their horses hid in the Wadi A Turkish Battery soon got the range & things were merry for an hour or two, then our guns were moved, it was fine sight to see the Tommies get their guns away at the gallop & a heavy shell fire falling around them but they had no casualties; The Brig. & staff had a narrow escape this afternoon, a shell falling within 5 yards of Cox & Staff & no one hit. The 2nd Bde left an opening on our Right flank this afternoon & we got a surprise when a battery opened up & started to shell us from our rear, A Sqdn\n\nwas sent out to cut them off, but the Turks got back in time; although we had nothing to stop us from advancing our positions, the heads seem content for us to hold the line we have taken up. It is rumoured this evening that Gaza fell into out hands this morning but everything is very vague & doubtful, the Turks attacked all along the line this afternoon; At dark we left an outpost to hold the positions & commenced to go back to Bir-El-Jimonil, here we watered our horses \n& came on another two miles to camp\n about midnight after a very tedious journey halting & dismounting every few hundred yards; The Regt only received two casualties today both C Sqdn\n","94":"\n\nFri 20th\n\nWe pulled up at 5 oclock this morning & put our horse lines down had breakfast & everyone laid down anticipating a days rest, as we have all suffered badly for the want of sleep. I was awakened at 8 oclock & told to saddle up at once as we had to move out again; Unshaven bleary eyed & dusty we look a rough lot, we only came South a couple of miles this morning when 4 Taubes came over & gave us a fine exhibition of bomb dropping 6 men killed including a 2nd Regt Officer (Sinclair) & 30 men wounded; One bomb alone killed 14 horses & all the others accounted for some 14 bombs dropped in all on this Bde; A clearance station was put up by a mud hut close\n\n20-4-17\n\nby ,& the Drs. had a busy time & a burial party told off; \n\nThe Taubes were hardly out of sight when 6 of our planes came over loaded with bombs & retaliated with a Taube flying above them, we heard later that the Taube came down & brought one of our planes down the bombs she was carrying exploded as she hit the ground; another one of our planes getting above the Taube dropped a bomb on her breaking off one wing & the Taube also crashed to earth; Johnny Heegan (Lt) of our Regt was wounded in the leg today by a bomb & Turner of A Sqdn killed; We remained where we received our issue of bombs till 3.30 & then moved down to the Wadi & watered our horses & the 1st \n\n20-4-17\n\nRegt came East of the Wadi & put out outposts for the night, \n\nHeard today that the Tommies took Gaza yesterday with the aid of gas & tanks but the Turks counter attacked & retook them & the position today is very unsatisfactory. Our horses had no water from 2PM on the 18th till 2 oclock this morning as we are afraid of the wells being poisoned.\n","95":"\n\nSat 21st\n\nHeavy dew & very cold last night but I slept well & am feeling fit again today; We have Observation Posts out & getting plenty of visual work, as the Observation Posts are in sight of the enemy; Our horses went to water a troop at the time this morning\n\n21-4-17\n\nThis afternoon Hop James Troop has been having some fun with Turkish Cavalry; taking it turn about chasing each other trying to draw each other within range of machine guns some shots were exchanged during the afternoon & several enemy saddles were emptied & prisoners taken. Taubes were very active all day & at 4 PM 3 of ours came out bombing & only two returned apparently he was brought down as we could see a big fire some miles away just as the other two returned. The pilot must have fired it after falling in the enemy lines she was a Martinsyde (one of our best) We were relieved by the 22nd MW Bde just before sundown & watered our\n\n21-4-17\n\nhorses at the Wadi as we crossed & formed up on the West side, boiled our \"billies\" & had tea & at 8.30 started on a 20 miles trip to Abassan-El-Kebir, about 2 miles from Khan Yunus arriving here at 11 oclock we put the horse lines down & ready to turn in, had a great trip as the 2nd & 3rd Regts came in earlier & the 1st was on its own.\n","96":"\n\nSun 22nd\n\nWoke this morning by hearing Frost shouting orders to \"saddle up everywhere\" & found the sun high; none of the Sigs were up & we sprang to it & shortly after shifted our position ½ a mile West just had our line down when a Taube came over & dropped 4 bombs\n\nwounding Sergt Buckley A Sqdn (slightly) & Tpr Barnes of C Sqdn (serious) a couple horses were also hit; At 3 oclock this afternoon we received orders to move to Abu Sitta (4 miles East) we arrived here just before sundown Mail arrived today & was brought along with us. I received a parcel from Jessie & Florence to be divided with Jack Wright; Clem Harris got one between Vern & himself. Sig Cpl Watson to Hospital.\n","97":"\n\nMon 23rd\n\nThe Brigade has a little sense at last & we are now camped with a good distance between Troops & instead of standing with our horses during bomb attacks we lay down by our saddles, everyone is\n\n23-4-17\n\nbusy this morning digging a small trench to lay in. a Taube came over early but dropped no bombs, Bde ran out a Poled telephone line last night so it looks as though we are here for a few days; Reports of the recent fighting say that our casualties for the whole Force is 14,000 & the enemy suffered equally as heavy if not heavier as they counter attacked & the Artillery fire wiped out the whole of the attacking party. We lost 2 tanks; The Anzac Mtd Div had 600 casualties, 300 of these were in the 3rd Brigade; Gen Dobol has been recalled & Gen Chetwood is in command of the Eastern Force; Gen Chauvel in command of Desert Column\n\n23-4-17\n\n& Ben Chater in Command of the Anzac Mtd Division; We gained 2,000 yards of country but Gaza appears to be no mans land, at present, & trench fighting goes on; An enemy plane was brought down in our lines by one of our Anti Air Craft guns today & the pilot proved to be an Austrian lad 19 years old, he landed at our aerodrome with a broken wing. It is reported that the Turks are waiting on a special ammunition we expect it is gas. We are told now that gas was not used in the recent fighting; Merghar Mack came back again today & brought a letter out from Jessie\n\n24-4-17\n\nTue 24th\n\nHad a gas helmet inspection this morning & then Upham & I went to the 2nd Bde about 3 miles south of us at Hill 410 where we were bombed a few days ago. The 7th Regt. is doing Outpost on the Wadi, I found Mayberry is in details (Moascar) & that T W Oates has been boarded for Australia we returned after seeing no one we knew; it is a very sultry day & no pleasure riding stopped at a well on the way back, watered our horses & had a wash; received a parcel of cake from Edie this afternoon; During last night a heavy bombardment took place & the Sigs intercepted a message this morning saying we\n","98":"\n\nshelled the enemy last night with gas shells & the Infantry walked into the redoubts shelled, unopposed; this is the first time gas has been used on this front; A Squadron of the 5th L.H. surrounded 21 Turkish Cavalrymen this afternoonl, killing 4, & 17 surrendered. The 2nd Bde & New Zealanders have asked not to be relieved; as they are enjoying themselves with Abdul\n","99":"\n\nWed 25th\n\nSutherland went into Khan Yunus yesterday afternoon to have a tooth drawn, he has been far from well & went out to it for two hours arriving back he reported sick to Capt Wells who told him he had:Taubeitis\" & would\n\n25-4-17\n\nprobably be alright in a few days time, later he went to the Field Ambulance & saw \"whisky\" Dawson (Col) who told him he would have to be operated on again straight away; At 9 oclock this morning all the horses were taking off the lines & grazed on their way to Hissieh (6 miles away) here they were watered & then brought back; we have been watering them with water brought in fantasees on camels since we came here. Orders came through at 10 oclock tonight to be ready to move out at 3 oclock in the morning to go to Shellal as the Turks are expected to attack; Sutherland is going to Hospital tomorrow, he went over\n\n& saw Gen Cox who gave him leave for two days to allow him to travel toCairo & report at the 14th A.G.H. without going through the Field Ambulance Stations; He says he will never rejoin the Regt again.\n","100":"\n\nThurs 27th\n\nAt 3.15 this morning we formed up & the Bde moved off & daylight found us close to Shellal but no sign of the enemy soon after sunrise we watered our horses,& returned to Camp arriving here at 10 AM & slept till mid-day; Then received orders to move at 3 oclock & arrived back at Shellal\n\nJust before sundown & had a busy time laying wire to the 3 squadrons. C Sqdn is at\n\nHissieh . B midway between, & A out in front, I was going till after dark; Our Headqrs is situated on a hill in the Wadi & quite close to the water which is very good & is a spring from a rock, supposed to be the rock struck by Moses the air around here is rather putrid from 18 dead horses on the side of the hill & a little higher up the Wadi, the result of a bomb; The banks of the Wadi are very steep & high & only crossable at certain points Sutherland left us this morning.\n","101":"\n\nFri 27th\n\nThe last 3 days have been very hot & no blankets required during the night, but there is a change\n\n27-4-17\n\ntoday & we are having a little rain soon after breakfast. I went down to water, had a bath & washed my clothes, we have a visual sig station on the top of this hill, & it is an old tomb apparently as the top of the hill a few inches under the earth is figures of leopards, goats, horses, eagles, snakes Etc also characters apparently in the Greek writing, these are set in with different colored stone, the blue being very much like bluestone; These are all very well done; Capt Wells is a bit of a crank in old ruins & has been putting in all his time digging at the top; The 3rd Regt \n\n27-4-17\n\nrelieved us at 5 oclock this afternoon & we went a mile up the Wadi to Camp. I broke my pen yesterday & was given another by Vern Harris, this evening ; The 6th Regt has patrols out in front today who are in touch with the enemy.\n","102":"\n\nSat 28th\n\nThe 3 Squadrons of this Regt went out at 6 oclock this morning & kept in touch with Abdul all day ; A few shells were flying from each side & the Turks fired a few rifle shots but did no damage; I ran out ½ mile of wire this\n\n28-4-17\n\nmorning to an observation Post & endeavoured to keep in touch with the squadrons per helio but with poor results as the sky clouded early & it has been a cold cloudy day .\n\nI have been kept very busy lately; Large camel trains have been constantly on the go all day carting water in Fantasees from the Wadi & storing it a few miles back for reserve; Things would have been very uncomfortable here for us if the Turks had remained in possession of the wadi as it is the only decent supply this side of Khan Yunus. Received an Aust Mail today.\n\n"}}