{"Document Name":{"0":"Diary_0456","1":"Diary_0456","2":"Diary_0456","3":"Diary_0456","4":"Diary_0456","5":"Diary_0456","6":"Diary_0456","7":"Diary_0456","8":"Diary_0456","9":"Diary_0456","10":"Diary_0456","11":"Diary_0456","12":"Diary_0456","13":"Diary_0456","14":"Diary_0456","15":"Diary_0456","16":"Diary_0456","17":"Diary_0456","18":"Diary_0456","19":"Diary_0456","20":"Diary_0456","21":"Diary_0456","22":"Diary_0456","23":"Diary_0456","24":"Diary_0456","25":"Diary_0456","26":"Diary_0456","27":"Diary_0456","28":"Diary_0456","29":"Diary_0456","30":"Diary_0456","31":"Diary_0456","32":"Diary_0456","33":"Diary_0456","34":"Diary_0456","35":"Diary_0456","36":"Diary_0456","37":"Diary_0456","38":"Diary_0456","39":"Diary_0456","40":"Diary_0456","41":"Diary_0456","42":"Diary_0456","43":"Diary_0456","44":"Diary_0456","45":"Diary_0456","46":"Diary_0456","47":"Diary_0456","48":"Diary_0456","49":"Diary_0456","50":"Diary_0456"},"Date":{"0":"unknown","1":385.0,"2":386.0,"3":406.0,"4":407.0,"5":408.0,"6":464.0,"7":491.0,"8":515.0,"9":525.0,"10":532.0,"11":609.0,"12":610.0,"13":611.0,"14":612.0,"15":620.0,"16":621.0,"17":624.0,"18":625.0,"19":626.0,"20":635.0,"21":647.0,"22":648.0,"23":649.0,"24":652.0,"25":653.0,"26":654.0,"27":655.0,"28":656.0,"29":657.0,"30":658.0,"31":688.0,"32":689.0,"33":690.0,"34":719.0,"35":720.0,"36":721.0,"37":722.0,"38":723.0,"39":724.0,"40":725.0,"41":726.0,"42":727.0,"43":728.0,"44":729.0,"45":736.0,"46":737.0,"47":738.0,"48":739.0,"49":741.0,"50":742.0},"Entry":{"0":"\n\n","1":"","2":"\nEnlisted at Victoria Barracks for the Light Horse.\n\n16th\/\nWent into camp at Liverpool. 28 miles from Sydney on main Southern line. We marched down from the station to the camp, there were about fifty of us; The quartermaster soon dished out blankets & eating utensils, & the next thing was tea oh, plenty of bread & jam if nothing else; then the few old soldiers among the crowd\n\ntold us tales of their previous wars.\nI rolled into bed thinking of what I should be doing on the morrow. I woke up to the sound of bugles blowing all over the camp , \"Get out of bed you sleeply heads\"' so the next thing was to up & dress & have a cup of coffee with epsom salts added; The bugle sounded \"fall in\" & away we went for physical excersises till 8,am. which was breakfast time.\n I had a small breakfast as I did not understand the idea of getting in for your cut, We again fell in at 9 am & were sworn in as soldiers of the King, blue suits & white caps\n\nwere issued out & then for learning the foot drill & rifle. I was put in the training squad for a couple of weeks.\n","3":" 1st\/\nFifty of us made into the","4":" Reinft. of","5":" Regt. The month was continued with the usual: camp drill, gaurde & range shooting.\n","6":" 3rd\/\nWent on final leave to Aberdeen & had a good time three days only were granted for final leave; came back & we are expecting to sail any day.\n","7":"\nWent to measles contact camp, when about to come out fell sick with influenza. The troop sailed on","8":" & I missed them, it was hard luck.\n\non my part , after getting to know all the boys, & I must say they were a fine lot in the troop & many were from the Upper Hunter district where I first contracted the war fever.\n","9":"\nOther reinforcements formed & I got into the 9lth of","10":" Reg with some mates of mine.\nWe had a very hard time at drill for some weeks under an officer named Prideaux Brune who was once an officer in a English Calvary Regt, he was not popular with the Boys We are now ready for Egypt when boats are available .You will notice that I miss writing down notes for a few\n\nweeks as the usual routine of camp life goes on, the weeks pass on to","11":" when we have some range shooting. Mounted gaurd at 5pm on till 5pm.\nThompson; Gallaher; Day went on their final leave, so the day looks near when we shall say good, bye to Sydney town for a while & plenty for ever.\n\n23rd\/\nEasy day , fatigue work, it looks like being wet for my final leave.\n\n25th\/\nWent on final leave to Taree with my mate Harry Milner\n\n26th\/\nArrived at Taree.\n\n27th\/\nWired for three days extra Reply, granted to","12":"\n","13":" 29th\/\nFriends took us to Wigham by car, went up the manning river by boat.\nHad an invitation to tea from Mr. George Langly. Had a good evening, found the old fellow a real sport, he has a son away with the","14":" L.Horse.\n\n30th\/\n Left Taree for West Maitland Had breakfast with the Gilberts. Said good-bye to friends & left for Sydney.\n\n31st\/\n Spent day in Sydney & arrived back to camp for bed.\n","15":"\nReceived Regimental No\/1227. Full dress parade, Payday, had a letter from the mater.\n","16":"\nRiding all day\n\non stable picquet. I may mention that my brother Harry enlisted after I did & he has Sydney with the","17":" Battalion.\n","18":"\nWent down to Rosberry Park as a gaurd over stores etc for range squadron. Had an easy three days.\n\n11th\/","19":" on gaurd came off Monday night.\n","20":"\nInnoculation for troop Kit inspection, armed gaurd for pay officers.\n","21":"\nWent down to Lewisham to see May.\nParade inspection by Col. Kirkland & staff\n","22":" \/\nNominal roll call & issue of under clothing etc.\n\nGrand parade for Minister of Parliament. Went to Lewisham to fix up bank account.\nSaid good bye to brother Sid & all at Lewisham\n","23":" 30th\/\nUp at 3.30 am. breakfast at 4-45 entraindes at Liverpool at 5 am. arrived Sydney 6-21 am\nIt was great to hear every available whistle on the engines give us a send off, We were meet at the station by crowds of people who gave plenty of tobacco, sweets etc, then for the march down to the troopship, there were 1200 of us in all with the infantry what a sight to be sure.\n\nI had no one there to see me off but some young ladies made themselves known & helped carry a few of the many things a soldier has. We embarked on the good ship Argylshire at 8pm.\nGreat crowds came to say their last good-bye & many thousands of flags & banners waved & the boat being tied to shore by streamers the sight was a grand one to be sure.\nWe soon pulled out into the stream & dropped anchor.\nHad a good dinner at 2pm. & felt the benefit of such; tea came on at 5pm then up anchor & away to the\n\nhooting & noise of the many steamers & ferry boats in the harbour; the \"Capt. Cook\", the pilot boat, left us at the heads .\nAll being tired after the day of excitement we turned in to our new kind of bed, the hammock, I prefered to lay on the decking after the first night.\n","24":" 1st\/\nOff the Victorian coast. Sea fair, Getting to know the old boat like a house.\n","25":"\nSea slightly rough a terrible lot of the boys sick.passed two vesels one sailing for Sydney\n\n5\/\nChurch parade, the sea washed things about a bit\n\njust about to enter the the Australian bight\n\n6th \/\nSea calmed down most good spirited again\n\n7\/\nThe sea is lovely .\nRifle inspection & fixed life belts on. I was made hammock stacker, my duties are to issue hammocks at 6 pm.& stack them at 6am\nWrote a few p-c to Sydney & home\n\n8th\/\nPlenty of Physical stunts my birthday just 20 yrs.\nWe have change our course for Albany to drop some very bad cases of sickness.\n\n9th\/\nCleaned up equipment & dressed for parades.\n\nArrived at Albany at 2pm. left again at 5pm not allowed off the ship\n\n10th\/\nRaining. Passed Freemantle sea freshened.\n\n11\/\nChurch Parade. Several good fights on board.\n\n13\/\nThirteen days out at sea. Man died at sea he was out of the","26":" of the 17 Batt.Beural Service at 5pm.\n\n14\/\nTwenty four of us on gaurd looking for submarines\nI lost my bayonet overboard came off gaurd at 8.30\n\n15\/\nWere all paid 14\/-\nSaw a big shark. Sea very calm.\n\n17\/\nWent to church again.\n\n19th\/\nA lovely day, poor fellow of the 4th Reinft 19 Batt fell down a hold & was picked up badly injured he died at 8pm.\ninnoculated for the 4th time\nlife boat drill.\n\n23\/\nBoxing tournament opened cleaned up for gaurd\n\n24\/\nSaw more sharks & whales. Sighted two vessels at four oclock\none looked like transport & the other a torpedo boat destroyer\nfour-thirty sighted land passed the two brothers & one large Island; two vessels travelling behind us about about four miles distance\n\n26\/\nSighted land as soon as\n\nwe arose at 6. am..passed an Island at 9am supposed to be Point Hells; a few houses on it & wireless station, light house. we saw a shark that looked quite 20 ft long.\nThe sea is lovely & calm here. We had to fall in at 10am. to be inspected by our OC passed a chalk Island with a lovely looking lighthouse upon it.\nTwo small steamers passed us at this point .\nA Boxing contest passed the evening away & we gave a few good coo-ees to a passing ship.\n\n27\/\nNice day. Three boats passed.\n\n28\/\nTwo ships passed, one was the Ballarat which had left before us & had called into Aden.\nTwo birds like Kesterels are perched upon the yards all day.\nWe were paid the sum of 14\/- so there will be a little game of two-up & cards going again, about two men have got the last pay now. Won it at two-up etc.\nThe final of the boxing tournament carried out. Some good fights occurred.\nI was picked out for Ships gaurd when we reach port.\n\n30\/\nPassed an island of rocks with a lighthouse upon it\n\nMy kit bag missing from the hold. So I shall have to claim another, there were many things in my bag. I did not want to loose as they were presents.\nArrived in the bay off Suez at 8 am. & stayed a day At 8 am the next day we disembarked & entrained for Helliopolis camp just out of Cario, we had three miles to march from the station to the camp with our kits it was no good I can tell you I saw some grand sights en-route from Suez.\nWe pulled up at a station half way between Suez &\n\nCairo & the train was rushed by a crowd of niggers selling all kinds of fruit & cigarettes.\nThe noise of them shouting out oringars & other pecular names. I shall never forget.\nThere was no tucker for us when we arrived at the camp so we had to go into Heliopolis for a feed & the niggers did try & do us on the prices as we had English money.\nWe learnt next day that we were not reconized for 24 hrs so we again to Heliopolis for breakfast & then proceeded to see this wicked Cairo that we had heard so much of. We had to learn their\n\ncoinage first. I found Cairo about the most filthy place, there is on earth & most immoral. There are a few nice buildings & gardens\nThe Sultan arrived at his palace while we were viewing his domain, his body gaurd the Egyptian Lancers looked well as they rode past.\nThere are some nice buildings around Heliopolis the best being the Palace Hotel now the big Heliopolis General Hospital.\n","27":" \/4th\nHard at drill in the sand & dust storms nearly blind you, practising trench warfare & open\n\nformation drill.\n\n5th\/\nMelbourne Cup run.\nThe","28":" 10\/1 6\/12 Reinforcements arrived by the Moltdavia\nThe tucker is a little better each man allowed 8½ worth of rations from the canteen it being given by the Egyptian Government.\nHarry Milner a mate of mine taken to Hospital with mumps he being the tenth to leave us with the same complaint\n\nNo6\/\nMounted main gaurd.\nHeard that C. Thurlow from Scone who was with the","29":" of the","30":" is still here in camp as a farrier –Plenty of upstanding horses\n\nhere waiting to be used. Their owners being on the peninsular. This camp is called the Areodrom.because it used to be the flying camp.\nWent for a route march across the desert.\nPaid 34 pisastres equal to 7\/- It will not go far as things are so dear,\nFelt sick all day. Wrote to Mother May, Nellie & sent xmas cards.\n","31":"\nNo parade. went & looked up C Thurlow, & also South\n","32":" 10\/\nSent parcels of silk away\n\n13\/\nNothing unusual has happened lately. Receiving plenty of drill & bom throwing, 200 men left camp for the Dardanelles\n\nThe troops broke into canteen & took £20 worth of stock & rolled two barrels of beer out side. The canteen was run by Gypos who had been overcharging the troops hence the bust up.\n\n18\/\nShifted camp, now quartered in large E.P. tents .Paid 68 pisastres.\n\n20\/\nReceived orders to get ready mounted, only half the troop available others being away sick.\n\n21\/\nGot horses, saddles etc at the Luna Park. Racecourse. & proceeded to Railway Station to truck for some unknown place. We ended up by\n\nlanding in Alexandria at 8.30 pm. I was put on gaurd over ammunition till 4 pm next day, we had no rations left us, so had to go into town to buy.\nWe had the name of the Regiment given to us as No 2 troop B Squad","33":" Composite Cavarly Regt.\n\n25\/\nHaving plenty of Squadron drill\n\n26\/\nG.C parade full kit on saddle\n\n27\/\nMarched three miles on a bathing parade. the water was glorious\nInspected by Brigadier General Briscoe who will command the Brigade.\nMet Bryian Burke of Ulah\n\nhere in C Squadron\n","34":" 3\/\nRoute march through Alexandria. The whole Brigade turned out .\nWe rode in half sections & made it look as if there were double the number.\nIt was a ruse to let the niggers see that their was still plenty of troops left in Egypt. The niggers have been playing up with Turks urging them on\n","35":" 7\/\nLeft Mex camp at 11.30 pm My old horse Kaisa Bill gave me a good fly for freedom but I managed to sit him.\nWe entrained at Gabarry Station for some unknown\n\nstation due West.\n\n8th\/\nArrived at Railhead at","36":" am after travelling all night. New Zealand soldiers camped here also Egyptian camel corps.\nWattered horses at well the water was putrid.\nWe then started to ride for our destination & did about 25 miles & camped near well gaurded by Indians.\nWe watered horses & had tea Up again next morning at 2am. Saddled up & away upon the track again.\nI was in a party told off for the rear gaurd; wagons began to get stuck up & delayed us from advancing for sometime, arrived at\n\nnext well at 2-30 am after halting several times to feed up. Camped for night, rather for morning.\nHoses & men relish a good drink of clean but salty water unsaddled & fed up, had a sort of tea & fell off to sleep.\nWe did 30 miles that day.\nUp at 6 am for a change that was badly needed both for horses & men, watered horses at well a slow process as we had to draw the water up in small canvas buckets & keep waiting for the well to fill up fed up horses & packed saddles for a move off\n\nat 9 am.& we ought to get to our destination to-night sometime & I can tell you we will not be a little bit sorry as it becomes very dull seeing nothing but sand day after day.\n","37":" 11th\/Saturday\nArrived at out base camp at 5-30 pm. The name of the small town is Matruh.\nIt took us four days & a night to get here from El Dabba the Railhead.\nWe soon set to work & got the horse lines down & gave the horses a good feed.\nA squadron went out patrolling eight miles from here, The aeroplanes\n\nare coming in & reporting enemy in small numbers.\nFighting supposed to be going on 12 miles from here, so we ought to soon be in the thick of it.\nThere are two aeroplanes here & they are kept busy scouting the desert.\nTwo Tommie's horses came in with blood stained coat on saddle with rifle in the bucket & sword gone.\nWe now hear that the Yeomanry was ordered to charge down a hill with swords drawn; they lost ten men & their officer. I appears that they came abruptly to a precipice & the\n\nmen could not control their horses while they had swords drawn. The above account points out the mistake the military have in trying to teach men to ride with a rein in each hand instead of both in the lefthand.\nColonel Snow was wounded in the same action & died after reaching hospital, he knew this country better than any other man on the staff as he was stationed here for many years. So his loss to us is great. I may as well mention the case of carelessness that resulted in his death\n\nIt appears that a Tommy had taken a prisoner & only took his rifle from him & never troubled to search him for arms. Col Snow approached the him with some question relating to the enemy, where upon the prisoner drew a flint lock pistol & shot Snow in the stomach, the poor fellow suffered great pain before he died. Of course the prisoner did not stand up long after that affair.\nIt just shows that you cannot be too careful.\nAll the nigger population has left this town, they were frightened\n\nby the Turks saying the English would kill them if they stopped\nThe Egyptian garrison had left & joined the Bedouins & Senussi that are up against us. The Egyptains took the guns from the fort & all food stores etc. I do not think that many Egyptain soldiers will be spared after being trained by Britian to turn against her.\nThe above statement gives you some idea what the Egyptain army would do if Turkey once broke through into Egypt.\n\nI have no time now for the Egyptain & they will always keep their distance from me.\nThe Bedouin & Senussi tribe numbers about 2,500 strong & they are a cruel race of people; they kill all the wounded they come across. So God help a man if he fall into their hands.\n\nWe have our saddles packed with coat & blanket ready to move out at a few minutes notice if wanted I was put on horse picquet .We had a little better tea than we have had on the track from the Railhead\n","38":"\nOn stables then fatigue. We gave the horses a salt water bath & had one ourselves, it was glorious & the horses enjoyed it after their long & dusty trip.\nWe are lucky to be near the sea; as there is nothing else to see but sand & sand.\n","39":" 13\/\nWent out with 5 men & a corpral as a water gaurd 3 miles towards the enemy's position. We searched every old house for enemy but only found five rifles & some old pistols & a few coins.\nWhen we arrived\n\nback at out base camp about 6.30 pm we found it deserted, all the squadrons B,C, having gone out to help A squadron who had got into a gully & were cut off we the water gaurd were mad to think that we had just missed the fun, so tea was prepared & then rolled into bed.\nWe met a dispatch rider just before we turned in & he told us that one of the areplanes had five holes drilled through her & that one missed the petrol tank by ½ inch it was a near shave for\n\nthe pilot.\nWe heard four or five shots fired about 12pm. by the outposts. So thought we might get a call out, but nothing did happen.\n","40":" 14\/\nHad breakfast & watered up all the horses left on the lines, went for a swim, had roll call of the men in camp there being 17 men & 60 horses most of the latter sick\nDispatch came through that there were a couple of bags of mail for us at the railhead El Daba. but the enemy were between us & El Dabba so I\n\nexpect it will go back to Alexandria & ship across.\nWe have about 10,000 men on this front so there will not want to be many causalities but if we get a decent go at abo . we will soon account for them.\nThe enemy conceal themselves in & behind rocks in caves so they give us some trouble in picking them out; In fact they are a army of snipers & every man seems his own captain but there are Turkish officers behind them to instruct them in certain\n\naffairs.\nOur advance party gets the worst of it, as they might be riding along thinking alls well when a sniper will drop him from a distance of a few hundred yards away who is behind the small bush that grows upon the desert or he may be going down a ravine when crack, crack from every direction reaches his ears & before he can locate the spots of the sniper or retreat, he often get potted. I must say it would have never done for them to be such shots\n\nas the huns or Turks. or they would have had a great many of us as they have had plenty of chances at times\nWe hear that the Yeomanry & the (siks) the Indians) have lost a few men each.\nWe have six wounded & 1 killed so far.\nLastest news our forces retiring back on their camps, The gunboat is bombarding the enemy on the coast.\nIt seems funny to retire but no doubt it's a ruse to draw the enemy out from the hills of which they know every nook &\n\ncrevice, if we could manage to get them out they would soon know what our guns can do, when they can get good targets.\nWe retreated back to camp with 26 prisoners which we should have never taken as they are very cruel devils when they find our wounded\nTheir women folk are fighting with them, they finish off the wounded.\nIt is alleged by the Indians that after a battle the women traverse the field with knives under their dresses & they cut & torture all the poor wounded.\n","41":" 16th\/\nOut pattroling, found enemy near camp, so we had a cut in at them.\nThey must have thought they had us nearly under. Seeing us retreat in disorder so got much more game & came closer, they soon bolted back to the hills when they found us with plenty of bullets for them\nWe cannot do much till reinforcements arrive from Alexandria. The track that we came by is now blocked by the enemy & they have been trying to take the Railhead; but they will find the\n\ntask hard, as the N.Z.s are well entrenched & a armoured train is constanly up & down the line to Alexandria & if it spots poor Bedouin pity help him.\nSome of the heads, seem to think that the enemy will shell our camp one of these dark nights, they would play havoc with the horses if they did, so we have fixed up things ready in case; but I don't think they have the guns to reach us; but of course they could obtain them from the Turks who are\n\nbacking them up. In case the camp is shelled we have orders to saddle up etc without noise, then file down to the sea & take cover under a great sand dunne.\nOur squadron is on duty today dispatch riding gaurds etc, There are plenty of shells flying overhead, making some noise as they go. I don't know a great bombardment must sound like at the Dardanelles or in France but I expect I will know before I reach home.\nWe hear very little news\n\nof the doings of the war, althoug we may be near it, the people at home know better how things are going, We got home for tea at 6pm, I had to go on gaurd, & it was not up to me to take my turn, but it is no use grumbling about it.\n\n17\/\nThe Artillery started firing over the hill at 9am from their camp at targets for practise All troops ordered to be ready for march so there must be something doing\nHad six letter by the\n\nmail just arrived, on from May saying that Frank had died from wounds in France on","42":"\nHad a nice letter from a Lady in Australia saying she was a member of a Lonely Soldiers League & would like to send me letters & parcels being a lonely soldier. Well I am not exactly a lonely soldier but I wrote & assurred her that I would be pleased to hear from her in the future.\nWe have 12 boys in the tent so a parcel will not go far amongst the mob, but\n\nall are welcome.\n","43":" 24th\/\nNothing much to write of since the","44":"","45":" On gaurd at well for 24 hours.\nThe Scoties are camped here near the well & we hear some broad Scotch they seem a happy lot of laddies if they do only get a small sum to bust up.\n","46":" 1915\nReville at 3.30 am.\nSaddled up at 4.30 am. left all spare kit etc rolled up & put on waggons, so it seems as if we intend\n\nto make an advance up country, Rode out of camp at a quarter to five, about four miles to-wards El Daba railhead.\nI must not forget to say that old Kaiser Bill, my horse, did not approve of travelling with me on so cold a morning & he tried to be rid of me, but I know his games & ways by now & stuck to him like a leech. as I know it would be good –day fun if he got away, I will now carry on with the days events, after going four miles on the road we came, we went half\n\nright, which brought us into a big gulley which took some climbing out of at the other end, after we came out of it we found ourselves out on another peice of flat country extending a few miles to another belt of hills.\nWe then saw that the move was to get behind the enemies forces.\nWe had not travelled far before we heard & saw one of our planes coming over at a great height, then it circled arround till our foe was spotted.\nShe then took the range\n\n& direction to our artillery who soon sent shell after shell amongst the niggers, they went for their lives in every direction for cover.\nWe then had the order dismount' for action front.\nWe, the three men of each section soon hopped off & handed the horses over to No.3 the horse holder of each section, I might as well mention that my section was the fourth in the troop besides myself who was section leader it contained Dixon, Hindmarsh, Bridges.\nWe each section had\n\nto double up about a hundred yds & then fall down quickly in the prone position & then let them the enemy have it as fast as you could pull.\nIt seemed funny at first to dismount & let your horse go away when the bullets were whizzing arround.\nWe all seemed very excited & it took some minutes to cool down & fire steady\nWe opened fire at 500 yds we dropped a few. Theiy then retired back to 800 yds range from us, then they opened up\n\nagain on us, They were mounted upon Arab horses, camels & some even on donkeys.\nThey soon decided that we were too good for them & then they made for the nearest ridge, & we kept following up, we lost a few, but nothing like they lost.\nWe had several engagements like the above during the day. but the biggest came after lunch. We halted for a while to feed the horses & have our Xmas Day dinner which consisted of a tin of beef to two men & two\n\nbiscuits per man. we just had a mouth full when some insulting niggers had found our stopping place & began to send big leaden bullets around us, so that was the signal to Bridle up & move on\nI may say it was queer hearing the big bullets whiz past you & thinking the next might be labled for you: they had many kinds of rifles, some old faishoned to the lastest Turkish & German. The big leaded bullets I have mentioned about were young shells compared with our\n\nrifle bullets. The allied force in general managed to drive most of the enemy in to a large ravine that ran out on to the coast; Some exscaped along the coast, but we counted nearly a thousand in this gully later,\n It was mostly hand to hand fighting in the ravine as it was full of caves & the enemy would not come out so the N.Z..s & Siks cleared the cave with bayonets & this is where our force lost most of its men as it was all in the niggers favour, knowing & occupying\n\nthe caves.\nWe started back for our camp at 6pm & arrived at 10pm.\nIt rained very hard on the trip home, we all got wet through as the O.C. would not allow us to strap our coats on the saddle, & the weather did not look took bright when we left. We were wet but happy thinking we would have a good rum issue when we arrived in camp, but no there was no rum on tap, but plenty of rain.\nWe had to fix the horses up for the night & sleep out in the rain as all\n\nthe tents had been pulled down & packed on waggons but being tired I put on a little sleep.","47":" being the next day, we had a easy day as the horses wanted a day or so spell after their climbing hills & trotting over deserts.\n","48":"\nI got on boat fatigue but we were not allowed to touch anything.\nIt was Gift stuff we had to unload & as the ASC. & Supply officers had not looked at things & helped themselves we had to leave them untouched so I strolled back to camp\n\nfor a sleep but when I got to the tent I found the boys putting their harness on & going out to saddle up, They said you coming with us. I thought for a minute & said bet youse I am & I was not far behind.\nOur strenghth all told were 40 men.\nWe were to go out reconotoring We meet the enemy five miles out from camp. two of their camels were shot & had two of our men early in the fray.\nThey the enemy, retreated quickly under our fire to a big hill\n\nWe hunted the caves in Dead mans gully as we had called the ravine.\nWe had shot two niggers who were hiding in a cave.\nWe also found one woman dead & one wounded; the women will keep with their men; they help to bring up ammunition & dress their wounded & murder ours,\nI may as well say we were led by a silly fool of an officer named Nobbs, he decided to advance upon the hill occupied by enemy, as soon as the horses were brought across the ravine we\n\nwe mounted & started off for the hill in extended order, after going about a hundred yds bullets began to rain around & upon us. I thought it foolish to continue, but the officer did not till one of the boys were wounded, then he gave the order to retire, & about we went. I was soon out of that warm spot, if the enemy had held there fire till we reached the foot of the hill, they would have had some good shooting. Then we retired to the gully &\n\noverhauled their their transport camels that had been killed on Xmas Day, we found a few books & papers, nothing of value; but I took some Turkish & Egyptain stamps off envelopes, we next made a fire of their packs. Being near on five oclock we gathered some of their shells & rifle ammunition & trotted back to camp.\n","49":" 27\/\nMost of the troops moved down towards El Dabba railhead to meet a large number of niggers who are preparing for war.\nWe hear that the Arabs\n\narround Cairo and rising up & that large numbers of our troops are stationed along the Suez Canal awaiting for the Turkish advance\n","50":" 28th\/\nWoke up with terrible pains in the stomach I put it down to bad drinking water; I went & saw the Dr. but castor oil was the result.\nI must not forget to say that the day after Xmas we were given a small tin of chocolate from the Australian War Contiggent in London also a small issue of rum.\nWe are all looking forward\n\nto our Xmas parcels, but I fear they will go astray.\n\nDec.30\/\nWent out pattroling the country around the coast & never saw a nig. So I guess they just about finishie . I expect they have gone towards Sollum. their headquarters\nWe got back to camp early & found the other troops back from their chase: They said they saw about 2,000 niggers going for their lives on camels & horses. They tried to head there but had no possible. The enemy left in the hurry. 30 new tents & 90 camels\n\n& some 500 sheep. behind all the latter were brought into camp. We killed ten sheep for the squadron & kidded we would have a feed of fresh meat & make up for Xmas Day.\nThe cooks boiled them with the bully beef & the meat was so rank that it upset the stew. no more fresh meat on the desert in future.\nSome of the boys from NSWs received parcels so had cake & plum pudding for a change. There was one thing wrong & that was that there was not enough of it.\n\n"}}