{"Document Name":{"0":"Diary_0411","1":"Diary_0411","2":"Diary_0411","3":"Diary_0411","4":"Diary_0411","5":"Diary_0411","6":"Diary_0411","7":"Diary_0411","8":"Diary_0411","9":"Diary_0411","10":"Diary_0411","11":"Diary_0411","12":"Diary_0411","13":"Diary_0411","14":"Diary_0411","15":"Diary_0411","16":"Diary_0411","17":"Diary_0411","18":"Diary_0411","19":"Diary_0411","20":"Diary_0411","21":"Diary_0411","22":"Diary_0411","23":"Diary_0411","24":"Diary_0411","25":"Diary_0411","26":"Diary_0411","27":"Diary_0411","28":"Diary_0411","29":"Diary_0411","30":"Diary_0411","31":"Diary_0411","32":"Diary_0411","33":"Diary_0411","34":"Diary_0411","35":"Diary_0411","36":"Diary_0411","37":"Diary_0411","38":"Diary_0411","39":"Diary_0411","40":"Diary_0411","41":"Diary_0411","42":"Diary_0411","43":"Diary_0411","44":"Diary_0411","45":"Diary_0411","46":"Diary_0411","47":"Diary_0411","48":"Diary_0411","49":"Diary_0411","50":"Diary_0411","51":"Diary_0411","52":"Diary_0411","53":"Diary_0411","54":"Diary_0411","55":"Diary_0411","56":"Diary_0411","57":"Diary_0411","58":"Diary_0411","59":"Diary_0411","60":"Diary_0411","61":"Diary_0411","62":"Diary_0411","63":"Diary_0411","64":"Diary_0411","65":"Diary_0411","66":"Diary_0411","67":"Diary_0411","68":"Diary_0411","69":"Diary_0411","70":"Diary_0411","71":"Diary_0411","72":"Diary_0411","73":"Diary_0411","74":"Diary_0411","75":"Diary_0411","76":"Diary_0411","77":"Diary_0411","78":"Diary_0411","79":"Diary_0411","80":"Diary_0411","81":"Diary_0411","82":"Diary_0411","83":"Diary_0411","84":"Diary_0411","85":"Diary_0411","86":"Diary_0411","87":"Diary_0411","88":"Diary_0411","89":"Diary_0411","90":"Diary_0411","91":"Diary_0411","92":"Diary_0411","93":"Diary_0411","94":"Diary_0411","95":"Diary_0411","96":"Diary_0411","97":"Diary_0411","98":"Diary_0411","99":"Diary_0411","100":"Diary_0411","101":"Diary_0411","102":"Diary_0411","103":"Diary_0411","104":"Diary_0411","105":"Diary_0411","106":"Diary_0411","107":"Diary_0411","108":"Diary_0411","109":"Diary_0411","110":"Diary_0411","111":"Diary_0411","112":"Diary_0411","113":"Diary_0411","114":"Diary_0411","115":"Diary_0411","116":"Diary_0411","117":"Diary_0411","118":"Diary_0411","119":"Diary_0411","120":"Diary_0411","121":"Diary_0411","122":"Diary_0411","123":"Diary_0411","124":"Diary_0411","125":"Diary_0411","126":"Diary_0411","127":"Diary_0411","128":"Diary_0411","129":"Diary_0411","130":"Diary_0411","131":"Diary_0411","132":"Diary_0411","133":"Diary_0411","134":"Diary_0411","135":"Diary_0411","136":"Diary_0411","137":"Diary_0411","138":"Diary_0411","139":"Diary_0411","140":"Diary_0411","141":"Diary_0411","142":"Diary_0411","143":"Diary_0411","144":"Diary_0411","145":"Diary_0411","146":"Diary_0411","147":"Diary_0411","148":"Diary_0411","149":"Diary_0411","150":"Diary_0411","151":"Diary_0411","152":"Diary_0411"},"Date":{"0":"unknown","1":748.0,"2":749.0,"3":750.0,"4":751.0,"5":752.0,"6":753.0,"7":754.0,"8":755.0,"9":756.0,"10":757.0,"11":758.0,"12":759.0,"13":760.0,"14":761.0,"15":762.0,"16":763.0,"17":764.0,"18":774.0,"19":775.0,"20":776.0,"21":780.0,"22":781.0,"23":782.0,"24":784.0,"25":785.0,"26":793.0,"27":794.0,"28":795.0,"29":796.0,"30":797.0,"31":798.0,"32":799.0,"33":800.0,"34":801.0,"35":802.0,"36":803.0,"37":806.0,"38":807.0,"39":808.0,"40":809.0,"41":810.0,"42":811.0,"43":812.0,"44":813.0,"45":814.0,"46":815.0,"47":816.0,"48":826.0,"49":827.0,"50":828.0,"51":829.0,"52":830.0,"53":831.0,"54":835.0,"55":837.0,"56":838.0,"57":839.0,"58":840.0,"59":841.0,"60":842.0,"61":843.0,"62":844.0,"63":860.0,"64":861.0,"65":865.0,"66":868.0,"67":897.0,"68":898.0,"69":899.0,"70":900.0,"71":901.0,"72":902.0,"73":903.0,"74":904.0,"75":905.0,"76":906.0,"77":909.0,"78":910.0,"79":912.0,"80":913.0,"81":914.0,"82":915.0,"83":917.0,"84":921.0,"85":928.0,"86":931.0,"87":932.0,"88":933.0,"89":934.0,"90":938.0,"91":939.0,"92":940.0,"93":941.0,"94":942.0,"95":943.0,"96":944.0,"97":945.0,"98":946.0,"99":947.0,"100":948.0,"101":949.0,"102":950.0,"103":951.0,"104":952.0,"105":953.0,"106":954.0,"107":955.0,"108":958.0,"109":959.0,"110":960.0,"111":963.0,"112":964.0,"113":965.0,"114":966.0,"115":968.0,"116":969.0,"117":970.0,"118":972.0,"119":982.0,"120":983.0,"121":984.0,"122":985.0,"123":986.0,"124":987.0,"125":988.0,"126":995.0,"127":996.0,"128":997.0,"129":998.0,"130":999.0,"131":1021.0,"132":1023.0,"133":1028.0,"134":1030.0,"135":1031.0,"136":1032.0,"137":1066.0,"138":1067.0,"139":1068.0,"140":1069.0,"141":1070.0,"142":1071.0,"143":1072.0,"144":1073.0,"145":1082.0,"146":1083.0,"147":1085.0,"148":1086.0,"149":1087.0,"150":1088.0,"151":1089.0,"152":1090.0},"Entry":{"0":"\n\n","1":"\nReported to 7th Battery to-day and placed in \"B\" Sub. I applied for leave & got 48 hrs & went up to Cairo. Met Dutch lady & Gent & family. Incident re biscuits. Stayed at Eden Palace Hotel\n","2":"\nBought severalthings to send home. Saw Reg Rutter at Palace Hospital. Also Driver McKenzie & Tom Richards. Saw my Dutch friends at Groppi's. Missed train & had to stay another night.\n","3":"\nCaught train at 7 am.\n\nGot splendid hamper on train. Saw marriage ceremony in Cairo. Band & procession etc\n","4":"\nManouvering in Desert. Battery orderly Sergeant to-day.\n","5":"\n","6":"\n","7":"\nSame old routine - in charge of Brigade Guard Defaulters etc.\n","8":"\n","9":"\nDitto\n","10":"\n","11":"\nInspected by Sir\n\n\n\nArchibald Murray KCB. KCMG CVO-DSO.\n","12":"\n","13":"\n","14":"\n","15":"\n","16":"\nIn charge of Guard Prisoners - breaking leave cases. Saw marriage ceremony. Arabs on Camels etc.\n","17":" to","18":"\nRoutine\n","19":"\nBought Gunner Gibsons leave for 50 Piastres & journeyed to Cairo. Sent letters home.\n","20":" to","21":"\nRoutine\n","22":"\nHad big storm\n","23":"\n","24":"\nWent to Cairo. Sent parcel home.\n","25":"to","26":" \nRoutine\n","27":"\nRumour of new Divis of artillery forming & several appointments made.\n","28":"\n","29":"\n","30":"\nToday I was\n\ntransferred with others to form the","31":" Brigade. Recommended as Q.M.S. \n","32":"\nHad to visit Supply Ordnances & Engineers for different items. Had very fatiguing day.\n","33":"\n","34":"\n","35":"\n","36":"\n","37":"\n","38":"\n","39":"\nVery busy - with Supply Ordnance etc.\n\nCourt Martial Parry Oakden .\n\nStrangecases of taking their life over on the Peninsula. \"Four Feathers\" one NavalMarineabout 20.\nAwards & decorations to officers.\nCold feet term.\n\nFriday 3rd March\n","40":"\n","41":"\n","42":"\n","43":"\n","44":"\nA number of our own men left the Brigade and went\n\nover to the 103rd Howitzer Battery\n","45":"\n","46":"\nLeft camping ground & formed up as Details for the 4thDivision.\n","47":"to","48":"\nRoutine\n","49":"\nIt was now a case of saying Goodbye to our old","50":" Brigade comrades whowere off to France.\nI gathered in a lot of spoil as QM.\n","51":"\nShifted to old","52":" Brigade lines. Big day.\n","53":"to","54":"\nQM work.\nHad to work hard. We received new men from Light Horse Units.\nHeard we would have to leave Tel-El Kebir & go down the canal.\n","55":" to","56":"\nIt was a matter of packing up again. Had to take everything possible. The carting to the Stn was a big matter. Slept on Platform to-night.\n","57":"","58":"\n\nLeft Tel-el-Kebir in train at 7 am arrived at Serapium the sight of our new camp. Slept on Platform in evening.\n","59":"\nMoved our a lot of our gear to camping grounds Sandy Soft Valley.\n","60":"\nRode over on tocanal to Ordnance. Saw Tom Watson &c.\n","61":"\nWent over other side of canal to Engineers. Pontoon Bridges &c.\n\n\n\nHad a refreshing swim. My charger bucked me off.\n","62":" to","63":"\nHad some awful sandy weather. Khamseen .\n","64":" - Anzac Day\nSports in Canal. Brigade sports &c.\n","65":"\nReceived a batch of letters. MrAllan on Mooltan.\n","66":" to","67":"\nVery busy on ordnance work at Serapium. Equiping a Brigade isno easy matter.\n\nWill never forget harness and other items. Captn Tuckett paid me the compliment before General Rosenthalof being the only Brigade QM in the Artillery.\n","68":"\nAt last the day of our departure from Serapium had arrived. For the past few days it was all running about for this great Finale. I was feeling a bit fagged over the work. Our train left at 8.30 PM and it did not take long to get the horses & gear aboard. I was very glad ofwhen the shriek of the whistle gave us warning that we were off &\n\nonce more we were on the move. I do not think one of us was sorry to leave the Desert behind and face towards Alexandria. It was an all night trip and one after another our chaps dropped off to sleep on the seats. Fortunately I was in a","69":" class carriage and it was not so bad but the lads in the","70":" class carriage must have had a very hard bed. There is one thing I can never forgive our Military Authorities over and that is making all ranks lower than a Sergeant travel","71":" class. Going to Town you would have to put up with some dirty\n\nEgyptian Waller rubbing up against you on the seat. You had no option of your company. The least that could be done would be to let those who desiredtravel 2nd class if they wished to pay the difference.The","72":" class was reserved for officers & civilians who could pay the fare.\n\nAt the different stations enroute to Alex\nthe noise of the Wallers\nyou were rudely awakened by the awful noise of the Wallers selling cakes or such articles. It will be a long time before one\nloses the\nforgets the persistancy and cheek of the Egyptian Street Seller.\n\nWe arrived at\nWhat shameful bargainers they are and remind one of the Chinamen who generally ask \ndouble\ntreble the value.\nexpecting to receive\n\nWe reached Alex at about 6 am and did not take long to remove all our gear on to the transport Haverford. The train ran right on to the wharf where she was berthed. A scanty breakfast and then it was a wait. The only other Units on board the transport besides our","73":" Brigade - were a small section of the A.M.C., A.S.C. and the 15th Battalion.\n\nI was fortunate in getting a cabin \nbetween\n with our own Sergeant Major in the","74":" saloon and as you can imagine it tended to make the trip which was to follow very comfortable. We did not leave the wharf that night but next morning at 7.30 am the engines throbbed and it was not long before we steamed off. How delightful it was to once more be \non the\n moving over the dancing waves. The most pleasant thought was to be leaving the heat - the flies - the Deserts of that mysterious land of Egypt with its\n\ntiresome children. After leaving behind the shores of Egypt, Submarines became the burning question and every precaution had to be taken as to lights at night &c. Lifebelts were issued to all hands and various other formulas as to signals &c sent to the Units on board. It was arranged that owing to my hard work at Serapium I was to be relieved of any duty on board and I made the most of the opportunity afforded to me for a rest. We did not expect to have such a long trip but\n\nowing to Subs having been sighted we had to change our route and go up near Greece then zigzag down to off the coast of N. Africa and up again past Corsica and other Islands. It took us days before we camein sight of Marseillaise . A most enjoyable trip in every way - calm cool and without much excitement. I should think the Meditteranean was never in a better mood or its waters \nwere never\n a deeper blue. As I sat on deck late on an afternoon and\n\nlooked out through that pale opalescence of softlight there seemed Peace and Beauty on every side. One would never dream that the fearful war tragedy was rendering the world. I managed to read several books on the trip - almost the first I have had time to finish for the last 18 months.\n\nNo accident or unusual occurrence marred the trip and there didnot appear to be that same restriction placed on the men as on other Transports I have travelled on. It speaks\n\nhighly for Col F. A. Hughes who was the O.C. in charge.\n\nI met young Craig of our Dress Dept on board. He was with a small detachment of the 15th Battln. Lieut Butcher who knows Willy McKeon was also on board\n","75":"\nMarseille is nearing and I am just longing to see a little of France.\n","76":"\nIt was a delightful crisp cool day. There was that biting tinge in the wind as if it had passed over some snow clad\n\npart of Europe. Part of the mainland of Fair France loomed into view at 2 PM to-day. There was a high prominence jutting out into the Seaand beyond it seemed very rugged and broken country.\n\nWe were all anticipation when the first glimpse of Marseille came into view. What a charming place it appeared looking from the outside Harbour where we anchored. The City and its outskirts was builtright on the waters edge. The country was not flat and apart from the evenness of the immediate vicinity of the CIty proper\n\nyou viewed \nthere was high ridges - one might even call them mountains all around. In places it was delighful to see trees and the other verdure and nestling amongst these green bowers peeped out the red tiledroofs of cottages. Nearly every building had red tiled roofs and the factories and other works all had such a trim appearance. The only thingthat marred the view was an advt for a certain whisky which glared at one from a \nvery prominent\n wall of a very prominent building. You can well understand how we longed to get ashore on\n\nLa Belle France. We steamed inside next morning but could not get a berth for our vessel and we had to go outside and anchor again. On the stone pier which protected the inside Harbour Germans \nwere working\n Prisoners were working. I am only hoping that when If I am able to probethe City \nI will find it as artistic as it appe\nif such an opportunity is given us we will find it as artistic as it appears on the surface. There is a lovely edificeon a high pinnacle in the distance called the Notre Dame de la Garde and La Cathedrale close in at\n\nthe docks also is very imposing. Coming into the Harbour we passed an Island on which the famous Count Monte Christo figured, i\nn History\nNo doubt you have read the tale. Unfortunately we did not get a chance to see much of the city. We had to make off for our train almost as soon as we landed. I had to get ashore & arrange for Rations for the journey where to we did not know. All we knew was to take four days Rations. Our quarters on the train consisted of covered in trucks - usually those required for carrying horses. There was one good feature\n\nabout them & it was the fact that they allowed oneto get a stretched out sleep. Altogether it was indeed a fine trip & one could not resist looking out on the lovely fields and landscapes of Fair France. I hardly ever left the door opening of our truck - the fascination of the lovely green fields - the hedges - the wild flowers & the orchards I could not resist. All along the lines there was a sad absence of young men. It was very prominent & in every place we would see old ladies women folk children & old men. There was a very sad pathos written on many\n\nof the faces that viewed us as we passed through the villages. On many faces tears were streaming down as they waved to us. The dear lovely children were very enthusiastic in their welcome to us as went along & onecould not resist throwing a few pennies to the sweet little kiddies. On all sides you could see women folk in Black showing their loss in this great War. In every field women folkwere working & old men & children were also doing their part in the same way.\n\nWhat a garden of Eden isthe South of France. My pen could not describe to you the glory of the open fields the lanes & their hedges, the avenues of trees & The orchards in this part of the world. It seemed like onehuge garden with just one barren spot to cast a blemish on it. I could not have imagined so lovely a place had I not viewed it myself. Everywhere therewas an abundance of cherries. They seemed to grow wild.\n\nAll our journey lay through the valley of the Rhone & we afterwards found our place destination was Le Havre. You could see the good old Rhone flowing along & spreading prosperity along this wonderful garden of France.\n\nThere was a large quantity of Grape trees to be seen & some of the hills near the Railway line were one huge vintage. What amass of lovely wild flowers - Popies Daisies Buttercups, everywhere some of the fields were\n\nstudded with the bright crimson Poppies making a lovely contrast with the green oats. Aswe went along we were showered with flowers kisses & on some of the stations the Red Cross Nurses gave us refreshments.\n\nAll along the line there was a great cry of Souveniers & the badges on the men's uniforms I'm afraid suffered badly especially when a charming French girl made a sweet appeal. Some of the Chateaus were charming homes & had an abundance of roses in the pretty\n\ngardens.\n","77":"\nWe passed through Versailles & had breakfast at Montes. It rained a little on the journey which by the way took 4 days & everything was soaked & damp. The reason of the length of time on the journey was down to having to shunt off the mainlines for hours to allow ordinary traffic to pass & we had to water & feed our horses.\n\nIn parts of the journey we had to pass through woods & when going through one near Juisy I rose early & was overjoyed with\n\nthe sweetness of the Song birds there. No canary could be sweeter.\n\nIt was an experience to gothrough the Tunnels some of which must have been over a mile in length. You would think the end was never coming. How Pretty the red tile roof looks against the green vegetation. It is all tile or slate roofing.\n","78":"\nThis morning we entered Rouen of course we only got a glimpse of it & the famous cathedral.\n","79":"","80":"\nWe arrived in Harve at about 1.30. There was the usual delay in disentraining. We were not sure if Le Havre was our destination & there was a good deal of conjecturing as to whether we were going on to England. Our minds were soon set at ease when orders arrived stating the camps we had to report to. I left for the place which was up on the top Plateau of Harve by a large Motor full of gear - the necessary impediments of an Artillery Battery. Our Motor proceeded through the\n\ncity and then along the Promenade facing the sea. It was a delightful ride after our journey by train and I got a very favourable impression of the well known sea side port of Sunny France. You do not get much information from the authorities but it seemed that we were only in Le Havre for a few days tofinished off our equipment before departing for the firing line. My surmise proved correct & for a few days I was hard at it getting further gear. The store was down on the wharf & altogether it was a marvellous concern. Huge\n\nsheds on the docks comprised the store Houses and one had to go from one to another for miscellaneous items. One day Iwalked from one shed to another gathering in different goods taking nearly all the day doing so. There is a good deal of shipping in Le Havre and the docks are a network of walled in basins with bridges leading from one to another. I did not have very much time to view Harve. While in the city Portion I visited several of the cafes and tried my French on them.There is a good\n\nnumber of English spoken & one can make oneself understood even if you are not expert at French.\n","81":"\nWe recvd orders to depart today & it was a great rush. As early as 3.30 am I was up and making arrangements. The weather had been a little damp and cold at Havre and our Boys felt its effects while under canvas there. At 1.30 PM myself and party were off to the Stn with baggage etc and later on the Horses & guns followed.\n\nIt did not take long to have everything snug on the train & we found that the accomodation was infinitely better than on the trip from Marselliase. The Sergt Major & myself had a","82":" class compartment to ourselves and we were able to stretch out for a snooze. The lovely twilight in this part of the world allows of a very long day. It is light till abt 10 PM. The Daylight Saving Bill came into operation while we were at Havre and all watches were put on one hour etc.\n\nI consider the idea good as the darkening shades of evening etc. That evening I was too tired to look out at the country we were passing through but next morning I was up early drinking in the lovely landscapes. Although the country did not seem up to that in Southern France it was wonderfully bewitching in its beauty. It seemed more given to grazing purposes thanthe South but one could see an abundance of Fruit Trees. There was not so much Grape vine to be seen.\n\nWe heard our destination was to be Abbeyville on the North French Coast but we arrived there and still went on up through Picquigny Bulonges and Calais. At Calais we branched off and our next principal stop was St Omer. From here we went to Caestre, a small village a little to the south of Ypres & Armentairs . It was our destination we discovered on arrival & this will give you an idea of how you have to work in the dark.\n\nAll the way from\n\nAbbeyville we passed train after train of wounded men coming down from the front. In the villages abutting the railway line we noticed batches of Tommies in the various houses Barns etc. Everyone seemed to be in Khaki. Up as far as Calais the railway line ran on the coast & you could catch glimpses of the Ocean & fishing smacks on the coast. After bundling everything out of the train at Caestre we were taken along to our\n\nBilleting quarters. Our Battery was housed in two Farms, the men nearby in huge Barns. Myself and several N.C.O's were in a room in the house portion of the premises - We made ourselves comfortable on the floor. It was very cold & nippy - quite as cool as an Australian winter while the season in this land is well on in the Summer.\nIt was not long before we had all our Battery safely housed at 2 Farm Houses one joining the other.\n\nThe other Batteries\n\nof our Brigade were at Farm houses near us.\n\nIt did not take long to make ourselves comfortable & also to exercise our French sufficiently to make ourselves quite understood. These Farm Houses are very quaint and the Pigs seem to form a big item in the household. Most of our chaps were in the huge barns & more than one of themen was rolled over by one of these bipedsduring the night. The villages comprise a small collection of shops & houses in the outlying district. The farm lands were all splendidly cultivated &\n\nevery Farm House seemed to possess a fine horse for general work. The breed is a --type & a splendid animal. In all these farm houses you will only find women folk, old men & children.\nthe others being away fighting\nIt is wonderful how everything seems to be in such perfect order. notwithstanding the absence of the young men folk. The children are very fine & in most cases have a small smatter of English. They pick it up very quickly. I love to see them in their smock frocks. The hedges & lanes in this\n\nplace are just what I have always imagined those in G Britain. Since we arrived I have had to ride round & see about provisions. We have had to go about 4 miles for them in the next village but we will in future draw them in Caestre. Every farm house in the District has some of our men living in them. I can quite understand the old folk of these farm houses sticking to them even if the invader should come as they have done in many cases. The Germans were in possession of all these places we are in\n\n& some were at the farm we are now staying at. Most of them were captured round Caestre when the Germans forces retreated from this part. We get a good view of aeroplanes every day and the distant boom of guns tell how near the firing line is from our present quarters. Some of our Batterywill be moving up to the firing line in a few days but just at present the boom of the Guns is a reminder of what is before us. Often an attack in our aeroplanes can be witnessed. What\n\nwould like to see is a good air fight.\n\nThe country lanes are teeming with Motor cars. Wynyard-Joss & Ken McSwaine calledtoday,18th June.\n","83":"\nSeen the Germans fury at our aeroplanes today when out at Outterstein & Merris.\n\n*\nLetter re London\n","84":"\nLeaving Strazeele for Boulonge & then London today. Train at 5.50 am.\n\n\n\nUp at 3.45 am ride to Stn without Breakfast. Slow ride up. Sleepy.\n\nArrived Boulonge & found train not leaving till 5.15. Had snack at soldier's club & then wandered round & did a little purchasing. Went for train ride & also through Fish markets which were full of women Folk. Some very queer & saucy characters. There seems to be plenty of fish round the place & you can see the women folk carrying baskets full on their shoulders. The supporting straps hung in front of their chests & as they walked they bent forward to support the weight. In the out\n\nside harbour you could see fishing smacks & the place had the usual appearance of a sea side fishing port. There was the usual promenadespeculiar to such resorts. We went aboard at the appointed time and the first order was to don lifebelts. Our ship proved a very fast one & in about 2 hours the cliffs of Dover bore in sight and we soon berthed at Folkestone a little later. The steamer whose name was Princess was crowded with Tommies Canadians New Zealanders & a few Australians mostly all going over to England on leave.\n\nOnce ashore it was a\n\nrush for the train which was in waiting for us. I felt a strange thrill as we went ashore - London a place I had often longed to see was almost at my feet I could hardly realise it. Folkestone is just a fishing Sea Side Port & there did not appear to be anything special about it that I could observe. A number of Fishing Smacks were in against the quay and had just emptied their burden of fish. We settled down to a 3 hrs journey to London & as the train did not travel too fast except in small bursts - when the rate was accelerated we arrived a little later than we anticipated. On the way up saw small flocks of sheep etc. It was 10.30 when we entered Victoria StrStn.\n\nLondon at last - The Grand old city I have often read about dreamed about and pictured in many ways. Iwondered if all I expected of it would be realised. Mr Foden our A & S representative was on the Stn to meet me as I wired him from Boulonge. He & his Son gave me a hearty welcome & accompanied me to the Australian Force office where all hands had to report. Mr Foden invited me & a friend to spend the evening at his house in the suburbs & we took a train out there after sharing a little supper. How stately the buildings looked as we walked along thestreets.\n\nWas our bed waytoo comfortable or were we so tired? I am ashamed to say it was nearly 9 am before we breakfasted next morning. We hurried off to the city & I called at the Austn Force Office as to Pay etc & then on toJepson of Jepson & Co & then at Foden & Co where we met Ernest Foden. We lunched at the Trocaderia the most fashioned restaurant ofLondon. What a place of loveliness. It had beautifully papered walls tastefully decorated with fancy colored lights & the furnishings were magnificent. A band of first class musicians\n\nadded a gaiety to the surroundings. There was a sample of London's fastness in the place. The ladies after Dejirener smoked cigarettes & there was a great deal of style & fashionable costumes in the crowd who thronged the place. After the Trocadera we taxied round the city visiting Westminster Abbey St Paul's Cathedral The Tower of London The Tower Bridge The Thames Embankment etc.\n\nWestminster Abbey was a place that we could not but feel attracted. It held us spell bound to look on the famous monuments & statues the tablets & memorials to the\n\nthe Great Men of our Empire of past ages. Their very souls seemed to have hallowed the fine old building & one feels as if they speak of the glories of the past & ask you to try and emulate their works. In St Pauls Cathedral a magnificent edifice there is a fine monument to the memory of Wellington. We attended a short service there in the afternoon & also inspected the Banners of the different Regiments - some of which had been carried through campaigns long ago. Their age & condition spoke clearly of the deeds of victory to the credit & glory of the men of who carried the flags.\n\nIn the Tower of London we saw where the openings had been built to allow of the arrows being shot from the bows. We had not much time to go right through & intended to Pay another visit there later. The Tower Bridge is a big structure & we crossed over it and then back again along the Thames Embankment. I have often heard a great deal about the immense poverty in London but I must say I saw very little of it but it must be remembered I had only been around the City proper a little of the East & the West End Portions.\n\nIn the later is the famous Pickadilly & the resortsof London's Aristocracy. I viewed several of the large hotels Savoy CecilRegent Palace & after the Mansion House & Somerset House. Went round Buckingham Palace, House of Parliament. Travelled in the Omnibus of London which are manipulated in a wonderful way through London's maze of traffic and dreadfully narrow streets. The monument to Nelson in Trafalgar Square is a great piece of work & on the Thames Embankment we saw the celebrated Cleopatra's Needle - a huge block of granite brought over from Egypt.\n\nOne cannot but admire the London Police. They're a fine body of men & do a great deal towards keeping the traffic which throngs the streets in order. We went to several spots where the Zeppelin Bombs had been dropped & viewed the traces of the damaged they had effected. Most of the damaged portions had been repaired. We had tea at the Trocadera & then booked seats for the Coliseum. There was a first class programme of variety items on& it proved most enjoyable. A small skit called \"My Lonely Soldier\" was very good & the outline of the affair was.\n\nAt 11.30 we went to Kings Cross we catch the Express to Edinburgh. It was an all night trip & we arrived at Edinburgh at 7.30 next morning.\nThe country on the border\n. We did not see much of the country except on the journey from the Scottish Border up to Edinburgh & it seemed good but used more for sheep farming & grazing purposes. On arrival at Edinburgh we went to Waverly Hotel & had a bath & breakfast and then started to view the City. What a charming place it is! Such lovely buildings & wide clean streets - in fact I am quite in\n\nlove with the City. We hired a taxi & started first with a run to Holyrood Palace. This fine structure lies down the valley below \"King Arthur's Seat\". This later place is a huge hill or mount in the shape of a lion & you can mount it by roadway & we motor up & round it & then up the Royal Mail . The Royal Mail is the roadway leading from the Palace to Edinburgh Castle & you can see the very old buildings here which at one time were owned & inhabited by the Scottish Aristocracy. The small waysbetween the buildings really\n\nPassages are called \"closes\".We viewed John Knox's church & house - now a curiosity shop also the Market Crossoutside the Police Stn where goods & furniture are brought to be offered for sale when distaintedfor rent owing. There are a number of old wells in the streets protected by stone& from which water was drawn as far back as Queen Mary's time.\n\nThere is an immense monument to Sir Walter Scott just opposite our hotel. It is the finest piece of work I have ever seen. Princess St the business one of Edinburgh is certainly a highway. It is\n\nwide & large shop buildings on one side & on the other, it is bounded by the Gardens.\n\nWe went to St Giles Scottish Cathedral for the 11 o'clock service. In the choir the girls & mens are dressed in gowns & university Hats & march behind a cross up to their seats at the commencement of the service. The anthem was a masterpiece of rendition. I was rather surprised tohear The Creed said at the service. On the roadway near St Giles is the Heart of Midlothian being the centre of the district - The heart is marked out with coloured stone.\n\nWhat a grand sight to see the castle on the heights\n\nsurely there is not a more imposing picture in the world. It seems impregnable & at the front there is a drawbridge with a moat & huge guns facing the front entrance.\n\nThe Ancient Greyfriars Church & cemetary are visited also view Carnegie's Library & the Scottish House of Parliament outside of which is a monument to King Charles. Near St Giles Cathedral is a remarkable stone monument to Duke Barcleugh who was a celebrated Sport. Racehorses & other symbols are carved out & mountedon the monument. The Public Execution Place was also amongst the\n\nnotable places we saw. Brigham Young is supposed to be the last man Publicly executed on the spot. Another old & well known building is the Grass Markets & near which one of the Bombs fell on a recent Zeppelin Raid. Further along is saw the House where Burke & Hare murdered their many victims so that they could sell the bodies to students.\n\nAt St Giles Cathedral on Sunday morn we saw a Church Parade of one of the Scottish Regiments in Kilts. They looked a fine body of men & it was a great turnout as they marched away to the strains of the Bagpipes. How Bonnie\n\nthe many little scotch lads looked in their kilt costumes - you could see them everywhere. It was particularly noticable the contrast of color in the cheeks of the London Lassies & the those of Edinburgh Town. The Londoners are very pasty while the Scotch girls are pink & fresh. At our hotel we had good old Scotch Porridge oat cakes & scones as only Scotch folk could make & I feel loath to leave the place but we wish to get away to Glasgow to-morrow early & spend the day there.\n\nIn the afternoon\n\nwe ran down to the Forth Bridge by Motor Bus. A splendid ride & the county through which we travelled was charming indeed. The roadway was an avenue of fine trees also Hedges & the suburban villas & gardens were a picture. We could see the Shale Works on the way down. There is no need to make any remarks about the Forth Bridge - one of the great wonderful constructions of the world. In the Bay was a considerable number of Man o' War ships & the sailors in uniform etc. After tea we took the train to Portabello & Joppa\n\nSeaside Promenade Suburbs of Edinburgh. I cannot but remark on the great cleanliness of the city & suburbs. The streets are a credit & Princess St is.\n\nIt rained both in London & Edinburgh while we were there - in the latter there was the usual well known scotch mist.\n\nOn the Edinburgh trams there are very buxom Scotch Lassies as conductoresses & you can also see many girls on the London Motor Omnibuses.\n\nEarly next morning we had breakfast & then off to the Princess St Stn & started on\n\nour trip to Glasgae . It was a wet morning & there was not very much to see. The country looked fine & we saw herds of those large black faced sheep so peculiar to Scotland. Often we passed over brooks whose waters merrily ran over stone babbling a song of joy on the way. On arrival at Glasgow we immediately took a taxi to go to Wissahaw about 5 miles out of the city. It was our intention to call on the parents of a member of our Battery. The ride was indeed a most delightful one & the journey lay through Bothwell\n\n& near the Duke of Hamilton's Estate on which the historic herd of white cattle pastured. We saw the good old Scotch folk at Wissahaw who gave us a hearty greeting & then returned to the city viewing the Cathedral & Necropolis. In the afternoonon calling on Mr Marshall a friend of Mr James Allans (A-S) we were taken over the Municipal Chambers & the University. The\nCouncil\nChambers is a massive structure & likewise the University. In the former there is one special feature & it is the marble work especially the staircase portion. All the marble was imported for the\n\nChambers from Italy. One could not be but impressed when going through the University. When at Edinburgh we only viewed the Hall of Education & learning from the distance but here in Glasgow we were able to see where some of the worlds greatest scholars had added to theirstorehouse of knowledge. In part of the building one could see panels of antique carving taken from the original structure. The Bute Hall an addition to the University cost its donor £65,000.\n\nThere is a square George's \nin the centre of\n\nthe city\nnear the post office in the city & it is adorned with monuments to Sir Walter Scott & other of Scotland's great men.\n\nWe had tea at Marshall's & left about 10.30 PM for London again. Saw Daley & other shops in Sauchihall Street.\n\nThe train journey back to London proved a slow one & it was about 10.30 am before we arrived at Charing Cross. Early in the morning we passed through Rugby Harrow & other well known places. Jack Tars returning on leave were theonly other occupants of our train car.\n\nI could not but admire the flowering Hawthorn to be seen skirting the railway tracks in England & Scotland.\n\nOn arrival in London we taxied to the Regent Palace Hotel Piccadilly took rooms there & as Allan was expected in town I called at his Hotel - the Strand Palace - and found he had returned. We took atrip under his wing to the Instite Museum.\nwhere old historical relics are stored\nIt was a great storehouse of old historical relics of Battles past & wonof items that great Generals of past ages had worn or treasured.\n\nOn the roof of this museum is a canvas painting by Reuben which is now valued at £2,000,000.\n\nThere was a lovely solid maghoney Table presented to Nelson. Old Guns Swords Pistols Banners etc. From there Downing Street was visited - Everyone knows about Downing Street. The evening was taken up by enjoying the Programme at the Palladium Theatre. \"Little Tich\" was the special favourite draw. On calling at the Qld Agent Generals office next day I found an old friend of mine Mrs Sym & daughter were in London. I called on them but found they were out & left a message. Later on I recvd a telephone message & they\n\ncalled on me & we had afternoon tea together. Met in the vestibule we then took a taxi and ran out to Kensington Garden & Hyde Park. In Rotten Row when passing Hyde Park I saw a number of Ladies exercising their horses as they have done in that place for so many years. Our taxi ran us up Oxford Street & the maze of traffic which adorns Londons thoroughfares. Had a call at Selfridges Great Store & here in the lifts are girls dressed up in pantaloons & frock coats working the lifts.\n\nWhiteley's Store another delight of the shoppers we visited.\n\nIt is surprising what wonderful emporiums those shops are. Under the one roof you can anything you require your drapery - your fruit - your vegetables, groceries lollies cut flowers &even if you require cats dogs mice birds or any other animals there they are tied or caged up. When we passed through this animal section a fox terrier was being cased up in a box to send out by delivery to a customer.\n\nIn the evening\n\nwe were taken to \"Ye Gods\" after dinner \"Table d'Hote\" at the Trocadero by a friend (Ernest Foden). It was a fine play & the story is centred around some figures of Gods brought by a Professor from Africa. Jimmy - the Heart of the piece we might call him - incurs the displeasure of the images by some taunting remarks he makes & is cast under a spell - It is a love spell & while under it every woman, married single ugly or pretty falls in love with him. He is led a persecuted life by all females suddenly wishing to hug & squeeze or kiss him\n\n& follow him about. With about2 days threatened divorce proceedings many contemplated fights from irate husbands & disappointed lovers he emerges from the spell after he sought protection from the image he insulted. It was immensely funny. Under the circumstances I am convinced that one could be too much loved.\n\nIn the evenings in London the streets are fairly dark owing to the restricted lighting to prevent raids from Zeppelins. The few lights are covered so that the light is thrown down. The manipulation of the traffic\n\nby London's Big Policemen is finely carried out. Of course I had a few trips in the Tube. It is rather weird to get into a lift & go down into the Bowels of the Earth for several hundreds of feet & then into a railway carriage. They travel fast & have a system by which air is pumped down - seabreezesI think they are called - but Iconsider they have a rather musty smell.\n\nIn London one hears a good deal about the consciensous objectors to Military Duty. Consciensious Cowards they are dubbed in many papers.\n\nNext morning I left the City from Cannon St Station for Snodland Kent. A most delightful run along the Thames & then we branched off southwards towards Maidstone the Medway. Called on relatives at Snodland & back again meeting Foden at Cannon St & dining at the Trocadero. Went to Commonwealth Bank & then to Regent Palace. That evening my friend (Mrs Sym) kindly entertained us at Dinner at the PopularCafe. A lovely place & the one thing I admired was the beautiful glass chandeliers. From there we went to Wyndhams Theatre & saw \"The Kiss\n\nfor Cinderella\". It was an entrancing piece surrounding a new version of Cinderella made by a dream of a London Girl. The children whotook part were charming kiddies with lovely curly hair.\n\nInfilliable\n\nIt was a damp wet night in a dark London & we had some difficulty in obtaining a taxi. Several would not take the trip to my friend's house as it was not on their way home. Did one ever hear of such independance & in London too.\n\nAs a matter of fact one does not see a great deal of the poverty you hear about in\n\nLondon. Just now the existing conditions are good owing to the wages earned at Munition Manufacturing. There may be a good deal of Poverty on the outskirts & in sections of London but I did not see it.\n\nOne would have to be very unimpressionable not to be staggered by the enormousness of London - its buildings its traffic - its teeming millions of people. It has its many vices like all great cities & youcan see that the scourge of war has madelittle or no impression on a large bulk of the Population. London\n\nsuffers under the \ndrawback\n disability of having such a large alien population now probably neutral aliens. Did I mention here about the Ladies in the cafes smoking their cigarettes.\n","85":"\nThis morning was to be our last in London & we were up early &off to Victoria Stn to catch the 8 o'clock train & then put our faces once more back. We reached Folkestone at 11 o'clock & went on board the \"Victoria\". The 2 hrs trip over the Channel proved too much for a lot of those aboard. Most of the\n\ncrowd were Tommies returning after Leave. It was a big sigh of relief that many gave as we berthed at Boulonge. The waves had been dashing all over the top deck & as the steamer plunged or rocked one was slipping and sliding all over the place. We had to wait till 7 o'clock for a train & on arrival at Hazebrouck about midnight we found that we could not get any further. A Hostel near put a friend & myself up & we got a comfortable sleep. It was about 10.30 when we arrived back\n\nat Caestre. I found that all the Gunners had gone up to the firing line & I would move up in a few days. It was a nice day & a blue sky which is more than I seen in England or Scotland. The Sun often tried to struggle through to make the flowering petals lift their heads just as the spraylifts in to the breeze on the ocean billow.\n","86":"\nFor the next few days things were quiet but we expected to move at any moment.\n","87":"\nOrders were rcvd to be ready to move and we started out on the road at 10 am. We understood our destination was be near Armentaires . We passed through village after village until we came to Sailly and here we witnessed the havoc wrought by those Germans - Those grand old Flemish churches for which France is noted suffered very badly at the hands of the German guns - Many walls were spattered with bullet holes. After a halt being made on the road we metaguide and then went to a farm house in thevalley. It was an orchard where we placed our horses &\n\nDrivers. I secured a store there and then went off to procure rations. I had a long search & wound up about midnight without any satisfaction. Next morning started out again & went from Dump to Dump but did not get much satisfaction no one would own us. About 11 am after repeated attempts I found our ration Dump.One can guess there was some tall words used at the wretchedarrangements made for us. I never experienced such unbusiness like methods as we were subjected to in our","88":" Divis outfit.\n","89":" to 8\nDuring this\n\n\n\ntime I was busy with rations & ordnance matters. As our Guns were in action about a mile further on from the wagon lines I travelled up at night with the rations cart. No vehicle can go upin that quarter in daylight. The Hun seemed as if he expected our presence at the guns in the evening as he has opened fire several evenings just as we arrived sweeping the road with shrapnel. Luckily we did not have any casualtys. Our guns are secreted in a very fine place under trees. One would hardly expect them to be there on passing the\n\nspot. All the housenear by was raised to the ground by shell fire & the remains caught fire leaving very little to show where once a happy home stood. The protection of the guns is much better than that of our Peninsula Campaign . I was passing over a field one day and a gun went off a few yards away. It was rather startling as there was no visible sign to show it was there.\n","90":"\nFritz shelled several places in Sailly village & Bac St Mair today doing no material damage. He\n\nalso bombarded a Billet near us to see if a gun secreted there could be unearthed. Every evening all along the firing line the Germans send up star shells lighting up the country for some distance. It reminds one of a fireworks exhibition. At times the shell firing is terrific.\n\nAt Fleirbeau a village near us the Houses & shops are only mere shells - the roofs being completely demolished and gaping holes made by shells appearing in the walls etc.\n","91":"\nThere is a rumour that we are only likely\n\nto be in our present position for a few days. Of course there are all kinds of conjectures as to where we are going. We are warned that there are spies on every hand and information leaks out very quickly. People still live in some of the houses in these Flemish villages and you cannot trust any of them.\n","92":"\nPart of the Battery from the 6th Division moved in to-day. We expect to leave for somewhere on the","93":" We have been made part of the 1st Army Corp ANZAC. Went\n\nto YMCA last nightHut in village heard delightful English Tenor Perry. In most of these French Flemish cottages one sees such a lot of window pot plants. Lovely tuberous Begonias the old fashioned fuschia and other plants in flower.\n","94":"\nWe had instructions to move off today. Everything was hurriedly packed & we started at 10 am on our way. The journey was not far as we found. Steenwerck was our destination. Our Billet was a big farm house & yard & in it were stationed two other Batterys. Every available corner was taken up. Busy\n\ngetting storesetc.\n","95":"\nTo-day we heard we were to move out again and take up an open position not far from the trenches. Hurried arrangements were made and our position reconnoitred. The rumour is that we are now a mobile Brigade and liable to be thrown into any place at a moments notice. Everything points to an attack being made on our front against the enemy. One can heard the whispers and the signs are very prominent.\n","96":"\nAll the Gunners and Specialists moved last night to\n\nthe new positions & this morning our Horses & wagons took up new quarters at Fluerbaix .\n\nI journeyed up to the firing line in our Cooks Cart & all the way up there was a tremendous lot of traffic. Wagons & limbers of ammunition G.S. Wagons & Cooks Carts Guns etc also line after line of Infantry one endless Column. The French Country Roads are very narrow and one has to drive rather carefully otherwise a deep ditch on either side with find a victim. This evening Inoticed a large motor lorry & several wagons reposing on their sides. It would be impossible to move them until\n\nthe traffic eased off. In the day time little or no movement is allowed on these highways near the firing line as enemy's fire is too quickly drawn.\n","97":"\nHad a narrow escape this evening - The Germans had swept the roadway with High Explosive shells just a few seconds before I passed up to the Battery. So farno definitive word asto the proposed attack.\n","98":"\nDrove up through Croix Blanche and after on to our Gun positions. The front seemed quiet with exception of a little Artillery firing and the usual\n\nstar shells. All along the roadways the farm houses are a mass of ruins. Here and there you will see batches of our Infantry sheltering and waiting for the word to strike.\n\nAt one of the farm houses at Bac St Mair I noticed a rather strange method of working a pump. There was a large wheel with wide phlanges and on it was place a big dog. This poor animal as it walked forward it turned the wheel. Of coursethe dog really never moved from the one position. Its feet moved forward in a mechanical motion\n\nand the weight sent the large wheel round & round. The dog was certainly powerful but it kept this motion up for over an hour at a time showing how wonderfully well it was trained. The Flemish farm folk kept this dog chained up and when released to be taken to its work it strained at the leash and pulled its leader along as if delighted in the prospect of what lay before it.\n\nLetter\n","99":"\nToday was another day of Glory to our Troops\n\nin the morning things were quiet but our Air fleet was hovering around taking all the observation of the enemy's position they could. This had been done by them for the past week and it was of wonderful value both when raiding parties did their work or for directing Artillery\nFire\n.\n\nIn the afternoon our big Guns opened up and the boom and rattle shook many of the old Farm Houses which still stood on the outskirts of Bac St Maur and Fleurbaix. The enemy started to attack\n\nthe aeroplanes and shells commenced to fall round the many roadways. About 3 o'clock our 18 Pr. and Howitzer opened up a tremendous fusilade on to the German trenches. Gas was also let loose on them and after this attack our troops lept over the parapet and captured the first line of trenches. It was a glorious feat and the brunt of the work fell to the lads of our 5th Australian Division. They with the Divisions of ---assisting were not to be denied and on they\n\nwent further adding further diadems to the crown of glory they had won. By 9 PM the 4th line of trenches had fallen into our hands. As Irode through Fleurbaix it was sad to see the unfortunate climax to an attack and that was the wounded returning in Motor Ambulances. They came in car after car. At our Battery we had only one man wounded but other Batteries were not so fortunate. The gaping big holes in the fields in which you could\n\neasily bury a wagon will give you some idea of the power of the German Shells. We got a lot of Prisoners. Up till 10 PM the number was over 100. I saw a good number being brought down the roads in charge of escorts.\n","100":"\nA different aspect was placed on the position to-day. It appears our Infantry were too impetuous and took the attack too hurriedly. The Germans fell back to their 3rd line of trenches and our boys ejected them but no word was recvd by our Artillery to this effect and\n\nunfortunately some several of our shells fell into our own Infantry ranks. A good many casualties were caused this way and when the Germans attacked our lads were forced back and got caught in some heavy fire from the German guns which were able to enfilade their own trenches from the flanks owing to the line running in such a zigzag direction.\n\nAll to-day and well into the evening the Ambulance Cars were kept busy bringing in the wounded to Bac St Maur. It was a sad sight. Numbers of\n\nthe wounded walked down from the line. It was a stream of poor dishevelled looking men but in almost every case they bore up well. One cannot but be proud of our Infantry Boys.\n","101":"\nIt was quiet to-day and our Infantry had resumed their positions back in our first line of trench. There was a rumour of another attack by us but it did not eventuate. While over at Croix de Bac I met Messrs Orchard & Hampson M.H.R.s who were over with others on a trip from Australia. They had been through England in the Munition Works etc\n\nI invited them up to our Guns & took them through Fleurbaix where the village had almost been demolished. They inspected our Gun Positions & I took them back just before midnight.\n","102":"\nIt was quiet and very little doing. In all likelihood we will leave our position again tomorrow.\n","103":"\nNice crisp weather. Went up to Gun etc - Gunners - ors arrived down at Wagon Lines. We are to leave for Nieppe in the morning.\n","104":"\nThis morning it was\n\nanother departure and after packing up we left via Croix de Bac then through Erquingham on to Nieppe and then Pont de Nieppe. We had to Billet out on the fields there owing to no place being available for us. We are taking up our Guns into Armentaires tonight etc. The New Zealanders were centred all round this district of Armentaires & a Battery was located in the Farm we stayed at for the night. They were indeed very kind to us & the QM invited us todinner & gave me a shed to put my stores in.\n","105":"\nLast night we took our guns ammunition& Rations\n\nup. It seemed very eerie going through the streets of this Town. In the part we travelled through there was not an inhabitant & it was pitch dark. The large towering walls of the buildings frowned down on our procession of vehicles as we pounded up along the Flagstones. The place was desolation indeed & some fine magnificent edifices were a mass of ruins especially the Cathedrals. Some of the streets were almost blocked up with bricks & pillars of stones. It was in Armentaire that one of the Scottish Border Brigades put up such a splendid fight against the Germans & drove them out. We placed our Guns in\n\na row of semidetached cottages & we are to fire out on the German trenches just beyond. The Guns fire over a wall which encloses the yard & the Gun detachments have fine quarters in the ruined cottages. There is a good amount of furniture in the place & every one has a bed. The clocks stoves & everything is just as when the inhabitants left. The Town has a few nice squares surrounded by tall imposing trees. One can only bring up ammunition in the night owing to the aeroplanes hovering around.\n\nJuly 24th\nI travelled down to\n\nCroix de Bac and Sailly to-day &we shifetd our wagon lines further down towards Pont de Nieppe.\n","106":"\nHad a busy day exploring Armentaires,Engineers etc. Saw funeral procession. Girls with white veils and crowns Crosses banners etc. Coffin carried. One man with brass instrument.\n\nIt is sad to see the grass and weeds growing in the streets of this city. In the parts that are in ruins you will see perhaps a room standing intact and on the walls are the pictures hats & clothing just as they were\n\nleft by the fleeing inhabitants. A large number it will be remembered were killed during the bombardment of the city which stands on the Belgium Frontier.\n\nThe Observing Stn for our Battery is in the house ofthe ---. Guns are mounted in every conceivable position in the City. Many a charming residence has implements of death as its lodgers.\n","107":"to","108":"\nDuring the last four days our guns have been engaging parts of the German line. It was more with the idea of ranging\n\nthan to get any definite effect. Everyday the Hun has sentover a few shells into the City but the damage done was very small indeed. Some days I wandered round the deserted & ruined buildings & it was sad to see the personal effects left by the inhabitants who had deserted the City. I picked up many souvenirs. Where our Gunsare placed the cottages had beds cooking ranges crockery etc & it is amusing to see how some of the lads turn out in freak costumes they pick up.\n","109":"\nTo-day we are likely\n\nto move out again. Have had a good deal of messing about in connection withour Ordnance Section etc. The Germans shelled the old Church at Fleurbaix and it was a massof flames at Sundown.\n","110":"to","111":"\nThings were mostly quiet. Germans shelled part of Armentaires. I went along one road just after the bombardment & the houses were a mass of ruins.\n","112":"\nWe are to move out on the\n","113":" going to Walloon Cappel the first night then on to near St Omer.\n\nHave not been too well during the last few days mostly had stomach trouble etc.\n","114":"\nLeft this morning at 7 am. It was the usual rush etc but a delightfully cool breeze which pervaded the air made it rather pleasant as we started on our journey. Itwas a slow trip. We wound round & round the village roads halting for dinner at a pretty spot near a Forrest. At 6 PM we bivouaced at a charming spot. There was lovely undulating Hills etc. We were in a flat paddock & above us\n\nwas a ridge on which nestled two or three farm cottages surrounded with their cultivations of ripening wheat oats etc. There was no fences nothing but the cottages & hedges. It was ideal.\n\nIt threatened rain but fortunately we did not get it as expected. At 5 am we had our Reveille & after breakfast off we started again.\n\nThe trip was down through Estaires, Merville, St Omer & on to a little village called Lumbres. Here we found our quarters. The village was a quiet little place but our quarters were not asgood as they\n\nmight have been. Our Captain looked around for others & we then on the\n","115":"\nwent to another place. It was not much better & we had no water supply like the other farm if itcould be so called one. There it had a running brook through it.\n","116":"\nSlept in the farm shed. It is nowa delightful sight to view the ripening Harvest of Sunny France. The Golden yellow of thegrain is something to be remembered as itstretches across the landscape. There is a very busy aspect in many centers just now gathering in the\n\ngrain. It is said we are to do a bit of harvesting as well.\n","117":"\nOver at St Omer to-day. Fine ride. Viewedbeautiful old Cathedrals. S Sergt Lloyd & self had shave etc. \nYoungsters smoking\nPrice of Meat\nFrances morals & Paris taken as an example of etc.\n","118":"to","119":"\nHad a little open action training. We would manoeuvre in the fields full of growing crops. It seemed such a sin to trample\n\ndown the splendid grain. Also visited St Omer on several occasions. Word came through that we were likely to leave ourposition at Lumbres on a two days trip to Ypres in Belgium. The arrangements provided for a two days trip on the road. Had a sports gathering amongst - ourBattery won. Gretna Green, Wrestling on Horseback, Cockfighting Jumping etc. It was very interesting.\n","120":"\nI left Lumbres with the 1st Flight. The Right section of each Battery went in this flight. It was a lovely\n\nday as the column moved out. The column went through fields that had been harvested, Villages etc and at last reached Walloon Capel for tea. There we bivouacked in a paddock and left again next morning at 7 am.\n","121":"\nReached Castre at about midday then on to Godervarlade when R.S.M. Browne & I lunched. Brown & I had good sport at the rear of the column.\n\nPicked up rations when nearing Reinghlest. The only indication of the border between Belgium & France\n\nwas the presence of a few sentries representing the two Nations. We had to take over a temporary billetas the Canadians who we were relieving had not vacated their lines. It rained fairly heavy & our","122":" section gunners went up togun positions. I slept well after the fatiguing ride.\n","123":"\nOur","124":" section was to arrive late to-day & I went to meet them.\n","125":" to","126":"\nWent into action in\n\nthe evening of the","127":" Our position was in a woods beyond Dickebusch and near Ypres. There was a road most of the way up but near the finish we had to cross a paddock. It was full of shell holes.\n\nFor several days it rained heavy and the place was mud & holes. In the Gun Pits it was impossible to move with the mud and things were most uncomfortable. Several nights our guns opened up and gave the enemy plenty of hate.\n\nStarted a canteen at our lines & it made things\n\na little more homely for the men & we could then send up items to the Gun Positions. Rumour has it that we may winter in Belgium.\n","128":"\nHad a surprise to-day, Ray Sparkescame to our lines he having been attached to the old","129":" Battery.\n\nA few days ago while riding from Poperinghe I met young Earwaker he was carrying a swag & looked well.\n\nNear us is a big 60 Prd Gun and she shakes everything when she fires.\n\nA field of Aeroplanes\n\nwent over to-day. About 30 in all. It was a great sight & the air seemed full of wasps with the hummings of the engines.\n","130":" to","131":"\nNothing much to record.Small stunts etc., sawa Gas Balloon descend on fire after an assault by our Aeroplanes.\n\nWe shifted our lines to Boechepe for a few days. In this little Village I met Jim Maher just coming out of the Baths.\n","132":"\nBack again to\n\nanother line and our Guns were in action in a different position.\n","133":"\nSaw Oliver Gunderson.\n","134":"to","135":"\nPlenty of damp weather. Had a concert and gave out results of canteen. Rumours of our leaving. Ray Sparkes called up and the","136":" was to leave tomorrow.\n\nto","137":"\nThings about the same. Usual air fights etc. Heard we were to go to the Somme Front. Usual preparations. Left\n Wagon Lines\n","138":"\nLeft on Trek. A\n\n\n\nfair day & enjoyed it. Arrived Neuf Berquin.Camped at Farm and went to Concert of A.S.C. Enjoyed it.\n","139":"\nSharp frost. A very cold journey. Got off to walk most of the way. Went through St Ventant Lilliers etc on to Liers where we billetted. Had bed in an attic over shops. Had to go over to Beauecq for rations.\n","140":"\nLeft Liers, Crisp morn. Coming through Merville the Town Fair was on in the city square. It was a scene of black. Every woman was dressed inthat color.\n\nI was dreadfully cold & the sharp wind cut us as we went along. Found our travelling Kitchen very useful at dinner time. Went on from Pernes, Valhuon to Orlencourt. Had to go on to Magnicourt for rations. The sky looked leaden that evening & I ventured to say it would snow. Fixed up room at Estaminet & returned early.\n","141":"\nWoke to find it was snowing. Everything was white & of course it was cold. On the road we indulged in a little snowballing. Had to go on ahead with party for rations & went via Freventand on to Doullens where\n\nwe lunched. Had chips in a little French shop charming littlelady who kissed me. Ourdestination was Orville but I regret to say it commenced to rain & we had snow rain sleet & mud all in one day. Rations arrived late. Had miserable night & our wagon lines all mud etc.\n","142":"\nFeeling miserable & went on with party but as we struck a steep hill we had to alter our journey & go back a little towards Doullens & then on to Beauval to Talmas & Flesselles where we camped\n\nHad a sleep in room.Wagon Lines in orchard struck Reeves in Signallers late reveille next morning.\n","143":"\nLeft for Naours. Party ahead. Arrived about 11.30. Small village. Heard we are Brigade in Reserves.\n","144":"to","145":"\nAwful wagon lines Mud & slush. Ordinary routine Mess up with rations. A number of men bad with feet etc\n","146":"\nVisited Caves or Les Soutterains . Excavated\n\nPassages,Fossils,Furnitureetc.It is under chalk cliff and there are miles of passages with antechambers etc. The Normans were supposed to have taken refuge.\n\nS. L. Crompton\nAus Base PO\nLondon\n\nH M Richards\nSouth Bromfield\nJesmond\nNewcastle on Tyne\nEngland\n\nSergt Jones & Bd Weston\n\nMr E Hall\nChurch Farm\nTilstock\nWhitchurch\nShropshire\n\n8403 Driver Tom Hall","147":" Headquarters Coy\n4th Divisional Jn\nA.A.S.C.\n\nchilblains\n\nA Lang\n","148":" to","149":"\nOn the evening of the 3rd received instructions I had to report to St John's Wood School to train as cadet . Many farewells etc\n","150":"\nDrove to Canaples in Cook's Cart. Had argument with RTO & left for Abbeyville at 2.30.\n\nMiss B Haines\nMitcham\nThe Park\nGoldersGreen\nHampstead\nLondon\n\n\n\nCorp Bliss\n\nMiss Pelfie Paul\nExbury House\nHilson Rd\nSouthsea\nHants\n\nMrs F Paul\n61 Marmion Rd\nSouthsea\nHants\n\nClaude\nPerkins\n\nArrived at Abbeyville at 5pm & was instructed to leave by the train to Le Havre.\n","151":"\nOur train started at about 3 am. It was a tedious journey & cold. Arrived at Le Havre at\n\n9.30 & had a run for boat. It left about midnight.I got a bed down in seamen's quarters.\n","152":"\nVery rough journey. Arrived Southampton at 7.30 & had to wait for train till 9.15. More Military Muddledum. A lot of Airservice men wanted to travel but they would not let them & sanction had to be obtained etc.\n\n"}}