{"Document Name":{"0":"Diary_0271","1":"Diary_0271","2":"Diary_0271","3":"Diary_0271","4":"Diary_0271","5":"Diary_0271","6":"Diary_0271","7":"Diary_0271","8":"Diary_0271","9":"Diary_0271","10":"Diary_0271","11":"Diary_0271","12":"Diary_0271","13":"Diary_0271","14":"Diary_0271","15":"Diary_0271","16":"Diary_0271","17":"Diary_0271","18":"Diary_0271","19":"Diary_0271","20":"Diary_0271","21":"Diary_0271","22":"Diary_0271","23":"Diary_0271","24":"Diary_0271","25":"Diary_0271","26":"Diary_0271","27":"Diary_0271","28":"Diary_0271","29":"Diary_0271","30":"Diary_0271","31":"Diary_0271","32":"Diary_0271","33":"Diary_0271","34":"Diary_0271","35":"Diary_0271","36":"Diary_0271","37":"Diary_0271","38":"Diary_0271","39":"Diary_0271","40":"Diary_0271","41":"Diary_0271","42":"Diary_0271","43":"Diary_0271","44":"Diary_0271","45":"Diary_0271","46":"Diary_0271","47":"Diary_0271","48":"Diary_0271","49":"Diary_0271","50":"Diary_0271","51":"Diary_0271","52":"Diary_0271","53":"Diary_0271","54":"Diary_0271","55":"Diary_0271","56":"Diary_0271","57":"Diary_0271","58":"Diary_0271","59":"Diary_0271","60":"Diary_0271","61":"Diary_0271","62":"Diary_0271","63":"Diary_0271","64":"Diary_0271","65":"Diary_0271","66":"Diary_0271","67":"Diary_0271","68":"Diary_0271","69":"Diary_0271","70":"Diary_0271","71":"Diary_0271","72":"Diary_0271","73":"Diary_0271","74":"Diary_0271","75":"Diary_0271","76":"Diary_0271","77":"Diary_0271","78":"Diary_0271","79":"Diary_0271","80":"Diary_0271","81":"Diary_0271","82":"Diary_0271","83":"Diary_0271","84":"Diary_0271","85":"Diary_0271","86":"Diary_0271","87":"Diary_0271","88":"Diary_0271","89":"Diary_0271","90":"Diary_0271","91":"Diary_0271","92":"Diary_0271","93":"Diary_0271","94":"Diary_0271","95":"Diary_0271","96":"Diary_0271","97":"Diary_0271","98":"Diary_0271","99":"Diary_0271","100":"Diary_0271","101":"Diary_0271","102":"Diary_0271","103":"Diary_0271","104":"Diary_0271","105":"Diary_0271","106":"Diary_0271","107":"Diary_0271","108":"Diary_0271","109":"Diary_0271","110":"Diary_0271","111":"Diary_0271","112":"Diary_0271","113":"Diary_0271","114":"Diary_0271","115":"Diary_0271","116":"Diary_0271"},"Date":{"0":"unknown","1":1860.0,"2":1861.0,"3":1862.0,"4":1864.0,"5":1867.0,"6":1868.0,"7":1869.0,"8":1870.0,"9":1871.0,"10":1872.0,"11":1873.0,"12":1874.0,"13":1875.0,"14":1876.0,"15":1877.0,"16":1886.0,"17":1887.0,"18":1888.0,"19":1890.0,"20":1891.0,"21":1893.0,"22":1894.0,"23":1895.0,"24":1896.0,"25":1897.0,"26":1898.0,"27":1899.0,"28":1900.0,"29":1905.0,"30":1906.0,"31":1907.0,"32":1908.0,"33":1909.0,"34":1910.0,"35":1911.0,"36":1912.0,"37":1916.0,"38":1918.0,"39":1922.0,"40":1924.0,"41":1925.0,"42":1926.0,"43":1928.0,"44":1929.0,"45":1930.0,"46":1931.0,"47":1932.0,"48":1933.0,"49":1934.0,"50":1935.0,"51":1936.0,"52":1937.0,"53":1940.0,"54":1941.0,"55":1942.0,"56":1943.0,"57":1944.0,"58":1945.0,"59":1947.0,"60":1948.0,"61":1949.0,"62":1950.0,"63":1951.0,"64":1952.0,"65":1953.0,"66":1954.0,"67":1955.0,"68":1956.0,"69":1957.0,"70":1958.0,"71":1959.0,"72":1960.0,"73":1961.0,"74":1962.0,"75":1963.0,"76":1964.0,"77":1966.0,"78":1967.0,"79":1969.0,"80":1971.0,"81":1972.0,"82":1975.0,"83":1976.0,"84":1977.0,"85":1978.0,"86":1979.0,"87":1980.0,"88":1981.0,"89":1982.0,"90":1983.0,"91":1984.0,"92":1985.0,"93":1986.0,"94":1987.0,"95":1988.0,"96":1989.0,"97":1993.0,"98":1994.0,"99":1995.0,"100":1996.0,"101":1997.0,"102":1998.0,"103":1999.0,"104":2000.0,"105":2003.0,"106":2004.0,"107":2005.0,"108":2015.0,"109":2016.0,"110":2019.0,"111":2020.0,"112":2021.0,"113":2022.0,"114":2023.0,"115":2024.0,"116":2025.0},"Entry":{"0":"\n\n \n\n","1":" New Year opens, finding us at Biesme some 16 kilos south of Charleroi awaiting our turn to go to Australia.\n\nTo-day a party of us went to the Field of Waterloo by motor lorry, seeing Quatre Bras on our way. The Lion & other monuments & the farms were seen, including the fine French \"Dying Eagle Defends the Tricolour\" Afternoon tea with some Australian nurses was very nice.\n\n \n","2":" Raining again to-day. Rumours that some men are going Home on transport duty soon.\n","3":" Ambulance reduced to two sections, C Section being merged into \"A\" & \"B\"\n","4":" A Tommy on sick parade amused me this morning, it being at least five months since his last bath.\n","5":" Leave to Charleroi from to-morrow but am going on to Bruxelles to-morrow morning all being well.\n\n \n","6":" In Brussels to-day & to-night & have a good look round the city which is very fine \"Thiar\" at the opera was very nice. Leave to-morrow afternoon.\n","7":" In Brussels unit 2 p.m. when leave for Charleroi arriving after a most awful Journey of six hours\n","8":" At Beisme again More rumours about return to Australia on","9":"\n\n \n","10":" Visit Cemtery nearby where many Germans & French are buried after battle here in","11":"\n","12":" Rotten weather & nothing to do here but read. More demob. rumours.\n","13":" Fine weather like spring.\n","14":" Great dessatesfactions among the A.M.C. of this division consequent upon men from battalions & from England of later dates of embarkation from Australia, going back Home.\n","15":" To-day we were told that all the A.I.F. would be out of France in five months, but as to our 1915 men, uncertainty exists. Snowing a little to-day. \n","16":" Doing nothing but loaf. Last night it snowed heavily and the ground is \"tout blanc\" We made a decent walk through the woods which are very pretty just now.\n","17":" Am going on leave to Paris soon. Have another walk through the snow covered woods.\n","18":" Awaiting patiently my leave pass for Paris\n","19":" Heavy snow last night & there is 6\" over everything to-day & the villages are fairy like in appearance.\n","20":" My Paris pass is a long time coming through.\n","21":" Paris pass arrives at last and to-morrow I will catch the Cologne-Boulogne Express as far as Arras.\n","22":" Leave Charleroi at 6 p.m. and travell all night in guards van.\n\n5th. Am in Paris, but after a most awful journey of 28 hours. We took just 24 hours to get to Arras, when it was snowing heavily, but by luck I caught a train for Paris arriving there at 9.30 p.m.\n","23":" Our route lay Charleroi- Mons- Vallenciennes- Douai- Arras- Albert- Amiens- Paris. Y.M.C.A. to-night, Hotel Ostende near Opera.\n","24":" Change quarters to Grand Hotel de la Malte, rus de Richeleu, which is very decent. With Morris Briggs. \n\n This afternoon Louvre, Concorde & Champs Elysees. To-night at Opera Comique hearing \"Tales from Hoffmann.\"\n","25":" The day in Latin Quarter. Notre Dame, Hotel de Ville, Palais de Justice & St Chapelle, Gervais St Pres (struck by German shell) Pantheon, Luxembourg Gardens St Sulpice & St Ettienne. Dinner at \"Bisson\" & the \n\nFebruary.\n\nevening at the \"Follies\". Jersey Hotel.\n","26":" Latin Quarter again. Churches of St Julien le Pauvre, St Severin St Germain des Pres and Sorbonne, Musee de Cluny.\n\nIn afternoon to the Madeline & in Evening to Opera, \"Othello\"\n","27":" Versailles per train. Perhaps the best day I had in Paris The Grand Canal frozen & skating is in full swing. Opera again. \"Thias\"\n","28":" -15th Enjoying myself thoroughly in Paris seeing more sights & more operas. (Werther) Night of","29":" under Miss Routs care at New Hotel, in order to be near Gare du Nord Have had cold but fine weather.\n","30":" Leave Paris at 7.30 per Brussels express via Amiens Arras, St Pol & Lille, arriving Brussels at 12.15 in night.\n","31":" Morning at Galleries in Brussels & leave per 2 p.m. for Charleroi, arriving at unit at 8.30 p.m.\n","32":" Back at Biesmes to find I had missed a draft for Australia which left on 12th. However am well up on the next, which rumour has will leave on","33":"\n","34":"\n","35":" Close hospital & wind up 1st Aust. Field Ambulance as a medical unit. Draft will now not leave before","36":"\n","37":" Hand over all equipment of Ambulance, except things which are absolutely necessary to carrying on of unit. Doing nothing but wait orders for Australia. Weather unsettled.\n","38":" Dirty day and miserable but nevertheless went for a walk to Devant-les-Bois.\n","39":" Beautiful spring day and walks over the fields have been very enjoyable. \n\nThis \"Grippe Espagnol\" is still rife in Belgium, and is the cause of a heavy mortality in the A.I.F. also.\n\nSales of Army Horses are going on daily & prices realised are enormous, 2600 francs for one old crock, and 1000 francs for a mule.\n\nIt is now definite that our draft will not leave until","40":" of the month. Traffic has been dislocated by strikes in England. There is also unrest here.\n","41":" To-morrow the draft moves to Chatelet to concentrate with No 16 Quo\na\nta \n","42":" at Chatelet where we are now H.Coy No.16 Quota & we are to move on to Divisional Wing on ","43":" & entrain on 11th at Charleroi.\n","44":" Visiting picture shows & the panto during last few days in Charleroi. \n\nParade to-day to be inspected by Colonel Trail our C.O. Move to-morrow.\n","45":" Further move to-day to Demob. Concentration Camp Charleroi, from where we entrain to-morrow for Le Havre. Last evening at Charleroi, \"Trianou\"\n","46":" Entrain this morning at 10 a.m. & move out 15 minutes later. Adieu Charleroi & Belgium. Our route lays through Mons Douai etc. Comfortable truck.\n","47":" After a remarkably quick & comfortable journey of 30 hours we arrived at Harfleur to-night at about 5 p.m. & marched to the Camp where we spend the night. Everything on the journey was the best possible.\n","48":" Generally fixed up with bathing, clean clothes (new) & sea kit bags, after which we move under canvas for the night. Equipment handed in.\n","49":" More routine to-day & move into huts again. Visit Havre.\n","50":" Q.M. parade for clothes etc.\n","51":" Good concert by Lena Ashwell party which was classical & very good.\n","52":" Another visit to Le Havre. We leave here in about four days.\n","53":" The day for our departure from France has arrived, but we did not go. Very dirty night.\n","54":" Glorious day for the last in France. Move by ’busses to docks at Havre, where we embarked on \"Duchess of Devonshire\" & left France behind at 11 p.m.\n","55":" An awful trip to Weymouth, arriving at 7 a.m. (French Time, 1 hour fast) & anchored off until we disembarked at 11.30 a.m. & after meals entrained & arrived at R.B.A.A. Heytsburg at 3.30 pm (English Time)\n","56":"\n","57":" Another injection of germs, innoculation against influenza.\n","58":" Very cold indeed. Twice to Church yesterday. We go on leave on","59":"\n","60":" The much feared workmens strike has not come off & we are now in London on 14 days leave at \nShelb\n Lincoln Hall Hotel after much trouble.\n","61":" At National Hotel, Russell Square, Westminster Cathedral & National Galleries. \"As you Were\"\n\n29th. Croydon.\n","62":"\n","63":" Rotten Row etc. & Richmond. Rotten weather snowing off & on, but sun between the showers.\n","64":" Wander round doing mostly nothing.\n","65":" Nurse this evening at Troe & \"Yes Uncle.\" To-morrow I go to Eastbourne. Discovered Old Curiosity Shop, whilst walking round the Inns of Court.\n","66":" Arrived at Eastbourne this afternoon of a nice day. Have an idea I will like the place.\n","67":" Glorious weather, fine & sunny & I have a nice companion & we have been tramping along the coast & across the downs this afternoon.\n\nApril.\n","68":" This afternoon, we walked to Pevensey, seeing the \"Old Mint House\" & the ruins of the castle. \"Daddy Long Legs.\" Beachy head in the morning \n","69":" This afternoon we walked across the downs to Sevington an ordinary kind of English village Fine weather still holds & is very enjoyable. Madame Kirby Leewithers this evening at Devonshire Park was very fine indeed.\n\nApril.\n","70":" Cloudy to-day, but still enjoyable along the coast etc.\n","71":" Gloriously fine & I did nothing but laze on the front.\n","72":" Return to dirty London on a dirty day.\n","73":" British Museum & Zoological Gardens. The latter are very poor indeed.\n","74":"\n","75":" Left London by 7.15 & arrived back at Heytesbury at 12 mid-night, after a most pleasant 14 days.\n","76":" Down to earth again Awful!!! Concert at YMCA to night was very good indeed, Meditation being played.\n","77":" Move to-day en route to A.M.C. Depot at Fovant via Salisbury, but on arriving find that camp is full of 1916 men & we had to go on to Hurdcott.\n","78":" Demob. of A.M.C. men is not satisfactory since we 1915 men are not being fairly treated here, not being on any precedence roll. Existence is awfully monotonous here & weather unpleasant.\n","79":" Walk to Wilton this evening after tea, which is a town\n\nof Saxon interest.\n","80":" Motor to Salisbury this afternoon & look over the town Cathedral & along the Avon. Walk Home via Wilton, where we go ","81":"\n to-morrow to see the Earl of Pembroke's house & Garden.\n","82":" I have now been moved from Hurdcott to Fovant and have immediately been put on a boat roll, \"China\", to leave Devonport on","83":" prox. We will go to join her at London on","84":"\n","85":"\n","86":" out this evening to report to London. Sleep at War Chest Club. Wonderful weather & as late as to-day, London had six inches of snow.\n","87":" Join \"China\" at Albert Docks, & this afternoon went to London. We will be very comfortable on this boat & are due to arrive in Sydney on 12th June.\n","88":" Leave docks & wend our way down the Thames. We are now in Channel opp Dover, en route for Plymouth.\n","89":"\n","90":" After a calm voyage of twenty hours we entered Plymouth Sound leaving Plymouth Hoe on the right & went up to the naval dockyard of Devonport. Quite a large number of men 'o' warsmen are in here, including the biggest boats.\n\nLeave for the evening to Plymouth, to where we went on a lorry much to the amusement of the populace.\n\nTheatre Royal for a show.\n\nMay.\n","91":" Early this morning & last night we have been taking troops on board & we have now over 1000 men women & children aboard. It was not without a thought that we pulled out of Devonport this evening passing many craft of war, with decks lined with cheering tars. The ensign was dipped to us from all boats. Anchor for the night, in Plymouth Sound, just off Plymouth Hoe. Devon with its red cliffs & trees in flush of bud looks glorious.\n\nMay.\n","92":" Leave Plymouth Sound at 10 a.m. & ran into dirty weather all day. Many sick.\n","93":" Weather better to-day & sunny & warm. Now at 7 p.m. off Spanish Coast near Finistire.\n","94":" Glorious day, calm & warm. A pretty glimpse of the coast of Portugal to-day (12 noon). Our food is first rate & plenty of it. Passing many boats.\n","95":" Awoke at 7 this morning to find we were in the Strait approaching Gibralter, which looks all it is reputed to be. African coast mountainous & Spanish Coast dotted with white villages is very pretty. Fine day.\n","96":"\n","97":" After a very pleasant journey through the Mediterranean we arrived at Port Said at 3 p.m. this afternoon & immediately began to coal.\n\nThe \"Karagola\" about one hour ahead of us.\n","98":" All day coaling at Port Said where we have held aquatic sports.\n\nThis evening at 6 p.m. we moved & are now in the Canal, with \"Karagola\" some two miles astern.\n\nPort Said is not very impressive deriving its importance solely from the fact that is the N. Canal terminus.\n","99":"\n","100":" With the \"Karagola\" just astern of us, we passed out of the Canal at 5.30, covering 87 miles in 11 ½ hours.\n\nHowever the \"Karagola\" left two hours or more ahead of us but we caught her at 8 p.m., passing her to strains of \"Good Byee!!\"\n\nCountry of Sinai & that of Egypt along Gulf of Suez is the most inhospitable country I have seen. Now in Red Sea.\n","101":" Very hot two days & a few patients stricken down.\n\nSouthern Cross visible to-night!!!\n","102":"\n","103":" All day the Arabian & African Coasts have been visible seeing one Arabian town & at 5 p.m. we passed Perim & into the Gulf of Aden. Saw first flying fish to-day.\n","104":" Passed Socrota to-day very closely & it is very barren indeed.\n","105":" Detailed to work with a Sister to-day & had a very amusing time, especially in carrying a patient along the deck. Frightfully hot & enervating.\n","106":"\n","107":" Arrived at Colombo at daybreak to-day & all troops had shore leave. I drove round all day in rickshaws, cars and \"garris\" and had a most glorious time.\n\nMore than ever Colombo impresses me as \"paradise\" Expect monsoonal weather now. Leave at 8 p.m. again \"Karagola\" expected to-morrow.\n","108":"\n","109":" After a run of varied weather across Indian Ocean, we reached Fremantle this morning & experienced (some on board) the welcome home.\n\nAfter disembarking W.A. troops, we had leave & I went up to Perth.\n\nFine Sunday afternoon.\n","110":" Arrive off Outer Harbour, Adelaide at 6 a.m. & disembarked troops at 1 p.m. & left at same hour. Glorious day.\n","111":"\n","112":" After a very quick run arrive off Port Phillip heads & anchor of Quarantine Station.\n","113":" Move up to port Melbourne & after disembarking troops for that port, we had leave for a few hours.\n\nAlso take on board troops for north, from Boonah.\n","114":" Leave Melbourne at 7 a.m.\n","115":"\n","116":" After slow voyage we arrived inside Sydney heads at 7 a.m. & there I saw the best sight of my travells. The beauty of the harbour improves after nearly four years absence. Disembark at Wooloomooloo & conveyed to Anzac Buffet Domain, where I met friends & at 2.30 p.m. was in possession of my discharge, dated Aug 3.\n\n"}}