{"Document Name":{"0":"Diary_0516","1":"Diary_0516","2":"Diary_0516","3":"Diary_0516","4":"Diary_0516","5":"Diary_0516","6":"Diary_0516","7":"Diary_0516","8":"Diary_0516","9":"Diary_0516","10":"Diary_0516","11":"Diary_0516","12":"Diary_0516","13":"Diary_0516","14":"Diary_0516","15":"Diary_0516","16":"Diary_0516","17":"Diary_0516","18":"Diary_0516","19":"Diary_0516","20":"Diary_0516","21":"Diary_0516","22":"Diary_0516","23":"Diary_0516","24":"Diary_0516","25":"Diary_0516","26":"Diary_0516","27":"Diary_0516","28":"Diary_0516","29":"Diary_0516","30":"Diary_0516","31":"Diary_0516","32":"Diary_0516","33":"Diary_0516","34":"Diary_0516","35":"Diary_0516","36":"Diary_0516","37":"Diary_0516","38":"Diary_0516","39":"Diary_0516","40":"Diary_0516","41":"Diary_0516","42":"Diary_0516","43":"Diary_0516","44":"Diary_0516","45":"Diary_0516","46":"Diary_0516","47":"Diary_0516","48":"Diary_0516","49":"Diary_0516","50":"Diary_0516","51":"Diary_0516","52":"Diary_0516","53":"Diary_0516","54":"Diary_0516","55":"Diary_0516","56":"Diary_0516","57":"Diary_0516","58":"Diary_0516","59":"Diary_0516","60":"Diary_0516","61":"Diary_0516","62":"Diary_0516","63":"Diary_0516","64":"Diary_0516","65":"Diary_0516","66":"Diary_0516","67":"Diary_0516","68":"Diary_0516","69":"Diary_0516","70":"Diary_0516","71":"Diary_0516","72":"Diary_0516","73":"Diary_0516","74":"Diary_0516","75":"Diary_0516","76":"Diary_0516","77":"Diary_0516","78":"Diary_0516","79":"Diary_0516","80":"Diary_0516","81":"Diary_0516","82":"Diary_0516","83":"Diary_0516","84":"Diary_0516","85":"Diary_0516","86":"Diary_0516","87":"Diary_0516","88":"Diary_0516","89":"Diary_0516","90":"Diary_0516","91":"Diary_0516","92":"Diary_0516","93":"Diary_0516","94":"Diary_0516","95":"Diary_0516","96":"Diary_0516","97":"Diary_0516"},"Date":{"0":"unknown","1":1037.0,"2":1038.0,"3":1039.0,"4":1040.0,"5":1041.0,"6":1042.0,"7":1043.0,"8":1044.0,"9":1045.0,"10":1046.0,"11":1047.0,"12":1048.0,"13":1049.0,"14":1050.0,"15":1051.0,"16":1052.0,"17":1053.0,"18":1054.0,"19":1055.0,"20":1056.0,"21":1057.0,"22":1058.0,"23":1059.0,"24":1060.0,"25":1062.0,"26":1063.0,"27":1064.0,"28":1065.0,"29":1066.0,"30":1067.0,"31":1068.0,"32":1069.0,"33":1070.0,"34":1071.0,"35":1072.0,"36":1073.0,"37":1074.0,"38":1075.0,"39":1076.0,"40":1077.0,"41":1078.0,"42":1079.0,"43":1080.0,"44":1081.0,"45":1082.0,"46":1083.0,"47":1085.0,"48":1086.0,"49":1087.0,"50":1088.0,"51":1089.0,"52":1090.0,"53":1091.0,"54":1092.0,"55":1093.0,"56":1094.0,"57":1096.0,"58":1102.0,"59":1103.0,"60":1107.0,"61":1108.0,"62":1109.0,"63":1112.0,"64":1113.0,"65":1114.0,"66":1117.0,"67":1118.0,"68":1133.0,"69":1134.0,"70":1135.0,"71":1137.0,"72":1141.0,"73":1159.0,"74":1165.0,"75":1167.0,"76":1180.0,"77":1181.0,"78":1184.0,"79":1187.0,"80":1192.0,"81":1196.0,"82":1197.0,"83":1198.0,"84":1199.0,"85":1200.0,"86":1205.0,"87":1209.0,"88":1210.0,"89":1211.0,"90":1212.0,"91":1213.0,"92":1214.0,"93":1215.0,"94":1217.0,"95":1220.0,"96":1221.0,"97":1222.0},"Entry":{"0":"\n\n \n\n","1":" Church parade on Common presided over by Chaplain – General Rentoul who has \njust arrived from Australia with a message from Australia that the \"Home fires are kept\n burning\" for us\n","2":" We voted to-day on the conscription question in Australia. Each man received a \nprinted manifesto from W.M.Hughes stating the terms of the proposition.\nLeave has been granted to the brigade for 4 days, to be taken consecutively in batches \nof 20%. Men are allowed to visit relations in any town in England or\n\n \n\nScotland on production of their fares, but to go to London they must show £4. In \nmost cases this is impossible. The idea is to keep the troops out of London as much as \npossible on account of the terrible lot of venereal cases that have been caused in \nLondon.\n","3":" 1st Batch gone on leave to London.\n","4":" Half holiday. Inter-battalion Rugby match against 33rd was won by the 36th","5":" \nThe band played a program and were well treated by the New Colonel and officers.\n\n \n","6":" A man came through the hut selling papers and being the eligible age for \nenlistment was asked why he was not in kharki. He said he had presented himself but \nhad been rejected for being \"mentally deficient\" \"But I will be all right\" he said \"I am \ngoing home to practice up a bit.\nWe do half-an-hour a day physical exercises under an imperial expert and it is doing us \nthe world of good.\nAnother story told is of an old hen that was standing in the road when a motor came \nalong at 40 miles an\n\n \n\nhour and the poor old hen had a severe handling. She slowly picked herself up and \nshook the dust from her feathers and said \"Gee! that was some rooster\"\n","7":" Church parade.\n","8":" Went out for a walk to Salisbury, a delightful walk along by the River avon. Old \nfashioned little towns, Scotland, Woodford and several others we did not know the \nnames of. The people, simple folk which look as if they had stepped out of a book \nnodded to us as we passed and wished us \"good afternoon. \nWe can just imagine\n\n \n\nwriters coming to a place like this for inspirations and characters for their works. The \nholly is looking lovely now covered with red berries which seem to say \"Christmas is \ncoming. Blackberries grow all along the side of the road covered with ripe berries. \n We were given at Salisbury a lot of Chestnuts and when we got back to camp we sat \nround the heating stove roasting them. \n We enjoyed them very much. They are something like a sweet potato to taste. They \nwere also going to\n\n \n\ngive us some walnuts but none had fallen and it appears you cannot eat them until they \nfall to the ground.","9":" of the band have gone on leave to London including the bandmaster and I am left in \ncharge till Tuesday when they come back and we go on the Wednesday. We are \nstopping in the hut doing nothing (in the way of work) and expecting the Major to come \nround and roar out \"Where has the Band got to. It is a great joke among the officers and \nmen\n\n \n\nEvery time the battalion is on Parade, the Major after calling the Parade to attention he \nalways finishes with roaring \"Stand steady the band\". At a concert the other night given \nmainly by bandsmen, the Major acted as chairman and gave a song. \n Every now and then some of the men would sing out \"Stand Steady the Band\" but the \nMajor only smiled and took it in good part.\nOur doc. is a good old sport. Every time we play at the officer's mess he shouts us a \ndrink and gives us boxes of 20 \"Greys\" (Cigs)\n\n \n\nand says \"from the O.C. stretcher bearers\". Sometimes when he is a little merry he \nwants to conduct us and he gets in the centre and swings his stick while we play\n (\"So Long Letty. His name is Capt McPherson.\nMajor Lloyd is just what he looks, a deep thinking, dare-devil officer beloved by the \nRegiment and sometimes dubbed \"Suicide Lloyd.\nHe has been over at Gallipoli where he was thought a great deal of and men would \nfollow him anywhere so report has it.\nAt officers mess he was jumping over tables in a \n\n \n\nmanner which made one think he would crack his neck.\n The battalion has been issued with new Service rifles and are starting to put up their \ncolours which so far they have had to buy at the shops up on the main street.\n","10":" Had to march up to A.D.M.C. and undergo an examination on theoretical and \npractical stretcher bearing. I was in charge and had to drill the squads through \nExamination.\n","11":" Easy day nothing doing rec'd about 14 letters\n\n \n","12":" Paper boys come yelling round the huts singing out \"All About it\" at 6.30 am. They \ndon't give any more information.\nThere is a picture & Vaudeville show here where women about 50 dress up as \nflappers and if they don't sing a \"rough\" song they are counted out. I was to have gone \non leave this morning but owing to a clerical error my name has been cut out till ","13":" Hard Luck.\n","14":" We get plenty of Stew but see no meat in it, which leads me to think that before \nlong the cooks will\n\n \n\nbe making stew without using any meat at all.\n","15":" Went on 4 days leave to London.\n\nArrived at Waterloo 11.30 am. I only had £1 to keep me for the 4 days so I had \nto go very light. On every big station in \nWaterloo\n London is a buffet for \nsoldiers where a cup of tea or coffee and cakes & bread & butter may be had \nfree So I went down and had some refreshments then made off for Buckingham Gate \nSoldiers home where I booked my rooms and left my coat. I then went to the Anzac Club \nwhere free dinners\n\n \n\nare provided for Australian and New Zealand soldiers. I then went over to a table where \nan Australian lady was sitting looking after the Australians, by way of arranging for free \npasses to the various theatres. She must have been very wealthy as she was wearing \na brooch with a diamond that must have been worth nearly £100. \nThese ladies are grand, and too much cannot be said in praise of their efforts to do \neverything possible for the Australian's comfort and entertainment. I heard of\n\n \n\none who is very wealthy, with a beautiful home etc. to continually serve of a night at a \nsoldier's home for 3 \nnight\n months, when the doctor, fearing a \nbreakdown ordered her away.\nThis shows the spirit of the better class of English women. I went to see if I could get a \npass for a matinee on the Monday afternoon. She gave me a pass for \"Samples\" at the \nComedy Theatre and I obtained a reserved dress circle seat which would have cost a \ncivilian","16":" The play was only fair. It\n\n \n\nwas a revue and I am not very partial to revue. One thing in which the London theatres \ndiffer from the Australian is that here smoking is not only allowed but ash trays are \nprovided on the seats in front of you.\nAfter it was over I went back to the Club and got another ticket for the Oxford which was \nplaying \"Back to Blighty\" It was another revue and not much better that the other one. \nThe Oxford however is a magnificent theatre yet I think that there must be some\n\n \n\na lot better even than this I then went to my rooms and spent a pleasant night between \nnice white sheets. (Private)\n","17":" Down at 8 and had breakfast. I then got on the tube and went to St Pancras Station \nwhere I booked through to Luton. On the station I noticed the luggage trucks were \nhauled by a small box-like electric Engine.\nI arrived at Luton at 10.20 and quickly found my way to My Aunt Lizzies. Luton is a fine \ntown of some 55,000 population & its chief industrys are the \n\n \n\n(Private)\nhat trade and the manufacture of munitions.\nMy uncle will is engaged in the manufacture of hand grenades and is turning out some \n50,000 a week. I spent a very interesting morning, my uncle explaining the process of \nmanufacture.\nI spent some time with my aunt and Cousin Will, who took me round and showed me the \nSchool and Church my dad used to go to, also the house he was born, and my \ngrandmother died in. She asked me to ask dad did he re\n\n \n\nmember Barber's Lane.\nMy cousin Frank has won the championship for grenade throwing in England & \nFrance his record being 69 7\/8 yds from a trench. \nAfter dinner I left Luton to go on to Harlington to see my grandad. It is a very pretty \nplace though small. There are 3 public houses though you would not think there were \nenough people to keep one going. Grandad was very glad to see me. He is very feeble \nas his health has gone down a lot this\n\n \n\nlast 2 years though until then he has been as straight as a lath and very active.\nHe has considerable pain in his legs and can hardly walk around still he sits there in his \nchair never complaining, in a manner that makes one's heart go out to him. He has a \nnice garden but of course it is going to ruin now he cannot attend to it.\nHe looks and speaks just the same as my dad only of course much older.\nHis housekeeper is a real old freak, but a kind –\n\n \n\ner and more considerate woman to an old man like him, it would be impossible to find. \nShe treats him just like a little child and her life seems just the desire to look after him. I \nam glad he is well looked after for I am satisfied he could not be in better hands.\nI also saw my cousin Fanny and her children. I left Harlington at 20 to 7 for London.\nAbout 6 munition girls got in at the next station and the way they were smoking and \ntalking\n\n \n\nfilled me with disgust I cannot but think that after the war it will be hard to get the modern \ngirl back to the home. They earn £ 3 and even more a week and a larger number \nof them drink while the majority smoke.\nWe passed Hendon Flying School by the Railway line.\nA few miles from Luton is Doddington Hall where the German officers are interned. \nThey have tennis, polo, and other games and are treated in a manner that is\n\n \n\nNOV I\nall out of proportion to their positions as prisoners of war.\nWe got back to our rooms at 11.45 PM.\n","18":" On Wednesday morning I got on a bus at Marble Arch and went right through to \nthe Bank Corner. Down Oxford St, Regent St, Piccadilly & Ludgate Circus Strand \netc.\nThe bank of England is a shoddy shop. Dingy and dirty and about 2 stories high.\nThe Royal Exchange is a better class of building opposite the bank.\n\n \n\nWe saw the Old Bailey and spent the morning looking round.\nAt dinner time I was given an invitation to a tea party at a rich lady's flat at Kensington.\nI took a taxi for which the lady paid and got very well treated. The best of cakes etc \ncigarettes were in abundance, and 2 professional entertainers were engaged so that we \nhad a grand time. Among the guests was a lieutenant who had just won the Military \nCross and everybody of course had much pleasure\n\nof seeing how it looked on themselves.\n ","19":" I was walking along by Hyde Park when the Life Guards marched past Headed by \ntheir Drum & Fife Band playing \"The Grand Little Army\" I followed them along and \nmet the Grenadier Guards. A little Further The Irish Guards joined and several other \nregiments and the whole marched to Hyde park & lined a big square where I\nlearned the King was going to Review the Household Battalion at 10 a.m. \nAt 10 o'clock the King arrived with Queen Mary & \n\n \n\nthe Queen mother, Alexandra. The Parade came to the \"Present\" while the Band played \nthe Royal Salute, and the King was met by General French and General Lloyd. \nGeneral French is a little thick set man and has a very impulsive way of getting about. \nThe Household Batt'n (who are to leave for France) in a fortnight's time) then marched \nby in column of Companies and I was very disappointed at the poor display they gave. \nThe march past was the \"National Emblem\" and the \n\n \n\nmass band, one of 100 players. \n","20":" Wet and muddy. Went on a route march and got wet through. It appears our artillery \nhave failed and we are going to have \"Pommy Artillery\" and are leaving within the next \n10 days.\n","21":" We have been issued with new clothing throughout and are sending some to \nrelations.\n","22":" Inspections by company officers and colonel.\n","23":" Floundering about in the mud, supposed to be on a route march.\nCame home with wet feet \n\n \n\nand a bad cold.\n","24":" Miserable breakfast on bloaters. Still wet & miserable. It is the worst country \nyou could imagine for rain and cold biting winds.\n","25":" Have started on our course of Bombing.\nWe have been lectured at some length on Explosives, detonators, Fuses, Grenades etc. \nand have spent some time practising throwing It appears everybody has to go through \nthis course.\nSlow Exps. Ballastite, Schulty Powder, & Guncotton Yarn for propellant purposes \nBursts on point of least resistance (cartridges etc)\n\nHigh Explosives : -\n\nAmerol\n (generally used for grenades)\nT.N.T. Bellite Tonite Guncotton Lyddite etc. \nPlayed at opening of \"incidental's concert.\n","26":" The P & O Mail Steamer \"Arabia\" has been sunk in the Mediterranean with out \nwarning. She left Sydney Sep 30th and had on board many parcels for Xmas for troops. \nWe have just got our mail, the one previous to the one that has been sunk and the boys \nhave been expressing themselves very freely & eloquently\n\nwhen they open their letter which says that a Xmas parcel is being forwarded by the \nnext mail. One of the boys had 4 parcels coming by that boat and several 3.\n","27":" Stretcher bearers examined and complimented by Colonel McGuire the Divisional \nM.O. who declares us to be the best he has examined so far. \nHave finished our bomb throwing each throwing1 live bomb.\n","28":" Forced","29":" miles from 10.30 am. to 5 pm. There was about\n\n7 miles of troops and artillery, it being a divisional stunt. \nSome of the band enthusiasts in A Co have shamed the officers and bought us 10 tins \nof polish for our instruments so we have made them look a bit decent again.\n","30":" Went for 6 mile march in the afternoon. We are to have a march every afternoon \nnow until we go.\n","31":" I have sent mine & Wal's clothes to uncle so we can get them any time we \nshould come over on furlough from France\n","32":" We have been issued with Basil Vests lined with felt These are warmer and longer \nthan the sheep skin vests.\nWe have also been ordered to wear 2 pair of socks. This is to prevent what are called \nTrench feet.\nThe weather is bitterly bleak and playing reveille is terribly cold work. \nWe have a new major, Major Prince who comes from Brigade H'qrs staff to take the \nsecond in command in place of Major Cooke-Russell who has been sent to train \nbackward battalions.\n\nSince his advent we have had a much easier time, Major Prince being a better friend to \nthe band than C.R. Last night there was a Zep. Scare and every light in the camp was \nextinguished. We think we saw a Zep but as there is nothing in the papers regarding it, \nit is improbable.\nWe had to hand in all our surplus clothing and kit bags last night. I don't suppose we will \never see them again. \nFarewell concert in dining room at 8. Brigadier & 8 colonels present to present \nprizes won at Brigade Sports.\n","33":" First fall of snow, very light just like frozen drops of rain. Weather very cold. \nSocial evening in our hut for band members as a farewell evening also a recognition of \n\"Martha\" Jones' Birthday.\nEach man contributed 1\/- towards the provender which was laid out à la banquet \nSeveral Songs and speeches were given throughout the evening by W.O. Flynn, \nSergeant Bignall & members of the band. \nThe whole broke up at 10 o'clock after spending a very enjoyable evening.\n\nThe success of the evening was due to the efforts of Bandsmen McDonald & \nPhillips to whom we would like to express our sincere thanks.\n","34":" Had an altercation with a horse who spitefully kicked me in the knee making me \nfeel very un(knee)sy.\n","35":" Woke up and found the ground covered with snow which made me think of Father \nChristmas, about 4 inches deep. \nMade a snow kangaroo and had several snow fights It is all right on pictures but in \nreality ----\n\nColonel Simpson gave an address to the massed troops on the eve of our departure.\n","36":" Have been issued with Gas helmets, 2 Blankets, Tear Shell goggles, and bullet \nproof steel helmets.\n","37":" Parade with Marching order, Equipment with pack, 2 blankets, 150 rds ball, and \nrifle. Makes one feel like a packhorse. This is our last night. \nA 6 guinea pair of cymbals and several new marches including \"The great little Army\" \n\"Colonel Bogey\", and Blighty have been bought.\n","38":" At 5 am the Battalion\n\nleft Larkhill Camp and marched to Amesbury in the dark, through mud up to our ankles \nwith full pack, blankets, 150 rounds of ammunition and rifle, the whole weighing nearly \n120 lbs. We only had 2 spells of 2 or 3 minutes each so were pretty well done up when \nwe got to the station. The train left at 10 to 8 and arrived at Southampton at 10.20, the \nlatter part of the journey being by the sea. We rested in the station shed for the \nremainder of the day At the wharf beside the sheds lay the African Princess\n\nwhich took the Canadian troops across, and the \"Asturias\", a big P & O boat, which \nwhen she came to Sydney was the biggest that ever came through Sydney Heads. She \nwas top-heavy and had to have one deck removed. She is now utilised as a Hospital \nShip and is to leave for East Africa. \nOur transport was a 5000 ton boat the \"Caesarea\" and on her the battalion sailed for \nFrance at 6 p.m. \nOut in the bay we could see the lights of the mammoth liner \"Aquitania\" one of the \nlargest, in fact the\n\nsecond largest vessel afloat. On the transport, no lights were shown and looking \nthrough the canvas we could see an avenue of lights and searchlights of battleships on \neach side. At 4 a.m. we pulled in to the wharf at Havre. On the other side of the wharf \nwas a large hospital for french wounded. \nOn the wharf and at various places round the harbour are very high iron stands on the \ntop of which are very strong lights which throw a large circle of light. \n","39":" We played a few marches which were appreciated by the inmates of the hospital. \nAt 7 o'clock we took off our packs which were placed on the transport and we played the \ntroops to a rest camp 7 miles from the wharf. \nHavre is a large seaport where there is a tremendous amount of shipping.\nWe did not get a very emphatic reception but rather a respectful and quiet welcome that \nwas more heartfelt than expressed.\n\nThis is accounted for by the fact that every day 8 transports leave every day from like \nSouthampton to Havre and it stands to reason that enthusiasm however sincere could \nnot be shown through all times. \nWe saw some captured guns pass us on a train covered with mud.\nThe houses in Havre are of very curious designs in the construction of Brickwork and tall \ngables. \nWe passed the Casino which is used as a hospital for wounded and the Bourse in front \nof which is a market where a great number\n\nof bales of wool were stacked. \nThe French people are very obliging and polite. They speak English, a good many of \nthem and expressed great interest in us. \nThe Street lavatories here would never be tolerated in an English speaking country as \nthey are open and except for a 3 foot iron screen is open for public scrutiny. \nAfter a spell in the rest camp, We entrained in horse trucks, 30 in each truck en route for \nthe front. We past through Yvetot and several Pastoral\n\ndistricts where the growing of Silver beet and dairying seemed the predominating \nIndustry. \nThe first part of the trip was through hilly country and we passed through many very long \ntunnels. The next town of importance was Rouen, in Normandy, the Birthplace of \nWilliam the Conqueror. \nSeveral Manufacturing towns we saw next and at every crossroad along the line were \nblue uniformed French sentries on guard. Instead of the Mileage system of measuring \nthe metric system is used here\n\nand along side the line the distance from Paris or other big centres is denoted on posts \nin Kilometres, 1","40":" of which make 1 mile. \nWe skirted Paris in the night but the night was too dark to discern anything. \nEtaples & Boulogne we next past through, and several large camps and in one \ntown saw a monument about 150 high. We saw a lot of grouse, crows, magpies, etc \nalong the line. \nThat night I will never forget. Huddled up in\n\nthe compartment, only fit for horses, which in fact it was built for, and which at the most \nshould only have held 16, the 28 of us settled down to rest. \nOne had to suit his figure to the accommodation, which was in some cases, round, \nsquare, or some other shape which science has sought in vain for a name for. \nWith an entrenching tool in the small of your back, your comrades foot in your eye, and \nperhaps your head dangling over into space we vainly tried\n\nto go to sleep, but could we? Well, hardly.\nAll through that night the monotonous rattle of the wheels, as she slowly crawled and \nthen stop suddenly and then a little further etc. till we yearned for morning. \nAt last it came but with it as usual did not come breakfast in fact it was 3 o'clock before \nwe were supplied with our days rations - iron rations – 5 biscuits and a tin of bully. \nNext day we past through Calais. It has several canals or water streets on which were \nmany\n\nbarges and gondolas. We also saw some old windmills that looked as if they had \nstepped out of a story book. \nAlso in every village there is a church and every church seems the same design, in fact \nalmost a replica of the last.\nThe last big town we passed was St Omer and a few miles further on we arrived at our \ndestination Balieul which is on the border of France & Belgium. We are only a few \nmiles from Ypres & Armentieres. A number of\n\nlorries were provided to transport our kits and we moved off in the dark to our billets \nabout 5 miles further on.\nWe could hear the distant booming of the guns and see the flashes of the light bombs as \nthey lit up the sky momentarily and also the faint glare reflected from the field of action.\nTired and weary after 30 hours travelling we plodded on in expectation of a comfortable \nbillet but our guide lost his way and we were lost to the world for a couple of\n\nhours. Our feelings were such as could not be expressed in words although some of the \nboys did their best and if the guide suffered a quarter he was condemned to, then -------- \nAt last we found our way to our billets which were in farm houses, and our next trouble \nwas our kits which we found at last dumped in the mud and we had to find them in the \ndark. However we got them, and I was walking out into what looked like a road but \nproved to be a river and I had a ducking &\n\ngot back to my billet to try and sleep till morning.\n","41":" Were awakened and told to get up & shave which I need hardly say \nwe needed and washed in a river covered with green weed. \nOver here there seems to be a reversal to some of the English customs for instance, \nVehicles have to keep to the \nright\n of the road (and they shake hands with the \nleft hand) wrong)\nWe always carry our gasbags, as gas could easily carry over to where we are billeted \nwith a \n\nfavourable wind. 15 mls hour\nPlayed programme for Officer's Mess.\nSaw a German aeroplane bombarded. 30 shells were fired while the plane was in sight \nand it is rumoured that she was brought down. Another aeroplane was seen brought \ndown, by several of the boys. Went up to the town of Merres, the nearest town and \nwent over a convent that was bombarded by Germans","42":" It is said they spent \nthe night sleeping & drinking there and in the morning bombarded it. \nIn the walls of the interior\n\nare marks of what appears to be bullets etc. from a shrapnel shell.\n","43":" Another fleet of German Aeroplanes of about 8 Bombarded, 1 of which was \nbrought down\n","44":" New gas helmets issued (Box Respirator) use explained and practiced \nmanipulation. Also tested for 5 minutes in room of tear shell gas.\n","45":" Left Merres in Motor transports 24 to a transport for Armentieres at 10 a.m. Arrived \nat Armentieres and billeted in a clothing factory at noon. It is an immense factory and \nwe spent considerable\n\ntime looking over the looms etc.\nArmentieres is a large town and is practically deserted except for a few estaminets or \ncafes. Nearly all the churches are blown to bits and along the street the rows of \nhandsome buildings and shops are speckled with shrapnel bullets and here and there a \nshell has dropped on a roof leaving a gaping hole and shattering the roofs. Hardly an \nunbroken window is left in place except in cases where they have been repaired, and \nbusiness is proceeded with.\n\nIt looks gruesome to see this fine city with tramlines running through the streets \n\nyet\n silent, deadly silent, yet bearing all the appearances of a triumph of \ncivilisation, and then we come to a corner and see a mass of wreckage where had stood \nsome stately building and we understand, \"It is War – War\".\n","46":" According to accounts by tommies the position on the Western front is one of \nStalemate\nThe German, \"Fritz as he is dubbed, never sends gas over unless we do first, nor rifle \nfire except as retaliation. We will never be able to proceed any further because if we\n\ntake a trench, as has happened before now, Fritz opens the floodgates and floods the \ntrenches drowning the occupants, or mowing them down with machine guns if they \nattempt to escape So the result is \"Stalemate\".\nJust near us is a stone with an arrow pointing to a line in the centre of it which shows the \nfrontier or Borderline between France & Belgium.\n\nThis Battalion ought to be called \"The Blunder Battalion\" as no sooner were we settled \ndown in our Billets than they find out we are in wrong billets so we had to pack\n\nand clear out to another factory ½ a mile distant.\n","47":" Received a very large mail of letters & parcels just now, and as we all are \nbroke with scarcely a cigarette, it came at an opportune moment.\nOur rations now are very bad or rather scanty, for we have not had a decent feed since \nwe left Larkhill.\nOne great relief to us is we do not have to wash our clothes now, as, coming out of the \nfiring line we are sent back to the baths where we have a hot bath and a change of \nclothes supplied.\n","48":" Paid this morning\n\nin French money.\nBritish money is worth 16 2\/3% more than French, that is £1 in British money is \nworth £1-3-4 or its equivalent here.\nThere are canteens here for British troops where all goods are sold under British \nwholesale price. The reason for this is that by the courtesy of the French Government \nall goods for the troops here are allowed into the country duty free, consequently they \nare able to supply goods at a greatly reduced rate.\nIn the Y.M.C.A. is a very good piece of philosophy\n\nthat I thought worthy of commandeering:-\n\n\"Either you are wayback outside the danger zone\nIn which case you needn't worry, \nOr you are in the danger zone. \nYou are in a safe place or you are not \nIf you are you needn't worry \nIf not you either get wounded or not \nIf you aren't wounded you needn't worry \nIf you are it's either dangerous or slight \nIf its slight you needn't worry \nIf its dangerous you either get well or die \nIf you get well you needn't worry \nIf you die you can't worry \n","49":" why worry at all\n","50":" 4","51":" We are in the trenches. The march down we passed rows of houses with \nthe contents turned upside down evidently the work of Germans, who according to all \naccounts did a lot of pillaging.\nSome of the houses look as if the rats had been at them. \nWe are supplied with Gumboots and whale oil to rub our feet with to prevent trench feet. \nWe, the stretcher bearers are told off 4 to each company and are allotted 2 dugouts in \nwhich we can stay until the call for SB's comes. We are right up in the front line \nimmediately\n\nin the rear of the front firing bays. We walk about as we like, anywhere we like for over \nhere SB's are respected far more than camp.\nIn the night we hear the whistle of the big shells as they pass over our heads and the \nwhip like crack of our own and German snipers, and the rattle of machine guns like a \nmotor bike. \nThe first night in we had 2 gas alarms when we had to wear our helmets but no gas \ncame. They cannot very well send gas as their trench\n\nis in the shape of a horseshoe round us and the wind would carry the gas over to their \nown trenches on the opposite side.\nYesterday we bombarded the German trenches for ½ an hour all troops being withdrawn \nto the communication trench. A deal of damage was done to his trenches. His reply \nwas not very heavy as a lot of his men are withdrawn to the Somme and he cannot have \na great deal of ammunition. \nHowever one of his Minniwerfers killed 2 and injured 3.\n\nYou can always see a minniwerfer shell coming. It weighs 100lbs and looks like a cigar \nin the air. The trench mortars you can also see coming & they look like an apple on \na stick.\nThe trenches here have to be built up with sand bags as the ground is very watery and \nany depth below 4? fills to that level with water. The trenches are all planked so that \nafter all it is pretty comfy. The 2 dugouts next to ours have been blown in by a shell, but \nbefore we came\n\nin.\nWe have not had a real case yet, but then we have only been in 48 hours. \nThe most risk we have run so far is of enemy snipers when we are passing in a trench \nwhere the parapet has been shot away. Several bullets have come pretty close and \nthey whizy round our dugout but that is all so far\n","52":" Each day we have put up a bombardment of the enemy lines but in most cases the \nenemy have not retaliated. In the morning Fritz comes over the top to mend his \nparapets.\n\nWe do not fire at him but put up a working party to repair our own and the one who \nfinishes first has first shot and then there is a scatter to get back \n","53":" A black day for us. Two of our band mates, stretcher bearers for \"B\" Co, \nGeo (Dodger) Reading and Ted McLaughlin have been killed, the second day in the \ntrenches and C. Mickkleson (Snowy) badly crushed\n\nIt was after a bombardment and Fritz had sent over very few shells so the \n\nboys thinking it was all over went back to their dugouts. They, however fired one more \nMinnie which fell near their dugout causing it to fall in on them. \nThe two bodies were not recovered for 5 or 6 hours later We can hardly realise that we \nshall never see our 2 mates again.\n","54":" Another death in our company Sergeant Low was killed by mistake by our own \nbullets. He was in charge of a patrol and came crawling back to \"B\" Co's parapets and \nthe man on guard, thinking him a Ger-\n\nman fired, killing him. The whole thing was a muddle and sadly mismanaged.\n\n9th Sat. Made a small stretcher which is much more use to us in these narrow trenches. \nSupplied with waterproof capes. More \"Strafe\" as we call a bombardment. \nOn our right are Dublin Fusiliers, New Zealanders, Scots Guards & French troops. \nOur dug out now is a circular recess which was used by the Germans for machine guns. \nIt is 3? off\n\nthe floor and has 3 apertures for fire. \nThese trenches were originally German but were captured from them. \nTucker in the trenches is not so bad. It is brought to us and the menu is as follows.\n\n7.30 am Bacon & Tea\n\n11 am Pea soup & Dry rations (Bread, B,Beef, cheese & Jam)\n\n1 pm Stew\n\n3 pm Tea\n","55":" pm Tea or cocoa\n","56":" We seem to have the upper hand here as all along the lines has been a continuous \n& heavy bombardment the whole of the day.\n\nThe dugout we occupied up to the night before last has been hit by a Minnie and no dug \nout can be seen, in fact nothing but a hole about 20 ft across and 12 ft deep. Our SB \nsquad was called out and we picked up one man -- But I will describe no more \nawful casualties, it would only make my diary a horror instead of an interesting book \nHowever, I thought my first sight of death would horrify me, but we take it as part of our \nwork, and the scene of action, the whirring of the flying shells and shrapnel, chase all \nthoughts of the gruesomeness of our task\n\naway, even to the searching of the body for identity discs, paybook, and personal \neffects. \nWe spend a considerable amount of time telling one another of the narrow escapes we \nhave had during the day \"Old man\" had one to-day & was within an ace of being \nblown up.\nThe Germans method of making barbed wire entanglements is to strew the ground with \nthe barbed wire and throw hand grenades in amongst it repairing any breaks at night \ntime. \nThere is a sniper post not far from us from which a machine gun is used with\n\nsuch effect as to earn him the name of Parapet Joe. The grouping of his shots are so \npeculiar and rhythmical that the boys say that he can play any of our marches on it.\n","57":" In billets again after a week in the trenches. Relieved by the 34th Batt.\nWent to see our boy's graves at Cite Bonjean cemetry Armentieres. Batt'n Pioneers \nmaking crosses & frames. \nDogs are used here in many ways even to such an extent as to appear to us cruel. \nThey are tied up under handcarts and the man\n\nonly uses the shafts for steering purposes. A 1 dog power contraption for churning \nbutter. \nThe dog must keep working or the nails will stick in him.\n","58":" Back to the trenches again. Evidence of the great care which must be taken to \navoid accidents in the night is instanced in the death's of Sgt's Low & Finch & \nPte Jerrard etc. Sgt's Lows end has already been detailed. Sgt Finch was called upon \nby a sentry to halt 3 times. Thinking it best to remain silent he advanced and either did \nnot give the password\n\nor gave it in an undertone too low for the sentry to hear anyway he was shot through the \nhead. In the case of Pte Jerrard one of his mates was throwing a grenade when his \nhand catching in his overcoat caused him to drop it at his feet. It exploded, a piece \nhitting Pte Gerrard in the neck. He succumbed a few hours later.\nFrench soil, being cultivated is full of tetanus germs which cause lockjaw. One of our \ncompany men was standing near where a rifle Grenade landed and received 7 flesh \nwounds in various parts of his body.\n\nWe bandaged his wounds, he was taken to the Hospital but the next morning we heard \nthat he died from tetanus.\nSergeant Widdy of ‘C' Co has the honor of being the first of the","59":" Division here to \ndistinguish himself. For taking hazardous risks to ascertain the whereabouts of a \nGerman Trench Mortar he was awarded the military medal the ribbon of which the \nColonel pinned to his coat yesterday \nOn the last day of our stay in the trenches a german minnie landed on one of our trench \nmortars and exploded nearly 100 detonated shells killing Lieutenant Walsh\n\nand 4 others. They were terribly mangled and we -- But that is our work.\n","60":" On the","61":" we were relieved by the 42nd Batt while we billeted again at \nArmentieres\nI have not said anything about waking up and finding the rats trying on our gas masks, \nand the cats going about in herds for safety.\n","62":" We got a parcel each from the comforts fund of cigs, Lollies Tinned \nFruits etc. and also Had a plentiful supply of Pudding and ‘am. \nWe got our instruments\n\nout of pawn – I mean store and played a programme in billets for the men.\n","63":" S.B. Squads went out with their companies, they to clean bricks to make gun \nemplacements, and the SB's ostensibly to repillage the already pillaged houses, but \nreally in case of accidents.\nWe found plenty of beautiful vases and statuettes of Christ, crucifixes etc. but, having no \nmeans of getting them away reluctantly had to leave them there. \nIn nearly every house we found Encyclopaedias worth £ 2 to £ 3, \nGeography books, and others dealing with their religion (RC)\n\nThis at first makes one thing the people intelligent but on looking at the new and \napparently unopened state of the books (except the religious species) makes one revert \nto the idea of simple ignorance of the French peasantry. They must however be very \nsincere in their faith judging by the pictures on the walls of every room.\nOn one side of the Bridge by where we were working (?) was France and on the other \nBelgium so that we have been in Belgium. \nThe people in Armentieres must love Bread & Butter,\n\nFried eggs & chips & coffee as this is practically the only meal that can be \nobtained here.\nWe play a programme every afternoon now in billets at 2.30. \n","64":" Concert in billets which was very decent. One joke I think worthy of recording: - \n(A Chemist left a new assistant in charge of his shop with instructions to do his best for \nany patients that might come along, and on his return asked how he got on. He Said \"I \nonly had one patient, old Mrs Jones with a bad cough. \"What did you give her ??. \n\"2 packets of Salts\". The chemist was surprised &\n\nsaid \"Salts was no good for a cough. He Replied, \"Mrs Jones little girl just came along \nand I asked her how Mrs Jones cough was. She said \"She is afraid to cough\".\nA new definition of a soldier is : - \"A thing for holding beer\"\n\nJan 4th This front is said to be a very quiet front yet a couple of nights ago we withdrew \nour men (39th) from the front line trenches during a \"strafe\" and a german raiding party \ntook possession and surprised our men returning killing 7 and wounding\n\nWashing Under Difficulties !\n\nSY","65":"\n","66":" We managed to get 8 germans that is known of. (‘We' does not in this instance \nmean our battalion but another battalion on what will be our front next spell in)\n","67":" The Germans planted a German flag out in No Man's Land. The next day our \ntroops were continually firing at it but failed to bring it down That night a patrol went out \nto bring it in but not one of them came back, the flag being surrounded by wire bomb \ntraps. What eventually came to the flag our C.S.M.\n\nwho told us the news, does not know.\n","68":" Another Ruse of the Germans. We sent a patrol out into No Man's Land and \nthe Germans sent up one of our Artillery Rockets, or a clever imitation. Our Artillery \nopened fire killing 1 and wounding 4 of our patrol.\n","69":" My Birthday. We went into the trenches again on a new section, at Houplines. \nI went up to the front lines and found our new dug-out, then went back to the Subsidiary \nLine for our stretchers and \n\nequipment. Frank (my mate) suggested going up Cambridge Avenue as a short route to \nthe front lines. The trenches have been cut up something terrible by fritz's shells and \nthe duck boards which line the bottom of the trench, where they are not blown up \naltogether they are covered with 12 inches of muddy yellow water completely hiding the \nduckboards so at times you would be walking along & tread into a part where the \nduckboards\n\nhave been blown up and go down into the water up to your middle. Lord knows how we \nwere going to carry wounded out, I didn't. However we went along this short cut to the \nfront lines and we knew \"B\" Co's sector was somewhere over to the left so we made in \nthat direction. Being unfamiliar with the trenches though we got lost and found \nourselves in front of one of our own trench mortars. We knew it was just behind us for it \nwas\n\nsending shells over our heads but exactly where it lay we didn't know.\nThe Germans had been sending over a lot of shells during the morning and as they \nalways make a target of where they think a trench mortar is placed, so they started to \nland them round this trench mortar. Minnies, shrapnel, and shells from Howitzers burst \nall round us. It was hell. We couldn't get out because the way we came in was blown\n\nup and to continue on we would have been wading through 4 ft of water just where we \nwere but further on it was probably over our heads so we just had to stop there.\nPresently a big shell burst a few yards away and splashed us over with mud.\nThe next was a bit further away but the third sounded as if it was making straight for me \nI crouched down behind the bank and bang !! it exploded about 5 yards behind me and\n\nI thought I had been hit by a football. A Party of men came along by a trench we had \noverlooked and showed us a way out. I staggered out of the trenches for I wouldn't let \nmy mates carry me and after about a quarter of an hour came to the \nRegimental Aid \nPost\n. After that I travelled from Hospital to Hospital in Motor Ambulances.\nThe next was the \nAdvanced Dressing Station\n where they\n\ngave me some cocoa and inoculated me with A.T.S. (Anti Tetanus Serum) Half an hour \nlater I was taken to the \n10th Brig. Field Hos\n Where they put a label on me and \nsent me on to the ","70":" Casualty Clearing Station\n near Steenwerck. Here they \nKept me 3 days, operated and took a piece of shell out of my back just clear of the \nspine. \nI am keeping the lump as a souvenir, but a couple of inches to the left and\n\nI would have been the Souvenir.\n","71":" Was taken by train to Boulogne on the French coast and by Motor Amb. to \nWimeraux 2½ miles out of Boulogne to \nWimeraux No 8 Hosp\n the nurses are \nvery good to the patients especially the Australian Nurses. Two days after I learnt I was \nfor blighty so at 8 o'clock in the morning I was put on board the Hospital Ship \"Brighton\" \nwhich sailed at 10.30 and at 1 o'clock\n\nwas on board a train at Dover. From Dover we left for Brighton Passing through \nCanterbury, Gillingham & alongside the Medway till at 2 o'clock in the morning I \nfound myself in a comfortable bed at \n\"Kitchener's No 3 Aus Hosp\n Brighton\n","72":" I cannot sit up or lie on my back but am feeling O.K. Have had another A.T.S. \ninoc which makes 3.\nFed very well but will be glad when I can get up.\n","73":" Wound healing very well. Am up and about now. Yesterday I had leave to go \ndown to Brighton from 2 to 4 pm. Brighton is a big place, and along the beach there are \nscores of big residences lining the promenade. There is an electric railway along the \nbeach the only one of its kind in England. The main feature is the pier which is ¼ mile \nlong and on the end of the pier is a beautiful theatre of the best class I have seen, better \nin fact than any I have seen in\n\nLondon. The pier must look beautiful in peace time for it is covered with electric lights. \nSlots machines and games abound in profusion all over the pier. There is also another \nTheatre & tea rooms where a first class programme is rendered by the Pier \nOrchestra. These are gratis to wounded soldiers. Opposite the pier is a large \nunderground aquarium where the piscatorial displays are very interesting and \neducational. There is a concert in the hospital every other night\n\nThere is a very curious looking place of eastern design which used to be use by royalty \nbut which is now used as a hospital for Indians. Going from this hospital a patient either \ngoes to an auxiliary Hospital (where there are only about 20 patients at a time & a \nnurse to nearly every patient) or he goes to a convalescent Hospital (A.C,H.)\nThe Somme is a veritable death-trap according to accounts and a man who has been \nthere is extremely lucky if\n\nhe ever gets out. Starvation diet, no trenches or cover, nothing but shell holes filled with \nwater and mud waist deep. Ration parties cannot bring tucker, stretcher bearers cannot \nbring men out so the ones who get wounded and cannot help themselves just die, in fact \neverywhere is strewed with corpses.\nI am to go before the Colonel for a A.C.H. but expect I won't get away for a week.\nThe day after I was hit, Our Colonel, Adjutant\n\nand one of our band boys were killed.\n","74":" We have been shifted to York Place Hospital which is a Tommies Hospital and \nseems to be far better managed than Kitcheners Australian Hospital. There are 3 \nbilliard tables, bagatelle, phonographs, a fine library and scores of minor games.\nLeave is granted from 2 to 5 pm. but unfortunately for us we cannot get an issue of hat, \ncoat & boots, so have to stay in.\n\nThere is a concert 2 nights a week.\nIt is a pitiful sight to see the men with an arm or leg off playing billiards. Yet the way they \nget about is wonderful.\n","75":" We have a deaf old civvy doctor who goes about with an ear-trumpet and 2 sisters \nOne a Canadian and the other Irish. They are good sorts and treat us top-hole. We are \nsuppose to get","76":" a week while in hospital but divil a bit have we got yet. So we are in \na\n\nstate of perpetual pecuniary embarassment. The only thing is we have no stamps and \ntherefore have to curtail our correspondence temporarily.\n","77":" Our leave has been extended to 5.30 and we go out every day now we have \nour clothes. Today I went down to the theatre on palace Pier and saw a very interesting \nplay called \"Sappho\" from Daudets book. The acting was not too good but it was an \nagreeable change to us.\n\nrecollection brings back to mind a young chap who funked going over the top he said to \nthe officer \"I really haven't got the heart\" The officer coolly pulled out his revolver and \nspeaking in a careless, easy manner \nSaid\n pulling out his watch said \"There \nis 30 seconds between you and the bullet in this revolver. Over there you have a \nchance here you have none\" He went.\n","78":" Have just received word from my uncle that my letter to my\n\ngrandfather came a week too late as he died 3 weeks ago. He went very fast the last \nweek or two. His hearing went, his sight went and his voice was so low as to be almost \nindistinguishable. Then came the end.\nUncle was very thoughtful. He put a wreath on the coffin labelled \"from James & \nfamily Australia\".\nEngland bids fair to become almost in the grip of a famine. Potatoes are a great luxury, \nSugar is not\n\npurchasable without buying tea. There is talk of issuing tickets allowing ¾ lb of sugar \nper person per week\n","79":" A very good idea to do without war has been put forward. Teams are to be \npicked from the nations and place on each side of a river and the ones who catch the \nmost fish win. This would save a lot of bloodshed. \nI went to a Clara Butt Concert to-day. There were several artists at the highest pinnacle \nof\n\ntheir art while Clara Butt herself is absolutely beyond the wildest attempts of this pencil \nto describe. \nLights go out at 8 pm. in hospital consequently we have much fun after \"lights out\". \nRaiding parties to pull other wardmates from other wards out of bed etc. Last night they \ntied a button on a cotton and arranged another piece so they could keep tapping the \nglass partition. We retaliated with an electric torch giving them lighting affects so we\n\ncould keep them awake\n","80":" You cannot buy sugar without tea now and it is said that shortly you won't be \nable to by a pound of meat without a grand piano.\n","81":" Just a memory of Brighton. Intro. of \"Sappho\"\n","82":" Transferred to No 1 Aus Aux Hospital Harefield Park. Taken from York Place Hosp \nto Brighton\n\nstation in A.M.C. Motor Transports, and entrained to Denham per Victoria & \nPaddington. Arrived at Denham 12.6 and as usual in the Australian Military, no \nTransports were there to meet us so we had a 2½ miles cross country walk Through \nlanes line with hedges we went and reached the hospital where we had a medical \nexamination, changed back into hospital blues, had a feed and were placed into Military \nHuts. After leaving York Place this seems a real wilderness. It is very cold here and\n\none minute the sun will be shining and the next it will be snowing. The food is very \ngood, eggs for tea at 4d each seems an extravagance but we have them. There is a \nband there but according to the advertised programme it is only a 4th rate band.\nIt is said that after the war, it will only take 1 transport to take the Australians back, 2 to \ntake back the identification discs and 6 to take back the crime sheets.\nThe orderlies here are being transferred to form\n\nA.M.C. detail for the","83":" Aus Division which is being formed in England.\n","84":" What struck me as very funny was when a chap was issued a pair of boots one a 7, \nthe other a nine. He took them back and complained and the Q.M. replied \"2 boots are \na pair in the army\". He of course got them changed but the funny side of the situation \nstruck me. \nHarefield house is a big, three-story, square house, covered with ivy\n\nover the greater part and appears to have had a moat round it in days gone by, which is \nrepresented now by the inside wall only. There is a statue dated 1742 in the garden of \none of the old inhabitants\nAny sign over about 150 years old is written in the style in vogue up to that period of \nsubstituting F's for S's. \nWe went for a walk to Rickmansworth a fair sized village 2½ miles distance, had a look \nat a Church called St Mary's of the early 17's\n\nWatford is 3½ miles further on and I am sure I have relations there of some sort, but I \nhave forgotten names and particulars. \nColonel Haywood is Commandant, Colonel Ryan being supervisor of the various Aus \nHosp. \nThere was a Cinema entertainment (The screen being about 7 x 6) during which the \nbrothers (2) Montmomery were decorated with the M.M's.","85":" Batt\n","86":" There is an old church ½ a mile from Harefield Park House (which I have since\n\nfound out dates back to 1160, and was in the possession of the Countess of Derby, who \nwas a patron of Milton and a favourite of Queen Elizabeth) In the church is a statue of \nthe Countess of Derby the feet of which almost touch the altar. This shows the great \nrespect they must have had for the Countess. \nIn the Churchyard 16 or so Australians have been buried who have died at the hospital. \nI have been playing in the band here. It is about a","87":" rater. 30\n\npatients were wanted to go on the staff as orderlies in place of those drafted out and I \nhad a chance of a good job, being a bandsman but, not for me.\n","88":" At 10.30 a.m. we left Harefield Hospital to go on 14 days furlough and arrived at \nour Military Headquarters at noon. I got my pass & free railway warrant to Glasgow \nafter waiting about for 2½ hours while they were making out the books. We then went to \nthe Pay Office and drew\n\nwhat money was in our books and received an extra ration allowance of 24\/6 i.e. 1\/9 a \nday. I left Paddington Station at 11.30 p.m. for Glasgow. \nIt is an 8 hour run in peace time but it took us 11 hours. The train was travelling 70 \nmiles an hour in places and the rail-road is the Smoothest I have ever been on. The \nweather is extraordinary for an English April. Nothing but snow. However romantic the \npoems on April Showers may sound, if these\n\nare the type I don't want anything to do with them.\n","89":" We got to Glasgow at 10 o'clock in the morning and I started out and found a \nY.M.C.A. to make my headquarters.\nIt is said that on the borders of Scotland sheep stealing still goes on as in days of old. \nI must say a word about the Scotch accent. I travelled up with a Scotchman who spoke ","90":" broad that I don't know now whether I said \"Yes\" & \n\n\"No\" in the right places. He finally gave me up as bad job. Such words as Loch Balloch, \nEccelfechen etc. No one only Scotchmen can pronounce and I think they must shove \ntheir tongues down their throats to say them. \nGlasgow is a commercial town and has one tube which runs round the City. \nThe University, Infirmary & Cathedral are fine places but the most notable of all \ntheir buildings is\n\ntheir Art Galleries.\nThey have a great Collection of Reynolds pictures, but it was not the pictures which \ndrew my attention but the sculptures. There is one called \"Grief\" and another \n\"Motherless\" which are simply wonderful.\nThe buildings are practically all made of red stone which looks wonderfully well\n","91":" Then I decided on a trip to Loch Lomand I got a Dalmuir Car and Changed and got \none for Balloch\n\nBalloch is on the shores of Loch Lomond. The trip takes 2½ hours and is right along the \nRiver Clyde all the way. There are a lot of Ship building yards where among other ships \nin building is a light Cruiser to do 45 miles an hour. \nI got out to Balloch about dinner-time and strolled through Loch Lomond Park and \npassed Balloch Castle, an old place in a very good state of repair, and stood on a hill. \nLoch Lomond\n\nlay at my feet and on the other side of the Loch is Ben Lomond its snow capped \nsummits show up beautifully in contrast to the blue waters of the Loch. Around the Loch \nare several castles. The sight was glorious especially as at that moment (for a wonder) \nthe sun was shining. I had dinner and then left for Glasgow.\n","92":" I then left for Edinburgh and got there at 12 o'clock. Now Edinborough is a beautiful \nand picturesque\n\ntown. There a lots of Castles and historical buildings but more of that later. The main \nStreet is Princes St. and there is a very tall monument right against the station. \nNow Glasgow & Edinburgh, like Sydney & Melbourne are at daggers drawn. \nGlasgow a trifle the larger is a commercial town and Edinburgh though more beautiful \n& historical is \"poor & proud\" \nWell when people go from Glasgow to Edin-\n\nborough, they tell them to be sure & see \"Edinburgh Disgrace\". This is the story: - \n\"On a hill Edinburgh decided to build a palace. They put up 100 pillars of stone at a cost \nof £ 1000 each and a row of stone to hold them together, and found they had not \nenough money to go on with it. To put the finishing touch on it Glasgow offered to lend \nthe money which was indignantly refused. So now the Glasgow people tell tourists not\n\nto miss seeing \"Edinburgh Disgrace\"\nEdinburgh Castle the most historical castle in Scotland, the home of Mary Queen of \nScots and many other old Scottish Kings. It is now partly used as a barracks. \nIt stands in an impregnable position on a hill 400 feet high and approached only by a \nroad on the East side which is called High St. Excepting for this road\n\nover the parapets of the castle is a straight drop of 400 ft to the ground or rather the \ntown below.\nThe Castle has only been taken once and that by strategy. Charles Randolph with 31 \nmen climbed up this hillside, (though heaven alone knows how they did it) surprised the \nguard and took possession.\nBy the road entrance to get to the castle proper you have to go through 7 very massive \ngates. This\n\nwill give an idea as to the strength of it. Round it is a dry ditch and there appears to be a \ndrawbridge.\nMary Queen of Scots bedroom is hardly big enough to swing a cat in and the wooden \nchair she used to sit in is the awkwardest and most uncomfortable looking chair you \ncould see.\nIn the wall during repairs an oak coffin 18? long with a baby's\n\nremains was found which if it had lived may have been a king The Coffin was replaced \nand built back in the wall by orders of the Brig. Gen'l in charge of Castle 1850.\nFrom the highest lookout the Panorama of the town below is a wonderfully interesting \n& beautiful sight.\nThere is one little chapel that the more modern people used as a powder magazine \nwhen Queen Victoria was indignant and\n\nrebuilt at her own cost. She put a coloured window in with her arms on and the words \n\"in gratia\" & \"Neglectia\" which will be a record for all time of the Scotsmen of that \nperiod.\nThere is an old gun called \"Mons Meg\" which fires 22 inch granite Balls and was used \nfor battering down walls. This was being taken to the Tower of London when through Sir \nWalter Scot's intervention\n\nit was retained at Edinborough Castle We then left the Castle and went down High St \nand came to St Giles Cathedral. The a main feature of this Cathedral is the Chapel with \nthe Orders (like carved wooden towers) of the Thistle, Pretty well all the Knights of the \nThistle were connected with royalty and several seats set apart for the Kings are shown \nin Post Card.\nNext we saw the House where John Knox\n\nwas born and later where Mary Queen of Scots goldsmith lived. Next I went to Holyrood \nPalace and Saw the portrait gallery of the Old Scottish Kings some of whom did and \nsome of whom did not exist. Nevertheless the light effect showed up the portraits \nwonderfully, and one could not help admiring the display. Next we went into Queen \nMary & Lord Darnleys supper & bed rooms and here again their smallness \nsurprised\n","93":" In Mary's Supper room, Rizzio was murdered and on the top of the stairs where \nonce was a stain of blood is now a brass plate to mark the spot. The guide will explain \neverything fully so there is no need to enter into detail here.\nWe then went up on to Calton Hill where a monument of Nelson stands, and which has \na spiral staircase leading to the top from which we were able to secure a fine view of the \ntown.\nThe other feature of\n\nEdinburgh is the Forth Bridge, the largest in the world.\nIt is 10 miles from town and a big motor runs to it, at a cost of 1\/6J return.\nThis is an amusing experience I had in \nGlasgow\n Edinburgh \nI had an address given to me of a lady who would be pleased to show me round. She \nwas a nurse & resided at the Westhouse Morningside. That is all I knew. Well I \ngot to Morningside and asked a kiddie where the West-\n\nhouse was. He said \"You want the asylum\" This nearly paralysed me as even if I did I \ndid not appreciate his saying so. So I said \"Who are you getting at you little devil\" \nAnyway a policeman directed me to it and I came to the lodge gates and found it really \nwas an asylum. \nI was directed to a certain door, but somehow I bungled my instructions and knocked at \nthe wrong door. Some body was walking to the door and I kept\n\nknocking and just as I thought he, she or it, was going to open the door it walked away \nagain. It was most uncanny especially as the curtain was pulled aside and I saw a face \nand --- well I went back to the lodge and got redirected. \nI went to a fine Scotch dance among the Aristocracy at the Grand Hotel and had a great \ntime. \nNext day I came back to London and from Paddington Stat. I went to Oxford.\n\nI had an invitation for Easter with a gentleman at Oxford and on arriving there found it \nwas an Anglican C of E. Monastery. We stayed 2 days as guests but as no talking or \nsmoking was allowed in the house and you had to walk on tip toe & whisper. I soon \ngot full of this and I determined to get back to St Paul's for the Easter Day Service \nThey took us round about Oxford to see the colleges and instead\n\nas I expected to see one large University it consists of 24 Colleges scattered all over the \ntown.\nWe saw St. Magdalens Christchurch and all Souls etc. Most of these were built by \nWolsey. We also had a look at the Thames and its tributaries where rowing takes place.\nIt is a lovely place. Each College has an elaborate houseboat to which the boats are \nmoored while the men change.\n\nBeing lent no meat is eaten at the monastery so as I did not care for macaroni stuff I \nwas not sorry to get away. \nThey gave me a letter to the Lord Bishop of London and after the service at St Pauls we \nwent up into St Pauls vestry and were blessed. (I hope it does me some good)\n","94":" Being Easter Monday or what it is better known here as Bank Holiday I thought I \nwould take a trip out to \"Appy\" Ampstead Eath\n\nIt was the surprise of my life.\nNever in my life have I seen such riotous fun Everywhere we went some girl would \nshove what they call a tickler into my face or throw a ball on a piece of elastic at you. \nThe girls are a fine type, some almost beautiful and it is said they save up all their \nmoney till Bank Holiday and then blue it up in a day Certainly the majority were \nexpensively dressed, some wearing 3 & 4 guinea fur\n\ncoats.\nThe dress that caught my eye was the typical Harriet. \nDressed in what looked like black silk, and a black hat with an enormous & \nbeautiful white ostrich feather. Some were wearing a pink feather. \nThe costers have discarded the custom of pearl buttons but they cannot discard the \"Git \ndarn\" accent quite so readily. \nThe chief amusement there is cocoanut shies. Here & there you\n\nwill see an organ playing a jig or rag time and about 20 girls using the road as a \nballroom. They go over to the pub and get a few in and come out and let themselves \ngo. They dance without losing their dignity and I really think that those women are, \ninspite of their drinking & smoking, good, and the tide of immorality is comparatively \nlow. If that is so, then good luck to them & May they spend many another\n\nHappy bank Holiday on the Heath.\nNow when I was at Harefield I met a chap, he was 57, Held highest educational honours \nobtainable in Australia. I saw him in London and took him out to the heath with me. He \ngot a few whiskies in and as the policemen were real good sorts we were chatting about \nthe fair when my mate started quoting Greek Latin & Shakespeare to them and \ntalking over their heads in a manner that made them open\n\ntheir mouths & stare at him. A crowd of small boys who asked him to be directed \nsomewhere stared the same fate. What do kiddies know about Damon & Pythian, \nVirgil & Aeneas\n","95":" I thought I would see the changing of the guard at Buckingham Palace but I was \nabsolutely disgusted. Fancy marching with the king's, and with our glorious Empires \ncolours to the tune of two favourite German marches\n\n\"My Regiment\" & \"Action Front\"\n","96":" We went out to Hampton Court & saw over the Palace and grounds, the \nHouseboats etc. The 180 years old grape Vine.\nWe saw the place where Henry VIII courted Anne Boleyn The marvellous collection of \npaintings, the King & Queens Bed & Reception rooms.\nThe Court is now devoted as apartments of the wives of notable men, granted rent free\n\nby the King.\nI was guide through the maze and walked straight in and out as I had a plan of the maze \nmarked and had no difficulty.\nWe were then split up into 3 parties, one going to Mrs Scott's the wife of Captain Scott, \nthe Arctic Explorer. \nI was attached to a party that went to the house of Lady White, Called \"the Wilderness\" \nLady White is the widow of Field Marshal Sir George White\n\nthe \"Hero of Ladysmith\" Mrs White has lots of presents from Queen Victoria & \nEdward VIII also from Kaiser Bill of Germany. I saw his Field Marshal's Baton and his \ndifferent Orders Swords & Trophies that had been presented him. I also saw his \ndaughter and ----------- Thereby hangs a tale\n","97":" I leave to-day for Brighton.\n\n"}}