{"Document Name":{"0":"Diary_0375","1":"Diary_0375","2":"Diary_0375","3":"Diary_0375","4":"Diary_0375","5":"Diary_0375","6":"Diary_0375","7":"Diary_0375","8":"Diary_0375","9":"Diary_0375","10":"Diary_0375","11":"Diary_0375","12":"Diary_0375","13":"Diary_0375","14":"Diary_0375","15":"Diary_0375","16":"Diary_0375","17":"Diary_0375","18":"Diary_0375","19":"Diary_0375","20":"Diary_0375","21":"Diary_0375","22":"Diary_0375","23":"Diary_0375","24":"Diary_0375","25":"Diary_0375","26":"Diary_0375","27":"Diary_0375","28":"Diary_0375","29":"Diary_0375","30":"Diary_0375","31":"Diary_0375","32":"Diary_0375","33":"Diary_0375","34":"Diary_0375","35":"Diary_0375","36":"Diary_0375","37":"Diary_0375","38":"Diary_0375","39":"Diary_0375","40":"Diary_0375","41":"Diary_0375","42":"Diary_0375","43":"Diary_0375","44":"Diary_0375","45":"Diary_0375","46":"Diary_0375","47":"Diary_0375","48":"Diary_0375","49":"Diary_0375","50":"Diary_0375","51":"Diary_0375","52":"Diary_0375","53":"Diary_0375","54":"Diary_0375","55":"Diary_0375","56":"Diary_0375","57":"Diary_0375","58":"Diary_0375","59":"Diary_0375","60":"Diary_0375","61":"Diary_0375","62":"Diary_0375","63":"Diary_0375","64":"Diary_0375","65":"Diary_0375","66":"Diary_0375","67":"Diary_0375","68":"Diary_0375","69":"Diary_0375","70":"Diary_0375","71":"Diary_0375","72":"Diary_0375","73":"Diary_0375","74":"Diary_0375","75":"Diary_0375","76":"Diary_0375","77":"Diary_0375","78":"Diary_0375","79":"Diary_0375","80":"Diary_0375","81":"Diary_0375","82":"Diary_0375","83":"Diary_0375","84":"Diary_0375","85":"Diary_0375","86":"Diary_0375","87":"Diary_0375","88":"Diary_0375","89":"Diary_0375","90":"Diary_0375"},"Date":{"0":"unknown","1":1705.0,"2":1706.0,"3":1707.0,"4":1708.0,"5":1709.0,"6":1710.0,"7":1711.0,"8":1712.0,"9":1713.0,"10":1714.0,"11":1715.0,"12":1716.0,"13":1717.0,"14":1718.0,"15":1719.0,"16":1720.0,"17":1721.0,"18":1722.0,"19":1723.0,"20":1724.0,"21":1725.0,"22":1726.0,"23":1727.0,"24":1728.0,"25":1729.0,"26":1730.0,"27":1731.0,"28":1732.0,"29":1733.0,"30":1734.0,"31":1735.0,"32":1736.0,"33":1737.0,"34":1738.0,"35":1739.0,"36":1740.0,"37":1741.0,"38":1742.0,"39":1743.0,"40":1744.0,"41":1745.0,"42":1746.0,"43":1747.0,"44":1748.0,"45":1749.0,"46":1750.0,"47":1751.0,"48":1752.0,"49":1753.0,"50":1754.0,"51":1755.0,"52":1756.0,"53":1757.0,"54":1758.0,"55":1759.0,"56":1760.0,"57":1761.0,"58":1762.0,"59":1763.0,"60":1764.0,"61":1765.0,"62":1767.0,"63":1768.0,"64":1769.0,"65":1770.0,"66":1771.0,"67":1772.0,"68":1773.0,"69":1774.0,"70":1775.0,"71":1776.0,"72":1777.0,"73":1778.0,"74":1779.0,"75":1780.0,"76":1781.0,"77":1782.0,"78":1783.0,"79":1784.0,"80":1785.0,"81":1786.0,"82":1787.0,"83":1788.0,"84":1789.0,"85":1790.0,"86":1791.0,"87":1792.0,"88":1793.0,"89":1794.0,"90":1795.0},"Entry":{"0":"\n\n","1":"\n\nMoved from Querrieu to Bussy this morning & took up our old camp. As usual things were not too clean. Made a note out & sent the Machine Gun to B.O.R. A Fritzer came over & shot down 4 balloons. He himself was shot down but by the look of things he got to his own side. Guess he was just about dead tho. Some Fritzers came over bombing during the night, but were nowhere near us.\n","2":"\n\nRained all last night & today as\n\nwell. Didn’t do anything at all except read bulletin's all day. Scriven’s leave for Paris came out. He goes tomorrow, wish I were in his place. McGowan & Dick went out to the trenches to see if they could get any information about 2 of Dick’s men who have been missing since the night of 29\/30th July. They left at 2pm & are not home yet 10 pm. Guess they are mud from head to foot.\n","3":"\n\nMac & Dick didn’t get home until 4.30pm. They were wet thro & covered from head to foot in mud. They found the boys grave (that they went out to look for.) Scriven went on Paris leave this morning. Edgley went to Rivery as Salvage Officer in place of Pearce (A Coy). Think it was something to do over that stunt. Saw a good fight tonight between one of our boys & a Yank. Went 8 rounds & was a draw. They fought for a purse which everybody contributed to by throwing their spare coins into the ring.\n","4":"\n\n4 Years today since I volunteered\n\nbut not quite 4 years since I enlisted. Started work again today. Had to do a road that ran from behind the Abbe to in front of Villers-Brettoneaux. Am going to get my eye fixed up tomorrow by the doctor. Capt. Patterson came to us today as 2nd in Command. Got news tonight that Fritz has retired from Dernancourt & Mentdideu and practically all along. Do us, every time.\n","5":"\n\nWent to the doctor & he cut the stuff out of my eye lid & ear. Didn’t hurt much. Did nothing all day cept read & help to fix up the track for our Sports tomorrow. Am the starter for the show. Got the best news I’ve heard since coming to France tonight. Have been told by the Major that there is a big offensive starting here in a few days time. 4 Aussie Div. going forward with Tommies on the left & Canadians on our right. Tanks & cavalry to be used. Tanks & aeroplanes will \n\nbe used for carrying food & ammunition as well as their ordinary work. The stunt is to be a leap frog business. The 5th Pioneers will be Corp troops & the C.O. has 2 Corp Field Engineers attached as well. The 3rd Pioneers re also Corp troops & have 1 F. Coy attached. Our work is to keep all roads clear & in good repair. Our Company is lucky for we are in reserve for a start while all the others have jobs. Hope to goodness it succeeds. It is to be a 60 mile front & as far as we can go. Do everybody I think.\n","6":"\n\nRained all yesterday & today. The sports were cancelled on a\/c of the rain. Just got orders to move again. This time to Blangy Tronville. Have to go out to work tonight too. Don’t know what the job is yet. The job is to carry mining sets from a dump to the job (near the front line.) Left camp here at 10.30 pm & reported to a 6th Field Coy Officer at 11.45pm & then went to the \n\ndump. Gee the roads were muddy. Got bogged on a number of occasions. When passing Villers saw a lot of tanks going up, also a lot of guns. Did the job & came home along the main road missing all the mud. Passed right thro Villers. It is knocked about badly. Not a house left without several shell holes in it. Got a ride coming home & landed back in camp at 4.30am. Shelling was fair, but none came near us.\n","7":"\n\nSlept till 1pm. Had brekker in bed. Read out an order from General Monash to the men about the stunt. The stunt comes off tomorrow. Have to leave some of our kit here so that we travel as lightly as possible. Packed it all up in a waterproof sheet. Went to bed early so that I could get a bit of sleep. \n","8":"\n\nChris ’s birthday. Some celebration too it is going to be. Got up at 3am. Moved out at 4.20am when our barrage started. Moved to some dug outs near Villers Brett.\n\nStayed there till 3.30pm. We were the Reserve Coy so until then we had nothing to do. Saw hundreds of prisoners & hear that our boys are doing exceptionally well. Do us. We moved up at 3.30pm & had to maintain the main road till midnight & then we move into a bank north of Warfusee Abincourt & Lamotte en Santerre. Everything went well with our boys. There was very little work in the air by Fritz. Our boys walked straight thro him on the ground. Captured guns, as train load of troops coming to this front & have generally hit him hard.\n","9":"\n\nHad a stand to at 3am till 4.30am. Nothing strange happened tho Fritz kept going with long range gums all night. They were near here but not close enough to worry us at all. During the day planes came along & dropped 2 messages for the tanks. Our forward balloon was shot down\n\nby a Fritz airman about 8.30pm. At this time Sgt. Gray & I went back to Villers Brett. to see the state of the main road. Just as we got back to Lamotte some Fritz planes started an egg laying competition. Gray & I hid behind a brick wall. It only gave protection from one side tho Seems silly the things one does occasionally.\n\nSaturday 10.8.18\n\nStarted work on the main road at 1.45pm & knocked off at 8pm. Had tons of work to do as the traffic now is tremendous & old shellholes & new ones all require a lot of filling in. Just before going out Bill Cowper came along to see me. He looks well. Saw the tanks go over, just north of us, also saw the infantry. Gee it looked well. They got all their objectives too. Saw Les Dean & Chas. Singleton in the afternoon & hear old Dad Hether is at Framerville. Must try & see him. Fritz shelled our valley & bombed it fairly heavy just\n\nafter dark. Blew one Tommy to pieces that was all so we were all very lucky.\n\nSunday 11.8.18\n\nAll the 5th Div. went out to Fouilloy, Villers Brett & Aubigny for a spell yesterday. We are still in & this morning McGowan took his & my platoon out to build dug outs for some Amb. people. If he doesn’t finish by 4pm I have to take No 5 out to finish it. The 1st Div. took over from our people. Plenty of strafing this morning round the forward positions. One of our balloons broke loose last night & floated down south. The “archies\" had shots at it but didn’t hit it. All the news today is good so far.\n\nFound out that Dad Hether was near here, so went over in the evening to see him. Was goodo. He looked well & is in charge of the Transport of the","10":" F. Coy. He was in Bayonvillers. Coming home Fritz started laying eggs\n\nalong the main road. Made McGowan & I do the prom for a few minutes. Am to go to Corp School on the","11":" It is all infantry stuff.\n","12":"\n\nNothing for us to do today so am going for a look round. Capt Pattinson & I went for a look round the country. Walked from here (Warfusee) to Bayonvillers & saw Dad Hether & then caught a lorry & went to Harbonieres. Had a look there. The place is knocked about, but not half as much as this place. From there we walked to Guillaucourt & Wiencourt. Between these places there is a big ammunition dump that used to belong to Fritz. Also a big Prisoners of War camp. Was very interesting. We then got a lorry to Marcelcave & saw ‘A’ Coy. We also saw near Wiencourt the big armoured train. Gee it’s a bonny gun. 11.7\". Hope they turn it on old Fritz soon. Do him good. Lieut Brown rejoined today.\n","13":"\n\nHad to go out to a job the other side of the village & make horse lines for our H.Q. Got an Aussie mail & a big letter from Marie. Should be some more mail tomorrow. Had lunch with a coy of the 2nd Pioneers. (Traves Lodge, Colin Groves). We have just got orders to move south to Caix. Started off & when opposite Bayonvillers old Fritz put over a few shells very near to us. We were just going to spell but decided to move on. It got some infantry close by. Passed through Guillaucourt & landed here about 9pm just before the egg laying competition started. Had blankets for our roof, but roofs didn’t matter, much as we were dead tired. \n","14":"\n\nHad a walk through Caix in the morning. Gee the place is knocked about some. Haven’t seen any fruit on the trees this side but on our side there was tons. There isn’t any sort of furniture\n\nanywhere near the village. Didn’t even see a picture on the walls. The church has been pulled to pieces inside. They had some Fritz working on a road in the village . The Major & Capt. Pattinson went out near the line to look at a job we have to do & after tea I took the NCO’s out to have a look. We got a lorry from here to Vriely & then hoofed it across country. Not much doing ‘cept a few shells exceptionally close. Got home before dark.\n\nGee we get good amusement at night time. Our search lights get the Fritz planes in their glow & all the guns near by go for their lives. They never hit them tho. Dropped a few bombs very close to us last night.\n","15":"\n\nThe job is off so our walking tour was wasted. McGowan went on leave to Paris. Just as we finished our lunch Fritz started shelling the valley. Gee they were close too. We got two slightly wounded. \n\nSome of the infantry on the other side got knocked about some. They were big shells & had an instantaneous burst. We decided to move camp & had already moved some of our gear to another position (about 1000 yards away) when the Colonel came to light & told us to move right back to our old camp at Lamotte – Warfusee. We had dinner first & then moved back. Our old camp was taken by Tommies so No 8 was allowed to come over to some Fritz deep dug outs on the opposite side of the valley (facing Fritz) while the rest of the Coy had to dig in. Am over with No 8 & have a decent little place. Fritz shelled near our camp & bombed all round it during the night.\n","16":"\n\nNo work today ‘cept clean up & make dug outs for the other officers. Wrote 7 letters. Fritz shelled our camp but nobody was hit. Has been very hot since the push started. Shelled again\n\nduring the night but didn’t do any damage. No bombs at all during the night. Fritz must have gone to Blighty.\n","17":"\n\nWent out salvaging all sorts of stuff after lunch ‘till 6.30.pm. Played cards afterwards. Fritz didn’t shell us all day, but put over some at 10.30pm. Again no bombs. \n","18":"\n\nMore salvaging. Not a bad job. Had to get the men to bury 4 dead Fritz. They had been in the trench since the 8th. No work in the afternoon.\n","19":"\n\nHad a job at Div. H.Q. Had to make paths etc. It was a rotten job. Had to keep dodging heads all the time. Scriven came back from Paris leave.\n","20":"\n\nBack on Salvage work. Had to bury another Fritzer. Found one or two odds & ends. Another Aussie mail in. Do me, altho’ \n\nthere wasn’t any from Sydney. Things seem very quiet this way now. Only one plane over last night.\n\nWednesday 21.8.18.\n\nHad inspection & packed kits ready to move. We move to Hamel at 6pm. Relieve the 1st Pioneers of their billets. Looks as if the Divvy is going to rest for a couple of days. Wrote 3 letters & read all the morning & afternoon while waiting for the move. \n\nVery foggy this morning. Left our camp at 6pm & came to Vaux sur Somme passing through Hamel & Vaire sous Corbie. Gee Hamel is knocked about some. Almost as bad as Warfusee. We are camped in a billet. Stone floor with windows as doors. The men are near a canal & are under trench shelters. Lovely moonlight night. We took over from the 3rd Battalion. All the","21":" Div\n\nwere somewhere near here..\n","22":"\n\nOnly an inspection this morning. Had a swim. Two more of my platoon have just come back from the Divvy Wing. Marshall & Teale. Teale is the Div. Champion Heavyweight Boxer. Looks a very decent sort of a boy.\n","23":"\n\nFritz came over last night & gave us tons of his eggs. They were very close too. Reported to B.O.R. at 9a.m for the school. The valise & packs went to the station in a limber & the 2 sergeants & I went to Vequemont by lorries. Walked about till the train came in & met tons of officers I knew. Bill Stewart, Tommy Sard, Garnsey, Jenkins & a bit more. Left Vequemont at 2pm & went to Vignacourt. This was small guage. Had to walk from Vignacourt to Pernois (about 4 or 5 Kilo.) Had a cup of tea here & then caught a train\n\n(broad guage) to Abbeville. It left Pernois at 10pm & arrived at Abbeville at midnight. As the train did not go on till next morning we had to sleep in the train.\n","24":"\n\nWas lucky as regards sleep. Some of us were in a carriage while everybody else were in trucks. During the night the train was moved around a bit. As soon as it got light everybody was up & moving around. Had a good wash & some cold ham, bread & jam & a good cup of tea for brekker. We then left Abbeville and came on to Rue. We detrained here & had a guide waiting to take us to the school. Passed through two very small villages (would pay the French if Fritz put a few shells into them). Arrived here at 1.30 & were put into our different Divvies & then had lunch. I’m in with 2.56th officers (in a bill tent.) After lunch 5 of us went down to \n\nthe beach & had a bonny swim. Do me every day. After dinner (very poor too) had a few kicks of a football & then went to some pictures here. They were excellent too.\n","25":"\n\nBrekker at 9.30. Went for a swim in the morning. Went for a stroll after tea. After dinner played football & did a bit of a sing song. It started to rain about 9pm rained extra heavy.\n","26":"\n\nRained to some order last night. Started our routine this morning. Standing orders & fitting of equipment etc. Had squad drill (turning by numbers etc) Physical training & a lecture on Leadership. Went to some pictures after dinner & they were very good.\n","27":"\n\nHad more squad drill, physical training, musketry, map reading & a lecture by the doctor on Sanitation. Went for stroll after\n\ndinner. Had tons of football just before dinner. Wrote a couple of letters.\n","28":"\n\nDrill all the morning. Nearly all by numbers too. Gee it’s some monotonous too. Did the 2 mile run & came 104th out of 180. It’s too far for me in this condition. Had pictures again in the evening & they were good.\n","29":"\n\nDrill all day. 3 lectures but not very much to write up. The boxing started in the evening. One of our Divvy was beaten, but by very little. Went for a walk into the Le Crotoy.\n","30":"\n\nDrill again. Had concert in the night.\n","31":"\n\nCeremonial drill in the morning. After parade rushed down for a swim & then back, catching the train to Boulougne at 4.14pm arrived there at 6.15 passing thro Etaples & Carniers. Got room at Hotel de Louvre had dinner & then strolled\n\naround. Spoke to quite a lot of Waacs & a few french girls. It isn’t good to me tho, cus I can’t speak any french.\n","32":"\n\nWent all over Boulougne. Had lunch & tea at the Officers Club & then went out to No 2 A.G.H. with Garnsey & saw some Aussie Sisters. Had tea there & then went for a stroll & caught the train back home at 10.14 arriving at RUE at 12.30 & back in camp 1.45am. Had a bonny time altogether.\n","33":"\n\nVery tired this morning. Same old drill. Pictures in the evening. They were goodo.\n","34":"\n\nNothing unusual all day. ‘ cept that my mail at last arrived & got 10 letters.\n","35":"\n\nUsual run in the afternoon. Came 92nd this time so improved a bit. Had a bonny swim after the run.\n","36":"\n\nOn patrol work all day. Had a game of football after tea. Did fairly well. Think we will have a good team for next Wednesday\n","37":"\n\nMore patrol work. Air photos also. Had a good lecture on Intelligence work. Put in for leave to Le Treport.\n","38":"\n\nDid a bit of manoeuvring around in the morning. Got the car & went to Le Treport, passing thro a few small villages like (la Bassee, Lancheres, Bruteeles, Morlay,Sarlenelle & bigger villages like Noyelles-sur-Mer, St Valery, Louise, & near Ault & Eu & passing also thro Mer. Got there about 4pm. Went straight to the Hotel de la Plage & got a couple of rooms, had tea & then out for a stroll. It rained off & on all the afternoon. Went to the pictures in the evening & back home to bed. \n","39":"\n\nGot up about 9 & strolled all over the place. It rained all day so we went to the villages close by. \n\nWent to MER & to EU. Mer on the sea much like le Treport & is very nice. EU is a big place & very clean. Had a look at the big church there & just after coming out from it Dinney Shearer came along on a charabanc, so went back to Le Treport with him. He & I went up to the 2nd General Hospital & had a talk to two or three wounded Aussie officers there. Rained all day & spoilt a good night away. Left there about 7.30 & missed rain all the way. Gee we were lucky tho.\n","40":"\n\nRained all day. In the morning we had lectures & in the afternoon we just had time to do an exercise & then more rain & lectures. Boxing postponed on a\/c of rain.\n","41":"\n\nOrderly officer today – nothing much extra to do. Have to attend the course all day. Had lectures all the morning on a\/c of the rain but in the afternoon went to the range shooting. Got 14 out of 20. \n\nQuite my usual standard. Very windy all the afternoon & evening.\n","42":"\n\nRained all the morning again. Did lectures etc. cleared up in the afternoon but was every windy. Played football against 2nd Div. Won easily 2.4 to 8.8. Kicked 2 goals. Got a bonny kick on the knee tho Hurts some too. We also won the rugger & made a draw of the soccer, but lost the cricket. Still we are not doing too badly. Wrote a few letters.\n","43":"\n\nKnee very much swollen today. Went to doc. & got iodine on it. Rained nearly all day so have lectures & did sand tray work. Wrote a few letters. Tommy Coulston went to Hospital with small bone in his foot broken from playing Rugger yesterday.\n","44":" 9.18.\n\nRained all day again, got fine about tea time when the boxing was finished. \n\nWe ran a draw for second place.\n","45":"\n\nDemonstration of cooperation of infantry weapons. Most interesting & instructive. Left at 11am & walked to Rue for train to Boulougne. Rained when we got to Boulougne & didn’t stop till Sunday morning. Hardaker & I strolled around a bit. Had dinner at the club & then did some more strolling. Met Os. Charlton & had a good old talk of Sydney days. He goes on leave tomorrow to Blighty.\n","46":"\n\nWent to church. Gee it is the first time for years. Took communion too. Real bonny day. Had all our meals at the club. Lunch at the new one & the others at the old one. Get served quicker there (by french girls while the new one is by Waacs.) & went out to the Dublin Rest Camp in the afternoon & saw some boxing. Bandsman Rice & Jimmy Drison\n\ngave exhibitions. They were good. Had a bit of a talk with Rice & reckon he is some Cockney. Had a stroll on the beach & round the town & finally caught the train to Rue at 8.30. Got back to camp about 11.45 & then dived into some tinned peaches & biscuits. Do me.\n","47":"\n\nAnother bonny day. Lectures nearly all day. Have a bit of a cold on my chest. Had my team out for a run. Got a bonny lot of letters from Australia & in the night did some answering. Went to the movies & they were all comics.\n\nTuesday. 17.9.28.\n\nBit of a rough mess president now for the rest of the course. My cold is worse & is on my chest. Hope it is better for tomorrows game of football. Had an extra parade tonight to get entries for the sports & competitions on Friday, & am running the evening.\n","48":"\n\nHad to go off parade on account of my cold & went to the tent & bed down. Didn’t stop me from playing football in the afternoon tho altho it nearly killed me. Played fairly well & kicked a couple of nice goals. One from almost half way. Gee it was some kick. We beat the 3rd Div Scores were 7 goals 11 to 8 goals 2. We kicked badly in the","49":" quarter only getting one gaol to about 7 behinds. Was knocked clean out 2 minutes after the game started by a smack in the wind. Was absolutely done long before the game finished. Went straight to bed after the game. Didn’t bother about tea or dinner. Doctor came over after the pictures were over & said I would have to go to hospital tomorrow.\n","50":"\n\nStill not good but a bit better than yesterday. Doctor came along & I have to go to hospital in Abbeville. Got dressed & put a few things in my haversack & went over to the doctor. Told the \n\nboy to get all my odds & ends back to the battalion. Came to this hospital (No 2 Stationary) in the Ambulance & was put in No 5 ward after having a bonny hot bath. Can eat at this place. (Chicken etc) Much better than the school fare.\n","51":"\n\nGoods today. Guess I’ll be up for a while & should leave on Sunday in time to go back with the boys from the school. Four gas cases came in yesterday, 3 with eye trouble & one with chest. Mustard gas it was. They got it near St. Quentin fighting with the Aussies. Hope our casualties were light.\n","52":"\n\nGot up in the afternoon & went for a stroll over to No 3 A.G.H & saw Sister Nicholls. She is some sport. Invited us to afternoon tea on Monday. Had temp taken when we got back & sent back to bed ‘cos my temp was up.\n","53":"\n\nVery dopey today. Six from this ward sent to Blighty. Very lucky\n\nsome of them were too.\n","54":"\n\nStill in bed. Temp won’t go right down. Gen. Birdwood came in this afternoon & had a talk with all of us in the ward.\n","55":"\n\nStill in bed. Nice day outside. For a wonder it didn’t rain all day.\n","56":"\n\nGot up for a while in the afternoon Strolled all round the hospital. Slight air raid tonight.\n","57":"\n\nWent to the town & bought a little clothing. We brought back flowers etc for the ward. Feel good. Had afternoon tea at the club.\n","58":" 9.18\n\nAm marked for 3 weeks sick leave. Do me every time. Had afternoon tea with Miss Murdoch (Red Cross) & Sister McKay. Was goodo.\n","59":"\n\nMore rain today. Saw Sister Vicars Foote last night. She came over on the boat with me. Went to concert at 3rd A.G.H & it was very good. Enjoyed it immensely.\n\nMet Bill Perry (Capt) & Harold Woodman (Major.) Had a good talk to them.\n","60":"\n\nLeft the hospital at 9am but the train did not leave until about noon. Got to Etaples at 2.30pm after numerous stops. Went to the club. They sent me to No 9 Camp & they sent me to the 3rd Med. Board Depot. There we got fixed up with bed & food etc. Went for a stroll after we got settled down. Rained nearly all day.\n","61":"\n\nMissed a board this morning & have to wait till Saturday now. We were not warned but our names were put up on a board after we had left the camp for ordnance. Bought a new cap there & went for a walk. More rain all day. Had afternoon tea at the club.\n\nBULGARIA has declared peace unconditionally. Played patience all night & wrote a few letters in the morning. \n","62":"\n\nWent to the club in the morning & in the afternoon I got a job. Had to supervise a big dugout being made here. All I did was to go down & have a look at it & then go down to the club & then go for a stroll. Gee, I do detest these French people. All their streets are filthy. They throw potato peels & dirty water in the streets & are generally dirty. Won’t be sorry to leave the country. Went to bed fairly early & read. It isn’t quite as cold tonight.\n","63":"\n\nNo board today so have to wait till Saturday. Spent the morning at the club. All one does here is to go to the club, have tea, write occasionally, read or go for a walk & after dinner play patience. Guess I’ll be a case for the Doctor soon. Will be going back to Aussie in a padded cell. This place will drive one mad.\n\nThis town has been knocked about some by old Fritz & his eggs. Could knock it all down I\n\nthink. Would be doing the French a good turn, ‘cos then they might be able to make a decent town of the place. As it is now, it is only a filthy hovel.\n","64":"\n\nSame old routine. 8am Brekker & then wait till 9.30 for roll call & then down here to the club. Read, have a shave & then at 11am have a cup of Coffee. Wait here till 12.30 when we go back for lunch. Its a pity to go back too ‘cos the meals are very poor. After lunch we come back here to the club. Do nothing till 4pm when we have tea & then carry on doing nothing till 6.05 when we go back for dinner. After dinner we go for a stroll & then go back to bed. Bill Cowper came along today. Brought a letter from the hospital. Went to the pictures & they were rotten.\n","65":"\n\nClub all the morning. Went to Paris Plage in the afternoon & we all had a game of tennis. Im very poor at it now tho. Nothing startling in the evening.\n","66":"\n\nAm up before a board this morning. Waited all this morning & still have to wait a bit longer this afternoon. Gee it was icy cold this morning. Went back after lunch & went before the board. Got 3 weeks sick leave in Blighty from it. Board consisted of Colonel & 2 captains.\n","67":"\n\nWent to Paris Plage in the afternoon & caught two Waacs. Had lunch, tea & dinner at the club.\n","68":"\n\nWent before the D.D.M.S this morning & he confirmed our leave. Leave Etaples tomorrow & go to Blighty the same day. Went to Paris Plage with the Waac & wandered around. Collected warrant for Blighty at 9pm\n","69":"\n\nLeft Etaples at 3.43am. Gee it was icy cold & dark. Arrived at Boulougne about 5am & went to the club. Had a wash & brush up & then some brekker. After brekker went to the\n\nquay & fixed up about our embarking. Then we went for a stroll & had a look at the cathedral. Gee it is glorious inside. Best I’ve seen after St Pauls. Went on the boat about 9.30am & left at 10.30. Good voyage over. Landed at Folkestone at 12.45 & in London at 4pm. Came straight to Jermyn Court & got a room. Went & bought a new suit for £2\/6\/6 & tomorrow am buying boots. Went to see the Bing Boys on Broadway tonight & enjoyed it immensely. Met Sgt Gray there. Met quite a lot I knew at Boulougne.\n","70":"\n\nWent all over the place shopping. Went out to N.’s place & collected my belongings. Took Sgt Gray to see ‘The Boy’. Gee it was great.\n","71":"\n\nWent to Horseferry Road. Met Bill Cowper in the afternoon also Doc. Speirs, Capt Wilson, Lt Rees. Met them all at the station just as they landed to start on leave. Marie\n\nsent my letters round. Am taking her to a show tonight also to dinner. Woodhams & I took Marie to the Criterion for dinner & then to see ‘You Never Know y’Know’. After the show we took her home & she gave us some supper. We stayed there talking till 12.30am\n","72":"\n\nDr Speirs says my complaint now is scabies. Gee they itch some. Can hardly get a sleep now at all during the night. Took Marie & her pal to dinner at Simpsons & then to see Shanghai. Dot Brenton & Ivy Shilling were playing in it. It is very decent but the music is poor. After the show we went back to the flat & had supper. Had a big pillow fight. Gee it was some fight.\n","73":"\n\nWent to the bank & wandered about for a while. At 4.30 went out to Marie’s flat for tea. She had 3 girl friends there & gee\n\nwe started everything going. Talk about a pillow fight. Well it lasted about 2 hours. We pulled all sorts of things out of place, including the mantelplaces. we got to the train about ¼ to 10 & went straight to bed.\n","74":"\n\nArrived at Edinburgh about 8am. Took a taxi to the Caledonian Hotel but we slipped some & didn’t click so we came back to the Royal. Got a room there alright. Went to the castle after brekker & wandered around generally after lunch I took Bill Cowper out to Comely Bank & uncle took us out to the Forth Bridge. We stayed there for tea & supper. Went to bed dead tired.\n","75":"\n\nSpent the morning shopping & sightseeing. Went out to both the Coistorphine & Comely Bank in the afternoon & went to The Theatre Royal\n\nto see a show called a Trip to Paris. It was absolutely awful.\n","76":"\n\nLeft Edinburgh at 9.5am & arrived at Glasgow at 10.10am. Went to central Hotel but slipped & had to wander round & look for another place. Finished up at the George Hotel. Went to lunch at The Grosvenor & dinner at the Central. Met major Donaldson at the Central. Went to the Alhambra Theatre & saw Pamela. It was fair. Voices were very poor tho.\n","77":"\n\nDr Speirs came around soon after we got out of bed. We all went out shopping & at 12.15 I went to meet Harriett Winter at Copeland & Lye. We missed one another, so we boys went to lunch. After lunch we went back to the hotel & I sent away all my Xmas cards. Harriett called round to see me & we had a real good old talk.\n\nShe took me out to see Alice Vernan but she wasn’t home so we went back to town, had tea & then rushed to the station (St Enoch’s) to catch the train to Stranraer about 8.30 & went straight to the hotel, had dinner & went to bed. It is a fairly large sea port. Gee I love the scotch people & their quaint accents. Can’t understand some tho.\n","78":"\n\nLeft Stranraer at 8am & arrived at Larne (Ireland) at 11.15. Was sick on the way. A transport was sunk by a submarine. Saw the whole show. The first explosion we thought was a gun firing but soon after the stern went down & a little later the bow stood straight up & then the boilers blew out & the whole lot sunk. Caught the train for Belfast straight away & arrived here at the Royal Avenue Hotel in time for lunch. Wandered about & had\n\na look at the town & shops. Had tea at a very nice restaurant. Met two very nice girls & took them to dinner & then to the theatre (Opera House) to see General Post. Enjoyed the whole thing. It is about snobbishness & the war. Thought it very good.\n","79":"\n\nLeft Belfast at 10am. The girl I caught yesterday came to see us off. Was a very nice & interesting trip. Arrived at Dublin at 1pm, got a cab & went straight round to the Royal Hibernian Hotel. After having a walk, had dinner & then went out to have a look round. Went into Sackville St. & saw all the damage the rebels had done in 1916. The buildings are only now being started to get rebuilt. Went to see JW Elvery & Co for a boy in France. From there we went to the station & got our tickets for Brecon etc. Got an Irish Jaunting Cart from there & did some shopping & went down to Guinness Brewery. It was too late to go over the brewery but we\n\narranged to go tomorrow. Went back to dinner at the hotel & then went to the Empire Theatre to see Grand Opera. It was “Lurline\" & was played by the McNally Grand Opera Coy. Both Bill and I enjoyed it. It was a far better Coy than we gave them credit for at first. After the show we went to a Fish & oyster saloon called The Dive & had a feed & then went home to bed.\n","80":"\n\nGot up about 9.30 & did the usual (shave, bath & brekker) & then went down to the brewery arriving there about 11am. Got a book on the place & a guide was provided we went all over the place. Met Reg Downey & his wife there & they came over with us. Gee it is a magnificent place & covers acres. Think it marvellous. They have all sorts of brainy ideas for saving labor. They have a narrow gauge railway all over the brewery & when the engines are required to pull the broad gauge trucks, the engine is lifted completely off the narrow\n\ngauge & placed on to a body for the broad gauge. It then works as usual but the small wheels fit on to large wheels & are driven by friction. These wheels are connected on to the broad gauge ones. This idea is goodo. Rushed back to the hotel for lunch & then to the station catching the 1.20pm train to Kingstown. Went straight onto the boat. Left my cape in the train & had to ring up for it & managed to get it before the boat left. Kingstown appears to be a very big place & looks very pretty & interesting. Had a good voyage over to Holyhead on the Munster (sister ship to the Leinster) we slept nearly all the way. Got to Holyhead at 5.30pm. As the train didn’t leave until 8.10pm we got out & went for a stroll thro. the town. Bought some sugar & then caught two girls & got them to take us all over the town. Train left at 8.10. Got to Chester. Bill left there while I went on to Crewe. Had to wait there from 10.45pm to 2am for my train. Read 2 books & went for a walk. Got a \n\nfrom there to Whitechurch & had to wait there 2 hours. Got a train from there to Moat Lane but had to wait for 3 hours at some station before we got there.\n","81":"\n\nEventually arrived at Brecon at 10.30 & got to Aunt Maggie’s place about 11. Had brekker immediately. Gee she has photos of us all in all parts of the house. Photos of us in all ages. Had a bit of a sleep in the afternoon & then came down & talked to Auntie Maggie. Did nothing else.\n","82":"\n\nGot up at 9.30am after a delightful sleep. Went to Aunt Probert but she is ill in bed & the only person I saw in the house was Mary. Uncle Bill was out for a walk so I didn’t see him either. Got back to Aunt Maggies, had lunch & then caught the 2.5pm train. Had a good trip. Had to change twice that was all. Arrived about 9.30 at the hotel. Got my room went for a stroll then to bed.\n","83":"\n\nUp at 8.30. Some change for me. Was with Harry Brevett nearly all day. Took him to dinner & Marie to see “As You Were\". Then went back to her flat & had supper. Got a big bundle of letters from her. Some from Aussie too.\n","84":"\n\nKnocked around with Harry all day Met some big businessmen from Manchester & went on to see the Soldier Boy with them. Enjoyed the show immensely. After the show went up to the manager’s office & met Mr Boor.\n","85":"\n\nToday is Our Day. Usual flag day wrote 4 letters. Bought a writing case for 42\/6 (should have been 50\/- plus cost of 3 letters. Harry knew the manager & got it cheaper) Took Marie to see ‘The Man from Toronto.’ It is by far the best comedy I’ve seen. Gee I enjoyed it. Went back for supper afterwards. \n","86":" 10.18.\n\nBill Cowper came to light \n\nbefore I was out of bed. We both went for a bath this morning. Went to Horseferry Rd & bank with Bill. Then to lunch. Rushed off & caught the 1.30pm to Reading. Went round to the hotel & met Ada. Went into the park for a walk & it rained. Last time I was there it rained. Caught the 5.10pm back & went out for Vi, at 7.30. Took her to see Marie Lohr in Nurse Benson & was late as usual for the start. Liked the show immensely.\n","87":"\n\nTook Harry & the gang to lunch. Went to Marie’s for tea & created the usual disturbance by having a good cushion fight. Had pancakes for tea. Took her out some lard. Took she & Janet Stewart to see Dennis Eadie and Sidney Valentine in “The Freedom of the Seas\". Gee it was goodo. Put Janet in a tube & took Marie home & we had supper. Soup, Ham & tomatoe & some real cakes & coffee.\n","88":"\n\nTook Marie & Miss Gillard to lunch in Soho. Went to Rendevouz Cafe. Met Fred Balson. He came to see Bill Cowper. Five of us (Bill & his brother, Marie, Miss Gillard & self) went to Hampton Court. Enjoyed it. Went out per bus & back per train. Had tea there & dinner at Marie’s place. \n","89":"\n\nBusy all day. buying stuff & packing. Saw a lot of Harry Brevett. Took Marie & Miss Stewart to dinner at Maxims & then to see a show “Going up\".\n","90":"\n\nLeft London at 7.20pm for France. \n\n"}}