{"Document Name":{"0":"Diary_0333","1":"Diary_0333","2":"Diary_0333","3":"Diary_0333","4":"Diary_0333","5":"Diary_0333","6":"Diary_0333","7":"Diary_0333","8":"Diary_0333","9":"Diary_0333","10":"Diary_0333","11":"Diary_0333","12":"Diary_0333","13":"Diary_0333","14":"Diary_0333","15":"Diary_0333","16":"Diary_0333","17":"Diary_0333","18":"Diary_0333","19":"Diary_0333","20":"Diary_0333","21":"Diary_0333","22":"Diary_0333","23":"Diary_0333","24":"Diary_0333","25":"Diary_0333","26":"Diary_0333","27":"Diary_0333","28":"Diary_0333","29":"Diary_0333","30":"Diary_0333","31":"Diary_0333","32":"Diary_0333","33":"Diary_0333","34":"Diary_0333","35":"Diary_0333","36":"Diary_0333","37":"Diary_0333"},"Date":{"0":"unknown","1":434.0,"2":435.0,"3":436.0,"4":437.0,"5":438.0,"6":439.0,"7":440.0,"8":441.0,"9":442.0,"10":443.0,"11":444.0,"12":445.0,"13":446.0,"14":447.0,"15":448.0,"16":449.0,"17":450.0,"18":451.0,"19":452.0,"20":453.0,"21":454.0,"22":455.0,"23":456.0,"24":457.0,"25":458.0,"26":459.0,"27":460.0,"28":461.0,"29":462.0,"30":463.0,"31":464.0,"32":465.0,"33":466.0,"34":467.0,"35":468.0,"36":469.0,"37":470.0},"Entry":{"0":"\n\n","1":"\n\nWe arrived at Alexandria at about 7 am. In the early hours of the morning we had an opportunity of viewing some of the country as we travelled on our way from Cairo to Alexandria. The fertile flats of the Nile looked well in the early morning light – irrigation canals everywhere & every inch of the land cultivated while at short intervals here and the usual Native mud villages with Date Palms growing about them. As soon as we arrived at Alexandria to started unloading our gear & we worked all day & far into the night getting it loaded onto the boat. I was with a party working in the Hold at night packing our carts away & it was 1 am Tuesday morning before we had finished & by that time we were thoroughly done out - having had practically no sleep since the morning before – lots of work & little to eat. But all was ready for a start! \n","2":" About 8 am we steamed away from Port there was a fresh breeze blowing & a fairly choppy sea & a good many of the boys were sick as soon as out. At our first Parade we were informed that our destination was Lemnos Island an Island about 40 miles from the Dardanelles. The breeze freshened during the day & there was a fair swell -\n","3":" A very stiff breeze all day a fairly rough sea during the day one of our horses died - and we can ill afford to lose many of them A lot of the boys are sick still. Things going well generally.\n","4":" The morning broke clear with a very cool breeze blowing – many Islands being in sight – while on several mountains in the distance was to be seen snow. All day we drew closer to the snow covered mountains & the wind became very chilly. About 4 P.M. we entered\n\nthe Harbor in Lemnos Island. The harbor has a wide entrance to the ocean but hidden inside is a fine sheltered harbor where were lying at anchor several Battleships ships – Cruisers & Sub-marines beside supply ships. All around the harbor is gently rising country being mostly cultivated while there are a number of quaint villages, while a striking feature are a great number of wind mills – apparently used as a primitive method of grinding the grain. The place gives one the impression \nthat\n of having been inhabited for many centuries as no doubt it has – the people no doubt living a very simple & primitive life. Taken in all it is a pretty place & interesting – but one thing that strikes the eye is the entire absence of trees. As we steamed in a number of recently large guns were to be seen on the foreshores.\n","5":" An uneventful day A few of our boys went ashore to have a look at the water supply. A couple more transports came into the Harbor. Things quiet.\n","6":" Same quiet – ship life Tomorrow No. 1 Section is to go ashore & camp for a week – fix up water supply troughs, etc: for 9th Infantry Battln who go ashore today \n","7":" We came ashore today bringing 7 days supply & had a lot of work getting things ashore & to our Camping ground. It was quite dark before we had our Camp fixed up & by the time we had our tea we were quite tired enough to turn in.\n\nNo. 3 Section left at short notice for the Dardenelles to do some Demolition work We all envy them getting away first but our turn will soon come\n","8":" Last night was a wild night – or rather this morning About 3 am a heavy thunder storm came up & we had turn out & dig trenches around our tents. Some of us we sleeping \n\nout & there was a wild rush for the tents. The Infantry were Bivouacing & they must have had a bad time. This morning we fixed up a water trough for the Infantry horses. Fixed our camp up generally & dried our things that got wet last night. Had an easy day. The natives are driving a great trade as the people do every where the Australian goes. They appear to be a sturdy healthy people. A couple of Battleships can be seen in the Harbor with masts missing \n","9":" Nothing fresh today. We are having an easy time doing practically nothing but look after the water supply for the Infantry. Still chilly & windy. \n","10":" Having easy time still There are fresh transports coming into the Harbor every day – both British & French. The \"Queen Elizabeth\" came into Harbor \nyest\n this evening & looks very fine amongst the other war-craft. This afternoon L. Cpl Baldwin 2nd Cpl Turnley & I went to a Village about 2 miles from\n\nhere. It was rather interesting. The village consists mostly of very old Square stone buildings, there being no method in the laying out of the streets or lanes. The streets or lanes are narrow & very rough & rocky & running & all directions. Where ever we appeared the women young & old & boys & girls would at once disappear into the homes shutting the doors & even the shutters on the windows. I questioned one of the men who could speak English & he said that they were afraid of all soldiers as those they were used to seeing in the past had treated them very badly. The predominant flower grown on the Island appear to be the \"stock\" which blooms beautifully. I noticed on looking into one of the cemeterys that it is the custom to have the graves convex instead of heaping the earth as we do, & at the head of each grave is placed a lantern.\n","11":" Not much doing today – a little fatique work. Engineers also started to build a pier for landing & taking troops & horse away.\n","12":" Been working to-day with party on pier. Infantry are doing most of heavy work procuring the stone for building\n","13":" Still working on pier – the work going on well. Nothing fresh.\n","14":" No. 4 Sec. are now on the Island & part of No. 3. One of the Admirals have given \nthe\n our Coy praise – saying that it must be a very good Coy as we have now formed a Demolition party – a party - maning a steam boat - & a shore party doing fatique work for Division beside building a Pier. Shifted tents today to new site & worked in afternoon on pier.\n","15":" Work going on as usual Troopships are still\n\ncoming into the harbor & there are a great many here now. All the \"war-boats\" bar one went out this afternoon, so there will be something doing at the Dardenelles.\n","16":" Work going on well at pier, other work as usual. Horses came ashore this afternoon. A number of \"mine sweepers\" were in this morning. One has been blown up – 2 of the crew being saved. \"All’s well\" \n\n16-3-15. Work going on smoothly Still working on Pier – wells & other work for improving Camp\n","17":" Working steadily improving Camp. Pier etc. There are a lot of French troops now on the Island – supposed to be about 20,000 of them all told – also a lot of Imperial Troops.\n","18":" work as past few days – nothing fresh. Some of the troopships left the Harbor this morning – supposed to be going to Dardanelles\n","19":" Troopships returned\n\nto Harbor this morning Have not got any news of what is going on. Some of No. 3 Sec: went with \"Corda Castle\" yesterday morning. Work going on as usual Wind rising to-night – looks like wild weather.\n","20":" Wev’e had exceptionally heavy wind since early last night. About 4 A.M. our tent was blown flat on top of us need less to say causing us not a little discomfort. Several tents have been blown down in the Camp. Our Pier is standing well. The water is breaking right over it at times the wind is still very heavy & cold \nworking\n The weather is too heavy to allow us to work on the Pier today.\n","21":" We had tremendous wind last night but by day light it had eased off considerably. In the afternoon a cold wind suddenly sprung up from the North & to-night it is blowing very heavily \n\n& cold with driving rain. News through today which appears to be correct that 3 British boats have been lost in the Dardanelles the \"Indomitable\" Invincible (Battle Cruisers) & Ocean – an old boat – beside a French boat. Carried on with work as usual although it is Sunday (written in bed listening to the wind & rain driving onto the tent)\n","22":" Nothing unusual today. Work going on as usual. Sapper Sutherland & I went with Col: Liverick & Mather to inspect water supply We expect to lay about ½ mile piping for supply shortly.\n","23":" No. 1 Sec: had leave today Cpl Bird Spr Cridland Gatty-Smith & I, had a stroll across the Island to the sea board in an Easterly direction. Saw a couple of villages we had not seen before. We also saw the wreck of the Destroyer that was lost a couple of nights ago. R.E.s leaving to-morrow. No. 3 back again but did no work.\n","24":" Still windy & cold No change in work. Still working on the & Pier building. Water supply for horses not too satisfactory\n","25":" Nothing unusual today work going on as usual. Was speaking to a survivior from the \"Ocean\" today - said the British boats lost in Dardanelles disaster were Ocean & \"Irristable\" On light duty today - cold on chest\n","26":" Finished Pier today We now have a fine usful Pier running out into the water about 240\" French have landed a number of \"Senegales\" to fight in Dardanelles A large number of large fighting craft are in Harbor\n","27":" News through today of surrender of the Fort of \"Przemyal\" 9 Generals 75 Staff Officers 2,500 officers 117,000 soldiers. Work going on as usual. Still on light duty.\n","28":" Nothing unusual. Stoves came ashore today for new water scheme.\n\n28-3-15 \"Inflexable\" in Harbor appears to be a good deal damaged Supposed to have been 26 men locked in compartment while ship was in sinking condition. All lost. Still in light duty.\n","29":" Pipe laying for new water supply commenced today More Battle ships arrived in Port today There are now a great many large boats in the Harbor We expect Dardanelles in about fortnight Boats cannot proceed in \"Narrows\" much further without Co-operation with land forces. Still light duty.\n","30":" Nothing fresh in the way of news, work going on steadily. Still on light duty.\n","31":" Camp work water System now being installed & other improvements Still light duty Cold very prevalent – a few deaths from Pneumonia\n","32":" A party went to the wreck of Submarine 64 -\n\nto see whether they could get anything usful for the Coy to use. A few tools were procured. A few nights since some of our fellows got away from Camp & proceed to the wreck & it was rather amusing to see some of the things that were brought back on the quiet. Included in the collection were – Steering wheel, about 60 large candles 2\"shells,cantas – Knives forks & spoons – part Machine Gun belt & shells – skin Rum & various other articles. They were coming in from about 12 to 4 a.m. This was out tents doings. Started work again to-day was with a party on Reservoir\n","33":" \nUsual no\n Holiday for those who are not on important work.\n","34":" Usual work – nothing fresh – cool change set in again.\n","35":" Work only for few today. First all have not had to work on Sunday\n\nfor 6 weeks. Very cold & windy today. Last night about 11 P.M. I together with some of our fellows went to the Church in the Village to witness a service It was very strange. We could not understand it properly but it had had to do with the Resserrection of Christ & lasted I believe till about 4 A.M. this Saturday night there was a big procession of Greeks carrying tapers & torches & the 9th Batt Band played the \"Dead March\" for them. It all sounded very weired This is the first time for some years that the Greeks have been able to carry out these Ceremonies as the Turks would not allow them to do so. They are very pleased at being allowed to take up the old custom again (Mail came to hand Thursday Got 19 letters & 6 papers)\n","36":" Terrific wind set in last night with rain. Our tent almost blew down shortly after daylight & we had to turn out to the rescue in the cold wind & rain. During \n\ntoday we could do little but sit in the tent & wait for the weather to take up.\n","37":" All last night the wind blew with terrific force & drove the rain through every chink in the tent. Today there has not been much rain although the wind has been blowing heavily most of the day. We have been packing up some of our things preparatory to going away. We are to be on board by Friday 9th. A good many horses were taken on board to-day also some of the Infantry embarked, the rest to go tomorrow. Cannot say where going but think going Dardanelles. Nothing else of importance.\n\n.\n\n"}}