{"Document Name":{"0":"Diary_0310","1":"Diary_0310","2":"Diary_0310","3":"Diary_0310","4":"Diary_0310","5":"Diary_0310","6":"Diary_0310","7":"Diary_0310","8":"Diary_0310","9":"Diary_0310","10":"Diary_0310","11":"Diary_0310","12":"Diary_0310","13":"Diary_0310","14":"Diary_0310","15":"Diary_0310","16":"Diary_0310","17":"Diary_0310","18":"Diary_0310","19":"Diary_0310","20":"Diary_0310","21":"Diary_0310","22":"Diary_0310","23":"Diary_0310","24":"Diary_0310","25":"Diary_0310","26":"Diary_0310","27":"Diary_0310","28":"Diary_0310","29":"Diary_0310","30":"Diary_0310","31":"Diary_0310","32":"Diary_0310","33":"Diary_0310","34":"Diary_0310","35":"Diary_0310","36":"Diary_0310","37":"Diary_0310","38":"Diary_0310","39":"Diary_0310","40":"Diary_0310","41":"Diary_0310"},"Date":{"0":"unknown","1":1846.0,"2":1847.0,"3":1848.0,"4":1851.0,"5":1852.0,"6":1853.0,"7":1854.0,"8":1855.0,"9":1856.0,"10":1857.0,"11":1858.0,"12":1859.0,"13":1871.0,"14":1872.0,"15":1873.0,"16":1874.0,"17":1875.0,"18":1876.0,"19":1877.0,"20":1878.0,"21":1879.0,"22":1880.0,"23":1881.0,"24":1882.0,"25":1883.0,"26":1884.0,"27":1885.0,"28":1886.0,"29":1887.0,"30":1888.0,"31":1891.0,"32":1892.0,"33":1893.0,"34":1894.0,"35":1895.0,"36":1896.0,"37":1899.0,"38":1900.0,"39":1911.0,"40":1912.0,"41":1913.0},"Entry":{"0":" \n\nDecember 18\n\nSolre le Chateau\n\nAll the day grey rain blowing in mist past the cold shadow of the tower, and the square puddles of mud and wet-glinting cobbles, and in one corner, a huddled group of covered lorries.\n\nA ‘clay-bed’ plate for Christmas Night programme compleated, of four shield designs, ‘Maps’, ‘G.’, ‘Q’ and A.D.M.S. : great debating over the latter shield, Ken objecting loudly to introduction of the Blue Lamp, but consoled by thought that its explanation could be an R.A.P. lamp: George’s brilliant suggestion that a Bed pan schould take the place of M.I.D.\n\n \n\n","1":"\n\nwaived to save an electric situation.\n\nDecember 20\n\nPresles\n\nPresles has a beautiful Chateau, and the staff have a weakness for Chateaus, and the unfortunate part of the whole concern – even apart from the five impossible Majors – are the ten kilos between us and Charleroi. The ’staff’ have their cars!\n\nWell-billetted again, in a large double-casement window lit room, facing a park and great hill forest of dark lovely pines. G.Q. and A.D. in separate village Billets: we in the Chateau’s lodge. Great folk in the lodge, and this morning Madame – an older sinisterly senile dame, had our fire lit, and sent Coffee at 11.\n\nSolre left yesterday morning, and a lunch – of dark beers and light and excellent Cognac – at Charleroi, in the evening an Estaminet hunt proved disastrous. An order comes into force shortly, that no alcohol is to be sold in the Divisional area, only Beer and Wine … this rule to the Estaminet Keepers, but the quality of their sales seems uninteresting to Fav’d Authority.\n\nStraight falling slow rain, and the beauty of the tall heavy pines a wounderful setting for the formal building of Fav’d Chateau.\n\n \n\nDecember 20\n\nHome Mail in last night, to end of October: and from Mrs. H. a note of Dec. 14 of \"William\" Pater being sent on with \"some other books\".\n\nMother’s news is of a new order: Gerald marrying R. on the 11 Nov., and Alma and Boy both having sons, Enid having a son, and Joyce a daughter. But the happy news is of --- the first mention of her for months.\n\n3.\n\nWriting, Harris, editor of \"Aussy\", strolls in and asks for ‘Molony’, so a yarning of the rag, and his production of the Xmas Copy proof. After a sketch of the General, put him on to Ken, with the result that the A.D.C. is to fix a sitting. Next No. he’s doing the \"Romance\" sketch and from Sketch Book he wants ‘Corbie’ and ‘Solre’.\n\nAnd the day ending comes the rumour of a rhum issue!\n\nDecember 21\n\n4.\n\nMail, a Christmas No. of the T.L.S. but a number barren of good announcements. Barrie’s Plays decently received, and Lord Dunsany’s \"Tales of War\" from a half column of review, rather poor. A letter written to Stevens – Export Manager, complaining of ill service and asking for books on order to be forwarded before end of year – or an account to date! So impossible to write for J.A. Symond’s facsimile reprint of\n\n \n\nDecember 21, 22\n\n\"In The Key of Blue\" – Elkin Mathews, 8\/6.\n\nChristmas night programme completed, with a tail piece by Ken of the Chateau towers and Archway.\n\nToday the Count shews his good judgment of men: he away to Brussels with Col. Marks.\n\nEarly morning, and Ken, Hardy and Gordon of the Sigs. (-- or of the \"Many Leaves\"!) about the Chateau drives, in shorts and Staff Caps, \"What Athletes these strange \"Australians\" are!\"\n\nDecember 22\n\n5.\n\nAn ill report on the achievement of the Committee. From the Canteen George unable to buy the two cases of Whisky. He in tonight, and a re-yarning of arrangements: Tomorrow to go out buying – he, Mac, and I – vegetables, tinn’d stuff and Fowls. Tonight around to \"Q\" and find they have already arranged with the Count’s buyer for a Keg of Beer – for themselves: so we commandeered it, and ordered again two barrels.\n\nMail, a syllabus of the School of Architecture from the Liverpool University. Will see Vin, a so-so Catalogue from Heffen of Cambridge, and a parcel of books – including Pater and Plato – from Mrs. H.\n\nUp to the ‘Mons’ girl Estaminet with George, E. & B. and Mac:\n\n \n\nDecember 22, 24\n\nDivvy Transport there – drinking Cognac and Bitters – a so-called ‘Liquer’. Together they make a great crowd of rich vitality. Lofty – the tall lean erratic diver and swimmer of Sylvestre Cappel – a typical Digger Transport Type, and a fine picture lazily lounging over his chair.\n\nA rain-sounding wind in the trees, and a dull drizzle from black skies.\n\nDecember 24\n\n6.\n\nSlow rare rain. Yesterday a day of buying in Charleroi and Chatelat with one of \"Q\" men. Result – after endless pilgrimages and two bon dinners of Chips and Steak – two bottles of Cherry Brandy – 63 F: Box lemons – 9F: and 3 Nutmegs for Rhum Punch 1.800: 6 Tins of Pears 27F – at the Canteen today, one larger tin 1.25 and Vinegar, Chicorie (a new vegetable) and stray odds.\n\nArrangements for tomorrow night’s dinner half compleat: all raw and tinned stuff ready, & three stuff’d turkeys to be roasted in ‘Q’s ovens, and with 15 bottles of wine – Graves and Sauternes, - 100 litres of Beer, and a great Rhum punch, 190 Francs still to our credit – For New Year’s Eve!\n\n \n\nDecember 24\n\n7.\n\nCharleroi in the night, an estasy of purple great lamps, and a hundred great glowing lights, exquisitively hazed like frozen hung flares in the thin thread \nhaze\n mist of rain: and the cobbles each individually gleaming and black masses silvered by the lights filling the lorry crowded square.\n\nToday Arthur C. in after presents for Madame and Mdslle – two lace collars and scent from ‘Maps’ and the C.C. office people.\n\nNo Mail: and all day cancelling and re-arranging, grouting and gutzing: But the promise is goods!\n\nDecember 26\n\n8.\n\nA night that ended in a candlelight procession through Presles and to the Chateau courtyard, carolling Hark The Herald Angles Sing! – closely followed, sung well with tears, \"How Dry We Are\". Then to a \"Resuscitation\" at the A.D.M.S. and to our Maisonette to bed in the small hours, and the night still and a high sparsely starr’d sky.\n\nYesterday morning with Maurie through the wood for Ivy and Miseletoe: the afternoon decorating and arranging the Estaminet: vast excitement in the villiage and a hundred sightseers.\n\n \n\nDecember 26\n\nOne disappointing episode – Hardy arrived, self-invited, with the General. He’d made up his mind for a programme, and he beat us. In the early afternoon he offered two bottles of whisky – and we refused. So he joined the General’s party – issuing instructions through Q to Richards to call on him at 6.45 when they would meet the General together.\n\nThe G.O.C. was great – absolutely genuine and without \"Bulleeh\" . Later Geoff blew in and confirmed his popularity. George, half screwed, wailed on him.\n\nAltogether a bon night.\n\nDecember 26\n\nLast night I watched Racy: and later – after a dozen exquisite punches – I tackled him.\n\nOnce at Courcellette, Arthur, of the Amb. and I (drunk perhaps) yarned of the difficulty of obtaining good models: he told of a dozen \"seduction\" experiences – of girls – and men – suddenly asked to pose. Morality outraged. Yet, the whole concern is so rotten, that I asked Racy if he would remember my asking: both of us were half over, but even then he – by the very request – thought I was quite over. Then he promised.\n\n \n\nDecember 26\n\nIts beastly to think a man of his beauty – and nature too – being amongst ‘Q’ men: and the damnable part is that Kerr is his man!!\n\nIt will be rather amusing to note how we next meet – or how he mentions our covenant!\n\nSo commences Boxing Day!!!\n\n‘Requiscat!’\n\nDecember 26, 27\n\n10.\n\nEvening: Mac away with ‘G’ and Kim and Arthur in Charleroi, so alone in the office, in a deep chair by a bon fire reading Yeats poems, and then murdering a mood, from Madame’s Kitchen, comes the panting of a breathless accordion!\n\nDecember 27\n\n11.\n\nMaj. Morell is working a damnable dirty point on two men – on Mick G. and Blink: Mick is our draft for the return batch for tomorrow, and today – after four days ago saying he would have to refer the matter to Christie - \na staff trainee\n, he says he cannot go, no-one being here yet to\n\n \n\nDecember 27\n\ntake his place, and Blink for 18 months has been with Mick on the job, taking his place during his several leaves. This Mick clearly told to ‘Tubby’ and of Blink’s capability of taking over the job, says T, \"There’s been too much of this one man stepping into another man’s job lately! and dismisses Mick. So tonight he applies to be paraded to the G.O.C.\n\nFar too clearly has ‘Tubby’ showed his cards – coming back at Solre from his ‘officer’s sick leave’ (one month) and finding Ken R. promoted S.\/Sgt. in the Big Digger’s place, he questioned the promotion, & re-recommended Goddard – the Clerk he brought with him from Corps for the crown Ken was temporarily holding, now his point is to keep Mick back, while he either brings in another man, or attaches Goddard to ‘Registering’ to overstep Blink when Mick goes.\n\nIt remains to be seen! Every day it becomes more obvious – the beastly position of the General, his A.D.C., Geoff and Col Marks, amongst a mob of tabb’d parvenus.\n\nPut in today with Arthur for leave to Brussels – the three day \"conducted tour\".\n\n \n\nDecember 27, 28\n\nTwo letters written and posted: to Aunt Louie & asking for Moore’s \"Story Teller’s Holiday\" and to Mrs. H. my thanks for the book parcel.\n\nCommenced, and half completed, a drawing of the Solre Hotel de Ville and Tower, for \"Aussy\".\n\nDecember 28\n\n12.\n\nA mood of blasphemous fed-upness: Mick was to have been paraded by Morell to the G.O.C. at 12.30: instead he refuses the parade, threatens all the Military’s wrath, and sends to the draft in Mick’s place, Kerr’s batman! Indispensable: in face of General Monash’s Corps order that no man is indispensable – in the face of G.S.O. III, Capt. Laughlin – leaving for Aust. H.Q. in the middle of a stunt in September, from the Bois de Buire!\n\nWho is Morell – C.C. Boyd? – and his brother, C. Morell of the Pioneers late 1917 becomes a Staff Trainee.\n\nThank God the warr is over!\n\nOut alone this afternoon in the blowing rain along the drear dirty roads.\n\n13.\n\nA Dream of a great sombre Tapestry hung hall, strangely entered from the porchway of a poor villiage church: in the small graveyard about were broken flung down vaults as at St. Souplet.\n\n \n\nDecember 28\n\nand Bohain that strangely filled my memory as I passed through that low tower door. Heavy deep tapestries along the high vaulted hall, and six arm still candles far down, the only light: and a half heard song – the cold river by the billet. Then the hall changed to a green mirrored canal, with dark poplars and Chestnuts along its banks, and the light a soft twilight, beautiful as the colour of Corot. Then a warm golden sun broke through the trees, and a splashing and diving crowd of white girls and brown boys filled the canal, and danced on the lawn green banks. Awake, and the beauty lived the while to the lulling laughter hurry of the stream, and the high vague murmur of the pines.\n\nDecember 29\n\n14.\n\nTonight, back from Gaugnies where the 1st Batt. are, a Commonwealth Bk. letter, of £15 having been forwarded through P.O.: so George C. down, a yarning of applications and a deciding on Bruges as our objective, with Brussels and Ghent on the way. Tomorrow our applications to go in for Jan. 11. The \"conducted leave\" to\n\n \n\nDecember 29, 30\n\nBrussels applied for a day ago, granted. I’ll pass to Ken. If we ghutz on Bruges we’ll apply for Brussels – 8 days or Paris.\n\nDecember 30\n\n15.\n\nFive oclock, and a long day of utter boredom seems past: last night the sky between the most high pines full of stars, but the promise barren, and the day has been grey and dull.\n\nGeoff in, spoke to him of Bruges leave, and he advised waiting till he’d sounded the ground: advises Antwerp as pass objective – and train Bruges.\n\nOne bright spot in the day’s monotony. Five notices from Corps – from G.H.Q. probably –\n\nS.S. 771\n\nFire\n\nAny person discovering a fire will:\n\n1. Try to put it out.\n\n2. Shout for assistance.\n\n3. Inform an Officer.\n\nand 4? – will not light his cigarette at it!\n\nDecember 31\n\n16.\n\nMorning at Fosse, but a disappointing villiage: Convent buildings about the Church quaintly roofed and vine grown, and tiny windowed, beautiful form places.\n\nA small Boche Cemetary good in its arrangement, and its tall column, each stone with its four faces individually carven – a cross, a\n\n \n\nDecember 31\n\nstarfish, a rose or circle very beautiful in its cleanness of design, the graves deep grassed plots, \nmounds with\n and small slab crosses widely spaced.\n\nBack to Presles early, and a haircut and a bath.\n\nWaiting now till 9, when a celebrating to midnight commences in a room in the villiage. In the house the Engrs. E.O. is billetted: our point is the billet is unofficial! By his manner a while ago – requesting quietness! he’s a Tommy - or of close extraction.\n\nThings ‘swim’!\n\nJanuary 1st, 1919\n\n17.\n\nA good evening: and by a lucky chance, Racy as Drinking Partner: he, Laurie and self saw each other home as far as where the roads cross the stream by the Chateau Gateway.\n\nMorning and a heavy waking: afternoon alone to Gaugnies, mostly by the fields. The day evenly grey and a thin sun behind woven clouds.\n\nJanuary 2\n\n18.\n\nApplication for Brussels & Antwerp – change at Geoff’s advice – for 8 days leave. Orders in by tonight’s run opens Belgian leave in lieu of English, and\n\n \n\nJanuary 2\n\nspecial of 10 days: also a 72 hours leave to any chosen city may be granted by Divl. Commanders.\n\nTonight at A.D.M.S. met the renowned Marie: she’s a jolly Flemish animal, small but strongly built, full of laughter and impish unexpectedness, she learnt her English in bed!\n\n19.\n\n(Entry Dec. 13 187.)\n\nSomewhere in the last diary is an important entry on G.H.Q.’s turning Miss E. Rout down, and threatening to close her hotel. Now Aust. Corps have confirmed our appreciation of her work and are backing her, so a victory for us – over a war office that provides Brothels for the Indian garrison in Peace time, and ignores V.D. in abnormal times till the diseased would build a Corps, and then half-heartedly turns to an apparently genuine use of preventatives – and places licensed brothels \"out of bounds\".\n\nEntry 41\n\nTonight read a copy of her letter to G.O.C. (?) of the N.Z. She’s right – but rather too fierce. It would be rather interesting to know where she has her authority to so flatly contradict the U.S. Official V.D. returns!\n\nBut apart, to her a lot is owing, and that Corps have recognised that is well worth while.\n\n \n\nJanuary 3\n\n20.\n\nMidday Ken comes form the Chateau, with word from Geoff of an immediate return to Australia stunt for draftsmen, on the condition of six months work drafting for the home Military. Our three names in, but a wondering remains: the idea of a further six months working with Tabb’d Authority – Ken, Hardy and the five disgusting Majors loom ahead – is worse than another year’s warring.\n\nQ and G delivered ultimatums today, asking for trainees to be brought to the office to succeed 1915 men as their turns for drafts come.\n\nJanuary 3, 4\n\nMail: Barrie’s and Dunsany’s new books – \"Echoes of Warr\" and \"Tales of War\". By the fire – which went out, read \"The Old Lady\" and \"The New World\", two bon little pieces like laughing sunny days of April.\n\nJanuary 4\n\n21.\n\nArthur and Ken away in the morning to Brussels: our Bruges and Antwerp application through \"Q\" now for Corps to ‘yea’ or ‘Nay’. Mac back to ‘G’ from Corps, and word out for men to commence understudying G and Q men. Their manifests of two days ago to figureheads, followed by good results: already there seems a wondering in their minds: soon they’ll have to work!\n\n \n\nDecember 4\n\nFrom 8th to 12th, the first of the new drafts away for England: from 1st Div. men – up to June and past. 2nd draft rumoured for 18th-20th – if our leave is granted, back to time will bring England closely following.\n\nOld Tom away on special English leave, takes to post old collection of maps and papers.\n\nNo mail.\n\n22.\n\nLater. Tonight, alone reading Thompson’s \"Poppy\" and each following reading the lulling sweet musick has broken it.\n\nBut where I go your face goes too\n\nTo watch lest I play false to you\n\nand Bill’s face has come to my mind, shall I know how well? – or shall I just have his friendly smile and acquaintance till H.Q.s are left for home? He remains: and a 1917 man he’ll be a long while here – each day – how can he help it! – coming more and more under the horrible influence of Ken. Then the laugh comes – twice we have known each other well – twice then we were half drunk – Christmas day and on N. Year’s eve.\n\nTonight to sleep in the Lodge – under that damnable bell that rings early about 7, at 8 and 9!\n\n \n\nDecember 5, 7\n\n23.\n\nA day of rain skies, and sudden passing showers: afternoon alone to Saint Eustache, and back with Gregory. Mail in, an undated letter from Mother – probably Nov. 3 and one from Mat. Geoff was to sail on Gerald’s wedding day – according to Mother’s last letter, Nov. 11, to Mat today, Nov. 16\n\nRead Thompson again tonight.\n\nDecember 7\n\n24.\n\nTo bed late, after a home parcel supper with Ken, Arthur, Mac and Blink. Early in the evening Bill over, and a pleasant while yarning till K and A back from their Brussels trip: then the intimate charm broken, and following enthusiasms over Brussels and lovely buildings: but more particularly of a little etching of the Palais de Justice Ken couldn’t afford!\n\nAfternoon with Maurie along the road to Fosse, & a race back to Presles in a new lorry. Mail in, ‘Secret Springs of Dublin Song’, and an account . Later another mail, the Christmas Bookman, and ‘Monuments and Memorials’ from Country Life, Bookman an interesting number of portraits and notes on Soldier Poets, W.J. Turner – of ‘The Dark Fire’ and ‘The Hunter’ listed with the Australians – while\n\n \n","2":"\n\na photograph shews his badge as English. Across then to ‘Q’ for A.I.F. list, and found one J.L. Turner, a Capt. in","3":" Div. Train A.F.A. \n\nFrom Williams and Norgate the book of Mestrovic has been issued – 750 copies at 25\/-. Another interesting announcement is from Lane – a Bundle of Aussies – with illustrations by Jim S.\n\nYesterday morning in to Chatelat to Pay Office – and find no money order through yet from C.P. – while notification from the bank was posted","4":"\n","5":"\n\nPost away this morning Morris’ ‘Hollow Land’ and Stephen’s ‘Hill of Vision’: and a bundle of old and Dec. ‘Aussies’.\n\nDecember 7\n","6":"\n\nAfternoon to Chatelat in the Chat with Ken A. and Mick – they on to Brussels. Pass to Bruges and Antwerp through this morning, so to the Pay Office: and no money through! So the problem stands at ‘funds’. Will see Geoff in the morning, failing that, call on the Amb. people.\n\nA keenly clear night, high dark skies frozenly starr’d: and a crescent brilliant moon: the pines black-cut shadows, and the ground by the Chateau vaguely green in the cold light. If only the weather lasts.\n\n‘Thais’ on at the Brussels O.H. on the 9th so leaving here the day after tomorrow, D.V.\n\n \n","7":" 7, 8\n","8":"\n\nA reported conversation of two evil geniuses …\n\nM.J. Hay. But if we stop them going, they’ll probably kick up a row and write to the Minister for Defence – a Hughes!\n\nMj. M.r.II. Well we’ll have to chance that!\n\n\"What a crowd!\"\n\n\"What a crew!!\" G.B.S.\n\nDecember 8\n\n28.\n\nFrom Mother – things are crook! Maurie and self away to Chatelat this afternoon – and a finding there of no money for Blighty, and up to the Chateau tonight after money find here awaiting £12 from Tabb’d --!... Mac.\n","9":"\n\nBrussels\n","10":"\n\nMidnight, and back from an evening spent at the Opera – Thais – with a wounderful Thais and a splendid . Arriving Brussels 5.40 we’d just time to book seats – separately in different parts of the house. Met there Jack M., Elk and another of the Amb. After to the , disappointing but good beer there.\n","11":" to bed.\n","12":"\n","13":"\n\n- And not an Anzac\n\n- or any other M.P. yet seen!\n\n \n","14":"\n\nGhent\n\n31.\n\nMorning of","15":" Yesterday by the 9 train in the company of one of Belgium’s ‘Diggers’ – more a Frenchman than a Fleming. They seem a sleekly beautiful people, these heavily built Flemings, akin to their great plough horses and working dogs.\n\nGhent – the Quay au Bli is a place of dreams: late last night, after a dull evening at the Flemish Theatre, the moon behind thin clouds, the rich shadows of the high gables, gothick turrets, and the black arch of the bridge with the close apse of the church behind, and the gleaming velvet water, we were alone there as the hour chimes struck in the belfry. A night that remains, with the memory of \"Palliacci\" at the Opera on Sunday night, and the few other spiritual experiences of four years.\n\n32.\n\nEvening: a day about and about, and tonight at the ‘Neouveau Cirque’. Tomorrow for Bruges: and then Ghent will remain for memory and dreams.\n","16":"\n\nBruges\n\n33.\n\nAfter Ghent, Bruges was to have been the place of reverie and old beauty. But its outward beauty, from our afternoon walking is only in places. The Grande Place and about the Palais de\n\n \n","17":"\n\nJustice.\n\nTomorrow we’ll away, if a train passes late & by it to Brussels, then on to Antwerp.\n\nOur windows open to a clustering of old roofs and step’d gables, rising one above the other, and of time dark colours, all leading the eye to the high turrettless tower of the Belfry.\n\nThere is a quietness over the city of Bruges, a quietness neither of age nor dreams nor of waiting, in the half empty streets about the town there is a sense of hidden wonder, of the vague light of early morning.\n","18":"\n\n34.\n\nA long day, and some great pictures seen: Bruges is lovelier in the hot sun days of June than the grey haze of January. Today, all the morning a pale sun and vague milky skies, tonight a full moon and a ghostly beauty over steep gables and the square. Tomorrow for Brussels.\n","19":"\n\nParis\n\n35.\n\nBrussels, back from Bruges at ‘Faust’, met Harold N. and his brother, Ted. I had a pass for Boulogne, Nick for Charleroi. Yesterday the four of us\n\n \n\ncaught the 6.25 Express for the –\n","20":"\n\nPresles\n\n36.\n\nAll yesterday, till 1.30 this morning in the Paris Brussels express, then till 3 along the Boulevarde du Midi from one café to another with a 2nd Divvy man suppering on coffee, cognac and oysters, then to the Y.M. and starting chain there till six, so to the Gare du Midi, and the train to Charleroi.\n\nA big mail waiting and confirmation of our draft leaving Presles on the 29th!\n\nTomorrow to the Amb. on the trail of £15 for Blighty 14 days leave prior to embarkation. Rumour tells of Liverpool is our port of embarkation – via Panama.\n","21":"\n\n37.\n\nAfternoon to the Amb. – beyond Gaugnies: saw Robbin about £20 for Demob. leave, and then Mac back at A.D.M.S. A crash: there joint account half drained, Mac having lost money lately to 3rd Fld. Coy.\n\nSaw Toby, Billy and some of the old crowd, and from Johnno his photograph, and two of Dick Higgins old snap enlargements – one of the crowd about Billet doors at La Kruel, one of four, including\n\n \n","22":"\n\nBlue Henry near Wychaete last Jan. Nick not yet back, and Clarrie’s away in the last draft.\n\nShepherd, Arthur, Frank D. and Burton deeply involved in the producing of an Amb. souvenir book: they after sketches or articles: will try something from old diaries at Mrs. Hadlie’s during leave.\n\nA cold good day: faint snow in the morning, so stayed in bed, and the sun and clearing cloud skies in the afternoon.\n\n38.\n\nTonight a yarning with one of the official photographers of Bean and the Correspondents and Artists, Dyson and Leist. Bean left London on the 11th for home with his full war history of the A.I.F. – so far only read by his two secretaries and himself. Tale goes of Gen. Monash desiring a look-see – and later a demanding for censorship! B stood on his dig, & held it closely.\n\nTale told of B’s close investigations late at Fromelles, of setting out a 100 yd. paced square, and a counting of","23":" Divvy old skulls – 470 to the square after the years.\n\n \n","24":"\n\n39.\n\nA cold day, sunny awhile: morning Div. official photograph took group of ‘Maps’ and ‘G’ together – Blink, Mac, Foch Burras, Arthur C., Bill, Racy Mac and self. \n\nA letter posted to Mr. H. – a last S.O.S. for £20 for London leave next month. Posted home Christmas ‘Bookman’, ‘Stray Birds’ and ‘Secret Springs’: still to go ‘Moore’, ‘Pater’ and sketch book.\n\nMaurie’s applic. for an leave granted, but Jimmy Rook’s queried by Corps: so Maurie in a wonder on going alone: evidently George has been arguing against hurried leaves, and conflicting impressions of one place seen closely on another. Yet often it seems a half day’s impression of a city comes to be more vivid and beautiful than three whole days – when a hundred passing aspects of the place cover and bed in the general idea.\n\nEven before the beauty of the Quay aux Bli, a goldenly lovely bay – of the loveliness of one of Raeburn’s paintings – in the church of St. and a redly brown Fleming of animal build and silky black hair, at \n\n \n","25":"\n\nthe Nouveau Cirque, stand as the first memories of Ghent.\n\nAnd Paris ? – the sun a vivid vermilion lantern in the grey woven mist, the trees of the Tuileries Gardens silver and white, the fountains playing, vivid as newly cut silver, from oval pools of soft blue, and last March our first day was the same.\n\nBrussels in the Opera house – \"Thais\", \"Orpheus\" and Pa and La Tosca, and the lovely rural paintings of red-gilt and golden-gilt men of rose and vermilion skies dull vine leaves and trees and the splendid pagan colour of a naked world.\n\nThe last night in Paris saw ‘Romeo & Juliet’ – a bon piece with a good ballet: after Brussels Ballet even the last rows were .\n\nJanuary 25\n\n40.\n\nThe great faintly-heard rumour of today is the possibility of Monday being the day of the first draft’s leaving.\n\nAfternoon a long wandering through the side tracks through the Chateau grounds.\n\n \n\nJanuary 25\n\n41.\n\nSaturday night, arriving in Paris at the Gare du Nord near 12.30 and without a proper pass, we’d no call of the Y.M. leave parties: so across to Mrs. Rout’s hotel. We met her in the vestibule – it was then 1.30 a.m. and she received us. I’d been looking forward to meeting her – expecting tho’ a rather masculine woman, of loud voice and aggressive manner. But she’s a bonser little woman, with a bon motherly manner and a most disarming kiss. Yes, she could put us up – one here, and three in one bed just around the corner! \"Did we mind?\" – then she piloted us around, handed us to the care of the night maid, kissed us, and was out again after the final stragglers. The room was payed for.\n\nNext morning a greeting kiss again, and \"Did we sleep well?\" Then on the Monday night I booked seats in the morning’s Brussels express. She was in one of her rooms, the centre of a dozen diggers, smirking about her in a circle and yarning and\n\n \n\nJanuary 25\n\nlaughing. At 6 the next morning she was guarding and piloting to reserved seats, each and every digger and N.Z. she met, while an hundred civilians were frantic in their adventure after seats, till the train left the station, she’d a seat for every soldier. She is more than a tower of strength to chaps on leave – she mothers them all, and laughs at the little insults of G.H.Q. Notes, Paris.\n\nSunday afternoon finding the Luxemburg Musee closed to the ‘Louvre’ and the sculpture galleries there crowded deeply with guide-book-holding Americans and their R.C. women. There again at 1 on Monday afternoon, and in the great galleries only half a dozen: so till 4 a great afternoon spent. Beyond the Venus de Milo and the Winged Victory, two small torsos by Lysippean appealed: two pieces of perfect modelling, more after the style of Mestrovic’s Torso than the best Greek manner.\n\n \n","26":"\n\nPosted away book of Memorials and old phamplet catalogue & the Benson book of Pater: now to post old maps of the line and Moore’s book.\n","27":"\n\n42.\n\nAll day faint circling blowing snow.\n\nPreparations for a dinner tomorrow night – Mac, George, Arthur, Blinc, and company.\n","28":"\n\n43.\n\nEvening: tonight for a Dinner of 9, already half the crowd are mellow and Rhine wines and Punch stand for drinks.\n\nNo mail and a cold day.\n","29":"\n\n44.\n\nClearing out pack and sorting old gear about ‘Maps’, re-discovered ‘The Imitation of Christ\", found at Becordel just after the Factory Corner stunt. Opening it, the first read verse –\n\nIt is not lawful to cast them all away, for nature must be supported; but to require superflueties, and such things as are most delightful, Thy holy law forbids: for otherwise the flesh would grow insolent against the Spirit.\n\n- just as kit was cut down to a minimum to provide easy space for souvenir Maps and Keats and \"Today\"!\n\n \n","30":"\n\n45.\n\nTomorrow commences from Presles the long trip home: and the days as ordinary and as grey as a hundred others.\n\nDinner last night a full success. Mac hilarious early, till coffee lasted at the ‘Annie Laurie’ stage - insisting on George C. accompaning him. Early in the morning, Madame was ‘beaucoup fache’ at the sudden springing on her of the dinner idea. So Mac doped her so thoroughly with rhum that an hour before she retired to her den, and awoke at midnight to demand another little drink!\n\nSending along to Owen Burton for the Ambulance Souvenir Book, ‘The Outpost’.\n\nPosted home collection of Boche pocket maps – Rheims, Sousson, two parts of Amiens and Leon and Arras.\n","31":"\n\nHarfleurs\n\nIn Y.M.C.A. Hut\n\n46.\n\nNight of the","32":" the whole draft billetting in great electrical workshops by Charleroi station: amongst great heaps of dynamos and small engines & long lines of enormous cable spools, the perspective of high stanchions vanishing in the smoke & haze held\n\n \n","33":"\n\nby the high roof, of a hundred improvised braziers: a magnificent piece of intricate interlacing silhouette, of blue-dark haze, and gold-red lights, a great shallow boiler as a brazier, and curling clear flames high above an encircling crowd, and at intervals would come around the camp evil geniuses, and the flames would die to a glow – to climb again as they passed.\n\nMorning of","34":" the long train, of Boche trucks – deep in the straw grouted from a train of potatoes it covered – left Charleroi at 9.30, and this afternoon at Harfleurs by 3.30.\n\nYesterday midmorning, one of the trains long spells of waiting was at – by the side of a supply train, all shortages in train issue well made up and \npassed\n bettered.\n\nIn Draft 5, no A.M.C.: so in the train took down colours of the Amb. and put up D.H.Q.: it may save me from the detail camp at Foven .\n\nCold grey days, with the pale sun shining awhile today.\n\n \n","35":"\n\nGreat and many arguments about hut fires on a 14 days leave on £4.4.0. ‘One who knows’ speaks of London being crowded with broke Aussies – and the happy rumour grows of an order changing the £4.4 to £14!\n\nEarly morning snow: then blowing sleet and rain before 12. So far we’ve advanced towards leave past a Medical Inspection – in single file past four doctors for a minute’s \"Listening Post\" stint (according to a Digger) and a handing over of names for leave and of our leave objective.\n\nTomorrow issue of Sea-Kit bags and following Pay will fix the draft for leave.\n\nMet yesterday morning at Weymouth, Mr. Toohey. Landed there about 10, train then to Warminster, and an hour’s march to here. A dead camp when we arrived – and the usual word whispered about – \"We were not expecting you!\" So the afternoon passed in a collecting from draft of a camp personnel – including Cook and Mess men,\n\n \n","36":"\n\nClerks and O.R. staff.\n\nAt Havre on Sunday afternoon, Blinc and self into the Y.M. hut, and there till show ended. An amusing afternoon, and a great Padre. One of his stunts was \"Advice to a Young Man\". The idea was to each write on an envelope some piece of pithy advice: each was then read out in turn from the stage and judged by the diggers – prize being cigarettes, tinn’d fruit and puddings. Here are some – the winning being,\n\nA pause in time: save a trip to 39!\n\nNever let the wife learn French!\n\nWe’ve had O.C.’s long enough: get married and be an O.C. yourself!\n\nNever lift your beer by the handle – it might break off!\n\nIn the next war, join the Salvation Army.\n\nGet busy! and populate the country for the next war!\n\nTents and pedantic advice were ‘outed’ every time – even the bible most venerable and wordy.\n\n \n","37":"\n\nBath\n\nLeave began Saturday morning: caught Bristol Train, and got out at Bath, to roam the morning searching a room, and the day bitterly cold, blowing, and freezing. Found one at last – \"Not vacant yet, but it will be for tonight\" at some Private Hotel – so engaged it. Spent the early afternoon at the Gallery, then at 4.15 to bed. Got up midday today still with a rotten throat, the first like it since Bullecourt, and an ordinary cold. After lunch ventured out and a bitter damned wind blowing, back again at the toot. Now the wonder is how long £2.10 will last at these holiday rates?\n\nLunch today with two of the \"boarders\": one, a thin girl of near 50 blew in early and we sat down: she delivered herself in half a dozen stacatto phrases, and finished her soup before I’d started. Then a nude of Beardsley’s grown stout and \n\n \n","38":"\n\nrespectable and wrapped closely in Jaegars wallowed in.\n\nHer tired eyes didn’t even see me.\n\nLuncheon was a funeral affair. The cat, a lovely Persian tabby in a highly interesting condition, clawed for food! Said the ‘girl’ – \"He’s \nwounderfully\n well fed, isn’t he?\", and the seeded satyr \"Naughty!\" - wether to the girl or cat is not certain.\n\nThen she whispered a tender word to the waitress and a moment later she reverently carried in a damned ball-eyed spaniel who \"spoke\" for his dinner – in automaton phrases.\n","39":"\n\nCommences today the fourth Phase of the homing, and the well-circulated rumour is of all boats cancelled for February, and only two sailing during March!\n\nLeave enjoyed, tho the weather was uniformly dull and rain-hazy, and bitterly cold.\n\nNotes later.\n\nAfternoon.\n\nStarted awhile reading Fitzgerald’s translation of\n\n \n\nCalderon’s dramas, but early set the book aside. A dull afternoon after a good sun morning, and great clustering clouds. So far no parades beyond a roll-call this morning, and a rumoured promise of double innoculations against ‘flu’ and ‘Meningitis’ starting tomorrow.\n\nLeave Notes.\n\nYesterday morning to Georges at the top of Park St. in Bristol with a great bag of books for posting. On Thursday from Southgate with two bundles to Mr. Mayhew for packing and posting. So the accumulated books of two years handed over for forwarding to Aust.\n\nA good edition of Boccaccio bought in Charing Cross Road, and an American Press edition of Swinburn’s first series of \"Poems and Ballads\". From another shop, Ezra Pound’s ‘Lustre’, and a well printed book of Ben Jonson, from Mudies, the Cuala Press \"Responsibilities\", and from Smiths at Bristol, the","40":" number of \"Form\" – at 3\/-.\n\nWhile in London\n\n \n\nspent an afternoon at Kensington, and ordered the more effective photographs of the sculpture of Mestrovic, including three camera studies by Hoppe, one of these, ‘The Slave’ unmounted, the remount and frame. Then the problem will be a selection of wall pictures: I’d intended calling at Les Warners for one of his Medici prints, but book buying left me too short.\n\nTime for selecting later. D.V.\n\nOn Wednesday afternoon took Aunt Louie in to the Canadian War Paintings’ exhibition. They’re a great collection, including some splendid Road Paintings of Nevinson, and a few wounderfully effective colour prints (?) of Nash. Sims’ big picture, ‘Sacrifice’ is very fine, and his design most original. The only false note is a stretcher squad carrying \"shoulder high\" over country of deeply pool’d mud, through heavy thread rain. As a design and painting it is both stronger and more effective than Brian\n\n \n\nShaw’s finely drawn decorative panel.\n","41":" morning met Jake in Victoria Street, on Tuesday morning, from hospital, he went out to the Pearsons, and arrived there an hour after Mrs. Pearson had died. Spoke to him of Dorothy – and found he’s in love with Phyllis, and waiting Mr. Pearson’s return for his consent on their engagement: Phyllis is 18.\n\nJake has changed in the two years and his old pagan expression has lost its rich beauty. Perhaps Phyllis may change him again, yet it seems he’s played rather too hardly since Wimeraux days, and his old beauty seems rather foreign to the Jake of Friday. Phyllis remains his saving hope.\n\nUtterly fed up with this dull backless note book, so start on one bought in Victoria St. on Friday.\n\n"}}