{"Document Name":{"0":"Diary_0113","1":"Diary_0113","2":"Diary_0113","3":"Diary_0113","4":"Diary_0113","5":"Diary_0113","6":"Diary_0113","7":"Diary_0113","8":"Diary_0113","9":"Diary_0113","10":"Diary_0113","11":"Diary_0113","12":"Diary_0113","13":"Diary_0113","14":"Diary_0113","15":"Diary_0113","16":"Diary_0113","17":"Diary_0113","18":"Diary_0113"},"Date":{"0":"unknown","1":1123.0,"2":1136.0,"3":1137.0,"4":1138.0,"5":1139.0,"6":1140.0,"7":1141.0,"8":1145.0,"9":1152.0,"10":1153.0,"11":1154.0,"12":1155.0,"13":1156.0,"14":1166.0,"15":1167.0,"16":1168.0,"17":1169.0,"18":1383.0},"Entry":{"0":"\nOn Monday, 8\/1\/17, I arrived at Calais at 12.30 p.m. After a walk of about 4 miles through rain, slush and mud, we boarded the train which departed at 4 p.m., arriving at Etaples at 9.30 p.m.\n\nWe wandered about looking for the camp till 11 p.m., and finally we were allowed to sleep in the mess room, as no tents were then available. We arose at 6 a.m., and had to stand about in the rain till 10 o’clock, when we were allotted tents which leaked very badly, so that all our\n\nblankets and kit got very wet.\n\nOn the ","1":" we were issued with gas masks and in the afternoon we had them tested by marching through a trench in which gas had been released.\n\nThat night I had leave from 5 till 8 and paid a visit to Etaples where I purchased a couple of souvenir brooches. The streets were very dark, so there was not much to see and things were very dear.\n\nOn Wednesday, 17\/7\/17, we left Etaples at 8.30 a.m., and caught train to Albert, arriving at 4.30 p.m. On the way we got out of train and had snow fights, as it did not go more than 3 or 4 miles per hour.\n\nAt Albert I saw Notre Dame Cathedral, which was shelled by Germans, as also was the whole of the town, leaving every place a mass of ruins. That night the roar of the guns was deafening, as we were not more than 5 or 6 miles from the line.\n\nOn Thursday we went to Buire, 6 miles away, stopped the night, and at 4 p.m. Friday marched to Franvillers, about 6 miles away, where we were billeted.\n\nOn","2":" left Franvillers and walked to Havernas, 18-20 miles through snow-clad country.\n\nOn","3":" left Havernas and proceeded to Wargines. Left Wargines on","4":" and went to Franvillers. I was riding a mule in a team of 6 and the road was frozen that hard that it was like a sheet of glass and my mule came down. I then\n\nwalked, and the mules slipped several times on the slippery road. We eventually arrived at 7 p.m.\n\nEvery day we take horses and mules to Heilly, about 3 miles away, for water, morning and afternoon.\n\nOn Monday, 12\/2\/17, left Franvillers and went to Behencourt, 3 miles away.\n\nOn Wednesday afternoon,","5":" I took a walk to Pont Noyelle, and arrived back in time for tea.\n\nOn Saturday, 17\/2\/17, I had a day’s leave and visited Amiens. Left at 8.15 a.m. and walked to Pont Noyelle where I caught a motor lorry and arrived at Amiens at 9.45 a.m. I paid a visit to the Cathedral which is very fine, although all the good work is hidden by sand bags to protect it from bombs. I had a ride in the electric tram and walked all over the place looking at the shops. The streets are very narrow and most of the shops are poor compared to ours. Meals are very dear, costing about 7 or 8 frs. for a dinner, and then not up to much. I purchased a souvenir table centre and then caught lorry back to Behencourt, arriving at 9 p.m.\n\nOn Thursday, 22\/2\/17, was awakened at night by a couple of rats running over my face.\n\nNext day I took a wagon to Corbie for a load of coal for German Concentration Camp.\n\nOn Saturday, 24\/2\/17, took a team of horses to Albert and brought back a wagon. Could not get anything to eat there as there are no civilians.\n\nOn","6":" bought some rolled oats and took it to French-woman to cook. We had to explain the process to her, as she had never seen porridge before. We gave her and her husband some and they were delighted and at once gave me an order for a tin.\n\nOn Tuesday, 27\/2\/17, left Behencourt and went to Frechencourt, about a mile away. The mud here was up to our knees.\n\nOn Monday, 5\/3\/17, had leave to Amiens again.\n\nOn Thursday, 8\/3\/17, took a wagon to Querrien, a few miles away, and brought back a case of beer for the officers’ mess. While away we struck a heavy snow-storm.\n\nBefore returning, we went to La Houssoye for some springs, which were not there.\n\nOn Monday, 12\/3\/17, went to Albert for a load of stores.\n\nOn Friday went to Corbie through Daours for a load of coal for prisoners’ camp.\n\nOn Monday, 19\/3\/17, went to Albert for a load of stores.\n","7":" took water cart to Behencourt for Officers’ Mess.\n\nOn Thursday, 22\/3\/17, joined the 103rd Bty., at Ginchy (Somme). Left Frechencourt 9 a.m. and got there at 8 p.m. Forests all shelled, mud and shell-holes everywhere. Slept on feed heap that night and found a dug-out next day. Every village up here, i.e., Ginchy, Pozieres, Flers, are\n\nall reduced to the ground, not even a brick left standing to mark the place, only a sign-board.\n\nWe have a Lieutenant (now a Captain) over us who is a German. His people are interned and he is pro-German in every respect, treating us like a lot of dogs. Is it right that such a man should be in his position? His proper place is the Internment Camp, and not to be free where he can do untold harm.\n\nOn Saturday I took some stores up to the guns on pack mules. On the way back my mule rolled in a shell-hole full of water, without waiting for me to dismount. He got up after about 10 minutes and I rode on the pack saddle the rest of the way.\n\nOn Monday, 26\/3\/17, my friend and I put a chimney in our dug-out which proved a great success.\n\nOn Tuesday, 27\/3\/17, I took another trip to the guns. On the way, the mule I was riding got bogged in mud up to his belly, with the result that I got tossed into it, so that I was mud from head to foot. Coming back, we took the wrong track, which led us into a wood that had been shelled heavily. The path was barred by shell-holes, fallen trees, masses of bricks, etc., and it was with great difficulty that we succeeded in penetrating it and finding our way home, at which we arrived about 1 ½ hours late. In many places we were forced to let the mules go, as they refused to follow us, and we had great difficulty in catching them again.\n\nOn","8":" we left Ginchy and proceeded about 6 miles further up to the guns. We left with 6 mules and 2 horses in a wagon, and soon after starting we were going over a shell-hole when the king-pin of the wagon broke, causing the front wheels to leave the rear ones. We unloaded the wagon, and after a delay of 2 hours, whilst the blacksmith was making a new pin, we succeeded in fixing the wagon up again. Before going much further we got stuck in the mud and had to get the assistance of 2 more horses, making a total of 10 animals. The road was in a terrible state with mud and shell-holes and we got stuck again. To get out we got 6 more horses, making a total of 16, and with great difficulty, after unloading the wagon, succeeded in getting another start. The road was so bad, that out of 4 wagons that left, 2 capsized, 1 broke the pole, causing the front wheels to be pulled clear of the wagon, and our wagon broke down. The mules and horses came down several times in the mud and shell-holes, and we arrived at 4 p.m., doing 6 miles in 7 hours. Only 3 wagons succeeded in reaching their destination that night.\n\nOn Sunday, 1\/4\/17, we took 20 horses to drag the remaining wagon out of the mud. While we were away, a taube brought down an observation balloon, about a hundred yards away, in flames. The two observers both landed safely in parachutes.\n\nOn Monday, 2\/4\/17, a Taube came over several times, but was driven away by our guns. Twice while we were on parade, \n\nwe were ordered to scatter, and once to remain motionless. In the afternoon I went some distance with a wagon for provisions, during which time it snowed hard.\n\nOn Tuesday, 3\/4\/17, I left the 103rd Bty., and joined the","9":" Bty., about a mile away.\n\nOn Thursday, 5\/4\/17, took guns into action about 4 miles further up. The shells were bursting round about us and could be heard whizzing through the air, so, as soon as the guns were in position, we lost no time in getting away.\n\nOn Friday afternoon, I took a trip to the guns with provisions.\n","10":" we shifted guns to new position, as Germans were making it that hot that the guns had to be abandoned. We left in the afternoon, and travelled part of the way and waited till nightfall. We then proceeded under cover of darkness and succeeded in moving the guns and ammunition. We got back to camp at 6 next morning.\n\nOn Sunday, 8\/4\/17, we moved our camp back to Forest, about a mile away, where we were before (Villers Au Flos). \n","11":" went and pulled some wagons out of the mud with mules.\n\nOn Tuesday, 10\/4\/17, we shifted our guns further up. We left at 1 p.m., and, during a violent snow-storm, succeeded in shifting them, arriving back at 11 p.m. On the way back we lost our way in the dark. I was in the lead, so I just let my mule go his own way and, sure enough, it was not long before we were home.\n\nOn Wednesday, 11th, we had about 3\" of snow.\n\nOn Thursday, 12\/4\/17, took guns up a couple of miles further. Got word to turn out at 6 p.m., during a heavy snow-storm. Succeeded in shifting guns and ammunition. While shifting the latter, the back of the wagon came open, unknown to us, and half of the shells dropped out. When we told the Major, he simply asked \"Did any go off?\" When told \"No\", he replied \"It was lucky for you.\"\n\nOn the way home, the mules just had the harness on, and we were riding one and leading the other, 8 mules altogether. As we were going through a field, riding at ease, i.e., reins hanging loose and feet out of stirrups, all of a sudden one of the mules took fright, probably at the noise of the shells bursting, and before we were aware of it, the whole eight had stampeded, and were dashing headlong across the field.\n\nBefore going very far, my mule got tangled in some wire and came down, and I took a doubler over his head. I got up, but no one else was in sight, as it was pitch dark. I caught my two mules and, after a good deal of trouble, we all found one another again, arriving back at 2 next morning.\n\nOn Friday, 13\/4\/17, we shifted our camp a couple of miles nearer the guns (Velu Wood, near Cambrai).\n\nOn Saturday night we shifted the guns to a new position. Left at 4.30 p.m., and got back at 12 midnight.\n\nOn Sunday morning, about 9 a.m., the Germans put a few shells near our horse lines. One landed about 20 yds. from\n\nwhere I was, completely uprooting a huge tree, with a diameter of at least 4 feet, which came down with a crash. Pieces of dirt, etc., fell round about me. We got the order to shift our horses to a safer place for the time being.\n\nOn Sunday night, 15\/4\/17, we were hauled out of bed at 10 p.m., harnessed up our horses and proceeded to the battery, where we stood by till 7 a.m., in case the Germans hopped over, as the infantry at this point was not strong enough to repel an attack. I had breakfast and got to bed at 8 a.m., but was pulled out at 11.30 a.m., and after harnessing up our horses, stood by the guns till 6 p.m. I then went to bed (as it is best to get a bit of sleep when possible) but was pulled out at 1.45 a.m., to shift the guns, which we did before daybreak, arriving back at 6.30 a.m. I had breakfast and went to bed, but was pulled out at 7.45 a.m., to take a load of ammunition to the guns, arriving back at 10.30 a.m. Turned into bed, but was pulled out at 1.45 p.m., to go for a load of ammunition, arriving back at 4.30 p.m.\n\nWe got rather a bad spin of food here, as we were only issued with a very small quantity of bread, and biscuits were unobtainable, and the nearest place where anything could be bought was Albert- about 20 miles away, so you can guess that we felt the pinch.\n\nOn Tuesday night, at 11.30, we were pulled out of bed to harness up and stand by the guns all night, in case the Germans hopped over. Unharnessed at 7 a.m. next morning.\n\nEvery village that we come across has been destroyed by\n\nthe enemy- houses blown up, fruit trees ruthlessly cut down, also ornamental trees.\n\nEvery night we would harness up before going to bed, so as to be ready to turn out at a moment’s notice to shift the guns, if the Germans advanced.\n\nOn Thursday, 19\/4\/17, two spies were discovered, dressed as Australians, who had telephonic communication with German lines. They were evidently giving our gun positions away and all information connected with us. We also noticed that 5 horses were missing out of our batteries.\n\nOn Saturday, 21\/4\/17, went up to battery after dark for a load of empty shell cases. Got back at 11 p.m.\n\nOn Sunday, 22\/4\/17, a taube brought down another of our observation balloons at 1 p.m. He flew just over our heads, and there was a great clatter of anti-aircraft guns and machine guns.\n\nOn Tuesday, 24\/4\/17, went to Frechencourt for horses. On the way we passed through Bapaume and stopped the night at Albert and arrived at 12.30 p.m. Wednesday.\n\nLeft Frechencourt at 3 p.m. Thursday and arrived at Albert at 6.30 p.m. Stopped night and got to Velu at 4.30 p.m. Friday. On the way to Albert the brake of the wagon went wrong; we stopped to fix it and got behind the others. While trotting to catch up, some blankets and a bag of bread fell off and were left a long way behind and, of course, we had to go back. While watering at Albert, the bit pulled out of my mule’s mouth, and she bolted, finally tossing me off. I escaped with a few nasty scratches on face, and\n\nstiff back.\n\nThe officers of our unit are very much disliked; they treat the men very much like dogs, so much so that several times they have been counted out. Take for instance a conscientious man, who does his work well but, for some unknown reason, is not in the good books of his officer. This man may be had up for a petty offence of which he is practically innocent. He goes before the O.C. but gets no satisfaction from him, so asks to see the Colonel. Well, before this man sees the Colonel, his O.C. does, and tells the Colonel that he does not want the man, or something of the sort, so that long before the man is tried his punishment is fixed. There is absolutely no fairness whatever, and the heads win every time.\n\nOn Thursday night, 3\/5\/17, at 11.30 I was awakened and told to stand ready with our gas masks as Fritz was sending some over.\n\nFriday morning took a water cart and provisions up to the guns. On way back, a couple of shells landed about 10 yds. away. Pieces of dirt fell all over us and the mules bolted all the way back with fright. We were just going over a rise at the time, and must have been observed by Fritz, who is a fairly good shot.\n\nOn Saturday, 5\/5\/17, we moved our camp to other side of wood, as we were too near some 12\" guns.\n\nOn Tuesday, 8\/5\/17, took water cart to guns.\n\nFriday, 11\/5\/17, Fritz shelled wood all day, and I saw\n\na couple of tents, harness, etc., blown sky-high. One shell lobbed inside a humpy, but, as luck would have it, the occupants left a few seconds before. The neighbouring trees presented the appearance of a clothes line – pieces of blankets, trousers, etc., were hanging on the topmost branches.\n\nOn Saturday, 12\/5\/17, took water cart to the guns; we were evidently observed by the Germans, for, before we got there, he opened fire on us. I had great difficulty in getting the mules to go. The Major ordered everyone to cover, but I had to stand and hold the mules, who were terrified. One of the fellows got wounded. After the cart was emptied, the Major told us to go back as fast as we could, and the mules needed no urging.\n\nOn Monday, 14\/5\/17, we shifted from Velu and camped night near Albert at Pozieres. Left next morning and arrived at Behencourt in afternoon.\n\nLeft","12":" Battery and rejoined B.A.C. on Wednesday.\n\nOn Saturday, 19\/5\/17, the whole Artillery of the","13":" Division was inspected by General Birdwood.\n","14":" left Behencourt and entrained at Albert; travelled all night in a cattle truck and arrived at Bailleul at 9 next morning. Went by road to Kent Camp near Neuve Eglise.\n\nOn Sunday night left at 10 p.m. to load ammunition for the guns; worked hard till 1.30 a.m., loading wagons, and then hopped on a wagon, coming home as I thought. It happened to be a wagon of another unit, which took us out of\n\nour way. Another chap and myself got off and wandered about the country; at one time we were only 500 yds. from the trenches. We finally found our way home, arriving at 4.15 a.m.\n\nOn Thursday, 31\/5\/17, saw taube bring down one of our observation balloons, which was afterward itself brought down in flames.\n\nOn Saturday, 2\/6\/17, was sent to ammunition dump near Ploegsteert (Messines Stunt) at 7 p.m. The work is very hard, as we work from 9 p.m. till 4 a.m. without a stop. \n\nOn Sunday night left for dump at 8 p.m. Arrived there and took one load to guns. The shells were flying round pretty thick, and several came unpleasantly close. One blew up an old house, and a full-sized brick landed only a foot behind me, smashing an ammunition case to bits, in the wagon. We were very lucky that the whole wagon full did not blow up, which would have been the case if the brick had hit the cap of a shell. When at the guns, a man was wounded by a shell. We got back to the dump and while loading wagon saw an adjacent dump blow up. Gas shells commenced to fall thickly around us and we were forced to put on our gas masks. Fritz now began to shell the dump on which we were working and made it that hot that we had to clear out, but, no sooner had we gone, than the dump, consisting of thousands of rounds of shells, blew up. Several of our fellows got killed, also a large\n\nnumber of tommies. We now made straight for home, not waiting to unload our wagon. On the way back, a shell lobbed just behind our wagon, killing two mules and wounding the rest of the wagon in rear of us. The chaps in our wagon got covered with the debris. We arrived back at 11.30 p.m. after an exciting night.\n\nOn Monday morning, one of the mules that was left for dead returned home, but died soon after.\n\nOn Monday night, we left for dump at 10 p.m., but had to turm back as Fritz was shelling the road and it was impossible to pass.\n\nOn Tuesday night left at 10 p.m., but had to go a roundabout way, as the road was being shelled again. We worked all night with our gas masks on, as gas shells were falling fast, and arrived back at 4 a.m.\n\nOn Wednesday afternoon went to dump that had been blown up to fetch back a couple of wagons that had to be abandoned on the previous night. Both wagons had a couple of wheels blown off by shell-fire, and knocked about generally. On the way the road was being shelled. While waiting to pass, a dud, i.e., a defective shell that fails to burst, landed just at our feet. If it had exploded all of us would have been blown up. We cleared back round a different road and succeeded in repairing the wagons and bringing them back.\n\nOn Thursday went to dump, but had to leave as the Germans commenced shelling it. One man was wounded in the back.\n\nOn Friday, 8\/6\/17, I rejoined the B.A.C.\n\nEach night, while at the dump, it was impossible to hear one another speak as the artillery resembles continuous thunder of intense variety, lasting from sunset to sunrise.\n\nOn Sunday, 10\/6\/17, took a walk to Steenwerck after tea and went to pictures.\n\nOn Tuesday, 12\/6\/17, Fritz shelled the village. People left their homes to seek safer quarters, carrying their belongings with them. One shell blew up a house, but no one was in it at the time. I afterwards saw the poor chap hunting among the ruins for his belongings, some of which he was collecting in a bucket. Another shell killed two girls, while another landed in a back yard but, luckily, it was a dud.\n\nOn Wednesday I joined the","15":" Battery.\n\nOn Sunday, 17\/6\/17, we shifted camp to the other side of Neuve Eglise.\n\nOn Monday rejoined B.A.C.\n","16":" 20\/6\/17, three taubes came over and brought down two observation balloons. The same day my wheel driver got wounded in the neck, also another chap and a couple of horses. In the night took a trip to guns with ammunition on pack horses, as the road was nothing else but shell-holes. We left at 9 p.m. and rode to dump, packed our horses and led them about 3 miles to guns. Got back at 12.30 a.m.\n\nOn Thursday, 21\/6\/17, took ammunition to guns. Left at 9 p.m. and got back at 2 a.m., after doing two trips. \n","17":" Fritz came over and brought down three balloons one after another, also the observers out of three others. Whilst this excitement was going on the air was alive with parachutes, each with a man hanging to it. There were twelve in the air all at once. On Saturday night I had another trip to the guns with ammunition. Left at 9 p.m. and got back at midnight.\n\nOn Sunday a taube brought down another of our balloons. \n\nOn Monday, 25\/6\/17, saw one of our planes bring down a taube.\n\nOn Wednesday Fritz brought down another of our balloons.\n\nOn Friday, 6\/7\/17, went to Ploegsteert on salvage work all day.\n\nOn Sunday, 8\/7\/17, I went to Calais for remounts. Left at 5 a.m. and caught train at Steenwerck at 8 a.m. Changed at Hazebrouck, where we had a look over the town for a couple of hours, during which time we had breakfast at a shop. Left Hazebrouck at mid-day and got to Calais at 4 p.m., where we had a 6 mile walk to the remount camp. Left 7 a.m., Monday, and the horse I had happened to be a buckjumper. I managed to stick on but, later, during a bucking exhibition, lost my mule that I was leading. We caught the mule after travelling about 6 miles further along the road. We reached our camping ground at 3 p.m. and stopped the night. That night a couple of us walked to a village about 2 miles away\n\nand had a good supper of eggs. We moved on next morning and camped outside Hazebrouck. On the way we passed through St. Omer and a couple of other towns. That night had dinner at Hazebrouck, and met officer who told us that our unit was on the move and was camped a couple of miles away. We left next morning and joined B.A.C. a couple of miles away. \n\nOn Wednesday night had dinner at Hazebrouck again.\n\nOn Thursday morning we left at 1.30 a.m. and travelled till 9 a.m., camping about 2 miles from Wormhaudt.\n\nWe left at 2 a.m. next morning and arrived at Ghyvelde (10 miles from Dunkirk) at 9.30 a.m.\n\nOn Friday night I went for a swim in the canal and several times afterwards went in the surf, about 4 miles away.\n\nOn Tuesday, 17\/7\/17, I went to the pictures after having a swim. It is impossible to buy anything in the eating line or matches at Ghyvelde, but we used to buy potatoes from the farmers.\n\nOn Thursday, 19\/7\/17, I had the afternoon off to visit Dunkirk, arriving back at 9 p.m.\n\nOn Saturday afternoon we took the horses for a swim in the surf, getting on their backs.\n\nOn Saturday, 4\/8\/17, I went to Dunkirk again in the afternoon, through St. Malo, from which place I caught the tram.\n\nOn Friday, 31\/8\/17, we moved from Ghyvelde at 8.30 p.m. We travelled all night till 8 next morning. Left at 11 p.m. Saturday night and travelled at Steenwoorde, arriving at 8 a.m.\n\nOn Sunday night bombs were dropped round about, one of which totally destroyed 5 shops and damaged several others. While here I took a walk into the town after tea every night.\n\nOn Saturday, 8\/9\/17, left Steenwoorde at 1 p.m. and travelled to Dickebusch, arriving at dark. The next day at 1 p.m. a number of taubes came over and dropped bombs round about. I saw three of these explode about a hundred yards off, one of which killed or wounded about 40 horses and some men.\n\nOn Monday we were told to make our humpies bomb-proof, as far as possible, by making a mound of dirt round them.\n\nOn Monday Fritz brought down one of our balloons with shrapnel. The observers, after dropping out 3 bags of sand and a parachute, to lighten it, descended with the balloon.\n\nOn Tuesday night we left Dickebusch and camped about 6 miles away.\n\nOn Wednesday morning at 2 a.m. I was pulled out of bed to go up to the guns with ammunition. Our guns were situated the other side of Ypres so, on the way we passed through the town of Ypres, which is a mass of ruins, not one whole brick being left. We got back at 7.15 a.m. That night I left for the guns at 6 p.m. The night was pitch dark and the country one mass of shell holes. At 10 p.m. I was sitting on the wagon, when suddenly the wheel went down a shell hole and I was thrown off, the wheel passing over my foot, fracturing same. I was assisted on to \n\nthe wagon again, where I clung for 3 hours, minus a hat, which blew off and got lost, and raining hard all the time. We could not find the guns, so the ammunition was taken back to the outskirts of Dickebusch to be taken up next day. As I could not wait till the wagons returned to camp, the officer lent me his horse and I rode to the dressing station at Dickebusch, arriving at 1 a.m. I had my foot bound up and waited till 6.30 a.m. for an ambulance which took me to a hospital at Geddesvelde ?, arriving at 8 a.m. I had an X-ray photo taken of my foot and on Friday afternoon at 4 p.m. left by ambulance and was taken to ambulance train, at which I arrived at 5 p.m. I was on the train till 3 next morning, Saturday, 16\/9\/17, (Etaples) and took motor ambulance to American hospital at Camiers, arriving at 4 a.m.\n\nOn 17\/9\/17, I had my foot and leg, as far as the knee, set in plaster of Paris.\n\nOn","18":" I left Camiers Hospital for England at 4 a.m., travelled by ambulance to Etaples and from Etaples by train to Calais. A couple of Fritz stretcher bearers carried me on to the boat and, after a short but rough trip, arrived at Dover. I was then put on a train and travelled to Croydon, where I went by motor ambulance to Hospital, arriving at about 10 p.m.\n\nThis ends for the present my little diary, and I sincerely hope that the war will be over before I see France again.\n\n"}}