{"Document Name":{"0":"Diary_0119","1":"Diary_0119","2":"Diary_0119","3":"Diary_0119","4":"Diary_0119","5":"Diary_0119","6":"Diary_0119","7":"Diary_0119"},"Date":{"0":"unknown","1":1493.0,"2":1499.0,"3":1500.0,"4":1501.0,"5":1502.0,"6":1511.0,"7":1512.0},"Entry":{"0":"\n\nimpression of that visit upon my memory will for ever remain indelible. The vision of the Dead Sea is something alone & incomparable in fact my visit to the Holy Land is something I shall never forget & I only wish that the time may come when I can \nhave at least\n spend a few week we leave here tomorrow @ 7 pm for Dieran.\n\nbetween the two chapels is an alter, on the place where Mary received the body when taken down from the Cross, & as Ihad nomore time to spare I made my way back to camp had dinner & visited the dead sea where Capt Hurley took Photos. The dead sea is the lowest known spot on the earths surface being 1292 feet below the Mediterranean sea 3786 below Jerusalem & 4012 below the summit of the Mount of Olives. Though sadly lonely & desolate the dead sea & its surroundings have a very distinct beauty & charm of their own the\n\nI got permission to again visite the old city & went to the Via Dolorsa & walked through the streets that christ took on his way to \nthe\n calvary accourding to tradition.I next went to the chapel of the Rising of the Cross on calvary. In the apse beneath the altar is \nthe\n shown the hole, now lined with silver where the cross was fixed; the positions of the crosses of the two thieves are also marked on the floor. To the south of the chapel & separated from it by two piers only is the Latin chapel, marking the spot where Christ was nailed to the cross, and\n\nthe old city we made our way to the Garden of Gethsemane it is now kept in order by the Franciscan monks & is in \nbeat\n beautiful order. At intervals along the garden path arranged the fourteen stations of the cross & in the garden are a few ancient olive trees, though it is improbablethat any are remaining here which were in existence in the time of Christ. Near the garden is the grotto of the Agony & a few paces farther is the Virgins Temple. After seeing a few more places of interest we returned to camp our campingplace being on the top of Mount Zion.\n\n","1":"\nAs Capt Hurley dose not require me until after dinner\n\nthrough the Jaffa gate we find \nouselves\n ourselves in the midst of a gay and busy scene. Men womenchildren camels asses and horse are constantly passing & repassing in either direction, and after a few steps we come to a large open space or square where the natives from the surrounding villages are generally exposing their goods for sale, this may in fact be called the market place of Jerusalem, on one side is an arcade of shops where all kinds of curiosities etc are sold on the other side stands the tower of David @one time a turkish garrison. After seeing a good many of the sights in\n\nbodice & a simple hemornament of the skirt carelessly tucked into the waistband on one side. A flowing white linen head dress reaching to the hips on which is lavished the most beautifully designed embroidery. Erect & free she steps in raw hide shoes blending in perfect harmony with her suntanned ankles, but the pity is that so few are to be seen nowadays. The main entrance to the town is through the Jaffa gate on the west side. From sunrise to sunset a never ceasing throng moves to & fro. Jews steal through the crowd with bent shoulders &downcast eyes betraying their history of oppression. Immediately on entering the old city\n\ntowns old Jaffa is filthy & smelly. Around the town are many fine old orange groves, the fruit being @ present ready for market. We went into one of the orange orchards for 2\/- worth & returned with a great sack of \na couple\n two hundreds. We returned to Dieran via Rishon a pleasant throughrough journey of 20 miles.\n\nSee letter N. B. for","2":"\n\nattended by natives. From the dump @ Ramleh we motored over the dusty & bumpy road to Jaffa. Jaffa is much modernised & has lost most of its attraction, I was much interested however in the landing of railway materials which is at present going on. The cargo vessels lie out to sea & the staffare ferried in by Surfboats. The port is extremely treacherous as the boats have to pass through a narrow waterway between the rocks of Andromede, & even when inside the reefs there is barely enough water in which to swing them. There is some fine color in old Jaffa the walls being painted a variety of tints with here & there glimpses of the deep blue mediterranean. Like all their villages & \n","3":"\n\n25th,\nUp @ 6 am & off to Ramleh where @ the present time a huge dump of materials is accumulated & distributed. The materials are brought by camels from the rail head near Dieran & from the costal landing @ Nahr Sukerier, great strings of camels miles long heavily laden discharge their cargos daily & present such a scene of life & bustle, winding in & out amongst the cactus hedges & across the dusty plain\ns\n as Ihave never seen before over 8,000 animals are so employed, and are\n\n\n\nnorthSouth & west large Jewish settlements are to be seen, and tiny cottages have everywhere arranged themselves in tortuous alleys & in many cases no alleys at all so hopelessly confused as to make it almost impossible to locate any one of them. One of the most lamentable influences of the West is the gradual extinction of national dress. Some ofthe women are still to be seen dressed in their national dress & they are dressed like a woman & not upholstered like an armchair. Her dress consists of a white coarse linen robe, with tastefully embroidered\n\nJan 21st\nLeft Dieran at 7 am in a ford car for Jerusalem. With a \nfine\n beautiful morning favouring, we had a fine through bumpy run to Latron which is at the foot of the hills & we began the assent of the foothills along the road to Jerusalem. After a four hours run through mountanious country we arrived @ the old city of Jerusalem. The Jerusalem of today cannot be termed a typical oriental city, inside its walls its Eastern character has been generally preserved but in recent years European influence has been great.Without the walls a new town has grown. To the\n\njust in time to keep an apointment to photograph the staff.\n\nJan 19th\nSpent day at Desert Corps Dieran helping Capt Hurley to develope & bring work up to date.\n\nJan 20th\nTo Rishon L.E. Zion a delightful Jewish village six miles from here spent the day taking photos of the Anzac Mounted Division also took a series of Photos of their attached Mountain Battery & Singnallers.\n\ngolden light. The olive trees turned a vivid green & the very rocks seemed to reflect the golden rays. It was beautiful & scarcely have I enjoyed myself more. The ride back in the car was an odeal through slimy mudas far as Ramleh. We requisitioned natives whereever possible & made all sorts of detours by cutting down cactus hedges & using the leaves the roads. The road is in a fine condition from Ramleh & leads through orchards & vineyards which now are springing into life. The ground is ablaze with a beautiful little flower like the milk thistle amongst which the red rununculi are beginning to blossom. We arrived at Dieran at 10.30 am\n\nmove. The country is extremely difficult for an attack on our part favouring the defensive on account of its natural cover. The forces however, which we are contending are a rabble & disappear with any advance made. Jaffa was clearly visible & many other villages nestling in the hollows or on hill crests, stayed the night @ Hdqrs & returned to Dieran @ day break the following morning.\n\n18th Jan\nUp at 5 am & away shortly after 6 am. The early morning ride over the mountains was most enjoyable. The sun came up in a serenily blue sky gilding the mountain tops & blazoning Nalinwith a flood of\n\nlimestone formation. A little beyond Meidia we took to horses the roadway being impassable for cars. The way led us across mountain sides steep & rocky, to the hed of a wady which we followed for a few miles & here the scenery was very grand. The mountains are just great boulders of limestone & though not of great height, present great problems for transport. We passedby the bare of the hills on which is build the fine village of Nalin. Reg & Hdqrs being just opposite of fighting, there is none, the turks hold ridge about 1500 yards away & apparently are unwilling to make any aggressive\n\ncombined assistance however of numerous natives & our four selves we managed to force a passage. The little ford stuck to the heavy work wonderfully & I am loud in praise of these cars for the difficult & heavy work which befalls them Meidra is on the top of a high rise & commands an extreme view across the plains & flat country right away to the sea. It is a superior village as far as residencesisconcerned being for the most part of stone which is quarried in the vicinity And here the land itself undergoes a great change, from the clay & sand patches of the plains There is an abrupt change into hilly country of\n\nwe sank in axle deep, & when all got out to push which we did every100 yards or so the skidding wheelssprayed us with mud. Still it was marvelous how the little Ford with our assistance forced a passage through the quagmire &eventuallysucceeded in reaching our destination. We only had a glimpse at Ludd charming in the morning sunlight & especially beautified by date palms as we had to push on to Meidia and push it was for the recent rain followed by the sun had converted the soft pathches into deep mud. \nholes of grea\nt It clogged our wheels& the car sank in to the footboards. With the\n\ndo them a deal good, are bedecked in a variety of colors. The green cactus he\na\ndged roads, along which a number of donkeys are now coming heavily laden with golden organges, wind across the fields now asprout with barley.\n\nJan 17th\nLeft Dieran 7 am in a box Ford car. The recent rains have beat down thesandy track to Ramleh & caused the grasses & orchards through which we passed to spring into shoot.\n\nBeyond Ramleh we made for Luddbut the changing soil which is heavily cut up by military traffic gave us a great deal of trouble. Frequently we\n\nvillages is the waterwheel this remarkable structure is moved by a donkey, which lifts the the water in small buckets& dischargesthem in to a large reservoir. Around the valve of the reservoir the (bynts) women collect with their big terracotta water jars & discuss, no doubt the gossip of the village. They carry away the heavily laden vessils balanced on their heads, with a gait & erectness truly enviable. But the colors are the greatest charm evan the small boys cloths are repaired with multicolored patches & the women \nthey\nthough appearing as if a good bath would \n\nnarrow laneways & in many other pictorial settings. It is amusing what the troops will do for the camera. The verious Bdgs have been marshalled & all in turn have passed before the\ncan\nCamera. They have all keenly taken their part.\n\nThe residences of Z are just a series of dingy hovels huddled together like swallow nests & risen entirely from mud. The roofs\nbeing covered with acover\n are thatched & mudded & now that spring is drawing nigh grass is beginning to make them verdant with young shoots; But the most interesting sight of Z & in fact most other\n\nJan 16th\nWent to Zernukah a native village a few miles from Dieran beautiful weather favoured an enjoyable trip made a trifle exciting by the Ford C-- getting stuck in the mud. We requisitioned the energies of some passing bedouins & soon got on the road again. Zernukah like many other similar villages is built on a hill slope its approaches being hedged by fine avenues of Cactus. The sheik gave us all assistance possible & all the rest of the indolent ragged population & the ever accompanying crowd of small boys joined in. Cpt H. had the 2nd Regt. paraded throughthe \n\n& are quite clean & convenient, afternoon we visited a large camel camp where over 6,000 beasts are tethered, \nevening\ndeveloped a number of color plates which turned out excellent.\n\nJan 15th\nRemained at Dieran helping Cpt H develop the results being very good.\n\nBeautiful mild weather with blue sky making Dieran more beautiful than it is. The little red tiled houses nestling amidst the green gum trees is just like\nhome\n& how I long to be their once again.\n\nJan 13th\nThe rain came down in torrents all night & has continued to day accompanied by heavy lightening. The Bdge in Bivouacs (Bivvys) were washed out & are having a miserble time. We are now attached to desert Coys again.\n","4":"\nHeavy rains & thunderstorms continued through the night but cleared into glorious sun shine during the morning Cpt H--secured two rooms to day for \nthe use of del\nhis photographic requirements close to hand &we spent part of the day fitting them up. The new workrooms are part of a house occupied by a Yiddish family.\n\nrain came down in a deluge flooded the roads & brought the Waddies down gushers. The journey was concluded soaked through & splashing through a mud sludge churned up by the thousands of troops. The T'port was held up by their frequently sinking axle deep in the soft ground & the flooded streams.\n\nJan 13\nThe Bdge went into a wet Bivouac about a mile from Dieran. Capt H. & myself rode on into Dieran where we put up for the night at the town hall where we were able to dry our cloths & get a good meal.\n\nacross\nstreams\nover rises into valleys across streams it pushed its way impressively. The men were in high spirits & the horses in good fettle. I rode a little pony by the name of Abdul. Abdul is a great favourate amongst the men & is a capture from the turks @Bersheba . He is one of the most perfect little creatures Ihave ever set eyes on a perfect model of Arab breed & blood.\nGoaing\nGoing however was bad the roads were still sticky & treachous holes from the recent rains but in spite of this difficulty we made good progress. The good weather was threatening a breakdown which threatening was realised more speedily than \nantrap\nanticapated. The\n\n& the manoevures even excited the Generals admiration. The General who is famed for his generality gave a fine display of boomerong throwing in which he is an expert. The 1st & 2 Bdge are moving towards to Dieran tomorrow & Capt H.has decided to travel with them.\n\n\n\nJan 12\nReville @6 am early breakfast out in the open under an old fig tree, Tents struck & the limbers packed & the column moved off @ 10 am. The seeming endless streams of men & horses winding their way across the plains. Far away from the horizon the stream moved slowly\n\nthe more impressive on account of the dead quiet & beautified by the wonderful delicate flushing of Sunset.\n\nJan 10th\nMorning spent amongst the camp. Took a limber with cameras across the sand dunes to the Wady Nahr Pukerier\n& secured\n& Capt H. secured about 800 feet of film.\n\nJan 11th\nGlorious weather visited the 2 Bdge. The Bdge paraded for pictures,a finer body of men it would be well nigh impossible to find. They sat in the saddles as though part of their horse. The discipline excellent\n\nJan 9th\nWent across to the beach @ the Wady Nahr Sukereir where a vessal is being discharged, the beach was teeming with natives engaged in the work & was one of the most animated & noisy sceens I have witnessed here.\n\nThe vessal lay out about ½ mile& a large number of small craft were ferrying the cargo ashore.\n\nWhen the bows grounded a line was hooked on & about 100 natives hauled the craft inshore. Imense dumps were formed which were being transported by thousands of camels.\n\nWe returned across the sand hills in the late evening the desert being\n\nseveral weeks are all in fine fettle. The riding was admirable & all seemed to enjoy the exercise & turnout. The immediate neighbourhood is the centre of a number of camps,so that the sand hills are always a bustle with horses & men & the unending streams of accompanying camel tports. Our Hdqs have their tents pitched in what was once an old figgery & isolated from the other camping, what astonishes one is the great size of the fig trees & the density of their growth more so as their owners apparently pay little or no attention to pruning or firtilising.\n\nendless stream of transport sank to their axles in the flood & the railway being washed away, rail Tport is again disorganised. I had a thoroughly enjoyable ride across the sand dunes to the sea at eventide with Capt Hurley. Owing to the recent winds a great sea was rolling in & no goods were being landed the cargo vessels being compelled to put tosea. Arrived back at the camp about 6.30 had dinner & then turned in for a good nights rest.\n\nJan 8th\nImprovement in weather which enabled the 1st Bdge to parade for the Camera. The horses & men which have been in rest camp now for\n\n\n","5":"","6":" Wild stormy night with Tropical deluge, conditions moderated considerably during the day & only occasional showers fell. Capt Hurley & myself went out after mud pictures in which the country is at present swimming. The great field in front ofEsdud Station was submerged about four feet & with it valuable supplys of fodder & rations. A great string of over 2000 camels had to pass over it & Ipitied the wretched creatures & their destitue drivers to see these fine beasts of the burning desert wallowing in the mud of Palestine winter, is pitiful indeed & their drivers with hardly any suitable clothing or protection from the fierce weather, it is no wonder that they perishin larg numbers. The\n","7":"\nThe rain which has been theatening much of late came down in heavey downpour during the night & has continued without cessation all day. Heavy winds also accompany it so we just had to stay in our bivouac & tell yarns, the yarns bythe way were mostly told by Capt Hurley conserning his trip to the South P. & it was very interesting to listen to him. The big flat where we had the unpleasant experience of being\nwashed\nflooded out on Xmas day is again awash & the roads impassable. The wadies have been running bankers & Tport is more or less disorganised. Thank heaven it is dry in our tent for Ilook across a dismal expance of mud where the Horse Tport & Camels are having a miserable time.\n\n"}}