{"Document Name":{"0":"Diary_0065","1":"Diary_0065","2":"Diary_0065","3":"Diary_0065","4":"Diary_0065","5":"Diary_0065","6":"Diary_0065","7":"Diary_0065","8":"Diary_0065","9":"Diary_0065","10":"Diary_0065","11":"Diary_0065","12":"Diary_0065","13":"Diary_0065","14":"Diary_0065","15":"Diary_0065","16":"Diary_0065","17":"Diary_0065","18":"Diary_0065","19":"Diary_0065","20":"Diary_0065","21":"Diary_0065","22":"Diary_0065","23":"Diary_0065","24":"Diary_0065","25":"Diary_0065","26":"Diary_0065","27":"Diary_0065","28":"Diary_0065","29":"Diary_0065","30":"Diary_0065","31":"Diary_0065","32":"Diary_0065","33":"Diary_0065","34":"Diary_0065","35":"Diary_0065","36":"Diary_0065","37":"Diary_0065","38":"Diary_0065","39":"Diary_0065","40":"Diary_0065","41":"Diary_0065","42":"Diary_0065","43":"Diary_0065","44":"Diary_0065","45":"Diary_0065","46":"Diary_0065","47":"Diary_0065","48":"Diary_0065","49":"Diary_0065","50":"Diary_0065","51":"Diary_0065","52":"Diary_0065","53":"Diary_0065","54":"Diary_0065","55":"Diary_0065","56":"Diary_0065","57":"Diary_0065","58":"Diary_0065","59":"Diary_0065","60":"Diary_0065","61":"Diary_0065","62":"Diary_0065","63":"Diary_0065","64":"Diary_0065","65":"Diary_0065","66":"Diary_0065","67":"Diary_0065","68":"Diary_0065","69":"Diary_0065","70":"Diary_0065","71":"Diary_0065","72":"Diary_0065","73":"Diary_0065","74":"Diary_0065","75":"Diary_0065","76":"Diary_0065","77":"Diary_0065","78":"Diary_0065","79":"Diary_0065","80":"Diary_0065","81":"Diary_0065","82":"Diary_0065","83":"Diary_0065","84":"Diary_0065","85":"Diary_0065","86":"Diary_0065","87":"Diary_0065","88":"Diary_0065","89":"Diary_0065","90":"Diary_0065","91":"Diary_0065","92":"Diary_0065","93":"Diary_0065","94":"Diary_0065","95":"Diary_0065","96":"Diary_0065","97":"Diary_0065","98":"Diary_0065","99":"Diary_0065","100":"Diary_0065","101":"Diary_0065","102":"Diary_0065","103":"Diary_0065","104":"Diary_0065","105":"Diary_0065","106":"Diary_0065","107":"Diary_0065","108":"Diary_0065","109":"Diary_0065","110":"Diary_0065","111":"Diary_0065","112":"Diary_0065","113":"Diary_0065","114":"Diary_0065","115":"Diary_0065","116":"Diary_0065","117":"Diary_0065","118":"Diary_0065","119":"Diary_0065","120":"Diary_0065","121":"Diary_0065","122":"Diary_0065","123":"Diary_0065","124":"Diary_0065","125":"Diary_0065","126":"Diary_0065","127":"Diary_0065","128":"Diary_0065","129":"Diary_0065","130":"Diary_0065"},"Date":{"0":"unknown","1":1588.0,"2":1589.0,"3":1590.0,"4":1591.0,"5":1592.0,"6":1593.0,"7":1594.0,"8":1595.0,"9":1596.0,"10":1597.0,"11":1598.0,"12":1599.0,"13":1600.0,"14":1601.0,"15":1602.0,"16":1603.0,"17":1604.0,"18":1605.0,"19":1606.0,"20":1607.0,"21":1608.0,"22":1609.0,"23":1610.0,"24":1611.0,"25":1612.0,"26":1613.0,"27":1614.0,"28":1615.0,"29":1616.0,"30":1617.0,"31":1618.0,"32":1619.0,"33":1620.0,"34":1621.0,"35":1622.0,"36":1623.0,"37":1624.0,"38":1625.0,"39":1626.0,"40":1627.0,"41":1628.0,"42":1629.0,"43":1630.0,"44":1631.0,"45":1632.0,"46":1633.0,"47":1634.0,"48":1635.0,"49":1636.0,"50":1637.0,"51":1638.0,"52":1639.0,"53":1640.0,"54":1641.0,"55":1642.0,"56":1643.0,"57":1644.0,"58":1645.0,"59":1646.0,"60":1647.0,"61":1648.0,"62":1649.0,"63":1650.0,"64":1651.0,"65":1652.0,"66":1653.0,"67":1654.0,"68":1655.0,"69":1656.0,"70":1657.0,"71":1658.0,"72":1659.0,"73":1660.0,"74":1661.0,"75":1662.0,"76":1663.0,"77":1664.0,"78":1665.0,"79":1666.0,"80":1667.0,"81":1668.0,"82":1669.0,"83":1670.0,"84":1671.0,"85":1672.0,"86":1673.0,"87":1674.0,"88":1675.0,"89":1676.0,"90":1677.0,"91":1678.0,"92":1679.0,"93":1680.0,"94":1681.0,"95":1682.0,"96":1683.0,"97":1684.0,"98":1685.0,"99":1686.0,"100":1687.0,"101":1688.0,"102":1689.0,"103":1690.0,"104":1691.0,"105":1692.0,"106":1693.0,"107":1694.0,"108":1695.0,"109":1696.0,"110":1697.0,"111":1698.0,"112":1699.0,"113":1700.0,"114":1701.0,"115":1702.0,"116":1703.0,"117":1704.0,"118":1705.0,"119":1706.0,"120":1707.0,"121":1708.0,"122":1709.0,"123":1710.0,"124":1711.0,"125":1712.0,"126":1713.0,"127":1715.0,"128":1716.0,"129":1717.0,"130":1718.0},"Entry":{"0":"\n\n","1":"\nAt Blangy Tronville (Somme) Raining & cold. On duty 3 pmto 9 pm. Battle still continues,the artillery fire being heavy & continuous on both sides. Enemy planes bombing Amiens in early hrs of morning & our AA guns in action. The bombs could be heard bursting from here & our search lights were sweeping the sky in search of the raiders, the buzz of whose engines could be heard plainly.\n\nInformation to hand from the French, who are on our\n\nMon 8th April 1918\nright, that from information gathered from a prisoner, the enemy intends to attack tomorrow morning, on front from Hangard to Moreuil.\n","2":"\nAt Blangy Tronville. Artillery fire heavy & continuous. The enemy's objective is Boves, then Amiens; & the section the Australians are holding (from the Somme to Hangard) & thence that held by the French to Montdidier isthe most vital part of the line as it is between the enemy & Amiens. All day\n\n\n\n\n\nTues 9th April 1918\nhe has shelled Gentilly & the Amiens road heavily, our 20th Batt having 70 K & W in the village, from shell fire. A lot of gas shells sent over our positions through the night. Weather dull & foggy & roads are in very boggy state.\n\nWed 10th\nAt Blangy Tronville. Our 34th & 36th taken over front line section again last night, after a few days in close support. On duty 3 amto 9 am. Artillery fire still heavy on our front & right.\n\nThe following men who\n","3":"\nleft with the 7\/35th Batt casualties in the fighting on 4th & 5th April\n\nBaker F. W.\nBurt T. W (DW)\nBrandt T. W.\nGrant F. M.\nGodby W.\nHenderson C. W\nHumphries W. W.\nKelly K\nMoss M.\nNixon E. W.\nOldem P. M.\nPankaas W.\nPepper C. W.\nRogers W. W.\nSumner E. W.\nSwanson J. W.\nStewart C. W. (DW)\nTuise J. K.\nSmith W. W.\nSmith Walter W.\n\nPrevious casualities\nFitzhenry S. W.\nBrown W.\nCox N. W.\nFairhall W.\nJones W.\nJohnson T. W.\nLambert C. K.\nMurray W. XM.\nPalfry W.\nThompson J. W.\nLangham A. P.\nBooth L. M.\n\n\n\n\n\n\n\nWed 10th April 1918\nOn duty 9 pmto 3 am.\n\nEnemy still shelling Villiers Bretonneux, Gentilles, Cachy & the Amiens Rd. Many of the artillery horses of ourbatteries along this road have been Killed by shell fire. Weather dull & ground & roads in bad state. News has just come throughof a big attack by enemy from Lys River to Wyschaete in Belgium. Messines was taken by him but our 19th Div recaptured it. Further South he gained ground & reached Ploeg St Village, fighting still proceeding.\n","4":"\nAtBlangy Tronville\n\nOur men holding the enemy off Amiens. On duty 9 pmto 3 am.3 to 9 pm. Weather fine. Artillery fire heavy on both sides. 10 enemy planes over at 2 pm. Driven off by our AA & MG.s from 7 to 9 pm. Several enemy planes bombing our rear guns, billets etc.\n\nReports from North state enemy still attacking our line,fallen back to Estaires along line to Armentieres (still in our hands) Rossignol to Messines. Enemy holding part of Phloeg Steert Wood\n\nFrid. 12th April 1918\nAt Blangy Tronville. Weather clear. On duty 9 to 3 pm. Number of enemy Planes over at 6 pmunder heavy fire from out M.Gs & A A. 1st Aust Div has been sent to the North again, where enemy is evidently making a bid for Calais. At 12-30 saw an air fight & a big Bosch machine brought down from a great height. In falling it came down rolling & burning & turning& took some minutes to reach the ground. The two occupants were wounded. Our machines followed it down like hawks, until it crashed to earth.\n\nFrid. 12th April 1918\nCapt Bushell (36th) Killed by sniper on 10th. Col. Milne (OC) Capt Macnee (adjt) Major McDowell (2nd in Comm) 36th Killed by one HE shell. Lt Callier also killed today.\n\nEnemy trying to bring down an O.B. behind us with shrapnel. Enemy attacked Hangard on our right, but driven off by the French & our 36th Bn.\n\nBig attack projected by our troops in conjunction with the French tomorrow morning. Div. thanked by Gen Monash for its work in recent operations. Airmen again report enemy massing for attack.\n","5":"\nAt Blangy Tronville. On duty 3 amto 9 AM. Enemy shelling Villers Bretonneux heavily & bombing it day & night. Several enemy planes passed over our camp in early hours of morning on way back to own lines after bombing raids, & under heavy fire from our AA & MGs.\n\nIn the fighting on April 4th Capt Sayers D Coy 35th Battt, after the enemy had attacked, led his Coy in a counter attack & drew the enemy back shooting 2 with his revolver & killing 2 with his steel helmet. In another case a\n","6":"\nCorporal of the 56th Batt with 3 men was sent out to protect the flank of a M.G. Aparty of the enemy, 30 in number, were observed reconnoitringour position. The Cpl & his men opened fire killing 7 of the enemy, the rest of whom retired to a sunken road. Leaving 2 of his men to cover his advance, he, with the other men charged the enemy, shooting the officer in charge firing from the hip & wounding a warrant officer who was taken prisoner. The\n\n\n\n\n\nSat13th April 1918\nrest beat a retreat. On the officer were found papers giving enemy plans of attack etc & other valuable information. In another case an N.C.O. of the 46th Batt with a MG held up & drove 3 successive waves of the enemyin an attack, & then charged them with the bayonet.\n\nCombined French & British attackon Hanguard (39th French & 18th British Divisions) entirely successful last night. 50 enemy planes brought down yesterday. Fighting still pounding in the North our line now running near Meuries, Neuve Eglise etc\n","7":"\nOn duty 9 to 3 PM. Weather cold. Our Brigade relieved in line last night. Now in close support. Now attached to 58th Div. Strong gale blowing. Fighting still going on our front & right and all gains being held. Heavy fighting in the North at Neuve Eglise Baillent on River Lys & other places.\n\nEnemy still advancing & losing heavily. Armentierres captured & with it enemy claims 3000 prisoners including 2 generals . They claim 20000 prisoners & 200 guns since Northern attack began. \n\n\n\n\n\nSun 14th April 1918\nHe now holds the whole of Ploeg Steert Wood & is fighting for the high ground at Neuve Eglise etc.\n","8":"\nAt Blangy Tronville. Heavy shelling on both sides & fighting at Hanguard. Our patrols captured manysmall parties of enemy, & after an advance past attack in which our men retired slightly owing to heavy M.G. fire, the enemy allowed our SBsto go out & collect our wounded. In the north the enemy had captured\n\nMon 15th","9":"\nMerville & Neuve Eglise & attacking heavily at Messines & other positions & has reached VieuxBerquinthreatening Hazebrouck, an important railway junction.\n\nTues 16th\nAt B.T. on duty 3 to 9 pm. Very heavy gun fire from 4 am. Enemy shelling roads & railway in our rear heavily. We now hold Hanguard & position's further on. Our 4th Div has had some very heavy fighting on our left at Dernacourt & repulsed several strong attacks with very severe enemy losses.\n\nHeavy fighting\n\n\n\n\n\nTues 16thApril 1918\nin the North.\n\nEnemy has taken Bailleul & Ravelsberg Heights & fighting for Wychaate. At 10 pmour 5th Div opened heavy fireon enemy positions. Onduty 9 pmto 3 am. (Cook, Barkill & I)\n","10":"\nAt Blangy Tronville. Came off duty 3 am. Raining. Since 4 amenemy has been shelling Villers Bretonneux & the rest of our front with gas. This has continued all day & our casualities been very heavy from it.\n\n33rd Batt 253\n34th Batt 17\n35th Batt 33\n36th Batt 10\nM.G. Coy 35\nL.T.M. Coy 10\n\n\n\n\n\n\nWed 17th","11":"(6 months in France)\nAll the afternoon he has been shelling this Village. 4.16.6W. in Pioneers. Fighting still heavy in the North. Wychaate & Meteran captured by enemy. Big attack expected here & our 35th to counter attack.\n\nThurs 18th\nAt Villers Bretonneaux. Raining & cold. Heavy artillery fire throughout night & early morning. Enemy still sending gas shells over on our front. Report from North says heavy fighting at Wychaate & along 2nd Army Front. On duty 9 to 3 pm.\n\nThur April 1918\nFighting west of Merris& enemy's objective Hazebrouck.\n\nFrid. 19th\nAt B.T. On duty 3 amto 9 am. Enemy planes over bombing at 4 am. Almost the whole of the 33rd officers have been gassed. Weather cold with sleet falling.\n\nTomorrow our Bde to be relieved inthis sector by the 23rd Bde. Devons, Worcesters, & SherwoodLancasters. 33rd Batt strength 3 officers 130 men. Fighting is still heavy in the North, but position looks better.\n","12":"\nEnemy prisoner states that big attack to open on this part of front on 21st Amiens has been heavily bombed by enemy planes.\n\nSat. 20th\nOn duty 9 pm(19th) to 3 am. From 11-30 to 2 ammany bombing planes over and transport etc bombed. Our machines have been bombing enemy lines etc every night that the weather has been favourable.\n\nCold & raining. Our Bde to move today to Frenchencourt 10K. and fire very heavy through night.\n\nSat 20thApril 1918\nAt 2 pmwe marched to Frenchencourt, through Doullens, Pont Noyelles (where we crossed the Somme).\n\nTotal casualities from gas at V. Brett about 1500.\n\nSun 21st\nAt Frenchencourt. Part of our 4th Div. here. Heavy fighting continues up North. From our Hdqrs a fine view of the front for miles. On duty 5 to 9 pm. Very heavy artillery fire on our front.\n\nToday our Australian airmen brought down a crack gunman flyer, who claimed 79 of our machines.\n\n\n\nSun 21stApril 1918\nHe was a Count & was killed. Weather cold.\n\nMon 22nd\nAt Frenchencourt. On duty 1 to 6 pm. Rumour that our Divisions are to be built up with U.S.A. troops. Our 4th Div lost heavily in recent fighting. 47th Batt came out with less that 100 men.\n\nThe art on both sides has been heavily engaged today. Our Army G.O.C. paid us a visit today (Gen Rawlinson). Rec. letters from home.\n\nTues23rdApril 1918\nAt Frenchencourt. Rain through the night. From information received from a deserter a big attack to be launched by enemy tomorrow from Somme to Hanguard. Our Bde to be ready to move into line at 1 hrs notice. On duty (Barkell, Newton &I) 9 amto 1 pm& 9 pmto 8 am24th.\n\nMany enemy bombers over through the night. American troops now fighting in the North.\n\nWed 24thApril 1918\nAt Frenchencourt. On duty to 8 am. From 3 amenemy bombarding this place with 10\" H.E. shells. At 4 ama very heavy bomb bombardment opened by enemy all along the front & many gas shells sent over. Our guns retaliated & enemy attack began 6-30. Our lines to Div Hdqrs & forward Bde post cut by shell fire at 4-30 am. Got our linesmen out & restablished comm. at 5-30 am. The enemy has attacked very heavily all along our front & on\n\nWed 24thApril 1918\nthe right has pushed the British troops back & now holds Villers Brettoneaux & Cachy. Hehas used tanks in this attack.\n\nLater on in the day the 8th Div. counter attacked & drove enemy back through the wood near Cachyuntil held up by M.G. fire from Villers Brettoneux.\n\nOur own men are to counter attack again later.\n\nOn duty5 to 9 pm. Raining. Some ofour tanks done fine work in the counter attack today.\n\nThurs 25thApril 1918 ANZAC DAY\nAt Frenchencourt.\n\nThis morning our13th & 14th Bdes attacked & drove enemy from Villers Brettoneaux & are now holding a line east of town.\n","13":"\nAt Frenchencourt.\n\nIn the attack by our 13th and","14":" Bdes at Villers Bretonneaux yesterday they took 700 prisoners, 100 M.Gs 2 field guns & 2 tanks. The enemy suffered very heavy losses in K & W.\n\nAt 12 pma message came through that he was advancing with strong forces\n","15":"","16":"\non the left of the Lamotte - Villers Bretonneux Road. Through the afternoon he attacked heavily but was beaten back with heavy losses. The prisoners taken appear to be fresh troops & are mostly young men. On duty 9 amto 1 pm. Today things are fairly quietonthis front here.\n","17":"\nAt Frenchencourt\n\nOn duty 9 pm 26th to 9pmthis morning. In the North the enemy has taken Kemmel after very heavy fighting. This is a very important\n\nSat 27","18":"\nstrategic point & is looked on as the key to the Northern part of our front. The artillery fire has been fairly heavy on our front today.\n\nSun 28th\nAt Frenchencourt.\n\nRaining. On duty 1 pmto 5 pm. Fighting still heavy in the North, & on our own front things have been fairly lively. We expect to relieve the 11th Bde in the front line on Wed 1st May.\n\nUnderstand that out 36th & 33rd Batt's are\n\nSun 28","19":"\nto be put together & make up one Batt.\n","20":"\nAt Frenchencourt. Raining. On duty9 amto 1 pm& 9 pmto 9 am30th. Tomorrow our Bde relieves 11th Bde in the line. Very heavy artillery fire from 7 pmto midnight.\n\nEnemy sending gas shells into Pont Noyelles.\n\nMy old Batt (336th) has been broken up, 3 Coys go to build up 33rd & the rest to 34th 35th & 9th A.L.T.M. Batt. The lads are naturally not taking too kindly to it. This afternoon we saw our airmen (Aust) bring down a Bosche the pilot of the machine being wounded & observer unhurt. They landed close to our camp & were made prisoners.\n\n\n","21":"","22":"","23":"\nToday a Coy of U.S.A. Engineers joined us & are now attached to our Division.\n","24":"\nAt Frenchencourt.\n\nRaining, mud & slush everywhere. Part of our forward signal post gone up to post in line, we move up tomorrow. I am to mark a visual station between Batt's & Bde. On duty 5 pmto 9 pm.\n","25":"\nOurBde relieving 11th in line tonight in Heilly section. At 9 pmI left Frenchencourt through La Houssaye to Heilly via Albert Road. 7K. This is our\n\nWed1stMay1918\nBde Hdqrs now. On duty 3 pmto 9 pmon visual station in comm' with ourthree Batt's per Lamp. Our post is on a hill near the town from which we have a fine view of the front for miles. Our artillery from positions round & in front of us have been bombarding the enemy's lines heavily all the aft & night.\n\nWeather foggy & cold.\n\nLively M.G fire along the line through night\n","26":"\nAt Heilly. On duty 9 amto 3 pm. Weather fine & clear. On the hills in front of our post our men are\n\n\n\n\n\nThurs 2nd","27":"\ndigging a second line of trenches under fire from the enemy. The artillery fire has been heavy & continuous throughout the day. The enemy is searching for our batteries with his guns. Great activity in the air day & night.\n\nFri 3rd\nAt Heilly (in line) on duty 8 to 1 pm. Fine & clear. At 8.30 an enemy plane brought down by ours within 300 yds of us. Observer K & officer W. at 10 pmsaw another one brought down in flames falling from a great height.\n","28":"\nEnemy attacked very heavily in North, but repulsed with heavy losses. Received letters from home yesterday. At 1 pmsaw another battle in the air in which two enemy machines were brought down.\n\nOn duty from 9 pmto 9 am4th. Extremely heavy artillery fire on our front.\n\nSat 4th\nCame off duty at 9 am. Through to the early morning the enemy shelled the hills in front of our Post very heavily. Our men are holding a line along the hill. He has also been\n\nSat 4thMay 1918\nup many Very lights . Further back he has been sending up many strings of big lights which our airmen call \"flaming onions\" these travelto a great height & are sent up tolocate our planes which are bombing his camps etc. At 2 amreceived a sit-report from Batt's in line who report everything OK. Raining throughearly morning, All day very heavy fire on our right, in direction of Villers Bretonneux. Enemy bombarding Corbie\n\nSat 4th","29":"\n(about 6 K on our right) heavily & town appears to be on fire in several places.\n\nToday I have not seen a single enemy plane up, & at times as many as 40 of ours could be counted over our section. On duty 5 pmto 9 pm.\n\nSun 5th\nAt Heilly on duty 1 pm to 5 pm. Raining.\n\nOur 24th Batt captured an enemy post last night & advanced our line in that part 500 yds. Art fire from both sidesheavy & continuous.\n","30":"May1918\nAt Heilly. At 12 amthis morning our 34th & 35th Batt's attacked & after some severe fighting advanced our line 1\/2 mile. 200 prisoners taken with several M. Guns & 1 Tank mortar. 150 enemy killed in the trench fighting.\n\nOur losses 16 K, 53 W.\n\nEnemy counter attack later failed with heavy loss to them.\n\nOn duty 9 amto 1 pm.\n\nAt 10 pmour new linebeing heavily shelled. One of our planes brought down in flames by enemy this morning, behind\n\nMon 6th","31":"\nour lines, pilot & observer (Aust) killed.\n\nOn duty 9 pmto 9 am7th\n\nAll night our heavy guns have been in action.Raining & strong winds.\n\nTues 7th\nAt Heilly. Came off duty 9 am. On again 5 to 9 pm. Weather now fine. Our 10th Bde advanced their line 1\/2 mile early this morning, meeting with very light opposition.\n\nHave just heard that our 2nd Div is to relieve us in line on the 10th.\n\nToday the artillery fire on both sideshas been normal.\n\nWed 8th","32":"\nAt Heilly. Our 35th made a slight advance again early this morning taking 11 prisoners & inflicting heavy loss on enemy. One of these who could speak fair English, afterbeing given some food & cigarettes, told us that had he known prisoners were so well treated he would have surrendered long ago. He also said that the number of the troops of his Division was very low, & that they were sick of the war. Other Prisoners taken recently\n\nWed 8thMay 1918\nfrom other Divisions tell a different story & think they are sure to win the war.\n\nPrisoners are well clothed & not a bad class physically though there are a big percentage of boys,17 or 18 yrs in some cases.\n\nOn duty 1 pmto 6 pm. Artillery fire fairly heavy through day. At 10 pmenemy shelled Heilly heavily for 1\/2 hr, I had just turned in for the night, but hadto take shelter in a cellar with the rest of my mates.\n\nMany buildings\n\nWed 8th","33":"\nblown to pieces & a few casualties amongst our prisoners. On duty 9 amto 1 pm. Weather fine. Enemy is shelling Ribbencourt (1 1\/2 K on our left, up the river).\n\nMore prisoners brought in by our men this morning. The line our Brigade is now holding runs between the Somme & Amiens. Heavy M.G fire on our left at 10 am. During the absence of all the team but one, of our 10th Bde LG Post, drawing rations\n\nWed 9thMay 1918\netc an enemy patrol captured the gun & gunner, last night. One of our officers noticed the enemy taking the man & gun back to the German lines & getting a few men together recaptured the LG & took the German patrol prisoners, also releasing our man. Specialists from our 2nd Div going into line tonight, & our Bde to be relieved tomorrow night.\n\nThur 10th\nAt Heilly, weather fine. On duty 9 amto 1 pm. Enemy has\n\nThur 10thMay 1918\nshelled the hill in front of our post very heavily all the morning, searching for our 18 pdn batterys. At 8-30 pmour village again under very heavy fire with HE shells, many more houses blown up. At 9 pmwent on duty (visual). From 9-30 pmto 2 amthe artillery fire has been the heaviest we have experienced on this front from both sides. Enemy appear to have many more guns on this sector now than a week ago.\n\nThursday","34":"\nAt 4 amenemy planes bombed Heilly & Merricourt. From our post we had a fine view of the bursting bombs & reckon we are lucky to be on duty & not sleeping in the Village. In the operations on the night of the 7th 34th Batt lost 2 officers & 8 men K, 6 officers & 40 men W. 4 officers & 36 men missing, now supposed to be Prisoners in enemy hands. German Wireless (picked up by our own Wireless) today claims 4 off & 36 of our men prisoners.\n\n\n\nFrid 11th May 1918\nCame off duty at 9 am. Weather fine. At 2 pmrelievedby 5th Bde (2nd Div) & marched through La Houssaye to Pont Noyelles. On our way passed a fine monument on a hill near the town, erected to comm. the victoryby the French over the Germans in the battle of Pont Noyelles 1870.\n\nSat 12th\nLeft Pont Noyelles at 11 amon march to Rivery, a suburb of Amiens, arriving\n","35":"\nat 2 pm. 12 K via Albert-Amiens Wood.\n\nBilleted in the Hospice StVictor, a fine hospital in lovely grounds. The whole of the City & suburbs has been evacuated by the population owing to the enemy shelling the place heavily with his long range guns.\n\nAmiens is a fine city with one of the most beautiful cathedrals in the world. The whole country is now a picture & weather good. Another big\n\n\n\nSat 11th May 1918\nattack by the enemy (Amiens being the objective) is expected atany time now. The 2nd, 3rd, 4th & 5th Aust Div's lay between him & the city on this part of the front & I think we can stop him.\n","36":"\nAt Rivery. Weather dull & cloudy. This place has been a good deal knocked about by shellfire & bombs.\n","37":"\nAt Rivery. Weather fine & everyone enjoying a rest. At 4 amawakened by enemy planes bombing the town & our AA guns in action. Since 2 pmhe has been shelling this place & Amiens with his long range guns a distance of about 12 to 14K, as we are 10K from the line here.\n\nTues 14th\nAt Rivery. Had a walk through the town this morning. 2 enemy planes pver & several bombs dropped near us, a woman wounded in the street. Enemy again shelling Amiens & Rivery.\n","38":"\nIn yesterdays shelling 8 of our menwounded. 33rd Batt marched in from Glisy.\n\nWed 15th\nAt Rivery. Awakened at 2 amby bombs. Many enemy planes over & a great many bombs dropped here & in Amiens. Weather fine & clear. Throughout the day several enemy machines over at a great height. Last night he attacked our 2nd Div at Mericourt & aftergetting into our first line was driven out & beyond his original line by our counter attack losing heavily in K & W & leaving 50 prisoners in our hands. His bombers\n","39":"\nwere over again at 11 pm& engaged byour AA guns, after being picked up by the search lights.\n","40":"\nAt Rivery. Weather good. 35th & 33rd played a match at Rugby thismorning. A win for 33rd.\n\nEnemy planes over at 10 pmbombing. A number of O B's are now sent up over the city after dark, wires being slung from one to another the object being to trap the enemy bombers.\n\nFrid. 17th\nAt Rivery. Today Sir D. Haig & Gen. Foch inspected our 10th & 11th Bds at Allonville, our Div Hdqrs. Our Bde being in reserve could not be present. Things\n","41":"\nfairly quiet on Northern front at present.\n\nEnemy expected to launch big attack here at any time now. Amiens the objective. Today he has been shelling this town again.\n\nSat 18th\nAt Rivery. Weather perfect. Very heavy art fire up the lines through night & early morning. In afternoon we practised a new method of signalling to aeroplanes from the ground by means of a large sheet of dark blue cloth, with a letter T worked on it in white\n","42":"\ncloth & a series of flaps round the T which on being turned back expose a white spot. Each of these spotsdenote a figure (there are 9 spots on different parts of this cloth adjoining the T.) & each figure or combination of same represents a letter word or group of words. On reading each group as sent the observers in the plane answers RD by means of a horn. We sent 4 messages in 19 minutes, considered very good work for a start.\n","43":"\nAt Rivery.\n\nHeavy art fire along line this morning.\n\nBde swimming carnival held in the Somme at Amiens this aft, very successful. Enemy has been shelling the city with very heavy calibre guns today.\n\nMon 20th\nAt Rivery. Orders re advance party going into line today cancelled. We will probably go in tomorrow relieving our 4th Div at Villiers Brettoneaux, which our Bde recaptured.\n","44":"\nfrom enemy on 4\/5th April. More bombing & shelling by enemy to day. Our swimming carnival continued on Somme this aft.\n\nTues 21st\nMarched from Rivery at 12-30 for the line, following the river to Blangy Tronville, thence to our post, which is in a railway cutting on Amiens - V. Brett line 5 K above B Tronville. On our way up the river we talked & enjoyed a swim, & all along the river\n\nTues 21st May 1918\nhundreds of our men from the camps near by were enjoying the same. Our 2nd Div attacked last night at Morlancourt, & captured the village of & taking 400 prisoners (8 off) 12 M.Gs, & inflicting very heavy losses on enemy. Roads now very dusty. We are relieving the 13th bde & have one Batt in line & 2 in close approach. This is where we stopped enemy's advance.\n\nTues 21st May 1918\non Amiens early in April. Our 11th Bde is on our right & joins up with the French. Enemy fired 2000 gas shells into our supportBatt positions this aft, & we sent him 600 in return.\n\nHe has also shelled the Amiens - V.B. road, near us through the day.\n\nWed 22nd\nIn line at V.B. At 3 amthis morning the relief was completed & the 4th Div go back for a rest. Brig. Gen Rosenthal has\n\n\n\n\n","45":"May1918\nnow taken command of our 4th Div & Col Goddard has taken his place as OC. of our Bde.\n\nReceived papers from Alice today.\n\nWeather fine & clear. Heavy counter battery went this morning. At 10 AM our 34th Batt Hdqrs & sig office blown up by shell 5W on duty 4 to 12 pm.\n\nEnemy sending over gas shells at 9 pm.\n","46":" U.S.A. officers attached to us today. We now have English, French & American officers & men with us.\n","47":"\nIn line at VillersBretonneux.\n\nOn duty 8 amto 4 pm. Weather warm & clear. Our guns very active. Enemy shelling our post throught the day. Big air raid on London. 7 Gotha's brought down.\n","48":"\nIn line. V.B. Weather turned cold & cloudy. Throughout the day ourartillery has been very active with very little reply from the other side. Steady rain falling. Several shoots carried out by out guns through the\n\n\n\n\n\nFriday 24th May 1918\nnight, on enemy targets.\n\nSat 25th\nIn line at V. Brettoneux . Weather fine & clear. Enemy shelling parts of our line with 4.9 & 5.2 H.E. heavily. On Sunday night last a big raid by Gothas on our hospitals behind the lines, & a great number of casualties amongst the patients, nurses & staff. Feeling very bitter amongst our men on the matter. 4 enemy planes over our trenches at midday, using M. Guns on men.\n","49":"\nat 7 pmenemy sending over gas shells on our supports, using 4.2 & 77 M guns. The whole of our near positions heavily gassed, one shell falling at the entrance to our dug-out. Our guns retaliated & threw over thousands of gas shells. The French guns on our right also lent a hand. Our 11th Bde suffered severely from the gas shelling. On duty 8 amto 4 am.\n\nSun 26th\nIn line V.B. Casualities from gas fairly light in our Bde. One of\n\nSun 26th May 1918\nour Stokes shell dumps blown up by enemy shell last night. Weather warm.\n\nAt 11 pma few gas shells coming over & our guns replying. 11th Bde losses very severe from the gas, & the French also suffered on our right. All day our motor ambulances have been kept going from the forward dressing station to clearing station at rear.\n\nOn duty 4 pmto 12 mid.\n\nMon 27th May 1918\nIn line at V. Brett. Weather fine.\n\n11th Bde casualties from gas now over 500. Pioneers also lost many men. Enemy attack expected this morning did not come off. We had made all preparations to repel & counter attack. 37th Batt (from 10th Bde) brought up in close support at 2 am. All of our lines dis. from shell fire at 4 am. Comm kept up by lamp & dogs. Our 34th Batt reports only 7 sigs left this morning, rest are mainly gassed\n\n\n\nMon 27th May 1918\nat 11 amGen Birdwood& staff paid us a visit after presenting medals etc to men & officers of our Div. He is now taking over command of the4th Army which includes the Aust & N.Z Divs. Major-Gen Monash takes our Corps, Brig-Gen Gillibrand our","50":" Div. & Col Goddard our Bde. All day the enemy has shelled our positions with 5.9 & 4.2 H.E. at 2 pm,a few gas shells coming over.\n","51":"\nIn line at V.B.Weather fine & clear. At 2 amour guns bombarded enemy lines heavily. Enemy attacked on front from Rheims to Sarissons on the morning of the 26th after heavy gas & other shelling.\n\nFrench line pushed back slightly in parts & heavy fighting continues.\n\nHe also attacked in the North at Locere & Vermoozule without gain.\n\nGreat air activity.\n\n\n\n\n","52":"\nIn line at Villers Brett. Throughthe night our batteries carried out a series of shoots at prearranged times, bombing his line etc heavily.\n\nEnemy planes bombing roadsetc near our post at 4 am. 2 of the enemy who had lost their way & were captured by one of our patrols, were brought in this morning. One, who spoke good English, informed us that the war would be over in 6 months & that Germany would win. The town of Caubie has been burning all the afternoon, & through the night as a result\n","53":"\nof enemy shells. On duty 4 pmto 12 mid.Heavy fighting is still going on between Rhiems & Soissons.\n","54":"\nIn line at V. Brett. Heavy fighting continues in the South, where British line has had to fall back.\n\nEnemy shelling our rear positions & the vicinity of our post, heavily all through night with H E & gas shells.\n\nWeather fine. Several shoots carried out by out guns through day & night. Great ariel activity.\n\nRec' papers from home.\n","55":"1918\nIn line. V. Brett. Weather fine & clear. On duty 8 amto 4 pm. At 10 aman air fight in progress over our post. Enemyplanes driven off. Artillery fire fairly heavy from both sides up till noon. Yesterday enemy scored a direct hit on one of our 18 pounders, putting the gun out of action. Heavy fighting still proceeding south of us. British falling back fighting hard. Enemy now in possession of Soissons, & has advanced over 20 miles since this attack began on Sunday last.\n\nAn enemy plane brought down in flames behind our lines\n","56":"\nIn line at V.B. Weather fine. Our 11th Bde attempted a raid on enemy trenches this morning but were held up by heavy M G fire. 1\/2 hr later enemy attempted a raid on 11th Bde, but were beaten off. Heavy art fire through the night. Severe fighting still in progress south of us. 20 of our planes bombed enemy front line trenches at 11 am.\n\nSun June 2nd\nIn line V.B. From 1 to 4 am. enemy shelled our supports & rear positions heavily, with H.E. & gas. At 3 am. all of our telephone lines\n","57":"\nforward were cut by the shell fire & our visual station could not be worked owing to the heavy fire.\n\nComm kept up by the wireless & pigeons. We also have dogs trained as despatch carriers, & also use message rockets. On visual sig duty at forward Bde post from 9 pmto 9 am3rd. Our post is in a shallow trench on a hill near Villers Brettoneux & affords us very little shelter from shell fire. At 10 pmour post under heavy fire. Throughout the night our artillery from positions in our rear & on either flank has bombarded enemy lines etc heavily.\n","58":"\n& at intervals enemy giving us the same with HE & gas. From 10 pmto 4 amthe town (VB) has been burning fiercely, his incendiary shells causing it. We are in comm with our batt in the front line trenches, the batt in close support, our 11th Bde, on left, art group Hdqrs in rear & batteries, & our Div Hdqrs at Glisy 7 K in rear of us. Many of our bombing planes passed over on way to enemy lines through night. Fine display of viewing& other lights by Fritz.\n\nMon June 3rd\n\nIn line V.B. On duty at C.V. until 9 AM. Weather fine. 10th relieved 11th Bde in line last night.\n\n\n\n\n\n\n","59":"\nIn line V.B. on visual duty advanced Bde post 3 pmto 9 pm. Weather fine & warm. One enemy plane brought down on our front this morning. Artillery active. Enemy appear to be held up on the Marne though very heavy fighting continues. From ourpost a fine view of Amiens & the country for many miles in our rear & on the flanks.\n\nTues 4th\nIn line V.B. On duty 9 amto 3 pm. Weather fine & clear at 2 am. 11thBde on our right, owing to heavy enemy fire, sent up the S.O.S. & for an hour the whole of our guns with the French battlelineson our right shelled the\n\n\n","60":"\nenemy lines heavily.\n\nThroughout the day the art-fire has continued heavy. At 4 pma 5-9 HE landed within 10 yds of our post. On duty 9 pmto 9 am5th. At 10-35 20 HE shells fell in vicinity of our post, the closest being 5 yds away. Our tel line to ST cut in 4 places by shell fragments. Repaired line & all OK at 11 pm. From 5 pmto 5.30 enemy shelled our front about our Batt Hdqrs. Enemy bombing Planes over throught the night & our AA guns in action.\n\nWed June 5th\nIn line V.B. Came off duty 9 am. Weather clear. 10th Bde relieved 11thin line last night. Usual art fire through day. An enemy plane brought down in flames in our lines at 10 am. Fouilloy a village onthe river, on our left, burning through\n\nWed June 5th1918\nnight from shell fire. On duty 9 pmto 9 am6th. A good deal of bombing through the night. At 10 pmvery heavy bombardment opened by our guns all along the line right up to Heilly. This was kept up until 3 am. Enemy retaliating on our lines & supports. 2 of Op lines to Batts cut at 4 am, but comm kept up by our vis station. Glisy, a town 5 K in our rear, in flames from 10 pmto daybreak. Corbie, on our left also burning.\n\nThur 6th\nCame off duty 9 am. Weather fine & clear. 2 men of the Irish Fusiliers taken prisoner on Mar 25th nearSt Quentin, escaped 3 nights ago. They had\n\n\n","61":"\nbeen employed with other British prisoners on working parties, behind the enemy lines & were kept in a compound at night. 3 nights ago our planes bombed the German positions near them & the sentries having taken shelter in a dug-out, these 2 men escaped. They hid during the day & travelled by night, & lay in front of our wire all night, not knowing whether it was our line or the enemy's until they heard our men talking. They were fired on when coming throughthe enemy front line. They told me the food given them was very bad & that the German Officers & NCOstreated them very harshly at times beating the\n\nThurs 6th June 1918\nprisoners with sticks when at work. The prisoners were also told that Amiens had been captured some weeks ago. One of our 35th Batt (evidently one of a few of our men taken prisoner near Morlancourt, about 3 weeks ago) escaped at the same time as these men & intended trying to get through the German lines further north, near Albert. On duty 3 pmto 9 pm. Heavy art fire through the day. Receivedletters from home.\n\nFri","62":"\nIn line V.B. on duty 9 amto 3 pm& 9 pmto 9 am","63":" Heavy fighting continues in the South. At 10 AM our batterys under heavy shell fire. 3 Bosch\n\nFriday 7th 1918\nplanes over our lines at 11 am. Worked with mate, through night, improving our position, with pick & shovel, deepening trench building parapet.\n\nSat 8th\nIn line V.B. Came off duty 9 am. Enemy searching for our batteries with his guns. On duty 9 pmto 9 am","64":"\n\nRaid attempted on our lines by enemy near Morlancourt on Thur night, beaten off.\n\nSun 9th\nAt midnight enemy opened a heay bombardment of our front, 10th Bde & the French front, with HE & gas. This was kept up until 7 am. All lines forward cut by shell fire at 12-30 am, comm kept open by our vis station, though very hard to read the lamps owing to the\n\n\n\nSun 9th June 1918\ndust & smoke from the shells. Came off duty 9 amtired out. On again 3 pmto 9 pm. Enemy attacking very heavily from Montdidier south. Our little mascot \"Britt\" killed by German gas through night.\n\nMon 10th\nIn line V.B. On duty 9 amto 33 pm. Raining. In yesterdays attack enemy used 8 or 10 Div's & after capturing the French front line in places, was driven out by counter attacks, losing heavily. Again this morning he attacked & gained a little ground. From 2.30to 8 pmour front line, supports & vicinity of our station under heavy fire with HE shells.\n\nAt 9.30 we tried out a new message rocket\n","65":"\nwhich has a range up to 2000 yds. It was fired from our Coy's in front line to Batt Hdqrs then to our Station & we sent one on the Bde Hdqrs. Trial very successful. On duty 9 pmto 9 am11th. Our 2nd & 4th Divs are to attack & advance the line on their front tonight. At 9-45 pmour guns opened up & bombarded enemy line heavily on the front to be attacked. This runs from the left of our sector, north to Morlancourt. Our fire kept up till 10-30 pmwhen our men are to advnce. A few minutes after our guns opened the enemy was sending up his S.O.S.\n","66":"\non duty to 9 am. Heavy fog in early morning. 12-30 amour post under shrapnel fire. Enemy planes bombing on out left rear. Attack by 2nd & 4th Div very successful. All objectives gained & line advances 700 yds on 3500 yds front. Our 300 prisoners, 20 MG's. 2 T. Mortars taken.\n\nEnemy losses in K & W verysevere. On duty 9 pmto 9 am","67":"\n\nWed 12th\nIn line V.B. Weather fine & clear. Art fire heavy at lines through day & night. On duty 3 to 9 pm. V.B. burning from 7 pm. Our planes very active\n","68":"\nIn line V.B. On duty 9 amto 3 pm. An enemy plane over our lines at 9.30 am, driven off by our A A guns. The enemy has evidently located one of our battery positions near us. At intervals through the day he has concentrated the fire of one of his battery's on it, K & W 10 of the gunners. Our guns very active.\n\nOn duty 9 pmto 9 am14th.\n\nFrid. 14th (Sat. *)\nCame off duty 9 am, after a tiring night. At 3 amrec' a longmessage from KOVO, our batt in the line & transmitted it on to Bde (183 words). 1 Sgt, Cpl, & 10 men raided an enemy outpostat 1 am, & were back in our lines at 8 amwith 2 prisoners The rest of the post were\n\nFrid. 14th June 1918(Sat)\nK or W. The corporal of our party was K by an enemy grenade on the parapet of enemy trench. Our stretcher bearers went out & found him but were compelled to leave him owing to enemy bombing them. At 3 amline to Div cut by shell fire, & comm kept open from our station by lamp. Expected enemy attack did not come off. Raining at 3 am.On duty again 3 to 9 pm.\n\nOur OC received letter of application from SO 34th Bn, for the way in which the long message from them was received and transmitted by us at 3 am, when all telephone lines to the batt's were indis' from shell fire.\n","69":"\nIn line V.B. Came off duty 9 am. At 4 amshelling near one of our post in vicinity of one of our 8\" batteries. At 5 amshelling road in front of us. All night our guns have been very busy. Weather dull & cloudy. Heavy fighting continues south of Montdidier. On duty 9 pmto 9 am. Information to hand that enemy has his storm troops along our front & all preparations made to repel attacks, expected tomorrow morning. From 5 to 6.30 pmour artillery has been ranging one enemy lines etc. A raiding party from 33rd Bn to go out early tomorrow morning the object being a prisoner or two for information as to enemy's plans etc\n\nFrid 14th June 1918\nAll through the night our guns have kept up a constant fire on enemy lines etc, & he has been sending up hundreds of Very& other lights, red, blue, green, white & yellow.\n","70":"","71":"\nIn line V.B. On duty 9 amto3 pm. At short intervals the enemy has shelled our supporters & batteries through the morning. A party from 34thBn raided an enemy Post through the night, bringing in 16 prisoners.\n\nOur planes flying low, M.G. enemytrenches at 11 AM brought down by ours over V.B. We seem to have masteryin the air now & it not often we see an enemy plane over our lines in day time. On 9 amto 9 pm17th\n","72":"\nIn line V.B.\n\nCame off duty 9 am. Weather fine. Our art very active throughearly part of day. Enemy shelling heavily at times. A good deal of bombing through the night. At 4 aman enemy baloon up on our front & 7 more along line to the north. Our fighting planes over the enemy's lines at 4-30 amunder heavy AA & MG fire, which does not appear to worry them much. At 10 amone of our planes brought down by M.G. fire in enemy lines, the pilot & observer leaping frorm the machine as it was crashing to the earth, both were evidently killed in the fall.\n\nAt 12-30 pma big air fight in progress over our post, 2 enemy planes brought down & 1 of ours forced to land. Enemy machines then broke off the fight & fled to their own lines, with\n\nMon 17th June 1917\nours in hot pursuit. On duty 9 pmto 9 am","73":" At 10-40 pmenemy sending over HE & gas shells. Very heavy artillery fire along the front through the night.\n\nTues 18th\nCame off duty 9 am. Weather fine. 2 enemy planes brought down on our front this morning. At 1 pm, 2 enemy planes got over our rear under cover of low clouds & brought down one of our observation balloons, & getting back to their own lines under fire of AA guns. On duty 3 to 9 pm. Letters from home.\n\nWed 19th\nIn line V.B. on duty 9 to 3 pm& 9 pmto 9 am20th.\n\nRaining through the day. Enemy guns quiet until evening. Australians\n\nWed ","74":"\nbegan a great attack on a front of 90 miles front against Italy on 17thbut made little progress. At 3.30 pmsome of our batteriesunder heavy shell fire. At 10 pmenemy sending over Gas & HE shells on to our positions.\n","75":"\nCame off duty 9 am. Raining. Batteries in our rear, along railway being shelled at 9-30 am. Too much wind for work in the air. On duty 9 pmto 9 am.\n\nEnemy shelling batteries on our left rear at 10-50 pm. Through the aft a good deal of heavy shrapnel fired over our post. Italians claim 9000 prisoners against the Australianswho appear to be now safely held.\n\n\n\nFrid. ","76":"\nIn line V.B. Rain now cleared off. On duty 2 to 9 pm. All messages from batts in line worked through our station until 5 pm.\n\nArtillery active. Raining again through night. At 5 pman officer & sgt of 33rd Bn crept out into N.M.L & surprised an enemy post Killing 5 & bringing in one prisoner.\n\nSat 22nd\nOn duty 9 to 3 pmstrong gale blowing.\n\nAt 2 ama party from our 10th Bde carried out a silent raid on an enemy outpost. 10 enemy K & 7 prisoners brought in. One of our men W. On duty 9 pmto 9 am23rd From 9-30 to 10-30 pmenemy sending over HE & gas shells. All through the\n\n\n","77":"\nnight the art fire on the front up to Albert from here has been very heavy. Feeling off colour for past two days. Touch of influenza I think. Too long in the trenches this time.\n","78":"\nIn line V.B. Came off duty 9 am. Cloudy & gale blowing. On duty 9 pmto 9 am24th.At times enemy shelling us with HE & gas. On our left art fire continues heavy.\n\nMon 24th\nCame off duty 9 am. At 5 amI saw a fast enemy plane dive onto one of our old art observing\n","79":"\nplanes & was giving it a bad time when 2 of our scouts appeared came on the scene. Fritz made tracks for his own lines with ours in hot pursuit. At 10 amone of our machines driven down by an enemy plane in rear of our post.\n\nAt 8.30 pmenemy shelling vicinity of our post heavily.\n\nTues 25th\nIn line V.B. Weather fine. On duty 9 amto 3 pm. Good deal of enemy shelling through morning. Enemy heavily gassed by our R.E.s through night. Owing\n","80":"\nto some mistake in the time the gas was to be sent over several of our men on outposts were gassed. 2 died in the lines, & 1 officer & 11 men very bad. An enemy O.B. up on our front at 2 pm.\n\nHave just heard that we are to be relieved on Thur or Friday next.\n\nReceived a mail from home yesterday. On duty 9 pmto 9 am26th\n\nFrom 9 to 9-30 pmenemy sending over gas shells. Very heavy art fire on our right, where the French are holding line. The army of Prince Ruprecht of Bavaria is opposed to us on this part of the front. Good news from Italian front.\n","81":"\nIn line V.B. Came off duty 9 pm. Artillery fire heavy through day. Italians now claim 45000 Prisoners. Austrians retreating.\n\nOn duty 9 amto 9 am27th We are to be relieved by the 2nd Aust Div.\n\nThurs 27th\nCame off duty 9 am. Our positions shelled heavily shelled at intervals through night. Many bombing Planes over enemy lines.\n\nAubigny, a town on our left burning from shell fire in early hrs of morning. In an air fight over our post at 10 am2 enemy planes\n","82":"\nbrought down in flames & one of ours forced to land. At 2 amone of our bombing planes while over enemy lines was struck by shell fire but managed to get back over our lines after dropping all bombs on enemy trenches etc, & made a good landing near our Bde Hdqrs. On duty 3 to 9 pm.\n\nEnemy shelling our Post & batteries in our rear from 3-30 to 5 pm. At 6 pmwatched an air fight over enemy lines, one of our planes burst into flame & fell several hundred feet, the pilot then got it under control & brought it to earth in enemy lines.\n\nFrid 29th June 1918\nIn line V.B. on duty 9 amto 3 pm. Expect to be relieved today. 10th Bde relieved last night. Enemy shelling battery 200 yds on left of our post from 9 amwith HE & shrap. This has been our longest unbroken turn in the trenches (39 days).\n\nAt 4 pmwe were relieved by 5th Bde","83":" Div) & marched to B. Tron' when we were lucky enough to get a motor lorry that brought us to Rivery where we are in the same quarters we had 6 weeks ago, in Hospice St. Victor\n","84":"","85":"\nAt Rivery. Several enemy planes over lastnight, & many bombs dropped. Weather fine. Our Batts are billeted in villages in this area.\n","86":"\nAt Rivery. Weather fine. More bombers over last nightengaged by our A A guns.\n","87":"\nAt Rivery. On vis' sig until 12 am. Weather fine. Wrote home in aft.\n","88":"\nAt Rivery. On vis' Sig until noon. British troops advances line in Flanders.\n","89":"\nAtRivery. Weather fine. Vis sig in morning. Afternoon L.G work.\n\nThurs 4th\nAt Rivery. At 5 am after a heavy bomb of enemy line, our 2nd & 4th Div with our 11th Bde attacked on ourfront from Morlancourt to Hanguard. All objectives gained, line advanced to a depth of 1 1\/2 miles on a 4 miles front, over 1000 prisoners, 90 MGs\n","90":"\nT. Mortars.\n\nLater Prisoners\nunwounded 34 officers 1191 men\nwounded 2 officers 78 men\n103 Machine guns\n14 Trench Mortars\n1-77 MM gun\n\nMany enemy bombers over Amiens through the night.\n\nVery heavy art fire along our front all night.\n\nFri 5th\nAt Rivery. Weather fine & clear. Lewis gun drill in morning. Swimming carnival in aft. & yesterday aft. Over1,000,000 U.S.A. troops now in France.\n","91":"1918\nPrisoners in Thursday's attack now total over 2000. Detachments of U.S.A. troops & tanks assisted our men. Many Planesalso took part bombing & M.G. enemy lines.\n","92":"\nAr Rivery. Weather fine.Lewis gun drill in morning. Enemy counterattacked yesterday morning on our fronts & beaten off with heavy loss, leaving more prisoners in our hands.\n","93":"","94":"\nAt Rivery. Weather fine. Visual sig until noon.\n\nMon 8th\nAt Rivery. Lewis gun & vis sig until noon. Have heard we go into line for a stunt in a few days.\n","95":"\nAt Rivery. At 8.30 pmwe received orders to stand to in Battle order, to be ready to move to Cachy, near V.B at 5 minutes notice as enemy attack is expected on our front tonight & in the event of our line being forced back over\n\n\n\n\n\n\n\n\nTues 9thJuly1918\nBde is to counterattack at 1 am orders received to stand down.\n","96":"\nAt Rivery. Raining . Vis sig until noon. Australians addressed by M. Clemenceau & thanked for what we had done for France. Enemy shelling with very heavy guns from 7 pm.\n","97":"\nAt Rivery. Orders out to move into trenches tomorrow.\n","98":"\nMarched from Rivery at 12 pmfor the line through Dauors Aubigny & Corbie to a position in a wood on a hill left of the Somme between that River & the annexe. Thevillage of Vaux is just in front on the left bank of the river & on the opposite side of the river lies Vaux. Further along on the same side is Hamel, (ow a heap of ruins) captured by our men on July 4th with Hamel & Vaire Woods on the hill to the left of the town. We marched\n \n\nFriday 12 July 1918\nToday 18 K. Our sig station is on the hilltop at the edge of the wood & we have a fine view of the ground up the valley of the Somme & can see right over the many lines & watch their movements. Further up the river on the right bank lie the ruins of Sailly-le-Sec captured by us in June, & further on is Sailly Laurettes, in enemy hands, the front line running between the towns. Corbie is now badly\n\nFriday 12th July 1918\nwrecked by the German guns, the fine church being almost totally wrecked. Away on our right can be seen the ruins of Villers Brettoneux, in the section we were last holding.\n\nWe have relieved the 12th Bde (4th Div), & have 2 Batts in front line (one on either side of the river) & are in support.\n\nAt 7 pmanenemydump set fire to by our heavy guns.\n","99":"\nIn line Vaux-Hamel sector. On duty 9 amto 3 pm. Weather fine. Enemy shelling our line from the river to Hamel from 9 to 10 am& from 11 to 11.30 am. At 7 pmseveral enemy planes came over our lines & while some of them drew the fire of our AA guns 2 others got through & brought down 2 of our O.Bs in flames. We could see the observers descend by means\n\nSat. 13th July 1918\nof the parachutes provided for the purpose. The enemy planes got back to their own lines under heavy fire.\n\nSeveral of our planes arrived on the scene too late to interruptthem.\n\nYesterday the French attacked on the Hangard-Mareul front & gained all objectives.\n","100":"\nIn line Vaux-Hamel Sector. On duty 3 to 9am.Very heavy fog. Enemy shelling over front line & near positions.\n\nBuilt a roof on our dug-out & camouflaged it with boughs.\n\nFrom 5 amvery heavy art fire on our right (V.Brett & Hanguard). Through the day our art has been very active on rear of enemy lines. On duty 9 pmto 3 am15th.\n\n\n\n\n\n\n","101":"\nIn line Vaux-Hamel Sector. On duty 3 to 9 pm. Weather showery. Our60 pdrs & 6\" guns have been busy all day. At 2-45 pman enemy plane got through our AA fire & brought down another of our observations balloons in flames & got back to his own lines again.\n\nEnemy has begun another great attack on the Chateau Thierry-Rhiems front (where the French & U.S.A. troops are holding the line), on a 50 mile front & is being held up so far.\n","102":"\nIn line Vaux-Hamel Sector. On duty 9 amto 3 pm. Weather fine. Art. active all day. At 2 pman enemy O.B. brought down by our planes in flames.\n\nWed 17th \nIn line Vaux-HamelSector. On duty 3 amto 9 am. Raining. Several enemy bombers over our lines throughnight. Enemy artillery active. Our lines heavily shelled at time with big stuff. Good deal of M.G. fire along the line in early hrs of morning. Heavy fighting is still pounding in the south & the \n","103":"\nenemyappears to be held up. On duty 9 pmto 3 am. At 9-15 pmthe whole of our guns & theFrench on our right opened aheavy barrage on enemy lines, this was kept up for an hour & our men & the French then attacked on the front from Hamel to Hangard.\n\nWe had a fine view of it all from our post & one minute after the barrage opened the enemy was sending up his S.O.S. signals & his guns were soon\n\nWed 17th July 1918\nretaliating. Hundreds of verylights of all colours were sent up by the enemy & the whole front was lit up by them & the flash of the guns. Just prior to the attack a very heavy storm had passed over & the night was very dark. By 12 mid'the guns had ceased firing & things were fairlyQuiet along the front again.\n\n\n","104":"\nIn line V-H.\n\nWeather fine. Came off duty 3 am. On again 3 pm to 9pm. At 7 pmour planes bombed enemy camps & positions in rear of their lines. Big fires & explosions caused in Cerisy & on the road & railway. Our planes under heavy fire. At 8 pmour guns put down very heavy barrage over the enemy line on the V. Brett. sector. Last nights attack was very successful & all objectives were gained.\n","105":"\nIn line V. Hamel Section. Weather fine. On duty 9 amto 3 pm. Our 60 guns have been busy all the day on the rear enemy lines. At 12.10 pmanenemy dump went up. Good deal of movement behind his lines. French report enemy back 10K on 40K front in the Saissons-Chateau Thierry Section & taken 20000 prisoners & 100 guns. This is the best news we have had for some time.\n","106":"1918\nIn line Vaux-Hamel Sector. Weather showery. On duty 3 to 9 am. Enemy has bombarded our lines heavily all night & early morning with HE. Our guns retaliating. French now report capture of 30 000 prisoners & 500 guns in the South.\n\nAn enemy plane brought down in flames on our front at 7 am. On duty 9 pmto 3 am21st.\n","107":"\nCame off duty 3 am. Not feeling too good. Our guns have been busy all the morning. Weather fine. On duty 3 pmto 9 pm.\n\nTotal prisoners in the operation by the French U.S.A. & British troops in the South now total 32000 & 650 guns.\n\nFrom 10.20 pmto 1 amour position under fire from 4-2 guns. One shell landed within4 ft of our sig stn dugout, & part of the walls fell in.\n\nMon 22nd\nIn line Vaux-Hamel sector. On duty 9 to 3 pm. Our heavy guns & Howitzers have\n","108":"\nbombarded the enemy rear positions heavily all day. One of our O. balloons brought down in flames by enemy plane at 10.30 am. French still pushing enemy back in Chateau Theirry Noyan sector.\n","109":"\nIn line V-Hamel Sector. On duty 3 to 9 am. Very heavy art fire to the south.\n\nMessage through at 12 pm from French who attacked this morning on 8000 yds front on Hanfard-Moreul sectors & up hill 10 oclock they had advanced 2000 yds & taken 800 prisoners.\n\n\n\nTues 23rd July1918\nShowery all day. On duty 9 pmto 2 am","110":"\n\nWed 24th\nIn line Vaux-Hamel sector. Weather showery. Prisoners taken in. The attack by the French on Hangard-Moreuil sector now number 1700, several field guns & many M.G.'s. In the fighting further south prisoners now total 32000 & 850 guns. On duty 3 to 9 pm. Enemy art. active. Our heavy guns also . So no U.S.A. sig's now appto us for experience.\n","111":"\nIn line V-Hamel sector. On duty 9 amto 3 pm. Enemy attempted a raid on our left Batt in line at 3 am. From 2.30 to 3 amhe put down a heavy barrage on our lines & then attempted the raid, but was beaten off with loss. Our art is very active.\n","112":"\nIn line V.Hamel sector. Raining. On duty 3 amto 9 am. Art fire at times heavy. Prisoners taken by the French in Tuesday's attack on Hangard-Moreuil front total 1850. 45 T.M.s & 300 M.G.s on duty 9 pm to 3 am26th.\n","113":"\nIn line Vaux-Hamel sector. Raining. Enemy sending over many gas shells, through the night artillery fire heavy. Came off duty 3 am. On again 3 pmto 9 pm. Our posit swamped out with the heavy rain.\n","114":"\nIn line V. H. Rain cleared off. On duty 9 amto 3 pm. Enemy shelling midges on our left front with HE. We now have some U.S.A. signs appto us for experience. Our art active.\n\nFrom 10 pmto 11-30 enemy shelling heavily with gas.\n","115":"\nIn line V. Hamel. On duty 3 amto 9. At 12.30 this morning after aheavy bombardment ourmen attacked on the Morlancourt front & gainedall objectives advancing the line 700 yds. 1 Officer 50 men taken prisoner & 20 M.G.'s Enemy casualties heavy. All through earlierhrs our heavy art has shelled enemy lines & comm.\n\nOn duty 9 pmto 3 am.\n\nOn duty. Enemy shelling all along our lines with gas & H.E. Prisoners in last nights operations now total 90.\n\n\n\n\n\nTues 30th July 1918\nIn line V. H Sector. Weather very hazy. On duty 3 pmto 12 when our11th Bde took over from our Batt on right of river, & 54th Bde (Eng) relieved ourleft batt. Our Bde holding Aubigny line of trenches now.\n\nMarched from post in line at 4 amthrough Corbie & La Neuvelle to position in reserve trenches.\n\nOur 34th had 4K & some wounded & 54th Bde also lost some men while the relief was taking place.\n\nEnemy still being pressed back on the Marne.\n\nOur","116":" Div recaptured Merris.\n","117":"\nHolding Aubigny line. Weather fine. Art. active along front.\n","118":"\nHolding Aubigny line. Weather fine. At 3.30 pm2 enemy planes came over & brought down 4 of our OBs in flames, the observers jumping out & coming down by means of theirparachutes. Our AA guns brought down one of the Bosche planes. In the aft. Sig's played Hdqrs staff cricket & won.\n","119":"\nJuly\nAug\nHolding Aubigny line trenches. Raining. Good news from Soissons front. French & U.S.A. troops sill advance &\n\n\n\nFrid 2nd","120":"\n","121":"\ncaptured several villages etc. Artillery fire heavy on our front.\n\nSat 3rd\nHolding Aubigny line. Raining. We go into front lines again tomorrow night. All things point to an attack by us. Tanks, guns, ammunition & men going forwardall through last night to be in readiness.\n\nSeveral divisions of U.S. troops in rear of us. Enemy planes over our lines bombing for last 3 nights. Soissons captured by French\n\nSun 4th\nJuly\nAug 1918\nHolding Aubigny line. Weathershowery. All night long guns ammunition, pontoon bridges etc have been coming up in readiness for the coming attack.\n\nSo far as we know we are to attack on a front from here to Arras & our Bde is to hop over in the first attack on the Hamel front. U.S.A. troops to advance after our men.\n\nFrench & U.S.A. troops still advancing in the South. Some of our L. Handers taking part in it have received high praise from\n","122":"\nGen Mangin, the French commander.\n\nMon 5th\nHolding Aubignyline. Still showery. Guns etcTanks, amm. & other supplies coming up still.\n\nTues 6th\nHolding Aubigny line. Preparations still being made for our attack. Weather bad rain every day. Our Bde is to attack first with English Div on left & our 2nd Div on right, on their right the Canadians, then the French attack to extend from the Ancre to South of\n\nTues 6th Aug 1918\nMontdidier, over 20 M.\n\nOur objective is to a depth of 400 yds on the Hamel front & includes Lacueche, Acquarie & Jean & Susan Woods. Our 4th Div is then to advance over us & then over the Second Div. and continue the attack. Tanks & armoured cars to assist us. British troops that relieved us onleft of Somme a few days ago attempted a raid in the enemy line this morning. None of the raiders returned, being either killed orcaptured. Enemy then\n","123":"\ncounterattacked & recaptured the whole of the ground won by our men on July 28th. Rec papers from Alice. Have just heard that all June mail to Australia sunk. Many enemy bombers over through night. Art fire heavy on front\n\nWed 7th\nHolding Aubigny line. At 4 am53rd Eng Div attacked & regained the ground lost on left of Somme. We move up into line for attack which begins on Thurs morning. Left at 1-30 pm& reached\n","124":"\nour position in Vaire Wood at 5 pm. This is close up to our front line trenches & will be our Bde Hdqrs until our men advance, we then move forward. Hollis, Henderson & I are to keep in comm with our adv Div Station on the other side of the Somme, 4 maway, by Lucas Lamp. Built up a post with sand bags for our sig station, enemy shelling us with gas & HE, all night.\n\nOur batts in position for att. - at 1 am. Tanks move up near line.\n\nEnemy appears to be in very nervous state along the\n\nWed 7th 1918\nZero pt 4-20 amtomorrow Thur morning.\n\nThur 8th\nAt 4-20 amthe attack opens. All along our front the guns, there are hundreds of them, open fire at the same time & put a terrific barrage down on the enemy front lines. Our men, with the tanks, then go over the top & begin the attack. The noise of the guns is deafening & the air is soonfull of dust smoke so that we have great\n\n1918\ndifficulty in reading the signals by lamp. At 5 ammessage from 35th Batt from other side of Wood, to say that they are through it & all going well. 34th follow & mop up the Wood.\n\nEnemy guns are retaliating. 6 amfirst batchof prisoners come in & from then on batches arrive every few minutes. They are fresh looking troops well clothed\n\n& appear well fed. As our troops advance our art follows up & takes up fresh positions & bombarded the retiring Huns. Ourwounded men now coming in prisoners being used as S.B.\n\nAt 6.30 am, 4th Div taken up the att & move on through our men, who have gained all their objectives. Tanks, armoured cars & calvary push on & do great work. Hundreds of our\n\nplanes taking part & heavy fighting in the air.\n\nPrisoners say our attack was wholly unexpected.\n\nOur Div& Canadian on right report all objectives gained & many prisoners. Advance cont all day & at 7 pmenemy driven back 10 ksince attack began.\n\nToday we have lived on biscuits & all feel done up. Sailly Laurette, Cerisy, Warfusee, Marcelcave other villages captured. Up to\n\n7 pmour Bde has taken over 1000 prisoners & many guns. Our casualties not heavy. Some more of my old Batt mates gone west. At 11 amwe moved our stn forward into what had been an enemy post in the early morning & keep in comm with our batts. Many German dead on the field & some of our own lads. At 2 pmour 1st Division (who came down from the\n\nNorth a few days ago move forward to the attack. Reports come in of many guns, incl an 8\" battery taken up to 8 pm5700 men & 104 guns taken.\n\nOn duty all night. Eng Divs on our left held up & our 4th Bdesent over to help them.\n\nThe battle still goes on.\n\nFrid 9th\nOur men attack with Eng & U.S.A. troops on left of the Somme & after heavy fighting gain ridges & take many prisoners.\n\n& guns. From our post I watched the battle & could see our men go forward supported by tanks. Our guns pounding the enemy at the same time. Big lots of prisoners coming in. Heavy fighting in the air all day & enemy machines bombing us all night. Weather good. Guns, men transport etc moving up on all roads. Enemy left great amount\n\nof equipment, & supplies of all kinds behind. Our advance continues, & Div on right, & the Canadians & French report good progress.\n\nSat 10th\nAttack continues our Bdes & 4th Div relieving each other alternately. Our guns follow up & pound the enemy. In the attack on Thur morning 5 of my old mates of the 35th (sigs) took 50 prisoners in one lot. At midday both flanks report\n\ngood progress.\n\nAt 9 pmwe again move our stn forward to Jean Wood arrthere9 12 mid. All day art & transport moving up.\n\nEnemy bombing & shelling us heavily all night.\n\nSome of our men wounded & many horses killed by bombs. More villages taken by Canadians. 30 men of 3rd Batt killed by bombs last night.\n","125":"\nOur post in Jean Wood. Att goes on. Enemy still shelling us.\n\nPrisoners now over 20,000 & 300 guns. Our 37th Batt lost heavily in an attack last night, but gained objective. 2nd & 4th Div advance on our right.\n\nAll our lines forward cut by bombs & shell fire through night & as none of our linesmen here, Ferguson & I went out at\n","126":" am& repairedthem. Several captured guns in this wood which enemy blew up before retiring. Our","127":" Bde att on our left last night, & after stiff bayonet fight tooktheposition, Killing 150 & capturing 200 Germans. Our losses 60 K & W.\n","128":"\nIn Jean Wood. Everyting going OK all along the front. Enemy again bombed us heavily through night.\n\nAn enemy plane brought down near our post, & pilot taken prisoner. This is the third on our section this morning. This pilot (prisoner) says he is sick of the war & thinks the end will soon come. He also says that things are not bad in Germany & there is no shortage of food. In comm by wi's with our batt in line. At night an EngDiv relieved us\n\n& we move back to Vaire on the Somme. Enemy bombing village through night. Prisoners now over 30000 & 500 guns.\n","129":"\nAt Vaire, resting.\n\nGuns going heavy up in the line.\n\nBattle front now runs from the Ancre to south of Montdidier which has been captured by the French. Proyart taken by our men yesterday.\n\n& enemy now about 17 kfrom original line.\n\nEnjoyed my first wash for 4 days.\n","130":"\nBde resting at Vaire. Had a general clean up etc. Weather fine. More bombs last night. This village like all others within range of German guns, badly wrecked. Had a letter from girls, only mail for over a month\n\n"}}