{"Document Name":{"0":"Diary_0369","1":"Diary_0369","2":"Diary_0369","3":"Diary_0369","4":"Diary_0369","5":"Diary_0369","6":"Diary_0369","7":"Diary_0369","8":"Diary_0369","9":"Diary_0369","10":"Diary_0369","11":"Diary_0369","12":"Diary_0369","13":"Diary_0369","14":"Diary_0369","15":"Diary_0369","16":"Diary_0369","17":"Diary_0369","18":"Diary_0369","19":"Diary_0369","20":"Diary_0369","21":"Diary_0369","22":"Diary_0369","23":"Diary_0369","24":"Diary_0369","25":"Diary_0369","26":"Diary_0369","27":"Diary_0369","28":"Diary_0369","29":"Diary_0369","30":"Diary_0369","31":"Diary_0369","32":"Diary_0369","33":"Diary_0369","34":"Diary_0369","35":"Diary_0369","36":"Diary_0369","37":"Diary_0369","38":"Diary_0369","39":"Diary_0369","40":"Diary_0369","41":"Diary_0369","42":"Diary_0369","43":"Diary_0369","44":"Diary_0369","45":"Diary_0369","46":"Diary_0369","47":"Diary_0369","48":"Diary_0369","49":"Diary_0369","50":"Diary_0369","51":"Diary_0369","52":"Diary_0369","53":"Diary_0369","54":"Diary_0369","55":"Diary_0369","56":"Diary_0369","57":"Diary_0369","58":"Diary_0369","59":"Diary_0369","60":"Diary_0369","61":"Diary_0369"},"Date":{"0":"unknown","1":870.0,"2":984.0,"3":988.0,"4":1009.0,"5":1011.0,"6":1012.0,"7":1024.0,"8":1033.0,"9":1040.0,"10":1044.0,"11":1087.0,"12":1125.0,"13":1160.0,"14":1161.0,"15":1185.0,"16":1190.0,"17":1200.0,"18":1202.0,"19":1210.0,"20":1217.0,"21":1218.0,"22":1219.0,"23":1220.0,"24":1221.0,"25":1224.0,"26":1240.0,"27":1305.0,"28":1311.0,"29":1422.0,"30":1423.0,"31":1426.0,"32":1521.0,"33":1771.0,"34":1772.0,"35":1817.0,"36":1850.0,"37":1854.0,"38":1859.0,"39":1863.0,"40":1870.0,"41":1877.0,"42":1882.0,"43":1891.0,"44":1915.0,"45":1932.0,"46":1955.0,"47":1976.0,"48":1977.0,"49":1978.0,"50":1984.0,"51":1992.0,"52":1993.0,"53":1994.0,"54":1995.0,"55":2005.0,"56":2015.0,"57":2016.0,"58":2020.0,"59":2022.0,"60":2023.0,"61":2025.0},"Entry":{"0":"\n","1":"\n\nI went into camp at Kiama where I was in training for 4 months.\n\non","2":" Sailed from Sydney by the troopship \"Anchises\" arrived at Adelaide","3":"\n\nafter taking more troops on left Adelaide same day.\n\nin the afternoon of the","4":" arrived at Cape Town. Next morning went ashore after having a march went to a park and after having some sports the citizens of Capetown gave a concert to welcome us.\n","5":" was on guard. next morning\n","6":" sailed from Capetown.\n\non","7":" arrived at Cape Verde. St. Vincent after taking water and coal on sailed same night on","8":" arrived at Plymouth England where we took the train to our training quarters at no 2 Camp Codford Salisbury Plains.\n\non","9":" proceeded to London\n\non 4 days disembarkation leave. on","10":" arrived back in camp.\n\non","11":" moved our training quarters to no 13 camp Codford.\n\nThe following month on the","12":" again moved our quarters to no 14 camp where I remained until going over to France.\n\non","13":" left Codford on our way\n\nto France.\n\nNext morning","14":" arrived at Folkestone. The same afternoon left Folkestone for Boulogne where we arrived a few hours later. Camped at Boulogne that night. Next morning proceded to the Base at Etaples where I was in training for 3 weeks.\n\non the","15":" left the Base to join\n\nthe Battalion. Being then transferred I went to the","16":" Battalion The Battalion then being out for a rest I joined D. Company at Meaulte near Albert where we were working on a munition dump for a fortnight on the","17":" left Meaulte and marched to Bazentine where we camped for the night. next morning marched\n\nto Wallencourt.\n\nnext morning","18":" we marched to Bapaume camping just outside the town.\n\non","19":" we marched nearly up to the trenches for the purpose of laying down a cable. We were shelled fairly heavily while thus engaged but luckily there were no casualties \n\non the night of the","20":" we marched up to \n\nthe trenches taking up our position in a sunken road ready to hop over. We were there a couple of hours when we received word to go back to our resting place again as the tanks had failed to come up in time. we were shelled heavily going back. The next night","21":" we went to the trenches again taking up the same position.\n\nAt about 4 o’clock on the","22":" while it was snowing heavily we hopped over. Having no artillery support the tanks were to go in front of us to cut the barb wire and shell the German trenches. But unfortunately the tanks failed and we had no support at all. The German Machine Gun fire being very\n\nheavy we soon lost a lot of men. We managed to capture the both lines of German trenches and hold them About midday the Germans counter attacked and after keeping them back for an hour we run out of bombs. And could not get any more. Then the Germans forced us back and I was wounded in the left leg and with about 900 other Aussies\n\nI was taken prisoner. We were then marched (in batches of about 40) to a small village about 8 miles behind the lines. When we arrived there we were searched and any article of value was taken from us. We then had our wounds dressed and then moved to a large church. After making a meal of a piece of German black bread we slept in the church that night.\n\non the","23":" we were taken in ammunition wagons to a small village a few miles further on where the wounded were kept in a Red cross tent until the train came to take us into Germany.\n\nOn the","24":" we got the train to Germany.\n\nOn the","25":" we arrived at our destination at Munster\n\n(Pov. Hannover) Germany where we went to a Hospital but did not receive much treatment for our wound\n\non the","26":" I was sent to a prisoners camp at Soltau where I was convalescent for 6 weeks then I was sent into the working camp. Here we started work at 6 a. m till 6 P.M our breakfast a drink of \n German \n coffee and a slice of black bread.\n\n(if we had a piece left from the night before) we had before we went out in the morning.\n\nAt 12 o’clock we came into dinner of a bowl of soup made out of (preserved mangles) at one o’clock we started work again. At 6 o’clock we finished and had our drink of Coffee and slice of black bread again. I remained in this camp for about 3 weeks. on the","27":"\n\na batch of about 12 Aussies and 8 Frenchmen were sent away to another camp named Konigsmoor.\n\nOn the","28":" We were sent to a small village to work called Karlshofen. Here we were engaged cutting peat.\n\nOn the","29":" we returned to Konigsmoor\n\non","30":" returned to Soltau here we remained working for about 10 days\n\non the","31":" we were sent to a big salt factory at Luneburg. Here we were engaged making salt.\n\nOn the","32":" I was sent to a smaller factory at the other end of the town. Here I was employed as fireman in the furnace. On the","33":" I was sent back to the big factory and they gave me a job at loading\n\n \n\nrailway wagons with lime. When the Armistice was signed we refused to do any more work and after many kicks and hits from fritz they gave in to us.\n","34":" on the","35":" we were sent back to the camp at Soltau but here we had to wait for a month for a train as it was too far to tramp it.\n\nOn the morning of \n\nthe","36":" we got the train to Hamburg. At Hamburg an English Transport the \"City of Poona\" was waiting for us.\n\nOn the","37":" we arrived in Hull England From here we took the train to a camp at Ripon in Yorkshire. Here I was fitted out with a uniform. on the","38":" we proceded to London on a months leave.\n\non the","39":" I went to Dundee Scotland stopping there a week. On the","40":" I went to Edinburgh on the","41":" I left Edinburgh for Glasgow on the","42":" I went back to London.\n\nOn the","43":" I went back to camp at Sutton Veny.\n\non the","44":" I went to London again on 14 days leave\n\non the","45":" went\n\nback to camp again\n\non the 1st.April I shifted camp to Hurdcott.\n\non the","46":" went on 4 days leave to London.\n\non the","47":" proceeded to London.\n\non the","48":" marched through London on the Anzac march\n\nnext morning","49":" returned to camp \n\non the","50":" left Plymouth by the SS China arrived at Port Said","51":"\n\nsailed next day.","52":"\n","53":" night called at Port Suez. Sailed next morning","54":" \n\non the","55":" called at Colombo here we went ashore for a few hours\n\nleft Colombo Same night\n\non the","56":" arrived at Fremantle went ashore for a while\n\nSailed next day","57":"\n\narrived at Adelaide","58":" sailed same day\n\narrived at Melbourne in the morning of the","59":" went ashore\n\nfor about 6 hours.\n\nSailed","60":"\n\nArrived at Sydney on the","61":"\n\nWe were taken from the Wharf by Red Cross motors to the Anzac Buffett and after being fixed up with our pass and discharge I arrived at my home about 4 P.M.\n\n"}}