{"Document Name":{"0":"Diary_0394","1":"Diary_0394","2":"Diary_0394","3":"Diary_0394","4":"Diary_0394","5":"Diary_0394","6":"Diary_0394","7":"Diary_0394","8":"Diary_0394","9":"Diary_0394","10":"Diary_0394","11":"Diary_0394","12":"Diary_0394","13":"Diary_0394","14":"Diary_0394","15":"Diary_0394","16":"Diary_0394","17":"Diary_0394","18":"Diary_0394","19":"Diary_0394","20":"Diary_0394","21":"Diary_0394","22":"Diary_0394","23":"Diary_0394","24":"Diary_0394","25":"Diary_0394","26":"Diary_0394","27":"Diary_0394","28":"Diary_0394","29":"Diary_0394","30":"Diary_0394","31":"Diary_0394","32":"Diary_0394","33":"Diary_0394","34":"Diary_0394","35":"Diary_0394","36":"Diary_0394","37":"Diary_0394","38":"Diary_0394","39":"Diary_0394","40":"Diary_0394","41":"Diary_0394","42":"Diary_0394","43":"Diary_0394","44":"Diary_0394","45":"Diary_0394","46":"Diary_0394","47":"Diary_0394","48":"Diary_0394","49":"Diary_0394","50":"Diary_0394","51":"Diary_0394","52":"Diary_0394","53":"Diary_0394","54":"Diary_0394","55":"Diary_0394","56":"Diary_0394","57":"Diary_0394","58":"Diary_0394","59":"Diary_0394","60":"Diary_0394","61":"Diary_0394"},"Date":{"0":"unknown","1":1674.0,"2":1675.0,"3":1676.0,"4":1677.0,"5":1678.0,"6":1679.0,"7":1680.0,"8":1681.0,"9":1682.0,"10":1683.0,"11":1684.0,"12":1685.0,"13":1686.0,"14":1687.0,"15":1688.0,"16":1689.0,"17":1690.0,"18":1691.0,"19":1692.0,"20":1693.0,"21":1694.0,"22":1695.0,"23":1696.0,"24":1697.0,"25":1698.0,"26":1699.0,"27":1700.0,"28":1701.0,"29":1702.0,"30":1703.0,"31":1704.0,"32":1705.0,"33":1706.0,"34":1707.0,"35":1708.0,"36":1709.0,"37":1710.0,"38":1711.0,"39":1712.0,"40":1713.0,"41":1714.0,"42":1715.0,"43":1716.0,"44":1717.0,"45":1718.0,"46":1719.0,"47":1720.0,"48":1721.0,"49":1722.0,"50":1723.0,"51":1724.0,"52":1725.0,"53":1726.0,"54":1727.0,"55":1728.0,"56":1729.0,"57":1730.0,"58":1731.0,"59":1732.0,"60":1733.0,"61":1734.0},"Entry":{"0":"\n\n","1":" – Lewis Gun work in afternoon. Washed sox, towel etc in morning. Very hot day. Swimming after tea.\n","2":" Preparing to move out to trenches. Packing up gear etc in morning. Handed in blanket and overcoat. In afternoon Ted Heath \"Norrie\" and self went for last swim in lagoon. Moved out about 9.30 p.m. – just on dark – and proceeded to support line (Digger’s Support) on left of Villers Britonneux. Shortly after arrival went on wire carrying fatigue. Salvaged old \"Tommy\" overcoat so managed to get 2 or 3 hours sleep in early morning. Poor accommodation in trench so little chance to sleep during the day.\n","3":" – Put in poor day, thinking of \"hop over\" to-morrow morning leaves us all rather \"screwed up\". After tea busy in preparations. No Sleep - cold and anxious – but NOT funky.\n\nThursday, 4th. – Overcast during very early hours, but got a glimpse of \"lucky\" star and felt brightened. Left support trench at 1.40 a.m. loaded up like a mule. Usual fighting order, 120 rounds of S.A.A. and 2 bandoliers – in all 220 rounds: 2 mills bombs: extra water bottle: shovel – down back, and a pannier for Lewis gun – all hellish weighty. Long struggle through trenches to front line. Out on tape about 2.30 and took \"Tommy\" overcoat with me to keep cold out as we were given to understand we would be on the tape for an hour. Only out a few minutes however when barrage opened. In excitement left pipe from Rouen in overcoat pocket on the tape. Advanced in second wave: first wave consisted of 2 lines in extended order: 2nd wave sections in artillery formation, lastly moppers up and in rear of all 3 tanks to our Battalion sector. Knees knocked when barrage opened, but after the start all trepidation vanished. Wonderful barrage put up, ground shrapnel shell on explosion lit up the scene and we caught glimpses of Fritz going for life. No return barrage and no machine gun fire in return. An easy walk over. Slung my gun and stumbled across old \"no man’s land – got caught in wire entanglement and tore my pants at knee badly. Fell in many shell holes and swore horribly. Experiencing none of the \"blood lust\" nor became \"another man\". A most prosaic affair. Met no Fritzs myself until near final objective (3rd line of his trenches) Spared his life to rat him but found nothing – he wore an iron cross ribband too! On reaching objective tanks went out ahead and also mopping up party. Rest created fire steps and prepared trench quickly to withstand a sudden counter-attack but it didn’t come. Splendid co-operation from aeroplanes – dropped M.G. ammunition per parachute but a few boxes went into Fritz’s territory. One casualty from 9 platoon caused by pellet from own 18 pounder shrap. and he walked out. Very busy ratting dug-outs and packs but self and Heath had very poor return. Some got revolvers and watches but our quarter yielded nil. Spent rest of day in digging in little posts along the line. On our left","4":" Div. had harder work but all units reached their objectives with remarkably few casualities. On dark our artillery put over a barrage and cut up a counter attack on the 4th Div. who got fifty odd prisoners from survivors. Fritz sent over 2 counter barrages during the night and gave us many anxious moments and much ducking and diving.\n","5":" – Another barrage in morning from us and a counter from Fritz. Usual trench life. Managed to get a little sleep. During Fritz’s barrage in early morning – about 2.30 a.m. had several close shells on parapet and parades but no harm done. Close shave for Ted Heath. More ammunition etc brought up during day so feel\n\nconfident to stand off his counter attacks. Another barrage from us on dark and cut up his attack on our right. Usual return barrage Expected to get relieved to-night but sadly disappointed as the relief was not effected. Heard Ossie Green is badly wounded.(died) Hunt (C.O.M. was killed during stunt. Wiring party out in front during night.\n","6":" – Early morning barrage again. Still lucky, though shells landed unpleasantly close at times. Safe enough at bottom of trench but look out must be maintained which increases chance of being hit considerably. Quiet morning, but after dinner Fritz opened up with whizz bangs near us and gave us 6 ½ hours continual bombardment and yet no one was hit, but our nerves were jangled to pieces. All of us suffering from diarrhoea on account of gas sent over us last night during the bombardment. After dark our gun crew and 4 men out digging outpost – no bombardment, thank the Lord, but continual steady shelling but few on front line - no casualties. \n\n","7":" – Relief effected about 1 o’clock a.m. – got out in old No man’s land and immediately our platoon got lost, hit a wood and went towards our rear – near old support trench across the road meet Mason","8":" Transport Officer with limber – 4 horses and 3 men, all up here for the purpose of dragging out the 77 m.m. field gun captured by \"D\" company. Dumped our packs with limber and all went back and hauled out the gun – over trenches, across the road up to limber – tied gun to limber, piled on our packs and all mounted on gun or limber and so rode by devious route to trenches from which we had entered the line. As we passed heavy batteries the morning barrage opened and we saw this end of the play. Arrived at trench well after daylight. Ted Heath and self in old dug-out. Received one blanket for the two of us and after a drink of hot cocoa retired to bed and slept until after midday. Had breakfast? And dinner combined. Went to lagoon and had a swim and on return managed to buy 10 francs worth of stuff at our canteen for a \"blow out\". Greatly delighted to receive letters from Ruby, Mother, Dad, Gwen and Johnnie, all about the","9":" dates, also one from Miss Alston and letter from Web Gilbert with Ireland snaps in it but also some snaps not mine. Great relief to be away from front line. On aeroplane guard 9.30 – 11.30 and then to bed, dog tired.\n\nMonday 8th. – On aeroplane guard 5.30 to 7.30. Secured round and salvaged brown paper and boxes and tins and scrap ends of string to bundle up souvenirs to send home. At 8 o’clock went down for hot shower and clean change at Divvy baths. Breakfast on return. Busy all morning bundling up souvenirs – all ready barring Fritzy dixie and bayonet but hope to get them off too. On guard again 1.30 – 3.30. After tea heard Foxie is to get his second stripe and a couple of our hands in 9 are to get a bar each. Very downhearted at my exclusion – terribly full up of this life in the army. Posted parcel to Ruby, one to Bert, and German Army book to Dad, all souvenirs of my Villers Bretonneaux stunt (5 fr.50 c.) Hear that the papers are commenting on the Yanks and Aussies fighting together for the first time. Very few Yanks were in the stunt however. About 9 o’clock \"stand to\" was ordered. Congratulatory messages were read form different people and quarters on our stunt. At midnight hot tea was served and \"stand to\" still continued.\n\nTuesday, 9th. – \"Stand down\" about 2 a.m. just a \"try on\". Hot day. Writing letters home and to Miss Alston\n","10":" Company all out cable burying, self and Heath exempt. Got 2 books from Y.M.C.A. \"T. Tembaron\" and \"The Way of the Strong\" Posted letters to Mother and Gwen.\n\nThursday,11th. – Cable burying in morning, between railway lines, damned hard work. Posted letters to Ruby and Miss Dickson, of Ayr. Walked to","11":" Field Engineers and saw Ted Barrett. He was delighted to see me as I had been reported \"missing\" to him. Recd. Watch back from Paris, per Silver, unmended, Fritz shelling near possy.\n","12":" – Cable burying in morning. Phil. Starr to Paris, with my watch and letter to Miss Alston. French . Sports in afternoon. Recd. Letter from Commonwealth Bank re cable remittance from Dad. Hurrah! Posted letter to Bank and Mrs. Barratt. Fritz shelling near possy.\n","13":" – Cable burying in morning. Spent evening with Teddie Barratt. Posted Fritz dixie to Ruby (2fr.70).\n","14":" – Cable burying in morning. Recd. Papers approx. March 25th, and Lamb’s Essays from Dad. \"Norrie\" to \"Blighty\" with my Fritz bayonet and letter to Web Gilbert.\n","15":" – Cable burying as usual in morning. Pay in afternoon. (40 francs). Recd. Registered parcel A.N. – great!, and 2 registered packets of papers of approx. dates Apl.28 and May 7th. Aeroplane guard from 11 to 1 during night.\n","16":" – Aeroplane guard during day. No fatigue for anyone on account of heavy rain in early morning. Very hot and close. Recd. Parcel A.L. – contents much appreciated.\n","17":" – Very muggy in morning, - thunderstorm during usual morning stunt of cable burying. Very hot in afternoon. Swim in lagoon after tea. Thunderstorm during early night. Usual cable stunt in morning. Hot afternoon with several thundershowers. \n","18":" – Packing up after breakfast –had dinner and then marched into Villers Bretonneux. Took over a cellar for living purposes (8 in cellar) and machine gun position commanding road for attack from Fritz. \"Stand to\" in position 9 to 10 p.m. Comfortable beds and sheets.\n\nSaturday 20th. – \"Stand to\" in position from 3-4 a.m. Self on gas guard","19":" a.m. Slept till 9 – breakfast time. Souveniring round village all day. Fatigue deepening and widening C.T. near front line cut at 9 to C.H.Q. On job about 11; completed about 1 – waiting till after 2.\n","20":" – Home from fatigue about 3 a.m. Stand to till 4 – on gas guard until 5. Slept till 9: more sleep after breakfast\" souveniring, and card playing rest of day. On fatigue again in night from 10 – continuation of same C.T. Job completed by midnight. Ted Heath to Transport lines with out hand in morning. \n","21":" – Back about 1 a.m. \"Stand to\" 2 to 4; not on gas guard so slept till 9. Les Baker left us in morning on Blighty leave. Card playing mostly all day. Self exempt from fatigue to-night. \"Stood to\" at Platoon H.Q.S. 9-10 p.m. Gas bombardment from Fritz.- prevented fatigue party going out – coming over intermittently all night. Letter from Cousin Bessie \/Wilson of Ayr.\n","22":" - Returned to quarters about 1 wearing gas masks. Cellar free from gas so took off masks. Self on guard 3-4. Slept till breakfast, packed up gear and all evacuated the village about midday; gas very thick in places: rumour has it 400 evacuated from Brigade with gas and more coming in. Retired behind village to T. on R. of road – near B.H.Q. Poor dug-outs – no comfort\/bursts of mad minutes occasionally from Fritz. – no one hurt. \n\nReceived letter from Cousin Bessie Dickson of Ayr. Returned to village to act as Dump guard at old P.H.Q. from","23":" Don’t want such another birthday as I’m none too good.- slight attack of gas. 30 years of age to-day. \n","24":" – On gas guard 1-2 a.m. Beautiful early morning: very quiet: up at 9 for breakfast. Received parcel A.K. from home and a parcel of 2 books from Miss Alston, Paris. \"Typhoon\" and \"The Crime of Sylvester Bonard\". On dump guard from 10 p.m. all night. Self and Jack Castles on No.12 post. Couldn’t sleep – hot and itchy – feeling effect of gas in stomach. Early breakfast Remained on post all day with our relief. Good feeding.\n","25":" – Quiet day: went on same guard in evening.\n","26":" – Same as yesterday. Good cellar, good food, good job. Troubled with a boil on left foreleg. Feeling off in the stomach at times still. Only 10 left in our platoon now counting the Corporal in charge. Only 27 fighting men left in the company. Rumours of being reinforced by Yanks.\n","27":" – Cool day: remained with relief on post on account of rain. Parcelling up postcards etc. for all at home: made a parcel for Ruby of two little china ornaments (?) On guard again at night. Had a hit wash.\n","28":" – Back to original billets in cellars in afternoon. Only 6 men and 1 corporal left in 9 platoon. Reinforced by 10 or so Yanks in evening. Digging fatigue in night – self excused on account of boil on left leg. Fatigue shelled: several killed and wounded: Yanks badly scared. Self on gas guard.\n","29":" – Went to R.A.P. and had boil dressed as core came out last night. Preparing to move up. Received reply paid cable from Dad. After dark moved up to front line (outposts) on L of rly to Marceleaux. Flat ground and much machine gun traverse fire.\n","30":" – Beautiful warm day – slept in bottom of trench. Exchange of bombs and machine gun fire with Fritz outpost during night.\n","31":" as yesterday.\n","32":" – At dawn thought Fritz was coming over: barrage on near left but no attack made. Usual routine for rest of day and night.\n","33":" 2nd.- Rain all day: trench soon in bad condition. Spent a miserable day. Were relieved by part of B company in night: 11 and 10 of C. moved round to 5th Brigade on left to reinforce No.9 & 12 (1 man) with \"C\" H.Qrs in close supports in rear of out-post. On ration fatigue to \"Doll’s House\". Lost by Yankee guide: long time to find route. \n","34":" – Trenches muddy and wet. Slept nearly all day. Some 5.9’s near trench during the evening.\n","35":" – On early morning ration fatigue. Weather better and trenched drying up. Got a big dose of gas from a 5.9 near trench in evening. Fatigue in night to Doll’s House.\n","36":" – Fine in morning, but worked up to bad weather in afternoon. Yanks relieved and so left 5 men on outpost made for \n\n20 and 16 men, officers etc including H.Qrs to hold support line for 3 platoons. PURE BLUFF! On fatigue for rations. Track very slimy – bad trip. Details came up to re-inforce us. Ted. Heath back from Hospital and \"Norris\" from Blighty.\n","37":" – On early morning fatigue. Fagged out as this is 2nd trip for 1 night. Very weak from dysentery. At night moved out from close supports back to trench near B.H.Q. near the Doll’s House Rum ration – well appreciated as I felt real bad from dysentery. 22nd in close support now.\n","38":" – Fine day – mud drying up. Self transferred to 11 Platoon as No.2 gunner to Alf. Crawford. Preparing for the big stunt in the morning. 5 supply tanks on fire in V.B. going for hours. Moved about midnight to trench in rear of close supports and sat down to wait for opening of barrage.\n","39":" – About 3.15 a.m. Fritz opened a barrage on us. Very poor and nothing near our trench. Half an hour later our barrage opened. Something tremendous – the earth shook. After 3 hours of barrage we moved up to old position in close support trench. Self immediately sneaked off and went souveniring in old Fritz Line Fight by this time well beyond of Arceleaux. Met Ted Heath on same errand as self. Dugouts etc. well ratted but was lucky enough to find Hock revolver, a great find! Spent all day wandering over battlefield, few souvenirs. Noticed remarkably few dead for amount of artillery in action. No uniform trench system on Fritz side line evidently held very weak. Troubled badly with dysentry still. Slept in support trench for night. All Aussie divisions engaged in stunt. Tommies on L. of us, Canadians on R. on extreme R. French troops. Fine thing to see cavalry going up into action. Great movement forward, and everything went off most smoothly. Well planned and well carried out. Very satisfied to have taken even a minor part in the stunt. \n","40":" – Had a hurried breakfast and all moved forward about 9.30 a.m. \n\nMarched up part of way in column of four s at 50 yards but later deployed into artillery formation. Battle still progressing but well ahead. Halted in fields between Bayonvillers and Guillaucourt. Ted Health and self made a \"deepie\" together from material from Fritzy dump at Guillaucourt. Was pleased by visit from Teddy Barratt and late also from Percy Barratt. Both in the pink. Saw Reg Charteris who was surprised to see me as I had been reported killed to him. Just retired to bunk when Fritz planes came over and made the night hideous with enormous number of bombs - dropped to sleep, nevertheless.\n","41":" – Saw the captured train and big naval guns on railway mountings come through. Captured by 31st Batt. A.I.F. Spent day in position expecting a move any moment. Had good wash and shave. Second since leaving Villers Bretonneux on this 29th July. No change of underclothing however since","42":" Fine day, loafed in the sun – close bombing at night.\n\nSunday, 11th – Posted letter to Ruby and reply pd. cable to Dad. Went on sick parade after breakfast but had to return unattended to as movement orders arrived. Moved up to temporary position on L. of Harbonnieres. Had dinner and tea in old French trench. Bad with dysentry. Just before moving up to reserves I received parcel A.M. from \"Aussie\" and one from Web Gilbert. Paraded to Doc for medicine. After dark moved up to reserve trenches between Framerville and Vauvillers. On way to trenches got lost and all lay in open field while Hun planes dropped bombs all round us. Close shave at times. Self, Crawford and Cpl\n\nLavender in old empty Fritz ammunition dump.\n","43":" – Stand to from 3.30 a.m. to 5.30 Did a little souveniring but slept most of the day. Still bad so paraded again to Doctor for more medicine. On gas guard during night. Fritz over in planes as usual.\n","44":" – Slept most of day. Delightful weather. Found trench periscope while out souvenir hunting. Cpl. Lavender to Corps School in afternoon. Recd. Letter and p.c. from Miss Alston. Push going forward on R. and L. but stopped here. Artillery gradually massing in rear of our position. Heavy shells land in both villages from Fritz but trench itself is quiet.\n\nWednesday, 14th – Sleeping most of day. Delighted and relieved to get mail from Aussie: 2 from Ruby with little Nance’s coloured p.c. portrait dated about 6th of June. One each of same date from Mother, Dad, Gwen, Johnnie, Ethel Barratt and Edie Eastaugh: first mail since","45":" On aeroplane guard.\n","46":" – On all-day fatigue, digging dug-outs for Brigade well in rear of line. Fine day but fed up with the army. Sent to Ruby etc. Villers Bretonnneaux souvenirs with Fred Fisher the Q.M. Heavy bombardment during night, but so fagged that I slept through it.\n","47":" – Hot day: sleeping most of day. Walked to Harbonnieres for water in afternoon. Cool night.\n","48":" – On salvage fatigue in morning. Salvaged water bottle and \"Aussie\" equipment. In afternoon warned for line. About 9.30 p.m. proceeded on R. of Frazerville to quarry on sunken road beyond village. Dumped gear and carried rations and bombs to front line held by","49":" Retd. to Quarry for gear and took up position in support line in rear of 22nd. Settled about midnight. \n","50":" – Waiting in small hole with Alf. Crawford for barrage to open. About 4 a.m. the show started. Shockingly poor barrage plenty of return fire fromFritz and bookoo machine gunfire. Fire slackened about 6 a.m. Had poor breakfast. Very like rain. Slight showers occasionally. Just dozing to sleep in cramped position when about 9.30 was one of 23 and 1 officer detailed for job of bombing Fritz out of possy the 22nd failed to take. Went to Quarry and had to return for equipment to support line. Plainly visible from Fritz line but strange to say got no machine gun fire. Feeling very windy at the prospect of a \"box-on\" as we have a damn poor officer in charge. Had a long hard trip by round-a-bout route to line to find the job completed by the 22nd who however are sadly cut to pieces. Had to dodge across road commanded by sniper and take up post on Lihons Road near village of Herleville. Post in old French trench long out of use, and enfiladed by Fritz guns. Bad possy. Dug in and went souveniring. Got box of Cigarettes. New dixie, etc. All in bad state of nerves and not improved by constant Fritz sniping and occasional minnenwerfer fire. Wounded Aussie crawled into line, while wounded Hun called for help vainly out in front. A terrible long weary wait – were relieved by 2 L (Tommies) about 10 to12 midnight. Self had to make one of four bearers for wounded Fritz who was brought in soon after dark. Most damnably relieved when Tommies arrived. Dreaded a counter attack on account of our few numbers. \n\nMonday, 19th. – Carried Hun to Quarry and then all went out via old position in ammunition dump to near Harbonnieres where cookers were. Badly fagged but found stew and tea most acceptable after long walk, even though it was a poor sample. After short spell set out for close to Harbonnieres and took motor lorries about 3.30 a.m. and at daybreak set out for Daours. Slept most of way for all the jolting as we have been 2 days and 2 nights without a wink of sleep. Arrived at Daours about 6. Had some cocoa and rolled into a blanket and slept like a log. Was awakened about midday and had breakfast. Went afternoon to Pay Sergeant and had credit note for 5 £ (cable) put in paybook: handed in 2 postal orders for 2 £ each to be forwarded to Horseferry Road to be credited in book. Went to Post Office and received parcel A.O. from Dad and birthday parcel from Ruby despatched from Olinda. Also a book from the Paris lady, \"The passionate friends\" by H.G. Wells. Had clean up and good spell. Fine evening spent in yarning with Phil Starr Bed early and slept like a log. Had hot bath and change. \n","51":" – Parade at 10: off at 11. Bundling up souvenirs and books to send home. Had medical inspection for scabies and bad teeth, self A.1. Digging in tents to make bomb proof in afternoon. Had much needed haircut and got boots mended. All fixed up now. Phil Starrand self spent evening together. Slept well. \n","52":" – Hot bath and change after early breakfast. Only able to change shirt – no singlets or long underpants. Parade from 10 – 11.30. Sent souvenirs etc away (8 francs). No parade in afternoon: swim in canal before tea: watching diver clear lock of rubbish – big find of French money by diver. Writing up diary after tea and started letter to little wife. (Washed dirty underclothing in afternoon).\n","53":" – Parade 10-1130 Damnably hot all day. Spent good part of day in canal. Too languid to write letters. Percy Barratt round to see me but was out.\n\nFriday, 23rd – Bath and change in morning.Letters from Ruby, Dad, Mother, Mrs Gunn and Miss Alston.","54":" mail date. Aquatic sports in afternoon. Ted Barratt round to see me but I was out. After retiring to bed was turned out to see visitors Ted and Percy and Dick Grossman. Had a yarn for long time and then the bos had to go as rain was coming on. Delighted to see them all.\n","55":" – Parade in morning. In afternoon writing letter to Ruby. Nothing of import to-day. Posted letter to Ruby. \n","56":" – Special rifle inspection in morning. Later on Brigade Church Service. Received notification from Commonwealth Bank re draft awaiting me. Replied and posted it just prior to packing up. Received sudden movement orders and handed in packs, overcoats and blankets. Had tea and then marched out of Daours. About 9 p.m. embussed in motors and left for unknown destination. Heavy rain while on the journey; Boys all happy and singing notwithstanding having been informed of big hop over on Tuesday morning. Our bus (holding 28) broke down and after delay was towed to destination where we disembarked after midnight.\n\nMonday, 26th. – After short march (about 1 a.m.) along main road, veered off to left, and after a roundabout route arrived at \n\nseries of old trenches (French) not long since occupied by Fritz. No bivys so had to get busy. Ted Heath and self soon had a shelter – had dinner of hot tea as cookers are following us and about 3 a.m. retired to sleep. Breakfast about 9. Well behind the line (near balloons) so toured round for souvs. No luck except red lapel and sword knot. Loafing round trench all day. Prepared to move in late afternoon and shortly after tea moved up forward to crest of hill where we waiting for darkness to fall. On motor trip we came via Warfusee along main road and position of trench we stopped in was on R. bank of Somme just near Morcourt which was not in sight. On move forward we passed to left of Freyart and eventually landed somewhere to left of Chuignes. On account of darkness impossible to say exact position. After long march we took over old French trenches from 10th Battn. Who told us Fritz was evacuating and we were told officially that on account of evacuation the Hop-over was off. Considerable machine gun fire from Fritz but little artillery. Long cold night. Some movement by different platoons taking woods from the enemy – last 9 stopped in position.\n\nTuesday, 27th – \"Stand to\" all night. Daybreak about 5 a.m. Sunny morning so slept well. About midday 9 moved forward via cold C.T. to new position between two woods captured during night on left by 10, on right by 22nd. Heard Lt. Wall was killed during the move which was done without artillery. Took up new position but rain fell as we evacuated to old deeries. On watch 1 hr. off 3.\n\nWednesday 28th. – Tea up late as cooker got lost. About 4 a.m. all had to pack up and move to C.H.Q. established near wood taken by 10: had hurried breakfast and then moved up over some more territory evacuated during the night to position in old trenches about 2000 yards in front of Herbecourt. Fine deepies abound here so had shelter from the occasional shell fire. F\/Cpl Craig and Tamplar wounded – good blighties – about 2 had to form one of the carrying party to take up bombs and Stokes bombs to position half left from Herbecourt on right bank of Somme overlooking Frise in the valley. \"D\" Company and some of 23rd preparing to take Frise. All returned safely from machine gun fire. Just preparing to sleep about 8 when had to go up with rest of Smerdon’s gun team (Cassells and Tognulla) to form post in front of Herbecourt to handover to 23rd. who are relieving us. About 9.40 were relieved. Put guns etc on limbers and all marched back to vicinity of","57":" position we took over. Had hot tea and stew at cookers and then everyone had to make best of bare trench to spend the night in reserves. Self and Ted Heath however found old possy in different trench and with some of the horses breakfast managed to spend a comfortable night. \n","58":" – Breakfast about 9. Walked to water point. Bulluss found and gave me good map of country (air photo). Had wash and shave, first since last Sunday afternoon’s swim. Parade about noon. All ready to move. After dinner moved up to same trench as we put post in to be relieved from by 23rd but on left of road. Hung around until after tea and then prepared bivys for the night. Terrible shortage of matches and cigarettes, but were glad to get cigarettes from the Padre to-night. Cold night – slept badly as am feeling off colour on account of cold in the head. \n","59":" – On gas guard 3-4 a.m. Breakfast 7. Standing by ready to move at 8: sitting in sun reading and wrote up diary – no entry being made since last","60":" Brigade took over from","61":" yesterday. We hear that they are around Peronne which however has not fallen to us yet.\n\n"}}