{"Document Name":{"0":"Diary_0101","1":"Diary_0101","2":"Diary_0101","3":"Diary_0101","4":"Diary_0101","5":"Diary_0101","6":"Diary_0101","7":"Diary_0101","8":"Diary_0101","9":"Diary_0101","10":"Diary_0101","11":"Diary_0101","12":"Diary_0101","13":"Diary_0101","14":"Diary_0101","15":"Diary_0101","16":"Diary_0101","17":"Diary_0101","18":"Diary_0101","19":"Diary_0101","20":"Diary_0101","21":"Diary_0101","22":"Diary_0101","23":"Diary_0101","24":"Diary_0101","25":"Diary_0101","26":"Diary_0101","27":"Diary_0101","28":"Diary_0101","29":"Diary_0101","30":"Diary_0101","31":"Diary_0101","32":"Diary_0101","33":"Diary_0101","34":"Diary_0101","35":"Diary_0101","36":"Diary_0101","37":"Diary_0101","38":"Diary_0101","39":"Diary_0101","40":"Diary_0101","41":"Diary_0101","42":"Diary_0101","43":"Diary_0101","44":"Diary_0101","45":"Diary_0101","46":"Diary_0101","47":"Diary_0101","48":"Diary_0101","49":"Diary_0101","50":"Diary_0101","51":"Diary_0101","52":"Diary_0101","53":"Diary_0101","54":"Diary_0101","55":"Diary_0101","56":"Diary_0101","57":"Diary_0101","58":"Diary_0101","59":"Diary_0101","60":"Diary_0101","61":"Diary_0101","62":"Diary_0101","63":"Diary_0101","64":"Diary_0101","65":"Diary_0101","66":"Diary_0101","67":"Diary_0101","68":"Diary_0101","69":"Diary_0101","70":"Diary_0101","71":"Diary_0101","72":"Diary_0101","73":"Diary_0101","74":"Diary_0101","75":"Diary_0101","76":"Diary_0101","77":"Diary_0101"},"Date":{"0":"unknown","1":1391.0,"2":1392.0,"3":1393.0,"4":1395.0,"5":1396.0,"6":1397.0,"7":1398.0,"8":1399.0,"9":1400.0,"10":1401.0,"11":1402.0,"12":1403.0,"13":1404.0,"14":1405.0,"15":1406.0,"16":1407.0,"17":1408.0,"18":1409.0,"19":1410.0,"20":1411.0,"21":1412.0,"22":1413.0,"23":1414.0,"24":1415.0,"25":1416.0,"26":1417.0,"27":1418.0,"28":1419.0,"29":1420.0,"30":1421.0,"31":1422.0,"32":1423.0,"33":1424.0,"34":1425.0,"35":1426.0,"36":1427.0,"37":1428.0,"38":1429.0,"39":1430.0,"40":1431.0,"41":1432.0,"42":1433.0,"43":1434.0,"44":1435.0,"45":1436.0,"46":1437.0,"47":1438.0,"48":1439.0,"49":1440.0,"50":1441.0,"51":1442.0,"52":1443.0,"53":1444.0,"54":1445.0,"55":1446.0,"56":1447.0,"57":1448.0,"58":1449.0,"59":1450.0,"60":1455.0,"61":1457.0,"62":1458.0,"63":1459.0,"64":1460.0,"65":1461.0,"66":1462.0,"67":1463.0,"68":1464.0,"69":1465.0,"70":1466.0,"71":1467.0,"72":1469.0,"73":1470.0,"74":1471.0,"75":1472.0,"76":1488.0,"77":1489.0},"Entry":{"0":"\n\n","1":" Found we couldn’t go by Boulogne train at 10.15 so spent rest of day looking round Poperinghe and at 5 saw show by 11th division Wunny Wuns which was very good & heard song Black eyed Susans which I afterwards heard in Cheep. Stayed at Talbot House resting until 9 when we went to station where we had to wait until 1.30 for train in the cold and here I caught a cold which afterwards proved troublesome.\n","2":" Train started about 1.30 & travelled via Hazelbrouck to Les Fontinettes about 4 miles from Calais where we got out and after a wait of about an hour sent out in batches of 100 for boat. Down to Quay where we had another wait of about 3 hours. On board about 2.30 and crossed with a hospital ship escorted by 2 destroyers in lovely weather and fast boat. Boarded leave train which left about an hour afterwards and comfortable two hours trip to London – arriving about 4.30 or 5. Fast trip through Chatcham Rochester & Canterbury and everything very clean & well organised and railway tunnels & cuttings lovely. Escorted to A.I.F. headquarters where we listened to a lot of orders and got fine new clothes. \nPr\n Had some tea there and then by Tube to Russell Square to Imperial Hotel where I got my room. Then had a Turkish Bath steam bath & Plunge Bath \n\nas no attendants were about as air raid was on although guns a good way off and went to bed about 11 feeling pretty tired. Tubes very fascinating and difficult at first.\n","3":" Got up at 9 and had breakfast fair. Scarcity of sugar. Went down to War Chest and then to Crystal Palace & Anerley to Mrs Norties. Very pleasant and hard to get home on Tube again. Spent evening in Lounge and talked and talked to a man who had been out Bed at 11.\n","4":" Up at 8 and started on tour from War Chest at 9.30 for all day and saw Tower in morning and Westminster St Pauls and Buckingham in aftn. Back at 5 and after tea went to Tristan & Isolde at Drury Lane Opera which had to be stopped for 30 min for air raid. Fair. and home to bed at 1 tired. ","5":"\n Saw dentist in aftn & to come at am in morning\n\n2.10.17 Got my teeth fixed properly & saw Better ‘ole in afternoon and A Little Bit of Fluff in evening. Very good. Home late & tired. Air Raid.\n","6":" Went to Bank in morning and air raid on at 11 which didn’t upset me much. Saw Chu Chin Chow in aftn and very fine and gorgeous. In evening was going home but met an actor who got free seats to Palladium Saw 3 turns & then on to Cheep of which we saw nearly all. \n\nBack to his home and to Hotel very late.\n","7":" Up late and went for a walk along Strand and purchased some goods. Raining all day Caught 3.40 train and pleasant trip to Brighton. Miss Foulds met me at station & took me to Cleveland House & after tea went to bed early.\n","8":" Up in good time and after breakfast Miss Herridge took me for walk all along promenade and piers, and in aftn ought to have gone out again but was too shy and went early to bed.\n","9":" Up in good time & listened to 1st Life Guards Band on West Pier till 1 and also visited Palace Pier. In aftn. met Miss Herridge & had tea and set out for Rottingdean about 6 and landed at 7. All very good and gave me everything. Joyce Waterhouse down there Bed about 10.\n","10":" Very wet and windy and went to church & had a rough time. Stayed inside in afternoon and evening talking and exhibiting photos.\n","11":" Went for walk along downs and through village & by the sea and saw Fowler \n\nHad a good lunch and caught 3.40 train after a lot of fuss, and on to London. Raining a bit and met Alice & Fanny but no sign of Bill Lot of trouble through Fanny telephoning and couldn’t find hotel so went to Belgravia Mansion for 8\/6 and had a fire and more fuss.\n","12":" Up at 6 and after packing went down to train and 8 train full. So got off about 9. Pleasant trip and had to wait until 4 for boat. Very cold and a trifle rough and met Hamilton. Landed at 5 and marched to No 2 camp where we put in night. Plenty of chinese here.\n","13":" Up and after breakfast started about 9 for train at Les Fontinettes. Train left at 11 and landed at Poperinghe about 3. Purchased towel and battery and caught lorries out to Ypres and walked back to old camp arrived about 6. Everything same, and bed about 9.\n","14":" Got 18 letters and spent day reading and writing up diary and letters. Cold wind blowing. Rest went out at 4 and had fairly quiet day. Two horses killed in pontoon. Price & Graham wounded. Very cold during night although we had a fire box. \n","15":" Windy & wet all day but not so cold and I wrote letters after putting house in order. Bed early. Rest went for a bath at 2.30 but I dodged it and we also have to-morrow off before starting on Dump to load.\n","16":" Fine & not cold but thunderstorm in morning. Carried some wood & spent rest of day writing in dugout.\n","17":" 7 men out for loading & 4 carpenters. I stayed in and during day wrote & cleaned up fine day \n","18":" Fine. Some loading I off and wrote & read\n","19":" Out with No 3 at 11 and motor’d to Birr X Road from Kruisstraat Walked to job on line between Westhoek & Zonnebeke laying mule tracks. Shelled out. Penny wounded by H.E.shrap’n Left at 4. Day fine. \n","20":" Out at 4 and onto job. Finished to Switch. Walked to Zonnebeke to look for breaks. Shelled out and home at 10.30 after sheltering in Pill boxes.\n","21":" Worked hard from 8 to 5 building our new dugout. Fine day.\n","22":" Fine. Out at 4 with 6 men & dugout pontoon at\n\nroad beyond Chateau Wood. Home at 8.30 and worked hard on dugout till 4. Just finished & heavy thunderstorm bed early. \n","23":" Out on job at 4 and repaired lane broken in many places. Shelling heavy & had to retire at 10.30. Guard at 4.30\n","24":" Guard. Improvements to home. Fine day. Shelling round here last night & bombs dropped nearly every night. Piece through dugout.\n","25":" Rain & wind. No work and read and wrote.\n","26":" Out repairing line at 4 and Kernot wouldnt take us on job until late & got reprimanded by Pioneer Colonel. Alver wounded. \n","27":" Made bunks & improvements and read. Fine \n","28":" Strong N.E. wind and did some loading in aftn and read.\n","29":" Home all day. Two little jobs making sign boards and a sieve. Rest of time improved door of dugout and wrote a little. Fine day. \n\n27.\n\n26.10.17. Wet all day. Home Taylor in Ypres. Carried & chopped wood. Water and generally cleaned up & Read\n","30":" Fine day. Rebuilt door of dugout and did little jobs of making signboards & a sieve. Wrote some. Both home\n\n28.10.17. Taylor out. Good day Took two loads 100 duckboards to 9th & ","31":" Batt in morning and aftn cleaned up procured coal and wrote in evening Poole gone out. Sunday\n","32":" Taylor out. Fine day Continued guard usual. Wrote in morning cleaned up in afternoon.\n","33":" Wet & strong wind. No work. Read & cleaned up.\n","34":" Lovely day. Horselines in morning. Read & cleaned up. Letters.\n","35":" Fine Cloudy. Nothing till guard at 4.30. 3 infantry prisoners. Usual guard.\n","36":" Guard Wrote 5 letters and cleaned up for leaving for line to-morrow. Pay in evening. Cloudy but warm.\n","37":" Up at 3 and moved off to dump at 4.30 with blankets etc in pack and caught lorries about 5.30 to Hell Fire. Thence marched to Railway line to pill boxes at Westhoek where No 3 stayed & \n\nwhere we got cocoa. Then on to near Ypres-Roulers railway in a pillbox beyond Broodseinde about 5 miles direct from Ypres. Built up a dugout on far side of pillbox very weak only protected by two sides of concrete about 2 ft high Shelling very lively & big stuff coming over very close to us. Spent a wretched night. Shelling intense especially against our pillbox and shells all round one exploded against far side and heavy concussion. Wind blew the gases right in our door and we were nearly gassed. Up at 8 and helped clean pill box by draining and stink of dead meat strong. Shelling heavy all day. and enemy aeroplanes active and we couldn’t light a fire. Night was calmer but counter attack at 6. One shell during night burst diagonally opposite our corner. Heavy barrage next morning. \n","38":" Up at 7.30 and made tea with Tommy cooker and had 4 inf with one making a dugout. Shelling easier but planes active 3rd Batt relieved 11th and","39":" Comp arrived about 12 to relieve us I was first off with my party of 6 and got through safely Caught a lorry at Hell Fire to Ypres & \n\nwalked rest. Had some soup and bought stores and after organising my gear went to bed at 9. and slept well.\n","40":" Stayed in bed till 10 and found my Paris leave through so got a clean change and spent a day getting ready. Left at 5 and caught a lorry right into Poperinghe. Long wait but wasn’t fatigued.\n\n7.11.17 Train left at 1.50 amd Fritz flying abroad. Arrived at Calais and walked with a 1st Batt chap to station. Then breakfast and a visit round the town and caught train at 12.10. 2nd classe & very comfortable journey only 5 in carriage & had a corner seat. Train rather slow for an express and especially so after getting near \nindecipherable\n Paris. Arrived at 10.30 very tired & hungry as no meal on way as didn’t know the ropes of the restaurant car. Had instructions from M.P.s and A & N Leave Club man took us to Place de la Republique where we had a wash and a fine supper and booked our rooms for the night and off to bed about 12. \nUp at 8.30 & had a p \n \n","41":" Up at 8.30 & had a poor breakfast in Hotel Moderne and then went out & had a hair \n\ncut and general clean up and then found an old guide who took us round Paris for the day for 5F we paying all expenses. First to A.P.M. then on to Tuilerie Eiffel and Hotel Invalid where we saw the tomb of Napoleon. Dinner in an arcade. Tea at Club and went with","42":" Batt chap to Folies. Episode of the \"femme.\" Folies very good but too much French Bed late.\n","43":" Walk before dinner and breakfast & dinner close to Club. Versailles in aftn with New Zealanders. Paris by night in evng. \n","44":" Promenade \nto Sacre Coeur\n & in aftn to Malmaison guide from Blighty Corner. Alhambra in evening.\n","45":" Sacre Coeur morning. Aftn Wheel Musee Grevin. Olympia at night.\n","46":" Guide all day to Notre Dame & churches & Madeleine did nothing in even and caught train leaving about 12 \n","47":" Slow journey & slept a little. Plenty of food. Arrived Calais at 2.30. Shaved, dinner and looked round. Train uncomfortable to Hazelbrouck at 6. arrived at 9. and slept night 2nd class carriage\n","48":" Renescure by train Saw Sgt Cre and on to St Omer. On by lorry to Lumbres. Walked to Ouve Wirlsiquin & found 2nd Coy. Slept night with them\n","49":" Moved off at 7 & marched to Happe. Found 3rd Coy & brought Malltuck over with me slept well. Gear right\n","50":" Went on aftn parade and dismissed\n","51":" 1st parade nothing doing. Were to move to-day but cancelled 24 hours.\n","52":" Moved about 8 and marched to Desvres to Samer arrived at 12.30. Good billet in old chateau farmhouses Went down town in even.\n","53":" 6 Reveille to check parade 6.30 & Parade 8 Broke off at 9.30 and \n\ncleaned up. Parade at 2. Spent evening reading.\n","54":" Reveille & check 7.30 Parade 9 Usual routine chopped wood in evenings. N.C.O.s drill. Paid. & played games under Bremner.\n","55":" Usual parades and N.C.O.s drill in front of Coy wrote in evening.\n","56":" Usual parades. Wrote with Chapman in Orderly room all day. From 17-22 cloudy & rain threatning. Read in evening\n","57":" Finer day & sunny chaff cutting all day Samer in evening. Anzac book \n","58":" Usual parades. Fine.\n","59":" Usual parades – Fixed cookhouse in aftn\n","60":" Usual nothing of importance. Guard & Loading trip to Samer. Paid 30. 29 Visit to Desvres good time. 28 Fine bath.\n","61":" Windy and cold usual parades squad drill in morning Railway guard at 2. Raining. Easy time in a truck mail in Elliott back.\n","62":" Timber taken away at 9 & arrived back at 11 No parades. Read & cleaned up. Windy & cold. \n","63":" Usual parades. Cold.\n","64":" March & gas lecture in morning. March under Fischer un afternoon. Usual parades. Football. Sunny but cold.\n","65":" Chaff cutting Sunny but cold. Voted in aftn & wrote letters.\n","66":" Fine & Cloudy & not so cold Usual parades. Dismissed in morning & read & wrote. Promenade in aftn parade\n","67":" Raining slightly & warm rumours of moving shortly Usual parades. Boots in morning and dismissed in aftn. Played bridge & read.\n","68":" Cloudy usual parades Dismissed in aftn.\n","69":" Raining a bit. Guard at 9. Usual one prisoner. Clark\n","70":" Boulogne at 10 and caught lorry right into town. Had a good look round and feeling tired came back at 6. Interesting trip\n\n11.12. Footballers went to Boulogne Bath in aftn Fine.\n\n12.12. Fine usual parades. Concert of","71":" Div Engrs in evening. Rotten. \n","72":" Moved off at 9. and marched without packs to Blequin most of way Billets very crowded. Arrived about 3.30 Transport marching separately\n","73":" Marched with full packs to Ouve Wirquin. Good billets & went for walk in evening. Dola & Marchant ","74":" Marched to\n 9 - 2. Fine \n\n15.12. 3 Reveille & moved off at 4.15 to Wizernes. Walked from 6 to 11.15 when we got on board & moved off past Bailleul to a siding and marched to near Kemmel past Lindenhoek. Good billets dug in. Fine\n","75":" Nos 1 & 3 squads went out at 8 o’clock. 9 parade and dismissed to clean up. Spent day in cleaning up moving to-morrow to","76":" Coy billets said to be excellent.\n\n16.12. Only parade at 9 and cleaned up rest of day. Heavy frost & slight rain in aftn.\n\n17.12. Slushy but no rain. Moved out at 9 and passed company billets going on to Wulverghem full marching order. Tools packs and blankets off wagon and pushed up on rollway to Bell Farm ","77":" Brigade Dump behind Messines Ridge. Billet good behind pillbox with Phillips. Out at 4 with Phillips and on wiring job. However no material and no party so only walked about outposts & inspected \n\nwire. Fairly quiet and hard frost. Back at 12.30\n\n18.12. Stayed in bed most of day and out at and got practically no wiring done. Quiet another look round everywhere and was put on bombing post improvement. While Phillips wired argument Mr Pumfrey. Back at 2 M.G and shells at times Hard frost.\n\n19.12. Out at 8 and went up with Perkins & Moffitt after lying in all day. Took wrong turning. Worked a little on wiring and Home at 1.30. Hard frost \nfrost\n. French mortars active and scattered us 3 times otherwise quiet\n\n20.12 Hard frost and fog Stayed in all day not going out to-night so wrote letters. Quiet.\n\n21.12. Usual 5 Nothing doing so Evans took us round new posts. Quiet Hard frosts. Bed all day.\n\n22.12. Fell foul of colonel who escorted us to left outpost & left me on right with 15 men. Digging very hard and stopped at 11 \n\n23.12. Usual 5. M.G & shells active. 1 bay of revetting. \n24.12\n Hard hoar frost.\n\n24.12. Usual. Thawed slightly. Fell foul of colonel & 4 other officers & put to work clearing wire. Home 11.\n\n25.12. My day in Thawed & snowed again in evening. Wrote letters all evening\n\n26.12. Usual. Heavy frost. Parapets and some trench Rumours of enemy raid. Home at 10 30\n\n27.12. Dug and completed 3 positions Usual.\n\n28.12. Dug 2 dugouts usual.\n\n29.12. No party & 10 men in post Home 10.\n\n30.12. New job vague instructions very dark and couldn’t trace\n\n31.12. Found job alright and didn’t do much work with 20 Inf. Home at 9.30 as raid expected.\n\n1.12. No party. Change over.\n\n2.12. Slight thaw and stayed home Mail in.\n\n"}}