{"Document Name":{"0":"Diary_0272","1":"Diary_0272","2":"Diary_0272","3":"Diary_0272","4":"Diary_0272","5":"Diary_0272","6":"Diary_0272","7":"Diary_0272","8":"Diary_0272","9":"Diary_0272","10":"Diary_0272","11":"Diary_0272","12":"Diary_0272","13":"Diary_0272","14":"Diary_0272","15":"Diary_0272","16":"Diary_0272","17":"Diary_0272","18":"Diary_0272","19":"Diary_0272","20":"Diary_0272","21":"Diary_0272","22":"Diary_0272","23":"Diary_0272","24":"Diary_0272","25":"Diary_0272","26":"Diary_0272","27":"Diary_0272","28":"Diary_0272","29":"Diary_0272","30":"Diary_0272","31":"Diary_0272","32":"Diary_0272","33":"Diary_0272","34":"Diary_0272","35":"Diary_0272","36":"Diary_0272","37":"Diary_0272","38":"Diary_0272","39":"Diary_0272","40":"Diary_0272","41":"Diary_0272","42":"Diary_0272","43":"Diary_0272","44":"Diary_0272","45":"Diary_0272","46":"Diary_0272","47":"Diary_0272","48":"Diary_0272","49":"Diary_0272","50":"Diary_0272"},"Date":{"0":"unknown","1":680.0,"2":681.0,"3":682.0,"4":683.0,"5":684.0,"6":685.0,"7":686.0,"8":687.0,"9":688.0,"10":689.0,"11":690.0,"12":691.0,"13":692.0,"14":693.0,"15":694.0,"16":695.0,"17":696.0,"18":699.0,"19":702.0,"20":707.0,"21":708.0,"22":709.0,"23":710.0,"24":711.0,"25":713.0,"26":714.0,"27":715.0,"28":716.0,"29":720.0,"30":721.0,"31":722.0,"32":723.0,"33":724.0,"34":725.0,"35":726.0,"36":727.0,"37":728.0,"38":731.0,"39":732.0,"40":733.0,"41":734.0,"42":735.0,"43":736.0,"44":737.0,"45":738.0,"46":739.0,"47":740.0,"48":741.0,"49":745.0,"50":746.0},"Entry":{"0":"\n\n","1":" (Lemnos Island)\n\nReceived Orders to march off at 2 a.m. to-morrow morning for Anzac – \"A\" Coy going in advance – had little sleep all night; reveille at 4 p.m. \n\n31\/10\/15\n\nLeft camp at 5 a.m. (13th 14th and 15th Bns. And embarked on S.S. \"Osmanich\" and left Mudros Bay (Lemnos Island) about 3 p.m. and arrived off Anzac about 7.30 p.m. when a lighter came alongside but it was too rough to land the troops so after waiting till about 3 a.m. off Anzac we went to Embros Island where we lay in a nice little Bay protected by nets (against submarines and torpedoes). During the night one man of the","2":" (while we lay off Anzac) was shot dead by a bullet through the head and two were wounded. \n","3":" \n\nLying this morning in little bay in Embros Island – beautiful fine morning – lay there all day and moved off to Anzac as soon as it was dark where we disembarked on lighters getting off at a good little pier (very different from our first landing!) and went round the beach to the left by a good track (sap) and camped for the night in Taylor’s Gully – plenty of ready made dug outs and very comfortable – pretty cold during the night – settled down to sleep about 1 a.m. \n","4":"\n\nFine sunny fresh morning – did nothing all day – a little mild excitement at mid-day when half a dozen big shells bobbed in amongst the crowd but by great good luck no one was injured – one chap was wounded in the arm by a stray bullet last night. \n\nOne of our aeroplanes went over us to-day and the Turks were potting at it with shells but went no-where near it. One of their empty shells dropped where we are camped. \n","5":"\n\nThe Brigade went up to Durrant’s Post – we are getting the position formerly held by the 13th. Position seems to be safe and ready made dug outs and good trenches – very different tour first couple of months here. \n\nGot in dug-out with J.T. \n","6":"\n\nGot shifted from dug out and had all the trouble of making another one – language suitable to the occasion. \n\nSome of our boys (Reinforcements) got wounded by the explosion of a box of bombs in our own trench through one of the new hands letting off his rifle accidentally. Went out with a couple more in front of the trenches at night cutting down and removing scrub from the front of our firing line and carried it back behind our firing line. Trenches seem pretty good. Could hear a brisk rally going on at night on our left. \n","7":" \n\nHeard this morning that Turks blew up part of Quinns Post last night and our L. Horse took a trench there and still hold it but don’t know if it’s true. One of our chaps (D Coy.) got shot and died shortly after and 3 more were wounded near D. Coy’s Cook House. \n","8":"\n\nA few shrapnel shells fell on the hillside opposite – quiet. \n","9":"\n\nNo. 3 and 4 Platoons in trenches. One of our aeroplanes flew over our trenches towards the Turk’s lines and returned and descended in the water towards Sulva Bay apparently disabled, near the Hospital tents on our left on the beach, where the Turks shelled it. A Turkish Aeroplane flew over our position shortly after and though fired at a lot returned apparently undamaged. \n\nSome mail arrived. Trenches very good to what we were used to at first. Turks about 700 yards away. Got a letter from M. and one from Red Cross Society that M.C. died of wounds on 3\/5\/16 and that they would try and get details. Quiet night in trenches \n","10":"\n\nCame out of trenches into supports. Enemy Aeroplane went overhead. Very quiet on this position. \n","11":"\n\nGot a big mail of mostly old letters – 21 letters in all. In support trenches to-day and go into trenches to-night. Was sitting just outside our dug out with J.T. when a bullet (apparently a stray one) went just past my ear and between us and into the sand bags of the next humpy.\n","12":"\n\nOut of the trenches resting in our dug outs \n","13":" \n\nQuiet; nothing doing\n","14":"\n\nNo.3 & 4 Platoons went into the trenches – some of the old chaps and some reinforcements who had been in Egypt had returned (about 68 for the","15":"\n","16":"\n\nFine morning; cold last night which was quiet. \n","17":"\n\nIn trenches last night and to-day – cold and windy last night – quiet. K. of K is reported to be here. Received \n\nSome letters.\n","18":"\n\nFor some days have been on a regular job sapping a tunnel through a hill under the trenches. 8 hours a day in 4 shifts. Pretty hard work on this tucker. Very strong wind and rough sea yesterday and heavy rain last night which washed a lot of the dug outs out, but ours held dry. Working 8 a.m. to12 p.m. and 8 p.m. to 12 p.m. This morning some of our Coy. Made a fire in front of our dug out and were making tea about 5 a.m. when Jefs was shot dead through the ear; he never moved or spoke. Just in front of our front door seems pretty dangerous as several bullets have hit the sand bags there and one narrowly missed J.T. and myself some days ago – was very cold this morning but beautiful fine days. \n","19":"\n\nHeard a lot of our inward and outward mail (361 bags) has been lost at sea – this would probably include over a dozen letters. I have written from here – so wrote some more. I am still digging tunnel. \n","20":"\n\nWrote some more letters as heard a lot of our mail has been torpedoed on Steam Ship \"Orange Prince\"\n","21":"\n\nThe last few days have been very cold – things quiet – a good few stray bullets or snipers in front of the humpy – threatening but not much rain. Lieut. Barton returned the other day. Hardly any firing here yesterday. It is said The Turks think we are evacuating this position, and the cessation of fire was to encourage this belief, and get them to attack. The Indians are doing most admirable work with the mules here, bring all our stores, ammunition and water up from the beach and they do it all most cooly, and without \n\nany confusion or noise.\n","22":"\n\nWoke up this morning to find a couple of inches of snow on the ground and still snowing. Very cold and freezing wind. My Mate and myself had put off digging under, and are now sorry for it. Must get underground at once. Pretty sight. Rations have been very light. We have never had our full rations since we have been here this time – not privates anyway, and we want more – such as Oatmeal and other heating food. It rained a good deal yesterday. The roof of our dug out being an old blanket covered with old oil sheets wont stand much snow. \n\nA little snow and continuous sleet all day. Bitterly cold wind. \n","23":"\n\nRain and snow stopped but everything is frozen hard this morning, and strong ice cold wind blowing. \n","24":"\n\nStill freezing cold and snow not all thawed yet but sun out a bit. Several men of the Company have been sent away with frozen feet. The food is insufficient for the cold weather and we do not get full rations of bacon and some other things. \n","25":" \n\nStill cold but not quite so bad but wind very cold. It has been freezing so hard that a lot of the snow still lies on the hillsides. Our water ration has been cut down 1\/3rd and the last few days owing to the difficulty of getting it here per mules in this weather, up the narrow steep, and slippery paths through the saps. We finished digging a big oblong pit yesterday which is being roofed in for a cook house. I and my mate are digging into the hill at the back of our humpy as it is much warmer underground, and our roof (waterproof sheets) would never stand the weight of a heavy fall of snow \n\nI hear that one man of","26":" Battalion had to have both feet off owing to getting them frozen. Also a rumour that the Turks have blown up Lone Pine trenches and 30 or so of our men (not this battalion) Killed or wounded. A good many men (mostly reinforcements) are going away sick etc. A couple of days ago I and my mate had a tin of bully beef for breakfast as we were very hungry, and there was little else (the day it snowed) and got such a thirst that we had to drink something, and nearly swallowed several small icicles in our water bottles. The Cork of T’s bottle got frozen and he had great trouble to shift it. Four or five hospital ships are lying off the beach, and they say a lot of the English and some of our troops are going away sick and with frozen feet etc. result of the cold snap. Also some of the Indians who have been doing such a splendid transport work with the mules. Tucker very short. \n","27":"\n\nFrosty morning but fine day and nice sun. Snow now nearly all thawed. A couple of shells burst over the hill and one man (machine gun) on top was wounded by shrapnel in leg and arm. Still at work in our dug out. Shifts change and I go on 6 p.m. to12 p.m. and 6 a.m. to 12 noon digging a tunnel for cook’s quarters. Sun beautiful after all the cold. \n","28":"\n\nDull and cold (but not so cold as lately) with a little misty rain. There is a rumour of Allied victory against the Bulgarians and it is said the Prussians are coming through Roumania to attack Bulgaria. One man got hit here to-day by a stray bullet. Still a good many going away, sick etc. A good deal of bomb throwing was going on late night. I am working on another tunnel for winter quarters (a bit late!) for the men. \n","29":"\n\nStill quiet on our position but can hear bombs on the \"Apex\" and on our right every night. A few days ago the Turks bobbed a few high explosive shells on the field hospital below us, and killed a couple of wounded men (can’t blame them much as the hospital is alongside the track our supplies come by). The Warships shelled the Turks position behind Chocolate Hills heavily the day before yesterday. Food has been bad and short rations for over a fortnight now. Am getting weaker myself and have a boil on the jaw from it. A man can’t do the pick and shovel work we are on in the tunnels properly on the tucker. Got a letter from M. and Post card from little J. We heard a rumour that there are internal disturbances in Germany. Also that 300,000 Russians had entered Bulgaria. Also that some Turk Prisoners we have taken say the Turks have plenty of food and ammunition, but are short of clothes and Doctors. Weather has been nice and mild the last few days. A few chaps returned to the Battalion from Lemnos last night. No fresh meat for a long time now and only a quarter of a loaf of bread (and most none – Biscuits) and one fifth of a tin of jam per man, per day, with bully beef and a little cheese. \n","30":"\n\nOne of our signallers shot about 20 yards in front of our dug out yesterday a sniper or a stray – through the chest. He has a chance of pulling through.\n\nHear this morning that while some of the 16th were out last night making a new firing line, in front of their present one, the Turks turned a machine gun on them, and one man was shot dead and another through the stomach. Nice fine day. Finished our dug out and humpy except internal conveniences. Working day shift in the tunnel 12 noon to\n\nto 6 p.m. One of our ’planes overhead this morning – usual shelling \n","31":"\n\nWent to Dr. Story (13th Dr) got boil lanced and had day off duty. A good deal of shelling going on but our position not affected. \n\nA Machine gun (apparently one of our own firing from over Walker’s Ridge way) was playing on our position after dark, and J.L. got shot through the neck and another chap in the elbow, and several had narrow shaves. Can’t make out how Turks can bring a gun to bear on these chaps, as they were in our own trenches, and think it must have been one of our own guns, the shots coming over the hills. Also a good few shots coming from Turk’s machine gun on ground around and below our dug outs. Tucker better to-day. \n","32":"\n\nFine day. Off duty with boil on neck. One of the D Coy got shot in the leg – broken – probably a sniper. One of the 14th Machine gunners also got shot through the chest while on the gun. We hear rumours that the hospitals are to be cleared and that there is to be something doing shortly. The warships bombarded a good deal this afternoon. There are also rumours that the Russians are advancing on Constantinople and have given Turks notice for non-combatants to leave within 24 hours, but we hear so many rumours that we can believe nothing. Our dug out we have made very comfortable now, it is quite elaborate, and we shall be sorry to leave it. There is a good deal of machine gun at night. \n","33":"\n\nNice weather, things quiet, various rumours as to our advance and as to our Brigade moving elsewhere for the winter, but nothing one can place, Usual shelling by both sides but nothing out of the way. \n\nSaw three ’planes up at once this evening. Two were ours and one went pretty low and the Turks went pretty close with shrapnel but did not hit it. Quiet night but can of course always hear a few bombs going round Quinn’s Post Way, and Walker’s Ridge and the \"Apex\" near us. \n","34":"\n\nFine sunny day. Ships sending the Turks a few shells. Looks like rain it is so warm. Still a few going away sick, Tonsilitis, Jaundice etc. It is said (evening) that the 15th Battalion H quarters go this evening and iron rations are being served out so there is evidently something doing. Evacuation rumoured but we don’t know.\n","35":"\n\nAll sorts of rumours floating round about our leaving here but nothing authentic. N.Z. Engineers are fixing barbed wire across gully below us, and a good many Australian troops, and the sick have gone. Very quiet to-day. \n","36":"\n\nColder and windy. Quiet last night except for a bit of a rally and some bombs somewhere on the right, Warships giving the Turks a few shells this morning and a Turk’s Machine gun is rattling away at some of our chaps down the valley as I write. Rumours that the Germans have forced their way through Servia.\n\n16\/12\/15\n\nFine day. Evacuation operations still going on smoothly. 15th Battalion have gone. Went into Trenches at 4 p.m., in all night. Quiet on our position but a fair bit of rifle fire, and bomb throwing on the right. Moonlight night, cloudy and a little rain towards morning. Not so cold as we might expect. \n\n17\/12\/15\n\nFine days. In trenches, quiet. Five Hospital ships lying on beach – operations for evacuation going on smoothly. \n\nQuiet at night but hear that Beachy Bill bobbed a couple of shells on the beach and killed 13. There was a big bonfire on beach and no doubt that attracted them. In supports myself.\n\n18\/12\/15\n\nVery quiet and apparently everything going on smoothly so far. In supports till 4 p.m. Got orders to report to Lieut Barton at 7.30 p.m. when he sent myself, and two other men to report to Colonel Dane of the 14th, and found we had to fall in, in rear of the 14th, after their Machine gunners. Left with them for beach about 8.30 p.m. and went to Beach (having only a few halts in the Saps and everything going very smoothly.\n\nWhen we were on Beach a couple of shells apparently from Beachy Hill, burst on our left a bit up the hill, and in line with the bonfire which was burning on the Beach (stores etc being destroyed) but did no harm apparently. We got on board a lighter and on Board S.S. \"Hazel\" everything going like clockwork. A few bullets from Machine guns came close overhead in some of the Saps going down but otherwise we were not troubled at all, and there were no casualties. Every thing was managed splendidly. It was of course crowded, on the \"Hazel\" and we got little or no sleep, lying down anywhere. The crew of the Hazel were very obliging, and a fireman gave myself and a few others some bread and cheese and tea for supper. We left the beach about 11 p.m., the time we were scheduled for. \n\n19\/12\/15\n\nArrived in Nindros Harbour (Lemnos Island) early in the morning and were transferred to H.M.S. \"Zealandia\" when we given a real good breakfast, and as much as we could eat, in the mess rooms of the Jack Tars, who waited on us. They were real good chaps, and wonderfully different from the English \"Ai’ Chum\" soldiers we have met. \n\nIt appears the spread given us was from the ship’s canteen and the expense was borne by the Ship’s Company. They could not have treated us better. Afterwards we went ashore and marched to a camp which had been prepared for us. We three of the 13th paid a visit to the town of Nindros and later in the afternoon some more (about 100) of the 13th arrived. To-night as I write the Brigade Band is playing the Old","37":" tune. Pretty tired and glad to turn in. \n","38":"\n\nThe rest of the","39":" (and the other troops from Anzac) arrived in two batches, the last about 4.30; the band played them into camp and the boys line up and cheered them. Brig. Monash made a speech in which he said all our men from Anzac (45,000) have been got off the Peninsula with only three casualties (these from stray bullets I think). A marvellous military achievement for which I think a lot, if not most, of the credit is due to the navy. We were all very glad to see that the chaps who had remained to the last, had got away safely and that the whole operation had been a complete success. \n\nWe hear there is trouble on the Canal and we may go there. We are short of tents, and have about 17 men in each, which is very uncomfortable. \n","40":"\n\nWindy and raining last night and windy and muddy to-day. On piquet on village of Nindros . Crowded with our own, and English and French troops and hard to get any food. Some of the French Singalese Troops were moving off somewhere to-night. The names of those of us who were at the first landing at Anzac, and also at the evacuation, were taken for some reason (it is said possibly for furlough).\n\nThere are more rumours to-night of trouble in Egypt and that we are going there. Got letters from Mother, M, and J.\n","41":"\n\nOn piquet in the village. 4th Brigade now al in camp. \n","42":"\n\nHad a little drill. Heard that Greece had declared War on Bulgaria and that Roumania had joined Allies. Cold.\n","43":"\n\nChristmas Eve – cold and raining. No Parade. Told we are on piquet to-morrow in village. Feel pretty crook and have boils on neck.\n","44":"\n\nChristmas Day. Sick and off duty. A German \"taube\" dropped some bombs they say on foreshores near shipping. Fine but a bit chilly.\n","45":"\n\nBoxing Day. Church Parade but nothing else doing. The 15th went away presumably to Egypt. Got 3 parcels from home through the 13th Batt. Depot. Got our Christmas billy cans with plum puddings etc in them.\n","46":"\n\nIt rained a little this morning fine in afternoon I and some mates had a tuck in, some tucker sent me. \n\nA German ’plane came over the Island this afternoon and dropped a couple of bombs half a mile or so from our camp. The","47":" Batt. went away this morning and we expect to go anytime – we think to Egypt. Got a lot of clothes, cigarettes etc. in the parcels from home. There are a lot of French troops camped here at East Mindros . \n\n28\/15\/15\n\nBrigade H. Quarters, and the other 3 Battalions have gone and also one Coy. of this Batt. \n","48":"\n\nLeft camp at Lemnos about4 p.m. and went aboard S.S. \"Tunisian\".\n","49":"\n\nArrived off Alexandria and anchored about 6 a.m. and got along side Wharf at 10.30 a.m. \n\nThere is a report that we were chased by a submarine for some hours yesterday but don’t know if it’s true – we knew nothing about it at the time, though the torpedo destroyer which escorted us was chasing about a lot. \n\nSick and off duty with boil on neck and poisoned fore finger. \n","50":"\n\nArrived at Ismailia on Suez Canal went into on Sandy Desert just out of Town. \n\n"}}