{"Document Name":{"0":"Diary_0106","1":"Diary_0106","2":"Diary_0106","3":"Diary_0106","4":"Diary_0106","5":"Diary_0106","6":"Diary_0106","7":"Diary_0106","8":"Diary_0106","9":"Diary_0106","10":"Diary_0106","11":"Diary_0106","12":"Diary_0106","13":"Diary_0106","14":"Diary_0106","15":"Diary_0106","16":"Diary_0106","17":"Diary_0106","18":"Diary_0106","19":"Diary_0106","20":"Diary_0106","21":"Diary_0106","22":"Diary_0106","23":"Diary_0106","24":"Diary_0106","25":"Diary_0106","26":"Diary_0106","27":"Diary_0106","28":"Diary_0106","29":"Diary_0106","30":"Diary_0106","31":"Diary_0106","32":"Diary_0106","33":"Diary_0106","34":"Diary_0106","35":"Diary_0106","36":"Diary_0106","37":"Diary_0106","38":"Diary_0106","39":"Diary_0106","40":"Diary_0106","41":"Diary_0106","42":"Diary_0106","43":"Diary_0106","44":"Diary_0106","45":"Diary_0106","46":"Diary_0106","47":"Diary_0106","48":"Diary_0106","49":"Diary_0106","50":"Diary_0106","51":"Diary_0106","52":"Diary_0106","53":"Diary_0106","54":"Diary_0106","55":"Diary_0106","56":"Diary_0106","57":"Diary_0106","58":"Diary_0106","59":"Diary_0106","60":"Diary_0106","61":"Diary_0106","62":"Diary_0106","63":"Diary_0106","64":"Diary_0106","65":"Diary_0106","66":"Diary_0106","67":"Diary_0106","68":"Diary_0106","69":"Diary_0106","70":"Diary_0106","71":"Diary_0106","72":"Diary_0106","73":"Diary_0106","74":"Diary_0106","75":"Diary_0106","76":"Diary_0106","77":"Diary_0106","78":"Diary_0106","79":"Diary_0106","80":"Diary_0106","81":"Diary_0106","82":"Diary_0106","83":"Diary_0106","84":"Diary_0106","85":"Diary_0106","86":"Diary_0106","87":"Diary_0106","88":"Diary_0106","89":"Diary_0106","90":"Diary_0106","91":"Diary_0106","92":"Diary_0106","93":"Diary_0106","94":"Diary_0106","95":"Diary_0106","96":"Diary_0106","97":"Diary_0106","98":"Diary_0106","99":"Diary_0106","100":"Diary_0106","101":"Diary_0106","102":"Diary_0106","103":"Diary_0106","104":"Diary_0106","105":"Diary_0106","106":"Diary_0106","107":"Diary_0106","108":"Diary_0106","109":"Diary_0106","110":"Diary_0106","111":"Diary_0106","112":"Diary_0106","113":"Diary_0106","114":"Diary_0106","115":"Diary_0106","116":"Diary_0106","117":"Diary_0106","118":"Diary_0106","119":"Diary_0106","120":"Diary_0106","121":"Diary_0106","122":"Diary_0106","123":"Diary_0106","124":"Diary_0106","125":"Diary_0106","126":"Diary_0106","127":"Diary_0106","128":"Diary_0106"},"Date":{"0":"unknown","1":1295.0,"2":1302.0,"3":1303.0,"4":1304.0,"5":1305.0,"6":1309.0,"7":1310.0,"8":1311.0,"9":1316.0,"10":1324.0,"11":1331.0,"12":1332.0,"13":1333.0,"14":1334.0,"15":1335.0,"16":1339.0,"17":1340.0,"18":1341.0,"19":1342.0,"20":1351.0,"21":1352.0,"22":1354.0,"23":1355.0,"24":1360.0,"25":1363.0,"26":1364.0,"27":1365.0,"28":1366.0,"29":1367.0,"30":1368.0,"31":1369.0,"32":1370.0,"33":1371.0,"34":1372.0,"35":1385.0,"36":1386.0,"37":1387.0,"38":1388.0,"39":1389.0,"40":1390.0,"41":1391.0,"42":1392.0,"43":1393.0,"44":1395.0,"45":1396.0,"46":1397.0,"47":1398.0,"48":1399.0,"49":1400.0,"50":1401.0,"51":1402.0,"52":1403.0,"53":1404.0,"54":1405.0,"55":1406.0,"56":1407.0,"57":1408.0,"58":1409.0,"59":1410.0,"60":1411.0,"61":1412.0,"62":1413.0,"63":1414.0,"64":1415.0,"65":1416.0,"66":1417.0,"67":1418.0,"68":1419.0,"69":1420.0,"70":1421.0,"71":1423.0,"72":1424.0,"73":1425.0,"74":1428.0,"75":1429.0,"76":1430.0,"77":1431.0,"78":1433.0,"79":1434.0,"80":1435.0,"81":1436.0,"82":1437.0,"83":1438.0,"84":1439.0,"85":1440.0,"86":1441.0,"87":1442.0,"88":1443.0,"89":1444.0,"90":1445.0,"91":1446.0,"92":1450.0,"93":1451.0,"94":1452.0,"95":1453.0,"96":1462.0,"97":1463.0,"98":1464.0,"99":1465.0,"100":1466.0,"101":1480.0,"102":1481.0,"103":1482.0,"104":1486.0,"105":1488.0,"106":1489.0,"107":1490.0,"108":1491.0,"109":1492.0,"110":1493.0,"111":1494.0,"112":1497.0,"113":1498.0,"114":1499.0,"115":1500.0,"116":1501.0,"117":1509.0,"118":1510.0,"119":1511.0,"120":1512.0,"121":1513.0,"122":1514.0,"123":1516.0,"124":1518.0,"125":1530.0,"126":1531.0,"127":1532.0,"128":1551.0},"Entry":{"0":"\n\n","1":"\n\nThis record begins with my appointment to the","2":" Bde.\n\nAfter 10 days leave in England I joined up with the 3rd Batt of the 1st Bde. which was resting in reserve at a small village named Buise near Albert.\n\nFor some weeks the Division has been enjoying a well earned rest after the fierce fighting at Bullecourt but the end of that rest is now approaching. We go on Thursday for a 3 days training for special work. I am very happy in my new surroundings & have met with every consideration & help.\n\nI have been here one week Last week was a busy one arranging for a concert which eventuated on Saturday evening and was a great success so they all tell me\n\nOn Sunday morning at 9.30 we held our Church parade It was a Brigade service and at the close General Birdwood presented the decorations won by the men & officers about 100 received their medals\n\nThe General & his staff were present at the service. Mr Jessep C of E. took the service MacKenzie the Lesson & I gave the address. It was a nice fine day & the parade was very fine.\n\nAt night we held an evangelistic meeting in the old Hall here for which we had to pay 10 francs such is the spirit of generosity abroad among the french people. MacKenzie gave the address & I took the first part.\n\nToday","3":" A cricket match between the 55th &","4":" took place \n\n& resulted in a win for the former.\n\nDave Hunter who is with the 55th came over to see me & I rode over to see him & Bowran & Joe Tarn yesterday afternoon. We have had fairly warm weather Thunderstorms & a few showers, this week\n","5":"\n\nThis week has been full of changes. The weather even has been changeable From hot sultry weather we passed to dull steamy, Thundery days which gave place to cold winds and driving wintry rain making it unpleasantly cold.\n\nWe have changed our address also, on Thursday we moved up here in the vicinity of Mailly, & are now in huts & dugouts, & improvised shelter in part of the old lines of 1916 before \n\nthe bosch was driven back from the Somme front in July.\n\nThe country is open undulating with villages & pretty woods here & there & is very pleasant. We are a considerable distance behind the lines but the rumble of guns can be distinctly heard and that has been particularly noticeable today & yesterday in the direction of Leus & Arras I am fairly comfortable in a tin shanty the rain comes in & flows in a stream across the mud floor but my bed is dry & my batman has made things fairly decent for active service\n\nToday there was another Brigade parade & though a bit cold it was a good parade Jessep gave the address a Standfast Hold the traditions of your Fathers etc I read the lesson It was too wintry for open service\n\ntonight. A couple of lads came in to see me tonight.\n\nWe shall lie here for some days training Mr Holman visited the Brigade on Saturday & gave them a short address\n","6":"\n\nThe early part of last week was spent in Billets at Maiely The Training was for open warfare, & was interesting I was out 3 times We went to the old line of 1916. It is still a scene of abject desolation. One place in particular was Seves. Here there was a night operation The Troops (Brigade) went out at midnight over rough trench scarred country & took up positions & waited till day break. At daylight they advanced against an imaginary enemy (certain sections detailed to take up enemy positions. Tin cans were rattled to imitate machine gun fire. The barrage under which they advanced was a row\n\nof Flags. This village was the scene of terrific fighting early this year. There is scarcely a yard of solid level ground for a mile or two. It is simply churned up with shell holes Barbed wire lies in a tangle of shattered ends. Deep dug outs run down almost straight into the earth & the old trenches are terribly smashed. The Bosch held on to this high point as long as possible & contested the position to the last His dead lie in scores all over the field. Time has reduced them to almost skeletons Skulls are to be seen gruesome & grinning peeping out of deep shell holes. Boots with feet in them here & there, & where the village once stood is a scene of utmost desolation. There is not a vestige of it left, all that remains is a shattered tree stump here & there. It stood on a rise looking down\n\non our lines & on the other hand away across the valley to other slopes. Looking away across these slopes it seems for miles the ground is all shell marked as if some gigantic disease has left its scars on the face of nature.\n\nNature has done her best to cover the confusion The acres of shell ploughed fields saturated with human blood have been covered with a coat of green grass & out of the shed blood of men the red flowers seem to have come The crimson poppies fringe the shell holes & grow up through the tangled wires Blue corn flowers & white marigolds weave the old Tricolour of Britain over the gory field of victory in melancholy liveliness\n\nThe soldiers life is beyond the imagination of the outside. That he is in constant danger when in the line is not an unexpected experience but the discomforts with the danger and the \n\nhardships incident to campaign life are beyond the most pessimistic expectancy.\n\nHe lives in, damp oozing, dugouts with the floors awash. \nawash\n His food if it is wholesome is served & partaken of under conditions of inevitable filth. Sanitation throughout the Army is marvellous, & this description of it reveals the difficulties of the life is not intended to indicate that the Army is unmindful. Every care is taken & the results are astonishing. Notwithstanding, the life the soldier is very hard He does not know the luxury of a bed one blanket in Summer & 2 in Winter A heap of straw in an old shed is a luxury. Rats and lice & other vermin infest these places & it is \nimpossible\n for a man to keep free from vermin. It is a common sight, to see men of all classes, Bank Clerks, Students of Law, Divinity, etc. sitting naked to the waist\n\n& pursuing the evasive & elusive vermin, without any compunction.\n\nToday\n We returned to Buire on","7":" a","8":" miles.\n\nYesterday, I had a bath a hot one & it was very acceptable.\n\nToday Sunday, was wet, & church Parades were cancelled. A Special commemorative service was held at Poziers today to mark the anniversary of the push of last July.\n","9":"\n\nIt is a week since l entered up my diary. On Monday last a very interesting demonstration was given of a German Hamanwerfer. It was on our parade ground. It was of the portable kind, & the tank filled with oil & petrol was carried in the back. Oxogen under\n\nwas driven through a hose, with the oil & petrol, & ignited at the nozzle. This liquid flame shot out about 70 feet a terrific sheet of awful flame most terrifying but less effective. It was a great sight.\n\nOn Thursday the King passed along the road & our troops lined up to cheer him. At night we had a concert & it was a great success The General was in to mess & came to the concert.\n\nI visited the Hospital where there were some men of our Batt. who had met with an accident with a bomb.\n\nOn Friday morning the Batt. moved out from Buire to a camp about 9 miles & we are billeted in Huts. Last night it rained heavily & came through the roof pretty freely, swamping us all out \n\nwe were a sorry lot this morning \n\nChurch parade today. I took the 2 & 4, & spoke on \"How can we sing the Lordsong etc\" The Brigadeer & major were present.\n\nThe Germans made a thrust during the week & captured a few hundred yards up north, taking 1200 prisoners. The Russians have taken Holiez & are pushing on still further.\n","10":"\n\nToday is the anniversary of Poziers, the first success The Australians won in the push. Our own Brigade distinguished themselves here. We made special reference to it today at Church parade. A communion service followed which was fairly well attended. I had a voluntary service also tonight. During the week\n\nthere has been little of interest We have been in the same camp all the week the weather has not been too settled It has been raining almost every day. I had a reading room built which has been well used. There has been no mail this week.\n","11":"\n\nWe returned to Buire last Tuesday, on Monday I went to Amiens It is a very fine town the principal sight is the Cathedral. It presents a bold façade to the square & is very picturesque with carvings & statues around the entrance it is sandbagged to preserve it against Ariel Bombardment. Inside its high Gothic Arches are magnificent & its stained glass windows comprise both very old & also modern\n\nwork It was built in the 12 or 13 Century The Art gallery is another place well worth visiting I was not able to get there One feature of the place is the river market On both banks of the canal are many acres of market gardens, & threading through these places are numerous smaller canals The only means of access is by these waterways in boats resembling gondolas Every morning these boats come down the canals & tributaries loaded with vegetables the rich red of the fruit & light & dark green of the vegetables & the colours of the womens dresses the paint of the boats & the still water & the laughing singing peasants makes an ideal picture. \n\nWe returned again to Buire 9 miles walk on Tuesday afternoon Here we stayed till 4 aM. Friday morning when\n\nwe entrained at Edgehill nearby for the North. Our route lay through Amiens then up almost to Bethune & then on through Hazebrouck to Cassell we detrained at a small station & marched about 5 kilometres to our present billet Le Neippe.\n\nThe country here is simply magnificent Crops look splendid. Villages much cleaner than down south & the folk very kind.\n\nLast Sunday the Rain Spoilt our Church parades I was nicely caught in a heavy Shower\n\nThe usual routine has been followed We can hear the booming of the guns here again & although 20 miles away from the line there are indications of a heavy artillery struggle the papers\n\nbear this out in their reports of Flanders from day to day.\n\nRumour has it that the bosch has been heavily shelling Armentiers with gas shells & there have been some hundreds of casualties among the civilians\n","12":" \n\n500 Civilians were taken to the hospital as a result of the gas attacks in Armentiers one pathetic case was that of a mother suffering from gas effect who gave birth to a child in the Ambulance on the way to hospital\n\nThe new offensive in Belgium has begun, our troops operating with the French on their left went over the top this morning & occupied all their objectives taking about 5,000 prisoners the front was about 15 miles long, the depth is not great but heavy & continuous \n\nrain has hindered progress & the new positions have been consolidated counter attacks have all failed to dislodge them.\n\nIt has been raining incessantly all the week at times heavy, but light misty rain, making everything very sloppy It will damage many of the crops which just now look so well\n","13":" \n\nStill raining Concert last night in A & B Coys billet\n\nThe wet weather has rendered hopeless all attempts to push on at Ypres. On Saturday it fined up somewhat & continued fine though cloudy on Sunday\n\nI took Church parade at the","14":" Bn at 9 oclock & then cycled to the","15":" for 10 oclock The stiff ride & close morning\n\nrather knocked me out & I was very shaky through the parade. \"Fiery Furnace\" a sermon on anniversary of the war. 7.30 If the The Russians are still in full retreat and their position looks absolutely hopeless.Kerensky who took their affairs in hand has been compelled to resign but on the assurance of the confidence of all parties has undertaken to form a government. Their troops have evacuated all of Gallicia & the Rumanians are in danger of being cut off.\n","16":"\n\nI went into St Ouen this afternoon. I had been there before. It is one of Frances fine Northern towns.\n\nToday is Wednesday\n\nWe are busy getting ready for a move tomorrow\n","17":"\n","18":"\n\nWe left Lantappe this \n\nmorning at 7 oclock. It was a beautiful clear crisp morning after a heavy thunderstorm the night before. Our route lay through Wallon- Capel & Hazebrouck but as we neared Hazebrouck we met a stream of people making out into the country looking afraid. The Bosch bombed the town in the early morning & shelled it later in the day. (As Hazebrouck is 20 miles from the line at its nearest point, the distance modern guns can effectively be used may be seen.) It was pathetic to see the folk. Mothers carrying their little ones out of danger others dress up determined to save their best clothes. One woman carried a clock & a towell. Another her husbands new suit on her arm. They \nmove\n straggled out quite scared & the troops \n\nmarched toward it, singing & whistling Nevertheless it was thought wise to divert our course to skirt the town instead of passing through it. At the Cross roads General Birdwood & Gen Walker watched the Batt. pass by.\n\nWe reached our destination in the neighbourhood of Grand Sec Bois about midday, having done about 10 miles only one man who was sick fell out.\n","19":"\n\nLast night or early this morning, I was awakened by heavy bombardment & later heard a plane overhead which proved to be a German the Searchlights found it & the Anti aircraft batteries fired furiously. He stayed about for some time then went away. Today is dull & fresh\n","20":"\n\nDuring the week we have remained in this same place Sec Bois. The principal training has been route marching. The Weather has brightened up considerably The British & French continue to press on at Ypres. The papers say the bitterest fighting of the war is in progress. From reports of those who have recently left the front. The Germans are heavily bombarding behind the lines with Gas Shells\n\nHazebrouck has been shelled a few times this week and almost every night planes have been bombing round about.\n\nYesterday Saturday we celebrated the","21":" anniversary of the Batt we had a service at which I gave an addess & also Col Moore. The men\n\nhad a good dinner we spent about 2,000 Francs on extras. The day was also an holiday At night the Officers had a dinner with the usual toast to follow. During dinner the German planes came over & dropped a great many bombs about us but none on our billets Some English Soldiers were killed.\n\nToday I had 2 services in the morning & one at the YMCA. in the evening.\n\nThe weather has been beautiful today \n","22":"\n\nThe weather continues fine & there has been much activity on land & in air. The French have made a Brilliant advance at Verdun taking 4,000 prisoners. The Italians have also captured 7,000 prisoners while important advances have been made\n\non the Ypres \nSale\n front.`\n\nOn Sunday Monday & Tuesday mornings we had German planes over, but the vigorous Anti Aircraft defence & the use of our own planes drove them off ","23":"\n Today Wednesday the Batt. was chosen to march past the Corps Commdr Gen Birdwood . We left Sec Bois at 9 oclock & passed the Saluting base beyond Vieux Berquin at 10.30. The march needed the whole Batt. Transport included We were the only complete unit in this Bde \nto\n in it. The Batt looked very fine & the General complimented the Colonel.\n","24":"\n\nThere has been little of interest since my last entry. The weather has kept fine till yesterday when it began to rain and today is a wild cold\n\nwet day. Fortunately the farmers about here have most of their crops off & their hay stacked. The potatoes are still in the field & many of them are rotting on account of so much wet weather War matters are hopeful on the Italian front where nearly 20,000 austrians have been captured since the first attack The French also continue & Lens is being slowly invested. It looks as if the Ypres offensive will be held up & will not accomplish all that was expected, but one never knows.\n\nI had 2 Services last Sunday at 10 & 7, morning \"The Golden Calf\" 7. Thine eyes sh see the king I was able to help one young man to a firmer faith in God ( B Coy 3 Bn)\n","25":"\n\nSince Tuesday the weather has continued\n\nwild & wet. It has rained every day. There has been little of interest this week. Our service at YMCA on Wednesday evening was very good. I spoke on the need & faith of the woman with her infirmity On Thursday evening several young men came to see me to ask my help in forming a mission band to make our services more attractive & to do a little on their own account. We were to meet tonight but having a case of measles in my billet, it was forbidden to troops.\n\nTuesday Sept 4th\n\nOn Sunday last","26":" the weather was showery in the morning but we had our Church parade at 10 oclock General Walker 1st Div & Gen Leslie","27":" Bde were present. The General was to have\n\npresented the cup won by D Coy on the Div competitions but owing to the inclement weather he postponed it, but came to service I preached on \"Deep calleth into Deep\". At night I had a service at the YMCA tent & preached on \"God was in Christ reconciling the unto Himself\" we had a fine time \n\nOn","28":"\n\nGeneral Walker presented the Cup at 9 oclock. The Batt formed up in the parade ground and it was a fine sight. It was in a long line 2 deep when the General came and the Salute of \"present arms\" with fixed bayonets was very good, then the Batt formed in open square & the General made a speech complimenting the Coy & presented the Cup to the Colonel & Capt Heursh The cup was the gift of the Australian YMCA.\n\nAfter the presentation I went for a route march with D coy.\n\nToday, Tuesday,. It has been a lonely day. We had the bosch planes over again last night. They came over Sunday evening & for an hour or so the night was wild with shot & shell & dropping bombs last night, it was also very lively.\n\nThis evening we had a Concert at C Coy Billet which was a real good show.\n","29":"\n\nThe weather has been beautifully free & clean Nothing of importance today. Service at the YMCA Hall this evening. Mjr Mackenzie gave address I led singing\n\nThursday 6th \n\nWarm & sultry culminating with a thunderstorm this evening A concert which we were to hold this evening had to be abandoned \n\nWe took the piano to our mess room & had an \"evening\" there \n\nHeavy artillery all day in the direction of Lens. Young fellow Martin called to see me about spiritual things I was able to help him.\n\nFriday\n\nWarm & sultry today nothing of interest visited Major Carli this morning who is ill & is going to Hospital.\n\nSaturday\n\nNothing of interest\n","30":" \n\nI had two services this morning the 3rd Bn at 9 & the","31":" at 10 preached on \"Ye have not passed this way heretofore Sanctify yourselves for tomorrow the Lord will do wonders among you Josh 3.4 At 7 oclock I had a service at the YMCA tent Capt \nGod was in Xt\n \"What man of you having 100 sheep if to lose one\" etc\n\nThese are probably the last services we shall have for some time as we move up to the line this week\n","32":"\n\nfine clear beautiful day. Nothing much of interest\n\nTuesday\n\nfine \n\nWent for a route march tonight & wore gas helmet on the march Not a very pleasant thing.\n\nWednesday 12\n\nWe are preparing for a move tomorrow after about 5 weeks in Sec Bois. We shall not have such a peaceful time again for a long time The future \nw\n promises some very hard work for the 1st Div. We leave tomorrow morning at 7 oclock for the front \nTonight\n last night a young fellow who was greatly troubled spiritually \n\ncame to see me & we had a long talk I have been able to help quite a lot of lads… It is no wonder their faith is surely tried & they seem more concerned about the assurance of Faith than any prospect of death They want to realise the presence of God. He seemed to be much helped & was very grateful.\n\nThursday Sept 13th\n\nThe Battalion moved out from Sec Bois at 8 oclock. We parted with a number of officers and men who go to the Reinforcement Camp & are not going into the push. They will be used when we come out to reform & reorganise the batt. Our march was only about 6 miles through Strazele to Metteren where we billeted for the night. The weather was cool & cloudy we reached here at 11 oclock\n\nFriday Sept 14th \n\nDull, cloudy & promising rain We left Metteren at one oclock & marched about 12 miles to our present camp near Onderom & Orkelush in Belgium The country is very nice. Hop fields are plentiful & the women, girls & boys are very busy picking hops The hops grow on big trellises & run up on wires like vines The wire is fastened by a string to a cross wire about 20 ft. up a knife on a long handle is run along the top wire & cuts the string & the wire falls then the pickers pick the hops they get a penny a kilo = 2 lbs about, rather more. There is no skill required in picking & the children do quite as well as the grown folk & make good money about £ 1 per week. The place here is very busy, hundreds of Motor Lorries are parked about and a constant stream of lorries & troops is moving along\n\nall the roads.\n\nWe are about 5 miles behind the lines. There is great preparation for the push which will probably take place very soon\n\nSaturday Sept 15\n\nToday I saw the model of the county It was a piece of ground about ¾ of an acre, with hills valleys swamps & woods trenches gun emplacements, Farms & roads & railways an exact replica to the county that will be the scene of the push It is a fine piece of work and gives a very good impression of the nature of the land.\n\nAeroplanes are very numerous and observation balloons are thick I counted 18 within a very small radius last night.\n\nWe stayed in this camp which consists of huts & tents all day today & we move tomorrow morning I believe up a little further to the front.\n\n2 letters from \nhome\n Aust today 1 from Home & I from Mr Rowling dated","33":"\n\nSunday Sept 16th\n\nWe left Ottowa Camp Ooderdene today at 8 oclock & marched to Dickebush huts, a couple of miles up. The traffic is tremendous on the main roads. We passed a tank on the way & another was standing near our camp I had a good look at it \nand\n both inside & outside. The effect of their first appearance mush have been a terrific surprise for the bosh.\n\nOur huts are in a clump of hills. Fifteen German planes flew overhead this morning, and tonight the German Guns were shelling round about us.\n\nI was not able to have a parade this morning, but I had\n\na voluntary service this evening There was a fine lot there I spoke on \"Casting all your anxiety on Him for he careth for you\".\n\nMonday 17\n\nWe remained in the huts today one company has gone up to work in the trenches. We had a man killed today & several wounded.\n\nIt has been cloudy with light misty showers occasionally Tonight, before dark, I witnessed a very fine piece of work by one of our airman. He looped the loop beautifully just above our heads\n\nTuesday 18\n\nWe are still in the huts & there has been little of interest. The guns are pretty busy. We expect\n\nto move tomorrow morning, up into the line.\n\nWednesday 19th\n\nThe Battalion moved up the line this afternoon at 5 oclock I saw them off. I was ordered to remain here, much against my will but the Battalion was going up to open trenches in support. Tomorrow morning at daybreak 17 to 20 Divisions will hop the parapet. The ground to be taken is very important & everything has been thoroughly prepared & the weather keeps fine\n\nThursday 20th\n\nI was awake to hear the first shot of the barrage, & at daybreak we attacked on a front of about 8 miles from Langemark to \n\nHollebeck. 2 Australian Divisions the 1st & 2nd were allotted a line embracing Glenense wood and Nonne Boschen wood while their 3rd objective was a line from north of Polygon wood through the wood to a point, about half a mile below, and embracing some very heavily fortified country. German \"Pill Boxes\" – great concrete forts – built of steel & concrete feet thick & bristling with machine guns were studded here & there over the ground to be won. These forts strong as they were availed little against the hurricane of shells poured into them. Huge shells thundered at them from our 12 & 15 inch guns & split them & battered them out of action\n\nThe Barrage was the most effective\n\n& the most accurate barrage of the war. Rather new methods were tried The Barrage. It was a creeping barrage, which rested on certain positions for from 3 to 7 minutes till it reached the first objective where it stayed for about 12 or 15 minutes Our men advanced behind it slowly within a hundred yards then when they moved they moved on with it to the 2nd objective the support troops moved up to the 1st objective. The \nfirst\n 2nd & 3rd Brigades of our Division were attacking & our Bde was in support while our Battalion was carrying to the troops ahead.\n\nThe third objective was subjected to a crushing bombardment which battered the German trenches into dust & then for 1000 yds beyond\n\nthe artillery poured a terrific hail of deathly shells, battering everything within its range & remained stationary pounding the boshes for an hour or so till the 3rd objective was securely won and the support troops coming up consolidated the position It took about ","34":"\n 5 hours to reach the last line. The Germans where they \nwere\n escaped surrendered freely, over 3000 prisoners were taken & many german dead lie strewn in the field our casualties were comparatively light & most of them were walking cases Our Batt. who had to remain in support & take the shelling lost 2 officers killed 2 wounded about 20 men killed & about 80 wounded.\n\nThe ground was churned up for miles & it is almost impossible to walk between the Holes\n\nOur Batt, remained in the trenches till Sunday morning when they were relieved. Hundreds of planes it seemed took part\n","35":"\n\nThe Batt. came out about midday into Dikebush huts again.\n\nThe first thing the soldier does after such a time is to wash, not having had his clothes off during the battle and to shave Around every little water hole could be seen scores of naked men enjoying a cold bath and on every stump & tree little mirrors were stuck & men were getting off the thick growth of beard & then followed a good feed and a rest & sleep. The men were very cheerful & as I looked into the huts little groups were discussing the experience of the past few days\n\none was telling how he was buried by a shell another how his clothes were cut by shrapnel others how their comrades fell & so on far into the evening.\n\nI told them I was having a service and quite a good many gathered round as we sang & read and had a short address. & the day closed in.\n\nEvery night we were treated to a visit from the Hun planes dropping bombs & sometimes flying low and firing the machine guns at the horse lines & into groups where the \nwere\n men were living, but fortunately we escaped\n\nI was sleeping out under a mess cart cover, but it was fine weather & I fared pretty well.\n","36":"\n\nwe moved back to Ooderdorn into Ottawa Camp and\n\nstayed the day here\n","37":"\n\nwe left this morning by Motor Busses. It took about 100 Busses (Motor lorries) to take the Brigade & beyond being smothered in dust & a tiresome ride (which even then was much better than walking) we reached our billets in the vicinity of Steenvoorde & here we are tonight as I enter up these records.\n","38":"\n\nThe weather remains fine. Last night the Bosh counterattacked our new positions heavily. I hear today our succeeded in forcing our lines back but in a counter attack we restored all the line again, and this morning the 4 & 5 Divisions AIF hopped over again & took Zenebeke and a\n\nfurther piece of ground taking the remainder of Polygone wood Other \nBatt\n Divisions also attacked & the push was to a depth of over 1,000 yds. & over 1000 prisoners were taken. These positions have been consolidated\n","39":"\n\nWe are still here. This morning the Col & I rode into Steinvoorde we passed the","40":" Division & the N. Zealander going up.\n\nTonight, the batt. went to Steinvoorde to a Concert. We took the hall & the Kookaburras put on a very fine show. The weather continues fine with clear moonlight nights.\n","41":"\n\nA beautiful day again with a sharp tinge in the atmosphere\n\nHave been writing letters of sympathy all day.\n","42":"\n\nNothing of importance.\n","43":" We are under orders to leave this afternoon We had a service this morning I spoke on \"A Man shall be as the Shadow of a Great rock in a weary land\".\n\nAt I oclock we moved off to catch busses on the main road.\n\nAfter a wait of 2 hours the busses came. Owing to the dry weather the roads were terribly dusty & we were smothered in dust. It took about 30 big busses to carry us We left the busses at Dikebush & marched about 32 miles to \n\nwhat is known as Chateau Segard area. The camp consisted of a few dug outs in very poor condition & small canvas shelters for the men I was in a dug out with six other officers We stayed here the night.\n","44":"\n\nRemained in camp all day.\n","45":"\n\nThe Battalion moved up to the line this evening. I had a service this afternoon There was a very good crowd of fellows present. At nine oclock they left camp.\n\nThey were all in very fine spirits.\n\nWednesday\n\nIt is very miserable here\n\nnow that they have gone up Tomorrow will see the opening of the","46":" Stage of the push here & our battalion takes the first objective\n","47":"\n\nThe advance began this morning at Daybreak.\n\nA detailed account will be added later. I went to several hospitals during the day. Prisoners were coming down in hundreds & wounded were packing the hospitals. I hear the objectives were all taken. M Clark died today Called at 35th Transport & saw some of the Old Batt.\n\nFriday \n\nToday I went up to the hospital on the Menin Rd I passed through Ypres \n\nYpres has been a fine city \n\nA thick wall encloses it making it very strong. It has been the scene of the bitterest fighting in the war. This is the","48":" great battle that has been waged at its gates & the slain have been in thousands There is not one single house which is not absolutely wrecked. The beautiful Cloth Hall a magnificent place in peace time is now a ruin. The country is flat with a rise up towards what were Bosh trenches about 3 miles away & it was for the occupation of this important ridge which overlooks miles of plain country beyond that, this terrific struggle is taking place\n","49":" \n\nRain has been falling all day & the battle rages up in the trenches. Our Transport had a terrible time going up last night. There was a block on the road & the Huns were shelling. Dead & dying horses and men were mixed up with splintered wagons in the dark & the mud. We lost four horses. One was killed under the rider but he escaped with a severe shaking. The timber waggons were blown to matchwood. The road was blown up for a hundred yards & it was impossible to travel for the deep slime & mud.\n\nThe weather has been bitterly cold & our men have neither coats nor blankets & they have been in it for \n\ntwo days.\n","50":"\n\nThe Batt. Came back to supports today.\n","51":"\n\nWe moved back to Dickebush huts, & the Batt. came out to here, tonight in the driving wind & rain.\n","52":"\n\nWe left again this morning, by Motor busses, for Connaught, lines near Abeele, where we are in tents We are back from the line about 8 miles. The wind is terrible & living in tents with no floors is anything but comfortable. \n\nWe have had a great many changes during the last month The sleeping valise is ones home as long as it turns up things are OK, but the continual moving\n\nbecomes very tiresome\n","53":"\n\nLetter from Col Green today, he is in the hospital & has broken down in health: (Calais)\n","54":"\n\nI left for Calais this morning. Picked up motor lorry to Poperhinge but missed the train However having the day to spare, I determined to try & get to Calais, & in a spirit of adventure set off. I was very soon on board a Motor Lorry, bound for Steenvoorde about 10 miles I stayed here for lunch & set out again walking along the Hazelmick Rd It was pleasant walking. I had gone about ¾ of a mile when a car came along & I got a lift in a fine motor car right to Hazelmick about 12 miles. From here I expected to get a train\n\nbut missed it by 10 minutes so turned towards St Omer about 85 miles distant I had not gone far before I got a lift in a fine minerva car, right ot St Omer. Here I found there was nothing till 8.30 it was now about 4 oclock. As I did not want to wait so long, I got on a Horse Hospital train (350 Horses, wounded & sick) & reached Calais at 8 PM. I stayed at Hotel Sauvage till Saturday.\n","55":"\n\nVisited Hospital & found Col Green had returned to England I then visited the other hospitals in search of any of our men It was showery all day. Calais is rather a nice town & its beach is very nice.\n","56":"\n\nreturned to unit rainy all day \n","57":"\n\nChurch parade today, under difficult conditions wind & wet.\n\nI held a service this evening in one of the huts Subject \"Calvary\" As a German plane with bombs came over we had to put lights out quickly & the service finished minus the benediction.\n","58":"\n\n\\Spent the day writing. The camp dried up a little the weather being fine. A Bright night is the sure sign of Bomb dropping activity & about 6 oclock a fleet of planes put in an appearance Search lights from all quarters made a fine sight. The Bosche dropped a bright light which hung in the Sky.\n\ncoming down gradually and illuminating the countryside for a mile or so it seemed. The peculiar sensation which everyone gets is \"Im sure he’ll see me\", or my camp\" Then shortly after the peeling of the bomb coming down could be plainly heard and crash| 12 in quick succession a couple of hundred yards away. It made us \"duck\" for whatever cover the ground afforded for a flimsy tent is poor shelter\n","59":"\n\nThis morning we moved up again we marched 2 miles & then got Busses and came in to the Canal Area near Ypres, we have rather good quarters for a war stricken area, & my batman has made a bunk & a table so I am OK.\n","60":"\n\nThe men are on railway fatigue working up in the front area.\n\nThe weather being bright & fine, there is great aerial activity. I witnessed a thrilling & awful sight, this morning a Hun plane was attacked by 2 or 3 of ours at a height of about 10,000 ft. He fought well, but was handicapped & he was seen to swerve & a jet of flame shoot out as he plunged headlong to earth, he regained control flew a little farther then fell, one wing snapped off and the machine spun round & round in its headlong death dive Then a small black object keeping pace with the machine & then falling back could be seen It was a man falling from thousands of feet up in the air An awful sight. Smashed\n\nto pulp 3 planes were brought down near here.\n","61":"\n\nLast night rain set in & fell steadily all night making everything awfully muddy This morning was bright & clear I went to see the 35th Bn They have been badly cut up They went \"over the Top\" reached their objective but had to come back. Couldn’t hold it, & suffered Terribly. Poor old Cadell, Amphlett were killed Arnie I am told was wounded on the 12th. All the 9th Bde. suffered terribly \n","62":"\n\nNothing of importance today. The usual bombing raid was over tonight but we escaped.\n","63":"\n\nOur men \nare\n have been up in farming area on railways relieving \n\nat night. The days have been fine – but every night it rains and keeps the ground in a terrible state.\n\nThe usual Bombing planes were over tonight. There is a nightly recurrence when the weather Is fine enough\n","64":"\n\nOn Sunday last we had a parade at 10. I buried one of our men at 3, & at 5.30 I had a service in a hut. It was a splendid time & the singing was very fine. The hut was well filled During the service the 3 blasts of the whistle were sounded & all lights out, but, we had ours well screened & carried on 6 large bombs fell quite close it seemed, but we carried on. \"The Closed door\"\n\nSince Sunday there has been little of interest. There has been very heavy artillery all day. A terrific barrage was put up on Monday morning. lasting from 3 to 7.30.\n\nThe back areas where we are have been shelled consistently. Ypres has been shelled and there have been quite a number of casualties.\n\nThe weather continues showery, but except for underfoot, it is not bad weather.\n\nA percentage of our men returned to the reinforcement camp today so that in case of casualties we shall have the neuclius of a batt left.\n","65":"\n\nThree days have passed since an entry was made but things have been much the \n","66":" The weather has been showery & it is very bad underfoot.\n\nWe have been subject to Bombs and shells every night. We have had several casualties during the week, on Thursday 26. There was an attack on the","67":" Army Front. It was not a great success, but there was some ground gained & prisoners There is a fair amount of sickness Colds etc. in the Bn I was amused to hear of a trick one of the men played on the MD. He had a cold & went on sick parade The Thermometer was put in his mouth but when his back was turned the patient took the thermometer out of his mouth and put the end of it on a lighted candle the result being that he showed a temperature of about \n140\n 110\n\nHe overdid it, a second thermometer & also observations revealed the trick. Some great schemes are worked to get to hospital.\n","68":"\n\nLast night the hun airmen were very active dropping bombs. About 6 oclock he came over head and unloaded about a dozen bombs he got about 30 men in the","69":" Bn who are close by us 12 men were killed. We had a good parade this morning at the Hall. It was a combined parade of non Anglicans. I took part & Padre McKenzie gave address\n\nWe buried 14 men this afternoon.\n\nBombs were dropped all round us again this evening\n","70":"\n\nToday the weather has been fine & the night\n\nbright full moon\n\nThe hun has been very active all the night. He was one plane every quarter of an hour from 7. till 12. & dropped a great number of bombs Scores of machine guns rattled at him but seemed to do little damage. He shelled \nuse\n at us occasionally. My batman happened on the rum ration for several HQ men this afternoon & felt \"another little nip wouldn’t do him any harm\" till he was awfully familiar with all & sundry, and finished up by spending the night in the Clink leaving my bed not made and things in disorder generally\n","71":"\n\nThe war situation is not very bright\n\nat present. The Germans claim the capture of 80,000 Italians & the pursuit still continues. Our gains here of a few days ago had to be forfeited as the Canadians could not hold on with their flank expo\n\nA slight advance was made today but the problem is can they hold on?\n\nThe morning was fine with a bitterly cold wind blowing, at about 10 AM rain commenced to fall & it is still drizzling & very cold.\n","72":" ","73":"\n","74":"\n\nOver a week has passed since I wrote up my diary.\n\nWe moved from Chateau Belge to the Canal. Here we stayed till Monday 5th when the battalion moved up into the line\n\n(Continued after the Aug Battle)\n\nAccount of advance of","75":"\n \n\nOn Tuesday 2nd Oct the batt moved up from Chateau Segard to Anzac Ridge relieving the 10th Bn (NZ?). They remained here til 01.45 on the 4th when they took up the psition on the tape line. Light rain set in about midnight. The night was dark and the heavy & congested traffic on the \nroads\n tracks combined with the mud, made the march into position very difficult.\n\nAs\n The enemy had selected the morning of the 4th for an attack himself. Captured documents previous statements were to the effect that his objectives were as far back as Westbuck Reg. This accounted for the large number of prisoners & material which fell into our hands\n\nThis attack was timed for 6 oclock: the same hour as our own, but owing to variation of 10 minutes in the respective times. He was 10 minutes behind.\n\nThe \ntape\n two opposing armies were actually in no mans land together each getting into position about the same time. \nThe fact that\n Each was so interested in his own operation that he did not observe the other His barrage came down at 0530 (our time) It was very heavy & included \ntoo\n heavy trench mortars (Frumenmorfers) the battery of which was captured by us later .\n\nOne of our men being pretty new with is long walk up to the position fell asleep on our tape line as they \n\nwaited for zero. He was awakened by the Hun barrage and thinking that it was our own hurriedly got up and on the dim dusk went forward he went on till he \nwas\n found himself on the hun lines. He was promptly taken prisoner and hurried back to the rear. 3 Germans in a shell hole took care of him &when our barrage \nintefe\n began a discussion arose as to whether they should kill him or leave him & while they were debating the point our men swept forward and found him &he had the privilege of escorting the 3 Germans back to our prisoners cage.\n\nOur casualties during the barrage were not heavy, owing to the fact that the tape line was in advance of our front trench system\n\nAt 6 oclock our barrage opened along the whole \nfront\n of the operation which was about 12 miles long. The barrage was excellent and moved with clocklike precision. Immediately it opened battalion in conjunction with other front objective troops moved up & advanced with it. The enemy was surprised not expecting an attack that morning. The opposition was very slight except in the centre of the sector where he was occupying a line of pillboxes from which he brought mortars bombs machine guns & rifles to bear upon us. This difficult was soon overcome and 7 oclock we were on our \n\nobjective, the flanks were linked up with neighbouring units & began up till that time we had sent to the rear about 100 prisoners including six officers Our casualties numbered up till this time \n100 me\n 7 officers & 100 other ranks. The enemy artillery was particularly heavy all day & not until evening did it slacken. Both the 1st and the 4th Batts. were behind us and moved through us \nup\n on to the second & third objective, which they carried with slight opposition\n\nAmong the Captives were Prisoners 200 21 Machine Guns 4 trench Mortars 2 Haminwafers 1 Telescopic range finder.\n\nThe weather during the day was fine. The operation on the whole front was entirely successful \n\nWe remained here at Molenaarelothock till the night of the the 5th when \nthey\n we were relieved by the 10th Bn. and moved back to Anzac Ridge. Heavy shelling continued at intervals The weather was too bad for much aerial activity but in the fine periods Enemy planes were very active, flying low over our positions. The Batt. was relieved on the night of the 8th and came out to Huts at Dickebruch.\n\nThe officers killed were\n\nLt E Clark, Transport Officer 3rd Lt Watson H J F of 4th Capt. Hewish A L night of 5th \n\nCapt. Morse R. I. (MC) on the 7th 2 Lt A N Buckley, A E Smith, W F Elliott, Lt McDougall, GR. R B Alpport 2nd F G Fitzpatrick S Rudkin, Christie Lt Keninus (2nd Forbes Smith D. O. W. while attached Div Baths on 2nd Oct.)\n\nOther ranks killed\n\nContinued from Diary, Thurs 8th\n\nOwing to our adjustment of Chaplains on the 1st Bde Wilson C of E. was sent to the","76":" & I was attached to Brigade HQ. I went there on","77":"\n\nWe are billeted in the Old Military barracks in Ypres.\n\nAmong all the places in Ypres this is the least knocked about. That does not signify much for there is not a wall standing anywhere else. The barracks have been badly battered but between the thick brick walls shelters have been lined with sandbags & iron till it houses quite a number of men I lived in one of its dingy rooms\n\nWe are shelled every day some of the shells come uncomfortably close, but so far we have escaped\n\nThe Brigade has moved up the \n\nline and the staff Captain & I are staying at the old barracks Yesterday we were shelled pretty constantly all the afternoon several men were killed.\n\nA Bosh plane was brought down here today.\n","78":"\n\nThe relief of the Division commenced today. An english division is coming in today Our Brigade will be relieved by them on the 10\/11th & after a day or so here we are going back for a rest.\n\nLast night was very cold & wet. Today is fine, & not so cold \n","79":"\n\nWe left Ypres on ","80":"\n","81":" at 10 oclock He was shelling as\n\nwe left. I came down on a Motor Lorry. Between Ypres & Hamalinge a squadron of German planes came over and were flying low. They dropped a bomb quite close to our Lorry. He quickened pace, a second bomb fell 5 yards behind the Lorry, but fortunately was a dud. It fell right in the middle of the road. A third fell, a little behind & the explosion was terrific but we escaped without disaster. Waggons with galloping horses tore down the road. Men ran for cover everywhere, but being in a lorry travelling one had to sit tight.\n\nWe went into Camp near Ouderdown. Bombed again last \n\nnight, & shelled. \nNo services yesterday.\n \n\nToday Monday is a lovely day. Sharp frost this morning & bright sun today.\n\n The brigade that relieved us had a terrible time getting into the line. They were 10 hours covering 8 miles owing to the rain & the shelling of the tracks many of them got bogged & some of them died in the mud, bogged & exhausted. Our own men had a terrible time coming out. Frequently they sunk to their waists in icy cold slush & had to be pulled out by their comrades.\n\nThe third got 3 prisoners one walked into our lines with important dispatches on him. He was a \n\nmessenger who had got lost & wandered into our lines.\n\nTwo huns surprised one of our officers who was walking out in no mans land to one of our posts. He only carried a stick. They pointed a rifle at Him he charged with his stick & they both put up their hands & he brought them in.\n\nWe are moving back We have a three days march.\n","82":"\n\nOn Tuesday morning","83":" we left Halifax Camp and came into Berthew. The day was fine & the roads fair The men were tired but in good heart\n\nValises were left behind, slept in clothes, no towels soap or toilet requisites next morning\n","84":" we came in to Le Neippe\n\nCame on by Lorry. \n","85":" Came in to \nWardaques\n Wardreques \n","86":"\n\nLeft Wardreques about 9 oclock on a Motor Lorry. We came through Arques then to Limbres then Wizernes & reached our destination Elnes about 1 oclock. The country here is rather pretty several larger Paper Mills are to be found about. The trees have lost their leaves & the dull foggy days detract from the beauty of the place.\n","87":"\n\nThe Brigade rested for a day here. The men have been marching for 4 days and have still another 2 days to go They average about 10 miles per day but they came out of the trenches straight on to the road & are a bit\n\nfagged The weather keeps fine but dull & the roads muddy.\n\nWar affairs.\n In Palestine the British are within 12 miles of Joppa & have cut the railway from Joppa to Jerusalem. The Germans & Austrians are not making much progress in Italy just now though they are but 12 miles away from Venice.\n\nThe Germans have shelled Passcheandale terribly & have made several determined attacks but so far without success. Kerensky is reported to have reached Petrograd & to be getting the upper hand\n\nAustralia is to have a referendum for conscription before Xmas\n","88":"\n\nLeft Elnes at 9 oclock & came \n\non through very nice country to Blequin, where are to stay the night. Weather dull but fine cold & raw. No Services possible today 10 miles today\n","89":"\n\nWe left Blequin this morning at 8 oclock our trip was about 18 miles I came on the Motor Lorry through very pretty country & some nice towns & villages. We arrived at our destination \"Frencq\" at about 11.30\n\nWe are billeted in a fine old Chateau 160 years old The grounds and woods are well kept. In summer it must be delightful\n\nThe trees have all lost their leaves & it does not look its best. I have a very nice room & the owner is very hospitable\n\nIt is a great change after the noise of war no sound of it ever reaches us. The position is South of Boulogne & between it & Etaples about 43 miles from Etaples off the railway & about 6 miles from Samer.\n","90":"\n\nWent round the grounds for a walk this morning & then wrote letters\n","91":"\n\nHave not been out. British made a push near St Quentin Successful\n","92":"\n\nThe extent of the advance towards Cambrai so far is that the Hindenburg line has been breached and our troops have advanced to a depth of 6 miles on a 12 mile front. About 200 tanks went over without any artillery preparation and the infantry & Cavalry poured in through the breach The Germans were completely taken by surprise We have taken about 10,000 prisoners & 100 guns & the fighting continues, very desperately I had a service this morning with the","93":" Battalion It was bitterly cold & not at all pleasant A keen strong wind is blowing\n","94":"\n\nThere has been little of interest during the last few days. In a quiet little village beyond an occasional visit to the different billets there is little else. The weather has been fairly good Slight showers fall almost daily but it is not cold.\n\nI Walked into Etaples yesterday and back. I went to see one of our men in hospital but he had left that morning There is a large reinforcement Camp near Etaples.\n\nReceived a letter from home dated","95":" yesterday also parcel from E C DeGaris for distribution to the men\n","96":"\n\nWe have had a week of very sharp frosty weather but during the day it has been clear & bright The ground is frozen on the surface & the ice & frost in the shaded places does not melt all day. It is fine bracing weather with a keen sting in the air I go for long brisk walks and return with a warm glow up\n\nThe church services on Sunday last were held under these conditions It was very cold underfoot & the service was a difficult one on account of the cold\n\nGeneral Walker was present. We had communion to follow in the School house on Monday evening. I distributed some cigarettes & writing paper to the men of the","97":" Bn and gave them an address on Egypt. They took a keen interest in it and listened attentively & one man moved a vote of thanks & it was carried by acclamation.\n\nI received word this week that I could return to Australia & that Pitendrigh would take my place with the first Brigade\n\nI shall be sorry to leave\n\n\\\n\nthe men but duties call me across the sea.\n\nYesterday we began the voting for \nthe ref\n the Conscription Question. From what I can gather there will be a majority for \"No\" among the soldiers though their reasons are not at all convincing\n","98":"\n\nThe past 2 days have been very cold but clear & light. Sharp white frosts which lie unmelted all day Today is warm & beautiful. Last night it rained again\n\nThe news yesterday was not too good We evacuated Bouston Wood & have to withdraw & straighten our line in the Cambrai Salient\n\nOn","99":" we left Frenq for the line again. The first day was a distance of about 8 miles & we billeted the night at Pasonby Bdr.H.Q were in an old chateau & we were very comfortable\n\nWe left next morning at 9 oclock & travelled about 10 miles to Campagne where we billeted in the village I was billeted with an old lady who was very good. The weather remained fine but cold.\n\nWe moved out next morning, Sunday 16th to Elnes, about 8 miles It was a cold morning with white frost We billeted here on our way down so the place was well known to us. There happened to be an Auction Sale on at the \n\nChateau, notwithstanding the fact that it was sunday. The people of the village rolled up to secure bargains. I stood watching it for some time and decided that French Auctioneers are much akin to English in manner & phrases & banter\n\nWe\n It began to snow early in the evening & was very cold I had a fire in my room for which I paid 2 francs & as we had to be up very early next morning I turned in early.\n\nMonday 18th Dec\n\nWe were up at 4 oclock It was perishing cold, blowing & snowing and dark. The men had 6 miles to march with packs to catch the \n\nfirst Train leaving Wizernes at 7 oclock The conditions were terrible Driving sleet & snow & heavy packs\n\nThe train was nearly an hour after time in starting The 3rd Batt. was in the first train & I travelled up with Col. Moore & HQ Officers\n\nOn arrival at a small siding we had but a mile & a half to march to Kemmell where Pde HQ is billeted in an old deserted Chateau which bears marks of the war. We were again in the forward area where no civilian is ever allowed to go unless provided with a special permit.\n\nThe chateau was awfully cold & outside a freeze set in a sharp frost hung in the trees & the ground was\n\nfrozen hard.\n\nOn Tuesday I took a walk over on to the Wycheats Ridge from which the Bosche was pushed in the Messines battle. There are some enormous craters where the mines exploded one of them is over 100 yds in diameter & quite 80 ft deep.\n\nWhen I returned I found that my successor Rev Pittendrigh had arrived\n\nI spent next day with Bde. & Pittendrigh & I went for a long walk.\n\nMy Movement order came that night from Division\n\nThursday 21st\n\nI left by a Motor Lorry this morning The nearest railway station It could drop me at was Poperhinge There \n\nwas an exceptionally heavy frost. The trees were white as if it had snowed heavily, even the mules with long coats were covered in frost I have never seen anything like it.\n\nOn arrival at Poperhinge (Belgium) I found there was no train going till next morning, & put up at the officers club for the night.\n\nFriday\n\nLeft Poperhinge by the leave train at 10.30, & did not arrive at Boulogne till 7 oclock (about 4 hrs late on a usually slow train) I found the hotels nearly all full but managed to get a bed at the Paris hotel\n\nSaturday\n\nI got my stuff to the wharf The handling of a heavy valise is a great nuisance travelling & then I waited in a \n\nqueue at the R.T.O’s office for nearly an hour in the stinging cold. How I did bless the R.T.O. & then when my pass was initialled I had the greatest difficulty in getting a board as the boat was crowded I pleaded that my stuff was on board & was let pass (the last one.). We drew out at 11-15, a convoy of 3 boats, escorted by destroyers. Except for being rather cold the passage across the Channel was uneventful & the sea was calm It took nearly 2 hours to cross & the trains were crowded I waited for the second train but could not get a seat in the Pullman car so had to fast from 8 till 5 oclock\n\nI stayed at the YMCA off hut at Victoria station\n\nSunday\n\nLast night at 11.30 we were aroused by the porter informing us that there was an air raid warning & owing to the flimsy shelter of the hut we had to seek shelter in a cellar (by order) I got up & partially dressed but as nothing further was heard I lay down again Rather hard on one when one expected a comfortable night’s rest\n\nI went to Horseferry Rd to report but there was neither the senior Chaplain nor the official I wished to see at the office. From there I went to Westminster Abbey and heard part of the morning service. I left before it was over as I wanted to go to the Westminster Wesleyan Hall \n\nA thick fog hung over the city & the congregation was not very large. I enjoyed the service. Rev Dinsdale Young preached from 5.40 to 7.8.Then said he Lo I am come to the volume of the book it is written of me I delight to do thy will\n\nIt was a good solid sermon 4 points were taken (1) The reminiscent sermon\n\n2. The Annunciatory sermon\n\n(3) The prophetic sermon\n\n4 The obedient sermon\n\nI thought the first point a little strained but with the","100":" Chapter of Hebrews as a commentary on it. It was a fine exposition.\n\nThe prayers were helpful & the theme was the advent.\n\nNo one spoke to me either going in\n\nor coming out.\n\nI took my valise to the Kit Stores this afternoon and packed a few things I thought I might need in my suit case.\n\nIt was late when I got back so I did not go anywhere to service tonight It is not easy, finding ones way about London after dark\n","101":"\n\nI got a pass to go on leave and took the 10.30 train to Edinburgh and arrived next morning.\n","102":"\n","103":" we went to Mr David Baxters to Dinner and spent the rest of the day there The following days were spent quietly. On Sunday\n","104":" I went to Leith Church & heard Rev. Cameron and at night went to hear Rev. Slater. He was very good & is regarded as one of the leading preachers in Edinburgh\n\nI was once to see Mrs MacDonald. On","105":" I went to Glasgow to see Mr & Mrs Singer. Their Son Alex was home on leave. At night we went to the pictures\n","106":"\n\n We called at one or two places & \"first-footed\" them as is the custom in Scotland & some visitors came to Dinner & stayed the afternoon & evening. \n\nOn Wednesday, I left Glasgow in the 4 oclock train for \n\nEdinburgh having enjoyed my stay very much\n","107":" \n\nI went to the Usher Hall & heard the Grenadier Guards band it was very fine. The hall is a beautiful place built from a fortune made in the Whisky trade. Another free hall is the McEwan Hall, built also out of the profits of Drink\n\nI left Edinburgh on Thursday evening. The weather had kept fine but pretty cold.\n\nI arrived in London at 8 oclock Friday morning & met the Senior Chaplain who posted me to the","108":" Training Camp Forant, till I get a passage to Australia. So after a \n\nbusy day, I left next day.","109":" for Forant. The place is situated near Salisbury & I arrived here at 5 o’clock \n\nOn","110":" I took a parade in the YMCA Hall near by at 9.30 & assisted in another service following it & also at Communion I met Rev Bond one of our next Meth Ministers.\n\nThe weather has turned bitterly cold\n\nOn","111":" I met Capt. McCook & we visited the camp close by & also a cemetry in the Village Churchyard The Church a very old one the present structure which comprises\n\nadditions to the older one dates back to the","112":" Century. The old church of which there is much still included in the newer goes back to about 6 or 7 hundred.\n\nThe Vicar was very kind He asked us in for afternoon tea He has been here 20 years\n","113":" afternoon. I went up to Capt McCooks hut & had dinner with them & met Major Prince & Capr. Kelly both of whom I had known from the time we left Australia\n\nI went down to find Arnie & was successful, & had a chat to him he is almost recovered from his wounds, received on","114":"\n\nAfter dinner, saw Rev. now Corporal Bistock Jones, who is here recovering also.\n\nIt was a very bitter day & slight snow fell & a keen east wind blew.\n","115":"\n\nThe weather today has again been very cold the ground is frozen hard & the wind is very cutting.\n\nI visited the hospital this afternoon & met several fellows I knew there\n","116":"\n\nThe weather towards the latter end of last week & yesterday was fine cold & clear there is little of interest. I\n\nhad a trip to London on Friday to get my paybook which was at the pay office awaiting audit. On Saturday afternoon McCook & I went to Wilton where his wife is staying I borrowed a bike but it punctured after I had gone about a mile & I had to mend it.\n\nOn Sunday I took two services one at 9.30 & the other at 10.30\n\nLast night it began to snow and continued all night so that the ground was covered to a depth of 7 inches this morning It was a very fine sight \n\nI have not been out today a thaw has commenced and everything is terribly sloppy\n","117":"\n\nDuring Last week Col Holden held a conference with the Chaplains at Salisbury (Thursday). It had snowed very heavily during the night before & it was very heavy walking to the station.\n\nWe had lunch at the Nelson Temperance Hotel & engaged a room for the conference We discussed a scheme for meeting the needs of the Aust. at Horseferry Road by taking over the Wesleyan Church near by & fitting it out as a social room during the week & having evangelistic services on\n","118":" also, & the work of chaplains came under review & the question of Supernumeray levy (Current) was discussed and a unanimous vote that the Conference should be appealed to to pay it. \n\nOn Friday it rained all day, & blew, the creeks and all flooded & in some parts damage has been done.\n","119":" last I had a funeral at Salisbury, a death from Meningitis.\n","120":" I had 2 services one at 9.15 & the other at 10.30 the latter was a very fine service.\n\nOn Sunday night I got instructions to be ready\n\nto move but up to the present the final notice has not come to hand.\n\nI went up to see Capt. McCook yesterday & we had a few games of chess, in which I lost.\n\nThe weather during the past 2 days has been very nice & quite mild with bright Sun.\n","121":"\n\nSince Sunday last I have been waiting expecting every day to get orders to embark but up to the present I have none. It completely unsettles one I must not leave Camp for more than an\n\nhour or two.\n\nThe weather this week has been exceptionally mild for midwinter. I called in Bath one of our Chaplains & also paid a visit to McCook, who was also down to see me, we had a couple of games of chess.\n\nI have had 3 services today one at No 10 at 9.15 another here at 10.30 and this evening I gave an address at the YMCA.\n\nI went for a walk through the woods this afternoon & enjoyed the ramble very much. I have\n\nreceived a couple of letters from Australia this week 2 from Ian & one from Muriel.\n","122":"\n\nOn","123":" I received instructions to proceed to Weymouth for Embarkation and caught the 11.55 from Dinton arriving at Weymouth about 4 oclock \n\nNext Morning I left by troop train for Plymouth & we travelled through Exeter The day was fine & bright & mild. On arrival at Plymouth we embarked on the \"W Carrier\" The Euripides a 15,000 ton boat belonging to the Aberdeen line She is a very fine ship. My Cabin is 130 & I share it with\n\nFather Le Maitre an R C Chaplain\n\nEarly on the morning of the","124":" we put out into the stream and there we lay for 3 days and this morning at 12 we left.\n\nI have met quite a lot of lads I know among them Bob Nelson & T. Roberts, Lt Jon Tarn & Brian Cavanagh The OC is Col Fewtrell\n\nThe weather was too bad to permit of an official parade at 10 so I went to C Troop deck & had a very nice little service.\n\nThere are 10 boats in the Convoy & an escort of Destroyers & a Cruiser Maria. So we are rather a formidable convoy. The sea is nice & calm but we are only steaming slowly\n\nI have a service at 6. Rough on the troop deck\n","125":"\n\nThis is my first entry since I left England.\n\nWith 8 vessels on Convoy & 5 or 6 destroyers & Cruisers, we left Plymouth at 12","126":" The sea was pretty lumpy for 3 days & many were sick. Regulations were very strict as regards lights & lifebelts. No lights on deck not even allowed to smoke, & Port holes closed day & night & life belts to be worn all day. We soon passed out of sight of land & saw nothing till we arrived at Sierra Leone One steamer reported\n\na submarine on port bow but it turned out to be a whale. The trip has been very pleasant, so far. We arrived at Sierra Leone n","127":" The town looks very pretty from the harbour behind it rises great hills covered in tropical vegetation We were allowed ashore for a few hours. I went. Yesterday Sat. The town is very picturesque especially for a native town & the negro love of colour is very evident in the robes & dresses of the natives They all speak English It is a town of about 30,000 & the principal industries are\n\nPalm oil, cocoa, copra, gold dust, Ivory & other tropical products.\n\nI called on a Native Wesleyan Minister: a fine educated negro, Greek & Hebrew scholar & who spoke French & English fluently His church has 700 members Joe Turn & I were together We got back to ship at 2 oclock & left port at 5 30, bound South for Capetown.\n\nLast night & today the weather was very hot. I have had a service at 10. & one at 10.45, & a communion service at 11.00 & a voluntary \n\nservice at 6 oclock.\n","128":"\n\nSince my last entry we have covered many hundreds of miles & are now in Capetown \n\nThe trip was uneventful except that a severe epidimic of Gastric Influenza broke out & about 75% of the Officers were down with it.\n\nWe had some trouble with the young lads who are being returned to Australia under age. They attempted to breach a hatch & even to attempt to take charge of things generally but they were dealt with very severely and the ringleaders punished & the rest soon\n\nsubdued & became very meek. Concerts & Sports were held on board. The weather was very warm in the tropics & with all ports closed all night it was very oppressive.\n\nWe arrived at Capetown on Thursday about 11 oclock. We went ashore at 2.30. Joe Tarn & I & Riley YMCA took a car to Grooteschurr, Cecil Rhodes house, & to his monument. It was a most enjoyable drive Then we called on some Friends & found them out, & we met a couple of our officers who had a car & invited us to go for a Ride which we did to Campa Bay on the seaside\n\nYesterday Friday. I went ashore had lunch at the Club, made a few purchases, & had tea at Mr Hodges at the parsonage Went to see Mt Timberlake in the afternoon\n\nWe have been Coaling here for two days & nights & the dust. Noise & general confusion has been most uncomfortable I shall go ashore this afternoon\n\n"}}