{"Document Name":{"0":"Diary_0169","1":"Diary_0169","2":"Diary_0169","3":"Diary_0169","4":"Diary_0169","5":"Diary_0169","6":"Diary_0169","7":"Diary_0169","8":"Diary_0169","9":"Diary_0169","10":"Diary_0169","11":"Diary_0169","12":"Diary_0169","13":"Diary_0169","14":"Diary_0169","15":"Diary_0169","16":"Diary_0169","17":"Diary_0169","18":"Diary_0169","19":"Diary_0169","20":"Diary_0169","21":"Diary_0169","22":"Diary_0169","23":"Diary_0169","24":"Diary_0169","25":"Diary_0169","26":"Diary_0169","27":"Diary_0169","28":"Diary_0169","29":"Diary_0169","30":"Diary_0169","31":"Diary_0169","32":"Diary_0169","33":"Diary_0169","34":"Diary_0169","35":"Diary_0169","36":"Diary_0169","37":"Diary_0169","38":"Diary_0169","39":"Diary_0169","40":"Diary_0169","41":"Diary_0169","42":"Diary_0169","43":"Diary_0169","44":"Diary_0169","45":"Diary_0169","46":"Diary_0169","47":"Diary_0169","48":"Diary_0169","49":"Diary_0169","50":"Diary_0169","51":"Diary_0169","52":"Diary_0169","53":"Diary_0169","54":"Diary_0169","55":"Diary_0169","56":"Diary_0169","57":"Diary_0169","58":"Diary_0169","59":"Diary_0169","60":"Diary_0169","61":"Diary_0169","62":"Diary_0169","63":"Diary_0169","64":"Diary_0169","65":"Diary_0169","66":"Diary_0169","67":"Diary_0169","68":"Diary_0169","69":"Diary_0169","70":"Diary_0169","71":"Diary_0169","72":"Diary_0169","73":"Diary_0169","74":"Diary_0169","75":"Diary_0169","76":"Diary_0169","77":"Diary_0169","78":"Diary_0169","79":"Diary_0169","80":"Diary_0169","81":"Diary_0169","82":"Diary_0169","83":"Diary_0169","84":"Diary_0169","85":"Diary_0169","86":"Diary_0169","87":"Diary_0169","88":"Diary_0169","89":"Diary_0169","90":"Diary_0169","91":"Diary_0169","92":"Diary_0169","93":"Diary_0169","94":"Diary_0169","95":"Diary_0169","96":"Diary_0169","97":"Diary_0169","98":"Diary_0169","99":"Diary_0169","100":"Diary_0169","101":"Diary_0169","102":"Diary_0169","103":"Diary_0169","104":"Diary_0169","105":"Diary_0169","106":"Diary_0169","107":"Diary_0169","108":"Diary_0169","109":"Diary_0169","110":"Diary_0169","111":"Diary_0169","112":"Diary_0169","113":"Diary_0169","114":"Diary_0169","115":"Diary_0169","116":"Diary_0169","117":"Diary_0169","118":"Diary_0169","119":"Diary_0169","120":"Diary_0169","121":"Diary_0169","122":"Diary_0169","123":"Diary_0169","124":"Diary_0169","125":"Diary_0169","126":"Diary_0169","127":"Diary_0169","128":"Diary_0169","129":"Diary_0169","130":"Diary_0169","131":"Diary_0169","132":"Diary_0169","133":"Diary_0169","134":"Diary_0169","135":"Diary_0169","136":"Diary_0169","137":"Diary_0169","138":"Diary_0169","139":"Diary_0169","140":"Diary_0169","141":"Diary_0169","142":"Diary_0169","143":"Diary_0169","144":"Diary_0169","145":"Diary_0169","146":"Diary_0169","147":"Diary_0169","148":"Diary_0169","149":"Diary_0169","150":"Diary_0169","151":"Diary_0169","152":"Diary_0169","153":"Diary_0169","154":"Diary_0169","155":"Diary_0169","156":"Diary_0169","157":"Diary_0169","158":"Diary_0169","159":"Diary_0169","160":"Diary_0169","161":"Diary_0169","162":"Diary_0169","163":"Diary_0169","164":"Diary_0169","165":"Diary_0169","166":"Diary_0169","167":"Diary_0169","168":"Diary_0169","169":"Diary_0169","170":"Diary_0169","171":"Diary_0169","172":"Diary_0169","173":"Diary_0169","174":"Diary_0169","175":"Diary_0169","176":"Diary_0169","177":"Diary_0169","178":"Diary_0169","179":"Diary_0169","180":"Diary_0169","181":"Diary_0169","182":"Diary_0169","183":"Diary_0169","184":"Diary_0169","185":"Diary_0169","186":"Diary_0169","187":"Diary_0169","188":"Diary_0169","189":"Diary_0169","190":"Diary_0169","191":"Diary_0169","192":"Diary_0169","193":"Diary_0169","194":"Diary_0169","195":"Diary_0169","196":"Diary_0169","197":"Diary_0169","198":"Diary_0169","199":"Diary_0169","200":"Diary_0169","201":"Diary_0169","202":"Diary_0169","203":"Diary_0169","204":"Diary_0169","205":"Diary_0169","206":"Diary_0169","207":"Diary_0169","208":"Diary_0169","209":"Diary_0169","210":"Diary_0169","211":"Diary_0169","212":"Diary_0169","213":"Diary_0169","214":"Diary_0169","215":"Diary_0169","216":"Diary_0169","217":"Diary_0169","218":"Diary_0169","219":"Diary_0169","220":"Diary_0169","221":"Diary_0169","222":"Diary_0169","223":"Diary_0169","224":"Diary_0169","225":"Diary_0169","226":"Diary_0169","227":"Diary_0169","228":"Diary_0169","229":"Diary_0169","230":"Diary_0169","231":"Diary_0169","232":"Diary_0169","233":"Diary_0169","234":"Diary_0169","235":"Diary_0169","236":"Diary_0169","237":"Diary_0169","238":"Diary_0169","239":"Diary_0169","240":"Diary_0169","241":"Diary_0169","242":"Diary_0169","243":"Diary_0169","244":"Diary_0169","245":"Diary_0169","246":"Diary_0169","247":"Diary_0169"},"Date":{"0":"unknown","1":730.0,"2":731.0,"3":732.0,"4":733.0,"5":734.0,"6":735.0,"7":736.0,"8":737.0,"9":738.0,"10":739.0,"11":740.0,"12":742.0,"13":743.0,"14":744.0,"15":745.0,"16":746.0,"17":747.0,"18":748.0,"19":749.0,"20":750.0,"21":751.0,"22":752.0,"23":753.0,"24":754.0,"25":755.0,"26":756.0,"27":757.0,"28":758.0,"29":786.0,"30":787.0,"31":788.0,"32":789.0,"33":796.0,"34":807.0,"35":808.0,"36":809.0,"37":810.0,"38":811.0,"39":812.0,"40":813.0,"41":815.0,"42":816.0,"43":817.0,"44":818.0,"45":828.0,"46":829.0,"47":830.0,"48":833.0,"49":834.0,"50":835.0,"51":837.0,"52":840.0,"53":841.0,"54":844.0,"55":845.0,"56":847.0,"57":848.0,"58":849.0,"59":850.0,"60":851.0,"61":852.0,"62":853.0,"63":854.0,"64":855.0,"65":856.0,"66":857.0,"67":858.0,"68":859.0,"69":860.0,"70":861.0,"71":862.0,"72":863.0,"73":864.0,"74":865.0,"75":866.0,"76":868.0,"77":869.0,"78":870.0,"79":871.0,"80":872.0,"81":873.0,"82":874.0,"83":875.0,"84":876.0,"85":877.0,"86":878.0,"87":879.0,"88":880.0,"89":881.0,"90":882.0,"91":883.0,"92":884.0,"93":885.0,"94":892.0,"95":895.0,"96":896.0,"97":897.0,"98":898.0,"99":899.0,"100":900.0,"101":901.0,"102":902.0,"103":903.0,"104":904.0,"105":905.0,"106":906.0,"107":907.0,"108":908.0,"109":909.0,"110":910.0,"111":911.0,"112":912.0,"113":913.0,"114":914.0,"115":915.0,"116":916.0,"117":917.0,"118":918.0,"119":919.0,"120":920.0,"121":921.0,"122":922.0,"123":923.0,"124":924.0,"125":925.0,"126":926.0,"127":927.0,"128":928.0,"129":930.0,"130":931.0,"131":932.0,"132":933.0,"133":934.0,"134":935.0,"135":936.0,"136":937.0,"137":938.0,"138":939.0,"139":940.0,"140":941.0,"141":942.0,"142":943.0,"143":944.0,"144":945.0,"145":946.0,"146":947.0,"147":948.0,"148":949.0,"149":951.0,"150":952.0,"151":953.0,"152":954.0,"153":955.0,"154":956.0,"155":957.0,"156":958.0,"157":959.0,"158":960.0,"159":961.0,"160":962.0,"161":963.0,"162":964.0,"163":965.0,"164":966.0,"165":967.0,"166":968.0,"167":969.0,"168":970.0,"169":971.0,"170":972.0,"171":973.0,"172":974.0,"173":975.0,"174":976.0,"175":977.0,"176":978.0,"177":979.0,"178":980.0,"179":981.0,"180":982.0,"181":983.0,"182":984.0,"183":985.0,"184":986.0,"185":987.0,"186":988.0,"187":989.0,"188":990.0,"189":991.0,"190":992.0,"191":993.0,"192":994.0,"193":995.0,"194":996.0,"195":997.0,"196":998.0,"197":999.0,"198":1002.0,"199":1003.0,"200":1004.0,"201":1005.0,"202":1006.0,"203":1007.0,"204":1008.0,"205":1009.0,"206":1010.0,"207":1017.0,"208":1019.0,"209":1020.0,"210":1021.0,"211":1027.0,"212":1034.0,"213":1035.0,"214":1036.0,"215":1037.0,"216":1038.0,"217":1039.0,"218":1040.0,"219":1041.0,"220":1042.0,"221":1043.0,"222":1044.0,"223":1045.0,"224":1046.0,"225":1047.0,"226":1048.0,"227":1049.0,"228":1053.0,"229":1055.0,"230":1056.0,"231":1057.0,"232":1058.0,"233":1059.0,"234":1060.0,"235":1062.0,"236":1063.0,"237":1064.0,"238":1065.0,"239":1066.0,"240":1067.0,"241":1068.0,"242":1070.0,"243":1072.0,"244":1073.0,"245":1074.0,"246":1075.0,"247":1076.0},"Entry":{"0":"\n\n","1":"\nA start made on new diary the same time as my second year of the great war, that is my second year, starts, and a new era is about to commence from an operation occurring to the evacuation of portions of the Peninsular a move which may have far reaching results as yet undreamt of. I am curious to know what will be Australia's opinion & the world at large. If as seems likely we have left the Turk, it is with feelings of respect and admiration for his fair, brave, & honourable fighting qualities, the more so as we did not expect them. I spent the afternoon on board the \"Swiftsure\" learning various items of news such as \"Haigh\" taking command in France, Smith-Dorrien, in East Africa, our flight in Servia, Italy, help coming through Albania etc & the commencement of the final evacuation of Anzac etc. as usual I spent a good afternoon yarning & brought away with me 100 Egytptian Cigarettes & 2 tins of tobacco.\n","2":"\nStill fine weather. Sent off a couple of pe'pes to my friend on the \"Swiftsure\". More troops arrived today & the island must hold now its greatest complement of Australians it ever has done. Rather mild excitement on the Pier today, the crowd mobbed\n\nsome Greeks who had two baskets of oranges & confiscated quite half of them. It all happened in a minute; Greeks baskets & oranges were upside down, then a moment later all was quiet & the Greek was dusting himself down & no doubt swearing his hardest. Attended church at night & had a good sing song of hymns. Gambling is very rife at present, two-up schools etc running strong bets of £10 £20 £30 & upwards being common.\n","3":"\n\nTried to get a boat in order to see the No. 1 A.S.H. crowd but could not manage it so spent the afternoon on the Pier yarning. I had a letter to deliver to their O.C. concerning my transfer. It read thus – I am loathe to 'lose Pte Gissing unless 'tis very necessary so that until you are able to promote him to Staff Sergeant at once I cannot agree to a transfer being made. The letter was posted as I could not deliver it. Turned in early but was disturbed somewhat owning to several tent mates getting drunk & making things disagreeable.\n","4":"\nHeavy dust storm during the night succeeded by heavy rain about 10 oclock in the morning.\n\nThen we had mud for the remainder of the day. The weather was too rough so did not go aboard the Swiftsure as I intended. Nights now are very long & dreary & take some 'putting in'. All troops now off Anzac, the evacuation having been very successful no casualties taking pace. A certain amount of stores had to be destroyed but the whole affair was splendidly managed & favoured by good weather was a great success.\n\nWednesday 22nd\nCold & dreary. The great event of the day was the arrival of our long lost mail, 22 bags in all out of which I received 19 letters and four papers. One letter was dated","5":" having taken 7 months to reach me. I spent the afternoon & night reading my letters.\n","6":"\nSudden news came at midday to clean out the Hospital & pack up ready to leave at an hours notice. This was good news & we were all cheered with the prospect of new oceans & fresh pastures. Most of the patients were sent off to their units the remainder being sent off to No. 3 A.G.H. They were all sorry to leave as they received first class treatment, best food & plenty of it, tinned fruit, biscuits tobacco cigarettes etc all of the best.\n","7":"\nBusy pulling down tents & packing up. We received a splendid issue of stuff. An Xmas billly & pudding between two men, also tinned fruit milk etc, more than we could eat. Received a visit from some friends & after tea visited their camp. About 9 oclock we had a supper of cake, beers wine champaygnes & Brandy the latter I donated for which act the company sang \"For he's a jolly good fellow etc\". Although the drinks were much mixed we had a real good evening with sing song speeches etc. We also received an issue of Red X goods, a mixed lot for which we \nrecei\n drew by ballot. The excitement & pleasure attached to opening our billies was worth seeing. Shrieks of laughter & cheering could be heard from all sides & the reading of enclosed letters caused great sport. I \"tossed up\" with a friend for my letter & lost. The contents of the billies was varied but useful & ranged from tobacco to pins. Pencils, paper, lollies, cigarettes, laces, knifes, mouth organs & so on. The puddings were splendid & proved a treat indeed.\n\nA second issue of food stuff to us consisted of tinned fruit, milk\n\n& biscuits as extras. I tremble for my digestion until after these festivities. Many of the troops have already left & we expect to move off any day.\n","8":"\nNo parades so had a very easy day. The other troops had a Church parade so I went along to it & took a few photos. A couple of Generals were present & they had a march past after the service & the men looked splendid. Having plenty of good things to eat I had a good time in this respect. The rest of the day I spent writing letters. After tea I decided to walk round to the Hospitals for something to do & dropped into a concert given by some Royal Engineers. It was rather good & as soon as I showed myself one of the Tommies handed me his mug of toddy & insisted on me drinking it as he had spent some time in Sydney. I returned to camp about 11.30 after spending a very respectable Christmas.\n","9":"\nAttended church parade in morning & did some letter writing & then had a stroll round. The gift people wanted an account of how we received gift stuff so I sent the following\n\"Christmas week at hand and\n\nalready we have received various gifts but rumours are afloat concerning how & when we will receive our long looked for Billies. The undertaking to supply us all with a billy each seemed so novel & generous that the subject was a constant topic of conversation. However one morning strange looking cases arrived & whispers went round 'our Billies have arrived & then the great & burning question was – will they be issued tonight or tomorrow. Opinion was evenly divided on this great subject but \"tonight\" won shortly after the order \"Fall in\" was blown & there was no need to add \"At the double\". The mail call was never answered quicker. Then we received the long looked for billy, our first impression being a happy one by seeing the picture of a Kangaroo \"dealing out\" something severe to a Turk with the homelike expression of \"This bit of the world belongs to us. We then trooped back to our tents resolved on immediately exploring the contents. No child ever enjoyed a Christmas stocking more than I did my good old \nChristmas stocking\n Australian Billy. Daintly packed reflecting great forethought & care on the part of fair packers were valuables of all descriptions. All tastes were catered for and as each man came upon something especially pleasing he would\n\nhold it up for his mates inspection. Shrieks of laughter & cheering was heard on all sides & then the enclosed letters were literally pounced upon & devoured. There were notes compared & as our excitement cooled down, remarks such as – my word they treat us like Kings, They are absolutely the last word in generosity & goodness, of course interspersed with such true Australian terms as Bosca & Dabster. Some of us had to shift camp but to every mans pack hung the now familiar sight of a Khake Billy. No gift could have been more appropriate or more pleasing or have the effect of more truly uniting our hearts in the spirit to those of our kith & kin in far off Australia. Of course we received other gifts such as puddings & general comforts all of which are greatly appreciated & although many thousands of miles from our homes they constitute that personal touch making of our treat Continent one large family.\n\nToday congratulations were read out to us from general Westin who described the evacuation of Anzac & Suvla as a feat unparalleled in military history & no doubt it was a great bit of work. Telegrams from the King & parliament were\n\nalso read out.\n","10":"\nNothing doing, just standing by awaiting orders. At night walked round to the Hospital to post some mail & see some newspapers. Coming back it was very dark & the recent rains having made some swamps into one of which I had the misfortune to wander. I escaped however without more harm than a fair sprinkling of mud.\n","11":"\n\nGeneral routine once more resumed. Physical drill before breakfast, route march after, ditto Wednesday.\n","12":"\nOrders came to send our gear to the jetty in readiness to move off. This we completed during the morning. In the afternoon went across to the Hospital to take a few snaps & exchange a tunic for one which fitted me.\n\nAlso had a hair cut. On guard at night.\n","13":"\nNew Years Eve\nOn guard & had a prisoner to escort before the Colonel. Went through my kit again in order to lighten it but did not manage to throw much out as it was all valuable, weather beautiful & sunny. Concert at night in 2nd Brigade lines which was rather good & helpful to pass the time as\n\nno one intended to sleep until the New Year. All supplies of liquor seemed to have been exhausted so it was of necessity a very dry welcome to the New Year. At midnight the ships made a tremendous noise with their sirens, steam whistles & bells and quite drowned the playing of the band. Then different gangs paraded the camp beating tin cans etc but the area over which they could travel was restricted owning to pools of mud & trenches which could not be seen in the dark. Rockets were sent up & then \"lights out\" went & we all turned in.\n","14":"\nA beautiful day at first but rain set in & soon the whole camp was a sea of mud & as the soil was very clayey it clung to the boots & made walking very difficult. We had no parades during the day.\n","15":"\nWe were given orders to move off so all was hustle once more & we were ready to move off at 9 AM. However we marched off at 10 AM but did not get in the boat till about 3.30 PM. We managed to strike a fine vessel the \"Empress of Britain\" which has accomodation for\n\n109 officers 40 W.O's. & 4050 troops. She also carried a 6 inch gun astern.\n","16":"\nRather bleak day. Still lying in the harbour taking on more troops. Had a splendid view of one of our latest submarines, she coming alongside to discharge an officer. I seized the opportunity to take a few snapshots. Had two parades, one for inspection the other for lifebelts. Strict discipline is going to be enforced concerning lights out, smoking etc.\n","17":"\nSailed about 8 A.M. with about 4500 troops some having to live on deck. Orders read out concerning discipline. No smoking tween decks, no smoking or lights allowed after 5. P.M. Everyman to carry a lifebelt with him no matter where he goes & sleep with it under the pillow. We were all appointed to stations in case of alarm. Reveille 5.30 A.M. Lights out 8.30 P.M. Numerous machine guns are stationed at different points & we are steering a zig zag course should we however strike trouble the consequences will be serious as the passages are painfully narrow & all watertight doors & bulkheads being closed the number of exits\n\nare totally inadequate for the number of men. Did duty in the dispensary.\n","18":"\nStill safe & nearing Alexandria had a day of rest. & also a tip top bath & a clean change & then washed things I took off. A very pleasant voyage so far. Am getting very keen about meeting Morris & Will D. It will be to me the event of the year.\n","19":" &","20":"\nSighted Alexandria at daylight. Sea rather rough so much so that we could not take the pilot aboard. So after much manoeuvring we followed him in, followed in by the old \"Southland.\" The trip was very enjoyable, we have good quarters & food.\nAt first we anchored near the Entrance going alongside the wharf about 5.30 P.M. By 7 P.M. we were aboard a train & on our way. Our destination turning out to be Tel El Kebir. Cattle trucks together with ordinary 3rd class carriages were provided for us & much amusement was caused by the men on the trucks bleating like sheep or cows. We reached Tel el Kebir about 2 oclock A.M. & then camped\n\non a vacant plot till daylight. Myself & a friend put up a covering by laying a waterproof sheet over some guy ropes near as protection from the dew & then slept till daylight. After breakfast we moved off to our permanent spot & our gear having arrived immediately pitched 9 marquees & several other tents, a real good days work. Altogether our trip from Lemnos was splendidly managed & worked without a hitch throughout which is unfortunately an exception. I met friends of the 1st Stationary but did not have much time to have a yarn.\n\nThe Camp is a splendid one, water laid on etc & everything points to better management than formerly. The horses of A.S.C. & artillery are in splendid nick & the men all look well & bright.\n","21":"\nReceived a ripping mail consisting of 28 letters & dozens of papers. Some fellows received our 40 letters & I also received a Christmas Cake which was O.K. More tents were pitched & now we are ready to act as a Field Hospital for as long as we\n\nremain here. One great thing about being here is the issue of fresh vegetables which after being almost a year without are doubly welcome. Acted as mess orderly & general fatigues during the day. Did dispensing on the boat coming over\n","22":"\nHaving had a severe pain in my right side ever since I left Lemnos which had given me three sleepless nights & which looked very like pleurisy I decided to break my record & go on sick parade. The M.O. gave me a thorough sounding but found nothing wrong which left no doubt but that it was a muscular trouble & probably a strain through carrying the heavy tents & gear. That relieved my mind & I have only to wait for time to affect a cure. Went to church parade but struck a very poor chaplain. It was a lovely day one of the best & I spent the most of the time reading my mail & answering the letters. Start dispensing duties tomorrow.\n","23":"\nHad a terrible night Rheumatic pains all over but with the help of aspirin I managed to get to\n\nsleep towards morning. Went on duty in dispensary & also sick parade altho' I now knew more what the trouble was, first a strain & getting a cold on top of it through the draughty train. Managed to keep going all day although marked L.D. & in the afternoon strolled out to see the trenches or embankments used in the battle of Tel el Kebir 1882. They still stand & are mounds of sand about 7 ft high in front & 10 ft behind. More later about this scrap.\n","24":" '16\nHad an off day Wednesday & Thursday nothing much doing only I felt very off colour & unable to work. Violent headaches & severe pain in lung. I decided to hang out as long as possible. Went from duty.\n","25":" ","26":"\n","27":"\nIn the dispensary but had a very off day indeed.\n","28":"\nWent sick & was immediately sent into hospital with pleurisy.\n\nWritten up","29":"","30":"\nWas carried away to the No 1 Clearing Hospital & from thence the same day by Hospital Train to Cairo & so to Shezirch Hospital arriving about 7. P.M.\n\nfeeling particularly rotten. I was washed by an orderly & found myself between white sheets & on a spring mattress the first for over a year. Was examined by a doctor & so left till morning. For over a week I could not move without bringing on a fit of coughing & sitting up was impossible. Then I began to improve but my temperature which reached 104.6 would not come normal & so I spent 3 weeks in bed. The attention given by nurses & orderlies was splendid & I lost my great dread of ever being in hospital. The food was also good, chicken ad. lib. & quite a number of delicacies.\n\nDuring this time my mail came along very well & I was visited by several friends Will & M.D. coming to see my very often. My word it was a welcome sight to see them both, 10 months since I saw Will & 12 months Morris. Then I managed to get leave, going to Zeilorin one afternoon, Races another & a trip down the muski & bazaars with Will where I expended some cash in tapestry – long & keen was the\n\nargument & bartering before he came down to my price, being 2\/3 of what he asked at first. Another afternoon was spent at the zoo. My first trip into Cairo from the hospital was a notable one being after an absence of 10 months & the stink of the gippies etc was most noticeable. I soon became accustomed to it however.\n\nOn the","31":" I was discharged & sent to the Montazah Convalescent Hospital in Alexandria. Formerly it was the residence of the El(?) Khedive being several buildings standing in a few hundred acres on the shores of the Mediterranean 9 miles from Alexa. The grounds are well laid out being planted with pine, eucalyptus, fruit trees etc a harbour formed by a breakwall, boat house etc, the whole being an ideal place for the purpose. Food is plentiful & good the catering being paid for at the rate of","32":" per head. On the","33":" myself & another obtained leave to go to Alexandria where I had a very good time sightseeing & Garry rides, music Hall & a good café & the making of a few purchases, filling in the day.\n\nI am perfectly well again bar not being quite so strong & having lost a fair amount of flesh.\n","34":"\nTomorrow I leave for Base details so once more I am going out into the world. The last few days have been as usual bar a little excitement one night when all lights had to be put out owing to the approach of some air craft but nothing more was heard of the matter. Yesterday I had my first swim of the season & found the water rather nippy.\n","35":"\n\nLeft Montazah about 9.30 and changed at Sidi Gabar a few miles out of Alexandria. We then proceeded to the barracks where we obtained a warrant for our tickets. The place was alive with soldiers all Englishmen. It was here the battle of Alexandria was fought & Sir Ralph Abercrombie was killed a monument being erected at the spot where he received his mortal wound. We arrived at Cairo about 3.30 & at overseas Base detail camp an hour later. The contrast between my late surroundings & my new was\n\ngreat, the camp being dirty, dusty & overcrowded.\n","36":"\nWas paraded before the doctor & marked fit for duty. During the afternoon I went into Cairo meeting there a friend with whom I did the sights. We went into a Music hall which had peculiar features from our point of view. The Artists mix with the audience while not performing. We first entered a lounge room where one of the beauties joined us & we had a drink together. We then moved into the hall. There is no entrance charged and all drinks cost P.T. 5 & the duty of the females appears to be to keep the audience drinking. Thus the more drinks means more profit. The show itself was fair, but it was the type of place in which young fellows go astray, any one of the girls there would see to that if given the chance. During the afternoon I posted home two shell caps one of which fitted the case I posted from 'Montazah'.\n","37":"\nHad orders to parade at 7.30 with full kit ready to move off. Practically the whole camp shifted & we were all taken to Tel-el-Kebir. We\n\nmarched to the railway & there boarded open trucks. Passing through Cairo station we were proceeding so slowly that several fellows jumped off & chased some gippy street sellers robbing all they could catch of their goods. One of them clung to the Australian and only let go when another jumped off & punched the poor beggar. This exhibition was repeated at Zay a Zig about 50 jumping off & chasing the gippies stealing chocolate, cigarettes oranges etc injuring one of them in the rush. In our forces there appear to be a fair number who will proceed to any excess, when backed up by a sufficient following to ensure them not getting hurt. We reached Tel-el-Kebir after four hours of the trucks & where divided up & sent to our various units. Owing to a reorganisation scheme I was transferred to the 14th Field Ambulance then forming up. They had taken one section from the 1st & one from the","38":" & formed the new ambulance. No sooner had I arrived several chaps told me to apply at once for a vacancy as dispenser to B. Section. This I did as I was told of at least one application\n\nalready in.\n","39":"\n\nIn camp once more & as things are very easy, nothing much to do, everyone is very comfortable.\n","40":"\nHad leave and went to Cairo. Spent £3. on things to send home & also sent away some photos etc. Then I ran out to Zeilorin to see Will D. Managed to pick up some mail from him & met some fellows I had left in Sydney. Also met a man off the \"Ceramic\". Altogether a good day. On duty for remainder of week in dispensary, it being practically assured that I get the appointment.\n","41":"\nHad rather a bombshell arrive in camp today. It appears that a staff sergeant who has been 7 months in England has just been sent back & his unit the","42":" Field Amb. refused to receive him whereupon the A.D.M.S. sent him to fill the position I had applied for, rather a bump & the fellows are indignant that such a man & an outsider should get one of our good positions. Personally I am disappointed but having received more than one\n\ndisappointment in the army will be able to stand this one.\n","43":"\nHad leave & went to Cairo. I went straight out to see Will D. & we spent the day together. Tram rides viewing the place, stroll through gardens etc. I managed to see a section of the populace not seen in the city itself. Spent a very decent quiet day.\n","44":"\n\nStarted on helping to build a cook house. Have joined myself to the Carpenters squad two of us & the work is to build mess huts etc, anything for a change. Was inoculated during the afternoon for para-typhoid which took effect immediately & rather spoilt my night's rest. Weather warm, cool nights.\n","45":"\nHaving quite got out of the habit of writing diary up daily I find great difficulty in remembering it but from this out will attempt to do so. The weather has now changed to very hot & the flies are becoming very troublesome our only peace being after dark when the beggars apparently go to sleep. My work during the last fortnight has consisted of working on the mess hut & building a mud wall etc using quite\n\nthe government stroke. I then applied for 48 hours leave & was astonished to find it granted as several had been refused. It dated from 7 PM on the","46":" I caught the night train & went to Port Said. Just on midnight I arrived & went along to the Continental Hotel to spend the night but I was much riled on being asked for my money. This I refused to pay on principle until the morning & had to flare up at the coot before he was satisfied. Do you insult me, I roared, no, no Sir the morning will do he replied. Breakfast next morning was a most enjoyable affair after Camp life after which I strolled up the main street & along the breakwater. This is quite a big affair and a huge statue of De Lesseps stands imposing & points to the Canal entrance. Then I engaged a garry driver for an hour 2\/- & drove all round the place a big proportion of the town being Arab. The remainder of day I spent doing the curio shops, the majority of which sell Japanese goods! Egyptian being very scarce & expensive although the shops on the whole are cheaper than either Cairo or Alexandria. My purchases\n\nconsisted chiefly of 2 vases, Damascus work of silver & copper in brass & were good examples of this work. After visiting various cafes, listening to street performers & so on, I wended my way to the station for the 6.30 train. Here a young gippy youngster about 6 years old surprised me by calling out – you Australian to which I replied – No. O you Scotchman Harry Lauder from Dublin he replied with a grin. These youngsters are wonders in picking up things in more ways than one, language & thieving. I then went to \"Ismailia\" in order to visit the No. 1. A.S.H. who received me as an old friend & put me up in the Sergeants quarters. I was taken to the pictures but they were a medium lot. The next day I spent yarning & looking around the place which is very pretty & was fortunate in that the Prince of Wales chose the same day to visit the Hospital so that I had a unique chance of viewing him. He struck me as being very decent, shy & reserved & conscious of his position. His walk is execrable & reminded me of an old man walking flat footed through a plouged field. Cameras were\n\nmuch in evidence & at one time I counted twenty in a row, altogether there must have been forty, some fellows even on the roof, some lurking in the hedges, round corners, out of windows etc. anywhere for a snap. General Birdwood who was with the Prince did all the talking being indispensable to such a visit. On returning to camp I found orders had been received to prepare for a march to Ismailia about 30 miles or so & the next few days were spent on practice marches fixing up kit etc. We were also supplied with khaki drill clothing Helmets etc also web equipment. A certain amount of training has been going on, trench digging bomb throwing & artillery firing. One day I went out to watch their practice which was very good. The 1st &","47":" Divisions have already gone & perhaps we also will shortly move off, the sooner the better. Rumours are rife concerning boats being torpedoed with our troops aboard but so far nothing is official one I believe is right the \"Minneapolis\" which during the Gallipoli stunt was known as A.41.\n","48":"\n\nOn guard","49":" &2-6 guarding the water tap. Quite a heat wave for the last 3 days & the men marching from Tel-el-Kebir to Ismailia will feel it a good deal.\n","50":"\n\nWe had a try out over the desert with full packs up doing about 8 or 9 miles. The going was firm & pleasant so experienced no difficulty except a severe dust storm which sprang up & quite shut out everything further than 10 yds from us. The following day was spent packing up loading wagons & in general preparing for our departure the following morning. At night I went along to a visiting circus & thoroughly enjoyed the show. It was much as others but some child performers were wonderful riding horses standing up etc one was aged about 3 & the other 5 & it was really cruel to have them showing, tumbling, clown acts etc completed a very fair bill.\n","51":"\nReveille 3 A.M. in order to get a start on our grand trek to Ferry post the other side of the\n\ncanal a distance of about 35 to 40 miles. We had heard bad reports of those who had gone before us which reports stated six had died owing to the severity of the march but it was denied officially later. We had made our packs as light as possible, camels being provided to carry our pack bags (kits) & blankets. The loading of these was a new experience to us, especially in the dark when they looked double the \nsight\n size in the half light. Several times the beggars stood up before we were prepared & one fellow who was leaning over the back of one had a nasty throw. We soon became accustomed to them however, using the same hissing kind of command for them to kneel down as used by their attendants. We all kept clear of their heads as they are beggars to bite. By 5.30 A.M. we were ready to march off but had to wait for the pioneer Battalion. At 6 AM we marched off through the desert passing the trenches which were used in the battle of Tel-el-Kebir 1882. 'Tis remarkable how they last. In every hour we took 10 minutes spell & had not gone far when\n\nmen began to drop out & be picked up by our ambulance wagons of which we had four as well as 6 G.S. waggons with our stores. The going was mostly good except for soft places here and there. At 12 midday we came onto the railway at \"Mahsamah' Station & pitched camp for the day. Our cooks had been sent on ahead by train so our dinner was waiting for us & proved very welcome. I felt tired but managed to get enough water for my feet, had a shave & wash & then had a rest under a waggon where I put in the night. Up again at 3 AM loaded the camels etc & were ready to move off at 5 A.M. This time I was told off to go with the transport. Within half a mile of our camp we had to cross the railway & this was a perilous undertaking. The line was on an embankment & the rail stood quite 6 inches above the ground. In addition quite a gulley had to be passed before reaching the line & it also meant a sharp right turn when crossing the rails. However we essayed the task but the first Ambulance waggon nearly\n\ncame to grief. By misjudging by a few inches it became bogged in the corse sand & nearly toppled over down the embankment. About 30 of us managed to help it clear. Then one by one they came galloping all out. First charging down a slope, then up the embankment, then a turn at almost right angles over the rails. When the wheels struck the rails the sparks flew & the waggons shot up into the air like a rocket. The G.S. waggons were the most exciting as they were loaded & at the bump, stores flew in all directions. Altogether it was good sport & caused great amusement amongst the boys & showed up our transport as good horsemen. The rest of the journey was along the canal & the road proved fearfully trying to the horses & men. The sand was soft & the waggons sank right into it. At last we had to do a stage & then bring back leaders to bring up the remainder. When 3 miles from our destination about 5 oclock our O.C. decided to camp for the night. Horses were fed & watered & by means of a primus stove myself & pal had a splendid\n\ntea adding curry & onions to a tin of rabbit. Next morning up at 4 A.M. & loaded all our gear on a barge hired by the O.C. for the remainder of journey & we continued on our way to Moaska. Even with empty waggons we had great difficulty in getting through reaching our destination at 8 A.M. where we had breakfast. We then proceeded through the New Zealand camp, through Ismailia picking up our gear off the barge once more & then proceeded over the Santoon bridge over the canal to Ferry post. Crossing over in an ambulance waggon the horses became unmanageable & nearly toppled us in the canal. Luckily it happened at the end & did no other damage bar smashing the railing & 5 minutes work under the supervision of a naval lieutenant placed the waggon on the road again & we proceeded on our way. The distance done on the second day was 15 miles which left about 8 or 10 to finish one trip. I finished up feeling splendid for which fact I was very pleased as it showed that my recent sickness had left no ill effects. A\n\nfair number of men had to drop out especially the second day mostly from blistered feet. After dinner we pitched our tents being well satisfied to turn in at night.\n","52":"\nUp at 6.30 & pitched 3 & a bell tent. During the morning we packed all stores into the Q.M.'s tent & were then told we had to move camp at 1.30 P.M. whereat we were rather wrath as all our hard work had been wasted. All the afternoon we worked hard shifting camp & by tea time had things shipshape once more. Once again went to bed very tired. We always seem to be cursed with a terrible lot of baggage tents etc which made our removals very hard work.\n","53":"\nAnniversary of our sailing for the Dardanelles. Spent the morning digging pits in the sand, fairly hard work. In the afternoon they gave us a spell & at 3.30 marched us to the canal about a mile for a swim which was very welcome. Weather fairly good & nights still cold. Our camp is at\n\nFerry post & how soon we move off we don't know, the sooner the better as there are much better camps than this one\n","54":"\nLast 3 days the same. Digging pits & sandbagging them to prevent sides caving in. Owing to striking shale & lime stone the work was fairly difficult but I find no difficulty in keeping going all the time. Reveille is now at 5.30 A.M. Start on pits at 6 AM. till 7. Breakfast 7.30 parade 9 A.M. when we once more start on pits till 12. Afternoon mostly free with a bathing parade in the Canal. It is an ideal spot for swimming about 120 yards wide & the water very clean. Large ships pass regularly day & night & look very majestic passing slowly down the narrow channel. Tis a wonderfully busy scene, in addition to the pontoon bridge which is used whenever ships are not passing, two punts are used for the cross traffic & are packed from morn till night. Motors of all descriptions, waggons, horses, camels, are passing to & fro & the light railway makes several trips out to the trenches.\n\nAltogether Ferry post is a wonderfully busy spot a perfect hive of industry.\n","55":"\nMore pit digging before breakfast. Attended church parade during the morning. In the afternoon we had a game of cricket but the sun is too hot for play so strenuous.\n\nMonday10th\nSpent the day assisting dentist as he was short handed. Only made a few fillings and did some clerical work.\n","56":"\nMore pit digging in morning & swim in afternoon.\n","57":"\nOn guard for the day. At night a strong wind storm blew up with a little rain & all hands were into securing the tents several of which collapsed.\n","58":"\nA lull in the morning during which time I took on bricklaying & built a range & chimney for the cooks. The wind blew up again about 10 A.M. & continued all day. It was a perfect sirocco & one of the most severe I have experienced, quite equally anything we had met the year before. Some of the gusts are extremely strong & sand is blown\n\nup, quite obscuring the sun & painfully stinging the face & hands at times & impossible to see a dozen paces ahead & tis no better in our tents where a film of dust covers everything. They are known locally as \"Campsheen\" which means 50., signifying a space of 50 days during which these winds are liable to occur. Luckily the weather afterwards is invariably pleasant.\n","59":"\nWorking on the cookhouse range the campsheen still continuing making things very unpleasant. Quite a cool change but nevertheless I had a dip in the canal. Not feeling too good inside.\n","60":"\nMore brickwork during morning still getting up early reveille 5 oclock but we have the afternoon free. Feeling very off colour.\n","61":"\n\nAttended church parade & then Holy Communion at 10.30 A.M. These services are mostly held in some obscure place & are difficult to locate thus not giving\n\na great deal of encouragement to anyone not very keen. Spent a bad night with abdominal pains. What I have is a touch of sand colic a very painful time & is the result of the campsheen of a few days ago. Ribbons are about to be issued for those who have seen service at Anzac.\n","62":"\nMy 28th birthday & spent in Egypt my last being spent in Lemnos. Nothing doing during the day as we ran out of cement & I could not carry on. Saw the Prince of Wales again going out with the camel corps. Owing to an officer being allowed to photograph him I seized the opportunity & did likewise. He was looking particularly well &happy & was good to look upon. Had a good swim during the afternoon.\n","63":"\nHad some general drill during the morning also a lecture on saluting & general conduct as complaints had been made. The medical & general report on our march was also read out with recommendations to follow on future occasions. They seemed to be very fair & sensible. On 2. m's fatigue during afternoon & found\n\ntime also to have a swim. The weather was very chilly in comparison to last few days.\n","64":"\nA cool change as cement had arrived I completed the cookhouse range & was glad to get it finished. Usual swim during afternoon although 'twas rather cool.\n","65":"\nOn guard but managed to have my usual swims. Held a few tests for the men who wished to enter for Anzac sports.\n","66":"\nChurch parade in morning. Had a letter from Morris written in France this being my first authentic information that our men are there. Usual swim.\n\nSaturday 22nd\nOn 2. m's fatigue went down for a practice swim & was timed for swimming 33 yds with manacled hands in 25 seconds. How this time compares with what it should be I don't know but will probably know more about it if I enter the race on Tuesday Anzac Day.\n","67":"\nWent on leave to Ismaila. Borrowed the despatch riders bike & rode in which saved a long walk & enabled me to ride all around & view the place. Had tea with the 1st A.S.H. & saw all the old fellows. Riding back in the dark without\n\na light was rather exciting. A large number of men were on foot & searchlights from ships on the canal blinded my eyes. There were three of us on bikes & a smart pace was kept up all the way. Personally I expected a spill any moment but eventually arrived in safety. Three ships passed up the Canal with there huge search lights lighting up the scene. After the first one passed there was a strong smell of apples in the air reminiscent of home. The third ship contained Australian reinforcements & loud & many were the crys for information, who are you etc. cooees & catcalls from all sides.\n","68":"\nJust 12 months today when we sailed out of Lemnos to lie in wait for night in order to make the Gallipoli landing. Had a full dress parade this morning in preparation for an inspection by the G.O.C. of the division. This came off during the afternoon & the unit was complimented on the turn out. At 4 oclock I was called up for guard over two prisoners (deserters) who had just been arrested. If the blighters had attempted to escape they would have bumped trouble as they caused us much inconvenience. My night shift started after midnight at 10 to\n\n1 A.M. but the night was a mild one so it was not too bad.\n","69":"\n\n1st Anniversary of landing at Gallipoli\nKept up as a holiday. Church service held in the morning, the address being an exhortation to the new men to keep fit & emulate the deeds of the 1st Division. Ribbons were issued for the Anzacs to wear. Red for those at the landing & blue for those who landed after. The combined colours were rare & personally I felt very proud to be able to show both ribbons during the day. Then during the afternoon aquatic sports were held, swimming races, diving etc. & some good talent came to light. I entered in the manacle race (hands tied together) & came third. The race was very exhausting, especially as I swam on my chest thinking it was compulsory. The place getters both swam on their backs but I was only beaten for","70":" place by inches. Three prizes were promised and at the distribution of prizes during the evening my name was called but then the announcer corrected himself & said the third prize had been struck out. Why this had been done I do\n\nnot know as there was a large entry for the race & it was a very severe race & the times were good. It proved a disappointment but it was no good kicking about it. The brigade concert at night was a first class one & was a fitting end to a good day.\n","71":"\nVery hot day, quite our hottest. The night did not bring its usual cool change & it turned out to be the hottest night I have yet experienced. Had a very quite day.\n","72":"\nGeneral drill out on the desert, the officers brushing up their drill at our expense. Inspection of camp during afternoon. On guard for 24 hours commencing at 6 P.M. My first shift 10 P.M till 2 A.M. & two prisoners to watch, strafe the beggars, I won't be sorry when they are sentenced & sent off.\n","73":"\nStill on guard & feeling very tired as the weather is hot one of the worst guards I have yet done. More mail in & a letter from France, Will D. giving me our first authentic news of my late unit being in France.\n","74":"\nDrill on the desert after breakfast & physical drill before. Afternoon free so had a dip. Went on leave at 7.30 for Suez.\n","75":"\nAt Suez. Caught the 9.30 P.M. Saturday night for Suez in company with Staff Ramsay of the 1st A.S.H. Through being asleep we were carried on to Port Tewfik & had some difficulty in finding a bed for the night. Hotel Sinai proved full so we found quarters at the Savoy a third rate show charging 20 P.T. for bed & P.T. 8 for breakfast. We hired a lorry & drove to Suez where I had to locate the grave of a young chap named Jones who died & was buried there. This done we did the town, a very poor sort of place so returned to Port Tewfik for the afternoon a place of principally European quarters. Arrived back at Ismailia about 8.30 P.M. & camp an hour later. Managed to take several photos of different things.\n","76":"\nMarched out into the desert & had company drill which was heartbreaking. The new officers did not know their work & the reinforcements where not much better so 'twas very disheartening. Lecture on first aid during the afternoon.\n","77":" ay.\nMore drill on the sands a couple of the officers appearing ridiculous trying to drill us. One in\n\nparticular was pitiful & had to give it up in despair.\n","78":"\nNew order of drill. Called at 4 A.M. & B. section marched off. We started at 6.20 A.M. & marched out to the desert for drill finishing up with stretcher drill. Have been recommended for Staff Sergeant dispenser to the new section. During afternoon had a lecture in physiology for which I was the model standing up without the proverbial figleaf.\n","79":"\nReveille 5 A.M. marching, company drill & stretcher drill on the desert. Half holiday during afternoon. General Townshend surrender now made public a great pity that such a thing should be possible. General rumours of something doing very shortly.\n","80":"\nA very hot day. The drills on the desert being rather severe finishing up with stretcher drill on the wagons. Lecture during afternoon. Orders out for divisional manoeuvres & we start 4 A.M. in the morning.\n","81":"\nReveille 4 A.M. parade 5.30 after breakfast. Full marching order for divisional manoeuvres. The plan was to advance & attack a force of Turks 6000 strong 12 miles off. We set off & deployed to the attack\n\nafter going about 4 or 5 miles. After the infantry advanced we set off in stretcher squads being led by one of our Captains who promptly led us to a flank away from everyone. We then discovered that the engagement was over so we returned after plugging though deep sand for about 3 miles. No wounded were seen although I believe the other ambulance came across a number. Returned to camp about midday. Nothing doing during afternoon. We had camel & mule carts with which to carry wounded practically a desert equipment.\n","82":"\nVery hot day. Nothing doing bar church parade in morning, swimming during afternoon. Went on guard 6 P.M.\n","83":"\nOn guard & as the weather was very hot it was the reverse of being a pleasant duty. 2 hours on & 4 off were the shifts.\n","84":"\nReveille 5 A.M. breakfast 5.30. fell in 6.15 drill on desert till 10.15. Very strenuous. Received a mail of 13 old letters from Post Office which had collected during my term in hospital. Very hot day.\n","85":"\nSame routine\n\nas yesterday. Drill & company work stretcher drill, loading of wagons adlib almost to heart breaking point as all done in deep sand & sun very hot. Saw a good exhibition of buck jumping in fact these are being quite common as a lot of new mules have arrived. Usual swim during afternoon.\n","86":"\nThe same drill as before only we set off with full packs up & did a march across the sand. Half holiday during afternoon. At night we were warned of a projected attack on the enemy for which we had to start off at midnight. Lights out at 8.30 P.M in official language 20.30. The Colonel gave us an outline of the operation as a help as all would be conducted under cover of darkness no lights, smoking, or talking allowed. Pass word \"Anzac\"\n","87":"\nReveille at midnight. Tea & biscuits at 12.15. March off at 12.30. No lights allowed, strict silence enforced, no smoking. We were in good time & took our place in the column advancing to the attack. At a point about 4 miles away we left the road & formed\n\nup at a place of assembly from where the final move took place. The infantry then deployed & as darkness still enveloped us we kept in touch with each other by means of men acting as connecting files. I was one of these keeping in touch with our transport. Our ways was though deep sand up & down slopes until we had the order to lie down. As we waited the dawn crept up, the attack was delivered & shortly after we were marching back to breakfast which we had at 8. A.M. all ranks were out, the whole division being employed & so far as I could see with excellent results, no units getting lost or astray in the dark. We were spelled during the morning but had to pack up & strike camp during the afternoon, in order to march out to Railhead in the morning. I was sent into Ismailia to obtain a motor Bike but after walking about 5 or 6 miles was unsuccessful owing to a superabundance of Red tape, one mans signature being absence. Arrived back in camp about 6 P.M. Had a\n\nsnack for tea then had to turn to & load camels waggons etc, pack blankets & kit bags. Slept that night in one of the waggons.\n","88":"\nReveille at 2 A.M. Had a cup of tea then finished loading camels waggons etc but were late in moving off owing to same bad management. Marched out of camp about 4.30 for railhead, due east into the desert about 8 or 9 miles being the end of the railway. Here we relieved the 8th Field Amb. who straight way marched to Ferry post to take over our quarters. The day was extremely hot & one wonders how much longer we will be kept on the desert. Late in the afternoon we had to erect two large marquees for a batch of 70 patients from the trenches. A very irritating part of our business is the incompetence & cras ignorance of most of our \"officers\". One in particular when we arrived here made us a perfect laughing stock with the infantry by the insane orders he issued. Tis not much encouragement to the men to learn their work when the officers will not learn how to give the most\n\nRail Head Camp\nelementary orders correctly.\n","89":"\nReveille at 5 A.M. Roll call & breakfast at 6 A.M. then more marquees to erect. The mens tents had to be shifted & camp generally straightened. Then the men's mess hut had to be finished, in fact it looks as if we will have plenty of work while we remain in this Godforsaken country. 'Tis a country at this time of year only fit for camels & niggers. All posts stations etc are named after Australian places & we have Albury hill Duntroon, Katoomba Kembla etc. etc.\n\nMonday 15th May\nWent into Ismailia by waggon in order to get a motor bike but was unsuccessful. First I went to the D.A.D.O.S. office to get the recq. signed then to the M.T. A.S.C. stores in order to get the bike but they refused delivery owing to not having sufficient authority. This meant my returning to A.D.T. G.H.Q. but decided to have dinner first. We proceeded into the town & after sampling some delicious beer right off the ice had a good meal of Fish & potatoes. Next we sent off a cablegram from the station & I went to see my friends at the 1st A.S.H. Here I had a\n\nshower a perfect treat as the heat was awful. Then I borrowed their bicycle & rode to Ferry post in order to get the bike order signed but was turned down once more much to my wrath & I had to take & leave the recq. at the","90":" Anzac headquarters for them to deal with. After returning the bike I discovered my waggon had gone off & left me but luckily I met a which took me to ferry post for P.T.S. & I managed to catch up the waggon again. With all my running about I thoroughly enjoyed the day, sampling fruit beer peanuts etc the very change in itself being enough to buck one up. We suffered two minor accidents. The first, crossing over the road one wheel went into a hole & the driver was thrown off the box. I was preparing to jump for safety the reins being on the ground when a thought struck me first to try & calm the horses who were galloping away. Almost at the word of command they pulled up much to my relief. Luckily the driver was not hurt. The second time was coming home, the horses started off while we were\n\nbuying some drink & tinned fruit & charged through & smashed some guy ropes but I was able to stop them before that had gone any distance. We arrived home in the cool of the evening about 7 oclock. Everywhere I went they were talking of our early embarkation so we are naturally looking forward to it with high hopes. We had two interesting items read to us in orders. One was that fishhooks might be found in Davis brand of bully beef & that great care should be taken when corresponding with people who wish to write to lonely soldiers. Lonely soldiers letters are to be stopped altogether as they fear information is leaking out to spies who style themselves sympathisers with lonely soldiers. there is some leakage of information as precautions \nmeans\n are being taken to prevent further leakage.\n","91":"\nMade a start in the dispensary & was not sorry either as the weather is astoundingly hot. Reveille now at 4 A.M. which makes the day very long. We had several cases of heat stroke brought in during the day some of which played up in an alarming manner as they had had recourse to the wet canteen\n\nThe water supply practically failed & men out in the trenches had a very bad time having to drink in some cases soapy & other discarded water the reserve tanks being drawn on. The matter was so serious that those in command actually sent in a communication that they would have to withdraw from the tenches if the water was not supplied within a few hours. Men on fatigue duties used all manner of subterfuges to get into hospital for treatment if only for a few hours. Even when the men get the water it is so hot that it almost makes them ill to drink it & certainly does not satisfy thirst. The wet canteen has been doing a roaring trade a new shipment of Carlton beer having arrived. Am afraid that my tunic containing a couple of 100 P.T. notes has been pinched or rather confiscated by some person who claims a prior right to it. Our present camp is called railhead, being the terminus of the railway line from Ferry Post, Camels carrying water & other supplies to the trenches. Even gippies & camels go out to the heat so that 'tis not much shame for an Australian to do so.\n","92":"","93":" & Friday\nReveille 4. A.M on duty in the dispensary & nothing much doing. A pleasant cool change has been with us these last two days which has improved things wonderfully. The beer has been causing some trouble our camp being one of the worst. Some of the chaps have been hardly sober for about 3 days & I expect that trouble will ensue from it. C section has now been formed & I believe that I'm fixed up with three stripes. Tomorrow will settle the matter.\n","94":"\nFor past week have been working in the dispensary which means a very easy time to what I have been unaccustomed to lately. I did a fair bit during the week fixing up panniers etc preparing for our shift. The new section was formed but owing to the O.C. being doubtful as to his powers he made the sergeants of it acting corporals as a first step so am daily expecting to hear more of it. It appears that there is still some doubt about whether the section is \nto\n to be kept going or\n\nnot. Have been into Ismailia twice for drugs. The distance is between 10 & 11 miles which means a long slow journey but tis worth it for the change & to see old faces. A new issue of Australian gear is being made in readiness for our trip to France 'Tis very hot after being used to \"shorts\" & drill khaki.\n","95":"\nSpent the last few days printing photos as a last flutter. We have definite orders to get rid of Cameras so I packed mine up & sent it to London. I developed several spools & printed close on two hundred good pictures all of which have gone home to swell the collection. Definite news at last about our being relieved. We are to march off Tuesday 30th for Ferry Post being the first stage to France. A warm snap coming on again to welcome the Tommies.\n","96":"\nFinished the photos in the morning & worked hard all the afternoon packing up the dispensary. Then had a sponge & turned in & read until about midnight. I had a book on Napoleons life & had to finish it before leaving.\n","97":"\nReveille at 3.30 A.M. & having everything all packed ready we were early on the road to Ferry Post. We took up our possie in the Casualty Clearing Hospital tents as they had several empty & were just moving off for Moaska. We are to carry on the place until relieved by more Tommies. Everyone appears to be ready to move off & very anxious now.\n","98":"\nManaged to get leave in order to go up to Cairo & draw some cash. I caught the 8.30 P.M train arriving Cairo somewhere about 1. A.M. the train being late owing to a truck being on fire on the line. We had our passes examined on the station by the officer & decided to put up at the Anzac Hostel a place run for soldiers only. A Gany took us there in a few minutes & after a small supper I turned in & very pleased indeed was I to get into bed as the last two nights I had had very little sleep. The beds were comfortable & clean there being a great number arranged in a dormitory style. After a wash shave & boots cleaned operation I had breakfast costing P.T.S.\n\n& then set out to wander around Cairo. My first port of call was the bank where I drew £10 which had been there for me since February. After that I purchased various photos etc having in between some good meals as a . Caught the 6.15 P.M train back passing on the way a large native village on fire. It was a great sight as the gippies stack all sort of lumber etc on their flat roofs & all this as dry as possible was well alight when I saw it. I called into the 1st Stationary on passing & witnessed the tail end of a good concert, setting off for my long walk home I had my usual luck, some officers in a garry giving me a lift right to the Canal which brought one home about 11 o'clock very glad was I to get to bed once more.\n","99":"\nReveille 4.30. Parade at 5. breakfast at 5.30. We had a march in the morning the tent division also receiving a lecture. My full promotion to Corporal was read out in orders which makes my other promotion now a certainty & very welcome it is as I have waited a long time\n\nfor it. Very hot day. The Tommies are arriving to take over so expect we will make another move in a few days.\n","100":"\nEarly reveille as usual & then company drill in the morning. I was put on to drill being a section commander for the morning, but flatter myself that I carried on O.K. considering that 'tis nearly 18 months since I had any practice in giving orders a very different thing to carrying out the orders in the ranks. Had two good swims during the day & a lecture in the afternoon. Made up some more parcels for home, mostly photographs.\n\nSaturday 3rd June\nNew orders out once more. We are not allowed to take our black kits to France, a very wise thing as 'tis merely a huge waste as we keep a lot of clothing lying idle causing lumber & extra transport etc. The pity of it is that they wait until we are issued with two complete kits then immediately take them away again which means an awful waste both of clothing time &\n\nlabour. We have no need of a black kit it been an unnecessary expense. Spent the morning loading waggons & marking all gear belonging to C section then all spare clothing was called in & I issued extra bandages to the bearers. After tea gave the Q.M. a hand sorting out the clothing etc.\n\nGeneral Birdwood has issued a message to the Australians going to France. Viz.\n\nNow that we are proceeding to France I am republishing Lord Kitcheners messages to the troops of the British Exp. Force which was originally issued to the Australian & new Zealand Forces before their departure from their homes in","101":" I feel that it is hardly necessary for me to emphasize to all ranks how sincerely I trust that they will bear in mind all that Lord Kitchener says & do their utmost to live up to the ideal which has had placed before you. Since the Australian & N.Z. Forces left their respective countries you have made for yourselves a national reputation as good fighters, which has earned for you the esteem of our comrades, alongside of whom we will shortly be fighting. The training that you have had will I hope enable you to utilise your fighting qualities to advantage. But, in addition to these two qualifications, there is still a third\n\nwhich is essential to success – DISCIPLINE. and it is the greatest of the three, for without discipline the best fighting troops in the world will fail at the last to achieve success.\n\nYou will undoubtedly be faced with temptations in France, for we shall probably have to pass through and be billeted in densely populated French villages. Drink will, I am afraid, be obtainable, while villages will mostly be full of women and children, whose fathers, husbands and brothers are fighting for their country in the trenches against our common enemy. That you will respect the women I have not the slightest doubt, because I well know how absolutely repugnant the idea of any offence against a defenceless woman is to every Australian and New Zealander. It is against drink, however, That I particularly wish now to warn you, and to implore you to take hold of yourselves, and in the case of every man to absolutely make up his mind & determine for himself that he will not give way to it, and that he will remember that the honour of either Australia or new Zealand is in his personal keeping. In saying this, you all know that I am only referring to a very small proportion indeed of your numbers. The great majority of you want no such warning, for\n\nI know you will already have made up your minds on the subject, and all such I earnestly beg to do what is in their power to look after their comrades, who may not have the same strength of mind as they have.\n\nRemember that a few black sheep can give a bad name to a whole flock, so let there be none such among us & let us make up our minds that the Australian & New Zealand Forces are going to prove themselves second to none in the way of discipline, as they have already done where sheer hard fighting was concerned. See to this boys! You know you are capable of it, if you will only determine that it shall be so, and if you will do this, you will be able to return to Australia & New Zealand after peace & victory with an unsullied reputation, which will go down for all time in your home.\n\nSigned W.R. Birdwood Lt. General.\nEarl Kitcheners message.\nYou are ordered abroad as a soldier of the King to help our French comrades against the invasion of a common enemy. You have to perform a task which will need your courage, your energy, your patience. Remember that the honour of the British Army depends on your individual conduct.\n\nIt will be your duty not only to set an example of discipline & perfect steadiness under fire, but also to maintain the most friendly relations with those whom you are helping in this struggle. The operations in which you are engaged will for the most part take place in a friendly country, and you can do your own country no better service than in showing yourself in France & Belgium as the true character of a British Soldier.\n\nBe invariably courteous, considerate & kind. Never do anything likely to injure or destroy property and always look upon looting as a disgraceful act. You are sure to meet with a welcome and to be trusted. Your conduct must justify that welcome & that trust. Your duty cannot be done unless your health is sound, so keep constantly on your guard against any excesses in this new experience. You may find temptations both in wine & women. You must entirely resist both temptations, and while treating all women with perfect courtesy, you should avoid any intimacy. Do your duty bravely. Fear God. Honour the King.\n\n3rd June\nKings birthday, passed over with comment in the camps.\n","102":"\nCommunion service held in the lines so a good number attended the parade being in my charge. The weather very hot again & swimming was the order of the day.\n","103":"\nReveille now at 5 AM parade 5.30 Roll call then dismissed for breakfast. 6.30 A.M. fall in. Drill & swimming parade till 10. Fall in again 4 P.M. generally for lecture altho' the men have been cleaning up the waggons for inspection by General McKay who is very strict on transport harness etc. Man ran amuck the previous night & after firing at several ended by shooting himself in the arm. I was passing at the time but did not realise the seriousness of it till later when I learnt he was firing deliberately. Still no definite orders for disembarkation. Heat in the shade today said to be 114°F. It was very hot indeed, wherever we sat we left a wet patch behind the perspiration simply pouring out & to cap it all a dust storm came up. We are having an easy time however.\n\nThe phases of a Soldiers life. A.M.C.\nAll the Corps a circus and all the N.C.O's & men merely players. They have their exits & their entrances and a man in his time plays many parts. First the private growling & grumbling about tucker & work. Then the glorified private with a little more of dog & a brand new stripe. The Corporal lying on his back in waggon or pack store waiting the opportunity to sneak into the Sgts mess. Next the duty Sgts who with voice severe & harsh roars up the men on parade. Then the Staff Sgts who with bottle & measure in hand distributes to the unfortunate patients. Then the N.O. who with longing eyes looks for stars in the Q.M.'s shoes. The scene then shifts to the officers mess where colonels severe, majors shrewd & Captains new do congregate to talk of veins & hearts & operations delicate, of horses, tents, poisons & purgatives for all to take. The next scene is the Q.M.'s store where Q.M. shrewd is heard to roar at privates about the clothes they wore & tucker they do not get. The next act is the orderly room where the Colonel sits in uniforms so neat with eyes severe & frown so deep he doth censure & sentence as the case is proved. Last of all comes the end to this eventful career sans leave, sans girls, sans bar, sans everything.\n","104":"\nusual routine of drill, swim a loaf . . . until 4 & then a lecture. Had a rotten bilious attack so felt anything but happy.\n","105":"\nAt drill in morning acted as a patient & received a very rough handling I pity the patients (real) now more than ever. Pay day so am well set up. Arrangements made for swimming carnival tomorrow & may have a cut at some of the events. A raid made today on the mens kits several things being confiscated such as extra impedimenta they should not carry.\n","106":"\nHeld aquatic sports for the ambulance during the afternoon & had some good sport. I entered into the 66 yds breast & back \nstat\n stroke & won being extended by a Victorian said to be a crack in that particular line. My section came second in the relay race. The old members of the 1st Field won 21 points out of the 25 so did very well considering how few they were. More sports to follow both brigade & divisional\n","107":"\nHad to fall in at 6 A.M. in full marching order for inspection by the A.D.M.S. who in the end did not turn up. We therefore went out for the usual drill.\n","108":"\nWent into Ismailia in order to get some drugs and do some shopping etc. Tomatoes were P.T.1 for us eggs 2 for P.T. 1 etc. Had some beira for P.T.2 a glass & peanuts in the soldiers style & arrived home about midday. Brigade sports in the afternoon at which the 14th F. Amb. won 3 items, concert at night but very sour or else I am getting fed up with them. 'Tis very rare that one hears a new item the old things being murdered over again.\n","109":"\nChurch parade in mess hut & during the service a tribute was paid Lord Kitchener. The service was a very good one a point being made of the 5000 sailors lost in the North Seas fight.\n","110":"\nUsual drill & swimming parades also a medical inspection during the afternoon. At night had a little excitement, some of the lads putting a donkey into our tent\n\n& closing the doorway up. Luckily the donk did not play up over much so we all enjoyed the joke.\n","111":"\n Chief item of the day was a memorial service held late in the afternoon for Earl Kitchener. To those who could hear the padre it was very impressive the point being made of this great success through concentration. \"Whatsoever a man putteth his hand to that let him do with all his might\" The secret of success of many.\n","112":"\nThe Divisional Sports were held at Moaska Camp a distance of 5 miles from Ferry Post. The competitors did the journey the night before & we set off at 4.15 A.M. as they commenced at 6. A.M. Very few of the men attended from this camp owing to the early hour & the march but it was worth the trouble. The performances were high class both man & horse & the out of the various waggons etc first class. Coming back we had a spell for a snack in Ismailia & reached camp again about midday.\n","113":"\nDefinite orders for shifting camp arrived. There was not much to do in the way of packing up, only a few tents to pull down & waggons to load up with blankets etc which went on ahead with an advance guard. The night was warm so that we did not miss our blankets overmuch. Had a last swim in the canal at night also a supper party as a farewell to the Sinai Peninsular.\n","114":"\nReveille at 3.30. Fall in fall Roll call 3.45. Breakfast 4 A.M. ready to move off 5 A.M. The brigade was late so that we did not get away till about 5.30 when we marched across the pontoon bridge a large ship being moored in the canal whilst we did so. We did the journey to Moaskah quicker than any other brigade which spoke well for things in general. It was very hot, the perspiration simply pouring out of us our uniforms being saturated. On arrival we took over the tents of the 8th Field Amb. & were glad to take it easy until the cool of the evening. Spent a few disasters in the Gippo canteen on \"eggs acooked\" and some beira at night.\n","115":"\nDefinite orders for embarkation out & we move off tomorrow night our transport has already gone. The management of the transport of troops seems to be well nigh perfect, everything going off without friction. Unless one is at the station itself, a few thousand men can be moved off & none the wiser so smoothly do the arrangements work. We had a swim in the lake today & it very nearly proved a serious matter for me. On taking a final dive I struck the bottom with my head narrowly escaping a serious injury. As it is I injured my spine chiefly by wrenching some muscles or cartilage & have to carry my head as in a splint. The pain is not great in itself unless I move the head\n","116":"\nHad a very quiet day mostly resting my neck but had to fix up my kit for going away. My promotion to Sergeant was read out in orders in the afternoon three of us getting the promotion & we had tea in the Sergeants mess. After a bath & clean change I hired a gippo to take my kit to the station. All left camp abut 7 oclock & the train moved out for Alexs about\n\n10 oclock. The arrangements were splendid all going off without a hitch. Open trucks were provided for all hands officers included. The night was fine moon well up & notwithstanding the conditions I managed to get a good sleep resting my poor neck on my kit bag.\n","117":"\nArrived in Alexs 5 A.M. the train going right alongside the ship. Most of us went aboard the \"Royal George\", transport on the \"Georgina & two of the M.O's on the \"Canada\". Had our money changed to English during the day. The sergeants are in Cabins & a good number of the men everything pointing to a pleasant trip. During the morning we moved out into the stream but at what time we sail, no one knows. Boat drill & issue of lifebelts during afternoon. At night found it impossible to sleep in the cabin owing to the heat and insects. Left to myself I might have managed but the occupant of the bunk under mine was greatly troubled. Every few minutes he would switch on the light in order to catch things crawling on him. They turned out to be bugs or small cockroaches the ship being infested with them. I stood it until in a triumphant voice he announced his seventh kill\n\nwhen I thought it advisable to suggest a move up on deck where I eventually finished the night.\n","118":"\nUp before 5 A.M. owing to a washing down decks. Spent the biggish part of the day sleeping it being very sleepy weather. Neck much improved & am shaking off the affects of a bad bilious attack. The Sergeants mess very poor in comparison to what it might be, Bought English beer at night & had somewhat of a beano finishing up with skylarking for a couple of hours after lights' out. No prospect of moving off yet.\n","119":"\nUp at 4.30 A.M. seawater bath as fresh water very scarce. Parade 6.30. breakfast 7.30. parade & inspection 9.30 to 11. dinner 12.30. Roll call at 2 P.M. & boat alarm all having to fall in in correct places at boat stations. Weather very hot & enervating.\n","120":"\nSpent a good night up on deck rising at 4.30 A.M. & managed to get on to some coffee. At last we were allowed to sail getting away at 10 A.M. being the last of the convoy to sail. We being the fastest ship was the reason of getting away last. From the moment of leaving harbour we had orders to wear lifebelts, a necessary tho irksome order.\n\nAlso, all ranks are forbidden to wear boots. The weather is delightful, the sea being of the real Mediterranean blue. After tea had a series of boxing contests some of which were first rate. No lights allowed on ship, smoking after sunset being forbidden. Slept on deck at night.\n","121":"\nStill going along merrily the ship proving herself a splendid seaboat. Have passed several trawlers also torpedo boats so all hands feel fairly safe. At one time we came up to 5 trawlers in line, one being fitted with wireless. Other ships appear at intervals the \"tinned fish\" not having it all there own way. About 10 A.M. we picked up a destroyer which kept with us all day leading the way a short distance in front & only leaving us during the night. One transport passed us loaded up with troops probably for Salonicka or Egypt. The course taken brought us round the north of Crete which island is the centre of the danger zone. No signs of habitation could be seen nothing but a forbidding looking coast line. Had the usual boat drill when I was transferred to No. 1. boat & put in charge of the navigating party.\n","122":" June1916\nOrderly sergeant for the day this being my first experience of this job. Held the usual parades & in addition had a boat alarm at 4.15 P.M. the men al being below at tea. The siren blew two blasts at which signal the men appeared as if by magic, moving to their proper stations with commendable quickness & quietness. The crew were included, firemen & all having to take up their positions. After inspection we were dismissed to carry on with the day, about 10 being in sight at one time, a war boat nearly always being included. Tis' comforting to see a T.B.D. appear, have a look at us & off again Weather calm & warm.\n","123":"\nVery misty & foggy the foghorn going occasionally with earsplitting blasts. Church parade during the morning conducted by General Clayton but very poorly, half the crowd not being able to hear. Wrote a few letters in the afternoon ready to post on landing. Passed south of Malta about midday the other ships going right into harbour. One ship which had been with us right through\n\nturned round & went back leaving us to go on alone escorted by a destroyer. The reason of this manoeuvre we do not know but believe the presence of a submarine has been reported. Passed the island of Pantellaria about 10 P.M. close enough to see lights. Having a splendid trip plenty of fun & frolic & then after dark we congregate in the mess & yarn & smoke over a glass of beer. The mess is in what in ordinary times is the 1st class smoke room which is panelled off in oak in old fashioned style. No electric light being allowed we manage with a few hurricane lamps & candles, blankets being hung over the ports. The result is a scene which conjures up scenes of olden days, of men gathering in the village inn for gossip & smoking & yarning or listening to the scratching of a fiddle.\n","124":" 26thJune\nDay opened up cool & misty. Passed what we believe to be the South of Sardinia about midday still being escorted by our T.B.D number 69. Sports & boxing during the afternoon, the boxing being of the willing variety. Cool change at night but slept on\n\ndeck nevertheless. A strong wind blew up & played havoc with my blanket it having a tendency to part company with its owner which meant a restless night.\n","125":"\nOrders to change into our Australian uniform ready for disembarkation & the packing away of our summer drill khaki into the black kits for return to Egypt. A fairly big sea worked up during the morning & quite a number of chaps went down to it. Practically all felt somewhat unsafe, the boat pitching a good deal. Our escort the T.B.D. had a bad time, being completely buried at times & pitching & rolling to an alarming extent. Sighted land about 10 A.M. which turned out to be France. We ran along the coast then and arrived at Marseilles about 2 P.M. The country proved to be very hilly rather bare & with jutting headlands into the sea. Several towns could be seen looking very picturesque with their red tiled roofs but everything appeared to be lifeless. Arriving off Marseilles we first noticed the lighthouse standing well out to sea. The town beyond\n\nextending along the shore. For some time the actual harbour could not be seen, it being a large breakwater running parallel to the shore. Accomodation very \nliberal\n limited this perhaps being the reason of the transports coming singly. Our escort left us when we entered the harbour & rapidly disappeared from sight to take up no doubt more of the tiring work of patrolling. The chief object of interest noticed in the town from afar is a large church with a golden figure on its highest point. It is built on a high hill & looks down upon the surrounding town. An island standing in front of the town appeared to be well fortified but is probably obsolete. An appearance of lifelessness was to be seen everywhere just sufficient being done to keep things going. Women were employed on the wharves with the men doing most of the light work. My first impression of Marseilles is that tis' not so large a place or important as I imagined it was the harbour being especially disappointing.\n","126":"\nSlept up on deck for the last night being called up at 2.15 A.M. We had breakfast our last meal on the ship all being on the wharf by 5 A.M. the ship returning immediately to Alexandria. The local residents all had the Gippy sayings off by heart, such as Sieda, eggs acooked etc. & greeted us with them with great glee. Bread, buns biscuits, oranges & such things were on sale, by women & boys. We entrained that is the whole shipment of about 1500 in one train of 39 carriages, the carriages being small tho' comfortable. The sergeants were fortunate on having a second class compartment & only five in each which allowed us sleeping room. Wet weather greeted our arrival & we wended our way through mud for a short distance. Our route lay along a section of the coast, the line passing over several viaducts & through long tunnels, splendid views greeting us everywhere. It was good to see homes again with their gardens attached & youngsters playing in them. Tile works were fairly common & practically all houses had tile roofs throughout the country they evidently being very cheap. Thatched roofs did not appear until we were well past Paris,\n\nour first stop was at Orange where we had tea made for us & so had a quick meal guards being put out to keep the men from slipping off. After leaving Orange we came to lovely country being in the Valley of the Rhone. Right up to Paris it was a veritable garden all the way. Harvesting was in full swing & appeared to be well in hand. Women girls & children were employed to a great extent, the men being mostly old, altho' a good proportion of soldiers were employed. The welcome given us by the residents was of the quiet kind until we neared Paris, when the people were more demonstrative. Everywhere was a general air of peacefulness only the soldiers uniforms & trucks marked \"War material urgent\" to be seen as a reminder. We passed several troop trains, most of the men wearing the shrapnel helmets & they as a rule gave us a good cheer. The roads we saw were good being made of limestone judging by their white colour but were very narrow. Practically all had trees planted alongside, the roads being a series of long avenues, meeting over head the effect being splendid. The country carts were peculiar being exceptionally long, like a lorry on two wheels,\n\nbeing drawn by several horses, according to the load. The horses appeared to be of good quality. At one station we pulled up to allow an express to pass & seized the opportunity to buy some bread, sandwiches, oranges etc. our rations were issued once a day being biscuits, bully beef, butter & jam & cheese, tea being made at certain stops. At night we slept two to a seat & one on the floor but owing to some insane idea we were pulled out at 2 A.M. the first night for tea.\n","127":"\nStarted the day by being pulled out at 2 AM for tea, we were all well asleep & would much preferred to have stayed so. It was here we lost several men, the train going off rather quickly. Altogether I believe we left 70 men on the journey, some by accident but most by malice aforethought. At 10 AM we stopped again for breakfast & managed to get some water for a good wash. During the night we passed \ntwo large towns Lyons & Dijon. From now until we picked up the Seinne River we passed a series of canals, several being lined with poplars\n\nmaking a very fine effect. At Chalons we left the Rhone & picked up the River Seinne at \"Montereau\". The scenery was still beautiful altho' of a different description. Densely wooded slopes with stately homes with trimmed lawns rose up from the river & the railway being high up we had a splendid view. Poppies now became more common & we passed one field a perfect blaze of red. At times it was nicely mixed with blue cornflowers & other wild flowers & was very pretty indeed. Patches of heather were to be seen when nearing Paris. At Juvisy near Paris we changed round in order to circle round Paris & so we continued our journey North. At this station the residents gave us a good welcome exchanging souveniers flowers, notes etc.\n","128":"\nWe passed Ameins at 7. A.M. the country hereabouts being rather poor. Tommies now appeared more frequently & we soon met with a few Australians making us feel quite at home. We soon\n\napproached the coast & met with some misty & cool weather. The train now slowed up considerably & we crawled through Boulogne & Calais without seeing much of either town however & eventually stopped at Theinnes 5.30. P.M. I was orderly Sergeant for the day & for the next two hours had plenty of running about. An interpreter met us & showed us the billets provided. They consisted of barns with plenty of straw for the men to sleep on. We were all accomodated within a radius of 500 yards, 50 being in one barn 80 in another & so on. Officers were billeted in houses & the Sergeants had a small barn to themselves who also arranged for a room in the village for the purposes of a mess. It was amusing to listen to the attempts at French by various members of the party. By 8 oclock all was fixed up, fatigue parties had unloaded waggons carried firewood for the cooks etc etc & all were happy. An air raid could be seen by a large number of aeroplanes some distance away the puffs of shrapnel bursting all amongst them. This same night we heard the guns booming for the first time.\n","129":"\nManaged to put in a good night the straw making a splendid warm bed. Parade at 9.30 AM. In the street when various orders were read out concerning the conduct of the men management of billets & various regulations went for a route march for a few miles through the lanes everyone being charmed with the place. Had dinner at 1 P.M. of bully beef & bread bought in the village which was of very good quality. Spent the afternoon learning a bit of French as now being the time place & opportunity to earn sufficient to make oneself understood.\n","130":"\nWas made Caterer for the Sergeants mess for the time being. We are experiencing splendid weather keen invigorating air cool nights and warm days. On duty at the dressing station but we are only doing sick at present our chief trouble is getting bu ckets etc in order to do things properly. Witnessed a procession by the local residents in commemoration of Joan of Arc. It was a religion festival consisting of a slow procession to a given point where a sermon was delivered by the vicar & then the return march. Emblems, Crosses\n\ncandles & images etc. were carried in profusion & chantings, incantations etc were freely delivered. The route was strewn with leaves & rosepetals etc. About 50 R.C.'s, Australians, joined in the show. It was the saddest spectacle I have yet witnessed the large number of widows & those dressed in mourning & the almost entire absence of able bodied men bore mute witness to the ravages of the war. Practically all are in mourning & the youths left are about to be used. One cannot quite realise the awfulness of the war.\n","131":"\nVery little doing a few sick being treated throughout the day. Spent a certain amount of time fagging French & find it fairly easy to make myself understood. Tis wonderful how easy it is to converse with a person by the help of signs, a few words here & there etc etc. Witnessed an air duel this morning but could not see the result as they went out of sight. Great care is taken by the authorities to prevent information leaking out as to the position of units etc we not being allowed to write down where to send a patient, as that would state\n\nwhere that particular hospital was.\n","132":"\nA very busy day in the dispensary, a fair number of sick and had to supply four battalions with drugs. Heavy rain in the afternoon quite a change from what we have been used to. Can hear nothing of anyones whereabouts information being hard to obtain, a very good sign. I can see evidence on all sides showing good management and a thorough grasp of details.\n","133":"\nHad a very interesting day. Went with the car in the morning in order to pick up some sick from various billets & to give instructions to the billets or rather battalions how to conduct their sick parades & forward particulars etc. O\nn our way to the Hospital at Hazebrouck we dropped the Colonel at headquarters for him to get our pay. This necessitated a big detour & I obtained a very good idea of the surrounding country. Soldiers were everywhere. Every barn, stable or outhouse had its complement & men were drilling & marching in all directions. Here & there I saw old trenches & wire entanglements\n\nprepared some time ago when the risk of a German advance was very great. The whole country side looked well, crops in splendid condition but very few men to be seen. Hazebrouck proved to be a fairly large place of the old type & contained several hospitals. I managed to purchase some English papers & other little things & some cigarettes & delicacies from a British Canteen. It was extraordinary the number of motor wagons I saw practically all of 3 tons capacity, the 30 cwt ones having been sent to Egypt. They are all in squadrons, different makes being isolated to my mind a very good idea as it simplifies repairs & replacements of parts etc. In the evening went for a long walk & came to a large wood principally of oaks. Pathways ran through it at right angles, it being an ideal place for promenades as well as for preservation of games.\n","134":"\nWent to 'Aire' in the car in order to procure supplies also had a run through the town & had a look at the old church. Aire is another old place it evidently being entirely run by the British as our men were\n\ncleaning up the streets etc. Managed to get a supply of tobacco cigarettes etc. At one place I saw a complete convoy of motors laden with heavy shells ready for the front. Whether they were always held in readiness or were prepared to go up at night I do not know but probably the latter. Altogether I saw a huge number of lorries. Another interesting sight is to see the barges on the canals for the conveyance of wounded They average about 36 patients each & go right down to Calais. Steam barges do the towing also horses on the tow path & tis wonderful what progress they can make, they are of course an ideal carrier being so quite & steady.\n","135":"\nHad a very steady day. a heavy shower or two greeted us during the day a thing we are getting accustomed to once more. Had practice in wearing gas helmets during the afternoon & found them not half bad. My chief trouble is the production of saliva which forms owing to having a mouth piece & I have to continually remove it from my mouth in order to swallow.\n","136":" 8thJuly.\nhad a rather busy morning plenty of dressings & evacuations the result of the route march the day before. Blistered feet & chafes were the order of the day. Received orders for moving off next morning about 10 A.M. B section to proceed to Lynde. A & C destination unknown, so started to pack up, a big job as we had a lot of extra stuff, 8 cases in all. Finished the day at 11. P.M. & cracked a bottle of champagne before retiring. During the afternoon we said a few reluctant farewells to some of our civilian patients. Rather a strict order came out about men falling out during a march. Many men have fallen out during a march just because they feel tired & it was becoming quite a serious problem especially as it looked serious when a battalion where marching to the firing line. The order read that men offending would get 2 years hard & officers were instructed to insist on the men keeping up even tho' their feet were blistered or legs chafed. 'Tis quite a common thing to have read out in orders the names of men shot for desertion & refusal of carrying out of an order.\n","137":"\nReveille 5 A.M. Breakfast at 6 A.M. the loaded up our transport\n\nwhich had arrived the day before. By 8.30 we were on the march with the brigade & headed N.E. The village folk turned out to see us off & it being Sunday were all dressed in their best. The country w passed through was looking well & well cared for. The crops were good especially the wheat. Vegetables were in profusion field after field of french beans potatoes etc. to be seen. All along the road were crucifixes & images small chapels etc, built no doubt with the idea of sending the departed to heaven. Offerings are made regularly in the shape of small wooden crosses of which dozens & dozens would be placed in a rack affixed to some part of the show. On some buildings, images were built into the wall such customs being universal in this part of the world. The canals were very conspicuous by the rows of poplars planted on their banks forming a fine background at times to the red tiled cottages, thatched roofs being uncommon. Quite a number of the houses had churning wheels, many facing the roadway. Dogs are placed in-side & by stepping forward cause the wheel to revolve which it does fairly easily being fitted with ball bearings. The chief place we passed on the road was \"Merville\" where the population just gazed at us as we\n\npassed nothing like what one usually expects from a french population. 22 months of warfare & close proximity to the line has evidently quietened them somewhat. After passing this place we halted for dinner on the road dining on bully etc. At the same time I changed my boots this being possible owing to my having an extra pair strapped to my pack. As we approached \"Estairs\" we saw a good bit of shelling directed against our aeroplanes. Hundreds of shots were fired, several at one time but it appears to be a hard matter to bring one down. Here I also saw a motor cyclist pass with a basket of pigeons strapped to his back being ocular proof of their use in the army. Stationary balloons were quite common much to my surprise no less the 4 being in sight at one time. At Estairs we were billeted in an old convent being allowed into the town between 6. & 9. P.M. I straight way went to see a friend in the casualty clearing & had the customary yarn. Over 100 dropped out on the march but very few were picked up, the majority having to struggle in on their own. The distance was about 13 miles.\n","138":"\nUp feeling fit & well at 7 A.M. At about 10 A.M. we were allowed out having to report back at midday. Parade at 1.30 A.M. & at 2 we marched off proceeding by sections out of \"Estairs\". We then divided A going on to L'estrade & C to \"Sailly\" where we were quartered in some low lying buildings run as a clearing station by the 12th Field Amb. The whole show is quite an establishment being a clearing hospital, laundry and bath house. About 70 girls are employed in the laundry the procedure being as follows. The men are relieved in the trenches every four days, coming back to one of these bath houses where they obtain a hot bath & clean change of clothing leaving their old stuff to be washed & prepared for the next batch. A man certainly gets accustomed to wearing second hand clothing by this means.\n","139":"\nTook over from the 12th Field & set to cleaning the place up. I fixed up the dispensary making it look very decent having found some drugs packed away in the Q.M.'s store. What patients were in were evacuated during\n\nthe morning things being very quiet indeed. During the day we were subdivided, 34 men being sent on a little further to run another bath house.\n","140":"\nA very quiet day only admitted 6 or 7 patients. Owing to orders coming to shift on once more had to pack up the dispensary again and hand over to B. section which arrived during the afternoon to relieve us. We were rather wrath as we had fixed things up beautifully. Sampled the divisional baths during the morning & altho' I did not go through the whole regime only having the hot bath I will give the full circus. The men march in at one door, undress, affixing their identification discs to their tunics & pants which are handed over to girls who run a hot iron all over the seams etc to destroy the livestock. They then pass in to the bath room which contains a number of half-barrels filled with hot water in which they splash to their hearts content. After this they hand in their underclothing getting in exchange clean ones thus being turned out absolutely free from lice. The dirty clothes are then taken over by girls who first soak them in disinfectant & wash them thoroughly\n\ndrying them in special rooms. They are then ready to issue out to the next batch. The laundry employs about 70 girls all told their wages being abut 3 to 4 francs per day. The buildings used, at one time were dye works & are well adapted for the purpose. The idea is splendid, the men having a chance to keep clean and comfortable & it saves them from the trouble of washing their own clothes which is quite a problem in this moist climate. The laundry girls are rather a rough lot, speaking English a little from contact with our men & having the usual slang etc off by heart. At night had a champagne party for our last night.\n","141":"\nAs B Section had taken over there was nothing to do bar load our waggons & shew them round We moved off about 2 oclock the bearers going to the bathing establishment & the tent division to \"L'Estrade\" where A section were running a divisional rest camp. It turned out to be a splendid show everything being nicely arranged good food, men very comfortable & all happy. Work was plentiful so that from all accounts we will earn our money for a time at least.\n","142":"\n\nHad a very busy day chiefly rearranging the dispensary. Quite a lot of empty bottles & other gear had been allowed to collect and the place was in somewhat of a mess so I got right into it & squared the whole show up, a job I rather enjoy & am getting quite used to. We have a dispensary complete enough to run a hospital with instead of a rest camp. The afternoon was quiet & I managed to write several letters which required answering.\n","143":"\nOrdinary routine work mostly & that rather moderate. Went through all the wards & inspected their medicines discarding old stuff & taking a list of what remained. I then formed a list with index complete so I could see at a glance what each ward contained. No sooner was this completed than I had word we had to shift once again. I had been for a walk to the No. 2 CCS new station at \"Steenwerck\". They had formed a camp under the supervision of an R.E. man & were just completed ready for patients. Half of the tents were stained brown & half green\n\nto make them inconspicuous to aircraft, the effect being rather extraordinary at close quarters. Dabs of green paint & brown paint were everywhere the original colour being entirely lacking. On my return was greeted with the news of shifting & at 10.30 P.M. with the definite news that we were to move at 9 A.M. the following morning, Sunday once more being our moving day. Heavy bombardment going on the star shells being very brilliant & continuous. A few days will find us in an advanced post I believe.\n","144":"\nUp early in order to pack up ready for the move. A few of us went by car to take over the \"Sailly\" place where 'B' Section were, the remainder to follow after so that we we back in our old position. By midday I had all ready again when I was given 10 minutes to pack up & move to a new position. We had orders to be ready to receive patients by 6 P.M. in an advanced dressing station. The position chosen was a large building which housed three different units & by 6 P.M. all was ready to make a start. At 10 P.M. we had made a list of urgent 'necessities so decided to obtain same straight away & took a car to go to \"Hazebruck\" a\n\ndistance of 20 miles. The depôt was closed when I reached it but they got up & supplied me inside of an hour altho' the man in charge was somewhat drunk & insistent on providing me with a drink. The trip both ways was very enjoyable especially on straight patches of the road where the car went all out rather exciting in the dark. We passed hundreds & hundreds of motor lorries, in one string alone I counted 100 & everywhere men were working chiefly getting ammunition to the front. Stacks of shells were along the roadside under cover of trees mostly ready to be picked up limbers of which there was a goodly string. The troops going up to the trenches marched in single file both for purposes of roadspace being scarce & observation by balloons. By 2 oclock I was back once more & turned in at 2.30 A.M. as nothing was doing. The bombardment was going some & star shells were very brilliant\n","145":"\nUp & had breakfast by 8 A.M. & was kept busy on cases until midday. The afternoon I spent rearranging the operation tables & getting all ready for a busy night. Had one trip in the car, first to Er at \"Armentieres\" to pick up stuff from our bearers & then across country to\n\nL'Estrade to try & get more lamps tables etc. From 4 till 8 we were busy when I managed to get some tea but from then on the cases slackened & I turned in at 11.30 only to be pulled out however at 12.30 for a gas alarm nothing came of it so I returned to bed sleeping in my clothes & was called for breakfast between 7 & 8 A.M. The cases we have had so far have been just typical cases some severe some not. Antitetanus serum is injected in all Cases\n","146":"\nHad a steady day & fairly slack in the afternoon so spent some time in arranging the stock for each section. Things working very well the men taking an interest in the work & we have contrived to make our show superior to the other ambulances around. Kept going till 2.30 A.M. making a 19 hours day but did not feel unduly fatigued\n\nWednesday 19th\nVery little doing with wounded so had time to finish all arrangements for a big rush. Had a rest between 10 & 12 A.M. which was just as well considering what came on later. After dinner I walked along to the Divisional Baths & had a good dip which was a luxury indeed. Then a few minutes after getting back the show commenced all the day our artillery had been shelling\n\nthe enemy, the noise being one long continuous boom & the first wounded began to flow in properly at 4 P.M. At 6 P.M. our chaps made the charge & were met with a solid reception. At first so far as can be gathered, they were successful but the Germans eventually pushed them back to their own lines. We had to work at full pressure as the cars kept pouring in the men very fast the organisation in that respect being splendid. Soon they came quicker that we could cope with them & the place began to fill up but all hands worked with a will volunteers coming from A.S.C. & other men. Close handy so that our numbers were increased considerably. I was chiefly concerned at first giving serum injections against Tetanus, every man receiving a dose, occasionally helping at operations etc. Towards midnight a half dozen dentists were sent for and they relieved me of that part of the work and towards the end I developed into a general supervisor. Picking out men for immediate attention, packing others off by car, watching that supplies solutions etc did not run out & generally buzzing about, was not still a moment. Tea that night was impossible so did without. By 1 A.M. the rush was at its height & so it continued all\n\nthat day continuing at full pressure for 36 hours. All day Thursday altho very tired some of the men kept going but the majority turned in for a few hours being relieved by others. I managed to keep going splendidly feeling hardly any fatigue altho all together I missed 3 meals in the rush, what I did manage to have was a piece of bread & cheese which I had to eat while working. At 10 oclock the second night the major wanted me to go off duty but I persuaded him that I was O.K., \nr\n settled me as the colonel came & ordered the other dispenser & myself to go to bed immediately & let the other chap from B section carry on, so that was final. For 38 hours I had been going, never still a moment a thing in ordinary times I would find very difficult. I felt tiptop bar my feet which were rather sore & a general stiffness. In the time we passed through about 1400 hundred wounded more than half of which I injected with serum myself. My fingers were very tender from opening the bottles & using iodine but soon recovered. As usual the patients bore their pain with great fortitude even the free use of the knive without chloroform not calling\n\nforth a word. On a few occasions I had to give the anaesthetic as a doctor could not spare the time. Amongst our helpers were parsons & Y.M.C.A. men who did great work feeding the patients etc we also had a few Germans brought in wounded, one especially calling for pity in his lowliness. I placed him alongside of our chaps telling him \"kamarade\" at which he smiled somewhat & when one of the chaps gave him a cigarette he acted like a dog wagging his tail with pleasure.\n","147":"\nUp feeling O.K. about 7 A.M. & turned to at 8 keeping on till 2 A.M. next morning. At no time did we have a great rush, just a steady stream the cases been now much worse in character as they had been lying out & gangrene had set in. Our helpers gradually began to disappear as things got quieter & reports of congratulations to the unit for their work began to filter through.\n\nSaturday 22nd July\nRush practically over the only cases coming through being serious ones all those who had been wounded in the charge & had been unable to get in. They were as a rule terrible to look at, being infected with maggots & going bad, the\n\nsmell being terrible. Yet withat the men were quiet cheerful notwithstanding the fact that they had laid out in \"no mans land\" for two days & nights & in some cases longer. Of course the majority would lose the limb affected as gangrene had set in & made a lot of headway. Indications that we are to have another move so are tipping Sunday for it as that is the usual moving day. We received the congratulations of all the heads during the day, our unit by far doing the best work having treated more than double the number of patients treated by the 15th who were working alongside. Strictly speaking, we the 14th, should only have taken men of our own brigade but we did a large number of the 15th & also the","148":" Everyone is pleased at the result as all hands worked well & 'tis good to receive recognition.\n","149":"\nHad my best night of the whole week it being a full night except for being pulled out once at 2 A.M. As expected we had to pack up & shift which was a great shame as we had everything beautifully arranged. However we did not take\n\nlong over it being established in our old quarters at \"Sailly\" by the afternoon. By the papers we notice our stunt did receive mention, as part of a movement at Fromelles which had its desired object. For my part I think it was a bit sudden to put the","150":" Division into an attack so soon not having had time to get accustomed to the new type of warfare or anything of that kind. They received a proper gruelling, the casualties being over 3000! Am sorry to say that we had two cases of self-inflicted wounds a couple of days later when the men were ordered back to the trenches but I suppose one will find squibs anywhere. Here there is a special Hospital for such cases an inquiry being held in each.\n","151":"\nOrderly Sergeant for the day & found plenty of work to do but being new was interesting. Received a large mail my share being 27 which I think topped the pole, also 18 papers some reading matter to get through. Patients very few, one chap coming in who had been 3 days out in no mans land & really showed\n\nlittle signs of it. His fractured leg was however a mass of maggots.\n","152":"\nOrderly Sergeant again & same duties as yesterday. The worst part of the job is getting up to wake the men. More mail arrived which gave me 5 more letters so that I am well satisfied. My rank of Sergeant was confirmed from the 22nd inst. The other two in the same section being left over till next day. Why, I do not know unless 'twas to make me senior to them.\n","153":"\nOrderly Sergt. Again & was kept running about a good deal. Had a couple of patients in who had been in \"no mans land' a full week wounded. One was much exhausted the other looking quite well & strong. Two more arrived later & gave a tale about subsisting on 3 biscuits the whole time but their appearance belied their statement. They probably were in some deep shell hole or such like place & were afraid to move until forced to. There would be plenty of rations about of the dead, sufficient to keep them strong.\n","154":"\nHad a spell off duty but still found plenty to do fixing up stuff for my section. Had a run out in the car to a section of the line passing through one village severely damaged by artillery. Houses were unroofed & tumbling down, large shell holes in the road etc but still a few of the inhabitants remained returning after the strafe was over.\n","155":"\nOrderly Sergeant for the day. Absolutely nothing doing. A few sick patients admitted & C section bearers relieved A section men at the trenches. Went to the village picture show known as the \"Sailly Empire\" at night but saw nothing unusual. Usual bombardment at night.\n","156":"\nHad a spell off duty so did some writing in the morning & went into Estaires in the afternoon. There was nothing much doing the town being very quiet. I managed to buy a couple of little things such as postcards & a couple of brooches also had tea with a friend at the 1st A.C.C.H.\n","157":"\nA very warm day quite our warmest ever. Orderly Sgt for the day but managed to go to communion in the morning. Had a visit from a friend during the afternoon & a yarn about things in general. Nothing doing except usual routine.\n","158":"\nHad a day off so did some sewing & mending in the morning. In the afternoon had a run into Hazebrouck in the car & spent some cash on papers & cartoons etc to send home. 'Tis a great change to get amongst the shops for an hour or two. I saw some lovely art pictures typically French most of which were not quite suitable for the drawing room. The young lady rather enjoyed shewing us the different series & was not adverse to pointing out the different points. There was no mistake about the quality, however they were first rate.\n","159":"\nOrderly Sgt for the day & had an ordinary day. A car going to \"Bailleul\" after tea I was offered a chance to go & buy some goods for the mess. First we went to Steenwerck where I asked the driver if he knew the road to \"Bailleul\". He said Yes but lost his way so that we\n\ndid not reach our destination until too late to buy anything. It also prevented me from getting back in time for roll call but that did not matter much altho' next day the major, jokingly asked me what I was joy riding round the country for.\n","160":"\nMy day off. Went into \"Estairs\" in the afternoon in a 'Ford' & had to wait all the afternoon while it was being repaired. The mechanics were not much class & did not know much about the car, the vast expansion of the motor traffic being responsible for a shortage of good men. Coming back I drove myself this being a treat indeed & the first time for about 12 months\n\nThursday 2nd August\nOrderly Sgt for the day with plenty of work as the place was to be inspected by General Sir Alexander Godley. I kept the chaps at it until all was spick & span the verdict of the General being, splendid. He must have \nhave\n been in a good humour as he was most affable throughout the inspection. Had a half holiday during the afternoon so managed to get a few letters written\n","161":"\n2nd Anniversary of the war & still going strong. My poor old mother must be worn out waiting for it to end. The","162":" year should see the end however. Altho' personally I cannot see the end. It will be a glad day for all when it does come. Spent the day lounging about it being rather cool & I could not settle down to anything. Our existence once more becoming monotonous & as I am not working in the Hospital I seem to be out of things rather. We pass sick through mostly getting a few wounded occasionally.\n","163":"\nOrderly Sergeant. Very little doing. Had a visit from a friend in \"Estairs\" who rode out on horseback & stayed to tea. After tea went for a stroll & in looking for a battalion found myself well up amongst it. By chance we came on a battery firing alongside a house, the guns being screened with branches etc. 'Tis remarkable how the residents carry on their duties seemingly oblivious to danger. Familiarity breeds contempt\n\nI suppose. One shell landed within about 100 yards of where we were standing but did not explode. It was illustrative however of what might happen at any minute anywhere in this region.\n","164":"\nA very quiet day in most respects but plenty of shelling going on. Saw a couple of German planes over, a rare sight these days. Went to service in the Y.M.C.A. at night & listened to a very good address. A. Section bearers relieved C. Section at the trenches.\n","165":"\nThings very quiet. Had a run to a reinforcement camp in the morning for a sick parade managed a few letters in the afternoon & also received some.\n","166":"\nOrderly Sergeant So had the ordinary camp duties to attend to. Built a pit for the motors during the afternoon at which I had to work myself in the end so as to have it the way I wanted it. German planes more venturesome than usual a few coming over but very high up. At times one cannot distinguish them, only see our shrapnel\n\nbursting.\n","167":"\nSpent a restless night, what with listening to some heavy guns nearby firing & traffic on the road. Several 6 inch naval guns went pass drawn by caterpillar motors. Went to a reinforcement camp in the morning to fix up their sick parade. More German planes over today but very high up. Our batteries peppered them well especially when over our heads, a fuse & a lot of the shrapnel falling amongst us. One appeared to be driven to land in their own lines.\n","168":"\nHad a little excitement today in the way of a case of scarlet fever. The whole Hospital had to be isolated patients orderlies & all. This necessitated fresh arrangements as regards picquets etc which kept me busy during the day. Very little doing otherwise.\n","169":"\nNothing doing so did some washing & mending. Hospital still isolated & most of work going to 'B' Section. Weather very hot.\n","170":"\nOrderly Sergeant once again but had an easy day. Went for a ride on horseback in the afternoon & had a real good time. Went about 6 miles through the country getting back in time for tea feeling much better for the outing. Harvesting very general.\n","171":"\nBack to dispensary again owing to my co-worker being away to a Gas school. Very little doing & managed to wade through some of the papers sent to me no less than 30 reaching me in a fortnight. Went to Service in the Y.M.C.A. at night.\n","172":"\nReport about that King George is over on a visit. I believe he past our residence but I did not see him. Had a shower or two of rain the mud working up very quickly. A move being made to keep down the expenditure of petrol. Returns have to be made showing how much used etc & already it had had a marked effect which must be a vast saving in the aggregate. Too many joy rides go\n\non amongst the officers etc and bad management & carelessness increase the number of trips necessary a hundred fold. Am O.K. in health bar a touch of indigestion. I cannot take liberties now with my food having to eat sparingly & only 3 meals a day otherwise I suffer for it.\n\nTuesday 15th Aout\nMore rain about but nothing serious. Had to go by car to \"Hazebrouck\" for medical supplies & had about an hour in the place buying few items to send home. It was difficult to get served at times owing to the number of officers about. Very little doing except getting rid of most of the patients the embargo being lifted. Received a lot more papers from home. At 9 oclock every night we hold a tattoo roll call & this night we held a second one at 10 to catch fellows out. Only two were caught but a serious row was nearly caused. The men were properly tired and a few things were thrown the officers being heckled in the dark. One man was caught & got\n\n14 days No. 2. Things have been too easy & the wild spirits are taking advantage. Luckily I've had no trouble but several of the other N.C.O.'s have some of the men being wheeled. For two day they tried me out when I first took on a general duties some of the bolder spirits clearing off from duty but am pleased to be able to say I won without having to wheel anyone If I tell a man to do a job now I can expect to see it done which is more than can be said always & I don't think I've got the men against me, at least I've never heard of any calling me a B.F. illegitimate ? which is the usual form of endearment used by Australians when annoyed.\n\nWednesday 16th August\nOrderly Serg. after a spell of 3 days. Things very quiet during the day. At the roll call at night the officer concerned in last night's business spoke to the men & cautioned them telling them that he wished them to \"play the game\" as he did, whereupon one chap said out loud that he (the officer) had never done so\n\nfor which insolence he had his name taken being awarded 7 days No 2 next day. Included in the orders which I had to read out to the parade were the particulars of two men being shot, one for cowardice the other for disobeying an order. These cases are common unfortunately. One case was – some Canadians were marching to the trenches one night when one fell out & went into an estaminet being found next morning in the transport lines. He was shot. Another case was a man refused to go out into \"no mans land\" saying that it was certain death. He also was shot. Went down to the \"gas school\" in the evening & learnt some interesting facts from the officer in charge as follows. The first gas attack was made at Ypres 22nd April 1915 when the attack was being made on \"Calais\" & if the Germans had really known how formidable it really was nothing could have saved Calais but they seem to have used it without a proper test & more as an experiment their own men not being properly protected against it. The front was held by the Canadians & French\n\nColonials. The French bolted at once leaving a large number of guns etc & exposing the flank of the Canadians who held on magnificently stuffing handkerchiefs etc into their mouths etc until they were suffocated. Practically every man there was a casualty the whole lot being wiped out. The next was on","173":" on Hill 60. result 5000 casualties.\n\n3rd May 24th 1915 at Ypres 3000 Casualties. The Germans own precautions here were very minor 4th on","174":" over a 4 mile front, wind being 7 to 8 miles per hour near Ypres. The gas lasted one hour 20,000 men being in the area, result casualties 1000 of which 100 were successful. Ever since the first attack we always knew of the pending attack.\n5th was on April 27th 1916 at Citee St Elie & the 29th at 5 A.M. & 7 A.M. result a few deaths 463 casualties. 6th April 30th 60 Casualties. 7th Messines. Gas very strong but very few casualties. 8th","175":" at Fromelles. Gas sent in 3 waves about 15 minutes between. Smoke clouds being sent over first Casualties few. The last attack\n\nwas delivered here just when the men were charging over showing excellent intelligence system of enemy & was partially successful catching the men unprepared for which the officers responsible were strafed. The gas used is chlorine chiefly & is kept in cylinders being compressed under a pressure of 7 atmospheres & is in liquid form. 60 lbs being in one cylinder when turned on last 3 minutes. On a bright day it appears in greenish yellow column, on a damp day – white. When strong such as 1-1000 two breaths only is fatal. Carbonyl chloride or Phosgene has been used in conjunction with chlorine in warm weather & two breaths of 1-5000 is fatal. The attack in Juneaffected people 5½ miles behind the line so that now all are supplied with Helmets strange that our helmet differs from the German & French ours being more successful than the French judging by number of casualties.\n\nThursday 17th August\nHad a day off so took the opportunity of reading my mail & sundry newspapers which had been sent me. It was quite a contract such a large number coming at once. Had\n\na little rain during the day it requiring very little to make the place a quagmire\n","176":"\nOrderly Sergeant and had a lot to do mostly caused by sundry defaulters but will give a full account of the day. Was called at 6 A.M. by the picquet & was up in time to blow reveille at 6.30. At 6.45 blew the \"fall in\" had a roll call & told the men off to their various duties. 8 oclock breakfast. Men line up in single file drawing their portion from the cooks. 8.45 I blew the ¼ dress also sick parade the orderly Corporal parading the men to the M.O. Then as some men were up for minor offences to the orderly room I had to warn them & parade them with an escort at 9 when the W.O. took them over for trial by the C.O. I then fell the parade in again dismissed the men to their permanent duties which left about 12 for general fatigues. These I told off into different parties such as Q.M. fatigues, sweepers & cleaners, cooks carpenters etc to do the ordinary camp work. At 10.30 the orderly Officer made his round, pointing out\n\na couple of things he wanted done everything being practically O.K. After the men had done these they were finished for the morning. 12.45 dinner. Fall in at 2 oclock when once again the fatigue men were given usual camp jobs. As a matter of fact there was very little to do & by 3 oclock they were finished but not so myself. I then warned 3 defaulters for pack drill 2 of whom went sick which meant I had to parade them to the M.O. both however were judged fit so warned the 3 afresh for 4.30. Had just sat down when the Colonel sent for me to parade another man to him who had been given 14 days No. 2 but had appealed for a court martial. This meant finding a escort marching him up to the orderly room & bringing him before the C.O. in regimental style. This being my first experience, luckily however I knew what to do. He was put under open arrest which should have been done before & then I had to parade him before the M.O. this being\n\nnecessary in such cases I believe according to the Kings Reg's. By the time this was finished I had to start the Pack Drill men off handing them over to a corporal to see that it was done. At 5.30 Cookhouse had to be blown again & at 6 P.M. I had to see that the defaulters were placed in there prison for the night. No sooner was this done than they lodged a complaint that the place was damp & unfit for men to sleep in. This meant that I had to bring up the orderly officer to decide the point & as there really was ground for complaint he referred it to the O.C. for decision later. Rations Call had to be blown when these men were issued with bread jam cheese etc & then I had a respite until tattoo at 9 oclock when a roll call is held. The last duty of the day was to blow lights out at 9.45. During the day we had a fair amount of rain everything being wet under foot necessitating a number of duck boards being laid.\n","177":"\nRained practically all day which meant mud everywhere. Had an off day, & filled the time in reading & writing with a long walk after tea. Had a (\nlett\n) letter from Morris & was glad to be assured of his welfare. When the King visited this sector, it was reported that on a certain date, some good news would be given to the Australians. Of course we all waited patiently for the date but nothing came along so all kinds of wild rumours began to float about, such as – all the originals going back to Australia, going to garrison Ireland, special leave to England & the latest came out today which was a pearl that Queen Mary had a son & it was to be named Anzac.\n","178":"\nOrderly Sergeant for the day. Went to communion service at 7.30 A.M. Rest of day very quiet. C. Section bearers relieved B Section at the trenches & A Section took the place of C Section. Fine day but mud everywhere after the rain. Went for a walk to near \"Estairs\" at night & was caught in the rain but managed to get a lift home in\n\na bus. Several of the old London busses are being used on this sector for moving men quickly.\n","179":"\nWent to the reinforcement camp in the morning to fix up the sick parade. In the afternoon went in the car to Bo i with a patient for the detention hospital. All self inflicted wounds, whether accidental or otherwise are sent here & a court martial is held on them. 'Twas a splendid run of about 24 miles through lovely country & over good roads being very close to Belgium. Coming back I stopped in \"Balleul\" a fine big place & had a run round the shops & the Canteen buying various things. Not being sure of the way I asked a soldier & was surprised to see that he was a German prisoner. He was dressed very like our fellows & my mistake was very easily made. I marvelled that they were being made use of so close to the line. Altogether I had a splendid outing driving the car most of the way myself. After returning, orders came to pickup some patients from the Bomb School so round\n\nround there I went but one patient was a suspect for meningitis which caused a general disturbance both in the camp I brought him from & my crowd. They examined him but would not take him in so had to run him to \"Estairs\". After much argument they took him in & I got back for tea about 8.30 P.M. Altogether a very busy day & an interesting one.\n","180":"\nOrderly Sergeant for the day. Had to attend the court martial of one of our chaps & spent most of the day at the court & was not called at all. Did nothing but wait & wait for hours. Had a little fun going down. Two of us got a lift in the Generals car & passed the officers down the road who were walking to the Court, they thought it a great joke for us to ride in the car & asked me when I ordered it. Had a few bright hours at night. We started for a long walk & cracked enough champagne to make us feel happy. After the tattoo & reading of orders we had a \"gas alert\" come along & I had to warn all the chaps in the billet\n\nabout it. Then I went on to the road & watched the transport going by & it was not till 11.30 that I turned in. Before I could get to sleep one of the others brought in the Q.M. Lieut. who was somewhat merry & he sat on my bunk till about 1 A.M. telling all about the old Lemnos days & how we worked together etc much to the disgust of a couple of the other chaps. Was severely chaffed next day about it & accused of being inebriated especially as the O.S. overslept & made the parade late in the morning.\n","181":"\nWent to the reinforcement Camp Sick parade in the morning but only had a couple of cases nothing doing for rest of day except that a friend visited me. Received 7 letters which was good, also a parcel which was tres bon as they say here. Very quiet on the front except that some big guns did a bit of strafing this evening near by causing the windows to rattle etc. Fresh troops coming up, mostly Scotties, and heavy guns mostly long naval variety.\n","182":" August '16\nOrderly Sgt for the day. Nothing doing bar an inspection by the D.D.M.S. & usual duties.\n","183":"\nWent into 'Hazebrouck' for drugs & in order to take an officer to the eye hospital. Had a couple of hours there & drove the car back having dinner in \"Merville\" arriving back shortly after two, altogether a decent morning as a change. More rain late in the afternoon. Had a note from M.D. saying alls well with a P.S. which said – \"The military now assess my services at two thirds higher value than formerly\" meaning that he had been made a Corporal. Will see him with shortly if the huns leave him on his feet.\n","184":"\nOrderly Sergeant for the day. General duties throughout the day. At night went down to the Gas school to gather information. Learnt among other things that the casualties through a gas attack about a fortnight ago numbered 1000 with 300 deaths. They managed to catch our fellows charging over & unprepared all packed together. The officers responsible for such a state of thing were punished.\n","185":"\n\nOrderly Sgt for the day. A. Section bearers went out to relieve C Section at the trenches. Had leave during afternoon & with the W.O. & another Sgt rode to \"Merville\". Day was fine & horses good so enjoyed the ride. On arriving there we found a first class band playing in the square so stopped & had tea. Altogether a most enjoyable afternoon. At night read out orders which contained various courtmartial. One for desertion, striking an officer & using insulting language an Australian was condemned to be shot, the sentence being commuted to 5 years penal servitude later. Had he been an Englishman he would have been shot immediately.\n","186":"\nHad my first experience of running a man. Last night the officer saw lights in the billet after \"lights out\" & sent me to take the names of the culprits. I gave them the chance of one offering himself as responsible but no one came up to it so perforce had to run two who were mostly concerned. Each was awarded 4 days C.B. with punishment drill & no doubt went away with the conviction that\n\nI was an out & outer when all the time I was merely doing what I was told to do. But such is the way of the world. Had a fine trip in the afternoon. Drugs were required from a neighbouring town & as we were told the 1st Division were in the same place four of us went together with the hope of seeing them. We took the \"Ford' & I drove & had a real good spin the afternoon being finished off in good style by receiving a mail on my return. Have just received an order that all horses killed or die from causes other than from disease are to be sold to local butchers for human consumption. By later telegrams I see that St Col Pope has returned to Australia. He was in charge here at the stunt & owing to some blunder was relieved of his duties reverting to his rank from that of Brigadier General. Incompetence receives no sanction here.\n","187":"\nO.S. for the day. Nothing but the usual duties which were complicated however during the afternoon by heavy rain. Usual bombardment going on & plenty of rumours of an offensive.\n\nRumours concerning an early end of the war, the coming in of Roumania etc are floating about but I turn a deaf ear to everything not official altho. always something of an unbeliever this game has made me much worse.\n","188":"\nNews confirmed about Roumania declaring war & there is much joy thereat. 'Tis a sure proof that neutrals think we are winning and will surely influence things. Heavy rain all day & as I had no duties spent the time writing.\n","189":"\nChief duty of the day was to dig trenches to carry away the water. By means of 3 sticks I graded them off so that the men could dig them with the desired fall & not up & down as they generally do. Great lot of drinking going on in the corps & in fact everywhere men being \"full\" for days on end until their money runs out. The Estaminet would have been closed long before only they represent a big thing in the income & support of the local people.\n","190":"\nA day off although I did some pick & shovel work in the morning partly for exercise & partly because I wanted a certain thing done well. Left to themselves the men take no interest as fatigues are the bane of a soldiers life. 'Tis hard to understand why as we receive 6\/- a day to work & not loaf around. In the afternoon two of us rode into \"Estairs\" on horses & had a good time visiting friends. At night we had some good fun, the outing was like a tonic so we mucked up a bit in the mess throwing each other about etc. The Clerk refused to come to bed so we carried his bunk into the orderly room whereat he was very wroth especially as an officer saw it & enjoyed the joke.\n","191":"\nCarried on the trenching in preparation for wet weather. Had a little trouble with a couple of the men. The drink is getting some of them down & they loaf & pull on their mates a thing I never allow as I remember the time when as\n\na private I was often imposed upon. I made a resolve then that if I ever had the chance, I would come down on such blighters.\n","192":"\nChurch parade and distribution of ribbons won in the last stunt. It was carried out at the bomb school and all units of the division were represented. General Plumer was the head serang and we also had General McKay & Godley besides innumerable lesser lights. After the service the names were called out & each one marched in front of the General saluted & stood while General McKay read out the account of his action. Then the General pinned the ribbon on, & shook hands, the next advancing & taking his pace. Some of the deeds done were wonderful & almost unbelieveable whilst others were quite simple a D.C.M. being given to one chap for simply working well at a Dressing station. Still on the whole they were all well earned. It was an impressive ceremony, carried out with heavy shells screaming by & to the noise of a heavy bombardment & aeroplanes passing overhead a raiding party of about 30 passing at the time all a proper setting for the event. In the afternoon two of us rode to \"Armentieres\" & were well repayed for it. The place had been bombarded\n\nseveral times & buildings were destroyed in every street. Practically all glass windows were broken & holes were torn in the pavement the buildings around being scarred by the bursting shell. The town itself is rather a big one with a tram system & showed signs of being well cared for prior to the war. A large number of New Zealanders were buried in the cemetary the graves being well cared for. Parts of the town nearest the trenches were deserted but the major portion was still inhabited the women & children moving about as if the occasion was an ordinary one. Our horses were fresh & well cared for & both going & returning all the tow path of the river Lys we had a splendid gallop. It was actually my first experience of being on horse back at full speed & was very exhilarating.\n","193":"\nO.S. for the day the most of my time being spent over digging drains & trenches etc. The day was cool with little rain. Went for a long walk at night coming back so much refreshed that we started fooling in the mess. Everyday now we seem to get into holts upsetting bunks & things in general. The fact of the matter is that we don't get enough to do so have to vent out spirits in some way. In one 'melee' I was\n\nthrown out through a hessian wall landing on my back in a trench outside. We must be fairly hard as we get some awful bumps without any ill affects.\n","194":"\nA dull cold & wet day so much so that I was glad to do some digging.\n","195":"\nO.S. for the day. General fatigues all day preparing for the rainy weather. Heavy bombardment at night mostly with trench mortars. Taubes over twice during the day fragments of the shells fired at them falling all round us. They kept up at a great height.\n","196":"\nHad a free afternoon so rode into \"Estairs\" & had a very good time. The ride itself was first rate the horses being very fresh. Arriving there we stabled our horses & visited our various friends having tea in the town. After that we celebrated the outing with champagnes being joined by one of our officers for part of the time. Arrived home abut 8.30 feeling extremely merry & bright with things in general. My companion earned a bad name for us\n\nhowever by wishing to fight everyone.\n\nFriday 8th\nNothing doing bar ordinary regimental duties.\n\nSaturday 9th\nNothing doing bar shelling a taube over during the day but very high up\n\nSunday 10th\nO.S. for day. Received a visit from two of the 1st Field chaps & learnt all about the old unit. They had just returned from the Somme stunt & had had 9 killed & 30 odd wounded. Casualties to the 1st & 2nd divisions about 15,000 & a goodly number in the 4th and","197":" divisions so that there has been some wastage in our crowd lately. Practically all caused by shell fire, men being continually buried under debris etc.\n","198":"\nWrote a few letters during the day & made an attempt on French\n","199":"\nO.S. for day. Usual routine fatigues etc. etc. Mail coming along in driblets almost every day bringing something. Weather much improved again. A good bit of sickness about so much so as to call for a rebuke from D.H.Q. In orders they gave out, that a large number of sick would be put down to slackness of discipline & the officers would be held responsible. The local water is not fit to drink without being chlorinated although the local inhabitants seen to thrive alright.\n","200":"\nHad an off day so did some washing & mending. In the afternoon went for a ride on the w.o's horse & enjoyed myself immensely notwithstanding the fact that coming home I was caught in the rain & received a drenching. Had a good meal of fish caught in the river Lys. For some reason the fish appear to be dazed & float on the top of the water. As they float past with the current the chaps simply lift them out with nets. They are of all sizes & make a splendid dish for active service.\n","201":"\nO.S. for the day & was kept going all day having a very energetic orderly officer. Received a strange \"turn\" in the afternoon. As the rain was beating in on my bed one of the caps covered it over with a waterproof & coming in later it appeared to me as a shroud & a feeling of apprehension ran through me so much that I took it off & folded it up. Later on in the day the news of a forthcoming stunt being told me brought back the same feeling. For myself I do not fear the worst but for my mother. When I think what trouble I could bring on my people it almost makes me a coward.\n","202":"\nHad a day at dispensing again for a change. Nothing much doing mostly rec's for battalions. Very\n\ncold weather the night especially.\n","203":"\nO.S. for the day & was kept fairly busy. Had a bad headache most of the day one of my bad bilious ones. Drove the Ford up to the trenches at night & went up to the advanced dressing station. At present we are situated in some ruins made habitable by means of sand bags about 600 yds from the German 1st line of trenches. Here the wounded are dressed & carried back to where the Ambulance waits. 'Tis a beautiful spot surrounded by trees but could be blown out of existance with a couple of shells at any time. As it is a machine gun often rakes it with fire but the sandbags are sufficient for them. The road is screened off at different places with hessian. Coming back we passed a lot of waggons taking up ammunition quite a busy scene and as no lights are allowed. Very careful driving is required in the dark.\n","204":"\nHad leave for the day so borrowed a bike & rode to \"Poperinghe\" in Belgium in order to see Morris D. and other members of the A.I.S. who had just returned from the Somme. It was a most enjoyable ride the weather being good & the country looking fine.\n\nIt was my first entry into Belgium & I soon came on Belgian soldiers who were very English looking their Khaki uniforms helping the deception. The various names of villages etc were of great length & most difficult to pronounce. Altho' I failed to see Morris still I had an excellent day visiting old friends pedalling a distance of close on 50 miles.\n","205":"\nNothing of note the last few days except rain & mud. Days are noticeably shorter & weather getting very chilly. At night went into \"Estairs\" to see a concert at the 1st Cas. clearing station which was first rate. All the fellows were dressed in Peirrot Costume & the various gags etc hitting off various members of the unit were much appreciated. ","206":" brigade moving into armenturing during the day which I fancy foreshadows a move for us all.\n","207":"\nThings very quiet everywhere bar the Somme. Yesterday I attended the Gas school & spent a very interesting day. During the morning we received a lecture which described the gas, how used & its results etc. Before we managed to get anything like an efficient helmet we lost 15000 men. Now our new helmet is absolutely the last word enabling\n\na man to put it on in 3 seconds with immunity for 24 hours. During the afternoon we were put through the different forms of gas of great concentration. The tear shells gas we were in with helmets on & later when weaker without just to see what it was like. It has a strong pineapple odor & causes the eyes to water to an extraordinary degree. Next the chlorine gas. We went into trenches filled with gas strong enough to kill with one breath then had various demonstrations of smoke bombs etc etc. My cigarette case came out of the ordeal quite black.\n","208":"\nA very ordinary day of ordinary duties. Apart from the hospital of about 50 patients attended to by the tent division we have men working in the laundry, baths, advanced dressing stations & general fatigues. Putting up huts building stables etc being the order of the day. Good news continues to come from the Somme front. Saw an exciting & inspiring sight yesterday evening. A German sausage type observation balloon which had evidently broken loose floated over our lines at a great height. A few shots from an aerial gun failed to hit it whereupon several aeroplanes appeared on the\n\nscene one of which flying to a great height above the balloon did a beautiful spiral dive down to it, evidently firing into it. As he passed it someone jocularly said he's gone clean through it then as he passed it when climbing up again he's gone through the same hole. However the balloon then burst into flames falling to earth a mass of flames. 'Twas a grand sight, first a faint flicker of light which spread rapidly until the whole was sheathed in flame reaching hundreds of feet above, the downfall being greeted with a mighty cheer from the watchers\n","209":"\nVery damp & cool day which somewhat marred the divisional show (horse) & sports. Competition was very keen in best turned out vehicles most of the prizes being won by the A.S.C. They would have done credit to any coach builder of Sydney. Other events were best hacks, jumping etc etc all of which was first class & at times very funny. The mule jumping competition was the best in this respect several of them playing up somewhat. The show ended with a perfect exhibition of riding a buckjumper by a typical Australian.\n","210":"\nO.S. for the day with ordinary routine. At 1 A.M. the clock is to be put back which brings time back to normal there being a difference of about 1 hour.\n","211":"\nPlenty of rain the last few days which means mud everywhere, otherwise things much as usual. We now have new A.D. Stations to look after but very little is doing anywhere on this front. One night we gave a solid bombardment for 30 minutes quite like old time. The flashes star shell red signal etc made a beautiful scene & altogether 36 raids were made along this line each bringing back a prisoner or so to identify the troops in front of us.\n","212":"\nA week of ordinary duties with very little variation. Yesterday morning I went out early for a four of our positions in the trenches & also for a view of the front line positions. Two of us set out from the Advanced Dressing Station about 8.30 A.M. arriving back about 12 P.M. having walked about 8 miles mostly through saps. Things were quiet so had a good look at \"No mans land'& the German trenches both through\n\na periscope & with my head over the top. A bare 200 yds separated them from us, it being a wonderful thing that for over two years the two lines have sat & watched each other across a narrow strip of neutral land. The country itself at the trenches is of course all neglected except for saps which lead everywhere. The front line itself appears to be a disorderly heap of sandbags bleached white by the weather. At one spot we hold part of a large convent the remainder being in the hands of the Germans, nothing remaining now of course bar bricks & ruins. Fleur Baix just behind the lines is shelled regularly but still holds a few people. A telegraph post there has a hole drilled right through it by a shell fragment. Estaminets have all been closed in this area for some reason not quite clear. Diphtheria being about is given as one reason, the need of our move being kept quiet being another. We are moving at last today being spent packing up. The Somme possibly is our destination but 'tis not known for sure\n","213":"\nThe main Sailly road now being screened off from the Germans. Green hessian & brushwood being the materials most used. No doubt with winter coming on the trees become bare which makes observation much easier. The Estaminets are open again having been closed for the purpose of making the people disinfect their homes & also to instruct them in keeping the glasses and things clean. New Zealanders are taking over from us & thus reap the advantage of all our improvements. We have trenched the land built Cookhouses & in general prepared for the winter & now have to leave it. C'est la guerre.\n\nA lot of our gear we dumped into ordnance just taking as much as was necessary the packing up luckily I was entirely free from for the first time however. My own sections stuff I had all ready some weeks beforehand. We marched out at 2 A.M. & reached \"Outtersteene\" about 8 miles about 5 oclock only to find that by some mistake our billets were not ready, either we were a day early or the New Zealanders were a day late. We were dumped into a field & left to shiver till about 8 o'clock when billets were found for the men all being fixed up by about 9. Several caught colds, I myself did as being in a sweat when we stopped & then waiting in the cold biting wind. Nearly half the unit were drunk. I\n\nhad a bottle of rum in a bag but some of the beggars pinched that also. It was wonderful that no one was run in over it but the officers kept out of the way & allowance was made for the conditions so nothing came of it. I managed to get quarters in a house & slept splendidly in a bed on the floor\n","214":"\nO.S. for the day. Nothing much to do except fixing up billets for the men during the day. Owing to some of the chaps playing up we had to arrest 6 & put them under guard. It had the desired affect as the remainder were more careful. Beer wine etc is far too easily obtained & many men are never satisfied unless they are continually boozing & making beasts of themselves causing more trouble than they are worth. The place we arranged for our mess turned out splendid. They knew all the 1st Field chaps so we were tres bon with them. All the people speak English well & tis a regular home, sitting by the fireside & yarning. This particular crowd are much superior to the females we have met previously, we usually come in contact with the roughs so that this time was a vast difference & the more enjoyable as one\n\nof the girls reminded me very much of Fanny. Then in the house I slept in, the people were very jolly, played cards etc all of which they had learnt since the war. They knew more games than I knew of almost & could do any amount of card tricks. This particular village has a great name amongst the troops.\n","215":"\nManaged to get leave to go to 'Poperinghe\" for the purpose of trying to find Morris. When I arrived there they told me that the 18th had marched out that morning so I set off in pursuit catching them at dinner time only to learn that Morris was not amongst them. I found out that he was catching the 1 oclock train to 'Wisque' near St Omer to go to training school so perforce had to hurry back. I would not have done it however as I was dead tired were it not for a motor lorry to which I clung, it took me along at about 15 miles an hour over the cobbles but I hung on like grim death as my only chance of seeing the boy. I eventually reached the station & to my great joy had the pleasure of a 30 minute's yarn. He was then a Sgt & was recommended for a commission. It's cheering to learn\n\nthat they can appreciate worth when they see it. I then set off home arriving in time for tea having done about 30 miles but on a very heavy bike. Spent a good evening with the villagers yarning cards etc quite homelike.\n","216":"\nAm troubled with a cold in the head but nothing serious. Took some patients into \"Estairs\" but failed to see Carr he being away. Wrote a few letters in the afternoon singsong etc at night, our last in the village I fear. Have been troubled with presentiments of trouble lately, in fact ever since the middle of last month. I honestly do not feel fear for myself 'tis for the suffering my loss would cause at home. I have been able to go anywhere with pleasurable feeling rather than fear or apprehension tho' will admit when in danger as from being shelled direct to feeling fear then. No one living can do otherwise with death flying all round him. Bravery consists of a person by will power conquering that fear & carrying on. One can become callous to a certain extent perhaps but no one can stand still in cold blood & be shot at without a feeling of fear. Voting for conscription has been postponed for some reason or other.\n","217":"\nLooked after sick parade & then took patients into \"Estairs\" picking up some from the battalions. Managed to see Carr & brought him back so that he could see Cpt . This was to be our last day in \"Outtersteene\" our stay being very enjoyable so I was very sorry to leave. Actually 'tis my first experience of being in a home since I left Sydney two years ago. The people where I had my meals actually cried when saying goodbye & loaded me up with apples. Nothing was too much trouble for them, always making coffee & doing things for our comfort. At 3.30 P.M. when we fell in to march off it started to rain but luckily did not last too long. We had about 4 miles to march to the station at \"Bailleul\" but had to wait till about 8 P.M. till we could entrain, during which time we did a push on the road having a snack for tea. By 9 o'clock we were on our way but did not travel all night restarting about daylight & reaching \"Pont Remay\" about 9.30 AM. I slept well in great coat & one blanket, 5 of us being in one small 3rd class compartment.\n","218":"\nAt 10.30 we managed to have a little breakfast of bread & jam. Still being in the carriage the train having backed into a siding. By 12.30 the transport was off the train & ready for a move so we left the train & set off\n\nto march \"Buigny l'abbe\" a distance of about 5 miles which seemed more owing to a couple of big hills to surmount. \"Port Remay\" seemed a very decent little village & the country was splendid, very open, very much like England in fact. Our destination proved a disappointment however, the place was dirty & the people most inhospitable a great contrast to our last place. They refused to give water to the cooks & locked the pumps & did not seem to care whether we took their billets or not. To buy food was impossible eggs etc being almost unknown. We managed however to fix up accomodation & even got a room for a mess where we had a great singsong at night to brighten up our spirits. Witnessed a novelty here for the first time – threshing wheat by a horse working a treadmill. Hour after hour the old horse plodded along well earning his keep. Later I saw an old chap threshing wheat with a flail – a length of wood about 2 ft long being tied to a handle.\n","219":"\nSpent a good night on the bricks & had a breakfast of bread & jam all other rations having been raided during the night. Our transport left early this morning & tis a pity they have not gone for good, they cause more trouble than all the unit put together. Voted on Conscription this morning which I sincerely trust will be carried. Went for a walk in the afternoon to \"Saint Riquier\" a few miles from our village & spent a good time. The Cathedral was well worth seeing, dating from 628 A.D. The inside was of white stone which made a very bright affect. The village\n\nitself is a very old one & contained relics of several centurys ago. Had tea at the only hotel in the show & well enjoyed it, being an omelette to start with, then a steak beautifully cooked & some English beer. Had a game of \ndraughts\n billiards before leaving for home.\n","220":"\nReveille at 5 A.M. & marched out at 6 after having a couple of slices of bread for breakfast. My pack was some weight now having an addition of 3 blankets. We soon picked up the brigade the column of marching men stretching as far as I could see. The morning was very cold a heavy frost being on the fields. After passing through \"Ailly\" we reached the busses which were to take us on, having done about 10 miles. The busses to the number of 250 all French, about 18 men to each then took us via \"Mouliers\" \"Flixecourt\" a fair sized town then \"Ameins\" a very large town to within about 4 miles of \"Dernancourt\" where we disembarked completing the journey on foot. The trip was bitterly cold & we had nothing to eat, on reaching \"Dernancourt\" we were put into some awful billets & had to fossick round for some tucker none being provided. We turned in about 7.15 4 of us together for warmth. The scene was wonderfully interesting the traffic being absolutely enormous, troops being relieved, new troops coming in, thousands of motors\n\n& horse vehicles all going through a sea of mud. A large number of German prisoners were employed on the roads mostly a poor lot of men, the worst of them being shown our chaps perhaps to demonstrate how easy they might be overcome. All night long I could hear the motors going & trains shunting there being no cessation in the traffic. The weather was bitterly cold & the men with only one blanket had a bad time. Had breakfast at 8 AM next morning\n","221":"\nWe left Dernancourt at 11 A.M. wending our way through the everlasting mud & being blocked every few yards by the huge transport on the roads. Motors were passing in their thousands without exaggeration & we, the new troops marching in the same time the old troops coming out made a tremendous mix up We passed \"Albert\" & went on to \"Fricourt\" now nothing but a name, no buildings now standing. The railway extends pass here to the trenches. Our march of 4 miles took us 3 hours to perform owing to the traffic. Here I had my first view of the German dugouts we had read of. The entrances went down very steeply to a depth of 20 ft or more into perfect rooms lined & floored with wood. In many they were lined with green & red cloth picturing framing round the sides & Electric light throughout, absolutely. luxurious. These dugouts were plentiful many extending into one another, all dry & fitted with beds, shelves, pegs etc.\n\nSaw a few English shells lying about, duds, notably some 9.2 ins howitzers, enormous things & lucky for somebody that they did not burst. Slept at night in one of these dugouts\n","222":"\nHad breakfast about 8 A.M. & marched out at 11 A.M. After reaching a further spot about 2 miles on, which took about 2 hours owing to the traffic we pitched camp on the hillside to await further orders. Our bearers had already preceeded us & were a couple of miles further. The weather was bitterly cold & we were exposed to the full affects of it. 'Tis a wonderful eye opener & object lesson to come here & see the advance really made. Houses trees & all levelled to the ground which is torn up every few feet by shells. Grenades, shells & shell cases litter the ground everywhere. Observation balloons are plentiful no less than 13 to be seen here & aeroplanes are up in their hundreds. At night slept under a tarpaulin shelter but the ground being wet did not tend to make it warmer. Heavy bombardment at night & a few enemy shells went over our heads & landed nearby. O.S. for the day\n","223":"\nA very damp cold day. Pitched a few more tents & took in a lot of sick during the day mostly colds due to exposure. For myself I finished off some letters to catch the first available mail & later went for a walk through the remains of a wood nearby. It was in an indescribable state of destruction being littered with all the\n\nrefuse of battle. Vast dugouts & trenches ran in all directions, many of which were destroyed. Bombs shells, cases, duds etc were everywhere most noticeable being a few 9 inch shells of our own which had not exploded. Shell holes were so close as to intersect one with the other. This was the wood which delayed our advance after the taking of \"Fricourt\" & I could well appreciate its strength. Not a great deal of shelling & very few are our way. The 12 inch naval gun alongside us spoke rarely but is easily the most noisy of any of the guns.\n\nTuesday 24th Oct.\nSpent a very cold night & woke up to find it raining, with mud everywhere. After breakfast decided to take a run out to the front & see what things were like so set off with a pal without saying anything to the others. Never will I forget the awful condition under which our chaps labour. The road was a sea of mud, thousands of men doing nothing except scraping & sweeping off the mud, laying huge logs or tree trunks, filling holes with stone & otherwise repairing it. Practically all the bricks of the destroyed village have been used to make the roads & metal is brought up as fast as possible. Brushwood wired together in long bundles is also used, everything possible in fact being pressed into service. Wagons, limbers etc had eight horses a piece & even then could not get along & I witnessed several bogged also the animals themselves. In places they would sink to the belly, I myself was soon covered in mud, in one place sinking in mud up to my knees. Fine weather would be worth millions to the British. From a\n\nrailway siding Ammunition limbers were loading shells, also thousands of pack mules long strings of which could be seen threading the country side carrying shells in baskets carriers to the guns forward mostly 18 pounders. I found the 8th Field Amb at \"Thisle Dump\" with only a couple of tarpaulin shelters & alongside were 4.7 Howitzers by the dozen firing away merrily. What a position for a dressing station & for wounded – but the only one available. Further on I came to our bearers, all three Ambulance working together. They were fairly comfortable, in dugouts but had an awful carry of 3 to 4 miles with wounded across the open, doing 8 hour shifts more when necessary. To walk without falling occasionally is impossible owing to the fearful state of the country. Several \"Caterpillars\" were about one of which I saw drawing a huge sledge showing wheeled vehicles impossible in that particular part. Bodies, both our own & Germans were still unburied in this region. Why 'tis hard to say but it all points to the terrible strain this offensive is. Even with the weather fine the traffic can hardly get along at more than a snails pace, a man walking by himself can easily out distance it. How it gets along now at all is a mystery. I know of one case where a motor Ambulance took 15 hours to do 4 miles when returning for wounded. Towards the end of the day I saw our","224":" Division arrive & saw several\n\nold faces. More dispiriting circumstances could hardly be imagined. They were arriving in the wet, mud of course everywhere & knew that these conditions would last until they were relieved. Billets there were none, as all houses were levelled. A few dugouts existed, not nearly enough for the number of men, hot meals were out of the question for the time & the weather was bitterly cold. 'Tis war with a vengeance, cruel beyond human imagination but evidently not beyond human endurance seeing that it still goes on. Who can stand the strain longest is the question, it will decide the winner. I have no doubts myself. Had I the violent literary qualities which literary men call realism in my pen, pages could be filled on the scene before me, but I can only put down a few thoughts which cross my mind at this moment\n","225":"\nSixteen of us, C section, ordered to proceed to the Corps dressing station at \"Becordel\" to help the","226":" Field. We are then only in this stunt evidently to aid the other ambulances. About 9.30 we marched off about 3 miles distance & reported for duty. This station has been used I fancy ever since the first advance & is well laid out in a good position. I have yet to earn however how the wounded manage in a stunt, at present it seems impossible to deal with any large number, but expect that arrangements are made at the time suitable. Personally, I was installed in the dispensary & fear that there will be little chance of me doing much.\n","227":"\nVery little doing in the station but we have been warned to be ready for 1800 cases within the next couple of days. As only stretcher cases come here 'tis evidently going to be some push. A heavy bombardment has been going on preparatory to it & the enemy also has been busy. Today we had some cases in \"gassed\", from shell gas & some were serious. It still rains on & off & the place is a perfect quagmire.\n","228":"\nHad one fine day out of the last four so that the place is still swimming. The stunt was postponed owing to the weather but rumour has it that it comes off tomorrow. Things have been very quiet, very few cases coming in & the shelling has not been intense by any means. This morning a few enemy shells landed just behind near a battery. Sunday I went to \"Maricourt\" for drugs passing through \"Albert\" which is much knocked about especially near the church whole areas being devastated. A peculiar aspect of the church is the figure of the Virgin on the spire which has been hit & now hangs down as if going to fall. French people say that it will fall the day peace is declared. A shell might alter the prophecy however. Had a puncture on the journey & ran to \"Heilly\" for repairs where the C.C.S.'s are, two splendid places with nurses.\n","229":"\nRain & still more rain, mud & still more mud. Went to look for a canteen & got lost in a sea of mud. As far as I could see was mud, feet deep in some places & yet horses were picketed out in it & men had to work in it men horses & harness & wagons were enveloped in it. Had a look at Becourt & Fricourt again & came on some of the graves of those killed in the first advance. They were buried in shell holes numbers according to size of hole, in one were 30 another 15 & so on. Wednesday night we had a visit from some Taubes who dropped several bombs 5 of which burst in rapid succession, casualties were few however. Fires were put out & lights quenched & the searchlights got to work with the guns but with no results. On the whole things are quiet, the line being held while the artillery do the strafing.\n","230":"\nLast two days fine but cold with rain during the night. Went for drugs to \"Corbie\" about 15 miles away also took patients to the C.R.S. \"Corbie\" is quite a decent place with a good number of French soldiers as well as our own. Had tea there & did some shopping arriving back about 9 P.M. Roads breaking up alot & large gangs of Germans were employed on them. The huns bombarded our headquarters today & played up with things. How they learn the position is wonderful & then to score hits at about 12 miles range seeing that very few taubes ever come over. During the day aerial\n\nactivity was great a couple of Taubes coming over. The sky was alive with planes in all directions. At any time looking in any one direction one could count anything up to sixty in number. Our bearers relieved today & mighty glad they were too. They found the best method of moving patients in fact was to draw them along on sledges over the mud. One horse & two men to a sledge. Casualties were small owing to shells buring themselves in the mud. The burst going straight up, shrapnel accounted for what there were.\n","231":"\nAnother two days of rain & mud. Our chaps, the","232":" &","233":" divisions, went over after some trenches & the result is still in doubt. Casualties were not heavy considering the job but they will all mount up. Conditions very severe indeed for all ranks. Had a few Germans through some of whom spoke English. One evidently very frightened said, God strafe England, no! no! England very good. 'Tis a sight to see how the chaps go for souvenirs off these chaps, cutting of their buttons & such like. In fact with our own fellows, if a chap gets wounded & has a particularly good pair of boots or such like, he is lucky if he gets far, someone will take them off ostensibly to make the patient more comfortable. I heard a great tale of woe from one fellow, he saw a man being buried with top boots on & was unable to interfere to save them. 'Tis a callous life\n","234":"\nHad some excitement last night. We had several taubes over which meant a few bombs dropped. It was an ideal night, moonlight but with low lying clouds & the searchlights were rarely successful in spotting the raiders. However the guns blazed away whenever possible. One bomb caused a terrible explosion & although some distance away caused the ground to shake & myself to lean back. What damage was done it is impossible to find out but I think an ammunition dump was blown up judging by the fearful explosions, the sky being lit up occasionally for miles. It has been raining all day & bitterly cold.\n","235":"\nHeavy rain last two nights but fine during the day. Great aerial activity shewn on both sides several taubes coming over, rather a rare occurrence these times. Bombardments increasing in intensity & the enemy evidently fear some by move. Our stunt resulted half satisfactorily, we not being able to hold the German line yet we dug in so close as to prevent the Germans from regaining their front line. Counted noless than 31 observation balloons up on our side today. Still unable to obtain papers as civilians are not allowed here & one cannot get back to the towns\n","236":"\nHeavy bombardment last night & taubes over again. Nice sunny day quite a change & very welcome. The raid a few nights ago evidently was successful as in todays paper the\n\nHuns claim to have blown up an ammunition dump our reports however making no mention of it.\n","237":"\nHeavy bombardment which continued all night & the day following. Just as I finished the foregoing they started to shell our position, several falling in quick succession & several fragments fell on the roof of the tent. 'Tis to be hoped that it doesn't last too long as tents are not exactly shell proof. Last night several taubes were over & I saw one plainly. They used their machine guns & caught one man at least on the roadway. Have heard nothing authentic about any damage they did but plenty of rumours.\n","238":"\nLearnt today that the shelling of last night found the weak places of the","239":" Many of the officers & men appear to have bolted for neighbouring ditches etc leaving their duties, & had wounded arrived at the time they would have received no attention, a very grave matter indeed. Certainly the majority had never been under fire being mostly \"deep thinkers\" but still to leave a duty post is unforgiveable. The nearest shell fell 100 yds from my tent being apparently a 6\" H.E. & shook the place alot putting out the light I was reading & writing by. I sincerely hope they don't start again as I cannot shake off the feeling I mentioned a little way back. Don't know whether I'm a fatalist or not but this thing has me, luckily without spoiling my nerve, my chief feeling being one of sorrow for the trouble I would cause at home. Should all be well my faith in premonition will receive a shock\n\nbut until then, in cases such as last night I ask myself – well I wonder if it's coming now. The bombardment of the front has continued all day heavily, a constant rumbling going on, & seems to point to an attack. The taubes the other night played up with a C.R. Station about 5 miles back killing 6 & wounding about 37.\n& also bombed Amiens killing 9 & wounding about 23.\n","240":"\nBombardment still continues heavily the huns dropping a few into \"Albert\" occasionally. Have had two interesting visits to a German prisoners camp. We send an M.O. daily to attend the sick so I went with him. An interpreter was found in a M. student who spoke English very well. From him I learnt some very interesting things & must admit several of his views on the war coincided with my own. He admitted a hatred of England as he considers us as cousins who had turned dog on them when fighting a common enemy the Slavs. The Russians he considered as poor fighters, Austrians, both good & bad, Turks good when officered by Germans, French as on the good side, possessing plenty of \"Elan & the British as the best, always making a fight of it. The Italians he despised both as fighters & for turning dog on an ally & fighting against them. He objected strongly against evil things being said of the Kaiser, looking on him as a really good man & pointed out that they never said a bad word concerning our King George. He was intensely proud of being a German\n\nbut considered that the war would end in a general peace without either side winning. In upholding Zeppelin raids etc he said – that our blockade was aimed against the German people it had not affected the food of the army but of the general population so raids on England were simply reprisals. They recognised the great work England had done in this war & gave Kitchener credit for the Army & confessed it to be a great army but considered there own better trained. The whole war would long ago have ended and would end at once if England said the word, is a general belief in Germany. Speaking of their defeat on the \"Marne\" he blamed Italy for allowing France to withdraw her southern army from her borders & to throw them into that battle. By Italy thus aiding France he attributes the duration of the war. Of his treatment as a prisoner he was well satisfied but thought it a hardship that they were not allowed beer. Speaking of the medical service in the two armies I gathered that ours had nothing to lose by comparison especially that in the Field. In dentistry we easily lead very little being done in the Field in their army. On my return I was toed off to a Dressing tent as the anticipated attack had come off & the wounded were coming in very freely\n","241":"\nWas kept going all night doing dressings of wounds the most time\n\nwithout an M.O. Extracted a shrapnel bullet from a mans foot, the first I had done by myself altho' I had assisted at hundred. Had a few Germans through also. Men very dirty & muddy altho' not so bad as those of a week previous. All were pleased at a victory but the majority appeared to blame our own artillery for their wounds. Finished up about 7 A.M. had breakfast & then went off to the German Camp. Had an interesting discussion again on interesting topics. He defended the murder of Capt Fryatt as he contended that he had acted as a pirate attempting to sink a U boat, a war vessel at a time when he had been ordered to hove to; he likened the case to that of a civilian shooting a soldier. Nurse Cavell he held was a spy so had to be shot. The destruction of \"Louvain\" etc were reprisals against the people for shooting at soldiers. Gas attacks he held were less severe than artillery as a remedy could be devised. The Cossacks & French blacktroops he stated, they were under orders not to capture but to kill, the one for murderous assaults on women in Eastern Prussia & the other for cutting the throats & mutilating the dead after battle. Indians on the other hand were well treated & looked after at the expense of the Kaiser. In the afternoon I went to \"Albert\" to draw stores (drugs) & had a good look at the church. Certainly it was a fine building & beautifully finished inside but was sadly smashed up by the shells. The image on the tower still hangs in a threatening attitude. Did not feel unduly tired after my 36 hours spell of duty except when sitting alongside\n\na fire at which time I became sleepy.\n","242":"\nNo rain for the last four days so the roads are beginning to dry up. Heavy frost the last two nights & the ground is frozen hard. Our olive oil is frozen & water in the tent had \nwater\n ice thick on top of it. Bitterly cold, the wind almost cutting one in half. Have been visiting the German camp each morning & today inoculated 16 with Antitoxin having had two cases of diphtheria. Good news going concerning the front the peculiar part being however that we have to wait for the London papers before we know what has happened altho' we are right on the spot. 'Tis of no use whatever to ask the wounded, they know nothing of results 9 times out of 10 & when they do know anything 'tis generally distorted. German planes still fairly active but we have brought several down. Today the German admitted our ascendency in the air, even going so far as to say he himself & well as infantry in general were dissatisfied with it. Speaking of a case when they had bombed a hospital of ours, he said we were to blame as they were insufficiently marked. In Germany he said large red crosses were used which were illuminated at night. He spoke about our officers being so friendly to the men quite the opposite to their own who were so proud. Asked whether this was not better so, he admitted it was so, if possible, but he thought that it did not tend to discipline & efficiency & put it down to ours being a young army. Speaking of souvenirs again he said he could not understand our wanting them & mentioned that an officer had cut a button from his tunic, an awful thing in his eyes.\n\nRing out old shapes of foul disease,\nRing out the narrowing lust of gold,\nRing out the thousand wars of old,\nRing in the thousand years of peace.\n\nThoughts on a life ended.\n\nWhat I spent, I had!\nWhat I saved, I lost!\nWhat I gave, I have!\n","243":"\nHad snow yesterday the first of the season & also the first proper fall I had seen. It was indeed a pretty sight & lasted most of the day rain spoiling it in the afternoon. It was of course bitterly cold & when the thaw came the mud was as bad as ever. Cases now coming in by train as roads too bad for cars. A large number of sick & trench feet cases also coming forward.\n","244":"\nA fine day once again. Went to the German camp for the last time & had a last talk. Had the \"Hymn of Hate\" recited to me & translated, it is certainly a powerful poem but of course sadly mistaken. On my leaving they wished me the best of luck during my visit to the trenches. On reaching camp again, I heard of a move. We were to pack up immediately & join up with our own crowd in order to go to the Advanced Dressing Station. Marched out at 5 P.M. met A & B Sections & continued on to some huts where we slept the night. Plenty of mud but otherwise fine.\n\nConcerning Carlyle\nThe furrowed, rough hewn, rugged face;\nThe lank, ungainly, shrunken form;\nThe runner weired of his race;\nThe vessel battered by the storm.\n","245":"\nMarched out at 8 A.M. for the A.D.S. & had a very stiff march altho' only about 4 or 5 miles. The mud was very stiff & tenacious & made walking very difficult. We were relieving the Guards division & were struck by their particularly fine physique. The A.D.S. was on a new sector, the \"Le Transloy\" & closer to the line than the last & was also run by the","246":" the other Ambulances being attached to us. Huts newly built & hidden by branches were in use, situated in a valley & altogether a very comfortable place, that is if the enemy leaves us alone. Spent the day in fixing things up & went on night duty at 8.30 for 12 hours. Ground everywhere pitted with shell holes, so close as to intersect.\n","247":"\nOn night duty doing 12 hour shifts. Not much doing as a rule in the way of patients but plenty of noise from the guns, two 6\" naval guns being within a 100 yds of us. The Huns send a few over occasionally but so far none very close. Roads in a terrible condition & travelling very hard on the patients. Have not seen much of the surroundings owing to sleeping all day.\n\n"}}