{"Document Name":{"0":"Diary_0205","1":"Diary_0205","2":"Diary_0205","3":"Diary_0205","4":"Diary_0205","5":"Diary_0205","6":"Diary_0205","7":"Diary_0205","8":"Diary_0205","9":"Diary_0205","10":"Diary_0205","11":"Diary_0205","12":"Diary_0205","13":"Diary_0205","14":"Diary_0205","15":"Diary_0205","16":"Diary_0205","17":"Diary_0205","18":"Diary_0205","19":"Diary_0205","20":"Diary_0205","21":"Diary_0205","22":"Diary_0205","23":"Diary_0205","24":"Diary_0205","25":"Diary_0205","26":"Diary_0205","27":"Diary_0205","28":"Diary_0205","29":"Diary_0205","30":"Diary_0205","31":"Diary_0205","32":"Diary_0205","33":"Diary_0205","34":"Diary_0205","35":"Diary_0205","36":"Diary_0205","37":"Diary_0205","38":"Diary_0205","39":"Diary_0205","40":"Diary_0205","41":"Diary_0205","42":"Diary_0205","43":"Diary_0205","44":"Diary_0205","45":"Diary_0205","46":"Diary_0205","47":"Diary_0205","48":"Diary_0205","49":"Diary_0205","50":"Diary_0205","51":"Diary_0205","52":"Diary_0205","53":"Diary_0205","54":"Diary_0205","55":"Diary_0205","56":"Diary_0205","57":"Diary_0205","58":"Diary_0205","59":"Diary_0205","60":"Diary_0205","61":"Diary_0205","62":"Diary_0205","63":"Diary_0205","64":"Diary_0205"},"Date":{"0":"unknown","1":581.0,"2":582.0,"3":583.0,"4":584.0,"5":588.0,"6":589.0,"7":590.0,"8":604.0,"9":605.0,"10":609.0,"11":617.0,"12":621.0,"13":622.0,"14":623.0,"15":624.0,"16":625.0,"17":627.0,"18":628.0,"19":629.0,"20":630.0,"21":631.0,"22":657.0,"23":658.0,"24":659.0,"25":672.0,"26":676.0,"27":677.0,"28":678.0,"29":679.0,"30":680.0,"31":681.0,"32":683.0,"33":685.0,"34":686.0,"35":687.0,"36":688.0,"37":689.0,"38":702.0,"39":708.0,"40":709.0,"41":713.0,"42":715.0,"43":716.0,"44":717.0,"45":732.0,"46":754.0,"47":782.0,"48":784.0,"49":785.0,"50":787.0,"51":788.0,"52":798.0,"53":801.0,"54":802.0,"55":803.0,"56":806.0,"57":825.0,"58":826.0,"59":827.0,"60":828.0,"61":829.0,"62":833.0,"63":834.0,"64":835.0},"Entry":{"0":" \n\n","1":" went to Barracks & had blood test.\n","2":" enlisted having been declared free from fever. Received leave for a week –","3":"\n\nF. Astill\n","4":" George St.\n\nLavender Bay\n\nN. Sydney\n","5":"\n\nBarracks at 7 o’clock. Reach, Liverpool at 3 o’clock. Housed with rest of R3 Coy on Villa No. 21. Issued with four new blankets, great coat, waterproof & tick. Supper 5.30 – Bread & marmalade. Concert in Methodist Hall during evening.\n\nA week’s training & drill & we succeeded in getting a transfer into the","6":" Rein. of the","7":" Batt. After some trouble received uniform & rifle & at 5.45 Monday we entrained for Sydney & by 9 o’clock were embarked on HMAS Runic. Sailed at 3 oclock. Seas very calm until Wednesday morning when rounding Wilson’s Promontory we struck a heavy head wind. 5.30 arrived off Melbourne\n","8":" sees us still sailing westward, with a very heavy sea & head wind. The wind seems to be a very strong combination of the Roaring Forties \nshrie\n Piping Fifties & Shrieking Sixties, as it bursts upon us with fierce squalls containing all those musical sounds, driving the more settled stomachs to the stinking security of the mess decks, & the weaker ones to the sides to contribute liberally to the fishes, & be drenched by the heavy seas breaking aboard. So far the food has been good & it is with pleasure that I chronicle the appearance of sausages, eggs, bacon, kidney, pineapple &c. We have had little drill, but there is every promise that as soon as we leave the Bight with its rough seas behind that we will not be complaining.\n\nMany & wild are\n\nthe rumours circulated. Already there is a monstrous fleet of submarines awaiting our arrival in the Red Sea, & anxious to put this flower of Australian soldiery to the bottom. To escape this we are to disembark at Aden & proceed by train! We have had one man murdered by the “wireless\" agents; but public opinion has succeeded in giving him his life again, so that by now he is suffering only from the effects of an operation from appendicitis.\n\nOn","9":" after a week’s sail, we sighted the Leeuwin & by 3 o’clock the continent of Australia had dropped from view behind the watery horizon. The last two days had been beautiful, & the sea calm, but scarcely had we entered the Indian Ocean than we ran into a squall fiercer than anything\n\nexperienced in the Bight. The seas broke in board & the air was filled with flying spume which drove all below.\n\nThe following days were rather rough but by the","10":" we had run into the warm calm weather of the mid Indian Ocean, which brought the men up on deck with their hammocks at night. Awnings were placed over the decks, & light clothes superseded the heavy tunics & coats.\n\nBoxing competitions & musical evenings served to break the monotony of the voyage. Gambling which had been indulged in to a rather great extent was put down, & several offenders lodged in the guard room. It had been the practice of many of the soldiers not satisfied by the food issued on the troop decks, to buy delicacies such as ham & eggs, fruit,\n\npies, fish & chips, chicken &c. from the cooks. This \nbecame so\n reached such dimensions that it seriously menaced the \nship’s stores\n holding out of the ship’s stores & had to be put down.\n\nDay after day we sailed on through smooth seas, under a burning sky with scarce a breeze. Several attempts were made to relieve the monotony of the trip. Boxing & swimming were indulged in, concerts & dances held at night so that with one thing & another the time passed quick enough. On Saturday evening at 9.30 we crossed the Line at 80° E. The sea was like glass, with not even a ripple.\n\nChief among the rumours current on the","11":" was one that certain soldiers are to disembark at Aden to garrison it. This has been borne out to the extent that they have taken the names of all\n\nRabaulers on board for this duty. Just my luck.\n\nOn","12":" at about 2 oclock we passed between Cape Gardafui & the island of Socotra & entered the Gulf of Aden. When Lights Out blew the wind was blowing at hurricane force & a heavy sea running but when we awoke on the","13":" the sea was like glass. Early in the morning we passed several fishing dhows, which gave promise of sighting land. These dhows are small light craft with one sail, of a peculiar & purely Oriental cut.\n\nOn Saturday the","14":" we awoke expecting to sight land, but with the exception of several liners & steamers, nothing was visible until about ten oclock when a mountain was discerned some distance in front on\n\nthe starboard bow. This proved to be portion of the coast of Arabia on which Aden is situated. When we arrived close enough to see distinctly, it was a scene of solemn grandeur, & of utter desolation which met our gaze.\n\nSheer up from the waters of the Strait of Bab-el-Mandeb rose the cliffs, the rocky barren peaks scarred & torn by monsoons, beaten into all manner of shapes by the elements into sharp dizzy pinnacles, their tops swathed in the shimmering haze, into table tops, the sides of which fell away in steep precipices of long steep slopes \nthe sides of which\n were covered with loose masses of talus & fallen basalt. Round the foot of the cliffs in places heaps of sand, in others shallow caves receding in from the sea. This then\n\nwas \nwhere\n the southern Gibralter. \nwas\n The first sight of habitation was a house or two near a signal station; then a reservoir on the crest of some seemingly inaccessible hill; a wireless station perched on the top of some beetling cliff. Rounding the western point of the cliffs we beheld portion of Aden itself. A few strange looking houses with red roofs beside a broad harbour sheltering several steamers & dhows. Far away to the north was the low long coast with its trees & verdure in utter contrast to the volcanic outcrop we had just passed.\n\nAll the afternoon we ran westward along the \ncoast\n strait, with the Asiatic coast visible to starboard. It is a barren inhospitable coast\n\nin the extreme – low level stretches of land being alternated by hilly outcrops of evidently volcanic origin.\n\nAll through the day numerous ships were passing us & when night fell, cool for these parts, they presented a rather beautiful spectacle. One going by began to signal – “V-O-N M-O-L-K-E s-u-n-k i-n t-h-e B-a-l-t-i-c\" read one of our men (Charles White – Pommy out of Bath – several years service on Indian frontier). It was the first news of any kind we had received since our departure, & we were wildly elated. Some more scrappy messages were picked up & the ship passed on its way. Early in the night we passed Perim & entering Hell’s Gates gained the Red Sea.\n\nOn","15":" we obtained our first view of the African coast, majestic in its desolation on our port bow.\n\nAfter passing several barren islands land again disappeared & we were once again surrounded by a glassy sea covered by a yellowish scum. Locusts, doves & a quail came on board together with other denizens of the desert. The heat of the Red Sea is of course proverbial but it quite exceeded the most sanguine expectations. The men lay about in the steaming air pouring perspiration. The animals were like dead, the tar in the planking bubbled & boiled, & any iron exposed to the sun was heated to burning. Add to this the air was filled with a thick cloud of desert dust which seemed to make things hotter.\n","16":" all Rabaulers on board had their photos taken.)\n\nOn Wednesday","17":" we entered the Gulf of Suez with the coast of Africa & the Pen. of Sinai both high, rugged & barren on either side. Early on the morning of the","18":" we ran into Port Suez with its collection of steamers, dhows, motor boats & dredges. On all sides of the town stretched the dazzling desert its \nedge\n distant edges covered with the \nhaze that\n shimmering haze that had been present with us ever since we entered the Red Sea. The town itself as far as could be seen consists of numerous flat topped buildings, scattered \nof\n over the water frontage. The entrance to the canal could be clearly made out with its edging of green trees.\n\nThere was a great rush for the newspapers brought on board by the Arabs.\n\nOn ","19":"\n","20":" we landed at Port Tufik & left by the E.S.R. Troop trains for Cairo. As we steamed out\n\nfrom the wharf crowds of ragged urchins raced along by the train yelling for bucksheesh; quaintly dressed Arabs on donkeys loaded to the very ground passed by; great grey camels lurched along driven by natives of all hues & sizes.\n\nThe first part of the trip lay through the desert with an occasional date palm, near which perhaps lay an outpost of Sikhs, who looked extremely soldierly with their Kharki turbans & outfits. Once into the Nile Delta & we passed into one of the most thickly populated parts of the world. The intense culture is surprising. Cotton, maize, vegetables, fruits, &c. grown under irrigation flourish in a surprising manner. The mud villages of the fellahin picturesque – at a distance – are \n\ncomposed of one solid mud block built in as small a space as possible under the shade of the date palms. Here live, in filth, squalor & vermin, the true extract of the old Egyptian race. The fowls, sheep, donkeys, &c. share the dwellings with their owners.\n\nFor the greater part of the time the road, canal & railway run along side by side. The fresh water canal is alive with dhows; the road streams with donkeys, camels, sheep, goats, & buffalo. After passing through Arab towns of such note as Belbeis & Zag-i-zig, we arrived at Zeitoun, about 4 p.m., & then marched to our camp at Heliopolis.\n\nThe latter is a fine new town, with many handsome buildings such as the Catholic Church, Grand Mosque, Palace Hospital, Pensionnat de Sacre Coeur, Les\n\nPyramides Hotel &c. The main street Rue de San Stefano contains the chief business houses run by Egyptians, Frenchmen, Greeks, Armenians &c. They all ply their trade in the street to the cry of “Verra goot, verra nice\" & are a constant source of worry & trouble. But it is the boot-black who will worry one especially if he happens to notice & he of course invariably does – that your boots are dirty – as they, also invariably are.\n\nOn","21":" we took a trip with a guide round Cairo, which is joined to Heliopolis with a fine tram system. The first place we visited was the Mosque of Amr, a building containing 365 pillars with no two alike. This was built \nof\n by sultan Amr when he took Egypt, & he\n\nhad pillars conveyed from all parts of the Empire. Pillars of the Egyptian, Ionic, Coranthic, Doric, Roman were types to be seen. The story was told that when Amr had collected all these pillars he had only 364 & he wanted another to complete his work. He therefore prayed to Allah who told him to go out & crack a whip in the direction of Mecca. Following these instructions, he cracked the whip & immediately there fell at his feet a marble pillar. It stands to-day in front of the chancel facing Mecca, & there still can be seen the whip mark & the names of Allah & Mohammet engraved upon it – not done by the hand of man, for the names are right through the pillar. Among other items of interest in this Mosque is the foundation\n\nstone supposed to have the power of curing disease if licked by the faithful. The result is that a hole six inches long & an inch deep, caked with the blood of ages can now be seen in the stone, which has been barred off by the British Gov. \n\nSide by side at the entrance of the Mosque are two pillars also barred off. \nIt\n These were placed there by Amr, who stated that anyone who could pass through between the pillars would be assured of everlasting life in the hereafter. Thin & normal people could get through easily, but among the many thousands that pressed forward to gain paradise, came many of the more ample Mohammedans. Many got caught & died in their prison so that the British Government was forced to bar it off. No Mohammedan is allowed to attempt this now, tourists alone serving to keep\n\nthe polish on the marble pillars. The Coptic Church (Christian) is situated away in the centre of Old Cairo. One goes down a multitude of stinking lanes (streets they call them) where the houses almost meet over head, & where water carriers with their squelching goat-skins & peddlars of all kinds cry their wares, through a huge gate in a wall kept by a blind & deaf Christian of about 90 summers who howls in a voice most pitiable to hear for “backsheesh\" then through sundry subterranean passages till at last you come out into a dark room where, when your eyes become used to the light a cross like a Maltese Cross shows on all sides. This is the Church – a queer mixture of Eastern & Western ideas. In a vault beneath it is shown the place where the \n\nHoly Family sheltered for Six months & the font where Christ may have been baptised & where all Copts are now christened. Set in the centre is a fluted column of alabaster which is supposed to have been brought by the Virgin from Solomon’s Temple at Jerusalem. Passing from here we come to the Synagogue where is shown the original Old Testament of Ben Ezra, 2,000 years old. On the island of Rhodda in the Nile, is the place where the Romans built the Nilometer to measure the amount of water used to irrigate the land. This meter is still used by the authorities for the same purpose. Here also is shown the spot right opposite where the Pyramids rise majestically where Moses was found in the Bulrushes. In the Dead City, can be seen the tombs of the Mamelukes. Here is\n\nthe Tomb of Ibrahim Pasha worth £6,000. There is also a fine statue erected to that great soldier in the Opera Square in Cairo.\n\nThe training of the troops is carried on to an extent which leaves little leisure time. Skirmishing, bayonet fighting & trench digging are the chief items. Daily routine as follows:\n\nReveille – 5 a.m.\n\nFall in – 6 a.m.\n\nBreakfast – 9.30\n\nFall in – 10\n\nDinner – 1 p.m.\n\nFall In - 4 p.m.\n\nSupper – 6.30 p.m.\n\nLights Out – 10.15 p.m.\n\nShooting at the butts has been gone through by all hands with a certain amount of success. Red & white flags however were fairly common.\n\nConsternation has been caused in the ranks by the loss of three corporals who have gone to the front. In their place some two dozen others have\n\nbeen appointed leaving one or two privates for the duties of mess orderlies, pickets, guards &c. Even these few live in daily terror of being gazetted as stripe holders, & whenever an officer is looking do their best to display their ignorance of military affairs.\n\nOn","22":" we received word that the Reinforcements of the First Brigade were to break camp on the following morning for the front. Great was the excitement during the day but greater still in Cairo at night, where hundreds of the perpetually dry were lingering long over the last beer.\n\nReveille sounded early on the morning of the 21st & by 8 o’clock all were aboard the troop trains & the minarets of Cairo & Heliopolis dropping slowly below the horizon.\n\nSeaward through waving fields of maize & snowy cotton plantations & mud\n\nvillages with their date palms & curious sights, & at 4 p.m. we arrived at the centre of the Old World of the Greeks – Alexandria. The trains take you right on to the wharf where the grey troop ship (formerly the P & O “Borda\") awaits already packed seemingly to overflowing. However the","23":" of the","24":" Batt. get in & somehow hundreds of others follow. Hundreds of other ships lie here. Hospital ships white with a green stripe running their entire length, are unloading wounded, others awaiting their turn; coal hulks & oil tanks, dozens of transports, all like our own with their grey hulks awaiting to take on their complement of troops; a couple of warships with the French tricolour hanging at their mast-head.\n\nThere is a constant movement of troops going on here. We\n\nare the thirteenth ship to move this week for Lemnos, & others are ready to follow.\n\nAt 4 p.m. on the","25":" we weighed anchor & passed out of the harbour. As we drew out a Greek ship, carrying the reservists of that country, passed us. She appeared to be heavily loaded, the men being in the highest spirit at their chance of war with Bulgaria.\n\nThat night \nmany of\n the usual precautions were taken against submarines, which according to reports (not rumours) are plentiful in these waters. Smoking was prohibited, all lights were of course put out, & guards & sentries armed & loaded with ball set at every point of vantage on the ship.\n\nThe ship steered in a zig-zag manner, while life belts were served out to every member of the crew & to all the 2500\n\nsoldiers aboard.\n\nAfter some queer demonstrations of submarine dodging we arrived at Lemnos on","26":"\n\nNumerous transports were lying in the port together with about 20 warships. Numerous Destroyers \ndash\n & submarines dashed about, while a constant stream of supply ships passed to & fro.\n\nThe hills fringing the port were almost covered with the white tents of various camps.\n\nThings on board had become very bad by","27":" Food ran scarce; latrines in an awful state; lice made an appearance on board & sickness continued to spread.\n\nA newspaper for the purpose of causing a little amusement on board was brought out under the name of the Latrinograph. The first issue appeared on","28":" & created quite a sensation going to the officers & to the Flagship “Agamemnon\". The second issue","29":" &","30":"","31":"\n\nOn","32":" we trans-shipped to the “Osmanieh\", & at 1 o’clock, set sail for Anzac. It was dark when we arrived off the coast, which was occasionally illuminated by the flashes of the big guns. As we neared the shore, the rifle shot became distinct, & by the clear starlight we could see the steep cliffs, lit by a thousand twirling lights from the dug-outs. As we landed a few bullets whizzed overhead, but everywhere seemed strangely quiet for \nthe\n one of the greatest battlefields of the world. A short tramp beneath sheltering slopes, past huge stores of ammunition & supplies, we entered the communication trenches leading up to the firing line. Arrived at the now famous “Shrapnel Gully\" & we were told off (by ourselves incidently) to dugouts on the side of the hill. Here we lay down for a first night on Turkish soil with the rifles\n\n& machine guns. Keeping up a desultory fire, & an occasional salvo from the batteries, we fell asleep.\n\nOn awaking in the morning the hollow resembled an ant bed. Heads were bobbing out of dugouts; tired “cornstalks\" were stretching themselves in the mounds & some were busying themselves in boiling their billies.\n\nBy daylight one can see the difficulties encountered by the landing party, & appreciate their great work. The hills covered with a short prickly undergrowth, slope in almost precipice-like manner to the sea & valleys. Now everywhere at every point, the hills are terraced, & dugouts show out resembling vast warrens. Water carriers stream to & fro to the firing line; Indian A.S.C. pass by with their mules laden with ammunition & at intervals the big guns round Shrapnel Gully boom, & force the new-comers to bob instinctively. Spent Turkish bullets crack\n\nwith a sharp biting snap overhead & drone & whirr down towards the Gulf of Saros.\n\nDuring the afternoon old Beachy Bill of worldwide fame, introduced himself & with a whistle & a thunderous report, burst his shrapnel overhead & down on to the Beach. After the first discharge not a soldier was visible on the slopes & as our “Ranje\" & the howitzers returned the fire they crouched lower. A dozen shots & “Beachy\" turned the game up & we fell in & marched round the coast to our lines. After one halt at Casualty Corner, right in the danger zone, we reached our camping place \nwhere just\n at the foot of the firing line, just as Beachy started his music again. A few discharges from one of our howitzers silenced him for the night & by the time the stars were shining only the bursts of firing from the M.G.s & the long rolls of thunder from the warships in the Narrows went to disturb our sleep.\n\nThe following day","33":" we entered the firing line, & that night our first man was hit, being shot through the leg. On","34":" we were set to work on a sap to break through at the back of the trench. From here, the coast could be seen stretching towards Gaba Tepe, & resembled in its seeming peacefulness the New England Plains. Right in front, separated from our lines by a ravine, & by dense wire entanglements, lay the Turkish trenches, with their lines of sand bags & their loop-holes looking innocently towards our lines. The position we now hold has been cut from a barley field & the trampled grain stretches between the narrow lines of the trenches & still harbours a few skylarks, which, altogether heedless of the flying shells, roar aloft like the true bird of Shelley’s poem. From here we also had a splendid view of our guns shelling the enemy ridge in front. A shell bursts with a flash, & sends a column of dirt & earth\n\n& greenish fumes high in the air, while pieces of shrapnel & shell casing drone overhead like so many bees. Towards night we were shelled at intervals by the Turkish Guns, Beachy Bill & Lonesome Liz, sending showers of shrapnel over our lines, Hill 971 also added her complement & the miniture bombardment ceased.\n\nOn","35":" we saw an enemy air plane for the first time. Ever since our landing our own planes have continually flown above the enemies lines, & although shelled at intervals by the Anti-aircraft guns, still seem to do their required work. But now we had a Taube above us, & after dropping a few bombs over our lines, he soon disappeared once being fired at in the direction of Maidos\n\nOn","36":" the enemy landed six shells on our position & although one lobbed right in a dugout & stripped a rifle clean of its wood & scattered dust & clods throughout\n\nthe camp. The same afternoon the second man of the","37":" was hit while at the latrines being struck in the middle of the back by a piece of shrapnel which did not pierce.\n\nOn Monday the bombardment began afresh & two Catholic chaplains & a machine-gunner were hit, Tuesday & Wednesday passed quietly enough & late in the week we left our position at Shrapnel Green, & took up one further along the Artillery Road on the right of Lone Pine & facing\n\nW.F. King\n\n“Cambooya\"\n\nLennox St.\n\nBellevue Hill\n\nthe Turks on Sniper’s Ridge. For the first week we were out of the firing line & spent the time making “chupattees\", doing fatigue, & incidentally doing some fine chases after fleas & lice. Fleas swarmed by thousands & were a constant source of trouble. On Sunday the","38":" we entered the firing line, & then began the Ruse which was calculated to draw Abdul from his trenches. Kitchener had got word through the\n\nGreek papers that the Australians were taking most of their troops from Anzac for the winter & leaving the trenches weakly manned. All troops were ordered to keep to cover \nwhich\n while the ruse was in operation. The Turks were certainly beaten for a time. They commenced a heavy bombardment of the beach which brought the casualty list up by several hundreds while men worked openly in front of their lines. The Ruse may have proved effective had not a Turkish Bombing party operating on the flank of Lone Pine been fired on, while a trial attack on the Light Horse lines on the right elicited a full salvo from the latter’s trenches. This brought the Ruse to an end. On","39":" the Turkish artillery shelled Lone Pine on our left, & were responsible for a good deal of damage including some seventy-odd casualties. The last week of November brought winter fully upon us. Southerly winds brought up squalls of rain & heavy seas into the Gulf of Saros preventing the\n\nlanding of stores. Following this the wind changed to the East & blew across the Dardenelles from Asia Minor ending on the","40":" with a snow-storm. The cold & mud made everything in the trenches exceedingly uncomfortable & to add to the many miseries the water pipes burst, & food supplies were reduced by half. Men gathered dirty snow to quench the thirst raised by salt bacon & bully-beef, & as we had up to the end of November been in the trenches for fourteen days \nwet\n & nights with practically no sleep the men welcomed the return to fine weather about December","41":" when many had their first sleep. Spring-like weather continued until by the","42":" full supplies of water were again on hand in the line although food was still scarce. On December","43":" the warships subjected Achi Baba & the surrounding enemy country to a terrific bombardment but no news of any move came through, although heavy rolls of musketry & bomb detonations \ncame the\n\ncould be heard far to the right on Sunday","44":" evening. Early in the week news came through that a Peace Conference was to be held & as a result great excitement prevailed. “Latrine-wireless\" news was plentiful & “peace meetings\" were held in various parts of the lines. Among the old-hands however, not much hope was held out for a quick peace as many have no thoughts of being able to get home for some time yet to come. On","45":" one of the most terrific bombardments ever experienced at Anzac was delivered by three warships, two monitors, destroyers & the field guns. The area shelled was between Gaba Tebe, the Olive Grove & Kilid Bahr, & the object, as usual, the silencing of the Beachy Bill or to be more correct, the Beachy Bills. From our position it appeared that every foot of the ground came within the area of the bursting shells, but throughout the morning, the indomitable Beachy, as if in derision, burst his shrapnel increasingly over the beach. Accord\n\ning to the Intelligence Dep. three Turkish batteries & hundreds of casualties were the chief results of the bombardment.\n\nOn","46":" two of the","47":" were killed thus bringing our casualty list up to twelve (three killed – Neville & Osborne (shot on post) & Welsh killed with a bomb, Solomon, Appleby, Sheldon & Chivas wounded – Costello, Baxter, Edmonds & Batty sick.\n\nRumour had long held that the Australians were to leave Anzac for the winter. Little by little facts came to prove the force of the report. No rations were landed, no mails brought ashore & on","48":" two battalions of the","49":" Brigade with their field guns left. By","50":" it was generally understood that we were to leave at any moment, but whether we were to evacuate for good the position so dearly won was not known, although this was reluctantly thought by many. Sunday to Monday night saw great movements on the beach of departing troops, & when on Tuesday morning no sign of a relieving army could be seen, the fact that it was to be a complete evacuation was forced upon us. Little\n\nwas said by the men. Old hands who had toiled & bled in the gullies over which they had watched so long, who had seen comrades & brothers killed, felt the matter keenly & later reinforcements who had had their mates shot down in cold blood at their posts, murmured for a chance to avenge them. It felt like running away as one glanced down seaward & saw the little white crosses dotting the hillsides a feeling of resentment for the move & a sudden anger against those who had bungled the Gallipoli campaign right from the start spread over one. Officers Kits were sent to the beach & on","51":" I received orders with two others to pack up for embarkation & proceed with Chaplain McAuliffe’s effects to the Beach. Sneaking down to the sap, dodging by graveyards, silent but accusing, we reached the beach. Piles of broken stores, ammunition limbers & surplus supplies lay scattered everywhere. Men drowned their sorrows in the broken rum barrels; Indian A.M.C. with their carts & mules laden with munitions &c. to be shipped\n\nhurried along the Beach. All around confusion while a mile away the Turks as yet unsuspecting were held by a scanty line of Australians. After much struggling & cursing we succeeded in gaining a place on the lighter, which took us out to the troopship. The cliffs of Anzac lit by the fires on the beach seemed to show out grotesquely in the night, as the Princess Tina set sail for Lemnos. The monitor was as usual shelling the coast by Gaba Tepe, & Beachy was still showering his shrapnel on the Beach &\n\nFrank V. Miller, S.P.S. Leichhardt,\n\n38 Henry St., Leichhardt\n\nthe last view I had of Gallipoli was when a shell bursting over Victoria Gully lit up vividly for a moment the \nBeach and\n Battalion lines & the cemetry where Colonel Braund & so many gallant men lay sleeping. And then to the occasional sullen roar of a gun the snap of musketry the Peninsula fell into the night. We arrived at Lemnos sometime that next morning & sat there to wait the arrival of our battalion. They got off safely with the\n\nrest, & without a single casualty.\n\nLemnos when we arrived seemed bleak & miserable. But it was the middle of winter when the fields were \nbear\n bare, & the few fruit trees surrounding the small villages were leafless. The island has a population of some 35,000 who are contained in Kastra the capital & in 37 \nother\n villages. The island is rich wheat land & as one stands on one of the basalt hills & looks up the valleys which mark out into farm plots like a chess board, it forms a very pleasant picture. Small flocks of long-woolled sheep tended by a shepherd with his picturesque mountaineer’s costume, feed on the hills; donkeys, pigs & oxen browse or wallow in the marshes. The villages with their little stone houses, winding lanes, their church, market square & stone wall form a pleasant contrast to the mud villages of the Egyptians. All the wheat\n\ngrown on the island is ground in the wind-mills scattered over the island in hundreds. The process is very slow & the flour makes a very heavy kind of bread.\n\nOn December the","52":" we left the island on the “Derflinger\". Christmas Day passed very quietly & hungrily on board, & had it not been for the kindness of certain Aust. citizens who had sent Christmas Puddings many of us would have gone without food. Nevertheless we made a meal of some sort out of weevilly biscuits, bully beef & plum pudding (& not too much of the latter). At night the officers held a feast (in camera) but there happened to be a peep-hole in one of the shutters through which a hungry private could make out chickens & hams disappearing & bottles emptying to the musical rags &c. On","53":" we arrived\n\nat Alexandria, & entrained for the camping ground of Tel-el-Kebir, where we arrived the following morning. A most uninteresting place to be sure despite the fact that the Dervish trenches are still visible, & that Martini cartridges & bits of shells & bullets can still be found there. The usual strip of of arable land fringing the Ismailia Canal & supporting the same miserable crowd of fellahin with their mud villages, donkeys, camels. But the once odoriferous & unimportant village of Tel-el-Kebir has in the month of","54":" reached a position of high importance. Thousands of troops are encamped on the flat bordering the canal & their presence has drawn the more enterprising Egyptians & Greeks with their usual wares to the mud city. The canal – the chief path for Egyptian commerce – despite the proximity of the\n\nE.S.R. is crowded with dhows, each bound for the same destination with their loads of produce, fruit & wares. One thing alone troubles the Arab dealers & that is that the camp will break up before they are enriched by the exhorbitant prices they demand for the goods.\n\nWe have arrived on another continent. On","55":" we left Tel-el-Kebir & about 1 p.m. arrived at Serapeum on the Canal & marched out to camp crossing the Canal by means of a pontoon bridge into Asia. On","56":" we all enjoyed a swim in the water. The Canal is not very busy at this time, owing to the submarines in the Mediterranean.\n\nAfter remaining a couple of weeks swallowing dust at Serapeum East we went on picquet duty to Toussoun. The march thither led over the battlefield of Feb.\n\n1915, where the Turks were thrown back on their attempt at Kantara. The sunken graves of the Turks are scattered over the desert & pieces of shells, shrapnel & bullets lie about. Toussoun, the signal station is situated in a very pleasant spot. The huts lying between the canal & the trenches proved cool after the stuffy tents, & we had promise of having a pleasant little holiday. However, we were ordered to return the following day (March 18th). On","57":" we were inspected by the Prince of Wales but what with the dust &c. he could not have been too favourably impressed. However, it created a little excitement in the camp. The following day we were lined up & told that we moved on the following morning for France where we were to be billeted in houses. Other instructions were\n\nissued.\n\nAccordingly on","58":" March, after standing about for several hours in full pack as is the custom in the Australian army, we marched out & after a bivouac of several hours by the side of the canal entrained or rather entrucked for Alexandria. After a rather cold & uncomfortable trip we arrived at our destination at 10 a.m. & embarked on Z23, the Canurder “Ivernia\". We sailed for Marseilles at 4 p.m. the usual Submarine watches being set. Bedding arrangements were, on this boat, far in advance of any other troopship, most of us being quartered in four-berth cabins. But she lacked in food what she made up in accommodation, & as there was no canteen aboard, things were rather on the hungry\n\nside. ","59":" March, we sighted land, which was the cause of much conjecture aboard. The general opinion was that it was the southern coast of Sicily, & as we passed through the Straits of Bonifacio the following morning it is probable that this is correct.\n\nOur Strait of B. was also a matter of a good deal of conjecture, as during the afternoon we passed north along the coast of an island, which was said to be Sardinia. Ships were plentiful hereabouts & as we passed close in shore we had a good view of the fields, green with early spring & the white cottages of farmers nestling on the sides of hills.\n\nEarly on the morning of Monday 27th land became dimly visible ahead & by dinner time we were well in shore, heading in to the port – not of Marseilles as we had expected\n\nbut of Toulon. The coast was rather mountainous & clothed in dense pine thickets, which appeared very beautiful after the sands we had just left. Entering the harbour we found it practically deserted with the exception of several troop-ships. Everywhere seemed strangely quiet & peaceful. The city, lying at the foot of the steep pine-clad hills seemed from where we were to be dead, & scarcely any life was visible on the foreshores or in the beautiful parks surrounding the red houses which \nwere\n nestled at intervals among the groves round the water. A few ferry boats containing mostly women passengers went by us with the usual cheering but beyond this we saw nothing of the inhabitants.\n\nNews (rumour) of sinking of Mineopolis & Australian trooper of Alexandria.\n\nPte. E.E. Hughes\n\nBarton Street\n\nKurri Kurri\n\nN.S.W.\n\nPte. J.L. Cantwell – M.G.s\n\nCessnock Street\n\nKurri Kurri\n\nN.S.W.\n\nPte. E. Burridge – 54th Pioneer\n\nC\/o H.M. Burridge\n\nHigh Street, Dannevirke\n\nHawkes Bay, N.Z.\n\nPt. C. White – M.G.s\n\n131 Windsor St.\n\nPaddington, Sydney\n\nN.S.W.\n\nSig. T.R. Gale\n\n59 Waterloo St.\n\nSurry Hill\n\nSydney\n\nPte. J.H. Rennie – M.G.s\n\n164 Easter Ave.\n\nKensington\n\nSydney, N.S.W.\n\nThere’s always some bad in the best of us,\n\nAnd some good in the worst of us,\n\nSo it ill behoves all of of us, to think ill of the rest of us.\n\nE. Burridge\n\nLemnos harbour\n\nPte. D.J. Carter\n\nColinroobie\n\nVia Narrandera, N.S.W.\n\nJ.W. Curphey\n\n20 Elizabeth St.\n\nSouth Yarra\n\nMelbourne\n\nR.W. Brown\n\nTyrone\n\nBanksia Street\n\nBotany\n\n54th\n\nInstead of landing as we had expected at Toulon, we again set sail on Tuesday morning for Marseilles & arrived off that city a couple of hours later getting into berth about 1-30 p.m. A driving rain obscured a good deal of the shore, which like Toulon was high & Pine clad. The city stretched round the harbour, but with the exception of a couple of fine buildings in the foreground, the\n\nfamous Convent of Notre Dame situated on a high hill to the N.E. of the city & what appeared to be an old fort, we could see little of it. The harbour is little more than a wide mouthed bay with one or two islands near the entrance & were it not for a fine breakwater it would not afford much shelter to shipping. As it is however, hundreds of ships can anchor\n\nRaffles for Australia Day:\n\nPicture of King & Queen (Sid Perry) – 6d.\n\nPair of Pigeons (Alf Shepherd) – 3d.\n\nPair of Pigeons (Hardy Morphett) – 2d.\n\nPair of Bantams (Cecil Veld)\n\nToast Rack & Lolly Stand (Oswald Gimbert – 1d.\n","60":" –","61":"\n\nin perfect safety. As we went in we passed numerous troopships which had arrived before us, together with traders from Japan, Greece & other countries. On the wharves looking rather spic in their blue overcoats & uniforms were French guards while one or two Indians were to be seen. No sooner had we berthed than a crowd of fruit & cake sellers gathered on the quay each party vieing (?) with\n\nthe other in exhibitions of generosity when the troops showered down on them handfulls of silver & copper. Gendarmes however, soon made them shift off & they retired in rather undignified manner (for “ladies\").\n\nWe disembarked at 4 p.m.","62":" & marched through part of the city surrounding the quays to where the troop train waited. On our way we passed numerous German prisoners, still clad in their uniforms – blonde giants who took no notice whatever of the march past, or of the old Frenchmen who by elaborate gestures endeavoured (it was hardly necessary) to draw our attention to them. Our train was ready at the siding, & we were placed in the narrow compartments of the third class carriages. After we\n\nhad at length succeeded in getting our packs & rifles packed under the seats eight of us squeezed in ourselves. When this operation was completed the compartment resembled a well packed sardine tin. We moved out at 7.35, the city being soon left behind, & we endeavoured to settle down for a night’s sleep. Those of us who succeeded were awakened \nat\n by \n1.30 for\n the train pulling up with a vigorous bump at\n\nA Slack\n\nLilyville Pde.\n\nSth. Randwick\n\nAshley Slack\n\nPublic School\n\nPayne’s Crossing\n\nvia Wollombi\n\nNorthern Line\n\nT.R. Batty\n\nE. Rasmussen\n\nJ.H. Miller\n\nR. Williams\n\na siding. Here we were told that we were to be served out with a hot drink so after a strenuous struggle to free our mess-tins from our packs, we filed out & got an issue of rum & tea. This finished we again settled down & slept for a few hours. On awakening we beheld the sun rising over high snow-clad mountains to the east, & shining with its wintry light on the narrow\n\nvalley of the Rhone. On both sides the country was clad in the delicate green of early spring. Farmers were abroad working among their vines & in the fields & the red roofed houses scattered over the intensely cultivated hillsides & among the poplar groves & orchards, formed a very pleasant contrast to the mud & manure huts of Egypt. Everything spoke peace, & were it not for the uniformed guards at every tunnel, & groups of German prisoners working on some railway works it would have been hard to believe that this was portion of a country engaged in a fight for its existence. Another thing was most noticeable, & that was the absence of young & able bodied men. Old men filled most of the positions, & women were to be seen in many\n\nof the railway cleaning sheds & workshops. Farming & fruit growing appeared to be the sole pursuits of the rural inhabitants, & the old cow, so inevitable in Australian scenery, disappearing practically altogether. Cherry orchards appeared a mass of white blooms while peach trees were also showing in blossom. At 9 a.m. on Tuesday morning we ran into Lyons where we stopped for about an hour & breakfasted. Hot water was supplied by the French Red Cross, so that we were able to make tea & bovril. Between Lyons & the Loire beautiful stretches of dark green spruce forests alternated with the farmlands. Numerous tunnels lead through the rocky hills, one of which took thirteen minutes to pass through, & on doing so we ran from ","63":"\n pleasant sunshine at the entrance to partially\n\nsnow-covered fields at the exit. When night fell we we passing the more gently undulating country, with the prospect of running into Paris at night. Again we settled down for our night’s rest & being tired slept well, to be awakened at 4 a.m.","64":" for hot tea, & to find that we were still “on our way\" to Paris. A heavy frost spread over the country; red checked peasant girls in sabots & shawls, were already abroad, waving excitedly to our train as we \ncrept\n along; farmers carts were leaving the houses for the fields & snowy ox teams slowly drawing the ploughs in the whitened \nfield\n paddocks. At stations along the route were numerous soldiers of different regiments, some wearing the steel helmets now in use in the French Army; who answered with puzzling rapidity to our questions in\n\nbroken (badly broken at that) French, as to the distance to the capital.\n\n"}}