{"Document Name":{"0":"Diary_0387","1":"Diary_0387","2":"Diary_0387","3":"Diary_0387","4":"Diary_0387","5":"Diary_0387","6":"Diary_0387","7":"Diary_0387","8":"Diary_0387","9":"Diary_0387","10":"Diary_0387","11":"Diary_0387","12":"Diary_0387","13":"Diary_0387","14":"Diary_0387","15":"Diary_0387","16":"Diary_0387","17":"Diary_0387","18":"Diary_0387","19":"Diary_0387","20":"Diary_0387","21":"Diary_0387","22":"Diary_0387","23":"Diary_0387","24":"Diary_0387","25":"Diary_0387","26":"Diary_0387","27":"Diary_0387","28":"Diary_0387","29":"Diary_0387","30":"Diary_0387","31":"Diary_0387","32":"Diary_0387","33":"Diary_0387","34":"Diary_0387","35":"Diary_0387","36":"Diary_0387","37":"Diary_0387","38":"Diary_0387","39":"Diary_0387","40":"Diary_0387","41":"Diary_0387","42":"Diary_0387","43":"Diary_0387","44":"Diary_0387","45":"Diary_0387","46":"Diary_0387","47":"Diary_0387","48":"Diary_0387","49":"Diary_0387","50":"Diary_0387","51":"Diary_0387","52":"Diary_0387","53":"Diary_0387","54":"Diary_0387","55":"Diary_0387","56":"Diary_0387","57":"Diary_0387","58":"Diary_0387","59":"Diary_0387","60":"Diary_0387","61":"Diary_0387","62":"Diary_0387","63":"Diary_0387","64":"Diary_0387","65":"Diary_0387","66":"Diary_0387","67":"Diary_0387","68":"Diary_0387","69":"Diary_0387","70":"Diary_0387","71":"Diary_0387","72":"Diary_0387","73":"Diary_0387","74":"Diary_0387","75":"Diary_0387","76":"Diary_0387","77":"Diary_0387","78":"Diary_0387","79":"Diary_0387","80":"Diary_0387","81":"Diary_0387","82":"Diary_0387","83":"Diary_0387","84":"Diary_0387","85":"Diary_0387","86":"Diary_0387","87":"Diary_0387","88":"Diary_0387","89":"Diary_0387","90":"Diary_0387","91":"Diary_0387","92":"Diary_0387","93":"Diary_0387","94":"Diary_0387","95":"Diary_0387","96":"Diary_0387","97":"Diary_0387","98":"Diary_0387","99":"Diary_0387","100":"Diary_0387","101":"Diary_0387","102":"Diary_0387","103":"Diary_0387","104":"Diary_0387","105":"Diary_0387","106":"Diary_0387","107":"Diary_0387","108":"Diary_0387","109":"Diary_0387","110":"Diary_0387","111":"Diary_0387","112":"Diary_0387","113":"Diary_0387","114":"Diary_0387","115":"Diary_0387","116":"Diary_0387","117":"Diary_0387","118":"Diary_0387","119":"Diary_0387","120":"Diary_0387","121":"Diary_0387","122":"Diary_0387","123":"Diary_0387","124":"Diary_0387","125":"Diary_0387","126":"Diary_0387","127":"Diary_0387","128":"Diary_0387","129":"Diary_0387","130":"Diary_0387","131":"Diary_0387","132":"Diary_0387","133":"Diary_0387","134":"Diary_0387","135":"Diary_0387","136":"Diary_0387","137":"Diary_0387","138":"Diary_0387","139":"Diary_0387","140":"Diary_0387"},"Date":{"0":"unknown","1":233.0,"2":234.0,"3":235.0,"4":236.0,"5":237.0,"6":238.0,"7":239.0,"8":240.0,"9":252.0,"10":253.0,"11":254.0,"12":255.0,"13":256.0,"14":257.0,"15":258.0,"16":259.0,"17":260.0,"18":261.0,"19":262.0,"20":263.0,"21":264.0,"22":265.0,"23":266.0,"24":267.0,"25":268.0,"26":269.0,"27":270.0,"28":271.0,"29":272.0,"30":273.0,"31":274.0,"32":275.0,"33":276.0,"34":277.0,"35":278.0,"36":279.0,"37":280.0,"38":281.0,"39":282.0,"40":283.0,"41":284.0,"42":285.0,"43":286.0,"44":287.0,"45":288.0,"46":289.0,"47":290.0,"48":291.0,"49":292.0,"50":293.0,"51":294.0,"52":295.0,"53":296.0,"54":297.0,"55":298.0,"56":299.0,"57":300.0,"58":301.0,"59":302.0,"60":303.0,"61":304.0,"62":305.0,"63":307.0,"64":309.0,"65":310.0,"66":311.0,"67":312.0,"68":313.0,"69":314.0,"70":315.0,"71":317.0,"72":318.0,"73":319.0,"74":320.0,"75":321.0,"76":323.0,"77":324.0,"78":325.0,"79":326.0,"80":327.0,"81":328.0,"82":331.0,"83":332.0,"84":333.0,"85":334.0,"86":335.0,"87":336.0,"88":337.0,"89":339.0,"90":343.0,"91":344.0,"92":345.0,"93":346.0,"94":348.0,"95":349.0,"96":350.0,"97":351.0,"98":352.0,"99":354.0,"100":356.0,"101":357.0,"102":358.0,"103":359.0,"104":361.0,"105":362.0,"106":363.0,"107":364.0,"108":365.0,"109":366.0,"110":367.0,"111":368.0,"112":369.0,"113":371.0,"114":373.0,"115":374.0,"116":376.0,"117":377.0,"118":378.0,"119":380.0,"120":381.0,"121":382.0,"122":383.0,"123":385.0,"124":386.0,"125":387.0,"126":390.0,"127":391.0,"128":394.0,"129":395.0,"130":396.0,"131":399.0,"132":403.0,"133":405.0,"134":406.0,"135":411.0,"136":412.0,"137":414.0,"138":417.0,"139":419.0,"140":421.0},"Entry":{"0":"\n","1":" \"24\" \"24 Sir\". And 24 comes staggering along, rifle in right hand, brown canvas Kit bag slung over left shoulder; web accoutrements flapping about the body, perspiration streaming from under his navy cap & a happy smile on his rotund face. The mustering officer calls the off number of each member of the contingent and he is tallied before boarding the \"Lily Brayton\" bound for Garden Island. \"56\" \"56 Sir\", \"57\" \"57 Sir\" along they swing. \"75\" \"75 Sir\" 75 is evidently a little bit tired. \"Now then 75 hurry up, if you can’t double faster that that we’ll leave you behind\". 75 promptly answers \"Not me Sir\" and redoubles his efforts. At last they are all aboard. The permanent staff at the Naval Depot man the sea-wall. A burly CPO calls for 3 cheers for the contingent and they are promptly given. 3 answering cheers come from the volunteers & the \"Brayton\" with 3 crowded cutters in tow steers for the Island. Meantime the inevitable Irishman calls for an extra cheer for the \"old girl left behind\", amid laughter for the \"old girl\" is honoured. The heights of Elizabeth Bay are gay with bunting and waving handkerchiefs, whilst from one grassy terrace is seen a puff of smoke, and a sharp report bids \"Au Revoir\". \"The first whiff\" says our Irishman, & his merry comrades join in his laughter.\n\nGarden Island, seen internally for the first time by some of our youngsters (the age limit is 20 to 45) is soon reached, & then begins the weary waiting while various details are gone into. At 3 o’clock all hands are granted leave till 7 am. next morning.\n\nTues 18th. After some necessary delay the contingent embarks on a ferry boat and after touching at historic Fort Macquarie (the old Naval Brigade headquarters)\n\n2\n\nwhere enthusiastic crowds bid God Speed to the \"Tommies\" who are to go with us to – God Knows Where, we are landed at Cockatoo Island, Parramatta River. Our Transport H.M.A.S. \"Berrima\", some time one of the P&O Branch Service fleet, is still in Dock, with a huge I painted on either side of Bow & Stern. Now there is pandemonium. The creaking of blocks, the whirr of the sheaves, the rattle of the winches, and the million and one noises incidental to the hurried loading of a naval & military transport blend in one discordant whole. Package after package; case after case; innumerable crates and bales are swung inboard and disappear into the capacious maw of the \"Berrima\". Below on the \"C\" & \"D\" Troop Decks, set apart from the Naval Contingent, a Lieutenant tells the men off to their respective messes; rifles are placed in the racks & things begin to look a bit ship-shape. On deck the loading goes on well into the night. Sentries are placed on the gangways and in the alleyways, and our tired but expectantly happy volunteers turn in. The \"Berrima\" has been fitted up as comfortably as possible for the accomodation of the troops; the fore part is occupied by the Naval Reserve made up of 200 from NSW, 100 from Victoria, 100 from Queensland, & 100 from S.A., while the after part is given up to the Military (1000 strong). During the night an amusing incident occurred. Word had been received that a German named S- had expressed his intention to visit Sutherland Dock (which contained the \"Berrima\") at 11 o’clock. Strict watch was kept, and precisely at 11 a man arrived at the Gangway answering in every particular to S- even to a soft felt hat. The Q.M. on watch quietly informed the O.O.W. of the arrival, and notwithstanding the fact that credentials were forthcoming the poor unfortunate was shadowed\n","2":"\n\nby the Sub Lt of the Watch and P.O. of the Guard till, accompanied by the OOW, he reached the smoke room where he proved to be Capt X-, the __ __ Pilot\n","3":" : At daylight the \"Berrima\" began to slip out of Dock, and shortly after, to the accompaniment of \"Cock-a-doodles\" from the early morning ferries, she dropped down to Farm Cove where she was the cynosure of all eyes and the recipient of many good wishes in the shape of \"tooty-toos\" from ferry-boats, motor boats, and a host of small boats of all kinds. At length, cheered on by still more blasts from the ferry boats, she finally cleared the heads at 1 o’clock. Just outside the \"Captain Cook\", Pilot and Examination Steamer, dropped a boat for the pilot who slithered down the port ladder and shoved off. At last we were away, and one of the last most conspicuous objects to be seen was good old PO Swanson standing on the dock of the \"Cook\" and signalling in semaphore . The run up the coast was uneventful; the men were gradually being shaken down into the routine, and stores of various kinds were being unenhauled. \n","4":" : S.W. wind and rain squalls; course about North. The daily routine of drills was interfered with by the weather, but the men were kitted up with boots, landing blankets, towels, tooth & hair brushes etc. The coastline was at times indistinguishable by reason of the rain which continued intermittently during the whole day.\n","5":" : We woke up this morning to find ourselves lying snugly in Moreton Bay, close to the Examination Steamer and the gun-boat \"Gayandah\". In comparison with Sydney Harbour, Moreton Bay, from a yachtsman’s point of view is nowhere, except that there are fine stretches\n\n4\n\nfor making long boards. We remained stationary the whole day with the exception of an hour or so in the afternoon when the ship was swung for compass errors. The officers were fitted out with cutlasses, revolvers, and leather gear. Some of us were in hopes of getting some letters away, but this was disallowed. At about 11.30 pm we weighed anchor and stood down the bay. \n","6":" : During the morning land was visible on the port beam, sandy hills & beaches showing up plainly. By 2.30, however, the course being W by N, no land was visible anywhere. \"Hands to make & mend\" was piped and all ratings overhauled their kits, washed collars & flannels and had a general spruce up. At 4 o’clock considerable excitement was apparent; word was passed along the decks, \"Cruiser sighted on the Port bow\". Almost every glass in the ship was directed towards the faint smoke visible on the horizon. At last we were near enough to distinguish her outline. It proved to be the H.M.A.S. \"Sydney\".\n\nAt 5 o’clock we were about 1000 yards astern of her. At 4.45 this afternoon we passed Elliott Island leaving it on the Starboard Hand. This is an apparently low-lying islet with sandy beach and a fringe of trees along the shore. We are now just entering smooth water between the Barrier Reef and the mainland.\n\nSat 22nd 9.30 pm : Just turning in after an excellent entertainment. The men, soldiers and sailors alike, asked permission to hold a concert; this was granted. I would give much to be able to reproduce the scene I beheld from the gallery of the smoking room. On the after well deck were hundreds of \"Tommies\", interspersed at intervals with the dark uniforms of Blue Jackets. Every available space was occupied. The life-boats were crowded,\n\n5\n\nevery span and jackstay served as a nest for the impatient members of the contingent. There was a fine programme submitted, but most of the items were \"Counted out\", and only those artists who pleased this most critical of audiences were allowed to proceed. There was a kind of opening chorus (the overture was counted out before ½ doz bars were played) consisting of popular rags, \"Row, Row, Row\", \"Dixie\", \"On the Mississipi\", etc. These rags were sung with great fervour and were a treat to listen to. Rags were the order of the evening, and even an impromptu Harry Lander with \"Painted on the Shore\" – r-r-r’s and all – could not produce the applause which greeted the AB who sang \"Dixie\", transposing the words \"my home in – New Guinea\". This brought down the house, or rather the ship and he and his mate were encored again & again. The last items were \"Sons of the Sea\" & \"Soldiers of the King\", the evening being concluded with the National Anthem & three cheers for the King, followed by a h--- for the Kaiser.\n\n10.30:- The \"Sydney\" has dropped astern and her masthead light (the only light she is showing) appears on our port quarter.\n","7":" : I omitted to mention that this day (Friday) the whole of the Naval Reserves were inoculated against typhoid, the frequent expression consequent thereon \"Mind my arm\", being reminiscent of the Sydney small pox scare.\n","8":" : Bright sunshine, sparkling ocean, with snow white foam; islets of every conceivable shape, some with undulating hills; others – one in particular about ½ a mile in circumference – rising abruptly five or six hundred feet from the ocean; apparently an ideal cruising ground. I have never seen anything to equal this in beauty. This morning at 9.30 \"Divisions\" was sounded off, after which the whole of the naval\n","9":"\n\ncontingent were massed on the forward well deck for prayers. \"Off caps\"! 500 caps were lifted from 500 heads and 1000 eyes looked up to where Commander Stevenson, O.C. HMAS \"Berrima\", stood prayer book in hand. There stood AB Z___ (who on the night prior to our departure from Sydney was as \"tight as a bottle\") with angelic face. Hard citizens these; able to stow away comfortably a gallon or two of Grog, but at Divisions on Sunday morning pious as a priest. Immediately after dismissing they swagger about, asking \"Who the H__l shifted my pipe\"? All the morning the \"Sydney\" has hung on our starboard quarter, volumes of smoke issuing from the ‘midship funnels.\n","10":" pm My eraser is not handy else would I expunge some lines written earlier in the day wherein I expatiated on the beautiful scenery. It is nothing to this. We are now (5.15 pm) just entering Whitsunday Passage. On either side are innumerable islands and the \"Berrima\" following in the wake of the \"Sydney\", who has now taken the lead, glides along a fairy waterway. One small island near the entrance particularly attracted my attention, the summit is one immense rock; and it is anything from 1000 to 1500 ft above sea level, the circumference of the whole island being probably under a mile & a half. At 5.30 we passed a lighthouse situated on the high foreshores of a huge island, the bungalow shaped houses of the attendants surrounded by waving palms giving a semi-tropical effect.\n\n10.30 : Just turning in for an hour & a half; it is my watch on tonight & I must rise again at midnight. By the bye, as we have now passed the Tropic of Capricorn, we today went into whites which was very acceptable, the weather having been decidedly warm. \n\n12.30 : A starlit sky & a smooth sea; the \"Berrima\" moves along almost silently. One feels that one could stand at the rail for hours watching\n","11":"\n\nthe phosphorescent swirl from the side of the ship. In the semi-darkness small islands thrust themselves through the gloom, and then gradually fade away into nothingness. Last night while sitting in the Wand Room enjoying the singing of my mess-mates I heard \"Hello! Griffiths Bros: Propy Ltd\"! Looking round I saw the scrubby chin & hair-covered face of a \"Swattie\" framed in one of the ports. The apparition produced a hand from the lower portion of its anatomy and held it out to me, saying, \"Shake\"! I \"shook\", and looking down at the face underlying the 5 days growth of beard, I was delighted to recognise Mr Bulloch, the ledger clerk at the B. of A. Southern Branch. I asked what the ___ he was doing there; he replied that he was answering his country’s call. I remember one day at the Bank asking for the \"leading Tea Firm’s passbook\" (I always call GB’s that). He promptly called out to his subordinate \"On Chang & Co’s Pass Book, please\". I hope to see more of him later. Another old friend whose name I cannot now remember hailed me on the promenade deck the other day. We had known each other at Crown St (Sydney) School. He is also a \"Swattie\". There are probably many other familiar faces on board could I only find time to seek them out.\n\nLast night there was a scare. In one of the alleyways plans of the flooding arrangements of the ship were found, evidently carelessly dropped by someone whose mission was only too apparent. At the same time one of the military contingent had purloined the sights & spare parts of the after 4.7 Guns (there are two forward & two aft) & had promptly disappeared. Instantly every precaution was taken, the guard was doubled & strict enquiries were made on all sides. Eventually it was discerned\n","12":"\n\nthat the plans were those of the \"Warrimoo\" which vessel was in dock prior to the \"Berrima\". The gun parts were found in the possession of a harmless \"Tommy\" who had no hostile intentions whatever.\n\nMonday 24th : Glory of glories! The sun sparkles on the rippling waters close to The Palm Isles. We came to anchor early this morning with Great Palm Island on the starboard beam and Fantome Island on the Port. Away to the westward is a cloudlike range of mountains only very faintly visible. This is the Queensland mainland. The \"Sydney\" has left us but we are now in the company of HMAS \"Encounter\" which was anchored off Gt Palm Island when we arrived. At 8 o’clock this morning we were boarded by the Officer of the Guard from the \"Encounter\". \n\n4 pm : Since 1.00 pm we have been lowering the lifeboats and clearing away all the collapsible boats on the \"Berrima’. 3 companies of the Naval Reserve and about the same number of the military contingent landed this afternoon on Gt Palm for Field Exercises.\n\n8.15 pm : Am I becoming a victim of maudlin sentiment? I know not; but I do know that when the crescent moon was setting tonight it seemed to throw a path of silver across the restless sea, beautiful beyond words. Sydney ’Arbor! thy beauties are a myth!\n\nI have hitherto forgotten to mention old Captain B__, the T___ S___ pilot. He is a \"nut\", & no wonder for his father was a colonel! He is as full of yarns as an egg is full of – feathers (in embryo), but they would probably lose flavor by retelling. However, I will repeat one he told tonight at dinner. Try to imagine please that the clauses & sentences are punctuated with gurgling\n","13":"\n\nchuckles & grunts & eh’s (accompanied by playful digs in the ribs) without number. Said he, \"O! those trading missionary b___s; I’ve got no time for ‘em. I remember once losing my pipe & going to the missionary store for a new one. An old \"nigger\" was there whose wife was ill. Going to the missionary he said \"My wife, she dambad, all ‘long pain on him port side\". The missionary, who suffered from a serious impediment in his speech, replied, \"On him p-p-p-port side, eh!\". \"Yes all ‘long him port side\". \"Well\", said the missionary handing him a bottle of ‘Pain Killer’, \"t-t-take this h-h-home and g-g-give her a d-d-dose or two\". \"How much\", inquired the nigger. \"T-t-two and six, t-t-ter-three and six for s-s-s-starboard side\". The nigger went away mightily pleased that his wife had not taken bad amidships. So I turned to the old b__ and told him I‘d lost my pipe, and asked how much for a new one. The missionary spluttered and growled, \"T-t-t-ten ___\". \"Out with it\" I said, \"you mean Ten & six\". He stuttered, \"n-n-no; t-t-take it as a g-g-gift f-f-from the Lord\"! And Captain B__’s capacious paunch fluttered & shook at the remembrance.\n\n10.30 I have just taken a stroll round the deck before turning in, the air is quite still, and though it is rather warm in the cabins, it is very pleasant outside. Ashore everything is silent, quiet enough to hear a mangle drop. Good night!\n\nTuesday 25th 6.30 am : The Q.M. has just piped \"’Eave out; lash up and stow\". I accordingly am \"’eavin’ out\". This pipe is always followed by \"’Ands to cocoa & mash\".\n\n12.30 : I have just come aboard after a busy morning at Great Palm where No.s 1, 2 (my own Coy) & 6 Companies Naval Reserve have been for Field Exercise. We came across a family of aboriginals in their grass thatched house. One\n","14":"\n\nor two of the men were away fishing; but there were a gin, a lubra & a few jet black children, who returned the stare of our blue jackets without moving an eyelash. The most noticeable thing about the children was the extreme thinness of their limbs. The undergrowth on this island is very thick & in some parts very beautiful, one shrub in particular having dark green foliage, the inner portion of the leaf being of a bright red; one would almost imagine that a red paintbrush had been daubed on the centre of each particle. The water around the island is beautifully clear. Near the beach it is like crystal, a hundred yards or so from the shore it is a transparent emerald, further out still it takes on a bluish tinge. It is very inviting but I believe it is infested with sharks. A canvas bath has been arranged on the deck for the men about 12 feet square & about 3 feet deep; they had a fine time there after their jaunt ashore, fully 20 men crowding in at a time. \n\n10 pm : I am tired enough to go to bed; but \"Dear Diry\", as the \"Bad Boy\" used to say, I must give up a few minutes to replenish your bunkers. \n\nThis afternoon at 5 o’c the \"Sydney\" hove in sight round Great Palm, and at 5.25 anchored close to the \"Encounter\". Things are beginning to look brisk with 2 Cruisers and a Transport. Some of the officers of the warships came aboard tonight; I was pleased to recognise Drs Francis and Prevost, the latter of Chatswood. Paymaster Norton, who was on the Gunboat \"Protector\" with me in Melbourne about 5 years ago, was also in the party. There was another officer, a Lieut-Commdr, looking like a page from Marryat with his side-whiskers, who proved to be, not Peter Simple or Frank Mildmay, but Feakes, whom I also had the pleasure of meeting in Melbourne during the visit of the American Fleet. Quite a reunion.\n\n11\n\nI see by the roster that I am O.O.D. tomorrow, so now to bed.\n\nWed 26th : There were only two events worthy of record today. A boat race & the first issue of the \"Expeditioner\". The race took place this afternoon at 4 o’c. The Naval Reserve were challenged by the military for a sprint around the three ships, about 1 ½ mile. The military were out-classed from the start and the Naval Reserve won by several lengths. A fair amount of money changed hands. Vol 1 of the \"Expeditioner\" consists of three pages of satire and wit, with a few facts thrown in here & there. The following are a few extracts:-\n\nHatched:- Lies & ideas only. Both doing well\n\nMatched:- Skeet – Edwards. Surgeon Skeet to Olive, daughter of S Edwards, Esq. England (English papers please copy)\n\nDespatched:- Harold – beloved pet of \"C\" Company, passed away in Moreton Bay\n\nNot Despatched:- Our mail to Brisbane\n\nCable Grams\n\nBerrima – Sydney – Tween Decks. Owing to the narrowness of the passages & the stoutness of the passengers, it is reported that many naval engagements have occurred.\n\nSydney (By special megaphone). The War is forgotten. The Melbourne Express has arrived to time. Intense excitement.\n\nAnswers to Correspondents\n\n\"Major B\". Yes, we do think the ship is incorrectly lighted. We have not been able to find any \"Starboard Light\" & only a very bad \"Port\".\n\nUnder Wanted appears the following\n\nWanted a Drink (The Editor)\n\nThe band from the \"Encounter\" came aboard tonight & played a few selections, the most popular being\n\n12\n\n\"Asleep in the deep\". \n\n10.30 pm : Turning in. I am invited to partake of Tea with Lieut Butler (the 2nd Officer & a grand little chap too) at 3 am at which hour I shall be going the rounds.\n\nThurs 27th : Supplied the men with oilskins, WPSheets & brown hats, also mosquito nets & housewives, the last two being supplied by the ladies of Melbourne, \"Gawd bless ‘em\", as one old salt remarked. There was a time when people who used what is generally known as bad language were anathema to me; but I have met so many people lately who swear like troopers (which I consider a very apt simile) but are sterling in all other respects, that I am beginning to attach very little importance to the embellishments of the King’s English. Some observations are remarkably concise but supremely forcible. One officer whom I can never think of but with the greatest respect & good fellowship, told me today that he was referred to as \"one of those b___ two stripe Reserve B___s\". If this is not the cream of expletives what is? Our H.A.A. told me tonight of some of his experiences in the good (?) old days on the E Coast of Africa. He is a short stout man, clean shaven, with a pace that would serve as a vignette for a book of Comic Cuts. He was explaining the meaning of \"10-a\" punishment. \"I did 14 days myself once, Sir,\" he said; & I settled back for a yarn. The offence was a trivial one, but it caused the natives at Zanzibar, who were crating ship, to go on strike; consequently the ship’s company had to turn to, which was an item in those regions. For punishment he was ordered 7 days \"10 a\", which consists of standing at attention on deck looking steadfastly at the paint work for 2 hours daily. A messmate, who was undergoing the same punishment asked how he got thro’ the 2 hours. \"I go to sleep\", he replied. \"Standing up?\" \"Yes! I count the rivets in the plates fore & aft\".\n\n13\n\nHis messmate tried it with such success that he fell forward on the deck & barked his nose. The captain happened to be passing at the time & put it down to skylarking whilst undergoing punishment. \"Well\", said the MAA ruefully, \"I had to give an explanation & got an extra 7 days. But he was a Tartar, Sir,\" he added. \"He had a dog, one o’these fluffy little beggars with a tuft on the end of his tail. One day someone painted a red patch on one of his buttocks & a green one on the other & painted the tuft white. The cap’n was taking his night-cap (he was strong on the drink, Sir) when in walked his dog. \"Good G___ A___ whats up with you\", he snorted; then he rang his bell. \"Send my coxs’n to me\", to the messenger. The coxs’n appeared. \"What the devil’s happened to my dog\", said the Captain. The coxs’n grinned. \"Beggin’ yer pardon, Sir,\" he said, \"he’s got ‘is steamin’ lights on, Sir.\" \"Steaming lights be damned\", he cried, \"Tell the first lieutenant to come here\".\n\n\"Mr J___\", he said, \"what’s the meaning of this\", pointing to the dog. The first Lieut. was mighty tickled. The Cap’n stormed. He had all the crew fell in, Sir, and came on deck with two pistols. \"Mr J___\", he said, \"I resign command of this ship to you\". Turning to the crew he said, \"I am now a man the same as the rest of you, if the man that disfigured my dog is worth his salt let him take one of these pistols & I’ll take the other, & when Mr J___ says \"Three\" we turn & fire\". He walked forward & left one of the pistols on the skylight. No one moved. \"Alright\", he said coming back, \"bring the dog here\". It was brought; he took aim & fired killing the dog outright. Turning to the crew again he said, \"Any man on this ship who has a pet of any description must shoot it tonight or I’ll have him in irons\". And every d___ dog & cat on that ship was killed, Sir; My G__, but he was a Tartar\". This seems a bit far fetched but the MAA declares it to be true.\n\n14\n\nFriday 28th : We landed again today on Gt. Palm & spent the whole day skirmishing. It was rather trying work storming some of the hills, but good practice. Two or three small snakes were seen & one was killed. We came across a grave with a small headstone stating that ___, a Papuan, had been buried there in 1908, I forget the date.\n\nOur letters are to go away tomorrow; the mail closes at 8.30 in the morning. Rigid censorship is being exercised with letters addressed to Newspapers, etc. & all postcards are read. One or two are emasculated so completely that the receiver will probably imagine that the sender is a little bit \"touched\". A few of them look like statistics of some sort with thick black or blue lines drawn in irregular lengths across the page. It may interest readers to know that there is now a feeling that it is rather \"infra dig\" to shave. Consequently there are some fine growths to be seen on erstwhile smooth chins. My own feels somewhat like the barrel of a musical box. It is rather difficult to have our things washed, but one of the stewards has decided to take it on @ 6 per article. Gent Gillam (NSW) proposes sewing 4 pocket handkerchiefs together thus saving eighteen pence. It would do you good to hear Gillam laugh; his good natured fat face wrinkles up and his diaphram quivers like a jelly, that is I suppose it does, for its voluminous covering simmers & quakes. He reminds me very much of James in \"Pickwick Papers\" whose exasperated master is forced continuously to exclaim, \"Damn that boy; he’s gone to sleep again\".\n\nCaptain Bruce, the Pilot, is an amusing character. He is of Scotch descent; I asked him if he was related to Robert Bruce, King of Scotland. He replied that he was, and added that he always kept on hand a large herd of dropping spiders. He remarked the other day that\n\n15\n\n\"the man who went to sea for pleasure ought to go the Hell for a pastime\".\n\nSaturday 29th : The weather is still very pleasant. The S.E. trade wind blows continuously; it prevails from April to October in these latitudes. The left ½ battalion went ashore today for skirmishing, using ball cartridge. At 4.45 pm the S.S. \"Aldenham\" of the E & A Company dropped anchor a few cables lengths to the southward of us. She is taking our mails to Sydney. She weighed again at 5.30 and, to the accompaniment of cheers & coo-ees from our contingent, and the frantic waving of handkerchiefs from the ladies on board, she left for Sydney, via Townsville & Brisbane. There was another boatrace this afternoon, Naval Reserve versus P & O (ship’s company). The Reserve were again victorious though they were hard pressed by their opponents.\n\nSunday 30th : We received our second inoculation today. This morning the whole of the contingent were massed on the after well deck for Divine Service, conducted by Revd ___ Chaplain of HMAS \"Sydney\". He took for his text \"Ye are not your own\" (I Cor VI.19). The address that followed was listened to by the men with great attention; personally I enjoyed it very much, as I also did the singing of the Hymns, \"Holy, holy, holy\", and \"Stand up, stand up for Jesus\".\n\n5.30 pm I have just returned on board after a delightful day. About 10 of the officers went ashore on Great Palm and dined at the Chalet, where we did justice to an excellent repast. There were also present a number of Military officers who had challenged the Naval Reserve to a rifle match. This unfortunately was won by the \"Leather Necks\". After dining we went our various ways. I with Dr Skeet, SubLt. Beresford (4th officer), the Marconi operator (nick-named \"Harky\") & several others went for a sail in\n\n16\n\none of the ship’s boats & had a very good time. We returned to the Chalet for afternoon tea where we were joined by Lt Monro (1st officer) & Dr Maguire (Military contingent). The Chalet is very pleasantly situated and is surrounded by cocoanut palms. The whole of the interior is lit by acetylene gas. Scattered about outside are a number of smaller buildings making quite a little settlement. It is used as a winter resort by people from the Mainland. Inside the dining room is a melancholy reminder of the recent past. One of the lifebuoys from the ill-fated \"Yongala\" was picked up near the Island and it now adorns one of the beams of the Chalet. It is marked \"In Memoriam, S.S. Yongala\". Near the settlement is a small stream bridged with hatch coverings & gratings from other derelicts. Altogether an interesting place. I here tasted for the first time a paw-paw or mope apple. It is somewhat like rock melon in shape but has a more piquant flavour.\n\nIn the wardroom tonight we sang some of the good old hymns, not forgetting \"Eternal Father, strong to save\". We are all hoping to find the \"Aorangi\" (store ship) anchored near by tomorrow as we will probably be able to go further on our way when she arrives. Of course we do not expect her to bring any mails; not quite! but then she night have some, might she not? We shall see.\n\nMonday 31st : Awoke this morning to find the \"Aorangi\" anchored on our port bow. She arrived shortly after midnight. How wistfully we looked at her, searching her from bow to stern & from keel to truck for letters.\n\n2.30 pm : Palm Island is a fraud. Yesterday it was Paradise, today ___? 1, 2 & 3 Companies Naval Reserve landed for target practice & it rained the whole time. Then we had to wade out to the boats & sat down\n\n17\n\non the thwants a miserable bedraggled lot. \"Never mind, men\", I said to my Company. \"Only another five months or so & we’ll be home again\". They grinned good-naturedly & pulled away together.\n\n3.30. I \ndid\n get a letter; I tore open the envelope. Ye gods! a bill for 15\/- from a Balmain pork-butcher. Hence! Peruvian Bank! Lieuts Monro & Butler have disgraced themselves. Unable to bear the rapid growth of the tropics they seized their razors & SHAVED. Champagne for us tonight at their expense; they have broken their vows.\n\n9.30 We had the champagne – thrice round. Several of the officers from the \"Aorangi\" came on board and helped in the dispatch thereof. \n\nThere was quite a merry party also from the warships. \"Togo\" (the barman) was kept busy. \"Togo\" stands about 4 ft nothing, with a small black moustache, and a swagger fit for a millionaire. Looking upon the gathering Lt. M___ was heard to remark, \"Bleeding for their b___ country, eh?\" Lt M___ is inclined to ridicule our Reserve; \"Panto Navy\" he calls it, & small wonder. He was proceeding along the fo’rsle one night & was challenged by the sentry who brought 18\" of steel close up to his breastbone with a gruff \"Halt! who goes there?\" \"Halt be d---d\", was the reply, \"I’m just going to overhaul that chain\". \"Pass chain, all’s well\", said the sentry with a salute.\n\nI hear from the \"Aorangi\" people that the \"Grantala\" (hospital ship) and \"Star of England\" are expected within the next day or two, after which the whole fleet sails for Port Moresby.\n\nTuesday Sept 1st : When we went to breakfast this morning we found another apostate, SubLt. Beresford. His chin, yesterday of a rich brown hue, was this morning smooth as the proverbial billiard ball. I am quite proud of my Forest of Arden & refuse to extirpate it.\n\n18\n\nToday the \"Bobby Towns\" from Townsville came alongside & discharged a large cargo of provisions for the expedition. Nothing of note occurred till\n\n9.0 pm : \"O what a falling off was there\" (Hamlet). My beard has vanished. Touched by the magic hand of the ship’s barber those shoots, those glorious sprouts, those blankety blank blank excrescences have disappeared, &, as an old friend of mine remarked on the death of his neighbour’s favourite dog, \"A damned good job too!\"\n\n10.30 : No sign of the \"Grantala\" yet. I must be up at 3 am to go the rounds. Bon Soir!\n\nWed Sept 2 : A beautiful morning. At 6.30 am the signalman reported \"Submarine coming from the North\". This proved to be A.E.1, of the Australian Fleet. A.E.2 appeared shortly after around the southern side of Gt. Palm & ran alongside her sister under the starboard quarter of the \"Sydney\". A whisper went round during the morning that we would weigh anchor at 4 pm & proceed northward.\n\n6.30 pm. Precisely at 4 o’clock the \"Sydney\" began to move ahead followed by the \"Encounter\", \"Berrima\" and \"Aorangi\". The submarines scouted on either side of the larger warships & the whole fleet made quite an imposing spectacle. Evidently we are going on without the \"Grantala\" & \"Star of England\". None of us are sorry to get a move on though we have not been made aware of our ultimate destination. At sunset the four larger vessels were in single line ahead with both submarines on the starboard beam. About 5.30 pm we passed Hinchinbrook Island, a large & mountainous tract separated from the mainland by a narrow channel. I believe it is one of the sights of the Barrier; of course the channel is too shallow for a vessel of our draught. Looking at the Island from the sea it presents a very fine picture. When we were directly opposite I was struck with the extreme height of the mountains, & in the dusk the cloud effects, though gloomy,\n\n19\n\nwere magnificent.\n\n10.0 : The warships are moving forward silently & without lights. On our starboard bow are two dark patches showing indistinctly against the leaden grey of the sea. These are the submarines; and they glide along under the faint moonlight watchful & alert.\n\nThursday Sept 3 : All through the night we moved onward inside the Barrier. It was estimated that we should break through the reef a little after midday. This proved to be true; we passed through Cook’s Passage at about 2 o’clock & like the schooner \"Hesperus\" steered for the open sea. Cook’s Passage gets its name from the fact that Capt Cook in the year 1770 went through the Barrier at that point. It is very narrow and the fairly lumpy sea knocked up by the South-easter broke heavily on the coral rocks. On either side is a shallow lagoon whose multi-coloured waters are supplied by the trade wind, though they look remarkably tranquil as compared with the foaming swell of the Pacific. It was a grand sight to see the submarines surging ahead & dipping their horns continuously into the dark green seas. Many times the conning towers were drenched with spray, & one could not help feeling rather sorry for the crew huddled together on that small circular platform. I have now to record a most lamentable thing. For the second time in my life I experienced the miseries of Mal-de-Mer. I can give no reason for it, the \"Berrima\" being a very steady ship. Nevertheless, it was so; & I reminded myself of a picture I had once seen of a woman lying helpless on the deck of a steamer with a man’s head in her lap, the owner of the said head being also a victim to the dread malady. A steward\n\n20\n\nwas offering her a cup of tea & asked, \"Would your husband like a cup\". She replied plaintively, \"He’s not my husband; I don’t know who he is\". And she cared less. After today she has my sympathy.\n\n9.30 pm : We (the whole fleet) are proceeding without lights & all cabins not fitted with dead-lights are in darkness. The moon lightens the heaving ocean with a ghastly light, and the submarines speed onward hardly visible save for the foam surrounding them.\n\nFriday 4th : When we came on deck this morning nothing was visible except the vessels of the fleet ploughing their way through the long swell. About 8 o’clock we passed a steamer heading south. No other vessels were sighted but at 4.30 pm land was reported dead ahead. I rushed out with my glasses but it was not till nearly 5.15 that I could make it out through the mist & spume. Shortly afterwards a searchlight flashed out a message in morse to our leaders, & the signal halyards on each ship were soon alive with fluttering flags. The sun sank & the moon rose almost coincidentally so that we approached the land in a sort of twilight. The waves dashed madly on the reef at the entrance to the harbor, the searchlight flashed continuously, and to the accompaniment of the gale rattling through our rigging we entered Port Moresby. On the rocks to the right by the wreck of the \"Merrie England\", made familiar in the works of Beatrice Grimshaw, we found that the searchlight came from the bows of the destroyer \"Warrego\" anchored at the southern extremity of the channel. After we had passed she weighed anchor and came up the harbour on our port beam. After slowly\n\n21\n\nsteaming in the wake of the \"Sydney\" & \"Encounter\" we at length came to anchor opposite the township and quickly swung round to the strong trade wind. On our port beam are the lights of the Government House; on our starboard bow lies the \"Aorangi\"; in the distance rise the hills surrounding the harbor, and we go to our bunks determined to rise early in the morning and see what is to be seen.\n\nSaty 5th : The QM’s pipe \"bare out, ‘eave out! Show a leg, show a leg!\" was unnecessary this morning. Everyone was up early & hanging over the rail. We got under way at 6.30 and stood up the channel to Fairfax Harbor where the Destroyer \"Yarra\" came alongside for stores. The ground rises rapidly from the shore and all around are brown looking mountains thinly timbered. In some of the bays mangrove swamps are in evidence, their rich green contrasting with the dry & burnt appearance of the grass covered hills. No sooner were we at anchor than we were visited by several catamarans manned by Papuans, the younger ones clothed in thin air, the elder ones clad similarly with the addition of a waist cloth. The females (in some instances) wore a kind of kilt made of grass & one was covered with a calico garment loose to the knee & embroidered with red. They had brought cocoanuts & paw paws for sale & were soon doing a brisk business, the children meanwhile keeping up a constant chatter. They know the value of English money evidently. A bucket was lowered & in it was sixpence for a paw-paw. \"Sixpence no good\", said a muscular native, \"No good paw-paw, me want one bob\", and the bucket was tossed aside contemptuously. When the \"bob\" was eventually lowered he grinned and sent up the required article. The natives are without head covering of any kind and they squat on their unweilding looking craft in the broiling sun\n\n22\n\nwithout seeming to feel the heat at all. Some of the men certainly have long hair which may offer some protection but the women’s hair is cropped short. One youngster (a boy) was the proud possessor of a waistcoat which was miles too large & reached nearly to his ankles, another had on a sailor’s jumper big enough to cover a brace of twins. Our men though good natured enough are careless & in throwing down a double tin loaf of bread caught a little girl on the side of the head. She cried piteously and the mother, with the one touch of nature that makes the whole world kin, took her up in her arms & pressed the little one to her bared and shining breast. The catamarans consist of a dug-out connected by outriggers to a light log, the whole, in spite of their clumsy appearance, being easily propelled by a single paddle handled with great skill by a native sitting in the bow or stern of the dug-out. The vessels vary in size from the family ship to the single manned canoe. Some of the natives are very adept in diving for coins & will readily strip off their scant clothing and plunge over-board for the coveted \"bob\". Every catamaran has its bundle of pine sticks which are kept alight continuously and they have a kind of cigarette holder about 2 feet in length. This is composed of bamboo about 2\" in diameter pierced at one end to allow of the entry of the cigarette. One native sucks at one end of the \"holder\" and passes it on to the next who removes the cigarette & placing his mouth at the aperture withdraws the smoke. He then replaces the cigarette & sucks the end of the holder passing it on to the next man & so on. \n\nThis afternoon a party of officers went off in a launch to Port Moresby. I was unfortunate enough to be detailed as O.O.D. & had to remain on board. They returned at\n\n23\n\nabout 10 o’clock after having spent an enjoyable time.\n\nThey made a number of purchases at the immense stores owned by Burns Philp & Co, the British New Guinea Co & the Government. They also had the pleasure of an interview with Miss Grimshaw, the well-known traveller & author. During the afternoon the \"Kanowna\" with a large contingent from Townsville came alongside & our \"swatties\" were soon fraternising with them. Although detailed as O.O.D. again tomorrow I am hoping to effect an exchange and get a run up to the town. \n\nSunday 6th : The various attempts of our party to go ashore were amusing, albeit the repeated failures were the cause of much bad language. We had decided to use on of the ships boats and had arranged for a tow by a privately owned motor launch. As we were 3 minutes longer than anticipated in lowering our boat we missed our passage. The conversational air visibly thickened. We then decided to use the sails & beat up to Port Moresby. Just as we were shoving off the captain sent on order prohibiting us from going out of sight of the ship. The air became thicker still. We then remained inactive till after lunch. At length we were promised a passage on a launch. Gaily we stepped in and gaily we shoved off. Not so gaily we returned to the gangway 10 minutes later. The engine had broken down. The air became positively vile. We slunk along the saloon deck & made for our cabins. Going on deck shortly afterwards I noticed a launch full of sightseers within hailing distance. I hailed her; she came alongside; & after a few minutes conversation with the owner our party gratefully accepted a seat in the already crowded cockpit. Away we went around the eastern point of Fairfax Harbor and headed for Moresby. She was a staunch little\n\n24\n\ncraft and ducked her head into the coamers thrashed up by the SE. Trade with a will. Time after time we were drenched with spray which flew right over the roof of the coachhouse into the cockpit. Luckily we had brought our oilskins. The launch was owned by Mr Cawley and there were his wife and two other ladies and a number of children onboard. The helmsman was a native. The Papuans make excellent sailors and handle boats of all description remarkably well. After a lively trip of about 45 minutes we arrived at Port Moresby, and Mr Cawley kindly took us to the Papua Club where we spent a pleasant hour waiting for the manager of the British New Guinea Co from whom we intended to secure a few necessary articles. The club occupies a commanding position on the eastern side of the port and from the wide verandahs exquisite views are obtained of the harbour and surrounding hills. The whole district is hilly and the fronts of the houses, which almost invariably face the water, are built up on high piers. Wide verandahs, canvas blinds, with everything open to the cool breeze ensures a pleasant relaxation after the day’s work. After completing our business at the store we went to Ryan’s Hotel for dinner. This is situated in the highest part of the town and offers very good accomodation. The dining room is lofty, fitted with electric light and fans, and delightfully cool. The waiters are natives, in most cases naked to the waist, the loins being covered with a gaudily coloured sarong. We here had an excellent meal at a moderate cost, after which we enjoyed a quiet smoke on the wide verandah, and eventually returned to the ship thoroughly satisfied with our outing. Although there were many natives in the town during the afternoon they had all practically disappeared by the time\n\n25\n\nwe were ready to embark. No natives are allowed within the precincts of the town after sunset without a permit. Order is kept by native police, picturesquely dressed in blue smocks with a girdle containing a bayonet, sheath knife & in some cases a revolver. There are one or two villages on the outskirts of the town set apart for the natives, and the \"boys\" (the males are always called \"boys’ without reference to age) must return thither after the prescribed hour. \n\nI hear we are leaving at 8 o’clock tomorrow morning for Rosell Isd, where we rendezvous with the remainder of the Australian fleet on the 9th instant.\n\nMonday 7th : At 8 o’clock this morning the \"Sydney\" moved toward the entrance of the port. The \"Berrima\" promptly followed, and before 9 o’clock we had bidden farewell to Moresby and were on our way eastward. We steamed in two lines. The port line was comprised of the \"Sydney\", \"Berrima\", \"Kanowna\" & two destroyers. The starboard line consisted of two vessels only, the \"Encounter\" and \"Aorangi\". The submarines are out of sight ahead and we shall probably not meet them again till we reach the rendezvous.\n\n9.30 pm : About midday we noticed that the \"Kanowna\" & destroyers were dropping rapidly astern. Then signals began to fly from the \"Sydney\" to the \"Encounter\". Shortly afterwards the \"Sydney\" passed us at full speed heading for the three rear ships of our line. We subsequently found that the stokers on the \"Kanowna\" had struck work as soon as they found they were leaving Australian waters. Their contract I understand was to take the vessel to Thursday Isd; from there they were sent to Papua whence they were ordered to proceed to the rendezvous. The \"Kanowna\" was sent back to Townsville and the \"Sydney\"\n\n26\n\nreplaced the \"Encounter\", which, with the \"Aorangi\" had altered her course & formed up in the van. We are again proceeding without lights all scuttles being thickly screened; hence the cabins & alleyways are like furnaces.\n\nTuesday 8th : The submarines are again accompanying us. We are now moving forward in three lines, the Northern line being \"Sydney\", \"Berrima\" & 2 destroyers; the central \"Encounter\" & \"Aorangi\"; the Southern \"AE1\" & \"AE2\".\n\n6.30 pm. During the day we sighted three vessels which proved to be the \"Murex\" (oil tank) \"Kooloonga(?)\" (collier) and \"Yarra\" (destroyer). These are also proceeding to the rendezvous and left Moresby on Sunday afternoon. \n\nI forgot to mention yesterday that at 6.30 am one company of Reserve was transferred to the \"Sydney\" from which ship they are to embark on some hazardous undertaking as soon as they arrive at the fleet’s objective. Lieut Bowen is in command and is accompanied by Sub Lt Webber and Midshipman Bullen. We are again steaming without lights.\n\nWednesday 9th : Our course is now (7 am) N.N.E. and on our port hand the land is faintly visible.\n\n12.00 noon : We have reached the rendezvous where we arrived about 10 o’c. At 8 o’clock smoke was visible on the starboard beam. This proved to be the Battleship \"Australia\". Our augmented fleet are now hove to waiting for further orders.\n\n2.00 pm : I understand that we proceed direct from here to New Britain, a German possession where stubborn opposition may possibly be met with. I accordingly now close this portion of my diary and will place it in a safe place. \"Tomorrow to fresh fields and pastures new\".\n\n1\n","15":" : During the day the \"Sydney\" with Lieut Bowen and 50 men of the Naval Contingent went forward with two destroyers towards New Britain. Bowen’s intention is to land at Kabakaul, on the North Coast, and endeavour to locate and capture the Wireless Station. The remainder of the fleet consisting of several colliers (which joined us today) & oil tanks are proceeding under easy steam. The \"Australia\" and \"Berrima\" are following close on the heels of the \"Sydney\" and are timed to reach Herbertshoe a few hours after Bowen’s party has landed. The \"Encounter\" remains to convoy the colliers & tanks.\n\nFriday 11th 3.30 am : We are now nearing our destination, and though most of our volunteers are asleep a few restless spirits flit about the deck like ghosts waiting for the coming day.\n\n9.30 am : At 6.15 our course which had been in a Northerly direction was changed to W.S.W. and we rounded Cape Gazelle and opened up Blanche Bay at the head of which is situated Rabaul, the capital of New Britain & the seat of Government for German New Guinea. Naturally we are desirous of annexing this important place. We all wonder how Bowen is fairing; he has undoubtedly landed ere this and is quite likely to meet with opposition.\n\nIt was a very fine sight in the early morning as we steamed up Blanche Bay. The \"Sydney\" and two destroyers are lying off Herbertshoe on the Southern shores of the bay. They have evidently done something apart from Bowen’s venture as the Union Jack is flying from one of the buildings and a motor yacht is even now coming our way with the white ensign at the masthead. As soon as we arrived off Praed Point our motor boat was called away and in company with two pinraces from the \"Australia\" is sweeping\n\n2\n\nfor mines prior to the flagship and the \"Berrima\" proceeding towards Rabaul.\n\n1.30 pm We are now convinced that this expedition is not going to be a mere picnic. The motor yacht this morning brought two of Bowens party severely wounded, Capt Pockley of the A.M.C. and A.B. Williams one of the Victorian Naval Contingent. There were also on board two German Officers who had been taken prisoners. Shortly afterwards the motor yacht again put off from the shore with a German Soldier whose wrist had been shattered by one of our men whilst in the act of igniting a mine. Our arrangements have therefore been considerably altered, and during the morning Commander Beresford with two companies of the Naval Reserve and a Machine Gun Section landed at Herbertshoe to support Bowen’s party.\n\n10 pm This has been a sad day’s work. Both Capt Pockley and A.B. Williams passed away during the day, and their bodies were buried at sundown at Herbertshoe. It was an impressive scene as the corpses, shrouded with the Union Jack, were carried along the deck and placed in the funeral boat waiting alongside. The companies stood at attention with bared heads whilst the officers saluted their dead comrades. Meanwhile further companies were sent ashore for the attacking force. During the afternoon several reports were received from the scene of operations. They came as a great shock to us. Commdr. Elwell, one of the finest officers who ever trod a quarter deck, has been killed and Lieut Bowen wounded, whilst several of our men have either died from wounds received or have been killed outright. Tonight a council of war was held presided over by the Brigadier and arrangements\n\n3\n\nhave been made for an early start in the morning. The \"Sydney\" and \"Australia\" are to shell the hills at daylight and the whole of our force will land, and on the cessation of the bombardment, will storm the heights and take possession of the Wireless Station. I begged hard to be allowed to go with the attacking force but as my command is unfortunate enough to be the duty company I have to remain onboard to superintend the tame yet useful despatch of stores for the landing party. Meanwhile I have been promised a chance at Yap where we proceed after our operations have been completed at Herbertshoe and Rabaul. My men are awfully disappointed at not being in the scrap, but like the good fellows they are they are throwing all their energies into the work of loading the shore boats. We are to be ready for duty at 5.30 am tomorrow so it is time to turn in.\n\nSaturday 12th : Our arrangements have again been upset but happily for a better reason. The Wireless Station surrendered unconditionally during the night so it is now unnecessary for us to land reinforcements. We sent ashore all the stores necessary for garrisoning Herbertshoe and at 3 o’clock we weighed anchor and made for Rabaul. At the entrance to Blanche Bay is Praed Pt. backed by three mountains known as The Mother and her Daughters. These heights are very steep and the summit of the Mother is always capped with a cloudy helm. There are two volcanoes here, one active the other extinct. The crater of the extinct is of immense size and has a decidedly ugly look. Passing these interesting landmarks we get a good view of the harbor with two islets rising sheer from the water. At the top of the larger one is a lonely grave marked by a cross, a pathetic tribute to the departed. On\n\n4\n\narriving at the head of the bay we found that the warships had taken possession of the NDL. wharf and had placed a strong guard at the barricade. We made fast to the wharf and immediately landed several companies of infantry to patrol the town. Outside the barrier hundreds of the inhabitants, black, white, & yellow (there are many Japs and Chinese) stared at our audacious entry. Guns crews and searchlight crews were then told off from the Naval Reserve and things on the \"Berrima\" quietened down for the night. In the silence I cannot get the thought of poor Elwell out of my mind. He left the ship yesterday full of hope and was quite boyish in his desire to be up and doing; and now – Good God! – he his buried on the heights above Herbertshoe. We heard further particulars during the day of his gallant attack on the enemys trenches. In his eagerness he led his men toward the desired goal, and was just in the act of drawing his sword for the final push when he was picked off and killed instantly. It is said by Dr Scott Mackenzie, who hastened to him as he fell, that had he not made that fatal upward movement of the arm to draw his sword he would now be alive, though with a shattered arm. It is the fortunes of war, but we could ill spare such a fine officer and genial comrade.\n\nSunday 13th 11.30 am : No 2 Company, Naval Reserve, (my own command) were turned out this morning at 5 o’clock. Our work was to go to the NDL. Coy’s headquarters, haul down the flag and lower the immense flagstaff to the ground, then to walk it away to the park and set it up again in a conspicuous place. It was the first job my men had to do in connection with the present engagement and\n\n5\n\nthey worked away like Trojans. Immediately on hauling down the flag my P.O. handed it to me as a memento of the occasion. I now have it stowed in my trunk. By 10 o’clock everything was finished and the vicinity cleaned up ready for this afternoon when the Union Jack will be hoisted and the proclamation of annexation will be read.\n\n4 pm : Have just returned from the ceremony mentioned above. We left the ship at about 2.30 and formed up on the N.D.L. wharf, the Naval Reserve (1 & 2 Companies) in blue, officers in white; the military contingent in khaki. Shortly before 3 o’clock we marched on to the parade ground with bayonets fixed and arms at the slope headed by the band from HMAS \"Australia\". The Naval Reserve were given pride of place. At 2.55 the Brigadier was received with a general salute; he then took charge. The Admiral arrived about 3 minutes later and was also received with a salute. Precisely at 3 o’clock the Union Jack at the truck was broken and the guns of the flagship boomed forth a Royal Salute, whilst the troops in the square presented arms, the band meanwhile playing the National Anthem. The men then, taking the time from the Brigadier, gave three ringing cheers for His Majesty the King, after which the proclamation was read. There were many residents present, most of them in white, relieved here and there by the bright oriental costumes of the Japanese women. The officers from the warships occupied a prominent position at the flagstaff and their cool white uniforms and helmets contrasted strangely with the semi-naked & shining\n\n6\n\nbodies of the native police who marched in shortly before the ceremony began. Immediately after the breaking of the flag the Brigadier took up his quarters at the Brigade Headquarters and the contingent with the Naval Reserve leading marched past in column of route.\n\n9.30 pm. The above account was no sooner written than our thoughts were rudely turned aside from the ceremonial to the practical. Word was received on board that the garrison at Herbertshoe was hard pressed. The enemy had reformed and were already close to the town. Four minutes after the signal was received from the flagship the whole of the starboard boats were in the water, the troops told off as reinforcements were provisioned, and the first batch was marching down the accomodation ladder ready to embark. The steam pinnace from the \"Australia\" took the boats in tow and made for the \"Encounter\" which was already under way. They clambered on board and immediately steamed down to Herbertshoe. We have since received a message from Commr. Beresford that he was holding his own and that the additional troops would not be required. As they have not returned, however, we conclude that they have landed and are being retained as a reserve.\n\nMonday 14th : Events are happening quicker than I can record them. During the night many hostile signals were flashing from the hills and sorties were made by the Rabaul garrison at intervals, not without results. Several signalling outfits were captured, happily with only one casualty. One of the natives on being challenged made for the bush and was immediately shot. Others were made prisoners & brought into town. The \"Grantala\" has at last\n\n7\n\nput in an appearance and sent over the mails from Sydney. I was lucky enough to receive a letter, the second since leaving home. I read it again & again; it was like a tonic. If the people left behind only knew how we long for letters they would surely write often. Our fleet now assumes considerable proportions and the harbour is crowded with ships of all kinds. Several captures have been made of vessels making for the port & a guard from my company has been placed on the \"Madang\" and \"Sumatra\", the former being a recruiting steamer, the latter an island trader and passenger boat. The conditions on the \"Madang\" are extremely bad. Although a very small vessel she contains no less than 88 persons. The whole of the lower deck reeks with perspiration, and the foetid breath of the natives and Chinese crammed into this foul smelling place is nauseous to a degree. I went all over her and in the midst of the squalor and filth found a little child crowing in his dusky mother’s arms. I could not help speaking a word or two, and the little black arms were held out to me in that winning way of babyhood & tugged irresistibly at my heartstrings. I shook the little chap by the hand and he laughed and gurgled, evidently thinking it great fun. Children seem the same the world over, and I find it impossible to pass them by without trying to win a smile, which lights up their little faces like a ray of sunshine.\n\nThis afternoon I went to Chinatown (as we call the Chinese quarters) to make a few purchases and afterwards visited the native hospital. The latter was very interesting although rather sickening in some respects. Drs. Skeat and Maguire, with whom I went, thoroughly enjoyed my look of disgust; they of course were in their element. The natives\n","16":"\n\ncall the hospital \"house sick\". It is a peculiar thing that though but few of the natives understand German, most of them speak Pidgin English. The \"Berrima\" is to them the \"big fella canoe all ‘long bridge (wharf)\". We all ‘b’long big fella canoe, himeby some more canoe he come, little fella, big fella, one, two, t’ree\". When we came to the hospital they all sat and squinted at us curiously, and at one ward a black attendant called out \"house sick man he come\". Immediately they rushed away jabbering to their beds where they sat solemnly with crossed legs and blinking eyes, holding in their hand a written statement of their ailments with the details necessary for their identification. \n\nOn our way back to the ship we were hailed by some of the officers of the garrison (who had taken possession of the New Guinea compagnie) to partake of a cup of tea. We accepted with alacrity, and after a pleasant ½ hour rose to go on when our attention was called to a couple of tents pitched on the side of the Mother. \n\nThese had been under observation for some hours and we afterwards discovered that they were in possession of two German officers & a band of native soldiers. A small force was sent up who, under cover of the thick scrub, got within 50 or 60 yards of the tents and drove the natives out of the trenches and captured them. The German officers escaped. There is so far no further news from Herbertshoe.\n","17":" : One of the submarines (AE1) has mysteriously disappeared and early this morning Lt having taken possession of the Governors steam yacht went in search. He was accompanied by a party of 6 picked men armed to the teeth. During the day the \"Australia\" left the port taking a large number of German officers who, as they will\n","18":"\n\nnot take the oath of neutrality, have been deported. \n\nOn the \"Berrima\" we still have 5 prisoners and all exits are efficiently guarded. No sooner had the \"Australia\" cleared the Bay than the French cruiser \"Montcalin\" entered it. She was accorded a salute of 13 guns which was returned shortly afterwards. This afternoon we received a wireless message stating that the Destroyer \"Yarra\" had gone aground and was unable to proceed. This coupled with the mishap to the AE1 looked bad and we began to think luck was against us. We were much relieved later to see the \"Yarra\" steaming up the harbour again & found that although damaged she was not altogether hors de combat. The Brigadier has taken possession of Govt House and is erecting a wireless station there. This place is about 2 miles from the town and is admirably situated for this purpose, being on the heights. The necessary gear is sent up on trucks, light tramming lines being laid all along the principal streets of the town. The trucks are pushed along by \"niggers\" (as we call the natives). There are now several hundreds of these niggers at work for us; they are kept in order by native police who though a week ago under German rule are now quite content to be Britishers, \"English he all same good fella\". Very little news filters through from the outposts; try as we will we can get no reliable information.\n","19":" : Still no news of the submarine. This morning the Brigadier and Captain Stevenson paid a visit to the \"Montcalin\" which was immediately returned by the French Admiral. Nothing of note occurred today. party returned at sundown but had nothing to report, neither had Lt Com Jackson’s party who left at the same time yesterday to search for AE1. Our fleet is diminishing. The \"Sydney\" & \"Melbourne\" have taken\n","20":"\n\ntheir departure for unknown waters. The \"Madang\" came alongside side the NDL wharf today & discharged her living cargo. The \"Sumatra\" has been requisitioned by our people and is to be utilised as a patrol steamer. She will be armed with a 12pr & a maxim gun. The steam yacht previously mentioned is also to be armed (3pr Hotchkiss & a maxim). The \"Berrima\" is constantly crowded with niggers all engaged in some way or other, either as porters of in some similar capacity. Our men have taken a great fancy to them and load them up with all kinds of trinkets and goods. It is no uncommon thing to see them with a cambric flag (Union Jack or Red Ensign) across their shoulders & the lid of a tobacco tin fastened thereon. Some, however, are more elaborately decorated, being decked in a red sarong and a Jack-tan cap with HMAS AUSTRALIA on the ribbon. Give a nigger a twist of tobacco, a trinket & a bit of Kai-Kai (tucker) and he will work till he drops. \n\nI have mentioned previously that Lt M--- refers to the Naval Reserve as the \"Panto Navy\", but for the quintessence of opera bouffe nothing can equal Rabaul. There is at present a prisoner in charge of the German authorities (now under British rule) arrested for an unnameable offence who is kept under the strict eye of the Native constabulary at night, but who by day bosses the said constabulary to his hearts content.\n\nThursday 17th : We today heard that the SMS’s \"Sharnhorst\" and \"Nurenberg\" have passed Apia, Samoa, & are heading in our direction. With the \"Australia\", \"Sydney\" & \"Melbourne\" away, the AE1 lost, & the \"Yarra\" practically a non-entity we are in some trepidation lest \"Our Island\" should be again wrested from us. We are to coal tomorrow; accordingly we are looking forward to a dirty day.\n\n(See opposite page)\n","21":" (contd) I today heard particulars of the doings of the 4 Coys suddenly called away last Sunday to reinforce Commdr. Beresford’s battalion at Herbertshoe. They found that for that night their services would not be required & they accordingly went into camp. Meanwhile plans of the enemy’s trenches had happily been discovered. A council of war was held & after consultation with Commander Lewin of the \"Encounter\" it was decided to start at 5 am on Monday & advance on Toma to which place the seat of Government had been transferred. Accordingly at daylight the troops started on their march. After proceeding as far as Forsyth’s plantation they were halted while the \"Encounter\" shelled the hills preparatory to their further advance. 16 Lyddite & 32 Common shell were sent hurtling through the morning air. They had the desired effect; the troops took possession of Toma without firing another shot. The place had been evacuated; & shortly after a message came from the Governor\n\nstating that he would present himself the following morning & discuss terns of surrender. \n\nIt eventually transpired that he was forced to surrender almost unconditionally.\n\nThis was the second occasion on which these particular troops have all the discomfort of an attacking force without actually participating in the assault. Last Friday after the Naval Detachment & Machine Gun Section had met such stubborn opposition the companies mentioned above were landed to support them. Failing to come up with them by nightfall they were to return to the shore. This they were forced to do. In these latitudes the sun no sooner sinks than darkness falls. In the gloom & heat of the tropical night they made their way back, never knowing when some concealed foe might not successfully ambush them & clean them out. They got back safely, however, & as recorded on Saturday last the Wireless Station capitulated. They therefore repaired on board the \"Berrima\" leaving only E Company as supports to Commdr. Beresford.\n\n11\n","22":" : Today Bowen (who is now convalescent), Dr Skeat, Embleton (Asst. Paymaster) & myself went aboard the \"Grantala\". We were very well treated by Revd. Hudson (chaplain), Dr James, whom I had the pleasure of meeting some years ago in Melbourne, & the rest of the Medical fraternity, and inspected the ship which we found very comfortable & admirably suited for use as a hospital ship. There are seven nurses on board with whom, however, we were not invited to converse, much to our disappointment. We returned to the \"Berrima\" for lunch after which Lt. Monro, Dr Skeat & myself drove up to Government House. Monro is in charge of the party engaged in erecting the Wireless Station there & is very proud of his staff, which consists of PO Briggs & 6 men from my own company, a number of Chinese carpenters & their mates, & a varying number of niggers. It is a very pleasant drive and the view from the grounds & spacious verandahs of the mountain residence is magnificent. On one side is the harbour with its warships, colliers & smaller vessels, on the other the blue waters of the Pacific. We drove up in fine style, our fiery steed galloping fiercely, outdoing Wendell Holmes famous \"One horse shay\". It was profoundly interesting to watch the Chinese carpenters at their work, and the shouts of their assistants added to the shrieks and howls of the niggers in their efforts to raise the immense lower mast were extremely diverting.\n\nGovernment House is a quaintly built though comfortable dwelling surrounded on all sides by broad balconies, the whole raised about 8 feet from the ground. Our troops had shown little respect for the fine furniture in the drawing and bedrooms and it was enough to make the heart bleed to see the exquisite carvings of the cabinets, bookcases, sideboards, etc. ruthlessly destroyed by the bayonets & clubbed rifles of the\n\nLeft Herb at 6.30\n\nTurned by Warrego\n\n30 sighted Schooner towing a Whaler\n\n12\n\nintruders. One cannot help wondering how they would contemplate the same disaster in their own homes. We returned to the ship at sundown after another pleasant drive down to the harbour. We heard on our arrival that the \"Australia\" is expected to return; naturally we are much elated though what will become of our mails, which a few days ago were placed on board, is a disturbing question.\n","23":" : Nothing of note occurred today till 3 o’c when the \"Australia\" & \"Sydney\" were reported in sight. Shortly before dusk they came to anchor near their original positions and immediately got busy. A collier went alongside the \"Australia\" almost before the anchor had reached the bottom. Our motor boats (commandeered vessels) also went alongside and returned shortly afterwards with about 40 German prisoners who are to be accomodated on the \"Berrima\". By the bye, we have been coaling all day, and the indications are that the work will go on all night. The work is done by Chinese coolies and niggers. The former turned up in all kinds of interesting rigs, their headgear being particularly varied. Some came with battered helmets, some with slouched hats, others with panamas, others still with hats as flat as pancakes and as large as King Arthurs Round Table, some had no hats at all, all jabbering and gesticulating wildly. The niggers were in charge of a man with grey hair, a veritable Uncle Tom – without his Cabin. \n\nI am turning in to the accompaniment of the rattling winches and the shouts of the combatants – no! I mean the coolies. In the cabin it is as hot as a furnace. \n\nWhile at Government House yesterday we came across two German field guns cast down by some blundering idiot into a steep gully where the carriage of one of them has been irreparably damaged. The other, however, is intact. We have\n\n13\n\nobtained permission to reclaim them & bring them on board the \"Berrima\". Our lads at work on the wireless mast are eager to recover them & Monro proposes that as our party were the discoverers we should bring them into town. Monro intends to bestride the nag while Skeat & I occupy the trunnion. We shall see.\n","24":" : Coaling operations are still to the fore. Dr Skeat and I escaped the horrors by going ashore and lunching at the Officers’ Mess. After lunch, accompanied by Dr Whittle (N.I.D.), we visited the Botanical Gardens. These are a sight to behold. There are thousands of indigenous and exotic trees and plants, and the grounds are laid out admirably. Passing through the gardens proper one comes to a path leading up into the mountains. The vegetation is very thick & shows all the vigour of plant life in the tropics. I here saw for the first time the cotton plant, the kapok tree, bread fruit & tamarisk. There are also cocoa, coffee, pawpaw, cocoanuts & a host of others which to the average Australian are known only in their commercial aspect. After a pleasant afternoon we returned to the ship and learned that we will probably be leaving here on Tuesday morning for Wilhelmshaven. \n\nWe were also delighted to find that a mail had arrived out of which I bagged one letter – one, ye gods! - & Dr Skeat five. I feel like the youngster in the \"Baby’s Diary\" who writes:- \"The kid next door’s got the measles, I get nothing; it’s awfully dull\". There are one or two letters for those poor fellows who died for the sake of their Country and King; there are also several addressed to the \"AE1\". These are put aside; there are still no tidings of the missing vessel.\n","25":" : Coaling went on all night. I found it\n\n14\n\nwell nigh impossible to sleep with the clatter & heat. Tonight I will take my stretcher on deck; we are to proceed with the coaling till 6 am tomorrow. Monro & Skeat went up to Govt. House today & it is their intention when they have finished their wireless operations to recover the guns. Being O.O.D. I am unable to accompany them. Our prisoners are to leave us today probably for Sydney. We have found that as a rule they are not to be trusted. Parole was granted to most of them & they were allowed to go ashore! No sooner had they done so than trouble was experienced with the natives; they (the prisoners) were doing their utmost to poison the minds of the coloured population against the British. Accordingly parole was promptly suspended & the \"Berrima\" has again become a prison ship.\n\n9.30 pm. I have just returned from the \"Mennex\" (oil tank) where Butler & I have been with the mails for Sydney. The captain of the oil tank was delighted(?) to find that he was to be inundated with passengers in the shape of 38 prisoners and a guard of 12 men & 2 noncoms. Monro brought one of the guns in tonight, though he did not bestride the nag. The gun’s crew consisted of about 10 niggers whilst Monro, Skeat & their party from the wireless plant marched proudly along the wharf whence the capture was slung inboard & stowed away safely.\n","26":" : After sending our prisoners ashore we cast off at 9.30 am and stood down the bay, preceded by the \"Australia\" & \"Montcalm\" & followed by the \"Encounter\". Our numbers on the \"Berrima\" are considerably reduced; we have two companies of Naval Reserve & four companies Infantry. The remainder have been left behind, four companies Naval Reserve under Comd.Beresford at Herbertshoe & a large garrison of Infantry at Rabaul under\n\n15\n\nColonel Paton. We cleared Praed Pt about 10.15 & made for Cape Gazelle which we passed shortly afterwards & then shaped a southerly course. During the day the coast of New Britain was visible on the starboard hand; at night the fleet moved forward without lights. \n","27":" : Our course is now west and we are to proceed thus till about sundown when we should sight German New Guinea.\n\n9.30 pm : Just before dusk the \"Australia\" altered her course to N.W. & we all followed her lead. We are now moving silently in the wake of the flagship & no lights are visible. It is a beautiful night; the air is cool and the moon, though the sky is cloudy, sheds sufficient light to distinguish our comrade ships. It is one of those nights when one can lean over the rail & watch the phosphorescent sparkles along the ship’s side, a night when even the ash-ejection adds beauty to the scene by whipping up the surface of the sea into a thousand scintillating points. A night in which to dream, except that ---? Ah! those slender projections from the \"Australia’s\" hull! Her decks are cleared for action, her guns trained on the beam. A night in which to dream? Nay! a night fraught with grave possibilities. Who knows what may be lurking in the shelter of Rook Island. Who knows that one of the enemy’s torpedoes might not even now be on its way to deal out death & destruction. With a sigh we turn from the rail & seek our berths not knowing what may be in store on the morrow. \"To sleep! perchance to dream! To dream aye there’s the rub for in that sleep what dreams may come … must give us pause\".\n\nThursday 24th : At 8 o’clock this morning I was notified that I was to land at Friedrich Wilhelmshafen in charge of the Naval Guard. About 3 hours\n\n16\n\nlater the \"Berrima\" dropped anchor off Madang (the township) and here I am. Our entry was as follows:- The \"Encounter\" leaving the fleet proceeded towards Fdk Wmshafen flying the white flag. The \"Australia\" and \"Montcalm\" remained outside, the \"Berrima\" following the \"Encounter\". Our motor boat & the \"Australia’s\" steam pinnace were meantime sweeping the entrance for mines. Under the gentle persuasion of the \"Encounter’s\" guns the town surrendered and the troops including our hero (that’s Snell!) took possession. The Naval Guard consists of 32 all told and our duty is to take charge of all boats & regulate all shipping trading to the port. The garrison is in charge of Major Martin, assisted by Capt Morrison & Lieuts McLachlan & Chambers. Their total strength is 172; included in this number is Capt Bynne (Medical officer) and a small detachment of A.M.C. The Military immediately established outposts and piquets whilst the Naval Guard searched the bays & inlets for boats. We were particularly anxious to find a motor boat as the engine is required for a Wireless Station to be erected. Up to the present we have secured several skiffs and pulling boats, 1 motor ketch (the \"Genoa\") & 1 motor boat (Derek II). The engines of the two latter, however, are considerably out of order & will take sometime to repair. The \"Berrima\" spent the afternoon sending our stores ashore. \n\nThe Naval Guard took possession of a cottage on the waterfront whilst the Garrison troops are quartered at the New Guinea Companie’s store. The members of the staff have made themselves comfortable at the Kaiserlich Post Agenttun, which will henceforth be known as Garrison Headquarters. Troops now patrol the town & sentries from the Naval\n\n17\n\nGuard keep watch on the Public Wharf. The \"Berrima\" and \"Encounter\" weighed anchor shortly before sundown &, accompanied by the \"Australia\" & \"Montcalm\", returned to Rabaul. We feel a wee bit lonely now that we are left alone but console ourselves with the thought that \"Robinson Crusoe\" & \"The Swiss Family Robinson\" were infinitely worse off than we are.\n","28":" : I today went to inspect a motor ketch discovered by one of my L’s. It proved to be the \"Lili\", about 40 ft overall, & well adapted to our purpose. As is usual, however, in such cases something vital was missing. We therefore decided to sail her back. The \"Lili\" was anchored off a plantation managed by Mr. Hoffmann who is apparently away at Rabaul, at least that is what I understood the overseer (a Malay) to say. We searched the native huts & the owner’s quarters for firearms, and soon had a collection of knives, bayonets, revolvers, flasks of powder etc. The natives stood back while my men with bayonets fixed passed through the dwellings looking for any thing that could be classed as munitions of war. We took only the revolvers, powder, and a bundle of charts. \n\nWhen the niggers saw that no harm to them was intended they loaded up the men with cocoanuts, pawpaws etc. Returning onboard the \"Lili\" we hoisted the sails (Jib, mainsail & mizzen) and with one of the niggers at the helm weighed anchor. He appeared to know the channel very well, and I can tell you it took some knowing. Shoals are scattered broadcast in this beautiful but treacherous harbour. In some places it is impossible to run on a course \n\n18\n\nfor more than 50 yards. All went well for a while but in endeavouring to claw off one shoal the \"Lili\" missed stays and began to drift rapidly to leeward. Under our port quarter were the jagged tops of the coral rocks. I unceremoniously pushed the nigger from the wheel, put the helm hand up & eased off mainsail & mizzen. She gathered way & luckily cleared the shoal by the \"skin of her teeth\". I hung on to the wheel myself after that feeling sure that I could do better than our dusky pilot. I was mistaken, however, for within 2 minutes another shoal was seen a few yards to leeward. Down went the helm, the jib was let fly & she luffed. She again missed stays; the men got one of the long sweeps out & pulled away – twice, thrice, - crack! the oar snapped like matchwood. Before another could be got out she had sagged away towards the shoal. There was an ominous bump, then another. Then across the outer edge of the shoal ran a line of foam. The \"Lili\" hung poised for a moment on a rock & was then lifted up bodily; she heeled at an awful angle & visions of shipwrecks & island catastrophes came over my mind. I was about to order everyone into the dinghy when, thank God! she scraped clean & slid over the shoal with about an inch & a half to spare. I reckoned we had done about enough for one day so let go the anchor when sufficiently clean. We then snugged down everything & left her, intending to return on the morrow.\n","29":" : There was so much to do today that we were unable to go back for the \"Lili\". I have established a guard at the lighthouse whose duty is to immediately report any strange vessel in sight. In a day or two we expect to have telephone connection\n","30":"\n\nbetween this important post & the Garrison Headquarters. Various other matters, too trivial to record but necessary for the adequate maintenance of our defences, occupied my time today & I sought my couch (id est my seventeen & sixpenny stretcher) at an early hour.\n","31":" : \"O day of rest & gladness\" – I don’t think. This morning at 9.30 we had a church parade. There was one company of Infantry, portion of the Naval Guard, and the Army Medical Corps. The latter party have taken possession of Govt. House which they have converted into a hospital. The situation is beautiful. The Governor’s residence is built on a small peninsula on the Eastern outskirts of the town. It is delightfully cool & is surrounded by huge verandahs where one can sit & enjoy the cool trade wind. Away to the westward rise immense mountains clothed with thick tropical verdure. In front is a stretch of water blue & sparkling, with here & there patches of coral rock surrounded by the foaming breakers. Opposite is the Belaio hospital, one part set aside for Europeans & the rest occupied by natives under medical treatment. The Major conducted a short service after which the men were marched back to their quarters. \n\nAfter lunch I took a party of men to bring the \"Genoa\" round to our depot, where she is to be overhauled by one or two motor experts whom we are fortunate enough to have found among the Garrison troops. The \"Genoa\" now lies at the Headquarters wharf.\n","32":" : After the ordinary routine this morning I drove out to the lighthouse, where I found everything O.K. & the telephone nearly completed. At 1 o’clock I left with 5 men to bring back the \"Lili\". This time we succeeded in\n\n20\n\nour efforts & she is now anchored near at hand.\n","33":" : I today established several naval signal stations which will considerably reduce the amount of trotting about hitherto necessary for the carrying out of our duties. At 4.30 this afternoon we had an interesting ceremony. The native police have now come under Garrison supervision & the Major decided to present them with their rifles & swords (taken from them upon our occupation of Madang) and to give several of them ratings equivalent to British non-coms. All men belonging to the Garrison who could possibly be spared were present, the Naval Guard occupying the right, the Infantry the centre, & the Native Police the left. After the presentation the Police went through a few Rifle Exercises & parade movements & they did credit to the remarkably efficient drill of their German instruction. Of course there were several amusing things noticeable. For example when stepping off they begin with one or two short steps like the introductory movements of a pas seul; the sergeant then gives the order \"grrrmpsqvxiup!\" (or something of the kind). They give an extra thud with one foot & step out much in the style of the ballet dancers in comic opera. Numbering off is a thing to be remembered. As each man calls his number he looks at the man on his left. The last man of the line looks straight to the front until the antepenultimate trooper has called. He then turns his head to the right at precisely the same moment that his neighbour turns his to the left. Glaring fiercely at each other they call \"furp\"! One feels rather disappointed that nothing serious results therefrom. After the parade the native troopers were marched to the barracks set apart for them.\n","34":"\n","35":" : The wireless mast and necessary rigging was finished today, and at 2.30 this afternoon it was raised into position. I was not present at the time being away on a boat examining the bays & inlets westward of the town. I penetrated for some distance into a mangrove swamp but could find nothing worth commandeering. The place smelt like a sewer & mosquitoes were there in swarms. One could easily imagine all kinds of diseases & fevers in such a place. We came across several fish traps made by the natives. These traps are very ingeniously contrived with reeds & the foliage of palm trees. We were glad to get out of this noisome place into the fresh sea breeze.\n","36":" : This morning I took a party of 5 men & sailed up to Sian Island, a deserted mission station. I had visited this place when examining \"Lili\" & had noted an old bell in the mission church. It is an immense thing, & the Major is desirous of having it placed at headquarters on which to strike the time of day. We already have a bell at the Naval Depot which is sounded \"accordin’ to (Naval) regurlashuns\". After some trouble we succeeded in getting it on board & brought it back to the Base. My lads are very anxious to take it to Sydney with them to be used at Rushcutter’s Bay.\n\nAfter lunch I took a smaller party up Jamba Ck in which we thought we might find a motor boat or two. There were none. Nevertheless, the trip from a scenic point of view was a great success. To quote the expression used by one of the men, \"I have been in a good many places, Sir, but I have never seen anything in any part of the world like this\". The Creek is about\n","37":"\n\n20 feet wide and winds in & out among the trees for miles. On either side are the most beautiful palms whose fronds bend gracefully over the channel. It is one of those waterways wherein one can imagine nymphs disporting themselves, where the dusky Oberon is want to woo his Titania. I would not be very much surprised, however, to find that the nymphs are alligators in disguise, and that the insects annoy the Fairy King & Queen so much that their halcyon existence will be cut short by a bad attack of malaria. But of course there is a fly in every pot of ointment – in this instance it is a mosquito. If the Directors of the White City could transfer this scene to their gardens, the Sydney Public would throng the enclosure night & day. As we proceeded up the creek the palms gave way to plantations of rubber, bananas, cocoanuts & pawpaw. The rubber trees are particularly interesting; deep scores are cut diagonally in the trunk & branches converging into a still deeper channel running along the centre. Rope-like trailers descend from the upper branches to the ground. These take root & in time rival the trunk in thickness so that the older trees appear to be at the base one huge network. We returned to the Naval Depot vastly pleased with our excursion.\n\nFriday 2nd : Today was spent in rigging one or two of the sailing boats & preparing the signal mast at the Naval Depot.\n","38":" : This morning I proceeded with the examination of the foreshores near the depot & this afternoon went up Gauta Ck as far as possible. Our progress was stopped by an enormous fish trap which spread\n\n23\n\nright across the channel. Leaving the boat we went on by land. Striking across a big plantation of banana, cocoanut, pawpaw etc we came to an excellent road which eventually led to a bridge over the Gauta, the navigable portion of which ends here. There is no doubt that the Germans do things extremely well. The roadway is fine & the bridge is a sight worth seeing. It stands well above the stream & is roofed with thatch, making a cool halting place for travellers. One of my men took a photograph of the structure & later snapped two natives coming along the road. The natives out here dress picturesquely though their covering is scant. Their long hair is often dyed or powdered & is frequently decorated with hybiscus, frangipani, or other flower. Our quest for motor boats was vain; the only craft we saw were a catamaran & a ship’s whaleboat. When we returned the signal mast at the Depot was in its place & gave it quite a business-like appearance. A hockey match was in progress on the Recreation Ground & resulted in a win by H company over E company (Military) of 2 to nil. The various portions of the town have been re-named subject to the approval of the Government. Holmes Harbour is to be the designation of the port, one portion of which is to be called Watson’s Bay, another Commonwealth Bay. The streets are named after the officers of the Garrison. The space in front of the Post Office is to be known as Martin Place (after the Major). It is approached by Morrison Road (after the Captain). My name is to be perpetuated by naming one of the\n\n24\n\napproaches to the wharf Read Parade. McLachlan St, Chambers Crescent, and Bynne Parade have been named after other \"celebrities\". We are rather proud of the street nomenclature & are extremely anxious to acquaint John Sands in time for the new Directory.\n","39":" : Church parade was held this morning at 8.30 for R.C.’s & 9.30 for Protestants. Father Ricken (German missionary) officiated at the R.C. Parade & Major Martin took charge of the Protestants. The men were afterwards allowed to spend the day as they pleased. I accompanied a party of officers & the \"D.T.\" war correspondent on a shooting excursion. We went up Gauta Ck. but had very poor luck. On our way back we called at a plantation hoping to obtain refreshments. The owner was away – so the natives informed us; we therefore took possession pro tem. We came across a gramophone and a large number of records; this proved a treat, & after hearing no music for so long we thoroughly enjoyed it. Imagine our pleasure to find inter alia records of Tannhausen! Lohengrun!! Traumenei!!! One rather picturesque sight we came across was a group of four bush tribesmen who had tramped for miles to see \"big fella Engleish soljer\". They were decorated with necklets of dogs teeth, armlets of painted grass, nose rings & bones, the hair decked with tufts of red & yellow feathers. They were entirely naked except for the above articles & a loin cloth made from some kind of leaf. They swaggered about smoking native cigarettes & showed neither fear nor respect. As they passed through the cane brakes in single file they reminded one very much of what one reads of the N.A. Red Indians, their gaudy plumes nodding above the long grass. We returned to Madang at dusk\n\n25\n\nand found everything O.K.\n","40":" : Eight hour day in Sydney – also at \"Holmes Harbour\". The men sent in a request for permission to hold a procession. This was granted, and I venture to say that the trades unions in Sydney would have gone green with envy had they been present to view the pageant. All the representations were excellent & it is hard to discriminate, but those which received the greatest appreciation were \"Neptune\" & his missus\" (the latter looked charming), \"Chidley\" (done to the life by Private Bullock of the BofA, Sydney), & \"Napoleon\" (with cocked hat & tricolor). A fiery looking Mephisto struck terror into the hearts of the natives, who rushed away madly out of the reach of his trident. One banner was inscribed \"What a \nrum\n idea\" in allusion to the shortage of this spirit, & a cocoanut marked \"The limit\" was hung dolefully from the same staff. \"What we left our home for\" was symbolised by hard ship biscuits & tins of \"bully\" beef. One wag carried a banner with the legend \"A New Guinea for our Sovereign\" & the failure of the Marconi operators to raise Rabaul was lampooned by \"Wireless off! try a ‘phone\". Altogether it was a great success and broke the monotony of garrison life, though I am afraid that the German residents hardly knew what to make of it all.\n","41":" : This afternoon I went as far as possible up \"Heiss Passage\", a creek running into the Western portion of FdkWmshafen My party then landed & cut across to the North Coast Road. All the country intervening is deserted & consists of plantations of bananas, pawpaw, sugarcane & at intervals cocoanut. Scattered about are many native\n\n26\n\nhuts, now fallen into decay. These huts are to be seen all round the district & are very interesting in their way. They usually consist of one storey, the floor of which is raised from 4 to 8 feet above the ground. This floor is made of split bamboo or some other light material. The roof descends almost to the ground & is made of plaited palm leaves. Idols & totems abound & various examples of crude art in the shape of roughly carved doorposts etc are frequently to be seen.\n","42":" : At about 7.30 last night a telephone message from the lighthouse was received stating that lights were visible at sea & that morse signals were being sent from Gragat Island (to the north of the entrance). I immediately hurried out and found the guard in a state of mild excitement. After waiting some time I picked up the light at sea apparently being used as a signal; there were no steaming lights visible. The lights on Gragat, however, were simply the fires of the native fishermen. I decided to remain at the lighthouse for the night. It was the first time I had been out there after dark & it struck me as a very uncanny place. The building itself is simply a wooden structure of three tiers the top floor containing the light & is exposed on all sides to the weather. At the base is a small room built of galvanised iron which has evidently been used as a shelter for the natives detailed to attend the lamp. It is about 12 feet from the water’s edge & the uprights are let into the canal which is here very sharp & jagged. The sea breaks continually over the shelter & if there is a swell of any size the spray goes right over the top of the building. Along the edge of the foam countless fireflies (or rather beetles) flit about giving a very\n\n27\n\nweird effect. The light at sea remained visible till about 9 o’clock after which it disappeared. As we have extinguished both the leading lights of the port it is unlikely that any vessel would attempt to enter till daylight. I telephoned t l that effect to the Major & turned in. I awoke at daylight but nothing was in sight. Nevertheless, the Military officers had decided to take no chances; their men were in the trenches at 5 o’clock & a strong guard was posted over the stores. These were withdrawn at about 6.30. So ended our first scare. By the bye today is my birthday but I can receive no greetings in this out of the way place. This afternoon I went for a trip in the \"Lili\" which has now been thoroughly overhauled. She behaved very well & in future will be our \"flagship\".\n","43":" : Today we went to Karl Hafen, an inlet on the Western shore, in the \"Lili\". She is a brute; broke down about half a dozen times, generally just as we were in uncomfortable proximity to a shoal. A good deal of excitement was caused at one island visited by us; the natives rushed hither & thither evidently in great trepidation. Some climbed cocoanut trees, others ran behind bushes & into the plantations. The natives have a way of climbing the trees peculiarly their own. First a small length of rope is fastened to their feet, holding them about 9 or 10 inches apart. They then place their hands around the trunk of the tree & press against it with their feet. Thus they mount to the top much in the manner of the monkey-on-a-stick of our childhood’s days. They generally carry a large knife with them which they use to lop off the cocoanuts and branches. A nigger\n\n28\n\nis always willing to climb for you providing you present him with a biscuit, a stick of trade tobacco, or a cigarette. For one biscuit I have often obtained 3 or 4 paw-paws (pronounced by the natives pawpayah) or cocoanuts. The milk of the latter is very refreshing & when on an excursion we generally discard our water-bottles in their favour. As we did not start on our trip till fairly late we had no time to make a thorough examination of the vicinity beside which my lady \"Lili\" wanted a good deal of coaxing.\n","44":" : Two short trips were made today. The first one was to a plantation a few miles away where we did some rather good bartering; - that is good from our point of view. For a bag of rice we obtained (on loan) a ship’s anchor, 6 cases of benzine,1 doz cocoanuts, & a GRAMAPHONE with 60 records. Rather a good haul, eh? In the afternoon we searched the foreshores of Ganta Ck for a tree suitable for a new wireless mast. The present installation is not too successful. Neither was our search; there were a few straight trees but these were so sappy that it would be impossible to float them down the Creek, besides which they would be too supple for the purpose. At the head of this creek there is a large plantation of kapok trees. From a distance these trees look like telegraph poles with their straight trunks & horizontal branches from which the pods hang like insulators. We returned to Madang at dusk & found a native waiting patiently for the Major’s arrival. He was an applicant for the heart & hand of a \"Mary\" who had taken his fancy. The natives call all their womenkind \"Maries\" & it is no uncommon\n\n29\n\nthing for a band of them to go into the bush country searching for a suitable partner. The consent of the Government is necessary before the marriage is made legal. Major Martin is in these cases the matrimonial official. Most of the German households contain one or more \"Maries\" as part of the domestic staff; they are continually smoking – a clay dab for preference - & their offspring, even children of 9 or 10 years, are seldom without a pipe of some sort. The office of the \"Minister for Matrimony\" is no sinecure, as the divorces are almost as numerous as the weddings, and the Major is kept pretty busy adjusting matters satisfactorily.\n","45":" : Today I took an armed party up to Alexis Hafen which is the next harbour of any size north of Madang. It is one of the ports of call for the steamers of the N.D.L. who visit there after leaving FdkHmshafen . The party, consisting of myself, one P.O. & 8 men went up in the :Lili\". On approaching the harbour we hoisted the white flag, being desirous of making a peaceful entry. We found that news of the occupation of Madang by the Expedition had reached the inhabitants by native runners, consequently we encountered no opposition. Almost the whole of this district is controlled by the Kath Mission (R.C. Mission) who have a very fine machinery plant established. It is the Central Mission Station of German New Guinea, and there is a small army of boatbuilders, mechanics, engineers, etc, besides innumerable Malay, Chinese, & Kanakas engaged in almost every conceivable occupation. We took possession of about 30 rifles & shotguns & also the motor boat \"Ramu\", and the Island schooner \"Penguin\". Instead of proving hostile the Fathers of the Mission\n\n30\n\ntreated us with the greatest hospitality and showed us all over the immense plant & store-rooms. After some little trouble our engineering staff got the \"Ramu\" into working order and we returned to our Depot quite satisfied with the results of the trip. We are thinking seriously, however, of transferring the engine of the \"Ramu\" to another of our prizes as she leaks rather badly.\n","46":" : Last night we had a foretaste of the wet season. About midnight it began to rain in torrents and continued practically all night. We have been preparing for this during the last week or so & Dr Bynne has had large parties at work cleaning out the drains & trenches. The S.E. trade wind which is such a god-send in the tropics has been gradually petering out & boats using sails are becoming like the craft of the \"Ancient Mariner\", \"idle as a painted ship upon a painted ocean\". Tonight there is not a breath of air & the reading lamp is almost concealed by myriads of flying ants. The members of the Mess have severely censured me for bringing home the gramophone, and want me to return it & bring back the bag of rice! They are mighty particular; for there is nothing wrong with the ‘phone except that a new speaker, new horn, & new works would be an improvement. The case is faultless and makes an excellent dinner waggon.\n\nWe held our usual Sunday services this morning. This afternoon we took the \"Lili\" to Tab Island where a small shooting party landed after Wanga pigeons which are very plentiful here. The water around this island is gloriously clear & the sponges, coral, bech-de-mer, & all the other quaint growths common to the tropics can be\n\n31\n\nplainly seen at immense depths. Several pigeons were shot which were taken back the headquarters where they will form a pleasing change to the eternal bully beef, though our cooks disguise the latter very well. In fact our menu is a very creditable one. The rations include dried fruits, potatoes, onions, cheese etc, & when these are augmented by various sauces, &, as dessert, pawpaws and other native fruits, we have a repast fit for a king. Our people at home probably have visions of their loved ones lying on their stomachs in some mangrove swamp, peering fearfully round the gnarled roots at their vindictive & bloodthirsty foes, whilst bullets whistle round their devoted heads, the said heads being at the same time the nesting place of millions of mosquitoes. These discomforts may come, however, at any moment. Meanwhile let’s eat, drink & be merry for tomorrow – is Monday!\n","47":" : A routine day, nothing out of the way, except that we went to Gragat Isd in the \"Lili\" & took possession of the Mission organ for use at our church services (by permission of Revd. Blumin). The cleaning out of the town drains is being proceeded with, Dr Bynne’s band of native boys & infantrymen doing excellent work. These boys are gradually adding new words to their vocabulary, slang & swearing naturally predominating. The two words \"damn\" & \"bloody\", used among English soldiery oftener than any other words in the language, sound remarkably funny from the lips of a nigger. The latter word is generally pronounced by them \"plurry\". An example of its usage is shown in the following incident. One afternoon when the men were indulging in their daily swim, they were joined by one or two of the natives. A private challenged one of the\n\n32\n\nlatter to a contest in which they were to decide who could remain under water the longest. They dived together, the native going straight to the bottom where he sat for fully 80 seconds. The \"Tommy\" of course could not hold out & came to the surface, then when he saw his opponent rising dipped again, little knowing that he was being watched from below. They came up together, & the native excitedly blowing the water from his mouth exclaimed, \"Plurry liar!\" The assembled Tommies roared with delight.\n","48":" : \"Oh Katie what I endured for your sake!\" said Lawrence Aylmer in Tennyson’s \"Brook\", but he surely never endured half as much as we did on the \"Lili\" this morning. We had arranged another trip to Alexis Hafen to start at 5.45 am. Everything was ready – except her ladyship. She absolutely refused to budge till ¼ past nine at which hour she started off in the usual contrary way of womankind & ran without a hitch all day. The air in the engineroom during her distemper was thick with smothered oaths & blue with high-sounding phrases. We again visited the Mission Fathers and towed back the island schooner commandeered by us last Saturday. She is ancient but comfortable, & it is my intention to have an Examination anchorage party continually on board whose duty will be to board incoming & outgoing vessels.\n\nShe will be anchored under the lee of Grajat Island. During this visit we also took possession of a fine new motor engine which we hope to install in the \"Derek\", a handy little craft about 20ft long.\n","49":" : Routine day the monotony of which was broken by my introduction to Albert. Everybody\n\n33\n\nknows Albert by sight. He is a little black piece of humanity about 24 inches long and he lives with his mother a short distance along our street. To my knowledge he has never been guilty of wearing a stitch of clothing, and he plays about in front of his residence the whole day. Should an officer pass down the street Albert leaves his play and stands solemnly at the salute. The officer is careful to make no friendly advances - Albert wouldn’t stand that; he would be off like a shot to his mummy. Over at Grajat there are two children, Germans, named Blumm; the elder, Willie, being 6 years, the younger, Freda, 5. Our conversation with them is rather limited owing to our very meagre knowledge of German & their equally meagre stock of English. They have now, however, changed their \"Auf Weiderschen\" to \"Good Bye\" & their \"yah\" to \"yes\", which is encouraging. They will always come to see us off when we are leaving, & squat on the side of the hill waving their little hands frantically till we are out of sight. Dear little kiddies – friends of the enemy.\n","50":" : Another routine day; repairing boats; fitting out the \"Penguin\"; & generally straightening up. About 8 o’clock tonight one of the Police reported that signals were being made from Commonwealth Bay to a point on the opposite side of the harbour. We took a few men in our No. 4 boat & quietly dropped down towards the Bay where we remained drifting for about an hour. Nothing transpired & we returned to the Depot satisfied that the Police were mistaken.\n","51":" : This afternoon we took the \"Ramu\" to Sian Bay Plantation in search of boats. We found 2 (whalers). As we were on the look-out for smaller craft we passed these over, though they have been noted for future occasions\n\n34\n\nshould they be required. It is mighty hard work trying to make the German residents understand our requests, and the continuous waving of arms and nodding of heads, facial contortions and anxious expressions are very laughable (when it is all over). While it lasts one perspires copiously & feels like a fuzed shell – liable to explode at any minute. \n\nMost of these plantations consist solely of cocoanut trees, though we often come across large tracts of country given up to rubber, while others are used for bananas, pawspaws, and kapok. When walking thro’ a grove of cocoanut palms one frequently hears a heavy thud; this is either one of the nuts falling to the ground or a palm branch breaking off close to the trunk. In the former case no warning is given & we are constantly imagining we can hear rifle shots, particularly when they land of the iron roof of an outhouse. It is remarkable that very few cases occur of people being struck by falling cocoanuts, they seemed timed to drop either before or after the passing of pedestrians.\n","52":" : I was ordered this morning to take the \"Lili\" to Alexis Hafen and arrest three brothers of the Kath Mission who are accused of ill-treating a Manila-man in their employ. The victim, accompanied by his 9 year old son (Vincent Torres by name), came with us to identify the culprits. At first the Brother in Charge was inclined to refuse our demands, but when he saw by our rifles & determined attitude that we meant business he caved in, & our passenger list for the return trip was increased to five. It seemed rather ungrateful to make a hostile entry after their kindness last week – but What would you? \"Dooty is dooty\". The brothers were cautioned against a\n\n35\n\nrepetition of the offence & the incident closed.\n\nOur mechanical staff have made some very creditable morse lanterns out of Kerosene cases. A 3\" aperture is cut in one side & over this fits a metal slide attached at on end to a spring, at the other to a wire thumb piece. We find these very useful for night work. The \"Berrima\" left us absolutely devoid of signalling outfit; and we are pardonably proud of our present well-equipped signal stations; for which we have no one to thank but ourselves, & which we believe will rival those at Herbertshohe & Rabaul.\n","53":" : A gloriously lazy day. Our usual Church Parade was held at 9.30 and the hymns went much better to the accompaniment of the organ. \n\nThe men were granted leave till 5 pm & went their various ways. I spent the afternoon copying my diary in preparation for its despatch to Sydney.\n","54":" : I visited the lighthouse this morning & found things very much more comfortable. The LS in charge had worked hard during the week and the men are now quartered in a large room built of galvanised iron & fitted with several bunks arranged ship fashion. After a deal of searching the Military & Marconi officers have discovered several trees which will suit admirably for an additional wireless mast. This morning they are busily engaged in preparing the ground for its reception while the splicing experts of the Naval Guard are going ahead with the wire stays.\n\nI am afraid that we will all become what Fred Graham in \"San Toy\" used to call kleptolunatics. We see an article which just suits the needs of the garrison\n\n36\n\nand we take possession thereof. My particular penchant is boats and I no sooner clap my eyes on a suitable craft than I clap my hands on also: - ergo, exit boat. Sydney boat-owners beware! We found a fine whaler this afternoon; she is well built & rides like a duck. In our usual lordly way, we tore a leaf from out note-book & gave a receipt for it, much in the way that Mr. Micawber used to give his note of hand, straightaway discharging his debts. \n","55":" : A routine day; the monotony of which was broken by a trip to Sian plantation in search of another wireless \"stick’. We have other ways of breaking the monotony, of course, such as keeping out of the way of the huge wasps which buzz around our heads while we write up our reports, to say nothing of frantic attacks on the hundreds of mosquitoes who come unbidden to our meals, our card table, our beds. These wasps are as pushing as - a Britisher. They make their homes in all parts of the house without respect of person or place. The Major was about to put his cap on the other day & found it occupied by an angry wasp who had built a nest therein and objected to being fired out.\n","56":" : Today I went with the Major & his interpreter, Sergt Munro, to Alexis Hafen where the Mission Fathers & his associates took the oath of neutrality. At the same time the Major made enquiries into the case of a native who had been well nigh hacked to pieces by savages at Dampier Island, which place is about 40 miles north of Madang & about 10 miles from the coast. The man had eight wounds, any one of which would have killed a white man instantly. Marvellous to relate, however, he still lives though it is probable that he cannot last long. It is quite likely we will dispatch a punitive expedition, as having taken over the Government of Deutsch New Guinea,\n\n36a\n\nMEMENTO OF THE NAVAL MILITARY GARRISON SPORTS\n\n37\n\nit becomes our duty to look after all classes & to punish evil doers.\n\nThis afternoon a beginning was made towards erecting the new wireless mast. The lower span measures over 100 ft while the topmast is 60 ft. When finished this should give good results. So far we have been unfortunate in our wireless. The operators occasionally pick up faint messages but their own waves apparently lose themselves in space.\n\nThurs &","57":" &","58":" : Details of ordinary routine are irksome, hence I will pass them over. On Thursday we towed the \"Penguin\" out to Gragat Island and established the Examination Anchorage.\n","59":" 1.45 am : I have lain awake half the night. Although the new wireless mast is not yet completed the aerials were hoisted up as far as possible & at last we have good results. I have just been over to the operator’s room & read an ethergram received from Port Moresby. Of course the news could not be bottled up & the whole of the Officer’s Mess crowded round in their pyjamas to peruse our first message from the outside world. We are looking forward to something even better.\n\n9.30 pm : No further messages were received last night, but we are still very sanguine.\n\nThis afternoon a sports meeting was held by the garrison troops and was a great success. The events which excited the greatest interest were the High Jump (won by Private Spanks), Relay Race (won by E C) & ½ mile running championship (won by A.B. King, Naval Reserve). The whole of the Garrison turned out and many of the Natives & German Residents attended.\n","60":" Usual Sunday Routine; church parade\n\n38\n\nat 9.30 am, then liberty for the men. When walking down to inspect the quarters this morning I noted the names placed by the men on various buildings. The sentry box was called the \"Dew Drop Inn\"; the double meaning pleased everyone immensely; the Quartermaster’s store (whence are issued the Rations) is marked \"Kai Kai Cottage\". On the weighing machine is the following (abridged) inscription\n\n\"Any one asking the Quartermaster for his weight is liable to be insulted. There are hotter places to go to than New Guinea\".\n\nBut the height of originality was reached when one the Naval Reserve christened a captured steam launch \"Prickly Heat\".\n\nThis afternoon in answer to an invitation I with two other officers had tea with Revd. Blumin, Protestant Missionary, Gragat Isd. I have mentioned this place before; it is situated right at the harbour entrance and there are on every side glorious views. From the Eastern shore one can see right down the coast, and on the harbour side an uninterrupted view of the islets & bays with the densely wooded slopes of Hansemann Berg in the background make a fine picture. Herr Blumin treated us most royally & the only drawback to an otherwise successful afternoon was that the children had gone to the Mountains for a change of air. They are to be away a month; after becoming used to seeing them on former visits it was a great disappointment to learn of their absence. We talked on all subjects, particularly the war & its attendant disabilities. We coasted round the words which were difficult of translation, we backed & filled, tacked and ran free, struck shoals, got into deep waters, & suddenly on occasions would find our conversational anchor had fallen from the cathead & we were brought\n\n39\n\nup all-standing. On our way home it was difficult to talk in straight-out English after the laborious chat of the afternoon. Nevertheless, we enjoyed the outing.\n","61":" : We were this morning ordered to Alexis Hafen and on this occasion were accompanied by Dr Byrne who was to confer with Dr Klasten on the native murderously attacked at Dampier Isd. Strange to relate we did not commandeer anything much to the Revd Fathers’ surprise I think. We returned to Madang at about 6 pm.\n","62":" & Wed 28 : Routine Days. When at the lighthouse today (Wednesday) I was amused to see their arrangement for striking the time. An iron hoe was hung from the nail of the lantern enclosure & this was struck with a mallet. Previous to this arrangement a cord was attached to a \"bully\" beef tin; a jerk on the cord caused the tin to strike the iron roof; eight bells became an musical item. A sailor once is a sailor for all time; he must have his ship’s bell & his flagstaff; you tell him to starboard his helm; \"Starboard it is, Sir\", \"Hard-a-port\"; \"Hard-a-port, Sir\".\n","63":" : I am leaving at daylight tomorrow morning for Alexis Hafen, where the \"Lili\" is to fitted out for the punitive expedition.\n\n40\n","64":" 9 pm : We returned tonight after a two days stay in Alexis Hafen, where the \"Lili\" has been refitting preparatory for the punitive expedition to Dampier Island. All the \"boys\" at the Mission have heard about our intended trip and bothered us every half hour or so with enquiries, while several tribesmen from the hills in full war paint came along evidently wishing to join us. They went about it in the usual indirect way of the native; they squatted on the wharf blinking their eyes and scratching themselves – they all scratch - & making various grunts & gestures. At length they remarked, \"you go along Kanakan\". We told them not yet. \"Ship he stop?\" \"Yes\". \"Ugh, ship he stop, bimeby you go Kanakan\". Kanakan is the name of the station where the outrage was committed. I felt like a character from \"Puss in Boots\" with the continuous references to \"Kanakan\". It is our intention to have another motor boat fitted out in addition to the \"Lili\" to take some of the Native Police who are to accompany us.\n","65":" 6.30 pm : This has been a day, a glorious day. We had just sat down to breakfast when the telephone bell rang & I was wanted. The Lighthouse reported \"ship making for the harbour\". The weather was so misty that she was invisible until within a mile of the heads. I reported to the Major, and then called up the Depot to have my gig manned. Suddenly we heard the blast of a steamer’s whistle. Good God! What a sound! Germans rushed from their houses, natives stared open mouthed at the harbor entrance, swaddies & sailors lined the water-front as the S.S. \"Matunga\" swung past Hospital Point & made for Watson’s Bay. What a cheer went up; what waving of hats! I hurried to the Depot, ordered \"Dress ship\" & jumped into the gig. The flagstaff, the \"Lili\" & the \"Penguin\" were\n\n41\n\nsoon alive with flags & just as the anchor dropped I ran up the gangway & shook hands with Eng Lt Cresswell, who quickly piloted me to Capt MacInnes. Major Martin followed in the Police boat. Shortly afterwards she came up to the ship. The visit of the Matunga was for two purposes, to bring stores for the garrison & to open negotiations on behalf of Burns Philp & Co for the export of copra & other native products. She brought 10 bags of mails for us containing letters & papers that have been wandering about the Pacific for the last two months. What a time we had; FdkWms Hafen Post Office had never seen the like. The sorting room was a mass of letters, papers & packages. We whipped off our coats & worked like Trojans, the perspiration pouring off us like water. Our usual Church Parade was forgotten; instead all hands turned to the unloading of the ship & the erstwhile quietude of our little town was rudely broken by the harsh but welcome rattle of the winches. The work continued till sunset and will start again first thing in the morning. The \"Matunga\" is to leave at 3 pm tomorrow for Alexis Hafen & the \"Lili\" will proceed thither the next day.\n\nI omitted to mention that while at Alexis Hafen I was visited by Vincenti Torres, the youngster whose father was maltreated by the Missioners some days ago. He brought his little brother, Alphonse, with him; he presented me with a large bunch of bananas, some cucumbers & a cake specially made for me by his mother. I don’t know how it is but these youngsters do get a hold on me.\n\nYesterday afternoon the Garrison held a water carnival. The principal events were 200 yds handicap (won by Bragg, H Co.) 75 yds Cigar Race (Wilmott H Co) Diving (McQueen E Co) & Swimming Dive (King, Naval Gd)\n\n42\n","66":" : At 4 o’clock this afternoon the Matunga cast off from the Depot wharf bound for Alexis Hafen. At the Flagstaff we hoisted D.J.X. (Au Revoir) and I had the gig manned to give them a parting cheer. As she moved off all the garrison cheered lustily & the German residents turned out to bid God speed to some of their countrymen who were leaving for Rabaul. Several of the garrison also went thither having been found medically unfit for service. As she rounded Hospital Point my signalman semaphored \"Good bye\". This was acknged by dipping the ensign. After she had gone things again settled down to normal. The crew of the \"Lili\" are very much envied as they will have the pleasure of seeing her again at Alexis.\n","67":" 10.30 am : No! they won’t! for at 9 o’clock this morning the \"Matunga’s\" motor boat was sighted coming from the north. She had come with a message for the Major stating that Mr. Lucas, the representative for Burns Philp & Co, had decided to proceed to Stephanorst after leaving Alexis as there was a large quantity of copra at that place awaiting transhipment. Consequently the motor boat will pick up the mails & meet the \"Matunga\" off FdkWms Hafen as she steams southwards. Hard luck for us. \n\n6.30 pm (on board \"Lili\" off Breakfast Isd) : New Guinea is a place where everything is topsy turvy. Even the lizards walk on the ceiling, which of course has nothing to do with the present position of the \"Lili\".\n\nWe have heard that a steamboat of some size is concealed in a creek about 40 miles N.W. of Madang. The \"Lili\" is too small of carry more than 15 men & as we require a larger vessel for visiting distant points I have obtained permission to search for it & cut it out. All other arrangements (for us) have accordingly been cancelled & here we are with 5 days provisions & 13 rifles, also 1 AMC private. The \"Matunga\" left Alexis about ½ an hour ago & we should shortly see her steaming lights to the S.E. It is my intention to weigh anchor at midnight and make our way northward.\n","68":" : At 12 o’clock last night half the hands were called\n","69":"\n\nand we left the lee of Breakfast Island about 12.15. No sooner had we started than we got the full force of the S.E. wind & sea on our beam. The old hooker started to roll (& she can roll) till we got under the lee of Sek. We then ran smoothly till we left Alexis heads. These we passed through at 1 o’clock & then the fun started. She hopped all over the place, weather gunwhale then lee gunwhale under. She dipped her bowsprit into the seas and threw them along the decks. One AB whose hammock was slung between the weather mainstay & runner swung outboard & as she rolled back again caught another man & sent him sprawling. All hands turned out. We ran on for a few minutes but conditions got so bad that at last I decided to put back & wait for daylight. We therefore returned to Alexis & made fast to the Mission wharf.\n\nWe eventually cleared the heads again at 8 o’clock. The sea had slightly moderated, and after setting our course (Nth) we hoisted main sail & jib. This eased her & sent her along in fine style.\n\nAt 10.30 Dampier Isld (the scene of the recent cannibal rising) appeared like a faint cloud to the Nth and we shortly after rounded Cape Croisilles. \n\nPr Adalbert Hfn was entered at about 12 o’clock. We ran right through & put to sea again keeping a careful look-out as we expected to sight the creek within the next four or five miles. We did. But from our position there appeared to be a bar where the sea broke heavily. Putting about we made again for Adalbert intending to send a party overland from that place. The wind, sea & current were all against us & it took us fully three hours to do what had previously taken one. It was too late when we came to anchor to do anything that afternoon so all hands had a bathe & settled down for a quiet spell, first erecting bogus wireless gear.\n","70":" (onboard \"Lili\" at Eitel Fdk Hfn midday) At 8 o’clock yesterday morning I landed with 9 men to scour the coast line near Adalbert in search of the steam boat. As our boat approached the shore we noticed a flag flying from the grounds of a small cottage. It was the dear old Jack. It is hard to explain one’s feelings on such an occasion. Here\n\n139\n\nwe were in an enemy’s country miles from our base and there flew the glorious old banner of liberty. A European dressed in white awaited our landing. This proved to be Mr Stillen of the Sarang Plantations Ltd, Sydney. He is a German-Australian & is the owner of the \"Genoa\" mentioned in an earlier page of this diary. Without actually telling him the object of our visit we asked the road to the creek. He readily guided us & also took us along to his brother’s house where I administered the oath of neutrality. The natives of the plantation also supplied us with a few pawpaws which proved very welcome.\n\nWe then started on our search. By road the creek was fully 9 miles and the track meandered in & out the bush, along the beach, over sandy hillocks & if, I may be excused the expression, the march was the rottenest bit of work I have ever had the misfortune to do. Worst of all, there was no steamboat; in fact no boat of any size could possibly get from the creek to the sea. We had lunch & turned back. It seemed as though the track would never end. The walking was particularly heavy along the beach, the sand of which was jet black. It was impossible to get through the bush except where the road led. The \"road\" I may tell you was about 3 feet wide & when passing through the bush it was necessary to move in single file. This was the New Guinea one reads about. The trees were so thick that it was impossible to see more than a few feet on either side and the daylight was as faint as a tolerably clear moonlight night. All things have an end (so they say) & at last we reached Adalbert Hafen again. We signalled to the \"Lili\" to send the boat ashore and returned on board. \n\nAt 6.30 this morning we left Adalbert & steered for Eitel Freidrich Hafen which we reached about 11.15.\n\nWhile conversing with Mr. Stillen on Thursday I learned that a steamer which might possibly be the one we are in search of had taken refuge\n\n141\n\nin the Sepik (Kaiserin Augusta) River. This place is about 80 miles from here & the river itself is navigable for about 300 miles. It would probably take 2 or 3 weeks to properly search its waters even near the coast. We have only one week’s provisions & are expected back on Saty & I have therefore decided to return to Madang. It is my intention to call at Sarang en route to pick up Mr. Stillen who wishes us to give him a passage to FdkWmshfn.\n\nFdkWmshfn","71":" : We left Eitel Hfn at one o’clock on Friday hoping to reach Sarang before sundown. Wind & sea were against us & darkness fell when we were still 5 miles off. As the entrance to Sarang is strewn with shoals I decided to stand off the land & make for Alexis Hafen. The moon rose at about 9.30 & we made for the coast again; we rounded Cape Croisilles at two am. I then set the course & turned in for a few hours sleep. About 3 oclock I was thrown out of my bunk by the lurching of the vessel. There was by this time a tremendous sea running & the \"Lili\" rolled heavily. The jib was set to ease her & she ran better.\n\nAt 4.30 we were off Jino Spit when suddenly the engine stopped. The engineer examined it & announced that he could do nothing. We hoisted the mainsail & mizzen & stood out to sea. After beating about for a few hours we eventually entered Alexis Heads at midday & in passing through noticed a large ketch making in our direction. She appeared to be crowded & not knowing what to expect I ordered all rifles on deck. As we drew near she hoisted the Jack & on coming closer we found it to be the \"Davapia\", a large auxiliary ketch, which had entered Alexis Hfn on Thursday & had been promptly captured by a party of Native Police under Sergt Carlisle. The Major was on board. He had come out to search for us.\n\nBoth vessels then went on to the Mission Wharf & made fast. After we had lunched the \"Lili\", whose engines were again in working order, towed the \"Davapia\" to an offing & steered for Madang. There was quite a crowd on the wharf at the Depot to welcome us. \"Where’s the loot?\" they cried. Then, catching sight of the wireless, \"Hey! What’s the latest news?\"\n\nThe \"Davapia\" had not turned up by nightfall; indeed she did not put in an appearance till 1 p.m. today. The Major after drifting about for a few hours (the wind dropped at sundown) anchored under the lee of Sek & came on this morning. (see also below *)\n","72":" : Since writing the above I have had another steam-boat hunt. At about 5 o’clock yesterday afternoon a vessel (apparently under steam) was sighted making towards Alexis Hafen. I called the \"Ramu\" away & went in pursuit. We did not overhaul her but after examining her through the glasses at about sun-down she appeared to be a large war canoe, the matting sail looking at a distance remarkably like smoke. As we were under way, however, I decided to go on to Alexis & stay the night, return this morning & examine the bays en route. This we did & at Freidrich Karl Hafen found a large heap of coal, a steam boat’s propeller & a coil of towing line. These were noted for future occasions & we returned to Madang at midday.\n","73":" : Routine day.\n\n* While we were searching the northern coast Capt Morrison with 8 or 9 infantrymen had been investigating matters to the south. They left in the \"Matunga\" on Tuesday night & were landed at Stephansont on Wednesday. They here found some useful machinery which was commandeered & returned by road to Madang on Friday. On Thursday a severe shock of earthquake occurred at about 10 am. The effects were felt at Stephansont & at Madang some damage was done at the NG Coy’s store, whilst our hospital was (see over)\n\nFrom page 5\n\nseverely shaken. At the time we were under way in the \"Lili\" & knew nothing of the occurrence till our return. Shocks are frequent in this locality, although I have only had the pleasure(?) of their acquaintance on two occasions on both of which they were slight & occurred whilst I was in bed.\n","74":" : The \"Lili\" is to leave at 5 am tomorrow morning for Ervina & Stephansont (about 18 miles south) with a mixed cargo for the New Guinea Coy at the latter place. After discharging this we are to take 1000 cocoanuts on board for Madang. I am beginning to feel like an Island supercargo. \n","75":" 8pm : The lizards have again been walking on the ceiling and the \"Lili\" still lies at her moorings. During last night the wind blew almost with hurricane force & the \"Davapia\" which was leaving for a southern port with several native police had to turn back. I was awakened at about 3 oclock this morning by my Q.M. who reported that the \"Penguin\" had broken from her moorings & was drifting on to the rocks at Beliao. I slipped on a pair of shoes and went aboard the \"Lili\" where the engineer quickly had the engine going & we set off to the rescue. The \"Penguin\" was morseing madly, \"Send help at once\". I was glad to learn that the Q.M. had sent off two boats to their assistance. As we drew near I could see that she was within a few fathoms of the rocks with the two boat’s crews pulling with all their might. We passed a line aboard & started to tow. She gradually moved out, both & the \"Lili\" dipping their bows into the seas. The \"Lili\", however, evidently objected to early morning work, for the engine broke down & instead of one ship we had two to save. We dropped anchor which held, thank God. The Schooner followed suit & hers also got a grip of the coral. Meantime the boats stood off awaiting instructions. As the \"Penguin\" seemed to ride fairly well I decided to leave her till daylight, giving my attention meanwhile to my own craft. After several unsuccessful\n\nattempts the engine again started working & with the men from the Schooner aboard we weighed anchor & got out of danger; then like a well-whipped cur the \"Lili\" returned to her moorings.\n\nThe schooner was eventually towed to a place of safety and the \"Lili\" instead of proceeding south went to Alexis Hafen for repairs. I have just returned from there & have arranged to leave at daylight tomorrow for Stephansont.\n","76":" on board \"Lili\", Errima Hafen 8 am : I am becoming somewhat tired of these worn-out motor ketches which \"sail not neither do they spin\" (along). We put in a wretched time yesterday. We left Wmshafen at 6 am & she ran beautifully till we reached Stephansont. We discharged our cargo & took the cocoanuts aboard. The anchorage is simply an open roadsted which is safe enough in the morning but about midday a nasty sea comes up which makes it exceedingly dangerous for small vessels.\n\nI was anxious to be away and we started off at about 12.30 pm. We had not gone above 100 yards when the engine again broke down. We immediately made sail & endeavoured to claw off the land. The seas came rolling in from the north & we made but poor progress. \n\n\"With wind & tide fair in your tail\n\nRight on ye send your seaway;\n\nBut in the teeth o’baith to sail\n\nYe make an unco’ leeway.\"\n\nThe poet must have had the \"Lili\" in mind when he wrote those lines. At any rate they fit her very well. We vainly endeavoured to make Konstantin Hafen to do which she need only lay 6 pts off; but, No! she would lay about 8 pts & even then make leeway. In despair I decided to return to Stephansont & take my chance. We did so & dropped anchor; the sea by this time had got up considerably and\n\nshe strained very badly. At times, looking at her from the pier whither I had gone in search of an additional anchor, she would drop back on her counters while her bows would shoot up showing half the copper. Then as the strain came on the cable she would shove her nose down & send the spray over the deck house. This went on for nearly an hour but at last the engine room reported progress & stated that they might get a \"kick\" out of her. In some trepidation we weighed anchor & she \"kicked\". I think we felt somewhat like the crew of the gallant old \"Calliope\" as we made for the north. To cut the story short she kept \"kicking\" & we were fortunate enough to make Errima Hafen at about 6 pm & have lain here under the shelter of a few rocks & with about a fathom of clear water under us all night. We are to leave at 10 o’clock for Madang.\n\nAlexis Hafen Sunday 4 pm : We did get back safely though our sweet \"Lili\" objected once or twice. On our return we found another vessel in port, the motor ketch \"Witu\", trading under a permit between Rabaul, Peter Hafen & Madang. She was boarded by my QM & reported to the Major. She is to leave again on Monday for Stephansont with one of my men to watch things for us.\n\nThe Naval Guard is to be transferred to Alexis Hafen & I have taken a run up here today to see things fixed up for our accomodation. My own quarters are part of a timber shed partitioned off with a few rough boards, with a box for a chair & a few cases for a table but with an outlook that could not be surpassed. I can look straight out to sea between the heads.\n\nThe Mission Fathers have treated us well & the Mission Dr. (a German) is attending one of my QM’s for fever. He is Kindness personified; I told him\n","77":" or rather I thanked him for his kindness, he did not \"savvy\"; I repeated it; still he didn’t savvy. The Brother who accompanied him said, \"Kindness, kindness, vat’s kindness?\" then to my surprise & secret delight he whipped an English – German Dictionary from his pocket & turned it up. \"Yah\", he said, \"Yah, kindness, yah\". I could have roared, but of course I didn’t.\n\nWe are likely to meet a few crocodiles at our new quarters, as they swarm in this locality; still it will cause a diversion.\n","78":" FdkWmshafen 7.30 am : We have just heard by wireless of the death of Lord Roberts in France. The news has cast quite a gloom over the garrison & flags have been half-masted.\n\nWhile at Alexis Hfn I had a (to me) novel experience. The natives on the island of Sek, which is situated at the entrance, have been rather unruly of late & have been making \"alaruins & excursions\" into the hills on the mainland. Their object was twofold; they much desired some new \"Maries\" who had taken their fancy & they were in need of food. Too lazy (or wily) to grow their own food they are in the habit of making periodical raids on other tribes. It was my unpleasant duty to remonstrate with them & to point out that as the British King was now \"big fella chief\" they must obey his orders. My beard-less face did not impress them very much; they said I was only a \"child\"; but when I lit a match & threatened to burn their \"devil-house\" down about their ears they were more disposed to listen.\n\nThis devil-house is an interesting place. It is the abode of His Satanic Majesty & may not be entered by the Maries or piccaninnies. Along the front (outside) are hung various bones & gaudy feathers. Inside it is very little different to the\n\ninterior of the ordinary native houses. It contains a large tom tom. The one in this house was about 6 ft long & is simply a log hollowed out & struck by a long pole. The natives have a system of signalling with tom toms & it is no uncommon thing to hear the beating of them continued for miles along the coast.\n\nThe whole of the village was lined up for our inspection & to hear the words of the Kus Kus. (The Major is big fella chief; I am Kus Kus; God is called big fella chief on top). The chief (the oldest man in this district) promised to be more circumspect in future & we left with mutual compliments & good wishes on either side. His last words were a request for some \"Taback\" (tobacco). I promised to send him some. \n\nI expect to get the rest of my command away to Alexis Hafen within the next few days. \n\nAlexis Hfn","79":" : The Naval Guard are now established here & since leaving Madang we have been putting in making ourselves comfortable & arranging matters in the \"way they have in the Navy\".\n\nAs I write I see a canoe coming from Sek with pawpaws, cocoanuts, mangoes, etc. We have arranged to barter with them for these fruits giving them our surplus bully beef (called by them & also by the Germans \"bulla-ma-cow.\") These natives seem to have quietened down since our visit and we hope that we will have no further occasion to make hostile demonstrations.\n\n7 pm : Have just returned from Madang where I have been to make my report & also to lodge 1 or 2 men affected with malaria for hospital treatment. Malaria is beginning to make itself known in our ranks, the average being one victim per day. Fortunately the attacks have so far lasted only\n\nabout a week at a time and the men have been able to resume duties little the worse for their experience.\n\nIt was the Major’s intention to leave for Finsch Hafen tonight at midnight in the \"Davapia\", but when I told him of the sea that was running (we had a lovely time in the \"Lili\") he decided to wait till daylight. On our run back our dinghy broke adrift & things were pretty rapid for a while trying to pick it up again. It was the biggest sea I had been in in the \"Lili\", & she behaved very well, albeit she jumped about \"considerable\". (re Commd. Beresford)\n","80":" 10 am : We had Divisions at 9.30 this morning a-la-Navy. Just prior to this I had a visit from Mr. Penn, who was accompanied by his wife & two children. He had come to ask our help in quietening the natives on the island of Malamal, who are getting out of hand. I promised to go down in the \"Lili\" this afternoon. Mr. Penn, who is Dutch, has a plantation about two miles from here.\n\n7 pm : The best afternoon I have put in since leaving Sydney, a combination of business & pleasure. We went to Mr Penn’s plantation in the \"Lili\" where he and Dr Kloster came aboard & we then proceeded to Malamal. The natives were in full warpaint, but the Tul-tul (chief) was away (\"gone along bush\"). We ordered them to being him back; this they proceeded to do by beating on the tom-tom. While awaiting his arrival we visited his house & also entered the devil house where the natives carried out a few of their sorceries for our benefit. Growing impatient of the Tul tul’s tardiness we harangued such of the natives as were present & threatened to cook (set fire to) their devil’s house unless they quietened down, & ordered the Tul tul to visit me at Alexis Hafen. We then returned to the plantation; on our way we passed the Tul tul making all haste to return \n\nto his island. I then visited Mr Penn’s residence & had tea with him. Mr Penn speaks English fluently & has read a great number of English works. Looking through the bookcase imagine my feelings on seeing Shakespeare, Tennyson, Byron, Milton, Thackeray; it was like a whiff of dolce domum. After some pleasant conversation, Mr Penn asked whether I would like to see a native war-dance. I acquiesced, & after a little preparation his boys, decorated with branches & in full war paint, went through a number of gyrations & convolutions to the accompaniment of a kind of chant & the beating of drums & tom toms. We eventually left at about 5 pm loaded with paw paws. The memory of this afternoon will live with me for months. The kindness & good fellowship of my host & hostess & the bright faces of their two boys, Hubert & Charles (aged 5 & 8 years respectively) will be something to remember.\n\nThe steamer mentioned by Mr. Stiller of Sarang (vide diary","81":" inst) will in all probability prove to be the \"Gabriel\", belonging to the Mission Fathers. At any rate some days ago the Major gave instructions to the Father Superior that the \"Gabriel\" should be brought to Alexis Hafen for the use of the troops. As these instructions have been disregarded, I last night issued an ultimatum to him, the latter portion of which reads thus,\n\n\"Failing its appearance in Alexis Hafen by 5 o’clock on Wednesday morning next I will be compelled to shut down your works. \n\nPlease inform your workmen that anyone attempting to enter the workshops after 6 pm on Tuesday is liable to be shot.\"\n\n(signed) C Hansby Read\n\nLieut. O C Naval Guard.\n","82":" far no reply has been received; as a safe-\n\nguard, however, I have posted sentries over our quarters as I hardly think the Mission people will quietly knuckle down.\n","83":" : Things went on as usual up till about 8 pm last night. I had heard no word from the Father Prefect but suspected he was quietly taking some counter-action. Such proved to be the case. He brought me a letter from Capt -------- ordering me to leave matters in abeyance until the return of the Major, who was away in the \"Davapia\" for a few days. The Father was rather taken aback when I told him I could not alter my decision & that I could not take orders from anyone but the Major. He went away grieved at heart. Meantime the Major has returned & has decided to leave matters in my hands till tomorrow when I am to visit him at Madang. Consequently all preparations are made for the stoppage of the works.\n\nToday I went with two of my P.O.’s to Danip, a plantation & farm owned by the Mission about 4 miles from Alexis. It has strategic advantages which it would perhaps be unwise to mention here. The farm & plantation are worked with the usual thoroughness of the German & represent a valuable asset. We took a few rifles & cartridges which we found in the possession of two priests & made a cursory examination of the Malay houses. It was rather a pity we did not make a more thorough search, as, acting on information received tonight I have just (midnight) returned from another tiring trudge to the same place. Nothing was discovered, however, though our informant is sure \"it\" is hidden in the locality.\n","84":" : The usual clatter of the machinery & the buzz of the sawmill are absent this morning. The native workers are away in the plantations doing various odd jobs & no attempt has been made by\n\nthe Mission Fathers to enter the line of Guards. I am leaving at 9.15 for Madang.\n","85":" pm : I saw the Major this morning & he approved of my action. He has for various reasons, however, decided to extend the time for the production of the \"Gabriel\" another week. We are therefore withdrawing our embargo & the works will start again tomorrow. I have just had an interview with the Father Prefect.\n","86":" : Normal conditions again prevail at Alexis Hafen & the works are in full swing. Some of my men are down with malaria & Doctor Kloster, assisted by one of the Brothers, has been continuously in attendance on the victims. I cannot speak too highly of the way this excellent medico has given time & trouble to the alleviation of the sufferings of his country’s enemies.\n\nFrom my quarters I occasionally catch a glimpse of the summit of Maulun Beng looming dark & mysterious from among heavy clouds. This peak is over 20 miles away and is the highest point on Dampier Island.\n\nSince leaving the Madang garrison I have been thrown more into the company of my P.O.’s & leading hands. They are old sailors & some of their yarns are redolent of the salt. Thus, \"one day, Sir\", said one, \"I was settin’ up some riggin’ taut & I called out to one chap. ‘go & get us a handy billy’. Away he goes & I waited & waited & kept on waitin’ till at last he turns up. ‘Here y’are mate’, he ses, handin’ me a large billy-can. ‘It’s pretty big but it’s the handiest I c’d find’.\" Those who know what is meant by a \"handy billy\" will no doubt appreciate the above.\n","87":" (onboard Rheno Westfalia at sea) : Yesterday morning I left Alexis Hafen with 11 men to search for a steam boat belonging to the Rheinisch Mission. I am now on board the steam-boat & the \"Lili\" is following in our wake; we are returning to Alexis.\n\nFrom information received we decided to visit Kurun, on the south coast of Dampier Isd. We cleared Alexis Heads at 6.30 & set our course (Nth). Cape Croissilles was passed at 8.40 and we then steered for Dampier. The morning was very hazy & nothing could be seen ahead for about ½ an hour. Then gradually out of the mist grew the shape of the huge mountain which for the past week or two has seemed to us the abode of mystery & bloody deeds. The haze began to lift & the trees showed up, then the roofs of a few houses came into view. At last we saw apparently nestling among the trees the object of our search, a steam launch about 45 feet long, with awnings spread. Almost at the same time we noticed a large sailing boat making in our direction. Rifles were brought on deck & the ensign was hoisted. As we drew nearer we could see that the boat was manned by natives while a European sat in the stern sheets. This proved to be Herr Schmidt whose plantation was raided some few weeks ago, on which occasion he himself was wounded with an arrow & one of his boys was murderously hacked with a tomahawk. As recorded in an earlier page of this diary the boy died from his injuries. Hr Schmidt came aboard & piloted us through the reef; we told him the object of our visit & he took us to the Missionary’s house where we arranged for the temporary use\n\nof the pinnace (all vessels of any size driven by machinery are known as pinnaces in these parts). I afterwards had dinner with the Missionary & his wife; the latter speaks English remarkably well though she had some difficulty in following my rapid articulation, which seems natural with all Australians.\n\nI have at various times dilated on the beauties of the places visited by us. This, however, \"beats the hand\". The cottage is built on the edge of an extinct crater & is about 3 or 4 hundred feet above the shore. The bottom of the crater is below sea level & in the centre is a deep pool. One can stand on the verandah & look straight down into what was at one time a bed of molten rock, but which is now quiet & peaceful, covered in some parts with luxuriant foliage. To the north nothing can be seen but the tree-clad slopes of the mighty mountain. To the south & east lie the sparkling waves of the Pacific. The only drawback to the glorious picture is that the sand of the beach is, owing to its volcanic origin, black, though the foam of the breakers is as white as snow. \n\nAfter dinner I went with Hr Schmidt & the Missionary to the native villages where we interviewed the Luluei (old chief) & the Tul tul, assuring them that the English were not fighting the missionaries & that the pinnace was being taken away for a short time only. Should there be any disturbance during our absence we would come back & \"cook\" the whole village. They savvied & promised to let the other tribes know our sayings.\n\nI afterwards returned to the \"Lili\" which was moored alongside the pinnace (I will henceforth call her the \"Rheno\".)\n\nThis morning I transferred \"my flag\" to the \"Rheno\", or to be more exact I hoisted the Blue Ensign on her (the \"Lili\" flies the white) as she is a hired vessel, and we left at 7.20 for Alexis. She makes a fair pace & we have to continually slow down to allow the old hooker to catch up. Consequently it will be late before we enter the heads.\n\n Madang","88":" : We entered Alexis Heads at about 20 minutes past one & proceeded straight to the Depot. We left again about an hour afterwards for Madang. We took the outside passage and shortly before entering FdkWmshafen sighted the \"Davapia\" making for the same place. Running alongside we found the Major on board returning to Madang after a short trip outside. We then led the way into the Harbour; great excitement prevailing at the lighthouse as we passed. Greater excitement still was evinced at the barracks when we came close to the wharf; I could not resist the temptation to \"wake them up\" by a blast on the steam whistle. Various were the conjectures; some guessed that the Brigadier had come to make an inspection, others that here at last was another batch of letters from home. \n\nThe Major came alongside shortly afterwards & inspected our \"capture\" which appeared to please him mightily.\n","89":" (drinking tea at Alexis): \"Why drinking tea?\" you ask. Well all I can say is that if you had spent 2 hours in a rotten little packet like the \"Rheno\" in a heavy sea, you’d do the same, or worse. When we entered FdkWmshafen in triumph on Saturday we little thought that our opinion of our new acquisition would undergo such a rapid change - and thereby hangs a tale.\n\nHaving now four reliable (?) boats at our disposal, the \"Lili\", God bless her, the \"Davapia\", the \"Witu\", & the \"Rheno\", the Major has decided to send an expedition to the northern coast and investigate\n\nmatters at Eitape, an important centre 260 miles away. I am to be in charge of the expedition at sea, while he will direct matters on arrival at our destination.\n\nThe \"Lili\" & \"Davapia\" left yesterday morning at 7.30 for Potsdam Hafen where they are to await our arrival. The \"Lili\" has a load of coal for the \"Rheno\". We (the \"Rheno\" & \"Witu\") left Madang at 6.30 this morning. As we passed through the heads we could see we were in for a lively time. The \"Rheno\" stood on her tail & brought her bows down on the seas with a crash. But this was nothing to what followed when we altered course & got them on the beam. She weltered along in agony while the water raced along the deck. Nearly all hands were sick, one poor chap lying helpless in the lee scuppers. We signalled to the \"Witu\", which was also cutting a dido, to follow us into port. So now we are drinking tea at Alexis.\n","90":" onboard \"Gabriel\" at sea : Still another \"capture\". Since drinking tea on Monday things have been happening. We left Alexis at 5 am on Tuesday & steered for Croissilles. The sea had gone down & spirits had gone up, so everything went swimmingly. On the run up the coast we saw a most beautiful sight. Day had just broken & the sun was making ready for his daily journey when a short distance to the eastward appeared a ball of silver floating through the air in a northerly direction. It remained in sight for nearly a minute then gradually faded from view. What it was I do not know.\n\nWe had an excellent day’s run & reached Potsdam Hafen at about 5.15 pm. The first thing we sighted around the point was the \"Gabriel\" lying at anchor. The \"Lili\" & \"Davapia\" were discovered closer in to the shore. The Major immediately boarded the \"Gabriel\" and we steamed to an anchorage. My P.O. from the \"Lili\" came alongside & reported that the \"Gabriel\" had put in an appearance yesterday\n\nmorning. He boarded her on my behalf & established a naval guard, instructing the Captain not to leave before my arrival. As I could not leave the \"Rheno\" till she was anchored, however, the Major preceded me. I followed as soon as we had got our cable.\n\nThe \"Gabriel\" is comfortably arranged but resembles a Noah’s Ark, being exceedingly top-heavy. There were two passengers aboard bound for Hatzfeldt Hafen & one priest on his way to Alexis. These were transferred to the \"Witu\" during the following forenoon & left for Hatzfeldt, the soldiers on the \"Witu\" transhipping to the \"Gabriel\". During the afternoon the \"Lili\", \"Rheno\", & \"Davapia\" came alongside & discharged their cargo & passengers into the \"Gabriel\" which will now proceed to \"Eitape\", the remainder of the fleet returning to Alexis & Madang. The \"Lili\" is to again load up with coal & meet us at Potsdam in a few days. We are now (6 pm) passing through Dallman Hafen & expect to reach Eitape before daylight.\n\nWhile at anchor in Potsdam last night we found a fly in the soup. It happened thus : The number of soldiers aboard the Gabriel is about 60. They were all asleep on the upper deck, the lower deck being set apart for the native crew. I have mentioned that she is top-heavy, & with the extra weight on the upper deck she became very tender. During the night she got a list to port & gradually canted more & more until at last there was a crash in the galley, crockery smashing up galore. The skipper was practically sleeping on his head; I was asleep on the bridge & brought up against binnacle; Capt Morrison found himself halfway through the taffrail, & some of the men found their hammocks swinging over the port bulwarks. The port boat was lowered & the cargo was shifted to starboard & she righted herself. The skipper has announced that the upper deck must be kept clear & that the men must keep below day & night. Verily a fly hath been found in the soup!\n\nWhen O! when, shall we find a craft worth the name?\n","91":" onboard \"Gabriel\" at Eitape 10.30 am : We arrived here about 5 o’clock this morning and anchored off the township. I was asleep at the time having resigned the bridge to the skipper at about 3.15 am, at which time we were passing outside Berlin Riede. I slept like a top having been on duty almost continuously since morning yesterday.\n\nThe Union Jack is now flying on the flagstaff ashore & stores are being landed for the garrison, which will consist of Capt Morrison, Lt Cambers & 50 infantrymen.\n\n6.30 pm : I have just returned from the shore where I have been to criticise the new outpost of the Empire. There is no wharf & all stores & passengers have to be landed in surf boats. It was quite exciting to sit in the stern sheets while the native crew skilfully steered the boats through the foam. They are experts at the game & watch their chance continually for a partial calm. This usually comes after a succession of big breakers. The helmsman then shouts some unintelligible order & the crew respond with a will, gabbering & shouting fiercely the while. Then right astern curls an immense coamen. Up goes the stern & down goes the bow & we shoot along at incredible speed. Then as the wave expends itself the boat resumes the horizontal. Now the helmsman shouts again & puts his steering oar hand over; again the crew give way heartily & the boat glides into smooth water inside a sandy spit.\n\nAfter a stiff climb from the beach I found myself at the new quarters. I have described the scene at Dampier Island; in some respects the description fits this place also. It is however a good hundred feet higher that the house at Dampier & the view is uninterrupted in every direction. Should any of the garrison get tired of their monotonous existence they can end it by simply tripping over the stone border of the garden path. There\n\nis a sheer descent of 300 feet & the gathering of their scattered remains would keep the men busy for days. I returned to the ship with the Major at 6pm & we are ready to start again for Madang. We will weigh anchor at 9 o’clock.\n\nKairiru Island","92":" 9 am : We arrived here at 6.30 this morning & we are now watering the ship. This island is 8 miles long & 4 wide the central portion being about 3250 ft above sea level. I went up the slopes for about a mile and had a refreshing bath under a rushing cascade. The water is cool & fresh coming as it does direct from the mountain. The foliage is very thick & the sunlight is absolutely excluded. Going along the path one is reminded of Gustave Dore’s pictures illustrative of the \"Idylls of the King\".\n\nI must not forget to mention Awu, the Captain’s steward. He is as black as the ace of spades and smiles about as often. I am certain he was at one time a \"Kai-kai man\" (cannibal) by the way he looks at me; and I would not be surprised if some day he wants to \"split my gizzard\". Natheless I have taken a great liking to Awu and occasionally give him a cigarette (perhaps as a matter of policy) for which he emits a gruff \"thunkoo!\"\n\nI am much entertained by the way he hands (no, throws) you a spoon or fork; plates he is more careful with, though when removing one after a course he makes a mighty snatch at it. If the sugar basin is without a spoon he throws one from the end of the table & it invariably lands in the right place, the bowl in the sugar &, like Macbeth’s phantom dagger, \"the handle toward my hand\".\n\nAwu, I love thee, thou black d---l. The boatswain is also a diversion. He is a Malay, short, old, & weather-beaten, and when excited,\n\nwhich is never more than 60 times an hour, he rattles off \"pidgin English\" at a marvellous rate, finishing up with a wild \"orright\" as his orders are obeyed by the native crew.\n\nThe Captain of the \"Gabriel\" is an exceedingly nice man & a general companion. He is a German, one of the Katholic Brothers, as is also the engineer.\n\nPotsdam Hafen","93":" 8 am : After leaving Kairiru Island yesterday we went to Dallman Hafen where the Major administered the oath to the Father Prefect & Father _____. The latter was at one time skipper of the Gabriel & passed his navigation test at Sydney at which time he was attached to the Drummoyne Parish. He speaks English fluently & is courtly & accomplished. It was quite refreshing to hear him speak of George St, Elizabeth St, Circular Quay & other parts of dear old Sydney.\n\nWe left Dallman at 6.30 last night & arrived here this morning at daylight.\n\nOn board \"Gabriel\" at sea 4.30 pm : \"Struth!\" as the clown in the circus used to say.\n\nAt 9 o’clock this morning the Major called my attention to an object showing through the trees around the point at Potsdam. It was moving swiftly over the water; it is – no! it can’t be. Yes! by Jingo, it’s one of our destroyers – and, ye Gods! there’s another.\n\nIt was true; the \"Warrego\" & the \"Parramatta\" rounded the point and dropped anchor within a few cables lengths of us. The Major & I hopped into a boat ready to go aboard. We were met half way by Commander Cumberledge whose boat was manned in less than no time. We went to the shore together & things began to move some. A German who had broken the oath of neutrality was ordered to leave his home & proceed to Madang. But the most unkindest\n\ncut of all was that his young & pretty wife was to accompany him & I was to take charge of them on the \"Gabriel\", the Major transferring to the \"Warrego\". Like Pharoah I hardened my heart & ignored the tears & protestations of the said young & pretty one, though the sight of their dear little youngster pulled hard.\n\nThe Destroyers left immediately for _____ whither some important business calls them. I shall chronicle it in due time; at present \"mum’s the word\". So I’m the captain of the \"Pinafore\" (no, I mean the \"Gabriel\") & a right good captain too. Commdr. Cumberledge lent me one LS & one AB as I have only two men aboard here, one of whom is a convalescent. Besides these we have the two permanent ship’s officers, the crew, the pretty one & her husband, 6 sisters of the church, one priest, 2 other German prisoners & Lord knows how many natives. Quite a goodly company. And the good ship \"Gabriel\" ploughs her way through the angry main at 8 knots. God grant there will be no fly in the soup tonight.\n","94":" 4pm FdkWmshafen : I remarked the other day \"Struth\"! Pardon me if I reiterate. \n\nYou will remember that I became captain of the \"Gabriel\" a few days ago. That, mon ami, is a thing of the past; I am now Captain of HM Troopship \"Sian\", a vessel recently captured from the Germans. We are carrying troops to ____ & will form one of a fleet consisting of \n\n\"Warrego\" \"Parramatta\" \"Yarra\" \"Una\" (late Komet) \"Fantome\" – HMAS\n\n\"Eastern\" \"Sian\" \"Nusa\" \"Gabriel\" – Troopships\n\nIt appears that the capture of the \"Gabriel\" was a more important event than we imagined. She has for some time been running cargoes for the use of the enemy & has now become a legal prize. Naturally we feel a bit \"cocky\". Her own officers have been relieved from duty. Lieut Hill (RNR) has been placed in command and I have been promoted to the command of the \"Sian\". The latter is a steel vessel of 400 tons & is fitted with electric light, electric fans, & cockroaches.\n\nThe \"Eastern\" arrived in port shortly before us. Freidrich Wilhelmshafen consequently looks busy. There are at present in harbour the \"Warrego\", \"Eastern\", \"Nusa\", \"Sian\" & \"Gabriel\". \n","95":" onboard \"Sian\" : Last night the \"Warrego\" & \"Nusa\" quietly slipped to sea and things in port have become rather quiet again. I overhauled the charts today, as, although I do not know how long my present appointment will last, I wish to be prepared for a sudden departure.\n","96":" : Another quiet day. No news from the Destroyers.\n","97":" : \"Change and dismay in all around I see!\" The expedition’s off! It has been found to be a fizzle. In fact, entr’nous, the objective of the fleet was the same as that of the \"Lili\" on","98":" The destroyers have again returned to port, thought the \"Nusa\" is still absent. But the \"last scene of all that ends this strange eventful history\" is that I am no longer in command of the \"Sian\", but am again Captain of the \"Pinafore\". (My mistake, the \"Gabriel\") The \"Sian\" is being used by the Royal Navy as a patrol ship.\n\nHow are the mighty fallen!\n\nClosing Diary to catch mail.\n","99":" Fdk Winshafen : The fleet is still here with the exception of my late and brief command the \"Sian\", which now flies the White Ensign and has gone north.\n\nThe past few days have been very pleasant; I have again met most of the officers associated with me in the \"Berrima\", while the ship’s company of the \"Una\" (Komet) is comprised mainly of men who served under me on the way up. After seeing no blue-jackets for so long (except my own Naval Guard) it does one good to note the smartness & efficiency which always distinguishes the \"tars who o’er the ocean sail\".\n\nApropos of the concert evinced in the above lines I would like to enter an emphatic protest to the way in which the doings of the \"Berrima\" expedition have been reported in the Australian press. After reading the various accounts, & after looking through the pictorial edition of recent happenings in the Pacific (issued by Mr Burnell) I am beginning to wonder whether the Naval Reserve were in it at all; whether in fact we even left Sydney. I do not refer to myself; my diary shows what I have been doing, and I know one can never come into the limelight for simply doing one’s duty; but it seems rather hard on the men who sacrificed their lives and on those who placed themselves on the altar freely (even though they escaped death) that their work is almost ignored.\n\nWe do not doubt that had the military been in the same position they would\n\nhave done as well; but the fact remains that to the Naval Reserve and particularly to Lieuts Bowen, Gillam and Bond and their gallant 3 4 & 6 companies belongs the honor of the capture of the Kabakaul Wireless Station. There has probably never been such a one-sided lot of piffle dished up for the readers of the Australian dailies as has appeared during the past few months. All praise is due to the Military organisation, but for God’s sake let us have a fair show, lest the tax-paying public of the Commonwealth ask the reason of the continuance of Naval Defence.\n","100":" onboard SS \"Gabriel\" at sea ; Pardonnez moi! But I am so \"fed up\" with these distorted accounts of \"How Australia took New Guinea\" that I could not help it.\n\nOn Monday night the destroyers and the \"Nusa\" left port and yesterday morning the \"Una\" also went her way. At two o’clock in the afternoon the \"Eastern\" bearing our mails, our invalided comrades (of whom there were a fair number) and the lads from Rabaul weighed anchor and departed. The town seemed quite deserted. At daylight this morning the \"Elax\" (oil tank) which had been attendant upon the destroyers left for Thursday Island, and at 8 am the \"Lili\" with a full hold and about 15 passengers left for Alexis where she transhipped them to the \"Gabriel\", flying the flag of yours truly. The latter vessel is still allowed to carry passengers & cargo for the Mission, sufficient evidence as to their duplicity not being to hand.\n\nWe are now (4 pm) rounding Croissilles. But what’s this dull ship to me? Awu’s not here! He deserted last Saturday and, like the dog that licked up the benzine, has not benzine since. There are plenty of others aboard though, including the young and pretty one, her husband (who has been released again on parole) and the baby. The passenger list totals 17 and we are carrying a mixed cargo for the Mission Stations.\n","101":" Pr Albrecht Hafen : We arrived here this morning at 10 o’clock after having called at Mugil, Kronprinz, and Hatzfeldt Hafens. I went ashore at Mugil and inspected the Mission Station and large plantations which, owing to the extreme richness of the soil, are doing remarkably well. Arrowroot is grown largely here and is found to assist greatly the maturing of the cocoanut palms.\n\n11.30 am : Life’s worth living again. Awu has just come aboard. After deserting at Alexis he walked up here (between 80 & 90 miles) and joined up again with some other delinquents. I was mightily pleased to see his ugly \"chiv\" again, though a cold shiver ran down my back as I thought of his knife entering my windpipe. However, I gave him a cigarette and I believe the old scoundrel was glad to see me for he actually smiled. I’ll drink his health in liquid quinine tonight. This liquid quinine is the latest thing in fever prevention up here. Some of the men prefer the fever, and honestly nothing could be much worse that the taste of the wretched stuff.\n\nPotsdamHafen 9.30 pm : The return of Awu was not the only thing of note that occurred today. I was concerned also in (a) a ride on horse-back (b) an earthquake (c) the entrée of Lucia.\n\nTo the ordinary individual a ride on horse-back is nothing, but to me who was astride a nag only once previously, and that about 25 years ago, the event is of vast importance. I went with one of the brothers to visit the Mission Station of Bogia, situated about five feet from the clouds or at any rate many hundreds of feet above the sea. I put my foot into the port stirrup and landed square on the upper deck of my charger.\n\nWe were off!! (at a walk).\n\nFor about ½ a mile the road was level after which it rose abruptly. By that time I felt quite at home; five minutes later I wished I was at home. The track led along the side of deep declivities and miniature precipices and if that horse had not been as sure-footed as the proverbial mountain goat I would now be a mangled corpse. But up we went, the most ticklish bit being reserved for the last where we went along a ridge about 3 feet wide with grass covered slopes descending steeply on either side. The mountain goat was not in it with the mounted goat who wished he’d never seen the blanky horse. At last, however, we reached our destination and with a sigh of relief I got (no, fell) off. \n\nThe view from Bogia was magnificent and the \"Gabriel\" looked like some toy steam-boat apparently almost at our feet. The coastline\n\ncould be picked out for miles the white foam of the breakers giving a very fine effect. To the north was Vulcan Island whose summit is never free from a column of steam, and whose crater is ever ready to pour forth streams of molten rock & ashes.\n\nWhen we went for our horses to return to the shore mine was nowhere to be seen. I was secretly overjoyed and was about to suggest how nice it would be to go back on foot when a confounded nigger brought him along. I got aboard with a groan & followed the Brother. I ask you, is it a fair thing to do your speed trials along the edges of precipices? Believing the horse would find his own way down I held the steering lines loosely and it was not till we neared his stable at a trot (I bumped up & down like a jumping jack) was it necessary for me to alter course. This time I got off more gracefully and we returned to the ship.\n\nWe reached Potsdam Hafen at 4.30 pm and went to the Mission House. While there a shock of earthquake occurred which shook the house violently. It was of short duration, however, and was soon forgotten.\n\nEnter from native house Lucia (but not di Lammermoor). Lucia is a very small edition of \"Topsy\" except that she does not wear a sack labelled \"Glass with care\". In fact Lucia was dressed quite respectably, though the roguish rolling of her eyes, with the whites thereof contrasting strongly with her black skin, betokened mischief. She is four years old and is coming as a passenger on the \"Gabriel\". The\n\ngilt of my shoulder straps took her fancy & she came quite close to examine them. Later, on our way to the boat, she got very tired and I carried her. In two minutes she was fast asleep one little black arm clasped about my neck and one hand thrust trustingly into my breast pocket.\n\nDinner on the \"Gabriel\" is an item. Try to imagine me, the only Britisher, in the company of 19 or 20 Germans, most of whom speak only a few words of pidgin English. The meals are served in German fashion and are a distinct improvement on the cockroach-laden biscuits and cheese which formed our staple food on the \"Lili\".\n","102":" Bogim Hfn 8am : \"The rain it raineth every day\", wrote Shakespeare. Here it raineth every night and stoppeth during the day (usually). One effect of the rainy nights is the remarkable clearness of the atmosphere the following morning. Last Wednesday at Madang was the most perfect morning I have ever known. The air was absolutely still and yet it was no hotter than a bright spring morning in Sydney. Dampier Island showed up plainly and looked only about five miles away. In reality it is about 40. Even with the naked eye one could distinguish the foliage on the mountain side. Rich Island (35 miles to NE) was also plainly visible. This was the first time I had seen this island although when at Dampier it was only 15 miles off.\n\nWe have now landed all our passengers except one Father; even the charming Topsy\n\nhas gone. Consequently the Dining Saloon is almost empty.\n\nYesterday morning we anchored near Boroam and Mr. Kempten, a planter, came aboard and took the oath. I afterwards visited his house and spent a very pleasant hour or two. After leaving there we went to Kairiru (mentioned on our previous voyage) where we watered the ship. At 5 am this morning we cast off and proceeded to Bogim Hafen where we are to remain all day.\n","103":" pm : I have just returned on board after spending the day at Bogim, administering the oath, having a freshwater bath, and riding a horse to Bambury Cross (I mean Karrawop).\n\nThe freshwater bath was rather interesting. One of the mission boys was detailed to guide me to the stream. He did so, but it was not deep enough to immerse my smallest toe. I asked him to show me a deeper place. We walked for a mile or two and at last came to a large waterhole. Here I disrobed and washed, to the evident enjoyment of my guide and a few companions who were apparently anxious to view at short range an Englishman en cuerpo. It was rather embarrassing but had to be endured like many other things in the tropics. It is a very common thing to sit in a room conversing with one of the Fathers while the natives crown about the windows and doors about 6 deep. Again, when walking round the plantations you are lucky\n\nif your retinue consists of less than 20 or 30. On the \"Sian\" the little Chinese steward used to bring in the courses and then stand outside the cabin and stare at me through the port-hole. Rather disconcerting, eh?\n\nThe ride to Karrawop was very pleasant, and I had so far improved as to canter a little. I returned to Bogim Hafen whistling \"Light Cavalry\".\n","104":" on \"Gabriel\" at sea : We left Bogim Hafen on Sunday night and after calling at a few mission stations en route reached the island of Ali at 10 am yesterday. While the cargo was being landed I went over the island. I have read many accounts of Missionary work in the Pacific, and the arguments for and against have been numerous. Without touching on the religious aspect I would like to say one thing and that is that the native communities under Mission influence are a thousand times (this is no exaggeration) cleaner and healthier than those who continue to live under the old conditions. This island of Ali, once the abode of filth and crime, is a picture. Running round the island are pathways where the under-growth has been cleared away, and sand and white coral laid making progress cool and pleasant. Most of the native villages are evil-smelling and dirty but those tended by the Missionaries (such as at Ali) can be entered by Europeans without fear of contamination.\n\nEitape was reached at about 1.30 pm where the garrison hoisted ZBH (Welcome). At the\n","105":" time the commandant (Capt Morrison) put off from the shore and came aboard. I went ashore with him in the surf boat and delivered the mails. Being desirous of visiting Angriff’s Hafen he decided to accompany us in the \"Gabriel\". Accordingly we returned on board at 5 o’clock. \n\nAt 4 am this morning we weighed anchor and are now (2.30) passing Neumayer River.\n","106":" at sea : We arrived at Angriff’s Hafen at about 4.30 pm yesterday. I was disappointed to find no ship or boats there that being my sole reason for making the trip. As far as interest and amusement went, however, the visit was well worth while.\n\nCapt Morrison & myself with 5 AB’s landed at the native village (Warimoo). Accompanying us was Mr R____ of the N.G. Co. and three boys whose contracts were finished and who were returning thither.\n\nThese boys were the absolute limit, too utterly utter for anything. I have seen numerous comic pictures illustrative of natives in European dress but nothing to equal the reality. They were dressed in Khaki with stand up collars and straw hats. The hats were miles too small and fitted exactly as we see them on coons in vaudeville. The ticket bearing the price and size was still attached to them. But what beat all were the umbrellas. These were brand new cheap cotton ones and they still bore the original paper wrapper. I would have given anything for a photograph but unfortunately we have no camera on board.\n\nThe male natives at Warimoo wear no clothing whatever, not even the usual loin cloth. The women wear a short lava lava (sarong) made from the bark of a tree; otherwise they are uncovered. They are a finer stamp of \"nigger\" than any others we have seen and their houses are a marvel of architecture, being built in the form of a pyramid. Their devil houses are highly ornamented and attain a height of 70 or 80 feet; the summit having a plant of some description growing there. Their village was also in better condition than those previously visited.\n\nWe returned on board at dusk and weighed anchor at 10 o’clock. Just before getting under way a native canoe came alongside to give some information relative to a missing police master. In charge of the canoe was one of the coons, khaki clothes, straw hat, and (O delight!) the umbrella! – still retaining its paper cover. He used it to direct the movements of the canoe.\n\nI forgot to mention that on our way up to Angriff we landed a small punitive party of soldiers and native police at Halol where the missionary was attacked a few nights ago. We picked them up again today. They have taken four prisoners who will be sent on to Madang.\n","107":" Tamana Isd : Today is Christmas eve! What memories crowd on us as we think of the crowds in George St, Pitt St, King St, The Strand, all eager to buy some little present for their friends. There are many absent friends this year, friends who yearn for a\n\nclasp of the hand from old comrades. Do you think of us?\n\nEven here some little sign of the festive scene is apparent. The natives are preparing for tomorrow’s ceremonies, for at this place they are all good Catholics. Our boys aboard the \"Gabriel\" will no doubt have a \"sing sing\". They are a merry crowd and all our old conceptions of the New Guinea savages are being altered. Most of us imagined them to be sullen and ferocious. This is true of many tribes but the majority are easily amused and respond readily when kindly treated. Even the sombre Awu has changed for the better. He always greets me with a smile, and accepted a vague and offhand invitation to Australia with embarrassing alacrity.\n\nWe find ourselves dropping unconsciously into pidgin English and our orders to the boatmen come quite naturally. But the saints preserve us from calling a corkscrew \"the tin-opener belonga bottle\", or stating that the venerable bald-head has \"no grass (hair) belonga cocoanut belonga him\". How our lady friends would stare if we asked them to play us something on the \"big-fella-box-plenty-too-much-teeth-when-you-hit-him-he-cry\" (piano). But perhaps we’ll get over that in time.\n","108":" : A happy Christmas to all!\n\nThis morning I, in company with my men, attended High Mass at the little church on Tamana. It was very nice and the native boys sang very well, albeit with a nasal\n\ntwang. The church was prettily decorated with palms and there was a small \"crib\" depicting the adoration of the shepherds and the visit of the wise men to the infant Jesus. But how we did miss \"Adeste Fideles\" and \"Hark the Herald Angels sing\" to say nothing of \"Christians awake!\"\n\n9.30 pm : I attended the afternoon service at 2.30 ashore, after which I strolled around Tamana with one of the Fathers. There is a small cemetry on the island where lie the remains of some of the early workers of the mission. The natives bury their dead alongside their houses placing over the grave a small roof of palm leaves. Before they came under mission influence they used to be laid about a foot beneath the surface of the lower floor of the dwellings.\n\nI had my Christmas dinner with the Fathers and it was a very fine dinner too. We even had a small Christmas Tree hung with fairy lamps & tinsel. But how one does long for home.\n\nAwu and I exchanged Christmas gifts. He gave me a bundle of spears and I presented him with a leather belt. He asked for leave to visit his home on Seleo, which is a few miles from here. This was granted and he came back in great glee and carrying a pathetically small bundle to tell me that his \"mumma\" and \"puppa\" had given their consent to his absence for two moons in Sydney. Poor Awu, must I disappoint you?\n","109":" on \"Gabriel\" at sea : We left Tamana at 8 o’clock this morning and proceeded to Tarawai\n\nleaving there a few hours later for Kairiru which we are now (8 pm) nearing.\n\nWe have a passenger aboard whom the men have named \"Capt Kettle\" owing to his likeness to that famous creation of Cutcliffe Hyne. I am more inclined to call him \"Bully Hayes\" for he is what I have always pictured Hayes to be. Of course I may be wrong but it pleases me to weave a web of impossible romance about this unkempt sample of an island trader. He has knocked about these parts for years and is thoroughly in the picture of the northern wilds of New Guinea. For it is wild here; miles & miles of coastline with never a white man; and at the rear beyond those sombre mountains? Mystery!\n","110":" on \"Gabriel\", Sepik River : Some time ago I mentioned in these pages that the time might come when millions of mosquitoes would harass us. Like the Elizabethan tragedian we now say, \"’Sdeath, the time hath come.\" On this river (Kaiserin Augusta) the mosquitos come in clouds and fifty per cent of the garrison at Wolem, which we visited this morning, are down with fever. The commandant, Lieut Chambers, has fortunately escaped so far. The Sepik (that is the native name) is one of the large rivers of the world and is navigable for hundreds of miles. The destroyers have just returned from an extended trip towards its source; we missed them by a day. It will be remembered that an expedition was prepared to investigate matters here, but it fizzled out. There is, however, a German exploring party\n\non the river headed by Dr. Thurnwald and Herr Fiebig, and the \"Sian\" has gone to meet them.\n\nThe current here is very strong and retarded our progress considerably on the way up; just now on the way back we are slipping along like a destroyer. The banks of the river are lined with sago palms & tall grass, though in point of fact they are not banks at all, swamps abounding on either side of the mighty waterway. In one place the monotonous succession of palms was broken by an impenetrable wall of creepers matted & twisted together and with beautiful green foliage. Along the surface of the water are millions (nay, billions) of \"one day flies\", a white moth with long trailing legs. The natives around here use them for food. Ugh! I pray thee have me excused.\n\nOf course we are glad to have had the privilege of visiting this place but are not sorry to be bound down stream again. The heat is terrific. \n\nI had almost forgotten to mention the natives. We passed several villages but very little sign of life was apparent. But at one place a couple of canoes put out from the shore. These canoes are entirely different from others we have seen which have all been fitted with outriggers, the rowers sitting down when propelling them. The river canoes have no outriggers and are entirely open. The rowers all stand, as many as 15 or 20 in one canoe, and keep admirable time with their paddles. From a distance the canoes look like gigantic ants.\n\nWed 30th Potsdam Hfn : The \"Matunga\" arrived here at 7 o’clock & dropped anchor close to us. As she is returning to Madang we are keeping our mails till we arrive there.\n\nOne of the men received a box of Christmas gifts and papers including an \"Evening News\" dated Nov 8th and \"S M Herald\" dated Decr. 1st. The former contains a picture of the gun \"captured\" (God bless us!) at Rabaul by the Australians. This is the gun mentioned in my diary on","111":" but as usual no mention of the Naval Reserve is made, though it was the men of my own Coy (No. 2) who \"captured\" it. The \"Herald\" is even worse. It states that \"the occupation of Fredk Wilhelmshfn was carried out entirely by the Military\". Then I couldn’t have been there after all! I pinch myself – I am awake! I re-read my own diary – and I find an entry that the Naval Guard consisted of 31 men under Lieut Read. It is too deep for me, and if I think any more about it I’ll \"bust\".\n","112":" pm, nearing Sarang : The \"Gabriel\" is not so bad after all for, though she certainly carries plenty of top-hamper, she behaves very well in a sea. During the past week or so North Westers have been blowing strongly (it is now the N.W. monsoon) knocking up a lumpy sea. The appearance of one or two of our passengers reminds me of the steward who came up to the pale looking individual in the Saloon saying gruffly, \"You can’t be sick here!\" \"Can’t I!\" said the other with miserable conviction.\n\nWe expect to reach Sarang shortly where we will anchor or the night. Then heigho for Alexis where our letters from home await us.\n\nClosing Diary to catch mail.\n","113":" : This is a mighty lonely New Year’s eve. I am alone on the GABRIEL except for the native crew. The reason is here. When we arrived at Alexis this morning there was no flag flying at the Naval Depot and no sigh of life was visible. We made fast to the wharf and I was then handed a letter from the P.O. I had left in charge. He stated that acting under orders from Madang he had returned thither with the men. We immediately cast off from the wharf and made for Madang. I went on board the WARREGO which with the YARRA, NUSA, and MATUNGA were in harbour. Here I received instructions that the men of the Naval Guard were to go back to Rabaul with the Infantry in the \"Matunga\" while I was to remain on board the GABRIEL until the arrival of Major Martin. A volunteer force from Sydney was to take the place of the old garrison, in fact they were already installed. The PARRAMATTA meanwhile has gone north to pick up the garrisons at Eitape and the Sepik. Consequently I am alone on the PINAFORE, which returned to Alexis this afternoon. What sort of a HAPPY NEW YEAR do you call this? For company I have the mail from Sydney which only accentuates the loneliness. O Kaiser Bill, what hev yer dun fer me?\n\nIn an earlier page of this diary I have quoted the challenges of several sentries. There are one or two more. When we first came to Madang a sentry on duty hearing footsteps close at hand came to the \"engage\" and shouted. \"Halt! Tiger, Tiger, Tiger!\" The latter as he recognised the garrison dog.\n\nBut the following (though it did not occur at this place) is not bad:-\n\nA sentry perceiving a small party approaching cried, \"Halt! who goes there!\"\n\n\"Officer drunk on a barrow,\" answered one of the party.\n\n\"Pass officer drunk on a barrow, all’s well,\" was the reply.\n\nMadang","114":" : My gloomy forebodings for New Years day were wrong for I spent a very pleasant time. On Thursday night Mr Stiller of Sarang arrived in the \"Genoa\" and yesterday morning we accepted an invitation from Mr & Mrs Penn to spend the day with them. We were treated with the utmost kindness. High Mass was held in the church at Alexis & the natives turned out in their best. Bright red lava lavas predominated though many went the \"whole hog\" & appeared appareled in semi-European dress. Awu was a good example of the polished gentleman (Griffin polish – black!). He wore a pair of khaki trousers (6 inches too short), a blue guernsey, and a smile.\n\nThis morning I came to Madang in one of the \"Gabriel’s\" boats with Awu proudly steering. The \"Yarra\" & \"Nusa\" are at anchor here and the \"Lili\" is flitting about under new control. After our long acquaintance it hurts somewhat to see her thus, but it must be. Madang is deserted. The garrison consists of only 25 men & one officer. I went aboard the \"Yarra\" this afternoon & had a chat with Lieut Keightley (in command). The \"Warrego\" has left on a short cruise.\n","115":" : The \"Yarra\" left this morning for a cruise south. I think I shall await the Major here; otherwise I might miss my chance for a passage home to dear old Sydney. Things are very quiet.\n","116":" : Yesterday I went up to Alexis in\n\nthe dear old \"Lili\". It was fine to feel the grip of the wheel again. The smell of the exhaust, the rattle of the machinery, the inevitable breakdown all reminded me of happier days; days when my own men trod her decks – jolly good fellows every one of them. It made me feel a bit sad & lonely to think that I was the only one left of that gallant & intrepid (eh! what?) crew. But the days of piracy are over. No more can we rush through the water at 4 ¾ knots & strike terror into the hearts of our enemies – who usually proved to be the best of friends.\n\nWhen I arrived alongside the \"Gabriel\" at Alexis Awu’s black face appeared over the rail with a cannibalistic smile of welcome, while the old bo’sun touched his cap and grinned cordially. Oh, I’m the captain of the \"Pina—\" (but I think I’ve said that before).\n\nOn our way back we passed the \"Genoa\" proceeding under sail to Madang.\n\nLast night the \"Warrego\" & \"Yarra\" returned to port, the \"Yarra\" again leaving before daylight this morning.\n","117":" : A lazy day. Doing nothing but waiting for the \"Parramatta\". The \"Yarra\", \"Warrego\" & \"Nusa\" are here.\n","118":" : The Major returned last night in the \"Parramatta\" bringing with him the garrison from Angoroam (Sepik River). While there they had a slight scrap. The police master (German) had left his post & buried all records & papers. Thanks to some native boys these were recovered & then followed a search for the police master & his assistant. Kondoo, the black sergeant of police at Madang, came in sight of them. They immediately fired at him; Major Martin, Comdr Cumberlige & one or two others gave chase. Through thick jungle, over uneven ground, among the twisted grass; at last they brought them to bay and caused them to surrender. They were brought back here and placed in Calaboosh (gaol).\n\nI shall probably be going across to Rabaul on Sunday in the \"Sian\" which is expected to arrive with the Eitape garrison on Saturday (the \"Parramatta\" did not go further that the Sepik River). What my orders will be then I don’t know.\n\nToday I made another trip to Alexis in the \"Lili\" calling at Mr Penn’s en route where I met with the usual cordial reception. It is the nearest approach to home that I could possibly have and I parted from my kind host & hostess with sincere regret.\n","119":" : Last night the \"Sian\" arrived with the men from Eitape. They brought sad news. One of their number, Sergt Tibbey, while in the surf was caught in a huge roller & dashed down on the sand with terrific force. He was taken to the\n\nquarters & everything possible was done. In spite of the attentions of the A.M.C., however, he succumbed to his injuries which consisted of fractured skull & damaged spine. The Mission doctor was sent for before the end but he could do nothing. After going along for the whole of the expedition it seems terrible that just as he was leaving for home he should come to such an untimely end.\n\nThe \"Elax\", oil tank, is expected to arrive from Thursday Island in a day or two; then \"Home sweet home\".\n","120":" : Great preparations are being made on all sides for our departure, boxes packed, curios arranged, farewells waved to old enemies, and on every face \"a smile that is childlike & bland\".\n\nThe \"Sian\" had a merry time up the river in spite of the heat & the myriads of mosquitoes. At one place they were painting ship, the natives looking on curiously the while. A seaman playfully daubed one of them; his friends were so delighted that they all wanted it. When they were coloured they jumped into their canoes and made off and the \"Sian’s\" people thought that was the end of it. No jolly fear! They came back shortly with the whole village eager to be painted. All sorts of figures and mottoes were slashed on the breasts & backs of the applicants who grinned appreciatively. One proud fellow was labelled \"Anthony Hordern’s for best brands of tinned missionary\" while others had quotations, ad’s, & every other conceivable style of decoration.\n\nLast night a few of us had a convivial\n\nvaledictory. It all arose from the vagaries of the \"Warrego’s\" motor boat which whizzed round in all sorts of alarming ways completely turning our heads. This may account for the extr’o’rin’ry vision of one of our number who when returning on board his ship made for the middle one of three wobbling accomodation ladders and found he had missed the lot. We had dinner on the \"Warrego\", music on the \"Sian\", & flying visits to all the ships in port, to say nothing of marching solemnly through the major’s office in single file. We expected a wigging – but didn’t get it.\n\nWhen returning later (much later) to our domiciles & ships the rain came down in torrents & we were drenched to the skin; but \"what do we sea-dogs care?\"\n","121":" on board Destroyer \"Yarra\" at sea : Instead of travelling on the \"Sian\" I joined this ship last night for the trip to Rabaul. We are to call at several places en route and are travelling in company with \"Warrego\" & \"Parramatta\". Madang was left at 8 pm.\n\nWhen about 15 miles out a light was sighted to the N.E. and the \"Yarra\" was ordered to investigate. We opened out to 17 knots and rapidly over-hauled it. It was thought to be the \"Elax\" which left harbour an hour or two before the destroyers. As we drew abreast the searchlight was got to work; the darkness was suddenly pierced by a brilliant shaft of light in which the rain-drops (it was coming down fairly hard) scintillated like diamond points.\n\nThe beam was trained in the direction of the light and the \"Elax\" looking in the glare like some phantom ship was seen plugging along. The \"Yarra\" again took up her position.\n\nWe are now (11.30 am) nearing our first port of call Morobe (Adolf hafen).\n\n9.30 pm Adolph Hafen : Immediately on arrival the garrison for this place landed under Capt Nelson. The German flag was hauled down & the native police mustered and taken over by the British. It is a fine harbour with beautiful surroundings and resembles in some respects Broken Bay, N.S.W. All the German residents except one & including the Government officials had left the place. Tropical fruits of all kinds were found in abundance.\n","122":" on \"Yarra\" at sea : The \"Yarra\" received orders this morning to proceed at 18 knots direct to Rabaul and we are now rushing along at that speed towards New Britain. It is exhilarating to stand on the for’ard deck & watch the foam ranging up alongside like some mighty wave breaking on a coral reef, and to feel the decks bounding along beneath one’s feet. Best of all it is bringing me nearer to Rabaul and that is one step nearer home.\n","123":" on board \"Sumatra\", Rabaul : We arrived here yesterday at midday after an enjoyable run across and I am now installed on the \"Sumatra\" which is being used as an officers’ mess pro tem. The \"Sian\" arrived\n\nlast night with the remainder of the Madang Garrison. I went aboard this morning & had a chat all round. The men of the Naval Guard, Alexis, went to Sydney per the \"Eastern\". I am sorry they have gone; after having been with them for so long I would have liked to return with them. It is likely that the \"Sian\" party will leave today by the \"Maninda\" while I remain to take up garrison work for a month or so, then home.\n\nClosing diary to catch mail.\n","124":" (Rabaul) : Well, the \"Maninda\" has gone, & with her have gone all those I have been associated with at Madang, except the Major who arrived in the \"Warrego\" about an hour before the \"Maninda\" cast off, and one or two men in hospital. \n\nQuite a large gathering assembled to bid goodbye to Capt Morrison & Lt Chambers and things were very jolly aboard.\n\nAnd now starts the weary waiting for our transport which may arrive anytime during the next few weeks. I have during my spare time paid one or two visits to the \"Una\" & \"Fantome\" which are in port here. In fact there are quite a number of ships at anchor including the \"Samoa\", a fine auxiliary three-masted schooner captured some time ago. A fire occurred aboard her a few nights ago & considerable damage was done. Last week the naval garrison at Herbertshohe unearthed two or three mines, reminding them of the narrow escape of our troops during our initial operations in New Britain, now a matter of history.\n","125":" Jan","126":" Herbertshohe : I have had many commissions since leaving Sydney five months ago, so one or two more won’t matter I suppose. I am now Executive officer of the Garrison at Herbertshohe, and it \"doth not yet appear what I shall be.\"\n\nSince writing my last entry on","127":" inst I have had a short run in the\n\n\"Una\" where I again met Skeat (Surgeon) & Whittle (N.S.D. – now Engineer Lieut) who figure in the earlier pages of this journal. I find now that after all we were better off at Madang & Alexis than those left here as their work has consisted purely of garrison duties except a few told off as steam boats’ crews. As far as I can gather, I am the only officer who has had the pleasure of the piratical excursions previously recorded, though Sub Lt Hext has been for the past few months at Admiralty Is.\n\nA most disgraceful state of things exists here & in Rabaul in connection with food supplies. Rations which should have been here weeks ago have not yet left Sydney & the men are existing as well as possible on the meagre scale of provisions now in force. Men who have left home & all that home means & have been for months suffering from fever & other maladies common to the tropics leave the walls of the hospital to find a biscuit & a short ration of bully beef awaiting them. Wake up Australia! is this the way you treat the men who answered the call so readily? God grant that those who have gone to bear even greater hardships on the frozen battlefields of Europe will receive kinder consideration at your hands.\n\nGlancing through the \"Bulletin\" just now I came across a paragraph recounting the death by accident of Dr. Prevast of Chatswood. The last time I saw him was at Palm Island where he came aboard the \"Berrima\" with\n\nseveral brother officers. I was speaking to him for a while & he was in his usual good spirits chatting about Sydney & Sydneyites. What a number of things have happened since we left Australia.\n","128":" : The poet has said that\n\n\"The trivial round, the daily task\n\nWill furnish all we ought to ask\".\n\nBut he was never on Garrison duty; had he been he could never have written thus. The trivial round becomes irksome; the daily task is conspicuous by its absence.\n\nToday I went out on horseback to Bita-paka, which is about 12 miles from here. On the road out we passed the small Herbertshohe cemetry where lie several of those killed during the attack on the Wireless Station last September. Coming to the \"cross roads\" we turned to the right and covered the same ground as some of Bowen’s party did on that occasion. My companion, Cid Wilham, pointed out the places of interest, \"That is where Dr Pockley was shot\", or \"Here is where Courtney fell\". The undergrowth on either side of the road is almost impassable & I could get some idea of what our men had to struggle through. The first trench occupied by the Germans commanded a stretch of road about 500 yds long & about 2 miles farther on the second trench covered a cutting where our men could have been mowed down like grass.\n\nOn our arrival at the Wireless Station I was amazed to see the immense building and\n\nplant representing thousands of pounds now, alas, going to decay.\n\nWhen returning I visited the graves of A.B. Courtney & Commdr. Elwell near the waterfront. As I stood before the simple crosses erected above their remains I could see again the bright face of Elwell, as I used to see it on the \"Berrima\". He was only 32 years of age & his short life was closed by one of those brilliant dashes one hears of on almost every battlefield. He was liked & respected by all who knew him.\n","129":" : Church Parade was held this morning at 9.15 and the men joined heartily in the singing :-\n\n\"From ‘eaven ‘e came and sought ‘er\n\nTo be ‘is ‘oly bride;\n\nWith ‘is own blood ‘e bought ‘er,\n\nAnd for ‘er life ‘e died.\"\n\nWhat though some of the words ‘ave their ‘eads chopped off; aye, what though!\n\nStanding on the platform at the end of the mess room one felt one’s heart go out to these men in the green duck suits & blue navy collars indicative of their calling. Sturdy chaps they were when they left Sydney eager to do their duty, but now, worn by sickness & fever, they long for home. Nevertheless they have done their job; New Britain & New Guinea now acknowledge the sovereignty of King George, and when they return to Australia it is to be hoped that their compatriots will give them a fitting welcome.\n\nThey saw but little fighting, but they were\n\nprepared to carry the Union Jack to victory against all odds should occasion arise. As they sang the last verse of the closing hymn I could not help thinking of their comrades sleeping a few hundred yards away, awaiting the last bugle call.\n\n\"Soon shall come the great awakening,\n\nSoon the rending of the tomb;\n\nThen the scattering of all shadows,\n\nAnd the end of toil & gloom.\"\n","130":" : Yesterday afternoon I rode over to Kuradui, the home of Mrs Parkinson on the southern shore of Blanche Bay. This beautiful house has been the refuge of the Herbertshohe officers for months & they have received the greatest kindness from the inmates. The position is a glorious one and everything connected with the homestead speaks of beauty & refinement.\n","131":" : I have for the last few days been suffering from an attack of dysentery. I am now feeling better but rather weak.\n\nSub Lt Hext and his party of 10 men returned from the Admiralty Islands today, having been relieved by a small detachment of the \"Druids\".\n\n\"Druids\" I must tell you is the appellation given to the Tropical Force which arrived per the \"Eastern\" last month. They get their name because of their age which is an unknown quantity. When speaking of them one unconsciously fingers a \"bob\" feeling that he is about to purchase an Art Union Ticket.\n\nHext’s party had one exciting episode when two native prisoners broke gaol &\n\nwere shot dead; otherwise things went smoothly.\n\nWe have bought up all available stores for the use of the garrison but these will only last for about 5 days. After that ----?\n","132":" : Nothing of note has happened since the last entry; indeed what can happen here? The \"Marsina\" arrived from Queensland last night, but unfortunately brought no stores for the Garrison.\n\nOn Saturday a cricket match took place between the men of the destroyer \"Parramatta\" and the garrison resulting in a win for the \"Parramattas\" by 40 runs. A concert was held in the evening which proved a great success, many of the artists referring in humorous terms to the shortage of provisions.\n\n6.0 pm : The \"Matunga\" has just passed Herbertshohe on the way to Rabaul; naturally we are now impatiently awaiting our mail which will probably be the last before leaving for the South. We hope she has brought stores.\n\nOn Sunday the officers of the Garrison dined at Kuradui, being probably the last weekend to be spent in Herbertshohe. A very pleasant evening was spent amid fairy-like surroundings, the dining room being one mass of sweet-smelling tropical plants set amidst luxuriant palms & ferns. Silent & smiling native attendants, sparkling conversation, with the intoxicating perfume of a thousand flowers, wafted over & around us by the\n\n\"swish – swish\" of the punkas, created an impression that will last possibly for a lifetime.\n","133":" : At last ! At last! We are to leave here on Saturday for HOME.\n\nThe \"Matunga\" was followed on Monday night by the \"Eastern\" and the Administration has decided to send the Naval Contingent back in her. We will embark on Friday & everything should be ready for our departure the following day. The duties of the Executive Officer will be legion for a day or two, but think of the ultimate result! \n\nThings can happen here in spite of what I wrote a day or two ago. This morning we had quite an exciting hour or two. Word was received at Headquarters that the Benzine Store was on fire. The fire-bell was rung and the men went to their stations. Nothing could be done, however, as the only means of extinction were fire buckets & with 12 or 13 drums of naphtha & about 40 cases of kerosene it would have been madness to attempt it. We satisfied ourselves therefore with standing by the Post Office ready to quench any outbreak at that quarter. The P.O. is the nearest building to the store, which was in realty a large tent. As it happened it was fortunate that it was so, as the sparks from a wooden structure would have been a serious menace to the surrounding buildings.\n\nAs the flames got a good hold a dense volume of black smoke arose which hung like a canopy over the whole camp. Then as the naphtha drums burst there followed a series of terrific explosions. After a particularly loud one a huge drum was flung high in the air & descended with a crash on the iron roof of B block (the quarters occupied by No. 5 Coy). Luckily it burnt out before reaching the ground, otherwise considerable damage night have been done. The fire eventually died down & now all that remain are a number of blackened kerosene tins & twisted & broken oil drums.\n","134":" : \"______!\" \"______!\" \"______!\" \"______!\" These represent the words I, in common with the rest of the Garrison, have been saying since 11 o’clock this morning. And wherefore? Like Eurydice we were almost out of Hell, but are now doomed to remain therein indefinitely. The Navy Board has decided that the \"Eastern\" shall not be used as a transport. All arrangements have been cancelled and we have again descended into the Slough of Despond whence we had been temporarily delivered.\n","135":" : \"Dear diary\", what a long stretch since the last entry. But I have been too disgusted to write after our last disappointment. But I must chronicle one or two events.\n\nOne day during the week I went out to\n\nToma with the O.C. Garrison (Lt Comr. Brace-girdle). This is the place where Colonel Watson went on his famous march (vide \"How Australia took New Guinea\"). Particulars of the march were given in these pages some months ago. I was shown the places shelled by the \"Encounter\" on that occasion, and also the trenches shelled by the 12 pn. Field Gun of the Naval Reserve.\n\nToma itself is an immense mountain & the surrounding country resembles somewhat the South Coast districts of New South Wales. It is used by the residents of Rabaul & Herbertshohe as a health resort, and a fine boarding house offers the necessary accomodation at a reasonable figure.\n\nOn Sunday we again visited Kuradui for another \"last gathering\" as Dr. Runge (Government Medical Officer) laughingly remarked. He is returning to Sydney with us and the repeated preparations for departure amuse him exceedingly.\n\nToday (Tuesday) the natives gathered to bid us farewell & gave a Duk Duk Dance for our benefit. \n","136":" pm : I think we are really going home now; the \"Navua\" arrived this morning and about 100 of our men have gone to Rabaul to stow boxes & heavy gear.\n\npreparatory to our final (?) departure tomorrow. We understand that the \"Eastern\" is to take the invalids, and the remainder will travel on the \"Navua\". There will probably be about 1150 troops all told on both vessels. So, dear diary, this is positively my last appearance at this theatre (perhaps).\n","137":" on board T.S.S. \"Navua\" at sea : \"Rolling Home\". Thank God, this time it’s true. We left Rabaul at 4 pm on Wednesday. As the vessel drew away from the wharf the thousand men aboard broke into a roar of cheers which was answered by a feebler roar from the \"Druids\" & others left behind. The \"Eastern\" left at noon & she will in all probability reach Sydney a day ahead of us.\n\nDuring Wednesday afternoon & night the men were rather discontented, their quarters being none of the best. But they brightened up considerably yesterday when they found that all deck space was made available to them except a portion about 12 feet square reserved for Officers. At night they are free to sling hammocks where they please.\n\nLast night they were in excellent spirits & broke into song, ragtime of course predominating. The chorus of \"Tipperary\" found favour when altered thus,\n\n\"It’s a long, long way to Sydney Harbour,\n\nIt’s a long, long way to go;\n\nIt’s a long, long way to Sydney Harbour,\n\nTo the sweetest girl I know.\"\n\nBut what took the fancy of the \"House\" was :-\n\n\"I don’t want to be a soldier,\n\nI don’t want to go to war;\n\nTake me back to sunny New South Wales,\n\nI never loved my home so much before.\n\nI don’t want your old New Guinea,\n\nHerbertshohe or Naru;\n\nTake me back to sunny New South Wales,\n\nSydney’s the place for me.\"\n\nThis morning we have run into a light South Easter & pleasant conditions prevail.\n","138":" : The \"light South Easter\" has developed into something more. Yesterday it hauled round to the South and today it is blowing very hard right in our teeth. The glass is still falling so that we expect it blow harder still. Meantime the bridge awning and other superfluous canvas has been furled in readiness for whatever may be in store. \n\nThis morning we sighted the first land since leaving Rosel Island, a speck of land situated on the eastern extremity of Wreck Reef. The next land we pick up should be the South Eastern end of Queensland or the North Eastern seaboard of N.S.W.\n","139":" : The aforesaid Southerly wind became a howling gale by Tuesday night & between midnight & 2 am a hurricane. In eight hours we made only 29 miles against the enormous sea & tremendous wind. It was a fine sight as the high bows of the \"Navua\" dipped into the huge green seas topped with foam. As the crests of the waves rose above the rail\n\nthey would be swept right over the bridge & onto the boat deck in blinding spray while the roar of the storm in the rigging was deafening. The fore-hatches were battened down, but rising from the after hold the huge wind-sails reared themselves like gigantic wraiths trembling & shuddering in the sickly light from the electric bulbs. All through the night one could hear the waves swept along the decks and feel the pounding of the bows & the swing of the propellers as the stern was thrown clear of the sea to crash down again with terrific force. An experience to remember and gloat over when we sit ashore in the sweltering heat of a summer’s day.\n\nSome remarked that our ship did not make much progress, \"We kept afloat, anyhow\", was the sententious reply of one of the ship’s officers.\n\nYesterday the sea was still pretty high but today a gentle breeze fans our cheeks from the eastward and the ship moves on with a gentle motion.\n\nCape Byron was passed this morning at 7 am & we can now distinguish faintly the coastline of our own loved New South Wales. We expect to reach Sydney tomorrow afternoon.\n","140":" : As predicted we reached Sydney yesterday, entering the harbour at 11.15 am &, after medical inspection, proceeded to the NDL Wharf at about 2 o’clock. The reception by the ferry boats was most encouraging & this morning the whole contingent marched through the principal City streets to the accompaniment of the stirring strains of\n\nthe Police Band, while the citizens cheered & flags & handkerchiefs waved incessantly.\n\nI was very glad to see such a warm welcome for the men after their experiences of the past few months and they appeared to forget the hardships they had gone through in the cordiality of their reception.\n\n"}}