{"Document Name":{"0":"Diary_0288","1":"Diary_0288","2":"Diary_0288","3":"Diary_0288","4":"Diary_0288","5":"Diary_0288","6":"Diary_0288","7":"Diary_0288","8":"Diary_0288","9":"Diary_0288","10":"Diary_0288","11":"Diary_0288","12":"Diary_0288","13":"Diary_0288","14":"Diary_0288","15":"Diary_0288","16":"Diary_0288","17":"Diary_0288","18":"Diary_0288","19":"Diary_0288","20":"Diary_0288","21":"Diary_0288","22":"Diary_0288","23":"Diary_0288","24":"Diary_0288","25":"Diary_0288","26":"Diary_0288","27":"Diary_0288","28":"Diary_0288","29":"Diary_0288","30":"Diary_0288","31":"Diary_0288","32":"Diary_0288","33":"Diary_0288","34":"Diary_0288","35":"Diary_0288","36":"Diary_0288","37":"Diary_0288","38":"Diary_0288","39":"Diary_0288","40":"Diary_0288","41":"Diary_0288","42":"Diary_0288","43":"Diary_0288","44":"Diary_0288","45":"Diary_0288","46":"Diary_0288","47":"Diary_0288","48":"Diary_0288","49":"Diary_0288","50":"Diary_0288","51":"Diary_0288","52":"Diary_0288","53":"Diary_0288","54":"Diary_0288","55":"Diary_0288","56":"Diary_0288","57":"Diary_0288","58":"Diary_0288","59":"Diary_0288","60":"Diary_0288","61":"Diary_0288","62":"Diary_0288","63":"Diary_0288","64":"Diary_0288","65":"Diary_0288","66":"Diary_0288","67":"Diary_0288","68":"Diary_0288","69":"Diary_0288","70":"Diary_0288","71":"Diary_0288","72":"Diary_0288","73":"Diary_0288","74":"Diary_0288","75":"Diary_0288","76":"Diary_0288","77":"Diary_0288","78":"Diary_0288","79":"Diary_0288","80":"Diary_0288","81":"Diary_0288","82":"Diary_0288","83":"Diary_0288","84":"Diary_0288","85":"Diary_0288","86":"Diary_0288","87":"Diary_0288","88":"Diary_0288","89":"Diary_0288","90":"Diary_0288","91":"Diary_0288","92":"Diary_0288","93":"Diary_0288","94":"Diary_0288","95":"Diary_0288","96":"Diary_0288","97":"Diary_0288","98":"Diary_0288","99":"Diary_0288","100":"Diary_0288","101":"Diary_0288","102":"Diary_0288","103":"Diary_0288","104":"Diary_0288","105":"Diary_0288","106":"Diary_0288","107":"Diary_0288","108":"Diary_0288","109":"Diary_0288","110":"Diary_0288","111":"Diary_0288","112":"Diary_0288","113":"Diary_0288","114":"Diary_0288","115":"Diary_0288","116":"Diary_0288","117":"Diary_0288","118":"Diary_0288","119":"Diary_0288","120":"Diary_0288","121":"Diary_0288","122":"Diary_0288"},"Date":{"0":"unknown","1":1382.0,"2":1383.0,"3":1387.0,"4":1388.0,"5":1389.0,"6":1398.0,"7":1404.0,"8":1410.0,"9":1418.0,"10":1419.0,"11":1421.0,"12":1424.0,"13":1425.0,"14":1426.0,"15":1427.0,"16":1429.0,"17":1430.0,"18":1432.0,"19":1435.0,"20":1440.0,"21":1447.0,"22":1448.0,"23":1449.0,"24":1450.0,"25":1454.0,"26":1457.0,"27":1460.0,"28":1461.0,"29":1462.0,"30":1463.0,"31":1464.0,"32":1465.0,"33":1466.0,"34":1479.0,"35":1480.0,"36":1481.0,"37":1482.0,"38":1483.0,"39":1487.0,"40":1488.0,"41":1489.0,"42":1490.0,"43":1491.0,"44":1512.0,"45":1516.0,"46":1519.0,"47":1532.0,"48":1545.0,"49":1546.0,"50":1550.0,"51":1559.0,"52":1563.0,"53":1573.0,"54":1577.0,"55":1580.0,"56":1583.0,"57":1586.0,"58":1587.0,"59":1588.0,"60":1589.0,"61":1590.0,"62":1592.0,"63":1593.0,"64":1594.0,"65":1596.0,"66":1598.0,"67":1602.0,"68":1604.0,"69":1605.0,"70":1606.0,"71":1608.0,"72":1609.0,"73":1610.0,"74":1612.0,"75":1616.0,"76":1617.0,"77":1618.0,"78":1621.0,"79":1626.0,"80":1630.0,"81":1631.0,"82":1632.0,"83":1636.0,"84":1639.0,"85":1647.0,"86":1651.0,"87":1656.0,"88":1662.0,"89":1668.0,"90":1674.0,"91":1677.0,"92":1699.0,"93":1714.0,"94":1715.0,"95":1716.0,"96":1717.0,"97":1718.0,"98":1719.0,"99":1720.0,"100":1722.0,"101":1723.0,"102":1724.0,"103":1725.0,"104":1727.0,"105":1728.0,"106":1729.0,"107":1731.0,"108":1735.0,"109":1737.0,"110":1740.0,"111":1743.0,"112":1744.0,"113":1745.0,"114":1747.0,"115":1748.0,"116":1749.0,"117":1750.0,"118":1751.0,"119":1752.0,"120":1753.0,"121":1754.0,"122":1755.0},"Entry":{"0":"\n\n","1":"\n W.I. went on leave to Blighty. Twenty five men attached to our unit\n\nThe Weather has been beautiful these last few days\n","2":"\nA big \"stunt\" on. Two operating teams have arrived. \n\nWorked for over thirty hours without a break. Feeling absolutely fagged out\n","3":"\nStill going strong. Wounded men still pouring in. We have not much news of what is happening up the \"Line\"\n","4":"\n\nTwo teams left us this evening on very short notice.\n\nVery busy night. Things seem to be slackening off a bit now.\n","5":"\nOur station has been shelled to-day. Some very heavy stuff sent over. Sisters and nurses have been sent away in a hurry. When the shelling took place the Motor Ambulances were busy evacuating patient to the hospital train. The big shell landed a few feet away from these ambulances. Luckily it did not explode or there would have been a good number killed including men who had already been wounded. The kind of shell sent can be imagined from the fact that one had dropt on the road making a hole ten feet in diameter, the depth I could not see. as it had rapidly filled with \n\n \n\nwater. \n\nI was asleep in my tent when the shelling was going on but I was so dog-weary that I never bothered to get up although the whiz of shells gave one a very creepy feeling as they passed rapidly overhead\n","6":"\nKept exceedingly busy with operations\n","7":"\nStill very busy.\n\nGood progress has been made by the troops\n\nVisiting the farm occasionally, when I can get a few minutes to spare\n\nVery wet and cold. Preparations being made for winter. Huts, etc being built\n\nCol Dick has left the unit\n","8":"\nVery busy, Operations. \n\nDown at the farm, the old man gave us an exhibition of cutting the teeth of very young pigs. The squeals of these young pigs as they wriggled to get free from the pincers was very funny indeed Although the proceeding seemed very cruel, still I believe they suffered more from shock than anything else.\n\nThe Germans attacked a small outpost, as a result we got a number of serious cases in to-day.\n\nSome of the Observation balloons are getting bombarded to-day. A big number of cases of \"Trench Feet\" brought in to-day We have also had a large\n\n \n\nnumber of gas cases brought in This gas blisters the patients just as if they had been scalded. The parts principly affected are those parts of the body where one usually sweats profusedly i.e. the armpit etc The eyes are also very badly affected Huge blisters gather round the eyes, in many cases blinding the patients\n\nThe town of Bailleul has been badly knocked about lately from shell fire\n\nThe college we had our C.C.S. in at that place, has come in for a good share of it.\n\nB.P. paid us a visit he has had a pretty rough time lately and looks very thin and worn out. Blood drawn from a Gas patient An intravenous of Soda Bicarbonate given, after which he seemed much better.\n","9":"\nVery wet weather, have been suffering from Influenza. Off duty for three days. This is my birthday. Spent it in bed\n\nW.R. of the Canadians paid us a visit.\n\nOne of the sisters belonging to the last visiting teams has been killed by the dropping of a bomb from an Aeroplane, on to the C.C.S. she had gone to, near Mont des Cats.\n\nWalked to Vieux Berquin with Bob. P.\n\nBob. M. has gone to India\n","10":"\nW.I. has gone to No 3 A.C.C.S. \n\n \n\nwith an Operating Team\n\nTerrific bomdardments have been taking place here lately.\n\nStrong winds are blowing to-day.\n","11":"\nVery wet to-day\n\nBig rush of walking cases came in here to-day\n\nKept very busy till early in the morning\n\nSome more bombardment of Bailleul\n","12":"\nGreat deal of bombardment of B. today\n\nCol. S. our senior surgeon has left us to-day\n\nHe got on to the E.7. Canteen Killing some and wounding others. Not feeling too good yet.\n","13":"\nObservation Balloon potted to-day Eight hundred operations have taken place these last two months in the O.T.\n","14":"","15":" Very Wet. Leaves are falling from off the trees\n","16":"\n\nWent into Bailleul. Every time one goes into that town now, one finds that more damage has been done by Fritz’s shells. Many houses have been completely squashed and others have been badly damaged\n\nOrders as regards permits are more strict\n\nMajor S. has left us to be O.C. No 2 A.C.C.S.\n\nThings are very quiet with us just at present.\n\n \n","17":"\nNot much doing. Result all officers are finding fault. If there is no rush on as regards wounded, they find unnecessary work other ways. They have too little to do and too much time to do it in.\n","18":"\nHeavy bombardment of Bailleul.\n","19":"\n\nHeavy bombardment going on up the line.\n\nThe thump, thump, thump of the continuous bombardments has given me a severe headache. Very discontented. Sweating on leave\n\nSome of the men are all trumping up a tale of woe and getting leave before their time.\n","20":"\nThere has been an almost continuous bombardment for five days. It is something terrific\n\nFarewell concert to Lt Col Stacey\n\nCapt Kasy left.\n\nWent to Bailleul.\n\nParade before Col M. regarding leave.\n\nA list put up on Notice Board. Fifth on the list.\nWeather very cold.\n\nNot much doing in the O.T. Read first part of G.R Green’s \"Short History of the English people.\n","21":"\nAwakened out of my sleep in the middle of the night and told that I am going on\n\n \n\nleave to Scotland\n\nD.I. and myself are getting away to-gether\n","22":"\n\nA long drawn out journey to Boulogne. The usual large crowds on leave\n","23":"\nArrived at London. Got my affairs fixed up at Horseferry Road.\n\nHad some time to wait in London. Went to the theatre to the \"Maid of the Mountains\" Had a few trips in the London Tube.\n\nLeft London by the 10.30 p.m. Reached Glasgow at 10.10 a.m. Got the 12 mid day to Stirling. Very wet\n","24":"\nWalked over Sheriffmuir with Jeanie and D. Bridge of Allan in the afternoon. In the evening church.\n","25":"\nIn the newspapers we read of a fierce battle raging at Cambrai. Visited Edinburgh and Prestonpans Had some difficulty with my pass\n\nVery wet in the morning but good during the day\n","26":"\n\nNews of numerous casualties amongst local men in the Cambrai affair\n\nHeavy snow fall\n","27":" D.I.\n\nD.I. Left Stirling\n","28":"\nVisited the factory. Left home 9.52\n\n \n","29":"\nReached London 9 a.m. \n\nAir raid had taken place early in the morning. \n\nVisited Trafalgar Square. \"The Old Curiosity Shop\" of Dickens. Had a good look at the Houses of Parliament and Westminster Abbey from the outside. Saw the Cleopatra Needle on the banks of the Thames\n\nWent into that magnificent place called St Paul’s Cathedral. To go inside and to look up at the dome is most awe inspiring. We were taken down the crypt. This is a large underground hall where all the illustrious men of Britain are buried. \n\nIn the evening we went to the comedy entitled the \"Boy\" at the Adelphi Theatre. It was a laugh from beginning to end.\nSpent the remainder of the night strolling about the streets until mid night, then we went to our hotel\n","30":"\nLeft London this morning. Seven train loads of troops had already left and I was hoping that our train would be put off so that we would have another day in London, but my luck was out.\n\nArrived at Shorncliffe and marched to Folkestone reaching there about ten o’clock\n\nLeft Folkestone 2.30 p.m.\n\nHad a rough voyage across the \n\n \n\nEnglish Channel. Many seasick. When we reached Boulogne it was raining heavily and by some means or other the Australian party lost the main party\n","31":"\nStayed at the Rest Camp, or the infamous \"One Blanket Hill\" that is known up and down the \"Line\"\n\nBribed sentry to let us go into Boulogne. Went out to Wimereaux where no 2 A.F.H. is. Did not see Sister. M. she having been transferred to England.\nVisited the Boulogne Cathedral. Not very much impressed with it.\n\nLeft camp to go back to our unit at 10.30 p.m. \n\nArrived at Bailleul Station after having a good sleep in train.\n","32":" Reached No 1 A.C.C.S. about 7.30 a m. We found the camp turned upside down when we arrived there. Nearly every man was working outside on General Duties. The C.C.S. has been turned into a Rest Station. Off duty all day. Went down to the farm and spent a pleasant afternoon\n","33":"\nCutting and trimming hedges, but as always happened to me, I could never get a job on General duties long, that is if there happened to be any nursing jobs to do. In the afternoon I was sent in to C. Ward to work. Found there Sister Goggan in charge. I had met her in \n\n \n\nEgypt, in fact, she was the last nurse that I had worked with before I left to go to Anzac. She had, had six boys working with her but none could agree with her perculiar manner. However, having worked with her previously, I pretty well understood her and I managed to get along with her very well indeed\n","34":"\nWorking in Ward. Plenty of running about fixing things for the Xmas Celebrations\n","35":"","36":" Boxes issued to all, splendid breakfast.\nA sumptuous dinner was provided for the patients dinner.\n\nThe ward was very nicely decorated.\n\nAfter our busy time fixing up the patients with their dinner, a thing that was no small job, the staff had theirs\n\nIt was a perfect feast of good things. We had:\n\nSoup; Poultry, Bacon, Potatoes, Peas and Beans; Roast Pork & Sauce; Plum Pudding & Sauce; Custard & Jelly;\n\nOn the table there was also Champagne, Beer, Aerated Waters, Sweets, Raisins, Dates and Almonds galore.\n\nTo be so near the firing line and to have so rich a feast was inconceivable to any one but those who were there. The cooks had been working for the last forty-eight hours continuously for the making of these dishes.\n\n \n\nAnd they deserve great credit for what they had done.\n\nThe whole day was a day of festivity and jollity amongst the men but it was exceedingly cold and the field was knee deep in mud. In the evening we had a very heavy fall of snow which covered the tents, ground and trees beautifully. This fact coupled with the brightly shining full moon made one think of a good old fashioned Xmas.\n","37":"\nPlenty of cleaning up in the wards after the Xmas Festivities\n\nHave caught a very heavy cold.\n","38":"\nDecided to provide a surprise party on the farm people\n\nWe got a lot of foodstuffs to-gether filling a couple of sand bags with them we slipt over to the farm house with them Took charge of the house and with the assistance of Marie Louise spread the table with the things that we had brought We had a great evening and everyone thoroughly enjoyed themselves.\n\nAfter supper Bill played his mouth organ and we had games which lasted until ten o’clock The priest came in, and he upset things for a few minutes We left the farmhouse and crossed over the snow covered fields and landed into camp\n\n \n\n1918\n\nat 10.30\n","39":"","40":"","41":"\nAs a return for the surprise party we were invited down to the farm at Clapbanck for dinner. Spent a very pleasant evening\n\nEverything in our unit is upset at present our messing arrangment are awful.\n","42":"\nA Good Concert to-night Officers get a \"nib up\" in song regarding the disgraceful messing arrangements in the unit at present\n\nRead of M Englands death in the \"Stirling Observer\" I had visited him only a month ago, when I was home on leave.\n","43":" 16th..\n\nHeavy snow has fallen since the beginning of this year. Terrific Storm of wind and rain last night. \n\nStill working in \"C Ward\" Rumour is about, that we are going to Palestine.\n","44":"\nMarthe and Jeanne of the farm have gone to a boarding school, or what we would call a Convent, at a place near Cassel, called Norpeene.\n","45":"\nWeather these last few days has been ideal. Very mild.\n\n \n\n\"Birdie\" visited the ward to-day No bombardment has been heard lately bar a few Anti-Air craft guns going off occasionaly Expecting to become a C.C.S. again shortly\n\nRead L. Hunt’s \"Essays\" Very entertaining\n\nOur concert party has gone concert-mad and we are having a superfluity of concerts at present\n","46":"\nThe days are lengthening considerably\n\nWe have a superfluity of nurses at present. Work is much easier\n\nIt is remarkable in the wards, if a sister keeps quiet and does her own part of the work and leaves others to do theirs how easily and efficiently the work is done.\n\nThere are rumours in the newspapers that there are serious strikes in Berlin.\n\nPut in for leave to go to Paris Our O.T. is being prepared again in order to be ready as a C.C.S. A muster parade was held to-day in order to see if we all had our full equipment, \"What does it all mean?\" Those men who come into the station with slight sickness or slight wounds, when they get better they are put on doing Kitchen Work in the wards for a week or two.\n\nWhen the time comes for them to leave they are sorry and envy\n\n \n\nthe staff their job. They think that we have an easy job Perhaps we have but somehow I do not think so sometimes.\n","47":"\nIn D.R. working.\n\nWent into the O.T. in the afternoon.\n\nFour slight operations. One man died in going under the Anesthetic. Feeling disgusted. I feel now that O.T. work is going to get on to my nerves. I am looking for a change, for the better. \n\nDiscontinued going to the Farm\n\nRead the story of Sir Galahad\n\nWorking in O.T. a few ops occasionally\n\nDecided to take life more easy.\n","48":"\nIn D.R. Nothing but boils and skin diseases. A splendid illustration in answer to \"Why should one live a clean life\"\n\nThings are very quiet up in the \"line\" Read ‘Pickwick Papers.\" by Dickens It is the finest book I have ever read, and makes one take a more optimistic view of life.\n\nThe Chinese is not such a diminutive individual as I used to think he was. Amongst the Chinese Labourers working here there are some big hulking fellows\n\nHave not been to the farm for some time. They have been inquiring for us\n\nUp before the O.C. for being\n\n \n\nout after lights out. Was admonished The sword of Democles hangs over my head. Ever since D paraded before the O.C. and gave him a piece of his mind we have all had to be very careful. D has been up before the O.C. a few times on paltry offences. Capt Chapman delights in getting people into trouble when he is O.O. By his manner and attitude one would think that a second Napoleon had arrived.\n\nHeartily sick of this kind of life. It is too irregular for me. From what one reads in the newspaper foodstuff must be pretty dear in the home land and also very scarce\n","49":" far we over here in France have not felt the pinch.\n\nThe grounds around the C.C.S. are being greatly improved. Men who have been used to gardening are on the job and they are decorating the corners of the C.C.S. beautifully Grassy turf is being laid down, nice trees and flowers and plants have been put in the ground so that altogether when the summer comes the C.C.S. will look quite an elaborate place. There is no chance of promotion in this unit so I have decided to content myself, do my work, have as much spare time as possible and devote it to the best advantage for Apres la. Guerre.\n","50":"\nWent to St. Omer in a Motor\n\n \n\nAmb. Went to Arques for the C.C.S.\n\nWashed Linen.\n\nThe morning had been frosty but when I left the C.C.S. the frost had turned to rain.\n\nLeaving the S. at one o’clock We got our Linen and went in to the Square at St Omer about three o’clock.\n\nWe spent some time walking the streets and inspecting the shop windows. Looking around for a place to have some refreshments we were unsuccessful, as all the class places were reserved for Officers and the other places were closed until six o’clock. We were ultimately directed to the Church Army Hut where we got a cup of tea and biscuits The town of St Omer is a fair sized place. It is a very ancient seat of learning. The streets are very narrow and the houses look as if they were crushed into one another There are a big number of Women Auxilary Army Corps in or near the town.\n\nThere are also a large number of hospital situated in and around this town.\n\nWe left the town at 4 o’clock It got very cold and had been exceedingly dull all day. As we sped along at a great pace in the M Amb. splashing the mud as we went and the cold air striking our faces one felt that warm clothes would have come in very useful this trip\n\nWe passed through the town of \n\n \n\nHazebrouck at the part where Fritz had shelled for two day. For a wide area the place was terribly smashed about. Heavy stuff must have been sent over for looking at some of the holes made by some of the shells in fields near by they would have made fine big duck ponds in front of a Farm house.\n\nThere was a terrific bombardment this evening.\n\nArrived back in time for late tea at six o’clock\n\nThe evenings just at present are being spent in the reading of Pickwick Papers. W.I. & E.H. and myself have styled ourselves the Clapbauck Pickwick Club We are finding considerable entertainment is this way.\n","51":"\nThe weather has been very good of late. Taking lessons in S-D. Shorthand.\nTook a walk to Estaires W.I. & E.H. We had decided to go for this walk but W.I. taking sick I E.H. and myself had to go ourselves It was like a summers day, to-day. On our way, we noticed flowers beginning to bloom, the trees beginning to bud.\n\nPassing through Doulieu we saw, near the destroyed church door the huge bell which at one time had hung in the belfry of the church before it had been destroyed by the Germans in 1914. It was hung up a little above the ground near the door and \n\n \n\nthere was a notice to the effect that it was to be rung in case of a gas alarum\n\nOn our way from Doulieu to Estaires we noticed little mounds made marking positions for artillery this looked ominous.\n\nNearing the village of Estaires we found newly made trenches, strong posts and elaborate barbed wire entanglement\n\nI had often heard rumours that Fritz was going to make an offensive but these signs which I have just mentioned seem to substantiate the rumour. Another thing that added more evidence was the fact that a light railway had been made only a short time ago.\n\nWhen we reached square of the village of Estaires, we. found a brass band palying there, The children were playing in the street, the elderly people were going about dressed in there Sunday attired. This latter part seemed to take away from us the thought of war and transferred our thoughts to home and the Salvation Army Band playing in the streets.\n\nThe case of an Anti-Air Craft shell fell on the roadway just before we got to the spot. \n\nRead the second part of G.R. Green’s \"Short History of the English People\".\n\nRead of M.C.s death in newspapers Portuguese occupy this part of the line at present.\n\n \n","52":"\nEstaires bombarded. The shells landed right in about the college that our C.C.S. was in about ten month ago.\n\nThe little girls who lived in the house that Capt W. was billeted in, were, one of them killed and the other wounded. Had a run out to Gandesvelte with two patients to a C.C.S. In wending our way up by Mont des Cats, the way that the houses were situated there gave one the impression that it was like Katoomba and going up the Blue Mountains When I got back to the C.C.S. we got word the place had ceased to be a D.R.S. and we are to take on our work as a C.C.S. again.\n\nGreat hub bub in the whole establishment except the O.T.\n","53":"\nOn night duty. A very poor class of surgeon we have here at present\n\nBailleul has been bombarded worst than ever this last week The old spire of the steeple has been knock away. The vibration of the shells as they burst rend the air like thunder A proof that light travels faster than sound is the fact that one sees the smoke, earth and bricks flying high up in the air before we hear the sounds of the explosion.\n\nIt is said that this gun which Fritz is firing into\n\n \n\nBailleul is one of those which he captured from the Russians when he made his smashing offensive against them.\n\nRumours of a British reverse at the Somme\n\nA.F.A. on the move. Capt W & D have gone on operating team duty to Rouen\n\nMajor Mc. made a Lt Col and transferred to No 2 A.G.H.in Boulogne.\n\nD.I. on leave to Paris. Rumour that all leave is now stopped Major B. has taken over the duties of Surgeon Specialist.\n","54":"\nWhile walking along the road from the C.C.S. to Metaren, the thought struck me, was it possible that this road and the neighbouring fields might very soon be a battle field. If rumour be true, and the signs of the times portend anything, I have a strange premonition that a retirement is going to take place. This will mean that this place will be fought over. To-night while on duty in the O.T. I got orders to pack up the O.T. gear for transport the next day. The Sgt who gave me the order told me that Fritz had broken through to Amiens\n\nIt was hard, after all our labour in getting to-gether such a good C.C.S. as this, then to have to break it up. Walking along the road the other day, I could not help but admire the way it was laid out The uncle of M who had a farm near the Bailleul Station was killed\n\n \n\nby a shell which landed near his farm.\n\nA good number of ops have been done these last few day.\n\nFritz seems to have got into his position a remarkably long range gun. It is able to send shells a distance of seventy six miles and by this means they can shell Paris. I am of the opinion that the deciding factor of the great war has begun.\n\nA friend of mine who had visited Estaire yesterday told me that there was scarcely a person in the place. It is a deserted village\n\nNo newspapers of any kind are available at present The rumours that are going about are ominous and make one feel that all is not well with us\n","55":"\nBattle on the Somme still raging\n\nD.I. who has been in Paris on leave, says that the shells which Fritz is sending in to the city are small\n\nOur C.C.S has been ordered back to a place called Hondegheim All the French Boys of this district from the age of sixteen have been called up under their class. Amongst them is their only son L. of the farm people Taking a walk along with E.H. & T.S.. we came across some very pretty scenes of nature As we turned the bends in the \n\n \n\npathway we saw scenes which would have made veritable gems of art. The more that I walk around here the more I enjoy what is to be seen. Little thatched cottages or red tiled farmhouses, with the necessary pond in the meadow surrounded by pollied willows, cows grazing in the fields, ducks swimming in the pond, hedges becoming covered with nice green foliage whilst away in the distance and standing on a slight rise in this flat country are the quaint little windmills or a village with its conspicuous church spire pointing skywards, all these went to form a most delightful memory each memory being changed as the weather changed yet each having a beauty of its own.\n\nHow it would do to live here in peace time I do not know. I would like however to have the opportunity of living here for a short time. \nhowever\n .\n\nThe simple living, industrious, thrifty people with their methodical way of working is very pleasant to see. They are a people of utilitarian nature. Every thing that they can extract out of their land is put to some use in the home.\n","56":"\n\nThe Germans have been held up in their advance. Their objective was the city and railway centre of Amiens. They got to Villiers Bretonneaux, a place about elven miles from Amiens,\n\n \n\nand from which place the famous Cathedral of Amiens can be seen Our new station is situated at a place called Hondeghem, three miles from Hazebrouck.\n\nIn spite of the fact that we have only been a few days in shifting the C.C.S. we have got things pretty well forward\n\nThe walls of the O.T. which were beautiful and white before we removed, are now in a terrible condition with mud. We have spent the day attempting to scrub them down\n\nWe had packed up everything so well that not a thing was broken\n\nWe visited the farm people last Sunday and every one was more or less sad.\n\nI travelled down in the motor transport with a chap who had just come up from the Somme. He gave us some of his experiences. He said that they had been trying to rescue some of their stores and in doing so they were going out of the villages while Fritz was coming in at the other end. He said that he had not had any sleep for a week.\n","57":"\nThe village of Hondegheim is like the rest of the French villages, a few scattered houses with the church in the centre. \n\nWent up to B. to-day. Heard that the Seaforths are up there and desirous of seeing if John is amongst them I got leave along with W.I. to go up to\n\n \n\nB.\n\nWe went up in a Motor Transport which was going up to our old C.C.S. for our gear.\n\nAfter having dinner in our Old C.C.S. a place that is now most disreputable, we made our way to Bailleul. When we entered the town instead of seeing the large crowd of people that we usually saw in this town, their was scarcely a person to be seen. A few M.P.s and a number of reinforcements resting in the square, was about all the people that were there. The town was terrible smashed about, scarcely a whole house standing and the old Belfry which stood in the square stood a mass of ruins with the debris at the foot, and the face of the old clock lying on the top of the debris. A huge shell has also gone through the roof of the large church, smashing all the beautiful stained glass windows\n\nVisited the farm on our way back Missed the last transport, but we were lucky to get on an extra one which took us back to Hondegheim, without having accomplished the quest that we had gone into Bailleul for.\n\nWent to the Cinema in the Village which is run by the YMCA. A very good show indeed\n","58":"\nNo work this afternoon.\n\nWalk to the town of Cassel\n\n \n\nThis town is situated on a hill from which a splendid view of the surrounding country can be had. This town is of a very historical nature. One comes across its name frequently in history\n","59":"\nPainting the O.T.\n","60":" 9th.10th.\nFritz broke through near Laventre and got into Estaires Hand to hand fighting took place in the streets there\n\nA terrific bombardment commenced on the morning of the","61":"\nIn the evening wounded began pouring in, working the whole night long\n\nRumour of terrific fighting in and around Estaires.\n\nBailleul heavily bombarded also Estaires, La Gorgue, Hazebroucke, Outersteen, Meteren.\n\nThe roads are said to be blocked with people flying for their lives, from the towns and villages Everything seems black against us at present, although I must say that I feel confident that we will win through. \n\nThe men whom we left at our old station had to have a rapid exit from that place. They were bombed. The Sgt who was left in charge of these men has been recommended for a M.M, for some work that he had done there during the retreat.\n","62":"\nAfter having operated all the time since the wounded started\n\n \n\nto come in and up to two o’clock this afternoon, we suddenly got orders to pack up as much of our gear as we had time to, and to clear out. We were only to be allowed to have the space of half a Motor Lorry. As with us so with all the other departments, each department was packing up their own gear.\n\nThe Sisters were all sent away without any of their own belongings.\n\nThe O.T. was the first to leave. We had packed up a Lorry to its fullest extent with Dispensary and O.T. stuff and just as we were getting out of the field, the lorry wheel stuck in a rut in the road and owing to the heavy weight on the Lorry we could neither get it backwards or forwards. This blocked the way for everything as the road was so narrow. The Col seeing what had happened came up to us in a towering rage, cursing and swearing as only he could do, but it had not the slightest effect on Bill. D. the driver. He was as stolid as an ox. There was’nt the slightest alteration on the expression on his face, till the Col. went away then he grinned as only Bill could grin, he having enjoyed the whole situation.\n\nWe had to unload half of the gear of the lorry before we could get it to start again. This we were no time in doing, all feeling the necessity of rapid action,\n\n \n\nat this particular moment. Thousands of people of the invaded district were trekking along the road. Some of them were carrying all they now possessed under their arms, others had filled a cart with some gear and were driving slowly along the road. Usually on these carts one saw perched above the gear a number of women, old and young and an old man driving the horse. Some had a sheep attached to the back of the cart. I notice a few cows being dragged along the road by their owners in front of them. The whole scene was terribly pathetic For miles and miles we had great difficulty in getting along the road owing to the refugees who were flying from their homes and who had left practically everything behind.\nThe villages we passed through were crowded with troops who were being pushed rapidly up to stem the terrible onslaught of Fritz\n\nWe heard startling rumours of the rapid strides Fritz was making in his advance.\n\nAfter a long and most awful ride in the Motor Lorry we reached a place called Blendecques. Time & again I thought that we would have been heaved over, so very badly was the road cut up. It was a vertiable miracle how that stolid Bill D. managed to \n\n \n\ndrive us safely to our destination. When we reached Blendecques we found only a paddock with \nand\n a tent there of all our belongings we having been about the first to arrive. We lay under a tarpaulin all night in the field, and we had a rough reception from aeroplane bombs. A few people were killed in St Omer a town a few miles from here.\n","63":"\nGot our O.T. tent and fixed it up ready for emergency.\n","64":"\nChanged all our gear into another tent. Told to be ready to-night for operations. At five o’clock we got our orders to pack up a few instruments and (\nand\n ) operating table to go to a place called Eblingheim to do operating work. The excitement of the previous days had given me a splitting headache, a thing that is becoming a regularity. The officers getting to hear of this prevented me from going and with this I was more than pleased\n","65":"\nThe trekking of the civilian population seems to have dropped to-day.\n","66":"\nVisited St Omer. This ancient and historical city is only 3 or 4 miles from here. Went and saw the Cathedral and also had a walk through the spacious public gardens. Saw the houses on which the bombs dropped the night that we arrived here The roads are very busy, in and around\n\n \n\nhere with French troops travelling in Motor Lorries which are being driven by French Colonials from Northern Africa.\n\nMet people who lived on the next farm to M. These people had to run and leave everything All that they had time to take away with them was feed for their horse. I know that these people had a splendid house of furniture. This district is very hilly. There is a magnificent quarry of white stone near here.\n\nNo sound of any bombardment to-day.\n\nPacked my kit for easy transport. Feeling a bit off colour.\n\nWe have had to fix up the O.T. several times and now we find we have got to take everything out again and transfer it into a hut. We have recovered nearly all the O.T. gear which we had left at Hondegheim.\n\nThe churches in this district are unlike those of the districts we have been in previously, in this respect they are built not of brick but of stone. This gives them a very barelooking appearance.\n\nWe have got quite a nice little C.C.S. here.\n\nThe town of Arques, situated about three miles from here is a very dirty looking place and gives one the idea that it is an industrial centre. The other villages in this district are nice and clean.\n\nWalked round and over the hills, passed the beautiful chateau\n\n \n\nwhich is situated in beautiful gounds on the side of this hill. As we got on to the top of the hill, which turned out to be moorland we came across a monument which had been grossly disfigured by people chiselling their names on it. All that we could make out of it was the Duc de Orleans\n\nPassed the villages of Helfant and Bilques\n","67":"\nSet out on a walk to the village of Lumbies. Got a lift part of the way in an M.T. The country on this way was really pretty and the air was most exhilarating\n","68":"\nHave had a pretty easy time for a few days. D. had to return back from team duty owing to a whitlow breaking out on his finger\n\nAnzac Day, the","69":" of April was celebrated by a service in the forenoon sports in conjunction with no 2 C.C.S. in the afternoon & a Concert in the evening\n\nOn the","70":" We got orders to the effect that we are to be ready to receive. We were busily getting ready when I got ordered to go to Ebblingheim. The Orderly Sgt. W. was told to let the motor Amb know that I was to be taken to Ebblingheim but he forgot to warn the driver with the result that the car went off without me and I had to use \"shanks naiggie\" and go there myself. I had to walk\n\n \n\nnearly the whole distance, about ten miles having only been able to get two short lifts on Motor Lorries.\n\nI reached No 15 C.C.S. in due course. On my way I passed a camp of Chinese labourers. There must have been at least a thousand of them there. They are engaged in digging elaborate trenches. I am told that this is our new third line of defence. The rumour is that Fritz has taken Kemmel, if that be so things look very black for us indeed. After having been on my feet all day I had to work all night in the D.R. at No 15 C.C.S. I had a witlow, strange to say on exactly the same finger as D.I. has his. Rather a co-incidence This became more and more painful. I lay with my finger in boiling water all Saturday and could get no sleep. The pain was most excruciating.\n\nTo crown all our team was ordered back to our own unit to-day. When I reached our unit, which I did in a Motor Amb. I searched for an M.O. Showing to Major B. he opened my finger slightly with a scalpel. This gave me a certain amount of relief and put me out of action for a bit.\n\nTo-day I am spending my time sharpening scalpels.\n\nThe hut for the O.T. has now been fixed up. D.I. has had a pretty rough time working with Major B. who is the \n\n \n\nmost inconsiderate surgeon I have ever come across, and that is saying a great deal.\n\nThe night of the","71":" and","72":" a terrific bombardment took place but seemed to be some distance away. Between the thumping of my finger, the thumping of my head, and the thump, thump, thump, thump of the guns, I was almost driven crazy. The wounded who have been dealt with here are all French troops They had been rushed up from the south into Kemmel Sector and not having hospital accomodation of their own up north here, we had to open up and take them in\n\nTrying to get the conditions of labour altered in the O.T. If we do not get things altered soon I am afraid the strain is becoming to much for us. I am determined to get out of it by hook or by crook.\n","73":"\nHad to get Gas and Oxygen in order to get my finger opened up\n\nFeel very much better, now that, I have got it opened up. Have been put into hospital\n\nHad a letter from John, in which he stated that his batt has been twice mentioned in Dispatches within the last three weeks\n\nVery light cases are being received into the hospital now.\n\n \n","74":"\nWas surprised to have a visit from M. L. & G and their father They had been to Lumbries and walking on there way back and learning where the C.C.S. was they paid us a visit. They had had some awful experiences when the Germans broke through\n\nThey had left their farm the day before the Germens made their advance and had gone to the farm of their aunts, five miles further back from their own farm, at a place called Ecque\n\nThe next day thinking that things were very quiet, they went back to their farm, M.L. G. Father and Emma the servant. When they got to their farm at Clapbauck, things were still so quiet that they were of two minds, whether they should commence the usual work of the farm, or take away some of their cattle.While in this state of mind, a British officer came into their farm and told them that the Germans were only a few hundred yards away. This decided them. Going into the barn and picking out five of their twenty seven cows, they drove over the field as fast. as their legs could carry them. By this time the shells were bursting, the bullets flying and heavy fighting was in progress. A shell burst in between M & G, a huge piece of metal striking M on the foot but luckily \n\n \n\nonly damaged the heel of her boot The shock knocked G and the cow that she was driving to the ground. At length they got out of the reach of the shells and rifle fire and coming to an estaminet they rested outside whilst the father went in to have a glass of beer. After having a rest, they made to move on again and they had not gone many yards when a shell burst right on the spot where they had only a few minutes before rested. It was time for them to hurry on again and making their way as fast as they could they reached their destination safely having been on the way from eight o’clock in the morning, till eight o’clock in the evening\n\nWhen they had gone into their home in the morning they had found it occupied by British Tommies who has been making a right royal feast of it with the food, wine etc which had had to be left owing to the peoples hurried departure.\n\nM. told me that her Grandmother, a woman about eighty, but hardy, even at that age, owing to the terrible experiences which had happen lately, was just on the verge of dying.\n","75":"\nMy finger is healing up beautifully\n\nLarge numbers of French Horse driven transports passed by our C.C.S.\n\n \n","76":"\nThis morning French Cavalry Lancers, etc, passed by our C.C.S. There were so many of them they took hours to pass. \n\nNature is at its best here just at present. The variety of green and olive tints on the trees which surround the white chateau on the hill are lovely indeed.\n","77":"\nVery wet this a.m. D & myself decided to take a long walk up to a place called Bas Shoubrouck the place where the farm people are staying. We had very great difficulty in finding them out. The fields behind the forest of Clairmaris were flooded for miles and miles in case the Germans should attempt to break through further. Making inquiries as to the whereabouts of their place we got directions which took us almost straight across those flooded fields. We were not long in finding out that we had tackled some job. We had to wade through water at times up to our knees. We came to a couple of cottages which were standing still out of the water and on making inquiries there an old man directed us the right route to take. Finally we reached our destination after about a hours paddling in the flooded fields. We spent an hour there and in retracing our steps we were directed the right way which\n\n \n\ndid not take us over these flooded fields but took us along a well beaten footpath.\nWe had walked a distance of twenty Kilos from one o’clock in the afternoon till nine at night; this distance is a long walk in itself apart from having to wade through fields of water. Luckily my boots were water-tight and having my leggings on I did not feel much discomfort in that respect. A terrific bombardment is going on, at the other side of the forest. This bombardment has been going on for two days. The vibration is so severe that one expects every minute to see the glass of the windows break.\n\nThese few days that I have spent in hospital have been the best spell that I have had since joining the Army.\n","78":"\nWent over the hills to a place called Hewingheim. These small villages, situated amongst greens field and surrounded by trees look very pretty when seen from a distance or viewed from an imminence but once one gets close to them they lose their picturesqueness. They are very irregularly built, usually tumbled-down and the roads are bad. The people who occupy these houses as a rule work on the land and one usually finds that people who work on the land as a means of livelihood do not go in for gardening or decorating their homes\n\n \n\nIn factory towns one finds the very opposite. The factory workers find a pleasure in making their house beautiful, and cultivating their garden, growing flowers, and vegetables. This afternoon L.H. D.I. and myself took a walk up the lovely drive to the chataeu, on the hill, called the Chateau L’Hermitage. Every variety of tree seems to be growing here, from the dark olive of the Pine to the bright green of the \nLarch\n Birch, these trees were arrayed in their Spring grandeur. We each had a book from the Padre’s Library and seated there we enjoyed a rest and a read in the sun. Looking down on to the plain beneath we could see the white roads winding their way over green fields. Clouds of dust were rising from these road caused by motor traffic of all descriptions going backwards and forwards carrying stores, munitions, etc to the \"Line\"\n\nDown at the foot of the hill away to the left can be seen little cottages with their nice little garden. These are occupied by the workers of the paper mills and quarries which are the staple industries of the village. Water power seems to be the motive power of these factories.\n\nLooking up into the sky on hearing the sound of buzzing, one could see numerous aeroplanes sailing from the \"Line\" and to the \"Line\".\n","79":"\nD.I. & myself went to Bas. S. We found that the grandmother had died. The family were busily\n\n \n\npacking their boxes expecting to move off again as Fritz is expected to move further forward.\n\nThese French peasants were very methodical. They had one of the long farm wagons with them. Each member of the family had a trunk of their own and they were all so made as to fit into the cart, so that not an inch of pace was lost.\nTo walk backwards and forwards takes us three hours, but by a variety of means we were lucky to get back in one hour & a half. If we had not done it in that time we would have been long after lights out before we would have got back. It would have went hard with me, for I am still in hospital, although my finger is nearly better.\n","80":"\nOn night duty in the O.T. Last night one of the enemy \"planes\" dropped a bomb right on to an ammunition dump The flames of the dump lighted up the skies so much that one could easily read a newspaper This is a very large dump and the one bomb being successful gave Fritz the cue and plane after plane came over and dropped bombs near the same spot. We could see them distinctly as they swooped in near the dump to drop their bombs. We were three miles from the scene of this disaster The crack, crack, crack of the \n\n \n\nexploding ammunition, at first they seemed to be rifle bullets going off, then huge shells seemed to be exploding, that one really thought a huge attack was being made. This lasted for hours and as you can well imagine there was no sleep for us that night.\n","81":"\nWent to church and to communion this morning\n\nW & I went out to view the the scene of the confragation of last night\n\nFrom the village of Blendecques right along the way windows and tiles had been broken by the vibration of last night On reaching the actual scene of the disaster we saw a number of cottages which were standing by the roadside near the dump. They had been practically levelled to the ground.\nLittle bits of clothing were lying scattered here and there. Blood stains were also to be seen. Near the dump there is a Chinese Encampment. On the first explosion caused by a bomb dropping they had cleared out of their camp and taken refuge by the side of a cottage. They had no sooner done so than another bomb dropped right on to them killing and wounding a large number. This accounted for the blood stains and the torn and tattered overalls lying about\n\nIn the field near by there was \n\n \n\nan upturned Allied Aeroplane, how it got there no one can say. All around the dump huge holes had been made by the bombs that were dropped. Luckily a great many had dropped into the fields and had down no damage.\n\nThe tall trees which bordered the side of the road at this part were all stripted and torn of their branches.\n\nAll over the cultivated fields were huge shells in their hundreds. In one field which had been harrowed, there were hundreds of shells which had been thrown by the explosion into all manner of positions One could not help smiling at the manner of them all They were just like an old cemetery with all the headstones lying at all angles.\n\nThis dump occupied a space of about two miles. Luckily only part of it had been distroyed. The part that had been distroyed was nothing but a huge mass of burning or burnt up material, ammunition of all descriptions had been destroyed. The continued explosion of one part of the dump had made a hole in the earth, thirty feet deep and fifty or sixty feet in diameter. It is said that fifty seven lives had been lost at this disaster.\n\nOn our way we saw a motor amb. standing on the roadway.\n\n \n\nIt apparently had got the contents of a bomb for it had a big hole and numerous small ones right through it and the floor was covered with clotted blood.\n\nOn our way back we met a number of small group of Chinese. They apparently had taken fright and ran away from their encampment. All that one could get out of them was \"No Bon\" as they wended dreamily back home following one another in their customary fashion.\n\nWe have not been having much work lately and I notice the Sisters are spending their time picking wild flowers in the neighbouring woods.\n\nHundreds of the troops who are stationed in and around here spend their spare moments swimming in the paper mill pond. The water is pretty dirty owing I have no doubt to the clay bottom being stirred up by so many feet.\n\nIn the evening the Chinese were in retreat making for the woods with their swag on their backs. They formed a very funny procession as they followed one after the other in anything but orderly fashion. A number of our chaps have gone away to dig dug outs for the W.A.C.C.S.\n\nSaw a very pretty village wedding. The bride with the bridegroom, a French soldier, walked through\n\n \n\nstreets of the village, arm in arm, with the friends behind them walking in two’s. This seems to be the custom in the French villages here after a wedding. In St Omer I saw a funeral. At this funeral women were in the majority. The younger women who were at the funeral all wore white veils.\n","82":"\nWent to Bas. S. Was in the room of the refugees. What a contrast to what they once had. This room was only four bare wall, bare floor a huge mattress in the corner of the room on which they all slept at night time. Had dinner with them and spent a few pleasant hours. \n\nOn our way back via St Omer we saw a good deal of the damage done by the air raids on St Omer lately.\n","83":"\n\nHad wandered through the woods and amongst the hills a great deal lately\n\nW & I went into St Omer to day. The market was on There the country people had gathered, just like as at a fair at home, and produce of the farms were being sold. There were also many stalls at which all kinds of wearing apparril and household utensils were being sold.\n\nThe country people drive in with their pony and trap on these market days and they make it\n\n \n\nquite a holiday every week. One can well imagine, these markets in peace time, being a meeting of friends and lively times I have no doubt insue.\n\nWe had dinner in E.F. Canteen A very good dinner was provided there for 1 £ 30\n\nSome English sisters and orderlies were killed in St Omer by the dropping of a bomb on their hospital\n\nHad a walk through the large Cathedral. They are sandbagging many of the parts of the cathedral in case of bombing.\n\nA few of the beautiful stained-glass windows have already been broken the vibrations of bomb explosions\n\nTrain after train of American troops are passing up on the railway which runs passed our C.C.S. A bit of a bombardment on to night From the newspapers we learn that many hospitals at Etaples have been bombed mercilessly \n\nOur officers get the \"wind up\" very easily when a plane comes over at night time\n","84":"\nWe are having a splendid time at present. Sleep all night and free all day. Fritz gives us an occasional visit at night time. So far he has not dropped them right on to us yet.\n","85":"\nWe have had quite a long spell, so much so that we are taking advantage of the easy time in order to learn to play tennis\n\n \n\nThere is a fine concrete tennis court attached to the Chateau on the hill and the Y.M.C.A. having provided us with tennis rackets & balls we spend an hour or so in the morning after our night’s duty.\n\nEducation Classes have been commenced under the direction of the Military. Classes in many different subjects are being conducted. The idea being to keep the men in touch with studies which will help them in Civil life.\n\nThe members of our unit are indulging in a great deal of sport. There is very little work, the weather is ideal for Swimming, Cricket, Tennis. Our camp is very compact. At present there is quite a homely feeling about the place. Padre Dorman has been the means of encouraging and providing the means of sport through the auspices of the Y.M.C.A.\n\nThere was a match between the Officers and the men the other day The day was ideal, the sisters of the C.C.S. took it upon themselves to provide tea and altogether it was a most enjoyabl afternoon.\n\nFrench troops have passed and repassed our station on the march very frequently this month.","86":"\nA shower in the evening made one feel very cool and refreshed the fields and trees considerably\n\n \n\nA very heavy gun is being fired about 10.30 each evening It has a tremendous vibration It sounds like the kind of gun which Fritz used when he was bombarding Bailleul before he made his attacked and entered the town.\n\nThere is much difference of opinion as to whether this is a Fritz gun or our gun which is firing. It is very hard to tell but it may be one of our long distance guns.\n\nTo-day we met two soldiers standing with fixed bayonets at the entrance to the village. This looks as if there is going to be something doing again I have taken particular notice of the French troops that have marched past here and my opinion has been grealy enhanced by the appearance of these men. They are not the puny men we have always been led to believe that they are. They are a fine sturdy race of men and no wonder Fritz has found a formidable foe in them.\n\nA thing that amazes me is the fact that in spite of the cloud which is hanging over their head, that Fritz may break through again, the people work away in their gardens and look after their homes as if nothing is likely to happen. Their homes gardens and fields of grain may be devastated at any moment yet they go on in their work\n\n \n\nin the hope that the cloud may pass over and they will then reap the benefit of their faith.\nThe people of St Omer seem to have left the town. They are mostly Military people who occupy the town.\n\nWe are at present living under ideal conditions\n\nFeeling a little bit sick to-day due to having been inoculated O.T. got their photo taken in gowns.\n","87":"\nWent to Norpeene on cycle along with B. Weather good have got sick. Slight touch of Influenza. This we term the \"Dog’s disease.\" Quite an epidemic has broken out amongst the troops. This disease seems to knock one out completely for three days, making one very week and very miserable\n","88":"\nTwo Operating teams from No 17 B.C.C.S. have been attached here for duty. I met these chaps before when I was on team duty up at Remy Siding so that is was like old pals meeting. The station at Remy has been bombed. We are being kept very busy many wounded are being brought in\n\nThe district around here has been made a very net work of trenches. This place lends itself to fortification and should Fritz endeavour to break through again he is in\n\n \n\nfor a very rough reception. Fritz’s planes have left us quiet at night time for some time\n\nFeeling in a very cantankerous mood just at present. I require a complete change from this work.\n\nThe perculiarity of human life at the present time was brought home to me in rather a forceable manner to-night. We were preparing a patient, whose life was practically hopeless, for a transfusion of blood, but our efforts were in vain, he died.\n\nThe members of another team were called out to a birth In the one case, there was the body of a man, who had, up to the time he was terribly mutilated by a shell, been in the best of health. A man in the prime of manhood. In the other case, the doctor went out to a French lady who gave birth to a baby girl. There was on the one hand life going out of the world and on the other hand life coming in to the world.\n","89":"\nBeing kept very busy. Had twenty four hour shift again. Feeling absolutely fagged out lately.\n\nA great many blood transfusions are being carried out at present with more or less success.\n\nThe donnors of blood are usually chaps who have been brought\n\n \n\ninto the hospital slightly sick or wounded and who have recovered. They are given the opportunity to volunteer to give their blood and when tested if it is suitable they are given a light job about the hospital and when any very serious case from loss of blood is brought into the O.T. these donnors are called upon and blood is extracted from them and infused into the man who is apparently going to die. It is wonderful the reviving effect that this transfusing of blood has on many of these cases who seem almost hopeless. The white pallor of death as come upon many of their faces but a few minutes after they seem to have revived so much I have seen some of them ask for and smoke a cigarette Sometime the improvement only lasts for hours or days but there is no doubt this blood transfusing works wonders, nay miracles in reviving those wounded men who suffer from collapse.\n","90":"\nAnother attack was made by a few of our divisions with a subsequent influx of wounded We were kept going at top speed for a few days but things have now slackened off again Fritz is again paying us nocturnal visits and he is\n\n \n\ngetting a very rough time when he does come over. Our search lights, of which there are fourteen, search the starry heavens from all angles with there rays when Fritz’s planes come over. When they manage to pick him up then there is a terrific noise of A. A. Craft Guns sending shells after shells into his direction until things become too hot, or he drops his bombs, then goes for his life back to his lines again.\n\nWe had half a dozen Germen prisoners brought in and all of them necessitated limbs to be taken off. We are often told that the Germens are hard up for food but if the prisoners which we see are supposed to be specimens of the starving Germens there is not much starvation about them. They are big, healthy, powerful looking men.\n\nWent to St Omer with F.B. C.H. Mac, W.I. and got our photos taken\n\nWe have at present three teams with us. One of the teams which has newly arrived is a travelling O.T. on its own. Lt. Col Fiaschi is the Surgeon. He has a team of four L.Cpl and an Anesthitist. They all work well to-gether and Fiaschi is a good surgeon and turns out some splendid work.\n","91":"\n \n\nH.W. got information to report D.M.S. London. Expects that it is in reply to application for teachers. Education is very much in the eye of the Army at present. The idea is to prepare the men for civil life again.\n\nThe weather is good but very chilly at nights\n\nAmerican troops passed up by here all last night. They, like all troops which are new to this game of war, march very smartly singing and joking as they go. The novelty soon wears off.\n\nAll our cooks have gone down with the Flue. All light duty men in the kitchen \n\nPut in for Paris leave again Things are still pretty quiet here at present.\n\nThe principle sport engaged in by members of the No 1 A.C.C.S. is cricket. Enthusism abounds amongst them No 3 C.C.S. played No 1 yesterday. The former won the game.\n\nWent to Thesoraine yesterday That place is said to be very ancient and historical but it did not strike me very favourably.\n\nLarge numbers of Portuguese are stationed around that part. It is said that they are such poor fighters, and it was at their part of the trenches that Fritz broke through up north, that they have been\n\n \n\ntaken out of the trenches and instead of holding positions, they are now turned into labour corps and are digging reserve trenches well back behind the line.\n","92":"\nWe are having very showery weather at present.\n\nOn night duty in the O.T. Being kept very busy. Three Operating teams with us at present\n\nThe French under Foch have made a big push down South The trains are running up and down the railway much more frequently and rapidly than they have been doing Large numbers of the trains contain American troops Six American Sgts spent a day with our unit getting an insight into C.C.S. work. As we were exceedingly busy, they will have an idea of the kind of work that is before them\n\nVisit by General House and Mr Manifold . M.L.A.\n\nFeeling very dispirited at present Feel that I have shot my bolt in my present job and a change would do me good\n\nA very large number of blood transfusions are being done in the O.T. at present.\n\nThe library of the Army Schools in this district are being increased every day till now we have a splendid Library of Educational Books at our disposal\n\nThese classes are a splendid idea\n\n \n\nOf course it is not everyone who can take advantage of them. Mostly men who are stationed behind the \"Line\" are able to take advantage of these schools.\n\nThese class rooms are in Nisson Huts situated in beautiful grounds, much like the grounds of some lords estate at home. There was a most beautiful scene early this morning just before a terrific thunderstorm I had been working in the O.T. all night and just as the sky was beginning to clear it became very dark again Brilliant flashes of lightening illuminated the darkness. Then away to the west the sky became firy red, words fail me to give expression to the real character of the sky but the scene is one that I will not forget. Then the thunder storm broke loose, then all was darkness. The rain fell, the thunder rolled and the lightening flashed as I had never seen before.\n\nThe noise and flash of the guns during a bombardment at night are awful but of all the guns of the opposing forces had been fired at once they would not have equalled the noise of the forces of nature this morning\n\nOur Col has been awarded the Croix de Guerre by the French Government. I am becoming more and more of the opinion that these medals are like\n\n \n\ngiven away with one’s rations and if you are lucky you get one. They are not given for ability or for work done, for if they were many of those with colours approaching a rainbow on their breast would never have had any such thing there\n\nWe have a number of enthusiastic cricketers in our unit. They spend more time on cricket that at work.\n\nA number of the wounded who have passed through the Palestine Campaign unscathed have been brought in to the C.C.S. severely wounded.\n","93":"\nHad a set to with Major.C. Taken up before the Col, who asked me to make an apology to him for being rude.\n\nTrying to get a proper system into the O.T.\n\nVery good news from the Somme Front\n\nThe road to the West of the C.C.S. has been put out of bounds to us. A fracas between some of our men and some Chinamen had taken place the other night and the thing being reported we were all made to suffer for the misdeeds of a few, as this road was our favourite evening walk.\n","94":"\nGot instructions to go on Leave to Paris with W.I. Left Blendecque at 9.36. a m.\n\n \n\nRather hurried notice this morning Reached Boulogne a 1 o’clock Went to Wimereaux and spent a few hours with a few of the Original unit of No 2 A.G.H. to which we were attached when we left Aust-\n\nLeft Boulogne at 8.30 p.m. for Paris and travelling all night we reached Paris at 7 a.m. After having fixed up the necessary formalities at the Pepinere Barracks and there getting a lecture on avoiding loose women in the streets of Paris of whom the streets of the city abound, we made our way to the hotel D’Iena, a hotel run by the Canadian Y.M.C.A. for the benefit of the troops on leave to Paris.\n\nThe accomodation and food of this hotel was very good indeed\n","95":" After having a hoth bath and a general clean. up, Bill and I walked to the Eiffel Tower, a magnificent, but yet delicate looking steel structure towering up into the Sky 1000 ft. To get to it we had to cross the Pont D’iena, one of the thirty seven bridges which cross the River Seine at Paris. The Eiffel Tower is at present used as an Wireless Telegraph station so that we were not able to get to the top of it and to get the magnificent view which one ought to get from the top of the tower.\n\n \n\nFrom the Eiffel Tower we went to Les Invalides and Tomb of Napoleon. The tomb was closed to the public to-day so that we could only view the magnificent interior from the outside. We crossed the magnificent bridge Alexandre III Other places that we passed were the Petit Palais, the Grand Palais and we also walked along the Champs Elysee a magnificent boulevard which runs from the splendid Arc de Triumphe to the Place de la Concord a huge circle surrounded by beautiful statues on the banks of the Seine. We also landed at the Pillar Vendone and at this place there is the Hostel, \"A corner in Blighty\" which is run by a Mrs Butler who caters for the troops, free of charge, tea and cake. This place is well taken advantage of by British Troops. \n\nIn the evening we went to the English Theatre at which we saw a good play entitled the Molusce which we thoroughly enjoyed\n","96":"\nWe visited the beautiful gardens called the Tuilleries in which is situated the famous Louvre and which is often mentioned in the History of France. We saw Gambetta’s Monument and the Arc de Triumphe de Carrousel also situated in the Tuilleries.From there we went to the oldest church in Paris called\n\n \n\nthe Eglise de St Germaine. As we were looking around this old church, a priest came up to us dressed in all his paraphenalia and a huge bunch of keys hanging by his side. He asked us if we would like to see the Secret Room, the very name made an impression on us and wishing to see the mysteries of this Secret Room we followed the priest up a narrow flight of stairs in pitch darkness until we reached a very small room near the top of the tower of the church. There was nothing particular about this room other than the fact that some of the French Kings in troublous time had come to this place for refuge. Hidden away in a recess was a fine piece of carving which occupied nearly the whole side of the room. This was said to have been made by the monks in of the monasteries. After we had been initiated into the so called mysteries of this secret room the priest handed us a box to put a collection in, for, as he said the upkeep of this place. The whole procedure was gone through in such an abnoxious fashion that we, to say the least of us, were \"knacked.\" B. always up to some tricks pulled out of his pocket a Napoleon two shilling piece which he had got from some shop in his change. He put this coin in the box. To our mind the \"biter was bitten\"\n\n \n\nas this Napoleon piece had been withdrawn from circulation and is of no monetary value now.\n\nWe then went across a bridge and walked along the banks of the river to the magnificent Cathedral of world wide reknown the Notre Dame. Inside the Notre Dame seem to me to be very dark, its darkness being lit up by the small lights of a multitude of candles burning at the various altars. Yet in spite of bareness its vastness filled us with awe. Retracing our steps we walked through a working class district, passed the Hotel de Ville, to the Place de la Republic in which place there is a magnificent statue commemorating the inaugaration of the French Republic. Near this statue is the Hotel Moderne at present occupied by the Army and Navy League for the benefit of the troops visiting, providing accommodation and food. Although this place was very good, still it is not in the class of the Hotel D’Iena in which we stay.\n\nAfter having dinner we were directed to the Grand Roue and taking the \"Tube\" we reached that place. The Grand Roue is a huge wheel on which there are carriages, about half the size of a tram car. Paying our fare we had a trip on this great wheel\n\n \n\nWe thought that we had got into the carriage alone but we had no sooner gone into the carriage than a few girls and a couple of young men, dressed, one in a French soldiers uniform and one in a Belgian Soldiers uniform came into the same carriage. As we mounted higher and higher we got a magnificent view of the city of Paris. These girls who had came into the carriage became exceedingly familiar, and began playing around us. Of course we had been put on our guard, and we soon learned what they were after. They were girls of a loose character, girls of the kind in which \"Gay Paris\" about, girls who have been the ruin of many of our soldiers lives. We soon got rid of them however and after getting of the car, having made the complete circle, we lost the girls in the crowd, luckily for us, for they seemed determined to hang on to us.\n\nMaking our way back to our rooms we passed the splendid building called the Trocadero and the Statue of Washington\n\nIn doing the round of Paris we have depended more in doing a great deal of walking to get us there than on anything else. We have also used the magnificent systems of Tubes which are\n\n \n\nin vogue in Paris, a system which is so simple that we found our way about in them in a short space of time.\n","97":"\nWent with one of the Y.M.C.A. Excursion Parties to the beautiful Palace of Versailles. There was a party of a hundred.\n\nHad dinner in the Hotel De Suisse. We had a good guide with us. He explained everything very minutely.\n\nThe Place is built of \nGranite\n Marble, the walls are simply a mass of beautiful paintings which I am unable to describe. The chapel is a most beautiful place These grounds are wonderfully laid out. The statutory, unfortunately have all been built up, with sand bags for protection from shells and bombs of the enemy, so that we were not able to see what like they are but I fancy they are in accordance with the magnificence of the whole place.\n\nHad a group photo taken in front of the Palace. The Salon de Glace is especially worthy of note This is a huge room with huge mirror all around the walls. It was used as a ballroom and when all the Aristocrasy of France were there in all their ballroom magnificence it must have been a most gorgeous assembly indeed.\n\n \n\nVersailles is twelve miles from Paris. After returning from Versailles we went to the \"Follies Bergeres\" as we had often heard of this music hall from others who had visited Paris previous to us. It turned out to be a low down show where loose women congregate. As you enter the hall there you find small tables with chairs just as in any ordinary café. There the men and girls sit drinking liquor. Passing through to the end one comes to the show proper There, there is a promenade circling the hall and you can walk about and view the play at the same time. The play was in French so that we did not understand much of what was going on but I found great interest in studying the crowded hall. We went into the promenade, and frequently we were accosted by nice looking young women, but with a warning ringing in our ears we were proof against their blandishments. Another side of human life was being shown to us in all its hideousness\n","98":"\nVisited the Madeline, a magnificent Cathedral. Not far from the Madeline is the famous Opera House. The Opera Season not being on we did not see the interior of this splendid\n\n \n\nbuilding\n\nIn the afternoon we went the YMCA River trip. We sailed up the River Siene as far as the junction of the River Marne then we sailed back down again passing under the thirty seven bridges which cross the River near Paris, till we reached a place called St Cloud. We got off the boat at this place and spent an hour or so walking through the grounds after having our photo taken at the Cascades. We then returned back down the river to the landing stage at the Place de la Concord. The people of Paris are on holiday to-day, owing to some religious celebration in the R.C. Church. Some Saint or other I suppose.\n\nWe got a good view of the city from St Cloud which is very high lying.\n\nIn the evening we went with two friends to a Cinema. Just before the Cinema ended the Alert was sounded and the people in the hall arose in one body and went orderly out of the place without any panic. This alert is sounded when an air raid is expected Paris has had quite a number of visits from Fritz bombers. One of the officers, Capt H. belonging to our unit, was wounded by a bomb, while he was on a visit to Paris.\n","99":"\n \n\nGot up early and went to Fountainbleau with YMCA Party. It is situated about forty miles from Paris and it is here that the famous Forest of Fountainbleau is. We spent a very pleasant hour in the quaint town. Had lunch in the Hotel Cadian. Had we not seen the Palace of Versailles we would have considered the Palace of Fountainbleau magnificent Still it was a most beautiful place inside and contained beautiful rooms and beautiful pictures. The Palace dates back before Napoleon’s time but its history is interwoven with the life of Napoleon. It is useless for me even to attempt to describe these places, they have got to be seen in order to be fully appreciated\n\nWe drove through the magnificent Forest of Fountainbleau in a Char-a-banc. The day was pretty hot and the cool drive in the shade of the trees was delightful. We had our Photos taken with the Maid of the Forest. This \"Maid of the Forest\" had a café near the Swinging Rock and she gave us an exhibition of shaking this rock. I could not move the stone but she, being as the saying is \"like the end of a house\" I would much rather have her standing on the top of the huge Swinging Rock than standing on the top of me We returned to Paris at 6.p.m.\n\n \n\nand after having tea and a brush up we went to the Casino de Paris which was a place like the Follies Bergeres but only of a \"higher class\". There we had an insight into Parisien high life or rather fast life. It was surprising to see such pretty young girls there, sitting drinking and accosting any young man that they thought fit. It made me almost sick to see it.\n","100":"\nWent to the Scotch Church. There were not many present. An American preacher took the Service.\n\nMet some friends in the afternoon. After a good deal of indecision we ultimately decided to go to St Cloud. After having tea and spending a very pleasant time there we made to return but had almost missed the last tram back to Paris\n","101":"\n\nMet E and went to the Place de la Republic where I had breakfast at the A & N League Went for a ride in the tram which took me well nigh round the city at a cost of a penny, halfpenny., The journey lasted for over an hour and getting off at the Arc de Triumph I made my way back to the Hotel D’Iena\n\nThis finishes our eight days leave in Paris.\n\nWe packed up our kits and took\n\n \n\nthem to the Gare St Lazare Leaving our kits there we took Taxi to Place de la Republic and had dinner with B.E.E.\n\nWent into one of the R.C. churches to have a look round\n\nMade our way back to the Madeleine.- Bought the photos which we had taken. at Versailles and Fountainbleau We almost missed the train going to Rouen.\n\nAfter a long monotonous journey we reached Rouen about two o’clock in the morning\n","102":"\n\nRain fell in the drizzle. It is the first rain that we have had since we came on our trip. \n\nLeft the receiving camp at seven a.m. and after a long march we reached the Rest Camp. We were paraded after breakfast and told how to get to our various stations.\n\nReports in the newspapers of successes at Bailleul. I expect our C.C.S. is busy now.\n\nWe were like caged birds in this place and slipping out of camp B & I went into the city of Rouen. Met Col D & S.M.M. Spent a pleasant evening strolling about.\n\nOn our way back to camp we passed through No 1 A.G.H. There we met Capt B.\n\nFind the air very relaxing in these parts\n","103":"\n\n \n\nBreakfast 5.45. Dull morning Parade 12.45 to go to troop train. Left in a goods train at 5 pm. and took a very round about course to get to our destination. We touched on a few of the villages that Fritz had smashed up lately. Reached Arques at 3 o’clock in the afternoon And after walking three miles we reached the camp at Blendecques. When we arrived there we found that the C.C.S. had been very busy owing to the stunt being on\n\nRedoubts have been made around the C.C.S. grounds. The hills are simply a \nmass of\n a network of trenches.\n","104":"\n\nTrying to get an outside job.\n","105":"\nOn general duties, outside working with the shovel.\n","106":"\nWorking in the mortuary\n","107":"\nB & I in No 9 the acute surgical ward. Plenty of work there as they are all more or less helpless cases, and some of them are awful.\n\nThere is one advantage in this job, one is certainly kept going all the time, but when one is finished with their days work, they know that they are finished and are free to have a rest.\nIn the O.T. one is never free or really finished.\n\n \n\nWe may be pulled out of bed at any time and have to work exceptionally long hours when required to which was more often than one likes.\n","108":"\nC.C.S. closed down. Removing to Hondegheim, the place from which we made our hurried retreat four months ago.\n","109":"\nPacking gear on to Motor Lorries. Becoming quite experts at rapid removals. Weather very good\n\nAfter we returned from a walk through the village about nine o’clock we got orders to pack up our kits and go down to Hondegheim We did nt like this at all as it mean’t the breaking of our rest, a thing which we really felt inclined for, as removing gear is heavy work.\n\nWe arrived at Hondegheim at midnight and had to sleep on the ground.","110":"\nSent into No 2 ward to help to fix it up.\n\nReceiving.. After working on the ward for an hour I was sent in to shift in the removal of the O.T. from the tent to the Hut. The whole of this removal was done in an hour\n","111":"","112":"\nStretcher Bearing in the D.R.\n\nOn the staff in the D R.\n\n \n\nThe fields are very wet and the station being new, the mud sticking to our boots was something awful. Have had the greatest difficulty in keeping out of the O.T.\n\nWe have been very busy since we opened up here, and what makes things harder for us is the fact that they have not been prepared to receive. I put this down to our O.C. I suppose he is expecting to get another decoration for opening up the C.C.S. in a minimum of time regardless of the staff and other things\n\nWe are situated three miles from Hazebrouck, the place that Fritz endeavoured to reach in his latest push but failed. The large town was pretty badly smashed about. A determined effort was to be made here to keep Fritz from coming past the town. There were trenches in all direction round the outskirts of the town.\n","113":"\nGot a Motor Amb from the Hazebrouck Windmill which took us to Castre. There was not a whole house in the place; a place which a few months ago the people were living quite happily in. The same in Strazeele and all around the district the houses were nothing else but a mass\n\n \n\nof destroyed houses and bricks These places were unrecognisable. I remember when we made our hurried departure from Outerstein as we travelled rapidly through the village streets I saw the civilian people women and children standing at the doors of their houses ( \nlooking\n) anxious and dispirited looking, but little did I think at that time that when I returned back to this village a few months afterwards that I would not be able to recognise the place and that there would not be a civilian left in the place. It is tragic when one thinks of all the misery caused by this War.\n\nFrom Streezele we walked over the devastated country to the village of Fletre which was also unoccupied and badly knocked about.\n\nWe were fortunate in getting a lift back in a Motor Lorry. During the afternoon we could see Bailleul away in the distance nothing else but a mass of ruins, at one time a busy centre of the troops now all but levelled to the ground.\nSaw a few people who had had to leave their home, now returning. What a return. One little French girl as she looked despondingly at her wrecked home. her face lighted up as she remembered the \"Bon times\" that she had when \n\n \n\nthe troops visited their estaminet, but that was when it was situated far behind the \"Line\"\n","114":"\nNot very much work doing in the D.R.\n","115":"\nPacking up the C.C.S. to go to St Venant.\n\nAbout five o’clock in the evening the Orderly Sgt came around and told all 1914 men to parade at the orderly room. On making inquiries of him the why and the wherefore of the parade he told us that all men who had joined up in 1914 were to go on six months furlough. We thought the whole thing a joke, but we soon learned much to our pleasure that it was quite true\n\nNaturally there was a great deal of excitement in the camp. At eight oclock we paraded again with our packs up and mounting a Motor Lorry amid scenes of great excitement amongst those left behind, we sped on our way to Bray sur Somme a distance of 100 Kilometres There were thirty two of us along with all our gear packed into this Motor Lorry so that one can well imagine that there was not too much room to turn.\n\nI never in all my life spent\n\n \n\nsuch a night as this. We had to lie in one position all the time and many were the groans uttered that night in that Motor Lorry as we sped on our way in the darkness. The slightest movement on the part of any one in the lorry was the cause of many a muttered oath and groan. However the men were very good natured, naturally as they had all been over four years away from Australia \n\nFor the greater part of the way all was darkness. The sound of a few motor cars, the outline of the tall trees which line the side of the road from village to village, the glitter of the rain on the cobbled streets, the outline of the darkened houses was all that we could see as we hurriedly passed by. The flash of guns firing away in the east lighted up the sky for a second or two at intervals.\n","116":"\nAs day began to break we entered the destroyed town of Albert. It was nothing more nor less than a mass of bricks and mortor. It was a city of the dead. Not a soul was to be seen in the place. The fields and trees around the town of Albert bore traces of heavy shelling having taken place there. The fields were full\n\n \n\nof shell holes and the trees had been stripped of their branches. Ammunition of all descriptions were lying scattered about. A few stranded Tanks could be seen lying in the fields as if they had stuck there. As it was daylight when we were travelling between Albert and Bray we could see the country very well and it was nothing but desolation all the way. Not a sound was to be heard nothing but bare fields and destruction everywhere. It is about three weeks since Fritz was in this district but now he is at least thirty miles away and he is going back as fast as his legs can carry him.\n\nThe Village of Bray was in ruins and deserted but for a few soldiers billetted in some of the tumble down houses Fritz had been driven out of it by the 3rd Batt A.I.F. The Church of the Village was destroyed. It had been used as a Dressing Station by Fritz I was told a story regarding this church but whether it is true or not I cannot vouch for it.\n\nThis church had the Huge Red Cross painted on the roof ( \nof the chu\n ). A Fritz machine gun crew took up position on the top of the steeple of the church\n\n \n\nand under the cover of the Red Cross were making things a bit hot for our advancing troops. Word was sent back to the Artillery itimating what was happening owing to the Machine gun Crew being in such a good position. A shell was sent right on to the steeple carrying the spire away with it. The crew and the Officer in charge were taken prisoners and afterwards were shot in the square of the village for abusing the privelleges of the Red Cross. We spent our time walking around the village seeing what is to be seen. Ammunition used and unused are lying about in all direction. I notice that there is no furniture lying in these houses. It must have all been taken away\n\nThe bridge across the River Somme had been blown up as the twisted iron of the bridge was lying in the river, whilst a new bridge had been built by the Allies over the place where the destroyed bridge had been The first eight hundred men to leave on furlough to Australia paraded before the Hotel de Ville this afternoon They were addressed by Mr Hughes\n\nNew paybooks have been issued.\n","117":"\nD & I walked along the \n\n \n\nbanks of the River Somme To-day all is quietness and peace, but all had not been peace at one time, as right along the banks of the river were shell holes in large numbers\n\nIn the afternoon we walked out to see the huge gun which had been captured by the Aust. All over the fields there lay ammunition of every description, a few graves of German soldiers with their rifle with the point stuck into the ground and their helmet put on the butt end of the rifle\n\nThe captured gun, the barrel of which lay on the ground was the biggest that I have ever seen. The barrel had been blown off by the Germens before they had retreated To get on to the top and look down into the pit was like looking down into the hold of one of our large ships\n\nAn ordinary railroad led right up to the gun. The shells for this gun are said to weigh a ton and had to be taken up on a narrow railway on specially made trolleys Splendid dug-outs were made here and the site of this gun was hidden amongst a clump of trees. In a radius of a few miles there were five clumps of trees exactly similiar to the one\n\n \n\nin which this gun was hidden. This was a very shrewd idea because by this means the gun would be very difficult to locate. It lay in a direct line to Amiens, at which city it was aimed. If that be the case it must have been able to send shells thirty five miles as it is that distance from here to Amiens.\n\nA parade was held in the evening, and much to our disappointment the A.M.C. & A.F.C. members are to be left behind this trip, owing to there being lack of accommodation on the train & ship.\n\nA few of our number managed to get away and to pick them out we had to draw lots Learning that we will have to wait here a fortnight for the next train, we endeavoured to get leave either to Paris or London but all to no avail.\n","118":"\nThe men who are returning to Aust- paraded on the village square at four a.m. but it was well on to eleven (in the forenoon) before they left to board the train \n\nAs we are to remain here a fortnight, at least, we have been ordered to billet ourselves in a shell shattered house, full of holes and no windows and the debris lying all about as it had been after the fighting. and bombardment\n\nThis we had all to clear away\n\n \n\nbefore we could make it habitable. All being of an optimistic mind at present we set to and cleared up the place and soon we had our quaters as comfortable as we could.\n\nWe fixed up a messroom and also a Kitchen and fossicking about some of the other houses we managed to get a few tables and chair and other luxuries.\n","119":"\nDuring the night a terrific storm arose. The thunder rolled, the lightning flashed. and the rain fell in torrents and to crown all the wind blew a hurricane blowing right in through the huge shell holes and paneless windows on to where we were lying. Getting up out of our blankets we fixed a few of them over the holes & windows to prevent the rain from coming in. You can well imagine what our feelings were like standing there with only our shirts on, hammering nails through the blankets on to the brick walls. and the wind and rain blowing in on us. Luckily the storm did not last too long for by the time that we had finished struggling to get the blankets fixed up the storm had subsided but not before it had driven some of the men out of their comfortable blankets to look for shelter somewhere else, and a stream of water occupied one part of \n\n \n\nour room\n\nWe are doing about half an hours fatigue work in the morning and then we are free for the day.Late in the afternoon a large number of troops entered the village. At first one thought that they had come to form the next train load but we learned from them that they were going up to re-inforce the battalions. They were soldiers who had been down at the Base Hospital sick or wounded and had recovered and were going back to the \"Line\" again They looked a fine set of men.\n\nGermen notices are fixed up on houses all over the village and this points to the place being held and occupied by the Germens. These names have now been scored out and notices printed in English have taken their place.\n\nMany graves are to be seen around here in the fields. They are mostly individual graves The French peoples graveyard has suffered badly in these troublous time. Walking through the graveyard one found beautiful headstones totally destroyed and the graves opened up by the explosion of shells. Even the dead have been disturbed in their resting places in time of war.\n\nTo-night is quiet and peaceful the quiet only being broken \n\n \n\nby the \nquietness\n voices of the men coming from the dim candle-lighted billets. Occasionally one can here the strains of a popular air being played on a mouth organ and involantarily the chorus of the homely ballad is taken up by the men near by, creating within them visions of loved ones, visions of friends one has met, places that have been visited, incidents ( \nof things\n ) that have happened in our experience pass before our minds eye, creating feelings of sadness and of joy.\n","120":"\nD & I walked out to see the big gun again. Over the shell strewn, shell torn field there was a veritable paradise for souvenir-hunters, Exploded and unexploded shells of all sizes, Ammunition of all kinds, Germen rifles, Germen soldiers equipment, Machine guns, clothing were scattered all over the fields for miles around.\nThe grave of one Fritz was there marked by a mound of newly turned -up earth, his rifle lying on the mound and his helmet at the head of the mound may no mistake of what that part of the sod contained. Some mothers son lies there, know or unknown. It is said that comparatively little fighting took place here. The village lies in a valley, the valley of the Somme\n\n \n\n \n\nand I am told that the place was surrounded by our troops taking possession of the surrounding hills, and thus hemming the place in compelled the Germens to give in. About a dozen trucks were lying on the railway, mere skeletons of there former selves, the wood work having been destroyed by fire.\n\nIn the afternoon we Lorry-Hopped to the now historical town of Albert. As I said in my former note the town is a mere mass of bricks and mortar. The famous cathedral was unrecognisable, the much talked of Bronze Statue was not there. Only a few of members of the Labour Corps were in town clearing the roadways of debris and a few traffic directors to direct the traffic. On our return we had to walk a good part of the way but ultimately we boarded a light Motor Car and we sped rapidly back to town.\n","121":"\nAfter the formal parade to-day, D, J, I decided to try for Peronne.\n\nWe walked out by the destructed town of Cappy, passing on our way a huge aerodrome. There were a good number of troops in Cappy but no civilians. Our luck was out as far a Lorry-Hopping is concerned as all the lorries were travelling in the oppostite direction to the way\n\n \n\nthat we were going. We had a pretty stiff climb up on to the moorlands. Destruction was to be seen all along the way, remains of ammunition, and equipment, the trees were stript of their branches and foliage, but one thing remained and that was the beautiful mountain air.\n\nAfter we passed Herbecourt we were fortunate in getting a lift on a Motor Lorry which took us to Peronne.\n\nFour bridges that had been destroyed by the Germens in their retreat were being rapidly rebuilt by our engineers\n\nThere were large numbers of troops employed here clearing the roads and making them fit for traffic\n\nAfter having general look round the town, which we found like the rest of towns we had seen lately, nothing but a mass of bricks and mortar we retraced our steps back to the tumble down hut of the Y.M.C.A. and there had a cup of tea and biscuits. The hut was crowded with troops, a thing one meets with wherever a YMCA Hut is, thus going to prove, once again, the value of these places to the troops\n\nOn our way to the hut we passed the No 12 C C S and No 53 C.C.S. and I noticed on the railway an Ambulance train this proving that the railway is clear up to Peronne\n\n \n\nAfter having refreshment we made our way back to Bray. We had to walk nearly all the way until we got to Cappy. There we were lucky to get a lift the remaining three miles of our journey We must have covered a distance on foot of over twenty miles to-day.\n","122":"\nWandered along by the banks of the River Somme. There is a great deal of Marsh land in the valley. In the middle of this marsh land we came across an aeroplane which had had an accident and had been badly smashed in its fall.\n\nWalking along by the foot of the hills we came across numerous dug-outs made by Fritz. They were splendid places and to all appearance had been made for a longer stay than he had been allowed to make. They had a fair-sized hut built with wood on the side of the hill, then the dug out proper was dug into the hill, and these dug-outs were very big and lined throughout with wood. The conclusion that I came to was that Fritz occupied the front position of the dug-out when things were quiet, but when the shelling was on he got into the earth till the shelling ceased.\n\nWhen we had a look through\n\n \n\nthe houses in the village we found them practically devoid of furniture but when we entered these dug-outs we found beautiful mirrors and furniture which to all appearances had been transferred out there from the village by the occupants of the dug out, so that they must have been quite flash places when they are occupied.\n\nA number of the chaps with whom I came out on the SS Kyalla and belonging to my original unit No 2 Australian General Hospital have landed up here to go on furlough with the next lot to Australia.\n\n"}}