{"Document Name":{"0":"Diary_0058","1":"Diary_0058","2":"Diary_0058","3":"Diary_0058","4":"Diary_0058","5":"Diary_0058","6":"Diary_0058","7":"Diary_0058","8":"Diary_0058","9":"Diary_0058","10":"Diary_0058","11":"Diary_0058","12":"Diary_0058","13":"Diary_0058","14":"Diary_0058","15":"Diary_0058","16":"Diary_0058","17":"Diary_0058","18":"Diary_0058","19":"Diary_0058","20":"Diary_0058","21":"Diary_0058","22":"Diary_0058","23":"Diary_0058","24":"Diary_0058","25":"Diary_0058","26":"Diary_0058","27":"Diary_0058","28":"Diary_0058","29":"Diary_0058","30":"Diary_0058","31":"Diary_0058","32":"Diary_0058","33":"Diary_0058","34":"Diary_0058","35":"Diary_0058","36":"Diary_0058","37":"Diary_0058","38":"Diary_0058","39":"Diary_0058","40":"Diary_0058","41":"Diary_0058","42":"Diary_0058","43":"Diary_0058","44":"Diary_0058","45":"Diary_0058","46":"Diary_0058","47":"Diary_0058","48":"Diary_0058","49":"Diary_0058","50":"Diary_0058","51":"Diary_0058","52":"Diary_0058","53":"Diary_0058","54":"Diary_0058","55":"Diary_0058","56":"Diary_0058","57":"Diary_0058","58":"Diary_0058","59":"Diary_0058","60":"Diary_0058","61":"Diary_0058","62":"Diary_0058","63":"Diary_0058","64":"Diary_0058","65":"Diary_0058","66":"Diary_0058"},"Date":{"0":"unknown","1":1381.0,"2":1382.0,"3":1383.0,"4":1384.0,"5":1385.0,"6":1386.0,"7":1387.0,"8":1388.0,"9":1389.0,"10":1390.0,"11":1391.0,"12":1392.0,"13":1393.0,"14":1395.0,"15":1396.0,"16":1397.0,"17":1398.0,"18":1399.0,"19":1400.0,"20":1401.0,"21":1402.0,"22":1403.0,"23":1404.0,"24":1408.0,"25":1409.0,"26":1411.0,"27":1412.0,"28":1413.0,"29":1414.0,"30":1416.0,"31":1418.0,"32":1419.0,"33":1425.0,"34":1426.0,"35":1427.0,"36":1428.0,"37":1429.0,"38":1430.0,"39":1433.0,"40":1436.0,"41":1441.0,"42":1444.0,"43":1445.0,"44":1446.0,"45":1447.0,"46":1448.0,"47":1449.0,"48":1450.0,"49":1451.0,"50":1452.0,"51":1453.0,"52":1454.0,"53":1455.0,"54":1463.0,"55":1464.0,"56":1465.0,"57":1466.0,"58":1467.0,"59":1471.0,"60":1472.0,"61":1474.0,"62":1477.0,"63":1478.0,"64":1481.0,"65":1482.0,"66":1488.0},"Entry":{"0":"\n\nSteenvoorde ","1":"\n\nI left London by the 7.50 am train on 16.9.17. Arrived at Folkestone about 10 a.m. Had a long walk on the grand promenade along the sea front from where the coast of France was visible. Left Folkestone on board the Princess Victoria at 2.50 p.m. and reached Bologne about 4.50 pm. Had dinner at the Hotel\n\nMetropole. had a short sleep and went down to the station to catch the 12.50 night train but could not get aboard; no room so got on board the 3.40 train for North.\n\nReached Arques this morning about 6 am \nand boarded\n got on a motor lorry which carried me as far as Wardreque where I got on another lorry which dropped \n\nme at Ebblingheim station. I walked on a little way and caught the Battalion, reported to the Adjutant who informed me that they were just on the move northwards told me their destination and advised me to catch a lorry. I proceed there at once; which I gladly did as I was not in the humour for walking farther.\n\nhaving only my light boots on \nand having had no sleep for hardly for two nights\n and feeling a bit done up with my journey (which was almost continuous) from Waterloo Station London. We have a new commanding officer, Lt-Col Street of the 8th Inf. Bde. \n\nReninghelst 18.9.17\n\nWe left \nthe\n our Steenvoorde area today at 7.45 am and crossed over\n\nthe \n Belgian border\n at 9.48 am. After a pretty long tramp we reached our camp consisting of scattered tents and waterproof shelters, about 2 p.m! near the village of Reninghelst. \n\nBelgium 19.8.17\n\nBeautiful weather. Planes both ours and Fritz’s very active. Under two hours notice to move forward any time. \n\nBelgium 20.9.17\n\nThe 1st and 2nd Aust. Div. attacked this morning at 5.30 am. Our brigade ordered to be in readiness to move but 2 hours notice. at 12 pm. word was received by aeroplane that attack progressing favourably. 1st and 2nd \nDiv\n objectives gained with slight losses. At 2 p.m. word received 1st and \nD\n 2nd Div’s. proceeding towards 3rd objective. \n\nWe are still standing to expecting to move. \n\nBelgium .9.17\n\n1st Anzac Corps gained their 3rd objective at 3.30 pm. yesterday afternoon. Nearly 2000 pris. and many machine guns. The occupants of two of our balloons jumped out yesterday. They were attacked by fritz aeroplanes. The balloons were not damaged and went up again soon after being pulled down. The weather is very good. The","2":" Anzac Corps have beaten off several \n\ncounter attacks so far. Our casualties very light. \n\nBelgium","3":"\n\nWe left camp just this side of Abeele last night about 7pm and after a long tramp reached our bivouac position near Dickiebusch about 10 pm. We occupied dugouts during the night and I awoke this morning quite convinced that a game of football before a long march must\n\nhave disastrous effects on \nthe on\n one’s muscles shortly afterwards. The weather is still fine though inclined to be cloudy. Last night we saw a grand display of search lights. An enemy plane came over and our lights managed to get him where the lights intersected and he showed up beautifully. Tracer bullets and \n\narches could be seen tearing after him \nlif\n like sparks This is the first time most of us have seen such a display yet I suppose the sight is common enough to Londoners. Such are the vagaries of war. The Bosch plane was driven off but returned and dropped several heavy bombs which evidently struck a shell dump as \n\na big red blaze sprang up immediately afterwards and ammunition could be heard exploding for some time. This morning I went over to the 2nd Bn. transport lines and saw a few of the old faces once more. Very few now remain. Every stunt seems to cut down the remnant \ngradually\n. We are waiting for orders to move up. Waiting is the worst part of the job. \n\n \n","4":" Hooge Reserve Trenches\n\nWe relieved the","5":" A.I. Battalion last night at 10 pm. Our guns opened up a terrific fire shortly afterwards, but I could not ascertain the cause of their angry outburst. Early this morning our guns again opened up a heavy fire for nearly four hours. The weather is ideal just now. Aeroplanes by the score without any exaggeration are \n\nswirling round like large hornets. Once this morning a flight of Bosch planes came over and shot down one of our planes. The ground for miles round here is torn up badly by shellfire. At one time a fine wood and the town of Hooge existed here but not a vestige of the village remains and only a few dead stumps can be seen to mark the one time wood. Timber lies every where. \n\nWe are therefore anticipating plenty of good fires for the winter. \n\nChateau Wood. ","6":" 4pm\n\nWonderful sights seen in the air. Fleets of aeroplanes, banking climbing, doing spinning nose dives and various other antics.\n\nFlies are very plentiful. Big sleek blue chaps. So pretty, frightfully pretty. \n\nChateau Wood Mon. 24th \n\nThis morning two of our\n\nmen came along to see the doctor feeling very bad. It appears Fritz planted a few mustard gas shells along side them with the result that this morning their lungs and every part of their body which the gas came in contact with was extremely sore like a chafe. One of the poor chaps could hardly walk and complained of having very \nbad\n sore lungs. Both men had been very sick \n\nThis afternoon I went up a little further with the I.O. and a small party of men to look over the new position we are taking over tonight. We lost our way slightly and had an exciting run over shell holes to avoid the shells hurled at us by the thoughtful Fritz. Noone was injured though and we reached our position safely.\n\n11.35pm","7":"\n\nGlencorse Wood\n\nWe relieved the 55th Bn from this position last night. Our relief effected with few casualties about 11 A.M. Soon afterwards the enemy opened up a terrific barrage of large calibre H.E. shells and caused a good deal of damage to transport and moving troops. Our H.qrs. consists of a pill box formerly an enemy concrete strong point shell after shell fell on the roof and all\n\nround it but did no damage until one burst in front of an opening near which my Signal Sergt. (Sergt. Reynolds) myself and several others were attending to the maze of telephone lines. The burst came inwards and killed the Sergt. and several others with concussion. Lights were blown out by concussion also and for a space pandemonium reigned. \n\nWe had had a gas alarm previous to this so that by the time the shell burst and left us in darkness \nand\n smoke and dust everybody had the “wind up” pretty badly. All night and all day today the enemy has shelled our pill box incessantly \nand\n with the result that all heads are aching a treat but otherwise OK. A more hellish time I have never experienced. \n\n10 AM Wed. 26 10.10 AM\n\nOur Division attacked this morning at day break after a heavy bombardment by our heavy guns, field guns and Machine guns. First objective gained 7\/45 AM attack is still progressing favourably. Our casualties fairly heavy up to date. Many prisoners coming in, helping our wounded along. A number of tanks participated in the attack. The pitiful part of these attacks is that many badly wounded men are unable to \nbe\n get back and receive proper comfort and attention. It makes one \n\nheartsick to hear the poor chaps moaning and crying for the help which cannot be given. This is the crowning horror of war I think. Two more of my signallers taken a message to Cable Head trying to repair the break \nof\n in the telephone line. I brought 7 ","8":"\n signallers in with me including the Sgt. who unfortunately was killed. My Signal Cpl. who was back at the transport camp on hearing of this, came up at once \n\nand has done valuable work and set a splendid example also. All the men have been working bravely through heavy barrages to try and maintain telephone communication. Our runners have been having a very hard time also and have gone on many long errands through terrific fire and delivered their despatches safely. Fortunately no casualties amongst the runners up to date. \n","9":" Signaller Wheen \n\nand two runners slightly wounded yesterday afternoon and were sent out. \n\nThe attack all along very successful. All objectives gained and held. Shelling terrific up to about 12 \npm\n midnight last night. One machine (enemy) brought down close by, by machine gun fire and two near the front line. Gun fire on both sides practically ceased by 4 AM this morning.\n\nA number of dead men were buried during this lull and wounded taken back. Rations etc. sent up to the front line companies and a clearing up generally. During the last 48 hours runners signallers and stretcher bearers have had a trying time. Communication has only been possible by runners during the heavy shelling and signallers have \n\n had to do running to assist the Bn. Runners. \n\n6.50 p.m. A heavy barrage has been opened by our guns on the left and partly on our front. Enemy retaliating strongly. Our telephone communication gone fut again. \n","10":" p.m. ","11":"\n\nAll had a peaceful night last night. R. Sergt. Major Bramhall (my old friend\n\nof Gallipoli days) kept most of us awake \nhis\n very much interested and laughing at his \nvery\n dry wit. He was in that delightful mood when his tongue cannot stop wagging and said the most delightfully comical things. I remember on Gallipoli \nwhe\n after doing my shift on post and feeling very tired rather\n\nthan go to sleep I would sit on the first step and listen to Bram’s stories of life in India. He is a born humorist. This morning started off beautifully again. Clear sky and bonser old sunrise. It is absolute rot that such days should be wasted \nin\n on war especially such a war as this one.\n","12":" Half Way House \n\nOur Bn came back here last night. The fight which was very successful along the front attacked is now over for us, for a little while at any rate. The poor chaps were dead beat but turned in wherever they could find cover without a murmur. Fritz shelled this camp heavily during the night and wounded a couple of our men. We are in amongst a big\n\ngroup\ns\n of “heavies” and when they open up, which they do every evening, there is a great row. Several of my signallers and runners have been sent back to the Transport Camp as there is really not enough work for them here \nand\n so they might as well get away from shells and have a good rest as soon as possible as we are moving out tomorrow. The 5th Aust. Division is being\n\n \n\nrelieved by some English Division. The weather is still good so the attack will probably be carried on, on this front until the whole of the Flanders Ridge is captured. Our Brigade have captured and are holding what is known as the Butte a small hill strongly fortified by the Germans. \n\nThis Half Way House mentioned above is a large underground\n\ndugout with corridors, bunks and electric lights. It is very wet though as \nthe\n it is difficult to dig any where in Flanders very far without coming to water. The fact that we are on a fairly big ridge probably accounts for being able to dig at all. The trouble is overcome by duck boards and continuous pumping.\n","13":"\n\nAnother glorious day\ns\n. We are now in the season of cold moonlight nights \nof\n and sunny days. \n\nThis spot is an extremely busy one and interesting too at times. Last night \nthe\n it seemed as if the deamons of hell had been let loose for miles. All our guns opened up just about dusk and lit the sky like a fire works display. One would almost think that a large city existed somewhere\n\nup at the front by the glare of lights caused by the shells bursting. This is one of the main arteries of the \nattack\n present battle front. Lorries, guns, heavy and field lines of mules galloping to and from the guns with or for ammunition tanks, some damaged by shell fire with their noses pushed up against a bank and giving one the impression of a glorified tortoise asleep. \n\nwagons antiaircraft guns with their \nnervous crews\n. Wireless aerials, troops, regimental cookhouses, smoking, betokening a hot meal for somebody, and above it all the hum of many aeroplanes tearing through a blue clear sky. \n","14":" Pioneer Camp\n\nWe left Half Way House yesterday evening at 5.30 and reached here about 10 p.m. The scene when we arrived\n\nwas one which I shall never forget. Men tearing around with mail and cursing because they were not allowed to strike matches to read them. Others looking for pals. The fervent handshake and expressions of comradeship on finding their pals safe and sound and the equally fervently expressed oaths on learning that Bill so-and-so \n\nhas gone under or is badly wounded. Energetic NCOs were calling out names (for mail) which never answered and never will answer again. And the roar of the guns to remind us \nwhy\n these fine chaps will never answer again. My section is a sad one just now. The death of Sgt. Reynolds is felt by all. He was the big brother in \nthe\n\nthis little band of heroes. Always cheerful and imparted a feeling of confidence to the remainder. This is all part of the tragedy of war and how much worse must it be for those at home. \n","15":"\n\nWe moved from Pioneer Camp this morning and arrived here at \nReninghst\n Reninghelst staging camp about 11 a.m. Just outside the camp\n\nwe were met by our late and very popular old C.O. Col. Midgely. \n\nReninghelst Staging Camp. ","16":"\n\nThe","17":" 2nd and","18":" Aust Div \nha\n together with one N. Zealand Division and a English troops from 24 different countries have taken the great Paschendaele Ridge and are hanging on to it. If they succeed in holding it, it will be the greatest\n\n \n\nvictory since the beginning of the war for the British Army. Winter having made its first appearance in the shape of a very cold atmosphere and stinging showers it is unlikely that the enemy will make any successful attempts against us in our newly won positions. \n\nCornwall Camp. Reninghelst. ","19":" \n\nWe marched from the Staging Camp this morning. Our \n\nnew camp is an ideal one compared to what we have had during the last month. Here we have plenty of accommodation for the men without having to crowd a big number into a small space. Also it is very clean and well laid out. \n\nThe weather is cloudy with a very \nclo\n strong cold westerly blowing. \n\nCornwall Camp.","20":"\n\n2nd Aust. Div. made another push on the","21":" with some English and \n\nNew Zealand troops on either flanks. Our chaps are nearly always given the centre of any attack in which they take part, and always carry out their job successfully. Practically \nof\n all of the great Paschendael Ridge is in British possession now and the enemy has to defend himself in low country for the most part. It is thought that he will have to evacuate many miles of territory as a result\n\nof the recent British successes.\n\nCornwall Camp","22":"\n\n3rd and","23":" Aust Divs. attacked again this morning. Reached their first objective (Red Line) early and reported to be advancing rapidly towards final objective Blue Line. \n\nWesthoek Ridge.\n\nNight of","24":" enemy fired considerable number of \ngas\n Mustard Gas Shells and large calibre\n\n \n\nHigh Explosive. \n\nHostile shelling fairly heavy each day about 12 p.m to 4 p.m. otherwise quiet during daylight. Night of","25":" many gas shells and H.E. fired causing a number of casualties amongst our men on working parties. \n\nWeather has been fine and ground drying up rapidly. \n\nH.qrs \nNoordhemhoek\n Broodsiende\n\nWe relieved the 59th Aust. Bn. on night of\n","26":" A very quiet relief. \n\nWe sustained no casualties and the relief was completed early with out a hitch. Ground in a very bad state. Fortunately practically no hostile shelling on our sector during \nnight\n relief. Enemy very active with his artillery later on in night which gradually eased off towards daylight. Enemy machine guns sniping during night. \n\nNoordhemhoek\n Broodsiende","27":"\n\nFine day. Enemy planes very low and active during early hours of morning. Our guns silenced an enemy gun and blew up an ammun. dump in direction of Moorselede.\n","28":"\n\nOur guns fired heavily in direction of town of Passchendaele on left last night. Enemy opened barrage on our lines shattering front line system for a short distance.\n\nWe sustained no casualties by some miracle. Many gas shells fired by enemy on our support lines. This gas affects the men much in the same way as pepper would when breathed into the lungs through the nostrils. The ultimate effect of gas unknown as yet. Probably delayed action similar to Mustard Gas experienced by us on Westhoek Ridge. Several men have so \n\nfar reported to R.A.P. suffering from very sore eyes as a result of gas shelling. \n","29":"\n\nEnemy shelling fairly heavy during night. One of our nation caught in barrage. Seven casualties from one shell. Men suffering from delayed action of gas running the casualty list up steadily. \n\nEnemy planes very active again this morning early over our lines. Several duels observed. Our\n\n \n\nBattle Planes brought two of enemy planes down in direction of Moorslede. None of ours down. Enemy damaged \ntoni\n during night with Minenwerfers.\n","30":"\n\nThe","31":" Aust. Bn. relieved our Battalion last night. We left the front line under a hail of machine gun fire and 5.9 H.E. shells – a farewell from Fritz the like of which I have never before experienced. \n\nThe long tramp out through mud and slush with High Explosive shells dogging us was enough to turn the darkest and stoutest hair grey in one act. We reached Zonnebeke camp had a feed and went to sleep. We came on here to Dickebusch Camp today and had a good clean up. Nearly every body suffering from husky throat or cough due to \na\n combined action of gas and cold.\n\nNear Abeele. ","32":"\n\nWe reached here yesterday from Dickiebusch. All the men in good billets for once though scattered. Ground is in a bad state. Raining nearly all day.\n","33":"\n\nNews of great Austro-German victory on Isonzo front. 100,000 prisoners and 200 guns captured from the Italians. Gen Cadorna accuses portion of the Italian Army on the front \n\nattacked, of cowardice. Italians have counter attacked and taken 6000 prisoners and many guns. \n\nAl\n Aneluy","34":"\n\nI left Poperinghe on ","35":" of this month and after a tedious train journey arrived at Romescamp on the","36":" about 6 a.m. Walked out to Aumale a very large town about 8 kilos distant stayed for a couple of hours and returned to Romescamp.\n\nLeft Romescamp by the 7.27 p.m. train on","37":" and arrived at Albert about 11 p.m. Stayed in Albert for remainder of last night and came on again this morning to the","38":" Anzac Corps Sig. School where I am now comfortably installed. Since leaving Poperinghe we passed through Calais, Bologne Etapeés Romescamp Amiens and Albert \n\n \n\nand finally Aneluy from which town our school is situated about one mile.\n\nAneluy","39":"\n\nWithin the last week disaster has befallen the Italians. The Germano Austrian Armies having penetrated Italian territory on the Isonzo front for over 30 miles and forced the Italians back on a front of 100 miles. The Italians are trying to hold \n\nout on the Tagliamento River, but the enemy patrols have crossed this river and it seems likely that the Italians will have to retire still further. Italy has called for assistance from her Allies to which France and England have already responded. The Canadians have captured the town of Paschendaele, thus completing the capture of the Flanders Ridge.\n\n \n\nRoulers Bruges and many more towns are now within our view and the enemy has no vantage point for long distance observation on this front. \n","40":"\n\nA supreme War council for the Allies has been formed to control\nl\n and direct operations from the Western Extremity of the British Front to the Eastern extremity of the Italian front \n\nconsisting of Sir Henry Wilson for Britain Gen. Foch for France and Gen. Cadorna for Italy. Great unity between the Allies is now to be had. General Allenby has achieved a great victory in Palestine capturing 40 guns and many prisoners. The whole Turkish Army is in Retreat towards Jerusalem. The British are 7 miles beyond \nGaza\n Gaza. \n\nReceived a copy of\n\nArthur’s book entitled ‘Gabor’s Euchure and other stories’.\n","41":"\n\nThe bombing school broke up a few days and although the weather was sloppy sports were carried out on the football ground. An excellent imitation of a tank was got up on which were written - Raiding parties catered for – Barbed wire crushed by the will Beat it guy, and many other little puns. \n\n \n\nThe officer i\/c of this school had always impressed on the officers the necessity of ‘A Roving Eye’. So on the other side of the tank a large eye was painted and the tank\ns\n was then christened the roving eye.\n\nI came to the 56th CCS. A few days ago suffering from eczema. Am receiving every attention from nurses and orderlies. \n\nHospital","42":"\n\nThe British have made another attack on the\n\nright of Bullecourt down here in the Somme area. No details of a reliable nature yet to hand. Today, being no better I had a little blue ticket pinned on to my bed which I found out meant that the patient in that bed had to be evacuated to the base hospital. Everybody is packed up ready to move, at least all those who have a blue ticket on their bed. \n\nWe have been well looked after in here. Nearly all the work which should be done by nurses here is done by orderlies and they certainly do it very creditably indeed. I am what is known as a sitting patient and have only half a blue ticket on my bed. Lying patients have a whole ticket. We were given a very good concert by some of the RAMC boys the other night. The “lady” of the troupe looked ‘Bon’.\n\n23rd ","43":" General Hosp.\n\nThe British attacked on a 40 mile front from St Quentin to the left of Bullecourt on the morning of the","44":" and up till the","45":" had captured over 6000 prisoners. The Cavalry, tanks and infantry have done wonderful work and the heavy guns have been pushed up with the infantry. The attack was a complete surprise to the enemy who seem to have been thoroughly disorganised. \n\nSo far the attacking troops have had practically no artillery up against them. No preliminary bombardment preceded the attack which helped to allay the enemy’s suspicion. A whole brigade staff of Huns were captured in their pyjamas. \n\n20th S.H. ","46":"\n\nI dined alone in state last night in the ward after an uneventful day. After dinner I went to a \n\nconcert given by some of the hospital staff.\n","47":" S. Hosp. ","48":"\n\nI went to a concert last night in the YMCA given by the M Gun Coy. They had a very good orchestra and the items were rendered for the most part by professional actors. The weather is very windy and cold. I am sharing my ward with two very nice English chaps. \n \n","49":" Gen. Hospital","50":"\n\nThis afternoon I visited the C.O. of the Hospital and he asked me if I felt fit to return to my unit. I told me I did not. He then examined my left ankle and promptly marked me for a board at my Divisional Base. He \nwas\n is a thorough gentleman and very reasonable and considerable to any patient. I am to leave here tomorrow. \nand\n I leave behind me good companions I have received every comfort from the Sister in charge \n\nof the ward. \n\nHarfleur Camp ","51":"\n\nI was driven to the Hd.Qrs. Details Camps’ Office Etaples by one of the \nEl\n English girls Aut. drivers on the","52":" where I was informed that I would be in charge of a draft of men (from hospital) \nto\n during the train journey from Etaples to Harfleur. My train did not leave until 6.30 p.m. or so, so I stayed in the officers mess and listened to two old soldiers exchange reminences\n\nIt was warm and cheery in there but soon an orderly advised me that my train was ready. I marched down to the station with the men and bumped the R.T.O. who informed me that I was to be O.C. train during the journey and pushed a heap of papers into my arms, leaving me in a slightly \nbel\n bewildered and concerned state of mind. However I soon found out that\n\nalthough my position as O.C. Train entailed considerable responsibility there was no need to worry. We passed through Abbeville, Noyelles Romescamp and just before reaching \nRouien\n Rouen were met with the prettiest sight imaginable – a long sweep of high country rising to a graceful but steep summit along which were perched a cluster of gaily painted houses, green trees above and fields below perfected the picture. \n\n \n\nWe passed through Abbeville Rouen Durnatel and many other towns of importance finally reaching Harfleur about 12 noon yesterday","53":" I marched the party of about 200 men up to the office O.C. Harfleur Base Camps handed in my papers and the men were then taken in hand by adjutant. I came on myself to my own Divisional Base and reported to the adjutant here and am now \n\nawaiting the verdict of a medical board as to whether I am fit to rejoin my unit or not. \n","54":"\n\nI have been boarded and marked fit for General Service. \n\nOn","55":" I left the Base Camp in company with two N.C.O.’s with Gov. money to pay the Aust. Troops in the Con. Camp Hospital at Trouville. I secured the necessary papers for the journey from the A.P.M. \n\nin Le Havre and caught the 3pm boat for Trouville on the 10th. We had a very rough passage \nover\n across the mouth of the River Seine. It was too rough to land at the jetty at Trouville the old tub being nearly washed up on to the beach. Accordingly we headed along the coast for the town of Harfleur which place we reached about 5 p.m. on the","56":" after a very exciting \n\n \n\nvoyage. We caught the 5.30 pm. train for Trouville \na\n changing trains at a place called Pont Leveque. Here I met an English girl who kindly showed me where to get a cup of tea whilst waiting for the train afterwards she introduced me to her father who invited me out, if I found time, to his home just outside Pont Leveque. We reached Trouville \n\nabout 8 pm and after arranging for a car to convey us to the Con. Camp we took rooms at the Hotel Tivoli. Next morning","57":" we were taken by car to the camp where we paid the Australians, finishing up about 4:30 p.m. We walked back to town and I enquired at the station if any trains were heading out to Pont Leveque. I find one just ready to\n\nstart and I got aboard \nReached\n leaving my NCO’s to enjoy themselves for a day in Trouville. On reaching Pont Leveque I stayed at the Hotel De Bras D’or for the night having arranged after much talking with the hostess for a carriage to call for me at 9 a.m. next morning","58":" The carriage did not arrive so I walked out to see my newly made friends. It was a very nippy\n\nmorning but I enjoyed it the road being \ngoo\n good the country very pretty and the sun shining brightly. I reached their house about 10 a.m. and was taken round the grounds by my kind host Mr. Pinney. He told me that he has been in France for 17 years. He showed me many beautiful horses which he is looking after. Afterwards we went inside and I was \n\nintroduced to Mrs. Pinney and their family who made me very welcome indeed. We had lunch and then Mr. Pinney took me for a long drive round the estate the second one for the day having driven in with him to Pont Leveque and back in the morning. He explained the country to me and pointed out places of interest. Also in\n\nthe morning he took me up on to a big hill and showed me a beautiful view along the valley of the River Roques. \nWe\n I dined again with the family at 5 o’clock and after having a talk with their little daughter and Mrs and Miss Pinney I prepared to leave. Mr and Miss Pinney accompanied me to the station where I caught my train in good time. \n\nMiss Pinney was the young lady who\nse\n was so kind to me \non\n the previous night when I arrived at Pont Leveque on my way to Trouville. My stay with them was a very enjoyable one but all too short. Mrs Pinney is \nmos\n deaf unfortunately. She is of the grand type of woman who are scarce nowadays. I left with \nmany\n an invitation to call\n\nand see them again someday for which I gladly said I would and thanked them. Arrived at Trouville again. I stayed at the Hotel Tortoni and met my two trustworthy NCO’s at the boat \nnext\n this morning at 9.30. We reached Le Havre about 11.15 am. after a good journey and took the train back to our respective base camps. \n","59":"\n\nYesterday all the Aust. Base Camps were amalgamated and are now all camped on the opposite side of the valley \njust\n between Harfleur and Montvilliers. We are well protected from the cold South Winds here by a long high range of hills. The officers mess here is rather crowded as a result of the Amalgamation. Last night was a lively one here. A number of officers having been warned\n\nfor\n to rejoin their unit today","60":" they decided to have a last night and sang and played the piano, broke a couple of chairs but I think they enjoyed themselves on the whole. Today we had the first snow \nfor\n this year in this part of France. It has been a dull, colourless day. Yesterday we had \nsome\n a little sunshine. Tonight I went for a little stroll. As I passed through the camp\n\nalong the wet pitch dark road I heard an officer reading out orders \nfor\n to a draft of men waiting to march to the train to proceed to the front. He was impressing on them the \nlist\n various punishments for breaches of discipline on the journey. Poor chaps. But this is war. \n\nRouen","61":" \n\nI arrived here this morning about 6.30 A.M. in company with a big draft of other \n\nofficers and men on our way from Le Havre to the front again after a very cold journey. Snow lies everywhere and is freezing very fast. I had a long walk round Rouen today and climbed the tall spire of the L’Eglise De Rouen from where a grand panoramic \nf\n view was unfolded to my gaze. We left Rouen at 4 p.m. this afternoon.\n\nReached Etaples","62":" about 12 noon","63":" Had\n\nlunch at the officers club in the camp and walked out to the Bn which happened to be at this town (Frencq) a distance of about 7 kilos from Etaples. Snow lay on the ground every where. Today we have had \na\n bright sunshine and the snow clad hills and trees looked beautiful. \n\nPreparations are being made to give the men a good Xmas. \n","64":"\n\nToday has been spent in trying to make a real happy Xmas for the men and I believe we have succeeded fairly well. The Mairie of the town kindly allowed us the use two School Rooms for the men’s dinner. Tables and chairs were hired from Ordnance and crockery etc from various firms in Etaples. The day began with warm sunshine which lasted up till\n\nabout 4 p.m. A high cold wind had then spring up making it very uncomfortable for anyone out of doors. The officers of the Bn. had their Xmas at 7 p.m. tonight. Rather a successful affair too on the whole. It seems a pity to my mind that advantage should be taken of these days to get gloriously intoxicated by \nall\n ranks. The excuse usually submitted \n\nbeing: Xmas comes but once a year. Surely if all the money spent on drink for the men were spent on more food and clothing for them, the men themselves would learn to appreciate it more even though their lives are rather hard ones; and they might be dead tomorrow: and all that sort of standard rot. But no. It is part of man’s duty to imbibe and create a disturbance\n\nthese days. It is the fashion not nature’s idea but merely a creation of man himself and although we face hail rain and hell itself without flinching noone of us is brave enough to attempt to alter, or improve or banish altogether, this creation of mans. Unfortunately it is only one of many. The White Races of the world are on the downward path. Unless\n\nsomething is done to check it, before another century is past, \nthe\n some dark race will “hold the reins”; and if I could only think that a dark race could ensure lasting peace and contentment throughout the world, then I would say: may they grasp the reins quickly. The present-day “superior races” have shown their inability to rule themselves \nmuch less\n\nmuch less rule anybody else. In Australia at the present time genius is lacking. \n","65":" \n\nHeavy snow fall. Snow fights with the kiddies. Beautiful night. Moon shining brightly on a Supreme Peace. \n","66":" Frencq. \n\nI had a ride \non\n in to Etaples with the transport officer (Mr. Bates) for the purpose of “exercising “C” Coy’s horse”? It was very dark when we left \n\nand we got slightly off the track but a W.A.A.C. lady \ngave\n told us the right direction. She told us that her son was killed with the 2nd Aust. Bn on Gallipoli. Strange that Mr Bates & I should both have belonged to the 2nd Battalion. \n\nLast night, the last of the old year was a quiet one for the men, though a very wild one for the officers. \n\nToday all is Merry and Bright again. Still the snow does not thaw and the roads are like glass. Very dangerous for \ncicycls\n cyclists and pedestrians. Horses all have patent attachments to their shoes to prevent them from slipping. \n\n "}}