{"Document Name":{"0":"Diary_0514","1":"Diary_0514","2":"Diary_0514","3":"Diary_0514","4":"Diary_0514","5":"Diary_0514","6":"Diary_0514","7":"Diary_0514","8":"Diary_0514","9":"Diary_0514","10":"Diary_0514","11":"Diary_0514","12":"Diary_0514","13":"Diary_0514","14":"Diary_0514","15":"Diary_0514","16":"Diary_0514","17":"Diary_0514","18":"Diary_0514","19":"Diary_0514","20":"Diary_0514","21":"Diary_0514","22":"Diary_0514","23":"Diary_0514","24":"Diary_0514","25":"Diary_0514","26":"Diary_0514","27":"Diary_0514","28":"Diary_0514","29":"Diary_0514","30":"Diary_0514","31":"Diary_0514","32":"Diary_0514","33":"Diary_0514","34":"Diary_0514","35":"Diary_0514","36":"Diary_0514","37":"Diary_0514","38":"Diary_0514","39":"Diary_0514","40":"Diary_0514","41":"Diary_0514","42":"Diary_0514","43":"Diary_0514","44":"Diary_0514","45":"Diary_0514","46":"Diary_0514","47":"Diary_0514","48":"Diary_0514","49":"Diary_0514","50":"Diary_0514","51":"Diary_0514","52":"Diary_0514","53":"Diary_0514","54":"Diary_0514","55":"Diary_0514","56":"Diary_0514","57":"Diary_0514","58":"Diary_0514","59":"Diary_0514","60":"Diary_0514","61":"Diary_0514","62":"Diary_0514","63":"Diary_0514","64":"Diary_0514","65":"Diary_0514","66":"Diary_0514","67":"Diary_0514","68":"Diary_0514","69":"Diary_0514","70":"Diary_0514"},"Date":{"0":"unknown","1":880.0,"2":881.0,"3":882.0,"4":883.0,"5":884.0,"6":885.0,"7":886.0,"8":887.0,"9":888.0,"10":889.0,"11":890.0,"12":891.0,"13":892.0,"14":893.0,"15":894.0,"16":895.0,"17":896.0,"18":897.0,"19":898.0,"20":899.0,"21":900.0,"22":901.0,"23":902.0,"24":903.0,"25":904.0,"26":905.0,"27":906.0,"28":907.0,"29":908.0,"30":909.0,"31":910.0,"32":911.0,"33":912.0,"34":913.0,"35":914.0,"36":915.0,"37":916.0,"38":917.0,"39":918.0,"40":919.0,"41":920.0,"42":921.0,"43":922.0,"44":923.0,"45":924.0,"46":925.0,"47":926.0,"48":927.0,"49":928.0,"50":930.0,"51":931.0,"52":932.0,"53":933.0,"54":934.0,"55":935.0,"56":936.0,"57":937.0,"58":938.0,"59":939.0,"60":940.0,"61":941.0,"62":942.0,"63":943.0,"64":944.0,"65":945.0,"66":946.0,"67":947.0,"68":948.0,"69":949.0,"70":953.0},"Entry":{"0":" \n\n","1":" \njune","2":" Sailed through heads at 3 pm. On Transport A 72 S.S.\"Beltana\" from Woolloomooloo Bay.\n\n14th Ran into a gale. Nearly all the boys were sick, myself included. The band have been separated. The 16 headquarters Stretcher Bearers (to which I am attached) are together on \"B\" Deck. The others are distributed among the different companies. Our deck is Forward.\n","3":" Still sick. Tucker good but can’t eat it.\n\n \n","4":" Still very rough. Passed Wilson’s Promontory and Port Philip.\n","5":" Feeling better now. Have kept up on deck to-day.\n","6":" Still very rough, doing at most 5 knots per hour 8 cases of measles on board quarantine feared. We have a canteen on board, but it is only open occasionally and when it is you can’t get to it without waiting about an hour. Played a programme on deck, but owing to the men being ill and the boat rolling it was pretty Keystone.\n\n \n","7":" Moderate sea at last boat back to its 12 knots. We have lost 16 hours coming from Sydney. Played another programme on deck. Audience included many albatrosses hovering round the mast defying the power of gravitation without moving their wings The boys swear every porpoise they see is a whale and every splash of water is a whale spouting.\n","8":" Passed S.S.\"Kadina\" No news worth Recording Looking for land.\n","9":" Church parade. Full dress Colonel read service\n\n \n\nfrom after middle deck Sighted land at 11 o’clock and travelling along coast. Don’t know where it is. Passed S.S.\"Moira\"\n","10":" Passed Fremantle this morning. Practice falling in to alarm posts.\n","11":" Practice falling into alarm posts. Practice in the morning, concert on deck at night. Sang all the songs that have been murdered years ago. Sgt Bignall and Powter played a cornet duet. Duel would have described it better. Tolerated it for about ½ an hour and then went and buried my head under the blanket-\n\n \n\nets to preserve my sanity. Slept on the table as the hammocks are not the most pleasantly scented beds I have slept in.\n","12":" 5 a.m. Still on table boat taking waves broadside on like an exaggerated see-saw. Am sliding up & down the table and waiting for the extra big one that is going to slide me off over the end on to the floor. Second thoughts I get dressed. Signaller Jones \"C\" Company died during the night with pneumonia. Word was quietly passed round to hold the day in respect as much as possible. Service\n\n \n\nat 11 o’clock. The parade was called to attention, Burial Service read, Last post sounded, 3 last Volleys fired, and concluded by the band playing the Regimental march (\"Sons of the Brave\" as the men march back to parade decks. The Funeral March is never played within 300 yards of a hospital.\n\n25th Weather noticeably warmer mild sea. Practice every morning now 9.30 to 12 One of the men who thinks himself a coming boxing champion (his mates rather encouraging his\n\n \n\ndelusion than seeking to dispel it) has knocked out his 4th man to-night (or thinks he has) Programme on deck. Following is programme of concert\n\nMarch \"Eh Abanico\" 36th Band\n","13":" \"When I lost you\"\n\n \"Hymns of old C. Choir\" Pte P. Kelly\n\nSong \"Believe me\"\n\n \"Geneveive\" Cap Chap Halpin\n\nBanjo Selection M. Rowlinson\n\nFantasia \"Soldiers Life\" Band\n\nSong \"Veterans Song\" YMCA off\n\nCornet Solo \"Rosary\" .Sgt Bignall\n\nSong \"Little Grey Home\" Serg Bernard\n\nMonologue Bugler C. Lofberg\n\nViolin & Banjo Duet Serg Harper, M.Rowlinson\n\nSong \"Mother Machree\" Pte Harris\n\nGOD SAVE THE KING\n\n \n","14":" Another burial to-day Service as before except a short drum roll between volleys. at conclusion played 10 minutes of marches. Death from pneumonia after measles.\n","15":" Sports on deck. The watch method of telling direction used ie. 12 o’clock pointed at the sun and distance between hour hand and 12 bisected gives due north.\n","16":" Another man gone. Buried at 11 o’clock (Pte Love)\n","17":" Miserable wet day. Kit bags brought up from hold for first and probably only time\n","18":" Practice falling in to\n\n \n\nalarm posts. Orders no man is to shave his upper lip.\n","19":" Nothing to Record\n","20":" Leading down to troop deck is a flight of steps about 6? tread and pitched at an angle of 45? The front edges are worn off and being wet are very slippery and the mess orderlies coming down with meals etc. slip dozens of times a day.\n\nWhen a man slips down if he is good tempered he goes up again and walks down properly. Some of the men are making up to 8\/- per day collecting bottles and selling to canteen at 1d each. One of the luxuries on board is an onion\n\n \n","21":" A new term has come to light Viz. \"Windbag\" this expression has become popular and refers to persons who have more to say than to do.\n","22":" The Y.M.C.A. phonograph on deck is a great boon. Concert on deck. Often of a night the boys have what they call a menagerie and as every body thinks he is a good imitator the noise is deafening.\n","23":" Another amusement is to tie a lashing rope on a hammock and swing a chap backwards and forwards in the middle of the night, or, if he is sleeping on the floor\n\n \n\ndrag him along the floor\n","24":" This morning we get the first news of the big naval battle.\n\n6th First saw a few flying fish. Another Death today (Moffatt \"D\" Co) the 4th so far at 4 pm. it was officially announced by Colonel Logan that a wireless message was received last night but owing to atmospheric disturbances the full purport could not be obtained but was able to glean the following facts. Some British cruisers encountered the High Sea Fleet off the Danish Coast on","25":" and great losses were occasioned on both sides. A portion of the British Main Fleet arrive-\n\n \n\ning on the scene. The High Sea Fleet was compelled to retire to the Keil after losing 18 ships Whether these were sunk by the cruisers or our main Fleet is not at present known but the latter is regarded as most probable. The \"New Zealand\" was in the thick of the fight on May 18th. The \"Australia\" is thought to have taken part in the action.\n\nAt the conclusion of Proclamation the band played Patriotic airs amid the vociferous cheers of the troops.\n","26":" Official report of North Sea losses are as follows:-\n\n \n\nBritain - Germany\n\nBattleships - 0 - 2\n\nB. Cruisers - 3 - 2\n\nArm \" - 3 - 0\n\nLt \" - 0 - 4\n\nDestroyers - 8 - 9\n\nSubs - 0 - 1\n\nTotal - 14 - 18\n","27":" South of Africa sighted just below durban 7 a.m. Coast appears very hilly & Sandy Passed a big town situate in a hollow and extending back over the hills. Can see 2 steeples and several big buildings. It is said to be East London Sighted a large shoal of porpoises, looked to be thousands coming like a big\n\n \n\nwhite crested wave towards the ship. They could be seen miles away. They made straight for the ship and passed our stern. Two of them broke away from the rest and swam over to the side of the ship They would jump 2 feet out of the water but they soon broke away again and joined the others. Another novelty of this part is the diving birds Shaped like a duck they drop from the height of 20 or 30 ft into the water like a stone. There are thousands of them here X\n\n8th Another burial to day (Lewis) the 5th so far. We\n\n \n\nhave to steam away out of sight of land to bury him Regulations say:- If a death occurs outside of 3 miles from land, body must be buried at sea out of sight of land, but if death occurs within 3 miles, may be buried ashore\n","28":" Last sight of land again\n","29":" Have now been at sea a month and think that sea life has lost its Romance for me. We are in a gale now rounding the cape and expect to reach Capetown any day now. Another death to-day this makes 6. On account of number of mumps and measles cases it is questionable whether we\n\n \n\nwill be allowed ashore. Paid 10\/-\n","30":" Arrived at Capetown 6 p.m. Have been lying outside all day on account of the fog. All the Brigade seem to be here. On the other side of the wharf lies the 35th in the \"Benalla\" and out in the stream lies the 34th the \"Argylshire\" the 33rd are yet to come. Have just heard of the sinking of the \"Hampshire\" through striking a mine and the loss of Lord Kitchener & Staff on the way to Russia.\n","31":" At 10 o’clock a general parade and inspection of battalion on the wharf by Major General Thompson was carried out. After which we\n\n \n\nwent for a 10 mile route march to Sea point via Green Cape. There we had lunch which we carried in haversacks and returned via the Beach road along by the Ocean to the troopship arriving at 4.30 we were then dismissed from 5 till 12 a grand Smoke concert being given in our honor at the Opera House So much for the Routine. \n\nThe first thing that struck me was the the great mountains at the foot of which Capetown lies. These form a grand and picturesque background and looking from the sea the view is\n\n \n\nmagnificent. These mountains of which the main ones are, Table Mountain a very high and rugged mountain with a flat top 1 mile long 3582 ft high and the Devil’s Peak a conical shaped mountain. There are mountains all round but these are the only ones I know the names of. For the greater part of the day the mountains are almost obscured by the fogs and mists which seem to abound here. They hang about the mountains like a cloud. The buildings in Capetown are, generally\n\n \n\nspeaking big, square and solid looking. There are many quaint and curious styles especially among the residential class of properties. All work in Capetown is cement or rough-cast and done up in bright colors such as White, light grey and light blue. This in lots of places looks magnificent but where as in lots of cases, the places have been let go a couple of years they look old and dilapidated. So on the whole, excepting where the best class reside, the whole is a rather motley assortment.\n\n \n\nEnrichments of sawn pattern woodwork is largely used. Bricks are only 2½\" thick.\n\nMost of the trams here are two story, though there are not very many here altogether.\n\nThe Trains are the same as ours but they run along the street no barricades to keep the traffic off the lines The Railway crossings where there are any\n\nare as depicted above and able to be raised or lowered\n\n \n\nOne of the most interesting features of the town is the monument and pier. The monument is one of Rubeck, some notable of South Africa and just in front is a model of a ship in stone, a memorial of Capt Scott’s Expedition to the South Pole. Leading from this is the pier running out into the Bay a distance of 600 yds and on the end is a lighthouse and band rotunda. The Capetown Prof. Orch. Plays here every Sunday. Admision to pier 3d. Not far from the main street is \"the Avenue\" a narrow street over hung with trees. Some\n\n \n\nof these trees were planted hundreds of years ago, in the early days. From this can be seen the Museum, which is said to preserve the first Post Office in Africa when the letters were placed under a huge stone.\n\nParliament House is also close at hand and when Parliament House is sitting The entrance is lit up with huge red lights, no light showing at all when they are not.\n\nThe Cathedral is a huge curiously shaped building of stone with a great number of solid buttresses.\n\n \n\nThe people are a curiously mixed lot The majority being Kaffirs or Hottentots, and Dutchmen. There are also a large number of Germans. The Kaffirs are undersized, thin, and weak looking race and give one the impression of being a deteriorated race, but the number of children contradict this. Strange to say they are all boys. They are like rabbits running about but are very obliging and will do anything for a soldier. Their dress is their strangest feature. You see children wearing clothes\n\n \n\nbig enough to hold two like themselves. They don’t seem to eat anything. None of them did who came on the march with us, and they did not look as if they missed it.\n\nThe wage paid to laborers is 2\/- for colored and 3 for white labor.\n\nThe attitude towards the kaffirs is not easy to explain. Up Country where there are most Kaffirs the white people are not allowed to walk on the pavements. But down here where there are equal rights the white people seem to tolerate the kaffirs but it seems a hard task. Their\n\n \n\nchief thought is to keep the Kaffirs in their place.\n\nIt is said that when the East Lancs, Essex and other English Regiments were here they married Kaffir girls, so that girls here did not have any thing to do with the soldiers until lately. They have all been called home now and African lads are in the garrisons here.\n\nThe police here are nearly all imported men, Dutchmen generally. A few days ago some of our 35th Boys had a big row in District 6 and several kaffirs were killed. Oranges grow plentifully here.\n\n \n","32":" at 9.30 AM we left the wharf and went out into the stream. Kaffirs brought out apples and oranges to the boat which were hauled up with a rope and basket to the deck. A lot of sharks were caught off the deck to-day up to 1?6? long. They were blue in color.\n\nIn South African language 3d is called a ticky and mandarins, notches.\n\nCecil Rhodes residence Groote Schuur is a magnificent house at the foot of Table mountain and in front are 4 immense stone pillars. Leading\n\n \n\nup to the house is a flight of steps and on the sides are 8 lions lying down (stone) 4 on each side 2 on each landing.\n\nThe 33rd Battalion have arrived to-day on the \"Marathon\", a White Star boat. It is said that Brigadier General Jobson is travelling on this boat.\n\nWe are lying at anchor in Table Bay where memory will always associate with the landing of the British troops for the South African campaign. Many of our boys are being photographed with kaffir children in their arms, to send home\n\n \n","33":" Another death to-day from the artillery this makes 7 in 30 days. Sick men taken ashore and another is said to have died on the way.\n\nMajor Cooke Russell announced that owing to the measles and mumps cases the Cape Town medical authorities had quarantined the ship until fumigated, on account of a death owing to Spinal Meningitis. \n\nThe order for quarantine has now been revoked and instead the ship is to be thoroughly fumigated to-morrow.\n","34":" Reveille at 5 o’clock this morning and all hammocks & blankets are taken and hung up in \"C\" Deck ready for fumigation.\n\n \n\nLying alongside us is a hospital ship. Round the ship is a row of green lights and about 10 ft from the Deck is a red cross about 4 ft square lit with red lights.\n\nAt 8 a.m. we marched to Cape Common, Green Point and spent the day there, having dinner, and arrived back at the boat at 6 o’clock. Cape Common is where the British troops were encamped during the South African campaign & it lies at the foot of Signal Hill. Signal Hill is a conical hill some 2000 ft high and on the summit is a wireless station and a flagpole on\n\n \n\nwhich, when a ship is sighted a black disc is hoisted to half mast, and after ascertaining who she is a flag is flown.\n\nTwo big guns are noticeable on the skyline which swing on a pivot so they can cover any point.\n\nWe are not allowed to come anywhere near the locals on account of our quarantine\n\nThe 33rd Batt. Passed us to-day on their route march and we fell in and played them past.\n\nThe day was spent in \"playing games. Cricket, Football, Boxing, Medicine Balls etc.\n\n \n\nNear the mouth of the bay is Robertson island on which is a lighthouse.\n","35":" At nine o\/clock two escorts arrived. The \"Laconia\", a boat after the Orient type, about 11 or 12,000 tons, on it are about 12 x 6\" guns (auxiliary cruiser)\n\nThe H.M.S. \"Kent\" a light cruiser about 11 or 12,000 tons also arrived.\n\nThe \"Thermistocles\" arrived last night with the 41st (Queensland) Battn. It is said to have had 36 deaths through Smallpox coming out.\n\nThree nurses came aboard this morning\n\n \n\n16th At 10.30 a.m. we weighed anchor and left Capetown. The \"Beltana\", \"Benalla\", \"Argyllshire\", and \"Marathon\" with the H.M.S. \"Kent\" as escort.\n\nThe Bells on a boat signifying the corresponding times.\n\nTime - Bells\n\n12.30 - 1\n\n1.0 - 2\n\n1.30 - 3\n\n2.0 - 4\n\n2.30 - 5\n\n3.0 - 6\n\n3.30 - 7\n\n4.0 - 8\n\n4.30 - 1\n\n5.0 - 2\n\n5.30 - 3\n\n6.0 - 4\n\n6.30 - 5\n\n7.0 - 6\n\n7.30 - 7\n\n8.0 - 8\n\n8.30 - 1\n\n9.0 - 2\n\n9.30 - 3\n\n10.0 - 4\n\n10.30 - 5\n\n11.0 - 6\n\n11.30 - 7\n\n12.0 - 8\n\n \n\nSome of the men were watching an officer taking the soundings. One of them said \"I see they are still looking for mines\".\n\nSince we left Capetown no lights are shown of a night. On the troopdeck no lights are lit excepting 4 bulb eyes and these are obscured with a towel.\n\nA whistle has taken the place of the bugle for sounding \"Reveille\".\n","36":" Nothing to report.\n","37":" Church parade.\n","38":" Nothing to report.\n","39":" Nothing to report. Orders that we play from 3.45 to 4.45 each day and are exempt from other duties.\n\n \n\n20th Paid £1-0-0\n","40":" Boxing Tourney aboard begins. Ref Major Cooke-Russell Information gleaned from seaman. The temperature of the water is taken every 4 hours from a canvas bucketful hauled up from the ocean to the upper deck. By this they can tell to a certain extent where they are also the kind of weather to expect they will run into. The log is taken every 4 hours and readjusted as the clock only registers to 100 miles\n\n \n\nThe log clock strikes every ¼ mile.\n\nHave learnt Morse Code in my spare time.\n\nWe have appointed 2 permanent mess orderlies for the trip for 1\/- week They are very enthusiastic M.O’s and by the constant use of the holystone & sand (without regard to the wear on the table) they have made our table the cleanest on the ship. \n\nPast St. Helena out of sight.\n","41":" nothing to report.\n\n \n","42":" It is reported that the Russians have captured 172,000 men and 172 guns. We are expecting to cross the equator to-day or to-morrow. A joke on the ship at present. Some wag says there is an 8? drop at the equator. We are allowed to open the port holes now of a night provided there are no lights lit this makes then place so dark that you cannot see your hand behind your back. Fred Nelson recited my peice last night but had the misfortune\n\n \n\nto forget some of it. Otherwise it went well.\n\nIt is not so hot here as I would have thought for the equator but it is very close and stuffy. We saw a lot of flying fish to-day. Man said to have been lost overboard off the \"Marathon\". \n\nThe weather is so calm that for days we have not felt a movement in the Ship. Every dinner time now a bottle of ale about ½ pint is issued to each man for 6d. Needless to say this does not interest me. Another concert was held to night at 3.45\n\n \n\non the forward hatch. The band played accompaniment to several songs.\n","43":" Boxing, Wrestling Medicine ball Comps etc on Forward hatch. Have done some washing to-day. When you come to try there is something in washing after all\n","44":" Church Parade. Received Wireless The Russians have reached the Carpathians. Awnings have been erected over all decks.\n","45":" We are said to have crossed the line at 6 o’clock yesterday morning. We\n\n \n\nhave had a lesson on Bandaging this afternoon, the first since coming aboard. Alarm at 6 o’clock. All the boats have been supplied with tinned meat and biscuits and lowered down to the deck. Tins have been hung up in different places on the deck which contain a quantity of chemical which makes a flare in coming into contact with salt water. This leads one to believe we are getting into the danger zone. Also the men who are sleeping on deck have been ordered to take up their lifebelt with them.\n\n26th Gambling seems to be the general thing here. It is not discouraged and on the deck ¾ or more of the men are playing poker euchre or nap.\n","46":" Cruiser has been having some target practice the target being a buoy with a flag flying from it. Had A.M.C. Lecture. Crux as Follows:-\n\nBroken Thigh bone\n\nFirst pull broken leg to full extent keep feet together and if bleeding apply strangulation tourniquet. Utilise rifle or anything handy as splint and let it project 3 or 4\" past foot. Tie feet, and both legs & splint tightly together. Wounds are painted with peroxide or\n\n \n\niodine. In case of severance of limb artery will knot itself\n\nFor Broken rib first squeeze all air out of man’s body and put a tight bandage round ribs.\n\nIt is raining, misty, close & miserable to-day\n","47":" To night I have seen the most glorious sunset of my life. Picture the grim lines of a cruiser silhouetted against the grey murky background of the sea & above a dark bank of cloud tinged with heliotrope, dying into what looked like a lake of the most glorious azure such as was never given to man\n\n \n\nto reproduce. Round this lake raged an inferno, but never did fire glow, or flames glare so fiercely as this. In the lake were several red hot coals glaring out forming a great contrast to the restful blue which surrounded them. To me the lake meant rest, contentment and peace. But those flames – I shudder.\n","48":" At 9.15 we dropped anchor outside the port of Dakar in Senegal a French seaport on the West coast of Africa. It is said to be the French naval base.\n\n \n\nAll round us are porpoise and dolphins in thousands. Outside the port on the right side is a big rugged island on which is a big lighthouse and probably a fort. On the mainland we can make out numerous forts with the glasses.\n\nAt 3 p.m. we went into the port.\n\nRound us flocked niggers in canoe shaped boats 3 or 4 in a boat. Some of these boats had a sail about 12? square and presented this appearance \n\n \n\nThe others were propelled by curiously shaped paddles The niggers were bare except for a sash tied their waist and in this they stowed the proceeds of their aquatorial efforts.\n\nCoins are thrown over the side and the niggers dive for them. They look just like frogs under the water, and though they are said to live well on 3d per day Nothing less than 3d will entice them to dive.\n\nThe Harbour seems a-\n\n \n\nlive with fish. Never have I seen so many at once. Within ½ a mile radius you could hardly see 5 yards where there was not splashing in the water, dozens of fish.\n\nThese fish are up to 1 foot long and resemble tailer.\n\nThe natives have nets about 20? long and these they throw overboard and pull up hundreds.\n\nLooking round we can see guns protruding from every headland. On one there are 5 big guns side by side\n\n \n\nRight against where we are anchored are the \"Kent\" and another big British Battleship the \"Swiftsure\" 18,000 tons which took a prominent part in the operations at the \"Dardanelles\". This Battleship with another of the same type were built for the Argentine Republic, but, owing to financial stress, was never taken over.\n\nOn the mainland on our left is what looks like a big white public building with a dome and flagstaff on which\n\n \n\nis flying the french flag This is presumably the Town Hall.\n\nThe \"Swiftsure\" has 2 10? guns fore and aft and seems to be bristling with guns all round\n\nThe majority of the Population of Dakar are niggers, the dress of the better class of them being a bright coloured cloth (mostly blue) slung round their waist and over their shoulder. The divers dress as described above.\n\nBesides niggers there are a few French people. Obviously the chief pos–\n\n \n\nitions and management is in the hands of Frenchmen.\n\nAlongside of us is also a big awkward looking French Battleship with Two funnells at each end of it.\n\nSoon after we came in we played \"Marseillaise\" while our officers stood to attention. Our Colonel then led us in 3 cheers for the French, which was answered by a hearty cheer from the French Battleship.\n\nThe houses and buildings of Dakar are, to us, \n\n \n\noriginal. They seem to be all windows, and in lots of cases the tops of the houses are square and devoid of chimney stacks. This seems remarkable as the houses seem to have no roofs. Looking again I cannot see one chimney in the town except on Factory.\n\nThe roofs of the rest are all tiled. I can see no other kind.\n\nWe have shipped a 4.7 gun on our stern this afternoon the other transports have done the same.\n\nNews has come through that an Australian Transport ? \"Ascanius\" (?) has been sunk in the Mediterranean\n\n \n\nTo-night a concert was held in the after well deck. After a song was sung and a request made to the men to let the Frenchies yonder hear them in the chorus. One of the men rejoined \"We can’t do it on the tucker, Sir\"\n","49":" The French pilot says that the rumor of the sinking of the Australian transport is untrue But states that the French have captured from the Germans:-\n\n192,000 men\n\n4,000 officers\n\n284 Heavy guns\n\n \n\n530 quick firers\n\nThis however may prove as true as the other report. At sunset we weighed anchor and left Dakar. The \"Kent\" going on ahead The \"Swiftsure\" going next and the 4 transports following in the same order as before.\n","50":" H.M.S. \"Kent\" seems to have left us. Boxing & Wrestling Tourney continued this afternoon on forward well deck.\n","51":" Received 12 cigarettes & 1 pocket handkerchief from comforts fund.\n\nChurch Parade\n\n \n","52":" There is an epidemic of mumps aboard. The whole of the starboard deck is utilised as sleeping quarters for mumps patients. Alarm at 9.30.\n","53":" The stretcher bearers are allotted to number 4 life boat, and all sleep with their life belt near their right hand. Orders are, The Colonel and ship captain, In case of attack will be stationed on the bridge and will conduct operations and will give the order to lower boats or to jump overboard. A guard will be posted with ball\n\n \n\ncartridge to prevent anyone rushing the boats.\n\nFrom to-day a special guard of 80 is posted on the boat deck with rifles and 5 rounds of ammunition to look out for periscopes of submarines or floating mines.\n\nWe are in the danger zone now and the \"Swiftsure\" crosses all round us.\n\nTo night is the first real twilight I have seen. At 8 o’clock it is nearly as light as day.\n\nYesterday they were trying our stern gun. We made sure we had struck a mine.\n\n \n","54":" We were issued with our webbing equipment to-day.\n\nMedicine Ball Sports on Saloon deck at 10 a.m.\n\nAt 11 a.m. we sighted on the horizon what looked to be a waterlogged sailing ship with one very long mast. There seemed to be the stump of another mast left standing and she was drifting about in a manner which showed her helplessness.\n\nOur escort raced over to see what was up and lay about 500 yds off it. We saw a pinnace dart\n\n \n\nout to the wreck and after about ¼ of an hour, return to the cruiser.\n\nThe cruiser then fired 8 shells (presumably 6?) into the wreck and we saw it sinking as we passed out of sight of it.\n\nWhether anyone was rescued we do not know.\n","55":" Inspection Full Dress with webbing Equipment. From this morning till end of trip lifejackets or belts are worn continuously night and day.\n","56":" The Ship’s Mascot a bull dog named \"Wowser\" Was Killed to-day by a fall from the boat deck on to\n\n \n\nthe coal in the bunkers.\n\nThis dog was presented to the battalion by Stuart Griffiths of Manly after a refusal of £50 for same.\n\nOn his collar was inscribed the name of the owner and \"It Hurt\" presumably referring to the parting with the dog.\n\nThe lifejackets are becoming a nuisance, and every opportunity of a momentary divestment is taken advantage of even at the risk of being crimed.\n","57":" Have seen dozens of whales round the boat. They travel in two’s or\n\n \n\nthrees, and are somewhat similar to a porpoise, inasmuch as they dive and come up at intervals and on reaching the surface spout in a manner of a shell dropping on the water.\n\nThe first whale that came to close quarters was thought by the \"Benalla\" to be a submarine and caused a bit of a sensation.\n\nAt 7 a.m. Our escort the \"Swiftsure\" left us and in its place came 4 very small destroyers about 200 tons. The numbers of which were 21, 57, 72 the other we have been unable to discern.\n\n \n\nA destroyer then attached itself to each transport \"72\" being attached to us. The Transports then separated and the \"Marathon\" which had been last all the way was lost to sight ahead and we who had been first look like being last.\n\nThese mosquitoes as they are called are very fast and good only for submarine warfare, its guns only looking to be about 2? the Forward gun is very short and only meant for short distances. The pair aft are very long and pointing upwards which makes me think\n\n \n\nthey are meant for aircraft.\n\nThey scout around the vessel generally keeping about ¼ mile ahead.\n","58":" At 10 a.m. we sighted land. We travelled along the South Coast of Cornwall and the scenery is very picturesque. The whole coast seems to be cultivated, and from the tops of the hills down to the waters edge seems to be covered with farms and fields, separated with hedges. These fields are greens of every shade, sandy brown, all forming an effect that to my unaccustomed eyes\n\n \n\nseemed stupendous.\n\nWe then saw the famous Eddystone Lighthouse. It seemed to be miles from land.\n\nAs we travel past the Lizard and along the south Coast of Cornwall, we see forts everywhere the whole coast seems to be bristling with guns.\n\nIn places which in our sunny land would suggest a beach (hollows & indentations) Is a solid mass of buildings among which not a vacant space can be seen.\n\nAt 4 o’clock we passed\n\n \n\nPlymouth. The mouth of the harbour is mined thus, The squares represent the baskets containing explosive floating on the surface of the water joined together by wires & any vessel striking any part of this explodes the whole.\n\nWe next passed Three very old style warships of the \"Victory\" type moored together and ostensibly used as naval Training School. Their names were \"Impregnable\" \"Inconstant\" & \"Black Prince\" They seem to resemble a five or six story house and to be all windows \n\n \n\nAs we passed these boats the Band played \"King\" & \"Rule Britt\" while the battalion stood to attention. This is evidently a custom.\n\nDestroyers lie all round us moored in pairs, also a few big battleships.\n\nAt 5 p.m. we came to the wharf at Devonport and though it is only just after midsummer there are men on the wharf wearing gloves. We contemplate what it will be like in winter.\n\nOpposite us lie 2 submarines in building 350 ft long and built to carry 7 torpedo tubes each. Also undergoing repairs the \"Implacable\" which took\n\n \n\npart in the North Sea Battle.\n\nOn shore is the Naval Barracks which is a town in itself Containing hospital P.O. etc\n\nIn a Devonport paper we see that our destroyer escort met two German Submarines sinking one, the other got away. These were evidently waiting for us.\n\nAt 10.15 p.m. it is broad daylight and children and girls are running about as if it was only 6 p.m.\n\nThe mystery of housing the multitudes that these English cities are credited with is now solved in my estimation. There seems to\n\n \n\nbe not only terraces of houses but cities of terraces All the same colour and the same kind of roof about 3 stories high and set out as no Australian Villages are.\n\nEvery square inch of ground is cultivated and through the windows we can see an endless stream of nothing but wheat fields, hay stacks and everything that is included in farming. In the train is a notice that all blinds (with which all carriages are supplied must be lowered as a \n\n \n\nsafeguard against enemy aircraft.\n\nAnother notice reads – Warning Discussion in Public of Naval or Military matters may convey information to enemy. Be on your guard\n","59":" arrived at Amesbury (12) miles from Salisbury at 5 p.m. and marched 2 mls to camp.\n\nBrilliant red poppies Daisies, Clover, Buttercups abound everywhere Description absolutely beyond me. There are old shingle or thatched roof houses of the most old fashioned\n\n \n\ndesigns with moss growing on the roofs, Beautiful brooks, giant elm & poplar trees, hedges, and the atmosphere makes one think he is going into Paradise.\n\nThere are 6 or 7 camps all about 10 times as big as Liverpool and when we first got into camp we saw 3 aeroplanes (Biplanes) hovering over the camp. We take no more notice of them now than if they were birds.\n\nWe can see 3 big rifle ranges in the distance but I suppose there is a score round about\n\n \n\nAs for Sanitary etc. The camp is far ahead of my wildest anticipations. We are all in one hut and very comfortable at present.\n\nAt Exeter Station a committee of ladies handed us Tea and cake and a card with the Compliments of the Mayoress of Exeter. This was very acceptable.\n\nThe people here seem to be very open and trusting even to the extent of leaving a change counter in a remote corner for 10 minutes surrounded by soldiers.\n\n \n\nThis camp is said to be able to accommodate 300,000 men.\n\nThere are supposed to be 12,000 Australians here & there is a rumor that we will only be here 7 weeks. On the wall of our hut has been written by one of the 2\/8 Leeds Rifles\n\n\"Good luck to whoever comes here\" we are off at last after 5 months of hell here\"\n\nOur beds consist of two tressels 6? high and 3 planks a mattress and 3 blankets.\n\nThe Y.M.C.A. is a big well equipped building with 2 billiard tables and\n\n \n\ndifferent supply stalls where tea & coffee may be had for 1d a cup.\n\nThe huts are made of fibrous cement and fitted with electric light through out and heating stoves.\n\nThe Railway Carriage is heated by steampipes under the seats and can be turned on or off by a lever on the wall.\n\nHave learnt that the Daylight Savings Bill has come into force in Britain and every clock is advanced 1 hour. This partly explains the late sunsets\n\n \n\nHave been over a very old Church - The church of St Mary and St Melorus.\n\nIn front is a cemetery and the headstones dating from 1814 have the inscriptions, some fallen and some falling off.\n\nAmong the commemoration stones are following:-\n\nTo Jno Bundy, Benefactor of Amesbury 1823.\n\nTo Suzan Palmer Killed by a cannon shot during defence of Lucknow Residency\n\nTo Fulwar Wm Fowler and 12 descendants magnificent Brass plate.\n\nThere are 2 Baptismal\n\n \n\nFonts one very ancient and one modern, made respectively of stone and marble. On the wall inscribed in marble are also copies of 4 wills of ancient beneficiaries to the church, also a list of Vicars which dates from 1491. The floor is made of big stone slabs which are inscribed the same as tombstones which denotes an ancient custom of burying under the floors.\n\nThe church is lit by suspended kerosene lamps.\n\nWe also saw a weir on a brook overhung by elm trees. It was like a picture\n\n \n\nIn the windows of the houses are displayed cards as depicted. In one of the houses was a Certificate as follows \n\nOne King One Empire One Flag \n\nCertificate of Honour\n\nIssued for Service in The Great War\n\nThis is to certify that the undersigned gallantly answered to the call of his country and giving up all home ties he loyally joined His Majesty’s Forces for the protection of the British Empire.\n\n(Sgd) Wootton Fred, Charlie, Bert, Albert, Sydney.\n\nRegt Wilts.\n\n \n\nComm Off.\n\nEssex, Prisoner, Persian Gulf, India, France.\n","60":" Leave is granted from from 5 to 10 and the bounds are 3 mile radius from camp. Hats are to be worn to distinguish the Australian from the English Soldier.\n\nEquipment belts must also be worn, men properly shaved and boots cleaned and white band on shoulder strap clean.\n\nStrawberries are very cheap we got 4 lb baskets for 2\/- and at the canteen you can get a saucer of strawberries & cream for 2d\n\n \n\nTo-night we visited the famous Stonehenge and from the guide, a policeman, learned the following information.\n\nThe Stonehenge was built about 1800 B.C. and is the ruins of a Druid’s temple. It was built by the Phoenecians The largest stones came from Brittany in France and the smaller ones from Wales.\n\nThey consist of large stone pillars and stones lying across them.\n\nSome of the stones have fallen. One, the biggest weighs 65 tons and fell\n\n \n\nin the year 1645. Two others fell in 1740 and 1900 respectively. Several of the others are propped up with long & stout saplings The highest pillar standing is 29? 6? high and 15? in the ground. Largest cross stone 25 tns\n\nThe cross stones are joined with a triangular tenon and mortice cut into the stone.\n\nThe stones are placed in a circle and in the centre is a small pointed stone.\n\nIn three different directions, 50 yds from the centre is a tall pointed stone. Over two of these the sun\n\n \n\nshines on the sunrise & sunset of the 21st of June and throws a shadow on to the centre stone.\n\nThe other stone throws a shadow on the centre stone on the sunrise of 21 Dec. No doubt there was a sunset stone but it has disappeared \n\nSunrise 21st June\n\n \n\nThe whole Temple is about 120? across overall.\n\nHalfway between the sunrise stone and the outside of the ruins is a large flat stone 20? long and 8? wide and 1? above the ground. This is called the sacrificial stone.\n\n A little distance from the Stonehenge are several large mounds about 20? high with a base of about 25 yds.\n\nThese are Tubalise or burying places of the early Romans when Romans Captured Britain. The dead were piled in heaps and the dirt piled over them.\n\n \n\nThe next thing we saw was an old disused well, covered over by thatched roof with a wheel by which a bucket was drawn up.\n\nWe then crossed over some private ground and entered a wood.\n\nThese woods are only a small portion of the original forest, and seem like islands on the grassy plains. They are very thick and present a very picturesque appearance. On entering the wood we notice that there are about 10 different kinds of trees and the ground is covered with buttonhole or ornamental\n\n \n\nstrawberries. A quantity of Briars is intersperced among the trees.\n\nLeading from the wood is a good, metalled road (all the roads are good) about 30? wide and on each side of it is, respectively a field of rye and oats.\n\nWe crossed the River Avon which at this end, is only a narrow stream, and is literally teeming with trout.\n\nThere are houses here 3 & 4 hundred years old Built of flints & looking as solid as ever. This one was built 1600 A.D. \n\n \n\nThe windows are built small so they can be fired out of and present a very small target. The roofs are shingle roofs in some cases covered with moss.\n","61":" Have been over St Mary’s & St Melorus’s church again with guide who told us the following history of it, also stayed to the service.\n\nThe Nave or body of the church is early Norman over 1000 years old.\n\nThe origin of the church is told in the following story.\n\nThe boy Saint, St Melorus Prince of Brittany had his right hand and left foot (544 AD)\n\n \n\ncut off and was brought to the site of the church and buried. People came great distances to do pilgrimage there. On this site the church was erected to his memory.\n\nA curious coincidence is that a few years ago a heating apparatus was installed in the church and on one of the piers appeared the figure of the boy saint. It is now to be seen, though faint, yet distinct.\n\nThe Door is 7 to 800 years old . Made of wood and Iron in a quaint old fashioned design. The knob was stolen by Americans and\n\n \n\nThe key which they thought would be stolen too they fastened to the wall with a bible chain with 1? links The key as shown is cut in the shape of the cross. The lock is still in working order.\n\nIn a glass case is a Saxon cross of the 8th century.\n\n700 years ago an addition was made with battering walls inside this is said to represent the bowing head of the Saviour on the Cross. The roof of this is chestnut and the date of addition 1420 AD\n\n \n\nRound the inside of the roof where the supports join are leering, grinning, heads looking down hideously at you.\n\nAnother addition, The Chapel of Jesus has beautiful vaulted roof and is accounted for in the following manner.\n\nIn 1280 Queen Guinivere, not wishing her eldest son to come to the throne, her youngest being her favourite, she determined to have him killed. She gave him wine to drink out of the Loving Cup and while he was drinking had him stabbed in the back from behind\n\n \n\nLater, filled with remorse as a reparation, she had an addition put on to the church.\n\nThis is shortly after the time of the Round Table.\n\nOne of the fonts was dug up in the chancel in 75 pieces and fixed together with copper pins. It is made of marble.\n\nIt was suggested that an alteration should be made to the belfry. A part of a wall, in a corner was pulled down and inside was found a portion of a pillar evidently a portion of\n\n \n\na Saxon building built on that site before St Melorus’.\n\nAs each addition was put on, it was consecrated with a small cross, The mason made 4 small holes as shown and these were joined by the bishop.\n","62":" Saw W. Mayne\n","63":" Mr Andy Fisher, The High Commissioner for Australia visited us to-day with the Brigadier, and spoke a few stirring words about the works of the Australians and his expectations of our future, to the Brigade in mass\n\n \n\nIn a little village called Figheldean (and by the locals Fiddle-de-de) is a large chestnut tree and underneath is a blacksmith’s shop.\n\nThis is supposed to be the original of the Longfellow’s poem, \"Under a Spreading chestnut tree\" and certainly it looks the part.\n\nAeroplanes are as common a sight here as motor cars over our way. It is nothing to se 3 or 4 fluttering over our heads at once.\n","64":" Went to Durrington\n\n \n\na small village about 2 miles from here. It is a picturesque little village with an up-to-date looking school, a few side shows, and a few pretty lanes with hedges on both sides.\n","65":" Church parade in morning after which we went into Amesbury, and, meeting 3 other chaps, the 5 of us hired a motor-car from the garage and flew to Salisbury, a town about 8 miles away, at about 50 miles an hour. This town is out of bounds to us, the radius of bounds being 3 miles from the camp.\n\n \n\nWe saw the Salisbury Cathedral which is the most Prominent feature of the place. It has the appearance of being very old and has a spire of a very great height. More particulars of this when I get them.\n\nThere is a water street here with houses and a footpath on each side. There is very little water in it at present being mid summer.\n\nThere is a big Gothic gateway leading to the Cathedral and this is locked up every night to everyone but those who live\n\n \n\nInside on each side of the walk.\n\nWe passed Colonel Peppers houses, and Shady Bower a pretty little road over hung with trees. Mail day to-day\n\n17th Very pretty two-storey houses in a terrace with 4 rooms and Kitchen etc in prominent and high part of Salisbury. Plenty of ground attached rent only 5\/6 week, would be","66":" or £1 in Australia.\n\nBricklayers wages 7½d & 8d per hour.\n\nGot letter from Grandfather who informs that Harry\n\n \n\nhas been slightly wounded and in a hospital at Norwich, expecting to be sent away somewhere to convalesce.\n\nThe wounded soldiers here have been supplied with blue trousers and grey coats, white shirts, and big red ties. We saw quite a lot of these in the town.\n\nThere are places here called alms houses which are allotted to old people who can no longer work. 6\/- a week is also allowed them.\n\nThe work on the Buildings here is mostly done\n\n \n\nin red bricks, cut & struck, and nearly all have guaged arches, majority cambers, which would be too expensive to put in the majority of buildings in Sydney. \n\nMy mate being a member of Congress Hall Band of the Salvation Army in Sydney, and with a letter of introduction to any Salvation Army throughout the world, made the acquaintance of the local branch who made a lot of us and took us home to tea.\n\nFirst time I have seen\n\n \n\ngooseberries & Black Currants growing. Being ripe we were able to demolish a few which we enjoyed.\n\nConfectionary and Sweets here is about the same price as in Australia.\n\nIt costs us 5\/- each for the motor which we thought was a bit stiff. \n\nIn Salisbury we met at different times 4 of our own officers and saluted them but the are sports and forgot that we were out of bounds. Perhaps that is partly accounted for by the fact that they\n\n \n\nwere out of bounds also themselves.\n\n17th Went to Bulford, another small town 2 miles from Camp.\n\nAm struck by the flint houses. Some have 1 foot of flint work and 3 courses of Bricks or large blocks of stone. Flint bedded in stone like concrete. \n\nOthers are completely built of flint.\n\nAlso there are innumerable houses with thatched roofs and large overhanging eaves.\n\n \n","67":" Have been out watching a trout-fisher. It appears that the trout cannot be caught unless they rise, as when they are to be seen at the bottom they are feeding and will not bite.\n\nThe method of fishing for them with a rod continually casting, the line only staying in the water about 2 seconds, rather mystified us.\n\n19th The 10th Brigade arrived this morning, also a bunch of Australians every different battalion and regiment was repres-\n\n \n\nented. These men had seen service in Gallipoli, The Peninsular, and for a while in France. They looked very much the worse for wear, some all to pieces yet when they arrived nothing was ready for them and they had to wait about for an hour while things were made ready for them. This was a most scandalous piece of mismanagement.\n\n \n\nOur Trip to London","68":" to 24th\n\nAt 8.30 a.m. we left camp and played troops to Amesbury station where we entrained for London and left at 10 o’clock.\n\nOur instruments were carried back to camp by the signallers.\n\nWe passed through some beautiful country. Fields of poppies, blood red and their abundance made them look like rivers of blood. Then there were fields of yellow mustard flowers and with the sun shining on them made them look like pictures we have seen but\n\n \n\nnever realised.\n\nWe then passed a bee farm near Basingstoke. On the right of the station was the ruins of an old church, most of which has fallen away only a few piers and arches were left standing.\n\nNear Fleet we saw a beautiful lake on which were hundreds of white swans presenting a lovely sight.\n\nAt Farnborough we saw 4 immense cement baths with fountains playing in the centre and a little father on innumerable Tommies camps. Next was a cemetery The tombstones being so thick as to almost touch one another\n\n \n\nThen there was an immense red brick building, The L & \n\nW R Orphanage maintained by Voluntary contributions at Woking\n\nAt Byfleet we saw an aeroplane works, a golf links, and a nursery with the most glorious and abundant show of roses that ever pleased the eye.\n\nAt Raynes Park we got our first glimpse of the electric trains somewhat resembling big trams.\n\nAt Clapham Junction we could notice the buildings getting denser signifying our approach to the metropolis.\n\nAt 12.0 we reached Water\n\n \n\nloo station and here our disappointments commenced\n\nInstead of the grand elaborate station we had anticipated, the station was dull and gloomy and gave one the impression of a cattle station. It’s size is nothing short of our expectation in fact its vastness appalled us.\n\nWe then marched to the Australian military head quarters.\n\nFirst we marched over Waterloo Bridge over the Thames.\n\nOn our right hand was Somerset House, an immense white building\n\n \n\nwhich contains the registry of all Births, Deaths, Marriages, wills, deeds etc. of all Britain. All records may be seen here.\n\nOn our left on the embankment is Cleopatra’s needle a description of which will be subsequently recorded.\n\nWe then passed Aldwych Theatre, Strand, Lyceum Savoy (H.B.Irving) Adelphi (High Jinks). Gatti’s restaurant, Charing Cross Tube, and Hampstead Tube Stations, Trafalgar Square & Nelson’s monument, National Gallery, Admiralty Arch and through it the Mall\n\n \n\nWhite hall with seven or 8 Horse Guards on guard Two of which were mounted and all standing like statues. They were very showily uniformed in red with shiny breast plates and helmets. Some one passed the remark that they dressed and undressed with a spanner.\n\nOpposite Whitehall is the British Museum and a statue of Clive, a governor of India.\n\nNext we Passed Scotland Yard, Then Westminster Abbey and Parliament House, and the door of the place where the \n\n \n\nCoronation service was played. The Midland Bank with a great square dome.\n\nBoot Repair notices read Mens 2\/3 Hand sewn 3\/6\n\nSaw several curiously shaped chimneys. \n\nThe conductors of all Buses & Trams are women\n\nThese have to under go 2 weeks training at the yard Then go to Scotland Yard to pass the test. Their licence costs 5\/- and their clothes are provided for them. The age is from 18 to 35, minimum height 5? and wages £1 week. They must live within 10 minutes of the yard\n\n \n\nThese buses are two deckers and run by the General Omnibus Co. and run all over the city. We arrived at the Headquarters and were dismissed at 2 o’clock and had dinner at the Anzac Buffet, an institute run by the Australian Native’s Assn where dinner was served free. Here also we were given a pass to the Lyric Theatre.\n\nThis was the first taste of British generosity and friendliness which was the greatest feature of our trip to London.\n\nThere is also an enquiry office where any company’s\n\n \n\nWhereabouts may be found, and here they organise tours of the city with guides.\n\nBefore leaving we were asked to do nothing which would besmirch Australia’s good name.\n\nAfter dinner we went over Westminster Abbey with a guide. Inside are sculptured Model by the best sculptors of the old days.\n\nIn the rear part of the hall is the Tomb of Richard I & Oliver Cromwell.\n\nIn the Chapel of St Edward are the tombs of William De Valence 1296 Earl Strover 1617 Lord Britton 1873 The Duchess of Tussock (Mother of Lady\n\n \n\nJane Grey) The Children of The Black Prince, John of Eltham, 3rd son of Edward III 1337\n\nIn the Chapel of St Nicholas Duchess of York 1433 Duchess of Northumberland 1589. The First Earl of Salisbury, Duchess Somerset 1587 Sir George Villars 1605\n\nThe nave of the Abbey was built by Henry VII. On each side of this chapel are the stalls of the Knights of the bath with a tower design of woodcarving on which are the coat of arms of each Knight. The first stall on the right is the King’s and opposite the stall of the \n\n \n\nOriginator of the Order.\n\nWe then saw the Tomb of George IV 1760 & wife under the alters and the tomb of Edward VI composed of Black marble slabs Presented by Queen Victoria, James I Elizabeth, 1605 Henry VII.\n\nThe body of Oliver Cromwell was interred here in 1658 and lay for 3 years, when, after the restoration, It was thrown out. The stone ceiling is said to be the most beautiful in the world and almost resembles wood carving. It is almost like wood carving. We then saw the tomb of the Duke of Buckingham, Favorite of James \n\n \n\nI & Charles I. In the South aisle is the Lady chapel built by Henry VII and contains the tombs of Charles II Mary II William III George II, The Mother of Henry VII who established Eton & Cambridge and at her death left a sum of money that every week 40 widows would receive 1 loaf of bread and 2d. This is carried out to the present day.\n\nMary Queen of Scots 1587 Countess of Lennox round whose tomb are 6 quaint figures representing her children \n\nHenry VII Chapel :- Remains of Two princes Edward & Richard who were smothered in\n\n \n\nthe tower and found 200 years after. Henry V the hero of Agincourt 1442 Edward Confessor 1066 Queen Elinore whose body when brought to the abbey, wherever it rested crosses were built (Charing Cross etc)\n\nWe then saw the place where every King has been crowned since since Harold before the Conqueror.\n\nTombs of Edward I (Longshanks) 6? 8?, General Wolfe killed at Quebec. Sir John Franklin the Arctic Explorer, Gladstone & Disraeli.\n\nWe then visited Trafalgar Square and Nelson’s Monu\n\n \n\nment. The height is 93 feet and round the bottom of the square are 4 lions one at each corner each of which cost £20,000 and was moulded at Woolwich Arsenal.\n\nWe went to the National Gallery next and found dozens of students painting from the originals. There were pictures by Rubens \"The Crucifixion\" \"The Martyrdom of the saint\" \"The fall of the damned (3)\" \"The descent of the Holy Spirit etc, also Gainsboroughs, Michelangelo, Vandyck, etc\n\nWe then went to see\n\n \n\nBuckingham palace where the King resides in front of which is a tremendous work in marble with the Statue of Queen Victoria in the centre. This is called the Albert Memorial.\n\nWe noticed that the top of the palace is covered with netting to catch bombs from Zeppelins.\n\nThe are beautiful carnations here, far better than I have seen in Australia.\n\nWent to the Lyric theatre with pass obtained from Anzac Buffet as mentioned Presented pass and were escorted into 10\/6\/ seats in\n\n \n\nthe centre of the Orchestra Stalls. It is a beautiful theatre With 3 galleries. The Play is Doris Keane in \"Romance\".\n\nOn the backs of the seats are cases of opera glasses which may be obtained by placing 6d in slot.\n\nAt Soldier’s Home, Buckingham Gate, we had a room for two which cost us 6d each per night and had beds and sheets scrupulously clean, We could not have been more comfortable in a first class Hotel.\n\nWe then saw a procession\n\n \n\nThrough London from Whitehall at 2.30. It was composed of girls mainly and led by a Drum & Piccolo band.\n\nThe Women War Workers were responsible for this. There were 4 bands in the procession playing the National Anthems of Belgium & France and \"Keep the home fires burning\" a song that seems all the rage here.\n\nThis procession showed the most glorious patriotic sentiment I have ever seen The whole Motto of the march seemed to be a request for the return of Hughes, as\n\n \n\nwas evidenced on hundreds of banners:-\n\n\"We want Hughes on the War Council\"\n\n\"Hughes Your country calls you Etc. Etc.\"\n\nWe then saw another procession of girls belonging to the Church nursing & Ambulance Brigade 1907, with their band of some 30 players This seems a popular movement and has many branches.\n\nWe next went to see Cleopatra’s needle, a large stone obelisk covered with Egyptian hereoglyphics. The following are copies of the inscriptions which tell its story\n\n \n\nThis Obelisk was quarried at Syene was erected at on (Heleopolis) by the Pharaoh Thothmes in about 1500 B.C. Lateral inscriptions were added nearly 2 centuries later by Rameses the Great, removed during the Greek dynasty to Alexandria the royal City of Cleopatra.\n\nIt was there erected in the","69":" yr of Augustus Caesar B.C. 12\n\nThrough the patriotic zeal of Erasmus Wilson F.R.S. this Obelisk was brought from Alexandria encased in an iron cylinder. It was abandoned during a storm in the Bay of Biscay recovered & Erected on this spot by J. Dixon C.S. In\n\n \n\nthe 42nd year of the reign of Queen Victoria 1878. This obelisk prostrate for centuries on the sands of Alexandria was presented to the British Nation 1819 by Mahommed Ali Viceroy of Egypt a worthy memorial of our distinguished countrymen Nelson & Abercrombie. On the obelisk are also the names of six who perished in a bold attempt to succour the crew of the Obelisk ship \"Cleopatra\" During the storm. ","70":" on each side is a sphinx & the whole on the Thames embankment.\n\nNot far away is a statue of Bobbie Burns 1759-1796\n\n \n\nWith the following inscription \"The poetic genius of my country found me at the plough and threw her inspiring mantle over me. She bade me sing the loves, the joys, the rural scenes of my native soil in my native tongue and I tuned my wild artless notes as she inspired\"\n\nNext we went on the underground Electric Railways called the Tube To get to the stations you have either to take a lift or go on the Revolving staircases which you stand on and are carried down to the station. The whole city is honeycombed with these railways and the carriages are practically\n\n \n\nround like the tunnels.\n\nOur next stop was Madame Tussaud’s waxworks which are supposed to be the best in the world. On entering as in Theatres you first have to pay your tax and then buy your ticket. In this case the tax was 2d and admission 1\/- with 6d extra for the chamber of Horrors. On Entering you see a picture of the ark and the animals issuing forth on Mt. Ararat.\n\nVisited St Pauls. After examining the body of the interior and duly admiring the fine work and inside of the dome, We\n\n \n\nDescended into the crypt and saw the Tombs of the Following:-\n\nArthur Sullivan 1900. The Duke of Wellington and Viscount Nelson (These are the only two British heroes that are buried above ground)\n\nMillions have seen these Tombs. Lords Wolseley & Roberts have been buried here but their Tombstones will not be erected till after the war The tomb of Florence Nightingale in white & pink marble was unveiled a few weeks ago.\n\nWe also saw in the crypt The car made for Lord Wellington’s funeral weighing 17 to 18 tns.\n\n \n\ncast from cannon captured by Wellington. It cost £20,000 & was drawn by 12 black horses 3 abreast & has his battles inscribed all round it. We also saw the Original Candlesticks of Lying in State.\n\nWe then went up to see the Old books many of which are very valuable, and an old stone that has been worshipped.\n\nThere are 660 steps up to the platform round the dome and here we got a grand Panoramic view of London\n\nWe then went inside the dome where there is a landing 4? wide called the Whispering Gallery. It\n\n \n\nis 100ft across and the guide whispered on the wall one side and it came round to us almost like a shout.\n\nInside, the \"Light of the World\" hangs which has been shown all over the world.\n\nOn the pavement outside are the famous St Pauls pigeons which will feed out of your hand.\n\nWe then went over the Palace of Westminster which is Parliament House. Inside are fine big policemen everywhere.\n\nWe first went through the King’s Robing room, the walls of which are decorated with pictures of the round\n\n \n\ntable period. From there we went through The Royal Gallery, Houses of Lords & Commons, the Prince’s Chamber etc. For which see guide book for further particulars We were appalled by the display of unparalleled Splendour.\n\nThe Clock in the tower is called Big Ben, is 20? across and takes12 men 2 weeks & 2 days to clean it. Is regarded as the largest & most accurate clock in the world.\n\nWe then Passed through Regents Park and St James Park & Petticoat Lane\n\n \n\nThe men here wear bands round their arms with a crown on to show that they have either been refused or waiting to be called up.\n\nWent to Elephant & Castle and don’t think it a nice neighbourhood.\n\nWe then went through Hyde Park and were disgusted with it. It is only a fenced in paddock. There is an anti aircraft barracks there. In Hyde Park is the Serpentine and running alongside of it is Rotten Row where the upper class drive on Sunday. While on the farther side is the Marble Arch.\n\n \n\nWe then went over Tower Bridge which opens up in the centre. This is the only bridge that does. The Steamers have to have collapsible funnels to go under the other bridges.\n\nWe went all over the Tower of London escorted by Beefeaters and saw the Royal Crowns, Sceptres, Bath Jewels etc and the Armoury the Ancient Armour, guns, muskets, place where Lady Jane Gray & other notables were executed, Also the Bloody Tower where the Princes were smothered\n\nand Sir Walter Raleigh\n\n \n\nWas imprisoned Further particulars see guide.\n\nWent Down Bond Street Regent St & Piccadilly and am thoroughly disappointed. Am satisfied that Sydney Streets are far better shops bigger & more splendid. Why these shops have no verandahs how do people get on in Wet Weather.\n\nWent over Zoo Very interesting. Saw Alligators & Crocodiles, and seals in their natural state with Their dog like bark.\n\n"}}