{"Document Name":{"0":"Diary_0227","1":"Diary_0227","2":"Diary_0227","3":"Diary_0227","4":"Diary_0227","5":"Diary_0227","6":"Diary_0227","7":"Diary_0227","8":"Diary_0227","9":"Diary_0227","10":"Diary_0227","11":"Diary_0227","12":"Diary_0227","13":"Diary_0227","14":"Diary_0227","15":"Diary_0227","16":"Diary_0227","17":"Diary_0227","18":"Diary_0227","19":"Diary_0227","20":"Diary_0227","21":"Diary_0227","22":"Diary_0227","23":"Diary_0227","24":"Diary_0227","25":"Diary_0227","26":"Diary_0227","27":"Diary_0227","28":"Diary_0227","29":"Diary_0227","30":"Diary_0227","31":"Diary_0227","32":"Diary_0227","33":"Diary_0227"},"Date":{"0":"unknown","1":1492.0,"2":1493.0,"3":1494.0,"4":1495.0,"5":1496.0,"6":1517.0,"7":1518.0,"8":1530.0,"9":1532.0,"10":1533.0,"11":1534.0,"12":1535.0,"13":1536.0,"14":1546.0,"15":1550.0,"16":1551.0,"17":1553.0,"18":1554.0,"19":1555.0,"20":1556.0,"21":1557.0,"22":1558.0,"23":1559.0,"24":1560.0,"25":1561.0,"26":1579.0,"27":1580.0,"28":1581.0,"29":1582.0,"30":1583.0,"31":1584.0,"32":1585.0,"33":1588.0},"Entry":{"0":"\n\nLouve ","1":"\n\nI am now fully settled down with the 3rd again. I have no doubt that they are a good collection of men, & so far I have been far happier with them than I was in England\n\nPaddy Waly the Irishman who was in the","2":" with me is carrying on with general in his usual humorous way\n\nWe are running a signal rest station and leave behind Kemmal on the marshes just west of Amenteres. The 2nd Field Ambulance are running the HDS & MOS & doing all the bearing but\n\nwe have a few bearers from C section up the line\n\nThe rest station is a convent & its outbuildings, with the addition of a few tents & marquees, & is situated very close to Lore, which is the typical Belgian village. The tent subdivision men are running the wards, & there is little else to do.\n\nSince I have been here I have devoted most of the time to the concert party, with the result that we gave a good show on New Year’s Night after the annual dinner. We held the dinner & concert in a\n\n kind of hall on the ground floor of one of the convent buildings, containing a real stage equipped with all wings & accessories. A burlesque on “The man who stayed at home\" which I produced \nwith\n in the program was a success, & now I am back at ordinary fatigues again, resting after the very arduous work of getting the “uppers\" up to a good standard.\n\nOther 16th men who are here are – Th Smith, Pavier & Fopp.\n\nAmongst the bearers is a section of men who\n\nwould be described as “hard nuts\" of a clean variety. Reckless kind of men with a predilection for the wine when it is red, but clean & honourable kind of chaps such as Les Bryant, Mick Stafford, Po Brown Then there is a small section of miserable kind of hard nuts such as Harry Barnes (who was a great nuisance among the boys at Caestre on the evening up to join the","3":" Then again there is a small section of Religious men such as Arthur Simpson & Tom Beech, who hold services from time to time\n\n& a good average crowd \nwho\n containing well educated & very decent chaps.\n\nCol Butler left us at Cormont & in his place we have now Col Cade who seems a very good man as.C.O. Garland is of course a bit stricter as W.O. than he was a Sgt on the peninsular but he is a decent mate if one treats him the right way.\n\nAndy Chalmers – Staff Sgt dispenser on the Peninsular of the same still – is a good type of chap Addicted a little to the gay life, he seems to have at last\n\na little military ambition, for on those occasions when he acts as W.O. in place of Garland, he becomes quite business like – a contrast to the old happy go lucky estaminet . Still he will never be an ideal N.C.O. for he has too great a sense of humour, & is too fond of the men to be hard on them.\n\n\tX\tx\tx\tx\n\nHeard from Manesl that Willie is buried half way between Neuve Glise & Messines & have applied for a pass to go over this afternoon. As they are\n\n not allowed to issue passes beyond Neuve, Glise, Ishell have to go at my own risk, & if hit shall be liable to a Court Martial for Self inflicted wound.\n\nRather humorous – but still there is not a real chance of being hit.\n","4":"\n \n\nFixed up a new cross on Willies grave in two visits all told. Found the 2nd Field Amb were running an A.D.S. at Kundahaw Farm, so was enabled to have a shot with several old friends\n\nat the same time as I looked after the grave.\n\nSwanson I met by accident there, he being attached to the","5":" Brigade Artillery, & passing there at the time. Collis & Marks I also met.\n\nThe Concert party has been reorganised on my suggestion that a committee was necessary, & now we have a good committee under the chairmanship of Major Rutledge. Scotty McNeill, a brother of the McNeil I met in the Peninsular is Secretary and a good man in such a position.\n\nWe have not given\n\nany more shows since then but during the remainder of the time we were at Loire I to instruct some kind of a repertoire. It was not exactly a success however because they were too busy to do much work. Still a start was made.\n\nOn the","6":" we \nlet\n left the Rest Station at Loire & marched through Bailieul & Vienx Berguin to Sec Bois, a small range near Hazebrouck, where we thought to be only billeted for a day or so. As a matter of fact it soon became known that the whole of the \n\n “rest\" of a month or so would be spent there. B section were billeted in a barn \nruin\n in the yard of a cottage where the cookhouse was installed, but I soon got a room in a cottage on the other side of the barn in which lived an old hunchback lady & her daughter who was on holiday from Bonlope where she is a domes \ntre\n servant\n\nThere was conjecture among the rough element about this young lady’s morality, all absolutely foundless & inspired by bad minds. As a matter of fact Paddy who shared this room with\n","7":" (it was really only a cubicle )was tainted by the same thoughts to a certain extent, with the result that in the end I left the room & went into a billet next further up the road where Danny Dixon had established his barbery, & slept with the elder Kollische. They are two very decent chaps & the comfort I got by going into their place to live was very great. Still further, at about the same time I got friendly with one Vic Hall lately returned to the unit from Divis. Headquarters where he had been employed as a\n\ndraughtsman. He is, I suppose, the nearest akin to me in tastes & ideals of any in the unit, for which reason I hope to be further acquainted with him.\n\nLast Saturday I set out for Caestre which is distant some 8 kilometres, & called on Madeleine Van Uixem who was very pleased to see me again. In helping her to write a letter to Lily I managed to have a confidential chat which I enjoyed immensely. Yesterday Vic Hall & I walked over there & although I was not able to have such a long chat with her on account\n\nof the fact that she was busy, I enjoyed myself all the same. Her husband was at Calais in hospital last Saturday, but now she does not know where he is, excepting that he is in France somewhere.\n\nThe talk I had with Hall on the way to Caestre showed me that he is clever, \n& quick as\n able to learn a given thing very quickly, exceedingly keen & anxious to make up in study as much as he can for the time lost in the army.\n","8":"\n\nVic Hall & I are going to start a literary society amongst just a few of us with the idea of getting a library of good books together at a small cost to each Discussions etc. will follow later on. It is a first rate idea, & I shall follow it up with zeal.\n\nWe went for a short walk before tea today, & discussed Wells, Ibsen & Shakespeare’s Macbeth.\n\nThe Colonel had an inspection of the whole unit at 2 today, and afterwards spoke a few words. The substance of what he spoke was that he did not\n\nwish us to think ourselves unduly harassed by his instructions in regard to billets & general routine. As a matter of fact he wanted to keep the Standard of the unit high, & the only way that could be done, was by everyone keeping fit & clean.\n\nIt was a good straight forward talk, & made me feel that he is a good successor to Col Sutter. He has taken a new interest in the concert party & always passes some cheery remark to me, when he see me.\n","9":"\n\nYesterday the boys of D’Arcy Dixon’s group of religious enthusiasts had a bible class in his little barber’s shop where we sleep. I participated. Gray & Vic Hall \nand\n among others, were there.\n\nThis afternoon I played two games of chess – one with Rickson a religious & rather bigoted man who is particularly narrow minded on the question of cigarettes & the rum issue -- & the other with Strange. Both games I lost, but I gained some experience, & I fancy I shall be quite fascinated with the game.\n\nYesterday being rather cold was nine or less a slack day but today we went through the usual routine of route march lecture & physical jerks\n\nYe Gods. How many more lectures on physical jerks am I going to hear. That today by Corporal Pollock (\nlate of\n who was at Anjone) was a good one & strange to say he had several bits of information I did not know before. Too often it is a dreary repetition of the old old story.\n\nThen the interminable route marches. Today I was thinking of the huge number of them & wondering how it is they are as bearable as they are.\n\n Vic Hall is a very clever chap. When he just joined the unit, he knew nothing of French, but in nine months he managed to get such a grasp of the language as to be able to give lessons.\n\nFairly tall, with pleasant but somewhat loosely, featured face, he wears spectacles of gold rimmed, and talks in a halting weak fashion, yet very definitely. Sometimes he appears to be too anxious to be \ndefinite\n accurate when discussing things for I think he can err on the side of attention to detail, & thus rubble. However he is what too too many are \n\nnot, earnest. His reading has covered Economics & the usual matriculation subjects & touched on Psychology, Theosophy, & Literature (perhaps more deeply). He has paid a fair amount of attention to History, Altogether, for his life which is about 21, he has put in some solid work & would be classed as a well read man.\n\nOf worldly experience he has not a great deal, but he has read on matters that are at the bottom of social troubles, and has at least read of what he has not experienced. That is Ibsen’s plays & some of Shaws come under that category.\n\nWe have formed a reading circle among some eighteen of us to make a good selection of books open to each of the Unit. Hall organised the scheme and donated most of the books.\n\n“H—have you read any of –a—Stephen whats his name – er Stephen Leawik’s books. You get one as soon as you can and you’d be set like a jelly\"\n\nWell they’re really funny. For instance he – they’re humorous books – he writes a kind of novel – he calls it the 1000 novel and by jove its one of\n\nthe funniest I’ve read. He condenses the general plot of a typical modern novel into three short chapters. Talk about humour!\n\nThe first one is on board an ocean liner and the hero meets the heroine. The conversation is all about the most ordinary things but the author makes it all seem very dramatic and I can tell you its worth reading.\n\n(Point missed: clothes, mannerisms, walk.)\n","10":"\n\nOn guard last night, but very easy – nothing doing. Actually I spent five minutes on the post, first, joining there at 10 pm (my spell started at 2 AM). I found darkness & mud outside & darkness & chewing horses inside the stable. The first relief had gone off & the second was in bed.\n\n\tX\tx\tx\tx\n\nRose at revile & spent the morning in writing a burlesque and doing some washing. The burlesque is first a short one in preparation for the next concert.\n\nIn the afternoon we had some physical jerks, and at 3 oclock I was free to take more lessons in Chess. O.H. Gray is giving me the first ideas of moves and I am quickly getting a grasp of the game.\n\nIn the evening we had an informal meeting of the literary circle, & decided to start off tomorrow night with a “book evening\". Each of ten of us will hold forth on some favourite passages. Darry Dixon (one of the two in our little barber’s shop):-\n\nHe is a student of theology and when war broke out\n\n \n\nwas in a fair way to being ordained.\n\nIn appearance; thick set regular build, dark, with hair inclined to slightly wave. His face is rather determined with a firm mouth and kindly eyes. It has a slight bird-like appearance, but he is good looking.\n\nI first met him at where he used to take the services every Sunday. Of the religious men he is the best preacher, and seems to be looked upon as the most earnest of them having been a consistent Christian for\n\nsome years. Yet in his daily intercourse with all the boys he is as happy & good natured as one would imagine it possible for him to be consistently. When a question of principle is involved he is firm, but otherwise quite one of the rest.\nI\n He is not extremely well read or intelligent, although he is a keen student of the bible & of theology, and he is never at pains to hide that first fact.\n\nAltogether I think he is the best example of a Christian that I have met in the army, not excluding the Padres\t\t\t\n\nHe has a military medal & by all accounts he earned it.\n","11":"\n.\n\nTent pitching this morning. \n\nParade dismissed in afternoon when I prepared some notes on Omar Khayyam for the literary evening. Good meeting – about 20 out of 24 members turning up. I was elected to chair & we got to work immediately (held in barn near the stables . Forms & chairs \nby\n provided by farmhouse people).\n","12":" Rickson read a passage from “The Sky Pilot\". \n\nPte Barlow read a passage from “Young Lord Stranleigh\" by Robert Barr. H.A.T. Reynolds \nread\n told the story of “Mick Arden\" illustrated by quotations\n\n& O.H. Gray read a quotation from some magazine on ideals. \n\nThere was first discussion in every case, and as in first meeting its success pleased me very much. The result of not making the Society an Ambulance affair but leaving it open to whosoever was sufficiently interested to join was that there was no shyness but a kindly spirit of desire for knowledge. Not the slightest hitch marred the whole affair, and it is my hope that on those lines it continues.\n\nKollishe:- is the other mate of my little barber’s shop sleeping apartment. He is\n\nthe brother of the young Kollische with whom I worked on the Peninsular. This one, although much the larger and apparently the elder, is really the younger. The other one is small & very youthful looking, but this one is large & manly.\n\nYet when one comes into contact with him daily the sheer boyishness of his years (20) is apparent. Any tomfoolery or laughter provoking nonsense in word or deed he enters with zest.\n\nHe is tall, well-built yet peaceful, with legs the shape of which admirably suit the fairly well cut riding \n\nbreeches he wears – a present from another bother, who is a doctor captain. The shape of his head and angle of nose are typical of the Grecian style I imagine. They seem to have the shape \nfamiliar\n common to the Greek statues of heroes one sees. His hair is dark & wavy.\n\nAt Rugby and most sports he excels, and at present is engaged in endeavouring to break Bertram’s record for skipping (training for the sports) which stands at about 156 – Kollische having previously held it at 133 jumps. He and Darcy Dixon are both athletes and I am the drone of the three as far as sport is concerned, for although my intentions are good, my performances are out of it with them.\n\nI have noticed that he assiduously reads his bible.\n\nRecently returning from \nEngland where he was on leave,\n leave to England, to this rather boring village, he has developed what he has pleased to call the “wind up\". The bombardments which we have heard during the last few days, have ostensibly worried him a lot. As a matter of fact I fancy he is not easily worried by fear, but the good time he had in England with the “bits of fluff\" (as he has his friends at Liverpool) has brought out the blues a bit here by the contrast.\n\nLast night when almost\t\t\t\n\nasleep I felt a very strange sensation of fear. They had been talking about the fearsome sights of the battle field, and in one second as I lay musing on the war, I suddenly felt a full realisation of what it means to die. It was quite involuntary, and affected me very much for the time being. In the morning no trace of it remained.\n","13":"\n\nCommittee meeting of concert party yesterday decided to attempt concert very soon.\n\nWent be Osteasteene, where the rest of the Ambulance is, today & fixed up for the chaps to prepare their stuff up there. \n\nMeeting of literary men tonight & was proposed as Pres. But had to refuse on account of concert party work – put on the committee.\n\nIf piano arrives soon, will be able to give a pretty good show in a few days.\n\nCold, clean & very fine.\n\n over bombing\n\nlast night (got Chestre I believe & wounded a man & killed a child). Over again tonight & dropped bombs somewhere in the vicinity.\n","14":"\n\nUp the line in a dugout at present, & as near the front line as it is possible for them to put me.\n\nGot over the piano difficulty by getting Capt Peel, the Artillery Chaplain, to let us have the one he has borrowed from the Church Army, with the promise of returning same to Bailliue.\t\t\t\n\nConsequently we were able to give a concert last Monday night\n\nat Sec Bois There were to have been sports during the day, but owing to bad weather these were postponed.\n\nThe concert was a success and, although briefly prepared, was noted the best given yet. After the show the Colonel came along & complimented me on it very sincerely, in his general manner. \n\nThe literary circle, meanwhile, has grown a great deal. Since the first literary evening we have we have had three meetings: \none was\n a debate on “should sexual instruction be taught in schools; a Literary papers night & a debate on land settlement. In\n\nthe first & third I just spoke & in the second, I read a paper on “Love & Mr Lewisham\".\n\nOutstanding men in the circle are Hall, Barlow, Rickson, Dickson, Staff, Parlay, Betram, & Reynolds. Barlow has given us some good stuff both in papers & speeches. The circle has grown considerably & is officially recognised, with a couple of representatives on the central committee. What I have had particularly in mind \nin all\n both these affairs is now assured. No harm will be done either the Circle or the Concert Party by the secession of one man, for \nit &\n each has a strong constitution.\n\nYpres – Comines Canal Sector\n\nWe travelled by motor lorries from Lec Bois to Vermozille, where the","15":" now have its headquarters at an A.D.S. This place is due south of Ypres, and leaving Vermozille (only a name) & beginning to cross the desolate treeless ground going up to the front line, Ypres comes into view on the left, as a wonderful but awful picture of ruined churches & heaps of stone. On the road up we had our path shelled ahead of us by shrapnel & high explosive, but we got through safely.\n\nEight of us are at a regimental aid post about 400 yds behind the trenches\n\n which face the German trenches which protect the right flank of the town of Comines. The road from Menin to Ypres (Menin Load) is visible on our left front, -- \nMenin\n Comines is visible between the lowhills to our right front, & Hill 60 & Kemmel are on either flank left & right respectively. Comines canal & railway behind\n\nAeroplane stunts in the afternoon. Three of ours cornered one & it only got out by a nose dive to comparative safety of their front trenches, whence ours could be fired at by their machine guns. Another of theirs sneaked over, and a battery of 18 pounders got on to it & drove it away helter skelter By means of many shrapnel. One piece of the shrapnel came over & hit Gregg (our cook’s) plate just near his head.\n","16":"\n\nYesterday morning we got a couple of patients – making about five since we took over. The Count – a little red faced prematurely baldheaded, oathsomely agressive yet harmless individual – who is the fourth man of our squad, took one patient with me & Dickson & Kollosche took the other. First we carried through a narrow trench where duckboards are erected about a foot over the floor to allow for water, leaving a space at each side where the unwary might step over. From this the track bends over a small wooden bridge to the tramline. Here we got a truck placed it in the line\n\n & both patients on it, warily at first over a bad part of line pushed back to the relay. Most of the way was uphill, but easy. On the way back we all got on for the downhill ride & the truck ran away with us at a fair speed until an awkward turn caused a spill & over we all went.\n\nDesultory artillary fire all day, but only one or two shells came near us.\n\nDickson & I went with Major Willis to discover a certain aid front lately disused. The track went away to the right through the railway embankment, which is cut up &\n\nwhose rails are twisted to terrible shapes; thence along a certain Olaf Avenue. Having discovered the aid post we went over to the water point & on to another bearers post. The avenue led along a small ridge from which we could see the whole German line, & numerous villages by spires in the distance. It is rather interesting to point out that villages behind our lines are a heap of ruins, but behind theirs are quite untouched apparently; certainly the churches are quite safe. The ground over which we passed was the scene of the heavy fighting in the\n\n previous stint in fact Hill 60 - where the tremendous mine exploded – lay near by to our right; no longer a hill but just an uncofimable mass. The ground is cut about by shell holes to a tremendous & unimaginable extent, and old rifles and gear, together with all kinds of smashed up military equipment of \nof\n all kinds, lay everywhere.\n\nWe arrived at the bearer post & found Vic Hall, Harry Reynolds, Mc ilroy & Strange installed therein. It was a German pill box & evidently the scene of lot of fighting, and the centre of a hot barrage, for confusion reigned all around.\n\nTwo huge slabs of concrete from the pill box had been lifted en masse & blown a few yards where they lay on their sides in a heap of mud & rubbish. There had once been a Fritz light railway past the pill box, but all that remains to testify to it are half buried rails twisted into grotesque shapes, in shell holes.\n\n \t\nNothing doing during the afternoon, but we were just settling down to a final read in the evening about 8.30 p.m. when the Germans raided our trenches\n\nFirst there was a perfect tornado of machine gun fire, then the eighteen pounders on both sides opened out to be followed by heavier guns, until the din was terrific - yet nothing like a big Push.\n\nWe wondered for a time whether the German offensive which rumour expects to take place opposite here very soon, had commenced; but the firing was too desultory for such a thing. We in the supports were not troubled much, only a few shells coming round our way; but we could hear plenty of shells bursting in the front line. Most only ours but the \n\nGerman machine guns were being busy too, for a hail of bullets came over our dug out.\n\n Although we were ready for a trip at any moment, strange to say, no \ncassulties\n casualties came through our way, & after about an hour we were able to go to sleep.\n\nThis morning we found out that Fritz had raided one of the battalions of our brigade & taken six prisoners. Three or four wounded passed through the other post, so we did very little out of it.\n","17":" ‘18\n\nLast night there was another raid, with usual accompaniment of big shells, bombs & machine gun fire. A few shells fell round here, but not within yards of \nhere\n the dug out. It happened on the right of here, that is the right arm of the A salient, held by the","18":" Batt., of which the left arm is held by the","19":" batt. In the latter are several old 3rd boys, including old Charlie Taylor of Anzac days & Harry Barnes, recently transferred.\n\nWe had rather a funny case last night. There were two wounded to take down; one\n\n walking & one stretcher case: both wounded on outpost duty. It was pitch dark, except for the fitful illumination of star shells & gun flashes, which really left us worse off than before, for when they had gone all was blacker than ever. As our heads stood out in silhouette above the saps in the ghastly star shell light, one felt that one was by far too conspicuous. Part of our track to the next relay is under direct observation from Fritz, yet he does not trouble us much.\n\nWell we started. - Mick Stafford. - rough yet\n\nshort as a hun, & brave in proportion: fine head, huge & good looking; Ted Farrell, once Staff Sergeant – reduced – beer soaker (not to mention rum) had eyes at night – with the redeeming feature that he has right through since the landing at Gallipoli. Then Ash a provincial Englishman, talkative & not very strong or sensible, yet tenacious apparently; not getting the just due of his good points because of the predominant surface blemishes. He is gone in one eye. Lastly we had Kollosche – already discussed. The two good men of the party were Stafford & Kollosche!\n\nI went ahead to pick out the bad points of the track through the first part; which is a dip with duckboards raised a foot above the bottom, leaving a space at the sides. It was marvellous to me that I should be able to go ahead and pick out the way, while Ash & Farred were floundering along behind, treading over the edge of the duckboards as often as on it, & causing Stafford & Kollosche, who were bearing, to laugh aloud by their stumbling & smothered exclamations.\n\nAfter about 200 yards the track crossed a wooden bridge &\n\nforms the train track where we should have put the stretcher on a truck & gone ahead pushing. The truck, however, has disappeared; stolen by some ration party, we presumed, despite the printed notice with a red cross is for wounded only.\n\nHurried searching & peering in the darkness, half helped & half hindered by the frequent gun flashes & star shells. Koll found a large truck but it proved to be too cumbersome so decided to carry him to the next relay. Stafford & Koll carried on & I ahead calling attention to missing boards\n\nwith the other two floundering behind. Then I carried with Mick.\n\nAt the next relay two things caused Mick Stafford to indulge in good Australian language: two infantry men – lost – flashing a torch to find the way, on a fairly good track with direct observation from Fritz. Their action was liable to get both us & any wounded we might have to carry severely strafed, not to mention a damaged truck and all the other dangers. He told them all about it \n\nThen the relay bearers, Barlow & Haynes particularly, were a long time getting ready\n\n& consequently the patient had to wait out there in the dark unnecessarily while they dressed or something. Still Stafford told them all about it & meanwhile Ted Farrell stumbling about, fell into shell hole of water up to knee to the great amusement of all.\n\nYet I was secretly glad that I had been enabled to find my way about. My one trouble is seeing at night, and in this game it is very vital, for one will not always have \nthe\n such a track as we have now, which is reckoned good compared to some. It is hard to be a hindrance by reason of a thing beyond ones power, and Ted feels it and so does Hal I expect. \n\nI was glad I got on well, and hope it will always be the same, for otherwise, that is where my conduct rests with myself,\n I have no fear of\n & on my own power, I have no fear of myself. Much as I hate & fear the dangers, as indeed all do for that matter, \nI\n my sense of honour will be stronger than my fear & keep me up to the sratch. As far as the physical endurance goes I find I am far beyond my Gallopili standard now, and can keep going with the strong ones - perhaps nearly as long in a stunt, when I am used to it.\n\nA retrospect is not out of place just now. Returning to the front line after a long absence I am not so nervy as I had feared I would be. Shells bursting near me causes breathless moment, of course, more than when I first came under fire at Angue (when I did not realise the danger) but it is just the temporary feeling that I observe\neveryone\n all, even seasoned ones have. I am in good condition & nerves, though sorely tried by the most worries, are actually improving every day. All appears to be well, & I have no fear of myself.\n\nShells falling near & machine gun bullets whistling overhead\n","20":"\n\nOver a week has passed since I wrote in this book, & a great deal has happened.\n\nI am writing this on the grass outside my ward at No 83 General Hospital Wimmmeriux, (Bologne), on a beautiful warm afternoon.\n\nThe night after the last entry \nwas","21":" was very quiet, but the following day was busy from an artillery standpoint. No cases occurred during the day.\n\nAt about four oclock, as we were having tea, what appeared to be a “dud\" landed in the support benches on the ridge facing our dug out. This was \n\nfollowed by others at short intervals, simply a hollow noise on landing as if the shell had fallen & not exploded. Of course we soon tumbled to it that they were gas shells. The wind was dangerous, for it was light & parallel with our front line, if anything blowing towards our back.\n\nIt soon became evident that it was a systematic attack by gas, yet we had not much to fear \nye\n up to that \nthe\n time, for they were falling some distance away. Soon, however they began to fall closer, & a slight whiff of the gas (like mustard & cress)\n\nbecame perceptible in the air.\n\nThen we put down the blanket curtain in front of the dug our & awaited eventualities, while shells dropped in quick succession all round.\n\nSoon the inevitable happened & we were called to carry a couple of cases down, so out we scuttled.\n\nAt the R.A.P. we found a shell had landed at each entrance & the various dugouts at the back of the pill box, were reeking in gas, stronger to the smell even than outside. Without a thought of putting our masks on, for by now it was dark, & would have been impossible to carry over those duckboards with a mask on, we, Kollosche, Count\n\n& I got away with the first case. By the time had gone half of the way along the first portion of our track, that was the duckboard on narrow trench, we were safe for the time being, for \na ridge\n we had left a ridge between us & the place we had left where the shells were still falling. Without further adventures we got that patient down to the next relay, having to carry him all the way on account of a missing truck.\n\nNothing of importance occurred on the return journey, & just when we were settling down with an uneasy feeling, that plenty of work would come through that night, Koll & I had to take another patient, a walker.\n\nRemarkable to state that was the last we had that night, & we went to sleep in our dug out which was slightly tinged with the gas, \nno\n & did not wake until Harry Barnes came in next morning with the news that a good number of the","22":" Batt. were gassed, above all, -- the Machine Officer Capt Phillips.\n\nKoll & Mick Stafford went down with a couple of patients & I went straight to the R.A.P. where I found to my astonishment that medical details, engineers, & patients had all spent the night in these gaseous dig outs.\n\nNot a medical detail was left to do the work of attending to them, They lay about in various attitudes in the semi dark dug outs, where even the curtains were drawn to exclude fresh air, & a candle fitfully illumined them, some in a stupor, & others sitting up wiping their steaming eyes.\n\nThe Sergeant of the medical details was lying near the table, & he told me, when I had reached the table with difficulty, that a solution of sodie bicarbonate was the best relief for the eyes. Accordingly I set about making the solution, as soon as I had lifted the curtain.\n\nAs soon as the solution was made\n\nI dipped wads of cotton wool in it & gave one to each to bathe their eyes, & at that moment, somebody came along with the news that one of the battalion officers would be responsible for evacuating the men. Without more ado I commenced to get them away, & Koll., Mick, Count \n \n & Farrell, assisted by infantry men went down with them.\n\nImagine a low ridge on the German side of us, & and another to the rear, making between them a kind of gulley or pocket in the ground through which a duckboard track and a small stream overflowing\n\nfrom some shell hole, wander, crossing from time to time.\n\nThe whole scene is desolation, except for various \nduck\n dug outs and the animation of \nvarious\n the soldiers walking about.\n\nSmashed tree stumps are the only remaining sign of nature, the rest is all shell holed, indestructible confusion of dead branches, logs, & smashed in dug outs. A thin wisp of smoke comes from the \ndug\n cook house of the battalion which is to the left of a duck board which crosses the other at right angles & thus goes through the ridge facing us, in a sap, or trench.\n\nTo the right of this junction\n\nof duckboards & right against the one which follows the gulley is an old German pill box now used as R.A.P. at the back of which is the series of dug outs where I found the cases.\n\nNow along the duck board which comes through the opposing ridge, comes a steady stream of men with hands or hankerchiefs to eyes, making for, or being led to the R.A.P.\n\nJust where the duckboard the ridge there is a dug out on the right where one can always get a cup of hot coffee or cocoa, supplied by the Australian Comforts Fund & served out by one of the 9th.\n\nAfter I had \nkept\n got a few of the men away an English Staff Sergt. came along to tell me that he had got some trucks & an engine on the light railway, & that he could take the men right through. I told him to ask for instructions on the way, & if he met nobody to take them right through which he accordingly did with the result that the whole of the cases were evacuated in 1½ hours.\n\nJust about this time a Major Johnson R.M.O. of the 12th Batt arrived as a relief, & immediately provided half a dozen \nstr\n regimental stretcher bearers who helped me\n\nto finish evacuating the gassed men, & then to clean the dug outs free from gas. Then our old friend Capt Grieves arrived to take over the job of R.M.O. to the","23":" & the whole of us retired to our dug out for a rest & a bit of food.\n\nKollosche & Stafford were very bad indeed, suffering agonies from the sore eyes, & the Count & Farrell were scarcely less troubled. Ash & Walton had already been evacuated. My eyes had become rather sore, but they must have looked far worse than they felt, for I had no real pain from them although every body\n\nthought they looked bad.\n\nSoon a new squad arrived to take the place of those evacuated. Snowy Eva was in charge, but the other three were very little better than useless.\n\nFinally Capt Grieves decided to evacuate the whole of the original bearer party except our friend Gregg, the cook, & just when he was writing our tickets out a new M.O. arrived with word from the Col. that we were to be returned at once. He brought up 2 new squads & so we are packed up, & returned to Vermozelle a little the worse for our 24 hours hard labour with gas.\n\nCol Cade came up & spoke a few kindly words of encouragement & appreciation when I arrived there, & after a dressing of the eyes, a cup of soup, & a chat with several of the boys, away the motor went to Main D.S. at Kemmel. A little formality there & then on \nth\n to C.C.S. (No. 2 British) at Ostersteene. We spent the night at that hospital, & the following morning were put on an ambulance train & sped along to Bologne which we reached at dusk.\n\nSunday 17th March\n\nSegt. Lucas of the 9th, in the next bed to me, heard today quite a number – about 19 – of the 9th died of the gas. Rather surprising, and significant, that. Those who had chronic vomiting, & who probably got a bad concentrated whiff of the gas, are among names mentioned.\n\nWimereux is a select village about five miles to the north of Bologne. Select, I judge it, because from this double marque in which I write , our ward , I can see through a side opening, the village perched on an opposing hill.\n\nI have seen it under varying lights and it always has a picturesque and slightly imposing effect\n\nIn the early morning it \nhas\n is a toned down beautiful half silhouette of artistic curved spires and turrets & in roofs & chimneys. The former are the tops of charming houses & the latter, shops & farms.\n\nIn the afternoon & morning the sunshine is reflected from the yellowish white of the imposing houses & the red roofs of the meaner variety.\n\nI’ve found that the imposing houses are the dominating point & in the\n\nmajority, points to the fact that it is select.\n\nThe railway runs in front of the main township, but the trains only flash into view at places as they go through, for \nthey are\n the full view of them is obstructed by sundry outhouses & farms.\n\nFrom Wimereux a hard white road winds down the hill and follows the base of our hill on the side opposite from the sea, & away above this road & another winding one on the large hill at the back, is a large white inscription cut in the turf “Cloire` \nis\n a` Jesus Christ\".\n\nBeyond the continuation of the railway, & a tramway to Boulogne, nothing seems to head the view of the sea just showing over the brow of the hill in front of us.\n\nInstinctively ones eyes always turn to Wimereux when out in the open, for it represents all that is possible of the joys of modern civilisation in the neighbourhood. Yet we shall possible see Boulogne before we see Wimereux, for unlike this camp, the convalescent camp nearer Boulogne holds out hopes of leave.\n\nWednesday 20th March\n\nI am now almost fit for discharge, but I expect two or three days will follow before I do.\n\nThe most remarkable thing in the last few days is the fact that I have read Sir \nolives\n Oliver Lodge’s “Raymond on Life & Death\". This is a very remarkable book, \nfor \n & it has made a great impression on me, for it offers a solution of those pressing injurus doubts\n\nIt concerns his son Raymond and is divided in three parts; the first, letters & anecdotes of Raymond, the second, the reports of numerous seances after Raymonds death, in which messages arrive from him,\n\nthe third deals with the subject of \nphi\n psychic phenomena, including chapters on the scientific outlook of life & death.\n\nFirstly one must allow for a great many things in connection with Mr Oliver Lodge: patient and entirely sceptical enquiry, & then research, for, on the whole about forty years. Vast & scientific knowledge & undoubted integrity must also be allowed.\n\nAccording to the reports of seances, there are several evidential points which occur, and also at least one \npho\n prophesy. Telepathy may account for the evidential points but there remains the photograph\n\nprophecy. A sceptical study of the subject would repay.\n\nWhat a wonderful change in habits of thought if all this is true, if we can get into touch with the dead & be assured of a \nfo\n life after this which is higher & nobler & apparently does not include the gospel of fire & damnation.\n\nThe stumbling block to pursuing thought on this subject, even with evidential reports available, has always been, in my case, the limited scientific knowledge. I could never limit what is known of the universe, and that has an important believe.\n\nAnd Sir Oliver Lodge \t\t\n\nHave just had a chat with the German interpreter of the company of prisoners attached to this place for labour.\n\nHe is educated; speaking Latin, French, English, and can give some really clear ideas of modern German writers. He paints quite a good picture of the treatment the civilians are having behind the line in Belgium & parts of France. These civilians have, he says, have got quite used to them & (naively) “often come to the canteens to endeavour to buy \neggs\n things to eat\". which after all is quite natural.\n\nAs far as captivity affects one he seems fairly \n\ncontented & points out that conditions behind the line are about the same as here. It is captivity without the barbed wire. Then the line itself is – well we know what it is.\n\nSaturday 23rd March ’18.\n \n\nYesterday I asked to be sent out; not from dislike of staying here, but from intense desire to get out into a little civilisation again before returning to the front. Today the doctor marked me for convalescent camp.\n\nAnother little group of acquaintanceships gone west, as is the way of everything in this war. Walton, of course,\n\nwill follow the same round game of Bases with me. If he \nwere\n had a little more individuality he would be more of a companion, but for an ex-parson he is terribly deficient in moral backbone. The ordinary genalities which are all that we expected in the army, good temper, unselfish & gameness, are not particularly lacking: he certainly is more good hearted & generous than I am, It is not a function of criticism \nof\n or judgement of a friend to write the above \n: it is a\n so much as a \nfee\n prompting feeling that otherwise life as I understand it is useless. We must face facts & live by the mind, not\n\nby the standard of other people. Very easy to write & damned hard to live up to ; for that is where the \nmoral backbone\n comes in.\n","24":"\n\nQuite a lot to recall today. Am going to Con. Camp tomorrow, and, judging from what I hear, it should be worth staying in for a few days. If we get paid:\n\nBomb raid over here last night; and one ward was wrecked. Being moonlight Fritz evidently did things in proper style for I heard several machines. There was the usual “Archie\" barrage, and searchlight display by beams \n\n of light of varing length & width; also the chopping of Verey lights from time to time. All this combined to mark the first part of the performance almost like an entertainment. Naturally there were the usual heated arguments about it: which were our machines & which were Fritzs; why & by whom the Verey lights were droped & the usual others.\n\nThen a diversion seemed to be created over our heads a little towards the north: strictly speaking over the railway line. Searchlights flashed on to the spot, wavered, - apparently failed to locate the machines which we could hear, & then a gun opened out.\n\nLooking for the resulting flash, we heard a swish & then \nexplosion\n a flash of great size straight ahead & apparently near the railway. While our minds were groping over the problem whether it was an Archie or a bomb (obviously a bomb, yet the mind seeks to find evidence of what it wants to believe is true) a \ndef\n deafening explosion took place followed by smoke ahead & a rush of air by us. \nAn\n Another problem: \nprop\n wondering if near or further away than it seemed: was Fritz going parallel to us, or towards us? The vital part of the danger and all excitement passed while we were occupied in wondering, for there were three other\n\nswishes, -- Wonder, followed by explosions which caused ones hair to be blown as if by a strong wind, & which also caused some patients to lie on the ground –crouch low, get under beds and generally behave in a “windy\" manner. One of the explosions must have been louder than the others, for one bomb fell about 100 yards from us (or less) while the others were good fractional parts of a mile away. The near bombs fell at the end of a double marquee, one of which it blew to pieces, but, remarkable to state it did little more. Three men had small injuries, just sufficient to get them to Blighty, and the beds and fittings\n\n(including the board floor) were disarranged and smashed about, but that was all.\n\nProvidence\n It was by providence that the majority of patients were in the safe marquee, and those who were in the one which was hit were not in bed.\n\nFritz has been over again today: evidently taking photographs of the hits he scored last night. Another visit from him tonight seems to be quite probable.\n\nI have been in contact with a V.C. hero in the last fortnight, and have watched him with interest. Sgt Lister is a fine\n\ntype of man, typical of the lowly regular man who entered the life out of pure suitablilty.\n\nHe is a Linconshire man, with the Cockney’s diminutive stature & wiry frame. Strong & supple, he is a ju jitsu student, & in his clear blue eyes, pink skin, & alert manner shows good health & clean living. His complaint was gastritis, but apparently his teeth (lost in battle somewhere) account for that, & now he is well & ready to go over to Blighty to receive some addresses, & presentations \n\nI am by no means fond of the senseless hero-worship which prompts silly girls & old women (and some kinds of men) to go over board,a\n\nmedallist with praise & all good things, as to turn his head completely. It must be a terribly hard thing for a man whose photograph has appeared in all the daily illustrated & local papers; who has been entertained lavishly by mayors & councillors & all such people (probably thanking God they were safe from the opportunity to win a medal); who has had females, married & single, hanging on his every word; - it must be terribly hard for him to keep his mental balance. Unless strong minded, he would be apt to think his opinion on military matters (always sought by sychophants) was unassailable; likewise his opinion\n\non all kinds of other subjects.\n\nSgt Lister has a strong mind evidently, for he has kept his balance, and, in the ward, were it not for the V.C ribbon & Belgian ribbon, he wears, he would be no different \nin bearing\n from the others. Certainly he did not mind holding forth on his exploits \nat decent intervals\n once to me & it is only natural. In my opinion the man who shuns every kind of reference to his deeds, and retires from, & is afraid of every man who wants to congratulate him is a rare article. Most of those who pass for such are falsely modest, & go to just the opposite ridiculous extreme to the people\n\nwho hang over the hero. Why can’t there be moderateness in all these things. It is only natural for one to compliment such a man on his deeds, & only ordinary for him to tell what he did to get the medal. It could stop at that surely without making past as hypocritical a farce of the business as the world makes of most other things, & spoiling the good man.\n\nSo I think Sgt Lister is a type of the good old regular soldier, an outstanding personality himself in his devotion to duty, and is not cursed with the virtues of a paragon. He has the little mannerisms of an ordinary soldier, & above all is a perfectly natural man, who is,\n\nafter all saying a very great deal, considering what has already been lavished on him.\n\nThe circle of in here contains interesting types, but I think Sgt Lucus of the 9th, in the next bed to me, is the most likeable & interesting type.\n\nHe is fairly short, & powerful looking without any largeness about his build to be noticeable. With the Australian type of hardened features his \nis substantial\n remarkable feature is the nose in that it is small and out of proportion to the other features. At present the gas has given him even more of a frown sallowness than is normal with him.\n\nIf he has a fault it is\n\nthe fact that he is very fond of carrying on a conversation as his own, and, steamroller-like, passes over all attempts to take part in it. Still he soon adapts himself to listening to anything that he considers worth listening to, as soon as he discovers that he has had it too much his own way. (It is obvious from this, I take it), that I have been talking & even arguing with him)\n\nHe likes to think that he is well informed, and is conversant with deeper things, yet he knows his limit exactly, & only with people who know no more than he does, is he wrongly dogmatic. The tastes that he\n\nundoubtedly has are good ones, & he indulges very little in the filthy & unprincipled utterances that are the base of \n a decent\n the life of a man who has his illusions & ideals left, in the army. As a matter of fact he jokes on such matters, only to a comparatively harmless limit.\n\nHe has no ordinary fear to judge by his appearances, & must be a strong man in his battalion; he is amiable, good hearted, & has a way to get on with us as a man should be. (N.B. If a man is sure to get on with he has no personality).\n\n2p.m.\n\nMore Achie firing, so Fritz having another spy out over the landscape.\n\nThe papers last night told us that what had been rumoured for a day & that was that the much talked about German offensive had at last started, and on a grand scale about a 50 mile front. The “Mail\" goes so far as to say that the deciding battle of the war has been started, & to judge by the German papers it seems probable.\n\nWhat horrors will \nnot\n have been experienced before\n\nthis battle draws to a close. They will figure all out with maximum power in the air, as well as on land & water. If it does continue for a couple of months on an enormous scale there would be hopes of a summer peace, but probably there will be the lulls, & reawakenings to further & more horrible energy\n\nFriday 27th March\n\nMoved into convalescent depot No 1 on Monday by char a banc, & found it none too cheerful because injuries were few, money non existent as far as we were concerned, & food only bare.\n\n The impressions of the camp (which was situated half an hour’s walk from the hospital almost in Boulogne, & near the Napoleon statue) were of countless particulars being taken on countless parades & inspections, most of them run by Warrant Officers \nof\n both of first & second class. Mons star ribbons were \n\nvery common, which suggests that only long service men get these base jobs, & quite right too.\n\nThe adjutant of the camps was a stoutish, pudding faced blusterer of a regular soldier (quartermaster) with whom I had a passage of arms on Tuesday. I had taken an arm off my spectacles & to get a new one obtained a special pass into Boulogne. Once there I called at the pay office, but they refused to pay me. To try to get permission they phoned back to No 1 camp, & received the message that the Adjutant would be pleased to see me at once (?) I returned to camp & he blew me up for \n\ngoing in for money. When I asked him how he thought I was going to get them mended without money, he had the impudence to suggest that I was a wangler!!\n\nNo 1 was cosmopolitan camp, comprising English, Scotch, New Zealanders, Australians, Portuguese, South Africans, Canadians & Yankees.\n\nOn Wednesday we suddenly got orders to move to No 10 Convalescent camp, & so said good bye to our energetic company S.M. ( of many facetious remarks) & the corporal factotum who spoke with the mannerisms of a plough-boy, & the self confidence\n\nof an M.P. (Member of Parliament not Military Policeman).\n\nWe went by “char a bancs (motor) again, and found No 10 the other side of Boulogne (South) & right up against the sea. The latter fact has been painfully evident to me ever since because of the bleak breezes that have been blowing across the base bare sandy parade ground. This is the flat top of a hill whence a winding by-road leads between low coastal hills down to the vast expanse of sandy beach. From the edge of the hills (which are ½ mile from the camp) to the actual sea is about a\n\nquarter of a mile of perfectly flat sand.\n\nWe went a route march there this morning and I noted a little fishing village on the edge of an overlooking sand hill to the right. One or two barge like fishing boats were lying well up the dunes, and half a dozen villagers were pottering about on the sand at the bottom of a wicked slope leading to the village. Even here the atmosphere of war was produced by a couple of blue clad French soldiers with rifles, who were leaning up against the wind, making\n\ntheir slow way southward.\n\nI must write a few impressions of the types of different nationalities one meets in the army. I am rather vindicated in my original desire to return to France, from one point of view at least. I realise that this book is far better than the five preceeding ones.\n\nOn Thursday we went up for classification (Walter & I still together), & I told him I wanted to go to our Base at once as I felt fit. I didn’t really, but this camp had got on my nerves. The parades are not bad, but one is not supposed to be in the hut all day, and the Red \n\nCross hut offers shelter only at midday & after ten, so the only alternative for spare time is to shiver in the open,. Then (& worse still) the food is bad and just sufficient to keep one alive, while there is nothing to be bought in the Expeditionary Force Canteen but tea, bread & salmon. Lastly there was not prospect of pay for over a week.\n\nHe\n The doctor (a fat & jovial South African, in great contrast to the thin “aristocratic\" type at No 1) told me I should have to be looking better, before he marked me A. Then I worked the broken spectacle\n\nbusiness & got a chit to chain money, in Boulogne. That town looked dismal under a heavy rainstorm, & the effects on the people of the late air raids, but I managed to get a reasonably fair time by eating.\n\nVisited a couple of \nthe\n “maisons tolerees\" in the Pare de St. Paul & found them as bad as the worst of Marseilles which are in turn worse than in Cairo, always excepting where blacks are kept.\n\nA man must be very hardened not to feel the effect of the awful hollow laugh of the poor girls who live in these \n\nplaces. Artificial & tragical. Each place was full of soldiers drinking beer. Now & again \none o\n the passion of one would make him pluck up enough bravado to go out with a girl. So on time after time from 12 till 8. \n\nThe battlefield is a comfortable place to live, compared to a brothel, for these girls. They can’t all be hardened, and I can’t believe that \nthey\n any noticeable percentage takes up the life deliberately. Mostly it must be through men. They are punished enough God Knows!\n\nBrought cake & chocolate back to Walter.\n\nCharley Taylor of White ‘s gulley on the Peninsula is in \nhere\n this camp. He went away from the 9th in the early morning of the 7th March with gas, & had a bad dose. He would not be out now, but for his characteristic abuse of a doctor in hospital. The same old Charley Taylor, Lance corporal today & Private tomorrow, hardened cosmopolitan abusive & independent – cynical – brave as a lion & large hearted.\n\nHe, Splinter Christie\n\n & Tommy Depy were pals at Anzac in the dug out next to mine. Now Splinter is in the 9th with Charley, & Tommy is driving a motor ambulance attached to the","25":"\n\nA typical instance. Tommy got up to Vermoziele when he heard Charley was gassed, & slipped 10 francs in his wallet.\n","26":"\n\nThis morning Walter & I struck Sanitary fatigue, which involved shovelling incinerated tins about on a heap under the impression that we were levelling it. Unfortunately (for the fatigue) the boxers were training in a ring established near the scene of our labours, and we watched the skipping and boxing antics more than we shovelled. Finally, in a fit of recklessness (thinking that taking lessons in boxing was a pleasanter way of getting fit, than shovelling tins & attending parades) approached the leader. He was a Sergeant with a \n\nmilitary medal, & to show his prowess sported a huge broken nose & cauliflower ears. He was pleased to hear that I was desirous of joining his class and extended a welcome hand, extolling the joys of being among his elect. His promise that it would not involve being knocked about, \nalthough\n (not invited) was somewhat discounted by the rather poor attempt at a friendly smile that his distinctly hard face made. One can hardly expect to learn boxing without being knocked about.\n\nIn the afternoon we resumed the shovelling, and after having\n","27":" just sufficient work, for it to be barely noticeable, commenced a cross fire of tins projected by the end of shovels after the manner of golfing. Having discovered a rather into method of attack I got Walter to help the other chap on the opposite side of the heap, & set out to beat them. By a set plan of campaign I easily evaded their fire, outflanked them in such a way as to bring Walter between myself & his helper – so that his friend could not fire without putting Walter in danger -- & then it came on to rain.\n\nPlan of the battle. \n\n","28":" Position\n\nFriend X Walter \n\nX\n\nGalley\t\t1st Attack\t\tHeap of tins\n\n\tX myself\n\n\t2nd Position\n\n\t\tX\n\nGulley \t\t2ND Attack X\n\n\t\tX\n\n\t\t\tX\n\nX\t\t\tFinal attack\n\n\t\t\tX\n\nHave heard no news of Kollosche or Dickson & Stafford, & received no letters from the unit.\n","29":"\n\nYesterday – Easter Sunday – we had a church parade in the morning and in the afternoon I volunteered for a job which was done in five minutes, & so had a slack afternoon.\n\nThis morning I turned up at the boxing ring and did some club exercises & swinging, after which the Sergeant instructor – one, Mick Walsh – gave me some hints on how to defend against a straight left. \n\nHe was remarkably patient & not at all anxious to knock me about. I had a little spar with a novice who \nwould\n jab up his right instead of leading a straight left (so that I could counter it). I subsequently learned that he was afraid of my reach, & would not get near me. To counter a certain blow in practice is quite different from doing the same thing in the middle of a busy round when one never knows when it is coming.\n\nWhen two novices are boxing, & sometimes when a novice and a practised man are boxing, it seems to be\n\nand really is I think, a very confused affair.\n\nAfter the usual sparring round, one commences the offensive & always deals a blow different from that which the other is preparing to counter. The other not knowing really what to do, has a little half hearted attack on his own, so that it really resolves itself into each side attacking rather badly, and any old defence put up at all. It is, of course, like all new forms of skill: one knows the object in view, & in the absence of any clear idea how to attain it, follows a kind of cross country route\n\nto attain it & comes a cropper, unless \nhis\n ones opponent is no more skilful, when the strongest man wins.\n\n However I learned a little this morning.\n\nIn the afternoon we collected together some gloves, \nand\n a medicine ball (a football stuffed with rap, for throwing & catching) & also a punching bag, & rallied for the sea shore. There we indulged in antagonistic games with the medicine ball, walking, wrestling & so forth.\n\nBeing Easter Monday there were some girls, out for the afternoon, resting in the sand\n\nhills behind the dune, & naturally they influenced the proceedings. This happened even to the extent of a pass of gloves being used in an attempt to teach one pretty, shy, black gowned girl of 20 or so, the art of self defence. On this account I lost the opportunity of a spar, which may perhaps have been for my good (for the good of my general appearance at any rate), for my opponent was to have been rather low type, of a heavily built individual. He is shortish, very big & heavy, with a long big head, and rather brutish face, & eyes enclosed in oval hollows, so that only black\n\noval shadows can be seen generally instead of eyes. One would expect to meet his type in the east end, probably as is frequent of such places as the Wonderland, or Blackfriars Boxing Ring.\n\nWhat an ideal afternoon it was for training. Very little wind, clear & cool & brilliantly fine, so that the sand, the sea & all nature looked its brightest & best. It was good to be back on the golden sand after a heavy bout, & feel the drying blood burning the face, & rest. War seemed remote, & it really was half a bank holiday.\n\nNot many miles away that\n\nhell exists! Battle for the destiny of the war is carried on – just entering its second stage.\n\nOn the way back we took a short cut across sand hills, where grass & low bushes are growing sparsely. Our feet disturbed the virgin smoothness of the sand; in some places hard, & others soft yielding & in waves driven by strong winds. In one place it sloped away below us at a sharp angle right down to the little grassy creek 100 feet beneath. For the same distance above it slopes away, & we dug our feet in as if walking along some precipice, except that here there was no danger,\n\njust a fascinating inclination to slide down. If we had been children we probably would have done,\n\nMany slightly wounded have arrived from the Somme, among them a Private in the","30":" Grenadier Guards. This is his first trip from the front, excepting leaves, in three years & seven months. Almost a record one would think. Straight through from Mons to the second Somme! \n","31":"\n\nAm writing this in the Church Hut in the Australian Base at Harfleur: the same hut in which I attended a rather inspiring service last October, as mentioned in Diary No 6.\t\t \n\nAs a result of being in the Boxing Club at Ecault I got a pass in common with the other members to visit a certain boxing tournament held at Ostrohove camp near the town of Boulogne. \n\nWe had a man entered & although he by no means had the best of the past exchanges he was lucky enough to win\n\non a foul by his opponent. Sgt. Walsh reporting to the few exchanges said “Oh yes ‘e certainly lost some points, but I wasn’t afraid. He does begin fighting for two or three round. Takes a lot of working up.\n\nThey gave us a good tea & plenty, & we all got in the boxers enclosure as seconds for nothing.\n\nThe Star turn of the evening was a welter weight contest (I suppose welter is about middle weight, but I don’t know) between Albert Moore & Bombadier Donohue. The latter did not turn up till late & at one\n\ntime there seemed a likelihood of a special arrangement whereby Fred (our star) was to step into the breach under the name of Dale (the name of the man with the villainous face) -- \nas part of\n coming to pass.\n\nBy a strange coincidence Corporal Angus of Weymoutn has drifted to the Boxing Club on the day of this affair, & he & I went to it together. He recognised in Albert Moore the son of a Scotch boxing booth proprietor – himself a consistent performer in his father’s concern Angus’s view that what Albert\n\ndidn’t know wasn’t worth knowing was subsequently confirmed, when he – out of financial acuteness entirely, for there was money in it – deliberately set to work to knock his opponent out & accomplished it in about 45 seconds much to the disappointment of the crowd, & the edification of Angus.\n\nNeedless to say both Angus & Moore are Scotch, & to hear them discussing the financial aspect of the days performance, with sidelights on the bad habit of letting non paying guests in (not a word from Angus – business can be viewed from two standpoints always) – was a treat.\n\nFrom No 10 Con Camp we went by char a bancs to St Martin Base Detail Camp, & found it as all the other camps are, on the top of a hill. It was windy, rainy & miserable, also the camp was overstocked with men. This was the result of the rush of Somme men to No 10 which accounted for our sudden departure. \n\nThe arrangements made for food were miserable, so that we had to stand in long queues for every meal. The meals lasted for three hours, so that one almost overlapped another, & all\n\nbecause of the deficiency in accommodation & lack of a system. Generally the queues resolved into a mad rush, & squeezing, jamming & pushing at the door.\n\nThe expeditionary Force Canteen sold tea, chocolate cigarettes & other foods, but here again one had to wait in queues for the best part of an hour generally.\n\nI went into Bologne twice, got some money, & also had one or two food feeds\n\nAltogether I was very glad to fall in on the parade at 4 p.m. to move off for Harfleur even if it was raining hard & I, having lost my hat, was under the doubtful cover of a cup comforter\n\nAfter the normal amount of delay taken up with roll calling set out for the station, which turned out to be North Bologne station – Walter & I still together.\n\nThe train was already comfortably full, so we proceeded to make it uncomfortably so. As most of the occupants of our truck were getting out\n\nAt Etaples, the overcrowding was not for a great distance.\n\nSome of these troops were new drafts from England of the latest class of Yerrington, & those in our truck were lads going to reinforce the H.L.I. I chatted to one young chap, he expectorated (ugly army pattern); I like \nat\n a veteran & he admiring, & anxious to learn.\n\nThere was no hint of reluctance or undue fear about him. I told him that he would find the battlefield no so bad as some people painted it, & he answered that he was fairly sure of it. I judged that\n\nthat was the right tone to adopt, for his type would play the game whatever it was.\n\nIt seems to me that it is not a good plan to paint horrid pictures to youngsters just joining in, for a great deal depends on the outlook right from the jump & from the consequent frame of mind.\n\nHe referred to the fact that he missed his draft leave (they all had) because of the hurried departure, but I think he was more proud of the disappointment philosophically borne, than complaining.\n\nIt certainly must have been hard after the four months training at Norwich away from his native Glasgow to miss the final good bye which means so much to the new soldier -- & more so to the home lad. Why this chap must have been a schoolboy when war was declared.\n\n It was refreshing to chat with such a fellow & to hear his comments on the issue cigarettes, & the \npay\n draft pay which a lot had “spent\" before leaving. Also he was careful, for as often as a hungry & improvident comrade made reference to certain\n\nrations reposing in the truck, my friend replied – “ay! We’d best be leavin’ them tae the morning\".\n\nThey had three days rations & a blanket a piece, which he read as a long railway journey. I read it as detraining at Staples & motor lorrying on to a bridge behind the Somme in the morning, the first part of which proved true.\n\nWhen he has been in the army longer he will know that the powers that be issue blankets for field use, but an overcoat is good enough for a railway \n\njourney. That, at least, is my experience.\n\nWe spent an uncomfortable night in our overcoats; I with toothache (which has not yet left me) & woke to find the train at Romes junction between Abbeville & Rouen. As we got tea from the canteen & bully beef & biscuits from our ration wagon.\n\nFrom then onwards the journey changed from uncomfortably vague to comfortable & observing. The sun shone, the train began to go at a decent speed & before long the like \ntow\n cathedral towers & the \n\ntunnels typical of Rouen, became present tense.\n\nThe view of sunlit Rouen, with Seine sparkling, & the bluffs preen & warmth inspiring, caused Walter to remark that it reminded him of his arrival from Bullicourt by hospital train. It reminded me of the equally pleasant arrival I made at the same place from Marseilles.\n\nLooking out over the peaceful urban view I thought of Boulogne & the bombs, & wondered whether the people of Rouen appreciated their immunity from bothers. \n\nWe stopped a short time at the civilian platform, (normally our halts are outside stations on sidings) & were the of numerous civilian feminine eyes. One spectacled mademoiselle annoyed me because of the sneering with which she regarded us. Possibly her pince nez were responsible for her screwed up nose, & certainly the appearance of myself with lap comforter & unwashed & unshaven countenance was liberal in the way of counter battery work. She & her friend spoke in broken English to a couple of Lothasioss from our\n\n truck. We took on some German prisoners there. I wonder why all the soldiers call Fritz Jerry now. It is quite new, but already popular & general.\n\nArrived at Harfleur Station (another memory of the Marseilles trip) at 2 p.m. on this sunny Sunday, &, then the Australians here separated from the Tommys & we marched off to the camp. Arrived at headquarters we were given tea & bread & dripping by the Q.M.C.A. while we were being sorted out then we set out\n\n \n\nfor our own camp (details) some ten minutes away.\n\nWalter & I recollected the full packed passage over the same road when, to Eva’s & my amusement, Cluogh worked his head & got a ride with the officers baggage, & where also Harry Barnes made a nuisance of himself.\n\nOnce in our own camp we soon got a tent, & then had some tea. Later, in our tent I discovered a chap (whose name I forget – a friend of Cunningham’s) who was in the hut at Pinkhouse with me this time last year when we were isolated\n\nas mumps contacts. He was slightly inebriated when I met him, but instant recognition took place & enquiries about others of the hut followed. I had met Brownings with the 2nd, & heard of Ralph Davidson’s return to Australia with a useless arm, from Miss Brookes. Pearson & Mac are still with the","32":" & I had met . He had news of Oldfields \nwounding\n having been wounded.\n\n Today I met Kite, Sgt Major from Weymouth, two others from Weymouth staff, \none\n three of the","33":" (present\n\nera) men, & one or two others\n\nSgt Binges is waiting to go up the line, & said he wants to go in a Field Ambulance not being keen on a hospital, by which I infer he would prefer a hospital.\n\n"}}