{"Document Name":{"0":"Diary_0132","1":"Diary_0132","2":"Diary_0132","3":"Diary_0132","4":"Diary_0132","5":"Diary_0132","6":"Diary_0132","7":"Diary_0132","8":"Diary_0132","9":"Diary_0132","10":"Diary_0132","11":"Diary_0132","12":"Diary_0132","13":"Diary_0132","14":"Diary_0132","15":"Diary_0132","16":"Diary_0132","17":"Diary_0132","18":"Diary_0132","19":"Diary_0132","20":"Diary_0132","21":"Diary_0132","22":"Diary_0132","23":"Diary_0132","24":"Diary_0132","25":"Diary_0132","26":"Diary_0132","27":"Diary_0132","28":"Diary_0132","29":"Diary_0132","30":"Diary_0132","31":"Diary_0132","32":"Diary_0132","33":"Diary_0132","34":"Diary_0132","35":"Diary_0132","36":"Diary_0132","37":"Diary_0132","38":"Diary_0132","39":"Diary_0132","40":"Diary_0132","41":"Diary_0132","42":"Diary_0132","43":"Diary_0132","44":"Diary_0132","45":"Diary_0132"},"Date":{"0":"unknown","1":775.0,"2":776.0,"3":777.0,"4":778.0,"5":779.0,"6":780.0,"7":781.0,"8":782.0,"9":783.0,"10":784.0,"11":785.0,"12":786.0,"13":787.0,"14":788.0,"15":789.0,"16":790.0,"17":791.0,"18":792.0,"19":793.0,"20":794.0,"21":795.0,"22":796.0,"23":797.0,"24":798.0,"25":799.0,"26":800.0,"27":801.0,"28":802.0,"29":803.0,"30":804.0,"31":805.0,"32":806.0,"33":807.0,"34":808.0,"35":809.0,"36":810.0,"37":811.0,"38":812.0,"39":813.0,"40":814.0,"41":815.0,"42":816.0,"43":817.0,"44":818.0,"45":819.0},"Entry":{"0":"\n\nTuesday\n\n","1":" First day out from Brisbane, fixing up Hospital etc, everything “chaos\". All AMC. men very busy, getting Hospital ready, unpacking drugs & sorting also all sorts of Surgical instruments, all new & freshly packed by Elliott Bros – the order must have run into 4 figures, very interesting to say the least. \n\nHave made the acquaintance of Dr O’Reilly, Nurse Avenell, Nurse McKenzie, all very nice & they are about as popular with us AMC boys as a blooming private. 10 cases in the Hospital up to 3 pm today – most by affects of yesterday & vaccination, one accident on board – man ran a knife thro boot & cut two sinews. \n\nHave passed the Paringa outward & the Empire has passed us badly – very calm only a few sick, tip top myself, eating like a horse, rattling good tucker & plenty of it hope they will keep it up, just got a wireless to arrive Sydney 3 pm tomorrow.\n\nWednesday\n","2":" Very busy all day at Hospital, quite tired, still very calm – quite a variety of sickness already. \n\nArrived Sydney Harbour 3 pm. Great reception by boats – cock a doodling, thousands of people hovering around in boats. Annie-Maud & Mrs Briggs came alongside in a launch, handed up great variety of eatables – much appreciated by L.H.F.A.. \n\nDr O’Reilly called ashore, to be replaced by a returned Major Argyle. Six deserters discovered on board. Strict censorship prevails – have sent several letters overboard, requesting to post. Naval Patrol Boat hovering around all night on guard, arresting any person or boat that comes near, coaling at night. Sydney looks very tempting at night especially White City.\n","3":"\n","4":"\n\n100 Infantry, 200 L Horse, 19 A.G.H. men came on Board at 7.30 am, not sorry either I have handed the Hospital work over to them, they are all returned A.G.H. men, so hope to get out of all Hospital work. Seems strange to see the Possum skins around the hats of the N.S.W. L.H. \n\nLeft Sydney 1 pm – showery. Sent the deserters back to Brisbane. A lot of Boats followed us down the Harbour to the Heads. Ran into a storm about 8.30 pm. Have orders to take charge of Hospital & Dispensary at night from 6 pm to 6 am – rather liked it – one very bad case reported sick 10.30 pm, had to dig out the Doctor & Nurses. Have 7 Nurses on Board now.\n\nFriday\n","5":" \n\nSept or tried to till 11.30 am rather liked night duty – can see a good time & plenty of sleep as I am entitled to sleep till called by the orderly’s in\n\ncase of emergency’s & if I can’t fix them, then have to rouse up Doctor. Going on tonight with 3 N.S.W. AMC men, think we will get along alright – got out of sight of land about 10 pm, saw land again about daylight.\n\n Went down to the Cookshop & had a large argument, result can get anything in the eatable line for self & orderlys at midnight & coffee at 6 am. \n\nVery cold all night – with a fair swell on, have learnt to always give a man a free passage, who is approaching with hand anywhere near his mouth. Still feeling tip top. Have a few cold footers on Board crying to get back to Mother, etc.\n\nSaturday\n","6":"\n\nVery nice day – a mild roll on. Kept very near to land. Had a fair sleep. Hard to realize tis Saturday, will miss the weekend: Would give something to see a paper. Lost sight of land again. Ran\n\nSaturday\n\n6\/2\/16\n\ninto a storm during the night. Just about starting of the Bight. Good few of the Boys Onkaparinga. Have 7 Nurses on Board, we get along very nicely – Capt Rhodes, Major Argyle are very nice – even when I call them at midnight. Bitterly cold.\n\nSunday\n","7":"\n\nVery cold. C. England service at 10 am \nR.C. 11 am.\n No sight of land, doing an average 12 knots. Quite a novelty to see a school of whales – some I should say 30 feet long – quite near the Boat, plenty of sharks. \n\nMy watch has gained 35 minutes against ships time so had to put back. A huge roll on, quite a number of Boys off their “Mungaree\". An average of 20 cases in the Hospitals, also some cases in the isolation ward. Still feeling fit & laughing at the others – no saying for how long.\n\nMonday\n","8":"\n\nVery nice day – very cold- Our floating home is rolling & knocking things about. Plenty to eat at the tables. Canteen Day – unfortunately doing a roaring trade – took £50 first day of opening – sell somewhere about 300 lbs of Biscuits & 200 pkts of sweets etc per day.\n\n All men were called together & were lectured by Officers on the necessity of avoiding smoking between Decks on account of Fire, as we are a couple of hundred miles from shore. My Badge & \n\nStripes obtains for me many concessions in regards to coming & going to any part of the Ship, which is only an Officers privilege – some times see a little too much. \n\nTuesday\n","9":"\n\nVery nice day – windy – very rough. While at Tea, a huge wave came through the port hole & wet every body in the vicinity, all port holes are closed for the night – quite a common\n\nTuesday\n\n9\/2\/16\n\nthing to get this answer to kind enquirys –(By jove I feel crook) & no doubt most of them look it. 8.30 pm took some medicine down to an Officers Cabin & discovered was my old friend from Bundaberg O.B. Patterson L’tenant. A Bottle of J. Walker was produced & despatched – bottle thrown overboard with a weird message therein. \n\nHave consented to take charge of Hospitals etc for the trip from 6 am to 6 pm. Have a case of Mumps & hope it wont spread. Feeling tip top.\n\n12.30 pm Got a shock to find a fellow had scrambled into Hospital, laying on the floor, counting money, refused to take charge of it, feel certain he is either mad or D.T’s. Brought him along deck and pushed him into a place, told Guard to watch him, found after he left a table knife on the floor – Reported this matter to Major Argyle & found Stewards are selling crook Whisky at 15\/- per bottle, probably take some steps to stop same\n\nWednesday\n\n9\/2\/16\n\nLovely day – very cool – quite satisfied the Wandilla is a great old tub, although there is a big swell on. Hope to see land sometime to night, going around the Cape – Land came to view about 3 pm, out of sight again 6 pm, have got around the Cape. Very rough all night – not going to call at Freemantle, going straight to Colombo. Heard the “Warilda\" is about 150 miles behind us – with troops on board. So far we have no escort, but I think they vary the course during night. Have 15,000 Bags of wheat on board, as ballast.\n\nThursday\n","10":"\n\nEarly morning lovely & fresh, but can notice a change in climate, getting warmer, land out of sight. Had our first case of Pneumonia in the Hospital last night, we got no sleep on the quiet. Officers roaring on men for not taking more exercise, instead of laying about, result a couple of hundred men are running\n\nThursday\n\n10\/2-16\n\naround the Deck – or skipping – boxing etc. Self & 3 orderlys were transferred to Deck room as I couldn’t sleep during day down below, too much noise etc, absolutely the pick of the boat. \n\nSea a lot calmer, still feeling OK so don’t expect to get sea sick now. Seems strange to have to put back watch about 20 minutes every day.\n\nFriday\n\n11\/2\/16\n\nRather warm all day, squally about midday, a bit rough again no sight of land – Pneumonia patient still low. Had Nurse Durham up to him all night. Vaccinated about 12 Officers.\n\nAll on board had privilege of drawing 10\/- every body to sign for a shilling, which they didn’t receive, the amount will go towards breakages, cutlery, etc. no breakages 1\/- returned.\n\n 3 cases of Mumps now in isolation.\n\n Recommen Pte Fettel assistant Dispenser as doing good work – Major Argyle appointed him acting Corporal.\n\nSaturday\n\n12\/2\/16\n\nRather hot all day – sea moderately calm, the the old Wandella is rolling badly, I fancy it must be on account of the large amount of water she is carrying, swaying from one side to the other. Have a concert on board every night – mostly hymns. Have plenty of boxing bouts. AMC boys have quite a rep in the boxing line. On average there is a genuine all out fight once a day, only last night a fellow had to have 6 stiches in his lip. \n\nPneumonia patient a lot better. \n\nHave arranged for self & 3 orderlys to throw in 2\/6 per week each for the Head Steward, as he is looking after us so well. Get anything we want, Fowl, pudding, etc. \n\nWhat appears tonight in the west as a planet of about the 4th magnitude is really a grand sight although I think it is the garden variety of evening star that shines on New Farm. Most amusing at 3 am – the engineer must have had too much steam up as they started blowing off – talk about\n","11":"\n","12":"\n\nthe military term (Spring to it) was not in it. There were few that was not on the alert & thought of submarines etc. I’ll admit I got a start myself, & it woke up all the patients. \n\nHave often heard of cutting the air with a knife, one can pretty well do this by going down the hold of a troop ship of any night, it nearly blocks your approach. \n\nVery monotonous on the water, there being no sign of land. Tucker still keeping very good – Feeling tip top but can’t sleep too well during day.\n\nSunday\n","13":"\n\nVery hot – sea very calm. Very few patients in Hospital. About 150 men call at Dispensary twice daily for medicine & dressings.\n\n Two services held, great chanting & singing of Hymns – finished up with a huge bun fight at night. The boys had as much cake etc as they could eat.\n\n Thousands of flying\n\n \n\nSunday\n\nFish knocking about often pick them \n\nuip on deck, they are about 1 foot long & seem to fly at the lights. They have very large fins in proportion, being about 5 inches long.\n\nMonday\n","14":"\n\nVery hot - & steamy – just a fortnight since we left Pinkenba – no sign of land yet, hope to reach Colombo coming Sunday.\n\n It is study of human nature – unvarnished – to walk the deck & observe the different attitudes, customs etc of the sleepers.\n\nA lot of the boys had to do coal lumpers work today, transferring coal from one hold to another, they looked characters when finished. It is the general unanimous opinion this load of troops (with the exception of Sydney) are very well conducted & slightly inclined to take their psalm singing etc rather seriously. The language is also very moderate. All tho at this early date I can see the\n\nNigs at Colombo getting a bad time with the potatoes & onions which are stored on deck – if the boys are not allowed to land.\n\nTuesday\n","15":"\n\nVery calm but heat most oppressive & sickening. Most of the Boys are growing a Charley Chaplin moustache & look very funny. Beyond a few fights on Board, nothing of any consequence to report.\n\nWednesday\n","16":"\n\nVery sick in bed all day. Heavy cold & Dengue – don’t give a continental who wins the war. My temperature 100° pulse 100. As calm as a river & nice cool breeze blowing forard.\n\nThursday\n","17":"\n\nFeel a good bit better, done my shift, although I did not feel too bright. Has left me a very heavy cold.\n\nFor the first time today we got Boat drill, we night men were rudely awakened by the steam whistle blowing – men rushing all roads to don their life belts – Drs - Sisters – Officers, etc all to their alotted places. The A.G.H. men & Doctors – also all A.M.C. men who are on Hospital duty at the time take up their positions at Hospital & also see that each patient is provided with a belt. Field Ambulance & L.H.F.A. men fall in with the Units to whom they are attached. \n\nSaw hundreds of I think Dolphins, they seem to be identical to our Porpoises, but smaller in size, they look just like a lot of pigs frolicking in water. \n\nSea a bit choppy. \na nice cool breeze blowing – from North \nRaining all the afternoon.\n\nFriday\n","18":"\n\nA beautiful day – a fine fresh breeze blowing right through our Cabin, result, we have had the best sleep today since we’ve been on Night Duty.\n\nNo 1 Hospital full 15 beds 3 cases of Pneumonia, very bad, occasionally go off their Heads, think nothing of breaking out of bed & God knows what they would (\nCan’t get any sleep\n if a night they want too much watching). Two more cases of Mumps reported today.\n\nNo Boat drill today. Sea as calm as a lake. \n\nWe were all disappointed at not seeing Cocos Island; we passed it on Wednesday night about 30 miles out. I fancy I saw some flashes of light during night so think it must have been the Light House there. Each Reinforcement in turn have possession of Deck for Cocerts of a night, some very good talent\n\n18\/2\/16\n\ncomes to light & is much appreciated, last night a Ventriloquist, actualled amused us – One of the Sisters plays the Flute well & a few Violins find some very fair handlers.\n\nWe passed the \nLine\n about 11 a.m. but we are sadly pressed for Deck Space, we were unable to indulge in any Neptunic pranks etc needless to add we were all keenly disappointed.\n\nSaturday\n","19":"\n\nVery nice day. Impossible for sea to be any calmer, hardly a wave. A large P & O Liner passed us for Australia 1.30 am, looked very pretty in the distance, all lit up. Another Boat passed about 10.30 am – although only passing, incidents in Civil life, it was quite an important topic today – for a change. \n\nHad some Sports on Deck this evening, 1 mile Race – Tug of War, etc.\n\nSaturday\n\n19\/2\/16\n\nSelf & 3 Orderlys were rudely awakened in our snug little deck Cabin by W.O. about 9.30 am, to pack up our wardrobe & get out – as a Case of measles had broke out & they wanted to Isolate him – we forgot what we said to him – after having a big night & had just got in dream land, I roared to such an extent about not getting any sleep & always being disturbed, that I was going to refuse to act of an night etc – At any rate I bluffed the W.O. & he said well keep quiet & follow me – my home is now in Cabin 95 – One only wants to travel on a troopship to know what a Chuck in this is – quite enough I slept soundly the rest of the day.\n\nTo night Wireless seemed to be calling & talking with Ceylon. I never saw such beautiful sunsets.\n\nFull moon tonight is also charming. Feeling a lot better\n\nSunday\n","20":"\n\nVery nice day & very calm. Had a lovely sleep in our new home, Electric Fan, etc. Very quite on board. \n\nGreat anticipation about going ashore Colombo tomorrow, expect to arrive 9 am. All things being equal – Drs inspections – authoritys to land etc. A party of 20 are committed to my charge, while on shore.\n\nMonday\n","21":"\n\nVery hot all day – arrived in Colombo 8 am. We were just through the fine breakwaters when we heard the bum boats cry of Di Di Di & Ta-a-ra-ra Boom De Ay – etc – all li all li all li.\n\nDozens of the boats offering pineapples – Bananas., the pines were \nEnglish\n variety but of poor size & not nearly the same quality or taste of our own Ripley Queens, the Bananas\n\nwhich open nicely & of a golden yellow, were very nice – but no better if as good as ours, they are like Lady’s fingers, but more of the sugar variety.\n\nThe taking in of water & coal started almost immediately, hundred of niggers are employed in coaling, somewhere about 30 nigs to each coal barge & handle it in bags, very slow I thought, all though some people give them great credit for coaling records. The nigs clothing is very primitive consisting of a piece of clothing extending from waist downwards or wound around the waist; some of the well to do Cingalese do wear European clothing but very few. The \nNigs\n diving for money is of course a feature & without a doubt they are clever in the water, very seldom losing any money.\n\nAfter a lot of wrangling with the\n\nAuthoritys on shore – both military & Medical, the first batch of about 600 were allowed ashore, in a body in barges & had to do a Route March thro the City to the Military Barrack where we halted & all sorts of things are to be purchased. One very soon realizes the Cingalese as a race are born money grabbers & keen bargainers – they generally start off at a price 5 or 6 times its real value & one soon realizes he is foolish to give the price asked. \n\nWe were allowed (my 20 men) an hours liberty to do the City & of course indulged in the oft heard of Rickshaw, some of these nigs would keep up if not exceed the average horse for a couple of miles, we were backing our nigs to race others & so on, some of them would \nbite\n & go like fury. The absence of horses is very noticeable, bullocks take their places – seems to be \n\nonly one sort of Hooded dray with two bullocks attached. A run to Cinnamon Gardens is well worth while – can buy Bunches of Bananas 1\/- Pineapples 1\/- dozen – Some very fine buildings substantial also. Some big retail houses & Hotels. The Barracks are fine buildings, with a permanent staff of some 300 trained men, Cingales, Sikhs & Indians.\n\nSome of our fellows tried to play up but they soon found they were up against trained & disciplined men, who promptly sat on them. The women folk work just as hard if not harder than the men.\n\nColombo seems to be quite a busy port, about 30 vessels lying now, also 2 Troopships returning, one has 600 wounded on – Major Argyle went off to interview, says a great lot of shrapnel wounds & eye wounds & a great amount of crutches are prominent. There are\n\nalso 16 Nurses on board, some of them sick. A contingent Cingalese is being formed here to proceed to the front. Silks & moonstones seem to be the principal purchases by Europeans. Cigars I have smoked I found just alright can be purchased 3\/- per 200 – About 20 men short at night.\n\nTuesday\n","22":"\n\nAll Light Horse men sent ashore as picket gather up deserters, all aboard by 4 pm – the Boob is full awaiting their trial – several men admitted Hospital. D.T.’s – cuts & bruises from rows. I had the chance of going ashore with Major Argyle but felt very sick – sort of Dengue hanging to me for the past week & night work doesn’t improve it. None of the men apart from Pickel were allowed ashore. Nigs in galore around the Boat all day’ diving & selling stuff – coaling etc. \n\nA lot of nigs came aboard yesterday\n\nfor washing & got great quantity & actually had it back at midday today, ironed & fine & clean. We left Colombo at 7 pm, it looked just like Sydney Harbour at night, flashing lights etc. Passed a big liner during the night – Sea very calm.\n\nWednesday\n","23":"\n\nA fine day & sea calm.\n\nA Cruiser appeared on the horizon at daylight & was conversing by morse code – that is flash lights – some of the Boys deciphered it as – give us particulars – your name & business etc. Another Cruiser also appeared later, so have no doubt they are keeping in touch with us. Passed a lot of sea snakes. Big sick parades after effects of Colombo.\n\nDeserters fined on an average 2 days pay & 5 days on Fatigue. C.B. (Confined to Boat).\n\nLand again lost to sight –\n\nSaw some very large whales.\n\nThursday\n","24":"\n\nA nice day & very calm.\n\nSaw a light about daylight, it must have been some part of Indian Coast – Saw a lot of sea snakes – very quiet on board.\n\nFriday\n","25":"\n\nFine day & very calm.\n\nIt is a treat to watch the sun set – more especially when the sea is calm. Most of the Boys have converted their trousers into shorteys. Kept very busy of an night – Having the 2 Hospitals – Mumps – Measles and Isolation to attend to.\n\nBoxing Tournament has started quite a number of willing bouts already – AMC are being represented.\n\nSaturday\n","26":"\n\nVery cool night & day – still very calm – Fire alarm went about 4.45 pm – all hands had to turn out. All the Boats are swung out ready over the side. Most of the lights are put out of a night now. Have two queer cases in Officers Hospital, they see a lot more than they should – they require a lot of watching especially thro the night & I still only have 3 Orderleys. \n\nPassed a ship about 11 pm – fancy she was a Hospital ship. No sign of land yet. I fancy some of the fellows who perhaps were very apt to scoff at Red Cross Workers & AMC men will have a different tale to tell in future, especially those who have been thro the Hospital. They never dreamt that when they are sick – thousands of miles away from home & land, that they would be provided with comfortable\n\nbeds – clean sheets, warm clothing & luxurys in the eating line – all provided by thoughtful humane Red Cross workers.\n\nSunday\n","27":"\n\nVery Cool – a Bit Rough. It was so quiet you would never dream that over 1500 men are on board.\n\nA passing Cruiser at night honoured us with her flashlights. Very pretty looking over the railing at phosphorous – in great quantitys tonight. I notice a lot of stars that I have never seen before & much more brilliant than most of ours. The Southern Cross has disappeared to view.\n\nMonday\n","28":"\n\nRather warm – a lot calmer – Passed several large Boats.\n\nPassed Socotra Islands in the forenoon – Very high & barren. I don’t think they are inhabited.\n\nCape Guardafui came to view about 5 pm, we were quite close to some Hundreds of Porpoises & Dolphins.\n\nSemi finals of a Boxing Tournament took place – two AMC Boys gave a good account of themselves, one got a draw & the other skied the towel after a good exhibition in the third round. Land is lost to sight again about 9 pm.\n","29":"\n","30":"\n\nFairly warm. Very Calm. Saw some half dozen boats, one Cruiser in the distance.\n\nLights of Aden came to view about midnight – also several other light Houses – A very pretty sunset – very red. \n","31":"\n","32":"\n\nVery muggy all day & night, sea very calm. Land came to view about 7 am. Typical Picture book country of Arabian & Egyptian country, very mountainous quite a study in almost every ridge & mount – mostly of a very barren dry appearance. So different to our Australian Country & even the mountains are a novelty – shapes pointed – some conical – some as in terraces – some perfectly round – oval & so on.\n\nFirst glimpse of civilization since Colombo, is to see a business like fort on the Arabian side. I think they said X “Fort Mocha\" – also an inlet or secluded Bay \n thus for cruisers etc to shelter load & coal etc. Then we came to several picturesque Islands – one they said Solitary Islands & their imposing Light Houses or Wireless\n\n(Mocha Coffee)X\n\nstations – Also had the honour of passing today through Hells Gates – passed about 20 Boats of all descriptions – one Z72, with troops on, we took it to be bound for New Zealand with returned wounded, Coal Boats – Auxillary Cruisers – tramp steamers – Blue Funnel Line & so on. The Light Houses at night are very pretty. \n\nX One of the Officers said they heard distinct firing on the shore above Fort – and believed it was the “allies\" engaged in a skirmish as the Turks were trying to break through to the red sea & construct submarines.\n\nVery busy all night in the Hospital – men coming in at all hours – 3 of the crew paraded sick at midnight shift with ptomaine poisoning – One star shines of an night is equal almost to a new moon.\n\nX Don’t know what the Brand was he was drinking.\n\nThursday\n","33":"\n\nMuggy all day – sea just like a river, not a ripple. Have passed a great number of Boats again from the aristocratic looking P & O Line to the dilapidated Garden variety of tramp. No sign of land all day. Was running about all night again, fixing up fellows with all sorts of ailments forward, aft, bottom deck etc.\n\n Pay day today, and every nook and corner has its own line of gambling – From a dollar he don’t head em – to haps – etc.\n\nAm real good cobbers with Chief Steward – result get some rattling good midnight Feed ups. Duck, Chicken, Eggs, Chipped Potatoes, Puddings etc. Tea & Toast at 4 am.\n\nRumoured we will reach “Suez\" Sunday morning – All crimed men working in the Coal Bunkers.\n\nFriday\n","34":"\n\nFairly cool day – Sea just like a pond – About the only startling thing today was the number of new Mumps patients – Both Hospitals full up.\n\nOne fellow gave us a lot of trouble all night – right off his head & couldn’t take our eye off him.\n\nThe Y.M.C.A people have a representative on Board to distribute literature, writing material etc – also preacher & is very popular. This fact reminds me very forcibly that the Red Cross people ought to take a hint of go thou & do likewise – I have not one bad thought or word about the Red Cross its ends etc. – but I do really say the stuff they handle from their own efforts – gifts – patriotic & otherwise & more especially as they are so careful as to checking packing etc that their stuff is not distributed as should be to the very best advantage or cases – very often a lot of their stuff goes into\n\nchannels – that have no claim, the correct way to my way of thinking in further to Public etc is to have a travelling Rep check all stuff out to proper channels.\n\nNo sign of land all day. Passed a good few boats.\n","35":"\n","36":"\n\nA very nice day. Sea a bit choppy. Passed the Rock where some big P. & O. Boat was wrecked. The P. & O. Coy are responsible for the upkeep of a light they have placed there at their own cost. It is only attended to now & again, it carries a certain amount of Sulphur & Keop , drip – drip – sufficient to make a flickering light. The Patient Pte Lyman who gave me a lot of trouble last night still bad. Dr Argyle says it is appendicitis and requested the Skipper to put a bit more steam on – so as to get him ashore to operate on him. The difference in speed is very noticeable.\n\nMumps are still spreading. Started to pack surplus drugs, etc in the Dispensary. An all out Boxing contest took place today between a Rep 14th 2nd & 9th 26th. 9th 26th got a win. It was a £10 wager. Passed a lot of boats day & night.\n\nSunday\n\n5\/3\/16\n\nVery cool all day. Saw land on the African side all day, some pretty shadings, also a very fine sunset. Arrived at Suez 7 pm – it is just one mass of lights at night & a stranger cannot make much out of them. Can clearly make out a Gunboat. \n\nAlmost alongside of us is the - a New Zealand Hospital boat, she looks very pretty lit up tonight. Also quite close is the Troopship Mephistocles, rumoured tonight she has all the troops still on her & for the past week she may be isolated, ot else going to\n\nto disembark them elsewhere, already we have rumours & rumours that we are to go France etc. Very pleased to get a bit news – also to see a Paper. The Gunboats at the entrance to the Canal are playing the Search Light around us occasionally.\n\nMonday\n","37":"\n\nNice Cool day – quite cold night – General Chaos everywhere. First order was – Be prepared to disembark 9.30 am – Had everything ready – then it was found out the authoritys were not prepared to land us that day – so went & carried on my sleep.\n\nTuesday\n\n7\/3\/16\n\nQuite cool – Ordered to be ready at 9.30 am – First batch moved off at 9.30 am – 2nd Batch at 12.30. 3rd Batch 2.30pm – Had no sleep and a heavy night – had some bad cases in the Hospitals – I had to take up duties straight away & get my men\n\nfixed up blankets, rations for 24 hours etc. Took off in Hospital charge for Suez – 26 Isolated cases – 24 Mumps & 4 Cot Cases – My Party moved off with the","38":" 2nd Light Horse – to whom we are attached with Lt Trickett in charge – Left Suez at 12.30 – unknown destination – The troop train consisted mostly of 3rs Class Carriages – Our Party were allocated half a carriage & were quite an important body as we were the only 8 Ambulance men on board – luckily we had no cases of accidents etc to attend to.\n\nFrom the time the train started we began to see wonderful sights & Curiositys & the further we went the more we saw – the Lazy Nig & the Energetic Nig – The desert in itself is one big object lesson, together with the must be seen to be believed Irrigation scheme – The Line thro desert is one straight line & very level\n\nhere we saw thousands of Tommys – Indian – Australians – Horse – Camels – Mud Houses – Asses etc – At 8 pm we just fell out at Zeitoun & after getting all L.H.F.A. Baggage etc, we left the L. Horse for our own Camp – which we reached after 2 miles walk – were issued & Blankets each & camped in a Hut, it was that cold all night I couldn’t sleep – I used to think I knew just a little bit, but am quite resigned to admit as a Queenslander that I didn’t know I was alive. \n\nIt took my breath away at the magnitude of the Military Camps – from one end of the Canal to the other to just Camps & soldiers – Quite a common thing now for me to see Aeroplanes.\n\nWednesday\n","39":"\n\nA nice cool day – cold at night.\n\nHad a day off – Disappeared with the Boys to Heliopolis – saw most of the sights – Visited Luna Park which is an amusement Place\n\nturned into a Hospital – The Palace is fine place & holds I think about 1000 beds – Have hardly got the swing of their money yet – Went into Cairo in the evening – suffice to say Kitchener said it took him 20 years to make Cairo & the Australians have undone it in 20 minutes. I am sadly afraid when next lot of Tourists visit Egypt they will be more than shocked at the Nigs Language.\n\nThursday\n","40":"\n\nQuite cold all day – About 100 A.M.C. men sent at 5.30am this morning for some unknown destination, all the Field Ambulance men who came on Wondilla were sent away. During the day there was a call for Volunteers to go somewhere unknown. I volunteered but was promptly turned down & told there was no hope of any L.H.F.A. getting away – mostly L.H.F.A. in Camp here now – Don’t know why they are retaining all L.H.F.A.\n\nmust be for some special purpose.\n\nHad a squd of men out drilling part of the day. They take things very quietly here.\n\nFriday\n","41":"\n\nQuite cool all day – Revalie at 6 am get on Parade at 6.30. Have a bit of a march till 7.30. Often go across to the ostrich Farms quite close to the Camp. Have had a Fatigue Party all day. \n\nGreat Sensation in Cairo yesterday. An Australian was observed saluting an Officer. Another 17 A.M.C. men came in at 3 am from S. Australia. This is my opinion of Australians – They are seen & heard at every corner of Cairo – in fact Australians predominate in the life here today – They take up all the footpath & most of the road. They smile at & make love to most women – always courteous to aged. The Donkeys & camels will never forget the Australian invasion, for they poke them with their canes &\n\ntwist their tales, - I think if the Stones – Obelisks – Pyramids were able to express themselves, they surely would give the bun to the Australian visitors. They dig with energy and pleasure into the ancient civilized tombs & graves around about Zeitoun & Heliopolis. They bring into Camp Bone & Skulls, which their entrenching tools have unearthed. The Papers here are plainly printed for the Australians, as they are always humouring them.\n\nSaturday\n","42":"\n\nVery cold last night – windy & sand blowing today. Went for a Route march to Matarieh – Visited the well & the tree where the Virgin Mary rested & drank from the well – got a few chips of a tree – a Sycamore Fig – partly alive & dead – The Virgin rested here on her flight from Jerusalem into Egypt. Also visited the Church erected in memory of the Holy Family – wrote my name in the Autograph book, also on the\n\npillar in stone alongside the well. The Chapel is very neat & knatty. Above the altar is the life size of the members of the holy Family – let in to the wall like a bay window. The Chapel is 59 years replacing old one. Visited the Pyramids in the afternoon, it is truly marvellous & must be seen to been realize just what it actually is – a most ambitious piece of work – saw King Kheops & Queen Kheops Tombs, also saw where the daughter of the King was, but could not approach it, as it is on record only one Englishman has seen it & he had to climb by rope. Said to be 4000 years B.C.\n\nKheops really means Brilliant – Its dimensions 451 ft sq 451 ft high – Entrance on the 13th tier of stones. The joining together of the large blocks of stone is what provokes the admiration of everybody. Kings Chamber measures 17 ft by 17½ ft wide 34 ft long – The large Sarcophagus or Coffin – made of solid Granite, has no\n\nornament or inscription, the mummy & lid have disappeared they say it is in the British Museum – There are 2 other Pyramids quite close to the great Pyramids namely Krephren & MyKerinos. Krephren is 445 ft high & MyKerinos 225 ft high. The Sphinx is also quite near here. It takes about an hour to run out in the tram & is a grand run. I had my fortune told right in the Kings Chamber something like this – I am going to be married, will receive 16 days (800 Pts) will be back in Australia 2 months & 13 days from date. Will get some shot or shrapnel in the back, but will get over it quickly, Going to attain a much higher rank – Wouldn’t advise any nervous person to visit the Pyramids – as I suppose only some 75 percent of Soldiers complete the Tour. Had a run around Cairo at night & back in camp at 10 pm.\n\nSunday\n","43":"\n\nAbout 200 Catholics marched about 1½ miles into Zeitour Convent & attended Mass at 7.30 am – This is a very nice Convent & run by French Sisters. We passed around the hat & got a good few shillings for them.\n\nAbout 100 of us took on a half day trip with a Guide named Simon, one of Cooks Reps – There were 20 Cabs employed & cost each man 20 pt. After driving through the rich & poor quarters of Cairo, we visited the Nile, which we crossed by native ferry – went thro Pharaohs Daughter’s Palace, also saw where tradition has it that Moses was found in the Bulrushes by Pharaohs daughter – saw the Nilometer a marble Pillar erected 716 AD. Visited Coptic Church, 600 yrs AD built over the Cave in which the Holy Family rested during their flight from Palestine to\n\nEgypt, the original Gate or door to the Caves still exists in fairly good order, the cave & pillars are very substantial & still intact showing two crib affairs. Visited the Mosque of Amr – which is the Original Mosque, all others being built after this – also the oldest here can be seen the supposed pillars of Justice, where the Ruler used to dispense Justice if they pleaded guilty they were allowed to go free – if not guilty they were ordered to squeeze thro 2 Pillars about 8 or 10 inches apart, if they succeeded they were declared innocent & vice verso.\n\nVisited the tombs of Klalips aso of the Mamelukes – 480 who were murdered & buried in 6 Tombs – The Khalifs Tombs are very gorgeous also all the royal Family – some costing up to £30,000. The entire floor is covered with beautiful carpet & 0ne has to take his boots off or put slips over them. Also visited the (Mosque Ibnail To Loun) 280 ft high – the highest in Egypt, in this\n\nMosque, once a year they commemorate the Sacrifice of Abraham, by offering 8 sheep and one child, here can also be seen wonderful works of art & carving – great heavy doors – inlaid with gold & silver. Napoleon bombarded this place & cannon balls are seen still stuck some six inches in the wall, he took away all the doors excepting one, which still stands. Lord Kitchener has renovated it in parts just to show visitors what it used to look like – quarters are also provided for the women to worship in apart from the men, here can be seen dovetailed arches of marble over the door, very fine work, the man that done this work had his hand cut off, so as that he could not put similar work in any other church. Rumour has it & the marble shows where marble has been knocked to prove a bet between an Englishman & an American of some £14,000 as to whether the dovetailing was a fake, it proved genuine & the American paid the amount\n\n& Lord Kitchener handed same over to the poor authoritys. Each of the doors valued at £13,000. Also saw the present Sultans Palace, a most gorgeous building – armed guards – mounted guards etc. After a most interesting tour we finished by having a good old tea which cot us 10 pt each.\n\nVery cold at night.\n\nMonday\n","44":"\n\nA nice warm day. Went for a route march to the Sewerage Farm – some 3 miles from Zetouin Camp, saw some very fine machinery. \n\nHave a sore heel, I think I have dislocated a small bone, giving me particular amusement – 2 Aeroplanes flying over Camp. Mere detail to see a train of Camels 5 miles long.\n\nNever went anywhere at night, tired & went to bed early.\n\nVery cold at night.\n\nTuesday\n","45":"\n\nForgot to mention also visited on Sunday the dead City – saw where the different companys have been excavating & left the walls standing – it has been covered up by an earthquake.\n\nHave also visited Mena Canp & Mena Hospital which used to be a Tourist Hotel – Mena Camp was the First Australian Camp. They are very particular about travellers down the Canal – you have to get special permits etc. Went for a route march thro Matarich in the morning & to an ostrich farm in the afternoon. Two aeroplanes flying & manouvering all day above Camp – Very hot all day – I can easily manage 3 blankets of an night – On Sunday the English & French people observe the Sabbath – but all works etc go on as usual amongst other Classes – Myself & the Boys went to the Pictures on Sunday night they were not too bad – The Star was\n\nCharley Chaplin’s night out, they go mad over Charley Chaplin here, the pictures are shown in French & alongside on a screen is the translation of English.\n\nThe authoritys are making Artillery units out of Light Horsemen, there are more rumours about this body than any other. They are still hanging on to us L.H.F.A. as a body. Heard a good yarn told by an English Captain at an impromptu Concert last night – this Captain in Cairo one evening was greatly annoyed at not being saluted by Australians – so much so that he pulled up one to make an example of him – Thus – Hi you man do you know that I am a Captain – Lor’ Lumme, just fancy, how are ye – why I’m only a blankey private. The same officer said he hoped we would’nt mind him trying to tell Australians yarns as they had told him some good ones.\n\nHad a ride on a donkey, altho we were digging our spurs in they responded better to the niggers few words of encouragement\n\nor other wise – A lot more A.G.H. men came into Camp from No 4 Auxillary Hospital – no doubt they will make field men of these as there are no wounded coming in at present. 1st L.H.F.A. have orders today to be in readiness to march out. I am glad of this, as it looks as tho the L.H. are going to garrison Egyt & L.H.F.A. attached. Myself & other Boys are seriously considering a transfer to Artillery.\n\n"}}