{"Document Name":{"0":"Diary_0175","1":"Diary_0175","2":"Diary_0175","3":"Diary_0175","4":"Diary_0175","5":"Diary_0175","6":"Diary_0175","7":"Diary_0175","8":"Diary_0175","9":"Diary_0175","10":"Diary_0175","11":"Diary_0175","12":"Diary_0175","13":"Diary_0175","14":"Diary_0175","15":"Diary_0175","16":"Diary_0175","17":"Diary_0175","18":"Diary_0175","19":"Diary_0175","20":"Diary_0175","21":"Diary_0175","22":"Diary_0175","23":"Diary_0175","24":"Diary_0175","25":"Diary_0175","26":"Diary_0175","27":"Diary_0175","28":"Diary_0175","29":"Diary_0175","30":"Diary_0175","31":"Diary_0175","32":"Diary_0175","33":"Diary_0175","34":"Diary_0175","35":"Diary_0175","36":"Diary_0175","37":"Diary_0175","38":"Diary_0175","39":"Diary_0175","40":"Diary_0175","41":"Diary_0175","42":"Diary_0175","43":"Diary_0175","44":"Diary_0175","45":"Diary_0175","46":"Diary_0175","47":"Diary_0175","48":"Diary_0175","49":"Diary_0175","50":"Diary_0175","51":"Diary_0175","52":"Diary_0175","53":"Diary_0175","54":"Diary_0175","55":"Diary_0175","56":"Diary_0175","57":"Diary_0175","58":"Diary_0175","59":"Diary_0175","60":"Diary_0175","61":"Diary_0175","62":"Diary_0175","63":"Diary_0175","64":"Diary_0175","65":"Diary_0175","66":"Diary_0175","67":"Diary_0175","68":"Diary_0175","69":"Diary_0175","70":"Diary_0175","71":"Diary_0175","72":"Diary_0175","73":"Diary_0175","74":"Diary_0175","75":"Diary_0175","76":"Diary_0175","77":"Diary_0175","78":"Diary_0175","79":"Diary_0175","80":"Diary_0175","81":"Diary_0175","82":"Diary_0175","83":"Diary_0175","84":"Diary_0175","85":"Diary_0175","86":"Diary_0175","87":"Diary_0175","88":"Diary_0175","89":"Diary_0175","90":"Diary_0175","91":"Diary_0175","92":"Diary_0175","93":"Diary_0175","94":"Diary_0175","95":"Diary_0175"},"Date":{"0":"unknown","1":1712.0,"2":1713.0,"3":1714.0,"4":1715.0,"5":1716.0,"6":1717.0,"7":1718.0,"8":1719.0,"9":1720.0,"10":1721.0,"11":1722.0,"12":1723.0,"13":1724.0,"14":1725.0,"15":1726.0,"16":1727.0,"17":1728.0,"18":1729.0,"19":1730.0,"20":1731.0,"21":1732.0,"22":1733.0,"23":1734.0,"24":1735.0,"25":1736.0,"26":1737.0,"27":1738.0,"28":1739.0,"29":1740.0,"30":1741.0,"31":1742.0,"32":1743.0,"33":1744.0,"34":1745.0,"35":1746.0,"36":1747.0,"37":1748.0,"38":1749.0,"39":1750.0,"40":1751.0,"41":1752.0,"42":1753.0,"43":1754.0,"44":1755.0,"45":1756.0,"46":1757.0,"47":1758.0,"48":1759.0,"49":1760.0,"50":1761.0,"51":1762.0,"52":1763.0,"53":1764.0,"54":1765.0,"55":1767.0,"56":1768.0,"57":1769.0,"58":1770.0,"59":1771.0,"60":1772.0,"61":1773.0,"62":1774.0,"63":1775.0,"64":1776.0,"65":1780.0,"66":1782.0,"67":1783.0,"68":1784.0,"69":1785.0,"70":1786.0,"71":1787.0,"72":1789.0,"73":1790.0,"74":1791.0,"75":1792.0,"76":1793.0,"77":1794.0,"78":1796.0,"79":1797.0,"80":1798.0,"81":1799.0,"82":1800.0,"83":1801.0,"84":1802.0,"85":1803.0,"86":1804.0,"87":1805.0,"88":1806.0,"89":1807.0,"90":1808.0,"91":1809.0,"92":1810.0,"93":1811.0,"94":1812.0,"95":1813.0},"Entry":{"0":"\n\n","1":" \n\nI commence this at St. Acheul Amiens the 8th of the series at a moment when we are in the midst of a successful offensive. Following on the Marne success, preparations were rapidly made here for a larger attack & in a week from when its first signs were evident, it was launched. Large numbers of guns, tanks & cavalry were brought up with great rapidity & now we see the enemy taken completely by surprise & being severely defeated. No official communiqué have yet been published but we know that the number of prisoners & guns captured is large. Slept well during the day & at 5 P.M. found the wounded still coming in with a large percentage of German. The majority of these were left over until our own chaps were dealt with & during the night we had a very busy time putting the huns through as well as new arrivals. All night long we were dealing with huns and only an occasional Aussie or Tommy.\n\nTruly ‘tis a great effort & we are anxiously awaiting news.\n","2":"\n\nPractically nothing doing at this Station bar an overflow from the new M.D.S. which is established near Villers Bretonneaux. The first paper containing any news gave that the first count was 7000 prisoners 100 guns and an advance of 7 miles. New troops are going forward and everyone most cheerful. Troops engaged are the 4th Army (Rawlinson) comprising English, Australian & Canadian, and a French army, all under Haig’s direction. The papers state that the Communique issued on the Western Front will in future comprise all the Allies combined. News also published that we are going to have a Gallipoli medal issued, all those who landed on the Peninsular being eligible, thus ends a great controversy.\n","3":" \n\nNo wounded coming through as this station has been cut out so that we expect to move forward. Latest reports give 17000 prisoners 300 guns and an advance\n\nof 12 miles. Most opposition was encountered on the sector we just vacated & the tommies had a hard time. Pleased to see that Gt Britain’s effort is now being more fully recognized & published.\n","4":" \n\nOn the move again. Yesterday I got in a store of dressings etc ready for the move and we marched out for Villers Bretonneaux about 12.30 after an early dinner. The road was fearfully dusty owing to the great traffic & the day was hot so the march with our packs was tiring. About 3 miles from our destination we halted for an hour & had tea there by lorry continued our journey, our camp being on the left of the village. It was good to see the activity especially of the railway, trains being used well up to the front. We saw a large number of the captured guns being taken out with the battalion number being chalked on them which was responsible for the capture of each. We also saw a hun staff car being used which had the German eagle painted on it. We pitched camp in an orchard & dug in, I being fortunate in finding a dugout already prepared. The\n\nadvance has continued, the French having taken Montdidier, the number of prisoners now being 24,000 with about 500 guns.\n","5":"\n\nA few planes over during the night but the bombs dropped were not close. Did nothing all day but rest under the trees, in the evening went for a walk over our front line & late no-man’s land. It was interesting but nothing like the ground fought over during the 1st Somme offensive. What bodies there were had been buried & we only saw one dead hun but we counted over 25 horses still lying unburied & the air was thick in their neighbourhood. On the night preceeding the offensive a lucky shell fell amongst 15 supply tanks of ours and 12 were destroyed. It was a wonderful sight. The contents had been bombs, ammunition & petrol chiefly & these exploding, ignited the petrol stored on the others. Huge pieces of metal were hurled for hundreds of yards & the sides of the tanks were bent double from the heat & in some cases the whole structure had been torn asunder by the explosion. It was an extraordinary scene of destruction & must have been a wonderful sight in full blaze. Our\n\nprisoners are busy clearing up the battlefield and I believe that arrangements have been made by which the crops will be harvested, through which the trenches run. One cannot help expressing the thought again & again after viewing these things that the Infantry are the ones who have to suffer the most. We also passed 3 destroyed aeroplanes, 2 or ours & one German, the grave of the German pilot being alongside. The weather is still beautiful. This village, Villers Bretonneaux is in ruins but is quite a big place & very important as Amiens cathedral can be plainly seen from it. ‘Tis strange that the hun did not push his advantage & try for Amiens but I suppose he knew best or thought he did.\n","6":"\n\nComing home last night we had the wind up to a certain extent by the huns being overhead & bombing rather thoroughly. Dozens of searchlights were searching for him overhead & we could hear his engine plainly & there were we walking along the street of the place we expected him to bomb. Altho. outwardly calm we were all ready to dive for the first hole on the sound of a dropping bomb. However he passed overhead & dropped his load a couple of miles further on, the bursts\n\nbeing plainly seen as a fountain of fire, a very pretty sight – to us. As he flew back to his lines he used his machine gun freely, the bullets, tracer, being like red hot stones flying through the air. The C.O. received his orders at midday & I was given the “good oil” so that I could prepare for it. I prepared a requisition to cope with 2000 odd casualties as our division have a rough piece to cut out including Chaulnes. The remainder of the ambulance joined us at 4 P.M. and after tea all marched out for Caix a distance of about 9 miles where we camped for the night in some old trenches. For hours the huns were over raiding but did not drop anything in our immediate vicinity. I came up in a car with my dispensary equipment & on the way up passed the 12 inch naval gun captured by us. It was on the railway & had been marked by the 31st Battalion as their capture but their brand had been painted out and Captured by Australia painted on in large letters. Quite a lot of hun ammunition was about but very few bodies, the majority having been buried. During the night I was informed that two cars were at my disposal to get more dressings with.\n","7":" \n\nSpent a fairly good night & was up at 7 a.m. getting the two cars away for dressings. Sent\n\nC section dispenser for the stuff, a long trip of about 30 miles. The depot will probably move forward now. Spent most of the day resting & sending up gear to the A.D.S. which we had opened at Posieres. Went up myself late in the afternoon & was busy unpacking dressings etc & arranging the dispensary. There were plenty of evidences of the germans late presence such as newspapers maps etc & notices in german were posted up everywhere. We are situated in a corner house containing fair cellars but I doubt their capacity of withstanding a direct hit whilst a hundred yards away we have another place to do walking wounded. Bit guns are near by & he shelled the place heavily before dark, doing so again with heavy stuff about 9 o’clock. As I write this I hear his planes overhead & several bombs have already been dropped nearby, ‘tis certainly an unhealthy spot & the sooner this stunt is over the better. My preparations for it are complete having now ample dressings etc for all purposes.\n","8":"\n\nBefore turning in I had a sponge down & soaked my dirty clothes. Spent a fairly good night being disturbed a few times by the bombs & guns. Washed out my clothing which I had soaked over night & in general put things straight. He shelled the village heavily during the morning & it was decidedly a very unhealthy spot, we being very close up and under observation as a Canadian was using the attic as an observation post. After dinner we received orders to pack up & move immediately. Apparently the stunt was off or not necessary, so we rapidly packed the stuff & by means of the cars shifted it back to our camp near Caix. Had a narrow escape with our cars during the day, one caught fire but it was got under before being damaged. We were all back at Caix before six o’clock & had orders to move out at 10 P.M. Just on dusk we were ordered into the trenches & for two hours were very pleased to stop there as he was bombing heavily & sending shrapnel over, big stuff which at our wide trench cover. At 10.30 P.M. the order was given to turn in & as the worst of the bombing\n\nwas then over many of us slept under the waggons for shelter from the shrapnel which he was still putting over at intervals. Spent a good night or part of one rather, as we rarely get a full night’s sleep in nowadays. A few of his planes were over during the day machine gunning the roads.\n","9":"\n\nAt 8 A.M. we marched off for Hamel where we took over the M.D.S. from the 53rd Fld Amb. 17th Division. They had only been in the line 4 days but had been so severely gassed that they had to be withdrawn, report states that he hit one of his own gas dumps which we had captured. The march was hot & tiring, 9 miles in all, but very interesting as we passed over many of the huns defences. Trains are already right forward & we are using his light railway system & the valley road which we used was already being improved. Marcelcave through which we passed was sadly knocked about, in fact everywhere we could see evidences of the great work of our artillery. We passed along a\n\nsunken road in which we made a large number of prisoners, a strong position turned into a trap by our rapid advance. Hamel resembled the old villages of the Somme offensive, hardly one brick on top of another, speaking volumes for our artillery again. After dinner we took over & the other crowd marched out. All hands being tired I did not trouble about getting any men so with the help of the other two dispensers set to dig out a tent possy, erected a bell tent & fixed up a dispensary store. Had things fairly square by dark when I turned in dead tired & slept until 7 next morning. No bombs we dropped nearby & very probably we will be left alone here as our camp is out in the open away from the village. Have sent a few souvenirs away & have a german officers pack which I would like to get away. An interesting feature of some of Fritzs maps which we have captured is to see our dressing stations marked thereon with a cross & the letters LAZ. He is\n\ncertainly giving us a fair spin when possible in this particular.\n","10":" \n\nUp feeling fit & after breakfast carried on & completed my tent. Then decided to go easy which I did in the morning but set to in the afternoon & squared up my stocks, sorting & arranging etc. also wrote a letter home, the first for many many days. Weather still warm. Latest news gives total captures for one month 75000 prisoners & 1700 guns so his earlier efforts are to a certain extent nullified by our two offensives.\n","11":" \n\nVery quiet so wrote a letter home, also prepared an indent to stock this place up with drugs we having only dressings at present. Interviewed the Colonel about my taking on a job in England for a few months. He said that he was sorry but did not feel entitled to check it & asked if I would accept a W.O.’s job, I told him yes, but that my\n\ngoing to England would not prevent that if he wished me to take the job on, whereat he agreed & I am to see him again. Weather still good & their planes absent so are having a dinkum spell, very few wounded coming through. We have commenced to build a new dressing station here, the present one only being tents.\n","12":" \n\nWent off to Vignacourt to No. 13 A.O.M.S. for drugs, Croney now being off our run. It was an interesting trip as we passed through Corbie, Aubigny, Daours etc places we had seen & been in before the hun started to smash them up. Corbie was well wrecked blocks of houses having been burnt out & the church had received several direct hits but was still standing. Inn Aubigny our late residence was razed to the ground but Daours was much the same as when we were shelled out, with the exception that a C.C.S. is now stationed there & several nurses were floating about. The roads are being repaired thoroughly & munition dumps carried forward. Obtained \n\nthe drugs & had lunch near Piquigny coming home through Amiens. The civvies are returning there rapidly & one group I saw were tearing down the boards with which they had nailed up the shutters on the windows. Lucky are they who return & find the place as they left it, as if not knicked by the hun, they had an excellent chance of it being looted. The parcels which we send home now have to have the contents marked on the outside to try & prevent loot going through as the field censorship is not rigid enough. Saw the colonel again about my spell to England & he is going to recommend it for health reasons, altho he said that if I stopped he would make me W.O. of the Ambulance as soon as the present W.O. leaves he being due for a Commission as 2.M.\n","13":" \n\nPractically nothing doing so during the afternoon two of us went on a visit to the old 1st Fld Amb to see old friends. For hours we were meeting different ones & yarning, also managed to have a swim. It was\n\ngood to see the old faces again and recall old times.\n","14":" \n\nAbout our hottest day. Walked down to the river for a swim during the morning and wrote letters during the afternoon & evening. Received a parcel from N.F. also Australian mail yesterday so all is well. We are moving again but only down to the river as yet & will probably hand over to the 3rd tomorrow. The application for a spell to England was sent through today.\n","15":" \n\nAn extremely hot day being over 90 in my tent. Packed up again today, being once more on the move and I was not in the mood for it being very down and out. Towards evening I felt better & finished packing making an inventory & handing over after tea to the 3rd Fld Amb. Walked down to the river after tea & had a swim. Apparently we are once more about to push the hun, Byng attacking on the Ancre & Mangin round Soissons\n\nIt looks as if we are going to pinch him out of Albert. Tomorrow we move down to camp on the river but may move again at an hour’s notice.\n","16":" \n\nHad the hun over last night bombing & on our left we attacked again, the guns opening up at 5 A.M. Prisoners began to come through early – 1400 with 33 officers was the first count. We also attacked on the other side of Albert & the French near Soissons. Congrats received from Gen. Rawlinson on the stunt just finished. Came down to the new camp & after fixing up the panniers, loaded my medical wagon returning to old camp for lunch. During afternoon left for new camp near river. Had a swim after tea. Had to dig in as we had no possies, my possy is now 6 ft 6 in long & 2 ft deep so should be O.K. except for a direct hit. He was over bombing during the night & at 1 A.M. we opened up with a heavy barrage so expect the enemy counterattacked. A Hun prisoner told us that there are 15 Austrian Divisions on this front. He had lived for 10 yrs in London & was very interesting saying that Aussie prisoners were working on his farm. He was glad to be a prisoner.\n","17":" \n\nA very quiet day being taken up with reading the paper, writing a letter, making the Sgts mess larger and having a swim. The day started cool but warmed up & I appreciated the rest. No word of moving yet. Our 1st Div. total of prisoners is now 2000 with 60 officers. Elsewhere we are pushing the hun back & all appears bright.\n","18":" \n\nPassed rather a poor night. About 10 P.M. one plane bombed our camp with grass cutting bombs. The nearest to my tent was 30 yds another 45 yds & the air was thick with dirt, dust smoke & the smell of powder. Two horses were wounded, one of which we had to shoot during the day. Dozens of planes were over & it was a continuous hum overhead for a couple of hours, quite the reverse of a comforting noise. Rumours of a move again. Had one swim only as have a touch of neuralgia. Sent a req. in for signature. Transferred to a dugout during the day, also wrote some letters. A cool change in the weather with rain.\n\nMonday 26th Aug. \n\nReceived instructions about \n\nmove last night at 11.30 the O.C. just arriving back from the A.D.M.S. Breakfast 7 A.M. to take over A.D.S. on main St. Quentin Rd at 10 P.M. Went up by car about 9 oclock to see what dressings & things were there as a guide for my indent. Found very little but a lot of German stuff as the place was once his dressing station, it being originally one of ours. The best stuff had already been taken but I found German A.T.S. bandages, paper & cotton, & various drugs. The place was in a fearful state, the 1st Field Amb which we relieved having been too busy to do much. On way back called at the M.D.S. at Morcourt & saw a lot of old pals the 1st also running it. During afternoon went into Depot at Daours & obtained a small quantity of drugs etc getting back to the A.D.S. about 4 P.M. Rain during the day. Had word during the night that the stunt we expected was off. One of our balloons & one of Fritzer’s brought down during the day. News very good in paper, we still advancing, 1700 prisoners & a\n\nnumber of guns also a lot of our old Somme positions recaptured such as Grevillers, Le Sars, martinpuich, Pozieres etc. all in 5 days. Went to bed at 10.30 P.M. the other crowd leaving then!\n","19":" \n\nA quiet day with a few casualties from an 8th brigade push. News still good, he’s falling back not being at his own leisure as it was during the old Somme days. Fixed up my store in the morning & went along to the M.D.S, for dressings etc as several back dressing stations had been cleared out & all the stuff brought forward, a wise move & economical, I came across a lot of the stuff I handed over to the","20":" Fld a week or so ago. All prepared now for a stunt on a large scale but latest is that it may not come off. Letter received today from Syd very sad, he wrote it after our retreat & was straining to enlist but still recognises his duty to himself & family rather than to his own inclination. My letters from home are all typical of the writers, I know exactly what to expect before opening them. Syd’s mildly political with mention\n\nof local activities, council etc, keen & satirical at times with an argumentative strain engendered by my letters. Very interesting with a happy view right through & strongly for Australia. Dad’s letters more serious, gives political news with criticisms, religiously answers everything mentioned in my letters & instructive on matters in Australia. Mother’s letters between herself & son, my absence & danger absorbing her thoughts with occasional mention of local people & doings. Fan’s letters specialised on her family. Between the four I get an excellent mail & very regular, never having any complaints in that direction. Just had word that 2 or our bearers have been killed, a shell getting them in an R.A.P.\n","21":" \n\nVery quiet. Rain at intervals. Advance still continues & the hun is rapidly falling back. Since middle of July we are reported to have captured over 100000 prisoners & 1800 guns which must go a long way towards wiping out our earlier defeats. Had one of our cars destroyed today by a landmine but\n\nthe party on board only received abrasions. These mines are fairly common, the enemy using delayed action fuses & all hands are wary. Collected more supplies from the M.D.S. today & sent some forward to the R.A.P.’s. The A.D.M.S. has made our camp his H.Q.’s & we expect a move owing to the advance. Sent home today a parcel containing german drugs etc.\n","22":" \n\nGood weather again. Collected dressings & stores from Daours in the afternoon also went to the car workshops at Petit Camion. It was a good sight to see all the crops harvested & the Frenchies old & young are certainly working overtime, in some places troops are used for the purpose. There are now 5 C.CS. at Daours & two are moving up forthwith to keep face with advance which still continues. Wanting some Sod. Carb. which I had forgotten to order, I went down to the C.C.S. with patients about 8 P.M. & arrived back about 11.30. The night was cool & very dark but the ride was enjoyable, very little traffic on the road. Had a stroll round viewing some german ammunition dumps near, which were well concealed, a second dump\n\nhe had destroyed with his own shellfire. Saw one of our bombing planes which had made a forced landing through a direct hit from an archie, he landed O.K. only breaking the tail.\n","23":" \n\nWe are now the Main Dressing Station the 15th having passed through us & formed an A.D.S. near Estrees about 6 miles further on. Had to supply them with dressings so collected more during the day. Went up by car to see the A.D.S. very interesting country, some of it being the old battleground of 1916 & although grown over still showed the shellholes etc. Dead horses were numerous & the air was thick in their neighbourhood, some had be buried in the shellholes of the road, others were still uncovered, some having been there for months, showing how careless the huns are in this respect, they are distinctly dirty & unsanitary. We captured a large gun near here 15 inch I believe with barrel over 50 ft but I have not yet seen it. The Road has already been mended & trains, broad guage & narrow & telephone lines (permament) have already reached close to the line. There is nothing wrong with our organisation.\n","24":" 1918\n\nWe ceased to be the M.D.S. at 10 A.M. the","25":" having moved forward & opened up near Cappy, the A.D.S. has also moved to the left, our division taking over from the 2nd Division thus bringing us to the Somme again. During the day I forwarded by motor lorry all my drugs & dressings to the new M.D.S. it was a full load. Loaded our waggons during the day ready to move off again. Matters still going well with the advance & a party of over 700 prisoners passed about 5.30. Latest reports are 120,000 prisoners & 2000 guns. Towards dusk, hundreds of our aeroplanes going home fly low over our heads & many do hair raising feats such as looping & flying corkscrew fashion, diving etc. Hun bombing planes over last night but no bombs close.\n","26":"\n\nHad a day of rest awaiting orders which I filled by writing, doing up a parcel for home & going for a stroll after tea. Also had an interesting time watching planes which were using the field \n\nalongside for a landing ground & refilling point. Over 20 planes were down at once, Camel scouts, & were going & coming all day each being fitted with 4 – 25 lb bombs. The major in charge is supposed to be our leading airman with 54 to his credit. One going up during the afternoon tried to twin too soon & struck the ground with his wing & crashed, smashing up the plane. The pilot received a shaking only. Orders through tonight for us to move at 6 A.M. in the morning for Cappy. Visited Harbonnieres & saw a large cemetery containing French German & our own graves. A certain amount of satisfaction is gained by seeing so many German graves.\n","27":" \nReveille 4.30. Breakfast 5 A.M. rather chilly but fine weather. Half of us moved off by charabanc bus at 6 A.M. for Cappy where we took over the M.D.S. from the","28":" Fld Amb. The remainder marched & arrived shortly after 9 A.M.\n\nThe 8th were to move off at midday to open up a new A.D.S. but the order was cancelled & they remained with us. Very busy during the day, especially with walking wounded, the 14th Brigade having bumped a snag. Rumours of us being relieved very strong tonight.\n\nTuesday 3rd Sept. \nVery quiet day. The 8th still standing by & waiting for a further advance before moving forward. Sent up supplies of dressings to the A.D.S. Felt very off colour with one of my severe headaches. Fritz over during the night bombing but nothing was dropped close.\n\nWednesday 4th Sept. \nStill quiet & very little doing. A few gas cases during the night & the car which brought them seemed to bring a lot of gas with it as several of the fellows were sneezing a lot. It was what we call sneezing gas, it being designed to make the wearing of the mask impossible & so allowing a deadly gas to get to work. Practically no cases through. News by paper good, we having penetrated the Switch line, Drocourt-Quéant with 10000 prisoners.\n","29":" \nVery quiet still, weather fine until evening when we had a very heavy storm for an hour. Did nothing but loaf, issue a couple of indents, & have a bath. Could plainly see three large fires behind the hun lines, he burning stores in preparation for a further retreat.\n","30":" \nReceived orders last night for a move, breakfast 6.30. The","31":" moved out first & went as far as Mons en Chaussee where they opened as an A.D.S. whilst the 15th went back to Fay as the M.D.S. We moved out about 9.30 (prior to which I had packed up the whole of the dispensary in bus & lorry stopping at Fay for dinner. We then proceeded along the main Amiens St Quentin Rd, to St Cren, on the left of Mons & slightly in advance of the 8th where we camped for the night to await further developments & orders. The whole trip was over 20 kilos, an actual advance for us of 10 miles & it was wonderfully interesting. The enemy must have retreated very quickly\n\nas our crowd lost touch for a while and now we believe he is back on the Hindenburg line. Huge fires are still burning in his lines & most of his dumps & hut camps we now find burnt out. Crossing the Somme was interesting. The bridges (4) had been blown up but we had temporary ones going & gangs were busy constructing permanent ones again. Here we came upon five of our tanks lost in the March April retreat, all had apparently been too late to get across the river & one had been blown in half. Very little material was left behind in this part except at gun positions, he having had time to either remove or destroy most of it. One of his Gothas was near the road having been destroyed recently. As we were digging in for the night he put 5 shells over near & a piece from one wounded one of my A section chaps, not seriously but he was evacuated. Men coming back from leave had a long walk to catch up to their units, anything up to 20 miles & all along\n\nthe road could be seen men & officers footing it but quite cheerfully, the advance being the tonic. We are now 30 miles from Amiens where we started on August 8th.\n\nSaturday 7th Sept. \n\nStill standing to, waiting for orders. Improved the dugout during the morning & made it watertight & then had a real good rest for the remainder of the day. Several Fritz planes over during the day but very high. Observation balloons creeping up the line must have gone forward since yesterday, practically no cases coming through, 6 passing through the 8th in 24 hours, one of them being our man, for the sector. Beautiful warm weather.\n","32":" \nRain at intervals during the day. Apparently we are not going to open up a dressing station here as today I received orders to hand over to the 8th my supply of dressings etc. This means that my division is being relieved by the 4th Div. which came up in buses last night. We built a mess during the day & improved one dugout the rain finding a few cracks.\n\nTowards evening had a stroll round a wood close by in which the hun had had a large calibre battery, a fair quantity of ammunition was still lying about.\n","33":" Visited the 8th.&did some reading of Charles Lamb essays during the morning. Afternoon walked to “Bouvincourt & Estrees”,5 miles walk very interesting, visited enemy dumps, aerodromes etc etc & picked up a couple of souvenirs. Our division moving out today, we will probably go to-morrow, in the meantime we are having a splendid rest. Mail from Aussie in to-day. \n","34":" Heavy rain all night. At 9 oclock we marched out in fairly heavy rain to Mesnil near the river about 5K. we were properly wet when we reached our destination. After dinner had orders to dig in so decided to make a dugout large enough for three, the W.o.Sgt of A section & myself. Our first job was to collect iron & materials, a big job as we had to carry it some distance from neighbouring trenches\n\netc & it was raining most of the time. Then we chose a shell hole as a start & dug down about 2ft, 6ft wide by 9 ft long. At dark it was only half completed but I slept in it nevertheless. Their planes were over a lot during the night & 3 bombs were dropped close enough for us to smell the smoke and fumes. Monday night was too wet for planes but every other night he has been over.\n","35":" 11th.Sept. \n Went by car to Mons,St Cren &Doingt near Peronne during a hunt round to see if some of my dispensary gear could be found which had gone astray. Found large encampments near Peronne So it will be a hot shop at nights also saw a number of large guns going forward so the bridge must now be properly rebuilt. The front very quiet & we are getting ammunition and supplies forward. Spent the afternoon finishing the dugout, put in a wooden floor & made it light proof which allows of a light after dark, a big consideration\n\nas ‘tis dark at 8P.M. nowadays. All our divisions are round about & our spell will now be taken in this neighbourhood instead of near Amiens as at first intended, rather hard on the men but perhaps unavoidable.\n","36":" 12th.Sept.\nMore rain & cold. Made up my requisitions for the Battalions & set out after dinner with Capt McGlashan who wanted to go to Divisional H.Q.ts. Went via Peronne but the bridge being out of service we had to cross the Somme at Ham passing through Clery. Peronne is badly damaged but has been a fine town with wall surrounding. Shops & all had German Signs out but gangs of men were rapidly making everything shipshape, a lot of salvage being about. Reached Division at Fontaine les Cappy where the A.D.M.S. signed my req. & learnt that V.H. our W.O. had his commission. R.L.K. to W.O.H.C. to W.O. at Dartford, 3 promotions in my Unit. Went to Chuignolles to No.18 Advanced Med. Depot & collected my requirements then home by Amiens-St Quentin\n\nroad,a cold & wet trip, reaching camp about 6.30. Bridges slightly improved over Somme but still insufficient for traffic the delay caused by the large number required no less than 5 on this one road. \n","37":"\n\nWorked hard apportioning out drugs to Battalions & at 11 oclock set off with Capt McGlashan for Amiens, he having transferred to No.2.C.C.S. Once again blocked at bridge so made a detour through St Christ thence back to Villers Carbonnel to Main St Quentin road on to Amiens. Dropped Capt Mc at the station & without waiting for dinner went to a large E.E.C.Canteen for stores.Could buy practically nothing here as a new rationing scheme was in vogue, each division receiving an allowance. Decided to go through to Picquigny as I wanted stuff for a ‘hopover’ to give V.H. a send off. Managed to buy some nuts, wine Butter, soap, tinned milk etc & papers, tried Y.M.C.A. canteen for cigarettes.\n\nbut could only buy 2 tins. Came through Daours (a lively stretch of road here) where I collected some waterbottles at the Depot then Corbie but found the canteen bare, then VillerBretonneaux back to camp reaching it at 7.P.M. having covered about 80 miles. Amiens is rapidly being cleaned up Streets repaired, also telegraph lines, but very few people back yet & no shops. Nearby is a large field where all the guns captured lately are stored & it was a great sight, hundreds and hundreds of guns of all sizes, machine guns in huge stacks also wagons & carts of all descriptions a goodly array. Had a snack for tea, then prepared for our hopover. They had managed to round up a few bottles of whisky & there being an issue of lollies & comforts, in a few minutes we had spread out,- wine whisky, biscuits, nuts, lollies, cheese & bread cigarettes etc, then carefully screened all windows & shot holes in the hut & lit \n\nseveral candles. Then we started, first a drink, then the Chairman made a short speech of congratulations to V.H. & then called on me to back him up, after some of the others had spoken we drank his health, then some songs, V.H. responded then more drinks etc. When all was going merrily Fritz came over but we defied him & carried on although, we were in an unrivetted hut & he was overhead- about 9.30 we finished up & came outside in time to see the sight of a lifetime – two huns being brought down. The searchlights picked several gothas up & the firing was intense when suddenly one burst into flames & fell headlong. Not half an hour after, another one came down a 3rd. one being brought down later, a night of extraordinary good fortune. \n\n;Saturday","38":"\n Great news for the lads. Six passes through for Australia, definite at last that we will get home. V.H. going today we set off about 11 & went via Peronne to the \n\nC.C.S. at Proyart, calling to see the Big Gun captured by us & previously mentioned. Truly it is an extraordinary gun, destroyed by a premature burst, over 50ft long 15”calibre & tremendous mountings set in Concrete. A tree in front was all blackened by the firing but it had apparently burst soon after it was mounted. Had dinner at the 15th Fld amb. By extraordinary good fortune we found a car about to go to Boulogne so V.H. went by that, I had previously put his two pips up so he was taken into the officers mess at the C.C.S. Saw him off the returned to Chuignolles, picked up some wants & returned in time for tea. Had our photos taken this morning with a couple of cameras still carried by a couple of the chaps. Managed to buy a paper with news of Yankee hopover at St Michiel, so far they have taken 13,000 prisoners & nipped off the Salient, a good start.\n\nSunday 15th Sept.\n A beautiful day. Busy all the morning going through my section gear \n\nmaking a list of shortages for the new 2.M. Had a bath during afternoon & read some papers a good afternoons rest. Rumours of us going in again. Latest official figures of yanks stunt is 20,000 prisoners & the British since Sept 1st have taken another 20000 odd, good going. Billy Hughes drove past yesterday & meeting some of our chaps shook hands all round, he is very enthusiastically received. During the day we had some balloons brought down, I saw two but rumour hath it that the number was 3. Splendid mail in from Aussie, 11 letters & a parcel from home, a real treat, a bright moonlight night so expect the loches.\n\nMonday16th. Sept.\n Practically no huns over strange to say. last night Had a quiet day and did some washing and writing. Rumours of a big stunt coming off in a few days and we are getting ready by dumping stuff so as to travel light. The 8th & the","39":" have also dumped one sections gear in our camp. I believe the main roads are closed each night now for tanks coming up & probably cavalry.\n","40":" 17th.Sept\n A beautiful day. worked on my sections gear during the morning. Fritz not at all active last night & those who did come over appeared to be turned back by our defences. No news through.\n\n","41":"\nPrepared a req. and left about 2AM to collect the stuff at Chuignolles calling at division on the way to get the A.D.M.S.signature.Learnt there that the 1914 men would all be away by autumn but that 1915 men had not yet been considered so my turn is still in the dim & distant future. Good news through of the stunt but no official figures, our 1st &","42":" Divs are in it. News from Salonika states that the Serbs & French hopped over & captured 4000 prisoners & 30 guns, still going strong.\n","43":"\n very quiet. No further news. Busy all day issuing drugs & dressings, also did up a couple of parcels of rubbish for home.\n","44":"\n Weather cool again. Played & beat","45":" Fld. Australian rules. Paper news good, on the front prisoners now number 10000 & our\n\n \n\ndivisions in, get good mention, Salonika stunt also still going. Saw confirmation in papers of the bombers brought down the other night. The notice stated that the 3 of them were huge bombing planes and carried a crew of 8 men & bombs of 13 ft length with explosive weighing 1 ton, they were shot down from the air. 10 more passes through for 1914 men to Australia to go on Monday next. \n","46":"\n Yesterday Mr Norwood of Adelaide, Y.M.C.A. gave us a very decent lecture on Australia, an excellent & humorous speaker. weather cold. Went along to Div. Baths & had a hot shower during the morning & wrote letters & read Charles Lamb the remainder of day. Rumours of success in Palestine.\n\n;Monday 23rd.Sept\n Our leave men for Australia went this morning. Mr.Norwood gave another lecture on possibilities of Australia, excellent. Colonel arrived back tonight from a months leave in England. Did my washing also wrote a letter & did some reading. \n\nnews through of a great success in Palestine 18,000 prisoners.\n","47":" 24thSept.\n had yarn with Colonel, he had had a good holiday & now intends to apply for Australia leave, he being a 1914 man. He told me that he had tried for a post in England for me as a spell & that it would be arranged. In the afternoon went to collect drugs & then on to Bray- Sur-Somme with some mail for our chaps on their way to Australia. There I had an exciting hour meeting old friends, Comrades of the old","48":" Field & chaps I had not met since Lemnos Days. Several times I was hailed in the street & all wanted to know why I was not of their number. It will be a glorious trip for them. Excellent news through of a big attack at Salonicka & Palestine. On arrival home found orders out to get ready for the line so had a couple of hours work fixing things up, then the W.O. who was going on leave informed me that he had orders to hand over to me so that I will be acting Warrant Officer until he returns. This will mean heavy work if we go in the line\n\nas many N.C.O’s are short owing to the 1914 men going away, there are also 34 men on U.K. leave & the unit is much understrength. \n\n","49":"\n Carrying out duties of W.O. Prepared lists of bearer squads etc & very busy trying to rake enough men together Officers & others treating me well. Helped the other dispenser until he got a grasp of things & will now leave this work to him as all is square. Grave trouble over our 54th .Battalion. Each brigade has 4 battalions & it has recently been decided to reduce the battalion to 3. In our division the 54th. were chosen to be disbanded but the men refused to go. All officers & N.C.O.’s left but the men have since carried on in the camp,keeping excellent order, drilling etc & doing everything as if their Colonel was in charge. What will happen is hard to foretell as sympathy is with the men owing to their good conduct, their reason for the refusal being that they would lose their traditions if they were split up & probably\n\n reinforcements such as Carmichaels thousand would remake the battalion. Their R.M.O. is now with us also all their medical supplies.\n","50":"\n Usual W.O. duties, taking parade, making up rolls etc. Excellent news of Palestine, over 40,000 prisoners, said to be a fourth of the total Turkish forces, a great stroke for Allenby. The 54th.Battalion matter has been settled, the heads giving away & now I have to send their medical gear back after I had distributed it. Some nuisance. The RMO & other officers return to the Battalion in the morning & I hope this giving way will not have a bad affect on our discipline. We may move now at any moment. \n","51":"\n Had a busy day fixing up the move. At 10 A.M. sent 40 men to the battalions & then arranged remaining bearers into Squads etc. At 2P.M. sent of remaining bearers & completed loading of transport, filling watercarts etc. Troops moving up all day. Tea at 4.30. Parade at 5P.M. & had all pits filled, camp cleaned etc. & men all ready in full\n\nmarching orders. Told off waggon guards. At 6.15.AM. moved off at 6.30. general parade &moved off at 6.30. After going 2 miles we were halted by road control officer, at assembly point, the immense transport on the road making him necessary. It was now dark and our proper place being alloted to us after sundry units had passed, we continued on our way. The night was cold & dark & our way was hard to find, it being at times across country. We reached our destination about midnight near Hervillers, having done about 16 Kilos, where we slept in various gun pits and trenches. Had to post a picquet for gas, enemy aircraft & to stop tanks from crossing trenches where our fellows were sleeping. Tanks were going forward in large numbers & many planes were about but few of the enemy’s bombers.\n","52":"\n Breakfast at 8.30AM. then erected 5 tents to cover everyone as it was raining & cold. Large numbers of troops about, all pointing to a big push. Prepared a requisition for medical supplies with which to open an A.D.S. & sent off 2 cars to collect same at Chuignolles. Prepared lots of men in order to be ready for all emergencies but we are woefully short of men, the unit being weak besides\n\n34 being on leave. At 6.P.M. sent off 3 men to A.D.S. to act as liason. 7 P.M. the Colonel explained the move so that I would know what preparations to make etc but great secrecy is being maintained. The Yanks about 50 000 strong were to attack at 6 A.M. on the stretch of canal which runs underground & advance 4000 yds, English troops at the same time attacking on the flanks to the Canal itself. At 5.00P.M. the Australians were to pass through the Yanks & attack with objective 4000 yds ahead again, at the same time attacking the flanks & so widening the salient. Great opposition is expected as ‘tis a critical part of line & the enemy is known to have strong defences. We ourselves are relying on tanks & massed artillery to smother his guns. Our own, ambulance, movements are to be governed by the advance & we expect to open up an A.D.S. in what was the enemy’s front line. Turned in about 9.P.M. being called out once to send a runner to Division. Bombing planes were active & one dropped bombs close by. One exciting incident was when our searchlights had an enemy plane in the light & one of ours was attacking it. The bursts of tracer bullets could be\n\nplainly seen until he was chased over his own lines, unfortunately he got away. Very cold. \n","53":" 29th.Sept.\n Breakfast at 8AM. then had all tents struck, camp cleaned up & ready to move off to Templeux, there to await the attack to develop. At 6AM the barrage had opened up heavily & it was not long before batches of prisoners began to arrive. Arrived at Templeux about 11 A.M. & saw large bodies of cavalry moving forward also tanks. Passed some dummy tanks, designed to deceive enemy planes. Soon news began to trickle through & it was not the success we had hoped for. Altho. a fog had helped the Yanks it also hindered them, as they lost touch and failed to “Mopup” machine gun posts properly & to organise, a mistake expected of green troops. The Australians were thus forced to enter the lists earlier than expected & met a certain amount of opposition from these isolated posts, so that instead of moving forward as expected we remained at Templeux, only sending forward small parties of men & supplies as wanted. Our Colonel was \n\n \n\nplaced in charge of evacuations forward & soon organised matters so that the line was cleared before daylight. He shewed great capability and energy. For the night those of us who were left, dug in & spent a fair night notwithstanding the cold & rain. During the day Templeux was heavily shelled but we, being 200 yards out of the village, escaped damage. At midnight I was called out to arrange for a waggon to get away up the line & it was raining hard then.\n","54":"\n Received several orders from Colonel for sending men to various positions & we are now so split up that ‘tis quite a bookeeping job to keep lists shewing where the men are & what men I have available. Long service helps me in this. Late reports are that the situation is clearing, the Aussies having the situation in hand.\n","55":"\n Last night sent 8 men to help the 8th Field as they had been busy. General work during the morning & sending stuff forward. At 2o’clock the Colonel asked me to get together sufficient gear stores dressings and men to go & open up a forward\n\nstation & then decided that I had better take them. In ¾ hour we were on our way with 3 cars & passing through Gardicourt & Bellecourt came to a quarry, a part of the Hindenburg line, across the Canal. There we found deep tunnels where I set to & fixed up a dressing station. A lot of dead were lying about, mostly American with a few Australians & several german. Some were still in the position in which they had fallen on the side of the road. Also passed a german gun which had been hit killing some of his horses, dead horses were plentiful in other parts. We fixed up the Station & soon wounded began to arrive but slowly. We are very close to the line, too close were it not that an advance is expected. The place we are in was an Electric Station & the engine, dynamo & switchboard, an american one, still remain besides a number of accumulators & electric lamps. The place had only been taken the day before so we are quickly on their track.\n","56":"\n Decided to carry on with four men & remain up all night thus allowing\n\nfour to sleep. We had two germans through who had been out for a couple of days & one man I gave chloroform to while the M. O. tied some arteries. Cases came in slowly during the night & just as well as with four men it was a fearful job carrying them down steep stairs into the tunnel and then up again into the car. Had about 25 through. Felt fresh after a shave & breakfast. About 10 A.M. the 6th Fld amb arrived & I had to make out inventory lists of everything I handed over. This took me time as stretchers blankets etc were all over the place & I had to do most of it myself. At 11 I handed over & then had some lunch after which I loaded our own gear on our 4 cars & set off to open up a new post about a kilometre out of Bellecourt which turned out to be an old trench. Here we formed a post to treat walking wounded cases only the possy being the trench with a tent over the top. Fixed all this up & then decided to turn in as I had a fearful headache. After 4 hours got up & after managing to carry on through the night returned to bunk which was a small dugout. Had one man wounded coming through Bellicourt our casualties\n\nfor the trip now being 3 killed & 3 wounded. Tomorrow I am told the remainder of our 1914 men leave. A great deal of talk about a chamber of horrors in the Canal tunnel, several declare that ‘tis a boiling down works of the enemy when his dead are rendered down for fat, too hard to believe but several have told me that they have seen it with bodies actually in the vats. Had a look at the Canal near where it enters the tunnel, ‘tis very deep down, the sides being steel & nicely wooded, altogether a beautiful sight with a fine stone arch bridge over it, which somehow has escaped destruction, yet had received several knocks.\n","57":"\n up about 7 & had orders to prepare for leaving almost at once so pulled down our tent & loaded most of our gear on the cars. Sent it off to our waggon lines. In the meantime the 2nd Div. had hopped over & the hun was putting a few shells over close by. By 10 we were all on our way back & on arrival learnt that a few shells had landed in our camp killing\n\n5 horses & wounding 3 men. The 19 men returning to Australia had just left when the first shell lobbed so were lucky. There I took over the camp again, had it cleaned up & handed over excess gear to the 5th Fld. & shortly after marched off to our new position near Jeancourt about 5 kilos away. Arrived here we made camp in some banks & old trenches & by nightfall were comfortably fixed up. Our strength is now much reduced what with men on leave casualties etc., 37 having gone to Australia & 34 on UK leave, we can only collect 50 bearers instead of over 100.\n","58":"\n. Had a good easy day having a bath first & then washing my clothes. We had orders to stand to as reserve to the 2nd Div. but fresh orders came out at night for us to move out the next day, naturally we were pleased.\n","59":"\n Called up early by the O. C. to have the move explained & then had a busy time getting ready to move off at 9:30 am. The transport was late but we were in good time\n\nto take our place in the brigade column marching out. At Hervilly General Hobbs reviewed us marching past & later sent a message expressing his pleasure at our appearance, pure kidstakes. As the march was about 12 miles the O. C. sent most in the cars which after dropping their load returned to meet the column so that few of us marched more than half the distance. We came back to Le mesnil, our old camp & I am in the same dugout altho. for a time the Colonel said he wanted it. We spent some time reloading the waggons & are now practically ready to march out again. The O. C. has asked me to take on the Q. M. S. job which carried the rank of W. O. Class II 14\/- per day & it might come off.\n","60":"\n Under orders to move again to our rest area. Finished loading the waggons & sent off our surplus drays to the depot as our transport was limited. Made out entraining slates & fixed all for marching out. Orders came out after tea to entrain at 5AM next morning, the transport to go at 9:30 P.M. Had a\n\nquiet day with plenty of time to arrange matters.\n","61":"\n Slept in the mess until 2.30AM & fairly warm as we fixed up fire. Called the lads out at 3.A.M & all hands had a drink of cocoa. We marched out at 3.45 A.M. the transport have left the night before. Marched to Peronne Station 3 miles & entrained in the usual trucks which still had manure in them from the previous occupants – horses. The trip was slow & cold but we dug up an old tin & made a fire, the coal being obtained from an engine which conveniently pulled up alongside. At one stop the lads did some bartering for souvenirs from German prisoners who gave things for cigarettes. Passed through Amiens & Langfries where we branched off & detrained at Oisemont, having passed through some fine country, the lads being in good spirits at the prospect of a rest. Detrained at 1 P.M. & had a hot drink arranged by our billeting Officer who had gone on ahead. Heavy rain for a few minutes. We then marched off to Maigneville & reached it at dusk, everyone being disappointed in the place through being\n\ntired & hungry the place being very poor looking, wet & dreary. The billets also were poor & the men very wrath. I was dead tired by the time I had seen everyone billeted.\n","62":"\n A very trying day. The billets were spread over the village & it was about a mile to do the Round. This I had to do several times, arranging extra billets, all left to me as the officers went away for most of the day. Had breakfast at 8.30 & parade at 9.30, the men marching to a central position. Arranged each section to do its own cooking, thus causing competition, the men gaining by improvement in cooking. I was billeted in a room at our mess, a fine bed & spent a glorious night between sheets. Things much more cheerful by daylight, but on the whole it’s a poor place for a rest, the roads being poor & extras hard to get, no shops & only one estaminet. Fixed up a reading & recreation room, arrangements having been made to obtain books & such things. Arranged for Canteen with a Sgt. in charge which will be an improvement on our late canteen\n","63":"\n Things being more settled had an easier day. Our O. C. Colonel Thompson left today for Australia & I had to parade the N.C.O.s for him to say farewell. He is a wonderful organiser & C.O. his chief failing being a bad temper. Had an inspection of billets & then made out a billeting return. Cars went off to collect Canteen supplies, also things for recreation purposes. 7 more men off for leave & my turn is due but I have postponed it until I have leave to Nice otherwise I would miss it, the Nice leave may be given any day now. Confirmation of my promotion to W.O. II came today, temporary as yet, but I get the payment. I will be pleased when our W.O. returns & I can get to work properly in the new job.\n","64":"\n Rather a quiet day so I spent most of my time in the Q.M. Store getting into my new job. Great preparations are being made for recreation & educational classes etc., a man of ours, McAllister, being very\n\nkeen on it &has drawn up a scheme to find that it has been chosen \n\n as a model for the A.I.F. Weather mild again.\n","65":"\n Matters very quiet. The W.O. returned yesterday & I handed over to him so now am only concerned with the Q.M. job. We are all very comfortable altho. the village is not of the best. Have applied again for leave to Nice & am getting my things ready for the trip\n","66":"\n Matters very quiet. Some talk of us going to another village, this one not being suitable for an ambulance. Ran into D.A.D.O.S. & Comforts Fund for some things & managed to get some Lucy Hinton, an Australian tobacco & much appreciated, also collected water test cases from Engineer who had them on loan.. Drove the Ford myself and enjoyed it. Called at A.D.M.S. to enquire about my leave but there is no hope for about a fortnight.\n","67":"\nAbout 3 oclock went for a walk \n\nto “Gamaches”, 6 Kilos with Roy who returned to the Ambulance again two days ago after an absence of 12 months in England. Had tea there, steak & chips, the steak I bought myself & the woman of the house cooked it splendidily. Enjoyed the outing. \n","68":"\n Ordinary duties in the Store also returned some surplus equipment to D.a.d.o.s. Made a Kit inspection of the Unit in order to find out what was wanted & issued some things out. After tea one of our new Sgts was evacuated to Hospital at Abbeville so two of us went in with him, afterwards calling on the Sgts mess to see some old friends. It was a perfect home of a place but full preparations had been made for raids, the tents being revetted & trenches dug for shelter. Saw several of the houses which had been bombed. The trip in was delightful, the moon being full & the air keen. Just as we reached town the steering gear gave way, a fortunate time, as previously we had been travelling easily 30 miles per hour along the main road. Arrived back feeling fresh at about 10.30 P.M.\n\n \n","69":"\n Mail arrived at last so started to answer some letters home. Very little doing.\n","70":"\n More letter writing . Had a bath at night & carried on & washed the things I took off, as well as some sewing. Weather improving.\n","71":"\n A very busy day as we were making an inventory of our equipment, doing the 3 sections panniers. Also issued out shortages & winter clothing such as cardigan jackets. Had a letter from C.P. on his way to Aussie which told of the great reception General Birdwood received at Bray. He was chaired and emptied two fountain pens signing his autograph. One fellow wrote in the dust of his car - Birdie, the boss digger. He was very moved at his reception.\n","72":"\nVery little doing. Went into Abbeville during the afternoon to collect the drugs. Both dispensers are on leave so I am dong the work. Went up to the Hospital first & saw some friends after which I collected my stores and then returned for tea. After tea\n\ntwo of us went into town & booked seats to see a show given by “The Grousers” the","73":" divisions concert troupe. It was first rate & had a full house several nurses, W.a.a.c.s. & French girls being present. I saw the same company at Reninghelst just about 12 months ago. It was a fine treat to me. Strolled round after & bought some postcards for my nephews & nieces & then picked up the car in the square & returned home\n","74":"\n Did very little but prepare the indents for the battalions. Weather much improved. Beginning to feel ready for my leave now as when we first left the line I was not a bit anxious. War news good, all the Flanders Coast now ours also Lille & surrounding towns & the hun is reported to have lost 5000 guns. He is still fighting well & is retreating well and methodically getting away with most of his material. 500,000 civilians have been liberated being so many more mouths to feed, an extra burden on Gt Britain. \n","75":"\n Ran into Abbeville by\n\nthe afternoon sick car. Spent about an hour strolling round the town buying some papers and postcards also had a look at the church, a fine large building, plain but massive inside, windows few and medium. Had tea of omelette bread & tea for 7.3. then went round to the new Theatre where the Anzac Coves were playing. My friend knew some of the performers – we spent an interesting half hour yarning and watching them makeup. The show itself was first rate apart from the first half. It was a farce entitled Saa Eeda Digger & dealt with incidents of Cairo 1915. The jokes were good and topical, reference being made occasionally to Sydney & Melbourne. Set off home about 9 P.M.\n","76":" 27thOct.\n Spent a good part of the day wading through old files of receipts etc trying to draw up a statement, (which will hold water) of why we would not return the equipment asked \n\nfor our shelling out at Dramontri eventually was blamed for the major part; Destroyed by shell fire, being a good gag. Had a short stroll with Roy, mail coming in slowly.\n","77":" Oct;\n Very little doing so wrote a few letters home & cards to the bairns. a beautiful day, the best for a month past.\n","78":"\n Went to D.a.d.o.s in the morning at Oisemont & collected stores also called at H.Q.ts to enquire about my leave. After dinner out again, this time to Longfres to the Aust. Red Cross where we collected stores & extras of various kinds for sick etc. Called at Corps D.a.d.o.s to see Sawyer but he was away. It was a long trip of about 40 miles & we passed through Airaines, a biggish place.\n","79":" \n Weather changed again now wet. Wanting some Para. T. vaccine I borrowed the Motor bike & went to the 15th\n\nabout 6 miles away to collect same, roads were slippery but enjoyed the outing. In the afternoon we were inspected by the G.O.C. General Hobbs, he expressed great pleasure in the appearance of the Unit, saying that the transport was the finest in the division. After giving great praise, he broke the news that in a fortnights time we may be in the line again as a great drive was about to be made. ‘Tis quite possible & feasable as French soldiers from the village on leave have been called up. This may prove the final hit which will settle the hun. My pass for Paris is through dated the 6th Nov. so will try & get away on the 4th.\n","80":"\n Feeling off colour headache etc. Very little doing, weather fine, rain during the night. Rumours of a general raid being made so many fellows being A.W.L. Cases are not few of ‘holdups’ & sandbagging etc.\n","81":" 2nd.Nov.\n News through of Turkey having surrendered, this time ’tis dinkum whilst Austria is rumoured to have done so. The dagoes have captured most of their artillery & thousands of prisoners so, they may cry enough at any moment. An ultimatum will now probably be given to Germany after which no quarter will be given. It must end soon now and finds me unable to realise the fact. Pulled out 42 Francs out of a game of PackaBo last night. Very little doing except to issue clothing.\n","82":" 3rd.Nov\n A very quiet day. At 4.30, 10 of us went by car to Blangy about 6 miles away for a dinner & mild hopover & had a good time. There was nothing flash but with the help of Bacchus & two pianos we had a real good singsong until 9 P.M. when we set off home, two of the ten being stretcher cases. Manage to get them home safely so all ended merrily, cost was about 30 francs.\n","83":"\n News through that Austria has signed an armistice. My Christmas Cards arrived today so all is well, also Australian Mail, so that I can go on leave tomorrow with a clear mind. Busy during the day inspecting gas helmets and at night addressing all my Christmas cards.\n","84":" \n Fixed up things at the Store ready for my leaving & put an extra Cpl & man in. Managed to get a car to take me to Gamaches where I caught the train to Paris at 11.30. Fare 5.20 1st Class & after a slow trip reached Paris about 5 P.M. In Paris Miss E. Rout a New Zealand Y.M. rep. met the train & conducted us to her hotel where she dispensed advice & information re trains etc. also care in contracting V.D. speaking quite freely & insisting on us taking “outfits” to give to others even if we did not want them ourselves. We then caught the tram & booked rooms at the Astra Hotel, Caumartin St., my room with bathroom & all complete cost 14 Francs a day. Had a wash up before dinner which we\n\nwanted badly as had had no dinner, cost 87. wine and coffee extra. Completed the night by going to the Olympic Music Hall some very good turns. Bed 11.30.\n","85":"\n Up at 8A.M. had a glorious hot bath & then went out without breakfast. Visited the Hotel D’Lena where our Pay Office was but found that I could not draw pay without getting my pass stamped at the barracks. Had breakfast and a haircut here then went to the Barracks for the necessary stamp arriving back at 12 o’clock when I drew £14 making my wad about £ 26. It was raining hard so decided to leave Paris & go to Nice that night . Had lunch in the Boulevard Haussmans 6 Francs, then went by bus to the Gare du Lyon where after some trouble I booked a seat in the Rapide, the express all 1st.Class, tips being necessary. Returned to the city, visited a couple of places, one being d’Eglise St. Sulpice. Returned to Hotel paid for my room 14F.& 1-50 as luxury tax. \n\n(Tax de luxe) Had tea at Duvals near the station Boarded the train about 7.30. still raining, & we pulled out at 8.5 P.M. Slept well during the night having a good seat. \n\n","86":"\n Not having a watch I went along to the Restaurant car too late for breakfast & by no inducement could I get anything, would not sell me bread even, so I commandeered half a loaf from a basket at the door & made a good breakfast off it. At midday went along & had a first rate lunch at a table with Americans, one a woman being very decent to speak with. My carriage had now been taken off so had no seat for the remainder of journey. At 4.30 went & had afternoon tea with an Aussie & two Yank officers with whom I remained & had dinner at 6. By that time the Car had filled up with Khaki & a number of French officers were very wroth at their inability to get in which amused the yanks hugely. At 7 P.M. we reached NICE & went to the Hotel Britannica, a reasonable place, 12 F. a day That night went to The Eldorado theatre taking \n\na youngster from the hotel, it was a good show but of the french variety. During the evening it was announced that the Kaiser had abdicated but it was taken quietly, the National Anthems of the Allies being played with cheering after each. Some lads from the street attempted to push their way in but were ejected after a few windows had been broken. Turned in about midnight my companion being tight.\n","87":"\n Up feeling fresh & after breakfast, the typical french one, a roll & coffee, went out to explore the town. Bought a guide book & strolled around viewing the shops, very fine & called at the Y.M. where I had a cup of tea & cake, buying some views for home. Returned to hotel for lunch. After lunch walked to the top of a high hill called the Chateau, which divides the port from the remainder of the town. About 92 metres high a wonderful view could be obtained. The coast here runs due E to W. Facing the sea\n\non my right lay the great part of Nice with its red roofs & white walls & on my left was the port of Nice surrounded by its warehouses & villas interspersed amongst the trees of the surrounding slopes. Entirely shut in by hills the climate is wonderful & even, being renowned the world over, the Cote d’Azure being a byword. ‘Tis a lovely view, the beautiful blue of the sea contrasting with the town, the pebbly beach & broad promenade lined with innumerable splendid hotels dividing the two. On the beach fishermen were mending their nets & washerwomen were drying clothes which they had spread on the pebbles. On the summit is a large tablet with arrows pointing to all the capitals of Europe & most prominent of the Mountain peaks. Returned to the Y.M. for refreshments & booked a motor trip to Monte Carlo for next day. Dinner at hotel at 7 & then did the town, quaffing drinks at the Cafes on the Boulevard & watching the gay scenes before me. All races seem to be\n\nrefreshed, Italians being in force from the old part of the town. American soldiers, mostly officers, predominate, 3000 being on leave there usually whilst occasionally Australians & New Zealanders can be seen rubbing shoulders with the French in their Reds, blacks and greys, African Chasseurs in their Yellow Khaki & Red Fez & Italians in their green grey. The yanks flash their medals like the French. Several Polish soldiers also present mostly from America, being now in a special regiment with the French. \n","88":"\n up at 6.30 A.M. fresh as paint & after usual breakfast went to meet the car for 8 oclock. it was late however & we arrived at Monte Carlo too late to see the Gaming Saloon. it was a glorious trip the road being cut in the face of the cliff & winding in & out in some cases passing through tunnels. Acacia, Moreton Bay figs & other Australian trees were plentiful. Arrived at Monte Carlo we visited the Theatre in the Casino, a very gorgeous place, seats about 600 with a private \n\nbox for the Prince of Monaco. Then walked to Monaco and visited an anthropological museum with Roman antiquities, prehistoric relics, mostly from the principality, next the Cathedral rather fine, built in 1874 & then on to the Oceanographic Museum which the Prince built to house his wonderful collection of marine animals & apparatus for collecting same. Underground are several aquariums with curious fish living under natural conditions, which can be seen easily all very beautiful. Returned for lunch 6.F. then returned & went over the Palace of the Prince, rather good but nothing special after which we strolled round the place and returned by motor at 4 P. M. The day was warm & it was a splendid outing. After dinner collected a friend at The Queen’s Hotel & did the town. Soon we saw evidences of some Jubilations. This time dinkum word had come through of the Kaiser’s abdication & soldiers stationed in the place, mostly african Chasseurs\n\n \n\nran a torch light procession with several bugle bands. The people went silly, dancing & singing & soon we were right in it with a girl on each arm. I hopped with the best of them, round & round the town until 10.30. We then went to the theatre and left for bed at midnight.\n","89":"\n I had arranged for an alarm clock, so at 4 A. M. was preparing for a long day. At 5 A. M. I met 4 friends & a guide & we caught the 5.30 train for Grasse, fortunately I managed to get a cup of coffee & roll on the station. The trip was slow, about 3 hours, but very picturesque being through the hills with occasional views of snow capped mountains. The slopes were terraced to aid cultivation. At Grasse we had breakfast then visited the church which was interesting only. The town had the old narrow streets of about 6 ft wide. We then went through the perfumery works & found it interesting, having the\n\nwhole process explained & later sampling the finished project. Did not buy any, the prices being excessive. Next caught a tram to Le Bar walking on to Gorge du loup, a lovely spot with waterfall etc & fine restaurants. There we had dinner a splendid spread with local wines which are renowned. We were seated on a balcony overlooking a stream & I thoroughly enjoyed it. After, I visited a shop to purchase some postcards & had a great yarn with the proprietor, a horticulturist & collector of stamps, who became very friendly on my giving him some Australian stamps. He gave me some extra postcards, also a bulb of some famous lilly which he had grown. Had tea here & caught the train back at 6 and reached Nice about 8.30 P.M. Did the town for a time & turned in at midnight.\n","90":"\n Decided to do Monte Carlo again so caught the 7 oclock train &\n\nreached there at 8.30. Had a breakfast of 2 rolls & coffee & entered the Casino sharp at 9 oclock. It was very grand & I visited all the tables, the private rooms, seeing some of the tables in motion & the theatre again. ‘Twas very beautiful, ceilings painted & decorations etc first rate! Next went into the Hotel du Paris, the grandest in the place. We then took the Funnicular railway to La Turbie a height which overlooks Monte Carlo & the view was magnificent. An old Roman town here was very interesting & traces of the fortifications could be seen by which thus part was prepared for any invasion. An English nurse we met advised us to visit an old Monastery at Larghet so we walked to the village & were well repaid for our effort. The church was covered with crude pictures representing accidents etc from which people had escaped & their faith in the virgin was thus demonstrated. They were extremely funny & we spent an amusing half hour\n\nover them. Inside were trinkets & photos left by people desirous of aid & a number of crutches & leg supports of children, left behind by people who visited the church & went away cured. The Curé was very renowned & people visited him from all parts. Had lunch at the local inn & very decent, the proprietor being quite excited by our presence.\n\nCaught the train back at 1.30. where people were beginning to get excited from the news of the signing of the Armistice. Bunting was appearing everywhere & we were greeted on all sides by happy smiles. We caught the tram next to Mentone with a host of Yanks & all along the route we were cheered lustily. There we met cabs which drove us to the Italian frontier, about 2 miles away where we amused ourselves by walking into Italy & purchasing Post Cards which went through the Italian\n\npost office. Returned to Mentone, witnessed some processions & joymaking & caught the train back to Nice. Had dinner at Hotel & then went uptown to be in the celebrations. The Aussies, being tired of being taken for Yanks, lined up with an Australian flag & paraded the streets. They gave us a wonderful reception, Vive l’Australienne coming from all sides & we were pelted with confetti whilst some French buglers in front & half the population tailing up behind, we did the main thoroughfare singing Australia will be there. Dancing & kissing was the order of the night & I sought my couch at 1.30 A.M.\n","91":"\n Had breakfast in bed & got up at 8.30. Went out to the Y.M.C.A. & collected my bread tickets & some sugar then did the town for the last time before returning to the Hotel. Here I had an early lunch, paid my\n\naccount & then caught the train at 11.15. Felt rather seedy from the night before. Managed to get a seat in an observation car as far as Marseilles, the others being booked up over 4 days before. It was a pretty trip along the sea coast most of the way, the car enabling me to see both sides. Had afternoon tea on the train & reached Marseilles at 6 P.M. where detrained, as I had decided to stay there a day. Booked a room at an hotel then had dinner in an adjoining restaurant after which I roamed round the town watching the people celebrating the victory. Processions were everywhere & represented Greeks & Italians as well as French and one great success was a French soldier who marched at the head of a large following, with a stuffed eagle which he occasionally punched & swore at, I saw him later when the poor eagle\n\nlandmark for miles, being the first thing I saw when coming from Egypt the tower being capped with a huge golden figure, very striking. The inside is of marble & gilt work ceiling, the walls being hidden however by almost 2000 tablets after the same style as the Larghet church. They each represented a thank offering for some recovery from a sickbed, accident, childbirth etc and were from all nationalities. In addition are numerous models of ships, medals swords & banners relics of war etc. Descended again & walked along the docks to the suspended Punt which is such a landmark. Tis a huge bridge actually high enough for ships to pass under, & the punt is suspended being worked by electricity. For 1 Franc I was allowed to walk up stairs to the top; cross over & descend by a lift. The fare across in the Punt is\n\na halfpenny. My next call was the Cathedral on the water front & I found it rather a splendid one. Constructed on the plans of St Sophia at Constantinople, it is not yet finished but is really magnificent as it is. Beautiful mosaic work is everywhere. Marble of different countries abounds, several windows being of transparent marble in place of glass. The architecture is Byzantine. A small church alongside dates from the","92":" Century. Returned to hotel, collected my baggage & after a cup of coffee went to the Station. Could not book a seat so had to stand & had rather a rough trip to Paris, feeling the cold very keenly. Had dinner on the train, very good, 11 Francs.\n","93":"\n Arrived in Paris at midday and felt it cold after Nice. Had lunch at Duvals near the Gare de Lyon then went back to the Hotel Astra &\n\nbooked a room for 10 Francs a night collected a couple of letters asking me to call at my friends & after a wash up, went out to see how things looked. Paris was looking gay with bunting & large crowds were still about the German guns & trophies in the Place de la Concorde. They had several aeroplanes, numerous guns, a tank Balloon, in fact everything one could think of. People amused themselves by pushing the guns round the streets & a number of the Schools had commandeered guns for themselves, the authorities being very lenient. Then went to Passy & had dinner with the Dobbevitchs arranging to meet them the following day.\n","94":"\n Supposed to return today but decided to take some extra time in order to see a procession on Sunday & complete my programme. Spent most of the morning doing up some parcels of postcards for home then went by tube to Saint Marcel to\n\na new Hospital de la Pitie, very modern, where my friend, a lady Doctor, was working. Went back to town & had lunch later booking seats at the Opéra Comique for the Tales of Hoffman. Then went to Montmartre in order to see the Church Sacre Coeur from which a splendid view of Paris could be had – if it was clear, unfortunately this time it was not. Returned to Passy for dinner, later taking a taxi to the theatre, which I enjoyed immensely.\n","95":"\n First went to the Leave Club in the Place de la Republique to see what was doing. Had a second breakfast here & then took a trip to Versailles & a seat at the Opéra House two things which I wanted to do. Left for Versailles at 10.45 & visited those parts which I had missed on my last trip. Unfortunately many of the valuable pictures had been taken away to Bordeaux for safety but what\n\nremained were good & the wonderful work inside was worth seeing. Saw a wonderful table made of tortoise shell inlaid with Bronze also two paintings which appeared as statues & cannot be copied today. Other notable things were pictures of battles, the glazing gallery, the chapel etc. etc. Visited the Congress Room in which the President is elected every 7 years & many of the sittings of the Versailles council have taken place. The grounds were uninviting, the statues being covered over as protection from bombs but we visited the Grotto of Apollo, rather a fine thing. Ice was on the water & it was bitterly cold. A photo taken of the party turned out very well & I sent a couple home. The dinner we had was very fair, the whole trip costing only 12 Francs. Returned to town & I had dinner at the Club for 2½ francs & very good for the money, later meeting\n\nthe theatre party & going to the Opéra being conducted there by a representative of the Club. We had paid 14 Francs each & had one of the best boxes in the house, probably a concession so it paid to go per means of the Club. Aida was the piece & it was wonderful. Magnificently staged, the Egyptian scenes were great & this combined with the good music made it very enjoyable. The building itself is a sight of a lifetime, rightly renowned the world over. Marble staircases on a huge scale communicates with each floor and a promenade room of great length & beauty is very popular between Acts. Gorgeously decorated & brilliantly lit with immense chandeliers, one could gaze at it for hours. Finished up the day feeling well satisfied with things in general.\n\n"}}