{"Document Name":{"0":"Diary_0176","1":"Diary_0176","2":"Diary_0176","3":"Diary_0176","4":"Diary_0176","5":"Diary_0176","6":"Diary_0176","7":"Diary_0176","8":"Diary_0176","9":"Diary_0176","10":"Diary_0176","11":"Diary_0176","12":"Diary_0176","13":"Diary_0176","14":"Diary_0176","15":"Diary_0176","16":"Diary_0176","17":"Diary_0176","18":"Diary_0176","19":"Diary_0176","20":"Diary_0176","21":"Diary_0176","22":"Diary_0176","23":"Diary_0176","24":"Diary_0176","25":"Diary_0176","26":"Diary_0176","27":"Diary_0176","28":"Diary_0176","29":"Diary_0176","30":"Diary_0176","31":"Diary_0176","32":"Diary_0176","33":"Diary_0176","34":"Diary_0176","35":"Diary_0176","36":"Diary_0176","37":"Diary_0176","38":"Diary_0176","39":"Diary_0176","40":"Diary_0176","41":"Diary_0176","42":"Diary_0176","43":"Diary_0176","44":"Diary_0176","45":"Diary_0176","46":"Diary_0176","47":"Diary_0176","48":"Diary_0176","49":"Diary_0176","50":"Diary_0176","51":"Diary_0176","52":"Diary_0176","53":"Diary_0176","54":"Diary_0176","55":"Diary_0176","56":"Diary_0176","57":"Diary_0176","58":"Diary_0176","59":"Diary_0176","60":"Diary_0176","61":"Diary_0176","62":"Diary_0176","63":"Diary_0176","64":"Diary_0176","65":"Diary_0176","66":"Diary_0176","67":"Diary_0176","68":"Diary_0176","69":"Diary_0176","70":"Diary_0176","71":"Diary_0176","72":"Diary_0176","73":"Diary_0176","74":"Diary_0176","75":"Diary_0176","76":"Diary_0176","77":"Diary_0176","78":"Diary_0176","79":"Diary_0176","80":"Diary_0176","81":"Diary_0176","82":"Diary_0176","83":"Diary_0176","84":"Diary_0176"},"Date":{"0":"unknown","1":1814.0,"2":1815.0,"3":1816.0,"4":1817.0,"5":1818.0,"6":1819.0,"7":1820.0,"8":1821.0,"9":1822.0,"10":1823.0,"11":1824.0,"12":1825.0,"13":1826.0,"14":1827.0,"15":1829.0,"16":1830.0,"17":1831.0,"18":1832.0,"19":1833.0,"20":1834.0,"21":1835.0,"22":1836.0,"23":1837.0,"24":1838.0,"25":1839.0,"26":1840.0,"27":1841.0,"28":1842.0,"29":1843.0,"30":1844.0,"31":1845.0,"32":1846.0,"33":1847.0,"34":1848.0,"35":1849.0,"36":1850.0,"37":1851.0,"38":1852.0,"39":1853.0,"40":1854.0,"41":1855.0,"42":1856.0,"43":1857.0,"44":1858.0,"45":1859.0,"46":1860.0,"47":1861.0,"48":1862.0,"49":1863.0,"50":1864.0,"51":1865.0,"52":1866.0,"53":1867.0,"54":1868.0,"55":1869.0,"56":1870.0,"57":1871.0,"58":1872.0,"59":1873.0,"60":1874.0,"61":1875.0,"62":1876.0,"63":1877.0,"64":1878.0,"65":1879.0,"66":1880.0,"67":1881.0,"68":1882.0,"69":1883.0,"70":1884.0,"71":1885.0,"72":1886.0,"73":1887.0,"74":1888.0,"75":1889.0,"76":1890.0,"77":1891.0,"78":1892.0,"79":1893.0,"80":1894.0,"81":1895.0,"82":1896.0,"83":1897.0,"84":1898.0},"Entry":{"0":"\n\n","1":" This new edition of my diary, the 9th of the Series I commence at a time of victory, a victory which is a culmination of over 4 years hard fighting, the turning point being a short four months ago. In four months, the situation has developed from a critical period into complete victory & Germany, following the lead of Bulgaria, Turkey & Austria has completely surrendered. With the prospect of an early return to my folk in Australia the future looks bright.\n\nHad arranged to see the procession to be held to commemorate the liberation of Alsace Lorraine so went to Passy to pick up my friends. Had lunch there & then via the Bois de Boulogne went to the Arc de Triomphe & Champs de Elysees where we saw it pass. Composed mostly of Civilians who had collected into various societies in 11th Street, which here meet, they wandered rather than marched to the Place de la Concorde where perhaps 2,000,000 people congregated. A \n\ncontingent of British Soldiers with Australians made a good show & a large number of Yanks with Y.M & Red Cross workers also made a good show. Much enthusiasm was not shown until later but a number of aeroplanes stunting overhead made the people very excited. All types of machines were represented, the scouts flying low whilst some affixed magnesium lights under their wings which looked very pretty leaving a trail of fire behind. It being cold did not wait to hear President Poincare speak so returned to Passy for tea when I said goodbye to my friends. Had dinner at the Leave Club & then did a tour with 3 others later taking part in the jollification & celebration which was now at its height in the Boulevards. They were dancing singing & kissing all they could & girls would snatch our hats & several times I had to race\n\n3\n\nafter mine. Demure dames would asked to be kissed saying, thank you & Vive l’Australien etc until it became a settled program to kiss every female who came along, no matter who she was with. French officers with a wife on arm would pilot the said wife in our direction & so on. This went on until midnight when I was tired to death & had had enough. Up at 6 in the morning.\n","2":" the day of my return & had to rise at 6 in order to catch my train. Paid my account, tips etc & caught the 7.45 A.M. to Gamaches which I reached about 12.30 reaching my unit an hour later. For breakfast I had 2 small rolls so enjoyed a good dinner which I was fortunate enough to find ready. Found that we were under orders to move to Germany so had to get into the collar immediately\n\nNothing said about me being overdue.\n","3":" Set about fixing up things for the move, making up lists and sending back to salvage, all we could possibly do without as we expect to do a lot of marching.\n","4":" Very little doing as we are still marking time in connection with the move. In the afternoon had a kit inspection in order to see that all the men had all their requirements. Did some writing at night having received a huge mail on my return.\n","5":" Spent the day issuing clothing etc & making arrangements for the move.\n","6":" Made up several indents for things & then after dinner took a car & went to D.A.D.O.S at Oisement with them & also collected some gear. From here I went on to the Red + Depot at Longpre where \n\nI collected some comforts such as tinned fruit cocoa 7 milk, rabbit cigarettes & tobacco. Very cold trip. Writing at night for dear life as my pass for leave to England has come through.\n","7":" A very busy day. Spent all day loading wagons, hard work as I find I have to do most myself to get most satisfaction. Receiving the best of treatment from the O.C. he referring to me concerning everything for the move thus making it much easier for me. Our Lt Q.M. is in England on 75 days leave, he having left during my absence in Paris. More writing at night.\n\n ","8":" Should have gone on leave yesterday but have put it off for a few days in order to fix up the move. Spent all morning going round to village & collecting various gear\n\nand salvage which always accumulates during a lengthy stay in billets. Completed loading some of the wagons & had them taken back to the lines & made all arrangements for moving off on Tuesday at 1 P.M. We are entraining at Pont Remy, about a 12 miles march & detraining at Busigny. Train due to pull out about 9 P.M. One lorry has been provided to take our surplus gear to train. Everything going smoothly, the Colonel showing me all orders and conferring with me concerning every phase of the move. Had a little rain, but it promises to be fine. Bad headaches last two days.\n","9":" Busy all day completing the loading of the wagons. Raining part of the time with promises of more. All arrangements to move off at 12.30 tomorrow completed & when I see the crowd off I will take a car to Abbeville. Headache all day.\n\n \n","10":" Last night at about 9 oclock orders came through cancelling the first arrangement owing to a delay with the trains. The new orders stated that our trains would move out at 8.30 A.M. which meant that we would have to march out at 1 A.M. Altered the cooking arrangements to suit this & then decided not to wait any longer, so took a car in the afternoon & went to Abbeville. Stayed at the No 3. General Hospital the night, had a good supper, yarn & game of Ping Pong. Turned in, in the W.O’s bed about 10 P.M.\n\n","11":" Up and had breakfast by 7.30 A.M. & set off to walk to the train but finding it further than I thought I reached the train exhausted almost having had to run with two packs etc. It pulled out at 8.45, cattle trucks only & what with long stops & shunting at different sidings, did not reach Boulogne until 5 oclock, thus taking \n\n \n\n8 hours over an hours trip normally. Having missed the boat, repaired to a rest home for Sgts & W.O’s conducted by Mrs Hildyard, everything buckshee and remarkably well done. The dinner was first rate, after which I did the town & went into a picture show, returning to the billet where I shaved etc in readiness for the morning, the boat going about 9 oclock.\n","12":" up at 6 with severe pain, something in last nights dinner upsetting me. Had breakfast & then went off to the boat which sailed at 9.30. Bumped a tommy Sgt Major through wanting to stay up on deck, neither won. Reached Folkestone after a quick trip about midday & Horseferry road at 2.30. From here took a taxi to Southampton Row but could not book a room at the West Central but managed to at the Premier Hotel 4\/6 rooms now being 6\/6, however I had no time to look for better, then rushed off to L.M & Co to draw some money after \n\n9. \n\nwhich I bussed it to Gt Smith St to see Geo Say if possible. He was out but managed to get his address so took a tube out to Kensington, after some trouble I managed to find it but he was out, but the people insisted on me coming in & then gave me a slapup tea. Left here at 9 after a pleasant evening & returned to the hotel. I posted two letters, 2 minutes later I realised that I had forgotten to put stamps on them so went back at 11 oclock when the box was cleared. Raining most of the day & rather depressing.\n","13":" Went out to Kensington to meet Geo Say before he left but just missed him so returned to town & met him at 1 oclock at his office. Then had lunch together in Piccadilly, later booking seats for Chin Chin Chow. He then did some business whilst I ran out to South Kensington to get my uniform which I had left there on my last leave.\n\n \n\nArrived back to the hotel & changed my quarters to The Bonnington, a big improvement then met G. Say at the Regent Palace where we had a dinner together before going to the theatre. Chin Chin Chow was very spectacular & the music was good but cannot understand it running into its third year. Had a great yarn with Geo. & felt very pleased that we were able to get together in London on his last night as he leaves for Australia via America tomorrow. Weather still dull.\n","14":" Bought a hat & fixed up my old tunic with its new accessories & then went to L.M & Co. where I drew @pound:15 also my Camera which they had had for the last 2½ years. Next bought some films & visited St Pauls, having a look at the crypt with Nelson’s grave etc. Took a snap of two girls feeding the pigeons & had lunch before proceeding out to \n\nBushey Heath where D.W.A had her abode. Had tea & supper out here & pleasant evening, returning to town about 11 P.M. Made arrangements for tomorrow. Sent off a cable to Sydney announcing the fact of my being on leave.\n","15":" Dec, Wet morning. Did some writing & then went along to Piccadilly tube where I met D.W.A. Had lunch at Slaters & then walked down to Pall Mall in order to see the arrival of Foch, & Clemenceau, Baron Sonnino & Orlando. They passed in the Royal Carriages, first Duke of Connaught with Foch, next Clemenceau with Lloyd George then the two Italians. They each received a splendid welcome. The route was beflagged & the huge crowd which lined the way gave the typical British welcome, a long & throaty cheer commencing in the distance & travelling\n\ndown the line with the carriages & fading away like waves. I appreciated it more after witnessing a French welcome which although noisy has not the solid weight of ours. From here we went to a Sunday concert at the Palladium, very good, some splendid music by the London Symphony Orchestra & singing by a welsh choir. Had tea at Maison Lyons Oxford St & took bus to Bushey again. Reached home about midnight after a good day, the latter part of which was fine.\n\n","16":" Found a note from Ramsay on my return last night. Knowing my haunts & learning that I was in London he called at all the hotels about here until he found me. Met him at 12.30 here & had lunch after which I left to meet a cousin at Brixton whom I had not seen. Was well pleased by my visit. \n\nReturning to town again I picked him up at 6.30 & had dinner at the hotel on Charing Cross Station after which we went to Shaftsbury Theatre to see Yes, Uncle, a very amusing play which I enjoyed immensely. He having to meet a friend, we parted but I spent half an hour watching the crowd at Piccadilly before entering the tube for home, when in the lift at the other end I met not only Ramsay again with his friend but V. Hutton who was our W.O. for a couple of years in Egypt & France. We went along to my hotel & had a yarn over coffee & will see him again today. Altogether a very good day & am still wondering at my good fortune in meeting the three old friends still here I wished most to meet, practically all the others having gone to Australia.\n","17":" Read the paper in the lounge whilst waiting for V. Hutton to arrive then we went along to Australia House where we inspected a collection of war trophies etc none of them being new to me however. Returned to the hotel & met Ramsay after which Hutton left for Paddington. Ramsay & I then went to the Gt Russell for lunch, very fine indeed, it being a first rate hotel. Having nothing special to do we strolled round town & I booked seats for tomorrows matinee at Going Up, at the Gaiety. Had afternoon tea at The Elysée at Piccadilly & dinner at Maxims, going next to the Coliseum Music Hall where they had a very good show, including some Russian dancers and the Pasquali brothers who were with me on the Ceramic coming from Australia in 1914. A very good but quiet day. Weather good.\n","18":" Intending to go to Glasgow tonight I paid for my room & left my spare gear in the cloak room. Having settled everything I set off at 11 to go to Bushey Heath for D.W. & for the matinee. Owing to missing a bus, I was rather late so by the time we reached the theatre the 1st act was over. However the remaining two were good & very amusing. It being early for dinner we went to Australia House then to Selfridges where I bought a book & found ourselves at The Regents Palace Hotel for dinner. We then set off for Bushey Heath but everything went wrong that could with the busses etc & I arrived back too late to catch my train which was unfortunate to say the least. However I went back to the hotel but could not get a room so after some supper \n\ntried at the Waverley & was fortunate to secure a room that the owner had not returned for. It was now after midnight & I was glad to turn in.\n","19":" had a good night & after settling for my room 6\/6 went out to collect some prints ready at Kodak & to have a photo taken. Finished up at Neames in Bond St where they took me in four positives. About 1 oclock had lunch at a Dairy Shop near Marble Arch after which I decided to go through Hyde Park to the Mall to see the Captured German Guns & planes there exhibited. Took a couple of snaps with the camera & watched the youngsters having a great time playing with the guns. Next visited the services Museum in Whitehall where are numerous exhibits of things mixed up the present war & previous one. One exhibit was of a pigeon which had been shot\n\n \n\nflying from the trenches at Ypres to its loft. The message carrier had been driven into its body & the bullet passing right through, yet the bird managed to reach home & died the next day. A very interesting place. Had dinner at The Waverley, interesting conversation with an Ulsterman, & afternoon tea at The Popular with a Flying Corpsman & damsels & heard a great tale of the doings during Armistice week, the whole fun at the place being started by a Crowd of Australians who set the ball rolling each night. Caught the 8.40 P.M. at Euston for Glasgow arriving next day at 9.30 the train being full of Soldiers. A little rain during the day but fairly fine.\n","20":" Reached Glasgow about 9.30. Weather fine & quite mild. Arriving at 571 found that\n\nMr Harper had gone to meet me. Had breakfast then a sleep until lunch, after which went out for a stroll round the town to get some rubbers for my boots. Bought a Christmas number of the Graphic for Mum, so that I have now sent them each a Christmas number. Streets very busy & packed the Glasgow Gals throwing glad eyes ad lib to the Soldiers as usual. Back again for dinner & had a good old yarn, turning in about 11.\n\n","21":" Had breakfast about 9.35 after which we went for a walk with Mr Harper into the country round Glasgow. Went around the town with Will in the afternoon & at night tried to get into one of the numerous picture shows but they were all packed with queues lined up outside. Every house of amusement was the same. The streets were packed with people &\n\n \n\nit was difficult to walk along. Everything looking bright, windows well dressed & business going briskly. Yarned until midnight when I turned in.\n","22":" Spent most of the morning reading and writing & doing up some packets for home. In the afternoon went to The Picture House rather a fine place but only one good picture was on, a Mary Pickford film. At 8.45P.M. I caught the train for London Will & Elen seeing me off.\n","23":" Had rather a rough passage down, having a sick turn in the train, with very little sleep. Went straight to the Bonnington Hotel on arrival at 7.30 A.M. & had a wash, shave etc before breakfast. Then having a number of small commissions to perform spent the morning rushing around London. Had lunch at a National Kitchen, a restaurant run by the Government & found it splendid. On entering one buys tickets for food required & then collects same at the Counter, repairing next to a table to consume the said food. For 1\/9 I had, fish, beef potatoes & cabbage, pudding, bread & tea & the helpings were liberal & well cooked.\n\nAltogether a splendid institution & well patronised. Next booked a room near Victoria Station for Wednesday night in order to be close to the train \n\nit leaving early. On reading a letter from my unit which I had collected from L.M.& Co. I learnt that the January & February men had been called for a week ago so it looks as if we are to return to Australia. This may alter my plans so will call at Headquarters tomorrow. About 4.30 went to see F. Gossing & after tea we went to the Globe theatre & saw Nurse Benson a very fine play with Marie Lohr taking the leading part. Turned in about midnight feeling rather tired out.\n","24":" Interviewed Major Wilcox about likelihood of Commissions being still granted & learnt that no more were going so will not have that on my mind now. Fixed everything up during the afternoon & repaired to Hotel Rubens where I had dinner. Rather a","25":" Class hotel\n\nwith generals in full strength, in fact I’m the only ranker present. Arranged to be called in the morning at 6 in order to catch the train for Folkestone.\n","26":" Was called at 6.10 AM. & was down to breakfast about 6.45 which I had in company with one of our flying officers. Walked along to the station and found that I had lost my pass so had to apply for a ticket which was granted without demur. Had the good fortune to be invited into a Pullman Car by a porter who was making a bit on the side, so I did the journey seated in a lounge chair with coffee brought in during the journey. On arriving at Folkestone we went straight onto the boat & reached Boulogne after a nice but foggy trip about 12 oclock. Instead of marching to the rest camp I broke off with a couple of others & went & had a good dinner at the Restaurant opposite the station after leaving our kits at the cloak room. After dinner I learnt that lance Todd was \n\nin charge of a field butchery but when I went along I found that he was on a Court martial. Returning to the Station I decided to stop the night & catch the 9.30 A.M. train next day from the Turlinfin Siding. Had a good meal at 6 P.M. and was unfortunate in my bed, it being very second rate. However I slept well, turning in about 10 P.M. Raining most of day which did not make the return any more cheerful.\n","27":" Up at 7 & went to station to collect my things then had breakfast after which, set off to the Siding, about 3 miles away but received a lift for most of the distance. Had to pay for the bed & breakfast of my companion, a stranger, but didn’t squeak as ‘twas my own fault. The train, composed of trucks, several of which had seats & fireplace provided, left about 10 A.M. & we travelled very slowly but otherwise fairly comfortably. Had difficulty over meals as I had nothing with me\n\n \n\neither to eat or drink but on reaching Abbeville I managed to buy two pieces of bread & 3 glasses of beer which saw me through. We reached Cambrai at 2 oclock next morning & were conducted to a large warehouse one time a billet of Fritzes where we were even given a drink of tea, biscuits & bully the tea being especially welcome. With one blanket I managed to sleep until 7 the next morning ","28":" when I discovered that everyone had gone so I set off without breakfast & reached the station in time to catch the train, in which I was to complete the next stage of my journey. About 10 A.M. we reached Busigny & were told that we had to report to Catillon, 17 kilm away, so set off as best we could. Fortunately some of us managed to get a lift on motor lorries. I passed through Le Cateau & Le Sarte where my unit had been for a fortnight. Learnt that the Colonel had just been\n\nto D.A.D.O.S. to tell them that a certain return could not be in by the 15th owing to absence of Q.M & Q.M.S the latter myself. He was mighty pleased to see me as he half expected that I would not return, as Jan & Feb men had been recalled from France to return to England for Australia & I was one of that number. However he showed me what was wanted by D.A.D.O.S. They had called for indents to cover all deficiencies of equipment & to state whether they were wanted or not & as we had innumerable deficiencies, covering every branch of the Ambulance, it was some job to list them & a particular one, as after this, all deficiencies would have to be paid for. However I had lunch first then a wash & shave & although I had a bad headache, I had to start & work through mobilisation tables, wagon lists etc. Turned in about 10 oclock, having started the ball rolling.\n\n \n","29":" On the Colonel pointing out to me that I was supposed to set off for return to Australia, I decided to hang on for a few weeks longer, so as to finish my job. By midday I had my particulars & then started writing out my indents finishing about 8 P.M. when the Colonel signed the lot, some 20 odd indents all of which had to be verified with each article placed in its special section. Our late Q.M. may have had his good points but he left this unit in a fearful mess as regards equipment. Our shortages are colossal with no system of bookkeeping & things lost years ago we have not only not replaced but forgotten about, so that on checking our lists, a difficult proposition as all wagons are loaded, I came upon items never suspected. However I have done my best & don’t grudge the effort as the Colonel treats me well.\n\nOrders out for us to move a distance of 35 miles in 3 stages & the Colonel has given me absolute freedom to make what arrangements I think best for the whole move, could anyone do otherwise than his best when so treated?\n","30":" Orders through for our move to take place in 3 stages starting from the 18th & to end at Sivry in Belgium which is to be our winter quarters. Had an easy day, just making arrangements for the packup tomorrow. Wrote some letters thus making a start on my back correspondence.\n","31":" The 4th Anniversary of my enlistment in the Army. Spent the day collecting all our gear from the different departments such as dentists, dispensary etc etc & taking it to the wagons for loading. Completed all loading by dark ready for the march tomorrow.\n\nAlso sent some cooks & gear on ahead to Boulogne, our first stop, to prepare for tomorrows dinner.\n","32":" Up early & immediately after breakfast sent off the remaining cooks so as to have dinner ready. Saw the crowd off at 9 A.M. it being we & drizzly & cold. Kept 3 men back & did the rounds of the billets for salvage etc & had occasion to use my boot on a frenchie who persisted in trying to purloin some of our gear. By midday all was completed so left the 3 men to come on later with the lorry which was to bring on our surplus gear & the mens packs. Joined the crowd again at Boulogne by means of a car I had kept back. Our quarters were comfortable, having plenty of straw to sleep on.\n","33":" Another cold day. Sent the cooks off early again but the car broke down & I did not arrive at Sains our next stopping place, in time for a \n\nhot dinner, so had it at night instead. I saw the crowd off at 9 & went along by car later, our billets being a large factory which had been used by the huns, as a hospital. Had a bully beef dinner. At 3.30 I loaded up the 2 cars which were still running with cooks gear etc & went on ahead to Sautain, our final destination, sending the cars back to bring forward the remainder in the morning. All our billets were ready, so everything looked promising except the weather which was cold & wet. The marching was unpleasant & very difficult for transport as all cross roads & bridges had been blown up in the huns retreat & not yet properly repaired. Rough bridges had been made by cutting down the trees which lined the roads in the vicinity. Had tea at the place chosen for my store & then spent the evening at the\n\nBurgomasters where the billeting party was living, consisting of a Major, & 2 S\/Sgts. With the help of a violin we had a singsong, the old chap providing cigars, wine, coffee etc, a very fine family.\n","34":" Slept until 8.45 & then had breakfast at the Burgomasters also dinner, they adding extras to our rations, as extra vegetables, & beer coffee & pastry so that we did well. After breakfast I inspected the billets getting them to give me more room for the store. At 3.30 the crowd arrived having had a little lunch on the road & then we gave them a hot meal at 4 P.M. Having great difficulty with the rations coming forward & we only just managed to get tomorrows rations at 11 oclock at night. Had a good evening in our mess, it containing a piano etc so is very comfortable. More rain & cold.\n","35":" Busy in the morning unloading wagons & distributing gear around to the different departments & saw the Colonel about going into Charleroi for comforts etc for sick in Battalions etc. He gave me a car for the trip in the afternoon & also took some sick to Hospital also a S\/Sgt going on leave to Paris. Set off about 2.30 & found the main road in a shocking state, reaching Charleroi about 22 miles just on dark. Got rid of patients then parked the car in the Square & set to, to see the place, it being too late to do my business, so decided to stop the night. I found it to be a large city, like Amiens & brilliantly lit with electricity, the shops being fairly well stocked & windows well dressed. Things were dear such as bacon being 5\/- a lb but otherwise everything entirely normal. German money in full circulation, the mark being worth 17.25.\n\nVisited several of the cafes & tried their coffee 17 & beer, 70.60 also had a game of billiards. They were up to date with waiters etc. Cinema shows were plentiful & I went into one, entry free, inside being all tables at which beer etc was served. There were plenty of young men about, the war treating Belgium lightly in this respect & everyone looked happy & prosperous. All the coal mines in the vicinity appeared to be working, in fact all appeared to be normal except for the troops present, the greater number being Australian. Notices such as \"Welcome to our brave Allies\", \"to our liberators\" etc were plentiful & I noticed that America here as elsewhere comes in for praise out of all proportion, Woodrow Wilsons photo & the Stars & stripes being more prominent than anything English. Slept in the car & had a good night turning in about 10 & having read by candlelight.\n","36":" Had breakfast of Steak & chips with coffee for 47.50 centimes then went to A.S.C at station where I was extremely fortunate & drew all I asked for. Next I tried the Canteen for Cigarettes etc but found a great shortage as usual & could only buy 10 pkts of smokes. From here we went to Marcinelle, a suburb, to the Australian Red + where I managed to get some extra for our sick, such as milk, Cocoa, cigarettes etc etc. Decided to have dinner here but first, visited a barber where I had a shave, also wash, the first of the day, then brewed some tea & made a meal with some Maconichies, bread etc, after which we set off for home, calling at a Café for some coffee & a warm up on the way, also two canteens but could not buy any more cigarettes. Reached home about 3.30 after a very successful trip. Very cold all day. \n\nMonday 23rd Dec. Men who sailed from Australia up to","37":" have been called for & will leave here on the 26th so I am being left badly. Word has also come through that the Ambulances are to be cut down from 3 to 2 sections so I’ll be busy returning to ordnance, 1 Sections equipment. Today the Colonel gave me a \n Tuesday 24th\n free hand in regard to running the Christmas dinner for the unit, said I could buy what I wished and make what arrangements I thought best. ‘Tis very difficult to get anything extra as food is so short and altho. an effort has been made to supply turkeys, the number is so small as to be of little value. However I set to today & managed to locate a few fowls, potatoes, cabbages, celery etc & with extras which I can supply from Comforts I hope top put up a very good dinner. My idea is to have a good dinner with the Sgts to wait on the men, then we would have our dinner at\n\nnight whilst the men would have a good tea with a card party & concert to wind up with. I will make the final arrangements tomorrow. Spent all the afternoon on horseback going around looking for fowls etc & arrived back wet through, it raining most of the day.\n","38":"\n\nA beautiful sunny day ending with a fall of snow at night. Spent a very busy day, every minute being given to the dinner arrangements. At 10 I set off by car with a Belgian & went to a village Erpion, almost 12 K & bought 300 K of potatoes paying 50 Francs per 100. I went in a Ford & drove myself, a most perilous trip as the steering gear was loose, making it difficult to keep the road & it had no brakes, the reverse gear being used instead. The driver himself asked me to drive it being so bad. During the afternoon I collected 5 of the fowls we spoke for yesterday, also more cabbages, some\n\nof which I paid for, others the people would not accept anything for them, the fowls I paid 10 Francs each. Sent a wagon to Cimay, 20 kilos for 400 litres of beer so should not be dry. From the Canteen we obtained 3 turkeys and our Christmas boxes from Australia we collected by car from Solre le Chateau so that we are practically now set up. Other matters such as the drawing up of the menu etc also had to be done. Funds to the extent of 600 Francs we drew from our funds at the Pay Office.\n","39":"\n\nDuring the morning I was busy getting all square for the spread, about 10 of the 15 Sgts helping, extra plates etc had to be obtained, besides sufficient tables, chairs etc etc. At 1 oclock we started serving out & at 2 oclock ‘twas finished, it being the quickest served dinner I have seen in my\n\nexperience. I made use of 3 windows for passing the stuff in & had the Sgts on definite jobs & all went very smoothly. Tea, the men served themselves. I picked out two trusty Corporals who picked out their own Mess orderlies so that tea was also a success. Then they had a bridge tournament & concert, followed by supper & it was voted the best Christmas say they have had in the army, so I was well pleased. The Sgts had dinner at 6. It was not as good a meal as the men had but there was a fair quantity of liquor so all was merry with several stretcher cases to deal with at 10 oclock. Altogether a very successful day. Managed to get to bed about 11 oclock after having a bit of a dance to wind up with. Snowed last night. \n\nfor the first time so it was seasonable.\n","40":" Up to breakfast, a lovely meal, few turning up, had a head myself. Spent the day doing jobs for myself. Fixed up a proper bed & table, did some washing & wrote several letters at night & hope to start on the equipment job tomorrow. Weather very mild.\n\nFriday 27th December. Longing for home today & am beginning to get anxious for the next few weeks to pass. Made a start on fixing up equipment, C Section first so as to return it to D.A.D.O.S. according to orders, we being 2 sections instead of 3 for the future. A cold wet day. Prince of Wales is now visiting the troops & reviews our division tomorrow besides presenting some of the medals owing a long time. Some more 1915 men due to go tomorrow, those who sailed up to","41":"\n","42":" A wet miserable day. Working the whole day on equipment which is just commencing to take shape. Several 1915 men returned today to Aussie.\n","43":" raining all day. Spent several hours on equipment. At night the village ran a ball & I went along to see how they did things. Entrance f1, fair sex free. The floor was of tiles & after every couple of dances they spread ashes, perhaps because it was too fast, it made a sticky surface of mud. The music consisted of 3 brass instruments & was much quieter than what we are accustomed to. Altogether ‘twas a rough but honest show with the soldiers taking command of all the best dancers. \n","44":" A fine day. Put in a solid morning on the equipment. In the afternoon we went by car to Solre le Chateau & brought back some comforts consisting of sugar, milk & cocoa with some puddings. Heard that leave to Brussels is to be\n\ngranted so intend to apply at once. Our team was beaten today in the Division final for Australian Rules. Decided to give the lads a good New Year so arranged for a concert, card tournament & dance to be held on the night of 31st. Will also put on a good supper so they should do well. \n","45":" A very successful day. We managed to get a piano for the dance and I had a lot of sandwiches prepared putting on for the supper biscuits as well with Coffee and nip of Rum, besides a 100 litre barrel of beer. The fun started at about 6 P.M. the cards being neglected for the sake of the dancing which the lads enjoyed every bit as much as if girls were present. At 8.30 I issued out the rum & the whole crowd had a wonderful glow up inside 5 minutes & carried on the good fun until the New Year. At 9 P.M. I left for our own celebration in the mess\n\nto which we had invited Major Wesley and Major Birch to start at 9 oclock. We had a royal time, good supper etc. with the ladies of the house as guests. We cleared the room & had a most enjoyable dance also singing Auld Lang Syne at midnight & departing homewards at 1.30 A.M. A most successful night – about 4 stretcher cases. In the afternoon went along to Baths & obtained clean underclothing for the men also drew some pay at pay office in case leave to Brussels should come through.\n","46":" \n\nWeather getting cool again after a mild spell. Most everyone with a sore head this morning. I arrived at mess for breakfast at 8.45 & only one other put in an appearance before I left. Did not do much during the day not feeling too energetic, in fact, lay down most of the afternoon. \n","47":" A cold day. Went to division and D.A.D.O.S. today & collected sundry things in the way of clothing equipment etc. Hope to finish C Section equipment tomorrow & to send it off on Saturday.\n","48":" Had a bad night last night, in fact the fear of insomnia is upon me it troubling me so often. Attacked the equipment problem determinedly today & practically finished it, being ready to return the whole of C’s equipment now & I find that my work of the","49":" Dec, when I specified our shortages from memory, was practically exact. A Q.M. from the 8th who has been on the job since 1916 is coming tomorrow & I will show him my papers as a check, he having just completed his own.\n\nSaturday 2nd Jan 1919. Put a few finishing touches to the Equipment papers & stirred up the transport a bit their stuff not yet being all in. During afternoon \n\nD. Fry, the 8th Q.M.S. arrived and we had a good evening in the mess. He stayed the night & before turning in he looked over my papers & found them to be the same as his own so that all is correct & I’m well satisfied.\n","50":" Spent morning with D.F. Odd jobs during afternoon. At night we had a dance at the mess. Had the Elite of the village there by invitation from the Burgomasters wife down (for tea only) & I enjoyed myself hugely. Had several splendid dances notwithstanding a headache. A good supper & bed at 11.\n","51":" Completed detail of C section matters during morning & sent it off at 1 oclock with Amb. Wagon, water cart & timber to D.A.D.O.S. at Grandrieu. Followed later in Ford & received a \n\nreceipt for the lot without question so felt elated & drove the Chat home full speed I felt so pleased, having finished such a big job. At night the Q.M. store celebrated the fact that 3 of them were returning to Australia & they made it willing. Kept my end up & retired \"Allthere\" at midnight Mj Wesley over during the night for a long yarn.\n","52":" ‘19 up feeling fairly bright & at 10 was on my way to Charleroi per car with C Section medical gear to hand over to medical stores also Mj Birch & two females who were getting a buckshee trip there. Had two punctures on the road & arrived about 1. Had a dinner of Beef (horse) & chips coffee & bread for 4½ francs. Then visited an Anatomy museum open to both sexes over 18. It shewed wax figures relating to\n\nsexual questions, Syphilis etc formation of child etc & altogether was a most gruesome affair. ‘Twas well patronised by both sexes entrance ½ franc. Returned to car & handed over my stores, then went to Red + depot & obtained some supplies for patients, picking up the Mj & civvies at 4.30 when we returned home. A fine day but very cold in front of car. Had more orders in referring to equipment. We have been given up to the 10th to make a thorough check of equipment & to indent for requirements, after which all shortages will be at the cost of the C.O. Fortunately I have been checking B & C Sections so to do this will be easy.\n","53":" Word through that my leave to Brussels has been granted from the","54":" to the 12th so had to work hard to\n\nstraighten things for my going. Spent most of the day making up returns & making out indents for things required in conformity with latest orders. Beautiful weather but too busy for photos. Arranged for a car to take me in to Charleroi tomorrow also another man granted leave at the same time.\n\n9th Jan. Thursday. Raining & cold. Left by car for Charleroi about 10.30A.M. & reached there about midday. Had lunch of Beefsteak & chips for 4 francs. Then went to station to find out about train for Brussels before doing the business I had to. First went to Marcinelle to the Red + where I obtained 2 soft brooms for hospital, primus stoves etc then to A.S.C at station where I drew sugar milk arrowroot etc, medical comforts, next to A.M.F.O. to whom I handed over two officers kits to be sent to London. Sent car off home then repaired to station & whilst waiting for train, met a number\n\nof old A.M.C fellows returning to Australia. They were surprised I was still with the Ambulance. My train left at 2 P.M. for Brussels & after a slow trip reached Brussels about 5. The trip was interesting. Just out of Charleroi in the railway cutting large coal seams could be seen & people were digging out the coal, deep holes being here & there as a result. The coal reached to the surface and was of good quality. In the various railway yards we saw large quantities of salvage together with German motor lorries, cars and aeroplanes. In one larger railway yard a vast number of ammunition trucks had either been set alight by the enemy or bombed by our airman & the scene was indescribable. Hundreds of carriage & trucks had been blown to pieces & their contents exploded & spread everywhere. Shells & bombs of all sizes could be seen & much damage had been caused to\n\nsurrounding property. German signs were being painted out & in general, an attempt was being made to straighten matters out. Arrived at Brussels we walked down the main Boulevarde & eventually booked a room at the Hotel de l’union for 8 francs. Had dinner at same place 10 francs and then did the town. Visited a Y.M.C.A for all troops, in a large emporium building. Finished up in a Picture Show coffee & to bed.\n","55":" ‘19 The first day of leave. Called at 7.30 by maid then breakfast & by tram went to the 1st Division Club rooms to join a party doing the town. Missed them however so went with a couple of fellows on another trip to the Musée Wiertz. On our way we did the Town Hall or Hotel de Ville, a fine large building, peculiar because the archway is not in the centre of the tower as it was meant to be. Inside we visited the Council Chamber marriage \n\nchamber etc all with rare tapestries & pictures, painted ceilings etc. The Marriage room brought to light a custom of the country. Every person being married must first visit this room to be married by law before the ceremony can be solemnised in a church. Next we passed a statute to Nurse Cavell erected in plaster since the Huns left. Rather a fine thing to be later copied in stone, had this inscription A Miss Edith Cavell, Homage a Angleterre 22 Novembré 1918. Caught tram to the Wiertz Galleries which contained the works of only one man Wiertz, who painted his picture to be the property of the state by a special arrangement 1806. Very fine picture, many allegorical subjects etc. Next visited the Palais de Justice, a magnificent building, mined by Huns before leaving, said to be finest of its kind. Returned to starting point & had dinner at George Restaurant 10 francs. Next met\n\na party going to view the field at Waterloo. Caught a tram it being 20 K.M. out. On the centre of the field a huge pyramid is erected, surmounted by a huge lion very impressive & various monuments are also erected, one to Gordon, Le Monument du Général Gordon, Le Monument des Hanovriens, Monument de Francais with the inscription – Aux derniers Combattants de la Grande Armee","56":" also one to the Belgians & one to the Germans. The pyramid is an allied effort. Entered a building containing a large panoramic view of the battle, painted in realistic fashion depicting the last stages of the battle when Nep. Hurled his Guard at the British squares, Ney with red hair could be seen also Wellington Napoleon & other heads, a very grand affair. Mounted to the top of the pyramid by 230 steps, a good view of surrounding plain, flat country \n\nstill the same as in 1815, the various farms concerned in the fight still standing. Bought the usual postcard & whilst having some refreshments the Garcon proudly shewed us a skull & rifle, relics of the battle. Returned to Brussels for dinner. Wishing to do Antwerp as well we next enquired about the train & decided to catch to 7A.M. next day. Spent that night in a café typical of the place. A large, well decorated, carpeted room, small tables etc & a small dancing floor in the centre, with good orchestra. Drinks only served & are more expensive than outside. Several exhibition dances were given also the latest one steps bostons etc, splendid, dancing to the latest tunes, English tunes like Tipperary. A broken doll etc being prominent. Turned in about 11.30 after having arranged to be called at 6 oclock & for early breakfast. \n\nSaturday 11th Jan. Called at 6, had a quick breakfast & caught the 7A.M. to Antwerp, paying no fare as all trains & trams are free to men in uniform. Reached Antwerp, (it being Antwerpen in Flemish & Anvers in French) at about 10.30 & commenced by having a shave & coffee. Then found ourselves at the Cathedral where we picked up a guide who took us around until 1 oclock. The Cathedral was very fine with a splendid steeple. Inside contained good windows & some pictures of note Gothic architecture. Next the Town Hall of L’Hotel de Ville, grander than that of Brussels. Visited the main rooms & saw some wonderful paintings, carvings & tapestries. Fortunate in striking a marriage day, 70 couples being married during the day in the same room & we saw many of them lined up awaiting their turn. In this room were 5 \n\n \n\npictures representing the forms of marriage dating back to times of Druids. Other pictures commemorated matters of history, occupation of Spanish, & formation of Kingdom etc. In the Grand Place which the building fronts stands a statute commemorating a deed from which the town is said to gain its name. A giant living in a castle enacted toll from every ship entering, cutting off the hand of any objecting, till a last one gave fight & defeated the giant & the statue shows him hurling the hand of the giant from a ship, the word Antwerpen meaning – hand thrown. Near the Cathedral is some ironwork, forms, being constructed by on Quentin Massey, a blacksmith, his figure being carved in stone on the Cathedral. The legend runs that he fell in love with the daughter of an artist who objected to his suit, saying\n\nthat none should wed his daughter except a greater artist than himself. Quentin thereupon went to Italy and returning to Antwerp, visited the home of the artist & looking into the studio saw that it was empty, with a partly finished picture on the easel, he thereupon painted a fly upon it & then hid behind some curtains. Soon the artist returned & began on the picture & on noticing the fly, flicked at it with a cloth, discovering that it was not natural, calling his daughter he said – the man who painted that fly is a greater artist than I, and fit to be my son in law whereupon Quentin discovers himself and all ends happily. Had a fine dinner for 11 francs & then tram to the Musée Royal de Beaux n-arts, a fine building but being closed we could not see the pictures. Other places seen were\n\n \n\nThe Bourse, Gare Centrale, a splendid large station alongside the zoo, the zoo itself which contained few animals however as most had been destroyed. Had rather a fine aquarium & garden also several Australian Cockatoos living in an open cage, the weather apparently not affecting them. Saw were Vandycke the painter was born and a statue to Petro Paulo Rubens in the Place Vertu. Purchased some Post Cards & Souvenir books & on visiting a large establishment to buy illustrated books, met a Belgian who had lived in America for many years. Had a long yarn with him also tea at the tearooms of the establishment. In a Jewellers shop met two girls who spoke English well and spent an hour yarning to them. Was astonished to learn that they had heard of our Sundowners\n\nbilly tea, stockman etc. Had several other interesting meetings, one with a chemist who on learning my calling welcomed me effusively as a brother & shewed me over his establishment pressing me to stay with him etc. The whole family spoke a little English & I was loath to leave. A Belgian soldier spoke to me saying I was the first English soldier he had seen, having been a prisoner in Germany. Everywhere people gazed at us with great curiosity as we were practically the first Australians to be there. After tea we went to the pictures finishing up at a large Cafe as our train did not leave until 12.30 midnight. The cafe was a very grand one held several hundred well dressed people & officers in uniform. In a gallery was a fine orchestra of 30\n\nperformers, giving a high class performance of good music. In an adjoining room dancing was going on. We sat here until midnight engaging in conversation with a well dressed civilian who worked at the Ministry of Justice. He spoke English & was very interested on learning that I had been to Gallipoli saying – then you must be an Anzac. I found generally that that our reputation was of the best, all the news apart from what the Germans gave them, coming from Dutch sources. All Colonial & Scottish troops were firm favourites opinion being divided concerning the English proper, many expressing the view that they were all for business, money first & were too insular. They also had taken offence at a very proper act of Gt Britain, which was to send all the Belgians \n\nhome & prevent any returning until her own troops were demobilised & could fill the vacant places. America was a special favourite, mostly for what she had done during the war on relief work. Apparently all isolated efforts such as those of Australia & England had passed through the American organisation & they had reaped the full credit. It cannot be denied that the English are looked upon with dislike in many quarters whilst the colonials, Australians in particular, have rapidly won the hearts of the people. Caught the train at 12.30 & promptly went to sleep awaking to find myself at Brussels at 3 A.M. Reaching our hotel we found ourselves locked out so had to go to the Metropole, one of the best hotels in the place, obtained a bed for 12 francs being called at 7 oclock in the morning. \n","57":" ‘19 Did not have time for breakfast so managed on a cup of coffee & a piece of pastry& met a party at the leave club with a guide to go round the city. Set off at 9 & kept on the go until 12. First visited a famous Manneken, a statue erected to a child that was lost. The father promised a large reward to whoever found him & said he would erect a statue of him in whatever position he was found, he did so & that is what makes it famous. ‘Tis the pride of the city & on fêtedays the figure is dressed & all kind of rites performed. Visited the Cathedral, rather fine, but a service being on did not prolong the visit, then to view the Colonne du Congrés, a fine column surmounted by one Leopold & marks the time when Belgium became a self governing country. Then by foot\n\nround the city viewing such places as the Bank Palais du Roi, or the Kings palace, he being then in residence altho’ half was still in use as a hospital, the Theatre Royale, La Bourse, Maison du Roi, or house where the King was born and ended up at the picture galleries. Saw some fine paintings & some that would not be hung in Australia without a curtain in front. One room of statuary very fine indeed. Returned to starting place & had a cheaper dinner than usual (funds be perilously low) for 5 francs then returned to hotel for our gear & to settle up, then to the station to catch the 2 P.M for Charleroi. I had arranged for the car to meet me at 4 P.M but all hope of this vanished as the train took until 7 P.M. to reach our destination, a \n\ndistance of 30 miles. Decided then to go out to Mont St Marchienne to visit a friend at the 8th Fld Amb as funds would not permit of a bed at a hotel. Unfortunately we found him out but it did not matter in the end. I went into a shop to ask for a room but they had no room but a young woman there volunteered to take us to one. First we had to have supper, then we were conducted to the home of our friend & found ourselves installed in a very decent room & bed, we had to have another supper however before returning. Got up at 9 in the morning & after breakfast asked - how much Nothing was the reply & they absolutely refused to accept a penny. All I could do was thank them & promise top come &see them again if possible.\n\nMonday 13th Jan. After leaving our friends to see my pal in\n\nthe 7th & promised to return to lunch. Went by tram into town & left a note for any of our cars which might visit the C.C.S. Returned to lunch & after, my pal returned to town with me and I managed to draw 40 francs at the pay office, so that I was safe once more. Booked seats at a theatre to see Mignon, comic opera, best seats were 3.50 & ranged down to 0.85 & went out again to the","58":" for tea & as no car had arrived to take us home, was forced to stay the night, so went to our old friends. They were pleased to see us again & said they would be up at 10.30 when I expected to be back from the theatre. Took along some biscuits & lollies for the youngsters as a thank offering. Mignon was very good indeed & it turned out a first rate evening, I eventually returning \n\nto rest about 11 oclock, the people having supper ready for me. Was vastly amused at their comparison of English & Australians, they saying that the English were too stand offish whilst the diggers had quite won their hearts.\n","59":" Called at 7A.M. as I had decided to get back by any means possible. Said goodbye to our friends after breakfast again no payment, & tramed it to the city eventually travelling by lorry to Beaumont, where we met a car which took us right to Sautain, our village. A very cold day and I was glad to be back, having been away six days for a two days leave. Received a small mail on arrival, telling of the Armistice celebrations in Sydney.\n\nForgot to mention a wonderful Church of St Paul’s in Antwerp, wonderful\n\nfor its carvings, pictures and statuary in the garden representing the crucifiction & other Biblical subjects. The whole church was lined with famous pictures, an off of 34,000 having been refused for one, whilst the confessional boxes which lined the walls were constructed entirely of carved figures.\n","60":" Ran into work again. Through some blunder, our surplus transport had been sent to the wrong place so we had orders to get it back, draw necessary horses from the artillery, use our own harness & send it all of to Abbeville. The C.O. was awfully wild & it really was annoying. We collected the horses during the day. At night had a good evening at the mess, singsong & dance, having invited half a dozen girls also Major W. & St. A.\n","61":" Collected our Amb. Wagon, timber & watercart & I had to prepare lists for its handover at Avesnes from where it would go on to Abbeville. We are now 6 sets of harness short so have to indent for new. Started letter writing as the Sgt Steward has returned from leave & I will have more time. Had a lengthy yarn with the Colonel he asking my advice concerning promotions, incidentally asking me if I would accept a W.O Class.1. job. Had the wind up a bit as he stated that movements were on foot to keep uch as myself back as they were beginning to recognise that the Q.M. branch in the demobilization was rapidly becoming the most important. I stated my unwillingness to stay longer than the month as I had completed the work of reorganisation.\n","62":" Put the day in, in working through the books I have introduced in the store, making all clear for my successor to take over. Sent off wagons etc to Avesnes. Discovered that the Motor drivers have stolen a case of coffee & milk & am thinking what best to do in the matter, they probably thinking I have been outwitted as it happened through my going to Brussels & sending the stuff back by car. They apparently did not think that I would have arranged for it to be listed on arrival at this end. Did some letter writing at night.\n","63":" Had a cleaning up day in the store. Afternoon went to Baths & Aust Comforts found at Solre le Chateau for stuff and to D.A.D.O.S. at Grandview\n\nfor supplies, weather cool again. Letter writing at night.\n","64":" Having an easy time again only routine work going. At night the civilians had a ball in the school room, entrance 2 francs. I attended a dinner given to Snowy St Clair, one of our old lads who is due to go back to Australia. Very fine spread, 34 being present, was let in for a speech at the end. It had one failing, the organiser placed everyone at the table according to his rank, a blunder at such a time.\n","65":" A lovely day. Feeling tired & decided to remain in bed all the morning, at the same time going without breakfast to counterbalance last nights dinner. I enjoyed the rest. During afternoon, walked to a charming chateau in the vicinity Villa and took several snapshots, quite one of the prettier places that I have seen. At night by invitation, 12 from\n\nour mess went to an evening at the big farmhouse of the village. We decided to dress up in some new pierrot concert costumes for the occasion, & it was a great success. About 8 oclock we all marched in, one behind the other with hands on shoulder into the room where all the girls etc were sitting, circled the table then turned & bowed with a Bon Soir. The effect was great, & the dress, pink & black looked well. It was an extraordinary night. First some music & singing by the girls, fairly rough, then some dancing until about 11 oclock we began to look for supper. 12 oclock came & still no sign & we were famishing. By this time we were saying fearful things to one another about coming thuds etc & made much fun of it. At last at 1 A.M. we were conducted to a room & received coffee & tart so all was well again & we went home quite happy about 2 A.M.\n","66":" Very little doing. Weather getting cooler. At night dinner to Snowy St Clair who was going to Aussie, very successful & I was fooled for a speech.\n","67":" Snow again, the second time this winter. Took photos of the mess, yesterday doing the same when they were all in the costume we used at the evening. Also had mine taken with the lady of the house. At night we farewelled Joe Davis a S\/Sgt with us for 2 years, a dentist. Very successful night, I was fooled for the speech again. Having several games of pakapoo nowadays, a mild card game of interest.\n","68":" Freezing hard. Had a snap taken with myself perched on the motor bike. Sent car for Dados and Baths’ stuff. Everyone preparing for a fancy dress dance, some good costumes being prepared by the lads.\n","69":" Put in my application for Australia today & asked to be sent direct to London in order to arrange for a trip home via U.S.A. The Colonel then told me that he could only recommend it if the St Q.M. returned so that I’m to be kept until one comes. Still freezing hard & I had my first skate on proper ice except one in Sydney. Was fairly successful & will do as much as possible in order to become proficient. Cards for a time at night.\n","70":" Still freezing & having a strong desire to learn to skate, I went out before breakfast; again after breakfast and during the afternoon, the last time on the big lake at the chateau. Made fairly good progress but was fairly tired at night. Had a fancy dress ball at night & it was most successful. Some of the fellows had been making\n\n \ntheir costumes for a week past and about 30 different ones appeared. A prize of £1 was offered for best costume. I went as an Arab with the help of 2 sheets & some cocoa rubbed on my face, a very simple affair and was amongst the six best who had to parade for a final decision. The prize was awarded to Aarons who represented a witch, the result being popular as a fair decision. It was then announced that a waltzing competition would be held & straightaway there was a rush for partners the best being snapped up immediately. However I decided to enter & was fortunate to pick a good dancer from those around. Each couple had to waltz for a few minutes in turn then the three best were chosen for a final trial & I was surprised to be amongst the 3, being more surprised however when it was \n\nannounced that my partner & I had won, I danced as a lady. The decision gave general satisfaction. Turned in about 10 P.M being dead tired.\n","71":" Snowing all day but it did not prevent me from skating both morning and afternoon. Find myself improving. Spent the evening with the civvies at the mess.\n","72":" Frost still on & snow lying thick. Had a visit from Ian Wharries & we went down to the lake to watch the skating. Did not skate myself. We had received an invitation to a dance at Civry so about 20 of us put on our fancy costumes & went per car at 7 P.M. I was with the first party & a few minutes after entering a Sgt who was running it told us that we would have to quit. I was dumbfounded and indignantly asked the reason. He stated that the dance was a special one & for the brigade HdQtrs only & that it was the Staff\n\nCaptains order. I straightaway demanded to see him & when I did I told him plainly that we considered it a slur etc. He was all apologies & begged us to return & show no ill feeling, that ‘twas all a mistake etc. However we returned and really had a good time after cooling down. We made our own fun & saw to it that we had a fair whack of the fair sex present. I look upon the episode as unique, being the first time I have been expelled from a ballroom. My costume of a Gippo caused great comment.\n","73":" Busy all morning doing my washing. Went skating in afternoon & made great strides finishing the afternoon by being able to skate backwards, turning etc. Had sundry falls & collisions & now nurse a stiff neck & sore elbow & right foot. Frost still on & snow everywhere.\n","74":" Frost still on. St. Q.M. Baber arrived back today from 75 days leave so that I am at liberty to go now when the heads deign to send me my pass. Went skating in the afternoon & did fairly well but the boots do not fit well and my feet are getting sore. Collected a few frames at P.a.P at night & started some letter writing.\n","75":" Very quiet day. Went over my books with the Q.M & explained them ready for handing over. In the afternoon made a check of the blankets in the unit.\n","76":" Had a quiet morning & took a couple of photos of the snow. In the afternoon went down for a skate on the ice being sent for later for motor bike to return to see the A.D.M.S re my application for America. I rode the bike back to see him & he told me that I could go to England in a couple of days but that I would have \n\nlittle chance of America owing to a large number waiting for a passage. Wrote some letters at night.\n","77":" Took the car to Erpion to buy some potatoes for the men. Arrived there & found that the old supply was finished so saw the Burgomaster who gave me a requisition order on a big farm near by which entitled me to get 200 Kilos for 25 francs a hundred the cheapest price I have heard of. This was the method used by the Hun when in these parts. At night played cards & lost about 6 francs. Orders through that I go on the 3rd.\n","78":" A quiet day spent mostly getting ready for going away. Had a final skate in the afternoon & at night gave them a chance to get their money back, they did & I left 50 Francs with them. Finished\n\npacking up at night & had a bath. Have sent several parcels away of things I could not carry but wished to keep.\n","79":" The day of my departure for Australia. Up about 8.30 & put my things together & said goodbye. I did not feel the parting so much as all my best friends had gone & I had become accustomed to the idea of going. The Colonel when saying goodbye said - ‘Today this unit will receive one of its greatest blows\" , referring to the departure of myself & Shepherd, some kid. Went by car to Beaumont, 8 kilos, & left our gear at a house where we had some men attending to local sick, then joined the infantry party who had just marched in headed by a band. The march to the camp was rather impressive. It was at the front of a hill & was overlooked by a castle & one of the bandsmen mounted the parapet & played ‘Goodbyee’ which rang out clear on the frosty air, it\n\nmade me realise that I really was going. Reported in at the orderly room & then returned to where we had left our gear & had dinner after which we visited a friend at D.A.D.O.S. & yarned till 3 P.M. when we decided to return to our unit for the night it being bitterly cold. Walked part of the way & part by lorry arrived for tea & spent a good night & collected some reading matter.\n","80":" Returned to Beaumont by car about 10.30 & spent the remainder of the day reading before the fire, very cold & snowing again. Had a very fair night with three blankets on the floor.\n","81":" After breakfast we went down to camp to collect some rations, then had lunch at 12, after which we went to the station, a lorry giving us a lift. Here we had a long wait in a bitter cold with snow falling, part of which time we spent in a café. About 3P.M the train arrived & we boarded it, one of the fellows grabbing a brazier, the \n\nguard had prepared for himself, he raved but did not get it back, thirty perished soldiers needed it too much. It was an awful trip, taking 5 hours to do 15 miles & most of the time we were choking with smoke endured for the sake of the warmth. Eventually we reached Charleroi, detraining outside at Marcinelle which left a march of 5 kilos to the camp. Had struggled along with heavy gear through snow for part of the distance when our Ford passed & he gave 3 of us a lift which made things more pleasant. We spent the night in a huge shed & after gathering some boards to sleep on spent a very fair night.\n","82":" Up at 7 A.M & after breakfast set off to the station. There I was told off for Q.M duties having charge of the details 128 in number. About 10 we moved off, 16 of us being in one truck with a good stove & plenty of rations. Along the line we\n\n \n\nmanaged to get straw & coal from passing trains so all was comfortable. It was a splendid trip. All this day we amused ourselves snowballing & at our numerous halts we made things willing, some of the civvy victims taking it well, others objecting. Then we had a mandelin and two good singers so music was not neglected. At 1 P.M. we had a halt & issued rations, tea sugar & milk for the whole trip, bread jam cheese & bully for 24 hours, also some Australian comforts Cocoa, puddings & tommy cookers, Rum was also issued & was a great success. We finished the day with a singsong & retired about 7 & spent a splendid night notwithstanding the bumping & stopping & vibration as if we were running on square wheels.\n","83":" Our route was via Mons, Arras, Albert to Le Havre & was very interesting being through the old battlegrounds but snow hid most of its ravages.\n\nAlbert itself was wonderfully interesting as I had left it a complete town & now found it a ruin. By taking a couple of snaps I nearly missed the train & by jumping for it nearly slipped underneath. Issued rations again near Heilly. Going through, Buire Mericourt, Corbie & Amiens etc we saw many familiar places, this part of the trip being wonderfully interesting. Night found us nearing our destination but not a bit tired of the trip.\n","84":" Coldest day fro a couple of years & we certainly felt it so. Reached Le Havre about 9 AM & before leaving the train issued rations again. Then we set off to march to the camp, our blankets being carried but my heel gave out halfway & I could just keep going. At the camp had a cold wait for about an hour & were then put into tents. For dinner I went into the mens mess room & had bully & potatoes after which we heard that the Sgts Mess\n\ncould accommodate us so we went along & had a second feed. During the afternoon some friends who knew the camp well managed to secure accommodation in some huts with bunks & fireplace so was extremely comfortable having 4 blankets, the issue being 2 & all sleeping in tents it being bitterly cold. Many fellows walk about for part of the night in order to keep warm. A Dance being held at night Sgts only, the fair sex being mostly W.A.A.Cs appealed to me so went & had a rare good time. I met some good dancers & the music & floor was excellent, quite approaching old standards. Learnt some new dances & met some old friends. Supper was also good being given in the Sgts Mess. So far my trip to Australia was most enjoyable, I hope it remains so.\n\n"}}