{"Document Name":{"0":"Diary_0457","1":"Diary_0457","2":"Diary_0457","3":"Diary_0457","4":"Diary_0457","5":"Diary_0457","6":"Diary_0457","7":"Diary_0457","8":"Diary_0457","9":"Diary_0457","10":"Diary_0457","11":"Diary_0457","12":"Diary_0457","13":"Diary_0457","14":"Diary_0457","15":"Diary_0457","16":"Diary_0457","17":"Diary_0457","18":"Diary_0457","19":"Diary_0457","20":"Diary_0457","21":"Diary_0457","22":"Diary_0457","23":"Diary_0457","24":"Diary_0457","25":"Diary_0457","26":"Diary_0457","27":"Diary_0457","28":"Diary_0457","29":"Diary_0457","30":"Diary_0457","31":"Diary_0457","32":"Diary_0457","33":"Diary_0457","34":"Diary_0457","35":"Diary_0457","36":"Diary_0457","37":"Diary_0457","38":"Diary_0457","39":"Diary_0457","40":"Diary_0457","41":"Diary_0457","42":"Diary_0457","43":"Diary_0457","44":"Diary_0457","45":"Diary_0457","46":"Diary_0457","47":"Diary_0457","48":"Diary_0457","49":"Diary_0457","50":"Diary_0457","51":"Diary_0457","52":"Diary_0457","53":"Diary_0457","54":"Diary_0457"},"Date":{"0":"unknown","1":744.0,"2":751.0,"3":752.0,"4":753.0,"5":754.0,"6":755.0,"7":756.0,"8":757.0,"9":758.0,"10":759.0,"11":760.0,"12":773.0,"13":775.0,"14":776.0,"15":777.0,"16":778.0,"17":779.0,"18":781.0,"19":782.0,"20":809.0,"21":810.0,"22":811.0,"23":812.0,"24":817.0,"25":818.0,"26":829.0,"27":832.0,"28":835.0,"29":841.0,"30":842.0,"31":849.0,"32":850.0,"33":861.0,"34":902.0,"35":903.0,"36":911.0,"37":945.0,"38":946.0,"39":947.0,"40":948.0,"41":949.0,"42":1055.0,"43":1056.0,"44":1059.0,"45":1080.0,"46":1121.0,"47":1122.0,"48":1143.0,"49":1155.0,"50":1161.0,"51":1162.0,"52":1163.0,"53":1174.0,"54":1175.0},"Entry":{"0":"\n\n","1":"\n\nWe were up at 4 am & had breakfast at 5 am & then went out to Dead mans gully as an escort for the New Zealanders who were going out to bring in one of their men who was killed on Xmas Day. We found him two days after he was killed, he was stripped of all his clothing & equipment but was left with his identity disc. So we sent it to their headquarters so you will see that they have been a long time deciding to bury him, killed on the","2":" & this the","3":" \n\nWe saw no enemy in the locality, we got home for tea & I went on picquet. We had a few presents given out, that had been sent over for Xmas, a pudding for a section & 2 ozs. of tobacco. the pudding went down well but it was only a taste & it really upsets the palate for beef & biscuits.\n","4":" 2\/Sunday Went down to church service in the Yeomanys lines & after wrote a few letters.\n","5":" 4\/Raining very hard all day, eight of us went out as mounted outpost got home at 7 pm, We are duty Regt:\n\n5\/Up at 4.30 am, mounted Hdqts orderly, still raining\n\n6\/ On regimental 2 hr fatigue loading forage & water from ship. We seem to be getting plenty of rain, it must be the wet season for this part.\n\n9\/Went out along the coast about 10 miles in direction of Solloum & found coast clear. burnt ten houses & destroyed some old wells. While halted a nigger or senussi, rode up on a fine arab horse, to speak to the O.C., he soon delivered his message & went back towards Solloum; we hear that he came from the Grand shiek of the Senussi tribe to say that they were neutral\n\n10\/Mr. Henley M.L.A. of Burwood came over from Alex. with gifts from Aust: he issued them personaly & every man got something. He then gave us a little lecture & I can say the boys gave him some rousing cheers in not forgetting us so far out in the desert.\n\nWe are all busy in exchanging letters & notes that were enclosed in the parcels & writing thanking the senders.\n\n11\/Roumour on foot that we are leaving for Alexandria. Received letters from Eng: & Aust. Went down to Dorset Yeomanry to look\n\nup any old Weymouth boys meet youn. Roberts & Escott. Packed saddles to leave on the","6":"\n\n12th\/Left Mera Matruh at 9 am., arrived at first well at 2pm. put down horse lines & camped for night, looking like rain plenty of good tucker some the S.M. has stored up & now wants to be rid of. not much spare rum come to light yet. I gues he knows where that went.\n\n13th\/ Travelled 17 miles to next well & camped for night got in at six pm\n","7":"\n\nUp at 4.30 Issued\n\nwith 200 rounds of ammo. Rode about forty miles looking for enemy supposed to be in vicinety, found their camp & burnt most of their tents & chattels. took several prisoners. most of the fighting force had Imshied as fast as their camels & donks could carry them, They light fires to warn each other when we are coming, We arrived back in camp at 7 pm.\n\n15th\/ Up at 5 am. on the road for next well, took many poor harmless prisoners en route, of course they may have been spies, \n\nWe found them minding herds of sheep & cattle, they were mostly old men & their families.\n\nArrived in camp at sun-down, water terrible scarce & horses thirsty we travelled about 30 miles.\n\n16th\/ Up again at 5.30 am. left camp at 7.30 am. a much better hour, travelled 22 miles to El Dabla arrived at 3.30 pm & camped for night, I had a shave a much needed refresher & went off to the canteen for eatables, Put away a good tea & felt satisfied to go to sleep.\n\n17th\/\n\nHad orders to entrain at 1.30 pm. We got the horses aboard & had open trucks to ride back, we do not mind open trucks in fine weather, but this trip was the limit, it started to rain just before we left & continued through out the journey to Cairo. We soon got wet to the skin but then the water started to wash about the truck so the next thing was to make holes through the bottom of the truck with bayonets which was done after a \ndoing\n great many attemps,\n\nWe got out at Neitoun at 5.30 & I was by no means sorry as it was the worse trip I have had & ever want, we saddled up & was soon \nwrit\n riding down to to the racecoarse that we left some weeks previous. We received a cheer from all the reinforcements in camp, we must have looked breakups, as most of our clothes were torn or worn out. We soon water & feed up the horses. We then handed back all equipment belonging to the","8":" Regt. & get our discharge from the Composite Regt & make\n\nfor our respective regiments. We arrived in Cairo on the","9":" & went out to Maddi & attached to 6th L.H. Details. I meet many of the old boys who had been to the Peninsular. I may say we were not looked after too well when we arrived back to our own regiment we asked for clothes & was turned down, We would have had plenty but some of the boys had go through the kit bags we left behind. I expect they also wanted clothes or they would not have taken them, but \nnot\n that was no excuse to \n\ntake some of my personal belongings. \n","10":" 22\/ Transferred to","11":" troop B. squadron. Had a go in with officer over fitness of horse I was given so I transferred back to details with the boys Capt. Caines is CO of details, he is a good old sport, but a slow hand at paying men he must believe in being sure but slow where cash is concerned.\n","12":" Went in to Cairo with Baker Campbell & Dawe Currie & Pat O’Keffe. Had a good time.\n","13":" 4th\/ Had a letter from Harry, he was down at Tel el Kebir, he was brought off the Peninsular just before the evacuation with dysentery, was in hospital at Alexandria for some weeks.\n","14":" 5th\/ Played","15":" LH Regt football, they beat us badly. March past of","16":" Brigade of consists of the","17":" 6th &","18":" Regiments. Brig: General Ryrie becomes a General.\n\n 20\/The","19":" Regt left Maddi mounted for Suez Canal to do patrol duty. We had a fine concert in\n\nthe Y.M.C.A. shed given by the English ladies of Maddi. Issued with shirts & socks etc not before its time. Rumours on foot of making another Regt. of the details, there is so many now in the details that there is no chance of them all getting into the Regiment.\n","20":" 9th\/ Men for the Artillery called for; There are 400 men in details & 90 p.c. have volunteered for the artillery Baker Campbell Currie & myself put in as drivers. Most of the hospitals are closing around Cairo.\n\nsome have gone to Bombay India. There is talk of us being sent to Aldershot to be trained, but I don’t think somehow; of course it depends where we will be sent to after trained.\n\n21\/","21":" Rfts of","22":" Rgt. arrived here 100 strong, a reinforcemt used to be only 50 men. I was short of a fur band for my hat till they came; in fact there is not many of the Rft left with furs. We were issued with helmets for hot weather they are very heavy things after the old felt hats.\n\nthe flies are begining to get a pest again. There have been several batches of","23":" Brigade men arriving back from England lately, they all look well. Most of them left the Peninsular sick or wound. We have been doing some range shooting lately its great practise. The boys that were in the Composite Regt have been issued with new clothes at last & now we look more like soldiers & able to hold ourselves up to the best of any. We have done drill & shooting well, that the \n\ncaptain has granted us a spell.\n\n22nd\/ Eighty horses arrived here, some left over after the","24":" L.H. got its compliment. I suppose it will make more picquet for some of us. They might be going to form a reserve squadron. All the Artillery men called,out then went for route march arround Maddi. It looks as if we shall soon leave this home of homes on active service. No early morning parade as Sgts & Officers had a night out & did not feel the best.\n","25":"","26":"\n\nHanded in all our equipment to S.M., so it looks as if we shall soon get a move\n\n25th\/ on last. I put in pass to visit Cairo, had a good time & bought a few necessary things. Packed kitbag when I arrived back from town as we leave tommorrow morning.\n\n26\/ Up at 3.30 am left camp at 6.30 am & marched from Maadi into Cairo about 10 miles, entrained at Cairo for Tel el Kebir on the main Suez line. We trucked into the usual open trucks\n\noften used for pigs & fowls. We arrived at Tel el Kebir at 4.30 pm. We wandered arround for a couple of hours like lost sheep till we were claimed & posted to tents. I forgot to mention that we had to march two miles to camp & carry kits which was far from a joke in this loose sand.\n\nThey would not give us any tea as we were supposed to have rations for 24 hrs, but not enough for 12 hrs so we bought a dixie of tea of the cooks & made the best of things. The Artillery officer\n\nseems a different class of men than we have be used to, they are very strict so I can see some fun with the breaking in of the mob.\n","27":" Had us up early & out marching the sand & learning their foot drill, the hours are long here from 5 am till 8 pm. we have lectures five times a week at 7 till 8 pm.\n","28":"\n\nWent over the Engineers camp to look up Harry but found he had left two days before for annother camp so my luck is out as far as meeting him.\n\nI was picked out of 60th Bty & transferred to 58th Bty. We find the Artillery hard work after having such an easy time in the details, but I guess we will get used to it sooner or later. The flys are bad here you see them leave a nigger & pitch on your bread & jam & if you care to throw it away you will go hungry. I wish the heads would send us off to France as I am sick of sand & want to see the lovely green again.\n","29":" 2\/ On picquet for 24 hrs orders to be ready to leave for Ismalia.\n\n3\/ Packed up ready to entrain. I ought to mention that we are camped near the old battlefield of Tel el Kebir, fought back in the 80’s. I have picked up some very fine coloured stones upon the desert here. Arrived at Ismalia at 11.30 pm we travelled down by trucks, had to unload three trucks of baggage etc, then to march to camp a 1 ½ away through the deep sand. We had a pig of an officer named Lucas of Sydney, he rode upon a horse & did not think of ordering a stop for breath\n\n4\/","30":" L.H. Regt. arrived here from Seraphim, saw some of the old boys.\n\n6\/ Most of the N Zealand troops left here supposed to be going to France.\n\nThere is very little news to enter up at present, but I must tell you what happened to the","31":" Brigade of Infantry. There were two brigades of Infantry to come from Tel el Kebir to Ismaila or Seraphim, the weather was terrible hot & trucks were available for both brigades, one CO said his men were soldiers & he would march his men down\n\nThat General was Irving but General Tibby had sense & save his men by having the train at his disposal. Well I saw the start of the","32":" Brigade the sun was coming up warm as they passed through the camp. The distance is only 30 miles but they must have travelled three times that distance as their General on horseback soon lost his bearings & went, here, & there till men began to fall exhausted & other went their own way. The men only had a bottle of water & many\n\nsoon drank this, on passing a sweet water canal, many men fell out to fill their bottles but they were soon demanded to fall in their ranks, when they broke up the coloumn, many saw the dreadful mirage in the distance & went towards it thinking they had found water but they went to they fell exhausted. Some of the men were nearly mad with thirst & stripped themselves of all clothing etc to relieve the weight, a few got into Ferry post & spreaded the alarm & all troops\n\nwent out with water. About eight men died & 200 \nhu\n were in hospital through a Generals foolishness. Well that General should have been reduced to a private & made do the trip himself with full pack up instead upon a charger, but no he was courtmartialed & sent back to South Australia as Camp Commandant, so you see how things are done in the army when you have title, a private would get 15 years for far less. I don’t expect the above account will ever see\n\nThe public press.\n\nWe left Ferry post & came across the canal to Moscar on the","33":" May, expect to entrain from here to Alexandria any day, but we are all busy cleaning our harness for a big general Inspection. It would make you laugh to see sitting out in the hot sun, cleaning steel parts with dear old Egypts sand, & water, but the best of the joke after we have cleaned the harness a dust storm will come up & it will look worse than before, we do some funny things in this army of ours.\n","34":" 5\/ We had an inspecton of harness & guns by General McKie, or McKay who commands the","35":" Div. of which we are part. It has been very hot all day & we were taken out for a swim for a wonder\n\n12\/ Cleaning up our harness all day, Divisional Sports supposed to come off tommorrow, they should be very good. Heard of Kitchener being drowned, all English wearing creape armbands but not A.I.F. officers. A battery of artillery went away by train today, we may go on Thursday or Saturday.\n\nReceived three letters today no more letters accepted for outward post.\n","36":" Kit inspections by the dozens & getting ready for France.\n\n14\/ Packed most of the harness except the gun teams harness which will be used to pull the guns & waggon to the station.\n\n15\/ Drawing guns etc to station, came out in Brigade orders gazetted as Driver so a extra 1\/- a day now on. Put on B.H.L. gaurd & marched prisoners down to train & took them on boat at Alex.\n\n17\/ Sailed from Alex. at 8 am, we saw four\n\nboats leave before us.\n\nThe name of this boat is the Kalagan of Liverpool a P & O boat run by dirty smelly Lascars, the food very poor;\n\n18th\/ Passed land also island of Crete this morning, Two French mine layer escorting us-\n\n21\/ Ran into Malta for three hours, not allowed ashore. The island look very barren but thickly populated\n\n22\/ Full marching parade, a torpedo our stern, thank god it missed us\n\n23\/ Arrived Marsellies, Pulled guns to station\n\n& trucked horses for our three days journey to Le Harve. We passed through some lovely green country en route\n\n 26\/ Arrived at Le Harve at 6 pm raining hard, marched five miles to a camp. We got more horses & guns from the store depot here & left for Armentiers district.\n\nWe have been here in action for five months now & our battery has not suffered a causility so what luck we have so far. The","37":" was the biggest here & we fired about 5,000 rounds each battery a day so, we were kept\n\nbusy carting ammunition. The","38":" stunt was another military bungle that caused 7,000 causilites amonsgt all rank it was as follows. General McKie had command of the","39":" Div. & he with other generals reckoned that the city of Lille could be taken by the infantry so it was arranged thus that the Aust. infantry should lead with 30,000 English & Scottish troops to back them up. On the morning of the","40":" a message was sent to McKie that the other troops could not be got up in\n\ntime, to postpone the stunt but any how the Aussies went over the top, their first stunt in France, they made good progress for four or five lines of trenches, but then the reverse came. The huns came up out of deep dugouts that had been passed over by our troops & fixed their machineguns up & then rattled away at the backs of our fellows, of coarse our chaps were surrounded by fire & had to try & retreat the best way possible. There were not many came through it & I think\n\nthe","41":" Division suffered more causilites in one stunt than any other Division. Now we came to where the General was tried by courtmartial, he said the postponed message did not reach him & that the Aussies were so fresh that they went over on their pat, He the general was sent to England & made camp commandant a much better position that he held in France, The troops would shoot him & Irving, if they had their way of justice to such men. We have just finished\n\nbuilding stables which we badly needed as we have been mud up our knees getting in to feed etc. the horses, now we hear that we are leaving for down below.\n","42":"","43":" The New Zealand have taken our infantry’s places in the trenches, they have just come up from the Somme where the took the village of Flers & other small villages they were cut up badly. We expect to be relieved by N.Z. Artillery on Tuesday which will be the","44":" I expect we shall find it \n\nrough in many ways down below as we have not had a bad time here. General Godley inspected our horses & harness & praised us highly for it all, but we all know how to take their praise by now & all their praises will never bring many of the boys to the next war. It does get tiresome of doing things the army way every day. Before the General came we had to fetch duck boards & put them arround the horses line so the Gen. would not get his boots dirty, I wish he would\n\nkeep away, as he causes a great amount of swearing. I think there will be a lot of sickness here during the winter.\n","45":" We left Flewbain near Armentiers & started on the road for the Somme, it took us about five days to get to Frecourt after camping on the way down, some of the people of the villages came out to give us a cheer, but they seem a different class of people than those of Armentier district who were always very good to the boys, but they all like the francs, \n\nThe conditions down here are very much different than we have been used to . Our first camp is in the famous Frecourt wood or whats left of it. I should say, We got bogged many times with the guns before we reached the spot for the horse lines & wagon park. Wallace Lee & myself hunted round the wood for a dugout that would keep the rain out: We found one that we thought would suit & patched it up, made a fire up to have a warm before turning in bunk. It rained terrible heavy\n\nIn the night & our dugout began to leak badly, we both got wet but would not get out before fall in time next morning, We worked hard in our little spare time to fix the dugout up, being lucky to find a large peice of canvas we tied it up to the roof to catch the water for washing purposes. We took over guns in position at Flers from the","46":" Aust Baty. & they took ours that were parked. Had pack up ammunition & lost two horses in the mud, they get leg weary\n\n& stumble down & often thats the end of them as every strugle to rise sends them deeper.\n\nWe have to pull the guns out of Flers & go to Ginchy a better position with a little less mud. The sickness has started amongst the boy’s many have gone away sick, it makes more work for those left. I have felt out of sorts, temp 102 & the Dr gave me medicine & duty so I will not go to him again till I die. We shifted our wagon line a little nearer up, so had to leave our dear home with laboar \n\nwasted. This new camp is a damn sight worse than the last, stacks of mud & no fire wood handy; we call it “mud farm\" . A half dozen of us walked two miles to salve some sheets of Iron to build a humpy of. We have built a little home & it now contains Wallace Lee, R. Heuston, Pat Mcdermott. R. Heggins, Jim Mahony, & myself. We are a little cramped up but that keeps us warm, we are a happy six & we had a nice little Xmas dinner between ourselves with bought\n\ndaintes. The guns rattled away more on Xmas Day than any other day. I thought it might be a peacefull day on both sides we were out at night. taking up shells to replace those fired. I was thinking of my last Xmas dinner at Matruh. Tripoli but this is far the best dinner as we did have three tin puddings amongst us.\n","47":" 14th\/17 Two years service to,day went on leave from Ginchy, 22 hrs in train from Albert to Le Harve, a terrible slow & cold trip.\n\nStayed two days in London. It took a day to fix up things things. \n\nArrived home at 12pm had a great welcome. Had to leave home again for France on the","48":" It was hard but had to be did, arrived back to France to find my bty. the 58th Bty divided up. half with the","49":" Bty the other half with the","50":" Bty. I was some time getting back to the","51":" where A & B sub. were attached. I arrived back the day they pulled into a new position. I went across to the","52":" \n\nto see W. Lee & take a few purchases, I had made for the boys. I am sorry the battery was split up as the happy six is divided, & Wallace Lee & I were great mates.\n","53":" 25th\/ Great excitement prevails throughout the camp, through Fritz retiring two miles back. the cavalry are on the move now, hear that we have to follow up with Guns tomorrow.\n\n26\/. Teams left to pull guns up through Flers villages. It was a duevil in pulling them up, as the road\n\nwas full of shell holes filled in with slush. & before you knew it you would be in one & strugle out to get in another. \n\n27\/. Teams took up shells & Fritz gaves us hell for a while, B sub gun team got blown up. Dad Harbor was killed outright, Hayward wounded in back & Williamson was shell schocked. \n\n28\/. I rode to battery with Thompson., Fritz was qt. Three teams going to Flers to stay for three weeks when they will be relieved. Moved up to near Baupaume to a place called Lingy\n\nThiloy, cleaned horses of a little mud.\n","54":" Pulled out for spell. Stayed two days near Albert, then had sudden order to go into action at Ervillers between Baupaume & Arrass. The guns were pulled into St Leger & we were there till the big stunt came successfull, then went forward a few miles. The weather very cold, keeps snowing hard, being near the old ruins of Urvillers we have plenty of fire wood which is needed. It is a long ways from the waggon lines to the guns & that is the\n\nonly fault with this camp. Kept busy taking shells up. One of my horses has gone lame so I am taking him & other sick horses back to Albert for treatment. Arrived Albert, two or three of the spare hands gone up to relieve Higgins & Pascoe. Fell in lucky for a trip to Abeyville for remounts. Left by motor cars for Asheaux Le grand then got a train, camped the night got horses next morning & left for Albert, sorry we could not see the town which looked tres bon from the distance.\n\n"}}