{"Document Name":{"0":"Diary_0226","1":"Diary_0226","2":"Diary_0226","3":"Diary_0226","4":"Diary_0226","5":"Diary_0226","6":"Diary_0226","7":"Diary_0226","8":"Diary_0226","9":"Diary_0226","10":"Diary_0226","11":"Diary_0226","12":"Diary_0226","13":"Diary_0226","14":"Diary_0226","15":"Diary_0226","16":"Diary_0226","17":"Diary_0226","18":"Diary_0226","19":"Diary_0226","20":"Diary_0226","21":"Diary_0226","22":"Diary_0226","23":"Diary_0226","24":"Diary_0226","25":"Diary_0226","26":"Diary_0226","27":"Diary_0226","28":"Diary_0226","29":"Diary_0226","30":"Diary_0226","31":"Diary_0226"},"Date":{"0":"unknown","1":1379.0,"2":1380.0,"3":1390.0,"4":1391.0,"5":1393.0,"6":1398.0,"7":1399.0,"8":1400.0,"9":1401.0,"10":1409.0,"11":1410.0,"12":1411.0,"13":1414.0,"14":1415.0,"15":1416.0,"16":1417.0,"17":1418.0,"18":1419.0,"19":1420.0,"20":1425.0,"21":1426.0,"22":1427.0,"23":1428.0,"24":1429.0,"25":1430.0,"26":1449.0,"27":1450.0,"28":1458.0,"29":1459.0,"30":1460.0,"31":1469.0},"Entry":{"0":" \n\n","1":"\n\nParkhouse again!!\n\nI shall have to review the last six weeks rather briefly for the detailed diary of that period has been unfortunately lost.\n\nLeft the","2":" Field Amb on the morning after the successful concert about the beginning of Aug. – a Saturday - & arrived at Perham Down.\n\nThere I discovered that my antics as Sir Frances Levison had caused a broken rib, on the strength of which, for a week I was hut corporal.\n\nFollowed blissfully easy\n\ndays marred only the morning parade & Major Stubbs famous march round & round the mile track.\n\nLater when transferred to B or drafting company, I found it necessary to dodge of parade as often as possible, & take a book up into the shady trees \nsurrounding\n about the \ncas\n environs of the camp.\n\nThose times were happy, for I wrote a great deal at night time, & absorbed Wells & other similar modern writers to my hearts’ content.\n\nSometimes I would take a stroll into Ludgershall village & view the pictures & have a feed, or stroll round the village,\n\nwhich, in its lack of military appearances, was far better than Tidworth which I also occasionally visited.\n\nAfter about a fortnight at Perham we left one Friday morning for Parkhouse & arrived here to find the tone & personel of the camp almost entirely changed. Major Johnson had given place to Major Kennedy, a straighter & more decent chap Craig was still W.O. but the other N.C.O’s were new men.\n\nA great number of war babys – under aged boys culled from the battalions, & awaiting the fulfilment of age to go overseas with A.M.C. – were in the camp.\n\nApparently they had rioted some days ago, & consequently their ranks had been depleted by the exit to Australia of numerous undesirables. It appeared to me a great pity that numbers of very young & manly boys should have so deteriorated in serving their country.\n\nTheir appearance, language, morals & general behaviour are bad on the whole. This seems to be the result of mixing first with the elder men, & their being grouped by themselves to foster the growth of the bad influence. In addition, things were not improved by the parade ground harsh discipline\n\n& punishments; also by the thoughtless & careless treatment of them by the N.C.O.’s placed over them.\n\nNow they are almost all gone to various jobs in hospitals, and those that are left are off the parade ground on fatigue & staff jobs.\n\nFor my part, since I have been here I have attended but one morning parade fully, & two or three afternoon ones. The rest I have escaped by various means.\n\nIn the first place I secured a job in the drying room, which allowed me practically all day in which to read & write. After a time however, that\n\nbecame distasteful to me because of the long hours shut up in a room in which clothes were drying: very bad for the chest if that were bad.\n\nI got off that again as for parades & from then till now have spent the mornings in a variety of fatigues of an easy nature, ranging from officer’s mess to Y.M.C.A. fatigue; & the afternoons in practically nothing.\n\nThe social side of my stay here has been more varied.\n\nFirstly I spent spare hours with Sykes & L\/Corp Hughes, both of whom left Perham with me.\n\nThen when I was in the drying room I used to go for evening\n\nwalks with Sgt Thomas, my boss, an old miner of West Australia & an interesting conversationalist of the reminiscent type.\n\nAfter that came a lapse during which I became fairly friendly with the ladies of the Y.M.C.A. & finally I met Sgt. Clerke.\n\nHe is a Rhodes Scholar, B.A., & several other interesting things, & soon after I met him we decided to form a debating society. This we did & opened on the following Monday with \"Would President Wilson’s scheme of Arbitration prevent future war?\" He led \nwith\n in affirmative & I\n\nin the negative.\n\nThere was an \nmeeting\n audience in the Quiet Room of the Y.M.C.A. of about 30, & there were two supporters on each side. In the end, after the by me of natorical eloquence to presentation of facts, & by him of presentation of facts to oratorical eloquence he beat me by three votes.\n\nLast Monday the second weekly debate was held in a crowded room, & by its spirited nature & earnestness, set the seal of success on the society. The subject was: \"Is it justifiable for one nation to prescribe for another its form of government ?\"\n\nIt was rather broad & vague but was well thrashed out, both in the set part of the debate between Clerke & another & me with a supporter, & also particularly in the public part of the debate. One of the speakers there was a labour member of parliament from Tasmania.\n\nThis time Clerke spoke exceedingly logically compared with the previous time, but still gave us plenty of dramatical and passionate gesture. At the same time one cannot but admire his power to absolutely compel the attention of the audience, his ready gift of speech, & the wealth of \n\napt reference & quotations with which he embellishes his speeches.\n\nOwing to the fact that most of the speeches from the audience were against my side (either from conviction, or by reason of his power – cant say which), I had a large array of facts to negotiate in my final speech.\n\nMy time did not permit me to answer them all, but the vital ones as I saw them were dealt with to the best of my ability in an earnest, if not an eloquent way. I was able also to pierce his armour in a couple of weak places, but must admit that\n\nthe result of the voting – 27 to 16 was quite a fair verdict;\n\nAt the same time he \nhad\n mentioned to me afterwards that I had vastly improved on the previous week’s performance.\n\nThe evening before (Sunday) I had had afternoon tea with the Y.M.C.A. people & one or two other soldiers.\n\nClerke & I have had several walks & talks.\n\nMy greatest mental efforts are unequal to matching him in argument, but I have gained great benefits\n\nin these talks, & although he is very forceful & domineering at times, I have conceived not only an admiration, but a genuine liking for him.\n\nHis personality is very forceful. Later I will describe him.\n\nNow I must sketch the history of my medical affairs since I arrived here. As usual they have been unsatisfactory & prolonged to the point of agony.\n\nWhen I arrived I was suffering from the broken rib referred to above; that got me off physical jerks for a time & very nearly was responsible for my being marked B1 A in classification.\n\nAs a starter, however, that\n\nwas A3.\n\nThis A3 classification is a horrible thing, for you are kept fooling about in the camp on fatigues, & silly route marches, supposed to be hardening. While on this classification I went up with O.T.C. forms & he refused (Capt Myers) to sign them till the rib was healed.\n\nTwo days afterwards I tore off the strapping & again paraded with the forms. This time he discovered lung trouble (imaginary) at the posterior right base. A sputum test was taken & the glorious old suspense business began in real earnest.\n\nNo draft has left for about 2 months, so when word\n\naround that one was being formed I hastened to be put on it. Craig (with whom I had not had any intercourse this time \nwith\n until then) was very obliging, & kindly obliged me, but as soon as we struck the inspection room I was kicked off it again by Myers.\n","3":" Wilson & Addison went away, & Sykes, McLennan & I remained.\n\nNow the action of the play changed somewhat & the plot thickened.\n\nThe return of the report on the sputum revealed no T.B., so I paraded to be re-examined & marked A class, if possible.\n\nThe quack relieving Myers wanted an X ray report to make certain,\n\n& that I accordingly heard \nto at\n from Delhi Hospital the day before yesterday.\n\nIt was satisfactory, so he marked me A class, but after my re-presentation of the O.T.C. forms he seemed doubtful about the eyes, (It certainly was rather a farfetched idea to expect them to accept me as an officer with my eyes). The result, however, was quite unexpected; He determined to board me, & this morning I was sent up to Delhi again to the eye specialist this time. The report will be sent back probably tonight & it looks to be the C1 class.\n\nIt is unsatisfactory to be pulled up on the eyes alone,\n\nwhen I have seen nothing of France yet; & is almost bound to prejudice me in the Dept back in Australia, but I shall not make any fuss.\n\nWeymouth may be possible as a place for duty now.\n\nThe weather here has, on the whole, been rather wet since I arrived. Now & again a couple of days running have been fine, & on account of the tremendous contrast between such weather, & the other awful dull heavy wet leaden morbidly miserable stuff called weather, \nwas\n made me quite flamboyantly light hearted.\n\nAs a result of the more ordered & deeper thinking that Sgt\n\nClerke’s company has effected, I have been rather introspective & morbid at times, but in the result have pulled myself together & from being aimless, become definite.\n\nI affected a little cricket too, just before I knew Clerke, with Mr Evans & sundry boys from the camp.\n\nThe first game was a very poor exhibition, but in the second I scored a few runs & showed a distinct improvement.\n","4":" ‘17\n\nSecond anniversary of landing on Gallipoli.\n\nWent to Delhi again yesterday for eye specialist exam, & this morning was paraded at orderly room for inspection by the Major in connection with O.T.C.\n\nPapers to be held back pending a board on specialist’s report.\n\nI’m damned sick of this business from first to last, & would far rather shut the whole thing up & go over again.\n","5":"\n\nOn guard tonight.\n\nThe first of the three big drafts (450 in all) left at 3 this afternoon.\n\nThe last one of 200 was picked\n\nthis morning & there is a distinct chance of my getting on it. Otherwise it will mean the board & C class.\n\nDid a turn as mess orderly this morning, & yesterday was on Y.M.C.A. fatigue. Both afternoons read & slept with a liverish result. Had very little exercise lately. Don’t care a brass fender.\n\nWrote Rita a doubting letter a week ago, which may have the effect of causing unhappiness & even a rupture. I suppose it is poor justification to plead that the thoughts expressed were such as have been worrying me for some considerable time.\n\nCuriously enough, despite the fact that I fear incompatibility \n\nI have thought very lovingly of her for some days since then & sent back two lighter & cheering letters. Time will tell.\n","6":"\n\nI am writing this in Clerke’s room while he has his tea. I am on draft, packed up ready to go, paid & expecting the final move in two or three days.\n\nLast night we had our","7":" debate & reached the pinnacle of success.\n\nWe had had gradually increasing success with the others & the 4th produced an audience of such dimensions that the Quiet room was not large enough to hold it, so this was held in the main room of the Y.M.C.A.\n\nOwing to the usual drawing on & breaking of promises (this time by a clergyman private), I had\n\nfor the fourth time to take a leadership; this time on the unpopular side. The question was: \"Should we adopt a policy of reprisals ?\" & my side the negative.\n\nGray, who was with me at Gallipoli (& is also on draft with me) took \nthe\n a support on my side, & my opponent was my friend Sgt Clerke.\n\nWith a strong man & popular opinion against me I stood no chance, but Clerke thinks my first speech splendid, & I think myself that I put up a strong fight for it. Anyhow I like fighting a losing battle & it is real experience to keep the audience quiet.\n\nThis is how I came to be on draft.\n\nAbout a fortnight ago I was paraded to the Major for the second time in connection with the O.T.C. forms, coincidental to the return of the Specialists report. In consideration of the fact that the M.O. had marked me fit for commission he said he was willing to mark me A class & send the papers on recommended. Therefore I was put on this draft last Sunday.\n\nPreviously, about a week before I had gone to London on 48 hours leave, & while there I had a great time with Lily.\n\nSgt Clerke went up with me & had tea with us at Barnes on the first afternoon, & spent the evening with us. Lily enjoyed herself immensely, although we did nothing but talk the whole evening.\n\nThe following day Lily & I went to an exhibition at the Imperial Institute, South Kensington, & paid particular attention to the colonial & Indian part of it. Unfortunately we were not full up with cash, so had to manoeuvre a bit: as a result, however, it was more enjoyable than ever for it was funny & interesting to study the menu out in finding the cheapest way to get a feed.\n\nAs there was a likelihood of my leaving immediately, & not having seen Dad while on leave, through a misunderstanding, I advised them to come down to Parkhouse for a week end. They came, & in the end all went well, although there was an initial difficulty about getting lodgings for them, & a later one on Sunday morning of getting leave myself, since I had been put on draft.\n\nBy the aid of the adjudant the latter was fixed up & good digs were got near Tidworth with a Mrs .\n\nThe three of us with Sgt Clerke went to a vaudeville show at the Garrison Theatre\n\nin the evening, & the following day (Sunday) I lunched with them at the digs, after having introduced Dad & Lily to the Y.M.C.A. folk.\n\nWe spent a very enjoyable time together, & of the fact I am very glad indeed.\n","8":" ‘17\n\nWe left Parkhouse on Wednesday (yesterday) & caught a train at 2.25 p.m. from Tidworth which landed us at Southampton at tea time. I kept with two original 3rd Fld Amb. men, who, being in the","9":" Division of the draft, were always with me. They were Clough (in A section of the","10":" with me) & Eva, both decent chaps.\n\nAt Southampton, instead of embarking, we marched 3 miles through the town to a rest camp at the common on the outskirts north of the town, on the way we noticed plenty of American troops, & our rest camp proved to be an American one.\n\nArrived there we were put into good huts, & given 6d each in lieu of tea; also leave in town till 10 p.m.\n\nThe three of us went into town & had a feed at what I should judge to be the most fashionable restaurant in town, judging by the prices. After that we went to a Picture show & finished the evening by riding back in the tram with some Yanks.\n\nUndoubtedly they are very boastful in their talk, & one can easily understand how they get on the nerves of the old soldiers. England to them was no good, because it was so behind the times\n\n(100 years or so one said), I pointed out that one cant judge a country after a week’s sojourn.\n\nThis morning we marched to the boat & embarked before dinner time, but being on a ration fatigue, I in common with the other two, were able to remain on shore longer & indulge in sundry cups of tea at the refreshment stall in the sheds.\n\nThe boat is of a fair size & contains both English & Australians, tho’ the latter predominate.\n\nJust before tea time we left the wharf & slowly pulled out of the harbour, then hugged the coast of the Isle of Wight\n\nvery closely until reaching the lighthouse at the most southern point of the East coast.\n\nThe weather held good, & my last view of England was of the flashing light on the dark coast outline in the near distance, against an orange sky. On the right the rain clouds over the main \ncloud\n land, showed that we left bad weather behind.\n\nThe story of Dingo\n\nDingo was the mascot of the","11":" Field Ambulance, & was adopted soon after birth.\n\nHe soon got to know the boys of the Ambulance by sight, some better than others, & began almost at once, his education \n\nin understanding the bugle calls. The mess hut was at the bottom of the two rows we occupied then, in Fovant Camp, & Dingo soon found by the appeal from his stomach, which call brought the boys to this hut, here he was always fed. \n\nThus he learned several calls, & in particular the regimental call of the A.M.C.; All others having no interest for him.\n\nWhen the 16th went to Parkhouse camp, Dingo, who from a little short haired black ball, had grown to an awkward black pup, accompanied them.\n\nHe soon found the new mess hut, & was a familiar figure on the parade ground at fall-in. When our call went his ears would prick up, & if the following one was one he knew, away he would run with great energy. The neighbouring camp calls left him cold.\n\nThe 16th went away (disbanded), as two drafts to France, & when the first went Dingo seemed the think it was more than the usual route march, but he went with them as usual. At Tidworth Station he followed no farther for it was not possible, so he returned disconsolately to camp.\n\nThat night he howled his way through the empty huts, looking for the familiar faces.\n\nWhen the next draft containing most of the remainder of the","12":" left, the same thing happened, & again when my draft left he came with us to the Station. Somebody took him on the train & so, to our surprise & greater to his own, he was to be seen trotting gaily by in a fish out of water style through the streets of Southampton with us. It was his first visit to a big town & slightly dazzled him.\n\nWhen we left the camp to go into town he followed\n\nsome of us to the tram terminus, where, unfortunately we left him, & that was the last I or any of those on the tram, saw of poor old Dingo.\n\nHe may attach himself to the American camp, or be picked up as a stray, it is hard to say. I do hope & pray he will be well-treated, for his \nfaithfulness\n fidelity, in all dogs, was beautiful.\n\nPoor old Dingo.\n","13":"\n\nLanded at Le Havre yesterday morning & marched some six miles to Harfleur where we pulled up at Rouelles camp.\n\nPassed doctor; issued with tin helmet & two varieties of gas helmets; also had vapour bath, all before tea. Several of last draft still here.\n\n\"Trish\" of Tisbury fame, & Naim & Dunstan are here, but Harry Millard has gone up the line to a C.C.S.\n\nMissed first parade this morning & hear there will be trouble over it, but\n\n--------- mabeesh.\n\nAt 7.15 this morning\n\nwe (the new draft) marched about 3 miles to gas school. We are at present fitting on box respirators. They seem to pay particular attention to fitting of helmets on account of the new mustard tear gas .\n\n4.30 Returned from gas school with a headache from the helmet; had the first shave since leaving Parkhouse & feel all the better for it.\n\nThis camp is in a very pretty valley at the opening to which is Rouelles, facing a kind of backwater of the harbour. Noticed the cathedral particularly when marching through. It is \n\nold & ruined, remarkable for it’s large & ancient looking stained glass windows, & the fact that it stands in a street & is directly joined to neighbouring houses. This connection gives it a dingy appearance & distracts from its dignity. At \nHarfleur\n Rouelles one side of the valley ends in a bluff, & the other side turns a right angles north towards Le Havre. The road at the foot of this ridge, along which we marched from Havre, is dirty & bad, & goes through dirty half town & half country quarters. Also it runs past a very large collection of big huts forming a munition factory.\n\nThe gas school was on the northern ridge overlooking\nHarfleur\n Ruelles. Directly one has passed through\nHarfleur\n Ruelles & turned to the left down the valley, the scenery is entirely different. Instead of dingy marshy & muddy flats, there are verdant hills covered with beautiful trees in autumn foliage.\n\nEverything here is green & fresh & the road good. We left the road about a mile along & turned to the left, for the camp is on the left ridge of the valley, but we can see the main road go straight along following a course half way up the opposite ridge, past chateaux & beautifully neat country houses of a good size\n\nIt seems a beautiful valley cut off from all war & horror.\n","14":"\n\nThis morning we went for a route march round & through the neighbouring village on our left, following the road at the back of the camp, through wooded country dotted with fine country houses that attracted the eye because of their beauty.\n\nDown in the valley round a bend, we could see a fairly busy little town with two churches conspicuous. One had the ordinary spire, the other was a church of the early English or mediaeval style, with chancel & tower in\n\n(Perhaps Harfleur)\n\nthe centre, after the style of old St Pauls. Judging by the smoke there must be a small amount of manufacturing going on \nthere\n in the village.\n\nOn the way through the village my little French friend of yesterday turned up & marched by my side for the rest of the way.\n\nGray tried some murderous French on him without signal success & I must admit that my conversation with him was not nearly so fluent as it might have been.\n\nHe is Henri somebody or other, & lives in that village having left school, he does nothing in particular & feels very happy & well\n\non it from all appearances.\n\nHe is going to come along again at one oclock to see me before I march out.\n\nLast evening I went to a service in the Military Church Hut. I don’t know what the Military Church is for certain except that it is C. of E., but from all I saw it seems to me to be a very high church.\n\nHalf of a large hut was furnished in a style as near the real thing as possible & a bell had even been hung over the adjoining reading room.\n\nThe officiating clergyman was not by any means intelligent\n\nlooking, but he was a typical army padre, earnest & I should think, a physchologist.\n\nHe \nto\n held the congregation during his sermon, & all thro’ the service paid particular attention to the solemnity of silence, & the mental & spiritual effect of music & such solemnity.\n\nMy own feelings were that it is better to go whole heartedly into the Christian religion & receive all the wonderful good it does one, for so far the questioning & hopeless tangle of theological argument, have served to draw me away.\n\nThe service served to bring home to me fairly forcibly what\n\nI was going into, for up to then I had not thought quietly enough to get a realisation. That was the preachers object no doubt, & he attained it with me when he came to the laying of hands on those on the point of departure.\n\nThe mud & the terrible shelling is becoming more of a reality in imagination every hour, but my present feelings are of determination to help the others as much by a steadfast example as lies in my power. I hope I shall be able to do it.\n","15":"\n\nAt 6 oclock yesterday evening we fell in, & after a remarkable amount of waiting round started our 6 mile march.\n\nThe first two were trying but at the end of them there was a long rest while we awaited some English troops. Spoke to a Scots Guardsman at this English camp (back way into Havre), & the most important information was (1) that the troops were on the point of striking against a winter campaign (he was a good looking healthy well set up lad, which made such a remark surprising) & (2) that the Guards depot was near where\n\nwe were talking.\n\nOur friend Barnes of the original 3rd Fld Amb., in a state of intoxication, was a frequent demander of \"Spells\"; but the boys themselves silenced him Clough got a ride in a waggon looking after officers kit, & Eva, Gray & I did the remainder with many a cheerful jest & without turning a hair.\n\nPacked into trucks at the Docks station & our truck, capable of holding 10 comfortably, received forty & so it was a night of misery. All was in darkness, with both sliding doors closed, & all more or less cramped & very uncomfortable. Frequently there were stoppages, which\n\noccurred in the renowned fashion of French drivers. The train would stop dead with a great jolt & then dash forward a bit before coming up with another jolt & so on.\n\nEarly morning Rouen.\n\nAbout 6 A.M. detrained & the rumour arose of a six mile march to a rest camp for rest of day, whereat was weeping & knashing of teeth.\n\nCamp proved to be at back of station & was a series of sheds with a splendid canteen at the side of the docks on the Seine opposite the large hill South of the town proper. Got a fair view of the town (second visit of mine) from the \n\nroad bordering river, where we were allowed to walk.\n\nThis seems to be a regular stopping place for troops going up the line, judging by the notices in the canteen.\n\nChatted to some Frenchmen who were guarding Boche prisoners. Not very intelligent & only spoke the obvious things a French soldier says to a Colonial.\n\nWe are falling in at 3 p.m. to entrain again, this time for the long run I imagine; so we shall soon reach the line.\n\nIt is raining hard, but I don’t feel particularly miserable.\n","16":"\n\n10A.M. We are still in the train.\n\nLeft Rouen at dusk yesterday, our train about a mile long, & were not so crowded as before, thus I slept warm & comfortably.\n\nSince daybreak this morning we have passed St. Eloi, Aubigny, & St Michel, at the latter place noticing some baths for the troops with many girls washing clothes, & hundreds of socks & shirts hanging out to dry.\n\nEvidently we are on the line to Arras & Lens, & not very far behind the front at that . Germans\n\ncavalry reached Aubigny in 1914 I believe. No damage done & everything looks beautiful on this clear cold morning. The sun seems more brilliant after the dull weather yesterday.\n\nScenery: mostly wild & beautiful woods on the sides of hills. Plenty of cultivation.\n\n11 A.M. Less foliage now.\n\nLarge fields of cultivation. Every few minutes a long train passes us on its way from the direction of Arras, full of coal. Nothing but coal has passed us this morning; no troops at all & the traffic on this line some 50 miles from the front line, (I should judge) is practically negligible\n\nNow & then a small body of men can be seen marching along a road, or a very small line of transport; otherwise, except for a plough & its tender here & there, the country is bare of movement. One would never guess that this locality was so near the line but for the faint reverberation of the guns round Arras or Lens. \n\nA faint dull constant drumming can be heard.\n\nThe sun is still smiling. \n\nEvery time the train stops there is a rush of men to the engine for water to make tea. It is only by shear luck that they don’t get knocked over by those coal trains. In one of the trucks of our train some Tommies have made a\n\nfire in one of our biscuit tins (foot square tin boxes), & the smoke it has created must surely rob it of its comfort: they seem quite happy however.\n\nThe Tommy is philosophical. \n\nYesterday evening in Rouen station I saw a truck packed full & tight with them (some 60 or so), & with the prospect of a night under such discomfort in view, they were not pushing & busting & cursing as some of ours. No! they sat quite still; some reading papers & some just smoking, & had such a philosophical & resigned air that our boys could not help remarking on it.\n","17":"\n\nOn Wednesday evening just before tea time we arrived at Hazebrouk (Hazebrouck), which is a kind of headquarters town behind the Ypres front, within shell fire reach of the Germans, & frequently visited by aeroplanes. We stayed in the train for some time, & a truck full of beer barrels on the next line consequently suffered to the extent of some 8 barrels.\n\nAt dusk we went back or forward (I am not sure which, but we commenced by retracing our way) to Caestre station which is on the main line to Poperinge near the rail head. Here we detrained & marched a short distance to a rest camp. Gray & I went into\n\nCaestre for an hour or two, & got some milk chocolate from a Church Army hostel in an old house. We also had a chat with some French Canadians.\n\nNext morning we marched from the rest camp to the","18":" Division details where we heard that the","19":" Brigade (ours) is in the line. Not moving out, Gray & I went into what we thought was Caestre, but which turned out to be Flêtre, another village near the former.\n\nWe saw plenty to interest us there & walked out on the main road towards the front & another village. This is just on the border of Belgium, (about five miles from it I fancy), & most of the villages named on the sign posts in that\n\ndirection, are Dutch or Flemish.\n\nWe had coffee at a smashed about house in Flêtre kept by three women – evidently Belgians, for they did not understand French very well, & spoke English very well & explained the cause of the damage done.\n\nFirst, said she, the Germans came, & they smashed the windows when they arrived, & were afterwards billeted there. Then English troops were billeted there. I fancy the English were billeted first, before the Germans arrived.\n\nMonte Katz stands on a hill some distance from here, & is the dominating note on the landscape. The spire of the convent is silhouetted against the sky &\n\nit was there that the awful atrocity of cutting breasts off nuns who would not betray the Allies, took place.\n\nThe Flemish lady referred to, was in Ypres during the German occupation of that town, & surprised us by remarking that they were not bad on the whole. Some were beastly & others were good, & on the whole they were not worse than they had expected. Of course there was a great deal of drinking & drunkenness, but these people evidently expect that from any victorious troops. I think that three years has been sufficient to make them regard with a \nmore kindly\n less critical eye, what at first must have horrified them \n\nClough & Eva went to Hazebrouck in the afternoon & thereby \nhad\n nearly had a little bombing experience.\n\nSoon after we got to bed in our crowded tent we heard the distant sound of bombs bursting, then the whine of aeroplanes & finally the noise of anti aircraft guns. \n\nThe Boche was on his nightly raid over the \ndistrict (he missed our first night here as it was stormy). The bombs were dropped round \n & seemed to get nearer, but after a time the Boche seemed to be driven off. It was amusing to hear all the boys on the country side barking loudly: they had evidently experienced the sound of bombs before\n\nIt says something for the natives that they have got used to these nightly raids. Perhaps they have not anywhere else to go, but they put up with the danger very cheerfully.\n\nThe villagers seem to be carrying on much as usual, but the big houses & chateaux are mostly used by the military for various purposes. There is only a sordid kind of life maintained by the poor people: the rich having evacuated. Possibly they went in 1914.\n\nNow it is raining hard, but we shall probably move out to go up the line about dinner time. I dont feel at all brave at the near prospect of getting into\n\nthe thick of it, but as it has to be done, the sooner the better.\n\nThe tucker in these base camps is not good nor bad as far as that goes, but just a I remarked in the diary I kept at Gallipoli, it is better to get to ones unit where one is looked after well, & at least feeds are certain during the average time. Under these conditions feeds are by no means certain always, for rations get lost or wet or damaged, & tea is unheard of except at actual stoppages.\n\nTravelling to Gallipoli was just as miserable as travelling to the line here. Anyhow I shall soon be right in, &amps then I want to get used to the conditions\n\n& the firing, as soon as possible.\n\nMost of the roads round here are bordered by trees, & the country is nearly all under cultivation. Numerous collections of perpendicular poles, denotes the presence of hopfields. The hill of Mont de Katz is practically the only large hill to be seen on the landscape & that is slightly wooded & very pretty -- some 8 miles from here I should think.\n\nThe guns can be heard in a desultory fashion all day, & at night the horizon is lit up from time to time by flashes. I have not yet been able to get my bearings. The front seems to be in the direction of Poperinge, but that is away from Hazebrouck & therefore planes\n\nwould have to cross here to get there unless, as I suspect, there is a big here.\n\nBy the map I can see the position now\n\nPoperinge X \n\nX Ypres\n\nX Caestre\n\nX Hazebrouck\n\nLine\n","20":"\n\nStill in the rest camp, & except for a few fatigues such as unloading waggons, have done nothing.\n\nHave been into Caestre several times. It is crowded with soldiers every night, & the dozen or so shops (estaminets & half refreshment & half novelty & produce stores) seem to do a great trade. Australians & Canadians predominate, & there\n\nare also numbers of chinese labourers.\n\nOne gets an impression of mud underfoot making the cobbles slippery; numerous dimly seen figures; a reasonably wide street which is needed to enable the huge lorries to pass along; a church whose tower when in silhouette appeared like a gigantic candle (rather stubby) with grease running down either side & a snuffer on top.\n\nOn one side one notices the blacksmith in open shop, fire lit, swinging his hammer busily.\n\nThe shops are larger & smarter than one gets in an English village\n\nbut not quite up to our country town style. Villages such as Caestre are very numerous in this part of Flanders, & in size & importance are midway between our small village & country town. They are not very much larger than our villages but very much busier.\n\nThe shops are generally entered by a door from an ordinary passage opposite which is generally another door leading to a room in which one gets refreshments. These consist of eggs, coffee, bread & butter, biscuits (at ruinous prices) & sometimes tea. They pay good attention to the coffee & know how to make it, while tea,\n\neither on account of provincial taste or ruinous price, is seldom met with.\n\nWe went to one shop in particular answering to the above description, & run by a family of people who had lost their home owing to the war. There were three \nold\n women, evidently sisters, a younger lady the daughter of one of them & a husband, all Belgians. The three elderly ladies run the refreshment side while the daughter speaks excellent English & does all the work including a certain amount of cross talk with facetious soldiers while pa looks on & smokes his pipe. For all the work he does he might just as well be sitting\n\ndown comfortably in the kitchen at the back of the refreshment room; but he seems to enjoy himself & is evidently under the impression that his presence adds a certain amount of weight to the dignity of the place. He seems to be of the mechanic type, not intelligent, but amiable. When the daughter enters into a little brisk raillery he follows it closely with all attention & helps her along with a smile & a word while not comprehending one word that is spoken. She is pretty, intelligent & fairly well educated, judging by her pronunciation of French. To hear her speak English brokenly is in itself a delight. Half a dozen words she will speak like a native & then a\n\nFrench pronunciation of some common English word comes in with rather funny effect. \"This\" is always \"Zeese\" & the is \"Ze\". She is pessimistic & thinks the war cannot possibly end for four years or more unless we loose. She seems to believe in the fact of England reclaiming Belgium, but \nthought\n thinks we have underrated the job.\n\nNearly every night lately the Boche has come over with his bombs, but none have been dropped very near the camp. It provides a little excitement for a time, but one speedily gets used to them for the danger is not very great.\n","21":"\n\nStill under canvas at Caestre, nothing more to report about our movements.\n\nChance of pay today.\n\nYesterday afternoon Gray & I went for a ramble to Mont de Cats, & reached the foot of the mound on which the convent stands.\n\nMet two Tommies who were very pessimistic about our chances of winning.\n\nIt strikes me that not only are the here pessimistic but a great number of soldiers are too. The advance of the Germans against Russia & Italy seems to be the cause of that.\n","22":"\n\nWere paid on Friday\n\nOn Saturday at 11 AM Gray & I with Eva & another 3rd man known as Pinky, set out for the 3rd Fld Amb. at Boechepe near Poperinge. \n\nA slight halt for refreshments was made at Fletre, where we discussed the Italian question with some pessimistic Tommies, & a bright Belgian girl.\n\nAt Mont de Cats we had a good dinner at a cottage in which were some refugees from Whytchaete. This cottage was near the Monastery part of which is now a Canadian Casualty Clearing station. One of the Belgian ladies contradicted the story of German atrocities at Mont de Cats, but did not satisfy me.\n\nThese female refugees are invariably slatternly, dirty & untidy, although some evidently have been used to other habits. It is a pity to see bright intelligent looking kiddies gradually deteriorating under the bad influence.\n\nFrom Mont de Cats we followed a range of hills, then descended over the border in Belgium at the village of Boechepe. Soon after leaving the village, which was crowded with lorries, & which seemed to \nbe\n contain at least three English Ambulance headquarters, we recrossed into France, & came to the siding where the 3rd had established their headquarters & were running a Rest Station\n\nSaw Bob Fry with whom I used to carry on the Peninsula, who is now a Sergeant D.C.M. & also M.M. He referred to me at once as the Bishop of London & seemed pleased to see me. Jimmy Garland seemed less free & easy as W.O. but he also was pleased.\n\nThe bearers were just starting for the line at Belgian Battery when we arrived, but we had time to chat to some of them. They were going up into a stunt.\n\nAfter ten Eva & I started for Poperinge; missed the corner rear which was his objective, & walked towards Ypres & then back to the north of the town, going some miles out of our way\n\nEven then, when we had\n\nreached the heart of the town & then walked back to the southern outskirts, we went to about a dozen estaments in search of one Rachel, whom he had known when in that part of the country before. We did not see her, but met Madeleine at a private house. She was a delightful little girl who spoke good English in a fascinating way. In one of the estaments we ran across Andy Chalmers.\n\nPoperinge is a big town, & has suffered pretty heavily from bombardments. The square & main street run due north & south & thus is right in line with the salient north of Ypres.\n\nIt is in that part of the town\n\nthat most damage has been done. Every other house shows some sign of shell fire, & many are smashed right up.\n\nAll lights are out except those dimly burning on vehicles. Huge lorries forming long lines dash through the streets which are only just wide enough to take them. We noticed a picture show & one or two soldiers’ hostels, but the general aspect of the town is of feverish military activities \n\nThere are also one or two English & Belgian hospitals.\n\nNext morning we had a bath & a clean change of clothes, then started back. At Boechepe we had a cup of coffee & then caught a lorry going we\n\nknew not where. At the cross roads where we should get off for Mont de Cats, (Gray had stayed to see his brother) Pinky got off the lorry & later we did. Then we decided after reassembling, that we could get back by lorries somehow. The first we caught took us on the road to Sixibusch & then we got another back to Berthen. From Berthen we \ngot a\n walked to the main road, got a drink & then dashed after some lorries. Pinky & I got on but Snowy Eva did not get on, & for some reason (fatigue as I after found out), could not catch the following ones either.\n\nPinky & I arrived back\n\nat Caestre, had some eggs & then made for the camp.\n\nMeanwhile, tired & thirsty Eva visited every estament he came across on the way. In a semi alcoholic condition he seems to have gone across country by dirty lanes & miraculously done what he failed to do the previous evening when sober; found a short cut. It brought him out at Strazeele, & if he had not been unfortunate enough to get shut up in a pigsty by a garrulous & angry \nFrenchwoman\n Belgian lady of ripe years, he would have forestalled us by arriving some time before. As it was our return was almost simultaneous\n\nAlthough I had been absent from the unit for nearly two years I was welcomed openly, & gained great delight by the way they addressed me as the Bishop of London, - the name I had been known by at Gallipoli.\n\nMeanwhile we continue our lazy life in the camp.\n\nOne gets up in time for breakfast, makes the fire in a can outside the tent; messes about & gets very dirty & then does a little fatigue. Before dinner one reads & washes, varying the monotony by chasing pigs under the hop poles. After dinner one intends to go to the village, (or town if you like; the natives call it that), but messes \n\nabout till teatime & then intends to go immediately after. An argument in the tent probably defers departure till about 6 or 6.30, & then one drinks coffee at the favourite place already described; chats to madamoiselle if she can tear herself away from fiance, until about 8, when one walks home arguing some ethical point.\n\nTo night the four of us came in by motor bus (one of the London ones but submerged under a grey exterior but \nstrik\n strikingly familiar), & thereby gained great amusement by facetiously enquiring of the driver whether he stopped at Trafalgar square.\n\nOwing to his peregrinations in leading me to Poperinge, Eva is now the \"surveyor\" or the \"guide\", & we laugh a good deal over such quips. While Gray & I are in the refreshment room, talking war to a semi-religious French Canadian with no great insight into the ways of nations; Pinky & Eva are playing \"house\" in an estaminet.\n\nTuesday 13th Nov 17\n\nStill in camp at Caestre.\n\nTomorrow the 1st Div Newforces camp moves to a new site up the main road, & we (A.M.C.) are to parade with full marching order at 8.30 perhaps to move\n\nwith the camp & perhaps to go to our units.\n\nThe whole of the 1st Division comes out of the line soon, & the 3rd is even now on the way south, so it looks as if we shall have a poor chance of joining up with them. As the 1st has lost heavily it seems likely that we of the 3rd may be sent to them instead.\n\nGray & I have regularly visited our friends at the refreshment rooms, & I have had several interesting talks with Mlle \n\nThe romance has its sequel a few days ago, when she got married to her fiance. Since then she has got him extra leave on account of imaginary\n\nsickness. Her affection is very deep (for him), & she seems to be quite full of sensibility.\n\nThe mere fact of having a homely chat & exchanging thoughts on the wonders & horrors of life, is stimulating to me.\n\nThe verse: -\n\nAh love, could thou & I with Fate conspire\n\nTo grasp this sorry scheme of things entire.\n\nWould we not shatter it to bits\n\nAnd then remould it nearer to our hearts desire.\n\nAppeals to me strongly.\n\nOn the one hand I feel \nthat there is wrong in alm\n that almost every part of our existence today is vitally\n\nwrong. Religion, the mainspring, is not only unknown in most places, but a hypothetical substitute is set up in its place, which makes the position more hopeless because of misleading. So little is sincere nowadays.\n\nOn the other hand I myself have tried to practice the Christian religion & have failed lamentably, so most of my puny efforts to right wrong have been neutralised. It seems to me that only two ways confront the sincere man, open religion or open wickedness. This hypothetical compromise is so useless & misleading\n\nThursday 15th Nov 17\n\nOn Wednesday morning we left Caestre at 10 A.M, marched to Station, entrained, & went through Hazebrouck to St Omer, not stopping at Reniscure, where the 1st Div. Headquarters was.\n\nBox of cakes etc belonging to Canadian army, stolen from truck at Caestre, Art Eva \n& I\n & Gray & I with several others refused to participate.\n\nTook return train (always in trucks) from St Omer to Reniscure, & reported to A.D.M.S.\n\nSent to Wardrecques, but overtaken by dispatch rider who pointed our new destination op 2nd Field Amb at Quistede. Helped to guide\n\nparty, but Gray & I, on ahead, went one way & they another. All arrived about same time, & found 3rd bearers with the 2nd.\n\n3rd Amb \ndest\n whereabouts unknown\n\nRiot with Portuguese in evening\n\nBillets in a barn.\n\nCoffee at estament with Eva & Clough. Gray found brother.\n\nCommenced this morning to continue march to rest camp. Arrived Halte D’ouve, soon after dinner. On main road to Boulogne.\n\nReunion of old pals with me, (who have been with 2nd some time).\n\nMarched with 2nd from Halte D’ouve to Senlecques (about 13 km) where we halted for \ntwo days\n 36 hours & then continued march through Desvres to Wirwignes (about 15 km altogether).\n\nThis place was the official resting village of the 2nd Fld Amb. Billeted in hay loft at side of estaminet.\n\nBread to be bought in village but little else, which did not affect us as we were without money.\n\nStayed in Wirwignes for a week altogether leaving on Tuesday 20th Nov. for the","23":" To reach them the 3rd Bearers & the small body of returning men marched under Major Ruttledge of the 3rd, through Samer","24":" Brigade\n\nResting headquarters), to a little village just off the main road to Estaples, called Cormont. Here, we discovered the","25":" & very shortly after my arrival, (nearly two years after I left them) we were paid received mail & a drop of tea; showing how they look after the boys.\n","26":"\n\nSince I have been with the boys I have got to know some of the new ones, & had good yarns with the old ones.\n\nWe are billeted in an old farm building in a hay loft over the main denuded rooms, & are fairly comfortable. We rise at 6.45 for parade at","27":" a short distance & then have breakfast.\n\nThere are parades at 9 & 2\n\nbut little is done except light fatigues & compulsory games, such as football. This afternoon I participated in a game of football as half back, & thoroughly enjoyed & fatigued myself.\n\nTwo days ago I was approached by Tom Smith to help form a concert party & in lieu of a better I am to be pianist. That afternoon I went with Scotty MacNoll & Tom Smith & Les Bennett to Longvillers to try to find a piano. We were \nput off\n unable to find one in that village, but were told to try Madmoiselle\n","28":"\n\nSpent most of the remaining part of rest in arranging concert. Stage managed the whole & produced burlesque after writing same, leaving the musical directing to Tom Smith.\n\nGave three shows – Thursday last to 12th Batt – Sat to","29":" - & Monday to civilians. Voted success on last occasion, but the","30":" show marred by undeserved allusions made by Burnett to Q.M.S & cooks. In any case, Tom Smith has grown a trifle jealous & did not put all his energies into\n\nthe affair by a long way.\n\nThe problem for the future (Capt Blogg (sec) wants me to continue as Stage Man. In future affairs (hold concerts) is whether I shall continue as S.M. with Tom Smith & L Burnett. Smith may drop out & I may be able to convince L. Burnett that one should control ones desire to make such \n\nStarted from Cormont this morning on way back to the line (Messines we think) & accomplished about 18 Kmetres. Sleeping in cottage for","31":" faire night – Becourt\n\n"}}