{"Document Name":{"0":"Diary_0319","1":"Diary_0319","2":"Diary_0319","3":"Diary_0319","4":"Diary_0319","5":"Diary_0319","6":"Diary_0319","7":"Diary_0319","8":"Diary_0319","9":"Diary_0319","10":"Diary_0319","11":"Diary_0319","12":"Diary_0319","13":"Diary_0319","14":"Diary_0319","15":"Diary_0319","16":"Diary_0319","17":"Diary_0319","18":"Diary_0319","19":"Diary_0319","20":"Diary_0319","21":"Diary_0319","22":"Diary_0319","23":"Diary_0319","24":"Diary_0319","25":"Diary_0319","26":"Diary_0319","27":"Diary_0319","28":"Diary_0319","29":"Diary_0319","30":"Diary_0319","31":"Diary_0319","32":"Diary_0319","33":"Diary_0319","34":"Diary_0319","35":"Diary_0319","36":"Diary_0319","37":"Diary_0319","38":"Diary_0319","39":"Diary_0319","40":"Diary_0319","41":"Diary_0319","42":"Diary_0319","43":"Diary_0319","44":"Diary_0319","45":"Diary_0319","46":"Diary_0319","47":"Diary_0319","48":"Diary_0319","49":"Diary_0319","50":"Diary_0319","51":"Diary_0319","52":"Diary_0319","53":"Diary_0319","54":"Diary_0319","55":"Diary_0319","56":"Diary_0319","57":"Diary_0319","58":"Diary_0319","59":"Diary_0319","60":"Diary_0319","61":"Diary_0319","62":"Diary_0319","63":"Diary_0319","64":"Diary_0319","65":"Diary_0319","66":"Diary_0319","67":"Diary_0319","68":"Diary_0319","69":"Diary_0319","70":"Diary_0319","71":"Diary_0319","72":"Diary_0319","73":"Diary_0319","74":"Diary_0319","75":"Diary_0319","76":"Diary_0319","77":"Diary_0319","78":"Diary_0319","79":"Diary_0319"},"Date":{"0":"unknown","1":1860.0,"2":1861.0,"3":1862.0,"4":1863.0,"5":1864.0,"6":1865.0,"7":1866.0,"8":1871.0,"9":1872.0,"10":1873.0,"11":1874.0,"12":1875.0,"13":1876.0,"14":1877.0,"15":1878.0,"16":1879.0,"17":1880.0,"18":1881.0,"19":1883.0,"20":1884.0,"21":1885.0,"22":1886.0,"23":1889.0,"24":1890.0,"25":1891.0,"26":1892.0,"27":1893.0,"28":1894.0,"29":1895.0,"30":1896.0,"31":1899.0,"32":1900.0,"33":1901.0,"34":1902.0,"35":1903.0,"36":1904.0,"37":1905.0,"38":1906.0,"39":1907.0,"40":1908.0,"41":1909.0,"42":1910.0,"43":1911.0,"44":1912.0,"45":1915.0,"46":1916.0,"47":1917.0,"48":1918.0,"49":1919.0,"50":1922.0,"51":1923.0,"52":1924.0,"53":1925.0,"54":1926.0,"55":1927.0,"56":1928.0,"57":1929.0,"58":1930.0,"59":1932.0,"60":1933.0,"61":1934.0,"62":1935.0,"63":1936.0,"64":1937.0,"65":1938.0,"66":1939.0,"67":1940.0,"68":1941.0,"69":1942.0,"70":1943.0,"71":1944.0,"72":1945.0,"73":1946.0,"74":1947.0,"75":1948.0,"76":1949.0,"77":1950.0,"78":1952.0,"79":1953.0},"Entry":{"0":"\n\nWed. Jan.1st. 1919. Journal of 6735 \n\nEvery time I start a new Book, I say \"Well this ought to be the last one I shall fill before I get back Home\" but now even tho’ \"La Guerre\" appears to be finished, I’m not going to say anything about it. This time last year the war looked as if it might last another 20 years or so & I was seriously thinking of settling down in England if I could get a decent Billet & sending home for B.E. Now I am at Littlemoor Camp Weymouth, expecting to see my name on a boat Roll at any time. This Camp is one of the most dismal I was ever in, & the weather is rotten, nothing but Rain & cold winds, & stew 2 or 3 times a day. There is plenty of food about, but it is dished up in such a slipshod manner that its appearance turns a man off it. On getting a \"sniff\" one’s appetite disappears. \n\n \n\nAnyhow this is not an \"Essay on Littlemoor Camp\" but a bit of a list on what happens to \nme\n, so here goes. If I was an Artist I may manage to make this Book amusing, as there are some quite funny things happen to me at times. \n\n","1":" The new year came in wet & the old year went out wet, too. This would be a good country if it had a roof in it. Things passed off very quietly. A few of the Boys came Home from Weymouth a bit merry, that was all. Early this morning a few guns banged off at & the church Bells rang for about an hour. To celebrate this auspicious day we had stew for dinner. Real nice stew with plenty of smelly Herbs in it.\n\nThurs.2 Getting my things ready to go on Leave tomorrow. Did some washing yesterday, a Job I love (I don’t think). Got paid £2.15 magnificent sum. Had hot bath & donned clean change.\n\nThurs. Jan.2\/cont)\n\nPaid 12\/- for my Railway Ticket to London, which made a hole in my . Borrowed a pound from Bill Beard.\n\nFri.3. Got ticket from Furlo’ Office & marched to Station. There were about 30 in our Party. Boarded train about 10 a.m. Arrived London (Waterloo) at 2.20 p.m. It was quite an interesting trip, as a number of Ladies travelled up in our carriage. They evidently had not met many Australians as they evinced great interest in some of the Diggers bloodhirsty narratives. Caught Tube from Waterloo to St James Park & walked from there to Horseferry Road, where we had Dinner & bought some Cigarettes \nDuty Free\n 100 for","2":" A bit better than paying 5 ½ d for 10 as we have to do from the Canteens. Another chap & I booked seats at the war chest for the Alhambra Theatre to see \"Bing Boys on Broadway.\" Then we went for a stroll round the City. Had Tea at Lyons.\n","3":" Jan.3 (cont.)\n\nAfter Tea we passed a pleasant Hour in a Picture Show near the Alhambra. Quite the best I was ever in. There was a fine Pipe Organ & somebody could play it real good. The \"Bing Boys\" was good, but not so good as I expected. I have seen shows equally as good in Sydney & Melbourne (to my mind, anyhow). George Robey is very funny & Violet \n\nis real good too. What struck me was that there was not a decent singer in the whole Show. V. sang a very fine song \"The old Love\" but she had not a very good voice. As usual it was raining, but we were lucky enough to get a train. Had supper before returning.\n","4":" Had Break at War Chest. It is easily the best place (for a man of limited means) in London to get a feed. After Break strolled around City. Saw changing of Guard at Whitehall. Imposing, but useless ceremony. Raining , of course. It is muchh lighter in the City at night than in the day time, now that the Lights are permitted.\n\nJan.4.(cont.) In London on 4 days Leave.\n\nLondon is full of soldiers, & it’s difficult to get a seat at a Threatre or obtain a Bed, & the Restaurants always seem to be crowded. Went to Coliseum at night. Good show. Very fine orchestra. Max Rarewski conductor.\n\nSeveral first class items. One Performing Seal was really marvellous. It was almost human. The Russian Ballet is a lot, but I didn’t care for it much.\n","5":" Attended morning Service at Westminster Abbey. The singing was beautiful but the service was dry as dust. No wonder people don’t attend Church; the Services are so monotonous & dreary. On my way to Dinner met Bill so I hopped on to a Train & went & had dinner with him at a place in \"the Strand\". They charged us 4\/6 each, & I was still hungry. Being Sunday there was not much doing, so we went for a stroll down \"Petticoat Lane\" & saw some really remarkable Bargains. Bill bought a pair of kid Gloves for 8\/-.\n","6":" Jan.5 (cont.)\n\nThey certainly were not cheap, but as he said he wanted ‘em I suppose they were worth it. Had tea at Lyons \"Corner House\" in \"the Strand\". Here we had Tea & Toast & Cakes & sat in comfortable chairs, listening to good music for about an hour & the whole lot cost about 2 bob. We had our money’s worth there alright. Then we went for another Train Ride. After that we had another feed. Eggs & toast & cake. We tried to get to a Picture House but every place was crowded, so I went with him to where he was staying. The old Landlady was very particular & I had to fill in a Form before she would let me a Shower. We sat up yarning till nearly midnight.\n","7":" Bill & I slept in till about 10.30 & then the old Lady came & called us & said our Breakfast was spoiling, so we hopped out & had a pretty good feed of Bacon Eggs. Bill had some Business to attend to so we parted, & I strolled back to the W.C.Club where I had Dinner. Here I met Peter Hutchison, whom I hadn’t seen for ages. He was on 14 days Leave from France. He was going up to Glasgow to get married. My word, that’s some interesting news for B.E. Peter & I knocked around the City for a few hours, & returned homem to Bed about 12.\n\nTUES.7. My last days Leave. These few days have passed like a flash of Lightning & tonight I return to that dismal Hole called \"Littlemore\". Met Sgt Berry in \"the Strand\". He is on 4 days Leave. Last Sat. I went to see Ted Sutton at Horseferry Rd. He gave me a note to bring to Westham. I wonder if it carries any \"weight.\" It \nshould","8":" . It’s about time my name appeared on a Boat Roll.. I don’t like writing to B.E. till I know something definite. Poor old Girl. She must be about as fed up as I am. \n\nTues.Jan. 7 (cont.)\n\nMet Pete H. again after Dinner. We went up to the Aldwych Threate, which is an \"Aussie \" . Sat & listened to the music for a while, then I had to \"buzz off\" & catch my Train at Waterloo. Travelled as far as Wareham in company with a party of Canadian Tank Corps. They were good company. Arrived at Upway about 10.30, where we were greeted by two greasy \"Jacks\" who demanded to see our passes. Then I strolled slowly & sadly back to \"Stew soaked\" Littlemoor. \n\nWed.8. Stew for Breakfast. Felt so disgusted I refused to get up. Got 2 letters. 1 from Mother & 1 from B.E. that made things a bit better. Mother says Lill is looking bonnie which I’m sure is very excellent news. Put in for Pass to go to Westham to see about getting on a Boat Roll & also to make enquiries about that cape I handed in, but for which I am charged the sum of","9":"\n","10":" Jan.9. \n\nGot a aride to Westham in Ambulance which broke down several times on the way but still this was far better than walking, as, of course, it was raining. Saw Taylor & Jack Cox both of whom had just returned from Leave. Also saw the Q.M.Sgt who gave me a note to say that I \ndid\n hand in my waterproof cape when I was in Westham last May. Took the letter I got from Ted Sutton to the Guy in the Medical Hut, who said \"You are too late for the but I’ll put you on the . \"That’ll do me\" I said. She is supposed to sail about the 20th so I must rest my soul in patience how till I can get aboard. Hope to the Lord it comes off alright, or B.E. will think I am going wrong in the head, after saying I am coming home so many times, & then to miss. \n\nHad Tea in the Staff Hut & returned to Littlemoor feeling that I had done a good day’s work.\n\nFri.Jan.10\n\nBeing Hut Corporal is a responsible Job. Very few chaps in 83 Hut care about appearing on Parade, & I’m afraid the Sgt Major noticed me blush this morning when I reported \"All correct.\". This morning I asked Sgt.Duffy if he could find me a Job for a few days, so that I would not have to attend Parade. He said \"there was nothing doing in his department \". Just then the Hospital q.m. appeared on the scene, so I asked him for a Job. He fixed me up right away, so now I can keep indoors out of the wet. There is not much to do but it is much better indoors than paddling about in the mud. I went to see the Q.M. about the waterproof cape, but he says the note is useless, as it does not bear an officer’s signature. So now I’ve got to go thro’ it all again. If I \ndo\n manage to get my","11":" back I shall have just about earned it.\n\nSat.11.\n\nThere are a number of German prisoners working around the Camp. I should have said \"\nsupposed\n to be working\" for what they do is harmless. They are a long time fixing up about the Peace Conference, but it’s a mighty big undertaking, & it’s best not to hurry. 4 chaps in this Hut are on the \"Ulysses\" so the party that came here from Westham are gradually dwindling away. I don’t care how soon \nmy\n turn comes. \n\nSun.12. The sun is actually shining today. Quite a treat to see it. Riley, the chap in the Q.M. store with me is on the \"Ulysses\". He went to bid his Girl \"Goodbye\" so I was left in charge. Wrote a letter to Lill, but forgot to number it, so I can’t count it as one. Being a fine day the Camp is almost deserted. We got a pretty good dinner on Sunday, thank Goodness. \"If you love me, Miss Absolom, then don’t offer me \nstew\n\n Mon. Jan. 13.\n\nMy confrere, Riley, got word to go away today & board the Boat. Very quick notice, too. So she must be going soon. the chap in the next Bed to me is on the same Boat. Sgt. his Q.M. is married & his wife lives in the village, so he gets Home every night. I wish I was so near to my wife as he is. Anyhow I will be soon, with a bit of Luck.\n\nTues.14. The next Boat Roll should soon be out if she sails on the","12":" Gee I’m mighty anxious to see it. \"Andy\" the Q.M.’s assistant returned from Leave last night. I slept in his store between sheets. Some class. Bill Beard also came back last night. He tells me that he got engaged before leaving. It seems catching. There’s a chap in my Hut \"Taffy\" Evans, who is going away on marriage Leave on the 28th. There won’t be many single men in the AIF soon.\n","13":"\n\nAnother wet day. \"Andy\" & I had a busy day sorting & stacking washing. They put me on a new Job today making out the Tobacco List. We are able to buy Tobacco & Cigarettes at \"duty free\" prices instead of having to pay 5 ½ d for a Packet of 10 Cigs we get em for 2 ½ d which is a mighty big difference in these days of cash shortage. Bert Berry is on the \"Marga\", so I’m hopng to see my name appear on the Roll. Sgt Cropley (who is in charge of the Hospital) says this Roll is not coming out for another week or so. I really ought to write some letters but I’m hanged if I can settle down to the Job. I did manage to scribble a few lines to Mrs Sano & asked her to send my Diary along.\n\nThur.16. The sun is actually shining this morning & it looks like being fine. Beautiful, Greasy stew for Breakfast again. Had a busy morning making out the Tobacco List & collecting money for same. It’s such a long time since I did any clerical work that I felt quite awkward. \n","14":" Jan.16 (cont.)\n\nQuite a decent Dinner. Roast meat, & plenty of vegetables & Steamed Pudding. After dining got my pass from Office & took my seat in the car for Westham. The Driver said there were too many aboard, so Sgt. Duffy & I had to walk in. Being such a fine day we quite enjoyed it. Took my pants to the Tailor in Weymouth to get the Leathers sewn on. He promised to have them done by Monday. Then I went out to Westham & saw the Q.M. about the Cape. This kept me messing about for about an hour, & then I got no satisfaction I’m afraid that money is as good as lost. Went up to see Col. Astbury, but he was out. So I returned to Weymouth & had Tea at a little shop. Bacon & Eggs & Bread & Butter & some excellent coffee all for 2\/6d. This was not dear considering Eggs are 5 ½d each. After Tea strolled around the town for a while, but not meeting anyone I knew I purchased a Box of Water Colors & returned to Camp by Car \n","15":"\n\nLloyd-George’s Birthday, too.\n\nThis is Frances’ Birthday.\n I wonder how the poor old Girl is spending it. Got a nice long letter from her yesterday. She says they are having a very rough time. It is a beautiful day & the diggers are sitting about in the sun & quite enjoying it. The \"Ulysses\" & \"Manga\" Boat Roll crowd are leaving tomorrow & they are buzzing around getting their things ready. Bert Berry is on the \"Manga\" & Bill Beards is on the \"Ulysses\", & 4 more fellows in my Hut are on the Roll. I shall be might glad to see my name on a Roll. The is a long time putting in an appearance. Bill Beard came to say \"Hooray\". I gave him my address & told him to give us a call if ever he gets as far as Sydney. Sat.18. Another beautiful day quite frosty. It’s quite a treat to be alive weather like this. Had a Bath after dinner & donned a clean change. Washed all my dirty clothes, so now all my gear is clean. I just want a pair of Boots, & they can stick me on a Boat Roll as soon as they like. The \"Ulysses\" & \"Manga\" arrived left this morning.\n","16":" Jan.19\n\nAnother wet, miserable day. It’s enough to drive a man to drink. I intended to go into Weymouth today but it’s out of the question. After Dinner \nwrote letter no 3 to M.S.\n\nMon.20 Another Boat Roll out & I’m not on it, yet there are numbers of A class now getting Home, & some of ‘em haven’t even been to France. It is raining again. We ought to soon be used to it. \n","17":" It is trying very hard to keep fine. There’s not much to write about.Dry Hash & stew appear at Dinner time with unfailing regularity.\n\n Wed.22. \"Lippy\" & McDonald are both retruned from Leave, & now we have quite an imposing staff in the Q.M. store. After tea I went iinto Weymouth to get my pants from the Tailors & found the shops all closed so had to return without ‘em.\n\nThur.23. Archie Reed came to see me today. He is employed on the Education Staff at Monte Video. Got my Diary from Ms Sam & letter from Ibby. \n","18":" Jan.23 (cont.)\n\nThey also sent me a pair of Braces & a Tie towards my \"Civvy\" outfit Ibby informs me that he is demobilised & back at Business. Lucky Beggar. After tea went into Weymouth again. Got my pants went out to Westham. Saw Serg. Travill who informed me that I was on a Boat Roll whih made me feel inclined to give 3 hearty cheers. Glorious news for my next letter to B.E. The weather is good. Very cold & frosty & dry. \n","19":" Nothing exciting happened. Stew turned up for Dinner again, & rain is not far off. Wrote a few lines to Mr Playford.\n\nSat.25 Cold day & drizzling Rain. Had quite a busy morning pulling Hut 14 into shape for Stocktaking. A number of Returned Prisoners came into our Hut today. They were in Germany a year & say they received very rough treatment. Many of them died from starvation & they say it is surprising to see how well the Huns are treated in England.\n","20":" Jany.26.\n\nFine day again. Quite a number of Patients were admitted to Hospital today & kept us busy for a time. After Dinner went for a stroll into Weymouth. Met Archie Reed at the Soldiers Club, also saw of the","21":" who said he saw my name on the \"Nevarsa\" Boat Roll, but I’ve heard nothing aboaut it yet. It turned out very cold after Tea & I wasn’t sorry to get back to Camp. Wrote letter No. 9 to B.E.\n","22":" Weather very cold again. The Boots I got from the store are almost as good as new & a good pair of Boots are very necessary during this weather.\n\nTues.28. Had quite a busy day putting the stuff in 14 Hut ready for stocktaking. There are plenty of strikes on in various parts of England, & no doubt they are helping to keep the Boats back. All the in our hut are in great humour now they know that they are on a Boat Roll.\n\nWed.29. My busy day fixing up the Tobacco Roll. Plug \"Havelock\" is on the list & the Diggers are rushing it as good Tobacco is hard to get nowadays.\n","23":" I really ought to write some letters but I’m hanged if I can get going. Went into Weymouth after Tea. Did some shopping for \"the Adjutant\" & Cpl Kinley. Walked both ways. It was jolly cold, & I wasn’t sorry to get back to Camp & turn in between my blankets.\n\nFri.31. Went to Depot Q.M. & drew the Tobacco for the week & it. This is about the hardest job I have to do during the week \"Andy\" was told off to go to Sutton tomorrow, but he’s not at all keen about it.\n\nSat.Feb.1 Another month gone. \"Andy\" got taken off the roll for Sutton & is quite delighted about it. All the crowd in my Hut (13) who are on the roll got paid today & went into Weymouth to celebrate it.\n\nSun.Feb.2.\n\nGlory: Alleluia. After dinner today I was lying down on my Bunk, when \"Lippy\" came up from the Store & said ,\n\"Eh: Moorey, you are on the ship’s staff of the Lancashire & you are to report to the Orderly Room at 9 in the morning.\"\n At first I thought he was only kidding , but he said it was right. I returned to my Hut & tried to realise that I \nwas\n actually on a Boat Roll, but I’m hanged if I can. The very idea of being back with my dear old B.E. again is a very hard thing to realise considering it has been the main object in my mind since last Xmas 18 months. Anyhow, after a while I managed to pull myself together & went for a Bath & donned a clean change. I ought to have written some letters after Tea, but I felt too bloomin’ excited to do anything. Its no use me writing any more letters to B.E. or any of ‘em at Home, as I shall be there as soon as they would. \n\nLast night I had a shave & put all my Gear ready fr getting away this morning. Reported to orderly Room at 9 with Sgt Cropley who is also on \"Lancashire’s\" staff. Said \"Goodbye\" to the crowd in Hut 80 & \"Mac\" \"Andy\" & \"Lippy\" in the Q.M. Store. Got a ride over to Monte Video in a Car. Here we reported ourselves & were allotted to Hut no 9. Saw Archie Deed & had a great old yarn with him. He is doing a bit on the Educational Staff in Camp so I guess it will be some time before he gets away on a Boat. Also saw Claude Holland, who was carrying with us at Ypres the day I got a . He was a patient in Hosp. (but did not appear to have much the matter with him. After Dinner Sgt Cropley, Archie Deed & I went to see \"The Big Roan\" who is in Hospital here recovering from the affects of an operation for appendicitis. He was quite pleased to see us & we stayed yarning for nearly an hour.\n","24":" Feb.3 (cont)\n\nThen at 4 we went the Q.M. store where I managed to get my Tunic changed for a new one. Also tried to get paid but failed. The Pay Sgt said I would get a Pay on the Boat. I hope so as I’m broke & a man will want a few shilling, for the Return trip on the Boat. After Tea Sgt Cropley & I went into Weymouth. I met Bill Watson on the way in. He was at \"Monte Video\" waiting for a Boat. Sgt Cropley & I went to the Jubilee Hall. We paid","25":" each for a seat but it was a poor show. After that we met Staff Murray & Guy from the Massage & we all adjourned & had some light refreshment. Meat Pies, Cakes & quite decent tea. Then we walked home. The beds in no 9 Hut are \"Down\" Beds Down on the Floor. It was very hard after the Spring Beds we had been used to at Littlemore. Turned into my Blankets about 10. \n\nAnother day nearer B.E. \n","26":" Feb.4\n\nThe Serg came round & called us at 5. I was awake when he arrived, not having slept all night. Hopped out of my Blankets & had a wash. Breakfast was on when I returned to the Hut Beautiful Dry Hash. We fell in at 6.30 & were issued with Rations. A chap named Davis & I were told off to stand by the Kits & the remainder marched to Weymouth Station. At 7 a car arrived & took Davis & I & the Kits to the station. We got there about 9. Went into a Café & had a cup of coffee, which warmed us up greatly. The Train left \nWeymouth\n about 8. We changed at \nYeovil\n & \nTaunton\nArrived \nTaunton\n about 11.10 & left about 1.15. Strolled down town with a number of others. Had a shave & a feed. Arrived \nPlymouth\n about 3.15. It was pouring in rain, & no one was there to meet us or to tell us what to do. We floundered around for about an hour when a motor ferry arrived & at took away our Kits. We went down to the Rocks on the Car (Train) Saw the \"N.Zealand\" in Dry Dock. Also saw the \"Lion\" & \"Tiger\" \n\nThe German Armistice Terms we signed on the \"Lion\", which was Ad.Beathie’s Flagship).It was almost dark when we arrived aboard, so we could not see much of the Boat. Drew our Hammocks & Blankets & had Tea. Stew O Lord. We could have gone ashore after Tea, but it rained like fury, so we stayed aboard.\n\nWed.Feb.5 It was quite exciting slinging our Hammocks last nigh; & trying to get the blankets in the right position was amusing. I slung my Hammock in the portion of D deck & managed to keep fairly comfortable. Was awakened this morning by the sound of women’s voices. 70 of them came aboard to scrub out & put things in readiness for the arrival of the Diggers. There are 199 of us on the B.M.C. staff & they seem a very decent crowd.\n","27":" Feb.5 (cont)\n\nThe Food is good & plenty. There wasn’t much doing today so we had a good look around the ship. She is not a big boat by any means. After Tea I went ashore with Davis & Burke. We met the ship’s Corporal of the \"Lion\" who gave us a detailed account of the Battle of Jutland. It was mighty interesting. Judging by what he said the sailors all swear by Ad. Beattie. The Corp. said Beatties wife often went aboard & had a yarn with the men. She is a daughter of Marshall Field the American millionaire. Ad. Beattie won’t allow anyone else but a man-o-war’s man cut his son’s hair. The train ride from Keyhouse Docks into Plymouth is the longest I ever had for a penny. It rained heavily all the night, so we couldn’t see much of the Town, & being wet all the shops were shut.\n\n \n","28":" Feb.6.\n\n Liver & Bacon for Breakfast. Not Bad at all. Kept busy all day carrying Blankets mattresses etc. to the different decks from the Ship’s Store. Everything is brand new. The women came aboard again & continued their scrubbing, so our ship ought to be clean by the time they have finished scrubbing. It poured in rain all day. We had an invitation to look over the \"Lion\" but were kept so busy all day that we didn’t have the chance of doing so. Plymouth is the home of the Warships. No matter where one looks he can see a warship of some sort, from the tiny submarine classes to the Dreadnought. After Tea I went into Plymouth again with Cpl. Reed & and Gilbert. It poured in rain and we were wet through by the time we reached Town. \n\n We went to a Picture Show for a while, but it wasn’t up to much, so we returned Home about 8.30 & went to Bed.\n","29":" Feb.7.\n\nThis morning we carried all the cutlery & gear from the Store to the various Decks. It kept us busy till Dinner Time. Thirty nurses came aboard last night. 10 of ‘em are for Duty, the remainder are returning Home as passengers. About 1 p.m. the first train Load of Diggers arrived, & we were kept busy showing them to their various Decks. The first train Load came from Sutton Veny. By 4.30 they were all aboard & wandering around the Boat in all directions. We expect to sail at about 10 a.m. tomorrow. Rex, one of the chaps out of my Hut (85) at Littlemore was among the crowd who came from Weymouth. Three unlucky chaps got sent back to their Camp, as we had no record of them on the Boat Papers.\n","30":" Feb.8.\n\nOur deck is full up now & it was quite exciting slinging our Hammocks last night. We left the Docks just on the stroke of 10 a.m. I’m hanged if I can realise that we are going home. I keep on thinking that I shall wake up presently & find it all a dream. I don’t feel a wee bit sorry at leaving Blighty. The whole country seems to be on strike. The British working man is evidently waking up & about time he did. \n\nThe scenery as we left the vicinity of Plymouth was very pretty & for a wonder \nthe sun actually shone\n. The weather seemed to change immediately we dropped the Pilot, & tonight the Boat has got quite a roll on. Many of the crowd are complaining of being sick already. I felt quite tired after Tea & was very glad to hop into my Hammock. We had 5 cases of Influenza aboard yesterday, but they were sent ashore before we sailed. I’ll bet they didn’t \"go sore\". Well, I \nthink \n I can safely say that I’m on my way Home now. I wonder what Lill will say when she hears that I’m coming Home \nat last\n. I feel real sorry for the poor beggars who were put ashore. They were certainly very \"stiff\". \n\nThere are a number of civilian passengers on the Boat, & several Ladies besides our 30 Nursing Sisters, so we have quite an interesting crowd aboard. The weather is quite fresh tonight & quite a lot of the chaps are sick already.\n","31":"\n\nThe weather is quite cold & the wind blowing almost a hurricane. The ship is rolling & many of the Diggers are suffering from \"Mal de Mer\" already.\n\nThe food is fairly good and plentiful. Our Deck (D) seems to be about the most comfortable on the Boat.\n","32":"\n\nMost of the A.M.C. Staff are sick, & we have a number of Patients in Hospital with Influenza & prostration from Sea Sickness. The weather continues rough & there are many vacant seats at meal times. I manage\n\nto put in an appearance at every meal. I don’t feel particularly brilliant. I’m not exactly \nsick\n but I do a lot of swallowing. The Hammocks are more comfortable than Bunks this rough weather. Big seas are coming aboard & all the Troop Decks but ours are awash.\n\nI’m going on night Duty tonight with \"the Yank\" as all the other fellows are too sick. The Latrines were smashed in today & the cook house washed out by big waves. \n\nThings are only \"muddling\" \n\nTues. Feb.11.\n\nWeather continues rough. One chap, named Findlay, got knocked down by a wave yesterday & broke his right arm; & another chap was admitted to Hospital today with a sprained wrist caused by falling on the deck. There are 9 Patients in Isolation & I have 3 to look after in the Gen. Hos. Yank & I went along to the Pantry about midnight to get some Supper but all we got was a cup of Coffee & some Bread & Butter. This was not much good to us to last all night on, so we complained about it. Had a hot Salt water Bath & turned into Bunk where we managed to have a few hours sleep.\n\nThe weather is getting warmer & the sea is calming down. \n","33":" Feb.12.\n\nWas on night duty again last night with the Yank. Supper was a dismal failure again & Yank said \"We’re slippin’\". I agreed with him & this morning I spoke to the Second Steward about it, who said he would see into the matter. \n\nThe weather is quite calm again now & the Diggers are getting their sea-legs\".. I agreed with him & this morning I spoke to the Second Steward about it, who said he would see into the matter. \n\nThe weather is quite calm again now & the Diggers are getting their sea-legs\".\n\nYank & I got turned out of our Cabin today & had to seek fresh quarters. We passed Gibraltar about midnight last night. It was too dark to see much but we saw \"the Rock\" looming out of the water & innumerable lights flickering along the coast on either side.\n\n \n","34":" Feb.13.\n\nAm taken off the night Job now & put in charge of the Pack Stoves. It should be a fair Job if only I can get a decent place for a store. The Hospital is run on very \"slip shod\" lines, & one is kept wondering what is going to happen next. Last night we had quite a decent Impromptu Concert on Deck. It seems strange that in spite of the enormous amount of money that has been subscribed to the Red X & Comfort Funds this ship was allowed to leave Port without a Piano. The Music at last nights Concert was supplied by 2 Diggers 1 Cornet & 1 Violin. \n\nThere are quite a number of Scabies patients undergoing Treatment. Carson is attending to them & I am issuing clean clothes. Dropped a few lines to Lill.. \n","35":" (cont.)\n\n\"Bluey\" Downing & I occupy one of the Hospital Cabins, which is very comfortable.\n\nThe weather is good & sea calm. The popular game of \"House\" & this old \"Crown & Anchor\" Board are much in evidence, & the Diggers are keeping their well circulating.\n","36":" Feb.14\n\nThe weather continues fine & is getting warmer every day. Flu’ is still in the air & a number of patients in Hosp. have high Temps.\n","37":" Feb.15.\n\nA week of our Homeward Trip has gone & we are not doing bad at all.\n\nThe ship is quite steady now, & we can walk the decks in comfort. I wrote a couple of letters, one to Sam Ibbs & one to France, but its not much use writing Home as I should be there as soon as the letters.\n","38":" Feb.16\n\nThere was a Church Service on Deck this morning but I was too busy to attend. Last night I had a most peculiar dream. I dreamt that I was Home with Lill. The going home to our place was rather hazy, but when we did get there, I dreamt that Lill went down on her knees & commenced to pray.\n\n she was offering thanks for my safe return or asking for strength to stand my company is what’s got me thinking.\n\nThis is our second Sunday on the mighty ocean, & the trip has been quite comfortable, so far. \n","39":" Feb.17\n\nThe weather is getting quite hot now, & the sun is beginning to tan our faces. The crowd are a healthier looking lot now than they were when they came aboard. We had some very nice mutton for Dinner which went down well. We were paid today & I drew the magnificent sum of 7 shillings. My Pay Book showed a credit of about 2£ when I handed it in to the Pay Office, but they managed to find an item of 2£.6.0 which put me in debt, that was why I drew such a small sum. \n\n I hope I manage to get a couple of Pounds for Colombo, as I have very little in the way of souvenirs & I’d like to take some little items Home to B.E. Gee: its jolly Hot. I’ve even raised a sweat as I sit writing\n\nTues. Feb.18.\n\nTurned out this morning what I thought was early, had a Bath & strolled down to D deck to find that Breakfast was over. I managed to get some steak & Bread & Butter & luke warm coffee, which was better than nothing anyhow.\n\nReturning on deck I found that quite a number of Arabs were hovering around our ship in their boats selling oranges, dates, cigs. & silk articles. Most of the silk was \"shoddy\" but it sold to the Diggers like hot cakes. Yank paid 10\/- for a mat which in my opinion would be dear at half the price. It was quite interesting to hear the bargaining going on between the buyers & sellers. The chaps in their Boats sent up their articles in baskets tied to ropes, & the money was sent down in the same manner. \n","40":" 18\/ cont.\n\nIt was quite like old times to hear the sing song of the \"Gyppos\" as they went about their various tasks, loading, etc & working on shore. We left Port Said at about 2 p.m. & steamed slowly up the Canal. It is not pretty country by any means as there is nothing to see on either side but eternal sand. The stations on the Canal are a very welcome break in the monotony of the desert. Their neat buildings & brave attempts at Gardens give quite a cheerful aspect to the Canal. a number of Arabs tied on to our Boat & got a tow for a number of miles. We passed a big camp of Armenian refugees, who waved us a hearty \"Farewell\"; we also passed an enormous Camp & Dump which is evidently the Base of the British Forces in Egypt.\n\nTues. Feb.17 (cont.)\n\nWe are steaming very slowly along the Canal. The water is very calm & one would hardly think the ship was moving at all as she is so steady.\n","41":"\n\nWoke up this morning to find the ship slowing down, as we were nearing Port Zufic. There were a number of other vessels anchored in the Harbor. We were not near enough to shore to see what was going on; so our stay was not very interesting. I washed a pair of slacks last night & put them out to dry on the roof of the Isolation Hospital. They were dry in about a couple of hours. If I am allowed to keep all the clothes I’ve got, I shall have quite a fair outfit. We had quite a good Dinner today Roast Lamb & vegetables. \n\nWe took in quite a big consignment of Red X stuff, which ought to last us till we get to Freemantle. About 3 p.m. about 100 Light Horsemen came aboard. Most of them wore feathers in their Hats which gave them quite a \"jaunty\" appearance.\n\nWed, Feb 19 (cont.)\n\nWe had cold Lamb for Tea which was very nice. It’s a wonder they can’t put up meat in a more appetising manner than as stew, especially in this hot climate; but I suppose its hard to find out how to dish it up at all, as it would soon go bad.\n\nAt about 6 p.m. we \"up-anchored\" & started on our second phase of this wonderful Journey Home. Findlay, the chap who was supposed to have fractured his arm went ashore at Port Zufic, to get his arm Xrayed, & \n\nluckily found that it was not fractured. Every day I say to myself, I’ll commence a letter to B & E, but I’m hanged if I can settle down to do anything.\n","42":"\n\nThe sea is as smooth as glass & the ship is sailing along quite merrily. Its mighty hot sleeping down in the cabins & one wakes up in the mornings feeling much the same as one does in Melbourne when the North wind is blowing. Two of the Light Horsemen who came aboard yesterday are patients in our Hospital. One a shell shock case & the other malaria. The shell shock chap is pretty bad & has to have someone with him night & day. I had the job all the morning & one of his mates sat with him during the afternoon. is looking after him at night. It’s mighty hot. They put the canvass over the decks today which makes it nice & cool \n\non deck. We had oranges for dessert today & they were very acceptable.\n","43":"\n\nIt’s mighty hot again but as our ship is making good progress that doesn’t matter much. Judging by the news were heard at & Port Said we are having an excellent trip so far as the Health of the Troops are concerned. The \"Margha\" & \"Ceramic\" had quite a big death roll by the time they reached here. We have about 20 in hospital but none of them are very ill. For Breakfast we had fish, which wasn’t too good. Yank brought us in some Roast Beef sandwiches about 6 this morning & some tea. After getting outside that I got up & had a Bath.\n\nA cool breeze sprang up after Tea which made things a bit more comfortable.\n\nWhat a rotten writer I am getting I must blame the rolling of the ship. \n","44":" Feb.22\n\nCorp. Brown, our mental patient seems to be feeling the heat somewhat. \n\nIt must be rotten to be that way. The Food is beginning to get that nasty \"ship\" taste, & some days it is not too good. Still we cannot growl so far, as it must be a difficult task to provide appetising meals every day.\n\nThis is our second week gone & the trip has been very pleasant.\n","45":"\n\nThis afternoon we passed the coast of Africa, (Somaliland) which will be the last we shall see of Land until we reach Colombo.\n\nWe expect to arrive there about Friday or Saturday & we are wondering whether we shall be allowed ashore or not. There is a very nice motor boat on the Isolation Hosp Deck & the Lascars painted it up today, evidently getting it ready to go ashore in at Colombo.\n","46":" Feb.26\n\nYank was taken sick last night & got put in Hospital, so we were a man short on the Job today. Cowell, our measles patient gave us a hand after Dinner.\n\nThey are holding a sweepstake on the Boat’s Run from mid-day today till mid-day tomorrow. The favourite number is about 347. Munn a Light Horseman, who is in Isolation Hosp. drew 351 which is a very good chance. I have made several attempts to write to B.E, but I’m hanged if I can make any show at all. Now that the wonderful time of being able to actually see her & hear her speak is drawing so near, it makes my hand too bloomin’ shaky.\n\n \n","47":"\n\nThe weather is simply perfect. Last night I slept on the roof of the Hosp. It has an awning over it & is quite like sleeping in a Tent. The sea is almost as smooth as glass, & one has to look at the water rushing by to be convinced that we are moving at all.\n\nWe passed a couple of boats today, but they were too far away to see what they were. The diggers are busy polishing boots & seeing to their uniforms, as there is a faint chance of us being allowed ashore. \n","48":" Feb.28 \n\nIt was very sultry last night & and I woke up this morning feeling anyhow, altho’ I slept on deck. We passed the island of Minnesoy about 9 a.m. about which is a Joke \"Why is Minnesoy\" \"Because Suez.\"\n\nPay is on this morning & I’m wondering how much I shall get.\n\nLater\n I went along to the Pay office & drew the magnificent sum of 7\/- again. This doesn’t look too promising for my trip ashore when we reach Columbo, anyhow I have a pound, & a promise of a 10 hr Loan, so that will have to do me. \n","49":" long as I have sufficient to purchase a few souvenirs to take home to B.E. I don’t mind. \n","50":"\n\nThe black crew of this Boat are all smiles today, as they are nearly Home.\n\nI wish we were as near Home as they are. It has been a very pleasant trip so far. Hot a single incident has happened so far to make the voyage unpleasant.\n\nWe passed into the Harbour just as the Bells sounded 1 p.m., & dropped anchor at 1.30. Right in front of our ship is Walkers Engineering Shop. We were soon surrounded by numerous boats & barges with niggers aboard selling Fruit of various kinds Bananas, Pineapple, Cocoanuts, etc. They did a roaring business. Later on a number of natives came aboard with moonstones & other articles for sale. They seem very cheap, but I’ll wait till we get ashore before I buy anything.\n\nColombo\n ","51":"\n\nWell here we are at Colombo & we are going to be allowed ashore. Last night everybody was busy cleaning up boots, etc. We got thro’ our work bright & early so as to get away soon as possible. It was fearfully hot & the sweat poured out very freely. About 9 a.m. a tug arrived towing a number of barges on which we went ashore. It took about 20 minutes to get there from the Boat. We passed a number of passenger boats. The passengers lined the sides & waved their ‘Kerchief’. On getting ashore we were immediately pounced on by Rickshaw men & newsboys. With a number of others I went along to the Echelon Barracks where the Y.M.C.A. is. Here we had a feed & bought some fruit, which was very cheap. Pineapples, 2d each, coconut 2d, & bundles of bananas as many as a hundred in a bunch for 1\/-s or \n\neven cheaper than that. \n\nStan Davis, the Serg Dispenser, Frank (his assistant) & I went for a rickshaw ride as far as Victoria Gardens. It was a very interesting trip. As we turned a corner the wheel on Stan’s rickshaw collapsed & he just jumped out in time to prevent hitting the ground. The chap who was hauling him looked at him as much as to say \"Aren’t you going to pay for the damage\"\n\nbut Stan wasn’t having any. The smash occurred just outside the entrance to the Gardens, so Frank & I dismounted also (but in a more graceful manner than friend Stan) & went into the Gardens. There is a fine statue of Queen Victoria, with ponds full of fish & some very pretty trees & flowers. In the centre of the Garden is an enormous block of stone with an inscription carved on it. It was removed from the shore some yeas ago, & the carving on it is supposed to be the work of some Portugese navigator who landed many years ago. We returned to the Barracks & had Dinner. Fried Fish, Salad, Bread & Butter & good Tea for 9d or 50 cents. After a bit of a spell we wet round the native shops & bought some curios. They were very reasonable to my mind. I go a carved ink stand, 2 elephants, a porcupine quill box for 16fr. The native wanted 18\/- at first, but he came down to 15\/- so after a deal of arguing I tossed him to see whether I’d give him 14\/- or 16\/-, & he won. Leaving our parcels in charge of the Y.M. we took a trip out to the Cinnamon Gardens in a \n\nIt was a magnificent trip & I wouldn’t have missed it for anything. The scenery was glorious. We passed numbers of bungalows which defy description. They were superb. The native quarters we passed were very interesting too. On the way out our car ran out of water, so we pulled up outside one of the Bungalows & asked for water. The owner of the place, showed the native driver & his assistant where to obtain water, then he came & had a yarn with us. He appeared mighty interested in our descriptions of England & France. I imagine him to be some Gov. official. He informed us that his wife had just returned from England, & was amused at the idea of having Ration Cards. He said his wife told him all about the rations, but he had not seen a Ration Book so we showed him ours. After filling our water tank we moved off again & arrived at the Cemetery Gardens which were very beautiful. Flowers of every hue & beautiful foliages. Our Guide showed us into a Buddhist Temple. The Gardens were beautifully kept. It would almost be nice to die in Colombo if we could be buried in such a glorious spot (I don’t want to peg out yet, tho’, I want to see my B.E. first) We passed plenty of diggers on the Road, in rickshaw gharrys & all kinds of conveyances. It was about a two hour trip in the car, & was quite the best 1\/6 worth I ever had in my Life. \n\nI went with Yank to visit some \n\nmore native shops, where we bought some cigars very cheap. We went into a high shop where they had some beautiful silk. I saw a couple of glorious silk dressing Jackets that I’d have liked to get for B.E. but the price was very much beyond me. I bought a couple of brass candlesticks, which was quite a novelty & some Post cards. Also bought a couple of Lace collars for Lill.\n\nAfter visiting a few more shops we both got broke. Yank had a rupee (1\/6) left, so we adjourned to the Y.M. & that in in two more feeds.\n\nWe bought a couple of sticks & then made our way to the wharf. We got aboard the Barges & returned to the ‘Lancashire’ about ¼ strength, after one of the most enjoyable days of my Life.\n","52":"\n\nThey finished coaling last night & we are to sail soon after mid-day. LeClere & the Corp. went ashore this morning, but they had to be back by 11.20 & they didn’t have much time to see the City. Everything is smothered in coal dust. We left Colombo at 2 p.m. & are now sailing merrily homeward. This is the second stage of our journey. In 10 days we should reach Freemantle, which is Home. Then about 10 days after that we hope to be in Sydney, which is just a glorious prospect. We heard in Colombo that Influenza was raging in Melbourne and that they had the \n\nBuilding as a Hospital. It’s to be hoped they soon get it in hand as it’s a rotten thing to get about. \n","53":"\n\nThe sea is like a sheet of glass. I got up about 5.30 this morning, had a bath, then sat on deck & watched the sun rise. It was glorious. The flying fish as they jumped out of the water looked very pretty in the dazzling sunlight. The sick I made this morning was the biggest we have had since leaving Plymouth. Quite a number of the Diggers are knocked out by the Heat. It has been a fearfully hot day. Tomorrow we cross the Line. & there is a Carnival coming off to celebrate the event. There is to be a Fancy Dress & Prizes are offered for the best Costumes. \n","54":"\n\nDuring the early hours of the morning I felt mighty uncomfortable, so I hopped out on deck & strolled about for a while. Le came to about 1 p.m. & informed us that one of the patients died during the night. It gave me quite a shock, as the chap (Cotmore) went ashore at Colombo, amp; seemed quite well; but he had a serious relapse of malaria. This is out first death aboard. He was buried at sunrise this morning. The Diggers are going very sore because \"Last Post\" wasn’t sounded. Tonight there is a Carnival on to celebrate the occasion of crossing the Line; which we did at 2 p.m. Yank has gone as an Arab, & Kirkbride as a Sister. Postle went as a Jew. They all looked very well.\n\nWed. Mar 5 (cont)\n\nThe Carnival last night was a \"wash out\" as the Diggers refused to take any interest in it.\n","55":"\n\nThe Diggers are getting tired of the trip & today they are holding meetings all over the place & airing their grievances most of which are imaginary. Since leaving Colombo we have travelled very slowly. The new crew that signed on are not yet settled down to their Job, so I suppose we won’t be hurrying up for a while. Things are fairly busy in Hospital. Plenty of malaria cases, but, happily, none very serious. The Diggers are holding a Concert on their own tonight without any assistance from the Heads. Played Poker for a couple of hours & lost 2 bob. \n","56":"\n\nIt rained heavily last night & early this morning, & when I woke up I discovered water flapping round my feet. I hopped out quick and lively & had a Bath and put my Blankets out to dry. Had Salt Ling for Breakfast which was anything but nice. 9 of our patients were discharged this morning. We got 3 new ones in, so now we only have 8 patients, but I guess our Hospital will soon fill up again. One chap, named Jones, came in very bad. It appears he has been eating Cocoanut since leaving Colombo, & it has upset the working order of his . Postle & I had quite a busy time with him for about a couple of Hours. After Tea the Head Sister gave us a severe lecture, so I wouldn’t be at all surprised to receive the Order of the Boot at an early date. \n","57":"\n\nThe fourth officer of the ship was admitted last night with an inflamed appendix, but he seems pretty right again this morning. Jones is still pretty bad. \"Poss\" & I gave him another anema this morning. Poor beggar he can’t eat anything & has to be fed thro’ the rectum. The Matron had another few words this morning about the Pyjama washing, but nothing came of it. Murphy & a few others paraded to the S.M.O. after Dinner, & \n\nafter a deal of argument the S.M.O. gave ‘em 5 hrs to wash 6 suits of Pyjamas. Things are only middling. Poor old Yank is at Loggerheads with the Sergeant again. He doesn’t seem able to do anything right. This ship is travelling slow. We only did 300 miles yesterday. \"Poss\" had a tooth out today & is suffering from a sore Jaw.\n\nSun.Mar.9.\n\nPoor old Jones died this morning at 3. Lakin said he died quite peacefully. Poor chap, it’s mighty hard lines to die when only a few days from Home. The wind has freshened up & the ship is rolling about a bit. Mr Morrison, the ship’s officer is coming along nicely. Kelly, one of our patients is working in Yank’s place as orderly & he & Cornwell & I get on well together.\n\nThis time next week the W.A.’s ought to be safely Home & we hope to be on our final spurt Home. I must try and write some letters before Thursday, so that they can go overland to Sydney. I wonder if Lill knows I am coming Home yet. What a glorious time it will be when I am actually Home. Even now I can hardly realise that in a few days I shall actually be hearing B.E. speak.\n\nMon.Mar.10\n\nThis morning the sky is quite dull & grey with low hanging clouds. The sea is very rough & there are many vacant seats at mealtimes. The wireless operator is in touch with \"Aussie\" so that sounds as tho’ we are nearing Home at last. Poor old \"Poss\" is still sick & can’t eat anything. Mr Morrison the ship’s","58":" officer is getting along nicely. He is a very nice chap to talk to. We only have seven patients in now, & none of ‘em are very sick. We ought to be on our final stage for Home by this time next week. Up to mid-day today from noon yesterday we only did 266 miles, so we are going very slow. Col. Barrett gave us a very interesting Lecture tonight on the \"Origin of the Tanks.\" Browning our mental patient appears to be getting quite alright again.\n","59":"\n\nThe sea is a bit calmer today, tho’ the wind is blowing strong as well. One of the officers informed us that we were making good headway & he expected we should arrive at Fremantle at about 8 a.m. Friday. I looked thro’ my Gear today to see that everything is clean, as I don’t want to arrive home with anything dirty. The W.A’s are polishing up their Gear, ready for going ashore. Even now I cannot realise that I am going Home. I keep on thinking that I shall wake up & find that I have been dreaming. I must send a wire from Fremantle to B.E. & let her know that I’m nearly Home, so that she can get our Bag packed ready for the wonderful event. I need also try & write a letter before Friday.\n","60":" Mar\/12.\n\nThe weather is quite mild today & the sea is fairly calm. We received the 10\/- prize today for having the best kept Hospital. Cowell, Kelly, Postill & I played a hand at Poker, as it wasn’t worth while splitting up the 10 bob. Cowell had a pair of Jacks, & I drew a pair of Kings, & so won. \n\nWe also raffled the water colour that Gribble painted, & a chap named Nash won it with 10\/-. After Tea there was a Boxing Tournament, which was most amusing & passed a couple of hours away quite pleasantly. We expect to arrive at Fremantle on Friday morning, so these W.A’s only have another day to spend on the Boat.\n","61":" Mar.13\n\nThe W.A.’s are all polishing up their Gear today & preparing for the great event of going ashore & Home. Kirkbride & Cunningham are the only two on Ship’s Staff. We are getting along at a fair rate so we ought to arrive at Fremantle early tomorrow morning. I wrote a few lines to B.E., but couldn’t say much, as I don’t know when we are likely to be Home. Also wrote out a couple of wires, one for Lill & one for Mother so that Kirkbride can take it ashore with him tomorrow. Gilbert, Lakin, Cowell & I played a Game of Cribbage which passed away a very pleasant Hour. We only have four patients in Hospital now, so things are quiet. It is a Lazy Life, & we shall feel it when we have to start work again. \n","62":"\n\nLakin woke me up this morning & said \"Get up & look at \"Aussie\". I hopped out of Bunk & gazed on the Long-Looked for Land.\" It gave me quite a thrill to think that somewhere on that great island the daintiest pair of feet were walking, & the sweetest blue eyes in the world were spreading gladness around. It makes B.E. seem so much nearer now. We arrived at Freemantle at about 3 a.m. or rather outside Freemantle, we were not allowed anywhere near on account of the ‘Flu Epidemic. A couple of water barges soon came alongside, & brought some Papers along, which were needed as we hadn’t any news of Aussie for many weeks. We were all mighty anxious to know how the Epidemic was progressing & \n\nArrival at Freemantle\n\nit was a great relief to find out that it wasn’t as bad as was reported. The Port M.O’r came aboard bout 8. They took everyman’s temp on the Boat, & we were all relieved that no one was above normal. A number of Letters & Telegrams came aboard, which gave great pleasure to the recipients. Several parties of Girls came out in motor Launches, but they were not allowed near the ship, which was hard Anyhow they gave us as good a welcome as possible under the circs. Piles of Books & magazines, & Fruit were sent aboard, all of which were mighty welcome. About 4 p.m. the W.A’s managed to get away. We gave them a rousing cheer as they left & looked on them with envious eyes. About 10 p.m. we resumed our journey, & are now on the way to Adelaide our next port of call.\n","63":"\n\nThe awning has been removed from the roof of our Hospital, & as it is somewhat draughty without it, we now make use of the empty cabins. One doesn’t feel quite so fresh when waking up in the morning, but being able to hop straight into the Bath has its advantages. \n\nI was having a yarn with the Chief Officer this morning & he said that if we were to call at Adelaide, Melbourne & Hobart it would be about 14 days before we reached Sydney. I hope to goodness we don’t have to go into Quarantine at Sydney or that we don’t have to go round to Brisbane with the Boat; as they say the ship’s staff has to do. more days before I have the pleasure of seeing B.E. O well, I suppose I can stand it, as I’ve stood it so long.\n","64":"\n\nWell, I reckoned on this trip taking about 6 weeks, but I’m afraid I’m a bit out of it. It was very assuring to see the crew having their temps. taken this morning. One chap held his head up in the air, just as if he were balancing a feather on his nose. Postill is away on the Temp. racket, which means that I have to do a bit more work. The sun is shining & the sky is a glorious blue. I wonder what B.E. is doing today. Another Sunday to go & I ought to be a \nbit\n nearer my Goal. It seems might hard to realise that we are nearly Home. Everyone says the same, too.\n\nWe had some very nice Roast Lamb & Baked Potatoes for Dinner today, which made me think of Home. I wonder how Kirkbride is enjoying himself in Quarantine.\n","65":"\n\nThe sea is not quite as rough this morning, but the wind is very keen & the ship still rolling a bit. The Hosp. is filling up again; keeping us on the move. A chap named Roberts, from Manly came in last night. \"Poss\" & I gave him an ananema, which \"put the wind up him\" somewhat. He is alright this morning.\n\nThe rumour is that we are \nnot\n going to Hobart from Adelaide, which will be a mighty good job if it’s true, as it will bring Sydney a few days nearer. The Food continues good & we manage to satisfy our patients; which is a big item. We have 8 malaria Patients in now, all \"Gentleman of the Light Horse\". They are a very decent crowd.\n","66":" Mar. \n\nThey say now that we are going to Hobart, but I’m hang if I know what to believe.\n","67":"\n\nArrived Adelaide\n\nArrived Adelaide about 9 a.m. anchored well away from the others. Mr Morrison, the 4th Officer went ashore, & so did Faisley. He is the only one of the staff for Adelaide.\n","68":"\n","69":"\n\nWe tipped all our Guests out of Bibby’s Hotel today, so that we can get the paint cleaned up. The S.M.O. says we can continue to have our have our meals & sleep there. The Head Sister doesn’t like the idea of it. Poor woman, I’m afraid her liver is not too good. It is pretty rough, & our old Boat is rocking some. I finished off my letter to B.E. but it’s not much use posting it in Hobart.\n\nArrived Hobart","70":"\n\nThis morning we went out on Deck & found ourselves anchored in a very pretty little Bay. The surrounding country was very pretty. We appear to be miles away from anywhere. \n\nWhen I was in France we used to joke about coming Home, & say that by the time we reached Home the people would be so sick of the sight of returned soldiers that they would take us round all the Back Streets, & now, owing to the confounded that’s just what they are doing. One Tasmanian went ashore in a Launch, we took some supplies aboard & sailed away for Melbourne about 3 p.m. \n\nWe are due in Melbourne on Monday morning.\n\nOwing to a few words we had with the Head Sister Bibby’s Hotel closed today.\n","71":"\n\nWe expect to reach Melbourne early tomorrow morning. We had Breakfast in Isolation & just as we’d finished the S.M.O. strolled in. \"Hello: he said, \"are you still working here? About 380 are getting off tomorrow, so we shall travel very light round to Sydney. They say we are not going to stay to take on coal & water, but are going straight on to Sydney as soon as we have dropped the Troops. I hope so, as we shall get Home all the quicker then.\n\nI wrote a letter to B.E. & one to Mother & Co, & sent them wires. Gave ’em to Lakin to post. After Tea we had a Farewell Gathering in Suswy’s Cabin. Len Read, Snowy, \"Gib\", Maj. Crow, Paddy Burke & the 2nd Steward were there. We actually had two Bottles of Whisky. \n","72":"\n\nPassed in between the Heads at 6.30 & dropped anchor off Portsea at 7 a.m. The country is very pretty around here, & the Buildings in Isolation look quite comfortable. Posstill, Jennings, Lakin, Len Read, \"Snowy\" Martin, Maj. Crow & a number of others went ashore, so our Ships’ Staff is now very much deleted. The little whisky I had last night did not agree with me at all, & I suffered for it during the Day. We took a supply of Fresh meat & other supplies aboard. One of the crew on one of the Tugs was wearing a ‘Flu mask & his appearance caused quite an exciting flutter among the Diggers. \n\nWe left Melbourne about 10 p.m. & are now on the Final Lap. Received wire from Mother saying they were well.\n","73":"\n\nWe are doing 15 Knots today so we ought to arrive in Sydney by Dinner time tomorrow. \"Gil\" & I had a busy time packing. We got paid today, each man receiving £. They say we are sure to have to go into Quarantine but I’m hoping we don’t. \n\nGee: but it’s great to know that we are so near Home. We are getting plenty of fruit & Biscuits now & other Red X stuff.\n\n\"The Day\",","74":" Mar.26\n\nA Glorious sunshiny, real Australian Summer’s Day. I woke up about 5.30. hopped out of bed, & had a shave with Cowell’s Razor (A Bengal) as mine is out of order. (That’s one thing I must get as soon as I get ashore) \"Reveille\" went at 6, but I think everyone was up before then, as this is the wonderful Day when we are to arrive in Dear old Sydney. I feel that bloomin’ excited that I’ve got a Headache. I wonder how B.E. feels this morning. Gilbert & I had great fun in packing our Kit Bags. Mine are filled almost to bursting point & weigh very heavy. We are steaming 15 Knots, so as to get in as soon as possible. We arrived outside the Heads at about 2.30, but had to wait outside for about an hour before the Pilot came aboard. It was quite an exciting time coming thru’ the Heads, as we were not\n\nsure whether we were going to Quarantine or not. Our hopes were dashed to the Ground when we turned in towards Manly. A New Zealand Boat & the \"Sonoma\" were anchored in Quarantine & as we passed they gave us a hearty cheer, the only sign of a welcome Home we have received so far. one chap on the \"Sonoma\" played a number of Patriotic Airs on a Cornet, which sounded real good across the water.\n\nA number of Manly Boats passed us & gave us a welcome with their Handkerchiefs I looked thro’ \"Gib\" Telescope to see if I pick Lill out, but even had she been on one, the Boat was too far away for us to distinguish anyone. They took us ashore in Launches. Our Bags were carted up to the Camp on G.S. Waggons, & we had to climb up the Hill to the top of North Head, where our camp is. 6 of us to a Tent. It was a wild scramble to draw Blankets & eating utensils, & everybody was in a Bad Humour. After a feed of Bread & Jam, Gib & I turned in between our Blankets as we were knocked out with the Day’s excitement.\n","75":" Mar.29. \n\nIt was a bit of a \"thud\" to come from sleeping in a Saloon Cabin on the \"Lancashire\", to have to sleep in a wooden floor with just a blanket under me, but I enjoyed it. I can’t stand a soft bed. There were only four in our Tent so we slept with plenty of Room between us. We \"turned out\" at about 7 a.m. had a wash & then strolled down to Breakfast. There was lovely white Bread, plenty of Real Butter & mutton chops. It’s a long time since I enjoyed a Feed so well. Before Breakfast we had Coffee Biscuits, which went down well.\n\nThe crowd from the \"City of Cairo\" are also in Quarantine. They are Munition Workers. At about 10 a.m. I sent an Urgent Reply Paid wire to B.E. to know how they all were. I haven’t heard any news of her for ages & I’m feeling anxious. \n\nThurs.Mar. 2 (cont)\n\nIt is about 7 p.m. now & I’ve received no reply, so I don’t suppose I shall hear now till tomorrow. I’m hoping to get a Letter then, so I must just grin & bear it. It’s very nice to know that B.E. is so near, but it’s mighty\n\nhard to be \"so near & yet so far.\" I wrote B.E. & Nell & Mother during the day. We are quarantined for seven days so the sooner next Wed. comes the better. During the afternoon \"Gil\" & I went for a stroll & tried to pick out some of the Local spots with his Telescope. Seeing the Manly Boat go by made me wish I was aboard one of ‘em with a certain Little Lady with Blue Eyes. Ah well, all that’s to come.\n","76":"\n\nThis morning I got a wire from B.E. saying they were all well. That has made me feel a bit more satisfied, as I was beginning to wonder what was wrong. The wire was handed in at 2.15 p.m. so it’s not B.E.’s fault that \n\nit didn’t arrive sooner. We had stew for Break. It wasn’t \nbad\n, but the very fact of it \nbeing\n stew turned a good many off it. The War Chest Club are making our stay as pleasant as possible by raining Fruit, Biscuits & Smokes & Daily Papers. The Military Rations are mighty scarce & need augmenting. I got a Parcel & Letter from B.E. during the afternoon. A jolly good Parcel & very welcome, but the Letter was the \nmost\n welcome. B.E. writes the most beautiful letters, & then calmly says she wishes she could write as nice Letters as I do. Why mine are not a \npatch\n on hers. Gib & I had a swim & at night we went fishing, but didn’t catch anything. It was glorious scrambling down the rocks, & sitting on the Beach watching the Manly Boats go by. I wrote a Letter to B.E. during the Day also to Nell &am Mother. I wonder what Luck they had in getting a Cottage. I’m anxiously awaiting the arrival of \nanother\n Letter now. \n","77":" Mar.29. \n\nAnother Glorious Day. For Breakfast we had Mutton chops Bread, Jam & coffee. After the Tent Parade \"Gil\" & I scrambled down the rocks to the Beach, where we spent the morning splashing about in the water & sunning ourselves on the Beach. It was great. The only thing to make it \nperfect\n would be to have B.E. here with me. I got another Letter from B.E. this morning, & this afternoon I got a Parcel containing Home made Cake, Tinned Fruit, & cream & a tin of \"Soner\" Tobacca. A real sensible Parcel. Didn’t the crowd enjoy the cake, my word they soon made a mess of it. We have a good deal of \"shop\" cake lately but anything \"Home-made\" appeals to the crowd. We spent the whole of the afternoon on the Beach, & I feel deliciously tired tonight. The fellows are enjoying being here. To see them on the Beach, romping about on the sand, & playing Leap Frog, etc, one would imagine they were a lot of Kids. Tomorrow I must write to Mother & reply to the Letter she wrote to Lill & me.\n\nSun.Mar.30th Another glorious day. Received parcel no 2 from B.E. & Nell containing a delicious Home made cake which the crowd at my table greatly enjoyed. The Tinned Fruit & cream we had for supper. Gilbert & I start the day in the surf. It was glorious I had a good Sun Bake. It was my turn to get the morning coffee. Next Sunday I hope to have the extreme pleasure of taking morning Tea in to B.E.\n\nThe time is passing by quite pleasantly, but the sooner Wed. comes round the better. After Dinner we were marched down to some buildings near the main Quarantine & went thro’ this . We went for a swim afterwards. I write to B.E. also Mother & Nell.\n","78":" Mar.31st Another month gone only one more Day to go & then my dream will come true & I shall \nsee\n B.E. & the wonderful Boy. I was very disappointed at not getting any Letter from B.E. today. Thought she would surely write to me on Sunday, but then of course, she may have been \ntoo\n busy. I wrote to B.E. during the Day. The sun was very hot & it made me quite sore. The Y.M.C.A. erected a Picture outfit & we had quite a good open air Picture Show at night. I’m hoping to get a Letter from B.E. tomorrow to know how she got on about the Cottage.\n\nHislop, one of the chaps at my table lent me his Camera & I took a number of snaps. Hope they turn out alright, as they will be interesting souvenirs.\n","79":" Our last Day in Quarantine. It has seemed a long time going, but now it’s gone it only seems like a Pleasant dream. Thanks to the War Chest & Comforts Fund, our stay here has been made very pleasant. Last night a Southerly Buster blew & down came many of the tents. Luckily ours was well pegged down & stood the strain. The mess tents were blown down & we had Breakfast in the open air. I was rather disappointed at not getting a Letter from B.E. but I suppose they have been busy preparing for tomorrow. After Dinner we erected the Mess Tent. It rained almost all day & made things rather unpleasant. We had a sing song in the Y.M. tonight, which passed away a very pleasant couple of hours. It is 9 o’clock now & we are going to Bed to prepare for the \nGreat & Glorious Morrow\n\n"}}