{"Document Name":{"0":"Diary_0233","1":"Diary_0233","2":"Diary_0233","3":"Diary_0233","4":"Diary_0233","5":"Diary_0233","6":"Diary_0233","7":"Diary_0233","8":"Diary_0233","9":"Diary_0233","10":"Diary_0233","11":"Diary_0233","12":"Diary_0233","13":"Diary_0233","14":"Diary_0233","15":"Diary_0233","16":"Diary_0233","17":"Diary_0233","18":"Diary_0233","19":"Diary_0233","20":"Diary_0233","21":"Diary_0233","22":"Diary_0233","23":"Diary_0233","24":"Diary_0233","25":"Diary_0233","26":"Diary_0233","27":"Diary_0233","28":"Diary_0233","29":"Diary_0233","30":"Diary_0233","31":"Diary_0233","32":"Diary_0233","33":"Diary_0233","34":"Diary_0233","35":"Diary_0233","36":"Diary_0233","37":"Diary_0233","38":"Diary_0233","39":"Diary_0233","40":"Diary_0233","41":"Diary_0233","42":"Diary_0233","43":"Diary_0233","44":"Diary_0233","45":"Diary_0233","46":"Diary_0233","47":"Diary_0233","48":"Diary_0233","49":"Diary_0233","50":"Diary_0233","51":"Diary_0233","52":"Diary_0233","53":"Diary_0233","54":"Diary_0233","55":"Diary_0233","56":"Diary_0233","57":"Diary_0233","58":"Diary_0233","59":"Diary_0233","60":"Diary_0233","61":"Diary_0233","62":"Diary_0233","63":"Diary_0233","64":"Diary_0233","65":"Diary_0233","66":"Diary_0233","67":"Diary_0233","68":"Diary_0233"},"Date":{"0":"unknown","1":1817.0,"2":1818.0,"3":1822.0,"4":1831.0,"5":1835.0,"6":1836.0,"7":1837.0,"8":1838.0,"9":1845.0,"10":1847.0,"11":1860.0,"12":1861.0,"13":1862.0,"14":1863.0,"15":1864.0,"16":1997.0,"17":2048.0,"18":2054.0,"19":2061.0,"20":2062.0,"21":2063.0,"22":2064.0,"23":2065.0,"24":2068.0,"25":2069.0,"26":2070.0,"27":2071.0,"28":2073.0,"29":2074.0,"30":2075.0,"31":2076.0,"32":2077.0,"33":2078.0,"34":2079.0,"35":2080.0,"36":2081.0,"37":2082.0,"38":2086.0,"39":2087.0,"40":2088.0,"41":2089.0,"42":2090.0,"43":2091.0,"44":2092.0,"45":2099.0,"46":2100.0,"47":2106.0,"48":2107.0,"49":2108.0,"50":2109.0,"51":2110.0,"52":2111.0,"53":2112.0,"54":2113.0,"55":2114.0,"56":2115.0,"57":2116.0,"58":2117.0,"59":2118.0,"60":2119.0,"61":2120.0,"62":2121.0,"63":2122.0,"64":2123.0,"65":2124.0,"66":2125.0,"67":2137.0,"68":2138.0},"Entry":{"0":"\n\nDiary No.\n\nCommenced at Bohain\n\n","1":"\n\nBohain","2":"\n\nI arrived back to the unit on Sunday morning \nor eve\n from 'Blighty' leave, & ever since then I have had the blues in consequence of the awful change from the gaiety of London celebrating the signing of the Armistice, to cold soldering in France.\n\nThe first part of my leave was spent with Dad , in visiting & shopping by day & attending theatres by night. Mrs. Palmer visited us for the week –end & on the second Thursday of my leave we had a party at home when the Parrs, Snowy Eva his fiancé, Marie Sawyer & a couple of friends paid us a visit. It was a splendid evening, & after Parrs land Snowy left we had some dancing. \n\nIt was gay dancing too, for Bobby a friend of Lily`s from the Land army high spirited & full of fun, set the pace in reel dancing. It was not particularly mad but irresponsible, & we enjoyed \n\nourselves immensely. \n\nDuring the weekend I visited Weymouth & had a few happy hours with travelled on to Chichester & spent a fine time with Lily, watched her at work, then spent Monday night at Caterham with Mrs. Palmer .\n\nOn Tuesday I arrived in London, met Bobby & spent the evening with her at \"The Boy\"; got a day’s extension of leave, & spent the best part of the following day with her ending up at the \"Empire\" to see Clara Butterworth in the \"lilac Domino\". I enjoyed the play more than any other, for Clara Butterworth is a real actress.\n\nThe journey back was tragic. I spent the first cold night with one blanket at Boulogne, the second with no blanket at Roisel, & the third in the same miserable condition for most of the night, At Fresnoy le Grand. As soon as I reached the unit & found that\n\nthey were likely to stay for a few weeks, I made arrangements to commence the classes again, & we got to work yesterday afternoon in a room which was used as a class room in the pre-war days. \n\nWe are billeted in a large girl’s school, a section to a room on the first floor, & each room has a fire. It is quite comfortable & I have been lucky enough to get a bedstead; one of those which the Germans used when they made the school into a hospital. Our charwoman is in the same road but a hundred yards away, & was probably part of a boy’s school which was run in conjunction with the other a larger one.\n\nThe authorities have asked for the names of those who left Australia in January & February 1915, probably with the idea of sending them home soon. Seeing that I left\n\nAustralia in July of that year, it seems possible that I shall be sent back in a few months – possibly four.\n\nWe are supposed to go to Germany in two day’s time. At least we are fairly certain to go to Germany, & to have march most of the way, but when we shall start is not yet known.\n","3":"\n\nWe started from Bohain at 9.30 on Saturday & marched through very miserable battle wrecked country to Massinghien, where we stayed in the same billets as the","4":" had occupied when they were there the week before. They were underground in a factory, & the beds were composed of wire netting stretched over planks, & for these we had to thank our mutual friend Fritz. \n\nA few days before we started it had been found out that we were to garrison & that we should have to march most of the way. Then rumours commenced of the expressed desire of Mr. Hughes, in contradiction to our Corps leader General Monash that we should not go to Germany, but go back to Australia as soon as possible. How much truth there was in this I am unable to say, \n\nbut it was generally understood that we were not going to Germany after all.\n\nHowever, Massinghien had been originally been given as the first halting place on the way to Germany, & it was certainly on the way, so when we arrived there it was impossible for us to conjecture what was going to happen.\n\nThe next morning we started at 9 \nfir\n due last again & put up in a ruined house \nfor\n two kilos short of Cartignies & like the previous day, eighteen kilos \ndistance\n march, that evening.\n\nCartignies may be said to mark the border between stiffly contested country, & that country out of which the Germans were unceremoniously & quickly pushed Before Cartignies all was wrecked, & the ground showed evidence of \n\nregular shell fire. The town itself was untouched except for one or two rows of houses which were burned down, undoubtable by Fritz. on evacuation. Todays march was over the country from Cartignies to Beugnies which is nine kilos beyond Avesnes. This country showed itself as picturesque, despite the weather, which, after two days of clear sunshine 2 frost, was muggy & raining. The pure green of the grass, the pretty cottages which had a peace time neatness, & the woods, even in their bareness retained a dull tinge of gold, were together pleasing to the eye. Such shell free country as we came across was not large, & the shells had fallen singly where in the other country they had fallen in barrages. All of this goes to prove that \n\nthe Germans were hastening to wards towards their Sedan when the Armistice was signed. The young lady who is the daughter of our present landlady in Beugnies ( For George Goode I got a room without much difficulty) told me that the Armistice was signed two days after the Bosche evacuated this village.\n\nAvesnes is a large town divided into two parts, the one on the hill nearest Bohain known as Avesnes proper & the lower town this side of the hill known as Avesnelles. At the bottom of the hill the railway runs close to the road, & there we see a scene of terrible destruction. we thought at first that it was the work of our planes but I have since found out it was done by Fritz when he was forced to retreat. A whole munitions dump in loaded \n\ntrain, was blown up with great devastating effect to the surrounding earth & houses. The dump itself was just a patch of black earth covered with blackened shell cases, across which earth lay the twisted skeleton of the munition train. The road we were following crossed the railway through the train so to speak for a portion of it was on our right while the main part of the train & the dump were on our left. That part of the train which was on our right was only partly damaged; half of one truck was blown up & in the remaining corner unexploded ammunition was laid bare.\n\nAs soon as we arrived in Bengnies I set out to look for a bed. I found plenty of civilians in the village,\n\nvery little damage done by shells or bombs, but no shops open yet. That is because the civilians were on rations still, which is not remarkable remembering that the Germans have only been gone a fortnight. It can easily be seen that things are rapidly returning to normal.\n\nWe arrived in the town by a by road, but just and the barn which was allotted to B Section as a billet I found a main road. Where it leads I do not know except that it is probably north & south & therefore perhaps between Mons & south. Along this road I found a little cottage where madam was good enough to give me a room, although she already had refugees billeted on her.\n","5":"\n\nWe have been in the village for a fortnight & now we are in the process of moving out.\n\nThe first week of our stay here we had classes, but these, on account of the very miserable cold weather, & the large number of men on leave, were not well attended. Consequently I decided to discontinue the classes & hold debates and lectures, and the plan has turned out to be a wise one, for we now have many newly \nmembers\n interested men in our audiences, & have been glad to see fresh faces among the debaters. My debating prestige has suffered an eclipse, by Messrs Barlow & Waites - the former a B.A. with an ambition of joining the church, with views not altruistic yet very broad – the latter a very hard headed wizened yet kindly Jewish chap. The latter was conspicuous in unit debating \n\n \n\nin the days before I re-formed the unit, but he kept well away from my institution until Hondeghen days, when he evinced a certain desire to draw nearer. Possibly the \nsolidarity of the\n permanent nature of our debating society gave him a favourable impression, but it was the tactful presence of Barlow which brought him whole heartedly into it, as the result of some friendly debating they had in C Section billet.\n\nAt present we are preparing a timetable for, & discussing our intentions with regard to our stay in the next location, which will be Chateleine near Charleroi.\n\nAll ideas of going to Germany are, I believe, thoroughly exterminated. Instead I understand that we are to stay in Charleroi for a couple of months, after which the demobilization plan will come into force. They have sent the Jan &","6":" men back \n\nto Australia, & a short time ago they took the names of the March to June men. This, naturally raised hopes in my breast, for I would have been next on list. Unfortunately, howeve, I have since learnt that the names were taken only as a means of finding out which men to take if there was room in the convalescent transports. It is unlikely that any more will leave now, so that I must await the demobilization scheme with the hope that it will take account of service.\n\nDuring \nmy\n our stay in the village George Goode & I have had some very happy hours in our village with mdme, Ms, Jeanne &Louis. We have tried to add to their scanty food ration by gifts of bully beef & canteen biscuits & chocolate, although the first few days witnessed a famine in all food stuffs owing to the unrepaired railway & \n\ngeneral difficulties of transport. Still, we have been able to repay in some small way their kindness in making us free in the bed room without taking any money for it, & doing such friendly service as cleaning muddy boots against our will & giving us unlimited coffee as well as cooking little dainties which we have been able to buy.\n\nDick Barlow has visited us many evenings, & has delighted all of them by sketching them each & individually, which he is able to do in a not inexpert manner.\n\nJeanne is happy & healthy looking. She was a school girl when the Germans came, & now she is a woman, not the worse for experiences since she is still able to lighten the house with her smile, & has lost no vigour in her performance of domestic duties, as many of the poor people have. The peculiar & very beautiful trait about her (to my eyes) is the sisterly affection with which she makes us at home & chums up with us, utterly in contrast to the other French girls we have been in the habit of seeing. They went to extremes. Either they were absolutely cold & distant, experience having probably taught them that that was their best plan with soldiers, or else they were on terms of intimate foolery which bordered on the coarse. The latter had probably found how far they could go with perfect safety & delighted to hover\n\nround the boundary. Some probably went over it, for it is a question of what is generally referred to as bringing up..\n\nWatching Jeanne at work of an evening I have discovered that she is a pretty girl, slightly sensitive to notice, - that is, not entirelly unaffected, yet very sound. I think she would respond to well to certain contingensies if necessary, & is deserving of a husband above her station. I have not fallen in love with her, but I like her a great deal; mostly I think, because she is open & bright. Even speaking French fairly well as I do, it seems hard to get to know people intimately.\n","7":"\n\nTo-day is Sunday and the weather has been simply glorious, a great contrast to the week days. The sun shone warmly and the mud seemed a little less troublesome, although the puddles & holes were still full of soft mud.\n\nDuring the day I continued to arrange matters in readiness for Charleroi, & this evening a meeting was held to elect a new secretary for the Central committee, & to discuss the arrangements. Harry McNeil, who was secretary of our concert committee, was elected secretary. The attendance at the meeting was not good, & the sporting demand – mostly of the transport was conspicuous in their apparently intentional absence.\n\nI have noticed that they are not fond of attending such meetings, yet they seem to join in with the arrangements afterwards. Those that did attend were enthusiastic, - \n\n& so the tone was lively. With the anxiety of the Colonel to prevent a feeling of discontent gaining ground in the times of waiting that are ahead, a new activity is arising, & the enouie & indifference among a certain crowd of the Ambulance, seems to be passing. The debates have no doubt helped to cause this, but the departure of our old friend Mr. Garland the W.O., who though as a sergeant on the Peninsular he was popular, was of late very unpopular, has had a good effect on the attitude of the men to movements for their good. \n\nThe new W.O. Mr. Grey, who was a Sergt. with the","8":" Field Amb., arrived today, & at least will be more in sympathy with all of us. At the same time one must remember that the war is over now, & that such an attitude is therefore easier & natural. \n","9":"\n\nI am writing up the diary tonight in the dynamo room of a large farm a third of the way from Bengnies to Le Chatelet, which is our destination beyond Charleroi. After many false rumours of moving off we actually started off this morning, which was three weeks after we arrived. Our stay was supposed to be for one week only, but was drawn out to three by repeated postponements of our departure.\n\nBy the time we came to leave our little white cottage by the side of the main road ( which I now know goes from Avesnes to Charleroi & is only a semi main road) & I had become very much attached to the family, & particularly to Jeanne, whom I had been teaching English with not slight success.\n\nTeaching English to a pretty \n\nyoung French girl is a nice pastime, & likely to lead to quite other results than the mastery of the language, but we did not fall in love with each other Papa & mama were very strict with Jeanne. They would not let her out of their sight where there was a possibility of her being alone with any strange young man, neither did they like her to be too free in talk & manner with our soldiers – say George Goode & I. This much I partly observed & partly received from the little girl herself.\n\nSeeing that she had lived through the four years of German captivity without mishap, such severity was not only natural but absolutely necessary, for she had grown from 14 to 19 in that time, & had been practically isolated from the\n\nworld all the time.\n\nI did however get very fond of Jeanne, & she got very fond of me. The whole family was very grateful to George & me for little help we were able to give in the way of food, & also for our gracious presence. It was the rebound from the \"tristesse\" occasioned by their late German masters, in which we found them. This was the progenitor of the feeling Jeanne had in the end, & it was ripened by the English lessons \"c’est fini – allez vous en\".\n\nI am sick of eternal committees, study circles, Education officers & the whole box of tricks. \n\nThis feeling is caused by the impossibility of reconciling classes with that awful bogey regimental law as practised by the section\n\n \n\nsergeants. Another factor is the newly arrived Education Officer, who is not honest, & is very voluble. He seeks to make his office a sinecure by large promises contained in many pseudo enthusiastic words.\n\nA rank of sergeant is to be conferred on me, & ( the question having caused me much thought & no little ) I have decided to continue to organise the classes until the falsity of such a promise may be proved. This will not prevent me I am hopeful & feel almost sure, from joining a scholarship for a university course in England, which is my immediate objective, for I have decided to continue teaching until jouurnalism is possible\n","10":"\n\nI woke up the following morning, bustled around & was on the way to being ready in plenty of time for \"workhouse\", when I discovered that my boots were gone. Search in every corner of the store, & under the old bed which Joe Riches had dragged into the dynamo room failed to unearth them & so I paraded to the Colonel as soon as I had breakfast. He immediately decided that I must go straight on to Chatelet by car. Meanwhile madame who apparently owned the electric lighted farm by the mill, was heart broken that such a thing should happen to her, the woman who many a time succoured French, English & Russian prisoners at her own peril. It must have been \" said she\" the stranger in a German coat who drove away \n\n \n\nin his \ncar\n trap early this morning.\n\nArchy Garlick, (now acting .C.Q. M.S.) was the only other passenger in the car which drove me off in pelting rain. After we had passed Sivry which was to be the resting place of","11":" that night, \n& had\n near the main Charleroi to France road, a spring broke & we were landed exactly outside our estaminet.\n\nWith good luck we had the rations on board (or what was the use of a C.Q.M.S.), so we worked ourselves a meal on the nice enamel stove of the madame of the Estaminet who disliked Germans & who sold a fiendish substitute for liquor at one mark per glass. Seeing that German money is all over Belgium we cannot object to dealing in it, but the rate of exchange (1 franc .25c) seems to me to be fairly high. However they are \n\n \n\ncalling it in now, so we have to be wary of being in possession of it when the day of reckoning comes along.\n\nWe arrived at Chatelet at about 3 p.m. after passing through about two miles of town with tram lines complete, not to mention numerous coal mines. The hospital which I found some of the tent subs had commenced to run, was a large building built three sides round a small quadrangle reached by a small gate. I slept the night on the third floor after a trip to the \"Sentimental Bloke\" in company with Scotty McNeil, Monaghan & Walter Connor.\n\nThis morning I walked around the town, played the piano at the Hotel de Ville, bought some milk chocolate & unearthed the Educational building\n\nThis I found in the same street (Rue de Station) as the hospital – the main road to Namur, as it happens, & this town is some 30 kilos away. The building is on a corner, & was a grocers shop. Now it has to have the canteen on the ground floor, together with barbers, bootmakers & a recreation room; the Educational establishment on the first floor, & C section bearers at the top.\n\nBeing a corner house the rooms \nrun\n are built in the form of a semi circle. Thus, on reaching the top of the first flight there is a small room to the \nright\n, a medium on half left, another in front, another still half right & a fellow to the small one to the right, with the second flight going up this side of the door. \n\nI bagged the small room\n\nto the left as an office & sleeping apartment; in fact I am writing in that room now, with a candle on the window ledge, & also some books, my holdall & eating gear, & the rest of my kit on the floor. My table & chair are the result of a raid. \n\nThis afternoon I met Archie Garlick in a large State School: we were both in the same . We found what we were after, got permission from an itinerant youth (the headmaster’s son) on false pretensions, & I bagged a nice soft bottomed chair & a white card table. Archie & a satellite got chairs & pieces of wardrobe.\n\nTonight Dick Barlow came in to to discuss the proposition of sleeping in this room with me. Unfortunately he closed the door after him, & as it has no handle\n\n \n\nwe became \"in the soup\". I soon ended the situation by putting my foot through the door in an energetic attempt to force the lock. The panel came away almost whole, so that, as soon as the door was opened it was an easy matter to replace the splinters & camouflage the door as untouched. If it is found out. the German of 1914 will have to be blamed I fear.\n\nTo show how exact a horse shoe is formed by these rooms, at the present moment some water seeker is fiddling with the taps in the other small room & through two windows I can see him a few feet away from me. I hope he turns the tap off properly: the room is half flooded already. Thank goodness I chose the duller but prettier toned paper in place of bright blue & the risk of floods.\n\n \n","12":"\n\nSeeing that a month has elapsed since I last wrote in this \"interesting\" little book, it is now necessary to fill up the blank somewhat before going any further. As a matter of fact I am at Aust. Corps Central School on the sand dunes north of the Somme 8 km from Rue & 30 from Abbeville.\n\nSoon after writing the matter on the opposite page, Dick Barlow went to Paris with Tony Waights & one or two others in order to get some stuff for Christmas & New Year dinner of the Unit. I felt rather jealous \nof\n from the fact that Tony Waights & Dick did not hesitate to clean out & leave our work on the \npo\n possibility occurring of a trip to Paris – however important they may have been to the success of the purchasing of eatables. On \n\nthe other hand I may have been unduly conscientious in not have looked for trips or taking advantage of opportunities to make them.\n\nHowever, when he was gone & I was left by my self to carry on I decided to start classes in the small way which the absence of Dick & Tony made imperative; a procedure which was in any case advisable owing to the fact that circumstances were not fortuitous for the extensive running of classes. The Ambulance was under strength considerable, all tent men ineffectually kept at work that classes were out of the question for them. The same applied to the special duties such as batmen, bakers,\nsuch\n sanitary men etc. The result was that we started in a very inauspicious way, with small classes, but subsequent days\n\nshould consistent attendance & therefore the assurance of improvement of the classes were properly handled. The unsatisfactory nature of the difficulties to be met, & the increased work, added to the cold rooms, made that work unpleasant. Through moving desks about too strenuously I made myself a little sick, & the result was that I spent a miserable day in bed \non\n at Christmas. I had, however, enlisted the services of Stuart Kidner as librarian & help & that made matters as satisfactory for me as possible.\n\nOn Friday, which was two days after Christmas I had to make the weekly visit to the","13":" Field Amb., who were at \nCharlopoi\n ,near us, we reached them by ","14":"\n tram by way of Charleroi. It was a clear old day, and I was\n\nonly too glad of the change involved in such a trip. By the time I reached the tram terminus of Lad`hui it had commenced to rain hard & blow fiercely & coldly. The rest of the story up to my return from","15":" Field is of transition from the cold of the muddy road to the misery of the mess hall; & thence to the warmth of the estaminet where Lt. Lowe had his office; from this warmth, helped by what Lt.Lowe called a spot & what I called a drink, to the wonderful music & food of the Sgts mess; thence from that happiness to the \nhappiness of\n another form experienced in a brisk walk in a sate of exultation after the music, in the cold if bleak atmosphere.\n\nAlmost my last words to Sgt Phillips \nwere\n (who was on the \n\n \n\npage missing\n\nhim, of course, Tony Waights, who, however left for Blighty the next day \nthen\n from then till Thursday night when we had our next dinner, Dick was too busy with the arrangements to spend any time on classes, but on Friday he commenced taking his classes & a rapid improvement in attendance was thus made.\n\nThe Unit Dinner was a grand affair, of long white covered tables, & a band, not to mention the presence of the Mayor. Owing to the prevailing customs being hard if not impossible to alter, we found the dinner \ndrag\n dragging on to a matter of four hours, so the toasts & speeches were introduced before it was finished in order to give the Sentimental Blokes a fair go; what was my\n\n \n\nsurprise to find that the harpist of this orchestra, whom I had noticed when I attended their opening show in Chatelet, but had not recognised as Frank Pisano who used to play with Rita in orchestras in Grafton. Truly the A.I.F. is a wonderful meeting place. I had imagined him still in Grafton.\n\n \n\nLast stage of all\n\nWe arrived from France on","16":" and went straight from Southampton to Codford camp.\n\nPreviously we had a week in Belgium just before exams (visited Dunkeque, Bruges, Brussels, Waterloo Ghent. Also four days leave at home by a wangle .\n\nCodford\n\nFourteen days leave - conspicuous among others by river trips (3). One with Bobby, one with Hills, & one with Hills . Called on Mrs. Palmer, Uncle Sam, Ivy, Printers School Snow Eva– wife at Streatham, & had good time with Hills.\n\nWeeks extension granted. Sams again & made proper friends with Eileen. Hills again.\n\nTook a week & cycled to Bournemouth. Called on everybody & had a good time \n\n \n\nMeanwhile boats allotted to us:\n\nPrinz Hubertus to sail","17":"\n\nQuevic \" ","18":"\n\nMain \" ","19":" ","20":" 23rd\n\nThen came another four days in London after the 9th was arranged. Spent with Kit again & Hills.\n\nArrived back & found again put back to","21":" Strike of men against continual postponements. One day’s fatigues not done. Was chief delegate & did not enjoy it. \n\nFinal date given as","22":" – more leave granted. Did not take leave. Instead I went to Stockton got a room, and started studying & working on the Short story course which I had paid £10 for. Worked until","23":"\n\n Left Watford for Plymouth on","24":" morning & embarked by tea time\n\non the Main.\n","25":" morning pulled out from Berth, & moved to buoy. Then in afternoon sailed downed to harbour mouth & again buoyed up after many turns round to regulate the compass.\n","26":" Morning. Steamed through heads on our way, but had not gone far before steering gear went wrong. Speed down to about 3 knots & slowly steamed up & down coast while they endeavoured to fix it up. Finally had to return to Devonport.\n\n16th We are still just within the harbour, & understand we are to sail to night or tomorrow morning.\n\n26th-29th Devonport\n\n \n\n \n","27":"\n\nThe following are speeds up to date. We started from Devonport at 12 noon roughly on","28":"\n","29":" to Weed","30":" 276 m\n\n 30th to","31":" 272 m\n\n 31st to","32":" 279 m\n\nThe boat has a fair amount of deck space, but this is taken up by fixtures, and in any case is insufficient for the numbers on board.\n\nWe have a promenade deck on both sides amidships open to troops and families alike. Above that is the boat deck forward half of which is for officers 2& first class passengers ( who are few), and the aft half except on isolation sections for troops above. The aft half deck is for families & troops; the forward one for troops. Aft for steerage passengers (wives etc) & forward\n\n \n","33":"\n\ntroops only.\n\nThis arrangement gives the troops a \nmaximum of at\n the most space possible and does not give the women a fair chance. However, it would be useless to further restrict the room.\n\nOwing to the accidents which occurred in England the crew came to regard this as an interesting, if not mysterious ship. Only one breakdown has occurred, and that was soon remedied, with the loss albeit of a few miles in the days running. \n\nCoincidences have happened in & around this ship.\n\nWe left England in on exactly the same day of the month I left Australia to come over. That was only three days later in the month\n\nthan the day I originally left England. Further, I have met Marshall the troublesome A.M.C. chap who left with me on the Suffolk. He is taking his wife back and appears to have aged somewhat. He is however improved I imagine.\n\nClasses are now running smoothly, and I am putting every available minute into English and Latin.\n\nThere is a girl on board who reminds me of Rita when I met her on the Rangitara. She is younger – coarser slightly but she has the same immature beautiful eyes. I have spoken to her as a result of discovering that her father is Totty, late of the third. She is very simple, but a nice good girl.\n\n \n","34":"\n\nPages \n\nSunday 268 miles Teneriffe\n","35":" 284 miles\n\nThere has been a distressing accident today.\n\nAt about 11.45 a cry went up of \"man overboard\". I was on the forward well deck and saw several of the men rush aft at the sounding of the siren four times. Immediately a boat was lowered from the port side, & pulled around into the wake we had left behind us. Meanwhile the ship had turned right around so that we could see the lifeboat bobbing about in the wake off our starboard side. Several lifebuoys & belts were to be seen floating towards us from our late course, but no sigh of the man.\n\nHe was one of the husbands and had fallen off the poop deck right at the stern.\n\nSoon another boat was lowered fro the starboard side, taking a little longer \n\nthrough jamming. The other was now \nabt\n only to be seen at intervals for the sea had become choppier. The second boat proceeded to search round, picking up the buoys on the way. Once all these were found it soon became apparent that little hope remained.\n\nNevertheless the lifeboats \nwere to be\n carried on their work, and it was not until about 1 that they returned. I helped to pull one up the first & found it a tremendous strain.\n\nNow the poor wife is left with one child – the expectation of another.\n","36":"\n 259 miles\n\nThis was less on account of the ship yesterday.\n\n Note in orders today, that Geddes was lost at sea to our deep regret; all offering condolences to widow & child etc. Was told today that the seamen found one of the buoys smashed right up,\n\npointing to the presence of sharks. Many sharks seen today. Small hope for man in these seas.\n\nWeather very hot, & canvas swimming bath \nin fwd\n on forward promenade deck, very much in demand.\n\nCrowds line sides looking at porpoises and flying fishes. Classes very tiring below decks in close atmosphere.\n\nAm working fairly well. Completed","37":" of Cicero’s Pro Milone & well on the way with Henry VIII.\n","38":" Dakka\n","39":" \n209\n Dakka\n","40":" 207\n","41":"\n 254?\n\nBoat drill today at 4 as usual. This week we have been given the first dose of yet another inoculation. Sports have been held yesterday and today\n\nThe weather at Dakka was terrible. Hot & close. After we left there it was little better. The first evening the humidity increased until a sudden wind storm relieved the \nair\n pressure somewhat. Since then there has been more movement of the boat, consequently some of the ladies have suffered. Being at the stern end, it is natural that the steerage ones should feel it. I pitied them during the hot weather. \n\nToday for a time it was brilliant & clear. Tonight it is overcast yet \nthe\n at sunset a beautiful yellow glow came from the western clouds, & the sea was that harmonious blend of dark blue and shining orange, that I love so well.\n","42":"\n 254\n\nShorter distance covered explained by the fact that something went wrong with a propeller, or at any rate some breakdown occurred which resulted\n\n \n\nour running on one engine. This afternoon the boat has been going at something like its old speed.\n\nEarly morning communion & morning service at which I helped with distributing the books as usual I have been attending the 6 oclock services every evening down in the aft hold, but ommiting the Sunday evening services.\n\nThere is one on at present, a memorial service for Geddes who went overboard.\n\nThe weather today has been splendid. This afternoon I lay down & had a splendid sleep & sun bath.\n","43":"\n\nToday like Sunday we travelled very slowly all morning on one engine & only went 248 miles. The mileage is going from bad to worse.\n\nDuring the week we had two good lectures by P.W.F. Wallace: one\n\non Bourke & the other, this evening, on dialect words in dictionaries & in relation to Standard English.\n\nChristian work is proceeding along the lines of unity laid down by the Padre. Tonight, the usual order was named by a Salvationist taking us in the manner & with the hymns of his sect – in short nonconformist. Despite my antipathy to the type of hymns I found the meeting just as helpful if not more. \n\nRumours of the week: (1) Ceramic not far behind us, & should pass us on the way shortly (2) We are to be transhipped to Ceramic on account of the unreliability of our boat (3) Propeller gone bung entirely.\n\nSports have been continued during the week, and there has been the usual band orchestra & concert entertainment.\n\nKit inspection today.\n","44":"\n\nFor three hours this morning the boat was stopped; rest of the day she has crawled. Another boat, a very slow one passed us in the afternoon. I understand that we shall get back to normal at midnight tonight, once all repairs will be finished then. After we should make a good speed.\n\nBoxing contests tonight, a dance & also Jazz band invitation down below. The last enough to make a cat laugh.\n\nSetchell told me some illuminating things concerning faith really practised among such as the Plymouth Brethren. Some instances he gave me of his own results were truly remarkable.\n\nParliament opens on Monday with as leader of the Government & myself as leader of the opposition.\n\n \n","45":" Arrived Cape Town\n\nAshore this evening with Padre\n","46":" -29th Ashore on leave every day \n","47":" Left at 2.30 pm for Durban. Boat rolled badly. Many sick. Almost stopped opposite lighthouse\n","48":" 218 miles (Sunday) \n\nGoing better but still rolling heavily.\n\nServices as usual \n\nMeeting in afternoon. \" Reconstruction from Christian Standpoint\"\n","49":" 248 miles. Classes recommenced. Rumoured pay tomorrow. Badly needed on all hands.\n","50":" 263\n","51":" Arrived Durban last night. Anchored all night off harbour, noticing the twinkling lights of town & wharves. Ship rolled pretty badly. 6 am started to move towards land from which we had drifted a considerable distance, and went at very slow speed.\n\nSpeed increased as both boats with unpronounceable names seemed to be gaining on us. We gave her a run for it then, & finally steamed in ahead of her at 14 knots.\n\nLeave & pass only by launches since anchored in mid stream. No launches appeared before dinner. Afterwards many noises because \nfrequent\n husbands objected to , & were thus not allowed on leave Speeches etc etc – women very noisy.\n","52":" Leave ashore with padre. Lunch Anzac Rest – chased guide work After lunch – Library & art gallery. - Tea at White City. Tram ride round Marmott Road. \n","53":" Leave with Bill Adams & Pat. Wesley Rooms – Book shops & Techn College Parliament Boat moved up to wharf on return & coaling.\n","54":" Ashore with Bill Adams & Paterson Trip to Umgeni. Bucksee tea at Crown Hotel. Went to Mr. Burton’s with Hume in the evening.\n","55":" Church in morning. Lunch with Mrs. Browning & walk with family over hills in evening.\n","56":" With Adams & Paterson\n\nWesley hut as usual – then wandered around writing letters & searching for books till tea. Popular pictures with Peters & \nJes\nFigtree, Bill & Pat. \n","57":" Writing letters & feeding with Pat & Bill – and Peters &Figtree Dinner evening at Downings again. Farewell.\n","58":" Leave ashore till midday. Dinner then people began to arrive. Check parade lasting from 1.30 till about \n2.30\n 3.0 or more – in the wharf. Waiting for stragglers. Women throwing oranges & bananas Niggers scrambling for pennies &\n\n \n\nfighting. 5 pm pulled out. Now for the last spell.\n","59":" to","60":" \n\nGeneral increase in mileage but never more than 246. Rolling of boat & great head wind. Spray & tops of waves continually coming over forward well deck \n","61":" Parliament. Interrupted from husbands \n","62":" Evening service the same Issues of fruit. bacon in evening . Canteen queue disappeared.\n","63":" Wind decreased Water still rough. Boat going strong. Blew off steam last night. 260. Whales today ( General: No washing clothes except baby linen, with fresh water. (Friday). Another medical farce. Band Monday.\n\nBurial of hash.\n\n17 – 4 – 11 \n\n262 Eggs for breakfast.\n\nThursday 18th\n Last two days boat has done well increasing Story of Officer and sister re . Issue of biscuits yesterday \n\n \n\nExams today & tomorrow. \nBands player\n Dance & last night. Orchestra\n\nStories (officer of \n\n ( Brides\n\nFriday 19th Men v Officers Parliament\n\nSat. 269\n\nSund. 21st\n\nLanded\n","64":" \n\n1919\n\nSydney\n\n \n\n \n\nAfternoon the main Parliament held its second service when several lady members spoke on behalf of their husbands who were busily equipped in discovering a certain principle. Mr. Paterson who replied for the Government, was often interrupted with irrelevant & facetious remarks, but despite an urgent desire on the part of one lady to do something more than talk ( at which she shone enough Heaven knows!), he held his own by the aid of his winning smile.\n\nLater he drowned his sorrows in the comparative hilarity of a launch ride to town\n\n4th 48th formally takes possession of Durban.\n\n1st Sept.\n","65":" Nearer & nearer to land so that Durban should not be overlooked.\n\nNearly put into East London in mistake, because of similarity of their town halls.\n\nCan this be the main which is forging ahead at a found speed of 11 knots? \n","66":" Found Durban last night but such was the speed of the boat that it was found impossible to stop her short of Zanzibar. Turned around & made Durban by morning. Dutch boat sighted overhauling us rapidly. The let her get level, then with a speed which shook everybody off their feet she dashed ahead just in time to prevent miss Campbell signalling a hearty welcome to Herr Hertzog, who was on the Dutch boat.\n","67":" Left Cape Town. Outside the harbour started rolling. Many interested \nin the\n hugging the railings in a loving embrace appear interested in the water. rolling increased Learning expression appears in many faces. \nSpeed of boat\n As one of our poets has expressed it ‘the eternal main thing is to see the main spring\" The spring is, of course, upwards & not forwards. In fact at one time it appeared doubtful she was moving at all, for a lighthouse off our she seemed to be holding its own.\n","68":" This being the day of rest the Main is to be commended in having made better headway. She is now pitching as well as rolling. General financial depression as a result of gay life in Cape Town. Unaccountable popularity of pay staff. Many offers of refreshment in harbour.\n\n \n\nRue school\n\nWe would like to know\n\nIf Mr. Rue is not\n\nIf\n Why, on his second visit, Collins chose to adopt the nom de passage of Thomas?\n\nIf Mr. Ray & his friends are not considering an early return to Durban.\n\nJennifer\n\nPeter Moffat\n\n Adams Collins\n\nPaterson\n\nRider\n\nNote. \n\n At Wesley Hut\n\nCollins: Thomas\n\nA distressing affair is reported of two of our number. One of our heavier operator friends blandly disappointed himself at an at home, was by Eva introduced as Mr. Hearing one the first & squabble, our friend understood that he was being introduced to something, \nand\n helped himself, and before any of the horrified family could intervene, had drunk off two pints of pawpaw water.\n\n"}}