{"Document Name":{"0":"Diary_0153","1":"Diary_0153","2":"Diary_0153","3":"Diary_0153","4":"Diary_0153","5":"Diary_0153","6":"Diary_0153","7":"Diary_0153","8":"Diary_0153","9":"Diary_0153","10":"Diary_0153","11":"Diary_0153","12":"Diary_0153","13":"Diary_0153","14":"Diary_0153","15":"Diary_0153","16":"Diary_0153","17":"Diary_0153","18":"Diary_0153","19":"Diary_0153","20":"Diary_0153","21":"Diary_0153","22":"Diary_0153","23":"Diary_0153","24":"Diary_0153","25":"Diary_0153","26":"Diary_0153","27":"Diary_0153","28":"Diary_0153","29":"Diary_0153","30":"Diary_0153","31":"Diary_0153","32":"Diary_0153","33":"Diary_0153","34":"Diary_0153","35":"Diary_0153","36":"Diary_0153","37":"Diary_0153","38":"Diary_0153","39":"Diary_0153","40":"Diary_0153","41":"Diary_0153","42":"Diary_0153","43":"Diary_0153","44":"Diary_0153","45":"Diary_0153","46":"Diary_0153","47":"Diary_0153","48":"Diary_0153","49":"Diary_0153"},"Date":{"0":"unknown","1":757.0,"2":758.0,"3":759.0,"4":760.0,"5":761.0,"6":762.0,"7":763.0,"8":764.0,"9":765.0,"10":766.0,"11":767.0,"12":768.0,"13":769.0,"14":770.0,"15":771.0,"16":772.0,"17":773.0,"18":774.0,"19":775.0,"20":776.0,"21":777.0,"22":778.0,"23":779.0,"24":780.0,"25":781.0,"26":782.0,"27":783.0,"28":784.0,"29":785.0,"30":786.0,"31":787.0,"32":788.0,"33":789.0,"34":790.0,"35":791.0,"36":808.0,"37":809.0,"38":810.0,"39":811.0,"40":812.0,"41":813.0,"42":818.0,"43":819.0,"44":820.0,"45":821.0,"46":822.0,"47":823.0,"48":824.0,"49":825.0},"Entry":{"0":"\n\n","1":"\nFinal Inspection by O.C. - Left Liverpool 2 p.m. Paraded through City and Reviewed at Domain. Spent night at showground\n","2":"\nMarched to Orient . Grand send-off -fine spectacle -left harbour at 1.30 p.m. -spent good afternoon - slightly sick at night. Slept on deck in hammock.\n","3":"\nContinued journey -\n\npleasant day -pleasant trip -- boxing on board -sighted Victoria about 6 p.m.\n","4":"\nArrived Port Melbourne 4 a.m. - wrote letters - granted leave 11 a.m. till midnight -walked through City -luncheon and dinner at Sargent - trip to St Kilda -caught in dust and rain storm -game of billiards -Pantomime at night (Mother Goose) -very good -riot - return to Osterley.\n","5":"\nBad news -no\n\nleave. Exceptionally enthusiastic send-off by Melbourne people. \"We do not like Melbourne or its people nearly as good as Sydney -but we shall always thank and remember them on the occasion of our leavingPort Melbourne\"- anchored out in the stream.\n","6":"\nA.M.C. take up my duties -self in charge of Ward -3 patients -high price of refreshments.\n","7":"\nContinued good weather. Instruction by Capt Smith Osier - 10 a.m. & 3 p.m. -fracture and bandaging -letters.\n","8":"\nArrived Outer Harbour (Adelaide) - fine wharf. Leave of 3 hours - visited P.O. & restaurant - met Miss McDonald & Miss Bray - left for Fremantle at 6 p.m.\n","9":"\nOne week on water. Lift-belt parade -instruction - meet Sydney High\n\nBoys - wash clothes.\n","10":"\nSabbath - church parade - weather still fine - spar with Tommy Watson -letters.\n","11":"\nWeather much rougher - sighted land after 3 days - Albany & the Leewin. Instruction in Hemorrhage.\n","12":"\nArrived at Fremantle - general leave.\n\nTook train to Perth - pleasant trip - good opinion of Perth - run in Motor Car through Kings Park & back to City - fine sights of Swan River etc - excellent roads - swimming baths-- good meal - return to vessel - hearty farewell - courageous act of last man aboard - last glimpse of dear old Australia.\n","13":"\nAnniversary of our native land.\n\nPayday (10 days at 1\/-). Instruction.\n","14":"\nFlying fishes - shark -boxing at night - change of duties - 'Hemorrhage lecture' etc.\n","15":"\nBeginning to feel heat of tropics - lecture by Capt. Jenks,'Discipline & morality'. First day of Boxing Tourney - F.E. Beaurepaire.\n","16":"\nFortnight on ocean - Lifebelt drill - Weather hotter - ship inspection -letters. Very good bout in Tourney. Lecture on Fractures.\n","17":"\nSunday -first rain since leaving Sydney - peculiar clouds & weather -abandon our bunks on deck - calm.\n","18":"\nMore rain -2,200 miles from Australia,\n\nweather rough - nothing of importance.\n","19":"\nStill rough -concert by Australian Follies (Passengers) -imitation of Tivoli Follies - very popular entertainment - speech by Col. Holland.\n","20":"\nBad cold - weather hot & sultry - usual duties - good boxing bouts - glorious Eastern sunset - everyone in good humour.\n","21":"\nFine day -arrive in Harbour of Colombo at 7 a.m. -boat besieged by natives - peculiar boats & propulsion - great many big boats in harbour including Australian Hospital Ship 'Karoola' on way to Sydney - leave stopped - route march instead - slow passage ashore - march through main streets to \"barracks\"- pestered greatly by natives - two rides in rickshaws - native thieves - peculiar\n\n-ities of children - also buildings - arrival at Barracks - cheap fruit etc. - fine native soldiers-- canteen-- lemonade, fruit, biscuits - return to wharf - troops break lines - all the boys have head-aches - mediocre impression of Colombo.Left harbour at 10 p.m. for last stage of voyage.\n","22":"\nOnce more out on the briny - read \"The Tangled Skein\"(Orczy) - lecture by Returned\n\nNurse on Hospital Duties in Egypt - continuation of Boxing Tourney (semi-finals).\n","23":"\nWeather still good -second issue of \"Osterley Keystone\" - washing-day.\n","24":"\nThird week of voyage completed - one more week to go - Church Parade - good deal of reading -weather rougher -many sick.\n\n\n","25":"\nSighted first land since Colombo - in the morning, Islands of Socotra & the \"Brothers\" - and in the evening N. East Africa and Cape Guardafui. Finals of Boxing -good bouts -passed two ships.\n","26":"\nRead \"One Day\"(Glyn) - weather good but hot. Rifle & Physical drill competitions amongst troops - Tug-o-war won by Artillery - letters.\n","27":"\nIn Gulf of Aden - sighted land throughout the day. Arabian Coast & Islands -passed three or four vessels. Lanternlecture by Ship's Captain- practice firing with ship's gun.\n","28":"\nPassed \"Twelve Apostles\"Islands -and many ships - Red Sea - letters - first and only death - burial at sea - impressive ceremony.\n","29":"\nRed Sea - coolest part of voyage - preparations - stewards concert. Farewell speech by skipper.\n","30":"\nGulf of Suez - nearest to land since Colombo - \"boys\"pleased because of end of journey - great weather.\n","31":"\nArrived Suez 6 a.m. -impressed by Port etc - final preparations - disembarkment -\n\ndry rations -very poor trains - final cheers given to boat crew & passengers and last sight of good old Osterley. Travelling very slow -pestered \"en route\"by natives - shook hands with Indian Sikh who praised Australians - oranges & lollies - arrived Zeitoun 1 a.m.\n\nMonday","32":"\nTransport of kit to camp -bed 2.30 a.m.\n\nFeb 14th\nParade 9 a.m. -address and routine orders by O.C.\n\n\n\n(Cont.)\n\nAgain meet Sgt Roberts - survey of camp - breakfast (24 hours without recognition) - easy day - trip to Cairo via Heliopolis - fine trams and trains - Cairo good and bad points - slums - natives - Y.M.C.A. -coinage - tea in town - bully beef & biscuits.\n","33":"\nParade 6.30. Tomatoes for breakfast -raining all day -Cairo in afternoon -met Quinert, Barnes\n\nSmith. Tea at Y.M.C.A. - Billiard saloon - post cards to Sydney.\n\nEnd of diary - future notes of interest follow on from here.\n\n\n\n(1)\n\nVirgins Tree and Marys Well\n","34":"\n\nThe Obelisk","35":"\n\nTwo miles from camp -Obelisk 60 ft high -composed of 1 piece of solid marble -covered with hieroglyphics.\n","36":"\nCemetery.\nOne mile from Zeitoun Camp -Graves hundreds and also thousands of years old – shallow -tombstones to cover graves – family tombs – beads and valuables with bodies – search.\n","37":"\n\nEgyptian Bazaar\nDescription - good and bad articles - cosmopolitan - dealing.\n","38":"\nGarry Drive (Fred C. & self).\nOne hour 10P.T. -Sultan's Palace -magnificent building -Guard -slums -Falling of horses -Driver's demands.\n","39":"\n\nKursaal\nRevue \"Smile up\"- decent theatre - short program ( 2 hours) - poor show - badly produced & set - poor dressing - amateurish -songs and dialogue in English (chiefly) & also French.\n\n(7)\n\nOstrich Farm (Mar 2nd)\nOne mile from Camp -composed of mud walls, resembling native village -site of old farm - Young and old birds & eggs -male birds black.\n\n(7)cont.\n\n\"The Lookout\"- used by signallers -fine collection of pigeons.\n\n(8)\n\nChange of Camp\nZeitoun to Ismailia -on Mar 5th 1916. Left Zeitoun 6 a.m. - train to Cairo Station - thence to Ismailia which is on Suez Canal (approx. 100 miles from Cairo) - good journey - cultivation & irrigation of Nile - Ismailia fine little town\n\n(8)\n\nmarch of 4 or 5 miles to camp - very tired - slept on desert under waggon - very cold -unsettled - Ferry Post & Gadging Camps.\n\n(9)\n\nFurther Change of Camp (6th Feb)\nFerry Post to Moaska - Moasca Camp situated near township of Ismailia near railway line -all hope of joining our unit has vanished.\n\n(9)\n\nAttached to 7th Fld Amb -Queenslanders chiefly -no tents -food good -O.C. Fair -plenty of work with very little Recreation or amusement - boys downhearted - troops daily passing in trains -big movement apparent. Rumours of going to France very shortly. Cannot send letters (or \"receive them\"). Active Service in Reality - washing inMess Tin (about ½pt of water) -- sleeping out - wet blankets. \"Are we downhearted?\" No!\n\n(10)\n\n7th Field Ambulance\nPermanently & officially attached to 7th F. Amb on Mar 8th - comrades & self in B section under Major Brennan D.S.O. 7th composed chiefly of Queenslanders and S. Australians -popular officers -good food -well satisfied -letters farther off than ever - struck censoring of our own letters. Colours of unit -Chocolate square turned on end, as .\n\nOfficially announced","40":" by officers of 7th about our going to France - Respirators.\n\nDiary of Voyage No. 2 - B. Section - 7th Fld. Amb.","41":" A. Div.\n","42":"\nInspection by O.C. -march with full kit - break camp at Moascar - Entrain & leave Moascar 11.30 p.m.\n","43":"\nMonotonous train journey to Alexandria - arrive at port 7 a.m. - embark on A.41 (S.S. Minneapolis) (destination unknown) - ship overcrowded -food poor -hammocks issued.\n","44":"\nCommenced voyage about 6.30 a.m. - Mediterranean - constant wearing of life-belts - \"band selections\"- ship's canteen gives us our\n\nfirst fair deal for many weeks -apparent dangers of submarines etc - picket duties on horse-decks. Duties, distinction marks etc of French Officers & soldiers read out by Adjutant. Lights out 5.30 p.m.\n\nMarch 15th\nSea much rougher - with constant rain - picket duties - Minneapolis fitted with two large guns (one fore & one aft) and two Lewis Machine-guns or rifles -\n\nlatest pattern - \"Our troopship the first to leave Egypt for the European part of the business.\"\n","45":"\nPicket duties. Ship inspection - band -letters -very rough and cold weather -suffering from cold -bed 5.30 p.m. (record).\n","46":"\nPass Malta - hair-cut (Barber who visited the \"old joint\"at Balmain) -physical drill and Inspection -\n\nweather much better.\n","47":"\nPass C. Bon (Algeria) and later sight of S. Coast of Sardinia. Inoculation - arm very bad - food worse than ever.\n","48":"\nPass Island of Corsica (birthplace of Napoleon) - arrive at Marseilles 2.30 p.m. - Naturally fortified port - fine shipping centre - spend the night on board - sleep on wooden seat 9\" wide.\n","49":"\nUnload\n\n\n\nvessel -deprivation of cameras - arm much better - boys anxious to get away from steamers.\n\n"}}