{"Document Name":{"0":"Diary_0354","1":"Diary_0354","2":"Diary_0354","3":"Diary_0354","4":"Diary_0354","5":"Diary_0354","6":"Diary_0354","7":"Diary_0354","8":"Diary_0354","9":"Diary_0354","10":"Diary_0354","11":"Diary_0354","12":"Diary_0354","13":"Diary_0354","14":"Diary_0354","15":"Diary_0354","16":"Diary_0354","17":"Diary_0354","18":"Diary_0354","19":"Diary_0354","20":"Diary_0354","21":"Diary_0354","22":"Diary_0354","23":"Diary_0354","24":"Diary_0354","25":"Diary_0354","26":"Diary_0354","27":"Diary_0354","28":"Diary_0354","29":"Diary_0354","30":"Diary_0354","31":"Diary_0354","32":"Diary_0354","33":"Diary_0354","34":"Diary_0354","35":"Diary_0354","36":"Diary_0354","37":"Diary_0354","38":"Diary_0354","39":"Diary_0354","40":"Diary_0354","41":"Diary_0354","42":"Diary_0354","43":"Diary_0354","44":"Diary_0354","45":"Diary_0354","46":"Diary_0354","47":"Diary_0354","48":"Diary_0354","49":"Diary_0354","50":"Diary_0354","51":"Diary_0354","52":"Diary_0354","53":"Diary_0354","54":"Diary_0354","55":"Diary_0354","56":"Diary_0354","57":"Diary_0354","58":"Diary_0354"},"Date":{"0":"unknown","1":1512.0,"2":1513.0,"3":1514.0,"4":1519.0,"5":1520.0,"6":1521.0,"7":1523.0,"8":1524.0,"9":1526.0,"10":1545.0,"11":1546.0,"12":1550.0,"13":1554.0,"14":1555.0,"15":1556.0,"16":1558.0,"17":1559.0,"18":1560.0,"19":1561.0,"20":1562.0,"21":1563.0,"22":1564.0,"23":1565.0,"24":1566.0,"25":1567.0,"26":1568.0,"27":1569.0,"28":1570.0,"29":1571.0,"30":1572.0,"31":1573.0,"32":1574.0,"33":1575.0,"34":1576.0,"35":1577.0,"36":1578.0,"37":1579.0,"38":1580.0,"39":1581.0,"40":1582.0,"41":1587.0,"42":1588.0,"43":1589.0,"44":1590.0,"45":1591.0,"46":1593.0,"47":1594.0,"48":1598.0,"49":1599.0,"50":1600.0,"51":1601.0,"52":1602.0,"53":1603.0,"54":1604.0,"55":1605.0,"56":1606.0,"57":1607.0,"58":1608.0},"Entry":{"0":"\n\n","1":"\n Left London for Edinburgh 10\/15 a.m. arriving at 8\/10 p.m. \n\nHad a good look round the city, but as only stayed a day, had little chance to see the various places of interest.\n\nFood problem does not seem to be so acute here, the retail houses appear to be well stocked, the people look well, dress well, and it is evident that they are not feeling the pinch as much as the southern people.\n\nNearly all the buildings are built of stone or granite. The city is spotlessly clean and well laid out. Put up at St Andrews’ hotel.\n","2":"\n Left E’bro at 8\/15 a.m. arriving Dundee about 1 p.m. Only remained here a day. Rather a big place, has a population of about 177,000, and like E’bo clean and well laid out.\n\nPicked up an American belonging to Canadian army in the\n\ntrain from London and we spent our leave together.\n\nStopped at the Royal.\n","3":" to","4":"\n \n\nLeft Dundee 9\/45 a.m. and arrived Aberdeen about 1 p.m.\n\nStayed in the city 6 days.\n\nAberdeen is a beautiful city, carefully laid out and without doubt cleanest and most substantially built city have ever been in. Nearly every building is constructed of granite. Even the fences around the farm, are made of it. Managed to get good rooms and obtained our meals where and when we desired. Seldom out before 11 a.m. so nearly every day did without breakfast. The people are more confident in the Nation’s endeavours and are a grand crowd to be associated with.\n\nViewed the Don and Dee: both are picturesque streams.\n\nAberdeen can boast of a fine strip of sandy beach. A large trawler became stranded and still remains high and dry on shore. Engineers consider that this ship will have to be broken up to remove. The captain missed pier entrance and ran on beach.\n\nCan travel anywhere about city on trams for a half penny although this is one of the largest fishing centres it is very difficult to obtain fish for local use Buyers from inland and Southern centres purchase the whole catch and despatch it to their respective markets. On the West coast of Scotland, the fish are piled into open trucks and hastily railed to distributing points.\n","5":"\n Left Aberdeen Fri evening at 8\/15 p.m. and arrived York at 5\/20 a.m., from here travelled to Manchester,\n\nhere at 9\/30 a.m. Caught a tram to Warrington and visited my brother. He has been sent to Lord Derby’s Hospital and was pleased to see me. He is suffering from heart trouble. It’s just possible he may be returned to Australia. Was unable to find his address at our London Headquarters, but managed to get it at Aberdeen. Returned to Manchester at 3 p.m. - had a walk round city, then after a good meal \nretur\n retired to rest at the “Albion\".\n","6":"\n Left Manchester for London, arriving 9.10 p.m. Stayed at A.I.F. War Chest Club This is a perfect soldier’s home, every convenience, no food restrictions, no meal hours, food always ready night and day.\n\nManaged to get half of diary typed out at Aberdeen, completed it in London. Put in time looking round city and a few picture shows, but did not trouble theatres. Was favoured with glorious weather and had an enjoyable holiday.\n","7":"\n Up for breakfast 6 a.m. called at cloak-room for that d- equipment and once more returned to that form of slavery commonly known as soldering. How different the boys all looked how sluggishly they all moved, how reluctantly did they fill their respective places in that train which would deliver them to a point en route to France. Here had an opportunity to study some of those prospective brides some of our Australian girls are apt to comment on. Will not say what I think of \n\nabout them, will leave all that to be said, said by their mother and sisters when they do return. Reached France 7 p.m. and was marched to \nRest\n camp and detained till mid-night.\n","8":" 6tgh. Reached our railway destination at 7 a.m. and after marching, walking, and travelling by available transport reached our Battalion at 7 p.m., tired and weary.\n\nShould I be fortunate enough to see through till another leave will then … continue diary.\n\n1918\n","9":" to","10":"\n Quiet period. Company working some distance from Camp building pill box. Still unable to walk to work so am kept on light duties indefinitely. Its no use parading sick. As likely as not would be marked duty\n\nThis would not worry me in the least, and as sergeant and corporals are expected to see every man home from toil its not likely they are going to be pested with me. Prefer field work every time, but as I am unable to get backward and forwards will content myself with whatever is offering in the shape of light duties. The total absence of bombing raids and no shelling make our habitation safe. Though we are in close proximity to line near an important road-way, close to light railway junctions and adjacent to large motor lorry parks yet we are left alone. The name of the camp is Lindenhock.\n\nA road running from our side, through no man’s lands and into country held by Fritz is seldom shelled. Compare this quietude to a few months ago What does it all mean. When will these peaceful valleys and shell shattered ridges become vetiol. \n\nBoth sides are nervous, the constant raids prove the necessity for information. Small lots of prisoners and weakly held outposts are changing hands, yet there are no indications of a big push. Even aeriel activity has greatly decreased. Mild weather, mostly bright days.\n\nWhat a contrast to last year’s frightful winter.\n\nLeft Lindenhock on","11":" for St Eloc. I travelled by motor.\n\nOn arriving we dumped all our belongings on the side of the road and commenced a vigorous hunt for dug-outs.\n\nFirst party managed to lay claim to all suitable shelter and building material. Along came a tunnelling officer, explained he owned their new home and out they had to go.\n\nAttached myself to a party of ten and commenced preparing a \nsight\n site. Every man in the group had his view as to how the place was to be built, we were overwhelmed with supervision and when a carrying party was required, few responded. Drew out a suitable mate and searched trenches near-by. Managed to find a good dug-out for three.\n\nAfter cleaning it out, fixing fireplace and gathering wood, we were comfortably resting long before others managed to erect a poor shelter.\n\nAt last camp was comfortably housed. Put \nin\n my spare time to use, studying Pitman’s Shorthand. Managed to learn consonants and commenced on vowels. One would get on far more rapidly with a teacher, but managed to keep moving. Unfortunately will not be able to continue here as I have no suitable place to work\n","12":" to","13":"\n\nRain, sleet and mud as thick as treacle. Carrying wood and water no easy task. Water point quite a distance away.\n","14":"\n Unable to continue on with work, walked to D.O. Stn and saw M.O. about ankles, he marked sick report ‘This man not fit for marching any distance; to be put on very light duty only. He also stated that our Battalion doctor should have evacuated me last November. One good thing, finish carrying that damn pack. On gas guard, shifts 10 to 2 a.m. and\n\nand 2 to 6 a.m. These cherry morning hours. Oh don’t make it up.\n","15":" to","16":"\n. Fine weather. Every day seems to be warmer.\n\nOur camp is shelled now and again, so far no desastrous results Huts riddled with fragments of shell.\n","17":" 1oth","18":"\n Fritz shelling a ridge close by for last 24 hours he did not cease, all heavy stuff and at periods an explosion every minute.\n\nOur guns do not speak. Should say the gunners missing.\n\nThe ridge has been raked, from end to end. Occasional ammunition fires prove that shots are finding their mark.\n","19":"\n. After this terrific bombardment our guns do speak.\n\nThey roar defiance at the Hun but just at sunset, huge tractors move them elsewhere.\n","20":"\n. This evening many coloured balloons floating about. These contain literature of a detrimental nature and, as they travel through the air drop packets. Sometimes they are filled with gas and now and again have a bomb attached to them. Many of these reach French villages. “Do they\n\ncontain spy code information.\n\nPut in an application to O.C. asking that I may be transferred to a unit where I could be more suitably employed. My C.O.s gave me a good recommendation and officer promised to put it through to H.Q.\n","21":"\n More rain, plenty of mud. Camp again shelled.\n","22":"\n. Our locality still being shelled. Gas somewhat troublesome.\n","23":"\n Everything fairly quiet. One shell fell within few feet of 40 men camped in surface structures. No damage done.\n","24":"\n. All round us enemy artillery is searching for batteries with heavy shells. Our camp is in a bad position. A road and a light railway encircle it. Near us is situated a dump and our home is far more \nconspicious\n conspicuous than it should be. Complaints have already been made regarding this and we hear today that we are to be removed, shortly, to a spot not under direct observation. The heavy shelling continues yet our narrow strip of territory remains unmolested. \n\nWe all anticipate trouble with the night. Enemy \nplains\n planes hover round and observers in enemy balloons have the advantage of the clear bright weather.\n\nThe last few mornings, the rising moisture is not so dense, the ground haze is diminishing and we are now coming into the season when every care and precaution has to be used. Any activity, any regular movements such as working parties going to and fro, can be seen and we have every reason to expect trouble anytime.\n\nAfter sunset all is quiet. This we note with some anxiety.\n\nThe silence prevails till 9 p.m., then our \nqueit\n quiet strip of country becomes uninhabitable.\n\nMany gas shells explode within a dangerous distance of our dug-outs. We get into our helmets and not a second before time, for when examining shell marks next morning find that one of these gas carriers fell within a few feet of our home. Barrage becomes more intense and our sergeant orders us to beat a hasty retreat to safe ground.\n\nGas being heavier than cold air hangs to the earth. It remains in swamps, valleys and low lying country for a considerable time.\n\nWith the aid of a light breeze it travels slowly, but rarifies considerably as it covers greater area. Getting away from our Camp was rather a difficult problem. We managed to evade shell fragments, though several of our number suffered more or less severely from gas. When a few chains from camp, met 4 men with a gas stretcher case. A fourth pioneer had consumed a fair quantity of liquor and was standing outside of his dug-out when a gas shell fell by him. Our stretcher bearers and others went to his assistance and managed to get him towards dressing station Just as first relief halted for a spell another gas shell fell close to them. The patients as well as \nthe\n his attendants got the full force of this Took one handle of stretcher and did what I could towards hurrying patient forward. Ankle as usual went against me and another took my place. Before reaching party had a narrow escape two shells burst in an unsafe vicinity and a gas shell fell almost at our feet.\n\nTried to adjust respirator but gas reached me before I could do so. Put my hand over mouth and nostrils and hopped safely through the smoke. Found an Infantry man in trouble, he had been gassed severely but could walk, took him to dressing station where we found medical staff awaiting to render aid. Our stretcher bearer and sergeant went with us to another camp for remainder of night but became seriously ill and had to be taken away on stretchers. Nineteen of our men reported to dressing stations, 6 were sent away others held till symptoms developed. At a time like this the skilled malingerer, the would be hero swarm to the dressing stations and force on the medical officers a double duty; this is the skill of a physician and the judgement of a judge. Many tales are well told and a lenient doctor would have no difficulty in evacuating best part of a company, should he treat seriously and favour ably those appealing requests from those many would be sufferers. But the game of not playing the game is becoming \n\noverdone, yet these imposters seem to continue robbing the attention so urgently needed by their suffering comrades.\n\nOur O.C. Major Anderson personally supplied us with tea and instructed R.S.M. to arrange accommodation for us with other platoon. Its good to see an officer grasp the responsibility of such an occasion and his efforts are greatly appreciated by all of us.\n","25":"\n Bright and clear. Enemy guns active, but well away from us. A violent explosion occurring this afternoon one of our large dumps being fired by Fritz.\n\nAscertained that my transfer was being put through.\n","26":"\n Quiet night. On gas guard 2 to 6 a.m. Fritz commenced shelling with gas shells close to our home. At 3\/15 a.m. detected oncom gas and awoke corporal. His luck had been in the night before and as no shift went out made full use of his time. He made a careful search for financial and, this being accomplished turned the whole collection into beer. Result when warned about gas could not realize the importance of my call. At 4\/30 a.m.\n\n14 shells fell in a group quite near us. Roused the corporal again and got him to warn party. He was rather reluctant in moving.\n\nTook him clear from dug-out and in doing so got my issue of gas. Could not stop coughing for over an hour this was accompanied by sneezing, pains in chest and throat. As I was becoming weak got a man to see me to clearing station, managed to reach it safely. Just as I was being placed on stretcher became unconscious. When being loaded into motor ambulance at 10\/30 a.m. rain falling on my face awakened me and I learnt I was to be evacuated. I also learnt from another patient that station had been shelled. One large shell entered a dug-out and wounded 8 men another fell in front of Y.M.C.A. but on road, and fragments of metal were driven through door of clearing station. From here moved to Kemmel again this town shelled. A Frenchman living with his small family became startled by explosions crept into his cellar and although the mud-\n\nday meal was on the table sensibly remained with his family below.\n\nTheir home was shattered to pieces, not one of them hurt.\n\nShifted by ambulance to No. 2 C.C.S. at and placed in No. 5 Ward. Have a fat head, sore chest and a feeling so commonly known by my self seasickness otherwise all well. Lost my boots at first station and my clothes at the next so am by compulsion a cot patient, visited by doctor twice.\n","27":"\n Did not get much rest last night but slept well this morning. Pains not nearly so acute. We are fairly well treated. Visited by M.O. at dinner time and asked if I felt fit to travel. Answered Yes.\n","28":"\n Left","29":" C.C.Stn. about 10 a.m. Would have been removed yesterday only Fritz has been busy shelling our railway junction. Put on ambulance train and arrived at 55 General Hospital situated near Boulogne about 3 p.m. Kept on stretcher all the way. Put in N. Ward. Still feeling dizzy. Fancy that stuff called gas is not good food.\n\nThis place would cure anyone, put on bread and butter scantily \nsur\n served and no extra meals.\n\nJoe Buckley a man all the way from Jamacia (West Indies Expeditionary Force) has kept me interested today. He is able to get about on one foot, one heel and a walking stick – always busy – stokes the stove, toasts the other side of those lightly buttered slices of bread, and enlists all and sundry. For some time he laboured industriously on a patient’s face. One may term it shaving. Joe says something wrong with razor and quotes instances when he removed whiskers painlessly. The next victim to be lathered up looked grave but faced the ordeal like a man awaiting a hop-over the enemy (those whiskers were met in massed formation, but by shear force they were rooted from their firm stronghold. It was not a bloodless victory. Now Joe takes a hand at wist. A mournful look creeps over his face as he sees those small cards but at the sight of an ace livens up considerably. He again smiles, he is winning. Now comes a lull – bad paper has been \n\ndealt him, will he go to sleep, not quite, but \noff\n oh is he not making a rough bet of it. Good luck now favours him, those eyes do glisten, vigorously does he cash in those winning cards out. Finishes the game a victor. Everything is comfortable here. Each hut contains twenty beds, are light and bright and though built within a few chains of the sea are moderately warm.\n","30":"\n Not as fit as I would like to be, but considering complaints perhaps am fortunate to be so well. Headache remains about the same. Fritz paid us a visit about 9 p.m. The anti-air craft guns and machine guns got busy. Several bombs dropped. No damage done in our locality, returned again about midnight and carried out a similar performance. That Joe got into trouble this morning. The head sister (in a somewhat spiteful mood) robbed him of his stick.\n\nImmediately he returned to his bed and could not be persuaded out. He watched her actions carefully and noted the spirit in which she carried out her morning duties and did not forget to \n\nremind others that they had received their share of her displeasure.\n","31":"\n Health about same. Medical History Card taken away from above my cot. Some of the older patients prophesy that I am to be removed to England.\n\nTrust their reckoning will come true. It means quite a lot to me now that I have been regarded by our Battalion H.Q. as unfit for heavy work.\n\nShould stand a chance of securing a position somewhere in England on clerical work. \n\nWe have a shell shock case in our ward. Last night’s bombing upset him considerably. The poor unfortunate lad is only 17 years of age. Military authorities should know by now that these lads will not stand the rigours of war. Doctor visits us daily. Food not improving. Porridge without milk or sugar, tea without sugar, bread very stale and manufactured - ingredients not known – takes the label of ‘National Bread’ should be called last Hope Our papers say, Germany starving, beef tea not over rich and starch foods supplied without milk or sugar. Battalion rations\n\nBattalion rations far superior.\n","32":"\n A quiet doubtful day. Some of our number sent to convalescent camp this morning. Kept in suspense regarding England till 5 p.m., then the issue of additional clothing for boat trip cleared away all doubt. Cap comforter cardigan jacket and warm socks provided for journey. Met a young chap called Allen Lindsay. He is a son of Lindsay late of Victorian Railways. He is being sent up for medical board. \n\nCame across another mate in my own battalion Disher son of a S.M. at Mordialloc, he hopes soon to be returned to Australia being one of the originals. Joe is now quietly smoking my cigarette issue in bed. What a contrast, those snow white sheets that coal black head. He has been exceptionally happy today.\n","33":"\n Still improving. Exceptionally cold all day. Still waiting for that ticket. Tomorrow should see me clear of this place.\n","34":"\n At 4 a.m. we are awakened for our morning wash. At 5 a thermometer is thrust into our mouths. At 7 we dine.\n\nIn between we sleep. Put on stretcher at 7\/45 a.m. and placed in a motor. It seems to be my luck to get into sick motors, for after travelling half way to boat it stopped. Removed into another and was last stretcher case on board. One satisfaction first out. Good trip across, shoved a substantial meal, defied mal-de-mer and arrived safely at Dover at 1\/30. Our car was quickly filled, looked forward for a hasty move. Another red cross train stood opposite us. Eighteen \nof our\n cases from our train were transferred and we remained at Dover till 3 p.m. In rapid succession \ndid our\n train after train filled with our unfortunates. Fritz has had a win. These evidences are not cheery. The faces of the people clearly denote their feeling. Never have I seen them so uncertain looking. In many instances signs of agitation and doubt can be recognised. Undoubtedly they are feeling present ordeal severely, which I should say eclipses all previous war disasters. The outlook does certainly look grave, but I believe we will drive the\n\nHun back with advantage yet. Am afraid that over confident form of safety has flourished far greatly with our military tacticians. Evidently they have not regarded the recent spell of quietude seriously enough. Dormant artillery can speak and has spoken. One thing in our favour is that we have Fritz away from his burrows and he now holds ground which can prove dangerous to him. He must continue his thrust to pay for his losses. Will the gain compensate for the risk he has taken. Fancy 1½ million effectives in action at once. Think of them, subjected to the mercy of our fire. Years have we waited to get them on the surface. It’s to be hoped we can deal with them now we have then there.\n\nArrived Cambridge 9.30 p.m. Put in Ward 24 Great Eastern Hospital. The place is well fitted up, bright and comfortable. Food seems to be better than 55 General.\n\nTrain travelling exceptionally good. Beds comfortable. Far superior to Sydney to Melbourne sleeping cars. The motor ambulances are also good to travel in. This is the best trip I have had from the lane.\n","35":"\n Great day, feeling much better, managed to get up for a couple of hours. Find bed the best place. I wrote Lt. Hornstein about my personal gear, was unable to gather it the morning I was gassed , also asked him to forward papers in connection with my transfer.\n\nHope he will send them along to our Australian Hospital Harefeld.\n\nRepresentative of Aust. Red Cross Society called here today, supplied us with minor requirements and colonial papers. Comforts were also distributed at 55 General, 2nd C.C.S. and at Dover Cambridge Branch of St John’s Ambulance cared for us at local station. Here we received a good cup of tea and biscuits. Its difficult to obtain good tea and as I am still off the beer suffer considerably.\n","36":"\n The day by no means cheerful, cloudy all morning and raining during afternoon One side of wards is made chiefly of glass and when the sun does shine it is pleasant to dwell therein.\n\nWe are now in the season of sunshine, shower and cloud.\n\nThe fruit trees are commencing\n\nto blossom. The ward is decorated with daffodils and other early Spring bulbous blooms. I hope to see this country in the Spring and it may happen I will.\n","37":"\n. Still raining so feel more contented under a god roof. Got up for an hour, was glad to return to bed A small concert\ny\n party visited us today. We have a good piano in our ward. Now and again the sisters play. The talent is recognised as being fairly good and their presence enlivens the Ward. There is always something interesting about Hospital life. Fortunately this is the observation section of the institution, very few bad cases and no surgical patients. We are a mixed lot, Tommies, Scotties, Irish and those Colonials. All have their good points and all carry some distinctive peculiarity, which to the observant is always a source of interest if not an education. As unbiased as I may try to be it seems utterly impossible for me to cease favouring the Scotch. They appeal to me, whole hearted brave and unselfish, they are the goods. What would Britain be without them. In the street and in the field they\n\nremain unchanged. Misfortune, sickness and even reverse does not alter them. With them it always seems worth while. You never hear a Scotchman relate the great deeds he has done. That little strip of country in Belgium and France which we Australians so well know, that little strip where our fallen lie In this little strip lies the destiny of nations. It is here our Scotch brothers have won our confidence and favour.\n","38":"\n Another wet and miserable day. Word received that several of us were to be sent to St. Chads’ V.A.D. Hospital. Its a kind of Convalescent Home.\n","39":"\n. Drew our complete outfit of clothes from store and at 4 p.m. motor took us to St Chads’. We were received by the Sister in Charge, given to understand that we were to comply with regulations of the institution to the letter, any failure on our part immediate change of address Do not fear consequences. When one reaches this stage of the war little worries or reminders of this sort pass unnoticed and \n\nand I do not think (in my case) the desired effect found its mark. Find it quite easy to keep within the bounds of authority.\n","40":" to","41":"\n\nManage to get out for a walk each day. If it was not for ankle trouble would enjoy wanderings around. Civilian doctor called on us. The staff of this V.A.D. Hospital is numerous. They work short hours and as most of the patients are not cot cases have a fairly good time. A separate staff of domestics do cooking and cleaning and the out of bed patients are detailed to assist in such duties of speed barbering, setting tables, making beds, sweeping, knife cleaning and other duties.\n","42":" to","43":"\n\nQuiet period. Little to do. Sleep, eat and get well\n","44":"\n The whole family taken in a bus to a concert ‘Merrie England’ not a mis-named show but certainly does not meet present period. Singing good, music not up to standard.\n","45":" 12\n. Two quiet days. Feeling very much better.\n","46":"\n Went to see ‘Carltons’ variety show. Not bad at all. All shows free to wounded soldiers, so if entertainment not up to expectations we do not care. Most of the shows are run by Red Cross Society.\n","47":" to Wed.17.\n Another quiet period getting tired of this place. Though I tell the sister daily I am quite well, still I am retained.\n","48":"\n. Civilian doctor visited the family, 16 of us marked out. Paraded to Eastern Hospital Inspected by another \n\ndoctor. We were all formed up in a long row and passed out in quick time. Marked fit to travel. Name of destination Dartford, but was instructed to return to St Chads for further treatment.\n\nRiver Cam a banker. Water in side canal flowing over pavement.\n","49":"\n. Still raining. Now and again clears up to let it snow.\n","50":"\n. Doctor at Eastern Hospital instructed me to come around and see him when I get word about being shifted from St. Chads. He had a look at my feet and handed me a recommendation stating that it was his opinion that I was quite unable to march and only fit for sedentary duties. One thing I know and this is, that I will never have to carry a pack again, and its probable I will not have to return to France. Likely will be put on clerical \nduties\n work in England.\n\nGot a letter from Bert stating he was sailing for Australia today.\n","51":"\n. We have a compulsory service here every Sunday. Local clergymen fulfil this duty.\n\nOur present home St. Chads’ Voluntary Aid Division Hospital, in peace time was the residence of an elderly gentleman. It is a beautiful two \nstoried\n story building, design semi-ancient half modern. Well laid out lawns and garden surround it. A good croquet lawn is patronised by the boys. It is an ideal home for the convalescent.\n\nMany military cadets are being trained in and around Cambridge. Students from every British and Colonial army included. Many civilians being put through course. Most of our Australian boys can sport a Military distinction ribbon and many wear as 3 gold stripe (wounded).\n\nFancy being trained besides\n\nforced civilians, who have nestled under the cloak of munitions, worker or influential withholder . Our cadet can find time to converse with Australian wounded and never pass us unheeded like English cadets invariably do to the Tommy soldier. The hatred of the English cadet towards the rank and file did not commence here, Along with their inefficiency this feeling is shipped to France and the same feeling is reciprocated by the Tommy in the trenches, yet this soldier remains subservient.\n\nThis is one of the reasons why a colonial officer is vastly superior to an English officer, he knows his men and treats them as men.\n\nCambridge is an interesting place. The many colleges and schools of all description go towards making the place unlike a business or manufacturing centre. The residences of the many professors and teachers and pupils boarding out establishments are well and artistically built.\n\nRound most of them are spacious gardens\n\nand lawns. The shabby genteel or I should say the lesser instructors in the various schools seem to be numerous and their struggle to keep the pot boiling must in these times be great.\n\nLike most towns part of the place consists of crowded terraces, will not call it slum area, though in other towns of smaller importance, it could well take this name. The population I learn is about 44,000, this may not be correct.\n\nKing’s Chapel is a fine building, the walls, ceilings and windows reflect great credit on the master builders of olden days.\n\nThe museum is also a stately structure. Collection of art china and ancient pottery were interesting.\n\nBotanical gardens contain fair collection of ferns and its many conservatories are worth a visit. Several of our Australian shrubs and ferns can be seen at their best, but they live and flourish under glass.\n\nCambridge can boast of many parks\n\nwalks, sports reserves, and avenues of ancient trees. The Cam river flows through town. The banks have been raised. Much boating is carried on, and though it is little more than a drain or irrigation channel it is sometimes classed as a picturesque stream.\n\nThe bus service is scant. In Peace time the place can support a tram service.\n\nThe business places are small, fittings and windows very ordinary. Sales departments slow. Am sure a live Australian or an American could make a fortune in such a poorly managed centre. The trade is here only the people need to wake up.\n\nThe surrounding country is flat and was once a vast swamp.\n\nThe shortage of ‘fit’ man power is being greatly felt. Women do all the street cleaning, window cleaning, take mens’ places in various manufacturing and commercial houses and are doing their bit on the land. Its not the milk man now it’s the milk maid.\n\nThe many types of professors persist in wearing garb which is supposed to distinguish their great abilities. Why cannot they get about in a modern manner. Their flat hats, top hats, caps and other weird head gear cause, no end of amusement amongst the Kangaroos and when the youngsters are met with their toll hats and cut away to a waistcoat coats Our boys remarks – will leave it out.\n","52":"\n Gained possession of Khaki and paraded to First Eastern Hospital.\n\nWe were taken by motor to station. Arrived at Dartford at 1 pm. Again our Khaki captured and that prison garb commonly known as hospital clothing once more thrust on us. I used to visit Sydney in dungaree outfit from Casula so it was good enough when classed as a recruit it should do for a patient.\n\nDartford Hospital the limit. Feeding restrictions the closest I have experienced.\n\nNo meal issued to troops unless\n\npassed through a mincing machine. \n\nThere must be a powerful plant to deal with the working parts of animals consumed here. Undefeated portions are continually met whilst dining. Do they cook working horses or mules. Perhaps its fish diet, octopus these meatless days.\n\nAt the top of dining hall some damn fool has placed the following notice. “God bless you merry gentlemen\". Perhaps I am wrong, it may have been a chaplain.\n\nFor breakfast we receive porridge, without milk or sugar. Bacon two pieces. A bacon cutter is a great invention. With it, slices can be cut as thin as tissue paper. The latest model cutter is used here. Is it 2 oz per man or section. Even the bread supply is fine. A half loaf stack moving from top of table. The first few men cut themselves thick slices, then as it travels the slice becomes bacon like and the men at extreme end halve what’s left. Now I sit next to uncut bread,\n\nthe slice I help myself to will not bend. \n\nWas inspected by health medical officer today and marked C I. This classification, unfit for active service abroad, for Home Service.\n\nThis is not a final classification but can reasonably assume I will not see France again.\n","53":"\n Little doing.\n","54":"\n Called on dentist re some tooth plumbing but as it was gold work could not get it done. Dentist promised to see M.O. about sending me up to London.\n","55":" 25tht\n Paraded to M.O. about teeth trouble to get satisfaction. Marked for Bound tomorrow. From what I understand will be sent on 14 days leave then return to Weymouth.\n","56":"\n Our usual M.O. did not put in an appearance today.\n","57":"\n No M.O. visited us today. Owing to a recent outbreak of small-pox in the town it is out of bounds.\n","58":"\n Boarded, to go to Weymouth Tuesday next. \n\n"}}