{"Document Name":{"0":"Diary_0262","1":"Diary_0262","2":"Diary_0262","3":"Diary_0262","4":"Diary_0262","5":"Diary_0262","6":"Diary_0262","7":"Diary_0262","8":"Diary_0262","9":"Diary_0262","10":"Diary_0262","11":"Diary_0262","12":"Diary_0262","13":"Diary_0262","14":"Diary_0262","15":"Diary_0262","16":"Diary_0262","17":"Diary_0262","18":"Diary_0262","19":"Diary_0262","20":"Diary_0262","21":"Diary_0262","22":"Diary_0262","23":"Diary_0262","24":"Diary_0262","25":"Diary_0262","26":"Diary_0262","27":"Diary_0262","28":"Diary_0262","29":"Diary_0262","30":"Diary_0262","31":"Diary_0262","32":"Diary_0262","33":"Diary_0262","34":"Diary_0262","35":"Diary_0262","36":"Diary_0262","37":"Diary_0262","38":"Diary_0262","39":"Diary_0262","40":"Diary_0262","41":"Diary_0262","42":"Diary_0262","43":"Diary_0262","44":"Diary_0262","45":"Diary_0262","46":"Diary_0262","47":"Diary_0262","48":"Diary_0262","49":"Diary_0262","50":"Diary_0262","51":"Diary_0262","52":"Diary_0262","53":"Diary_0262","54":"Diary_0262","55":"Diary_0262","56":"Diary_0262","57":"Diary_0262","58":"Diary_0262","59":"Diary_0262","60":"Diary_0262","61":"Diary_0262","62":"Diary_0262","63":"Diary_0262","64":"Diary_0262","65":"Diary_0262","66":"Diary_0262","67":"Diary_0262","68":"Diary_0262","69":"Diary_0262","70":"Diary_0262","71":"Diary_0262","72":"Diary_0262","73":"Diary_0262","74":"Diary_0262","75":"Diary_0262","76":"Diary_0262","77":"Diary_0262","78":"Diary_0262","79":"Diary_0262","80":"Diary_0262","81":"Diary_0262","82":"Diary_0262","83":"Diary_0262","84":"Diary_0262","85":"Diary_0262","86":"Diary_0262","87":"Diary_0262","88":"Diary_0262","89":"Diary_0262","90":"Diary_0262","91":"Diary_0262","92":"Diary_0262","93":"Diary_0262","94":"Diary_0262","95":"Diary_0262","96":"Diary_0262","97":"Diary_0262","98":"Diary_0262","99":"Diary_0262","100":"Diary_0262","101":"Diary_0262","102":"Diary_0262","103":"Diary_0262","104":"Diary_0262","105":"Diary_0262","106":"Diary_0262","107":"Diary_0262","108":"Diary_0262","109":"Diary_0262","110":"Diary_0262","111":"Diary_0262","112":"Diary_0262","113":"Diary_0262","114":"Diary_0262","115":"Diary_0262","116":"Diary_0262","117":"Diary_0262","118":"Diary_0262","119":"Diary_0262","120":"Diary_0262","121":"Diary_0262"},"Date":{"0":"unknown","1":879.0,"2":880.0,"3":881.0,"4":882.0,"5":883.0,"6":884.0,"7":885.0,"8":886.0,"9":887.0,"10":888.0,"11":889.0,"12":890.0,"13":891.0,"14":892.0,"15":893.0,"16":894.0,"17":895.0,"18":896.0,"19":897.0,"20":898.0,"21":899.0,"22":900.0,"23":901.0,"24":902.0,"25":903.0,"26":904.0,"27":905.0,"28":906.0,"29":907.0,"30":908.0,"31":909.0,"32":910.0,"33":911.0,"34":912.0,"35":913.0,"36":914.0,"37":915.0,"38":916.0,"39":917.0,"40":918.0,"41":919.0,"42":920.0,"43":921.0,"44":922.0,"45":923.0,"46":925.0,"47":926.0,"48":927.0,"49":928.0,"50":929.0,"51":930.0,"52":931.0,"53":932.0,"54":933.0,"55":934.0,"56":935.0,"57":936.0,"58":937.0,"59":938.0,"60":939.0,"61":940.0,"62":941.0,"63":942.0,"64":943.0,"65":944.0,"66":945.0,"67":946.0,"68":947.0,"69":948.0,"70":949.0,"71":950.0,"72":951.0,"73":952.0,"74":953.0,"75":959.0,"76":960.0,"77":961.0,"78":962.0,"79":963.0,"80":964.0,"81":965.0,"82":966.0,"83":967.0,"84":968.0,"85":969.0,"86":970.0,"87":971.0,"88":972.0,"89":973.0,"90":974.0,"91":975.0,"92":976.0,"93":977.0,"94":978.0,"95":979.0,"96":980.0,"97":981.0,"98":982.0,"99":983.0,"100":984.0,"101":985.0,"102":986.0,"103":987.0,"104":988.0,"105":989.0,"106":990.0,"107":991.0,"108":992.0,"109":993.0,"110":994.0,"111":995.0,"112":996.0,"113":997.0,"114":998.0,"115":999.0,"116":1000.0,"117":1001.0,"118":1002.0,"119":1003.0,"120":1004.0,"121":1005.0},"Entry":{"0":" \n\n1916\n\n","1":"\n\nEngineering till 5am, slept in till midday. Relieved 15th Battn 10pm same night. all OK.\n","2":"\n\nWet morning. engineering from dinner till 6pm.\n","3":" Cold.\n\nOur trucks shelled &amp; we also retalliated later. Mail in. On wiring party night.\n","4":"\n\nCold &amp; wet. again shelled and parapet had to be repaired from same. With ‘full kit’ left trenches on Furlough to England. marched to Steenwerk where we stayed till 5am next day.\n","5":"\n\nGlorious day. up 4am. caught train 5am arriving Bologne 11am. stayed till 7Pm at Rest camp (Wireless Stn) & embarked 8.30 leaving about 9.15pm & entrained at Folkestone 11pm. reaching Victoria Stn. about 1am.\n","6":"\n\nBeautiful day. Stayed at Abbotsford Hotel, after visiting Horseferry Rd. where we were very well treated and advised. Bath & got to bed 3am. Up at 10.30 busy with Photograph’s shop all following 3 hrs & caught 5pm. train for Eastleigh. 2 hrs run. stayed night.\n","7":"\n\nWith auntie & Yvonne went to Winchester for day & to\n\npictures after tea with Yvonne at Eastleigh. Y. is a lovely little French girl married to Langston Earls about 3 months; comes from Bethune & is now my cousin. They gave me such a lovely time, would have liked to stay instead of visit elsewhere. stayed all night again retiring late.\n","8":"\n\nCaught midday train reaching London where I was kept very busy at bank etc. By 6pm train went to Bolton and reached \"North Leigh\" about midnight finding them waiting up for me. Never felt so at home anywhere in my life before as here, they were both so loving and homely & nice. Beautifull room and surroundings.\n","9":"\n\nAfter breakfast visited Manchester city, had run round & took several \"snaps\" returning to Deane with Mr Andersoon. After dinner went with same to Links where we met 2 other friends of his & played Golf. till about 7pm. when we had nice light tea & continued play after till dark. Returning home had bath & dressed for wives of golf mates who did not come when expected. Had dinner about 11pm & to bed about 1am.\n","10":"\n\nAfter bkfst went out taking photos of Dean and after dinner with \n\nMr Anderson caught train for London. changed at Manchester & on G.W.R. booked seats in a Dining Car where we did well getting into town about 10pm. & from there went to Surbiton getting there midnight staying at Railway Hotel till morning.\n","11":"\n\nVisited the Grandmothers & stayed for bkfst going out after, taking photos along the Thames. after lunch went to Bushy Park & Hampton Court both very pretty & interesting. many snaps of same. evening at \"Duneden\" music & returned to hotel to sleep.\n","12":"\n\nLeft Surbiton by train 9am\n\nchanging twice & reaching London (Vic Stn.) 1½ later 10.30. busy with photographic work & later went to Eastleigh for the night. Up late fixing albums and photos for Kitty.\n","13":" \n\nWith Yvonne went about Eastleigh district for walk and for \"Snaps\". Nearly lost my midday train to London Very busy indeed in town getting remaining photos & making arrangements for others to be sent on.\n\nParceled up Snaps, Albums, Diaries & suveniors etc & Registered to Kitty. Went to","14":" Church C.S. evening & home with Cork family to Supper. Slept at Peal House for the night.\n","15":"\n\nCollected Gear & breakfasted at Horseferry Road & left Victoria Stn at 8am. Raining all the way till we reached Folkestone 10am. where we stayed all day. embarking on one of 3 boats that left at 7pm. reaching Bolonge about 9pm. Stayed the night at Wireless Stre Rest Camp. Also following day leaving same about 6pm. reaching Steenwerk about midnight where we billeted till morning.\n","16":"\n\nRec’d Rations & left Steenwerk on foot about 8am. reaching Billet (Bois Grenier) at noon. Rec’d 20 letters & was very glad as since leaving London I was awfully homesick especially not knowing anyone much to travel with. They absolutely spoiled me & made life seem so miserable again for following days. I was much relieved when I got back with the boys.\n","17":"\n\nLetter writing in paddock most of day with Ern & Robo. Church service in barn after tea. 100 men from Coy. on engineer fatigue till 2am.\n","18":"\n\nFritz shelled us out of our billet about 10am wrecked house much but our portion only got one or two shells. Very busy rescuing gear & munitions from same between shots. Midday we took up our quarters in A.Coy. Redoubt few 100 yds along the road. Party sent to clean up billet after shelling also usual bathing parade. At dusk 100 went on fatigue to trenches, remainder back to billet where we slept. O.K. though expected more shells\n","19":" h. Tuesday May\n\nKit inspection. Letter writing etc. Truck fatigue at night\n","20":"\n\nDull weather. Mail in & letter writing. Much airial activity.\n","21":"\n\nLovely day. Fritz shelling our batteries nearby also Armontieres. Also got onto our fatigue party & caught several.\n","22":"\n\nNice day. letterwriting etc. Trenches on fatigue at night.\n","23":"\n\nNice quiet day. Packed up belongings & relieved 19th. Battn in Support Trenches. Plenty of fatigue here, Engineering by day & ration\n\ncarrying at night from road dump to front line.\n","24":"\n\nFritz shelled our trenches again hindering working parties. Exciting air duel on ending in one of Fritz‘s being brought down.\n","25":"\n\nStandtoo from 2.30 to 3.30am. now being daybreak very early. 7th Brigade raided enemy lines so we had to draw fire & got it hot & strong. Several killed & wounded as result. 4 of my own platoon. Showery weather also.\n","26":"\n\nFairly quiet day. Showery and Cold.\n","27":"\n\nRepairing damaged trenches from bombardment.\n","28":"\n\nWeather fair front quiet. Midnight artillery stunt by our guns.\n","29":"\n\nRec’d 3 more Reinforcements for platoon.\n","30":"\n\nFritz shelled us heavily again killing several.\n\nWet night & usual artillery stunt.\n","31":"\n\nHeavy rain. Mail in. Battn Hqrs shelled.\n","32":"\n\nHeavy bombarding on both our flanks. 1st Bgde raided Fritz.\n","33":"\n\nTo wet for engineering fatigue & too much shelling to sleep. (on","34":" Brigade)\n\n14th-Wednesday-June - \n\nRaining heavily. Much shelling on front & second line.\n","35":"\n\nVery cold weather much fatigue & shelling by both sides. great airial activity.\n","36":"\n\nWeather good usual fatigues & airial activity.\n","37":"\n\nRelieved by 19th Battn. only to go on engineers fatigue till 11pm.\n","38":" Slept in till 10am. Church service in billet evening. Our artillery gave enemy trenches lots later.\n","39":"\n\nDull day. Hot bath after dinner. Truck fatigue\n\nat night & enemy machine gun played on us without effect, got back to billet 3.30am.\n","40":"\n\nDull day. Fritz shells came rather close to Billet so had to quit same & remain along hedges for day. Engineers carrying fatigue to front line evening.\n","41":"\n\nFine day. breakfast 9.30 usual truck fatigues.\n","42":"\n\nLetterwriting most of day. Much activity overhead most all day. anti aircraft shell fell on road close to billet and exploded within 20 yds of a crowd of us. startling us much. heavy artillery duel later.\n","43":"\n\nHuns again shell battery 200 yds behind billet so\n\nhad to scatter along hedges out of the way. Standtoo at midnight while our boys straffe Fritzs trenches.\n","44":"\n\nLetterwriting most of day. Singsong evening.\n\n25th. Sunday.\n\nFritz again shelled our batteries nearby. 5th Bgde Raided enemy trenches successfully.\n\n26th. Monday\n\nLovely weather. Fritz shelled road to trenches. Enemy bombarded our lines about 10pm & attempted to raid 18th. line but were met by 18th raiding party which was arranged for 11pm. It was not till","45":" attempt that our boys entered his lines and by same secured few prisoners.\n","46":"\n\n7am to 7.30 Physical jerks after brkfst. Rifle inspection.\n","47":"\n\nRaining again. Lecture from O.C. after lunch. Letterwriting.\n","48":"\n\nPhysical jerks early. Rifle inspection then packed up ready for moving. Cleaned up billets.","49":" Bgde relieved us & took over billet about 9pm. Marched about 6 miles (or more) to huts near Croix-du-bac.\n","50":" Bkfst 8am. Parade 9am staff rifle exercises \"Guards ? by Capt. Fussell. \n\nAusy Mail in.\n\nJuly.\n","51":"\n\nPhysical jerks. Bomb throwing etc all day. News of Streakybacon Farm, late billet being levelled to the ground by Fritz shell fire.\n","52":"\n\nChurch parade at Bttn Hqrs also Band out.\n\nFootball match between B & C Coys. after lunch.\n","53":"\n\nPhysical & Coy drill all day with lecture on Gass.\n","54":"\n\nParades cut short about midday by heavy rain.\n","55":"\n\nVery dull weather. Foot ball match between 7 & 8 platoon postponed owing to bad weather. Gass alarm.\n","56":"\n\nPhysical jerks. Drill contest between Coy’s of 17th. Mail in.\n","57":"\n\nVery dull weather. Parade stopped by rain.\n\nPaid after dinner. Bathing Parade to Erquinghem Baths Gass alarm test on Parade ground with helmets on & roll call.\n","58":"\n\nHad some of the new bayonet fighting exercises to day by Capt. F. Letterwriting after Parade.\n","59":"\n\nPacked up & Paraded 9am ready for marching. Huts cleaned up & left 11am on good roads with lovely weather. Dinner on the roadside about 2pm. & reached our new billets at Caestres 15 miles distance about 6pm. very tired slept in shed alongside windmill ( P.Cards of same sent to K.C.)\n","60":"\n\nUp 7am had look through mill which is still used.\n\n9am set off on foot and reached Billets near Renescure, distance of about 12 miles. about 5pm. Biked into Ebblingham for eatables with Ern & Robo. Had to hand in our blankets to night.\n","61":"\n\nUp 6a.m. Fell in 10am full marching order. Cleaned up billets and surroundings and moved off 12. noon. Steady march of about 7 miles through \"Renescure\" via \"Arquis\" to \"St Omer\" where we entrained about 3.30pm. in stock trucks & steamed out of stn about 5pm passing Etaples, Calis & Bologne and detrained about 2am.\n","62":"\n\nMarching through Amiens City about 3 to 5am. including rests. we reached\n\n\"Argoeuves\" about 9 miles off and were billeted about 8am. Very poorly stocked shops.\n","63":"\n\nTown picquet all day till lights out. 10pm. Very cold at nights with greatcoat only.\n","64":"\n\nDrill all morning & nice Rout march afternoon, very pretty surroundings, hilly country all in crops & beautifull to see the wild poppies thick among the corn. gold & red & green a charming scene on such slopes with little woods here and there & scattered windmills. Out one road & returned by different course.\n","65":"\n\nParades much the same as yesterday. Different route after lunch & went for\n\nbaths in little creek nearby with Ern & Robo, as we also did yesterday.\n","66":"\n\nFell in for Church parade but orders came for moving & at noon we set off for \"Cardinette\" about 6 miles of. These billets were small and dirty and the people very unsociable, took their pumps to pieces etc & made things unpleasant for us.\n","67":"\n\nDrill as usual before bkfst at 9 to 12 & 2 till 4.30pm.\n\nMail recd. Slight rainfall.\n","68":"\n\nWet morning; packed up & about 1pm moved on another 6 miles to \"Reubempre\" billeted here in lovely comfy\n\nhomes where our Madam treated us very well gave us clean extra straw & table, boxes to sit on & books to read. Slept OK you bet, quite at home.\n","69":" – Wednesday.\n\nDrill as usual arranged. Paid later on. many shops here & lived well.\n","70":"\n\nPhysical jerks. Packed up & Moved off at 9am. for Warloy about 9 miles. Big E.F. Canteen handy & big billets. living well.\n\n21st. Friday.\n\nParades till noon.\n\nMoving orders at 1 to set off at 1.30 & thought it was for the trenches . After marching for 1 hour halted & were told t’was\n\nonly a Mobilisation Test & even the \"Heads\" did not know it till message was brought enroute. We continued the march & returned by new course about 5pm after covering about 8 miles.\n\n22nd - Saturday.\n\nParades till noon. Orders to move off about 2pm. but did not leave till 6pm. then made for Albert about 7 miles off, where we bivouced about 9pm. for the night, on slopes just outside the town. Big attack on Pozieres.\n\n23rd. – Sunday.\n\nChurch Parade very impressive, held in quarry very deep closeby.\n\nwhich is also used as communication depot. (telephones etc) while here several enemy shells landed in the town of Albert, near the railway which is in present use. News rec’d of 1st Div. success the previous night. Concert.\n\n24th. Monday.\n\nUp at 6am no parades during morning, bayonet instruction after lunch\n\nPacks branded & dumped ready for storage till we come out again. About 8pm. we moved off for reserve position & had most tiring advance not knowing just where we were required apparently & about midnight\n\nhad orders to get what sleep we could. We were alongside old much knocked about trenches & knew not our whereabouts, front or anything else. About one hour later wakened with great fear, fierce bombardment on all sides, guns of all sizes, & as light as day almost by the flash of the guns. I was absolutely afraid to move & curled myself up under great coat & tried to stop trembling from cold & fear as they must have warned us if in any danger. Prisoners passed through gully later.\n\n25th. Tuesday.\n\nUp at 6am to find\n\nI was sleeping on hand grenades some of ours & some of Fritz’s in the dark I thought them only stones & the place was literally strewn with shrapnel shell cases & dud shells & such a plowed up mess. These were some of Fritz’s trenches where he had been excellently been dug in with 50ft funk holes, passages, beds, electric lighting, cupboards, stores, & chairs; besides other homely conveniences too numerous to detail.\n\nHad parade later, 9am. & practiced puting up wire entanglements\n\nspeedy corkscrew system which was cut short by orders to move to trenches. moved forward about a mile & lay all day in trenches near Contalmason. Moved from here at dusk to front line where we relieved 1st. Div. about 11 pm. Much muddling & it was about 2ambefore we were settled in correct part of line. The number of wounded that passed us during the day was surprisingly heavy. Hardly had old relief gone out, than party was seen by us attacking extention of our line which connected with \n\nFritz 200 yds along, we only holding a portion of his circular line. Having no advice from our own side of movement we opened fire on them machine guns & rifles & bombed the extention of sap. They gradually dropped back as daylight came & we could hear both English & foreign spoken along here but dared not take part incase of perhaps a ruse of his. later all quietened and finally word was rec’d that it was the 20th. attacking & that we had so infiladed with our fire.\n\n26th. Wednesday.\n\nGot to work early cleaning up trenches, collecting bombs & ammunition & well we did for about 3pm. he attacked our right flank with hand bombs & kept up all night, We were loosing heavily by casualties & 50 &percnt; gone by 11pm. so called on 18th & 19th. Battns. to reinforce us & we quietened him down, but he came at it again next day.\n\n27th. Thursday.\n\nOur boys did great work and pushed Fritz back a little. D.Coy 17th. relieved us about noon & we fell back along Communications T till dark.\n\nthen were led, with tools to where we found a narrow trench being made and set to deepening it all night.\n\n28th. Friday.\n\nTurned in 4am for sleep till about 10 then continued sap, making dugouts. Were fed very well all day Stew Ham sandwiches, strawberry jam, bread, butter, tea & rum issued freely. Coy. strength in Sap. 90. Instructions issued for Start tonight. Attack by 5th. 6th. & 7th. Bgd’s. I was with O.C & Chambers in 1st. Line. 50 strong. Chambers was killed about 50 yds out while returning to our shellhole. As soon as we were about 30 strong we pressed on to the \n\nwire where we lay low in holes for the 20th. Signal, which never came so about","71":" hour later got orders to return to our own lines about 100 yds back. The fire was terribly fierce. Machine gun & Rifle grenades & shell fire & Fritz lit the place up like day with flares. We waited for a while till fire slackened & then got back . Dumped my gear to make matters easier. All wounded were brought in also some of","72":" Div. who had been out 5 & 7 days. Stayed in front line passing ammunition & bombs & firing flares till daylight. \n","73":"\n\nStayed all day in support trench we made & felt very much knocked up. Slept most of day.\n\nPlatoon strength now 15. Coy., about 60 strong. Fritz shelled our support & reserve lines much during night.","74":" line geting no fire at all.\n","75":"\n\nSpent all day in the same place only duties to carry our own rations from kitchens, Sausage Gully. 2 Casualties since night. 2 Cpls of my platoon. 35 planes of ours flew over toward Fritz’s lines together this evening, about sunset & dense smoke was seen rising from rear of his platoons.\n\nwhere much shelling had been going on earlier in day. He also had to haul his Baloons down as one was fired by our planes.\n","76":"\n\nFew details recd by Battn. today also Reinf. Another awful night in our old sap.\n","77":"\n\nNice clear morning quiet etc. relieved by A.Coy. 17th. Batt. about 3pm. & later went down gully to Kitchens but got little sleep on a\/c of artillery fire\n\nthis being wher the bulk of our batteries are.\n","78":"\n\nHad lovely shave of 15 days growth & sponge bath. how refreshing too, more than words can tell. Went with party of 100 to trenches, being in rear we lost touch with those ahead & messed up so not knowing where we were to go or do I sent message to C.O. 17th. H.Qrs. & rec’d reply at 11.30 to take party back to gully. The shell fire was awfull on support lines and caused much\n\nconfusion in narrow saps, being crowded so. had few casualties returned about 1am OK. & turned in for sleep.\n","79":"\n\nStayed with Kitchens all day, boys sent on several fatigues, rations & munitions during day.\n","80":" & 5th sat\n\nBombardment by our artillery commences at 9.15pm. and 15 minutes later our boys were in Fritz’s 2nd line. We in gully stood too till 10.30 then turned in but called out at midnight & with Picks & Shovels all\n\npushed onto trenches but fooled about till about 3am. in overcrowded and narrow sap which was under heavy shell fire. then with great difficulty pushed through in front of Pozieres to 1st new line where we dumped our tools & returned to sunken Rd trench. Before returning we passed many prisoners & wounded.\n\nHad about 2 hours rest in sunken valley there with remaining B.Coy. men was ordered to report as diging party, to 18th Colonel in front line\n\nWe were mucked messed about in the crowd & for want of better & clearer instructions. The trenches were new & no one knew one place from another. So crowded was every sap, that one could not move let alone work, for being in anothers way. We found 18th Hqtrs in similar condition about 3 hours later & could do nothing. However we were relieved of our job about 4pm. & returned to gully to find good hot meal.","81":" feed for that day, & a letter from K. Very short & mystereous but sweet. Got our gear altogether and\n\nBgde. left Gully about 9pm. & bivouaced some 3 miles back but were scattered by shellfire about midnight & made for trenches at hand\n y\n where we slept till morning. One man was killed within 6 yds of where I lay & all I knew was the feeling of a shower of dirt. Never heard the report I had well dosed myself with Rum before retiring & was surely doped & dead sleepy with same.\n","82":" – Sunday.\n\nBgde reviewed by Gen. Birdwood midday. Making up Coy Casualty\n\nList & rec’d about 40 reinforcements to the Coy. Moved at 1pm. for Warloy which we reached & were billeted in about 5pm. I was on the Billeting party and went through on Transport motors.\n","83":"\n\nUp 7am muster parade later. Recd mail.\n\nRequisitions made out, complete\nly\n Nominal rolls also completed & nominations for promotions rec’d. Shoping & to bed early.\n","84":"\n\nOrders for moving at 9am. Left on bike 8.30\n\nfor La. Vicogne about 12 miles off. Had 3 course dinner at Talma & got tinned fruits, fish & bread for the boys & self. Bivouaced the night in big orchard alongside large white Chatâe. The rest of Bgde also rested here for night.\n","85":"\n\nWith cycles left at 6am for Halloy about 8 miles off. Grand scenery here passed aerodome early in journey. Reached Halloy about 8am & got billets alloted early. 17th. in last about 3pm. very quiet little village. Slept out under hedge in orchard close\n\nby. \n","86":"\n\nShower early but cleared off later. Bath parade & clean clothes later. Mail rec’d.\n","87":"\n\nWarned off at Bkfast time to report to Bgde Hqrs. for Course of bayonet instructions for one week. \n\nTommy Sgt Major of the Coldstream Guards very good indeed, got very stiff with exercises & play he gave us.\n","88":"\n\nContinued instruction knocked off about 3pm till Monday. Concert evening.\n","89":" – Sunday. – Aug. –\n\nChurch Parade 10.15am Writing afternoon. Church Service in school room after tea. very nice tea.\n","90":"\n\nContinued school, coming home to midday meals leaving billet 8.30am & returning 4.30.pm. \n","91":"\n\nAs on 14th. little more advanced.\n","92":"\n\nLeft with Cycles at 9am for La Vicogne to the old orchard again.\n","93":"\n\nLeft at 8am for\n\nHarponville about 12 miles away. Batt arriving about 2pm. Billeted nicely good bunks. & rest.\n","94":"\n\nParading all day bayonets & bombs & adjusting webings. Stars issued freely same night Smith & Clifton of B.Coy promoted & transferred to C & D Coy respectively.\n","95":"\n\nMuch rain today Paid after dinner Town picquet with\n\nofficer & 12 men till after 11pm.\n","96":"\n\nLeft here with billeting party, only 2 cycles being available 3 of us had to walk to Contay where we picked up the other bikes & party & pushed on to our bivouacing area midway between Millencourt & Albert after reached here about 4pm & after tea moved off again for Sausage gully. Left packs here at bivouac Got to old Kitchen position now very quiet & changed & put ourselves into\n\ndugouts etc for the night settling down about 9pm. I with Ern & others used one of Fritz’s 50 food Holes & comfy were we on were stretchers, rough but springy & easy.\n","97":"\n\nBreakfast 8.30am \n\nMany Taubes up & over us dropped few bombs without harm. Orders at 2 to move at 3pm. and set off after tea about 4pm. to sunken road trench in which we slept all night. relieving 6th Battn from\n\nthese reserve tranches. Had observers on against gass shell fire, but no alarm.\n","98":"\n\nUp about 7am bkfst & rations issued about 8am. No duty all day Spent day copying this diary out from May 12th Ref of dates etc. from Harry Edwards. Great activity overhead, fights all day. evening very cool but quiet. Slept in sap all night.\n","99":"\n\nRoused at 3am. Moved off with all gear B Coy with picks & shovels to report to Chalk Pit where we remained for an hour then taken back near Poziers Road \n\nwalking from 5.30 to 8am. across open shelltorn ground Breakfast 8.30 Slept all morning, & afternoon, rested English mail in Rec’d 1 each from Eastleigh & Surbiton. Party of 7 from each Platoon & L.G.S went into trenches leaving here 5Pm. We, remainder, to leave 8Pm.\n\nMuch aerial activity, many as 20 of our planes up at same time. Relieved 19th. about 8pm. no trouble from Fritz. I had to go on patrol to enemy trench, to find distance & if wired in front, about (70 yds. no wire, out in nomans land from 11 to \n2am. \n 1.45am. 2.30 sent to opp. end of line to take over diging party from Sgt. Edwards. across Nomans land within 30 yds of Fritz. No casualties at all.\n\nShowery morning early\n","100":" – Thursday – Aug –\n\nBkfst. & sandwitch and some tea. Continued saping in reliefs 2 men working forward on 3 parts of line. With 30 men, set out screens in pairs right across line each 2 in shellholes working outwards toward next pair only 3 to 5 yds apart. all did good work indeed & line was completely connected up by 5am. \nthough only. \n Recvd issue & good rations later. 1\/2 party rested morning & all hands pressed on from 2pm. and had trench deep enough to move along in safety. Had to wait & hand over to relief some took over 6 & others 8pm. Got left behind myself & had\n\nan awfull time getting back to gully after dark, being caught in heavy barrage. Never been so frightened in my life before. Heavy showers found 2 M & Cooks & they gave me good feed and heavy dose of rum which had me very dreamy & I slept with them the night.\n","101":"\n\nAll Coy on cleaning up gully salvage work, then 3 platoon on ammunition carrying to","102":" Bgde. new position. Sgt Kemp was killed while on same job brought to gully and buried in \"Ausy\" grounds. Showers at night.\n","103":"\n\nWet morning. nothing doing or news of moving till 4pm. Left gully for \"Tara Hill\" about 5.30pm\n\nShowery. Had tea Tara hill & bivouaced for night in trench closeby.\n","104":"\n\nDoubtful if we should be relieved as no sign of same till midday. Dinner here & moved off to Brickfield Hill via Albert about hour & halfs march. Bivouaced here in canvas shelters put up by ourselves to hold 10 men each. Got big \"Ausy\" mail & lovely long bright one from K. best yet rec’d I think I ever had letters and seal. Showers during night.\n","105":"\n\nup 6am. breakfasted & left with bicycles at 7am for Warloy via Millencourt. Took over some billets as usual. Heavy rain after lunch. Did much writing\n","106":" – Wednesday – August-\n\nParade 8.45. Birdwoods review & presentation of Honor Very wet weather got up to parade ground & were turned back. Review postponed. 12 Noon. repeated parade & postponed again. Very heavy rain all afternoon. Bathing parade later did more writing till dark. Mail handed in too late & not accepted.\n","107":"\n\nParade 9am Birdwoods Review. Left Worloy 9.30 via Contay, Herresart, Valdemason and reached Beauval 2.30pm.\n\nFine big town best we have been billeted in yet, good shops & many. Hotels & lovely church listened to organ during afternoon played by Tommy soldier. Beautiful church had look through it. Electric lighting to all large homes & buildings\n\nBgde. arrived about 7.30 to 8pm. Billeted O.K. Had run through town with Ern then returned & to bed about 9.30. Raining after beautiful day.\n","108":" – Sept. – Friday –\n\nCloudy morning. Parade Lecture & Gas Helmets called in for exchange. dismissed after Nominal Roll had been fixed up. 11.30am. Handed letters in for censoring. No parade after lunch. Letter writing.\n","109":" – Saturday –\n\nParade 9.30am. Roll Call & orders Read also Circular on Gas. Parade 2pm. Battn for Gas Lectures & how to use new small Box Helmet with demonstration etc. Roll Call 6pm. Organ Recital in Cathedral\n\n6.30 to 7.30 beautifull 7.30 to 10pm Battn Concert in Town Hall very tiring. Weather fine.\n","110":"\n\nChurch parade 10.30 Bgde. Afternoon looked through & then short while in Cathedral listening to organ. Took several snaps while out. light showers & rather cloudy. Church at Soldiers Home evening just in before exceedingly heavy showers came. Did little shoping after service & then home to beg (Bed ?).\n","111":" – Monday –\n\nWet morning. Duty Coy. Roll Call & orders\n\netc. read out. Writing later. Loading Party for Trains Doulins. Left Beauval 6pm. marched through 6 kilometres & billeted in Cement works building Doulins.\n","112":" – Tuesday –\n\nPosted 2 Cards to Kitty\n\nUp 2.30am Train loading till 11am. Leave to town till 6pm. 2nd relief at 9pm to 4am. Wet weather showers.\n","113":" – Wednesday\n\nUp 10am. Bfast & Dinner in one. Began work on railway 12 noon 2 trains artillery etc. nocked off about 5pm. Good rations went into town for an hour then packed up & went to yard & entrained for ........\n","114":" – Sept – \n\nArrived at Poperughe & joined up with Battn there in large big billet holding 4 Coys easily. turned into sleep 5.30am up to bkfst 8am.\n\nRoll call & orders recd 9.30 dismissed & wrote Kitty & posted noon. Leave to town from 2 to 8pm. Looked round & spent some time & games in Soldiers Recn Hall then went to dinner. Went to Pictures from 6 to 8pm. very enjoyable. Bought Brooch & Locket souvenirs for K.\n\n8th – Friday – Sept –\n\nDuty Coy. With Cpl & 16 men on Guard. 24 hrs. Entrained about 9 for Ypres and took over Guard duties there at Barracks at \n\n11.30pm –","115":"\n","116":"\n\nGuards relieved by D. Coy 10am. Poor Bfst. went for stroll with Little Sgt, round ruined city. got several snaps of Cathedral Cloth tower & other ruins. Damage done is shocking large & small places alike have suffered took 7 pictures in all. \n\nReturned to Barracks at 11am. Got 7 letters on 8th lovely one from K. acknowledged receipt of 75 snaps. English ones & my photo & letters up to","117":" \n\nexpect to move into the trenches tonight. YMCA appear to be the only selling concern in Ypres.\n\n10th. Sunday.\n\nTook over trenches 1st line\n\nLeft of Hill 60 last night about 10pm. Conditions much above expectations. All very quiet not a shot fired nor gun heard till afternoon about a dozen Wizbangs came over but not on our trenches. Rations very good Meat & potatoes & tea (cold) with Bread Tinned stew Jam & butter. Night just too beautiful to be stuck in trenches at war. Myself did many odd jobs carpentering to fill in the night. Sentrys only real need for Gas Guard. distance between trenches in front line being 700 yds. On big salient our right flank showing direct in our rear and left flank straight as \n\nfar as can be seen for rise in ground. Enemy certainly has pick of position & overlooks & enfilades us properly. We all keep out of sight as much as possible by day. no other than Gas guards done.\n","118":" – Sept – \n\nDay rather dull but not bad. Letter from Mrs Walters day quiet easily the quietest front we have yet been on. very thankful too after Pozieres hope we stay its some home.\n","119":" – Sept –\n\nDull day with showers. little more shelling today only one on the trench not casualties & slight damage to parapet.fixed up later after dark. \n\n16th month away \"Ausy\"\n","120":" – Wednesday – Sept.\n\nShowery but very light. Heavy shells used by Fritz today but not on our part of line. Also T Mortor on our left. 1am recd mail issued same to my boys. got 5 myself and Kittys acknowledging receipt of my 24th May English parcel of photos etc. very nice & cheering & big relief to know alls well & safe with same. Ern & I got in a dugout immediately & with Torches we both read our principal letters. this about 1.30am and we were much awake for long after. \"Robo\" off to \"Ausy\" invalided home.\n\nLovely day","121":"\n\nCold very but clear & sunny. 3am got\n\n3am got 4 letters 1 from Kitty & full of cheer & cheek. Parcelled up Souvenirs etc for K. sending by Courtney Sgt for posting in London.\n\nMuch wet weather followed. nightly trench fatigues, on mining & trench reconstructing. Left Ypres first week October.\n\n"}}