{"Document Name":{"0":"Diary_0122","1":"Diary_0122","2":"Diary_0122","3":"Diary_0122","4":"Diary_0122","5":"Diary_0122","6":"Diary_0122","7":"Diary_0122","8":"Diary_0122","9":"Diary_0122","10":"Diary_0122","11":"Diary_0122","12":"Diary_0122","13":"Diary_0122","14":"Diary_0122","15":"Diary_0122","16":"Diary_0122","17":"Diary_0122","18":"Diary_0122","19":"Diary_0122","20":"Diary_0122","21":"Diary_0122","22":"Diary_0122","23":"Diary_0122","24":"Diary_0122","25":"Diary_0122","26":"Diary_0122","27":"Diary_0122","28":"Diary_0122","29":"Diary_0122","30":"Diary_0122","31":"Diary_0122","32":"Diary_0122","33":"Diary_0122","34":"Diary_0122","35":"Diary_0122","36":"Diary_0122","37":"Diary_0122","38":"Diary_0122","39":"Diary_0122","40":"Diary_0122","41":"Diary_0122","42":"Diary_0122","43":"Diary_0122","44":"Diary_0122","45":"Diary_0122","46":"Diary_0122","47":"Diary_0122","48":"Diary_0122","49":"Diary_0122","50":"Diary_0122","51":"Diary_0122","52":"Diary_0122","53":"Diary_0122","54":"Diary_0122","55":"Diary_0122","56":"Diary_0122","57":"Diary_0122","58":"Diary_0122","59":"Diary_0122","60":"Diary_0122","61":"Diary_0122","62":"Diary_0122","63":"Diary_0122","64":"Diary_0122","65":"Diary_0122","66":"Diary_0122","67":"Diary_0122","68":"Diary_0122","69":"Diary_0122","70":"Diary_0122","71":"Diary_0122","72":"Diary_0122","73":"Diary_0122","74":"Diary_0122","75":"Diary_0122","76":"Diary_0122","77":"Diary_0122","78":"Diary_0122","79":"Diary_0122","80":"Diary_0122","81":"Diary_0122","82":"Diary_0122"},"Date":{"0":"unknown","1":1009.0,"2":1010.0,"3":1011.0,"4":1012.0,"5":1013.0,"6":1014.0,"7":1015.0,"8":1016.0,"9":1017.0,"10":1018.0,"11":1019.0,"12":1020.0,"13":1021.0,"14":1023.0,"15":1024.0,"16":1025.0,"17":1026.0,"18":1027.0,"19":1028.0,"20":1029.0,"21":1030.0,"22":1031.0,"23":1032.0,"24":1033.0,"25":1034.0,"26":1035.0,"27":1036.0,"28":1037.0,"29":1038.0,"30":1039.0,"31":1040.0,"32":1041.0,"33":1042.0,"34":1043.0,"35":1044.0,"36":1045.0,"37":1046.0,"38":1047.0,"39":1048.0,"40":1049.0,"41":1050.0,"42":1051.0,"43":1052.0,"44":1053.0,"45":1054.0,"46":1055.0,"47":1056.0,"48":1057.0,"49":1058.0,"50":1059.0,"51":1060.0,"52":1061.0,"53":1062.0,"54":1063.0,"55":1064.0,"56":1065.0,"57":1066.0,"58":1067.0,"59":1068.0,"60":1069.0,"61":1070.0,"62":1071.0,"63":1072.0,"64":1073.0,"65":1074.0,"66":1075.0,"67":1076.0,"68":1077.0,"69":1078.0,"70":1079.0,"71":1080.0,"72":1081.0,"73":1082.0,"74":1083.0,"75":1085.0,"76":1086.0,"77":1087.0,"78":1088.0,"79":1089.0,"80":1090.0,"81":1091.0,"82":1092.0},"Entry":{"0":"\n\n \n\n","1":"\n\nSignalling tests. Cold day. Return of Capt. Campbell to our Battery. Lamp test. Football match between","2":" & 25th. Win for 27th, 6 to Nil.\n\n19th Sept. 1916\n\nVery cold day with winds. Brigade of heavy howitzers firing here today. Lectures & buzzer. Did not go out anywhere.\n","3":"\n\nCold day. Got C.B. 2 days today for coming late on parade. Hard luck. Signalling & reading. Received letters from Florrie & Millie.\n","4":"\n\nSignalling & out on Helio. Finished up the C.B. tonight. Wrote letters.\n","5":"\n\nSignalling & telephones. Received letter from Wyn also snaps of the Sunday stunt at Winchester. Did not go out but fed horses which arrived today.\n\n \n","6":"\n\nSignalling in morning. Walked to Amesbury & had a try for photo being taken. Too much of a crush. Met Billie & rest and had tea. Got motorcar back to camp. Received letter & photo from Beattie.\n","7":"\n\nSunday today. Had church parade. Afterwards marched passed the General for practice for Wednesday’s visit by the King of England. Did early morning, midday, afternoon & night stables today so did not go out. Cleared up for inspection tomorrow.\n","8":"\n\nEarly morning stable, mess orderly. Marching order parade. Lamp parade at night. Did not go out.\n","9":"\n\nReveille 5.30. Up & rushed round to get ready for marching order for Bulford. On Mess Orderly. Marched off at 11.30 for Bulford. Part of the Brigade mounted with gun & full equipment. Rest old 27th had to footslog. Anyhow arrived at Bulford very tired. Marched passed General of 3rd Division. Artillery first with Infantry, A.M.C. &c. coming afterwards. Great sight. Fully 40,000 men on review. Arrived back at 7.30 hungry & tired. Had a good tea. Cleaned up & had a shower.\n","10":"\n\nRaining this morning. Reveille at 4.30. Mess Orderly. Got off of review parade. Good luck. Anyhow all our Battery & mounted men left for Bulford at 7.15. I was on stables &c. all day. Quite satisfied. All the boys said the review was a great sight. Saw King of England quite close. March past quite a success. They arrived back at 4 o’clock wet. They seemed quite satisfied with the day.\n\n \n","11":"\n\nMess orderly. Signalling & buzzer. On Station work. Gun laying tonight after tea. Day rather fine.\n","12":"\n\nSignalling test. Early morning stables. Raining today. Did not go out tonight.\n","13":"\n\nEarly morning stables. On G.S. Wagon driving. Had a beast of a time with the horses. Sports held today. Did not go anywhere. Did stables.\n","14":"\n\nHad an hour’s extra sleep on account of time going back to usual. Early morning stables. Horses saddled up for riding. Out for 2 hours riding exercise. Did not go out today. Stayed in and had a rest.\n","15":"\n\nEarly morning stables. Signalling Lectures. Wet day. On Canteen Orderly tonight. Boys returned from Winchester. Canteen closed 10.15 on account of concert & their return.\n","16":"\n\nEarly morning stables. Signalling & lectures. Received letter from Miller & Florrie. Nearly got pinched for coal heaving tonight. Used my head and P.O.Qd. to Canteen.\n","17":"\n\nEarly morning stables. Battery out on manoeuvres. Signalling exam. Lecture by Capt. for H.Qtrs. staff at night.\n","18":"\n\nEarly morning stables. Signalling test. Over track specialists once for tomorrow. Captain took the H.Qrs. staff out tonight on a few \"stunts\". We all did sweet \"F.A.\". Afterwards went to the picture show.\n\n \n","19":"\n\nEarly morning stables. Signalling & Buzzer. Battery went out on all day manoeuvres. Signallers race today. H.Qrs. of Brigade disqualified also 25th & 26th. 107th went to pieces. Result win for our Battery. I was on disc station. Our Battery won all events today. Had sundry wads at Canteen tonight.\n","20":"\n\nEarly morning stables. Got ready for our Sports. They were on all day till 5.30 and turned out a success. Went to pictures at night & saw C\/ Chaplin in The Tramp.\n","21":"\n\nEarly morning stables. Went out to exercise horses in morning. Answered sundry letters in afternoon. Canteen & shower at night.\n","22":"\n\nEarly morning stables. Signalling & station work. Did not go out. Perce came up to canteen. Very surprised that he has returned from London.\n","23":"\n\nEarly morning stables. Signalling & station work. Did not go out. Wrote letter for Aust. mail.\n","24":"\n\nEarly morning stables. Signalling & Lectures. Received letters from Australia. Did not go out.\n","25":"\n\nGot ready early for mounted manoeuvres of Horses. Staff left at 9 for the trenches. Out all day & returned to Camp at 6.30 very tired. Got ready for moving off again tomorrow morning early.\n\n \n","26":" 19916\n\nMoved off at 6.30 with H.Qrs. staff. 27th had 1 Gun and waggon. Other Batteries had the same. Started operations at 8 up at observing station. First Gun fired at 10.30. I was B.C.’s Telephonist. Worked up till 1 o’clock when I was relieved. Went down in the wagon lines past the Battery. Had dinner & fooled around until 6 when I went on duty again. At night had 2 S.O.S.s from infantry trenches. Came off at 12 midnight and had a sleep till 5, when we had to get ready for going up to Battery Position. Had breakfast & went up. Stayed there till 8.30 when the battery moved off. Came back to camp at 10 when we fixed up our horses. This being the first of all night manoeuvres which passed off very well.\n","27":"\n\nThis afternoon fixed up harness &c. Fed up & watered horses. Went to pictures at night. Saw Charlie Chaplin in The Rounders. Went to bed very tired.\n","28":"\n\nSunday today. Cooks fatigue. Day passed off alright. Did not go out. Take no notice of blob in date. Put it down to celebrations at the canteens. Slightly P.U.\n","29":"\n\nMy Birthday today. Went out with Battery on manoeuvres. Signalling afternoon. Posted letters for Aust. mail. Did not go out.\n\n \n","30":"\n\nEarly morning stables. Went out at 9 with the H.Qrs. staff & had an inspection by the General. Afterwards had a few stunts in the rain. Came back in time for dinner. Did not do much in the afternoon. Did not go out at night.\n","31":"\n\nEarly morning stables. Signalling & station work. Received letter from Rana today. Birthday greetings. Did not go out but Perce came up & retired to canteen.\n","32":"\n\nGot ready for manoeuvres. Left at 8 for inspection marching rode by General Slater. After inspection of the whole Divisional Artillery the sundry batteries left for a few stunts. I was B.C. horse holder & was flying about everywhere. Left about 2 o’clock. Very cold & windy all today. Did not go anywhere at night.\n","33":"\n\nEarly morning stables. Classification exam for Signallers today. More horses came in. 27th got the Black horses good luck. Received letter from Australia tonight. All answers to my letters & posted first in England. Did not go out anywhere.\n","34":"\n\nTrafalgar Day today. Early morning stables. Signalling this morning. Wrote English letters in the afternoon. Received letters from my Father & Aunt Bess Went to Pictures at night.\n\n \n","35":" ‘16\n\nEarly morning stables. Did not do much in morning. Went out with H.Qrs. staff on new horses. Drivers came out with us. Fooled around and came back at 5. Wrote letters for Aust. mail. Did not go out anywhere.\n","36":"\n\nEarly morning stables. Signalling part of the day. Capt. Campbell injured today by horse. Went over to 8th Brigade tonight for horses for tomorrow’s stunt. In harness room up till 10 cleaning up gear for inspection by General Brunker tomorrow.\n","37":"\n\nReveille 4.30. Early morning stables. Left with H.Qrs. & Battery full marching order for inspection by General Brunker at 8.45. Weather inclined to be rainy. Our Battery inspected in line by General which passed off alright. But the manoeuvres &c. were utterly spoilt by incompetent officers. I only wish Capt. Campbell had been able to come. A crying shame for all the boys did their best. Anyhow the General fairly roared out his wrath on the Battery which dashed our hopes for a good turnout. Returned at 1.30 very downhearted. In stable all afternoon and also the harness room. Received letters from Commonwealth Bank re cabled money, also letter from father & Nance. Did not go out.\n\n \n","38":"\n\nEarly morning stables, signalling in a sort of a way. Transferred to B. Sub. Received Australian letters from Lena & Laurie. Did not go out anywhere.\n","39":"\n\nEarly morning stables. Did not do much today. Went for a few strolls. Passed out of signalling school as A Class. Working my head in in still going across in class. Went orderly tonight as D.A.H.Q. orderly. Received letter from Rana which was opened.\n","40":"\n\nOn D.A.H.Q. orderly. Over at Post Office all day taking out telegrams. Raining every part of the day, very sloppy & rotten. Cleaning up harness. Our leave postponed for what reasons we know not. Mr. Carroll transfered. Everything getting over the odds. Makes one sick of the whole show.\n","41":"\n\nFooling about stables all day today. What with inspection of horses &c. things were very \"onkish\". Word tonight of leave being on again. Did you ever hear the like. Quite a keystone army this. Wrote letter for Aust. mail.\n","42":"\n\nSunday today. Raining like blazes. Went to a church parade in the morning. Wrote letters for Aust. mail at Y.M.C.A. in the afternoon. Did not go anywhere else. Fixed up my saddle &c for tomorrow’s manoeuvres.\n\n \n","43":" ‘16\n\nRaining like blazes this morning. Left at 9.30 for manoeuvres. Did a few stunts in the rain & the Colonel looked on. Coming back at 1.30 it rained & hailed like fury. I managed to keep dry. On harness room & stables afternoon. Did not go out but cleaned up my saddle &c.\n","44":" ‘16\n\nRaining again. On coal fatigue & harness cleaning afterwards. Went down to Amesbury for guns in afternoon. Rode down & came back in limber. Did not go out tonight, but got ready for tomorrow’s marching order parade.\n","45":" ‘16\n\nRaining today. Early morning stables. Moved off at 9.30 for manoeuvres. Did some trotting about first in one position then another practicing the running fight business. Arrived back at 2.30 fairly dry considering. In harness room & stables afternoon. Did not go anywhere but cleaned up for tomorrow’s outing?\n","46":" ‘16\n\nEarly morning stables. Riding school in the mud. Harness cleaning afternoon. Got ready for 4 days leave. Got special leave to start tonight. Left Camp at 6 for Amesbury, but got a car with 3 other fellows for Salisbury. Got to Salisbury station at 7.50. Train leaves for London at 8.25. Train left to time, had rather a slow trip up. Got to\n\n \n\n2nd Nov. ’16 (Con.)\n\nWaterloo at 10.55. Got tube to Charing Cross & walked up to Faulkners Hotel. Went to bed tired.\n","47":" ‘16\n\nWoke at 8 & had a hot bath. After breakfast a haircut. Went to the Commonwealth Bank at Broad St. to see about my money. Then Billy & I went to London Bridge station & got train to Epsom to see his cousin in hospital. Arrived there at 2 & had a rather good afternoon in talking with the wounded men. Got the L.&S.W. to Waterloo back at 5. Went to hut & had brush up & had tea at the B.C.C. After tea Billy went to Vauxhall & I met Milly at Knightsbridge. Went to her place & then went to the Palladium. There saw George Mozart Wilkie Band &c. Rather a good show. Took the girl home & then came back to hotel at 1 oclock tired.\n","48":" ‘16\n\nGot up at 8 had hot Bath &c. Breakfasted & telegramed Millie and Cardiff. Went to Paddington station & got the 11.30 express to Cardiff. Arrived at Cardiff at 2.35. Met Beattie & her father at the station. Took tram to Grangetown & walked to her home. Sat with her people all the afternoon up till tea time. After tea Beattie & I went into town. Walked round for awhile & then went to a picture show. Came home\n\n \n\n4th November ’16 (Con.)\n\n& had some supper. Went to bed at 12.30.\n","49":" ‘16\n\nGot up at 9 & shaved & brushed up. After breakfast Beattie & I walked through the Ely River Subway to Penarth on the Sea shore (Bristol Channel), a very pretty place. Spent an hour there & walked back. Had dinner at home & sat in the sitting room with a big fire talking & reading. After afternoon tea, got ready to leave for London. Went to Station with Beat & got the 4.45 train to Paddington. Arrived Paddington 8.5. Went to Hotel & booked room & was entering Trafalgar Tube when I met Bill & the girls. Some luck. We went to Millie’s Place & then out to Camberwell Green. After we saw the girls home we got tube back to Hotel 12 mid.\n","50":" ‘16\n\nGot out of bed at 9.30. Had a hot bath & breakfast. Met Millie at Charing Cross Tube & walked up to the Strand to the Photographer & got taken. After that Billie & we got a taxi to Baker St. & took the girls to Mme. Taussuds. After we came out we went to the Globe for dinner. Afternoon took train to Richmond & walked down to the River Thames. Came back by train to Hammersmith & Tube to Charing Cross. Had Tea at the B.C.C. & then saw the girls home. Said good bye to them. Came back to hotel to get our things.\n\n \n\n6th November ’16 (Con.)\n\nWrote to Beattie & then made tracks to Waterloo. Left Waterloo by the 8.13. Arrived Amesbury in good order. Lucky enough to get a car back to camp. Got to bed very tired.\n","51":" ‘16\n\nWoke at 4 with the welcome news that we were to go out at 6 on a stunt. Very fine when a fellow comes back from leave. Anyhow it rained like blazes. Moved off in the dark for the rendezvous. Arrived at 7.0 & got everything fixed up for the stunt. Fired blanks & the whole show lasted the morning. Arrived back at camp 1.30 wet & very doppy. Harness room & stables. Walked up to Post Office for money from Commonwealth Bank. Wrote to Millie & Florrie. Received letters from Connie & Nance also Wyn.\n","52":" ‘16\n\nEarly morning stables. Not a bad sort of day. Fixing up the stables. Our unit on duty. Went to Amesbury tonight on a G.S. Wagon with a load of coal for Amesbury House. Had a bit of fun with the mules. Came back at 8 after having tea at the House. Wrote Xmas cards for home. A beautiful moonlight night & very cold.\n","53":" ‘16\n\nEarly morning Stables. Riding school with English Lt. Stables & harness room in afternoon. Did not go out. Stunt on tomorrow.\n\n \n","54":" ‘16\n\nEarly morning stables. Went out on stunt at 9 which eventuated in riding school laughter. Came back & fixed up horses for midday. Harness & stables afternoon. Did not go out. Harness room tonight.\n","55":" ‘16\n\nEarly morning Stables. Cleaning up instruments. Midday stables. Walked up to Lark Hill to laundry. Did afternoon stables. Received Aust. mail & letter from Milly. Wrote Aust. Letters at night.\n","56":" ‘16\n\nHut orderly. Took horse out for exercise in morning. Did midday & afternoon stables. Cleaned up & got ready for tomorrow’s big stunt.\n","57":" ‘16\n\nEarly morning stables. Left at 11 oclock for the big stunt. All the 3rd Division including all Artillery, Infantry A.M.s A.S.C.s went on column march through Amesbury passed Stonehenge to Winterbourne Stoke and Shrewton back to camp, about 20 miles altogether. The whole column was about 8 miles. It was a very fine day in fact the best we have had for some weeks. Arrived back at camp at 5.30 after a somewhat good day. Fed & watered horses & had tea at 6.15. Did not go out anywhere tonight.\n","58":" ‘16\n\nEarly morning Stables. On communications work with Staff. Harness room after Stables. Walked\n\n \n\n14th November ’16 (Con.)\n\nup to H10 Camp for watch. Came back and had tea at Canteen.\n","59":" ‘16\n\nEarly morning Stables after reveille 5 a.m. Left camp at 7.30 for stunt. Had a good ride out for about six miles from camp. Horse holders let our horses go which resulted in a stampede. My horse was badly hurt, and I left them in bivouac to bring her to camp. The Vet. bandaged her up, but I am afraid she will be bad for some time. Did not go out after I came home to camp.\n","60":" ‘16\n\nEarly morning Stables. Very cold day. Did not do much all day. Went to Y.M.C.A. at night to see concert. Stunt on tomorrow for us. Reveille 5 a.m.\n","61":"\n\nEarly morning Stables. Stunt did not come off. Fooling about harness room & stables all day. Very cold & windy. Had letter from Florrie. Went to pictures at night. Came home at 9.30. Slightly snowing tonight.\n","62":"\n\nEarly morning Stables. Easy morning on fatigues. Snowing all day. Went to Vaudeville at night & came home. Snow was falling pretty heavy. Had some supper at the canteen.\n\n \n","63":"\n\nEarly morning stables. Snowing very heavy nearly all day. A very pretty sight to see the Plain under snow today. Very easy day. Wrote letters & stables at midday. Raining at night.\n","64":"\n\nHut orderly for morning. Easy day. Unit on duty. Walked up to Lark Hill for laundry &c. Went to concert of Brigade. Presented medals by General Grimwade for winners of events at Sports. I got my medal for the Signallers Contest win.\n","65":"\n\nEarly morning Stables, which resulted in 10 of the Battery getting hauled up for being late. Great chagrin. Result 1 days C.B. with a marching order parade thrown in. Fooling about stables & harness room all day.\n","66":"\n\nEarly morning Stables. On communications & riding school through the day. A very fine day but very cold in the morning. Did not go out anywhere at night.\n","67":"\n\nEarly morning Stables. On Ration Fatigue. Not a bad job. Over at Y.M.C.A. before dinner and afternoon wrote to Florrie & Millie about leave refused. Received letter from Millie.\n","68":"\n\nEarly morning Stables. Exercising horses after breakfast. On bareback with only reins on head, still great fun. Easy day on stables & harness. Received letter from Beattie. Went to pictures with boys at night. Saw Charlie Chap. in \"By the Seaside\".\n\n \n","69":" ‘16\n\nEarly morning Stables. Cleaning up for inspection. Left by car at 2.30 for Salisbury. Arrived after a fine ride at 3. Walked about town & bought sundry things. Booked seats at New Theatre. Had tea at Nicholas. Kept the show going, the boys kicking up some row. After tea walked down to the County, had our first drink. After this had sundry drinks round town. Arrived at theatre with the boys very merry. A general mixup. Some of the boys rushing about to get rid of some surplus beer. Anyhow we did not see much of the show. Left theatre at 10.40 to get car. Got car back at 11.15 with boys a bit better. A very fast ride home and the night air which was very cold cleared them a bit. Got to bed tired. Received letters from Nance & Beattie.\n","70":"\n\nEarly morning Stables. Clipping horses in morning. Midday stables. Wrote letters for Aust. mail. Received letters from Rana & Aunt Bess. Got photo from London. Wrote more letters at night.\n","71":"\n\nEarly morning stables. On M.O. Fatigue. Reeling in afternoon. Late Stables. Went to Picture Show at night.\n\n \n","72":" ‘16\n\nEarly morning Stables. Left at 9 for manoeuvres. Went over the Artillery Range. Had an easy morning and came back at 12.30. Left again with some of the Staff & Officers for looking over the Range for our coming shooting practice. Came back at 5 & fixed up the horse & saddle. Received letters from Florrie, Millie & Lena. Did not go anywhere at night.\n","73":"\n\nEarly morning stables. Left camp at 9 oclock on a Brigade stunt. After inspection by Colonel, we all left for the Range. Took up troop position which lasted all the morning till 1 oclock. Came back to camp at 2.30 and fixed up horses. Did not do anything much till stables at 4.30. Received letters today from Nance & Rana.\n","74":" ‘16\n\nEarly morning Stables. Exercising horses & stables. Brigade had photograph taken today in Batteries. Posted letters & my photos to Australia by Vancouver mail. Did not go out. Firing practice stunt tomorrow.\n","75":"\n\nEarly morning Stables after reveille at 5. Left camp at 9 for the first shooting practice of the Divisional Artillery. Old General Brunker roared at us all. Anyhow our Battery did some good shooting considering the day was very misty & dull. Fired 50 rounds\n\n \n\n1st December 1916 (Con.)\n\naltogether for the Battery. Left the range at 2 oclock for camp. Arrived back at 3 and had dinner after stables. Cleaned up harness for tomorrow’s inspection so did not go out.\n","76":"\n\nEarly morning stables. Hut orderly for morning. Over at Y.M.C.A. afternoon. Received letters from Laurie & Millie. Firing practice continues tomorrow.\n","77":"\n\nEarly morning stables. Reveille at 5 a.m. Left camp at 8.30 for shooting. Not at all like Sunday today. We had second shoot today. Two series of shoots. Old Brunker roared as usual. Some pretty good shooting by all the Batteries today. Left the range at 12.00 for camp. Day slightly misty altho’ better than our first day’s shoot. Went to Y.M.C.A. this afternoon. Did not go out anywhere, but went to bed early.\n","78":" ‘16\n\nEarly morning Stables. Did not do much in the morning. Did midday Stables. Received letter from Rana. Exercising horses afternoon. Also stables. Did not go out at night. Reveille at 4.30 tomorrow morning for shooting.\n","79":"\n\nEarly morning stables. Reveille at 4.30. Left camp (Battery staff) at 7.30 for firing practice. We did\n\n \n\n5th December ’16 (Con.)\n\nall the communications for the whole Brigade. Our Battery shot first. Passed off very fair. I with 6 of our staff stayed behind to keep up the communications. Had a great shock in the early morning before firing started. Went out on the horse over the range to deliver tele. plugs. Somehow I was rather late in getting the plugs away and I had to Gallop madly back to the O.P. for safety as firing was just about to start. I was 3 miles away from my goal. I think the old horse did it in Cup time, and dodging shell holes was very awkward. Anyhow they remembered I was out on the line of fire so shooting was delayed 5 minutes for me to get out of the way. I was greatly relieved when I got back to safety. Arrived back at camp at 2.30. Had dinner and afterwards did stables. Did not go out anywhere. Received letters from Charlie, Trev. & Beattie.\n","80":"\n\nLeft camp at 7.30 after having breakfast & harnessing up for the range. We were on observing work for the 8th Brigade. We were in the dugout up near the 4 gun battery from which I had the race for life yesterday. A rather good day, slightly warm in the sun. Some pretty good shooting by the 8th. Got back to camp at 3, had some dinner & had afterwards\n\n \n\n6th Dec. ’16 (Con.)\n\nhad a rest. Did not go out anywhere.\n","81":"\n\nGot ready for leaving camp at 7.30 for Range. One Battery fired from the Gun pits over Knighton Down. I left the with horses and came back to stables at 10. Battery fired very well today. Left with horses at 12.15 for the dugout. Fooled about harness room & stables. Did not go out at night.\n","82":"\n\nEarly morning stables. Rode down to Bulford with a \"pommy\" S.M. and brought his horse back. Handed me 2\/- for my trouble. not go out.\n\n"}}