{"Document Name":{"0":"Diary_0162","1":"Diary_0162","2":"Diary_0162","3":"Diary_0162","4":"Diary_0162","5":"Diary_0162","6":"Diary_0162","7":"Diary_0162","8":"Diary_0162","9":"Diary_0162","10":"Diary_0162","11":"Diary_0162","12":"Diary_0162","13":"Diary_0162","14":"Diary_0162","15":"Diary_0162","16":"Diary_0162","17":"Diary_0162","18":"Diary_0162","19":"Diary_0162","20":"Diary_0162","21":"Diary_0162","22":"Diary_0162","23":"Diary_0162","24":"Diary_0162","25":"Diary_0162","26":"Diary_0162","27":"Diary_0162","28":"Diary_0162","29":"Diary_0162","30":"Diary_0162","31":"Diary_0162","32":"Diary_0162","33":"Diary_0162","34":"Diary_0162","35":"Diary_0162"},"Date":{"0":"unknown","1":454.0,"2":468.0,"3":469.0,"4":470.0,"5":471.0,"6":473.0,"7":476.0,"8":477.0,"9":479.0,"10":483.0,"11":484.0,"12":488.0,"13":497.0,"14":498.0,"15":511.0,"16":512.0,"17":513.0,"18":520.0,"19":521.0,"20":522.0,"21":529.0,"22":538.0,"23":616.0,"24":618.0,"25":642.0,"26":643.0,"27":652.0,"28":680.0,"29":698.0,"30":699.0,"31":719.0,"32":722.0,"33":723.0,"34":740.0,"35":834.0},"Entry":{"0":"\n\n","1":" Nothing new to report. Attended church parade this morning. Usual old dreary ceremony. It is very hot to-day. Decided this morning to go up to the pyramids in the afternoon but found the heat too enervating and am instead at present watching the antics of the monkey that is the monkeys domicile. His superabundant activity however refuses to \n\nallow him to confine himself to his particular residence. Fifty times in as many minutes he climbs to an adjacent post and from there skips on to the back of a friendly horse. It can realise the relation between cause and effect, at any rate whenever the rope by which he is tethered becomes twisted over some projection and limits the field of his operations he immediately investigates and sets matters right. Sometimes seeing that trouble will ensue he rectifies matters at once. Apart from their semi-human traits that which always presents itself to me as the most striking characteristic of these animals is their unceasing activity. They do the same things over & over again. Yet anything new will always secure their attention.\n","2":" We are off at last. Yesterday evening we left Mena Camp about 4:30 and marched into Cairo. Here we were entrained & \ncame\n went on to Alexandria.\n","3":" \nLast night\n Yesterday morning we came on board the Lake Michigan, the transport at present conveying us to the Island of \nSoumos\n Lemnos where we get our orders. We may be here an hour or a couple of days. It is reported that we will have to land under fire. Dinner yesterday was pretty crook. Breakfast was good no middling. To-day the meals have been passable. We are to be issued before landing with 3 or 4 days’ rations & 200 rounds of ammunition. The vibration of the vessel makes it rather difficult to write. I have escaped sea sickness so far, which is agreeably surprising.\n","4":"\n","5":" Still on the Lake Michigan and travelling North. We have now been issued with 200 rounds of ammunition The greatest good humour prevails everywhere and we are looking forward eagerly to the first encounter. The ammunition balances the pack and I think that we would be able to march much longer distances with full than with empty pouches.\n","6":" Still at Lemnos. Rumours are rife. It appears that we are off on Monday. Heard to-day that we are up against 300000 Turks. We are to have an equal force however. Meals are pretty fair. They are much better than on the Euripides. Am eating like a tiger. The dry canteen is in common parlance \"up to dough.\" The individual behind the counter is a very casual sort of person, his work seems to him to be merely accidental. When you purchase from him you assume an obligation which it is impossible for you to wipe away. The usual insanity of lining up and waiting for a couple of hours for a woodbine is perpetrated daily. We are very crowded down here. The allowance of beer has been cut down to ½ a pint daily & great is the grief occasioned thereby. We have a regular fleet of warships in harbour right now. For breakfast we have porridge, boiled eggs, \nwith bread\n or salt fish & potatoes with bread & butter & tea. For dinner soup, meat & potatoes. For tea bread butter & jam with tea. \n\nSometimes we have an extra as pudding. The jam is usually practically a negligible quantity. The butter was absolutely rank this evening. I was paid £2\/15\/- the other day. This is for the month ahead. \n\nVic Brown has got his second stripe. He was unlucky enough to be relieved of his field glasses to-day. The other night (last night in fact) an argument arose as to whether we arrived here the day before or the day preceding that. The men with the diaries argued that we arrived the day before those without argued for the day preceding. In an hour or so the whole ship was arguing about it. Some bets were won & lost over it. It was a very peculiar thing that almost every man should be wrong in his calculation.\n","7":" Still at Lemnos Am on guard to-day. We are having very nice weather. No further word as to when we move off. Had salt fish this morning. The best of having salt fish here is that you can’t satisfy the thirst it creates.\n","8":" Had\n\nAustralian mail yesterday. Got two letters. Was on guard last night from 11 p.m. to 3 a.m. Weather was very dirty. My post at the forecastle, at the head of the steps leading to the crews quarters. Struck an old chap who knew the Bay and had quite an interesting yarn with him. It was fairly cold but I was lucky enough to strike about 1 quart of hot coffee about 12 o’clock. Then once again I faced the rigours of the night. When I turned in at 3 I slept like a log. To-day our coy was to have gone ashore but wind blew so hard that when we got into the boats we could make no headway. Tea was a bit miscellaneous to-night. There was a tin of boned mutton left over from dinner. Then there were pickles bread butter and jam. When we had nearly finished we got a surprise packet in the way of some rice & currants. However our hospitality was easily capable of including it also. When I had finished and found there was nothing more eatable at our table I made inquiries at the next\n\nbut – there was nothing doing. Many of us are placed in the unfortunate position of having money and being unable to spend it on account of lack of change. Well as the amorous Arab says this is \"fineesh\" which being interpreted means the end for to-night\n","9":" Yesterday we landed and carried out an imaginary attack. Some of us had to wade ashore with boots &c on. However but little discomfort was felt on this account. We had a grand time making our way through the cultivations. In places the recent rains had left the \nground\n ploughed ground very boggy. The soil \nover or\n where we landed is extremely fertile and the most delightful perfumes rise from the crushed herbage. Poppies grew in abundance. and added an enlivening note to the scene. The people put up no fences or walls, in fact there are practically no divisions between the various plots at all. Sometimes they make a line with stones but that is all. The houses are \n\nbuilt of stone. I do not know about the villages but I think they are of stone also. The villages are of course typically eastern. These places from a distance always look to me as though the houses have been dumped down anyhow. They have the same detached & isolated appearance presented by a box of blocks thrown anyhow on a table. We bought nuts chocolates cigarettes tobacco &c. The people here are much cleaner than the Arabs. You can detect them by two senses only. Both the advantage & disadvantage of the Arab vendor was that he could always be located by smell also. If the acoustic and optical organs failed the outrage on the olfactories ones was always too violent. So pass unnoticed. Those who came round \nsp\n selling spoke English very well. The men thoroughly enjoyed the work yesterday as the change from the sand to the well grassed slopes was very agreeable.\n","10":" or","11":" Am still at Lemnos. Rumours constantly getting around that we are moving. It seems \nthe\n now that we are going to-morrow night. Have made the awful discovery that I am \"chatty\". Got a most awful shock I had attributed an itch I had noticed for some time past to a rash but I have now found that the rash is in the first place due to those vile \"hexapods\" known as lice. The first one I discovered gave me no little trouble. On routing him out he sprang to the floor and raced for cover. I followed in hot pursuit over forms under tables through hammock bins, etc. Once he doubled under me and I tripped over him. Presently half the company was after him. In desperation he charged up the companion way to the next deck. Here he created a panic amongst the horses and the battalion Mascots joined in the hunt. Finally with palpitating sides & gleaming teeth he bailed up in a corner. I approached warily with a 2 x 3 plank and with Some little trouble despatched him. He was judged the finest specimen found at our table.\n\nAfter that I set to work systematically and was amazed at the numbers and size of these parasites. Many of them had left behind fine prospects of a vigorous and healthy posterity. I took good care however when I came across these embryological aspirants to the higher life to nip their activities in the bud. I went through my flannel again very carefully this afternoon. The bag consisted mostly of young game & eggs. I hope with a Jew more such expeditions to have the enemy well in hand. This is my first experience of these carnivorous gentry and I sincerely trust that it will be the last. To-day we went out in the boats but did not go on shore. The food has been very good all things considered. There was one day however when the meat was very high. It lifted itself off the dish. Old Sydney Herbert (who was mess orderly that day) had to keep one hand on it all the way from the galley to our deck. A few times he found himself treading on air. This morning we had dry hash. This was exceedingly acceptable. It was mail day to-day. Did not get any\n\nletters however. The other day we went for a short route march. The recent rains had left the roads in a rather bad condition. With equipment and 200 rounds of ammunition weighing one down the feet suffer, so do the socks. When I came to have a look at mine that night I found myself contemplating mainly a collection of holes. It took about 3 hours darning to fix them up (in 1 sock). The other still remains to do. I have not got another pair with me. So much for the vicissitudes of a soldier’s life. However as the song has it \"Cheer up pally You’ll soon be dead.\" We have got to land under fire so this may not be altogether inappropriate. We received news to-day of another victory for the British in Mesopotamia. The Unspeakable is now hemmed in on all sides or pretty well so.\n","12":" We are moving out to-day and will land to-morrow. Rations are now being served out. I am on fatigue to-day (Quartermasters). Have been juggling casks of biscuits boxes of onions sugar & such like commodities. They day is cloudy with a somewhat cool wind blowing. Am much relieved at the prospect of a change from \n\nthe boat. The prospect of meeting the enemy causes much elation among the men. One of the transports has been aground for 3 days. Some say she is on a rock. They have had the tugs at her but they can’t shift her. Our coy is the first to land. Seventh & eighth platoons lead. I think we will be carrying the implements.\n","13":"\n\nDuring the last week events of world-wide importance have taken place. The Turk has been invaded in a manner that he would have thought \nwould ever\n impossible. The Gallipoli Penin. has been the scene of terrific combats and one of the most difficult problems of modern warfare. viz the landing of troops on a fortified & well manned coast has been accomplished. Referring in particular to that portion of the work allotted to the Aus, Div. there can be no doubt that they achieved a wonderful success. The","14":" Brigade landed on a narrow strip of beach in the face of machine-gun & rifle fire. Shrapnel also was directed against them. Straight up from the beach the land\n\nrose abruptly in sandy hills steeply escarped by water-courses low shrub gave excellent cover to the enemy. In the face of such odds our troops landed some swimming they could get a footing and charged driving the enemy at the point of the bayonet. \nThere was one hill\n The land rises some hundreds of feet in height and over this the enemy were driven. \nLater\n As time went on other troops were being landed and now a firm footing has been obtained and the Turk is as good as beaten. The other landing forces have also got on shore so that the enemy will shortly be enclosed. One great disadvantage under which we laboured in the initial stages of the invasion was the lack of artillery. The Navy did incalculable good but land artillery was badly needed on account of the difficulty which the ships experienced due to concealment of the enemy’s guns. However when I left the artillery was being got into position so that by this time the enemy has no doubt been considerably warmed up. I am at present in hospital \nhav\n just out of Alexandria having been wounded in the left arm. It is nothing serious.\n","15":" I am now in the convalescent hospital I have been here about 4 days and my wound is rapidly improving. The sea is only a couple of hundred yards away and I often spend a couple of hours down there. I went down to the base yesterday and got some of my own clothing from my kit bag. I went to the barbers to-day and had a shave and a hair cut. Eastern barbers contrast painfully with those who carry on according to the western idea of doing things. The chair is of the ordinary sort except that it has a permanent cross piece at the back. This convenience is only moveable vertically. The lather merchant that I visited to-day uses a rusty nail to hold it in place. Hot water is not to be thought of and the brush is never washed. Ordinary soap is used. When he strops the scraping could be heard at 100 yards. Its a toss up between the razor and a saucepan lid. The manipulator of the brush and blade dashes the soap on and scrapes it off again in this most cheerfully unconcerned manner. What the razor wont cut it will drag out is the philosophy. On his arm \n\nbears the insignia of his office The accumulated lather of the day bristling with the hair of his victims. They charge ½ piastre here for a shave, I paid the same amount the other day for an orange. A hair cut is a piastre. There is a dry canteen here. You can get eggs & chips 1 ½ p. eggs & bacon 2 p. eggs 1 p. bread ½ p. tea ½ p. You can sometimes get fish sometimes also rice is available. The proprietor and his employees are both honest and courteous; \na rat\n virtues not common here. As a general rule the employees in these canteens seem to think that their service places a purchaser under an obligation. The convalescent camp is at Mustapha. It is rather uninteresting out here. I think I have succeeded in getting rid of my little six legged guests.\n","16":" \n\nAm still in the Convalescent Camp at Mustapha. Things are pretty stale out here. There are no amusements of any kind practically. The other evening an Egyptian Band played some selections for us but it was a rather tame performance. There\n\n \n\nis a pretty good place for sea-bathing for anyone, well enough to indulge in it. The doctor comes round once a day. My wound is progressing pretty satisfactorily. The Allies in the Peninsula are making steady progress. Very little news comes through. Censorship is more than usually severe. It is rumoured that fever has broken out amongst our men. Italy has not yet declared war although her people seem anxious for it. Have not had any word of Vic Brown. We get no reading matter out here. The weather is beautiful though; some find it a trifle warm. One can often not find the slightest trace of a cloud even on the horizon. \n","17":" Am once again aboard. Am on the Transport AI 8 (Cardigan shine) and off back to the Dardanelles. The destination probably Lemnos. Have not got rifle or equipment yet. Am also minus a razor to which fact my phyz sometimes bears eloquent witness. Heard to-day that Vic Brown was in Hospital 17 & has been sent to England. The bullet knocked out some of his teeth cut his tongue and \n\npassed through his cheek. Italy has now been involved in the war for some days and appears to be progressing very satisfactorily. Both Roumania & Bulgaria are also apparently about to come in. The English & French are either holding their own or making steady progress. I will now give an account so far as my own knowledge is concerned of the fighting on Sunday & Monday the","18":" &","19":" respectively. On the evening of Saturday the","20":" we left Lemnos and steamed for some hours anchoring at last behind a hilly coast. Here we remained until 12 o’clock at night. Up till sundown there were in all 12 vessels. At midnight we were again on the move. We got up about 4 o’clock, had breakfast, and with equipment and rifles went up on deck. It was still dark and not a light (except those used for signalling) was visible. Before long however the coast became visible in the slowly increasing light. I went down to the fore well-deck where our platoon was to gather. We were assigned the starboard\n\nside. As we were still slowly steaming forward a dull booming came to us over the water. This was from one of the warships. It was soon succeeded by another & yet another as the warships in turn took up the cannonade. From our position we could see the shells landing. Amidst the flash one could detect dark masses as of huge blocks of earth torn upward. Huge volumes of smoke & dust rolled upward. In fact after a time the shore became more or less obscured beneath the drifting pall of smoke. The batteries of the enemy replied feebly but were easily outclassed. The Queen Elisabeth – was a magnificent sight as she came slowly up and turning broadside and menaced the shore. Her great aft guns were swung into position but she did not fire. While it was yet a half light the rattle of musketry came off shore from our left. The Third Brigade was landing & routing the enemy from his trenches. As the light increased and the \n\nenemy’s reinforcements began to come up the fight between the land forces became fiercer & fiercer. About this time our boat was ordered on past the line of the warships in order that we could disembark. Presently the naval pinnaces came round with boats. When landing some of the","21":" Brigade had left their packs in the boats. One of them was stained with blood. I shall never forget the peculiarly subduing effect that this had on us. After awhile we were marched down the gang way & so into the boats. Then we pulled out in a bit of a semi circle and so to the shore. As we were going across the Turks tried to shell us but their efforts were reduced practically to nil as they were easily mastered by the guns of the navy. A few shells fell but none anywhere near us. When we got on shore we were formed up & marched off to our rendezvous. Here we remained until about 4 o’clock. All day long the fight raged in front of us and the bullets went whizzing\n\nby above our heads. Shrapnel continually came over and burst but did no damage. At one time we dug ourselves in as the shrapnel began to get a bit unpleasantly near. About 4 o’clock we went up to reinforce the right flank. One part of the way was swept by shrapnel but we got through it all right. The country was steep almost precipitous. It was broken up with deep gullies covered with a low scrub. Part of our company got into the firing line about sundown. The rest of us set to work again to dig \nour\n themselves in. \nAs night came on\n Through the night the Turks attacked time after time. We lay with fixed bayonets ready to assist in repelling an attack at any moment. About 4 o’clock in the morning our platoon filed along the trenches and took up a position. The fire was still pretty hot but as daylight came the enemy relinquished the attack where we were although firing was still kept up on our left. On taking up our position in the trench we set to work to improve it and obtain protection from shrapnel. All day \n\nbullets went whistling by overhead but no casualties ensued where we were. Early in the morning we stuffed some snipers out of the bushes in front of us. Things got quieter as time went on and in the afternoon we were just taking a bit of a spell when the order came to line the ridge. We rushed out of the trenches and with bayonets fixed advanced. As we went forward we were met with a terrific combined rifle & machine gun fire. We drove the Turks forward for some hundreds of yards crossing a couple of lines of trenches. The fire however became simply terrific and the order came along to retire. We were lying down at the time so we rose & with the bullets whistling all around us we ran back. We retired to our original trenches then came out once more and took up a position on the second ridge from us. Here I met Vic Brown. We lay down side by side. Syd Gryce & Charlie Davis (2 others in our section) were close by. The enemy now got to work with & shrapnel. A heavy rifle & machine gun\n\nfire was poured into us. The Turks began to advance but we opened fire on them and put a stop to that. At any rate the advance ceased. Vic & I struck a very warm corner. We were both wounded as indeed were almost all immediately to our left. Poor old Vic got shot in the mouth. I learned that he has been sent to England. The bullet cut his tongue and passed out through his cheek. Eventually we had to retire from the ridge. We made our way back to where some of our fellows were digging in and commenced the same operations. My arm was however getting too stiff by this time so I went to the dressing station to get it fixed up. I then ascertained that it was more serious than I had thought at first. I was rather relieved otherwise to find that I could have a spell in hospital.\n","22":" Arrived \nthis\n last night at Lemnos & took up our anchorage this morning. We are in just about the same position as that formerly occupied by \n\nthe old Lake Michigan Lemnos is a good deal cooler & fresher than Alexandria. The shore now presents somewhat the appearance of a Mosaic as the crops in different stages of ripening show up in contrast. There is a good number of Ships here; naval and transport. The meals on board here I think are the best we have had so far as transports are concerned. An agreeable change was given us this morning in the way of herrings. I have once again been issued with equipment. I now only lack a shaving outfit \nand\n waterproof and housewife.\n","23":" I am now on board the Hospital ship Assaye. Have been on her for about 4 days. Was taken first of all from the shore to the Devanah thence to the Assaye. I am completely run down. Must have lost between 3 & 4 stone in weight. We are at present at Lemnos. The food here leaves much to be desired. The diet mainly consists of bread butter & jam. We have 800 or 900 patients on board both wounded & sick.\n","24":" Arrived to-day in the Assaye at Alexandria\n\nWe left Lemnos on Saturday night about 8 p m and arrived at Alex to-day about 2 thus doing the run in about 40 hours.\n","25":" On","26":" (I think that was the day) I came out to Mena House. I am afraid I have got some of the dates in August wrong. Since leaving Ghezireh Palace Hospital where I was previous to coming to Mena House I have been through a very serious attack of dysentery both doctor & nurse having told me that they thought I was going to pass out. I am now well on the way to recovery however. I fell away to a mere skeleton. I brought the trouble on myself by eating melon at Ghezireh the evening before I left. However as the First Latin Book has it. Experience gives wisdom to the soldier. I will in future eat the succulent product of the vine with more circumspection. I am to be invalided home, though when I do not know. Hurrah! for Australia again! To-day is Sunday but being still considered a bed patient I was not compelled to attend the service. Hooray again! There is to be a concert to-morrow \n\nnight and I feel sure that I will be allowed to attend that. I spend a fair amount of my time reading and no doubt as I gather strength I will be able to devote yet more time to it.\n","27":" News has come through that the Dardanelles have been forced 7 ships being sunk in the operation. The papers of to-night ought to confirm the report if it is true. \nOn the\n In the paper of the","28":" was an account of the capture of 120 000 Germans by the French. Our own troops \nhave received\n have to work in a country which affords any amount of cover to the enemy who place their machine guns in doorways cellars & garrets; in fact in every available position.\n\nThe evening before I left Ghezireh Hospital I ate some \nmeo\n water-melon which an obliging orderly told me I might have. I was at the time in a state of extreme debility and had but shortly got over an attack of chronic\n\ndiarrhoea. That night acute diarrhoea set in and quickly developed into dysentery. So violent did the attack become that eventually kill or cure methods were resorted to. I got through all right and am now convalescent. I am at present eating bread & milk, \n(breakf\n omelettes, boiled eggs, fish, chicken & vegetables, with cocoa & egg flips for drink. I am putting on weight but am still pretty weak. I am affected with lassitude at present but always leave a clean plate despite this fact. I am to be invalided home shortly on six months furlough. I have no objections whatever. At first when I began to recover I was perpetually hungry. No sooner I had I finished breakfast than I was waiting for 10.30 to come round round & so on from meal to meal.\n\nI was fortunate in being attended on by a doctor & nurse both of whom did everything for me that lay in their power. I am deeply indebted to them. Mena House Hospital in peace times is a hotel. It stands a short distance from the Pyramids and is a very fine and commodious place. The rooms are lofty and of generous size, and there is every modern convenience that one could reasonably ask for. We have concerts here fairly frequently. The talent is pretty good throughout. There is a countess in particular who participated in both our last big concerts who deserves to be remembered for her indefatigable efforts on behalf of the soldiers. She organises or takes part in about 6 concerts on an average in the week. The news of the great victories resulting\n\nfrom the allied offensive in the West does not stir our phlegmatic temperaments to any demonstrative \nexhibition of the\n indications of the satisfaction which we nevertheless deeply feel. It was made at the right moment. It will no doubt profoundly affect the morale of the Germans combined as it is with the check & reverses in the East and the change in the Bulgarian attitude. If it is true, that the Dardanelles have been forced and the result of this operation \nhas the its\n is coincident with our expectations it does not seem to me unreasonable to hope that the end is near. With the dream of an Empire extending through Asia Minor shattered, with alienated Balkan sympathies, and reverses & checks on the eastern & western frontiers \nthe\n German \nmust surely\n hopes & aspirations must receive a severe shock.\n","29":"\n\nI am still at Mena House. I have now gained greatly in strength & weight. I am not after all to be sent home. Disappointment extreme. I am now on \"full diet\" which in reality is scantier than \"light diet\" I am at present looking after in a minor capacity two chaps suffering from dysentery. Just a sort of handyman. I can hardly be termed a full-blown orderly. Yesterday there was a scrap at dinner. One of the orderlies came to the table drunk and ","30":"\norderly. He made himself offensive to one of his brother orderlies who retaliated. Others intervened but the inebriated individual was thirsting for blood. He got it too but it was his own. Perhaps I should say he lost it. He wears a beautiful boquet on his top lip to-day. The weather is very pleasant at present. Tourists are rather more numerous I think than they were last year. The Arab is a magnetic\n\nperson. He attracts coin to himself in divers fashions. He is not eloquent but he is extremely persistent. This persistence is like German militarism hard to overcome. A little stick or cane operating in conjunction with a strong and adroit arm are the proper correlatives to his gestured solicitation. He talks as much with his hands as his tongue. The natives do not use reins on their donkeys. They guide them with a stick. These donkeys are wonderfully patient & docile. They carry loads apparently out of all proportion to their strength. Of an evening Arab children may be seen perched on top of a huge load slung across the back of one of these donkeys, the very picture of contentment. In spite of the dust & poverty in which many of these people live they appear to be in general pretty healthy. Survival of the fittest. Some are very ragged and filthy. Last night the poor old Arab chap who sells papers out here was in great trouble. His wife had run away. He shed tears. He refused to be comforted\n\nwhen he was told that he really ought to be glad. The chaps told him he was very fortunate but he couldn’t see it in that light and merely used his hand more vigorously than ever. I am very much fed up with Egypt but cannot contemplate the trenches with much joy either. Well I will have to wind up here as there is nothing more to write.\n","31":"\n\nAm now at Helouan. Have been out here about 11 days. ……….. at Al Hayai Hotel. This is a good sized building. It is built in a generous fashion. The rooms are large and lofty and the halls wide. It is built of stone brick wood & plaster. Is has a good piazza & colonnade. The piazza is tiled. The paths are bordered with ornamental low of a rustic fashion. There are 3 fine tennis courts. The hotel is built on 2 wings. We have our meals in the dining rooms here. There are a number of animals here in an enclosure. I think they are ibex and are native to Africa. We have breakfast at 7.30.\n\nReveille goes at 6:30. Breakfast consists of meat, eggs, rice with curry, or porridge together with bread butter jam. There is tea to drink. Dinner at 1 o’clock. We have meat 2 or 3 vegetables & pudding. We have tea at 6 o’clock. For tea there is either a salad eggs or meat with bread butter jam & tea. After breakfast there is a parade on the colonnade. This colonnade is built in the form of a right angle the long arm of which is about 80 yds long. The short arm is about half this length. Every patient goes before the doctor. First a roll is called. The P O opens or is supposed to open at 10 o’clock. It was half an hour late this morning. This place is infested with cats. When the spirit moves them they serenade the patients who however are very unappreciative. Some of the patients say that it is hard to get out of this place in order to rejoin your unit. Leave may be had every day from 2 till 9. if it is\n\napplied for. Leave is granted daily to 2 o\/c. if the patients to or for Cairo. Helouan is about 20 miles from Cairo. The nights & mornings are pretty cold now. The air here is splendid. There are 8 in the room in which I am at present. We get paid every Thursday here. The amt is 10\/-. Helouan is on the opposite side of the Nile to Mena. There are very few sisters here. I got word the other day about Vic Brown Charlie Dalero Syd Grice & Bert Ball.\n","32":"\n\nAm leaving Helouan to-day\n","33":" Am now at Ghizeh. This Camp is filthy dirty. The dust rises in such quantities that the tents are coated with a thick covering of it. All the new comers have to spend the first few days sleeping where they can. I managed to secure a in the mess room last night. This was preferable to the ground. We have our meals in rather a casual sort of way. There is a very heavy mist of a morning\n\nhere, and the air is very rank. It appears that the second Division is to be shifted from here. There must be about 50 men without tents perhaps 100 would be nearer the mark. Yesterday we were issued with waterproof blankets dixie knife fork & spoon. Rumours are rife to the effect that the Aussies are to be withdrawn from the penin,\n","34":" To-day we are off to the rejoin our units. I put in about a fortnight at Giz. A lot of the fellows are . I took life pretty easily at Giza, did no parade or guards pickets or fatigues. Christmas passed pretty quietly at the camp. Dinner was nothing unusual. We were issued with our . I struck 3 pkts cigs 2 tins of Havelock 2 tins sardines 1 fruit pipe &c &c. There was very little drunkeness almost the whole camp going to Cairo. There were some rows there. Thus I am writing this in the . \n","35":" Arrived at Marseilles to-day. Left Alex. last Thursday night. Had been at Serapeum and Tel-el-Kebir prior to that. When we went to Serapeum I had ingrowing toe-nails and had to go to hospital and have plucked out. Nails have not yet grown. Rejoined the batt on the Saturday afternoon 4 days prior to moving for Alex. Vic B. got his commission just before we left Serapeum. I have got one stripe up and am getting two. Got the first one at Tel-el-Kebir and was informed about the other a few days ago. The second one has not yet been gazetted.\n\n"}}