{"Document Name":{"0":"Diary_0378","1":"Diary_0378","2":"Diary_0378","3":"Diary_0378","4":"Diary_0378","5":"Diary_0378","6":"Diary_0378","7":"Diary_0378","8":"Diary_0378","9":"Diary_0378","10":"Diary_0378","11":"Diary_0378","12":"Diary_0378","13":"Diary_0378","14":"Diary_0378","15":"Diary_0378","16":"Diary_0378","17":"Diary_0378","18":"Diary_0378","19":"Diary_0378","20":"Diary_0378","21":"Diary_0378","22":"Diary_0378","23":"Diary_0378","24":"Diary_0378","25":"Diary_0378","26":"Diary_0378","27":"Diary_0378","28":"Diary_0378","29":"Diary_0378","30":"Diary_0378","31":"Diary_0378","32":"Diary_0378","33":"Diary_0378","34":"Diary_0378","35":"Diary_0378","36":"Diary_0378","37":"Diary_0378","38":"Diary_0378","39":"Diary_0378","40":"Diary_0378","41":"Diary_0378","42":"Diary_0378","43":"Diary_0378","44":"Diary_0378","45":"Diary_0378","46":"Diary_0378","47":"Diary_0378","48":"Diary_0378","49":"Diary_0378","50":"Diary_0378","51":"Diary_0378","52":"Diary_0378","53":"Diary_0378","54":"Diary_0378","55":"Diary_0378","56":"Diary_0378","57":"Diary_0378","58":"Diary_0378","59":"Diary_0378","60":"Diary_0378","61":"Diary_0378","62":"Diary_0378","63":"Diary_0378","64":"Diary_0378","65":"Diary_0378","66":"Diary_0378","67":"Diary_0378","68":"Diary_0378","69":"Diary_0378","70":"Diary_0378","71":"Diary_0378","72":"Diary_0378","73":"Diary_0378","74":"Diary_0378","75":"Diary_0378","76":"Diary_0378","77":"Diary_0378","78":"Diary_0378","79":"Diary_0378","80":"Diary_0378","81":"Diary_0378","82":"Diary_0378","83":"Diary_0378","84":"Diary_0378","85":"Diary_0378","86":"Diary_0378","87":"Diary_0378","88":"Diary_0378","89":"Diary_0378","90":"Diary_0378","91":"Diary_0378","92":"Diary_0378","93":"Diary_0378","94":"Diary_0378","95":"Diary_0378","96":"Diary_0378","97":"Diary_0378","98":"Diary_0378","99":"Diary_0378","100":"Diary_0378"},"Date":{"0":"unknown","1":361.0,"2":366.0,"3":373.0,"4":374.0,"5":375.0,"6":379.0,"7":381.0,"8":382.0,"9":383.0,"10":384.0,"11":385.0,"12":386.0,"13":388.0,"14":389.0,"15":391.0,"16":393.0,"17":394.0,"18":395.0,"19":398.0,"20":399.0,"21":400.0,"22":401.0,"23":402.0,"24":403.0,"25":404.0,"26":405.0,"27":406.0,"28":407.0,"29":408.0,"30":409.0,"31":411.0,"32":412.0,"33":413.0,"34":414.0,"35":415.0,"36":416.0,"37":417.0,"38":418.0,"39":419.0,"40":420.0,"41":421.0,"42":424.0,"43":425.0,"44":426.0,"45":427.0,"46":428.0,"47":429.0,"48":431.0,"49":434.0,"50":435.0,"51":436.0,"52":437.0,"53":438.0,"54":439.0,"55":440.0,"56":441.0,"57":442.0,"58":443.0,"59":444.0,"60":445.0,"61":446.0,"62":447.0,"63":448.0,"64":449.0,"65":450.0,"66":451.0,"67":452.0,"68":453.0,"69":454.0,"70":455.0,"71":456.0,"72":457.0,"73":458.0,"74":459.0,"75":460.0,"76":461.0,"77":462.0,"78":465.0,"79":466.0,"80":467.0,"81":468.0,"82":469.0,"83":474.0,"84":475.0,"85":476.0,"86":477.0,"87":478.0,"88":479.0,"89":480.0,"90":481.0,"91":482.0,"92":483.0,"93":484.0,"94":485.0,"95":486.0,"96":487.0,"97":488.0,"98":489.0,"99":490.0,"100":491.0},"Entry":{"0":"\n\n","1":" Left Broadmeadows enroute for Albany per S.S. Thermistocles.\n","2":" Arrived at Albany\n","3":" pulled out this morning. on sentry go rotten job\n","4":" Still on guard will be relieved soon. I hope the boys played merry hell last night. sports this morning our Co donkey kicked at tugowar. funeral tonight chap from one of the other boats.\n","5":" still going good weather beginning to get warm. \n","6":" heavy rain, was inoculated this evening the second time\\9 rainy & windy\n","7":" another funeral\n","8":" Our Co on sentry go again escaped myself & am a sweeper for the day which is a good job there being nothing to do.\n","9":" Our Bos’n pegged out today. he was a good old sport.\n","10":" Colombo at last. hundreds of the lads from all the ships went ashore with out leave\n","11":" another funeral two of our own chaps this time.\n","12":" The fleet got under way again all the miscreants having been brought on board their various ships their fines vary from £2\/10 to £9 so their trip ashore was expensive\n","13":" Steaming along Indian Coast\n","14":" Another General in this ship. are now in Arabian sea.\n","15":" funeral at 3pm on this ship\n","16":" Go on sentry duty funeral this ship\n","17":" Arrived at Aden 11.30am pull out 6pm\n","18":" In the Red sea passed Hells Gates & are now drawing abreast of 12 apostles. \n\n Have been mess orderly during these days\n\nhave not been well\n\nHave been in hospital the last three days\n","19":" Arrived at Suex are lying too.\n","20":" have been travelling along the canal all day but have come to anchor again tonight\n","21":" Anchored at Ismailla or some such place on one of the bitter lakes\n\nJan \n","22":" Port said are lying to \nboats not allowed to come alongside.\nCanal guarded by Indian New Zealand & territorial troops\n\nGood advice read out to us regarding certain diseases Nice subject at tea time.\nA French aeroplane flew over us low down two or three times this evening.\n","23":" We left Port Said some time last night and are making for Alexandria none of the ships are in sight.\nAlexandria 2.40 are being towed to moorings.\n\n1st great preparations for disembarking.\n\nCamped at El Abbasia between 7 & 10 miles from Cairo.\n","24":" Disembarked at 10 oclock entrained for Cairo\n\narrived at camp ¼ past 6pm \n","25":" wandered about Barracks looking for something to eat\n\nfatigue work in the evening\n","26":" did some drill with packs up\n\nhad a look around in Cairo. came back an hour late am now under open arrest to appear at orderly room if called on to do so.\n","27":" tent orderly \n","28":" Chap found by the Terriers to-day with his throat cut. Thought to be one of the New Zealanders from this camp\n\nunloading horses this evening a great game\n","29":" Went over to Heliopolis for a walk about.\n","30":" doing fatigue work this morning, stacking kit bags belonging to the 7 & 8 Bats.\n","31":" from Abbassia to Mena to join the Battn.\n","32":" Waiting to be Medically Tested. explored the interior of the great pyramid.\n","33":" pronounced medically fit\n\nClimbed to the top of the pyramid.\n\nlooked through the temple of the Sphinx & the tomb of the Iman of the Pharaohs who built the second pyramids etc etc\n","34":" writing & fatigue work\n","35":" Climbed up the pyramid again.\n","36":" investigating etc\n","37":" on sentry go\n","38":" was vacinated\n","39":" writing letters\n","40":" went for walk on the flats among the palms\n","41":" to","42":" general leave but have no cash.\n\nHave got to go to work again medical inspection another holiday in fact.\n","43":" Run, shooting passed all right but did not get anything surprising.\n","44":" a holiday today got paid late went to Cairo\n","45":" route march at night\n","46":"\n","47":" outpost work \n","48":" The 3 Brigade has left camp to night destination unknown\n","49":" Battn field firing\n","50":" A. Co. on duty. have got the influ\n","51":" field firing at Tigers Tooth\n","52":" took down tents went out in the afternoon found \n","53":" Bivouac starting 2 oclock\n","54":" finish rotten failure\n","55":" Co doing div. guard\n\nhave a bad cold.\n","56":" am still crook\n\nBatt gone on a route march. beastly day enjoyed a warm bath\n","57":" Still unfit. batt went out but came back early\n","58":" Our chaps been digging trench working in the heat like the devil.\n\nwas to crook to help them so stayed in camp \n","59":" still no good\n","60":" Went out to look at the trenches but did not do any digging. we returned to camp early.\n\nThe Batt has occupied the trenches. 2nd Batt making attack some time in the night. did not go out myself as I considered myself unfit.\n","61":" holiday but did not go out.\n\nWent to the doctor this morning he told me I looked neat & respectable. I am wondering how to apply the compliment.\n","62":" Co mounted Div guard this evening; I prefered not to do picket.\n","63":" got snapped up for fatigue work but did not do much.\n","64":" had morning off filled up trenches in the evening.\n","65":" Brigade movement in the desert came back ½ past 2 \n","66":" Went to ciro on F.L. came back to late to mount guard.\n","67":" got pinched for picquet.\n","68":" shooting. Batt in route march in the morning\n","69":" went on church parade\n","70":" went digging trenches in the morning.\n","71":" another scheme for all night\n","72":" home for breakfast payed some tin\n","73":" another wretched scheme for the night am pretty sick of them\n","74":" all day doing nothing did it very well\n","75":" did nothing well till ½ past 6 in the evening then what & enjoyed another scheme returned to camp about 3am\n\n28\n\n24 did nothing all day\n\n25 Went out at 6pm for some more fun in the sand returned to camp at 3pm.\n","76":" went to town & had a walk through the bazaars\n\n27Went to the Mueseums\n","77":" brigades reviewed by gen E. H.\n","78":" inlying picquet field operations\n","79":"\n\nriot in cairo some shooting done by mounted terriers\n\n4 or 5 chaps shot or wounded. batt packing up. everything upside down.\n","80":" have orders to move at once. moved off 6 oclock marched to Cairo entrained to Alexandria, arrived about 5 on the","81":"\n","82":" on board the SS Minnewaska taking on horses everything horribly . A bit better, scored a fine dinner, & a corner in a horse pontoon , wherein to sleep\n\nHave been having a good time but can’t get plug tobacco\n","83":" left Alexandria\n","84":" making for the Dardanells\n","85":" tobacco very flush plug unatainable are lying to east Limnos Isle in Port Iadros (Mudros village)\n","86":" Coy out in the boats unfortunately I missed this out of position\n\nrain last night got badly wet heavy wind also.\n","87":" slept comfortably in the wheel house. went ashore with the Coy went through a village had dinner ashore\n","88":" pontoons swung overboard. \n","89":" everybody going ashore caught for guard at the last moment.\n","90":" went ashore with . had a fine time & green hills and flowers are much better than sand\n","91":" several chaps went ashore & are now doing time\n\na quiet little bay shut out from the rest of the world by low & in some places rugh green hills & connected to the outer sea by a narrow channel only & on its shores we can see five villages as old fashioned as the people that live in them. it was a treat to go ashore to walk through the farms if only to see the beautiful red poppies which grow so thickly among the wheat\n","92":" On a sentry job not to bad this time managed to score a cup of coffee in the officers quarters & early\n","93":" blowing half a gale. letters & paper soon Drill\n","94":" still blowing & very wet. am wondering where I shall sleep tonight. Hymettus went gracefully ashore also a tug.\n","95":" Still cold but rain has stopped.\n","96":" beautifully sunny today but unfortunately have to do pickett.. Takes 87 men to guard the ship. Ships are leaving fast our turn will come soon.\n","97":" Left port about 5 this morning. heavy wind blowing & pretty cold.\n\n \n\n24 are now laying in waiting for (what) on the opposite side of the island about 15 miles from our destination we will possibly land tomorrow morning \n","98":" The fun has started we are preparing to land firing commenced about ½ past four a wounded C. Sgt of 3rd Bgde has just been brought aboard. 3 casualities so far.\n\nIts now about 9 oclock we have landed & one or two of our Co have burned bits of shell. The 3rd Bgde has done well so far clearing the ridge behind us or at least in front of us I hear the 12 bat had a very hot welcome. The hills are low but very steep and broken, a gun boat close in to us has fired a good of metal at a fort or Battery which has succeed in getting two or 3 shells close to us they have a nasty visious hiss I have seen several wounded chaps they seem pretty jolly on the strength of it\n","99":" We had a splendid day yesterday with as much shrapnel as we could wish for its beastly stuff a knocked a lot of our chaps over our own guns were not landed save one mountain Battery which did not last long, things may be different today the gun boats have\n\nbeen talking some, & Queen Lizzie has been hurling her ton weight missles over our heads the row she makes is something like an overgrown thunder clap our chaps are banging away still no sleep last night one continual fusilade. I myself have seen no one to fire at, we are handicapped with heavy scrub, it makes splendid cover for snipers got a bit of a grueling this evening.\n","100":" are pretty comfortably dug in the guns as well as we as far as we can judge have been giving the turk particular hell –\n\n"}}