{"Document Name":{"0":"Diary_0056","1":"Diary_0056","2":"Diary_0056","3":"Diary_0056","4":"Diary_0056","5":"Diary_0056","6":"Diary_0056","7":"Diary_0056","8":"Diary_0056","9":"Diary_0056","10":"Diary_0056","11":"Diary_0056","12":"Diary_0056","13":"Diary_0056","14":"Diary_0056","15":"Diary_0056","16":"Diary_0056","17":"Diary_0056","18":"Diary_0056","19":"Diary_0056","20":"Diary_0056","21":"Diary_0056","22":"Diary_0056","23":"Diary_0056","24":"Diary_0056","25":"Diary_0056","26":"Diary_0056","27":"Diary_0056","28":"Diary_0056","29":"Diary_0056","30":"Diary_0056","31":"Diary_0056","32":"Diary_0056","33":"Diary_0056","34":"Diary_0056","35":"Diary_0056","36":"Diary_0056","37":"Diary_0056","38":"Diary_0056","39":"Diary_0056","40":"Diary_0056","41":"Diary_0056","42":"Diary_0056","43":"Diary_0056","44":"Diary_0056","45":"Diary_0056","46":"Diary_0056","47":"Diary_0056","48":"Diary_0056","49":"Diary_0056","50":"Diary_0056","51":"Diary_0056","52":"Diary_0056","53":"Diary_0056","54":"Diary_0056","55":"Diary_0056","56":"Diary_0056","57":"Diary_0056","58":"Diary_0056","59":"Diary_0056","60":"Diary_0056","61":"Diary_0056","62":"Diary_0056","63":"Diary_0056","64":"Diary_0056","65":"Diary_0056","66":"Diary_0056","67":"Diary_0056","68":"Diary_0056","69":"Diary_0056","70":"Diary_0056","71":"Diary_0056","72":"Diary_0056","73":"Diary_0056","74":"Diary_0056","75":"Diary_0056","76":"Diary_0056","77":"Diary_0056","78":"Diary_0056","79":"Diary_0056","80":"Diary_0056","81":"Diary_0056","82":"Diary_0056","83":"Diary_0056","84":"Diary_0056","85":"Diary_0056","86":"Diary_0056","87":"Diary_0056","88":"Diary_0056","89":"Diary_0056","90":"Diary_0056","91":"Diary_0056","92":"Diary_0056","93":"Diary_0056","94":"Diary_0056","95":"Diary_0056","96":"Diary_0056","97":"Diary_0056","98":"Diary_0056","99":"Diary_0056","100":"Diary_0056","101":"Diary_0056","102":"Diary_0056","103":"Diary_0056","104":"Diary_0056","105":"Diary_0056","106":"Diary_0056","107":"Diary_0056","108":"Diary_0056","109":"Diary_0056","110":"Diary_0056","111":"Diary_0056","112":"Diary_0056","113":"Diary_0056","114":"Diary_0056","115":"Diary_0056","116":"Diary_0056","117":"Diary_0056","118":"Diary_0056","119":"Diary_0056","120":"Diary_0056","121":"Diary_0056","122":"Diary_0056"},"Date":{"0":"unknown","1":545.0,"2":548.0,"3":553.0,"4":555.0,"5":556.0,"6":559.0,"7":564.0,"8":566.0,"9":567.0,"10":568.0,"11":569.0,"12":570.0,"13":571.0,"14":572.0,"15":574.0,"16":575.0,"17":576.0,"18":577.0,"19":578.0,"20":579.0,"21":580.0,"22":581.0,"23":582.0,"24":583.0,"25":584.0,"26":585.0,"27":586.0,"28":587.0,"29":588.0,"30":589.0,"31":590.0,"32":591.0,"33":593.0,"34":594.0,"35":595.0,"36":596.0,"37":620.0,"38":715.0,"39":716.0,"40":745.0,"41":751.0,"42":936.0,"43":937.0,"44":938.0,"45":939.0,"46":940.0,"47":971.0,"48":972.0,"49":973.0,"50":974.0,"51":975.0,"52":976.0,"53":977.0,"54":978.0,"55":979.0,"56":980.0,"57":981.0,"58":982.0,"59":983.0,"60":985.0,"61":986.0,"62":987.0,"63":988.0,"64":990.0,"65":991.0,"66":992.0,"67":993.0,"68":994.0,"69":995.0,"70":997.0,"71":1004.0,"72":1008.0,"73":1012.0,"74":1031.0,"75":1034.0,"76":1035.0,"77":1036.0,"78":1038.0,"79":1039.0,"80":1040.0,"81":1042.0,"82":1043.0,"83":1044.0,"84":1045.0,"85":1046.0,"86":1047.0,"87":1049.0,"88":1050.0,"89":1053.0,"90":1054.0,"91":1055.0,"92":1056.0,"93":1057.0,"94":1059.0,"95":1061.0,"96":1062.0,"97":1065.0,"98":1066.0,"99":1068.0,"100":1069.0,"101":1074.0,"102":1076.0,"103":1077.0,"104":1080.0,"105":1085.0,"106":1086.0,"107":1088.0,"108":1089.0,"109":1092.0,"110":1093.0,"111":1094.0,"112":1095.0,"113":1096.0,"114":1097.0,"115":1098.0,"116":1099.0,"117":1104.0,"118":1105.0,"119":1106.0,"120":1107.0,"121":1108.0,"122":1109.0},"Entry":{"0":"\n\n","1":"\n\nLeft Ismailia by train at 4.30 PM. and reached Alexandria next morning at 1.30 AM. Went on board SS. Caledonia.\n","2":"\n\nLeft Alexandria.\n","3":"\n\nArrived at Malta stayed overnight left next morning escorted by a destroyer.\n","4":"\n\nArrived at Marseilles\n","5":"\n\nDisembarked entrained\n\nand \nwer\n moved off at 11 AM. Passed through beautiful country.\n","6":"\n\nArrived at Thiennes. All hands billeted. We were put in a barn. Plenty of food.\n","7":"\n\nAll hands paid. I was paid 35 Francs = to 25\/-\n","8":"\n\nLeft our billet. Bde moved off at 8.30. We passed through several large towns and\n\nfinally arrived at Estavies where our Bn. Was billeted in a large flour factory.\n","9":"\n\nLeft Estavies about 8 PM marched about two miles and again put up in a barn.\n","10":"\n\nW\n This morning I was warned by the C.O. to get my gear ready and go with four others of our Bn to Paris. An N.C.O. and four \n\nmen from each Bn who had been on the Peninsula have to go to Paris to represent their unit. This is a piece of luck for me.\n\nJuly \n12th\n 11th Cont.\n\nWe marched to Div. H. Qrs. From there we were taken in motor lorries to the station and put into a cattle waggon. The Journey was long and tedious. We passed through Hazebrouck and\n\nSaint Omer, finally arrived at Abbeville where we got off and marched to a camp which we reached about 3 o’clock \nam\n this morning.\n","11":"\n\nReveille 8.30 AM breakfast 9 Am. Tent cleaned up and inspected at 11.30 AM.\n","12":"\n\nYesterday afternoon a Sergt Major out of the Life Guards gave all the Australians \n\na brush up. He was some instructor. This morning we rose at 3.45 AM. had breakfast at 4.30 AM “fell in” \nand\n at 5.15 AM and left at 5.30 AM. The whole party numbering 600 in all consisted of Canadians, New Zealanders, Australians, Indians, Irish Guards, Coldstream Guards, Scots Kilties and Welshmen. We marched to the train and got wet through on the way.\n\nReached Paris. Marched to the Caserne Pepeniere Barracks. Crowds of people lined the streets.\n","13":"\n\nLeft barracks at 7 AM and marched to the Esplanade Des Invalides where all the allied troops were drawn up. From here the procession began headed by the Belgians and ended at the Place de La Republique. We got back to barracks about 1 PM. Leave was granted from 2.30 PM to 8 PM. An English lady showed several of us a few of the fine sights of Paris. Great British advance on the River Somme. Weighed 11s 7 \n","14":"\n\nLeave granted to all hands. I had a good stroll round Paris Streets. British still advancing.\n\nBritish enter German third line of defence. British Cavalry in action for the first time since 1914. No leave granted today. Great disappointment in barracks as we all have someone to see. Soldiers are lionised in Paris especially British soldiers on account of their good work on the Somme. We had a great march to the station. Thousands of people lined the street to see us off. They kissed us and hugged us all the way to the Railway Gates. Reached Abbeville Station next morning about 8.30 AM.\n\n","15":" Had a sleep. All the boys talking about their experiences in Paris. Left Abbeville again at 8.30 PM entrained and reached Steenwerk next day about 2.30 PM.\n","16":"\n\nAll detachments joined their units. I was glad to be back with the boys again, but I shall never \n\nforget gay Paree. The people are lovable. All the men are talking of their first experience in the firing line. Some of them got a rough time evidently. Expecting to make a big attack here shortly.\n","17":"\n\nOur artillery heavily shelled the enemy trenches about 6 PM our brigade charged the German trenches. Enemy shelling our trenches. Our casualties very heavy.\n","18":"\n\nWe had to \nwak\n retire onto our own trenches. The Brigadier very pleased with our work and says we are not to blame for the failure of the Division to hold the trenches. Our \nbo\n Bn relieved this morning. We came back to billet in the afternoon. Losses in the section \n5\n 3 killed 1 wounded 1 missing total 5 \nfour\n All N.C.O.s \nout of\n casualties. I am acting Section commander.\n","19":"\n\nWent out last night with R.S.M. Bramhall to bring in wounded. We got several poor fellows in. I got back to billet about 6.30 AM this morning.\n","20":" \n\nSlept well last night. All feeling stiff sore and tired. Colonel spoke very feelingly to us all yesterday afternoon. He thanked the Bn for their splendid behaviour first trial under fire\n","21":"\n\nWe left Bac St Maur about 10 PM and marched in single file to the town of Fleur Baix. Despite the fact that the Germans shell this town at occassionally civilians mostly women and old men and girls still live here. They go into the cellars when a shelling is on.\n","22":"\n\nFritz shelled the town this morning. Several houses where our men were \n\nbilleted were struck by shells killing and wounding severely several reinforcements. Our section on duty on the telephone.\n","23":"\n\nPaid today. I received 60 francs. Very dull weather lately.\n","24":"\n\nVery dull weather. The sun has scarcely showed himself since our arrival here Village of Pozieres has been captured by Australians on the Somme. also two guns. \n","25":"\n\nA committee formed of officers of this Bn has been appointed to enquire into the loss of signalling gear of this Bde. We had an enquiry over ours \nBen\n today and I as senior soldier in the section and in the absence of responsible NCOs had to make a statement concerning our loss or destroyed sig gear.\n","26":"\n\nSun condescended to shine today. Fritz fired some heavy shells over the village today. They all fell close to the old church and one hit fair on it.\n","27":"\n\nEnemy bombarded the church tower and billets today with the result that the church tower was destroyed and set alight and many houses wrecked & burning. Our batteries replied.\n","28":"\n\nGave a plan of our company telephone lines to BDE today. Only one Company line in use at present.\n","29":"\n\nLovely day. One of our little section gone to hospital. About 10PM gas alarm was sounded. We put our gas helmets on for a while till GAS OFF was passed along street\n\nThe sentries on duty in the streets have to bang shell cases and the doors of the people to make sure everybody knows of the approach of gas. It turned out that the New Zealanders put gas across to Fritz.\n","30":"\n\nVery quiet day. Warm, but a cool breeze blowing. A good deal of bombing going on during day time in trenches. At \nlar\n night our batteries got busy down towards Armenters.\n","31":"\n\nLovely day. Expect to go away again for a month to a School of instruction for N.C.O.s and officers. Some dissatisfaction in the section as to the prospect of \nsome our p away\n having a man out of another Bn to take charge of the section while I am away.\n","32":"\n\nFine day. Our aeroplanes very active. The germans get terribly annoyed with them (there is nearly always a half a dozen up) and they fire their antiaircraft guns at them nearly all day.\n","33":"\n\nEverything ready to move back to the trenches. We are to relieve the 56th Bn who will then take over our billets here in Fleurbaix. The Bn left Fleurbaix for the trenches about 9.30 PM. I saw the boys off and then got my gear and went off myself in the opposite direction I slept at the QMasters.\n","34":"\n\nToday is the anniversary of the Lone Pine charge of\n\nthe","35":" Bde. It is also the anniversary of a good many other things. What a difference in surroundings then and now. Here am I in a comfortable French train travelling through beautiful France on my way to an imperial school of instruction for one month.\n","36":"\n\nWe reached Cassel station about 1.30 PM yesterday and then walked to the school a distance of about 2 ½ kilo. We were told off to a room in a large white house. The house is built on old fashioned lines. A moat runs almost right around it. It is three stories high with large rooms. A good view can be otained from its upper windows. There are no verandahs on these houses even the most modern built houses are built minus a verandah \nand\n giving them a most forbidding aspect. Yesterday we were sorted out into various classes ranging from","37":" and \n","38":" and","39":" class. Most of us were put in","40":" class. We did a bit of flag wagging had a couple of lectures but learnt nothing So much for the first day. After school hours we went for a stroll (a couple of us) through the village of Zurftpeene \n","41":" ","42":"\n August\n\nDid a bit of flag work again and \na\n had a short simple lecture about electricity.\n","43":" ","44":"\n August\n\nFine day. We were taken per motor lorry into Hazebrouck to one of the hospitals where change of clean clothing was given us and we had a hot bath. We got back to school about 2.30 PM. Did a bit of compass work till 5 P.M. I had to lead a few men to a certain spot per compass. I struck a hedge \n\nand had to stop. I found out since that I was \nonly\n about 2.70 out in my reckoning\n","45":" ","46":"\n August \n\nWe had a test this morning in reading the Morse and Semaphore flags at 8 words a minute. We also had a test at reading the flappers which was sent at a speed of about 4 words a minute. In the afternoon we had some practice in setting up the heliograph and aligning it on an object. A division of Canadian Troops passed the school on their way to the Somme. They came from the Ypres Salient. A cinematograph show was given in the recreation room at \na\n night starting at 9PM.\n","47":"\n\nAll full corporals were instructed to take \nphy\n a couple of men to a spot \n\npointed out to them and do station work. I being a full corporal had a party under my tender command. We did an awful lot of work. We sent one message. As the sun would not come on out we could not use the heligraph. We received CI and got back to school as soon as possible.\n","48":"\n\nFine day. Rifle inspection Church parade for Coy England only. No leave allowed till 1 P.m. As I and several others had an appointment for dinner we were mad at having to stay in like a lot of school children.\n","49":"\n\nA little helio practise this morning and “small flag” work this afternoon. I visited \nvisited\n a French chateau with a Canadian friend named Tim Auger. As he speaks French fluently\n\nwe had no difficulty in getting something to eat.\n","50":"\n\nOur Class Sergeant (French by name) has made himself very disagreeable by “bawling out” anyone who does not do exactly as he is told.\n","51":"\n\nWe have been placed under another Sergt a class further up. He is a very decent chap and a good instructor. We did a little compass work and some more flag work under the idiotic French\n","52":"\n\nMy Canadian friend and I went up to the \" _\" chateau again after tea and I milked a cow which amused the people greatly.\n","53":"\n\nWe are \n Dull weather.\n\n \n","54":"\n\nWe had another reading test yesterday. Morse flag \nhelio\n Semaphore and flapper. We also had a buzzer test reading and sending. Concert held in the recreation room. \n","55":"\n\nLamp reading test at 9 P.M.\n","56":"\n\nCpl Auger a French Canadian Jack Willington Bombadier Colman and myself went for a walk to the town of Arneke about 6 kilometres away. We had our photos taken and walked back along the railway line.\n","57":"\n\nMajority of the chaps who were in 2nd class last week were put into","58":" Class this week. I have passed all the tests so far and am now going to \n\ntry to pass the Assistant Instructor examination. We have two good instructors Sgt Davis and Sgt Weston. Weston was formerly Signal Sgt in the","59":" Lancers. Weather has been dull and showery.\n","60":"\n\nShowery weather. We \nare\n commenced our (AI) assistant instructor exam.\n","61":"\n\nWe finished our reading and \nseld\n sending test and heliograph setting yesterday.\n","62":" We had lamp reading last night. I am confident of passing.\n","63":"\n\nI have successfully passed to AI test. This is my last week here. I shall be very glad to get back to the Bn again. Rumania declares war on Austria. First shots exchanged at \n\nRohen Turn pass. The best of Rumania’s statement is declaring war on the central powers as follows “The Rumanian population is exposed to risks of war invasion. By forming the Allies she can shorten the World War and effectually attain her national aspirations by forming the only \n“group of powers”\n that can help her in \nthis”\n","64":"\n\nA good deal of rain has fallen and seems inclined to keep on falling. We are having a very easy time now. Sgt Tillin who is now in charge of us is a real sport. He was a signal Sgt in the","65":" Dragoons and took part in the retreat from Mons.\n","66":"\n\nWe had 98 letters to send today \non\n in 3 1\/3 minutes on the large flag. It was very \nto\n stiff work. We also had 20 questions to answer in our A1 paper.\n","67":"\n\nWe did station work today (or were supposed to) to finish up our course. I went about 10 miles out near Fort Rouge with another chap. We didn’t do a tap all day as there was no sun and we were too far away to be seen with the flags. It was the first time I have been on a station and did not succeed in getting communication.\n","68":"\n\nWe left School of Instruction today reached Cassell Station about 8 AM got aboard and reached Hazelbrouck about 9 AM. Billeted all day got on train again 6.30 PM and reached Steinwerck about 7.30 PM from here we went to Bac St Maur by omnibus. I joined the Bn about 8.30 PM at Fleur Baix where they are billeted. \n","69":"\n\nRead a pile of letters which had been waiting for me and made another will in favour of my sister Flo.\n","70":"\n\nWent into the Fleur Baix front trenches and relieved the 56th Bn. Telephone lines in a bad mess.\n","71":"\n\nTwo more of our Sigs went into a Divisional Signalling School a few days ago. I have been busy with another sig. all this week getting our lines (telephone) into some order. The bde sigs have been busy also putting in buried lines and causing trouble incidentally in our old lines. Lines are a blessed nuisance when they go wrong. Our guys are very active this afternoon. They opened up on Fritz’s trenches and he replied with all sorts of\n\nbombs, minnewerfers and pine apples mostly and just a couple of guns.\n","72":"\n\nThe night before last about 60 men from the 56th Bn raided the hun’s trenches after a short but furious bombardment from our mortars and guns. When they reached the trenches they found them empty with the exception of a few curios they brought nothing back. The other Bde raiders were more fortunate and were able to bring back some prisoners. The Scotties also had a successful raid. We worry the hun all the time and get no retaliation except a few minnewerfers and pineapple bombs. Our telephone lines are in good order just now but a Ninny made a mess of them last night. \n","73":"\n\nThe Bn was relieved by the 56h Bn this evening. Their signallers took over the H.Q. signal office at P.M. at WYE FARM and we took over our previous dug-out in Fleurbaix. One of our aeroplanes flew very low over the german lines and dropped bombs, the enemy anti aircraft guns bombarding him furiously all the while. He is a very daring aviator.\n","74":"\n\nWe relieved the 56th Bn again in the same position at WYE FARM.\n","75":"\n\nOur Bn. had a raid on Fritz’s trenches \nle\n tonight but got no prisoners. Two of our H.Q Sigs. (Wheem M C and O’Brien) went out \n\nwith the reel and phone with them but could not get through to us as their line was broken just outside the sally port. They both got back safely but minus the phone and reel. We had about 10 casualties one man being killed in our trenches and one officer of the raiding party wounded in the \nte\n mouth and knee by one of our own bombs six teeth being knocked out. Lieut Judd was in charge of the raiding party. A number of germans were killed by our bombardment.\n","76":" \n\nWe have been relieved by the N.Zealanders our \nb\n Bn are nearly all out now. \n","77":"\n\nAfter a tedious march from Ballieul (where motor lorries brought the Bn from Bac St Maur) we reached a place nowhere in particular but somewhere near Dolieu and billeted in a barn for the night in Outersteen.\n","78":"\n\nThe boys have been having a weary time since our arrival here at Outersteen. We have a Sig Officer now named Lieut Morris M.C.\n","79":"\n\nLeft Outersteen at 8.15 PM entrained and reached Pont de Remy stn after a miserable train journey after waiting in the rain for about an hour we moved off.\n\nWe marched through the town about 12.30 AM to just outside \nwe\n the town we had to march up a hill about a ½ mile in length. Our packs were very heavy \non\n when we reached the top. The road was hard but muddy. We reached Bellancourt about 1.30 AM and after messing about in the rain for about an hour we were told off to our billet \nwer\n where we soon made ourselves comfortable and got to sleep. \n","80":"\n\nMyself and three others from the section walked into Ailly about 5 miles from Bellancourt and got four bikes and rode back to the Bn. We were caught in a very heavy and cold storm blowing from the north but did not get very wet as we had our waterproof cycle capes on.\n","81":" ","82":"\n\nAfter a cold journey from Ailly in motor transport of about 50 kilometres we were deposited just outside ","83":"\n Fricourt. From here the roads were pretty muddy and we straggled up a long hill pushing our bikes until we could push them no further so the four of us camped in some disused dugouts for the night. This morning the roads were fairly smooth again as the wind had frozen hard through the night and the heavy wagons had crushed it down. We are about 1 ½ miles to the right of Mainetz Wood. The guns down here are roaring the whole time.\n","84":"\n","85":"\n\nAfter being in muddy support for a couple of wet day with no dug-outs to sleep in and scarcely any thing to \n\n \n\nwe got word that we were to move into the trenches to relieve the 53rd Bn.\n","86":"\n\nFritz shelled our area fairly heavily with high explosive shells but did practically no harm. We moved into the trenches this afternoon after struggling along muddy saps for about 1 ½ miles. Our H.Q. is in a fairly big german dug out. The germans are excellent dug out makers.\n","87":"\n\nWe were relieved from the front line trenches \nat the front line trenches\n 57th Bn about 7 PM on the","88":" Our casualties were extremely light. We came right out to the rest camp about 6 miles back from the front line. We had a terrible job struggling through the mud and in and out \n\n \n\nof shell holes which are everywhere. Almost every yard of the conquered territory has been ploughed and \nrf\n furrowed by shell fire. Equipment ammunition shells of all sizes are to be seen everywhere littered about in the greatest confusion. Many dead are still lying \nund\n unburied mostly Fritz’s. Our guns worry Fritz incessantly. The weather is wretched for fighting now. Mud and nothing else but mud is to be seen everywhere. The wind is bitterly cold blowing mainly from the N.E. with stinging \nshowerig\n showers. Our food supply is not too bad considering the difficulties of Transport.\n","89":"\n\nWent back to the trenches again and relieved the 56th Bn. Our Bn did not go into the \ntrenches\n front line \n\nWed.- ","90":"\n","91":"\n\nOur guns worrying Fritz. They give him absolutely no peace. The weather is rotten to say the least of it. Nothing but mud everywhere. Many men are going to hospital with trench feet. \n\nOur section had some narrow escapes from Fritz’s high explosive shells. We get a gleam of sunshine now and again down here on the Somme.\n","92":"\n\nWe left the trenches again last night. The","93":" Div. relieved us. Our aeroplanes were extremely active yesterday. We watched some wonderful manoeuvring in the air also a couple of air duels! Our aeroplanes do not seem to be able to catch Fritz as far as speed is concerned.\n\n \n","94":"\n\nWe arrived here at Ribemont yesterday per boot sore footed and utterly tired out. We were allotted to our billet a very drafty one but with comfortable bunks made out of \nof\n wire netting. This morning we awoke feeling jolly sore and stiff after our hard Somme experience. The French have retaken Fort Vaux without a casualty. The Italians are still tuning up the Austrians in the Carso region. The sun managed to glimmer through the low hanging clouds today, but it is still very \nc\n chilly.\n","95":"\n\nWe left Ribemont on the","96":" and went to Rainneville by French motor bus. The people were very hard in this town. We had a job to buy even a \n\na packet of biscuits. Most of the boys are roaring because they cannot buy a drink. It is certainly a bad state of affairs after our experiences on the Somme. Yesterday passes arrived at Bn Head quarters for myself and another old hand to go on leave to England. We walked to Bertrangles and after a wait of 3 hours in the cold we got a train to Amiens. German aeroplanes raided the town 5 times whilst we were there and dropped bombs galore.\n\nA lot of amusement and annoyance was caused by these confounded raiders. We tried three times to get something to eat at the YMCA and as soon as we got inside the building our anti aircraft guns would start to \n\nfire and the caretaker would order every man down to the station again under the bomb proof bridge. The Frenchies were laughing a treat at us which made matters worse.\n","97":"\n\nReached Southampton about 7.30 AM this morning and went straight aboard a train which was waiting to take the leave party. Went to Horseferry Road and got a new change of clothes from here I went to the Shaftesbury Hotel.\n","98":"\n\nWent to Perham Downs near Salisbury plains to see a friend who had married an English girl but found he had left. Returning in a disgusted and miserable frame of \n\nmind I met some Australian people who took me home and made me stay the night. Next day I went back to the hotel & brought all my gear down \nand\n as I was kindly asked to stay there during my leave. Pleased at finding somebody sympathetic and someone who understood Australians I readily agreed. The people I am with are a splendid type of \nt\n Australian. Very hospitable & kind to anyone in a fix. The daughter whose fiancée is in France \ntakes\n has volunteered to take me all round and see the sights. I have had a look inside the National Art Gallery & the pictures are indeed fine.\n","99":"\n\nWe went for a \nbu\n ride on top of a bus to see London and it was fine. The weather was a trifle cold. One thing very noticeable over here is. The colder the weather is the rosier the girl’s and children’s cheeks become. I have a fine room and a bed fit for the gods to sleep in My breakfast is brought up to me in bed if I require it. I have a rather rotten cold and I am being looked after like an only son.\n","100":"\n\nWent to the Coliseum Theatre and saw Charles Hawtrey three clever children a wonderful organ and its player the music being glorious\n\nand Gertrude Elliot and other distinguished artistes.\n","101":"\n\nMrs Duvas & Miss Cummings the people with whom I have been staying at Hendon just outside London saw me off \nat\n to the train. Their kindness to me I shall never forget. It was like home. It’s rotten leaving to go back to the mud & hell again. However, I shall be alright when I get back with the boys again. I saw some splendid plays during my leave. The Bing Boys and High Jinks being lovely. I saw George Robert and several other accomplished and clever artists \non\n \n\n \n\nin Bing Boys. Yesterday I went to the Tower of London and saw many interesting old things. The execution block. The armoury. Wakefield Tower etc It is splendid buildings. I have seen the Admiralty buildings Houses of Parliament Buckingham Palace. The Law Courts & many other fine old buildings. I had a splendid time but it passed all too quickly. Am taking some \nser\n paper serviettes back to the boys and a couple of mouth organs as a bit of music always cheers us up. \n\nLondon has been very foggy. We had snow one day and rain most of the time, But as we usually travelled by tube or inside an omnibus we did not notice it very much. The shops in London are lovely. The goods being so tastefully arranged in the windows, did a fair amount of shopping at Selfridges one of the biggest universal providers in the world. The tramway system in London does not come up to the Sydney one but the bus service is very good. Well I am leaving it all behind. I shall always remember the comfy bed. I had breakfast in bed nearly every morning.\n","102":"\n\nA bright fine morning but chilly. We were wakened this morning at 2.30 AM, marched to the pier again and after waiting about 4 hours go aboard a train which had just brought in some other poor chaps to go on leave to dear old Blighty. Last night I went down to the YMCA to see if I could liven up a bit & heard a very interesting lecture on New Guinea by a missionary who spent 8 years in a native town there with his wife the only white companion during all this time. It must be very rough in the channel now as a good breeze is blowing and making large waves in the harbour on which the sea gulls float, glorying in it\n\nWhat a pity we cannot have the Australian weather over here. London would be paradise indeed then with plenty of sunshine.\n\n1.30 P.M.\n\nWe have reached Rouen after a tedious journey. These French engine drivers have a habit of stopping about half way inside \na\n every tunnel & as we have no lamp alight in the carriage & no room to sleep it is a dirty trick, very dark deed \nindeed\n in fact. Nearly all the way we have been crawling along stopping nearly every quarter of an hour for no apparent reason whatever now & then we do a sprint & \nthe\n then the ghostly yell of kiddies calling for bully beef can be heard. All the chaps in the carriage are Tommies \n\nexcept myself & fine jolly chaps they are too. A fellow cannot be downhearted for long in their society. One thing I must record about the English people \na\n they are very generous. Whenever a call is made on their purses for anything which is going to help the soldiers at the front they always respond magnificiently. I was in one of the London Theatres & Charles Hawtrey auctioned a \nbr\n box to raise money for the soldier’s Xmas pudding fund. He started off at 5 guineas & reached 50 guineas. A lady was the donor. This was splendid & is only one of hundreds of charitable incidents.\n","103":"\n\nGot back to Bn about 2.30 P.M. found the boys just having dinner. They have not been in the trenches since I left. We are living in huts. The food supply is \nne\n not the best by a long shot. My appetite has returned too worse luck. The weather is very cold.\n","104":"\n\nThe boys in the trenches must be having a bad time \nin the trenches\n now. It is bitterly cold on the feet. It is almost impossible to keep them warm night or day. I expect there will be a lot of poor fellows going away with frost bite or trench foot. Our guns do not cease firing. The germans must be living in a perfect hell. \n","105":"\n\nWe left the Maimetz Huts on the","106":" & came up here. We found these huts in a filthy condition. The name of this camp is Adelaide not far from Montaubau \nw\n. The camp is situated on hill in a sea of mud. The huts are all cleaned up again. We always leave our billets clean, but we seldom find a clean one when entering. We have been out of telephone communication with brigade during our stay here. Runners have had to do the work. The weather is that monotonously cold that it is not worth mentioning. It is about time the sun took a tumble to himself. But that would never do what would Xmas be in Europe without snow. Well I hope Fritz is suffering twice as much but \n\nstrikes me when we can stand it he ought to be able to. Anyway we are winning so they say and they ought to know. \n","107":"\n\nWe came into these trenches on the","108":" We have been fortunate so far in that it has not rained. It has been fairly cold though. The men have pretty good dugouts though this being an old Fritz position. We have had a lot of trouble with our ration parties again. They always seem to get lost or something. They will be wandering over to Fritz’s line one of these nights. Fritz fires a good deal here mainly high explosive shrapnel. There is plenty of open ground for it to burst in though. Casualties have been \n\nextremely light in this position so far. We are not in the front line though. We are in supports to the 55th Bn. Had a welcome little mail yesterday including a couple of letters from England. War news has been very scarce lately. We hear practically nothing unless we happen to be able to buy an English newspaper.\n\nWe are a little to the left of our last position on the somme. We are between Les Beufs on our right and Flers on our left. Delville Wood is directly behind us. It must have been a Devil of a Wood right enough. Large trees are blown to smithereens & the ground is ploughed up yard by yard.\n","109":"\n\nWe relieved the 55th Bn from the front line last Friday. We found the telephone communication fairly good what there was of it. Only one line what is known as a ladder line ran to the centre coy. in the front line. Accordingly a few men from the section our signal \nOfficer\n Officer & myself started out the next night to lay a new line to the company on our right. It was hard work dragging our selves through the mud & the rain. & weight of cable did not help matters. Enemy shelling was constant but scattered. We got the line through & all hands got back safely. About \ntn\n 3.30 AM on ","110":"\n Saturday morning this line was\n\n \n\nbroken very badly at that by shell fire. On ","111":" night Saturday","112":" night three men & myself started out with about ¾ mile of DIT cable to find the trouble & mend it. About half way between H.Q. & the front line we found the cable smashed to smithereens. We found one broken end to the line on the drum & started off to run an earth return line to the firing line. We accomplished this & got back safely once more. During our stunts the other line was patrolled nightly by two others of the section & their job was no less risky. “Last night was a beautiful moonlight night too”. Now after all our trouble \non\n both lines are ‘out’ again. It would send a man grey headed in no time.\n","113":"\n\nOur chaps went out on the lines again last night. Thank goodness this is the last night for a while anyway. They fixed up communication once again & for a wonder all lines are holding. This morning I went out side & found the snow falling very fast in large flakes. The ground everywhere white & even walking about showed up very plainly. Everybody has grown a beard or a moustache & as very few brought towels & the water being frozen almost every morning most of us could do with a good wash, to say nothing of a clean change of clothing.\n","114":"\n\nWe handed everything over to the 56th Bn in good order. They were pleased at being able to speak so plainly to the companies in the front line. Their luck was out however, as I believe the line on the right was broken soon after we left. We put in a rotten night that night trying to get some sleep in dugouts which were in reality waterholes I lost my boots and puttees & so did several others and didn’t the Q.M.S. roar when I told him. He gave me a new pair though. We picked up our packs again at Bernafay camp and came on to Montaubau huts where we soon got a fire going & made ourselves comfortable.\n","115":"\n\nThe Col. inspected all huts at 11 AM this morning. He gave us a cheery little lecture enquired how we all felt & passed on.\n","116":"\n\nWe came back here to Switch trench again yesterday. The coming was not quite so bad as before as the engineers had laid duckboards through the mud to walk on, It snowed a little the day before yesterday at Adelaide camp Montaubau where we were camped in huts. The sun tries very hard to burst through the thick clouds and mist. He looks so cheery & bright when he succeeds. I received some Xmas cards a few days ago. They are so disappointing too as they contain absolutely no news. A good long\n\nletter would be much more welcome. We have great hopes of being out of the trenches for Xmas. During the last couple of months I have written letters home & to different friends & it never even occurred to me to wish them a Merry Xmas or a happy New Year. However, I expect my letters will be none the less welcome. \n","117":"\n\nWe came forward again last night & relieved the 53rd Bn. The ground was firm & lovely to walk on. It had snowed the previous afternoon and it still lay on the ground everywhere. The sun shone for a little while but there was no heat in him. We are just waiting for the relieving Division chaps to come along & take over. We are to be out for a long time then so we are looking forward \n\nto a lovely Xmas as the boys will get their mail & their parcels to say nothing of the “plonk” (Rum) & beer & wine which I can see even now flowing freely. It has been rotten here on the Somme to say the least of it & we shall be very glad when we are out of it.\n","118":"\n\nWe were relieved from the trenches on 21st by the","119":" Bn","120":" Div. Stayed the night at Bernafay Huts and entrained next morning in open trucks. We got out at Meaulte & marched to Blurre in all the glory of steel helmets sheep skin jackets & mud from head to heel. A large number of parcels were given out I received a Xmas parcel from my friends in England.\n\nThe weather today is warm at least I should say the atmosphere is. The sky is clouded & the sun bursts out for a second brightening everything up then disappears behind the ruthless scud.\n","121":" \n","122":"\n\nPlenty of food puddings cakes sweets etc. plenty of champagne plenty of men “stunned’ everybody happy and nothing interesting to write about.\n\nHere endeth the last chapter of the old year.\n\nGood luck for the New.\n\n"}}