{"Document Name":{"0":"Diary_0098","1":"Diary_0098","2":"Diary_0098","3":"Diary_0098","4":"Diary_0098","5":"Diary_0098","6":"Diary_0098","7":"Diary_0098","8":"Diary_0098","9":"Diary_0098","10":"Diary_0098","11":"Diary_0098","12":"Diary_0098","13":"Diary_0098","14":"Diary_0098","15":"Diary_0098","16":"Diary_0098"},"Date":{"0":"unknown","1":1098.0,"2":1099.0,"3":1100.0,"4":1101.0,"5":1102.0,"6":1103.0,"7":1104.0,"8":1105.0,"9":1106.0,"10":1107.0,"11":1108.0,"12":1111.0,"13":1112.0,"14":1113.0,"15":1114.0,"16":1115.0},"Entry":{"0":"\n\n","1":"\n\nNo parade this morning so after breakfast prepared for a good sleep. However, about 10 were called out to go and get wood from for cooks – (all section). Couldn’t get any axes or saws so it was postponed until 10 o’clock when we fell in. Carter & Tompkins came back last night & Tennison 3 days ago. Section sergeants and officers gone to the line to-day to mark out our work which is I believe second line work. Got plenty of wood in the pontoon wagon and rested in the evening. Wrote one letter to Melv. Cloudy.\n","2":"\n\nNothing to do so fixed my future diary Kernot went to trenches this morning. Cloudy raining \n\nin the afternoon went down on the pontoon to a place over the railway line beyond Longueval where we carted a load of rails (9) to dump at Longueval leaving the wagons there for the night arriving home about 5. After tea cleaned myself and had a shave and then turned in.\n","3":"\n\nLight frost last night and fine day a little foggy. Paid in the morning. Last night 1 cpl & 6 men went out to prepare dugouts at the line returning about midnight. We expect to go out to-day. Canteen doing well & well stocked. 11 o’clock grew cloudy and started to snow pretty heavily.\n\nI was supposed to go out to-night but was sent down to Longueval to check some of our surveying & returned at 3-30. Found engine off the line at Longueval. Bed early and after some fruit and milk and cocoa read Lodge till fairly late.\n","4":"\n\nCloudy and foggy. Finished Lodge and consigned him to the flames to make more room in the pack. Nothing to do so wrote a letter & then got some more wood. Going out to-night. Have to go out at 11-30 so slept till then after tea. 2 Parcels from Sarah 1 with plum pudding containing 3\/6 also biscuits & dates.\n","5":"\n\nArose about 1-20 last night but didn’t leave until 1210. taking bottle of tea, chocolate & gas helmet and tin hat. Hudson led way with a lantern through","6":" Division duckboards. Very dark and my torch was useful. In Delville Wood we and went on a single line of boards. Everything was desolation and at length we came to a tram track which we followed past an R.E dump & then over country to our job. A little on the right of Flers High Wood. Got to work and put in the first set as well as got ready for the next and covered our work with sandbags. Only 2 shells fell near us but the opposite side of the Wood was heavily shelled all night. Guns were going all night. Left at 6 and\n\ngot some \ncoffee\n soup on the way home arriving at breakfast time. I went to sleep after, had dinner & then slept again until 7. Wrote diary and slept all night.\n\n19-20-16\n\nBreakfast at 7 and got orders to go on job at 8 at 7-45. So had to hurriedly get ready and moved out at about 9. Got another set in and had dinner there. Flers is quite close and I had a short look over it. The cemetery has numerous german graves in it. Fine in the morning although a sharp nip in the air and when we knocked off at 3 it snowed and continued until about 6 o’clock. On the way home passed who afterwards returned\n\nand we had a good chat in the dugout. Ingram returned at 8 and ate excellently well. Wrote diary up read a little and went to sleep. Our job to continue at 4 to-morrow. Jack left a packet of cigarettes and a bottle.\n","7":"\n\nVery cold all and snow lay unmelted on the thick ice. However, the day was quite fine and sunny Aeroplanes active & Fritzs artillery very active bombarding all day long billets adjacent to here Appeared to be a stunt on our right (French) and we heard of French success at Verdun and British at Arras. Roads were extremely hard and had difficult in moving owing to their slippery nature.\n\nGot up about nine cleaned dixies and generally tidied up the hut and after dinner went over the and got some wood which was frozen and hard to chop. 5 letters arrived including two christmas cards. Went out to job at 4-15. taking a water bottle of hot tea. Very cold and woollen hats and gloves were essential. The tea was frozen when I got out there. Our guns were bombarding a good deal but enemy’s were quiet until 10-30 when he sent over about a dozen big H.E. quite close. The pieces could be heard viciously tearing above our . Knocked off at 11 & cold wind coming home and went straight to bed.\n","8":"\n\nNo breakfast and stayed in bed till 9 when\n\nI got up and wrote diary and letters until dinner time. All the ice and snow has completely thawed and there is a strong cold west wind. Did the same in the afternoon and continued in the evening as I couldn’t sleep but rested a bit. At 11-15 Hudson came round telling us to fall in but we didn’t get away until after 12. Kernot acting sergeant major should have seen to it but he was evidently drunk again. Previous night he was lying dead drunk half in & half out of his dugout.\n","9":"\n\nUsual routine at the job and several shells fell rather close, shaking the ground. Returned at 6 and after breakfast slept till dinner & then on to\n\ntea after which I arose and had a wash and after writing diary went to bed. Rumour that each man is to receive 3f fre goods from canteen out of profits on Christmas day.\n","10":"\n\nWoke up in good time but we were late starting and only went at 9. On the way we got a truck of duck boards and carried one each from the line to the job to the sap. Later carried some sets over. Raining a little at times and very strong west wind. The day was cloudy once sunny and observation very clear. was very clear and figures could be seen plainly. Part of our sap fell in and it was very sloppy working. Knocked off at 3 and came\n\nhome to find the Christmas box waiting from N.S.W. and all standard parcels without any note inside. Went early to sleep after spending 3 hours lighting stove which afterwards went out & we slept cold.\n","11":"\n\nStayed in bed all the morning. Hudson Sergeant went away with varicose veins. Blight goes on leave & C. Cools back. Sunny in the early morning but mixed later on but not a bad day. After dinner wrote up diary and some more letter. Set out at 4-30 as usual and put in some more of the level drive. A bombing row was heard on our right and they were thick and fast presumably a raid. Right in front of us green lights bursting into went up interspersed with\n\nVery windy and miserably cloudy day and rained a good deal. All work of all kinds seemed suspended but we went on as usual and nothing to denote Christmas Day. Went out at 12 and we are now apparently working on a new system. Our section did all the work on the dugouts & Fritz shelled fairly close. Two old “Anzackers\" each of about 5 weeks war service came out with us to see the war. Another bombing attack developed right on our front and machine gun fire & rifle fire active apparently Fritz’s raid. Guns silent but he put over a good deal of shrapnel. Dave in charge and went silly again and ordered us to do half an hours extra work\n\nfor not hurrying like a crowd of school children. Returned for breakfast and afterwards had a good clean up and went to bed. Day mild and fine in the morning and wrote things before going to sleep. Last night after tea argued until time to go to work with Ingram as to whether a man with extraordinary abilities should not be promoted (coming late) before a man with long service. He seems typically prejudiced being an old hand himself.\n","12":"\n\nSlept intermittently until 4 o’clock but Ingram woke me up. We had the option of doing our next shift anytime between 4 and 10 next morning so went out at 4-4-5\n\nFine in morning though misty and cloudy in afternoon and very heavy shelling on both sides all day. Calmed a bit in the evening and we didn’t get many shells over. However No 3 working on the Machine Gun emplacements got it heavily and one of the infantry party was knocked out. Came home at 12 and got straight to bed. Very frosty coming home but walking kept us warm Slept until dinner next day.\n","13":"\n\nand then wrote up diary, letters, etc. Two parcels. One from mother other Sarah & Katie. steamy frost last night but quite fine this morning and enemy bombing plane came over early using his machine gun and getting\n\npositions. Later this place was shelled by whizz-bangs but no shots were right in the camp and no damage apparently done. Last night George Clarke of No 3 cook came part of the way with me dead drunk but soon fell off the duckboards into a shell hole where he wallowed and made a perfect beast of himself. We left him behind in a convenient dugout.\n\n26-12-16\n\nOut at midnight & work as usual.\n","14":"\n\nLaid in bed all day slept & wrote letters. Go to work to-night at 4-30. Set out and branched off outside Delville and at length after 1 ½ journey came to Needle Trench Communication where we started digging a shaft 5 x 3 for a machine\n\ngun. Shells fell pretty thickly on our left and it rained continually all the time till we were wet through. Coming home a different way with rain driving in our faces and got some rum & tea on arrival.\n","15":"\n\nSpent most of next day resting and drying clothes which wasn’t a success. Throat very sore yet & glands swollen. Going out again to-night. Spent the day in bed and cleaned up a bit and went out at 4-30 working with Alver who is not yet an efficient sapper. I had to do all the digging in the shaft and got a good deal behind the others. Day was cloudy but mild out in the\n\nevening working it was quite pleasant with a fair amount of moon but the usual amount of shells fell. Came home and got some rum and tea before turning in.\n","16":"\n\nUsual regime and got up late and cleaned up as usual and get out at 4-30 via Farm Delville Wood – past a broken up tank then a battery on to the job. Cloudy and it rained three times while we were working. Worked hard and got down to 8 ft. Shelling all round pretty severe. Came home about 10-30 and all along the duckwalks shells had fallen with great accuracy and torn it up in many places. Passed Delville and just before\n\nreaching road before Waterlot Farm got shelled on the duckboards about 8 came over two combined shrapnel & H.E and fell very close to us and we were lucky. At the A.M.C. 2nd Division men were in a car singing & celebrating the passing of the old year. Coming across the plateaus all the guns in the whole sector opened up for about 10 minutes to give Fritz a new year greeting\n\n"}}