{"Document Name":{"0":"Diary_0108","1":"Diary_0108","2":"Diary_0108","3":"Diary_0108","4":"Diary_0108","5":"Diary_0108","6":"Diary_0108","7":"Diary_0108","8":"Diary_0108","9":"Diary_0108","10":"Diary_0108","11":"Diary_0108","12":"Diary_0108","13":"Diary_0108","14":"Diary_0108","15":"Diary_0108","16":"Diary_0108","17":"Diary_0108","18":"Diary_0108","19":"Diary_0108","20":"Diary_0108","21":"Diary_0108","22":"Diary_0108","23":"Diary_0108","24":"Diary_0108","25":"Diary_0108","26":"Diary_0108","27":"Diary_0108","28":"Diary_0108","29":"Diary_0108","30":"Diary_0108","31":"Diary_0108","32":"Diary_0108","33":"Diary_0108","34":"Diary_0108","35":"Diary_0108","36":"Diary_0108","37":"Diary_0108","38":"Diary_0108","39":"Diary_0108","40":"Diary_0108","41":"Diary_0108","42":"Diary_0108","43":"Diary_0108","44":"Diary_0108","45":"Diary_0108","46":"Diary_0108","47":"Diary_0108","48":"Diary_0108","49":"Diary_0108","50":"Diary_0108","51":"Diary_0108","52":"Diary_0108","53":"Diary_0108","54":"Diary_0108","55":"Diary_0108","56":"Diary_0108","57":"Diary_0108","58":"Diary_0108","59":"Diary_0108","60":"Diary_0108","61":"Diary_0108","62":"Diary_0108","63":"Diary_0108","64":"Diary_0108","65":"Diary_0108","66":"Diary_0108","67":"Diary_0108","68":"Diary_0108","69":"Diary_0108","70":"Diary_0108","71":"Diary_0108","72":"Diary_0108","73":"Diary_0108","74":"Diary_0108","75":"Diary_0108","76":"Diary_0108","77":"Diary_0108","78":"Diary_0108","79":"Diary_0108","80":"Diary_0108","81":"Diary_0108","82":"Diary_0108","83":"Diary_0108","84":"Diary_0108","85":"Diary_0108","86":"Diary_0108","87":"Diary_0108","88":"Diary_0108","89":"Diary_0108","90":"Diary_0108","91":"Diary_0108","92":"Diary_0108","93":"Diary_0108","94":"Diary_0108","95":"Diary_0108","96":"Diary_0108","97":"Diary_0108","98":"Diary_0108","99":"Diary_0108","100":"Diary_0108","101":"Diary_0108","102":"Diary_0108","103":"Diary_0108","104":"Diary_0108","105":"Diary_0108","106":"Diary_0108","107":"Diary_0108","108":"Diary_0108","109":"Diary_0108","110":"Diary_0108","111":"Diary_0108","112":"Diary_0108","113":"Diary_0108","114":"Diary_0108","115":"Diary_0108","116":"Diary_0108","117":"Diary_0108","118":"Diary_0108","119":"Diary_0108","120":"Diary_0108","121":"Diary_0108","122":"Diary_0108","123":"Diary_0108","124":"Diary_0108","125":"Diary_0108","126":"Diary_0108","127":"Diary_0108","128":"Diary_0108","129":"Diary_0108","130":"Diary_0108","131":"Diary_0108","132":"Diary_0108","133":"Diary_0108","134":"Diary_0108"},"Date":{"0":"unknown","1":1509.0,"2":1510.0,"3":1511.0,"4":1512.0,"5":1513.0,"6":1514.0,"7":1515.0,"8":1516.0,"9":1517.0,"10":1518.0,"11":1519.0,"12":1520.0,"13":1521.0,"14":1522.0,"15":1523.0,"16":1525.0,"17":1526.0,"18":1527.0,"19":1528.0,"20":1529.0,"21":1530.0,"22":1531.0,"23":1532.0,"24":1533.0,"25":1534.0,"26":1535.0,"27":1536.0,"28":1537.0,"29":1538.0,"30":1539.0,"31":1540.0,"32":1541.0,"33":1542.0,"34":1543.0,"35":1544.0,"36":1545.0,"37":1546.0,"38":1547.0,"39":1548.0,"40":1550.0,"41":1551.0,"42":1552.0,"43":1553.0,"44":1554.0,"45":1555.0,"46":1556.0,"47":1557.0,"48":1558.0,"49":1559.0,"50":1560.0,"51":1561.0,"52":1562.0,"53":1563.0,"54":1564.0,"55":1565.0,"56":1566.0,"57":1567.0,"58":1568.0,"59":1569.0,"60":1570.0,"61":1571.0,"62":1572.0,"63":1573.0,"64":1574.0,"65":1575.0,"66":1576.0,"67":1577.0,"68":1578.0,"69":1579.0,"70":1580.0,"71":1581.0,"72":1582.0,"73":1583.0,"74":1584.0,"75":1585.0,"76":1586.0,"77":1587.0,"78":1588.0,"79":1589.0,"80":1590.0,"81":1591.0,"82":1592.0,"83":1593.0,"84":1594.0,"85":1595.0,"86":1596.0,"87":1597.0,"88":1598.0,"89":1599.0,"90":1600.0,"91":1601.0,"92":1602.0,"93":1603.0,"94":1604.0,"95":1605.0,"96":1606.0,"97":1607.0,"98":1608.0,"99":1609.0,"100":1615.0,"101":1616.0,"102":1617.0,"103":1618.0,"104":1619.0,"105":1620.0,"106":1623.0,"107":1624.0,"108":1625.0,"109":1626.0,"110":1627.0,"111":1628.0,"112":1630.0,"113":1631.0,"114":1632.0,"115":1633.0,"116":1634.0,"117":1635.0,"118":1641.0,"119":1642.0,"120":1644.0,"121":1645.0,"122":1646.0,"123":1647.0,"124":1648.0,"125":1649.0,"126":1650.0,"127":1651.0,"128":1652.0,"129":1653.0,"130":1654.0,"131":1655.0,"132":1656.0,"133":1657.0,"134":1658.0},"Entry":{"0":"\n\n","1":"\n\nLeft Sutton Viny on Draft. Arrived Southampton 1PM.\n\nEmbarked about 6 & got of again & marched about 2 miles to Rest Camp. Issued with 3 Blankes & put in a fair night. Has been allmost like Summer the last few days. There is a lot of fun in going on Draft –\n\nWhat, without asking, hither hurried Whence? And, without asking, Whither hurried hence?\n\nOf course there is a good deal of Drinking & any sort of travel\n\nis always exciting to some extent.\n","2":"\n\nHave fared well for tucker 5 of us got 4 tins of Bully between us & were able to buy good bread on the Boat\n\nThursday\n 23rd Wednesday \n\nHad a very light breackfast Bacon & Bread at 6 & started right away for the Boat Southampton seems a fine place Went straight on to the Boat & anchored in the Harbour until 7.15 P.M. There are a lot of horses on board\n\nWed & Thursday\n\n& a good many troops No sleeping arrangements have hunted all over for a decent camp but given it up. It is a dead calm night & there is no sickness. The engines have just stoped 4.15 am so expect we are at Le Havre – Later – Left the ","3":"\n boat about 9 & did about 5 miles to the rest camp. What we saw of Le Havre it is a verry dirty place in fact the mud was 2 or 3 inches deep on the Road in places, Had a good feed & got the balances \n\nof our Kit. Waterproof sheet & Cape combined Rifle & Tin Hat. Got blankets & sleept in the Picture Show – Had to wait for the Show to finish at 8 & then sleept the sleep that is issued to very small children & soldiers\n","4":"\n\nHad a march about 6 miles with full loads – less Ammunition Quite a hot day & the troops felt it. Good road nice country The tucker here is the best I have struck in the army\n\n& they have better quarters than we have Left it too late to find any decent place to camp in so sat up & poked about all the time A verry mild & perfectly calm night\n\nWent to Pictures to fill up to bed time\n","5":"\n\nLeft Camp at 9.30 a m with full Kits including ammunition & rations 5 or 6 miles to Railway – La Havre – left about 4 – 32 in a cattle truck just enough room to lie down by fitting in tight. Tea was supplied about 9\n\nPlenty of Bully & Biscuits some jam & cheese. Not a cold night had a fair sleep The march this morning took it out of most of us it was quite hot & the road was bad\n\nTraveled slowly all day & left the train \/ 4 Oclock at Castre & marched about 1 ½ miles to camp getting there at dusk\n\nPut in tents & given an extra blanket. It is flat uninteresting country saw a few shell holes at Hasellboch a fair sized place about 6 miles back. The only real signs\n\nOf war so far. This is up to Sunday night\n","6":"\n\nHad a very short march this morning – without Packs Nothing in afternoon\n\nCan hear the guns from here & saw some shell bursts around a plane this morning & some to night behind us. They were a good distance away.\n\nTuesday 29th January\n\nLeft Castre this morning at 9.30 & marched to the Battalion about 12 to 14 miles. Got here about\n\n4 P.M. Did not have our packs on. Am in A Co & had to carry our packs about a mile to there lines It was the last straw Got a plentifull issue of good tea & made an execelent meal\n\nDid not feel the march much to day Crossed into Belgum about 5 miles back Came through one village that has been completely smashed up. The weather is beautifull & quite warm\n","7":"\n","8":" \n\nPut into No 4 Platoon 14th Section & had to march to where we are working about 4 miles with full loads. Spent the afternoon making a dugout Our Camp is where St Eloi used to be it is hard to find a full brick let alone a piece of wall standing\n","9":"\n","10":"\n\nWent out & did a shift on our job – a concrete \n\nobservation Post in afternoon. Did a bit to Dugout in morning. Foggie today for a change\n","11":" \n\nSame as yesterday\n","12":"\n\nShift changed now go out at 6 A.M. & return at noon. There are a lot of guns about here and a lot of shooting goes on but so far Fritz has not replied since we came here\n","13":"\n\nSame as any\n\nAny other day\n","14":"\n\nVery clear day plenty of our Planes up no Huns\n","15":" \n\nAbout 1 point of rain last night the first I have seen in France Fritz sent a fair lot of shells over this afternoon for a change the closest were 3 or 400 yds from our camp\n","16":" \n\nAt least I believe it is Thursday so have missed\n\na day somewhere it makes no difference Rain & wind today not very pleasant\n","17":" \n\nAs usual a few showers\n","18":" \n\nAs usual until just before knocked off Fritzy put about 20 shell over close to us some of the dirt fell around as the closest were only about 20 yds away He had 1 or 2 planes about this evening so we will probably\n\nget more shells in a day or so\n","19":" \n\nAs usual Pross & I went salvaging this afternoon & got a full tin on Biscuites 8 tins Butter 3 of Jam besides other odds & ends useful about the humpy. One can get almost anything about here – The waste is terrible.\n","20":" \n\nThe daily round as usual Go out at 6 AM – back at noon\n","21":" \n\nAs usual Pross went to Hospital with some slight internal complaint showery to day\n","22":"\n\n A fairly wet day A parcel from Riverina with nourishment – Thompson got 2 so we are set for luxiouries\n","23":" \n\nAs usual\n","24":"\n\nJust work a parcel from \n\nAunt Mirna more tucker & a pair of sox\n","25":" \n\nWork as usual. A very clear day plenty of Planes about Fritz seems to be kept well back Bell & I walked to Ypres this afternoon about 2 miles A few houses are left standing except for a few shell holes through them. The Cloth Hall & Cathedral are terribly battered even today 3 shells\n\nwere dropped on the road near the Hall & although there are a lot of men about he only got a Y.S. Wagon & 2 houses.\n\nHad a very nice Xmas parcel from the Victorian patriotic Fund. Cigs Biscuits Cream Curry powder Soup Cubes. Ham Paste Boot laces. Chocolate Spearmint Gum Every man got one & most of them were different\n","26":" \n\nSame as any other day Fritzy droped a couple of H near our job just before we knocked off. A lot of Arial activity today, Fritzy got well over our lines several times & got away allright one of our machines came down. Hit with one of our own shells I believe.\n","27":" \n\nStill working Fritzy came over the same as he has\n\nfor the last day or so But did not return 5 of our Planes came out of the Heavens there was some circleing about & machine gun fire He was gradually forced down & then plunged headlong As it was just knock off time some of walked over to see the machine it was a complete wreck on the bank of the cannal. The Hun was not killed but badly smashed the first wonded\n\nman I have seen Later one of our Planes caught fire & plunged down the pilot only being scorched a bit so we hear\n","28":" \n\nNothing out of the way. Pross rejoined us\n","29":" \n\nAs usual Rained a bit today there have been fairly heavy frosts all week quite an inch of ice on the shell holes but the days have been beautifull\n","30":" \n\nAs usual Bill & I went to the Divisional Baths & came back clean & bright. Good supply of hot water & new underclothes. Bill is not a bit windy. \nBut he\n was very funny aalday about a 9 in shell that lobbed quite close to him\n","31":" \n\nFinished our Observation Post proper still a few days digging & cleaning up to\n\ndo. It is a very solid job but not as good as it would be with one good boss on the job Payed today\n","32":"\n\nDid not go out until 8 this morning as the other shift came in early yesterday for pay. A very mild cloudy day. Some big stuff lobbed close to the camp this morning He is evidently looking for the 9 guns\n\njust down the road\n","33":" \n\nAs usual. Fritz sent us more stuff than usual today. Did no harm that I know of. His machines did not seem to be able to get up for observation\n","34":"\n\nAs usual A nasty cold wet morning\n","35":"\n\nFinished the Observation Post. A beautifull day\n","36":"\n\nDid a bit of messing about fixing a new camp for a fresh Platoon that is to join us\n","37":" \n","38":" as yesterday\n","39":"\n\nWent out in the evening to start a new job It is about 2 ½ miles away on what has been Hill 60, We are sayed to be 1800 yds from the\n\nHuns front line & as he has a good view of our job we are to do it at night. It is another concrete Observation Post Things were not ready so we did very little & got home about 9\n\nJust got to bed when our guns started in earnest & he repled putting a good deal of shrapnel in & about our camp Our humpie rocked\n\na good deal a bit of stuff fell on it once & Pross who is an old hand decided to clear out so we hopped out of bed & started down the road. The other two came back into the dugout but Pross & I went on & got into a Dugout about 30 feet deep it is only 2 or 300 yards away & a very wet vast place As the Hun seemed to have finished for the time being we\n\nsoon came back & went to bed again No one was hurt a few had narrow escapes. Have heard since it was a Hun raide & we captured 120 prisoners.\n","40":"\n\nWent out on the job until about 9 & got some stuff together a cold windy day with a little snow\n","41":"\n","42":" as yesterday\n","43":"\n\nOn the job for about 3 hours a dark wet night\n","44":"\n\nWeather has cleared up again All went out this evening & got back about 10\n","45":"\n\nWent to the Baths this morning Am now waiting until 9 PM as we are to go out then as a second shift The time was changed for going\n\nout to 3 AM & work until daylight\n","46":"\n\nSame as yesterday\n","47":"\n\nSame as yesterday only did less work than usual. A slight frost the last day or so beautifull days Pay day did not draw anything as I have most of last pay in hand.\n","48":"\n\nWent to the job as usual. But\n\nsome shells droped close & we ducked for a \nfor a\n Tunnel near by started again & once more He put his shells in Us for the Tunnell again \nGot at\n it again & finished of quick & lively. Another chap & I were last to leave & just as we got on the Tram track a gass shell droped plomp just close so we ran for it & the next one dropped just behind my mate. It kept us moveing, but they started to drop pretty thick in front so we stoped a bit & then went on\n\nwith our Gass Helmets on & got through without any trouble, In fact it does not seem very dangerous stuff, Not as bad as the H.E. shells although they can lob very close & do no harm\n","49":"\n\nA change of programme went out at 10 PM 3 of us stayed until 3 AM putting in iron reinforcements for the concrete. A cake & sox from Aunt Mima today\n","50":"\n\nWent out to the job at midnight a very quiet night\n","51":"\n\nWent out at 2 AM until daylight\n","52":"\n\nOut 12 till 5 foggie & dark\n","53":"\n\nSteady rain all morning Night shift as usual\n","54":"\n\nWorked in afternoon for a change getting stuff for job\n","55":"\n\nDid a day shift again\n","56":"\n\nAll hands went out in evening & finished job by about 10 oclock. Had to stop work twice on account of gas shells. Fritz started to put over a lot of mixed stuff when I was about ½ way home was just nicely in front of it – only had to duck once. Things livened up at the Camp soon after we got there – Mostely Gas\n\nShells some HE one of the later dropped about 10 yards from our front door. Had just made some cocoa & started on a feed when we got orders to put on our masks & go down the road. Most of the show was over by then but we had to hang about for fresh orders & eventually had to get our blankets & go about 1 mile to where the rest of the Co are camped getting there about 1.30 AM Was luckie enough to strike a hut\n\nwith a couple of old mates in it & got a good camp for the night Alltold 14 men were gassed out of our platoon only 2 or 3 any way seriously, ant say I even smelt it.\n","57":"\n\nA day off to recuperate\n","58":"\n\nThe Platoon or what is left of it went on Bath Paraide. Had an exelent bath & a good change. Rained nearly all day, the wettest I have had in this country\n","59":"\n\nFour of us went out to fill in the cracks & holes in the O. Post. Like kids makeing mud pies - & just about as usefull The Major came along he did not like the job some of it badly done so our Oficer took some men out at 3 am to fix things up. They got in a barrage about ½ way out & spent some hours in a dugout before they could move 2 or 3 got gassed slightly A few shells got near the camp\n\nbut no damage was done\n","60":"\n\nDid nothing all day\n","61":"\n\nWent out this morning at 6 & & nearly finished the job. Quite a hot day. Put some sand bags & dirt on our humpie to make it safe from Shrapnel or pieces of Shell – not sea shells –\n","62":"\n\nThree of us went out to put finishing\n\ntutches on the Observation Post on Hill 60 Pay Day drew 20 £\n","63":"\n\nSame as yesterday. Finished the job. The rest of the Platoon started a new job yesterday\n","64":"\n\nUnloded some trucks this morning. Moved Camp in afternoon about a mile back to the rest of the Co. The 4 of us still have a dugout on our \n\nown – much smaller than the last one got hold of some good bunks & have made our selves quite comfortable Yesterday was a real hot day, Tday quite cold A lot of rumours about that we have had a big reverse about Bapume – Hope they are untrue\n","65":"\n\nWent out at 7 AM in a Motor transport. Very crowded rough\n\ntrip. Excavateing for the concrete work. It is to be a Machine Gun position It was a very clear day & we had a good view over the Huns lines\n","66":"\n\nWalked out to the job. Got shelled a good deal going out & after we got there some very close but no one hurt\n","67":"\n\nHave missed a day somewhere, As I believe it is Good\n","68":" The only way we have of keeping a count of days is that we draw Matches on Thursday & Job on Sunday Worked in 2 shifts today I went at 7 AM. Things seem to be going against us in some parts. The yarn is that we go to the Somme in a day or so. Thought this would be a good quiet Camp but He has droped a few big ones fairly close to us yesterday evening & again this evening\n","69":"\n\nWent out to the job until about 11 till in about 2 PM with full packs for inspection. Were just dismissed & had got into our Humpie when he started drooping 5.9 the last one fell just out side our door & caught the 3 of us Pross & Thompson very badly. Damaged my R hand a bit. Bell was out side near the back he only got one in the leg. Walked to the Dressing Station at Vormassle. Fresh \n\ndressing put on & was put in a car on a stretcher. They made me into a stretcher case because I colapsed for a moment in the dressing Station Was taken out of the Car at another Station & inoculated, Put in another Car & brought here Gottweter seems a fair sized Hospital was given Gass & wounds fixed properly Have not had much pain. Had 2nd inoculation\n","70":"\n\nStayed in bed \n\nall day & slept a good deal of the time\n","71":"\n\nSame as yesterday only did not sleep so much. Did some reading instead\n","72":"\n\nFeel quite lively again today have been up most of the time & written up these notes it is very slow work. The RAMC chaps are first class It is quite nice to hear fowls ducks & an old cow\n\nhere in the morning seems quite a long time since I have heard anything but guns Quite some rain the last few days. We get good meals 4 per day. Porrage Bread Bacon & War Breckfast. Stew & Pudding Dinner Pudding Bread & Butter & Tea. Tea Bread & Cheese & Cocoa Supper\n","73":"\n\nGot on Red X train about 1 PM & got to the 14th Sationary Hos about 7 Had a Bath & got into a reall Bed with sheets & Nurses\n","74":"\n\nHand dressed again first time since Sat\n","75":"\n\nFresh paking put in wond Inoculated again Very comfy here\n","76":"\n\nPacking taken out of wond. Heard I was for Blighty\n","77":"\n\nA very fine day. This ward is filling up again mostly Aussies coming in\n","78":"\n\nUp at 5 a cup\n\nof tea & bread & butter Motor to boat. Left about 10 got Dover 12. Had 2 eggs B & B before starting Stew & tea before landing tea each time. A short train trip & Motor here 3 miles (splendid car) Quix Park VAD hospital\n","79":"\n\nA quick day getting used to place\n","80":"\n\nMotered about a mile to another Hospital to see a chap decorated with MM- A private place something like this\n","81":"\n\nWent for a walk in Vilage Cabled home (Wond very slight cable 5)\n","82":"\n\nAnother walk got to the beach The first sunnie day we have had here\n","83":"\n\nUsual thing\n","84":"\n\nExplored the grounds. Found a Bell tower but could not get in to ring the Bells\n","85":"\n\nStarted out for Margate did not ask the way so landed\n\nin Westgate quite a larger place. The sea front has barb wire entangle\n","86":"\n\nRather wet & cold 14 patients left & 14 new ones took there place did not go out\n","87":"\n\nWalk to Birchinton as usual\n","88":"\n\nAs usual. Have a job in the forenoon now helping Nurse to dress the patients\n","89":"\n\nWalked to Margate quite a fine place Buss home\n","90":"\n\nQuite a bussy day went to the Church to the christening of Christopher Powel – Cotton came back Had cake & champain & planted a tree. Evening the Major showed us some of his stuffed beasts & later lantern slides of one of his African trips giving a lecture each time all very interesting\n\nMonday 22nd April\n\nA very fine day wheeled one of the lads about the grounds for a time\n","91":"\n","92":"\n\nHad tea with Aunt S. found Mrs Matthews. Very nice people live about a mile away\n","93":"\n\nJust an ordinary day except for getting 4 Aussie letters\n","94":"\n\nGot the sad news that I am to move tomorrow Letters from Ann dated 18\/3 Farewell concert in evening & we gave Master Cotton a silver backed C & Brush cost us 9 each it was quite nice\n","95":"\n\nLeft Quix \n\nat 8.20 after many farewells & good wishes arrived Dartford at noon & realized I was still in the army (Yesterday afternoon went home to tea with Nurse Stone they have a nice old home a big farm) \nHer parents are like\n","96":"\n\nWent for a walk but there is no where to go as the only road leads through Dartford & it is out of bounds\n","97":" &","98":"\n\nNothing in particular. The weather is fairly cold & wet \n\nFrom","99":" to","100":"\n\nHave been to to fill this in. Can write with the right H again thum & finger still stiff & bandaged. Have been vaccinated again. Programme here is Breckfast 7.45 your bed has to be made before that Ward is then cleand – scrubbed twice a week swept other days\n\nDr come at 9 or 11 Dinner 12.45 Tea & Supper & Lights out 9, Can go out from 1 to 8 PM late leave can be had & parties go to London nearly every day three Concerts per week very good , Whist Drives Pictures Etc most other nights. The only road leading from here goes through Dartford & it is out of bounds so there is practically no where to go. The Australian Nurses strike me as being much more competent than the \n\nEnglish.\n","101":"\n\nHave packed on again today ready to leave tomorrow Monday, Have been able to write with the R hand for last few days.\n","102":"\n\nLeft Dartford about 10.30 & Marched to the station Changed trains at Waterloo for Winton. The train took us right up to Forant & Cars from there about 2 miles to No 3 Command Depot Hurdcotte. Went through the usual perforfmance\n\nof giving name age had we seen active service Etc. Signed for knife fork & spoon particulars again over it all again for Blankets & then after a fair wait got a feed. It has been a beautiful day & the country looks beautiful with the diferent greens of the leaves.\n","103":"\n\nThe Dr had a look at us this morning. Rain most of the day. Am back to the old camp life again\n","104":"\n\nFell in twice but did nothing\n","105":" to","106":"\n\nHand dressed every day. Beautiful weather. Doing nothing but reading & loafing about\n","107":"\n\nNothing as usual Wet day again\n","108":"\n\nWas marked B.A. today as my hand is quite healed. Walked to Forant & back this evening about 4 miles longest walk I have had for a long time\n\nWensday","109":"\n\nSaw dentist & had a tooth stopped\n","110":"\n\nMoved from Hut 34 No 1 Co Camp 5 to No 5 Co, Hut 28 Camp, only a few 100 yds\n","111":"\n\nAm down for Massage & R C treatment (exercising the affected tissues) But was sent to the dentist waited there until he was knocking off & as he had not got around to me got nothing done. It is an easy \n\nway to put in time, One gets the paper & has plenty of time to read all the news, Was on fatague in the morning scrubbing out a hut\n","112":"\n\nWas on fatigue for about ½ an hour this morning. Writing & reading rest of day Very hot.\n","113":"\n\nUp for classification dont \n\ndont know what I was marked yet. Had Massage & R C treatment.\n\nThere is an old Roman fort on the hill near here. The earth is banked up about 6 ft high in a rough circle about 150 yds across. \nThey\n Heard some chaps discussing what it had been made for & concluded it must have been a Sports ground or Bike track.\n","114":"\n\nNothing out of the way \n\nWensday","115":"\n\nNot as much \n\nfuss as usual for the day before leave. Did not even see the Dr\n","116":"\n\nRoused out early & had to put our Blankets & \ncooking\n eating utensils away before we had breakfast. Got Passes sugar & meat tickets Etc marched to Forant & got the train there. Arrived London about 12 Got a Railway Warrant for Goralwood Had Dinner at War Chest.Bussed to Bayswater & spent afternoon with Aunt Susie Caught train at 8.20 from Euston for Hollyhead\n\nknow what I was marked Had Massage & R.C treatment\n\narrived ther about 1 am a good trip – straight on to Boat. Not a bad night a bit rough & a good deal of sickniss a little bit cold towards daylight. Not much accomedatn on board & a lot of Soldiers Arrived Kingston about 4 straight on to Dublin, Amiens S Station. Plenty of tea & sandwidges free on the warfh Got a train almost straight away for Goralwood got there about 9 & after a little wandering found Aunt M\n","117":" to","118":"\n\nHad a very exelent time at The Hill & feel much better for it Aunt Mary is a quick bright kind little person. She could not do enough for me and is like Aunt Mina in one way.You never eat quite enough to satisfy her. It is a very pretty country Hilly & a great many hedges. Most of the houses are old fashioned little places. Jim does a good deal of farming keeps about 50 sheep & some cattle milks 7 or 8 cows. The weather was glorious all the time except the first day being showery\n\nWent to a Fair at Bainbridge one day motored about 50 miles & saw a lot of pretty places about Guilford being particularly fine. Some large estates with fine trees, Also about Kilmarnock. Sheep & catle are all sold privately in the main street. Was in Newing quite a large place, & Visited a lot of the neighbours, All very nice people. It seems to be a nice life, The work is not very strenuous. They all know each other & there people before them knew each other. There is a high standard of\n\neducation or rather learning & most of the people I met were anything but narrow minded & take more interest in out side events than most country people.\n","119":"\n\nLeft Goraghwood about 4 & had about ¾ of an hour to put in at Dublin waiting for the boat train. Walked to Nelsons Monument & back It seems a fine busy place.The beggars are a nusance but certainly they pray for your soul while \n\ntrying to sell you a paper. Kingston looks a nice place. Quite a hilly coast line, Had a very smooth passage arrived London about 6 am Walked down the Embankment passed Cleopatras Neadle which has been splattered by a bomb & a few holes made in the bronze Sphinx at one side of it, Had breakfast Bath etc at WarChish & caught a train about 10 for Harwich Nab met me on Station & we \nwent\n took our tea out to Penmill that evening\n\n& went out boating for a time\n","120":"\n\nCycled to Hollbrock for tea, D, Nab Miss A & self. A very pretty wood with a nice sheet of water\n","121":" \n\nWent through the Boys Naval Training school in the morning It was most interesting the Boys made a very poor attempt to learn to swim Went to Captain Lynes for tea & tennis \n","122":"\n\nNab & I Cycled about 7 miles to a friends Cap Ellis I think was the name to lunch He had been blown up on his mine sweeper & had his leg broken\n\nWensday","123":"\n\nCycled about 14 to Hatford up the River that runs between Harwich & Shotley Took lunch with us & got a boat Rowed a couple of miles this very pretty river Came back to Allens for tea & stoped for Diner\n","124":"\n\nLeft Harwich about 10, Bussed to Bayswater quite a long trip from Liverpool St Station & spent a few hours with Aunt S \n\nLeft London at 6 & got to Forant about 9 Reported drew blankets etc got some letters & just had time to read one before lights out\n","125":"\n\nThe usual routeen, Medical inspection Dentist Etc Got 12 letters & two parcels one from \n\nAnn one Aunt Nima Am Marked B.A4 so will not be here long The Dentist has my teeth it is uncomfortable without them.\n","126":"\n\nWent sick this morning as my eys are a bit sore Massage & R C treatment\n","127":"\n\nNothing to report\n","128":"\n\nDid nothing Have finished R C & Massage treatment Quite cold today & some rain.\n","129":"\n\nGot my teeth back am very glad to say as my mouth was getting sore, There is nearly\n\nalways some Chap in each hut who is the special clown or in some way is more noticeable than the others In my present hut theres is a chap “Bluie” O,Brian who is very funnie especially when he comes in about 11 oclock at night He has been in some of the Concert Parties & has a lot of funnie sayings & can imitate a Gramaphone quite well\n\nWensday","130":"\n\nOn Draft for the Oversea Training Brigade, Sutton Veny Medical inspection Etc\n","131":"\n\nMarched about 4 miles to Wilton train to Warminster about 4 mile march to Camp arrived about 4 oclock drew 3 blankets & had a good tea. The marching made me a bit tired today as I have done so little of any thing for so long.\n","132":" \n\nSwimming paraide Marched about 4 miles to Sheerwater a very pretty little Lake on Lord Baths estate, A bit cool for most of us to swim so only a few went in, Afternoon Medical & dental inspection put in\n\nspare kit drew Rifles Equipment Gasmasks Tinhats Etc. Warminster at night\n","133":"\n\nFatague, Put 1000 Rifles into 2 M store, Went to the opening of new YMCA at Sutton Veny in afternoon Quite a mansion in very nice grounds Tennis Crocque Etc.\n","134":"\n\nOn guard for the first time since last December. Not a bad guard. (Continued in book three) This day last year sailed from Sydney\n\n"}}