{"Document Name":{"0":"Diary_0057","1":"Diary_0057","2":"Diary_0057","3":"Diary_0057","4":"Diary_0057","5":"Diary_0057","6":"Diary_0057","7":"Diary_0057","8":"Diary_0057","9":"Diary_0057","10":"Diary_0057","11":"Diary_0057","12":"Diary_0057","13":"Diary_0057","14":"Diary_0057","15":"Diary_0057","16":"Diary_0057","17":"Diary_0057","18":"Diary_0057","19":"Diary_0057","20":"Diary_0057","21":"Diary_0057","22":"Diary_0057","23":"Diary_0057","24":"Diary_0057","25":"Diary_0057","26":"Diary_0057","27":"Diary_0057","28":"Diary_0057","29":"Diary_0057","30":"Diary_0057","31":"Diary_0057","32":"Diary_0057","33":"Diary_0057","34":"Diary_0057","35":"Diary_0057","36":"Diary_0057","37":"Diary_0057","38":"Diary_0057","39":"Diary_0057","40":"Diary_0057","41":"Diary_0057","42":"Diary_0057","43":"Diary_0057","44":"Diary_0057","45":"Diary_0057","46":"Diary_0057","47":"Diary_0057","48":"Diary_0057","49":"Diary_0057","50":"Diary_0057","51":"Diary_0057"},"Date":{"0":"unknown","1":1282.0,"2":1283.0,"3":1284.0,"4":1285.0,"5":1286.0,"6":1287.0,"7":1288.0,"8":1289.0,"9":1295.0,"10":1297.0,"11":1298.0,"12":1299.0,"13":1303.0,"14":1304.0,"15":1305.0,"16":1308.0,"17":1309.0,"18":1310.0,"19":1311.0,"20":1312.0,"21":1313.0,"22":1314.0,"23":1315.0,"24":1316.0,"25":1317.0,"26":1318.0,"27":1328.0,"28":1329.0,"29":1330.0,"30":1331.0,"31":1332.0,"32":1334.0,"33":1335.0,"34":1339.0,"35":1344.0,"36":1351.0,"37":1352.0,"38":1355.0,"39":1358.0,"40":1359.0,"41":1363.0,"42":1364.0,"43":1366.0,"44":1368.0,"45":1369.0,"46":1370.0,"47":1373.0,"48":1374.0,"49":1376.0,"50":1377.0,"51":1379.0},"Entry":{"0":"\n\nBeaulencourt ","1":"\n\n3rd Aust Div had their first real fight together with the 4th Div (or rather the remnants of the 4th Div.) and no New Zealanders in the attack on Cleosines Ridge which was carried on the 10\/6\/17.\n\nBeaulencourt 10\/6\/17\n\nThe King of Greece has at last been forced to abdicate. His second son is carrying the government in his place instead of the elder son who evidently has a strong leaning towards the Germans. In any case the second son is closely watched.\n\nBeaulencourt","2":"\n\nHeavy German attack launched against portion of Hindenburg Line (held by the 64th Battalion) on 14th\/15th May. Attack a complete failure. Our men did magnificent work.\n\nBeaulencourt","3":"\n\nGeneral John Pershing, Commander In Chief of U.S.A. Forces in Europe arrived in Paris yesterday evening. Given a great reception by the French people.\n\nWarloy","4":"\n\nOur Brigade was relieved from Beaulencourt by the 2nd Div. yesterday. We had a very pleasant train journey down from Bapaume Station in the cool of the evening. The country everywhere looks beautiful.\n\nI am billeted with two of “A” Company officers in a very nice house. The French people here are very kind and do all they can to make us comfortable. The Town of Warloy is a rather big and important place. We are fortunate in being billeted in such a convenient place. Plenty of shops for the boys to buy what they require.\n\nWarloy","5":"\n\nWent to Amiens on","6":" with Lieut. Gollan (who was our Adjutant but has now been given a staff position). We had a good fly round in there. Had some difficulty getting in as we were off\n\nthe main traffic road but eventually managed to get into a RFC car at Querrio (ARMY Hqrs) and soon got into the city. We had a good look round the Amiens Cathedral both inside and out. Picked up a private car coming out and fairly flew along the road as far as Franvillers where we got into a R.F.C. Lorry which dropped 1½ Kilos from \nhouse\n. We only had 48 hours in Amiens but I think it was quite long enough as there are no attractions hardly. No gardens to speak of and no theatres except Picture.\n\n \n\nShows. \n\nWarloy","7":"\n\nLast night word came through by phone that our worthy medical officer, Capt Leedman and \ntwo\n three \nothers\n others of our Battalion had been \ngranted\n decorated with the Military Cross and that one other had received \nthe\n a bar to the Military Cross, one a D.S.O. and the Regimental Sergeant Major a DCM and a L\/Cpl the Military Medal. This makes a total of 10 Military Medals, 5 Military Crosses and a Distinguished Service Order. These decorations have been awarded for the gallant work done on the\n\nnight of 14th –","8":" when the Germans attacked our portion of the Hindenburg Line (just to the right of Bullecourt and facing Reincourtz and \nwhen\n were repulsed by our men with very heavy losses. Last night therefore was a bumper night and those of the recipients who are with us now were congratulated and honoured in the approved manner.\n\nWarloy-Baillon","9":"\n\nFour other officers and myself promoted to Lieut. In last night’s orders.\n\nWarloy-Baillon","10":"\n\nTwo days ago I had to shift my quarters from a comfortable billet to my present very unpleasant abode. Unpleasant, because the people are too confounded mingy to waste breath passing the time of day – one has to be in early else one finds oneself locked out. For instance, last night I had pressing business – ahem – which prevented my arrival \n”home”\n ?? until eleven oclock and I found the door locked. I hammered that door with my cane hoping to hear a sympathetic voice from the window above ask if I wanted\n\nto come in, but no such luck. Such a pity too as I was just in the humour for tearing up paper. Ah, Me! They are a hard-hearted lot. I only wonder they didn’t throw stones. They’re mangy dog barked at me. I have to go upstairs to my room so I can get my own back by stamping up and down two or three times in the morning about 4 AM before I go on parade. “That orter fix ‘em”. It was only this afternoon that I found out I could lock the blamed door of my room. Hitherto I have not been able to do so and had\n\nto content myself with merely “pushing it to” and running the risk of it being blown open at any inconvenient minute by the wind which blows through the open window on the opposite side of the passage. This window is \nalways\n open and I had begun to suspect a foul plot until I discovered that I could lock the door. I found out in this “wise” Madam came up this afternoon about 4 oclock and made a tremendous noise locking and unlocking the door of her bedroom and I was so “fascinated” with the sound that I began the same\n\nwith \nmy\n the lock on my door. There is no handle on the door but a rusty old bent key, heaven’s only knows how old probably taken out of the muck heap (which exists in all the \nback\n front yards of the best circles in France) and placed in the lock by one of the grubby looking children. Well I kept twisting and turning the key when suddenly I hear a crash and I saw \nthe\n a bolt spring out of the side of the lock. I emitted a shriek of triumph for my far sighted sagacity told me in a flash that here was the means whereby\n\nto\n my door might be locked thus hiding from my view the “dismantled hulks” which continually pass my door.\n\nWarloy","11":"\n\nPlenty of amusement for the boys lately. The Aust. Comforts Fund has provided a cinematography show and it \nhe\n shows every evening in the town for the Australian Troops billeted here. The 5th Div. Concert Party called “The Anzac Coves” also gave a bonser show last night in the Y.M.C.A.\n\nVery little war news lately. Things are fairly quiet until the Allies get their wind for the next push. The Portuguese Troops have been doing wonderful work. They captured a German Patrol a few days ago and \nthe\n it is rumoured\n\nthat the whole bang lot have been mentioned in Sir D. Haig’s despatches.\n\nWarloy-Baillon","12":"\n\nThis afternoon we marched out in the direction of Henencourt Wood where the brigade was formed up as a ceremonial Parade to greet Gen Birdwood and Mr Holman the State Premier. Numerous medals were presented then Gen. Birdwood gave one of his usual speeches in which he said he knew we were all breaking our necks to be back and at ‘em again. When he had finished Mr Holman gave a very sensible little speech in which he praised the work of the Australian troops\n\nand finished up by telling us that he had obtained the \npermission\n of the General to visit the portion of the front line trenches which had been captured and held by the Australians. He received many sarcastic replies to this confession and somebody shouted out “You had better get the permission of Fritz to come back”.\n\nWarloy-Baillon","13":"\n\nThe Russians have “moved” at last and captured nearly 8,500 prisoners on the Konichy-Dameniki front.\n\nThe French have been getting a very thin time of it during the last fortnight in the Verdun sector. Heavy fighting is in\n\nprogress in front of Lens which the enemy is stubbornly defending. It is interesting to note that Turkish Troops are fighting with the Germans against the Russians on the Konichy front. Evidently the German command found it inconvenient to send all the Turkish troops back to their own front to fight against \ng\n General Maude during his victorious and brilliant advance, while the British and French were hammering on the Western Front.\n\nThe head of the Russian Navy is a frenchman formerly a lieutenant in the French Army. After the Russian revolution he went to Russia\n\nwhere for a time he was Military Editor of the paper called Volia Naroda. He agitated strongly for a Russian offensive. He was elected President of the committee for the reorganisation of the Russian fleet and has been provisionally appointed Minister of Marine. He is only 30 years of age.\n\nThe anniversary of the great Somme Offensive was celebrated in the churches in Belfast on","14":" in memory of the officers and men of the Ulster Division who fell in that fight.\n\nWarloy-Baillon","15":"\n\nYesterday afternoon, Divisional Sports were held near the Henencourt Wood. The","16":" Bde won the prize.\n\n(silver cup) for the best drilled and turned-out company, the obstacle race in full marching order, the A.S.C. best turned out G.S. Waggon and unlimbering and limbering competition, \nat\n third in the bayonet fighting competition and the 14 Bde signal section came second \nat an\n in the lateral communication test. There were several other events the most notable of which was the physical drill class. The stretcher bearers and A.M.C. turnouts were very good. \n\nThe afternoon was fine and everything went off \nf\n in first rate style. Two bands played in turn throughout the whole afternoon and God Save the King terminated one of the most \n\ninteresting and instructive sport days which it has been my fortune to see.\n\nThe Brigadier General (Hobkirk) Divisional General Hobbs\n\nand General Birdwood were present and appeared to take the keenest interest in every event.\n\nBeassart","17":"\n\nWe left Warloy-Baillon yesterday morning at 9 AM and reached our present position about 12 noon in good condition. The road was good the distance about 8 miles, we had the brigade band and when it was not playing our own “drum band” provided the necessary “noise.” We had 3 stops on the way. It is\n\nthe rule in the Brigade when on the march to halt for 10 minutes rest \nevery\n 10 minutes to every clock hour. We have had 3 weeks in Warloy-Baillon and 3 very happy weeks too for me at any rate, but like all good times it passed far too quickly. Another tragedy enacted and already nearly forgotten. The tragedy which perpetually haunts a soldier’s life. A little love, a big kiss and parting with all its sorrow and fleeting memories of happy hours, gone, perhaps never to be rehearsed.\n\nBeassart","18":"\n\nToday I took a party of signallers from the Brigade per motor lorry to Laveville to\n\nthe R.F.C. camp there, to do a little practical work in contact Patrol work. We had lunch in Warloy-Baillon each going where he pleased for this purpose. I had lunch with some of my Friends there. We reached the R.F.C. camp at 2 p.m. had tea and then listened to a brief lecture by one of the officers after which I \nhad\n went for a short flight with a South African Pilot in a Morane Monoplane. It was simply ripping but the day being cloudy, windy and generally unfavourable we did not stay up long and of course I did not appreciate it quite as much as I might have done had the day been fine\n\nTwo of the signallers whom I took with me also had a flight and they enjoyed it immensely. The officers were extremely courteous to us and told us anything which we wanted to know \nand\n in that refined and precise manner which only an English Gentleman knows how to use correctly. I met two Australians belonging to that squadron one of whom was a qualified pilot and an M.C.\n\nToday’s war news is very good all round. The Russians have started again and taken 7000 prisoners, 38 guns and their cavalry have pushed through.\n\nBeassart","19":"\n\nTodays paper states that a big air raid over London by german aeroplanes has taken place. The number of enemy planes was greater than any previous raid but the casualties were fewer. 11 of the enemy planes were brought down by our R.N.A.S. Many aerial fight occurred which were witnessed by thousands of Londoners. The weather lately has been a trifle wintry. Heavy storms followed by rather cool winds occurring almost every other day.\n\nBeassart","20":"\n\nAt 8 A.M. this morning the whole of the","21":" Inf. Bde marched into Henencourt (in drill order) and on to Henencourt Wood.\n\nwhere the 15th and 8th Bde’s were formed up. We reached our position at 11 \n30\n A.M. and were stood easy and eventually piled arms and fell out. At 11.30 A.M, punctually, the King arrived. Four drill companies which took part in the Divisional Sports on","22":" fixed bayonets and presented arms to the King and the","23":" Inf. Bde band played God Save the King. A very deplorable incident is attachable to this visit to the 5th Aust. Division by His Majesty King George V which cannot be mentioned here or in any other writing. \n\nHis Majesty watched several events amongst which was a very smart display by a battery of the 5th Aust. Divisional Artillery.\n\nHerissart","24":"\n\nToday we marched from our billets in \nHerissart\n Beassart to this village. Once again I find myself in a very comfortable billet. The town is a fairly big one and has the appearance of being at one time a \nb\n very prosperous place. Todays paper states that Bethman-Holwegg has been emptied out of his position by the Kaiser who has replaced him with one of his personal friends. The Russians have stopped as suddenly as they began and war news is at a premium not even an air-raid on London.\n\n \n\nHerissart","25":"\n\nToday is the anniversary of our Fromelles fight last year. Yesterday morning the14th Bde did a route march to Corby a distance of about 10 miles and billeted there for the night. Last night the streets were full of soldiers scrambling, staggering and singing. A disgraceful scene and the soldiers were Australians too unfortunately. They have absolutely no hold on themselves when the drink is about. The remarkable thing is, however, \nevery\n hardly a man fell out on the return journey though there must have been some very sore heads amongst them. It has been excellent weather for marching during the past week.\n\nHerissart 21\/7\/17\n\nThe British have had a reverse at Lombartzyde, the germans recapturing a little lost territory. This attack was sudden and cost\n\nus many men besides a good position. There were several reasons for this attack by the enemy. First he wished to upset our plan of attack in that area, second he wanted information, third something had to be done to attract the attention of the people from political affairs, and only a victory could do that, besides raising the morale of the troops, which had suffered severely in the Arras and Messines fighting. The Russians are still pressing on and the British forces in\n\nMesopotamia have advanced another 12 miles.\n\nHerissart 26\/7\/17\n\nOn the 24th inst 3 other officers and myself were taken per motor bus to Auchonvillers to witness a communication test carried out according to rules \non\n laid down on the subject by the 4th Army General Staff. A big crowd of officers from the 1st 2nd and 5th Divisions gathered at Auchonvillers Church \nwhe\n from which point we were taken over the communication routes and had the whole scheme explained by Lt.Col. Powell of Corps Head Quarters staff. \n\nYesterday I rode out with the Colonel, Major and Adjutant \n\nto the villages of Forceville and Varennes on what might be termed a phantom stunt. Positions having been laid out for each Battalion in the 14th Brigade to occupy and an enemy consisting of the 8th and","26":" Brigades were opposed to us and the various Battalion commanders had to give their opinions on the various situations which were supposed to \nhappen\n arise or would \nhappen\n in a “dinkum” stunt. They had also to give their company dispositions under various conditions. It having been previously ordained that our force would be driven back the day terminated with a victory for the enemy.\n\nThe French are getting some more\n\nof their own back on the Craonne Plateaux. Once more the plans of the Kronzprinz have been upset. \n\nHerissart","27":"\n\nGoodbye once more.\n\nAlways good bye. Happy days to be left behind and kind hearts to be put ruthlessly on one side. This is war. A future looms up on a vague horizon, full of grim times and enormous possibilities. When I \nlook\n think of days which are past and look forward to the future a half-expectant, half-fearful feeling possesses me. The horrors of the Somme during the winter have faded away into an unpleasant dream, through the glorious weather which has \n\n \n\nfollowed and is still with us. Who would have thought nature could be so bitter and yet so heavenly! The woods, the fields the gardens, the birds and every form of life all bear testimony to the goodness which has been stored up for us and then silently and quickly placed before us. So we move, but we move in good company.\n\nRumania has become offensive again and a tremendous artillery duel is in progress in Flanders.\n\nThe American troops are “training within sound of the guns”.\n\n \n\nRenescure\n Wardreque","28":"\n\nWe left Herissart about 12 midnight on","29":" entrained at Puschevillers and arrived at Arques about 12 noon on","30":" Cocoa was “on” at the Y.M.C.A. and after all hands had a drink we came on here to Renescure. The billets here are not nearly so numerous nor so good as in the Somme district and they are also very scattered. Today","31":" I went out in the direction of Cassell to renew some old aquaintances of last year which I had picked up during my month at","32":" Army signal School at \nTuyp\n Turqueene. I “bumped” into the","33":" Battalion on the way and saw a number\n\nof old faces there, also my cousin Herbert who had just returned from leave to England. The town of Cassell, always a beauty spot, looks even prettier than ever if that were possible; perched on the peak of the highest hill for miles around with its pretty houses and tree clusters.\n\nI reached the residence of my French friends about 1 pm and looked for a smiling welcome from the good lady and her husband who were so kind to me last year, but on making inquiries of Messieur (who came out to greet me alone) he told me that his wife had died just 3 months previously and his little daughter\n\nGabrielle had been sent to a school. He asked me if I would partake of some refreshment and I gladly accepted. Accordingly I was ushered into the dining room where a number of ladies \nwh\n were eating and talking (mostly talking) and I had to bring my pigeon French to bear on the subject.\n\nWar news today states that the British have advanced a considerable distance near Armentieres, each Army Corps having reached its first objective and one Army Corps has taken all of its objectives. The first objective is known as the Blue Line.\n\nA receipt for my Aust. War Loan Investment reached me today.\n\nNielles-Leef-Bequin","34":"\n\nWe rose yesterday morning at 4 a.m. had breakfast and were taken in busses to within a couple of miles of this town, arriving here per boot about 2.30 p.m. We had the first glimpe of our destination from a hill to the South East of the town. All that could be seen at first were the church spire and the red tiled roofs of a few houses; these were visible only because we were on a very high piece of ground and the village so low 1 – right in the bottom of a beautiful valley. The thick dark green foliage looked lovely and cool \nand\n; we \nentered\n entered the village \nthrough\n by a shady road and I judged by the\n\nappearance of the houses, people and streets that \nI\n it was about the cleanest and neatest village we have ever been in. On inspecting some of the billets and having a chat to some of the French people in my extremely bad French, I found that my judgement was correct. We have come here for \na\n four days strenuous training. Today we did a couple of hours march and after doing a “battalion in attack” stunt we marched back to billets. My Billet is situated on the top floor of an estaminet. When I entered yesterday I found a young mademoiselle vigourously scrubbing the washstand for my room. I assisted her to place it in a corner after which she adjusted a few little\n\nthings which really didn’t require any adjusting at all and then fled. This morning having to rise early I left things in a slight state of disorder. On arriving back this afternoon I found everything spick and span again. My room contains an armchair, two other ordinary chairs, two looking glasses (each of which distort \nthe\n ones face into the most horrible shapes), a washstand, a wash hand basin, a jug in a soap basin, tumbler, and another “contrivance”, \ntwo\n one table, a locker, and a bonser old bed with a comfortable spring mattress. All the beds which I have seen in France seem to be of a standard size and construction. They are all extremely comfortable\n\nFrom my window I can see a large row of tall bushy trees, portion of the street and several tiled roofs – I also have a \nper\n good view of the back yard. This window like most windows in France is made in two parts & each opens on hinges “doorwise”. This room has four walls which is usual in a room. On the left hand wall as I enter the room there hangs a plaster crucifix with a plaster saviour hanging thereon and the plaster figure of a woman kneeling at the foot of the crucifix. At the head of the bed, \nthe\n two pictures of pretty ladies in old fashioned dress quickly catch the eye. On the wall containing\n\nmy “outlook on life” hangs the two before-mentioned \nwindows\n glasses one above the other with a pipe holder in between. On the right hand wall as I enter are two religious pictures (one dedicated to a father and one to a mother I take it, by the writing). In between and a little below these hangs an alarm clock in a wooden frame into the top of which is fitted a \nwoo\n “thermometre” \nThe\n. All four walls are papered, the design on which is yellow leaves and blue flowers (something like a blue bell), looks very neat and pretty anyway. The ceiling is of plaster, a trifle cracked, into which is fitted over the \n\ncentre of the bed a contrivance for holding a mosquito curtain.\n\nA big meeting was held in Queen’s Hall, London, a few days ago to commemorate the third Anniversary of England’s Declaration of War. This meeting was attended by the Serbian and Italian Prime Ministers, M. Pasitch and H.E. Baron Sonnino.\n\nMr Lloyd George made a great speech, the chief statements in which were – Let us be the generation \nwhich\n that manfully, courageously and resolutely eliminated war from among the tragedies of human life. Before we enter into a peace conference the Kaiser and his Government must learn to utter the word “Restoration”\n\nto begin with, then we will talk \npeace\n. There was an end to the most horrible war but a bad peace went on staggering from one wall to another.\n\nAs for a workers and soldiers council in this country we could not allow a sectional organisation to direct war or make peace. That was the duty of a nation as a whole.\n\nLet us think steadily of the winning of the war.\n\nBoth\n eyes on victory\n\nNot looking \ncross-eyed\n for victory.\n\nThese phrases by the Premier were greeted with tremendous applause \nby the huge\n audience. M. Kerensky, Russia’s \n\nStrong Man handed in his resignation\n\nbut the Provisional Government refused to accept his resignation. M. Kerensky accordingly returned and was granted a vote of confidence. The condition of the Russian Army is still very serious, but the morale of the troops within the last few days has improved considerably and they are turning their rearguard actions into serious and determined counter attacks.\n\nMice have incurred heavy and serious losses in wheat in Australia through lack of bulk handling. This is due to a deplorable oversight of the Commonwealth Government. The question of Bulk handling\n\nof wheat has only just been put to \nall\n all state governments and each state has agreed except Western Australia, though why W. Australia’s refusal should hamper immediate remedy in the other states is a mystery.\n","35":"\n\nWe left Nielles-Leef-Bequin at 12 noon 9.8.17, marched to Lumbue a distance of about 5½ miles where we got on board Motor Lorries (driven by our own Australian Mechanical Transport men, and reached Arques about 3 p.m. the same day. From here we marched back to billets (a distance of about 7 miles) in Wardreque. Today our mess secretary\n\n \n\nleft us for an Army School and I have fallen in for the job. It is Sunday today and a glorious day too. The sky is blue with a few baby white clouds floating along \nits\n being impelled by a gentle breeze blowing from the North East. The farms are everywhere green and studded with various shaded green crops in different stages of maturity. The wheat crops have ripened nicely and the farmers are busy reaping and stooking.\n\nWardreque","36":"\n\nI attended C of E church parade this morning held on our Battalion parade ground, a paddock about 2½ kilos away.\n\nThe text of the sermon was taken from Jeremiah – the Potter, the wheel and the mud, God being the Divine potter and the world being the mud.\n\nThe sermon was clearly and cleverly delivered and illustrated the folly of a nation in putting God in the background\n\nDinner Smiles\n\nAn Australian on traffic control in Bapaume was hailed by another Australian who was passing with his Battalion, steel helmet on his head and full pack on his back, with – “How do yer get these jobs mate?” The Ozzy on traffic control, felt hat on one side of his head, cigarette in mouth, flag in hand with which he was waving the traffic through, absently replied, “came away early mate”. \n\nAn Australian on point duty one day saw an English Battalion approaching with a “cheerio” at its head. The officer rode up and \nasked\n said in the usual imperious manner\n\n“We want to go through heah.” “No traffic through here sir” was the reply.\n\n“Oh!” but we’re the \nguards\n” said the officer. \n\n“Don’t care if you’re the –??! Engine \ndriven\n driver you can’t \npass\n through here”. \n\nOf all the droll characters in the A.I.F. I think the cooks are the drollest? Dressed usually in a pair of dungaree, or khaki drill slacks, loose tunic (or none at all) about a weeks growth on their faces and covered with a greasy blackness from head to foot. As their time is occupied in cooking three meals a day and every day for the fellows, discipline amongst cooks gets rather slack.\n\nAn officer in the Division was one day passing a cookhouse and noticed one of the cooks vigorously stirring a rather doubtful looking “stew”. His mate was leaning up against the cooker cigarette in mouth staring at the officer.\n\nThe officer walked across to him and asked why he didn’t salute, the cook raised a black, unshaven face to the officer and said – “I’m a cook”.\n\nWardreque","37":"\n\nTonight we dined with our very excellent host, he having invited us all \nthe t\n yesterday, being his custom to have all officers in to dine with him at least once \nonce\n during their stay in the house – and it was some dinner. Plenty to eat, plenty to drink. White wind, red wine, lacure or coffee. The omelette was bonze, the soup, boshter, the roast meat and potatoes simply glorious, but the pudding contained a little too much brandy to be really nice. The cigars were the best I have every smoked and I slept like a top when I went to bed.\n\nWardreque","38":"\n\nLast Tuesday the old gentleman who owns the chateau in which we are billeted and which is also our Bn H.qrs invited the C.O. and two others, myself being one to a drive in his car to St Omer. It was a beautiful day and as the roads were good, the old chap who was driving himself, let the engine “out” and we sailed along at a great bat. We passed through the town of Arque on the way and saw a very ingenious contrivance which lifted barges holus bolus, from one canal level to a height of 42 feet\n\nfrom whence it drifted off \ndown\n on the new canal level. We found St Omer a large and busy town and after doing a little shopping and having had a look round we returned to the chateau. It was extremely kind of \nthe\n our host, but it seems he makes a practice of placing both himself and his car at the disposal of officers billeted with him for one day before they depart. We intend to get the Bde. Band down here one night, get up a good dinner and ask the old gentleman in to dine with us. He is very fond of music\n\nand has asked us on several occasions if we could have the band down here. But it is a job to get the band at all regularly as the Brig. only allows one in the Brigade and they cannot stay with one Bn. all the time but visit each in turn. Nothing cheers troops more than a good brass band. It’s grand. War news is still very good, Italians and French both being very successful so far. Enemy have been very busy about here lately bombing Hazebrouck a large and important town close by. Last night bombs were dropped on St. Omer. 10 civilians, mostly women and children being killed.\n\nWardreque","39":"\n\nYesterday, being secretary of our H.qrs Mess and the Mess corporal being sick I \nI\n went with the Mess-cart into the town of St. Omer to do some shopping, Saturday being market day or rather one of the market days in France. We drove through the town square about 8 a.m. and went straight on to the B.E. Force canteen. I found they did not open till 9 a.m, so I strolled about the botanical gardens, had a look at the varied and many beautiful flowers. Three beautiful swans were floating on a circular pond and presented a fine picture\n\nin such pretty surroundings. About 9.30 a.m. after a little trouble I presented my list of articles to the waiter in the canteen, collected my dry goods there and then proceeded to the market square to buy some vegetables. The square presented a great sight. On one side in a row stood carts, containing white pigs, squealing and kicking up a great row on their own. Then there was the numerous small boys lustily proclaiming to the world, the quality of a certain kind of potatoe cabbage or cauliflower and doing all they possibly could to bring business to their\n\nstall or basket of vegetables and so assist their mothers as much as possible. Women prevailed everywhere. Every article that could be sold in a shop almost, was here displayed to the public eye. Ironmongery, drapery, jewelry etc. I bought what things in the vegetable line I required, receiving much smiling criticism from some ","40":"\n English Nurses and then left.\n\nIn the afternoon the old gentleman here took three of us for a ride in his car to Aire, a very old and decent little town. We went inside the church and found it to be very \ndecently\n beautiful. Afterwards we witnessed\n\na most painful yet comical sight. Two Portuguese soldiers trying to drive a pair of mules. Each animal pulling against the other and propping with their front feet all the time. It was astonishing \nwhat\n how they managed to make any progress at all. We had a stroll round the town and saw in the window of a \nbutcher’s\n shop a \nphotographer’s\n advertisement. We then returned to the chateau spinning along at a great pace the Major driving. We had to stop once to allow the engine to cool.\n\nWardreque","41":"\n\nHeavy showers strong winds and burst of sunshine yet it is not cold.\n\nWardreque","42":"\n\nReceived a letter from a weak minded acquaintance \nreceiving\n requesting my views on the matter of his coming to France as he has a bad knee evidently, the result of about 18 months non-combatance? in Australia and England where he now is. He has never been to the front.\n","43":"\n\nLast night we were visited once more by a german aeroplane which dropped bombs in the vicinity of our chateau and also on St. Omer. He was given an enthusiastic reception by numerous anti-aircraft guns.\n\nOne bomb dropped on to a billet occupied by some men of this battalion. A piece of tile dropped on to a man’s head, giving him a slight wound. The R.S.M. said he had been “sniped \nb\n with a billet”. One bomb dropped alongside a 60 foot tree and on exploding lifted the tree roots and all, bodily, about 10 yards from whence it had been growing. So sudden must it have occurred that the tree top was snapped clean off and fell straight down into the hole from which the roots were blown. There is a good deal of speculation as to whether it was a bomb or a large shell fired by \n\na heavy \ncalibre\n calibre gun as such a gun has been firing on to Hazebrouck about 4 miles away, quite recently and evidently doing great damage as many inhabitants have left the town for a more peaceable part of the country.\n\nBologne","44":"\n\nYesterday morning the Assisstant Adjutant \nwas\n chased me up on parade and told me that a pass was waiting for me on the Orderly Room table for the United Kingdom. I dashed back to billet collected a few things, got my pass and got to Ebblinghem Railway Station as soon as possible. I boarded a train with a crowd of others at 12.24 A.M.\n\nWe reached the town of Bologne here after the usual pleasant? Train journey and I put up at the Hotel Louvre, ordering a bed for a very small fee and then went in search of a good “feed” which I got further afield (or should I say a village) anyway I had a good meal with an Irish doctor belonging to the 29th Division and an Aust Capt of the","45":" Div A.S.C. and “my head was like to burst when I had partaken thereof” and I had much difficulty in getting to sleep.\n\nHendon","46":"\n\nOn leave once more after a very pleasant trip across.\n\nSwanage","47":"\n\nArrived here yesterday in company of two of my Australian girl friends from Hendon. Had a bon sleep this morning and rose at 7.30. Had breakfast with the ladies at 8, went for a stroll along the sea front at 9 and afterwards took a carriage to Studland. It was a very pleasant drive through valleys bounded on either side by high and beautiful green hills; past patches of trees with their queer twisted branches and smooth trunks under which the bracken lay thick in pretty shades of gold and green,\n\npast quaint \nly\n thatched-roofed cottages with ivy or the beautiful Virginia vine clambering all over them. Clematis and fuschias grew in profusion in all the little patches of gardens. Here and there a velvety green paddock with sheep nibbling the short grass. Anon we pass a field in which bewhiskered old sports are tossing hay at each other and building very neat hay stacks. After a large supper we went for a motor drive out to Corfe Castle a distance of about 7 miles. The evening air was delicious. We drove along the high road all the way\n\nhaving a ripping view of the sea (on our righ rear when we cared to turn round,) and of the peaceful sweeping valleys. We found the castle in ruins and closed to all visitors. It is situated on the top of a large hillock in between two other hills from which it is alleged the castle was attacked in the days of bows and arrows.\n\nWe got back to Swanage at about 8 p.m. and went to the concert hall and saw a very good concert a trifle marred by a couple of local talent or rather asses chief of which was one called the Minstrel girl, who sang\n\nin a cracked voice and strummed a banjo at the same time \nwith\n finishing up with an absolutely impossible sort of dance.\n","48":"\n\nHired a carriage at 9.30 a.m. and went to Studland \nagain\n where we had a short and very select bathe, which made us all tired and sleepy. Whilst there I saw the prettiest pair of female legs it has ever been my fortune to gaze upon: short plump; with the most delightful turn inwards of the knees.\n\nThis afternoon we sat in deck chairs on beach at Swanage and criticised the\n\nvarious bathing bathing costumes and their wearers which happened to come within the range of our unmerciful vision.\n","49":"\n\nYesterday we drove over to Studland again to have a bathe, but it was trifle too breezy so returned and had lunch in Swanage. In the afternoon we went for a long motor drive out to Corfe Castle through Lyneham and Lulworth and back to Swanage again. The scenery around these places is simply gorgeous. The hills in many places covered with heather. Now and then on coming round a bend in the road\n\nwe would suddenly be confronted with a pretty little peep at the sea – between two pine clad hills, the lovely smell from which was almost intoxicating. This morning we took a car into Bournemouth for the day. It is a large town, though very uninteresting just now with the exception of the gardens which are a blaze of colour, beautifully laid out. Bournemouth can boast a splendid beach for bathing and \na\n very elaborate pier built on the same plan as the one at Swanage, only much grander. It is a big town: plenty of shops and fine residences which appear to be horribly\n\nrespectable. After being nearly bored? to death in the Westover Palace with a wretched show we returned to Swanage again, the air being just a \nbe\n wee bit too \nbracing\n to be really enjoyable.\n","50":"\n\nSaid au Revoir to my lady friends and caught the 12.45 train for Waterloo which station I \nwe\n duly arrived at on time 4.30 p.m. My stay at Swanage has been a very pleasant one indeed. The scenery being merely a sample of what old England can boast – and it is due to the kindness of my Australian – English friends that I have\n\nonce more been able to thoroughly enjoy my holiday from France.\n\nHendon","51":"\n\nToujours partie as an old french lady used to say to me. Back once more to sunny France?\n\n"}}