{"Document Name":{"0":"Diary_0390","1":"Diary_0390","2":"Diary_0390","3":"Diary_0390","4":"Diary_0390","5":"Diary_0390","6":"Diary_0390","7":"Diary_0390","8":"Diary_0390","9":"Diary_0390","10":"Diary_0390","11":"Diary_0390","12":"Diary_0390","13":"Diary_0390","14":"Diary_0390","15":"Diary_0390","16":"Diary_0390","17":"Diary_0390","18":"Diary_0390","19":"Diary_0390","20":"Diary_0390","21":"Diary_0390","22":"Diary_0390","23":"Diary_0390","24":"Diary_0390","25":"Diary_0390","26":"Diary_0390","27":"Diary_0390","28":"Diary_0390","29":"Diary_0390","30":"Diary_0390","31":"Diary_0390","32":"Diary_0390","33":"Diary_0390","34":"Diary_0390","35":"Diary_0390","36":"Diary_0390","37":"Diary_0390","38":"Diary_0390","39":"Diary_0390","40":"Diary_0390","41":"Diary_0390","42":"Diary_0390","43":"Diary_0390","44":"Diary_0390","45":"Diary_0390","46":"Diary_0390","47":"Diary_0390","48":"Diary_0390","49":"Diary_0390","50":"Diary_0390","51":"Diary_0390","52":"Diary_0390","53":"Diary_0390","54":"Diary_0390","55":"Diary_0390","56":"Diary_0390","57":"Diary_0390","58":"Diary_0390","59":"Diary_0390","60":"Diary_0390","61":"Diary_0390","62":"Diary_0390","63":"Diary_0390","64":"Diary_0390","65":"Diary_0390","66":"Diary_0390","67":"Diary_0390","68":"Diary_0390","69":"Diary_0390","70":"Diary_0390","71":"Diary_0390","72":"Diary_0390","73":"Diary_0390","74":"Diary_0390","75":"Diary_0390","76":"Diary_0390","77":"Diary_0390","78":"Diary_0390","79":"Diary_0390","80":"Diary_0390","81":"Diary_0390","82":"Diary_0390","83":"Diary_0390","84":"Diary_0390","85":"Diary_0390","86":"Diary_0390","87":"Diary_0390","88":"Diary_0390","89":"Diary_0390","90":"Diary_0390","91":"Diary_0390","92":"Diary_0390","93":"Diary_0390","94":"Diary_0390","95":"Diary_0390","96":"Diary_0390","97":"Diary_0390","98":"Diary_0390","99":"Diary_0390","100":"Diary_0390","101":"Diary_0390","102":"Diary_0390","103":"Diary_0390","104":"Diary_0390","105":"Diary_0390","106":"Diary_0390","107":"Diary_0390","108":"Diary_0390","109":"Diary_0390","110":"Diary_0390","111":"Diary_0390","112":"Diary_0390","113":"Diary_0390"},"Date":{"0":"unknown","1":558.0,"2":559.0,"3":563.0,"4":567.0,"5":568.0,"6":571.0,"7":572.0,"8":573.0,"9":575.0,"10":576.0,"11":577.0,"12":578.0,"13":581.0,"14":582.0,"15":583.0,"16":584.0,"17":588.0,"18":589.0,"19":600.0,"20":601.0,"21":604.0,"22":606.0,"23":607.0,"24":608.0,"25":609.0,"26":610.0,"27":611.0,"28":612.0,"29":613.0,"30":614.0,"31":615.0,"32":616.0,"33":617.0,"34":618.0,"35":620.0,"36":621.0,"37":622.0,"38":623.0,"39":624.0,"40":625.0,"41":631.0,"42":632.0,"43":633.0,"44":634.0,"45":635.0,"46":636.0,"47":637.0,"48":638.0,"49":639.0,"50":640.0,"51":641.0,"52":642.0,"53":643.0,"54":644.0,"55":645.0,"56":646.0,"57":647.0,"58":649.0,"59":650.0,"60":652.0,"61":654.0,"62":655.0,"63":656.0,"64":657.0,"65":658.0,"66":659.0,"67":660.0,"68":661.0,"69":662.0,"70":665.0,"71":666.0,"72":667.0,"73":668.0,"74":669.0,"75":670.0,"76":671.0,"77":673.0,"78":674.0,"79":675.0,"80":676.0,"81":677.0,"82":678.0,"83":679.0,"84":680.0,"85":681.0,"86":682.0,"87":683.0,"88":686.0,"89":688.0,"90":689.0,"91":690.0,"92":691.0,"93":692.0,"94":693.0,"95":694.0,"96":698.0,"97":708.0,"98":709.0,"99":715.0,"100":716.0,"101":721.0,"102":722.0,"103":723.0,"104":737.0,"105":744.0,"106":745.0,"107":755.0,"108":776.0,"109":777.0,"110":778.0,"111":779.0,"112":839.0,"113":840.0},"Entry":{"0":"\n\n","1":" – Rough sea all day with strong head wind. The latter has been encountered all the way – things not all violets aboard – being very damp slept below in consequence.\n","2":" – Reveille sounded to the tune of a howling gale with heavy rain and a high sea. Shipping heaps of water down mess deck. Great amusement amongst men who by now are beginning to get their sea legs. At about 8.30 a.m. a great rain-storm appeared on the western horizon and travelling with great rapidity soon enveloped the approaching ship in a dense cloud of rain, hail, and brine. The wind blew with hurricane force but the good ship \"Berrima\" stuck to her task. The disturbance passed as quickly away as it had meteorically appeared and within the space of 15 minutes had disappeared eastward leaving us panting on the surface of the cruelly beaten sea.\n","3":" – A pleasant day on the calm bosom of the Indian Ocean. A gentle S.W. zephyr did little to disturb the tranquility of the day. The blue dome above was unflecked by clouds and reflected itself unsparingly in the unruffled water. A lazy swell which to the troops had the effect of a sweet lullaby on a new-born child predominated throughout the day. One accident marred the day – we lost our mascot \"Miss Wallaby\" overboard. Whether this be an ominous sign we do not know – at any rate her loss was soon forgotten which spells much for the optimism of the troops.\n","4":" – Another hot day – calm sea – awnings necessary on 'well' and boat decks. Boxing contest \"B\" Company in the afternoon. Colonel Lamrock and other Officers present. Some good \"stoush\" with a minimum of skill. One clean knock-out. Despite the uneventful voyage with its monotonous daily life, the troops display a remarkable buoyancy of spirits. Whether they realise the seriousness of the work before them in a few weeks, they do not show it by their attitude on board. One would think they were on a huge picnic or harbour excursion. Their happy disposition speaks volumes for their heroic self-sacrifice for the great cause.\n","5":" – Rose at 4.30 a.m. The stars shone white, and as dawn broke across the placid surface of the ocean I felt a new self arise in me – the morning was so peaceful and majestic. The sun as it arose threw a golden glory over the distant horizon, and finally appeared in a great white disc in all its glittering heat. A ragged edge of clouds, low down, burned like red-hot coals, and the sea between the ship and the distant flaming orb became a molten mass, magnificent in its grandeur and at which the eye could \nbut\n gaze but for a second, so powerful was the sheen. A new self – yes, \"like dead scales the superficialities, the falsities, the habits of the life of the world I have left behind seem for the instant, whilst I gaze upon that awe-inspiring scene, to drop from me. Romance and a keen observation of beauteous nature engendered and fostered in me from that moment a feeling of love for all things beautiful and serene, and I offered a silent prayer to heaven that I was alive to appreciate the mighty splendour of that glorious sunrise.\"\n","6":" – Anniversary of establishment of French Republic and fall of the Bastile. Half holiday on board.\n","7":" – Fresh westerly with heavy swell. Boxing semi-finals on\n\nAt Sea\n","8":" – saloon deck. Rough conditions at night. Saloon deck port side frequently awash. Slept below – bad night – ship rolling heavily. About 4 a.m. all awakened by a terrific thump on ship's side and scattering of crockery, plates, boxes, and other gear. Many thought it was a collision so great was the noise. When we rose at reveille the mess-deck was strewn with a mass of gear – tin plates, knives, forks, cups, cheese, butter, clothes, etc. In fact, everything had been shifted by the impact of the night.\n","9":" – Hellish weather – monsoon – decks awash all day. As we approached Gulf of Aden then we received the full blast of the terrific wind and storm wrack – great green seas came at us as if determined to envelop us in one huge swallow and thumped down on the deck every minute or two like mighty knocks from a gigantic hammer. The ship alternately rolled and pitched and the storm continued late into the night.\n","10":" – Approaching Aden. Hot close evening. Ships in the night – flashlights, signalling, and shore fires. Passed through \"Hell's Gate\" at about 3 a.m. Received first wireless that General French had reported that Germans were active on the French Frontier and had gained trenches but had been repulsed. Message posted on saloon deck at about 8 p.m. Dated \"London Official","11":" 1915.\"\n","12":" – In the Red Sea – calm – muggy and sticky atmosphere. Passed the \"Four Brothers\" and \"Twelve Apostles\" during day – the former on African side, the latter Arabian side. How awesome and grand are these lone sentinels of the Red Sea. Barren, huge rocks rising in pyramidical shape for the most part and towering into the sky.\n","13":" – Cooler weather. Pleasant head wind. Evening brought us in sight of African coast and Sinai on the east. How particularly awe-inspiring are these glimpses of historic landmarks. The aspect of the country is volcanic, and its rugged bareness and dull brown color vividly contrast with the bright blue sea and dashing foam. Sinai, for instance, commencing low-down rises in irregular slopes till its summit reaches to the very heavens. What food for thought and quiet muse for the dreamer!\n","14":" – Arrived at Port Suez at 9 o'clock. What a picturesque change! What magnetic charm has this first glimpse of this new life to me. The rippling surface of the port gleams with opalescent beauty, and the yellow sand dunes contrast vividly with the changing hues of the heated atmosphere. A weird and bizarre mountain lies on our left and ahead, \nand ahead,\n a quarter of a mile off, is the Town of Suez, its buildings resting low upon the water. The port is full of shipping and everything around us is life.\n\nThis contact with civilization has put good humour into the troops. In full service dress they crowd the rails and bargain for fruit, sweetmeats, etc., with the miscellaneous crowd of Arabs and other dusky-skinned desert sons who have tied their boats to the ship's sides. How happy and contented I feel. My whole soul harmonises with the perfect serenity of the scene around me. What a picture for an artist to conceive or put to canvas! Not a wisp of cloud mars the blue dome overhead, a soft zephyr plays and gambols around us, just sufficient to temper the hot sun's rays and cause a dancing ripple upon the sea. Near us the water sparkles in light blue and as the eye travels towards the shore becomes darker and finally ends near the golden sands in an infinite royal blue. My opinion of \"far-fetched\" paintings has changed. I have looked upon a picture more dazzling in its varied hues than any master painter could conceive.\n\nAs noon approached the cool wind of the morning was consumed by a boiling sun and from then till sunset the heat was unbearable. Evening, however, brought the pleasant conditions of the early morn.\n\nEgypt\n","15":" – Disembarked inside breakwater (Port Suez) at about 9.30 a.m. With a squeaking and grinding of wheels we moved out into the desert … the land through which we travelled appeared to be thoroughly irrigated and exceptionally fertile. Passing through huge palm groves, fields of maize and other cereals, I was sensibly appreciative of the industry shown by the inhabitants in their attempt to turn the arid desert to some use. We arrived at Heliopolis at about six o'clock.\n","16":" – Reveille at 5. Helipolis, I find, is regarded by the natives as a Holy Town. What a mixture of humanity is here! – Arabians, Soudanese, French, Italian, Swiss – in fact, all the polyglot crowd of Northern Africa. What a shrill cacophony greets our ears – the bargaining natives swarm round us with their goods and exhort us to buy at extravagant prices. As we sit at breakfast, small Arab boys, dirty and ill-clothed, cry for \"bachsheesh\" and grovel and scramble in the dust for cigarette ends.\n\nCairo\n","17":" – Visited Cairo during afternoon. This Hell or earth, alluring and repulsive in its vice, crime and tartuffism, cannot be described here. Enough to say that prostitution, beastiality, drunkenness and crime are its chief characteristics. All the sinister temptations lurk here to catch the unwary. Sordid and debauched, Cairo is a pestilential cesspit, a creator of evil, and a destroyer of souls.\n","18":" – How wonderful is the fascination of the place! Though nauseating beyond description, something draws you on, and so the Master Fiend finds plenty of victims. His greedy talons are about everywhere.\n","19":" – I write by dull candle light in the dark shades of our tent. Around me my comrades earnestly discuss the chances of the future and their serious faces and talk alternately merry, happy-go-lucky, and lurid in its expressiveness, betray their determination to carry things out with a big heart and to the end – \"Do or die\" is our motor.\n","20":" – Rumours and rumours of war. The whole camp is seething with excited expectancy. \"Off on Sunday\" is The General thing.\n","21":" – Entrained at Zeitoun – embarked on s\/s \"Saturnia\" – left Alexandria about 9 p.m.\n\nAt Sea\n","22":" – This morning I am struck by the extreme calm and beauty of the blue Mediterranean, and how peaceful a scene it must be to the roaring torment of war which is being raged not many miles ahead. To-day we are at rest \"on the calm bosom of a summer's sea\" – to-morrow, aye, to-morrow, perhaps the dread torpedo will send us to the bottom unwarned. A great risk, but how great is the spirit of our troops. Happy and debonair, they sing like so many larks on a bright April morn and their hearts are big and strong.\n\nLemnos\n","23":" – Arrived at Lemnos at daylight – a hive of shipping – warships, troopships and merchantmen.\n","24":" – This morning I have counted over 100 ships at anchor in the Bay – Mudros Bay, as it is called. It appears from the ship to be a circular bay of good proportions. The shore line is mostly tenanted by the military … the bay forms an excellent base.\n\nLeft Mudros at 5 p.m. for Gallipoli on s\/s \"Osmanieh\". Arrived at Anzac at about midnight. Long before our arrival we could distinctly see the flash and hear the roar of the big guns fired from the warships off shore. It was a clear moonlight night, we were \"all lights out\" and we sped along the surface of the moonlit sea like a black phantom of the night. Quite\n\nLemnos\n","25":" – distinct to our silent secrecy were the hospital ships, flamboyant with their rows of green lights and huge red crosses, and their reflected beauty in the unruffled sea enhanced the charm and serenity of the night. Serene from the artist's standpoint, but from the material disturbed by the evidence of the proximity of grim war.\n\nWe were bundled ashore in lighters attached to steam pinnaces and soon we landed at the primitive pier where our brave heroes first landed and distinguished themselves as amongst the greatest soldiers in the world.\n\nGallipoli\n","26":" – On awakening my eyes were crusted with dust and my parched throat cried aloud for relief. The country around us bore a remarkable appearance. Camped in a tortuous defile of narrow proportions (known as \"Rest Gully\") with high broken hills of crumbling sun-baked sand and soil, devoid of vegetation except for a few isolated patches of stunted prickly gorse, the whole scene at once conveyed to me the enormous difficulties and risks of the great task of our brave comrades who participated in that glorious charge. All the night through I slept with \"one eye open\". My active brain ran riot and I was aflame with excited interest in my new surroundings. The boom of big guns, the sharp rattle of machine guns, the ping and singing of bullets overhead and the screech of shells soon became familiar sounds and I was thunderstruck at the equanimity with which the troops accepted their new life. Our greatest pest here, outside snipers' bullets, is flies. They swarm around us in myriads and are aggravatingly persistent. The more you irritate them, the more they attack and stick. They leave us as night falls, but are with us again at daybreak.\n","27":" – The gallant 18th (5th Brigade) were in action on Sunday night and Monday and suffered severely in an attack on a strongly defended hill. After taking five lines of trenches they were forced to retire and held two, owing to their being outnumbered. They would have scored a decisive victory if sufficient reinforcements had arrived in time. Captured Turkish Officers state that the Turks are willing to come to terms immediately but for the domineering German Officers who urge them on and tune them up with persuasive lies of Germany's victories on land and sea. I have seen the Turkish rifle and bayonet – the former is lighter than our own .303 and the magazine is fixed, holds only five cartridges, there is no cut-off, and no safety catch. The bayonet is much shorter, like a dagger, but the bayonet standard is fashioned after our own.\n","28":" – A day of startling incidents. Daylight was ushered in by a violent cannonade from shore howitzers and hill batteries. The Turkish reply was at first very slow but as the morning progressed they commenced to get the range with shrapnel and landed alternately on the beach and hill very frequently. The damage, however, was insignificant.\n\n26:7:15 – \"Rest Gully\" is becoming very dirty and a harbour for vermin, rats, cockroaches and other lively and multitudinous insects. The dug-outs and terraces with which the limited confines of the place are adorned are filthy with camp refuse and being the continual habitation of so many soldiers moving in and out has converted some parts of it into veritable dung-heaps and rubbish tips. to date the good old 20th has suffered seventeen casualties. We moved out again at 7 a.m. and taking a circular move from the bottom of the Pass ascended a narrow mule track till we gained the trenches on the heights. (Russell's Top). Here we found the 8th Light Horse whom we were to relieve. The trenches are an intricate maze and bear evidence of the patient and arduous work of the sappers. From the hill we command a magnificent view of the sea, ever still and opalescent. Destroyers steal silently in and out the bay and the guns of battleships, shore howitzers, and fixed batteries, roar in concert. Aeroplanes are active on reconnaissance duty.\n\nGallipoli\n","29":" – Re the 8th A.L.Horse. Whose pen can adequately describe the dread tortures of war this gallant body of men have suffered. Thirteen to fifteen weeks ago they entered the firing line with big and stout hearts – men in their physical prime and buoyant with enthusiasm and nerve. To-day they are a battered and torn regiment – they have lost their belly – it has been knocked out of them. They have done all they could against great odds – they have proved themselves heroes. Contrary to my expectations they do not go on furlough, but are being moved to another post in the field of operations.\n\nRussell's Top (Walker's Ridge) on which we are now stationed has been the scene of heavy and severe fighting. From here the","30":" made their disastrous sortie. The Turk has become very saucy in his trench fighting, which game he plays \"par excellence\". He is using a captured French seventy-five to great advantage. We receive a peppering every morning and evening from this gun. It creates great havoc and blows trenches sky-high. This gun gives you no warning – it comes on you like a thunder clap, plugs into earth or stone three feet deep and roars like forty elephants run amuck. Our fellows in the front trenches are suffering and undergoing great trials. Perhaps their worst enemy is the unendurable stench from the Turkish trenches where the bodies of our heroes are rotting side by side with those of the enemy. Our sappers complain bitterly of the stench and many of them have given up sick at heart and physically overpowered. Many of the bodies are maggotty and eaten away by ants and other vermin and the nauseating odor floats through the trenches with the evening breeze in stifling intensity.\n","31":" – There has been fierce fighting on the left flank in the vicinity of Chocolate Hill and \"W.W.\" Hills. The attack was made at 4 p.m. and was covered by naval artillery. It raged for fully two hours. I had a full view of the battle. Terrific and terrible in its realism, the more I gazed upon it and its dreadfulness, the more I was convinced of the folly of war. There has been many such conflicts of late and the wearing down power of successful resistance is becoming each day more intensified. It has now resolved itself into a struggle of the trenches. Our main strategic objective is to cut off the Turkish supplies from the north to the south, and so it is a game of patience and stamina. It is like hacking at the middle of a great trunk of hardwood and our forward movement must necessarily be laboriously slow.\n","32":" – I made a round of the trenches here (Walker's Ridge) yesterday afternoon. Everything is in apple-pie order. The men are happy and contented and for raw soldiers display remarkable nonchalance in the dangers around them. Machine guns spit their deadly pellets into the walls everywhere, the big seventy-five plugs into earth and rock and roars like thunder, yet our fellows spread their blankets out in dug-outs and in the open and sleep as peacefully as new-born babes. These trenches perched on the summit of a conical hill, 200 feet above the sea level, represent to me a 'township' as I have conceived existed in pre-historic days. We crawl in and out our dug-outs like moles, and we sleep and eat in dust. Some of us have accumulated beards of grotesque proportions and many have a striking resemblance of two-footed creatures I have seen in sketches portraying the days before Adam. Yet we are all in fighting mood and strong as horses and glad of the opportunity to get at the enemy.\n\nIt is fitting to pay a tribute to the unremitting attention which the Authorities have paid to hygiene. All latrines and suchlike conveniences are under the constant observance of a \"fatigue\" party and are daily disinfected or freshly dug so as to preserve to the utmost the good health of the soldiers. In fact, I have smelt less obnoxiousness here than I did at Liverpool in this regard.\n\nThe weather is now becoming cooler – the heat of the day is tempered by soft zephyrs from the Gulf of Saros, the changeless blue of its mirror-like surface ever smiling and glistening in the bright rays of a perfect golden sun.\n\nGallipoli\n","33":" – Towards early morn a light dew descends and heralds the close approach of winter.\n","34":" – Sent to Australian and New Zealand Divisional Headquarters and taken on Divisional Staff as Clerk to Colonel Braithwaite, D.S.O. (General Staff Officer,","35":" Class).\n","36":" – Have just heard that the troopship \"Southland\" has been torpedoed on her way here with some of the 6th Australian Infantry Brigade on board. The Officer Commanding was drowned.\n\n4:9:15 – Later intelligence re \"Southland\" is that when torpedoed the men took to the boats. They afterwards retook to the steamer, which was able to steam to Mudros. The Brigadier died from exposure and the casualties totalled only 19.\n\nI am now surrounded with Generals, Colonels, Majors, and all the elite of military officialdom. Generals Chauvel, Russell & Godley met last night and exchanged confidences. The breezy chatter of these gentlemen reached my ears frequently, and General Chauvel was not loth to borrow matches from me, for which he thanked me with abundant courtesy.\n\nI caught the following from a little breezy humour exchanged between General Chauvel and a few other of his contemporaries –\n\nGeneral Chauvel: Have you any matches, Pinwill? – No. (turning to me) Rhodes, just give The General some matches, will you?\n\nColonel Essen: How are you getting on for feed, General? - Oh, so-and-so, I could relish some juicy roast beef and green peas.\n\nChorus: Ha! Ha! Ha!\n\nMajor Doddington: What has happened to all our correspondence and \"billet doux\" lately?\n\nGeneral Russell: I am afraid mine has perished on the high seas.\n\nMajor Pinwell: I received several parcels to-day, tobacco, damn it. There might have been some lolly or cake. Oh! by the way, Kettle (to a young Staff Officer distinctly \"militaire\") Don't forget tea at 4 p.m. to-morrow, and some cake.\n\nKettle: I shall be punctual to the minute.\n\nGeneral Godley: (in the distance) Can't you get some beer or porter, Ryrie? (to his Aide-de-Camp) - Yes, Sir.\n\nThe General: Well, get it, my dear fellow, get it.\n\nKettle to Doddington: When did you have a bath last. I had one on the Hospital Ship this afternoon.\n\nDoddington: How delightful – but it is so long ago since I enjoyed that luxury I would consider it sacrilege to put my clothes on again if I had one now.\n\nThe Administrative & Executive control of the New Zealand and Australian Division has been entrusted to Officers of the New Zealand Forces, of whom The General Staff is entirely composed. Gentlemen all, and indefatigable workers, ever courteous amidst an ever-flowing rush of arduous duty, they have tackled and borne this huge responsibility with untiring zeal and uncommon skill, and the splendidly organised system which they have now set up is indisputable evidence of their fitness for the job.\n\nH.M.S. \"Endymion\" shelled the \"Nek\" and portion of Battleship Hill near Walker's Ridge at 5 this afternoon. She stood well into the beach.\n\nOfficial news re attack on Hill 60 (dated","37":" 27th to 29th August – Hill 60, a little to the north of Kaiajik Aghala:-\n\nGallipoli\n","38":" – \"The attack was entrusted to Major-General Cox, on the right by 350 rifles of the 4th and","39":" Australian Brigades, centre by 400 rifles of the New Zealand Mounted Rifles and","40":" Australian Brigade and on the left by 250 rifles Connaught Rangers. The bombardment commenced at 4 p.m.,","41":" and at 1 o'clock in the morning of the 29th the Australian Light Horse carried the trench on the top. The fighting throughout was almost entirely hand to hand and of a very severe nature. The shrapnel fire and machine guns of the Turks were terrific. Casualties – about 1000 – Turkish losses 5,000, with 300 rifles, 60,000 rounds of ammunition and 500 bombs. By this success 400 more acres of Turkish territory was added to the country occupied by Anzac.\"\n","42":" – According to French Official Reports the number of German Officers killed, wounded and missing from the beginning of the war to 1st June 1915 was 43,992. These losses had increased to 52,041 by","43":" July, showing an increase of 9069 in 45 days or 360 Officers per day.\n","44":" – The position has now been unchanged for days. We need strong reinforcements to settle this question. This desultory fighting is no good. The Turks are improving their position day by day which will soon again be impregnable. After all we are only along the sea shore, so to speak, whilst they hold the commanding positions. We must have greater numbers before any forward movement can be attempted. The old hands here all require a rest and are utterly wearied and complaining among themselves. This is bad for morale. The Authorities recognise this and have sent away during this week the New Zealand Mounted Rifle Brigade, the New Zealand Infantry Brigade and others to Mudros for a month's spell. The","45":" Australian Infantry Brigade have taken their place. This Brigade is formed of Queenslanders and Tasmanians.\n","46":" – This afternoon the Turks made a brilliant demonstration all along the Army Corps front. There was no attack, however. There was heavy shell firing in the direction of Suvla and for an hour the roar of guns and incessant rifle fire rent the atmosphere. I have noticed lately the Turkish superiority at concealment, and this is a standing reproof to the discipline of our own army. The Turks are very seldom seen and carry on their extensive defensive operations with wonderful celerity and quietness. They are up to all the ruses under the sun – dancing towards our lines; approaching front trenches with hands raised above their heads and then suddenly collecting together and rushing trenches: dressing in our uniforms: bomb ruses – instantaneous fuses, etc.\n","47":" – A Turkish deserter – Ismail Mahomet Ali – 5th Company, 2nd Battalion,","48":" Regiment, was brought in to-day. He appeared to be in good health but complained of sore feet. He was wearing only thin shoes and was dressed in a khaki cloth jacket and trousers with a soft cap. I would say he was a middle-aged man. Examined, he said he came from a vilayet of Smyrna, but that he was \"fed-up\" with fighting, like a lot more of the Turks in his Company. He said the Turks had heaps of food and water, brought up by mules and then into the trenches by fatigue parties.\n","49":" – London Sept. 16, 1915 – Mr Tennant stated in the House of Commons that the total British casualties for the first year were – Officers, killed 4,765, wounded, 9,933, missing 1500: Men, killed 70,992, wounded 241,086, missing 23,466 (vide Peninsula Press 20th Sept. 15).\n\n22:9:15 - \nDiscipline\n: (vide General Routine Orders issued from General Headquarters, Mediterranean Expeditionary Force","50":" – No. 19912 Private Cogan, 6th Bn, Royal Inskilling Fusiliers and No. 5\/17911 Private J. Smith, 5th Bn. Royal Irish Fusiliers, having been convicted by Field General Court Martial of the offence of\n\nGallipoli\n","51":" – sleeping on their posts are sentenced to 10 years penal servitude. The Commander-in-Chief has confirmed the proceedings and directed that the sentences shall be undergone forthwith.\n","52":" – General Godley returns from Mudros, accompanied by Lord Charles Bentinck and Captain Herbert. Talking about live Lords etc., I have also seen the Marquis of Anglesey who is aide-de-camp to General Birdwood. He wears navy-blue putties. Lord Charles; brother, Lord Henry, called during the afternoon, and scribbled a note to Lord Charles. He is not my idea of a real live lord – in fact, I first took him for a lost \"Tommy\" come to ask his way.\n","53":" – We have now taken up our winter quarters in Otago Gully, a narrow-gutted hollow forming an admirable cul-de-sac for enfilade fire from the north. The camp, with its excellently built 'Offices' and adjacent sleeping quarters, is a tribute to the skill and zeal of the men who composed the working party, but I am afraid too much attention has been paid to detail. The result is that a very elaborate target now presents itself to the enemy – the brow of the gully is crowded with dug-outs, whilst the \"eyebrows\", viz., the western slope is adorned with the multitudinous premises giving accommodation for The General Staff. The whole show is one huge yellow sandbag patch. Aeroplane reconnaissance is such a feature of Turkish warfare, it is surprising to me that such a great flamboyancy was not prohibited. Only yesterday, recognising the need of dealing or doing something with enemy aircraft, each Division has been detailed by the Army Corps Commander to allot special machine guns on prominent points to watch for the Taubes. They have become very cheeky of late and fly quite low.\n\nThe present stagnation is depressing in its regular monotony. From all centres comes the never-changing report \"situation quiet\". Those in the front trenches do certainly have to keep on the \"qui vive\" for bombs and snipers, but otherwise it seems to be a question of who can last the longest. Both sides seem to be content to \"dig themselves in\", and watch and wait for events. It seems to be a mutual arrangement. The Turks are busily improving their works and are stubbornly entrenching themselves. This inactive life is bad for morale. A soldier to be a soldier needs to be incessantly on the move, fighting the common enemy, or if not fighting him, continually aware that he is not for a moment safe. In this struggle the singing of bullets and the bursting and roaring of \nbig guns\n shrapnel and big guns should never be lost to the men. If the enemy display no desire to fight, then they should be made to fight. The men should be kept at it, with due respect, of course, to their physical nourishment in the way of food and rest and not allowed to \"linger by the wayside\" for a month or two in comparative idleness. By it they lose the sound of battle, they acquire, as it were, a growing sense of security, and so when the pinch comes to go in and win out, their nerves won't stand the strain, the transition has been too severe, too sudden, and they have therefore lost their former sting.\n","54":" – A clever piece of work on the enemy's part is reported from Lone Pine. On one part of our line several periscopes and periscopic rifles were hit. On close inspection of the ground a sack was noticed half-way between the enemy's trenches and our own. This sack was seen to move and finally two sacks with men inside were made out. The sacks were fired on and the trouble ceased.\n\nWe receive daily War Office Telegrams, printed in excellent style on superfine paper, whilst a sheet called the \"Peninsula Press\" also comes along at regular intervals giving us news of the progress of European events. This interesting printed matter is turned out by the Royal Engineers' Staff at Imbros,\n","55":" – My dug-out is finished and is an excellent type of the sandbag shelters used on the Peninsula. I am beginning to find\n\nGallipoli\n\n26:9:15 – work more congenial, though the days drag somewhat at times. In fact, the same dull routine is repeated every day and the country has acquired an air of quietness relieved only now and again by retaliation rounds which are the only indication that we are actually at war.\n\nThere are two things worth living for in this world – love and war. The worst of it is that you cannot materially enjoy both at the same time. Experience has taught me the bitter truth of all this. When I talk of war or its attractiveness, I don't refer to gay and happy regiments marching along to the accompaniment of brass bands or the soul-stirring notes of the bugle and the medley of fife and drum – I allude to the roar and thunder and clash of arms of the battlefield, of the silent secrecy of bayonet attacks under cover of darkness, when cold steel finds a resting place in the quivering breasts of a thousand an one of our enemies, to the shambles of death which a bright morning reveals in some quiet verdant hollow where the bodies of our brave comrades and those of our enemy lie inextricably mixed, to be tossed into a common grave \"unhallowed and unsung\". It may appear somewhat paradoxical that these things should be so loathsome and yet so attractive – the answer is simple, yet irrefutable: the men go on and they love it all. The ethics of it I cannot explain. Considered from the true Christian standpoint war is bad: there is nothing in it compatible with biblical law. In battle the savage beast is uppermost and our one desire is to slay. We are urged to kill and so legitimate murder goes on. On the other hand, considered in the practical light of these practical times war is inevitable and right. And so long as the German and any other of his kidney are allowed to wallow in the mire of their own conceit that they can rend and subdue the nations of the earth by rapine, pillage and the murder of innocent souls, so long will it be our duty to teach them otherwise – and that can only be accomplished by means of cold steel and shell and all the dread implements of modern warfare.\n\nA redeeming feature about this love of war is that it creates a love for home and dear friends so far away that one has hitherto unknown. It certainly teaches the lesson to appreciate the comfort and serenity of home life, and is an excellent appetizer for the good things that a safe return will bring. Home will be like entering the gates of Paradise after a long sojourn in Hell. I often sit and think of the things that have been, the things that are and well – the chances of the big gamble of life and death ahead. Daily association with modern war is a strict censor of a man's soul and brings the best out of him, if he be willing.\n\nThis stupendous task in Gallipoli is a nerve-trier unparalleled in the history of warfare. Isolated from all civilisation, living in holes like rabbits in their burrows, with none of the comforts of the \"billeted\" soldier in France or his opportunity for relaxation, and not a moment of the day secure from the enemy's aggressiveness, we live on and hope – there is no backsliding, sickness is rife and danger is on every hand, but the morale of the men is unshaken. Victory is ahead, and it is their sole objective.\n\nWe received a 'peppering' of shrapnel at teatime. It knocked out the wireless and killed one poor chap instantaneously, not a dozen yards from where I stood.\n","56":" – (See Eiffel Tower report and War Office Telegrams dated","57":" re French and British successes in France). All this good news sent me whistling about the 'Office', but I was promptly hauled up by the Major (Pinwill), who fired at me, \"Stop that, Rhodes, it disturbs the equanimity of the Office.\" And I was not surprised, for whistling was never my forte.\n","58":" – Ordered some Turkish Delight per favour of our Greek interpreter who is visiting Imbros.\n\nGallipoli\n","59":" - \nRe Aeroplanes:\n - The Turks show a black Maltese Cross on the planes – the Allies varied-colored circles – some red and white etc.\n","60":" – Warm weather has prevailed during the last two or three days, with heavy fogs in the early morning. The flies are terrific. The evenings are pleasant, calm and quiet, with an unchanging canopy of stars in a violet sky.\n\nThe Turks are indefatigable workers – whether they are driven to it at the point of the revolver I do not know, but it is a fact that they can convert a barren position in a night into a nest of trenches and covers. My belief is that they have special \"digging\" battalions. Their snipers, too, are remarkable. They are in every conceivable nook and cranny, and it is difficult at times to realise how they live in such positions as they are found. They are a harassing factor in the operations of our fatigue parties by day and night.\n","61":" – General Godley goes to Mudros to inspect troops. The Turks broke the ice this morning with a \"demonstration\" on the \"Apex\":- about 9 o'clock fairly heavy rifle and machine gun fire and a few shells burst over our lines. It lasted for about half an hour. Our fellows report that they did not see a Turk who kept behind their trenches.\n","62":" – The huge liner \"Olympic\" with 7,000 yeomanry on board has been chased into Mudros by two submarines. Rumour has it that two troopships en route Alexandria to Mudros have been sunk by submarines during the last week. No official confirmation here.\n\nWell informed circles here state that a big move was contemplated about the middle of this month, which would end the whole business – political intrigue was at work to finish it. But something or other intervened and this master stroke is not to come off till the middle of November. There has certainly been a great secret movement of troops in these waters lately. The continual rumours of it, coming from so many various sources, musts have some foundation. Greece has mobilised and already fighting has taken place on her frontier with the Bulgars. The enthusiastic frenzy of the Greeks in these islands to crowd to the standard of battle against the Bulgars borders on madness. They have left their homes, sold their businesses and farms for twenty-five per cent of their worth and cleared off to join within twenty-four hours of the word to mobilise.\n","63":" – Big naval bombardment of Hills running north from Suvla Bay, which was very spectacular. Ships from Suvla apparently firing broadside. Great flashes of vivid flame broke on the hillside as the shells found their mark and huge clouds of dust and debris were sent skyward, resembling volumes of smoke from burning oil wells. The bombardment lasted about half an hour. The song of the big shells as they whizzed on their mission of destruction could be distinctly heard from where I stood.\n","64":" – General Godley returns from Mudros.\n","65":" – General Godley visited by Sir Ian Hamilton and General Birdwood.\n\nRain has threatened all day – the sky has been overcast with lead-colored clouds and occasional drops of rain have fallen. It seems determined to hang off. I have not seen an hour's rain since I have been on the Peninsula.\n\nThe situation is unchanged. The usual artillery retaliation rounds take place day and night and outside the danger of snipers' bullets and the noise of night \"demonstrations\", there is nothing to disturb the peaceful serenity of our surroundings. Peaceful! – indeed if a stranger to the war could suddenly happen here when early morn breaks forth in all its glorious radiance over land and sea, he would never credit it if you told him that grim death lurked in every valley and on every hill.\n\nGallipoli\n","66":" – Mirabile dictu! It rained and blew hell last night – a most uncomfortable \"preliminary canter\" to what we are to experience in a few weeks. As soon as twilight faded away into night, a dense storm wrack enveloped us with whirlwind intensity, as if its sole mission was to tear the very vitals from our shelters. The black canopy of clouds which had lain dormant and high throughout the day now descended and plunged us into inky darkness through which we found it impossible even to grope. Rain poured in torrents as if Niagara had been let loose and soon converted the dusty terraces and pathways into quagmires from which our boots could hardly be withdrawn. The wind howled and shrieked like so many aerial devils and many a primitive dugout was mangled and torn to shreds. I was in the \"Office\" when the storm broke and I shall always retain a very vivid memory of my struggle in the inky blackness to reach my dug-out. The storm, however, did not materially affect the latter, though I spent an hour hanging on like grim death to the tarpaulin roof which was swelling ominously with each gust of wind. Early morn saw the disturbance spent of its fury.\n","67":" – Captain Mair has arrived as G.S.O. (3), vice Captain -----. Captain Mair is just from France where he secured the Military Cross. A long, lanky attenuated Irishman, keen and full of life, and a gentleman every inch of him. Quite distinct from Captain ----- who was for ever twisting an exceptionally pretty little moustache and took more pains with his toilet than interest in his work. He was also from France, but the vista of the life here did not suit his particular fancy. There was nothing here compatible with the conditions he had enjoyed in France. \"Damn it all\" he remarked, \"One does get tuned up with shell there, but you could get a drink occasionally and secure a comfortable bed. Why, Divisional Headquarters in France is about eleven miles back from the firing line in an up-to-date spanking house and you have your motor car, jolie demoiselles, etc. … And what the devil becomes of the mail here. In France we have it at least once a day, sometimes twice. Oh dear me, this is the last place God made.\" And he walked to the door and gazed mournfully at the scene before him – nothing but stunted gorse, and civilization nowhere.\n\nCaptain Herbert has gone \"sick\" with dysentery. Ex consular service at Constantinople and a hero of Mons, the Hon. Aubrey Herbert, M.P., was a characteristic figure whilst in camp. Tall and thin, with a small head nestling to his shoulders with unbecoming severity, he appeared to be in a state of perpetual effervescence. His face is never rigid: it is for ever crinkled with smiles and laughter. His eyes are small, dark, and beady, and short-ranged – an aftermath of his trials in France – his sight being practically destroyed by high explosives. So, poor chap, they are continually getting him into trouble because his feet are naturally crosswise and two such physical defects must inevitably clash. But he displays wonderful agility for all that. He dresses in a mauve-colored suit of high sartorial cut. He talks with the full flavour of British aristocratic ton, and is dreadfully careful of his hair, teeth and finger nails. His external effeminancy you would never associate with a hero of the battlefield. He is a living example of the hero of the modern melodramatic novel. He is always talking of the latest hair-wash, pomades and perfumes, and you can always tell his whereabouts by the trail of violet that follows his person. He indulges in Turkish Delight and often makes a meal of it in preference to roast beef and potatoes. He uses eau-de-Cologne galore. A cheerful conversationalist, he spins many a good yarn. There is no excessive aristocrat about him, but his talk displays a ready wit and a brilliant brain. He is never bored or wearied and always gets what he wants – a good trier and a bold soldier. \"If you can't get anything you particularly desire from someone, make love to them, and you will be sure to get it\" is one of his witticisms, and he has found it fairly successful by experience.\n\nGallipoli\n","68":" – Captain Herbert has the reputation of being the finest Intelligence Officer on the Peninsula.\n\nA distinguishing feature of the night operations lately has been the work of the Australian patrols –","69":" Australian Infantry Brigade (Colonel Burston). They have penetrated the enemy's lines at night and actually sneaked in and out their trenches with wonderful daring and skill. They successfully reconnoitred the enemy's position at the \"Apex\" and entered the blockhouse there. This work has been commended by General Godley. The cold callousness of the Australians to danger is typified by the following incident – A Turkish deserter – Suleman Achmud – who walked in and laid down his arms a couple of days back, when asked the question as to whether the Turks saw any of our men or patrols at night answered \"only when we see them smoking cigarettes.\" Though this is an unpardonable crime for a soldier on patrol duty, it only conveys a slight conception of what these fellows do. They are utterly reckless and never think of the imminent danger surrounding them – they stand up in their trenches, lean over and show half the body to get a better smack at a Turkish sniper or other enemy target – they ignore and brush aside all regulations governing trench fighting. They take their own initiative and perhaps their continued success has been a great deal due to this. \"They are too eager\" said an Artillery Officer of twenty-five years experience the other day, \"yet they are brilliant soldiers.\"\n\nWith regard to the Turkish prisoner mentioned above, he walked into the trenches at dawn and with a characteristic expression of disgust threw down his rifle and said \"me finished\". He was a tall big lump of a fellow, a Roumeliote from Adrianople. Under examination he said that the Turks had been told that England had asked for peace and that Germany was now arranging the indemnity. The Turks were all wanting peace – the food was bad, no water, meat or bread – only beans now and again. He went on \"if you break a bone in a finger of every Turk, you will find friendship in it for the English\" and he added with reference to the Turkish losses which had been very severe – \"In Roumelia there are now twelve women looking for husbands where there only used to be six.\"\n","70":" - \nNew Zealand Casualties:\n Christchurch, Sept. 15:- The casualties among the New Zealand Forces at the Dardanelles are as follows –\n\nOfficers\n – 78 killed – 201 wounded – 15 missing\n\nOther Ranks\n – 1231 killed – 4083 wounded – 530 missing\n\nTotals – 1309 killed – 4284 wounded – 545 missing\n\nThis give the total casualties of all ranks at 6138.\n","71":" – Home letters tell me that Sydney went mad one day in August when the City was informed that the Dardanelles had fallen. Flags were flown and all were wild with excitement. Perth, too, seems to have received this huge \"canard\". What a huge joke considering our stagnation here.\n\nThe Turkish festival of Beiram begins between the 18th and the 20th instant, and lasts for four days. It is quite possible that the Turks may be prevailed upon to make a \"fanatical\" attack, and all ranks have been warned to be on the alert.\n\nReports from Suvla way say that the Turks in the trenches have been circulated with the news that the Germans will be down to help them in a few weeks. Ah! me: any old lie to keep them going. I think the Turk is about tumbling to the Germans' chicanery as a liar – the deserters we have all proclaim that they don't believe half what the Germans tell them. And no wonder.\n\nWe held a \"demonstration\" this morning along the whole line from Lone Pine to Chocolate Hill. Its object was to draw the enemy's fire, gain knowledge of his strength and any of his new positions. It was an utter failure – it was too mild and spasmodic, and the wily Turk kept as quiet as a mouse.\n","72":" – We are now settled down comfortably in winter quarters and\n\nGallipoli\n\n17:10:15 – prepared for a long wait. We have been tutored up to it, so we can't suffer much disappointment. The artillery and naval guns engage their usual targets during the day and night and opposing snipers have their usual duels, but beyond these episodes nothing occurs to mar the peacefulness of our life.\n\nBritish Losses:\n - Extract from \"Spectator\" Sept. 18, 1915.\n\nOfficers\n - \nOther Ranks\n - \nTotals\n\nKilled or Died from Wounds – 4965 – 70,992 – 75,957\n\nWounded – 9973 – 241,086 – 251,059\n\nMissing – 1501 – 53,466 – 54,967\n\nTotals – 16439 – 365,544 – 381,983\n","73":" – The days drag along quietly with the same unchanging routine, week after week. We hear and see little of the enemy, who seem to be awaiting developments as we are. Whether they are awaiting events with the same patience as our men are I do not know. I have my doubts. A miserable poorly-clad half-starved Turk deserter sneaked away from his lines the other night and claimed our protection and generosity. He seemed to be semi-demented and his answers to questions were unintelligible in that they had no relevancy and were childlike in their simplicity. These long dreary winter days in the trenches must be hellish torture to some of these poor devils. Two barrels of water per Battalion a day they receive: no meat, some bread occasionally and mealy biscuits they live and fight on (vide latest examinations of Turkish prisoners). (It will be noted that the reports gathered from captured Turks in regard to their daily rations differ from time to time. Whilst some declare that they are living well in the trenches and have plenty of water, etc. (see Page 7) others, as above, say that they are practically starved. The explanation seems to be that some regiments are more favoured than others as regards food.)\n\nThe weather has now taken on its winter coat: rain storms are frequent and the weather blows damp and bleak. Grim angry clouds scud low overhead and threaten to deluge us throughout the day. The passage of wild fowl has begun and flocks of all variety of game – geese, cranes, wild duck, quail and pigeons, pass over squeaking and squawking to one another as they battle against the fury of the elements. The swallows have swarmed days ago, and left us for warmer climes (see Peninsula Press cutting No. 84 October 18, 1915).\n\nThings are unusually dull. Major Pinwell, Senior Staff Officer, pro. tem., sits and reads novels – Hilaire Belloc, Jack London, and all The General's literature when he can – \"Tatler\", \"Life (New York)\", \"The Passing Show\", \"Sketch\", \"Graphic\". \"Punch\" seems to be his favourite.\n","74":" – We evacuate 40 to 50 'sick' every day. The actual casualties do not average 10 a day at present in the Division.\n","75":" – In conversation with Captain Mair this morning (G.S.O. 3) he remarked upon the contrast between Divisional Headquarters in Gallipoli and those in France. \"The latter are invariably in some chateau or country residence\", he said, \"six or seven miles back from the firing line and if a Staff Officer wants to take his breakfast across the road he calls his motor car, so to speak. A Staff Officer is very seldom seen in the firing line\" he concluded.\n\nWintry conditions now prevail – a high wind howled throughout the night and this morning blew with tempestuous force from all quarters. A strong wind here plays the devil with our dugouts, especially those of frail build The nature of the country\n\nGallipoli\n\n20:10:15 – favours an adverse wind, so alternated is it with gullies, narrow-gutted defiles and passes. There is little protection from the elements anywhere. Bleak and bitter are the climatic conditions. Rain continues to threaten, and the 'Office' is deluged with huge dust clouds that render work nigh impossible. All have commenced to wear their great coats and continued physical exercise of some description or other is required to keep one's self warm: altogether I feel splendid and the change from exasperating heat to bitter cold seems to have favoured my physique – I am keener, I have lost the morbid feeling which permeated me during the stifling hot days, and I eat and sleep better.\n","76":" – Nothing unusual and the weather is unchanged. Very quiet day. Major Pinwell fills in his spare time by raiding the remnants of the flies, which seek the shelter of his Office, with a fly whisk.\n","77":" – Bleak, raw day – tempestuous sea running. General Godley leaves for Mudros to meet Lieutenant-Colonel Rhodes.\n","78":" – Weather unchanged – shelled with shrapnel during afternoon.\n\n25:10:15 – Changes in the weather are meteoric in their suddenness. I awoke at 5.30 a.m., and it was a beautiful morning like in early spring. The weather has changed in a night: the threatening clouds, bleak wind and raw atmosphere of yesterday have been replaced by a bright blue sky and the warm sun's rays. Everyone seems happier, small birds sing cheerfully and flutter about the bushes with awakened activity – the troops welcome the change with whistle and song and seem rejuvenated in their appreciation of the perfect morn. I walked with Cocks before breakfast to the 54th Divisional lines, had a warm sponge bath (out of a kerosene tin) on return, and had a hearty breakfast of biscuit porridge.\n\nVide Peninsula Press:\n - The British Press have denied the report of the \"Daily Telegraph\" that the Government is expected to cede Cyprus to Greece in the event of Greece joining the Allies. An Allied Squadron bombarded the Bulgarian coast in the afternoon of the 21st October for a distance of 38 miles. A number of military look-out stations along the coast were destroyed and gun emplacements shelled. Harbour works at Dedeagatch were bombarded. Incidentally, shipping warehouses, piers, etc., the railway bridge on the east end of the town and much rolling stock were destroyed. Several large fires were started, one evidently an old torpedo depot. The residential part of the town was not attacked. The enemy did not reply. The landing of French troops at Salonika is continuing regularly under the best conditions. The French troops who have crossed the Greek frontier have got into touch with the Servian troops.\n\nPoldhu\n (high-powered wireless Station, Cornwall) vide Peninsula Press 23.10.15 (inter alia) – It is officially announced that bombardment of Bulgarian coast from Dedeagatch to Gorla Tazzi was commenced on Thursday last. The inhabitants and garrison at Dedeagatch evacuated and retired to the interior.\n\nPoldhu\n (continued) – Commenting on execution of Nurse Cavell by the Germans in Brussels the –\n\n\"New York Herald\"\n says – \"A wave of horror has swept through America.\"\n\n\"New York Tribune\"\n - \"It is impossible to believe British men will fail where British women have succeeded so gloriously.\n\n\"New York Press\"\n - \"The iron hand of soulless Germany has struck another blow which kindles a bitter indignation all human.\"\n\nGallipoli\n","79":" - \n\"New York Sun\"\n - \"It has struck the world with horror.\"\n\n\"Chicago Post\"\n - \"Miss Cavell's murder is one more first-rank blunder of German statesmanship.\"\n\n\"Chicago Journal\"\n - \"Crime is adverse to all instincts of humanity and western ideas of womanhood.\"\n\nVide Poldhu\n (continued) – Sir Ian Hamilton returned from Dardanelles to-day (Oct. 23) and paid early visit to War Office. He was cheered on arrival by large crowd. The King has issued an appeal to his people in which His Majesty calls upon men of all classes to come forward and volunteer and take their share of fighting for the honor of the nation.\n\nThe Turks shelled us to-day at one o'clock and 7 p.m. It was particularly violent on both occasions, though it did not last long. The wireless station on the ridge just above us, not 100 yards away, had special attention, and one of the aerials was destroyed. It was, however, soon repaired. The evening bombardment created a mild change from the lethargy of the last few nights. The dull boom of the Turk gun as it sent its awful missile on its voyage of destruction gave us sufficient warning to allow us to take cover and we crouched and anxiously waited whilst we could hear the eerie song of the shell as it cleft the air on its approach. And as we crouched we all prayed that it might \"go over\" – out to sea, anywhere, but where we were. At last it came with an awful whiz as a sudden burst of steam from a huge exhaust – it came like a meteor from the heavens and plugged with a terrific deep-throated roar into the side of the hill not a dozen yards away. A simultaneous flash of blood-red flame converted the surrounding gloom and darkness for an instant into fiery light and silhouetted us all as if we were lost souls in Hell witnessing a ceremony of the devil. For seconds after the explosion the air was filled with flying and falling earth and torn bushes, and the nauseous odor of the burnt explosive was stifling in its intensity. Three of these huge monsters were hurled at us in quick succession, but happily they accounted for no loss of life. Now that Bulgaria has joined our enemies we may reasonably expect the intensity of Turkish shell fire to increase both in weight and numbers. Lord Kitchener has sent a warning in regard to this, and advised us to \"dig\" ourselves in and strengthen our defensive positions greater than ever so that we may be immune from any shell fire, however great, but I doubt the resisting powers of any earthwork or redoubt against these heavy shells. (\nNote:\n The deep underground tunnels which we later had in France were practically unknown in Gallipoli at this time: if known, they were certainly not used, though General Godley subsequently fell wise to their protection against heavy shell fire and actually had shafts and tunnels dug at New Zealand and Australian Divisional Headquarters in Otago Gully.)\n\nThese Turkish shells plough huge craters in the ground and their size may be judged by the fact that the base of one which was fired last night could have covered a large dinner plate with ease. And they stand 4 feet high.\n","80":" – The weather continues warm, but rain is again threatening. There has been a heavy naval bombardment to-day of an enemy encampment in direction of Kilid Bair. The roar of the guns has rent the air all day and the incessant concussion has been nerve-racking in effect. The health of the troops is improving.\n","81":" – A wild boisterous day with high wind from the south-east. A rising barometer heralds approach of stormy weather. The office has been deluged with dust, which is an inch thick everywhere.\n\nThe Turks are determined to shift us. At mid-day during the height of the gale they bombarded us for half an hour with big shell within a circle of 100 yards diameter. The shells owing to the roar of the wind could not be heard until right upon us, and we could not place their direction. The first was beautifully\n\nGallipoli\n\n27:10:15 – timed – it came with a deafening whiz, glanced off the back of the cook-house and went clean through one of the escort's dugouts as if it were made of tissue paper. It came to a dead-end half a dozen yards above The General's quarters. A second shell planted itself near the wireless pole, and a third tore a crater in the earth at the end of the gully near the Indian Camp. And then followed a fusillade of two or three shells a minute. The strong and cantankerous wind planted them in all sorts of odd places but fortunately no one was injured.\n","82":" – To-day it is quite calm warm and sultry. The conditions of yesterday have entirely disappeared.\n","83":" – Warmer weather prevails – there is not a breath of wind and the morning is very calm and peaceful.\n","84":" – Colonel Braithwaite returns from Malta, after having stayed a few days at Mudros to inspect the Brigades. He is Senior General Staff Officer of the N.A. & A. Division. He has returned his usual happy self, and his reappearance is as welcome as a ray of sunshine on a bleak winter's morn. As I expected our \"windy\" Office will now undergo a complete reconstruction. Its present comfort is not approved of by the Colonel. It must be made more roomy, more tables and chairs provided (viz., boxes and any old pieces of board nailed together) there must be more protection from the cold and the dust, etc. etc. etc. Eh. What!\n\nThe Colonel has returned full of vigour and interesting news. Speaking to Colonel Chaytor, Brigadier-General Johnston (Artillery Officer), Major Pinwell (G.S.O. 2), and others at the door of the Office this morning he related in graphic style a story of the sinking of the troopship ---- a few days back by two Austrian submarines. Leaning his excellent frame of muscle and bone against the sandbag wall, with his arms akimbo, he told his story to an attentive audience. With extreme fascination, using his well-cultured voice with admirable modulation, expressively and earnestly, now speaking in an awed whisper, then raising his voice to express abhorrence of some dastardly act, his intonation perfect, and all the while his well-cut features working in harmony with his utterances, he told his story as an actor would speak his dramatic lines, as a master of elocution would recite a soul-stirring poem. The story was as follows:- \"Well, the ---- was a cranky, ill-fitted and ill-equipped old tub, the best you could get out of her being six and a half knots. She was without wireless, few boats, and life-saving appliances – belts etc. were \"nil\". She left Alexandria a few days back loaded with Indian Reinforcements, in the charge of five Indian Army Reserve Officers, for Gallipoli, via Mudros. The Captain, a good fellow, was well aware of the seriousness of his task with such a cranky, rotten boat, but he was there to obey orders and was determined to carry them out. He knew full well that the enemy submarines had been accounting for an average of two transports weekly on the Alexandria-Mudros run for the last two months. Well, the ---- left Alexandria under orders to make a definite course which was judged to be the only safe course. Lo and behold, before she was three miles out a picket boat came bounding along the ship's side with sealed despatches. The Captain hurriedly tore them open, and to his amazement found that his course had been altered – he was to go round the south of Crete and then steer north – quite opposite to his original orders. It was a rather significant sign, although perhaps not fully appreciated at the time that the paper giving the altered course was not officially signed, only the covering memo bore signature. This was contrary to set rules governing despatches of the kind, but the Captain believed everything to be O.K. at the time and so off he started on the new trail. They reached Crete safely and were well on their way north before anything happened. The unexpected came like a bolt from the blue. It was early morn, the sea was in an oily calm, and not a\n\nGallipoli\n\n31:10;15 – breath of wind disturbed its surface, and then the two ominous and dreaded black objects suddenly appeared on the surface not half a mile away, one to the right and the other to the left. The ship was caught in a cleft stick. The alarm was immediately given, and the troops crowded the decks, and rushed for – alas! the much-needed and missing life-belts and boats. They were welcomed instead with a terrific fusillade of shot and shell from a quick-firer and the rifles on each submarine which swept broadcast the deck of the ill-fated vessel with callous and brutal butchery. Five boats were only available. These were launched as quickly as possible, but two were so riddled with bullets that when they touched the water they simply filled and turned turtle emptying the poor devils of occupants into the icy sea. The Captain was the last to leave the ship and after a hard struggle reached one of the seaworthy boats which had been successfully launched. The submarines lost no time in putting a couple of torpedo into the doomed vessel and she blew up and sank with a gurgling roar five minutes after she had been struck. Three boats had managed to get away, and luckily they had some full water kegs aboard, otherwise their occupants would certainly have died then and there from downright thirst – as not even a biscuit could be found amongst them. Most of the survivors had been wounded and an Officer had several bullets in his legs. He had been capsized out of one of the boats and how he managed to keep afloat long enough to be picked up was a miracle. There were two or three Officers amongst the saved – the others were Indians and some of the vessel's Dago crew. Nothing could be done but make for a barren bit of an island which loomed on the horizon. After a long and bitter struggle the soddened-clothed, starved and thirsty survivors reached the shore. They found it to be inhabited only by a few ignorant Greek shepherds with goats, who treated them with marked hostility and refused them food. No explanation of their misery or condition would make the blasted Dagos give them any help. So they found snails on the beach and lived on them.\n\nOne of the crew volunteered to take a message to a cable station which he thought he could locate some miles away, and taking one of the boats he eventually succeeded in reaching the island, for which an urgent message was sent for assistance. A reply came that a cruiser would be despatched at once. The Greek brought the reply back to the stranded wretches, and after they had shown it to the inhospitable inhabitants they reluctantly killed a couple of goats on which the hungry survivors made a ravenous meal. Evidently the fear of what vengeance the cruiser might enact upon them on her arrival stirred the blighters to give some kind of help. The cruiser at last arrived – she was a 'foreigner' unfortunately – but she afforded what help she could, and took them away to the nearest port where proper attention could be given. A remarkable incident of the voyage back was that the Dago surgeon on the cruiser refused to amputate one of the legs of an Officer who was bleeding to death from a jagged shell wound. He agreed to give an anaesthetic, if anyone else could be found to do the job. So thereupon, rather than see his friend die before his eyes, another of the belated Officers who also had half a dozen wounds about him, and who was the only other Doctor available, consented to sit and be propped up and performed the operation with the blood oozing from his own agonising wounds whilst he amputated the right leg of his stricken chum. What a situation! Gad, the fellow had nerve, and thank God they are both alive to tell the tale and doing well. They are now in hospital at Malta and the closest of friends. I should think so – Eh What!\" concluded the Colonel.\n\nThe \"Marquette\" which was torpedoed in the Gulf of Salonika a few days ago had on board a Red Cross detachment – also a Divisional Ammunition Column. She was treated by the submarines with ruthless severity – several Red Cross nurses were wounded and 600 horses were lost.\n\nGeneral Sir Ian Hamilton has been replaced by General Sir C.C. Munro, K.C.B., as Commander-in-Chief of the Mediterranean\n\nGallipoli\n\n31:10:15 – Expeditionary Forces. He took command from the 27th October, 1915.\n\nThe following cable form the Premier, N.S.W. appeared in Divisional Orders, 30th October, 1915:-\n\n\"To General Godley:-\n\n\"Australia Day Fund this State now three quarters million Stop Two hundred thousand pounds available for amelioration conditions disabled soldiers balance to be drawn upon by Red Cross for comforts nursing assistance mainly oversea hospitals confidently believe these two sets machinery co-operating with military authorities will render all needed assistance comfort for our brave men when money exhausted more money will be provided.\"\n\n(Signed) Holman, Premier.\n\n\"To Holman:-\n\n\"Many thanks patriotic action and munificent generosity of your people highly and greatly appreciated by all Australian troops of my Division.\"\n\n(Signed)Godley.\n\nVide A.G. Hales in \"John Bull\"","85":" – in refutation of some English critics – slanderers – who are deploring to the detriment of the British Tommy here the failure of the British troops to co-operate with the Australians when the latter had to fall back from a position they had won by superb daring – when they actually saw the Dardanelles and had their thumb in the Turks windpipe and but for this lack of reinforcements – failure it was – they would have closed right round his throat, and the Turkish Army thus cut off from its source of supplies.\n\n(I quote this extract from \"John Bull\" because of its faithful representation of the difficulties and hardships of this stupendous campaign.)\n\nSays the article – \"It has been easy for the Germans in their attacks on French, British, and Russian fronts to time their blows like clockwork – they have had the use of the finest military railways in the world and their staffs could keep in touch (during an action) all the time by telegraph, telephone, and heliograph, but where our troops were fighting none of these things was available. But the men had to scramble as best they might through a perfect net-work of forbidding hills, they had to clamber like goats up precipitous cliffs and go down terrible declivities, they had to thread a passage amidst dense thorn scrub where Officers and men could not possibly keep in touch. One and all they did their best and what their best is, the inhospitable heights and plateaux of the Gallipoli Peninsula could tell, had the stones tongues. We must regret that our fine fellows did not get to the coveted positions, but the men who criticise them harshly, the pariahs who place themselves in the seats of the scornful should be driven at the point of the bayonet to take part in the next blow that is struck under those scorching blistering skies, amid rocks and precipices, poisonous thorn bushes and jagged flint strewn ravines, where the little grey-speckled flies swarm in myriads to torment the wounded to madness, and thirst, heat, and dust bake a fallen man's throat black and his tongue turns to stirrup leather.\n\n(For further particulars on \"Suvla Bay Failure\" see attached narrative \"A Story of Gallipoli\", and extract from \"Morning Post\" dated August 17, 1915, included in Diary.)\n","86":" – A quiet day, but had a hell of a gale at 7 p.m. It came\n\nGallipoli\n\n1:11:15 – without warning from the South-east, and tossed and tore around us for a full hour. The air was full of flying pebbles and pockets of dust and debris, and stung and wounded the faces and hands of those who had been unfortunate enough not to secure timely shelter. The sea raged, roared and tossed huge breakers into the sandy shore. Many boats and lighters were unable to withstand its fury, and were driven on to the shallows and aground.\n","87":" – The morning broke calm, with not a breath of wind, and the sea had quietened considerably, though still heaving and swelling from its overnight struggles. One paddle steamer – a tug – lay high and dry on the beach below No. 2 Post and the Turks lost no time in getting on to it with big shells, but they made very poor practice. They also turned the machine guns on to the men aboard her, and they were compulsorily obliged to abandon her.\n","88":" – The enemy again turned his big shells on to us this afternoon – about tea-time – planting two into the middle of the hospital tents, another perilously near the wireless station, and a further one just above the 'Office' on the hill opposite. One poor devil had his legs blown off whilst there were several other serious casualties in the hospital. A \"funk\" hole is to be built (dug) to enable us to take shelter from these monsters of destruction.\n","89":" – It is announced by the War Office that the British transport \"Ramazan\" has been sunk by shell fire in the Aegean Sea. Out of 380 Indian troops aboard 75 were saved, together with 28 of the crew.\n\n\"There is no truth\" the Press Bureau states, \"that Lord Kitchener has resigned. He has been sent on a special mission by the Government and his duties at the War Office are being temporarily discharged by Mr. Asquith.\"\n","90":" – It is announced by the War Office that Lord Kitchener has left England for a short visit to the eastern theatre of war (By wireless).\n","91":" – Serbia through her representative in London has issued an appeal to her friends in Great Britain begging that help will be sent to her quickly. \"Serbia has been condemned to death by the Germans, Austrians, and Bulgarians\", says the Serbian Minister, - \"Our common enemies are trying to annihilate us. In spite of the spirit of our soldiers, our resistance cannot be expected to be maintained indefinitely.\" Franco-British Forces are said to have reached a point 90 miles north of Salonika, but it is doubtful if they can join the Serbians in time to prevent them from being annihilated. (By wireless).\n","92":" – It is officially reported that British troops moving northwards from Salonika have joined hands with the Serbians and that a Russian Army of 250,000 is on its way to Bulgaria.\n\nLondon\n (by wireless Nov. 8) – Lord Kitchener has conferred with General Joffre and the Premier. According to Paris newspapers, Kitchener's conference at Paris has produced a thorough understanding with the French Government. Lord Kitchener will visit the Dardanelles, Egypt, Macedonia, and Greece.\n\nThe Greek Cabinet has been reconstructed and it will maintain an attitude of very benevolent neutrality towards the Entente.\n\nTo-day has been a day of events locally. Our feeling of security from enemy fire in the little hollow which we call Otago Gully has been decisively shattered in one short hour. Our \"palatial and comfortable\" home which has been erected with so much pain and with such diligent care and so \"beautiful\" to the eye with its large sandbag-offices, covered with varied-colored tarpaulins, along its parallel tiers of terraces, has lost all its serenity, and been practically wiped out in places by terrific shell fire. The enemy have found us out this time. Not that\n\nGallipoli\n\n10:11:15 – they have not been fully aware of our \"delightful\" abode before this. I have not doubted such a thing for a moment. But we have been lulled into a false sense of security, because of their supposed lack of ammunition. We have failed to take the necessary precautions against bombardment, viz., by digging into the bowels of the earth and making tunnels of retreat, which are the only safeguards against the tremendous lumps of metal which the enemy are now launching at us with prodigal expenditure. Since Bulgaria declared war, Turkey has been steadily increasing her ammunition supplies and we are now receiving the full benefit of it, and our past inactivity is costing us dearly.\n\nThe bombardment opened about 3 p.m. – Whirr! Whirr! Whirr! – then simultaneously a number of terrific explosions took place, which made the earth tremble beneath our feet. Then an interval of two or three minutes. Then more of the huge metal monsters billeted themselves amongst us. One completely wrecked The General's \"dining-room\" and shattered the adjoining Officers' mess-room. In two seconds they had become a heap of smoking ruins – sandbags were perched on top of one another at indescribable angles – twisted scorched and burning timber, shattered chairs and tables – all confusion, everything wrecked beyond repair. And if it had occurred an hour later, the whole of The General Staff would have had their names added to the Roll of Honor: for afternoon tea is served at 4 p.m. and is invariably attended by all Staff Officers from The General Officer Commanding to his distinguished afternoon visitors. The bombardment continued incessantly for an hour, during which time our lives were not worth a straw. The air was full of flying shell caps, jagged lumps of steel and burning metal, and the rank smoke and fumes were overpowering and stifling to nigh suffocation. The Turks had turned howitzers on to us and were firing rapidly and with deadly accuracy. Our tin and waterproof roofs and sandbag shelters were of little avail against the huge monsters which they poured into us. Their size may be judged by a hole which one tore in the terrace outside the Artillery Commander's dugout. It was fully 6 feet deep with a diameter of 12 feet. Beyond the great damage to the Offices etc., nothing serious resulted. It was miraculous that there was no death or injured roll. The wireless station over the hill was completely demolished and three men there were buried alive by falling earth. They were dug out uninjured, though suffering very much from shock. Their nerve-system has been blasted for ever. I had rushed out when the first shell burst and took timely shelter behind a convenient sandbag wall. It was poor protection against such opposition, but I had nothing else to do but take my chance with the rest. Some, however, had considered discretion the better part of valor and cleared out of the camp to neighbouring trenches and saps. The result of the bombardment has had the effect of accelerating the work in connection with the digging of \"funk holes\" and by five o'clock four more had been commenced by special working parties from the trenches.\n","93":" – The Turks do not intend to give us any peace. Shortly after 8 o'clock this morning they again opened on us and with deadly effect. Their second shell wiped out four men and seriously injured two others in one fell swoop. This party of men had commenced to dig a tunnel from the back of their dugout, but they had only got a few feet in when with a deafening roar the huge missile of death plugged clean through the roof above them and blew the poor devils to bits. Another chap was blown right out of the door – he was blackened with powder from head to foot like a stoker with coal-dust issuing from the grimy depths of a huge stokehole. He was completely blinded with grit and fumes and his eyes have been permanently injured. His shirt and trousers were hanging in shreds and he was trembling like a leaf in the wind. Crying out incoherently he soon fell into a deep swoon. Orders were then quickly given that all should clear out until the shelling was over and the command was very willingly obeyed. The bombardment continued for about one hour, then stopped as suddenly as it had commenced.\n\nGallipoli\n","94":" – As a result of this fatal bombardment, the work of tunnelling continues with unabated vigour day and night: shafts from 20 to 25 feet being sunk, from which branch tunnels are being spread out. These are considered to be the only safe precaution against howitzers. They can search every nook and cranny of this gully. They appear to fire into the heavens and come down as if at right angles. Gad! this is war. Give me bullets with a chance to smack back any day in preference to this \"rat-in-the-trap\" destruction and murder. Crouch where you may above ground you are not safe from these monsters. You hear their weird song which sings them on their way, intensifying as they approach, but you don't know where they are going to land. It is impossible to locate them until they have struck, and then up goes everything within their reach. The concussion is frightfully and powerfully intense and you are lifted about as if you were a mere straw. What puny mites we are and how helpless one feels against these mighty engines of war. \"Dig\" is Kitchener's advice, and that is the only advice – to hide yourself in the bowels of the earth.\n\nCaptain C.W. Melvill, New Zealand Staff Corps, has arrived and taken the place of Captain Mair (G.S.O. 3). He tells many interesting and amusing tales of his experiences in France – in the battle of the Aisne and other stupendous struggles in the early stages of the war. He had his arms and legs lacerated by high explosives and had four months in hospital in England. His recitals of instances of the brutal callousness of German methods of warfare were to a degree more repulsive than I have read of, despite the horribleness of some of the latter. He tells us of German Officers entering quiet houses of the villagers and country folk and stabling their horses in the drawing and dining rooms and fastening them up to pianos, bedsteads, etc., and generally converting the homes into dung-pits for their filthy excreta – being blackguardly plunder and desecration of beautiful homes.\n","95":" – Lord Kitchener paid a short visit to Anzac where he was introduced to various Divisional and Brigade Commanders. He was given a great cheer on his arrival. It was a peremptory official visit and he was gone again after an inspection of the various posts.\n","96":" – A frightful and devastating storm at night – thunder, lightning and rain. Hellish weather all day, which developed into a veritable inferno of storm and tempest as night approached. Rain fell in torrents, the wind howled along in terrific gusts and there was great damage to piers and beach works. The saps and roads in the several \"deres\" also suffered severely. Some of the saps have been converted into raging torrents and are practically impassable.\n","97":" – Heavy rain, cold wind, and very damp. The whole countryside is a heap of mud.\n","98":" – Visited with snow-storm during the early hours of the morning and it was still falling when I awoke. The country is under a mantle of white. The fall is judged to be about 4 inches. With the continual traffic there was soon mud everywhere and it was hardly possible to get through it – slide, slip and slither all over the place, if you were lucky enough not to get stuck in it ankle deep.\n\n1:12:15\/2:12:15 – Evacuated \"sick\" with lumbago and jaundice, and taken aboard hospital ship \"Oxfordshire\", which is excellently fitted.\n","99":" – Spent a comfortable night and had my first sleep for a week. Enjoyed the luxury of a hot sea bath and had my clothes thoroughly disinfected.\n\nHOSPITAL LIFE\n","100":" to","101":" – Life on the hospital ship was pleasant and comfortable. A member of the 17th Battalion died and was buried At Sea. We arrived at Alexandria shortly after breakfast on the","102":" disembarked and boarded trains for Heliopolis. Red Cross nurses served us with tea, bread and butter and other comforts on the way across. Admitted to Luna Park Hospital. What a comfort and luxury to get between clean sheets. All my old clothes were taken away and I was issued with leather shoes and a complete outfit from undershirt to jacket and pants. The treatment was excellent. The nurses abounded with kindness, and the Red Cross provided us with comforts every day. I entrained at Bab-el-Louk on the morning of the","103":" for Heloun where a palatial building (formerly the Hotel \"Al Hayat\") had been taken over by the military and luxuriously fitted up as a hospital. Surrounded by extensive grounds, gardens, tennis courts, etc., it was replete with everything for the convenience and enjoyment of the sick and wounded.\n","104":" – Christmas Day! Treated well – a splendid dinner and Red Cross Gifts. The dining hall was artistically decorated with palms and the Australian Flag, and the main corridors leading to the wards were also resplendent with bunting and greenery. The piazza also was appropriately decorated. In fact, everything was in perfect harmony with the spirit of the day. The tables at dinner were loaded with good things, and at each man's place there was a small card bearing the inscription – \"The Australian Branch of the British Red Cross wishes you a merry Xmas, a happy New Year and a speedy recovery.\"\n\nMajor Norton, Officer Commanding, spoke a few words, wished the men the season's greetings and every happiness and good cheer. He said that nothing had pleased him more than to have had the opportunity of sleeping under the same roof with such a splendid lot of fellows. \"God save the King\" was sung, the men drinking their King's health with orange ale, lemonade, and ginger beer.\n","105":" – Discharged from Helouan with 150 others to Gizeh, via Bab-el-Louk. Gizeh camp is on the banks of the Nile and composed of two sections – 1st and","106":" Australian Divisions respectively.\n\nSPECIAL DUTY\n","107":" to","108":" – On the morning of the 12th a Special Guard was detailed for duty from Gizeh Camp. The selection of the men had been carefully carried out and the exact nature of the duty ahead kept a profound secret. I was chosen as one of the Corporals of the Guard and after much speculation as to our destination, eventually arrived at Cairo Station (our future Headquarters) and found that we were to picket the railway lines leading therefrom down to Fraz, a distance of about 3 miles from the Station. A certain section of the natives, no doubt animated and prompted by German influence and money had become very restive and inclined to create disorder, and the Egyptian Authorities had received reliable intelligence that an organised attempt was to be made to destroy the various railway works, foment dissension and, if possible, mutiny amongst the railway employees. The Australians had been called upon to save the situation, as they were considered to be the only troops capable of dealing with the troublesome natives, viz., by direct action and no quarter in the event of any disturbance. The importance and responsibility of their job will be recognised when it is known that at Fraz, a huge railway siding, there were immense coal stacks and oil stores. Then along the main line were the large electric power station, the many carriage sheds and workshops. We had guards posted everywhere, and were all out to catch the wily and traitorous nigger. I was first stationed at Fraz as Corporal of the night picket on the oil sheds. It was very cold, but several Soudanese watchmen, who by the way seemed to have the full confidence of the Authorities and who were there to assist us in local\n\nSpecial Duty\n\ntopography, built a big coal fire which we sat round, when off duty, and watched the amusing antics of the \"fuzzy wuzzies\". Quaint fellows, they chatted at us and at one another, and what we did not understand by word of mouth, we conveyed by gesture.\n\nDespite the cold and weary nights, the men liked the job. Outside a temporary shortage of rations during the first couple of days, we were well catered for by the Egyptian Government, and our leave was liberal.\n\nWe had a couple of brushes with trespassing natives during my period with the Guard, but when shown a few inches of cold steel they quickly bolted. The Guard was doing its work well and thoroughly, and the Government recognised the fact, as the expected trouble never came to any serious head.\n\nI was recalled to Gizeh for other duty on the","109":" February, and on the","110":" idem was detailed as Corporal of the Cairo Zoological Gardens Picket – a sinecure.\n","111":" to","112":" – Marching orders for Zeitoun were received in camp on the morning of the","113":" On arrival there and after medical examination, a short illness in hospital (with lumbago) and a further rest at Gizeh, I was transferred (Class L.O.C. Light duty) to Australian Imperial Force Headquarters for duty on the Staff of the Assistant Adjutant General.\n\nRumours have been in circulation lately that a complete evacuation of the troops on the Canal, either to France, Mesopotamia or India, is shortly to take place. There must be some big \"stunt\" in embryo, as most of the hospitals are being cleared as much as possible of the patients and the men, if fit, discharged to the Base.\n\n"}}