{"Document Name":{"0":"Diary_0511","1":"Diary_0511","2":"Diary_0511","3":"Diary_0511","4":"Diary_0511","5":"Diary_0511","6":"Diary_0511","7":"Diary_0511","8":"Diary_0511","9":"Diary_0511","10":"Diary_0511","11":"Diary_0511","12":"Diary_0511","13":"Diary_0511","14":"Diary_0511","15":"Diary_0511","16":"Diary_0511","17":"Diary_0511","18":"Diary_0511","19":"Diary_0511","20":"Diary_0511","21":"Diary_0511","22":"Diary_0511","23":"Diary_0511","24":"Diary_0511","25":"Diary_0511","26":"Diary_0511","27":"Diary_0511","28":"Diary_0511","29":"Diary_0511","30":"Diary_0511","31":"Diary_0511","32":"Diary_0511","33":"Diary_0511","34":"Diary_0511","35":"Diary_0511","36":"Diary_0511","37":"Diary_0511","38":"Diary_0511","39":"Diary_0511","40":"Diary_0511","41":"Diary_0511","42":"Diary_0511","43":"Diary_0511","44":"Diary_0511","45":"Diary_0511","46":"Diary_0511","47":"Diary_0511","48":"Diary_0511","49":"Diary_0511","50":"Diary_0511","51":"Diary_0511","52":"Diary_0511","53":"Diary_0511","54":"Diary_0511","55":"Diary_0511","56":"Diary_0511","57":"Diary_0511","58":"Diary_0511","59":"Diary_0511","60":"Diary_0511","61":"Diary_0511","62":"Diary_0511","63":"Diary_0511","64":"Diary_0511","65":"Diary_0511","66":"Diary_0511","67":"Diary_0511","68":"Diary_0511","69":"Diary_0511","70":"Diary_0511","71":"Diary_0511","72":"Diary_0511","73":"Diary_0511","74":"Diary_0511","75":"Diary_0511","76":"Diary_0511","77":"Diary_0511","78":"Diary_0511","79":"Diary_0511","80":"Diary_0511","81":"Diary_0511","82":"Diary_0511","83":"Diary_0511","84":"Diary_0511","85":"Diary_0511","86":"Diary_0511","87":"Diary_0511","88":"Diary_0511","89":"Diary_0511","90":"Diary_0511","91":"Diary_0511","92":"Diary_0511","93":"Diary_0511","94":"Diary_0511","95":"Diary_0511","96":"Diary_0511","97":"Diary_0511","98":"Diary_0511","99":"Diary_0511","100":"Diary_0511","101":"Diary_0511","102":"Diary_0511","103":"Diary_0511","104":"Diary_0511","105":"Diary_0511","106":"Diary_0511","107":"Diary_0511","108":"Diary_0511","109":"Diary_0511","110":"Diary_0511","111":"Diary_0511","112":"Diary_0511","113":"Diary_0511","114":"Diary_0511","115":"Diary_0511","116":"Diary_0511","117":"Diary_0511","118":"Diary_0511","119":"Diary_0511","120":"Diary_0511","121":"Diary_0511","122":"Diary_0511","123":"Diary_0511","124":"Diary_0511","125":"Diary_0511","126":"Diary_0511","127":"Diary_0511","128":"Diary_0511","129":"Diary_0511","130":"Diary_0511","131":"Diary_0511","132":"Diary_0511","133":"Diary_0511","134":"Diary_0511","135":"Diary_0511","136":"Diary_0511","137":"Diary_0511","138":"Diary_0511","139":"Diary_0511","140":"Diary_0511","141":"Diary_0511","142":"Diary_0511","143":"Diary_0511","144":"Diary_0511","145":"Diary_0511","146":"Diary_0511","147":"Diary_0511","148":"Diary_0511","149":"Diary_0511","150":"Diary_0511","151":"Diary_0511","152":"Diary_0511","153":"Diary_0511","154":"Diary_0511","155":"Diary_0511","156":"Diary_0511","157":"Diary_0511","158":"Diary_0511","159":"Diary_0511","160":"Diary_0511","161":"Diary_0511","162":"Diary_0511","163":"Diary_0511","164":"Diary_0511","165":"Diary_0511","166":"Diary_0511"},"Date":{"0":"unknown","1":1434.0,"2":1435.0,"3":1436.0,"4":1437.0,"5":1438.0,"6":1439.0,"7":1440.0,"8":1441.0,"9":1442.0,"10":1443.0,"11":1444.0,"12":1445.0,"13":1446.0,"14":1447.0,"15":1448.0,"16":1449.0,"17":1450.0,"18":1451.0,"19":1452.0,"20":1453.0,"21":1454.0,"22":1455.0,"23":1456.0,"24":1457.0,"25":1458.0,"26":1459.0,"27":1460.0,"28":1461.0,"29":1462.0,"30":1463.0,"31":1464.0,"32":1465.0,"33":1466.0,"34":1467.0,"35":1468.0,"36":1469.0,"37":1470.0,"38":1471.0,"39":1472.0,"40":1473.0,"41":1474.0,"42":1475.0,"43":1476.0,"44":1477.0,"45":1478.0,"46":1479.0,"47":1480.0,"48":1481.0,"49":1482.0,"50":1483.0,"51":1484.0,"52":1485.0,"53":1486.0,"54":1487.0,"55":1488.0,"56":1489.0,"57":1490.0,"58":1491.0,"59":1492.0,"60":1493.0,"61":1494.0,"62":1495.0,"63":1496.0,"64":1497.0,"65":1498.0,"66":1499.0,"67":1500.0,"68":1501.0,"69":1502.0,"70":1503.0,"71":1504.0,"72":1505.0,"73":1506.0,"74":1507.0,"75":1508.0,"76":1509.0,"77":1510.0,"78":1511.0,"79":1512.0,"80":1513.0,"81":1514.0,"82":1515.0,"83":1516.0,"84":1517.0,"85":1518.0,"86":1519.0,"87":1520.0,"88":1521.0,"89":1522.0,"90":1523.0,"91":1524.0,"92":1525.0,"93":1526.0,"94":1527.0,"95":1528.0,"96":1529.0,"97":1530.0,"98":1531.0,"99":1532.0,"100":1533.0,"101":1534.0,"102":1535.0,"103":1536.0,"104":1537.0,"105":1538.0,"106":1539.0,"107":1540.0,"108":1541.0,"109":1542.0,"110":1543.0,"111":1544.0,"112":1545.0,"113":1546.0,"114":1550.0,"115":1551.0,"116":1552.0,"117":1553.0,"118":1554.0,"119":1555.0,"120":1556.0,"121":1557.0,"122":1558.0,"123":1559.0,"124":1560.0,"125":1561.0,"126":1562.0,"127":1563.0,"128":1564.0,"129":1565.0,"130":1566.0,"131":1567.0,"132":1568.0,"133":1569.0,"134":1570.0,"135":1571.0,"136":1572.0,"137":1573.0,"138":1574.0,"139":1575.0,"140":1576.0,"141":1577.0,"142":1578.0,"143":1579.0,"144":1580.0,"145":1581.0,"146":1582.0,"147":1583.0,"148":1584.0,"149":1585.0,"150":1586.0,"151":1587.0,"152":1588.0,"153":1589.0,"154":1590.0,"155":1591.0,"156":1592.0,"157":1593.0,"158":1594.0,"159":1595.0,"160":1596.0,"161":1597.0,"162":1598.0,"163":1599.0,"164":1600.0,"165":1601.0,"166":1602.0},"Entry":{"0":"\n\n","1":"\n\nReveille at 3 AM. Got up and rolled my blankets. 3.30 AM. Parade and roll call. 3.45 AM Breakfast. 4.30 AM. Parade and roll call & inspection, left camp at 6.AM. Marched to Ascot Vale station, arrived at station at 10 past 7, entrained at 7.40 AM, arrived at Port Melb at 8.45 AM, had to wait on the pier until 10.45 were then marched on board, after being alloted to our tables we were allowed to come up on deck at 11.15. Sailed at 11.50, a very large crowd of people to see us off, after the boat left the pier we went below to stow our belongings away in their proper places. 2.30 PM passed\n\nQueenscliffe. 3.40 PM Pilot went off our boat and took our letters with him. 4 PM passed through the heads, saw a shoal of porpoise sporting about in the water near the boat, throwing about a lot of water. 4.30 Had our orders read to us, and then had our lifebelts and hammocks given out to us. Passed two steamers coming into port; walked about the deck until 5 PM then had tea, afterwards coming up on deck to enjoy the breeze, so far had remarkably fine and calm weather, three of our chaps had to leave the table on very urgent business. i.e. (Mal de mer). 6.25 PM passed a large boat going towards Melbourne. 7.30 PM slung my hammock and went to bed tired out, never woke till next morning. \n","2":"\n\n5.30 bugle call, got up and rolled my blankets and hammock, and had a wash, had a big struggle to get into the wash room, the room not big enough for the crowd on board, 1600 men. 6.30 first parade, was appointed mess orderly for the rest of the voyage. 8 AM breakfast (Curry & Rice) washed up after breakfast. I have 10 men to look after, cleaned knives, forks and spoons, to make them look respectable. \n\nSaw two whales spouting water.\n\n11 AM inspection of tables & cutlery by master of ship and CO of troops, then sat down till 12 when I had to get the dinner, washed up after dinner, and had a sleep for an hour. 2.15, had to close the port holes as the spray was coming in. 3-30 drew rations for the table 4-45 got tea. 5 PM tea, didn’t have any, got rid of everything I could, lost all interest in everything. 5.30 washed up. 6 PM put up my hammock and crawled into it, and never moved till next morning. Passed Adelaide ½ past 6 Saturday night, well out to Sea. \n","3":"\n\n5.30 got up, put my hammock away and had a wash, boat rolling a bit with plenty spray flying, a few albertros’ following the boat, put back my watch 20 minutes, 6.30 parade at tables. 7.30 got breakfast from the cookhouse. 8.30 washed up not feeling too clever. 10 AM Church parade, but didn’t go, Mess orderlys exempted; 11 AM Inspection of tables etc. 12 AM Dinner, feeling better, had a good dinner, Soup, roast beef, potatoes & Peas, with plenty bread & butter. 1 PM everything cleaned up, lay down to have a read. 2 PM Muster parade, 2.30 Lifeboat drill with our lifebelts on. 3 PM came below \n\nagain; 3.30 got the bread. 4.30 set the table. 4.45 went for tea. 5 PM Tea then washed up with hot salt water, not allowed to use fresh water, had some music on gramophone. 6.30 put up our hammocks. had some music from the band, no sign of land, well out in the Aust Bight, the boat starting to dip and roll again, plenty of spray flying over the boat. 8.30 went to bed \n","4":" \n\n5.30 got up, put my hammock away and had a wash, put my watch back 20 minutes. 6.30 first parade. 8 AM Breakfast (Porridge & Stew.). (2 Lge loaves, 1lb butter 1 tin Milk ½ lb tea, 2 lbs Sugar, to do 10 men each day, 1 6lb tin Jam to do 3 days.) 8.30 washed up and cleaned knives, forks & spoons and put them out for inspection at 11 AM, passed a dead whale with hundreds of birds on it. 12 AM Dinner. 1 PM all washed up, lay down on deck to have a read, but wind was too cold, so came below again. 2 PM parade. 2.30 lifeboat call, scrambled like mad to get our lifebelts on, then rushed up on deck along side our rafts. 3.30 got bread. 5 PM Tea. Band played until ½ past 6. Went to bed ½ past 7. \n","5":"\n\nUp at 5.30. Parade at 6.30. put back my watch another 20 minutes. \n\nbreakfast at 8 AM Porridge & Stew. 9 oclock had an argument with Guard just come off duty, wanted to have breakfast on my table after being cleaned, but objected & won the argument, all cleaned up at 9 AM. Inspection at 11 AM. Dinner at 12 AM. Soup, Roast beef, cabbage & potatoes, 1 PM everything cleaned up lay down to read for a while, feeling tiptop, weather keeping fine, but a big swell on the water, had our pay books given to us. 5 PM Tea. 6 PM all cleaned again. 6.45 lifeboat alarm (20 men to each raft). 7 PM concert on upper deck. 9 oclock went to bed, passed two ships at midnight \n","6":"\n\nup at 5.30, 7.45 got breakfast from cookhouse, but got knocked over on the deck, and got rolled in curry and rice, had to wash my clothes to get it off, caused a great deal of amusement to the onlookers, about ½ Doz chaps fell down the stairs with theirs. 9 AM everything cleaned. 11 AM inspection. 12 AM dinner. 1 PM all cleaned again. 2 PM inspection by the Doctor, 1 case of measles on board, the sea getting rough with waves breaking on the bow, with plenty spray blowing all over the boat. 3.30 got bread. 5 PM Tea. Boat rolling a lot the crockery falling all over the place. 7 PM life boat alarm. 8.30 went to bed. \n","7":" \n\nThe same programme as Wednesday with a medical inspection at 9.30. Weather improving, well out in the Indian Ocean.\n","8":"\n\n5.30 got up, and scrambled to have a wash. 8 AM Breakfast, weather getting warm. 9.30 medical inspection. 11 AM Tables inspected by master & CO. 12 AM Dinner. 1 PM all cleaned up sat down to write a few letters. 3.30 got bread and pickles. 5 PM Tea. Stewed rabbits & potatoes, washed up and went on deck to have a read and cool down. 7 PM lifeboat alarm. 8.30 went to bed. \n","9":"\n\n5.30 got up and had a wash, got bread and dry stores. P ut back watch another 20 minutes. 8 AM Breakfast. 9.30 everything cleaned up, had to go on Full dress parade at 10.30, carrying all my kit, blankets, hammock & lifebelt, lost my white shoes but got them back again. 12 AM Dinner. 1 PM all cleaned again and had to go on parade again at 2 PM. 3.30 dismissed, had some boxing contests during afternoon. 5 PM tea. 7 PM Concert. 8.45 went to bed. Weather getting very hot canvas awning put up over the deck to keep the sun off, our boat did 309 knots for the day. very good going. \n","10":"\n\n5.30 got up and had a good scrub, did not sleep too well, weather getting too hot, 8 AM breakfast, bacon & Eggs. Parade 9.30. 10 AM Church Parade, hymns sung \"All people that on Earth do dwell\", \"Lead Kindly Light\", & \"Abide with me\". 10.45 Church parade over. 11PM Inspection of ships. A few flying fish about, getting well out in the Indian Ocean, getting near the Cocos Islands where the Emden was sunk. 12 AM Dinner. Free issue of cigarettes, (4 Pkts each) & Oranges & Lemons. 4 PM life boat drill alarm, made a few frightened, thought it was \"dinkum\". 5 PM Tea. 8.30 made my bed on deck, too hot to sleep below. \n\n9 PM started to rain so had to go below. \n","11":"\n\n5.30 got up and had a scrub. 8 AM breakfast, Porridge, Curry & Rice. 11 AM Inspection. 12 AM Dinner.\n\n1 PM Sat down to have a quiet read. 2.45 got a lifeboat alarm, were then sent below to take off our boots and go without them for an hour. 3.30 got bread & Cheese. A bit shoal of flying fish near the boat. 5 PM had tea, afterward lying down on deck to have a read & rest. 8.30 made my bed on deck and enjoyed a good nights sleep. \n","12":"\n\n5.30 got up and had a wash. 8 AM breakfast. 9.30 Inspection by Doctor. 11 AM Inspection by C.O. 2 Ships Captain. \n\n11.30 had limejuice issued to us & sugar, (very good stuff too). 12 AM Dinner. 3 PM First Choir practice. 5 PM Tea. 7 PM Concert on upper deck, rained very heavy during night some of the chaps had to come below with their beds; passed a floating mine, but was reported too late to get it. \n","13":"\n\n5.30 got up, put my watch back again have done so every morning since I came on board. 8 AM breakfast. 9.30 Medical inspection. 11 AM boat Inspection. 12 AM Dinner. 4.30 Lifeboat alarm, got some skin knocked off my hand in the rush. 5 PM Tea. 8.30 made bed on deck, started to rain at ½ past 12 PM, had to get up at 3.15 AM, and come below as the rain was coming down in lumps, coming right through the canvas awning, got my blankets a little wet. \n","14":"\n\nUp at 5.30, scrambled to have a wash. 8 AM breakfast, usual porridge & stew. 9.30 had to go on parade to get paid (10\/-) only paid per 1\/- day until we reach the other side, had medical inspection at the same time. 11 AM Inspection of tables by Master & CO. Still a lot of flying fish about, weather much cooler, with a nice cool breeze blowing. 12 AM Dinner, more limejuice issued, no parades for the afternoon, half holiday for sports, Tug of war \n\nwon by Queenslanders, Pillow Fights Potato Races, Cock fighting, Sack races. Wheelbarrow races, started a 2 PM a real good afternoons amusement. 5 PM Tea. 7 PM Concert on Deck. \n\nRevised list of rations for 10 men. 1 lb butter, ½ lb tea, 2 lb Sugar, 1 tin milk, Jam, 1½ lbs Cheese, 5 loaves bread, Bot Limejuice, meat, \nvegetables, Soup Porridge\n & rice. 8.30 went to bed below deck as weather did not look too good, wind blowing very strongly. \n","15":" \n\n14 days out. 5.30 got up, wind still blowing very strong, but no rain. 8 AM Breakfast, porridge & Fish. 9.30 Medical inspection. 11 AM inspection of tables. 12 AM Dinner, wind nice and cool, not blowing so strong. \n\n 2 PM Marched round the boat with the band playing. Expect to cross the equator about midnight, went to bed at 8.30.\n","16":"\n\n5.30 got up, had been raining again. 8 AM Breakfast. 11 AM inspection of tables. 12 AM Dinner. Father Neptune on board, having a half holiday. Festivities started at a ¼ to 2, a great amount of amusement caused by the appearance of Father Neptune and his followers. Two Officers and two men from each reinforcement were white washed and ducked in the big square canvas tank about 4 ft deep, each man was sat on a box with his back to the water, and after being \n\npasted and shaved was pushed over backwards into the water, a splendid show, but did not last long enough, over at a ¼ to 3. (crossed the line at 7 PM on Friday night.) 5 PM Tea, wind still blowing fairly strong, but boat going very steady, very much cooler. 9 PM went to bed. \n","17":"\n\nThe usual routine, nothing happened of any importance, all looking forward to seeing land in the morning, went to bed at 9 PM. \n","18":"\n\nUp at 5 AM to see the sunrise, saw the shores of Ceylon in the early morning light, a never to be forgotten sight, a beautiful sunrise, with the morning mists on the shore, the boat circled round off the enterance to Colombo till 8 AM, when the Pilot and Doctor came on board. Had to parade on Deck at 9.30, inspected by Dr at ¼ to 10, passed the A.18. Wiltshire going to Melbourne with returning troops on board, gave three cheers as they went past, saw a huge whale sporting about in the water, the largest I have yet seen, must have been about 30ft long. A lot of native boats sailing about, passed 5 Vessels coming into port going towards Melbourne. There is a fine lot of warships about, look as if they could do a lot of damage, land looked \n\nvery pleasant after not seeing it for so long, the boat dropped anchor at 20 to 11, it was a beautiful sight coming into port, with the different shades of green on the trees growing almost down to the waters edge, the darkies came along side our ship in small rowing boats calling out for money, and diving for it, there were hundreds of native fishing boats out, \n\nThe coal barges came along side and started coaling at ¼ past 11. 12 AM had dinner. 1 PM back on deck again, there were two small darkies on the deck singing \"Ta Ra Ra A boom de A\" for pennies it sounded very quaint. \n\nIt was arranged that 10 men from each subsection go ashore at a time making 500 men for the afternoon, they went ashore at 2.30 PM until 6 PM. Had tea at 5 PM only four on my table, the other 6 on shore. They are still coaling, the sun has just set, a fine sight very rich colorings in the sky, looking forward to going ashore tomorrow. 7.40 the lot that went ashore came back as happy as sandboys and started to relate their experiences and showing what they had bought, almost everyone brought a bunch of bananas as well as cocoanuts and oranges. 9 PM went to bed listening to the jaber of the Natives. \n","19":"\n\n5.30 got up and had a wash, still coaling, coaling all night. 7.30 had breakfast. 9.30 second batch went ashore. 10.30 had a shave and wash in a condensed milk tin of water. 12 AM Dinner. On parade fully dressed to go ashore at 12.45 AM, left the ship to go on shore at ½ past 2, PM. after getting on shore were marched to the barracks and were dismissed at ¼ to 4, and had to fall in again at ½ past 5, went for a wander round Colombo, trying to get lost, found our selves in the native quarters and had to get a ricksha back to the barracks to get out of a mob trying to sell us things we did not want, one of them put a ring on my finger while another put a scarf round my neck and asked me if I wanted something nice to drink, got back to the barracks just in time to miss the rain, a real thunderstorm, it was a tropical downpour, came down in bucketfulls, didn’t fall in until after 6 PM, reached the boat again at ¼ to 8 and had to get pulled into the ship four times before we could get off the barges, slightly wet and very tired. I got some postcards, silk and books of views \n\nand posted them at the YMCA on shore before I left, I went from one side of Ceylon to the other, saw some very beautiful sights one thing I noticed very much, \"the very tall smells\". also the absence of horses, only saw two, and very poor specimens at that, I was greatly taken with the funny carts, with the small hump-backed oxen to pull them, they drive them with a ring through their nose, when shopping the darkies usually ask about four or five times the value of an article. if they ask 4\/- you usually get it after a lot of bargaining for about 1\/-, bought three singlets for 2\/6, would pay that for one in Melbourne, there are some very fine buildings in Colombo and the roadways are all asphalted and very clean. Saw some very funny looking birds. I was very much surprised at the number of darkies that could speak english, nearly all the shops have their names up in english. \n\nI went to bed at 9.15 PM very tired but very well satisfied with my afternoon’s outing. Still coaling and discharging cargo (Mutton & Beef).\n","20":"\n\n5.30 got up, raining very heavy coaling finished at ½ past 3 AM. Put on 2,000 tons, putting on \n\ntea for Port \nSaid\nSuez. 8 AM breakfast. Finished loading and unloading at 9.30 AM. stopped raining, turned out a lovely morning. 10.30 AM the Pilot came aboard. 11 AM had to stand at our stations with our lifebelts on. 12 AM hauled our anchors up and steamed out on our way to Port \nSaid\n Suez, then came down for dinner. 2.30 PM passed two steamers going into Port. 4 PM no sight of land. 5 PM Tea. 8.30 went to bed. \n","21":"\n\n5.30 AM got up, raining very heavy and very dark put back watch 10 minutes. 12 AM Dinner. 1 PM passed another steamer going to Colombo. \n","22":" PM Tea. 7 PM Concert on Deck, went to bed at 9 PM. 10 PM Lifeboat alarm someone turned the Electric Light off. Caused a lot of confusion, 10.30 went to bed again. \n","23":"\n\n5.30 got up, started to rain. 7.30 AM passed a steamer going towards Colombo, about 8 miles away. 8 AM breakfast. 12 AM dinner. 2 PM Parade and march round deck. 3.30 Boxing tournament. 5 PM Tea. 8.30 PM went to bed on deck had to get up at ¼ past 4 and come below as it was raining. \n","24":"\n\n5.30 got up, blankets all wet, still raining very heavy. 8 AM breakfast. 10 AM passed a large steamer very close. 11 AM one of the railway unit died in hospital from pneumonia. \n\n12 AM dinner. 3 PM Funeral on deck, 3 Volleys fired and the Last post sounded, the Dead March played after the body was committed to the deep. 5 PM Tea. 7 PM Concert on Deck. 8.30 went to bed on deck.\n","25":"\n\n5.30 got up had a good night’s sleep. 8 AM Breakfast. 10 AM Church Parade. 12 AM Dinner. 5 PM Tea. 7 PM Lecture on deck by Cpr Hampson. 9 PM Went to bed. \n","26":"\n\n5.30 got up wind blowing very strong saw the first Albertros after passing equator. nothing of any importance to record. \n","27":"\n\n5.30 got up, wind blowing very strong and sea very lumpy. 8 AM Breakfast decks very wet and slippy, porridge and sausages all over the place and especially on the stairways. 2.30 PM got our kit bags up from the hold to get things out of them and then returned them again. 5 PM Tea. first night that no matches were to be struck on deck and no lights to be shown. went to sleep on deck at 9 PM a beautiful moonlight night, with wind blowing fairly strong.\n","28":"\n\n5.30 got up. 7 AM sighted the Socotra Island about 10 miles away on our right. 10.15 AM Sighted Cape Guardafui on our left 3 miles away. There were 21.100 letters off the boat posted at Colombo besides the letters we posted ourselves from 1534 men. some letter writers. \n\n2 PM still sailing off coast of Africa (Italian Samoliland) looks very rugged. Some parts very flat, other parts rising straight out of the water, solid rock. Saw a small settlement with three large white buildings with a steamer lying close into shore, a large shoal of porpoises jumping about in the water they shot one from the top deck. passed the rock that the S.S. China struck \n\ntwo arab boats (feluccas) passed close to boat. Well into the Gulf of Aden. 5 PM Tea. 8.30 went to bed on deck.\n","29":"\n\n5.30 got up. still within sight of land British Somaliland. 7 AM paid on boat deck (£1.0.0). We carry a crew of 140 Men all told. 10 AM out of sight of land. 12 AM Dinner. 5 PM Tea. Still no sight of land. 9 PM went to bed on deck. \n\nwas kept awake with some fools running round calling out they could see lights \n","30":"\n\n5.30 got up, within sight of land again going through \"Hell’s Gate\". 6 AM a light Cruiser came alongside and ordered us to stop, could not see properly, not light enough, after seeing who we were we were allowed to proceed on our way. they signalled \"Good luck\" to us, as they steamed away. 9.30 AM a steamer passed us on the port side. 10.30 another steamer passed us. Well into the red sea. 2.15 PM passed 4 steamers, 2 on each side of us one a greek boat, was close enough to read the name on her side allso passed some islands, solid Rock standing straight out of the water. called \"the twelve apostles\". One with a large light house on. 9 PM went to bed. \n","31":"\n\n5.30 got up. 6 AM saw a native fishing boat in the half light about two miles away. 9 AM great excitement among the mess orderlies as prizes were to be given for best table. 10.30 AM passed 2 steamers on the starboard side. 12 AM passed a Oil Steamer on our port side. Have now covered over 8,000 miles. 3 PM Tugs of war between the various reinforcements won by 29th N.S.Wales. 3.30 Boxing contests on board, final. 7 PM first concert on board since leaving Colombo. Prizes won in contests were given out. 9 PM went to bed\n","32":"\n\nThirty day out from Melbourne, 5.30 got up. 7 AM passed a steamer on our Port Side. no sight of land. \n\n4.30 PM had a lifeboat alarm. 7 PM went to lecture on upper deck by Corp. Hampson M.P. on \"3,000 miles through Canada\" enjoyed it very much. 8.30 went to bed below, too cold to sleep on deck and wind blowing very strong. passed a few ships in the night. \n","33":" \n\n5.30 got up. Wind blowing strong and very cold had to put on some warmer clothes. 9 AM passed a large lighthouse. 3.10 PM Sighted Egypt on our port side. 9 PM went to bed, wind blowing very strong and very cold. \n","34":"\n\n5.30 got up, very cold and wintery very close into land, shore very rugged and bare, no sign of life of any kind. 7 AM blankets and Hammocks returned to store. 8.15 passed a large steamer. \n\nList of duties on board that mount duty every day. \n\nMain Guard (30) – Water Picquet.\n\nCooks Fatigue. – Dry Store Squad\n\nSweepers (Latrine Experts) – Deck washers\n\nSubmarine Guard. – Gun Crew. \n\nOrderly Room.\n - \nMilitary Police\n (31).\n\n3 PM saw a steamer that had drifted ashore owing to her propeller breaking, had a tug alongside trying to get her off. 7 PM dropped anchor just outside the harbour at Port Tewfik in the dark, very curious as to what the harbour would look like in the morning. 9 PM had to get our kit bags from the store room. 9.30 PM curled up in my overcoat on the floor and tried to get some sleep, no blankets to be had. 12 PM woke up feeling very very cold, so curled up with another chap and tried to keep each other warm. \n","35":" \n\n4.30 AM got up feeling very cold and miserable, had a cup of tea and tried to make myself warm. \n\nthe steamer that run ashore was towed into port with a big list to starboard. \n\n7.15 AM breakfast. 8 AM hauled up anchor and steamed into the wharf and tied up, the 28th Reinforcements had to wait behind and clean up the ship, twelve of us were detailed to stack kit bags on the shore as they were brought ashore. 10 AM was the first ashore had to stack over 3,000 kit bags on the wharf. 12.30 AM had some dinner (bully beef and biscuits) 2.15 PM marched off the boat and formed up. 2.30 moved off to the camp headed by the band, reached camp at 4.30 PM. The city is built in two parts joined together by a long narrow roadway built across the swamp. the buildings are very quaint and altogether different to the buildings in Colombo, the 2nd part of the city looks as if a lot of square white buildings were dropped in the sand. there are no long straight streets, they all wind and bend, the main street crosses the railway line about three times, following the beach line. The natives here do not seem as clean as in Colombo, and are not as independent. \n\non the road to the camp while we were resting on the roadside a darkie gave us some very good tumbling turns, in fact he did turns I had not seen before. I also saw a donkey hooked to a water wheel walking round and round, it was blindfolded with a great piece of sacking so as it could not see when the boss walked away and would keep going, it seemed very strange to see an irrigation farm right in the street, it was the only place where there was something growing, you can see for miles and not a blade of grass, only sand and stones and hills. There is a great number of Flying machines up in the air. When we reached camp we were given five blankets to two men & eight men were alloted to each tent. 5.30 we had tea, native bread, bully beef and smoked tea. After tea we walked around the camp and then came back to our beat and made our bed and slept like a log until next morning.\n","36":"\n\nwas awakened by the sound of aeroplanes flying over the camp, lay in bed watching them circling around, got up at 7 AM and had to walk about a ¼ of a mile to get a wash. very cold everyone growling how cold it was during the night about twenty flying machines up at the same time, some looping the loop, others going round and round like a corkscrew. 8 AM had breakfast. More bully beef. 9.30 first parade after the various duties had been detailed we were dismissed. 10 AM had to fall in again were told we were going to get leave for the afternoon but were informed later that it was cancelled. 12.30 AM had dinner (boiled bacon, potatoes and onions) then sat down in the sun for to help digest it. more airoplanes flying about. There are some very pretty little birds hopping about the camp very much like our ground larks only \n\nvery much prettier but do not whistle like our birds. The natives do all the sanitary work in the camp, there are plenty natives working in the camp, it is rather amusing watching them, they jabber all the time and do very little work and are very slow. 2 PM parade voted on the Conscription Question. 5 PM had tea then wandered round for a while then went to bed. \n","37":"\n\nawoke early and listened to the sound of the flying machines. Got up at 7 AM. Had breakfast at eight. one of the flying machines came to grief through the engine stopping, smashed the runners, propeller and wheels off besides damaging the engine. 9 AM detailed off to help put up tents. Dismissed at 11.30 AM. supply of food very short in camp owing to the strike in Australia, not able to get meat and flour. what there is here is very dear, bought two tins of pears cost 1\/2d per tin. the flying machines go up all morning here. The name of the camp is \"Wabour El Maya\" it is a rest camp for troops, it covers a very large patch of ground, about 1,000 acres, on side of the railway is the avation & Indian camps and on the other side is the Australian camp. \"Artillery, Machine Gunner, Infantry, Engineers, Flying corps and Light horse about four thousand all told. 12 AM was told I was going on leave and after getting ready was disappointed & had to put up tents all afternoon so as to be ready for the men coming off the \"nestor\" which arrived at 11 AM at Port Tuefik. 5 PM had tea \"(bacon)\". Afterwards went to the Y.M.C.A. and had a yarn with one of the \"Royal Flying Corps\", who proved to be a \n\nbrother scot, had been in France & Gallipoli and had been here for 9 months (poor devil) it was very interesting listening to him. 9 PM went to bed. very cold.\n","38":" \n\ngot up at 6 AM, (new orders out to get up earlier), (very cold) had to pack everything outside our tents. not so many Flying machines about as 10 of them were broken yesterday, and were not repaired in time. 2 PM went on leave into the city until 6 PM. It is the dirtiest place I have ever seen or want to see, one place had goats, rabbits, fowls and children crawling about together in all sorts of filth. I tried to get into a native temple, but was not allowed in because we had our boots on. I visited various parts of the city and had dinner and tea in one of the hotels and it was nothing to get excited over regarding the quality of the eatables. had a couple of rides in the native \"Gharries\" or carriages which are very nice being rubber tyred and very easy running being pulled by two Arab horses. Visited the \"wassa\" and saw the native can can. all the other kinds of cart work is done by donkeys, being very small and strong, it is surprising what they can shift in the funny little carts. all the streets are very dirty and of course hum very much, and wind and twist about. I soon got tired of wandering about. got back to camp at 6.30 PM very tired and disgusted with what I had seen. 8 PM made my bed and went to sleep. \n","39":"\n\n6 AM Got up and wandered round a bit until breakfast time had some mutton, the first since I landed here. It is rather amusing how they unload the lorry loads of wood, two or three of the natives simply get on one side and push the lot over. 10 AM Church parade in one part and they are working like heathens putting up buildings in another part of the camp. 12 AM Dinner. 2 PM went on leave again until 9 PM. Drove into Suez in a Gharry, then wandered round for a little then picked up two tent mates then drove into Port Tuefik and went along the canal past the Government buildings, enjoyed it very much, then came back to Suez and had tea afterwards going to the native Bazaar and heard the band? sounded extraordinary after our own band. 7 PM drove back to camp after having a good afternoons outing. 8.30 PM went to bed.\n","40":"\n\n6 AM got up and handed in our blankets as we were informed that we were to entrain in the afternoon. 10 AM medical inspection. 1 PM dinner, then packed our kits ready to go on the trucks. 5 PM had tea, then wandered round among the infantry chaps and found Reg Ralph of Albert Park. 9.15 PM fell in and marched up to the train and got aboard. 10.20 PM steamed out on our way to Alexandria, crossed the Nile river \n\nStarted to rain shortly after leaving the station, stopped at a few stations along the road, at every station the niggers were selling oranges, cigarettes, cakes & lollies, one of our chaps lost a 1\/- through a \n\nnigger running away with it instead of giving him the lollies he asked for, another lost his hat, when he put his head out of the window a darkie grabbed his woollen cap off his head as the train went by, had breakfast in the train about 8 AM (bully beef). \n","41":"\n\narrived at Alexandria at 9 AM alongside the boat \"Karoa\" Glasgow’, came on board 10 AM and allotted to our tables, and were told to put our lifebelts on and not take them off until our trip was over. 12 AM made mess orderly for Sergeants mess. 2.30 PM Dinner. 3.30 PM boat left the wharf followed by a destroyer (76). 5 PM had tea, (bread & Jam). 7 PM went to sleep curled up in a hammock bin, no blankets. The wharf and harbour here is very much like Port Melbourne, a fine lot of large vessels in port, the Karoa is larger that the Port Sydney, but not nearly so well fitted up, and the rations are not so good or as plentiful. \n","42":"\n\nGot up and found we were an hour too soon, as we had lost one hour during the night. 8 AM got breakfast for the table (Bread, Porridge not half cooked and tea that tasted as if it had been stewed all night) all the chaps are growling because they are all on duty. 400 are on duty at one time. the boat is rolling a bit and upsetting some of the fellows who were not sick on the other boat, we have two destroyers with us, one on each side sighted a submarine off port bow, the destroyers \n\ngave chase, and our boat turned right round had two blankets given me during afternoon. Sun set at 4.15 PM. Had tea at 5 PM quite dark. Went to bed about 7. at 11 PM the engines stopped for about an hour owing to something breaking but they fixed it up. \n","43":" \n\n5.30 got up and had a wash the destroyers are still with us. after breakfast we had to scrub the deck. 11 AM had all our ship plates and cutlery taken away. have to use our mess tins the sea is very calm and smooth. during afternoon we had our kit bags up from the hold to get some more warm clothes on before we left the boat. \n","44":"\n\n5.30 got up and had a shave and wash. 7 AM. Passed our blankets in. land in sight on both sides of us. 9.30 AM dropped anchor in the outer harbour, too late to get in through the harbour gates. were all disappointed as we expected to get off at mid-day. 3 PM hauled up anchor and steamed through the gates into the inner harbour. a most beautiful harbour, the largest harbour I have yet seen. We got a very good welcome from every one around the gates, there is a road way right over the enterance, the gates swing inwards in two halves, they are made of solid steel. there is a very large collection of all kinds of shipping including some very large man o’ wars Italian and British about 50 of them, we got a good cheer from them as we sailed past them, they all saluted us by dipping their flags. We are the first Australian troops that have \n\ncome to Italy. The name of the port is Toranto. We also saw some torpedo boats & Submarines right alongside us. also a Sea-plane, the first I have seen. It can go at a very fast pace over the water and in the air, we dropped anchor again at 4 PM in the harbour till the morning. 7.45 PM Concert on board by band a lot of growling by the men over it as it was for the officers. 9 PM went to bed, had 3 blankets between 2 of us others had none.\n","45":"\n\n5.30 got up. Had a good sleep. 7 AM had our usual starvation breakfast. 9.30 left the boat on small steel motor barges (that were specially built for Gallipoli) and were taken to a small white stone pier, and were then marched up the hillside to the camp, we were then told off in 50s to each hut. after taking off our gear we had something to eat. (Bread, sardines, bacon & bully beef) then went for a wander round the camp, the camp overlooks the harbour and is right on top of the cliff, and is very large. there is a large number of troops here (british) Tommies, Scottys, Naval men, Jamacians, Cingalese, & Indians. We are the first Aust troops here. I tried to buy something at the Canteen but they would not take our Australian money but were afterwards told it had been arranged that our money could be used. our 1\/-s are worth about 18 Italian pennies. There is a very large wireless station right alongside the camp here. We never had our tea until a ¼ to 8 PM we were nearly starving and very cold, we are beginning to feel the cold now. during the afternoon we were all \n\nput into quarintine owing to the number of measle cases we have had among us. We were told by our O.C that we were very lucky to get through our trip without any mishap as the steamer that followed us into port had sunk a submarine that morning and about a week before a steamer had been sunk in the outer harbour by a german submarine while she was anchored. We are not going to be here as long as we expected as we are to leave tomorrow night. 9 PM went to bed with the tummy ache. \n","46":"\n\ndidn’t get up early, had a lie in for a change. a very cold night. 8 AM had breakfast, bread and stew no tea. 9 AM had to go on duty till 11 AM, (the first I have had since leaving Melbourne) as picquet round our part of the camp. 12 AM Dinner, Tea, bread, Jam & meat paste. the boat that left Alexandria the same time as we did arrived with infantry at 10 AM. they saw some sights that we never saw. they came via The spannish canal. 3 PM went on duty till 5.30 PM filled in the time yarning to the \"tommies\" it is very interesting listening to their experiences. 8.30 PM went to bed (still got the tummy ache).\n","47":"\n\n5.30 AM had to get up and go on duty at 6 AM. Relieved at 7 AM. Very cold and frosty. 10 AM went for a route march along the road, thought we were going to see the township, but we went the other way. there are some very fine olive plantations round about here, they look very fine, all the trees are split and twisted as if they had been struck by lightning; they do all the plowing here by oxen and iron plows with one large Wheel in front. I saw a very large dirgable baloon today, the first one so far. It was an Italian one. \n\n2 PM a football match was played between our own troops. we had to shift out of our huts into other ones. Went to bed at 8 PM very cold, a lot of the chaps in camp broke out and went into the town. the Colonel sent out a large picquet to get them, they caught about 140 of them.\n","48":"\n\nDidn’t get up till 7 AM when our OC roused us out of bed, had been raining all night. 10 AM went to Church service in one of the hut. 12 AM had our Xmas dinner, (stew, bread, cheese, Jam & Margarine) afterwards had some music from the Gramophone. Another boat arrived with troops during the morning. 3 PM went for a walk along the shore and had a yarn with some tommies. 5 PM had tea, some class, Salmon, biscuits, figs, & tea & Cake, enjoyed it very much, it was supplied out of the comforts fund and was very acceptable.\n","49":"\n\n7 AM Got up, on parade at 7.30. 9.30 on parade again, inspected by the C.O of the camp, who was very pleased with the turnout, afterwards we went for a march along the roadway through the mud. 2 PM a rugby football match was played between the Italians & British Tommies, won by the Tommies. 7 PM Concert in YMCA Tent, by the F.A. 8.30 went to bed, weather not quite as cold. \n","50":" \n","51":" AM Got up on parade at 7.30 were told we were to leave during the afternoon. 9.30 muster parade, were told what we must and what we must not do. 10.30 AM were paid 15\/- in Italian notes, making £2.15.3 to date, since leaving Melbourne. Put on extra clothing to keep us warm during our train journey. 2.30 PM put my kit bags on the trucks helped carry the officers luggage from the tent to the train, the hardest work I’ve done for months. \n\n3.30 PM had tea. 4.30 PM. Got aboard the train, 8 to each compartment, Dog Boxes had to wait till 10 past 8 before we moved off, put in the time howling all the songs we could think of, moonlight and very cold, saw some very large towns along the line. \n\nIn our compartment is\n\nBdr Burrows – Dvr Young\n\nDvr Aburrow – Dvr Petty\n\nDvr Redden – Gnr Stredwick\n\nDvr King – Gnr Fitzgerald.\n\nStill travelling, 6.30 AM arrived at Bari, our first stopping place, had breakfast. Saw a lot of snow on the trucks and carriages that were coming down the line. The town here as far as can be seen from the station appears to be of some importance, has a very large railway depot, with some huge engines with two tenders on them. The Electric trams here have women conductors on them. left Bari 10 AM. passed a large building with an anti-air-craft gun on the roof, also a lot of trucks with heavy guns on them, going up to the front, and train loads of troops and as they were going up, hospital trains with wounded were coming back, saw a lot of aeroplanes on trucks on the siding as we went past, We stopped at Foggia at ¼ to 2 for dinner, at different parts along the line were groves of Olive trees miles long, also Orange trees and Vinyards, passed a very large Wine (Vino) Distellery, as we were stopped on the line some Italian boys amused us by snowballing each other. At Barletta snow had fallen very heavy. \n","52":"\n\nTravelling all night, stopped at Angona for breakfast left at 8 AM. more snow, passed some trucks with heavy howitzer guns on, we went for miles on the train right along the sea border with only a stone wall between us and the sea on one side, and on the other cliffs a couple of hundred feet high. I was greatly taken with the way the hay stacks were built with a long pole driven into the ground and the hay stacked round it, then when they wanted to use it, they cut \n\nas much as they want, off with a hay knife. Arrived at Faenza at 1 PM and marched up to the rest camp, about a ¼ hours walk from the station, when we got there they had a hot dinner waiting for us. then we went for a walk around the camp to see what there was to be seen, bought and posted some postcards also bought a mosaic brooch. had tea at 5.30 PM. fell in again at 6.30 PM and marched back to the train which had been disinfected while we were away. we also had an extra blanket issued to us. left Faenza at 8 PM. travelled all night. \n","53":"\n\nStill in the train arrived at Verghera 8 AM. had breakfast, snow started falling, left at 11 AM. passed more guns in trucks, the roadway here is marked with large stones at even distances along both sides so that it can be picked out in the snow, we are passing through the hills in a snow storm. Reached Turino at ¼ to 3 PM, for tea, left again at 20 past 4, filled in the time with a snow ball fight, the snow was very thick, over 1 ft deep on the station. Turino is the junction of 5 railway lines, and is the busiest centre in Italy. There are some very fine buildings to be seen here, being very large and of very fine design. 5 PM started to go through the Alps, it is a remarkably fine sight going along the valleys between the mountains, snow everywhere, some places it was right up to the top of the fences, one house was almost buried, the chimney was all that was to be seen of it. During the night we passed through over 50 tunnels, some very long and narrow, just room for the train to go through, the longest tunnel took 35 minutes to go through, and was extremely cold while we were in it, didn’t go to sleep all night as I wanted to see the beauties of \n\nnature in the moonlight, it was simply glorious to see the huge peaks standing straight up to the heavens, I don’t think it would be saying to much in saying it is one of the finest sights in the world, and it is only after seeing the snow here that one can understand the meaning of \"White as snow\". \n","54":"\n\narrived at Modane, just over the Italian border the first French town we arrived at. (2084 ft above sea level, 22 degrees below Zero) at 5.30 AM, left again at 8.15 AM. first saw French soldiers here, had steel helmets on, saw a very large church RC on a hill top, with no other sign of buildings near it. At St Michael’s station is a cemetery where 40 French soldiers are buried, the result of a railway-collision in the alps. There is a very large water pipe going right through the hills, it forms part of the water supply of Lyons. Arrived at Montemelas 11.30 AM for a cup of tea, while they had to take off the carriage in front of us, owing to the coupling breaking, we were not sorry as we were getting a very rough ride, we left at 1 AM for Lyons. After leaving, part of the line runs alongside a very large lake, going right round one end of it, and then through some very long tunnels into the hills again. \n\nArrived at Lyons 8 PM. then on to St Germaine arriving at 9.15 PM. expecting to get out, but were sidetracked for the night, H Petty & F Aburrow had to go on Guard outside the carriage for 1 hour, Kaffir had an argument, with the guard on the next carriage and finished up with \"tapping him on the beak\", Roland King had to go to the hospital with a swollen foot caused by the intense cold, it made more room for us to get some sleep. I slept on the floor, woke up during the night to find Joe & Stredy asleep on top on me. \n","55":" \n\nNew Year’s Day.\n\n7AM were roused out by our O.C. (Lieut Turner) to march up to the rest camp, had been snowing all night, had to return 1 blanket each, had some hot stew for breakfast without salt, then had to come back to the train to go on guard for 1½ hours, got covered with snow and we all had to shake our clothes to get it off. There is a train load of Indians alongside us bound for Italy. We sat in the train from 10.30 AM till 4.15 PM at the station without getting out, we are all suffering from corns on the seat of our trousers. The train travelled very slowly all night. \n","56":"\n\nArrived at Saincaize 7 AM for breakfast. left again at 9.45 AM. some of the chaps filled in their time by skating on the ice alongside the line. We had a shave in the train as we were going along, Bdr Burrows used cold cream instead of toothpaste to clean his teeth, Joe Redden enjoyed his shave so much, he said he was so happy he could cry, passed a train with over 200 very fine mules on board. The trains that pass us are very long, one we counted had 42 carriages. Just outside Saincaize is a very large aerodrome, one station we passed was almost covered with guns of all sizes. At Bourges we spoke to an American lady who told us that the American troops had gone to Italy. Saw a funeral going along the road, the hearse went first, then the men with the women following, all walking. At Vierzon we got a bottle of brandy, cost 13 Francs, (Stredy & Kaffir were happy for the rest of the day), while at the station a train load of French soldiers left on \n\ntheir way to the front, their women folk going with them part of the way. After leaving the station we saw a very large wind mill, the only one seen in our travels across Europe. \n\nCould not help noticing the cemetrys as we went along, all the tombstones had wreaths of greenery on them. evidently some french Xmas custom. We passed a large USA camp, the country between Vierzon & Tours appeared to us to be the oldest part of the state, judging from the style of the buildings and the state they were in, the houses for miles were built right into the side of a hill, with others in terraces behind them, the chimneys coming out through the ground. Reached Tours at 6 PM for tea, and at 7 PM the train went off and left about 300 of us behind including most of the officers. after it had gone about an hour we woke up to the fact that we were left behind, at 5 to 9 PM we went on in a special train to catch them, didn’t catch them until 3 AM next morning 60 miles away, feeling very cold and sleepy, went straight to bed and never woke till 7 AM.\n","57":"\n\nStopped at Mezidon fro breakfast 8 AM, then went on the last stage of our railway journey across France, from here on very little snow had fallen, and the country looked more like our own, with its green pastures, sheep & cattle, nearly all the cows are of the Polled Angus variety, and they looked very fine & in good condition. We also saw a couple of very fine cathedrals, just before we reached Cherbourgh, the country side is remarkably pretty with its trees, \n\norchards and hilly country with small streams of water running through it, Was greatly taken with the clothes washing place on the side of one of the streams, there were a lot of French women washing clothes, using the stream water as it was wanted. could not help noticing how many of the trees were covered with mistletoe on their branches and ivy around the trunks. \n\nWe reached Cherbourg at 4 PM and went straight onto the wharf and disentrained, then marched into the barracks and passed our blankets in, then had some hot stew, which was very acceptable. Went on board the Cemearea (C106) at 8 PM, left the wharf at 10 PM, for England (Southhampton), had a shave and clean up and then rolled up in my overcoat and went to sleep on the floor. \n\nFriday Jan 4th \n\nArrived off Southhampton 5 AM and dropped anchor outside till 7 AM when we steamed into the Wharf. Got up at 5.30 AM and sneaked a wash in the crews quarters, the 28th had to get all the kit bags out of the hold and clean the ship. 9.30 AM marched off the boat to the train, and got aboard, 9 to a compartment, left at 12 AM for Salisbury, had a cup of tea & biscuit on the way, to make up for the breakfast we didn’t have, arrived at Codford 1.30 PM and disentrained, formed up on the station and marched into our camp Heytesbury, Wiltshire, the road to the camp is a very good one winding about with some very fine elm trees on each side, when we got out of the train we were greeted with the rumble of guns being fired not far away. Reached camp at 3 AM and had a hot meal, afterwards \n\nwe were all marched onto the green and divided into batteries, N.S.W. Vics, Tassys, S Aus, & W.A into different batteries, the Vics are to be known as the No. 2 battery, we were then marched (in 20s) down to the QMS to give our caps in (as we were not allowed to keep them), and to get five blankets and a straw mattress and then had tea. We were put into Isolation for 1 month, and not allowed to go out of the camp. The distance from Cherbourg to Southampton is 90 miles, at the wharf we saw the \"Aquitania\", draught 42ft, the 2nd largest steamer and the fastest in the world. It is claimed that Southampton is the largest naval base in England, it certainly is a very large place, the train we were in, a 3rd class, is better than our","58":" class with heaters under the seats.\n\n and we were sorry to get out of them. 5.30 PM had tea then made our beds, very glad to get into it, 9 days since I had slept in a bed or had my clothes off, quite a luxury to have a good scratch, there is a coal fire in the hut, which is a blessing as it is very cold outside. \n","59":"\n\n7.30 AM got up and had a wash, enjoyed a good night’s sleep, without feeling cold. 8 AM had breakfast, porridge & stew. 9 AM had to go on parade, and was picked out for one of 36 Senior Gunners, then got our kitbags. Afterwards had to go to dentist to have my teeth examined, have to get a new top & part lower set, then on to the Dr. for a medical exam, 12.30 were dismissed 2 PM had dinner no parades for afternoon. Went to YMCA & got some PCards & posted them, 6.30 PM had tea at the Canteen \n\nthen came back to hut, had a shave, cleaned my gear & then went to bed. \n","60":"\n\n6.30 AM Got up, 6.45 on parade, 7.15 dismissed, 8.45, on Parade again, thought we were going to church, but were not allowed as we are in quarintaine. 9.15 were dismissed, we then went for a walk to make ourselves warm, went along the roadway for a few miles to see the country, all the roadways are very well made. after dinner spent the afternoon writing. 7 PM went to a lantern lecture on \"London\", afterwards went to bed.\n","61":" \n\n6.45 AM on parade. 8.45 parade again, were then taken for a march along the roadway for about 3 miles and back, got back about 11 AM, and then were taken into the stables to clean horses till ½ past 12. After dinner we were taken to the Q.M.S. and had issued to us 1 pr gloves, 2 body belts, 1 leather jacket, 1 Razor, 1 clasp knife & Lanyard and 1 water proof cape. Were then again taken to stables to clean horses until a ¼ to 5. 7 PM concert in the Y.M.C.A. 9 PM went to bed, very cold\n","62":"\n\n6.45 Parade, icey cold, everything covered with thick frost, the water in the horse trough had ice on it nearly 3 in thick. 8.45 2nd parade, was told off for town picquet, for the evening, was then told to pick up bits of paper lying about. \n\n1.45 PM Parade again and dismissed. 3.30 on Parade at Battery office, were inspected and then marched up to Headquarters & inspected again, and dismissed again until 5.45, then went on duty into Heytesbury, anchored at the \"Soldiers Rest\", reached camp again 9.30 and went to bed. \n","63":"\n\nwent for a route march around the countryside, covered about 10 miles, was very interesting seeing the old villages and country lanes, passed one large place that had a hedge of holly, looked very nice with its red berries, we went through Heytesbury, Sutton Veny, & Boynton and came back a different route, reached camp again 12.30 very tired and ready for our grub. 1.45 PM Parade and was detailed with 3 others for a job, but had nothing to do all the afternoon, went to concert at Y.M.C.A. after tea. \n","64":"\n\n6.30 got up, weather not so cold. 9.30 went for another route march through Heytesbury & Bishopstrow to Warminster and were dismissed there for ½ an hour, and then were marched back again, 9 miles altogether, got back very footsore and weary. Warminster is a fair sized town, having some very good buildings and business paces. 1.45 on parade again, and were taken for another march, we were taken up a back lane and given a few movements and then allowed to sit down for the rest of the afternoon, until it was time to go back to camp. while we were sitting down an officer told us the reason why we are not allowed to put various things in our letters. reached camp again 4.30. went to bed early, had tummy ache all night. \n","65":" \n\n6.30 got up, had been raining during night. 8.45 on Parade, and went to Dr, and got a dose of castor oil. Rowland King arrived from France. Had a lecture during afternoon. \n","66":"\n\n6.30 got up, had to dress in the dark as the lights were not turned on. 9 AM went to Dr again, & told me I had \"Dyspepsia\". no parades for afternoon, went for a walk. met two lads from B\/dale who told me JB was at \n\nSutton Veny, but didn’t know what part. \n","67":"\n\n6.30 got up very cold. 10 AM Church parade in C.E. Hut. After dinner went over to Sutton Veny. after a little trouble found Jack Brideson, had been there over 3 months, spent the afternoon with him, and had tea in the hut, afterwards going for a walk with him, arrived back in camp 6.30 PM, then went for a wander round the canteens. 9.30 went to bed, started to snow. \n","68":" \n\n 6.30 got up, had been snowing all night, about 4 in of it on the ground, still snowing 9 AM jerks for an hour, finished up with a snow fight. 10.30 AM Rifle exercises. 2 PM Lecture on Artillery angles & terms. 4 PM went for a march onto the top of a hill overlooking the camp, had a very good view of the camp, had a snow fight for about ¼ hour, reached camp again 5 PM and then dismissed. Every morning and evening there are hundreds of rooks fly over the camp. \n","69":"\n\n6.30 got up, no lights on. Took on mess orderly job looking after the Sergeants. During morning had a visit from the C.O. of the Southern Command, and his staff. had been raining all night. rained all day, washed all the snow away. \n","70":" \n\n6.30, still raining. 6.45 parade, was transferred to the Signallers, had to be at Battery office 8.30 AM. 9.00 were marched over to Signal school carrying all our kit, 20 of us to a hut, to be know as Class No 10. Weather cleared off during the \n\nafternoon. 2 PM parade, were taken into a class room and given some dictation, from 3 PM to 4 PM had jerks then dismissed. Had to go back to the battery for meals. \n","71":" \n\ndidn’t get up till 7 AM had been snowing all night & still snowing. 9 AM Parade had some buzzer work and a lesson on English. 2 PM Parade again, more buzzer work. 7 PM went to concert in YMCA. \n","72":"\n\nGot up 7 AM, raining, all the snow washed away. 9 AM Parade. Had some stations signals and buzzer. 4 PM had to go on fire picquet. Wrote letters all evening. \n","73":"\n\n9.30 AM 100 of us had to go from Signal School to the Hospital at Sutton Veny to have our throats swabbed, arrived back in camp again 12.30, just in time for dinner. no parades for afternoon. \n","74":"\n\nParade 8.30. no Church parade. after dinner walked into Codford and had a look round got back to camp 6.30.\n","75":"\n\nHad ear ache all night. went to Dr and had ear syringed, ached all day. went to bed 6PM.\n","76":" \n\nEar ached all night, got up and walked round 3 AM. 9.30 went to Dr. again, was sent to Sutton Veny to see ear specialist, was told I had Adenoids in the throat, got back to camp 6.30. gave me the jumps seeing so many at the Hospital without voice and hearing, went to bed 9 PM tired out. \n","77":"\n\n7.15 got up, had a good nights sleep, ear getting better. 9.30 went to Dr with report from Dr at Sutton Veny. had my nose douched. During afternoon we were all put into Isolation again, owing to a death from meningitis. Draft left for France. \n","78":" Days from Melb\n\n7 AM got up. weather very nice & mild. Had buzzer & flash reading for morning. 1.30, parade for pay (15\/-). 3 PM to 4 PM Gas mask instruction on how to put them on. \n","79":"\n\nWeather still mild. went to Dr again about ear, then helped to clean up. 8 of the chaps were told they had to go into isolation at Sutton Veny. \n","80":"\n\n6.30 everyone busy getting ready to get away. 8.30 the Sutton Veny crowd marched away. only leaves 10 in our class now. Had to go to Dr. with special report about my ear. then had to help clean out class rooms. no parades for afternoon, wrote letters. had to go through Formalin.\n","81":"\n\n7 AM got up, my turn for mess orderly. 8.30 and 10.30 had to go on parade for Formalin disinfectant. no Church parade. \n","82":"\n\nWeather very raw. Had an examination on flags & Disc. during afternoon had some more formalin disinfectant. \n","83":"\n\nThe school were all re alloted to new classes. Went to Dr again about my ear, 3 of them had a look at it, had it syringed and hot compresses put on it, said it would have to be opened up. 2 PM was transferred back to No 2 battery. Did nothing all afternoon. 5PM had my ear attended to again. \n","84":"\n\n6.45 on parade. 9.30 went to Dr again, and was sent to Sutton Veny to see specialist, but he wasn’t in. saw Jack Brideson again. walked back slowly and enjoyed the sunshine. had a letter from my cousin in Scotland.\n","85":"\n\n6.45 parade ear still aching. at ½ past 1 AM, two Aeroplanes flew over the camp, bright moonlight. 10.30 went to Sutton Veny Hospital about ear. very foggy. 12.30 Sun came out. 2 PM Saw Doctor, wanted to put me in hospital, but persuaded him not to, have to attend hospital every morning 10 AM. \n","86":"\n\n6.30 got up, had a rotten night. 9 AM left for Sutton Veny. 10.30 Saw Dr. had my ear cleaned out and syringed. got back to camp just in time for dinner, didn’t have to do anything all afternoon. \n","87":"\n\nVery foggy. 9 AM walked to Sutton Veny, started raining, rained all day. Went to concert in Anzac Theatre at night, then came back and went to bed. \n","88":"\n\non Parade 6.45, very cold. didn’t have to go to Dr ear getting better. 9.30 sun cam out. 10 AM Church parade. 6 Aeroplanes flew over camp during afternoon, after tea sat round the fire and told yarns.\n","89":"\n\n6.45 on parade, raining pretty heavy. rained all morning, went to Dr at Sutton Veny, gave me rats pulling my ear about, got a lot of rubbish out of it. didn’t have to walk got a lift in a motor, did it in style. \n","90":"\n\ndidn’t go on parade, raining again, had to walk through it to Sutton Veny. the Dr shoved the knife into my ear, felt as if I had been draged all over the floor. Got back to camp again 1.15. Had dinner then read all afternoon. 7 PM went to concert at Anzac Theatre, a good show. \n","91":"\n\n6.30 got up, had a good night’s sleep. a fine morning, very clear. went to Sutton Veny, Dr wasn’t there was called away to Fobert. got a ride back in a side car, very nice too. Saw an aeroplane in a paddock alongside the road that had come down and got slightly bent. a big draft left for France. did nothing all afternoon. Weather getting cold again. \n","92":"\n\nhad been raining again during the night. 9 AM walked over to Sutton Veny again to have my ear attended to. Dr said it was getting on alright. wrote all afternoon. \n","93":"\n\nrained all night. went over to Sutton Veny. Sun came up, very nice walking listening to the birds singing in the hedges. Saw two aeroplanes flying. Saw a lot of large guns on trucks going down the line. do not have to go to Dr again till Monday. read all afternoon. & Pt Stredy were transferred to No 1 Battery.\n","94":"\n\n6.45 on parade. weather fine. did some washing during morning. After dinner went over to Sutton Veny with Joe Redden to find some mates, started to come home in the dark, came a new way and got lost, found ourselved in a church yard surrounded by tomb stones and had to retrace our way for about ½ a mile. got back to camp very tired. went to concert at Anzac Theatre but got tired of it some came back to hut and went to bed. \n","95":" \n\na fine morning, sun came out and warmed things up a bit. 10 AM Church parade. darned socks all afternoon. went to bed early. \n","96":"\n\na fine clear morning, beginning to notice the days getting longer. 9 AM walked over to Sutton Veny to Dr about ear, do not have to go over again, ear pretty right. got a ride back in a milk cart, better than walking. I saw a bonza hare run across the road and up the side of a hill, going like mad. read all afternoon. after tea went down to cook house and sat by the fire and dried my washing.\n","97":"\n\nWeather fine. started work, mess. orderly. have to wait on 28 men, two tables. started to rain after tea. \n","98":"\n\nup at 6.30, dull morning. put a lot of new mess orderlies on as some of the old ones are going on leave, after tea everyone cleaning and polishing for the morning, sewed patches and colors for some of them.\n","99":"\n\n4.30 got up, all bustle in the hut getting ready to get away. 5.30 Breakfast. 6.25 the ones going on leave marched away to Codford station, about 300 of them, 6.45 on parade, 8 AM, 2nd breakfast. didn’t do much, saw that the others did it. 9.30 hut cleaned out for inspection. after dinner had a sleep for an hour. Weather fine.\n","100":"\n\n6.30 got up. had a good nights sleep. after breakfast cleaned out hut, then read the paper. Weather very dull and cold. 4 PM, the 32nd Reinforcements (Victorians) marched into camp, they looked very grubby, they came the same way as we did, they spent 5 weeks at Suez. After tea I went to concert at Y.M.C.A. A very good show, enjoyed it very much. \n\nSaturday Feby 16\n\n6.45 on parade, very cold wind blowing, had a lot of \n\nextra work to do owing to the new reinforcements coming in. After dinner went for a walk with Rowl King, to Sutton Veny & Warminster, on the way to S. Veny we saw an old church dating back to the 13th Century.\n\n* \n\nhalf of it was in ruins overrun with ivy, on one end of the church is an inscription in very old fashioned english. Anne, the wife of Holland E.L. Deyd Mch 28, in the year of our Lord 1728, in the 42nd year of her age. A woman not inferior to any of her Sex. In Conjugal love, universal benevolence Unspotted integrity and unaffected piety & vertue. Happy no doubt unless sensible of __ oblidge. \n\nWe could not get inside but peeped through a broken window, the walls are covered with marble slabs, some very old, in the church yard, are many old graves, some of the vaults were open, in one we saw some bones. It was exceedingly interesting. We then went on along the road to Sutton Veny then to Warminster, saw another Church dating back to the","101":" Century, was in very good repair, and well looked after, after having tea we walked back to Camp, arriving 8.30, tired but satisfied with our outing. \n","102":"\n\nup at 6.30, very cold, everything covered with thick frost. 9.30 the sun came out, very nice too. 10 PM Church parade. After dinner had a sleep until 4 PM. A very cold night, sat by the fire, never went out. \n\n*\n\nThe red church is of Norman origin, the remains of front wall proves this, and was rebuilt in the 13th century. \n","103":"\n\non parade 6.45. Another heavy frost, the water in the buckets in the hut had ½ inch of ice on them. \n\n3 PM had to go on special parade about cleaning our huts. After tea went to Concert at Anzac Theatre, a very poor show, came home before it was half over and sat by the fire and read. \n","104":"\n\nanother frost, a very clear moonlight night. 10 shining very nice. had to scrub the tables in the mess hut. read all afternoon. 10 PM went to bed. 10.30, 6 that went on leave came home and woke us all up. \n","105":"\n\nstill morning, no frost, didn’t have to do much work in mess hut, as the old ones were back, a draft went away. 1.45 had to go on parade, started to rain. 2.30 medical inspection, then back to mess hut to clean up. \n\n11 PM some more came back that went on leave. \n","106":"\n\nA clear morning, not so cold. 10 AM cleaned out hut, then printed some photos. wrote all afternoon. \n","107":"\n\nA big draft went away to France. Got a new job, in the cook house now, 3rd cook. but don’t do any cooking.\n","108":"\n\nup at 6.30, weather mild, looked after fires and boilers all morning, put in an application to get into the Saddlers. An aeroplane flew over the camp, very low down. a very close evening. \n","109":"\n\n6.45 on parade, in the cook house all morning. got 8 letters from Australia. 3 from home. very pleased. 10 Aeroplanes flew over the camp during afternoon at a very high speed in formation. A bright moonlight night wrote letters all night. \n","110":"\n\nup at 6.30 had been raining heavy during night. All the old mess orderlies lost their jobs, we all had to go on parade at 9 AM \n\nhad a lecture and gun drill in morning, after dinner another lecture on angles and then more gun drill, after tea wrote letters in Y.M.C.A.\n","111":"\n\nAnother frost. during morning, had gun drill, semaphore and jerks, after dinner had more gun work & Lecture. Was paid £5.10.0 had to pay 34\/8 for railway ticket. \n\n109 days\n since we left Melbourne. Went to concert at Anzac Theatre. \n","112":"\n\nwent to QM and had some clothes charged. also signed leave pass. After dinner had a Med Inspection. then had the rest of afternoon off polishing up gear. Kaffir has the measles, is very sick. 7.30 PM had to go to Battery Office for ticket. 9.30 went to bed.\n","113":"\n\nGot up 4.30 AM, went to cook house and had breakfast at 5 AM and cut some sandwiches and cake. 6 AM had our passes and sugar cards issued to us. 6.15 marched off to Codford. started to snow. arrived Codford 7 AM. got train 7.30. 3rd class, very nice and warm in them, heated by steam pipes. Passed through some very fine towns, saw the Maypole May Factory, Horlicks Milk Factory, \"His Masters Voice\", Huntly & Palmers factory, all very large places also saw some fish hatcheries, arrived at Paddington, London 10.30, then walked through Hyde Park to Horseferry Rd and had dinner at Y.M.C.A. Then went through the Warchest club, the old Parliament House, the old Westminster Abby and the new Westminster Abby. The old parliment buildings are round and have stone seats around the walls, in the centre is a pillar going right up to and supporting the dome of the ceiling, is called the whipping \n\npost, the priests in olden time were tied to it and flogged when they did anything wrong, at the doorway is an old roman stone coffin with a huge cross cut out on it. \n\n The old Abby is very fine although in bad repair, and some of the old tombs have some extraordinary inscriptions on them. the marks are still showing of Cromwells troops on it. In the new Abby which dates back to 616 AD is really beautiful. I was shown round by a guide who explained everything to me. Saw all the old tombs of past Kings & Queens and the place where all the coronations take place, saw the marks on the wall made by the suffragettes in their attempt to blow up the chair. almost all the tombs have sandbags over them to guard against airraids. The windows are beautiful also the ceilings which are cut out of solid stone. Two bronze gates which divide the chapel were made by a blacksmith hundreds of years ago. All the Banners of the regiments that have gone to the front are there until the war is over. I went round the New Parliament buildings, was not allowed in, they are a very fine pile of masonry. Then up to Nelsons Monument and the Duke of Cambridge’s statue. Then into \"St Stephens on the Green\" chapel is a very fine church with beautiful windows, is built like a theatre with a decorated ceiling. and has a gallery all round it. I then went to Charing cross station with Rowl King and saw him off to Kent. Charing cross gets its name from the time of Queen Mary’s funeral, it took 12 days to bring her body to Westminster Abby and every day when they stopped, a cross\n\nwas built, hence Kings Cross & Charing Cross. The original Charingcross was destroyed by Cromwells soldiers, but was afterwards restored. The cross is just outside the station. Coming through Hyde Park I went under marble Arch, and passed statues too numerous to mention. 5 PM found my way back to the YMCA and had some tea. After tea went by tube from St James Park station to Kings Cross. 14 Stations, 7 miles for 4d. after finding out where my train went from I went to YMCA. and spent a very enjoyable evening with botany etc, looking at the specimens through the Microscope, was simply astounded at the beauties of nature revealed by it. promised to send some specimens to Mr. Russel, the owner of the microscope. \n\n9.30 went back to the station, and met EA Gibson on the train, went up to Scotland with him, train left at 10.30, packed, some of the passengers had to sleep in the corridors. Slept nearly all the way up, passed through some fairly large towns on the east coast. passed over the Great Bridges at Tweedmouth 50 huge stone arches making a fine old bridge.\n","114":"\n\narrived at Waverly station 8.30 AM, and went straight up to Ramsay Lodge, and had a wash and breakfast and booked my bed, after breakfast went for a walk along Princess Street past the National Gallery, Scotts Monument and then had a shave and brush up, then went up to Edinburgh Castle, and had a guide explain and show everything there, was greatly impressed by the place, I saw all the old gateways, the drawbridge, Queen Mary’s room, the assembly hall, in fact everything to be seen. then outside had a look at the monuments erected to troops fallen in battle. 12.30 had dinner, and a very good \n\ntoo. 1.30 got the motor bus from the Gallery to the Forth Bridge, ½ hours journey, 7 miles. after having a good look around Queensferry came back past Lord Roseberrys estate, Fettes School, Crayleith Quarry, Dundas Castle and the old Castle of Barnbogle. The Forth Bridge is a marvel, the extraordinary network of iron and stonework is wonderful the length from extreme end to end is 8,098½ ft, the length of the bridge is 5,349½ ft. The spans are the greatest in existence two being 1,710 ft and two 680 ft, and are 150 ft above highwater, the cost of the bridge was nearly 3¼ millions sterling and took 5000 men seven years to build, working night and day. After getting back to Princess St went for a walk to old Edinburgh down Leith Street then back past the post office and station to tea. After Tea wrote a few letters, then went to bed, quite a treat crawling into a bed with clean sheets on it. \n","115":"\n\nnever woke until 9.15 AM, jumped out & had a wash, booked my bed and then had breakfast. Started our trip for the morning, past the station up East Market St, under the North Bridge, passed Trinity College Church (founded 1462 by Queen Mary) then along to John Knox’s house and had a look round, then along Cannongate past \"Cannongate Tolbooth\" which dates from 1591, to Holyrood Palace and Abby, went all through the rooms and grounds and then back to Ramsay Lodge for dinner. Was greatly taken with the long queue waiting outside the butcher’s shops. After dinner we went through the National \n\nGallery and saw the paintings, (didn’t think much of them). we then went to the top of Sir Walter Scotts monument. it has 288 steps from the ground to the platform at the top, the stairway is spiral and at the top very narrow, just room to squeeze through, from the top, a very fine view is to be seen. The height of the monument is 200 ft and cost £15,560 and took 4 years to build. We then went up Advocates’ Close to St Giles’s Cathedral, arrived just in time to be shown over and have it explained by Countess Elgin. It is very beautiful inside and has some very fine memorials inside and some very ancient banners hanging from the ceiling, saw the place where Jenny Geddes threw the stool at the preachers head. also saw the statues of the monarchs. Just outside the door to the right is the heart of Midlothan on the footpath. we next went into Parliament square and saw the place where John Knox is buried I.K.1572. near the grave is a statue of Charles 2nd, made of lead in Rotterdam, 1685. Then into Parliament House, dates from 1632. the inside hall is 122 ft long and 49 ft wide with a fine oak roof and floor. \n\nIn the centre of the roadway is the City Cross which was destroyed in 1652 by Cromwells soldiers and restored in 1885. We then went over the North Bridge, opened in 1897. the old one being pulled down as it was too small. then over to Calton Hill and now the jail, the National monument (Scotlands poverty) 355 ft above sea level. Nearby is Nelson’s monument and the old and new Observatory. We then went into the Calton burrying ground, in which is some very old and fine tombstones. \n\nwe then went for a walk along Leith Street and after wandering around found ourselves in Hanover St, then into Princess Street as far as the Caledonian Railways and then home for tea, afterwards doing a little writing. 7.30 went with AE Gibson down to the station, to see him off in the train for London got back to Lodge 9.30 and went to bed. At station had a talk with Mr Cuthbertson inspector of traffic, and got an invitation to visit him.\n\nSunday Mch","116":"\n\nGot up 9.30, slept like a top all night. had breakfast then went for a walk along High St around over South Bridge then on to Holyrood Park to the Craigs and Arthurs seat then back to St Giles Cathedral, met a Mr & Mrs Wilkinson of Darlings Regent Hotel and was invited to got to tea, but promised to go to supper. Enjoyed the Church service very much Dr Campbell was the preacher, his subject was \"Thy Kingdom is at hand\" gave a very straight talk, the choir sang \"Come unto Me\", (some singers). We sat in the chancel right under the pulpit and the historic flags. After service went back to Ramsay Lodge for dinner, then went to 17 Perth St to visit my Cousin but he was out until 4 PM so went for a walk along Gt King St as far as the Prince Albert Statue, (and a very fine one too) then along to Princess St to the National Gallery and into the YMCA for a ½ hour. passed the Grassmarket Mission Band and the Boy scouts pipers Band, they can play some. \n","117":" PM started off for Perth St again, arrived at Perth St and found my cousin in also his niece Jean who keeps house for him, was warmly welcomed and spent a very enjoyable evening talking about old times, after supper my cousin walked as far as Princess St with me. I then went straight home to bed 11.30, feeling that I had connected up the links of the two families who had been seperated for so many years. \n\nMonday Mch 4th\n\n9.30 got up, weather not so cold, but a very heavy fog all over the city, had breakfast, then did a little writing. 10.30 set out for a walk, up Ramsay Lane and along High St to St Giles, and had another look round, went into the Chapel of the Thistle, a small but glorious place, around the walls are stalls with the \"Coat of Arms\" of the owner of the stall above, the occupants of the seats are all of scottish descent, the last seat being taken by the Famous soldier, Sir Douglas Haig, the woodwork of the stalls is magnificient being all hand carved, the cost of the building was £40,000, while I was in St Giles’, a christening service was being held, quite a nice service, and the kiddie didn’t howl. \n\nI then went in Parliment House, which dates from 1632. The ceiling is the original one and is different to anything I have ever seen, made of oak, all carved by hand and is very massive. the floor is all inlaid oak, and is very pretty, around the walls are statues of Scotland’s famous men, all the paintings have been removed for safety on account of Zep raids, in one end of \n\nthe hall is a magnificient stained glass window, (I saw it at its best as the sun was shining behind it) depicting James V, surrounded by his nobles, presenting the charter to the Abbot of Cambuskenneth, the first Lord President. I then came back, past \"the Heart of Midlothian\", and the Statue of Francis Walter, 5th Duke of Buccleuch, up the Lawnmarket to \"the Lodge\" for dinner. I then went, (after dinner) to Perth St, 3 PM went for a walk with Jean to the Botanical Gardens, alongside the Leith Waters, through Inverleith Park to the Fiddes College, then back to Perth St for tea, the gardens are very pretty, saw a lot of Australian natives there in the shape of Wattle and gum trees. I went through the Hot houses, and saw some wonderful plants and flowers, they are well cared for. After tea I went with Jean to Mrs Jim Young’s place and saw her and the family, my uncle Jim died years ago, leaving 4 girls and 2 boys, after staying there for a little while Mrs Young took me to my father’s brother’s house and there saw my Uncles Robert & George (Dod). Robert is married, but has no family, Dod is not married. I did not see John Young but saw his daughter his son was killed in France two years ago. They were all very pleased to see me and had a lot of questions to ask. Arrived back at Perth St 10.30 had supper, and then walked back to Ramsay Lodge 12 PM, and went to bed feeling quite happy. \n","118":"\n\n9.30 got up, had a shave, then had breakfast. 10.30 did a little writing, wrote out our side of the family tree, as Cousin Jim is \n\nmaking out a list of our forefather’s. I then went out for a walk along Princess St and over the North Bridge, there went and had my Photo taken, then on to the Museum and had a look round there until dinner time. After dinner I met Chrissie Young at the Caledonian Co Station and went out to Juniper Green with her and saw my Aunt McCall, Jean, Hetty, Aggie and Archie. Aunt is 73 now and getting very feeble and deaf. She said she would never have known me. They were delighted to see me again after 27 years. Jean showed me a box of Sealing Wax that my Dad gave her before he left, also a clock my mother gave her. Archie is working at a Paper mill in the office and has been for 7 years. I had a great afternoon’s talk about old times and happenings. Cousin Jean has two letters I sent her 14 years ago. I left again at 5.30 PM and got the train back with Chrissie. I then went to Perth St and had tea there, and spent the night with them. 9 PM I started out for the station, Cousin Jim and Jean coming with me to see me off, when we got to the station Aunt Jim Young and Chrissie where there waiting for me. Chris gave me two big bundles of cigarettes and Jean made up a very nice lunch for me to eat on the train. Train left at 10 PM, crowded, they had to put two extra carriages on, there was a great crowd at the station to see us \n\noff. I did not like leaving as I had been made to feel very much at home during my stay there. I had to stand until the train got to Newcastle. I there saw the engine that George Stevenson built many years ago, it is on a huge stone platform in the centre of the station. \n\nWednesday Mch 6th\n\nArrived at King’s Cross, London, 8 AM then went into the Y.M.C.A. and had breakfast there, then had a trip in the tube to Charing Cross station. I then walked along the bank of the Thames as far as Parliament Houses then along past Westminster Abby, then got the ‘bus as far as St Paul’s, had a look all round the Cathedral, when I went in there was a Service on, and I stood and listened to the singing of the choir of boys, it was very fine. I went all round the statues and monuments erected to the memory of England’s famous men, some them are marvellously cut out of marble, and are very large. I was allowed to go down into the Crypt and see the tombs of Nelson, Wellington, Gordon, and others too numerous to mention, it was very impressive being down below the floor in the vault in the half darkness, after coming out we walked down Ludgate Hill and right through to Trafalgar Square and there saw two Aeroplanes that had flown from Turin, Italy to England in 7 hours 22 min. There was a Tank on View that had been in action, showing a few holes \n\nin its sides, we then went through a part of St James Park and saw the palace then along a bit further until we thought we had gone far enough, then we found our way back to London Bridge and had a look at the Houses of Parliment from the other side of the Thames. We then went (for the 2nd time) through the old Abby, the old Parliment and Westminster Cathedral. 3.30 we set out for Paddington Station, on the bus, after arriving there we went into the Y.M.C.A. and had to produce our passes before we could get anything to eat. 5 PM train left with a big crowd of discontented soldiers aboard, didn’t half like the idea of coming back had too good a time during their leave. Arrived at Heytesbury 8 PM and got out there, (against orders) as it saves a lot of walking, arrived back in camp 8.30 PM and handed in my pass. When I got back, there was 6 letters waiting for me, and I was very glad to get them, in fact it was \"the end of a perfect day\".\n","119":" Mch","120":"\n\nGot up at 6.30, and didn’t like getting up after having a week off. 8.45 on Parade had jerks and gun laying all morning. 2 PM Parade again, medical inspection after which I sneaked away and loafed all afternoon, as I didn’t fancy doing any drill. During the morning a big draft went to France, among them being M. Carter, N.F. Burrows, S. Herriot, E Head, and Archie Hill, all out of our hut. \n\nThree others went on leave. efore going to bed Rowl King, W. Whitehead and I had a slap up supper, boiled Eggs, toast, cake and tea, finished up with apples from Kent.\n\nFriday Mch","121":"\n\non Parade 6.45, very cold wind blowing, had to turn into stables and clean out, first time since coming into camp here. Another big draft called out. 9.30 went to Dr about an itch I have, he said I had Scabies and isolated me. there are eleven of us in the Isolation hut, with Scabies. Read all afternoon. \n\nSaturday Mch","122":"\n\ngot up 7.30. a very heavy frost. two more men came into the hut. during the morning an aeroplane flew around the camp and gave us a good exhibition of fancy flying. Turned out a lovely day had to have a bath in disinfectant.\n\nSunday Mch","123":"\n\ngot up 7.30 had breakfast and went back to bed again. 11.30 had another bath and rub over with ointment. after dinner went to sleep until 4 PM. After tea wrote letters. \n\nMonday Mch","124":" \n\ngot up at ¼ to 8 Just in time for breakfast. some more men came into the hut, five men went out. Got a Postcard from Jack Brideson and sent a letter back to him. Stredy & Harry Petty came and said Good bye as they are going on draft tomorrow. sewed a buckle on Harry’s belt. The weather has been very fine for the last 3 days. \n","125":"\n\ngot up 7.30 had breakfast and went back to bed. wrote all morning. Got a letter from Lena Brideson. After dinner did \n\nsome washing. Two more men came into the Hut with Scabies. The draft didn’t go away. After tea did some more writing. \n","126":"\n\n7.45 Crawled out of bed for breakfast. A very large draft went away. read all morning. After dinner went to sleep for a couple of hours. \n","127":"\n\nGot up 7.30, my turn for mess orderly, had to get the breakfast from cook house got some more Aust mail 2 from wife 1 from Leah 1 from Gordon Crook and a card & letter from Tiny. 2 PM went before Dr and he passed me out for scabies. After tea played crib. 7.30 started to rain. \n","128":"\n\na cold morning, went back to bed after breakfast. 10.30 washed my blue hospital suit, then read until dinner. after dinner lay down and had a sleep. \n","129":"\n\nanother cold morning, after breakfast shifted all my goods and chattels back to my old hut. After dinner went for a walk with Rowl King to Boyton had a look over the old Church, it was built in 1066 in the time of the Crusaders, there is a large stone tomb of a crusader in the church, while there I blew the organ for the Organist, it reminded me of old times I chipped off a piece of the stone wall. I crawled up into the bell tower among all the birds nests, there were four huge bells in the tower, marked 1246, and each had a huge oak wheel with a rope on it \n\nwhich looked very old fashioned. got back to camp just in time for Tea. \n","130":"\n\nDidn’t go on Parade. had a lay in instead. 10 AM Church parade, but didn’t go. Another case of Measles in our hut, we all had yellow bands (to wear during isolation) given to us. wrote letters all afternoon. \n","131":" \n\non parade 6.45. turned into stables, but I buzzed off, On parade again ¼ to 9. had gun laying until 10.30. I then went and got my overseas boots, which lasted until dinner. 2 PM had a lecture on shells until 3.30. I then went and had a rub with ointment to stop my \"scabies\". I got my first letter from Chomley St (dated Nov 22) also two photos & letter from my wife, 1 from Roy Collins, also one from Rosie & Vi (all Dec letters). \n\nTuesday Mch","132":"\n\nup 6.30, woke by the droning of the bagpipes. did gun laying and gun drill all morning. had to go through Formalin Fumes for disinfectant. after dinner had gun drill and then had to clean horses for an hour then pull the Guns up to the gun park in the rain. After tea went to Concert at Anzac Theatre. \n","133":"\n\nhad to go gun laying at 8.15 AM till 10.30 then had some more formalin. 11.30 turned into stables to clean horses till dinner time. Had Xmas parcels given to us, (I got a tin of Cigarettes (50), 1 Tin Ham Pate, Lollies and chewing gum, a handkerchief and a tin of prunes in mine). After dinner had a lecture until smoke oh. then had gun drill till 4.30. A fine lot of aeroplanes few over the camp all day. \n\n7.30 Saw a lot of star shells falling from guns fired about 4 miles away. \n","134":" \n\nup 6-30 AM, a foggy morning, turned out a fine spring day, during morning had gun laying until 10.30. 11 AM had to go and be disinfected then we had to change all our belongings from Hut 2 to Hut 13 so that the hut could be fumigated. after dinner, had more gunlaying, then got paid, after smoke oh had a lecture in room. I had a queer turn and had to go and lie down didn’t have any tea and went to bed early. \n\nFriday Mch","135":"\n\ngot up 6-30 feeling better. 8 AM gun laying until 10.30 then had to go through Formalin gas. 11.30 were turned into stables to clean horses until dinner time. after dinner had a lecture till smoke oh. then more gun laying till 5 PM. Weather getting warm, got quite a sweat up pushing the guns back to the gun park. I was picked out to go through a school of gunnery. 7 PM had to go night laying until 8 PM. then went to concert in Y.M.C.A.\n\nSaturday Mch","136":"\n\nup at 6.30, a glorious morning, dodged stables. 9 AM on parade. had to help clean out mess huts, lasted all morning? after dinner took a photo of the cooks and one of the inside of the cookhouse. 2 PM went for a walk into Warminster. spent the afternoon and evening there, and came home in a car, went to bed tired out.\n","137":"\n\nhad to get up an hour earlier, as we had to put our watches on an hour (daylight saving) had to go into stables and clean out from 7 AM till a ¼ to 8. 9 AM Church parade but being in isolation, wasn’t allowed to go, had to go and clean stables instead. 3 PM went to Fellowship meeting in Y.M.C.A. after meeting had a bonza \n\ntea in the room, then had some music. 6 PM wrote some letters home. 7 PM went to Church in Y.M.C.A. had a very good address on William Dunn, preacher one time clown and comic song singer. \n","138":"\n\nhad some gun laying and tests all morning. got two letters from Edinburgh. After dinner had more gun laying, getting ready for our examination. 7 AM went to Concert at Anzac Theatre and enjoyed the show very much. \n\nTuesday Mch","139":"\n\nweather much colder, started our gun laying but was taken off to go and shift stuff from QM Store to Battery Stores. 11.30, 100 of us were taken up on to the green and had a lecture on temperance till 12 AM we then had to go into stables till dinner time. 2 PM Medical inspection, then Jerks until smoke oh. \n\nafter smoke oh had standing gun drill till 4 PM then turned into stables until 5 PM. I got seven letters from Australia 2 from wife (11 & 12) 3 from Neals, 1 from Caesar, and one from Lil, spent a pleasant ¼ of an hour reading them, then did some writing. 7 PM went to Meeting in Y.M.C.A. conducted by Rev L Fletcher. \n\nWednesday Mch","140":"\n\nup at 6.30, a cold raw morning, very foggy. another draft went away. had my gas mask issued to me then we went through tear gas, first with masks on then without, made my eyes water and smart. smelled like pineapples. 11.45 had a lecture till 12.30. had gun drill all afternoon. went to concert at \"Anzac\" after tea. \n\nThursday Mch","141":"\n\na wet morning, very raw, had mounted gun drill and jerks for the morning \n\na miserable wet cold morning. After dinner had to take parts of the gun to pieces and put them together again, after smoke oh, had gun laying with our gas masks on, had to do firing in the middle of smoke bombs, could hardly see the sights on the gun. we were then taken away from the guns and then got a S.O.S. alarm and had to run back to the guns with our masks on. I find it very hard to breathe in them. After tea did some letter writing. \n","142":"\n\nGood Friday (the same as Sunday) had to turn into stables and clean out before breakfast. 8.45 parade, helped run the guns and wagons down on to the flat were then dismissed. 10.30 went to Church at the Congregational, service was taken by the Padre and gave a very good address, after church Rowl King and I went for a walk along the country lanes and admired the gardens and old houses, got back just in time for dinner. 4 PM went down to stables to water and feed horses, after attending to three of them I got a kick in the \"bingie\" and was put out for a while. After tea went to a Lantern lecture at Y.M.C.A. on the Passion Play of 1910, enjoyed it very much, quite an education. \n","143":"\n\nup at 6.30 had been raining during night. didn’t go into stables on a\/c of \"tummy\". 8.45 on parade again, raining, had to go into the cookhouse and help clean up, black leaded all the stoves, quite a pro at it. After dinner played cards all afternoon. Rained all day. \n","144":"\n\n6.45 on parade, still raining. Had to go into stables and clean out. 9 AM thought I was going to Church Parade but had to go and scrape off paint and clean windows, \n\nfeel I am getting some housemaid.\n\nafter dinner went to fellowship meeting in Y.M.C.A. had tea there, then wrote five letters. \n","145":"\n\nEaster Monday. 14,000 miles away from the place I spent last Easter, had to go into stables before breakfast. during morning had gun laying and jerks, half holiday, sports were held at Lady Heytesbury’s in the grounds. I didn’t go had a sleep instead, after tea went to concert at Anzac Theatre. \n","146":"\n\ndidn’t go on early morning parade, didn’t feel like it. started raining again. during morning had gun laying, Jerks and lecture on Gas and Masks had gun laying all afternoon. 7.30 Concert at Anzac got my photos from Edinburgh. \n","147":"\n\nFoggy and a heavy frost. on parade 6.45. \"Bluey\" had a raid on the huts for sleepers in, caught a few. didn’t go into stables, had to go early laying guns at 8.15. 9.30 started our gunnery examinations. started raining. 3 PM finished first part of exam, 3.30 had gun drill with gas masks on. 8.15 had night laying until 9.15 PM. got a letter from Uncle Robert at Edinburgh. A new scale of rations now in force, no porridge for breakfast. \n","148":" \n\nstill raining, on parade 6.45 thought we had to go into stables, but were dismissed, we ran like fury in case we were called back again. We had pea soup and jam for breakfast. had a new style of trail shifting explained to us for gun laying, after dinner had gun drill. went to Concert at YMCA.\n","149":"\n\nWeather fine, had to clean stables before breakfast. Went out on Guns for a ride, had an easy morning, cleaned horses before dinner. \n\neveryone grumbling about the small amount of food supplied, its murder expecting anyone to keep going on it. After dinner again went out with the guns and had ride round, wouldn’t mind it everyday. was gazetted a \"layer\" in orders. was read out on parade. \n","150":" \n\nstarted raining 9.30, for morning had a lecture and jerks, after dinner did a little leather sewing. still raining 2 PM. Rowl King and I walked into Warminster, just before we got there the sun came out. We went into St Johns C. of E. and had a good look round the walls were all inlaid with Mosaic work, it is beautiful and the subjects are well brought out. at the enterance to the Chancel is a very fine brass screen, all hand made. On the communion table was a glorious table cover all finely worked in gold and colors and on the wall behind some very expensive curtains, they looked like flowered satin and are 52 years old, but look like new. the church was all decorated with flowers for Easter week. The pulpit is of red granite inlaid with marble figures representing the twelve apostles. We then went for a walk through the grounds then on to Warminster. after wandering round for a bit we had something to eat, then set off to Christ Church C of E it is a much larger church than St Johns but the walls are plain with the exception of the chancel, which is well worth looking at, it is all stencilled and finely colored. all the curtains and table cover were all interwoven with gold around the borders, and in the centre was shot flowers, the pulpit is of Marble and the font of white granite finely worked, there is a large burying ground around the \n\nchurch, and a fine view is to be seen from the side wall. \n\n6.30 we had tea in the court house, then tried to get into the pictures but it was full up, then went to a Concert of the YMCA at Warminster, it was one of the worst shows I have yet seen, came out when it was half over and started off for camp, got back at 20 to 10 quite ready for bed. \n","151":"\n\n6.45 on parade, was turned into stables (but did a get.) 9 AM on parade, thought I was going to church but was turned into stables to clean out (a slight difference). 11 AM Parade again, was detailed off for town Picquet and dismissed. 3.30 on parade at Bty Office. was inspected then dismissed until 6 PM. we were then marched down to Heytesbury, after waiting a while we were dismissed and came back to camp again. Rained off and on all day. \n","152":"\n\non parade 6.45, after orders were read, A class were dismissed. 9 AM to 10.30 had gun work, then jerks and lecture until dinner time. for afternoon had a lecture till 3.15 then gun work with gas masks, had smoke and tear gas let loose on us. After tea went for a walk with Rowl King into Heytesbury Post Office to help him post some letters. five more chaps came into our hut making 22 men, of that number 14 are employed in the camp. Went to concert at Anzac Theatre. \n","153":"\n\nduring morning had Gun laying, Jerks and cleaning horses. The Adjutant and Colonel stirred the \"tripe\" up in some chaps for being at the Y.M.C.A. before smoke oh. after dinner had a lecture and gun drill with our masks on. Went for a walk into \n\nWarminster with Rowl King to get some Photos. arrived back in camp 9.30 tired and footsore. Five months since I left Australia. \n","154":"\n\nup at 6.30 had been raining heavy all night. had the usual gun laying, jerks and lectures had to go night gun laying at 8.30 PM.\n","155":"\n\nput in another application to get into the saddlery. Our class was detailed off for guard, had rifle exercises till smoke oh, then jerks and lecture. 2 PM had a medical inspection then dismissed to get cleaned for guard. 3.30 PM parade at Bty Office, got off guard as I was the best dressed and cleanest man on guard. printed Photos the rest of the afternoon. \n","156":"\n\n12 of us were on Q.M. Fatigue all day. had to sort old clothes, one of the dirtiest and smelly jobs I have had, had to make up old shirts and flannels into bundles of ten. After tea went to Concert at Anzac, was rotten so came back and went to bed. \n","157":"\n\npassed in my paybook on early morning parade. 8.15 AM Gun laying till 11 AM then Jerks till 12 AM. Filled in the afternoon with photographs. Made a leather case for Jack Bowring to hold .\n","158":"\n\n6.45 had to clean stables till 7.30 AM. Went to Church service at C of England to make sure of getting to church. 11 AM had a hot bath (very nice too). Went to Fellowship class at Y.M.C.A. After tea helped to Wash and dry the dishes. Wrote some letters home. \n","159":"\n\nnew time table, have to get up half an \n\nearlier. 6 AM on parade 6.30 a raw cold wind blowing. Went to Dr about my knee, put some acetic acid on it, and gave me some powder, two days no jerks, After dinner had semaphore signalling and gun drill with masks on. nearly froze, a bitterly cold day. Received 9 letters from Australia, four from wife (12 to 15), 1 from Marion, 1 from Browns, 1 from Lily Neal, 1 from Granville and 1 from Lil. A big draft left for France (64).\n","160":" \n\n6 AM got up, snowing, and very cold. 8.15 gun laying till 8.45. 9 till 10.30 Gas instruction. didn’t do jerks, not allowed. for afternoon had a lecture and gun drill. 4.15 our class had to go into stables, as they had to double, I didn’t get there. P.O. instead. Still snowing and raining. went to concert at Anzac, a good show. \n","161":"\n\nraining again and bitterly cold. 9 AM marched over to QM Stores and had some clothes changed, (made a mornings Job of it), Warned for draft, about 80 of us. during afternoon had standing gun drill and gun laying. 8.30 had to go night laying until 9.15 With our gas masks on. rained all day. \n","162":"\n\n6 AM up again, rain has stopped, hope it will clear off. 8.15 early laying. 9 AM draft called out, half on stables the other half on jerks. 11 o’clock Gun laying. Had gas instruction all afternoon. After tea walked into Warminster with Rowl King to get some photos but found the place closed. got back to camp at 9.30 and went to bed, to the accompaniment of tunes on the Violin. \n","163":" \n\nSnow had fallen during the night. 6.45 was turned into stables, but buzzed off to hut instead. 9 AM parade, went and got our over-\n\nseas boots, were then dismissed to get our kits fixed up, ready to pass them in, had to pass in 2 pairs boots, 1 pair pants, 1 tunic, 1 pr underpants, 1 Flannel, 1 Shirt, 1 Abdominal Belt, Waterproof cape and 1 towel. 10.30 had to pass through the Dentists. 12 AM Doctor, pulled me up on account of having Scabies but passed me through. 2.30 PM had to take our gear over to the Q.M. Store, had issued to us one Aussie blanket, 1 tube of Iodine, 1 identity disc, got a new pair of strides and braces. Job lasted all afternoon. after tea wrote a few letters, then listened to an Address on \"New Guinea\", very interesting and amusing. \n","164":"\n\nSnow on the ground. 6.45 on parade and dismissed had instruction in gas and tests, until 11.30, had to go through Chlorine Gas. 11.30 stables until 12.15 AM. After dinner went over to QM Stores to try and get a pair of breeks to fit me, had to take a 2nd hand pair of \"Aussies\". \n\n2.30 started out for Warminster with Rowland took a couple of photos on the way. got one of the inside of St John’s Church then on into Warminster, bought a few things then went to the old Minster Church, it dates back to the twelfth Century and is a very fine building, has seating for 1,000 people, the furnishings are very fine and costly. The caretaker gave me permission to play the organ, it made me forget where I was and in the end Rowland had to pull me away from it, as he was feeling the cold, the temperature in the church was 47 degrees. After walking around the grounds we came back into the town and had tea, boiled Eggs, \n\nTea, bread and margarine, and cakes. We then went to a concert at the Y.M. Arrived back in camp 9.30 and found all the lights off, had to go to bed in the dark. \n","165":" April 21sat\n\n9.30 AM Church Parade, went to C of England service at Heytesbury, enjoyed it very much after service listened to the organist playing the organ for about half an hour, then came back to camp. After dinner went to Fellowship, and had tea at Y.M. Went to Church with Rowl King. had to go to bed in the dark again. \n","166":"\n\nup at 6 AM and folded my blankets handed them in to Q.M. Stores then rolled my overcoat and packed my kit. 8.30 on parade had to go through the Doctor’s hands again. 11 AM left for Codford enroute to Southhampton. \n\n \n\n"}}