{"Document Name":{"0":"Diary_0121","1":"Diary_0121","2":"Diary_0121","3":"Diary_0121","4":"Diary_0121","5":"Diary_0121","6":"Diary_0121","7":"Diary_0121","8":"Diary_0121","9":"Diary_0121","10":"Diary_0121","11":"Diary_0121","12":"Diary_0121","13":"Diary_0121","14":"Diary_0121","15":"Diary_0121","16":"Diary_0121","17":"Diary_0121","18":"Diary_0121","19":"Diary_0121","20":"Diary_0121","21":"Diary_0121","22":"Diary_0121","23":"Diary_0121","24":"Diary_0121","25":"Diary_0121","26":"Diary_0121","27":"Diary_0121","28":"Diary_0121","29":"Diary_0121","30":"Diary_0121","31":"Diary_0121","32":"Diary_0121","33":"Diary_0121","34":"Diary_0121","35":"Diary_0121","36":"Diary_0121","37":"Diary_0121","38":"Diary_0121","39":"Diary_0121","40":"Diary_0121","41":"Diary_0121","42":"Diary_0121","43":"Diary_0121","44":"Diary_0121","45":"Diary_0121","46":"Diary_0121","47":"Diary_0121","48":"Diary_0121","49":"Diary_0121","50":"Diary_0121","51":"Diary_0121","52":"Diary_0121","53":"Diary_0121","54":"Diary_0121","55":"Diary_0121","56":"Diary_0121","57":"Diary_0121","58":"Diary_0121","59":"Diary_0121","60":"Diary_0121","61":"Diary_0121","62":"Diary_0121","63":"Diary_0121","64":"Diary_0121","65":"Diary_0121","66":"Diary_0121","67":"Diary_0121","68":"Diary_0121","69":"Diary_0121","70":"Diary_0121","71":"Diary_0121","72":"Diary_0121","73":"Diary_0121","74":"Diary_0121","75":"Diary_0121","76":"Diary_0121","77":"Diary_0121","78":"Diary_0121","79":"Diary_0121","80":"Diary_0121","81":"Diary_0121","82":"Diary_0121","83":"Diary_0121","84":"Diary_0121","85":"Diary_0121","86":"Diary_0121","87":"Diary_0121","88":"Diary_0121","89":"Diary_0121","90":"Diary_0121","91":"Diary_0121","92":"Diary_0121","93":"Diary_0121","94":"Diary_0121","95":"Diary_0121","96":"Diary_0121","97":"Diary_0121","98":"Diary_0121","99":"Diary_0121","100":"Diary_0121","101":"Diary_0121","102":"Diary_0121","103":"Diary_0121","104":"Diary_0121","105":"Diary_0121","106":"Diary_0121","107":"Diary_0121","108":"Diary_0121","109":"Diary_0121","110":"Diary_0121","111":"Diary_0121","112":"Diary_0121","113":"Diary_0121","114":"Diary_0121","115":"Diary_0121","116":"Diary_0121","117":"Diary_0121","118":"Diary_0121","119":"Diary_0121","120":"Diary_0121","121":"Diary_0121","122":"Diary_0121","123":"Diary_0121","124":"Diary_0121","125":"Diary_0121","126":"Diary_0121","127":"Diary_0121","128":"Diary_0121","129":"Diary_0121","130":"Diary_0121"},"Date":{"0":"unknown","1":878.0,"2":879.0,"3":880.0,"4":881.0,"5":882.0,"6":883.0,"7":884.0,"8":885.0,"9":886.0,"10":887.0,"11":888.0,"12":889.0,"13":890.0,"14":891.0,"15":892.0,"16":893.0,"17":894.0,"18":895.0,"19":896.0,"20":897.0,"21":898.0,"22":899.0,"23":900.0,"24":901.0,"25":902.0,"26":903.0,"27":904.0,"28":905.0,"29":906.0,"30":907.0,"31":908.0,"32":909.0,"33":910.0,"34":911.0,"35":912.0,"36":913.0,"37":914.0,"38":915.0,"39":916.0,"40":917.0,"41":918.0,"42":919.0,"43":920.0,"44":921.0,"45":922.0,"46":923.0,"47":924.0,"48":925.0,"49":926.0,"50":927.0,"51":928.0,"52":930.0,"53":931.0,"54":932.0,"55":933.0,"56":934.0,"57":935.0,"58":936.0,"59":937.0,"60":938.0,"61":939.0,"62":940.0,"63":941.0,"64":942.0,"65":943.0,"66":944.0,"67":945.0,"68":946.0,"69":947.0,"70":948.0,"71":949.0,"72":950.0,"73":951.0,"74":952.0,"75":953.0,"76":954.0,"77":955.0,"78":956.0,"79":957.0,"80":958.0,"81":959.0,"82":960.0,"83":961.0,"84":962.0,"85":963.0,"86":964.0,"87":965.0,"88":966.0,"89":967.0,"90":968.0,"91":969.0,"92":970.0,"93":971.0,"94":972.0,"95":973.0,"96":974.0,"97":975.0,"98":976.0,"99":977.0,"100":978.0,"101":979.0,"102":980.0,"103":981.0,"104":982.0,"105":983.0,"106":984.0,"107":985.0,"108":986.0,"109":987.0,"110":988.0,"111":989.0,"112":990.0,"113":991.0,"114":992.0,"115":993.0,"116":994.0,"117":995.0,"118":996.0,"119":997.0,"120":998.0,"121":999.0,"122":1000.0,"123":1001.0,"124":1002.0,"125":1003.0,"126":1004.0,"127":1005.0,"128":1006.0,"129":1007.0,"130":1008.0},"Entry":{"0":"\n\n","1":"\n\nLeft Sydney for the front by SS Argyllshire. Saw Rana Joyce Bill & Reg before embarking. Did not see anyone else I knew. Rather downhearted. A splendid day but rather a sad one. At present off Wollongong in a smooth sea. 820 km 5 hours away from old Sydney Town.\n","2":"\n\nFirst day at sea. Very fine day with smooth sea. Off Eden 9 oclock. Green Cape passed 10 oclock. Last sight of N.S.W. (Gabo Island) at 11.45 am. Whale & porpoises about all day. Wrote letters for mail.\n","3":"\n\nSaturday today. A very rotten day Windy & dull. Our battery on duty. Holystoning &\n\n13th May 1916 (con)\n\nswabbing down decks the programme. Entered Port Phillip at 12 oclock but only stayed inside the entrance for a few minutes to deliver mail. Passed Cape Otway at 4.45 pm. Eating well. Sea coming up for a rough time. 8 oclock the time. Bedtime\n","4":"\n\nVery rough day. Good many troops seasick. Nothing doing much only trying to keep warm. Somewhere between Adelaide & Albany.\n","5":"\n\nAnother rough day. Wind & rain. Somewhere in the Bight. Had impromptu concert with YMCA Harmonium.\n","6":"\n\nStill another rough & windy day. Very miserable on deck. Still in the Bight. Heavy rain & windstorm at 8 oclock pm. Shipped some hearty seas at night.\n","7":"\n\nTurned out cold & windy in the morning. Started to write letters for mail. Weather no better up to 9 pm Bedtime.\n","8":"\n\nSlightly better day but not of the best. News officially given out that we sail to England via The Cape. Great joy.\n","9":"\n\nRaining in morning. Parade in full marching order postponed. All hopes of calling at any Australian port lost. The last sight of Australia I had being Cape Otway passed on Saturday the 13th. Some of the men on board saw Leewin Light last night at 9.30 or there abouts. Today turned out a very fair day with a nice starlight night. A.B.I.S.N. Steamer on our starboard side today but we left her behind at 3 oclock afternoon\n","10":" \n\nNothing of much importance. A very fair day but had heavy swells in the afternoon & night. Some extra heavy ones sent food kits &c flying in all directions.\n","11":"\n\nTurned out a very fine day with smooth seas. Church parade in uniform in the morning. Did some washing in the afternoon. Looks like rain now 8 oclock. Rather strong wind coming up.\n","12":"\n\nNot a bad day. First guard on ship. Did not feel too well. Night cold.\n","13":"\n\nFinished up guard at six oclock a.m. Day was very windy up till nightfall. Held a concert in the well deck at night. Somewhat a success\n","14":"\n\nEmpire Day. A very fine day & smooth sea. The best day we have had since leaving Australia. Impromptu concert held by troops at night, turned out a success.\n\n","15":"\n\nWindy & dull morning. Had a full dress parade for issue of mess tins. A regular military stunt like the rest of them. Makes one sick. Afternoon turned out rather nice. Sea smooth on nightfall\n","16":"\n\nAn uneventful day. Mess orderly for day. Rearrangement of battery. Put on Headquarters staff. Allotted to another sub. as Driver. More military stunts.\n","17":" \n\nOur battery in tug of war contests. Won two pulls out of four against Queenslanders. On afternoon Boxing Tourney was held. Some good bouts eventuated.\n","18":"\n\nA good day. Church parade in morning. Otherwise very quiet day\n","19":"\n\nA fairly cold day with heavy swells. First lecture from O.C. of Headquarters Staff. Proposed routine of lectures &c mapped out for voyage. Don’t know if it will work. Case of measles broken out on board. Boat deck isolated. Every liklihood of us not landing at Durban, South Africa\n","20":"\n\nA very good day with smooth seas. Lecture by Lt. on explosives & classes on signalling. A.M.C. concert held at night. Not much chop. Wrestling match between AMC man & Russian of 9th Brigade. Result win for A.M.C. man\n","21":"\n\nA rainy day with heavy winds. Part of the day was very fine. First Pay day on ship. Great sum of £1 for pay. 9th Brigade held their Boxing Tourney on afternoon. Not as good as our Boxing Day. Night rather calm.\n","22":"\n\nMess orderly for day. Lecture by our Doctor on Typhoid. Day rather rough with wind. Still keeps warm. Another great military stunt. Full dress parade for issue of water bottles covers for mess tins. Rather sickening but still we must smile.\n","23":"\n\nUnit on duty. I was on ships stores fatigue. Examination by doctor of the 7th. Drill with lifebelts. Running about like silly arses. The day was absolutely beautiful as regards weather.\n","24":" \n\nA very fine day, and also a good one for me. Sighted South Africa at 10.15 am which was a sight for sore eyes as it was exactly three weeks since we sighted land. Tied up at wharf 1.30. We were all anxious to get on shore which we did at 3 pm. A wild scramble for Durban. I went up to Post Office per tram car. Saw the sights &c Had a good tea at The Savoy (with Black waiters). Had a talk with sundry girls. Went down to Beach Parade at night. A really fine waterfront. I was very surprised at my impression of Durban as it is such a fine little city. Arrived at boat at 10.15 News of the Naval fight. \n","25":"\n\nSunday morning. Dressed for the City. Left ship at 9.30 for Church Parade. Went over to Durban Side in \"Sir David Hunter\" pilot vessel. Church parade at the Town Hall. Successful & organ played by city organist. Had a good dinner after being dismissed from parade. After dinner which was also successful, went for tram rides through & around the city. City & suburbs from a distance looks very fine & impressive. Some tram rides we took was Unigeni, Musgrave Road, Marine Parade etc. Had afternoon tea & bright evening with some nice friends we have made. Had tea at the beach, Bill Martin, Tom Scott & myself, and a nice tea it was too and quite shrewd. In the day I had my first Ricksha ride. Last but not least we had a Ricksha race to the boat which resulted in a win for Bill Martin & myself. Arrived home (ship) at 10.30 pm after a fine day in fact one of the best I have ever had.\n","26":" \n\nLeft Durban this morning at 8 oclock. Roll call at 6 oclock. Very disappointed at not getting away to Durban for another day’s \"jolle\". Heavy seas were on until late in the afternoon. Promises of a rough time to Capetown.\n","27":"\n\nTurned out a good day. Coast in sight all day. Lecture by our doctor on Gon. & Syphs. A good sight today from the bow of the ship. Porpoises feeding on shoal fish, with dozens of birds feeding on them too. Then the porpoises made a bee line for the ship & kept in front of the bow for some time. A very pretty sunset.\n","28":"\n\nA very rough day and a cold one. Mess orderly for day wrote letters for posting from Capetown. Passed a liner going north at 9.30 pm and signalled her. Passed Cape Lilleth at 2.30 oclock. Has a very good lighthouse. Tonight we pass Cape or Pt Danger where the \"Birkenhead\" was wrecked. News of Kitcheners death from liner.\n","29":"\n\nLights of Capetown in sight when we woke up 6 oclock. Heavy rolling round the Cape althrough the night could not sleep. Fooled about Table Bay till 930 when we tied up at wharf. Left ship at 11 oclock and went into Capetown by train. Posted letters to Sydney. Had dinner at Maxims Adderley Street. Capetown not a bad place, but we struck it on a very wet & miserable day. Took a tram ride to Observatory & came back by train. Had afternoon tea & finished up by motor ride to ship (4.30). No leave for the night on account of troops drunk. Still in harbour at 1030 when I went to sleep. Shipped a 14lb gun aboard.\n","30":" \n\nStill in Capetown Harbour on getting up. Pulled out from wharf at 12 oclock. Dropped anchor in Table Bay for reasons I do not know. Seems rotten to keep us on board & Capetown in sight just a few hundred yards away. Goodness knows how long we will stop here. A cold day into the bargain. Clouds hanging low over the Table Mountain all day. Have not seen the sun since we arrived at Capetown.\n","31":" \n\nStill at Capetown & in Table Bay. Very quiet day & a rotten cold one. Still in suspense of what is going to be done. No hope much of going ashore from here.\n","32":" \n\nPromise of landing on shore for Monday. Colonel Pearce on shore yesterday & promised last night. Our position re leaving here is a bit more known. As matters stand now we leave here Wednesday (12th) with other troopers & a convoy of warships. Some of the transports have arrived and we can see them go into the docks from here. These transports by the way left before us & were on the way via Suez when they had orders to proceed via the Cape. Our unit on duty today. Memorial Service to Kitchener postponed on account of wet. We are having rotten weather. Fishing for sharks the main thing on board Nothing else of much consequence doing.\n","33":" \n\nDid not go on shore. Very disappointed. Mess orderly at new mess. Coaled (final) in Table Bay from lighter. A slightly better day. Had a good view of Table Mountain \/c at sundown\n\n12th June 1916 (con)\n\nas there was not much cloud about. A heavy mist came down on the Bay at 7 oclock. The \"Marathon\" arrived in the Bay tonight with Infantry 133rd AMC & other units; great reception from us on the Argyllshire & from the Benalla (also out in the Bay). Now we have, I think, four other troopers here besides our ship. It will be some sight when we all move off. Tonight the latest is that we have a route march to Blazes somewhere. Anyhow it will be a stretch of legs. S. Partridge returned from Wynberg Hospital today. Went under an operation with his arm. \n","34":" \n\nTurned out a beautiful day, although the heavy fog hung about till 11 oclock. Left the ship (marching order) by tug & lighter at 1 oclock. Started from docks for route march to Sea Point. A very pretty walk there, and is a swell residential place. Broke off at 12 for dinner which we had by roadside. Bully beef & bread &c consisted of the dinner. Fell in after to be told of leave granted till 3.45. Great joy. Went straight into Capetown. Had a drink bought some cards and posted them to Sydney. Had afternoon tea at an Australian womans café in Adderley St. A very fine woman considering all teas given to us boys were by invitation. Nothing much to be done on such short leave. Arrived back at boat at 5.30. A beautiful night with bright moon & very clear too. There is another ship coming up (10 oclock) Hope it is another trooper. Nigger’s pups born today.\n","35":" \n\nA misty kind of day. Queenslanders went over to Capetown for route march Same programme what we had yesterday. Officer on board troopship in Bay buried today in Capetown. Had a row round the Bay in one of the ship’s boats today. Otherwise a quiet day. Rained at night.\n","36":" \n\nVery quiet day. Full dress parade in morning. Another huge laugh at the great military stunt Just got dressed to sit down and reported any loss, and then told to get into fatigue dress. Makes me feel sick at the so called discipline of the \"Queens Own. Day was fine. Went on Picquet over for night (2-6) morning (2-6) next afternoon. Took water in from Capetown tugs. Arrival of some armed liner today. Probably an escort.\n","37":" \n\nA very fine day. Washing day for Battery. We left Capetown. Weighed anchor at 11.20 am. Our ship sailed off with \"Marathon\" as mate on the port side and with the \"Benalla\" & \"Beltana leading. The HMS Kent being convoy was well out in front. It was a very pretty picture. The four troopers with the Cruiser as escort sailing out of Table Bay on such a fine day. We left the Cunard armed liner \"Laconia\" at Capetown. Right up to nightfall we kept the same positions so I expect it will keep so till the end of voyage. I think our ship is the fastest of the four troopers.\n","38":" \n\nMess orderly for day; very slow kind of day. Rotten weather with heavy seas. Our ship kept quite in the rear of the other troopers up to nightfall. But at night came up quite close and then slackened off. \"Marathon\" still on port side when going to bed. Cruiser out of sight.\n","39":" \n\nDid not turn out a bad day, although the seas were a bit heavy. No church parade. Very lazy day having slept nearly all the time. Still playing seesaw with the other troopers.\n","40":" \n\nAnother quite day and a calm one. Awnings put up over decks ready for tropics. Doctor lectured on \"first aid\" & different wounds, also main arteries of the body. New submarine guard started.\n","41":" \n\nA beautiful day & beginning to be hot. Smooth sea. Something wrong with \"Marathon\". About 5 or 6 miles behind all day. Cruiser on our starboard side since this morning.\n","42":" \n\nUnit on duty. I was on Canteen fatigue. Another fine & warm day. Cruiser dropped back to Marathon & sailed back on our port side at 3.30 pm. Marathon steamed along at 6 oclock. Evidently the fault is remedied. First gun practice on the ship. Firing turned out very good. Another pay day received 15\/- on a\/c.\n","43":" \n\nAnother fine & warm day. Mess orderly for day. Full dress parade again. Another huge laugh. I did not get dressed anyhow. Nothing of importance happened. Night hot into the bargain.\n","44":" \n\nWashing day. Day hot typical weather for Tropics I presume. \"Marathon\" dropped behind again. Our ship Cruiser & the others slowed down at nightfall for her.\n","45":" \n\nAnother day in the Tropics which was hot. Concert held in the afternoon somewhat a success. Auction sale held. Nigger’s pups put up Two sold for £2\/3\/-. Money goes to Mariners fund.\n","46":" \n\nSunday today. Church Parade held in morning. A very hot day. Went on guard at four oclock as Telephonist. Did not spend a very good time. Passed the Line at early morning hours.\n","47":" \n\nFinished up guard at 4 oclock this afternoon after spending a hot & tiresome day. Our ship behind all day evidently the old craft is feeling the pinch. Is gradually getting up to the other ships tonight. In bed early.\n","48":" \n\nRaining today & very miserable. Otherwise very quite. Our ship still in the rear.\n","49":" \n\nRaining in morning but cleared up late in afternoon. Mess orderly for day. Our ship again up with the other troopers. Very likely to call at Dakar, French Senegal tomorrow.\n","50":" \n\nArrived Dakar at 10 oclock am after sighting land at 8 oclock. Beautiful day. First impression somewhat fair as regards scenery, although country is very low lying & barren. Our ship was the first to enter the harbour. Harbour is only a basin about a square mile or so with a low breakwater all round. Seems to be plenty of fish in this quarter. Niggers selling fish & diving for coins was the stunt all day. All residences at this port are built on the square & very low I suppose on account of the heat. Government house stands facing the sea, a very nice & compact looking building. We were not granted any leave so cannot say anything about general appearance of town. \"Marathon\" came up into port in the afternoon & we dropped anchor outside at 5 oclock pm. Beltana & Benalla also went into port. We took a load of fresh water aboard & also shipped & mounted a 4.7 gun. Town looks pretty outside the harbour especially as we saw it tonight. We are at present near the Battleship \"Swiftsure\" which we hear is to escort us to England. In port is the French warship \"Montcalm\". Anyhow so much for French Senegal\n\n29th June 1916 (con)\n\nwhich I hope we leave soon enough to finish the journey off. Had an impromptu concert at night which makes the monotony bearable anyway.\n","51":" \n\nWent into Dakar Harbour again this morning for coal. Washing day for our battery. Very hot day. Very antiquated method of coaling. Niggers carry little baskets full into the bunkers from the lighter through side doors. Dakar was very busy as regards shipping today. No less than 12 vessels arrived & departed. The a mail boat of the older Dempster line came in near us and had a no. of passengers on. Girls were amongst them. Some Australians were aboard. All our ships weighed anchor at 6 oclock for departure. The Beltana went first, then the Marathon playing the Marsillese amidst cheers from the Frenchmen on the Montcalm. We were the last to go out of harbour time 7 oclock and cheers from the passengers on the speeded us on our way. The \"Kent\" left at six oclock then came the \"Swiftsure\" after her the Beltana our ship Benalla & Marathon last. I do not know if this is going to stay, but the \"column of route\" method looks much more business like. Time not 9.30 & very hot.\n","52":" \n\nUnit on fatigue duty. I was on butchers fatigue Very rotten job. Day somewhat dull & windy improvement in the afternoon.\n","53":" \n\nMess orderly for day Missed Church Parade. Very windy. Sea inclined to be heavy.\n","54":" \n\nUneventful day. Rather a good day with beautiful blue sea.\n","55":" \n\nGood fine & bright day. Nothing eventful.\n","56":" \n\nBeautiful day. Smooth sea. Mess orderly. Warship had firing practice at abandoned sailing craft. Boxing tournament held.\n","57":" \n\nBeautiful day. Full dress parade. Liner passed going East.\n","58":" \n\nDay inclined to be the Bay of Biscay all day.\n","59":" \n\nFull dress parade again. Picked up one escort of destroyers this morning at 11.30. Swiftsure returned to her base South. One destroyer to each ship. Marathon speeded up and was soon in front leaving us last. Marathon away on horizon all day. Boxing tourney held in afternoon. \n","60":" \n\nMess orderly. Sighted shores of England at 10 oclock AM. Church Parade held. Passed Eddystone Light 2.30. Entered Devonport at 3.30. Stayed in the Harbour all night.\n","61":" \n\nDisembarked from Argyllshire at 9.30 AM by tug Sir Walter Raleigh to S.W. Dock Plymouth. 27th Battery first into train to take us up to Camp.\n\n10th July 1916 (con) \n\nLeft Plymouth at 10.30 AM. Great excitement at being on Terra Firma again. Devon scenery is very pretty. Writing this in the train. Arrived at Exeter 12.30. Had tea & buns. Mayoress doled out free buns & tea. Arrived at Amesbury our camp at 3.30 oclock. Long march to camp of about 5 miles. Pretty scenery en route. Camp very large. Sleeping in huts. Camp built on Salisbury Plains. Had a beer at canteen. Went to bed tired.\n","62":" \n\nFirst day in camp. Everything mixed up. Pretty cold. Posted letters home per YMCA. Artillery (Glasgow City) shooting practice on hill above our camp all day.\n","63":" \n\nCold day with slight rain. Fatigue duty on Sgt Mess. Full area parade. Colonel inspected in huts on account of rain. Went to Pictures saw Charlie Chaplin in Property Man. Had feed at canteen. Beds issued today in the shape of 3 boards & trestles also mattress of straw & pillow.\n","64":" \n\nMarched over to Stonehenge this morning. Did fatigue work this afternoon. Sent cable to Rana. Went to Amesbury by motor car. Trotted round visited ancient church. Had a good tea at Amesbury. Walked to Camp via Stonehenge.\n","65":" \n\nMess orderly for day. Very quiet. Best day since we have been in this camp. Received first mail from Australia. Great joy. Received pay of £4\/7\/-. Very handy. Went down to Variety show.\n","66":"\n\nFlag drill today. Unit came on duty at 4 oclock. Leave for London given out. Received another letter from Rana. Wrote letters for mail.\n","67":"\n\nSunday & a very miserable day. Unit on duty. Finished & posted letters for mail.\n","68":"\n\nCooks fatigue today. Very quiet day. Went to pictures at night saw Chaplin in Getting Acquainted.\n","69":"\n\nDay out with Specialists on Station work. Went to Amesbury at night.\n","70":"\n\nMess orderly. Very quiet day. Did not go anywhere at night, wrote letters. Fine day.\n","71":"\n\nStation work with H.Q. Fine day. Polished up for London leave.\n","72":"\n\nLeft camp at 9.30 for London. Train left Amesbury at 11.30. Fine day & hot. Arrived Waterloo Station 1.30. Marched up over Westminster Bridge past Houses of Parliament along Horseferry Road to AIF HQ. When dismissed walked through Horse Guard Parade to Strand where we booked room at Faulkner. Trotted about, booked seat for Joyland at the Hippodrome which was a good show. Went by Tube to Elephant & Castle. London rotten by night as the lights are and it is hard to get about.\n","73":"\n\nGot up at 8 oclock had hot bath. Breakfast etc for day. Went down to Big Ben for The walked across Green & St James Park to Piccadilly. Got bus to Bank of England. Saw Law Courts, St Pauls Newspaper offices of Fleet Street, House & Stock Exchange. Got Tube from London Monument to Marsh Lane where we visited The Tower of London. Saw Jewels Bloody Chamber etc & then got Tube back to Charing Cross, where we had dinner. Then Tube to Hyde Park to see Milly’s friend. Walked through the Park Saw Rotten Row Marble Arch & Serpentine also Park Lane. Had afternoon tea at Kiosk. Also saw the women workers procession. Not much Billy Hughes. Afterwards had tea at Knightsbridge and came back to Charing Cross by Tube. Had up and booked at Faulkners. Met Miller’s friend at Trafalgar Square. Got bus to Hamstead Heath. Fine place for . Left there late and had a rush back. First had to get a bus to Camden Town and then Tube to Charing Cross. Then Tube to Elephant & Castle. Saw girls home & then got Tube back to Trafalgar Square time 12.5 Glad to get to bed.\n","74":"\n\nHad a good bath & breakfast. Walked down to the Embankment & hired a boat. Rowed to Lambeth Bridge under Westminster, Waterloo Bridges. Talked to Slavey in Houses of Parliament from the River Thames. After got Tube from Charing Cross\n\n23rd July 1916 (con)\n\nto Baker Street. Saw Madam Taussauds Building. Had dinner at Globe Hotel, good meal. After got tube to Hyde Park. Walked about The Park from Bandstand down past the Serpentine. Afterwards took bus to Putney Common. Long ride but had a good view of outskirts (Kensington, Lambeth) Returned to Trafalgar Square by tube to Earls Court. Then to Piccadilly Circus & The Square. Booked a room again at Faulkners & had tea. After tea went to Elephant & Castle to meet the girls. Went to Streatham Common & . Returned by tram to Clapham where we got the Tube (the first one that was built in London which runs from Clapham to Euston) to Elephant & Castle. Saw girls home and returned ourselves by tube to Trafalgar Square very tired and fit for bed.\n","75":"\n\nHad bath & breakfast and got taxi to Mme Taussauds. Did not think much of the exhibition anyhow. Got tube from Baker Street to Trafalgar Square & had dinner. Afterwards walked round the Strand a while & went to picture show. Saw Mary Pickford in Eternal grind. After had a wash & got Strand Tube to Hyde Park. Sat in the park on Rotten Row for some time & then went to meet girls at Knightsbridge Tube. Took them to tea at , and saw them home to Elephant & Castle. Said Goodbye and then got tube\n\n24th July 1916 (con)\n\nto Waterloo where we got our train back to Amesbury at 9.30 Arrived Amesbury at 12 oclock. Lucky enough to get a motor to camp. When we arrived got news that we were transferred to Winchester. \n","76":"\n\nGot up at 6.30 very sleepy. Got ready for moving off to Winchester. Moved off at 9.30 with one kitbag for Station. Very hot march, and was glad to arrive at Amesbury. Left Amesbury and proceeded down South. Pretty scenery down that way. Saw Southampton in distance when we came in round for the line to Winchester. Saw large 4 funnel ship at wharf. Arrived Winchester at 2 oclock. Marched through city & had a long march about 5 miles I think, and hot & dirty too. Our camp is last on the list from Winchester. This camp is not as good as Amesbury. Very tired & glad to get a sleep. Wrote to Millie & Beatrice.\n","77":"\n\nGot up at 5.45. Reveille was at 5.30. Had a footslogging in the fog. Fell in again at 9 oclock for classification, More . Fell out till 11 oclock for inspection of huts. Cleaned up Stables & Harness Rooms in afternoon after medical inspection. Went into Winchester by car at 5 oclock. Had a good time & Bill & myself saw two girls up some road out of town. Got car back at 9.15.\n","78":"\n\n into signallers class under English officers today. Worked us pretty hard. Went over to Canteen at signallers school & had a rowdy time with Tommies.\n","79":"\n\nGot up feeling tired. Went with class all day & worked hard all day. Did not do much at night. Went down to Camp & saw old Pat OKeefe boxing, also Tommies Home of .\n","80":"\n\nSignalling all morning. Went into Winchester at 230. Had a good time very hot. Went all over The Cathedral, very interesting. Had a light tea and walked all around the town. Got a car back at 9.20 to camp.\n","81":"\n\nSunday today. Had church parade. Went to Winchester at 4 oclock after writing to Rana & Charlie. Hot day. Did not do much in town only visited the Great Hall & saw Arthurs’ Round Table. Sat down in the Cathedral grounds. Came home by Char a banc\n","82":"\n\nHot day. Signalling all day. Felt pretty rotten. Food supply still short. Did not go out.\n","83":"\n\nHot day. Still starved. Working with signallers all day. Did not go anywhere at night.\n","84":"\n\nPretty hot. With signalling class. Food still rotten. Did not go out anywhere.\n","85":"\n\nRiding school in the morning early. New timetable for parades started. Roger Casement hanged today at 9 oclock am.\n","86":"\n\nEasy day. Riding school early morning. Signalling rest. Day cool. Did not go out.\n","87":"\n\nPay day today. Went to Southampton today & saw Pier &c Not much of a place. Had a glimpse of the Aquitania. Met 2 girls from Clapham & had a good time for all. The Common after we had tea. Afterwards went to Southampton W & got train to Eastleigh where we alighted and saw girls part of way where they were stopping. Arrived at camp 12 afterwards for a car. \"Nigger\" came up from London.\n","88":"\n\nHut orderly, did not go to Church Parade. Went to Eastleigh by motor car & met girls. Lap. Scholls & Wills was with us. Had a good time home to London by the train from Eastleigh. Invited round, and afterward waited for Boys. Left the town amid great excitement from Station square. Had a great ride home by the car. Arrived back by roll call. Boys telling of adventures.\n","89":"\n\nSignalling & Jerks today. Went into E Squad as result of exam. Did not go out.\n","90":"\n\nRiding School this morning. Signalling all day. at Mess room today. Thought this could happen. Anyhow we were told off and given a chance to fix things up ourselves as regards food . The 7th have a marquee &c to Mess in now. Did not go out tonight.\n","91":"\n\nThe mess business turned out all right. Riding School & signalling morning. Had leave all the afternoon till 10.45 night. Went to Arlseford by car to visit the fete which was held for Red Cross. Was not much of a show. The grounds of the house where they had the show was very pretty. The village of Arlseford is a slow show, but with plenty of pubs. Some of the boys & myself got slightly mixed & our car did not turn up & had to walk 5 lovely miles to camp. Arrived home out of breath. Had a shower & slept well.\n","92":"\n\nRiding School & signalling. After parade got ready for Winchester. Went in by carriage & after a few went to the Fete. Better than the Arlseford affair, but nothing much anyhow. Saw some girl home named Evelyn & afterwards walked up on the camp road. Arrived back tired. Had a shower & went to bed.\n","93":"\n\nRiding School & signalling. Very quite day. Did not go out.\n","94":"\n\nStation Work & reading. Went to Southampton by train & did not have much of a time. Rained in the late afternoon. Came back by 9.45 & got our car to camp. \n","95":"\n\nRained today. On early morning stables. Did not attend church on account of being on Coal fatigue. Looked like the niggers in South Africa when we came off. Fancy soldiers coming at that game. In afternoon walked with some of the boys to Avington & Ichen Abbas villages. Had afternoon tea & walked back home 6 oclock. Went to bed early.\n","96":"\n\nSignalling today. Rained pretty heavy. Did not go out.\n","97":"\n\nSignalling & riding school. Rained heavy parts of the day.\n","98":"\n\nSignalling & riding school. Rained & things are very miserable. Went on Fire Picquet at 8.45. Fed & watered horses at 8.30.\n","99":"\n\nSignalling (in Gun shed all day). Raining & very sloppy underfoot. Did not go out.\n","100":"\n\nSignalling riding. Slightly better day. On Camp parade at night.\n","101":"\n\nSignalling & Station work. Went to Winchester for evening & saw . Arrived home 10.30 by car.\n","102":"\n\nChurch Parade. Went to Winchester & had a fair time. Came home by car at 9.\n","103":"\n\nSignalling in morning. Went on leave to Winchester & there The Fete. Not much good. Grounds pretty. Arrived back by car at 10.30.\n","104":"\n\nSignalling & riding school. Went to Winchester after tea & came back by Charabanc at 9.\n","105":"\n\nLectures & Buzzer Riding School. Walked to Easton & attended camp parade.\n","106":"\n\nManoeuvres in the morning with Battery Buzzer Riding School. Paid today. Did not go out but attended camp parade.\n","107":"\n\nSignal lecture & Buzzer Riding School. Did not go out at night.\n","108":"\n\n Telephones. Went to Winchester & saw the show at The Royal. Came back by car at 10.45.\n","109":"\n\nCooks fatigue till dinner time. Went to Winchester & had tea & a stroll round. Met two girls & had a walk in the wet. Came home by Char a banc.\n","110":"\n\nSignalling lecture & buzzer &c. Riding School in afternoon. Did not go out. Camp parade.\n","111":"\n\nBuzzer & Signalling lectures. Rained all day & things are very miserable. Did not go out.\n","112":"\n\nBuzzed out for early morning parade & came back to hut. around until 10.30 on account of sports which were postponed. Afterwards went over to signals and sat in Marquee for over an hour when the Pommy Adj came over & copped us. Great argument & he marched us back & made us manhandle a 4.5 howitzer over to T Lines & Sergt Major Hans had a talk with us over there & had a good laugh over it. Anyhow it was some fun while it lasted. Afternoon\n\n30th August (con)\n\nwent to school & riding on the hill in the mud & slop. Had a fine little pony. After parade went to Winchester by car & met Win. & went over to the Downs, had a fine time with this bright little girl. Saw her home & came home with & rest in the car I had booked. Got mucked up on the road by crook sparking plugs & had a wait awhile arrived back to camp 10.5 late.\n","113":"\n\nLecture & Buzzer Riding School. Turned out a fairly good day. Lamp parade at night.\n","114":"\n\nSports Day on Mess orderly. Finished up 7 oclock & did not go out.\n","115":"\n\nCooks Fatigue. Went to Winchester in afternoon. Trolled around & met Win at 6 in Boots. Walked along Ichen to the Downs & had a good time. Came back at 10 oclock & saw her home, Came back to camp with Bill on GWK car.\n","116":" \n\nLast day in Winchester. Did not go to Church. Met girls at 3 oclock & took the same walk as before. Took photographs on the way. Had a lay down &c & came back at 630. Had a bit of tea & found Bill & Dolly whom we missed.\n\nWent to Win’s place & had a good evening. Singsong & something to eat. Left the house at 10 for camp on the big \n","117":"\n\nGot up at 4 oclock ready for moving off. Marched off at 7 after speech from Commandant & arrived at station left Winchester at 9 oclock for Amesbury. Arrived at Amesbury at 11 oclock. Marched to camp and arrived very rotten. Everything arse up with me again. Raining & rotten to hell. Sorry I have left Winchester. Very tired & miserable at this rotten hole.\n","118":"\n\nRottenly cold day. Reveille 6 oclock. On fatigue & gun drill. Very nice I may say. A Brigade supposed to be ready for the front doing pioneer work. Anyhow I dont know how things are going to pan out. Wrote to Wyn & posted at a P\/O and afterward went to pictures.\n","119":"\n\nOut with Telephones & Flags. Pay day to-day. Did not go out but took phones down the hill. Wrote to Rana.\n","120":"\n\nSignalling & Telephone. Also range finder & Director work. Football match between our battery &","121":" Win for 28th 16 to nil. Did not go out.\n\n8th Sept 1916\n\n & Telephones. Had some manoeuvres with Director & Range Finder etc. Colonel Pearce bid us all good bye. Returning to Sydney. Received & answered letters from Cousin Kat. Milly & Horrie. Did not go anywhere.\n","122":"\n\nTelephones in the morning. Did not go out till night when I went to pictures & saw Charlie Chaplin in The Elopement.\n","123":"\n\nSunday today. Mess orderly. Better lot than the Winchester one. Day slightly cold & dull. Received first letter from Laurie. Walked to Amesbury & then had a look round rotten hole. Got home at 9 oclock.\n","124":"\n\nDay out on manoeuvres. Part allotment of positions. I have got nil so far. Played soccer match against 26th. Result 2 to nil against us. Did not go anywhere.\n","125":"\n\nStarted with our own HQrs in morning. Then some more military stunts. All put together signallers from Div. HQrs and Batteries. Makes one sick & tired of the whole show. Anyhow I can see waste time & trouble for nothing. I suppose the Winchester training going to Hell now.\n\nGen Sir John French visited this camp today. Received first letter from my father & sister since arriving in England. Answered their letters also Lauries &Wyns.\n","126":"\n\nEarly morning jerk on hill. Went up & had a good close glimpse at aeroplane on the ground. Signalling test morning. Signalling reading afternoon. Marched with the 7th down to camp 14 to hear lecture from some old in the Salvation Army a colonel I think. Gave us a . While we were lined up ready to be marched over an aviator in a small plane gave us a bonser exhibition of flying. Very exciting.\n","127":"\n\nSignalling & out on Battery work. Walked down to camp 10 to find Perce. He was out at Amesbury on Picquet.\n","128":"\n\nSignalling. Cold day but sunny. Walked down to Durrington to see Perce, but did not see him. Received photo from Millie.\n","129":"\n\nLectures Heliot Lamp. Received letters Rana & Wyn. Wrote letters Aust. mail also to Millie & Cousin Kate. Went down to see Perce. Met him & went to Durrington. Had a beer at Plough Inn & afterwards went to concert at YMCA. Came back & had drink at canteen. Said Goodnight and came back with boys 9.45.\n","130":"\n\nSunday today. Cooks fatigue. Did not go out. Wrote letters for mail. Perce came up to the hut. Talking for a long while then we went over to the canteen with the boys and had a , afterwards we soon went away to huts. \n\n"}}