{"Document Name":{"0":"Diary_0341","1":"Diary_0341","2":"Diary_0341","3":"Diary_0341","4":"Diary_0341","5":"Diary_0341","6":"Diary_0341","7":"Diary_0341","8":"Diary_0341","9":"Diary_0341","10":"Diary_0341","11":"Diary_0341","12":"Diary_0341","13":"Diary_0341","14":"Diary_0341","15":"Diary_0341","16":"Diary_0341","17":"Diary_0341","18":"Diary_0341","19":"Diary_0341","20":"Diary_0341","21":"Diary_0341","22":"Diary_0341"},"Date":{"0":"unknown","1":734.0,"2":735.0,"3":736.0,"4":737.0,"5":738.0,"6":739.0,"7":740.0,"8":741.0,"9":742.0,"10":743.0,"11":744.0,"12":749.0,"13":750.0,"14":751.0,"15":752.0,"16":753.0,"17":755.0,"18":760.0,"19":761.0,"20":766.0,"21":767.0,"22":768.0},"Entry":{"0":"\n\n","1":"\n\nWe embarked at 11 am at No 2 W\"loo wharf & put out into the stream at 3 pm & set sail at 5.50 pm. Sea very calm & we slept well.\n","2":" (1)\n\nSea still calm & lovely breeze blowing. Had my hair lopped. Full Dress parade & boat drill.\n\nDinner & Tea was a huge scramble. Plum pudding for dinner very good. Passed Gabo & can see the shore all the while. Very rugged & uninteresting. Boat very slow but very steady. Plenty of fellows sick but\n\nthe jig-jig of the boat does that. Saw a sea-lion while on parade.\n","3":" X’mas Eve (2)\nSea still smooth just like a harbour trip. Washed some togs & took them out on to the f’k’slehead & sat alongside till they dried.\n","4":" X\"mas Day (3)\nSea still very calm we are between Melbourne & Adelaide & have not sighted land since yesterday at noon. Spent the morning in the fore-hold & looking for our piano but was unable to find out.\n\nBroached a tin of preserved fruit & one of prunes. Had a bonza dinner & read magazines all the afternoon. We held a concert in F\n\nWard last night & it was very good. All the officers & nurses were present & some of the latter are very nice.\n","5":" (4)\n\nChurch Parade in the concert Room. Everybody standing. Few hymns & prayers C.E. style, R.C’s went somewhere else. Received a wireless from the Kind & Queen with Xmas greetings.\n\nSea still smooth & we are being fed well & do nothing but lie down & read.\n\nMonday Boxing Day (5)\n\nUsual routine till 2 pm when we held sports. Ran 2nd in Potato race, 2nd in Carry Your Chum & was unable to run in final of Wheel-barrow race. Ellis & Jimmy McGowen’s son got","6":"\n\nJust as sports finished a bit of a storm blew up & we have some nice big rollers about us.\n","7":" (6)\n\nHave been suffering all day from the effects of the blow. Had no breakfast or dinner but made up for it at tea. Have some medicine in my pocket but carry it as a mascot. The cure is worse than the disease.\n\nSeveral whales seen to-day but I missed them. Am going to write home tonight.\n","8":" (7)\n\nSea much calmer & land sighted after 3 days. Passed Albany heads at 2 pm\n\nand have been bowling in front of a gentle easterly breeze. Orderly corporal this day & have been very busy all day.\n\nWrote to J.N., M.P., B.C., & Home. A bit of a scrap over the organ in the night but there will be nothing doing till we leave Fremantle.\n","9":" (8)\n\nSea very calm & are making up for lost time. We came up with Rott Nest Island about 12.30 pm. It is a long narrow island about 4½ miles along. We arrived at Fremantle at 5.30 & went ashore at 7.30. straight to Post Office & some sent Telegrams. Had some Ice Cream & a walk round. Very clean little city laid out in squares. Fruit all sold\n\n(Rott Nest Island. German Camp).\n\nby the pound. \n\nI caught the 9 pm train to Perth, 12 miles away. The trains are very slow & dirty. We travelled 1st class & the compartments were no cleaner than a horse box on our own railways. The railway gauge is only about 3’ 6\" & of course teams the same.\n\nI helped the Nurses over with their luggage & helped them into a cab. The horse was very frightened & nearly pawed me 5 or 6 times but eventually they (4 of them) got aboard. Ellis & Dev High, our new mate, had walked on so Dave & I hurried & caught them up. We stayed at the same\n\nhotel, \"The Palace\" & although the wind in the chimney was like a man snoring under an anaesthetic, Dev & I managed to get to sleep about 1.30 am.\n","10":" (9)\n\nArose at 6.30 & had a lovely hot bath. Dave & I went for a walk down to the Terrace & then met 3 of the Pros & went for another walk. Breakfast at 8. Tremendous breakfast attended by a French waitress. After Breakfast took a walk round the town & sent some P.C. views Home. Wrote a letter Home in the Grand Writing Room.\n\nEllis, Dev & I with 3 of the Probationers left the Hotel by Motor at 10.45. The road is like a billiard table.\n\nLeft Fremantle with £10.19.1, & 3d. out of X\"mas Pudding & 3 lucky 1\/2d.’s surface. We drove for a couple of miles by the River Swan. We passed a banana plantation & then a grand swimming baths. These baths are about 150 yds out from the shore & over a ¼ mile long. The W.A. swimmers hold the long distance races in the open river. A shark has never been known to tackle anybody.\n\nWe then passed on through King’s Park. We saw many flowering gum trees. It is the first time I have noticed them. They are all colours of Red. Motored right down to the wharf & were aboard at 12.15 pm. We sailed again at 4.15 pm\n\n \n\nand saw the last of Australia at 7.30 pm.\n","11":" New Year’s Day (10)\nNo parade in the morning. Sea a bit choppy & one wave came into the Port Hole & wet some of the chaps beds. \n\nHeld a boxing match at 2.30 pm. Rigged up a bonza ring on No 1 Hatch. Ropes & corner posts & all things stadium like. Spent a nice afternoon. Nearly all the boxers have bruized arms or fingers or cut lips & black eyes.\n\nShip’s staff gave another concert in F ward. Our nurses seated near us provided chocolates. We had sent them New Year Greetings early in the day.\n\n8.30 pm for fatigue parade. I have just to walk around the sleeping quarters till 9.30 when they have finished cleaning. Then another Roll Call at 10.30.\n\nI am learning French & the small class meets on the Fore Hatch after this parade till 12 noon dinner time. A lecture parade at 2.45 pm till 3.45 pm & then finish for the day. We have Wednesday & Saturday afternoons free & on Sunday after the fatigue parade we are free. We always have sports on Wednesday afternoon followed by a\n\nWe have a lot of arguments with the A.M.C. staff & there seemed to be serious trouble brewing. Everything has been patched up now & we are the very best of friends.\n\nLast night we had an open air concert on the Fore-deck just under the Bridge. About 50 men sat & sang all the songs that they knew. The Nurses & some of the Officers were seated on the steps & along the Promenade Deck.\n\nIf my diary appear abrupt or empty on other days just imagine all these parades as still going on.\n\nWe cannot get our piano. It is packed away behind 500 tons of cargo so we will have to wait till we get to the other side.\n\nnot to lean on the sides & he was told to take his shoes & watch off & they tossed him. They searched the wards & on top of cook houses & every nook in the ship. \n\nAbout six out of the whole unit (132) escaped. Ellis sneaked down & the seamen dressed him up. He was walking about watching the others. Bill Allison came up to him & said have you seen a little fellow up here called \"Nick\"; Bill was going up to the Fo’c’sle Head to look for Ellis & Ellis said \"Eh lad, you can’t go up there\". Ellis walked about & told our fellows that they could not\n\nWe are getting into warm weather now but we still get a cool breeze.\n","12":" (16)\nIt is still raining & we cannot go up on deck to sleep. We were granted permission to go up on deck to sleep this morning. We were issued with covers for our mattresses but I don’t bother with the mattress. I just take my 2 Blankets & pillow.\n\nWe had a lecture in the afternoon from Capt Wylie all about \"germs\". My word we will learn a lot before we have finished this job.\n\nI had to sleep on three forms side by side & I had a real good night’s rest.\n\ncandidates at the first sports. Ellis & Jimmy McGowen’s son won the wheel-barrow race & Ellis got a knife like mine with a chain already on it, about","13":" worth.\n\nOne of the items on the programme was a treacly bun race. They had to bite a bun off a bobbing string & eat it. Matron threw flour all the faces of those that were chewing at the buns & what with bun & treacle & flour the competitors did look frights. After biting the bun they had to run to the end of the deck & eat\n\nexcept when on fatigue. We are having a lovely time & it is just like a picnic. \n\nThe sea is a bit choppy just now but we do not get sick as we are quite used to it. We walk about the deck just as if we were on dry land. Sometimes when she is rolling about & the linoleum is wet we slide about but that is only fun. \n\nWe are more than half-way on our journey at this time & only hope that the second half is as good as the first half. We have not seen a vessel since we left W.A. We often see a star very low down & think it is a light.\n","14":" (19)\nUsual routine till 7 pm when Capt Teague gave a lecture in F Ward on how to keep out of mischief in Egypt. \n\nThe weather all the time is very cool & the sea is calm. Every morning about 2 am the wind rises a bit & we have a shower of rain but otherwise it is just like a trip to Manly on a breezy Saturday afternoon.\n\nI washed some clothes & hung them over the steam pipe at the back of my bunk & they dries by night time.\n","15":" (20)\n\nA very eventful day. \n\nUsual routine till 2.45 when Capt Bray gave another lecture.\n\nnot allowed to lay a hand on a Corporal & it is a crime to put a Corporal in the cell. \n\nI had to go before the 2nd in command & things were pretty soon fixed up. The","16":" in command almost asked me to let the matter drop because the guard – he was a sergeant – & if I had pressed the case would have lost his 3 strips. Anyway he got a blowing up from the adjutant. It was quite an experience & caused a great amount of fun.\n","17":" (21)\n\nA hell of a hustle today. At 9.30 the 5 sirens went, which is the signal, stand to the boats.\n\nI have physical drill & stretcher drill every morning & French lessons twice a day & bandaging at night between 7 & 8.\n\n \n\nI have not had any special duty to do for about 3 or 4 days. I suppose I will cop out to-morrow. We had a lecture this afternoon & I could not keep awake. I was sitting right in front & went to sleep twice & Ellis had to wake me up.\n\nHad first lesson at Roller-Bandaging last night. I am learning every thing\n\n \n\nof anything of interest so far on the journey. We have now spent two sun sets in the Northern Hemisphere but I have seen plenty of sunsets in N.S.W. equally as good. The weather is still beautifully calm & we have had a cool breeze ever since we have left Sydney.\n\nWe had another lecture to-day but I got at the back & nearly went to sleep so I sneaked round a corner to a table & half wrote a letter to Bess Cuneo. The lecture today was all about bugs, fleas, lice & flies. It was enough to send\n\nthe calls at the proper time. I had to go round the ship with the Inspecting Officers. Any work to be done I just tell the other Orderly Sergeant & he sees that it is done.\n\nWe had a boxing tournament this afternoon. Two of our sergeants fought the preliminary fight. All the other sergeants split into 2 sections, each section taking a man. Neither of the pugs have ever had the gloves on & one was as tall as Mr Park & the other about as tall as Lily. Each party coached his man & had the two combatants as excited as two kids. \n\nAt last the pugs\n\nof powder. The two boxers did not see any fun in it at all. They were both deadly serious.\n\nIn the last round, the limit was reached. The little chap, little Scotty we call him was hanging onto the ropes with one hand & swinging the other one round like a windmill. About halfway through the round neither could see the other & they were rolling all round the hatch till the gong went.\n\nSome of the other fights were very good & we had a good afternoon. \n\nWe had another concert on the Prom Deck. We sat right down the back with our nurse friends. They gave each of us a lovely navel orange the first we\n\nI had put my boots & leggings on for a fortnight. I was slipping all over the wet deck & down the stairs. If you slip on the stairs you go right to the bottom because the boat is generally rolling that way.\n\nI had a very lazy afternoon & at night we all went to the sacred concert in F Ward. There were only a few of the Nurses & Doctors & Capt Moreau sang a very good song.\n\nWe have had a very strong N.E. breeze for the last few days & I can tell you that you have to tuck your blankets round you at night.\n","18":" (26)\n\nTook the job of cleaning knives & forks to-day. I miss a parade\n","19":"","20":"\n\nWe come in sight of land again this morning at 2 am. Some fellows sat up & gazed on it till daylight. It is a high mountainous coast & we are steaming along about 10 miles out. We saw a tramp to starboard homeward bound to Australia. We also saw a fellucca sneaking along the coast south. \n\nA small dhow passed astern about ½ an hour ago & when we went up on deck at 6.30 we saw all the Nurses in Pyjamas & wrappers hanging over the side looking at it.\n\nI am cleaning knives again this morning\n\nthey they were all got together on board.\n\nWe came through Hell’s Gate at 7 pm. There are a string of Islands strung out across the water from Arabia to Africa & we passed on the southern side of the Island of Perim. There is a naval station on Perim & our wireless sent a message & received one in answer.\n\n Just as we passed into the Red Sea we passed another Hospital Ship, The Syrian, which runs to India. She looked lovely & only passed about a mile away & we heard those on board cheering, very faintly of course. We passed about\n\nthe trip, in the place where we should be travelling the slowest.\n\nWe had a mock trial on a Breach-of-Promise case last night. I was right at the back & could not hear very much. I had a feed of chocolate & nuts & sultanas any way. I ducked out about half-way through the show & went to bed.\n\nIt is blowing a hard as a sou-easter in N.S.W. last night. This is the Red Sea the hottest place on earth. The sea is very choppy but we are so used to the rolling & pitching, that we only notice it\n\nhands get dirty & there is just enough water to lather your hands & then you have to go & wipe the rest off. Someone has taken that old razor strap of mine. I did not think any one would be bothered with that thing.\n\nI am going to bed now, there is nothing doing & we are getting very impatient now as we want to get ashore.\n","21":" (31)\n\nHad a terrible job to-day. All the strawberry-baskets had to be collected & scrubbed & I had over a dozen men\n","22":" (32)\n\nWe arrived at Suez to-day at Dinner-time & we are now anchored out in the stream. There are plenty of ships, including another Indian Hospital Ship \"The Assaye\". It is funny to see the town all white & yellow square looking buildings. \n\nIt is blowing a stiff breeze & this morning & when on Parade it was perishing cold, the coldest I have ever felt I think. It is A.!. to be in Port again & we are to go ashore & take train immediately for Cairo tomorrow at 5 pm. Every hour or so a couple of steamers up anchor & off through the canal, their\n\nIssue of tucker, I got up in a corner with a couple of my nurse friends. They covered me up with rugs & the officers & other nurses thought that I was one the Officers. I had one of the most pleasant evenings I have spent on the whole journey.\n\nThe chief engineer was one of the party & he invited me down to his cabin. I went down when the girls went to bed at 10 pm & had a chat & he gave me a box of 100 lovely cigarettes. I have 35 packets of cigarettes as well as these. I got them for 2d a packet. They are 5d in Cairo. I have nearly enough to see me out for 12 months.\n\n"}}