{"Document Name":{"0":"Diary_0054","1":"Diary_0054","2":"Diary_0054","3":"Diary_0054","4":"Diary_0054","5":"Diary_0054","6":"Diary_0054","7":"Diary_0054","8":"Diary_0054","9":"Diary_0054","10":"Diary_0054","11":"Diary_0054","12":"Diary_0054","13":"Diary_0054","14":"Diary_0054","15":"Diary_0054","16":"Diary_0054","17":"Diary_0054","18":"Diary_0054","19":"Diary_0054","20":"Diary_0054","21":"Diary_0054","22":"Diary_0054","23":"Diary_0054","24":"Diary_0054","25":"Diary_0054","26":"Diary_0054","27":"Diary_0054","28":"Diary_0054","29":"Diary_0054","30":"Diary_0054","31":"Diary_0054","32":"Diary_0054","33":"Diary_0054","34":"Diary_0054","35":"Diary_0054","36":"Diary_0054","37":"Diary_0054","38":"Diary_0054","39":"Diary_0054","40":"Diary_0054","41":"Diary_0054","42":"Diary_0054","43":"Diary_0054","44":"Diary_0054","45":"Diary_0054","46":"Diary_0054","47":"Diary_0054","48":"Diary_0054","49":"Diary_0054","50":"Diary_0054","51":"Diary_0054","52":"Diary_0054","53":"Diary_0054","54":"Diary_0054","55":"Diary_0054","56":"Diary_0054","57":"Diary_0054","58":"Diary_0054","59":"Diary_0054","60":"Diary_0054","61":"Diary_0054","62":"Diary_0054","63":"Diary_0054","64":"Diary_0054","65":"Diary_0054","66":"Diary_0054","67":"Diary_0054","68":"Diary_0054","69":"Diary_0054","70":"Diary_0054","71":"Diary_0054","72":"Diary_0054","73":"Diary_0054","74":"Diary_0054","75":"Diary_0054","76":"Diary_0054","77":"Diary_0054","78":"Diary_0054","79":"Diary_0054","80":"Diary_0054","81":"Diary_0054","82":"Diary_0054","83":"Diary_0054","84":"Diary_0054","85":"Diary_0054","86":"Diary_0054","87":"Diary_0054","88":"Diary_0054","89":"Diary_0054","90":"Diary_0054","91":"Diary_0054","92":"Diary_0054","93":"Diary_0054","94":"Diary_0054","95":"Diary_0054","96":"Diary_0054","97":"Diary_0054","98":"Diary_0054","99":"Diary_0054","100":"Diary_0054","101":"Diary_0054","102":"Diary_0054","103":"Diary_0054","104":"Diary_0054","105":"Diary_0054","106":"Diary_0054","107":"Diary_0054","108":"Diary_0054","109":"Diary_0054","110":"Diary_0054","111":"Diary_0054","112":"Diary_0054","113":"Diary_0054","114":"Diary_0054","115":"Diary_0054","116":"Diary_0054","117":"Diary_0054","118":"Diary_0054","119":"Diary_0054","120":"Diary_0054","121":"Diary_0054","122":"Diary_0054","123":"Diary_0054","124":"Diary_0054","125":"Diary_0054","126":"Diary_0054","127":"Diary_0054","128":"Diary_0054","129":"Diary_0054","130":"Diary_0054","131":"Diary_0054","132":"Diary_0054","133":"Diary_0054","134":"Diary_0054","135":"Diary_0054","136":"Diary_0054","137":"Diary_0054","138":"Diary_0054","139":"Diary_0054","140":"Diary_0054","141":"Diary_0054","142":"Diary_0054","143":"Diary_0054","144":"Diary_0054","145":"Diary_0054","146":"Diary_0054","147":"Diary_0054","148":"Diary_0054","149":"Diary_0054","150":"Diary_0054","151":"Diary_0054","152":"Diary_0054","153":"Diary_0054","154":"Diary_0054","155":"Diary_0054","156":"Diary_0054","157":"Diary_0054","158":"Diary_0054","159":"Diary_0054","160":"Diary_0054","161":"Diary_0054","162":"Diary_0054","163":"Diary_0054","164":"Diary_0054","165":"Diary_0054","166":"Diary_0054","167":"Diary_0054","168":"Diary_0054","169":"Diary_0054","170":"Diary_0054","171":"Diary_0054","172":"Diary_0054","173":"Diary_0054","174":"Diary_0054","175":"Diary_0054","176":"Diary_0054","177":"Diary_0054","178":"Diary_0054","179":"Diary_0054","180":"Diary_0054","181":"Diary_0054","182":"Diary_0054","183":"Diary_0054","184":"Diary_0054","185":"Diary_0054","186":"Diary_0054","187":"Diary_0054","188":"Diary_0054","189":"Diary_0054","190":"Diary_0054","191":"Diary_0054","192":"Diary_0054","193":"Diary_0054","194":"Diary_0054","195":"Diary_0054","196":"Diary_0054","197":"Diary_0054","198":"Diary_0054","199":"Diary_0054","200":"Diary_0054","201":"Diary_0054","202":"Diary_0054","203":"Diary_0054","204":"Diary_0054","205":"Diary_0054","206":"Diary_0054","207":"Diary_0054","208":"Diary_0054","209":"Diary_0054","210":"Diary_0054","211":"Diary_0054","212":"Diary_0054","213":"Diary_0054","214":"Diary_0054","215":"Diary_0054","216":"Diary_0054","217":"Diary_0054","218":"Diary_0054","219":"Diary_0054","220":"Diary_0054","221":"Diary_0054","222":"Diary_0054","223":"Diary_0054","224":"Diary_0054","225":"Diary_0054","226":"Diary_0054","227":"Diary_0054","228":"Diary_0054","229":"Diary_0054","230":"Diary_0054","231":"Diary_0054","232":"Diary_0054","233":"Diary_0054","234":"Diary_0054","235":"Diary_0054","236":"Diary_0054","237":"Diary_0054","238":"Diary_0054","239":"Diary_0054","240":"Diary_0054","241":"Diary_0054","242":"Diary_0054","243":"Diary_0054","244":"Diary_0054","245":"Diary_0054"},"Date":{"0":"unknown","1":1290.0,"2":1291.0,"3":1292.0,"4":1293.0,"5":1294.0,"6":1295.0,"7":1296.0,"8":1297.0,"9":1301.0,"10":1302.0,"11":1303.0,"12":1304.0,"13":1305.0,"14":1306.0,"15":1307.0,"16":1308.0,"17":1309.0,"18":1310.0,"19":1320.0,"20":1321.0,"21":1322.0,"22":1323.0,"23":1324.0,"24":1325.0,"25":1326.0,"26":1327.0,"27":1328.0,"28":1329.0,"29":1333.0,"30":1334.0,"31":1335.0,"32":1336.0,"33":1337.0,"34":1338.0,"35":1339.0,"36":1340.0,"37":1341.0,"38":1342.0,"39":1343.0,"40":1344.0,"41":1345.0,"42":1346.0,"43":1347.0,"44":1348.0,"45":1349.0,"46":1350.0,"47":1351.0,"48":1352.0,"49":1353.0,"50":1364.0,"51":1365.0,"52":1383.0,"53":1384.0,"54":1394.0,"55":1395.0,"56":1411.0,"57":1412.0,"58":1413.0,"59":1414.0,"60":1415.0,"61":1419.0,"62":1420.0,"63":1421.0,"64":1422.0,"65":1423.0,"66":1424.0,"67":1425.0,"68":1426.0,"69":1456.0,"70":1457.0,"71":1458.0,"72":1459.0,"73":1460.0,"74":1461.0,"75":1462.0,"76":1463.0,"77":1464.0,"78":1465.0,"79":1466.0,"80":1467.0,"81":1515.0,"82":1516.0,"83":1517.0,"84":1518.0,"85":1577.0,"86":1578.0,"87":1579.0,"88":1580.0,"89":1581.0,"90":1582.0,"91":1583.0,"92":1610.0,"93":1612.0,"94":1613.0,"95":1614.0,"96":1615.0,"97":1616.0,"98":1619.0,"99":1620.0,"100":1621.0,"101":1622.0,"102":1623.0,"103":1624.0,"104":1625.0,"105":1626.0,"106":1627.0,"107":1628.0,"108":1629.0,"109":1630.0,"110":1631.0,"111":1632.0,"112":1633.0,"113":1635.0,"114":1636.0,"115":1637.0,"116":1638.0,"117":1639.0,"118":1640.0,"119":1641.0,"120":1642.0,"121":1643.0,"122":1645.0,"123":1647.0,"124":1648.0,"125":1649.0,"126":1650.0,"127":1655.0,"128":1656.0,"129":1657.0,"130":1658.0,"131":1659.0,"132":1660.0,"133":1664.0,"134":1665.0,"135":1667.0,"136":1668.0,"137":1669.0,"138":1670.0,"139":1671.0,"140":1672.0,"141":1673.0,"142":1674.0,"143":1675.0,"144":1676.0,"145":1677.0,"146":1678.0,"147":1679.0,"148":1680.0,"149":1681.0,"150":1683.0,"151":1684.0,"152":1685.0,"153":1686.0,"154":1695.0,"155":1696.0,"156":1697.0,"157":1698.0,"158":1703.0,"159":1704.0,"160":1705.0,"161":1706.0,"162":1707.0,"163":1708.0,"164":1725.0,"165":1726.0,"166":1727.0,"167":1728.0,"168":1729.0,"169":1736.0,"170":1737.0,"171":1738.0,"172":1740.0,"173":1741.0,"174":1742.0,"175":1743.0,"176":1744.0,"177":1745.0,"178":1746.0,"179":1747.0,"180":1748.0,"181":1749.0,"182":1750.0,"183":1751.0,"184":1752.0,"185":1753.0,"186":1754.0,"187":1755.0,"188":1756.0,"189":1757.0,"190":1758.0,"191":1763.0,"192":1765.0,"193":1767.0,"194":1768.0,"195":1769.0,"196":1770.0,"197":1771.0,"198":1772.0,"199":1782.0,"200":1783.0,"201":1784.0,"202":1785.0,"203":1786.0,"204":1787.0,"205":1793.0,"206":1796.0,"207":1798.0,"208":1800.0,"209":1801.0,"210":1802.0,"211":1803.0,"212":1809.0,"213":1815.0,"214":1816.0,"215":1817.0,"216":1818.0,"217":1819.0,"218":1823.0,"219":1825.0,"220":1826.0,"221":1831.0,"222":1843.0,"223":1853.0,"224":1860.0,"225":1870.0,"226":1871.0,"227":1872.0,"228":1873.0,"229":1874.0,"230":1878.0,"231":1884.0,"232":1885.0,"233":1886.0,"234":1896.0,"235":1897.0,"236":1908.0,"237":1909.0,"238":1914.0,"239":1916.0,"240":1922.0,"241":1923.0,"242":1925.0,"243":1926.0,"244":1963.0,"245":1968.0},"Entry":{"0":"\n\nEmbarked with the ","1":" Reinforcements of the 20th Battalion A.I.F from New Pier, Port Melbourne, Victoria. I left Liverpool Camp in New South Wales at Midday yesterday and proceeded by troop train to Melbourne. The troops reached New Pier about 11 a.m. this day. A few hours later we were all accommodated in Transport A29, otherwise designated, His Majesty’s Australian Troopship \"Suevic\", of the White Star Line. Turmoil and confusion all the afternoon, caused by efforts to settle down in confined space. The men of the 20th were allotted the port side of Troop Deck F, the lowest of all, and \nright\n in the Stern. Fourteen men, including a \nthe\n Corporal in charge, \nare\n were set to each mess table, where the necessary messing utensils were placed. Later a hammock, and 2 blankets were issued to each man.\n","2":" 21st:-\n\nSpent a horrible night. Could not sleep cramped in the hammock. Vitiated air made me and many others sick. At noon the Transport was preparing to sail, and at this time the Governor General (Sir R. Munro-Ferguson) came down to our deck, inspected us, and said: \"Good bye, boys; good luck.\" We all felt very sad when the ship’s engines began to throb, and the Ship to move. The great crowd on the wharf looked up to us equally sad, tears streaming from the eyes of the womenfolk. Gaily coloured streamers, stretching from the \"Suevic\" to the wharf floated in the breeze until they were snapped\n\nby the vessel’s drawing clear of the Wharf. Ah, how painful these symbols of separation! – the trials of our sacrifice have commenced. All now realise they are leaving a land of peace for a far distant country stricken by war. There \nwas\n is less of sadness for me, for I had suffered the grief of parting from dear ones at Sydney and Brisbane. I wonder how many of us will come back.\n","3":" 22nd:-\n\nWell out to sea, and making South. Coastline not visible. Rumour has it, \"we shall not call at Fremantle\", because a German raider is supposed to be hovering about the Australian Coast. Over 2000 soldiers are packed into the holds of the \"Suevic\", most of them are sea sick. Wrapped up in their great coats and, with the turned up hats dragged over their blanched faces, they look \nthe\n pictures of misery.\n","4":" -\n\nToday \nI\n saw the master of the \"Suevic\" for the first time; Commander English R.N R. He is a short thick-set little chap with a fiery red face. It is reported we are carrying cargo valued at £ 1,000,000. Rain, cold, and a rough sea are now increasing the misery of the sea sick troops.\n","5":" 25th:-\n\nLife belts \nwere\n issued today. The","6":" Reinforcements of the","7":" Battalion \nwere\n selected to be the armed guard of the life boats in case of panic. It is known definitely that we shall not put in to Fremantle, much to the dis\ns\nappointment of all ranks.\n","8":" 28th:-\n\nThe printing and publishing of a troopship newspaper \nwas on\n were mooted today. Some of my comrades suggested I should be editor. I was not anxious, as I had just completed 10 years of Land Press work when I enlisted.\n","9":" 25th:-\n\nLieutenant E.A. Christensen pressed to starting the newspaper and to assume the editorship. I agreed. At somebody’s suggestion it was resolved today to name the paper, \"The Hevic\", some thinking this was a title reminiscent of the \"Suevic\" that would prove agreeable to the Censor*. It did. A small printing plant was found in the Comforts of the April Reinforcements of the Field Artillery, and today, it was set up in a corner of a stairway, amidships and immediately under the Orderly Room. The Staff was made as follows: - Superviser, Lieutenant Christensen; Editor, Private F.J. Brewer; Printers, G.V. Elliott and A.S. Simpson (privates). Corporal C.H. Tromlett assisted.\n","10":" 4th:-\n\nFirst issue + of \"The Hevic\" printed, published, and sold today. About 600 copies sold at one penny each. Paper received and read with enthusiasm.\n","11":" 7th:-\n\nGambling schools are busy night and day, the principal games being \"House\"; two up\"; \"Crown and Anchor\"; and \"banker\". Considerable sums are being lost and won, and play continues until \"Lights out\". A party of N.C.Os are expected to make a raid at any moment.\n\n* The O\/C Troops, Major P.C. Raper, see cartoon appendix 1\n\n+ Appendix 2., - a souvenir, comprising the complete number of issues, with autographs of those responsible for its production. All the printing was done on the ship.\n\nJuly 13th:-\n\nReached Durban, South Africa, about midday. Leave was granted, and at 7 PM we disembarked. Marched up to the Town Hall singing \"Tennessee\". Some shouted: \"What do we want?\" Chorus – \"Beer\". At 10 P.M. we fell in at the Town Hall and were marched back to the Wharf and ship.\n","12":" 14th:-\n\nShore leave again granted from 2 P.M. till 10 P.M. I had a ride in a rickshaw, and was robbed by the \nboy\n boy, who charged me 2\/6, for what, I afterwards earned, was a sixpenny ride. \nI had\n Took a tram trip \nride\n through the Berea, and found it a very fine suburb, containing many beautiful residential homes set in large allotments of land \nthe\nwhich were bounded by hedges instead of \nwooden\n fences. Durban has a fair harbour, and at present it is congested with troopships, some bound for India, others for England. I was told the population numbers 35,000; I think it is larger than that. The railway gauge is 3 ft 6 inches. The Press is distinctly provincial. The political parties are Nationalists and Unionists, the former being principally the disaffected Dutch element. Bilingual speech exists officially, Dutch and English being in general use, and which should be dominant was, at the time of my visit, a subject of keen controversy. The population is a mixture of English, French, Kaffirs, Dutch, Mohommedans, and Indians. The Town was very busy, and full of Soldiers, Imperial,\n\nSouth Africans, and about 1600 Australians. Yesterday 4000 Tommies left in a big transport for India. French sailors also came ashore from a French warship at anchor in the Harbour. This afternoon I saw two waggons drawn by mules, and crowded with British Jack Tars who sang and acted in the gayest manner, as they passed through the Town. Truly cosmopolitan was the gathering of Defence Forces. of the Allies.\n","13":" 16th:-\n\nAt Sea again. Weather very dirty; waves mountainous. Australian soldiers are not \nat all\n really appreciated in Durban. Two Australian Transports came into this port with about 2,300 men, or more perhaps. None came to meet us at the wharf, and on our going away, only a handfull of people bade us farewell. But the Transport that left for India with 4000 Tommies received a splendid send off from a large number of people. A lot of spurious stories are told about us, stories designed to misrepresent the behaviour of Australians in Durban. I heard it stated by a citizen that some Australians had raped a woman. We really were treated as outcasts by the majority of the white population; the only friendly people were the blacks and the tradesmen, and both sought to \"take us down\" by charging extravagant prices; \nI had a\n A piece of grilled steak with a cup of tea and bread and butter - \nprice\n 3\/6! People watched us march from the wharf to the\n\nTown Hall, but only women and children showed a feeble tendency to welcome us. One house displayed an Australian flag, which caused the boys to cheer their own National Banner – when nobody else would. Reports of the Troops’s misbehaviour in Cape Town were sedulously disseminated in Durban, reports most slanderous and most detrimental to the good name of Australian Soldiers. I frequently heard a very gross charge* made against some Australians (by a man in the city Fruit markets, (and by numerous other citizens. \n)\n Many of us felt wildly indignant about it. Some days before we arrived at Durban, a copy of verses+ was circulated on the ship; apparently these verses were composed to vindicate our character. They were \"written by a South African lady after hearing a wealthy merchant speak disparagingly of Australians\". The following is a characteristic stanza: -\n\n\"O God could we show these misers\n\nThe path that the Anzacs went!\n\nCould they rest in their beds at night time?\n\nOr live in their damned Content?\n\nCould they talk with a sneer of Australians\n\nWhen one or two get drunk?\n\nI’d rather a drunk Australian\n\nThan a wealthy Durban funk,\"\n\n* It is better to leave my note of this matter untranscribed.\n\n+ There verses are published in no 4 issue of \"The Hevic\" – title, \"Australians\".\n\nProbably, some of this ill-feeling is due to the part Australians played in subduing the Boers in the South African War, and to the fact that the Dutch \nare\n still form a considerable section of the population. With the exception of a few notable instances coldness was manifested on every side neither men nor women wanted us; and even the \"Tommies\" left us severely alone. The hotels were all closed while we were in Durban; there was no drunkenness; and the batch of men I was with, behaved themselves in an exemplary manner. Nevertheless, I suppose wild stories will be told about us to the next lot of Australians who follow us. \nher\n The Hut, conducted by numbers of Durban ladies, the Wesley Hall, \nand\n the Naval and Military Institute, and the Y.M.C.A. were four places where we certainly did receive decent treatment. We also had the free use of trams barring the hour between 5P.M. and 6 P.M. This privilege we did appreciate, but in another way, it was well paid for, inasmuch as the soldiers spent large sums of money among the citizens, whose policy, \nit is the same in all cities\n was \"to take them down\" per medium of extortionate rates.\n","14":" 19th:-\n\nOff Table Bay. Pilot came aboard about 4.30 P.M. The \"Suevic\", followed by the troopship \"Beltana\", steamed into the Bay at sunset. Beautiful and peaceful was the scene. The glow of violet and gold suffusing the sky\n\nDuplicate. See note above.\n\nwas delicately reflected in the calm surface of the water which was flecked with numerous fishing craft. Hosts of sea gulls accompanied us into port, circling and screaming around the weather beaten Transport. Above us, in the distance, loomed that mighty mass of rock, Table Mountain, upon the top of which rested a white cloud. This very regular phenomenon is described as, \"the cloth is on the table.\". Anchors let go at 5.30 P.M.\n","15":" 20th:-\n\n\"Suevic\" at anchorage all this day. As I write a report is current that the ship will go alongside the wharf tomorrow morning. Troops keenly anxious for shore leave.\n","16":" 21st:-\n\nAfter breakfast ship left anchorage in midstream, and put into the Cape Town Docks. Leave granted. Troops formed up on the wharf, and marched in column of route to the Market Square in front of the Cape Town Town Hall. O\/C troops, Major P C Raper, annoyed the men by giving them a silly lecture in their own time. It was 2.30 P.M. at this moment, and leave had been granted officially as from 1 P.M. till 11 PM. Major Raper informed the men that the city was under Martial Law; that they must walk about in groups of ten, in charge of an N.C.O; and that, if any separated themselves from the groups, they would be caught by the \npicquet\n picket. That announcement irritated the troops, who gave way to hooting. The O’C’s remarks made the troops believe the people of Cape Town disliked them; that\n\nthey were afraid of them. The troops fell in on the same spot at 10 P.M. and marched back to the ship. While at tea in a cafe in Shortmarket St, I witnessed a dramatic scene. Time 6 P.M. As I sat down, I saw four Australians seated at a table in front of me, waiting to be served. Suddenly one of them stood up, stared, and deliberately walked down the dining room to an enclosure where waitresses were preparing viands for transfer to the tables. He walked up to a woman about 35 years of age, who, at the moment, was in the act of picking up some serviettes. The man continued to stare; the woman moved away in an awkward state of surprise. Next she rushed forward in a violent state of surprise, and threw her arms round the \"Swad’s\" neck.\" Oh, it is Willie!\" she cried, and then began to weep. \"My brother Willie from Australia\". She added in a broken voice. Collapse followed. It appeared from subsequent conversation that both parties had been unaware of each other’s whereabouts, and had not met for many years.\n\nJuly 22nd:-\n\nAttended a church parade in the Roman Catholic Cathedral, Cape Town. Today all ranks were ordered ashore, a very unusual thing. Some said it was to save rations, but very likely it true motive was to give the cooks and the crew a day ashore. The majority of the \n\nSoldiers were turned into the streets before luncheon hour without any pay to buy food, and had nothing during the day, but that which they might cadge from their cobbers, and what they could get at the Soldiers Rest House, where troops get a free snack. I was informed by a lady interested in that institution that about 5000 solders were fed this day, but she could not say how many were Australians.\n\nJuly 23rd:-\n\nShore leave. It would have been possible to let us ashore at 10. a m, but we did not leave the \"Suevic\" until 3 P M – two hours later than the prescribed hour at which leave started! The reason? Well, it had just dawned upon the Military that pay was due to the men, and pay was not available until after 1 P.M. Through a muddle of some sort, two (instead of one) payments had to be made before each man received the amount due to him. This delay made the men very angry. A number of them got drunk. The ship’s guard left their posts and also got drunk. By midnight there were only a few absentees. This day I found out that all the talk of the O\/C Troops concerning Martial Law in Cape Town was mere trash, or \"bluff\". His statements were incorrect. The only part of the Town under any kind of restriction, was the Dock area and native quarters. Many of the loyal ladies in Cape Town were\n\nexceedingly kind to us. The British Section of the population \nwere\n very generous indeed.\n\nJuly 24th:-\n\n\"Suevic\" returned to anchorage in midstream. Troops are furious. All leave did not amount to more than 30 hours. This afternoon I obtained some evidence of the drink traffic in Cape Town. During our leave all the hotels were closed, with the result that numbers of men resorted to methylated spirits, and \"Cape Smoke\". The consequence of this was that they wandered into the nigger’ quarters where they were properly \"doped\". \nThe piquet\n Some of the picket set on the native section of the city, were induced to accept cups of tea* from \nthe\n some black women, and they also were \"doped\" – the tea being drugged sent them to sleep, and men got through to the niggers, who offered to buy for the soldiers, all sorts of the vilest concoctions, ranging in price from","17":" to","18":" a bottle. In many cases these scoundrels disappeared with the money and never returned. The \"Cape Smoke\" is the vilest of all drinks. Sickly in flavour, strong in effect, it strikes desire in the strongest after three drinks of it. Private W.A. Anderson of the","19":" Reinforcements,","20":" Battalion, had a good skinful of the stuff. Here is his testimony: \"I got a bottle of the \"Smoke\" from a half cast cabman. It cost me 5\/-, and seemed to be a mixture of cheap wine and methylated spirits. On consuming it, I found the \n\n* This was a report current on the Transport.\n\nliquor very strong; it made me very drunk; and finally I was foaming at the mouth.\n","21":" 25th:-\n\nStill at the anchorage and likely to be for the next three days. Troops yearning for another day ashore, and very discontented. O\/C Troops becoming very unpopular. Two other Troopers in the Bay got their men ashore. We cannot even get a chance to buy a newspaper. We are cooped up like prisoners. Is a man to be punished for his patriotism? I here wish to record another imposition, which during the past week had stimulated the discontent. We are only allowed £ 2 for the voyage of 40 days, the officers £10. Before we were paid on","22":" inst; sixpence per man was levied for ship’s losses and breakages. We were told officially that this charge was made by order of the O\/C Troops, the announcement being made by Sergt. H. Johnson (20\/20) in the presence of Sergt H.J. Wells (also 20\/20) at 2 P M on the","23":" inst. Many of protested against this impost as, on principle, it was unfair to tax the man who was careful of his hammock, blankets, and table utensils. We were then told that all must pay; that those who refused would have their leave cut out, and the amount of the levy would be stopped from their pay. It also was hinted that those who would not pay up would be put on permanent fatigue. I heard at\n\nDurban that the men on another Australian Troopship were forced to \npay\n sign the acquittance roll for £ 1 \"1\"0 and accept \nonly\n £1, the other shilling being seized by the Military Authorities. \nfor\n The discontent re leave mentioned above, resulted in a number of representatives from troop decks A to F. forming themselves into a deputation to ask for more leave. The deputation was refused admission to Major Raper. This highly strung, super-cautious individual refused to hear the application, and when he appeared at the Concert this evening the boys counted him out. The little man was furious, but he had to take his gruel. The truth is he will not trust his men. As I write there is a row about missing hammocks, and it is within half an hour of \"Lights out\" Private Petersen (20\/20) has lost his hammock, and Private D. Begbie (20\/20) also is without one. Petersen has gone to the Quarter-master Sergeant, and returns with another hammock, & blankets, issued officially from the store. Petersen on examining the name on the hammock finds it had been taken from his own mess, and has his messmates name on it – Private D. Begbie! This is how some of the losses occur, to make good which a levy of sixpence per man is made.\n","24":" 26th:-\n\nThis morning a \npiquet\n picket was sent ashore to pick up a few stragglers. About 2 P M the \npicquet\n picket returned with them\n\nIn the process of search however two men of the \npicquet\n picket vanished It is humourous to watch how the methods of the Military perpetuate errors by a process of transfer. Corporal C A Corner* (20\/20) told me this evening that Commander English had been strongly in favour of giving the men leave yesterday, and that Major Raper was as strongly against that proposal. The men on Transports A20 and A27 were able to get some leave. I now hear it stated that we are being kept in the stream by order of the Port Authorities, but there are so many lies being told, and so much bluffing, that one does not know who really is to blame. Finished a page of thumb-nail sketches+ for publication in \"The Hevic\". Original has been sent ashore to have the block made.\n","25":" 27th:-\n\nPrivate J. Hickin died this morning. He belonged to the","26":" R’fts of the 57th Battalion, who were accommodated in \"A\" Deck for’ard. He died without medical attention. As usual, considerable difficulty was experienced in getting the attention of a medical officer, owing to the indifference of some N.C.O’s, many of whom are criminally lax in dealing with sick cases. Much of the blame in such cases fixes itself on Medical Officers, where as it is really due to the brutal indifference of N.C.O’s. At \"Reveille\" this man was in great pain; the making out of a \"special sick parade\" form was neglected. At breakfast time his hammock\n\n* This was the first man of our Reinforcements to be killed. He met his death on night patrol\n\n+ Appendix 3.\n\nwas still suspended, & then it was discovered that Hickin was dead. The body was removed on a stretcher, and placed on one of the Main hatches in a mass of filth, dirty wet canvas, and vegetables. Later on the body, wrapped in a Union Jack, was sent ashore* The men decided to make a Collection for Hickin’s widow+. The \"Suevic\" with the rest of the Convoy sailed at Midday. As I got down these notes, I can see mirrors flashing in the windows of many houses; evidently some folks are heliographing us a ‘farewell.\" H.M.A.S. Afric\na\n leads the convoy. It is rumoured that we might call at St Helena; if so, I intend to visit Napoleon’s prison at Longwood.\n","27":" 28th:-\n\nConvoy comprises the following ships: \"Suevic\", \"Beltana\", \"Hororata\", \"Borda\" and \"Balmoral Castle\". Escorting cruiser, H.M.S Afric\na\n. I inspected the \"clink\" today. Some call this place of incarceration the \"cooler\", others the \"Peter\"; but in military parlance it is called the Detention Room. The detention room was placed amidships, starboard side. It contained about five small cells each about 6 feet broad, 5 ½ feet long, and 7 ½ feet high. There were iron bars in the upper parts of the doors to these cells. Into one of these three men were jammed, in consequence of misconduct, and they had considerable difficulty in sleeping there at night. One man, Private W.H. Scott (20\/20) to my knowledge\n\n* See report \"The Hevic\" issue No. 8.\n\n+ It was reported officially at Sierra Leone that a sum of £ 60 had been collected for the Widow Hickin.\n\nwas almost suffocating for want of air. It was like a miniature Black Hole of Calcutta.\n","28":" 30th:-\n\nApproaching the Equator. Weather very hot. Last night it was stifling below on F Deck. Port holes are always closed to \nexclude\n keep in the electric light, which is turned on all night. Towards morning the atmosphere was heavily charged with Carbon. Most of us were sick, or had headaches. We cannot sleep on deck because it rains every night.\n","29":" 3rd:-\n\nPrivate Hatton, an old college mate of mine, mentioned that there had been a meeting of \"Returned Soldiers\" going back (to the war), and some of them had been asked, and had refused, to volunteer for garrison duty at Sierra Leone. I said I thought I would volunteer. When I went down to my troop deck, I mentioned what I had been told.\n","30":" 4th:-\n\nIt is the general talk of the deck this morning – the volunteer \"stunt\". By 8 a.m. Corporal Corner had been to see his O\/C about it. An hour later Privates Filchill and Ramage, both old chops, had applications ready. \nThe\n I, and others, volunteered. The Sergeants took our applications, and said the call for volunteers was \"dinkum oil\". At 3.30 P.M. the rumour had developed considerably. It was bruited about that 500 men for’ard had volunteered; that men used to a tropical climate\n\nwould get the preference. The next \"wire’ was that married men would be selected first, and then the next that only men under 30 would be in it; and the next again, that a 100 men only were wanted, At 8 PM the \"wire\" was that the fellows who would go into garrison at Sierra Leone would only get \"Tommy’s\" pay, one shilling per day! The next was that the O\/C of (20\/20) had told Corporal Bowles (20\/20) \nthat\n there had been a big rising of natives in Sierra Leone, and that we were wanted to assist in quelling it. The final story was the whole 6000 men in the Convoy would be landed, and that the Afric\na\n, the Cruiser escorting us, would bombard Freetown.\n","31":" 5th:-\n\nPrivate B Tesch (20\/20) came down, and said, the names had only been taken for Father Neptune who would duck them all when we were crosiing the line.\n","32":" 6th:-\n\nCrossed the line today, and ducked accordingly.*\n","33":" 9th:-\n\nOur Convoy, H M.S Afric\na\n, and \"Hororata\", \"Suevic\", \"Union Castle\", \"Beltana\", and \"Borda\", steamed into Sierra Leone Bay, about 10. am, being 13 days out from Cape Town. We were glad to see Shore. In the distance we saw high mountains rising from the shore, and as we get closer \nin\n discovered a lighthouse\n\n* Report of Neptune’s visit appears on page 2 last edition of \"The Hevic\".\n\non a point near the entrance. The tropical scenery was very fine, particularly the heavy foliaged trees, with bulging trunks, and the tall palm trees surmounted with their stars of greenery, which were clearly defined \non\n against a background of bright blue sky. Grassy plots on the shoreland appeared brilliantly green, shining through the darker hues of the other luxuriant growths. Big thatched huts, occupied by the Natives, and quaint in their architecture, peeped through the tree. In places, the high shore slipped gently to the \nbay’s\n bay edge, here and there revealing several little coves whose golden sand gleamed between the greenery of the hills and the calm blue, surface of the bay. Gradually the small settlement of Freetown came into view. Rather surprised I was at its smallness. Canoes, fragile things that seemed to float with the lightness of a matchbox, bobbed up and down on the wavelets in \na\n in a careless fashion. Marvellously skilful were their occupants; they impelled them with a paddle, \nwho\n the blades of which were diamond – Shaped, and accumulating water \nthey\n was scooped out with a wooden tray in place of a bal\ne\ning tin. The natives came about the ship selling fruit, but the troops were forbidden to purchase any, a wise order, as most of the fruit was swimming about in salt water at the\n\nbottoms of the Canoes, portion of which was brought into the craft by dipping niggers who got back into them after diving for sixpences and coppers. After dinner the Mess Orderlies threw down among the canoes* all refuse from the tables, mainly bits of meat bones, hitting some of the blacks across the head with them, and also bombarded them with potatoes. A few soldiers on the port side succeeded in enticing (some niggers, by pretence of buying fruit to come within range, and suddenly a huge rotten pumpkin was hurled at one of them. Just missing his head, it smashed with a splotch \nright\n in the bottom of his canoe. There were about 6000 troops in the Convoy, and all these men were kept aboard in sweltering weather. They did not get ashore by way of leave, or for a route march. That there would have been some difficulties was \nis\n certain, but some effort might have been made today, to give good conduct men and those who also had done extra work, the privilege of getting ashore. I was informed by the adjutant (Captain G.W Firman) that we would get a day off, but he later informed that the G.O.C, West Africa, would not allow the men ashore. \n","34":"\n August 10th:- The 10. a m parade is now on. The Troop deck officers make a statement about leave. Pen in hand\n\n* The natives scrambled like fowls for the bits & scraps which they ate ravenously\n\nI am waiting to take a shorthand note of the announcement. An officer reads out this special notice:-\n\n\"This notice is to be \"read \nand\n and carefully explained to the men by each Troop deck officer:- \"In accordance with instructions received from Military Headquarters, Sierra Leone, no shore leave can be granted to Warrant officers. Non Commissioned officers, or men. An account of the prevalence of a virulent form of malarial fever, a recent epidemic of smallpox (cries of \"oli’ and \n\"Do","35":" you get me, Steve’), and other tropical diseases, and the unclean state of the native population, it is highly desirable, in the interest of the health of the Troops, that they should not land. The Commanding Officer has permission from the G.O.C to allow each officer to land (loud dissent), and call on the Military Headquarters, and have lunch at the officers mess. A certain proportion of officers will be granted this privilege daily and must return to the ship by 5 PM. (sd) George W. Firman, Captain A.I.F. Adjutant Troopship A 29.\" This announcement was received with a good deal of dissatisfaction, and there were cries, \"Are the officers immune?\" Later in the day, a number of officers went down the gangway and had a trip ashore. The Major (O\/C Troops) himself went ashore. Sometime before 5 PM an officer* from\n\n* It was the adjutant of the Troopship \"B-\"\n\none of the other ships was brought by a launch on to the \"Suevic\" in an intoxicated condition, and was seen by nearly all the men. Later on the military officers on the \"Suevic\" allowed him to go on to a steam launch worked by two niggers. The men saw the spectacle of an officer, hustle down the gangway on to the launch, he being so drunk that he had to be held on by one of the black fellows. His brother officers on the \"Suevic\" showed no concern about the matter, and were directly responsible for this degrading spectacle. To add emphasis to this contemptible scene, the launch cruised round to several Transports to put the officer \nhim\n on his right ship, and I do not know if he ever arrived there, as it got dark before the launch delivered its charge to the proper ship. When the officers were leaving the \"Suevic\" for the shore the crowd sang out to them:- \"Look out for the fever\"; \"Don’t get Smallpox\"; \"Keep away from the girls\". Another item of complaint and irritation, was the forcing of men to strip stark naked and march up like cattle to the hose. This morning we were called out before \"Reveille\", and one man said to the Corporal in charge; \"Can’t you have the good manners to wait until \"Reveille\" goes before you order men out of bed?\" He was probably threatened with a crime for speaking in this way. Men who took\n\nshowers before 6 A.M were ordered to go up again under the hose – a senseless procedure, which it was impossible to explain. Some men of strong religious feeling and of a keen sense of modesty were greatly offended. An order was given to ensure this was carried out. The irritating tactics of the O\/C Troops \nwas\n were manifest in his cutting off the showers in the hot weather after \"Reveille\" & at 9 o’clock at night just before the men retired to rest. The men could get a good fall of water from the showers, but the hose could not supply a flow sufficient properly to sluice a man. All he could get was a splash of water in the face and the rest of it rolled from one man’s body on to another’s; for the men grouped up closely to try and get a few drops of water. This was the cause of much discontent, and of course the regulation was evaded by hundreds; only the honest men willing to \"play the game\" were forced under the hose. All this was due to the fact that one or two dirty men, who avoided water, were found, and so the whole of our deck F were treated as if all were as dirty as the\ny\n few X\n","36":" 11th:- It is found necessary to exempt the Mess orderlies from hosing. The deck sweepers cannot get enough water through \ntheir\n hose, and bath houses are\n\nare\n still switched off. The supply of water grows gradually less. In fact there is less water available than under the old system, and the humourous side of the business is that sea water only is used. Then why economise? The great majority now merely \njust\n wait for their ordinary face wash, so that today, the hosing scheme produced that which it was intended to avoid – that is, none bathed at all, or hardly anyone. Information was given out today that the natives of Sierra Leone are very filthy, and that Freetown \nwas\n is reeking with \ngonnorhoea\n gonorrhea. We were warned to avoid women at Durban, as it also was full of gonorrhea and black pox. We were also given a tremendous warning about venereal diseases in Cape Town. Many of us are now beginning to think that the British Empire is a place full of sinks of iniquities, and immortality. This Military talk gives men bad impressions of the civilizing influence of the Empire. But some incidents teach us the true significance of Imperialism of Britain. Travelling as I am, through seas where German submarines are lurking, or mines are sown, or mysterious raiders are manoeuv\ne\nring, I can appreciate the protection of the Union Jack. To make a friendly haven, there \nand\n to be met by the old flag on the pilot boat\ns\n by people of \nyour\none’s own race, \nand\n by harbours full of British \n\nwarships and merchantmen, makes one realise the extent and majesty of British Dominion This evening a crowd of soldiers gathered on the port side amidships. \"Retreat\" had just \nbeen\n sounded on the bugle. Day was fading fast. \nand\n Mist was falling on \nover\n the hills above Freetown. Lights was \njust\n beginning to twinkle from the portholes of 30 ships in the Bay. Two niggers, both about 21 years of age, one named Absalom, the other York, came on a coal barge to load coal on the \"Suevic\". However, they were refused a job because they would not agree to work tomorrow, Sunday. This information was known after tea, and the crowd collected round them. The two blacks were then standing on the boat deck, each in a capacious dirty shirt, which came half way down their legs. The crowd immediately sympathised with the niggers, and began to collect money to \nmake up\n compensate them for their loss. They \ngot\n induced the niggers to sing hymns, some singing out \"Give us ‘Stand up for Jesus, York’. These two men \ngot\n produced their hymn books, and sang several hymns in a good voice and rather musically. The crowd listened intently; this striking me as being particularly interesting, for Australians are \"rough joints\", use strong language, and are supposed to have very little religion. When the niggers had finished the\ny\n men clapped them vigorously. \"Give us a sermon, Tom,’ said someone. Meanwhile, the hat had been \n\ntaken round, and money was being handed up to be \nand\n put into their caps. \"Give us ‘Rock of Ages’\" was the next request. \"Rock of Ages’\"! cried one of the niggers, rolling his eyes and showing the whites. But just then the scene was rudely interrupted by a big buck nigger, dressed like a clown, \nwith a straw hat on\n. He had been covetously eyeing the collection money in the caps at the feet of the niggers. \"Look out for that big black bastard in the background there; he’s tryin’ to pinch the dough,\" exclaimed several. The big black looked shy and pretended he was only listening. Then the niggers resumed, and gave the lads a sermon. \"Gentlemen,\" said York, \"be true to your profession (This struck them right home). Let us fight to put on the \nReed\n Redeemer. He will help you and fight for you, for He is Almighty. When you are on the battlefield He will comfort and protect you. Put your trust in Him, and He will be true to you.\" This was greeted with loud cheers. As darkness was falling over the ship and Bay, Absalom called on the crowd to sing the National Anthem. They did it, all the men \nfalling\n coming to attention. Then Absalom called for three cheers for the King, he having also beaten time, as Conductor to the singing of \"God Save the King\". People say Australians are irreligious; but in\n\nthat crowd were all types of rough men who, seeing the sincerity of the niggers, gave them a most attentive hearing, and backed up their appreciation by gifts of money and cheers.\n","37":" 12th:- Left Sierra Leone at 11.30 am. Twelve ships steamed out of the Bay, the leading \nship\n one being H.M.S Afric\na\n. Three of them with the Afric\na\n went South; our Convoy of 8 went North. Just as our ship was about to sail, a blackfellow came alongside in a Canoe, and sold a monkey to one of the fellows on the Transport who paid him 6\/- for it. \nHe\n lowering the money down in a basket suspended by a \non\n string. The native tied the monkey in it by the arms. He was hauled on board. The ship was weighing anchor. Alas, the Adjutant ordered the man to throw the monkey overboard, and also put him into the \"clink\" for disobeying the Ship’s Order. The monkey on hitting water swam to the Canoe, and the nigger made off with the money and the monkey. That monkey had been sold a good many times, I think.\n","38":" 16th:- Read the following notice posted on the Troop deck notice Board: \"Submarine Guard. Special Ship’s Signal. It is notified for the information of all ranks that six blasts on the ship’s whistle is the signal that a submarine has been sighted.\n\nOn this signal being sounded all troops will move away from the ship’s rails to clear the way for the submarine firing party. No noise is to be made and all troops will act in a quiet \nway\n and orderly manner\".\n","39":" 17th:- This morning the Captain* gave an address in the well deck of the \"Suevic\" stating that we were approaching the \"Danger Zone\". \"All of you\", he said, \"must keep a keen look out for everything strange in the water, from a submarine to a sardine box. We will continue zigzagging about the seas as you see. We will be in England on Thursday next (Cheers). I am saturated with official secrecy; but I can tell you this, that all our cargo is for Liverpool, and it is probable we will land at Liverpool or Devonport, probably Liverpool.. Now, have you any questions to ask, boys?\" (\"When are we going to be paid?\" loud laughter) \"That is a question,\" replied the Captain, \"I cannot answer, as it is outside Naval Jurisdiction.\"\n","40":" 18th:- About a quarter to 5 this morning a Sergeant fell overboard; it was said by some he jumped over. When the officer came on his rounds, the \npicquet\n picket said:- \"a man went overboard about a quarter of an hour ago,\" The ship went on her way as if nothing \n\n* Commander English R.D R.N R.\n\nhad occurred. A sharp look out is now being kept for submarines by guards posted all over the ship. On the bridge soldiers and sailors \nkep\n keep a constant look out. Some have sea glasses, night glasses, and telescopes. A six inch gun in the stern of the \"Suevic\" is ready for firing at any time, a shell always being kept in it; and the gun crew sleep \nnear\n beside it. The ship goes along in the dark without a single light showing. There was a kit inspection today.\n","41":" 19th:- This is a portion of Troopship Order No 60 19\/8\/17, by Major P.C. Raper, O\/C Troops:- \"Pay Stoppage. Pay will be available at the Orderly Room at 9. a.m, ","42":"\n\nIt was discovered at the preliminary inspection of hammocks, blankets etc that about £ 150 worth of such stores are missing. In order to augment the initial levy* made to meet such a contingency, a stoppage of \n2\/\n one shilling per head will be made. Each man will, therefore, draw 19\/- but sign the Acquittance Roll for £ 1. All moneys thus collected will be handed to the ship’s Quarter master. In the event of the levy exceeding the value of deficiencies+ the surplus++ amount will be returned to the O\/C’s units on disembarkation.\n\n* Sixpence per man, collected at Cape Town.\n\n+ I subsequently learned \nthey\n it did.\n\n++ The surplus was not returned to the men. See page 34\n\nWith reference to the foregoing: the following extracts are published for the information of all:- King’s Regulations, para 1648 (extract) ‘An instance should not occur of troops leaving a ship without all proper charges for losses etc. having been adjusted’. \n\nInstructions for O\/C Troops on Transports (extract):- ‘All deficiencies of shipowners stores must be adjusted between O\/C Troops and the Master of the vessel before disembarkation (vide Articles 100 \"Instructions for the Masters of Transports\") as the Government \"does not accept any responsibility.\"\n\nAugust 20th:- The claim was made for 1\/- today. We were asked to sign for £ 1 and receive 19\/-. I objected to accept my pay, and was placed under open arrest for disobeying an order of the O\/C Troops. It was represented to me that this was a serious breach of Kings Regulations, that the penalty of my action was death*. I and two others+ refused on the ground that there was no liability; - that the stoppage of pay was illegal; no liability because I had not lost my articles issued; illegal for the reason that I did not sign for any of the articles, and also because I was being compelled to agree to a false entry in my pay book. I protested against the charge and appealed under para 1649, Kings Regulations. I accepted the 19\/- under protest, and was released from arrest.\n\n* Mere bluff \nto enforce the order\n\n+ Privates S. Mullan and W Pattemore (20\/20)\n","43":" 23rd:- Heard today that we are going to Liverpool. The sea in this part is said to be infested with German submarines, but we have not seen a periscope. Eight torpedo boat destroyers are cruising round the convoy. \nThe\n Sea is very rough.\n\nAugust 26th:- Up at 4 \nam\n o’clock this morning. Entered the Mersey at 8 a.m. We disembarked at the Liverpool Dock Railway Station, at 10. a m, and entrained for Salisbury Plainat 11 a.m. Before leaving the docks, I had a last look at the \nold\n trusty Transports which had borne us ","44":" bravely\n safely through the perils of three oceans. The voyage from Melbourne lasted 66 days.\n\nEnd of Part 1\n\n1917\n\nIn England. Part II\n","45":" 27th:- At Rollestone Camp Salisbury Plain. Left Liverpool by rail for this place at noon yesterday, and en route received many demonstrations of welcome, especially from women and girls. Hardly an \nelligible\n eligible civilian \nman\n could be seen in any of the cities through which we passed – Wolverhampton, Warwick, Stafford, Birmingham, Oxford, and Basingstoke at Birmingham troops rushed the refreshments rooms seeking a glass or two of liquor they* not having tasted any for nine weeks. They waved above their heads Commonwealth pound and ten shilling note in their anxiety to pay for a drink. Only three \nmen\n women were serving; they became very excited muddled the change, and refused to accept the Australian silver tended in payment. We detrained at the little town of Amesbury at 7 P.M. \nlast night. (Sunday night).\n It was raining heavily when we started to march through the town. After a tramp of seven miles in full equipment \nand\n with pack up, we arrived at the","46":" Training Battalion encampment, situated about two miles from Stonehenge. No arrangements had been made to receive us; we were not expected. We were huddled into some huts, got a couple of blankets per man, a drop of cold tea, and a bit of stew. We then went to sleep under wet clothes at midnight.\n\n* most of them; there were a few who had, they being friends of the crew and \"in the know\".\n","47":" 28th:- Commenced drilling today. We are to be drilled 8 hours a day for three or four months. It does not get dark till 10 P M. After tea I spent the delicious summer evening at the ancient village of Shrewton. I looked at the \nvillage\n church, and saw among the tablets in the halls, one perpetuating the memory of someone who had died in South Australia. A feature of the village is the ancient \"cage\", or town lock-up. Many of us were interested in this survival of a bygone age. Myself, with a few companions, went into \"The Plume of Feathers\" and drank a glass of beer therein. We then strolled homeward, or campward, to be more correct, through one of \"the green lanes of England\", full of happiness and thoroughly enjoying the mystic gloaming of a pleasant \nsummer\n evening.\n","48":" 19th:- Motored to Salisbury with three Sergeants of the","49":" Battalion. On the way I passed the ruins of old Sarum, and later, across the fields I caught a glimpse of the delicately tapered steeple of Salisbury Cathedral. In ten minutes time we were speeding through the old city. Our car was dismissed at \"the Haunch of Venison Inn\", where we had a glass of wine, and then separated, they to meet some friends, \nand\n I to wend my way to the Cathedral. Passing into the close I crossed the green and entered the Cathedral. My great grandfather* who came to Australia with his family in 1834 was christened in\n\n* Distinguished at Eaton as a classical Scholar; father of the late F.C. Brewer, \"Veteran Australian Pressman\", who was the friend of Dr Badham, Dalley, & Sir James Martin, and author of \"The Drama & Music of New South Wales\".\n\nthis noble fare, and, therefore, there was an interest for me other than the beauty of the Architecture. The Cathedral was visited by many other Australian soldiers besides myself, & we were \nall\n pleased to see a big Australian flag hanging \nthe\n near the Chancel. I also saw some Canadians and New Zealanders strolling through the aisles; occasionally they halted in groups to read an epitaph, or study the tombs of ancient knights or Ecclesiastical dignitaries whose temporal and spiritual fame \nhad been\n associated with the Cathedral. At 3 o’clock there was a service, so I seated myself in an obscure pew as visitors were forbidden to walk about \nwhile\n during devotions; for the clatter of footwear on the stone floor causes \nan\n irritating echoes. My thoughts at this moment cent\ne\nred on the realization of an ambition I had entertained and cherished from my earliest years – to wander through the \"storied temples of old England. I had accomplished it! Overmastered by the secret joy of satisfaction, I had forgotten all about the service, until a few organ notes sounded from the \nChancel\n choir. There a voice within me said: \"yes, you are here at last –\n\n\"Where through the long-drawn aisle and fretted vault\n\nThe pealing Anthem swells the note of praise.\"*\n\nAt the end of the service I wandered through the beautiful cloisters, and then stepped into the Chapters House, a rare expression of human genius. Combining geometrical skill and architectural beauty in a \n\n* Gray\n\nharmony that recalled the just observation of Ruskin: \"In mediaeval art, thought is the first thing, execution the second.\" Coming back from this section of the building I made my way to the organ loft and there looked up at the spot where the imagination of Charles Dickens pictured Tom Pinch, the pupil of Pecksniff \nthe architect,\n playing the organ. I left the city at 9 P M, returning to Camp in a motor bus full of drunken Australians, who were leaving with a draft for \nfrance\n France on the morrow.\n","50":" 9th:- Lieutenant Brice O\/C 20\/20 informed the men that Major P. C. Raper had informed him that each man would be refunded sixpence* of the amount","51":" collected on the \"Suevic\" for breakages, losses etc. Afterwards I was paraded by a Sergeant, and asked Brice, if the Major had taken any notice of my appeal against the amount of \nmy\n assessment in connection with which I had been put under open arrest on","52":" August, with Privates Mullan and Pattemore. I was told by Brice that Major Raper had no information, and that the matter apparently was shelved. I said I would not like to express my opinion, and the matter then dropped. +\n","53":" 18th:- For the last week the food has been short, and and insufficiently cooked. At 1.30 P M\n\n* The sixpence never was returned to each man.\n\n+ Never to be mentioned again by Brice or Raper.\n\n50 men paraded, and complained that they had not received their full issue of food, and that the turnips were not sufficiently cooked. This day the food consisted of potatoes, boiled beef, and turnips. The complaint was made to the Orderly Corporal (Corporal Corner). He conveyed it to the Orderly officer of the day. Later the Orderly officer and Major Fitzgerald* came up, and the men turned out. As they were falling in, Fitzgerald was in a violent temper, and shouted: \"You’ll be bloody sorry for this. Where is the Battalion Orderly Sergeant?\" Orderly Corporal Corner replied: \"We have not got one.\" \"Where is the officer in charge?\" roared Fitzgerald. Corporal Corner answered: \"He has been posted on draft for France. I am the Orderly Corporal and am doing the work of the Orderly Sergeant.\" \"Well did you see the food – what was wrong with it.\" asked Fitzgerald. \"From my point of view,\" replied Corner, \"it was alright.\" Which, backing down on the Orderly Corporal’s part infuriated us, who were very hungry. \"What is your complaint?,\" screeched the Major, addressing No 1 of the front rank, a lad of 18 years named Private Schmilt who thereupon became very confused. Beside himself with anger this \"officer and gentleman\" went on abusing us thus:- \"You’ll be bloody sorry for this, all of you.\n\n* Second in Command of Battalion’s Reinforcements at Rollestone at the time\n\nWhat are you soldiers? Men at the front have had to do with two biscuits for 72 hours. You’ll be sorry for this. Dismiss the parade.\" When this irate Major was leaving the parade ground he exclaimed to the Orderly Officer: \"They got no change out of me.\" We were sorry, because we were very hungry, and our complaint was of non effect. We asked for bread and were given a stone plus abuse.\n","54":" 20th:- Took part in a review \ntoday\n this morning. Three brigades of Infantry reinforcements paraded on the green field behind the Rollestone encampment, the occasion being the presentations of decorations. We were reviewed at noon by General MacKay.\n","55":" 4th:- It is rumoured we are going to move from Rollestone to an encampment better protected from the winter winds. In a month or two we will have the cold weather on us. I am told there was \nwere\n an unusually large number of deaths from \npneu\n pneumonia at Rollestone last winter, and \nthat\n it is in the interests of the health of the troops that the removal to Fovant has been ordered.\n","56":" 11th:- Three Training Brigades left Rollestone for Fovant at 9. am. We marched 18 miles \nwe\n in full marching order, at midday we had accomplished half the Journey, and \n\nhalted in a field for dinner. At 2 P M march resumed. Travelled along the outskirts of Salisbury, and then we turned into a long avenue of oaks leading to Wilton. As we tramped through this long \naisle of\n leafy aisle the bands played lively airs. When the Column \nwound through\n entered Wilton the townsfolk rushed into the streets and cheered us. We pushed on to the village of Barford-St-Martins, thence to Herdcott, passing the Australian Convalescent camp there. Reached Fovant Camp at 5 P M.\n","57":" 15th:- Quite settled down in the new Camp. This Camp is \nquite\n close to the villages of Fovant, Dinton, Sutton Mandeville, and almost six miles from Tisbury, the seat of the Earls of Arundel.\n","58":" :- The Countess of Pembroke allowed me to view the interior of Wilton House, one of the most glorious homes in England. The steward conducted me. He explained in a most intelligent way all the interesting details concerning the antique statues and busts, the pictures and \nother\n the architecture of Wilton House, the site and surrounding lands of which \nwas\n were granted by Henry VIII to William Herbert* in 1542. Inigo Jones designed a large part of Wilton House, and the cloisters were\n\n* First Earl of Pembroke.\n\ncompleted by James Wyatt in 1807. (Wyatt, by the way, was my paternal grandfather’s uncle.) \"The Herbert Family\", from the brush of Van Dyck, is a magnificent Canvas, which is 11 feet high and 17 feet wide. This is the largest of the Artist’s known works, \nwa\n and was painted about 1633, £ 525 being paid for it originally. It is worth thousands today. It is hung in the \"double cube room\", which is full of \nmag\n beautiful portraits, including one of King Charles 1, and another of his queen Henrietta Maria, all nearly the work of Van Dyck. Upon the ceiling of this entrancing chamber is painted \"The Story of Perseus\" by Thomas de Critz which attracted the observant eye of John Evelyn in 1654 who, under date","59":" of that year, entered the following in his diary:- \"In the afternoon we went to Wilton, a fine house of ye Earle of Pembroke, in which ye most observable are ye dining-room in ye modern-built part towards ye garden, richly guilded and painted with story by de Creete.\" A case in this room contains a lock of Queen Elizabeth’s hair. I scrutinized this token of female vanity, and faded though this \nwhisp\n wisp of hair was, there still appeared a \nfaint\n tinge of the original colour. This little survival of the regal woman’s body interested me exceedingly. With it was\n\na piece of crinkled paper bearing an inscription part of which states: \"This lock of Queen Elizabeth’s owne hair was presented to Sir Philip Sidney by her Majesty’s owne faire hands.\" Near this unique relic, and in the same case, I saw a writing desk which had belonged to Napoleon; it was found in the Emperor’s carriage in the course of his retreat from Moscow. I spent a delightful hour in the Library where I saw many rare and priceless volumes. The great door of the Library opens on a charming prospect – \"the Italian garden\" at the far end of which can be seen a grotto within which is a statue of Shakespeare. The Bard of Avon was of the Company of James I when the Court visited the Earl of Pembroke in","60":" It was during the visit that Shakespeare performed his play of \"Twelfth Night\", and tradition points out the place, a lovely Sylvan scene, where the performance took place. For generations \nof\n the Kings of England have been entertained at Wilton House. On the occasion of my visit I saw King George’s second son; seeing I was an Australian the Prince gave me a very graceful bow. He is a typical English lad, about 19 years of age, and impressed me as having much more personality than the Prince of Wales. The much-detested Kaiser, Wilhelm II, stayed a day or so at Wilton House, when he last visited * England. The tree \nwhich\n he\n\n*","61":"\n\nplanted on that occasion still flourishes. According to the chatter of the Wilton townsfolk King Edward the VII and the Kaiser \"had a row in this House, concerning the prying propensities of some of the Kaiser’s staff. At present many wounded officers are entertained by the countess, and the beautiful grounds are open on Saturday and Sunday afternoons, so I was informed by the Steward, to all troops. I saw many Australians strolling across the lawns, others admiring the sculptures in the gardens, and a dozen or so lolling about the Palladian Bridge, smoking cigarettes or studying the antics of the finny tribe in the river Nadder* across which this beautiful structure was built in the year 1736.\n","62":" 25th:- My seven days disembarkation leave commenced today. With my friend Private Thomas Elrington, I left Dinton by train for London, and reached Waterloo Station at Midday. Am overjoyed at being my own master again. For five months past I have been under close military restraint in Camp in Sydney, on the Transport, and in Camp in England for two months. We had dinner at an hotel near Victoria St., & afterwards proceeded to the House of Commons which had just assembled \nat\n for the afternoon’s sitting. We interviewed a policeman, & the officials always\n\n* It flows through the grounds of Wilton House.\n\nready to facilitate the progress of Dominion troops took us in hand, and within a few minutes of our application, an official in evening dress, showed us to a prominent seat in the gallery near the grill. At the moment Lord Robert Cecil was discussing the defection of Russia. To see the mother of Parliaments in full action, \nand\n at a time when the European atmosphere was charged with lightning, together with the newness of the whole scene, was to me a majestic and imposing spectacle, and therefore, my ambition to behold it was realised in a measure for beyond which I had ever dreamed. I was burning with a desire to get into Westminster Abbey. I stayed an hour in the House of Commons, and then left, intending to make another and a longer visit. Crossing Parliament Square I made straight for the entrance of the Abbey. I encountered a shabby genteel gentleman who offered to be my guide for a small sum. I pushed him aside. The incident recalled Charles Lamb’s question when writing about the abbey: \"Is the being shown over \nthe\n a place the same as silently for ourselves detecting the genius of it?\" I surveyed this \"magazine of mortality\" alone. I contemplated for several hours the tombs of our noblest dead; I sat on a bench \nunder\n near the bust of Ben Johnson, for half an hour, listening to some musician sending forth a storm of sacred\n\nmelody from the ground organ. It was a solemn time for me. I ribbed my reverie with thoughts of the fearful ordeal through which our race was passing; yet I was not cast down. I felt the heart of the nation was sound; I knew the ancient spirit of service was not dead; for our great communities all over the world, \nare\n had proved true to those great standards of patriotism, which in life, many of the departed around me had helped to establish.\n","63":" 27th:- Arrived in Glasgow this morning. Elrington and I took rooms at the Blythswood Hotel, Argyle St. There are numbers of Australian soldiers in the streets of this city, and they moved about with that air of complacency which marks their demeanour in all places. As I jot down these notes in the writing room, the \nsnowfla\n snow storm in progress drives the flakes against the window panes. A bright fire looms in the grate; now I can understand why the ingle is so prominent a theme in British \npoet\n poetry. This afternoon I visited the art gallery, and the Clyde Bank. I like the folk in this city; they are much like Australians. They are hospitable and very kind.\n","64":" 29:- Returned to London this night. We left the transport at St Pancras Station, and proceeded to the Manchester Private hotel, Russell Square. Here we took rooms for the next few days.\n\nWe asked the landlady for a latchkey, and she replied: \"I will give you one, if you promise not to bring any woman home with you.\"\n","65":" 30th:- There was an air raid tonight. All the motor busses discharged their passengers, & made off to their garages. Restaurants closed \ntheir\n doors imprisoning those within. Motor cars dashed through the streets sounding the alarm. Soon the streets were deserted, the only pedestrians \nbeing\n seen being the imperturbable Aussies. Some pieces of shrapnel were falling \nabout\n rather unpleasantly close to ","66":"\n spots where I happened to be, and I saw one of our chaps dive under a pie stall for cover.\n","67":" 31st:- Returned to Camp today.\n","68":" 11th:- In Company with Private Ladensack (20\/20) I visited the \"little Grey Home\" Winton, the hostess of which is Miss Penruddock sister of \nthe\n squire Penruddock of Herdcott, who, a few years ago held the office of High Sheriff of Wiltshire. She is \na\n most refined, ladylike, and sensible, and about 50 years of age. All the Aussies are welcome to her home at any time. She writes letters to many of the mothers & wives of the lads when they leave the Camp, on draft for France, and being genuinely religious, she endeavors to remind them \nlads\n by \nthe\n gifts of post cards, calendars, and booklets,* that their spiritual welfare is her especial care. This lady\n\n* See appendix 4\n\ntold me she had been spending most of her income in this work, a considerable portion being absorbed in printing. Her visitors’ book is crammed with the addresses of Australian troops from all parts of the Commonwealth.\n","69":" 24th:- Visited the ruins of Wardour Casle, which was besieged by the Parliamentary Forces in May 1643, and defended for five days by Lady Blanche Arundel, who then surrended on condition of obtaining quarter for all that was in the castle. Some of the cannonballs used in the siege may still be seen among the ruins. Thousands of Australians have inspected this place; it was a favourite rendezvous on Sunday afternoons.\n","70":" 2nd:- Had supper this evening with the Rev Mr Audland, vicar of Dinton, and his wife. Received a very hearty welcome.\n","71":" 10th:- The subject of the Reinforcements Referendum was talked of by the Troops today, the matter being brought prominently \ninto\n to our notice by the circulation of \"All For Australia\",* and the posting about the Camp of a Proclamation+ The Troops at Fovant are not very interested in the Referendum.\n","72":" 16th:- Snowing all day, am sitting in my sleeping place in the hut. It is about 8 PM. Thirty men live in these huts, each man being provided with three bed boards, two trestles, a tick, and four blankets.\n\n* See Appendix 5\n\n+ Appendix 6\n\nThe huts are lighted with electricity, and are furnished with two large tables, and a stove set in the centre of the floor. It is amusing to watch how the men are crowding round the stove tonight. It is bitterly cold without. Some are making toast and tea, and others warming pints of beer brought round from the Canteen. A bayonet is used as a poker and axe, and an entrenching tool does the office of a shovel. Squeezed round the fire they talk fondly of far-off Aussie until \nthey are\n rudely disturbed by someone who leaves the hut door open. In rushed a \ncold\n blast of cold air, causing all to shiver, & some to shout; \"Do you come from Queensland?\"; \"Don’t let the horses out\".\n","73":" 22nd:- Left on leave for London at 4 a m, and reached Waterloo Station at midday. Took lodgings in Bloomsbury Square.\n","74":" 24th:- Christmas Eve. Thursday I visited St Albans, purposely to see the tomb of Lord Bacon in St Michael’s Church. I travelled down to this \nmost\n ancient \nof\n English cities by a motor bus \nwhich\n that \ntravelled\n journeyed through hedgerows and green fields, along highways that in past ages had resounded with the tramp of Roman legions. I left the bus at the Market Place, and strolling aimlessly along the narrow streets \nhighways found m\n of this city, found myself approaching the Abbey, I\n\nlooked in for awhile & then walked out into Fishpool St, up which I proceeded until I came to the gates of St Michael’s. I walked into the little church, and found a number of ladies decorating it with holly for the Christmas festivals. An elderly lady pointed ","75":"\n out the burial place of the wisest and brightest, and meanest of men. His monument is in the Chancel and represents the great philosopher \ndead\n in his chair, his head fallen backward, and suggesting that the mighty soul had just shed from its earthly home. The monument, executed in white marble, was set up shortly after his death by Sir Thomas Meauty’s \"Living his Attendant; Dead, his Admirer.\" Of all the figures in Literature, that of the unfortunate Chancellor \ninterested me most,\n is the most interesting to me. I felt gratified indeed on beholding the spot where his ashes were entombed. In the Afternoon I went to St Paul’s Cathedral, and surveyed the main parts of that building, including the crypt where I reverently stood before the tombs of Wellington and Nelson. I was shown round by a pale-faced withered old man, dressed in black, who flittered among the tombs like a ghost, and behaved so like one, that I expected every minute to see him vanish into the Sarcophagus. This spectre showed me a monument in the crypt, on which was depicted a profile in marble, and he exclaimed: \"Monument of William Bede Dalley, the Australian Statesman.\"\n\n* In the crypt inventory of departed mortality I read: \"72 William Bede Dalley. Dalley as Premier of N.S.W, upon the outbreak of the Egyptian War (1882), sent a regiment from the Colony to join our troops in Egypt as a substantial token of the child’s affection for the Motherland. This action has acquired a historic value as the first practical move in the direction of Imperial Federation.\" Cathedral Guide.\n","76":" 25th:- Christmas day. Weather dull & cold. In consequence of rationing, and the severity of the submarine Campaign against British Shipping, frugal dinners are the order of the day. Only breakfast being supplied at my lodgings, I found it necessary to search out a restaurant. Most of them were closed, but I eventually discovered one in Fleet St, known as \"The Press Café\". In the evening I visited the War Chest Club where a free dinner* was offered to \"all troops in uniform\". It was indeed very gratifying to behold the generosity displayed at this gathering; there was ample food for all, notwithstanding the stringency of supplies; in fact wherever Australian Money ++ is spent in the United Kingdom, a very favourable impression is made of \nthe people\n our people’s generosity, and the countries resources. A vast amount of useful information \nis\n prepared in pamphlet form+ \nand\n is distributed at the War Chest Club.\n","77":" 26th:- Took a turn in \nfleet Street\n Fleet St, this morning, my destination being the Temple. I passed through one of the old Gateways, and spent nearly two hours wandering \nthrough\n about this survival of ancient \nlo\n London, this spot teeming with historic interest, infinitely rich in Literary lore. I strolled through the Cloisters of Pump Court, along Crown Office Row, in the topmost room of No 2 Charles\n\n* See menu and programme, appendix 7.\n\n+ Appendix 8 is a sample\n\n++ Australia’s war expenditure was the highest of the British Dominions viz £ 291,000,000.\n","78":" 10th:- Lamb was born, his father then being a barrister’s clerk. I felt the pillows which Dr Johnson used to touch with superstitious regularity. In a northern corner of the Temple I saw the little graveyard where poor Goldsmith’s body was privately interred on Saturday evening,","79":" A stone, set up I learned, in 1860, is inscribed, \"Here lies Oliver Goldsmith.\" But it does not mark the actual spot where the poet was buried. I could not gain access to the Temple Church. What notes I could write of this place, if I \nhad\n but had the time?\n","80":" 27th:- Returned to Camp.\n\n1918\n","81":" 1st:- Posted to a school for a course of signaling.\n","82":" 14th:- Read the following \nreport\n in a Press report of a speech, made in the House of Commons by Sir Auckland Geddes, in which he said; the effort the British Nation made in the one item \"Pension of men for the Armed Forces of the Crown\" amounted to not less than 7,5000,000 men, and of these 4,530,000, or 60.4 % have been contributed by England; 620,000, or 3.7 % by Wales; 1700,000, or 2.3 &percent by Ireland; 900,000 or 12 % by the Dominions and colonies; and 1,000,000 \nby India\n or 13.3 % by India and Dependencies.\n","83":" 16th:- This day I received a cable from my wife informing me of the birth of our first born – a daughter.\n","84":" 26th:- Am \"fed up\" with life in this camp. Existence is horribly monotonous. Always hungry; cannot get enough to eat, nor can keep myself warm. For the last few weeks the weather has been dull, snowy, and windy. Am anxious to get on draft for France.\n","85":" 22nd:- am still here in Fovant. Have secured a few days leave, and leave for Bristol and Bath tomorrow. Both cities are favourite places of resort for our troops.\n","86":" 23rd:- Reached Bristol this morning, and took lodgings in City Road. The luxury of a bed is indeed a thing to be appreciated! Was much impressed with Burke’s Statue, which is placed in a central part of the city.\n","87":" 25th:- visited Bath today, the chief object thereof being to locate the church in which the remains of Governor Phillip had been deposited. Unfortunately I could not remember the name of the church, so spent most of the day examining the walls of various churches, looking through the churchyards, and devoted two hours \nto\n scanning epitaphs in the Bath Abbey, and to no purpose, for devil a word could I find about the old Admiral. Left for Bristol at 5 PM.\n","88":" 26th:- Took a train ride to Filton, afterwards paying a visit to the Art Gallery there seeing a beautiful miniature of Sir Joseph Banks\n\nIt resembled other pictures I had seen of Banks. I wondered if Mr J.H. Maiden, a great admirer of Banks, was aware of the existence of this gem. I think it should be acquired by the New South Wales Art Gallery. Went back to Camp this night. Stopped on the way to have tea at Salisbury.\n","89":" 18:- An examination for qualifications for First Class Army Signaller held today. Obtained 95 per cent of marks for theory, 100 percent each, reading lamp, flag, and disc, and 98 percent for reading the buzzer. This means a certificate.\n","90":" 19:- Some amusing things were written on the examination papers yesterday. In answer to one question a man wrote:- \"I dislike signaling, and, therefore, I want to go on draft – beer.\" In reply to a question in the electrical section \"What is a Conductor?\" another fellow wrote:- \"A Conductor is a person, male or female, who collects tickets on trams busses, and tubes.\"\n","91":" 25th:- Received the First Class Signallers’ certificate today.\n","92":" 29th:- Warned for draft. Passed medical and dental examinations. Went to Quartermaster’s store where I drew a steel helmet, and Shortages. Glad to be leaving England, as I am sick and tired of the regimental humbug that prevails in\n\nthis Camp. Military police dog us about to make sure \"we have chin straps down and puttees rolled properly.\"\n\nMay 5th:- Left Fovant tonight on draft for France. Had plenty of hot tea in my water bottle & some bread, and biscuits in my haversack. At 4.30 P.M. we paraded for inspection, and our friends came down to see us off \nwith\n offering all kinds of good wishes, and advice to \"keep your head\ns\n down.\" We moved off to the Railway station in full marching order, the camp band playing us a farewell tune. At Dinton Miss Penruddock met me. The departure of a draft is always a gloomy affair, but for awhile the gloom was dispelled by the cheerful manner and kind farewells this lady addressed to us. She went among us giving out postcards, and advising each boy to write home. Then she collected them for posting. At 6 P.M. the troop train left Dinton for an unknown destination.\n\nMay 6th:- At 3.30 am the troops were ordered out of the train. The place proved to be Shorncliffe. We were met by some guides with lanterns, and marched away in the darkness. An hour later we were lodged in our billets which proved to be an area of large mansions in \nthe town of\n Folkstone, \nwhich\n fenced off from the rest of the town. The rooms were unfurnished; we slept on the floor. Had a rasher\ns\n of bacon, a slice of bread, & a Dixie of tea at 7. am. At 2 PM we marched out of this rest camp, along the Marine Parade, thence to the wharf, and boarded the \npiquet\n boat for France. I go to the field\ns\n of death, calmly, confidently and hopefully.\n\nEnd of Part II\n\nMap 1\n","93":" Approximate German line from April 25 till","94":" (blue)\n\n2 Road from Corbie to Bray (shaded red) See Diary pages 120,121, & 122.\n","95":" Great long hill that stretches between the Avere and the Somme from Bray to Corbie (shade black). See Diary page 66 Dark shaded spot is \"Death Gully\". See Diary page 76\n","96":" Mt St Quentin. Captured by the","97":" Brigade A.I.F. on","98":" See Diary page 123.\n\nNote:- This is a map showing approximately the relative positions of some of the places mentioned in my Diary. Places coloured red are those in which I actually have been, and concerning which, there are many entries in my Diary. FJ Brewer\n\n1918\n\nIn France Part III.\n","99":" 6th:- At 4 P.M. the packet boat made ready for sea. \"Vindicator\" was the name of the vessel \nwhich was\n destined to carry me to France. She had on board a miscellaneous collection of British troops - \"Aussies\" and \"Jocks\", \"Tommies\" and \"Maoris\" – so that the crush \non board\n was fearfully uncomfortable. On the upper deck I noticed a number of ladies, principally nurses and \"Waacs\".* A look indicative of happiness I could not detect on any face; the general expression bespoke emotions of sadness. Most of those on board knew from dire experience, I suppose, to what they were returning. I confess the gloom rather depressed me, and my two comrades, Privates Schmilt and Stiff, \nwho have yet to learn the meaning of \"over there\".\n We were squeezed into a small corner near the engine room, and at the earliest opportunity disencumbered ourselves of \nour\n gas masks, \nhuge\n packs, and rifles; \npiling\n these we piled together on top of a huge cask. After the \"Vindicator\" left the wharf, we found ourselves immersed in a channel fog, which became denser and thicker as we proceeded; and this in no way helped to lift the prevailing depression, rather increased it in fact, especially when\n\n* \nW\nomens \nA\nuxiliary \nArmy\n \nC\norps; abbreviated, \"Waacs\".\n\nthe deep throated whistle thundered forth a series of hoarse and heavy blasts. From their repetition, I discovered the blasts formed messages in the Morse Code. Suddenly, a loud & terrific scream tore through the heavy fog, and I soon ascertained this was the siren of one of our invisible convoy of destroyers. Then another siren screeched, and another, and then several more, each becoming fainter. To the uninitiated this was but a tornado of discord rioting in the fog, but to me, & the others who knew, it was a concerted scheme of signals to go forward. So our boat heaved under the accelerated resolutions of her screw, and tore through the sea with the speed of a porpoise. This sea, infested with mines and enough submarines, might engulf us at any minute, and, therefore everybody expected, what in normal times, is described as ‘the unexpected\". Once we narrowly escaped disaster. We had traveled almost half the distance, when I was disturbed by a panic. I had been sleeping in a sitting posture, with my back against the big cask, when I was disturbed by shouting, and a stampede of New Zealand troops, who were making for the Companionways. On opening my eyes I saw through the hatchway, and looking through the fog, the iron walls of a big ship, moving in an \n\nopposite direction to us – she had nearly cut us in two. This appeared to be nothing very unusual, and things quickly became normal again. At 8 O’clock PM the \"Vindicator\" was alongside one of the quays of Boulogne, and we had disembarked while it was yet daylight; a short distance from the quay the troops were being assembled in proper order, a crowd of women, children, and old men looking on. I was surprised to hear a street urchin imitate, in excellent English, the bluster and Commands of our regimental Sergeant-Major. This imp next gave a marvelous example of his familiarity with the heaviest style of Australian swearing; he quite proved himself a formidable rival of the strongest tongue to be found in any of \nour\n big shearing shed\ns\n out back. A bagpipes band, composed of \"dinkum\" Scotsmen who had been wounded and were convalescing, came to welcome us with a skirl on the pipes, and played us from the waterside to the Railway station. By the time of our arrival at the station it was dusk. There was a lot of confusion \nwhen\n getting the troops entrained; we were huddled anyhow, and into carriages of the oldest type, \nand\n of course unlighted, this \nlatter\n being a precaution to escape observation from enemy aeroplanes.\n\nBefore the train started we were pestered by \nwithered\n old mesdames to buy oranges, cigarettes, and matches at ruinous prices. Some of the boys in the draft who had been here before, and who, therefore, were awake to the tactics of these female robbers roared:- \"Boukoo!\"* and \"Alley toot sweet!\"+ About ten O’clock the train crawled out of Boulogne. Half an hour later, I could just discern through the gathering gloom, that we were steaming along \nthe\n a low-lying sandy coast.\n","100":" 7th:- At 1 A.M. the train pulled up. Troops ordered out. Men wander about a maize of railway lines, some looking for their gear, others struggling to get it on, and many whistling or shouting in order to locate their mates. Eventually, all are ready. \"Quick March!\" is the order, and away we move in the darkness, through acres of huts and tents. Then comes the word \"halt\", and we learn we are in the New Zealand Base at Etaples. It is said the reason why we are going through the NZ Base, is because the Australian Base at Le Havre, is quarantined. Blankets are issued. Next we are allotted to bell tents in groups of ten. We try to sleep; but excitement, and over exertion, prevent some of us, and, as the Camp is now hushed, I hear for the first time, but very faintly, the ominous sounds of active artillery.\n\n* Beaucoup\n\n+ Allez tout de suite.\n","101":" 8th:- Draft marched \nmarched\n to the Etaples \"bull ring,\" a distance of four miles. There heard a lecture on gas. Subsequently put through gas chamber to test the soundness put through of masks. As we marched along the road leading to the ‘bull ring’, streams of refugees passed us. Driven from their humble homes, stripped of all they possessed, these sufferers present one of the most melancholy and pathetic sights human eyes can look upon. My blood boiled with indignation when I saw them in their despair, in their woe; and I became filled with the offensive spirit, with a fierce desire to do something quickly, to right the great moral and material wrongs done to the peasantry of Northern France. There was a procession, a mournful one indeed, of hooded wagons, moving slowly along the dusty road. A couple of famished old farm horses, usually grey ones, were yoked to each \nwaggon\n An aged man trudged beside each \nwaggon\n vehicle and guided the horses with a single strand of rope. A few sticks of furniture, together with some portable farming tools, and a truss or two of hay were packed into each of these \nvehicles\n wagons, and on the hay in each, cowered the women, old and young, and the little children, all with grief in their eyes, and sunk in the utmost depths of human misery. The Australian troops marched past the sufferers in silence. When we had negotiated another\n\nmile or so a still more terrible evidence of war met our gaze – a soldiers’ cemetery, comprising acres of ground covered with a forest of little wooden crosses, so close together indeed, that a sparrow could not fly between them without grazing its \nhis\n wings. And the earth was still gaping for more dead; for rows and rows of graves were dug, ready to receive new accessions to this humble necropolis of unknown heroes. Battalions of the best and bravest of our race are buried here, evidently these who had been mortally wounded at various times, and had suffered tortures ere death released them from their pangs; as there was a great military hospital close to the cemetery. At last upon this road, so fraught with the ignoble testimonies of war, \nI\n came a cheerful scene, the central figures of which were army nurses in white linen, spick and span, tending the wounded at the hospital; many of the beds \nbeing our\n and patients having been \nbeing\n put into the open air to be refreshed \nwith the\n in the sunshine. It is a holy sight to see these nurses \nbe\n at work, healing the maimed; scarce a fairer vision is recorded in the Book of Life. After tea this evening I walked down to Etaples, and later took a train ride to Paris Plage, a very\n\nbeautiful sea side resort. As I strolled along the beach I met a crowd of fisher women just from their boats, a very hardy type, and apparently as able bodied workers as men. Returned to camp about 10 PM, and found the place in a state of uproar. It appeared earlier in the evening the Military Police had interfered with a \"two-up school\" and had \"clinked\" the \"boxer\", or some other prominent official of the school. This caused a riot. Australians and New Zealanders in the hundreds stormed the guard room, next to which were situated the quarters of the Military Police. The armed guard and sentries on post, very sensibly withdrew and offered no resistence to the mob, which smashed its way into the detention room, and released \"all the birds in the clink\". Then petrol was thrown over the building, and matches applied to it. The structure, all wood, soon was a mass of flames, the glare of which attracted thousands of Imperial troops from the streets of Etaples, and the surrounding encampments. Not an officer, or a Military Policeman, could be seen anywhere; and the infuriated mob, many of whom were drunk, enlarged the scope of their work of destruction. They\n\n1918\n\ntore down all the canvas in the M.P’s quarters rifled their kits, divided their riding trousers, shirts, tunics, \"Tommy warmers\"* and other belongings; what was left they cast into the flames – rifles, tents, equipment and boots. At this stage bullets began to fly in all directions. Three \"Tommies\" were shot, one getting a bullet through the jaw. This was due to the explosion of 2000 rounds of ammunition stored in the burning guard room. \nAt\n by midnight the excitement had subsided.\n","102":" 9th:- Received 150 rounds of ammunition this morning. Later, draft again entrained, this time in cattle trucks, marked thus:- \"hommes 40\", or \"chevaux 10; hommes 20\". We passed through beautiful green country, and sometimes, as we approached a village, I saw little girls, dressed in white and wearing veils, walking through the fields to the village church. I then ascertained, by referring to my note book, that this day was Ascension Thursday. At Longpre the troops found a couple of casks of beer on a luggage train. Result, casks drained. At 4 P.M., detrained + and marched to the Divisional wing at Berthacourt. On arrival there, we found the place full of soldiers and estaminets, and nearly all the soldiers were in the estaminets\n\n* \nA\n Winter coats lined with wool worn by Imperial Troops.\n\n+ At a railway station named, Pernois.\n\nquaffing vin rouge and vin blanc, which I learned later in the evening, when trying a glass, was horribly sour and unmatured stuff; and \nevidently\n the avaricious Mesdames \nmadames\n \nevidently\n in their haste to keep up the supply had mixed the red & white wines in \none\n one cask; for the Aussies drink this stuff in the same quantities as they do Australian beer. Berthacourt is a dirty, narrow-streeted little town. A few shops were open; but nearly all the buildings \nare\n were used as billets. I saw several Aussies with large cart-wheeled shaped loves of bread under their arms. Being badly in want of bread I offered 2\/- for one. None would sell. The baker had sold out, so I had to be satisfied with Anzac waifers.* I was billeted in a farmyard among the fowls and ducks. My bed was a truss of straw underneath a farming wagon. Before I turned in, I \nthrew\n drew a bucket of water from the well, and using an old tin hat I found among the cobble stones as a basin, I had a good wash.\n","103":" 10th:- Had a hard fight to get some breakfast in this dog-hole of a place. Eventually succeeded. Ready and under arms at 9 AM. Shortly after that hour, heavily laden with pack ammunition, rifle, and\n\n* Tough and thick army biscuits.\n\niron rations, the draft started on its long march to the firing line, with the officer conducting \nthe draft\n it, at the head of the column. Silently we trudged along a broad white road, worn and gashed by heavy traffic, and liberal in its exhalations of dust. On the march the mind wanders on all manner of subjects, which mental occupation takes off considerably the fatiguing effects of ambulation. Strange scenes of home, and a variety of scenes, \nthat\n real or imaginary that have entered one’s \nyour\n experience, on a mental screen, until one is called back to earth by the commands: \"Halt!\" \"Fall out\", thus meaning another hour has elapsed, and the regulation spell of ten minutes has again become due. The troops then rush to the roadside, cast down their arms, loosen the equipment belts (round the abdomen) and sit with backs propped up by the packs, which act\ns\n as \na\n pillows. On this first heavy march I thought on the strange destiny that had brought us across so many miles of ocean, \nstill\n to follow\ning\n the iron trade of war, and plod","104":"\n wearily on, in the very terrain, where, 570 years ago, our ancestors did likewise; for it was in this very part of France, a thwart the read from Abbeyville. \nAm\n to Amiens, that the battle of Crecy was fought. At noon our Australian tanned boots were rattling\n\nthrough\n across the cobble stones of the half-deserted village of St Leger; most of the people in the place being French and Algerian troops, with a few old men and women \nevidently\n apparently the surviving wrecks of the local population. A kilo beyond this centre we halted for dinner - a few biscuits, some bully beef, and a draft from the water bottle. An hour later the march was resumed. We were now entering the outlying country of Amiens, flat, green, and of charming prospect, and crossed, and recrossed, with newly dug trenches, each system having its artwork of barbed wire. More \nweary\n tramping brought us to a hamlet named Vignacourt. It was now 4 PM. Being tired, and thirsty, and the possessor of a few francs – most of the others were \"stiff\" – I invited half a dozen chaps to \"the local pub\". On entering we \nfound\n met a couple of old \nmonsieurs\n men, and a withered madam. I paid for some beer, or rather \nsour\n vinegar; \nbut\n the lads enjoyed it. I then tried a bit of French on the Ancient madame saying:- \"Donnez-moi une tasse de thé, madame.\" I had no luck however; evidently the old girl had never heard of tea, or perhaps I was at fault as regards pronounciation, or the peculiarities of the\nir\n patois. Once more we took up \n\n* \nThe Australians pronounced this \"Mysowers\".\n\nand packs of rifles and, at the end of another two kilos, reached the \nstaging\n rest Camp. Stew and tea were issued at dusk, \nand\n I was disturbed several times at my humble meal by Chinese coolies, who came prowling about \nand\n begging us to sell them bully beef for one francs per tin. At 8 O’clock I rolled myself in my blanket, and went to sleep.\n","105":" 11th:- On the march again early this morning. Experiences similar to yesterday, Tramped through the village of Botangles at noon, and noticed about this \nplace\n neighbourhood, principally on the roadside, huge dumps of \"live\" shells. A kilo from this place, I entered, \"Forward area\"; this, I ascertained, from a notice board on the wayside stating:- \"Gas masks must be worn forward of this area.\" At midday there was another halt for dinner. My friend Private Stiff withdrew a tin of \"Maconachie\"* from his haversack, \nand\n this we warmed over a fire, \nand","106":" had a good midday meal. At 4.30, weary and footsore, we found ourselves giving through the towns of Querreau\nx\n and Pont Noyelles. These places were involved in \na\n clouds of dust, those being raised by long lines of motor lorries, wagons, ambulance cars, motor cars, limbers, horses, and mules. Crowds of Australian and Imperial soldiers\n\n* \"Maconachie\" was a preserved stew of cooked meat, \ngravy\n gravy, potatoes, and carrots. Extensively used at the Front; usually one tin to four men.\n\n \n\ngazed at us from the doors and windows of shattered houses, shops and estaminets. Their faces were hagged and careworn – they had just come out of the line for a rest. We thought this was our destination; \nbut\n it was not this, but \"the next village\", so we were told. On we went again with burning feet, quivering legs, and shoulders aching under \nwhat now seem\n the dead weights of pack rifle and ammunition, \nboth of\n all of which now seemed dry; our nostrils and eyes and ears were stuffed with the dust from the roads; and our faces, hats, and uniforms were turned white, because we were smothered in layers of pulverized earth. But on we went with a smooth swinging action, buoyed up by the hope that we were now doing the last Couple of Kilos. We reached St Gratien, a heap of mud, filth, and shattered houses, horse dung and flies being in possession of the streets. Down flopped the draft in front of a Chateau; Some of our officers went into it to seek the Town Mayor.* A few minutes later they came out, and the draft was ordered to \"Fall in\". The men struggled into their places, some disheartened, many angry, and all stiff and sore. On again we went, and again \"the next village\"\n\n* \n men of any rank were appointed\n The Town Mayors: \ntheir\n duties \nbeing\n principally were the care of billets, and the supervision of matters relating to accommodation for troops. They usually took up their quarters in \na\n deserted estaminets or \"epicerie\" shops, scrawling on the doors thereof in chalk, \"Town Mayor\".\n\nwas \nour\n the objective. By this time, and since morning, we had marched some 35 kilos, and \nwe\n were now called upon to scale a track up \nover\n a steep hill. On arrival at the top, another halt was made on the edge of a wood, and the conducting officer disappeared, he ordered us forward \nagain\n once more. We struggled up, and \nwere once more\n resumed the wearying \ntramp\n work. At length we struck a main road which led us into the village of Lahoussoye (Map Reference 62 NW, I 3, C 55) where we discovered Brigade Headquarters. The draft was then split up, the reinforcements for the","107":" 18th, 19th, and 20th* Battalions being dismissed to the \nbi\n billets assigned to each unit. \nWe were allo\n The 20th Reinforcements were allotted a cow shed. We stacked our kits here, and then went \nup\n to the cookers for a Dixie of tea. It was now 6 P.M. The cookers were situated in an orchard on the \nother end\n outskirts of the village. As I made my way thither, I had my first experience of shell fire. In a wheat field, two hundred yards away, shells were falling, and splashing the earth in all directions; but I was too tired to be very much startled. I got a drop of tea and sitting on a broken box, drank it; meanwhile, I watched the shells falling\n\n* These battalions formed the 5th Brigade of the 2nd Division of the A.I.F.\n\nin the wheatfield, and was not at all alarmed. After a diligent search I found two old women living next to a church, and from them I secured a couple of eggs, and a mug of milk. Three francs I paid for \nthe food\n these luxuries. So I had a good \ntea\n supper. Then to bed in the cow shed, a bit of straw for mattress, and great coat for blanket. I fell asleep, \nbut\n At midnight was awakened by the continuous roar of artillery.\n\nMay 12th:- Went to mass in the village church this morning. The Altar was smashed, and clerical vestments were scattered \non\n about the floor of the sanctuary. Spent the morning rummaging the bedrooms, kitchens, etc of deserted houses. In one house I unearthed a handsome pocket edition of \"Paul and Virginia\", and among the leaves, I found an old receipt and a lottery ticket.* At 4 P.M. the 20th Reinforcements left Lahoussoye to join the Battalion which was in the line. With a runner to guide us we crossed the wheatfield where I had seen the shells falling yesterday, and later struck a road leading through a hollow to Bonnay.+ Leaving this village \nbehind us\n we climbed the great long hill that stretches between the Ancre and the Somme, from Bray to Corbie.\n\n* See appendix 9. I lost the book.\n\n+ Map Reference, 62 NW, I 17, C 92.\n\nBatteries were camouflaged all about these parts, and the surrounding country was \"peppered\" with shell holes having a diameter of 20 feet and considerable depth. The guide led us through sunken roads, woods, and wheatfields with grain all tramped \nby\n down by infantry and batteries. At 5 o’clock we moved cautiously down to a re-entrant,* one side being fringed with Scrub and tall trees. Dead horses were lying in \nall about\n the vicinity of this gully, and the air was poisoned with the stench of putrifying horse flesh. In a steep slope of the re-entrant the whole battalion \nwas\n had dug in, so that along the hillside \nalong which\n extended three tiers of dugouts; and the chalky earth, excavated in a hurry, and thrown anywhere, gave the place the appearance of gigantic \nbed\n ant bed. I, with two comrades, Stiff and Schmilt, reported to Captain M. Moore, O\/C \"D\" Company, \nand\n I was allotted to 14 Platoon as a bomber, and \nso I\n was put into a small dug-out with two other bombers. The ordinary dug-out is an excavation in a slope, so that three walls are of earth; a strip or two of corrugated iron, or an old door, or boards, or tin, are arranged as a roof over these walls while the front is closed in, partly with earth, sandbags, or a curtain made of rages or bags. Into this kind of a hole I \nclimb\n crawled,\n\n* Military term, meaning \"valley or depression\".\n\nand introduced myself to the two \"diggers\" within. Being half asleep they \nwere\n seemed very cross \nat being di\n when I disturbed them, and they asked me, \"Where the b- hell\" I came from. \"From the same place as you, b-s.\" I replied, squeezing in, \nand lying down\n Inside this dugout were tins, some \ncontaining\n containing jam, and \nsome ch\n a collection of butter, cheese, meat bits of bread, and Tommy Cookers. It took me exactly a week to get from England to the line, and those events in my diary recorded from the 5th May to this day, illustrate the process described as, \"Joining your Battalion.\" In conversation with the men beside me in the dugout, I learned our position in the line was \"close reserves\", next above us being \"Supports\" , and next above \"supports\" being the very front line of trenches. While \nthe\n a Brigade is holding a front (they told me,) the component battalions usually move into these positions in rotation.\n","108":" 13th:- When darkness set in last night the whole of \"D\" Company was ordered to fall in, in battle order. Still very tired, weary, and sore, I thought I might have been exempted, \nbut\n duty, but down came the order, \"every available man wanted\". A Pick and shovel\ns\n then were distributed to each man who carried them on one shoulder, and his rifle on the other. arranged in single file\n\nwe moved up to the front line as a working party to dig a communication trench. We \nmoved\n trod cautiously across fields, hills, dales; most of the ground being broken by shellfire, holes, trenches, and battered roads, and encumbered with barbed-wire. Our 18 pounders were firing in a desultory fashion, and I heard the occasional growl of enemy artillery. This was my first night under regular gun fire: my feelings were those of curiosity and fear; but I was calm and master of myself, and, like most other men, did not allow myself to degenerate into what the boys, in their forcible language, call \"a windy bastard\". Most strange and weird appeared the lights and flares emitted from the enemy’s line. Trails of light streaked the sky, almost continuously and these streaks, \nburst\n on reaching their apexes, burst into bright stars of white light which, falling slowly back to earth, brilliantly illuminated the neighbourhood for five minutes at a time. Occasionally red flares shot through the sky, and sometimes a succession of lights, * resembling a string of beads, rose slowly skyward. Behind all these coruscations the piercing rays of German searchlights fidgeted about the clouds. The whole line in this sector was \nilluminated\n lighted like George Street, Sydney, on a Friday night.\n\n* I afterwards learned that the troops called these lights \"flying onions\", their purpose being a German signal indicating proximity of British aeroplanes.\n\nand gave me the impression that the Huns were very nervous. The glare cast by these lights was a sickly one indeed, \nand\n at times became so strong, that the file of men had to stand stock still frequently, \nfor fear of\n to avoid detection. The slightest movement might have revealed our presence to the keen eye of the enemy. Eventually, we halted beside a white tape, set down by the Engineers \nas the\n to mark the direction in which the trench had to be dug. Each man was ordered to dig a yard. The stretcher bearers fell out and teams of Lewis gunners were posted \nwent out\n on our flanks to guard against a surprise attack. Throwing off equipment and placing it, with my rifle, beside the tape, I commenced to dig. About midnight things began to liven up. A barrage of flares went up, and enemy machine guns opened \nup\n a continuous rat-tat-tat- \nthat\n on both flanks. Across the open country where we were digging the bullets whizzed & \"pinged\", as they trimmed the grass. I crouched \ndown\n in the hole I had dug, and when the fire slackened got to work again. Here I was introduced to the \"whizzybangs\", which burst about us at intervals; \"pineapple\" bombs that spat \nout a\n tails of fire in their wake; and \"Fritzes’ coal boxes\", a missile that bursts with a high explosive effect. I became weary,\n\nthirsty, and anxious to get the job over; but it was tough ground, and progress, therefore, slow. It was near 3 a.m.. on the morning of this date; and at that hour the machine guns became very active all round us, the staccato of which echoed with horrible emphasis through the ghostly surroundings. At last the arduous, nerve-racking job was finished, and just as dawn was breaking \ncomes\n the order came to retire; back to our gulley; and back \nto\n like rats to our holes in the hillside. At daylight the issue of rum came round. Such \nwas\n were my first experiences under fire. During the \nday I went down to\n morning visited a ruined village called, Vaux-sur-Somme, and drew some water for the company from a well on premises which once had been a shop. Slept most of the \nall\n day. This night resumed the digging of trenches under fire. Several men were wounded coming along a road which was being continually swept \nwith\n by machine guns. Sergeant \"Bull\" Pearce fell wounded in front of me as we raced \ndown\n across this road for cover.\n\nMay 21st:- In Hospital near Amiens. Recovering from effects of concussion. It is glorious to be able to sit in the Sun in peace and quietness. Today I read the celebrated \"Memoirs of the Comte de Grammont\". It was a unique pleasure to be able to lift my\n\neyes from the book and see around me the native country of the author, and in the distance the City of Amiens, crowned with its noble Cathedral, \"the Bible of Amiens\", as Ruskin called it. This day week,","109":" inst; the","110":" Battalion was severely \nmauled\n mauled by German batteries of 5.9 inch Howitzers. Enemy observers I-I Australians never will keep out of sight I-I detected our position, and a Hun plane was sent across at dawn on the 14th, and evidently ascertained the fact that troops were concealed there; for at 3 o’clock in the afternoon his five point nines had the range. The big shells feel thickly, salvo after salvo following in quick succession. They hit the earth with \nterrible\n heavy concussions, and burst with terrific crashes. The crown of the hill was being torn and gashed, \nand\n indeed a veritable dust storm was churned up with the smoke and fumes of the bursting shells. The fringe of trees on the other side of the gully was bang chopped up like matchwood. So fierce became the bombardment, that all the troops wormed themselves into the dugouts. For two long hours, which seemed years, the gully proved tan \nveritable\n inferno and shook as in the throes of an earthquake. The grunting of the heavy German batteries\n\nbecame more frequent and rigorous, and the gully was thoroughly searched by showers of flying iron. Several men, in a state of panic, rushed from their dugouts. These were quickly wounded, stretcher bearers came forward calmly through the storm and bore the \nmen\n wounded away to the Regimental Aid Post at Vaux-sur-Somme. A few minutes later a Sergeant who happened to be standing at the door of his dugout was cut in two by a splinter. It was a ghastly sight to look at his \ndisfigured\nmangled body. The bowels were strewn round the ground, and the dinner, which he had eaten an hour before, was ejected from the abdomen and scattered about the spot where he was \nwounded\n killed. Another N.C.O. some minutes later was (mortally) wounded, together with several privates. So pleased were some of the wounded to have \"got a Blighty\" that they could be seen laughing on the stretchers as they were being continued unabated. I, with others, had to leave the dugouts as they became untenable. Shells were bursting right over us, \nour heads\n the concussion throwing us \nright\n off the ground continuously, while the heavy pieces that whizzed past, \nus\n sent down a breeze \non us\n like blasts from a blacksmith’s bellows. At 5 o’clock the Artillery activity ceased, \nand\n It was then ascertained \ntht\n one man had been killed, \none\n\none mortally wounded, and seventeen wounded. Two hours later, I was seized with a numbness down the left side, lost the use of my arm, and almost the use of the left leg. Altogether 50 men were evacuated. The medical officer said I had been \"shaken up\", and sent me out for a week’s rest at the Transport lines. I was carried out on an ammunition limber, which rumbled slowly through a \ndark\n field en route to \nLa Heussoye\n Lahoussoye. On the way up I saw & heard evidences of Hun ‘plane busy bombing \nour\n battery positions. The Hun used to drop \na\nbrilliant flares from his machine; these would fall half way to earth, and then became as fixed balls of light, and \nburned on\n hung in the air for a quarter of an hour, thus illuminating a large area of the country beneath. I was jolted severely in the limber, which approached the outskirts of \nLa H\n Lahoussoye about 10. PM, and the first thing I saw, on entering the village, was a huge iron crucifix that loomed up strangely in the darkness. On arrival I was put into a barn and fell asleep on the straw \nwhere\n until \nI was\n disturbed by a Hun plane dropping bombs on the village. The explosions made the night hideous, & \nkept\n frequently cast lumps of dirt and debris upon the roof of \nthe barn\n my shelter. On the","111":" inst I was sent on to \nthe\n hospital where I \nmade\n am at this date.\n","112":" 24th:- Discharged* from hospital today, and left in company with a private of the","113":" Battalion in search of our respective \nBattalions\n units. Night coming on we found shelter in a deserted barn.\n","114":" 25:- Resumed our journey at 9. a.m. on foot. Reached Querrieau two hours later. Ghastly sight encountered on the cross roads where a heavy shell had fallen killing and \nwou\n wounding 60 men who had been sleeping in the adjacent houses. On one side of the road the dead, including several Australians, were piled up in a bloody mass, flesh, blood, and khaki being rolled into a pulp. Limbs were mangled, heads broken open, and faces compressed and crinkled and resembling pieces of crumpled, blood stained paper. Heaps of timber, plaster, and bricks blocked up the roadway leading into QUERRIEAU, and the telegraph wires, having been snapped, or reefed from their moorings, hung in a straggling fashion, and curled about the ground, as if they had been the \ncobwebs\n webwork of a huge monster responsible for the death and havoc around us. We went on our way in a mood of \nwretchedness\n indescribable wretchedness. Reached transport lines at dusk.\n","115":" 26th:- Went into the line again today going up with the ration limbers. On the way I noticed the roadways in\n\n* The discharge chit, and label, which was attached to my kit, form appendix 10\n\nexposed parts were fringed with hempen netting, a cunning artifice to camouflage the traffic, and baffle observers in the Fritz balloons.\n","116":" 27th:- With the battalion in close reserves. The gully in which we are ensconced is subjected to enemy shell fire at regular intervals. My dug out & the one next to mine, had been blown to pieces in my absence, and two of my comrades who had been sleeping in the latter were killed. A 5.9 fell right into their hole. Both were killed instantly; the bodies much mutilated. Their names were Methman and Petersen, and both lads came away from Australia with me. I was also apprised of the death of another of my reinforcement, Joe Murphy, who was on leave with me in London at Christmas. An aerial bomb fell in the gully. Roused by the explosion poor Murphy rose to a sitting position to look through the door of his dugout, but he fell back, exclaimed \"oh\", and was dead. A splinter of the bomb had pierced his heart. I am now well used to the sight of blood and slaughter; but death of comrades affects ","117":"\n one terribly. So severe have the casualties been in this position, that it is now known among us as, \"Death Gully\". Went stone deaf tonight: water running from my ears. Sent to R A P for treatment. Got into Bonnay at dusk. Bridge Guard happened to be\n\nmen of my own Battalion. Their quarters were in a deserted house on the bank of the Ancre, just adjacent to the bridge, on the other side of which, stood the village church.\n","118":" 28th:- Slept last night in the sitting room of the deserted home. One of the guard brought in some fine fish for breakfast. What a luxury! He had thrown a couple of hand grenades into the river, and \"the catch\" had floated up after the explosion. In this place we used all the plates and teacups found in the kitchen. Rudely disturbed at dinner. Fritz began to drop some 4.2 stuff into the village. Three shells fell within a few yards of the walls of our house. A fourth cut the roof \noff\n out and fell into the stream a dozen yards away. Fortunately the other shells passed over our heads. Reached La houssoye at 6 P.M finding the village deserted, as it was now within the range of Fritz’s high velocity guns* and was regularly bombed at night by hostile aircraft. Slept in the trenches outside Lahoussoye.\n","119":" 29th:- camped in a wood with other sick men. Attended by artillery medical officer (Major Chisholm Ross). Ears very bad, nerves shattered. Cannot sleep tonight Enemy planes busy bombing the whole of the countryside.\n\n* The troops called this gun \"rubber guts\"; the shell \"plonked\" in its target before the report of the explosion could be heard, emitting in transit a sharp weird scream\n","120":" 31st:- Eight men, some sick, some wounded, are camped in one tent. I am one of the eight. Besides the horses, and transport wagons and hospital, there are Engineers and Artillery units camouflaged in this wood. About 3 \nA.M.\n P.M. had a stroll, and received a pleasant surprise; I met Chaplain Captain Sydes who, when I had last seen him, was a Jesuit Priest stationed at North Sydney. Going into his tent I had a very agreeable conversation about dear old Aussie. I also mentioned that the issue of rum was always very irregular, and varying in strength, whereupon he improvised a few lines to the lilt of \"Three Blind Mice\", to give \na\n pointed emphasis to the privates \"cut\" of the much desired spirit:-\n\n\"Three Jars of rum;\n\nTwo\n for the officers\n\nAnd \none\n for the Sergeants –\n\nThree Jars of Rum.\"\n","121":" :- Tonight several German aeroplanes are hovering above this wood. I can quickly detect them now by the peculiar hum of their engines. They give off \na\n sounds, but of course greatly magnified, like the buzzing of bees. It is quite distinct from the sound of the British planes. Whenever they come about this neighbourhood, three blasts* are blown on a whistle signifying: \"Taub up; lights\n\n* This was a signal common to all units of the Army, I believe.\n\nout.\" Lamps and fires were quickly quenched; \nand\n cigarettes were lighted with the utmost caution. When enemy aircraft are buzzing about at night - the sensation is that each machine is hanging exactly over one’s head like the sword of Damocles. When \nthe\n a Fritz planes\ns\n drops a bomb, or as the boys phrase it, \"lays an egg\", it whistles shrilly in descent, burst with a most \nviscious\n vicious crack, and makes the earth tremble. About an hour ago, half a dozen of these infernal machines fell out of the sky and burst on the outskirts of the wood. Cannot sleep.\n","122":" :- Arm still weak, and hearing yet very defective. This afternoon I crawled along some trenches leading to an adjacent wood which I found to be full of tanks very cunningly camouflaged, the camouflage used being wire netting tabbed with coarse greencloth. Some bushes also were employed in concealing this stable of \"mechanical cavalry\". Some of the iron horses appeared in coats of paints strangely applied, and varying in colour, this being one of the tricks of the modern art of camouflage. Overseas ships are treated in the same manner. These tanks were the very latest type\ns\n and combined the strength of the tortoise, with \nand\n almost the speed of the hare.\n","123":" :- All hands seem better today. The Battalion band, camped \nnearby\n close by us, came out to practice this\n\nmorning. It was very pleasant to hear the music; indeed, the scene for the moment caused me to reflect upon the ever-changing nature of my experience. Here \nwe all are\n I am sitting among the trees listening to an Australian band playing merrily on the soil of France, and only a few kilos away is the front line where Death is always busy.\n","124":" :- Am able to assist the medical staff today. In the evening many yarns were told concerning leave experiences in London. We were \nsitting\n having supper in the tent when the yarns \nwhere\n were going round. Private H- told the following, which I here \nwish to\n record, as a sample of the average experience. I tell it as it was told. Private H- of course prefaced the narration by saying that he had \"gone A.W.L.\"*, was dodging the \"Jacks\"+, by \"knocking about in a \ncivil\n civil clobber\". With Private H- was another Australian also \"adrift\", and simulating a civilian. \"Well,\" said H-, \"the both of us went into a booser.\" It was crowded. I saw two seats vacant at a table where an officer and a girl sat. The latter encouraged conversation, so I asked her to have a drink. The officer, who was wearing kilts, seemed a bit nasty about this. I asked him to have a drink too, but kilties said, \"No\" I called for three drinks, and the girl took hers. Then\n\n* Absent without leave.\n\n+ So\nu\nbriquet applied to Military Police\n\nwe had three more. I next said: \"we are going now.\" The officer replied: \"You ought to be in the Army.\" My friend here chipped in saying: \"I object to you insulting my friend; he is here at my invitation\", and he smacked the officer a beauty on the point. Then a fight started. The crowd became excited, and rose up to see the stouch. My coat was torn in the scuffle, during which \nand I\n somebody had gone through my pockets, and had robbed me – tealeaved me of all my dough. Eventually, we got out of the booser, the girl coming with us. My cobber left me. I stayed with the girl for awhile, and suddenly she slipped a £ 5 note into my hand. At her request, I promised to meet \nhere\n her the following night, but, in the meantime, I picked up another tabby and spent some of the other girl’s money on her. This one took me to a club in Leicester Square. She put 2\/- through a wicket gate, whispered and brought me a piece of ribbon to show that I had been elected a member \nfor\n of the club* for the whole day. Had drinks and dancing galore – drinks","125":" each. \nBut\n I did not go to meet the other girl, who had given me the five pounds, on the strength of which, I was doing the financing. But she came into this very club, and spotted me with the other girl. Then she \ndisappeared\n quickly disappeared. A minute or so afterwards, a waiter came to me, and said: \"A lady wants to see you down stairs. You better come; it’s very important.\" Leaving\n\n* These clubs were established as a rendezvous for women of shady character and for the purpose of selling liquor at all hours.\n\nthe other girl, I went down to her. She there had a policeman (civil), and charged me with being a deserter. I said to the policeman that I had only been three days A.W.L. I am only enjoying myself, I said; \"Can’t a fellow do that here?\" Then I slipped half a dollar into the cop’s hand, and mizzled down a stairway, leaving the two \"Tabbies\" abusing each other.\n","126":" 7th:- Private M- arrived here today sick, and under open arrest, he having been picked up in London where he had been \"adrift\" for a month or more. He told me \nthat\n he and his \"cobber\" Private W- had gone on fourteen days leave* to England. They were well \"walletted\", having £ 350 between them the major portion of which had been amassed at the \"two-up\" schools. They took fashionable rooms in the Morley Hotel, one of the swell establishments in London. The £ 350 was spent in royal style, and both \"diggers\" slept in silk pyjamas: expensive wines were liberally consumed, while porters, waiters, and \"the boots\" were tipped into a state of absolute subserviency. On one occasion these two fellows happened to be going up in the lifts to bed somewhere about 2 a.m., when they encountered several Yank officers, one of them, a Major, said: \"You boys having a good time. – I feel a bit thirsty myself.\" This led to an invitation to the Aussie’s apartments, and there was an \"all night sitting\".\n\n* Appendix 11 is a sample of the pass given to a soldier in the A.I.F. going on leave from France to England. I \npurchased\n obtained it from the holder as a souvenir. Note the stamping.\n","127":" :- At dusk some American troops marched into the wood to bivouac for the night. In conversation with them, I learned their unit was the 105th United States Engineers, direct from the American Base. This was their first acquaintance with actual warfare. All appeared terrified of gas. Shells whistling over head in their regular flight to Pont Noyelles, St Gratien, and Freshincourt, naturally made them very nervous, and they used repeatedly to \"inquire\"; \"is that gas? is that gas? is that gas?\" Apparently the Yanks had been marching for days, as they complained of having sore feet, and asked eagerly for water.\n","128":" :- Battalions ordered out of the line this morning. Moved out of the wood at 11 a.m. Rest of Battalion brought in from the high ground above the Ancre, between Heilly and Bonnay and \nsplint\n split into fractions to escape enemy observation. Our squad came down through a sunken road close to the monument* outside Pont Noyelles en route to the point of Assembly. Evidently in passing this place Fritz had spotted us, for he commenced to shell the road. However, his aim was not too good and most of his heavy stuff\n\n* It commemorates a French victory in the war of 1870, I was told.\n\nfell among the houses of the adjacent village, most of which had red tiled roofs. As the shells crashed into the \nhouse\n roofs, a mass of tiles and red dust shot into the air. What reason can be given for such wanton destruction? By this time we had got to the point of assembly, and the whole Battalion, concealed in a field of wheat, waited for the arrival of the motor lorries that were to carry us to a place of rest. Shortly after midday, they arrived. Each company was taken up in proper order, and then the lorries sped away through the ruined villages near Daours \ntown of Doulens\n, thence along the main road to Amiens, and on the outskirts of that \nwhich\n city, the Battalion alighted, and occupied billets in a wheatfield.\n","129":" :- This morning I find we are encamped on the outskirts of Amiens, which is deserted. The vast population, hundreds of thousands in number, \nhas e\nhas fled. Miles of houses stretch away in the distance, and towers, domes, and steeples look down upon a stricken city. A few months ago this great \nmetropolis of Picardy, the with their\n city, historic in the Annals of France, celebrated in the story of European diplomacy, seethed with a \n\nmass of rigorous and excited people, and being almost within the hub of war, \n it was\n became a centre to which \nthe\n troops of the Allied Armies gravitated in thousands, often on pleasure bent. Now only a few old people are left. This dominion of desolation is terrible. All through last night the German heavy artillery \npoured might\n flung mighty shells into the city; and they are still falling at the rate of one, every quarter of an hour. These tremendous missiles were cast by some of the heaviest Hun guns* placed evidently at a considerable distance behind the enemy’s lines. The shells tore over the roofs of the houses, causing a roar like that of an express train rushing through a cutting, and the noise increased in intensity as they drew closer to the fatal spot where \nits\n their fell purpose should be executed. These hellish noises echoed, and re-echoed, in the silent squares and deserted streets. After the shells burst lumps of brick walls, tiles, slates and woodwork, accompanied by volumes of dust, \nand were flung\n leap into the air \nlike\n as scorial hurled from the crater of an active volcano. This usually\n\n* After the advance of","130":" \ntw\n a monster \ngun\n 11 inch gun was captured by the Australians, mounted on railway trucks. It was taken near Corbie with its crew of 18 men and an officer. It weighed 149 tons; barrel 25 feet long; weight of shell 620 lbs; range over 20 miles. The gun was sent to Paris, & exhibited in the Champ de Mars Goods Station. It was the biggest ever seen in the heart of \nP\n the city. Crowds congratulated the Aussies guarding their capture, which the Parisians named, \"Little Bertha.\"\n\nwas followed by the crashing in of whole walls and roofs. Later in the morning I actually saw the work of destruction in progress. I was sent on duty into the city. As I walked up \nthe\n a main street one of these monster shells exploded 500 yards in front of me with the awful results described above, and a half a minute later a lump of iron, as big as a pineapple, bounced on the road a few yards in front of me, and flying back into the air some sixty feet, curved over a garden wall. It is now night, and I have made these notes by candlelight in my dugout on the roadside \nwith\n while Private Joe Flood, my dugout co-tenant, is snoring beside me. Strife in the city is awful; shelling and bombing in progress. What a night!\n\nJulne","131":" :- Had my first experience of signal work in the field: Attended telephone at Company Headquarters. Despatched and received numerous messages. This evening strolled into the city, there leaving that part of it, near to which we were \nbilitted billetted\n billeted, was a suburb named, Rivery one of the main thoroughfare being the \"Rue Thullier Delamere\". The street was badly battered; the dwellings therein \nwhose of\n were \nbadly\n damaged by gun fire, many revealing also \nthe\n evidence of the vandalism\n\nof roving troops. One shattered building still bore the signboard, intimating that it was a \"Café Debit\", and the printing there on, read in the scene of desolation and ruin, seemed grimly humourous; it was as follows:\n\n\"Café Morel. Repas au BON AIR. Salle pur Reunions. Jeux divers.\" On reaching the boulevard I found it strewn with debris. Broken telegraph wires trailed about the street in thick tangles. Electric tramlines, broken or bent, encumbered the roadway, and this thoroughfare French gendarmes, or as we called them, \"the Centimes,\" dressed in field grey, with heads encased in shrapnel helmets of classic mould, patrolled the silent streets, and kept watch over the deserted houses, the front doors of which were barred, and the windows boarded up. A few civilians, mostly old men and women flittered through the streets like spectres; most of them traded in wine; much of it, I suspect \nthink\n, they must have stolen from other people’s cellars. I purchased a bottle of vin rouge for a couple of francs.\n","132":" :- Drilling all day. This evening I went with Joe Flood rummaging through some deserted houses. Every house has its brick cellar \nfor the\n to accommodate the family’s stock of wine. The ground floor\n\nof the place we examined, presented a pitiful sight. In the dining room all the crockery, most of it broken, was scattered on the table, and on the side-board, and with it were mingled knives, forks, spoons, photographs, private letters, postcards, cruets, glass jugs, salt cellars, pictures, tins, rifle ammunition, soldiers tunic buttons, old rifles, revolvers, boots, pots and \nand\n pans, the whole heaped \nup\n in confused masses, Chairs, broken or crushed, filled up corners, and a gaily coloured suite\ns\n in the sitting room \nappeared\n was trodden flat on the floor. On the second floor all the bedrooms had been turned topsy turvy. Beautiful mattresses, torn, or stripped into pieces, \nin the search for money\n by money-searchers, were cast on the \nfloor\n boards . Jugs and basins, smashed in pieces, lay about in all corners, while quilts, blankets, \nand\n sheets, skirts, petticoats, nightdresses, children’s clothes, holy pictures, books, hair brushes, entangled themselves into an\nd\n extraordinary hotch potch of household wares, and wearing apparel. In an upper \nstorey\n story of this ruined home there hung the best clothes of the family; the \nstaid\n black frock coat of the staid bourgeois, and the neat Sunday dress of the Madame. This attic also contained, a lot of onions,\n\nroots, dried bulbs, wire, and garden tools. This is how the homes are wrecked in France; this is war. Thousands of homes have been reduced to this state of ruin; thousands more have been blown off the landscape. What misery, what suffering, what a scattering of knick-knacs, heirlooms, and treasured little ornaments, each with its fond \nf\n history, dear to the heart of the possessor, as commemorating some great family event, a christening, a birthday, a wedding, a death! Again, I record it – this is war. I seem to be in a dream when I contemplate this \nvast\n desecration of homes, when I hear cruel artillery tearing down the products of Industry and Art; when I behold this vast and magnificent city, lifeless by day, lightless by night.\n","133":" :- Had \nsome\n music tonight. Some West Indian blacks belonging to a Soldier Battalion and camped near to us, brought down an improvised mandoline. Most of them \nblacks\n had the Aussie turned up hat set on their black \npates\n heads. All the coloured soldiers appear to have taken a violent fancy to the \"Aussie chapeau\"; for I have seen, Chinamen, Indians, Cape boys, Jamaica blacks, and many other hues in possession of our hats. As the darkies’ singing became very monotonous, some\n\nof our own chaps added a few selections from the vast collection of ditties* sung by the A.I.F. – mostly snaps from Music Hall\ns\n songs, while others, written in the war zone, were in pidgin French, or a mixture of French and English. The following \nis\n is a stanza of a French song equivalent to our \"Tipperary\". –\n\n\"Apres la guerre est finie\n\nSoldats Anglais partis\n\nMam’selle Francais\n\nBeaucoup pleurer,\n\nApres la guerre est finie!\"\n\nRaucus voices, some of the owners being \"well \"vin-blanced\"+, chanted the above popular verse very frequently this evening, or the following adaptation of it, wherein the ingenuity of the Australian in twisting and localizing things, is apparent:- \n\n\"Apres la guerre finie\n\nSoldat Australien depart\n\nMam’selle Francais\n\nIn the family way,\n\nSouvenir Australien.\"\n\nThe concert also included the interminable \"parley vooing\" of \"Madamoiselle from Armentiers\",\n\n* Appendix 12 – a collection of some of them.\n\n+ Intoxicated with white wine \nor\n (vin blanc). This wine, some of the A.I.F. called \"point blanc\".\n\nand that \"cheerio\" snatch, so often bawled by columns on the march:-\n\n\"When a 9 point 2 gets his eye on you,\n\nIt’s napoo*, tooraloo, goodbyee.\"\n","134":" :- Inspected the old fortifications of Amiens this afternoon. By a stone set in the walls, I ascertained the works were constructed in the sixteenth century. As we walked about the fosse \nlooking\n and looked through loopholes in the wall, our actions were carefully watched, as we afterwards ascertained; for I discovered a French sentry, peeping \nthrou\n at us, in the high grass on the top of the walls. Thinking we might be suspected of spying, we withdrew discreetly. We had a fine view of the city from the fortifications. The great cathedral, cast its immense contour into the perspective, and we examined, with much pleasure, the form and beauty of this glorious piece of architecture. Was informed in the course of our walk that the Huns had thrown several shells into this building, after which \npiece\n act of barbarism, German prisoners, who were officers of the High Command, were interned in the cathedral by the French, who communicated this to the enemy with a view to diverting his fire. On returning to our billets\n\n* If a man was killed, it was customary to remark: \"he’s napoo\". Colloquially used by the troops in the sense of \"ended\". \"Napoo\" is a corruption, or anglicized form, of the French: \"il n’y a plus.\"\n\nwe passed along streets fearfully damaged, occasionally meeting a disconsolate old man or woman standing by their doorways, and looking alike the survivors of an earthquake. \"Bon Soir, Monsieur,\" was their usual and only expression. The footpaths were encumbered with wreckage. In one house I saw the front wall gashed terribly. The second floor had been shifted to an angle of 45 degrees, and hung in mid-air, supporting a mass of bricks, plaster, and distorted \nfu\n bedroom furniture. A coloured print, hanging by its cord, swung to and \nfrom\n fro in the breeze, and a long string suspended a baby’s cradle, which shifted about as if it was a hanging safe. Piles of bricks and plaster had fallen on \nto\n the ground floor dashing all the furniture to pieces. On top of this \nmess\n heap of rubbish ","135":"\n crawled the house cat, meowing mournfully among the ruins, weak and famished for want of food. \nA\n What had been a red-plush armchair, belonging to the suite of the sitting room, appeared across the road on the opposite footpath, it having been blown through the wall to \nits pr\n it subsequent place of rest. This description \nof\n is typical of the general state of houses in the shelled areas of the city.\n","136":" :- Rumoured we are going back to the line on Friday. This is \n\nlikely because some of our officers today have been inspecting a \nthe\n sector \nround\n the \nvillage\n town of Villiers-Bretonneux.\n","137":" :- Rumour proved true. Bombs and ammunition issued today. We are to take over the line in front of Villiers-Bretonneux.\n","138":" :- At midday set out on \nover\n a long march to the front line. The terrors of this day I never shall forget; how I escaped death is to me, and always shall be a mystery. We marched from Rivery to Blangy-Tronville where we halted for tea, and a couple of hours rest, before \"going in\", two words which had a fearful significance for those used to the perils of \"changing over\"; \non\n in ordinary words this latter means, fresh troops taking over a sector from tired troops. At 8 o’clock this evening, the Battalion was split into platoons, and each moved off at stated intervals. We all knew we were going into one of the most hellish spots on the whole front. – Villiers-Bretonneaux! It is situated on the ridge South-east of Amiens, and was a position \nalways\n fiercely shelled \nby\n with high explosives and gas. At last our turn came to move in. Marched along a sunken road, and then climbed \nalong\n the hill above Blangy-Tronville, \nat\n the tip of which we reached just before \nas\n dusk. \nwas falling\n Then there appeared\n\na \nlong\n broad stetch of open country the surface tending to \na\n slope to a bollar between us, and our objective; - a hillside and sunken road at the back of the village. On our right was a wood masking several French batteries of \"Seventy fives\". These barked continuously, and the German batteries were replying intermittently, most of the\nir\n enemy fire being directed on a strangely-fashioned, red-brick house on the verge of the wood. This was called \"the doll’s house\". We started to traverse the two thousand yards \nyards\n of open country, keeping to the road. On each side \nthere\n were fields of wheat, but these, and the road, were broken by shell craters. On looking across this tortured area I saw what was left of Villiers-Bretonneaux. \nin the distance\n At first glimpse merely a jagged stone column – formerly the church tower, I believe - \nstands\n could be seen above clumps of trees. On drawing nearer, I could observe how the place had been smashed and ruined by the enemy’s fire, and noted a line of fretted walls and broken buildings. At dusk we were within half a mile of the position we had to hold. Suddenly a plume of black smoke appeared above us; there was a \"ping\", and another \"ping\", and another \"ping\". Soon pieces of shrapnel were raining down upon us. Then came heavier stuff, this bursting\n\non the ground with a terrific concussion and sending showers of iron in all directions, so close to the ground, that the pieces could be heard rustling through the wheat and grass like a plague of rats, racing and rattling about in a state of fright and confusion. These missiles, I was told tonight, are called by the boys, \"grass cutters\". Between the shrapnel thrown from the \nsh\n explosions above, \nare\n us, and the pieces from the \"grass cutters\" beneath \nabout\n our feet, came the big shells. – the meat in the sandwich. The whistling and screaming \nwas\n sounded most horribly and mingling with the crashing noises, made the din hideous and hellish. The platoon quickly assumed artillery formation, and marched steadily forward into this inferno. The air became full of shooting firery globes and stars which exploded into \nshred\n showers of sparks and iron, and snorted forth curling streams of smoke, and the noises of the scattering lumps of iron resembled the medley of sounds that \nare\n would be created by drawing the hand quickly and rigorously across the exposed strings of a piano. Casualties now were taking place. Stretcher bearers were kept busy. The shelling waxed hotter, and the smoke settled across the gloomy \ngully\n hollow like fog. Some of the platoons ahead of us became disorganized, and the men broke across \nthe\n a wheatfield to the left\n\nof the road, while others took shelter in shell holes. Five of our platoon were left on the road – Private Tom Jones in front, guiding us, then Corporal Plant, \nthe\n Private Joe Flood, myself, and Lieutenant Moss behind us. Marching in single file we stuck it out, and got through without mishap, and the sense of relief in consequence, \nfelt like\n was as the effect of intoxication in the elating stages. Some of those who had \nwere\n had been scattered off the road \nwhere w\n lost themselves; others got tangled in the barbed –wire; and a number was wounded. It was quite dark when we reached our dug-outs; \nand\n we crawled into them quickly; for we soon found \nour\n the position was perilous in the extreme. The enemy kept \ncontinuously se\n up a searching fire, and counter-battery work was going on all the while. In conversation with Lieut Moss, I learned that the enemy had the exact range of the road \nwhen\n by which we came in, \nby\n and that a mistake had been made when the company was directed to take the route it did. A considerable\n number of casualties resulted from this error. Barrages, varying in intensity, are frequently encountered in changing over. Some of the old hands described today’s \"performance\" as unusually severe, and added, that they thought the acts of \"going in\" and \"coming out\" were far more trying than holding the line in trenches. \nSo do I \n","139":" :- Enemy’s artillery active all night; therefore, had very little sleep. Our guns also kept pegging away, especially battery which was situated about 100 yards away from the line of our dugouts; and it kept constantly \"drawing the Crabs\" on us, as \"Jerry\"* sent salvoes of high explosives in reply. All round us are cemeteries; the groups of crosses are too numerous around here, to allow one to feel at all safe. Even some of \nour\n the dugouts have been used as graves, so that some of us are sleeping next to our poor comrades who will never wake. Outside these dugout graves or on the top of them, are placed the deceaseds’ helmets, many \nof them\n having the Battalion colours painted on them, and others exhibit dented crowns, or rugged holes made by splinters. Whilst making these notes about helmets I may enter that the practice\ns\n is \nvery\n general in the Australian Army of camouflaging the tin hat. After use \nthe\n it becomes shiny. To prevent the consequential gleam the troops sew a piece of ration bag over the entire helmet. Went out in the open tonight, and worked many hours under artillery and machine gun fire, the task being the digging of a trench 6 feet deep to lay a cable for communication purposes. One man in our company badly wounded. Earth very hard, and chalky. \n","140":" :- Got back to shelter at dawn. \"Stood to arms\" for an hour, then \"stood down\" and had\n\n* All the British troops in France referred to the enemy as \"Jerry\".\n\nhad\n breakfast. Tried to sleep, no luck. \nThe\n Continuous roar of all the adjacent batteries, or their repeating reports, seem to \nhammer\n beat on my heart, as if they were hammers, causing a horrible and sickly sensation, and making composure impossible. So I am cramped up in this hole in the earth in a state of intolerable uneasiness. British aircraft are as active on this sector as they were at Morlancourt, where I saw two flocks, one numbering 70 planes, and the second 50 \nplanes\n attack the German lines. On this front our planes keep their machine guns rattling on the German trenches, for hours at a time.\n\n","141":" :-\n","142":" :- Labouring all night until dawn. Commenced at 9.30 last night carrying \nup\n huge sheets of roofing iron and bales of wired camouflage. A squad of ten did this job. It was a bitter experience. The physical pain and \nits\n exhaustion were bad enough, but we had to get out of the trenches and struggle through the open down to the front line, in the face of rifle, machine gun, and artillery fire. An Engineer Sapper, who proved to be a proper \"dud\", had charge of us. He was excitable and bemoaned his fate at having to come up here to do such \nas\n a job, \"especially,\" he said, \"as I am 45 years old, and a married man.\" This fool succeeded in getting us lost\n\nand so we were wandering about no man’s land in the dark, struggling with these huge weights. There was a maize of trenches about us, the principal being \"Diggers’ Supports\", \"Kent St\", \"York St\", and \"Anzalia Switch\". Our materials had to be deposited \nat\n on the corner of Kent and York Sts. We got lost, found ourselves, got lost again, and some of us had to sit with the stuff whilst others went out exploring. After hours of this misery, a place at last was found somewhere, and so we dumped the lot, and returned to the trenches where we met the ration fatigue coming in with \ntheir\n rifles on one shoulder, and two handy bags, tied together, \nand\n slung over the other shoulder. We squeezed into a slit to let them pass. Got back to shelter at dawn. \"Stood to\" as usual. \nWas\n Warned to be ready to go into front line again at 3 P.M. today. Hardly any tucker available. This activity portends a stunt in a day or so. Resumed work this afternoon with four comrades, we being detailed to construct a Regimental Aid Post in the front trench, some of the material for which we had carried down last night. In addition to gear and rifle, I had to carry two 12 feet logs along \nthe\n \"Diggers’ Supports\" to the corner of \"Kent and \"York Sts\", and suffered extraordinary fatigue\n\ntr\nstamp on any of their limbs projecting from the holes in which they were huddled in an unnatural sleep. Eventually we got to the working point. We dug for hours with the pick and shovel; every spade-full of sand had to be put into a sandbag, which, when full, was tied, and stacked \nup\n on one side of the hole; and after a certain depth had been reached, all these sandbags had to be lifted to the other side of the hole. If the sand had been thrown up on the surface, the work would quickly have been detected, and subjected to enemy fire. Worked on till \nmidnight\n dawn. The stunt will take place on the 4th inst. Our work is almost finished. It is to be a shelter for first aid to the wounded.\n","143":" :- Last night the 21st Battalion took charge of the front line, and sometime this evening we are to be relieved by another Battalion of the 6th Brigade. This place has been an inferno during the last five days. The grass stinks with gas, the air reeks with the fumes of high explosives, \nand\n Clouds of yellowish smoke are drifting across the \nto\n ruins of Villiers, Bretonneux and the adjacent wood, circling \nthe\n French Batteries. We are a company of physical wrecks, all of us – exhausted by fatigue; \nshocking\n trembling and feverish through lack of sleep; body vermin; and eyes shining \nunatural\n with unnatural brightness in faces made wan and cadaverous by the horrors of this awful \ninfernal\n environment. The place reeks \nwith\n also with the \nterrible\n noxious effluvia exhaled from the rotting bodies of ‘dead Hanks\", most of whom were killed in the battle for this \nvillage\n position in the last weeks of April. A lot of the corpses \nwhich\n had been hastily buried in shallow holes dug in the banks of the sunken road near us \nbut\n and these emitted streams of putrefaction which, percolating through the loose chalky earth, attracted swarms of green flies. Battalion headquarters had been substantiated \nright\n in the \n\nmidst of this pestilential area. How eagerly we look for the relief, for respite, from this aceldama! It will come sometime tonight. \n\nAt 5 P.M. a \"coal box\" crash\ned\n resounded within a few yards of my dugout, and \nthe\n a shower of iron flew across a road about 50 yards away wounding the driver and killing one of the two horses attached to a limber that happened to be passing at this unlucky moment. This caused \nall\n the drivers of all the transport vehicles traveling along the roads in this vicinity to whip up their horses \nand\n Away they gallop for dear life, raising clouds of dust, \nand\n bumping through the shell holes in the roads.\n\n9.30 P.M. Relief has come. The relieving companies have had a fortunate start – they get \nacross\n to us across that \ntwo 2000 yards of\n open country between Blangy-Tronville and Villiers-Bretonneux without mishap.\n\nMidnight; \nThis day is my 36th birthday, \"the happy returns\" of which none wished me\n After handing over to the relief, we formed up in readiness to cross that 2000 yards of scarred and mutilated country. Before we had started, the town had caught fire and by the time we did start, night was closing in, and evening star shells were soaring aloft, and casting a ghostly\n\nradiance on the desolation around. We started on a forced march through the danger zone. Several times I looked back, and saw the flames in the night sky. As we pushed on we could see over guns flashing\neverywhere\n around us, and tired and frightened horses rushed past us on their way\ns\n to or, from the line. This day was my 36th birthday, the \"happy returns\" of which none wished me.\n","144":" :- Billeted in reserve trenches before Glicy. Enemy searching these parts with 9 inch stuff. At 10 AM \no’clock\n ordered up to complete the digging up of a cable trench above Blangy Tronville. Had no dinner, but got a good hot tea. The stunt opens tomorrow. \nnight\n Some Yankees* are going over the top with our boys, for which reason \"the glorious 4th\", Independence Day, was chosen as the date for this action.\n","145":" :- \"Stood to\" \nat 8 P.M.\n early. Battalion ready to move up, if required, at a moments’ notice. Barrage commenced at \ndusk\n very early this morning. Opened apparently between Villiers Bretonneux and Hamel. Maintained for hours with fiendish intensity. Row terrific. The whole line in front of us is ablaze with flashes leaping up and convolving like the \n\n* Two companies; 500 men. First occasion Americans had co-operated with Australian troops in the field. 1500 Germans captured, in addition to 171 machine guns and several heavy guns. Advance made, 2500 yards, on a 2000 yards front. Many tanks were used in this \"stunt\" which was a complete success.\n\nfiery fingers of the ten thousand devils tearing at the sky. Latest news \nat midnight\n \"all’s well\" Sixth Brigade going strong.\n","146":" :-\n Success of \nlast night’s\n yesterday’s \"stunt\" \nsuccessful\n evident everywhere \nthis morning\n Columns of prisoners are now coming down the roads, and the tanks are coming back, the cheerful crews \nseated\n sitting on top of them. \"Jerry\" has come another \"gutzer’* so the boys say.\n","147":" :- Went back to the line today. Was detailed, with several others, to cut down \nthe\n crops round Villiers Bretonneux, as they were becoming dry, and might take fire and consequently smoke us out.\n","148":" :- Heard this evening that M. Clemenceau, the French Prime Minister, yesterday addressed the Units that fought in the Battle of Hamel, which took place on the","149":" inst. He is reported to have said to them: - \"The French people expected a good deal of you, because they had heard what you had accomplished in the development and creation of your own country.\"\n","150":" :- Still cutting crops under harassing fire from the enemy.\n","151":" :- At this time my body was a mass of running sores, and the \n\n* \"Gutzer\" was a slang word universally used in the Australian army, to express the feelings of a sanguine expectation hurtfully disappointed. The idea I think comes from a swimmer misjudging the angle for his dive, and striking the water horizontally, the effects of which are painful about the regions of the stomach.\n\nMedical officer, noticing sores on my hands, asked me if they were elsewhere on my body. On informing him in the affirmative, he ordered me to be evacuated to Amiens for treatment. I told him I preferred to stay on with the Batt, but he would not hear of it, and sent me to rest at the","152":" Field Ambulance, which was situated in the grounds and buildings of the Bangy Tronville \nvillage\n school. At this time I am suffering very much irritation from body lice. This awful plague causes much suffering, especially at night time, when trying to get to sleep; for as the body gets warm, these fearful pests become extraordinarily active. If a man have any contagious fever, and his temperature rise\ns\n the lice immediately leave his body, and \"dig themselves in\" on the body of an individual whose temperature is normal, thus frequently causing such an individual to become sick, through the lice carrying the infection \nto him\n and inoculating him by \nbiting\n biting. These creeping things hide and lay myriads of eggs in the seams of trousers and shirts, and for this reason, the Yanks call them \"Seam Squirrels\". In the British Army they are known as \"chats\".\n","153":" 16th:- Being treated for ulcerated scabies. Am in a huge building in Amiens, a place which in normal times\n\nhas been \nevidently\n a public hospital. It is surrounded with fine gardens, and the entrance leads into a spacious courtyard, which is an old part of the building; \nand\n possibly at one time, \nwas\n it was the Chateau of some great citizen of Amiens. In that portion of the establishment where I was lodged I read various kinds of notices such as: \"Essayez vos pieds\"; \"on est prie d’ouvrir et de fermer la port doucement\"; and \"Contacieux\". This last notice appeared at the bottom of a stairway, and \nare\n some Australian in his desire to improve on the previous notice, wrote under it: \"Scabies – first floor (Take lift. 5 point 9. High Velocity)\" In the course of the morning I witnessed a very distressing sight. Streams of wounded were coming in as fast as the ambulances could bring them, mostly men of the","154":" Battalion (Victorians). Whilst assisting in the work of carrying them, I ascertained that about 200 men had been gassed somewhere near Villiers-Bretonneux. The majority was blinded, and those who had got the gas into their stomachs, vomited violently. Their cries and groans were heart tending. Where possible every man was bathed, his eyes were bandaged, and then he was put into a new pair of Red Cross pyjamas. Next he was carried\n\nout on a stretcher and laid in this garden. There were rows and rows and rows of \nthe\n wounded, so placed in the garden. Even in this spot, so close to the line, we \nare\n enjoy the comforts provided by that noble and ever active institution, the Red Cross Society. The pleasure of washing with a piece of Red Cross Soap, and then slipping into a pair of Red Cross pyjamas is indescribable. The city is being bombed and shelled as usual this evening. Within the last 3 months 10,000 shells have been flung into Amiens.\n","155":" PM Evacuated to C.C.S.* with half a dozen other men, one grievously wounded in the abdomen by machine gun fire. His agony was terrible, but all that could possibly be done to alleviate it, was done. I sat in front of the motor ambulance \ncar\n and beside the chauffeur. A storm, tremendous in its violence, had just swept past when we started for the C.C.S., which was many miles away, so the \ndriver he\n chauffeur said, The moon shone through a watery sky, and cast sufficient light across the old city, to reveal to us the evidence of destruction and desolation, \nas we sped through it\n The silence of the grave sat upon the city, being disturbed only by the whistling of railway engines, and the tooting of motor ambulance horns as a warning \nthat\n\n* Casualty Clearing Station.\n\nagain we went seeing many villages en route to our destination near Aille-le-Somme. At midnight reached \nour\n the C.C.S. where particulars of our service etc were taken, after which we were allotted to tents. Feeling weary, cold, and wretched, I got into bunk and soon fell into a peaceful sleep, the first I had enjoyed for many a night.\n","156":" 17th:- The C.C.S is located near a village called Crouy. It is hidden in the dip of two hills \non\n upon the sides of which wheat grows luxuriantly, \nand among the wheat\n Thousands of red poppies diffuse their purple radiance through the grain. The C.C.S comprises a series of tents carefully arranged, particularly in regard to providing protection (as good as circumstances \nwould\n permit) for the seriously wounded. Deep pits are dug, over which the canvas is erected and \nthe beds\n beds and patients are accommodated well below the surface; and the nurses, (many of whom I saw wearing the ribbon of the Mons Star) attending to the wounded, carried on their work in these pits, the object of which is to afford shelter in the event of enemy air raids. The design of these pits is shown in the following diagram:-\n\nFrom the observations of the hospital organization here, it appears to me that the C.C.S. is the advanced post, where are concentrated many of the beneficial results of the work of the Red Cross Society, work beginning in all parts of the Empire, thus setting up a movement to send comforts to the wounded; and that movement, traversing well organized lines of communication, may be said to expand itself in a mission of mercy at the doors of the C.C.S – warm and nourishing food and drink, clean clothing, \na\n small bags for personal effects, and a thousand & one little things that spell absolute comfort to the wounded soldier. Added to all this, the very best medical attention and surgical skill are speedily available. But the place is depressing; for it is a veritable shambles. At the time of my lodgement here the ambulances \nare\n were streaming down in hundreds with crowds of sick and wounded, the injuries of some of the latter being terrible. Faces and limbs smashed and smeared with blood, and clothes full of the congealed matter, were ordinary sights. Into one end of the C C S streamed those who had been mutilated by the enemy fire, and at the other end bodies were being removed \nin the\n shrouded in the Union Jack. The most nauseating sights of all were the piles of uniforms cut off, or torn off, the wounded; they were usually heaped up at the back of the receiving tents, soaking with the life’s blood of those who had so recently worn them.\n","157":" 18th:- A train load of wounded is to be dispatched from here today. Have been warned to be ready to move any time. The convoy was sent out at 3 PM. A light railway ran through the C C.S and communicated with the main railway line, half a mile away. The rolling stock is light, comprised of trucks in which stretchers can be slung. \nSitting\n \"Walking cases\" get in anywhere. The speed was slow. It took a quarter of an hour to reach\ned\n the Red Cross train, made up of some 18 cars. The accommodation for the staff of nurses, medical officers, and orderlies was excellent, and everything was in readiness to deal with serious \nemergencies\n emergencies. There were kitchens for cooking the food; \nwhich\n and that was liberally distributed on the journey. About 500 sick and wounded occupied the train, which left Crouy about 5.30 PM. Fortunately, the evenings being long at this time, I could see much of the peaceful country of France. We got to Abbeyville about half an hour before dusk, and there \nwas\n put off some wounded German prisoners. An Aussie friend of mine, with a wounded arm, showed me a German Sergeant, whom he had \"outed\" with a Mills Bomb a few days previously. The German gave him a smile of recognition; \nand\n the Aussie wished him \"good luck\". Strange one the ironies of war!\n","158":" 19th:- Travelled all last night. About 8 am the train approached the outskirts of the historic old city of Rouen, crawling very slowly through the suburbs. \nThe\n French sentries,\n\nposted on the railway bridges, presented arms to the wounded, and remained \"at the present\" until the trains had rolled past. Rouen seemed to me to be a city of chimney stacks, and vegetable gardens; \nand\nthe buildings seem to wind themselves around about an extensive valley. Our train became stationary beside a \npassen\n passenger train; there were a numbers \nlot of windows and young\n French girls among the passengers, and, when they had gazed upon our train load of misery, their beautiful faces became sad, and tears streamed from their eyes, from those great \nlustrous\n lustrous eyes, the peculiar beauty of which is a very distinct feature of the French female face. Seated in the same conveyance were some of the grand-peres, - sharp-featured old fellows, smothered in alpaca smocks, and wearing white straw hats; and the prevailing \nand woe begone\n expression\ns\n on their faces seemed to indicate their one thought – \"will the war ever end?\" We moved \npassed\n away from \ntheir\n Rouen; but before leaving I managed to catch a glimpse of that venerable cathedral where, for a time, the remains of that warrior King Henry V, were laid to rest. The train then traveled across some ","159":" 20th:-\n very beautiful country, level, extensively cultivated, & dotted with compact woods, through some of which peeped towers and gables of chateaux, built under \"l’ancien regime\", or the \ntower\n spires of village churches, In the fields cows were feeding on areas\n\nwhere the crops had been cut, each animal being \nthether\n tethered, and many \nof them were being\n milked by old women. At 11 am we stopped at a place called Etretat \nwhere\n and the wounded were detrained. Motor ambulances, driven by English girls, conveyed the sick & wounded to an American hospital at the adjacent seaside; and among the motor ambulances engaged in this work, I was surprised to see one bore the words, \"Young N.S W\", and another \n\"Walcha\"\n was marked \"Walcha\". On arrival at the receiving depot, \nwhich happened to be\n one of the large cafes of Etretat, I produced my \"Field Medical Card\", and later, with a crowd of others, was put into a room where \nwe\n I went to sleep on the floor until 5 P.M. Afterwards we again entered \na\n motor ambulance, about 30 of us, and were taken on by road to Le Havre. \nand\n There I became an inmate of the hospital for diseases of the skin, situated at Sanvic, and overlooking the beautiful Bay. \nof Normandy\n","160":" 7th:- Since being in hospital found nothing worth recording. Discharged to \ntoday at\n the Australian Infantry Base Depot which is situated a few kilos beyond Harfleur. Innoculated, examined by the medical officer, and sent to the Convalescent Camp.\n","161":" 10th:- Last night disturbed by air raid warning. The Sergeant-Major came round, and woke the men in each tent by beating the canvas smartly with his cane, at the same time \nhe kept\n roaring: \"fallout the fire picket! Fallout the fire picket!\" The alarm spread through all the camps down to Harfleur. Thousands of troops were aroused. Search lights illuminated the sky. The troops in the Australian Base were forced out of bed, and had to take shelter in \nthe\n trenches dug in the camp area. \"All out into the trenches at once\", came the order. Many would not budge. Most of the men swore on being disturbed; but in the midst of this midnight upheaval, \"all clear\" was sounded, and the camp once again settled down to rest.\n","162":" 12th:- Travelled by train to the city of Le Havre. Found the place full of French, English, Australian and American troops. \nI\n Was accompanied by Gunner A.B. Lee of the 105th Howitzer Battery, an old Press associate, who had been on the Staff of the Sydney \"Daily Telegraph\", met him quite accidentally in the convalescent Camp. One of the first things to attract my attention in Le Havre was the fine statue of Bernardin De Saint Pierre. He was born in this city in 1737. Having\n\nread that charming story, Paul and Virginia, and being interested in the career of the author, it was to me an exquisite pleasure to visit his birthplace, and behold his statue. We strolled along the Rue de Paris, and \nseveral times a\n occasionally a buxom Madamoiselle\ns\n standing outside a Café Debit, or a \nfishery\n fish shop, cried out: \"Come in Diggers\". Competition for business was very keen. We strolled into a little side street, Rue de Sery, there finding a clean Café Debit, \nwhere we\n had tea. The Madam, and her daughter, - a dark and pretty vivandiere – proved extremely polite and attentive, and regaled us with grilled \nsteak\n steak tomatoes, champagne, bread and butter, and \ncafé noir\n black coffee. Prix vingt-et-un francs, and cheap at that for today I tasted the first piece of steak since I left Australia, 14 months ago.\n","163":" 19th:- Spent another pleasant afternoon in Le Havre, \namong\n visiting the bookshops, \nin\n the Art Gallery, and \nat\n the museum, \nand\n At the last place I was particularly amused on seeing a kangaroo thus catalogued: \"Le Kangaroo géant\/ Nouvelle-Hollande\". He must have been put in there many many years ago. Possibly the presence\n\nof so many Australians in the city, may cause the curator to wake up and substitute \"Australia\", for the ancient title of New Holland.\n","164":" :- Attended a very interesting lecture for Australians, concerning the reconstruction of Europe. It was delivered by Dr Holland Rose, Professor of Modern History, University of Cambridge, Christ’s College. What a relief it is to be in the world of Art and Letters for a while, and away from the barbaric stuff of the cursed Somme Country. But I am almost well again, and no doubt \nI\n shall be on my way to the line very soon. \nagain\n","165":" 25th:- In the midst of an amphitheatrical depression, the surrounding sides of which were \ntipped\n clothed with trees growing closely together, and \nthe surrounding\n dotted with fields revealing traces of the recent harvest, was situated the No 1 Australian Convalescent Camp. This afternoon (Sunday) the Camp Band played a programme of orchestral Music outside the Officers’ Mess. Chairs and forms, set out in the open space, accommodated the civilian visitors, who came in crowds from the adjacent suburbs to listen to the band. There were girls and women of all ages present,\n\nand many wore mourning. One very pathetic sight was the presence of nine girls sitting next to one another. Although not one of them could have been above 20 years of age, yet all wore widows weeds, all had fair hair, the full lips characteristic of the fair daughters of France, and their soft eyes appeared listless and sad. Corpulent old \nmonsieurs\n messieurs strolled about the parade ground, smiling under their high-crowned white straw hats, \nand\n occasionally kicking at stray dogs \nstraying about\n or calling \nout\n to \"Pierre\", or \"Suzanne\", olive branches, to keep quiet. My friend, Lee, in the course of the afternoon, had a crowd of little girls around him to \nHe\n whom distributed \ncentimes\n \"dix centimes\" and half franc pieces \namong them\n. Sometimes he would put his Aussie hat on in the style of \nthe little\n \"le petit Corporal\", and the \nkids would\n girls would shout vivaciously \"Napoleon!\" The band concluded with the \"Marseillaise \"and the \"National Anthem\".\n","166":" 30th:- Discharged as fit from Convalescent Camp, and reported back to A.I.B Depot \nwhere I\n Was \"put on draft \"immediately. At the Base met Private R. Riddle of my own platoon. He told me he had been slightly wounded\n\non the morning of the 8 inst when the Australian Army made a general advance on the Somme. He described that morning’s barrage as the most extensive, vigorous, and accurate of any he had ever seen. A very heavy fog hung over the battlefield, the troops became confused or lost, and \nthe\n tanks kept losing their way and moving around in circles.\n","167":" 3rd:- Left the A.I.B D. Le Havre, to rejoin my Battalion. The draft marched from the Base to Le Havre Railway Station (about 10 kilos), \npassing through\n via \nHarfleur\n Harfleur, with two bands playing. We pass hundreds of female munition workers, who greeted us gaily, many pointing to a small chap marching in front of me and crying, \"petit\". \nWe\n Entrained in cattle trucks in the afternoon, and about 4 PM the train steamed \nout of\n from Le Havre Station. All the French people working in the fields greeted us joyously. The Australians were \nhad\n now playing a big part in Marshall Foch’s great advance, that had started on the","168":" They had just captured Mont St Quentin. Boys and girls ran to the edges of the railway embankments, waving their hands; women, young, middle-aged, and old, threw kisses to us from the wheatfields where they were harvesting; and the old men waved their blue caps with shiney black peaks, while others drew \ntheir\n\nhands across their windpipes, suggestive of \nthe\n cutting \nof the\n Boche throats. \nof the Boches.\n","169":" 4th:- Detrained at Corbie at 5 a.m. Corbie I had seen in May being shelled fiercely, and also blazing at night with incendiary bombs. This morning I again saw the battered towers of the fine town church; but, spite the fierce fire of the enemy, they still stood proudly aloft with the French tricolours flying on one of them. The slates were disturbed \nfrom\n on the roof, and, in their disorder, resembled the dislodged scales of fish. Corbie’s streets were full of shattered houses. Cafes were blown in, and windows \nwere\n smashed in section of walls standing at all possible angles. Houses were reduced to piles of brick or dust. Shops, broken open and battered, exhibited their stock scattered on the floors. One, which had evidently been a large general store, was littered with linen, wearing apparel, toys, glassware, pictures, papers, and religious relics. In the town square was \ncollecti\n a collection of chairs, tables, armchairs, chests of drawers, and mirrors. Wine shops were smashed in, and not a taste of grog \nwas\n left. Round the town were posted notices that \"the kookaburras\" * would show \"ce soir at 6.30 PM.\" At Corbie was the Second Division Wing, and it was\n\n* Name of a theatrical party. Such parties, were \nmade of\n composed soldiers of the A.I.F, who had theatrical or musical experience. Each troup had its own name \ntitle\n such as, \"The Anzac Concert Party\", \"The Green Diamonds\" etc.\n\nsituated in what had been a woollen mills. Here we camped in one of the large store rooms. Outside the Divisional Wing Orderly Room I saw posted \nup\n the following notice from the Intelligence Reports of 4th September, 1918:-\n\n\"A recent Intelligence \nReport\n Summary\n\n\"of the 185 German Division contains\n\n\"the following extract: ‘ The latest identifications\n\n\" ‘show that the","170":" Australian Division\n\n\" ‘is in the line from North of Rainecourt\n\n\" ‘to half way along the Framerville-Lihous\n\n\" ‘road. South of this is the","171":" Australian\n\n\" ‘Division. \nBoth Divisions are\n\n\" ‘\nknown as first class Assault Divisions.\"\n","172":" 5th:- We started along the Corbie-Bray Road, the morning being very hot, The sun-baked highway was littered, in fact carpeted, with pieces of iron. I saw \nthe\n Villiers-Brettoneaux with its ruined \nvillages\n buildings, and the battered ridge where I had sat under the enemy fire for days. Later we marched past \"Death Gully\", that terrible place where I had endured a terrific bombardment for two hours on the","173":" As we proceeded, the road led us across the old Morlancourt Sector, and there were numerous evidences of the battle fought around this area. German shrapnel helmets could be seen scattered in profusion and confusion. Dugouts and trenches and shell\n\n* From this date until I went into battle on","174":" October, I marched over the country across which our fine Divisions, starting on","175":" 1918, made that glorious and triumphant advance, which was the turning point of the war. I was privileged to share in this honour, and fought in the great battle which destroyed the final defences of the \"Hindenburg Line\".\n\nholes, and demolished machine gun posts, mingled their ruins in the scarred landscape. Stacks of German stick bombs, \"potato mashers\" the boys called them, used and unused could be seen on the sides of the road, besides three or four battered tanks with their sides split open, capsized and helpless. There were trees that had been snapped in halves, the huge trunks of others, being torn, scarred, or splintered by shell fire. \nMost of\n All of the trees were smashed about the tops, and then foliage had been stripped off. Caged \nfull of\n German prisoners, stared at \nthe\n us as we passed onward. \nit\n In this stricken country little groups of crosses showed where hard fights had been fought, and the helmets of the dead rested on their graves. In dugouts on the roadside, dead \"Hunks\" had been thrown and half buried, so that the intense heat brought forth a fearful stench. In one place a man’s back, with flesh still adhering to it, protruded above the level of the ground. Dud shells, dead horses, and broken limbers added \nproof\n to the proofs of the strife that had been here. About 3 o’clock, we came into Bray, and there saw with what fiendishness \nhave fiendishly\n the Huns had gratified their lust for destruction. The village church * was in ruins. The steeple had been reduced to a huge wood heap\n\n* When passing Bray church I got a glimpse through \"the old bleak East Window, of the marble tracery, delicately and incongruously white amid the ruins of a noble shrine\".\n\nthat rested on the \nwall\n stonework of the tower, whose clock had stopped at three minutes to one. On the walls of the shattered houses I saw numerous German notice boards.* All the houses were stripped of their furniture. Even the tin spouting was reefed from the roofs of many buildings. The column, tired and hot, halted a kilo beyond Bray. On surveying the country around, I was impressed with the strong natural defences offered by the ridges, and then realized what fine human qualities must have been required to drive the foe out of it. We slept in an \ndisused\n abandoned German camp.\n","176":" 6th:- Resumed the march at 9 a.m, \nand\n Approached the village called Cappy half an hour later. The church had been badly damaged, but it stood proudly in the midst of the ruins with the framework of its spire still sound. There was a lagoon in front of this place and the pile of ruins made a strange picture \nsight\n when reflected on the \nsurface\n smooth sunlit surface of the lagoon. The church clock had stopped at ten minutes past seven. Bridges forming the approaches to \nthis\n Cappy had been blown up or wrecked, but these had been replaced by our Engineers. Having marched through \nthere\n this village we struck the shady bank of the canal\n\n* The notices were in characteristic black Gothic lettering, noticeable words being, \"NACH\", and \"VERBOTEN\".\n\nde la Somme which, in this part, had been completely blocked by \nthe\n sinking across it \nof\n a large barge. Here I found my Battalion, \nat rest\n the gallant 20th, whose glorious story had commenced on the ridges of Gallipoli; it was resting on the field of its latest, and one of its \nGrea\ngreatest victories – the capture* of Mount St Quentin. After that famous fight on 31st August and","177":" September, only 96 men of the 20th answered the roll, while the","178":" Brigade came out but 300 strong. I learned of the death of many of my comrades, some of whom had been my personal friends.\n","179":" 7th:- We are quartered on the banks of the Somme Canal at a small place called Frise. This canal is full of eels, and dead men too, in some places; and as the eels are easily caught, the cooks are dishing them \nit\n out for breakfast, dinner, and tea.\n","180":" 12th:- Have been training vigorously, today and yesterday. This last few nights the skyline has been ablaze, \nwith\n due to fierce barrages on the Hindenburg Line. At night enemy planes bomb\ns\n these parts.\n","181":" 15th:- Went over the battlefield of Mount St Quentin today. Carefully examined the whole ground, and enemy defences. Nearly had my head knocked off with a piece of Fritzy shrapnel – it was a close shave.\n\n* I was so impressed by the pride the men took \nshowed\n in this victory, that I devoted weeks to work of closely investigating many \nof\n details \nall\n, and believe my narrative is the most complete and exclusive. It is forwarded, with original notes, with this diary.\n","182":" 21T:- Rumoured today that one of the Battalions in the","183":" Brigade is to be broken up. The \"Green Diamonds\" gave an entertainment this evening in \non\n a rubberoid structure previously used by the Germans, who were in occupation here until driven out about three weeks ago. One franc was charged for admission. At the Australian Base at Le Havre, where there is a fair degree of comfort and no worry, entertainment is given free. Why are men away up here in the line forced to pay?\n","184":" :- A long typewritten notice appeared on the Company notice board today concerning the breaking up of battalions. The following extracts contain the essence of the announcement:-\n\n\"Reorganisation of Brigades. Bringing\n\n\"of Brigades to the three Battalion basis\"\n\n\"This has been completed throughout\n\n\"the Army partly on account of the man\n\n\"power situation, but partly also on account \n\n\"of the tactical constitutions on the anology\n\n\"of the French, American, and German\n\n\"Regiments.\n\n\"Upwards of six months ago the\n\n\"War Office urged the Australian Government\n\n\"to follow suit in this reorganization and the \n\n\"\nbringing\n* of brigades of the A.I.F. to the three\n\n\"Battalion basis.\"\n\n* Cannot decipher my shorthand character for the word to come in here, but \"bringing\" seems to be a suitable substitute.\n\n\"The time has now arrived when the necessity\n\n\"for action has arisen. The War Office has\n\n\"pressed for an immediate carrying out of\n\n\"the same reorganization in the remaining\n\n\"Brigades.\"*\n\nI am of the opinion that there is a vast amount of bluff, and down right lying in this announcement. My experience in the military has taught me to distrust \neverything\n their statements. The promises they make, collectively or individually, are hardly ever honoured, but nearly always broken; and any notification made can never be relied upon for five minutes.\n","185":" 25th:- Today the 19th Battalion was broken up, and \"D\" Company of the 20th Battalion was also broken up, \nup and\n and the men distributed among \"B\" and \"C\" Companies. This move was made to accommodate a draft of men from the 19th who were to be put into the 20th Battalion as \"D \"Company. When the 19th Battalion was paraded to be informed that it no longer existed, the men at once manifested their disapproval. Later on they held a mass meeting, and decided they would refuse to be broken up, and would insist on being recognized as the 19th Battalion. The 17th, 18th, and 20th Battalions each agreed to support the 19th Battalion in whatever action it might take. Tonight it was stated officially that the order breaking up the 19th Battalion had been cancelled. But the \nreassignment\n rearrangement\n\n* Some A.I.F. Brigades had been dealt with in this way, but the 5th Brigade strenuously objected. I believe this scheme became uniform throughout the A.I.F. after","186":"\n\nof the","187":" Battalion remained unchanged. I was transferred to \"B\" Company.\n","188":" 26th:- This afternoon the Battalion paraded in \nB\n battle order. The Battalion Commander (Colonel Forbes D.S.O) addressed us. The substance of his address was this: We had to go over the top somewhere, and then march behind English and American regiments. Colonel Forbes clearly indicated that the Germans would be forced swiftly to retreat, and that our Division would follow up, marching at the rate of 10 miles a day. \"You will sleep where you halt,\" said the Colonel. \"You will probably come in contact with large \ncivili\n civil populations, as our objective this time is the cutting of the German railway communications with Belgium at Valenciennes.\" Orders then were issued to be ready to march out of Frise at 9. PM.\n","189":" 27th:- Bivouaced on a hillside not far from Peronne, to which spot the Battalion marched \nlast\n during the night, having left Frise* at the scheduled time. Negotiated about 20 kilos, and in the course of the march, crossed the Somme per medium of newly constructed bridges at Cleary-Sur-Somme, afterwards proceeding along the main road to Peronne. While spelling on this road we saw a brilliant fight in the air. \nThe\n Allied searchlights had fired on enemy aircraft in the intersection of their rays, and there it shone like a huge silver moth. Suddenly, the Hun machine turned on its gun and fired in the direction of one\n\n* Before leaving Frise, I left \nall\n my shorthand notes, and the information I had collected, concerning Mont St Quentin battle, with chaplain. Captain Clune MC","190":" Battalion) to mind. Appendix B is a letter from him about them and a copy of the letter from, O\/C \"B\" Coy, who forwarded the packet to me when I was in Hospital in England.\n\nof the searchlights. A few minutes later one of our planes evidently had come on the scene and engaged the Hun; for bullets came down on him from above. These we could see, for the bullets flashed fire as they darted through the air, and thus their direction could be traced. The contest raged for some time, but the Fritz managed to escape.\n","191":" :- Moved from our position outside Peronne last night, and at 1. am today reached the Transport lines of the American Division with which we were to operate. The place was called Villiers-Faucon, and the American Brigade here comprised the 106th 107th and 108th Regiments of Infantry, nearly all being men from New York City. The place was in an awful state of confusion, and every time a plane could be heard overhead the Yanks get into a state of panic. Apparently, they were new troops, and the stunt they were engaged on at this time, they had failed to carry to a successful issue. An effort was being made to reorganize them, preparatory to their going into the line again; \nand\n it put new life into the Americans when they saw our Battalion arrive to support them. \"The Australians are here! The Australians are here!\" they kept shouting. Later in the morning they moved off, and we camped in the billets they had vacated.\n","192":" - Still billeted at Villiers-Faucon. Stragglers are coming back from the American line in dozens bringing\n\nbringing\n news of yesterdays stunts, which is still in progress. Americans complained of a lack of officers, and spoke in the highest terms of some Australian officer, whose name I could not ascertain, saying that he had gone among them and assisted in rallying them. From what they say, and the yarns that have been going round today, it is quite clear the Australians operating in the area immediately ahead of us, \none\n comprise the steady and advancing element.\n","193":" :- The","194":" Battalion left Villiers-Faucon this morning, and resumed the onward march. Rain yesterday had made the roads today very muddy and slushy. The sun shone brightly, and a cold wind swept across the country. We plodded through the blood-stained highway of Tincourt, thence past \non the\n Templeux, \nand\n reaching Hargicourt at noon, where we constructed billets; as it was stated we would rest here for the night. We are in the midst of great artillery activity. Near this place is the Bellicourt Tunnel*, where, some of the troops tell me, was concealed one of the German Corpse factories for boiling down human bodies to get the fat from them. Some men who had been working about here for the last two days told me they had gone into the tunnel where they had seen mutilated German bodies, a big boiler, and a profusion of grease. \"It’s a boiling down factory \nall\n alright,\" they exclaimed. Not being allowed to leave my platoon, I could not \ntherefore\n\n* I subsequently ascertained that a canal enters the hill South of Bellicourt by an arched brick tunnel, which bears the inscription: \"Napoleon , Emperor and King, opened the canal of St Quentin which unites the basins of the Seine and Scheldt, in 1802\" Germans took shelter here.\n\ngo to see things for myself. Some \nof\n other men camped about here disputed the Corpse Factory theory, and said the chamber in which the dead bodies and the boiler were, had been used as a cook house, and that a British shell had bored through the wall and had exploded inside thus mutilating the bodies I consider the latter explanation to be the correct one* At 6 PM came the order :-\"Get ready to go up to the line in half an hour’s time.\" We all got a good issue of rum, and by 7 P.M. were on the march, the road leading into the line being for the most part covered with a layer of wood. Such are generally spoken of as \"Corduroy roads\". We were now right in the heart of the Hindenburg Line. As darkness came on, the enemy fire increased, but being in good condition after the rest at Frise the men paid little \nregard\n heed to the shelling at this stage.\n\n* Being interested in this, I examined the newspaper reports on the matter while in Hospital, and there found the correct explanation. This is the evidence of Captain C.E.W. Bean : \"In the wall is a hole bored clean by a British shell which penetrated and exploded inside. thirteen Germans were lying there with the dust of that shell explosion over them. One had been thrown into a copper, one behind a wagon wheel, and the rest on the ground.\" Anzac Bulletin No 92,p","195":" 11th, 1918.\n\nThis gruesome subject was written up and discussed at great length \nby\n in the London Press, and a lot of arguments, and evidence were adduced to support the Corpse factory theory. Many of the English and Australians, whom I met about Hargicourt, really believed the story. When being brought back from the line, on 3rd Oct, wounded, I heard the driver of our wagon on the subject. He had seen the place and said: \"it’s no corpse factory.\"\n\nMap 2\n\nNote :- This map shows area of Battle of Beaurevoir described in pages 130 to 139 of my Diary. Heavy black line shows \nthe\n where the front line of battle was on","196":"\n\nF. J. Brewer\n\nFor miles behind us and before us the road* was crammed, jammed, and often blocked with traffic – wagons, motor lorries, ration limbers, Red Cross cars, ammunition limbers, batteries of artillery cavalry, traction engines, dragging huge guns, water carts, tanks and columns of infantry. All were struggling forward in the dark. Shells were bursting more freely around us, horses kept kicking and jumping about, and vehicles bumped into one another. Men shouted orders in wild tones while the columns of infantry somehow wormed themselves \nitself\n along the road. At length we got into the village of Estrées and while passing through it, were subjected to a fierce shelling. Later we crawled into a shallow trench where we remained several hours under incessant fire. There were no regularly-dug trenches in this area, and what had been dug, were not much better than gutters. We established our company headquarters in a battered trench affording very little protection, \nbeing\n so close to the enemy artillery that we could see \nthe\n flashes from the mouth of their cannon. The rest\n\n* I was unaware of what we had to do when the above notes were made, but some \nweeks\n days afterwards I learnt exactly what we had done. We were placed in the trenches in front of Estrées on the 1st Oct, and were facing the third and last line of the Hindenburg System which runs from Beaurevoir to West Wiancourt, and Ramicourt. This line of defence was usually referred to as the Beaurevoir-Fonsomme line and crossed green and open country. By smashing this line we had definitely passed that gigantic defence system, the \"Hindenburg Line\".\n\nof the 20th Battalion sought cover in a sunken road. Previous to out going in to this position I had been detailed as guide and runner to \"B\" Company Headquarters, a very \ndelicate\n unpleasant and responsible job, to say nothing of the risk. When we took over this position from another Australian Battalion, the warning was :- \"Don’t show yourselves, or you will be cut to pieces with artillery.\" It appeared to me we were being enfiladed.\n\nOctober 2nd :- Last night and this morning \nthe\n shelling \nbecame\n terrific. Showers of whizzybangs, 4.2, 5.9, 8.9 and 10 inch shells came tumbling on \nto\n us like \nhail\na continuous hailstorm, evidently, the enemy \nwith\n was operating with massed artillery. The front of our trench was poundered, and re-poundered, and plastered with an intensity that never gave us a respite of ten minutes. The roar of the explosives \nabout us\n rolled across the ridges behind us echoing and re-echoing \nall\n night and \nlong\n day. In the language of the boys \"Jerry was dropping iron foundaries on us,\" To make matters worse, it rained \nin the\n last night. Was kept busy running across the open taking messages to & from \nthe\n officers in the sunken road, and nearly got \"skittled\" by a burst of machine gun fire from an enemy outpost. While crouched in the trenches we could \nher\n hear the booms, or that vicious characteristic sound, \"Ker-rup\", \"Ker-rup\", of the \n\nenemy batteries. Then we would crouched closer to earth \ndown\n listening for the screams of the on-coming shells. Had no food all day. Had to run down to Battalion Headquarters, and found the Colonel and Adjutant in a big German dugout* 30 feet below the surface \"How are things going?\" asked the Colonel. \"Pretty rough up there\" I replied. \"Keep out of sight as much as possible going back,\" said the Colonel, as he dismissed me.\n\nOctober 6th :- Am wounded and in hospital at Rouen. We held the line all the day and night of the 2nd October, and for over 30 hours \nwe\n remained in this trying \nterrible\n position, waiting for orders, and expecting an attack from the enemy at any moment. At last the order came to move \nIt was\n at \nnow\n 10 o’clock \nPM on\n the following morning, \nthe\n 3rd October. At midnight \nthe\n the four Battalions of the","197":" Brigade were lined up on the tape. My company was stretched along a roadside, and had not cover of any sort. I know the positions of the","198":" Brigade battalions were thus :- the","199":" was to go before the 18th battalion and the 19th before the 20th Battalion; or in other words, the 17th and 19th Battalions formed the first move of the advancing troops, and the 18th and 20th the second wave. To the best of my knowledge, the disposition of the other troops were, the 7th Brigade was on our left, \nand\n the 6th Brigade was behind us in reserve. We were co-operating with a British \n\n* Keeping the German Infantry so much under cover rendered them, in the opinion of the allied private soldiers, unfit for the open warfare which preceded the close of the war. The Australians fought better in the open, than under cover.\n\nDivision. \nWe\n Were told our objective was the village of Wiancourt. The enemy, \nwho\n must have suspected our presence and preparations as he shelled us with terrific energy; but it was too dark to see how many were being wounded. At 4 a.m. \non the\n 3rd October, two hours before zero*, a storm of whizzbangs and gas shells came down \non\n upon us; and the gas wrought great havoc amongst us. A shell burst but one yard in front of me; being \nBeing\n prone on the earth the stuff missed me. Was shaken up a bit, and my ears were stinging and ringing. In the face of this awful trial, the Aussies remained perfectly cool, and smoked their cigarettes with the burning ends concealed in holes, or behind someone’s back. The boys, the middle-aged men, and the old buffers stood their ground \nin the face of\n before this avalanche of death with a steadiness that could not have been surpassed by the best disciplined troops in the world. Time wore on, and at last \nthen\n came the dawn. \nof the greatest day of my life,","200":"\n The zero hour, 6 o’clock was close at hand. Waiting for that hour is indeed the biggest moment of the war, to those directly interested in the impending attack. Exactly at 6 a.m. a solitary gun boomed, \nIt was\n the signal for the action to begin. One minute later there was a terrific crash; thousands of cannon were discharging their contents on the enemy lines. The plan of attack was, \nfor\n the first wave\n\n* \"Zero\" means the hour appointed for the barrage to open an attack.\n\nshould travel 1000 yards across ground mined, wired, and trenched, and then secure the ridge before Wiancourt; the second wave had to capture the village itself. The barrage was falling in green fields, a most unusual sight to men used to sandy shell torn tracts of country, and travelled at the rate of 4 minutes to the 100 yards. \nWe\n The troops had to wait on the tape \nfor\n six minutes to give the barrage a fair start. Then off they went, men and shells together, and above them, those \neye\n \"eyes of the Army\", the aeroplanes. With flashing eyes and trembling limbs the boys of the 20th cried: \"the old 19th is off\". Away through the grey dawn moved those dauntless high-spirited men of the 17th and 19th with perfect discipline. The scene never shall leave my memory, the scene in which their shadowy forms marched through the smoke of battle. The spectacle was magnificent, \nand\n filled us, who were to follow them, with a spirit of elation. \nHow\n Now it was our turn, \nand\n We advanced with steady step in platoons, separated and arranged in single file; but the boys before us were going forward in extended order. With a most majestic sweep the grand barrage danced before us as a mighty whirlwind sweeping down to avenge our dead, and to scatter our foes. Behind us \nthe\n thousands of guns were barking incessantly, before us the shells which they cast forth, \nwhere who\n were whistling, hissing,\n\nscreaming, \nand\n crashing and throwing up showers of dirt, smoke, and iron, away in the distant ridges the 12 and 15 inch shells \nwere\n operated like earthquakes. The whole battle field now was a mass of smoke and flying iron. The German \ngunners\n artillery quickly replied and laid down a heavy barrage behind us, and the enemy machine guns \ncommenced\n spat viciously. We were now in close contact with the enemy, and our Lewis gunners replied, severely spraying the potholes where enemy machine guns were posted & operated. \nBut\n The enemy’s machine gun fire became hotter, and our platoons, which had been pressing onward steadily, \nwere\n being obliged to halt, \njust fell on one knees\n reduced themselves \nitself\n as targets, this being accomplished by each man dropping down on one knee. The bullets swished and hissed about us \nin all directions\n for Fritz swept the field with many of these deadly weapons. Our men were \ngoing down\n falling now; some already had had been killed. Again we pressed on with the 19th still moving, \nbefore us\n bombing and \nbay\n bayoneting \ntheir\n its way forward with fatal precision. Snipers next took a hand in the fray, and succeeded in knocking over some more of our fellows. \nAt last\n Next we encountered \n had reached\n the first row of a series of immense barbed \n-wire entanglements – bands of closely-woven wire 10 feet thick. Therefore, we were held up, and had to rush into shell holes for cover. Five \n\ntimes while in one of these \npositions\n holes a sniper fired at my head, and five times he missed. Several of the bullets knocked the dirt into my face, and a lump of earth, so disturbed, blackened the eye of a chap lying next to me in the same hole. Suddenly a tank began to rattle in our rear. Up it waddled through the smoke, and bore down on the bands of wire which it smashed as if the structures had been a mass of cobwebs. Plonk! Plonk! Came a couple of enemy shells and the tank was put out of action. Almost at the same instant, a shell struck one of our aeroplanes, scattering its parts, as a sportsman gunshot \na\n would disturb the feathers of a bird hit \nshot\n on the wing. Game to the last the pilot made a jump from his machine. He got clear, but the wreckage fell on him, and, I believe, he was killed. By this time we had got through the gap in the wire and were right in among the Germans, firing point blanc and bombing machine gun posts. Germans came popping out of holes like rabbits, and as thick as rabbits. With hands up they called for mercy. Sometimes they got it, and sometimes they did not. As they rose out of their holes like hobgoblins rise from under the stage in a pantomime these terrified Huns appeared as if out of blocks of wood. In \ntheir great\n grey great coats, which almost concealed their ugly\n\ntrench boots with their close fitting shrapnel helmets, fantastically camouflaged, and blowing like grampuses, they seemed the strangest and most frightened creatures in the world; \nas\n they shivered and screamed for mercy in the wan light of the morning. One big fellow came racing \nup\n to me or rather hopping in the style of a kangaroo, to surrender. There was not an ounce of fight in him, and his big fierce moustache wagged about as if it were on elastic. His broad features were distorted with fear; \nand\n he gave himself up with all the actions of a madman. A new feature in the strife now became apparent – the exploding of mines. Along the ridge at which we were advancing vast \nVast\n caverns opened in the earth, and spat forth volumes of sparks and white smoke. The whole hillside was bursting open in this way, rocking the earth beneath our feet. The glory and the terror; the overpowering thunder of the massed artillery of the Combatants; the forest of flashing fire, mingling with the dense stinking smoke; the dauntless aeroplanes that rode forward on the edge of barrage; and the unbreakable line of redoubtable Aussies; moving ever onwards and sweeping the enemy before it in confusion, filled me with a strange and wild enthusiasm so \nso that\n that the grand panorama of victorious achievement reeled before my eyes as a dream, not quite an earthly dream, but a dream in which the reality and unreality mingled in an \n\nunearthly manner, making a strange scene of this unrestrained lunacy of human beings, bent on the destruction of each other. Mixed though this impression may seem in the description, it just about expresses my extraordinary feelings and impressions in those mad moments. The first wave gained its objective, and the 18th and 20th Battalions then opened an assault on the village but were repulsed. Later reinforcements came up, and by 6 o’clock PM. our troops I afterwards learned were holding all positions gained in the battle* and the Germans were retreating towards Montbrehain. I took half a dozen prisoners, and in \"Souveniring\" them, I found that we had been opposed by the 222 Infantry Division. From one of the prisoners I took what I think, and as far as I can read the German text, appears to be a certificate+ that the holder won the Iron Cross, II Class, in the field on","201":" It is signed by the \"Generalmajor und Kommandeur der 222 Infanterie-Division.\" In this affair I got slightly wounded in the foot. The pain was very keen, but I did not fall out. I stuck with the boys as long as I could. When I got through the second band of barbed wire I could walk no farther, and had to crawl into a shell hole for shelter. Shortly afterwards I was joined by one of my comrades, Private P. Begbie. We stayed together for some time, and then decided to struggle out\n\n* It is now referred to as \"the Battle of Beaurevoir.\"\n\n+ This is in my possession\n\nwhich we found to be not an easy task; for behind us was falling the German barrage, and there were still many snipers operating from holes \nwhich\n that had not yet been \"mopped up\". Assisted by several German prisoners, we limped back to Estrées. Dead, and helpless wounded lay \nall round us\n about us. Medical officers, - may their work be ever remembered! – were \nright up\n working in trenches that \nwer\n had been for hours under the German barrage dressing the wounded, prisoners as well, and then evacuating them. Stretcher bearers came wandering over the field, and \nGerman\n columns of prisoners could be seen concentrating on Estrées. I went down to the C.C.S. in a G.S. wagon, and saw in the daylight that road of horrors by which we made our way into the line on the night of 1st October. The mangled carcasses of horses – those faithful, lovable animals \nwho\n that come to our aid with food when all else fails – lay about in ugly heaps. The roadway itself was smothered in blood and littered with horseflesh. On each side of this causeway were small stocks of dead men, principally Yanks, who had been dead for days past – the strife being yet to keen to give them burial. Their puffed up flesh had turned black; frightful expressions appeared on their twisted faces; and their mortal wounds gaped hideously, some having heads broken open, others ribs smashed in, and\n\nothers again their insides torn out. Usually one hand was raised* above the heads of the dead, with fingers clenched, \njust\n as they had raised them at the moment of their dissolution. Arrived at C.C.S. this evening (3rd October) and left there by train at midnight for Rouen. Conveyed by ambulance to an Australian General Hospital on reaching Rouen next morning (4th October) \nWas\n was put to bed. This morning the ward nurse informed me I was \"marked for Blighty\". Left Rouen this afternoon in an Ambulance train, which steamed into Le Havre at dusk, and there boarded an American Hospital ship. She sailed at midnight for Southampton.\n\nEnd of Part III\n\n* \nUnder a barrage\n Shell fire causes the disengaged arm and hand involuntarily to spring up to shield the head. \n\nI noticed this in action frequently.\n\n1918\n\nEngland Again and Coming Home\n\nPart IV\n\nOctober 7th :- Got my first glimpse of Old England again at 8 a.m. this day at which hour we saw the coastline of the Isle of Wight. The morning was bright. The sun danced on the sea. How joyous are my thoughts \nthis\n today! What a sense of relief to be out of the terrible drama on the Western front! My mind seems, as it were bruised by the forceful effects of the great Conflict, and I am not yet able to \ncompreh\n realise the fact that I am bound for a land of peace, that I am \nnot\n really out of the strife. I seem to doubt it. Perhaps, the sense of relief is too great and \npo\n overpowering to allow my \nmind\n mentation to operate its proper poise. We are all, more or less in the same dreamy state. \nWe\n Reached Southampton about 10 a.m., and \nwere\nconveyed by train to Devonport. The train stopped at Exeter where the ladies of the Red Cross Society in the Old English city, met us with beautiful refreshments and lovely tea. What happiness! How \ngreatf\n grateful we all felt \nto\n for the thoughtfulness and kindness. To each man some of the ladies distributed a specially prepared postcard* which \nthey\n could quickly be filled in. These were then collected by ladies who stamped and posted them.\n\n* Appendix 14 was the card I received and filled in.\n","202":" :- In bed at the Devonport Military Hospital. Am in \"D Upper\" ward, which is in charge of Sister G.M. Wylie. This being one of the old established military Hospitals, everything is carried out in regimental style, even to the making of our beds.\n","203":" :- A lady representing the Red Cross Society (Australian Section,) came to my bedside today, and gave me a hair brush, a comb, soap, toothbrush, shaving brush \nand\n Australian newspapers, and cigarettes. She told me the principle of the Australian Red Cross Society was \"wherever there is \nan\n a wounded or sick Australian soldier we must find him, and give him something\". As far as my experience goes, that principle, I can say, was always enforced to its practical limit.\n","204":" :- Still in bed. Near to mine is that of Sergeant H.C. Hull of the 107th American Infantry. He is a decidedly interesting chap, and has seen active service in Mexico. In civil life he is a cartoonist, and a contributor to the American \"Life\". We had many \nintere\n long yarns about the Press, literary and pictorial. Between us, we had designed a series of articles* entitled \"Should we show the Huns Mercy?\" Subjects, such as German Machine Gunners (as we knew the facts) camouflaging themselves with Red Cross Brassards, were to be treated; I was to write; he was to illustrate. The joint production was to be sent to New York\n\n* Changes in the hospital, and other inconveniences, prevented the execution of our \nintentions\n designs.\n","205":" :- Am now getting about on a stick. Devonport and Plymouth \nare\n form one city. The harbour is very beautiful, and of all the ports I had visited, this reminded most of Sydney Harbour. \n","206":" :- Strolled up to the old citadel of Plymouth, and inspected it; and also the Smeaton Lighthouse, erected near it, and now a curiosity, as the \nthe\n spot it once occupied is now lighted by the modern Eddystone structure, which I saw this afternoon, shining like a pillar of marble, six miles out \nto\n at sea. Next I stood on the spot where Sir Francis \npla\n Drake played his famous game of bowls when the Spanish Armada hove into sight. I looked down upon the same natural scene and to that distant headland, beyond which the Spanish fleet was sighted by the old Sailors of long ago. The spot is known as, Plymouth Hoe, and is well grassed and neatly laid out. A magnificent statue of Drake is a feature of the Hoe; I saw a group of Australians reading the inscription \nwith\n with much interest.\n","207":" :- Went to see the Barbican at Plymouth. This curious survival of the Marine architecture in vogue when the size of shipping was limited, is situated in very quaint surroundings. The buildings are of the stunted kind, and some of the streets so narrow that they\n\nresemble the convolutions of sea serpents or gigantic eels. Old counting houses with solid oak doors \nwhose\n brass knobs and plates \nsome\n polished with scrupulous care – peep among the ancient walls of fish, and ship chandlers’ shops; they reveal a date belonging to the","208":" Century, and recall those distant times when the administration of India was under the dominant influence of Commercial houses. As I walked from the citadel to the Barbican, the smell of salted kippers struck my nose, and then came a current of air smelling strongly of good old British beer. This latter smell, I subsequently discovered, issued from the little window of the wee \"Mayflower Inn\", situated \nright\n opposite to where the Pilgrim Fathers embarked in their frail craft, \nand set for the\n for the then distant shores of North America, there to perpetuate old Plymouth by founding the New Plymouth. The exact spot is marked by a granite stone set in the Barbican, bearing the date 1620. Hundreds of American Soldiers and Sailors visited this place.\n","209":" :- Discharged convalescent from Devonport Hospital, and sent to Dartford Hospital, 14 miles from London.\n\nNovember 7th :- I hear a solitary railway engine screaming \"Cock-a-doodle-do\".\n\n\"What does that mean – peace?\" exclaimed a comrade in Hospital Blues lying on the bed next to mine. \"Possibly,\" I replied.\n\nThen more whistling was heard, and all the whistles in an around Dartford, including those of the streamers in the adjacent river Thames, swelled into a chorus, a continuous screaming chorus. \"Surely it is Peace!\", I remarked. \"No, it is an air raid,\" said a comrade, who still believed the end of the war was far off… yet* there is no mistaking the significance of the Sounds – they came from the lips of Victory. Has the old race added another, and the mightiest of military achievements, to the proud record of its past success in Arms, on land, and sea, and in the air? I listen with eager ears and fluttering heart whilst the sounds of triumph are ringing through the air. \"It must be so,\" I exclaimed looking at the clock over the door of the hospital ward, 15A. It is just 5.20 PM. I am imagining what the scene is like in that grand capital of the Empire, and how I regret my wounded foot will not carry me thither to participate in the enthusiasm of the moment. How many more than I, regret likewise – those poor chaps with missing legs and arms, those on crutches and in chairs; yet they all hop about, or send their wheeled chairs rushing helter skelter, overcome with joy and excitement. The nurses flit from ward to ward with a marvelously elastic step, and \"WAAC\" girls are leaving their teapots, cups, brooms, cookhouses, and\n\n* The remainder of this entry, with the exception of the last sentence, was written while the events described were actually taking place.\n\nkitchens to join in the mad rush to ask \nascertain\n : \"What news, Diggers?\" In fact almost the whole hospital staff has raced off to the town of Dartford where some of the boys reported that \"Free beer was flowing.\" A new moon gleams \nd\n in the darkening evening sky. Will it shine on a peaceful world again? Tomorrow I shall know… The man selling the evening papers assures me an Armistice was signed at 2.30 PM today.\n\nNovember 8th :- Alas last night’s rejoicing was premature. The report of Armistice being signed yesterday was circulated by Reuter’s Agency; later the same Agency contradicted the report as being untrue. But there is no mistaking the trend of events. The collapse of Germany is imminent. Within a few days the last dawn of the last day of Kaiserism and Kultur will break, and then that false world, created by the demons beyond the Rhine, and lighted by the fires of hell, will be destroyed. Ormuzd and Ahriman again have contested for the mastery – again the principle of good has triumphed… When shall the news come?\n\nNovember 4th :- Armistice not yet signed, but the Kaiser has abdicated. Hohenzollerism has been swept from the throne of \"United Germany\".\n\n\"Gott mit uns\" can no longer be the claim of a beaten and broken people. Tomorrow may bring the good news. Kings are falling fast these days. Left Dartford for Weymouth today, via London.\n\nNovember 11th :- The news has come at last! It reached me today at Littlemoor Convalescent Camp, Weymouth, at 11.40 a.m. We were called from our huts to attend a muster parade. The great announcement that the Armistice had been signed was made in a very shabby way indeed. A talkative, egotistical sergeant of the \"Eggs-a-cook\"* crowd, addressing the men on parade said :- \"All the men in these ranks (indicating the number) will be in lying picket tonight. Peace was declared at 7 o’clock this morning. Your job will be to see that the beer canteens and pubs are not broken into tonight. Dismiss.\" That is how I learned officially the magnificent news that would ease the hearts of all the world.\n\n* The shapes of the shoulder colour patches for the five Divisions of the A.I.F. in France were as follow here :- \n\n1st Div \n\n2nd Div \n\n3rd Div \n\n4rd Div \n","210":" Div \n\nIt will be noted that the shape of the ","211":" Division patch resembles an egg. My friend Gunner Lee \nwho\n referred to on page 114 of this diary, had been in Egypt. He told me how the name \"Eggs-a-cook\" originated :- In Egypt the supply of eggs is inexhaustible. Every dirty Arab kid sell them – cooked. You hear \"eggs-a-cook\", everywhere. Consequently, when the other Divisions saw the shape of the colours of the Third, they promptly called them, \"Eggs-a-cook\", They put more relish into it, because the Third Division was a very long time in England before going to France.\n\nThe boys cannot yet realise it – \"Apres la guerre\" is too gigantic a fact for them just yet. Some are saying: \"the barrage has lifted\". Others are thinking of home, \nand are\n saying :- \"now we’ll see the old place for sure\". And others again are discussing the possibilities of transport home, and the routes likely to be taken. The bitter moments of the front line are passed, for ever, I hope. I seek solace reading in the \"London Daily Chronicle\", the masterly victory speech of Lloyd George at the Lord Mayor’s banquet in the Guild Hall. Let the Boy Scouts forth into the highways and byways of all the land, and there let their bugles ring out the last grand \"All clear.\" I have survived the great storm, the perils of the sea! \nand of\n the battlefields of France! God be praised! He chose our Empire to be instrument of deliverance for all the oppressed of the \nearth\n earth.\n","212":" :- Today has been a great day in England. The people of Weymouth and the surrounding villages, decorated their houses with flags, giving prominence to the Australian banner. The bells of ancient Churches, the same, perhaps, that pealed for the victory of Waterloo a hundred years ago, are again sending forth their Joyous chimes. The boys are thinking of home tonight, and picture to themselves\n\nwhat a scene of wild enthusiasm there will be in Australia when the news will be known.\n","213":" :- Left Weymouth on my hospital furlough, the period thereof being 14 days. Left Euston Station for Ireland tonight. Train crowded, so I got into the Guards Van, and slept on the mail bags with some other soldiers. It was bitterly cold. At Chester the Guard, who was a very decent fellow, made tea and gave me a cup, which I much appreciated. \nReached Holyhead\n \n","214":" :- Reached Holyhead at 5 a.m. Embarked on packet steamer for Black Wall. Passage across the Channel very rough. Arrived \nin Dublin\n at Kingsbridge Station Dublin at noon.\n","215":" :- Not much impressed with Dublin. It is a very dirty and a very melancholy place. Visited College Green, and was sorry to see the doors of the ancient Parliament House closed \nto\n against the Irish tribunes. Saw the Four Courts, and the Wellington Monument in Phoenix Park.\n","216":" :- Left Ireland for England, and arrived back in London at ","217":" p.m.\n midnight.\n","218":" :- Visited the English Law Courts, and spent the morning listening to trials in various courts. In the Prize Court, the Attorney-General of England, (Sir F.E. Smith*) was\n\n* Since elevated to the Woolsack with the title of Lord Birkenhead.\n\nconducting a case. It was not much impressed with his style of speaking. In this same court I also saw the Solicitor General (Sir Gordon Hewart)\n","219":" :- Looked through the Tower of London, \nand\n spent some time examing \"Traitors Gate\", the prison of Sir Walter Raleigh, and the ancient Ordnance. Was very amused to see \nan\n a rook perched on a heavy cannon that had once been \nin\n the property of Solyman the Great. The day was dull and foggy, and made the place more lugubrious than usual.\n","220":" :- paid a second visit to the Palace at Westminster \nand\n Walked about the floors of the House of Lords, & the House of Commons. The carpet on the floor of the House of Commons was quite threadbare, all the colour and pattern having disappeared, leaving in its place, a dirty black surface. The statues of the great statesmen of England, and the paintings of \nhistoric\n incidents in our constitutional history, reveal exquisite art associated with high inspiration. This evening dined with Mrs MacDonagh* of Ashley Gardens, Westminster. As we motored past Buckingham Palace to the restaurant, & along \nPall\n Mall, we saw thousands of captured German guns, lined on each side of that noble avenue. It was\n\n* This lady was one of the suite of Lord Brassey when he toured \nround\n the world in \"The Sunbeam\". She spoke six languages.\n\nSomething, indeed, to be able to show to her - I confess I felt proud to be able to do so – the spoils of war; and I pointed out to her some of the longest guns, saying, \"these were captured by Australians.\" It was saying a good deal, when one looked upon that huge mass of captured cannon, ranged before the proudest palaces in the world.\n","221":" :- Furlough concluded today. Reported to Convalescent camp at Sutton Veny, near Warminster.\n","222":" :- Walked in the Churchyard of the Sutton Veny church, and there saw the graves of many \ndeceased\n deceased Australian soldiers, marked with the usual humble White Wooden Cross. Many another churchyard in Wilts has received the bones of men of the A.I.F. These will be abiding links between the villagers, and the far country whence they came, and will become sacred spots for all time.\n","223":" :- Christmas Day. The ground is covered with snow, but the sun shines brightly. After breakfast I went for a long walk, alone, through the fields. Bells in the villages of Heylesbury, Sutton Veny, and Longbridge Deverel rang Joyously, and brought to my mind Cooper’s sweet lines:-\n\n\"How soft the music of those village bells\n\n\"Falling at intervals upon the ear\n\n\"In cadence sweet! Now dying all away,\n\nNow pealing loud again, and louder still,\n\nClear and sonorous as the gale comes on.\n\nWith easy force it opens all the cells\n\nWhere mem’ry slept.\"\n\nAs I approached the little church of Longbridge Deverel I heard the \nsweet\n Villagers singing Christmas hymns, and the solemn peal of the organ. It was a delicious experience, in \nthis\n a season of peace, to stroll through this old world scene, thinking of home and dear ones far away. Christmas dinner was served in good style, and the menu* contained a list of viands that was certainly an improvement on the usual rough fare.\n\n1919\n","224":" :- I now know definitely that I am on a boat roll for Australia, expect to be leaving about the middle of the month.\n","225":" :- Notified that we will embark at Liverpool on the","226":" inst in the \"City of York\". Handed in kit bag.\n","227":" :- It is 6.30 P.M. as I take up my pen to make this last record on English soil, I mean, as a soldier; for I hope again to set foot in dear old England, as a \nsoldier\n civilian. Within half a dozen hours from now we will fall in on the parade ground with \nour\n sea kit, bags, and at 3 P.M. tomorrow will march to Warminster, there to take train to Liverpool, where we are to embark on the \"City of York.\" I have just returned from an evening walk. As I strolled back to Camp, the daylight had nearly gone. The moon, almost full, shone weakly\n\n* Appendix 15\n\nthrough the mist that sat on the surrounding country. \nand\n As I watched the vane of Sutton Veny Church fade slowly into invisibility \nAt this time\n my mind raced back to the moment when I took the oath to serve the King, and I rapidly surveyed the tremendous events in which I have been an actor. How many poor chaps have I heard sigh for this night, for this time when we are about to set out on our return to Australia! Alas, how many are now dead! How different now is the demeanour of the men who are about to embark from, what it was on that dread day when they left their dear Homeland. Thoughts of seeing my father and \ndear\n mother, brothers and sister, and my wife, together with the delightful anticipation of \nseeing\n meeting a little daughter, born to me while I have been away, make the prospect of leaving for home, one of the intensest Joy.\n","228":" :- On board \"City of York\". The troops left Camp at Sutton Veny at 4 a.m. today with thoughts of Aussie uppermost. Then they sang \"Keep the Home Fires Brurning\", and \"Goodbyee\". The No 1 Command Depot Band \nplayed\n marched at the head of the Column. It played us through the streets of Warminster in the wee hours of the morning. Early as it was lights quickly appeared in the windows of the houses, and the heads of girls, \nheads\n men, and old women, popped out of the quaint windows say\ning\n \"Good-bye\". We\n\ntook train at 4.45 a.m., and four and a half hours later reached Birmingham. Where ladies entertained us with tea and cakes and fruit.\n","229":" :- Sailed from Liverpool before daybreak.\n","230":" :- 9 a.m. Passing through the Straits of Gibraltar. Before me on the European side stretch four hills, ridges, or mountains, rather barren. The land just after entering from the Atlantic is hilly and a mass of sand. Close to the sea, which \njust\n now is very calm, and the sky sunny, are while specks scattered about, \nwhich\n apparently houses. At the base of the fourth hill, where it touches the water, is a small Spanish town, whose white buildings gleam brightly, and at the head of this town, standing out prominently, is the lighthouse. Stray clouds are drifting along the top of this high hill… On the opposite side looms the rugged coast of Africa. Vast masses of earth pounded and pressed into innumerable extraordinary shapes by the hand of Nature… Now I am passing the grand fort which rides on the sea like a vast pyramid, whose sharp outlines have been rudely defaced by the hand time. It is majestic in the extreme, and struck me as being symbolic of the strength of Britain. 3 PM. We are leaving\n\nthe straits, and entering the Mediterranean. A church parade has just concluded, and the boys are \nnow\n singing some \nof the\n A.I.F. songs, while one of the Diggers plays the piano… 6 P.M. My first evening in the \nMeditt\n Mediterranean – the most beautiful, peaceful and enchanting evening imaginable. The opaline atmosphere is losing the lustre of its tints in the dark shades of the approaching night.\n","231":" :- At noon \nwe had\n passed the city of Port Said, \nand\n An hour later anchored within several hundred yards of the mouth of Suez Canal, and \nright\n astern of the R M.S \"Osterley\", which is bringing a large number of \"Anzac wives\", or \"English War Brides\", to Australia. The women crowd round the stern of the \"Osterely\" and greet our boys with cries:- \"Hello Digger\" etc. The Diggers were \nare\n not at all demonstrative \nabout things\n, and calmly surveyed the crowd, looking with a rather sympathetic eye on the Aussie hubbies, who stood beside their wives. \"Are you going to Sydney?\" yelled a Digger on the \"City of York\". \"Yes\", screamed several women. \"Wait till our ‘arbour sees you\", he replied, naively insinuating that the beauty of the harbour would contrast strongly with \ntheir\n lack of beauty. \"Who’s getting off at West Australia?\" queried the same\n\nDigger. \"We are\", answered several diggers on the \"Osterley\". \"Well dump your missus before you go ashore\", \nreplied\n said the man, who had asked the question. One matron, in her military uniform, curious, as women ever are, in these matters, came up to the bow of the \"City of York\" to inspect her sex on the \"Osterley\", and then give Judgement. With her, was another Army nurse. With a supercilious and disdainful air they surveyed \"these women\", and then declared: \"if our boys mix with them, then that is the class for them to marry.\"\n","232":" :- Just got out of my hammock. Heard the troops saying we had entered the Canal \nin the middle of the\n last night, and that we were now in \"the Bitter Lake\". Going on deck, I saw a large patch of blue water in a vast panorama of sand. – a large turquois set in gold, so it seemed, with the \ngolden\n yellow sparkling sand rimming the \nsurface of\n the lake. \"That is Ismalia on the right of us,\" said some Anzacs on board, who had been there, \nand\n who of course, knew something of the place. It appeared as a collection of low-lying buildings with one tall minaret shooting above the general level of the mass of roofs and trees, scumbling across the landscape, with that definite scrubbiness, which pleases the eye of the \n\nLandscape artist. In the foreground, and close to the shore, appeared the \"Gyppo\" boats, whose masts stretched \nthemselves towards the \n sternwards, as if ambitious to convert themselves into a complete circle. On either side of the Canal, and for considerable distances, there were \nare\n two protecting lines of barbed-wire entanglements, and other evidences of military occupation. Before noon we passed a Flying Corps Camp on the bank of the Canal. Tommies \nin khaki\n crowded down to the \nbank\n edge, and shouted:- \n\"Are you going home?\n \"Where are you going?\" Home, you dopes, home,\" shouted a Digger. \"Where else do you think we are going? Are we looking for another war?\"\n","233":" :- Left Suez late last night. It is a beautiful morning. The sea is as \nsmoo\n smooth as a sheet of glass. We are now in the Red Sea, or about to enter it.\n","234":" :- About noon today \nwe\n saw on the horizon, the first glimpse of the Coast of Ceylon. Gradually it rose higher and higher out of the water. Then \nthe\n palm trees became visible, next the breakwater and the \nsquare set\n houses. We passed into the Colombo harbour and cast anchor at 3 o’clock.\n","235":" :- Went ashore at Colombo today. The natives are great\n\nthieves, and their policy is to take one down on every deal, trusting to score on one’s lack of knowledge of the currency.\n","236":" :- At last we saw dear old Aussie again, our first glimpse being the coast near Fremantle. The boys had been waiting patiently to see it particularly the \"old campaigners of ’14 and ‘15\". About 10. am the O\/C Troops called us on parade and \ntold us\n said, much to \nof\n our surprize, that we were to be allowed ashore. \"You are coming home,\" said he, \"as victorious Troops, and the people want to see you and welcome you home. We shall be placed in quarantine for a short while, and then go ashore.\" \"Oh,\" exclaimed a few doubting Thomases. The doctor and pilot came aboard, and after being declared a clean ship, the \"City of York\" made for the harbour, and entered the breakwater, intending to berth at E Shed. Fremantle. All arrangements were made to carry out the landing. As the ship came up to the wharf \ncame up to the wharf\n we saw a man in a white suit waving his arms in semaphore fashion. He signaled to the Captain to sent the wireless operator to his room to receive a message It was a message telling us we were not to land. It was a bitter disappointment, the torture, to us, was excruciating. The old Campaigners were touched to the quick.\n\n* The doubt went against the troops, as events turned out; for the Influenza precautions, kept most of the \"victorious troops\" well away from shore.\n\nThe Captain growled out from the bridge to the First Officer \"We will turn round and go back to the anchorage.\" He was in a tremendous passion. The men were knocked speechless. We went back to the anchorage, & at 8 P.M. the West Australians left the ship in a tender for the Shore.\n","237":" :- Sailed at noon \ntoday\n en route to Adelaide.\n","238":" :- Arrived at Adelaide this morning; left later for Melbourne.\n","239":" :- At Melbourne. Anchored off New Pier, whence I had embarked nearly two years ago.\n","240":" :- Saw Tasmanian coast for the first time, about noon.\n","241":" :- At Hobart. Tasmanian soldiers disembarked, & the \"City of York\" left for Sydney at Midday.\n","242":" :- Off Sydney Heads, time nearly midnight.\n","243":" :- Left the \"City of York\" in a ferry boat. Landed at Woolloomooloo. Red Cross Lady gave me a flower and a packet of cigarettes at the wharf. Glad to be almost near home.\n","244":" :- Arrived at Brisbane. Reunited with my family.\n","245":" :- Discharged from the Australian Imperial Force having served 2 years and 3 months.\n\n"}}