{"Document Name":{"0":"Diary_0116","1":"Diary_0116","2":"Diary_0116","3":"Diary_0116","4":"Diary_0116","5":"Diary_0116","6":"Diary_0116","7":"Diary_0116","8":"Diary_0116","9":"Diary_0116","10":"Diary_0116","11":"Diary_0116","12":"Diary_0116","13":"Diary_0116","14":"Diary_0116","15":"Diary_0116","16":"Diary_0116","17":"Diary_0116","18":"Diary_0116","19":"Diary_0116","20":"Diary_0116","21":"Diary_0116","22":"Diary_0116","23":"Diary_0116","24":"Diary_0116","25":"Diary_0116","26":"Diary_0116"},"Date":{"0":"unknown","1":467.0,"2":468.0,"3":469.0,"4":470.0,"5":471.0,"6":475.0,"7":494.0,"8":496.0,"9":497.0,"10":498.0,"11":499.0,"12":500.0,"13":501.0,"14":502.0,"15":503.0,"16":504.0,"17":505.0,"18":506.0,"19":507.0,"20":508.0,"21":509.0,"22":510.0,"23":511.0,"24":512.0,"25":513.0,"26":514.0},"Entry":{"0":"\n\nLeft Mena Camp ","1":"\n\nat 7.10 pm. having received short notice to go the day before. I stored two trunks with Cooks. Consequently left with about 70 lbs luggage in all (Reg. 25) 3 trousers. 3 coats three shorts) under do. 3 underpants 4 - 5 prs socks 2 \tprs boots, 6 handkerchiefs rest made up in toilet gear odds & ends. Cleaned up \tcamp by burning all debris, consid amt. had a huge bonfire of same one of many \tbonfires that night at Mena. Everyone in high spirits on the March into £\tCairo, \tsongs & cheering from us & people nearby Cairo Main station arrived\n\nat 11 pm & then had to wait till 2.50 am before getting in train. Camped outside station on a grass plot. Everyone went in interval for food - I went to Continental & had supper there with C.E.W. also managed to see the Wells girls & Miss Knaggs & say goodbye\n\nGot in train 2.50 pm men went in well & fairly silently (Some had met friends with the usual result). Left Cairo at 5.20 am. Arrived at Alexs. 11 am 4.4.15 passing a French Camp on the way.\n\nMet Kay on wharf on to which train ran & he as detraining & embarking officer directed us to the City of Benares. SS. TA.9. 7000 tons.\n\n Wassell detailed to Minnewaska. Cabins comfortable. I have one to myself. \tEvening of 4.4.15 Archie & I went to the Italian Opera. Rigoletto. (starting \t9.30 pm ending after m.n.). Voted good all through, best we had heard, very\n\nDago audience & very enthusiastic. Got home 1. am.\n\n5.4.15 Watched some English Artillery Troops disembarking in morning. Ks army sturdier than Territorials. They have some huge Draughts, that evening left under “sealed orders”. Told as we left Harbour “confidentially” of course by O.C. that our destination was Smyrna.\n\nSoon after got a map of Gallipoli Peninsula, chaffed the O.C. Smyrna topic\n\ndropped. Boat rolling & pitching, listened to Skipper yarning about his trips\n\nacross Channel with troops to France, many narrow shaves, (e.g. Line of I was seasick that night also a lot more.\n\nrough & raining. Have on board. 1st Brigade. H Q staff. 3\n\nCoy. Eng. (Maj Cloughstorm) & us. - Wassell 50 horses & 27 men). Our\n\nofficers asked to do General Guard duty of ship Protest, effective.\n\nCalm & fine amongst islands. Passed Patmos (St John Baptist) 6 am. After Breakfast O.C. Major C-. gave instructions Troops on board. - into 3\n\nEschelons. 1st Fd Amb in A. amgst 1st get off. Water scarce on Gallipolli every man to take 2 days iron rations & fill his W.B. also fill himself before leaving to drink till he belches & fit he rejects to drink again the camel idea. We have to fight for water & then it may be poisoned. Any man disregarding these instructions to be severely dealt with. He jocularly asked what the medicoes\n\nwould do to test H20 would they try it on themselves (one officer has a dog on board he prizes) I suggested trying the water on the dog. considered by they way it was taken a rather good joke. He also issued instructions that water on board was to be rigorously conserved, no condenser Ltd amt. 6 pm entered Mudros Bay. Lemnos Is. an outer & inner harbour landlocked very good shelter. To North may be seen Mount on Is Samothrace with snow on top, to N.E. may be dimly seen Mt Athos the site of a famous Monastery on a peninsula of mainland of Greece. Women never been there. Several warships in inner Harbour. Q Elizabeth, a Russian Askold. (I saw her at Colombo) 5f... Former very formidible. Anchored right at head of inner Harbour. Trying various ways of carrying swag during day. Blankets & W.P.S. ware & iron rations to balance it in a bag & carried a la Swaggie N.S.W. will be able to cast it off while descending the ships ladder if anything happened.\n\n Practised loading the men into the boats subdivided section one\n\n boat load under M Millard other under myself, some good rowers, rowed\n\n around the Askold.\n\nIn morning our boat manoeuvred alongside A8. & they fastened together my cabin I am sorry to say on the side where they are together.\n\nAlready a stench from our side & poor ventilation visited a Naval Hosp Ship today a well known Indian Transpt. She has 200 beds 7 Surgeons aboard & 40 ratings including some London St johns Amb men who required a good deal of teaching Beds all swinging cots. Good operating Theatre electric steriliser etc.\n\n & a good Laundry. Altogether is a very complete unit. It is for the Navy only.\n\n They carry a few nurses, enjoyed the Row back.\n\n nil much of interest more Transports in & more war vessels\n\n Visited the Derflinger (a German Prize). 3rd Batt aboard, fine\n\n ship with an excellent Gymnasium aboard with electric appliances. (Horse\n\n Camel), visited Malda saw M. Stokes & brought him over to Lunch. He is on\n\nspecial duty with 3rd Brigade & likely not to come back to the Ambulance. Went ashore Archie & two others & walked to Mudres a good three miles walk. A higglepigeldy Village with narrow unpaved streets but everything very clean. Houses all built of stone in which Island abounds. Women very shy. do a bolt mostly when they see soldiers, probably used by now to Turks. Bought some chocolate & matches after much bargaining about the coinage\n\nIslanders like English Gold, in fact take any Eng or French money at face val not so Egyptian. Many understand English as they are Reservists & some hie from Australia. One we found who had worked in Cominos Sydney. People considered allround quite a superior type.\n\nThere are said to be many spies on island from Turkey we met the Guard bringing back a batch of people into the Town who had no passes. 2 women were brought back the other day & about 40 women in village started a demonstration. Guard embarassed, but firm. Arrived back in ship 1 pm everyone in Ship is Scotch from the skipper down (Glasgow man & very nice indeed manner like jarvie Hood.\n\nTuesday. By now there are over 50 vessels in inner Harbour alone. Big warships, mostly Transports, many minesweepers, (converted Trawlers) & destroyers & Submarines.\n\nWednesday 14.4.15. nil much of change. Took over some patients to the Hosp on shore going through French camp (Ordnance) on way saw French soldiers. Look very well in the new blue. Later saw some of the Famous Foreign legion in the village took photo. Later looked over the very fine Greek church no seats inside. A quaint old priest he burnt tapers for us all.\n\nThursday 15.4.15 Our boat is unloading over 1,000000 rounds Amm. seems to be a depot ship Tonight did censoring. Very funny in many cases. One man said he heard the Q Elizabeth had been punctured. Another who evidently had suffered alluded to a period as while they were “lousing\" in Mena. Others called the Censor bad names another said he was not allowed to write much & promptly did - 10 pages. One assured his people at home that the Turks are very barbarious. They mutilate the wounded & they gorge your eyes out. It seemed the sole purpose of many to make their people at home thoroughly miserable. These were mostly those in the safest jobs.\n\nThe ship is full of rumors as to when we go the no of the Turks etc their atrocities & so on but everyone is as happy as a lark. The only smudge on the landscape is that smell between the boats.\n\nFriday 16th Our boat shipping much timber for Engineers. Boys enjoy a daily dip in the sea. Climate is lovely like a Tasmanian ditto, unearthed the medicine ball today\n\nSaturday 17th. same old routine Boat beginning to get the same smell of the Horse boat. It seems a pity that they cannot be taken ashore like the troops.\n\n I took B ashore this morning & had a brisk walk to top of hill commanding\n\nview of entire harbour. In afternoon M. Millard & I took (C.E.W.) B ashore & marched out to east coast of Island, passed through a very pretty village & saw the women hard at work at a public washing place, big village, streets awful one street was the bed of a dried up creek au naturel with buildings springing up at either side. In the fields the flowers are wonderful Daisies\n\nbluebells & every variety apparently of Eng flowers & including the Scotch Thistle.\n\nOver at East coast from an eminence we made out in the hazy distance what apparently was the coast line about the Dardanelles also Imbros close at hand.\n\nSunday 18th Took more sick ashore & saw while there some wireless apparatus of which the Dynamos were run by. Douglas M C engines with fans on to cool. These are to be landed & are to transmit the range to the naval boats for their gunfire.\n\nAfternoon Poate & Welch visited the Q Lizzie as she is affectionately called. She is wonderful. Huge 15” guns exact to within 121\/2 yds. etc etc\n\nMonday 19th Orders to change places with Wassell. as he is to be aboard the Benares so as to get off with the bearers. The Tent subdiv is to stay on & not leave till one or two days later.\n\n In afternoon went over with OC & other Tin Hats, & took over from Wassell.\n\nA huge boat 15000 tons. Atlantic Cattle boat with good passenger accomodation has on board ANZac Army Corps H Q Gen Birdwood & Staff &\n\nalso 1st Aus Div. HQ Staff Gen Bridges & Staff. Also there are two Brigadier Generals & also for instance ADMS. etc. DADMS.\n\n I have 48 horses A sect transport, & all the Water carts & 27 men aboard. I\n\nhave no Hospital Duties to do. 1st Battn. is aboard in which are Carter & Thompson & Champion whom I know. Speaking after dinner with some Infant officers heard some funny tales One that Naval Authorities stopped a boat coming to Lemnos from Constantinople with 263 $ women on board intended for the Aust Troops. Also that in a Turkish newspaper appeared following That Australians had to be driven out of Cairo at the point of the Bayonet from the women that they were the best fighters in the world & were a wild long bearded lot of barbarians. Lets hope the Turks will not be disappointed as regards their fighting propensities. Also it is stated by the Naval Authorities that a Taube was over here about a week ago one morning at dawn.\n\nTuesday 20th from what we can make out in spite of all the Secrecy. The Landing Troops is going to be ticklish. Turks are supposed 70,000 on peninsula & are strongly entrenched & have many concealed batteries (50 have already been found). Also mines by land & sea.\n\nApparently there will be about three different landing parties in the Gulf of Saros under cover of the warships fire. Also it is thought that the Navy with some marines will earlier make a feint of landing farther up the Penin. Troops are Aus & N.Z English French & Marine nos I had better not put down There is I believe besides our fleet here another fleet at another island & here also \n\nare assembled a great many Greeks in little fishing boats who want to get in & have a go at the Turks.\n\nWednesday 21st A wet & Gusty day no sign of moving today. Hymethus blown ashore today, not in any danger.\n\nThursday 22nd nothing doing sick of waiting Gen Birdswood is really a delightful personage Capable nervy very alert & looks very sympathetic He goes among the Horses & talks to the men in the most simple & natural way. The Australians worship him already. I feel I want to see England more than ever now to see some of the same type.\n\nFriday 23rd Whisper it not there are mysterious preparations the hour is at hand. Afternoon Gen Birdwood & Staff goes off on to a warship. 3 cheers. 8 pm Gen Bridges goes off to another. Ditto. During the afternoon 4 or 5 transports steamed out of the Harbour, everybody happy.\n\nSaturday 24th. Underway at last skirting the West coast of Lemnos by 6 am. 7.20 pm SeeMt Athos. everyone expectant & excited. Our 1st Batt to go off early tomorrow morn under fire when way is clear after 3rd Brigade covers. Later 10 am Anchor in a bay at NE corner of Lemnos other Transports arriving during the day by the evening there are 8 here. Things quiet & at high tension amongst most officers. Afternoon The Troops are laughing & as happy as sand boys Are they going into battle tomorrow or down Sydney Harbour for an excursion. I would say the latter by their spirits.\n\nThey are to have reveille at 4 am tomorrow & leave shortly after 5 am. Have just seen some nice fresh bread issued to them.\n\n Some “just before the Battle Sayings & Doings”.\n\n Eh Bill we’re goin’ to lave a ‘ot breakfast termorrer: Yes. Bread & mustard.\n\nOh well said another if the Ammunition gives out tomorrow we still have the biscuits. A lovely satire on the hard biscuits.\n\nPersonally today I have taken care to keep my mind occupied with work the whole day, but really one feels very good spirited with so many cheery comrades all around.\n\nFunny this afternoon one or two have nerves. They saw suspicious looking boxes floating about in the bay near to the ship. They have been thinking they are mines & wanted to fire at them but since have decided they are only empty packing cases. One little chap assured me that you cannot be too careful I gravely agreed with him.\n\n10pm we sail at about 11.30 pm & after 3 am no more lights I will now go to bed & get a few hrs sleep, no I don’t go off tomorrow. I am in a safe job & probably will be on the ship 2 . 3 days more. Tomorrow ought to be a redletter day in Australian History.\n\n25.4.15 Sunday. 4.20 am. got up. went up on Deck, we are heading for a bay in area between Kaba Tepe & Nibrunesi point. Big warships are lying close into shore & several transports. Dotted about the water can be seen many boats & from the shore firing is plainly heard. The 3rd Brigade have\n\nlanded. 4.45 am the 1st big gun of a warship booms out. One row boat is seen floating about upturned. Many Torpedo destroyers are flitting round. Our ship A11. gets closer & closer till within about 1 1\/2 m of shore. Now can be heard plainly the firing & the machine guns. 5.15.am. A boat rowing is just off our ship in it a sailor is supporting a mate who is wounded in the head & half conscious. A little before 6 am a shell is fired from an enemy battery & drops in the water about 100 ft from bows of our ship\n\nBetween 6 & 6.30 am the 1sthalf of 1st Battn go ashore. A Torpedo Boat D comes alongside & the men swarm down on to her by the rope ladders Simultaneously. The Commander of this T B D meets me on deck & states he has many wounded, just prior to this about 75 wounded were put down in\n\nour vessels out of the Tow boats. These are the wounded of the 3rd Brigade & Sailors of the boats who were wounded before the boats reached the shore. Col Ryan & Marshall attend to them while I go down on to the T B D with the Commander\n\n \n\nto see the wounded A Pinnece arrives alongside for wounded She will take them to the Clan McGilivray. There are about 12 on board 3 or 4 very seriously wounded & nearly dead. 1. Fractured skull (bullet). 2 shot thro abdomen (It was no good leaving the abdominal cases on the Destroyer as the vibration & heat are so considerable. With the help of the jack Tars on the Destroyer we moved them on to the Pinnece. I nearly got a trip ashore as the T B D had cast off when I got on her, and I had to jump for the ladder on the side of the ship.\n\nThis work took me till about 7 am. I then went back & commenced with Col Ryan & Capt Lewers dressing the wounded. Fixed them up by 8 am. Then had Bkfst. & the second lot of infantry went ashore. Col Ryan & Lewers went with these & I was the only Military Med Officer left on board.\n\nThe Battle is getting fierce & the wounded tell me that when the 3rd Brigade landed they just fixed bayonets & rushed the 1st line of Trenches of the Turks who ran for their lives. It was fine he said. In fact by about 10 am our men had got to the top of the 1s* ridge which was surprisingly quick work. It is said that the Experts said that if they got this ridge by the first days end they would be well pleased. About 9 am a big warship is close inshore & is working slowly down on to Kaba Tepe delivering tremendous broadsides as it advances\n\n \n\nThere is a battery here that it is intent on silencing This is done shortly after. At same time another warship is standing off to the south of Kaba Tepe & is bombarding a gully inland well behind the ridges our men are now contesting She is giving this place a hell of a Time. Before midday she had got the battery but not before a great many broadsides. There is an Enemy battery dropping shrapnel over our men & this continues a heavy fire all day Our men as yet have no artillery on shore at all The firing now on shore is incessant & very heavy.\n\n9 am I have started below redressing the wounded the majority are troublesome bleeding a tremendous lot about 9.20 hear the roar of shells through the air & three drop just alongside the vessel shortly after each other one just missed a Destroyer that was close to us & one was within 50 ft of us. We then up anchor & away to about 3-4 miles out. we were about 1 1\/2 m out.\n\nThere are two dead among the wounded one a 3rd AM.C. the other a naval man. There are two other A.M.C. wounded. A good many were wounded about the Knees & legs apparently they were sitting in a crouched attitude in the boat.\n\nthe Bullet wounds are all irregularly large ragged holes with free venous haemorrhage. I took a bullet out from the side of a jack Tars Knee. It was twisted up all shapes. It was just under the skin.\n\nAll the lads suffering from shock. Am told our lads did splendidly jumped into the water almost before boat landed & with a rush were on to the Turks with the bayonet. Am told our lads are giving them no quarter (told by a Wounded) I finish dressing about 12 md & then have orders to transfer all wounded to the Hosp ship This takes till about 1.30 pm to complete as most are stretcher cases & are slung over on to a Minesweeper Padre Green of great assistance in the morning. He got a complete list of names & helps in various ways.\n\n Lunch 1.20 pm\n\n2.10 pm Our lads now over the 1st ridge & going strong for the second. Suddenly a warship lying alongside us to the North opened fire on a point on\n\nthe 1st ridge towards the North. We can make out nothing here but heard after that it was Turks attempting to put trenches here. The warship continued on to this point very attentively for 2 hours.\n\nThe Shrapnel is dropping very continuously over our troops. There is evidently a well hidden battery.\n","2":" pm We weigh anchor & proceed to Imbros where we shelter with other Transports. All along the Peninsula can be seen warships & off the point are\n\na no amongst them the Queen Elizabeth. Here the English Div have landed & here can be seen one hill top that the Q.E. is bombarding. It seems as if she has knocked the top off it. Farther down off the Asiatic coast opp the entrance can be seen in the\n\nhaze more ships these are the French. Whether they make a feint here or permanently land I cannot say. All along the Peninsula can be seen the smoke of battle just like the dirty pall over Sydney on a still morning. We are anchored now in Imbros about 70 m off & can hear plainly the firing. The Day has been perfect, the water where we got our men ashore like a mill pond. It is one of the clearest & finest Sundays I have known but who would have thought it Sunday.\n\nThis battle is a most spectacular affair. We could see everything from the ship & even see the glint of the bayonets of our lads. They appear to be going ahead very fast & I think their casualties will be heavy. At midday they were beginning to get the Indian Mountain Batteries ashore. As yet there is no other horse unit or supply unit ashore & will not be for a couple of days.\n\nThe men are carrying 3 days rations on them. There are the Bearer Subdivs of the Amb ashore but no Tent Subdivs at all yet. I think we could do plenty of work there.\n\n6.30pm suddenly we get a call to go to Kaba Tepe & act as a Hospital Ship.I get up at once with the aid of our Transport men all the Amb equipment that I can. We go ahead two miles & then turn back, a false alarm. I would have liked to have been of assistance although I had a very heavy morning which after all makes up a little.\n\nI must say that the Transport details of our corps who are men used only to horses worked splendidly in the morning & gave invaluable assistance.\n\nAfter dinner firing still going on We can see the flashes of shells & of signal lamps on the hills. Went to bed 9.30 pm tired out after the most exciting & thrilling day in my life, but how much more so for those brave lads ashore I feel ashamed of our inaction Col Howes is ashore with a detachment of the Clearing Hosp who are doing the work that I thought our Fd Ambs had to do. \n\n The Jack Tars & Naval officers are fine just as they were on Manoeuvres.\n\nMonday 26th . We can see from here a most magnificent panoramic view of the Battle. In front to the East stretches the Peninsula & up at the North end at Kaba Tepe may be seen the Australian Transports & battleships Down at the point & off the entrances lower around the Asiatic coast may be seen a great no of warships & Transports. Here all the morning there is a violent bombardment of the end of the Pen & also of mainland, great clouds of smoke go up as the warship shells take effect. Here the British are effecting a\n\nlanding. We are not certain if they have landed as a whole yet or only so far in part. Suddenly about 11.30 am the Q.E. is seen steaming up the coast full speed. After lunch she has taken up position near Kaba Tepe & has begun a most violent bombardment of a conical peak inland from the ridge the Australians landed on. This peak is at the end of a plateau at the other end of\n\nwhich appears a rounded hill & on this end of the plateau is what apparently seems a single tree standing thus\n\n Sugar Loaf\t\tconical peak\n\n We cannot decide the exact location of these features on the map but.\n\n Dense clouds are seen rising from the peak & every now & then it is hid from view \n\nby the smoke again, like a volcano. Q.E. also shelling along the Plateau. Time the sound takes to get here is 1 min (1100 ft per sec) makes in distant 12.5 miles which is correct. Later on in afternoon shrapnel is seen dropping over & around the ridge the Australians went over yesterday. We are puzzled it looks like as if our men have been forced back.\n","3":" pm we hear that Australians are holding their own with Turks falling back in the left wing. The Turks are replying & some of their shells are dropping in the water. Still violent bombardment down at the end of Pen. Some French Transports (15) can be seen coming over sea in single file heading for the point.\n\n Night - comparatively quiet.\n\nTuesday 27th QEis lying off K.T. this morn & is bombarding at long range an eminence south on the peninsula. Terrific broadsides that make the windows & walls of the smoke room rattle & louder than anything previous. Tremendous shrapnel fire over the ridge at Kaba Tepe & some vigorous replying by some Turkish batteries then shots are fall in the water & the Transports are moving out of range. The Point down south is silented soon after midday. At midday a serious accident on board. A boat falls from the Davits into water 60 ft. with a man in it. boat smashed\n\nman brought up unconscious. Fractured skull Fract arm & fractured thigh Ships Doc & I fix him up he is dying & will only last a few hrs. In the afternoon the English at the point are completing their landing & half way up the coast between point & Kaba Tepe the Aust & N Z Div transports are landing their troops. The Padre goes off to a Trawler in afternoon & brings back welcome news, the Aust Div have done splendidly & have done all that they were expected to do in a much shorter time than was estimated. Their Casualties are heavy but not as heavy as might be considering what they have done. The South end of the Peninsula is now clear for the Eng Div. & Aust & N Z Divs to proceed. The french are reinforcing the Aust Div. & all the Shrapnel fire we can see on & around the ridge near Kaba Tepe is from our side who are shelling the Turks who are entrenched in & around the North part of the\n\nridge. Tonight up till 10 pm there is continuous bombardment going on at Kaba Tepe & we can plainly see the vivid flashes of the shells bursting There are also two bright glares as if something somewhere about the ridge is on fire. We still are stuck down here at Imbros waiting for orders. We are getting very impatient but have heard that the beach at Kaba Tepe is still under fire. This apparently precludes Transport & Ambulance detachments from landing\n\nIt seems rotten for able bodied men to have to stick about like this 1st class passengers on an Atlantic liner while our comrades are over there under heavy fire & probably hungry & dog tired. It seems more it seems humiliating but there are others in the same box why I\n\ndoubt if much, if any of our artillery is on shore yet. The Turks appear to be fighting for their lives & it is by no means an easy task our men have. They certainly seem to have some excellent positions for their batteries & our warships are having considerable difficulty in locating & silencing some that are apparently somewhere behind the ridge at Kaba Tepe.\n\nThe last three days have been perfect from a weather point of view every afternoon thick white clouds arise behind Kaba Tepe which are just like those that come up in the N.W of Sydney on a warm Summer day when a N.E. is blowing.\n\nToday they worked up into a Squally storm & it apparently rained hard over near K.T. Tonight it is calm & clear with some clouds. This climate up here is perfect & the view from here is superb.\n\n The accident case died about 9.0 pm.\n\nWednesday 28th. Leave Imbros arrive KT at 9 am Get a message through morning to send off all stretchers. At midday decide to go off with them & report to ADMS. Arrive at shore about 2 pm & find Kay Wassell & Stokes. Everyone looks very sunburnt dirty & unshaven I report to ADMS who says I dont suppose you can get a boat back to vessell I say no He then offers me a Battn. job which I take 3rd Bn (Capt Bean wounded) also heard another medico has been wounded & may lose an eye.\n\ninvites me into the Firing Trenches. We set out across a crest & have to do 30 yds open country which is enfiladed by the Turks. Exciting we half crawl & half run. I fairly fell into the Trench have a yarn see a few wounded & set back, fortunately while going back the moon is hid & things are dark. Then attend to a few wounded Things are very quiet so I go back to the Aid Post & there turn in after making a little dug out I sleep about 1\/2 hr during night as I have no blankets & feel bitterly cold. The crack of the rifles sound unpleasantly close\n\nThursday 29th the Bn is relieved after being 4 days in Trenches with practically no sleep. We go back to the beach. On way down we encounter a couple of Shrapnels but no damage is done. We get down & are told to bivouac on the beach. Here we dig in under the sandy cliff & make things ship shape. Bullets are continuously dropping into the sea just a few yards away from us also occasional shrapnel but very\n\nI am to go up to Bn after sunset. Have some food at 6 am after a look around. The side of the hill looks marvellous all dug outs & men excavating roads. Mules are used in great nos\n\nto convey water & food up to the Troops. There is a wireless going strong on the shore. At 6.45 pm I go up with","4":" Fd Amb S.B.S Things are quiet while we go up a valley & about","5":" mile up I come across my Reg aid post. Here I am welcomed by the AMC who have been doing splendid work med officer I go up the side of the hill & am met at the Top by the Corporal who\n\nI have my Reg S B attached to their Coys for Discipline & rations & the scheme works admirably. They are on the spot in the Trenches are well equipped with Dressings & are able to bring to aid post delay where I keep only the AMC men My batman washed my spare jersey & underpants today & I had a luxurious shave bath in about\n\n \n\nlittle damage is done, only 2 or 3 men being hit during the day. During afternoon I go off onto Minnewaska & get my blankets & some gear. Now will have another singlet & underpants & three pairs of socks some H’Kerchiefs & Toilet gear. Talk to Major Bennett during day who tells me how Brigadier & B Major lost their lives. They went up to look for themselves re a certain position & were killed.\n\nCountry Australians have is just like that around Middle Harbour near Roseville. There is also a fair quantity of Spring water & small creeks. The climate is delightful & there are no flies We have captured a roughly going inland about","6":" - 2 m made up of steep cliffs & valleys There is a stunted vegitation just like that of La Perouse. Go to bed early after having heard many tales of valour One S B was bailed up by a Turk he knocked him over with Stretcher & then finished him by bayonet He this stretcher bearer had no arms with him.\n","7":" A day of quiet again with an early morning shrapnel bout all of which fell into water near us & did no harm. Work all day consisting of getting together the remains of the Battalion Have a swim in morning luckily the bullets were not dropping very near when I went in\n\n ","8":" a quiet morning and\n\nsudden orders to move up to the firing line during the afternoon. We set out at 5 pm & go up Shrapnel valley under a brisk Shrapnel fire all the time Luckily it did not find the Battalion. This valley gets a regular bombarding with shrapnel morn & evening. Got up to the top of the valley & told that our men are to stand by in the Supporting Trenches ready to relieve the Marines. I select a spot for Aid Post & start to dig in in a cosy spot on the side of a steep hill & on the main track up the valley It laps the whole Battalion & is about 200 yds from the crest where are the fire trenches. Get to bed early & spend a fairly good night not many cases.\n","9":" reveille with Shrapnel then quiet all day till evening when another burst of Shrapnel occurs Stokes came up to see me in the afternoon, few wounded in today We have excavated a good Dug out where we can stand up & not be exposed we have a very good position in the valley near the beach & on the side of a steep hill We are couple of hundred yards from the Trenches & HQ of Bn & on the main track down shrapnel valley Capt Rowe has his aid post 10 yards further up from me & Capt Tebbutt about 30 yds on the same side as I am. There is a constant Traffic up & down this valley & the way the Transp\n\nort mules bring the supplies & water up is wonderful They are driven by Indians & come up in single file They are constantly under a hail of Shrapnel (thro which valley gets its name) but turn up unhurt mostly all the time. The Stretcher Bearers are also having a trying time going down this valley & have had one or two hit However in spite of the great amt of Shrapnel pumped into the valley there are remarkably few casualties\n","10":" no move & men settleing down improving trenches & organising the defence of position A fair no dropped in today for medicine & a few wounded but not many. Afternoon go up with Sgt Malone to Trenches meet outside at H.Q. Major Storey. Capt Smith just off Benares & Capt Couriellson AMC & others. We go through the winding Trenches listen to the bullets whistling about hear the shrapnel fly over head We go into the Firing Trenches & are given a look through the Periscope We can see Dead Turks & them digging Trenches about 150 yds away Capt Smith carrying a rifle he may get a shot. We stay in Trenches about 1 hr & are coming out our Comm main trench when Smith stopped to talk Sgt Malone & I just behind pushed past him instead of waiting & had only gone 5 yds when a shell burst behind us we kept on & then heard another shell then a cry for the Doctor I went back & there was Smith lying on ground with side of his neck torn clean out & gasping his last I saw it was hopeless & returned I consider this a narrow squeak & vowed not to go idling about Trenches again.\n\n ","11":"\n\nC. Douglas brought to aid post shot in liver. Last night C. Brand shot while going around sentries. This morning got a captive Turk sent down, he tumbled into our trench & was bayonetted in chest, loin & shot in neck. Poor little devil was very weak when he got down to us so we fed him up with warm foods tea & gave him cigarettes. He got quite at his ease by the time he went\n\ndown below He said he had been without food for 4 days & that German officers were flogging & keeping the men forward.\n\nRuses of the enemy are many. They dress in our uniforms have even come into our Trenches & given orders. Precautions are very stringent now & our Australians have become very suspicious & will drastically search any man. We still get a good morning & evening peppering with shrapnel It is bursting very close to our Dug out today.\n\nThe Turks are said to be frightened of surrendering as their officers tell them that we give no quarter Things quiet in the Trenches Last night the firing was very heavy all by the Turks Our men reply very little & the former appear to waste a great deal of ammunition\n","12":" Improving our Dugout have now put a dust screen in front as dust is rather troublesome Only very few wounded coming down & also some Dysentery & colds. Amb Bearers are connecting well with us & we get our cases down with\n\n practically no delay at all we have some squads stationed up here\n\nMedical work all antiseptic little water available so instruments & hands do not get much washing we use Iodine for all wounds & sores & do not touch the skin with water. Instruments we keep in a tin box on a shelf in wall of dug out & other equipment in a wooden box on same shelf All equipment covered with towels We have a Pill box with a few essential drugs which is in great demand We have plenty of wool & bandages & gauze & can easily be replenished by Fd Amb Bearers are by Depot of M.S. on beach Also plenty of Stretchers available. We are going to try & sterilise the instruments once a day Wounds we get when caused by bullets leave jagged holes with considerable destruction of tissue inside. They are all very lacerated Some marvellous Shrapnel escapes. One man sitting down & a piece fell hit him on the back he turned around & abused his comrades for throwing at him but one mate saw it & picked up the shrapnel It left a bruise Another man had little wounds all over back of legs where the Shrapnel had hit him but had not penetrated\n\n \n\none pint of water felt much better as I was getting itchy from dirt & possibly the meat\n\n ","13":"\n\nWork slack up here Yesterday & today get a good peppering up here with shrapnel some dropped in our dug out no harm & some dropped again yesterday We have been under cover most of the day & are not able to move out at all.\n\nDown on the beach we hear that there has been much havoc Concealed batteries down near Kaba Tepe have started & are giving our beach a hot shelling They got several mules\n","14":" Still shelling down on beach & very hot up here all day Night I go up to the Trenches. Going up there is a nasty piece to cross at the double It is open to the Turks enfilading fire & bullets are fairly frequent Go in trenches at a bad time while relieving is going on consequently get many compliments Do not stop long. Have a quiet night at Dug out\n","15":" Go up in morning get two badly wounded cases one with brain extruding another hit in the head I go up re the Latrines in the Trenches & arrange with the Sanitary Squad In afternoon go through again & inspect where they are to go. Shell fire is pretty hot up there but we kept walking & none arrived at any one place as we did although one or two dropped in after we had\n\n \n\nleft certain points. Trenches are getting very elaborate now plenty of supporting & Comm. Trenches\n\nAfter Tea went down to Beach with Sgt Malone & saw A.D.M.S. & Major Stokes He may come up tomorrow. He is talking about getting ashore Col Newmarch Capt Aspinall & Capt Poate but does not know where to put them as work is pretty slack\n\nAlso called around to 1st Fd Amb had a drop of Port with CEW. & JBW They have a big dug out now well in & tell me they got a very hot shelling this afternoon, they say about 100 shells went over in space of one hr Their Dug out in my opinion is too wide & might easily stop a shell. It is sideways on Walked up the valley & going up the Bullets sounded pretty close as we got to where the Valley of Death forks off to the left. We were glad to get home once again Here saw L Barlow & S White & sent them to Hosp for day or so. Wounded & sick today quite slack.\n\nBeach has wonderfully altered They have roads & excellent Dug outs & have almost entirely cleared the side of the Hill It is a scene of great activity, there are huge stacks of fodder & food for the men The Wireless with MC engines can be heard buzzing away & there is a constant stream of busy men, horses & mules passing to & fro while all the time boats keep coming & going from the land to the ships. It is a marvellous scene & cannot be aptly described\n","16":" a day of peace & quiet very little firing Went up to H.Q. to see about sanitation L Goldring hit while I was there. Bullet through the neck involving the windpipe. He was exposing himself above the Trench Listening this afternoon to anecdotes. Our men charged the Turks shouting all the expressions they had learnt in Egypt such as you B--- Eggs are cooked etc. Later on a Turk tumbled into our Trenches & called ah. Australians. Eggs are cooked you B--- answered one of our men as he stuck the bayonet in\n\nTalking also to a man who was mounted as sentry over a ruined area on the land side of the 1st ridge the Australians went over. Here were three tents cleverly concealed with bushes & all around the area were mines with red signs denoting them. (Arabic written). Our men after passing wrote up Beware, mines..\n\nThe Sentry told me that evidently the officers who were in those Tents got away in a great hurry. In one had been a German officer who had made himself very comfortable with folding bed mats etc. He left all his gear behind so our men have got many Trophies. When our men got over to the Tent his breakfast was still hot & untouched Up at HQ this evening had a look round\n\n the trenches.\n","17":" Our artillery gave the Turks trenches a hot peppering at 6 am this morning later heard that they enfiladed them & did great damage Turkish Shrapnel quiet this morning\n\nCasualties extremely light only one all day. Occupied the morning by putting a tin roof over our dug out It is quite water proof now so we need not fear any rain Shrapnel over beach not so bad today. In the afternoon heard some heavy bombarding from the warships They also sent many shells soaring thro the air above our heads across into the Turks Trenches Went up to Trenches in evening & went around with the O.C. & the Adjutant. Everything very quiet Yarned to Kay & C.E.W. who came up & brought me a clean new singlet & socks matches & chocolate (very welcome indeed)\n","18":" Very quiet today practically no shrapnel sky overcast & looking as if we are about to get some rain had a hair clip today & feel much cleaner Also had a bath yesterday with a sponge soap & about 1 pint of water feel fine C. Lewers AMC has been shot in the arm & has a compound fracture. (HQ is on top of a ridge about 500 ft high & one gets a lovely view of the bay) by looking down the valley glorious at sunlight \n","19":" raining today a rum ration issued Clay soil in trenches & about here. Very sticky. Casualties very light today. In & out of Trenches inspecting\n","20":" Still the same hearing early this morning & all night tremendous heavy bombardment down the coast by the warships.\n\nHeard today about a certain AMC Col. His batman threw two bullets into his Dugout. He informed all his men that afternoon I was nearly not with you today I was nearly taken away from you & he held up the two bullets\n","21":" Casualties very light still heavy peppering about the Dugout by Shrapnel today, no damage done\n","22":" Rumoured today that Italy is about to join in Beautiful sunny days now no flies practically no mosquitoes An ideal climate apparently, through the trenches today, getting more complex, practically no casualties. Kay & Wassell up tonight all same letters from firms in England one from Aspinall & Nurse Durham also some cigarettes, very welcome also some very good\n\n chocolate.\n","23":" nothing eventful Trenches very good but rather labrynthine to one not constantly in them, nil else to record\n","24":" Going to move Aid post up to trenches just in readns. Battn H.Q. have been making great efforts to get all water boiled that troops consume now most water is boiled by Coys. & served up as tea to the men Got a very heavy bombardment with Shrapnel this evening lasting till about 7.30 pm. no one hurt It was getting very close to our aid post but not quite.\n","25":" Turks opened with heavy Shrapnel fire at 5 am this morning but no damage done. Still practically no casualties. Official News Today 20,000 Armenians have arisen against the Turks. Also Ghurkas & French are pushing forward down the peninsula News tonight that Turks have been reinforced here by troops from Basra 20 - 30,000 A big attack expected tonight our men ready & confident I go up at 11 pm to see about arrangements Medical & see R S M. who thinks things are going to be very willing\n","26":" Shortly after midnight the attack started, the fire was fast & furious. At about 3.30 am about 12 wounded came down. They stated the Turks came on in droves right up to the parapet of the Trenches & were mowed down by our M Guns & rapid rifle fire. Most of our men wounded by sitting upon the parapet laughing swearing & pouring the fire into the Turks as they ran back I went up to B.H.Q. &started a dressing post there. Shortly after about 4 am another attack began even more furious than the first, in addition Shrapnel & shells were bursting everywhere. One big shell burst close to H Q. & threw dirt over all of us a big bit of dirt hit my leg & I thought at last a bit of shell but it was only dirt. This attack was very fierce & I was very busy for about 1 1\/2 hrs. as all the wounded came in at once. Things quietened for the day at 8 am & all in front of the lines were 1000s of Dead Turks estimated later at about 3000 dead. They were literally lying in heaps. The boys took great delight in one giant who with a huge stick was leading men on. They said he was about 7 ft high & when he fell our men cheered & while the Turks with him ran back. Most of the day quiet."}}