{"Document Name":{"0":"Diary_0344","1":"Diary_0344","2":"Diary_0344","3":"Diary_0344","4":"Diary_0344","5":"Diary_0344","6":"Diary_0344","7":"Diary_0344","8":"Diary_0344","9":"Diary_0344","10":"Diary_0344","11":"Diary_0344","12":"Diary_0344","13":"Diary_0344","14":"Diary_0344","15":"Diary_0344","16":"Diary_0344","17":"Diary_0344","18":"Diary_0344","19":"Diary_0344","20":"Diary_0344","21":"Diary_0344","22":"Diary_0344","23":"Diary_0344","24":"Diary_0344","25":"Diary_0344","26":"Diary_0344","27":"Diary_0344","28":"Diary_0344","29":"Diary_0344","30":"Diary_0344","31":"Diary_0344","32":"Diary_0344","33":"Diary_0344","34":"Diary_0344","35":"Diary_0344","36":"Diary_0344","37":"Diary_0344","38":"Diary_0344","39":"Diary_0344","40":"Diary_0344","41":"Diary_0344","42":"Diary_0344","43":"Diary_0344","44":"Diary_0344","45":"Diary_0344","46":"Diary_0344","47":"Diary_0344","48":"Diary_0344","49":"Diary_0344","50":"Diary_0344","51":"Diary_0344","52":"Diary_0344","53":"Diary_0344","54":"Diary_0344","55":"Diary_0344","56":"Diary_0344","57":"Diary_0344","58":"Diary_0344","59":"Diary_0344","60":"Diary_0344","61":"Diary_0344","62":"Diary_0344","63":"Diary_0344","64":"Diary_0344","65":"Diary_0344","66":"Diary_0344","67":"Diary_0344","68":"Diary_0344","69":"Diary_0344","70":"Diary_0344","71":"Diary_0344","72":"Diary_0344","73":"Diary_0344","74":"Diary_0344","75":"Diary_0344","76":"Diary_0344","77":"Diary_0344","78":"Diary_0344","79":"Diary_0344","80":"Diary_0344","81":"Diary_0344","82":"Diary_0344","83":"Diary_0344","84":"Diary_0344","85":"Diary_0344","86":"Diary_0344","87":"Diary_0344","88":"Diary_0344","89":"Diary_0344","90":"Diary_0344","91":"Diary_0344","92":"Diary_0344","93":"Diary_0344","94":"Diary_0344","95":"Diary_0344","96":"Diary_0344","97":"Diary_0344","98":"Diary_0344","99":"Diary_0344","100":"Diary_0344","101":"Diary_0344","102":"Diary_0344","103":"Diary_0344","104":"Diary_0344","105":"Diary_0344","106":"Diary_0344","107":"Diary_0344","108":"Diary_0344"},"Date":{"0":"unknown","1":1488.0,"2":1493.0,"3":1494.0,"4":1495.0,"5":1496.0,"6":1497.0,"7":1501.0,"8":1503.0,"9":1504.0,"10":1505.0,"11":1506.0,"12":1508.0,"13":1509.0,"14":1510.0,"15":1511.0,"16":1512.0,"17":1519.0,"18":1525.0,"19":1555.0,"20":1560.0,"21":1561.0,"22":1562.0,"23":1563.0,"24":1570.0,"25":1571.0,"26":1577.0,"27":1578.0,"28":1580.0,"29":1581.0,"30":1584.0,"31":1591.0,"32":1593.0,"33":1598.0,"34":1601.0,"35":1605.0,"36":1606.0,"37":1608.0,"38":1613.0,"39":1620.0,"40":1621.0,"41":1627.0,"42":1632.0,"43":1634.0,"44":1641.0,"45":1642.0,"46":1644.0,"47":1645.0,"48":1648.0,"49":1655.0,"50":1656.0,"51":1662.0,"52":1663.0,"53":1669.0,"54":1674.0,"55":1677.0,"56":1684.0,"57":1691.0,"58":1692.0,"59":1693.0,"60":1694.0,"61":1697.0,"62":1705.0,"63":1706.0,"64":1707.0,"65":1719.0,"66":1724.0,"67":1726.0,"68":1733.0,"69":1736.0,"70":1737.0,"71":1738.0,"72":1739.0,"73":1740.0,"74":1741.0,"75":1747.0,"76":1748.0,"77":1754.0,"78":1755.0,"79":1761.0,"80":1767.0,"81":1768.0,"82":1769.0,"83":1770.0,"84":1771.0,"85":1772.0,"86":1773.0,"87":1776.0,"88":1783.0,"89":1786.0,"90":1790.0,"91":1797.0,"92":1798.0,"93":1800.0,"94":1804.0,"95":1810.0,"96":1811.0,"97":1812.0,"98":1825.0,"99":1829.0,"100":1830.0,"101":1833.0,"102":1839.0,"103":1840.0,"104":1843.0,"105":1847.0,"106":1850.0,"107":1854.0,"108":1859.0},"Entry":{"0":"\n","1":" \n\nIce\n\nRecd. E. is O. Sgt. 3 letters from Home. Dulce. Ida. Mrs Horner Bess (2) Mrs Winess. Dulce card. Lottie card Ida card & photos. Get ready for I. of Man\n\nMrs Edmond & Connie Wrote Dad. Mum. George. Sent cards & Photos.\n\nF 2 Wed am\n\nLondon. 3.45 pm. 5.30 to L’pool. Met WAAC in Bulford train & Go to dinner with Her. Travel with Lady who has lost her Hubby. Stay at YMCA in L’pool. New Zealander who coughs all night. L’pool very cold.\n\nSent t.gram to auntie Annie.\n\nF 3 Thu \n\nLovely day. Catch 11.30 am boat See Leviathon also Faterland at L’pool. Nice trip travel with horses & chap from Melbourne. Meet Qarllion on quay. Arr Aunties’ place at 6.30. No one at home. All arr 8.30 pm. Everything very good. I as a stone image - \n\nW 4 Fri S\n\nJust sit about & generally get in the morning. Music & fireside all afternoon in Drawing Room Auntie & M have to help undress me. We do not chat together much & nothing marvellous happens. \n\nDull 5 Sat \n\nSit & read in \n\nDining Room all afternoon & night. Auntie Esm. again help undress me We do not chat together & nothing marvellous happens \n\nI try & alter my Braches but makes no real success. We all yarn together & nothing happens interesting at all.\n\nDull 6 Sun\n\nXX Home. Dull. Just pottered around as usual. Uncle does not get up & I become Spud Barber. Music on in, in drawing Room. Sit on sofa as often but nothing except Read & goes \n","2":"\n\nSnow & Hail as large peas. Spud Barber again & I sit & write by the fireside. We talk together all night for the past time. X happens \n","3":" \n\nAunties Birthday on","4":" Wrote to Dad\n\nSnow & Ice. Leave Auntie & M at front door at 6.15 am. Meet drunken sailor at the bridge. Ice & snow all the way on Tower of Nice crossing arr L’pool 2.15 pm but do not land until 4.15 pm. Catch 5.30 train & travel with Scotch WAAC. from Dundee who was engaged that day. Tommy meet Keogh Sleep at Keogh’s \n","5":"\n\nSnow & ice. Arr at Bulford at 12.30 pm. Recd. letters from mum. Bess Miss. Hilda Hey George Miller Masie. Mrs Whitehead. paper for Home. E goes to S Norm Rick & I talk and read about chaps we know getting married etc Dress of Bertha Crook Pink silk Parade London\n","6":" \n\nF & Rain after dinner\n\nPractise hockey.8 goals all.Am ord corps.Have supper with D & E & I.We talk & I relate my Manx trip. Charlie Howson from France then set in last night & all clear this morning. \n\nW 11 Fri\n\nRcd letters fromRoy & Jennie Had supper and went to bed.Lights out.Wrote.Ida & Wal.Mrs Niness Norm Upton Lottie Mrs White Dulcie.Maisie Carter. Hilda. Hey. All night writing but no rain. \n\nD 12 Sat \n\nDick is on & goes to bed early.Rcd letter from Jim Robby & mum with lock of hair & pressed roses. Home supper\n\n Am very happy all day. No.hockey Wrote Bess.Roy. MRL (12) \n\nF 13 Sun\n\nWe mark out 83 men. Write all afternoon & read at night\n\nWrote to mum 10 Jack. Preddey. Home 6\n","7":"\n\nSnow (5\") Very busy day. Visit Nin who is sick. Jim Robby turns up. I go down through snow but miss him. \n\nWe talk all night & have big supper\n\nW 15 Tues.\n\nVery rainy. Go to Sarum. See Girls in fancy dress. Go to Broadway Jones. Awful night. Rain like Torrents all the time.\n\nRecd. Letters from Cis. Con & Selfridges\n","8":"\n\nSnow & Rain. Nasty day. E catches late train to Sarum. Am ord. Corp. Visit Nin. Practise piano. Visit Collins. Do my washing at 9.15 pm & just finish at lights out. Very lonely nothing to do at night. \n\nWrote to Con.\n","9":"\n\nSnow (4\") Rain & muck & rubbish. \n\nRecd. Greeting Card from Flo & Chas. E. goes to Glasgow. Am Contun corp. Read all night & tidy up room generally\n\nWrote Jinnie\n","10":" \n\nDull. Gasticho pretty Bad.\n\nRecd. Letters from Marg. Nette & Dad \n\nCold windy wet day.\n\nStan marries the WAAC at B’ford. The Gen Band plays \"Hold your hand out naughty Boy\"\n\nWrote. W.H.A. MRL..\n","11":"\n\nDull. Plenty of Rain & slush I have frightful busy day. Better. Go to Theatre with being Beashy & Robby. See Camonflage Very good. Dr of MRL. & church. She is awfully loving.\n\nWrote Nette & Horchas.\n\nW20 Sun\n\nVery busy again. Very windy & smoke comes down chimney. Dave comes up for a Hon.\n\nI read write mess about generally chap in B.med. dies at 4.45 pm\n\nWrote. Dad.Mum.\n","12":"\n\nF & W. Very busy Day. Had letter from W.H.A. Norm. comes up & we sit and chat she writes letters while I Bath. I have supper & read for a little while. Dr of M. Lovely mansion & stroll through grounds. very nice again. Recd. Book from Bess.\n\nSent parcel to Aunt Annie.\n","13":"\n\nF & W. Lovely Day. But rains at night. I go to Sarum. Spend time at Eus E. Play piano. Go to music shop. Walk Home with Win. See Bad Scotch Lass on Station. Have good trip. Very warm day. Buy some Dance music.\n\nRecd. Letters from Dad. Lottie. Con & Mum. Dean MRL gathering mushrooms near Beach.\n\nF 23 Wed\n\nThings all muddled her morning. All day to get Straight. Tommy put in morgue last night with his neck cut. Recd. Poetry from Bess yesterday. Recd. Letters from Dad.F.Card from Geo Shepherd. Photo from Hilda Hickson. Gus Ord. Corp. NO MORE CANTEEN after","14":" \n","15":"\n\nWrote on","16":" to Marg. & MRL.\n\nI practise piano for a couple of hours. Nin. Comes up. Laura Home.\n\nRecd. Letters from MRL also had one from Mum. Letters from Marg. Bert. Dad. Mum. Card from Chris Dobson.\n\nF 25 Fri\n\nGo to T’worth about eyes. Meet Billy Harris wo. Williams & Bob Shaw from Shop. Get Breeches. leggings & boots. Fall from Bike hurt knee & Thumb.\n\nF 26 Sat\n\nbut Dull. Catch 2.8 pm to Sarum. Go to Miss E. Go to C.C. buy Grammar Book & Margarine. Go to close & then to Dance. Have some good Dancers but one young bus horse.\n\nIm a card all the time. Play as Extra seems OK meet WHA & Chat for 15 minutes or so. Catch Train & have good Trip.\n\nF 27 Sun\n\nNice Day. Recd. 2 papers from ETTA go to NZ Comp. & watch footy match till half Time. E goes to Sarum. Dick & I have a lesson all night in English etc.\n\nF 28 Mon\n\nRecd. Letter from Jennie and mum. Sit darn socks nearly all night. We have Tattoo Roll Call.\n\nWrote M.R.L\n\nF 29 Tues.\n\nRecd. Letters from Norm. Dad. Play Hockey. Rotten exhibition. Do no reading or writing at Sgt. Pantier comes down & we talk till after light out \nRecd let\n \n\nF 30 Wed\n\nGlorious Day. Play Hockey against the Civis’ & W.A.A.C’S. Strain my leg. An Ord. Corp. Sgt’s have dance w Coffee Bar.\n\nRecd. Letter from MRL & PC from Chris.\n\nGo rounds alone. Have rotten time. E comes in at 1.30 am & I don’t sleep for Hours. \n\nWrote Dad & Mum.\n\nF 31 Thurs.\n\nRecd. Letters Tournd. Esme. Dulce. Martin.\n\nRecd. 2 Papers D.J. paper. Flowers: Edie T\n\nFoggy but turns out lovely Day. Go to Lewes with 10 Prisoners. Have hasty motor ride through London arrive Lewes 4 pm. Leave Brighton 6pm. Go see Hugh. Catch 10.40 pm from No8 to Eastleigh. Arr Sarum 3.45 am. Geo M. Edmunds. An. B’ford 9pm.\n\nF","17":"\n\nLovely Day. Go to bed at 9.30 am. Up for Dinner. E & D go to Pictures Rotten show. We talk to Jim Robbie. No supper. Go to bed cold tired.\n\nW 2 Sat\n\nRecd. Letter from Laura. Dad & Mum. Parcel from Sunshine Girls per Dulce. Dave comes up & we talk. E. goes to the Theatre \"under Two flags\". I write & go down to see Dave. Top & Jim come down to talk. E & D have supper & I take over No1 Hut\n\nWrote to Dad. Mum. George & Auntie Annie.\n\nF 3 Sun\n\nI write all afternoon. Get ready for Devonport & chase around after Rations etc. Say au Revoir to Norm.\n\nWrote. Doris.Bess. Norm. Hilda Hickson. Chris. Jennie. Lottie.Con.\n\nW 4 Mon\n\nCatch 8.45 am I go down Town & to museum. Visit Cis & Con.Catch 11.17 to Exeter. Go all round & to Cathedral. Dinner at Cellers & go tram ride. Hand over Pat. at 9 pm. an P’mouth & walk around Town for a room. Stay app. Continental Hotel.\n\nF 5 Tues.\n\nLovely Day. Go on Pier & through Aquarium. See Girls Bathing Round old Plymouth to Fishing Docks. Have Cider no good. Take Photos on Pier. See Guild Hall & Church.\n\nCatch 2.38 ran. At Mrs E. at 1.15 pm music etc.\n\nWrote M.R.L & Dad. Stay all night.\n\nF 6 Wed\n\nLovely Day. Catch 1.50 train to B’ford. Get fixed up & catch 12.27 Back again. Jean & practise piano. Go to Dance at 7 pm. Have jolly time. Photo taken. Go home 2 am. hit Longley across the head. Show not complete without a drunken Australian \n","18":"\n\nSent parcel to Auntie Annie yesterday\n\nDull Arr. B’ford. 10 am come up with Hobdro Girls. Recd. Letters from Mavis. Carter. M.R.L & Nancy. & parcel from Bess. Tidy up room & generally mess about.\n\nSee Moran whose sister gave me present of Pen Knife when in Condor St Shop.\n\nWrote to M.R.L.\n\nF 8 Fri\n\nExcept for a storm of half an hour Duration. E goes to Sarum to buy Ring. D gets ready for Weymouth. I get new shirt & breeches. Go to Theatre Nah Poo with Top. E goes to Walk Coast.\n\nRecd P.C. from Gen Roberts.\n\nF 9 Sat\n\nVery Windy but not cold. Dave goes away. He gives me two parcels before he goes. I develop 2 films. I sit & read all night until Top & Robby come down at 9 pm. E goes to Theatre.\n\nF 10 Sun\n\nLovely Day. I am ord. Corp. but do not answer any calls all afternoon. Only 6 & 9 at night. \n\nWrote Mum.Dad. George. Nance. Dulce.Esme. Laura. Bertha. Marg. I can’t write anymore ‘cos Top & Robby come down\n\nF 11 Mon\n\nRecd. Letters from Bert Cocks & Dave. Play Hockey. We are beaten by","19":" I get hurt again. Go to Theatre to see \"The taming of the Shrew\" It is lovely. My leg is very sore. Go to bed writing \n\nWrote to Con. Mrs E. Dr Roberts. M.R.L.\n\nF 12 Tues.\n\nI read all night while E. goes out. A very quiet day\n\nF 13 Wed\n\nBoys play hockey mixed match. I Referee Score 1 goal. Go to merry wives of Windsor It is lovely. I receive letters from George. Dad. Mum & Lottie. I read after I come home until bed-time.\n\nF","20":"\n\nDull but fine. I go to H’cott with my old S.M. Walker from Warwick Farm.\n\nI walk for hours looking for Reg Kenle. because of dopey Sgt of Guard. \n\nmeet O’Callaghan have Baked Jam Roll also Recd. Letter from Dave. Supper with Reg meet HELE from Burwood \n\nF 15 Fri\n\nWalk to Wilton 100 cars pass me but don’t offer a lift. Am offered Beer. Walk all around Wilton & arr B’ford at 2 pm with O’Callaghan.\n\nGo to Merchant of Venice with E Recd. Letter from Roy.\n\nF 16 Sat\n\nBright Day but cold wind. I do not expect to play Hockey but go on when White is hurt. I break Thumb. N 4 win 6 goals to nil. E goes out & I wait to read etc. Nicholson on night duty. Mid night raid on all my ward but it is a & nothing doing. I get to bed at 12.30 am. Start to write to Mum but fail.\n\nF 17 Sun\n\nRecd. Letter from Geo. Millar\n\nGlorious Day. D. Tommy W & I go to see N.Z. Hockey match. Norm Keirle comes over.\n\nWe go round block to B’ford Tea & supper together &I walk halfway Home. He’s very altered in appearance.\n\nF 18 Mon\n\nbut icy. I have very busy day. E. plays Hockey but hurts his leg. Recd. Letter from Reg. I try to write letters but only get time for PCS\n\nWrote Dad. Mum & MRL.\n\nF 19 Tues.\n\nPerfect Day. Ride to Sarum Visit both homes. C. not well. Leave at 7 pm from close &7.45 pm after cup of Tea to B’ford. Arr. 8.40 pm. Have supper shave& get ready for Parade. Read till 11pm when E. comes home. Have nice time.\n\nW 20 Wed\n\nRecd. Letters from M.R.L. Eileen Stirling & Esme P. Go to WAACs dance. Meet May & Davies. Have lovely time. Huge orchestra & topping supper. My partner is not boney\n\nW 21 Th.\n\nI am ord. Corp. I have a real long day. Nothing doing all day.\n\nF 22 Fri.\n\nGo to see \"Caste\" with Jim Robby. We walk all around camp & Tea at Salvation Army. E. goes to RHA. Dance. Recd. letter from Bess\n\n23 Sat\n\nGo to Sarum by 2 trains & go to Mrs E & to cc & home with Con. Meet Geo. Green in Fisherton. Travel home with Ma’am 1st Class. Esq. Scotch & Welsh Girls are have great argument. Arr. Home 8.30pm for supper. I fetch the clock from Sarum which is very busy as to people & Soldiers.\n\nW 24 Sun\n\nMeet Florrie Gibbons. Go walk all around B’ford alone. Watch Footy match.\n\nWrote Jennie. M.R.L. Dad. Geo. Mum. Bert. Roy. Ellis has horribles. See my WAAC. 3 times but do not go up to her.\n\nF 25 Mon\n\nLovely Day. Recd. Letters & photos from AL. including letter of","21":" Arr Ord. Corp. but Dick is Sgt.\n\nI go to bed at 9pm. Very sick. Very sore leg & had cold. Played Hockey.\n\nF 26 Tues.\n\nMarch Winds. Recd. Letter from Norm. Upton. I go looking for Dancing Hall. E. goes to A.V.C. Dance. Meet George Green again.\n\nWrote to Reg. Geo. Millan. Dave & Bess. Lottie.\n\nF 27 Wed\n\n Recd. Letter from MRL.\n E & I go to see Old Miss Gibbs. This lovely. Go to Tommy Concert but cannot get in the door. I expect to go GY but fail. We have meeting about Dance.\n\nWrote to Eileen Stirling\n\n28 Th.\n\nRecd. Letter from M.R.L. Get ready for Gy. & Levies. Go up to see about holding Dance & it is a failure. Go to T’worth by car to get my Bird.\n\nWrote Marion. C. Esme.\n\nF 1 Mar. Fri\n\nSent Brighton Views to Dad. Ice & very cold. We set off at 8 am. Arr. Lewes 3pm via London. Go to Brighton & walk along Prom and see the two Piers. It is very cold & windy. Arr Victoria at 7.45 pm. Go to King’X until 10.45. Train to Cy. Arr. Peterboro 12.30. Sleep till then. Canada & I go all around the Cathedral.\n\nF 2 Sat\n\nDull. Arr Jimmie’s Place at 6am. Have Brekkey & lie down til drinking messes all afternoon & go to Palace at night. See Raymond the mystery King. It is very dark coming Home. No lights at all one bumps a party about every minute or so. All sorts of bodies bump into me before we sees.\n\nIt is like a night mare walking about at all. I visited Euston Vaudeville Palace on Friday night while waiting for Trains.\n\nW 3 Sun\n\nHave at Ivanhoe for 1st time to Life. It’s lovely homemade bread.\n\nGet up at 11am. Sit in Front room all afternoon to music. And same at night. No light at all. I play Angel’s Serenade & think of one. told me he has never heard a PO play Piano better. I am in good form.\n\nF & W 4 Mon\n\nI go to visit Mrs Melhurst. Best Aussie who drank at Ship Hotel. Ivanhoe lovely place. Lovely people. Lovely time. Sorry to leave. Have devil of job to get home at night. On the dark nights. we go to Palace at night & see \"Gather around\".\n\nF 5 Tues\n\nI arrive at 10am Go for GY an & wrote 4 PC’s. I go for fish in afternoon. But sleep all afternoon too. We go to \"A Little bit of Fluff\". It’s not so dark & me go walk after.\n\nWrote MRL. Con. Dad. Mum. Play was lovely & we laughed very much. Poor Tulley.\n\nF 6 Wed\n\nRecd. 2 letters from Bess. PC Laura, Letter from Dot. Peg. 5 Home\n\nGot up with J at 10pm. Just time for Din. Brekker together. Leave at 8 arr. Ldon. 4.50. 5.50 Train via Andover. Get Home in time for supper\n\nD","22":"\n\nRecd. Letters from Aunt Annie & Reub. King. One Ord. Corp. I sort out all my rubbish & generally clean up. Read for about an hour.\n\nWrote to Jennie & Auntie Annie.\n\nF 8 Fri\n\nMeeting about Dance. I meet Baeran & we go to Waac’s canteen. E goes with Wenacy come home. Clean Boots & room. Go play Piano. Supper & bed. Recd. Letters from Edie.T. Dulce. Muriel. Eileen Stir. Nette. Home.\n\nF 9 Sat\n\nGlorious Day. Recd letters from Home.\n\nPlay Hockey against N.Z. They beat us. 6 goals nil. I am officially W.master B. Division. My leg again very sore. I take 2 ½ home to write to MRL. & only write 4 pages.\n\nTup sits in my Room & writes all night. I am in a dopey state of mind & cannot write for my life.\n \n\nWrote MRL & Reub. King.\n\nF 10 Sun\n\nGlorious Day. Heads from L’don visit Hospital. Recd. Letters from Lottie Watman & Roy. D, E & I go for a stroll around the block. We are all dopey because of early heat. Wrote Mum.George. Dad. Edie.Taub. Maisie Carter\n\nF 11 Mon\n\nMeeting re dance. I go to S’huy with Bill Tranter. We run all way to station. Visit Mrs E. & go to close. Have supper at Guest House. We come home via Railway line for last time\n\nF 12 Tues.\n\nI go to see Mup Rees at the others come Home to dear bouts etc. & generally clean up. Darn socks & D & I talk & read\n\nF 13 Wed\n\nWrite Invitations all night. D & I walk around Block Nothing doing much.\n\nW","23":"\n\nArr Ord Corp. Mess around all night. I write invitations all night. I have lots of writing.\n\nI sew on Buttons & darn socks again.\n\nF 15 Fri\n\nMeeting about Dance. E & I go for walk round Block after Tea. I have to wait up all night to call Roll. We go to see the It is OK except for D-Tommy, who laugh like a Hyena at everything funny! Recd letter from Reg.\n\nF 16 Sat\n\nGlorious Day. I go up to get hall ready. Dance a success. I scale a lot of my parties. Have a great time but I am very tired. Plan Dancing, supper a treat. I go to bed very tired & could not sleep. Receive 4 letters re Dance & let from France with in French dates from Capt. Robinson. No drinks at dance except E, G & his pal.\n\nWhile I am at the Dance a Telegram for Dave today. He is leaving for Aussie X\n\nF 17 Sun\n\n& hot. Shower at 6 pm. I go up to Hall & sweep & clean & wash up. D & I go for a walk round through milstone. We are hot & tired & I am thirsty.\n\nWrote P.C. to Dad. Mum. George. Marie & Aunt Annie\n\nF 18 Mon\n\nLovely Day. I go up to Hall again for final clean up. Play Hockey against Waac’s Have nice time. Do Night Part of orderly Corporal.\n\nWrote Jennie. Capt. Robinson. Reg. Roy. Bess. Ada\n\nF & W 19 Tues.\n\nCatch first Train to London. Go H’ferry Rd Round Lamberth Bridge up through St.Pauls & Holborn F. \n\nLondon Bridge. Tea at Aldwych Theatre & supper in Strand. Go to Drury Lane see Samson & Dealilah & sn tho. Buches orchestra play at 11 Aesb St. \n\nF 20 Wed\n\nGlorious Hot Day. Go to London Bridge, Kingsway. Catch 11pm Train arr home 2pm. Recd. Letters from Home Marg & Nell. Go to bed at 7.30 & read.\n\nGo for walk round block with meet Bainty . \n\nF","24":"\n\nLovely hot Day. Recd letters from MRL. Jennie & Doris. Arr Ord Corp. Go to merry-go-round with Dick. It is fine. The laughing Jackass is there again\n\nWrote to MRL.\n\nF & Hot 22 Fri\n\nIt is a real summers Day. I go for ride round B’ford after Tea. Then write all night.\n\nWrote Marg. Dot (8) Laura. Norm Upton. Dulce. Go to bed at lights out & read for a little.\n\nF 23 Sat\n\nGlorious Hot Day. Recd letter from Aldington Hunt. I play Hockey against N Z’s over at Sling. We lose 6 goals to nil but give them a real rattling game. Col. comes over to see us & we all have one photos took. Dick & I after Tea have bath & go walk round Block. I sit & write all night.\n\nNettie. Lottie. Muriel. Alice. Mrs White.\n\nGo to bed at lights out & read.\n\nRecd. Letter from DAD\n\n \n\nF 24 Sun\n\nRecd. letters from George. Dad & Mum.\n\nLovely Hot Day. D & I walk to Anesbury. All around River Banks. Meet Ethel & amp; Silly Nellie. Take Photos. Walk Home very tired out\n\nNo Tea left. But we have good supper. Wrote to Mum. Clocks put up 1 Hour\n\nF 25 Mon\n\nLovely Day. We have cricket meeting. Arr ord. Corporal 8am Parade Streets.\n\nI write all night.\n\nWrote Dad. George. Eileen Stirling. Nell\n\nF 26 Tues.\n\nLovely Day. Ken & I go to see \"A Better ‘Ole\" It is very good. On New Staff March in","25":" Sergeants\n\nWrote Jennie. MRL.\n\nF 27 Wed\n\nAm not well. Have long horrid day & go to be at 7pm & read etc.\n\nF & W","26":"\n\nE & I go for walk round Block & pay for stand up seat at pictures. See Pictures of Turkish Harem & very good. I come Home & go straight to bed. Pay-day & I am in need of it.\n\nF 29 Fri\n","27":" night Jude to Sarum stay with . We go for walk also. Have a real nice time Show all Photos. Nice ride Home. \n\n of MRL has Bath. everywhere & meet Top in Douglas near Turkish Harem arr esplanade.\n\nW 30 Sat\n\nWe met all day until 5pm other lovely. I clean up room & have a bath & sew & write letters.\n\nWrote to cm Hunt. Dave. MRL. Chris\n","28":"\n\nW & Fine. Recd letters from Jennie & Marie. Arr ord. Corp.\n\nWrote letters all night.\n\nWrote Mum. Edie T. Mr Horner. & Edie Tdais. Francais.\n\nF","29":"\n\nG & I go walk round Block & I came Home & read all night. Home good supper with Mat who knows a Waac Sgt Cook. Cake very nice.\n\nW 2 Tues.\n\nE & I go to Salisbury. Stay at close till 8pm. & then go up to Mrs E. We get caught in the rain round .\n\nThey all say we will not allow to touch. I find out very different. I am very sick but manage to get Home Ok\n\nW3 Wed\n\nAm not well. Go to bed at 9pm. D & E talk about Scotland. Top has just returned from here. Recd. Letters from Marion & Maisie H. \n\nGo to see \"Facing the Music\" with & George Slatter. Very funny.\n\nW","30":"\n\nNett. Comes up for a yarn.\n\nI stay a bed until 9am. Recd. Letter from Dad from Marion & letter. Views of mountain & Sydney come to hand, also paper. Wrote Masie Hudson Wrote MRL. Marion Edwards. Marion Clarke\n\nF 5 Fri\n\nI print photos with Top. Write to Jennie & PC.of Hockey match to DAD. D Wall & Nick talk all about Nancy Jane\n\nF 6 Sat\n\nArr ord. Corp. Measles break out & I have H of time. Work till nearly 8pm. Then go to my room to read. D & E out all night.\n\nNothing doing at all.\n\nW & F 7 Sun\n\nI go for a walk & on ride with Tommy Williams. Recd letters from M.R.L. & write to MRL. G & Mum. Dick & I laugh hysterically. Sent photos of Hockey & Girls Home. Was dopey when I wrote to MRL.\n\nF 8 Mon\n\nSit in class & read all night Top into letters. Dick gets book for George R. Nothing happens at all. D & I go round block & post views of Obans to Aussie & Book to M.R.L of Poetry 1 Bess)\n\nD 9 Tues.\n\nRecd. Letter from Mem. D & I stay Home have bath & sit & read all night. E. comes home again after Theatre.\n\nW 10 Wed\n\nGo to S’bury & to Mrs E. Weallys for a walk to Rations are short so I buy mine. I get very tired & arrive Home at 12.15am. Meet Jim, Vernon\n\nWrote to Dad.\n","31":"\n\nWet. I spend 1 ½ hrs lighting the fire. Read & write all night. E. goes out & return in a very dopey frame of mind –\n\nWrote to Dad. Recd. paper from \n\nF 12 Fri\n\nLovely D, E & I go to Sarum with Waac I go to Mrs F. C. E & I go for walk round Town. Meet Mrs. E & in Catharine St & in the Close. We go down River Walk. C. comes up to Railway with me. Meet Mabel . All arrive home at 8pm. Arr ord. Corp. but do very little work in that line.\n","32":"\n\nF but nasty dull & cold. E. goes to London.\n\nD & I sit in Room & write all night. I can’t write We go for walk to P.O. sending parcel each\n\nWrote to Mum.\n\nF 14 Sun\n\nAwful windy day. Worst this year. D & I stay in room all afternoon & try to read.\n\nWrote to Mum.\n\nW 15 Mon\n\nRead all night\n\nWrote to Dad and Aunt Annie\n\nW 16 Tues.\n\nRead all night\n\nSnowed all day long\n\nW 17 Wed\n\nRecd. Letter from M.R.L. Go to see \"A pair of silk stockings\". Come Home & amp; read till Bed time\n\nF","33":"\n\nTop & I write & laugh & talk all night. Arr ord. Corp for last time.\n\nWrote Dulce. Mrs Mel. Roy. Marg. Alma. Nette.\n\nW 19 Fri\n\nSnowy. Snow at night. Go to see \"The Windfall\" & come Home & go to bed straight way.\n\nW 20 Sat\n\nGo to Duty. It is horrid day. Visit CC & Cho Edmonds. Catch 7.10 train Home & go to bed early\n\nWrote to MRL.\n","34":"\n\nDull, Snow & Rain. Go for a walk up road (training). Dick T. Look at Photos & have dancing lesson.\n\n Write Bess. Edie T. (Fr.) Bert. Doris. Mum. Go for supper some\n\nF 22 Mon\n\nGo to see \"The land of Promise\". It is very good. Ken & I sit in front Row with Bill Tronters lot. Come Home & have training run. We all sit and talk afterwards.\n\nF 23 Tues.\n\nWent for Training run at 3.45 on . Do no good except at 3 legged race. Stay in at night alone & clean up etc.\n\nWrote Dad. Mum & M.R.L.\n\nF 24 Wed\n\nRecd letter from J. Mather & 2 from Home. Recd yarn all night with Tap & amp; E. & Matt Study French a bit also.\n\nF","35":"\n\nRecd. letters from Esme & M.R.L. & Aunt Annie.\n","36":" Sergts. & 1 Cpl. Motor to T’worth. Dinner in B.Med. Ward. We see K Grieves. E & I win 3 legged race & Relay Race. & Park & Paint. 2 or 3 100 yds Race. We walk Home ran dance at 8 pm have a lovely time. I can’t sleep as my leg is so sore & aching. Go to bed at 11 pm\n\nF 26 Fri\n\nLovely Day. I am very weary. A summer shower comes over at 7.30 pm I am real downhearted & lonely first time for months & months. Recd. sorted letter from Nancy Dawan.\n\nWrote to MRL. Sent flowers.\n\nF 27 Sat\n\nGlorious Day. D & I go walk round Top road & comes home. Sit read lollies 1 chores.\n\nRecd. Letter from Mrs Stephen. I my tunic buttons etc.\n\nDick & I go on oral practise catering & bombing & sit in park in the lovely cool & fresh air & yarn about Home.\n","37":"\n\nDull & Rainy Shower. D & I have on French Lesson with .\n\nWrote Aunt Annie. Jennie. Nancy Dewan. Connie. Mrs Edwards. Esme.\n\nWrote PC of London & Photos to Dad. Mum & George.\n\nF 29 Mon\n\nPlayed cricket for first time. Do pretty well. Come home & J & I sit & talk.\n\nWrote Mrs Stephen & White.\n\nF 30 Tues.\n\nRecd. Letter from Mum & Marion Clarke & Dad. Pay Day.\n\nD & I have French Lesson. We sit & yarn after with Ellis Mr Buchanan from D.J’s comes over to see us.\n\nF1 May Wed\n\nGo to get Hilarty & Charlie chap in dress. George Slatter goes with me.\n\nRecd. 2 letters from Doris Preddey. Col. Raffon comes down.\n\nF","38":"\n\nChat with George R. Recd. Letter from Norm Upton. Sew all night & pressing also.\n\nEllis goes on leave at midday Play cricket.\n\nF 3 Fri\n\nWet. Tropical Rain Storm comes over at 7pm. Recd letters from Masie & Photo. letters & lots of photos from George. Letter from Bess. Letter Edie. Sew, press & generally tidy up. Play Cricket.\n\nF 4 Sat\n\nGlorious Day. On Bays. Play Cricket & win by 8 – 1 36 to 42.ov. I go & amp; have long yarn in French to Mac. Come Home & generally mess about & amp; read etc.\n\nF 5 Sun\n\n& Wet. Starts to rain at 5 pm. T Williams & I ride to Uparon. pass Enford & Dog & Gun . Visit Major Gib & his wife son in law\n\nTea at Dunington & W. J porter visits us. Come home & clean up all & Write to Mrs E. Con. Dad & Mum.\n\nW 6 Mon\n\nHard work fixing up B2 & clean up for my holiday. Ellis comes home. Tap & I play cricket others have bath. Bert Jones comes down. We have big supper. We all talk about Bournemouth.\n\nW 7 Tues.\n\nEllis & I have a big talk. Go on with B2 ward. Pack bag while Tap writes others go to bed a little after 9 pm.\n\nF 8 Wed\n\nCatch 8 am Train & arrive London at Noon. Dine on Marylebone Station & amp; go on to Denham by 12.58 Train. Back to London at 4. See C.L. Jones. Look at old photo in office. Stay at 48A Lime St.\n\nF","39":"\n\nArise at 6.30 am. Walk round town & go to Paradise St School of Anatomy at 10 am. Send writing to N.Upton Have chase after Warrant. Meet two nice Ladies on \"Tynwald\" Calm Sea. Arrive at 4 pm. Meet Kenuish. M.H.K. Meet Marie & Aunt jennie in Dongles. Go up for Tea see Aunt Hannah & Young George Send letter to Ellis. \n\nF 10 Fri\n\nUp early. We all go to Bally Kelly for Tea & see Mrs Brooks & Mrs Goldsmith. Go home round \"The Len\" & Andreas’ Music at night\n\nF 11 Sat\n\nM & I go to Ramsay. Have afternoon Tea. Riding Home we have great fun chattering as we go along. I do not lose my tongue on this occasion. We have music & sit & talk at night.\n\nF Sun\n\nOr 14. working papers many rooms at Jurby Days get up \nlone\n \n\nRise at 7.30 wake all house. Afternoon M & I sit under apple tree in orchard. At night music sit by fire in sitting room until very late.\n\nF Dull 13 Mon\t\n\nRide to Bally Kelly for morning Tea & chat with Mrs Goldsmith M & I ride to the \"Len\" & I get sanded Auntie & I have to find a mother for chicks. We all look at Mom & settling her in and I \n\nWrote PG. Dad & Mum. I get called \n\nF14 Tues.\n\nWalk Station. Meet Mr Gorny who keeps Hotel between Sulby Glen & Snaefell Am offered drink. Get writing paper at Boat office. Via SS Douglas. Went dinner at Lime St Cafe. Meet Girl of last October at Pay Desk. Wrote Aunt Annie & George. Go via Warrington see Cromwell Statue & Russian Sons of Crimea.\n\nF 15 Wed\n\nAM Bulford 8.50 am. Reached London last night by 3.15 at 9 pm. S’bury 2.30 am and made S\/Sqt as from","40":" Recd letters from Roy & Bess. Sgts. Mess meeting. Wrote MRL. Bess. Marion. Home. Dod. MAISIE. Peg. Rube. Edie\n\nF","41":"\n\nVery hot day. Recd letters from Esme. H.Hey & Lottie. Sew all night & go & have bath etc. Roll Call at 10pm for Patients starts\n\nF 17 Fri\n\nVery hot. Go & practise Cricket after 8 pm & come home to read & write after supper.\n\nWrIte out Fanny. Roy. Norm. Jennie\n\nF 18 Sat\n\nGlorious perfect Day. Dream MRL having a cone with a tooth missing in front. He is on a Balcony & I can see as over the Seas but cannot reach them. Also that Peg & my sweet Bess is married too. Recd a nice letter from MRL\n\nWrote. Esme. Lottie. Hilda. Hey. M.R.L & George.\n\nF 19 Sun\n\n- 1235 letters to","42":"\n\nVery hot day. Play cricket in afternoon. Band plays on oval. Sit in pine all night & amp; write long letter to M.R.L. Home supper when Ellis comes home. Meet J. Vernon Wrote M.R.L.\n\nF & Hot 20 Mon\n\nGo to S’bury Tea on Lawn meet Frank. Go to Wyndham Rd. Go to meet Cis & baby. Have supper & just catch Train. Arrive home pretty late rush and charged on Quarters.\n\nF & hot 21 Tues.\n\nVery hot. Dick gets sick & we all Him. I have a big clean up & I am in a terrible mess. Have supper & write to Aunt Annie. \n\nSend parcel Aunt Annie.\n\nF & hot 22 Wed\n\nRecd 2 letters from Aunt Annie. I am inoculated. E. goes to waac Dance. Dick in bed all day but much better. I read after writing.\n\nWrote Mum. Nancy Denam. Aunt Annie\n\nW","43":"\n\nRain & hail. day. Go to room & read all night. We learn that we are to go to France very soon. Send home photo of Hobden’s Dance.\n\nD & windy 24 Fri\n\nReceived 6 letters from home. Nettie. Peg. Nell. Grandma. Mrs Niness. Read all night.\n\nWrote M.R.L.\n\nF 25 Sat\n\nNice cool day. Play cricket & get 9. We win by 26 runs. Read all night and get supper afterwards. Recd letter from W. Ha & Norm Upton. Stan Hodge killed. meditate at home & after the war. Who goes back with me & in what relation etc.\n\nF 26 Sun\n\nX \n\nI go to Kirk alone. Sen. Tidy up & write – afternoon write \n&talk to\n – Go for walk with \n\nWrite to Dad & Mum.\n\nF 27 Mon\n\nLovely day. Go out alone to Practice at the nets.\n\n ‘absent’ while feeling a bit lonely on the fields. Come home, bath & have supper \n\nF28 Tues.\n\nGo to Sarum Go on river. See Mabel P & Jessie P also all The Close & all at \"Avondale\". Very uncaring journey home. Recd letter from Jennie.\n\nF 29 Wed\n\nHave long day. Go to see ‘Niobe’ very good. Come home & generally tidy up & mess around. Read a little & Scribble note ‘arm Bone & Col. Roby come down.\n\nF","44":"\n\nRecd letter from MRL. Recd paper from Esme Preadey. Ellis receives a parcel & amp; Birthday cake inside on","45":"\n\nWrote Grandma. Edie T. W.H.A. Mrs Niness. Nell Cuneo.\n\nF 31 Fri\n\nRecd letter from Auntie Annie. Go to see \"Jane\". Come home very dopey after","46":" inoculation. Feeling very blue & sore\n\nWrote Auntie Annie & Maisie\n\nF","47":"\n\nPine goes A.W.L. I have an awful busy time. Go to see finish of existing cricket match & go home and read until dark when lights are out of order.\n\nDelivered a parcel from home & P.C. from Nancy Dewan. Billy Allison comes over to see us. My parcel has cigs. tab I am postman\n\nF 2 Sun\n\nWalk Durrington to church. It is very hot. Home drink with Mrs Seawood.\n\nCome home have bath & write & read all night\n\nWrote Mum\n\nF 3 Mon\n\nWe have a long talk at night about my I go & watch cricket match & read all night. Dream all night SW - –ING \n\nF 4 Tues.\n\nRide to Sarum. Fix bike go to Close. & go all over Cathedral with Mr F & Romsey Vicar.\n\nGo up to Mrs E & M, W.F & Dad, go on River with me\n\nF 5 Wed\n\nPlay cricket at night Tommies all out 126. We get 6 for 140 odd. 100 r 7.32.\n\nWrite & read all night. D & E goes to Waac’s concert at night not Mrs Hunt. Wrote M.R.L\n\nF","48":"\n\nSit in room & read all night. E comes home at 11.30 pm very late. Have supper of Pears & cream.\n\nF 7 Fri\n\nGo to bed at 1 pm & read all time. Tap. Comes down to write all night. I am very dopey rashes all over.\n\nFinish Dicken’s American Notes.\n\nF 8 Sat\n\nUp 6 times & feel dizzy in the head otherwise OK. Ride to W’ton but gnats & motor dust hasten me home again. Pint photo & write letter to Peg. & Nette. D & E especially E scrub out room & clean up generally.\n\nF 9 Sun\n\nAccept for one \n\nRecd letters from Maisie. Mem & Dulce. Develop prints in afternoon.\n\nGo on Bike all around Tank Hill & Amesbury with Tam. We both get very wet.\n\nF 10 Mon\n\nGo to return to opened evening with me & Mrs Edmonds Home a nice time but train journey Home is very distracting. Recd letter from Esme.\n\nF 11 Tues.\n\nGo to see Char. Chap. In ‘Tillies Punctured Romance’. It is very good.\n\nRead all remainder of night Find Red Cross Tobacco which Mrs Mills sent Lawson \n\nF 12 Wed\n\nPlayed Cricket. We win by 3 runs. A disgusting affair and foolishly throw my wicket away for 3 runs. Go to Waac’s concert which is not held. No more Waacs concerts for me. .\n\nF","49":"\n\nCatch first Train. Arr Grantham 6pm & chase RTO all around town. Reach 9.10pm. Go to bed at 1am. I have 8 changes of trains on way up.\n\nF 14 Fri\n\nLovely Day. Stay Home all morning & afternoon. Go to Cleethorpes on get a partner to . Go to theatre afterwards. See Parker’s appeal.\n\nF 15 Sat\n\nLeave Gy at 12 arr London 5.10. Catch 5.50 for B’ford & reach it at 9 pm. Have nice Travelling companions all the way. On arrival Home recd letter from Dad. Doris. Marie & Marion Clarke. Go to bed\n\n 11 pm do supper. I learn that choc. & Sweets & Book O.K.\n\nF 16 Sun\n\nbut with one hail storm. Rain at 8.30 pm met a lot of Aussie for","50":" Waters \n\nRecd letters from Dad. Geo. Laura. \n\nGo to Fargo Hosp. to see Chapman. See Sister. Watch H.Page .\n\nWrote Dad. Mum. Esme. Dulce. Mem. MRL. Have long post ride. Sent photo Marie & Mary Preddey. Dream of MRL . In Blue Print in Paddock & like \n\nF 17 Mon\n\nWet a little. Go to see a ‘Pair ’ a play with a moral. E. comes home & we have long talk & supper afterwards. I have \n\nW 18 Tues.\n\nRained nearly all day. meeting. Go to room & write & read at night. E & I have a big talk & neither feel very happy after it is all over. Je suis . \n\nWrote Laura & Doris \n\nW 19 Wed\n\n& fine all afternoon. E has cable-gram. Tam & I go to Romsey. Visit Abbey & talking . Eastleigh 4pm. Meet Col. Tea. Photo at Mill Stream. Leave at 6pm. Arr Romsey at 6.50. Salisbury 8.15 average 10 ½ miles. Visit 1 Close & amp; Tea & Avondale. 45 miles.\n\nF","51":"\n\nYesterday I visited the Green Days, at Alderburns –\n\nHave H- of a day. Tell a yid they are no good & find it is his cousin I’m slandering. Co. goes into every Room in Division. Thomas comes to me to work. Top comes Home. Starts Training write Jennie & M.R.L. Dream of Pats & Doris & DJ’s& John Caswell.\n\nF 21 Fri\n\nBut windy. Another hellish day.\n\nAnother H of a day. I come down to my Room & read all night. Go to bed early. Major Bear the madman goes off Duty & we all get happy.\n\nF 22 Sat\n\nBit windy. Tear up paper all night to Top’s pleasure. Write letters all night.\n\nRoll up pictures from Sydney send X’mas Number Sunday Times to Aunt Annie.\n\nWrote to Marion Clarke & Maisie Carter.\n\nF & W 23 Sun\n\n1258 letters to","52":"\n\nRecd letter from Norm Upton. Pull bike to pieces & have an awful job back tire & back wheel. Sit & yarn all time afterwards with Dick about France expectations. \nGo to see\n. ‘Our Miss Gibbs’\n\nF 24 Mon\n\nLovely Day. Recd letter from Roy.\n\nInfluenza very bad & we have to open Special Wards. Siddie has to work back all night. I don’t.\n\nWrote to Dad. Mum. George & Aunt Annie. \n\nF 25 Tues.\n\nRecd letter from Mum.\n\nGo for a run & do much better.\n\nDick goes to bed ill. Buy paper & print Photos also alter Breeches.\n\nMeet Jim Coylie again. Very busy day –\n\nF 26 Wed\n\nRecd letters from Jennie & Maisie.\n\nMend Puncture & generally clean up bike. Run around oval with my shirt all out & the Lady looks on. Have supper read & go to bed to \n\nWrote to M.R.L.\n\nF","53":"\n\nGo for a run. Have a general tidy up. Sew Breeches legs, brettons etc.\n\nDeam of Saving K 90\/M. & in room opp. Summerhill. See in through top window looking for something. See on Prom.\n\nW & F 28 Fri\n\nAll afternoon. \n\nGo to Sarum with Thomas. Buy lots of things & return 7.10 Train. Parcel from Bess with lots of groceries etc. Met Hilda’s double & Mabel P. & Lancashire lass. G.E.G. comes back from Leave \n\nF 29 Sat\n\nVery busy day. Go out at 6pm & field for our team who get badly beaten by 1 30 odd runs. Have a general tidy up later on & talk until bed time.\n\nTop installs a Hot water (Electric) system & one switches on the Hot water before he gets up in the morning. We Biscuits & they are lovely. Nether haven. Shorts.\n\nF 30 Sun\n\nTam & I go to .\n\nTam’s chain breaks & we tow one another Home. 12 miles in 1 ¾ hours. Get home in a filthy state & drinks are my only consolation \n\nWrote Dad. P.C. & Mum 10 page letter.\n\nF","54":"\n\nWe have Magic Lantern Show & I play the Piano. Generally mess around & tidy up\n\nDream all night that I’ve got 42\n\nF 2 Tues.\n\nRecd letter from Doris. B.2‘s play Bulford & win through on Bad Playing. Chain up bike. We have jellies etc. I first try the water pocket and it is O.K. May comes back from Port Hole strike.\n\nWrote Mrs Williams. Nancy Dewan. Roy.\n\nF 3 Wed\n\nGlorious Day T & I ride to S’hampton.\n\nIt is lovely. We have fruit salads Wharf where we first landed from Egypt. Visit Shirley. Redbridge Romsey. Ride 22 miles through lovely Hampshire in under 2 hours. Call at Mrs Edmonds. See Roy’s Name in latrine at Romsey\n\nF","55":"\n\nVery hot day. Half Holiday. out to play cricket. Pellen gets 74 & all 170. \n\nGo out 29 out for Tennis & cricket & Play catches with Wright & Top.\n\nRecd 6 letters from Home. Maisie C, Marie Auntie Annie. Marg White. Mrs White. Bess. Lottie. Bert\n\nMeet George Wilson from B’wood playing cricket.\n\nWrote Jennie & Maisie\n\nF 5 Fri\n\nVery Hot. Try to fit & make \"into small of the 1 ½ hrs work. Lean a lot bike & generally tidy up more office to Expense Store.\n\nF 6 Sat \n\nGo to S’hampton & ride across Punt (Floating Bridge) to Bridge & Park Gate. Back & sit on Pier. It is lovely & we think of sitting on our own Pier. Have supper with Mrs Edmonds & arrive Home about 11.30 pm.\n\nHave a glorious day but opened 11\/-on tricker fell hungry all the time\n\nF 7 Sun\n\nHot. Dopey day. \n\nPlay with the cricket Ball all night & enjoy myself immensely. Send photo of Southampton & of Room & & of myself at Eastleigh.\n\nWrote Mum \n\nF 8 Mon\n\nVery hot but lovely at night.\n\nPoor May goes away & Siddie & I play cricket & have supper with Top.\n\nWrote Dad. Mum 6 & George.\n\nW 9 Tues.\n\nHeavy Rain Storms etc.\n\nRead all night & go to bed at 9.15 am in daylight. First time all Summer with one exception. \n\nDraw up new standing orders.\n\nW 10 Wed\n\nHeavy Rain Storms & Hail.\n\nGet organised & dressed to go to Picton\n\nGo with T. Park. Paint Hall E & I all around Beacon Hill in bush walk.\n\nWrote Roy. Norm. Bess & Aunt Annie\n\nW","56":"\n\nTorrential Rains. Joe is & sleeps in our Room. Write all night. Col. Goes on leave. Ellis goes playing its keen.\n\nWrote M.R.L \n\nWrote Doris. Maisie. Carter. Peg. Cyril. Bert\n\nW 12 Fri\n\nRecd Socks, Chocs & Cigs from Maisie Carter. Rains like Babylon & I stay in room & read all night.\n\nT.B. Wright & I play with cricket ball & we get sore hands T & I go for our & wicket\n\nW 13 Sat\n\n& Fine. Go to Sarum at 2 pm. Go to 13 & close . Have nice time & dinner at YM & Osmonds.\n\nRide home in 45 minutes. Go all over old Sarum it is a wonderful place.\n\nF 14 Sun\n\nT & I go to fight Dean & through long at . Try to pinch dog but no luck. Have for supper & Top line meat Billiards.\n\nWrote to Jess N Lottie. Mrs White.\n\nF & W 15 Mon\n\nMESS MEETING. First Patients Parade. Mess meeting a joke. E. goes out on Bike but they can’t kid me.\n\nWrote Elsie. . Mrs Edmonds. Dad & Mum.\n\nE. gets as wet as an otter.\n\nW & F 16 Tues.\n\n very bad & have to start treatment. Go to bed early. Very busy day & I don’t feel being bright.\n\nW17 Wed\n\nCatairh bad again. Ned Edwards goes to Aussie either yesterday or today. Read a little & Top gets J Powells from home.\n","57":"\n\nRecd letter from Dad & P.C. from George. Sit in room & mess around generally. E. has the dopes badly. I am not too good with Catairh.\n\nE. goes to Bristol on","58":"\n\nW 19 Fri\n\nGo to Sarum by 6.50. Stay at do 13. Marion & I go to Palace. Dream all night of the Beds occupant & that war is over. Recd letter from Roy & Mum on","59":" Palace no good but spend nice evening.\n\nF & W 20 Sat\n\nTerrific Storm in afternoon. Go to Ms Minster at 7.25am. Arr at No 1 i.d. 9.30pm Leave at 10.15pm & motor halfway. Meet Padie friend of Mr Roschurgh & in Book Shop. Chat ½ hour with girl. Home lunch\n\nMeet Lt. Gibson from Lauderdale arr 8 F.A. & 3A. G.H Know all the mob.arr. back at 2.15 pm. Travel with Sgt. Inwood V.C. Home","60":" & Tea at No 13 Meet & all go mad. Go to close for 1 hour & see Cpl Weymouth’s Photo\n\nF & w 21 Sun\n\nTommy Sports. T & I go look at ‘em at 6 pm. Team up all night straighten out things a bit.\n\nGo to bed early\n\nW 22 Mon\n\nHave a long day & say Au Revoir to Mark Marsh. Get a horrible Electric shock & wet everything in the joint \n\nE. reads a book.\n\nWrote Mum (Photos) Dad (Photos) M.RL.\n\nW & F 23 Tues.\n\nWet all morn. I go to. Warminster. Get sopping wet. Meet Sten. Ronie & Jane from Collingwood. St. Chapman bolts & I have to come back with Amesbury girl to Sarum & Bristol Girl to W’minster. Salis. back to Salisbury & then Amesbury Girl. \n\nF 24 Wed\n\nLovely morning & rain. 3 pm. Arr in bad with everyone. Bath. Supper. & write. Recd. Letter from M.R.L. Feeling pretty well again Wrote MRL\n\nW","61":"\n\nRecd letter from Jinnie. Rotten Day. Go up to mess & place Billiards all night\n\nW & F 26 Fri\n\nTom comes down & we play cards all night in our Room\n\nF 27 Sat\n\nWith one huge storm. T & I go to Rotten W.C. Sports. Go up again after Tea & just get wet a little. Play cards & go to Dunnington Cross Stones afterwards. I come Home Knocked out & T & D come down afterwards & we talk about various subjects for an Hour or more.\n\nF 28 Sun\n\nPut in for leave. Col. Y.M.C.A me only Hallett. Ride to Tilshead. Lovely ride & come Home in time for walk & supper.\n\nWrote. Roy. Mem. Mrs Niness. Dad.\n\nF 29 Mon\n\nGlorious Day. Go for a run to Durrington & back again on bike.\n\nF 30 Tues.\n\nGo to see The Glad Eye. Very good show. We all come Home & talk.\n\nF 31 Wed\n\nGo to Sarum old castle, the Wilton Factory. Have Gipsy Tea on the old castle & rather a nice time. We have a rare feed at . Darkie is worried \n\nW","62":"\n\nWe have a large Party in our room & everything goes off well eve to Supper for all concerned.\n\nW 2 Fri\n\nGo to see who’s the Lady. It is very fine. We come Home & have a very nice Supper. I play Billiards afterwards.\n\nW 3 Sat\n\nI go to Sarum by Train. Go to Go on River. Leave at 20.13 at 9.05. & arr B’ford at 10.25 sopping wet. Have nice time generally. We get wet a little on the river also.\n\nGo to D.O.C.\n\nF 4 Sun\n\nWrote Nette. P.C. Clean bike all afternoon. T & I walk to D’ton. We try to meet wife my looks are beautiful & we sit & rest. Flo. Looks like a Picture when we see her in the lane. We talk to the old Washer woman in Water St.\n\nW 5 Mon\n\n. I go to Sarum, to Baseball Match & Sports after Home to No. 13 to Tea. 6 rg are ok. We play all sorts of games & have a real jolly High time the like of which we have not seen since the war-\n\nF 6 Tues.\n\nNothing doing. Come Home & generally tidy up. Tap is nauseous. Tom & all of us talk until lights out after Top gets it off His chest. \n\nF 7 Wed\n\nReal Hot dopey day. Send write to Aunt Annie. Recd. Letter from M.R.L. Write to Dad Maisie\n\nF","63":"\n\nRecd letter from Dulce Butell. Go to Pictures & intend going for a run but go off to sleep & am only awakened at 10 pm.\n\nErye & Top. Very Dull & dopey.\n\nF 9 Fri\n\nRecd 2 letters from Home. Marion Clarke & Ida Walter. Sew & go for a run around oval. Lovely Day\n\nF 10 Sat\n\nPack Bag & sew Breeches. Take sewing out onto tennis Lawn while E & T. play Tennis. Go for a run afterwards. Recd letter from Strobmugh re song. Get Tunic from Tommies at","64":"\n\nF 11 Sun\n\nGood Cricket Match. F’rat get 60 & 6-140. B’ford 137 & 455. Tidy up & watch match. \n\nRecd parcel from Dulce of cake, chocs & coffee Letter from Roy.\n\nWrite Mum.\n\nF 12 Mon \n\nRushed down to station. L’don 3.45. Catch 5.20 to Liverpool. Stay 48 Lime St. Go to YMCA for Supper. Travel with Sailors & play cards. Love Re book voucher. We have many disappointments.\n\nF 13 Tues.\n\nGet down for 9.30 boat & it goes at 1 pm. Travel with Yankee Doctor & 3 Ladies. Am Home 9.30. Supper & talk until Bed-time. All are well. We walk Home. Manse Kippers for supper. Boat crowded Tynwald.\n\nF 14 Wed\n\nStay at Home all morning. Go up to in afternoon. & gleaning. Very hard work. I go a la Egypte dress. Ride home in 28 minutes. Music & talk after Tea. I am told not to sing. \n\nF","65":"\n\nGo to Peel. All or in Castle. Meet Yankee officer. Take Photos. See sweeps from Lusitania. Ellis swims. Long wait at Peel Road. See Knockaloe. Dinner in Peel. See Cathedral where aunt Pally was confirmed. Also Cloth Hall. M & I walk Home.\n\nF & W 16 Fri\n\nRide to Ramsey. No swim. Sit on beach. Afternoon Tea & ride Home via Lezaire . Giddy very tired. More music & talk. I chop wood. Uncle & I go mushrooming & to the Smith’s forge. Charge 15 M6 about\n\nF 17 Sat\n\nSpent morning pottering around. Cleaning Bikes etc. In afternoon E goes to Douglas. M & I we sent on a Picnic alone. We are by rain but find cover, although not of the very best. I get E. very wet & dirty. We have tea & things out in the rain but feel rather disreputable in a ditch. I am the Turk to the life music & song by m. I am to Shut up.\n\nF 18 Sun\n\nWe hear on Fortunes. I will have to cross to lots of water for my Happiness. I look over Books. I am tied. I am not very Brotherly. Drive down an at Stanley Home 7.30. Walk on Prom. Hear band play abide with me. Am very dopey\n\nWrote Auntie Annie.\n\nF 19 Mon\n\nWake at 5.25. On Boat at 5.50. Leave 6.40 arr L’pool 11.20. Dinner at Café Ratten Concert by Sweets or Music. Catch 2 pm arr. Euston 6.50. \n\nMeet Neville Seatree. Catch 8.55 at W’loo change . Am Home 12.0\/e. Very tired & weary\n\nWrite to Marie & Dad\n\nF 20 Tues.\n\n Day. Recd letters from Doris. Mem. Muriel Davies. Sadie McNiven. Edie. T. Laura. Geo. 2 Dad. 2 Mum. Also papers. Read & wrote all night. I am very lonely & in love with all the world. Recd Field and Norm.\n\nF 21 Wed\n\nRecd letter from Maisie Halm. Last of War Babies march out. Have a general tidy up all round. Wrote the bottom letters on","66":" 6 F. Cap to in. Wrote Norm. Jennie. Roy. Very Hot Day. Wrote to LN.W.Rly & MRL & Auntie Annie.\n\nF","67":"\n\nVery Hot Day. Generally tidy up & read for the remainder of the evening.\n\nWrote to MRL. Dad & George\n\nF 23 Fri\n\n& Showery. Darn socks & play Billards & Snooker. Ellis goes to Leeds only with a head cold. \n\nPrint two negatives.\n\nF 24 Sat\n\nGlorious Day & Glorious Moonlight Night. Ride to Sarum. Go to C2013 & then to CC & close.\n\nNat Australian Ententainer (Pte Taylor alias Turrell) & Jack Kershaw. Go on River & have just over the Hour. Go back to C2013 for supper. Recd letter from Norm. Send Parcel to Marie.\n\n1317 letters to Here.\n\nW 25 Sun\n\nRecd letters from Home 4. Nettie. Bess. Lottie. Edie. T. Peg. Super Ford Print Photos all night with Ellis & Tam. Card party afterwards & Ellis & Tam do not get or speak\n\nWrote to Mum\n\nF 26 Mon\n\nDull & Windy. Have a clean up & go up to mess & play Billards & cards against Tappin & win Easily for the first time.\n\nWrote MRL 6\n\nF 27 Tues.\n\nPack up all Books for sending Home. Wash room out & generally tidy up. Go to bed & read a little. I read good news about France from George.\n\nWrote to Dad.\n\nF 28 Wed\n\nGo Bike ride & puncture. Take off tyres twice & can’t manage. Come Home & Bath & play Cards all night till 11pm. Recd letter from Marie. Dream all night travelling everywhere in train. \n\nF","68":"\n\nMend Puncture & write all night. Recd letter from Auntie. We hear of am going into Barracks Rooms. Dream of as Y.M.C.A workes & all Monty Girls. Peg. M & Bert. In Blighty. Much in Public \n\nWrote Auntie Annie. Miss Rowley. Dulce. Bess\n\nF 30 Fri\n\nWe play Billards all night & get wollapped & also win. I dream of 10.M & Ollie Cardle. Ellis is with me & is very lovable & we sit on . O is also amorous\n\nSend Cigs to Mr G. \n\nF 31 Sat\n\nWe go to N.Z. Sports meet it is a very cold windy day so we do not run. Ellis & I do all on sorting out preparatory to moving into . Tommy comes down & we play Cards & finish up with supper of & Bread & Butter. Go who are","69":" class.\n\nThey win 170 to 120 Cricket. Team to play tomorrow.\n\nF","70":"\n\nGo to Sarum. Go to E and meet . Go to Close. Meet Cpl. Weymouth at C.C. I have night chat with C. Lancashire lass & Cpl W. Go back to Mr E. Meet Tom at 6 mile post. Supper at Amesbury YMCA. Hang on back of Amesbury. Bus on way in.\n\nF 2 Mon\n\nLong hard day. Go to To-nights the Night. Front Row. It is lovely. I get very over it.\n\nGo & play Billiards afterwards & get badly beaten. We T & I talk confidentially. Ellis goes B . \n\nF 3 Tues.\n\nSend Parcel to MRL & to M . Recd. Parcel from Mrs Clarke. Letter from Roy. Take half-holiday & fix up my kits Wash all my clothes & write PC’s. D. E. & I play Cards\n\nWrote Dad. Mum. George & Marie\n\nF 4 Wed\n\nRecd letters from Maisie Carter. Esme & Alice. Meth. Darn socks at night & waste rest of time at Billiards. Sibby is happy. Dream of party. Sit on Knee. Dream of Pond for Coffins & to go in airman in Trinity church yard of again playing Piano.\n\nW","71":"\n\nVery dopey day.& I’m L-sick or H-sick. Recd 2 letters from Home & photo of Georgie’s skiff. Ernie. send off. Recd letter from Mr & Mrs Gregson. Bluey Joy comes over – \n\nWrote to M.R.L. (6 PPs)\n\nF&W 6 Fri\n\nMet Bob Simpson & Harry Johns. Also Eugene \/ . We all play cards at night. I am very dopey & tired Go up to impromptu concert at the mess. Write to Peg R\n\nF 7 Sat\n\nSports We go at 10 am. I run 3 & Parky 2 in 440. In 60 seconds. Home for Dinner. Run in Final. No good. We run","72":" in & get a prize but do not know about it. Come Home feeling O.K. I lie down & we play cards afterwards. We have Tea on the Ground but the Sports are seen. We have Aussie Girl from A.M.T.S for lunch & Tea It is quick & leave her again.\n\nI hurt my toe in the shoes.\n\nW 8 Sun\n\nVery nasty day. I play for Y.M.C.A Service. & go next door afterwards for supper & chat. A nice Library & nice people. Hear a sermon \"Laughing Jackass & dead kangaroo\" More Mockery.\n\nWrote Mum. Mrs Edmunds. Con\n","73":"\n\nRecd letters from & Esme. Go to Pictures. In 1st see with all . ","74":" winning a wife 5 Reels. More mockery\n\nCome Home & go to bed & read. D. that someone is trying to steal.\n\nWrote to Auntie Annie.\n\nW 10 Tues.\n\nRecd money from L.N.W. Railvy. Go to theatre with E. \"Her Excellency the Governor\" and make love & my double affair as His greatest asset that He sleeps in . More mockery. It is very cold. I come & go to bed & read. \n\nW 11 Wed\n\nPlay for Y.M.C.A lecture Christian Martyrs & finish letter to M.R.L & post it.\n\nGo to Bed & read for a while –\n\nWrite Muriel. Davies. Bess. Edith Tauchner. MRL\n\nW","75":"\n\nRecd letters from Lottie. Peg. Dulce. Maisie.Carter & Photo. Maisie & Aunt Annie\n\nGo to WAAC show & print Photos. Meet Kilty. She goes too so I go to call the Roll at 9.45 pm. We play the game hunt the ring. \n\nW 13 Fri\n\nRead letters from Home 4. Go to Sarum by bike in 50 minutes. Meet Percy Edmonds. Go to Palace & order Dumas’ Books. Buy food stuffs at an awful price. Go to Palace & see Girl comedian. Sleep at Cl013 \n\nF&W 14 Sat\n\nRecd letter from Con. Get Home a little wet by Car from Station.\n\nStraighten things out all day –\n\nTidy up generally at night. Bitch comes down to see us. YMCA. \n\nMoved on","76":" to a Division.\n\nWrote to Mr Gregson. Miss Rowley. Con. Auntie Annie.\n\nF 15 Sun\n\nVery busy day. I go to write letters & meet Norman so I can’t write until after Tea. \n\nWrote MRL (Dad.um. Sent Photos.) Roy. Jennie\n\nW 16 Mon\n\nWe have noises in the night & Ellis gets up to investigate\n\nVery windy & wet.\n\nWrote Maisie Carter. Lottie. Ida. (strickout) Roy (strickout) \n\nWe play Billiards & Bridge.\n\nW 17 Tues.\n\nGo to Sarum 12.29. Go shopping & to close. See procession & Gen. Slater in his cars. Go to c10.13. Back to Close. Go to see H No good. Take Girl to with Bridal bouquet. See old Chest in Vestry. Go to do 13 after supper Very dopey. Bed 1am.\n\nF & W 18 Wed\n\nVery wet at 9 pm & Tam comes down. I write Poetry. \n\n1355+1 letters to Here\n\nWrote Esme. Sadie. Maisie. Hardom. Marnie Clarke. Nettie. George.\n\nF","77":"\n\nWith 2 showers ½ each & lovely rainbow at 6 pm. I go for walk around block & E goes to dance. Recd letters from Marie re sweets . I have a long hard day & fix Electric Cooker after Tea.\n\nWrote M 12 LES. NETT. marched out on","78":" Dulce & H.Hey\n\nF & W 20 Fri\n\nGo to Pictures with Harry. I Recd P.C’s from Norm (Lord St L’pool) & Mr G (Lord St S’Port). We have another patient strike & co comes around my division\n\nWrote Laura. Mr . Gives me list of jobs that he’s neglected.\n\nF & W night 21 Sat\n\nGo for a walk around the block at night. Recd a letter from K. Pine. Have a H- of a day. Tommy. W. comes down & we have a long yarn. We are both in a very bad skin yet at all \n\nWrote Mem. Marg.Alice. to Maisie. Ken Pine. Norm. Doris.\n\nW 22 Sun\n\nI work all afternoon. Go for walk with T.W. & E after Tea wind through D ‘ Con meet Ethel on Road – we nearly get caught in Rain\n\nWrote Mum\n\nW & F 23 Mon\n\nLovely day only showery. Go to see C. Chaplin a Dog’s life. With B.B. V.W. TW & E. Come home & go to bed to read.\n\nRecd letter from Roy\n\nW & F 24 Tues.\n\nTap comes home. Trains are on strike & Patient are sent talk from Salisbury. Play at the mess have Tea once again & go to bed to read\n\nF 25 Wed\n\nRecd letter from M.R.L. Fox dies with meningitis & I write all night until Last Post.\n\nCome home very tired\n\nWrote Mr Havercraft.\n\nF but dull","79":"\n\nRecd Parcel from Bassie X. Have a long busy day. Come home & \nread all\n Write to M all night up about calcium. Go to bed & Read\n\nRecd letters from Jennie.\n\nWrote M.R.L but did not post until","80":"\n\nF 27 Fri\n\nI move to Hut & go to Dunnington for walk. Tea at Mrs Seawoods\n\nMeet Tommy officer & Prains & Mr Church of Plough Inn. Tea after Piano & walk nearly to Bulford with H. Come home & play Billiard & go to bed early \n\nF 28 Sat\n\nLovely Day but I am too busy to go out. I have to write 2 letters by morning. Meet at 7.45 & walk home to Dunnington – Lovely clear night & I thoroughly enjoy walk.\n\nWrote Mrs Edmonds & Hilda.\n\nW 29 Sun\n\nCeaseless rain all day & all night. I light fire in offices. Tomo & I get sopping wet. Come Home & sit in office to read. After tea Room come to play cards & go to bed Very cold at night\n\nF 30 Mon\n\nbut windy. Wrote Hilda. . Recd letter from Marion Edmonds & Mr Havercraft. Go to D’ton with H.R. patients got another Blanket. Lovely night & nice ride back Home. \n\nWrote Hilda. Rayner & Miss Peck. Very cold night.\n\nF","81":"\n\nLovely day first white frost. All W.C.Os change jobs. Go for ride through Amesbury with Tam. Come back & play Billiards & snooker. Rather play on part.\n\nF 2 Wed\n\nlightly Dull. T & I practise Hockey on tap Ground. Isolation lifts. I write all night.\n\nWrote Roy. Connie & Marion Edmunds. Wrote M.R.L. Jennie. Mr Havercraft.\n\nF","82":"\n\nGo to Ball with Johnnie Walker. No 213 one both","83":" prize winners. Dance with town Girl & Miss Moore from Brisbane. Dances in","84":" half & got disappointed in Waltz Cotillion with Miss M from Brisbane\n\nRecd letter from Auntie Annie.\n\nF 4 Fri\n\nRecd letter from Maisie\nEdm\n \n\nAt Southport. Go for Hockey practise with Tom. Go to B’ford with Tap & meet T & E on Bridge. Come Home for Supper & play cards\n\nDull 5 Sat\n\nRecd letter from Marion Edmonds. See Col. Raffon. Gen McKye & GIB in Bath. Fix bike mat. D.O.R.A & Go walk with H.R. Go to whist drive & score 153 -190 178 wins. Meet Colleen again & train Girl or Girl Guide. Home bonnie evening altogether.\n","85":"\n\nLovely Day. Meet Col. Raffon. He tells E about France. \n\nRecd letter & photos from M. \n\nPlay Hockey after Tea & go walk to Cross Roads to meet H.R.\n\nWrote M.R.L. & Dad.\n\nF 7 Mon\n\nCatch . Play Cards in Van. Motor through St John & to Marylebone meet Jack O’Neil (Billy’s Brother)!\n\nGo D.J’s meet C.L. Percy. Der. Bab. Doris. Doreen Walker. Madame Tussauds & \n\nF 8 Tues.\n\nArise 8.30 am. Talk all morning. I’m at Museum. Nat. Art Gal. Trafalgar Square. Lyons Corner House Pretty married Lady.","86":" talk. Opera House. Recd latest depatches 8.13 to S’bury. arr 11.50. Leave . 20. Home 1.30\n\nW 9 Wed\n\nRecd letter from Bess. Jennie & M.R.L. Ceaseless Rain. Pretty tuned & dopey. Go to the flat & write till 9. Bath & bed\n\nWrite M.R.L. Bess. Jennie Mather.\n","87":"\n\nDull & wet. Recd letter from China Dobson. See MOORE outside clink – P.W.I (Sgt) marches out. Go to Dance Y.W.C.A. Have good night, play 2 matches get frightfully Hot. Last Dance with Moore\n\nWrote Cyril. Ceaseless Rain\n\nW 11 Fri\n\nRecd letter from M.R.L. Send Telegram. We talk & play Billiards. I get amusing myself at the piano.\n\nF but dull 12 Sat\n\nRecd letter from & letter . Keith comes over and we have a long talk. Go to W.Y.C.A after Tea & play Piano & cards until 9 pm Supper at the club & then Home to bed.\n\nWrote Mum. Chris. Marie. Mr Geyer\n\nF 13 Sun\n\nGlorious Day. Recd letter & photo Peg. Letters from Mum 3 Nette. Ken Pine. Ruby G. Reg. Park. Tap. E & I go up to . See scores of Planes. One dives into the earth. We play cards all night. We have Poultry for Dinner.\n\nW 14 Mon\n\nRecd letter from Auntie Annie with sweet nothings. Jim Robby comes over. We play till 8.30 in office & I go down to play with Dick & Ellis afterwards\n\nWrite Peg. Nette. Ruk.\n\nF 15 Tues.\n\nRecd letters from Home 5. George. Clare. Lily P. Bess. Pay day\n\nWrote Bess. Etta. Ken. Pine. Lily Porman. Clare. Jennie\n\nF 16 Wed\n\nLovely Day. Ride to Sarum. Go to both Homes & do gardening. Meet Jim O’Brien. Take Girls back to . Recd. Letter from Connie. Stay at d013 Have very nice time –\n\nDream of swimming in river.\n\nF","88":"\n\nDream I fall the right in untidy underwear on 17, 10.18. \n\nLovely Day. Moonlight night glorious ride Home. Hang on Motors Tailboards. Go to Dance. Home time. Keith comes over. M. & I chat E. is bored. Recd parcel from Home with cake, chocs & Sweets.\n\nF 18 Fri\n\nDull. Recd. Letter from M.R.L. go up with Tam for Hockey. Very strenuous. Go to Pictures with Jim Robby. See \n\nWrote to M.R.L in Slumbering Fires go walk towards P House. Lovely moonlight.\n\nF 19 Sat\n\nMeet HR & T in Town. Play Hockey with T.W. Ride to Village with Dope. Go to Dance. Dance without stop until 9 pm. I am very tired physically & glad to get to bed at 9.30 pm.\n\nPick all good Dancers & have Royal times\n\nWrote H.R. Auntie Annie. Ethel. \n","89":"\n\nDull & rain. Recd. parcel & letter from Doris & Parcel from Dulce. (Tea & Sugar) we play cards all night.\n\nWrote Mum & Dad\n\nF 21 Mon\n\nJim Robby comes over & we sit & chat by the fire all night. I go walk as far as Y.M.C.A. Recd letter from Doris & White & Roy. We have supper at Miss Peak’s Home.\n\nF 22 Tues.\n\nLovely Day but very cold all night. Sent off P.C.s to Jess. Dulce. Maisie. Ruby. Edie. Bert. Nancy Niness. Muriel. Eilleen. Aunt Fanny. Ida. Mrs . Jessie Walker Lottie. Peg. Mrs McBuike. Nette. Mrs Merrett. Atto. Jim Robby Au revoir\n\nF 23 Wed\n\nLovely Day. Go to Dance but feeling very sick – too ill to dance to second half. Lovely show nevertheless we have a royal time. \n\nRecd letter from Doris & Ethel Wheelhouse.\n\nTele. from M. sent one.\n\nF","90":"\n\nGo to Dance in Y.W.C.A. Very good time Ruth . Make a mess of music for . Do not dance very much for I’m very tired\n\nF 25 Fri\n\nNothing doing. Go down Flat – straighten gear up. Play cards & have supper at camp fire etc.\n\nWrote Mr Love\n\nDull 26 Sat\n\nPlay Hockey we win 3 – 1. I am very stiff. Walk D’ton stay an hour. Hurry back & go to Dance. Only one dancer. Playing & . Supper with Irish Beddy. Home & to bed. Read. T stops out all night. & Dicks very nice.\n\nF 27 Sun\n\n1430 letters\n\nRay Mitchell comes down to D’ton with medicine. Go walk with Tam. See Bernard Moore on road. Very stiff & sore. Don’t sight T. at all.\n\nRecd letters from Lottie & Dulce\n\nPlayed cards all night\n\nD 28 Mon\n\nBut no rain & misty. Toms goes to Blackpool. Go to Pictures as I’m all alone. Come Home to play Billiards\n\nWrote Dad. Mum & George. 1430 letters to here.\n\nF & W 29 Tues.\n\nGo to Pictures after Packing Bag for Island. See \n\nSubmarine Picture. Come Home & go to bed early\n\nF 30 Wed\n\nBustle around. Recd. Parcel of Socks from Miss . Send Parcel to Auntie & G. Catch 12.27 with Jack. Dinner in Salisbury. Trend with Tommies & ladies from Southport – stay at c\/o #8\n\nF & W","91":"\n\nCross with Young Downward & I get very sick twice awfully rough day. Go from Coburg Docks. Go through Liverpool Museum Tynwald – arr. 5.40 pm I sight all my Island Folk \n\nW","92":"\n\nAwful Rain Thunders. Go to Sullyhill in & come Home for music & millinery. We all sit & tell stories around the fireside.\n\nW 2 Sat\n\nTerrific Gale. Go to to send Telegram. Awful gale & make no headway.\n\nGo around by . Get sopping wet. Home & we play Patience all night. Clean camping sacks I dream of Auntie & Uncle chasing me down the drive in Night Clothes \n","93":"\n\nWe have nice quiet day & tell fortunes by fireside. We talk & play & sing all night until 11pm. We are all very happy especially Harry\n\nWrote Auntie Annie.\n\nW 4 Mon\n\nWake 4 up at 5. Have hurry to train. Very rough weather. Not sick see the Tynwalds desk rails all smashed up. Arrive Liverpool 2.05. at Warrington Dinner. Meet WRAF us for as Supper at Union Jack Club. Leave at 10 pm. 12.30. Sarum 3am 3.20am. Arrive home 9am.\n\nF 5 Tues.\n\nLovely day. Recd letters from Alun wife Jennie. Nettie. Ken. Pine.\n\nPack up all day. Go to Faust with Tap. Reg. Mac & Sister Collins. I feel very dopey & am sorry to leave.\n\nF 6 Wed\n\nLovely day. Reached after saving au revouir at Salisbury. Go to Y.M.C.A. for concert with Val. Everything in order & history repeats itself as I write to Marie in YMCA’s -\n\nWrote Dad & Maisie in YMCA\n","94":"\n\nLovely Day. Parade with full pack & we get very tired. School in afternoon & Thomas nearly . Corpe to Cains lecture at Y.M.C.A. & music in the mess afterwards.\n\nW & Fine 8 Fri\n\nafter 9 am. Go for walk with Wlta march out to Train. Get good seat & arr. F’stone at 3.30 am. We cannot sleep for fun about our until 5.50 am. We are all jolly.\n\nMem. Lottie. Mrs Wilhaus. Wrote Nette. Bess. Ethel. Dulce. Cyril. Miss Niness\n\nF 9 Sat\n\nLovely crossing. We are crowded but get good position. We miss a mine by 200 yds. Awful march up to one Blanket Hill but Froggie carries my kit. E & I go down Town for a good meal & hear the R.A. orchestra in S.A. on return. \n\nWe turn in & sleep well although it is very cold –\n\nSent views of Folkestone to Dad & M.R.L.\n\nWrite M.R.L. in S.A. & Y.M.C.A. . Sent & \n\nW10 Sun\n\n& Dull. E & I go all around The Old Cathedral. Dinner in Hotel very good.\n\nGo to & I which E. likes hot. Go to met Cpl Burke several other NCOs that we know. Have bonnie time after very good day.\n\nWrote Dad. \n\nW 11 Mon\n\nDull & wet after 9 am. We go down the Town but return to march out. Only 20 men on parade & we can’t so we all go down Town again together. I go all around the Place & drink. 2 glasses vin blanc\n\nWrote M.R.L. P.C’s to Dad M.R.L & Home. Sleep in \n\nF 12 Tues.\n\nLeave Boulogne at 12.30pm &am and march to Wiemere about 5 Kilos. Train at 2.45. We are comfy & warm & it is a lovely day. Pass Etappes Abbeville Rouen . See Ruins & etc.\n\nWrote M.R.L. a long farewell.\n","95":"\n\nWe have a feed of apples from Truck van. at Etoulles & base at 10.15.\n\nMeet Roy. Get issued with gun. March out again at 5 pm & spend 1½ hrs in house. in No 39.\n\nPlace lit up & we have warm welcome from \n","96":"\n\nF Ice. We have a Turn all around the Hospital. We have a riot at night & bottles & other things fly pretty strongly. I sit in mess with all others & write. No leave for anyone.\n\nWrote M & Mum. \n\nF 15 Fri\n\nIce. Everyone stands to Guards C.G. & G.G. but come up to take away rioters. No leave again. We are both sick & awfully fed up. Just stand by all day as usual. Joe comes up again.\n\nWrote Con & Mr Edmonds & amp; Doris (Good Bye)\n\nF 16 Sat\n\nIce M, D, E&I I go down Town together & return alone.\n\nMeet two Waacs no . if Auntie saying how like & too near KIM. M & one other on long blue ribbon is I go for a swim\n\nF 17 Sun\n\nIce. We take over & it is us now. Generally . Tidy up. Go down in Cliff slide with R.A.W.E. Sergent. Feet very sore. All shops open. Return early.\n\nWrote M.R.L. Dad. Dream of Flint with \n\nF 18 Mon\n\nF. Warmer. Go down Town alone & try to for Maisie but nothing doing. Buy P.C’s etc. Note all cafe’s on Quay. Pay day.\n\nWrote Auntie Annie\n\nF 19 Tues.\n\nF. I do dressing blister my fingers. Play piano & yawn all night. Hard work all day – . Wrote Roy. Jennie. Laura. – \n\nF 20 Wed\n\nIce & Fog. I fail to in D.T.S. Go to Y.M.C.A. concert reserve seat but Val & amp; I have to get out ‘cos WO. Sees us. We have grand inspection of Tents. Wrote M.R.L. – \n\nF21 Th\n\nGo down Town & all about docks etc. Trying to buy present. Meet & go to Y.M.C.A. hear band concert. Dr – M. falls into my arms & he caresses my much. I gather lots of passion-fruit which no one knew about. Home 8.15 pm –\n\nF 22 Fri\n\nThings awful humbug. I am properly fed up especially at being told not to mention Bulford. Write & sit by fire all night. Ken Pine. Bess Wrote Dad. Mum. Geo. Julia. Norm. M.R.L. A Annie\n\nF 23 Sat\n\nLovely day. We shift all timber from Trenches. I am Ord. Sergt. Major. Stay in mess all night. Play gramophone & write all night. Dream I am married to Ollie Condell – in Burwood. Peg. Marion Clarke. Nette. MRL. Edie\n\nWrote Nancy Dewas. Ethel. Bert. Jess.\n\nF 24 Sun\n\n& Raining at night. R Carlisle comes up to visit us. We all go down Town. Meet J. off in Hotel. We have good long interesting yarn. We are crowded on trains coming home. I have a good visit around La gorge. General Inspection. I meet Ollie Condell’s double. Dream of M.R.L.\n\nW 25 Mon\n\nRecd 3 letters from Home one from George. Bess. Peg. Marion C. & Maisie. Carter (2 with Photos) also M (10\/11\/18). Go down to meet R.C. but go shopping with 2 Yanks. Buy & & Biscuits for","97":" Recd. a parcel each cakes, sweets etc. from Home. Wrote M.R.L.\n\nW 26 Tues.\n\nMiserable day. Go down Town by Motor past Casino & along Sea Front. Meet Scaler & Morell in Crystal Palace Home & play cards. Recd. Letter from M. send parcel to M. Meet F and on train. We have hello squeeze.\n\nWrote 4 Bon Lottie to M. \n\nW & F 27 Wed\n\nHail Storm. Inspection OK am O.S\/M. Spend evening writing in of boats & Wrote Bess. Peg.Wrote Top. M.R.L. W. E. Smiths. Mem. Marion C.\n\nW","98":"\n\n1487 letters to here\n\nThe water supply runs out. I motor to A.G.B.D. We get bogged & pull us out. See S\/S Miles with pack up. Meet Joe & Roy. We get to Harve & I go to see Reid. Arr. Home at 8.15 pm. Dream of M.R.L. & Flossie of Duinton also A & amp; E .Wrote to Maisie\n\nW 29 Fri\n\nWater run out again. Wretched day. I lose my Black Toe nail. Get very, very wet. Am very off colour. So play patience & go to bed before supper. Wrote Mum & Auntie Annie\n\nF 30 Sat\n\nFill in trenches & bag cabbages. Recd letter from Connie & Parcel of Biscuits cigs etc from Marion Clarke. We go down to Town at night shopping etc. Y.M.C.A. concert. Ellis comes annoyed because Y.M.C.A. woman insults him – my feet are in a very bad state & I am generally crook\n\nW","99":"\n\nJoe & another come over to Tea & we go down Town. Go to Church at R.C. & amp; then Y.M.C.A. We take 2 WAACs for walk & wWe misses the tram.\n\nRecd letters from Mum. Maisie Carter. & from M.R.L. on","100":" Rotten Day\n\nW 2 Mon\n\nE. goes to Hospital & Thomas also. I go down at Night to Casino. Go to YMCA hit concert gives me ding-bats– hat so feeling very rotten. I come Home & write & then go to bed. Wrote Con. MRL. Marion Clarke & F.D & Hunter\n\nW 3 Tues.\n\nI catch . Recd letter from Dad & parcel from Whites. I am still my crook. I do Carter for Val. Recd parcel from White. Posted parcel Town Havercrafts. Wrote . Wrote MRL & Aunt Annie. Elsie. Freemantle\n\nF 4 Wed\n\n& Wet. Go down to Casino at night. Go concert & supper stay until nearly 9 pm. Meet WAACs & give message N.Z. Sister gives me wine. Wrote Aunt Annie\n","101":"\n\nHarvest of go in with Monkey. Go down Town on Yankie motor. Go to Museum & along Buckwater to see Sea planes. I go shopping & to YMCA at night to American Concert. Ellis at Home from Hospital. Wrote M.R.L & Aunt Annie & Mrs Clarke.\n\nF 6 Fri\n\nI am bad tempered at night for Carter Job. Recd letter from Mrs Edmonds & from May Clarke. Go to bed at 7 pm very tired. He is very . I dream of M.R.L. Millie Porter. Con. Elsie Freemantle. M is lovely & so kind to me, so gentle & loving \n\nF 7 Sat\n\nGlorious Day. Write all afternoon & go shopping & to watch display in YMCA. Meet Joe at YM. Recd parcel of Tinned fruit Coco etc. from Home. I am lonely but so Happy realise that the comfort & Happiness is thoughts of loved absent ones is quite true. I am getting better & happier every day. E is Ord. Sergt Major to note. Wrote Dad. Mum. George. Aunt Annie.\n\nF 8 Sun\n\nRecd Cards from Fat Laura White. Lottie. Mrs Merrett. Letter from Bert & 2 from Home","102":" & W.H. Smith. An Orderly Sgt. Major. Wrote to M.R.L. H Rayner. M Carter. White. Jennie. Laura. Claire. Lottie. Mrs Edmonds. Bertha\n\nF 9 Mon\n\nGo down Town to YMCA Concert. See man with Marionettes. Nearly catch a Waac Tommies riot at Honfleur & Canteen & Messers etc.\n\nWrote W.H. Smith & sent parcel to Aunt Annie.\n\nF&W 10 Tues.\n\nGo down Town to YMCA hear R.G.A. Band play rotten tunes. Meet Cpl. McDonald. Harry Ch. Pal. We have heavy rain storm & then sunshine \n\nW 11 Wed\n\nGo shopping buy nothing. Go up on Top Gallery listen to concert. Some good tunes. Meet YMCA cook & tell anniversary Palace opening. 2 PKTS Bank cigs. Meet A.P.M. Hard to get Home.\n\nW","103":"\n\nE & I meet awsome Girl & have lovely long chat. I go & see & have a good view of Home from . Meet 4 amer. YMCA Girls with Holly . I am very tired walking about. Wrote Mother. Entertain home Book Seller.\n\nW 13 Fri\n\nGo down YMCA & sentimental Tunes being & I am disgusted & rush Home. I go looking for shortages. We move into better quarters & we are now together. Wrote MRL. Recd 2 Letters & Parcel from M.\n\nF14 Sat\n\nRecd 2 letters from Home & from H. Rayner. 1 Card each from Mr E & Mr F. I do gardening in front of our Hut. Go down to YMCA & see Best Gym. Display . Meet & Others. Catch 8 pm train Home but it is too Hot to write in mess. Play cards instead. I get a very lonely feeling hearing in staff mess Hut. Wrote Auntie Annie\n\nF 15 Sun\n\n1530 to","104":" Recd letters from Jennie. E & I go down Town. We meet someone & I come Home by train early on long write.\n\nWrite Hil Rayner. Jennie. MRL Aunt Annie. Dad. Gran. Nicholls. Mr F. Mrs Edmonds. Miss Dick\n\nW 16 Mon\n\nRecd letter from Aunt Annie. I am fed up & have another . I swear more than I’ve sworn for 10 years. Go down & send presents to Auntie. Meet & watch Party. See C. C as piano remover. Get on Best\n\nW 17 Tues. \n\nRecd letter from Peg. Doris. Norm. Bess. Nette. Geo. Home. Col. Raffran & Major Macky. Visit flat E & I go to Saadine’s flat. Meet Chapman off Kanawra. Run for train but have to walk Home. Glorious moonlight night.\n\nW 18 Wed\n\nChange old parts of tent & Major Cooks for me & finds me. Am Orderly Sergt. Major.\n\nWrote Nette. Peg. Aunt Annie. Norm. Dick Toppin. Bess.\n\nW","105":"\n\nGo down to YMCA with S\/Sgt. Lester to Aussie orchestra & then come Home about 8.30 pm. It is an awful wet windy night & we have trouble all the time climbing the Hill. Recd letter from Elsie F.\n\nW 20 Fri\n\nMy Day off & I go to the flat far afternoon Tea & then with Stubs to YMCA to meet Ellis & stay to Band concert. Meet Bert Brian at the Pig & Whistle. Meet 3 old patients & go to Tea with them. Recd letters from Mr F. Marion E.\n\nW 21 Sat\n\nRecd letter from Marion Clarke. Val. Billy. A & I go to Crystal Palace & then to the flat. I am Home sick (an excuse only). We have sing song etc. & coffee & phonograph. We are all a very merry Party except yours truly. We learn that Joy Chapman was on the Kanowra \n","106":"\n\nRecd letters from MRL. Norm Smith. & Jennie. Composed letter to D.J’s & it takes all night write P.C. to MRL. I get up early morning & do not orderly Sgt work. Am in treatment hut. Write to M.R.L.\n\nW 23 Mon\n\nWindy Change of Topsite for Patients after 19 days. Joe & Sgt from A.G.B.D come up & we go down town to Y.M. Concert Joy Band makes H- of a noise. Saadine comes over sits with us. Good rag time but all same tune. Recd letter from Connie.\n\nW 24 Tues.\n\nE & I go down town. Hear Band go down Shopping & come back to sing Xmas Carols. Recd parcel from Mr C.L. Jones. I have Tea with my patients in office. Wrote MRL C. Chaplin & others. ; throwing knives at me.\n\nF 25 Wed\n\nWait on Diggers at Xmas dinner. comforts. Have grand supper at 6.30. \n\nE & I & Major Marty. A lovely turn out. Wrote Jennie\n\nF","107":"\n\nAll my go to B’ford. Crawl meet E out YM Concert. Recd card from Hilda Rayner.\n\nLovely day. I try to find St. addresse. But get to Nice . Meet Girls & go home to see Joy sick in bed. Meet CR0 from Coogee. after Tea go Nice. I.T. E & walk all along from Home. Wrote Mum & MRL. See volunteer in YMCA\n\nW 27 Fri\n\nVery easy Day. Sit in office all day. Fill in Demob papers. & nasty dirty wet day. \n\nWrote Marion C. Doris. Marion Edmonds. Norm Smith. Baby, Haigh. Connie. D. Jones.\n\nW 28 Sat\n\nGo down to YMCA meet Roy. Meet Belgian girl. & talk went Home to Sanvic. It is of great interest to me to lap up conversation which I manage well. Wrote Hilda.\n\nW 29 Sun\n\nFinish early morning parades. Am ord. S\/Major.\n\nWrote Mum. Billy Inglees. Maisie.\n","108":" 12 Copthall Avenue\n\n Belle House\n\n Order Wall\n\n D. Jones\n\nW 30 Mon\n\nRecd letter from French Shop Go downtown & received parcel. Go YMCA to Carnival but get fed up & come Home via long route. Go straight to bed. I am dopey & do not go over the Girls\n\nW 31 Tues.\n\nSend parcel & 3 A. Bull. To . Get pass tell 00.30 & W. & we go down & fight our way into Tournament. Play as Girls & I get 12 7 but it showed have now on main card to have won Prize. We go round & Clarke Sybil & Saadine are at Home & we sing & play until the diggers come at 11 pm. Meet Barsee an old patient.\n\n"}}