{"Document Name":{"0":"Diary_0275","1":"Diary_0275","2":"Diary_0275","3":"Diary_0275","4":"Diary_0275","5":"Diary_0275","6":"Diary_0275","7":"Diary_0275","8":"Diary_0275","9":"Diary_0275","10":"Diary_0275","11":"Diary_0275","12":"Diary_0275","13":"Diary_0275","14":"Diary_0275","15":"Diary_0275","16":"Diary_0275","17":"Diary_0275","18":"Diary_0275","19":"Diary_0275","20":"Diary_0275"},"Date":{"0":"unknown","1":1077.0,"2":1078.0,"3":1079.0,"4":1080.0,"5":1081.0,"6":1082.0,"7":1083.0,"8":1084.0,"9":1085.0,"10":1086.0,"11":1087.0,"12":1088.0,"13":1089.0,"14":1090.0,"15":1091.0,"16":1092.0,"17":1093.0,"18":1094.0,"19":1095.0,"20":1096.0},"Entry":{"0":"\n\n","1":"\n\nLondon at last, about 3 pm at Waterloo Station. Waterloo Stn. is well set out, and splendidly lighted with glass roof. Heavy pall of haze and smoke makes things look gloomy, but according to what one reads, that is nothing unusual.\n\nWe marched around, over Westminster Bridge past the Houses of Parliament, which I could only think of as wanting a dusting. Traces of the stones’ original whiteness still show but it is mostly covered with soot and dirt. I seemed to have read so much of it and studied the construction and design so much, that it made no impression on me at all. To my mind the Sydney G.P.O clock is just as interesting as Big Ben to look at and I suppose just\n\nas accurate. \n\nOn coming round the corner to the old Law Courts building there was a chorus of “Whose statue?” Of course I knew beforehand that Cromwell’s statue was there as well as that there would be a fine equestrian statue of Richard, Couer de Lion just around the corner.\n\nThe Abbey is a fine old building though no more impressive than St Mary’s or St Andrew’s Cathedrals. I made up my mind to have a look through it at the first opportunity, as well as the Houses of Parliament.\n\nRising up above the houses etc was the tower of the new Westminster Cathedral (R.C.) which looked more interesting on account of the more uncommon type of architecture, namely Byzantine, and the beautiful effect \n\nachieved with brickwork. I believe there are more bricks used there than in erecting any other building of the present time.\n\nAfter passing a few yards down Victoria Street, where as I already knew were the Commonwealth Offices, and the Anzac Buffet, we turned into Horseferry Road, where are the A.I.F Headquarters at which we were \nrequested\n required to report, before pursuing our own course.\n\nNow that I was in London and not a penny in my pocket, and too late to go to the Bank and see if any had arrived from home I began seriously to think of the most advantageous stand for a pavement artist, or \nin other words, to think\n of going \nto\n direct back to camp. However I borrowed half a crown off a chum and started\n\nout to see London.\n\nFirst of all I had a good meal at the War Chest Club and paid for a bed for the night. The place is new and very well managed, and the whole place clean and attractive. \n\nAbout 4 pm I started out on my tour with 6d in coppers for expenses. First of all I went around to the Cathedral. it is a very majestic looking edifice and a splendid sample of Byzantine architecture, a most beautiful, and artistic effect being attained with the brickwork\n\nInside, it is great to stand in the centre of the nave which is very lofty and see the beautiful stained glass effect of the magnificent windows on the coloured marbles. The altars are all fine specimens of the sculptors \nart\n work and of the brass founder also. \n\nAfter a look at the tombs of the great Catholic Cardinals Newman,\n\nWiseman and Manning I went out to look for something else of interest. \n\nI went along Victoria Street, where as an Australian I attracted a good deal of attention, some of it very unwelcome too on account of the gazers, to the Abbey. There I found that there was to be a performance of the “Elijah” by a choir from Yorkshire, which I would very much have liked to hear, but I was pulled up by several kiddies selling programmes so I thought that I might not have the price of admission and did not try to obtain entrance. One can imagine my chagrin when I found afterwards that it was a free performance.\n\nBy now it was pretty dark and the lamps were lighted. I was surprised to find that the streets are fairly well lighted up, not nearly so dark as I had expected.\n\nAfte\n After taking a look at my map I took a stroll along the Victoria Rialto but seeing nothing of any interest I turned back and went down Victoria St again. \n\nWhile strolling along with my head high, and not looking around to show that I had just arrived as is usually the habit of the Ausy on leave (snob!), I was hailed by another Australian and a Canadian who wanted to know the use of some war implement in a shop window, namely a trench knife as I was able to tell them. (I told then though that I was only a new N.C.O.)\n\nAfter a chat upon the various articles displayed the Canadian left, but the other chap asked me to come in and help him buy the shop out. After looking at every thing for sale and giving the shop keeper a great deal of astonishing (to him) facts of Australian life, he ended up by\n\nbuying a 2\/6d pocket torch. He then asked me to accompany him for a walk round & to go to a theatre afterwards. \n\nHe was from Bendigo and back from the trenches with split ear-drums. I forget the medical title of his case. \n\nAfter strolling around for a bit we went to a variety show where we had excellent seats for 10d, which were not considered below the dignity of several officers who were present, near us. There was a very good show which finished about 8.30 when the second performance began. \n\nWe were out about 5 minutes when we were pulled up by a lady and her two daughters who asked us many & various questions of Australia. At first we didn’t know how to take them as one hears all sorts of things of the London girls However we strolled along to The Mall\n\nand accompanied them halfway down Picadilly where we left them, after they had insisted on offering us the contents (cash) of their purses. It was however declined with thanks.\n\nWe were back at the War Chest Club again by 10 pm and retired for the night.\n","2":"\n\nI had the luxury of lying in till about 8 am when I got up and had a stroll around trying to appease my appetite with fresh air, calling around at the Cathedral for a few minutes.\n\nAt 9 o’clock I picked my friend of last night up again & we started off to see as much as possible of the city. We, first of all went around to the Abbey, but only went inside the door. In comparison I can only say that\n\nthere are some splendid specimens of Gothic architecture in Australia. The arches in the nave of St Mary’s are a very fine sample.\n\nAfter a yarn with a genial old policeman on duty at the door, and watching a boy sketching the tower of Parliament Houses we moved along Whitehall, but were disappointed at not seeing any of the Horse Guards on duty. \n\nWe then went along the Strand which is a street very much like George Street. It was curious to see so many officers of all grades about; in half an hour we passed nine brigadier generals, which necessitates a great deal of saluting \nwhich is\n a very sore point with many Australians.\n\nThough we went a long way we passed very few other Australians, which made us all the more noticeable to the crowds\n\nof people. We went into a tobacconist’s shop where we were kept for nearly an hour telling him all about Australia; I believe he must still think us liars. \n\nThe most imposing building in the Strand is the new “Australia House” which should soon be completed. \n\nWe passed across Trafalgar Square, where the Nelson Monument is certainly imposing. We then went up past the Law Courts which is also a fine building altogether. opposite are the Temple Courts where we were really interested. You go down a narrow lane for about thirty yards into an open courtyard where the noise of the traffic is absolutely lost. The quiet is very noticeable. \n\nWe spent an interesting half hour in the Temple Church, where are some splendid granite pillars which until lately\n\nwere covered with with a coat of whitewash which \nwas\n had been renewed every year from the Commonwealth period. There is a splendid old baptismal font, and the tombs, with effigies of many of the old Knights Templars.\n\nAfter a look into the Temple Hall, we again went out to the street. We then went down by St Pauls which did not impress me much more than the Westminster Abbey, the architecture being the most noticeable point. \n\nWe went inside but it did not seem at all impressive; I stood under the dome and on looking up was only the more impressed by the size of the dome of the Melbourne Public Library, of which I was reminded. I don’t remember of any Sydney building in the Roman style except St Marys at Waverley, which is built after the \n\nstyle of a basilica. \n\nWe went along Cannon Street where there was little of any interest, and passed the Bank of England which like the Bank of NSW is an old and out of date building.\n\nAt Broad St I was disappointed at the Bank to find that the money had not turned up, especially as I knew I would not be able to return my new friend’s kindness. However he made things easier for me by offering me some money, with which I was able to pay for things occasionally and so in a way repay him for the good time which he had made possible for me.\n\nAfter a look at London Bdge we retraced our steps and went down under the Admiralty Arch into The Mall. We had a look at what I knew to be the monument of the Duke of York\n\nthough we could not find out which Duke.\n\nWe went down The Mall to the Queen Victoria monument and Buckingham Palace which looks better in reality than in photoes. Going down The Mall we arrived at the Marble Arch, of which I had seen so many photoes that it was of no interest at all, and crossed to Hyde Park and Rotten Row. \n\nAfter resting there for a while we started off up Picadilly, having to pass The Ritz, on account of lack of funds, of course. Arrived at the Picadilly Circus where we stood for some time watching the people passing. The girls are a confounded nuisance, but I suppose, that it being Leap Year and Australians being made so much of, and thought so much of, there is\n\nsome excuse.\n\nAs we got tired of lounging around we went down and along Bond St where we were disappointed at what we saw of the ‘Knuts’. In comparison some of our men at home are \nsome\n dudes. The same of the ladies.\n\nWe had also kept our eyes open for a pretty flower girl but all we had seen were of the big footed, fat, beery looking ‘Lizer style, with straw boaters, and shawls. Near London Bridge we thought we had seen a pretty one. She was certainly young, but not handsome, and her voice was absolutely vile, a most ear splitting screech.\n\nWe strolled down Shaftesbury Avenue, and then down several other streets of no importance, afterwards going down Regent St back to\n\nthe Circus again, from whence we took the tube back to Horeseferry Road.\n\nThe Tube railway is another thing that makes London interesting It is a novelty. We worked it so that we went right round London on a trip about 17 mls. for 3d. \n\nAfter a rest we again started off for the theatre. The first we went to, where we waited about half an hour to find out that the whole house was booked up. We then crossed the road to another where we waited nearly two hours in the qeue: As we were at the bend in the staircase and the only Australians present we were the chief centre of attraction for the gaze of the crowd.\n\nThe time was whiled away by the usual joking and small talk, also\n\nby a wandering (in the mind I think) street performer, whom we candidly told that his show was very poor, however he got a fair sum.\n\nAt last we got inside and then became the recipients of any number of opera glasses and chocolates in galore from the ladies around. The tension at dramatic parts of the performance was always relieved by the remarks of a couple of Harriets behind, the kind who always criticise everybody else in sight, and make you laugh at the most dramatic parts.\n\nWe landed out in a heavy shower and had to run for a bus, only to have to stay on top in the open. So we arrived at our quarters wet and sleepy, intending to make another extensive tour on the morrow.\n\nSunday 26th.\n\nGot up early and went \nfor a short\n around to Westminster Cathedral.\n\nReturned for breakfast and with my chum set out for another trip. We strolled down through St Jame’s Park, where I noted that the lake had been drained and the land was being built on, and down The Mall to the Palace where the King was to present a number of VCs and other honours.\n\nThere was a great crowd present, and again as last night in the Strand we were practically mobbed by the girls. \n\nThe Guard’s Band was playing, and is the most perfect band I have ever heard. They played the score of “Cavallera\n\nRusticana” perfectly.\n\nAfter lounging about for a while we strolled down Picadilly to the Row, where we saw the London ‘elite’ riding. They did not look very graceful, as the \nindecipherable\n majority have their stirrups too short, and there was only one really fine horse.\n\nAfter strolling about for a time we went back along Picadilly to the Strand, with the intention of going around to Petticoat Lane. On nearing the Charing Cross Stn. I suddenly changed my mind and decided to go to Woolwich and see some people whose boy was my chum at “Graythwaite” and had been very ill with spinal meningitis. I knew they would be pleased to hear that he had been\n\ngetting on so well when I left, after what he had been through, so I left my chum, promising to come back in the morning.\n\nIt was a great shock when I got there to hear that they had just received a letter to say he was dead, with several other very kind letters from different nurses at the home. I was glad I hade gone there as it was such a relief to them to know that he had died happily and had had the best of care and attention all along.\n\nIt was all the greater shock to me as I had been waiting till I had seen his mother before writing to him and sending him some things I had bought which I thought might interest him.\n\nIt was some time before I could realise that he could be dead, for we were such close chums and he had been so well when I left, but the disease had come back for the third time. \n\nI earnestly hope that should anything happen to me, there will be someone near to do for my mother what I, I am glad to say, was able to do for his mother, who was so uppset over it. However the good news I brought helped to cheer them up wonderfully, and soon his mother had a big batch of lovely home made cakes, which I can only say were like my own mother’s make, and which I thoroughly enjoyed.\n\nThat night\n","3":" Whittel was found out to be a German spy, but escaped to America where he has since been arrested. So I met one of the Continental (he was not an Aussie at all) villains one reads of.\n\nthe father took me all around Woolwich and showed me some of the arsenal, and the anti-aircraft defences.\n\nI also called around to the chief people of the village who knew the boy, amongst whom were Lady Donaldson, whose husband went down with Kitchener, Sir Clarence Stuart, Bart. who lost about £150 000 in a bogus company, controlling Australian exports some years back, the inventor of the under-sea cable, and a Mr Whittel an Australian too, who is the inventor of the gas incediary bombs which they are using so successfully against the Zeppelins, with whom I had a most interesting chat.\n\nThe tunnel at Woolwich, under the river is a great piece of work. It is rather small in diameter, though, but about a mile long, with a lift\n\nof a large carrying capacity, as well as a wide staircase at each end. There is also a bigger tunnel for vehicular traffic, with a narrow foot path, and a ferry on the river as well.\n\nThe wharves are on the pontoon principle and one can see where with the recent flooded state it had been over fifteen feet higher than it then was at high tide.\n\nI had a look at a church which had suffered in a raid, but the whole of the end wall had been rebuilt in a day, as also a whole house rebuilt in a few days. Men are always at work doing repairs \nwork\n, on the morning after a raid\n\nAll over the commons around Woolwich are small cottages for the munition workers looking just like a big camp, and also the Garden City, a little town on the principle of Bournville or Port Sunlight.\n\nI left the house at about 10.30\n\nand put up with a neighbour of theirs.\n","4":"\n\nUp fairly early and went back to the Butchers. My coming had so relieved them that they had all had a fine sleep – the first to wake up got up at 8.30 am, which shows that it had eased their worries a great deal.\n\nWith Mr Butcher I went up to London again and had a stroll around. We didn’t see much that was new. it was interesting to stand outside St Paul’s and see the pigeons perched on people’s shoulders and arms eating breadcrumbs; it was a very pretty sight.\n\nAfter riding about a bit in the Tube we went back home again, where Mrs Butcher had a big batch of cakes and tarts ready for me. I spent a few most enjoyable hours with them before it was \n\ntime to leave.\n\nBy 9.15 pm I was back at Waterloo Stn. to catch the 9.20 train back to camp.\n\nWell I had spent an interesting four days, and though I was not exactly disappointed, London did not come up to my expectations. I had thought I would be very excited on reaching the chief city of the world, but after Sydney, which has made such strides and has all that is modern, and some fine examples of all the leading forms of architecture, that London did not seem anything extra-special at all. \n\nSydneys streets are just the same, narrow, and running all over the place, and pretty well as much traffic, its buildings are quite as great, in their way. Though there is none like St Pauls, The Abbey or the Houses of Parliament with their \n\nold associations etc, London hasn’t a building like the Daily Telegraph office or the Commonwealth Bank, and the G.P.O and the Town hall and the Queen Victoria Markets are splendid examples of their various \nforms\n styles of architecture. St Andrews Cathedral is a fine building of the Gothic style, and St Marys will be better. \n\nTrafalgar Square is an imposing place, but though Sydney has no such square, Martin Place and Moore St together serve the same purpose and just as well too.\n\nLondon has no street like Macquarie Street, and Centennial Park track is quite equal to Rotten Row, and Pitt Street equals Picadilly and Bond St, as does Paddies’ Market equal Petticoat Lane. \n\nSuch monuments as the Admiralty Arch &\n\nthe Marble Arch will come later, and the Central Railway Stn is I suppose as fine a station, with as magnificent an approach as any in England. It certainly beats London’s stations.\n\nSydney, then, has her blue sunny sky always, not the perpetual haze of smoke above her, as has London, as well as the abominable frequent London fogs. Lastly Sydney has her unequalled position on the Harbour, and I am a native of Sydney and so I suppose I must be a bit biassed, though I have made, I think a very fair comparison. \n\nThe girls of London, and England generally, are pretty but that is all. They havn’t the attraction of the Australian girl, four good examples of whom I have for sisters. The English people though are all kind and good-natured\n\nand do all they can for the Australians many of whom, I am ashamed to say do very little to return their kindness and rather take advantage of the donors in every way possible. However the least said of that sort the better.\n\nWell by 1.30 am we had just arrived in camp, the ground \nof\n everywhere covered very thickly with a hard white frost.\n","5":"\n\nThis morning it is very cold and I can hear somebody banging at the taps to try and smash the ice in the pipe to let the water run, but the whole thing had frozen.\n\nMany dishes contained solid blocks of ice where water had been in them all night, and there was nearly a quarter inch of ice on a fire bucket inside the hut. It was almost\n\nimpossible to stand still on the ground for a minute. \n\nWe drilled all day, and weren’t able to get a wash till after 3 pm when a thaw set in and the water in the pipes melted. \n\nThere was very little of any importance happened.\n","6":"\n\nVery cold again, and little out of the ordinary happened.\n\nIn the afternoon we went out and did some practice with live grenades, throwing three each. As it was of course forbidden to keep out of cover when throwing them till after the explosion, I had to do so but my inquisitiveness sorely tempted me to look out and see one explode. Perhaps I’ll see that soon enough, and too soon.\n\nThe spring out of my first one came back into the bay, I was in, so I am\n\nkeeping it for a mascot.\n\nThe bombs are pretty powerful; they burst into it is said, 208 pieces (of steel & iron) which will inflict a nasty wound up to about 200 yds. They are very handy to have in a charge.\n\nWhile on the subject there is a chap in our battalion, back here from the front, who captured a fireman who reviled him and called him every sort of thing, \nso he pulle\n telling him also that he had a wife and seven kiddies so the Ausy took a grenade (Mills No 5 out of his pocket, took the safety pin out and dropped it into the German’s pocket, telling him to split it up with his wife & kids, before running off. Of course that was the last of Fritz. The truth of the yarn is not vouched for.\n","7":"\n\nStill cold. At the rifle range all day Nothing else out of the ordinary occurred.\n","8":" \n3","9":"\n\nCold again. Another very heavy frost last night – \n\nHad a tooth pulled out & so stayed off parade to write some letters as it was the only chance I have had for a fortnight of doing so. \n\nNothing else happened today.\n\nSaturday \n1st\n","10":"\n\nExpected to be shifting camp today but again put off.\n\nAt rifle range in the afternoon. Had to fire 10 rounds each with gas helmets on. One lot scored 8 hits on the targets out of 640 shots; six however is the record. Had to knock off early as it is now quite dark by 5 oclock.\n\nSunday \n2nd\n","11":"\n\nChurch parade at 9 am. Was very much surprised to see Father Lonergan of Bathurst, the chaplain in the camp.\n\nAfter church parade we had to turn around and do our washing as it is the only chance we get.\n\nOur two officers leave us this morning and I suppose we’ll see no more of them here.\n\nWent for a stroll in the afternoon and saw Keith Conway who used to be with B R & R. who I find is in the same camp. Stayed in again at night and \nindecipherable\n wrote some more letters. \n\nAnother very heavy frost again.\n\nMonday \n3rd\n.","12":"\n\nWater again frozen for a while. Learnt that we are to have a week at bayonet fighting and physical training in\n\norder to get fit for the front. We have been kept continually doubling up and down the assault course stabbing bags of straw and jumping in & out of trenches till we could hardly take another step. We were then taken around for physical drill after an hour of which we were again taken back to the bayonet course. One thing for which I am thankful is that there will be no night parades.\n\nTonight there are about a dozen in the hut arguing about religion till I am absolutely sick and tired of it and am leaving off writing this and going to bed.\n\nTuesday \n4th\n.","13":"\n\nVery cold today. Heavy frost again last night \n\nOn Bayonet fighting all day long. When given a rest from bayonet work we were run all over the place till we were more\n\ntired, when we were brought back again to bayonet drill. This is no light work as there are several trenches to charge, as also several bags hanging on frames, finishing up with a jump across a 4’ trench at a bag on the other side. That comes right at the worst part too as one is pretty well done by then.\n\nWednesday \n5th\n.","14":"\n\nVery little happened today. More bayonet drill.\n\nThursday \n6th\n.","15":"\n\nCold again. Prospects of more snow. Rain began again. More bayonet work and a bit of marching.\n\nFriday \n7th\n","16":"\n\nMore rain. Place very muddy again. \n\nCalled down to see Father Lonergan after tea and had a good yarn with him.\n","17":"\n\nWent to Communion this morning with six or seven others. Lovely day, quite warm.\n\nBayonet drill all morning. Long march with full pack in the afternoon. We now have to carry all our stuff in the pack, kit bags done away with and all superfluous stuff taken from us. \n\nKit inspection after tea. Expect to move for our final training tomorrow morning early.\n\nBig Australian mail in but not sorted yet so don’t know if my parcels or papers have arrived. Had none so far.\n","18":"\n\nWent to Mass in the morning. \n\nMore kit inspections and fooling around. I am having a job to keep on the draft as I am unmistakeably an ‘immature’. I think I can kid Stan Eastment to leave me on though.\n\nHad a yarn with Father Lonergan again.\n","19":"\n\nVery little doing but more inspections. I got a letter from the Bank to say that at last something had arrived for me.\n","20":"\n\nAs there did not seem to be any chance of us going for two days I bearded the Adjutant in his den and got a pass to London. I did not get there till the Bank was just about to close so was lucky to get it. First of all I had a good meal then visited several shops for articles to send home. \n\nThinking that I had plenty of time to catch the train I did not mind having got in the wrong Tube train and going all round London. When I got to Waterloo it was in time to see the train pull out.\n\nI waited for a while though & managed to get another, intending to change at Andover Junction. I woke at Southampton, and decided to have a holiday so went on to Plymouth, up to Bristol, and then on to Salisbury by Bath.\n\nI arrived there about 3 am and had to pay 15\/- for a car to Wilton whence I walked to camp. \n\nThere was a parcel and several letters also for me which I read till the others woke.\n\nWe left that night for France.\n\n"}}