{"Document Name":{"0":"Diary_0353","1":"Diary_0353","2":"Diary_0353","3":"Diary_0353","4":"Diary_0353","5":"Diary_0353","6":"Diary_0353","7":"Diary_0353","8":"Diary_0353","9":"Diary_0353","10":"Diary_0353","11":"Diary_0353","12":"Diary_0353","13":"Diary_0353","14":"Diary_0353","15":"Diary_0353","16":"Diary_0353","17":"Diary_0353","18":"Diary_0353","19":"Diary_0353","20":"Diary_0353"},"Date":{"0":"unknown","1":833.0,"2":834.0,"3":835.0,"4":836.0,"5":837.0,"6":838.0,"7":839.0,"8":840.0,"9":841.0,"10":842.0,"11":899.0,"12":900.0,"13":901.0,"14":902.0,"15":903.0,"16":904.0,"17":915.0,"18":932.0,"19":933.0,"20":1073.0},"Entry":{"0":"\n\n","1":"\n\nThe previous night I had received word that I was one of those detailed to return to Aerodrome Camp from Kasr-el-Nil barracks in order to proceed to Alexandria for embarkation on the \"Transylvania\". Was glad I had spent the previous night packing as it only meant a couple of hours extra work to complete it and have it ready for any eventuality, whether taking the whole of it on or leaving the heavy trunk at Cook’s and taking only the sleeping bag and kit bag. Left the orderly to hire a donkey cart and take it back to camp while I went round to the Pension Wales to spend as much time as possible with Oll: she got rather a shock at the news but took it splendidly alth’o it meant that she would be left \"on her own\" in a strange land. We went round to Groppi’s for an ice cream, bought some lunch there and then took a garry out to Ghezireh gardens. It was quite a hot day but the drive round the gardens along the bank of the Nile was quite interesting. The gardens are situated on and island formed by a branching of the Nile which at this point is about ¼ mile across, and being so well watered it is exceedingly fertile.\n\nA large steel bridge having two huge lions at each end joins it to the mainland next to; Kasr-el-Nil barracks while ¾ of a mile to north and south are two other large bridges. Spanning the busy waterway at the back of the island of the island where the untidy looking masts and spars of the Egyptian boats showed that a small fleet was waiting for the bridge to open, it is another solid steel bridge. Here and there on the island are clusters of date palms which at the time were about to burst into flower, the lower green vegetation of bushes and shrubs being thrown into strong contrast by gorgeous masses of rich bougainvillea. In one or two places large masses of it were growing around the base of a palm tree, giving a very picturesque appearance. \n\nIn the gardens were beds of verbenas, petunias, phlox, drummonde, dianthus, salvias, antirrhinums and other annuals showily massed. Fair roses were seen in some of the beds, the whole of which are irrigated with Nile water from time to time. The lawns were well grassed and walks nicely kept. We found a nice shady spot near an irregular patch of straggling apricot trees and had lunch sitting on the grass while a number of Egyptian boys played a sort of football, using a hard cloth ball for the purpose. Stayed until abt. 3o’clock, Oll being interested in the few photos I had brought in my pocket book as reminders of the good old days.\n\nDrove back to the pension where Oll half expected to find a cable from Rid. Said good- bye there and caught the Heliopolis tram back to camp, noting on route that most of the barley crops to be seen along the way had matured wonderfully during the ten days absence, being in many cases a vigorous growth that it was rather badly layered. On arrival at Aerodrome found that the camp was quite in a state of upset since all but perhaps ten or twelve officers and men were to move out that night. Had dinner in the mess and fell in at 6o’clock, finding then \n\nthat I was to be in charge of the 130 men remaining from our company. After some delay we moved off and marched to Helminah siding in the gathering darkness, the boys all being in high spirits and blowing off steam singing. This was where we had detrained on arrival from Suez, but this time it was a very different kind of train, merely open trucks in which 32 men were packed, the officers were slightly better off in having a baggage truck-practically an open truck with sides and roof. After entraining came a long wait until 10o’clock when with much jarring and jolting we got onto the line to Alexandria. Fortunately it was a fairly warm night and with a blanket and great coat I stretched out with the others on the floor and in spite of a tremendous jarring and shaking with each revolution of the wheels flattened, got some broken sleep.\n\nWednesday 29th March 1916\n\nAfter numerous false alarms of \"Alexandria\" was finally aroused at 6o’clock by the train stopping in a sort of siding where were a number of goods trains all more or less loaded with army stores, straw in bails, firewood et. Close by was a fairly extensive encampment of Tommies who as the daylight increased gradually began to show themselves. After a short stop the train crawled on and came to a final stop almost at a jetty where we could see the \"Transylvania\" moored: a train similar to ours had just unloaded its burden of 2nd Training Batt. men, and these were in the process of embarkation.\n\n It was a disappointment to have come thro’ Cairo without having been able to see anything (the night was dark and starry) of the country, but we were glad to eventually be at the boat. There were rumours that 2or 3 detonators had been placed on the rails for the benefit of our train. Almost immediately upon arrival we detrained and started to get our men on board, they being taken to their quarters by the ships people as they came on board. The foggy (for the latter part of the journey) journey in open trucks made them appreciate their quarters on board all the more. Our company is well down in the bows and is fairly comfortable. When they were fixed up we went along and got our cabins allotted: was put in a 4 birth room with Prescott and 2 others.\n\n She is a fine boat but not nearly equal to the \"Osterley\" in my opinion as regard appointments et. It has to be remembered that this boat is now solely a troopship making no provision for passengers. Although we are a most important ship having General Birdwood 5 or 6 other Generals, Headquarters Staff and a large complement of other high officers of all arms on board, we are messing in the 2nd saloon and on 2nd saloon fare, the","2":" saloon having been dismantled and converted into an armoury for the rifles. The music room has also been dismantled and is now fitted with temporary bunks, the ship carrying some 3000 troops.\n\nAfter fixing thing up Prescott and I decided to have a short run up town, caught a tram at the top of the jetty road but after abt. a 10 minute run decided to get out as I had spotted a Telegraph Office. Posted my note to Oll, and then, as the smell and dirt appeared to be even worse than at Cairo and the street scenes were just the same as those at the latter city, we caught the next tram back: the heat was oppressive and we were not altogether sorry to be back again on board. Fresh troops\n\nfrom newly arrived troop trains were being embarked, the scene was one of great activity. After lunch started to write a letter but was interrupted by the call for officers parade at which Capt. Evans, the O.C. troops read two staff communications, one referring to submarine guards and the other about \"Conduct in France\" both of course being listened to with great attention. As soon as we were dismissed I scribbled a hurried note to Oll letting her know what our destination is to be and sent Davies my orderly, up town to post it.\n\n About 5o’clock we pulled out into the stream, but meantime it was amusing to watch several Egyptian craft hovering round the vessel with oranges, chocolates, cigarettes etc. for sale. They would come alongside throw up a cord to which was attached a basket; the order would then be given by the men for so many oranges etc. and on receiving them on deck they would lower their cash in payment; frequently to judge from the gestures and language I fear our boys forgot to put some of the money in the basket! Presently a water police boat with two \"gyppies\" in jack-tar uniform and red Fez’s came along to hunt the traders away, but over and over again they came back. When we got out in the stream we got a better idea of the large amount of shipping in the Port which is made by a big breakwater perhaps ¼ mile in length. We were up against the hospital ship \"Laetitia\" for some time. After dinner spent time writing and turned in abt.10\n","3":"\n\nA bright clear morning but later a squall carrying with it a little driving rain struck up. Nothing doing until abt. 9.30 in the morning when our companion troopship the \"Corsican\" weighed anchor and headed out of the channel, the entrance to which we afterwards found was mined. With the glasses we could see that she was presently joined by a light cruiser to keep her company. About 10 o’clock while I was holding a muster parade to definitely see whom we had on board we weighed anchor and started to move out down the channel and into the Mediterranean; it was hard to believe it. The water was very blue and there was no smell of \"niggers\" such as we had been accustomed to for some time. A fresh breeze tempered the heat. We followed in the wake of the \"Corsican\" and her consort, all the time zig-zagging in our course. Further protection was afforded by 2 trawlers keeping about 2 miles abeam while in front of us I believe a mosquito-like destroyer led the way, tho I personally could not see it. \n\nAll day long life-belts are worn by all ranks, excepting at meals when it is allowable to take them off. A parade was held in the afternoon but it was not possible to do much work. Scarcely any motion at all but no room for movement. After dark all lights that were exposed were not lighted and all port holes, windows et. obscured with brown paper or other arrangement. Writing after tea and turned in abt. 10.\n\nFriday ","4":"\n\nA bright sunny day with a fairly stiff N wind blowing but with very little motion of the vessel. At daylight we were still heading N and high land which we were told was the E end of Crete was showing on the port side. Our escorting light cruiser, the \"Campanula\" was standing by on the port side and away on the horizon on the other beam were the 2 trawlers. During the morning a business-like little destroyer ( the \"Rattlesnake\") tore up to abt.100 yds.of us,\n\nasked by semaphore what the transport astern of us was, turned sharply abt. almost in her own length and tore off to the \"Corsican\". The chief impression the little act gave was efficiency. All through the day land was visible on the port side, a rugged coastline with a very high range of snow covered mountains lying further inland. This was a pretty sight with fleecy clouds hanging about their tops, the snow lying deeply in the hollows contrasting with the black ridges and saddles between them. \n\nDuring the morning we passed 3 or 4 vessels one of which was, I believe, the \"Afric\". All the men were allotted to the posts they are to take in the event of a submarine attack and at 10 to 4 in the afternoon a practice alarm was sounded. When the inspection at their post was completed they were dismissed but no sooner had they dispersed than a succession of short blasts of the siren was sounded to denote man over board.\n\n There was an instant rush to the decks and the ship was at once bought round in her course. With Fathers’ glasses I was able to pick up 3 of the buoys that had been thrown over, and then the man himself after a good deal of time. It took a long while to bring the ship round in her course and she circled round twice before the man was located. When close to him the \"captain’s gig\" was manned and lowered, and directed by the chief officer in the stern of the ship, was pulled over to the man. The warship meantime cruising aimlessly (apparently) about. Lowering the boat meant that the ship had to be stopped and the captain at first refused to do this on account of his orders and of the tremendous risk of a submarine attack being made, but General Birdwood asked him to try and get the man. Fortunately for us no submarine was handy, and just an hour after the alarm being given the gig was back on board with a corpse, all the attempts at restoring respiration being of no avail. It appears that the man was drunk and was put in the guard room, really a part of one of the decks, then when being exercised or moved to another part he deliberately jumped overboard. I hear he belonged to a S.Aust. unit. During the afternoon the course was altered from N to W. Rather more motion as night fell.\n\nAbout 9o’clock the ship’s adjutant who strange to say, is the one who acted in the same capacity on the \"Osterley\" came to the cabin for a yarn and on leaving mentioned that the burial service was to be held at 10 o’clock and asked me to go with him. Picture the scene on one of the lower decks a little above the water line. An ill lighted passage-way leading to one of the double door-ways in the side has 20or 30 soldiers more or less undressed standing around it, when the Chief Officer, adjutant and 2 or 3 officers come along, and take post near the door-way in the side. The corpse is carried to the side on a wooden grating and covered with a Union Jack. It is placed in position, the lights are switched out and the doorways opened. With only a small torch to light the page of the prayer book the Chief Officer reads 3 or 4 sentences commencing \"I am the Resurrection and the Life\" and at the word the grating is tilted in the dim light and a splash indicated that another drunk tragedy is at an end. It was a dismal and pathetic ending and yet it might have been immeasurably worse had a submarine been about while the vessel was stopped.\n","5":"\n\nA perfectly gloriously day, clear and bright, with a slight breeze and a very smooth sea. We were to pass through a portion of the most dangerous part of the Mediterranean close to the spot where the \"Minneapolis\" was recently sunk, and the captain considered that we were very liable to attack. Double duty was done by lookouts and I volunteered and was on the bridge from 10 until 4, with a break for lunch. Our\n\nescorting little cruiser was dodging round during the day and our course still being due W with constant zig – zagging. Passed several vessels going in the opposite direction but saw no land and we are due to pass Malta about midnight. A concert amongst the officers was held at night, but spent the time writing and fixing up company matters.\n\nDuring the afternoon while on the bridge I saw quite a tragedy, two passengers who were not detailed to embark and sail with us being killed and subsequently eaten. Throughout the day several land birds joined us including a small falcon or some such kind of hawk. Just before sundown this swooped down on a swallow, killed and carried it up onto one of the funnel stays, where it plucked and ate it. A small bird like a sparrow shared the same fate and when I went onto the bridge next morning and was told that the ships watch had succeeded in capturing the murderer abt. 4 o’clock in the morning, was not sorry.\n","6":"\n\nA beautiful fine day. Up at the usual time and spent a little time relieving one of the men on bridge look- out coming off at 8.30. Our escort left us during the night when I believe 2 or 3 small warships visited us. We passed Malta before midnight, I heard. \n\nAbout 9 o’clock land was dimly discernable to our north: we were on a NW course at the time, this later being changed to W. The land turned out to be the island of Pantellaria. The coast was rough and rugged and the steep hillsides plentifully terraced, with small flat-roofed cottages painted white scattered about and in one place grouped into a village above which on a high almost isolated crag was a large castle. At ¼ to 11 church parade was held on the aft well-deck and was attended by General Birdwood and special other generals, the service being conducted by 2nd Lieut.Bethuen, a Tasmanian who was formerly C of E clergyman. \n\nAbout lunch time land could be very dimly made out to the south; this was Cape Bon and the neighbouring part of the African coast. At 6o’clock our steward told us that the wireless operator had just received a call for help from a troopship that had been torpedoed near Malta. Immediately all manner of rumours began to be scattered abroad about the loss of life etc. Our course was changed to N during the afternoon. Passed several vessels.\n\nMonday 3 April\n\n A nice morning giving place to a dull grey day with a drizzle of rain occasionally. There was a distinct nip in the air; the coast of Sardinia was clearly visible and probably there was snow on the higher portions inland to account for the cold. About midnight we had picked up the light on southern Sardinia and right through the day the coastline of this island and of Corsica was visible in the dim distance to the E. The sea remained wonderfully smooth. At 11o’clock in the morning General Birdwood addressed the troops massed on the after well-deck making a rousing speech which was well received. By 6.30 at night the lights of Toulon harbour and the dim form of France could be seen to the E.\n","7":"\n\nAfter the glimpse we had caught of France last evening everyone was up early and excited at the thought of what the day might bring forth. It turned out to be fine but cold and cloudy. When we got on deck we found that we were in smooth water close to a small island on which stood a lighthouse. Further distant was the rocky coastline where in places the white cliffs indicated a chalky formation. The calm water made us wonder whether somewhere out of sight to seaward there was not a breakwater to add protection to the open bay.\n\nSeveral fishing boats of a heavy build and with a long prow passed us, manned by fishermen (usually 2) dressed in rough jerseys and big sea boots wearing a red cap with a tassel on top. The long sweeps used by the men standing and facing in the direction taken, but it seemed that progress was slow. The nets were piled up in the stern and a silver gleam in the bottom of the boats showed that they had not toiled in vain.\n\nAs the \"Transylvania\" came close to shore we had some very pretty peeps of the landscape. The blue water of the Mediterranean gave place to white cliffs surmounted by fertile fields in which after the dreary deserts of Egypt, the luxuriant growth of vegetation was most striking. There were all gradations of colour, from the verdant green of the grass and cultivation patches to the gloomy shades of the pines and cypresses. Here and there villas with red tiled roofs stood out in bold contrast and in one or two spots the white gleam of bell-tents arranged in orderly rows showed where some of our camps were situated.\n\nThe scattered dwellings gave place to the continuous habitations of Marseilles as we proceeded up the bay. Finally we came to the quays were a mass of shipping was to be seen. As we made our way slowly past, one steamer the \"La France\" was noticed on which we had our first sight of the steel grey German uniform. This was worn by prisoners of war who under an armed guard were loading or unloading the cargo. Nearby was a huge vessel beside which our vessel and all others looked mere midgets. It was the \"Brittania\" a 40,000(?) tonnes painted after the manner of hospital ships, white with a green longitudinal band interrupted at intervals with red crosses. We were told that she acts almost as a hospital base, other hospital ships bringing their boats of sick and wounded to be transferred to the giant ship and taken by her to the home country. All quays were scenes of bustle and activity even at this early hour of the morning.\n\nAbout 7 o’clock we reached our moorings along one of the stone-flagged quays where a military guard was waiting. The townsfolk took little notice of our arrival having so many transports arriving recently from overseas and as afterwards became evident, having had many thousands of Australians pass through their town.\n\nAfter breakfast came a wait for the Military Landing Officer all packing being completed in the meantime. When he did come orders were issued that baggage would have to be left behind, but it was decided that what could conveniently be taken would accompany us and that only the big and heavy packages would be left at the Base Kit Store. This meant for me repacking most necessary things into a valise and black kit bag, although it afterwards turned out that there was no reason why all the gear should not have gone with us.\n\nJust before early lunch the disembarking orders came out followed by a tremendous rush to parade the company, issue rations and so on because the 1st Bde. reinforcements were to leave by the first train. A nasty accident occurred at this time which I fear ended fatally. One of the men in leaning over the rail to talk to someone on the wharf overbalanced and fell 20 or 30 feet on to the stone flagged quay and sustained serious injuries. He was immediately treated by one of the doctors ;on board and removed to a local field hospital.\n\nAt 1.30pm came the disembarkation under the supervision of the M.L.O. a crusty old Imperial Major. After marching off the boat the various units were drawn up in the shipping yard all ranks being heavily laden with rations and equipment; fortunately no rifles had been brought from Egypt so that there was so much extra freedom for carrying boxes of biscuits etc. When all was reported correct the march to the station was commenced; the distance was not great, taking us perhaps a quarter of an hour.\n\n The route led along the quays where we got a nearer view of the wharf labourers and found that there was a fair proportion of course looking women amongst them. The streets passed through on the way to the station were paved with stone blocks which gave an uneven surface and made marching difficult. The crowded houses were small and dirty and mainly fisher-wives, dressed in blouse and short skirt of some rough material, heavy boots, and with a woollen shawl thrown over the head and shoulders. Many of these women did a good trade with the boys selling French loaves, biscuits, oranges etc. to the accompaniment of a\n\ngood deal of chaffing in which the women showed a knowledge of most of the stock Arabic phrases, learned from Australian troops who had preceded us. Most showed they knew Pidgin English, but I was struck with the pretty French of many of the youngsters hanging on to their mother’s skirts.\n\nAt one crossing a long convey of heavy motor lorries laden with bales of fodder and munitions of various kinds was noticed on its was up to the railway station. Forming part of a long-drawn-out goods train close by were a number of trucks each carrying a businesslike long-range gun of perhaps 6 inch calibre- my first acquaintance with the French artillery. All the men at work in the railway yard with the exception perhaps of the French Officer in charge of the station looked long past military age. This impression that the eligible men of France were all away at the front was to be greatly deepened and strengthened during the next few days.\n\nOur train was drawn up and ready and the entraining party had allotted units to definite portions of the train, the number to go into each carriage being clearly chalked on the door. The actual entraining thus took only a short time. The train comprised some 50 odd carriages of 1st, 2nd and","8":" class and some covered trucks containing the rations for consumption on the journey. 8men went to a compartment and with the long journey in view this did not allow over-much space to the men. Most of the officers travelled together in a corridor carriage, but Prescott and I had a compartment about the middle of the train in which we kept a lot of the company’s rations to be issued from time to time. The others spent much of the time playing cards but we were quite content to put in all the time seeing the country passed through. Prescott proved a fine travelling companion.\n\nWe got away punctually at 2.30pm amid cheers from the men on board and commenced our 7oo mile journey across France, a journey that proved to be one of the most interesting parts of the campaign. First came a heavy drag up to the high ground above Marseilles. Our engine was a very powerful looking one, but in this part we had the help of another heavy engine pushing behind; even so we made slow progress up the steep grades which in France are higher that those in Australia.\n\nThe exercise in marching from boat to train had thoroughly warmed us and we were wearing heavy things in anticipation of a cold journey so that the cold did not worry us much. Emerging from a deep cutting in which it was noticed that slabs of excavated stone were cemented in like tiles, a glorious view overlooking the Marseilles and the harbour`\n\nwas obtained. Numerous factory chimneys stood up above the crowded house tops and gave the impression that the city is a busy manufacturing centre. Beyond the unattractive city was the blue water with 1or 2 rocky islets and rugged cliffs showing up clearly on the other side of the bay and away to the horizon stretched the blue Mediterranean. It was a very pretty panorama seen in a fleeting patch of bright sunlight.\n\nA French workman doing some stonework at one of the viaducts reminded one of the saying that types are the same the world over. Although distinctly French he was a typical stone mason and would have at once been picked out as such from a crowd of men.\n\nFrom another steep cutting we ran through a tunnel very much longer than any I know in Australia, but in spite of its length and the fact we had 2 engines on, it was wonderfully cool and well ventilated. The country beyond was broken and undulating and seemed to be of a rather poor class. Large areas were under olives, but the fields looked stony and the soil poor. The trees had gnarled trunks and seemed stunted; in size they were similar to our orchard trees. Marseilles, we afterwards found, produces quite a notable quantity of olive oil.\n\nPresently we skirted along the shore of a large body of water on which were numerous fishing craft while sea birds flew here and there; it was a salt water lagoon connected with the sea by a narrow opening on the south.\n\nFrom here the route lay in a straight line across to the Rhone at Arles , leading through some miles of a magnificent avenue of well-grown cypresses on each side of the line. The telegraph posts were distinctive, being pine or fir arranged in pairs at right angles to the route, perhaps 8feet apart at the base and braced together by a strut from near the top of one to the base of the other. The numerous wires were attached to insulators on both posts. Rows of trees acting as windbreaks were planted amongst the olive gardens and cultivation areas, hawthorn hedges already showing signs of spring replacing them sometimes. Plum trees in blossom were a common sight and once or twice were seen tall horse chestnuts bursting into leaf.\n\nThere were numerous stops and at every opportunity the men got out to stretch their legs until at last they commenced to roam so much that strict orders were issued that no one was to leave the train under any circumstances. It was a pity that all should be thus penalised. At one of the stops however, two or three womenfolk were standing by and Prescott engaged them in conversation. They were surprised to hear that we were Australians and thought that we should have been black. At another stop were 2 farm wagons of a peculiar type; two wheelers with a long floor extending well in front and behind the axle. They were heavily loaded with\n\nbales of fodder built up to a considerable height fore and aft and were drawn by 2 horses arranged tandem fashion, magnificent percherous fitted with tinkling harness .\n\nFrom Arles the line led in a general N direction to Avignon which we reached at 8pm and thence went through to Orange, a further 1 ½ hours journey. We quite begrudged the hours of darkness that prevented us seeing the country passed through. Arrangements had been made for a stop for tea at Orange, where after issuing rations and large quantities of hot coffee containing rum, we went to an hotel close by where a meal had been prepared for the officers. Heavy rain had been falling but it moderated sufficiently to allow us to get to and from the place without getting wet. \n\nThere were many peculiarities in the meal. Soup was served in a tureen, each helping himself (or not) to the rather queer looking green thick soup. The bread was the light French make in the shape of a huge loaf and was voted first class. Next came pork and veal served in slices with gravy on a large dish; it was accompanied by oily looking salad. Sweets were missing but bread and jam and fresh colourless butter took their place. Wines were on the table and jugs of light beer provided as a matter of course without extra charge; after some delay black coffee appeared but was scarcely a success. The meal cost something like 3F and in spite of the strange features was heartily welcome, the journey having sharpened all appetites.\n\nDuring the night our route lay in a general N direction along the valley of the Rhone through the following large towns: Montmelier,Valence,Tournon,Vienne and Lyon where the line leaves th Rhone and follows the Saone still in a N direction. We were most unfortunate in passing through this region during the darkness.\n","9":"\n\n Awake at daylight after a good sleep on the seat and found that the morning was fine but cloudy. We were still going in a N direction but had left the Rhone and were following the fertile valley of the Saone. Although the hour was early there were already many workers out in the fields. Vineyards occupied most of the space.\n\nThe river was perhaps 20 yds. in width and had much the appearance of a sluggish canal. There were numberless little tributaries flowing into it from its broad floodplain on either side which extended out to the foothills. The whole of this area being like a huge garden in which every available sq.yard was being utilised for some purpose. This indeed was one of the most striking features of the country. In Australia the train rushes through vast areas of land that are used for nothing, but in France it seemed like travelling through a long series of gardens of which the utmost use was made. Even railway embankments were planted with grape vines and the \n\nwasteful fences separating adjourning properties were conspicuously absent. A narrow open drain frequently performed this office besides carrying off drainage, but more often one cultivation area seemed to have no permanent line of demarcation from the one next to it, a field of clover extending right up to a vineyard or fallow and so on. \n\nThe banks of the river and streams were planted up with osiers which were well –pollarded, here and there giving place to shaggy poplars containing numerous large birds nests on to silver poplars which later in the season with every breath of wind gave a peculiar scintillating effect due to the dark upper and silver under surfaces of the leaves alternately showing up. The horse chestnut trees were more backward than those seen outside Marseilles showing the later spring of the more northern latitudes.\n\nThe cultivation areas were here and there interrupted with delightful patches of woodland in which the trees stood stripped of their leaves. Shy little groups of primroses, cowslips and crocuses were to be seen hiding along the edges of these woods and forests. But cultivated land was general. In one winter fallowed field an aged couple were hard at work ploughing, the white bearded man wearing baggy velvet trousers and looking typical French peasant; his wife wore short skirts and had a shawl thrown over her head and shoulders. The plough was an old digger type; a single furrow mouldboard fitted with two large guide wheels and was drawn by two bullocks and a fine looking horse, a rather queer combination that recalled at once similar sights in Egypt.\n\nThe habitations were mainly scattered farm cottages of red brick with high pitched tile roofs and large chimney places at the end. Sometimes the houses were grouped in hamlets and villages. Everywhere the troops got the same hearty welcome, old and young lustily waving and even throwing kisses in return for those dispatched by the men on the train.\n\nNow we rushed past a viaduct where on sentry duty was an old veteran dressed in red trousers with short leggings, blue long coat with corners turned back and a battered peaked cap. In addition to his rifle he had an umbrella to guard against the frequent showers! He had a cosy shelter close by in the form of a sort of sentry box, and as the journey proceeded we found that at every bridge, overhead-way or other venerable point along the railway a sentry was posted and invariably was an old man unfit for more active duty closer to the firing line.\n\nThen passing through Villefranche we traversed further stretches of river flats to Macon where we stopped for breakfast. This is a large town on the Saone and an important railway junction. We saw only the extensive trucking yards and station. There were the usual boilers of hot coffee and rum for the men of whom members went with us to the Buffet for a breakfast of ham and eggs etc.\n\nAfter Macron the route continued along the banks of the Saone as far as Chagny, the line in many places being right alongside the river, a rather sluggish, turgid stream. On the banks growing almost in water were planes, poplars, cypresses and fires.\n\n Here is a typical country lane with bramble hedges on either side from which a blackbird flies out as the train passes. Fronting this road is an ivy covered cottage surrounded by a tiny picket fence within which several gesticulating youngsters clamour for \"souvenir\" or \"bullee biff\". Many are the coat and cap badges, hard biscuits and tins of bully beef thrown to the country people along the route with the usual prodigality of the Australian soldier. Sometimes coppers were thrown but whatever it was it caused a scramble from which some youngsters emerged smiling and victorious.\n\nOver yonder is an aged couple with pitchforks spreading farmyard manure that has been dumped in heaps over a stubble field whilst a pet lamb with ample fleece and long tail is playing by. In the next field is a crop of mustard of which the yellow flower makes a striking feature in the landscape and on the other side are a number of sleek cows browsing over a pasture. A flock of goats are meantime nibbling at the roadside hedges just bursting into bud. Further on is an orchard of 3to 4 acres extent in which peaches and plums are in blossom, and near by are a couple of acres of a cereal crop 8 to 12 inches high just commencing to make its spring shoot. In other lower lying places with indifferent drainage the cereals are grown in ridged fields.\n\nBut grapes are the predominating crop. They are planted in perfect alignment with the soil between rows most carefully tilled, and are neatly staked. Trellising is rarer.\n\nNow we cross the bridge over a canal opening into the Saone and used as a waterway for barges. The narrow tow path is well worn, and there is moored to a stake in the bank a black painted flat bottomed boat. Then we skirt along the fringe of a wood in which we can pick out the mottled stems of poplars, the comparatively straight elms and more spreading beeches. Climbing up the trunks of many of them is a tangled mass of ivy, more picturesque than useful. From the undergrowth there flies up a white breasted bird with black throat and wings and a long spreading tail; it is about the size of a peewee but has a most awkward manner of flight. A more common sight is that of 5 or 6 rooks flying nosily aver a newly ploughed field which is being harrowed by tow women whose umbrellas and belongings tied up in a large handkerchief are to be seen in one corner.\n\nThen again we bypass a two storied house alongside the railway line from which a woman with a \n\nchild slinging to her skirt signals that the line is clear. There is no veranda and the brick walls are surmounted by a roof of red half pipes arranged; in rows with alternate convex and concave surfaces uppermost. It was the same style of roof that had been seen in Colombo. In the well kept garden are growing globe artichokes, lettuces, brussel sprouts and peas, all arranged round a pair of the pine telegraph poles of the characteristic type.\n\nA train passes going in the opposite direction. It is drawn by 2 powerful engines the first of which has a torpedo front to reduce the wind resistance and the 30 or 40 carriages are crowded with poilus who reciprocate the cheering and waving of our men. Goods trains were long and heavy comprising various types of truck, one that was next to us being like a huge barrel on wheels. At the end of certain other trucks was a raised platform with a roof from which the brakes were operated, the object of having it raised being to give the break -man proper observation of the whole train; usually each train had 3or 4 of these brake trucks in its make up. A commoner type which we were destined to have much closer contact with later on in our campaigning was a covered truck with double doorways on each side, having painted on it in conspicuous letters, 4o hommes ou 8 chevaux.\n\nThese passing trains both goods and passenger, are of frequent occurrence and give indication of the French activity. An outstanding feature is the length of the trains and the powerful type of engine used. That certain of them are capable of speed too is shown by an express that rushes past on its way to Paris while we stand by in a siding.\n\nGetting away somewhat from the riverside the line now approaches some rising ground through an overhead bridge where is stationed the ubiquitous French sentry. The slope is thickly wooded and presents a typical Old World winter scene with its bare trees, fallen leaves and scarlet-breasted robin perched on a twig. It only wants a mantle of snow to perfect the picture. Away on the summit of the hill a mile distant is a large stone castle, -relic of early days,- overlooking the countryside for many wide miles.\n\nNow we are back in flat country where there are many signs of spring activity in the bare fields. An old lady with a long stick is driving a team of 3 horses harnessed tandem - fashion to a huge load of farmyard manure being carted to one of the stubble fields. In and adjoining plot 3or4 women are planting potatoes while and old man strikes out the furrows for them. In one corner of a neighbouring vineyard are stacked the winter prunings tied in neat bundles and intended for firewood. This utilisation of all products and universal absence of waste is a general feature throughout the country. Streamlets meandering through the meadows\n\nto join up the main stream have all had willows shoved into their banks and these pollards are the source of large bundles of wands used for basket –making whilst the smaller growths that we should probably pile up and burn are done up in bundles to be burnt as firewood.\n\nThen a stone railway bridge spans one of the larger tributaries on which is built a fair-sized town. From small brick cottages women and children make their appearance and waving to the boys in return for their greetings call for souvenirs. Close by the wooden village bridge over the stream is a platform at which 2 women are washing clothes; a copper is on a fire behind them, but the main work seems to be done in the running water. About the centre of the township rises the church spire and the town clock is seen close by. Unfortunately the church building is hidden from sight by the houses. A further indication of the thrifty character of the country folk is given by the raised backing of the buffers in which thee local railway siding terminates being neatly planted with irises.\n\nAt Chalon the line strikes away from the Saone passing through Chagny and Beaune, continues in a general N direction to the large city of Dijon, which we reach in drizzling rain about noon. This is one of the very old French cities built on the site of one of Julius Caesars’ camps and with its 75,000 inhabitants is a busy centre. The station comprised numerous platforms all roofed over with a high translucent dome. There are numbers of passengers waiting at the station, and amongst them are some French soldiers wearing the steel blue uniform and neat steel casque or tin hat, so different in appearance to the ugly basin-like British tin hat. Others belonging to the Alpine Chasseurs wear the kind of drooping tam-o-shanter, and yet others the waterproof cowl or hood covering head, neck and shoulders.\n\n All seemed in perfect health and in high spirits in spite of what they had been through, for most wore 3 chevrons indicating 2 years service. These sombre uniforms were in strong contrast to the gay colours worn by some senior officers seen at different times, consisting of red breeches with a gold stripe, blue tunics with braided cuffs and red peaked caps adorned with gold braid.\n\nSeveral French red cross ladies were seen moving about the platforms apparently doing similar work to our V.A.D.s. A further demonstration of the way the women were doing their share was given at one of the platforms where a train was drawn up. Instead of porters sweeping out the carriages moving packages etc young women were doing all the work. At a refreshment staff we were able to purchase some beautifully light finger rolls of French bread and Prescott persuaded one of the young ladies to go to a shop close to the station and purchase for us a small Tricolor. In turning up the correct word\n\n \n\nfor this and indeed many times during the journey the little French dictionary purchased in Cairo was very useful. We already had a large Union Jack that one of the officers had bought with him but wanted the red white and blue to put with it. At a well-stocked stall we obtained the daily papers and put them on one side to be read when the light failed.\n\nLeaving Dijon amid farewells from the people gathered on the station we found that the line now took a bend in a general NW direction and followed the Canal of Burgoyne for the first hundred miles as far as Laroche. A few miles out of Dijon we passed through a fairly long tunnel, the countryside generally being of a more hilly nature than previously. It was, however, being utilised to the fullest extent. Copses, woods and forests in which many clumps of mistletoe were seen were more common. Piled on the outskirts of some were bundles of faggots sawn by hand, longer bundles of stakes for grape vines and numerous other bundles of the slender sucker-growths of elms, poplars etc. which by these careful people were saved for burning indoors. Steep slopes were terraced to allow of the land being used to the fullest extent, and stones had been laboriously picked off the surface and placed as low walls along boundaries. On one of these terraces was a girl with a shawl thrown over her shoulders industriously hoeing between the grape vines, but able bodied men were still conspicuously absent.\n\nGradually we passed out of the vineyard country into the land where cereal crops predominated instead. In the sides of the railway cuttings was again noticed the economical idea of cementing in slabs of stone instead of tiles or bricks. Up on the crest of one of the hills, overshadowing a village nestled in the valley below was a large statue which with glasses we made out to resemble the Virgin. It was a reminder of the religious tendency of the country.\n\nWe had seen no sun during the day and as the time passed it became colder and the French sentries were more frequently to be seen occupying their straw sentry boxes, structures that somewhat resembled thatched beehives. A number of these by the way, were seen in one of the gardens of a house near the line. Village scenes similar to those already noted were repeated again and again and as the Union Jack and French flag together were waved to the people, caps were raised and sentries saluted. Most of the cottages were small and in one place were built into the hillside, but there were also some better class houses even 3 and 4 stories high, with a high pitched roof but no verandah.\n\nBy nightfall we had reached Tonnere and after fixing things up with the men, slept soundly in anticipation of a heavy day ahead.\n\nDuring the night before reaching Joigny we left the canal of Burgundy and followed the Yonne through Sens and Montreau, where we left it for the valley of the Seine. This was traversed through Melun almost to Paris, and at daylight when we woke a signpost indicated that we were only 3 kilometres from Paris.\n","10":"\n\nAlthough we did not actually see the sign \"Versailles\" I believe it was here we had breakfast. In the railway yard a good supply of hot tea had been prepared and made a most welcome addition to our rations. We were all glad to stretch our legs precautions being taken to prevent the men wandering too far away from the train. The engine was now attached to the opposite end of the train and as we continued the journey we shaved and tidied ourselves up, having had word from the O.C. troops that we should reach our destination soon after noon.\n\nPassing out of the thickly populated parts near Paris, open country with scattered villages and cultivated crops are again the rule, but the character of the crops has changed. Grapes are not now to be seen, cereals forming the main crop. Most of the fields are larger than those along the Rhone, and the soil is much poorer. A spiked roller is in use in one field and close by several women in wooden clogs digging, while a magnificent pair of horses are ploughing in the next field. Horse chestnut trees which in the south were in full leaf are here just commencing to burst into bud, nor are other signs wanting of the season being much later in these higher latitudes. The sentries along the line are more numerous and women working the signals and at other labours are as frequently seen.\n\nGoing through Beaufort and Clermont we are soon traversing country which with a thrill we realise had actually been trodden by the Hun invaders. About noon we reach Amiens, a large city on the Somme whose acquaintance we were to more fully make later on. In many of the villages in the outskirts are billeted British tommies who heartily respond to the greetings of our men, the cockney accent is marked in many cases. Every village appears to have its quota and along the roadways are seen field service wagons and limbers transporting rations etc.\n\nNow we pass through a pretty little village just beyond which is a shrine set up in an enclosure of well trimmed trees. Beyond it is a cemetery beautifully kept, in which stands a monument in the form of a miniature gothic cathedral.\n\nLow lying land, swampy in places and rather desolate looking, has on the far side of it a ridge where can be clearly traced a line of grass-grown trenches. In a village close by houses are of a ruined appearance and many of them are sandbagged up, whilst in the vicinity are numbers of shell holes.\n\nPassing through Fontaine, a village in which a group of children are jeering at an effigy of the Kaiser, Abbeville is reached about 2 pm. It is a large town at the mouth of the Somme and an important railway junction. As he comes from a train drawn up at the next platform we get into a conversation with an English Officer in heavy winter warm who had just come down on leave from the line near Arras, and feel that now we are \"almost there\"\n\nAfter lunch, accompanied with the usual hot drink the final stage of the long journey is entered upon. Just outside Abberville a glimpse is caught of the estuary of the Somme opening out to a wide bay and beyond this the English Channel. It sent a thrill right through one to think that just over there was Old England. We took it as a good omen that whilst we were thus straining to get our first sight of the Channel the sun broke through the gloom and lightened the whole scene.\n\nThe country was now flat and low-lying, with numerous waterways in which were growing the usual pollards here covered with catkins. Houses and villages were scattered, and comparatively few people, of a more stolid appearance than down south were at work in the fields, composed of heavy clay rather light in colour, ridge cultivation was general. Here and there were quaint looking windmills and further on, as we passed through a wood in which a number of rooks were flying round the tree-tops, we could make out the sand dune country of the coast.\n\nApproaching Estaples our train passed others full of Canadians and Belgians with much cheering from both sides and a t a township where a brief stop was made, a lady collecting money for some Red Cross organisation thrust her box into each compartment. At last we crossed a bridge over the estuary on the shore of which 2 lighthouses stand out predominately and ran into a station where we saw the name \"Estaples\". It was a town with some 6000 inhabitants just outside which was the huge base camp of the British Armies in France. I think everyone regretted that our journey across France was at an end. It had been cold and tiring but was crammed full of interesting sights from start to finish.\n","11":"\n\nAfter tossing sleeplessly most of the night, was awakened about 3 am by Davis and told that the sky was clear and the day promised to be fine. Was dressed for the journey up the line by the time that Davis had my breakfast of fried bacon, bread, butter, jam and tea ready, then buckled on my revolver and equipment and went round the 4.5 howitzer battery to the","12":" Bde. H.Q. some 100 yards away where Brig. General Glassfurd was staying. Had only a short wait before he came along with an orderly and we set off at once on our journey up the line. Going was fairly good as there had been no rain for 2 or 3 days, but the surface of the ground and duckboards was very slippery and in places there were small lakes of mud.\n\nThe guns were quiet. LL the noise and bustle caused by the ammunition columns and rations and fatigue parties had died down and only an occasional burst of machinegun fire and the scattered pop, pop of a rifle shot along the front line broke the early morning stillness. There was no moon. The bright starlight was sufficient to enable us to distinguish outstanding objects but not the shell-holes and patches of mud. Now and then a flare shot up from some point in the line, but for the main part there was very little activity on either side.\n\nScarcely had we got past our Bge H.Q. than we came up with Capt. Richards of the 1st Machine Gun Co. on his way up to visit some of his gun positions, and he accompanied us as far as Cheese Rd. The general was keenly observant of the country and full of questions as to relative positions of various places, unhealthy spots and so on. At Bn. H.Q. in Bull’s Rd. we picked up a guide who had been detailed to go with the general along the Right Bn. front from the gun pits, and thus reinforced we struggled on going over the top for the latter part of the journey from Cheese Rd. to the gun pits, the communication trenches in this part being (as I knew to my cost) thigh deep in mud and slush.\n\nThe dawn was just about breaking so it was still pretty safe. After showing the gun pits and points of interest thereabouts, I left the general and his guide to go along the right front while I reconnoitred the way from the gun pits to the Left Bn front and sent a message for the officer on duty to come along to this end of the trench to meet us. In the middle of this the general put in an appearance, the mud being so bad along Grease Trench that he had abandoned the attempt to traverse it. He was wearing gum boots that came up to his thighs!\n\nMy messenger had not returned but with the increasing light it was dangerous to wait so we scurried across the intervening little stretch of ground and dropped into the front line trench on the other side, a proceeding which I knew was often objected to by the\n\nHun snipers opposite. Indeed and ineffective shot was fired at the man immediately following us, but we safely reached the trench, and keeping low made our way along the narrow passage through the slush and mud.\n\nPresently we came up to the officer on duty and he pointed out what there was of interest at this spot. At the point where Lt.Col. Howell Price of the","13":" Bn. had been shot good observation was obtained, and after I had looked out to refresh my memory about the outstanding features, Gen. Glassfurd poked his head up to see things for himself, and almost immediately a sniper’s bullet whistled past within a few inches of his head,- a very narrow escape. It was a reminder that the light was now good and thereafter we had to go cautiously. Making our way along the narrow trench occupied by one of the battalions of the 3rd Bde. it was fine to notice the cheery smile and hearty word the General had for the men standing to arms. The Co. Commander did not put in an appearance in spit of my message, but we could not wait and after going along nearly the whole of his front we made our way back to Cheese Rd. by one of the communication trenches and here had word that the CO. Commander would be along soon. A dug- out lover evidently!\n\nHowever the General would not wait and we went along Cheese Rd. to the entrance to Chalk Trench, meeting here 2or 3 men coming up from Bn.H.Q. They were coming along the parapet and said that the Trench was very muddy and going along the top quite safe. I asked the General what he wished to do. He unhesitatingly chose the top so we set off, myself leading, then the general and after him the orderly.\n\nScarcely had we gone 20yds. when there was a whistle smothered by a bang of the exploding shell and I was conscious of a sharp pain in my left arm and realised that I was lying twisted up some distance from where I had been standing, with something warm soaking my shoulder and chest. On looking round and attempting to rise I saw the General lying 15 to20 yds. away and called to see if he was badly hit to be met with enquiries as to my state. The orderly was lying a shapeless mass some 20yds. further away, the 4.2H.E. shell having landed almost at his side. Fortunately the men whom we had met were in Cheese Rd. near by and I called to them to lend a hand to the General at once. A fragment of shell had penetrated the thigh and passing through the abdomen had lodged in the kidney.\n\nAs the slow barrage continued and shells kept landing in our vicinity the men carried the General into a dilapidated trench running along the Cheese Rd. embankment and I sent an urgent message to the Co.H.Q dug –out.\n\nclose by for transmission to our Bde. H.Q. so that they might make arrangements to get the General back with the utmost speed.\n\n The men came back for me as soon as the General was in the comparative safety of the trench and carried me over. Scarcely had I been laid in the muddy bottom than another shell landed on the hard roadway at the entrance to Chalk Trench, narrowly missing a party of 4 stretcher bearers who were hurrying down from the Co.H.Q. for General Glassfund. After rendering first aid, these 4, one at each handle of the stretcher and 4 more accompanying them as a relief carried the general back to the forward aid post in Grass Lane. Afterwards I learned that in spit of every effort the General only lived for about 24 hrs. He was a splendid soldier and greatly loved by his men of the 12th Inf. Bde.\n\nPresently my turn came. After giving me a good drink from a water bottle to relieve the burning thirst, the men placed a field dressing on the wound from which the jagged ends of bone were protruding and I was lifted onto a stretcher and carried to the forward aid post. This had been a German dressing station prior to the capture of Flers and Guedecourt , and consisted of a short tunnel into the embankment of Grass Lane with some wood work as a roof which made it a fairly conspicuous object. It had suffered to some extent from shell fire although neither side had, I think deliberately shelled it. Not far away was a derelict \"tank\" much battered by enemy guns,-deliberately this time of course. \n\nThere were other casualties awaiting attention but my turn soon came. Injections of antibiotic serum to morphia, were given, the sleeves of raincoat, tunic and shirt cut away and the wound painted with iodine and bandaged up. The arm was then bound to the side in lieu of a splint and a much needed blanket wrapped round me on the stretcher for it was a miserably cold, dull day. A card giving rank, name, unit, nature of casualty, treatment given in way of injections and so on was pinned on to the blanket, the main object being to save the patient the bother of replying to all these queries at the various stations passed through, besides as acting as a guide to further treatment.\n\nThe journey back on the stretcher then commenced and is not likely to be forgotten soon. The ground everywhere was pitted with shell holes, the intervening spaces being soft and muddy and in many places very slippery. The straw stubble indicated that not very long previously it had been under cultivation to some cereal crop. As a consequence of all this the 4 men carrying the stretcher had hard work and progress was slow and difficult; each lurch of the stretcher and sudden jar caused a good\n\ndeal of pain to the arm which would have been unbearable but for the morphia injection. The bearers did their utmost to minimise the movement and were really splendid. The nerves were in such a state with the shock that one imagined that each shell screaming on its way overhead was going to burst first over the stretcher. It was a terrifying experience but eventually we arrived at the Regimental Aid Post in Bull’s Rd. near Br. H.Q. where Dr. Embleton was in charge. He examined the ticket pinned on at the forward aid post and after getting me a cup of hot tea looked to the bandages to make sure everything was right for the next stage of the journey. Then with a cheery word and good wishes he gave the word to the fresh stretcher bearers to proceed.\n\nThey carried from the","14":" aid post to the valley near the road from Deville Wood to Flers where was the terminus of a light tramway on which were pushed trucks each carrying 2 stretchers. The intervening ground between these 2 spots was very rough and uneven, but as usual the bearers did their utmost to reduce movement and jarring. About midway across Major Milligan, the Brigade Major of the 1st Bde. met us to wish me a speedy recovery, and from him I learned that General Glassfurd had been buried away to the rear.\n\nJust below our Bde. H.Q. Davies , my batman, came along with my shaving gear and odds and ends which were placed on the stretcher under m y head. I was glad to see him and left him with a message for Rid and Leo.\n\nThe journey on the tramway was fortunately not a long one for at each junction of the rails there was a jolt and a jar and once with a bump the truck ran into another truck or something. By this time too, one was chilled through and through and completely numb in the extremities.\n\nThe forward dressing station outside Delville Wood was a real haven of rest. The burst of shells seemed far removed and there was a greater air of peace. The stretchers were carried into a tent warmed up by a fire, which was perhaps just as well for they here removed my wet muddy things-in most cases cutting them off- and dressed me in warm Red Cross pyjamas. This was the first contact with the Red Cross but I was destined later to see and enjoy much more of the excellent work this organisation does for the sick and wounded. The trench boots I thought would be useful to Leo and me, and the A.M.C. orderly promised to send them over to him; I was of course, quite unaware that at this time he himself was lying in a hospital. The bandages were removed and the arm and hand washed free of mud with warm water and soap and the place rebandaged and a cane splint put on. A very welcome cup of hot tea came after another injection of morphia, then they wrapped blanket round me on the stretcher and carried it out to the motor ambulance. This is built to take 4 stretchers in 2 tiers and being the last case for the car I occupied a top berth. Just as I was about to be lifted in one of the A.M.C. orderlies came up and asked if Waterhouse was not my name. It proved to be\n\nMr Elder Junior Supr. of the Rockdale S.S. and it was fine to meet an old friend in these surroundings. The various things from my pockets, badges from tunic etc. were all carefully wrapped up in a triangular bandage and put with my shaving gear in the haversack.\n\nThen commenced the long and painful journey back to the Casualty Clearing Station at Heilly some 20 kilometres (12 ½ miles) distant. The roads were in a fearful state. Here an unnoticed shell hole full of mud and slush would cause a sickening lurch as the wheel sank into it. There a faggot of wood or other object that had fallen off a passing transport would jar everything as the car passed over it. Then would come a sudden stop as the brakes were jammed on owing to a block in the traffic. So the tedious journey proceeded, to the accompaniment of groans from several of the inmates, one of whom had a bad head wound. Through the back of the ambulance one caught occasional glimpses of the dreary shell splattered country through which we were passing, but for the most part one lay in a semiconscious state as a result of the morphia absorbed and just longed for the journey to come to an end. Repeated enquired by the head case as to how much further we had to go elicited the invariable reply from the driver that it was only about a hundred yards further!\n\nThe day dragged on and gradually the light faded. Soon after nightfall the car came to a stop and flashing lanterns and hurrying forms showed that at last we were at last we were at the C.C.S. In a very short time the stretcher was lifted out and carried to the operating tent where the wound was examined and a piece of metal bent round the bone and several fragments of bone were removed. Brandy and soda was given immediately afterwards and then the stretchers removed to another tent to make room for the next case. Here I was delighted to see Capt. C.C.Minty who when he found that I had had my last meal in the early morning insisted on sending a tray of dinner from their mess, but the cup of tea was all I felt inclined for.\n\nPresently I was marked up for a certain ward which turned out to be a large marquee wherein were a number of pretty bad cases. Recollections of what occurred here are rather vague and confused. I remember 2 sisters looking after me, doing the dressing from time to time, injecting morphia and so on. In the next bed was an officer shot through the lung to whom a padre was administering the sacrament. When the screens were afterwards removed it turned out to be Lieut. Rowe of the","15":" Aus. Eng., a man who had been doing","16":" year Engineering at the University and used to attend the same Bible Circle. I completely lost sight of him until about","17":" when as I was lying in Randwick Hospital he walked in looking quite well but with a bullet still embedded within a quarter of and inch of his heart.\n\nMore than once Capt. Malcolm Scott came to see how\n\nI was getting on, having, as I afterwards discovered, tramped through fearful mud each time. Major Goldsmith who at one time was family doctor in Chatswood came once and expressed the opinion that within 2 months I should be able to return to duty. Capt. Minty paid numerous visits to see if there was anything he could do for me. Lieut. Hutchison, also a former","18":" Year Engineering student came in 2 or 3 times to see his brother, and R.E. officer lying wounded in the ward. One day Colonel Glassfurd (?48th Imp. Division) came to get any particulars I had concerning his late brother, and it was from him that I first learned that the Generals wound had been fatal.\n\nEventually the doctor marked me up for and outgoing convoy and in the morning I was wrapped up warmly and taken in an ambulance through the biting cold to the hospital train waiting at the railhead.\n\nWhen we were at Etaples going through training I remember that frequently we used to watch convoys coming in and going out and more than once I said that it would do me to be occupying one of the cosy-looking bunks in the hospital train. Appearances are sometimes deceptive. The actual experience proved to be anything but enjoyable. The carriage was a similar one to our suburban cars with all seats removed and replaced by racks in which were placed tiers of stretches- all too numerous. It was artificially heated and really became rather oppressive as the journey proceeded.\n\nSeveral of the cases were very bad judging by the groaning and other signs of pain, and the journey down to the hospital at Rouen proved most trying, jolting and jarring was continuous and gave one the impression that the French track must be very badly laid or else in urgent need of attention. Better springing of the carriages would have overcome the difficulty. Frequently the train was pulled up with a jerk by the sudden jamming on of the brakes and several times in crossing points it seemed almost as if a wheel was off the line. Under ordinary conditions it would have been delightful to go through this country and see it under winter conditions but as it was the journey seemed interminable and at least one injection of morphia was given to relieve the pain.\n\nAt last however it came to an end, and late at night we reached Rouen where by ambulance we were taken to No.8 General Hospital. As each motor drew up the 4 stretchers were lifted our and carried into the reception room where the doctor on duty allocated the cases to the wards. By some mistake I was marked up for a soldiers ward and carried up 2 flight s of stairs where I saw at once the mistake that had been made. In spite of protests they insisted on lifting me off the stretcher on to a bed which meant that when sister came along I had to be transferred back to the stretcher and carried down one flight of stairs to theofficers’ ward.\n\nHere were spent the next 3 or 4 days, another period \n\nconcerning which I have not a clear recollection. The hospital was an English one and the staff struck me as being splendid. Most of their cases were serious ones and there were 2 or 3 deaths in the ward during my stay. The arm was pretty troublesome and caused them some anxiety at first. Dressings were frequently done and after a time the measures used brought the temperature down. The food and drink were of the best and everyone was well looked after. I remember that 2 officers, one a lieutenant of an English regiment and the other a Lieut. Col. of a Scottish regiment made me wild by openly stating that they were there on their way to spend Xmas at home, being tired of trench life. It scarcely seemed to be playing the same game whilst the other chaps in the line were sticking it out.\n\nThe weather was bitterly cold with heavy frosts each morning, but fortunately my bed was close to one of the two stoves that were kept going all the time to warm the ward. It meant too that lying awake through the long night hours it was not so lonely while sister was sitting in front of the fire close by.\n\nOn one occasion a Canadian Padre came through and brought paper and envelopes for a letter home and to Rid. He also occasionally brought a beautiful gramophone up and played some of the best obtainable records on it, it thrilled one to hear this music. On another day I got R.A.M.C. corporal to send off a cable to the home folk to let them know I was all right.\n\nAt last one morning when he did his rounds the doctor marked my chart for \"Blighty\" and straight away rthey started to dress up the cases in warm things fo;r the journey. Leaving the hospital about midday we were taken by ambulance to the station, and as the back flap of the car was rolled up I was able to catch some delightful glimpses of the snow clad landscape. One picture that comes back to mind was an old tile-roofed cottage with a large chimney place at the end surrounded by a straggling hawthorn hedge laden with red berries, the whole thing being liberally besprinkled with snow. Rouen appeared to be a large up to date city and one wished to be well enough and free enough to spend some time exploring it.\n\nThe train journey this time was made in one of the comfortable French","19":" class carriages with bunks made up on the seats. There was not nearly so much jolting as during the previous journey to Rouen due no doubt to the carriage being better supplied with springs. The train was artificially heated but there was a nip in the air that made a hot meal served about dusk heartily appreciated.\n\nIt was fairly late when we drew up at Le Havre where the train ran almost down to the wharf alongside which was moored the \"Bulwer Castle\", a magnificent Castle liner plying between France and England as a hospital ship. A big stretcher party was awaiting our arrival. Unfortunately the arm got a bad wrench as they took the stretcher through the narrow passageway at the end of the corridor in order to lower it to the ground. Through a real gale of rain and wind that made it necessary to hang on tightly to our covering of blankets, we were carried on board\n\nand were soon tucked in bed in the forward saloon which was fitted up as a big ward. All appliances and conveniences seemed to be at hand and there was a large staff of doctors, nurses and orderlies, all the latter appearing to be men unfit for front line work. \n\nThe voyage across the channel was made without incident although the fog made it somewhat longer than usual. I have no recollection of any motion of the vessel and think it was a calm passage. The dressing was done at intervals.\n\nIt was dark next evening when we came alongside at Portsmouth and I much envied the walking cases who had been on deck seeing things as we came up the harbour. The ticket pinned to me at this time marked \"serious\" so was one of the last to be carried to the hospital train close by. Previously a staff officer had come around the wards asking officers whether they wished to go to any particular hospital in England and tho’ no choice was allowed the A.I.F. officers, most of the Imperial people seemed to have their tickets marked according to their wish.\n\nTravelling was infinitely more comfortable than on the French railways and we went through to London at express speed. A doctor and regular army nurse wearing the King’s and Queen’s South African ribbons did rounds and attended to needful cases. A good hot cup of tea and biscuits were brought round soon after we were well on the way. Waterloo station was reached after midnight and here a big convoy of ambulances and stretcher bearers were waiting. Four stretchers were loaded on one car and a V.A.D. was told off to watch me during the journey. I was supposed to be rather bad and was in fact feeling a bit done after the travelling. I remember she sprinkled eau-de-cologne on my forehead and handkerchief, a proceeding which somehow called to mind that it was Olive’s Birthday. I wished that she had been in the place of the V.A.D., but would like to know who the latter lady was so as to thank her for the attention given me that night. Very little was to be seen through the back of the ambulance on the way up to Wandsworth. All lights were sheltered and the deserted London streets almost in darkness, but we went at a good pace until the V.A.D. made the driver go slower on account of the lurching and jolting.\n\nAbout 2 am on","20":" we reached No.3 London General Hospital at Wandsworth where the well-known night matron \"Sister Susie\" (Sister Sanders) accompanied the stretcher to \"I\" ward where I was destined to spend the next 2 months. The transfer from stretcher to bed was effected with a feeling of infinite relief that the travelling was at an end and I was at last safely settled in England.\n\n"}}