{"Document Name":{"0":"Diary_0123","1":"Diary_0123","2":"Diary_0123","3":"Diary_0123","4":"Diary_0123","5":"Diary_0123","6":"Diary_0123","7":"Diary_0123","8":"Diary_0123","9":"Diary_0123","10":"Diary_0123","11":"Diary_0123","12":"Diary_0123","13":"Diary_0123","14":"Diary_0123","15":"Diary_0123","16":"Diary_0123","17":"Diary_0123","18":"Diary_0123","19":"Diary_0123","20":"Diary_0123","21":"Diary_0123","22":"Diary_0123","23":"Diary_0123","24":"Diary_0123","25":"Diary_0123","26":"Diary_0123","27":"Diary_0123","28":"Diary_0123","29":"Diary_0123","30":"Diary_0123","31":"Diary_0123","32":"Diary_0123","33":"Diary_0123","34":"Diary_0123","35":"Diary_0123","36":"Diary_0123","37":"Diary_0123","38":"Diary_0123","39":"Diary_0123","40":"Diary_0123","41":"Diary_0123","42":"Diary_0123","43":"Diary_0123","44":"Diary_0123","45":"Diary_0123","46":"Diary_0123","47":"Diary_0123","48":"Diary_0123","49":"Diary_0123","50":"Diary_0123","51":"Diary_0123","52":"Diary_0123","53":"Diary_0123","54":"Diary_0123","55":"Diary_0123","56":"Diary_0123","57":"Diary_0123","58":"Diary_0123","59":"Diary_0123","60":"Diary_0123","61":"Diary_0123","62":"Diary_0123","63":"Diary_0123","64":"Diary_0123","65":"Diary_0123","66":"Diary_0123","67":"Diary_0123","68":"Diary_0123","69":"Diary_0123","70":"Diary_0123","71":"Diary_0123","72":"Diary_0123","73":"Diary_0123","74":"Diary_0123","75":"Diary_0123","76":"Diary_0123","77":"Diary_0123","78":"Diary_0123","79":"Diary_0123","80":"Diary_0123","81":"Diary_0123","82":"Diary_0123","83":"Diary_0123","84":"Diary_0123","85":"Diary_0123","86":"Diary_0123","87":"Diary_0123","88":"Diary_0123","89":"Diary_0123","90":"Diary_0123","91":"Diary_0123","92":"Diary_0123","93":"Diary_0123","94":"Diary_0123","95":"Diary_0123","96":"Diary_0123","97":"Diary_0123","98":"Diary_0123","99":"Diary_0123","100":"Diary_0123","101":"Diary_0123","102":"Diary_0123","103":"Diary_0123","104":"Diary_0123","105":"Diary_0123","106":"Diary_0123","107":"Diary_0123","108":"Diary_0123","109":"Diary_0123","110":"Diary_0123","111":"Diary_0123","112":"Diary_0123","113":"Diary_0123","114":"Diary_0123","115":"Diary_0123","116":"Diary_0123","117":"Diary_0123","118":"Diary_0123","119":"Diary_0123","120":"Diary_0123","121":"Diary_0123","122":"Diary_0123","123":"Diary_0123","124":"Diary_0123","125":"Diary_0123","126":"Diary_0123","127":"Diary_0123","128":"Diary_0123","129":"Diary_0123","130":"Diary_0123","131":"Diary_0123","132":"Diary_0123","133":"Diary_0123","134":"Diary_0123","135":"Diary_0123","136":"Diary_0123","137":"Diary_0123","138":"Diary_0123","139":"Diary_0123","140":"Diary_0123","141":"Diary_0123","142":"Diary_0123","143":"Diary_0123","144":"Diary_0123","145":"Diary_0123","146":"Diary_0123","147":"Diary_0123","148":"Diary_0123","149":"Diary_0123","150":"Diary_0123","151":"Diary_0123","152":"Diary_0123","153":"Diary_0123","154":"Diary_0123","155":"Diary_0123","156":"Diary_0123","157":"Diary_0123","158":"Diary_0123","159":"Diary_0123","160":"Diary_0123","161":"Diary_0123","162":"Diary_0123","163":"Diary_0123","164":"Diary_0123","165":"Diary_0123","166":"Diary_0123","167":"Diary_0123","168":"Diary_0123","169":"Diary_0123","170":"Diary_0123","171":"Diary_0123","172":"Diary_0123","173":"Diary_0123","174":"Diary_0123","175":"Diary_0123","176":"Diary_0123","177":"Diary_0123","178":"Diary_0123","179":"Diary_0123","180":"Diary_0123","181":"Diary_0123","182":"Diary_0123","183":"Diary_0123","184":"Diary_0123","185":"Diary_0123","186":"Diary_0123","187":"Diary_0123","188":"Diary_0123","189":"Diary_0123","190":"Diary_0123","191":"Diary_0123","192":"Diary_0123","193":"Diary_0123","194":"Diary_0123","195":"Diary_0123","196":"Diary_0123","197":"Diary_0123","198":"Diary_0123","199":"Diary_0123","200":"Diary_0123","201":"Diary_0123","202":"Diary_0123","203":"Diary_0123","204":"Diary_0123","205":"Diary_0123","206":"Diary_0123","207":"Diary_0123","208":"Diary_0123","209":"Diary_0123","210":"Diary_0123","211":"Diary_0123","212":"Diary_0123","213":"Diary_0123","214":"Diary_0123","215":"Diary_0123"},"Date":{"0":"unknown","1":1093.0,"2":1094.0,"3":1095.0,"4":1096.0,"5":1097.0,"6":1098.0,"7":1099.0,"8":1100.0,"9":1101.0,"10":1102.0,"11":1103.0,"12":1104.0,"13":1105.0,"14":1106.0,"15":1107.0,"16":1108.0,"17":1109.0,"18":1110.0,"19":1111.0,"20":1112.0,"21":1113.0,"22":1114.0,"23":1115.0,"24":1116.0,"25":1117.0,"26":1118.0,"27":1119.0,"28":1121.0,"29":1122.0,"30":1123.0,"31":1124.0,"32":1125.0,"33":1126.0,"34":1127.0,"35":1128.0,"36":1129.0,"37":1130.0,"38":1131.0,"39":1132.0,"40":1133.0,"41":1134.0,"42":1135.0,"43":1136.0,"44":1137.0,"45":1138.0,"46":1139.0,"47":1140.0,"48":1141.0,"49":1142.0,"50":1143.0,"51":1144.0,"52":1145.0,"53":1146.0,"54":1147.0,"55":1148.0,"56":1149.0,"57":1150.0,"58":1151.0,"59":1152.0,"60":1153.0,"61":1154.0,"62":1155.0,"63":1156.0,"64":1157.0,"65":1158.0,"66":1159.0,"67":1160.0,"68":1161.0,"69":1162.0,"70":1163.0,"71":1164.0,"72":1165.0,"73":1166.0,"74":1167.0,"75":1168.0,"76":1169.0,"77":1170.0,"78":1171.0,"79":1172.0,"80":1173.0,"81":1174.0,"82":1178.0,"83":1179.0,"84":1180.0,"85":1181.0,"86":1182.0,"87":1183.0,"88":1184.0,"89":1185.0,"90":1186.0,"91":1187.0,"92":1188.0,"93":1189.0,"94":1190.0,"95":1191.0,"96":1192.0,"97":1193.0,"98":1194.0,"99":1195.0,"100":1196.0,"101":1197.0,"102":1198.0,"103":1199.0,"104":1200.0,"105":1201.0,"106":1202.0,"107":1203.0,"108":1204.0,"109":1205.0,"110":1206.0,"111":1207.0,"112":1208.0,"113":1209.0,"114":1210.0,"115":1211.0,"116":1212.0,"117":1213.0,"118":1214.0,"119":1215.0,"120":1216.0,"121":1217.0,"122":1218.0,"123":1219.0,"124":1220.0,"125":1221.0,"126":1222.0,"127":1223.0,"128":1224.0,"129":1225.0,"130":1226.0,"131":1227.0,"132":1228.0,"133":1229.0,"134":1230.0,"135":1231.0,"136":1232.0,"137":1233.0,"138":1234.0,"139":1235.0,"140":1236.0,"141":1237.0,"142":1238.0,"143":1240.0,"144":1241.0,"145":1242.0,"146":1243.0,"147":1244.0,"148":1245.0,"149":1246.0,"150":1247.0,"151":1248.0,"152":1249.0,"153":1250.0,"154":1251.0,"155":1252.0,"156":1253.0,"157":1254.0,"158":1255.0,"159":1256.0,"160":1257.0,"161":1258.0,"162":1259.0,"163":1260.0,"164":1261.0,"165":1262.0,"166":1263.0,"167":1264.0,"168":1265.0,"169":1266.0,"170":1267.0,"171":1268.0,"172":1269.0,"173":1270.0,"174":1271.0,"175":1272.0,"176":1273.0,"177":1274.0,"178":1275.0,"179":1276.0,"180":1277.0,"181":1278.0,"182":1279.0,"183":1280.0,"184":1281.0,"185":1282.0,"186":1283.0,"187":1284.0,"188":1285.0,"189":1286.0,"190":1287.0,"191":1288.0,"192":1289.0,"193":1290.0,"194":1291.0,"195":1292.0,"196":1293.0,"197":1294.0,"198":1295.0,"199":1296.0,"200":1297.0,"201":1298.0,"202":1299.0,"203":1300.0,"204":1302.0,"205":1303.0,"206":1304.0,"207":1305.0,"208":1306.0,"209":1307.0,"210":1308.0,"211":1309.0,"212":1310.0,"213":1311.0,"214":1312.0,"215":1313.0},"Entry":{"0":"\n\n","1":" Reveille 5 o’clock. Left camp with staff at 7 for the range. 7th & 8th Brigades shot from two positions. Shooting splendid. Day was rather good but cold. After we march past after shooting was over the General spoke to our officers. He spoke well of our Brigade as a whole and remarked it was the best performance he has had in Salisbury for a long time. All our shooting stunts turned out well I think. Got back to camp at 2 o’clock and was very disappointed to find that my weekend leave was cut out. Anyhow I did stables and at night went to the Pictures.\n","2":" Early morning stables. Harness cleaning & midday horses & stables again. This not our Sunday rest idea. I don’t think in part of the day. Wrote a letter to Millie, Beattie & Katherine.\n","3":" Early morning start on Gas mask drill in the morning They are stinking things and make me feel sick. Changed some of the staff horses & fixed up stables afternoon. \n","4":" Felt very sick today. Went on sick parade. Drill order inspection & stables. Had a rest in afternoon till 4.30 when I helped with stables. Received letters from Rana & Florrie.\n","5":" Early morning stables. Felt very rotten all day. Went out exercising horses. I rode the mare out.\n","6":" Early morning stables. Still feeling very sick. This is a cursed country with its fogs & continual frosts. Stayed down in our drying room all day to get warm. Pay \nnight\n . Paid at 7.45. This is quite ridiculous anyhow.\n","7":" Early morning stables. On sick parade. about stables then room. Exercised horses in afternoon. Received letters from Rana & Millie\n","8":" On Cooks fatigue all day Feel slightly better. Day cold & frost still laying about. Spent all day in camp. What a miserable time for anyone to spend. Fancy anyone coming to this. I’ll be quite satisfied when I’m well away from this part of the world.\n","9":" Early morning stables. Exercised horses for an hour in morning. Did midday stables. Had an easy day. Received letter from Florrie & parcel from Rana.\n","10":" Early morning stables. Easy day on instruments & stables. Felt better today. Did not go anywhere.\n","11":" Early morning stables. Exercising horses Clipping horses afternoon. Got ready to go to London. Letter from Beattie.\n","12":" Left camp at 7.15 for Amesbury. Left station at 8.15 for London. Caught express at Salisbury at 9.15. Arrived London at 11.30. Got Tube to Charing Cross & booked room at Faulkners. After I had shave went & booked seats at Adelphi for High Jinks. Had dinner & walked up Strand to Fleet St. Went to St Pauls & Cannon St. Got tube to Bond St where I walked around the shops and also up Oxford St Came back to pub by Tube & got coat. Had some tea & went to meet Millie. Met her at 6 Knightsbridge & proceeded to her place. She changed & we made our way to the Tube. Got to Charing Cross & walked up the Strand to The Theatre. Arrived there stayed in the auditorium & smoked. Went to our seats & enjoyed the show. The old \"High Jinks\" turned out tip top I enjoyed it very much. Came out at 11 & then took Millie home. Stood talking to her for a long while and after saying good bye left for hotel arriving back at 12.45 tired.\n","13":" Got up at 10 & had breakfast. After shave & brush up went up the Strand with Gregson & walked up to the Hippodrome & booked for Flying Colours. Afterwards went to a pub near there and had a few pots. Got a taxi to Simpsons on the Strand and had a good dinner. This is one\n\n21st December 1916 (contd)\n\nof the best restaurants in London. After dinner we went up to the Hip. & saw the show Flying Colors. Not much of a play anyhow. After the show went straight to Waterloo Station. Had some tea and got the 5.00 train to Amesbury. Changed at Andover for the local train at 8.15. Arrived Amesbury 8.45 & got to camp at 10.15.\n","14":"\n\nEarly morning stables. On Canteen fatigue. Rather easy day. Letters from Wyn, Millie & Katherine. Billy went to hospital with his feet bad. Washed some clothes tonight. Very rotten idea.\n","15":"\n\nEarly morning stables. On hut orderly. Afternoon on packing shells in wagon. Wrote to Millie Wyn Katherine & Beattie\n","16":"\n\nEarly morning stables. Hut orderly for morning. Exercising horses afternoon. Xmas eve on Salisbury Plains. What a rotten idea. But still we are here. Went on duty as HQs orderly tonight. Wrote letters to Rana, Charles, Eileen & father.\n","17":"\n\nXmas day and our unit on duty. Just fancy spending Xmas like this. Was on HQs orderly. Had a good dinner in the mess room. Roast pork & plum pudding & beer etc. Finished up orderly at 6. Afterwards wrote balance of Australian mail which closes tomorrow.\n","18":"\n\nBoxing day. On early morning stable. Issued with steel helmets, Gas masks. Full dress parade dismounted afternoon. All piled up with\n\n26th December ’16 cont\n\ngear like prize . Got the & tested them. Got ready for the marching order mounted parade tomorrow.\n","19":" Early morning stables. Full marching order mounted parade. All of the staff were like walking hardware & electrical stores. We were out for inspection for 2 hours in the cold. Huts were divested of all rubbish & space good. A regular clearout of old clothes & uniforms. Received letters from Mr Joyce X Beattie. Walked up to Durrington tonight to get some things.\n","20":" Early morning stables. Preparing all day for moving off. Posted cards to all at home & to Millie Beattie & Katherine. Raining tonight\n","21":" Reveille 3.30. Up pretty nearly all night. Left camp for good (thank goodness) at 7 o’clock. Raining (just like it). Arrived at Amesbury station right section only (Left section followed a few hours later) at 8 and proceeded to entrain. Left at 9.15 and arrived at Southampton 12.15. Took horses & guns off train and then shipped the horses & fed. Afterwards I had some lunch 2 o’clock. Stayed on the dock till 8 oclock at night when the transport moved off with 3 Batteries & some English Garrison men aboard. Going across the channel all night and caught sight of Havre at 8 in the morning Dropped anchor outside.\n","22":" Nine o’clock still outside Havre. Entered Havre Harbour at 12 noon. Unloaded\n\n30th December 1916 (cont) guns & horses & picketed horses till late after tea. Left the wharf at 8 oclock for some camp 3 miles away. Battery went column of through Havre. The clatter of the horses & guns on the cobbles made a great row. arrived at the camp at 9.30 and picketed horses & guns got to sleep for only 4 hours. Reveille 4 and away down to Havre station to entrain for our destination.\n","23":" Eve and on Havre station at 8.30. All guns horses & we this train at 11 and left at 1120 for our destination wherever that might be. Slow old train. Arrived at 70 miles from Havre at 5.\n\n31st December 1916. and watered horses and got some rations. Through the day we passed hospi tal trains with a lot of Australians aboard. They looked very comfortable. At 8 20p went to bed on the floor of the carriage. It looks comfortable after the lack of sleep of the last few days.\n","24":" and spending it in a troop train in Northern France. Woke up at 7.30 after a fairly good sleep under the We came right up the French coast through the night and came through Boulogne & Calais . This morning arrived at Bailleul (7 miles from Armentieres) at 3 o’clock. Detrained & left the train at 5.30 for billets. Arrived there at 6.30 & it is just outside a village\n\n1st January 1917\/ whose name I don’t know yet. Billets are \"up to putty\" merely a small barn for us to sleep and very cramped. Went to sleep very tired.\n","25":" Woke up in our new home. Reveille 6 oclock went down to horses & . The village we are in is called Strazelle, 5 ½ miles from Bailleul and about a mile from the Belgian frontier. We are right in northern Flanders and can hear the bombardment at Armentieres & Ypres. The front about where we are forms a huge horseshoe. All the other battalions of our brigade are quartered near us. The Germans were in the village of Strazelle for 8 days at the beginning of the war but were\n\n2nd January 1917 driven out by the British. Fooled about with the horses harness all the afternoon. After last parade had some tea & went up to the village. There are lots of hotels or \"estaminet\" as they call them here. Had a feed & drinks in the shape of white wine & stout mixed. Came back with trench money of all descriptions. Got to bed tired.\n","26":" Early morning stables exercising horses in morning. Moved down to the wagon lines from the farm to sleep this afternoon. Telephone from DA & Ode HQs connected to our battery which means a guard on from our staff day & night. Captain Campbell lectured the battery this afternoon & put in a lot of B.S.s which is sickening to extreme. Went to the village & had a feed & drinks at the sundry estaminets.\n","27":" Early morning stables. Our Battery the old","28":" split up today 1 section each to go to the","29":" & 26th respectively. Real sorrow felt throughout. The lots form 6 gun batteries. Goodness knows where I shall end now as being a specialist there may be a likelihood of me going into details. Went up to the village and came back to go on guard, the first one I have done for a long while.\n","30":" Came off guard at 6 this morning. Went 10 till 12. At 2.30 our Battery was broken up The left section left first for the 26th Battery our section the right left for the 25th Battery last. Fixing up till nightfall with horse lines & billets. It is a great pity to think of our old 27th going up in smoke. But I suppose needs must. I am writing this in the house of our new billet and all the boys are drinking wine & . These new billets are much better than the last being much bigger & comfortable. Went to bed very tired after the busy day.\n\n6th January 1917 Woke up at 630. Reveille 7 o’clock. Early morning stables in the mud. After breakfast cleaned harness also in the afternoon. The mud here is awful. The front was rather quiet today, but some heavy bombardments took place through the day. No aeroplane fight today. Up till yesterday we have seen aeroplane fights all around here. Mail in today which I hope holds piles of letters for me. The new 27th Battery have taken over our\n\n6th January 1917. old billets as we can see them from here. Did not go anywhere tonight but went into the house and had wine with Billy.\n\n7th January 1917. Early morning stables. Church parade in the morning. Stables at midday. Exercising horses afternoon went through the villages of Caestre & Fletre not far from our billet. Rather fine little place. Came back late & finished stables in the dark. Australian mail arrived today I got a few letters & many papers. Also got an English letter from Millie. Went to the house & had some coffee & bread Got a letter from Nance late tonight.\n\n8th January 1917. Reveille 6 o’clock Stables & ready for inspection by some General. I hear General Birdwood was at the inspection. I did not go to the parade being a spare no. number Raining already & snowed part of the time. Gave up my saddlery & horse and am now a gunner in the Battery. Finished up stables early. Went to the house & had champagne. After some coffee & bread.\n","31":" Early morning stables. Took spare horses over to the Detail Battery. Came back late for dinner. Fooling around stables all afternoon. Paid tonight the sum of 25 francs (17\/11). Walked to the village of Caestre and had some tea & also a shave. Came home at 9 o’clock.\n","32":" Early morning stables. Went on bath parade at a village a few miles from Strazele. Had a swift and hot shower. Came back at 1 o’clock. Fooling round stables afternoon Went up to St Croix for a feed. Heavy bombardment all day on the Ypres to Armentieres front.\n","33":" Early morning stables. Went on bath parade again. Came back for dinner Went on gas mask parade & had a lecture on the new box mask. A much better investment than the H.P. mask. Did afternoon stables. Walked to Caestre and had a feed & drink. Went to bed tired.\n","34":" Early morning stables. Went on bath parade again. Came back & stopped at Strazele and had some lunch at Mlle Madeline’s a fine little Frenchie. On the stables afternoon among the mud slush & snow. Went up to St Croix at night & had a feed. Afterwards went to the estaminet & demolished 6 bottles of champagne among 3 of us.\n","35":" Early morning stables. Wet & snowing heavy all day. I got terribly wet especially about feet & legs. Exercising horses & shovelling metal to fill up mud hole. Went to Caestre for a feed & drinks etc.\n","36":" Got up at 7 & had breakfast. Reported at 8 o’clock for ration fatigues on the HQrs stores. A hard job. Unloaded 7 lorries of oats & 5 of hay and loaded up all the Divisional G S wagons. This was solid going from 1 till 6 tonight. Somewhat tired on it. Walked back to billets & went to bed.\n","37":" Early morning stables. Shifted our billets & lines to Strazelle. We are now billeted in an old mill, and a very rough concern after the billets we have had in the 25th. We hope to move up to the line tomorrow. I am wishing this comes to pass. Ha d a feed at Mlle Madeline’s & had a few drinks. Went to bed in our new \"doss\".\n","38":" Early morning stables. Spent a cold night in our new billets. Didn’t move up to the line. Fooled about the lines all day. Issued with our rations today. Went down to the village for a bath. We leave for the line tomorrow sometime. At last our turn has come. I am rather glad it has. Hope I sleep warmer tonight.\n","39":" Early morning stables. Got ready for moving off to firing line. Left at 12 and arrived at Armentieres at 6 oclock. Went right up to the gun pits, which are situated on the outskirts of the town. Stacked the shells from the wagons in the house behind the pits. The guns were put into the pits. The Tommies pulled out. The wagons & spare gunners made way back to the wagon line about 5 miles from the guns and a rotten place it is too. Got back late & slept in some sort of a hut. This was my entry into the firing line, rather an \ninglorious entry. Quite a coincidence to note that it was twelve months today since I went into camp.\n","40":" Got up at 8. Spent a very uninteresting day in the mud & slush about this camp. Still snowing heavy. This makes 3 days continuous. Yesterday was very cold & today not much better. Wont I be glad when I am out of this rotten country. Rations very short and I got a hunger up today. Went down to a wayside shop tonight & had some eggs & coffee.\n","41":" Early morning stables. Fooling around lines all day. Exercising horses afternoon. Passed through some villages of size. Unloaded concrete slabs for drills tonight. Did not go anywhere. Front very quiet today.\n","42":" Early morning stables. Unloading concrete slabs all day. Very strenuous day. Rations still short. Had tea at a house near the village of Croix de Bax. Stayed in the hut at night.\n","43":" Early morning stables. On sanitary fatigue all day. Bombardment very heavy all around the \"Horseshoe\". This is the name given to the front on which we are at present. Armentieres forming the frontal part of the shoe. Still very cold & the ground frosty hard which is a blessing. Some more of our gunners went up to the pits today. Did not go out tonight.\n","44":" Early morning stables. Got word today that I was to go up to the guns as telephonist on the staff of the 25th. Somewhat glad at the idea of getting away from this hole. Left the wagon lines at 4 and arrived at Armentieres at 4.45 and got to the guns at 5.30. Reported & got fixed up in our dugout which we hope to make very comfortable. Visited the boys at the pits & afterwards went to bed ready for going on duty at 4 oclock tomorrow morning. \n","45":" Went on duty at 4 oclock this morning. Did not sleep too bad in the dugout. Came off duty at 6 & had breakfast & then went on duty from 8 till 12.30. Off for the afternoon &had a good look around our new home. Very quiet on the front, but enemy aeroplanes were frequent in their visits. Very cold through the day. Went on duty again at 5 till 8. Received letters from home and a good batch too. Looted bed etc for our dugout & fixed them up tonight. Very comfortable. Just fancy a real live bed on active service. Enemy aeroplanes responsible for shelling the 27th Battery today, with the result that they had to clear out. One man killed & officer & men wounded. Am writing this in my dugout at 11 oclock. I go on duty for 2 hours at 12.\n","46":" Woke at 8 after a refreshing sleep of 6 hours. Fixed up the dugout & cleared up. Went on duty at 12.30 till 5. Still very quiet on the front. Enemy aeroplanes about again today. Day cold temp about 25. At night the thermometer registers 10 to 15 so this is just all right (I don’t think) for Australians to have to stand. Our Battery as well as our neighbours were somewhat active today & tonight. Received some more Aust. letters. Fritz’s artillery has been having rows with our OP at ‘Cherry House’ as he knocked the top off the\n\n24th January 1917 (Con) stack this afternoon. Good job none of us were on top. Most of our staff out today had narrow squeaks from shrapnel & 5.9s lobbing near them. The Germans seem to have very crook ammunition & a good many of their shells strike without bursting. I hope ‘his’ stock is all like the present ones. Did not do much after coming off at 10.\n","47":" Day opened very fine but cold. Went on duty at 6 oclock till 830. Fritz’s artillery active today Some of his big shells were bursting over our position. Big pieces of shell came flying into our garden. I walked down \"Cherry House\" way & did not venture too far that way for artillery fire. Walked to the town & bought a few things. Went on duty again at 12.30 & came off at 5. Didn’t go out but went to bed to rest till 12 when I do the next shift of 2 hours.\n","48":" Got up at 7.30 & had breakfast. Walked down toward Cherry House looking for more loot for our dugout. Came back with crockery etc and intending to get a stove tonight . After dinner went on duty at CH one of our Ops and afterwards went to \"L\" another OP. Both chimney stacks by the way. Spent a cold afternoon there at the phone. Came back at 5 & had tea. After tea went down for the stove & had a rough time bringing it along. Fixed it up & went to bed tired.\n","49":" Woke at 8.30 Had breakfast & kept ready for going on duty. Duty happened to be up at the first line trenches. Walked up to RL & arrived at the trenches at 2 oclock. I felt rather shaky on it. It did not turn out at all what I thought about the trenches. Desolation & quietness abounds everywhere at present up there. We reeled out our wire & got into communication with RL & through them to our Battery. I had my first baptism of fire while at the phone. It was a lively 10 minutes or so & I took refuge in a sniper alcove which did not afford much cover. Anyhow I was dead scared while it lasted and am sure a heavy bombardment must be awful. Our Capt arrived at 3.30 it was too late for any \"strafe\" so we left the works out & came away via Japan Rd & Willow Walk (a series of trenches which communicate with the first second & third lines)! I was very tired & hungry when I got back & had a good tea. After tea fixed up the stove & started our first fire. Thus ended one of the most eventful days of my life.\n","50":" Woke at 8 & had breakfast. Fixed up the joint. Germans shelled round our position today without materially damaging anything. Went on duty at 5 & came off at 8. While on duty the biggest \"strafe\" took place. Our guns and all the batteries on this sector started firing at 6 oclock & left off at 7.30. Poor old Fritzy must have had a rough time. Fritzy retaliated in the shape of shelling our trenches. Got some letters from home tonight Went to bed pretty late. Am on duty at 4 – 6 in the morning.\n","51":" Woke at 7.30 after doing the 4 – 6 shift. Had breakfast & made my way down to the OP L. Did a freeze there all the morning. Came off at 10 oclock. Fooled around the horses after in the afternoon. Bought a few eatables & had tea. Went on duty at 8 till 10. Made some cocoa & went to bed.\n","52":" Went on duty at 6 till 8.30. Also again at 12.30 till 5. A very quiet day. Wrote letters for Aust. tonight. Made some cocoa & went on duty at 10 – 12.\n","53":" Got up at 8 went on duty at 8.30 till 12. Fooled around afternoon. Went on duty again at 5 till 8. Wrote letters for the mail. Very busy at 7 tonight in retaliation Fritz got some hurry up. Made cocoa at 10 & then went to bed.\n","54":" Did the 2 till 4 shift & after having breakfast went on again 8.30 till 12. Fooled around in the afternoon till 5 when I went on till 8. Very quiet today. Made some cocoa & had some thing to eat and went to bed.\n","55":" Woke at 8 & had breakfast & clean up. Fooled around during the morning. Enemy aircraft very persistent in visit today. Some wild shooting of the anti aircraft. Went on duty at the OP \"L\" from 12.30 till 5. Did a big freeze down there. Had tea & did the 8 to 10 shift. Had some cocoa afterward & went to bed.\n","56":" Got up at 6 to go on duty till 8.30. Had breakfast & cleaned up. Fooled around the joint till 1230 when duty lasted till 5. Came off & had tea. Afterwards walked up to town & bought a few things. Came back & made cocoa. Had a feed & went on duty at 10 till 12 midnight.\n","57":" Got up at 8 & had breakfast & cleaned up. Fooled around all the morning & after dinner went on duty at 1 on the OP. L. Came off at 4.15 and had tea at 5. Chopped wood for the fire & went on duty again at 8 till 10. Made cocoa & went to bed after having a feed.\n","58":" Got up at 7.30 & had breakfast. Left at 8.30 for baths. Walked a good deal looking for them. Had a great old bath & changed underwear. Baths happen to be large vats in a brewery which is not working now. These vats are about 10 feet across 14 feet deep, and one can have some swim. Arrived back at 3 after having a feed in Armentieres. Went on duty at 3.30 till 8. Had tea in the telephone dugout. Came off at 8 after firing a few shots as directed by the infantry at the Boche. Received letter from Home & also papers from home. Had something to eat & a sleep till 12 when I went on duty till 2.\n","59":" Woke at 7.30. Had breakfast & went on duty at 8.30 till 3.30. Came off & got wood for the stove. Had tea & afterwards sat by fire. Received letters from Rana & Millie. The \"Boche\" was busy today shelling round about us. Made cocoa & porridge tonight.\n","60":" Woke at 8 & had breakfast. After walked down to Houplines to look for some loot. Came back late for dinner. Did not go on duty at all today. Fooled around during the afternoon. After tea sat in the dugout by the fire. Received letters from Laurie & Ben. Laurie tells me in the letter that she is engaged to be married. Quite nice news. Anyhow good luck to her. Made porridge & cocoa for supper.\n","61":" Got up at 8.15 & had breakfast. Cleaned up & had an easy morning. Went on duty at 12.30 till 5. Enemy aeroplanes very constant today. Pieces of shrapnel from the aircraft guns flying round our position today. Went on duty again at 8 till 10. Some heavy bombardment on the line today. Had supper & went to bed. Received cards & letter from home tonight.\n","62":" Got up at 6 for duty till 8.30. Had breakfast & collected wood for fire. Went on duty again at 12.30 till 5. Enemy aeroplanes very busy today. Some of the pilots were very daring and hovered overhead for some time despite the fact of the anti aircraft guns. These gun crews put in some very rotten shooting anyhow Came off at 5 & had tea.\n\n9th February 1917 Cont. Went on duty at 10 till 12. Received a letter from Rana & papers from Charlie. Had supper before going on duty.\n","63":" Woke at 8 for breakfast. Had an easy day off duty. Walked up the town in the morning. Had a sleep afternoon. Went on duty at 8 till 10 at night. Put through SOS tests in record time.\n","64":" Went on duty at 6 till 8.20. Had breakfast & fooled around with the wood etc also got one of the boys to clip my hair. After dinner went on duty at 12.30 till 5. Had tea & sat by the fire reading Aust. papers I have just received. Received letters from Rana & Nance also Made supper of porridge & cocoa and after having a feed went on duty again \nat 10 till 12. A Good deal of strafing going on tonight on our side.\n\n12th February 1917. Woke at 8.30 & had breakfast. Walked up to town & bought coke etc Had dinner there. Left battery at 2.15 for R L the F.O.O dugout on the 3rd line of trenches. I stay here for a week amongst the shot & shell. Fritz strafing today and made it hot for a while on our journey down. Went on duty at the telephone in the infantry dugout a sniper one & practically shellproof. Different from the old one\n","65":" (Con) in which we sleep. I am writing this in the dugout at the phone.\n","66":" Woke at 9 after coming off at 6 oclock. Fixed up breakfast & cleaned up dugout. Went on duty at 12 oclock. Fritz rather quiet today, although at times he shelled our positions somewhat after I came off at 3 I had to walk up to the battery with the F O O’s report. Got back just on dusk with the machine guns spattering bullets around. Had tea & fixed up fire afterwards going for rations. Made some cocoa & then went on duty till 12.\n","67":" Artillery fire woke me up this morning at 4 oclock. I quickly made my way up to the Signal dugout. The row was terrific. It happened that Fritz was attacking and his barrage of miniewerfern or \"minnies\" as we call them was very hot. Anyhow we strafed back & Fritz got a hot time. The Huns (but only a small party) got into our first line & was booted out by the infantry. But our casualties amounted to 19 men 10 killed & nine wounded. The \"minnies\" did the damage. After the show was over I went back to bed & went on duty at 6.30 till 9. Had breakfast & afterwards cleaned up. In the afternoon Fritz gave us some shrapnel which lasted for 15 minutes. Went on duty at 3 till 6 came off & had tea. Went up for rations & went to bed.\n","68":" Got up at 8 & had breakfast cooked some bacon & onions. Went on duty at 9 till 12. Got ready & walked up to the battery. After getting a few things from QMS went up to the town & had a feed. Got back to the trenches in time to go on duty at 6. Had a long walk from Armentieres by the way back through Houplines & Lunatic Lane to Quality Street. Got a sweat up through the quick walk. Went to bed at 9.30 to get a rest when I go on duty at 3am.\n","69":" Went on duty at 3 till 6. Had breakfast & cleaned up. Fritz sent over some \"stuff\" today in the shape of 5.9s whizzbangs etc quiet afternoon. Went on duty from 12 till 3 a strafe on our right tonight very heavy while it lasted. Went on duty at 9 till 12. Received pay of 40 francs tonight. Sent down by Battery.\n","70":" Woke at 6 and went on duty at the dugout. Came off at 9 & had breakfast. Some big strafes around the front on our right & left today. Otherwise very quiet. Went on duty again at 3 till 6. Had tea & went for rations. Afterwards went to bed & went on duty at 12 till 3\n","71":" Woke at 9 & went on duty straight away. Had breakfast at 10.30. After coming off at 12.00 went up to the Battery and up to Armentieres. Had a feed & walked back via Lunatic Lane. Fritz strafed some today and our side gave him some goods back. Went on duty again at 6 till 9, went to bed tired & ready for the night shift from 3 to 6.\n","72":" Had a beastly night. Fritz shelled all night and things were rotten. Went on duty at 3 till 6. Cooked a good breakfast & after cleaning up were relieved at 10 by the 26th. Came back to the Battery at 12. We went straight on to Armentieres to do some shopping and have a feed. Came back via Houplines & got some things for the dugout. Had tea & went to bed early (I don’t think) Was put on duty at 8 till 10. Went straight to sleep at 10 & woke at 6 for duty till 8.00 in the morning.\n","73":" Finished up shift & had breakfast. Fooled around in the morning & went on again at 12.00 till 5. Had tea & sat by the fire. Made supper & afterwards went on duty at 10 till 12. Wrote to Millie & Rana \n","74":" Woke at 8.00 and had breakfast. Cleaned up & got wood. Went on duty at 12.30 till 5. Very quiet day. Went on duty at 12 till 2 after having a good sleep.\n","75":" Woke at 8.45 and rushed some breakfast. Went on duty at 9 on the OP Lalland. Relieved at 1.30 after doing a freeze. Had dinner and read all the afternoon. After tea sat by the fire. Very quiet today on the front. Went to bed early & went on duty 2 to 4. Had a bonser 4 hours sleep till 8 o’clock.\n","76":" Had a good breakfast & clean up & went on duty at 8.00 till 12.30. Came off and fooled around in the afternoon. Walked up to Armentieres and bought a few things. Went on again at 5 till 8 made some porridge & cocoa after coming off duty. Had a feed and went on again at 10 till 12 . Again very quiet on front today\n","77":" Woke at 8 and had breakfast afterwards cleaned up. Fooled around till dinner and then went down to the OP Lalland for afternoon relief. Came off at 4.30 after doing a freeze. Had tea & then went up to one of the other dugouts and played cards. Went on duty at 12 till 2 Made supper.\n","78":" Woke at 8 and had breakfast. Had an easy day on Sweet F.A. Went up to the gas School this afternoon to fix up for course. I will be up on the school for a week. Had tea at Battery & walked to the school at 8 oclock. Got to bed at 9. Received letter from Katherine.\n","79":" Woke at 7 and had breakfast 7.30 Started gas lecture at 9. Lecture & drill all the afternoon. Walked down to Battery and had tea. Returned to school about 9 o’clock.\n","80":" Woke at 7 & had breakfast at 7.30. Lectures & drill on the gas business all day. Walked to Battery after 4.30 for tea. Got back to school in time for a good sleep. Received letter from Rosa & father.\n","81":" Woke at 7 & had breakfast. Lectures & drill on anti gas measures. Went down to Battery for tea. Billee boy came up tonight from wagon lines on water cart. Jolly glad to see him. Received 2 letters from Rana.\n","82":" Woke at 7 & had breakfast. Lectures & practical demonstrations on the gas business. Went down to Battery for tea. Met Perce Lancaster today. He’s driving the General of our Div. Artillery. Enemy aeroplanes busy today.\n","83":" Woke at 7 am had breakfast . Lecture in morning. Went through the real McKay this afternoon. Gas attacks & gas shell bombardment. Also clearing trenches etc and through all the practical game of anti gas. Rather an interesting afternoon. Walked to Battery & made some supper. Got back at 9 & went to bed rather tired.\n","84":" Woke at 7 and had breakfast. Went through examination on gas measures today. Finished up school this afternoon. Went to the pictures tonight and got to bed at 8.\n","85":" Woke at 7.30 & packed up to leave for battery. Got there at 9 & fixed up some breakfast. In the afternoon went down to Cherry House to the telephone. Got back at 4.30. Went on duty at 8 till 10. Received Aust mail\n","86":" Woke at 6 for duty till 8.30. Came off had breakfast. Snowed nearly all day, but thawed quickly this afternoon. Went on again at 12 30 till 5. Had tea & sat in dugout. Went on duty again at 8 till 10.30\n","87":" Woke at 6 for duty till 9.30. After breakfast fixed up and got ready to go down to the trenches. Arrived there at 12 oclock to sojourn for another week. On duty till 8 at night. Had a fairly good night’s sleep in a new rathole of a dug out, as we vacated our late quarters in Walk on account of Fritz making things hot in that quarter.\n","88":" Woke at 7 and got some breakfast ready. Went on at 9 o’clock and received word at 10 to proceed to Battery to give the boys instruction in the gas business. On it till 5 when I had a snack & then walked to the trenches. Had tea & got rations. Went on duty at 2 till 8\n","89":" When I came off duty had breakfast and got ready to go up to battery. Arrived there at 10 oclock. Had dinner & sat in the boys dug out by the fire. Walked to Armentieres and made a few purchases. Came back and was paid ( 40 francs) Left for the trenches at 4.45 & had a bit of rest and came on duty at 8 o’clock till 2\n","90":" Woke at 10 and had something to eat. Fritz strafing a good deal today. Went on duty at 2 till 8 at night. Have the night off for sleep as I do not go on again till 8 tomorrow morning. Received letter from Laurie.\n","91":" Woke at 7 after a great sleep. Went on duty at 8 till 2. The Battalion HQR shifted their station from our dugout today leaving us on our pat. If old Fritz gets a footing here now we are gone to the woods. Anyhow its a good idea for us to be here alone as we can sleep right here. Fixed up sleeping & messing quarters opposite telephone dugout Avenue. Fritz strafed tonight & made it hot for a while. Went on duty at 12 till 4 and read Aust papers etc which came in by mail. Received letters from Rana & Florrie.\n","92":" Got up at 8.30 and had breakfast. Fritz busy shelling this morning. Walked up to Battery at 10.30. Shaved & washed & went into Armentieres for dinner. Came back to Battery & fixed up some gas business and came away at 4.30. Our side shelled Fritz the whole day for his cheekiness this morning. Went on duty at 8 till 12. \n News through at 11.5 that Bagdad has fallen.\n","93":" Woke at 7 & went on duty at 8 till 12. Fritz shelling heavily today which brought the wrath of our side on his head. Relieved 4.30 by 26th Battery. Packed up & got back to the Battery at 6 oclock. Had tea & fixed up the dugout. Received letter from Nance.\n","94":" Woke at 6 for duty till 9.30. Went on duty again after cleaning up & dinner at 1 till 4.30. Wrote letters to England & Aust. Big stunt comes off tonight. I hope they give Fritz hell. Got to bed early\n","95":" Woke at 3 oclock to go on duty till 6. Last night’s strafe did not turn out much good. Went down to OP Lalland at 9 till 1 oclock. Came back & had dinner. Fooled around in the afternoon. Went on duty at 8 till 10. Received letter from Millie.\n","96":" went on at 6 till 9.30. Packed up ready for moving away. Went on again from 1 till 4.30. Fixed up finally & moved off from our position at 8 oclock. Very sorry to leave our late home. Went down to the wagon lines by limber for the night. Will probably move up to new positions tomorrow.\n","97":" Woke at 8 after a decent sleep. Left the wagon lines at 10 for the new position Arrived there and had a look round. Very rotten after the old position. But its not too bad, but very open. Went down to our sector of trenches on lines & came back & had dinner at estaminet. After tea the guns arrived and put into pits. Fired a few test shots by orders from the N.Z. major. (This place was held by NZ 1st Battery prior to our moving up. Went to bed & went on duty at 12 till 4, not having much sleep on account of the new goings on in the sig. office. This new position is just outside Armentieres on the border of Belgium & France.\n","98":" Woke at 8 & had breakfast. Fooled around during the morning went on again at 12 . Went on again at from 8 till 12. Very quiet day\n","99":" Woke at 8 for breakfast. Went on duty at 8 till 12. Came off & had a wash and clean up. Aeroplane activity today. This sector is very quiet. Nothing much happening since we came. Went on duty at 6 till 8.\n","100":" went on duty at 4 till 8. Had breakfast & cleaned up. Went on duty again at 4 till 6. Went to bed early. Will be on duty from 12 till 4. Very quiet day\n","101":" Woke at 8 for breakfast cleaned up & fooled around during the morning Went on duty from 12 till 4. Went on again at 8 till 12. Another very quiet day. Wrote to Millie\n","102":" Woke at 8 for duty till 12. Came off & fooled around during afternoon. Came on again at 6 till 8. Very quiet day. Went to bed at 9. Going on duty at 4 till 8.\n","103":" Came off at 8 & fooled around during the morning. Left at 12 for baths. Had bath & had dinner in Armentieres. Came back at 4.30 & went on duty at 6 till 8. Went to bed ready for duty at 12 till 4.\n","104":" Woke at 8 for breakfast. Went on duty at 10 till 4 oclock. Came off & had tea. Afterwards went to estaminet & had a few \"wads\". Came back & went on duty 8 till 12.\n","105":" Went on duty at 8 till 12. Fooled around during the afternoon. Went on again at 6 till 8. Very quiet day.\n","106":" Got up at 4 for duty till 8. Fooled around all day till 4 when I went on duty till 6. Had some tea at estaminet. Went to bed early. On duty at 12 till 4\n","107":" Woke at 8 for duty till 12. Came on again at 8 till 12 midnight. Very quiet day. Cold with sleet showers.\n","108":" Got up at 8 for duty till 12. Came off & went for dinner. Read & slept during afternoon. Had tea at estaminet Went on again at 6 till 8. Got to sleep at 9.30.\n","109":" Went on at 4 till 8 this morning. Fooled around after getting fixed up round the joint. Came on again at 4 till 6. Did the shift of 12 till 4 at night.\n","110":" Got up at 10.30 this morning. Came on again at 12 till 4. Fritz shelling the Pont Nieppe Road tonight. Went on duty again at 8 till 12.\n","111":" Got up at 8. After breakfast went down to the trenches to look round for weeks OP work. Came back for dinner & then went down again & did duty at the Steel Tree and OP. Came back to HQrs & fixed up for the night where I sleep.\n","112":" Got up at 8 and woke officer. Left trench at 9.30 for Battery. Very hungry. Had breakfast and cleaned up after dinner fooled around new quarters. This OP job means a full night’s rest every night so its not too bad. Walked down again to trenches tonight for FOO’s report.\n","113":" April Fool’s day. We are darn \nfools\n to be here instead of Australia. Went down to trenches at 8.45. At our OP all the morning doing sweet F.A. came back at 2.30 & had dinner. We received a gramophone today from the Comforts Fund. Had an impromptu concert with all in the mess at night. Its great to hear some good music on this game. After supper went to bed at 9.30.\n","114":" Got up at 8.15 & cleaned up. Left for trenches at 12.45. Did not do much down there. Bitterly cold with heavy wind. Later on it snowed heavily. Old Fritz shelled our position (OP) late this afternoon. Lobbed a couple of 4.2’s over without doing any harm. Walked back to Battery loaded up with telescope etc in a blinding snow storm. Looked like a regular father Xmas when I got back. Had tea at estaminet. After some supper of porridge went to bed\n","115":" Got up at 8.15. Very easy day on F.A. Snowed & rained & blew like fury nearly all day. Somewhat brighter late this afternoon. Received letter from Katherine.\n","116":" Got up at 8 & had breakfast. Went down to trenches at 9 & stayed on duty till relief at 1.30. Fritz busy all morning with Minnies & shrapnel. We retaliated muchly. Had a rest afternoon till supper time..\n","117":" Got up at 8.15 Received Aust. papers this morning. Left for trenches at 1 & had an easy afternoon. Finished at 7 & fixed up bed to sleep.\n","118":" Had a restless night Heavy artillery work on our left also Battalion changed over with 1st Welsh. Got up at 7 & fixed up FOO’s water etc. Left trenches at 9.30 & packed up at Battery for the detached section at Houplines. Got there at 4 after a long walk. This position very comfortable Went on shift at 8 till 2 in the morning. Read & wrote letters. Received letters from Rana & Lena.\n","119":" Got up at 8.30 for breakfast. Cleaned up. Went on duty at 2 till 8 tonight. Aeroplane fight late this afternoon. Fritz brought one of our planes down in flames. Went to bed early. Received a letter from Rana, Lawrie & Millie\n","120":" Got up at 8 & went on duty till 2. Received letters from A Bess & (Florrie also photographs). Got to bed early for I come on duty at 2 till 8.\n","121":" Went on at 2 till 8 am. Cleaned up & went to breakfast. Walked into Armentieres & had dinner there. Made a few purchases & came back & had a sleep. Went on duty at 8 till 2 oclock.\n","122":" Got up at 8.30 cleaned up. Very quiet day Went on duty at 2 till 8 Went to bed for a good nights sleep\n","123":" April1917. Went on duty at 8 till 2 oclock. Another quiet day. Fritz shelled the town today a bit. Went to bed early.\n","124":" Got up at 2 o’clock for duty till 6. After breakfast walked to Armentieres & after dinner went to wagon lines to see Billy & Merv. Came back & had a bath. Received letters from Rana & Charlie. Went on duty at 8 till 2\n","125":" Got up at 8.30 for breakfast. Went on duty at 2 till 8. Packed up ready for leaving this position. Anyhow did not leave as our relief of telephonists did not come with the new section. Had a full nights sleep\n","126":" Got up at 8 & went on duty till 2. Left the section at 1 o’clock for the battery After having dinner at Armentieres arrived back at 2.30. After fixing up we left the position at 10 30 for Steenwerck where we were to sleep for the night. Got to bed at 3 30 & had a tres bon sleep\n","127":" Woke at 8 & got up for breakfast Went on parade at 9.15 & 4 oclock. Walked up to Steenwerck tonight & looked round. Saw Charlie Chaplin in \"Shangaied\". Got to bed at 9\n","128":" Left Steenwerck at 8 oclock. Went through Bailleul & Hazebrouck. Got to the village of Wallam Capelle for the nights billet at 4 oclock. Fixed up in really dear barn . Walked to Capelle for tea & got back to bed at 8\n","129":" Left Wallan Cappel at 9 oclock. Had a hard time (walked most of the way to a village outside St Omer. Rather pretty place up this way. After fixing up in billets for the night walked to St Omer at 6 oclock. Had tea there & walked around the place. St Omer is a larger place than Armentieres. Got back to Billets at 9. Received letter from Australia\n","130":" Reveille at 6 Left the village at 10 for the next stop. Travelled over 26 kilos today over hilly country. This part of France we have been through today is very pretty. Arrived at Quesques a small village miles from nowhere where we stay for some days. Got to bed at 9 oclcok in very comfortable billets\n","131":" Reveille 6. Fooling around the gun & wagons all day. We leave this place tomorrow for whereabouts unknown. Glad to leave this village which is very slow. Got to bed early\n","132":" Moved away to fresh quarters this morning at 8 oclock. Got to Brunemburt 2 miles away from Quesques where we fixed up horses etc . Attended Sig. school afternoon which carries on during our stay here. Received letters from Rana & Florrie Attended night parade of sigs at 8 oclock\n","133":" Reveille 6 on signalling class all day. Lamp parade at 8 – 9. Another dry day. Got to bed at 9.30.\n","134":" Reveille 6. Church parade this morning. Off all day. Did midday stables also afternoon walked up to a farmhouse for tea. Got to bed early.\n","135":" 1917.Reveille 6am. Signalling all the morning. Left Brunenburt about 2.45 for Desvries for an afternoon spell. Had a few whiskies and had a look round the town. A very slow place so far. Written at 5 pm. Slightly muddled through drinking whiskies. It is 6 months since I have seen whisky. Had a good tea & afterwards left Desvries at 7.30. Had a long walk back. Received letter from Millie.\n","136":" Reveille 6. Easy morning on sweet FA. Received letter from Charlie. Fooling around during afternoon. I had sundry drinks tonight at estaminet.\n","137":" Reveille 6. On cooks fatigue all day. Very slow day. Got to bed early. Stunt on tomorrow.\n","138":" Reveille 5 & moved off on stunt at 8 oclock. Fooled around on the hills about 5 miles away from here. Left at 2 for the billets. After inspection by General Grimwade arrived at Brunembert at 4. Talking to Perce in the village while the general inspected. The camp. Received letters from home.\n","139":" 1917.Get up at 5.30 and got ready to go to Boulogne for the day. Got train from Longueville and arrived at Boulogne at 7.30. Had breakfast & then walked up the beach esplanade nearly to Wimmereux a resort north of Boulogne. Went back by tram to town for dinner. After dinner took the tram to D’Outreau then to Le Portel suburbs of Boulogne. Had afternoon tea & made a few purchases and after tea went to St Martins to catch the train to Longueville. Arrived home tired. Letters from home.\n","140":" Reveille 6 Parade & marching drill morning. Afternoon off. Received letters from Father. Got to bed after writing Aust mail day.\n","141":" Reveille 6 on church parade & horse grazing. Very easy day. Day bright & sunny. Wrote letters to Millie & Katherine. Voted today on the Commonwealth elections.\n","142":" Reveille 6. Sports held today. Rather a bum show. Finished up at 1 oclock. Fooled around all the afternoon. Got ready for moving back to Armentieres tomorrow.\n","143":" Reveille at 5. Moved off from Brunembert at 9. Travelled all day till 5 when we arrived at the same village near St Omer where we stayed coming up. Billeted at a fine place. Got to bed at 9.\n","144":" Reveille 5 am. Moved off from Longueness at 10 & arrived at Hazebrouck at 3 oclock. Fooled around the lines till 6.30 & moved to billets. Got to bed at 9 oclock\n","145":" Reveille 4 am Moved away from Hazebrouck at 8 oclock Warm & cloudy day. Got to lines outside Steenwerck at 3 oclock & stayed there. Fooled around lines until 8 oclock and had tea. Part of the battery left at 8 o’clock for Fleurbaix. I was not detailed to go with the staff so stayed here.\n","146":" Reveille 6. Fooled about the lines all day. Weather very warm. Balance of the battery moved up to the position tonight.\n","147":" Reveille 6. Left the wagon lines for new ones at 2 oclock. Not very far away. Rather good lines. Finished stables at 5. Pay day the usual 40 francs.\n","148":" Reveille 6. Fooling around cleaning up the grounds all day. Day rather cold with winds. Had a good tea at a house not far away.\n","149":" Reveille 6. Fatigue all day on lines. Received letters from home. Fritz shelled Bac St Muir today with heavy stuff.\n","150":" Reveille 6. Went on bath parade to Steenwerck in the morning. While there I got word to report to Battery. Left by horse at 12 30. Arrived at battery at 2 30 & fixed up for duty etc. Went on at 8 till 12. Feeling very tired. Fritz shelling very close here tonight. Battery is just outside Fleurbaix and is very open.\n","151":" Got up at 8 and went on duty till 12. Very fine day. Fritz on his usual shelling around this position. Went on duty again at 6 till 8.\n","152":" Went on duty at 4 till 8 this morning. Very fine day. Fritz gave us the usual shelling. Went on again 4 till 6. Received letter from Laurie\n","153":" Went on duty at 12 till 4 this morning. Woke up at 8 for breakfast. Warm day. Fritz rather quiet. Today is the anniversary of our leaving Sydney just twelve months ago. Received letters from Rana. Part of our battery changed position tonight.\n","154":" Woke at 8 and had breakfast. Went down to the trenches to our O.P. St Davids house & stayed there till 2 oclock. Fritz shelled the Tommy battery alongside us today and burnt them out. Day very warm.\n","155":" Woke at 8 & went on duty till 11. Did 2 - 5 & 8 to 11 shifts through the day & night. Very quiet today. A bit cooler.\n","156":" Got up at 8 for breakfast. Went down to trenches at 1 and stayed at OP all afternoon till late. Got back to battery & had some tea.\n","157":" Went on shift at 5 till 8 this morning. After breakfast wrote letters for mail. Medical inspection at 2.30. On duty 11 2 & 5 till 8.\n","158":" Went down to the OP at 8 oclock and came back at 9 oclock. Shifted quarters today to trenches on work. Hope I do not stay here long. Went on duty at 10 till 2 tonight.\n","159":" Got up at 8 for breakfast. Went on at 10 till 2.\n\nDay wet & windy. Very quiet.\n","160":" Went on at 4 till 8 this morning. Walked up to battery and had dinner in Fleurbaix. Came back & went on duty at 4 till 6. Did the 12 till 4 shift.\n","161":" Got up at 8 for breakfast. Went on duty at 12 till 4. Rather quiet today. Went on again at 8 till 12.\n","162":" Woke at 8 & went on duty. Relieved by Tommies at 12 oclock. Left the trenches at 12 30 & walked up to Fleurbaix for dinner. Had a sleep all the afternoon in the shade near our old position. Left Fleurbaix at 11 30 by horse and got to wagon lines at 2 oclock tired.\n","163":" Woke at 8 oclock and had breakfast. On parade at 9 oclock. Fooling about all day on harness. Knocked off at 5. Battery left for position at Plug Street tonight.\n","164":" Reveille 5.30. Fooled around wagon lines all day. Went on guard at 6 oclock. First guard I have done for months.\n","165":" Reveille 5.30. Fooling around as usual. Went on an ammunition stunt tonight to dump got back at 11 oclock.\n","166":" Got up at 8 oclock. Fooled around on the lines & ammunition all day. Left at 7 for another ammunition stunt. Loaded up at dump and came back to lines at 10 oclock.\n","167":" Reveille 5 30. Went to battery in morning. Fooling about as usual during afternoon. Went on guard again at 6 oclock.\n","168":" Came off guard at 6 oclock. Afterwards went & had a feed. Day very warm. Received letter from Kathie.\n","169":" Reveille 5.30. Afternoon off. Day warm. Party of gunners left for Battery tonight.\n","170":" Reveille 5.30 on harness etc all day. Dry warm. Had tea out.\n","171":" Reveille 5. Shifted wagon lines today further towards the battery just outside Steenwerck. Gun limber went to Plug St Wood. Day dull & inclined to be cold. Went on guard at 6 oclock.\n","172":" Very easy day Came off guard at 6 oclock walked up & had a few drinks. Got to bed at 10.\n","173":" Left wagon lines at 8 oclock for Bailleul, arrived at Bailleul at 9.30 & proceeded to school for pigeon training in connection with signal work. Very easy stunt. Left the school after a lecture for a bath. After tea went to the picture show.\n","174":" Got up at 7 30 for breakfast. Attended lectures on pigeon business through the day. Walked round Bailleul Went to pictures at night\n","175":" Got up at 7 30 for breakfast Attended lectures on the pigeon business. Finished up today. Fooled around till bedtime.\n","176":" Left Bailleul this morning at 11 oclock and got to Steenwerck by motor. Stayed there for dinner and left for the wagon lines late afternoon.\n\n Later\n on arrival got instructions to proceed to Battery. Waited till nightfall to move up to the position succeeded in reaching position safely although Fritz sent a few shells amongst us. But we had to take the wagon with rations via another route & this led us into trouble. We ran into shells galore, blowing up of ammunition dumps & not forgetting gas shells. It was a lively half hour & was much relieved when we made our way back\n\nheadquarters without of staying at the battery. We waited for a good while for a lull in the shelling but it would not stop so returned to the wagon lines, as we came away, late.\n","177":" Got up at 8 oclock. An inquiry was held into last night’s episode. Result strafing of the NCO in charge. Left again for the battery at 10 oclock. Got up to Ploegstreet & was turned back on another road because Fritz was shelling our road. Made our long way round & reached the battery safely at 2 oclock. Dumped the goods off & got a doss in an old gunpit for the night.\n","178":" Got out of bed at 11.30 & proceeded to have some lunch. My word this is the war right enough here. Nothing but guns & shells everywhere. Fritz peppers every part of the wood with all sorts of calibre. He is giving our Australian artillery little hell all the time. This morning 2 officers & some men were killed in one battery. I shall be glad when we oust him out of this as he makes it too willing for us poor blokes. Went on duty at 4 oclock. While on duty Fritz started to shell the battery with heavy stuff. Result all the men had to clear off. I had to stay on in the dugout.\n\nIt was hell while it lasted but he did not succeed in doing much damage. It lasted for 4 hours. Managed to get a bit of tea. Got to bed at 11 oclock.\n","179":" Came on duty again at 6 oclock. Fritz shelled around here today. Killed a few of the boys of other batteries. Built a dugout near the telephone station. Fritz started shelling with gas tonight at 12 oclock. Bombardment started at 3.10 this morning while I was on duty. Lets hope the business will be a fine success and our boys can bring fresh fame to Australia. 5 of our staff are going over with the Infantry. Came off at 4 guns rowing like fury.\n","180":" Woke up at 9 oclock with the artillery still going strong we eased up slightly afterwards. The advance at latest reports is going good, our boys have taken Messines & ridge. Lets hope Fritz doesn’t counter attack much. But I have confidence in our boys. We had a sad day as we had the first death today in this battery. A fine little fellow being caught in his dugout by a big shell. Went on duty at 12 – 4 & 8 – 12.\n","181":" Went on at 8 till 12. Rather quiet as far as artillery goes this morning. Although Fritz shelled the position heavily. Fritz also has been attacking the new positions. At 9 oclock at night Fritz attacked new positions heavily which called the wrath of our artillery on his shoulders. Went to sleep at 10 oclock & woke at 4 to go on duty. Parties of Fritz tried to get into new trenches at that time\n\nbut was soon dispersed by our fire.\n","182":" Came off at 8 oclock. Day rather quiet but with alarms all the time of SOS from the infantry. Fritz being beaten by our fire every time. We read accounts of the push in the papers today with curiosity. Went on duty at 4 till 6.\n","183":" Came on at 12 in time for SOS which was soon over. Came off at 4 everything quiet. Got up at 9 oclock and had breakfast. Paper accounts still speak kindly of the advance here. Went on duty at 12 till 4. Day rather quiet although we had the usual bombardment. Came on again at 8 till 12 midnight. Stunt started at 11 oclock very heavy System of Fritz’s near Messines. I hope our boys grab this rather hot spot.\n","184":" Last nights move turned out a success and we have shifted forward. Day rather on the quiet side Went on duty at 8 till 12 6 till 8.\n","185":" Went on at 4 till 8. Day rather quiet. Rained heavily in the afternoon. Went on duty at 4 till 6.\n","186":" Came on duty at 12 midnight till 4. One of Fritz’s big high velocity guns worrying us at present. Knocked off after plonking a few damn close. Went on duty at 12 till 4. Battery shifts position tonight further towards Armentieres. I guess its another windy possy. Went on at 8\n","187":" Shifted away at 4 oclock & walked through Ploegsteert to the position which is close up to Fritz’s line. Had a bit of a sleep then went on at 8.30. This new\n\nPosition is very \"windy\" & one has not much cover if Fritz strafes. Went on duty again at 6 till 8. Another stunt came off at 7.30. Rather a quiet day. Stunt started at 7.30. N.Z.’s are going over lets hope they are successful.\n","188":" Not much sleep on account of the bombardment. The N.Z.’s gained their objective in their attack. Batteries going all day on the Hun. Went on duty at 4 till 8 4 till 6. Worked on telephone dugout afternoon.\n","189":" On duty through the night 12 till 4. Spent day in fixing up dugout & filling bags for telephone station. On duty 12 till 4 Day very hot Fritz has his new \"red\" planes out today & they seem rather the last word in aircraft. Went on duty 8 till 12 .\n","190":" On duty at 8 till 12. Very hot day. Did not do much in the way of work. On duty at 6 till 8.\n","191":" Came on early in morning at 4 till 8. Was on duty at 4 when Fritz started to shell heavily. Anyhow we had to get for our skins to the accompaniment of Fritz’s shrapnel & HE. Before we got away one of our sargeants was killed. We did not go back to battery till early morning having spent the night out in the trenches here about.\n","192":" Fritz started his little games again this morning. So we have to get again. He got rather quiet later but only we telephonists took up position. I went on\n\nfrom 2 till 6 & walked up to Hqrs for some gear. Came back & had tea. Will go on from 10 till 2 tomorrow morning if Fritz keeps quiet. Received letter from Laurie.\n","193":" Went on at 10 till 2. Fritz gave us some strafe today. Came on again at 8 till 10. Received letters from Rana, Connie & Charles.\n","194":" Came on duty at 6 till 10 oclock this morning. Came on again at 4 till 6. Fritz sent us another \"home run\" again today. Slept till 12 & came on till 4 in the morning.\n","195":" Woke up at 9 with the welcome sight of letters from home being handed me. Went on at 12 till 4. Built a new telephone dugout in the trenches. Fritz rather quiet as far as we are concerned today. Went on duty again at 8 till 12 midnight. Wrote letters home.\n","196":" Went on duty at 8 till 12. Very quiet day. Fritz brought down 3 of our balloons this morning. On duty again at 6 – 8. Received papers from Charles.\n","197":" Went on duty 4 – 8. Fritz shelling at intervals all day. Received papers & books also some more letters from home. Fritz shelled heavily tonight with gas shells & HE for 5 hours. Went on duty 12 midnight till 4\n","198":" Did not get up till 12 Went on duty till 4 oclock this afternoon. Feel pretty seedy through the gas last night. Went on at 8 oclock. We left this position at 10 30 tonight.\n\nand feel relieved at getting away. On the way through Ploegsteert just missed a shell which burst just behind us. Got to wagon lines at 12 oclock.\n","199":" Woke at 8 oclock after a fair night’s rest. Fooled around the lines all day. Got to bed at 6 oclock.\n","200":" Reveille 5 30 am on cooks fatigue all day. Battery with the 3rd Div was inspected & commended by Gen. Monash today.\n","201":" Reveille 5 30. left camp at 9 30 for leave. Went to Baileull & had a very fair day. Visited our friends and had meals in there. Went to the Show & got back in a blinding thunderstorm at 9 oclock.\n","202":" Reveille 5 30. Fooling round all day. General Plumer the head of our big fight spoke to us today. Complimenting us on the work done by the artillery.\n","203":" Reveille 5.30. On stables all morning. Visited by the 1st Division band today & they tuned us all the afternoon Plenty of beer etc floating around. Band left a 4 oclock & we did stables till 5. Did not go out Got to bed early.\n","204":" Reveille 5.30. Very easy day. Wrote some letters home. Got to bed early\n","205":" Reveille 5 30. On bath parade. Fooling round rest of day. Part of Battery left for new position tonight. Posted letter to Rana.\n","206":" Reveille 5 30. Fooling around as usual. Balance of battery went up to position tonight. We are not going up. Day hot.\n","207":" Reveille 530. Packed up & left for battery at 9 oclock. Arrived at new position & passed over the ground of our recent advance. Its an eye opener to anyone. There is hardly a piece of ground which was once Fritzs intact. Saw some of the mine craters on the Ridge. Our position is on the Ridge a little way north of Messines. Spent the afternoon in making a dugout. Went on duty 8 – 12.\n","208":" Woke up at 7 this morning with Fritz putting heavy shells right close. On duty through day at 8 till 12 & 6 till 8. Fritz shelled heavily today getting one of our guns in the stunt although I dont think he was on our battery. Shelled again tonight the big bits coming very close.\n","209":" On duty at 4 till 8. Left battery at 2.30 for a job down the trenches in OP which lasts for 24 hours. The OP is in one of Fritz’s dugouts which have been badly knocked about by our shells. On the Phone till 1 oclock.\n","210":" Did not have much sleep at OP. Down there till 3 oclock when we were relieved by another battery. Came back & had tea & went to bed. Fritz aeroplanes very active today.\n","211":" Woke at 8. Went on duty at 12 till 4. Very sloppy after last night’s rain on duty from 8 till 12. Received letter from Eileen after a long of waiting.\n","212":" On shift at 8 till 12. Day dull & cold. Fritz shelled a bit this afternoon. On duty again at 6 till 8.\n","213":" On duty 4 till 8 this morning very quiet day. On again 4 till 6.\n","214":" On duty from 12 till 4 early morning. Fritz livened things up by shelling round us today. On duty 12 till 4. Again at 8 till 12. Fritz shelled heavily at 9 on the battery & line the back of our position. Wounded 5 of the RFA men.\n","215":" On duty 8 till 12. Pay day today. Fritz planes very active. Day quiet but Fritz started his usual nastiness on nightfall. Part of our battery shifted position further towards the line. We go over tomorrow.\n\n"}}