{"Document Name":{"0":"Diary_0274","1":"Diary_0274","2":"Diary_0274","3":"Diary_0274","4":"Diary_0274","5":"Diary_0274","6":"Diary_0274","7":"Diary_0274","8":"Diary_0274","9":"Diary_0274","10":"Diary_0274","11":"Diary_0274","12":"Diary_0274","13":"Diary_0274","14":"Diary_0274","15":"Diary_0274","16":"Diary_0274","17":"Diary_0274","18":"Diary_0274","19":"Diary_0274","20":"Diary_0274","21":"Diary_0274","22":"Diary_0274","23":"Diary_0274","24":"Diary_0274","25":"Diary_0274","26":"Diary_0274","27":"Diary_0274","28":"Diary_0274","29":"Diary_0274","30":"Diary_0274","31":"Diary_0274","32":"Diary_0274","33":"Diary_0274","34":"Diary_0274","35":"Diary_0274","36":"Diary_0274","37":"Diary_0274","38":"Diary_0274","39":"Diary_0274","40":"Diary_0274","41":"Diary_0274","42":"Diary_0274","43":"Diary_0274","44":"Diary_0274","45":"Diary_0274","46":"Diary_0274","47":"Diary_0274","48":"Diary_0274","49":"Diary_0274","50":"Diary_0274","51":"Diary_0274","52":"Diary_0274","53":"Diary_0274","54":"Diary_0274","55":"Diary_0274","56":"Diary_0274","57":"Diary_0274","58":"Diary_0274","59":"Diary_0274","60":"Diary_0274","61":"Diary_0274","62":"Diary_0274","63":"Diary_0274","64":"Diary_0274","65":"Diary_0274","66":"Diary_0274","67":"Diary_0274","68":"Diary_0274","69":"Diary_0274","70":"Diary_0274","71":"Diary_0274"},"Date":{"0":"unknown","1":1004.0,"2":1005.0,"3":1006.0,"4":1007.0,"5":1008.0,"6":1009.0,"7":1010.0,"8":1011.0,"9":1012.0,"10":1013.0,"11":1014.0,"12":1015.0,"13":1016.0,"14":1017.0,"15":1018.0,"16":1019.0,"17":1020.0,"18":1021.0,"19":1023.0,"20":1024.0,"21":1025.0,"22":1026.0,"23":1027.0,"24":1028.0,"25":1029.0,"26":1030.0,"27":1031.0,"28":1032.0,"29":1033.0,"30":1034.0,"31":1035.0,"32":1036.0,"33":1037.0,"34":1039.0,"35":1040.0,"36":1041.0,"37":1042.0,"38":1043.0,"39":1044.0,"40":1045.0,"41":1046.0,"42":1047.0,"43":1048.0,"44":1050.0,"45":1051.0,"46":1052.0,"47":1053.0,"48":1054.0,"49":1055.0,"50":1056.0,"51":1057.0,"52":1058.0,"53":1059.0,"54":1060.0,"55":1061.0,"56":1062.0,"57":1063.0,"58":1064.0,"59":1065.0,"60":1066.0,"61":1067.0,"62":1068.0,"63":1069.0,"64":1070.0,"65":1071.0,"66":1072.0,"67":1073.0,"68":1074.0,"69":1075.0,"70":1076.0,"71":1077.0},"Entry":{"0":"\n\n","1":"\n\nLeft camp early to march to station through crowded streets, and got any amount of fruit etc from the people\n\nHad a good trip down in the train though a bit crowded, with all the kits and arrived in Sydney about 3.30 pm and though very hot & tired, we had to march to the barracks. As some AMC men were late we had to stand to attention in the sun for 25 mins, and all cursed the day they had enlisted. After inspection by Gen. Rammaciotti we were marched to the Show Ground & shewn our quarters for the night.\n","2":"\n\nMarched off very early. Met Mum at Darlinghurst. Went on \n\nboard about 6 o’clock with every man present. The boat began to move out at 8 o’clock, and though our friends were allowed on the wharf we had no chance of speaking to them. Most of us then thought of things we had forgotten to tell them but too late.\n\nWe stayed in the stream till about 10.15 am when we took up anchor and made for the Heads. While waiting I had a good look round the ship and it looks as though we are going to have a fairly comfortable time. She is a B. I. 6 mno’s boat, the \"Mashobra\" of about 8000 tons.\n\nWe are allowed plenty of deck\n\nspace, and all are sleeping on upper decks, instead of below as in most troop-ships. It is not by any means crowded and the other units seem composed of jolly decent chaps, with whom we ought to get on well. \n\nOn the way down the Harbour we were followed by several launches, with friends of the men on board. Miss Egan of \"Graythwaite\" was on one. The harbour looked great from the Heads, and I suppose will look better when re-entering it again, an event which I hope will some day come.\n\nFor the first few hours out, there was very little\n\nconversation, as pretty well all of us felt: - : thinking of the friends and relatives left behind. However, the members of the coolie crew, with their funny antics & talk soon brightened things up a bit.\n","3":"\n\nMy chums & I slept on deck and intend to do so all along as it is not too pleasant inside on account of the stuffiness. The hammocks are very comfortable as they give to the motion of the boat, though the weather is very calm and there is very little seasickness. \n\nThe food is \n\ngood, and there will be very little drill done so that we should have a good time, as this is considered the best time of the year for sea travelling.\n\nSaw the last of NSW about 6 o’clock am.\n","4":"\n\nDidn’t call at Melbourne, which was a bit of a disappointment.\n\nThe coolies provide plenty of amusement with their habits etc. Washing seems to be a part of their religion, though whether it is to wash, or not to, I don’t know. They wash in about 1 pint of water; first their hands, and then splash their face and run a wet finger round their ears\n\nThen with the water left, which must be highly flavoured as their faces are always well coated with mustard oil which is not exactly sweet, they rinse their mouth and wash their teeth which as usual with niggers are \nsplendidly kept\n perfect. At other times they wash their feet first, and then the hands, usually before meals, to which they all sit in a circle and eat out of one dish with the fingers. \n\nThe Mahommedans say their prayers before dinner which are very lengthy and involve a good deal of kow towing.\n\nto the sun. One old beggar in particular always says them with one eye on the meal and as the others get in for their whack, he gets quicker and quicker almost falling over himself when bowing down to the floor a few times in succession.\n\nThough continually dipping their face, hands & feet into water, I think that is as far as washing goes with them, for the stench from them and their quarters is absolutely unbearable at times, when the wind gets astern. \n\nAt certain intervals all their belongings are brought \n\nout for an airing, and their place is cleaned out. On such days it is almost necessary for half a dozen chaps to do guard near their things and exterminate the insect pests with which they seem to be teeming, to prevent them from coming forward to our decks. How they live I can’t imagine for they must be like bees in a hive.\n","5":"\n\nAre now in the Bight, with good weather continuing. Church parade at 11 am. Parson is about ‘Z’ grade. A rotten preacher, and poor sort of a \n\nchap generally.\n\nSighted small school of whales in the distance, during morning and have been accompanied by a great number of porpoises who are always playing in front of the ship.\n\nSeveral cases of mumps reported.\n","6":"\n\nStill good weather. Only a bit of life boat drill done this morning. Haven’t seen any passing ships as yet and are 400 mls. from land.\n","7":"\n\nCalm in the morning, but wind sprang up about midday and made sea pretty rough. The\n\nwaves washed up pretty high over the bows, and did a fair bit of damage. We all enjoyed watching the waves coming and sweeping over her, and my chum and I got several wettings through going too far forward.\n","8":"\n\nCompany on guard today. I was put on picquet, across the front of the saloon deck and was under the spray the whole time, and though the water was, as usual, wet, and cold too, I enjoyed it thoroughly. As it was a head sea the speed\n\nwas considerably decreased.\n\nWas still able to sleep on deck as we were in the horse boxes and so sheltered. Inside on our deck however the water got in and wash about 2\" deep before they got the drainage pipe clear of socks that had been sucked into it.\n","9":" \n\nWeather good again and Australia again sighted. We were all disappointed at not calling at Fremantle. The last of the land faded away in the late afternoon.\n","10":"\n\nVery little done today and a general feeling of gloom on all. Most of the talk was about home and Australia.\n","11":"\n\nWeather still good, getting a bit warmer. Nigger barber starts work, and most of us get our hair clipped, including officers\n","12":"\n\nHad a concert last night; it was pretty good for an impromptu affair. Church parade again otherwise, only rest, after strenuous week we have(n’t)\n\nhad.\n","13":"\n\nSea still very calm, which is getting pretty monotonous The steadiness of the boat is giving us all the blues.\n","14":"\n\nThe mumps are spreading pretty quickly, and there is a danger of being quarantined at Durban which is our first port of call. All our belongings fumigated and decks disinfected.\n","15":"\n\nWeather still calm, and getting walmer. On picquet again. Saw about 20 flying\n\n fish, which look very pretty in the sun.\n","16":"\n\nExpect to reach Durban in a few days. Sea a bit rough again. The boat is very steady and so there is little sea-sickness\n","17":"\n\nNothing at all done today Sea still a bit rough.\n","18":"\n\nThe sports, which we have been looking forward to for some time, commenced this afternoon. Our men won several heats in the\n\ndifferent events, though we are looking forward to them doing well in the boxing and wrestling.\n","19":"\n\nChurch parade again. Mock funeral of the chaplain afterwards. His preaching is vile, and he has been heard talking about the contents of letters posted. (He was appointed censor). \n\nEverybody hung over the side nearly all the afternoon watching ‘with bated eyes and bulging breath’ (or some other such thing) another ship which kept in sight for a couple of hours.\n","20":"\n\nGot our first war news from Mauritius, which is cheering us up a bit. The British are still doing well. \n\nSaw more flying fish.\n","21":"\n\nThe usual dreary day’s doings, though livened up a bit in the afternoon by some good boxing events, our fellows all doing well.\n","22":"\n\nBoat going along very steadily. Water just like glass though a nasty sort of day.\n","23":"\n\nVery calm, and hot in the morning, though it came up a bit rough about 10 am. Day mostly taken up with writing letters and cleaning of uniforms for we expect to reach Durban tomorrow morning early.\n\nOne chap with us who is always letting his tongue get mixed wrote that the trip had been rather \"monoperlus\" and the rich tucker had given him \"digestion\", though at times there weren’t enough ‘taters in the stoo’ and the \"corfee\n\nworn’t ’ot\" He is very amusing and puts very curious translations on the news in papers and is always asking questions of everybody.\n","24":"\n\nDisappointment for nearly all those who got up early to get the first sight of land. It was not sighted till about 8 o’clock and we were in at the wharf by 11.30 am, where were several ladies with cases of fruit which they threw to us as soon as we were anchored.\n\nThe niggers are very funny\n\nand live on what they get off the boats, particularly troop ships. They scramble after money, food or anything else thrown to them. As we were to go ashore in the afternoon we threw them all the food we had, & they put bread, meat, soap, tins of jam etc all in one pile. \n\nOne would have his mouth full of meat with about 6 inches hanging out and still try to get more. After a scramble it was pretty dirty too as there was about 6\" of coal dust\n\neverywhere. \n\nSeveral chaps threw them hot pennies and when they scrambled for them they’d put the hose down (to cool the penny of course) However the coons took it as a joke. \n\nI threw one into a nigger fruit dealers basket which was all upset in the rush. There were squashed oranges & bananas everywhere and even pineapples, crushed with their bare feet. This provided plenty of amusement though I must admit that it landed there owing to my bad\n\naim. However the others all followed it up and the chap would no sooner fix his basket up when it would be upset again. \n\nHowever we wanted to get ashore and were very glad when at 2.30 pm we were marched into the Town Hall and dismissed. \n\nIt is a fine town and its appearance speaks well for the industry of the white population, though all the work is done by niggers\n\nAll rushed the rickshas and I had a couple of good rides too, paying about 3 times the \n\nusual price, which was as low as we could get it. It was well worth it though, for they dress in all sorts of glad rags especially for soldiers and go through all sorts of fancy antics.\n\nThe Durban people are very good natured and treated us well everywhere We had the free use of the trams and free entry into all public places. Perhaps to my discredit I must admit that I had no less than five afternoon teas at people’s invitation besides several light snacks \n\nThey simply make you take all they offer. Altogether I had a perfect time and am looking forward to going ashore again tomorrow.\n","25":"\n\nAwakened at about 5 am by the noise of the niggers on the wharf singing for pennies. They make a great thing of hissing and stamping their feet too. We threw some water over to shut them up but they became more noisy still. \n\nDuring the morning we were taken for a \n\nmarch around the Bluff and had a look over a large whaling station, which was very interesting. It was also interesting to see the coal loading machinery at work It is very quick and intricate\n\nSpent most of the morning haggling with a nigger over the price of a scarf for which he wanted an outrageous price though I couldn’t beat him down very much. He would keep saying \"Australian plentee monee\" till it got on my\n\nnerves and I was glad to get away from him.\n\nWent ashore again after dinner and went to the Zoo and Gardens which are both very well laid out. Went to tea at the invitation of some gentleman in the tram and passed a very pleasant evening before going back on board.\n","26":"\n\nAll up early, hoping that the loading apparatus would break down and delay the departure but no such thing occurred. \n\nThirty\n\ncrates of dressed poultry were brought on for the officers mess. it made me feel sorry I had refused that commission now. (I refer to the time I was offered one just before I woke up).\n\nThe ladies came down again with more fruit just before we left. By 8 o’clock we were well out at sea again.\n\nThe difference here and Australia regarding the coastline is very marked. It slopes right down to the water with few beaches\n\nand backed by very flat topped mountains.\n","27":" \n\nAnother ship was sighted early, which kept close to us all day. It is very funny to see it seemingly steaming all over the place, for sometimes she is astern and others ahead. It was caused by the zig-zag movement of our ship. \n\nBy dinner time we were out of sight of land and were rolling a good bit which was very inconvenient at meal times.\n","28":"\n\nLand sighted again though only for a while. The speed was decreased today so that she won’t get to Cape Town too early and have to anchor outside the bay all night.\n","29":"\n\nGot outside Table Bay at about 1 am. Very gusty wind blowing which causes some movement (& language) on the part of those sleeping on deck. As mine was slung up I chose to lay there and \n\nshiver, though cursing my self for my laziness for the cold was very uncomfortable.\n\nAll those sleeping on the floor moved, some only to the other side where they got it again as soon as the boat turned, so went inside. At 3 am we were under the glare of about a dozen searchlights for half an hour or so. \n\nAt last dawn came and Table Mtn. looked very pretty with the mist on top. Though it seems to considerably dwarf the town making it look like a \n\ncluster of small cottages. \n\nWe laid up at the wharf before breakfast, where they started loading coal straight away, by the very antique method, with the baskets. \n\nThere was no leave granted, but we were all marched ashore to a park a couple of miles out of the town and locked in. Some ladies turned up and gave us refreshments in the Sunday school picnic style, though the home-made pastry was very nice.\n\nOn\n\naccount of a desire for freedom several jumped the fence and visited the town, most of whom came back in time to catch the boat, but altogether there were thirty missing when we left. As is usual they were those who had kicked over the traces for the first time while all the worst rotters had the luck to get back, being brought in by the picquets. \n\nOne of this lot threw a tin of jam at a sentry on the quay as we left the Bay, \nand stunned him\n knocking him out. Lucky for him he wasn’t\n\nfound out for he would certainly have been dumped over board. It is such a thing that drags Australia’s name in the mud. One such act outweighs 99 good ones.\n","30":"\n\nOut of sight of land again Sea pretty calm but dull weather. For something to fill in time I have taken to helping my chum with his photography which is very interesting. \n\nOne of the chaps made a speech to the troops in general, from \n\nthe saloon deck in praise ? of the parson. We are all sick of him, for it is now well known that he is always talking of the contents of the letters he censors, and is making himself too officious in many things that don’t concern him but as he is an officer we can’t say too much.\n","31":"\n\nSea a bit choppy, weather dull but not cold. Porthole glasses all painted over now and a great number of inside lights cut out.\n","32":"\n\nA bit warmer, though still cloudy. Sports continued in afternoon. As it was boxing & wrestling the parson came around and ordered all the men off the good places on the booms and horse boxes, which though against the rules was allowed on this occasion. I can still feel his look boring me through, which he gave me when I told him so. We are all rather chary of posting letters now, for him to read.\n","33":"\n\nPretty cool all day. Washing day, the third since we started. \n\nAll got hair cut as there had been a case of supposed meningitis on board, at Cape Town. Our \"digestive chap\" said \"’e worn’t goin’ ter ’ave ’is bloomin’ air cut, meling-gitis or no meling-gitis.\" but he had to have it off, just the same. He is very funny at lectures and is always asking questions, when he usually gets a bit anxed. The other day\n\nhe was talking about a ‘King’ Elizabeth, two or three thousand years ago.\n","34":"\n\nNot so cloudy today and a bit warmer. Shooting competition on miniature range, though scores not too good on account of boat’s vibration. Schools of flying fish about all day long. During the afternoon there was a mock trial held on one of the chaps who was accused of \"learning, (or trying to) the\n\nnigger’s language\" which was a most grave offence as two chaps have gone mad through hearing him practice. Also \"trying to evade arrest\". Prisoner who was about 9 stone killed one 14 stone policeman and severely wounded another. However it ended up with a riot in court when one of the witnesses said \"\" when told to swear. \n\nMore lights taken away tonight, and portholes given another coat of paint.\n","35":"\n\nVery hot today. Another shooting competition held.\n\nCouple of chaps knocked out by the heat. Thousands of flying fish about, and several swallows seen.\n","36":"\n\nGetting hotter. nearly all going out with trousers only Worst of all I have to stay inside, on picquet. Flying fish still about. Last night chap had nightmare and gave submarine alarm\n\nAs we pass the Equator sometime today we\n\nare going to start the water dipping. After dinner 5 others and myself finished early and waited outside door, with buckets and hose and caught the others as they came out. \n\nSoon they decided to join in and so all came out in trousers only. As soon as it got a bit tame we went into our troopdeck with the hose and soon everybody and everything was soaked. our O.C. was on the promenade deck shouting out too stop and\n\nfall in for parage but as we had already stationed a couple of men on the boat deck to wait for him, he got several buckets full over him, and when he looked up, he got the hose from underneath\n\nit was very amusing to see both, he, and the adjutant, who was with him trying to look stern just because the other was there, but in the end they couldn’t help laughing at each other\n\nAfter this the water was\n\nturned off, but as one chap very nearly fell overboard for we were bringing it up in buckets, they turned it on again. When our other officer came out and saw us he immediately took his boots off and came down and joined in, to be followed by the O.C. much to the disgust of the stern old Scottish chief engineer\n\nAll of our seargents were then marched out and hosed. After a while things got a bit tame some went for the YMCA man who was\n\na very pretty boy but he had locked himself in his cabin and refused to come out. The parson had done the same but after some gentle persuasion, is the shape of having his door opened by another key, and being dragged out (after allowing him to put pyjamas on) was carried down stairs in triumph and laid flat on the floor and a hose put up the leg of his trousers and one down his back.\n\nThere was also the ships\n\nquartermaster (a seargent in another unit on board) to be done. he refused to come at first but after being talked to through his cabin window for some time knowing he was disliked decided to come quietly thinking he’d get off light.\n\nHe only got tied to two rings on the deck and hosed every ten minutes while his back got a trifle sunburnt in the intervals, and after having his pyjamas ripped off him and thrown over-board a an offering to\n\nNeptune, he was allowed to go.\n\nPerhaps we were a bit cruel, but he deserved all he got, for he had cut us all down in our rations and made a bit of cash on the difference and had also continually run the infantry down for sloveliness of deck etc. It happened that it was one of his lot threw the tin at Cape Town, three of them were the only one’s crimed on the boat, and they came last in the mess-orderly competitions. Perhaps\n\nhe judged us by his own prettiness and tidiness (that is before he got ducked).\n\nAbout 4.30 pm, we knocked off as we couldn’t find any fresh victims, and the skin on our backs was beginning to blister. The sun had been directly over us all the day though we enjoyed ourselves thoroughly.\n","37":"\n\nHot again. Very sore back & shoulders. Sea very calm. Whale, & school of porpoises seen.\n","38":"\n\nRained heavy last night but hot again today. Sea a bit calmer than yesterday\n","39":"\n\nVery hot all day and sea like glass, not a ripple to be seen anywhere. i didn’t think it has ever been so calm in the Harbour, let alone where there is to be seen nothing but water. But there I am wrong for it is teeming with sharks, which all day long were swimming around us and chasing\n\ndolphins and swordfish\n\nThere was fighting going on every where and swordfish jumping all over the place. Our officers had two of the service rifles out with ball ammunition and were taking snapshots at the swordfish, several of which they hit. They blew one sharks fin to atoms. \n\nAs there was smoke on the horizon from some unknown steamer, probably a neutral all portholes were closed and all lights out, at dusk.\n","40":"\n\nHot again. Yesterday I skipped church and was told I’d be paraded this morning, but it happened I made the offence worse by not falling in this morning. I was helping the mess orderlies decorate their tables and so forgot all about parades. However the O.C. let me off as he wanted our men to win again. \n\nWe were told this morning that there was to be 1\/- docked from each pay, for\n\nwear and tear on crockery etc. We had lost nothing but probably the chief steward anticipated the fact that many men would take cutlery etc off for souvenirs.\n","41":"\n\nHottest day we have had so far. Land sighted about 8.30 am and we put into Dakka, in French Senegal about 9.30, having to go in by a very circuitious channel, going around a rock which was almost a miniature of Gibraltar in appearance, also being a fort. \n\nAnother ship which\n\nnot drawing as much water, tried to dash across to get in before us was quickly brought to a halt by a few shots across her bows from the fort. \n\nWe entered the harbour to an anchorage which was close to \"HMS Highflyer\" the boat which sank the \"Wilhelm der Grosse\". \n\nAll day long we had great fun watching the niggers diving for money and trouser buttons too, without knowing it. It is wonderful to watch them\n\nfor they never miss a thing. They are much more intelligent than those at Cape Town & Durban, though not so big or strong though one of them was quite a Hercules, being very tall and big and absolutely the best developed man I have seen. He was the centre of everybody’s admiration. One chap throwing a loaf of bread to him, accidentally hit him. He immediately took a handfull of stones from the bottom of his boat\n\nand threw them back with very accurate aim and great force, as one of them was embedded into the taffrail, and others dented the railings. \n\nThey make their boats themselves, on the dug out principle and are expert at managing them, either with paddles or sails (which is just a big square sheet of calico) going miles out to sea in them\n\nMost of us bought some fish from them on which \n\n we had a splendid feed The two cooks made £15 by cooking them.\n\nAfter dinner they brought our \"submarine antidote\" on board. It looks pretty deadly, and was inspected by nearly all on the boat, the artillery men all displaying their knowledge and absence of it too. It is a 4.7\" gun and fires a shell of 50 lbs. Tomorrow they will fire two shots, to get the sights properly arranged. \n\nNow all lights are out, and the portholes\n\nhave all had three coats of enamel so are pretty opaque. There is just enough light inside to be able to avoid bumping anyone.\n","42":"\n\nCold wind started blowing as soon as we got around C. de. Verde which made the sea very choppy. Two shells were fired before a very big audience and the only thing any of us seemed to notice was that it was not as noisy as was\n\nexpected.\n","43":"\n\nStill cold & windy. Sea a bit rougher. \n\nI was put onto the first armed guard and submarine lookout, which was considered an honour as twelve of us were specially picked, but all appreciation of the honour wore off by the end of the first watch. I only had short trousers and bare legs & feet, and the wind is pretty keen up on the bridge deck. However it was a change from the usual thing, and we were a bit\n\nelated with a sense of our importance, though a bit disappointed when after nearly straining our eyes till they bulged, we saw no sign of submarines. However we’ll be on again, and in the most dangerous part too, opposite Gibraltar & the Mediterranean, and again in the Channel.\n\nA French cruiser \"galloped \" up during the day and had a good look at us and our gun.\n\nIn the afternoon the prizes for the sports were given out, our men carrying off a very fair share. I got 4\/- as part of the prize for the physical drill team. Not much but anything is very welcome when you are penniless.\n","44":"\n\nVery windy again. On guard again. Fair number of ships passing, each of which is covered by our gun, till it has passed out of range. Got dull during\n\nthe forenoon and rained all the afternoon, and came up very rough at night.\n","45":"\n","46":"\n\nAbsolutely a ‘hell of a swell’ on. Submarine alarm given during the morning. Torpedoe seen coming straight for us but missed us by a few yards which shows the advantage of the zig-zag course. Of course when the torpedoe got near us we could see that it was disguised as a swordfish. However\n\nfor a time many of the men felt queer, particularly one of the other unit’s officers who completely lost his head. It is said that it was found under his bed, in his cabin. It is very bad to see an officer so easily upset.\n\nAfter dinner we had got into the Bay of Biscay which kept up to it’s reputation The waves broke all over the ship and over a dozen men were sent off guard seasick. I had to\n\nrelieve one of them. The rolling was very bad and the crests of some waves were right up level with the promenade deck.\n","47":"\n\nLast night a ship’s officer ordered us all in from the horse boxes for when he woke us up (there were three of us) we found that though we were dry as we had our hammocks slung right up at the top, the whole erection was loose and rapidly\n\nfalling to pieces and just after we had moved, a big wave, which luckily they had seen coming washed half of them over board.\n\nInside our deck was awash and crockery etc swishing all over the place, the noise of wash tubs, trays etc being very irritating.\n\nSleep was impossible for one roller turned the hammocks right over and every one of us was up to our knees in water boots and clothes floating\n\neverywhere. However we all managed to raise a laugh at the novelty of it all.\n\nAs it was impossible to cook anything we had beef & buiscuits served out. At 9 am we had boat drill. The rolling still continued, though the choppiness had gone down. We were ordered to keep our life belts on all day and there was a very strict lookout kept. During the morning a ball of hay and some timber was seen\n\ndrifting past.\n","48":"\n\nSea a bit calmer and during the morning we picked our escort up and passed dozens of destroyers on patrol duty. They told us there had been a submarine in the vicinity which was the reason for the anxiety yesterday.\n\nOn guard again, for the last time as we reach England tomorrow morning. \n\nWe were disappointed that land was not seen\n\nbefore dark but at about 7.30 we saw the glare from a lighthouse. Soon after we saw the light, which though just on the horizon (that is the light itself, not the lighthouse which must have been much further off) lighted up the whole ship.\n\nIt was the Lizard light which flashes every four or five seconds. Later on we picked out the Eddystone light which though not as brilliant as the Lizard which is like a searchlight but is a much better light\n\nand flashed every 6 seconds and 30 seconds alternately.\n","49":"\n\nAll along the coast we could see searchlights playing around on the watch for Zeppelins, and others on the sea.\n\nWe entered Plymouth Haven about 2 am the entrance being under the light of over 30 searchlights all focussed across from side to side. At last dawn came and with it a greeting from the \"Clan McGillivray\"\n\nanother troopship just moored off us. It was \"What do you get for breakfast. Stew?\"\n\nSpeaking of stew reminds me that one day a couple of us were speaking to the parson and he said that they didn’t always get stew. Sometimes they had mince. He had no need to be so mincing though for we had seen the poultry brought on at Durban, and the lobsters, oysters, & pork at Cape Town, and as I\n\nwas posted just outside their dining saloon I couldn’t help seeing what they had today for breakfast and dinner (which they had at midday) It seemed a sort of festal dinner, only about 10 courses, and the parson the last to leave. Anyhow I was not jealous; I had a swell feed of bully beef, out of the tin eaten with my fingers and half a dozen of Hardmann’s buiscuits. I pity him, for\n\nhe wouldn’t have been able to digest them. I was sure though that I wouldn’t have either, before I thought of enlisting.\n\nAt 11 o’clock we disembarked on a tender and were taken ashore, all glad to be in England and yet sorry to leave the boat on which we had such an enjoyable trip, greatly helped by the captain & the 4th officer, both of whom were ‘jolly good fellows’ The same ship\n\nwill do me for a return trip but I am not sure yet whether there is a return ticket issued. However it will be time to think of that later on.\n\nWell, we were landed and entrained and off by 2 pm. We had a good train trip through some very pretty country in Devon, Somerset and Dorset, being treated at Exeter to tea, cake & fruit by the Mayoress. \n\nAt about 9.30 we arrived at Wareham in the south, and almost\n\non the coast again. \n\nI must say that on the march through the town, the streets of which are very narrow, I have never seen so many drunken men and to their shame, all Australians, but most of them, on a rest, from the front.\n\nOn arrival at the camp we were told off to a hut which seemed very comfortable though things were anyhow then. Before we had been there five minutes, one of the heroes ? came in and aired all\n\nsorts of information for our benefit, being new chums.\n\nThe first thing was that there was plenty of booze obtainable, but that to get it in the town it was necessary to change your hat for a Tommie’s cap which was pretty hot, but happily not true. What would the Tommies think if they were always pestered for the loan of their cap.\n\nHowever after a few minutes we threw him out, and not gently\n\neither.\n\nHowever we slept pretty soundly, till nearly 8 oclock in the morning which was the best thing we have ever been allowed.\n","50":"\n\nThis morning we were besieged by other Australians in the camp for news of home. We also heard all sorts of things as to our ultimate destination, for this is only a depot camp.\n\nThe most absurd things imaginable are said by the returned heroes ?\n\n \n\nhere, who reel off all sorts of fiction for our benefit and think we take it all in I don’t anyhow. They soon clear off when they find that you are not shouting.\n\nOne thing I have gathered is that the Germans are short of ammunition and are throwing iron foundries and whole munition factories over to our trenches now even putting bombs under their guns and blowing the whole thing across.\n\nAlso that the British\n\nare very hard pressed and are using up every available man. From their talk the only reason I can gather for one man here who has lost both legs one arm, and one eye, being kept in camp is that they’ll send him back to the trenches for a listening post.\n\nIn the evening my chums and I went in and had a look through the town though on account of Zeppelins the streets are very badly lighted. We purchased\n\na guide book however and found that the town is very ancient and has an important history with many antiquities well worth an inspection.\n","51":"\n\nNo drill done yet, which is just as well for the food is rather light, though good.\n\nCouldn’t send a cable home as the wires to London were damaged by the bad weather. \n\nDull and wet today However after dinner my chums &\n\nI set out to do some \"rubbernecking\". We saw several old churches which are very well preserved My chum disbelieved that the mortar could have held for 1100 yrs, but when I introduced him to a bun at a cake shop made by the present inhabitants who are descendants of the Saxons he changed his opinion. I have never yet struck anything so tough.\n\nIt is a very pretty little old town, though the present buildings are mostly of\n\nthe Georgian period as the older places have mostly been destroyed by fire. The old walls show that the Saxons must have put in great work to fortify the town \n\nOn the south side are the meadows, which over 1000 yrs ago were under the sea. We were well pleased with our trip when re returned to camp again to bed.\n","52":"\n\nStill wet and miserable\n\nNo church parade on account of the weather However after dinner it cleared up considerably and we went for another tour of the town. All the flat parts outside the walls were under water and the river Puddle ordarinaly a little stream sometimes with water in it but usually mud only was over a mile wide. The Frome on the other side of the town had widened to nearly 3 miles though not much\n\nin depth. \n\nOn account of the bad weather I didn’t go far and came back to camp for tea, when I had a good feed of bread and strawberry conserve and excellent tea.\n","53":"\n\nWeather still dull, but not too cold. Went for a bit of a march, but more of a tour of inspection of the country. Went to the pictures in the night, and saw a programme which we had all seen in \n\nAustralia over a year ago. Evidently the Australian show owners send their old films over to this country, where the people seem to enjoy them.\n\nThe natives look like ourselves and seem quite friendly disposed, though they still dress in clothes made of furs & skins.\n","54":"\n\nWeather still the same. Went for another march and passed through some pretty old villages and along some nice old\n\nshady lanes, where we had a feed of blackberries as we went along. The hedges contain all sorts of flowering plants:– roses, primroses, daisies, pansies, violets, crocuses, and dozens of others whose names I have forgotten. They must look good in the Spring when they are all in flower. The trees all look fine with their bright autumn tints.\n\nAs we are to start early in the morning for another camp\n\nwe all went to bed early.\n","55":"\n\nStarted out about 9 am for the station where we were entrained for one of the camps on Salisbury Plain. We were taken by a round-about route, and saw a great deal more of the country. The train passed through Southampton where we saw a fine big steamer with four funnels right up close to the station. \n\nThe New Forest looked strange to us as the \n\ntrees are all laid out in rows like an orchard, though closer. At one of the stops we fed some wild ? pheasants with breadcrumbs. \n\nAbout 3.30pm we arrived at Wilton where we got out and were told that we’d have to march 5½ miles and we had the nest part of a hundredweight to carry on our backs besides our kit bags, which however we were allowed to leave.\n\nWilton is another old & interesting town, though\n\nbeing so far from the camp I don’t intend to come in too often as there isn’t time to walk 10 miles after tea and be back by 9.30.\n\nThe country is very pretty around the camp and it will fill in time to look around.\n","56":"\n\nInspected by the Commandant of our camp which is one of 12 all grouped here and known as \"Hurdcott\" who praised us up to the nines though he told us he would be strict; altogether he\n\nseemed a very decent sort of chap.\n\nThere were only about 800 Australians here altogether, the rest of the camps being full of Tommies, who are all a very jolly and decent lot.\n\nThere was no drill done today and the weather wasn’t too good. In the afternoon we were inoculated and had a dental inspection. \n\nOne thing in particular that wants remedying is the shortage of food. We are\n\npractically starved.\n\nOn a hill opposite the camp is a badge worked by some Tommies. It won’t be long before I start on one for us.\n","57":"\n\nWeather still bad, & wet. Slack day again, as all have sore arms. Huts fixed up and made cosy. All have a sort of trestle bed which is very springy and comfortable. There is also a stove in each hut, and electric light.\n\nEverybody feeling shortage of\n\nmoney, for we have to go hungry as we can’t buy anything. I have cadged some dripping & salt from the cooks, and so my chum & I finish our meals with bread & fat. I have a lot to thank him for as be has money and is always buying extras.\n","58":"\n\nAnother slack day. Sun is shining which is very pleasant. Went for a walk and had a look at some very pretty lanes\n\nand gardens, and came across a very pretty little village hidden away in a clump of trees. In the afternoon went for another walk but didn’t see much\n","59":"\n\nSunny again. No church parade as I was on guard. It was rather awkward as we had to stay in camp all day and so \nsaw\n had no chance of going into Wilton.\n","60":"\n\nDull again and cold. Parade in morning but nothing done in the \n\nafternoon. Went to a concert given by the Tommies in the night which was very good as they had a lot of professionals from London with them.\n\nTheir camps look very good as they spend a lot of their spare time in gardening and have made some very ornamental effects with cabbages & turnips, and the green relieves the bareness of the camp a lot.\n","61":"\n\nDull again. Drill all the morning. Route march in the afternoon. Very little occurred out of the ordinary. \n\nIt is hard to find anything to fill in time at night as there is no reading matter at all in camp, except the daily papers. The food is still scarce, though at times we make a decent meal. I forgot to mention that on Sunday we had so little during the day that some others and\n\n myself finished up at night with raw turnips from a field opposite.\n","62":"\n\nDull & miserable again the weather I mean. Not me for yesterday I was put on to a job at the YMCA for a week, and when I got there I found that no such job existed so that I now stop there for the day, instead of on fatigue work. It isn’t bad at all. There is plenty of time for reading etc and I got a \n\ncup of tea & bread & butter at 11 a.m. Nothing much happened today.\n","63":" \n19th\n","64":"\n\nA couple of thousand Victorians arrived here yesterday. \n\nWe were all disappointed as we are not going to get our leave tomorrow. This afternoon we were paid though which means that while some of them have money theyll have beer. Since landing over here I have seen that wet canteens don’t make such a lot of\n\ndifference, though perhaps the drunkeness isn’t seen outside the camp. There certainly is more drunkeness.\n\nSome more new chaps got here from another camp from NSW.\n\nFriday \n20th\n 17th\n\nVery cold and windy. Still working ? at YMCA. I think I must be a sort of secretary. \n\nNo leave till next Friday now.\n\nInoculation again this afternoon, which means stiff arms for about 48 hrs. The stuff\n\nthey do you with this time affects one more than the anti-typhoid. Fifteen chaps in another company fainted this morning. \n\nIt is rotten for me for I have to help to push it in (I mean hold the skin up into a lump so that he can use both hands to work the syringe. I don’t mean help him push) as my skin according to him is like porpoise hide. He said soft skin means a soft heart so mine must be of flint.\n\nAnother couple\n\nof thousand Australians arrived here today so that amongst them all here now must be some I know.\n\nThe Tommies, I believe have all gone to France. The next reinforcements for our battallion go tomorrow, so that I suppose we will be going fairly soon.\n","65":"\n\nSnowed last night; about 2 inches on ground this morning. No drill done and nothing of any importance occurred.\n","66":"\n\nSnowed all day yesterday and last night. About 6 inches everywhere this morning, but nearly 12\" on hill opposite. No church parade.\n\nWent over to hill in afternoon with sheet of galvanised iron, and did some tobogganing. One chap fell over edge of quarry at bottom of hill and broke arm. Had great fun with snowballs on top of hill and then slid down to the bottom on our haunches at a ‘hell’ of a speed. Then\n\nhad a few rides on our ‘sledge’, three on a time. \n\nThe hill is very steep and we started on a course over a hundred yards up. It is a great thrill and every few yards you strike a ridge and rise right up off the ground till you hit the next with a bump. The only disadvantage was the briar hedge at the bottom into which you had to go, as it was impossible to stop for the thing went at over 40 mile an hour.\n\nIn the end\n\nwe started at the top and went too quickly, crashing right through the hedge and landing in a ploughed field, about 5 yards beyond the hedge. That ended our day as we had to come back to camp and wash our overcoats.\n\nAfter us six chaps got onto the one piece of tin, but it went too quickly, and left them coming down in the snow on their own. They were going so quickly, though, that they got into the hedge before the tin.\n\nA rainstorm came up at about 5 pm and washed the snow away, as it was very soft. We are all looking forward to some more.\n\nMonday 20th\n\nOfficially taken over by the O.C. of our own battalion reinforcements The officials didn’t know that we were here before, though for over a fortnight we have made thousands of complaints to them about the absence of food. Now however we are officially recognised as the 5th Refs. 53rd Batt. In the\n\ndays orders, to leave for France on the","67":" having to do 12 weeks training in 9 days, having to drill in about 6\" of very greasy & sticky mud. I can do the ‘Charlie Chaplin Glide’ to perfection now.\n\nIn the afternoon we were inspected by the heads of the Staff, all in their red stripes and gold braid, looking like a flock of Roselles. After standing the rain & sleet, with the wind right on us, for 2 hours 17 mins they turned up and had a look at us, passing the\n\nremark that we were ‘all a very well setup lot with no weeds’ \n\nOn landing in our lines at 5 pm when it was pitch dark we were told to pack our kit any how as we were moving. We had to move into the next camp where at last we are to stay till leaving for France. Several chaps were kept on fatigue work till 1.30 am.\n","68":"\n\nFell in for parade at 8 am drilled till 12.30, a couple of hours each at physical drill, and bayonet fighting.\n\nOur instructor, ‘The Kaiser’ is the best roarer I have ever heard. Even when drilling hard it brings back pleasant memories of the Zoo. \n\nThe methods of bayonet fighting are altogether different over here. In fact the whole training here is different, and the first thing they tell you is to forget what you learnt in Australia. Our roarer referred to me as ‘some horrible animal’ because he caught me doing as I had been taught out there\n\nAt last, I might mention the tucker is decent and there is sufficient.\n","69":"\n\nVery heavy frost, which made the mud more sloppy when the sun came up. It was pretty warm after 9 am.\n\nWe have our special syllabus now and do an hour of each subject every day. The bayonet fighting is the best. The gas helmet practice is rotten. However I suppose they are nescessary evils.\n","70":"\n\nNothing much done; bayonet fighting getting more interesting now, also some bombing practise done. Expect to get leave tomorrow.\n","71":"\n\nTold late last night that our leave was granted. \n\nStarted off at 8 am for train, over 750 men altogether. Long and slow trip up with nothing of any importance on journey. Passed through some pretty country and saw Eton College and the rowing course. \n\nNear\n\nLondon passed through some very slummy districts such as Clapham. Haze and smoke over everything, and dirt and grubbiness everywhere. Large gasometers all along the line.\n\nSaw the Houses of Parliament and Westminster Abbey just before entering Waterloo Stn.\n\nIn London at last and I don’t think it will be so interesting after all as I seem to know too much about it already from reading of it and seeing the pictures Anyhow I expect to have a fair holiday while\n\nhere, though I haven’t a penny in my pocket and it is now to late to go to the bank. I don’t like asking my chum for the loan of some though he has plenty, I suppose on account of my dashed pride which I don’t think will ever leave me, but anyway I’ll have to get 2\/6 off someone to keep me till the morning. \n\nIf there is no money at the bank tomorrow I don’t know what I’ll do but I’ll jog along somehow even if I have to draw pictures on the footpath I am going to stay the four days.\n\n"}}