{"Document Name":{"0":"Diary_0400","1":"Diary_0400","2":"Diary_0400","3":"Diary_0400","4":"Diary_0400","5":"Diary_0400","6":"Diary_0400","7":"Diary_0400","8":"Diary_0400","9":"Diary_0400","10":"Diary_0400","11":"Diary_0400","12":"Diary_0400","13":"Diary_0400","14":"Diary_0400","15":"Diary_0400","16":"Diary_0400","17":"Diary_0400","18":"Diary_0400","19":"Diary_0400","20":"Diary_0400","21":"Diary_0400","22":"Diary_0400","23":"Diary_0400","24":"Diary_0400","25":"Diary_0400","26":"Diary_0400","27":"Diary_0400","28":"Diary_0400","29":"Diary_0400","30":"Diary_0400","31":"Diary_0400","32":"Diary_0400","33":"Diary_0400","34":"Diary_0400","35":"Diary_0400","36":"Diary_0400","37":"Diary_0400","38":"Diary_0400","39":"Diary_0400","40":"Diary_0400","41":"Diary_0400","42":"Diary_0400","43":"Diary_0400","44":"Diary_0400","45":"Diary_0400","46":"Diary_0400","47":"Diary_0400","48":"Diary_0400","49":"Diary_0400","50":"Diary_0400","51":"Diary_0400","52":"Diary_0400","53":"Diary_0400","54":"Diary_0400","55":"Diary_0400","56":"Diary_0400","57":"Diary_0400","58":"Diary_0400","59":"Diary_0400","60":"Diary_0400","61":"Diary_0400","62":"Diary_0400","63":"Diary_0400","64":"Diary_0400","65":"Diary_0400","66":"Diary_0400","67":"Diary_0400","68":"Diary_0400","69":"Diary_0400","70":"Diary_0400","71":"Diary_0400","72":"Diary_0400","73":"Diary_0400","74":"Diary_0400","75":"Diary_0400","76":"Diary_0400","77":"Diary_0400","78":"Diary_0400","79":"Diary_0400","80":"Diary_0400","81":"Diary_0400","82":"Diary_0400","83":"Diary_0400","84":"Diary_0400","85":"Diary_0400","86":"Diary_0400","87":"Diary_0400","88":"Diary_0400","89":"Diary_0400","90":"Diary_0400","91":"Diary_0400","92":"Diary_0400","93":"Diary_0400","94":"Diary_0400","95":"Diary_0400","96":"Diary_0400","97":"Diary_0400","98":"Diary_0400","99":"Diary_0400","100":"Diary_0400","101":"Diary_0400","102":"Diary_0400","103":"Diary_0400","104":"Diary_0400","105":"Diary_0400","106":"Diary_0400","107":"Diary_0400","108":"Diary_0400","109":"Diary_0400","110":"Diary_0400","111":"Diary_0400","112":"Diary_0400","113":"Diary_0400","114":"Diary_0400","115":"Diary_0400","116":"Diary_0400","117":"Diary_0400","118":"Diary_0400","119":"Diary_0400","120":"Diary_0400","121":"Diary_0400","122":"Diary_0400","123":"Diary_0400","124":"Diary_0400","125":"Diary_0400","126":"Diary_0400","127":"Diary_0400","128":"Diary_0400","129":"Diary_0400","130":"Diary_0400","131":"Diary_0400","132":"Diary_0400","133":"Diary_0400","134":"Diary_0400","135":"Diary_0400","136":"Diary_0400","137":"Diary_0400","138":"Diary_0400","139":"Diary_0400","140":"Diary_0400","141":"Diary_0400","142":"Diary_0400","143":"Diary_0400","144":"Diary_0400","145":"Diary_0400","146":"Diary_0400","147":"Diary_0400","148":"Diary_0400","149":"Diary_0400","150":"Diary_0400","151":"Diary_0400","152":"Diary_0400","153":"Diary_0400","154":"Diary_0400","155":"Diary_0400","156":"Diary_0400","157":"Diary_0400","158":"Diary_0400","159":"Diary_0400","160":"Diary_0400","161":"Diary_0400","162":"Diary_0400","163":"Diary_0400","164":"Diary_0400","165":"Diary_0400","166":"Diary_0400","167":"Diary_0400","168":"Diary_0400","169":"Diary_0400","170":"Diary_0400","171":"Diary_0400","172":"Diary_0400","173":"Diary_0400","174":"Diary_0400","175":"Diary_0400","176":"Diary_0400","177":"Diary_0400","178":"Diary_0400","179":"Diary_0400","180":"Diary_0400","181":"Diary_0400","182":"Diary_0400","183":"Diary_0400","184":"Diary_0400","185":"Diary_0400","186":"Diary_0400","187":"Diary_0400","188":"Diary_0400","189":"Diary_0400","190":"Diary_0400","191":"Diary_0400","192":"Diary_0400","193":"Diary_0400","194":"Diary_0400","195":"Diary_0400","196":"Diary_0400","197":"Diary_0400","198":"Diary_0400","199":"Diary_0400","200":"Diary_0400","201":"Diary_0400","202":"Diary_0400"},"Date":{"0":"unknown","1":1777.0,"2":1778.0,"3":1779.0,"4":1780.0,"5":1781.0,"6":1782.0,"7":1783.0,"8":1784.0,"9":1785.0,"10":1786.0,"11":1787.0,"12":1788.0,"13":1789.0,"14":1790.0,"15":1791.0,"16":1792.0,"17":1793.0,"18":1794.0,"19":1795.0,"20":1796.0,"21":1797.0,"22":1798.0,"23":1799.0,"24":1800.0,"25":1801.0,"26":1802.0,"27":1803.0,"28":1804.0,"29":1805.0,"30":1806.0,"31":1807.0,"32":1808.0,"33":1809.0,"34":1810.0,"35":1811.0,"36":1812.0,"37":1813.0,"38":1814.0,"39":1815.0,"40":1816.0,"41":1817.0,"42":1818.0,"43":1819.0,"44":1820.0,"45":1821.0,"46":1822.0,"47":1823.0,"48":1824.0,"49":1825.0,"50":1826.0,"51":1827.0,"52":1828.0,"53":1829.0,"54":1831.0,"55":1832.0,"56":1833.0,"57":1834.0,"58":1835.0,"59":1836.0,"60":1837.0,"61":1838.0,"62":1839.0,"63":1840.0,"64":1841.0,"65":1842.0,"66":1843.0,"67":1844.0,"68":1845.0,"69":1846.0,"70":1847.0,"71":1848.0,"72":1849.0,"73":1850.0,"74":1851.0,"75":1852.0,"76":1853.0,"77":1854.0,"78":1855.0,"79":1856.0,"80":1857.0,"81":1858.0,"82":1859.0,"83":1860.0,"84":1861.0,"85":1862.0,"86":1863.0,"87":1864.0,"88":1865.0,"89":1866.0,"90":1867.0,"91":1868.0,"92":1869.0,"93":1870.0,"94":1871.0,"95":1872.0,"96":1873.0,"97":1874.0,"98":1875.0,"99":1876.0,"100":1877.0,"101":1878.0,"102":1879.0,"103":1880.0,"104":1881.0,"105":1882.0,"106":1883.0,"107":1884.0,"108":1885.0,"109":1886.0,"110":1887.0,"111":1888.0,"112":1889.0,"113":1890.0,"114":1891.0,"115":1892.0,"116":1893.0,"117":1894.0,"118":1895.0,"119":1896.0,"120":1897.0,"121":1898.0,"122":1899.0,"123":1900.0,"124":1901.0,"125":1902.0,"126":1903.0,"127":1904.0,"128":1905.0,"129":1906.0,"130":1907.0,"131":1908.0,"132":1909.0,"133":1910.0,"134":1911.0,"135":1912.0,"136":1913.0,"137":1914.0,"138":1915.0,"139":1916.0,"140":1917.0,"141":1918.0,"142":1919.0,"143":1922.0,"144":1923.0,"145":1924.0,"146":1925.0,"147":1926.0,"148":1927.0,"149":1928.0,"150":1929.0,"151":1930.0,"152":1931.0,"153":1932.0,"154":1933.0,"155":1934.0,"156":1935.0,"157":1936.0,"158":1937.0,"159":1938.0,"160":1939.0,"161":1940.0,"162":1941.0,"163":1942.0,"164":1943.0,"165":1944.0,"166":1945.0,"167":1946.0,"168":1947.0,"169":1948.0,"170":1949.0,"171":1950.0,"172":1951.0,"173":1952.0,"174":1953.0,"175":1954.0,"176":1955.0,"177":1956.0,"178":1957.0,"179":1958.0,"180":1959.0,"181":1960.0,"182":1961.0,"183":1962.0,"184":1963.0,"185":1964.0,"186":1965.0,"187":1966.0,"188":1967.0,"189":1968.0,"190":1969.0,"191":1970.0,"192":1971.0,"193":1972.0,"194":1973.0,"195":1974.0,"196":1975.0,"197":1976.0,"198":1977.0,"199":1978.0,"200":1979.0,"201":1980.0,"202":1981.0},"Entry":{"0":"\n\n","1":"\n\nUp 7.15 am. Caught train leaving Kendal 9.5 am for Barrow. Travelled via Oxenholme, Heversham, Sandside, Arnside, Grange, Kentside, Cark & Cartmel, Ulverstone, Lindal, Dalton, Furness Abbey, Roose & arrived Barrow 11 am. Walked down street to Town Hall & there got in a tram & who should I meet in it but Auntie who had been down shopping. Then explained to her how I did not arrive last night. After dinner went for walk with her to Scale village, where there are several very ancient houses, & then down to the beach on outside of Walney Island – then back home. Then went & had a shave, bought p\/cards of Barrow & wired an appointment to Uncle Charlie. After tea went down into Barrow with Uncle Fred\n\n& bought some chocolates for Auntie. Then had a good old yarn and saw the old family photos, then went to bed at 10.30 pm. Bought p\/cards of Kendal before leaving there this morning. Nice beautiful fine day. Uncle Fred told me a little about different classes of submarines constructed here.\n","2":"\n\nJust 2 years today since I went into camp & one year since went into action. Up 7 am & after breakfast Auntie walked down almost to station with me on her way to the market. Got on train for Carnforth & left 8.40 am. Travelled via Dalton, Ulverstone, Grange, Arnside, Sherdale and Carnforth; thence by Midland line to London via Borwich, Ashholme, Melling, Wennington, Bentham, Clapham, Gigglesinch, Settle Jct, Long Preston, Hellifield, Bellbush, Gargrave, Shipton, Cononley, Kildwick, Steeton, Keighley, Bingley, Saltaire, Shipley, Thackeley Jct, Apperly Bge, Rawdon, Calverley, Kirkstall (here saw the old abbey ruins), Armley, Holbeck & Leeds. Left Leeds on main London line at 12.50 pm and travelled via Woodlesford, Methley, Altford, Normanton, Sandal, Royston, Cudworth, Darfield, Wath, Rotherham, Sheffield, Heeley, Millhouses, Beauchief, Dore and Totley, Unstone, Sheepbridge, Chesterfield, Claycross, Doe Hill, Alfreton, Pye Bridge, Langley Mills, Ilkeston Jct, Trowell Jct, Radford, Nottingham, Widmerpool, Upper Broughton, Melton Mowbray, Saxly, Oakham, Menton, Weldon, Kettering, Wellingborough, Irchester, Flintwick, Harlington, St Albans, arriving St Pancras 6.30 pm. Then went to 50 Bloomsberry and got bed and breakfast for 4\/-. Then went down Oxford Street and had a shave then had fish and chips & off to bed about 10 pm.\n\nJust as I arrived at St Pancras a train load of British prisoners arrived from Germany & they received a great reception. Some Sheffield gentlemen travelled with me from Leeds to Sheffield & they were explaining all about the Sheffield works to me. For miles it is all munition factories in that district. In Sheffield saw where Zeppelins had dropped bombs. Midland railway carriages are very comfortable – I think about the best over here. Nice fine day. When going down to station at Barrow, saw the cruiser Amethyst in dock for repairs. \n","3":"\n\nUp 7.30 am. After breakfast went down Charing Cross Rd to Trafalgar Sq & met Uncle Charlie at 10 am. Went with him to Poplar where he works, going along the Strand, Fleet St, Cornhill, & Commercial Rd, passing en route Petticoat Lane. While he was doing some work I went along High St & Preston Rd Poplar to near the East India Docks to Millwall Station & had look around. Also saw the Blackwall tunnel. After having cup of tea & sandwich each, left works at 2 pm & went along East India Dock Rd to near Mile End Rd & got a tram to Aldgate. There took Tube & went via Charing Cross, Victoria, Sloan Sq, Earls Court to Richmond. Went & saw Thames River & then up Richmond Hill to Star & Garter from which there is a fine view. Then went to 8 Wellington Place, Richmond,\n\n& saw Aunt Lucy Scott, Henry Scotts mother and Grandma’s sister. She was very pleased to see us & gave us some tea. As soon as she saw me she said \"Is this George’s boy?” Charlie Scott only left her yesterday in order to join YMCA & go to France – both his sons have been killed. Auntie told me she went & saw Father off from Waterloo Stn when he went to the Colonies via Southampton. She was the last English relation to see him. After leaving her at 5.30 pm we took L & SWR electric train to Waterloo via Putney, Clapham Jct & Vauxhall; then went over Waterloo Bge & down the Strand to a French restaurant where we had a good tea – Uncle Charlie doing the aimable. Left there 7.45 pm & walked past Strand, Trafalgar Sq, Piccadilly Circus, Regent St, Oxford Circus, Oxford St, Kingsway & Aldwych back to the Strand where we had supper at Lyons Cafe. After supper left Uncle at St Martin’s church & went home to bed, going home along Charing Cross Rd. Am going to ring him up on Tuesday to make an appointment with him for that evening some time. Aunt Lucy told us she was now 82 & has lived in that one house 58 years. Saw Red Lim Street where Grandma & all the sisters were born. I gave her \n\nSome sweets I had in my pocket & she was exceedingly pleased, she having a sweet tooth like all the Roddas. She is a real Cockney & uses a little slang in her talk. I promised to see her again if ever I got to London once more.\n","4":"\n\nUp at 7.30 am. After breakfast and shave went down Oxford St to Holborn & sent away p\/cards of Barrow & Kendal & new book of London to Mother. Then went to Gamages & bought razor strop & a hone. Brought them back to lodging then went down Shaftesbury Avenue & bought chocolates for Ida and Auntie in Barrow. Then went via Leicester Square & Trafalgar Sq to the Strand to a cafe near Charing Cross Stn & had a good dinner of grilled steak & potatoes & cabbage. After dinner went along the Strand to Australia House to see the building. It is a good building really going to waste to my idea.\n\nThen came back to Trafalgar Square & got No 15 Bus to Paddington via Piccadilly, Regent St, Oxford St, Edgware Rd & Praed St. Had look round Paddington Stn then took bus to Victoria Stn via Praed St, Edgware Rd, Marble Arch, Park Lane & Grosvenor Place to Victoria St. After seeing station there walked to Horseferry Rd enquired about the morning sick parade, then walked along Victoria St & Whitehall to Trafalgar Sq & the Strand.\n\nWent to Canadian YMCA, Beaver Hut, in Strand for tea & then went home via Charing Cross Rd as not feeling at all well. Had diarrhoea all day & developed a Pile which bled a good deal. Rained lightly all afternoon.\n","5":"\n\nUp 7.45. After breakfast took bus to Horseferry Rd & reported sick. Told the Dr about diarrhoea etc also about the heart. He was very interested about heart, so marked me for No 1 Australian hospital at Harefield for a Board. Left Horseferry Rd & took bus to Trafalgar Sq. Left pack at YMCA enquiry room in the Square then sent telegram to Uncle Charlie & had a shave. After getting pack took No 1 bus to Marylebone (GCR Stn). Went via Charing Cross Rd, Tottenham Ct Road, Euston Rd & Marylebone Rd & en route passed Madame Tussauds. Train left at 12.55 pm & arrived at Denham Stn about 1.30 pm. Then went in Red Cross Ambulances to the Hospital, about 3 miles away. Was put in 37 ward, a surgical ward. Nearly fainted after I arrived. Had good tea of Scrambled Egg, Fried Vegetables and Blanc Mang & Jam. After tea went to pictures getting back to ward about 8 pm. Fairly cold.\n","6":"\n\nUp 7.30 am. Saw doctor after breakfast – Pile nothing serious. In afternoon wrote to Uncles Charlie & Fred also Ida. \n\nAfter tea went to pictures. Very cold today. Good meals so far.\n","7":"\n\nUp 7.30 am. Had game chess during morning. During afternoon wrote to Aunt Sara, Mr Randell & M.S. Cohen. Nice fine sunshine. On Monday last saw 30 or 40 one-legged Australians going along the Strand to a picture show. All seemed very happy.\n\nThere is a chap in this ward who was only 2 yards from Reg when he was killed. He was sniped through head about 6.30 am, Sept 26th 1917. Next day a burial party was sent out to bury him & others, but they could not find his body – only his identity disc. Name of chap who saw him is Sawyer from Drummoyne, Sydney. He was in Reg’s platoon. They hopped over 5.57 am that morning. Reg was killed instantaneously. They presumed that a shell lobbed right on to him & blew him to pieces. Very cold tonight. There is also a chap named Gillies in ward with both legs off at thighs. He was in 17th btn & was originally city and suburban traveller for W Gardener’s of York St Sydney. He also was a country traveller in Victoria for Sargoods. He seems very happy.\n","8":"\n\nA new doctor started in ward this morning. After dinner, started a long letter home & finished 13 pages then knocked off till tomorrow. After tea went to pictures. Very cold & foggy all day.\n","9":"\n\nNice fine day & not so cold. Finished letter home.\n\nIt ran into 18½ pages. XX\n\nAfter tea went to a concert.\n","10":"\n\nRecd letter from Ida tanking me for chocolates etc. Wrote to Mr Nancarrow about Reg. Discovered that Sgt Smith, two beds from me is in same battery as Sid Eyles & is very chummy with Sid. He is writing Sid to come out & see us – Sid being at an OTC at St Johns Woods. Put on bottle stout every day.\n","11":"\n\nRecd letter from Uncle Fred.\n","12":"\n\nSent folding picture letter cards of Harefield Hospital to Australia. During afternoon walked down to Harefield. After tea went to pictures.\n","13":"\n\nDuring afternoon went for walk for about 1½ miles right through Harefield. Noticed by finger posts we are only 10 miles from Windsor. After tea went to lecture on Westminster Abbey, which was very interesting.\n","14":"\n\nAfter tea went to concert by A.I.F. party from Southall.\n","15":"\n\nRecd letter from Cohen, written on board transport D24 for Australia. After tea went to a concert but it was very poor, given by R.A.F. party.\n","16":"\n\nWalked to Rickmansworth after dinner – about 2 miles. A canal goes through town & saw 2 barges being lowered in the lock. After tea went to a Comedy-Drama.\n","17":"\n\nWalked along Pinner Road during afternoon & found plenty of blackberries. After arriving back met chap named Eggins in hospital who was in 62nd and 35th btns with me. He was\n\nwounded at Morlancourt. His father was a storekeeper at Tumut, & dealt with P B & Co. He himself had a Mercery business at Casino.\n","18":"\n\nRecd parcel from Muriel posted 9\/7\/18 contg. Sweets & Sugar. Marked by Col. Yeatman for Weymouth & Board. Sent photos of Ward 37 to Australia. After dinner walked along Northwood Road – it is very pretty. In one place the wood was all a copper colour with the autumn leaves. The ground was all covered so that everything was a coppery hue. Went to pictures after tea. Rather warm day but overcast & heavy looking.\n","19":"\n\nDuring morning the Dr took particulars for my Board. I went out at ¼ to 2 in afternoon & at ¼ past 2 they came for me for my Board, so will probably have it tomorrow.\n\nIn afternoon walked along Pinner Road for couple miles & had fine feed of Blackberries. After tea went to pictures.\n","20":"\n\nOn Board at 2 pm but have not had result yet. Then walked couple miles down Northwood Rd past the Mount Vernon home for consumptives. After tea went to lecture on the Bolsheviks in Russia by a New Zealander who resided there. When came back from lecture told going to Weymouth tomorrow. \n","21":"\n\nUp 6.45 am. Recd letter from Uncle Charlie. Reported at Hospital Office 9.15 am & left per motor at 9.40 am\n\n \n\nfor Denham Stn. Caught train leaving at 10.30 & travelled to Paddington via Ruislip, Northolt Jnt & Westbourne Park. Left Paddington again for Weymouth at 12.15 pm passing through Westbourne Park, Acton, Ealing Broadway, Hanwell, Southall, Hayes, West Drayton, Slough, Taplow, Maidenhead, Twyford, Reading, Theale, Midgam, Thatcham, Newbury, Hungerford, Savenake, Pewsey, Edington, Westbury, Frome, Witham, Bruton, Castle Cary, Sparkford, Marston Magna, Yeovil, Yetminster, Evershot, Maiden Newton, Grimstone, Dorchester, Upwey & Weymouth, arriving at 5 pm. Went to Motor Ambulances & each given a cup of coffee then taken to the No 2 Command Depot. After having tea of sausage meat & vegetable went & looked at Canteen, Salvation Army Hut & YMCA. Came back to Hut at 8 pm. On way down in train saw Horlicks Malted Milk factory at Slough, Huntley & Palmers big biscuit factory at Reading & at Newbury saw dozens of new \"Tanks”, also large dumps of new shells. Raining in afternoon. Camp we are in is Westham Camp, No 2 Aust. Command Depot. It is about ¾ miles from Weymouth Stn.\n","22":"\n\nUp 7.15 am & had very good breakfast of Porridge & Smoked Herrings. After a good dinner, having previously been classified by a Dr, was sent to Monte Video Camp per Motor, about 1 mile from Westham Camp. When arrived there sent to No 4 Company. Camp is on slope of a hill overlooking the English Channel. After tea went to canteen for short\n\ntime. Wrote to Ida, Dick Luscombe, & Uncle Charlie. Very windy & raining.\n","23":"\n\nUp 7.30 am & had a good tasty stew for breakfast. Wrote to Base Post Office, Uncle Fred & home. XX After dinner walked into Weymouth, about 2 miles walk. Went down the 2 main streets, & saw some naval motor launches - \nI think they were for mine-laying\n - at the end of the street in the river. Bought picture p\/cards of the place & also sent a book of views to Mother. Also went on to the pier & saw the Channel Islands steamer. Had some tea at the Australian YMCA & then left for the camp before it got too dark, arriving back at 6 pm. On the way back passed Capt Barton from our C.C.S. but did not speak to him. When in Weymouth this afternoon saw chap named Clark who was our company orderly room corporal in 35th Btn. He is now a Lieut. Very heavy gale last night & this morning.\n","24":"\n\nWind has now completely dropped. Sent p\/cards of Weymouth to Australia & to Ida. After dinner walked about 2 miles along road to Abbotsbury & Bridport, passing through village of Chickerell. Also had plenty of Blackberries. Had fine view of the coast from one of the hills. Saw a \"Blimp” airship flying along the coast. Was a beautiful afternoon of sunshine. Passed Capt D Barton again today but had no chance of speaking to him.\n","25":"\n\nVery wet windy miserable day. Could not go out anywhere.\n","26":"\n\nNice fine sunshine but fairly chilly wind blowing. Mess Orderly today.\n","27":"\n\nNice fine sunshine day. Recd p\/card from Ivie, letter from Uncle Jim dated 9\/8\/18, 1 from Ma dated 11\/8\/18, & one from Muriel dated","28":" Also a parcel from Muriel containing Biscuits posted 9\/7\/18. Completed my hut from Quartermasters this morning. After tea went for walk with a 37th Btn Lance Cpl. We went to YMCA near Westham Camp – having coffee & cake & then game of draughts. Then went to YMCA in Westham Camp & there met chap from 31st Btn who I met at Boulogne Base Details Camp last Jany. Had yarn with him then came back home.\n\n7\/11\/18\n\nWrote to Uncle Jim. Recd letter from Ma dated Apr 7th, also short one from Cohen in answer to my wire to him early in October. Was a beautiful clear day of sunshine, just like a Bourke winter day. After tea went to Westham Camp YMCA & saw some \"Sydney Mails”. \n","29":"\n\nWet first thing this morning but cleared up & turned out nice fine day with a chilly breeze. In afternoon walked to Chickerell village, also had some blackberries. At 5 p.m. on another medical board and marked \"Permanently Unfit for General Service – Temporarily Unfit for Home Service”. Maudsley was on the board. Had talk with Capt. Barton after dinner.\n","30":"\n\nAfter dinner went into Weymouth. When walking along Promenade Syd Dury, who worked at P B & Co with me, stuck me up, & we had a yarn. He is in the Motor Transport &\n\nhas been over 2 yrs 9 months. \n\nWas nice fine sunshine day, but had shower rain after tea. Was marked C2 on Board on Friday.\n","31":"\n\nWrote Home XX & to Watty Last. Sent before Dr. this morning & he marked me to work in a ward in the hospital here. Saw the Sergt in medical office after, so he is putting me on clerical work in the office. Fairly cold & windy.\n","32":"\n\nStarted in medical office this morning on \"records” work. After tea went into Weymouth. The town is all decorated with flags on account of the \"Armistice” but not much excitement. A few kids were making bit of a row. Showery all day.\n","33":"\n\nHanded in application for leave to return to Australia via America.\n","34":"\n\nAfter tea walked into Weymouth. Free beer was issued to the troops at lunch time. Fine sunshine.\n","35":"\n\nList came out for transport D 35 today & see that I am on it on \"Ships staff”. Recd letters from Muriel dated 1\/9\/18 & 15\/9\/18 & one from Mrs Brown dated 15\/9\/18, also p\/card from Minnie Lusc. Still nice & fine but chilly breeze blowing. After tea went into Weymouth & cabled to Australia thus \"Mail nothing. Returning. Well”.\n","36":"\n\nWrote to Muriel XX and to Mrs Brown. Handed in pay book to be exchanged for a pay card.\n","37":"\n\nAfter tea went into Weymouth.\n","38":"\n\nIn afternoon walked to Portland with Perry from the Medical Office, passing through Wyke\n\nRegis. Had some afternoon tea in there, then caught 4.30 pm train to Melcombe Regis Stn, Weymouth. Went to YMCA on the promenade & sat in front of fire for time then walked back to camp, arriving about 6.30 pm. Very Cold. On way to Portland saw a torpedo factory of Whiteheads, & on way back to Weymouth saw old ruins of a castle or residence of Henry 8th. At Portland also saw over a dozen large tanks, like gasometers, containing oil fuel for the Navy.\n","39":"\n\nRecd letter from Uncle Charlie.\n","40":"\n\nRecd letter from Dick Lusc, also 2 parcels from Muriel, 1 containing 1 pr Sox, Housewife , and 2 bxs Old Gold Chocolate, & other contg Cake, Fruit, Sweets, Sugar, T.Paste, Soap, Coffee & Chocolate. Not so cold.\n","41":"\n\nAfter tea strolled into Weymouth.\n","42":"\n\nChanged some of my French money at YMCA tonight.\n","43":"\n\nAfter tea went to pictures in YMCA at Westham Camp. A Charlie Chaplin picture was shown. Beautiful sunshine day, not nearly so cold.\n","44":"\n\nWrote to Uncle Charlie. Put in application to be deleted from D 35 list. After tea went into Weymouth.\n","45":"\n\nWas paraded to camp commandant re deletion from roll of D35 – he is recommending same. Put in another application to return via America at own expense, as last application was lost in Orderly Room. Raining this evening. Wrote home XX\n","46":"\n\nNot nearly so cold. After tea went to Westham YMCA.\n","47":"\n\nAfter tea saw a conjuring show at Westham YMCA. Raining today.\n","48":"\n\nWrote to C’Wealth Bank re withdrawing money if I had it cabled to them. After tea went to YMCA in house near Westham. Saw that Geo Hobson arrived by the Bakara few days ago, and was posted to Fovant Camp for training. Received my boat pay card last Monday. Fine day.\n","49":"\n\nNotified that my application for deletion from D35 was pending till we know if I have permission to return via America. A notification also came through to S.M.O. to see if I was fit to travel if application for America was granted. Not so cold.\n","50":"\n\nRecd Xmas parcel from Mrs N. cntg Meat Paste, Jam, Sugar, Sox, Laces & Soap. Also recd letter from C’Wealth Bank acknowledging mine of","51":" inst – but no definite answer. Also saw Major C.N. Smith re being fit to travel via America.\n","52":"\n\nRecd letter from Uncle Fred also Xmas parcel from Mother contg Xmas Pudding & Cake, Fruit, Sweets, Cream & Oxo. After tea went into Weymouth.\n","53":"\n\nWet & foggy sort of rain. XX Wrote to Mrs Nancarrow, Dick Luscombe home. Eyes slightly sore today.\n","54":"\n\nRecd letter from C’Wealth Bank re a\/c. Say money will be available if I cable for it. After tea went to Westham. Very thick fog came over during afternoon.\n","55":"\n\nWrote to Capt Barton, Transport Officer at H’Ferry Road re fares to Australia via America. Misty Rain.\n","56":"\n\nRecd letter from Ida also 1 from Mother, 1 from Muriel, 1 from Aunt Sara also a Xmas card\n\nfrom her. Warned during afternoon to go to Horseferry Rd, London, tomorrow, reporting at B.O.R. 7.30 am, with full kit. Wrote to Base Post Office, Uncle Charlie, Cohen, & Aunt Sara. During afternoon drew pr new Breeches & new Tunic. Took tunic out to be altered, having sleeves shortened.\n","57":"\n\nUp 6.15 am. Got papers & rail warrant at B.O.R. at 7.30 am then set off for Weymouth Stn. Walked about 1 mile with my load then got lift to bridge in a milk-cart. Caught train leaving 9.3am for Waterloo & travelled via Dorchester, Wool, Wareham, Harnworthy Jct, Poole, Parkston, Bournemouth Central, Boscombe, Christchurch, Sway, Brockenhurst, Redbridge, Southampton West, St Denys, Swaythling, Eastleigh, Winchester, Basingstoke Hook, Woking, Fleet, Farnborough, & Clapham Jct arriving Waterloo 1.30 pm. Then took 76 bus to Horseferry Rd via York Rd, Westminster Rd & Bridge & Victoria St. When going over Westminster Bge saw the German submarine lying in Thames opposite Parliament House. Also had a fine view of Parliament Buildings from the Bge. Went to various offices at H’Ferry Rd re my trip & have to report again 10 am tomorrow. When finished there took Kit Bag to Cloak Room at War Chest Club, then got bus to Strand. Went to Oceanic Steamship Coy offices in Trafalgar Sq & received fare quotations for trip. Then walked to YMCA near Australia House & had tea & a shave.\n\nOn way to YMCA called in at Canadian Beaver Hut & booked a bed for 6d. at 101 Belgrave Rd near Victoria Stn. Had hot bath at YMCA, then went to Trafalgar Sq to meet Uncle Charlie at Nelsons Monument, but he did not turn up on a\/c of not receiving my letter. I then went to Clapham Common per tube & was with him for about an hour. Came back by tram, going first of all to Stockwell - thence changing to a Victoria tram, & arrived about 11 p.m, then up to 99 Belgrave Rd to bed.\n","58":"\n\nUp 8 a.m. then went to War Chest Club for breakfast. Then booked bed there & reported at Room 15 at 10 am, but papers were not ready. While waiting drew kit bag from cloak room & went to Q M’s & changed my new riding breeches for a smaller pair. Went back to Room 15 at 11 a.m. & received my papers etc containing permission & authority to return home via America; also detailed instructions of what I had to do etc etc to fix up at Horseferry Rd. First of all went to Room 27 & received a travelling certificate, then to O.C. Furlough dept & got his signature on certificate. Then to Pay Office in Royal Horticultural Building & took about 2 hours to fix up there, during which time had to go back to H’Ferry Rd twice & go to top floor each time in order to get certain details. \n\nAll this was on a\/c of not having my proper pay book, as cannot draw money on the Returnee\n\n Pay Cards, one of which I hold. Then had real good dinner at War Chest of Soup, Roast Beef & Vegetables, & Jam Roll, for 1\/- only. Then went to Cash dept of Pay Office to draw money, but nothing doing as they have received strict instructions not to pay on a pay card – therefore they have wired to Weymouth for my Pay Book & it will probably be here on Tuesday. Then went to Passport Office in Victoria St - got application form for passport, then had 6 passport photos taken for 7\/6, having to call for them on Monday morning. Then saw Lieut Cocks, the O.C. Cash dept - he was very nice but could do nothing till pay book comes along. Then took bus to Strand & cabled home for money thus - \"\ncode\n Cable fifty C’Wealth Bank, London, Returning America” at defferred rate 1\/6 word as chap reckoned it would go almost as quickly as 3\/- rate. Then went down Strand to Aldwych YMCA & there met Bert Carroll who was in P B & Cos Haby dept. Had yarn for about ½ hour then I went to Aust. YMCA near Australia House & had tea. Then went along Strand; Trafalgar Sq, Leicester Sq & about the West End having look around & finished up at Baker St, where I took Tube for Victoria & then to War Chest Club to bed. During afternoon saw photo in Sydney mail of Buckler who was at Bourke.\n\nHe is now a Lieut & has the \"M.C.” \n","59":"\n\nWrote Home. XX also to Ida & Uncle Fred. Up at 8.30 am & after breakfast wrote above letters. Then walked to Victoria Stn & had a shave then took tram to Clapham Common & went to 43 Klea Avenue. Stopped there talking till 3.30 pm then went out with Uncle. We went across the common & down to business part of Clapham Jct where I saw Arding & Hobbs drapery business. Took tram there & went to Chelsea, crossing Thames by Victoria Bge. Then walked to Sloane Sq & along Sloan St to Knightsbridge, then along Knightsbridge Rd, & Piccadilly to one of Lyons restaurants in the latter. On way passed numbers of Clubs, also the residence of Duke of Devonshire. After tea went further along Piccadilly, past Leicester Square to a picture show in Charing Cross Rd near the Alhambra. When pictures finished went down Strand to YMCA near Australia House & got my papers etc. Then went along Strand, past Covent Garden markets, Bow St & Aldwych back to Strand seeing on the way Covent Garden & Drury Lane Theatres, also the Bow St Police Courts. We then went to Trafalgar Sq where Uncle left me to go home by tram & I got a Victoria bus & had supper at YM at Victoria Stn, then down to War Chest to go to\n\nbed. Went in to my bed & found that chap in next bed was drunk & had been sick all over the place so changed the bed for one in another dormitory. \n\nWhen at Klea Avenue Uncle arranged for me to stop there till I sail so going out with my hut tomorrow evening. Having bed & breakfast only there.\n","60":"\n\nUp 8.15 am. After breakfast went to Bill’s Section - Room 85 & received the warrant for £23 allowance towards my fare. Then took bus to Charing Cross & went to Oceanic Coy & arranged about the trip & handed in warrant as a deposit. Expect to go about 3 weeks hence. Then went to Australia House & saw number of war trophies captured from the Germans by Aussies. Then went to C’Wealth Savings Bank in Australia House & advised them that I had cabled for money to be sent to them. Then came back to Stratton Ground & got my passport photos. Went & saw Lieut Spedding in \"B” Records & he countersigned the passport application, also the photo, & then I took them back to Passport Office, having to go back there again tomorrow. Went & had good dinner at War Chest then for 1\/- - Soup, Roast Beef, Cabbage & Spuds, & Apple Tart. Then wrote to Sgt Saxton at Monte Video giving him the dinkum oil about what has to be gone through\n\nto fix up the trip. Then went for stroll to Westminster Abbey & went inside but a service was on, so could not walk about. Then went on to Westminster Bge & saw the 2 German submarines in the distance. After that went to Anzac Buffet, had tea, & stopped there couple hours. Then drew my hut, got tube at St James Park stn & arrived at Clapham Common about 8.15 pm. Went to bed at 43 Klea Avenue about 10 pm.\n","61":"\n\nUp 8.30 am, slept like a top. Was on a moving stair-case last night at Charing Cross Tube Stn on way to Clapham. Left Klea Avenue at 9.30 am & took dirty linen to a laundry. Then took tram to Victoria & went to Pay Office re pay book but same had not arrived from Weymouth. Had dinner at Anzac Buffet & then went to Passport Office. After waiting 1½ hours was told passport was under consideration for a few days, so I kicked up a row & asked to see the boss of the show. This had the effect of adjusting matters & they said they would do it up straight away. I gave one of them 2\/- & he got it fixed up for me in no time. Then went to War Chest Club & wrote Base Post Office asking them to send my mail to Clapham. When posting letter met Bruce Hutton, a corporal from the CCS who has just returned to London from Paris & Cannes after 75 days leave. We\n\nhad tea together at Anzac Buffet then went for walk down the Embankment. On way back in Victoria St at corner of Tothill St a Canadian YMCA chap struck us up & took us into a social evening where we had a very nice time. I left at 8.30 pm, getting a tram at Victoria & arrived at Clapham about 9.30 pm & went to bed about 10.30 pm.\n","62":"\n\nUp 8.30 am. After breakfast went to Charing Cross by tram & bus to shipping office, but they have no fixed sailing after Dec 21st yet. Then went to American Consulate in Cavendish Square via Leicester Sq. Piccadilly Circus, Regent St & Oxford St. After seeing them about passport went along Oxford St to Duke St to Selfridges & saw their window displays. Then walked via Oxford St, New & Old Bond Sts to Piccadilly. In Piccadilly went into the Burlington Arcade, then down Piccadilly to Piccadilly Circus, Shaftesbury Avenue, Charing Cross Rd to Charing Cross where I got the Victoria bus & went to War Chest for dinner. When going in for dinner met Johnnie Murray again, so had a good yarn with him. He is working in the Pay Office here, & has been several months in Pay Office at Rouen. Went to Pay Office to see if Pay Book had arrived but it has not yet, so am seeing an officer about it at 2.30 pm. Saw him at 2.30 pm\n\n& he immediately sent an urgent wire to Weymouth for it. After leaving there took 11A bus to the Bank, going via Whitehall, Strand, Fleet St, Ludgate Circus, St Pauls, Cannon St & Queen Victoria St. Went to Basinghall St & had yarn with Mr Petersen for about an hour. He told me Billy Hobson had gone home on the \"Somerset”, the boat I was originally booked for. After leaving him took bus back to Victoria St & had tea at Anzac Buffet & after stopping there couple of hours reading Australian papers, got the tram for Clapham arriving about 8 pm.\n\n12.12.18\n\nUp 8.30 am. Took tram into town via Stockwell, Elephant & Castle, London Rd, Blackfriars Rd, Blackfriars Bge & along the Victoria Embankment to Westminster Bge. There went on to the German mine-laying submarine UC 95, but on account of the crowds could not go inside of her. When left there went along to Embankment, Northumberland Avenue, & Strand to Aldwych YMCA & there wrote this. Then went to Australia House into the basement where there is a large hall & reading room for members of the A.I.F. Stayed there couple hours reading Aust. papers then went to Aldwych Hut for dinner. After dinner went for walk down Fleet St, Chancery Lane, Holborn Viaduct, Newgate St, & Cheapside to the Bank; passing on the way the Law Courts & a small railway terminal called\n\nHolborn Viaduct Stn. After leaving Bank went down King William St to the Monument, but did not ascend it. Then went up Gracechurch St, Bishopgate & High St to Shoreditch Stn passing on way Liverpool St Stn. Then went down Old St, Clerkenwell Rd, Theobalds Rd, Hart St, Great Andrew St, & St Martins Lane to Trafalgar Sq. On way saw an old landmark called St Johns Gate & in Hart St saw a house where the Earls of Chesterfield lived in 17th century. From Trafalgar Sq. I went along the Mall, passing hundreds of captured German guns, Buckingham Palace & Road to Victoria St & then to Anzac Buffet for tea. Altogether must have walked 6½ miles. During my wanderings also passed Saint Bartholomews Hospital, St Lukes Hospital & 2 or 3 old churches. After tea at the Buffet met Bruce Hutton again so we went to the YMCA in Tothill St to a Social & stopped there till 9.30 pm, after which I went home, arriving about 10 pm.\n\n13.12.18\n\nAfter breakfast went per tram to Horseferry Rd. Took in riding breeches & had them changed for a smaller pair. Then went to Pay Office & found my Pay Book had arrived so I had it fixed up & handed in the Pay Card. Then went & drew the balance to my credit - £21.17.9. Went to Anzac Buffet for dinner then\n\nwent to Oceanic Shipping Coy in Charing Cross & fixed up my berth. Am going on \"Adriatic” 24540 tons on Jany 1st & leaving Frisco Feby 4th on Ventura. Am getting an Upper Berth. Had to fill in two large forms for United States Immigration etc. Then went down Whitehall to United Services Museum. Saw skeleton of Napoleons charger \"Marengo”, sword used by Oliver Cromwell at Drogheda , hat worn by Picton at Battle of Vittoria, letters written by Nelson on the Victory, also uniform last worn by Nelson; a letter written by an officer \nafter\n during Marlborough’s campaign, bible of John Balfour the Covenanter , several Duke of Wellington relics from Waterloo also letters written by him, prayer-book & other relics from mutiny of the \"Bounty”, letter written by George 3rd, & innumerable other historical mementos – mostly of war. Also saw an \"Orrery” ie a system of spheres & balls allowing all movements etc of Earth Sun Moon & planets. It showed only the planets discovered up to the time the orrery was made – Saturn etc not being included. Also saw fine silver model of a Brazilian dreadnought , completed in 1910, which was presented to the Queen by the builders. Also saw models of battle cruiser \"Queen Mary” & White Star liner \"Britannic”. One could put in hours there with\n\nprofit. After leaving there went to Room 27 Horseferry Rd & gave Transport Office all particulars they require of my movements en route to Australia. One of the rooms at the Museum is the one through which Charles 1st walked on his way to the scaffold. When there also saw a walking stick used by Sir Walter Raleigh, petticoat worn by Queen Elizabeth, lock of Napoleons hair taken from him after death, commission in Boer Army signed by Paul Kruger in 1897, letter written by Lord Collingwood after Trafalgar & articles of furniture used by Napoleon at St Helena. After coming back to Horseferry Rd & War Chest Club went to some shops making enquiries about my old violin in Australia, & got the addresses of some experts in Leicester Square. Then had tea at Anzac Buffet & after that went for walk past Victoria Stn to Eaton Square & looked around that quarter. Later on came back & met Bruce Hutton & we went to pictures at War Chest Club. I left 8.30 pm & after having some supper went home.\n","63":"\n\nReceived acknowledgement from Base Post Office re change of address. In going to town in morning took short cut to Horseferry Rd across Vincent Square from tram in Vauxhall Bridge Rd. On way in saw Hall of 37th Battalion who was in hospital with me this time\n\nlast year at Moulle – in France. After leaving War Chest walked to Leicester Sq. In Whitehall saw a tablet near United Services Museum showing the \nspot\n situation of scaffold for Charles 1st. in Leicester Sq went to Withers – violin experts – & asked them about my violin. The name inside is that of a well-known German bow-maker. They say violin would be of no particular value. The name is C.G. Pfretzs-chner. After leaving there went up St Martins Lane to Seven Dials – passing the Coliseum on the way. Then went along Great Earl St to Old Compton St & into Soho – walking about several streets in that district. Came back along Shaftesbury Avenue, Charing Cross Rd, Chandos St, & Strand to Aldwych Hut where I had dinner. This morning also went into Downing St & saw No 10 – the Prime Minister’s residence. After dinner went along Aldwych, Kingsway, Southampton Row & Russell Square to British Museum & saw Foxs Book of Martyrs 1563; First volume of Shakespeare 1623; Caxtons \"The Dictes or Sayengis of the Philosophres” 1477; & the first printed English Bible 1535; Raleighs map of Guiana 1595 ; also original letters written by Raleigh; Plan of New York in 1695 by John Nuller & addressed to Henry Compton, Bishop of London; a vellum roll 16’8” long contg colored drawings & all particulars of the English navy in 1546 during reign of Henry 8th; a discourse by Sir Francis Drake on his circumnavigation of the globe 1577-1580; reports issued by Earl of Sussex during fight with Spanish Armada","64":" – to Aug 1st\n\n1588; report by Lord Howard of Effingham on Cadiz expedition 1596; letter by William Penn to Colonel Henry Sidney at the Hague 1681; letter by Wolfe to Monckton before attack on Quebec,","65":" ; log book of the Endeavour 1770; map of North Island N.Z. 1769-1770 done for Joseph Banks on the Endeavour by Richard Pickersgill; the \"Breeches” bible printed at Geneva 1562; Cranmers bible 1540; The Bishops bible 1568 ; a calendar printed by Johann Gutenberg 1448? Supposed to be earliest known printing (this is only a facsimile); also a lot of the ancient statuary from the Parthenon. Saw some ancient relics dating back 1600-2000 B.C. Could only go into 4 or 5 rooms in the Museum, all the rest being closed up on account of the war. They are now removing sandbags from the different rooms etc. Left there about 4 pm and went down Museum St, Great St Andrews St, Seven Dials, St Martins Lane & Whitehall to Victoria St & the Anzac Buffet for tea. When there again met Bruce Hutton so we went to War Chest to the pictures. Pictures were the same as we saw last night so we left & went to a social in Tothill St in the basement of Central Wesleyan Hall. Had a very enjoyable time & met some nice decent young ladies. Left there at 10 pm & went home per tram from Victoria & to bed 11 pm.\n","66":"\n\nUp 8.45 am & had later breakfast. Came to War Chest 11 am & wrote home XX \n\nAfter having dinner there went for walk down Victoria St, Buckingham Palace Rd, Pimlico Rd, Sloan St, Sloane Sq, Cadogan Sq, Hans Place, Knightsbridge, Brompton Rd, and Cromwell Rd to Victoria & Albert Museum. On way passed Harrods & Brompton Oratory. Went into Museum till 4 pm. It is all works of art in furniture, textiles, gold & silver plate, tapestries etc of ancient times. There is a fine display of mens & womens dresses covering period of last 400 or 500 years. Saw some French miniature portraits (painted) lent by Duke of Buccleuch. I looked at one of Napoleon under a microscope & it shows up beautifully – was almost like looking at a person himself. Also saw some fine water color paintings by various well known artists. There is also a good display of old time laces & the old time furniture is something to talk about. Also saw a display of bronze figures by Rodin the well known Frenchman. They also have a display of materials of which the ancient Egyptian & Mohammaden garments were made. Also saw a nice lot of old time glass & china ware, & facsimiles of British gold & silver plate sent to Russia 300 or 400 years ago. When I left there walked back to Anzac Buffet via Queens Gate, Kensington Rd, Knightsbridge, Grosvenor Place & Victoria St. On the way passed Natural History Museum, Albert Hall & Memorial,\n\nHyde Park Corner & Constitution Hill. After stopping there couple hours went home, arriving 8.15 pm, as Uncle Charlie was not too well.\n","67":"\n\nRecd 12 letters this morning – 5 from Mother, 2 from Muriel, 2 from Uncle Jim, 1 each from Mrs Brown, Dick Luse and Ida; last from home dated Oct 13th. Walked to Charing Cross to Shipping Coy & got number of the berth. When having dinner at Anzac Buffet met Barrett who was in Bourke. He only arrived over from France on Saturday & is working in clothing store at Horseferry Rd. Have to meet him on Wednesday. Met Bruce Hutton at 1.30 pm & we walked to Natural History Museum same way as I went yesterday. We put in the afternoon there, leaving at 4.30 pm. Coming back we walked along Brompton Rd to Knightsbridge passing Harrods & seeing their display. Then got 46 bus in Sloane St & came to Victoria via Pimlico Rd & then had tea at Anzac Buffet. At museum saw skeletons of well-known stallions \"Persimmon” & \"St Simon”. After tea we went to social in Tothill Rd & stopped there till 9.30 pm.\n","68":"\n\nAfter breakfast wrote to Uncle Jim & Mrs Brown from the War Chest Club. After dinner went to Science Museum & there saw Watt’s first engine erected 1788. Sanspareil locomotive built in 1829, Rocket built 1829, engine of the Comet 1811, the original experimental\n\nMaxim machine gun, a royal state barge last used 1849, a striking clock from Wells Cathedral made in 1325, the lens for a 6 ft diameter telescope also the machines used to grind same, also several orreries. \n\nCame back to Anzac Buffet via Brompton Rd, Knightsbridge & Grosvenor Place. Good deal colder today & inclined to be foggy in the evening. At dinner time met Broughton who came over with me on the Anchises – he is now on leave from France. After tea Hutton & I went to the Social again & had a good time. Arrived home 10 pm. At Science Museum also saw a pendulum used for trigonometrical survey of India during the 1860’s & afterwards lent to United States for their geodetic survey. The astronomical section of Museum is extremely interesting. Also saw some seismograph instruments for recording earthquakes, also a telescope used for observing transit of Venus about the 1760’s. They also have models of mines, including the mine at Clunes in Victoria; models of bridges of various types, models of all classes of ships – complete & in section also of their engines. Saw a model of the \"Great Eastern” & its engines, models of Portsmouth, Deptford & Chatham dockyards in Nelson’s time, & all types of railway signalling instruments & switches; also gyroscopes.\n","69":"\n\nUp 8.30 am. When I \n\narrived in town went to a boot repairers near Queen Annes Gate & had boots repaired, also rubber soles & heels put on them. Had dinner at War Chest then went to Anzac Buffet to meet Barrett, but he did not turn up. Did not go anywhere after dinner, just had a hot bath & walked about Victoria St. Met Bruce Hutton at 6.30 pm at Buffet & we went to the Social again – leaving 9.30 pm. Received letter from Uncle Fred.\n","70":"\n\nWent for laundry after breakfast but will not be ready till tomorrow. Then went to War Chest for short time & went for walk down Whitehall & Downing St to St James Park. There saw exhibition of captured German aeroplanes also captured artillery. When coming back through Downing St saw several Cabinet Ministers but could only recognise Winston Churchill. Went & had dinner at Anzac Buffet & then met Bruce Hutton. We then went to front of Buckingham Palace to see Haig & King as Bruce was very anxious to see them but nothing doing. We waited there two hours & nearly froze but they did not come out so we went back to Anzac Buffet as it commenced to rain. After having tea there we went to the Social in Tothill St & stopped couple of hours. Arrived home 10.30 pm.\n","71":"\n\nWent for laundry again but not ready. When arrived at Horseferry Rd went\n\nto Q.M.’s for change underclothing. Had to parade to Dr & get note from him and eventually got the change after 2 hours waiting about. When at Dr got some medicine from him for the varicose veins. When at dinner met Bruce so we both went to the Commonwealth Bank & enquired about our money but it had not arrived. Then came back to Vincent Square & received Xmas Boxes from the Aust. Comforts Fund. Had afternoon tea then went for good stroll via Grosvenor Place, Hyde Park Corner, Park Lane, Oxford St, Baker St, Marylebone Rd, Portland Place, Regent St, Piccadilly Circus, Shaftesbury Avenue, Wardour St, Leicester Sq, Chandos St to the Strand, where Bruce got his passport photos. Then took bus to Anzac Buffet & had tea. After stopping together short time after tea I went home early arriving about 9 pm.\n","72":"\n\nGot the laundry at last this morning. When I went into town made enquiries at several laundrys for next weeks wash & at last found one in Vauxhall Bge Rd that would do it. After dinner went for stroll along Buckingham Palace Rd, The Mall, past St James Palace to Pall Mall, thence St James Street, Piccadilly, & Berkely St to Berkeley Square where I saw the house in which Horace Walpole lived & died 1779-1797. Then walked via Davies St, Oxford St, Duke St, Grosvenor Square & North\n\nAudley St to the Marble Arch; thence Portman Square, Baker St, York Place, to Marylebone Rd and Upper Baker St near Regents Park, then back along Baker St to Manchester Square to a YMCA for a rest. Then went down Duke St past Selfridges, Oxford St, New Bond St, Piccadilly, Waterloo Place, and around St James Park to Great George St, thence down Victoria St to Anzac Buffet for tea.\n\nDuring my wanderings saw Claridges Restaurant. Met Bruce at 6.30 pm and we went to the Social again. Had a good time and the two of us saw a young lady home as she had not her friends with her. Arrived home midnight.\n","73":"\n\nWrote home. XX Uncle Charlie not too well so is stopping in bed all day. When writing home Bruce Hutton strolled into writing room, so after dinner we went for a stroll via Buckingham Gate, The Mall, St James Square, and Jermyn St to the Overseas Club in Piccadilly where we stayed about an hour. Then went via Berkeley and Grosvenor Squares to top of Baker St. Took No 2 bus back to Victoria and had tea at the Buffet.\n\nLast night received parcel from Australia contg Biscuits, Sweets, Coffee and Milk and Figs. \n\nWet and foggy all day. Went home early.\n","74":"\n\nThe old lady, Mrs Jupp, who lodges at 43 Klea Avenue died during the night – Mrs Paynter seems very upset.\n\nBrought my washing into the laundry in Vauxhall Bge Rd. Took a small parcel up to York Place then came back to dinner at the Buffet. When having\n\ndinner Bruce strolled in, having received 3 or 4 days of grace after reporting at 10 am. After dinner went to Shipping Office and they told me boat put off till Jany 8th. Then went to Bank in Australia House and found money had arrived, but did not rack draw any. \n\nThen went back to Horseferry Rd and got more coupons. Also made enquiries if could get any subsistence allowance for time I have stopped in London, but no luck. Also enquired about where I had to report on arrival in Sydney. Have to go to Victoria Barracks.\n\nMet Bruce again after tea at the Buffet but we did not go anywhere.\n","75":"\n\nVery cold and frosty but fine. Came in to War Chest and read the newspapers. After dinner had hot bath and shave. Then went for walk via St James St, Berkeley Sq, Baker St, Marylebone Rd and Euston Rd to Euston Stn. After looking round there took bus back to Victoria St and had tea.\n\nVery cold and frosty making me cough a lot. Rec’d a letter at the Buffet. Met Bruce so we walked down to the Strand to see what London was like on Xmas Eve but it seemed quieter than an ordinary night. Came back home at 9.30 pm. Some of the streets decorated for Pres Wilson’s visit.\n","76":"\n\nUp 9.15 am and sat in front of fire all morning. Had Turkey for dinner and plum pudding, with Uncle Charlie at Mrs Paynters. About 3 pm we went out for a\n\nwalk to Buxton and landed back about 5 pm then had tea. After tea played dominoes with the family.\n\nCold and frosty.\n","77":"\n\nUp 9.15 am. Very cold and heavy white frost. After breakfast had haircut and shave in Abbeville Rd. At 11 am Uncle and I went out for walk. First went to place of a friend of his near Clapham Stn then walked to Stockwell and took tram to Blackfriars Bge via the Elephant and Castle. Then walked down Fleet St and Strand to Soho to Hotel Boulogne in Gerrard St and had good dinner.\n\nThen went for walk down the Mall, Constitution Hill, Hyde Park and Marble Arch to Oxford St to one of Lyon’s Cafés and had tea and toast. Then walked down Regent St, Coventry St, Chandos St, Strand and Kingsway to British Museum Tube Stn and went home to Clapham, arriving 7.30 pm.\n","78":"\n\nNot nearly so cold. Drizzling a little. \n\nAfter arriving at the Anzac Buffet wrote to Uncle Fred and Ida. After having dinner went for walk down the Victoria Embankment and saw Cleopatra’s Needle, which was first quarried 1500 BC and brought to England in 1878. Then went along New Bridge St, Farringdon St, Holborn, Hatton Garden – where all the diamond merchants have their places, New Oxford St, Tottenham Court Rd, Charing Cross Rd, and Whitehall back to the Anzac Buffet. When in Whitehall saw a big crowd waiting for President Wilson, who\n\nwas at 10 Downing St. \n\nDid not go anywhere after tea.\n","79":"\n\nUp 8 am. Old lady at home to be buried during the morning.\n\nTook tram to Victoria and got my laundry from Vauxhall Bge Rd and left it at Anzac Buffet for the day. Then walked to Strand and took a bus for the Bank, but on account of the large crowd waiting to see Pres Wilson, bus had to alter its route and evenyually arrived at Liverpool St, going via Kingsway, Holborn, Charterhouse St, St Johns St, Clerkenwell Rd, Old St, City Rd, and Finsbury Circus. \n\nThen walked down Houndsditch to Aldgate and got No 67 tram along Commercial Rd and East India Dock Rd, getting out near Hale St and going to Uncle Charlie’s place in High St, Poplar. \n\nAfter waiting about an hour we went to a Seamen’s Institute and had dinner, then took 67 tram to Canning Town Rly Stn. Then walked down Victoria Dock Rd and North Woolwich Rd to Nth Woolwich Stn, where we crossed to south side of river near Woolwich Arnsenal. On the way saw numbers of large industrial concerns. Also saw some slum people having a dance on the pavement to the music of a barrel-organ.\n\nHad walk around main business streets of Woolwich then took a tram for Kennington going via Church St, Albion Rd, Woolwich Rd, Trafalgar Rd, Romney Rd and Nelson St, seeing the Greenwich Hospital and Royal Naval School.\n\nContinued along Greenwich Rd, New Cross Rd, Queens Rd, Peckham Rd, Camberwell New Rd to Kennington Park where we changed trams. On way saw Siemens Bros big works. Then took a tram for Victoria passing Vauxhall\n\nRly Stn and seeing Kennington Oval. Then went to one of Lyon’s Cafés in Victoria St and had tea, after which we walked to Westminster Bge and Uncle went out to Clapham by tram and I went to YMCA Social Hut in the Canning enclosure and wrote this. Then went to Buffet for tea and went home about 8 pm.\n","80":"\n\nWrote home. XX \n\nCame into town 11 am. After dinner went for good walk along Grosvenor Place, Park St, Baker St, and Park St to St Johns Wood Stn and saw the Lords Cricket Ground near there. Then went along St Johns Wood Rd, Maida Vale, Edgware Rd, and Chapel St back to Marylebone Rd, then back to Buffet for tea the same from Baker St.\n\nTook over two hours altogether. Weather quite mild but cloudy. Went to YMCA Social Room in Canning Enclosure after tea for about an hour then went home.\n","81":"\n\nBrought in laundry me to place in Vauxhall Bge Rd then went to War Chest and read paper. Had lunch at Buffet then went to Shipping Office and altered my sailing from ‘Frisco to Feby 25th instead of Feby 4th.\n\nThen walked up Charing Cross Rd to a shop in Tottenham Ct Rd and bought pair of \"Australia” shoulder bages, also had blue service stripes sewn on tunic. Then went for walk up Tottenham Court Rd and Hampstead Rd to Mornington Crescent, then down Eversholt St and Seymour St to Euston Stn where I had cup of tea and cake. Then came back to Anzac Buffet via Whitehall and Victoria St.\n\nAfter tea went for stroll in some of the streets off Whitehall then went down Bird Cage Walk and St James St up to Piccadilly and Oxford St, then\n\nback again. After having some supper went out home about 8.30 pm.\n","82":"\n\nAfter breakfast walked down as far as Stockwell and got tram there for Victoria. Went into Pay Office to see Jack Murray but he was out. Then had hot bath at War Chest, and after seeing paper went to Buffet for dinner.\n\nAfter dinner went to Saving’s Bank and drew £10 then to Shipping Office and paid the balance due to them ie £26.18.6. When on way to bank met R L Ryan from the London Bank, Bourke. \n\nWhen finished at Shipping Office went to Hatton Gardens via St Martins Lane, Long Ave, Endell St and Holborn to buy Cinnamon Essence for my cough. Then returned to Buffet via Oxford St, Charing X Rd, and Whitehall, and had tea.\n\nThen had tea and had shave and went to Westminster Bge and go No 40 tram to New Cross, getting out at place called the Arlington. Went down Peckham Grove to St Andrews Hall to dance to which I was invited couple weeks ago. Had good time altho’ floor not too good and wearing rubber soles and heels on boots but managed to get on alright. \n\nLeft about 10.30 pm and took home one of the girls to Baker St, going per tram to Victoria and No 16 bus to Marble Arch. Left her at her place 11.50 pm and took Tube from Baker St Stn to Elephant and Castle arriving 12.30 am. Wlaked to Kennington and there got tram to Clapham Common, arriving home 1.20 am. Uncle had not gone to bed so he gave me medicine for my cough which had got rather bad, also had couple biscuits, then off to bed.\n","83":"\n\nUp 8.30 am. After breakfast went to War Chest and read papers. Also went to see Murray but he was having a holiday.\n\nHad dinner at Anzac Buffet. Wrote to Dick Luscombe. Went for stroll down Whitehall, Charing X, Cockspur St, Pall Mall, The Mall, and Buckingham Palace Rd back to the Buffet. In Cockspur St saw N.S.W. Government Offices also Canadian Pacific and Grand Trunk Pacific Railway Offices.\n\nWas drizzling rain all afternoon so could not go far. After tea went to YMCA Social Hut for about ½ hour. Went home 7.30 pm and on arrival received my Xmas parcel from Uncle Jim contg Sugar, Cake, Chocolate, Lemon Butter etc.\n","84":"\n\nReceived letter from Muriel dated","85":" On arrival in town went again to see Murray and found him after a lot of trouble. When going to see him met Lonagan in the courtyard at Horseferry Rd. Lonagan only arrived from Germany yesterday and has had an awful time there. He looks fairly well. \n\nMet Murray again at 12.15 pm and we had lunch together at Anzac Buffet, then I walked back to his office with him and said good-bye. He expects to go back himself about 8th or 10th January.\n\nWrote to Uncle Jim. After dinner took bus to the \"Bank” went to 61 Basinghall St to say goodbye to Mr Petersen, but he was away for the afternoon. Had yarn with old chap in the office then came back via London Wall, Wood St, Silver St, Aldersgate St, St Martins-Le-Grand, Paternoster Row, Warwick Lane, Newgate St, Old Bailey, Fleet St and Strand.\n\nIn street called London Wall saw part of the old Roman Wall around London. After tea went to Baker\n\nSt saw the girl I took home on New Years Eve, having Tea and Toast at one of Lyon’s Cafés. Took tube from Baker St Stn and arrived home 10.30 pm.\n\nCold but fine day. Bought peppermints for cough.\n\n3.1.19\n\nCame in by tram to Westminster Bge via Kennington Rd and went to Shipping Office and got tickets for trip across U. States and the Pacific. Also told boat was not going till Jan 11th.\n\nThen went to War Chest and read papers. After dinner went to Bassinghall St and saw Mr Petersen for about ½ hour – going to see him again next week. Told me Geo Hobson was in London for 4 days before Xmas.\n\nLeft PB’s about ¼ past 3 then went for a long walk along Moorgate St, Finsbury Pavement, City Rd, Pentonville Rd and Euston Rd to Euston Stn where I enquired about Liverpool trains. On way passed Bunhill Fields which is an old cemetery, also saw Wesleys old chapel in City Rd. When coming out Euston Stn, was invited into YMCA hut near stn for cup tea, so went in and then read the \"British-Australasian”.\n\nCame back to Victoria St via Tottenham Court Rd and Charing X Rd and Whitehall. Has been nice fine day. Went home about 8 pm.\n","86":"\n\nRained in early part of night. Got laundry on way in, then went to Buffet and wrote a letter. After dinner went for good walk along Victoria St, Whitehall, Cockspur St, Haymarket, Piccadilly Circus, Glasshouse St, Regent St, Oxford St, Great Portland St, Marylebone Rd and Baker St. to YMCA in Manchester Sq. Stopped there about 1½ hours in front of fire then came back to Buffet for tea via Park Lane and Grosvenor Place.\n\nVery foggy all afternoon. Came home early raining after tea.\n","87":"\n\nUp 9 am but did not\n\ngo anywhere after breakfast thill 12 noon when I went out with Uncle. We went down Balham High Rd to Tooting and there got tram and went through Wimbledon, Norbiton and Kingston to Hampton Court. Went to the Palace after having some lunch, and saw the Picture Galleries and old Royal Apartments.\n\nThen went for short walk in Bushy Park. Then took tram to Twickenham and from there walked to Richmond and saw Aunt Lucy Scott. We gave her some sweets, also had tea with her; also a good long yarn stopping 3 hours. She was telling us about the old times when she and Grandma were girls, also about her Mother and Father and her grandparents. \n\nLeft there 7.30 pm taking train to Clapham Jcn from there walked along Lavender Hill and Wandsworth Rd to Clapham Common and went to a café for tea, arriving home 9 pm.\n\nAt Hampton Court saw old pine planted in 1768. It is 5 ft girth at the ground. \n\nThe maiden name of Aunt Lucy Scotts mother was Woods; her father was in the Life Guards.\n","88":"\n\nBrought laundry in with me then went to War Chest for a bath. Met Vernon from C.C.S. there – he is waiting to go home on a transport as a dispenser. XX\n\nWrote to Muriel. After dinner went for stroll down Whitehall, Trafalgar Sw, Pall Mall, Haymarket, Piccadilly Circus, Regent St, Hanover Sq, Oxford St, Baker St, Marble Arch, Park Lane and Grosvenor Place back to the Anzac Buffet. During morning saw Capr Sorenson, the O.C. Furlough Dept and got a pass fixed up on account of boat being put back to Jany 15th.\n\nAfter tea met Keane from the C.C.S. in Victoria St. He has just arrived from France and is going to Edinburgh tonight to the University studying medicine, and starts his lectures tomorrow.\n\nArrived home 8.30 pm. Drizzling rain.\n","89":"\n\nCame in to War Chest and read papers. Think I saw Forsythe in distance, but no opportunity of speaking to him. After dinner went for walk down Grosvenor Place, Knightsbridge, Church St, Notting Hill Gate, Bayswater Rd, Oxford St, Regent St, Coventry St, Trafalgar Sq, and Whitehall back to the Anzac Buffet. \n\nSaw some Tommies lined up in Downing St, in front of Prime Minister’s residence, to air their grievances re demobilisation. A motor-load of them also passed me in Bayswater Rd and gave me a cheer in passing – on a\/c of being an Aussie I suppose. After tea went home early. Fairly fine.\n","90":"\n\nRec’d letters from Mother, Muriel, Ivie and Partridge. Muriel told me Mother not at all well, having chronic Brights Disease.\n\nTook tram to Savoy St via Elephant and Castle and Blackfriars and went to Shipping Office – no alteration re boat. Then went to Anzac Buffet and wrote to Ivie and Partridge, also a London friend. Uncle Charlie ill in bed today, so rang up his firm for him. After tea went for walk via Grosvenor Place, Park Lane, Baker St, Marylebone Rd, Gt Portland St, Oxford St, Charring X Rd, Trafalgar Sq and Whitehall back to Victoria St, then took tram home.\n\nRained during morning.\n","91":"\n\nCame straight in to War Chest Club and read papers. After dinner went to Shipping Office and enquired re boat – still going next Wednesday. Then went for walk up Charing \n\nCross Rd and Oxford St to YMCA in Manchester Sq and stopped there couple hours in front of fire. Then came back to Anzac Buffet for tea. Stopped there in front of fire for couple hours then went home.\n","92":"\n\nWent straight to Anzac Buffet and got letter waiting there for me. Then went to C’Wealth Bank and drew all money to my credit £58 odd. Then went to War Chest for dinner and after that walked to one of Thos Cook’s offices in the Strand and enquired what they charged for American dollars, but they are about the same as Jacksons. Then went to Jacksons and got 200 dollars for £42.\n\nDuring morning at C’Wealth Bank also got £p12 of Aussie pound notes. When finished at Jacksons went for walk up Charring X and Tottenham Court Roads then back to Bedford House to see my friend, stopping there till 10 pm. Had some nice home-made coffee for supper and shortbread.\n\nWent home per tube from Baker St Stn arriving about 11 pm. On arrival home there was a small parcel for me from Mother containing pair Sox, 2 hdchiefs and Boot laces.\n","93":"\n\nCame straight into War Chest and read paper, stopping there couple hours. Could not eat much dinner – not feeling to brilliant. Wrote Muriel.\n\nIn afternoon went for stroll to Trafalgar Sq and saw a demonstration there by Discharged soldiers and sailors. Few showers rain during day. After tea got my laundry then went home 7.30 pm. XXC\n","94":"\n\nUp 9 am. Went to War Chest and had hot bath, then to Buffet for lunch. Wrote to Mother. XX\n\nAfter dinner went for stroll up around Portland Place and Marylebone Rd. Went out home 5 pm and had tea with Uncle out there. After tea we went for \n\nwalk to Clapham Rd and around Brixton, arriving back about 10 pm.\n","95":"\n\nTook tram straight into Savoy St via Westminster Bge and went to Shipping Office. Boat leaving for certain on Wednesday. Got all particulars from them then went to Horseferry Rd and got a rail concession warrant to Liverpool. Then went to Buffet for dinner.\n\nVery thick yellow fog today. After dinner went to 61 Bassinghall St and said goodbye to Mt Petersen. Then went for walk along Poultry, Cheapside, Newgate St, Holborn, Oxford St, Gt Portland St, Marylebone Rd, Baker St, Oxford St, Bond St, Piccadilly and Circus, Coventry St, Haymarket, Cockspur St, Whitehall back to Victoria St and had tea. Then wrote to Base Post Office, also to Uncle Charlie enclosing £:1 note for him to but something as a gift.\n\nWent home 7.30 pm and then packed up all my belongings. Before going to bed Uncle gave me leather hand made bag and belt for Muriel, also 2 lens for myself from Ross’ factory.\n","96":"\n\nUp 8.30 am. When went down to breakfast there was a letter for me from Shipping Office saying boat postponed to 17th, also parcel from Australia from Bourke district contg Sox, Soap, Cigarettes, Sweets and Muffler. Went straight into War Chest and read papers, then to Buffet for dinner.\n\nThen went to Shipping Office and found no further postponement. Then walked along Strand, Fleet St, around St Paul’s Churchyard, Middle Temple lane and back to Australia House and there read papers. Then came to Buffet for tea. Went out home 7.15 pm.\n","97":"\n\nRead letter from Partridge dated\n\nOct 1st. Brought sox and hscfs in with me to be washed. Went to War Chest and read papers, fixed up a\/c of later departure of boat. Recd wire at Anzac buffet. Wrote to Mrs JT Brown. Went to Shipping Office after lunch, but no further alteration. Then went for walk up to Oxford St, then back to Buffet for tea. When at tea met a chap who had been to Frisco in 1908 and he gave me some hints about America. Had a bit of a stroll round after tea then went home 8.15 pm. Raining little.\n","98":"\n\nRecd another parcel from Mother contg Chocolate, pr Sox, Boot Laces and Soap. Uncle came up to my room about 7 am before going to his work and said good-bye.\n\nLeft home at 10 am and carried kit bag to Clapham Common Tube Stn and went to Euston per Tube. Left kit bag in Cloak Room then took bus to Trafalgar Sq and went to Shipping Office. Found that Adriatic again postponed on a\/c of strike amongst the crew. Have to call in again at 5.30 pm and see if anything more definite. \n\nThen went to Anzac Buffet and receiving letter there from friend re the wire explaining things. Nice fine sunshine morning. After dinner went for stroll down Oxford St and Regent St, rain coming on and making me fairly wet.\n\nAfter tea went to Shipping Office at 5.30 pm but no further news there. Then went to Soldiers Hostel at Buckingham Palace Hotel, opposite the Palace and booked a bed, then did some writing till bedtime at 11 pm.\n","99":"\n\nSlept fairly well – up 8.45 am. After breakfast had shave, then went to Shipping Office but nothing definite yet. Then went to Hdqtrs and had a \n\na pass fixed up till I really do sail. Then went to War Chest and read papers. Put in afternoon writing a letter. After having afternoon tea went to Shipping Office again but no further developments. Then came back and posted a letter and took parcel to Baker St, then went on to Soldiers Club at 189 Marylebone Rd and rested there. \n\nCame back to Buckingham Palace Hostel to book a bed but they refused as I was not direct from France. After having supper went back to 189 Marylebone Rd and got a bed there. Fairly cold.\n","100":"\n\nSlept fairly well – up 9 am. Heavy white frost. After having breakfast walked to Shipping Office via Baker St, Oxford St, Regent St, Haymarket and Cockspur St. Boat to sail on Monday and I have to embark valuables and tickets when there. Then went to War Chest and had dinner and read the papers. Bought 2 khaki collars, khaki tie and collar pin and went to medical dressing room at Hdqtrs and got some ordinary safety pins.\n\nThen went to shop in Broadway and bought insoles for boots, and then on to Euston Stn to get rail ticket for tomorrow. Would not give it to me till tomorrow so I cursed some. Then went to 189 Marylebone Rd and booked bed for tonight, and then on to Anzac Buffet for tea.\n\nWrote home. XX\n\nLeft Buffet 8.45 pm and walked to Marylebone Rd to get warm, and then to bed.\n","101":"\n\nUp 9 am. Pretty thick fog and very cold – also white frost. Went straight down to Buffet and sat in front of fire for while. Then went to War\n\n \n\nChest for dinner. Then went to laundry and got Sox and Hclfs and went to Euston Stn and bought ticket to Liverpool – only cost 8\/3. Went to 189 Marylebone for while then down to Buffet for tea. When at Euston saw couple Yank YMCA chaps and asked them about place to stop at in New York.\n\nThen took bus to Euston Rd via Tottenham Ct Rd and got parcel had left at YMCA. Then went down Marylebone Rd to No 189 and had supper. Went back to Stn at 10.30 pm and tried to get kit bag from Cloak Room. It could not be found and I put in an hour looking for it, consequently missed 11.45 pm train. Went back to 187 and booked a bed.\n","102":"\n\nUp at 5.15 am – did not sleep a wink. Went to Euston 6.30 am and again looked for kit bag, but could not be found anywhere. Took Tube at 7.10 am to Regents Park Stn and went to Horseferry Rd and saw the Orderly Officer (who was in bed) to try and get another kit, but could do nothing as Q.M. Store was closed. Then took Tube back to Euston and found special boat train not leaving till 9.30 am. Went to Cloak Room to have final look around with its foreman and at last minute discovered bag in a corner, out of its proper place, and under some overcoats. After that went and got seat on the train. Left at 9.30 am travelling via Harrow, Pinner, Leighton Buzzard, Wolverton, Rugby, Stafford, Crewe, Runcorn, Sutton Jct, to Riverside Stn, Liverpool, arriving 2 pm.\n\nEmbarked 2.30 pm having our cabins changed on a\/c of American troops returning. I was removed to\n\ncabin 199 being in with 3 other Aussies. Boat cast off from wharf 4.30 pm but anchored midstream. Had dinner 6.30 pm – 5 or 6 courses and very nice after army food. Went to bed about 10.30 pm and rather warm in the cabin all night.\n","103":"\n\nUp 7.30 am. Boat stopped in midstream all night and sailed 12 noon today. Had breakfast about 8 am then had good walk on the decks. Not too cold. Lunch at 12.30 pm – during morning we were all allotted to our dining room seats. After lunch most of the Aussies on board got on one of the decks and played pitch and toss. \n\nCouple of hours after leaving Liverpool we struck the Welsh coast and steamed along it for about 1½ hrs. Had dinner 6.30 pm then wrote to Uncle Charlie and Baker St as calling at Brest tomorrow. \n\nWent to bed 10.30 pm.\n","104":"\n\nUp 7.30 am, breakfast 8 am. Fairly warm in morning but afternoon became very cold and windy and little swell. Had hot bath 11 am. During afternoon passed 2 or 3 boats and sighted French coast about 3 pm. Did not go to a wharf – anchored out in the harbour. \n\nCough has not been as bad as usual today. \n\nThe place looked rather fine from boat after dark being all lit up, also all ships in port.\n","105":"\n\nAmerican troops numbering about 2000 commenced to embark on boat about 9 am. Some of them only came to France in October.\n\nStarted to leave Brest about 4 pm. Wrote letter to Baker St during morning. Fairly cold in afternoon but warmer after tea.\n","106":"\n\nJust 2 years today since I sailed from Australia on Anchises. \n\nDuring morning washed my dirty linen. Last night had talk with American YMCA chap named Wear and found he is a Mason. \n\nDid 316 miles to 12 noon today.\n","107":"\n\nNice fine sunshine. Yanks had boxing contests during afternoon.\n\nDid 382 miles to 12 noon.\n","108":"\n\nHad hot sea water bath during morning. \n\nDid 390 miles to midday. Heavy swell and fairly rough. Strong wind.\n","109":"\n\nCovered 367 miles to today. Passed 3 masted sailing vessel between 2 and 3 pm.\n\nWent to concert after tea but it was very stale. Mrs Vernon Castle performed and Sir Horace Plunkett was chairman. \n","110":"\n\nDid 361 miles to noon, being now on edge of Newfoundland Bank. Vert much colder today. Yesterday sea very rough. Fall of snow after tea.\n\nThere are 3 or 4 Yanks on board who were on the Archangel front. They say it was bitterly cold there even last November.\n","111":"\n\nDistance to noon – 364 miles. Saw 2 passing boats up to lunch time.\n\nIn afternoon went to lecture on Psychology by a Yank expert. Snow started falling about 3 pm and continued till 7 or 8 pm. Sea Rough and weather cold.\n","112":"\n\nDistance to noon – 380 miles. Passed 2 vessels during morning both bound towards New York. Supposed to arrive there sometime tomorrow afternoon.\n\nAfter tea saw lights of another vessel in distance. Concert held at 8 pm.\n","113":"\n\nStarted letter to England. Not nearly so cold. \n\nAfter lunch commenced to see good deal of shipping – passed 3 American dreadnoughts and saw a cruiser in the distance. \n\nSighted American coast about 3 pm and arrived at wharf in New York 6 pm. Steamed in the Ambrose channel for several miles and the land gradually got closer on both sides. Saw Coney Island on the starboard and Fort Wadworth on port side where we took on the Port Doctor. Also saw Sandy Hook, then later on the Statue of Liberty. \n\nThen the skyscrapers gradually loomed up and they looked very fine as we got closer. We steamed along quite close to them and they commenced lighting up as we passed the. The American troops on board received a great reception.\n\nHad dinner 6 pm and fixed up with Immigration people about 8 pm. R’cd permission to stop on board for the night. \n\nDid 378 miles to 12 noon leaving 50 to be covered to New York. When coming up the harbour saw numbers of special ferries each being laden with about 12 big railroad cars each, also the ordinary passenger ferries somewhat same style as Sydney ferries.\n\nFinished letter to England after tea, also sent Uncle Charlie a United States Field Post Card.\n","114":"\n\nUp 6.30 am, breakfast 7.30. Left boat 8.15 am and after waiting about ¾ hr on wharf got fixed up with the Customs, not having to pay any duty or taxes. Then 4 of us got into a taxi and went to Mills Hotel in 36th St for 2 dollars the lot. Did not like the look of place or its habitués, so a Yank soldier\n\ntook us to a lodging further along 36th St – the district being called the Tenderloin. \n\nThen went for walk down Broadway a few blocks and then saw about an Australian Reception Committee, so went to their Office at 200 Fifth Avenue, near the Flatiron Building. The place is run by the Order of the Daughters of the British Empire. They are getting us in touch with some Australians resident in New York. \n\nThen walked right down Broadway to Wall St and went down Wall St into Broad St to the Stock Exchange and saw them bidding on the curb market. A Yank came up and told us he would give us a fly around in a motor, but we waited some time and he did not come so we went off.\n\nCame back to near Broadway and took the Subway to 23rd St and went to Childs Restaurant for lunch, having Sausages and Buckwheat cakes for 55 cents. Then went back to Com’tee room for short time and met another Aussie from the Dental Corps. We went with him to a Salvation Army place in 41st St to try to get a decent bed but they were full up. \n\nThen went back to Com’tee room again, on the way calling in at a War Committee Hut and having afternoon tea. The American ladies there were very nice and seemed to take a great interest in us. Then went by Broadway tram to 75th St to another Salvation place and there got fixed up with a bed; on way after leaving tram had to go through Central Park, but could not see\n\nit too well on a\/c of the darkness. The wind was very strong up there making temperature extremely cold. From there took Fifth Avenue bus back to War Community and had Tea of Ham Eggs Bread Butter and Coffee only costing 30 cents each. \n\nThen went to lodgings for our overcoats and afterwards tried to get into several theatres but they had standing room only. At last got into a picture show. It finished about 10.45 pm, then we went to a hut of Knights of Columbus which was just being opened. They gave a vaudeville entertainment by several New York theatrical people. The show finished about 1 am. \n\nWhen we got out of the door met an Australian actor named Cyril Keightley, so he gave us an invitation to his club – the Friars Club in 48th St. Then went home arriving 1.25 am and stopped talking in my room till 2.15 am, then to bed.\n\nSaw some magnificent electric advertisements down Broadway. Met Amy and Eileen Castles and had yarn with them. When looking for seats in the theatres. They invited us out to their place. At the Australian Reception Com’tee also received an invitation to dinner tomorrow in flat from an Australian named Mr Benjamin who is in business here. Altogether had a very enjoyable day.\n","115":"\n\nUp at 9.15 and then went to breakfast at War Community hut in Fifth Avenue. Then went back to house, got\n\na taxi and took our belongings to the Salvation House in 75th St. When there wrote to Uncle Charlie.\n\nWent back to a place in 42nd St and had dinner then over to War Community Hut and got a free motor bus and had a good long drive sightseeing. Went right up Riverside Drive along the Hudson River to about 135th St and on way passed residence of Chas Schwab . Arrived back at hut 4 pm. Then took subway to 145th St and went to Mr Benjamin’s flat and had afternoon tea and tea with him and his wife.\n\nLeft there 11 pm, took subway to 72nd St and walked across park to Fifth Avenue and 75th St. Nice clean cold night. Got to bed about 12.15 am.\n","116":"\n\nUp 7.20 am. Went to Salvation restaurant in E 42nd St and had breakfast of Grape Fruit, Porridge, Eggs and Toast costing 40 cents. \n\nThen went to Times Square and took subway to 116th St and went to Columbia University and saw Dr McCastline the consulting physician to the university about the heart. He was greatly interested and said he thought I would be able to make some cash out of it and gave me a card to see Dr Lambert the Dean of College of Physicians and Surgeons at 59th St and 10th Avenue. \n\nWent to Broadway and took tram to that address but Lambert had just gone out, so am going 10.30 am tomorrow. Then went to Columbus Circle and walked down Broadway to 42nd St and left overcoat at Salvn Army as weather real hot today. \n\nThen went back to Times Sq and took subway to Wall St and met Kendwick and Henshall in Broad St at the Curb market. Stopped there talking in the crowd till 1.15 pm then went to Stock Exchange nearby and asked a chap who was evidently a member\n\nif we could go in and see the place. He said yes and told us to go to 13 Wall St around the corner and we would be fixed up. We went in and were taken up stairs and given chocolates and cigarettes and a card for dinner in the Stock Exchange Restaurant as guests of members of Stock Exchange.\n\nThen went on to gallery of Exchange and saw the scene which was unforgettable. When up there looking around one of the members seeing we were Australians came up and explained everything to us. The membership is limited to 1100 and to secure a seat a man has to pay 72000 dollars. Before the war price was 90000 dollars but war made a slump and price fell to 42000 dollars but rose again. He said he expected it would soon be over 100000 dlrs. To join a man has to give his whole history since birth and must be of unimpeachable character.\n\nWe then went to the restaurant for dinner, having Soup (flavoured with lemon), Steak with chips and lovely green fresh Peas and the Steak beautifully tender and plenty of it, Custard Tart – the custard being flavoured with orange, then Coffee to finish. When dinner finished we each received a first class best quality Cigar and Cigarette each.\n\nThen went downstairs again to the Exchange gallery and that chap met us again. We stopped there till 3 pm then went to this chaps office and had all the workings etc of a Stock and Share brokers office explained to us. They employ 270 clerks at their office an another 63 are away in the army. Left there 4.30 pm, the chap walking little way with us – he would have\n\nentertained us for the evening but he had a prior appointment, so we are to see him again before we go away. \n\nWe then walked right up Broadway to 41st St Community Hut for tea, seeing on the way a woman run over by a motor car and two motor accidents – all in 5 minutes. After tea I went to a barber in 44th St and had haircut, head massage, and shampoo – getting out of the place for 1 dollar 30 cents all told.\n\nI went back to Hut and sent note to Keightey giving all our names for honorary membership of Friars Club, then Kendrick and self walked home via 42nd St, Broadway, 59th St and 5th Avenue; the other two going up near Columbia University for an appointment. Then wrote this, had bath and went to bed 11 pm.\n","117":"\n\nUp 8 am and had breakfast near 41st St about 9.15. There met the Aust dental Sergeant and he rang up a Mrs Pemlias who had invite us to her place. We are to meet 7.30 pm tomorrow night and go out.\n\nThen went to Medical College in 59th St and saw Dr Lambert. Am to go to a lecture tomorrow at 10.30 am and he is giving me 5 dollars for it. Then walked back to 42nd St and went for a stroll down Fifth Avenue till lunch time, when went to hut and waited for others to come in. After waiting ½ hr Sgt White of 14th Bn turned up and had lunch with him.\n\nAt 2.30 met Kendrick and we went to Vitagraph Coy to see Mr Balsdon who came over on Adriatic with us but he was out. His son was in though and gave us\n\ntickets to a picture show and also shouted cigars and cigarettes. We went from there down Broadway to","118":" Avenue and into No 200 and met the others. Came back to hut for tea then went around into Broadway and bought picture p\/cards and book of views of N.Y. Went to 41st St and wrote the cards then came home. Drizzling rain afternoon.\n","119":"\n\nUp 7.40 am. After breakfast took stroll down 41st St and Park Avenue to Grand Central Rail Terminal and stopped few minutes. Then walked to Medical College in 59th St and Dr Lambert took me to the lecture at 10.30 am. When it finished at 12 noon he gave me 5 dollars also letters of introduction to Cornell Medical School and N York University Medical School.\n\nAfter lunch went to Cornell at corner","120":" St and First Avenue but the Dean was out so went to N.Y. School at corner First Avenue and 26th St so they kept me there. Professor Pulley took me and demonstrated to student and then gave me 5 dollars. Then walked down First Avenue and Second Avenue to 42nd St and went to Grand Central Terminal and saw several of the long distance express train also the selective locomotives. Saw Boston, St Louis and Chicago trains.\n\nThen went back to Cornell ay 5 pm and saw Dr Niles, the Acting Dean and he told me to come again on Friday morning. Then walked up Lexington Avenue and Park Avenue to 42nd St and had drink at a Soda Fountain, then went to War Community Hut for tea.\n\nAfter tea wrote to Baker St. During morning posted\n\n22 picture p\/cards to England and Australia costing 2 cents each.\n\n6.2.19\n\nUp 8.30 and had breakfast in hut near Public Library. We all stayed there talking till noon then went to 21st St to a friend of Henschalls. Came back to hut and had lunch then went to Friars Club for hour or so, having received our membership cards from Keighlty this morning. Met a chap who had just arrived from Australia by the Ventura and another chap showed us some tricks on the billiard table. Came back to hut and had tea then four of us went to the Hippodrome which is a very fine show.\n\nArrived home 11.15 pm. Nice fine day.\n\n7.2.19\n\nUp 8 am and had breakfast here. Took bus down Fifth Avenue to 28th St and arrived at Cornell Medical School just on 11 am. Saw Dr Sheldon and he showed my heart to several of the students, but only scoring one dollar from him. He then handed me over to Dr Holland the X Ray expert and I went to Holland’s rooms in East 40th St and he investigated my interior with the fleuroscope. He reckons the stomach is slightly out of gear as well and wanted to put me into the hospital for a week but I am not willing. When finished went for stroll to the Pennsylvania Ry Terminal in 7th Avenue and 32rd St and looked over it, then went up to Library Hut for tea and met the other chaps.\n\nCame home early the others going to the pictures. Fine day.\n","121":"\n\nUp 8 am. Went to Community Hut 10 am and stopped there all morning\n\nalso having lunch there. At 4 pm went to flat of Mrs Banningarten at 157 Fifty-Seventh St to meet an Australian lady named Mrs Alley. Had nice afternoon tea there and also tasted first scones since leaving Aussie.\n\nLeft 7 pm and tried to get tickets for theatres but all full so went to canteen in 41st St and stopped there for the evening. Left 10.45 pm and walked home.\n\nWhen passing Netherland Hotel an Australian who enlisted in R.F.A. named Capt Beasley (from Mt Gambier) stuck me up and told me to bring the others along on Monday on Tuesday afternoon. \n\nWhen standing on corner at 74th St just before going into house a Yank came along and gave me a cigar. \n\nSnow fell for couple of hours.\n","122":"\n\nUp 9.30 am and went down to hut near Library for breakfast. Stopped there about an hour then came back to 75th St. \n\nAt 12.45 pm Mr Neuningen came for us in his car and took us to his flat at 229 W.78th St having the six of us there. Had a beautiful dinner in this order – Grape fruit, Tomato Soup, Roast Turkey with Jelly, Ice Cream and Chocolate Cake; also Olives, Celery and Radish and Mousseaux Wine and everything served up in a nice dainty way. Stopped talking in the drawing room, having plenty of cigars, cigarettes and sweets – Mitchell giving some Australian songs and also a Gramophone going. \n\nLate we went up to roof and Mr Neuningen taking 12 different photos of us in groups. Then had afternoon tea and at 7 pm tea of cold turkey, Salad, Celery, Jelly, Cake and Fruit. \n\n\t\n\nMr Neuningen took us in his car at 8.15pm to 39th St Theatre to a Dress Rehearsal of \"Penny Wise”, we being the guests of Mr Peter Heggie, an Australian actor. When that finished Heggie took us in two taxis to the Players Club in Gramercy Sq and gave us supper including Wine, Cigars etc. Left there 1.45 am meeting several notable actors, sculptors etc and making an appointment there for next Sat’dy night. Our taxi rides home were also paid for by Mr Heggie.\n\nNice fine clear day but rather cold.\n","123":"\n\nUp 9.30 am, having breakfast about 11 am at Library Hut. About 12 noon went to Dr Holland’s in E.40th St and had to wait for him about an hour. He had another look at me with Fleuroscope and wants me to go to N.Y. Hospital tomorrow at 9 am to have X Ray photos taken. I hinted to him I wanted money but nothing doing, so in the end I asked him straight out and he gave me 2 dollars.\n\nHad lunch then and went and looked over Central Terminal, then came back to hut where we had a special afternoon tea given us by the ladies. We were each given a folding aluminium drinking cup and calendar for souvenirs of N.Y. We also received several invitations to diners and teas at different places. \n\nAfter tea lent Kendrick 2 dollars, he says he has not yet got his money. \n\nNice fine day. Arrived home 8.15 pm and had hot bath then off to bed 9.30 pm.\n","124":"\n\nUp 9.45 am then took some laundry around to Madison Avenue. Then came down to Library Hut for breakfast. Then went for stroll\n\ndown Fifth Avenue and saw thousands of Russians and foreigners near Pennsylvania Terminal waiting for I.W.W. deportees.\n\nHad lunch at 41st St canteen then went for stroll looking at some of the doctors places, then went down Park Avenue northwards. Came back and had tea at Library Hut, then went to 41st St and wrote to Baker St. \n\nNice fine day, fairly cold. Went to bed almost 10 pm.\n","125":"\n\nUp 9.45 breakfast 11 am and lunch 12.30 pm. Mr Neuningen came to us at 75 St 10.30 with his car and showed us the photos he took on Sunday then took us down to the Library Hut in the car. \n\nLeft there at 2 pm and got subway at Grand Central for South Ferry, changing at Wall St. Got ferry about 3.45 meeting there Mrs Pembros and a number of other ladies and gentlemen, and went to Staten Island, about 20 or 25 minutes run. From Staten Island wharf went in tram for about ½ hr to a home for old ladies – all Britishers. \n\nOn the way out saw a motor upturned and the driver pinned down under it, so we turned up the car and pulled him out. \n\nHad dinner there and music and dancing after – kept going till 11.30 pm. When we arrived back in city Mrs Pembros took us to Childs restaurant near Woolworth Building and shouted us supper – she also paid fares for all hands. Left Childs about 2.15 am, taking the Lexington Avenue subway to 77th St and arriving home 2.50 am.\n\nNice fine day – inclined to snow in morning.\n","126":"\n\nUp 10.10 am breakfast 11.30. Fixed up the 3 Aussies who arrived yesterday\n\nwith a bed at our place, then went and saw a Dr to see if he would like to see my heart and pay for so doing. He hum-ed and haw-ed and at last said he would and then forked out a ¼ dollar.\n\nThen went and had afternoon tea at hut and also went to railway administration office and enquired about overland journey. Also went for stroll down Fith Avenue to 23rd St.\n\nAfter tea the 5 of us went to Mrs Neuningens at 7.30 pm and spent the evening, leaving 11.45 pm. Walked home across the park. Started raining after tea.\n","127":"\n\nUp 10 am. After breakfast went to shop in 6th Avenue and had new rubber heels put on boots, for 60 cents. \n\nThen went to Pennsylvania Terminal and asked about availability of transcontinental ticket. They also said journey must be completed in 9 days. Then took elevated train to Battery Place and saw Burnett, the Oceanic Shipping Agent on the 17th floor of Whitehall Building. He is most emphatic that 12 months can be taken re above. \n\nThen took elevated to Courtland St and went to American Express Coy, 65 Broadway and got some illustrated pamphlets for tourists. Then walked right up Broadway to 41st St and had some dinner at 4 pm. Then went down to 200 Fifth Avenue and said goodbye to Hugh Foley of the Reception Comtee.\n\nThen came back to hut and met the other chaps and went to dinner to a Mrs Rowell at 149 E. 40th St. Left there 11 pm arriving home 11.30.\n","128":"\n\nUp 9.30 am. After breakfast went around to Railroad ticket office and fixed up rail ticket overland, taking about\n\nan hour over the job and getting the ticket available for a stopover at any place on route. Then went down to Stage Womens War Relief Office for a Fancy Vest but they are out of them.\n\nThen had some lunch and went for a stroll up and down 42nd St till 4 pm when 4 of us went to the flat of 2 girls we met at Staten Is last Wednesday and had afternoon tea. Stayed there till 6.30 pm then went back to hut and had tea. \n\nShawe and I then went in motor bus from 40th St down to China Town, the Ghetto, and Bowery, arriving back 10 pm. On the way saw the Tombs prison. Went to 41st St Canteen till 11.15 pm then walked to Players Club in Gramercy Sq, staying there till 3.15 am. Had supper and a good time generally, also met several notable men whose names have forgotten.\n\nWent to bed about 4.15 am. Met Mr Christian Bisphan, a famous art critic and Reggie Burch a black and white artist. Heggie and Keightley were also there.\n","129":"\n\nUp 11.15 am then went to Library Hut for lunch. Five of us then went to the Catholic Womens Hut in E 38th St and had free dinner. I then went to Pennsylvania Stn and enquired about the 9.55 am train – decided to go by it to Philadelphia. \n\nThen walked to Anderson Galleries, corner of Park Av and 59th St and saw exhibition of British War Painting, being guests of Heggie and Bisphan. When there met an American artist named Farrar who is a Mason and had good yarn with him. He wanted me to go out to tea with him but could not do so as wanted to pack up, etc. Left\n\nthere at 6.15 pm and took Madison Av tram to our home in 75th St and had tea. The others then went to Amy Castles place, but I stopped home. Miss Dexter gave me letters of introduction to a Senator and Congressman in Washington.\n","130":"\n\nUp 7.15 am and had breakfast at 75th St. Caught bus to Penn Stn about ¼ to 9 arriving at stn 9.15. After getting on train went for stroll along platform when an American Red Cross lady came to me and gave me a carton containing cigarettes and sweets etc. \n\nTrain left 9.55 am. Travelled via Manhatten Transfer, Newark, Bound Brook, Pennington, Trenton Jct, Olney, Wayne Jct, and arrived Chestnut and 24th St Stn, Philadelphia at 12.30 pm. \n\nAn Australian lady related to Stein of Fire Brigade, Melbourne, came and spoke to me, then I went to a Red Cross Lady on Stn and she gave me a note to a Red Cross Place at 1721 Arch St for lodgings for the night – no charge being made. Then went for walk right down Chestnut St and to a W.C.C.S. Canteen at 1342 Arch St and had lunch. Then went to 1721 Arch St and fixed up about the bed – everything being very nice and beautifully clean.\n\nWhen coming into Philadelphia saw Baldwin Loco Works and on way crossed Delaware and Schuylkill Rivers. Streets here very narrow and only having single line trams. Bought picture p\/cards 27 for 15 cents at W.C.C.S. \n\nAfter getting bed went for stroll around the different business streets and also looked over the Pennsylvania and Reading Market St terminal. These two stations, also Chestnut St, have no raised platforms, only a pavement about 9 inches high alongside the rails. Pennsylvania lines\n\nhere are electrified. Coming out of New York this morning had an electric loco as far as Manhattan transfer, thence steam loco.\n\nPosted picture p\/cards to England and Australia. Went to W.C.C.S. at 6.30 pm for tea then down to Chestnut St Stn and got shaving and boot polishing gear from hut boy then off the bed.\n","131":"\n\nUp 7.40 am. Fair fall of snow during night, but not so cold. Had breakfast at W.C.C.S. 1342 Arch St. Then went for stroll around streets till train time. \n\nTrain left 10.35 am, travelling via Chester, Wilmington, Jackson, Havre de Grace, and arrived at Baltimore 12.40 pm. Went to Red Cross Room on Stn and had Coffee and Sandwiches, then one of the ladies took me down to the W.C.C.S. Hotel in Lexington St.\n\nBought p\/cards there – 18 for 15 cents. The lady who brought me to hotel had relations in Tasmania named Murnane. Then went to Post Office which is near hotel and posted the p p cards, then looked around the business streets. Baltimore very reminiscent of Sydney. Went to Camden Stn, where I arrived earlier, and had fried eggs, bread and butter, and coffee in the station restaurant costing 50 cents.\n\nCaught the Washington train leaving 4 pm and travelled via Relay, Jessup, Annapolis Jct, and Laurel arriving Washington 5 pm. Went to Red Cross Canteen on Union Stn and had Coffee and Buns then walked down to Pennsylvania Avenue, passing through the Capitol building under the Dome on the way.\n\nBought picture p\/cards also map of Washington, then came to YMCA near Union Stn and booked a bed for 35 cents. Slight touch of Gastritis came on me after leaving the Station when walking down the streets. Went to station about \n\n8.45 pm and enquired about Pittsburgh trains and got shaving gear etc from hut boy the came back to YMCA and off to bed.\n","132":"\n\nFeeling off colour all night but better when woke up this morning. Up 8.30 am then went to a restaurant near YMCA for breakfast having Steak, Chips, Coffee and Buns for 45 cents.\n\nThen went to Senate Offices to see Senator Colt but he was out, so went to Representatives Offices and saw Congressman La Guardia. Gave him the letter of introduction from Miss Dexter of E. 75th St, N.Y. so he gave me cards of admission to Senate and Representatives also letter to admit me to Bureau of Engravings, Smithsonian Institute and other places. \n\nWhen coming back from La Guardia’s office a burly chap yelled out to me \"Hello Australian” and came up and spoke. His name is Garland a Congressman and he was over in France seeing the battlefields after the armistice. He told me to go to his office and see him if I wanted anything done. \n\nThen called in again to see Colt but he was still out, so went back to YMCA and after reading the paper \"Washington Post” got on a sight-seeing motor bus and drove all around the city, costing 1 dollar. Saw Edgar Allen Poes residence, Quincy Adams ditto, General Grants ditto, also residences of innumerable American notabilities. Also saw the White House, War Offices, Mint, Gallaries, Botanic Gardens, G.P.O., and all public buildings and points of interest. \n\nWent to a restaurant nearby for lunch, receiving a rebate on a\/c of being in uniform then went to the Senate and heard Senator Poindexter speaking against the League of Nations idea. Stopped there ½ hour when coming out an American officer\n\n \n\nand his wife came up and spoke to me and he gave me a ride in his motor car. He took me to the Congress Library opposite the Capital and I stopped there till 4 pm reading English and Australian newspapers. Then went for a walk around the different streets and managed to get lost for a time but eventually found myself without having to ask anyone.\n\nCame back to Union Stn and had a soda then to café for tea, then YMCA and wrote letter to England. Stopped there watching a punching ball display by Ryan who trained Corbert then went to Union Stn and got 10.40 pm train for Pittsburgh. \n\nNice fine sunshine all day.\n","133":"\n\nIn train all night. Travelled via Harpers Ferry, Shenandoah Jct, Martinsburg, Cumberland, Meyersdale, Garrett, Ohio Pyle, Connellsville, West Newton. McKeesport and Bredstock arriving Pittsburgh 7.30 am. Had fair sleep during night. There was a fair fall of snow.\n\nJust before entering Pittsburgh saw several big steel and iron blast furnaces also steel mills. Went down the business streets of Pittsburgh looking around and bought street map and picture p\/cards of place. Also went for walk over bridge crossing Monongahela river.\n\nCaught Chicago train leaving 9.40 am and travelled via Callery, Evans City, Zelienople, Ellwood City, New Castle, Youngstown, Newton Falls, Ravenna, Akron, Barberton, Lodin, Willard (the time is put back one hour at this place), Deshler, Defiance, Garrett and arriving Chicago 9.40 pm. \n\nSnow commenced falling about 6 pm. Had dinner in dining car at 7 pm costing 1 dollar and 1 dime tip to waiter extra. After arriving at the Grand Central Stn of Chicago went to Red Cross Booth and had cup of coffee and bun and also got information about where to stop. After checking kit bag at newsagents on stn walked down\n\nHarrison St to Wabash Avenue to the Columbus Hotel for service men, getting a nice bed for 50 cents per night. Had a nice hot bath and turned in 11.15 pm.\n\nJust as train arrived in Chicago it commenced a drizzling rain also snow falling in between times. The streets of the city are awfully mucky with the snow but temperature not too cold.\n","134":"\n\nSlept real well – up 7.30 am. Had breakfast at the hotel, costing 40 cents. Went for a walk around the business streets and went to top of Masonic Temple – one of the highest buildings in Chicago. Streets very slushy and dirty on a\/c of the snow lying about. \n\nWent to Red Cross Hut just off Michigan Avenue and had free lunch. Bought picture p\/cards when at the Masonic Temple and wrote them when at the hut, also bought small gilt penknife for 39 cents. After lunch again went down different streets also to the Illinois Central Stn and looked over it. \n\nCame back to Red Cross Hut and had tea. As I went in a lady helper there came and spoke to me and she said she was a Melbourne girl but had lived here a long while. She asked me if I met the Castles in New York and eventually I discovered she was Mrs Weber of 4801 Vincennes Av – her address being given to me by Dolly Castles. Am to see her again tomorrow.\n\nIn afternoon a young chap working with the British War Mission came up and spoke to me in Michigan Avenue.\n","135":"\n\nUp 8.30 and went to Red Cross Hut in Grant Park for breakfast. Snow falling all day. Went for stroll around streets till lunch and had\n\nhaircut in Harrison St. Had lunch again at the red Cross Hut then went out to Mrs Webers apartment at 4801 Vincennes Avenue in a motor with her and 2 other lasies. She took us to a picture show for hour or two then went back to her place and had dinner. She came back with me in the tram to Dearborn Ry Stn where I got the California Ltd for Los Angeles leaving 7.35 pm. Am in No 6 Upper Berth. Went to bed 9.30 pm.\n","136":"\n\nUp 7.15 am. Did not sleep too well. Had nice breakfast Porridge, Eggs, Rolls, and Coffee for 75 cents and 15 cents tip to Waiter.\n\nArrived Kansas City 8.45 am and I went up on stn and bought picture p\/cards of place. Left again at 9 am. During night crossed Mississippi River, and just before entering Kansas City crossed Missouri River, also steamed alongside latter for several miles. All black soil about Kansas City – no snow lying about.\n\nStopped at Topeka 11.10 am and there got an apple and post card from Red Cross Lady. Topeka has large railway workshops belonging to Santa Fe railway. At Newton also got an apple from Red Cross, also changed engines there. \n\nWas on platform of observation car at rear for part of the afternoon, and in the club car had yarn with chap in charge of dining car. He is English from Liverpool and was originally a steward at sea, having been on the Adriatic. He was in a boat taking troops back to Australia from Sth Africa during Boer War.\n\nHad nice dinner in evening getting it at military rates. Went to bed 9 pm. Saw great deal of snow on ground in the afternoon. Not too cold.\n","137":"\n\nUp 6 am. At dinner time last night passed Dodge City and in night passed La Junta, the junction for Denver. When having breakfast passed Las Vegas and started going up into the hills which are very rocky about there. Saw great numbers of cattle. Ran into very heavy snowstorm in morning lasting 2 or 3 hours. Put in the morning in the observation car and had good yarn with a Mr Mathews who is a solicitor to Water Board of Los Angeles. He has made an appointment with one there to show me around. He took me into lunch and insisted on paying.\n\nDuring morning passed Lamy, the Junction for town of Santa Fe and at lunch time arrived at Albuquerque, stopping there one hour. Went for walk down streets with Mr Mathews. Snow is still lying all over the country. Passed some sage bush desert, which is inclined to be sandy, after leaving Alberquerque. Bought picture p\/cards at Lamy and Alberquerque, also near latter saw the Rio Grande River.\n\n At dinner time sat near a Chicago manufacturer, so he asked me into his compartment and yarned about Australia and the war for over two hours. Just before entering Arizona saw some most peculiar formations in the hills. \n\nPut watch back 1 hour at Seligman. Went to bed 9.30 pm.\n","138":"\n\nUp 6 am. Mr Mathews took me into breakfast again and paid for the two of us. Sat with him in observation car all the morning. Crossed Colorado River about 6 am, entering California there. Passed\n\nBarstow the junction of Frisco and Los Angeles lines at 11.45 am. Arrived San Bernardino 3 pm and stopped there ¼ hour. Bought picture p\/cards of place. When we left this place we passed thro the orange groves which have Eucalyptus trees as wind breaks. \n\nHave had oil burning locomotives on train since leaving Albuquerque. Reached Pasadena on outskirts Los Angeles 5.30 pm. Mr Mathews said he would take me to his club – the California but it was full up so took my kit bay to his house in the motor then went to a Mr Martins and all had dinner together – 10 of us all told. Had a nice little dinner of Fowl etc – everything American style and sat in front of wood fire till 9.30 pm then took tram to Mr Mathews residence. Then had hot bath and went to bed.\n\nMet all his family, one son just returned from France and 2 daughters and his wife. All very nice. Mr Martins people are all also very nice. \n\nLos Angeles is a beautiful place, all streets being lined with palms and other trees, and streets nicely made and well kept. Near Passadena saw Mt Wilson and Nil Lowe, also the observatory on top of the former. Temperature very mild.\n","139":"\n\nUp 7.10 am. Immediately after breakfast went to Mr Mathews office in Knickerbocker Building per motor and after\n\nyarning for a while to several people I was introduced to, Mr Martin, Sam Mathews and self went for drive by motor to the San Fernando valley; altogether going 33 miles from Los Angeles but altogether must have driven 90 or 100 miles on beautiful roads. Saw great numbers of orchards also the largest olive ranch in the world. Also saw two reservoirs and at one of them had dinner with the men, the food being very good. Arrived back at L.A. 3.15 pm then Sam and I went for stroll round the business streets and I went into the \"Broadway Department Store” and bought stamps for the post cards. \n\nCame out to house about 4 pm and stopped there with Sam. Had dinner 6.30 pm and then went to a picture show in town, arriving back home 10.30 pm. During the drive round by motor saw several film studios, including Fox’s and the Universal, latter being very big – out at Universal City.\n","140":"\n\nUp 7 am – went to Mt Mathews office per motor. Waited there till 10 am then went for motor ride till 2 pm with Messes Mathews, Haswell (the Business Agent of Water Board), and an American ex-officer whose name I forget. We went via Sawtelle, Venice, Redonda to San Pedro – the port of Los Angeles \/ 22 miles away – had dinner in a cafeteria at San Pedro, then came back on the desert road. Was a beautiful ride.\n\nIn the afternoon went for walk\n\ndown the different business streets and bought p\/cards and stamps, map of Los Angeles, and 2 books on Australia for Mr Mathews. Met an Australian who had been discharged from","141":" btn and had come back here to live. \n\nCame back to office and wrote p\/cards, then went out again and posted them and also bought a Colgate shavings stick for 30 cents. Came home to tea per motor and stayed home for all the evening and showed my souvenirs to all the family.\n","142":"\n\nWent to the office per tram with Mr Mathews and at 10 am went in motor with Ebehardt to the Electrical sub-station and was shown over it by a chap named Vogel who once lived in Mexico City. From there went to the library at Hall of Records and saw some books on irrigation etc.\n\nCame back to office then went and had lunch with Mr Mathews at the Boston Café, going on the way to it thro Robinson’s department store. After lunch went in motor to the Park, Museum, and exhibition of Californian products on way passing the mansion of a Californian Oil hump named Dehuey. This morning also saw residence of Miss Talmadge the picture actress and yesterday saw residence of Mary Pickford. Nice fine day.\n","143":"\n\nWent per motor to Office and stopped there all morning talking to different gentlemen I met. Was introduced to a Mr Van Norman who is very much like Jim Brown in appearance. Am going up with him into the mountains next week. Had lunch at a café with Mr Mathews then went for motor ride with Haswell and Sam\n\nout to San Pedro on the hill overlooking the Harbour. Was a beautiful drive in a Cadillac car 7 seater – and very fast. Came back to house and wrote to Mother and the Cockcroft the Shipping Agent of Oceanic Company in Frisco. XX\n","144":"\n\nUp 7.45. After breakfast went for stroll with Mr Mathews – came back to house for hour or so then went to town with him to his office till 1 pm. Met his partner there, Judge Bordwell is his name. Also met Bordwell’s daughter. Both have travelled extensively. \n\nStopped in house reading till 4 pm while the others had a sleep, then went to Mrs Matthew’s cousins place, 15 or 16 blocks from here. Stopped there till 6 pm and walked back home. Went to bed 9.45 am.\n","145":"\n\nUp 6.45 am and went by myself by tram, taking laundry with me. Stopped talking at office for hour or so then went for drive in motor. Eberhardt took me to the City Hall to meet the Mayor but he was out, but met the Chief City Clerk – several other officials. Met the correspondent of \"Express” newspaper and he took some particulars from me. Had lunch with Mr Mathews, Eberhardt and Whitehead, then went for walk down principal streets. Met a New Zealander who was in Sydney on Jany 21st, also an Australian enlisted in American army.\n\nAlso went and saw the Southern Pacific Rail Station. Arrived home 6.30 pm. Visitors in after tea but got to bed 10 pm.\n","146":"\n\nHelped Mrs Mathews to wash up\n\nafter breakfast as no servant now. Started walking down to office but a Canadian civilian gave me a lift into town. He took me to Denzel Hotel to meet a Canadian who was taken prisoner April 1915 at Ypres. Went for walk around streets and met several Canadians, also a Mr Carlyle who has a brother in Melbourne working at the Commerce Building, also he had a nephew in 48th Btn.\n\nIn afternoon went for drive in motor with Mr Haswell out to Van Nuys and Hollywood going via the Laurel Canyon which is very pretty. \n\nLeft my nail scissors to be ground when I arrived back. When arrived home received letter from Cockcroft at Frisco re \"Venture”. This morning went to Oceanic Coy local office and also saw them re the \"Ventura”.\n","147":"\n\nWent to office on tram with Mt Mathews. Left 10 am in a motor with Mr Painter and went out 50 miles to the San Francisquito hydro-electric power station. Went out via San Fernando valley, and had dinner at Sawyers with the men. Went thro some rough mountain country right up to Francisquito Canyon. The water buckets on water wheels each weigh about 300 lbs and there are 20 or 30 on each wheel – wheels each about 15 ft diameter. Power house situated at end of a syphon.\n\nOn way back went right up a gorge and saw the falls where water goes down timber flues – did some real mountain climbing to get up, a false step probably meaning a broken neck in a fall to bottom of gorge.\n\nArrive back at house 5.30 pm after a very enjoyable outing. Very windy all day.\n\nOn way back we ran alongside the railway line and passed a freight train with 5 engines on it – one pulling and 4 pushing at the rear.\n","148":"\n\nUp 6.45 am. Sfter breakfast Mr Martin called with his car and drove us to the office. Mr Mathews left us there, but Mr Martin and self drove to San Bernadino (64 miles) and Redlands, about 8 or 10 miles further on; going via El Monte, Pomona, and Ontario. Went to Mr Martins 17 acre orchard near Redlands and picked some oranges, then had lunch on the car, stopping besides a small creek. Came back to Glendora, Azusa, Arcadia, and Passadena , arriving back at office 4.30 pm. Altogether did about 140 miles, and passed some fine orchards. Saw 3 American observation balloons, also 1 aeroplane up.\n","149":"\n\nWent to office on the tram, talking there till 11 am. Was introduced to a Mr Wizdell the ex-president of a local bank. He was greatly interested in Australia.\n\nWalked around the different business streets till 3.30 pm. Met a Canadian in civilians who is on 17 days leave before discharge, also a N.Z. civilian who has been here 6 years. Also met an Australian who left Melbourne 27 years ago.\n\nAt 3.30 pm went to office and wrote to Uncle Charlie and Baker St. In evening also wrote to Cockcroft at Frisco asking him to reserve a berth on the Ventura. \n\nDuring morning went to Culver the local Oceanic Coys agent, but he has no reply from Frisco yet. Came back to tea in car with Mr Mathews.\n","150":"\n\nUp 6.45 and had early breakfast then went per tram to office with Mr Mathews. Then went on motor with Mr Van Norman and drove to Mojave – 100 miles distant, but really did 150 miles in going out of our way. Went to Saugus then through\n\nBouquet Canyon to Fairmont reservoir, where we stopped 3 or 4 hours on a job. Then went to some cottonwood sandhills 12 miles away and back to Fairmont, then on to Mojave where we are stopping overnight with a Mr and Mrs Walsh. \n\nHad nice dinner there at 6.30 pm. Had lunch at Fairmont with Mr and Mrs Lowe. Lowe is Canadian born and also when there met an Australian named Florence, from Unley – Adelaide. At times did 45 miles per hour on the desert, very seldom travelled under 30 miles. Enjoyed trip immensely, feeling real good.\n","151":"\n\nUp at 6.15 am. Breakfast 7 am. After fixing up carburettor of car we set off at 7.45 am and went 84 miles to Haiwee, where we had lunch with the men. Passed thro’ Little Lake on way, and also near Owens Peak (11 000 ft). Saw cave where some old time bandits made their headquarters. Haiwee is near a mountain about 13 000 feet which is covered with snow. Very strong cold wind blowing. Left Haiwee 3.15 pm and went about one mile to Mr Muriatos house where we stopped for the night. A very big reservoir is just below us.\n\nWent bed 6.30 pm. The reservoir is 7 miles long.\n","152":"\n\nSlept well – up 6 am and had a nice little breakfast. Left Muriatos about 9 am and went 51 miles up the Owens Valley to Independence where are situated the offices of the Water Board.On way passed thro’ town of Lone Pine, and on Lake Owens saw a large Alkali works – the water of the lake being evaporated for the soda.\n\nOn way stopped at a small hydro-electric plant, also at couple places on the canal where men are working. Had lunch at an hotel in Independence, and stopped there about \n\n3 hours. Left there about 3 pm and went to town of Bishop, passing thro’ town of Big Pine and calling at a couple places on the way. Stopped at a stone crushing plant and saw it. \n\nWent to the Clark Hotel at Bishop and had Pork Chops for tea. There are no bars in any of the hotels here – the State being \"dry”. After tea went to residence of Mr Hess, an electrical engineer and stopped till 9 pm, then back to hotel to bed.\n\nYesterday we passed a large extinct volcano, and saw the old lava stream. Passed another one today, and also passed Mt Whitney, 14 502 ft high, the highest mount in United States, also My Williamson the 2nd highest peak. All day today we had the Sierra Nevada Mountains just a few miles to our left hand side, all being covered in snow and a very beautiful sight. On our right at Bishop are the White Mountains, also snow capped.\n","153":"\n\nSlept real well – rather cold and frosty early in morning – up 7 am. Left hotel 7.45 and went by some back roads to a couple of small works and then went on back to Independence and had lunch at Mr Schueys house. Stopped there couple hours then I went in Mr Hess’ car to Lone Pine and Cottonwood Power Station – where we stopped about an hour. Then went on in Mr Van Norman’s car back to Haiwee to Muriatos and had some nice duck for dinner.\n\nWent to bed 8.30 pm. Saw a lot of alkali today – it is almost same as baking powder.\n","154":"\n\nUp 6 am and after breakfast went down to Haiwee where we took on two\n\nladies, 1 child, and 1 other man, making 6 on the car all told, also their luggage.\n\nWent to Mojave where we had roast chicken for lunch at Mrs Walsh’s, then took ladies and child to Rail Stn where they caught a train to Los Angeles. We then went on to Fairmont reservoir and stopped there 1¼ hrs, then went down San Francisquito Canyon to the Power House where we had tea at the mens club.\n\nLeft there 6.45 pm and came on into Los Angeles by moon light, arriving 9.45 pm – travelling about 200 miles for today. On arrival received letter from Cockcroft enclosing two letters from London.\n\nHad bath and went to bed.\n","155":"\n\nSlept well – up 6.40 am. Took laundry with me. Went to office for time then went for walk around streets. \n\nMet chap belonging to Allied Veterans Club and he got me to go round there after lunch. Stopped there talking for about 1 hour. Had tea in town with Mr Mathews, then had look along Broadway by night. \n\nArrived home 10.30 pm. Went for tea to the YMCA Café and there met an Australian girl from Queanbeyan.\n","156":"\n\nUp 7 am. Went to office and waited there till about 11 am then went out for walk. Rained heavily all morning. After lunch went for motor ride with Mr Panter to the River Power Stn, going over via Laurel Canyon and on way passing Charlie Chaplins picture studio and residence. Came back via Griffith Park, which is a very pretty drive, and also went to the Zoo.\n\nAfter tea played draughts with Mt Mathews and Caroline.\n","157":"\n\nWent for stroll around street before going to office and passed a Canadian and a French officer. Also went to\n\nSouthern Pacific Stn and got a seat in Pullman Car to Frisco – 8 am Monday morning – costing 1.65 dollar. Also met a nice Canadian lady for asked if I were fixed up alright, also if I wanted any money. Walked about till 2.30 pm, having lunch at the Boston – then went to office and met Mr Mathews. He then came around with me and we went thro’ some of the department stores. \n\nAfter tea played draughts all evening. Bought some chocolates for the two girls.\n","158":"\n\nStopped home all day reading and talking. Strolled into town before lunch and again in afternoon went in by tram. Nice fine day.\n","159":"\n\nUp 6.15 am – breakfast 6.45 Mr Van Norman called with car at 7.30 am and drove Mt Mathews and Self to Southern Pacific Stn. Train timed to leave 8 am but left 8.30 on a\/c of New Orleans train being late. My seat was in last car just near the observation platform.\n\nTravelled via Montalvo, Ventura (where there are numbers of oil wells), Santa Barbara – which is rather a pretty little town -, San Luis Obispo – where 2 extra engines were put on to pull up into the mountains. Just near this place is a large horseshoe curve on a very heavy grade, and near Santa Barbara saw oil wells right out over the sea. \n\nLeaving Los Angeles we ran down centre of Alameda St for about 2 miles to Continue travelling via Del Monte and San Jose, arriving San Francisco 10.45 pm.\n\nSaw a Traveller’s Aid woman and she sent me to Sunset Hotel in Market St where\n\nI got a room for 50 cents. Had hot bath before going to bed.\n","160":"\n\nUp 8.15 am. Had breakfast at a café near the hotel then went for walk down Market St. Met an Australian lady who is working her way to France to see her brother’s grave. She is nursing here, earning her living. Told me she knew Kemmis who was a dentist at Nyngan and later on killed at Pozieres. His wife is now engaged to the Governor’s aide de camp. She knows a Norah Moffart née Brown from Bourke.\n\nAfter leaving her a few yards further on met a Mr Houston whose wife is a cousin of W Watt the Acting Prime Minister. He has been here 8 months waiting to go on to England. I have to call in to see him and his wife and he will give me a fly around.\n\nHad drink with him then had lunch, then came back to hotel for a rest. Went down street again and met a Canadian Lieutenant, stopping at Marx Hotel and yarned with him for while. Went further along and again met this chap also a Canadian Flying Officer. The Flying chap (named Foord) came over to me and told me he had an Australian named Hawkins staying with him and told me where to find him.\n\nSet out to see Hawkins and on way met still another Australian named Chapman, who is bound for Valparaiso on business.\n\nWent to Red Cross Canteen at Ferry and met Hawkins who is in 47th Btn and was 7 months a prisoner behind German lines. Had tea together at Canteen, then walked to his Hotel, then went to a Vaudeville and Picture Show at the\n\nAlhambra in Market St. Left there 9.15 pm and went to a Shooting gallery and had a few shots at moving picture targets. Then went down to Canteen again and had supper. Left there 11.30 pm, a Mrs Stephenson taking us both to supper. Arrived home 12.15 am.\n\nIn afternoon bought picture p\/cards and map of San Francisco.\n","161":"\n\nUp 8.30 am. After breakfast went for good walk round all the business streets and met some more Canadians and Australians. In afternoon went to Red Cross Canteen and sent picture p\/cards away and also wrote to Mr Mathews. \n\nAfter tea Mrs Stevenson took us in her car to pictures, then to an ice cream shop, then back to canteen for a sandwich.\n\nArrived home 12 midnight.\n","162":"\n\nAfter breakfast went for walk down street and called in at British War Relief in Montgomery St, and to W.C.C. Information Bureau in Market St. Then went to Red Cross Canteen and had lunch, meeting Hawkins there. \n\nAfter lunch we both took tram ride to the Ocean Beach via Geary St, and walked along beach, then went to Cliff House and had some afternoon tea. Saw the seals out on the rocks. Came back by a different tram, coming via the Golden Gate. \n\nOn arrival back went to Hawkin’s hotel and had wash then went to Ivanhoe hotel and met Mr and Mrs Houston and went with them to dinner at a cafeteria. Then went with them to Pantages to Pictures and Vaudeville and then came home.\n\nOn way home met an Australian who\n\nserved with Canadians. He is going back on the Ventura.\n","163":"\n\nUp 9 am. After stroll around went to Red Cross and had lunch with Hawkins. We then both went by No 16 tram for about an hours ride, going thro’ the industrial part of Frisco. Passed all the railway freight yards and shipbuilding yards, also numbers of factories. Came back a different route via Mission St and went back to canteen. \n\nStopped around there till about 8 pm then went home and had bath and off to bed.\n\nAfter lunch rang up Mrs Demarest at Berkeley\/ an Australian lady\/ and have to go to her place on Tuesday.\n","164":"\n\nUp 8.30 am. After breakfast had a bit of a stroll around street then went down to canteen and met Hawkins. \n\nStopped about there till 2 pm when Mrs Stephenson came for us in motor and took us and an American naval ensign for a grand drive up to the Twin Peaks – we went right to the summits of both of them. Then drove on through a forest to the Ocean Beach, going to the Cliff House and seeing the seals again. Then drove thro’ Golden Gate Park, passing several artificial lakes, and went to the Japanese Tea Gardens and had afternoon tea of strong green tea, but did not like it too well.\n\nThe gardens are laid out just as they would be in Japan. Then drove on to the Presidia, passing several forts, and the entrance of the Golden Gate. Also passed the Letterman military hospital.\n\nArrived back to town, and I got my Overcoat, tooth brush and Razor, then we got the 6 pm Auto ferry to Sausalito and then\n\n \n\ndrove 11 miles along a fine concrete road to Mrs Stephenson’s mansion at Ross. Had a nice little dinner then went to a picture show at San Rapael. On arriving back home had some music and supper then off to bed 12.30 am.\n","165":"\n\nUp 10 am. Breakfast 10.45. Had look around garden then – it is very fine. Mrs Stephenson went into town early to meet some troops and arrived back 12.30 pm. She then took us in the car to the Golf Club House, where we had a nice little luncheon. Then drove around the country for a couple of hours, going thro’ a long road tunnel, and eventually arrived at wharf at Sausalito about 4.30 pm when Hawkins and Lowrie left us, going over to town by the ferry. \n\nI drove back to the house with Mrs S and her daughter and had a shave. Some visitors came in and we had dinner 7 pm – Roast Turkey, Crabs, Ice Cream and Chocolate CDake etc etc. Sat about till 10 pm then off to bed.\n","166":"\n\nUp ¼ to 8 – breakfast 8.30. After breakfast wrote name and address in Mrs Stephenson’s Guest Book, also put in an apt remark, then left house 10 am, and caught 10.40 a, electric train to Sausalito – the line being the North West Pacific R.R. Then got ferry across to city, seeing Ventura in the harbour, then went to hotel and booked up for a week.\n\nHad walk down street and went to Red Cross Canteen and had some lunch, also seeing Mrs Stephenson. Wrote letter to Baker St, then went down street again and posted same. Came back to Canteen and had tea, Mrs Stephenson doing the amiable \n\nthen went down street again. \n\nOn way down met Gibson of Foy and Gibson – Melbourne. Have to see him next Friday or Saturday at the Palace Hotel. Also met couple other Australian and Canadian civilians – all ex-service men. Gibson told me he was also going back on Ventura.\n","167":"\n\nUp 9 am. After breakfast went down Market St and bought a \"Sydney Mail” and \"Australasian” at a news stand – costing 30 cents each. Then went to Red cross and had some lunch and after reading the papers posted them to Mr Mathews at Los Angeles. \n\nHawkins and self caught the 1.40 pm ferry to Oakland, thence electric train to Berkeley arriving Mrs Demarest’s about 3 pm. She gave us a drive around Oaklands and Berkeley in the motor, passing on the way the Berkeley University. Came back and had a nice little dinner then went to picture show in the motor. Left there 10.30 pm and on arriving back in Frisco went to Red Cross and had some supper.\n","168":"\n\nUp 8.45 am and after breakfast went down street – on way back met Hawkins and both of us went to Red Cross Canteen. Then went and got our overcoats and after a light lunch got 3 pm ferry to Oaklands, meeting Mr Demarest also going over on same boat. On arrival at his house had glass sherry each, also afternoon tea, then went for long drive in motor to Melrose and Haywood. Came back to the Key Inn and had dinner then went to picture show. Got 11 pm ferry back then went to Canteen and had supper.\n","169":"\n\nAfter breakfast went straight to Canteen and met Hawkins. Started off\n\ndown Market St and on way met Cheffin, Shawe and Kendich. Stopped yarning with them and went to Shipping Office. After leaving them and a little further on met Henshall with a friend of his. \n\nThen went on to Howard St and saw Mr Demarest and was shown over the marine gas engine works. Then went with him to Techans for lunch. After that went back to Red Cross and wrote letters to Muriel and Bruce Hutton. Went down street again and posted same.\n\nThe other three came along to canteen so we all had tea together then went to a lecture at Overseas Club in Sutter St. Left there 10.30 pm then came home and had some supper.\n","170":"\n\nUp 9 am; saw other chaps just as I came back from breakfast. Went down Market St, then back to Red Cross and met Hawkins. Called into Palace Hotel to see Gibson but he was not back from Los Angeles. Then went for walk down the Embarcaders to Pier 37 to see the Ventura, but she has gone to the dry dock. \n\nAfter lunch had boots shined and cleaned nicely then went and did some shopping with Hawkins, buying a cane suit case for 1.95. On way back to canteen met a New Zealander who is one of crew of the Paloona, so I went for walk with him. He showed me some of the old dancing halls in one of the worst streets of Frisco.\n\nMet Hawkins again at 5.30 pm then we both went in Geary St’tion out to 26th Avenue and to 2528 Lake St, to Mrs Clemens and had a nice little dinner with them; then took tram back to Phillimore St and went to a picture show – the main picture \n\nbeing \"Yankee Doodle in Berlin”. It was most laughable. In talking with Mr Clemens found he worked for Los Angeles Water Board for 9 years and knows Mr Mathews and all the others.\n\nArrived home midnight.\n","171":"\n\nUp 9.20 am. After breakfast went to Palace Hotel to see Gibson but still not arrived so left word for him that I would call on Monday. Went down Marsh St then to the Canteen and met the 5 others. \n\nStopped there till after lunch and at 3 pm left with Hawkins and Shane and went with Mrs Stevenson for a long motor drive to the Presidia, Ocean Beach, Cliff House, Golden Gate Park, and down Mission St back to the Ferry. Got 6.50 pm ferry to Sausalito and had dinner at Mrs Stephenson’s about 8 pm. Then we to picture show at San Rafael and arrived back home 11.30 pm.\n","172":"\n\nPut watches forward one hour during the night. Up 10.00 am – finished breakfast 12 noon. Took few photos after, then all got in car and went up to Mr Chipman’s for ½ hour. His place is beautifully situated, overlooking San Anselmo. Then went for long ride in car on top of hills overlooking the bay, coming out near Belvedere and getting on to the road home near Sausalito. Had fine views across bay of Berkeley and mountain beyond it. \n\nAfter cleaning up went down to the Marin Golf Club House and had dinner, meeting there a Mr Cross who is local agent for Burns Philp and Co. Came back home 9 pm and stopped talking till midnight.\n","173":"\n\nUp 9 am. After breakfast played Pianola for while then came to Sausalito in the car and over to town per ferry. Then walked down Market \n\nSt and also enquired about rail fares to New York. Went to Canteen and had lunch and went to Palace Hotel to see Gibson, but could not find him again.\n\nAfter tea 4 of us went to 1000 Union St to Mrs Hardy-Ballance’s flat for the evening and had a fair time. She is a cousin of Sir Rupert Clarke . In her sitting room she has autographed photos of Sir Thos Lipton and Snowy Baker . \n\nArrived home 12.30 am. When there met a Miss Ferguson who lived at Brewarrina some years ago. She is related to Mr Justice Ferguson. Mrs Ballance gave Kendrick the pair of gloves used by Les Darcy used in this last fight here, to be given to his mother at Maitland.\n","174":"\n\nUp 9.15 am. After breakfast started of down Market St, but met a chap who was in Royal Fusiliers, so went and had a drink with him. Then went to Canteen and met other chaps. Also had boots shined and cleaned.\n\nIn afternoon Hawkins and Self went down Market St and I bought pair khaki Trous for the boat at the Emporium. Cost 2.50 pair. When there met 2 Australians who came over on Ventura – one being Fred Thomas a boxer. Few minutes after met a Mrs Swift – another Australian. She told us that there was an Australian girl working at stationery dept of the Emporium, so we went and saw her, and when there met another Australian girl working there.\n\nCame back to canteen for tea then went to the Alhambra – a picture and vaudeville show, but it was very poor. Got home 11.30 pm.\n\nIn afternoon saw movie pictures being taken at foot of Market St – featuring Tom Mix in a picture called the \"Romance of Sleepy Hollow”. \n\n \n","175":"\n\nUp 9.15. After breakfast took Trous down to Emporium and changed them for a smaller pair. Then went to Canteen and met Mrs Stephenson. She took an American officer named Welsh and self for motor drive to Letterman Hospital, Presidio, China Town and some of the back streets of Frisco. \n\nCame back to canteen for lunch and picked up Hawkins and Shaw and went for long motor drive to Stanford University at Palo Alto – 32 miles – passing thro’ South Frisco and Redwood City and San Mateo. On way down saw some large shipbuilding yards. Went and saw the chapel and university and drove around grounds, then came back same route to the Frisco Golf Club House and met Mrs Stephenson. Stopped there ½ hour then drove to Ocean Beach and thro’ Golden Gate Park – leaving Mrs Stephenson at her fathers place in Jackson St.\n\nWent down to canteen by tram and had tea, then went to picture show with Cheffins. Went back to canteen for supper and there met a Sgt Leslie who was a security sergeant at Bourke. He is advance agent here for an Anzac Band.\n","176":"\n\nUp 8.45. After breakfast started for canteen but met Shawe half way and he told me to go back and get my overcoat for the motor trip. Went and got it and started off 11 am. Went via San Mateo, Palo Alto, Santa Clara and San Jose to Lick Observatory on Mt Hamilton, 4209 ft above sea level. Went right up to the top in the car. Had picnic lunch on the way by the road. Ride up was very fine, all the orchards\n\nbeing in full blossom and a nice perfume coming from them. Went to residence of Dr Wallace Campbell – astronomer at the observatory and had afternoon tea then he showed us all over the observatory – seeing the big 36 inch refractor and a spectrograph for photographing light from any given star. Also saw a seismograph and the seismograph record of Frisco earthquake – one of the needles of the instrument broke on a\/c of shock being so great. \n\nLeft there 6.45 pm and stopped about an hour at San Jose for tea and arrived home midnight.\n","177":"\n\nUp 9.15. After breakfast went to Customs House in Washington St and had passport endorsed, then went to Shipping Office and got my ticket. Went back to canteen and met Hawkins, then we both went to Blakes in Geary St and had photos taken costing 25 dollars per doz and an enlargement. \n\nWent back to canteen, had my boots shined then loafed about for rest of afternoon. In morning also bought some sweets and sent to Baker St.\n\nAfter tea met Mrs Stephenson and she and Mr S. took Shawe and self to the Columbia Theatre to a play called \"Getting up”. After that went to Guards for supper then went home.\n","178":"\n\nUp 9 am. Went down street and met Mitchell, Rolfe and Kyle, so took them down to the Red Cross Canteen. After lunch went to photographers and selected 4 proofs – 3 photos from each. \n\nAbout 6 pm met Mrs Stephenson and she took the six of us over to her home for the weekend. Had a musical evening after tea. Rained during morning.\n","179":"\n\nUp 9.45 – breakfast 10.30. Went in car to Mill Valley and got train there and went to top of Mt Tamalpais, about 3000 ft above sea level. Stopped there couple hours, having several photos taken – also had light lunch. I then walked back to Mrs Stephensons with Rolfe and Kyle – taking 1 hr 20 min to go down. Somehow or other we got off the track and came straight down through the bush and hills, landing out on road about ¼ mile from house. \n\nOn arriving back had hot bath then played pianola for almost an hour. Had dinner 7.45 pm. Crabs, Soup, Artichokes, Turkey, Asparagus, Ice Cream, Cake and Coffee – was very nice. Guthrie of Balfour, Guthrie and Coy was also in to tea. Had music after dinner and went to bed midnight.\n","180":"\n\nUp 7.30. After a hurried breakfast went to Frisco by motor and ferry. I went to hotel and packed up, then had my boots cleaned. Then went with Hawkins to the photographers and got our photos after waiting about an hour. On way back to hotel called at Canadian Bank of Commerce and got £12 in Australian notes for 56.40 dollars.\n\nWent to canteen and posted away 3 of the photos and gave one to Mrs Stephenson. The 6 of us then went for a drive to the Twin Peaks, Ocean Beach and Golden Gate Park, finishing up at her fathers house in Jackson St. Waited there while she changed her dress then went to Mrs Hale’s about 2 blocks away, and had music and dancing for 2 hours, also nice afternoon tea. When that finished one of\n\nthe young ladies there took us for a drive in her car to the Presidio and end of Lincoln Highway, then back to town to Curran Theatre, where Mrs Stephenson and Mr and Mrs Sherman entertained us to the play \"As you were”.\n\nWhen that finished went to St Frances Hotel for couple hours for refreshments and dancing. Left there 1 am then went to the \"Coffee Dans” an all night eating place which is very rowdy. When a person entered it the whole crowd bangs on the table with cutlery or crockery – whichever is handy.\n\nAfter leaving there Mrs Stephenson took us home in motor car, arriving at 2 am. When at the St Frances I went out to the lobby and met Mr Dunlop of Edward Dunlop and Co, Sydney . He is also going on Ventura tomorrow. He has been over arranging about David Cup.\n","181":"\n\nUp 8 am then posted photos to England and Mr Matthews at Los Angeles. After breakfast went to canteen and had good boot-shine then met Mrs Stephenson and Hawkins and went down to pier 37 to the Ventura, taking some luggage down. Made another couple of trips as well with luggage getting down the last time at 1.15 pm. Stopped talking on wharf till just before 2 pm.\n\nWhen we got passed Golden Gate about 1 hour after starting we felt full force of gale, sea being very rough. Nearly everyone was sick, including myself, but I could not\n\nbring anything up. Had some tea at 6.30 pm. Went to bed 8 pm. During morning wrote to Baker St.\n\nPut watches back 1 hour when 3 miles out.\n","182":"\n\nUp 6.45 am. Slept very well and feeling good. Sea much calmer. Am in cabin 104. \n\n Harry Lauder is on board also Dolly and Amy Castles and Harry Dearth the English baritone. Was introduced to Lauder on the wharf at Frisco.\n\nWent to bed 10 pm.\n","183":"\n\nUp about 7 am. During morning had feed of gherkins, dates and figs that were given to us by Mrs Stephenson.\n\nSlept about 2½ hrs during afternoon. After tea went to 1st class and had yarn with Amy and Dolly Castles, also some dancing. Then stopped with chap named Fell from Brisbane till almost midnight and had some soft drinks with him.\n","184":"\n\nShowed our passports to the purser during the morning and gave him some information he required. Received passenger lists at dinner time. Had yarn with R. Gibson of Foy and Gibson . He is going to Aussie to fix up some business in connection with his fathers estate. After tea had dance in the first class deck.\n","185":"\n\nNot feeling too good in morning. Felt better during afternoon, but after tea got nasty attack of diarrhoea, lasting all night. Rather hot all day.\n","186":"\n\nSick all night, diarrhoea still bad after breakfast. Got better just before dinner.\n\nSaw numbers of flying fish today. Sea very calm. Just before going to bed saw the Southern Cross in the South. A chap named McKay, son of a Queensland cattle king, shouted drinks for us during the evening.\n\n \n","187":"\n\nWhen we woke up about 5 am land was in sight, so we got up. Steamed along coast for over an hour and arrived at Honolulu 6.30 am. Medical officers came on board and took our temperatures, as there was a case of Pneumonia on board.\n\nWent on shore about 8.30 am and looked around the town and bought picture p\/cards, sending some to England and America. Henshall went to a chap at newspaper office to whom he had a letter of introduction so the chap got a motor car and drove us all over the island. First went to Dudley Battery (a fort), seeing some big guns. Then to Seaside Hotel at Waikiki Beach, where we had our photos taken. Then to Moama Hotel, also on the beach, also around the Diamond Head, which is a large rocky mountain and strongly fortified. \n\nCame back thro’ the town and went to the Palm and mountain overlooking the sea on other side of island. A most wonderful view is obtained from this point – in the valley below it, saw a pineapple plantation of Libby’s. \n\nWhen we came back to town, went to YMCA cafeteria and had dinner of Roast Beef, Crab salad, Oranges and Cream and Paw Paws, also. Tea costing 60 cents. Then went around town again and did some shopping, buying a lot of Paw Paws, also some Hawaiian songs.\n\nGot back to boat 4 pm and watched the native boys diving. Harry lauder had a great reception from the people. Boat left at 5 pm sharp. Bought a khaki shirt for 3.50 which was about double its value. Very warm all day. When it\n\nbecame dark could see both the North Star and the Southern Cross. Now having lovely moonlit evenings.\n","188":"\n\nHot and muggy all day.\n","189":"\n\nHad sleep in afternoon, and a good feed of Paw Paw. Hot.\n","190":"\n\nOnly 5° North of Equator at noon today. Still hot.\n","191":"\n\nHot Cross Buns for breakfast. Rained during night. Father Neptune came aboard 3 pm so we had some fun for about an hour. Crossed equator 1 pm.\n","192":"\n\nSeveral showers of rain during the day – very much cooler.\n","193":"\n\nVery hot and muggy. After lunch had good swim. After tea a heavy rain and thunder storm came over. Made sea little rougher.\n","194":"\n\nSighted Samoan coast about 5.50 am and steamed along it for a few hours. Tied up at Pago Pago wharf about 7.30 am.\n\nThe island is very pretty, being very hilly ad covered with thick foliage. Could not land on account of influenza scare. A large quantity of cargo was discharged, native labour being utilized.\n\nDuring the morning we all went for swim in the harbour on other side of boat from the wharf. The Samoan natives are a very fine looking people, men all being well built and handsome looking. Bought head necklet made by Samoans, for ½ dollar.\n\nDuring the day a motor launch arrived from British Samoa. Had very heavy tropical rain all day. Sailed for Sydney 5 pm. As we left, saw hundreds of Jelly fish\n\njust about at the place where we were swimming. The Samoan Native Police Band played music on the wharf for about an hour in the afternoon. They are very fine. Could not buy any picture p\/cards.\n","195":"\n\nSeveral heavy showers of rain during the day, also passed a large waterspout. In afternoon had game of deck cricket, also a swim. Was fairly hot and muggy all day.\n","196":"\n\nJust after breakfast saw some of the Fiji Islands in the distance – the tops of some round peaks showing above the horizon. About 9 am passed quite close to two of the islands, both being small and entirely surrounded by coral reefs. They were thickly covered with trees, but uninhabited. Name of one of them – Mitchell Island. \n\nHas been quite cool all day. At 12 noon we were 179° 14’ West so passed the 180 meridian about 3 pm.\n","197":"\n\nMissed Thursday on account of passing 180th meridian.\n\nHeavy swell all yesterday and last night. Not quite so bad today. Lovely and cool now.\n\nDarkness comes on very early in the evenings now. At 8 pm had a social gathering on account of it being Anzac Day. Had a concert on the deck, then adjoined to the","198":" class dining room and had a supper and speeches. Was very nice. \n\nSea became very rough after tea.\n","199":"\n\nMuch cooler and sea very rough.\n\nNot feeling too well last 3 or 4 days. After tea wrote to Baker St. Yesterday met a chap on board who lives\n\nat Narbonne Avenue, Clapham Common, London; not far from where I was stopping in Klea Avenue.\n","200":"\n\nLovely sunrise and sea calm. Saw couple of albatrosses during the morning. Beautiful sunset in the evening.\n","201":"\n\nSea much rougher. Name of chap mentioned above and living at Narbonne Avenue is Tom Vallance. He is manager for Harry Lauder.\n","202":"\n\nDid not sleep too well. Woke up 4 am and immediately went on deck and could see Sydney light, also reflection of lights at Manly and Bondi. Got up 4.30 am and entered the heads about 6.30 am. Anchored in Watsons Bay when a Doctor came aboard and took our temperatures.\n\nBoat left Watsons Bay about 9.30 am and tied up to the wharf about 10 or 10.30. Got off about 11 am when Muriel and Mrs Brown met me. Went with Muriel to PB’s and saw them. Went out to Annandale just before tea and stopped there for the night.\n\n"}}