{"Document Name":{"0":"Diary_0260","1":"Diary_0260","2":"Diary_0260","3":"Diary_0260","4":"Diary_0260","5":"Diary_0260","6":"Diary_0260","7":"Diary_0260","8":"Diary_0260","9":"Diary_0260","10":"Diary_0260","11":"Diary_0260","12":"Diary_0260","13":"Diary_0260","14":"Diary_0260"},"Date":{"0":"unknown","1":730.0,"2":731.0,"3":732.0,"4":734.0,"5":735.0,"6":736.0,"7":737.0,"8":746.0,"9":747.0,"10":748.0,"11":749.0,"12":750.0,"13":751.0,"14":762.0},"Entry":{"0":"\n\n","1":" \n\nNotice at 1 p.m. to be ready. Heavy marching order at 3.30 p.m. Paraded 4.15 & after organization moved off for beach, viz., Rest Gully, embarked about 7.45 aboard H.M.S. Mars, small Gun Boat. 5th &","2":" Bgds.","3":" L.H. represented. Closely missed collission with Tug astern of Hospital Ship. Beachy Bill very quiet, no shots while we were near. Bread & Coffee freely issued while supply lasted. Canteen open but sold out by 10.30, snatched couple hours sleep on Gun deck. Good drink hot tea, biscuits & cheese 3 a.m.\n\nNo. 2 Post.\n","4":"\n\nOff Guard 4.30. Tea then to Canteen but could not get to counter before closing.\n","5":"\n\nParade all day 9.15 a.m. to 11, 1.30 to 4 p.m. Weather Cloudy & cold. Parcel Miss Purcell.\n","6":"\n\nParades as yesterday, N.C.O.s special parade during afternoons drill. Y.M.C.A. Canteen but could not get served before closing. Weather still dull & damp.\n","7":"\n\nWeather Beautifull, Bright & warm. On Water Fatigue all day. Canteen after tea, most of which closed. (Xmas)\n","8":"\n\nReveille 6.30. Blkt. Inspectopm later. Bkfst. Bacon & Tea 8 a.m. Tent pitching from 9 to midday. Bread, jam & cheese dinner. Rifle inspection 2 p.m. Cleaning up lines, stones & other litter, & trenching round tent, then off to well for wash. Tea 5.30, Stew, fresh meat & veg’s. Canteen after tea but nearly sold out, home 9 p.m., then turned in. Gale of wind blowing all night.\n\n21s Tuesday\n\nGale continues but changed to rain about 9 a.m. when wind dropped. Bacon & tea. B. Coy. for duty. On Guard till 4.30 p.m., Wednesday.\n","9":" continued.\n\nDestroyers very active especially about dusk, our escort darting from one side to other for some ¼ mile turning sharp, running with us a few minutes then back to opposite side to repeat operations. At 4 p.m. when this escort came alongside signals were exchanged & so close were we that our reply was given by mouth as to number & units aboard (1,700 Australian details). Evening on Poop deck singing & reading, later making this diary up & reading & letter writing.\n\nContinued Blk. Diary opp. 25 May.\n\n26th\n\nRather dull but not cold. Church parade 11 a.m. opp. our own Lines. Leave from midday, visited larger village West Mudros. Busy but very dirty place, plenty eatables, fruit, sweets, etc. but prices very stiff, home to tea spent night in tent.\n\n27th Monday\n\nOrderly Sgt. for day. Woke early to hear rain but day turned out bright later on. Haircut, reading & card playing.\n\n28th Tuesday\n\nWeather keen, but bright sunshine. Mail fatigue,\n\nto Pier about 4 to 6 p.m., late tea & early to bed.\n\nSardines & Sweets\n\n6d.\n\n6d. or Salmon 9d.\n\n9d. & oranges. Clay Pipe.\n\n(Choc. or oranges or Salmon\n\n½ lb Dates\n\n2 Sardines & oranges\n\n9 & 1 lb biscuits.\n\n29th Wednesday\n\nCoy. for Duty. No duty morning. Went to Wells for water after dinner had good sponge bath & general clean. Weather bright morning but dull & cool afternoon.\n\n30th Thursday\n\nWeather bright. Coy. & Batt. drill morn & part afternoon, later Rout march left of camp to Beach, Ships Hospl. and new pier. Good cheap fruit available. Parcel from MacD. Eng.\n\n31st\n\nWeather Bright but dull toward night. Night very sharp and noisy especially midnight when Ships sirens, guns and rockets were in full swing. Lights Out extended till 12.15 p.m.\n","10":"\n\nAwoke to hear rain early morning. No parade \nbefor\n all day. Spent from 10 a.m. till 3 p.m. at villages. No rain falling all day, strong wind sprung up & continued till after Lights out.\n\nJan. 2nd Sunday\n\nB. Coy. for duty, did none all day. Afternoon went taking photos.\n\nJan. 3rd Monday\n\nWeather Fair but Strong bitterly cold wind. Inspection Parade 9.30 a.m. till 11 a.m. by Brigadier & English Staff Officer. Warned for embarkation.\n\nJan. 4th Tuesday\n\nReveille 6 a.m. Bkfstd. and after leaving camp spotless moved off about 7.30 a.m. toward North Pier about 4 miles & embarked the P & O Coys ‘Simla’ about 6000 tons by means of a large Ferry boat whose trip was some 20 minutes throughout a great fleet of ships mainly Warcraft. Rec’d good midday meal, Tinned Beef & Pickles, Bread & cheese. Tea 4 p.m., Bread, Butter, Jam & plenty of tea. Orders read 5.15 p.m. Haversacks issued 5.30. Lights out 9 p.m., still in harbour.\n\nJan. 5th Wednesday\n\nB. Coy. for Duty. Self as Orderly Cpl. Management very bad regarding food issues & much duplication of orders. Weather unsettled & cold wind. Ship still anchored in harbour.\n\nJan. 6th Thursday\n\nShip weighed anchor 1 a.m. moved off 3 a.m. & well out to sea at reveille with small war craft escorting us, later picked up large 4 masted transport & was later escorted by 1 cruiser & destroyer in addition. During afternoon picked up two more destroyers.\n\nFrail 2\/4 – 1 Pineapple\n\nDeCartret 1\/- - 2 Sardines\n\nDicker 1\/- - 2 Sardines\n\nAnthony 1\/3 – 1 Salmon\n\nSargent 2\/- - 1 Pineapple\n\nFalkner 2\/- - 1 Pineapple\n\nSelf – 2 Pineapple\n\nScotty 2\/- - 1 Salmon\n\n5 Pineapples\n","11":" Sardines small\n","12":" Sardines large\n","13":" Salmon\n","14":"\n\nDisembarked by means of lighters at North Pier, Mudros. Grouped up in respective Regiments then rested for ½ hour when orders came. Moved on for about one mile & then got orders to make ourselves comfortable \nfor\n till daylight as no guide for us & no one seemed able to lead us. With all gear moved off for our camp which was reached in a worn out condition after marching about 5 miles. After straightening tents & peging out had combined Bkfast. & dinner 1 meal 11.30 a.m. Visited Canteen for purchases & slept from 2 to 4 p.m. Tea 5 p.m.\n\n"}}