{"Document Name":{"0":"Diary_0118","1":"Diary_0118","2":"Diary_0118","3":"Diary_0118","4":"Diary_0118","5":"Diary_0118","6":"Diary_0118","7":"Diary_0118","8":"Diary_0118","9":"Diary_0118","10":"Diary_0118","11":"Diary_0118","12":"Diary_0118","13":"Diary_0118","14":"Diary_0118"},"Date":{"0":"unknown","1":1477.0,"2":1478.0,"3":1479.0,"4":1481.0,"5":1482.0,"6":1483.0,"7":1484.0,"8":1485.0,"9":1486.0,"10":1487.0,"11":1488.0,"12":1489.0,"13":1490.0,"14":1491.0},"Entry":{"0":"\n\n","1":"\n\nA cold night spent on Kantara Station which we left at 6.30 am in a train made up of all sorts of army stores & niggers. Almost immediately after leaving Kantara (which by the way is an important railhead being used as a landing depot for ships coming up by way of the Suez Canal) the line runs through dismal desert covered with a sparse shrub. The outlook however across the desert of Sinai was – remarkably beautiful on account of the fine sunrise & although the night was extremely cold it began to warm up almost immediately with the rising sun. The road to El Arish is monotonous & uninteresting being practically desert the entire way. The\n\nrailhead across the desert a great achievement being constructed under great difficulties & is the sole channel of supply for the fighting forces which is over 300,000 . The water problem has been solved by the laying down of pipes which bring the supply from the Nile up to the present railhead a distance of over 230 miles. At El Arish we had to change over our goods to a troop train on account of congestion delays. This was the most exciting part of the journey as we had to shift out two truck load of niggers which was only accomplished by the aid of the foot & sticks. We arrived at Kebat at about 6.30 pm.\n","2":"\n\nWe went to Gaza by car & had a look over the ruins of the town which has been practically demolished by shell fire & by the turks looting over scrap of timber, the country is such as to favour a defensive campaign. Especially as the enemy occupied all the high hill & ridges. Roads as in a frightful condition beyond Gaza on account of recent rains by an ingenious idea of laying down wire netting on the desert sands, excellent roadways have been made as far as Gaza beyond here the nature of the ground changes to a clay which has\n\nmade the wire road impracticable so GHQ are now more than 50 miles behind the lines.\n","3":"\n\nStarted on our journey once again had a very unpleasant ride last night on the goods as we were compelled to camp under a number of water carts & the weather blew up very cold & windy, we had alternate snatches of sleep & nightmares owing to the innumerable bumpings buffeting & stoppages. We finally succeeded in reaching Dier Sienade about 2 am & were bumped into a siding to await the pleasure of the unloading gangs, this enabled us to get a little sleep but it was bitterly cold\n\nand windy. I more often laid awake dreaming of home & friends I had left behind me in Australia & tried to feel content. Daylight was thankfully welcomed. Capt Hurley then went to the R.T.O to find out how to get our equipment moved to a place of safety, Dier Sienade is an important railhead & distributing point & there are immense stores of rations & fodder & army requirements. Egyptian labour is employed extensively in fact it would be impossible to do without, & they are very poor workers but the work goes on through sheer excess of numbers, their earning is ½ pt per day & rations. The goods train in which we were to entrain for\n\nEsdud 20 miles distant was timed to leave Dier Sienade at 9 am but after making countless false starts left at 7 pm. We with our burden were camped in an oveper troop truck & I thought what a curious space to be spending Xmas eve in. It was very cold & windy & the arrival at Esdud was welcomed heartily by all! Esdud at present is the existing railhead, we pack our stores in the R.T.O’s tent under shelter when we had a heavy downpour of rain as we could not get a train on again that night we had to find shelter in the Y.M.C.A. tent.\n","4":"\n\nAnother Xmas day\n\nhas passed, another filled with curious happenings. I had only been snugly asleep on the floor of the Y.M.C.A. tent for a few hours when the rain again began to come down in torrents. I awoke with the din of falling rain & was thankful for the shelter of above us but putting my hand out I discovered that the water had overflowed the trench & was coming inside. I gathered up my ground sheet & blankets & awakened my mate, lighting up we found the water rapidly rising so I pitched camp on the table. We slept interruptedly the remainder of the night on account of the high wind which\n\nthreatened to demolish the tents. At daybreak pent up waters on the otherside of the railway embankment broke through & added to the flooded surroundings, it came down towards the tents & rose two feet from the table. I had an amusing lookout over floating objects on a great lake & a line of straggling soaked men making for the highland & this I reflected is Xmas day in the holyland it was decidedly miserable plodding through the deep waters & mud to a sandy slop where we erected a small bivouac & transferred our belongings, a look into the big tent disclosed in one the marque a number\n\nof men drawn up on boxes & crates surrounded by the flood & a wag at the piano playing there is a happy land far far away.\n\nIn the store tent thing were more serious as the waters had damaged a large quantity of perishable goods. Still there was nothing to be done. The rest of the day we spent in the little bivouac looking out over the flooded waters & to the far Judean hills reasonably dry & comfortable & consoling ourselves that it might be worse. The waters have swept away considerable sections of the railroad so that all rail traffic is suspended. The roads\n\nare also practically impassable being deep in mud & flooded.\n","5":"\n\nWeather improved & the glorious sun set about drying up our soaked garments & cheered things up again. The waters on the plains subsided but left a horribly sticky mud behind. During the afternoon Capt Hurley & myself went for a ramble over the sandhills & to the camp of the camel Post, the boundless stretchers of great nothing sand dunes dotted here & there with white tents & rows of camels tethered out in rows impressed one greatly with its uniqueness. On a hill\n\nclose by stands the native village commanding a glorious expansive view over the desert & the lowlands away to the Judean Hills. The colors are wonderful, the whole country is a blaze of beautiful tints. The distant delicate blue mists that veils the hills the brilliant blue of the sky. The emerald of the prickly pear hedges the brown sands, & the gorgeous colors in which the people are dressed.\n","6":"\n\nThis morning we had a walk to the beach to try & get a few pictures & were lucky enough to find thousands of native at work unloading a cargo boats which lay about ½ a mile\n\nfrom the beach, scores of surf boats were plying to & fro, it was a scene of indescribable bustle & noise. Thousands of natives were there unloading the boats & packing the camels or stowing the cargo in great dumps, it is a great boom that we have the ocean so close as the line is held up & communication with supply sources would otherwise be severed returned across the desert these being a wonderful event of which Capt H – took a number of color plates pictures.\n","7":"\n\nA limber from H’dqrs \n\n(now at Dieran) came down to convey us & our equipment from Esdud. At shelter last night & at 10 am this morning we were en route. The road is frightfully cut up & muddy from the recent rains through which the springless lumbers bumped & ploughed a foot deep in mud, coming towards us are numerous groups of the tiniest donkeys imaginable laden with great sacks of oranges. Their Bedouin owners are dressed in wonderous colors & look far more capable of conveying the loads than the donkeys. It is astounding what these donkeys will carry. Here comes a fine example of indolent \n\nlaziness. Typical of these treks a great fat bearded object that must weigh at least 15 stone, riding on the haunches of a tiny white animal so small that the gipo trails his feet on the ground. The wadys have been running bankers during the recent rains & our limbers bumped into their stony beds axels deep. Still it was all so very unique to me that I forgot the discomfort & the juicy oranges & bully gave it the air of a picnic. Almost every object ones sees has some biblical history or recent associations that held me fascinated.\n\nHere & there are great dumps left by the turks during his retreat. We passed through the interesting village of Yebrica built on the top of a lofty rise, its mud huts & walls looking from the plain lik a swallow rookery. The prickly pear bounded roadway that leaves the Villages is alive with inhabitants. Women bearing the water beakers on their heads as they did from the times of history, the men with their asses carrying immense loads & the noisy children crying for baksheed.\n\nAbout five miles from Yebrica we drew into Dieran where the desert T’port Corps at present have their Hdqrs between this pretty village & the\n\nnative villages through which we have passed. It inhabitants are principaly Jews & their clean well built houses at once transports me to the outlying areas of Mosman Bay, Sydney. The outlying walls are of stone generally painted white & the house are roofed with red tiles, the streets are well kept & avenued with Aust Gum trees & Aust troops wander in the streets, we camped that night in the town hall Dieran.\n","8":"\n\nAt 10 am we started with a Mjr Love to pay a visit to the 10th LH which are in rest close at hand, we had a delightful ride through a venues of P pear & by pictorial villages & visited the battlefield of Mughar. Here the Yeomanry\n\nmade a famous charge & carried an apparently impregnable position but with great sacrifice over fourty horses lay here in a small group & one may still trace the path of that glorious charge by the littered plain of dead horses.\n","9":"\n\nWe proceeded by motor to Sector & from their by car to our front line position called Khansbetha Ibn-Harith.\n\nWe stayed with the 3rd LH Bdge Hdqrs now & again the chatter of a Gun echoed down the valley & an occasional snipers rifle rang out but this was all. We called in at various outposts but all was quiet. After dinner that night Capt H gave a few words about his Antarctic experiences which was\n\nappreciated by all.\n","10":"\n\nAn so on the last day of the year I find myself way out on the hills of Judea taking part in the campaign against the turks at K – I – H. A is a time when all past memories crowd on me, thoughts of home & dear ones & of when I shall see them again. Have been out most of the day & as I am dead tired am now going to turn in for the night.\n","11":"\n\nThe new year broke with heavy rolling clouds & stormy winds & in a few hours time it began to rain as hard as it could, we were washed out of our\n\nbivouac & Johnson saved the situation by discovering a limestone cave into which we moved & as we had to cook our meals in the same cave we were nearly smoked out for the time being but better the smoke that a wet shirt so we thought.\n","12":"\n\nThe camel Tport arrived at camp at 7.30 am & all our gear was packed up for a move. The roads are quagmires & extremely bad for camels, their padded feet slipping & sliding so that with the regulation load of 300 lbs on the poor beasts are absolutely helpless. Scarcely better off are their native drivers, these destitute beings have little or no shelter during the rains with the\n\nresults that numbers perish through cold & exposure. The entire Bdge left El Burg at noon & moved of in section column the great serpent, over rocky defiles & plain made a very impressive spectacle. The distant travelled to our nearest camp was twelve miles – a long track of slipping, slimy mud, the Bdge drew into camp just before dark & are to move pff again tomorrow at 9 am.\n","13":"\n\nWe left the 3rd Bdge camp at 11 am. With a lumber for our baggage with horses for Capt H & myself & after a ten mile ride we arrived back at Dieran where we again took up our residence for a few days.\n","14":"\n\nWe left Dieran this morning in a box brd car for Erdisd. The roads have dried up considerably but the wadies are still boggy & we struck several times. Just outside the V of Mughar we had Magneto trouble which prevented us going further untill a reserve car cam to our assistance. In the meantime we visited the native V of M- & secured a series of pictures. The village is built on a steep hill which raises from the plain & is by far the most pictorial I have visited. The houses & huts are built entirely of mud & stone, very little of the latter, flat roofed & squalid. In the small courtyards are kept considerable number of fowls. A string of camels\n\nwinds its way through the narrow streetway, their color nearly matching the brick walls (brown). Their drivers dressed in light blue dungarees, along they move stately & dignified out of the Vil along the green prickly pear hedged road & away into the yellow sands of the desert, there must be at least 500 of them. They are all heavily loaded & are moving forward to the front line dump. Hail to the gipo without them progress against the turks would have been slow indeed. \n\nAfter waiting about four the relief Car came up & conveyed us to Beit Duras a charming native village with atrocious roads & where we struck feet in mud, half the\n\npopulation came out & gave us a hand to extricate the ford car from the mud, they pushed kneed deep in mud our skidding wheels sending mud flying like a Catherine wheels. The gipos made neat fun of it & put us on the road to Esdus wher we attived half an hour later. After exiting our tent we had a good hot tea & laid down in our blankets talking over the trials we had had getting our equipment about the country.\n\n"}}