{"Document Name":{"0":"Diary_0475","1":"Diary_0475","2":"Diary_0475","3":"Diary_0475","4":"Diary_0475","5":"Diary_0475","6":"Diary_0475","7":"Diary_0475","8":"Diary_0475","9":"Diary_0475","10":"Diary_0475","11":"Diary_0475","12":"Diary_0475","13":"Diary_0475","14":"Diary_0475","15":"Diary_0475","16":"Diary_0475","17":"Diary_0475","18":"Diary_0475","19":"Diary_0475","20":"Diary_0475","21":"Diary_0475","22":"Diary_0475","23":"Diary_0475","24":"Diary_0475","25":"Diary_0475","26":"Diary_0475","27":"Diary_0475","28":"Diary_0475","29":"Diary_0475","30":"Diary_0475","31":"Diary_0475","32":"Diary_0475","33":"Diary_0475","34":"Diary_0475","35":"Diary_0475","36":"Diary_0475","37":"Diary_0475","38":"Diary_0475","39":"Diary_0475","40":"Diary_0475","41":"Diary_0475","42":"Diary_0475","43":"Diary_0475","44":"Diary_0475","45":"Diary_0475","46":"Diary_0475","47":"Diary_0475","48":"Diary_0475","49":"Diary_0475","50":"Diary_0475","51":"Diary_0475","52":"Diary_0475","53":"Diary_0475","54":"Diary_0475","55":"Diary_0475"},"Date":{"0":"unknown","1":1908.0,"2":1909.0,"3":1910.0,"4":1911.0,"5":1912.0,"6":1913.0,"7":1914.0,"8":1926.0,"9":1927.0,"10":1928.0,"11":1929.0,"12":1930.0,"13":1931.0,"14":1932.0,"15":1933.0,"16":1934.0,"17":1935.0,"18":1936.0,"19":1937.0,"20":1938.0,"21":1939.0,"22":1940.0,"23":1941.0,"24":1942.0,"25":1943.0,"26":1944.0,"27":1945.0,"28":1946.0,"29":1947.0,"30":1948.0,"31":1949.0,"32":1950.0,"33":1951.0,"34":1952.0,"35":1953.0,"36":1954.0,"37":1955.0,"38":1956.0,"39":1957.0,"40":1958.0,"41":1959.0,"42":1960.0,"43":1961.0,"44":1962.0,"45":1963.0,"46":1964.0,"47":1965.0,"48":1966.0,"49":1967.0,"50":1968.0,"51":1969.0,"52":1970.0,"53":1971.0,"54":1972.0,"55":1973.0},"Entry":{"0":"\n\nTuesday Feb.18.1919.(100)\n\ncontinued from \n\nBook 12.\n\nI am going on leave tomorrow. At 2.30 today drew £8 and in addition was paid £2.16.0 ration money for 14 days leave. No free railway passes are issued now, but ration money is paid instead, which for those who have only a short journey to go is much better but in my case it will probably take it all for fares. I paid to the Furlough Sargeant 14\/- for fare to Belfast. There I will get a return ticket to Kesh or Pettigo. Also a single ticket to Glasgow & from there a single ticket to Weymouth, Unless I alter my programme on the way.\n\nThe Germans have signed Allies New Armistice Terms. They are to give up all offensive operations against the Poles. The armistice of Nov.11 prolonged by the agreements of Dec.12 and ","1":" is prolonged indefinately, but the Allied Powers reserve to themselves the right to break of the agreement at three days notice.\n\nThe carrying out of the agreements of Nov.11, Dec 12,\n\nand Jan 16 shall be continued and completed if this has not already been done\n\nI was at a lecture on \"Thought reading \" tonight in the Y.M.C.A.Hut by Mr. Capel. It was a very interesting and amusing. \n","2":" Feb.19.1919. 101.\n\nCloudy with occassional showers. I was up about 6. this morning ,had an early breakfast & was ready to go on leave at 8.a.m. from the Orderly Room.\n\nWe were driven to Weymouth station in a motor van. The train left about 9, and we passed through Dorchester Southampton, Winchester and numerous other stations arriving at Waterloo before two o`clock. From there I took the tube to Euston changing at Charing Cross and waited there for a boat train. I spent the time in a large showroom containing models of engines, t\n\nhe King Saloon a sleeping car and a steamer \"The Grenore\"\n\nThe boat train left at 4.45 for Fleetwood in two divisions. We were on board the steamer, The Duke of Cumberland\" by 11 o`clock, the train coming to the ships side, and were soon away.\n","3":" Feb.20.1919. (102)\n\nSecond day of leave. Belfast.\n\nThe boat arrived at the warf in Belfast about 6.30. We went over to a free buffet run by the ladies of Ulster and had some breakfast. Then I went to the \"Service Club\" and stowed my kit there with the intention of having a look around Belfast.\n\nThe big strike in the shipping yards of Belfast ended today and the men started work this morning. I followed the big stream of workers to Harland and Wolff`s yards and as no admittance was available today I went over to Workman`s Clark & Co. Ltds yards where the men had started work & I was admitted.\n\nI went through the machine shop & where large machines were punching drilling and shearing ships plates. Then through the smith`s shops where pipes, & irons were being bent, shaped & fitted for ships. There was an oxygen – aceteyline flash at work welding joints bends & angles on pipes for various sizes. It was very quick & effective. \n\nI returned by tram to the service club in Waring St.\n\nwhere I had dinner and at 2.45 caught the train for Kesh at the Great Northern Station.\n\nIn Workman Clark s Co yards there were 3 big ships on the slips being built and in the other 1 big ship, but there may have been many more for I was not in their yards.\n","4":" (103)\n\nThird day of leave.\n\nI reached Kesh at 7.30 last night, and walked down the line about a quarter of a mile to my Uncle`s John Gilmors. I had to change trains at Clones and Bundorn junction.\n\nThis evening I walked out to Mr. Andrew Muldoons at Drumard and stayed until after 8. o`clock and walked back to Kesh. It was a very dark night. The flax mill was working in Kesh, scutching flax which consists in removing the fibre from the stalk,The machinery was driven by a water wheel. Last year when I was here, the mill was sawing timber but now it has gone back to its old trade.\n","5":" (104)\n","6":" day of leave.\n\nIt is very dull and cloudy this morning, & look like rain.\n\nI had a walk around Kesh this morning and in the evening pruned some fruit trees for my uncle. Later I was up at Mr. Morrisons a neighbour, who lives near the butter factory.\n","7":" 105\n","8":" day of leave.\n\nA nice pleasant day.\n\nThis morning my uncle &I went to Tubart church. It is a large stone building , a little over a mile away. There is an orphanage & school attached to the church, and a complete Farm with all the necessary buildings which are built of stone and are of large dimensions and very substantional. The whole is managed by the Governor`s of Vaughan`s Charity. The Minister is paid £200 a year & a school teacher is also employed. The Minister is Mr. Stacks and his father officiated here 50 years ago. \n\nOn the way back to church a funeral overtook us at the cross roads – an influenza victim and the last of the family – only the father remains by name Mc Guire.\n\nMonday Feb.24.1919 (106)\n","9":" day of leave.\n\nThere was a heavy frost last night but it is a very beautiful day.\n\nI went to Pettigo this morning by the 9.30 train and spent most of the day in\n\nPettigo where there are now two of my cousins living. Kitty and Bella Martin. Later in the day my Uncle and Aunt Martin came in to Pettigo, for it was Market Day, and I went out with them to and stayed there for the night.\n\nTuesday Feb.25.1919. (107)\n","10":" day of leave. There was another severe frost last night. I wrote to Cis this morning and also to Lizzie No 159. 3x My cousin Tom drove me into Pettigo this evening,& my cousin Barbara also drove in with us. We travelled in an Irish Jaunting car. \n\nI stayed a liitle while in Pettigo, and saw Bella & Kitty there, also their cousins the Shaws who have the saw & corn Mills there which I was shown over yesterday. They accompanied me to the station & caught the 10 past 6 train for Kesh, arriving there about 6.\n\nWednesday Feb 26.1919. (108)\n","11":" day of leave, another fine day. I walked out to Coolaness, this morning about 3 miles from Kesh & 1 from Irvinstown. I spent the day there with Mr. and Mrs Riley and in the evening caught the\n\ntrain at Irvinstown for Kesh, after spending a very enjoyable day at Coolaness.\n\nThursday Feb 27.1919. (109)\n\n9th day of leave. A very beautiful day. The weather is remarkably fine. This morning I finished pruning the fruit trees for my uncle Gilmore, & after dinner helped him to cart in two loads of hay from the paddock the shed. Then I walked out to Brumard to again see the Muldoons, and was back at Kesh soon after 9 oclock.\n\nFriday Feb.28.1919 (110)\n\n10th day of leave.\n\nI am 3 years in the army today. It is a long 3 years. I was up this morning at daylight had an early breakfast and caught the 7.30 from Kesh to Bundorn Junction changed there for Omagh which I reached in about an hours travelling. Omagh is a town as large as Enniskillen with at least 5 churches and a large magnificent courthouse. It has a butter factory with a very large turnover. Mr Gibson late of Kesh is the manager,, the factory employs 5 or 6 girls.\n\nIn the afternoon I had a look around Omagh and stayed at the Gibsons for the night.\n\nSaturday March 1. 1919 (111)\n\n11. day of leave. How the time flies. The winter will over before I get away to Victoria. However it is a very mild year & the most of the winter is gone.\n\nThis morning I sent P.C. of Irish scenery to the following, Cis,, Lizzie, My Mother and Mr. Murphy of Nerrigum, and Annie Kennedy.\n\nI left Omagh today by the 12.30 train for Enniskillen. A`s my ticket would only take me as far as Bundorn Junction , I went the rest of the journey with out a ticket because the train did not stop long enough for me to procure a ticket. At Enniskillen I walked through a door where there was no porter and had nothing to pay. \n\nI am returning tonight by the 6.30 train for Kesh. I have had a good look round Enniskillen but unfortunately it is a dull cloudy day with occasional showers. I saw Kitty Gilmore. She is looking well & boarding at the same place – Mrs Creswels, Kitty Gilmore came with me to the station and saw me off on my way to\n\nKesh. I had to buy a ticket on my way from Enniskillen to Bundorn junction, when I changed to the Kesh line arriving at Kesh about 8 and walked down the line to my Uncles house.\n\nSunday March2.1919 (112)\n\n12 day of leave.\n\nIt is a showery and cold day and not very inviting to go out of doors. A young man named Bob Brandon was here this morning. He is a descended of George Brandon who was an employe of my Grandfather Gilmore. \n\nI went for a short walk this evening to the top of a high ridge from which a good view of Loch Ern could be obtained.\n\nMonday March 3. 1919 (113)\n\n13th day of leave.\n\nI was up very early this morning and caught the 7.30 train. My uncle accompanied me to the station to see me off & wished me a safe journey to Australia. I was at Bundorn junction at 8 where I changed to the Omagh line which is a quicker route than the Enniskillen line.\n\nAt Omagh I changed again on to the Dungannon line and passed through Pomroy and Dungannon which is a fairly large town with a big railway station and joined the \n\nEnniskillen line at Portadown and thence on to Belfast which was reached by 11 a.m. Near Portadown the train passed along the south shore of loch Neigh which is a magnificent spectacle stretching away as far as the eye can reach.\n\nIn Belfast I left my stuff at the Service Club for Soldiers and Sailors. Then. \n\nI walked to 23 University Square to see my cousin Maggie Martin. It was a great surprise to her for she did not know I was in Ireland and had never seen me before. I had dinner with her & the other two girls and in the afternoon, she showed me around Belfast. It is a city of churches,Presbyterian, predominating but all sorts are represented. Magnificent public buildings are there by the score. The City Hall is the finest building in Ireland. Around the city there are scores of linen Factories affording employment of men and women for Belfast is the centre of the linen trade – But there are other factories such as distilleries, Breweries and bottle works. I shouted tea at a Restruant and at 8.30 she saw me off on board the\n\nDuke of Argle, but she did not sail until about 9.45, I obtained a good collection of Belfast Post Cards. It was a fine night and I had a good passage over to Fleetwood, We were held up outside the harbour for 2½ hours waiting for the tide to rise then a long wait in the train on the pier for the mails to be loaded during which time I had some breakfast 3d for a cup of tea, & 4d each for sandwiches. The same extortionate prices were charged on board the steamer. – 1\/- for a small bottle of stout & 1\/6 for a large glass of whiskey.\n\nThe steamer was again crowded, in fact there was not sufficient room for all down below and many stayed upon deck all night including women and civilians. Eventually the train started, but it was near 10 am and we passed through Preston, Wigan a coal mining town, Warenham ? and Crewe we the train stopped for dinner. Then through Rugby & many other town until we came to the terminus at Euston soon after 4.p.m.\n\nmaking a rather quick passage in a fast train for the journey in about 400 miles. At Euston I had some tea on the afternoon of\n\nFriday March 4.1919 114\n\n14th day of leave. I have to be back in camp tomorrow by 3 o`clock. I wrote up these notes at the Euston Y.M.C.A. and then I went by motor bus to Baker St and spent over 3 hours in Madam Tussauds waxworks and exhibition a really marvellous place. There are models of all the worlds celebrates, soldiers, sailors, Kings Queens, Princesses and statesmen also convicts , criminals, murderers, down in the chamber of horrors also instruments of torture. \n\nAmong the modern statesmen and other celebereties are Horatio Bottombley the sufferagest, the Kaiser, Cpt Fryart, Nurse Cavill and a host of others. The Hall of Tableaux represents many great scenes from history, such as the death of Nelson, the execution of Mary Queen of Scots, King John\n\nsigning Magna Chartache. There is also a childrens` gallery & a picture show and an orchesta in the Grand Hall and a Napolean Gallery. Among the curios are some of his carriages and portions of his uniform & a tooth.\n\nI left Madam Taussards exhibition about 9.30 and caught a tube train at Baker Station for Paddington and stayed at one of the Y.M.C.A. huts in Clevland Square.\n\nWednesday March 5. 1919 115\n\n15th and last day of leave. I had breakfast at one of the Y.M.C.A. huts, and leisurley walked down to Paddington Station and caught the 10.15 train for Weymouth in one of the South Western trains passing through Westbury, Frome, Yeovil and Dorchester staying for a few minutes at all these places and running through all smaller towns, reaching Weymouth soon after 2. It has been raining all day, I had dinner at the Weymouth Soldiers & Sailors Home and took a motor out to Monte Video camp\n\nwhich I reached about 3 O`clock, and reported to the Company Office & the Furlough Office. All the beds in No 6. hut are full so was put in No 4.hut. This evening I received a packet containg 3 letters from Cis dated Nov.25. Dec.20, and Dec 27. Also 4 letters from Lizzie 168. Dec 1 written from Melbourne and three from Merino without numbers dated Dec.10. Dec 19. And Nov. 23. Nov 1. 67 written from Melbourne. Cis told me that the children received the parcels, cards & also the water bottle arrived safely. Lizzie told me in her latest letter that her brother Nic had died suddenly at Mount Gambier in December and that her & Frank went by rail to the Mount.\n\nTom Lee and W. Williams were sent back to Australia while I was on leave. Lynch is still in hospital.\n\nThursday March 6. 1919. 116\n\nA fine day.\n\nMen returning from leave were picked for guard to day. I and Perks were two of them. We go on at 4 O`clock to day and finish at 4 tomorrow. This morning I paid 3\/- into the 2.U. store for 4 oz of Havelock tobacco and 100 cigarettes duty free. They\n\nwill be delivered on Friday week.\n\nFriday March 7.1919. 117\n\nA wet miserable day. \n\nThe early part of last night was fine but it commenced to rain after midnight. My post was No.3. The first shift 8 to 10, second shift 2 to 4, third 8 to 10 and fourth & last 2 to 4. No. 3 Post is guarding the coal dump which is securely fenced in. There is a sentry box for shelter for the guard in rough weather. This afternoon is one of the coldest & wettest that I have seen here this winter.\n\nSaturday March 8. 1919 (118)\n\nThe weather changes here with remarkable suddeness. Last night was bleak wet and stormy, today the sun is shining brightly and it is delightful out of doors.\n\nI was working in the workshop today, but it was 10.30 before I could get to work, owing to having to report at the company office do same fatigues in the Sargeants Mess etc. This afternoon being Saturday is a half holiday.\n\n I wrote to my wife letter 160, 5 pages. \n\nThere has been a big riot among the Canadians at Kimmel Park Camp in North Wales. There were 5 killed – 3 rioters and \n\ntwo pickets , and 21 wounded including 2 officers. The cause of the riot was dissatisfaction in the demobilisation methods & delay in sending the men home.\n","12":" (119)\n\nShowery this morning but fine at midday.\n\nI was on cooks fatigue for an hour this morning in No 4 and 3 companies Cook House.\n\nToday I received a letter from my wife dated Jan7. & written at the Lakes Bridgewater also a letter & P.C. from A. Kennedy \n\n I wrote to Kitty Martin, Maggie Martin and Annie McKinly today. I also wrote to my wife again today, letter 161. \n\nI was in Weymouth tonight with Pte. Perks & Gnr.Lynch for a walk.\n","13":" (120)\n\nCold & cloudy , looks like pair Perks & I are again on guard tonight. There is a great scarsity of men in No 2 company for duty. There are a few new men coming into the company today, & a few came in last from the hospital. They will be available for guard.\n\nI returned a book I borrowed from the Educational office on Saturday entitled \"Stamping forging & General Smithing. I have finished reading \"Dinkum Oil\" a volume of original Australian wit & humour by \" The Twinkler\". Fred.J.Mills.\n","14":" 121\n\nVery wet and stormy last night and again today. I was lucky enough to get second relief on No.1 Post which is in front of the Orderly room and guard room door. It is a sheltered Post and veranderd for a beat in wet weather. My hours were from 6 to 8, 12 to 2 last night and this morning from 6 to 8 and from 12 to 2\n\n I wrote to my Uncle Gilmore today with duty. \n","15":" (122)\n\nA cold wintry morning. I am again in the educational workshop today making splints of mild steel. I wrote a long letter to Cis tonight telling her about my trip to Ireland. 6 Pages. I have a late pass tonight, but as it was a rough evening I did not go out. Men finishing guard are entitled to a late pass from 2 p.m. to 11.30. The Education officer when he found out that I was doing guard wrote to the C.O.of No 2 Company protesting against it, & asking that I taken off it & all fatigues.\n","16":" 123\n\nA showery day. I was working all day in the workshop making leg irons for patients\n","17":" 124\n\nThere was a parade at 10 am today for all No 2. Company for a medical inspection to ascertain whether the men were fit to travel on a troop ship or a treatment ship \n\nI saw driver Dave MacConnel of the 40 Bttn Transports. He had an arm and leg broke last year by a Hun bomb. His hand the right is not better yet and it will never be strong enough to work at his trade of blacksmith. He is going away on a boat early on Sunday morning.\n\nToday Major Lewis who passed us for travel, gave me a suggestion for inducing sleep. I have lately been sleeping very poorly. I had a little sleep tonight in fact I felt sleepy before going to bed.\n","18":" 125\n\nA fine day.\n\nYesterday and today I was working in the workshop. Tonight I am on canteen picquet from 6 to 9. It is a good job. As long as I am on the Educational Stunt I will have no more guard duties to do. This evening is the usual weekly half holiday.\n\nI returned a book to the Educational Library \"A Class book on Organic Chemistry\" by J.M.Cohen, and received\n\nanother one \"A school Gemetry\" by Hall & Stevens.\n","19":" 126\n\nA fine day. I went for a long walk the morning as far as Fleet House and came back by Chickerell. This evening I finished reading \"The Taming of John Blunt\" by Alfred Ollivant, a rather interesting novel, dealing with the life of a recluse. \n\nEarly this morning seven hundred men were sent away from camp to go aboard the Tyarvitch for home. Driver Mc Connel of the HO was one of them & Kelly a 1915 man & it is doubtful if he ever saw France was another. He went as an hospital patient.\n\n I received a letter from Maggie Martin, Belfast. \n\nThis evening I was in Weymouth and went to the Congregational Church and heard an army chaplain preach. After the Service there was a social in the schoolroom under the church, which is specially got up for soldiers. There was a programme of sacred music & tea & cake for the soldiers. This is continued every Sunday night & I only accidientally heard of it today.\n","20":" March 17.1919. 127\n\nA fair day. This is St. Patricks Day and some of the soldiers are floating a little bit of green ribbon. I was again working in the smiths shop today making splints.\n\nAn attempt was made to get me on guard tonight. I was told to parade at 4.p.m. as an emergency man, but I did not go.\n\nMy sister Marther is 3 years dead. She died about this time in 1916, when I was at Seymour. I wrote to my wife this evening letter 162. \n\nI was at the pictures tonight in the Gynasium. They were very good.\n","21":" 128\n\nDull & cloudy, but fine. I sent a P.C. to my mother and also to Tom Douglas today. The Australian mail closes today. There is likely to be a big general strike of the miners in U.K. on the 22nd, unless their demands are conceded. There is a big conference going on to induce the miners & mine owners to come to terms.\n\nI was at a lantern lecture tonight in the M.C.A. by Mr. H.H. Palmer on \" A days routine in the Navy.\" The pictures were interesting but the lecturer was only an ameture.\n","22":" 129\n\nLight misty rain all day and also last night.\n\nThere was a debate in the Y.M.C.A. hut this afternoon on Should the Returned Soldiers Association be Political\". There was a good attendance and several speakers spoke on both sides. \n\nTonight I was at a picture show in the Gynasium.\n","23":" 130\n\nOccasional showers throughout the day.\n\nI did not go on parade this morning at 9.a.m. because the previous 3 mornings I was warned for guard and had difficulty each time in getting out it. By absenting myself I escaped being warned. I was at a very good concert tonight in the Y.M.C.A..\n","24":" 131\n\nA fine day.\n\nLast night I heard that I was marked A.W.L. in the Guard Room, but today I have heard nothing about it. I was again detailed for guard this morning, but did not go on parade this afternoon , as I was very busy in the work shop. The Educational Officer asked me if I heard any more about guard, & told me not to go out.\n","25":" 132\n\nDull & cloudy. There were a few light flakes of snow this morning & again in the evening.\n\nThis being the usual half holiday, I went into Weymouth for the afternoon had tea at the Soldiers & Sailors club opposite the Railway station & was back about 9.20\n","26":" 133\n\nThe wind is bitterly cold to day. Light snow fell in the morning for a little while.\n\n I wrote to Maggie Martin this evening. I wrote to my wife a short letter, 163 and enclosed 2 post cards. \n\nVery early this morning a large batch of men were sent away from this camp to go on board the Czar for Australia, another batch will be going on the Port Denison. \n\nTonight I was at church at Chickerel. There was only a local preacher – congregational. After the service the choir came to the Y.M.C.A. and sang a number of hymns, & an official of the Y.M.C.A. gave a short address on love being the greatest power in the world.\n","27":" 134\n\nA fine morning. I was up early this morning and had a hot bath. The education officer Mr. A.Wollard is leaving Monte Video to morrow to act in a similar capacity on board a troop ship. I was detailed for guard this morning.\n\nI have finished reading an \"Introductory Atlas of International Relations\" by Henry Clay & Arthur Greenwood which I had on loan from the A.I.F. Education Department. I was at a concert tonight in the Y.M.C.A. Hut , given by the Bournmouth Concert Party. It was a very good entertainment.\n","28":" 135\n\nFine but windy.\n\nAnother batch of men, mostly hospital cases left this camp very early this morning , to go on board the Port Denison. \n\nThis afternoon the boat roll of the \"Shropshire\" is published, and my name appears on the list. It is to sail next week. Today I interviewed the A.I.F. Educational officer with a view to getting a month`s work at non-military employment in some of the workshops of England, with a view of getting practical instructions in Oxygen-Accteycline welding, but I will not proceed any further with it now. \n\nI was not on parade this morning & it is probable that I may hear more about it according to reports. If I do I will plead ‘not guilty’. I received a letter from my wife late this evening written from the Lakes dated 21\/1\/19 which I answered tonight. Letter 164. 5 Pages. I also wrote to Cis & sent Mother a P.C. of Weymouth.\n","29":" March 26.1919. 136\n\nThere was a heavy frost last night. Today is cloudless, but the wind is very keen & sharp. My name was read out on Parade this morning for the boat roll of the Shropshire.\n\nI was at a lecture here this morning in the Y.M.C.A. hut,\n\non minerals. The lecture was given by a Captain of the English army , who is a chemist, & was under the auspices of the A.I.F. Education Department. \n\nToday I bought in the Y.M.C.A. a book entitled \"Australias Part in the Great War\" a pictoral record from official potographs price 4\/-\n\nI am on canteen picquet tonight from 6 to 9.30\n","30":" 137\n\nCloudy & rather windy. Yesterday I paraded to the dentist to get a new tooth on my plate & today to the doctor to get a pair of light boots. I have finished making security handles for my two kit bags. I have only the locks to buy.\n\nI finished reading today a very interesting & instructive book by C.W.Salelby M.D. F.R.S. on \"The progress of Eugenics. Eugenics is the new science which deals with nature and nurture or the betterement of the human races.\n\n I sent a post card to Mrs. Gibson telling her that I am leaving here by the Shropshire early in April. \n","31":" 138\n\nFine day. \n\nI had a warm bath early this morning.\n\nAt the Q.M. store I changed my service boots for a pair of very light tan boots, on the doctors recommendation. Cpt. R.J. Vercoe\n\nI am not working in the Smith`s shop today, & don`t expect to work there again unless I am deleted from the boat roll.\n\nI am on guard today. There are very few men in the camp now especially in No 2.Company. It will be the last guard that I will have to do in this camp. A large number of men went away from this camp last night to join the Corowa at Liverpool. Ward, Wetherell, and Hodgson, formerly of the 37 Battalion, were amongst the men who went away from my hut 4. \n\nI wrote to my Uncle Gilmore this morning, telling him that I was leaving by the Shropshire on or about the first of April. I was innoculated with many others for the long sea journey home to Australia.\n\n I wrote to Kitty Gilmore today also Mrs. Rilley at Coolaness. \n","32":" march 29.1919. 139\n\nFine today but early this morning was cold wet and stormy.\n\nOn guard duty I was third relief on No.2.Post in front of the medical Inspection room. My beat was from the Commandants office to the Post Office.\n\nThe hours were from 8 to 10 pm, 2 to 4 am, 8 to 10 am, and 2 to 4 pm. From 2 to 4 last night was wet and stormy and I spent the time in bed in the guard house, as also did the guards on the other posts. \n\nAll men on the \"Shropshire\" were paid this morning from 10 to 11. I was paid £2.5.0.\n\n I wrote to Tom Douglas today. \n\nI was in Weymouth this evening and had tea with private Perks who is living in Weymouth. Then we went to the Pavilion Theatre to see a new play Sweethearts and Wives. The play deals with the recent war. While in Weymouth I bought a gold bangle chain from T.J.Guppy Jeweller for £5.0.0. for my wife.\n\nTwo ambulance cars brough a batch of men into the camp at midday. amongst them was Sargeant Jim Hammett of the 37 Battn. Pioneers. He is looking well but walks on crutches.\n","33":" 140\n\nA fine morning. There was a final medical inspection this morning of all men on the boat roll of the Shropshire.\n\nI wrote to Kitty Martin today also to Maggie Martin.\n\nLast night the clocks were advanced 1 hour Summer time. \n\n I wrote to Mrs. Muldoon this evening. \n\nI was in Weymouth tonight and went to the Congregational Church and a social afterwards in the school room under the Church. \n\nThe men on the Shropshire are not leaving here until Tuesday morning.\n","34":" March 31.1919. 141A fine day.\n\nThere was a kit inspection this afternoon by an officer for all men in this company on the roll of the Shropshire. We were also removed to Huts 10 and 13, for Revellie is at 4 O`Clock and we are to catch the boat train for Avenport near Bristol where the Shropshire is berthed. The train leave Weymouth about a quarter to 8.\n\n I wrote a short letter to my wife this evening, letter 165. \n\nI was at a picture show in the Gym. tonight with Sargeant Hammett but it was a tame affair & we did not stay for the finish but went to the N.A.C.B. canteen and had a feed.\n","35":" 142\n\nRevellie 4.30\n\nBreakfast 5.15\n\nThere was a roll call after Breakfast and we then marched into Weymouth and boarded the train. There we were supplied with a cup of hot cocoa by the Comfort funds. The train moved off at schedule time and we passed through Yeovil Westharn at 9.30, and also through Bath, which is a large city reaching Bristol at 10.40. and Avenmouth 11.15 and was on board the \"Shropshire\" by 12 p.m. We were at first divided into Divisions and Battalions on the pier and on board the steamer, all men were divided into their different States, and allotted places in the ship accordingly. The Victorians are on H. Deck in the stern, right over the propellor. We had dinner about 2 and tea at 4.30. Before tea the Mayor of Bristol addressed the men & officers from the pier through a speaking tube. He thanked them all for their patriotism and the sacrifices they had made in defending the Empire and upholding the cause of justice and freedom, while the heroes\n\nWho lay buried on the battlefield would not be forgotten. He wished all a happy safe & pleasant voyage to their home land in Australia, where anxious friends were waiting to welcome them. \n\nWe left Bristol docks at 7.30 this evening and went a few miles out into the channel and lay to until morning , waiting for instructions. The weather was fine and the sea calm so all hands had a good night. We drew our hammocks and blankets and most of us went to bed early. We could see the lights of two high towers on the North side of the channel. \n\nA sailor fell overboard before we left the docks last evening. But beyond getting a good wetting he was nothing the worse for the bath.\n","36":" 143\n\nA fine day. There is a grey mist which makes the land rather hazy, though it is not far away on the North side. There are numerous ships anchored around us. At breakfast time the \"Shropshire made a start and in a few hours time we were out of sight of land. There was an alarm about 10.30, when the troops paraded on deck and were\n\nallocted to their various boats. No roll was called and no disks were shown. Discipline is very slack on board. Gambling is openly conducted and smoking is rife between decks.\n\nThe food is very good and plentiful. There is an issue of first class butter and bread. The Australian Government is feeding us, and the ships staff cooks it. \n\nW.Narrack a 37 Battalion officer is on board. I saw him this morning. There is also another 37 officer, but he is not an original officer & I don’t know him. This is the first day at sea, although we started from the docks at Avenmouth late yesterday. The ships clock was put back 1 hour and some minutes when we sailed yesterday to resume the correct meredian time. The clocks in England were advanced 1 hour a few days \" Summer time and Avenmoth is about 20 minutes behind London time. \n\nBefore dinner we passed an island - Lundy island on our North Side. It is only a small island with a lighthouse on it.\n\nAmong those on board are several war brides on their way to Australia with their husbands. One of them is married to an officer. Among the hospital staff are several Australian nurses. \n\nThere was a medical parade this afternoon to ascertain if there were any men with colds, sore throats, or symptoNs of influenza, or skin eruptions. On the East tonight we could see several light houses on the French coast.\n\nThursday April 3.1919. 144\n","37":" day on the voyage. The sea is choppy this morning, a fresh wind is blowing, and the ship is rolling a good deal. There are some cases of sea sickness away forward. This morning the Red Cross issued every man a bag containing a pair of pyjamas, shirts, socks handkerchiefs soaps soft hats, and light canvas shoes. There are several pounds worth of material in the bag.\n\nLast night and today we are in the Bay of Biscay. The ship is rolling a lot. We passed a steamer & a ship about 3 o`clock on our right or rather on our west. Before dinner we were hove\n\ntoo, to enable the mine sweepers on each side of the bow to be drawn in. \n\nWe carried them from Avenmouth. We are now out of the mine danger zone. The mine sweepers considerably reduced the speed of the ship. Our course today was from 20 to 30 points W. of South \n","38":" 145\n\n4th day on the voyage. It is very stormy this morning, & the sea is running very high. The sky is overcast with cloud. During the day the weather moderated a good deal.\n\nI bough a book from the educational officer this morning on shorthand price 2\/6. It is one of the latest books on Pitmans Shorthand & is entitled \"Pitmans Shorthand. Rapid Course. I was inoculated again today as well as most of the men in the ship. This is my first inoculation on the ship and the second for the trip. I was also in the spray room for about 10 minutes.\n\nWe are about 200 to 300 miles from the land, & late this evening were about opposite Lisburn. We will soon be out of European waters.\n","39":" 146\n","40":" day on the voyage. \n\nThe sea is calm this morning. The sky is cloudy but the sun is shining and brightly.\n\nThe Red Cross library is open today.\n\n There was a parade today to hear the ship’s station orders read. These orders will be read once a week. \n\nThere was a practice fire alarm today, when all hands had to go on deck & stand by their boats with life belts on.\n","41":" April 6.1919 147\n\n 6 day on the voyage. The sea is calm the sun is shining out warm but the sky is cloudy. Rain fell after dinner. There was a church parade at 11 a.m. on the top deck. It was poorely attended. A number of gambling schools in various parts of the ship was much better attended. Two-up, Even and over Sevens, and numbers were the chief games played. These two latter games are played with dice, and are similar to crown & anchor, which has been prohibited on board. Numerous card games below deck were also in full swing. As a result of these various games some of the men are penniless and a few much richer. The trouble is all cannot be winners.\n\nWe were told at breakfast that during the 24 hours ending yesterday the ship made 328 miles, which announcement was received with cheers.\n\n I returned the \"Treasure Magazine\" to the Red Cross this morning and received the \"Wide World Magazine\" for January this year. \n\nThe ships course yesterday & today has been about 25 degrees W. of South.\n","42":" April 7.1919 148\n\nA fine day. The sun is hot but there is a gentle cool breeze. The ships course remains the same as yesterday. Wireless news from Tenefrie was posted up yesterday & today at the canteen, but there is nothing much in it.\n\n There is a barber shop on board now in the forward part of the ship and I got my hair cut today. \n\nLand was sighted very early this morning by some of those who were sleeping on deck.\n\nThere was a concert tonight in the forward part of the ship on No3. Deck. It was the first of a series to be held on board. One of the best items was a recitation \"Salt Bush Bill\" contributed by Brigadier General Lloyd. Some of the ships staff contributed songs, the balance of the programme was contributed by privates. A newspaper is to be established on board, and articles are invited.\n","43":" April 8.1919 (149)\n\nA fine clear day. A fresh wind is blown on the Port bow. The course of the ship has vered a little more to the South.\n\nWe have permanent mess orderlies and are paying them 2\/- per week. Today was their first pay.\n\nPhotoes of the \"Shropshire\" as she was about to leave the docks at Avenmouth are now on sale at 1\/- each.\n","44":" April 9.1919. (15)\n\n.","45":" on the voyage. The weather continues perfect. The sea is fairly smooth & the wind is moderate. We are very close to the line and many are sleeping on deck.\n\nThere was a parade this morning at 9 a.m. at the mess tables & the roll called as it was feared some men were missing. It has been very hot today. It is said that we crossed the line at 4.30 today. We are steaming much quicker than was expected. At the present rate of speed we will reach Cape Town on next Monday week.","46":"\n\nThere was a sports meeting on the upper deck this afternoon. The programme consisted in various sporting events. But the space was so confined & very few could see them. Contributions for the ships paper will close on the 15th inst. I am sending in several items.\n\nThursday April 10.1919 151\n\n. 10 day of the voyage. This morning is again hot. It is very close and stuffey between decks. I could not sleep last night for coughing, so paraded sick & the M.O. recommended me to sleep on deck.\n\nThe ships course was altered this morning to about 8 degrees East of South. I saw several schools of Porpoises, numerous sharks and flying fish. The Southern Cross can now be plainly seen. It is a very pleasant sight to the home coming Aussies. It can be seen about 600 miles N. of the Equator.\n\nToday has been very hot, and it is also hot tonight. Fortunately there is a cool breeze, but between decks it is like an oven.\n\nThere was another concert tonight, also a boxing match. There are several whist and Euchere Tournaments on board also draughts and chess! In the draughts I won two semi finals, but lost the one for this deck which means I will not be in the final.\n\nFriday April 11.1919. (152)\n\nThe heat is very intense. It was hot all night\n\nI slept on deck where there was a little breeze.\n\nI handed to the Educational officer 2 limericks, one short story, a joke. – all original. The course today is about 5 degrees East of South. I am on boat picket this evening. We go on at 4 p.m. again at 8 p.m. and at 10 a.m. tomorrow. We examine the roll & take up our stations, are inspected & then go off. It is just a matter of form.\n\nSaturday April 12.1919. 153\n\nAnother hot day. I slept on deck last night. It was very windy but nice & cool. Between decks was like a oven last night & today. There was a Red Cross issue of cigarettes today. \n\nWe crossed the line today and the crew celebrated the occasion by rigging up a huge canvas bath, Sailors and soldiers joined in ducking all they could get near it, a huge crowd watched the fun, until they turned the hose on them.\n\nToday I wrote another short paper for the literary Competitions\n","47":" 154\n\nAnother hot day. Our course yesterday & today continues the same viz:- 5 points E of West\n\nThere was a fire alarm this morning at 10.30 when all hands had to stand by the boats with life belts on. I was at the church Parade this morning at 11.pm.\n\n The Padre’s text was, now I see through a glass darkly then I will know as I am known. \n\nOur course for the 24 hours ending at noon yesterday was 320 miles.\n","48":" April 4.1919 155\n\nToday is much cooler. There is a fresh head wind and the sky is cloudy.\n\nI slept on deck again. This is the fourteenth day on the voyage. It is getting rather monotonous with nothing but water to look at. Sea water everywhere. We have not the flocks of sea birds that usually accompany ships at sea. Coming over on the Persic there was a flock of gulls all the way from Melbourne to Plymouth. I spend most of my time on deck either reading or playing cards. I only go below for meals or to do some writing. I have done a lot of writing lately and also a good deal of shorthand practice in writing and reading while on the ship it improves my knowledge of the subject. \n\nTonight is much cooler. There was a boxing contest on tonight.\n\nTuesday April 15.1916. 156\n\n I handed to the Educational Officer this morning a paper on \"Reminiscences of Asia .\n\nTuesday April 15, 1916, 156\n","49":" day on the voyage. In order to economise space it will be necessary to write all my notes in shorthand until we get to the next port of call which is Cape Town. The weather is much cooler today. The distance travelled for the 24 hours ending at noon yesterday was 310 miles, rather less than usual as during the past few days we have had a head wind. The course is about 5 degrees east of south.\n\nThere was a kit inspection today. I had to some equipment I had in my bag.\n\nI bought a book today called \"Motor Car Tyres\", price one shilling, from the Educational Officer. \n\nAn endeavour is being made to form a shorthand class if enough of pupils enrol, the class will be started at once and I will be the teacher. I understand the job will carry . Wireless news that has been coming through the last few days shows that the peace conference in Paris is almost completed its labours and that its terms will soon be submitted to the Germans, who are coming to Paris in such numbers that they will in finding hotel accommodation for them. Palaces and chateaus in the vicinity are being requisitioned for them.\n\nWednesday, April 161, 1916, 156\n","50":" day on the voyage. The sky is very cloudy today but it is close and only for the fresh breezes it would be very stuffy. The shop is rolling a lot today, more so than in any previous day.\n\nThe shorthand class is started today on G. deck. I am appointed the teacher. The first lesson was from 10 to 12 and there will be another lesson\n\nin the afternoon. There will be an hour’s lesson every morning and afternoon. Tomorrow morning I am to give a Colonel some lessons.\n\nOf the we are paid this afternoon I drew 10 Francs. The ship is rolling so much tonight that all the port holes are closed. The officers are having a fancy dress ball tonight.\n\nThursday \nSept\nApril.17.1916. 156\n","51":" day on the voyage. The shop rolled all night. Today is much finer but the ship is still rolling a lot.\n\nI gave a Colonel instructions in shorthand writing this morning from 9.30 to 10 and from 10 to 12, a class of 4 pupils instructions in the same subject and again for over an hour in the afternoon. The course today is about the same. The distance during the past few days is 310 miles for every 24 hours.\n\nThe world’s news today reports that there has been serious riots in India and that 3 bank managers have been burnt to death. The troubles in Cairo are not yet settled. There has been serious riots and a large number of Armenians killed.\n","52":" 159\n\n18th day on the voyage. It is fine today but there is a heavy swell on and the ship is rolling a lot. The course is still about the same and the distance travelled during the past 24 hours ending at noon yesterday was 298 miles. In the routine orders published today I am promoted to the rank of Corporal in connection with the educational classes. I gave the Colonel instructions in the art of writing shorthand this morning and corrected his work. I am to do this throughout the voyage. I forgot to say that my promotion dates from the 14 April.\n\nToday is Good Friday. There were some sports on board in the forward part of the ship.\n\nI was inoculated today, final dose and a large one. I got a very nasty spill this morning. I came down wallop on my seat. It was a heavy fall and I was unwell all the day.\n\nSaturday April 19.1919 160\n\nA beautiful day. We expect to get to the Cape on Monday and to tomorrow.\n\nI corrected the Colonel’s shorthand lessons this morning and then continued the class from 10 to 12.\n\nThe distance travelled yesterday for the 24 hours ending noon was 297 miles and . The course is about the same.\n\nThere was another concert tonight. There was a prize given for the worst song. \n","53":" April 20.1919 161\n","54":" day on the voyage. Dull & cloudy. We expect to see land this evening and to arrive at Cape Town tomorrow.\n\nMany letters are being written today as to morrow morning at 8 is the latest that all letters must be posted in the ships Post Office. They will go without a stamp. All letters posted in Cape Town must be stamped. This evening I wrote to Kitty Martin Kitty Gilmore Maggie Martin. \n\nThe O.C. of the boat addressed the men today & gave advice on the matter of leave and\n\nand good behaviour. The distance travelled for the 24 hours ending at noon today was 317 miles. The days are getting much colder and shorter. The ship has been continually rolling all day and night. It is caused by the heavy Atlantic swells. Our course today was about 5 degrees E. of South. \n\nDuring the past few days all my notes have been written in shorthand to economize space. The first edition of the ships paper will be printed at Cape Town. We saw a lot of sea birds all day – a sign that land is not far away.\n","55":" April 21.1919. 162\n\n 21 Day on the voyage. Most of the men were up early this morning, for land was in sight, the high mountains around the Cape were plainly visible. But as we came closer in to the shore, Table Mount became enveloped in clouds. We were met by the pilot and Medical officer and by 9.15 were inside the dock and soon after were moored along side the pier, on the opposite side of which lay the \"Port Macquarie\" a troop ship that sailed\n\nDinner will be a quarter of an hour earlier today and then we will be allowed ashore as we have a clean bill of health & the port is clean the authorities have no objection if the C.O. gives his word of honour for the good behaviour of the troops which he told us yesterday he would give, and would trust to the boys not to betray him. On one of the numerous wharfs in the dock was a large plackard bearing the words \"Welcome home boys.\"\n\nWe were allowed ashore immediately after dinner but as it was Easter Monday the shops were closed. However I bought some Post cards at the\n\nRailway station. When we got into the city some of us went to a buffett for soldiers run by the visiting troops Entertainment Committee and had a good time We had a fine lunch also bed and a fine concert at night. In the afternoon we took a tram to Camp`s Bay from Adderley St. via Sea Point. We loitered there a little while and returned to town via the Kloof Nek, Kloof Road and Kloof street to our starting point. The tour took over 2 hours in the electric tram, & the natives claim that it is one of the finest rides in the world.\n\nThe tram line to the camp winds around the side of the Mount called ‘Lions Head’ 2180 ft. and a fine view of the sea is to be had as the tram winds the side of the mount & winds along the side of steep declivities & again descends to near the sea level. The return journey through Kloof Nek circules the mount Lions Head & passes between it & Table Mount up and down steep declivities clothed with trees, prominent among which are the Silver leaves, which are protected & thense to the city. We were shown through the city electric light works, which contain some of the latest machinery, including mechanically stoked boilers.\n\nWe are enemies of our cause \"From the progress of Eugenics 45.\n\nthen we went to the concert & was back on the ship soon after 10. The latest hour for returning was 11.00. My tour mates were Pte. Roper & Pte. Fred Staunton\n\n"}}