{"Document Name":{"0":"Diary_0384","1":"Diary_0384","2":"Diary_0384","3":"Diary_0384","4":"Diary_0384","5":"Diary_0384","6":"Diary_0384","7":"Diary_0384","8":"Diary_0384","9":"Diary_0384","10":"Diary_0384","11":"Diary_0384","12":"Diary_0384","13":"Diary_0384","14":"Diary_0384","15":"Diary_0384","16":"Diary_0384","17":"Diary_0384","18":"Diary_0384","19":"Diary_0384","20":"Diary_0384","21":"Diary_0384","22":"Diary_0384","23":"Diary_0384","24":"Diary_0384","25":"Diary_0384","26":"Diary_0384","27":"Diary_0384","28":"Diary_0384","29":"Diary_0384","30":"Diary_0384","31":"Diary_0384","32":"Diary_0384","33":"Diary_0384","34":"Diary_0384","35":"Diary_0384","36":"Diary_0384","37":"Diary_0384","38":"Diary_0384","39":"Diary_0384","40":"Diary_0384","41":"Diary_0384","42":"Diary_0384","43":"Diary_0384","44":"Diary_0384","45":"Diary_0384","46":"Diary_0384","47":"Diary_0384","48":"Diary_0384","49":"Diary_0384","50":"Diary_0384","51":"Diary_0384","52":"Diary_0384","53":"Diary_0384","54":"Diary_0384","55":"Diary_0384","56":"Diary_0384","57":"Diary_0384","58":"Diary_0384","59":"Diary_0384","60":"Diary_0384","61":"Diary_0384","62":"Diary_0384","63":"Diary_0384","64":"Diary_0384","65":"Diary_0384","66":"Diary_0384","67":"Diary_0384","68":"Diary_0384","69":"Diary_0384","70":"Diary_0384","71":"Diary_0384","72":"Diary_0384","73":"Diary_0384","74":"Diary_0384","75":"Diary_0384","76":"Diary_0384","77":"Diary_0384","78":"Diary_0384","79":"Diary_0384","80":"Diary_0384","81":"Diary_0384","82":"Diary_0384","83":"Diary_0384","84":"Diary_0384","85":"Diary_0384","86":"Diary_0384","87":"Diary_0384","88":"Diary_0384","89":"Diary_0384","90":"Diary_0384","91":"Diary_0384","92":"Diary_0384","93":"Diary_0384","94":"Diary_0384","95":"Diary_0384","96":"Diary_0384","97":"Diary_0384","98":"Diary_0384","99":"Diary_0384","100":"Diary_0384","101":"Diary_0384","102":"Diary_0384","103":"Diary_0384","104":"Diary_0384","105":"Diary_0384","106":"Diary_0384","107":"Diary_0384","108":"Diary_0384","109":"Diary_0384","110":"Diary_0384","111":"Diary_0384","112":"Diary_0384","113":"Diary_0384","114":"Diary_0384","115":"Diary_0384","116":"Diary_0384","117":"Diary_0384","118":"Diary_0384","119":"Diary_0384","120":"Diary_0384","121":"Diary_0384","122":"Diary_0384","123":"Diary_0384","124":"Diary_0384","125":"Diary_0384","126":"Diary_0384","127":"Diary_0384","128":"Diary_0384","129":"Diary_0384","130":"Diary_0384","131":"Diary_0384","132":"Diary_0384"},"Date":{"0":"unknown","1":744.0,"2":747.0,"3":748.0,"4":752.0,"5":761.0,"6":762.0,"7":763.0,"8":764.0,"9":765.0,"10":766.0,"11":771.0,"12":772.0,"13":777.0,"14":779.0,"15":780.0,"16":784.0,"17":788.0,"18":795.0,"19":796.0,"20":797.0,"21":808.0,"22":809.0,"23":810.0,"24":815.0,"25":818.0,"26":819.0,"27":830.0,"28":831.0,"29":832.0,"30":833.0,"31":834.0,"32":835.0,"33":839.0,"34":840.0,"35":844.0,"36":848.0,"37":849.0,"38":852.0,"39":853.0,"40":856.0,"41":858.0,"42":860.0,"43":862.0,"44":863.0,"45":868.0,"46":872.0,"47":876.0,"48":880.0,"49":881.0,"50":882.0,"51":883.0,"52":885.0,"53":886.0,"54":889.0,"55":891.0,"56":892.0,"57":893.0,"58":894.0,"59":895.0,"60":896.0,"61":897.0,"62":898.0,"63":923.0,"64":924.0,"65":925.0,"66":926.0,"67":930.0,"68":931.0,"69":932.0,"70":933.0,"71":934.0,"72":935.0,"73":936.0,"74":937.0,"75":938.0,"76":943.0,"77":944.0,"78":947.0,"79":948.0,"80":950.0,"81":952.0,"82":953.0,"83":954.0,"84":955.0,"85":961.0,"86":962.0,"87":963.0,"88":964.0,"89":965.0,"90":975.0,"91":976.0,"92":977.0,"93":978.0,"94":989.0,"95":990.0,"96":991.0,"97":1007.0,"98":1008.0,"99":1009.0,"100":1010.0,"101":1011.0,"102":1023.0,"103":1024.0,"104":1025.0,"105":1030.0,"106":1031.0,"107":1036.0,"108":1037.0,"109":1038.0,"110":1043.0,"111":1044.0,"112":1045.0,"113":1049.0,"114":1052.0,"115":1053.0,"116":1054.0,"117":1055.0,"118":1068.0,"119":1069.0,"120":1070.0,"121":1071.0,"122":1072.0,"123":1085.0,"124":1086.0,"125":1087.0,"126":1088.0,"127":1098.0,"128":1099.0,"129":1100.0,"130":1101.0,"131":1102.0,"132":1115.0},"Entry":{"0":"\n\n \n\n \n1916\n\n","1":"\n\nWith No. 2 General Hospital, Aust. Army Medical Corps stationed at Gezira, Cairo.\n\nHave been away from Sydney over 13 months\n","2":"\n\nReal Egyptian winter weather now. Bright, sunny days & cold nights. Last night \nit\n rain came down fairly heavily – this is the fourth time it is rained since I have been in Cairo, nearly 12 months.\n\nIt is very hard to know how to put in one’s spare time. I don’t particularly care for knocking round Cairo’s streets & walks round Gezira become monotonous. A chap does miss having no real friends & I do envy those lucky chaps who have been able to chum up with people of some nationality or other.\n\n ","3":" 7\" (Fri)\n\nSeveral days ago I put an Advert. in the \"Egyptian Gazette\" for a teacher in French & Arabic. I received several replies & decided on Mlle. DeLongrais – 2 lessons per week – P.T. 100 for 12 lessons. Yesterday afternoon I had my first. Should make good progress now.\n\nWe are now very busy admitting & discharging patients – no wounded now of course. all sick They are coming in at a great rate from the different camps & to-day there are 841 in Hospital.\n","4":"\n\nTo","5":" last the number of cases treated during the 11 months No. 2 G.H. has been in Egypt has totalled 9729. (bullet wounds 1542). Of this number only 54 or 55%\nDied (21 from pneumonia).\n","6":" 12\" (Wednes)\n\nOur establishment of Officers has been brought up to date – 2 new Lieut. Colonels & several Majors have been appointed or promoted.\n\nNot feeling too good at present – touches of asthma, sore throet & cold in head. Long hours in the Colonel’s office and cold, misty damp nights are not too healthy.\n","7":"\n\nFeeling pretty fair now but it could be better for me if I could get more exercise in the open.\n\nGet up in the morning about 7.15 – just in time to be ready for breakfast at 7.45. Commence work about 8.30. knock off at 12.45 pm for dinner & start again about an hour\n\nlater. Dinner at night is at ¼ to 6 & then back to office at 6.30, where I stay always till 8 & often to 9 or 9.30. Every day is about the same except Tuesdays & Fridays when I am on leave from 2 p.m. for practically the rest of the day. The work is not heavy nor laborious and often there is practically nothing to do except \nto be there on the spot\n & fag French with plenty of interruptions.\n\nI believe I am getting homesick. I don’t see much of the other chaps & the lack of civilian social life is rotten especially when you can see it going on around you and are prevented from participating o account of the uniform. Fancy being a permanent soldier!\n","8":" 24\" (Monday)\n\nNumber of patients in Hospital to-day\n\nreached record number of 978. The largest number we have ever had in before was at Mena – 955.\n\nTremendous number of Australian troops in Egypt.","9":" &","10":" Divisions at Tel-el-Kebir;4th Brigade with several additional units at Ismalia; and several big camps round Cairo.\n","11":" 25\" Tuesday\n\nA new record established to-day! 1000 patients in Hospital. The largest number we have yet had.\n","12":"\n\nFound to-day that our O.C. Lieut. Col. Martin had been made a C.M.G. Plenty of Congrats. of course.\n\n ","13":"\n\nThe day before yesterday I had one of my usual bi-weekly French lessons with Mlle. Deslongrais & then she took me along to make the acquaintance of a family of Cairo people (Hensphone or something the name is). My first introduction to a civilian home in Cairo after 12 months here. Nothing very Australian – all foreign but none the less agreeable. The mother cannot speak English at all but her daughter (about 19) can speak a little. Found my French very useful (what little I have learnt so far). Met several other people there & had altogether had quite a decent time. Perhaps now I have made a start I may be able to get to know plenty of people.\n\nYesterday I managed to get down to Tel el Kohn – the big \n\n \nAustralian base camp and a full two hours run in the train from Cairo – off the Delta on to the desert. Fixed up some transfers with the","14":" Field Ambulance & then visited a chap at No 2 Stationary Hospital, AAMC. Arrived back in Cairo at 8.45 pm. The camp reminds me of Mona only it is much bigger & extends alongside the railway line for a couple of miles – plenty of bustle & activity of course. The old 1882 battle-ground of Tel – el – Kolin (Arabic for \"big plain\") is just at the back of the camp.\n","15":" 9\" Wednes. \n\nWe have been having a good deal more rain this \nyear\n winter than last. I see from a report issued by the Physical service of the Ministry of Public Works that during January the rainfall was 130 per cent above average over the coast & 85 per cent over the Delta.\n\n ","16":"\n\nGot a late pass last night and went to the \"Tops\" Performance at the opera House. Good entertainment by a band of pierrots. Got back to Gezira about 12.30 a.m.\n","17":" Mond.-\n\nThe sewerage system of the Hospital has broken down (over 1300 souls at Gezira). One of to day’s orders reads :- \"\nNo.140,Water Supply\n. For the present Officers, N.C.Os. & men are not to use the baths and the Nursing Sisters are requested to be as sparing as possible\" Seems to be as bad as being in the trenches.\n\n\"Rumour has it\" that a move of No.2 G.H. is contemplated in a month or 6 weeks. Let us devoutly hope that this is correct.\n\n ","18":" 17\" Thurs.\n\nMorton Crocker came in to see me \nthis\n yesterday morning. His unit is stationed a couple of miles from Ismailia on the other side of the Canal & he is up in Cairo on one day’s leave. In the afternoon we went up to the Citadel & had a look at the Mohamed Ali Mosque. Then went through Blue Mosque, Rafayiz Mosque & Mosque of Sultan Hassan.\n\nWas going to a Concert in the Printannia Theatre last night commencing at 9.15 but there was such a full house that was unable to get in, so came back to Gezira & stole a \"forbidden\" hot bath & went to bed.\n","19":"\n\nOn Sunday afternoon the \"old man gave me a sudden shock advising me,\n\n \nas things were slack, to go out for the afternoon – which I promptly did in company with another chap. We went up to the Citadel by tram & then walked to the base of the Mokattam Hills which we climbed. Splendid panoramic view from the top – all Cairo at your feet. Then had a good look over Napoleon’s fort & after a few more gazes from lofty eminences, returned to Gezira. After dinner we went to the Casino Kursaal & saw a Revue in French & English that is now on there.\n\nToday after my usual bi-weekly French lesson we went to old Cairo where a decent old Belgian showed us over various Coptic churches. & gave us some very interesting particulars about the Copts, their customs, dwellings etc. & also about \n\n \nOld Cairo itself – all of which he appeared to know a fair amount about.\n\nPatients are being rapidly evacuated from the palace & there now only remain about 250; several of the wards having been closed down. The question on everyone’s lips is now \"where are we going?\"\n","20":" 26\" - Satur.\n\nA Hospital train runs daily from Cairo to Ismailia picking up on the return journey patients from ismailia, Moascar & Tel-el-Kolin. The train is staffed by No.2 G.H. personnel & to-day I went down with them (as a passenger). Spent a very pleasant day – most of it on the train which is splendidly fitted up for patients & staff (especially the latter). Ismailia is 116 miles from Cairo & a very\n\npretty \nplace\n town right on the edge of the \"bitter lakes\". Food supplied on the train at breakfast, morning tea, dinner & afternoon tea was very good & the train staff seem to have a pretty easy time; most of the heavy work being done by men from the Indian Army from a couple of whom I endeavoured to pick up some Hindustani. \n\nThere are now only 100 patients remaining in the Hospital. It has practically been decided that we are to evacuate Gleyinch Palace in a few days & move to the Sporting Club, Heliopolis now occupied by No.3 Aux. Hosp., A.I.F.\n","21":"\n\nYesterday saw the first of the \"khamsoon\" the hot dusty winds that blow from the desert on & off for 50\n\n \ndays. To-day also has been pretty warm so that the summer may now be said to have just about started.\n\nWe have evacuated all our patients from the Palace with the exception of 7 or 8 of our own men who are on the sick list. Fatigue squads under the direction of the 2 A Capt Beers are busy packing all equipment in anticipation of an early move.\n","22":" 6\" Mond.\n\nOn Saturday night a Dinner & dance for the whole Unit was held as a kind of \"breaking up\" prior to the evacuation of the Palace. The dinner took place in the splendid room that used to be Ward A & about 400 sat down; there were speeches of course & after these \"dry morsels\"\n\n \nan adjournment was made to ward B, the Ballroom – another great room with tiled floor on which merry couples did the \"light fantastic toe\" act. There was a very decent supper & shortly after this, just after midnight, the crowd dispersed.\n\nYesterday afternoon I came across a new Scout Organisation in Cairo – the \"Young Macabees\". They are all French Jews & are about 60 in number. They are much interested in photos & particulars of Australian Scouts.\n","23":" 8\" 1916 Wednes.\n\nOn Monday evening the O.C. went down to Luxor for a weeks holiday; the first he has taken since arriving in Egypt. Luxor is several hundred miles distant down the Nile & a very pretty place I believe, being in close proximity to the \n\n \nancient cities of Karnak & Thebes. I am left with practically no work to do at all – tried to get up to Alexandria for a few days but O.C. said he wanted me to be at Gezira while he was away. Hard cheese! Yesterday was my first free day. Went into Cairo in the morning & saw Rev. Horan Rector of All Saints to whom I had just received an introduction. In the afternoon went to my French lesson & after tea to the Cinema\n","24":"\n\nI have been pretty active during the last few days although there is not much work attached to it. While the O.C. is away I am attending the N.C.Os instructional squad which drills from 6.30 to 7.30 a.m. daily. All our nice comfortable beds have been packed\n\n \nby the Q.M. & most of the men are now sleeping on the ground. I have managed to secure a cane palm bed which keeps one off the ground but it is none the less hard without its mattress. On Wednesday afternoon I visited Nos. 1 & 3 Gen. Hospitals at Heliopolis & Abbassia respectively. These two suburbs of Cairo are both full of Hospitals – British & Colonial. On Thursday two of us spent the day in a journey to the Pyramid of Sakkara. By train to Bedrashin & then 6 miles on donkeys through the ancient city of Memphis to the tombs of Sakkara. The return trip to Bedrashin was made through the fertile fields, past a cemetery & through a busy native village.\n\n11\" March Sat.\n\nThere is now a scarcity of Egyptian\n\n \nsilver , no doubt owing to the fact that the natives must be hoarding it up in the large sums they are getting from the Troops. Indian rupees (worth ¼ English & P.T. 6½ Egypt) have now been brought into circulation throughout Egypt.\n","25":"\n\nOn Saturday morning I had a look over the Medical School at the Civil Hospital, Kasr-el-Aini – including the dissecting room, museum & other places of interest.\n\nIn the afternoon went to Pont Liman station & caught train to Mataria where had a look at Virgins tree & well, obelisk marking the site of ancient Heliopolis, French Catholic church & ostrich farm.\n\nOn Sunday morning I attended\n\n ","26":" o’clock service at All Saints’ Cairo & in the afternoon after having a look at the Armenian scouts & dropping in to a Children’s Service at ‘All Saints’ went round to the Rectory for afternoon tea (Rev & Mrs Horan).\n\nThe O.C. arrived back from Luxor this morning looking pretty fit. The past week has been a very pleasant one for me – time my own. Have been getting plenty of exercise. Up every morning at 6 & drilling until breakfast time. Out practically every morning, afternoon & evening visiting new places of interest, attending meetings of English, French, Jewish & Armenian Scouts, going to a couple of places of entertainment & keeping up usual French lessons. \n\n ","27":" 15\" March\n\nOn Monday afternoon we received orders to evacuate Gleyinch Palace at 10 o’clock & go into camp in the grounds of the Sporting Club, Heliopolis. This was successfully carried out next day, a fatigue party & store guard of 30 men being left behind.\n\nWe are now in tents on the desert inside the sporting Club boundaries & living more under active service conditions than in the Palace. I don’t mind the change at all as it is a pretty healthy sort of existence to lead. The nurses are doing duty in the Sporting Club (No 3 Aus. Hosp. A.I.F.) but No. 2 GH itself is simply a unit in-camp awaiting orders for a move – perhaps to France.\n\n \nX\n","28":"\n\nAm writing this on the Mediterranean 3 hours out from Alexandria, making (it is almost certain for Marseilles.\n\nWe remained under canvas at Heliopolis for 10 days – a pleasant & healthy ten days too. The loading of our equipment & stores commenced on Friday morning & was completed next day. The Unit consisting of 25 Officers, 119 nurses,190 N.C.O’s & men left Cairo main Station by special train at 9.45 a.m. on the Saturday arriving at Alexandria 3 hours later. Everyone was embarked immediately on the British Hospital ship \"Braemar Castle\" & getting on board of the stores commenced. Everything being O.K. at 11.30 this morning & we are now off.\n\nBesides our personnel of 334 of all \n\n \nranks, there are on board, the crew (number unknown) & Hospital staff of ship of 60. The Sergts. are berthed aft in very comfortable quarters, & as the tucker is fair, sea calm, & little work to do now that the mass of work in connection with the embarkation has been got under, everything should be alright.\n","29":"\n\nEverything going smoothly, the ship averaging between 11 & 12 knots. So far we have only seen one ship since leaving Alex., the Hosp. Ship Ersiquibo which we passed about 9 o’clock last night bound for Alex. Notwithstanding the fact we are on a Hosp. Ship every precaution is being taken against enemy submarines. We are keeping well out of the usual trade route\n\n \n(& site of likely minefields) Every man sleeps with his lifebelt under his pillow & boatdrill parades of all on board are held daily. No bugle calls are sounded & no parades \nare held\n or gatherings allowed on deck.\n","30":" 30\" March\n\nGreat excitement caused yesterday about 10 a.m. by sight of small black object on starboard bow – perhaps an enemy submarine. No such luck, as it turned out to be a fishing boat. Plenty of shipping now discernable & island of Malta in sight. We passed close in to Malta & Goza & only wished we could get ashore. A fine sight was witnessed while passing Goza: - 2 large troopships passed us under full steam with an escort of 2 destroyers \n\n \ndodging here & there keeping a watchful eye open for the dreaded submarine.\n\nOn coming on deck this morning before breakfast found we were off the African coast with Tunis in sight. Lost sight of land a couple of hours later.\n","31":" ","32":"\n April\n\nOn Thursday night it blew up pretty rough & on getting up out of my bunk next morning found a big sea running. Incidentally I fed the fishes a couple of times & then decided that discretion was the better part of valour, turned into my bunk again and hugged it closely for the best part of the day. Everything A 1 next morning & found we were just off Marseilles. The \"Braemar Castle\" ran right into the harbour & anchored behind the\n\n \nbreakwater before breakfast. Here we have been lying for two days – feeling liked caged lions as no leave has been allowed. The harbour is full of shipping - vessels belonging to neutral countries conspicuous by their prominent display of nationality both by flag & painted lettering.\n\nTransports crowded with Troops are coming in thick and fast. 3 boatloads of Australians have arrived so far today each containing about 2,000 men.\n\nManaged to get into signalling communication with them this afternoon. Hills rise all round the harbour & near the city \nare\n houses can be seen on the slopes nestling among the forest green.\n\nOrders received to-night that we are to commence disembarkation to-morrow & establish field hospital \n\n \nat Mousset Camp, a few miles out of Marseilles. (69)\n","33":" :-\n\nPut my foot on French soil for the first time this morning when I spent several hours in town. What a fine city (600,000) inhabitants). Pretty streets with many trams on some of which are female ticket collectors. Quite decent to see so many civilians after Cairo & its military hordes. Australians quite a novelty & many a curious glance cast at us. Plenty of French troops about – some with battle scars. Many of the civilians are in black & the plentifulness of crepe makes evident that the war is bringing its horrors home to many. No English is spoken at all & felt quite proud of the \n\n \nFrench I was able to make use of. Everything is French – no variety of tongues that one finds in Egypt. \n","34":" 5\" April:-\n\nLeft the \"Braemar Castle\" this morning to go into camp with the Unit in the grounds of the Château de Mousset. Went by motor ambulance & what a drive! First through the busy docks bustling with war activity – then through the city with its cobbled streets, & out into the suburbs beyond driving along fine long roads flanked with tall trees & pretty detached houses with green covered hills rising in the background. And then along a narrow road by the seashore until we turned inland – the \ncountry\n rural aspect now became evident the car passing along narrow lanes \n\n \nwith low stone walls on either side, separating the small holdings of the peasants who waved to us as we passed along; until finally we passed into the grounds of the Château de Mousset through an open gateway. The Château itself stands well in the middle of its spacious grounds which are still pretty not withstanding the rough usage they must have had since the place has been taken over by the military.\n\nThe tall hills rise on both sides & in rear, while in the front, about ¾ mile away can be seen the blue waters of the Mediterranean.\n\nWe have not yet taken over the Hospital which is being run by Lahore Stationary Hospital (Indian Exped. Force) with a section of the R.A.M.C. attached.\n\nToday we have been on service rations – bully beef, biscuits & tea which together with plenty of work and a fine bracing atmosphere are making me feel as fit as the proverbial fiddle. (70)\n\n \n1916\n","35":" :-\n\nWe have now been 4 days in camp here at Mousset & they have been long drawn-out days, too. The first day was fine & sunny but rain commenced to fall the same evening and it has continued to fall the whole of the last 3 days. As I write now in a fine, dry tent with the light of a hurricane lamp, it is coming down as steadily as ever. We are all in tents – well trenched of course – with the ground around, everywhere a perfect quagmire. Our several hundred tons of stores & equipment are practically all under cover in roomy storetents.\n\nThe hospital of building , huts & tents, which until a week before our arrival was the Indian Base Camp but is now for British & Australian nationals only, is still being run by Lahore Indian General Hospital with R.A.M.C. Section attached\n","36":" :-\n\nAfter the rain we had three gloriously \n\n \nfine days – typical of the Riviera but last night a breeze sprang up & early this morning (about 3.30) I was awakened by the roar of a gale & the flapping of loose canvas with the tent swaying so violently that I thought it would come down any minute. Put on my boots & greatcoat grabbed hold of a peg mallet & got outside somehow – the O.C.’s office is a square tent & I slept in a section of it divided off. Great activity everywhere – officers & men in pyjamas, portions of uniform etc. etc. struggling with tents that were going their best to become balloons. The O.C. was valiantly wielding a mallet & with the help of several men was doing his best to keep his sleeping tent from floating into another part of France. For a full hour & a half I kept at it and then just as day was dawning, turned in again for a short snooze. Several \n\n \ntents were blown down & the Q.M. had some of his big store tents torn to ribbons. It is just about the biggest windstorm I have yet seen & blew straight off the ocean. To-night is blowing up again but sincerely hope it will be nothing like this morning.\n\nTomorrow morning No.2 G.H. will take over the Hospital which is being run by the Lahore Ind. Gen. Hospital. We are extending the accomodation to 1000 beds; there are only about 230 patients in now.\n\nThere are only 3 Hospitals here all told :- No.9 British Stationary, Lahore Indian Gen. & No.2 Aust. Gen. One of the chief reasons why I like Marseille is, I think because there are so very few of our troops here. There are a number of Serbian soldiers about – men who have had to retreat from their country.\n\nBig gangs of German prisoners are \n\n \nbeing put to various kinds of work here. Before leaving the \"Braemar Castle\" I saw numerous squads on the wharves guarded by French troops, they seem to be of a pretty fine type.\n\nA private in the French Army receives 4d per day, a \"Tommy\" 1\/4d & an Australian 6\/-. \n","37":" :-\n\nThe French people are very friendly to the Australians who have come such a long way to help them against the Germans. They look a chap up and down curiously in the streets as we are about the first Aust. Unit they have ever come in contact with. The girls have plenty of smiles for us but there is one big obstacle for most – they speak French \nonly\n and we speak English \nonly\n. I thank my lucky stars that I started French in Egypt – so jolly useful now (to the envy of more than one of our chaps.) (71)\n\n ","38":" April:- I have been lucky enough to make the acquaintance of a very nice French family living quite near the camp in Vieille Chapelle. In the family are the father & mother, 3 sons & 3 daughters. The father is a Lieut. Col. in the French Army and is supposed to be at Soisson; one of the sons is at Verdun, and the other one is missing while the","39":" & youngest son (aged 13) is at home. There was another son but he fell earlier in the war. One of the daughters is married – her husband is also fighting. Does not this show one the seriousness of the war & the vital importance of winning it, is to France.\n\nWe have had a peculiar combination of weathers since arrival – one day fine, 3 wet, 3 fine, & then the last 5 as windy as could be – a cold, strong wind blowing off the ocean. \n\n ","40":" April:-\n\nEverything going along smoothly. Am putting in a good amount of French every day. Bob MacLarsen & self have been visiting our French family every evening after tea – Je suis très content. (72))\n","41":" April:-\n\nAbout 15,000 Russian troops landed at Marseille on Thursday, the day after the taking of Trebizond became known. They are a fine looking lot of men & are at present in camp at Miraleau outside the city. They \nalso \n have come to help the French against the Germans; Russia is supplying the men & France is supplying them with rifles & equipment.\n","42":" April:-\n\nThe Russian Troops have left\n\n \nMarseille & gone to Mailly.\n\nThe equivalent of 3\/7d in French Money is at present 5 francs a franc being equal to 8 ½ d. Everything is extremely cheap after Egypt. The daily paper only costs 5 centimes or 1\/20 of 8 ½ d . A tram ride anywhere in or round the city is only 10 cent. There is a large amount of paper money in circulation, down to a 50 centimes (4 ¼ d) note. English, Italian, Greek, Belgian, etc copper coins are in circulation as well as French; & also several varieties of silver coins.\n","43":" April:-\n\nA second contingent of Russian Troops landed yesterday & are holding a route march through the city to-day. Gen Woodhouse D.M.S.L. of C. who is in command of all A.M.C.\n\n \nUnits on the lines of communication throughout France, inspected No. 2 G.H. to-day.\n\nThe cold wind that has been troubling us for the past week or more has disappeared & the past two days have been absolutely perfect, while the sea is as smooth as glass –the ","44":"\n glowing sunset over the water in the evening being very pretty.\n\nGreat consternation caused through the Unit. In Egypt no man was allowed to draw more than 2\/- per day in pay but in France it has been reduced to a maximum of 15 francs a fortnight (about 9d a day) for Privates and double for Sergeants.\n","45":" 1916:-\n\nThe value of the Franc varies from time to time & the rate of exchange is fixed each \n\n \nmonth. During","46":" francs will equal 3\/6d one 1 fr will equal 8.4d.\n\nEveryone in possession of a camera has been ordered to get rid of it or hand it in for safekeeping to the O.C. Yesterday morning I was pretty busy giving receipts for about 60 cameras of all sorts & sizes. The taking of photos throughout France is strictly forbidden by the military authorities. Have made acquaintance of very nice people (name Yarrassouritz) who all speak English well (except for Mrs Y) with a strong foreign accent. They took me along yesterday to an English Tennis Club where I played tennis all the afternoon & in consequence thereof am feeling stiff today. Tennis on active service what!\n\nFor the last couple of days have been reading about the Irish rebellion. And Gen. Townshend’s surrender in Mesopotamia. Leaves a nasty taste in one’s mouth to \n\n \nread these things in French that are read all over France when the British Forces appear to be doing so little. (75)\n","47":"\n\nYesterday was a red-letter day for us. A ","48":"\n route march of the British Colonial Troops in Marseille was held in the afternoon when several thousand men took part. Never have I seen such an enthusiastic demonstration – the streets, shops, balconies & windows were packed with people shouting & clapping (a few crying) waving flags as well as throwing flowers & distributing cakes, postcards (& kisses) to the Officers & Men. The only Australians that took part were 200 from the Base Details, Moussot \nand\n 4 Officers & 100 N.C.Os & men from No. 2 G.H. We moved off from Moussot together with 100 New Zealanders at 1.15 pm on our 5 mile march into the city to Place Castellane (the place of assembly for the route march)\n\n \nAt Place Castellane we soon found ourselves in the midst of a big crowd & in about \"two ups\" everyone had decorated himself with a French flag & flowers in profusion. A battalion of South African Infantry ( wearing the \"tommy\" uniform with cap) and a squad of Indian Lancers with fluttering pennants were already there, & soon afterwards a couple of thousand kilted infantry, also belonging to the South African Exped Force, arrived. We started off in the following order: Indian Lancers, Australian Brass Band, Australian & New Zealand Details, Aust. Army Medical Corps, Sth. African Infantry, Sth African Scottish. A few dismounted Indians & French interpreters were also scattered through the column. Before leaving Castellane I really thought myself a veritable flower garden but soon after I felt like 6 flower\n\n \nshops rolled into one – flowers everywhere in my hat, belt, pouch waterbottle, pockets, buttonholes surmounted by two flags – one waving from each shoulder. Needless to say, with the rush of people to shake hands with everyone (& to kiss some), the rounds of applause from everywhere, the showering of flowers & flags from windows, the singing of the Marseillaise, Tipperary etc by the troops, the discipline & marching were hardly as steady as those of the Life Guards would have been! In the Place de la Prefecture we marched past a big mob of \"HEADS\" including French, British, Serbian, Russian, & Belgian bigwigs – General Conquest commanding","49":" Region of France took the Salute. Our destination was the Railway Station (Gare St.Charles) where the Sth. African Battalions entrained in full marching order for the North, not however\n\n \nbefore they had partaken of the champagne that was provided for all by M. Le préfet des-Bouches-du-Rhône. After the Australians & New Z’s had put away their champagne, the return march commenced through the city streets, suburban avenues, along the sea front & then up to the camp.\n\nDuring this march I was not able to add any more floral decorations owing to all the available positions in my uniform being used up but that did not prevent me from accepting further floral tributes to give away again as souvenirs which were in great demand. We were dismissed about 7 p.m. after a march of fully 14 miles. (78)\n","50":" 12\" May\n\nYesterday afternoon I had a look at the Jardin Zoologique, and Musées des Beaux- Arts et histoire naturelle,\n\n \nor in other words – zoo, art gallery & museum. All of these are very interesting & are \nall\n in the same grounds; the Art gallery & museum being in the same building. Le Palais Longchamp, a fine edifice standing on a slope with gardens,\nwater\n fountains & a big pool in front.\n","51":" May:-\n\nOn Sunday I paid a visit to Toulon France’s chief naval port 1 ½ hours distant from Marseille in the Paris express. The run from Marseille to Toulon is first out through the fields & meadows sprinkled with wild poppies & daisies with little homesteads scattered about; and then after passing through 5 tunnels of varying length, the Mediterranean came into sight and from then until our destination there is practically nothing but pretty little harbours with beaches, fishing villages, \n\n \nshipping, islands etc. well known as health resorts of the sunny south of France – cassis, La Citat, Les Lecques, Bandol & Sanary. Toulon is essentially a naval town and we found the narrow streets \nwere are \n full of sailors from the ships in the splendid harbour. We saw no English or Australian Troops at all & were the centre of attraction everywhere. After a walk round the town we jumped on to a tram & rode out to Mourillon, a pretty little spot on the coast about ½ an hours ride from the town – then after a walk round the sea front, back to the city & a dinner in a typical little French restaurant . From here we strolled to the entrance of the Arsenal (having a look into as we passed, a fine big Roman Catholic Church) the biggest in France, employing many thousands of men. No one being allowed to pass through the gates past soldiers and gendarmerie \n\n \ngalore who were guarding there. I had to see the Naval Secretary a smart little Frenchman with plenty of silver lace all over him & sporting a medal, who, after all I had to say in my best French, asked a few questions & then had a sailor sent in to show us over the place. After thanking the \"Secretaire\" in a \"few well chosen words\" (as far as my limited French vocab would let me) we set off on our tour of inspection – through the naval museum, into great workshops, past big dry docks in which were submarines, cruisers, battleships, auxiliaries hospital ships with men working everywhere, as busy as bees notwithstanding that it was a Sunday. After leaving the Arsenal & our friendly guide we strolled through the public gardens & then inspected the musées de Beaux-Arts d’historie naturelle (Museum & Art Gallery) which were very interesting – especially one room full of maps, relics & things of old\n\n \nToulon. On the way to the railway station we passed the Civil Hospital & decided to go in and have a look round but were politely informed inside that visitors were not allowed to enter the wards. The Paris express arrived at 5.20 & we hopped on board, not however before we were greeted with shouts of hullo, Australia! Where are you from? From several Adelaide tourists who were on their way to Paris from Nice & had just caught sight of the first two Australians they had seen in France. We arrived back at Musso about 9 p.m after an enjoyable day in beautiful weather spent touristing in active service.\n\nWe are on the move again already! Orders were received yesterday to commence packing our equipment straight away in view of an early move – the original hospital we took over to be kept \n\n \ngoing. I don’t there have been more than 300 patients in hospital at one time since we took over 7 weeks ago (79)\n","52":"\n\nYesterday evening I went over the \"pont transborderer\" a great iron framework stretching across the entrance to the \"Vieux Port\" and towering high above the water. A lift takes you up 52 mètres but a ladder can be climbed until an altitude of 74 mètres is reached. A magnificent view is obtainable from the top – over the busy city with the mountains in the background, and across the harbour with its Casino & shipping. After going down the lift again, I crossed to the other side by a pontoon affair suspended by chains from the framework, which runs too & fro for passenger & vehicular traffic. Went back to camp after \n\n \nvisiting some friends & getting an invitation to dinner on Friday evening – experiencing some difficulty getting a tram. Marseille has a splendid network of tramlines extending in all directions out of the city but on account of practically all the able bodied men being called up for military service the trams are being worked by old men, women & boys and no cars leave the city later than 9.30pm. \n","53":"\n\nLast night the official screening of a war filim \"L’Angleterre est prête\" (England is ready) took place at the Femina Cinema, Rue St Ferrool Marseille. Admission was by invitation only & as I had not been able to get a ticket, I had to \"scale\" in. A crowded house of English & French \"bigwigs\" including numerous officers from the Allies’ armies saw this interesting \n\n \nfilm. The show lasted from 9 till midnight & a special tram was run to enable all to get back to camp\n\nHaving glorious weather here with plenty of sun every day which ripens the cherries very quickly. We have several fruit laden trees in the camp grounds but I don’t think the fruit will be able to last forever – not at the rate it is going.\n\n2000 British & colonial troops have just arrived in camp here where they are isolated. They have just come off transports on which have been various outbreaks of infection.\n","54":" May:- Yesterday was the day of my visit to Nice & Monte Carlo. (Who said Australians aren’t tourists?) Up at 4.30 a.m. & caught the 5 to 6 tram from Bonneveino, leaving Marseille Station (Gare St Charles) at 7.20 by the Paris express\n\n. \n\nThe distance from Marseille to Nice is 225 km (140 ½ mile) and is full of interest from start to finish. The first 42 miles (to Toulon) I have already described. From then onwards until the train arrives at St Raphael (60 miles further on) the journey is through fertile fields & hilly country , but St. Raphael is a pretty watering place after which come in succession along the coast Agay, Cannes, Golfe Juan, Antilles & Nice as well as other splendid holiday resorts – all one continuous \nstring\n chain with splendid scenery, bays, headlands, long curving beaches with the inevitable promenade, little inlets & blue sparkling water as calm as a millpond in the bright sunshine. After journey of nearly 5 ½ hours we reached Nice where the Customs officers greeted us with \"Quelle nationalité êtes-vous!\" upon receiving the reply \"Australienne\" they immediately passed us through into the Avenue Thiers from which we turned into \n\n \nAvenue de la Gare – a fine, wide street with trams running along it and shaded with great leafy trees on either side. In the Place of Masséna (with the Municipal Gardens on the other with the Promenade des anglais & bay behind it) we caught the tram at one-thirty pm for our destination Monte Carlo, 13 miles distant. Our journey occupied an hour & 20 minutes and was crowded with interest. The picturesque scenery with more bays & little harbours on the right & great rugged mountains towering up on the left are sights that once seen are not easily forgotten. On the tram the conductor at first refused to issue us with tickets to Monte Carlo but when he was informed that we were officers, everything was alright. I thought that we might experience some trouble on the Monaco frontier but we left French territory behind & entered onto neutral soil without noticing it. I would\n\nhave thought that we were still in France only for the inhabitants we passed having a somewhat darker skins of an Italian type and then soon after the town of Monaco with the reigning Prince’s Palace came into sight on an elevated spur to the right. A few minutes later the tram arrived at the terminus and our destination – Monte Carlo with its Casino, a couple of hundred yards away and gardens in rear in which people who stake their last franc on the roulette table (& lose) are supposed to commit suicide – I never saw any, but perhaps we were there too early in the day. or perhaps it was not the right time of the year. We went up the steps of the Casino & into the Main Hall past several gold laced gents. Leading out of the hall was the Concert Hall in the centre, a money changing dept on the right & the salles de jeu (gaming rooms) on the left. The latter we found we found we were not allowed to enter – entrance being forbidden to anyone in military \n\n \nuniform. From the open doorway however I could see the people round the roulette tables. Time being limited we left again for Nice at 4 p.m. & made the return journey round the winding coast, and, after purchasing a supply of postcards & views, caught the ¼ to 5 train. arriving back at Musso at 11.30 p.m. after a 160 mile journey each way. Forgot to say that Monte Carlo is out of bounds but that did not worry us.\n\nNotwithstanding the orders received to pack up – everything is going along as usual again. It is evident that the British authorities do not want to hurry us away. (78)\n","55":" May:-\n\nEarly on Friday morning we had a terrific downpour of rain which brought down a couple of tents & flooded several others (much to the discomforture of the occupants).Between 1.30 & 3 a.m, 15 millimètres 08 of rain were registered\n\n ","56":" 29\" May 1916:-\n\nYesterday afternoon, I went for a run in the tram out to the old Provincial town of Aix - 29 km (18 miles). The journey took 2 hours & was very interesting – through fertile undulating country with everything so green & fresh and the fields covered with wild poppies & marguerites. Had a look at the Cathedral, public dispensary & museum – all of which are\nfearfully\n ancient. Arrived back at Marseille at 8 p.m. and then went to the Reiric \"Zone Novo\" at the Casino de la plague – getting back to camp about midnight.\n","57":" 1\" June\n\nOur camp is only about ½ mile from seafront and yesterday morning I commenced a series of early morning swims,\n\n \ngetting up at 5.30 a.m. & being back in time for breakfast at 7. This is the sort of thing to keep a chap fit ! (79)\n","58":" 5\" June 1916:-\n\nOn Thursday afternoon I went out to St Julien – ½ hr’s tram ride from Marseille – to look up some French people who used to live near our camp (Astrucs). They now live in a real country district. Spent quite a pleasant afternoon – especially whilst up in the cherry trees munching big fat cherries. Had to leave early as had another call to make in the evening..\n\nYesterday (Sunday) afternoon caught the tram out to he terminus a couple of miles further on than the camp (Mardrague) & then walked further on round the coast – just a short exploring trip. Caught the tram back to Parc Borély which we\n\n \nhad a good look through – very pretty. After dinner in town I went off to a French lesson. Have put in 5 evenings of French fag last week with various people who are helping me – seem to be making pretty fair progress.\n\nTomorrow a Sgt. & 2 of our men leave Marseille for Australia via Le Harve & England to be discharged from the A.I.F. as permanently unfit – all after some months of active service.\n\nYesterday we got 20 rank & file as replacements from Base Depot, Etaples. (80)\n","59":" 9\" June\n\nYesterday afternoon paid a visit to the Church of Notre Dame de la garde situated on a great hill from which one looks down on the whole city with the green clad hills in the background and the harbour\n\n \nwith it islands & fine shoal of water. The church is a fine big building (Roman Catholic) and very pretty inside – surmounted by a colossal bronze statue 30ft in height glittering in the sunshine. Came down the hill in the electric lift (84 mètres) which has been constructed for the purpose. Took a tram round to the Corniche and went into the \"Bains de Catalans\" for a swim. The baths are built on the continental style with a big open front set with tables & chairs for afternoon tea in your dressing gown – after coming out of the water. Mixed bathing of course. The French don’t go in much for swimming – they are poor swimmers & most just splash about in the water.\n","60":" 12\" June:-\n\nYesterday afternoon (Sunday) I went for a ride in the tram out to La Barasse..\n\n \n½ hr. distant. Where there is a fair number of Indian Troops in camp. Then went on to Aubagne – a sleepy old town, something like Aix and 10 ½ miles from Marseille. Went back to La Barasse – walked down to St. Marcel and caught a tram near St Valentine (where there is another British camp) back to the city. The country round Marseille is wonderfully pretty – everything so fresh & green, little narrow lanes bordered by low hedges \ngras\n grass covered meadows besprinkled with poppies, tall mountains in the background, etc. etc. The people are very countrified & \"aimable\". Speaking with a strong southern accent.\n","61":"\n","62":" June:-\n\nOur Unit here in Marseille has commenced to disappear. On Tuesday 10 Nurses were sent to Boulonge, 10 to Etaples & 5 to Abbeville. The\n\nfollowing day we learnt that no. 2 G.H. was to move to Boulonge and the O.C. with 2 officers & 25 men left the same night as an advance party while the remainder of us are still here.\n\nOn Wednesday night at 11 o’clock all clocks & watches throughout France were put forward on hour as the result of a day-light saving bill passed by the French Parliament. And it is indeed daylight saving – not being dark now until sometime after 9 p.m.\n\nYesterday evening went for a stroll through the slum area of the city. Marvellous how men, women & children can live among such surroundings, the streets being nothing more than dark, dirty, rough & narrow lanes into which the sun never shines. (81)\n","63":"\n\nOn Sunday afternoon \nw\n went out to\n\n \nL’Estagne – 43 minutes in the tram from Marseille on the seafront (opposite side of the harbour to which we are). Passed British, Indian & Russian camps on the way. There are quite a number of pretty tram trips round Marseille taking from ½ to 1 hour.\n\nHave again received orders to pack up our stores and this time it looks as if things are in earnest. A start will be made to-morrow with reveille at 5.30 a.m. daily.\n\nA course of instruction in Army medical work had just been started by acting O.C. (Lieut. Col. Dick) with 2 lectures a day, but on account of the extra work involved in packing equipment, it has had to be discontinued.\n\n50 more of the nurses leave tonight for the north, 10 each to St. Omer,\n\n \nBoulonge, Etaples, Rouen & Treport.\n\nThe Russians are doing well on the Austrian front & have just taken Czernowitz. At Verdun the French are having a quiet day or two – the Germans not being too busy. Very little is doing as usual, on the British front where so many of our Australian troops now are.\n\nGreat fire last in Marseille near the Docks when the flames from burning mineral oil extended for more than ½ mile. The firemen worked hard assisted by British & French troops. The British military petrol stores were burnt out.\n\nThe people here don’t seem to care much for the English (the word British is rarely used) They don’t seem to think their troops are doing enough. On the other hand Australians are greatly\n\n \nadmired – let us hope that our chaps keep a bit steadier than they did in Egypt. The French are jolly decent people, there is no doubt about that, although they think a good deal of themselves. They are intensely patriotic. Care\nnothing\n very little for their southern neighbours – the Italians. (82)\n","64":" June:-\n\nWe have been pretty busy for the past few days – no leave being granted at all until after tea. Yesterday afternoon however, general leave was granted & I managed to get away. First paid a visit to the fine big Cathedrale of Marseille which overlooks the Port and will hold 12,000 people. Then walked back to the Fort St John, a fortress of the old Knights of Malta but now used as military \n\n \nbarracks & prison. Had a look through the Fort and then caught a tram out to Allauch – a full \none\n hour’s journey into the country. Getting out at the terminus I enquired the distance to St. Julien, another terminus and found it to be 6 kilomètres. After some light refreshment, off I started on my little stroll and \nI\n arrived at St Julien about 50 minutes later after quite an enjoyable tramp along a narrow winding roadway between fertile fields & little homesteads with the peasants hard at work getting in the ripe barley.\n\nI arrived at St. Julien just in time to miss a tram but a labourer & his wife kindly gave me a lift in their cart to Beaumont where I dropped off to make my \"au revoirs\" to some people before leaving Marseille. The people who gave me a ride proved to be Italians\n\n \nalthough of course they spoke French quite fluently & asked me many questions about Australia & Australians during our little journey of 3 kilomètres. \n\n Before leaving my \"friends in need\", I managed to surprise them with the few words of Italian I have picked up. At Beaumont I only stayed a few minutes & after having to undergo the ordeal of embracing the whole family & receiving all sorts of good wishes, etc. etc. took my departure.\n","65":" 28\" June\n\nToday the loading of the equipment & stores on to the train has been commenced. It is raining steadily at 7 a.m. so that matters are not improved by the \"dew from heaven\" – a lot of our stuff such as blankets & clothing being done up in bales.\n\n \nOur train leaves from the Gare du Prado for the \n\n north at 12 noon to-morrow, a section of about 70 of all ranks being left behind at Muesot to carry on a 200 bedded hospital. \n\nHave been busy saying last farewells to my various friends of the south who have one & all wished me all sorts of good luck, plenty of letters to let them know that I am alright & a return to Marseilles if possible. Have been at Marseilles 3 months & it seems like 3 weeks.\n","66":" was Serbian Day & a General collection was made everywhere for the purpose of establishing a relief fund for the Serbian refugees little flags, buttons etc. being sold for the purpose. A charming young friend had asked me to get leave and act as her cavalier whilst she sold little flags all day, but it was quite out of the \n\n \nquestion when we received our final marching orders a day or two previously. (83)\n","67":" 1916:- Our journey to the North – \n\nOn Thursday our stay in Marseille came to an end and at 1.40 pm. Our long train, loaded with personnel & equipment steamed slowly out of the Gare du Prado. The people with whom I had dinner on Sunday night – Madame Boudet & her two girls Madeline & Jeanne were at the station to see me off. These warm hearted people have been very decent to me during my short sojourn in the south and I was jolly sorry to have to bid them farewell.\n\nWe arrived at Avignon at 7 pm. Where the train was shunted on to a siding where we stayed for two hours during which time I went for a short walk round the place which was a quiet old town, \n\n \nsomething like Aix or Aubagne\n\nThe train’s next halt was \nat\n one of 50 minutes at Orange into which station we steamed at 10 pm. Here I had a good feed and then turned in for the night. Our train accommodation varied. The men were mostly in 3rd class – 6 to 8 in an uncomfortable box carriage, while the Sergts & the majority of the officers & the few nurses that were with us travelled 2nd class. In our compartment there were only three – one chap \"dossed\" on the floor and the other two of us had a whole seat each: not too bad at all.\n\nAt 5.30 next morning we passed through Lyon with its wide streets & river spanned by many bridges. We first saw the Rhone at Arles (a large town on the other side of Avignon) & from then onwards until Lyon is reached, this\n\n \nfine sheet of water is constantly in sight, running parallel with the railway line. At Lyon the Rhone leaves the railway, and continues on its course to Lake Geneva and Switzerland while our train follows its tributary the Saone, past Macon (40 minutes halt) to Chalon where the river runs off to the right.\n\nA halt made at Les Laumes, where we picked cherries from trees growing in the fields close by, was prolonged a couple of hours on account of an accident to a French hospital train ahead of us; and then our last stop that night was at Montereau (from 20 to 11 until 11.30). \n\nJust after 5 next morning I was awakened by one of our chaps to have a look at Paris which we were then passing through. The train did not stop at \nParis\n France’s capital so as it was a cold,\n\n \nbleak morning I got between the blankets again as soon as we crossed the Seine.\n\nAt Epluches 29 kilomètres on this side of Paris a two hours halt was made and here we had a good clean up, breakfast and a stroll round the surrounding village. \n\nThe train left punctually at 9.30 a.m., too punctually in fact for two of our Sergts who \"missed the bus\" and came on a few hours later. At Epluches we over took a trainload of Australian infantry also making for the north, but they continued their journey soon after our arrival.\n\nWe ran through St. Just at noon, Amiens at 1.30 and arrived at Abbeville where there is a big British base depot. No one would think now that the Germans had possession of Amiens (taken on","68":" and lost it again to the French. We were due to stay at Abbeville about an hour\n\n \nbut as the train was running late there was a halt of only a few minutes. Soonafter passing through Albeville the English Channel came in sight and I got my first glimpse of the coast of old England. At Etaples (reached at 5.30 p.m.) we saw the big Australian & New Zealand Base Depot with rows & rows of tents near the railway line, and exchanged plenty of \"salutations aimables\" with the chaps who turned out to see us go through. \n\nThe train arrived at Boulonge at 6.43 pm. but went on to Vimereux Station where our long journey came to an end at 6.45 p.m.\n\nAnd now for my impressions of this journey from one end of France to the other! The scenery throughout was \"a picture no artist could paint\" Never have I seen such fertile country – one glorious\n\n \nconfusion of bright green foliage, smiling meadows, the broad calm rivers, little homesteads nestling among the trees, narrow winding roads showing up white among the surrounding green, swiftly running rivulets between grassy banks, fat cattle browsing contentedly on the thick herbage, and patches of wild flowers – red, blue, purple, yellow and white. In the fields the people (especially the women) were working all day gathering in the fast ripening crops under a cloudless sky.\n\nHow friendly the French people are! During the two and a half days I had many a yarn with soldiers guarding railways, tunnels, cuttings, etc; Red Cross girls who are willingly manning buffets at most of the railway stations; red cheeked workers in the fields who when our train might be shunted on to \n\n \n \n\na siding far from any station to allow an express to pass, came up to greet us and distribute flowers. Trains packed with cheery French troops continually passed us going in both directions. Some were going on leave , some returning to the trenches after a well earned rest while others were changing their position from one front to another.\n\nOur train with its long string of carriages and trucks was a slow old bus and crawled along making way for faster trains when necessary. This was all to our advantage, however, as with the pretty scenery, numerous halts and plenty of tucker that we were able to procure at station buffets, the journey never became monotonous.\n\nThe French railway system is very up to date. The big powerful \n\n \nOur train stops from South to North – \n\n Marseille Ailes Avignon Orange Macon Les Laumes Montereau Jewisy Epluches Creil Clermont St Just Ammiens Abbeville Etaples Boulonge Wimereux\n\nengines, comfortable carriages, dexterity with which traffic is handled, latest appliances & accessories, etc. would be hard to beat anywhere; certainly not in Australia\n","69":" 4\" July (3.45 p.m.)\n\nOn Sunday morning an early start was made on the unloading of our equipment & stores (180 tons) from the trucks at Wimereux Station. With the assistance of 27 large A.S.C. steam lorries everything was in camp by midday & by nightfall practically 100 beds were ready for patients. The next morning the wards containing the first 100 beds were completed and a start made on a second 100. In the evening orders were received to be ready to take patients and soon after 9 p.m. the first ambulances arrived with sitting up and lying down\n\n \ncases. A couple of hours later ambulances arrived again – empty this time. There was a hospital ship in the harbour waiting to take 70 on to England. The great British offensive was in full swing and every hospital must be kept clear – evacuating their patients across the Channel as fast as possible. Further patients arrived during the night and early morning and altogether we admitted 130 of which the first 70 we sent to Dover a couple of hours after being taken in. Everyone was kept pretty busy as we are short staffed and I was glad to turn in about 2.30 a.m. The British offensive commenced on","70":" & the same night we arrived at Boulogne from the south. The next day the unpacking of the equipment commenced and the following evening patients were being admitted & evacuated again. Not half bad going I can tell you. Wounded are still coming in today but in fairly small numbers.\n\nThe heavy boom of big gun fire from the British front can clearly be heard. We are only about 50 miles from the trenches & believe the Boches occasionally send a taube over in our direction for bomb dropping practice (at the expense of the people beneath). I have seen both aeroplanes & airships cruising round yesterday & today but they are British & French machines keeping their eyes open for hostile aircraft and also any submarines that might come stealing up the channel.\n\nThe place we are occupying is a hospital of tents formerly run by No.5 British Conval. Depot, we are about a kilomètre from Wimereux railway station, 3 kilom. from Boulonge and a few hundred yards from the cliffs from where the English coast can be seen. We are surrounded by British General & Stationary Hospitals (& a Canadian) – about a dozen in all.\n\n \nAmbulances are going backwards & forwards all day long, bringing men from the hospital trains and then a few hours later taking them to the hospital ships that run to & fro across the Channel.\n\nThe days are wonderfully long – it does not get dark until about 10.30 p.m. but it is much colder than the south & at present is rather cloudy & \nraining\n rainy. (84)\n","71":" 1916:-\n\nThe combined British & French offensive is well on the move – 4700 & 8000 prisoners respectively having been taken on a 25 mile battle front. To the south of the Somme the French troops have penetrated the German second line & Fricourt, Frise, Herbecourt, Feuilleres, Assevillers, Buscourt & Flaucourt Have been taken by the Allies. The Russians & Italians\n\n \nalso seem to be doing good work against the Germans & Austrians taking large numbers of prisoners & pushing back the enemy on both fronts.\n","72":"\n\nAt Boulonge Base there are 3 Brit. Gen. Hosps., 1 Canad. Gen. Hosp., 1 Aust. Gen. Hosp; 4 Brit. Stationary Hosps., 2 Canad. Stat. Hosps.; 1 Brit. Red Cross Hosp., 1 Aust. Vol. Hosp.; 2 Brit. Convalescent Depots = 15 Hosps & Conval. Depots. Since the offensive has commenced every Hosp. is being expanded as far as possible and the number of beds available is 15007 of which No.2 H.H. can contribute 800.\n\nA large number of German wounded have been admitted into No.8 British Stat. Hosp. exactly opposite us. They are wearing the ordinary blue hospital suits\n\n \nonly with the addition of a red arm band (& a guard with fixed bayonets). Managed to acquire a few Boches sausages.\n\nEverything is going smoothly – not many patients coming in which is just as well as the men are hard at work getting the place in decent shape.\n\nWe can hear the boom of big gun fire to-day; evidently the British fleet is bombarding the Belgian coast about 30 miles to the north.\n","73":" 8a.m.). :-\n\nYesterday afternoon I managed to get into Boulogne for the first time. Went in by tram (fare 25 cent.) – bought a couple of guides, dictionary, papers etc. and then walked back to camp – about 4 kilomètres. It was a lovely afternoon and being Sunday everyone could take advantage of it by getting out in the open. The view from\n\n \nthe cliffs on my homeward walk was very pretty – I could see the sea shore round to Cape Gris-nez, 21 kilom. away and half way to Calais with the little seaside places of Wimereux, Ambleteuse and Androsselles in between. Before reaching the camp I ran across a Frenchman & his wife strolling along and we had quite a long chat before I left them.\n\n12\" July (Wed 7 pm) :-\n\nOur O.C. Lieut Col. Martin, C.M.G. who has been on 8 days leave to England & Ireland returned last night and has taken over reins again from Lt. Col. Dick\n\nYesterday afternoon some guns on a hill to our left opened fire and put a number of shots into the Channel. Inquiry failed to elicit what was doing. It may have only been big gun practice.\n\n \nThe 1st, 2nd,","74":" &","75":" Aus Aust Divisions have been withdrawn from Flanders and are being sent further south. Our camp is quite close to the railway line and all day yesterday trainloads of our chaps have been running past as well as trucks of guns, wagons etc. making for another front. The French authorities handle all rolling stock and seem to be doing it pretty well too.\n\nWork continues to be brisk and we have admitted nearly 1000 sick & wounded since our arrival – practically all have been evacuated again, to England.\n\nHave not seen much of the district yet but when things get a bit easier I shall try and see as much as possible of this part of France. Am devoting as much time daily as possible to French, not being anywhere near proficient yet, of \n\n \ncourse. I should say that it takes about 12 months to read, write & speak \nfluently\n. I underline fluently because I shan’t be satisfied until I can speak as well as a giddy Parisien\n\nwe often see anti – aircraft searchlights at work at night, sending long pencils of light up into the heavens searching for something that I haven’t seen yet – German aircraft. (85)\n","76":" (9pm)\n\nYesterday evening I went into Boulogne and paid a visit to M. Chevalier, a lawyer who is chief of the local scouts. Seems a very decent sort of chap, speaks good English and asked me to come along to their Committee meeting which I promised to do if I could get away.\n\n \nThis evening another No2 G H. Sergt & myself started out for a visit to La Colonne Napoléone the top of which can be seen from our camp, in the distance. After a brisk walk of about 40 minutes along the country roads and through a small village, we turned off to the left opposite a British Convalescent camp and reached our destination. The column, which was erected by order of Napoleon to mark the place of his Boulogne camp, is nearly 60 mètres in height with a bronze statue of Napoleon on top 5 mètres in height. The column is of marble and its construction was commenced in 1804 by Marshal Soult. There is a ladder to the top of the column and I believe a fine view can be obtained by climbing it. However it was closed this evening and I shall have to go again. Our walk home \n\n \n\n \ntook about an hour and was through the fertile fields, across the railway and through Wimereux. I am going to try and do plenty of walks in the long evenings \nif we don’t get too much work.\n \n","77":" 16\" July (8 p.m):-\n","78":" 14\" inst was a public Holiday throughout France – it is so annually in commemoration of the taking of the Bastille. At Paris there was a combined route march of French British, Belgian & Russian Troops following which President Poincare precented diplomas to the families of those who have fallen for their country. Nothing out of the ordinary happened as far as we were concerned. \n\nYesterday afternoon firing commenced in the Channel from torpedo destroyers which were also racing about like\n\n \n\"one o’clock\". An aeroplane also started scouting round but I haven’t the faintest idea what the fuss was about.\n\nWent into Boulogne this afternoon & saw the local Scouts for the first time. They are only about 60 in number but a smart looking lot. At 5.30 p.m. I went to an Evening Service at Holy Trinity C. of E. Rue de la Lampe.\n\nThe city is full of troops, practically all being English, Scotch & Canadians (as well as plenty of French, of course ) – there are only a few Anzacs stationed in the Boulogne area.\n","79":" \" July(1.30pm):-\n\nWent into Boulogne last evening to see the Scouts who met (about 50) at the la Statue de Mariette Bey. Found\n\n \nthe French very hardy of course. So far I have managed to get many opportunities for conversation although I am doing a fair amount of correspondence to the south.(86)\n","80":" (8.30 a.m.)\n\nHeavy artillery heard early this morning and is still continuing – the allies must be making an offensive on a perfect day, the first I think we have yet had in the north. Before daylight the star shells were plainly discernable.\n\nIreland boasts the Vale of Avoca and Wales of LLangollon but who has visited the Vallleé du Donaire of France. Yesterday afternoon two of us paid it a visit, going via Boulonge, by a byway past the Château de Wicardenne, now occupied by les Petites Seurs des Pauves, into the valley with its\n\n \nnarrow pathways, many glades and delightfully shaded spots. Emerging from the Vallée we arrived at the quiet little hamlet of Wimille where , while partaking of some light refreshment in an \"estaminet\" I had to listen to a long recital from a little hunchbacked girl who worked all day & every day in the \"octroi\" (village-customs house) – she had three brothers in the French army, one of whom was killed at Verdun; he had fought in Tunis & Morocco as well and she showed us his 4 medals. We then retraced our steps through the Vallée du Donaire to Boulonge, had a glance inside the fine Cathedral of Notre Dame and walked back to Wimereux via the wide beach with its bathing boxes & coloured tents. Further along the coast at Wimereux\n\n \nbeach a large number of bathing boxes & machines are being used to accommodate patients and I’m sure they \"wouldn’t leave their little wooden huts for anyone\".\n","81":" (10pm) :-\n\nYesterday evening I went for a walk over to Wimille 1½ kilomètres from Wimereux railway station & a very pretty walk too along a narrow white road bordered by green fields & rural cottages, past pretty meadows, over a bridge, along a fine avenue flanked by tall trees into the quiet village. Here I bought some postcards of Wimille & la vallée from my hunchback friend and then retraced my steps. From the bridge over the Wimereux where it passes through Wimille I stood for a few minutes to watch 2 enthusiastic fishermen (English officers) with rod & line playing for trout & other fish.\n\n \nThis afternoon two of us went to Le Portel a fishing village on the \nother\n coast the other side of Boulonge where the quaint dress of the villagers is quite interesting. A local patois (different from \nthe one\n that of Southern France of course) is spoken among these people. I believe they do not intermarry with strangers & rigidly preserve their customs. A fine panoramic view of the town, river Liane, harbour etc. is obtained on the way out. We passed through Le Portel & continued along the cliffs looking in at the Signal Station & Fort on Cape d’Alprecht when the obliging French navel men explained everything to us. A return was made along a broad stretch of beach at the foot of the cliffs, past a big British ammunition depot and the busy docks.\n\nThe day before yesterday there \n\n \n was \"some\" row when a German aeroplane bombed an ammunition factory at Calais not more than 15 miles away. The explosions were very heavy and at times shook the very earth.\n","82":" 26\"","83":" (4.30 pm) :-\n\nAm whacking into the French as hard as I can go - there always seems to be something fresh to learn. At Mussot we had an Interpreter attached from the French Army but here there is no one so I am filling the position of \"Acting Interpreter – in Chief\" to the Unit as well as translating correspondence for chaps individually – mostly from amorous young ladies in the south of France who profess undying, unquenchable, etc. etc. love for the gallant of their choice.\n\nWeighed myself on Sunday and\n\n \nreached 70 kilos. ( a kilo = 2lbs 3 ½ ozs) (87)\n","84":" 27\" July (9pm)\n\nThis afternoon I went on a tour of inspection round the city of Boulonge - sur - Mer. I found St John’s Church of England, Hôtel de ville, Palais de Justice, Théâtre municipal, Jardin des Tintelleries, City tennis courts. Spent an interesting quarter of an hour at the fire station (Hôtel des pompiers)) when fire drill was on. The firemen are soldiers from the garrison. Went over \"the Château\" now used as French headquarters & barracks. Had a look at the underground chapel and also a number of subterranean passageways & vaults which extend under the whole city so my guide, a friendly French private told me. The Chateau is entered from the upper or old city, i.e. from the ramparts in \n\n \none corner. The upper city is fearfully ancient and surrounded by ramparts & battlements with arched gateways let into the walls in several places. The lower city is more modern and extends down to the waterfront. I was not able to see the Museum & Public Library (Musée et Bibliotheque) as they have been closed \nfor\n during the duration of the war.\n","85":" (130 p.m.)\n\nOn Sunday afternoon some firing was heard in the Channel and all of a sudden a mine was exploded and there was a tremendous roar with an accompanying column of smoke & water. I was near Wimereux beach when it went off and you ought to have seen the way the civilians lying & strolling about the sand became galvanized into sudden life. Everything was soon quiet again however.\n\n \nThe same afternoon I had quite an interesting yarn with one of our chaps, who was in several towns in Belgium, including Antwerp & Ostend, when bombarded by the Germans two years ago; he was then in the Belgian Army Med. Corps and was sent out to Australia for a sea voyage & rest cure. He however, enlisted in the A.I.F. and was sent to us with reinforcements. He has several brothers in the Belgian Army. Told me quite a lot about Belgium & the north of France. \n\nThe French authorities are releasing a large number of their Troops for the harvesting season until the end of August to get in the crops. France is essentially an agricultural country & it is vitally important that the food supply for the next twelve months be assured – armies can’t fight on empty stomachs. It is quite a usual thing to see labourers working in the fields \n\n \nin their uniforms or portions of it.\n\nThe Germans have been practically since the commencement of the war in possession of a fair amount of France including a portion of the Department (Pas-de-Calais) in which Wimereux is. They are forcing the civilians to work for them – food is scarce & dear so that the lot of these unfortunate people of the North is not too pleasant. There are a large number of refugees living about here – both French & Belgian.\n\nTwo of us\ntried\n applied for leave to go up to Calais – it is only an hour and a half’s run in the train – but we were turned down by the Base Commandant. In the war zone no one is allowed to leave the area in which he is stationed.\n\nArthur Felton Came over from No.1 Conval. Depot to see me last night. He had quite an exciting time with\n\n \nthe","86":" Battalion up round Armentieres and down on the Somme.\n","87":" (8pm) :\n\nHave started swimming up here – had one off Wimereux beach yesterday & another a bit further round the coast today. The weather is very decent now & I shall try & get a dip in the briny every day while it lasts. The O.C. Has had bronchitis and is at present convalescing at No. 32 Brit Stat. Hospital which used to be Lady Dudley’s Aust. Vol. Hospital and is right on the cliffs a full two miles round the coast going north. I have to go up and see him with papers & things at least once a day – to day it has been twice. (88)\n\n ","88":" 10\" Aug (7 a.m.)\n\nIt is wonderful how quickly the days go by – there is so much to do every day & time never gets a chance to hang on ones hands. From 6.15 a.m. to 10.30 or 11p.m. there always seems to be something to do including, when I can manage to get it in French & swimming which are at present my only forms of recreation. The French can hardly be called amusement – it is too solid. I have been keeping it up steadily for 7 months & hope to be pretty proficient in another 5. The weather is at present fine & the swimming good although the Channel is pretty cool.\n\nA couple of days ago King George came across to France & his ship was escorted by 6 destroyers 2 submarines & two airships making I believe, a jolly fine sight. I did not see it as there is \n\n \na slight rise between our camp and the Channel. The O.C. Lt. Col Martin is still at No.32 Stat. Hospital & I am continuing my daily visits to him. A few days ago I had a good look at a mine which had been fished up out of the Channel & was in good \"working order\". The torpedoed \"Sussex\" (you will no doubt have seen something about her in the papers) has been in dock at Boulogne & I saw her being towed out stern first on Monday evening. (89)\n","89":" 13\" August (3.30 p.m):\n\nYesterday two of us hiked to Calais & back. We got away from Wimereux at 11.40 a.m. and made for Calais 30 kilomètres distant by la \"route de Calais\". After passing through the villages of Wimille, Wacquinghon, Marquise, Leulinghen, Leubringhen, &\n\n \nCoquelle we reached our destination at 1.50 pm. when we immediately set to work on a good meal and then rode round the town to look at various places of interest – Gare Centrale, monument des Bourgeois de Calais, Place d’Armes, Le phare, lerport, gare maritime, quais du basin Carnot, Monument des Sauveteurs, la plage & le casino, les forts, Monument du Souvenir Francais, le parc, le nouveau Théâtre, Hotel des postes, Jardin Richelieu. The plage (beach) is a fine one & the best I have yet seen in France – the Casino faces right on to it and is now an R.A. Hospital. The shipping arrangements with basins & canals are very complete. Of course I struck members of the local section of the Eclaireurs de France & also their\n\n \nSide Note\n\nPopulation of Calais is now at least 80,000\n\nPresident – they doing quite a lot of public service including the running of French & Belgian soldiers, clubs, etc. Saw several members of some English women’s Corps who wear Khaki uniforms & drive ambulances etc. Calais is a Belgian army base and the town & surrounding country is very active with their Troops & transport. We set out on our return journey by another route – 40 kilometres in length – & running round the coast the whole distance to Wimereux. Left Calais at 4.45 p.m. & taking it easy in view of the fact that we had to ride 25 miles & I had done no biking for nearly two years, rode through les Basaques, Sangatte, Escalles, Wissant, Tardinghen, Audinghen, Audreselles to Wimereux which we reached just before 8.30 p.m. The road was good \n\n \nSide Note\n\nThe Calais trams have women drivers. Have seen women ticket collectors before in France but not drivers.\n\nall the way although hilly in parts – a couple of times we took the wrong track & had to retrace our steps. The journey was a strenuous but none the less interesting one. Along the Route de Calais one passes through agricultural country the whole way while by the seashore route we had the green & brown fields on one side & the sea with its long sandy beaches & rocky coastline on the other. A wonderfully pretty spot was the little village of Escalles which lies in a fertile valley by the sea between two tall hills. Might mention that being in the \"Army Zone\" no one is allowed out of the Boulogne area without special authority and a previous applic. of mine to go to Calais had been turned down – nevertheless I got there; the various French picquets passed on the way never said a word.\n\n ","90":" 14\"","91":" (2.30p.m):-\n\nThroughout Boulogne & Wimereux various patriotic citizens are giving cellars etc for places of refuge should an air raid take place. These shelters can be recognised by a green flag flying above the \"dug out\" & a small notice \"abri public\" (public shelter) posted up beside it.\n","92":" 29\" Aug. (5 p.m):\n\nEver since arriving in France I have regularly obtained the French daily papers. The local paper here is \"Le Telegramme\" which contains some very interesting articles & circulates through-out the Departments of Pas-de - Calais Nord & Somme all of which are in the War Zone. Parts of the two first-mentioned Departments are in German possession & from the Télégramme one \n\n \ngets quite a lot of interesting information about this part of France & of Belgium also, escaped prisoners etc arriving with news from time to time. Great indignation is being caused here by the deportation into Germany of large numbers of French & Belgians from the country captured by the Germans.\n\nOne of the towns of the Department we are in (Pas-de-Calais), Arras has been bombarded for a long time by \"les boches\" & they are still at it, I see from to-day’s paper. It is too far away to hear the guns.\n\nThe zeppelins have been very busy over England lately & the coasts on both sides of the Channel are now alive with searchlights as well as the patrol ships. Plenty of firing was on a couple of nights ago when\n\n \n there was a big raid on the English coast. In this part of France no civilians are allowed to show lights in their houses after 9 p.m. As you know, we have a daylight saving bill in force & although the days are getting shorter, it is yet hardly dark at 9. The winter is going to be pretty severe I guess. The last few days have been windy but today it has rained like \"billyho\" & half our camp has nearly been flooded out. \n\nGreat satisfaction was evinced yesterday when it became known that Romania had declared war against Austria-Hungary. The French are immensely pleased.\n\nThe work of getting in the crops seems to be progressing satisfactorily and\n\n \nwith the assistance of the French Troops freed for a short period from their military duties to lend a hand, it should all be in before the bad weather commences. In the Dunkirk area both French & Belgian troops are working in the fields & it is estimated that they will finish getting in the harvest in a fortnight.\n\nOn account of the heavy drain on the purse of the French nation in keeping up the war, practically all food commodities are taxed. There is also a fixed price for everything to be sold at & proclamations or \"arrêtés\" on these subjects appear from time to time, issued by General Eydoux, Military Governor of the North. The people living just behind the firing line & in the neighbourhood of the Front don’t mind how much they charge British troops\n\n \nfor provisions etc. although I have found things on the whole fairly cheap, certainly nothing like as dear as in Egypt.\n\nThe French Parliament must have plenty to think about on account of the war. The reparation of damages done by the Germans in the north, relief to be afforded to refugees who have had to leave their homes, assessing of damages done by British Armies during their sojourn in France, the arranging of continued supplies of food etc both for the civilian population & the army, the finding of men to swell the ranks of army, navy & munition workers, etc, With reference to the last named it is rumoured that after 2 years of war, the government are going to submit all \n\n \nexempt & discharged from the Army to a new examination to see how many are fit for further military service.\n","93":" you know what a \"marraine\" is?. \"Marraine\" is the French word for \"Godmother\" and throughout France there are many marraines (for the war only). Lonely poilus in the trenches who have no friends write to women & girls who then become their godmother or marraine & send letters, cigarettes, packets of eatables etc to their \"filleul\" (godson) as he is called..I know of one girl who has about 40 \"filleuls\" & this young Marraine keeps up a regular correspondence with them all & sends them packets of smokes & things as well. (I suppose you know that \"poilu\" is the nickname for a French soldier, like \"tommy\" for an English soldier & \"Anzac\" for an Australian.\n\nWhat fine people the French are & what a fine country they have. The \n\n \nlanguage, customs, country & people themselves all interest me. It is interesting to note how much they are going in for outdoor exercise, sports , etc. all of which are quite new to the nation as a whole. They are all keen on learning English but have no wish to become English people.\n","94":" 7.30am:\n\nhad plenty of rain On Tuesday with a heavy rainstorm in the afternoon & yesterday was also pretty bad – cold, windy & raining. The majority of the tents stood the strain well although I don’t think they will last the winter. We have just received information that huts are to be provided for the personnel & 800 patients, although we should be pretty well into winter before they are erected. (93)\n\n ","95":" 7\" Sept. 1916, 10.40 pm;\n\nThe French Military Authorities are demobilising those of their troops who in civil life were railway employees. Notwithstanding the fact that females are being employed wherever possible, enough men are not available to cope with the heavy military traffic that continues ceaselessly day & night over the French lines. The French railways are very up to date & the rolling stock is very extensive. Belgian engines are also being used & some of them are being run by British workmen. \n\nWhat is becoming of the French Merchant Service? Not less than 66 % of the shipping has been taken over for transport etc. purposes & trade must have declined in an alarming manner.\n\nThe refugees from the part of France occupied by the Germans are still wondering when they are going to \n\n \nbe compensated by the Govt. for the loss of their homes & properties. No-one knows! (Neither does the Govt. evidently). The number of refugees in the Department of le Nord not invaded, is not known; in the Pas-de-Calais it is 119,000 & in la Somme it is 28,000. (94) \n","96":" 14\"","97":" (1.30 p.m):\n\nI was in Boulogne the other day & went into the office of the \"Telegramme\" newspaper & turned up the back files from the commencement of the war. Had a good look at these & found them very interesting.\n\nWas talking to a lady the other day who told me that she saw the landing of the first British Troops in France two years ago. A battalion of Highlanders were the first to be disembarked.80,000 Troops were landed at Boulogne from England in the first 10 days of the war. The retreat from Mons which \n\n \ncommenced on 24\" Aug must have tried these troops severely but the battle of the Marne which took place a fortnight later was indeed a victory for the French & British Troops that took part. I have just been looking at a map showing the line once held by the Germans and showing their present front, many miles behind the first one. There is no doubt that the battle of the Marne saved France. \n\nThe German Zeppelins & aeroplanes are pretty busy and every night I see the beams of light flashing up into the sky in their search for enemy aircraft. Recently both the towns of Bethune & & Abbeville were bombarded – the latter only a week ago. Calais has had no bomb – dropping practice carried out by the Boches since","98":" \n\nA large amount of provisions is sent regularly by the French & Belgians to prisoners in Belgium & Germany and\n\n \nand this has been kept up ever since the war started. Some reciprocal agreement has been arranged with the German authorities.\n\nIn France civilians who have claims to make against British Troops either for the supply of food & billeting or for damage to property, who do not get satisfaction from the Officer commanding the troops, can apply to the mayor of the Commune who in turn forwards it to the British Claims Commission. If the Commission does not adjust things satisfactorily another application can be made to the French Civil Courts, who will finally decide the question & assess the amount of compensation to be awarded.\n\nRumour hath it that the French Govt. is to shortly issue more National Defence Bonds (at 5 %) and there is \n\n \nno doubt that the people will rise like one man to the occasion. There are two points one cannot help noticing with regard to the French nation – one is its thriftiness & the other is the way it backs up the Govt. in money matters, e.g. subscribing to a War Loan. \n\nToday we had a surprise visit from Mr Lloyd George who is probably the most prominent man of the day at present. He had a good look round and then buzzed off surrounded by motor cars, generals, colonels etc. Senator Mc Dougall was our last visitor. (95)\n\nThurs. 21st Sept. 1916 8p.m:\n\nYesterday was my 20th Birthday. The last one I spent in Egypt and the previous one in Egypt. Where will the next be I wonder. There was nothing\n\n \nto mark the day except that I received a card of good wishes & a sprig of wattle from one of my old Scouts. The day itself was cold, cloudy & windy. In fact, we have not had a decently fine day for some time & it is getting too cold for swimming. Nevertheless I haven’t yet tired of France.\n\nWhen is the war going to be over? No one knows! The Germans are jolly strong & I think it will last at least another year. When the war started I said it was going to last 3 years.\n\nThe French are thinking of emptying their prisons & sending all criminals to the front. It would give them another 15,000 troops. \n\nIt is proposed to hold a re-exam of all men who have been declared exempted from military service & the\n\n \nFrench people don’t like it at all. They think that they have just about done their bit and that if more men are wanted the other allies should find them. (They do not think that England is trying her hardest – although they are thankful to Australia for having sent many troops from so far away) (96)\n\nMonday 25\"","99":" (7pm):\n\nYesterday I did a bike trip from Wimereux to St. Omer a town 53 kilometres (33 miles) away inland in the direction of the firing line. I borrowed the same old service bike that I rode to Calais on & left the camp with two other chaps at 10.45 a.m. after going about 15 kilometres the other two dropped behind and as they did not catch up I went on on my own, up hill & down dale passing through numerous \n\n \ntypical, sleepy little French Villages surrounded by fertile cultivated fields, in which the people were working getting in the last of the crops. I have already more than once described the beauties of the rural country of France so that shall not do so again. The roads were perfect & as I had a bright fine day for the ride & no mishaps with the bike, no hitch whatever occurred & I rode into St. Omer at 2.45 pm. – exactly 4 hours after leaving Wimereux. Three kiloms. this side of the town the\nrode\n road passed through the biggest British aircraft Depot in France. Great hangars & workshops alive with men of the Royal Flying Corps at work, and last but not least the machines – stacks of them! Aeroplanes, - bi-planes, monoplanes, etc. I saw several go up, skimming across the turf & then rising in the air like great birds.\n\n \nA couple also alighted about the same time. On arriving in the town I rode into the Place Victor Hugo & seeing a small restaurant went in & took a seat between two French soldiers where I soon set to work on a good feed. Then went round to Base Headquarters (old French barracks) & had a wash & a brush-up. From here I proceeded to the Grande Place, past the Town Hall into the pretty Public Gardens which presented quite an animated appearance – British, French & Australian soldiers as well as civilians. I ran up against a couple of French Scouts here & after introducing myself to them went for a stroll with them through the Gardens. My time being extremely limited I soon had to say \"au revoir\" & after buying a supply of postcards set out about 4 30 pm on the 33 mile run back to camp. St. Omer has\n\n \na population of about 22,000 is situated in pretty undulating country and is linked to the port of Calais by a canal about 20 miles in length. There is nothing much of interest to see except perhaps two or three old churches & of course the gardens which are very pretty. The ride back took 4 ½ hours, the most \"interesting\" (?) features being the number of hills I had to climb & the fact that the latter part of the journey was done in darkness. In all I did about 70 miles – not a bad performance. The other two chaps who had started off with me only got as far as Escuilles, nearly halfway to St. Omer & then gave it up as a bad job and went back. On the return journey, about 20 kilometres from St. Omer, I met a solitary Australian biking in the opposite direction. He belonged to the 1st \n\n \nAnzac Cyclist Battalion and was on his way \nback\n back into Belgium after coming down to visit some friends. He had been billeted at a farmhouse in this part some time before & had probably been asked to come again.\n\nOn Friday night we heard the sound of gunfire from the direction of Calais & star shells started to go up at 11pm. It was a zeppelin over Calais which it afterwards transpired was driven off by anti-aircraft batteries withdrawing before being able to do any damage.\n\nOn the following evening I was coming back to camp with a chap & we heard a boom, boom, boom from the direction of England. A Zeppelin raid over \"Blighty\" I said, and I was right. Fifteen airships attacked England that night, 2 of which were brought down & the others driven off not however \n\n \nbefore they had done some damage, killing & wounding over 100 people.\n\nThe activity in the air is very marked at present. On Saturday the French brought down no less than 24 German machines, One of the French aviators has now the honour of holding the record for bringing down enemy aircraft – 18 to date.\n\nThe town of Reims, so well known in history has suffered much. The enemy commenced to bombard it early in the war and even now they are still at it. Yesterday morning they dropped 31 shells into the town in an hour, the damage done being a man killed & a woman wounded as well as bringing down some buildings. The population of this city was over 100,000 when the war started – now it is 15,000. The town is dead – even grass is growing in the streets.\n\n \nThe German lines are 3 kilometres away. There are no tramways, gas electricity, telephones nor telegraphs. Many of the people live in caves & underground houses. At the same time, there is plenty of food, military bands play & there are cinemas for the troops.\n\nWas forgetting to mention one interesting thing I saw during my ride to St. Omer & that was the little steam trams that connect up the various villages, The rails are laid in parts along the side of the roads & in others they cross through fields or round the side of a hill. These trams are only little things but it is very interesting to see one puffing along. They must be very handy for the country people. (97)\n","100":" 27\"","101":" (11 p.m.)\n\nNight before last the reflection on the sky from artillery fire was very clear. Looked just like summer lightning.\n\n \nThe same night there was another air raid on England. Seven Zeppelins attacked & did a fair amount of damage.\n\nFranco British forces have just taken & Thiepval & Combles on the Somme front. Good news, this.\n\nPaid a visit to Etaples this afternoon, an hour’s journey down the line, & the Australian & New Zealand Base depot. From here we caught a tram to the watering place of Paris Plage with its long beach, esplanade & row of fine houses facing the seafront. Walked back to Etaples (5 ½ kilometres) mostly through the forest of Le Touque wonderfully pretty. \nlights\n Arrived back at Wimereux about 8.30 p.m.\n","102":" (10 p.m)\n\nOn Saturday night, 30\" Sept. I went\n\n \nto a \"Grand Gala\" in the Municipal Theatre, Boulonge in aid of the \"Oeuvre des Combattants des Région envalier du Nord et du Pas-de-Calais.\" A packed house applauded a fine programme of musical & vocal talent – most of the artists coming up from Paris to give their services. A young refugee from Lisle told me afterwards that it was the best Concert he had ever attended. Not the least interesting item was a song in the Patois (dialect) of Lille by a French \"poilu\". The French as we know, are very devoted to their country & the patriotic fervour was very apparent during the performance when reference was made to the country & its parts in the hands of the Germans. It was quite a long programme commencing at 8.30 p.m. & finishing at 1 a.m. (4 ½ hours), there were so many \n\n \n\n \nenthusiastic encores. Although the gala did not finish until 1 a.m. , I arrived back at camp at ¼ to ","103":"\n, not-withstanding the fact that Wimereux is some distance from the town of Boulogne. How did I do it? Very easily because 1 a.m. on","104":" marked the end of the summer time period and on the stroke of \none\n all clocks & watches \nhere\n throughout France had to be put back one hour (winter time). And that is how I got back so early. \n\nThe evenings get darker much quicker now of course. When we first arrived in the North it was dark about 10.30 pm. (summer time of course) but now (with the recent addition of one hour winter time) it is nearly dark at 7 p.m. and the evenings are still getting shorter of course.\n\nAm sending home tomorrow by one of our chaps being sent back to Australia on account of old age, a sketch that was made of me about 3 weeks ago by a Frenchman, a celebrated Statuaire from Paris. This gent, M. Cornille Theunisson was staying at Wimereux with his wife & family & I met them one day on Wimereux beach. I saw quite a lot of them before they went back to Paris & old man Theunisson did a sketch of me before he went- He is not an artist but a statuaire & has done very fine work from the photos he proudly showed me. I noticed he wore the ribbon of the legion of Honour. (98)\n","105":" (7.15pm):\n\nThis afternoon I have been out to Hardelot – a seaside resort 15 kilometres from Boulogne by tram. The run out takes over an hour & I had to change\n\n \n \nAt Pont-de-Briques I saw the Chateau where Napoleon stayed when his army to invade England was encamped outside Boulogne.\n\ntrams at Pont-de- Briques, 5 kilometres from Boulogne. The remaining 10 kiloms. is an interesting part of the journey. In one part the tram passes through the Forest of Hardelot with a little further on tall sand dunes on the right & fertile fields on the left. The lakes of the \"the Mirrors\" & \"Clear Water\" are passed & then we arrive at the Chateau d’ Hardelot an old feudal fortress where Henry VIII once resided for some time.\n\nNear the Chateau is a cottage which belonged to Charles Dickens. The Chateau stands in splendid grounds & before the war was a great centre for tourists – the golf links being well known. However, now it is a centre of military activity where there are rows of white tents & Machine gun and Lewis gun schools established. Hardelot itself has a fine beach & also a splendid tiled \"dique- promenade\" 2000 ft. long. Bleriot the aviator lived in one of the houses facing the seafront & also had his hangars at Hardelot. \n\n \nIt is wonderful how quickly time goes – now over six months since we landed in France and another week will see the second anniversary of my enlistment. I was thinking I had been long enough ensconsed well back from the firing line and would like to get into the field where things are a bit more interesting. However, the \"old man\" doesn’t see things in this light at all and although there are quite a number of us who are willing to move off at a moments notice he says we are doing quite good enough work here. Perhaps he is right. At anyrate I don’t think there will be any developments for the present \n","106":" 16\"","107":" (9 p.m):\n\nA referendum is to be taken as to\n\n \nbe taken to see whether the people of Australia are willing to have conscription. Voting had been arranged to take place for all Australians eligible in France, Egypt & England. Voting here should have commenced to-day but it has been postponed for some reason or other. I reckon that the result of the poll will be \"NO\".\n\nLeave to the United Kingdom is now commencing & is causing great excitement in our Unit. I sent in a list of names this morning to Base H.Q. of 195 Officers, N.C.Os & men who have not yet had leave & giving the order in which the O.C. wished them to go.\n\nIt has been a big job arranging this list in the order men should go – taking into account their length of service and also\n\n \nthe fact that the smooth running of the hospital must not be interfered with. I have been bombarded with questions from morning to night – all concerning leave of course. It is the one & only topic of conversation. I was forgetting to mention that I also had to find out to which railway station in the United Kingdom each man wished to go to and also try & arrange for pals to go together. At any rate, I shall be glad when the whole of this leave business is over. \n\nYesterday was the second anniversary of my enlistment in the A.I.F. – 6 weeks in camp in Australia, 8 weeks on a transport, 14 months in Egypt, 6 ½ months in France. How time has passed. \n\nAm trying to get 5 days leave\n\n \nto Paris notwithstanding the multiplicity of \"Heads\" it will have to pass for approval as well as the usual amount of British red tape. Leave in France is an almost unheard of thing and the Imperial people don’t seem to take too kindly to it. I got the OC to forward a recommendation about a month ago but it got no further than the Deputy Director of Medical Services Boulogne who \"disapproved\". However I waited a little while, and then put in another, recommended by O.C. We shall see what happens to this one.\n\nThe French Army is now divided up as follows:-\n\nActive Army – Classes 1917 to 1914 inclus.\n\nReserve of Act. Army – \" – 1913 to 1903 \"\n\nTerritorial Army – \" – 1902 to 1896 \"\n\nReserve of Territ Army. – \" – 1895 to 1890 \"\n\n \nAll these have been called up \nwith the exception of the oldest \n since the war started & also three more older classes – 1889, 1888, & 1887 making 31 in all. Therefore under the conscription system \nthe\n every \nabl\n able bodied man from 19 to 50 years of age inclusive is serving. The oldest class however are at present in their homes (class 1887 = men of 50) while the second oldest class (1888 = men of 49) is only partly mobilised. (100)\n","108":" 28\"","109":" (8.30 pm)\n\nMy six days leave to Paris –I\n\nOn Saturday evening,","110":" I received the necessary permission to proceed on 6 days leave to Paris commencing from","111":" inst. I caught the train at 1.30 a.m. from Gare Central, Boulogne and arrived at St. Roch at 7 a.m.\n\n \nwhere I changed for Rouen into a cramped train for the most part full of French troops returning to their units from leave. Arrived at Martainville Station, Rouen about 2.30 p.m. – 2 ½ hours late ( all trains France are running late during the war on account of the heavy traffic). I walked through this fine old town with its ancient churches and splendid Cathedral, bought a few postcards and then got the train at 4 p.m. at Gare Rue Droite (on the line Le Havre – Paris) and got out at Vernon 2 ½ hours later – I was on my way to the little village of Bray et Lû to stay the night with some friends. From Vernon there was no train to my destination 17 kilometres away, until next morning so I took a taxi and was soon exchanging salutations with my friends whom I had not seen since leaving \nAust\n Marseille. I had\n\na look around the village that evening & the next morning; and then we all left for Paris, spending a couple of hours in Vernon – a very interesting place which was occupied by the Germans in the war of 1870. Arrived in France’ s capital at noon and, after having my Pass examined at the Brit. Mil. Police office, spent the afternoon in the city going through the big shops of Printemps, Bon Marché, Lafayette & Louvre which were crowded with shoppers and where I saw Parisiennes at their best. My friends were leaving Paris the same evening for the south and I saw them off at the Gare de Lyon at 6 p.m. And the commenced \"Part II\" of my leave. I put up at the Hotel Mont Fleuri in the Avenue de la Grande Armée, Etoile – one of the most select quarters pf Paris. The next three & half days I was on the go\n\n \nthe whole time – visiting first of all Mr. Clegg (Manag. Director of Darracq Limited), Av du Bois de Boulogne – (the next Boulevarde to Av de la Grand Armée) and also four French families I knew who live in different parts of Paris. Was out to dinner five times; went to two theatres, Folies- Bergere – the biggest Music Hall in Paris, and the Hippodrome in the Monmartre Quarter – both dazzling with electric light which showed up to advantage the dresses of the women and the smart military uniforms especially when the \"promenade\" was on during the interval. Walked the crowded Boulevardes at night when the people were either hurrying to and fro, or smoking & drinking coffee in the Cafés. Travelled by metro, taxicab, train, tram, autobus, aerial railway, & river ferry on \n\n \nthe Seine. The Paris \"tuppeny tube\" (metro) connects up by underground electric train, the whole of the city which covers an area of 7,800 hectares, is 15 miles in circumference and has a population of over three millions. Strolled through the Latin Quarter and along the Boul. St. Michel thronged with students and surrounded by schools for which the quarter is so famed, and sipped coffee in the Taverne de Panthéon. The Panthéon itself is in the Latin Quarter and is a fine temple with beautiful paintings on the walls & in the crypt of which some of the great men of France are buried, Voltaire, Rousseau, Victor Hugo, etc. Had \"5 o’clock tea\" at the Ixe in the Place de la Opéra – one of Paris’ smartest tearooms.\n\nSaw most of the monuments, Museums, Gardens, Palaces, etc. – Arc de Triomphe \n\n \nde l’Etoile, Cluny, Grand Palais, Petit Palais, Hôtel de Ville, Hôtel des Monnaies (Mint), Les Invalides, Le Louvre, The Palace & Gardens of Luxembourg, Obélisque de Luxor, Obsérvatoire, Palais de Justice & Conciergerie, Palais Royal, Panthéon, Tour Eiffel & Champs de Mars, Trocadéro Opéra, Odéon, Place de la Bastille & Colonne de Juillet, Tomb of Napoleon, Port St Denis, Porte St. Martin, Place de la Concorde, Av. de Champs Elysées, Pont Alexandre III, Palais et Jardins de Luxembourg, Bourse, Tuileries, Chambre des Deputés, Colonne Vendôme, La Sorbonne, Tour St Jacques, Parc Monceau, Grande Roue, Fortification, Gare d’Orléans, Headquarters of the Eclaireuers de France, Crédit Lyonnais, Bank of France, Arts Décoratifs, Ministere de la Marine. I cannot describe all these of interest as it would \n\n \ntake too long but will mention the Invalides which is about the most interesting of them all and is the French \"Chelsea Hospital\" where the old pensioners live. There is a splendid exhibition of every kind of enemy equipment and clothing, guns, aeroplanes etc. etc. taken during the present war and also various war-worn French weapons & machines each of which has a history attached to it. There is also an old Artillery museum, two armoury rooms of old guns, rifles, etc., a big library of old volumes & rooms full of interesting relics. There is no doubt that France is a military nation. Napoleon’s tomb surrounded by all the colours he captured in his military career, and the Church St. Louis adjoin the Invalides.\n\n \nI visited several fine Cathedrals & Churches – La Madeleine, Notre Dame, Sacré Coeur, St. Augustin, St Chapelle, St. Germain l’Auxerrois Sainte Trinité,Egilse Russe, Eglise St Louis.\n\nHad a look at a French Hospital at Auteuil in the","112":" arrondissement (Paris is divided into 20 districts or arrondissements).\n\nOne afternoon Mr. Clegg put a car at my disposal to go out to Versailles, about 16 km. from Paris. Went out through the great Bois de Boulogne with its lakes, grottos, lawns & forest of trees. At Versailles which is a military town of fair size, I saw the Palace park & gardens and the grand Trianon.\n\nDarracq Limited are no longer turning out motor cars – they are doing war work with 4000 employees.\n\n \nThey are turning out \ndaily\n two complete aeroplanes, 3500 \"seventy-five\" shells and several plane engines. I had a look over practically the whole factory and saw everything in the making as well as the finished articles.\n\nParis after more than two years of war is still gay, although there are a number of exhibitions, museums and \nother\n places of interest closed. The Boulevards, shops and other places of amusement are crowded although not until such a late (or early) hour as they used to be, while the amount of lighting has been reduced considerably. The Parisians don’t wish to have another German zepp. Attack and anti-aircraft guns \nare now\n have been placed on the Arc de Triumph, Eiffel Tower and other prominent places \n\n for use in the event of an attack.\n\n \nI think I was the only Australian in Paris during my short stay and was of course of great interest where ever I went – one lady wanted to take me for a Spaniard – I have been an Italian, New Zealander & Canadian and also as an American as well. I only saw one Italian officer & two Russians in Paris although there were plenty of Belgians who now seem to be all over France.\n\nOn","113":" at midday – after reporting at the Brit. Mil. Police office, I took a \ntrain\n taxi to the Gare du Nord and left Paris at 12.35, going through Beauvais and Alancourt to Le Trefort on the coast and then through Abbeville, Noyelle, Etaples & Boulogne to Wimereux where I arrived at 9 p.m. after a most interesting & enjoyable six days on leave in \n\n \nFrance – my first leave since joining the A.I.F. (101)\n","114":" (7 pm)\n\nThe weather we are having now is very bad, cold, wet, windy and stormy. The fine weather may \nhave\n be said to have ended on","115":" – three months after we arrived here. Then the stormy weather commenced. The two or three days prior to my departure to Paris were bitterly cold with a heavy frost and when I returned from the Capital where the climatic conditions are much better, I found the \"mauvais temps\" going strong. Last night there was light rain only but the strength of the wind blowing off the Channel was tremendous. A number of our tents were blown down & several torn to ribbons. The bell tent that I am in stood the strain \n\n \npretty well although the flapping of loose canvas (after snapping of several guy ropes kept me awake. Today has been very stormy and it was with difficulty that the Hospital & Leave Boats were able to cross the Channel. The sea presented a great sight with the foam dashing high in the air. Part of the road from Wimereux to Boulogne was under water and to reach the town one had to make a detour over the cliffs to the left.\n\nThere is no more swimming now. Several of us hired a cabin on the beach for 60 francs & used to take dips in the briny pretty often. Through having this cabin I got to know several families of Parisians staying at Wimereux &\n\n \ntwo of used to join every night in the \"promenade\" which is such a feature of French seaside resorts. To do this properly meant staying out after hours (9 pm) & we used ti sally forth togged up like officers with cap & stick and wearing British warm. I found out later that the OC could issue late passes so we became dinkum Australians again.\n\nI discovered a tennis court on the other side of the village & one of our NCOs introduced me to a family of French refugees from Lille who showed me how to set about joining. Have had several games on the courts.\n\nWith the rapid advance of winter, however, my spare time\n\n \nout-door pursuits have had to be considerably curtailed and I am determined to devote mort time to the study of French so that by the beginning of next summer, I may be fairly proficient. At the same time I am studying the customs & habits of the people themselves and their fair country with its fertility & resources.\n","116":" 2 pm.:\n\nWhile at Paris I missed seeing a Taube that flew over Wimereux & Bolougne on Monday week. The various anti-aircraft batteries in the neighbour-hood opened a great salvo of fire on the machine which however escaped. The Taube dropped no bombs and must have only been a scout. \n\n \nI should not be surprised if we had a big air raid one of these nights. Last night 3 of us went to an Opera Performance in the Municipal Theatre, Bolougne and saw \"Faust\" (in French of course). The acting was splendid. Had a long walk back to camp in the driving wind and rain but the \"show\" was well worth \"wet skins\". (102) \n","117":" 15\"","118":" (10 pm) :\n\nFrance is proposing more economies. The shops are to close at six instead of 8 and cafés, restaurants, estaminets etc at 10 instead of 10.30. By this means there will be a great saving in lighting.\n\nFrance’s second war loan has just been floated. It is a tremendous one. (several hundred million pounds) and well\n\n \ntestifies to the thriftiness of the nation. The weather lately has varied and we have had a mixture of rain, sun, cloud, cold & wind. Today has been bright & sunny, but very cold nevertheless – especially the early morning & evening.\n\nA number of changes are taking place in our unit. Most of our old officers have gone – some to England & others to different Units in France, reinforcements having arrived to take their place. The OC Lt. Col. Martin is transferring to England very shortly & will take charge of a Hospital near London. I should like to get away myself from 2 G.H. but not to England and to-day put in an application to get into the field. Have had a touch of asthma lately & now have a bit of a \"throat\" with slight cough. Got a Med. Officer to examine my chest\n\n \nthis morning & he said that I was alright provided that I did not undergo any exposure. He said I wasn’t fit for the front.\n\nThis afternoon two of us went over to Souverain-Moulin, a pretty walk of about 6 kilometres from Wimereux. The scenery is picturesque and well wooded. Souverain-Moulin is a quaint little village renowned for its pancakes (crêpes). We each eat a dozen of these, saw an old castle with a moat around it and a river running underneath, and then walked on to Boulogne, about 7 kilomètres, followed later by a walk from town out to Wimereux. (104)\n\nSaturday, 18 Nov.1916 (9.30 p.m):\n\nGetting rotten beastly cold weather now. Yesterday morning when I turned out here was ice an inch thick\n\n \non the water in the camp fire buckets and the water from the taps wouldn’t run – it was frozen in the pipes. This morning was the same with the addition of a light fall of fine powdery snow. The first snow on the ground I have ever seen. Needless to say the days are bitterly cold. In fact I don’t think we could find a much worse place in France to be in. Right on the northern coast exposed to winds, storms, etc. etc – worse than being inland.\n\nBig offensive now in progress and a fair number of patients coming in – we evacuate large numbers daily to England across the channel. All leave to the United Kingdom has been stopped.(105)\n\nFriday 24\"","119":"\n\nSeveral changes in our Unit\n\nlately. The O.C. Lt Col Martin, CMG. Has been transferred to England for duty & now we have Lt Col. J.B. McLean, D.S.O. in charge. Major Yestman is now Adjutant & proving a very capable officer. Several other changes of officers & N.C.Os. have taken place & there will probably be more before the new year.\n\nI have no wish for a transfer to England although I am anxious to get my leave. After that I should like to get away. Just heard that one of our old chaps has been killed while he was stretcher bearing with one of the Field Ambulances. Hard cheese! France is taking the war very seriously and it wouldn’t be a bad idea if the Mother-country did the same.\n\nThe French Govt. is proposing to hold in a few weeks a medical re-examination of all men exempted or declared unfit from the commencement of the war until","120":" last with object of swelling\n\n \nthe ranks of their army. Furthermore the latest conscripts – the 1918 class ( those who will be 19 in 1918) are to be called up shortly – probably in January, The food supply is now being directed more strictly with a new appointment to the Ministry to supervise. Meat is to be cut out on two days a week, only one kind of bread to be on sale, no pastry to be sold, etc. etc. France is a country of darkness. All lights in dwellings shaded at nightfall, no street lamps, most of the shops closing at 6 p.m. & cafes at 9 p.m. Theatres & Picture Shows in the towns have to close their doors one night per week.\n\nOn Wednesday night I saw \"Manon\" (Comic Opera) played at the Municipal Theatre in Boulogne. It was jolly good. The artistes came from the Opera Comique and the Grand Opera at Paris.\n\n ","121":" 27\"","122":" p.m) :\n\nOur old transport from Egypt to France, the British Hospital Ship \"Braemar Castle\" has gone down. She was on her way from Salonica to Malta and either struck a mine or was torpedoed on Sat, last – eight months after we were on her.\n","123":" (11.10 a.m). \n\nA taube that executed a raid over London on Tuesday, was brought down 7 kilometres from our camp on its way back to Germany and its crew of 2 naval men taken prisoner. It came down in a field a kilom. the other side of Louverain Moulin & three of us walked over yesterday on a biting cold afternoon with ice on all still water, to have a look at it ; but we were too late. The R.F.C. had removed the machine to their dépôt during the \n\n \nmorning and all there was to see was a big burnt, trampled patch of ground with a litter of pieces of wire, screws, nuts, bolts, exploded cartridge cases etc a few of which we secured as souvenirs.\n\nWe have a big crowd of French workmen in the camp erecting long wooden huts for 800 patients & personnel, but goodness only knows when they will be ready for occupation – probably when the winter is just about over. The change from a tented to a hutted Hospital is costing £12,000.\n\nThe weather we are having at present is very cold but there is no rain. Frosts are of practically daily occurrence & the water is continually being frozen over.(107)\n","124":" 13\"","125":" p.m..\n\nYesterday we had a light fall of snow. It looked very pretty coming down in little flakes. (108)\n\n ","126":" 21\"","127":" a.m. \n\nWe had a very foggy morning about 5 days ago so that when there was a loud explosion about 10 a.m. nobody could see anything. At any rate we found a big piece of embankment blown away between the railway & our camp. Whether it was a bomb, shell etc. no one knows.\n\nGot a \"shove up\" a couple of days ago to \nStaff Sergeant\n dating back to 28\"Nov. Had been a Sergt about 14 mos. Am now Chief Clerk with a staff of 2 Sergts, 3 Cpls & 8 Ptes. Will be taking charge of a portion of the Hospitals wards as Section Wardmaster in a few days.\n\nThe day before yesterday we had a fair fall of snow. I was out in it and very soon was covered with soft a white mantle. \n\nIn the evening the snow thawed and the roads became as slippery as glass. (109) \n\n ","128":" 26\"","129":" (11 a.m):\n\nOn Saturday morning, the day before Xmas Eve, a big gale sprang up and a tremendous storm raged all day & right through the night. A British troopship drifted on to the shore near the entrance to Boulogne Harbour & became firmly fixed in the sand with the waves breaking right over her. She was towed off next day but in being taken into the port the transport broke in halves & sank like a stone just inside the entrance – blocking all shipping. And there she still lies – all shipping being held up; a very serious matter as all British activity pours into France through 3 ports – Le Havre, Boulogne & Calais and now it means that everything has to go and come through Calais & Le Havre. Our tents tore \nlike\n to ribbons just as if they had been made of brown paper and a number of patients had to be moved into the few \n\n \nshacks now available. Our number of beds has had to be reduced – a rather awkward thing when such large numbers of sick are coming down the line and the hospital ships cannot evacuate across to England from Boulogne.\n\nI was in Boulogne Christmas Eve. Things were very quiet although the lighting restrictions had been relaxed for 24\" & 25\" Dec. to make it \nthings\n a little more cheerful. Special Xmas leave had been granted to as many of the French Troops as possible and there were a fair number of \"Poilu\" about. A custom that is observed here on Christmas Eve each year is for children, ie. Street urchins, gamins and the like to carry a little paper lantern called a \"quonel\" and go from house to house and café to café asking for sous. They looked very pretty flitting about everywhere. \n\nOn Christmas day (yesterday) everything was \n\n \nvery cheerful at the Hospital, the Aust. Red Cross lending a helping hand to give the patients a good time. We the Sergts, had a Dinner in our Mess in the evening commencing with a \"turkey\" procession.\n\nEverything has passed very quietly especially as far as the French are concerned. They are feeling the effects of the war too much to make any demonstration and money is too scarce to spend it liberally at \"la fête de Nöel\" Things were much brighter in England. (110)\n","130":" 28\"","131":" 10.30 am.\n\nWent last night to see a French Comedy \"Madame of son fillout\" at the Thêèatre Municipal Boulogne. The comedy was played by Artistes from the Palais-Royal at Paris where it had appeared with great success. The Gala was in aid of the \"Prisonniers de Guerre\" fund. \n\n ","132":" (12 noon):\n\nYesterday I was able to do a bike ride to see the Field of the Cloth of Gold so well famed in History. I left Wimereux about 11 am. And biked through the villages of Wimille & Wacquinghon to the sleepy little country town of Marquise, 10 kilometres from Wimereux. Here I left the Route to Calais and took the more narrow & muddy road to Guines, 14 kilom. away. Passed near German prisoners & British Engineers camps and arrived at Guines about 1 p.m. Here I had a good feed and after a yarn to Belgian trooper and the demoiselle in the Estaminet (when I told them all about the beauties of Australia) I departed to find \"le champ du drap d’or (field of the cloth of gold) which I was told was about 5 kilometres from Guines on the \n\n \nroad to Andres. I passed an old ruined tower and then came to a small estaminet on the side of which was in big letters were the word \"CAMP DU DRAP D’OR\". Here I got off my bike and enquiring within found that the large field under cultivation on the opposite side of the road was the renowned piece of land where kings had met, knights jousted, fair ladies applauded, etc. I decided to go as far as Andres about 3 or 4 kilomètres further on which I found to be a small town full of Belgian Troops, transport and activity. Guines also is alive with Belgians. I set off on the return journey with a strong wind blowing against me and it was after a strenuous ride of 22 kilomètres that I arrived back at Marquise about 5.30 p.m. I was \n\n \nfeeling as hungry as a horse that hadn’t had a feed for a fortnight so went into a little old-fashioned place for a meal. Here I eat as much as I could hold, warmed myself in front of the fire, and after paying the marvellously small amount of one franc 50 centimes for the meal, continued on my journey on a cold & windy night; doing the remaining ten kilometres in pretty good time. \n\nDidn’t bother about seeing the new year in.(111)\n\n"}}