{"Document Name":{"0":"Diary_0107","1":"Diary_0107","2":"Diary_0107","3":"Diary_0107","4":"Diary_0107","5":"Diary_0107","6":"Diary_0107","7":"Diary_0107","8":"Diary_0107","9":"Diary_0107","10":"Diary_0107","11":"Diary_0107","12":"Diary_0107","13":"Diary_0107","14":"Diary_0107","15":"Diary_0107","16":"Diary_0107","17":"Diary_0107","18":"Diary_0107","19":"Diary_0107","20":"Diary_0107","21":"Diary_0107","22":"Diary_0107","23":"Diary_0107","24":"Diary_0107","25":"Diary_0107","26":"Diary_0107","27":"Diary_0107","28":"Diary_0107","29":"Diary_0107","30":"Diary_0107","31":"Diary_0107","32":"Diary_0107","33":"Diary_0107","34":"Diary_0107","35":"Diary_0107","36":"Diary_0107","37":"Diary_0107","38":"Diary_0107","39":"Diary_0107","40":"Diary_0107","41":"Diary_0107","42":"Diary_0107","43":"Diary_0107","44":"Diary_0107","45":"Diary_0107","46":"Diary_0107","47":"Diary_0107","48":"Diary_0107","49":"Diary_0107","50":"Diary_0107","51":"Diary_0107","52":"Diary_0107","53":"Diary_0107","54":"Diary_0107","55":"Diary_0107","56":"Diary_0107","57":"Diary_0107","58":"Diary_0107","59":"Diary_0107","60":"Diary_0107","61":"Diary_0107","62":"Diary_0107","63":"Diary_0107","64":"Diary_0107","65":"Diary_0107","66":"Diary_0107","67":"Diary_0107","68":"Diary_0107","69":"Diary_0107","70":"Diary_0107","71":"Diary_0107","72":"Diary_0107","73":"Diary_0107","74":"Diary_0107","75":"Diary_0107","76":"Diary_0107","77":"Diary_0107","78":"Diary_0107","79":"Diary_0107","80":"Diary_0107","81":"Diary_0107","82":"Diary_0107","83":"Diary_0107","84":"Diary_0107","85":"Diary_0107","86":"Diary_0107","87":"Diary_0107","88":"Diary_0107","89":"Diary_0107","90":"Diary_0107","91":"Diary_0107","92":"Diary_0107","93":"Diary_0107","94":"Diary_0107","95":"Diary_0107","96":"Diary_0107","97":"Diary_0107","98":"Diary_0107","99":"Diary_0107","100":"Diary_0107","101":"Diary_0107","102":"Diary_0107","103":"Diary_0107","104":"Diary_0107","105":"Diary_0107","106":"Diary_0107","107":"Diary_0107","108":"Diary_0107","109":"Diary_0107","110":"Diary_0107","111":"Diary_0107","112":"Diary_0107","113":"Diary_0107","114":"Diary_0107","115":"Diary_0107","116":"Diary_0107","117":"Diary_0107","118":"Diary_0107","119":"Diary_0107","120":"Diary_0107","121":"Diary_0107","122":"Diary_0107","123":"Diary_0107","124":"Diary_0107","125":"Diary_0107","126":"Diary_0107","127":"Diary_0107","128":"Diary_0107","129":"Diary_0107","130":"Diary_0107","131":"Diary_0107","132":"Diary_0107","133":"Diary_0107","134":"Diary_0107","135":"Diary_0107","136":"Diary_0107","137":"Diary_0107","138":"Diary_0107","139":"Diary_0107","140":"Diary_0107","141":"Diary_0107","142":"Diary_0107","143":"Diary_0107","144":"Diary_0107","145":"Diary_0107","146":"Diary_0107","147":"Diary_0107","148":"Diary_0107","149":"Diary_0107","150":"Diary_0107","151":"Diary_0107","152":"Diary_0107","153":"Diary_0107","154":"Diary_0107","155":"Diary_0107","156":"Diary_0107","157":"Diary_0107","158":"Diary_0107","159":"Diary_0107","160":"Diary_0107","161":"Diary_0107","162":"Diary_0107","163":"Diary_0107","164":"Diary_0107","165":"Diary_0107","166":"Diary_0107","167":"Diary_0107","168":"Diary_0107","169":"Diary_0107","170":"Diary_0107","171":"Diary_0107","172":"Diary_0107","173":"Diary_0107","174":"Diary_0107","175":"Diary_0107","176":"Diary_0107","177":"Diary_0107","178":"Diary_0107","179":"Diary_0107","180":"Diary_0107","181":"Diary_0107","182":"Diary_0107","183":"Diary_0107","184":"Diary_0107","185":"Diary_0107","186":"Diary_0107","187":"Diary_0107","188":"Diary_0107","189":"Diary_0107","190":"Diary_0107","191":"Diary_0107","192":"Diary_0107","193":"Diary_0107","194":"Diary_0107","195":"Diary_0107","196":"Diary_0107","197":"Diary_0107","198":"Diary_0107","199":"Diary_0107","200":"Diary_0107","201":"Diary_0107","202":"Diary_0107","203":"Diary_0107","204":"Diary_0107","205":"Diary_0107","206":"Diary_0107","207":"Diary_0107","208":"Diary_0107","209":"Diary_0107","210":"Diary_0107","211":"Diary_0107","212":"Diary_0107","213":"Diary_0107","214":"Diary_0107","215":"Diary_0107","216":"Diary_0107","217":"Diary_0107"},"Date":{"0":"unknown","1":1286.0,"2":1287.0,"3":1288.0,"4":1289.0,"5":1290.0,"6":1291.0,"7":1292.0,"8":1293.0,"9":1294.0,"10":1295.0,"11":1296.0,"12":1297.0,"13":1298.0,"14":1299.0,"15":1300.0,"16":1302.0,"17":1303.0,"18":1304.0,"19":1305.0,"20":1306.0,"21":1307.0,"22":1308.0,"23":1309.0,"24":1310.0,"25":1311.0,"26":1312.0,"27":1313.0,"28":1314.0,"29":1315.0,"30":1316.0,"31":1317.0,"32":1318.0,"33":1319.0,"34":1320.0,"35":1321.0,"36":1322.0,"37":1323.0,"38":1324.0,"39":1325.0,"40":1326.0,"41":1327.0,"42":1328.0,"43":1329.0,"44":1330.0,"45":1331.0,"46":1332.0,"47":1333.0,"48":1334.0,"49":1335.0,"50":1336.0,"51":1337.0,"52":1338.0,"53":1339.0,"54":1340.0,"55":1341.0,"56":1342.0,"57":1343.0,"58":1344.0,"59":1345.0,"60":1346.0,"61":1347.0,"62":1348.0,"63":1349.0,"64":1350.0,"65":1351.0,"66":1352.0,"67":1353.0,"68":1354.0,"69":1355.0,"70":1356.0,"71":1357.0,"72":1358.0,"73":1359.0,"74":1360.0,"75":1361.0,"76":1362.0,"77":1363.0,"78":1364.0,"79":1365.0,"80":1366.0,"81":1367.0,"82":1368.0,"83":1369.0,"84":1370.0,"85":1371.0,"86":1372.0,"87":1373.0,"88":1374.0,"89":1375.0,"90":1376.0,"91":1377.0,"92":1378.0,"93":1379.0,"94":1380.0,"95":1381.0,"96":1382.0,"97":1383.0,"98":1384.0,"99":1385.0,"100":1386.0,"101":1387.0,"102":1388.0,"103":1389.0,"104":1390.0,"105":1391.0,"106":1392.0,"107":1393.0,"108":1395.0,"109":1396.0,"110":1397.0,"111":1398.0,"112":1399.0,"113":1400.0,"114":1401.0,"115":1402.0,"116":1403.0,"117":1404.0,"118":1405.0,"119":1406.0,"120":1407.0,"121":1408.0,"122":1409.0,"123":1410.0,"124":1411.0,"125":1412.0,"126":1413.0,"127":1414.0,"128":1415.0,"129":1416.0,"130":1417.0,"131":1418.0,"132":1419.0,"133":1420.0,"134":1421.0,"135":1422.0,"136":1423.0,"137":1424.0,"138":1425.0,"139":1426.0,"140":1427.0,"141":1428.0,"142":1429.0,"143":1430.0,"144":1431.0,"145":1432.0,"146":1433.0,"147":1434.0,"148":1435.0,"149":1436.0,"150":1437.0,"151":1438.0,"152":1439.0,"153":1440.0,"154":1441.0,"155":1443.0,"156":1444.0,"157":1445.0,"158":1446.0,"159":1447.0,"160":1448.0,"161":1449.0,"162":1450.0,"163":1451.0,"164":1452.0,"165":1453.0,"166":1455.0,"167":1457.0,"168":1458.0,"169":1459.0,"170":1460.0,"171":1461.0,"172":1462.0,"173":1463.0,"174":1465.0,"175":1466.0,"176":1467.0,"177":1468.0,"178":1469.0,"179":1470.0,"180":1471.0,"181":1472.0,"182":1473.0,"183":1474.0,"184":1475.0,"185":1476.0,"186":1477.0,"187":1478.0,"188":1479.0,"189":1480.0,"190":1481.0,"191":1482.0,"192":1483.0,"193":1484.0,"194":1485.0,"195":1486.0,"196":1487.0,"197":1488.0,"198":1489.0,"199":1490.0,"200":1491.0,"201":1492.0,"202":1493.0,"203":1494.0,"204":1495.0,"205":1496.0,"206":1497.0,"207":1498.0,"208":1499.0,"209":1500.0,"210":1501.0,"211":1502.0,"212":1503.0,"213":1504.0,"214":1505.0,"215":1506.0,"216":1507.0,"217":1508.0},"Entry":{"0":"\n\n","1":"\n\nS 16 Left Sydney 12.30 PM On Transport A72 Beltana\n\nM 25 Called Freemantle for about 3 hours Did not land \n\nLeft about 9.30 PM\n\nJuly 1917\n\nF 13 Arrived Durban 6 PM\n\nM 16 Left Durban 12.30 PM\n\nTh 19 Arrived Capetown about 5 PM\n\nS 21 \nArrived Capetown\n Landed\n\nS 22 Landed\n\nM 23 Landed\n\nTu 24 Landed\n\nF 27 Left Capetown 1 PM\n\nAugust 1917\n\nTh 9 Arrived Freetown Serra Leone about 10 30 AM\n\nS 12 Left Serra Leone 10.45 AM\n\nF 24 8 AM Arived & Disembahked 10 AM at Plymouth\n\nSat 25 Arrived Fovant Camp\n\nSeptember 1917\n\nTh 27.\tWent to London on a days disembarhation leave\n\nOctober 1917\n\nTu 2 Returned to camp\n\nTh 11 Left Fovant arrived Sutton Viny\n\nNovember 1917\n\nM 19\tWent to Fovant on Working Party\n\nDecember 1917\n\nTh 6 Returned Sutton Viny from Fovant\n\nJune 16 1917 Saturday\n\nAt 2 am Coffee & biscuits were turned on & soon afterwards we turned out the roll called & we were of on the old trip Liverpool to Sydney – How long before any of us would take that trip again.\n\nWe lined up at Sydney as the day broke for the march to the boat but it was not a success from a Military point of view. There was a big crowed to see us off mostly girlies & of course we were all mixed up. There was no delay at the Barier & by 7 AM we were all aboard the trooper A72 (Beltana)\n\nAt 10 oclock we pulled out from the Wharf & it was imiadetially filled with wating friends who cried & chered as we went out in the stream At 12.30 PM we left the bouy on the start proper for the great adventure – What will it bring forth Why think about it the future will tell No arrangements had been made to feed us so that when dinner came on about 2 PM the men mostly had a full meal & as there was a fair see running sickness held full \nswing\n sway and many a good soldier cared not \n\nfor King or country\n\nAs night fell the sea got worse also the sickness I faced going below about 7 PM & managed to swing a hammock & hop into it. It proved more comfortable than it looked & I slepped without a break untill 6 in the morning.\n\nWe sleep & eat in the same place & it is very stuffy in rough weather when the port holes are closed. Otherwise things are good\n","2":"\n\nHad an excellent nights sleep in spite of unusual conditions The ship was not steady\n\nin fact when I first closed my eyes She seemed to stand first on one end & then on the other. The Hatch was covered with a tarpaulin to keep the water out & it used to flap up & down in the wind making a great noise. A good many men were sick & most of them did not reach the deck to be sick we had shipped a little water so the floor was in a horrid mess by morning.\n","3":"\n\nWeather is still farly rough & cold the sick are recovering slightly & the messes filling up\n","4":"\n\nWether still bad. This Boat is very fond of shipping water in a small way & many have got good wettings to day Canteen opened\n","5":"\n\nThe rougest night we have had so far waves comeing right over the bows. I am on guard today\n","6":"\n\nCame of guard this morning. Just the same old thing as Liverpool. Only not quite as much style. No arms are carried & the relief cannot march very well up & down gang ways\n","7":"\n\nThe wether has improved greately quite nice & fine today. It is reported we are to call at Freemantle Much letter writing is the order of the day. Shoses issued today\n","8":"","9":"\n\nTwo nice days fairly calm nothing out of the way happened \n","10":"\n There is a report that there is melingitis on board & that we are to call at Freemantle\n\nto be quaranined There was a medical examination for sore throtes. YMCA distributed lollies & cake \n\nMonday 25\n\nPassed Albarny Ran North all day & the lights of Freemantle came in sight just after dark. We came to anchor & one stretchr case & the mails were taken of & we left again about 10 PM\n","11":"\n\nAll sign of Australia\n\nwell gone this morning when we turned out a strong wind with a fairly rough sea running. It was a great disapointment to many not landing at Freemantle. I was very pleased we got a mail off.\n","12":"\n\nSports held on deck\n Nothing to record\n","13":"\n\nA quiet day. The YMCA started deck sports News of the Mongolia sinking by Wireless I am ships Orderly Cpl\n\ntoday\n\nThe magazine was supposed to be tampered with last night an armed guard \nwas\n has been put on\n","14":"\n\n2 weeks out it seems to have passed quickely The gunners had 3 shots for practice to day at a very small target which I believe they hit\n","15":"\n\nSailing vessel sighted Nothing startling to record Started to learn Morse Code\n","16":"\n\nService at 9 AM and singing in the afternoon & evening. What an\n\neasy time the Chaplins have. They do nothing for any one through the week as far as I have seen The YMCA gave lollies at tea time\n","17":"\n\nThe most beautifull day since we left Have never seen such a blue sea Have just washed my clothes \n","18":"\n\nWireless today that a raider is out no lights tonight as a precation. We are not takeing the news very seriously. A court martial today 96 days for disobaying an order\n","19":"\n\nNothing out of the way\n\nTursday","20":"\n\nOn Guard. Absolutely calm\n","21":"\n\nHad a good night. Haveing no lights made very little difference as it is full Moon. Not being able to read was the only draw back.\n\n75 Men have been picked today for a perminunt Guard to look out for Subs & Raiders Boat drill this \nen\n evening. A big whale showed up just after we fell in. The first excitiment for some time.\n","22":"\n\nNothing\n","23":"\n\nA good searmon song service in the afternoon Lollies supplied at tea time.\n","24":"\n\nThe Head has been on to our O C. Concequently he has he on to us The mail closed at 9 AM today. Must be getting close to Durban We hear that we will be there each day up to Friday. No doubt one of those days will be right\n\nPayed £ 1-0-0 today\n","25":"\n\nDrill this morning Sports in afternoon Did some washing\n\nSome birds about to day. Heavy showers this evening\n","26":"\n\nPioneers won the Prize for the cleanest Deck & \nTab\n second prize for cleanest table also won OGradie Drill. These are the first Prizes we have won. Sighted \nth\n a sailing Ship this morning a long way off. The water is not really as Blue as it has been \n","27":" Guard \n\nAn extra dose of yarns today as to when we would reach Durban\n","28":"\n\nAll on the look out for land, Sighted about 12.30 P.M. The first Official\n\norder given out. Was that we would be in at 2 PM later it was changed to 4 PM. About 4.30 all troops were fallen in And I had to bring 3 sentries with fixed baynots to guard the companion way. We were still a good distance out, so were dismissed. Then later Assembly sounded & we fell in again more hunting up sentrys The troops were again dismissed & we anchored out in the harbour at dark.\n","29":"\n\nI was put in charge of The Guard & no other N.C.O. was put on. So have had to stay up all night\n\nFinished at 9 AM today About midday we pulled in to the Wharf & started coaling. At 2 PM we got of & marched to the Town Hall about 2 miles. It simply poured & we were mostely wet through when we got there. Went for a Tram ride to Toll Gate quite a pretty suburb. Had several Ricksha rides, & several meals dear & not very good Could not get into the only picture show we found. Ricksha back to the boat about 10 PM\n","30":"\n\nMarched to Town Hall & back to boat in morning To Town Hall again at 3 PM dismissed for afternoon. Fine day\n\nhad several Tram rides free. They have quite a fine Puraide & baths on the ocean front \nSome of the people throw us fruit cigarettes\n\nThere are 2 or 3 blacks to one white. Found quite a fine Mosque at night & saw them worship\n","31":"\n\nThe Coaling finished this morning. All the work is done by natives with much noise. Postcards fruit Etc was sold all the morning & thrown on to the boat, and a lot of fruit was given away especially by a Miss Campble of the YMCA. Left about 12.30 PM with much cheering & cooeing.\n","32":"\n\nLast night was the rougest we have had a lot of water got down to our deck & as many sleep on the floor they got washed out. It was an awful mess, with kit bags clothes etc washing about in the dirty water We are keeping close to the coast. It is straight & uninteresting. Only (Boat broken last night) lost one man in Durban owing to the Pubs being Closed.\n","33":"\n\nA nice day still close to shore It has been fairly high to day. Mountains in places. Passed East London yesterday about 3 miles out.\n","34":"\n\nTable mountain sighted about 11 AM Anchored in Table Bay in the evening The Suvic A29 just beating us in,\n","35":"\n\nDone nothing all day The Town looks well at the foot of the mountain, But would like a closer acquaintan A very poor harbour, shallow & dirty. Counted 97 small boats out fishing this morning\n\nSaturday 21\n\nMarched up the town at 11 AM & were given strict orders to go about in parties of not less than four. Some of our lot started to get drunk as the Pubs were open for about ½ an hour after we were dismissed so Colllier & I cut off on our own. Bought post cards etc & had a look around town then took tram to \n","36":"\n\nCamp Bay, 11 Miles the round trip. The line runs out along the coast at a fair height at times & comes back around Lions Head over The Kloof 700 ft heigh A splendid view of the town & bay. The people here treat us much better than they did in Durban. The Rest Hut supplies Tea, Coffee Cakes etc for 1d each item & there are good reading & writing rooms. There is a very good tram service. The side streets are very narrow. But well made\n\nSunday 22 July \n\nMarched off at 10 AM. Wandered about untill lunch & then went to Camp Bay via The Kloof. This is the better way for secunery. Found a Buffet free to Troops. Had very\n","37":"\n\nnice tea & cakes. Examined the Pier in the evening & came home early \n\nMonday 23\n\nMarched up town. Went around gardens very small & nothing out of the way to look at. Went through Museum. Fine collection of animals minerals etc \nfo\n did not take time to examine fully.\n\nPlaster figures of Native Bushman are near lifelike Took Train to Newland & went over Groote Schuure in afternoon. Fine massive old house nice grounds did not go into house Good collection of animals running in large enclosures except the caged ones Went to the Memorial \n","38":"\n\nquite a climbe. A splendid view from here. Have just 6d left & its borrowed\n","39":" \n\nOn butchers fatigue so did not get off untill midday. Saw Picture Gallery not much and \nOld\n Koopman De Wit Collection old Dutch articles not interesting Had a Hot Bath best item on the trips programme Payed 10\/- today. Needed muchley\n","40":"\n\nMoved out from the Wharf this morning & have been anchored all day It has been raining & every one is sleepy. Take it all round men have behaved very well\n","41":"\n\nStill in harbour. Showery all day. Two Parraides. Fishing chief occupation. Fair number caught. Cook charges 3’ each for cooking them.\n","42":"\n\nGot the mud hook up at 1 PM & made a stack 5 troopers & escort HMS Afric. Made quite an imposeing line steaming out of the Bay No excitement this time a few Helieas flashing from the town. Formed into two lines in the afternoon. We are in the centre of the left hand line.\n","43":" \n\nBeautiful day uneventfull. Ship Orderly Corpl to day\n\nSunday 29th\n\nThe usual programme. We do not appear to move at all now. The 6 big boats seem to all be at anchor except for a small ripple of foam at the bow. The lines are about 700 yds appart, and about 500 yds from Stern to Bow\n","44":" August\n\nOnly one small light shows on the stern of each boat.\n","45":" \n\nPut Wet equipment in forward hold today, Well out of the way. Did some washing Lecture on Ropes & Splices Borderer had gun practice\n","46":"\n\nSports on deck. Crew have started putting awnings up Lecture on Knots\n","47":"\n\nThe Hororaia pulled out of line today & fired 3 shots for practice. Roumer of course says there was a buryial Concert this afternoon. Lecture to N.C.Os on Map Reading\n\nTreevers YMCA man had tea with the 1st & spoke later He seems a good sort & there is plenty of room for him to improve most of us. The\n","48":"\n\nClugie have not come to tea so far.\n\nThursday 2\n\nSports again today. Otherwise uneventfull. A few nights ago some of the","49":" decided that some of their men had not been bathing enough. And they were taken up by force & given a shower. Of course things went a bit too far & clean men were ducked for fun Since then they have been paraided to the shower Treevers for tea tonight & one Padre came down for a time afterwards. Treevers is trying hard to get the swearing cut out, its an uphill job as there are so many boys in the 17th & 18 Batlns. A canvas ventilator has been put in\n","50":"\n\nat last. Would have been very useful when the Hatch & ports were closed. Every thing has been opened since Capetown\n\nFriday 3rd\n\nThe Afric took a trip on her own this morning went almost out of sight & came back to her old place. This evening she sent up 3 small ballones & practiced on them with \nher\n her anti-aircraft guns no hits.\n\nThe awning has been put over the forward well deck. Boxing contest on this afternoon also a lecture on the aft well deck by one of the Paders. YMCA gave us chocolates for tea Quite warm tonight\n\nSaturday 1917 4th August\n\nYesterday the Corned Beef was very hard to take at dinner time so we got extra chees for tea. It was mostely uneatable today the Pudding was condemed by Dr & was not replaced – This shows true economy. Fire & Boat Drill also yesterday.\n\nNoticed many flying fish today. Boxing this afternoon The Ballmoral Castle dropped out for gun practice this evening – could hear the shell bursts distinctly. This is the first day in the 4th year of the War\n","51":"\n\nChurch Paraide \na\n in shorts. It has been overcast & showery for some days. Today the \n\nsun shon. But it is not unpleasantly hot. \nCpt Bryce\n Cpt Knight gave a lecture on why the Church is so divided He is a good speaker & has studied a great deal Ships Orderly Cpl today\n","52":"\n\nStarted training for Physical Drill Compition Another lecture by Cp Bryce on Missopotamia from which place he has just returned. The Gun fired 4 shots all misses I belieuve. Have crossed the line several times in the last 48 hours.\n\nTuesday 7\n\nDid quite a lot of Physical. Lecture by Lit Heart on The War in East Africa where he has been\n","53":"\n\nfor some time. Not a good speaker. Altered our course slightly more W this evening. Our deck got first prize for cleanliness & 2nd for best table again\n","54":"\n\nPhysical Drill compition today 18th 1st we got second. This means a bob or two for each of the 10 that were in the team. It will be very useful to me as I am reduced to 1d and a Krugie 2\/- that I cant change Boat drill this evening a great rush as we were given no warning. Asembly sounded just at dusk & many rumers passed around as Subs are supposed to be about\n\nThe real reason was the Chapplins \nhad\n were giveing out 1 Pkct Cigs between each 2 men Boats are all in line tonight.\n","55":"\n\nFormed up in 2 lines again early this morning & land came in sight. Anchored about 10.30 AM in Port Freetown, Serra Leone, W. Africa It is very pretty here a small town right on the water edge with wooded hills behind. Every thing is beautifully green right to the waters edge. There seem to be no wharfs It is an open harbour, with torpeodo nets across the entrance. Niggers out \n","56":"\n\nin there dugouts diveing for coins & selling fruit M Workers won the Tug of War. Concert on deck at night\n\nFriday 10th\n\nWet & miserable all morning but not very hot. Takeing in water & Niggers coaling today more noise than work. Four other boats came in from England Officers went on shore A good many have been sleeping on deck for some time Have not tried it a there is rain nearly every night & it is hard to get a dry spot A supply of Smoke Boxes were put on board today. They are boxes about 2 ft square filled with an inflamible material to be used in makeing a \n","57":"\n\nsmoke screene if attacked\n\nFriday\n Saturday 11th\n\nStill admireing the well washed green hills of Serra Leone. Coaling has finished & the duty Niggers have left us Australians make the great mistake of being to friendly with them\n","58":"\n\nAbout 10 AM the “HMS Affric\" went out with 4 Boats going Cape town way & We followed imediately after. There are 9 Boats includeing 1 Battleship & 1 Aux Cruiser in our lot now. I wonder if they will all get through No one was \nglad\n sorry to leave Serra Leone. As we were not allowed any leave\n","59":"\n\nAn order was given this evening, to weare lifebelts day & night. How tired we will get of them, and anything that will float is not to be thrown overboard in the day time. Usual services today. Was on Guard this morning, But the Submerine Guard was put on so only did 3 hours No more bugle calls are to be sounded Y.M.C.A gave out chewing gum\n\nMonday 13\n\nTrouble about tucker today. It was not of the best Convoy does not keep the same formation. Changed several times today. We are running last in the left row tonight. The Cruiser has been out of sight all day. Sports in afternoon. Our final Lut A H Gurnsey admitted to hospital One of the Sub Guard let his rifle off by mistake. Bullet\n","60":"\n\nwent through a water pipe\n\nTuesday 14th\n\nMuch as usual, Except the meals were better, grilled chops replaced our old friend Stew. A lecture by an R.F.C Lut on Flying machines & Flying. Physical culture class got properly going again today\n","61":"\n\nMuch cooler. Awnings all down again. But our ventilaton has been taken away & the last two nights were very hot down here I tried to get it put in again but none seemed to care much. The Auxly Cruser caused some excitement today. She was about 5 miles out on the Port side all\n","62":"\n\n(Boxing today)\n\nmorning. At midday she started fireing & manuvering fired about 17 shots at what most of us took to be a target. Some are convinced it was a Submarine. In fact the yarns go so far as saying 2 were sunk & at night one or two men I know moved there hammocks nearer the steps to be able to get out quickley. I have a good position so can afford to laugh\n\nThursday 16th\n\nFor the last 24 hours it has been a bit rough. The first time we have had a ripple since leaving Capetown \n\nFriday 17th\n\nThe Convoy has done quite a lot of manovering today\n","63":"\n\nTurned completely around once & has changed course several times. The 17th were payed 8\/- yesterday. Was Orderly Corpl today. The number of sick seem to increase in proportion to the ammount of stuff sold at Canteen & one can form a good idea of the financial position by the amount of rubbish about the deck\n","64":"\n\nWe were to be payed 8\/- today. But \nwere\n had to sign for 10\/-, 2\/- being kept back \nfor\n to cover shortages in Ships stores, such as utensells hammocks blankets Etc These shortages cannot be made up untill the \n\nlast day & should not be more than 6d. There was so much growling about signing for what we did not get that it has ended in getting no pay for the present Identification Discs issued today. Now we can die in peace. Boxing tournament finished today.\n\nSunday 19th\n\nChurch Parade in morning. Lectures Singing Etc in afternoon. Mr Treevers of the YMCA has gave us chocolates at tea time & has just delivered a short sermon & given out Testements. I think his talking has had some affect on the swearing.\n\nHas been a beautiful day. Bright sun quite hot a wonderfull blue in\n","65":"\n\nthe water, & just baby wavelets. We are not allowed bellow in the day time now except for meals. It would be more dangerous if we were torpeoded\n","66":"\n\nIn spite of all the talk we got 8\/- today I payed the Mess Orderlies in full 7\/- & 1\/- for 2 copies of the Beltana Bugle just cut it out. They say a Cruser passed early this morning & a steam boat passed a long way off this evening. Sports on deck. The sea is calmer \nthan\n today than I thought possible\n\nTuesday 21st\n\nAnother boat\n","67":"\n\npassed today. Got our water bottles out today have to carry them full all the time, but not of Rum\n","68":"\n\nHad a full Marching Order Parade today Got my fiver out of Orderly room today. Small steamer passed this evening Fair sea running strong W wind. They are making out a \nlong\n list of all our trades or kinds of work we have done. Mine is a fairly long list\n\nThursday 23rd\n\nFair sea and much cooler. But am still wearing shorts \n","69":"\n\nAfter many false alarms the \nTorpedo\n Destroyers 8 of them – turned up about 2 PM today causeing quite a flutter of excitement We should certainly be safe now allthough I have never felt otherwise No Paraides today. Have just heard that we disimbark at 2 PM tomorrow\n","70":"\n\nThe above was quite out as it is now dark & no land in sight We have put our blanket & hammocks away & will have to scratch for a bed tonight. Have our Kit bags & equipment out all ready for landing Fair sea running today Passed 2 or 3 small boats\n\n1917\n\nSat 25 Aug\n\nSpent a very uncomfortable night only an overcoat for nap. Land was in sight at daylight. About 9 were anchored of Plymouth even quite small sailing boats carry guns & there seem to be crowds of destroyers about. Saw a Seaplane for the first time. No time was lost (considering we were soldiers) in disembaarking. All went in one big Tender & landed right at the train. Got away about 12.30 for Dinton \na\n near Salsbury. It was a very pleasant day for every one. Oldhands & new. The small rectangular fields, some green some white, harvesting was going on in \n\nplaces. The old stone buildings Quiet Stock just as it is in the picture books or Landscape Targets The Mayross of Exeter gave us a bottle of tea & a bun about 3 PM it was very acceptable as only a few luckie ones had been able to get a 4d pie at Portsmouth Landed at Denton about 7 & marched to camp between 2 & 3 miles & up a long steep hill to finish off. By now it was quite dark & after messing around a bit had tea consisting of 2 slices of Bread each margarine & Blancmange & Tea We only had our mess tins & clasp knives so the Blancmange was very hard to handle\n","71":" Blankets each were given out & we were allotted to tents with board floors. Our kit bags had been left at the railway\n","72":"\n\nSpent a fair night Good breackfast Medical Exam & Inoculation. Kits issued and just got fixed up nicely when a lot of us had to move into \nnew\n other tents Showerry all day\n","73":"\n\nRained nearly all day. Did not feel well so stayed in bed most of the day as there was nothing doing the camp is muddy although there is a good fall\n","74":" \n\nRained most of the night & blew some of the tents over – not ours fortunately – Had a very bad night as I was sore from lying on the hard boards so long. Still she rains. Moved into huts this evening a great improvement Are supposed to be in Isolation. It is the rule when you first land Am feeling fairly well again. The isolation is a fraud as we go about much as we like.\n\nWednesday 29th\n\nVery little doing today. Rained a fair lot. Had a \n","75":"\n\nletter from Les Walsh in France. Went for a walk in evening. Through Ye Olden Village and down rustic lanes. It is all very pretty & old. What surprises me is that people have gone to so much trouble with this country. It has such a vile clymate. But things seem to grow well\n\nThursday 30\n\nStarted work today & it was quite fine. The method here are better than Aus. But must not say to much untill I have seem more of it. The meals are good & plentyfull Bought this pen today for 5\/- it is better than using pencil. Should have written a lot more\n\nAug ","76":"\n\nlately but did not feel up to it. However am feeling pretty fit again & a few days work will put me in good form again\n","77":"\n\nI have done nothing today as I was on Picquet & it means doing very little It has been a beautiful day, no rain & quite warm\n","78":"\n\nFatigue work Moved out of isolation. \ngot\n Straw beds issued a great improvement Concert at YMCA in evening not much good. I think there is an improvement in the spirit of the men. They are inclined to take things \n","79":"\n\nmore seriously, & do there best at what ever they have to do Polers will in future get a rough time\n\nSunday 2nd\n\nChurch Paraide as usual a poor specimen of Padre. Went for a Walk in afternoon. One sees little else but soldiers about here. There is no where to go \n","80":"\n\nNothing unusual. On Picquet in evening went to a little Pub “The Popplers\", to keep order just the sort of Pub you read about even to the oldest inhabitant but it was a bit overrun with soldiers\n","81":"\n\nSecond inoculation & issued with new pay books today.\n","82":"\n\nPayed 15\/-. Sports at Herdcot about 2 miles away were marched there. They were very fair but it was hard to get a place where one could see decently.\n","83":"\n\nHad a letter from Etty Murray today.\n\nThe inoculation dodge worked well had all day off. So have done nothing gracefully. It has been quite hot today Some of the boys gambled by match light untill 12 last night & have been at it most of today They will be broke tomorrow which is well\n","84":"\n\nJust drill. A very good conjuring entertainment in the YMCA to night\n","85":"\n\nWas put on the Sanitary staff today with 2 others Started digging a pit for rubbish Rambled down the country lanes in the afternoon & bought about 18 very nice plums for 6d \n","86":"\n\nRained gently most of the day Went for a walk in the evening\n","87":"\n\nA very fine warm day. On the sanitary job all day.\n","88":"\n\nQuite hot today Things as usual\n","89":"\n\nGave up the Sanitary Job & went on pariade. Went through Miniture Range Score 38 Went over to next camp\n\nwith Collun to Conjering show Same as in YM here only the man was very full \n","90":"\n\nAs per usual. Told we are to get leave on the 25th This leave has been a very prominent question ever since we got here. There have been roumers about it every day.\n","91":"\n\nAs per usual. The physical drill & Bayonet Fighting in the forenoon is far the best part of the drill. The instructors are keen on the work & keep us going. The Musketery are just the opisite do as little as possible \n","92":"\n Saturday 15th \n\nRout marched about 10 miles although many estimates made it a lot longer as\n\nSept \n\nhad our packs up & it was quite a hot morning. The roads are very good for marching but a bit hard. In many places they are only just wide enough in many places to march in fours. That is supposed to be 10 ft. Had a very large dinner & then went for a walk with Baker about 3 miles extra for fun\n","93":"\n\nChurch Paraide\n","94":"\n\nPicked for Guard today & had a very easy job going through Guard duities all day. Was chosen as best dressed man when the Guard was mounted so got off quite pleased as it is a wet night.\n","95":"\n\nHave been B.O.M today not a bad job but you are kept moveing\n","96":"\n\nDid 15 minutes PT for the days work Rained most of the day. Concert in evening quite a good one. Payed 10\/-\n","97":"\n\nAs usual. The hut was very quiet last night considering it was pay day.\n","98":"\n\nAs usual. Good concert in evening. Had 2 Aussie letters today\n","99":"\n\nWent over the hill in front of the Camp as a start for the march did about 10 \n\nSept\n\nmiles. Nice cool day so came home quite fresh Concert at YM more high class than any of the Camp tournouts I have been to.\n","100":"\n\nOpen air Service to day. Walked up to top of hill in front of Camp & examined Riseing Sun & other badges. The turf is cut out the right shape & filled in with chalk They look very well. Especially the sun it has been layed out very well & is about 50 yds across the base Had an extra good tea in the vilage Ham & Egg 1\/8½ with Tea & bread & butter\n","101":"\n\nLice were found\n\nin the Hut this morning so we managed to get it thouroughly disinfected & changed our blankets The blankets are of poor quality. As we have not changed our ticks the whole thing is very little good. My idea is they are not lice & the Drs is the same\n","102":"\n\nEmptied our ticks & had them disinfected Rifles were issued last night my No 150324\n","103":"\n\nMorning as per Afternoon Returned rifles Payed Medical inspection Etc in readiness for Leave tomorrow. Showery today. What will we have for our holiday\n","104":"\n\nEarly breckfast Busseled about without any reason caught train at Dinton 9 AM Arrived Waterloo about 12 Marched to Horsefury Rd & were turned loose. Had dinner at War Chest an exelent instituon Wandered around (4 of us) & got a room at 150A Southamton Row Near Russel Square. A Salvation Army place & very good. Wandered about some more & went to a rotton play A Little bit of Fluff \n","105":"\n\nWent to The Bank & Wax Works Etc Lindfield Gardens in the evening\n","106":"\n\nMet Miss Murray had a look at Picture gallery & spent most of the day at Kew Gardens\n\nspent the evening at Linfield Gardens. Had quite a good air raid or rather several\n","107":"\n\nCaught 9:15 to Harwich & met Mab on the Station Cycled out a few miles & had tea in evening.\n","108":"\n\nWent shopping in Harwich in morning Cycled out for tea again to a very pretty wood Have learnt quite a lot about Submarines Etc Air raid in evening.\n","109":"\n\nCaught 10 AM train to \nVictoria\n Liverpool St Messed around a bit & caught 6 PM for Dinton in camp by 9-30 after a very pleasant 6 days. Fine wether every day we were on leave\n","110":"\n\nMedical inspection \netc\n & all the little things \nattended\n that happen on return from leave Today was longer than the last 6 days\n\nThursday 4th\n\nWet so nothing was done Payed in afternoon Wrote quite a lot of letters Sold my fountain pen for 7\/6 –","111":" proffit.\n","112":"\n\nSame old thing Wrote to Leo & Ned today \n\nSat 6th\n\nDid about 1 hour PT then messed about No rifles to use as they have been packed for our move next week. Collier & I walked to Lesbury a small\n","113":"\n\nplace 5½ miles away half the town is very old the rest near the railway more modern It is a pretty walk\n","114":"\n\nWas about I minute late getting on Church Paraide this morning & fell in for Main Guard\n","115":"\n\nGuard has been quite a good job. A good fire in the room and plenty to eat The C.O sayed we were the worst B- guard he had ever seen and told the Sarg we were to get extra training – That is the last we will hear of it. Was in a raffle for a Bike but my 2\/- has gone & am not the posseser of the Bike\n","116":" \n\nPacked \nthe\n our Kit Bags this morning & put out in readiness for our move on Thursday . We are doing practicaly nothing these days just putting in time\n","117":"\n\nSwinging the Lead very sucessfully today Put on to load Kit bags in morning finished at 10 Fell out after dinner and stayed in hut all afternoon\n","118":"\n\nRevalie 5.30 Breackfast 6 Drew dry rations 2 pieces bread each 1 tin salmon to 5 men Fell in stood about & all the usual performance At 8:50 about 1,000 statuard Ausies marched\n\nout of Fovant Camp at 4 PM nearly the same number wandered wearily into Sutton Vissy camp The walk was about 15 miles It was a beautifull day after the frost in the morning. Cool & bright Cannot say I am tired With a lot of struggle & strife we got blankets ticks & boards simed out & got a neary fair tea about 7 Hot stew – well it was a sort of stew. A few of us had extra tucker on the march today. Our Hut had a good fire all last night as Jones & I went straight into the coal yard & took a bag of coal It was stealing but as we did it with many looking they thought we had a right to it\n","119":" 1917 Oct\n\nShowery most of the day Early morning paraide has been cut out This is going to be a muddie camp I think most of the paraide ground seems that way\n","120":"\n\nAs usual. Went for a walk around Warminister It looked like a town just ocupied by Aussie troops \n","121":"\n\nOpen air service Explored Warm fully it is quite a large place but nothing of particular interest\n","122":"\n\nWent on a working party 100 strong today marched about \n\n2 miles to another camp & the Officer evidently could find nothing to work at for we loafed about & then marched home were told not to fall out on Paraide as we were wanted again. Did as we were told & just stayed in the Hut all the afternoon\n","123":"\n\nOne hours Musketry this morning loafed rest of day Showery all day Have to wear overcoats with equipments over them on all paraides now. But tags on my coat to day to keep it out of mud\n","124":"\n\nDrill very good lecture afternoon by Archdeacon\n","125":" \n\nUnloading coal all day concequently the hut is not short of fuel tonight\n","126":"\n\nWorking party Building a Clink at No 13 camp Mostly barb wire work am Wire expert. Pared 15\/- event to Warminister\n","127":"\n\nWorking party Warminister in afternoon payed 8d to see a very roton play \n","128":" \n\n As usual walked around Sutton Viny in evening. Had 3 drinks of stout.\n","129":" \n\nStill wire expert on the Clink\n","130":"\n\nStill Clink building\n","131":"\n\nClink Cold wet & windy day\n","132":"\n\nSame\n","133":"\n\nMore Clink Came in at 1.30 for Dental inspection loafed remainder of day\n","134":"\n\nClink\n","135":"\n\nChurch Parade at 9 AM went O.P.D (other prodestant denomonations) a good sermon Text Man know thy self. It was a good straight talk for men But as a clean straight life is not very fashionable in the A.I.F. don’t think it will much good \n\nDetailed for Flying\n\nPicquet Start at 8.45 PM & walk the Warminster Road untill about 11 To bring the drunks home\n","136":" \n\nStill toiling on the Clink\n","137":" \n\nFinished Clink\n","138":" \n\nThe Clink was not just a success as the Birds pulled some of it down last night We are working on an Coupse in the same Camp \n","139":"\n\nOn working party. Quite a hot day\n","140":"\n\nWorking Party. Did my first bit of Sandbag work They make such a neat job \n","141":" \n\nWorking Party Went to Warminster in evening what a dull place Weight 11st 3lbs\n","142":" \n\nAs usual. Attended evening service at the Home Hut Miss Osbourne spoke A splendid little sermon\n","143":" \n\nSame old Working party same old work \n","144":" \n\nHard job finding work on the working party. Have a very good little mate on the job an old hand. He is no loafer like so many are. His brother is a VC man & he did not tell about it untill we had been 2 weeks together\n","145":"\n\nCame rather a gutser today. Had to get on to a Wheelbarrow & cart much about 150 yds What one could call uninteresting work.\n","146":"\n\nSame as yesterday The midday meal was a bit light today so tried the Salvation A hut. Had a very decent meat pie & good cup of tea for 3d \n","147":"\n\nSame old job\n","148":" \n\nSame. C. Watson shouted for us Take your choice Beer or cigerates, took the later\n","149":" \n\nAs usual.\n","150":" November1917\n\nWorking party as usual\n","151":"\n\nAs usual\n","152":"\n\nMuster paraide & working party letters from home\n\nThursday 14\n\nW Party\n","153":"\n\nWent on Paraide for a change Messed about all day & did nothing\n\nFriday 15\n\nFull of Paraide went back on Working Party\n","154":"\n\nMess Orderley Not much of a job as I like to see things clean & that means work & not verry\n\ngood results as there is no proper way to scrub the floor. Managed to get the tables properly clean\n","155":"\n\nPicked on Working Party for Fovant\n","156":"\n\nEarly breckfast & with very little messing about got to the station well before time. Had a 2 hours wait at Wilton Arrived Fovant about 3 PM & were soon fixed up with a hut blankets etc in No 4 camp The first lot out of the 11th Reinforcement started for France this morning including Pat Buchman one of\n\nthe best\n","157":" \n\nOur job is cleaning drains \narou\n in this lot of camps. What a come down for would be fighters\n","158":" \n\nSame\n","159":"\n\nSame\n","160":" \n","161":"\n\nSame ½ day. Hall & I walked to Tisbury in afternoon a good concert given by an infintary company Had bacon & eggs bread butter etc for tea a good meal cost 2\/- each\n","162":" \n\nWent for a \n\nNov Dec\n\nwalk in the afternoon a cold windy day \n","163":" \n","164":" old futile scratching in the drains.\n","165":" to","166":" \n\nAt drains all the time Got some timber to make a wooden floor in one drain where it has been washed out\n","167":" \n\nWent to Sailsbury in afternoon Getting passes left us a bit late. Arrived about 4 per Car","168":" each Just had time to have a look at the Cathedral very fine. Went to a \n\nmixed picture show & variety turns quite good. Had 2 good meals. Started home per Buss at 10.30. It was over full so about 10 of us got on a tailboard arangement, which promptly broke as soon as we started We knocked around for a time & eventually got a car arriveing home after midnight\n\nSunday 2nd \n\nHall & I walked to Wylie a village about 5 miles away. Quite a nice walk & the road was new to us.\n","169":" \n\nJust pick & shovel & drains again. The cold is starting Heavy frost last night. Ice in sheltered places all day\n","170":" \n\nThe ground was frozen yesterday for about 2 in down in places same today. Very hard to pick Snowed for about 10 minutes today. Do not feel it out of the way cold\n","171":" \n\nDrain makeing \n","172":"\n\nA fresh party arived yesterday to take our places as we were nearly all untrained men We started this morning in time to miss the 9 train had wait untill 12 arived Sutton Veny about 2. Verry heavy frost this morning\n","173":"\n\nDrill in morning M O & Dental inspection afternoon\n\n\\Saturday 8\n\nScrubbed out Mess huts\n","174":"\n\nChurch Paraide Hall & I went for a walk around Warministir \n","175":" \n\nMinitune Range Had a night stunt out about 2 hours Spent a lot of time standing about fortunately it was not a cold night\n","176":" \n\nVoted on conscription\n","177":"\n\nStarted Musketery course on A\n\nRange Sutton Veny Heavy frost nice day had light.\n","178":"\n\nShooting another nice day Good light Did not shoot well Issued with new rifle last night N. 61277 for active service\n","179":"\n\nFinished a Musketry Course Scored 97 thus being classed as a First Class Shot. Did not do as well as I should have done.\n","180":" \n\nRoute March with Packs about 10 miles\n","181":"\n\nStarted snowing when we were in\n\nChurch this morning About an hour of it The sun came out afterwards & made things very slushy\n","182":"\n\nThe slush froze hard last night & made it very hard to get about – one sliped & slid so much. \nIssued\n Lectures on Bombing Mills 23 Mark 21 – hand grenade Hales Rifle grenade Etc\n","183":"\n\nMore bombing threw 2 live bombs We used to get spattered with mud & ice if the bombs were not thrown far enough \n","184":"\n\nGass Lectures & fitted with Box Helmets\n","185":"\n\nGass Chamber Tear & Chlorine gas a smellie business\n","186":"\n\nG.S.O. (Group Staff Officers) inspection Had a go at Squad Drill Physical Thaming Gassing Baynot Fighting. Musketry Bombing. Through the lot before dinner. A slack sort of inspection to go through as a test of being fully trained A few failed to pass am now a fully fledged soldier \n","187":"\n\nMedical inspection as we go \n\non leave tomorrow after being frozen all the week thawed last night.\n","188":"\n\nRoused out at 4 AM Quite a mild morning. Caught the train at 7.50 arrived Paddington about 10 Had lunch in a YM for 1\/- & got out to Aunt Susie about 1 PM Have written this up on Xmas morning & will leave the holiday untill I get back\n","189":" \n\nSaw a good deal of the Town lunched a New Palace Hotel Could not get into a \n\nDec\n\nso spent some time in a Picture Show\n","190":"\n\nWent to St Pauls & several other places. Lunched at Trocadro quite a swell place 4 courses\n","191":" \n\nWandered about considerably & saw a good deal Aunt stayed at home\n","192":"\n\nWestminster Abby etc left London at 7.55 reached camp about 11 PM. Have not bothered about details of all the things I did & saw on leave. The days are short for sightseeing especially\n\nwhen one turns out late. \n","193":"\n\nMedical examination Put on Coal Guard\n\nSadurday 29\n\nOff Guard at 9 this morning. Did some washing in afternoon.\n","194":"\n\nDid not fall out on the O.P.D Paraide waited for the R.C. & fell in with them the OPDs \njust\n happened to come allong just then so sliped in with them & missed Church Paraide alltogether \n","195":"\n\nWent to the\n","196":"\n\nBull Ring this morning fully determined to go on with Drill untill I went on Draft But came a guttser being put on Main Guard\n","197":" – 18\n\nSpent the first day of the N Y on Guard. Snow during the night just enough for snow balling\n","198":"\n\nWent\n","199":"\n\nto the Butts with a markinh party\n\nThursday 3\n\nStill at Butts Have Hegarty for a mate. Hall on next target. Backed our score against his for suppers. We won\n","200":" \n\nGot another cheap supper\n","201":"\n\nOn the Butts Won again Went to Warminster in afternoon, Banked £ 5 Saw the Pictures & had 2 fair meals\n","202":"\n\nWent to Church & a walk in afternoon came on to rain the first for some time Have had 18 Australian letters through the week\n","203":"\n\nMarking on Range Hall won the Suppers today\n","204":"\n\nRange again also another win for Hall – Rought march at night\n","205":"\n\nSame as yesterday finished today Drill in afternoon. A cold day\n","206":" \n\nBull ring same old stunts\n","207":"\n\nBull ring Got on to Wire & knotting today for the first time A bit more interesting than the old drill.\n","208":"\n\nRout March about 12 miles\n\nWarminster in afternoon went to Pictures\n","209":" \n\nChurch Paraide Had a stunt putting out a fire there was no fire just practice ","210":"\n Walked to Hytesbury in afternoon had tea came home\n","211":"\n\nMonday\n\nGot on a Bayonet Fighting compition squad\n\nTuesday 15\n\nPracticing Bayonet Fighting\n\nSnowed all Sunday night about 8 in of snow on the ground in the morning. Lots of snowballing. An organised fight between 2nd & 4th & other Co\n","212":"\n\nCompition came off today No 2 Co won. Our Guard\n\nmounting team was also beeten A little snow today Rain all yesterday\n","213":"\n\nAs usual\n","214":"\n\nPicked for Guard then put on Draft \n& taken of again\n","215":"\n\nMobilization Stunt Went out with full Packs for about a mile march taken of Draft\n","216":"\n\nWent to Westbury a fair sized town 5 miles off\n","217":"\n\nPut on Guard again & then on Draft after dinner Have had a very busy afternoon Dr Drawing clothes etc\n\nit is now after ten oclock & have just about finished packing kit & putting things away.\n\n"}}