{"Document Name":{"0":"Diary_0257","1":"Diary_0257","2":"Diary_0257","3":"Diary_0257","4":"Diary_0257","5":"Diary_0257","6":"Diary_0257","7":"Diary_0257","8":"Diary_0257","9":"Diary_0257","10":"Diary_0257","11":"Diary_0257","12":"Diary_0257","13":"Diary_0257","14":"Diary_0257","15":"Diary_0257","16":"Diary_0257","17":"Diary_0257","18":"Diary_0257","19":"Diary_0257","20":"Diary_0257","21":"Diary_0257","22":"Diary_0257","23":"Diary_0257","24":"Diary_0257","25":"Diary_0257","26":"Diary_0257","27":"Diary_0257","28":"Diary_0257","29":"Diary_0257","30":"Diary_0257","31":"Diary_0257","32":"Diary_0257","33":"Diary_0257","34":"Diary_0257","35":"Diary_0257","36":"Diary_0257","37":"Diary_0257","38":"Diary_0257","39":"Diary_0257","40":"Diary_0257","41":"Diary_0257","42":"Diary_0257","43":"Diary_0257","44":"Diary_0257","45":"Diary_0257","46":"Diary_0257","47":"Diary_0257","48":"Diary_0257","49":"Diary_0257","50":"Diary_0257","51":"Diary_0257","52":"Diary_0257","53":"Diary_0257","54":"Diary_0257","55":"Diary_0257","56":"Diary_0257","57":"Diary_0257","58":"Diary_0257","59":"Diary_0257","60":"Diary_0257","61":"Diary_0257","62":"Diary_0257","63":"Diary_0257","64":"Diary_0257","65":"Diary_0257","66":"Diary_0257","67":"Diary_0257","68":"Diary_0257","69":"Diary_0257","70":"Diary_0257","71":"Diary_0257","72":"Diary_0257","73":"Diary_0257","74":"Diary_0257","75":"Diary_0257","76":"Diary_0257","77":"Diary_0257","78":"Diary_0257","79":"Diary_0257","80":"Diary_0257","81":"Diary_0257","82":"Diary_0257","83":"Diary_0257","84":"Diary_0257","85":"Diary_0257","86":"Diary_0257","87":"Diary_0257","88":"Diary_0257","89":"Diary_0257","90":"Diary_0257","91":"Diary_0257","92":"Diary_0257","93":"Diary_0257","94":"Diary_0257","95":"Diary_0257","96":"Diary_0257","97":"Diary_0257","98":"Diary_0257","99":"Diary_0257","100":"Diary_0257","101":"Diary_0257","102":"Diary_0257","103":"Diary_0257","104":"Diary_0257","105":"Diary_0257","106":"Diary_0257","107":"Diary_0257","108":"Diary_0257","109":"Diary_0257","110":"Diary_0257","111":"Diary_0257","112":"Diary_0257","113":"Diary_0257","114":"Diary_0257","115":"Diary_0257","116":"Diary_0257","117":"Diary_0257","118":"Diary_0257","119":"Diary_0257","120":"Diary_0257","121":"Diary_0257","122":"Diary_0257","123":"Diary_0257","124":"Diary_0257","125":"Diary_0257","126":"Diary_0257","127":"Diary_0257","128":"Diary_0257","129":"Diary_0257","130":"Diary_0257","131":"Diary_0257","132":"Diary_0257","133":"Diary_0257","134":"Diary_0257","135":"Diary_0257","136":"Diary_0257","137":"Diary_0257","138":"Diary_0257","139":"Diary_0257","140":"Diary_0257","141":"Diary_0257","142":"Diary_0257","143":"Diary_0257","144":"Diary_0257","145":"Diary_0257","146":"Diary_0257","147":"Diary_0257","148":"Diary_0257","149":"Diary_0257","150":"Diary_0257","151":"Diary_0257","152":"Diary_0257","153":"Diary_0257","154":"Diary_0257","155":"Diary_0257","156":"Diary_0257","157":"Diary_0257","158":"Diary_0257","159":"Diary_0257","160":"Diary_0257","161":"Diary_0257","162":"Diary_0257","163":"Diary_0257","164":"Diary_0257","165":"Diary_0257","166":"Diary_0257","167":"Diary_0257","168":"Diary_0257","169":"Diary_0257","170":"Diary_0257","171":"Diary_0257","172":"Diary_0257","173":"Diary_0257","174":"Diary_0257","175":"Diary_0257","176":"Diary_0257","177":"Diary_0257","178":"Diary_0257"},"Date":{"0":"unknown","1":1019.0,"2":1021.0,"3":1023.0,"4":1024.0,"5":1029.0,"6":1034.0,"7":1036.0,"8":1037.0,"9":1038.0,"10":1039.0,"11":1042.0,"12":1043.0,"13":1045.0,"14":1046.0,"15":1047.0,"16":1048.0,"17":1049.0,"18":1051.0,"19":1052.0,"20":1053.0,"21":1054.0,"22":1055.0,"23":1056.0,"24":1057.0,"25":1058.0,"26":1059.0,"27":1060.0,"28":1061.0,"29":1062.0,"30":1064.0,"31":1065.0,"32":1066.0,"33":1070.0,"34":1071.0,"35":1085.0,"36":1090.0,"37":1106.0,"38":1113.0,"39":1114.0,"40":1122.0,"41":1123.0,"42":1128.0,"43":1132.0,"44":1138.0,"45":1139.0,"46":1140.0,"47":1141.0,"48":1143.0,"49":1144.0,"50":1145.0,"51":1147.0,"52":1150.0,"53":1151.0,"54":1152.0,"55":1154.0,"56":1156.0,"57":1157.0,"58":1158.0,"59":1162.0,"60":1163.0,"61":1168.0,"62":1169.0,"63":1170.0,"64":1194.0,"65":1195.0,"66":1200.0,"67":1203.0,"68":1210.0,"69":1211.0,"70":1212.0,"71":1213.0,"72":1214.0,"73":1215.0,"74":1216.0,"75":1217.0,"76":1218.0,"77":1219.0,"78":1220.0,"79":1221.0,"80":1222.0,"81":1223.0,"82":1224.0,"83":1225.0,"84":1226.0,"85":1227.0,"86":1228.0,"87":1229.0,"88":1230.0,"89":1232.0,"90":1233.0,"91":1234.0,"92":1237.0,"93":1242.0,"94":1243.0,"95":1245.0,"96":1246.0,"97":1247.0,"98":1248.0,"99":1252.0,"100":1253.0,"101":1254.0,"102":1259.0,"103":1260.0,"104":1261.0,"105":1267.0,"106":1268.0,"107":1294.0,"108":1299.0,"109":1303.0,"110":1304.0,"111":1306.0,"112":1307.0,"113":1308.0,"114":1309.0,"115":1313.0,"116":1315.0,"117":1325.0,"118":1326.0,"119":1327.0,"120":1328.0,"121":1330.0,"122":1331.0,"123":1332.0,"124":1333.0,"125":1341.0,"126":1342.0,"127":1343.0,"128":1345.0,"129":1348.0,"130":1349.0,"131":1350.0,"132":1351.0,"133":1352.0,"134":1353.0,"135":1354.0,"136":1355.0,"137":1356.0,"138":1364.0,"139":1365.0,"140":1366.0,"141":1367.0,"142":1368.0,"143":1369.0,"144":1370.0,"145":1373.0,"146":1374.0,"147":1375.0,"148":1376.0,"149":1377.0,"150":1378.0,"151":1379.0,"152":1380.0,"153":1381.0,"154":1382.0,"155":1383.0,"156":1384.0,"157":1385.0,"158":1386.0,"159":1387.0,"160":1388.0,"161":1391.0,"162":1393.0,"163":1395.0,"164":1396.0,"165":1397.0,"166":1399.0,"167":1401.0,"168":1402.0,"169":1406.0,"170":1407.0,"171":1409.0,"172":1410.0,"173":1412.0,"174":1416.0,"175":1417.0,"176":1418.0,"177":1419.0,"178":1420.0},"Entry":{"0":"\n\n","1":"\nA good deal of artillery activity round here lately\n","2":"\nSeventh and Eighth bns. are having a raid tonight in front of our lines.\n","3":"\nThe raid was successfully carried out last night. We hear the raiders killed about 40 germans. Our casualties were 2 killed.\n","4":"\nOne of our planes set fire to two german captive baloons.\n","5":"\nWent into supports at Swan Chateau\n","6":"\nReturned to Devonshire camp by the same method as coming into the line.\n\nSecond and Third bns. had a raid tonight. They were both successful. We hear that there were 67 raids on the\n\nBritish front.\n","7":"\nMarched to Steenevorde. Crossed border at about 2 p.m. 15 miles march.\n","8":"\nAnother march to about 13 miles.\n","9":"\nStill on the move. Crawled into Nortleulinghem (after marching about 15 miles) at about 3 p.m.\n","10":"\nFour of our chaps\n\nincluding myself paid a visit to St. Omer in a dog cart. All went well until the return journey at about midnight. About 3 miles from home the tyre came off the wheel and we had to get out and hump shankus. To make matters worse it came on a blizzard and we crawled into bed a sorry crowd.\n","11":"\nLeft Nortleulinghem\n\ntoday. Marched to St. Omer and entrained there for Longpre. We travelled to Longpre via Calias and Bolougne.\n","12":"\nArrived at Longpre about 2 a.m. and marched to Bruchamps 8 miles.\n\nBn parade to read out the sentences given by D.C.M. to two of our men one man got 15 years for desertion and the other 2 years.\n","13":"\nWent per motor lorry to a position about 8 miles from Fricourt and marched to that place.\n","14":"\nCamped in tents and about a mile from Fricourt last night and moved on to Hametz Woods today.\n\nWe expect to go into the line in a few days.\n","15":"\nWe are camped in all kinds of rough biveys here.\n","16":"","17":" all kinds of fatigues last night. The majority of us were carrying sleepers up a hill for the purpose of constructing a road.\n","18":"\nWent into line today 2 coys in line and 2 in supports. We expect to do a stunt shortly. Can see the spires of Bapuame from our position. This seems to be a very big move and I hear our objective is Bapuame\n\nfirst sight of tank today Quite a gruesome looking object.\n\nWe rested in Delville wood en route to line. \"Old Fritz\" put a few 5.9s. over but done no damage.\n","19":"\nOur first casualty last night one of the pioneers seriously wounded in leg.\n\nWe are shifting Hd.Qrs. up closer to line tomorrow. Are at present in dugouts in a sunken road to the\n\nright of Flers. This village is not damaged much by shell fire.\n","20":"\nThe rain has cleared after about a fortnight's drizzle.\n\nThe enemy shelled our position this afternoon. Some of the shells landed uncomfortably near our dugout. One which wounded 3 of our chaps set fire to a small bomb store about 18 feet from us and caused quite a stir.\n\nWe expect to be releived tomorrow night and remain out\n\n2 days and then do a stunt.\n","21":"\nShifted camp to Flers.\n\nWe expect to go back to Delville wood but H.Q. only shifted a few hundred yards. We are camped in a cellar under the monastery. They shell the village every day.\n","22":"\nStill in Flers. Charge postponed owing to bad weather. All preparations\n\nmade.\n","23":"\nShelled the village heavilly but our dugouts were too secure for him to do any damage to us. Dozens of men going to hospital this last few days with bad feet owing to weather conditions\n","24":"\nWe expect to go over tonight 6 sigs are detailed to go up with the coys. It is a small position and the object of the stunt is to straighten\n\nthe line ready for the main offensive which we expect to come off about Monday.\n","25":"\nThe First bn with the aid of a section of the Third bn attacked the enemies strong position. We met with strong resistance and made two attempts to get into his line but owing to heavy rain, strong opposition and conditions of the men we were driven\n\nback each time.\n\nOur casualties were very heavy we lost about two hundred killed missing and wounded.\n\nThe Third bn gained their objective but had to retire this morning.\n\nThere has been an attack all along the line today and we hear the 18th and 5th bns have been successful.\n","26":"\nHarry gone to hospital today with poisoned\n\nfoot.\n\nSome very big shells dropping around. We expect to be relieved this afternoon.\n","27":"\nWe were releived at 6 p.m. and marched to a camp on the Bazentin-Flers road. We moved on to Pommiers Camp.\n\nIt has been very wet all day and we had a miserable time.\n\nZepps came over last night and caused a great stir. They dropped\n\nthree bombs in the vicinity of our camp but done no damage. They also dropped a bomb on a French ammunition dump down south and caused some terrific explosions. The illuminations from the fire lit up the countryside for miles.\n","28":"\nOur bn road making.\n\nA good many enemy aircraft around here every night\n","29":"\nTwo enemy planes bombed one of our clearing stations. They done a good deal of damage. But our antiaircraft guns brought them both down.\n\nOur casualties were killed and wounded 41 and with the exception of the orderly room staff all these were previosly wounded cases.\n","30":"\nWe expect to be releived\n\ntomorrow and go back to Dernacourt.\n\nPromoted to lancecorporal today.\n","31":"\nMarched to Dernacourt via Fricourt\n","32":"\nMarched from Dernacourt to Buire\n","33":"\nWent from Buire to Frimont on motor buses.\n\nIt was bitterly cold all day. Snowed this afternoon the first heavy fall\n\nthis winter.\n","34":"\nMarched from Frimont to St Saveur. This is the best town we have ever been billetted in.\n","35":"\nLeft St Saveur at 2 a.m. and marched to Vignacourt. Entrained here and proceeded to Buire. Marched back to Ribemont about four kilos. We expect to remain here several days.\n","36":"\nMarched from Ribemont to Mametz. We are billeted in huts here and expect to do road work until the New Year.\n","37":"\nMarched from Melbourne camp to Bernafoy. Bns on all kinds of fatigues.\n","38":"\nWe expect to go into the line tomorrow.\n","39":"\nInto the line tonight our position is in front of\n\nGuedecourt Bois. We expect to remain in this position about 7 days\n","40":"\nCame out of the line and camped in Bazentine huts\n","41":"\nMarched from Bazentine to Ribemont\n","42":"\nMarched from Ribemont to Baizieux \nto\n and are camped in tents outside the town. We expect to remain\n\nhere about 3 weeks for the purpose of training before going into the line again\n","43":"\nHeavy snow storm last night. Great snow fights today\n","44":"\nShifted camp from Baizieux to Becourt about eight miles.\n","45":"\nExpect to go into the line about the","46":"\n","47":"\nWent up to line today. I was in the advance party. We are releiving the Fifth Yorks tomorrow night. Bn Hd. Qrs. is in Road.\n","48":"\nWent into line today. The enemy are only about forty yards away and everyone seems neutral. This sector lies between Flers and Warlincourt Butt.\n","49":"\nPlenty of shelling round Hd. Qrs. last night and we had several casualties.\n","50":"\nA raid by the Fifth Yorks last night and we hear it was successful.\n\nWe showed the advance party of the releiving bn round our lines last night.\n\nI hear we go back to Hametz for a few days and then take over from\n\none of the bns in our bde who are in supports.\n","51":"\nWe were releived yesterday and are at present camped in billets at Bazentin No. 5.\n","52":"\nWent into the line again tonight in the same position as last time.\n","53":"\nVery heavy artillery fire last night\n\nand it is rumoured that our Fourth Division went over.\n\nWe expect to remain at this H.Q. about 8 days, doing 4 in support and 4 in front line.\n\nOur bn is training for a raid which we expect will take place in about a weeks time.\n\nThe","54":" brigade had a hop over last night. It was very successful. They took sixty two prisoners.\n\nincluding two officers and drove back two heavy counter attacks. Our casualties were about 143\n","55":"\nShowing bde sig. officer round part of our lines and while doing so got caught in a 5.9 barrage. We tried to run through but had to go back \"toute suite\".\n","56":"\nThe","57":" bn. had a\n\nmuck up tonight in the form of a raid. The whole concern was a failure. I had charge of phone at raid Fld. Qrs. but all lines went down and I had a dis. phone practicilly the whole time. The raiders were only out a few minutes when they were driven back by Machine gun and bombs. They had only six casualties. The barb wire in this\n\nposition is almost impregnable and this the party found impossible to penetrate.\n","58":"\nWe were releived by the Ninth and Eleventh bns tonight and had a route march of about five or six miles to our camp at Fricourt. We expect to remain here about sixteen days.\n","59":"\nMarched from Fricourt Camp to Bresle about nine miles we expect to remain here six days and then return to Fricourt.\n\nWe are now attached to the Fifth Army the","60":" Army having taken over more French territory south of Perrone\n","61":"\nMarched from Bresle\n\nto Fricourt.\n","62":"\nWent per motor lorry from division to reinforcement camp Albert. Am going to Corps Signal School\n","63":"\nArrived at Henencourt today.\n\nK corps signal school starts tomorrow three weeks course\n","64":"\nSchool finished today. A written exam this morning.\n","65":"\nReturned to bn this morning. We are at present camped at Cruxifix Corner, (old Fricourt Camp.)\n","66":"\nMarched from Cruxifix Farm to Ribemont today\n","67":"\nBoxing touring held by our bn tonight.\n","68":"\nShifted camp from Ribemont to Adelaide Camp today it is\n","69":"\nabout 14 miles march Fritz brought two of our balloons down in flames this afternoon.\n","70":"\nMarched from Mountaban (Adelaide Camp) to Haplincourt about eleven miles. It snowed all the way and made things generally miserable. This village has had no shell fire in it but \"Old Fritz\"\n\nhas mined every house cut down all ornamental and fruit trees and filled up all wells. All villages along this front are in the same condition as this one. Nothing but heaps of ruins.\n\nWe only expect to remain here for a night and then move up to the line. This village is about 6 miles behind the line\n","71":"\nWe expect to move on to Beaumetz tonight about five kilos from here. Arrived at a sunken road close to Beaumetz. The country here looks much better than any we have seen in the shelled area of the Somme. Very little damage being done by shell fire\n","72":"\nTwo of our planes\n\nbrought down quite close to our Hd. Qrs. shelled C Coy today one sig. killed and 2 wounded.\n","73":"\nVery quiet all day enemy shelled the road but none came near here. He shelled around our H.Q. all night last night but did no damage.\n","74":"\nEnemy shelled our front line heavilly this morning and\n\nwe had a fair number of casualties.\n\nThe Third bde went over last night at about 4.p.m. and gained their objective.\n","75":"\nOur bde and one bn of the Third bde made an attack last night. The objective of the Second bn was a village called Hermies and the Twelfth bn was Boursies.\n\nOur objective\n\nwas to keep connected up with these two units.\n\nWe hear that so far the 12th bn have failed but the 2nd and 3rd who came up on their right both gained their objective. We done even better than that and captured the village of Demicourt .\n\n\"Fritz\" is at present massing for a counter attack but I think we will be able to hold him back\n\neasily.\n","76":"\nUp all night running lines to Coys. Very little shelling up forward. We returned to old H.Q. this morning.\n\nShelled H.Q. today no casualties with the exception of the bde Major's horse.\n","77":"\nOur bn was releived by the fourth bn last night. We\n\nwent back into supports which is situated in the old firing line.\n","78":"\nVery quiet today on our front. But there seems to be an attack going on on our left.\n","79":"\nRan a line to the transport today expected to remain back there in charge of station until bn. was releived but had to return to bn.\n\nowing to move we expect to make tonight.\n\nWe brought down three of Fritzs captive balloons this afternoon.\n\nWe heard today that the fourth division went further than their objective a few days ago and had about 75 per cent casualties.\n","80":"\nThe 4th bn gained their objective last night. We did not\n\nhave to move forward as expected.\n","81":"\nGreat excitement this morning. \"Fritz\" attacked and captured a few of Fourth bns' posts. We hear the Fourth lost a few prisoners and had a fair number of casualties.\n\nOur bn was called up and are now in position in front line with fourth. We expect them to make another attack shortly. They\n\nshelled our bn Hd Qrs intermittently all night and this morning but we had no casualties.\n\nStill miserable weather snowing nearly every day.\n","82":"\nShelled all around H.Q. today but still no casualties. Some of the shells were very large ones.\n\nWe took up another position between Twelfth and Fourth bns. last\n\nnight. This is the hotest part of this sector and is situated in front of Boursiers.\n\nOut all night running lines to Coys.\n","83":"\nPulled up transport line today. Shifted H.Q. about 1500 yds forward. A lot of batteries round here and we expect big things doing shortly.\n\nThe country round here is in much better condition than the\n\nSomme country we were in before the advance, but all the villages are blown to pieces with mines, and railways blown up.\n","84":"\nMine went up at Q.M. Stores","85":" bn. today. Killed about a dozen men and wounded a good many others. There are explosions of this kind on some part of this front\n\nnearly every day. This place was captured about three weeks ago. These mines are either exploded by hidden trip wires or some chemicaly prepared means.\n","86":"\nChecking time this afternoon. This generally means a stunt by either of our chaps or \"Fritz\"\n","87":"\nWent back to take charge of transport phone today. \"Trais bonne\".\n","88":"\nGood deal of aerial activity today. Our chaps came a cropper on this front losing one captive baloon and one aeroplane. Great display of courage by a german aviator putting tales of our aviators feats in\n\nthe shade.\n","89":"\nOur machines brought down a \"Fritz\" today. The bn. releived tonight by the Sixth South Staffords. We expect to be releived off this front and travel north.\n","90":"\nWe marched from Velu to Sugar Factory on the Beaulencourt Le Transloy Road and expect to remain here a few days and then\n\nmove further back\n","91":"\nBde moved off at 11 a.m. to go in reserve to Second Division who are having a stunt tonight. We hear this is going to be on a large scale about a million troops operating in it. I stayed back at H.Q. in charge of phone.\n","92":"\nShifted camp from Sugar Factory to a\n\nposition about a quarter of a mile south of Veaulx. We are in reserve for a stunt which we expect to take place this week.\n","93":"\nThe Second Division attacked the German position on the Hindenburg line this morning and met with strong opposition and as far as we can gather lost all\n\npositions gained in the attack by them. Our bn. moved up to the outskirts of Veaulx ready for expected counter attacks.\n","94":"\nWe reinforced the line last night and I believe our bde had a good number of casualties. Went back to transport lines being crook so missed the stunt.\n","95":"\nSome very heavy counter attacks all last night our bn lost heavilly.\n","96":"\nThe bn were releived from front line by 4th bn. tonight and went back into supports.\n","97":"\nThe bn. went back to the Northern side of Veaulx into reserve tonight\n","98":"\nOur bn was releived again today and we are back in the old position we occupied at Sugar Factory before going into stunt.\n","99":"\nUp at 2.30 a.m. and marched to Bapaume to catch train for school. Arrived at Albert in train at midday. At 3 p.m. we marched to a School\n\nmidway between Avelny and Pozieres but on arrival there we were informed that our school was cancelled and were told to report back to reinforcement camp Bazentin.\n","100":"\nCamped at Reinforcement camp last night and reported to our units this morning.\n\nOur bn has shifted to Bazentin.\n","101":"\nReported back to reinforcement camp tonight and expect to remain there a few days awaiting school to begin.\n","102":"\nMarched from Bazentin to Corps School this morning.\n\nPaid a visit to a village called Bouzincourt this afternoon.\n","103":"\nSchool started today. Heard the battalion\n\nmoves back to Buire or Bresle today.\n","104":"\nReturned to bn. from Corps. school having gone through this course at a previous school.\n\nOur battalion is at Lavieville the whole Division having moved back into this area.\n","105":"\nOn furlough to Amiens today.\n","106":"\nBde sigs. School started today 10 days course.\n","107":"\nBde church parade today. Gen. Birdwood and Walker were present issuing out decorations. I received my M.M.\n","108":"\nMarched to Englebermer from Lavieville via Hellencourt and Senlis. We expect to remain here about 10 days for a course of field training.\n","109":"\nShifted camp from Englebermer to Mailley. Had to shift from that town to let Tommy artillery in.\n","110":"\nHad a big field day today for the purpose of training staff officers.\n","111":"\nHad an all night manouvre last night and finished about 8 oclock this morning. Most of the work was\n","112":" in the Serre area.\n","113":"\nMarched from Mailley to Lavieville via Senlis and Henencourt. We expect to remain here about 4 days.\n","114":"\nMarched from Lavieville to Pozieres today for the purpose of attending the unveiling of a monument in memory of the chaps who fell in that stunt last July. It was rather a heavy march\n\nas we had to march home again.\n","115":"\nWe were inspected by the king today. The bde. marched down and paraded along both sides of the Amiens Road and he drove by in his car.\n","116":"\nThe bn marched from Lavieville to a camp half way between Bray and Maricourt today. I was fortunate enough to draw a bike and\n\nrode down via Buire, Dermacourt, Meaulte and Fricourt. We expect to remain here a few days and then (popular rumour says) entrain at a siding here for the north.\n\nThe huts are big wooden arrangements and will accomodate about a coy. of men. They were built by the French before our people took over this part of the line last December.\n","117":"\nMarched from camped near Bray to Dernancourt and expect to entrain about a kilo from here.\n","118":"\nRode on bikes to Rebempre about 225 kilo's in search of 3 lost fullerphones.\n","119":"\nEntrained at Edge Hill siding Dernancourt at 1945 tonight\n","120":"\nLeft Edge Hill at 8.30 p.m. and arrived at Amiens\n\nabout midnight we travelled via Domart, Doullens, St Pol, and Lillers and de-trained at Bavinschove about 5 am. Marched from Bavenshove to Wallon Cappelle, and went into billets surrounding the town.\n\nWe hear that most of the towns we were billeted in on our previous garrison of this front have since been blown to pieces.\n\nFritzs' aircraft are being active round here and pay nightly \nbillets\n visits to\n\nHazebrouck.\n\nWe expect to remain in this area about ten days and then proceed towards the line.\n\nThere is a good deal of artillery fire going along the whole front and everything points to a very big offensive.\n","121":"\nPaid a visit to today.\n","122":"\nNew sig officer today took stock of all stores. 2 bns. of 3rd bde moved off in\n\nmotor buses today. They moved in the direction of St Omer but their destination is unknown.\n","123":"\nLaid lines to all coys.\n\nGreat rumours of big advance something is doing up north as there has been a very heavy bombardment going on for some time.\n","124":"\n\"Fritz\" shelled Hazebrouck with heavy long range guns yesterday afternoon.\n\nIt is rumoured that a large amount of damage was done. Most of the civilians shifted into the surrounding villages.\n","125":"\nWe marched from Wallon Cappelle to billets near Sec–Bois and expect to remain here for a few days.\n\nBombed Hazebrouck last night and are shelling it all the morning.\n","126":"\nAwakened last night by our antiaircraft guns firing at \"Fritz\" planes.\n\nHe seemed to have a good many planes up and bombed Hazebrouck and surrounding villages. One of the bombs dropped in the vicinity of one of D Coys billets.\n","127":"\nMore shelling and bombing today.\n","128":"\nThe first field Coy Engrs. moved towards the line today and I hear some of the other two bdes of our division\n\nare billited in Sailly.\n","129":"\nMore shelling of Hazebrouck by heavy guns today.\n","130":"\nSports today to celebrate the forming of the First Brigade three years ago.\n","131":"\nThe enemy aircraft bombed Hazebrouck and a dump near here early last night. There was a great fireworks display by our antiaircraft guns machine guns and searchlights.\n\nDropping more shells into Hazebrouck.\n\nThe rumour of the original first Division returning home seems to be confirmed now as we hear arrangements are being made to that effect.\n","132":"\nThe enemy airoplanes bombed a dump near here last night but did very little damage. They also got on to a labour battalion camp and wounded about 55 men\n\nkilled 16.\n","133":"\nMore aircraft over today and the usual performance last night.\n\nPaid a visit to Merris via Strazelle on Cycles today.\n","134":"\nBde test today.\n","135":"\n1st Bn won the Bde signalling test.\n\nMore aeroplanes last night one german got right into the range of a searchlight and made a fine target for the aircraft\n\nguns but they failed to bring him down\n","136":"\nPicture show in Veux Bequin last night. Free to all First Bn.\n","137":"\nOpen air concert last night the performers were the","138":" Anzac concert party.\n","139":"\nStarted on leave to England today. Went from Sec-Bois by motor lorry to Hazebrouck and entrained\n\nthere for Bolougne at 2 p.m. arrived at Bolougne about midnight and were billeted in a factory which has been commandeered by the military for that purpose.\n\nA squadron of enemy aeroplanes bombed this town tonight and one bomb dropped quite close to our party as we were marching from train to our billet. We hear there were a number of casualties among the civilians.\n","140":"\nEmbarked aboard the \"Onward\" this morning and remained aboard all day. But we did not push out owing to some trouble with U boats. Gen. Haig was travelling with us but he changed his plan and went across aboard a destroyer.\n\nWe disembarked again and the leave party went to a camp about 3 miles out of town. But I slipped away and remained\n\nin that town that night.\n","141":"\nEmbarked again this morning. This time we are on a paddle wheel steamer. Moved across the chanell this morning and arrived in Folkestone shortly after midday. There were 4 boats went across and a fairly strong escort of destroyers.\n\nWe immediately entrained ","142":"\n for London and arrived at Victoria Stn. about 3 p.m. were marched down to\n\nHorseferry Road and were given money and clothing. Stayed the night at the War Chest Club.\n\nAeroplanes bombed London last night and did a fair amount of damage.\n","143":"\nPaid a visit to the Tower and in the afternoon had a look at Kew Gardens\n","144":"\nWent out to Windsor this morning and returned via Waterloo\n","145":"\nWe travelled on the Great Western to Fishguard from Paddington via Newport and Cardiff.\n\nWent by boat to about 3 ½ hrs. and took the train again to Mallow changed trains at Mallow and arrived in Killarney about noon of the","146":"\n\nDone a trip across the lake to Innisfallen Island and viewed some very romantic places.\n","147":"\nDone a big motor trip of about 120 miles around\n\nthe west coast via and . Had a look at the church in erected to the memory of Daniel O'Conell and returned along the eastern border of Kerry.\n","148":"\nLeft Killarney this morning and travelled to Mallow. Went down to the village \nand\n missed train. And had to wait about 3 hrs. for the Dublin Express. Arrived in Dublin about 9 p.m. and caught the boat for Hollyhead\n\nfrom Kingston. Left Hollyhead at midnight and arrived in Euston on the morning of the 14th.\n","149":"\nLeft Victoria at about 9 a.m. and arrived at Folkestone about midday. Crossed to Boulogne this afternoon and went into huts at a rest camp there.\n","150":"\nLeft Boulogne about 1 a.m. and arrived at our destination a village called Ceastre about 7 hrs later. The details of our\n\nbn. are billeted here. The bn. having gone up towards the line leaving about out here. They expect the bn to do a stunt on Sunday. We expect to remain in this camp until the bde have done thier hop over.\n","151":"\nWent up to Dickebush yesterday and found the battn. there. They were dropping a few shells while I was there but did very little damage. One shell dropped\n\nonto A Coys cooker and knocked it to pieces.\n\nA great number of German planes flying around but our people seem unable to bring them down. There were 3 or 4 very large Gothas.\n\nThe battery moved up closer to the line this afternoon and expect to go into the line tomorrow.\n","152":"\nWent up to the Q.M. store again today. The battn. have been in\n\nthe line since Sunday and have had a fair number of casualties with gas and shellfire. One of our sigs was killed yesterday afternoon and I hear another was wounded.\n\nThere are a large number of tanks in the forward area.\n\nI hear the stunt takes place tonight. The 2nd and","153":" Bdes attack, and our bde hold the line. It has been read out to the troops that the success of the allies is depending on this\n\npush. The enemy is shelling Hazebrouck.\n","154":"\nVery heavy bombardment last night. It illuminated the sky for 50 miles round. More shelling of Hazebrouck today. No details about the stunt but I hear they are not expected to go over until this morning.\n","155":"\nWe hear that our Div. have been very successful in their attack this morning. They gained their objective\n\neasily and had very few casualties. We captured \n200 machine guns and a good\n 200 prisoners and a good number of machine guns.\n","156":"\nWent up to Q.M. Stores yesterday.\n\nThe attack the day before was a great success. The 18 pounders have moved forward fifteen hundred yards and cannot get in touch with \"Fritz\" so he must be well on the move.\n\nOur battn. is in reserve and up to the\n\npresent have only had 80 casualties. They expected to releive a battn. of the","157":" Bde lst night and then advance still further forward but up to the present we have had no further details.\n\nThere are a number of wounded tanks moving back past the QMs from the front and I hear they have done some very good work up there.\n","158":"\nThe battn was releived again last night. There was about 20 casualties caused\n\nby an aeroplane bomb dropping on one of our coys. Lt. Bruton the old signal was killed in the explosion.\n","159":"\nWe shifted camp from Ceastre to billets about 5 kilo's north of Steenvoorde and expect to join up the battn. again tomorrow. There are a good number of german airoplanes flying round here. But they are flying too high for our Antiaircraft guns to get a decent shot at them.\n","160":"\nWe are billeted at a farm about two kilo's from Wateau.\n\nThere was a good deal of aerial activity last night and Fritz dropped a number of bombs on different villages round here. The battn. marched into billets here this afternoon.\n\nI believe our casualties for the whole affair was about 200 and about 20 of these were killed.\n","161":"\nEnemy aeroplanes bombed the tommie camps around\n\nhere last night and did a fair amount of damage.\n","162":"\nEnemy aeroplanes bombed round here last night. There was a great deal of antiaircraft gun activity and the searchlight got onto several of his planes but the gunners failed to bring any down.\n\nWe expect to move from here tomorrow and go towards the lines. The Brigadier stated on\n\nchurch parade this morning that we were taking part in a very large offensive and from all accounts things are going to be pretty warm.\n","163":"\nWe shifted from billets near Watou to Chateau Segard.\n\nFritz shelled and bombed Poperinghe last night one 12 inch naval shell dropped through the roof of a restaurant landed in a bed on the top floor of the building\n\nand did not explode. There was an officer in the bed and he had both legs and an arm broken by the fall of the shell.\n\nWe travelled from the billet via Watou Poperinge and Dickebusch.\n","164":"\nEnemy aeroplanes bombed all round our camp last night but failed to do any damage to our battn.\n","165":"\nWe moved up to Westhoex ridge last\n\nnight and camped in the open. The shell fire is pretty severe up here. There are a good many concrete dugouts around and he was trying to hit them all night.\n\nFritz planes were very active last night and done a good deal of damage on the road we were travelling along. He got several dumps and caused a good few casualties. He dropped about half a dozen near our party but\n\nfailed to hit anyone.\n\nWe expect to move further up tonight and do the hop over in the morning.\n\nOur people are putting up heavy half hour barrages at intervals of about two hours all day. Fritz reply seems very weak but he seems to have a bit of a set on this position and some of his 5.9 are landing too close to be comfortable.\n\nThe german concrete dugouts round\n\nhere are very solid affairs being composed chiefly of a small room about 8 feet square with concrete walls about 3 feet thick consequently it takes a very heavy shell to penetrate through them.\n\nAt present we are out in the open but we expect to establish ourselves in one of these before the hop over. The boys have nicknamed these Pill Boxes.\n","166":"\nThe hop over came\n\noff this morning. The battns marched up in single file but fritz got wind of it with his flares and shelled us practicilly all the way.\n\nWe arrived at the front line about 2 a.m. and got into shell holes to await the attack about 5.30 fritz put his barrage right on to our position. It was the most awful half hour I have\n\never experienced.\n\nAt six oclock his barrage lifted and ours started. What was left of us hopped up at 6.30 and went over the top.\n\nI was walking toward a german pill box when one of the enemy inside knifed me in the left arm. I felt a frightful wrench and looked down to discover my left forearm swinging about\n\nin all directions.\n\nI then made back toward the dressing station. Fritz shelled us all the way back and only having a piece of respirator string to tie my hand up with it gave me frightful agony.\n\nWas eventually passed through to the \nC.C.S. and entrained\n from there about 6.30 p.m. Arrived at Cumiers\n\nAmerican hospital about 6 p.m. and was put to bed my arm feels pretty crook. Had the arm bandaged and dressed this morning again.\n\nExpect to get across to England in the course of a few days.\n\nI hear our lads captured their objective O.K. but that the casualties were very heavy.\n","167":"\nHad the X rays on my arm today.\n","168":"\nWas told today that I am going to Blighty. This is the","169":" Gen. .\n\nMy arm has not been set yet so there is still a bad time in store.\n","170":"\n England again today and have to parade before the Col. in the morning.\n","171":"\nWe were pulled out of bed at 1.30 this morning and paraded down to the reception tent for England. Here driven in motor lorries to station at Camiers and then put into hos. train.\n\nLeft Camiers at 3.30 this morning and arrived at Calias at 0745 there we embarked on hospital boat.\n\nLeft Calias at 12 noon and arrived in Dover at\n\n0230. Entrained there for Liverpool arrived here at about midnight and were met at the station by private cars. Were driven out to a place called Oakdene near the village of Rainhill.\n","172":"\nThis is a V.A.D. hos. and is first class. Did not get to bed until 3 this morning as I had to have wound dressed.\n\nThe name of the hospital\n\nboat we came across in is Pieter De Connick.\n","173":"\nStill in bed most of the other chaps who arrived here with me have been able to get up but as my arm does not seem to set too well I am still confined to bed.\n","174":"\nThe chap in the next bed to me died from some kind of heart trouble last night\n","175":"\nArm shifted from flat triangular splint to ordinary splint today.\n","176":"\nOut of bed today for the first time since my arrival in England.\n","177":"\nWent to a concert given by the Mayoress of St. Helens today. It was in the Theatre Royal and was not much of a show but as it was the\n\nfirst outing since my arrival here I enjoyed it very much.\n","178":"\nChap in next bed operated on today very bad wound in hand.\n\n"}}