{"Document Name":{"0":"Diary_0110","1":"Diary_0110","2":"Diary_0110","3":"Diary_0110","4":"Diary_0110","5":"Diary_0110","6":"Diary_0110","7":"Diary_0110","8":"Diary_0110","9":"Diary_0110","10":"Diary_0110","11":"Diary_0110","12":"Diary_0110","13":"Diary_0110","14":"Diary_0110","15":"Diary_0110","16":"Diary_0110","17":"Diary_0110","18":"Diary_0110","19":"Diary_0110","20":"Diary_0110","21":"Diary_0110","22":"Diary_0110","23":"Diary_0110","24":"Diary_0110","25":"Diary_0110","26":"Diary_0110","27":"Diary_0110","28":"Diary_0110","29":"Diary_0110","30":"Diary_0110","31":"Diary_0110","32":"Diary_0110","33":"Diary_0110","34":"Diary_0110","35":"Diary_0110","36":"Diary_0110","37":"Diary_0110","38":"Diary_0110","39":"Diary_0110","40":"Diary_0110","41":"Diary_0110","42":"Diary_0110","43":"Diary_0110","44":"Diary_0110","45":"Diary_0110","46":"Diary_0110","47":"Diary_0110","48":"Diary_0110","49":"Diary_0110","50":"Diary_0110","51":"Diary_0110","52":"Diary_0110","53":"Diary_0110","54":"Diary_0110","55":"Diary_0110","56":"Diary_0110","57":"Diary_0110","58":"Diary_0110","59":"Diary_0110","60":"Diary_0110","61":"Diary_0110","62":"Diary_0110","63":"Diary_0110","64":"Diary_0110","65":"Diary_0110","66":"Diary_0110","67":"Diary_0110","68":"Diary_0110","69":"Diary_0110"},"Date":{"0":"unknown","1":1682.0,"2":1683.0,"3":1684.0,"4":1685.0,"5":1686.0,"6":1687.0,"7":1688.0,"8":1689.0,"9":1690.0,"10":1691.0,"11":1692.0,"12":1693.0,"13":1694.0,"14":1695.0,"15":1696.0,"16":1697.0,"17":1698.0,"18":1699.0,"19":1700.0,"20":1701.0,"21":1703.0,"22":1704.0,"23":1705.0,"24":1706.0,"25":1707.0,"26":1708.0,"27":1709.0,"28":1710.0,"29":1712.0,"30":1713.0,"31":1714.0,"32":1715.0,"33":1716.0,"34":1717.0,"35":1718.0,"36":1719.0,"37":1720.0,"38":1721.0,"39":1722.0,"40":1723.0,"41":1724.0,"42":1725.0,"43":1726.0,"44":1727.0,"45":1728.0,"46":1729.0,"47":1730.0,"48":1731.0,"49":1732.0,"50":1733.0,"51":1734.0,"52":1735.0,"53":1736.0,"54":1737.0,"55":1738.0,"56":1739.0,"57":1740.0,"58":1741.0,"59":1742.0,"60":1743.0,"61":1744.0,"62":1745.0,"63":1746.0,"64":1747.0,"65":1748.0,"66":1749.0,"67":1750.0,"68":1751.0,"69":1753.0},"Entry":{"0":"\n\nRead after last page\n\nWednesday 18 Sept (continued from back)\n\nHad a plate of Stew after getting my leg tied up again & went straight on the train at about 2.30. The C.C.S was very busy some very bad cases. Had a good trip in the train. Bread Butter & Bullee & Tea once & B &B once to eat. 8 sitters & 2 stretchers in the carrage all the other sitters were arm cases. Nearly all left arm so I had to be quite the attendant Arrived Rouen about 6.30 a m & motored to No1 A.G.H about 2½ miles. Waited round for a time. Had a hot bath & went to bed & had something to eat. Then slept.\n\n","1":"\n\nHave mucked about all day being on draft. There was a free Picture show for us in the Afternoon Did not go as I wanted to do some writing. Fell is just before 7 P.M Role Calls Etc but just before we were to march off 3 Pioneers were taken of I am one of them Have no idea why it was done. But as it turned out turned out a very wet night & I felt rather seedy with a cold was not all together sorry But it will mean getting all ready again in a day or so\n","2":"\n\nWas transfurd to A Co as they send the next Draft. Put in the day getting there It took quiet ½ an hour \n","3":" 11\n\nUsual Parade but there was a good deal of rain so did very little. This is the first decent rain for a long time & it was badly needed Put in an application to go to the Machine Gun School as called for Am not very keen on the job but it is about the only way\n\nto get another few days leave. Which I am quite keen about\n","4":"\n\nParade in morning. Drawing UK kit for M G School in afternoon C.D.O inspection Etc\n","5":"\n\nMesed about in morning. Got a week end pass & went to Sutten V in afternoon. Went to Pictures with Hall. Had Poached Egg on Toast at Weslean Hut afterwards Stayed at Training Camp for the night\n","6":"\n\nStayed at\n\nTraining Battl all day A good deal of Rain\n","7":" (St Swithens day)\n\nWent on Parade as usual, But an Officer took about 20 of us to see the Draft go through a Platoon in atack according to a new idea The Platoon only had about 40 men 2 sections of 6 men & 2 N.C.O with rifles 2 L. Gun teams of 9 men & 1 N.C.O The L.G. work on the Flank & cover the Rifle mens advance & visa verse. Smoke Bombs were used but did not seem to be a great success. It was quite an interesting show & hard work for the men in it This is St Whitins Day\n\n& if it rains (as it has very slightly) The leagon says it will rain for 40 days They say it was so last year. The Tale is that St Whitins who was Bishop of \nof\n Whinchester was buried out side the Church & it rained for 40 days until they took the old chap inside & then it stopped.\n","8":"\n\nThe M. Gun Draft left early this morning without me Rotten luck. We were all supposed to be in one Hut, But I did not know anything about it Went Sick & have \n\nbeen isolated as I have Scabies Just an irritable rash. Have been bathed in disinfectant & rubbed all over twice today with a yellow sort of ointment. A lot of Sulphur in it. Live by ourselves but can go about as we like. Three men came in to day from Loose – one of our jails. In the Army it seems the correct thing to tell all about your crimes, In fact rather to glory in them. These chaps have not been allowed to talk so are making up for it now\n","9":"\n\nIn isolation greased my self twice Was mess orderley to day. Was awake for a long time last night & it was like being in a big Rat hole to hear some of the others scratching. The irritation has almost left me\n\nHave just listened to quite a good lecture by an Indian. There was nothing very special in the lecture but he brought in a great many funnie little stories. They were quite good & well told. So things went off well\n","10":"\n\nOnly one dose of greese today Went over to Training Ball in evening & went to Pictures with Hall. They were good.\n","11":"\n\nHad a bonnie bath & was turned out of isolation. Equiped for over sea & put into C. Co for next Tuesdays Draft\n","12":"\n\nFell in with full packs for kit inspection It consisted of seeing we all had our disks stamped properly\n\nHad another bath, to make sure I was quite clean. Went over to T. B in evening & saw a decent concert at Greenhills Y.M.\n","13":"\n\nWent on Church parade the first time for a very long time Allways seem to miss it without trying too. A very good little address Took a walk around this evening through Longbridge Deneril. Just a wee place near here\n","14":"\n\nWent through the Platoon in attack\n\nstunt.The objective is a little over ½ a mile from the jumping off point & you do it mostly at the double in Battle order carrying 120 Rounds also had 2 Bombs. Had more than enough by the time I reached the last trench & would not have been able to put up much of a fight if it had been the reall thing. Kit inspection in afternoon.\n","15":"\n\nAs it was raining heavily the Colonel sent us straight back to our Huts like a sensible man instead of making\n\nus throw live Bombs as we should have done Fell in about 7 PM & moved off about 8 Entrained at Warminster (5 miles march) and started at 11 \narri\n good cariages 8 in each compartment arrived Shorncliffe at 5 AM & marched on to Folkistone about 1 mile were put into resideantial Flats there & given a drink of tea right of Breakfast at 7 (Bacon Potatoes Bread Jam & tea) not a particular good meal. Fell in again given 24 hours ration and marched straight on to boat not far. Started at 10\n\n& in hours were in Boulongue . The boat was full so could not get a place for a sleep. It was not roughth but the boat made sundry irregular movements & there was much sickness. Folkestone seems to be a fine town all its nice looking houses. About 2 miles from the quay brought us to the Camp. It is on top of a \ntown\n hill which seemed to be 10,000 ft high. The Dr had a look at us we were put in to the tent & issued with 1 Blanket each, But we\n\nhave 2 each. Pioneers are good at that sort of thing It is years since I have seen so much dust It is only in the camp sandy ground & there is a strong wind howing reminds me of the Darling R. A few drops of rain just after the Boat started otherwise beautifull weather This is up to Wed night","16":"\n","17":"\n","18":"\n\nGot well off to sleep last night when there was an Air Raid warning Had to turn out 12.30 & take\n\nshelter in some open trenches got to bed again at 1.30. Could still hear shots occasionally & at 2.30 had to turn out again. Clouds were fairly thick by this time & the search lights were beautifull & Only out a few minutes peace for rest of night\n\nHad a good breakfast Marched back to Boulogne & left there at 2.30 per train about 30 of us in a truck Went through Etaples & saw where the Hun dropped some of his eggs last night One hit on the line & tiped an engine over another had killed a horse\n\nbut there were a lot of casulities we heard Had about 2’6” x 1’6” \nto\n of floor space to sleep on & it gradually got smaller but slept some of the time & as a good many Tommies got out at Rouen some of us moved in to & empty & had plenty of room (5 AM). Got to Hasfleur at 10.30 Friday morning & marched on here (1 mile). Have been issued with Waterproof & Rifle cover & been well fed. This camp is about 5 miles from Le Harve \n","19":"\n\nRevalie at 5.30 & had to turn out for a Roll Call. Spent a strenous \n\nforenoon going through gass. Walked all told about 6 miles. Had lectures. Gass Drill etc . Had to walk about ½ a mile with the Masks on When we thought everything was finished & we had fallen in ready to move off there was a shout of Gass several smoke bombs were let off to windward & before we could get our masks on we were covered with very smellie smoke. Harmless of course. Got back to camp by 1 oclock & were warned that we were \non\n to move up the line that night Started at 6 PM & marched to Le Harve about 4 miles\n\nentrained right away but did not leave untill about midnight. Were in trucks with seats along the side & centre. Ours was not full so had a good sleep 2 of us on a seat. Reached Reuon at 7 AM & went to Rest Camp for the day. Had leave from 10 till 1 & had a walk in the main part of the town Some fine buildings & Churches,.A big group of statuery at the end of the main street could not make out what it represented Nearly all the shops were open allthough it was Sunday A lot of Americans in the\n\nrest Camp with us. In fact there were all sorts there. Got on the train again at 5 PM 3rd class cariages this time only plain board seats 6 in the carriages, 2 got on each seat & 2 on floor. The floor for mine & had a very good nights sleep Got tea at Etaples & had Breck travelled sloowely untill 4 PM then left the train near St Amer Came through Bologne today where we left last Thursday.\n\n It was a long trip for practically nothing. Marched from the train line ½ mile \n\nIt is the","20":" Div Reinforcement Camp. A very pretty place at the back of a Chateau About 3 or 4 Ac with very fine trees & a hedge around it. The tents are pitched between the trees & there is nice short grass in the centre Have passed through a lot of cultivated \ngrass\n land to day very good crops. Can hear the guns in the line tonight\n\nA great number of our planes keep going up & down to the line. Had a blanket issued this evening\n","21":" \n\nMarched to Battn H 2 about 12 Killos. Our packs were taken by wagon & as there were only 8 of us we got a lift on 2 different Lorries that saved about half the walking. A Co is right at Head 2 so was right at home. My platoon is in the line but as they are to be back in a day or so am not to be sent up to them. It has been quite hot to day.\n\nThis seems a very good camp & all the dug outs are at least ½ under ground. Started to make one for myself this\n\nafternoon but did not do very much as I have been yarning most of the time with old mates. We are a good distance behind the line. A good many big guns about but none very close. The French are looking after there Crops all about here & the crops are very good.\n","22":"\n\nWent to the Wivie Baths this morning. The shirt I got was very dirty Issued with cotton shorts now instead of underpants. A good idea as it is so hot A Co played Headquarters Cricket this afternoon &\n\nwere beaten. We hear that we are to move somewhere in a day or so.\n","23":"\n\nLoafed about the camp all day. Packed up & sent our packs & blankets away this evening Played cards untill about 1 AM & then stretched out for a while but got no sleep.\n","24":"\n\nTurned out at 4 had breck right away & then the usual bustle to fall in. Once you fall in it is the dead end. Apparently there is nothing more to be\n\ndone for a day or so as you always stand about for ½ an hour or so. Moved of at 5.45 marched about 16 Killos through Longue Croix Ebblingham Renescure \nt\n & other small places to Champagn a nice place about 6 Ks from St Omar arrived 11.5 \nOwing\n Light rain started about 10 oclock & laid the dust nicely. It was a nice cool morning pleasant for marching. Owing to our execelent orginarzition we had to wait over an hour for dinner which consisted of tea only. It was raining but that was no\n\nexcuse as other Co had thers much sooner. There are 12 in the tent.\n","25":"\n\nFell in twice this morning for inspection. Went for a walk around some of the villages in afternoon\n","26":"\n\nChurch parade went about 1 Kilo allong a very muddie road. A good little address. Quite a good Searchlight display last night. Saw no Planes.\n","27":"\n\nA great lot of messing about this morning to be inspected by Maj Gen Glascow\n\nIt was bad enough but it was worse this afternoon. We are on Picquet & had just drawn our tea when we were ordered to fall in. Of course we did not fall in imediately but still we husiled & then as usual stood about & were inspected 4 times. Now we have 1½ hours to wait before going out. The Picquet amounted to walking about 1 mile & sitting down untill 9 oclock then home. Forgot to mention had 2 parcels a day or so back one packed by Am – & one by Fig Tob & nurishment also a newspaper from Mother\n","28":"\n\nOrders to move off at 8 PM so have fallen in twice this morning fully loaded Marched out at 9 & entrained at Arcques about 4 Killos. Got Cocoa from the Comfort Fund & our own cooks gave us tea It was all in the dark on account of the Planes but there were none about. Left about 11 PM The truck was fairly full but I was fairly comfortable in a corner but got no sleep. Detrained at Hangist on the Somme at 11.30 AM & (Wed) got more cocoa, (also had cocoa at 6 this morning) marched a little way to a rest camp at Bourdon\n\nCame through Abbie Ville Fontain & Longfray on the trip. We are to move on per motor for the time presently. Left camp at 6 & marched about 5 or 6 miles when the Lorries caught us up. Believe we should have got them near the camp Some of our Officers were drunk which probably accounts for mismanagement. Came through Felixcourt & Doulins fair sized places. Had a rough cramped ride on the motors untill about 2 PM then marched & waited about for a while eventually climping 3 flights of stares to the garret of a very \n\nlarge building. Had a drink of tea & turned in about 3 PM\n","29":"\n\nFound this morning we were in a large hospital at Amiens Did not have to turn out untill after 10 so had a good sleep. Washed shaved & had a good meal. \n\nThere is a clock tower here where one can get an excelent view of the Town not a very large place & does not seem to have suffered from shell fire The only signs of war being plenty of planes going up & down & a some of the walls have been\n\nloop holed roughly. Had a good hot bath & change of underclothes. Went down town as far as we were allowed. It is a larger place than I thought. A lot of Prisoners have passed through to day. And if all the yarns are ½ true we are doing good work\n","30":"\n\nHad a good nights sleep in our garratt. Have fallen in twice this morning but only had our rifles inspected. Supposed to move at any time. Left at 5.30 pm both marched untill About 8.30 & billeted in a village Blanco or some such name.; It was about 7 miles far enough for \n\nmost of us. We are in an old house built around a square about 20 yards across with the usual rubbish heap almost filling it up We have plenty of rather dirty straw on the ground to sleep on. Had a good night\n","31":"\n\nMoved of at 11 & reached Villiers Bretinue at 1 about 5 miles. It was fairly hot & most of the way we were on a fairly crowded main road. It was very dusty & I was tired at one time but livened up towards the end. Our billet has\n\nbeen a very decent two storied terrace (2 houses) the top storey is useless we have cleaned up enough floor to sleep on. It is sad to see this place little more than a heap of ruins & the people have left nearly every thing behind. In this room there are a large photos in gilt frames unbroken The sewing machine is in the front room & all sorts of odds & ends broken & unbroken about. It is the same all through. Have not seen a house that has not been hit in several \n\nplaces. The country is more hillie than where we came from.\n","32":"\n\nSome bombs & shells were dropped about last night. None close to us Had dinner & moved of at 1.20. It was very hot & the road thick with dust & there was a good deal of traffic to stir it up. Flat uninteresting country. The fighting was here about 4 days ago Passed a few dead horses only noticed one dead man. The losses are said to have been light about here. Marched\n\nuntill 4.20 & were told to make our dugouts - in the side of the R-way cutting. Just got a start on them & were stopped as a better place had been found. It was evidently where our chaps dug in the first night of the advance Morrison & I got a bit of trench about 10 feet long & 1 foot wide cleaned it up & lengthened it a bit & covered it with iron Passed through 2 little villages today all battened up & a railway dump where the Hun has left a lot of stuff. Saw 3 of our planes down also a damaged tank.\n\nThis camp was near Arbinins & Rosiers.\n\nDid not feel the march so much to day. Left a flannel shirt & pr of sox behind to lighten the load.\n","33":"\n\nWere told to make our dug outs splinter proof & be ready to move off at 10 minutes notice. We found ours was much to narrow to be cumfy so have widened it at one end & can now sleep side by side. Did not get much sleep last night Our guns did a lot of firing & the hum of the planes was almost contineous. Jerry dropped plenty of bombs the closest about 500 yds away. Bits of dirt kept falling on us &\n\nthere were plenty of insects & crawling things about. We are in a very safe possision well away from anything he would want to hit. Moved out about 8 PM Battle Order & Picks & S walked about 5 miles waited about several times & walked back did nothing. Had a drink of tea & got to bed at 4 AM. When we reached \nour fur\n what turned out to be the end of our trip last night there was an old trench we were all getting into it when the shells started. May have been just chance or he may have seen us anyhow he put 15 to 20 shells very close to us, but\n\nnone in the trench so no harm was done. The nightly bombing is one of the worst features here at present. The dammage done is very slight to what it might be But the ground soldier is in the same position to the air man as the savage with a spear is to the man with a rifle\n","34":"\n\nGot orders to pack & be ready to move at 12 noon But did not go untill 4 which was well as the day was hot. Went back to Villiers Bretteneaux & got the same billit as before. Heard the usual nightly bombs drop mostely\n\nin the distance. Should have mentioned that on Sunday when were marching up \nto\n from Brettenux a Hun Plane got on to one of our Baloons & set it on fire. The 2 Observers jumped out & looked very quaint comeing slowly down in there white parachoots. The blazeing balloon seemed almost to touch them as it fell leaveing a great straight coloum of smoke\n","35":"\n\nMoved of at 9.30 & have camped in an open hill side near a small ruined town Hammill I believe it is or was. There is a fine big water hole here sort of swamp. We had a fine swim this afternoon\n\nHave been able to Post letters for the first time since we have been on the move (Near Corbie) \n","36":"\n\nSquared a shell hole out about 6” deep & made a cover with our Waterproof Caps last evening Got some dry straw & had a good bed for the night. As usual bombs were dropped Some machine bullets came fairly close to us An observasion Baloon was towed up the road this morning about 100 ft up. There were 5 motors & about 60 men in the turn out. The day was hot & as we had nothing to do spent most of the time lying in our humpie\n","37":"\n\nHad a very quiet night as there were some clouds about. Saw a horse taken past in a horse ambulance. Several Tanks passed this eavening. The first I have been close to while they were on the move. Odd looking affairs. There tracks are in all sort of odd places where we have been lately as they were used a lot in this advance. 4 more letters today (2 from Home \n","38":"\n\nA very quiet night. Quite cold this morning. Have given our packs in to be stored. It does not lighten my load very much as I find I need my blanket. Greatcoat & waterproof most nights to keep warm. Was put on making a bank around our horse\n\nlines to keep of shell splinters. Salvaged some Corageted Iron & made our dugout much warmer & more likely to keep out rain.\n","39":"\n\nHad a very quiet night. A little rain this morning. The dugout is very comfortable & warm. Some Indian troops passed yesterday they look well on horseback.\n","40":"\n\nDid a little Drill this morning. Swiming Carnival in afternoon. Too cold for me.\n","41":"\n\nDull in morning. At least we are supposed to drill. We do a few movements & then stand about for some time. The Sgts don’t want to do anything\n\n& we are the same. The Officers keep out the way \n\nWent to see a sham Inf attack covered with Tanks in afternoon. They can go practically any where. It is wonderfull how they stand the bump when they go into a trench & then there nose straight up in the air as they come out untill they overbalance again & go down on there proper level They can turn easily in there own length. Yesterday a chap near here was boiling his dixie & put a \nbo\n Stokes bomb on the side of the fire to rest the dixie on. Of course there was an explosion. The dixie is still missing\n\n Fortunately the man had gone away from the fire or he would be the same There are a fair number of accidents but not as many as one would expect considering the way men fool about with Bombs & rifles. We had a chap shot through the\n\nfoot the other day while batheing supposed to be done by some of them trying to shoot first. \n\nCopyed to here\n","42":"\n\nDid some practice with rifle grenades this morning. Went on Guard in evening. But the Battn moved towards the line so had to march a bit over 8 Killos & camped in a big valley near Merecourt still close to the Somme. Did a 3 hours stretch utill 4 as Gass guard.\n\nIt is a very noisy place lot of guns about & the echoes are wonderfull. The march last evening (got here about 9) was hot & dusty we walked more quickly than usual & had \nf\n only 2 spells of about 3 or 4 minutes each Had some home letters of May. The moon was so bright. I read by it for a time No Planes troubled us\n","43":"\n\nStill on guard. It is to be a 4 day\n\nstunt. One watch of 3 hours at night & one by day of 2½ Hrs. Some shelling this morning a few casualtys. Very hot day\n","44":"\n\nWatched from 12 to 3 this morning a beautifull night 2 tanks went along our Valey in the night they made a tremendous noise. A Hun Plane was over at the time but evidently could not see or hear them as he dropped his eggs some distance away harmlessly. This mornings stunt was quite successfull have seen about 1500 Prisoners go past. Two of our Co were out one had a good lot of casualities. Hear the Tanks were very successfull. 6 Hun Planes over this morning quite low. Used there M.G. a bit. One\n\nwas brought down. Another one came over in the evening twice & got away again. They don’t seem to get over much these days. A few shells on the road this morning\n","45":"\n\nYesterdays morning stunt was most successfull 2100 Prisoners counted up to \nt\n early in the evening Advanced 1½ miles on a 4 mile front. Some bombs droped about last night & a few shells on the road An Obsv Baloon came into our Valley this evening. It was lift up about 200 ft for the night & gave off a most pecular echo \nfrom\n when some of our guns fired. A fair lot of bombs dropped about last night none close\n","46":"\n\nThe Baloon moved on this morning. D Co had another rough night. A prisoner was given to us to look after yesterday. It is a funnie old turn out. Of course there is no where to keep prisoners. And the only Sentry posted by day is up the hill at Headquarters & the prisoner pokes about down here. He is a quiet little chap & I think would be hard to chase away. He had to sleep in our Dugout & it was rather overfilled but not uncumfortable I don’t mean a Hun Prisoner Returned in evening & went back to Co\n","47":"\n\nThere were no empty dugouts so scratched a hole for my self in the Hill.\n\nside. It came on to rain after dark so got into a dugout with 2 other chaps Just enough room. The Division was relieved today so we moved back about 12 oclock. Camped in a good place about ½ a mile from out old camp near Hamil. Corbie is not far off Our Officer let us get on some empty Lorries about ½ way This annoyed the Major & he made us stand to while the other Platoons got the pick of the places & stuff for dug outs. Morison & I went to our old camp & salvaged iron & timber & now have a very good little home with plenty of straw on the floor. It is very quiet back here away from the guns A little shooting at planes at night is all we hear\n","48":"\n\nOn fatague makeing a dugout for the cooks 3 Aussie letters\n","49":"\n\nAs we missed the bath yesterday went to day but alas the bath had taken unto its self wings Went on to a little village Sillay le Cic & salvaged a few ods & ends useful about the dugout. Saw a Frenchman & his wife gathering a few of there cherished belongings. But am afraid that after the usual bombardment & then the men camping in these villages there is nothing much left any good Six of us were told of to take the \nwash\n Cooker to the canall & wash it Much better if we had taken the cooks. There are a very dirty\n\nmob of Hoboes about our cook house. Showery all day. Pay day\n","50":"\n\nDull in morning Sports afternoon. Pat Buchanan & I walked over to Vaine S Corbie & made some purchases at the Canteen. Tined Peaches Chutney Chocolate Boveril Etc\n\nFriday ","51":"\n 30\n\nDrill forenoon Morison & I went for a walk in afternoon\n","52":"\n\nFilling up shell holes to make a paraid ground as we are going to have a Drill compition\n","53":"\n\nSeptember\n\nChurch Parade by the Padre we have acquired lately. A shower came on so he had to cut it short.\n","54":"\n\nDrill forenoon. Fatague buildin a cook house afternoon. Concert in evening Very good. By The Sentimental Blokes.\n","55":"\n\nBath Parade in morning Supposed to be hot but it was only supposition Clean clothes were good. Dug some Potatoes they were few & far between. It is a poor\n\ncrop & besides shell holes & troops diging in being run over with Tanks Etc a good many have been at them before I was. Got several meals & they are very usefull.\n","56":"\n\nMarched about a mile to see some infantry training. Don’t know just why. We have all done the same thing dozens of times. Also had a lecture on Advance Guards. Are supposed to train for the Sports in the afternoon some do a bit. More don’t Went to Corbie in the evening to see the Pictures. Could not \n\nget in so did not see them\n\nThursday \n4\n ","57":"\n\nWent to Corbie as escort. Had a swim in afternoon\n","58":"\n\nDrill in forenoon nothing in particular rest of the time. There are a lot of black & yellow wasps here they are very fond of jam & as soon as this tin is opened are in to it & on your bread. There seem to be more every day I have been very gentle with them but got to stings to day. Of course I jambed them by acident \n","59":"\n\nPayed. Had a \n\nrough sort of kit inspection. \n\nWarned in evening that we move at any time Orders tonight. Revalle 6 Breck 6-30 Fall in full marching order 8.30.\n","60":"\n\nFell in & messed about for a considerable time then moved up to the road & got on Motors. Started about 12 traveled through Merecourt Bray & a lot of other places demotored about 2 30 near Mt St Quintine about 2 K, N of Pevone. Were given an old trench to make our dugouts in Plenty of Hun timber on a railway Dump near by also Ruberoid so had no trouble\n\nVery dusty at the start but a few light showers made the traveling pleasant. One heavy shower in the evening nearly wet us through. A good many planes over at night. Can just hear the guns \nfrom\n again. Quite a cold night.\n","61":"\n\nImproved the home by raising the roof otherwise dug the floor deeper. 50 men transfeered to 2nd Brigade from each Co\n","62":"\n\nA showery day Walked around Mt St Quintin only a bit of a rise but slightly\n\nhigher than the other ridges about. It is very much battered.\n","63":"\n\nMoved of at 9.15 & marched through Perone & one or two other smaller places ariveing no where in particular at 12 only had 2 short spells. It was raining slightly most of the time rather an improvement than otherwise. Plenty of iron to be had \nat\n close where a \ndressing station\n Hospital had been burnt. Made quite a good \none\n home\n","64":"\n\nMoved of about 8 went about 3 miles\n\nthrough Tencourt to Rosiel Showers started just when we got here have not amounted to much. Once more we have made a home for our selves. Up among the guns again. He has been putting a good deal of stuff over. One or two small ones close to our cook house.\n\nWent out to work at 7. Had to go through a corner of the Village about 400 yds from camp & he caught us in a straff. There was a bank about 3 ft high on the road side so we made our selves small beside it One shell hit the road\n\nbehind me wounding 8 My mate Morison amongst them. His was slight I believe. We got behind our Platoon getting Picks from the Q.M. I hurried on & got in my right place again or might have got it too Went out to the front line without further trouble Had to wait there huddled in a wet muddie trench for about 3 hours it raining most of the time. Fortunately had my waterproof. Odd bullets were going over Then went out in no mans land for a good distance with a covering party of infintary. Dug\n\na trench. My piece was very hard. Then moved to another place to do more digging I believe. But \nsome\n 2 of the infantry who were on Patrol ran into a strong party of his & were luckie to get away. We stood by for some time. Fritsy was only about 50 yds away as he shot 2 or 3 flames right over to us He did not attack so we went home caught 3 small shells on the way. No harm done except a scratch on Flemings hand. Got in at daylight. Wet muddie & tired. Most of us had fallen down several \n\ntimes as it was very slippery in places. A few bullets flew about at times. It was a new experience for me & not a bad night except for sitting about in the wet. Felt quite safe in N.M. Land only that I did not know which way to get home.\n","65":"\n\nGot breckfast soon after getting back also rum. The meal & hot tea was the better of the two slept untill dinner time Went out at 8 & dug another strong Point in N.M. Land Did not seem to be\n\nvery far from Fritz but were behind the crest of a ridge so bullets kept high Got amongst a fair patch of small shells on the way but no damage done except that they had some gass in them & we all got a bit of it Harry Collier had to taken back with it Had to ware masks 2 or 3 times. A few shells near the job one about 19 yds from me before I had had time to dig a big enough hole to get into. Saw a great display of Searchlights after Taubis Counted 15 lights All centered on a Plane. The bright little Shrap bursts \n\n& tracer bullets made a great display. It looked as if the Plain came down but we were not sure. Got home about 3.30 dead tired A drink of tea was turned on \n","66":"\n\nGot orders to draw our Packs from Q.M. & be ready to move straight after dinner Came back to where we left 2 days ago. It is a good camp no guns about & only an odd shell comes back this way. It is more cumfie in the dug out tonight than falling over loose wire & dodging about wet trenches has been the last 2 nights. Have quite\n\na bruse on my cheek where I fell last night & hit it on the Pick handle There is a great lot of loose wire about all these battle fields Telephone & Barb.\n","67":"\n\nRoad repairing Three of our Baloons shot down A perfect day. Got more Chats on my shirt this evening than I have had all the time I have been here\n","68":"\n\nWorking on the road again. Saw one of our planes shot down 2 Taubers were seen to fall last night. Heard\n\na good many bombs drop last night none close\n","69":"\n\nPlanes over again no harm done. Saw one in the Secret light. A very rough little thunder storm early in the morning. Had to make a little dam inside our door way to stop the water running in. Going out with some Dummie Tanks tonight for a big attack in the morning. Left camp about 8 & loaded the Tanks on the light railway at Tenecourt. They are excellent imitation. Wooden frame covered with canvas. They run on 3 wheels. That was there weak point They had used small\n\niron ones off some agricultural implement about 18 inches high tyres 1½ in wide. We unloaded at Rosile & had a Mule to draw each Tank to the front line about 3 Kilos One Mule bolted & I believe broke his tank another lost a wheel & had to be left I was with No 1 & we got through allright There were 6 all told. Don’t know how the others got on. Pulled ours up past our outposts & came back to a bit of a trench to wait for our barrage. Rain started about 11 & we were in it untill morning. Just before the Barage came\n\ndown an Infantry chap came along & sayed we might as well come down to there Dugouts as it was safer. Just as we got there the barage started & seemed to allmost take the paint of our Tin Hats. The Dugout was about 20 ft deep & dry so we were dry & comfortable for the time. As there was too much smoke & fog to see any distance did not move the Tank again in fact doubt if we could have done so as the ground was soft & stickie. About 7 our Officer sent us home. The advance had gone well & only a few heavy shells were coming over & some prisoners comeing in\n\n"}}