{"Document Name":{"0":"Diary_0082","1":"Diary_0082","2":"Diary_0082","3":"Diary_0082","4":"Diary_0082","5":"Diary_0082","6":"Diary_0082","7":"Diary_0082","8":"Diary_0082","9":"Diary_0082","10":"Diary_0082","11":"Diary_0082","12":"Diary_0082","13":"Diary_0082","14":"Diary_0082","15":"Diary_0082","16":"Diary_0082","17":"Diary_0082","18":"Diary_0082","19":"Diary_0082","20":"Diary_0082","21":"Diary_0082","22":"Diary_0082","23":"Diary_0082","24":"Diary_0082","25":"Diary_0082","26":"Diary_0082","27":"Diary_0082","28":"Diary_0082","29":"Diary_0082","30":"Diary_0082","31":"Diary_0082","32":"Diary_0082","33":"Diary_0082","34":"Diary_0082","35":"Diary_0082","36":"Diary_0082","37":"Diary_0082","38":"Diary_0082","39":"Diary_0082","40":"Diary_0082","41":"Diary_0082","42":"Diary_0082","43":"Diary_0082","44":"Diary_0082","45":"Diary_0082","46":"Diary_0082","47":"Diary_0082","48":"Diary_0082","49":"Diary_0082","50":"Diary_0082","51":"Diary_0082","52":"Diary_0082","53":"Diary_0082","54":"Diary_0082","55":"Diary_0082","56":"Diary_0082","57":"Diary_0082","58":"Diary_0082","59":"Diary_0082","60":"Diary_0082","61":"Diary_0082","62":"Diary_0082","63":"Diary_0082","64":"Diary_0082","65":"Diary_0082","66":"Diary_0082","67":"Diary_0082","68":"Diary_0082","69":"Diary_0082","70":"Diary_0082","71":"Diary_0082","72":"Diary_0082","73":"Diary_0082","74":"Diary_0082","75":"Diary_0082","76":"Diary_0082","77":"Diary_0082","78":"Diary_0082","79":"Diary_0082","80":"Diary_0082","81":"Diary_0082","82":"Diary_0082","83":"Diary_0082","84":"Diary_0082","85":"Diary_0082","86":"Diary_0082","87":"Diary_0082","88":"Diary_0082","89":"Diary_0082","90":"Diary_0082","91":"Diary_0082","92":"Diary_0082","93":"Diary_0082","94":"Diary_0082","95":"Diary_0082","96":"Diary_0082","97":"Diary_0082","98":"Diary_0082","99":"Diary_0082","100":"Diary_0082","101":"Diary_0082","102":"Diary_0082","103":"Diary_0082","104":"Diary_0082","105":"Diary_0082","106":"Diary_0082","107":"Diary_0082","108":"Diary_0082","109":"Diary_0082","110":"Diary_0082","111":"Diary_0082","112":"Diary_0082","113":"Diary_0082","114":"Diary_0082","115":"Diary_0082","116":"Diary_0082","117":"Diary_0082","118":"Diary_0082","119":"Diary_0082","120":"Diary_0082","121":"Diary_0082","122":"Diary_0082","123":"Diary_0082","124":"Diary_0082","125":"Diary_0082","126":"Diary_0082","127":"Diary_0082","128":"Diary_0082","129":"Diary_0082","130":"Diary_0082","131":"Diary_0082","132":"Diary_0082","133":"Diary_0082","134":"Diary_0082","135":"Diary_0082","136":"Diary_0082","137":"Diary_0082","138":"Diary_0082","139":"Diary_0082","140":"Diary_0082","141":"Diary_0082","142":"Diary_0082","143":"Diary_0082","144":"Diary_0082","145":"Diary_0082","146":"Diary_0082","147":"Diary_0082","148":"Diary_0082","149":"Diary_0082","150":"Diary_0082","151":"Diary_0082","152":"Diary_0082","153":"Diary_0082","154":"Diary_0082","155":"Diary_0082","156":"Diary_0082","157":"Diary_0082","158":"Diary_0082","159":"Diary_0082","160":"Diary_0082","161":"Diary_0082","162":"Diary_0082","163":"Diary_0082","164":"Diary_0082","165":"Diary_0082","166":"Diary_0082","167":"Diary_0082","168":"Diary_0082","169":"Diary_0082","170":"Diary_0082","171":"Diary_0082","172":"Diary_0082","173":"Diary_0082","174":"Diary_0082","175":"Diary_0082"},"Date":{"0":"unknown","1":1352.0,"2":1355.0,"3":1356.0,"4":1357.0,"5":1361.0,"6":1363.0,"7":1364.0,"8":1366.0,"9":1367.0,"10":1368.0,"11":1369.0,"12":1370.0,"13":1371.0,"14":1373.0,"15":1376.0,"16":1379.0,"17":1383.0,"18":1384.0,"19":1385.0,"20":1386.0,"21":1389.0,"22":1390.0,"23":1391.0,"24":1396.0,"25":1397.0,"26":1398.0,"27":1399.0,"28":1400.0,"29":1424.0,"30":1429.0,"31":1431.0,"32":1432.0,"33":1433.0,"34":1434.0,"35":1460.0,"36":1491.0,"37":1495.0,"38":1496.0,"39":1497.0,"40":1498.0,"41":1499.0,"42":1500.0,"43":1501.0,"44":1502.0,"45":1503.0,"46":1505.0,"47":1508.0,"48":1509.0,"49":1510.0,"50":1511.0,"51":1512.0,"52":1513.0,"53":1514.0,"54":1516.0,"55":1517.0,"56":1519.0,"57":1520.0,"58":1521.0,"59":1523.0,"60":1524.0,"61":1525.0,"62":1526.0,"63":1527.0,"64":1528.0,"65":1533.0,"66":1534.0,"67":1535.0,"68":1536.0,"69":1537.0,"70":1538.0,"71":1539.0,"72":1540.0,"73":1541.0,"74":1542.0,"75":1543.0,"76":1546.0,"77":1550.0,"78":1551.0,"79":1552.0,"80":1553.0,"81":1554.0,"82":1555.0,"83":1556.0,"84":1557.0,"85":1558.0,"86":1559.0,"87":1560.0,"88":1563.0,"89":1564.0,"90":1565.0,"91":1566.0,"92":1567.0,"93":1569.0,"94":1572.0,"95":1573.0,"96":1575.0,"97":1577.0,"98":1578.0,"99":1579.0,"100":1580.0,"101":1583.0,"102":1584.0,"103":1585.0,"104":1586.0,"105":1587.0,"106":1588.0,"107":1589.0,"108":1590.0,"109":1591.0,"110":1592.0,"111":1593.0,"112":1594.0,"113":1595.0,"114":1596.0,"115":1597.0,"116":1600.0,"117":1603.0,"118":1604.0,"119":1605.0,"120":1606.0,"121":1608.0,"122":1609.0,"123":1610.0,"124":1612.0,"125":1621.0,"126":1623.0,"127":1627.0,"128":1628.0,"129":1629.0,"130":1630.0,"131":1633.0,"132":1635.0,"133":1636.0,"134":1637.0,"135":1638.0,"136":1642.0,"137":1646.0,"138":1647.0,"139":1648.0,"140":1651.0,"141":1652.0,"142":1655.0,"143":1659.0,"144":1660.0,"145":1665.0,"146":1667.0,"147":1668.0,"148":1674.0,"149":1675.0,"150":1677.0,"151":1684.0,"152":1686.0,"153":1687.0,"154":1689.0,"155":1690.0,"156":1691.0,"157":1692.0,"158":1695.0,"159":1698.0,"160":1700.0,"161":1701.0,"162":1704.0,"163":1705.0,"164":1706.0,"165":1709.0,"166":1710.0,"167":1711.0,"168":1712.0,"169":1713.0,"170":1714.0,"171":1718.0,"172":1724.0,"173":1725.0,"174":1726.0,"175":1727.0},"Entry":{"0":"\n\n","1":" Went to see \"Smiles\" very cheap sort of Revue @ \"Garrick\" pure leg show but rather funny\n\n21.8 Rather a busy day. Running about all the time fixing things up generally. Shall have to waste another day over my lost Pay Book balance\n","2":" Came over to Ireland last night visited Limerick today. Don’t like it or its people. Missed the Rathkeale train. Returned to \nLimerick\n Dublin in the evening very tired & found out that Limerick was quite close to Killarney & that I had let myself in for a lot of expence & trouble. There is a surprisingly good male Soprano singing here in the Soldiers home. Walking around Dublin today (Friday) with an old chap who called himself a guide. Got ripped oftener than ever I remember\n\nI forgot to mention that on Wednesday I visited the London Zoo & also \nthe\n Madame Tussaud’s\n","3":" 25th.8 I leave Dublin tonight chased out of it by Beggars, cheats, & other wasters. I never bought an article but I was swindled in short change or some other way. I never walked 100 yds without being Bailed up\" For the love of God\". I never stood still without being surrounded by Kids, looking for Halfpence. I could’nt buy a registered envelope in one Post Office & in\n\nanother (Limerick). They did’nt have scales to weigh letters. When asked the Postmistress said she guessed any letter was’nt overweight.\n\nI visited Dalkey, Kingstown etc. & afterward took a trip to the \"Hill of Howth\" the latter is rather pretty Something like the Knobby’s @ Newcastle. In the afternoon I went to the Gaiety & seen \"Maid of our Mountains\" in which Jessie Lonnen had a part. Went to Music Hall same night. These Irish girls have great vitality. One of the O’Hara Sisters was remarkable in this respect. They are very natural & on good terms with the audience.\n","4":" 26.8 Took in all day trip in a Brake around London. In the evening attended benediction at Westminster Cathedral.\n","5":"\n\n29.8 Owing to a heavy gale the mines in the Channel have come \"Adrift\". No leave Boats have crossed for the last two days.\n\nNos of registered packets sent\n\n21.8 probably Sth London 3047 Cards\n\n24.8 Parkgate St Dublin 78 Blarney Stones\n\n25.8 College Green Dublin 244 Lace\n\n25.8 Sth. Kensington London 21 Money Order 1.0.0\n\n30.8 Chancing another day here. Meant to visit Surbiton but there were too many Red Caps at Waterloo so I had to vamoose.\n","6":" I meant to take another day but when I got to Victoria I seen so many on the same game that I hopped in. We arrived @ Blanket Hill (Wireless) about 3.30P.M and have to leave tonight at 10P.M.\n","7":" Rejoined Battalion today Acques we are between St Omer & Aire.\n","8":"\n\nI walked to Aire yesterday & had a look around. Quite a lot of Hun planes Bombed St Omer & its vicinity including here (acques) last night. There was a Hell of a row generally between our \"Archies\" & the Bombs bursting. The planes were flying very low right over our billet. We could hear the squeal of the Archies shrapnel quite plainly. I believe one of the ladies (French) rushed out in the street in her \"nightie\" squealing out \"Beaucoup wind-up\". Bridge Building & Bath today \"Bo-Koo promenade\" about 20km.\n","9":" I believe the 6th Field Ambulance fell foul of the Portuguese last night & there are wild rumors of injuries received Knife wounds etc. The yarn runs that the 22nd Battalion then came up with Machine guns Bombs etc and cleared the Portuguese right out of their village. Anyway the Portuguese camp & village have been placed out of bounds. Bridge building again today. Arch. Fullgrave came back today. It is rumoured 5 Portuguese were killed in the trouble mentioned above.\n","10":" We were ordered last night to parade at Orderly room with full Kit @ 7.30A.M. & leave there for St Omer Railway Station arriving @ 10A.M. We are now waiting for the train. The train left at 1.0P.M We reached Poperinghe @ about 3.0 & Busseboom @ about 4.0. They have Chinese labour here & Fritz comes over every night with Bombs & Machines guns. Spent the evening in a Boozer listening to Tommies singing, incidentally drinking Beer. \n","11":" Fritz Planes over in Battalions\n\nlast night. There must be a nest of machine guns here. They seemed to be chattering away in Dozens. The planes came back again & again. Occasionally scraps of Shrapnel from the \"Archies\" fell upon the roof. Taking it all round it was rather difficult to sleep. Hell of a Bombardment in the line this morning. Three Tommies were burnt to death in one of the flare Huts after we left Meaulte. One got out (he died later) then the door jammed & the other two died trying to get out. Apparently that Shelling, Bombing, Etc was even worse than I imagined last night. It seems I was the only one that slept at all. N.B. (I drank some Beer) Drumfire yesterday morning & evening. Stunts probably. \n","12":" Visited Poperinghe last night it looks much the same as it did a year ago despite tales of shelling. A few whistled over while I was there had a gang of Chows today. They come from Tsing-Tao & are like children in their ways, frightfully stupid but seem good natured. They get one Franc per day. Young Stanford was frightfully annoyed with two who felt him in a rather questionable way. Our Battalion went into the line near here today.\n\n ","13":"\n Got a job as an Electrician in the \"Shops\" today. Had to put in two \"Lights\" right away.\n\n ","14":"\n After working all the morning I was put on a 7 to 12P.M. shift today. First night shift the petrol motor jibbed. Could not carry load so had to change on to Steam Engine. Had to cut out lights about every ½ hour owing to German Planes raiding. They looked very lovely in the glare of the Search-lights – Like great Silver Butterflies. About the Steam Engine: it has no governor and switching on or off a couple of\n\nlights will speed her up or slow her down with corresponding voltage variation. The driver has to regulate the Speed by hand (Throttle)\n","15":"\n Went to Poperinghe again yesterday. A Gas Shell lobbed within about 30 yds of me on the way back, another about 130 yds, They make a curious wailing noise in the air & a hiss after they land. Had some trouble with a short last night. The Dynamo threw the belt & the engine raced like Hell. Fixed it up OK. No Planes came over.\n","16":" Scotty McLaughlin was attacked by a Chow yesterday & knocked him out with one punch he did’nt come round for 15 minutes. I sent to Whiteleys for a E.E. Pocket Book a few days ago. I heard that some of C. Company 2.P. have been gassed. Have a slight touch of Rheumatism in the Knee. Fritz is shelling about here this afternoon\n\n17.9 Sunday Day off took a trip to Renninghelst & bought a ticket for picture show. While there a \nGotha\n plane with about 10 smaller ones passed overhead. Our \"Archies\" Kept vainly shelling them.\n","17":" Putting up poles for Lighting today with Chinese laborers it was rather exciting. The pole being sometimes in a dangerous possy & the pabs unable to understand what I wanted. It is rumored that our Boys had a very successful stunt today. Capturing all objectives. I have been told that a Colonel of the","18":" Jack Travers? called \"Jack the Bastard\" was the innocent cause of his Batman being shot, the latter receiving a bullet intended for his \"Boss\"\n","19":" Had an exciting time putting up lighting mains yesterday. I had previously put up the poles. A Taube brought down on of our observation Baloons yesterday evening. We had a good view from the Mill. Lights out about every 10 minutes last night. Taubes very busy. The Searchlights caught a few. Our Boys Knocked back by Fritz yesterday evening.\n\nSunday\n I seen some of our planes carrying lights last night. The Taubes came over as usual. Our Archies were occasionally using an inflammable shell that looked like a meteor flashing through the air. This must be done \nfor\n to enable a gunner to distinguish his own shells\n\nMonday\n Went to Oudenard. Found 3rd Battalion. Jack left them about a month ago with Trench fever. He is still in Hospital. On the way home I met Mrs Trazer’s Brother","20":" Batt. After that I had a look over the contour map of the English & German trenches on this Sector. The Troops are shown over this before going into the line & especially with reference to their own possy. The layout is about 80 sq yards. Everything is shown on it. It clearly shows that Fritz is abandoning the Trench System. All of his Pill Boxes & Blockhouses are shown, even woods, swamps, guns, etc. A chap told me that these block houses would stand up to 9.2s. He said they were made of a new sort of cement soft fibry stuff about 6’to8’ thick.\n\nOur artillery were wonderful\n\nin the recent offensive (still in progress) the newspaper accounts of the fighting are enough to make any Australian proud. The reports are written by British Correspondents too. I believe the Australians were going out for the Winter after this stunt, but it was such a success & the casualties were comparatively so light that they are coming in again. I’ve got a loan of a runners Bike & am learning to ride now.\n","21":" Poor old Cheeseman got killed a day or two ago. I don’t think I mentioned that Furnell G. & his brother & Major Hockley \nwere\n all died of wounds caused by the same shell. Baron Von P. Schott came back last night on his own initiative McLannan is doing 14 days at the base for taking a fall out of the M.P.s.\n\n27.9 The energetic Fritz favoured us again last night. He was very sociable & \ngenerous\n. Between shutting off the light for him and stopping to replace the belt on our refractory Dynamo the lights seemed to be more often off than on. It is an eerie sensation to look up into a cloudless sky on a moonlight night & hear the drone of one or more planes apparently quite close & yet be quite unable to see them. One of them caught in the glare of the searchlights immediately started dropping bombs. We could see the red streaks as they came down (probably incendiary bombs)\n\n29.9 Saturday\n\nFritz came over again last night. Our searchlights were going all the time. They caught one who got\n\nspitefull & showed it by sending a stream of machine Gun Bullets down the beam. We could see the red streaks of the tracer Bullets showing quite plainly. The night being cloudy the searchlights made a very pretty show, crossing each other & travelling slowly over the clouds.\n","22":" Day off. pay parade. More Planes over last night. There was’nt 10 minutes all through the night when there was’nt one or more planes over the Shed. \"Crump\"Crump\" of Bombs all the time. The night before last the","23":" lost about ½ dozen officers through Bombs. Fritz unconciously done us a good turn. We could’nt keep up Steam & were on the verge of closing down when he came over & gave us a good excuse for doing so. All the rest of the night we were cutting in for about 10 minutes & out for 30. One time they blew 6 times for me to cut out the lights but owing to the noise of the Engine I did’nt hear. Presently a breathless messenger arrived. The Archies put up some rotten shooting. They & the Machine guns did’nt stop all night. Went to Poperinghe this afternoon spent 26 Francs on Xmas presents. Was told that 200 Bombs landed there last night? I seen places where the houses had been blown clean across the street. Must have been very powerfull explosive used. There is also a rumor that the planes dropped leaflets warning the Civvies to get out as he intended to Bomb it off the face of the earth.\n\n31.9 There are a few New Zealanders about here. The","24":" Div relieved\n\nthe","25":" last night. The","26":" had a rather rough passage while they were in. There was a terrific bombardment this morning. The B.W.Indians are employed as ammunition carriers & similar work forward. I believe they suffer heavy casualties. One of the Chows here has a pet Sparrow which he carries about in a bag strapped to his belt. He catches flies etc. to feed it, it is not unusual to see him produce a match Box full of grubs. He allows it perfect freedom but it will not leave him. The bag in which he carries it has a wooden bottom to prevent the sparrow from being crushed. Maffesoni punched one or two of the Chows recently. They waited on him the day before yesterday & Maff had to retire lively. He dotted a few on the way. The Chows gave an exhibition of juggling in the compound this evening. They were walking on stilts. Spinning a rope with weights on each end, Also a bamboo rod. Their Orchestra (consisting of Drum & Cymbals only) Kept banging away all the time. Another game of theirs is throwing a bag about in the same way as we do a medicine Ball. When they misbehave they are spreadeagled on the barbed wire.\n\n1.10 The 1st Cyclist Batt. & Engineers are a good wicket for leave just now. The former have been having leave every 3 or 4 months & the latter had to discontinue it\n\nbecause men were going away after 7 & 8 months. An order has come out to Sandbag all the huts\n\n2.10 The fine weather has now broken up. Slight rain & wind howling a treat.\n\n7\/10 Sunday Fritz dropped a terrible lot of Bombs around here last night. There must have been at least one hundred that I heard. The old hut fairly shook. At intervals a shell came from one or other of the two Guns that bombard here. I can’t hear the heavy Shell coming. Only the explosion but I can hear the smaller (about 6\") one all the way also the report of the Gun. I got a pair of underpants & a shirt yesterday. After a row with the Q.M. & Lieut. Smith. Put sliding light in the Office yesterday. Raining & bitterly cold today. Sent 5 cards & a Handkerchief to Jersey Road. We put the clock back \n8.10 Monday\n one hour last night (Daylight Saving)\n\n8.10 Monday. A few shells lobbed rather close last night & one of a few others lobbed still closer today. I think the lining of the Gun must be becoming worn causing the shells to drop short. Previously they went over our heads I hope Fritz notices it soon. Weather fine & Windy. A couple more shells in the field alongside of us, Killed 5 head of cattle. 3 others hit the ration dump & the Hospital both about 200 yds away. Supposed to have killed 25. This is making it rather lively.\n\nFritz scored 3 direct hits on the Hospital. There was another poor Neddy killed by the one that landed alongside our place. Having a Hell of a time tonight. It is raining heavily & we had no water in the tank So I had to get some Chows to bring water in Buckets (For the Engine) I got two and they cleared out (P.O.d) so I had to get another & also take it on myself (A rotten Job) after a little while the first two came back. We had a row then all was plain sailing. It was no good scrambling through the lumber in the yard in the dark & rain I landed fair on my --- once which cheered up the Chows greatly. After this there was some trouble with the injector now everything seems OK again.\n\nTom Hack sprung a rough one on us today. He had been wounded in the head & had been labelled for \"Blighty\". The Hospital was close to the wharf & Tom strolled to the jetty to have a look at the Boat. Presently he heard his name called. It seems he had been marked \"Stretcher case\" So he had to go back to the Hospital \nand\n up two flights of stairs to get on a Stretcher & be carried on to the Boat. He wanted to walk on when he was on the jetty but they hauled him back. As soon as the Stretcher Bearers had left him he came on deck again to watch the Steamer moving out. The chinese when visiting orderly room Have to fall on their Knees when addressing the Officer. They cry like children\n\nsometimes while in this possy which looks rather ludicrous\n\n13-10 Saturday\n\nWhile the","27":" Divvy was in this time \nthe 32nd\n a patrol of the 32nd came on some of the 5th Pioneers wiring in No Mans land and attacked them. The Pioneers sustained 8 casualties before the error was discovered.\n\n16.10 Tuesday In spite of a dark night Fritz came over in force last night. One plane would monopolize the searchlights & Artillery while the other or others dropped bombs. We had to extinguish lights about every 10 minutes. I was caught twice trying to spread Syrup on Bread & had to finish in the dark (fearfull mess) I seen a couple of Chows playing cards. The cards were about 2½\" x ½\" Inch with heads Fishes & something like grains of corn on them. The chows used to pick them up by moistening their forefinger & dabbing their finger on them. The card used to stick\n\n18.10 Thursday. There was a remarkable reflection in the sky last night like a big Town on fire. It remained for a considerable time. Not like the general transient glow of the Flares. We brought down two Planes yesterday close handy one with Archies & one \nwith\n by another plane. There were some comfort Socks at Hdqtrs","28":" Anzac Corp) a couple of weeks back & two officers took 15 pairs between them one 9 the other 6. We got some of the remainder tonight 2 pairs among 14 Men. We also got Lollies peaches\n\ntin to 4. Bottle of sauce to 6. 2 loaves to 5.\n\nI changed over the connections of the Dynamo today. It was a great success.\n\n20.10 Paddy Shortall completed 927 days service today. A Bomb dropped very close this morning. Fritz also supplied a very unnecessary encore. The old Engine was pulled out tonight. Not a bit too soon either. A Petrol Engine is being substituted. We got a Rum issue tonight & everybody is telling brilliant stories at once\n\n22nd.10 Monday Fritz bombed the Light (Anzac) Railway last night causing 12 Deaths & 26 Wounded Our Engine room is 200 yds away and it fairly shook with the force of the explosions I thought the bombs fell within 20 yds of us. The scene of the explosions looks horrible, there are blood brains & human debris everywhere to say nothing of shattered huts, stretchers etc. The shrapnel kept very low. We got the Japy Freres Petrol Engine on to the Dynamo last night I had to look after both for a couple of hours. Had one stop due to defective plug. This Petrol motor won’t do at all. It is a single Cylinder & one Kick in every two Revs is no good to a Dynamo. Received a rather generous rum issue tonight with the usual result \"I don’t care if its Snowing or Blowing\" There’s very little doubt that it is\n\nthe only thing that enables a fellow to carry on. Maffesoni Jun. nearly cut his arm off on the Docking Saw tonight. Finish war for him. He was going to have a finish fight with one of the others in a few days time – man proposes ---\n\n23.10 Wed\n\nRaining again. wet & miserable Had the petrol Engine & Dynamo on my own last night but had a good passage. Got the Petrol Engine (Japy Freres) on my own again. The little bugger settled her Governor so I had to control by short circuiting the Spark & manipulating the inlet valve Finally Bert fixed up the Governor after 20 Mins delay & she is now running O.K. The little bitch bushed her Governor again within 20 Mins & I had to put in the rest of the shift as a human Governor controlling her by short circuiting the magneto or operating the inlet valve\n\n25.10 Friday Oh that darling? \n Japy Engine. She ran like an angel last night, but tonight the little love is peevish. They dismantled the Governor to fit plates on it but one of them is a wee bit too long & Japy is making the most of this excuse to cause trouble.\n\n26.10 Saturday\n\nWent to Poperinghe today & bought a match Box cover & Compass. I will need the latter to determine the polarity of the New? Dynamo that they found in the Pill Box\n","29":" Received a letter from Uncle Jack & answered it.\n\n31.10. Fritz Bombed like Blue Blazes last night. It was Bright Moonlight in the early hours, & one could hear the humming of his propellers all the time, also the \"Crump\"Crump\" of the Bombs all the time.\n","30":" Changed over the Shop wiring yesterday O.K. New generator (Salvage) installed Now awaiting prime mover & capacity test.\n","31":" Went to Poperinghe yesterday & was overhauled by the M.P.s. They thought they had a sure catch. The New Dynamo came a \"gutser\". It is now adrift. We are going to cut out the Interpole field & connect the shunt field coils in parallel & then run her as a plain Shunt Dynamo. The field coils are now getting an extra bake. Met a Tramway man today. I believe Jim Wilks was his name. He has been away 3 years. Came to France in","32":" He told me Price is Q.M. of the","33":" field ambulance.\n","34":" Letter from Clare. Very definite rumor that we move from here to Armentierres front very soon (10 days). Drank full rum issue tonight – usual result - Dopey as a fowl.\n\n8.11 Just seen one of our planes bring a Fritz down.\n\n9.11. Friday The \"Baron\" (Schott) has officially vanished & the official mind is much exercised over him. He has\n\n had several Breakdowns & overhauls with his Tractor. So that nobody (officially) knows where he or his Tractor (241) is. The","35":" Field Co Engineers lost trace of him & forgot him when he came back with his disabled Tractor. The Anzac Railway Co. Traced him & his Tractor to Busseboom Siding & there is no record of him leaving there. Busseboom Dump officials know that he went to the","36":" Field Co. & no more. They are all looking for him. Meanwhile he lives & eats in our hut & carts Ballast for Cpl. Welsh now & again. The three different units are trying to thrash the matter out & seem to be coming to the opinion that there never was any Baron or 241. \n","37":"\n\n241 came another \"Gutser\" yesterday (Broke down again) . Heavy Bombardment this morning 5.0 A.M. Still going strong. Only get about 9 hours daylight now. We will move very shortly. Most have already gone. Only day shift on now. Electricians excepted.\n\n13.11 Tuesday Some new Zealanders have arrived (60). Another batch of our fellows left this morning for Bailleul I believe.\n\n15.11 10 Chows got blotted out by a couple of shells last night I believe a few came over but I only heard two. The 145th Co. R.E.are taking charge of dump. Quite a lot (80 about) of New Zeas. have arrived. \n\n16.11 Friday When I came on shift this morning 4.30A.M. I found about a dozen Chows sleeping & sitting about in the Engine room. The\n\npoor devils are afraid to sleep in their own camp since the shells lobbed there.\n\n19.11 Monday letters to W. Sheridan & Young Jack today. Arrived @ Steenwerck noticed that most of the windows are protected by tape against the effect of Bombs & Gunfire. They have a lot of Belgian or French women making Duckboards here. They are sent home by motor. Their Workshop is out of bounds. Still glad Eyes are not impossible. The Beer here is not bad ½ Franc per pint Stout 6d per pint\n\nWednesday 21-11 Letter to Clare\n\nSat 24.11 Met Alec. McFarlane & Graham today. Feel very sick\n\nSun 25\/11 I went to Steenwerck & Meningate Camp today. Met Sullivan (17) on the road. he is in A Company. Joined up only lately. I also met Mickey Deluce Reg. Niddrie, Moriarty, Ephraim I seen some German bullets made of Steel with copper coating the other day. They are used against the Tanks & penetrate them I believe.\n\nFriday The Dynamo gave 20 Amp @ 120v with one of the shunt fields included in the main circuit.\n\nSat. Connected the Dynamo with the Shunt fields in parallel but Interpole \n\n there was nothing doing at all.\n\nPrevious connection 20 amps @ 120 V. Interpole field\n","38":"\n\nFound that the pair of shunt coils that were carrying the main current broke down. Ran the Dynamo with only two Brushes and two Shunt fields also interpole field. She generated 14 Amps 120V reduced load to 6 Amps (only ½ a Dynamo you know) She ran on that absolutely steady neither voltage or amps varying a fraction for 2½ hours. Then the volts dropped to 70. \nExam\n Examination showed that one of the remaining shunt coils had broken down. Net result of about a months work. A converted Napier motor with low tension sparking gear & improvised water circulation also one Dynamo with 3 shunt coils broken down. \n\nI received 13 letters last Thursday. Mollie advised me of receipt of Diary & Collarette.\n\nAbout Tuesday\n \n\nSeen some of the 20th today. They told me that J.Slamond was doing time. A hard frost the night before last & last night. Planes over each night. McFarlane & Graham left here yesterday probably for Hasebrouck. I am now in Bailleul writing this in a Restaurant. The German Dynamo is now running with only 2 adjacent field poles in action the little Dynamo is running with separate drive trying to charge the Battery. I have had a Septic Finger for the last week & kept going about 15 Hrs per day just the same.\n\nWednesday 5\/12. Last night the Napier seized & had to be taken adrift putting the German Dynamo out of action. We then used the little Dynamo to take the load in parallel with the Battery. We had a 4 Horse (approx) Belgian Petrol engine driving the Dynamo. The Petrol Engine broke the belt once. Also two \nother\n springs at different times necessitating hand control during repair & to put the lid on it the Belt knocked the Bearing lead into the Dynamo when it broke & about one hour after we started again the Bearing lid came down on top of the armature & done a Devils dance on its own to the accompaniment of much sparking between the two top pole pieces. I noticed the biggest shell hole I have ever seen alongside the Armentierres road yesterday alongside of it was a Bomb hole a souvenir from last Monday’s aeroplane visit. By the way any Australian or English Soldiers found in Armentierres without a pass will be tried by F.C.M. Fritz is sending some very heavy stuff \ninto\n over this morning into Armentierres I believe. Heavy frost this morning & we have not had any winter issue of clothing yet. \n\nThursday Two breakdowns last night had to break little Dynamo out. Bolt it to the floor with coach Screws & run it off a 12\" pulley with a 2\" belt. After about 2 hours it started grinding on the pole pieces so we had to shut it down. Put in till 1 AM changing poles of German Dynamo. While starting up the Petrol Engine\n\n(Napier) The bandage on my hand got saturated by Petrol which caught fire while I was looking for Lamps. My hand was burnt somewhat before I could extinguish the flames & worst of all the burns were superposed on the Septic finger. As a matter of fact I could’nt extinguish the flames but had to tear the Wadding Etc off including much skin. Result sick parade again.\n\nFriday 7.12 The exhaust of our Napier ends in a Bath house. Two Tommies were in there on Tuesday having a bath & were later carried out unconscious having been overcome by the Gasses from the exhaust. Last night I was very sick & Giddy vomiting Etc & had to leave the engine room owing to the same cause. We developed a surprising load about 4.45 & blew about 5 or 6 Fuses untill I fused the circuits up to a point which nearly forbade Blowing altogether. I put the fuses in on the line circuit & 3 of them blew in my hands as soon as I made contact.\n","39":" Small Generator fitted with new fuses at Hasebrouck. Installed again 6.30P.M. Engine ran hot at about 9.00. Shut down. In the meantime we were working on the German Dynamo. All field coils repaired & replaced. No volts opened each side of shunt field in burn . Generated O.K. (Series field disconnected) changed over one side of field. About 2000 Volts \n\nblew Pilot lamp to blazes. Could’nt run Engine slow enough. Connected shunt field in series plenty volts at low speed., but lost field & volts when load was put on, Field too high. Connected one half of Shunt field across Armature put interpole in series. Generated 120V & carried load at low speed left her at that. In addition to this I had to reconnect the small Dynamo to the board in the earlier part of the night & later reconnect to the German. Also \nchan\n changed over sundry instrument connections. Fritz sent over sundry heavy shrapnel yesterday bursting high in the air. Don’t know what his object was unless an observation Baloon, but that was fully ½ a mile away\n\nOne day through the week he sent over about 8 Baloons for some purpose dropping papers & placards our planes reconnoitred them but didnt interfere in any other way.\n","40":" Fritz dropped some bombs just up on the road yesterday. I sent a letter to Mollie. Seen Anzac Coves in the evening, they put on a splendid programme.\n","41":" 13.12 Fritz Bombarding Hasebrouck today. My burnt hand nearly well. Fritz dropped placards from the Baloons he sent over stating that he intended to blow up Steenwerck & the Station after Xmas day. Civvies to take warning\n","42":" 15.12 One of the French boys here has a sister in Lille. He told me that the Germans allow every women 1 Franc & every man & boy\n\n½ a Franc per day to support themselves. The french people are allowed to buy bread at the American Canteen price ½ Franc for 3 Lb. An American Gaurd is posted to prevent Germans from entering. Butter costs 15 Francs per Lb. Men and boys are \nallowed to\n asked to work at making trenches @ 3½ Francs per day (behind the lines of course). This boy also told me that there is a 21 Feet Wall all around Lille. The Germans are sending \nback\n over to us some of the Women also men under 14 and over 50 in order to save the expence of keeping them. It is stated that Two Australians Killed a French lad at Nieppe the day before yesterday. \n","43":" Sent a letter to \nMollie\n Ciss & another to young Alf. the day before yesterday. Fritz has been sending some very heavy stuff about lately but not near us. Rudrum returned from leave today. The Power Station ? changed its address yesterday (another change of wiring). First snowfall yesterday. Bitterly cold last night the oil froze like a jelly in the sight feed reservoir & there was a thick coat of ice on the Carburretor. I got a nearly new Tunic. a leather vest & a Balaclave Helmet at the Casualty Clearing Station today. I must have another look in for a Hat & Puttees.\n\nSaturday 22nd Very Sever frost yesterday & today, I noticed some very pretty effects one of the prettiest being some wire netting. It was converted\n\ninto beautifull lace. The hedges also looked very lovely. We have great difficulty over the water circulation of the Engines. The pipes & taps get frozen solid. I short circuited \nton of\n a coil in the little Dynamo today to see if I could reduce the sparking. We have had two or more stoppages every night in the new place mostly Engine troubles\n\nSunday 23.12 Fritz sent 4 large shells over the Dump \nthe\n yesterday afternoon. I don’t know whether he wanted the Dump or the Railway line. The last one landed almost on the line. \nmy\n The little Engine seized yesterday morning while my mate (Charles) was on shift. The little Dynamo is now being driven off the shafting in the mill. Welsh informed me that I would have to go to the \"Anzac Coves\" for a fortnight with the Souvenir Outfit.\n\nXmas day Sent away a lot of Whizzbangs as Xmas cards. @ 11P.M. last night I was\n\nhaving a bath with two buckets of water (Hot) which I coaxed from the Engine Driver. It was a rather cold experience. All the while the thought was running in my mind \"I wonder where I will be next Xmas Eve?\" It is very cold, windy & wet today\n\n \nDinner\n Rabbit stew & a small portion of Pudding.\n\nBoxing Day Working on the souvenir outfit which has been lent to the \"Anzac Coves\" for their Pantomime \"Dick Whittington. I had Rum; wine & Beer also poultry for\n\nDinner. First time for about 2 years.\n\n27\/12 We had a heavy snowfall on Xmas day & the place has been snow-covered ever since.\n\n31.12 Norm Hirst left us for Hospital with Chicken Pox the day before yesterday. He has been away a lot lately. He went on leave (14 Days) returned a few days later obtained special leave (his brother being dangerously wounded) 20 Days & next two days after his return he goes into Hospital with Chicken Pox. Snow still about. The 27th or 28th was the coldest day we have had this Winter.\n\n1.1.18 5 to a loaf today. Seen a wonderfull performance by the \"Anzac Coves tonight \"Dick Whittington\" The lighting effects were provided by our Souvenir outfit. All the performers have awfull colds caused by wearing stage costumes in a Barn? in mid Winter.\n\nThursday 3.1.18 Beautifull day today Fritz shelling our Observation Baloon with very heavy shrapnel from long range. Had to go on night Shift last night in \nthe\n place of Jack Shercliffe He & King were very badly burned while running the Souvenir outfit for the \"Anzac Coves\" The outfit caught fire Jack Shercliffe rescued the Petrol Tank but threw it down alongside the incoming Troupes plant with the result that the latter has been damaged. Our\n\nOutfit \"(The Souvenir)\" is practically undamaged. My engine jibbed twice yesterday @ 5PM when I was going off & 12 Midnight when I came on. \n\nFriday 4.1.18 Unexpectedly caught another night shift last night. Jack Shercliffe had to go to hospital so I fell in for his shift again. Had trouble all the way but managed to carry on for about 4 Hours with a couple of Breaks of less than 5 minutes each. I then threw my marble in after starting her up about 3 times in vain. I got some lovely backfires that Knocked me Kicking & didnt improve my temper either\n\nSat 5.1.18 15 letters today Had to put some lights in the MDlle shop yesterday. Was much pestered by the Ladies? who would persist in stealing my Tools & concealing them in their underclothing. I would accuse them but they avowed their innocence saying \"You can search me\" (a nice job, one lone man among about 40 of them) at the finish I took them at their word & there was very little further trouble.\n\nLittle Dynamo moved again last night. Bolted to the Mill Floor and driven off the Shafting of the Steam Engine. The Gaurd rushed into the Dynamo Room last night to tell me the Taubes were overhead. We had a breakdown just previously & the Dynamo was being driven by a belt from another Oil Engine the Belt came right across the Doorway & the Gaurd ran bang into it. There was a frightfull tangle\n\nThe Belt being broken in two places The Gaurd in about 22 judging by his language. He meant to tell me to switch off the lights, but he done that himself so effectually that we had rather a bad time getting under way again.\n\nSunday 6.1.18 Jack’s Brigade is in the line so I missed them today they were about Kemmel. I next went to La Rossignol to the 17th Will Niddrie has joined them He looks very well. I got a parcel from Mollie today. Lieut Chappie has gone back (17th) He was I believe rather nervous going into the line. I nearly forgot. The little Dynamo Switch room & all the wiring has to be removed back to where we were when we first arrived No wonder we don’t win the war\n\nMonday 7.1.18 Went to Hasebrouck today (unofficially) I travelled each way by train I was able to do this by falling in with the men going on leave & as nobody asked for passes or tickets I got through alright. I got punished for my sins coming back. I was from 2.30 to 6.10 travelling from Hasebrouck to Steenwerck Station I seen some of the effects of Fritz’s shells. I did not see Dave. He is with the 3rd Tunnelling Coy near Messines. A lot of troops in the Train were returning from Paris leave. All of them remarked on the fact that Paris was Brilliantly illuminated at night & carried on generally as if there was no war on. They also\n\ncommented on the lack of Chivalry shown by the men. The French girls said they had no time for their own men folk & seemed to take any others for preference.\n","44":" Rudrun goes to hospital today.\n\n8.1.18 Received a cake today from Mollie. It was slightly mouldy.\n","45":" Received a wallet from the Y.M.C.A. Nice Souvenir. A Froggie is now driving the Dynamo. Out here they have a curious custom of engaging a man & his Engine just like we engage a man & his cart. Young Woolnough went sick yesterday.\n","46":" Woolnough started again today. for the last 3 days, I have had the shop wiring (& camps 10 circuits) on a different Board every night & have had to explain the different circuits, Switches etc to my Froggie shift mate. In the same time I have cut in the Series field of the Dynamo (it had been running as a plain shunt machine previously). Every time Froggie came on Shift there was a new board & at least once a differently connected Dynamo. At the same time we were having trouble with the Japy (Froggies own machine). Between My Bad French – Froggies rotten English & the constant changes in the Wiring, Froggie was generally running in circles when I left. Froggie himself thought tonight was the limit, so he told the Corporal (Welsh) a little story\n\nHe said, Mademoiselle was very sick. The Doctor came & Mademoiselle was getting better. Another Doctor came & next day still another was called in. Very soon Mademoiselle Died.\n","47":" Letter to Mollie last night. Shall have to fill my Fountain pen again. Some awfull big ones were coming over yesterday. Our artillery woke up in the afternoon & passed some of the Ironware back. Robinson got special leave \nyesterd\n today. We had a thaw about 2 weeks ago & it has been rather slushy since. No Snow. Plenty of wind.\n","48":" Hard up for amusement. Watching manouvres of a spider. Shortly after I lit a candle he came cautiously down a board & halted just level with the top of the flame of the candle evidently enjoying the warmth. Just then a slight draught swung the flame nearly on to him. He flew for his life. \nAfter\n about 5 minutes \ninterval\n later he returned stopped at the same spot & was \ntaken\n nearly caught by the flame again. He hopped for his life. After another interval he returned once more. He had evidently been turning the matter over & profited by his former experiences because \nthis\n time he took up a position level with the top of the \ncandle\n & enjoyed its warmth in security. And some people believe spiders don’t think. \n\nFritzys Baloons were up yesterday Having a look to see how things\n\nwere. One of ours broke away a few days ago. The two \noccupan\n occupants had to come down in parachutes. Our Anti Aircraft Guns tried to destroy the Baloon without success. It went up to a great height & disappeared. Fine day","49":" today Fritzys Planes are above observing. Our Archies vainly shelling them as usual. As one chap remarked \"We might as well throw stones at them\"\n","50":" While fitting some lamps in an Officers hut today I heard them discussing Lieut \nA\n . It seems that while the at the on one. The gripped his hand and the he then had some went must and . He tried an on one. The gripped his hand and the Auto him & the remainder with his service . The Cpl in chge previously refused to do this.\n","51":" The Tommy R.E.s attached to this place are getting their Blighty leave after an interval of 10 weeks. This hurts us, our leave was stopped about 6 weeks ago & has not started again since. There is a Motor Lorrie with its crew of two up the Road. It has been there 3 weeks, the two Drivers are having a good Holiday. They were sent to a Battery. The Battery disowned them. They then skirmished around but no one else Knew anything about them. Their original crowd would’nt receive them back so they are now having a glorious Holiday & hoping to God that nobody\n\never will own them. Are we winning? Seen 16 of the","52":" going on leave today. The","53":" Division is pulling out tomorrow they are going to Boulogne. Some of our Battalion moved to Merris yesterday a few still remain about here but they too will move soon.\n","54":" Beautifull weather today & yesterday. As evidence of what a quiet sector this is a chap said that the Germans used to put their Blankets out in the Sun in No mans land & go over the top & collect them without being molested by our fellows. The occupants of this hut are awfully sick of the War & rapidly becoming rank Anarchists. I wonder should I have said rank & file anarchists. One of the principal reasons for this state of affairs is that our bill of fare for the midday meal has been stew stew stew stew stew \"ad lib\" & after that more stew.\n\nMore news of Slamond. I believe he is now at Rouen. He was being brought back from Pop under escort about 6 weeks back but he got away I heard that the Corporal was disrated. He was recaptured & is now a prisoner.\n","55":" Keen frost today. Wrote to Mollie\n","56":" Went to see the Dons last night. Fair show \"Chu Chin Chow\" Burlesque. Nice looking girl? among them with a nice Baritone voice. Another nice girl ? danced a \"pas Seul\" (Skirt) with dimmed lights but\n\nunfortunately stepped right into the footlights which upset her? both literally and figuratively the lights were brightened so that she would not come another \"Gutser\" & we then discovered that \nthe\n her tights were only plain woollen underpants. That was the reason why the lights were dimmed. I met Harry Grose today He is with the 3rd Field Coy Engineers. He told me that W. Norfolk is Adjutant Lieutenant of the E&M. Company.\n","57":" Walked about 20 KM. today looking for Jack McMahon & then found that he had gone away about a month or 6 weeks ago with a Broken ankle. He was going up to the line \nindecipherable\n when he slipped on the ice & broke his ankle as stated. He made a nasty job for the Bearers who took him back. The N.C.O. & others fixed things up for him O.K. He is probably in \"Blighty\" now. I won’t go looking for anyone in a hurry again. My feet are so bad that I will only just be able to hobble about tomorrow. \n","58":"\n The Taubes were over 5 times last night but they were not after our place fortunately. They were so close overhead that the noise of their motors awakened me before the \"Archies\" & machine Guns opened up. Feel very sore today. Letter to Clare. Last Friday night I had a sort of Heart Attack that nearly finished me off. I really thought my Heart had burst. Have had a dull ache there ever since. I\n\nmade up my mind to attend sick parade yesterday, in fact I was walking over to get a form but thought better of it & turned back. In the afternoon Graham came to see me & nearly persuaded me to transfer into the E&M. but I thought better or worse of it later. \n","59":" Beautifull weather the last two days. The winter has quite gone. I forgot to mention that Graham is at Hyde Park Corner. His plant lights the Catacombs, Hill 63 load 18 Amps. Staff 12 men. Are we winning\n\nHad a hellova walk today. Started to go to Hyde Park Corner. Missed my way as usual. Went through Neuve Eglise – It does’nt matter- Anyway I found the place. While there Graham showed me through the Catacombs. H63. He said they could hold 30000. They were worth looking at anyhow. Came back through Romarin & made the acquaintance of a Postman named Renee who lives near the church at La Creche. We had several drinks & he invited me to his home. Its surprising how Fritz lest Romarin alone considering its possy & the No of people living there.\n","60":" Wet & windy. The Japey had a fit of the Sulks last Thursday evening & refused to start, the subsequent proceedings were rather amusing. Not being on shift I took post as an \nobser\n Observer. Froggy as usual got very excited and sweated a treat. He walked around her climbed over her & crawled under her absorbing\n\nTons of oil Grease etc. in the process. Next some spectators started to arrive & Froggy went all to pieces. He paced wildly about stopping at intervals to give the Flywheel a few revs but there was nothing doing. A few Fitters, some Sawyers & an engine driver or two then done some stunts in fact the place was simply full of Motor experts. There were Fitters? North, South, East, West and also above & below the Engine. There was \nnot\n none inside, but I think that was an oversight. Everyone of them was simply bursting with advice. In the meantime Froggy (who ","61":"\nknow a little about motors) was careering wildly around the Outer quite unable to penetrate the Barrage of Experts, He had just completed his 145th lap & was very nearly crying when they understood what he wanted. His prayer was – For the love of the Good God, go outside & leave me alone & I will fix her up in 10 minutes. They didn’t believe him but went out & started putting a pulley on the main shaft intending to drive off that. Froggy took the Magneto off, wiped about a pint of oil off it cleaned it with a little Benzine & after putting it back gave the Flywheel another 10000 Revs. She \nStarted\n I think She knew that the Pulley was fixed on the main shaft & was frightened of losing her job, because now just note. When they saw that she (The Japey) was running again they took the Pulley off the Shaft\n\nagain. \nWithin 5 minutes Mademoiselle Japey developed a hot Bearing & had to be shut down again.\n Then there \nwas\n some language. Superlative Australese. Everyone racing for Candles at once. Froggy then approached Miss Japey with tears in his eyes (Dinkum) & smoodged to her fed her with some nice oil tittivated her up and she started up like a little love & has been going Kindly ever since. Its no use telling me that that Japey don’t understand. She’s got ","62":"\n bluffed. When she starts playing up with me I go outside the Dynamo room & Swear where she can’t hear me. \n","63":" Both our heads & the German heads are very windy just now. We have simply miles of wire everywhere & are putting up more. Machine Guns are being put in as Gun Escorts. The Artillery are worrying a great deal over the fact that banks of barbed wire are being put in behind them. They reckon they’ll never be able to get out before a rapid advance. Fritz is raiding all along the Front seeking prisoners & information. Spring is nearly here & both sides are feeling the suspense.\n","64":" 14.2 With reference to tucker. Practically every Pill box our fellows captured at Ypres last time was full of Tucker.\n\nWonderfully quiet here. We\n\nhave scarcely heard a gun for the last few days. No aeroplanes bothering us absolutely nothing doing.\n\nThere is a report about that all men who have transferred at any time from the Infantry have to rejoin their Battalions General Birdwood inspected the Mill today. He was the only Officer of his crowd wearing a slouch hat.\n","65":" Up in the line they have started the war again. We heard a couple of small barrages yesterday. A hard frost last night. Biting cold today. Letters from Mac & Henry yesterday. We received some H.V. 6\" shells from Fritz two of them nearly hit the W.C. I hope he does not repeat the Dose. One lobbed near De Seul & killed 3 & wounded 5 Tommies who were pulling down a captive Baloon. \n\nLetters from Mac today. Card from Laura & letter from Clare.\n\nFritzys plane coming over in Platoons tonight ever since it has been dark (one can hardly call it dark being moonlight) they have been droning away up above (no Bon fur Soldat) Someone must be going to get merry Hell.\n\n ","66":"\n ","67":" Those aeroplanes fairly put the wind up our acting O.C. . He even went so far as to cancell the night shift & shut down the Dynamo and was roaming around all night like an uneasy ghost, looking for stray gleams of light & roaring up\n\nthe parties responsible. It is a lovely night tonight so I suppose we’ll have another anxious time.\n","68":"\n","69":"\n\n Sure enough we shut down the lights Fritzys planes seemed to be holding a meeting up above. I took over at midnight & we ran afterward without interruption. I must revise the above. The shunt field of the Dynamo became disconnected & gave an extremely irate electrician (me) a chance to display his proficiency in Australese I went to see some Belgians last night. I thought it was a good chance to learn French, by their questions I think that they thought it was a good chance to obtain some knowledge of the movements of Australian Troops. Needless to relate all of the information they obtained could be put in your eye without causing inconvenience. I must steer clear of that place in future. The church here (La Creche) was practically demolished by a single shell.\n","70":" A miserable night tonight wet, rainy & cold. Still the troops are cheerful, Why? There has been a rum issue & the weather is too bad for bombing. What more do we want. Australia? Yes. But sufficient for the day is the evil thereof. The\n\nfrost seems to have broken up.\n\n21\/2 Beautifull day. No frost. Promise of Spring everywhere. Fritz shelling observation Baloon. Seen G. Firman this afternoon. He is a Sergt. in the 1st Divisional Train (Transport). They got a number of decorations for good work at Zonnebeke. One W.O. had a Military Cross. Firman told me that McGrath (M.P. for Ballarat) used to be a W.O. in their Unit. He was an out and out \"Bolshevik\" George says & used to preach Sedition a treat. He went to \"Blighty\" as Scrutineer in connection with Conscription Referendum. He was in the Post Office all the time he was with the Unit. There is a lot of smuggling going on here. We are right on the Belgian Border. In Belgium Coffee is 2 Francs per lb. Here it is about 6 \" \" \". An M.P. first told me of it. He used to lay out most of his pay there & catch a Motor Lorrie on the way back. The Lorries are not stopped at the Border.\n\n ","71":"\n","72":" Went to Bailleul today Tried to get pass but was delayed became impatient. Finally went without it. Seen one of the tenth on traffic duty in the Square. Had a look at the aerodrome to see if I could see one of these giant aeroplanes I hear about lately (carry 26 men for 8 hours) Never saw any. Seen Les Woolnough, also somebody very like Jack Connelly? In the evening went to Theatre to see \"The Sentimental Blokes\" late Kookkooburra’s. They put\n\non a marvellous vaudeville show. Would be considered first class anywhere. They have a female impersonator who absolutely beats the world. A regular Hussy. A Juggler they put on was very nearly as good as Cinquevalle. The \"Anzac Coves\" havent got a hope with them.\n","73":" 24.2 Sent letter to Hugo yesterday. The Rum issue has been cut out. Application for Paris leave today. I seen General Holme’s","74":" Div) grave today. He is buried at No2 C.C.S. His grave is marked by a plain white wooden Cross 4\"x2\" stuff. There is a rumor that one Battalion in each brigade A.I.F. is to be cut out to reinforce the other three. The extinction of the A.I.E.F. in France has commenced. \n\nIt is a curious fact that most of the A.I.F are better dressed here (when out of the line) than they were at home. I know I had never so much & such good clothing as at present. If a man is at all untidy the M.Ps xx pull him up quick & lively. By the way the Tommy M.P.s bagged me without a pass in Steenwerck yesterday. I not only got out of it but talked my way into the village as well\n","75":" 26.2 Fritz strafing that observation Baloon again this morning as usual. It had to be pulled down. He has got an awfull \"set\" on this Baloon. Puts some very heavy shrapnel at it. We can hear the screech of the fragments quite plainly. I would’nt be the observer for any price.\n\nI believe I have a chance of getting Paris leave shortly. I shall have to put in some overtime on my French. ","76":" Letter to Harry\n","77":" The lack of organization at this dump is pitiable. The Works officer is nearly always drunk and dopey when he is sober. much better. Fritz planes over in force last night. Tommy windy. Heavy Frost today. Slight Sleet.\n","78":" Very Cold & Windy. Ive just been listening to some first hand information about the Boer War. When Colonel Mahon releived Mafeking his men marched by night in the valleys so as to avoid attracting attention still that does’nt altogether account for the fact that his men marched into the town unobserved & actually had to awaken the Garrison, who seemed to be well provisioned too. After these men (Mahons) crowd left Mafeking. They were recalled by Helio to extricate Baden-Powell who had been bottled up again by the Boers in a pass. So much for our cheif Scout. At the relief of Rustenberg the relieving column found tons of provisions of every kind in the town. The relieving column were in bad straits for tucker themselves, & the ungrateful relievees made a deal of fuss about selling my Informant ½ doz. loaves of Bread for the relieving Officer & Staff. The relieving officer was so disgusted when he seen how things really were that he marched his men straight out again\n\nand camped 6 miles away. The relieving force had came 81 miles without unsaddling & on half rations too. Snow again today.\n","79":" F. Rudrun returned here yesterday. (Midnight.) A very heavy Barrage is now on N.E. of this place. There is a continuous flicker due to the Guns punctuated now & then by the Greater flashes of the heavies. It looks as if the great Spring offensive has started. It was only the 3rd 4th & 5th Divisions raiding the Germans simultaneously (raiding parties only of course)\n","80":" Went to Bailleul, Seen the Sentimental Blokes\" late Kookkaburras Miss? \nLindsay Campbell\n is a wonder. Had a brute of a walk back in intense darkness 4 miles of it along railway track – No Blanky Bon – some absolutely A.1. class singers at this show. Last Monday the 2nd Div. came back to take another turn in the line. They have been about Boulogne. The Pioneers stayed here on Heavy Railway work. The","81":" Brigade detrained at Steenwerck Station & mached away with plenty of Swank Bands on full blast on their way to Billets. One can hardly believe they are the same troops which, untidy, mud encrusted, dirty, frequently Hungry crawled about like amphibians in that unspeakable Somme Mud in the Winter before last. No Swank, No Bands then, just one long grim struggle. The Boys get a much better time now. \n\n ","82":"\n","83":" Went to Neuve Eglise seen Smith who informed me that I was down for Paris leave on the 19th Inst. Some frightfully \nHavely\n Heavy\n\nstuff coming over a little further up the road.\n","84":" Elson visited me today and I returned with him to the Battalion I seen a lot of old faces & received quite a welcome. Fellows who have been away in Blighty a year & upwards were there. There has evidently been a spring cleaning in Blighty & the company shows its effects about 240 strong. On returning to the Dump tonight I heard that 40 had been notified to pack up & rejoin their units in the morning. It would have been an awful \"Gutser\" if I had been notified. My Paris leave would have been \"Napoo\" then. Another lot are going Soon, on Sunday I believe so perhaps I am talking too soon. \n\nI have been hearing some risque stories about Paris. One about a certain Hunting incident which I thought was a rather funny story, once, I now find to be an actual every night occurrence at the Wassa. At this place French Soldiers have unusual privileges secured to them by a paternal Government. A guide & 60 Francs makes one monarch of all he surveys at the Wassa between 8.0P.M and 6.00A.M. McLennan told me that last time the 1st were in, they & the Germans were rather flooded out so they both got above ground to bale out their trenches, this mutual arrangement led up to a meeting in no mans land, this \nin\n being observed led to the Australians\n\nconcerned (8th Batt. I believe) being clinked for fraternising with the Enemy. H.Crothers is with the company now, He told me that he intended to give E&M a go, He introduced me to his Brother today.\n","85":" 9.3 Came back to find a list of 35 who had to return to their units this morning. Another 40 have to go. My Paris leave looks rocky. Hellova Barrage last night. Armentierres & south of Armentierres.\n","86":" Fritz sent some 8: (at least) H.V. Stuff this afternoon trying for the Station He killed one & wounded four He was trying for the leave train I think, We put the clock back one Hour this morning so the train left one Hour later only for that fact there would have been Hellova lot of casualties. Our place is right against the Station so we had the Wind up alright. He must have pretty good information to know the time the leave train leaves. I hope to ____ he don’t get trying to get it on the day I get Paris leave. Things are at Sixes & Sevens here none of us know when we are going to get the Order of the Bag. Some Electricians are to go soon so I am worrying about my Paris leave, if I get that I don’t mind.\n","87":" All the Sisters are leaving No 2 C.C.S. this morning in response to a notification from Fritz that he is going to shake things up. That looks bad for us. I sent 6 photos to young Les.\n","88":" On Monday our Battalion got shelled in their Billets in Nieppe\n\nThey were located right in the centre of the village. Casualties 8 killed & 10 wounded they were immediately ordered to leave the square & find new Billets. Since then I heard that Fritz got them again. The first time he put one Shell clean through B Company’s Billet. A Dud lobbed just outside our window just now. Went for a walk this morning & got pulled up twice by M.P.s. I had not a pass & nearly got run in in consequence.\n","89":" A Battery of 6\" Naval Guns being put in \nat th\n on the recent site of the No2 C.C.S. \"No Bon\" for us as it is likely to \"Draw the Crabs\" Bought some stuff for Paris leave today Soap Hair Brushes etc. My hair is like wire having been cut short for 2½ years & practically never Brushed.\n","90":" 16.3 We had a gas alarm one night at the beginning of this month & had to \"Stand to\" with Gas masks but nothing Happened. I wrote to Ernie Maurice today. The moon is beginning to light things up \"No Bon for us\". He is likely to be over any night now. There is a rumor that the Dump is to be shifted. Evidently they think it is too near the line.\n","91":" 16.3 There must be some truth in the rumor that we are going to shift, Fritz is shelling Steenwerck today for the first time since the beginning of the War.\n\nJack Slamond is doing two years at Rouen Military prison (which is a Hell upon earth if reports are true). He escaped from his Guard & the present sentence is the result\n\nFritz sent some Heavy shrapnel at one \n\none of our Baloons yesterday & apparently done some damage because a few minutes later two little dolls slipped over the side & came down with parachutes. One started half a minute before the other and landed 3 minutes \nafter\n before him. I think the second must have been killed because he came down at a tremendous rate much too quickly for safety. The Baloon must have been attached to a motor because we could see it travelling away. In fact we thought at first that the shell had curt the rope & ","92":"\n thus caused the observers to descend but the Baloon afterward came down & reascended some distance from its original possy. \n\nI leave for Paris at 7.59 tomorrow morning.\n","93":" Arrived at Paris at 8.20P.M on Tuesday night. Yesterday we went to Versailles. Missed the coach this morning after a visit to Pepiniere Barracks. Had a trip with Louis Parsons instead. We went to the Invalides, Napoleon’s tomb, Big Wheel, Trocadero, Eiffel Tower Arc de Triumphe. Had two tiptop feeds & then done the Folies Begere, about the liveliest place \nI’ve seen\n in a very lively City. Had plenty of fun & no \"Gutsers\" N.B. we went with a \"Mackerel\" (To be explained later) A feature of the pace was a Yankee M.P. with a very persuasive looking truncheon \n","94":" Late last night Got stranded in the back blocks of Paris by false alarm of an air raid These French people have the wind up on this subject alright. The Trains Trams Tubes Busses etc all stopped We seen plenty of abandoned Taxis, & tried to coax the Drivers back by using the Hooter but there was nothing doing, We had to walk all the way back, over the latter part of our course we met a guide who lived at Montmatre but did not mind the trouble of showing us our way. This incident led to some curious misunderstandings. We were very late for an appointment we had with some Canadians. I have very little sleep here. Most of the time I am too excited & the rest of the time I am generally on the run. At Breakfast this morning there was another alarm and the same scenes were enacted again. Everything stopped, Shops closed. Aeroplane circling over the city etc. One cannot go anywhere. It is now 2.30P.M. and everything is still held up. I heard three bombs fall. Of these one fell in the place de la Republic and another on the Gare de L’est. \nVery\n These French people are the roughest people I have seen in the tubes at any rate. They rush Bump & Bustle like Hell. Talk about Sydney its not a bit like it. The traffic is absolutely uncontrolled & a chap has to go for his life to dodge the Taxis. Another alarm at 9.0PM & I am sitting in the Hotel Moderne with Tucker in front of me\n\nThe lights have been switched off & I wonder if I will be able to see what I am trying to eat. Next item I have to walk about 5 Miles in the dark.\n","95":" Marvellous to relate the Germans are bombarding Paris from a point of 5 miles distant & all these aeroplane warnings have been buckshee labour. Practically everything has been held up for about 2 Days while they were looking for the aeroplanes that were not there. 3.40P.M. I am now in a Barbers Shop and the fire engine has just rushed by warning the people to prepare for Shells (They use the raid alarms for the Bombardment now). This Bombard stunt has greatly spoiled my leave here – I would’nt mind how many shells he put in if they didnt shut down the Tubes Taxis etc. so that a fellow cannot get about.\n\nDinner at the Ostend tonight and had a box at the Opera (Faust) after. This is a most beautiful Building Even the cheapest places have Red Plush Seats. The roof is beautifully painted The only fly in the ointment is the fact that Fritz may come over at any time and cause the performance to close.\n","96":" Had a quiet slow time yesterday. Went to see Lewis, Dined with him. danced at Hotel Moderne in the evening & while there met some of the nicest women I have ever encountered. \nIt\n There is nothing nicer anywhere than a well bred English Girl.\n\nLeft Paris by Gare Du Nord at 1.15P.M. Outside Amiens we were delayed for quite a long time. Fritz Had blown up the line in front \nby\n with Bombs an hour or two previously. In front of us & delayed by the same cause were two Red Cross Trains containing men wounded in Fritzs great offensive. They were very pessimistic. Said he was in Roye & that nothing was stopping him. The people are leaving Amiens in Thousands, the road are full of those pathetic pictures shown during the first German onrush. Women pushing Prams, Wheelbarrows, Etc. Carrying children in their arms. Just like in the retreat from Mons. We got into the station late & a mob of women & children rushed the train. It was now bright moonlight & we could hear several Gothas overhead flying very low. The machine Guns and Archies opened fire on them with as usual no result. The Station was their main Objective and Bombs (very heavy ones) were crashing all around us. Alongside of us on the next line was a Red Cross Train. Two Bombs dropped just on the other side of it abreast of us smashing the windows of the train with Concussion and filling the air with the acrid smell of the explosive. Shortly after our train moved out of the Station just as another salvo of Bombs dropped on our last possy. We went on a short distance, noting as we went, places where the previous bombs had blown in the side of the cutting. We again stopped in a deep cutting, trying to hide in the shadow of one side. while\n\nthe searchlights were playing in the air overhead trying to locate the Hun Machines. The machine Guns & Archies kept banging away at random I think. But it was no use. \"Crash\" Crash\" Crash\" they came. I could hear the swish of the last one as it was falling just behind the Train. That was our last narrow escape. We reached Boulogne @ 4.0AM. . It is now 11.30AM and the 5.0AM for Calais has not arrived yet. I took the liberty of Boarding a leave special that left Boulogne at about 3.30P.M. and came to Steenwerck myself, at Hazebrouck the M.Ps made me get off & get into another but as soon as they left I climbed in again & sat down with a prisoners guard the M.P.s thought I belonged to the Gaurd & I got through O.K. The Railway Traffic is rather disorganised owing to Fritzs rapid advance on Amiens.\n","97":" Some of our mob who were in Bailleul came in today. Fritz made it too hot for them. He is coming through like a house afire on the Somme. The latest report is that he has got Dernancourt.\n\nBell (Will Stewart’s friend) got his head blown off by a Bomb at Bailleul the other night.\n","98":" All the French Boys about here over the age of 16 have \nto go\n been called up. I believe they go on munitions or reserve line work. Things must be very serious alright.\n","99":" Very quiet today. There\n\nis one very big gun hereabouts. The one that has been knocking Bailleul about. It must be 6 or 7 miles away at least & yet it shakes our hut every time it is fired. I received that book from Hugo’s yesterday. Wrote to Mollie Thursday.\n","100":" While I was away the Cyclists were sent up into \nthe\n the line to assist the Infantry. This front is now very lightly held. The","101":" 4th & 5th Divisions have not returned yet. It is said that the 4th divvy were in action 12 hours after they arrived on the Somme.\n\nTuesday 2\/4 A Tommy told me that the 4th Div. drove the Germans back 2 kilos at the point of the bayonet. The 19th & 25th Divisions are relieving the 1st & 2nd here. I suppose that means we are going to leave. I received 5 letters yesterday from Kids 1 Mollie 2 Maurice 1 Lilly 1\n","102":" Left the dump at 10A.M. and arrived at Fletre reinforcement camp. When passing through Bailleul it looked like a city of the dead. Fritz scored some lovely hits on it, quite a number of the houses and the Churches having been \"Knocked rotten\". Practically all the Civvies have left. Had a look at Castre this afternoon. Nothing to write home about. Just discovered I have forgotten young Jacks Birthday. Only 3 weeks to go & I have’nt sent him anything.\n","103":" Went to Fletre last night. This camp (Rev) is right alongside Castre. While having a wash this morning I was simply paralyzed by the number of Gray Hairs I noticed in the Glass. It was rather a \n\n\"Gutser\" because only a couple of weeks back I wrote to Mollie jubilantly stating that I had fewer gray hairs now than when I left Australia. Some of the Tommies told us that the retreat on the Somme was largely due to the failure of the 5th Army who went for their lives when Fritz was coming over thus \nleav\n exposing the flanks of other units & forcing them to retire. I suppose this is also a \"furphy\"\n","104":" An awfull lot of Tommies have passed here going up to the line the majority of them have only just come over from Blighty. The 17th passed here on their way to the Somme on the","105":" Yesterday the","106":" Brigade passed through. All through the night the Transports were coming up. It has been raining for the last 3 days. I sent a copy of Aussie to Jack as a birthday present today.\n","107":" 8.4 Went over near the Montes des Cahs (venereal & S.I.W. cases) for a walk. Received a very flattering opinion about Aussies from a sociable little mademoiselle on the way. Something to the effect that, We are very sorry that you are leaving us, but we know that when your boys & our boys (French) get together down there everything will be alright. The French people everywhere seem inclined to think that the Tommies did not offer a very stout resistance to the German thrust @ Cambrai. The Second Division Artillery were entraining yesterday\n","108":" Sent 2 copies of\n\nAussie away today one to Rush St. and the other to young Claire McMahon.\n","109":" 10?\/4 Entrained at Castre at midday after a march in \nHeavy\n marching order. We are rather packed. 40 in a truck, we travelled via \nLillers B\n Hazebrouck, Lillers, Bethune, Doullens, Domart, to Vignacourt arriving near midnight. We then spent about 1½ Hours floundering around in the mud everything pitch dark. A guide was provided to lead us to Billets , but he lost us & himself also. He was called every possible variety of B---- that we could think of & getting a bit nervous He finally slipped off in the darkness & left us, our N.C.Os finally landed us in a Stable & all was peace. \n\nWe are now at V\n Stayed at Vignacourt about one & a half days. Left there this morning in Battle Order and done a \"Toot Sweet\" march of 15.4 Kilos before 12 noon we were then taken on some Lorries to Querrieu, Had some Bully & Biscuits then I was set on (with others) building a Cook house. The first salute we got was two Bombs from a Fritz plane. I finished the day very tired & footsore. There are persistent tales of Tommies evacuating positions. One Transport officer said that they threw away their Rifles & Equipment and got when Fritz was fully 9 Kilos away. I can hardly believe it. It is also rumored that he has \nbroken\n gained some ground at La Bassee. By Gee there are\n\nplenty of Bombs dropping just now. Between anti aircraft \n& \n Machine Guns & Bombs there is an awfull clatter.\n","110":" \n\nSure enough although we put all lights out a Big Gotha dropped 4 Bombs rather close to us. That settled it we had to go to bed in the dark which earned much bad language ( by the way our beds were duckboards) there are rows after rows of trenches from here up to the line and extending back up to about Amiens and a few miles behind it. Fritzs aeroplanes are over us in ones & twos practically all the time which does’nt look like as if we have the air supremacy which we claim. There are actually 4 in a bunch right over me now. We’re winning alright. One of the cheeky planes mentioned above has just come a glorious \"Gutser\". He was shot down by one of our own and landed about 2½ miles away. I started to walk over but it was too far. \n","111":" We left Steenwerck dump on Wednesday. It was captured by the Germans the following Wednesday just 7 days later.\n\nSunday 14\/4 Working at La Motte yesterday. There is a French armored train here The Camouflaging on it was very perfect. The 6th Company U.S.A. Engineers is working here also some","112":" Divvy Engrs.\n","113":" The last 2 days & nights have been very stormy windy & cold, but we like stormy nights\n\nhere because then we do not hear those huge Gothas roaring overhead looking for likely possies to lay their eggs, while we are shivering & quaking below. At Querrieu every clear night is like a Battle between Bombs, Antiaircraft guns, Machine guns, & every Swaddy who has a little spare ammunition having a go on his own. We left Querrieu with a party of Carpenters including myself to start a new Dump near Vignacourt today.\n","114":" I have been with Sgt Wilson these last few days. He is a member of the Westralian Labour Party. He looks like a mascot being only about 5 Feet high. One of his Sons \nare\n is buried at Bernafay Wood. Another has been horribly wounded and returned to Australia. I hurt his feelings very much by a remark that I made about the wounded one.\n\nBobs grave is behind Fritzs lines now. The Indians over here have to be buried with their heads to the west so they may face the East. In a Cemetary alongside here one of them had to be buried outside so that this rule could be observed\n","115":" Vignacourt is now full of French Soldiers they have come from Lorraine where the 66th U.S.A. Division relieved them. Like the rest of the French people they cannot get Tobacco & hang around our Canteens asking us to buy Cigarettes for them, because the Canteen will only serve British Troops.\n\nIt has been raining every day \nsince we\n lately. Today is very wet & miserable. Some Indians are pushing themselves in on us theiving our wood & making themselves pests generally, I have 4 of them in my dug-out but I have’nt the heart to hunt them out. They look so miserably cold. We had to absolutely kick them out of the Cook house\n","116":" Snowing yesterday cold and ground covered in snow this morning. Received two field cards & one letter this morning from Kelly. \n","117":" Coal as scarce as diamonds here the french people are not allowed to buy it. Cigarettes (English) worth their weight in gold. The French soldiers will do anything to get them. There is a special picket on at the canteen to prevent us buying cigarettes for them. The only amusement of the people in the village is to come up to the little Cemetery attached to the Casualty Clearing Stn. to see the Aussies getting buried. They seem very sorry frequently breaking out into sobs while \nduring Se\n the Clergyman reads the Service.\n","118":" I sent letters to Ciss Mollie & Kelly at the beginning of this week\n","119":" The village is absolutely blue with French Troops. For a little coal or a tin of dripping, the people near here would do anything.\n\nWe had rather a meagre tea & a similar breakfast this morning. Fritz blew up the line in 3 places and the Ration train was late in consequence. It was followed by a Train filled\n\nwith French Soldiers, this train had machine guns mounted upon it. This is the first time I have seen machine gun escorts with trains\n","120":" We leave here soon for Poulainville I believe. We see quite a lot of our fellows who have been gassed \nhe\n There is a lot of Alpini troops in the village, they are very fine looking fellows in a dark Blue uniform with a kind of Tam o’ Shanter cap.\n","121":" Poulainville. This place is full of French Troops too.. There are a number of planes here and they do everything except talk. Talk about stunt. They throw themselves about like Tumbler pigeons. When Fritz comes over here of a night the air is full of Wings. As soon as the alarm is given our planes immediately rise and circle about above untill the coast is clear. If they stopped in the aerodrome they would very likely be destroyed by Bombs. You can imagine the feelings of the unfortunates below. They know that there are \nsome\n hostile planes above and they can \nHear\n apparently millions of them. So one has to wait patiently & Hope that the Bombs miss him. This place receive special attention because there are, A Railroad, several ammunition dumps & God knows how many aerodromes, in a small area. \n","122":" The information above relative to our Planes all rising in a Bomb attack on an Aerodrome is wrong, I asked one of the A.M.s about it & he \n\nsaid \"No the planes remain in or about the aerodrome & take their chance\n","123":" Green letter to Mac. Card to Ciss\n","124":" Went to Villers-Bocage today. Shall have to go there tomorrow on Armstrong Huts for Headquarters. Letter from Parsons (Paris) today. While at Villers-Bocage, I heard a French Band (Chasseurs). Their trumpeter made quite a fine display they have small banners on their trumpets and look very flash.\n\n4\/ 5 Took on a new job at the Dump today. Stayed up with the searchlight unit last night to witness it operating on German Planes, but came a Gutser, Fritz not coming over. The French Artillery moved on last night. Some French Colonial Infantry with a Greenish, Khaki uniform passed through the village today. A regular Tank parade up to the line is held here every night, it is very funny to see the ungainly monsters struggling along, anything from a dozen to a score in Single file.\n","125":" The Enthusiastic Fritz sneaked over at Break of day this morning and Bombed our Dump scoring 6 direct Hits. We had erected some camouflage screening. He evidently thought that there was something wrong & he done his best to rectify things in his own particular way. Wrote two letters today 1 to E.M.M.&B. Coy & another to our Company O.C.. By the way one of those Bombs riddled the Cookhouse, one tent, & a Hessian Camping Shed with Shrapnel without causing one casualty. The occupants all sleeping on the Ground, this undoubtedly saved many of them\n","126":" Some of the Boys got a rude shock last night. They were occupying some dugouts that were cut into the side of a Bank. During the night some Tanks were travelling about and seven of them started to come down this bank in line. The occupants of the Dugouts \nouh\n had to rush out and only just managed to save their lives & their little \"homes?. It would be rather nasty to have ones corpse scraped off the wheels of a Tank for Burial purposes. \n","127":" Bright moonlight again. Fritz over every night as usual\n","128":" Visited the Searchlight last night but had no luck. Fritz would come drumming along untill the lights began to play around & then would he would sheer off to either side.\n\n Ride \nwe\n ","129":" (Welsh Cpl) leaves for England with improved machine Gun Possy. We have had \"Umpteen\" generals inspecting the idea every day. (It is a miniature Barbette).\n","130":" Seen a picture show last night at one of the Aerodromes. They put on a picture (OHara Star Reporter) I think. This picture showed war scenes & had about 5 reels. It tried to show aeroplanes bombing Artillery in Action, Battle scenes etc. I’m sure the author never anticipated that it would be shown just behind the lines in an Aerodrome above all places. Even while the picture was showing. Just outside the Hangar they were firing rockets to guide\n\nour bombing machines back to the \"Drome, also we were expecting Fritz every minute. The pictures showing the \"Plane up in the air & the observer dropping Bombs \nBy Hand\n were absolute nonsense. Every man present had been through the mill & the Bomb dropping & Bombardment scenes were greeted with shrieks of laughter. I seen Dave Kennedy today He don’t look quite so well as he did. Fritz shelled the ammunition dump near here today. I was getting some water today from a well & some German prisoners coming in from the line rushed my tins & drank the lot. They looked rather miserable poor devils\n\nI travelled to the Australian flying corps in the evening and met Ned McCarthy he is medical detail to that unit. He is just as much a Girl as ever he was. His Tent was scented like a Ladies Bedroom & he seemed on terms of questionable intimacy with some of the Officers. He has got very fat. He showed me some lovely souvenirs.\n","131":" Yesterday & today very hot. Got a slight attack of the hump tonight. I wish Fritz would make his push & get it over, we would then know how we stood. The Bullshit in the Daily Mail about the Australians is enough to make anyone sick (it is written by Hamilton Fife an \nEnglish\n correspondent too)\n\nLetters to Dave Gardner & Mollie about last Tuesday.\n","132":" Re E.M.M.&B. Coy. \nBat\n My O.C. will not allow me to transfer (One Gutser). Some of the Tommy Transport Drivers that come here for stuff should’nt be allowed out without someone to lead them around. If I could only spare a little space to tell of some of their performances this would be one of the funniest Books ever written.\n","133":" Some of these Labor units are a pitiful sight, they contain men who ought to be labelled L143. The Govt. responsible for their presence here ought to be Hounded out of office on this issue alone.\n","134":" Yesterday at Querrieu two Labor companies passing each other by the white Chateau when a shell lobbed right into them killing 14 and wounding 46. A big bag. It looked rather awfull the bodies having to be removed to each side of the road to keep it clear for Traffic. \n\n28.5 Same old planes & Bombs the last two nights. The old Tanks are returning this evening (pourquoi? can it be that Fritz is pushing elsewhere. I called on the","135":" Batt. the night before last to see young Dickenson but he was not at home.\n","136":" Wrote letter to Mollie yesterday announcing \"all present and correct\" & last night a Fritz plane dropped 6 Bombs of which two landed one on each side of our dugout each about 15 yds away. The dugout was \nfull\n full of the fumes of the explosive\n\nfor a little while we thought that it was gas. For the rest of the night one of our party kept us awake by rushing out every time he heard a plane & detailing its progress. Fritz also shelled Allonville all night, driving the","137":" Brigade","138":" Batt. out, it is said that one big Shell caused 200 Casualties in Killed & Wounded.\n","139":" Leave started again two days ago. Fritz bombed us again last night. Letters to Dave & Smethurst yesterday. A cheeky Fritz plane sailed over us today. Our fellows brought him down less than an hour later they \"Circussed\" him (surrounded him). Then Napoo Fritz. We have the best of it in the air. Hope he don’t come tonight. I’m right in the middle of it & have to stay till midnight\n","140":" Received letter from Rudrun yesterday. He was booked for Aussie and lost his chance absolutely through his own fault. R.E.P.B. men are being returned to the line (damn shame)\n","141":" Bluey came a lovely Gutser today. When the villagers left before the advance of the Germans they left a lot of clothing behind, the result was that a number of Anzacs appeared clad in glad rags. Top hats, Frock coats etc. Well Bluey has been wearing a sac suit for some time & today an M.P. gathered him in and put him in the clink. It took all the Sergt Major could do to get him out. The charge is still hanging over him. The M.P. told him that he could be shot on two charges namely Looting – and discarding his uniform. Letters G to M. Card to Ciss.\n","142":" I suppose it is hardly necessary \n\nto mention that Bluey now wears his uniform. The Technical units are now cutting mining sets out of rather valuable woods even Walnut sometimes. What awfull waste. Aussies sent away a large parcel of prisoners yesterday. 400 Must make a good impression on the Froggies. \n\nA soldier asked a man what was the ribbon he was wearing. He answered proudly \"That was for the retreat on Mons\" The other replied I suppose you will be getting a couple of Bars to it now.\". An unkind reference to the Somme & Armentieres retirements. According to the \"Daily Mail\" there are 700000 Americans in France now, Well up to date I have’nt seen one American Infantryman. I have seen plenty of Technical Units. By the way their Engineers wear revolvers on their Hips real Cowboy style. They are armed with our Rifles. They look rather awkward with them because they slope arms differently to us. Eastway parti\n\n15.6 Letter to Keller today\n\n16.6 Fritz got one of our Baloons at about 9.30P.M. It made a magnificent spectacle coming down in Flames. He put up a regular Aerial Barrage with his A.A.C. Artillery just previously\n\nFrom the","143":" till today","144":" we have had beautifull weather. That is since Fritz’s offensive started. There is quite a drought on now & it is very difficult to obtain water. A lot of the wells have run dry. Fritz got another of our baloons today.\n\n19.6 The drought has broken up \nagain\n . Rain today. Seen Coo’ee’s last night. Seen a magnificent flare last night it seemed to stay absolutely motionless while I was watching it, for at least 10 minutes. It was dropped from one of Fritzs planes\n\nA rather curious sight is the things he sends up at our planes of a night when they are crossing the line. They look like strings of Fireballs. I have often noticed them but never found out what they are. Called \"Flaming Onions\"\n\n19.6 Have to be very Brief. Very little space left. \n","145":" G.L to M W. to W.S.\/ L to Clare\n","146":" I have heard that the plane that visited us on the Night of the","147":" was brought down the same night by a couple of ours. This is a new idea, fighting by night, and is probably due to the fact that the Searchlights are not very efficient on moonlight nights. We shall soon have aeroplane escorts for dumps on moonlight nights I suppose.\n\n27.6 R.T.O.s Bulldog Killed Kitty. Troops despondent.\n\nMade the acquaintance of one of the R.E. Special Coys (Z) today, they have the job of pelting Fritz with Gas bombs by means of Trench mortar which throws the bombs 2000 yds. The 108th & 56th U.S. Engrs are good customers of ours. The 108 gives a concert tonight at Bertangles aerodrome.\n\nLetters. From M Rec C.L.E.\n\n \" to R\n","148":" Fritz bombed around here again last night, also Villers-Bocage. There were some civvies, soldiers & kiddies knocked at the latter place. Our aeroplanes attacked the raiders. I could see the tracer Bullets darting from the darkness at the Fritz’s, while the searchlights held him. The Antis as usual threw shells all over the sky with no result. Fine weather still continues.\n","149":" \nG\nWhite C to Sheridan\n","150":" Aussies had a successful stunt last night 1000 Prisoners 40 Machine Guns 1 77M.M. stuff still coming in. Working today at Montieres Chateau putting in small Generator for lighting. Some officers are Billetted here. D.Halloy is the name of the family who previously lived here. Like all these chateaus it is very pretty. The grounds are not as pretty as those at Henencourt. The Somme or a branch of it runs through the Grounds.\n","151":" On the old job again after a few days putting in a lighting set at Montieres Chateau and salvaging machines in Amiens. I think I am getting this Influenza, don’t feel very good today. Don’t know how I am going to answer my letters.\n\nL to Harry\n\nCard to Harry Jun.\n","152":"\n\nFritz Aviator just brought down two of our Balloons","153":" Ditto But only one balloon this time. A couple of days past I was at a Farm trying to buy some milk. There were a number of Tommies there. Madame called us into the yard. We went. One of the cows was being served by the Bull. Madame & one of the Girls supervised the operation and supplied that little assistance that the Bull sometimes requires. Fancy two Australian women doing this and calling the Soldiers \nout\n in to have a look\n","154":" This Influenza is giving me one rough time. Dave Kennedy came to see me the night before last. He took my temperature 101.6. Last night I was just as bad. Havent had a \n\nbite scarcely to eat for 4 days semi-Delirious last two nights and yet carrying on in the day. I make up my mind for sick parade every night but feel better in the morning & don’t take it on.\n\nG.L. to M. ","155":" L to Lily 15\/7\n","156":" just received polite request for timber for Coffin for Chinese. Supposed to have been shot by Australian\n","157":" Yanks have been passing here on their way in (to the line) for the last 3 days at about the rate of 3 Divisions per day. One of the Drivers has just informed me that our Guns are being pulled back, Also that Fritz is massing heavily here. Well the Aussies will give him something to think about if he comes\n\nG.L. to Mum 19.7\n","158":" A Fritz plane brought down another Baloon this afternoon. I don’t know what he’s doing elsewhere but this is the fifth Baloon he has destroyed here this week. Of course it a great sight etc. but there must be carelessness somewhere. It is always the same two or three baloons that he gets. The observers generally get clear in their Parachutes.\n\n23.7 Letter to Rud.\n\n24.7 Cards to Laura, Harry jun, Ernie\n","159":" Lett to Maurice\n","160":" When the Aussies first came here, Corbie had just been evacuated by the people, & tons of good things could be had for the lifting, of course Corbie was being heavily shelled as also was Amiens. Among other things the Anzacs salvaged a lot of dainty feminine Underwear & being rather short of underwear themselves immediately used the ladies stuff. They went into the line soon after.\n\nWhen the casualties came into the hospital later I believe the nurses were nearly in Hysterics, Big, Rough, Anzacs \nwere\n on being stripped for treatment etc, Disclosed the daintiest of Silk nighties, knickers, even Silk Stockings. There were yards of pale Blue & Pink ribbons run through these garments and Altogether the nurses nearly broke their hearts over the sinfull waste I believe the Nurses grabbed the discarded clothing for their own use. G.L. to Mac\n","161":" Fritz planes very busy last night Bombing all around here. He caught the Yanks in Allonville Wood, killed at least 10 & wounded a number of others.\n\nLetter to Ciss","162":"\n","163":" The Ubiquitous Fritz has just brought down 4 of our Observation Balloons all in a row All \nw\n we have to show now is 4 columns of black smoke and 6 Parachutes tossing about on their way to Earth with the unfortunate observers. There are generally two \non\n with each Balloon & there are only 6 coming down. Two of the Balloons must have had only one observer each or else two were Killed by the attacking planes. The Balloons on this sector have been getting a bad time lately. \n\nTed Welsh came back from Blighty today. There is a \nrun\n rumor that we are going to shift. About 40 Tanks went up to the line last night. There must be a Stunt coming on. Fritz is very uneasy. His reconnaissance planes were over today several Times.\n","164":" The","165":" Div have come out for a few days (10). They have been in the line practically continuously since january. Speaking to one of them. He told me of two rather funny incidents. In one case a chap was carrying a bag of flares over in a Stunt when the bag was struck by an Enemy flare \nand\n which ignited most of the Flares it contained. The Aussie went for his life, looking like a mobile volcano belching out Red, Green & white, Stars everywhere. Every Fritz that was not otherwise engaged, had a shot at him but he got back O.K. I believe it was in the same Stunt that a runner was sent to see if the troops had attained their objective. The runner went to the objective (a certain trench) got up on the parapet & innocently enquired \"Any Aussies there\"? Bang Whizz. Bang, etc was the answer. The Trench was full of Fritzs. The Runner justified his name then if he never did before & escaped Scatheless\n","166":" \"Smart Set\" last night & there met Jacobs who recognised me immediately Although younger than I am His temples are nearly snow white & he looks 25 years older than when I last seen Him about a dozen years ago. On comparing notes we discovered that we were on leave in Paris together. Were at the same theatres on the same night & left Paris on the same day & yet we never met each other. He was with McRae when the latter earned the D.C.M. & says that Mac. fully deserved it for his coolness & courage.\n\nJacobs F.W. is a 1914 man & is expecting Aussie leave.\n\n6.8 \nWe\n Tuesday A wonderfull sight today. Tanks started passing here at midday & from then untill about 7.0P.M. they kept passing without a break I never thought there were half so many Tanks in the World. They were small Fast Tanks (Whippets). Evidently the Big Stunt \nhas\n is about to commence. We have been \nindecipherable\n at top speed for the last Two days. The weather is very unfavourable for our offensive but I think the preparations are too far advanced for us to Stop now.\n","167":" Fritz has recaptured the whole or part of Morlancourt. The 5 Division captured this, then they were relieved & a day or two later Fritz recaptured the position. \n\n8\/8 Our Offensive started @ 8AM. today. Weather very dull, heavy clouds, very light rain, Fritz messed up the Tanks a bit, he hit one a store tank conveying Petrol. It went up in flames giving him sufficient light to destroy 14 more, 700 prisoners just passed down the road.\n\nLetter to Keller\n\n9\/8 More & still more prisoners coming through. Everything going well. There was hardly any Barrage at the beginning of this offensive. Only 4 minutes. \n\n11.8 Our people established Dumps (4) 4 & 5 miles past our old front line on the day after the offensive started Names of Dump Wiencourt, Mather, Transit, Fouilloy.\n","168":" Tremendous strings of prisoners passing through, A Tommy Officer put a \n\ngaurd on to stop us from giving them water. \nindecipherable\n The aeroplane that was brought down on Saturday night was a Super-Gotha with 5 engines. It carried a crew of 7 and a heavy load of Bombs. \n\nIn our offensive which started on the 8th & is still going on the 3rd Corps were held up and the A.I.F. had to send the 4th Bgde & later the 4th Div. to assist them. I believe they also had the assistance of some Yanks. Anyway the Aussies went ahead like Wildfire untill the failure of the","169":" Corps on their left made it necessary for them to wait and as mentioned above send assistance. General Buckley of the","170":" Corps has been Relieved by General Godley.\n","171":" Letter from Mac. Card from Ciss & letter from Jack.\n","172":" Letter from Mac Cards & letter from Clare Keller card from Lilly. Letters to Mac","173":" &","174":"\n\nGeneral Pershing when addressing the Yankee troops about here, told them that by next Xmas they would be in either Heaven Hell or Hoboken. Hope He’s right.\n\nAnother big stunt started here yesterday our boys are going over in the sector where the III Corps were held up I believe\n","175":" A number of Yankee Troops are leaving this Sector & going South. Like most other troops they started dumping their stuff & we got the Benefit of it. I got a new Shirt and a blitherer pair of Boots, Beautifully finished inside and with the rough side of the leather & all the seams outside\n\n"}}