{"Document Name":{"0":"Diary_0364","1":"Diary_0364","2":"Diary_0364","3":"Diary_0364","4":"Diary_0364","5":"Diary_0364","6":"Diary_0364","7":"Diary_0364","8":"Diary_0364","9":"Diary_0364","10":"Diary_0364","11":"Diary_0364","12":"Diary_0364","13":"Diary_0364","14":"Diary_0364","15":"Diary_0364","16":"Diary_0364","17":"Diary_0364","18":"Diary_0364","19":"Diary_0364","20":"Diary_0364","21":"Diary_0364","22":"Diary_0364","23":"Diary_0364","24":"Diary_0364","25":"Diary_0364","26":"Diary_0364","27":"Diary_0364","28":"Diary_0364","29":"Diary_0364","30":"Diary_0364","31":"Diary_0364","32":"Diary_0364","33":"Diary_0364","34":"Diary_0364","35":"Diary_0364","36":"Diary_0364","37":"Diary_0364","38":"Diary_0364","39":"Diary_0364","40":"Diary_0364","41":"Diary_0364","42":"Diary_0364","43":"Diary_0364","44":"Diary_0364","45":"Diary_0364","46":"Diary_0364","47":"Diary_0364","48":"Diary_0364","49":"Diary_0364","50":"Diary_0364","51":"Diary_0364","52":"Diary_0364","53":"Diary_0364","54":"Diary_0364","55":"Diary_0364","56":"Diary_0364","57":"Diary_0364","58":"Diary_0364","59":"Diary_0364","60":"Diary_0364","61":"Diary_0364","62":"Diary_0364","63":"Diary_0364","64":"Diary_0364","65":"Diary_0364","66":"Diary_0364","67":"Diary_0364","68":"Diary_0364","69":"Diary_0364","70":"Diary_0364","71":"Diary_0364","72":"Diary_0364","73":"Diary_0364","74":"Diary_0364","75":"Diary_0364","76":"Diary_0364","77":"Diary_0364","78":"Diary_0364","79":"Diary_0364","80":"Diary_0364","81":"Diary_0364","82":"Diary_0364","83":"Diary_0364","84":"Diary_0364","85":"Diary_0364","86":"Diary_0364","87":"Diary_0364","88":"Diary_0364","89":"Diary_0364","90":"Diary_0364","91":"Diary_0364","92":"Diary_0364","93":"Diary_0364","94":"Diary_0364","95":"Diary_0364","96":"Diary_0364","97":"Diary_0364","98":"Diary_0364","99":"Diary_0364","100":"Diary_0364","101":"Diary_0364","102":"Diary_0364","103":"Diary_0364","104":"Diary_0364","105":"Diary_0364","106":"Diary_0364","107":"Diary_0364","108":"Diary_0364","109":"Diary_0364","110":"Diary_0364","111":"Diary_0364","112":"Diary_0364","113":"Diary_0364","114":"Diary_0364","115":"Diary_0364","116":"Diary_0364","117":"Diary_0364","118":"Diary_0364","119":"Diary_0364","120":"Diary_0364","121":"Diary_0364","122":"Diary_0364","123":"Diary_0364","124":"Diary_0364","125":"Diary_0364","126":"Diary_0364","127":"Diary_0364","128":"Diary_0364","129":"Diary_0364","130":"Diary_0364","131":"Diary_0364","132":"Diary_0364","133":"Diary_0364","134":"Diary_0364","135":"Diary_0364","136":"Diary_0364","137":"Diary_0364","138":"Diary_0364","139":"Diary_0364","140":"Diary_0364","141":"Diary_0364","142":"Diary_0364","143":"Diary_0364","144":"Diary_0364","145":"Diary_0364","146":"Diary_0364","147":"Diary_0364","148":"Diary_0364","149":"Diary_0364","150":"Diary_0364","151":"Diary_0364","152":"Diary_0364","153":"Diary_0364","154":"Diary_0364","155":"Diary_0364","156":"Diary_0364","157":"Diary_0364","158":"Diary_0364","159":"Diary_0364","160":"Diary_0364","161":"Diary_0364","162":"Diary_0364","163":"Diary_0364","164":"Diary_0364","165":"Diary_0364","166":"Diary_0364","167":"Diary_0364","168":"Diary_0364","169":"Diary_0364","170":"Diary_0364","171":"Diary_0364","172":"Diary_0364","173":"Diary_0364","174":"Diary_0364","175":"Diary_0364","176":"Diary_0364","177":"Diary_0364","178":"Diary_0364","179":"Diary_0364","180":"Diary_0364","181":"Diary_0364","182":"Diary_0364","183":"Diary_0364","184":"Diary_0364","185":"Diary_0364","186":"Diary_0364","187":"Diary_0364","188":"Diary_0364","189":"Diary_0364","190":"Diary_0364","191":"Diary_0364","192":"Diary_0364","193":"Diary_0364"},"Date":{"0":"unknown","1":868.0,"2":869.0,"3":870.0,"4":871.0,"5":872.0,"6":873.0,"7":874.0,"8":875.0,"9":876.0,"10":877.0,"11":878.0,"12":879.0,"13":880.0,"14":881.0,"15":882.0,"16":883.0,"17":884.0,"18":885.0,"19":886.0,"20":887.0,"21":888.0,"22":889.0,"23":890.0,"24":891.0,"25":892.0,"26":893.0,"27":894.0,"28":895.0,"29":896.0,"30":897.0,"31":898.0,"32":899.0,"33":900.0,"34":901.0,"35":902.0,"36":903.0,"37":904.0,"38":905.0,"39":906.0,"40":907.0,"41":908.0,"42":909.0,"43":910.0,"44":911.0,"45":912.0,"46":913.0,"47":914.0,"48":915.0,"49":916.0,"50":917.0,"51":920.0,"52":921.0,"53":922.0,"54":925.0,"55":926.0,"56":927.0,"57":928.0,"58":930.0,"59":931.0,"60":932.0,"61":933.0,"62":934.0,"63":935.0,"64":936.0,"65":937.0,"66":938.0,"67":939.0,"68":940.0,"69":941.0,"70":942.0,"71":944.0,"72":945.0,"73":946.0,"74":947.0,"75":948.0,"76":949.0,"77":950.0,"78":951.0,"79":952.0,"80":953.0,"81":954.0,"82":955.0,"83":956.0,"84":957.0,"85":958.0,"86":959.0,"87":960.0,"88":961.0,"89":962.0,"90":963.0,"91":964.0,"92":965.0,"93":966.0,"94":967.0,"95":968.0,"96":969.0,"97":970.0,"98":971.0,"99":972.0,"100":973.0,"101":974.0,"102":975.0,"103":976.0,"104":977.0,"105":978.0,"106":979.0,"107":980.0,"108":981.0,"109":982.0,"110":983.0,"111":984.0,"112":985.0,"113":986.0,"114":987.0,"115":988.0,"116":989.0,"117":990.0,"118":991.0,"119":992.0,"120":993.0,"121":994.0,"122":995.0,"123":996.0,"124":997.0,"125":998.0,"126":999.0,"127":1000.0,"128":1001.0,"129":1002.0,"130":1003.0,"131":1004.0,"132":1005.0,"133":1006.0,"134":1007.0,"135":1008.0,"136":1009.0,"137":1010.0,"138":1011.0,"139":1012.0,"140":1013.0,"141":1014.0,"142":1015.0,"143":1016.0,"144":1017.0,"145":1018.0,"146":1019.0,"147":1020.0,"148":1021.0,"149":1022.0,"150":1023.0,"151":1024.0,"152":1025.0,"153":1026.0,"154":1027.0,"155":1028.0,"156":1029.0,"157":1030.0,"158":1031.0,"159":1032.0,"160":1033.0,"161":1034.0,"162":1035.0,"163":1036.0,"164":1037.0,"165":1038.0,"166":1039.0,"167":1040.0,"168":1041.0,"169":1042.0,"170":1043.0,"171":1044.0,"172":1045.0,"173":1046.0,"174":1047.0,"175":1048.0,"176":1049.0,"177":1050.0,"178":1051.0,"179":1052.0,"180":1053.0,"181":1054.0,"182":1055.0,"183":1056.0,"184":1057.0,"185":1058.0,"186":1059.0,"187":1060.0,"188":1061.0,"189":1062.0,"190":1063.0,"191":1064.0,"192":1065.0,"193":1066.0},"Entry":{"0":"\n\n","1":"\n\nArriving at the Agricult. Ground after leave at 2 \np.m.\n a.m. & slept for about half an hour.\n\nReveille at 3 a.m. when it was fairly cold.\n\nAfter a roll call & a tedious wait we finally commenced to move at 5 a.m. & friends & relations joined us all along the route which was along Randwick Rd., Oxford St. to Darlinghurst thence Bourke St. to Wolloomoloo Mother, father, Harry, May (sis), W.B., Arch Flack. Tom Jones joined us at Darlinghurst. Arrived at Wharf at 6 a.m. & I said good bye to all. On Board the transport S.S. Benalla & \nshe\n after\n\nhanding our embarkation cards at gangway.\n\nShewn our quarters which were in No. 4 Troop Deck. At 8 p.m. the gangway was pulled up & the people all out on wharf but I failed to see any of my people.\n\nBreakfast at about 8.15 & we anchored in harbour off Bradleys Head where numerous craft visited us during the day laden with \nwith\n sightseers.\n\nAt 3 p.m. we pushed off again & about 4 launches accompanied us to Heads. The cock a doodle doos were very deafening at some periods.\n\nOutside we found the sea very calm.\n\nSam tried to pick up his people at Watsons \nWa\n Bay but cannot say with what success. When settled down to our surroundings \nat\n a bit we had a look round.\n\nThe troop decks are one below the main deck & each man eats dresses & practically lives in same space as he sleeps in. Hammocks are used for sleeping purposes.\n\nNo smoking is allowed between decks.\n\nship is fitted with wireless has about 3 hospitals and an insolation hospital which we had occasion to use on first day with case of measles. There were about 1500 troops aboard & the troop Decks are \nslept\n cut up into messes of 14 men each.\n\nAlso there is a canteen which cigarettes at 3 packets for 6d.\n\nHave 2 Red Cross flags\n\ngiven by M.B.\n","2":" not expect to see land again until 18 days Colombo. Have a band on Board (S.B’s). Sam showed me his quarters in Sergeants portion (Cabin No. 13). Am suffering from a cold on chest sustained on Sunday night sleeping out there in Agricultural Hall.\n\nShowers (salt) laid on & the accomodation is generally very good.\n\nThe meals are very good consisting of \nBreakfast\n Porridge & meat & tea.\n\nDinner\n Soup, meat & pudding.\n\nTea, Bread butter jam & cheese.\n\nMet on board Ossie Wood & F.A. Day old Water Board men in 9th Machine Gun Section.\n\nTuesday 2nd\n\nSea again very calm.\n\nDuring day assisted in removing the hospital to make way for an Officers smoke room. The new hospital quarters were very scanty. \nMost of the old\n","3":"\n\nWhen we awoke found that a moderate gale was raging and very soon large numbers were sea sick. I managed however to keep well & ate breakfast & dinner with relish.\n\nDuring the day the gale strengthened & towards night raged very fierce, one wave in particular reaching upper deck besides flooding our new hospital quarters. Therefore three of us Maclean, Trollope & self were detailed to bail out which we found very difficult as the only implements\n\nat hand were cup, two plates, a mop & sheet. We succeeded however and since most of the orderlies were sea sick we were detailed to work until midnight as relief.\n\nAfter dark did not feel so well.\n\nSighted Kangaroo Island about dusk (South Australia).\n","4":"\n\nAwoke with a feeling of sickness but ate breakfast and during morning improved rapidly. As day wore on the sea became calmer and the seasick men became better.\n","5":"\n\nSea quite calm again & felt very fit. Food of late has been very good including haricot beans, peas, fig pudding, cinnamon pudding, etc.\n","6":"\n\nTom Trollope not too good probably influenza. Was placed in hospital at night. Had two short spells of physical drill.\n\nYesterday passed another troopship A.66 close enough to hear whistle of men.\n\nFor 24 hours ended noon today we did 317 miles & for previous 24 hours we did 296 miles.\n\nHave been in the Bight for that period so the weather has not been too bad.\n\nThrew overboard a bottle containing address etc.\n\nCancelled.\n\nBand Concert on deck at night in which Tim took part.\n","7":"\n\nChurch Parade morning but too overcrowded to allow the A.M.C. to attend. For 24 hours ended now today we did 303 miles. On guard V.D. section. Day passed quietly.\n","8":"\n\nOn guard early morning from 3-5 a.m.\n\nOn awaking at 6 a.m. could see land, part of coast of West Australia. This was first land we had seen since Wednesday last when we saw Kangaroo Island S.A. Also sighted two boats – one the troopship Osterley though did not pass close enough to recognise her. The other a White Star Liner. Saw land nearly all day & in parts looked like sand hills.\n\nAfternoon lecture by Capt. Vicars on Field Pannier No. 1. During the spare hours of day gambling occupied the minds of good number & the games took various forms including Banker two-up & “Crown & Anchor\". One of our mess Tony Trollope made about &pound;3 in 4 days.\n\nI managed to keep away from the schools as I had no previous experience to guide me or the inclination to learn.\n\nMost of the boys had recovered from their attack of sea sickness tho’ there were still a few who would never be right until we landed. Needless to say we all wanted to land to see a bit of\n\nthe world. But today we apparently passed Fremantle without stopping. Had my first clothes washing job since embarking & the water was scarce and very rusty.\n\nAn epidemic of influenza has broken out on ship & the hospital contains about 50 patients.\n","9":"\n\nA fresh wind sprang up in early hours of day & by sunrise a choppy sea tossed the boat very considerably. This continued all day & night and it was extremely difficult not only to keep erect on occasions but at meal times the cutlery, plates, etc. used to run all over the ship. We also shipped a considerable amount of water. During the day two lectures were given by Capt. Vicars and the contents of Field Pannier No. 2 exhibited. Just here it might be as well to state that contents of Field Pannier No. 1 consisted of drugs including phenacetin, castor oil, Pot Bromide, digitilone mag. sulph. boric acid, vaseline, lysol, iodiform, chloroform, cocaine, chloridine, morphia, strictynine, Pot permang., sodi bicarb sticks of silver nitrate and surgical instruments including 6 artery forceps, 2 large scissors, scapulas, directors, needles, cat-gut, silk, bonesaw & dental outfit.\n\nTablets including quinine and most of above drugs, notebook & specification tallies copying pencils, lamp and candles, catheters etc., thermometers, bowl and pestle for mixing, sterilizer & lamp, carbolic acid\n\nThe No. 2 Pannier consists of mostly dressings for wounds including adhesive plaster, roller & triangular bandages, gauge, wool, triangular bandages, gauze, wool, triangular bray drainage tubes, shears.\n\nWas mess orderly for day. At night had hot salt bath.\n\nPosted letters to Dick Damar, Cousin Jim, Harry Baldock, Miss D. McDauchlan of Burwood and Miss A. Waterhouse of Mosman although they cannot be put ashore until probably Colombo. However it is necessary that same be censored by ship’s censor before leaving ship. Had difficulty in getting to sleep on account of noise made by ship’s rolling disturbing plates and other articles. For 24 hours ended 12 oclock we did 292 miles and am now about 100 miles west of Perth W.A.\n\nPut 2 more bottles overboard containing address.\n","10":"\n\nShip still rolling somewhat.\n\nLecture in morning by Capt. Meehan on “Preparing the Operating Theatre\" \nfor surgeon\n. He divided the subject into 2 sections, (1) Preparing for surgeon, (2) For anesthetist, (3) For patient. Under (1) was included Rubber gloves – boiled in pure water for 3 minutes wrapped in towel so as to keep separate as may be more than one pair. Instruments – boiled in soda & water for 5 minutes but not knives as edges blunted. Knives hold with forceps for ½ minute.\n\nPlace the whole except gloves into cold water then into carbolic acid, Gloves into cold water only.\n\nCaps, gowns sleeves & masks all to be sterilised by boiling Iodine saline solution morphia strichynine hot water bottles 6 towels swabs & pads chloroform & drop bottles (2) (3) included in foregoing hot coffee – scalpule & other instruments.\n\nHad about an hour’s practice at signalling this morning with Sargt. Southern.\n\nSaw some flying fish and was surprised at the distance they flew some say 100 yds. For the 24 hrs. ended noon today we travelled 298 miles.\n\nPosted two P.C. photos – one to Jack Prunty & other to Mrs. Hodge of Crookwell.\n","11":"\n\nExcellent weather though very warm since we are getting into tropics now being in meridian 20.\n\nFor 24 hrs. ended noon we did 302 miles.\n\nShip in sight on starboard side practically all day but towards night she passed us. She was “Kastigar P & O boat. \n\nPay (10\/-) today. Pay on board ship is every 10 days and 1\/- is all that is paid.\n","12":"\n\nAnother calm day. For 24 hours ended noon we did 321 miles.\n\nDetailed for work in Dispensary until further instructions. The weather being now very hot most of the boys were glad of their “shorts\". At night all the boys congregated on the poop deck and under the\n\nthe conductorship of Sam a very enjoyable evening was held.\n\nSlept on “poop\" deck.\n","13":"\n\nMess Orderly for day.\n\nDid 317 miles for 24 hours ended 12 noon.\n\nPassed Keeling Island but not close enough to see it. At night concert on board. Sam selected a preliminary \nselection of men\n choir to take part in a contest against 2 other choirs on board. Hot bath at night.\n","14":"\n\nPosted two letters one home & another to M.B. Did 315 miles for 24 hours. Raining most of the day. The atmosphere is exceptionally hot and seems to remain so even all night so much so that although we \nslept\n sleep with absolutely no bed clothes and only wear a pair of pyjama trousers & shirt we still cannot stop sweating. In the Dispensary which is entirely without ventilation the condition is intolerable.\n","15":"\n\nSent card to \nM.B.\n Miss Bennett of Croydon regarding sending me papers and books.\n\nRaining & unsettled nearly all day & still exceptionally hot.\n\nAfternoon. Some very good sport in a boxing tournament conducted by Lieut. Coghill (ex boxer) of 35th Batt. Concluded with a comical contest in which the competitors were blindfolded, was won by a black man Priv. Carroll (not our Carroll). At night Sam gave his choir\n\ntheir first lesson in connection with the choir contest soon to take place. Hot bath & bed. For 24 hrs. ended noon we did 300 miles.\n","16":"\n\nMail closes today as we are expected to be in Colombo in three days time. For 24 hrs. ended noon we did 285 miles.\n\nSecond choir practice but did not attend. Had bath instead. There was a peculiar calm on the sea all day, much calmer than the Sydney Harbour ever is. There was also an absence of wind.\n","17":"\n\nAt noon we were exactly 00 degrees (The Equator) but the Captain would not sanction the usual “Ring Neptune’s Court\" on a\/c of the casualties on \nthe\n his last trip.\n\nIt was much cooler today and an excellent breeze was blowing.\n\nAfternoon. The boxing tournament was advanced a further stage and some good bouts took place.\n\nA very interesting exhibition spar was that between Gordon Coghill (now a Lieut.) and Les Fletcher from Newcastle way. Coghill although much the bigger of the two came out with a black eye.\n\nWe did 305 miles for 24 hrs.\n","18":"\n\nVery heavy head wind blowing consequently we only did 231 miles for 24 hours.\n\nSports again in afternoon. The boxing was very good \nand\n as was the tug of war. Our boys (A.M.C.) with an excellent team\n\nconsisting of Sargts. Meadows, Crook & Priv. Fox, McLean, E. Cunningham, Davidson, Zocchi & another after winning two heats succeeded in winning the final much to the surprise of other Companies aboard.\n","19":"\n\nStill a very heavy wind blowing and our progress is slow.\n\nA storm overtook us during afternoon and a series of heavy showers followed \nso\n which made air so foggy that Captain had to persist in his whistle.\n\nAt noon we were opposite the most southerly point of Ceylon (Cape Tegan) and still have 90 miles to go to Colombo. Did 236 miles for 24 hours.\n\nAt nightfall we stopped as we could not enter Colombo Harbour until after dusk.\n\nThe rain simply poured at 8 p.m. and continued for an hour or so. \nThe\n Our Troop Deck sprang a leak and I climbed to top of a ventilator (the higher type) and turned the top which remedied the defect. However the night went quickly \nand\n and next morning.\n\nColombo\n","20":"\n\nWas awakened by \nsound\n cries of “Colombo at last\" and on looking was surprised to find we were just entering the Harbour which consisted of a breakwater and a point of land. The land is extended so that at the entrance there is only room for one ship at a time.\n\nAll this time it is raining very heavy and the prospects of a fine stay here looked very black.\n\nAfter being properly moored boat after boat arrived loaded with Cingalee men who wanted to exchange their coinage stones & curios for our money. Some would dive for silver whilst one man who carried a military pass would take out your for 2\/- by a method of his own and he was very successful too.\n\nWhat struck me most was the resemblance of these men to Japanese especially the Water Police who were dressed similar to a Japanese sailor.\n\nAfter we had been in harbour for an hour a war boat arrived and we gave them a cheer. Just beside also was a large Messagies Maritime (French) boat, which sailed however during morning.\n\nThe rain continued throughout the day and when \nour\n half of the troops aboard (who were allowed ashore) had been put into lighters a heavy shower drenched them all.\n\nI was detailed to work in the Dispensary on my own so cannot go ashore today. It was also noticeable how the water changed color from blue to green when we came near land.\n\nSunday 21st\n\nReceived orders to be ready to go ashore this morning for a route march. So dressed accordingly and as weather was threatening\n\nwe had to take our greatcoats. About 700 of all units put ashore in 5 lighters and on arrival at Jetty which \nwas\n is an excellent structure we were formed in Company and the march commenced. Before long it became evident that the march was going to be unpleasant as the heat was unbearable and we were wet thro with sweat ere long. To make matters worse it commenced to rain heavily and we had to don our greatcoats.\n\nHowever we took stock of the town during our progress and found it very clean & quaint looking.\n\nIt was noticed that no native women were seen but it did us good to see some white women at the Oriental & Galle Face Hotels which we passed. The beach also on route was very good although no one was in surfing.\n\nAll sorts of color was lent to scene by the dress of the natives and their jabbering reminded one of a chinese quarter say in Sydney.\n\nOur march ended at Barracks a rather extensive building which was garrisoned by North of England troops and Indians. There we were allowed a drink each and made several small purchases at canteen.\n\nPosted two cards here one to M.B. & to home. After an hours spell were marched back to Jetty & to ship via the smelly & hot lighters.\n\nAt one spot saw niggers playing cricket while others sold curios stones bananas cocoanuts pineapples. One cingalee changed a sov. (gold) for","21":" and another a note for 19\/6.\n\nPurchased two cotton singlets for 9d. each (made in Japan).\n\nThe town has an electric tram system and a train (which I did not see).\n\nSam had dinner at Oriental Hotel for 4\/11 and informed me that the dining hall was as large as Sydney Town Hall.\n\nDuring the afternoon the Psyche came into harbour.\n\nAt \nnight\n 5.30 the Governor of Ceylon (A Brigadier General) inspected the ship & troops. At night large number of boys broke ship and went ashore. They had a good time – struck trouble with natives on some occasions and nearly all were caught by the town picket and names were taken.\n\nSome of our mess \ntried\n (including self) obtained a pass each to go ashore and got as far as a launch when we were ordered ashore by a Major Hunt.\n\nTuesday\n","22":"\n\nA muster parade was held at 7 a.m. at which Capt. Vicars took the opportunity of censuring those who went ashore the previous night & informed us that all leave for today was thereby \npassed\n stopped. \n\nAt 1 p.m. we weighed anchor and our band struck up “This is the Life\" and the ships in harbour farewelled us (including the “Psyche\" which was remaining in harbour).\n\nIt was surprising the distances the native fishing boats & smacks went out to sea. Then we were in for \nthe\n what might easily be the surprise of the voyage and it took some time to convince us that same was true.\n\nSam first brought the news that the O.C. Troops (Col. Holborrow) had awaken Capt. Vicars and informed that as there was trouble in Red Sea “we were going round the b—Cape\". The ship was still travelling \neast\n west (towards Suez) but this was explained by the fact that the Captain did not wish the Colombo people to see what direction we \nwere\n would go in and he would alter his course later. This proved correct and at 5 p.m. we altered our course due south and we are surely due for South Africa. If that is so we are \nsurely\n in for a very big sea trip and even now some of those on board are looking cross-eyed at water.\n","23":"\n\nStill continue journey due south which confirmed our fears for a trip to Sth. Africa.\n\nFor the period ended noon we did 238 miles.\n\nIssued with lime juice today.\n","24":" (Empire Day)\n\nDid not recognise that it was Empire Day except at night when a patriotic concert was held.\n\nStill continue to travel South & covered 259 miles for 24 hours.\n\nCrossed the Equator again (second time) at 8 a.m. but again with no demonstration. Duty in Dispensary ended for time being.\n\nFresh water turned on all day to allow men to wash clothes.\n\nParasitical Insects were very prevalent just at this time and blue ointment had to be requisitioned. I remain free to date and shall be careful.\n","25":"\n\nThe weather for last couple of days and today has been excellent. Very hot but with a cool southerly wind blowing.\n\nWe are still steering practically due south which seems peculiar as even now we are nearly due south from Colombo and no nearer the African coast.\n\nFor 24 hrs. ended noon we did 259 and are in lat. 5.4 & long. 79.4.\n\nLecture in morning by Capt. Meehan on “Wounds\" and in afternoon by Capt. Vickers.\n","26":"\n\nExcellent day. Lecture in morning by Capt. Meehan on Septic Wounds. (Moist dressings – Perch of Mercury 1-4000. Not carbolic as dangerous. Diable to gauze. Pack well with gauze. Keep wound open.)\n\nAfternoon – Capt. Vickers on Field Surgical Pannier No. 2 (Calico Jaconet (14 yds.) Irrigators (4) and tubing to match, Bongies (8) & Catheters, Shears, Spirit Lamp for Booril , 8 bottles Booril. Old sheeting, 6 pieces Tape Hones, Razor Strop, , Roller Bandages Gauze Wool Drainage Trays & 3 bowls.\n\nAlso in No. 1 Field Surgical Pannier, Surgical Instruments Perch of Mercury (Corrosive Sub.) Pot Permang. 2 Dregers of Iodiform, 4 bottles of Carbolic Crystals, 1 Candle Lamp & 6 Candles, Corkscrew, 2 Pr. Scissors, Potains Aspirator, 3 lots Drainage tubes, 2 Chloroform Drop Bottles, 2 Hypodermic Syringes with Stricynine, Morphia & Digitlone tabs, a Saline Solution outfit, Stomach Tube, Adhesive Plaster (1 inch), Specification Tallies & Pencils, Methylated Spirits, Sterilise & sodi for same.)\n\nFor 24 hours ended noon we did 269 and am now in 9.27 & 77.8 lat.\n\nThe meat on board has not been up to concert pitch and one of our boys referred to the grease for same as patriotic grease – in fact Red White & blue grease with the Benalla smell.\n","27":"\n\nFor 24 hours ended noon we did 283 miles and now stand in lat. 13.5 and long. 76.2.\n\nVery strong wind blowing all day making the sea choppy.\n\nMess Orderly today.\n","28":"\n\nChurch Service morning.\n\nFor 24 hrs. ended noon we did 280 miles and stand in 17.2 & 72.6.\n\nSent letters to Gus Stephens (photo), Rev. Alick Stephen & Mrs. Martin.\n","29":"\n\nFor 24 hrs. ended noon we did 266 miles and now in 69.2 & 20.7.\n\nLectures by Capt. Vickers.\n\nStorm in afternoon but soon\n\nblew out. Letters to Roy Cunningham and Eddy Hyde.\n","30":"\n\nOn awaking found a strong wind has sprang up during the night and a moderate sea was the result. This became worse as day wore on and the old ship rolled more than was good for some of the boys – one of whom spilt a basin of porridge all over his clothes whilst coming down the stairs.\n\nFor 24 hrs. ended noon we did 270 and now in 22 and 65.\n","31":"\n\nWind had abated somewhat when we awoke and the day turned out pleasant. It was intended to hold sports promoted by Sargents on board but owing to inclement weather of yesterday they were postponed.\n\nDuring morning Capt. Meehan lectured on “Shock \nand\n Unconsciousness\" and Collapse. In pointing out difference between Shock & Collapse he showed that in Shock no loss of blood or fluid was necessary whereas in the Collapse such was necessary. In treating Shock disregard actual injury for time being unless Artery is severed and keep patient warm. Give brandy & coffee instead. In Collapse it was necessary to replace fluid lost by a saline solution either as an enema or subcutaneously.\n\nHysterics – Ammonia on a piece of cotton wool soaked in solution and covered by a towel is a good cure.\n\nEpilepsy – 3 stages, (1) Rigidity, (2) Spasms, (3) muscular spasms.\n\nFor 24 hrs. ended noon we did 250 miles.\n\nLetter to Frank Beston for Cricket Club.\n","32":"\n\nSea much quieter but another small storm approached but soon passed during morning.\n\nDetailed for work in hospital No. 1 for 4 days.\n\nLecture by Capt. Meehan on “Burns\". Does not recommend Carron oil where burn is deep but prefers Picric Acid.\n\nCommenced Hospital duty at 10 a.m. At 10.30 Capts. Meehan & Appleyard operated on a patient for circumcision.\n\nAt 11 Sam & I had to leave hospital and participate in tug of war, 1st heat in which our chaps lost to “B\" Coy. The sports were conducted & prizes given by the Sargents on board.\n\nAfternoon. Our boys (A.M.C.) won the Keystone Drill event with a team comprised of Sam Crook (in charge) Stevens, Davidson, McLean, Trollope, McMahon, O’Sullivan, Woodward & self. The prize was 2\/- each man. Several men on board were eager for snaps afterwards and about a doz. were obtained including one each by Capt. Vickers & Appleyard.\n\nThe most comical dress was won also by an A.M.C. man, Woodman as Chas Chaplin. Sam as a Colonel also competed with 2 other competitors.\n\nFor 24 hrs. ended noon we did 260 miles.\n","33":"\n\nFor 24 hrs. ended noon we did 274 miles and now in 51 & 26 lat.\n\nAttended another operation this morning (abscess in groin).\n\nLetters to M.B., Harry Baldock, home & Jim Smith.\n","34":" (King’s Birthday)\n\nAnd a very different holiday to ashore. In fact we did not know it was a holiday until 9 a.m. this morning.\n\nThe troops were assembled by The Col. and after a little speech cheers were given for King & Empire and the troops were given a holiday for day – except those of us who could not be spared from duty. For the first time since leaving Sydney flags were flown on board except the Australian flag which was also flown when we entered Colombo & during our stay there.\n\nWas on holiday duty all day.\n\nFor 24 hrs. ended noon we did 280 miles and now in 46 & 27, just Sth. of Madagascar. At night a concert was held and our boys (A.M.C.) assisted with a minstrel item under Sam Crook.\n","35":"\n\nFor 24 hrs. ended noon we did 297 miles and now in 41 & 29.\n\nThere was great enthusiasm and rejoicing at noon when the Colonel announced that he had received by wireless from Durban the news of a great naval victory in North Sea. The Germans losing in all 10 ships (3 battle cruisers, 3 light cruisers, 2 destroyers, 1 submarine) & had 2 cruisers disabled. The British lost 1 battleship and 1 cruiser.\n\nThe officers & men during\n\nhad become so excited that at mess they sang “Sons of the Sea\" & other songs.\n","36":"\n\nDuring the night a heavy had churned the sea up some and when we above it was fairly cold & rough.\n\nAt noon to-day we were in 30.51 & 36.9 and did 272 miles for 24 hours.\n","37":"\n\nStill pretty rough and we only did 200 miles for 24 hrs. and now in 31 south & 32 east lat. We are now not more than 20 or 30 miles from African Coast.\n","38":"\n\nThe morning broke beautifully clear & the sea calm and to add interest to our trip we saw land & mountains at that for the first time for over a fortnight and the sight was good.\n\nLater a head wind sprang up and hindered our progress a little.\n\nIt did not prevent us from carrying out a good programme of Sports arranged by Troops. Our first entry was in Best Dressed Squad event. We put in 2 teams (Transport & Bearers). I was in Bearers team. The Machine Gun Coy won the event with our Transport second.\n\nWe won our heat in Tug of war. Won Semi Final against Reg. Transport but were beaten in Final by “B\" Coy tho’ the time between the Semi Final and Final was barely 5 minutes. Our team in Final \nWe\n was Sgt. Meadows, Trouthern, Privs. Carroll, Piercy, Aspbury\n\nZocchi, Fox & McLean. We entered a team in Keystone Drill competition with 6 \nmean\n men, Messrs. Sam (as ‘Mephistoples’) Stevens (‘Robinson Crusoe’) McLean (‘Scotsman’) Woodman (Convict) Daley (anything) West (mixture) & self (Marmarlade & soldier half and half).\n\nWe lost to Machine Gun Co. who were A Keystone band. But McLean brought for us the “Most Comical Dress\". While all this was going on the No. 1 Hold was on fire and a quantity of wheat burnt. To quell the fire the ship had to be turned completely round for half an hour.\n\nBy night the fire had been controlled this making \nthe\n about the fourth occasion this boat had caught fire, twice on this voyage though the previous one was hushed up.\n\nAt night we could see a lighthouse & lights of a town (Port Elizabeth).\n\nFor 24 hrs. ended noon we did 316 miles and now 26 & 34 sth.\n\nField \nmade\n Surgical No. 2 Pannier.\n\nIn lid – 4 yds Waterproof Jackonet . Body of Pannier, 2 icebags, Basins enamel, 2 tin coppers, Dressing trays, bougies (case), 12 yds calico, 1 case catheters, 2 bones, 1 strop, 4 irrigators, 10 yds jackonet, meat extract (8 jars), shears, 4 rubber tubing, food warmer. Tin A, 100 bandages, “B\" Wool 8 lbs, “C\" Gauze 130 yds.\n\nReserve Field Medical Panniers 1 & 2.\n\nTop Aromactic Spts. Ammonia, Chloroform, Carbolic Acid, 2 Hypodermic, 60 ozs Castor Oil, Catgut Sterile 30 ins. (12 tubes) 20 – (2 lb) tubes, Chloform, 5 Corrosive Sublimate, tongue depressor, 3 dredges ioform, Lysol 91&percnt; 6 tubes Pot Brom. (gr. 5 – 450 tabs.) 2 pr. scissors, Sterile Silk thread (20 tubes) Sodi Bicarb (10 gr. tabs.) Sodi Sal. (2 containers), Soft Paraffin 2 lbs, Dover Powders (5 gr.), Cough tabs., morph Tartrate Tabs. ¼ gr. calomelin lead opium No. 9 Pils, Zinc Sulphate, Pot. Permang. (2 gr.) Opium (gr. 1) Vegetable Laxative, Thermometers (18) Tr. Chloromyne, Morphine (10 grs.). Under Tray right Mag. Sulph. (60 grs. tabs) Morph. Tartrate (4 gr.), Needles (2 sewing 36 surgical), Silver Nitrate (1 case), Hernisine (4 tubes). Tray left 18 tins safety pins, 12 eye shades. Strapped in lid, 4 yds. jackonet. Tin A, 2 icebags, 12 carbolic soap. Tin B, 2 chamois, 6 pieces tape, 6 test tubes, 8 drainage tubes. Tin C, notebooks, 2 Specification Tally, 2 boracic acid (2 tins), 2 corkscrews, 50 envelops mustard leaves, packing needles & thread, writing paper, 8 pencils, screw driver, sterile gut & assorted gut.\n\nField Medical No. 2.\n\nBasket “A\". Shears, drainage tube, food warmer. Basket “B\", meat extract, 6 spool plaster tape, 2 tourniquet. Tin 1, gauze 95 yds, Wool 3 lbs. Tin 2, Calico 4 yds, flannel 1 yd. jackonet 6 yds. Tin 3, calico bandages 60, Triangular 24.\n","39":"\n\nFor 24 hrs. ended noon we did 170 miles and now in 34 sth. 23 East.\n\nStrong wind blowing & freshened to a gale in afternoon which brought up the sea and it was soon running very high. So hard was the gale blowing that \nfrom noon\n we only did 29 miles.\n\nDuring the night we stopped altogether as we were shipping too many seas forward and the faster we travelled the more we shipped. So all we did for a considerable time was to keep \nhed\n ‘head on’.\n\nCleaning port side hospital with Rutherford.\n","40":"\n\nIn early morning the gale abated a little and continued better throughout the morning but after noon it commenced again and by nightfall was blowing worse than ever and to see the seas coming over the nose was a good sight.\n\nIn spite of this not many were sick as most of us were now quite used to sea. At noon we could see land (Cape Agulas) and still have about 150 miles to go. We only did 140 miles for 24 hrs. and now in 34 sth. & 20 East.\n\nPassed a couple of small boats fairly close.\n\nHad a medical inspection this morning & yesterday in search of fresh measles cases.\n","41":"\n\nThe sight that met our eyes on awakening this morning was one I\n\nCapetown\n\nshall never forget.\n\nWe were only a couple of miles from land. On the right was Lion Mountain, in the centre covered on the top by a large cloud was the famous Table Mountain & on the left was Devils Peak, while lying at the foot of Table Top \nwas\n could be discerned Capetown itself. Close to the sea’s edge was a town which we mistook for Simonstown but afterwards found it was part of Capetown called Sea Point.\n\nThe top of the mountain was hidden in the clouds most of the morning and those on board who had been here before could not recognise the place for that reason.\n\nThe pilot had some difficulty in getting aboard on account of the swell but once aboard we were soon on our way to a berth.\n\nIt was noticeable just here that our wireless was dismantled according to Port regulations.\n\nWe were some time in berthing as the accomodation is not easily accessible but during all this time we were given an excellent reception by the Regulars on duty and the two mail boats which were berthed on either side of us. One going to New Zealand and Sydney left just after we arrived and we gave them a cheer as they were leaving. The din at the wharf will always be in mind. The boys were to have a route march at 2 p.m. so I\n\nobtained special leave from Capt. Appleyard to search for Uncle Joe & Aunt Lu Cockroft who have lived here in Capetown for some years. Obtained likely addresses at Post Office and visited three different localities before finally finding them at 7 St. Georges Terrace off Clyde Rd., Green Point, Capetown, S.A. Cannot express how surprised they were to see me yet at the time I recognised \nknew\n them all except Mina who had changed. Uncle & Aunt, Reg, Winnie, Mina, Lil (Wildman), a boy friend who had been to \nEast\n West Africa and wounded thro’ body. He was Warrant Officer Connell. A Miss Ditchfield (Elsie) was also spending the week end with Winnie.\n\nHad an excellent tea and during the while talked over home matters.\n\nMy leave was to expire at 8 p.m. So the girls and Unc. accompanied me (together with W.O. Connell) to the wharf again and the W.O. endeavoured to obtain additional leave but without success. \n\nThe route march lads were taken directly to ship and not allowed any leave ashore. Took advantage of my stay ashore to make a few purchases (necessities) and found that Australian money either notes or silver could not be used without exchange (1\/- on &pound;1 notes).\n","42":"\n\nRaining early morning.\n\nThe W.O. (Connell) was to come aboard at 10 a.m. to obtain\n\nleave for me but at 9.45 we were sent on a route march thro’ the town and on the conclusion of the march the W.O. together with Winnie, Reg, Elsie Ditchfield met me on the wharf when general leave was granted to 4 p.m.\n\nI immediately accompanied them to their home and had an excellent dinner followed by a sing song.\n\nSoon the time came to leave and they would persist in me taking cakes, reading matter, an excellent brown scarf (from W.O. Connell), a couple of doz. oranges, a mirror, pen knife, in fact anything I needed.\n\nMina, Lil, Reg & Uncle then hired a taxi & accompanied me to the boat again in drizzling rain.\n\nSoon after arrival on board a muster roll call was held and only three of our boys failed to answer. They subsequently arrived at 6 p.m.\n\nAbout this time another troopship “Beltana\" arrived with 36th Battalion and 10th Field Ambulance and the cheers that were exchanged were deafening. Posted letters to home & M.B. No more leave was granted tonight and as messages were being exchanged between the new troopship and ourselves it was very late when we turned in.\n","43":"\n\nBefore \nthe\n daylight we made preparations for casting off again and by breakfast time we were out in stream again close to the “Argyllshire\" which had been there for about 5 days. Later in the morning Lieut. Col.\n\nMaguire our O\/C paid us a visit from the “Argyllshire\" on board of which were our A Section.\n\nWe cannot see the mountains or the city at all now as a thick mist has completely blotted them out.\n\nCapetown\n\nDuring my short stays on shore and the route march of yesterday I had a chance to see some of the City and was very well pleased with the surroundings and the management of the City. The policemen are dressed a little different to ours and seem to be mostly Dutch people. We were told that there are seven black to every white here and it just about looked it. The trams mostly double deckers seemed to run very frequently to the different suburbs.\n\nI had runs to Russell St., Tamboerskloff and part of way to Sea Point in the trams.\n\nOther trips were Wynburg, Kloff St. & other places. The trains run from the Docks to Sea Point & runs through the streets in some places.\n\nThe Town Hall & General Post Office are good buildings as also the Musuem & Public Library.\n\nThe streets are well kept and sanitation excellent. Electricity seems to be universally used even in suburbs.\n\nThe Pier (a new one) is the pride of Capetown and on it they hold Promenade Concerts. There are two main \ntheart\n theatres and Ethel Irving was acting at one.\n\nIt was only on our arrival at Port that we heard the very sad news and big loss by Empire by the death of Lord Kitchener who was on board the illfated “Hampshire\" which was mined while crossing Channel on 5th inst.\n\nWe also got more news of the Naval Battle and it proved to be a \nbetter\n bigger battle than anticipated. We here tonight that 14 British and 40 German boats were sunk. Also received the good news of a Russian offensive in which 65000 of the enemy were captured.\n\nHad a very quiet day today and no leave was granted. At night however the “Marathon\" with Headquarters staff and Brig. General Jobson on board came into port and we gave them a great reception. They dropped anchor near us for the night.\n\nReceived a letter from Mina (cousin) from Capetown containing a Golliwog as a mascot and answered it.\n\nThe view at sunset or just after of Table Mountain was excellent and we could see the whole mountain for first time.\n\nBut the view at night with the thousands of lights of city with the mountain as a background was truly wonderful.\n","44":"\n\nVery quiet day. Made nather insistent application to obtain leave but Major Hunt to whom we were paraded promised us satisfaction. We never heard any more of it that day.\n\nWe are expecting the “Hororata\"\n\nin any moment with the balance of 9th Field Ambulance. To-day’s weather was beautiful and mild and we also got an excellent view of Table Mountain.\n\nReceived a letter from Miss McLauchlan of Burwood. It had been addressed to Liverpool after we left.\n","45":"\n\nMen who were late arriving on ship on \nSaturday\n Sunday were nearly all put on 14 days fatigue and had to “fall in\" on each occasion the “Defaulters\" blew. At Colombo it was similar and it was a common thing that when the bugle blew the boys called out “Colombo\" to the defaulters. Now they called out “Capetown\". Day passed quietly. No leave granted.\n","46":"\n\nLeft ship at 10 a.m. with the balance of our Section on board in addition to “A\" & “B\" companies and were run ashore in the picket boat and a lighter.\n\nThen followed a long route march probably 14 miles to Camp Bay via Sea Point and Three Anchor Bay.\n\nOn arrival at the Bay we were allowed two bottles of lemonade each having already a ½ lb. biscuits in our haversack. After an hours rest we commenced the return journey feeling very tired in legs as could be readily understood after the past 7 weeks rest. Arrived at Wharf at 4.30 again.\n\nOn trip back to boat we saw what we surmised was the “Demosthenes\" which arrived\n\nlast night.\n\nDuring the march we were greeted everywhere by the people in an excellent manner and several people handed & threw cigarettes and oranges to the boys. Major Hunt & a Captain in South African Forces (on horseback) led the march.\n\nThe Bay is an excellent little place for a picnic but would be more enjoyable by tram which runs out from town in about an hour.\n\nDuring the journey we saw “Silver Leaf\" growing wild in the mountains. Sent some of the “Leaf\" home and to M.B. Got a small supply of peanuts very cheaply at wharf from a Kaffir.\n\nAt night an auxillary cruiser the “Laconia\" arrived.\n\nOur ship hastily took on stores until a late hour.\n","47":"\n\nWe ascertained early that we would sail again at 10 a.m.\n\nPriv. Farquhar & self paraded before Capt Vickers for leave to see relations \nbut\n and it was in this way that we learned the above.\n\nI was extremely unfortunate regarding leave to see Uncle & Aunt as although I applied each morning since Sunday I was not successful.\n\nAt 10 a.m. we got under way and the sight if seen from land must have been an impressive one.\n\nPassing the H.M.S. Kent which only came in this morning we all stood to attention in silence while their whistle band played patriotic airs. The “Beltana\" (a sister ship to us) which only came out of\n\nquarantine this morning led the way followed by us then the “Marathon\" and lastly the “Argyllshire\". The cruiser however took the lead soon after we got going.\n\nA very thoughtfull little sendoff was given by the local people at Sea Point by flashing mirrors to us and there must have been about 2 doz. of these.\n\nIn afternoon I had the job of plastering brown paper over all the hospital ports to prevent us being seen at night time and it was pleasing to see that nothing was left to chance. Therefore at night every port on ship was shielded and no lights were allowable at all on the ship unless shielded.\n\nPlaces worth remembering at Capetown were Bristol & Grand Hotels, The Trocadero & Maxims Cafes, Attwels (Breadmaker & Biscuit maker). The Fort also which we passed yesterday has a good position & manned by Englishmen. Streets (main), Adderley St., Strand St., Plein St., Long St., Darling St., Kloof St. \n\nDuring the day we ran into a heavy swell.\n","48":"\n\nThe swell became worse during the night and by morning was terrific and as day wore on it did not improve.\n\nIn fact it became worse and as a consequence we rolled more than we have done during the voyage. Quite a number of accidents occurred and though nobody\n\nwas seriously hurt we lost quite a lot in medicines etc.\n\nOn one occasion I was coming down stairs with a thermometer in one hand and the ship lurched so much that I missed my step and ended at the bottom in a heap without breaking the thermometer and only sustaining slight abrasions on right arm, ankle and left hand. In main hospital the medicine chest was upset and a patient suffering from suspected appendicitis was thrown on the floor and sustained slight injuries. I was unlucky enough to be on duty all day in No. 2 Hospital and our endeavours to keep our feet there were peculiar. Now at night and one cannot see his hand six inches in front of his face and we are just beginning to realise that we are nearing the danger zone.\n\nThe food have improved of late and is now satisfactory. Purchased pair of sandshoes (second pair) since left Sydney.\n","49":"\n\nVery quiet day. The cruiser dropped right to the rear to the “Marathon\" (which was about 10 miles back) and in the afternoon came up to the front again passing very close to us.\n\nIt is very noticeable the amount of sleep one requires on the sea and one could easily sleep from 9 p.m. until 6 a.m. every night if undisturbed. But such\n\na thing never happens as with noise etc. we never get to sleep before 10.30 or 11 p.m. and am awakened before 6 a.m. by swabbers etc.\n\nPat Day injured his knee rather badly today by falling on deck and at night I bathed it for about an hour in hot water.\n\nBand learning some new selections and “The Manhattan Beach March\" and “Moonlight Bay\" are well known at present in Sydney. Also “Fox Trot\" from “So Long Letty\". Received news of fall of Czeroveith and capture of large number of Austrian Prisoners.\n\nHave traversed 1483 miles since leaving Capetown up to noon today and 11000 miles odd from Sydney to date.\n\nObtained some information from a patient from Orderly Room (Sergt. Major Hopkins) relative to \nship\n transport of troops. He informs me that the shipping Company obtains &pound;500 per day and in addition 1\/6 per day for food for men, 3\/3 for Sergeants & 6\/- for officers each. A canteen is run by a ship’s steward (privately) who sells beer which cost him 3\/- doz. at 12\/- doz. thereby making 9\/- clear profit on every doz. sold.\n\nHe also charges 4d. per glass for lime juice which was down on list as a free issue to troops.\n\nCigarettes. He charged","50":" per tin and we could obtain a similar quantity of same brand for 10d.\n\nThe Sergt. Major also explained the reason for going slow after leaving Colombo. It appears the ship’s Captain had instructions to go 3 days in the usual direction to Suez before turning south. As will be seen by previous notes he turned south after going about 60 miles saving thereby some hundred pounds worth of coal.\n\nThe ship’s people accused the Sargents Mess of losing &pound;30 of crockery, plates, etc. while there were hardly more than 30\/- worth in whole mess.\n","51":"\n\nStill working on Measles Isolation (German measles) and cases are coming in very fast. There are now about 30 in hospital suffering from this disease.\n","52":"\n\nCrossed Equator for","53":" time.\n","54":"\n","55":"\n\nMost of the boys on board are trying to study French in anticipation of going to France to train. Received by wireless today some very good news. Russians pursuing Austrians now through Bukovina and at foot of Carpathians. Italians defeat Austrians in Trentino, lull at Verdun but British penetrated German line in 10 places the Munsters & Anzacs coming in for special mention.\n\nWeather unsettled all day and cool for this part.\n","56":"\n\nSighted land at about 9 a.m. and entered the Bay outside Dakar Harbour, French Senegal, Africa at about 11 a.m.\n\nDakar, Senegal, Africa\n\nWhen nearing the Bay we advanced in single file. First the “Kent\" followed by “Beltana\", “Argyllshire\" ourselves and Marathon in that order. We could see another warship in the Bay and ascertained that she was the battle cruiser (British) Swiftsure. There was also a French battleship but could not find the name. We anchored outside for some hours and one by one entered the Harbour which struck us as being very similar to Colombo Harbour, chiefly I suppose because it was formed by a large breakwater with a small entrance. There were also a few merchantmen and soon after we arrived the “Italian\" from the Cape to London came in.\n\nOf Dakar itself – From our position which we took up during the afternoon the town seemed very pretty, the Government Palace and Terraces near water were very distinctive. Like Colombo again the houses all had red roofs.\n\nThe natives (Sengalese) were a healthy specimen and left the Cingalees in the shade in that direction. They seemed more industrious too.\n\nCape Verde with the Island jutting out could be seen quite well also the other Island (well populated it looked) which the natives told us was a convict settlement was quite close.\n\nTowards night they put a gun (4.7) on our poop deck and 50 rounds of ammunition to boot. This necessitated the moving of our flagstaff a little.\n\nTwo men also came on board as a gun crew (one from H.M.S. Revenge). Cannot say where the “Revenge\" is now. An operation was successfully made by Capt. Appleyard on a patient suffering from appendicitis.\n","57":"\n\nStill at Dakar. Some more merchantmen came in the Harbour.\n\nPurchased some post card views and local stamps. Ascertained that the gunner from H.M.S. Revenge was 25 years in Navy and is now a pensioner but was mobilised on outbreak of war.\n\nAt 6.30 p.m. we began to move out. The “Kent\" had left half an hour earlier but cannot say whether she is coming with us or not. Then came the “Swiftsure\" followed by the transports in the same order as heretofore. Passed Cape Verde lighthouse in the dark about an hour later.\n","58":"\n\nOn looking at the position of the boats in the early morning the “Swiftsure\" was leading but “Kent\" was not visible. I afterwards learnt that the reason she left Dakar about same time as us was a little headwork on the part of Naval people.\n","59":"\n\nTo-day turned \nbitter\n very cool with a very fresh headwind consequently several of boys got chills and I got off with slight\n\nnose cold. It was an exceptional change after the heat of yesterday and before morning church Service.\n","60":"\n\nAs a result of a chill sustained yesterday two of our mess had to go into Hospital – Geo. Handley (Temp. 102) & Ken Bolton (101). This morning we received our first impression of a gun firing. We received word that at 10 a.m. two shots would be fired by our 4.7 for testing the bore etc. so at the appointed time a good number had congregated as near the gun as possible. Then came the shot. First like a flash of lightening \nand\n together with a tremendous roar which deafened us for quite a while. And everything on the ship shook with vibration by the concussion. I took good care the second shot to put fingers into both ears. We saw both shots hit the water about 1000 yds. away.\n","61":"\n\nDuring the morning the cruiser lowered a boat & later went back and picked it up again. The reason was not apparent.\n\nThe hospitals are now crowded out with patients and all available spaces on board are utilised for patients.\n\nSaw a full rigged barque on the \nhozi\n horizon.\n\nSent several cards & letter in to be censored.\n","62":"\n\nMail closes.\n\nDuring the morning we sighted what appeared to be the mast of a vessel and the cruiser went out to investigate. As it did not move we came to\n\nthe conclusion that it was either a derelict or a decoy ship as she was flying the white flag. The warship approached cautiously and after we had passed poured about eight shots into it. (She had apparently made inquiries but we were not close enough to see.) The shots from where we saw them were not heard at all but we saw the guns flash. The mist was still visible when we crossed the horizon out of sight leaving the cruiser behind. She rejoined us travelling at an enormous speed later in the afternoon.\n","63":"\n\nReceived instructions to wear our lifebelts from 6 a.m. this morning and not to remove them at all during the day. This to be done until we disembark. It was strange to see the men running round with their belts on. We were beginning to notice the twilight now and it was a novelty that darkness should not fall until about 8 p.m.\n\nFull dress parade this morning. \n\nOur rations (Jam & butter etc.) seem to have been short of late and to-night we only received about six ounces. In addition the fish was rather high for tea and in our tea we found the end of a cigarette.\n","64":"\n\nDuring day we sighted water spouting about hundred yards away and our first thought was of whales but was informed that they were another type of fish.\n\nFor tea we had tripe for first time.\n\nAfter tea a sail was sighted on the horizon straight ahead. We came upon it a couple of hours later and \nfought\n found it a French barque (small) and it dipped the tricolor as we passed. It was a good sight and passed it with the boat between us and “Bentala\" . It was not moving and had apparently struck a calm.\n","65":"\n\nWas very interested and pleased to see the destroyers we had been expecting and they look an excellent sight. There were four of them all told \nand\n one to each transport and they simply ran round us so fast were they. They they not been with us very long when the “Swiftsure\" turned back and disappeared over the horizon. Then \nwe\n a race for port began. The “Marathon\" surprised us all by taking the lead easily followed by “Bentala\", our boat and the “Argyllshire\" & during the day we dropped to last place and the “Marathon\" out of sight. But it was only temporary and just before tea we spurted and caught the Argyllshire. It appears that our Captain had some trouble with the stokers.\n\nDuring the night the old ship seemed to throb with life and we felt sure she was travelling some.\n\nPassed several craft about twilight.\n\nHad the job of swabbing out No. 1 Hospital.\n\nSunday 9th\n\nWas not surprised when we awoke to find we were\n\nEngland\n\nrunning a good second after the night’s effort and \nwere\n was still gaining. The “Argyllshire\" which was like a speck was last.\n\nAbout 9.30 we sighted land which became plainer as time wore on.\n\nSeveral boats we seen about and through a glass, it was marvellous the amount of traffic in spite of war & danger from submarines. Church Parade.\n\nIn time we drew close to land and put in behind the breakwater at Plymouth before dropping anchor. Not until then did the destroyer leave us.\n\nAs the sea trip has ended safely a summary and resume of trip is appended.\n\n5 men (one of them Freestone related to Ernie Pullen) were attached as A.M.C. detail to 35th Batt. In Mess 78 (our neighbours) we met some very decent chaps attached to Regimental Transport attached also to the Batt. including Messrs. Sargt. Phillips and Privates Hugh & Will Scribner, Harry and S.O.S. Craven, Snowy Hudson, Godfrey Arthur Sommerville, McCullough, McKinnon, Heskith (late of Randwick Hospital) Hawkins, Thompson, Roe & others.\n\nThree epidemics occurred, influenza (2 different stages) and measles on the trip. The ship’s men we very uncivil and \ndid\n not very obliging to the men and could have done a great deal of good by small kindnesses\n\nsuch as hot water etc. The hospital accomodation was poor and during the latter part of voyage one day shewed the following list of patients – No. 1 Hospital 60, No. 2 Hospital 8, No. 3 Hosp. 8, Poop deck 20.\n\nIn conclusion the food was badly cooked and in some cases of poor quality – potatoes & bread being particularly noticeable. The bread and steam puddings also were doughy nearly the whole of time and in addition carried a peculiarly unsavoury “Benalla\" flavour as also did the breakfast which few orderlies bothered to draw.\n\nThe fish was not edible. But, jam and sugar were all good.\n\nThe meat to Colombo was wretched but subsequently improved. The rice was not cleansed before cooking and consequently turned out gritty and black in color. The same applies to cabbage.\n\nThe cheese ration when available was good.\n\nHave already commented elsewhere on canteen.\n\nDuring the voyage which lasted from 1st May to","66":" we covered 16564 miles which is made up as follows, Sydney to Colombo, 5308 approx., Colombo to Capetown, 4733 approx., Capetown to Dakar, 3723 approx., Dakar to Plymouth, 2800 approx.\n\nThe bugle calls were as follows, 6 a.m., Reveille, 6.30 Swabbers, 7 sick parade, 7.30 breakfast, 8.30 swabbers, 8.45 guard, 9 general parade, 10.30 assembly and\n\nPlymouth\n\ngeneral inspection, 12 cease parade, 12.30 dinner, 1.30 swabbers, 2 p.m. general parade, 4 cease parade, 4.30 sick parade, 5 p.m. tea, 5.30 sunset, 8.45 first post, 9 last post, 9.15 lights out.\n\nMy first glimpse of the old land was one of surprise and amazement. Surprised because it was altogether in excess of what I had expected and amazed at the excellent way every spare piece of land seems to be cultivated.\n\nThe Marathon had unloaded her burden before we arrived so the pretty ferry boats got to work at once on us with the result that in about an hour & half all the troops were on ferry boats.\n\nOur boat the last got to the Great Western Railway Wharf in time to see the sixth trainload leave. \n\nJust here it might not be astray to mention places of historic value which we saw. The first was the old Eddystone Lighthouse which had been transported to the hill. Close by was the bowling green that \nDrak\n Sir Francis Drake played his memorable game prior to fighting the great Armada and in a small bay was some old types of boats used in Nelson’s day as warships. \n\nAfter a considerable delay we entrained in a third class carriage (eight in our compartment) and enjoyed a well earned rest and spell from our packs and baggage. Just here we noticed the\n\nthe people (civilians) peering at us over walls and through the wharf gates all eager to welcome us.\n\nAt 9.15 we commenced our journey and such a journey. It easily took first place. It would be impossible to describe in writing our admiration of the excellent views & scenery that was portrayed to us during that run. It was altogether different from our Australian inasmuch as it was cultivated and the coloring was unique from dark green to yellow and separated by the hedges which were altogether strange to us with the exception of a few including Jim Piercy and Ted Ridge whose came from England and who could not hold their delight at again visiting the \"old Dart\" at a time when – they said – it looked at its best.\n\nAs we progressed it was \ncompetating\ncompensating to know that someone cared for us for all along the route were thousands of people who cheered themselves hoarse as we passed thro’ and this went on until we felt quite at home.\n\nAt any rate it continued until dark and that is saying a whole heap for these nights altho’ it seems funny the sun doesn’t set until near 9 p.m. and it is quite light until near 10 o’clock.\n\nThe nights here are our only stranger and many of the boys remarked that they forget to push the \n\nsun down to time here. Oh! I forgot also that we have another stranger altho’ not pronounced and that is the Daylight Savings Bill. It appears under this Bill that the clocks are \nput back\n altered an hour in summer time and adjusted in September each year. At any rate we arrived at Exeter which was to be our first stop and there the Mayoress of Exeter had prepared an excellent cup of tea and refreshments each. In each bag of refreshment was a small card wishing us good luck and it was indeed a God send which the boys appreciated by giving three cheers as the train left again.\n\nI am not a very good train sleeper so during the journey from Exeter passed the time by playing “Five Hundred\". \nwhich\n It was about a quarter to midnight when we left Exeter and so quite dark. In due course we got to Salisbury and stretched our legs. It was then 2.45. We arrived at Amesbury our terminus about half an hour later and did not feel inclined for much work. To add to our discomfort as we lined up on the station it began to rain but did not last long. It was then quite daylight again. Out kit bags we stacked and after marching a little we felt refreshed but\n\nSalisbury Plains\n","67":"\n\ndid not bargain for the march that ensued. We passed thro a village which was very pretty and reminded me of France.\n\nWhen at last we arrived at Larkhill Camp we were perspiring and standing as did in the rain which followed we felt quite miserable.\n\nIt was not until about an hour afterwards that we were housed in our hut \nand\n that we felt better and \nthat\n this was helped on when about 9 a.m. we had breakfast of Bully beef and biscuits and a cup of tea.\n\nI suppose we should have slept but I was aching to have a look round and consequently although tired I in company with a couple of others had a walk and saw what a huge place this Camp is (Salisbury Plains). We learnt afterwards the the Plains Camp is 60 miles long by 40 miles wide, has in it 60,000 huts and has accomodation for 3½ million troops. It is reserved exclusively for Colonial troops and there are at present Australians, N. Zealanders, Canadians & Sth. Africans here. It is also comforting to know that newspapers are so easy to obtain. This was a thing we missed at sea.\n\nOur Camp (Larkhill) has as far as I can see about 30 small Camps in\n\nit (carrying approx. 30,000 men) and it is surprising the conveniences supplied. Each hut carries 30 men and each man is supplied with 4 blankets and a miniature wooden floor bed about 6 inches high. The huts are made of four-ply wood.\n\nThere are also innumerable canteens, latrines, Y.M.C.A. halls, picture shows, dining rooms, canteens, showers (hot or cold) and sundry shops. The transporting is done to the Camp by a light rail and thence by Imperial A.S.C. men. I hear to day however that our A.S.C. are taking even this work over soon.\n\nI obtained a set of views of surrounding villages and at night despatched them home & M.B.\n\nIn the afternoon we heard of the historic Stonehenge where the old Druids Temple used to be and consequently Gil McCauley and I went over to explore. We soon found the place with a policeman on guard and came away with P.C’s of it. The thing that impressed me most was the huge masses of stones that were suspended on columns about 20 feet high and the question arose as with the Pyramids in Egypt, “How did the stones get there\".\n\nAt night Geo. Handley & I went for a stroll to Durrington a small village about 2 miles away where every man seemed to be on some\n\nmilitary duty.\n\nReceived full particulars of an offensive by French and British which commenced on 1st July.\n\nWent to bed about 9 and knew no more until about 9 next morning.\n","68":"\n\nWhen I awoke it was to see A Section boxes from the Argyllshire who had come into camp last night. They seem to have fared better than us on ship.\n\nWas detailed to unload some of our medical stores with seven others and that occupied the best part of day. During the time however we chatted to some of the “Tommies\" and got on very well. Met some and changed my cap cover with one.\n\nTo night \nRupert\n Dick Gates, Scotty Maxwell & others of the “Hororata\" which we had missed for some time came up to see us. They had come via the Suez Canal and got here a couple of weeks ago. They had just been to London and told us of the good things in store there.\n","69":" \n\nCommenced work again in earnest. The place calls to mind happenings of the front when we \nhere\n hear the tremendous reports when the Artillery are practising and the aeroplanes flitting overhead.\n\nIt is also very noticeable that a good deal of transport in Camp is done\n\nby mules.\n\nDrizzling rain early in afternoon.\n\nLater went for a stroll up to Y.M.C.A. and met several friends – Fred Ellis of M Ward, Liverpool and some “Hororata\" men – Bill Hampson, Corp. Mooney & Allen. Also chatted to the two Cravens of Benalla A.S.C. Detail.\n","70":"\n\nMess Orderly today.\n\nThe 20 men from Hororata joined us today.\n\nThis morning Capt. Vickers took us for a route march as far as Stonehenge and explained the history of place.\n\nHurrah! we were all pleased tonight for we received our first mail and it was splendid.\n\nDespatched a letter to Bro. Ernie C\/o High Commissioner, London.\n","71":"\n\nThe boys were allowed three hours to do washing and mending.\n\nSaw 67 food and ammunition motors on way to Devonport to be shipped to Salonika and they were an excellent sight. They seemed to be all Fords.\n\nAlso this afternoon saw about twenty large guns and detachments Royal Field Artillery.\n\nMet Fisher of Water Board. He is a Sargent and just come from Egypt.\n\nAlick McKinnon & Bob Weir left for France today.\n","72":"\n\nWriting nearly all day.\n\nAt night we visited Durrington Church and a pretty service\n\nwas in progress. Also went as far as Bulford later.\n\nDespatched fourteen letters to go by Vancouver mail closing tomorrow.\n","73":"\n\nNight. Trip to Amesbury – very interesting village.\n","74":"\n\nReceived Referee from Harry Baldock.\n","75":"\n\nPay day.\n\nLecture from Capt. Meehan. Each man 5½d. day is allowed while in Camp for extras by Imperial authorities. In addition we derive 10&percnt; of all \nprofits\n money received for articles purchased in our Canteen including liquor. Regarding refuse marrow bones for which we receive &pound;7 ton are used for making tooth brushes for Army.\n\nCooked bones (&pound;5\/10\/- ton)for extracting glycerine for munitions. Dripping &pound;2\/2\/- cwt. and \nother\n bread &pound;3\/-\/- ton.\n\nThursday\n\nAfternoon. Route march to Durrington & Figheldean. Easily our most pleasant route march to date.\n\nWhilst halted on the road some school children passed and the boys threw them pennies. The first little girl who superceded the main body went away with 4\/- in pennies.\n\nNight. To Amesbury for a walk.\n","76":"\n\nRoute march to Amesbury mile post.\n\nAfternoon. Kit inspection.\n","77":"\n\nNot too well. Caught cold whilst resting on yesterday’s march.\n\nHowever in a race for home after a route march we\n\ndefeated “A\" Section – they being the challengers.\n\nThe last three days have been very hot and have seen the sun all day.\n\nA brand of cigarette called “Woodbines\" are sold to us here at 1d. per packet of 5.\n","78":"\n\nPlayed “A\" Section a game of cricket during afternoon and our Section (B) won by 135 to 67. For “B\" Lawless 30 odd, Zocchi 30 and McMillan secured the runs for us and Eric Cunningham (6 wickets) did bowling.\n","79":"\n\nMorning – Church in Y.M.C.A. Rollestone – Harold Williams sang.\n\nNight. Church to Durringstone Church again. It is noted that church in this part of England commences at 6 p.m.\n\nDuring the day making preparation for our leave which commences tomorrow.\n","80":"\n\nUp early. Clean up, shave etc. and was in our places fully dressed at 7.30.\n\nLeft Camp (both Sections) at 8.15 and marched to Amesbury Station in hot sun.\n\nWithout delay into train – our party of 6 travelled 1st Class as there was no room in 3rd Class for us.\n\nPassing Gratley we stopped at Basingstoke also at Fleet and Bifleet. At Farnboro’ we saw an aeroplane crossing the railway line \nabout\n above us.\n\nThe scenery all the journey was again very pretty.\n\nWhen nearing the suburbs of London it was very noticeable how thickly populated it is. Close to London passed Wimbledon\n\nOn Leave – London\n\nwhere Brooks & late Anthony Wilding have won the tennis championships for us.\n\nArrived at Waterloo Station, London at about 10.30 a.m.\n\nWe at once noticed the age of most of buildings and also an absence of brick buildings – nearly all stone.\n\nFrom the train we could also see the Thames, Statues and Parliament House.\n\nAfter detrained to marched thro several streets – crossing the Thames – to the Australian Headquarters at Horseferry Rd. After receiving our instructions we were dismissed.\n\nBill and Eric Cunningham, Joe Ashbury and self soon got together and made enquiries as to trains etc.\n\nBeing referred to Midlands Railway at Kings Cross we journied there on top of motor bus.\n\nEdinburgh\n\nFrom there to Euston by taxi we arrived just in time to obtain a few sandwiches and get our train which left at 2 p.m. for Edinburgh but could not obtain a seat.\n\nWe had had no dinner so devoured the sandwiches & sausage rolls which we had time to purchase.\n\nSoon under way and as we had to average 50 miles hr. \nper\n for the journey we \nwere soon\n made the pace. Our journey was 400 miles long and had to be done in 8 hours.\n\nRugby was our first call thence across to Crewe, Preston, Carlisle and Princes St., Edinburgh.\n\nPassed Wigan of football fame on the way.\n\nThe scenery all the trip was\n\nexcellent and getting into Scotland the hills covered with green grass looked well.\n\nIt was peculiar to see the Beechams Pills Advertisement which marked the boundary between England & Scotland. Met some civilians in train (elderly) who were full of praises for Billy Hughes and Australians in general. Nearing Preston we sighted a balloon.\n\nJust across the border we came to the sharp incline said to be the highest climb in that part of country.\n\nOnce on the summit we went down the opposite side at about 80 miles hr. Crossed the River Eden on about three occasions. On Preston Station we obtained a glass of lemonade for 1d. Arriving at Princes St. Edinburgh about 20 minutes late but glad to get there, we were met on Station by Bill’s brother Robert and father. Was guided to the home by Robert and there met Mrs. Cunningham. She was extremely pleased to see us and could not do enough. Address, Valleyfield St.\n\nAfter a nice cup of tea we went to bed at 1 a.m.\n","81":"\n\nDid not rise until 8.30 a.m. and was glad of the rest.\n\nAfter breakfast the whole party of boys left house and had a good hunt round.\n\nAfter looking through the principal Street (Princes St.) which is one of the best streets I have seen we went to Edinburgh Castle which of course was\n\ngarrisoned at this time. The zeppelins had paid a visit some weeks back and tried to damage Castle but without success.\n\nThe Castle is situated in an excellent position and must have been hard to take in olden days.\n\nThings of interest in Castle were Queen Mary’s bedroom, the state prison, the Argyle Tower, huge Cannon and balls about 2 ft. in diameter. The Banquetting hall was full of old relics – armour, spears, banners, guns, etc. and also quaint glass windows. In it also was the gun carriage on which the remains of Queen Victoria was carried to her grave.\n\nThe view from Argyle Tower of the town was splendid – Princes St. Gardens looking exceptionally well.\n\nThence to St. Giles Cathedral another imposing building and late to Parliament Houses which are now used as Court of Justice. There was a case in progress and we sat down in gallery and listened to proceedings a little (Re motor accident). From there to Victoria League Club – a club for oversea soldiers and found it an excellent place with every convenience. There we had a good dinner. The ladies give their services voluntarily. After wash etc. we proceeded to the mound where we met Robert and had another look round Princess St. after which we had a shave.\n\nCalling into the Arcade off\n\nPrincess St. we purchased a few postcards and two Glengarry badges which I forwarded – one to home & M.B.\n\nWe missed the run of Eric & Bill and finding our way back to house we left our parcels and proceeded again to Railway Station to met Bill’s brother Tom from Glasgow and his sister Kate from Newcastle. Went to wrong station – Princess St. instead of Waverley and met Miss Edyth Wilson a singer from Chatham – Joe was also with me.\n\nLeaving Station at 7.20 we proceeded later on to Braids Hill Rd. and saw numerous people playing golf. An excellent view is also seen from top of Braids Hill.\n\nReturning about 10 p.m. I was introduced to the newcomers and chatted until 2 p.m. \n","82":"\n\nTo town with boys in morning to East Coast Railway Office to make enquiries re tickets.\n\nPosted the two glengarry badges (“Cairn-gorrum\" stones). Walk thro East Gardens and saw Scotts Monument and the Flower Clock which of course keeps proper time. Dinner at Victoria League Club. Very enjoyable Selections from phonograph.\n\nMet Kate and Eric together with Kate’s friend Fanny Moss (of Scarborough) who is employed at Jenners a similar place to Farmers in Sydney. Thence by motor to Forth Bridge and was very well pleased by the size of bridge.\n\nIn the Forth were innumerable warships including Beatty’s light Squadron, H.M.A.S. Australia and New Zealand and H.M.S. Lion & Tiger. The bridge is made in three spans and looks well. Torpedo nets were suspended from bottom of bridge to prevent submarines entering. Tea at Village Hotel right on the River banks and later we returned to Edinburgh via train to Haymarket thence coach to Valleyfield Street.\n\nAfter a rest we boys toured round and saw the Old and New Universities, Infirmitary, Harris Hospital and to bed at 1 a.m. Supper at Picture House.\n","83":"\n\nMorning – walk Princess St. Early dinner at the Picture House of spraghati & toast, strawberries & cream & Russian tea, thence home & clean up. Kate and Tom had left for their resp. towns early this morning.\n\nAfter bidding good bye to Mrs. Cunningham we proceeded to Waverley Station and found train waiting.\n\nLeft at 2 p.m.\n\nI was very much impressed by the excellent surroundings of Edinburgh the prettiness of girls and their neat dress. The trams are cable cars and girls are employed as conductors. It was peculiar to us to see quite boys with walking sticks and top hats and we soon got used to it. Our first stop was Berwick on Tweed where the boys took a snap of the Tweed mouth Bridge.\n\nNewcastle on Tyne\n\nLater we went very near sea and saw two warships quite close.\n\nArrived Newcastle on Tyne at 5.20 and after refreshment we sought Fennicks shop in Northumberland Place where Kate was employed. Found the place rather easily and was shewn to the reception room. It was an excellently furnished place and reminded me of David Jones warehouse.\n\nKate soon came bringing with her Miss Edith and Miss Little and other girls and we were introduced. It was quite a novelty for these people apparently to see Australian soldiers and they all turned after we passed them and had a good look at us.\n\nHad tea at Gosforth & spent an enjoyable evening singing etc.\n","84":"\n\nTrip to Jesmond Dene & Hancock’s Musuem. \n\nLeft Newcastle just after midday.\n\nWe stopped at Durham, Darlington, York & Retford and noticed several brickworks at Peterboro . In fact we saw some of the highest chimnies of our journey just here. There are also several tunnels when nearing London. Arriving at Kings Cross to time we immediately had a brush up & wash.\n\nTaking a tube to Notting Hill Gate we sought Eric’s aunt at Kensington Gardens Sq. but she was on duty – being a nurse.\n\nBack by bus via Oxford St., Regent, Trafalgar Square, we crossed the Thames over Westminster Bridge to Waterloo Station but found to our disappointment that we could only obtain a train to Salisbury and that after travelling to Eastleigh and\n\nchanging.\n\nWe availed ourselves of this although we were disgusted that no train was running to Amesbury since we had carried out instructions and arrived at the rendavous very early.\n\nArrived at Eastleigh at midnight and left at 1.30 arriving at Salisbury 2.30.\n\nAfter a considerable delay we found a garage and knocking up the people we were successful in coming to some arrangement. Leaving Salisbury at 4.20 we simply flew along and I do not remember being in anything that covered the ground quicker.\n\nIn swerving to avoid a rabbit the tire came completely away and it was only a miracle that the car was pulled up without mishap.\n\nHe had another wheel and soon remedied the defect and we were in Camp at 5.\n\nA short sleep of half an hour and up again.\n","85":"\n\nIt was fortunate that the morning was devoted to washing etc. so we had a sleep. Letter from home & M.B.\n","86":"\n\nVery hot weather of late and today was exceptionally hot, about 80 in shade.\n\nchurch in Y.M.C.A. Rollestone again, also at Durringstone at night.\n","87":"\n\nReceived letter from cousin Jim.\n\nCommenced training again. Route march.\n\nAugust\n","88":"\n\nAfternoon typewriting for Lieut. Oxley and worked to 8.30 p.m.\n","89":"\n\nAlso typing all day.\n","90":"\n\nDrilling morning. Afternoon, Typewriting for Orderly Room Amesbury at night.\n","91":"\n\n2nd Anniversary of proclamation of war between Germany and Britain.\n\nFatigue work – stables.\n","92":"\n\nAfternoon, Cricket match between “A\" & “B\" Section (return match). Scores “A\" Sect. 61 (Dyer 28) “B\" 56 (Eric Cunningham 29). After the match it was ascertained that “A\" Section had played 12 men to our 11 men. Received 2 Referees 2 Sunday Times & a Telegraph from Sydney.\n","93":"\n\nChurch Parade morning in Military Cinema. \n\nLater. Having received a note from Harry Martin at Parkhouse I decided to pay him a visit today. Received a pass being lucky to draw one by ballot and at 11 a.m. set out to walk it.\n\nCame to Bulford Village in time thence on to Bulford Camp and on to top of hills. Going over the hills I could not see Parkhouse and enquired of some people the way. They were from London on holiday (Bank Holiday) and they offered me a drink and cake. Received with thanks. Arrived Parkhouse at 2.30 and was surprised to not only see Harry but also Billy McLean of Field Hosp. Altho’ busy they found time to chat and Harry told some of his Gallipoli experiences.\n\nHad tea and soon after set out on return journey.\n","94":"\n\nPosted 22 letters to various sources.\n\nSeveral promotions and transfers made known today in connection with the formation of another (“C\") section. Some of these were – \n\nCorp. Williams to be Sergt. Clerk\n\nPriv. Dyer to be Corp.\n\nPriv. Ahearn to be Corp.\n\nCorp. Mooney to be Sergt.\n\nD\/C Savage to be Corp.\n\nPriv. McCauley to be Corp.\n\nBank Holiday\n and usually a holiday in England but the Prime Minister appealed to Public to cut it out this year so as to obtain the required amount of munitions. At night went for a walk to Durrington & Bulford villages.\n","95":"\n\nReceived letter from Miss Moss of Newcastle on Tyne. Today was occupied in reforming the Field Ambulance into 3 Sections. I had the luck to be placed in “C\" Section. At night Geo. Francis (Chas brother) paid me a visit. He has been thro’ the Gallipoli campaign and was invalided to England with dysentery. At Parkhouse for a while and now attached to 3rd Divisional Headquarters. Was pleased to see him.\n","96":"\n\nLecture by Capt. Harrison on “Purification of Water by Chlorine Method\". ¼ lb Chlorinated Lime in a gall. of water will \npurify\n sterilise 8000 galls. in 15 \nmile\n minutes. It is then necessary to remove the Chlorine by ½ lb “Hypo\" to gall. of water and the solution added to 8000 galls.\n\nFollowing on the change of Sections I had to transfer to another hut (same as Sams).\n","97":"\n\nPosted papers & books home & M.B.\n\nAfternoon, Tent pitching.\n\nNight, To Amesbury – met Norm Farquhar there.\n","98":"\n\nWalk to Durrington & Bulford at night.\n","99":"\n\nSent letters to Bro. Ernie & Roy Robson.\n\nFatigue duty – morning.\n\nAfternoon, Played the Tenth Field Ambulance (Victoria) cricket and won rather easily scoring 9 for 130 (Fred Toby 45 Dart 17 not out). Tenth scored 61. Bowling Toby secured 6 wickets.\n\nI did not score but was in good form behind only allowing one Sundry & one stumped. Night – walk to Amesbury.\n\nSund\n Received letters from home, Miss Waterhouse & Aust. Headquarters.\n","100":"\n\nMorning – Church Parade. Very unpleasant day – dusty & windy - so I remained inside and wrote several letters.\n\nMonday 14th\n\nLecture by Capt. Harrison on :\"Organisation of a Dressing Station\". He laid stress on \nseveral\n the following \npoints\n,\n\n(1) That it is not the duty of a Field Ambulance to cater for the individual but the Army therefore if he came to two men one of whom was severely wounded & likely to die and another who was slightly wounded, he would not spend much time on former since the latter is of more use to the Army.\n\nAfternoon. The time was spent very interesting – in erecting a Dressing Station complete. During the day it was showery & sloppy and must be very uncomfortable in winter here.\n","101":" \n\nBill Cunningham coming back from furlough told me of an incident which happened in Newcastle. He \nwalk\n was walking along when a squad of wounded “Tommies\" under charge of a Corp. passed. The Corp. when passing Bill gave “eyes right\" in recognition of the good work of Australians in the Poziers fighting. Bill returned the token by saluting.\n\nReceived 7 letters today. An extraordinary mail arrived this afternoon and no fewer than 7 bags were for the 9th Field Amb. alone.\n\nAfternoon. Building a Dressing Station again. \n","102":" gave me some chocolates & Adora Cream Biscuits & chewing gum which came in a parcel from Flo.\n","103":"\n\nRaining on and off all day.\n\nLoading medical stores cart. Appointed temp. to act as No. 4 in stretcher squad.\n","104":"\n\nRaining. In afternoon went for a route march and on return journey ran right into a storm and got drenched through. Just behind us an airman landed as he was afraid of lightning. We sent a party over to assist him.\n\nBill Cunningham who was\n","105":"\n\nFine again. Routine.\n","106":"\n\nReceived a pass from Jack Zocchi who was not using it and with Norman Farquhar we decided to go to his friends home\n\nin Andover this afternoon – weather permitting.\n\nDuring the morning we spent the time in the trenches doing first aid & stretcher work which was quite interesting. As the ground is very chalky we were like sticks of chalk when we left.\n\nAfter dinner we (Norm Farquhar, Gil McCaulay & self) left our Camp and while waiting for a motor lorry we witnessed a very nasty accident to a “Tommy\". His horse bolted and getting off the road put its foot into a hole & fell throwing the rider very heavily on to his back, shoulder & head.\n\nWe tied a bandage round him and one of our Ambulances soon had him to hospital (Fargo). Ascertained later that he was suffering slight concussion, broken collar bone & ribs also that horse broke its shoulder and was shot.\n\nOur lorry came along (Geo. Young & Coy, Andover Army Contractors) and we were soon on our way. Arrived Andover at 3.15 and had a look at town which was very busy place.\n\nThence to Clatford Manor about 2 miles out and was surprised to meet three Imperial Officers there from \nBack\n Berkshire Regiment (Territorials). My friends people soon made us at home and after tea we played tennis until 8 p.m. and then they gave us an excellent dinner. Might say here that we were provided with flannels, shirts etc. for tennis.\n\nThere were five young ladies\n\n(People’s name was Millman)\n\n(three sisters of the Manor, a French visitor and another) besides the old people and they cut a pretty picture when we sat down to dinner as they all wore evening dress. All too soon we had to leave and then our troubles commenced. On the way to Station we decided it would be better to spend night in Andover and go to Salisbury by first train tomorrow. But we had not reckoned with the Military Police and meeting two later they informed us that we were not allowed in town after 10 p.m. so we had to look elsewhere for a bed for night. We wandered around for an hour & half without success stumbling across a soldier asleep on the footpath on one occasion and thought we had discovered a murder or something. Being unsuccessful at midnight we made for station and seeing a train in platform which we learnt would not be going, we hopped in and made a bed on the seats.\n","107":"\n\nAwoke at 7 a.m. feeling fatigued but improved later.\n\nHad breakfast, very acceptable, at a hotel nearby and after a long wait we caught the 11 a.m. for Salisbury and arrived at noon.\n\nAs Church service was on at the Cathedral we did not have an opportunity of looking over it but was quite impressed at the enormous size of Hall & organ and the pillars etc. The floor was one maze of slabs acting as grave coverings\n\nof olden day people.\n\nDinner at a reasonable price & tasty too and leaving our Greatcoats at Y.M.C.A. we walked to Park and sat down awhile.\n\nReturning to town I was waiting for friend who was getting a shave when a lady invited me in to tea which I accepted and it went very well and reminded me of home. After tea I met a Miss Hilda Mundy and friends and went to Salisbury Cathedral and the service was indeed excellent and much more extensive than I was used to.\n\nAfter seeing the ladies safely home I rejoined my friend and then followed a bustle for a car back to Camp. However we arrived safely without incident and soon dropped off to sleep.\n","108":"\n\nReceived 2 letters from M.B. & several papers. Route march in afternoon & the boys gave their famous hymn, Growling, Growling, Growling,\n\nAlways b--- well growling\n\nWhen you’re dead and in your graves\n\nYou’ll b--- well growl no more.\n\nDuring the morning we had first aid & stretcher drill and the Colonel took a snapshot of my stretcher squad to send to Australia.\n","109":"\n\nOn fatigue duty morning.\n\nWas appointed permanently in charge of a stretcher squad (as No. 4). The selection of the\n\nmen to complete the squad was left to me and I selected John Perry, Bob Thomas and \nFred\n Alf Henderson. Other men in charge of stretcher squads are J. Nankiville, Scotty Maxwell, Dick Gates, J. Zocchi, W. Poole & Nicholls.\n\nNight – To Amesbury for a walk.\n","110":" \n\nReceived letters from Ted Smith & Jack Prunty. Another trip to trenches this afternoon. Very wet & raining. Pay day.\n\nLecture by Capt. Meehan on “Trench Foot and Frost Bite\". Symptoms much the same also causes. Damp puttees & socks – garters etc. Treatment, much of this depends on preventative means –\n\nProper draining of trenches.\n\nRubbing whale oil well into feet.\n\nWearing of gum boots.\n\nPlatforms to stand on while in wet trenches.\n\nConstant relief of men in trenches.\n\nHot meals frequently.\n\nWhen a patient is discovered be careful \nnot\n to apply any hot water or take into hot room. Rub with snow to restore circulation.\n","111":"\n\nFatigue work all day. Was innoculated against para-typhoid this afternoon and at night arm was sore.\n\nGreat competition of late for the best garden outside of huts and some really good designs were shewn.\n\n“A\" & “B\" Sections went for a long route march (7 hours) to Salisbury.\n","112":"\n\nWhen I awoke at daybreak had a very dizzy\n\nfeeling about head and a back ache as the after effects of innoculation and we were allowed to lay by during the day which was very acceptable. To bed early at night.\n","113":"\n\nWeather threatening.\n\nAfter a clean up Sam & I set out for Andover as Norm Farquhar who was to have gone was indisposed. Travelling by Geo. Young & Co’s Provision Cart we passed thro’ Bulford Camp, Tidworth, Luggershall, Weyhill thence to Andover.\n\nHaving very little time to spare \nin\n we walked briskly thro’ town and then to Clatford Manor (Millmans) again. Mrs. Millman directed us to Allen’s house “Eastover\" about a mile further on and we arrived there in time for tea meeting there three Imperial Officers again (Lieuts. Hunt, Allen & Cox) who were exceedingly kind to us.\n\nPlayed two games of tennis and shewed improved form. Then rain came down & settled our chances of \nfuture\n further play.\n\nAfter changing from flannels into Khaki again we set out for Manor where we had an excellent supper (or dinner).\n\nAfter dinner Sam sang a little and we played cards and so pleasant \ndid\n that the time slipped by quickly.\n\nLeaving hurriedly we were in plenty time to get our train from Andover Junction and arriving at Amesbury at midnight we had a snack\n\nat Salvation Army tent and meeting Ben Skelton the three of us set out for Larkhill and finally ended up in bed at 2.30.\n","114":"\n\nRaining. Received 4 letters (home, M.B. & Cousin Fan).\n\nChurch parade in Y.M.C.A. Did not leave hut the rest of day.\n","115":"\n\nReceived pair of socks and wash bag from A.M.C. Comforts.\n\nRecd. letter from Harry Baldock.\n\nAfternoon, working at the trenches.\n","116":"\n\nThe Papers contain the good news that Roumania has declared war on Austria (as from 27th) and this likely to shorten the duration of war. Raining all day. Unfit for training.\n","117":"\n\nFatigue duty.\n\nCoal party.\n","118":"\n\nReceived some papers.\n\nWorking in trenches morning.\n\nAfternoon, Route march to Bustard Hotel. Saw balloon sent up by Royal Flying Corp. for observation purposes.\n\nNight walk to Amesbury. Last night met Gordon Warick in camp at Rollestone 13th Batt.\n","119":"\n\nFriday 1st\n\nAll day route march set out at 8.30 a.m. with ful kit & rations. After a couple of hrs. going we passed thro’ Winterborne-Stoke thence Yandley\n\nDeptford & Steeple Langford \nLangly\n where we halted for 2 hrs. & dinner.\n\nWalking round the village we were invited on a lawn for cup of tea & cake by a Sir Arthur Clay who was only spending a short time here from London (opp. Hyde Park Gate). We spent quite an enjoyable half hour chatting & looking over grounds at his invitation. Also supplied us with cigarettes. Back to Camp via Bury St. James & “Boot Inn\".\n\nMore Papers from Australia.\n\nWalk to Amesbury at night.\n","120":"\n\nInnoculated at 10.30.\n\nAfternoon, Rested.\n\nNight, Altho’ raining walk to Amesbury.\n","121":" \n\nAfternoon, met Harold Bastian who had just arrived with 9th Engineers on the “Ajana\". Saw a kangaroo they brought across with them. The boys took photos of them.\n\nTo Amesbury with Bas where we had tea & adjourned to Church, Sermon “Charity\". Then on way back met Ossy Wood & racked up old times until 9 when I guided Bas to his friend Hugh Connells (Capt.) hut (35th Batt.) & spent an hour there. Capt. Connell has beaten Edden for Labor selection for Kahibah. Thence back to Camp.\n","122":"\n\nUsual Program. At night celebrated Sergt. Harold Williams 23rd birthday in the cubicle & sing song.\n","123":" \n\nUsual program.\n","124":"\n\nAfternoon. Was issued with Red Cross Brassard.\n\nReceived letter from bro. Ernie to say he had been wounded & was in Neath Hospital (No. 3 Western General) Sth. Wales so I immediately applied for leave of absence to visit him. Four days was granted and I decided to start out tomorrow morning.\n\nMet Ernie Wightwood who had been in England about 2 weeks attached to 59 Batt. Then I went a stroll with Harold Bastian to Durrington. On return journey we called in to see Capt. Hugh Connell of 35th Batt. & met Billy Dunn (Labor Member for Mudgee).\n\nBath\n","125":"\n\nLeft Camp at 8 a.m. in company with Ernie Lawless who was going to Dublin for a spell. Missed the 8.52 & 10.2 trains by mischance so I motored to Salisbury by 10.30 bus from Amesbury and caught 12.45 train to Bristol. On the journey I passed time away by chatting to an old gentleman who had been to Australia. He left the train at Bath which was the largest town we saw up to this stage of journey. The Abbey on the River was particularly pretty, the idle factories built of an uncommon stone also caught the eye.\n\nJust past Bath I saw for the first time the use of the towpath for \nbath\n barge navigation.\n\nOn\n Also saw the white horse on the cliffs at Westbury.\n\nBristol\n\nAt Bristol I had to wait 2 hours for a train connection so had a walk round the town & concluded it was a very busy place. The myriads of girls when the factories stopped work was a spectacle.\n\nAs I was there a hospital train was emptying the wounded into Ambulances thence to Hospital.\n\nMet a wounded Anzac who rece’d wounds at Pozeiers (from 18th Batt.).\n\nNewport was next stop. The town boasts of a Suspension Bridge after the Marseilles design which carries people across in a basket. Thence on to Cardiff which is largest town in Wales. Only saw about 20 minutes of Cardiff.\n\nNeath, South Wales\n\nArrived Neath at 6.40. Had the good fortune to obtain a motor bus to Penrhiewtyn where the Hospital was. On arrival at Hospital I interviewed the Charge Nurse and ascertained the injuries which consisted of a compound fracture of tibia & as I subsequently found out, nervousness bordering on shell shock.\n\nEventually obtained lodgings at Thomas Llewellyn Café \nin\n near Station where I met a New Zealander named Barrington. Soon fell asleep.\n","126":"\n\nAfter bath, shave & breakfast I made tracks for Hospital laden with reading matter & biscuits & he was real pleased & no doubt surprised to see me.\n\nSpent the morning chatting over his experiences & of home & time soon passed. The nurse dressed the wound in my presence and wound was quite a small one but looked clean. It looked suspiciously close to the ankle joint.\n\nDinner at Llewellyn Café thence to Y.M.C.A. where I wrote to home & M.B. explaining full facts re bro’s wound. Thence to Hospital again laden with plums etc. and spend the afternoon chatting. \n\nSwansea\n\nTea in Neath thence to Swansea by 6.45 train & booked room in Y.M.C.A. in St. Helens Rd. – an excellent building. Walk thro’ town to beach. Saw the extraordinary Mumbles Express & also Mumbles Beach. Back to Y.M.C.A. at 11 p.m. & slept like a log. During my stay in Swansea a Miss G. Gregory of 39 Henrietta St. Swansea volunteered to show me the town & places of interest tomorrow.\n\nThe town impressed me as being exceptionally busy & the innumerable chimneys & coal mines as well as the black haze called to mind our Newcastle. The mountains of coal were quite unique. The countryside abounded with ruins of Castles & Abbeys which are quite historic.\n\nSlept excellently.\n","127":"\n\nUp at 7. Breakfast and travelled by 9.55 to Neath again.\n\nFound Mrs. Lund of 115 London Rd. Neath & handed to them my letter of introduction from my friend Norman Farquhar. In conversation I ascertained that they came from Ossett the town next door to Dewsbury where dad was born.\n\nArranged to have dinner with them.\n\nTo Hospital for an hour.\n\nDinner at 1 and chatted with family, Mr. & Mrs. & Miss Dora Lund.\n\nBack to Hospital again with biscuits & matches.\n\nOne of the boys in the Hosp. died last night \nat Hosp.\n with shrapnel in lung.\n\nLeft Hospital at 4.45. Thence on to Swansea & had tea near Station.\n\nLeaving belongings at Y.M.C.A. took a run out to Skeret, a suburb.\n\nThings noticeable were selling fruit by pound, the calling of peanuts monkey nuts and the true Welsh people who contrary to my imagination were a dark skinned people \nliken\n much like French people. Their language was impossible. After fruit supper I turned in.\n","128":"\n\nUp early and after a clean up had to leave before breakfast.\n\nThe town was hardly awake when I passed thro’ and Welsh towns have that name on Sundays.\n\nTravelled by 8.45 train to Neath.\n\nLeft belongings at Mrs. Lund’s & thence to Hospital with the New Zealander Barrington. Took some fruit.\n\nAfter chatting with Ernie all morning I had perforce to leave him at 12.45 & had dinner at Lunds who were exceedingly kind to me. On leaving they gave me a little box of provisions which we very acceptable later on.\n\nJust here I might mention that several people in Neath volunteered to visit Ernie when I leave including Mrs. & Mr. Lund, the New Zealander Barrington, The Y.M.C.A. lady and several ladies (names unknown). Had a tedious journey back. Passed thro’ the Severn Tunnel on way & took us 7 minutes to come thro’ with train at full speed.\n\nAlthough I left Neath at 2 I did not arrive at Amesbury until after 11 p.m.\n\nHad supper at Salvation Army & arrived Camp at midnight to find several letters there.\n","129":"\n\nSent cablegram home re Ernie. Reads “Saw Ernie ankle wounded doing splendid\".\n\nRoute march afternoon.\n","130":"\n\nReceived letter from home re Arthur’s trouble and I straightway cabled re obtaining funds from Jim.\n\nUsual programme.\n\nConcert in Mess Room.\n","131":"\n\nField Day out in fields just past Stonehenge. Collecting wounded, erecting dressing station. Had our first real case. An infantryman received\n\ncontents of blank cartridge in his face. We despatched him to Fargo Hospital. Mending etc. Lecture at night. To night was exceptionally cold & when we awoke \nthe\n was unbearable.\n","132":"\n\nRoute march to Winterbourne & Porton in very cold weather. In Winterbourne we inspected a Church the windows of which date back to 13th Century. The Vicar shewed us some manuscripts which were dated in 1579. Henry was spelt “Hinneary\". Another item read, “It is said that Charles II is King in name & not in fact since his abdication. Whether this is or is not not so I do not care a button\". \n\nSaw in a Casualty List last week that Cpl. A.H. Vidler (Fan’s husband) \nwas\n died of wounds & I \nthereby\n therefore sent her a message of sympathy.\n","133":"\n\nAnother field Day collecting wounded & establishing Dressing Stations. At night Ernie Wightwood popped in & we chatted over old times.\n\nReceived\n Letter from Ernie.\n\nSaw \nhypo\n hypnotic display in Y.M.C.A. Very good.\n","134":"\n\nReceived letter from home & book from Capetown (Mina).\n\nHeard from Daddy Worsfold (our inventor) that the War Office had accepted his stretcher invention for trenches (small stretcher) & had played an order immediately. He thereupon set about the \n\nmanufacture of them & in 4 hours from receiving the communication he had 600 Voluntary Aid workers going & turned the first out which they presented to him. \n\nHis aerial stretcher also met with approval and he is in hopes of a similar success.\n\nSaw 200 German prisoners near Camp 29 brought for road making. They are old prisoners, most being captured in Mons, Loos, Ypres, etc.\n","135":"\n\nOn Fire Piquet all day & Canteen Piquet from 6 to 9 p.m. Sent pad to Ernie. Writing during afternoon.\n","136":"\n\nOur Section on fatigue duty.\n\nLetter from Bert Fitzpatrick.\n\nWriting.\n\nNight. One of our boys in “A\" Section (R.W.L. Cox) had the misfortune to fracture his leg near \nshin\n ankle whilst wrestling young Tommy Pesmany (our Russian Boy). Capt. Meehan rendered first aid and he was despatched to Hospital and bones set.\n\nPrevious accidents & illnesses by which men have left us are as follows:-\n\nIn Australia:- Young Knight (killed). At Sea, J. Neally (Typhoid), left in Egypt, Carroll (Appenditicis), In England, R.W.L. Cox.\n","137":"\n\nField Day for our Section only. Very cold day.\n\nLetters from M.B. & \nErnie\n B. Fitz.\n\nAt night Bastian & I & friend went up to see Ossy Wood but he was at an Officers School Tidsworth. Sent note to him.\n\nLetter from Ernie.\n","138":"\n\nRoute march to Figheldean, Upperavon & Milston. Saw a Church at Milston which dates back to 1299. Saw some good flying.\n\nAfternoon, Pay day.\n","139":"\n\nMorning. To Dentists and had tooth filled.\n\nAfternoon. Stuffing palaisses in preparation for cold weather.\n\nSlept very comfortable on them at night.\n","140":"\n\nOur Section on fatigue duty all day.\n","141":"\n\nWalk to Rollestone to No. 5 Training Battalion and met Abel Sheath. He was going on leave however and I promised to visit him one night. Walk to Flying Depot thence to German prisoners Camp & back to tea.\n\nAfter tea to Amesbury & back.\n","142":"\n\nChurch Parade, morning.\n\nAfternoon. W. & Eric Cunningham & self to Stonehenge thence to Amesbury to tea & Church. Heard Brilliant sermon on “Repentance\". \n","143":"\n\nPractising near the trenches for next Wednesday’s review by His Majesty the King.\n\nAfternoon. Route march.\n","144":"\n\nFull dress rehearsal of tomorrow Review.\n\nAn enormous number of troops took part including Third Aust. Division and all the Training Battalions.\n\nInspected by the King\n\nAltho’ the parade has finished the march past at 4 p.m. it was near 7 p.m. before we got back to Camp. The whole thing went off smoothly.\n","145":"\n\nReceived letter from bro. Ernie.\n\nTo day was “the day\" of days. We pushed off from our Camp early en route for Bulford Fields where we arrived in good time being arrayed in our best. His Majesty arrived at about 11 a.m. and the massed bands (12) struck up “God Save the King\". Besides the 3rd Division there were the whole of Reinforcements for other Divisions & some Light Horse. Wounded Anzacs looked on.\n\nAfter the inspection followed the “march past\" which was excellent – all arms being more than satisfied by their shewing. The King then \ndrove\n rode away amid thunderous cheers by the huge numbers present. Then the rained poured down & we looked like drowned rats but still full of humor. A shower on return soon put us right but left our togs pretty wet.\n","146":"\n\nWe were allowed the morning off to dry clothes, clean our huts etc. and was acceptable. It gave me a chance at same time to complete my Australian mail which closes today.\n\nAfternoon route march.\n","147":"\n\nIt was very noticeable that when we paraded at 6.30 it was almost too dark to see our own men & impossible to see any officers on Parade.\n\nMiscellaneous programme during morning and in afternoon it rained like billeo.\n","148":"\n\nDivisional Sports were held this day on quite a large scale on ground North of Camp 11. In consequence of this the troops were granted a holiday to attend.\n\nFortunately I drew week end leave and hurried to Bulford for the train. I arrived in London at about 3.30 p.m. I had previously booked a bed in Aldwych Y.M.C.A. Hut (in the Strand) so I went there to leave coat & haversack. Thence a walk – down Strand to Nelson’s Monument & Trafalgar Square thence up Haymarket to Picadilly Circus and along Picadilly to St. James St. Walk across St. James Park and entered Whitehall through the Horseguards. Passing the Parliament House buildings I came to Westminster Abbey and inspected the inside just about 6 oclock. It was beautiful and the work inside is marvellous. Saw the Coronation Throne still preserved in good order. Having finished the inspection I pushed on down Bird Cage Walk to Buckingham Palace also a beautiful building. A number of the valuable buildings such as this are protected \nby\n from Zepp raids by sand bags around the walls. Thence back to Trafalgar Square again and had tea at the Buffet at Charing Cross Station. Soon after tea saw a batch of wounded soldiers arrive and received a good reception.\n\nWent then to Ferry’s Picture House in the Strand and spent\n\nan enjoyable couple of hours. An excellent orchestra was in attendance. It was noticeable was smoking was allowed right thro’ the performance although the theatre was quite as big as our Sydney \ntheart\n theatres. As a Zepp raid was expected and I was anxious to see one I went for a walk up \nthro\n to Hyde Park Corner & into the Park. Leaving there about 11 p.m. I arrived at Aldwych at about \nmorning\n midnight and the night was very \nnigh\n dark in fact the whole city is dark these times and I had difficulty in finding the Aldwych Hut. After a bath (hot) I felt O.K. & meeting Ossy Wood & later Nick Allerdice (of","149":" Nick & I had supper together.\n\nWe waited \nfor\n for a considerable but no Zepps came & we decided to turn in not forgetting to put our watches back an hour and the “summer time\" under the English Daylight Saving Bill ends tonight.\n\nOwing to a misunderstanding as to booking my bed I had to sleep on floor but didn’t mind that.\n","150":"\n\nAs a consequence of putting the clocks back people thereby gained an extra hour’s sleep.\n\nI awoke at seven and went for a brisk walk to Trafalgar Sq. & Westminster Abbey & back. Arranged with Nick Allerdice, Wagstaffe & Joe Ahearn who were staying at the Y.M.C.A. to go for a walk after breakfast so we shaved etc. & had a good breakfast. Then, hopping on a bus we\n\ngot to Liverpool St. Station and then to Petticoat Lane (Middlesex St.). There we had the fun of our lives and it would be hard to imagine that such a thing existed in such a civilised city. Hawkers there sell every article under the sun with not refined language and the whole scene is Bedlam itself. We had to push & shove all the way thro’ the length of street (about ¼ mile) and there was an air of jollity about the whole thing which decided for us that we had spent a good time.\n\nBack to Ald\n On way back to Aldwych we went through St. Pauls Cathedral and was even more impressed than by Westminster. The coloring was brilliant. It is said that directly beneath the dome in the Vaults lies Lord Nelson. The tame pigeons (hundreds of them) made a very pretty scene and people came in motors and in foot to feed these pigeons by hand. \n\nAn excellent dinner at our Y.M.C.A. (we had waited for half an hour in vain at Appendroidi’s in the Strand).\n\nWash & brush up etc. and as the others had made other arrangements I left then and proceeded to Kings Cross thence to Charing Cross and obtained a tube to Richmond (just beyond Kew Gardens).\n\nRichmond was quite gay and excellent place for a Sunday’s diversion. The park is a huge place where there are tame deer & other animals also a Hospital for wounded.\n\nHad tea at a pretty set of dining rooms named Rose Cottage and then went thro’ the Gardens by the banks of Thames. \nIt is\n (One particular spot reminded me of Botanical Gardens Sydney & Farm Cove.) Thence past Hospital & through Park & back by same route.\n\nAs my train went rather early for Camp I left Richmond at 8 p.m. Back to Y.M.C.A. Thence to King’s Cross & from there to Waterloo Stn. in time to obtain a seat in my train which left at 10. Just before we left searchlights began to play, myriads of them & very strong too and we heard that Zepps were about \nthat\n and hoped we might see some fun. But no such luck and arrived back in Camp without incident at 2.30 a.m.\n","151":"\n\nUp at 5.30 and at once all was bustle & excitement as we were to shift to No. 3 Camp. And it was a brute of a day Raining all the time.\n\nSaw by papers that there was after all some fun in London & another Zepp was brought down about an hour after we left there.\n\nGoing solid all morning unloading stuff at our new quarters. Sam & I are still in same Hut (No. 13 this time) No. 3 Camp.\n","152":"\n\nStill raining. On fatigue duty.\n\nReceived letters from Bro. Ern.\n","153":"\n\nRaining. Letter to Bro. Ern. Pay Day.\n","154":"\n","155":"\n\nRoute march morning. Lecture by Capt. Meehan\n\non “Food\". Bastian came up to see me.\n","156":"\n\nReceived couple of letters from Australia. Very Cold today.\n","157":"\n\nTo Figheldean with H.O. Bastian to Church. Saw the “Village Smithy\" around which the “Village Blacksmith\" was \nwritten\n said to be written.\n","158":"\n\nOur week’s bivouac commences this day.\n\nPushed off from No. 3 Camp at 9 a.m. in conjunction with the Ninth Infantry Brigade. Arrived at the Bustard Trenches after about two hours march and spent the greater part of morning in arranging out Camp. A party was detailed and set out immediately to erect our Advanced Dressing Station. I however remained with the Ambulance. The day passed quickly without any action.\n\nTuesday \n9\n","159":"\n\nDetailed as Cooks Fatigue all day.\n\nThere was an action during the afternoon and the Permanent Stretcher Squads which had been formed had plenty of work to do.\n\nWednesday \n10\n","160":"\n\nActing as a No. 4 to a Stretcher Squad and took part in two actions 3 p.m. & 8 p.m., obtained good practise. During the afternoon’s action I came across Geo Duckworth our Leichhardt C.C. scorer now attached 36th Batt. He was a Casualty.\n","161":"\n\nAttached to the Ambulance Signallers Corps with Corp. Ted Wylie, Priv. Chas Wynne, Rutherford, Carroll & Tucker. Tucker & I were working together today at the Advanced Station.\n","162":"\n\nAnother action in morning. Tucker & I were on the Intermediate Station and\n\nerected a shelter from light rain and wind.\n\nDuring action it was very marked the aeroplane activity and yesterday one came down quite close to the dugout. The bombers were also busy today and it was rather risky as we could hear pieces whizzing at a terrific rate.\n\nBut the best sight was at night. The artillery began a bombardment and with numerous star shells – the whole made a good picture. The weather during the week had been exceptionally good during the week for this time of year.\n\nDave Cunningham & Ted Stewart brought out some supplies tonight (No. 9 Camp they are in).\n","163":"\n\nReveille at 6. Lower tents 6.15. Pack stores 6.30. Breakfast 7. Load stores on waggons by 8 and Fall 8.30. Going some all time.\n\nMoved off at 9 a.m. and arrived back at Camp about 10.15.\n\nBath was first consideration. Rec’d books from Joe Slater. Turned very cold towards night.\n\nWrote two or three letters.\n","164":"\n\nAfternoon. Col. Chaplain J. Green (friend of dad’s) is in Camp and gave a lecture at Y.M.C.A. on Friday last. Sam & I made endeavours to find him and left our names & addresses.\n\nHad a sharp shower of sleet (first one here) this afternoon. Sam & I footed it to Parkhouse Camp and met Billy McLean ex Sergt. Chard, “Leo\", Sammy Sommerville & others. Harry Martin\n\nwas absent.\n","165":"\n\nConscription Referendum Polling Day for Troops. Registered mine for “yes\". Think “yes\" will be carried here but there are a duece of a lot voting “No\".\n\nWrote several letters.\n","166":"\n\nWrote letters.\n","167":"\n\nMy 24th birthday.\n\nPay Day. Received our issue of colors. Received letters from Ern, Swansea & Barnsbury. A photograph of unit was taken this afternoon.\n\nOur Section was on fatigue duty. I was stoking up \nin\n on hot water plant. \n\nTwo new officers commenced duties to day. Major Honman (in charge “C\" Section) and Major Lind (in charge “B\" Sect.) both from 14th Field Ambulance, France.\n","168":"\n\nOur “A\" Section commenced their embarkation leave this afternoon. We seem as if we shall be leaving soon for France.\n\nRoute march with our new major (Honman).\n\nFriday\n Night. Went with Sam & 9th Field Amb. Concert Party to No. 4 Y.M.C.A. where we gave a Concert to a large crowd. Supper afterwards.\n\nMet Lee, Baker & Griffiths with 24th A.S.C. in No. 9 Camp.\n","169":"\n\nReceived few letters. Very cold tonight.\n","170":"\n\nExceptionally cold today. Had to wear sheepskin vest to keep warm.\n\nMorning. To Dentists and had tooth filled.\n","171":"\n\nOn fatigue duty\n\nall day. Writing at night.\n","172":"\n\nAt 7 a.m. left Camp 3 to relieve “B\" Section at the 9th Brigade Hosp. No. 2 Camp 19 (Artillery).\n\nI was clerk there and was kept going.\n","173":"\n\nKeep\n Kept going all day. Received letters & parcel of socks.\n","174":"\n\nWas relieved at 10 a.m. by “A\" Section and we proceeded to Camp 3 again.\n\nCleaning harness afternoon. Mail from home.\n","175":"\n\nClean up in anticipation of leave tomorrow.\n","176":"\n\nAlthough wet & rain was about we left Camp at 9 a.m. and arrived in London about 1 p.m. Thence round to Aldwych Hut with Corp. Macaulay and booked our beds etc. then dinner. Walk with Mac down Strand and I had a photo taken at Chesneys Ltd. and we purchased several necessities also Christmas Cards. Back to Aldwych for tea.\n\nLeaving Mac I went to Charing Cross Stn. but rain prevented me from walking about much.\n\nHad supper in the \"Corner House\" about 9 and then went for a run by tube to Upton Park & back arriving Aldwych at midnight.\n","177":"\n\nReferendum Polling Day in Australia.\n\nMorning. Stroll along Embankment with Mac, Harold Lees & Ron Ponton and inspecting Cleopatra’s Needle we pushed on to Parliament House. Went thro’ the several galleries there also House of Lords & House of Commons. Was rather disappointed with the size of rooms in which the\n\nParliaments sit. The pictures adorning the walls are beautiful and those of “Battle of Trafalgar\" and “Battle of Waterloo\" were an enormous size about 40 x 15. Leaving Ponton & Lees, Mac & I went to the Tower of London by Tube to Mark Lane. Saw some very historic specimens in the Tower including the room where two princes were murdered and Sir Walter Raleigh’s prison. Back by Tube to Temple (Aldwych). Afternoon. Concert in Albert Hall, Kensington by Royal Choral Society who gave the “Elijah\". There were 2000 performers including Ada Crossley, Ben Davies & Ruth Vincent. The Hall is a wonderful building, circular in appearance and holds 10,000 people when full. It also has an organ about the same size as our Sydney Town Hall’s. Exactly opposite in Kensington Gardens is The Albert Memorial a beautiful piece of work. Walked back in a foggy darkness to tea.\n\nAfter tea to Charing Cross Stn. thence to Ferry’s Picture Show in the Strand and at 8.30 to Hyde Park Corner by Tube, arriving back at Aldwych at midnight & had supper.\n","178":"\n\nRaining in the morning. Walked to Buckingham Palace and heard the Grenadier Guards (busbies) Band playing the “new guard in\". Thence back to Aldwych.\n\nIn the afternoon to Charing Cross Stn. and from there to Erith passing Woolwich Arsenal and Greenwich and had tea with a young married couple\n\nthe husband being a munition maker. Saw a good searchlight display after tea and experiments were proceeding with a new light which shewed no rays and therefore was not a target for the Zepps. Back to Kings Cross and then to people named Warrens in Barnsbury, London N. where an evening was in progress. However I arrived back at Aldwych about midnight.\n","179":"\n\nWith Mac for a stroll in the morning to Tottenham Court Rd. and back. Saw Y.M.C.A. Headquarters and the Theatres in Shaftesbury Av. In the afternoon a party of 5 of our boys went to the London Hippodrome and saw a Revue called “Flying Colors\". Little Tich, Dorothy Ward & Gabrielle Ray were the Principals and it was very good.\n\nThe day soon passed and we were back in train on return journey by 8.30 arriving Camp about midnight in heavy rain.\n","180":"\n\nAt 7 a.m. all the boys have to get a throat gargle as there is meningitis about.\n\nNorm Farquhar was taken to Bulford Hospital last Friday. Received my issue of “Tommy\" pattern boots today.\n\nDid a heap of writing at night.\n\nWednesday\n","181":"\n\nToday was a good day for us as a load of Comforts came and were distributed to us, the proceeds of a gift evening at Drummoyne.\n\nThey consisted of tinned fruit, condensed milk, coffee & milk cocoa, tin Arnotts sao per mess and soap. Very acceptable. At night the boys drunk the donors health in tea and after singing “For they are jolly good fellows\" they gave them 3 cheers.\n\nAt night spent writing again.\n","182":"\n\nSent letters for Christmas Mail to Australia including 2 books of views.\n","183":"\n\nRaining.\n","184":" 4th\\\n\nPhotos came to hand from Chesneys Ltd. Learnt to play chess.\n","185":"\n\nRaining a gale all day. Wrote some letters.\n","186":"\n\nWorking in the Orderly Room understudying the Clerks.\n\nSent a letter to Agent General N.S.W. to send cable to cousin Jim for funds (£5).\n","187":"\n\nVisit to Dentists. Orderly room again. Alteration of Drivers pay.\n\nWrote letters.\n","188":"\n\nOrderly Room.\n","189":"\n\nAustralian mail in. Preparations now being made for an early transfer to France. Night work in Orderly Room.\n","190":"\n\nSame\n","191":"\n\nReceived quite a shock when a route march with full packs was ordered for \nto\n this afternoon. We were quite out of condition after the wet weather but the march being on a Saturday and so close to embarkation rather jarred.\n","192":"\n\nStill another march with full pack up thro’ Amesbury to Stonehenge and back.\n\nReceived news thro’ Australian Headquarters of the death of Bert Fitzpatrick killed in action.\n\nHe had gone thro’ Gallipoli as Staff Sergt. in A.S.C. and joined the Infantry as a Lieut.","193":" Batt.) only a month before his death. In cricket baseball & other sporting bodies he was always interested and was Secry. of Centennial Park Cricket & Baseball Association for many years.\n\nMonday 13th\n\nA very busy day. The whole Third Div. practised marching out. We had our wagons all packed yesterday so at 11.30 we fell in (full kit) and moved off. Then a long march commenced. To Amesbury we came \nthro\n up past Stonehenge and on to Winterbourne Stoke, Shrewton and back \nto\n thro’ Rollestone to Camp arriving at \n7\n 6.15 p.m.\n\nW. Pearson\n\n"}}