{"Document Name":{"0":"Diary_0139","1":"Diary_0139","2":"Diary_0139","3":"Diary_0139","4":"Diary_0139","5":"Diary_0139","6":"Diary_0139","7":"Diary_0139","8":"Diary_0139","9":"Diary_0139","10":"Diary_0139","11":"Diary_0139","12":"Diary_0139","13":"Diary_0139","14":"Diary_0139","15":"Diary_0139","16":"Diary_0139","17":"Diary_0139","18":"Diary_0139","19":"Diary_0139","20":"Diary_0139","21":"Diary_0139","22":"Diary_0139","23":"Diary_0139","24":"Diary_0139","25":"Diary_0139","26":"Diary_0139","27":"Diary_0139","28":"Diary_0139","29":"Diary_0139","30":"Diary_0139","31":"Diary_0139","32":"Diary_0139","33":"Diary_0139","34":"Diary_0139","35":"Diary_0139","36":"Diary_0139","37":"Diary_0139","38":"Diary_0139","39":"Diary_0139","40":"Diary_0139","41":"Diary_0139","42":"Diary_0139","43":"Diary_0139","44":"Diary_0139","45":"Diary_0139","46":"Diary_0139","47":"Diary_0139","48":"Diary_0139"},"Date":{"0":"unknown","1":915.0,"2":916.0,"3":917.0,"4":918.0,"5":940.0,"6":942.0,"7":943.0,"8":944.0,"9":948.0,"10":949.0,"11":950.0,"12":951.0,"13":952.0,"14":953.0,"15":971.0,"16":972.0,"17":973.0,"18":974.0,"19":993.0,"20":994.0,"21":998.0,"22":1011.0,"23":1012.0,"24":1018.0,"25":1028.0,"26":1034.0,"27":1035.0,"28":1036.0,"29":1037.0,"30":1038.0,"31":1039.0,"32":1040.0,"33":1041.0,"34":1042.0,"35":1043.0,"36":1044.0,"37":1047.0,"38":1048.0,"39":1102.0,"40":1103.0,"41":1107.0,"42":1108.0,"43":1109.0,"44":1110.0,"45":1111.0,"46":1112.0,"47":1113.0,"48":1115.0},"Entry":{"0":"\n\n","1":"\nTroop deck much clearer though still fairly thick. In the afternoon marched \nalso\n through the outskirts of the city & ","2":"\n out onto a road which ran along the coast & so back to the ship. The people were very kind & threw fruit sweets & cigarettes to the troops all along the route. Halted in a very pretty spot with the surf roaring right at our feet. So big were the waves & the road so close to them, that spume & spray were blown across to the houses opposite. Made friends with a very plucky little water spaniel.\n","3":"\nChurch parade in the morning. Route march over the same route in the afternoon.\n","4":"\nRoute march through the\n","5":"\nBoiler leaking. Left convoy 3p.m. & sailed in N.E direction.\n","6":"\nSighted Madeira4p.m.& arrivedin port just before dark. Took in fresh water all night.\n","7":"\nCoaledall day. Ladies came aboard for afternoon tea.\n","8":"\nLeft port 11a.m.\n","9":"\nT.B. Destroyer 'Hope' picked us up towards evening. Noticed dents in her sides. Don't know what engagement she took part in\n","10":"\nEntered Plymouth Hoeat about 5.30.\n.\n Scenery reminds one of landscape targets. Received orders to disembark at once, though we had previously been informed that we would not leave the ship till the following day. Troops left the ship in\n\n\n\norders to men. Stayed at Imperial Hotel Russell Square with Duffy Donaldson & Conway. Diner at Frascatti's. Rotten.\n","11":"\nDrove round London. Called on Dr Scott Skirving in the afternoon, & went round again to dinner.\n","12":"\nWent to Horseferry Rd & met Lt. Brady (Northumberland Fusiliers). He had been wounded by a bomb. but was due to return shortly. Also saw. Sgts Raines & L.C. Robson* who had both been over to France. but were returned for an Officers School. In the afternoon Conway Donaldson & I went over the Tower. Dined at 'The Rendezvous' with Duffy, & after dinner met who was attending Officers School. Robson introduced me to\n\n\n\nS. M. Charker (20th Batt) who was with Arthur when he was killed.\n","13":" ","14":"\n Aug.1.\nRobson & Mant came round to lunch. Duffy & I called on Mrs Wise in the afternoon & then went to Waterloo Stn. to see wh arrangements had been made about the men. No one knew anything about them, so I got in touch with Horseferry Rd. who said they would do wh they could. Dined at the Rendezvous. Duffy. Conway. Donaldson & myself.\nWent up to Waterloo Stn. 8.45p.m. & fell in the men. No trainwas available but a Saff Maj. was. I saluted him 15 times & he did not return one. Caught tube to Paddington where we\n\n\n\njust caughtthe 9.55 to Swindon. Arrived Swindon 11.30 & found there was no train to Chiseldon. Started to march 11.45. & arrived in camp 2.15 with remnants & stragglers from here half way to Swindon. No early morning parade next morning.\n","15":"\nWent down to London for weekend with Duffy.\n","16":"\nGot in touch with Mel. Asked him to lunch tomorrow.\n","17":"\nLunched with Mel, & the three of us had tea in Hyde Park.Took a car to Petticoat Lane East End. Walked through the slums in about 1hr & returned to the city. Dined at the Rendezvous. Returned to the hotel where we said good bye to Mel. He is not sure what is he going to do yet. Met Brendan\n\n\n","18":" Sep.1st\nWent to London for the week end.\n","19":"\nWent to see 'Peg o' my Heart' in the evening with Mant & the two Miss Banmann's & had supper at Hotel Picadilly. Met Duffy, Lane-Mulling, Hughes & somebody else when I got back to the hotel, & we talked till well into Sunday morning.\n","20":"\nAbout 2am. Zepp. raid. Biggest up to date thirteen Zepps in all. Aircraft guns making terrific row & Duffy & I went out to see. Wandered about for about half an hour, & saw Zepp over Cuffley burst into flames & fall to the ground. The glare was terriffic. The Zepp was brought down by Lt. Robinson. He was awarded V.C.\n\n\n","21":"\nCyclists disbanded. Duffy & I transferred ","22":" & moved into","23":" T.B Rollestone.\n","24":"\nInspected by King at Bulford\n","25":"\nDuffy & I received orders to hold ourselves in readiness to proceed overseas at short notice.\n","26":"\nCame back from a night stunt in the trenches somewhere about 11pm. We are to report to the R.T.O. Folkestone at 12. noon Sunday\n","27":"\nMy name has been withdrawn from the list. I wonder if some interfering blighter\n\n\n\nhas been writing. Duffy & the rest (Fletcher Shaw, Armytage Ross Leighton) left after lunch. Why can't people mind their own business & look after their own families. Ours doesn't want any outside assistance.\n","28":"\nMusketry all the morning. all the afternoon. After dinner played billiards with Padre Bradbury. Lost one, won one. Rained like blazes on the way back to the mess. C.O. took pity on me & detailed me as conducting officer for the draft (100 0.2) to France moving off at 11 p.m.\nReported with draft Group 11.15 where there was another draft (100 o.rs.) to France moving off at 11 pm. Reported with draft Group 11.15 where there was another draft of 200 o.rs from 7th T.B. under Lts. Paul & Mitchell. Lt. Paul took charge of whole draft & we moved off at 11.30 for Amesbury\n\n\n","29":" Oct.15th\nArrived Folkestone 8.30 a.m. & marched into rest camp till boat left. Embarked with every man & reached Boulogne with draft all correct. Marched to 'Ostrohove' camp & damned glad to get there. I was made O.O. which entailed no extra work & some authority.\n","30":"\nEntrained for Etaples where we arrived about midday. Handed over men all correct & went into officers mess. Duffy and the rest had arrived the night before. They thought I had come to stay. Saw Dr (Gus) Morgan who gave me Mrs Sly's address. Jock has been nominated for the Rhodes. Good lad! Returned to Boulogne & stayed at Hotel . Quite pleased with my French small as it is.\n\n\n\n\n\nMet three English officers. Two Life Guards & one M.C. Gentlemen to the backbone. Had a good time.\n","31":"\nCaught midday boat for Folkstone. Crowded with leave men. Arrived London about 7.pm.& found it difficult to get rooms. Smith Mitchell & I put up at the Imperial.\n","32":"\nIn the morning went to Horseferry Road. In the afternoon I called on Mrs Sly. Miss Sly received me & took me to afternoon tea at Mrs Edwards. It was great to be in a real drawing room again with decent people in it. Caught 8.15 train back to camp.\n\n\n\n\n","33":" Dec.12.th.\nLeft Rollestone with draft of 4 officers & 336 other ranks at 8.30 p.m.\n","34":" Dec.14th\nArrived Etaples & handed over draft\n","35":" Dec.16th.\nEntrained at Etaples with draft of 4 officers & other ranks at 2.30 p.m.\n","36":" Dec.17th.\nDetrained at Vignacourt &reported to Division. Had lunch with McCallum. Issued rations & marched to Flesselles to entrain for Edge Hill. Arrived too late for train & marched back to Vignacourt where we were billetted with","37":" &","38":" Battalions. \nMarched off at 6'30 &back\n.\n","39":"\nMoved off at 6.30 am.\n\n\n\nremainder of the Battalion in 'Needle Trench' on the way down. We were in support (D Coy) & the rest of the Battalion marched up to the front line during the night.\n","40":" Dec.22nd\nIn support. Shelled continuously but no casualties. Fritz hasn't quite got the range.\n","41":"\nMoved up to firing line at 6 p.m. to relieve 'B' the centre Coy. Communication trench & front line impassable owing to mud. So were forced to travel about 200 yds over no man's land. Fritz heard us & sent up a few flairs but failed to locate us till we were entering the trench when he opened up a few shots with rifle & machine guns. No casualties.\n","42":"\nA little sniping & a few whing bangs. Mud very bad.\n\n\n\nIn the afternoon we learned that we were to be relieved that night by the","43":" They arrived about 8.30 & kicked up a devil of a shindig. They were sniped with rifles & machine guns & one on the parados was shot through the thigh & stomach. When we got out they were waiting for us & sent over a light shrapnel barrage. We took cover in an unoccupied trench & tried to work along. But the mud was so thick that we were obliged to come out on top again. Reached 'A' Coys trench without mishap & started to work down their communication trench. Fritz opened up a very heavey barrage which lasted half an hour. By keeping very low we managed to avoid casualties. Went back to 'Needle Trench' for the night.\n","44":" Dec.25th\nSeveral casualties\n\n\n","45":" Dec.29th\nStayed at Montauban\n","46":"","47":" Div. Hqrs Sent up car & I joined them at Vignacourt\n","48":" Dec.31st.\nWent for a ride with General to Divisional School Flesselles.\n\n\n\n"}}