{"Document Name":{"0":"Diary_0322","1":"Diary_0322","2":"Diary_0322","3":"Diary_0322","4":"Diary_0322","5":"Diary_0322","6":"Diary_0322","7":"Diary_0322","8":"Diary_0322","9":"Diary_0322","10":"Diary_0322","11":"Diary_0322","12":"Diary_0322","13":"Diary_0322","14":"Diary_0322","15":"Diary_0322","16":"Diary_0322","17":"Diary_0322","18":"Diary_0322","19":"Diary_0322","20":"Diary_0322","21":"Diary_0322","22":"Diary_0322","23":"Diary_0322","24":"Diary_0322","25":"Diary_0322","26":"Diary_0322","27":"Diary_0322","28":"Diary_0322","29":"Diary_0322","30":"Diary_0322","31":"Diary_0322","32":"Diary_0322","33":"Diary_0322","34":"Diary_0322","35":"Diary_0322","36":"Diary_0322","37":"Diary_0322","38":"Diary_0322","39":"Diary_0322","40":"Diary_0322","41":"Diary_0322","42":"Diary_0322","43":"Diary_0322","44":"Diary_0322","45":"Diary_0322","46":"Diary_0322","47":"Diary_0322","48":"Diary_0322","49":"Diary_0322","50":"Diary_0322","51":"Diary_0322","52":"Diary_0322","53":"Diary_0322","54":"Diary_0322","55":"Diary_0322","56":"Diary_0322","57":"Diary_0322","58":"Diary_0322","59":"Diary_0322","60":"Diary_0322","61":"Diary_0322","62":"Diary_0322","63":"Diary_0322","64":"Diary_0322","65":"Diary_0322","66":"Diary_0322","67":"Diary_0322","68":"Diary_0322","69":"Diary_0322","70":"Diary_0322","71":"Diary_0322","72":"Diary_0322","73":"Diary_0322","74":"Diary_0322","75":"Diary_0322","76":"Diary_0322","77":"Diary_0322","78":"Diary_0322","79":"Diary_0322","80":"Diary_0322","81":"Diary_0322","82":"Diary_0322","83":"Diary_0322","84":"Diary_0322","85":"Diary_0322","86":"Diary_0322","87":"Diary_0322","88":"Diary_0322","89":"Diary_0322","90":"Diary_0322","91":"Diary_0322","92":"Diary_0322","93":"Diary_0322","94":"Diary_0322","95":"Diary_0322","96":"Diary_0322","97":"Diary_0322","98":"Diary_0322","99":"Diary_0322","100":"Diary_0322","101":"Diary_0322","102":"Diary_0322","103":"Diary_0322","104":"Diary_0322","105":"Diary_0322","106":"Diary_0322","107":"Diary_0322","108":"Diary_0322","109":"Diary_0322","110":"Diary_0322","111":"Diary_0322","112":"Diary_0322","113":"Diary_0322","114":"Diary_0322","115":"Diary_0322","116":"Diary_0322","117":"Diary_0322","118":"Diary_0322","119":"Diary_0322","120":"Diary_0322","121":"Diary_0322","122":"Diary_0322","123":"Diary_0322","124":"Diary_0322"},"Date":{"0":"unknown","1":878.0,"2":879.0,"3":880.0,"4":881.0,"5":882.0,"6":883.0,"7":884.0,"8":885.0,"9":886.0,"10":887.0,"11":888.0,"12":889.0,"13":891.0,"14":892.0,"15":893.0,"16":894.0,"17":895.0,"18":896.0,"19":897.0,"20":899.0,"21":900.0,"22":901.0,"23":902.0,"24":903.0,"25":904.0,"26":905.0,"27":906.0,"28":907.0,"29":908.0,"30":909.0,"31":910.0,"32":911.0,"33":912.0,"34":913.0,"35":914.0,"36":915.0,"37":916.0,"38":917.0,"39":918.0,"40":919.0,"41":920.0,"42":921.0,"43":922.0,"44":923.0,"45":924.0,"46":925.0,"47":926.0,"48":927.0,"49":928.0,"50":930.0,"51":931.0,"52":932.0,"53":933.0,"54":934.0,"55":935.0,"56":936.0,"57":937.0,"58":938.0,"59":939.0,"60":940.0,"61":941.0,"62":942.0,"63":943.0,"64":944.0,"65":945.0,"66":946.0,"67":947.0,"68":948.0,"69":949.0,"70":950.0,"71":951.0,"72":952.0,"73":953.0,"74":954.0,"75":955.0,"76":956.0,"77":957.0,"78":958.0,"79":959.0,"80":961.0,"81":962.0,"82":963.0,"83":964.0,"84":965.0,"85":966.0,"86":967.0,"87":968.0,"88":969.0,"89":970.0,"90":971.0,"91":972.0,"92":973.0,"93":974.0,"94":975.0,"95":976.0,"96":977.0,"97":978.0,"98":979.0,"99":980.0,"100":981.0,"101":982.0,"102":983.0,"103":984.0,"104":985.0,"105":986.0,"106":987.0,"107":988.0,"108":989.0,"109":990.0,"110":991.0,"111":992.0,"112":993.0,"113":994.0,"114":995.0,"115":996.0,"116":997.0,"117":998.0,"118":999.0,"119":1000.0,"120":1001.0,"121":1002.0,"122":1003.0,"123":1004.0,"124":1005.0},"Entry":{"0":"\n\nMy Diary from ","1":" Tel-el-Kebir\n\nOrders came for us to be prepared to move out to the Canal where a big fight is in progress. General Muster Parade for inspection by the Colonel. I had my squad out. Col complimented us on our work.\n","2":"\n\nAnniversary of my landing at Gallipoli celebrated quietly. We had our first meeting of our Sergeants Debating Society. The subject Town versus Country life. I took Town \n\nLife and Country\n\nwon as expected owing to country audience. The Colonel was in the Chair Auspicious , we are getting quite a good name as we have abolished Drink from the mew, an example the officers might easily follow.\n","3":"\n\nWas fortunate in obtaining 16 hrs leave to visit Cairo and the S M and I rode in early in the a.m. and a man took our horses back. Very hot in Cairo and not enjoyable. Had a busy day, duty and pleasure, arrived back at Tel El Kebir at 10 pm finding everything packed to go the next morning to Kantara.\n","4":"\n\nPacked my Maltese Cart and all away to the stn. I came on later after doing fatigues, boarded train at noon and had pleasant ride through some bestruck ground all the way to Kantara where we unloaded the train. Then our troubles started, things were pulled off the load and on to other waggons and as I had no harness for my cart the going was too heavy too pull so I finally\n\nstayed behind all night and let the Dr and the men go ahead with part of the stuff. The Dr is useless in a move. He just sits down and grins, it is not in him to be energetic. The others camped about a mile the other side of the Canal. The Canal is too wonderful to describe here. The immense defence scheme that has grown since I was here last.\n\nMonday 15th\n\nWaggons had unloaded all goods on to narrow gauge railway and then returned. To me the trouble started, my Maltese Cart had come down without horses, owing to having shaft harness. The transport sys and the energetic Colonel made me unload half of my stuff as it was too heavy. Then the pontoon bridge on the Suez canal opened to allow a transport of “war babies\" to pass, so we had a very enjoyable swim in the canal, eventually we drew up along side a narrow gauge railway where all the Troops were aboard a miniature train. I went with the Transport across cruel desert (along the same route Moses came from Damascus) until we reached a spot known as Hill 70.\n\nThe heat was awful 112° in the shade, and my things and panniers were dumped all over the place, and my staff was done up and the Dr lying in the shade and after about 2 hours swearing cursing, and sweating I erected my Medical Tent and commenced treating the many cases of sunstroke.\n\nTuesday 16th May\n\nWe are camped on the very spot where 14 mos ago the Indians drove Djemal Pasha and his army back from Egypt. Turks and Indians are buried all around us. Next to us are the remainder of the Tommy Yeomanry who were so disgracefully cut up by the Turks three weeks ago, we are leaving here at three am in the morning on foot to march to the scene of the fight and they are being sent back, before we left I had the happy opportunity of meeting my two old units, The 1st LHB and the 1st ALH, who are both here and were going further out than us, tired dusty and thirsty we finished packing our unit on camels by Twelve and then lay down to sleep for one hour.\n\nWednesday 17th May\n\nThe camels in charge of Indians moved off at three and the regs followed on foot. It was a beautiful night but threatened a hot day following, I brought up the rear and carried my medical companion on my back, all went well until we came to a soft stretch of isolated desert and then I got busy. I was running all over the place, fixing up the sick and lame strugglers, who kept falling out exhausted. I had a bottle of cold tea and it worked wonders, eventually they had to lend me a horse as I could not get about quickly enough, eventually we saw on the horizon an oasis of Date palms and that was our destination for we just reached it and that was all. The shade was delightful and every man was asleep in no time.\n\nTowards noon the sun was blazing fiercely and I had many cases of sunstroke I had to go out on to the desert and bring a man in on a stretcher, the sand was fearfully loose. At five pm we moved up about a mile and relieved the gallant R. Scots Fusiliers who have held the post so magnificently for two months, next to us are the 5th ALH, 15 miles further on are the 6th and","5":" we did not\n\n \n","6":" much that night except man the trenches. I was working until 10 pm and was very happy to have my water bottle filled and get my patients into the Scots Field Hospital.\n","7":"\n\nFirst thing done in the morning was to erect my dispensary right in the heart of a palm grove an ideal shady spot. Before I had the things unpacked I was rushed and we treated over 40 cases in am alone.\n\nGoing all day but main excite mens was when Col fell us in and told us that 2,500 Turks were evacuating Echerist after the camp had been blown up by the Navy and were coming in this direction. An attack might occur to-night but it is expected the following, anyhow I had all my staff and in the trenches and redoubts with full medical equipment as expected; nothing occurred but we are optimistic our only fear is if they bring much artillery but we have to hold the poss to the last man, and we have the post of honour. The ALH on Mt Sinai Peninsula are doing the most important duty of all for we in small numbers are holding the outposts for Egypt, if enemy come we know we must die but\n\nnot before the alarm has reached those on the main defence.\n","8":"\n\nBig sick parade nearly all dressings owing to septic, all tiny scratches turn septic. We were cut short of water to-day, and I had to do my dispensing out of my own supply. The 5th LH alongside us cannot understand me carrying the stuff I do, and dispensing in the firing line but I have a fine supply and it is an untold blessing. The","9":" LH went through to Romania to-day. The rest of the Brigade is at Hill 70. A Bedouin prisoner was brought in during the day. Every man was out building the redoubt up under our great working old Colonel. \n\nIt was a very favourable night for an attack and full precautions were taken. I posted my A.bs and some men in different redoubts and put first aid boxes in each, but the attack failed to come off, as we expected and we stood to arms at 3.30 am to 4.30 am.\n","10":"\n\nFine cool day, every man working strengthening the position. During the night two of our treacherous Arabs with camel corps sneaked off to meet some Turks but our patrol grabbed both parties, we four letters happy in spite of evics. Big bombardments in vicinity all day. Had to man trenches again at night.\n","11":"\n\nIt is quite disappointing when my stand to arms in am without an attack. Our position is now very strong. All our redoubts are very strong, in front of my dispensary is the graveyard where those that died of the glorious R.S.Fus lie buried. They must have made a magnificent fight. Dead Camels and Turks cause a lot of flies and every day I go round spraying with Formaldhyde which works wonders.\n\nMonday 22nd May\n\nIt is reported that 6 and 7th ALH were going out to a attack Turkish camp to-day, having not yet heard result and many Bedouin prisoners brought in to-day. Some canteen stores arrived to-day, welcome appreciation, we have only had bully beef since we arrived here, each man was allowed to buy 5\/- worth. Also mail in. I rec 6 letters, one from my brother in France which relieved my mind a deal.\n\nTuesday 23rd May\n\nEarly in the am a The Lowland unit moved off and they were relieved by no other than a detachment of my old unit The 1st LHF Amb, although I only knew one of them all the rest are . The joke is that I have a full dispensary and they have nothing and yet I am supposed to obtain my supplies from them. \n\nAnother prisoner was brought in to-day, the 6th and","12":" LH were supposed to have had a skirmish yesterday. I request and this morning rec a big box of medical comforts came, and I have partitioned half of the drop off for a hospital and the patients were getting the same treatment us as a base.\n","13":"\n\nAnniversary of an awful night at Gallipoli – the night of the armistice. Beautifully cool days lately this camp is a regular Eden, living well and as happy as can be. Nothing further about the enemy but numerous rumours are floating around about the casualties of our troops in France.\n","14":"\n\nQuiet day camp getting a bit monotonous as we can only see desert all around us. We are being remarkably well fed, the rations are splendid, and considering every thing is brought on camel it is splendid. Rec two letters from home. \n\nMy fathers birthday. I have previously cabled him congratulatory birthday wishes. The 1st LHTD Bearers went through to Romania to-day, where a lot of other LH units are reported that our horses are not at all anxious to get them here.\n","15":"\n\nWe hear we are likely to be relieved here by tomorrow but where we are going we don’t know. Sent in my returns to-day after I had detailed one of my men to the 5th LH according to a orders, but they sent him back, my staffer not noted for sobrietary. They are three Tommies – Nurses. \n","16":"\n\nRumoured that we leave this happy camp on Wednesday back to desolate Hill 70 where we believe they are building sheds for horses. Then again wild rumours are floating that we are going to England. I am getting norirably sick of war lately more so than ever before and when August comes I am going to try for furlough.\n","17":"\n\nNothin’ doin’, one night in the Mess at H’plis, during some revelry I was sworn into B’ Sqn and now I always am one of them and all the sergeants mess together, we live like Lords custards, jellies, fruits etc right out in the heart of the desert. Having nothing else to do I started a rumour going that we disembark at Southampton on","18":" to do Town Picquet in London, in half an hour over a dozen told me about in confidence straight from H.Q.\n","19":"\n\nAll sorts of rumours floating as to our destination, we leave here on Friday. Tonight there is an expedition and so attack a Turkish camp at Salama and the","20":" L H Bde and N Z M R are taking part with artillery. The","21":" L Horse leaving us so act as screen and prevent them from coming in our direction like the last time One Squadron of the 6th L Horse taking the 5th’s place.\n","22":"\n\nThe scrap at Fad el Salamana came off last night or rather this morning and was one sided, we killed 15 Turks, wounded one and took one prisoner, this is all the details we come to hand.\n\nSo far we have had no casualties but the big scrap is yet to come providing they have nos bolsted from Bis el Abb. The 7th L I transport arrived at night. They are relieving us.\n\nWrote Home.\n\nThursday 1st June\n\nEarly this morning a Taube flew over the 1st L H Bde lines to avenge yesterdays defeat. He dropped eight bombs killing 5 men wounding 13 as well as 30 horses killed of the 3rd Regs, all the casualties were in the 3rd. The first’s horses stampeded when the bombs dropped in their lines killing a few and the others bolted in the desert.\n\nWe got five over our camp. We expect to be bombed to-night. Packed up and all ready for in the a.m.\n\nFriday 2nd June\n\nTransport came at 4 a.m. and packed all my stuff on it in charge of my two men who unloaded it at the railway siding Gilban. We did not go until the kilted Scotties H.L.I. relieved us then we also went. I rode a camel to the siding where all our goods were loaded on to the light train, arrived at Kantoom at dusk where the 1st L H Bde Transport took our goods about three miles along the canal out to some desert a stiff pull for the mules.\n\nOur goods were just dumped on the desert and each man turned in for they all had to go to Tel-el-Kebir at 3 am for the horses. The Dr took one man and I am left in charge to do the M O and sanitation work.\n\nSaturday 3rd June\n\nMain body left at 3.30 am and when the remainder fell in we immediately pegged out the camp and I did the sanitation.\n\n \n\nThen we commenced hut erecting and I managed to score a immense marquee which took us half a day to pitch. Then we all knocked off for a glorious swim in the Suez Canal.\n","23":"\n\nAlongside us is the 1st L H Bde transport camp and some of my old mates are there, we have some great yarns of old times, finished my send off and built the dispensary, then partitioned half the tent off for a hospital and put two patients in it. Swam twice in the canal, we do not care if the reg. does not come back for a month.\n","24":"\n\nAs soon as we awoke news came of a terrific Naval Battle in the Nth Sea, in which we did not come off too well our losses were about equal but we lose some fine ships including Queen Mary, details are not yet to hand.\n\nWent for a ride to Kantara, heat became awful, one of the hottest days I have yet seen in Egypt made our swim more appreciated. \n","25":"\n\nThe sweet water canal runs alongside us and the Indian Lancers catch enormous fish Bream 4 and 5 lbs weight, they give them to us and they are delighted, walked over the weir to-day. We now learn that the German High Seas Fleet was driven back on to its own mine fields and lost a lot more ships besides those reported.\n","26":"\n\nWrote home, beautiful day, swimming nearly all day, received severe shock when news came that Lord Kitchener and his staff were drowned, we are not getting the best of it lately, and shudder to think of what is ahead of us if our arms are not fulfilled. \n","27":"\n\nOfficer came down to pay us and told me I had to go in charge of seventy men to Tel-el-Kebir that night. I had to pack a big box of drugs etc which went on a transport, I fell my men in at six pm and marched them to Kantara thence by train to Tel-el-Kebir, waggons took our stuff and I then marched the men up, reported and dismissed them, then saw the Dr and he was pleased to see me for her wanted to go on leave and moreover he could not get through the sick parades without drugs, and my man was not much good.\n","28":"\n\nUnpacked my things and did big sick parade and was busy all day getting supplies in then we heard the latest orders owing to our horses being sick we will not be able to draw them for a time and the regiment has to move off to Kantara at six am to0morrow, leaving a troop of each squadron to attend to the horses, so I had to pck up once again. \n\nIt is heartbreaking this rescindering orders and I am getting so used to this moving that am quite callous to it now. Dr got out of it all by going on leave leaving me to carry on.\n","29":"\n\nReveille 3.30 am, loaded G S and marched down to now deserted Tel K Station where we entrained beautifully, left immediately, arrived Kanatara seven am. Men loaded on to our transports thence to the old camp, I unpacked all my stuff and had my dispensary in lovely order did two big sick parades and admitted three patients into hospital.\n","30":"\n\nI am absolutely disgusted with this regiment for have received one hours notice to pack again and entrain for Duerdar, it now makes our eighth ridiculous move in three weeks. I packed my drugs once again in a furious rage and just as we had the transports loaded a German Taube flew over us dropping bombs one bomb just missed us two fell in the Canal the others amongst horses and camps near the pontoon bridge considering the size and the number dropped the damage was very slight about two men were killed a few wounded and nine mules killed, none of our reg were hurt. The Col gave the order to scatter, eventually we unloaded the stuff at Kanatara siding, and camped there for the night, we leave at two am.\n","31":"\n\nLoaded train arrived t Gilbay about four am met by Camel Coy, goods put on camels, arrived at Driedar but could not occupy the camp until the H.L.I. evacuated at four pm, had to lie about in the scorching sun until it pleased the Tommies to take possession, my old tent was still standing, it had been used as a sergeants mess and left in a disgusting condition. I had to clean and practically we pitch it before I could unpack my stuff for the ninth time.\n","32":"\n\nHad my dispensary in order for morning sick parade. The Camp had been left in a disgusting condition by the H.L.I. They have not done much work here and we will have to finish the job we left.\n","33":"\n\nBig sick parade, I think the men are like me becoming sick of the job. At 4 pm we had a muster parade and inspection by Gen Chauvel, our old 1st L H Brigadier. I was in charge of A.M.C. and the Gen recognised me and so the consternation of the Offs and men we talked for a long time and congratulated me on my promotion. Col Royston told him I have been doing very good work in the regiment.\n","34":"\n\nLast night one of the men was caught asleep on Sentry and he has been remanded for D.C. Martial. It has cast a gloom over the whole regiment. Applications were called to-day for comms in the Camel Corp. I in but do not fancy my chances.\n\nThe Col is leaving us and going as Brigadier, we had a number of parades at which he addressed us and the poor old fellow nearly broke down. He made this regiment best but did not get the support of the off’s. Every man worships him and I am afraid the reg will go to pieces without him.\n","35":"\n\nWe are now doing the sick parades of the 5th L.H. reg. There Dr being away I had to sit up half the night with a delirious patient, dispatch him to hospital in case.\n","36":"\n\nThings are very quite here. Terribly has camp very monotonous, everybody seems to have the hump, no one more than myself. They got the Taube that bombed us at Kantara.\n","37":"\n\nC. Parade early a.m. by Col. Murtbuncl Woods who is visiting the camp. Terribly hot day, in spite of our shady camp.\n\nRec letter from my brother, my make S.M.B. Squadron was fortunate as he obtained his com, only two were granted.\n\nEarly in a.m. twelve of our aeroplanes went over in the direction of El-Arish with what results we do not know.\n\nGeneral parade in p.m. before Gen. Ryrie, who in his usual self-booming way said farewell before he left for England, he had his recognized publicity manager Tpr Bluegum () with him.\n","38":"\n\nRode into Hill 70 on horseback in early morn to have my teeth attended to at 2nd L.H.F.S., saw Gen Ryrie depart and Col R take over, messed with the sergts, then rode on to Hill 40 To Div G I Qrs where I saw some friends and learnt that we lost 3 planes in the attack on El-Arish but they lost 3 also as well as a lot of life, rode home in cool of evening carrying a verbal confidential report from Col R to the Adjt.\n","39":"\n\nBig mail in I got six letters, replied to them, Pay day consequently lot of gambling, hot day, about 11 pm we were all roused up to evacuate the camp, as an immense cyclone had wrecked Ishmallia and was approaching in this direction. I got my patients out of the hosp, and then install my things on the ground and scooted to join the others, but we waited for over an hour, but none came although the damage done at Ishmallia was very considerable.\n","40":"\n\nWe hear our horses are well and we will probably be going down for them at the end of the week. Whilst on reconnaissance to-day one of our aeroplanes failed to report back, and we are all warned to keep a sharp look out for it.\n\n \n","41":"\n\nThe aeroplane was found about 12 miles from the 1st L.H. camp, it had descended owing to Engine trouble. A party of Turks are reported to be on the move nine miles from here.\n","42":"\n\nOne of the hottest days I have experienced. The No 6th L.H. went out to Romani to-day and the N.Z.M.R. came in reported that we will be going for ours shortly. Great rumours floating about that there has been another big battle in the North Sea and that the Bedouins have forsaken the Turks owing to religious view.\n","43":"\n\nThere must be great news somewhere for everybody seems to be excited, all sorts of rumours are as may be expected. To-day I invented a sanitation patens.\n","44":"\n\nNothing doing, camp horribly monotonous. Official accounts published of El-Arish air raid. I am disgusted with the lies, it says we got eight enemy aeroplanes, when we know for a fact they only got four. This ridiculous blindfolding of news is ruining the Allies.\n","45":"\n\nFeeling pretty bad, had an acute attack of gastrick. We are all delighted with the success of the Sherriff of Mecca and his success, we expect big things will grow out of it.\n","46":"\n\nRumour we may go back to Kantara this week, Camp becoming very monstrous in heat.\n","47":"\n\nAs I am very short of drugs I rock into Hill 70 to the N.Z.M.M.C. Although a heavy fog met some old friends and we had just messed when a Taube flew overhead. The alarm sounded and all the horses were got off the lines. He was beaten off by our machine gun fire and went to Dueidan, he then came back to us and we thought he was going to bomb us, but he was beaten off again. I was anxious to get back to Dueiden to see if any damage was done, I rode and on arrival learned that all the regt went mad and fired rifles at him, then one of our own came on the scene and chased him in the direction of Romani.\n","48":"\n\nIt appears that in the firing our plane was hit by our machine gun fire and after pursuing the enemy over Romani had to descend but another of our planes took up the chase and brought the other down. \n\nI let my two AMC men go on leave to Port Said for 60 hrs so I am doing the work of three by myself.\n","49":"\n\nBusy with expand work, enemy aeroplane over again but disappeared on arrival of one of ours. \n\nWrote stirring letter to my father telling him some facts of warfare.\n","50":"\n","51":" and","52":" Regts went out on a bit of a stunt, do not know result yet. Col R was heard to say that he is going to clear all the Turks off the desert.\n\nSunday 2md July\n\nMy AMC men came back from Port Said, the rest of this Elgshen moved from Tek to Moascar near Ishmalen which is a good camp. Alas of promotions went through to-day, the r.q.m. and the sig sgs got their lieutencises. At ten pm the 5th got an order to go out and capture some Turks and Camels, they moved off splendidly.\n","53":"\n\nThe 5th returned about noon utterly exhausted, horse and man, as they had not stopped since nine the previous night. They were successful in their purpose for they brought back to camp 109 camels and 5 prisoners. Their horses were so exhausted they could not push on for the main body. \n\nI sent my papers in to-day along with all the other non-com for my commission and I was the only non-com recommended I know not what will come out of it as I am so use to disappointment.\n\nTuesday 4th June\n\nIt is really amusing the way we are messed about, no sign of us being relieved. Congratulated by C of C of good work done by the Anzac MSA Div.\n","54":"\n\nBig mail in I rec a few letters, also pay so man and I decided to go to Port Said on leave tomorrow.\n","55":"\n\nLeft camp 6 am for Galban, rode 2 camels at best pace all the way only to find we had to wait 3 hours for light train, arrived at Kantara and whilst crossing pontoon bridge saw Train leaving Station, nothing else to do but camp for the night. Went to Scotch Field Amb who very hospitably put us up for the night and gave us breakfast.\n","56":"\n\nCaught a goods train 10 am arrived in the miserable town of Port Said, had a spruce up, then tis out to enjoy ourselves, but had to make our own fun, surfing was the only really good thing. Everything terribly expensive, we stayed at the best hotel, and our ex’s were £1 a day, hotel alone.\n","57":"\n\nSpent the day enjoyably all over harbour, wins over warships. We saw latest aerial machine gun which fires shrapnel and has self adjusting time fuse. Gave some letters to passengers on the Mooltan to post in Melb. \n\nAt night we fell foul of Red caps, I hit one right out expect crime to come to regs, but it was worth it.\n\nNews of big success came through and French civilian shouted us three bottles of champagne.\n","58":"\n\nNearly missed train, arrived Kantara to find train did not go until 4 pm, went to Gloucester Hussars Sgts Mess where we had a good time and finally arrived back in camp at 7 pm (?)\n","59":"\n\nA good deal of amusement was caused when the crime sheets came through from Port Said, so we expect\n\nto go before the Major in the morning. The next news was that our commission had come through and five of us are accepted, I am one of them, nothing definite is known yet, but I had a lot of premature congrats and needless to say there was a christening.\n\nTuesday 11th\n\nAt Stand to-arms the picked men paraded before the adjt and he said that he was going to Brigade to find out whether the 6th L.H. were sending any men or not, if they do only three of us will go. \n\nWent before Major Moray to be remanded until to-morrow. R.S.M. doing dirty zealous work as his application was turned down. However we are not frightened of the change but if the old Major gets the wrong view of the case it may effect my commission. \n\nThe","60":" Brigade went out on a stint but missed their objective but they killed 4 Turks and took prisoners.\n","61":"\n\nWe were paraded at 10 am before the Major and the Dr who could not help laughing throughout, after hearing the evidence he said he would have to let us go with a reprimand. Nothing further about our coms. \n\nRec a letter from Prahran which made me feel very small.\n","62":"\n\nThis regt is going to Hell there is nothing else but O. Room all day, enquiries etc. The latest is the court-martial of a drunken brute of an officer all the sgts are giving evidence.\n","63":"\n\nVery hot day, the men go about naked and are as brown as berries. The date palms are all heavy laden with ripening fruit, but we do not understand them like the Bedouins. They are just falling to the ground for the want of a little knowledge.\n\nWrote Norn.\n","64":"\n\nAt last we are going in for our horses expect to leave here on Monday. Great news from all fronts, so far. The big offensive is doing well\n","65":"\n\nHot day. No mail as expected, we leave here to-morrow for Kantara are being relieved by Scottish Horse. Advance party went to-day.\n","66":"\n\nScottish Horse took over redoubts in morning, busy packing and pulling down tents, packed on camels left for Gilban, loaded train, unloaded again at Kantara at 11 pm. Regt moved out to camp I stayed behind with goods all night.\n","67":"\n\nTransports came for our stuff and greatly surprised when we arrived to find camp in order. Our horses arrived, they were in fine lot my old mare looks particularly well. Busy all day, we are off again shortly so erected bell tent only.\n\nBig mail in I got 6 letters including letter from Grand.\n","68":"\n\nBig sick parade in a.m., many casualties during day, etc, kicks, falls and one man who diving in Suez Canal hit the bottom and fractured his spine, I had to take a stretcher party to the poor boy, he was a fine lad, and is now totally paralized, saddler, parades etc etc all day long. This is not a very systemated Reg. \n\nSpent evening and spare time with my mate Sullie over at the 1st L.H.F.A. Transport camp, he has had a great time.\n","69":"\n\nGreat rumours in that a force of 10,000 Aust. Germ, Turkish troops have entrenched 3 miles from Bir el Abb. We are making great packs. I was surprised at the number of heavy guns that went through, if it does realize I hope we can get into it mounted.\n","70":"\n\nRode down on old Zigi to Scottish Field Amb to see the poor lad who fractured his spine. The renowned Surgeon Professor Weecks took me to him, I found him in a low condition totally paralized and dying. The poor boy was very cheerful and he died at 5 p.m. He was one of my pets, and the finest lad in the regt.\n\nI now have very big marquee up doing big sick parade. All our horses are bunched into the shade of some lovely trees during the heat of the day.\n","71":"\n\nHolliday buried early in morning. Had to ride to K Bridge to Scottish Hosp. returned home found all horses gon to shade, took the mare up and stayed all day. Nothing further from Romani, a Taube flew over us this morning.\n","72":"\n\nSpent hot day writing letters, have dropped a lot lately in this respect, rec word from my brothers in France. Good news on all fronts, we much appreciate our daily swim.\n","73":"\n\nCamp in full swing now regiment well equipped, can move off any minute, sending a lot of men to hospital.\n","74":"\n\nGood news from France. Austs are right in thick of it, we hear that an enormous army of Turks are marching on us as the Kaiser has ordered the Canal to be taken at all costs, we are moving off to-morrow to Serapeum, what for I know not.\n","75":"\n\nLoaded all my goods on transports sent them with second party men. I waited unil last train at 8 p.m. I rode Zigi and carried a big medical pannier on my back, we arrived at Kantara and\n\nhad to wait till eleven before we could truck the horses, all aboard arrived Serapeum early in a.m. found one man shout swornered he fell out of the train. I rode back for him, found him horribly cut about, and nearly killed with shock, dressed him and stimulated him, took him to hospital in a special train.\n\nThursday 27th \n\nCould not cross the canal so it took me four hours to finally get him to hospital. I think I absolutely saved his life, then I set out to follow the others, my poor mare had no breakfast or drink in a blazing sun, finally arrived at a big called rail head where the lights along terminals. There I found my A.M.C. men with the stores.\n\nThe regt had moved on three miles over a rough desert to a place called Gebel Hebertd where they relieved the 9th L.H., all the 3rd L.H. Bde went from railhead to Bulna, I stopped at R-lead until the camels were loaded then saddled and rode my precious little mare to our camp, both of us were nearly done up when we reported to the Doc, it was the first I had seen of him since we left Kantara, after I had a cup of tea the camels arrived and I unloaded them and literally fell down along side fast asleep.\n","76":"\n\nAwoke at dawn and commenced work, had 100 and 1 jobs to-do, the","77":" L.H. left a lot of beds behind and I went around the heavy sands pinching them for my hospital, after breakfast I was in charge of two fatigue parties erecting marquees, one for dispensary, other for hospital, finally erected, moved in and unpacked.\n\nAt three o’clock I was ready to receive patients, did a sick parade and sat down, then the Doc came in and congratulated me, also the O.C. and informed me next day I had to go to Ishmallia for drugs and red cross stores, worked till 10 making out reports and requisitions.\n","78":"\n\nLast night a limber ran over a man and broke his foot. I set it and made a lovely job, I was very pleased with result, put him in waggon this morning and took him to railhead E. Anglia Hospital. Then after a wait of two hours boarded light rlwy and arrived at pontoon bridge hence on donkey to Serapeum Stn, had to wait two hrs for train, finally arrived at Islamallia, where after a clean up I started on my business, my first was to the Aust Red Cross Stores. They treated me splendidly, I explained how we were situated and they simply could not do enough for me. They showered me with gifts, I got two cases of stuff from razors to champagne, they even offered to supply the money to erect a wooden hospital for us.\n\nA man that growls about being in Australia ought to be shot, so far successful.\n\nI then went around for drugs and got them, that finished I started to enjoy my short holiday in this pretty town, but such was not to be, as I became ill and at three I had such a raging fever I had to go to bed at an hotel, I shivered so much that I got up and went down to the lake and got into the water still shivering. This did me good, then a good dose of Quinine pulled me to-gether, it spoiled my holiday for after a sleepless night I caught the next train in the morning to Serapeum.\n","79":"\n\nArrived Serapeum about mid-day in awful heat, got right as far as rail head where had to wait until five for ration waggons, arrived back at camp. Dr awfully pleased with my success. \n\nFound 12 letters awaiting me, went to bed tired but happy.\n","80":"\n\nSaddled the mare before breaky and rode to rail head then train to the Canal where I had an enjoyable swim. Then met the hospital boat and took off my goods, I had to leave them and arrange for transport to the light railway, it was Hell, trying to make these thick headed English Yokels understand. I eventually persuaded a band of niggers to do the work, the Arabic is a blessing, after much cursing and swearing I arrived home after over 20 loads and unloads. The mare is in splendid condition.\n","81":"\n\nOpened up all my stuff, Dr delighted. I furnished my hosp complete, it looms lovely, everything from toothbrushes to books, I am proud of it, then I put the day in dispensary, dispensed 30lbs prescripts.\n","82":"\n\nGreat news we hear that the Turks have approached in great strength and have taken Katia and Oghratina, but this may be only a trap, my old brigade had done great work.\n","83":"\n\nI have seven men in hospital all bad, rec orders that a squadron had to proceed to an unknown destination during the day, well I was awfully keen on it and paraded to Col McIntosh for permission to go. The Dr was away visiting outposts he returned just in time to see me saddle the mare.\n\nHe was disgusted at missing his chance, laughinly said I had stolen a march on him. The squadron was a composite one 170 strong, under our best officer Maj Don Cameron, we left camp at five pm in open formation, we moved off at a great pace, the going was very heavy, the sand in places up to the horses knees, we had three short stops and finally watered at railhead Ferry Post 6 miles from Ishmallia, we unsaddled and put our horses in a stable lately used by the London “Roughriders\" (They are very rough) we had journeyed 12 miles in 3¾ hours, a great march.\n\nThe mare went beautifully, we fed up and lay down in our blankets expecting a sudden move through the night.\n\nSaturday 5th\n\nNot going today so fed our horses well, and camped. News came through that the 1st and 2nd LH Bde had got behind the enemy and taken 400 prisoners, we were delighted but hope we will get a smack at them to-morrow, made ourselves comf for night.\n","84":"\n\nWe attended a Tommy C. Parade in a.m., it is the first I have had opp of going to for months. We are still stationed at F.P.R.H. but should go out, before this, glorious news to hand. Near Ogrcitina and Katia there has been heavy fighting and later we heard the glorious news that the 1st and","85":" L.H. Bdes were responsible for the capture of 3,000 Turks and a German machine gun section, we had 500 casualties which must effect us heavily. \n\nI am proud and exultant about my old unit, I knew what they did 12 months to-night at Popes Hill and now they have achieved fame as Cavaltry. We are disappointed at not being in the thick of it but we have to hold an important post.\n","86":"\n\nWe are off to-morrow to take up further outposts, just lolled about all day waiting for further news about our mates glorious win, the latest reports show that the casualties were chiefly amongst the Anzac M.A.D. Div.\n\nPrisoners keep pouring in, the latest a German M Gun section, a lot of the prisoners are poor Albanians whom the Turks have forced to march from Constantinople on foot. They had not tasted good water for three months. They have been seven months on the way. Col. Royston especially distinguished himself.\n","87":"\n\nSaddled up early in morning and left camp clean, then rode out about four miles to\n\n \n\nan outpost called “Hagley Park\", where we relieved L.H. Rough riders, only half the squadron came with us, Capt F. taking half to another outpost called Duntroon. Our camp had horse sheds etc but I never saw such a filthy camp. The Tommies left it in a cond, I spent all day killing flies and repairing sanitation.\n","88":"\n\nI was put in charge of a party of 4 men to ride back to Hebesha for goods etc, it was a heavy ride and when I got there the Doc wanted to keep me, he has to do my work, but finally he let me come and bring out a lot of goods so that I can start a hosp of my own.\n\nWe arrived home about 3 pm, my great little mare never turned a hair, I pinched a pack horse in there, and the Maj was lighter.\n","89":"\n\nTwo years to-day since I enlisted and it finds me still going strong. They are still fighting 9 miles from here but we cannot get into them as we have to man 12 outposts, and patrols A few of our men were engaged, we had one\n\nkilled and two wounded includ Col Royston, the old fellow was in his glory, he knocked up nine horses and would not leave even when he was hit.\n","90":"\n\nDid my six miles rounds of outposts, attending sick and looking after casualties, spent the day at Duntroon with Capt F. party. They were waiting for me with a big number of sick and dressings, it was a compliment to me for they had more confidence in me than an English Doctor close handy.\n\nI carry some powerful fly poisons and around there camp in water, I must have killed millions. Then I rode to H.Qrs and paraded to Staff Captain, who obtained for me disinfectant, one R.A.M.C. refused.\n\nMy gallant little mare never turned a hair although I rode her 12 miles through hravy sand. Could hear the guns all day from Oghratinia, they are still pushing the enemy back, they took more prisoners to-day. They are a motley lot.\n","91":"\n\nStayed Hagley Park fixing up a little hospital of three beds. I got some more stuff out and now have a fine little surgery on my own. \n\nTurks are putting up a stand the other side of Bir el Abd.\n\n \n","92":"\n\nDid the camp sick parade then saddled and rode to Duntroon where I found a good crowd awaiting me. The Capt congrat me on my victory over the flies. I brought two sick men back with me for the hospital for a rest.\n","93":"\n\nMail day. I received nine letters and pleased I was all well, no word from brother in France, answered them all.\n","94":"\n\nThen saddled up and took one of my patients back to Hebiete to see the Dr, arrived there and found hospital full. A lot of Red Cross goods arrived. They miss me like \n","95":"\n\nPacked a lot of goods then put them on a pack horse with C. Squadron’s mail and set off for Hagley Park, arrived there the bags were rushed, every one seemed to have letters.\n\nMy mare was a bit sore footed, will have her shod to-morrow.\n","96":"\n\nI am horribly mixed up with dates, no one seems to know definitely the day or date. Have made myself comfy here, a lot of books and conveniences, one of my niggers worships me and is acting as my batman, brings me a bucket of water over a mile each morning to wash in, rode to Duntroon did sick parade, nothing exciting to report.\n\n \n\nHad a rest at home all day, started fly killing campaign, got millions.\n\nMy nigger batman Abdul Lathelf, has my little hut speckles, he spends all his time cleaing it.\n\nHear we may be relieved shortly.\n","97":"\n\nRode to Duntroon did sick parade then to railhead to obtain fly poisons etc, coming home I felt pains and immediately after I unsaddled and had a bath I collapsed, by six pm I had a raging fever, but dosed myself and went off into a heavy sleep.\n\nSunday 20th Aug\n\nSpent miserable day. I fear I am breaking up at last. I cannot eat and suffer from insomnia. A night developed a high temperature as soon as the sun went down.\n\nThe 11th L.H. are relieving us on Tuesday and we go back to Hebector.\n","98":" 21sy","99":" Officers came out to-day, they will relieve us at 4 pm to-morrow.\n\nI wrote a slashing poem to-day on the desert although I was far from well, did not eat all day and could not sleep, took morphine, did not improve, spent bad night.\n","100":"\n\nPacked up and ready.","101":" took over at 4 pm. They\n\nmarched in and we marched out, they make us jealous talking of their fight, they lost over 20 men. \n\nAn exciting incident occurred on the march home. I was riding in the rear when I noticed three horses down in front badly thrown by the ground signal wire. I galloped up thinking someone may be hurt and just as I reached there they cut the wire and I got caught myself, my horse plunged a lot but was soon free. The horse was badly gashed and the OC asked me would I stay behind and dress it. I did so and it was pretty late when I arrived at Heberta, did not sleep a wink.\n","102":"\n\nAm a very busy man, going all day fixing up neglected work, inculcating again my returns will be in a pretty state when I have to make them up. My face is all swollen but had a good feed to-day.\n","103":"\n\nRode into Railhead took man to Hosp, obtained a lot of drugs. B Poisons, busy all day returns etc. feel much better and worked hard to make me sleepy, played cards till late and went to bed tired and had a lovely sleep.\n\nMy hospital is full up and doing well.\n","104":"\n\nA lot of promotions went through. Maj Mac promoted Lieut Col, S.M. got a lieutenancy and right down to trooper in A Squad. My commission out of this off, over fifty are similarly disappointed.\n\n \n","105":"\n\nBad news Cholera has broken out amongst the E.L.C. natives, one death. They were all immediately recalled into a large compound and quarantined, it is a big thing, as these niggers do all the transport work, we have to look after camels etc whilst they watch us.\n","106":"\n\nSent one nigger in a suspect I had all the handling of the poor beggar, anxiously awaiting diagnosis.\n\nOne party B Squd went out to El-Ferdas, to do natives work, etc. mail in rec 5 letters all well.\n","107":"\n\nTo-day I had a quarrel in the mess with a superior rank to myself. We were very heated and came to blows, each of us lost our heads, and it was a case of resignation for a junior member like myself. I resigned and apologized and my adversary then publicly apologized to me, then we had it out as man to man and finished up better friends than ever, shaking hands and drinking.\n\nIf I know anything it is coming and regardless of feeling and this alteration clears the atmosphere.\n\nMonday 29th Aug\n\nThe Cholera embargo has been lifted and yet no leave must be granted from No 2 Sect. Anonimous rumours circulating on good foundation that we are to lose our horses and get camels. 6th, 11th and","108":" Rifle, God forbid. All the native camel drivers are quarantined and some troopers are doing the work. It is amusing to hear their minmicy of Gibi Bakishlish Mungaree etc.\n\nAt night while enjoying a game of cards we\n\n the great news that Roumania had declared war on the Central Powers, Oh that it is true.\n","109":"\n\nWe definitely believe we are going to lose our horses and be replaced by camels now if so we must get some fighting. \n\nRode out to the sands and with the Colonel and Doctor to inoculate B Squadron, did so, coming home Col complemented me on recent work and discussed my com. One my mates the F.Q.M.S. has never reverted to the ranks rather than submit so the puppy of a VA we have.\n\nWednesday 31st\n\nDefinitely announced in papers that Roumania is in with us, I see visions of Australia after all. Rode out with the Doc to Land’s End to finish inoculations that the Germans put Cholera virus in the water at Bir el Abd.\n","110":"\n\nOur Machine gun section arrived back to-day from Romani loaded down with war trophies etc. they have exciting tales to tell of the scrap but it all centres around one man Col Royston. The new R.S.M. is a hated beast and carries his life in his hands, he broke A Squadron and is trying the same on H. Qrs Sgts. He has me in such a state that I’ll knock him regardless of rank.\n","111":"\n\nR.S.M. under close arrest, he is most contemptible beast I have yet to met in the whole service. We play poker every night, I hardly run on luck, for a time the reverse passed in with a vengeance. \n","112":"\n\nDoc went on leave to Cairo, he is a character, just says “carry on\" and cleared out. I am acting Doctor.\n\nI am very worried over my brother as a big casualty list has just come through, I have not yet seen it.\n","113":"\n\nRode into R’head after I did sick parade for drugs, my mare is so well I cannot hold her, she bolted yesterday with the groom.\n","114":"\n\nHeard the new unpopular R.S.M. counted out this morning, I was sorry even though he is a cad.\n\nIt seems definite that we are getting camels, every man is cursing.\n","115":"\n\nI wrote a rather good poem on Conscription to-day. That ought to be appeal, Gardeyn, by telegrams, it seems certain to take place which will be a blessing, we are to get the vote and make a certainty of it. Doc arrived back with great news of naval battle \n","116":"\n\nCamels seem a certainty now. Put in for leave to Cairo, on duty. This pay mortgaged, draw on next pay.\n\nMail in, rec 6 letters, none from my brother, 60,000 casualties in France making me very unsecure.\n","117":" \n\nGood news on all fronts, everyone is optimistic, things are very quiet in camp.\n\nWrote home and sent photos. Leave has been stopped, likelihood of us moving off.\n","118":" \n\nJudging by paper the whole world seems marvelling as the recent light horse work. Am in a horribly unsettled state of mind, my finend generally sits and writes poetry all day, I only wish the muse would haunt me as it does him.\n","119":" \n\nThere is to be a competition between troops of the squadrons in a drill and shooting competition. H.Qrs are supplying a troop and I am coaching them. We were firing the range all day, I shot well myself. \n\nOne of our aeroplanes came down last night near our patrol, engine trouble, we had to guard it. The pilots walked in.\n","120":" \n\nRest of mail in. I rec a parcel of socks from my sister for my birthday. No word from my brother, am terribly amxious about them.\n\nC. Parade at night.\n","121":" \n\nA party left for rest camp 1 off and 30o at Alex, for 7 days, I expect I will go in next. Rec 50 reinforcement horses from Remount depot.\n","122":"\n\nRode to Serapeum to see dentist, had glorious swim in the canal, returned to do some dispensing. Great news on all fronts.\n","123":"\n\nOh happy relief, I rec a letter from my brother Lionel in France, he read I had been killed in action, that is why he did not write. My other poor brother little Lolly boy has been wounded and is in London, progressing favourably, what a relief it was to me no one save a loving elder brother can know. I replied immediately.\n","124":"\n\nMy birthday, my third on active service, it was a happy one, as I had my load of worry lifted since I heard from my brothers.\n\nIn morn I rode to railhead, put Ziggy over jumps at Artillery riding school. Returned and had my health drunk at lunch time, all members of mess, cost me 106 piastres for the day. \n\nI am now going to close my third diary down and send it home. This diary has seen me suffer sorrowfully and in after years I may read it as a chronicle of a fight with fate.\n\n"}}