{"Document Name":{"0":"Diary_0115","1":"Diary_0115","2":"Diary_0115","3":"Diary_0115","4":"Diary_0115","5":"Diary_0115","6":"Diary_0115","7":"Diary_0115","8":"Diary_0115","9":"Diary_0115","10":"Diary_0115","11":"Diary_0115","12":"Diary_0115","13":"Diary_0115","14":"Diary_0115","15":"Diary_0115","16":"Diary_0115","17":"Diary_0115","18":"Diary_0115","19":"Diary_0115","20":"Diary_0115","21":"Diary_0115","22":"Diary_0115","23":"Diary_0115","24":"Diary_0115","25":"Diary_0115","26":"Diary_0115","27":"Diary_0115","28":"Diary_0115","29":"Diary_0115","30":"Diary_0115","31":"Diary_0115","32":"Diary_0115","33":"Diary_0115","34":"Diary_0115","35":"Diary_0115","36":"Diary_0115","37":"Diary_0115","38":"Diary_0115","39":"Diary_0115","40":"Diary_0115","41":"Diary_0115","42":"Diary_0115","43":"Diary_0115","44":"Diary_0115","45":"Diary_0115","46":"Diary_0115","47":"Diary_0115","48":"Diary_0115","49":"Diary_0115","50":"Diary_0115","51":"Diary_0115","52":"Diary_0115","53":"Diary_0115","54":"Diary_0115","55":"Diary_0115","56":"Diary_0115","57":"Diary_0115","58":"Diary_0115","59":"Diary_0115","60":"Diary_0115","61":"Diary_0115","62":"Diary_0115","63":"Diary_0115","64":"Diary_0115"},"Date":{"0":"unknown","1":297.0,"2":298.0,"3":299.0,"4":300.0,"5":301.0,"6":302.0,"7":303.0,"8":304.0,"9":305.0,"10":306.0,"11":307.0,"12":309.0,"13":310.0,"14":311.0,"15":312.0,"16":313.0,"17":314.0,"18":315.0,"19":316.0,"20":317.0,"21":318.0,"22":319.0,"23":320.0,"24":321.0,"25":322.0,"26":323.0,"27":341.0,"28":342.0,"29":343.0,"30":354.0,"31":355.0,"32":356.0,"33":357.0,"34":378.0,"35":387.0,"36":388.0,"37":389.0,"38":390.0,"39":391.0,"40":392.0,"41":393.0,"42":404.0,"43":445.0,"44":453.0,"45":454.0,"46":455.0,"47":456.0,"48":457.0,"49":458.0,"50":459.0,"51":460.0,"52":461.0,"53":462.0,"54":465.0,"55":466.0,"56":467.0,"57":468.0,"58":469.0,"59":494.0,"60":496.0,"61":497.0,"62":498.0,"63":499.0,"64":500.0},"Entry":{"0":"\n\nOn ","1":" 8.30 am I embarked on Star of Victoria at Wool’loo Bay. During the morning I had nothing to do but watch the loading of the Horses which was done quickly & without hitch the whole lot of some 450 odd horses being put on shortly before 12 md Having said goodbye to Mother & Father who were on the wharf, & all being on board. We got under way about 12 md amidst much cheering from relatives & friends of the troops. We moved slowly down to Cremorne Bay where we anchored in company with the Clan Macquorqudale. During that afternoon we all shook down to our new surroundings & at 5 pm I attended to a small Sick Parade at the Hospital which was is right aft & just above the propeller. Here was there is much noise vibration & on both sides of the Hospital separated\n\nonly by a narrow passage are horses.\n\nThe Hospital in this part of the ship consists of 3 so called wards 2 of which contained 4 bunks (2 tiers) & the other (marked down as the Isolation ward) contained 2 bunks. This latter would be I should say barely 8 ft by 8 ft. Another Room attached & about same size we intended for the use of Venereal patients a no. of whom had been brought aboard apparently in defiance of the regulations this by order I believe of the C.O., himself a medico.\n\nAnother small box of a Room adjacent we used as a dispensary\n\nIn addition to this however there was more Hospital Accomodation provided on the Marconi Deck at Port side. This was a well ventilated wooden room in which were 6 beds. So altogether we had 16 beds. I believe only for the Captain of the Ship remonstrating we would not have had the latter at all. As regards a room suitable to be made into say a Casualty Room & operating theatre combined There was none. I accordingly arranged to do all Cas work in one of the 4 bunk Cabins in the Hospital Aft. Here we rigged up the Steriliser & got ready in a tray instruments for Casualty work. As regards a supply of water. This had to be conveyed in a tin can some little distance. However there was plenty of Iodine so we determined that at any rate Antisepsis rather than Asepsis\n\nwould prevail.\n\nDuring Afternoon we were inspected for last time by the transport officers & were treated to lively lines by the Artillery Band which went round & round the transports in a launch specially hired for the occasion. On this also were many friends of those on board.\n\nAt 6 pm we had dinner which was well cooked plenty of it & varied. After Dinner I felt the natural thing was to go into the City but then I remembered where I was & felt it was not to be. Instead I talked to the S.M.O. & then about 10 pm went to bed after taking Chloretone, Qr X. which I had started 4th hrly about 2 pm\n\nNext morning","2":" We were all up before 6 am as at that time we were due to leave Sydney We started the Clan\n\nleaving first then ourselves (the Star of Victoria) and Euripides last We passed quietly & quickly down the Harbour & before we had time to realise it had passed outside the Heads & dropped the Pilot. Then I began to notice that the water was not smooth & that the boat was rolling a good deal & that I was in spite of the Chloretone beginning to feel green\n\nWell I was sick then went down to Breakfast came up after having some Porridge & shortly after lost that.\n\nHowever at Lunch time I felt well again & have never felt sick since & have not missed a meal\n\nDown the Coast we kept in sight of land & one could recognise the Headlands around Bulli, Woollongong etc .\n\nThat afternoon I did the sick parade at 5 pm & admitted a man with a throat very suspicious of Diptheria He got Antitoxin of which we have a very small supply on board & his throat painted w Iodine He was quite well in 3 days.\n\nWednesday 21st Got up before 6 am Coast still in sight but now outside Victoria. Had a bath with sponge & bucket of fresh water. (Yesterday foolishly had a salt water bath & wondered why I could not get up a lather).\n\nDressed leisurely & attended Sick Parade 7 am. From this I admitted 3 or 4 men with Feverishness, running noses & sore throats. The Start of an Influenza Epidemic on board 8 am Breakfast. 9 am Went around Hospital with S.M.O. Fullerton. This took about 20 minutes largely owing to fact that we have put\n\nin charge of Hospital 2 Naval Sick Bay Attendants. These men came out to go away with Hospital Ship Gran but were too late to catch her so are now on their way back to Navy They have been many years in Navy & thoroughly know Hospital work their knowledge apparently is quite equivalent to that of a Sister in Sydney Hospital & vastly superior to those indifferent beings we make wards men in Sydney Hospital They even are trained in Laboratory work & can stain for K L T B etc & know them when they see them. In fact they were very disappointed when I told them I did not have a microscope as they wished to look for K L in the ?Diphtheritics throat.\n\nOur own A M C men beside them are raw material. The latter to no. of 5 were detailed as follows\n\nCorporal Gabriel in charge of Dispensary quite smartest of lot, has done assaying so knows a bit about Chemistry rather green on Dispensing but very eager to pick it up & knows rudiments already. However as most drugs are in Tabloid form & made up as Stock mixtures he cannot make any serious mistakes. L. Corp Scott a good worker put in charge of Venereal Squadron all of whom are Gen except one who is undoubtedly d. These to no of 6 he vigorously syringes out about 3 times a day.\n\nPtes Rye, Gillies & Tomkins, the 1st a rather sharp looking fellow (cannot quite size him up yet) I think he feels rather superior & has rather an independent manner but quite willing to work.\n\nGillies rather headed (nephew of Sinclair Gillies) but willing. Tomkins an ex school master & I\n\nshould think well over 40 is rather sanctimonious in manner & speech & speaks accordingly.\n\nHe is very anxious after other peoples welfare Spiritual as well as physical (meat pie episode).\n\nAt 12 md. Had a Spar with one of Officers find it strange with ship rolling however did not get hurt & enjoyed it. The Vet officer joined me. he is a loud voiced chap always talking, generally about himself & his episodes & drinking a good deal of whisky In his Sparring he hits very hard which is not a fair thing as the men he has met so far are not his weight\n","3":" 5.30 pm. after being out of sight of land since early morning sighted Wilsons Promontory & islands lying around we went very close & admired very much the\n\nrough & rugged lines of coast in this part. Dinner 6 pm Bed shortly before 10 pm\n","4":" Passed Cape Otway early this morning, could see land dimly in distance. Will not now see any land till we get to Albany. Euripides is ahead while Clan is out of sight astern. Our Boat is doing between 300 & 310 miles per diem.\n\nAm gradually getting to know the Ships officers\n\nWireless operator a very decent chap about 24. It appears he was on the \"Volturno\" when she was afire in Atlantic. He stuck to his post & brought the other vessells around He has a very poor opinion of the American Newspaper Reporters after that Incident.\n\nAlso yarned to Chief Engineer last night. He is a dour old chap from North of Ireland & is I believe very\n\ncareful of his coal consumption. He is quite pleased that at night we are steaming with lights out I understand It saves coal\n\nHe told me interesting tales of ships he had been on in Eastern waters one vessell he was on about 25 years ago. One day in Engine room was 128°F & in Stokehold 157°.\n\nDuring today have done usual round had a few spars with the gloves stripped with Lieut Broadbent morn & evening. Latter a good type of Duntroon boy in charge of Machine Gun Section, very likeable & full of life. I think he will give a good account of himself in the war as every one else in the unit.\n\nIt gets quite monotonous at sea out of sight of land\n\nInfluenza Epidemic is increasing & have now got the Bottom & top Hospital full\n\nno serious cases yet.\n","5":" much same sort of day having big sick parades & have admitted a good many today.\n\nI wouldn’t be surprised if Horses had a good deal to do with it as a great no. of them have colds.\n\nWatched today Horses on Main Deck taken out of their boxes & led around the deck mats being placed on the Deck to prevent them slipping. The poor beasts are very shaky & weak in the legs already & look dispirited This walking them around however does them a great deal of good However Horses are comparatively well off on our ship, in other ships I hear of some cases where there are horses away down below the water line in the Hold\n\nThis leading Horses around & Horse boxes being next to Hospital has\n\ncaused a dirty smell around that institution. However it is only the Hospital The Vet Oficer is just as dirty in the Cabin which he & I share & leaves his dirty clothes all over the Cabin an objectionable type indeed. I had a spar with him today. He is very heavy but has not much wind. He started off hitting hard so I retaliated & got him a few good hard straight lefts. Was not touched myself. Since then he has not shown so much enthusiasm for boxing\n","6":" Still Influenza Epidemic Have got space additional on Marconia deck canvas covered. This gives us 9 additional beds all now full Today O.C. & Vet had a race on board neither won but OC severely sprained his leg & Vet his knee.\n\nOld enough to know better than to go running about like a two year old.\n\nHave had usual exercise. Have by now got all Medical Stores checked We have no nail brushes & no Blue Ointment or Silver Nitrate. Will have to try & get these at Albany.\n","7":" A quiet day with a short & sweet Service in morning nothing of note happened. We are all eagerly looking forward to tomorrow when we arrive at Albany where we will meet the other Transports Many are the Speculations concerning the Escort & how long we will stay in Albany & if we will be allowed ashore etc We are looking forward to a grand sight. The Euripides today is not in sight\n","8":" Everybody is awake early & up a little before 6 am We spot the land once more & everybody’s spirits rise. About 7.45 am we began to enter the Harbour between bare & desolate\n\nlooking rocky Headlands & then what a sight as we enter the Outer Harbour There before us are 25 ships at anchor Our band comes up on deck & plays patriotic airs are given & every one feels excited & I am sure thrilled by this sight before us.\n\nWe were all quite reluctant to go down to Breakfast. Outside the Harbour later on appears a Warship the Melbourne However she does not come in but stops on Guard at the entrance. We were disappointed to learn that there was to be no leave & especially so when we saw a Steam tug arrive at our vessell & see nos of the AIF on her They had got into Albany before the order was given had been stranded there a night much to their delight & were now on their way back to their ships\n\nI at once thought of the drugs I wanted\n\n& as the SMO was not anxious to go I thought to myself I will work this gag for all it is worth.\n\nLater on in the day the Euripides & the Clan Mac arrived on both of which occasions our band lustily played & we stood bye to cheer.\n\nOf course being all impatient to get to Albany once there I felt just as impatient to get away again & I was continually asking \"Sparks\" when we were going again. I am afraid he got rather tired of the question.\n","9":" We are waiting for the N Z transports to come in no sign all day & no sign of departing. Influenza still going strong. Have now more room still on Marconi deck & have altogether 30 patients in Hospital. Stopping stationary & wet miserable weather in this place seems to have accentuated the Disease\n","10":" Getting very bored at standing still no longer see anything to enthurse over in the sight of all the transports but at 10 am our hopes arose again as we saw coming over the Horizon the N Z contingent with a Jap Warship an English & the HMAS Sydney.\n\nGetting closer we saw the 10 N Z transports all painted gray thereby putting ours to shame & looking very well. Much was the Enthusiasm & how proud we were of our ships We never quite realised before what it was to belong to this Empire & how grateful everyone felt towards the Jap. & how we wished the Jap would only come close to us so that they could hear our cheers - but they didn’t, steamed in on the west side & after staying a short time steamed out again to sea now we felt we wont be long about getting away.\n","11":" I have leave from OC to proceed to Orvieto the Flag Ship to get permission to get Med Stores\n\nWe do not get off on the Tug (myself & Lt Fitzpatrick the Quatermaster who is also going to Orvieto) till 2.45 pm The Getting off was exciting. The Sea was rough & they would not put down the Gangway as it would have been smashed. We consequently had to go down the Rope ladder which we did not relish It is a long way down when you start & what with slippery boots I felt very insecure. I nearly tumbled in to the water but managed to get on to the tug after an agonising interval looking I am afraid rather undignified. During my descent the Skipper of the tug a low boy absolutely typical\n\nof what one sees in Wor’loo had a wordy warfare with the OC who foolishly tried to tell him his job & then worse still, did a lot of futile arguing with him. We started off to do the Rounds then & went to nearly every ship in the Harbour before we got to the Orvieoto. It was very amusing to hear the comments of the crowd on each boat as we came alongside & the vigorous profanity on the part of our skipper (Tugboat) directed at various individuals who would either not catch a line or whose looks he did not like.\n\nParticularly he took great offence when he saw a lot of grinning niggers on one boat standing by & not attempting to give a hand However when he referred to them as b— black b—ds\n\nthey appeared to wake up a little.\n\nThe tug boat rolled & pitched incessantly till I got feeling very sick then did not care a damn what happened I was much harassed by an individual who would keep talking to me. He would not let me alone & his talking made me feel steadily worse. However when he wasn’t looking I wearily staggered away to a more peaceful spot. Soon I felt better & when we drew up at the Clan Mac was able to greet old Stokes & Fiaschi & to exchange a little news. Soon after that saw Bill Kay on the Katuna looking very well & had a long shout with him (a talk I mean). Soon after saw Wassell (by that time 6 pm & later on old Dad Macartney on the Star of England.\n\nBy this time every one on Board the tug was very bored\n\n& wondering whenever we would get to the Orvieoto. We got there at 7.45 pm tired & hungry & had to climb up a formidable rope ladder to get on board.\n\nOn Board we Met Major Austin who made us have dinner & was very decent about seeing we got it before we got our business done Having Dined in the luxurious Saloon of the Orvieto we both set about looking for the Authorities we were there to consult\n\nAfter much hunting about I came across Lt Col Marshall ADDMS & shewed my list to him.\n\nHe appeared rather doubtful about getting any of the things on the list & did not think any of them necessary\n\nHe did not seem to see the\n\nnecessity of having any nail brushes for Surgical purposes at all.\n\nHowever he said he would introduce me to Col Ryan, who he told me would probably bite my head off.\n\nWe met Col Ryan sitting in the Smoking Room playing bridge\n\nHe glanced at my list & at once said He would give me nothing & was very short indeed\n\nI started to argue with him & at length persuaded him that perhaps some of the things were necessay so he grudgingly allowed me to have some of the things.\n\nAccordingly I hunted up a Sergeant Clark of the AAMC who typed out my requirements on a proper form & then went back & found Lt Fitzpatrick\n\nHe & I then found we would\n\nhave to stay on board all night as there were no more boats going to shore that night.\n\nWe accordingly were fixed up with a Cabin & after meeting some friends of Fitzpatricks we went to bed tired out\n\nNext Morning we were up early & had a stroll on the magnificent decks of the Orvieto She is a beautiful boat & the Deck Space available on her really surprised me. \n\nAfter Breakfast which we had with Lt Col Marshall, Dr Bird of Melbourne & General Williams I met Col Ryan who greeted me very cordially & as I had got Gen Williams consent to get most of the things on my list He signed the list at the same time hoping that I did not think he had been very\n\nabrupt the night before. I had thought so but I quite altered my opinion concerning him in the morning I made arrangements to get on shore by the little Motor Launch which would be alongside the Orvieto at 10 am Having got aboard I also found present Col Ryan. Bean the War Correspondent Major Austin & many others. Col Ryan said he would come to the Chemist with me which he did & to my surprise altered the Requisition & ordered some nail brushes for his own ship & also some drug that I was getting & that after sternly refusing to let me have anything the night before\n\nWe got to Albany through the inner Harbour which is very spacious & very well protected from the weather How Freemantle came to be chosen before it the Politicians alone can say\n\nAlbany is a pretty place & has quite modern buildings & very good roads After doing our business at the Chemist Col Ryan asked me to walk out to the Fort with him as he had some business there.\n\nWe set out & I found the old chap very decent & interesting & also very fond of wild flowers He was continually roaming off into the bush looking at some new Flower. Arrived at the Fort we got a beautiful view of the fleet lying at Anchor in the outer Harbour & as it was a clear day with a cloudless sky the scenery of the surrounding country & the deep blue of the water & all the transports was a wonderful sight I left the old chap shortly before lunch & then met Major Millard of our Ambulance\n\nHe & I had plenty to talk about & had lunch together at the Freemasons Holet an excellent place\n\nAfterwards I left him finished my shopping & then went to the wharf & got on the tug boat which was going around the fleet.\n\nHere also were many other officers & also the Captain of our Ship.\n\nAfter visiting the Flagship we went to the Euripides where I saw Lt Col Newmarch. Then to the Argyllshire where I saw & yarned to Archie Aspinall & Clem Marshall Both looking well\n\nWe eventually reached Star of Victoria at 6 pm & glad to get back I was. It is easy to get off the boat but with the irregular boat service I thought I was never going to get back\n","12":" At 6 am we weighed anchor & proceeded into the inner \n\nHarbour where we anchored & took on fresh water\n\nWhile in there HMS Minotaur passed us while we saluted & they responded\n\nDuring the Afternoon the SMO decided that White (Trooper) was too sick to stop on board so he was sent ashore during the afternoon It was thought he had Typhoid I took him off to Shore We were sorry to see him go but it was the best thing to do for the poor chap\n\nComing back to the Ship we looked about for the Motor boat which had towed the Ships boat to the Shore but could not find her.\n\nIn desperation we hailed a Naval Pinnace who were decent enough to tow us out.\n\nCaptain of the Star was much amused \n\nat this as he said they would never have done it in times of Peace\n\nAboard once more we steamed out of the Inner Harbour to our Station in the Outer Harbour to be ready for Sea the following day\n\nHow the troops cheered & cooeed the people on the shore as we went out It was to be their last glimpse of people on Australian Shores for many a day\n","13":" At 6 am the Fleet started on the move. It was a great sight to see all the boats slowly move out manoeuvre outside into position\n\nThis took some hrs & the position we finally took up was in 3 11 lines with from ¼ - ½ mile between the ships & a mile or mile & ½ between the lines On either flank was a Warship. One in front & one behind\n\nDuring the 1st day the going was slow as the ships were continually slowing up on account of being unaccustomed to this new order of things The New Zealanders at night formed up into independent lines to the rear of the Australians\n\nAt night with all the Mast Lights Side lights shewing one could imagine oneself back in Sydney Harbour again.\n","14":" Routine as usual Horses all seem to be suffering from colds up to date we have lost five\n\nInfluenza Epidemic still continues Weather is Keeping beautifully fine although sea is choppy & the vessell is rolling a great deal Did not sleep well last night on account of rolling.\n\nSunday night Cocos Islands \/ Monday morning \n\nMonday. Naval Engagement\n","15":" Influenza still severe Hospital full. Ships are keeping better in line now.\n\nWednesday had a meeting of officers when it was decided to hold a Sports gathering for the men on Saturday A Committee formed Also decided that they should have a concert in the evening. Still have about 30 patients in Hospital.\n\nAm finding iti difficult to fill in all the days & will be glad to see the land again. Spend many a pleasant hour yarning to S.M.O.F. Fullerton who is full of a quaint humour tells a story excellently & is altogether a very decent Colleague to have on board.\n\nWe have an Appendicitis case on board which is now quietening down At","16":" he was very acute & in my opinion should have been opened as I thought the risk of perforation great\n\nHowever, S.M.O. thought we had better wait. Now the mans better & naturally the S M O is pleased So am I as I would not relish the idea of an operation case on board this ship as the Horses are all over the place & the conveniences for operation crude.\n\nFor instance to get an Operation theatre we would have to turn out of the top ward the acute Influenza cases & operate there nice clean place eh. One at such times longs for the Main Theatre S.H. & Sister Marshall This case emphasises the differences both between the young & the old Practitioner & also between the G.P. & the man brought up in a Hospital. I am very much inclined to & admire the diffidence of the G.P. in not rushing headlong into operative procedure. All the same in this particular case I do think an unjustifiable risk \n\nwas taken\n","17":" Routine much excitement all afternoon as away in the Horizon was seen coming towards up with us what appeared to be a Mail Steamer\n\nLater on about 6.15 pm we all rushed up on Deck to\/with the sound of the Troops cheering the band playing on the boat deck.\n\nWhat a sight it was & how it brought home Australia and Home back to one at once There was that fine Orient boat the Osterley passing us on our Starboard bow & only about ¼ mile away.\n\nThe Decks were lined with people who cheered & cheered &waved flags & anything else they could get hold & how lustily our troops & officers cheered & waved in return\n\nThey were good enough to Semaphore to us the result of the Melbourne Cup which we were eagerly waiting\n\nas we had a Sweep on the same Of course we cooeed & they also To think that in Sydney Harbour we would pass such a boat any day & never take any notice of her But it is different out on this wide Ocean Anything new or ships from Home is intensely welcomed I daresay the Osterley had plenty to talk about that night after having actually seen the Troop ships all together & being escorted by their warships\n","18":" Routine as usual Influenza Epidemic about same We are averaging about 240-257 miles per diem & are now into the Tropics & it is getting decidedly warmer We have a very light S.E. following wind just strong enough to temper the heat. The Energy in the pursuit of Exercise by everyone is abating & also that feeling of well being\n","19":" Paddys Hurricane\n\nthat cold bracing weather engenders\n\nSaturday. Much speculation this morning H.M.S. Minotaur passed down through the lines & steamed away to the South Is she going after the Emden people asked as we are now in the Emdens Happy Hunting ground. Any rate she appears to have gone for good\n\nDuring Saturday afternoon Sports were held on the Boat Deck & the tug of wars held between the different troops were greatly appreciated & the Sack races were also wildly cheered Some of the contestants were too eager & now there are three of them with very swollen toes sprained during the Sack race\n\nStables at 4 pm ended this meeting after the Officers had had a tug of war in which side I happened to be on won after 2 prodigious struggles\n\nWe felt just done up after it. Especially myself as I then had the Influenza in just sufficiently a severe form to produce pains & aching all over\n\nDuring the evening the men held a concert at which there was considerable talent displayed by the different artists Alphonse Spagoni appeared to be the most popular item on the programme At 8 pm we had Boat drill at which when the alarm sounded we all quietly got to our allotted posts with Lifebelts on & boots & socks off. The whole lot of the ships were then kept in complete darkness for an hour.\n","20":" During morning Wireless got it that there had been a death on board Euripides.\n\nEuripides at 10.30 am pulled out of line to Starboard side & there was a burial at sea Pte Kendall Infantry\n\nall Ships meantime flags at half mast One feels something repulsive & uncanny about the idea of a poor fellow being consigned to the Deep\n\nWe have not been told what the cause of Death was. I would like to know very much.\n\nSunday Afternoon sultry & muggy weather a Mock Court Martial was held on Captain Reid This promised to be rather amusing at the beginning with Capt Lawry who has a keen sense of humour as president.\n\nHowever the O.C. turned up & insisted on the thing being done formally for the purposes of instruction forsooth As a result it was a most boring affair as OC acted as a wet blanket & did not even know the correct procedure himself\n\nThis gentleman is rather a tiresome sort of individual He hails from\n\na small Country village in N S W Raymond terrace where as the only Medico in the place He is apparently a small Tyrant. S.M.O. has christened him the Rustic Bull or in dog Latin Taurus Ruralis\n\nHe is suffering I am afraid from a severe attack of Swollen head & is always trying to impose petty restrictions For a couple of nights E G he turned up at Dinner in a white coat, then when a couple of officers followed suit they were severely reprimanded for not being in proper Mess Dress I notice since he has been turning up in proper mess Dress himself I hear that while the Regiment was in camp he slept about 2 nights in camp & never once handled the regiment himself in the Field I hear also that the Powers that be know all these interesting\n\nfacts so one may reasonably expect developments.\n\nMy attitude is one of studied amiability & politeness to the same gentleman & so consequently have not run foul of him at all as yet.\n","21":" At about 5 am this day we passed abrest & to the west of the Cocos Island some 60 miles At about 7 am the HMAS Sydney was noticed away to the rear leaving the Transports & steering East roughly & presumably (I did not see her) Little did we think what was in store At 12.00 md that day the news was flashed through from the \"Sydney\" that she had engaged the Enemy presumably the Emden & that the latter was now beached on Cocos Island in a sinking condition The Sydney was after engaged in chasing a Collier.\n\nWe had noticed about 10 am that the Jap Man of War steamed right across to the Melbourne which was on our Port side & that the two of them then went off at full speed but in ½ hrs time returned\n\nHow the Troops cheered when we got the news O how proud we felt of the \"Sydney\" & our Australian Navy that day. And how we thought of the news being flashed through to Sydney & of the consequent flaring Headlines in the Sydney Sun etc. & how we thought of the probable anxiety of people in Sydney many of whom we felt sure would think that a transport or two had been sunk\n\nThen some wise fellow suggested that probably Sydney & Australia would not get the news for some time as it would probably disclose\n\nthe locality of the Australian transports Yes it was a great moment that when the news came through. One felt good to be alive & so proud of our little \"Sydney\".\n\nIt is thought that during Sunday night the Emden must have passed extremely close to us within 20 miles it is believed. What a harvest she might have got if she had got in amidst the ships under cover of night. Of course it would have meant certain destruction to her but some damage could certainly have been done before that happened\n\nMonday Afternoon Euripides again hauled out of line & buried another man. There must be some serious condition on board; we have heard nothing.\n","22":" Stifling Heat today A detailed account of the Emden Debacle through today & appended by Courtesy of Wireless Operator Mr Pennington\n\nWireless Account\n\nSydney started for Cocos 7 am At 9:36 am she had sighted the enemy travelling at full speed She was able to get within range in 20 minutes. At the same time she signalled the chase was steering north At 10.45 am Sydney was engaging the Enemy briskly & at 11 10 am the latter had to beach herself to avoid sinking Her foremast & three Funnels were down but the flag was still flying Sydney then went after the Emdens Collier took the crew off & sank her Sydney returned again to Emden who surrendered Extent & nature of German Casualties are not yet known but are bound to be severe Sydneys own Casualties required Hospital treatment which was probably found on direction Island (Why not on the boat - Leslie). The Emden had had time to destroy the Wireless Station & cut one of the 3 cables A 2nd Cable is intact & possibly a third All Instruments except one were destroyed This had been buried & is now in use again. The Wireless & Cable Operators\n\ndeserve much praise for sticking to their posts & for saving instrument\n\nSydney will sail for Colombo as soon as she has succeeded in getting the German wounded & Prisoners aboard The operation may take 24 hrs as it presents considerable difficulty\n\nOpen letters plain postcards & urgent telegrams will be censored on board Orvieto for immediate dispatch provided all reference to ships places & dates are omitted Closed letters parcels will be delayed\n\nThe latter are instructions from the Flagship. Consequently it can be seen that letters will not be very enlightening as regards our where abouts or doings Leslie\n\nTuesday Afternoon. S.M.O. & I inoculated 120 men. Antityphoid. Later on 2 or 3 complained of headache & fever but majority suffered surprisingly little\n\nWe had been waiting for the Influenza Epidemic to subside but as it does not shew of any signs of doing so yet we thought we had better get the business over\n","23":" Not so hot today There is a slight head wind which is making conditions more pleasant. Sick Parades small today only 4 being admitted to Hospital with Influenza Another Dead horse today.\n\nH.M.A.S. Sydney has not yet overtaken us She is I believe to go straight to Colombo with the German prisoners\n\nConsequently the Transports are now escorted by 2 warships the Jap \"Ibuki\" & the Melbourne\n\nEvidently the Indian Ocean is now \n\nconsidered comparatively safe\n\nWe are now sleeping out on Deck & find it very pleasant after the Stuffy & hot Cabins. The Day has passed slowly & monotonously. One even gets tired of reading. We are due at Colombo probably by Sunday or Monday morning That at any rate is something to look forward to.\n","24":" At 6 am the Jap & the Melbourne were close in on our starboard bow also the Orvieto. A boat passed from Melbourne to the Jap evidently some compliments being exchanged.\n\nLater on Melbourne has it is reported left us & we are now attended by the Jap alone.\n","25":" afternoon 2 pm A Large gray ship 3 funnels a merchant cruiser it transpires passed us on our starboard bow. Most peculiar lines, the bows & stern of a cruiser.\n\nShe is I believe about 18000 tons. She was steaming south at a good rate & signalled \"Good Luck Australia\" as she passed\n\nSeeing passing vessels on board is quite an event. Later it transpired she was the \"Empress of Asia\" & is bound for Cocos Island to take off the German prisoners & wounded We are near the line now & will cross it tomorrow morning\n\nThe weather is cool & showery a good strong N E wind blowing We are in the region what seafaring men term the Doldrums.\n\nThis is just on either side of the Line s & is characterised by heavy down pours of rain\n\nTonight Father Neptune came on board He is going to take toll tomorrow the Toll will be heavy.\n\nHe is one of the Troopers an old Sailor \n","26":" Today it is raining like Blazes & there does not seem to be a dry place on board\n\nWe now have another Cruiser with us the Hampshire a","27":" class cruiser I am told.\n\nDuring the morning the N.Z. fleet steamed ahead full speed for Colombo escorted by this","28":" class cruiser.\n\nThey want to get to Colombo early as our stay is to be short & they have some repleniishing to do\n\nDuring this morning there has been an upheaval Taurus Ruralis has discovered that an overcoat of one of the men has been apparently wilfully cut not a very big cut.\n\nHe is going to play H— with a big stick.\n\nHe has addressed all the men & as S.M.O. puts it, loud was the bellowing, \n\nUnless the man owns up He is going to stop all their Sports. All the money collected for their prizes is to be given to a sick & disabled Seamans Fund When they get to England they will have no leave for a month etc etc As a consequence Neptune has been forbidden to come on board & the men are all pretty wild about it\n","29":" pm All is peace again A man explained the whole thing The coat was torn at Rosebury getting over a fence & the piece torn was I understand cut off.\n\nThe remarks about the above gentleman are however I have heard pretty lurid down on the troop deck & his unpopularity certainly seems to have increased\n\nHow tactless & futile are these wild threatening speeches They never have the desired effect.\n\nFather Neptunes ceremony as a consequence is postponed till tomorrow 2 pm\n\nHave also heard that the Karoo has left full speed for Colombo today There is a rumour that she is on fire She has certainly it is said heaved 140 bags of fodder over board whether they are alight or not it is hard to say She is to be put out of the fleet at Colombo & her men put on other vessells The ship behind us the Oratara is said to have 90 cases on board in the Hospital of which 47 are Measles Also heard tonight that she is landing at Colombo. 7 cases of Phlbisis 1 of Cholecystitis & few others 2 or 3. What they are I have forgotten.\n\nWe are landing our Appendicitis case as we don’t want the risk of having to operate on him for a third attack at sea.\n\nI am afraid he will be very disappointed.\n\nAnother man may have to be discharged for Specific trouble\n\nThe O.C. appears to be very reluctant about getting rid of the appendicitis case He asked me into his office after Dinner & asked me Did not I think that perhaps the man could stay\n\nI had no two minds about it my opinion being that we dont want any burials at sea this trip & I think that would happen if we kept him. So the Medical opinion on the matter will prevail.\n\nI really think there should be no questioning of our opinion in these matters & one would think that an O C who is himself a medico would have a little more Gumption\n\nTonight the rain has stopped & conditions are cool & pleasant Went to bed out on deck at 9 30 pm\n","30":" Fine & hot with Nor Easter, sick parades diminishing a good deal. Father Neptune to come on board at 2 pm At 1.40 pm Father Neptune arrived. There is a long bath of salt water fitted up on main deck just aft of boat deck Here the proverbial Father Neptune & his assts took toll. They doled out doses of such palatable stuff as sharks blood & plenty of Tc Iodine,\n\nAfter the victim sat down he was lathered with paste of flour & water & then shaved with a wooden razor that finished he is given a dose of medicine which is just thrown on to his face & then he is tipped into the bath where 3 or 4 of Neptune’s assistants duck him Luckily I got a good footing when I was tipped in & managed to duck three before they got me\n\nNearly a riot. The O C commanded Neptunes Police to duck the Vet whom\n\nhe personally dislikes. Vet has been over the line before & consequently resisted. Other officers joined in & frustrated the attempt\n\nThe OC is even more unpopular now than he was before Very tactless. That night the men had a concert which was a welcome break to the monotony Tomorrow we will get to Colombo.\n","31":" 6 am Land in sight again a welcome break after 14 days without seeing any land I can tell you a pretty country Ceylon with good sized mountains (compared to Australia) in its centre.\n\nAt 7 am commenced to see flocks of little Katamarans with their peculiar single square up Some got quite close to the transports & we could see the niggers looking quite excited.\n\nAt 1 pm we arrived off Colombo & anchored in our line outside the break water. New Zealanders are inside the Harbour as also are some warships We can see a Russian man of war alongside our Japanese escort the Russian a peculiar looking boat with 5 huge funnels & the bridge very much forward to the bows The Sydney is also in the harbour & does not appear damaged at all Also I believe the Hampshire. Later on the Russian steamed out & took up position on the outside of the transports to guard us. So now all the allies but the French have given us a hand.\n\nColombo through the Glasses looks very picturesque. There appear to be some fine buildings. In particular the Galle Face Hotel a fine red brick building with I believe 500\n\nrooms looks very inviting.\n\nthe Effect of the vivid green of the grass & varying shade trees & palm trees is very pretty.\n\nI spotted plenty of motor cycles cars & Rickshaws as I looked\n\nAlso a dome of what I believe is a Hindoo temple shewing above the trees away to the East of the town added to the interest of scenery quite new to one who has not been out of Australia. \n\nLater During Dinner was talking about Col Ryan when speak of the Devil etc. in he walked.\n\nHe had come by tug & said he would take our appendicitis case on to Orvieto\n\n&\tthere operate.\n\nAlso he would see what he could do with our drug list.\n\nI had a talk to him after & he said he did not think anyone could \n\nget ashore.\n\nAt 10 pm his boat had not arrived so I lent him a pair of pyjamas & he decided to sleep on our boat. I went to bed about 1030 pm rather tired.\n","32":" 6.30 am. Col Ryan departed his boat came around at 11.30 pm last night.\n\nLt. Col Meredith the Adjutant & Quarter master are going to the Orvieto Major Vernon & Capt Reid are going on shore. Lucky beggars.\n\nA tug came along side at about 11 am. Watched with interest the jabbering natives especially when the troopers began throwing down pennies to them How they scrambled for them & with what grins they asked for me Truly the nigger is of a very inferior race. They looked like dogs after a bone the way they got after the pennies They even got some silver\n\ncoins & the Captain a pock marked old villian bagged a florin. I suppose they will have a fortune when they get back tonight\n\nLt Butler came on board from the Clan Macq. this morning. He wants excuse to go back home as his father to whom he had given power of Attorney has died\n\nI do not see how the authorities can allow him to go. If he does go one of our men will have to go over to the Clan Macq\n\nHad an idle day. also during the morning saw another Cruiser come in. the Yarmouth probably from the China Squadron. She looks pretty dirty & appears as if she has had a fairly long voyage.\n\nRead all the afternoon, & spent rather a monotonous evening\n\nthose ashore have not arrived back yet. I understand we leave Colombo tomorrow, the sooner the better if they will not let us ashore\n\nHeard another bit about the Emden It appears that The Wireless operater on Cocos saw her come in to the Harb our He at once sent a message \"There is a strange man of war entering the Harbour\" This was intercepted by the Sydney who at once proceeded to the place Also read some papers this evening the Germans appear to be gettng pushed back especially by the Russians It is reported they have made some Peace Overtures to the Russians which have been rejected.\n","33":" At 11 am this morning all the Transports with exception of fast Division (in which we are\n\nleft escorted by the Hampshire They are to steam 10 Knots & we are to leave at 7pm & steam about 12-13 Knots\n\nAbout Lunch time naked (except for a loin cloth) savages came along side in canoes built of logs lashed together & rowed by bits of wood. They dived for coins & 2 of them climbed up to the Bridge & dived from there for three shillings. diving was poor They jabbered about for an hour or so One chap had only one arm & dived very well He has been working the visiting boats for years I heard from the Chief Engineer & is well known\n","34":" pm We left in single line formation escorted by the Jap Warship in order. Euripides (Flag Ship. Argyleshire, Shropshire, Afric.\n\nBenalla Star of Rangatira, Star of Victoria, Oratarara, Omrah & Meltiades. Our manoevering into position was accompanied by a Flashlight from the mainland which kept revolving about our course for 2 3 hours after.\n\nToday weather cool with N.E. Breeze Influenza Epidemic abating.\n\nHave now started to sleep up on the Bridge Deck & find it very nice after the stench from the Horses one gets on the Promenade Deck.\n","35":" We are barely doing over","36":" Knots, the Afric keeps dropping back & consequently keeps the whole lot back, the Chief Engineer is very scornful about her & evidently wishes her in a hotter place than this.\n\nAfternoon We are forming into two lines parallel. On our Port \n\nbow is the line as follows Euripides Argyllshire, Shropshire, Afric & Benalla. Our line, Rangatira Star of Victoria, Oratarara Omrah Meltiades.\n\nSparks tells me we are to pick up 4 N Z boats & go on at a good speed for Aden Other boats are not in sight yet.\n\nWeather comparatively cool & pleasant Life on board is getting rather monotonous & one sweats too much to take active exercise.\n\nJap Warship is steaming steadily ahead\n","37":" The other boats can be seen just on the Horizon this morning. The Afric is still giving a deal of trouble. Cannot keep up a 12½ Knot speed at all. I am sure all the ships are cursing her I know we are.\n\nThis evening we are just behind them. Instructions received that the Afric is to drop out & that the Ascanius is to take her place. Much rejoicing.\n\nLater the Four N Z ships are now ahead & the Ascanius has taken up position We are going ahead well & are getting abreast of the main Fleet Life on board just about the same no improvement worth noting nothing exciting\n","38":" morning","39":" Woke up 5.30 am we are doing & have been doing as I heard later a good 13 Knots during the night Have just heard the Bridge ring down to the Engine Room to stop.\n\nWent to investigate find our line is stopped also the Euripides. Looking away back 4 or 5 miles can be seen the remainder of the\n\nother line About 7 am we got on the move again the jap is now steaming down the line to investigate At Breakfast we learnt that the Ascanius had collided with the Shropshire Extent of damage not known but it cannot be great as they are both coming along.\n\nBy the time we got going again the Slow fleet was almost up to us. However we gradually lost them & about nightfall they were practically out of sight astern\n\nNothing much doing on board the OC is getting steadily more unpopular He has taken a violent dislike to the Vet & is foolishly taking advantage of his position to shew it.\n\nHe is consequently alienating every\n\none. I find that to get up on the bridge deck all day after my work is done is the only place to get away from him.\n\nOld S.M.O. was trying to persaude me to do some lecturing to assist him. As I am doing practically all the medical work of the ship it does not appeal to me so I told him I would not especially as it is by no means my duty.\n\nIt strikes me the more one takes on the more one is expected to do.\n","40":" Travelling well today At noon 24 hrs run 299 miles, nothing of interest in the morning. After Lunch Mens Sports held Potato races. Fighting with pillows on a swinging pole etc. no damage to life or limb. They all seem to enjoy these meetings very much it must be a welcome change\n\nafter Stables 3 times a day drill & lectures.\n\nWeather still fine with a cool N.E. blowing.\n","41":" evening.","42":" officer sick am treating him & have put him off his watch.","43":" am The Captain will do it or part of it. Captain is a very decent man courteous & very considerate to his men\n\nHis hobby appears to be a Brazilian parrot which he is teaching to talk the Beast however appears to prefer whistling at present much to the Captains disgust who declares that a whistling parrot will never learn to talk.\n\nConsequently if you want to get into the Captains black books go & whistle at the Parrot.\n","44":" Went to a Church parade as a matter of form this morning Glad to say it only lasts about 15 minutes.\n\nHeard today that the Ascanius is more damaged that they think. She may be put out of the show at Aden or Suez. It is rumored that there is a 25 ft rent in her above the water line & they fear her encountering heavy weather\n","45":" afternoon read & slept Sunday evening walked about 3 miles felt much better afterwards Went to bed about 9.0 pm.\n","46":" morning","47":" Up at 5.55 am. All boats in proper station & going well Land on the Port bow. very mountainous coast line.\n\nSocotra Island. Inhabited by a hostile half arab half nigger lot I understand. The Mountains\n\nmust be 6 or 7000 ft high in parts.\n","48":" ordinary routine\n","49":" Aden Have now got Influenza & am in bed. A bare desolate looking place\n","50":" morning","51":" Left Aden all Transports together.\n","52":" In Red Sea very hot still in bed.\n\nThere is now a regrettable hiatus of 3 months in the Diary caused no doubt in the first place largely by the depression of spirits so common after Influenza & secondly by the excitement of living for the first time in ones life under Oriental conditions.\n\nHowever I will endeavour to make out the dates & happenings thereon.\n","53":" morning early","54":" arrived at Suez a picturesque\n\nlooking place here we anchored well out in the stream & waited very impatiently for Port Med Officer to clear us & also for the Search light that every ship has when going through the Canal. During the day other transports all filed in Saw old Bill Ray who on the Kalima which passed quite close to us. He has a moustache quite noticeable at the distance\n","55":" About 16 Indian Transports arrived this morning with Indian Imperial troops on board. Some very fine boats especially some Union Castle Boats with Red & black funnells Much cheering between Australians & Tommies, Cooees & Tipperary\n\nWednesday 2 pm started into the canal much joy. everybody sick of waiting.\n\nI had forgotten to say that while in the Red Sea we had got notice that we were to finish training in Egypt. Everybody felt disappointed we did not know of good times in store\n\nMuch interest in the Canal shown the Boat goes very slowly so that there will not be a big wash Also a pilot is steering the ship through\n\nWe pass close to Suez & see the most beautiful clean streets. It appears to have been laid out by the Canal on model lines\n\nVery clean streets with shade trees all along. Going along the Canal we see for the first time Camels & hooded women & the flowing garments everybody wears.\n\nAlso we see troops all along the Canal encamped\n\nThey have thrown up redoubts & made trenches & apparently have & are fortifying the Canal very strongly.\n\nThese troops are composed of English Territorials & Indians & many \n\nwere the questions we got & answered Be you goin to Cairo said a Tommy. No, Berlin would answer an Australian & so on right along\n\nThere are wild rumers current that some of the first Transports that went through were sniped at by Turks from the Banks However we got through with nothing exciting to report & at 6 am Thursday 3rd we woke up & found ourselves at Port Said. Tremendous lot of shipping here & appears a very busy port no shore leave allowed. About midday, niggers came aboard to move coal. They appear to do a tremendous lot of talking. In fact they wildly gesticulated & talked for nearly an hour before they started work\n\nIn afternoon we heard we were to get\n\non the move again & after dinner about 8 pm we started out passing a French Warship on the way. We stood to attention & saluted as we went past, they responding with a very French sounding Hip Hip Hooray.\n\nFriday 4th Land sighted & Alexandria as we left Sydney so we arrived at our destination in wet & miserable weather.\n\nEntered the harbour about 10 am & anchored close to a coal wharf well in the harbour\n\nTremendous lot of vessels in this port Greek Russian Etc & many German prizes.\n\nWe are looking forward to 2 or 3 days wait about here as only 5 transports can unload at a time & to unload one appears to take quite a considerable time.\n\nThe work is greatly facilitated by the Railway running right on to the wharf & alongside the ships.\n\nSaturday 5th\n\nSome of us are going ashore this morning to have a look around. \n\nDiary of Gallipolli Campaign, till Aug 9th the day on which I was wounded \n\nFriday 2.4.15. About 7 pm. a few of us were sitting in a tent in the Ambulance lines when an urgent Dispatch arrived for which I signed. This declared all leave was off & that units were to be ready to move at a moments notice. We had been expecting this for days & days & when it came there was much rejoicing & bustling around to get things fixed up.\n","56":" We are to move off any time after 2 pm. today Already the big camp is being dismantled & spirits are high.\n\nIn the afternoon I took luggage in to store with Cooks in Cairo 2 tin trunks of my own & other stuff belonging to our officers, went in on the sidecar taking Hugh Poate who wished to say goodbye to his fiancee I called in there for afternoon tea & left shortly after tearing Poate away after some little trouble. We arrived back at the Camp just as the finishing touches were being put to the breaking up of Camp & had to bustle to get the sidecar stored away.\n\nthe onus of getting all things ready at the last moment seemed to have fallen on Aspinall who was directing things with his usual thoroughness. All the tents were down & stored in the waggons & just at the last all the rubbish was gathered into a huge pile & we had a very respectable bonfire on the site of a bathroom that I had made some time before out of a packing case & old mats & which was too much of an eyesore to leave on the about to be lonely desert.\n\nThe luggage I put in the waggons for my use in the campaign weighed about 70 lbs. (Regulations allow 35) & consisted of Coats 3 trousers 3 under pants 3 socks 4-5 pairs boots 2 pairs Hkerchiefs 6 undervests 3. rest made up of toilet gear various odds & ends & personal effects.\n\nAt 7.10 pm we got orders to get on the march. It was then already dark & the scene at Mena was an uninspiring one. There were huge bonfires leaving a dull red glow over the camp & the dust was thick in the air. All the roads out were packed with a jumble of troops on the march & transport waggons of every kind Nearly all the Infantry had left before us (the ASC leaving the night before & the road into Cairo was packed with traffic going both ways. I rode my horse in & I was glad to be on him as the marching was slow & there were many wayside halts owing to blocks & delays in the long columns on the way into Cairo. We arrived at the Cairo main station at 11 pm. & were then told that we had to wait till 2.50 am before any train would be ready.\n\nHowever no one minded that & we camped on a grassy place just outside the station. Here all ranks were allowed to go off at intervals to get food & drink With Warsell I went to the Continental where the usual Saturday night dance was on & there we had supper. Managed to see Miss Knaggs & the Wells girls before leaving & said goodbye. We got back to the station & found that there were several merry souls among the unit all of whom had to be watched carefully lest in their exuberance they should stray off into the city & get lost. They had met friends with the inevitable result. However we got all of them on to the train about 3 am quickly & with no fuss & eventually left Cairo about am. everyone by that time being very quiet & sleepy.\n\nAt 11 am we arrived at Alexandria the train going right on to the Wharf. Here Kay met us as Embarkation Officer for the unit & directed us to our ship the S.S. City of Benares. 7000 tonnage. Transport A9.\n\nWarsell left us & embarked on the Murvewaska with 27 men & 50 horses, the rest in our ship. I had a cabin to myself & was next door to Archie & Kay. Seemed a comfortable & clean boat. That evening Archie & I went into town & took ourselves to the Opera House where an Italian opera Coy were playing Rigoletto. The show started at 9.20 pm & ended well after midnight. It was very good all through & we thoroughly enjoyed it. The was a large & very enthusiastic Dago audience. We got back to the ship shortly after 1 am\n\n5.4.15 Next morning we had very little to do so spent the time in watching some British Artillery disembarking near us.\n\nThey belonged to Ks army & appeared to be of better physique & sturdier than the Territorials of Cairo. We especially admired their huge draught horses which were bigger than anything we had seen previously in Australia.\n\nShortly after 5 pm we left the Harbour under sealed orders. Our OC. told us as we were leaving \"confidentially old chap\" that our destination was Smyrna at which I felt disgusted but soon after we were chaffing him about it as we were then issued with maps of Gallipolli Peninsula. Outside the boat pitched & rolled a great deal & caused a good many cases of mal de mer myself among the unfortunates.\n\nThe sea is rough & we are running into squally raining weather.\n\nOn Board besides 1st Fd Amb are the 1st Bde HQ staff, 3rd Coy. Engrs. (Major Cloughstorm who is also O.C. troops aboard. Our officers were asked to do general duty aboard ship but as we are a departmental Corps we did not see it in the same way as others protested against it effective\n\nCalm & fine today we are now amongst the island that are so numerous in this sea. At 6 am we passed the island of Patmos of Biblical interest. St John was there at some time in his life.\n\nAfter Bkfast all officers were called together to the Saloon where the O.C. troops issued instructions to us as regards our future work.\n\nThe Troops on board are divided into 3 eschelons. in A Eschelon is the 1st Fd Amb amongst others. This will be the 1st lot to go ashore in the landing on the peninsula.\n\nThe OC informed us that amongst other things of the important fact that water is very scarce on the peninsula so extraordinary precautions will have to be taken to guard against thirst\n\nEvery man is to be instructed that his Water bottle must be full & that he must drink himself full to overflowing before leaving the ship If he rejects any he is to fill himself up again It rather makes me think of the camels of Egypt. He is also to carry 2 days iron rations ashore which are to be issued at once. Anyone neglecting these orders is to be very severely dealt with.\n\nWe understand that we will probably have to fight for what water there is & even then it may be poisoned.\n\nHe jocularly asked if the medicoes would test the peninsula water by trying it on themselves but as one officer has a pet dog on board I thought it would be a good plan to let him have the first drink. Everyone thought it a good scheme except the owner.\n\nOrders were also given about the water supply on board ship. It was limited & will have to be very strictly conserved as there is no condensing plant on board. We have had evidence of this already as we are only allowed about 1 quart to have a bath in every morning.\n\nIn the afternoon we came in sight of Lemnos & about 6 pm we entered the outer harbour & shortly after took a tortuous course through a mine field layed at the entrance & then entered the inner harbour This harbour is practically completely land locked & must afford great protection against the rough weather which is so prevalent at this time of the year in these parts. Away to the north maybe seen the mountainous island of Samothrace on which is a very high peak which is snow covered at the top. To the north again may be dimly seen Mt Athos on a narrow & long peninsula of the main land. This is the site of a famous monastery where \n\nfor centuries no woman has ever set her foot. Lying in the inner harbour is a big gathering of every kind of vessel you could think of from the huge Queen Elizabeth & other warships English French & even a Russian cruiser the Askold which is an old friend to us. She lay outside the harbour at Colombo on guard over the transports of the 1st Aus Div when we came through. There are also transports , store ships minesweepers T B Ds; small Greek sailing craft. The Queen Elizabeth is a magnificent looking ship & makes an impressive show with her huge 15 in guns.\n\nDuring the day we have been trying various ways of carrying our swags. We have decided on the swaggie’s method Blankets , W.P. sheets in a swag on one side balanced by iron rations on the other side Both bundles hang down in front are not tied on & so may be cast off at once if a man slipped while getting down the rope ladder into the boats.\n\nThursday. After breakfast we started practising the loading of the men into the boats. For this purpose. Each section was told off into two boatloads, each load about 30 men. Major Millard is in charge of the 1st boatload of our section while I have the second. I have discovered that I have some very good oars in my boat During the morning A9. was manoeuvred along side a sister transport ship & the two tied together This is being done all around the harbour the idea being to economise space as the harbour is now very congested.\n\nMy cabin now is on the side alongside the other ship & has become very stuffy as a result.\n\nIn the afternoon Millard & I took our boats for a row round the harbour. had a look at close quarters at the Russian ship. She looks old & indeed was in the Russo Japanese war from which she escaped intact.\n\nFriday. Already there is a stench coming from between the two ships & the cabins on our side are very stuffy\n\nIn the afternoon we went out for another row & visited a Naval Hospital ship near by to us. We were shewn over her by one of the officers who was very decent & made us quite welcome.\n\nThe ship originally was a well known Indian Transport vessel. She carries 200 beds, seven surgeons & 40 ratings including some London St John Ambulance men.\n\nThere is a nice little operating theatre, well equipped carrying steriliser heated by electricity, also a very complete laundry \n\nReturning to our transport I took an oar & managed to work up a very good appetite for dinner. The food on our boat is good, plenty of it & well served. Everybody is well satisfied & the men have no complaints on this score at all.\n\nSaturday, practising with the boats again nothing eventful, more transports & warships entered the harbour today. Every one is beginning to wonder when we shall move.\n\n11.4.15 Sunday. With some other officers rowed over to the Derflinger this morning on which are the 2nd & 3rd Battalions. This boat is a German prize & was lying in Alexandria Harbour since the outbreak of the war. She is a very well fitted out boat & has a Gymnasium on board which is a revelation. All the apparatus is worked by electricity & amongst other things is a mechanical horse & camel which you can set to any pace.\n\n& which give very lifelike imitations of the different gaits of these animals. In fact there is practically every kind of apparatus there & we had a great time trying everything. If only we had something like this on our ship a chap could keep fit very easily. We spent about 1 hr on the boat & had morning tea w some 3rd Bat officers one of whom was Street a son of Justice Street of Sydney & an old Pauls man. We then rowed to the Transport \"Malda\" where we saw Major Stokes of the 1st Fd Amb. On this ship is the 3rd Brigade H.Q. to which he is attached for a special duty. He has been at Lemnos since the beginning of March when the 3rd Brigade arrived here. Needless to say they are all very tired of the inaction. Stokes I think is not likely to return to the Fd Amb. we shall miss him. We brought him back with us to lunch on the A9 & then took him back to his ship in the afternoon.\n\nWent ashore with Archie Aspinall & two officers from the ship (military) & as it was a beautiful fine spring morning we walked into Mudros which is a good three miles from where we landed. Mudros is a quaint higglepiggeldy village with narrow twisting & unpaved streeets Houses are all built of loose stones of varying size & colour cemented together. Everywhere I am glad to say scrupulous cleanliness prevailed a welcome contrast to the Egyptian villages which you can smell from afar off. \"the characteristic odor of the East as it is somewhat romantically termed but which is really due to the accumulated filth of humans & animals for centuries.\n\nWhen we entered the village we saw very few women & the ones that we did see were just like shy timid animals. As soon as they saw a soldier they would bolt for their lives not so the little children who would shyly smile at you & some of them were very pretty indeed with their big brown eyes & swarthy complexion.\n\nEvidently these people judge all soldiers by the Turks. We went into a shop & after much haggling over exchange rates bought some chocolate & matches. The Islanders will take any English or French money but will not look at the Egyptian coinage except at a big discount. They are very fond of English gold.\n\nQuite a number of the Islanders could speak English owing to the fact that many of them have been to different parts of the world. One we met who had worked in one of C....nes shops in Sydney. Taking the people alround & especially being fresh from Egypt they seem quite a decent type. On this Island there are said to be at the present time many Turkish spies In fact on all the main roads the British Authorities have guards posted whose duty it is to stop all people & examine their passes which are issued by our authorities. In fact as we were walking back to the boat we came across a batch of about 20 suspects, when the guards were bringing in a motley crowd some looking very frightened while others looked quite annoyed, but they all realised apparently that one cannot do much against fixed bayonets.\n\nWe have since been told that a week or so ago the guard brought in two women suspects & when they got into Mudros a crowd of about\n\n40 women collected around the party & screeched & yelled their rage but to no purpose, the guard kept them well in hand.\n\nWe arrived back on board about 1 pm & felt quite tired after our walk. The worst of ship life is that it is too sedentary & you get out of condition very quickly. Took things easily in the afternoon. Looking around the harbour one sees a very impressive spectacle there must be by now over 100 vessels of all sorts & shapes in the harbour.\n\nTuesday 13th April the usual round the daily task we are getting bored. Military life seems to be so far nothing but stand fast carry on etc. Masterly inactivity in fact There are plenty of rumours but no information yet as to our projected move.\n\nWednesday. 14th April. This morning Millard, Aspinall & myself & few others took some patients to the shore hospital. We rowed right around to the Town Quay at Mudros left the boat there & took our patients to the Hospital which was situated on the hillside just beyond a French encampment & overlooking the harbour. We passed a good many French soldiers on the way who look very well in their new blue gray uniform Later on we also saw some of the Famous Foreign legion in the town They looked rather untidy & slovenly we thought. At the Hospital we handed over our patients & heard amongst other things that the Sanitation of the French units on shore was not good at all.\n\nWe then had a look around the town &\n\nwent over the Greek Church which is rather a fine looking stone building. Inside we noticed that there are no seats at all. whether the people stand or kneel all the time we did not find out. A quaint looking old Greek priest was inside & he had some mysterious game in hand; he burnt small tapers for every one from which he was supposed to predict things or something like that. We did not stop long after donating a coin to the church. We got back to the boat about lunch time & passed on our way across the harbour many boat loads of infantry. Everyday & all day the Infantry practise getting the soldiers ashore with their full equipment on & on shore may be seen soldiers everywhere, in battalions going for a route march or in smaller lots bent on exploring the Island. The fields on the Island are very pretty at present & in many places are bright with poppies. All the Island that we can see is very mountainous but the slopes seem very fertile & everywhere a green colour prevails. Up on the skyline of one ridge we can easily see from our boat a group of wind mills These are quite common the Island & as there seems to be always plenty of wind here one can understand their use. There is not a tree on the island.\n\nThursday 15.4.15 This morning our boat started to unload 1,000,000 rounds of\n\nammunition & has been at it all day. Mr Beers the Fid Amb Quatermaster is in charge. After dark the work went on all through the night by the aid of strong electric lights\n\nThe usual routine through the day. After dinner all the officers turned into the saloon & started censoring letters of which there is a tremendous pile.\n\nThe Censoring turned out to be a very amusing affair & was as good as a show. I will try & write down a few things we read. One man was writing to his mother & was telling her about the Queen Elizabeth, he stated among other things that he was told that she had recently been punctured, he evidently had worked in a bicycle shop.\n\nAnother man described part of his stay in Egypt as \"while they were lousing at Mena\" He evidently had suffered some unwelcome guests. Some of them called the censor bad names & one man started off & this was quite common by saying that as paper was scarce he would only write a few lines. He wrote 10 pages. Quite a number wrote with relish of coming horrors & one I read assured his poor old mother that \"the Turks were very barbarious, they mutilate the wounded & often gorge your eyes out. This sort of \n\nstuff we find seems to be specially reserved for poor old mothers & sweethearts & in many cases we found was written by chaps who themselves had good safe jobs & who might never ever see a Turk.\n\nEveryone on board is happy & fairly content, always there are rumors about when we go. Turkish atrocities etc The only smudge on the landscape is the awful smell coming from between the two boats. We are hoping that there will not be an epidemic of sore throats as we have had several already.\n\nFriday 16.4.15. Today there are lighters along side & our boat is taking on a great deal of timber of varying lengths & sizes for the Engineers. This is a very important matter as we learn that on the peninsula there is only stunted scrub, as is common out here in the East. In fact both here & at Alexandria may be seen huge piles of firewood on the wharves which has been imported from outside countries.\n\nSwimming in the harbour is very popular & nearly all the men on board go in for a dip in the middle of the day. Of course there are no sharks in these waters but even if there were I do not think it would make much difference.\n\nClimate just now is perfect & is I am told just like that of Tasmania\n\nSaturday 17th April Same routines & we are getting very sick of these rehearsals loading the boats etc & disembarking on a peaceful shore, everyone is longing for the real thing.\n\nTo make things worse our boat is getting the same old smell that developed on the Star of Victoria in the Tropics a vile smell due to stale ship air & horses & lack of a decent breeze, but it is no use grousing, it can’t be much longer. It seems a great pity that the horses cannot be taken ashore & exercised on land. They will knock up easily when their time comes after this confinement on board especially as it comes on top of the indifferent Egypt fodder. I took B section ashore in the morning & led them up a steep hillside to a hilltop commanding the whole harbour. When every one got their breath they discovered that it was a wonderful view as it certainly was. The harbour at our feet & packed with ships. In the afternoon I went ashore again with Millard Wassell & C Section. We marched out to the East coast of the island. On our way we passed through a very picturesque village where we pulled up & I took a\n\nphotograph of the section. The village is very primitive, the streets if you could call them such being simply formed by the spaces between rows of houses which seemed to have been built quite without any plan. But as in Mudros everything was scrupulously clean. On resuming our march we came across a number of girls & women washing their clothes at the Village washing Place of which I took a photograph. As soon as I got near enough to get the photograph all the little girls turned to the camera with a beaming smile while the elder girls & women covered their faces with their aprons. This is a most peculiar trait in these parts & I am told that the same thing occurs in Ireland where the women are also very modest. After leaving the village we climbed up on to a plateau overlooking the sea on one side & the harbour on the other. Up here the fields are wonderfully green & very pretty Many varieties of flowers may be seen in a wild state Daisies, blue bells, buttercups & even the homely Scotch thistle. Here we rested for a while & peered across the sea where may be seen in the dim distance the entrance to the Dardanelles. At any rate we decided it was & it coincided with the position off the islands Tenedos & Imbros that we have been studying on the map.\n\nWe returned the\n\nway we came & that night slept the sleep of the weary & the just.\n\nSunday 18th April We have some more sick for hospital so Archie & I took them ashore. On the beach we saw a Wireless Apparatus in full swing & I was quite interested to see that the Dynamos were worked by Douglas Motor cycle engines. This plant is also rehearsing & will play an important part during the landing They are going to transmit the ranges to the warships for their big gunfire. In the afternoon I slept while Poate & Welch visited the Q.E. or the Queen Lizzie as she is affectionately called. They came back with some wonderful tales about her. They told us that the huge 15\" guns could be certain of getting on to a target with a margin of 12 ½ yds at about 12 or 15 miles range.\n\nMonday 19th April I have received orders to change places with Wassell who is on the Minnewaska. He is to take his place on A9 so as to be ready to get off with the Bearers of B section of which he is in charge. I am to stay on the Minnewaska with the Tent subdivision & the plan is that the latter with all the transport of other units will not be disembarking until the landing is secured which will probably not be until the 2nd day. About 3 pm I left the City of Benares & proceeded to the Minnewaska where I took over from Wassell. I was rowed over along with Col Maclauren Lt Col Onslow Thompson Lt Col Newmarch who were all going over to the\n\nMinnewaska for a pow wow with the Generals on the coming events The Minnewaska is a very big boat 15000 tons & before the war was a Transatlantic cattle boat. She has however very good accomodation for passengers. She can do 18 knots comfortably. I found Wassell in a very comfortable cabin which I took over very readily He then took me down & shewed me the horses (50) who are all in fairly good condition except his own horse which has a nasty septic bite on the shoulder. This he got by fighting with Col Newmarches Arab pony who is a very crossgrained brute. In fact at present he has been placed by himself away from the others, he is so quarrellsome. My old neddie is looking splendid Sgt Poole sees that they get plenty of exercise every day & our unit is the only one to regularly take down the partitions & walk the horses around. Poole is very scornful about the way a certain English unit is looking after a few horses. They certainly look as if they have not been groomed for days. We have 27 Transport details looking after our horses & they are all good workers.\n\nI then had a tour of inspection of the boat with Wassell & learnt who was on Board.\n\nThere are Gen Birdwood & Anzac Army Corps. H.Q. staff, Gen Bridges & 1st Aust Div.\n\nH.Q. staff, two other Brigadier Generals. Col Howse AAMC 1st Battalion Some Army Service Army Post office & others I do not know. Looking up my exact details I find I have 48 horses, 27 Transport details, A Section Transport & all the water carts of the unit (3 in no). After dinner I met several Inf. officers I knew Carter (Tusky) Champion & Thompson M.O. I heard some funny tales that night in the Smoking room. One tale was that the Naval Authorities had intercepted a boat coming into Lemnos which had 260 riff raff women from Constantinople, Another tale was about a Turkish newspaper. It printed an article about the Australians & amongst other things said that. The Australians had to be driven out of Cairo at the point of the bayonet as they were so fond of wine, women & song, that they were extraordinarily good fighters & were a wild long bearded lot of Black savages. We do hope that the Turks will not be disappointed with their fighting propensities at any rate. I also heard it stated on good authority from the Naval men that one day last week just at dawn a Taube was observed overhead but it did not stay long, it evidently\n\ncame over for scouting purposes.\n\nTuesday 20th There is great secrecy on this boat & reliable information about the future scanty It is common property that the Landing is expected to be a difficult & ticklish job, that the Turks are supposed to have at least 70,000 men on the Peninsula, are very strongly entrenched & have a great no of concealed batteries. It is rumored that 50 batteries have already been located. It is also said that the peninsula is guarded both by floating mines & by land mines.\n\nIt is thought that there will be landings attempted at 3 different portts in the Gulf of Saros under cover of the warships gun fire. Also rumored that a Naval Brigade will make a feint of landing farther up the peninsula. British, French, Australian & New Zealand & naval brigade troops to do the work exact nos I must not enter here.\n\nIn addition to the fleet at Lemnos there is also I hear another fleet at another island & it is common property that a great many Greeks are assembled here in little fishing boats who hope to have a finger in the pie if we are successful in getting on to the peninsula The weather has been beautifully calm the last few days.\n\nWednesday 21st A Wet & squally day. no chance of moving today as the sea is up. So rough.\n\ndid it get during the day that the Hymattus, a troopship was blown aground but is not in any danger.\n\nThursday 22nd April nothing doing & we are all sick of waiting. On Board Gen Birdwood is already very popular. He may be seen at any time of the day walking about among the troops & horses talking to them & listening to any complaints they might have. He talks & listens in the most simple & natural way possible & is voted a great fellow by our chaps. He inspires confidence in everyone at once. I am glad to say that I had a chance of a few words with him, nothing much, but enough to get a good look at him & appreciate him. Meeting a man like him makes you appreciate that he is the true type of Englishman & makes one feel more than ever the wish to see England & some more like him.\n\nFriday 23rd April. Mysterious bustle & preparation on hand & everyone feels that the hour is now close at hand. About 5 pm our suspicions are confirmed.\n\nGen Birdwood & staff leave our boat & go off to a warship on which they go to the\n\npeninsula. All the men & officers assemble on deck & three very hearty cheers are given for our General 8 pm. Gen. Bridges & staff go off to another warship. We again give them cheers. In addition during the afternoon 5 transports steam slowly out of the harbour amid a great scene, bands playing & on every hand side mighty cheers are to be heard from all the ships. All ranks now are as happy as larks we know now that it is only a matter of hours & we will have our first sight & taste of the real thing. It is great to think of it after all these weary months of waiting. To bed early as we expect to be off early in the morning.\n\nSaturday 24*h April. Awake at 6 am & find that we are underway at last. We are already outside the harbour & are skirting the West coast of Lemnos. At am sight Mount Athos quite distinctly. Here is the famous monastery about which I have already written. Everyone is eager & expectant. At 10 am we anchor in a bay at the NE corner of Lemnos where already there are three other transports at anchor. Here we are to wait all day & proceed to Gallipolli late at night. The 1st Battn i s to go off early\n\ntomorrow morning after the covering party have secured a landing. The honor in this falls to the 3rd Brigade under Col Maclagan. By evening there are 8 transports packed with troops in this bay. The Troops are all as unconcerned, laughing & joking as if they were on a huge pleasure cruise. The thought that strikes a Sydneysider is. Are they really going into battle tomorrow, or down Sydney Harbour for a Sunday outing. You would think the latter to look at them. One cannot be anything but cheerful & confident with such smiling & happy faces around Of course everyone I suppose has an under current of anxiety in their minds as to what will be the result of tomorrow It is inevitable that everyone is not coming out intact but we are in the real thing at last. I for one will not go ashore tomorrow so my baptism by fire is deferred for the present. For the first two days I play a tame part, will have to sit on the boat while the others are in the thick of it However who knows what will happen. Plans may have to be altered at a minutes notice Reveille is to be at 4 am tomorrow, needless to say there will be\n\nno bugle blown. About 5 pm I sat on an upper deck & watched & listened to a large group of 1st Battalion boys down below I will put down a few \"just before the battle sayings\" that I heard. It serves as an illustration of their devil may care attitude.\n\nEh Bill said one burly gravel puncher as the Infantry are called at times. We are goin’ to ave a nice ‘ot breakfast tomorrow Yes, said the other, first I ‘eard of it. Yes said the first Bread & mustard. They had been just issued with fresh rolls for the mornings breakfast\n\nOh well said another, if the ammunition gives out tomorrow we will still have the biscuits, a lively satire on the hard iron ration biscuits of which every man is to carry two days supply off the boat. Personally I have been fairly busy all day & have not had much time to let my mind dwell on all that might happen.\n\nOne or two only I have seen who might be said to be somewhat nervy. One chap saw some suspicious looking boxes floating near the ship. I got quite excited, brought two or three others along & quizzed the things through glasses\n\nthought they might be mines possibly. However they were only empty packing cases. One’s mind somewhat naturally turns to mines. One little chap then assured me that at any rate a fellow cannot be too careful. I quite sympathised with his fears. Just about dusk we saw a stirring sight. Away to the west in the ghostly half light we caught a glimpse of four huge battleships in line steering towards the peninsula at full speed. It thrilled me to see these emblems of the might, majesty & power etc.\n\nAbout 10 pm I have a yarn with Thompson the 1st Bn medico & we go over plans, ways & means for the last time He is a very cool customer & ought to do well for his unit. We hear that we are to sail about 11.30 pm & that at 3 am absolutely every light in the ship is to be put out. At 11 pm I went to bed to try & get a few hours sleep. In spite of the fact that I have a soft job tomorrow I feel quite as excited as if I were to go off among the first. Tomorrow ought with luck to be a red letter day in future Australian History Books.\n\nSunday 25*h April 1915 It is worth underlining. 4.20 am. I have only half slept after all, half hearing everything. Now can be heard people moving about & talking in low voices so I decide to go up on deck. Up on deck most of the officers are standing about It is starlight still but the dawn will soon be on us. The air is crisp & cold while the sea is like a mill pond. In the half light one can just make out that we are heading for a bay between Kaba Tepe & Nibrunesi point, steering practically dead east. The shore can be dimly made out. Straight in front about 2-3 miles away can be made out high ground going straight up from the beach. To the North there are also hills dominating the bay. We are getting closer & closer in & one cannot help thinking, When will the Turks open fire on the ships in the bay from these commanding heights which are in front & to the north of us. surely they must have big guns there & what about the torpedo tubes that the shore is supposed to be lined with in different parts. But they cannot have seen us. Now it is getting much easier to see & we are about 2 miles I should say from the shore. Big warships may be seen lying close into the shore & several transports seem to be almost on the shore so close are they in. Still no big guns are heard.\n\nNow about a mile & ½ from the shore & continuous crackle of rifles can be heard plainly. The 3rd Brigade have landed. Now may be seen Destroyers flitting about while the mill pond sea is dotted with launches & row boats some single most in tow by naval stem pinneces in long snakelike columns.\n\nOur ship A11 is now about one mile from the shore & our anchor rattles out as we slowly come to a stop.\n\n4.45 am the 1st big gun of a warship that is close in roars out. The first that we fire in the battle said Bean the war correspondent as he looked at his watch & gave us the exact time Again the gun fires & we see that she is attending to Gaba Tepe. A shower of sparks go up & there is a low murmur of applause from the troops on the deck below. We can now plainly hear the crackle & the rattle of machine guns on shore. Still no big gun speaking fromthe Turks. We now see for the 1st time an example of the stern reality of war. Just to starboard of our boat is a row boat which has been cast off for the time being from a pinnece. In it are two sailors, one with a wounded arm & the blood staining his shirt is supporting a mate who is rolling on his seat only ½ conscious with a bullet wound in the head. Even to me a medico the first impression gained in cold\n\nblood as we stand on deck doing nothing gives a sickening feeling just as I felt when I saw my first surgical operation as a student and I thought I had lost that feeling for the rest of time. The row boat has still way on & comes in alongside where willing hands get the poor chaps aboard & they are soon attended to & put to bed.\n\nJust about 5.45 am an enemy shell falls & explodes in the water about 100 feet in front of the bows of our ship So I suppose we can now say that we have been under fire. Of course in a mild way compared to those on shore. We wonder how many more shells will come over Some more arrive but go wide of our ship.\n\n6.15 am A TBD comes alongside & the 1st half of the 1st Battn swarm over the sides of the ship on to her iron decks. I then went down to attend to 12 wounded men who have arrived on the ship out of different landing boats. They are some of those who were shot before setting foot on the beach.\n\nDown below I meet the commander of the T.B.D. who has come on board to find a medico to look at 15 or 16 wounded & dying men he has on his T.B.D. I spoke to Col Ryan & leave him & Lt Col Marshall to go on tending the wounded already on board while I went with the\n\nNaval man down the rope ladder in to the T B.D. whose decks are being packed with 1st Battn troops. 400 this craft will carry. I find 3 severely wounded & moribund cases. (1 Fractured skull bullet wound & 2 abdominal bullet wounds). There is also another abdominal case in fairly good condition About 10 other cases there are less serious in nature. These wounded belong to the 3rd Brigade & to the naval men who were in charge of the landing boats. As the vibration & heat on a Destroyer are so considerable & as she will be packed with troops these wounded will have to go on to the Clan MacGilvray which is acting as Hospital ship. We manage to get a steam launch & with the help of the Jack Tars who are wonderfully good fellows we quickly get the wounded transferred I then turned round & made my way to the rope ladder & find that I just miss making a trip ashore. The TBD has already cast off from A11 & I have to jump for the rope ladder & chance a ducking.\n\nBy the time I got up on to the Minnewaska it was 7 am, the sun was shining brightly, the sea was perfectly calm & there was not a breath of wind. It was just like an\n\nearly Spring morning on Sydney Harbour or even say at Dee why beach.\n\nI then went down to the wounded on board ship & with Col Ryan & Capt Lewers worked at this till 8 am & made them all comfortable for the time being. I saw they would need considerably more attention in a very short time as the wounds were bleeding, & which was difficult to check stright away. We then had some Breakfast & shortly after about 8.15 am, the second lot of the 1st Battalion went ashore by TB.D. Col Ryan & Lewers went with them & I was left the only Military medical officer on board.\n\nA little before 9 am before going down to the wounded again I noticed a warship close in to shore which was slowly working down on to Gaba Tepe & absolutely plastering G.T. with terrific broadsides, the din & the explosions are magnificent to see, clouds of smoke dust & debris hurtling into the air. There is a well concealed battery here that is able to enfilade our landing place & so work great havoc. This battery is silenced shortly before 10 am but the warship has been at it since daybreak.\n\nAt the same time. Another big warship is\n\nstanding off the coast to the south of Gaba Tepe & firing broadsides inland at batteries concealed I fancy in a gully, well behind the ridges which our men are now contesting She is giving the place a hell of a time & goes on with her good work nearly until 12 m d The Turks are now firing a great deal of shrapnel which is bursting over our men as they are on the ridges as they are landing & even as they approach the shore in the open boats Shrapnel bursting leaves a puff of white smoke in the air just like a white cloud Our men as yet have no artillery ashore & are relying on the fleet guns. The firing on shore now is very heavy & continuous. Our poor chaps must be suffering heavy casualties.\n\nAbout 9 am I went down to see the wounded & from the less serious cases heard a little about the landing of the 3rd Brigade. The men just tumbled out of the boats almost before they were ashore waded ashore & without waiting for orders charged up the hill which here rises sheer from the narrow beach. They dislodged the Turks with the bayonet with an impetuous rush & soon had them flying. As it happened our landing was made further to the North\n\nthan was intended but it proved a blessing in disguise as the Turks evidently did not expect us at this point for it was found to be more in the nature of an outpost. Consequently we more or less caught them napping & by the time they had rushed ample reinforcements up from Gaba Tepe our men had secured a good footing on the shore. I spoke to a sailer who had nothing but the warmest praise for our men. He said it was magnificent to see how cool the men were, & how they rushed this first ridge.\n\nOn inspecting the wounded I found that I would have to dress the majority again, as the bleeding was so troublesome. I had just started when we heard the roar of shells through the air & three dropped alongside us in quick succession exploding with a most vigorous bang. One just missed a Destroyer that was near us, another fell about 50 ft from us & the last a little further away. Presently up came the anchor with a great rattle & we quietly steamed out to a point about 3 miles from the shore. Two of the wounded I find have died. One a naval man & the other an A.M.C. man belonging to the 3rd Brigade. I find there are two other AM.C. among the wounded.\n\nThe majority of the wounded were hit\n\nabout the knees & legs. Evidently they were hit as they were sitting in the boat in a crouched up position\n\nThe wounds are all large & irregular jagged holes with free venous haemorrhage & I find that packing the wounds with gauze is most effective. One bullet I removed from the knee of a Jack Tar. It was just under the skin & was mushroomed out into an extraordinary shape. He was very proud of it. Most of the men are suffering a good deal from shock, largely due to the reaction after such tense excitement that they experienced However they are all very happy & proud of themselves & their mates, are ready to put up with any pain & inconvenience & are talking nineteen to the Dozen. One chap told me that our men went with a grand rush, but are suffering a great deal from snipers, who are hidden everywhere & are considerably helped by the dense scrub. He told me that our men are not giving any quarter as at present they have no time to take prisoners. I repeat it for what it is worth.\n\nOne poor fellow I have had a great deal of trouble with. His jaw is shattered &\n\nbleeding into the mouth. I dressed him 3 times before 12 md before I could get it under control. He bore the pain which must have been hellish without a murmur & thanked me so gratefully when it was finished. I then gave him Morphia & at 12 md he was fast asleep. By that time I had fixed them all up & went up on deck again. I will never forget the scene. A thick haze of dust & smoke is hanging over the shore, the small white clouds are hanging overhead (shrapnel bursts) & the roar & rattle of machine guns, & rifles is incessant. Add to that every now & then the earsplitting roar of the men of war as they delivered terrific broadsides, the bayonets flashing in the sun as troops went over a ridge & you have but a poor picture of the scene. It was really beyond my powers of description At 12.30 I got orders to transfer all my wounded to the Hospital ship & by 1.45 pm I had got the last over the side on to a Trawler that was to take them over. Only a few out of the 16 were able to walk on. the majority had to be slung over the side on stretchers I must say a word of praise for Padre.\n\nGreen who gave me invaluable assistance He took all the names & particulars of the wounded & worked like a Trojan. My A.M.C. assistants were all Transport men of the 1st Fd Amb & their excellent work surprised me. In Mena Camp they never had much chance to learn much 1st Aid as they had to be continually with the horses, but they all, especially Sgt Poole turned to magnificently. They were indispensable.\n\n1.45 pm. I had lunch or rather several if you judge by the amount I stowed away.\n\n2.10 pm Our men are now well on to the ridge which runs in a N.E. direction from Gaba Tepe & from stray bits of news, going strong, but we hear the casualties are heavy.\n\nSuddenly a warship that is lying quite near to us opened fire on to a ridge to the left & a little inland from the landing. We could see the bursts but could not make out what the target was, but heard afterwards that it was Turkish reinforcements attempting a flanking movement on the left. There was great slaughter we heard. The warship kept very attentively at this target for two hours much to our joy.\n\nThe Shrapnel may now be seen dropping continuously on our troops; there must be some well hidden batteries inland but it must be very hard to get direct fire on to them as the peninsula is nothing but a jumble up of hills & valleys in a most irregular formation.\n\n4 pm We again get under way & proceed to Imbros 12 miles from Gaba Tepe & about the same distance from the entrance to the straight straits Here we anchor in a bay with several other transports, feeling very disappointed that we are moved so far out & not knowing when we will get our chance to get into the thick of things But the panoramic view we gained was some consolation for the time being, it was superb. We now can view all the operations in one big panoramic view picture. We can see the entrance to the straits & the peninsula stretching up to Gaba Tepe & beyond that again to Suvlabay & then on into the head of the Gulf of Saros. Off the entrance may be seen a big flotilla of warships & transports & further down off the Asiatic coast may be seen another lot which belong to the French. Here they are probably making a feint at landing. Among the former flotilla is the Q Elizabeth & she is now firing at Achi Baba. This hill she is\n\npounding with broadsides & it looks just as if it were a volcano. It seems to one as if she must knock the Top right off the map. At this point, the Tip of the peninsula, the English are attempting a landing. All along the peninsula can be seen the battle haze which is very like the dirty pall that hangs over Sydney on a still day\n\nThe day has been perfect, a brilliant Spring day practically no wind & the water as smooth as glass From a weather point of view it is one of the finest Sundays I have known, but who would have thought it Sunday.\n\nThey say that modern warfare is not at all spectacular but as viewed from the decks of a liner this battle is a most spectacular affair. Why at Gaba Tepe we could even see the glint of the bayonets. Just before we left that point the Indian Mountain batteries were being got ashore & a little after 2 pm they were disembarking some of the Australian Field Batteries. They will have plenty to do I should think dealing with those parts that the warships cannot touch on account of the flat trajectory of their gun fire As yet there are no other mounted units ashore and I suppose we will not disembark for\n\nat least two days. I don’t know why they do not get the Tent subdivs of the Ambulance ashore today, surely we could do a good deal ashore.\n\n6.30 pm A sudden call to proceed full speed to Gaba Tepe. We are to act as a Hospital ship. With the help of the Amb men I at once got all the available medical stores out of the hold & started getting the ship into order so that it would be something like a Hospital ship. There was plenty to do & I am the only military med officer aboard. The Ships Doctor a very decent old chap has offered all his stores & his services unreservedly.\n\nBut we had only gone about 3 miles when we turn round & went back to Imbros, a false alarm. We were keenly disappointed as on board here we have nothing to do & it makes one feel rather small when you think of all the chaps out in the thick of it, hungry, probably thirsty & dog tired while we are on board. 1st class passengers on a Transatlantic liner. I feel disgusted with our lot. But at any rate I had a heavy mornings work from 7 am till after 1 pm so that makes up a little I suppose.\n\nAfter dinner we went up on deck & could hear the firing as plainly as ever. We could\n\nalso see the flashes of shells & of signal lamps on the hills.\n\nWent to bed at 9.30 pm dog tired after the most exciting & thrilling day of my life. But how much more tired must those brave chaps on shore be.\n\nCol Howse is ashore with a detachment of the Clearing Hosp. who are doing the work that I thought the Field Ambs. would be doing.\n\nMonday 26th April Another perfect day clear calm. We can see plainly the Australian & N Z transports & warships off Gaba Tepe. while off the entrance & further down there is a large no of vessels & signs of great activity. There is a violent bombardment of the point of the peninsula all the morning & huge clouds of smoke & dirt go up as the warships shells take effect. Here the British are landing. We do not know yet whether they have successfully landed as a whole or only in part.\n\n11.30 am The Q.E. suddenly steams full speed up the coast towards Gaba Tepe. her speed is wonderful. A little after midday we can see her in position near Kaba Tepe & she has begun a most violent bombardment of a conical peak which is inland & somewhat to the north of the left of the ridge the Australians are holding. This\n\npeak appears to be at the end of a plateau, at the other end of which appears a rounded eminence & at this end appears what looks like a solitary tree on the plateau.\n\n \tSugar loaf \tPlateau \tConical peak\n\nWe cannot decide the exact location of these features on the map so I cannot put a name to them.\n\nDense clouds are rising up from the peak & at intevals the whole peak is blotted out by the smoke. At other times it looks as if it were a smoking volcano. The QE is also shelling the length of the plateau.\n\nWe took the time from the flash of the guns to the instant the sound reached us, & we found it was exactly one (1) minute. Calculating on sound travelling 1100 ft per second, we find this makes us 12.5 m. distant, which is correct according to the Ship people. Later in the afternoon we could see a great amount of Shrapnel bursting over the ridge on which our chaps are & also over the beach. At first it looked as if our men must have fallen back but I suppose the Turks are systematically shelling the whole area occupied by us. Some bigger shells of the Turks we can see dropping in the water, evidently they are going for the shipping.\n\nAt 5 pm we get a little news which is very welcome. \"The Australians are holding their own with the Turks falling back on the left wing Down South the violent bombardment continues the whole afternoon.\n\njust before dusk Transport vessels can be seen coming over the sea in single file & heading for the entrance to the Straits (6)\n\nThe night is comparatively quiet.\n\nTuesday 27th Another beautiful day with calm sea. We can see after Breakfast the Q.E. lying to below Kaba Tepe She is bombarding at long range the Achi Baba summit & range. She is delivering terrific broadsides & although she is quite 10-12 miles from us, the windows & walls of the smoke room are rattling & shaking as a result of the tremendous concussion. The sound is the loudest that we have yet heard I certainly would not care to be alongside the noble Queen Lizzie in her present mood.\n\nOver the Australians position can be seen a very intense bombardment, both sides apparently being responsible. Some Turkish big guns in addition, are trying to get the Transports but their shells, which are making a lovely splash, are falling short. In a very short space of time however the transports moved\n\nout of range, no damage done. About midday a serious accident occurred on our ship. One of the crew was in a lifeboat as it was suspended from the davits when suddenly the boat fell with a sickening crash on to the water 50 - 60 feet below. I actually saw the boat fall into the water & saw it smash like an eggshell & quickly ½ fill with water, but did not dream there was a man in it. However a sailer & a soldier quickly dived in & got the mans head out of the water, the poor chap was lying in the boat huddled up half in the water. The boat was then hauled up.\n\nThe ships Doctor & I fix the man up He is quite unconscious & has a factured skull, fractured arm & fractured thigh. He will only last a few hours so I left 2 AMC men to constantly watch him so that everything could be done for the poor fellow.\n\nDuring the afternoon the British troops can be seen completing their landing operations, while ½ way between the point & Gaba Tepe a no of transports may be seen which are said to belong to the Aust & NZ Division.\n\nDuring the afternoon Padre Green who is just as sick of this inaction on board ship as we \n\nall are, went off to a Trawler that has just come into the bay, & came back with some welcome news, even though it was a bit vague. The Australians have done splendidly & have done all that was expected of them in a much shorter time than was thought possible. Their casualties are heavy but not as heavy as might have been expected considering what they have achieved. Further the South end of the peninsula is now clear for the English to advance. The French are said to be reinforcing the Australians & all the shrapnel that we have been rather anxiously looking at during the morning as it was falling on the Aust position & about it is we hear mostly our own.\n\nThe Turks are entrenched around the Northern part of the ridge & they are the recipients of all this gun fire. This bombardment continues without ceasing till 10 pm. & the flashing of the shells as they explode makes a magnificent display in the darkness. Just inland to our position can be seen two bright glares, as if some stores or ammunition or even a village had been set afire. We have not received any orders to disembark yet & everyone is\n\nfeeling fed up. It is said that the landing place is still under a very heavy fire & this I believe is preventing the landing of Transports, Mounted units & Ambulance sections. It seems humiliating to be loafing about as 1st class passengers on a Transatlantic liner while our fellows are over there in the thick of it, constantly exposed to a deadly shrapnel fire, dog tired, hungry & thirsty. There is one consolation, there are plenty more in the same box as we are, why I doubt if all the Artillery is ashore yet.\n\nThe Turks appear to be putting up a very fierce resistance & our main task is very far from being easy. The enemy batteries in particular are giving our men a bad time & the warships are finding it very difficult to silence them, as they have all the advantage in this awful broken country.\n\nFrom a weather point of view we have been particularly favoured & there has not been a hitch in the landing operations as a result. Every afternoon thick white clouds come up in the North East & remind me very much of those that come over Sydney from the N.W. on a warm summer day when a NE wind is blowing. Today these clouds worked up into a squally\n\nrain storm & we saw that a great deal of rain fell over Gaba Tepe. However the storm quickly passed & now at 8 pm. the sky is clear & the air quite cool This Climate at this time of the year’s certainly ideal & reminds one very much of New S.W. climate.\n\nAt 9 pm. the accident case died He will be buried at sea tomorrow.\n\nWednesday 28th April. At last we are on the move We got orders to proceed to Kaba Tepe & arrive there shortly after 9 am. I am determined by hook or by crook to get off this vessel, and chance my luck with the ADMS on shore. I feel I cannot stick this sort of existence any longer My chance came sooner than I thought Just before lunch a message came aboard for me from the ADMS. He wishes me to send off all the stretchers I have on board as well as some reserve medical stores; as regards myself not a word, so strictly speaking I suppose I should obey orders & stay on board, but — Those stretchers & stores cannot be allowed ashore without a chaperon & I am going to be the chaperon & chance a wigging I feel very pleased with my chances.\n\nI decide that it would look too suspicious to take my baggage ashore so I put my tooth brush in my pocket & a few hkerchiefs & socks in a haversack, my overcoat over my shoulder & leave all the rest of my gear on board, as, if I can stay on shore, I can easily slip out to the boat later & get them.\n\nI left the A11 about 2 pm. after telling Sgt Poole to carry on if I do not come back & instructing my batman to look after my baggage.\n\nI went ashore in a naval pinnece with a very small & unconcerned middy in charge. When we got within a mile of the shore we could see & hear the bullets dropping into the sea all around us but luckily no shrapnel came near us. I felt I did not trouble about them much & I think my secure feeling in this respect was due to the matter of fact air of the crew of the pinnece. You would think that they had been at such work all their lives. We arrive at a temporary Jetty a liittle after 2 pm. under cover of the ridge which at this part goes straight up from the beach & affords a good measure of protection against fire coming from inland but not against fire from the flanks. However, the batteries\n\non the right flank have been silenced so there is nothing to worry about from that quarter. The beach & the hill side present an extraordinary scene appearance. Stores, ammunition, kits, clothing are lying scattered on the beach while the hillside is swarming with Khaki figures, some of them digging roads, some digging dug outs, others hurrying up the hill & over the top with Stores or munitions for the firing line. I was immediately impressed by three things about the men & officers. They were all very sunburnt, very dirty & very cheerful. One might be on a big railway construction camp. Some of them are working stripped to the waist, & others are enjoying a dip in the water quite regardless of shells or bullets that come over. I soon found Wassell, Kay & Major Stokes who were sitting in a dug out half way up the hill. They are very cheerful & tell me a few of their experiences during the last few days. From all accounts the first day ashore was a nightmare During the afternoon the wounded came pouring down on to the beach till it was packed to overflowing, and it was not till late on Monday afternoon that the beach was at all clear\n\nof wounded.\n\nThen at midnight on Sunday night or a little after an order was passed to all the troops on the beach to fall in & be ready for re-embarkation The Navy it is said had received an order to send boats ashore for this purpose & the troops were actually on the point of reembarking when the whole thing was discovered to be a mistake. The 1st Fd Amb men on the beach had actually fallen in. Indeed during that Sunday night it was touch & go, our line was very thin, & it is said that on account of the heavy casualties the Generals held a conference late on Sunday night to decide on sticking to what they had got or getting off. Wassell & Kay have had a very strenous time, but by now the work of collecting the wounded has been put in order & each Fd Amb has had a definite area allotted. Our Amb. is collecting up a valley on the right flank & Welch is at present up there on duty. Wassell is going out after tea. The 1st Fd Amb has had 5 or 6 men wounded & Capt Webb has been hit in the thumb by shrapnel It is not serious enough to go off duty. Capt Bean AMC 3rd Bn has been wounded seriously & has gone off to a Hospital ship. Other medicoes have been\n\nhit & three of the Battalions are at present -S Medical officers. The 3rd Fd Amb. had about 30 SB’s out of 100 hit on the first day. Their casualties occurred chiefly as they were coming ashore with the 3rd Brigade. About 3 pm. I found Col Howse ADMS. 1st Aus Div. & reported that I had brought ashore stores & stretchers. He appeared to \"tumble\" to my little game straight away for all he said was I don’t suppose you can get a boat back to your ship tonight. I said No sir I am afraid that is impossible. He then asked me if I would like to take on a battalion, to which I very gladly said yes. so he gave me the 3rd Battalion.\n\nI then returned to the 1st Fd Amb. & found that they had been moved about ¼ mile down the beach where I ultimately find them. On my way down I pass great nos of mules led by Indians These are carrying water & stores up the valleys to the Troops. I also passed a wireless apparatus on the beach which is transmitting messages to the warships.\n\nI find that my best plan will be to go up\n\nwith the 3rd Fd Amb Stretcher Bearers after tea. They are working the valley where the 3rd Battn are posted & of course know exactly where the Battalion Aid post is.\n\nI had some tea at 6 pm consisting of Bully Beef, Hard army biscuits just like dog biscuits & tea. Was very hungry & enjoyed it thoroughly About 7 pm I went back to the landing place & there met some 3rd Fd Amb S Bs. who directed me to Capt Conrick AMC who was to go up with them that evening. I was very glad to meet him as I would have surely got lost if I had tried to find the Battalion in the dark by myself.\n\nA little after 7 pm. we started off just as it was getting dark, passed over the 1st ridge at the landing place down the other side into what was named Shrapnel valley. We kept up this valley for about ¾ mile & needless to say I had much to look at on the way. What impressed me most was the huge amount of kits & clothing & toilet gear strewn on both sides of the valley. There must have been hundreds of pounds worth just lying where the men had cast them aside. For the country is so mountainous & rough that the troops\n\nfound that it was impossible to work with their heavy packs on so they just threw off everything they could. We arrived at a place where another track branched off to the left & here I found my 3rd Battalion AMC details. The Corporal & Lance Corporal are running the show, they have their main aid post at this point, while further up just under the top of the ridge a little way back from the firing line is an advanced post. I stop at the aid post & the Fd Amb people go on up the valley to the path that leads up to the trenches \n\nI find that the AMC men have made shallow dugouts in the steep hill that goes up on the left hand side of the path & that, to a great extent protects the aid post from gunfire. Here in the day time the AMC even have hot drinks, tea coffee & beef tea constantly ready & this has been greatly appreciated by the wounded. I find that we are very well stocked with surgical material, as one of the AMC men picked up a surgical kit down the path & as a result the 3rd Bn have now got more dressings than they started with\n\nThe Stretcher bearers both Regimental & Fd Amb have been carrying cases from the firing line to this post & from here they are carried to the Clearing Hospital by Fd Amb bearers only. When I arrived things were slack so I decided to wait for the AMC Corporal Malone, who will shew me round on top of the ridge. As I waited an AMC man passed leading a donkey on which was a wounded man. He is already a celebrity & is known as the Donkey man. He has been carrying cases down night & day without a rest since Sunday & goes up & down absolutely regardless of Snipers or shrapnel. It is said that the Donkey is one he found wandering about the shore when the landing was effected & he at once took possession. He is known all over Anzac by this. Anzac by the way is the name given to the piece of country we now hold & it is certainly very appropriate.\n\nAfter waiting at the Aid post 1\/2 hr. the Corporal had not turned up so I got one of the men to take me up to the advanced post, where I will probably find the Corporal.\n\nWe started off & got on to a zig zag path leading up the steep slope to the top of the ridge. This is very steep & slippery owing to the clay soil.\n\nThe moon is shining brightly & at several corners on the path I was warned to get down & half crawl along as some of these corners were enfiladed by Turkish snipers & during the day there had been several casualties on them. I met the Corporal at the Top station which is just below the crest of the ridge about 400 ft above sea level although only distant from the water about 900 yds as the crow flies. Here a hollow is scooped out on the top side of the narrow path & lying in this hollow are 4 bad cases, two just dying & 2 others very bad. I saw these two taken down by the Bearers & then I am invited by the Corporal to go into the firing Trenches with him. Personally I would have preferred to wait till morning as, listening to the bullets whizzing over, I felt a slight disinclination at the moment. However I could not let the Corporal go out without me so we started off. We climbed up almost vertically to the top of the ridge about 20 yds. up through sandy treacherous soil. On the crest the bullets seemed to be whistling unpleasantly close & we rested there a minute or two before running across 30 yds of open flat country.\n\nwhich we had to traverse before getting to the Fire trench. The Corporal instructed me to follow him & we went across now crawling now doing short runs. The reason of this care was due to the fact that the Turks had machine guns trained on to this spot. We got across alright without disturbing any machine guns at all & I made my presence felt immediately in the trench by literally tumbling in on top of two men. I apologised but the men thought it a good joke. The Trench at this part was a poor apology for one as it was only about 2 ft 6 in deep with a small bank thrown up in front. The men as a result did not have much protection & had to kneel or lie down. What impressed me most was their extraordinary cheerfulness. There they were laughing & joking in low tones. One would never have thought that they had been there close on 90 hours without sleep & constantly on the watch. It was marvellous. I saw some wounded & gave directions about their removal. I saw a Sydney officer Lt Brodziak who had been lying out on an exposed dugout in the open for 36 hrs without attention. He could not be got at owing to the enemy fire. \n\nHe was wounded through the neck, & was half delerious. The troops spoke very well of the AMC Corporal. They told me that he has been constantly in & out of the trench, tending the wounded & getting food & water to the troops He has been exposing himself with great bravery & according to the men bears a charmed life. After spending about 1\/2 an hr in the trench I went back to the top of the ridge. Going back the moon was hidden behind a cloud so we got across without any trouble at all. Getting over the top of the ridge, the Turks suddenly began a furious rifle fire on our troops which lasted for an hour Everybody thought it meant an attack & we came to the conclusion that the Fire trench at that moment was no place for unarmed men. I stayed at the top aid post for an hour & as no more wounded were coming in I then went down into the valley.\n\nThings were very quiet at the bottom aid post so I walked along the valley towards the left to see Thompson M.O. 1st Battn. I found him at home about 100 yds from my aid post & had a long yarn to him. Just close by him there is a spring to which he took me\n\nfor a drink of very good water. This was evidently a Turkish well. All around it now are a good many troops of different units in reserve. All the units I am told are hopelessly mixed up so that there will be a good deal of sorting out in the next few days. I went back to the Aid Post dug myself a shallow dugout & turn in to get a few hours sleep. My men found me a W Proof sheet & an old blanket & on there I lie covered with my overcoat. Just as I lay down it commenced to drizzle & as it was a bitterly cold night I did not get more than about 1\/2 hrs sleep. I lay there with my feet feeling frozen & listened to the crack of the bullets. A peculiar thing about them is that although they are fired from a point about 400 yds away, they sounded as if the rifle was being fired off just above my head. Several times I would doze off & then wake with a start, thinking that there must be some Turks just above. Of course I did not know the country at all as I had arrived in the dark & so could not get my bearings.l As I lay there, I also wondered where the old blanket I was lying on had come from & whether it was lousy, frivolous thoughts one might say. We shall see later at any rate.\n\nThursday 29*h April Between 3.30 am & 4 am I got up & walked about to get warm. All the AMC men were asleep, being I suppose quite hardened after four days continuous work The sky was clear & the air very cold. About 4 am my batman started a fire & the billy. A little later we hear that the Battalion is relieved & that we are to be on the beach not later than 9 am. The whole 1st Brigade is to be relieved & a brigade of RMLI are to take their place. These\n\ntroops are actually now relieving our men & many 1st Brigade men pass down the valley on their way to the Beach & respite. They have been 4 days & 4 nights in the trenches without sleep & in the trenches that in many places can be scarcely termed trenches at all. Add to this the difficulty in getting water up to the firing lines, the rain & the cold weather & one can form some small idea of what they have gone through Their casualties too have been very heavy but their spirits are indomitable. About 5 am. we have breakfast at the Aid Post. Biscuits, bacon, ham washed down with very welcome hot tea. Shortly after the men get the equipment together & about\n\n6.30 am we start down the valley on our way to the beach. On the way down I took note of the country We are walking down a valley which looks as if it must be the bed of a torrent of water in the wet weather season. It runs down between broken ridges & opens on to the beach a few hundred yards below the main landing place which is now known as ANZAC cove. This valley in part is known as Shrapnel Valley & the Valley of Death. This is on account of the daily plastering with Shrapnel that the Turks give it. However, in the rising ground on either side are now made a great no of funk holes so that if the shrapnel starts one can take shelter. As we went down 2 or 3 shrapnel bursts occurred but did not get very near us. One sees a white puff above & then the bullets come pattering around on the ground just like rain. You get the impression that they would do very little harm if they hit you, judging by the apparently harmless way they patter on the ground but appearances are deceptive as the majority of the wounded could tell. Up & down Shrapnel valley there is constant traffic, Mules & men carrying stores & water & stretcher\n\nparties bringing down wounded. The litter of equipment about the path is astounding everything one might say from a tooth brush to a rifle. One could do a flourishing business as a 2nd handstore with all this stuff in Anzac. When we got on to the beach we were directed where to go & on finding 3rd Bn HdQuarters I reported to Major Bennett 2nd in command. We have to bivouac on the beach which is sheltered by a perpendicular cliff about 20 ft high & about 20 yds from the waters edge. Here we started to make shelters in the face of the cliff while the rank & file scooped out shallow trenches about 18\" deep, close & parallel to one another, & at rt angles to the waters edge. The cliff protects these & indeed as we were making them we saw the bullets & occasional shrapnel dropping into the water a few yards from the beach. The bullets hiss through the air or very often make a noise like a mosquito singing This hiss is heard continuously while now & then a bullet which goes close to one goes past with a whiz & makes one inclined to jump. However one gets quite used to them in an hour or two.\n\nIt is notable that there are practically no casualties from these passing bullets. Only 3 or 4 men were hit during the day out of three battalions. The men were straggling in all the day & at midday there was a roll call when the Battalion was found to be barely half strength. I watched the men come on to the beach & all looked absolutely done. Their faces were drawn & yellow & the majority as soon as they got on to the beach simply flung themselves down & in a few seconds were fast asleep. I noticed the reaction in them after the tremendous strain of the last four days. Although they were full of life right up till the time they left the trenches, once they got onto the beach they just seemed to collapse & were asleep in a second. Most awoke just before 1 pm & then had a dip quite heedless of the bullets Then it was I noticed that their color had come back & most looked fit as a fiddle again. But the nerve strain had a deeper & less apparent effect. If a man were spoken to or called, he would jump as if he were shot & I am sure that in spite of their spirits reviving so quickly, if one had spoken harshly to those men on this day they probably would\n\nhave wept. However a rest during the afternoon worked wonders & that night you might have thought yourself back at Mena as you listened to their jokes & their stories. During the morning I saw a few sick & dressed a few wounds & fixed up the sanitation. As I had nothing to do in the afternoon, I thought I had better try & get out to the Minnewaska & get my gear. After waiting an hour on the jetty I got aboard a pinnece, telling the naval transport officer that I was on special duty & was soon on the Minnewaska again.\n\nHere I got my sleeping bag & waterproof sheet & toilet gear, a service uniform, a singlet, 1 pr underpants 3 prs socks & ½ doz H’Kerchiefs I also brought my camera off & about 3 Doz. films. While waiting for the pinnece I had a look at ANZAC & the country on either side. I will not attempt to describe it further than I have as photographs that I have taken shew much better than a lame description would. Inland from Gaba Tepe about 2 way to Maides which here is only 4 ½ miles across on the narrows, can be seen evidence of a big fire. It looks as if some stores in a\n\nvillage even the village itself are on fire It must be 4 - 5 miles from where I stand & one can see a huge column of dense black smoke & very high flames. I would very much like to see it by dark. But about 5 pm the pinnece is ready for me so I go ashore. We had a quiet trip to the landing place no shrapnel going anywhere near us for which I was duly thankful. I found the\n\nBattalion settled down in their new quarters with the 2nd Battn to the left of them & the 1st &","57":" to their right. Had a good tea of Bully Beef & Biscuit pie & Biscuit & jam pudding. Biscuits soaked in water after being broken into small pieces mixed with jam & warmed over the fire. It made a very dainty sweet indeed. Whenever I chew the biscuits \"au naturel\" I feel very pleased that I have sound & strong teeth. Even at this early stage of the game I have had a good many men reporting with broken teeth & broken tooth plates.\n\nAfter tea I went for a walk up & down the beach with Major Bennett who told me many interesting things. Amongst other things he told\n","58":" how Brigadier Maclaurin & Major Irvine lost their lives It appears that Major Bennett sent a message to Brigade H.Q, asking for artillery fire on a target that he described The valley was swept with shrapnel at the time & snipers were very active yet the two officers decided to come up & see the target for themselves. They exposed themselves on the side of a ridge & were shot by a sniper or snipers.\n\nConsidering the nature of the country it can best be described by saying that it is very like the broken scrubby country around Middle habour in Sydney. There appears to be a fair quantity of good spring water & some small creeks which drain the steep ridges The ridges are very waterworn & all of a loose sandy & clayey nature. Our line is roughly a semicircle about 3 miles long but which is at no point much further from the sea than 900 yds. the sea of course forms the base line of this area.\n\nThe climate is delightful & very like that of N.S.W. & there are absolutely no flies at present. I heard a good yarn about a stretcher bearer after tea. He was walking up the valley.\n\nwith a stretcher over his shoulder. It was also carrying a Bill hook. Suddenly he was confronted by a Turk who at once put up his rifle to shoot him when he knocked the Turk over with the stretcher & then finished him off with the Bill hook. The man who told me this swears it is true. I also was yarning to Lt Street who is a son of Justice Street of Sydney. He was at Pauls College just after I left. He is a very decent chap & was very well spoken of by his senior officers for his work during the landing & the four days following\n","59":" Everybody is awakened before 4 am by the roar of big shells over head. These are Turkish big guns, & it is thought that they belong to the Goeben who has been making a hobby of coming down to the Narrows & firing across our position at the Transports. Some of the shells fall into the water just in front of us & as a precaution, the Colonel made all the men sleeping near the waters edge come up & take shelter under the cliff However two of our warships quickly got to work & sent a nice little lot over. One of the warships was just in front of us & the\n\nroar of guns was terrific. Of course we got the full benefit. It was most interesting to hear these shells roaring overhead, the sound gradually dying away in the distance About one hour later the Turkish land batteries started their morning shrapnel strafe & the men had to take shelter under the cliff once more. This is a most friendly cliff as it goes vertically up for about 20 ft. It has to be treated with the greatest respect however & any cutting under it to make a cave dugout at once will bring down a few tons on top of one if you happened to be near. The cliff consists merely of crumbling sandy clay stuff. In fact this formation appears to be common to the whole area & already there have been several accidents Only the night before last four men who had dug in on the side of a hill suddenly had the whole thing cave in & completely bury them. When they were dug out they were all dead. Where my Dugout is the wall is absolutely vertical & even at this I look with suspicion I am thoroughly enjoying sleeping out in the open & slept like a\n\ntop during the night. The simple life is a great stunt\n\nTo continue about the shrapnel bout. Already the men call it the reveille, so regularly has it been commencing at about 5 am. It is very nice to lie in ones sleeping bag & watch the stuff whiz over your head into the water, knowing of course that it cannot get you. I got up about 6 am & visited the 1st Fd Amb. who are camped directly at the back of us, only about 100 yds away. Wassell Kay & Welch are still cooking their own food which seems to me superfluous, needless to say I told them so. They agreed that the best thing would be to appoint cooks as the regular 1st Fd Amb cooks have not landed. Of course in the Battalion I am attached to Hd Quarters for which there is a separate mess & to which sit down the O.C. Lt Col Owen, the 2nd in Command Major Bennett (who by the way late last night received orders that he was appointed in command of the 4th Bn, whose OC was killed during the 1st 4 days), the adjutant Howell Price, the signalling officer Lt Goldring & the M.O, myself\n\nOne of O.C.s orderlies is cook & he serves up some good stuff. All day the Battalion rests & waits for stragglers who had been separated from their unit & who keep coming in all day. It is touching to see how these late comers are greeted by their mates as they come in They are always told that they were given up as dead & certainly you would think they had been away for years so warm is the greeting to them. All through the day the men bathe & there are practically no casualties. It is certainly marvellous that this is so because the bullets keep dropping right in among them & round them their troubles for such common or garden stuff is the impression one gets.\n\nLooking at them & seeing them laughing & skylarking one would think they were on a big picnic.\n\nA few casualties of course occurred & then you would hear mighty shouts all along the line for STRETCHER BEARERS. Several times there were false alarms & SB’s would have a little trip for nothing I had a swim myself in the morning\n\n& felt much cleaner afterwards as there is a good deal of dust about. Needless to say I went in where the bullets were least numerous. Just at sundown there is another shrapnel strafe from the Turks but no damage down our way\n\nAt 9 p.m. Went to bed & was soon fast asleep.\n","60":" Spent a quiet morning during which there was a small sick parade of minor cases & a few wounds to dress. We have heard that we shall probably move up to the trenches at any time today so everyone is sticking close round the Bivouac.\n\nAbout 3.30 pm. orders are received. The Battalion is to move up into the Firing line & relieve the troops at present in the trenches about the centre of the line.\n\nWe set off shortly after 5 pm. just as the Turks started their evening hate. As we went up Shrapnel valley we were in luck & had no casualties, although the shrapnel was bursting pretty close.\n\nWe branched off Shrapnel valley about 1\/4 mile from the beach & turned up a track leading up another valley at rt angles to the sea. (Shrapnel Valley is obliquely inland from the sea).\n\n& going straight up to the top of the ridge. Going along this path we saw much evidence of war. Saw 5 or 6 dead mules lying about & also two dead men who had been killed on the path & who were lying at the side of the path, where later they would be collected by a burying party & removed for Burial. But so used to these sights had everyone become that no one looked at them twice. We were halted at the top of the valley & our battalion was put in the ½ formed supporting trenches where they would be ready to move into the trenches & take the place of the marines early next morning. I selected a position for a Regimental aid post situated about 200 yds from the top of the valley, right on the main track to which all tracks from the different companies of the Bn converged so that if any man wounded or sick wished to get on to the main path he had to come thro’ the aid post.\n\nAlthough it was dusk I started the men on to digging & by about 9 pm we had a Dugout cut well into the Hill. (I have a photograph). Went to bed early & slept well being awak-\n\nened for only 3 cases.\n\nI am forgetting to put in a rather exciting incident As we were digging in the twilight soon after we got to the top of the valley I walked up to the top of the valley with Sgt Malone to report to Bn H.Q. We had not gone far when we heard a great uproar below. We looked down & saw 7 men rushing down from the direction of the trenches & thought at first they were Turkish prisoners with some of our men in pursuit. At once every body started yelling directions. Some advised shooting, majority yelled Don’t shoot, stop these men etc. etc. They only got to the path & were stopped & at once an immense crowd collected around. Out of curiosity I sent the Sergeant down who shortly after rejoined me & told what had happened.\n\nIt appears that these were seven Britishers who were stationed in an advanced Trench when suddenly some Turks got in amongst them. They apparently threw down their arms & bolted most of them stopped at a rear trench but this party that we had seen had not stopped running. The 1st thing they said when they got into the valley was Which is the quickest way to retire to the beach.\n\nThis was a unit of which the majority appeared to be boys just out of school & the poor fellows were frightened out of their senses. This was not the first time that certain units bolted out of the trenches & in several instances our men had to be sent into the trenches post haste to stop disaster & retake abandoned trenches. I will not mention names of units but some that I have seen appear to be extremely raw & only half trained. This unfortunately has already created an unfavorable impression amongst the rank & file of our Divisions. They are prone to judge all home troops by these units.\n\nAnother thing I might mention. Everybody is uneasy about Turkish snipers & it is thought that there are some in concealed positions commanding this valley. As a precaution all AMC men were told to take off their white armlets as they offer a conspicuous target. And again no fires are allowed after dark at all.\n\nAnother precaution that may be seen has manifested itself in the soldiers head gear. Caps of all ranks have been made into soft slouch caps by removing the stiffening\n\nwire. They are supposed to blend with the landscape by this means & certainly they are by no means so conspicuous.\n","61":" 5 am. awakened by the usual reveille of Turkish shrapnel I find at this early hour that the site of the aid post is well chosen. It is backed by a steep almost vertical rise & over this the shrapnel is coming. It is falling just in front of the aid post but it looks as if it cannot possibly get into the Dug out, unless of course the Turks use Howitzers which they do not appear to have at the present time. The Shrapnel continues on & off all the morning & a few wounded & sick keep coming in at odd hours during the day. I did not go far away from the aid post on account of this & also as I had to make the Dug out ship shape. The Dug out was completed by midday. The floor space is roughly circular & opens on to the path so\n\n \n\nOn this circular floor 3 people can be full length with their feet sticking into the part leading to the path\n\nThe walls are undercut so that the opening at the top which will be roofed over is much smaller in area than the floor. On one side of the path leading in We have cut shelves on which we have put the panniers with surgical appliances all ready laid out for emergency surgery.\n\nAfter lunch the men started digging a home of their own a little way down the path big enough to hold three lying down\n\nJust over the other side of the path we have made a fire place & a few yards up on the same side is a little spring which reluctantly gives out about a Kerosine tin full of water twice a day. This will save our men going down to the Water depot at the foot of the valley to a certain extent.\n\nDuring the morning I visited my neighbors. About 15 yds up the path & on the opposite side Capt Kane AAMC. 2nd Bn. has his aid post while about 30 yds up on our side is Capt Tebbutt AMC of the 4th Bn.\n\nAbout 40 yds. down the path & on our side is a Field Ambulance Station belonging to the R.M.L.I. This is a very elaborate Dug out\n\nwith several Dugouts cut out of the hill & communicating one with another. There are two English medicoes in charge at this station who I cannot help saying, it looks as if they would like to be thought rather superior to \"beastly Colonials\" The path on which we are situated is a supply route to several units, consequently there is a great deal of traffic up & down. What chiefly impresses one is the fearless way in which the Indians bring up the Mules, laden with supplies & water. Although the path is liberally peppered with shrapnel most of the day, these chaps keep going & do not shew the slightest concern. The mules are remarkably intelligent & very docile & are as sure footed as goats on these steep slopes. The stretcher bearers of the 3rd Fd Amb. have also to go up & down this path & this they do all day in spite of the shrapnel bursting all around them. Today already they have had two or three casualties.\n\nIn the afternoon Major Stokes came up to see around & gave me formal instructions as regards sanitation. He is on special Sanitation duty & in particular is responsible for the purity of the water supply. We are getting\n\na great part of the water from wells sunk in the different valleys. This water is sterilised with Chloride of Lime. Our men of 3rd Bn are settling down in trenches at the top of the valley & have a great deal of trench construction in front of them.\n","62":" No question of any forward move. The men are very active digging & other wise organising the defense of the position. Had a few wounded men coming into the Dressing station up till midday. Also a few sick. In the Afternoon I decided to go around the trenches & went up shortly after 2 pm. to Bn. Hd Quarters with Sgt Malone. (Malone by the way has been promoted Sgt. in recognition of his bravery & good work during last week. He is a gem as regards AMC work & in civil life belonged to a Govt Asylum near Goulburn. Outside the H.Q. we met Major Storey, Capt. Conrickson AMC. & Capt Smith 3rd Bn. who came ashore for the 1st time this morning. He was on the City of Benares & there I got to know him quite well, a very decent sort. We all set off into the winding trenches Capt Smith taking a rifle in case he should\n\nbe able to get a pot at the Turks. We went into the firing Trench & admired the view & also the smell of dead Turks thro a periscope. The bullets sound unpleasantly close as they whiz close overhead & it is quite obvious that one must keep ones head well down. We could also see the Turks throwing out earth as they dug about 80 yds. away. Altogether we stayed in the trenches about one hour finding plenty to interest us. In most places the Trenches are now dug about 5 ft deep & of course they will be dug deeper still.\n\nAs we went along we were in single file & Capt Smith who was just in front of Sgt Malone & myself stopped several times to talk to men he knew. We waited behind till he went on again. And then a tragedy ended our afternoon in the Trenches\n\nWe had turned into the Communicating trench to emerge from the trenches on to Bn H.Q. & had gone a little way when Smith stopped again to talk to a man.\n\nI was just behind & for some reason or other decided to push past & not wait for him. I got past him & had just turned a corner \n\nabout 10 yds farther on when there was a deafening bang, we hurried on & had only gone another five yards when we heard another report. Then there were yells for the Doctor so Sgt Malone & I went back. There was poor Smith lying on his back in the Trench with the upper part of his neck shot completely away, & a large pool of blood around. He was just gasping his last breath. We just had time to look at him & lift him to one side & run into a Dugout a few yds away where Col Bennett & Lt Massie were sheltering when another shell went off almost in the same place. I think it gave us all a nasty turn to see poor Smith lying dead there with this horrible gash in his neck. Particularly sad it was to think of poor Smith alive & well a few minutes before & who had just landed that morning. I remembered the poor chap on board the Transport shewing me with pride a picture of his wife & two children. War with a vengeance & I thought I had become quite accustomed to it. But now I think I could not have\n\nrealised what an awful thing it is till I had seen a man I knew personally suddenly & violently butchered. However, mercifully, Death was practically instantaneous & he could not have felt anything.\n\nAs Sgt Malone & I walked back to our Aid post our minds were full of this & I made up my mind that I was certainly not going to do any more aimless wandering about the trenches unless I had a specific duty to perform. I do not think I am superstitious but it was certainly uncanny to think how acting on a sudden impulse, Malone & I had pushed past Smith & so got out of the danger zone for we must have been hit if we had stopped Went to bed early & slept on & off during the night. I was frequently awakened by heavy firing of the Turks & we thought several times there was an attack commencing.\n\nTuesday 4th May About 7 am. Capt. Douglas 3rd Bn was brought in to the Aid post \"in extremis\" He has a bullet wound which is evidently perforating the liver & I don’t think much of his chances. We rendered 1st Aid put a red ticket on him & sent him off\n\npost haste to the Cas. Clearing Hospital. About 7.30 am a wounded Turkish prisoner was sent down to the Aid post.\n\nThe poor little devil had tumbled into our Fire Trench & as he did not know any English he was promptly shot thro’ the neck & also had bayonet thrusts through the loin & chest. The latter a serious wound implicating the lung. He was very collapsed when we got him so we promptly fed him up with hot coffee & warmed up Bully Beef & biscuits & his gratitude was touching in the extreme In spite of the pain when he breathed he tried to smile & kiss our hands. Then when we gave him an Egyptian cigarette he lay back & puffed away quite at his ease & as contented as he possibly could be although when he 1st came down. He looked on us as if he expected us to finish him off at any moment.\n\nPresently a man came by who knew a little Turkish & the Turk then told us about himself. He had been without food for 4 days & had crawled over to our Trench to give himself up That the German officers were flogging & knifing the Turks to make them go on during\n\n \n\nthe 1st week.\n\nAlso the Turks are frightened to surrender to our men as their officers tell them we give no quarter. As soon as this wounded Turk had rested & revived a little we sent him down with an urgent order for admission to Hospital ship. I think he has a fair chance of recovery, we all hope so, as was such a pathetic object, with the look of a hunted animal when we 1st got him. Needless to say our big hearted Australians well nigh killed him with hospitality while he was at the Dressing Station & everybody passing wanted to have a look at him\n\nJust before he left Col Braund 2nd Bn. called in & had a yarn, Capt Kane 2nd Bn also came down so I took a photograph of them both.\n\nThe former told us something about the Ruses of the enemy during the","63":" few days.\n\nThey stripped the uniforms from all the dead Australians they came across & some of the German officers even came amongst our men dressed in these uniforms, in order to give orders to our men that would lead them into traps. Some of our men discovered a German officer so dressed & promptly took\n\nhim to a quiet spot & shot him. Our men now are very suspicious & will drastically search anyone, be he officer or man.\n\nUp till midday attended to Dressings, sick & a few fresh casualties. All the morning the Shrapnel was bursting around the top part of the valley & several times we had to shelter well inside the Dug out as the bullets were falling on our front door step no Casualties however in our unit Just after lunch saw Col Braund again who stopped a few minutes to talk. Went up to Bn H.Q. & saw the adjutant & spoke about sanitation matters. Went to bed early but did not sleep much as the firing was incessant & very heavy.\n","64":" Before Bkfast we heard that Col Braund was killed during the night. It is said that he was going around & inspecting his lines after 10 pm. with no one to accompany him a habit to which he was particularly prone. A Sentry challenged him, but he did not answer or stop, so the sentry fired & later found that Col Braund had received the bullet & was quite dead. It came as a shock to us, as it was only yesterday he was here.\n\nalive & well & having his photograph taken."}}