{"Document Name":{"0":"Diary_0181","1":"Diary_0181","2":"Diary_0181","3":"Diary_0181","4":"Diary_0181","5":"Diary_0181","6":"Diary_0181","7":"Diary_0181","8":"Diary_0181","9":"Diary_0181","10":"Diary_0181","11":"Diary_0181","12":"Diary_0181","13":"Diary_0181","14":"Diary_0181","15":"Diary_0181","16":"Diary_0181","17":"Diary_0181","18":"Diary_0181","19":"Diary_0181","20":"Diary_0181","21":"Diary_0181","22":"Diary_0181","23":"Diary_0181","24":"Diary_0181","25":"Diary_0181","26":"Diary_0181","27":"Diary_0181","28":"Diary_0181","29":"Diary_0181","30":"Diary_0181","31":"Diary_0181","32":"Diary_0181","33":"Diary_0181","34":"Diary_0181","35":"Diary_0181","36":"Diary_0181","37":"Diary_0181","38":"Diary_0181","39":"Diary_0181","40":"Diary_0181","41":"Diary_0181","42":"Diary_0181","43":"Diary_0181","44":"Diary_0181","45":"Diary_0181","46":"Diary_0181","47":"Diary_0181","48":"Diary_0181","49":"Diary_0181","50":"Diary_0181","51":"Diary_0181","52":"Diary_0181","53":"Diary_0181","54":"Diary_0181","55":"Diary_0181","56":"Diary_0181","57":"Diary_0181","58":"Diary_0181","59":"Diary_0181","60":"Diary_0181","61":"Diary_0181","62":"Diary_0181","63":"Diary_0181","64":"Diary_0181","65":"Diary_0181","66":"Diary_0181","67":"Diary_0181","68":"Diary_0181","69":"Diary_0181","70":"Diary_0181","71":"Diary_0181","72":"Diary_0181","73":"Diary_0181","74":"Diary_0181","75":"Diary_0181","76":"Diary_0181","77":"Diary_0181","78":"Diary_0181","79":"Diary_0181","80":"Diary_0181","81":"Diary_0181","82":"Diary_0181","83":"Diary_0181","84":"Diary_0181","85":"Diary_0181","86":"Diary_0181","87":"Diary_0181","88":"Diary_0181","89":"Diary_0181","90":"Diary_0181","91":"Diary_0181","92":"Diary_0181","93":"Diary_0181","94":"Diary_0181","95":"Diary_0181","96":"Diary_0181","97":"Diary_0181","98":"Diary_0181","99":"Diary_0181","100":"Diary_0181","101":"Diary_0181","102":"Diary_0181","103":"Diary_0181","104":"Diary_0181","105":"Diary_0181","106":"Diary_0181","107":"Diary_0181","108":"Diary_0181","109":"Diary_0181","110":"Diary_0181","111":"Diary_0181","112":"Diary_0181","113":"Diary_0181","114":"Diary_0181","115":"Diary_0181","116":"Diary_0181","117":"Diary_0181","118":"Diary_0181","119":"Diary_0181","120":"Diary_0181","121":"Diary_0181","122":"Diary_0181","123":"Diary_0181","124":"Diary_0181","125":"Diary_0181","126":"Diary_0181","127":"Diary_0181","128":"Diary_0181","129":"Diary_0181","130":"Diary_0181","131":"Diary_0181","132":"Diary_0181","133":"Diary_0181","134":"Diary_0181","135":"Diary_0181","136":"Diary_0181","137":"Diary_0181","138":"Diary_0181","139":"Diary_0181","140":"Diary_0181","141":"Diary_0181","142":"Diary_0181","143":"Diary_0181","144":"Diary_0181","145":"Diary_0181","146":"Diary_0181","147":"Diary_0181","148":"Diary_0181","149":"Diary_0181","150":"Diary_0181","151":"Diary_0181","152":"Diary_0181","153":"Diary_0181","154":"Diary_0181","155":"Diary_0181","156":"Diary_0181","157":"Diary_0181","158":"Diary_0181","159":"Diary_0181","160":"Diary_0181","161":"Diary_0181","162":"Diary_0181","163":"Diary_0181","164":"Diary_0181","165":"Diary_0181","166":"Diary_0181","167":"Diary_0181","168":"Diary_0181","169":"Diary_0181","170":"Diary_0181","171":"Diary_0181","172":"Diary_0181","173":"Diary_0181","174":"Diary_0181","175":"Diary_0181","176":"Diary_0181","177":"Diary_0181","178":"Diary_0181","179":"Diary_0181","180":"Diary_0181","181":"Diary_0181","182":"Diary_0181","183":"Diary_0181","184":"Diary_0181","185":"Diary_0181","186":"Diary_0181","187":"Diary_0181","188":"Diary_0181","189":"Diary_0181","190":"Diary_0181","191":"Diary_0181","192":"Diary_0181","193":"Diary_0181","194":"Diary_0181","195":"Diary_0181","196":"Diary_0181","197":"Diary_0181","198":"Diary_0181","199":"Diary_0181","200":"Diary_0181","201":"Diary_0181","202":"Diary_0181","203":"Diary_0181","204":"Diary_0181","205":"Diary_0181","206":"Diary_0181","207":"Diary_0181","208":"Diary_0181","209":"Diary_0181","210":"Diary_0181","211":"Diary_0181","212":"Diary_0181","213":"Diary_0181","214":"Diary_0181","215":"Diary_0181","216":"Diary_0181","217":"Diary_0181","218":"Diary_0181","219":"Diary_0181","220":"Diary_0181","221":"Diary_0181","222":"Diary_0181","223":"Diary_0181","224":"Diary_0181","225":"Diary_0181","226":"Diary_0181","227":"Diary_0181","228":"Diary_0181","229":"Diary_0181","230":"Diary_0181","231":"Diary_0181","232":"Diary_0181","233":"Diary_0181","234":"Diary_0181"},"Date":{"0":"unknown","1":1321.0,"2":1322.0,"3":1323.0,"4":1324.0,"5":1325.0,"6":1326.0,"7":1327.0,"8":1328.0,"9":1329.0,"10":1330.0,"11":1331.0,"12":1332.0,"13":1333.0,"14":1334.0,"15":1335.0,"16":1336.0,"17":1337.0,"18":1338.0,"19":1339.0,"20":1340.0,"21":1341.0,"22":1342.0,"23":1343.0,"24":1344.0,"25":1345.0,"26":1349.0,"27":1351.0,"28":1352.0,"29":1353.0,"30":1354.0,"31":1355.0,"32":1356.0,"33":1357.0,"34":1358.0,"35":1359.0,"36":1360.0,"37":1361.0,"38":1362.0,"39":1363.0,"40":1364.0,"41":1365.0,"42":1366.0,"43":1367.0,"44":1368.0,"45":1373.0,"46":1374.0,"47":1375.0,"48":1376.0,"49":1377.0,"50":1378.0,"51":1379.0,"52":1380.0,"53":1381.0,"54":1382.0,"55":1383.0,"56":1384.0,"57":1385.0,"58":1386.0,"59":1387.0,"60":1388.0,"61":1389.0,"62":1390.0,"63":1391.0,"64":1392.0,"65":1393.0,"66":1395.0,"67":1396.0,"68":1397.0,"69":1398.0,"70":1399.0,"71":1400.0,"72":1401.0,"73":1402.0,"74":1403.0,"75":1404.0,"76":1405.0,"77":1406.0,"78":1407.0,"79":1408.0,"80":1409.0,"81":1410.0,"82":1411.0,"83":1412.0,"84":1413.0,"85":1414.0,"86":1415.0,"87":1416.0,"88":1417.0,"89":1418.0,"90":1419.0,"91":1420.0,"92":1421.0,"93":1422.0,"94":1423.0,"95":1424.0,"96":1425.0,"97":1426.0,"98":1427.0,"99":1428.0,"100":1429.0,"101":1430.0,"102":1431.0,"103":1432.0,"104":1433.0,"105":1434.0,"106":1435.0,"107":1436.0,"108":1437.0,"109":1438.0,"110":1439.0,"111":1440.0,"112":1441.0,"113":1442.0,"114":1443.0,"115":1444.0,"116":1445.0,"117":1446.0,"118":1447.0,"119":1448.0,"120":1449.0,"121":1450.0,"122":1451.0,"123":1452.0,"124":1453.0,"125":1454.0,"126":1455.0,"127":1456.0,"128":1457.0,"129":1458.0,"130":1460.0,"131":1461.0,"132":1462.0,"133":1463.0,"134":1464.0,"135":1466.0,"136":1467.0,"137":1468.0,"138":1469.0,"139":1470.0,"140":1471.0,"141":1472.0,"142":1473.0,"143":1474.0,"144":1475.0,"145":1476.0,"146":1477.0,"147":1478.0,"148":1479.0,"149":1480.0,"150":1481.0,"151":1482.0,"152":1483.0,"153":1484.0,"154":1485.0,"155":1486.0,"156":1487.0,"157":1488.0,"158":1489.0,"159":1490.0,"160":1491.0,"161":1492.0,"162":1493.0,"163":1494.0,"164":1495.0,"165":1496.0,"166":1497.0,"167":1498.0,"168":1499.0,"169":1500.0,"170":1501.0,"171":1502.0,"172":1503.0,"173":1504.0,"174":1505.0,"175":1506.0,"176":1507.0,"177":1508.0,"178":1509.0,"179":1510.0,"180":1511.0,"181":1512.0,"182":1513.0,"183":1514.0,"184":1515.0,"185":1516.0,"186":1517.0,"187":1518.0,"188":1519.0,"189":1520.0,"190":1521.0,"191":1522.0,"192":1523.0,"193":1524.0,"194":1525.0,"195":1526.0,"196":1527.0,"197":1528.0,"198":1529.0,"199":1530.0,"200":1531.0,"201":1532.0,"202":1533.0,"203":1534.0,"204":1535.0,"205":1536.0,"206":1537.0,"207":1538.0,"208":1539.0,"209":1540.0,"210":1541.0,"211":1542.0,"212":1543.0,"213":1544.0,"214":1545.0,"215":1546.0,"216":1547.0,"217":1550.0,"218":1551.0,"219":1552.0,"220":1553.0,"221":1554.0,"222":1555.0,"223":1556.0,"224":1557.0,"225":1558.0,"226":1559.0,"227":1560.0,"228":1561.0,"229":1562.0,"230":1563.0,"231":1564.0,"232":1565.0,"233":1566.0,"234":1567.0},"Entry":{"0":"\n\n","1":"\n\nGuns (4) left here at 2. A:M. to get into position. No teams back yet, now 7-15. A:M. Twenty casualties in our trench mortar Bty. Horses and wagons strewn about the roads, A bit lively in this quarter. OUDERDOM out of bounds, shelled daily. We are about 1 mile behind our old wagon line. Doctor Aspenall killed, a fine fellow one of the best. Six men killed and 10 wounded in our Brigade Hot shop this. An army order yesterday, read, 18 lb and 4.5 Howitzers, can be drawn from Ordnance on demand. Shelling Ouderdom. Hun aeroplanes over. Sgt Ward. Hospital, shell shock. Bdr Thompson, limber gunner hit on knee and arm. Medical orderly shot through jaw. Two guns going to Bty. 2.A.M. Two guns first Bty, and two guns 101st Bty blown out. The doctor was killed whilst attending to a wounded Sgt 101st Bty, he was also killed. Vance gone to Bty, to take charge of A Sub gun\n\n21-7-1917 \n\nThe Doctor and boys that were killed yesterday, are being buried near Poperinghe. Ememy shelling all around us. Hundreds of aeroplanes about . A few Huns over. Big stunt coming off shortly. 35,000 tons of ammunition sent to firing line on light railway last week. 21 casualties in 3rd Bty. One officer killed and one wounded. One gun turned clean over. 9 horses killed and missing. The B.H.Q. going up tonight. Time shrapnel flying about, Bombardment lasting all night. Tonight it started at 8-30\n\n22-7-1917\n\nThree more casualties in 1st Bty. Ouderdom again shelled. An Officers billet blown up and set on fire. Some smoke shell signals over, the first I have seen. Terrific cloud of smoke, hang about for minutes. Numerous enemy planes over. Rumoured that the 1st Bty is coming out\n","2":"\n\nFine day. Aeroplanes (enemy) over several times during the night. Dropped some\t\n\nbombs, and used his machine gun, Our search lights picked him up , the anti air craft guns opened fire on him. Hot time at Bty last night; Huns put a barage on Bty. Our wagons leave here at 12 midnight to go to guns, and get back at 7. A.M. A team of Tommy horses and drivers blown out, hit with a 9.2 shell. This happened near our Bty on road. Fitter Corp Roberts wounded, Major Dodd 2nd Brigade seriously wounded. The M. O. ","3":" Bde killed. Large quantity of ammunition going forward on light railway. Mostly all large stuff 12 inch Howitzer, weighing 741 to 746 lbs.\n","4":"\n\nFine but dull. Artillery active all day and night, Two days reserve rations sent to guns, Lot of smoke hanging about. The","5":" Section D.A.C. lost 9 wagons. Sent teams up last night to try to recover them . Stuck up for horse shoes, none on hand, Talking to S.M. Taylor, down in wagon , wounded in leg. Corp Smith and Sapper Orange both of BHQ \n\nkilled\n","6":"\n\nRaining, The railways both heavy and light very busy. Tons of ammunition coming through. Drawing a number of canv-as back, ready for an advance. All ammunition to be packed from old to new position.\n","7":"\n\nRumoured that we move wagon line forward in a day or two, up to Dickiebusche. Three miles from here. Smoke shells going to Bty. Today is fine. Still no shoes. Horse Master amongst our horses. Last night was the first night since we have been in action, that gas shells were not used. Huns evacuated their first line, fell back to their second, 150 prisoners captured, got the wind up the mongerels. Our baloons and planes up in hundreds. This village very seldom get shelled, my opinion is, that it is full of spies.\n","8":"\n\nFine day. Tons of ammunition going up on light railway. Great Artillery activity. Gr Marks wounded. Gas shells going to 101st Bty Twelve men relieved at Bty. Horse shoes 14 boxes recieved. Had a look at the model trenches. These are exactly the same as the enemy. They were compiled from aeroplane photographs, Every road, wood, stream, trench, redoubt and stronghold is shewn, even the contour of the country.\n","9":"\n\nHun planes over last night 10-30, dropped a number of bombs, not too far off our lines, killed 10 horses, and killed and wounded 30 Tommies. A horrible scatter. These bombs put the wind up you. Colonel Anderson down to wagon lines for a rest. New Lieut attached, Austin . One of our Sgt missing, went up to guns with rations in G.S. wagon, got into shell hole, smashed up, got rations to Bty somehow, left wagon in hole, come home, went out this morning \n\nwith driver and pair of horses. Driver and horses back, no Sgt, Galloway his name\n","10":"\n\nSgt Galloway returned, had a rough time 9.2 and 5.9 flying about. Another ration wagon lost last night, knocked off the road by a tank, pole broken. A team went up for it this evening, found it buckled up in a shell hole, the rear portion was hit by a shell. Some of our drivers had a narrow shave. One man had his tin hat punctured, another had a piece blown out of his tunic and shirt sleeve, just breaking the skin, no horses injured. The ration team, both men and horses, had gas helmets on for four hours. Hun plane over again last night, machine gun opened fire on him, dropped a bomb. Our artillery active\n","11":"\n\nLeft Rennehelst for new wagon line 10.A.M. Raining. In advanced wagon line 1-30.P.M. near Dickiebusche. 4\n\nmiles from guns. Sgt Gibson in wagon blown up by a shell, a bit shook up. An explosion in 4th Bty wagon lines, 3 killed and 1 wounded, these men were around a fire cooking eggs\n","12":"\n\nThe bombardment started at 4.A.M. Terrific. Major Olding wounded shot in head. Major Harris and Capt McDonald, both knocked out, (6th Bty). Bty advanced 1 mile. 4 of our horses wounded, and one driver (Hellyer) Sgt Muddle wounded in arm. Hundreds of wounded, both ours and German coming down on light railway. Bombardment still continues 6-30.P.M. To make matters worse, rain has set in. Heard that Lieut Simpson is killed, he was a driver in this Bty. One of the squatter family from Gunnedah. Major Byrne in charge of this Battery. Reinforcements recieved from D.A.C. A 12 inch gun on railway come up occaisonaly, and pumps a few shots in. The 102nd Howitzer smashed up. 2 guns\n\nout of action, no gunners\n","13":"\n\nStill raining, Major Olding seriously wounded. Two more of our gunners killed Gr Hargreaves and Rly Knight, both of A Sub. Vance is the No 1 of A Sub. Bdr Smyth got a few scratches on face. The guns just now are almost silent, a few isolated shots are all that can be heard. The Navy was bombarding the coast. The French also had a stunt. The gunners are coming to wagon line for a rest. The first stunt is finished. Result 300 prisoners, 8 officers and 10 machine guns The Manchesters did not gain their objectives, got cut up. The reason that we did not capture more prisoners was, we were the Pivot Division, the other divisions working on our right and left. Still raining 2-P.M. everything wet through. A horse that was reported killed arrived in lines, with an awful gash in neck just behind ears. This stunt was real Hell.\n","14":"\n\nShowery and misty all day. 5 of our guns out of action. One of our Bdr got a nasty knock. A gas shell hit one of our guns. This Bdr and a gunner were striping the gun, taking breech block, dial sights & etc away. He got the full force of this mustard gas all over him, A lot in his eyes, Almost blinding him. The gunner got a fair share also. Sgt Gibson to go to D.A.C., can’t stand the noise of the guns. Waiting for the weather to fine up\n","15":"\n\nStill wet and miserable. Capt Glendinning and Lieut Ford killed last night. The Capt was transferred to 6th Bty two days ago, he was in 3rd Bty. Ford was at one time Sgt. Up to date the 3rd Bty has lost 18 horses killed. Three more wounded last night. All Sgts and gunners, with the exception of a guard, down at wagon line. Done up properly.\n","16":"\n\nRain continues, Gun crews again in action \n\nrelieving an English Bty. B.148 Brigade A stunt on over on our right. Enemy sending a lot of shells over. Four wounded horses sent to mobile. Our mess cart lost, A lot of shoes pulled off, got caught in telephone wire & etc. This put me in mind of the Somme last winter.\n","17":"\n\nThis morning is foggy, but no rain. Huns aeroplanes over 6 at a time. Shifted my establishment, about 400 yards to a barn, just got there when a 6 inch shell landed 6 yards off. They put three close together and then switched to the right, They put in about a dozen 5.9 also. The only damage done was a length or two of light railway lifted. A bit of a stunt on, our artillery firing a great deal, Our planes busy.\n","18":"\n\nGun crews out of action, relieved Bty 1st Bty. A few shells over. One of our, B.H.Q. staff wounded, Wounded through the calf. The Huns counter attacked last night\n\nWe allowed the first wave to come over , naturally they thought our artillery were out of action. The second wave was cut to pieces. This stunt started at 8-30.P.M and lasted 11\/2 hours. Gr Sedgwick wounded. Major Olding progressing favourably, operated on yesterday. One horse wounded shot through forearm.\n","19":"\n\nFine weather, 570 rounds of ammunition going to Bty. tonight. C Sub gun is smashed up into scrap iron, hit Bty two 5.9. Gun crews going up tomorrow. Nasty shells over several times during night\n","20":"\n\nRaining. 6-30.P.M. Only two subsections going into action. A and E. Three horses mobile Vet Section. Two with mange. A terrific Hun barage put up on road, about 1,000 yards from our lines. In fact one shell did fall in 2nd Brigade lines. The stunt supposed to start tonight\n\nor tomorrow. A bit of a bombardment on our left at 9.P.M. The heavies are firing rapidly, now 7 P.M. been at it for an hour. Dozens of shoes pulled off. Scores of horses laid up, legs pulled all to pieces. Yankes in Dickiebusche, ambulance men. Our Infantry arriving today\n","21":"\n\nVary daring piece of work. An enemy aeroplane, dived on one of our baloons, firing into it with his machine gun, Instantly it caught alight. The men, an officer and a Corporal, jumped out. The men in these baloons are ordered to fasten on the paraschute before going up. A wise pre-caution as proved. The aeroplane that done the damage, had our markings on it; All this happened, almost in our lines. The men landed safely. A few minutes afterwards, our planes attacked and destroyed 5 German baloons. A fine piece of work, to see them, one after the other burst out in flames, and drop to the ground. Gun crews in wagon line again \n\nThe stunt did not come off. Major Kingsmill killed; He was in a dugout; Two of our drivers wounded. Thompson and Morris. The latter slightly. Two horses also wounded. Bomb dropping, by the enemy last night, and at 4 oclock this morning. In the morning stunt, 20 dropped rather close to our lines. Beautiful and moonlight. No damage done to us, but other camps suffered heavy casualties A few 8 inch shells over this evening, one landed between two lines of wagons, tearing the roadway up. General Coxon and staff inspecting horses and camp. 4-30.P.M.\n","22":"\n\nC. Sub gunners blown out. The No1. Sgt Todd slightly wounded in leg and elbow. Gr Mc Leod blown to atoms, one of his hands was found yards away, his intestines 100 yards away. Seven in all wounded. W.O. Fitter Barlow wounded. The Infantry gained their objective, easily last night, in fact they said, that they could have gone miles further. A few shells flying about\n\nShoeing Smith Hooper returned from leave\n\n11-8-1917\n\nHun aeroplanes over during the night; Dropping bombs. I counted 30, Some distance from us. Gun crews again gone to Bty. Showery. Another stunt coming off. Infantry going up to the line all day. Saw one of our planes bring down a Hun, smart piece of work, fell about 400 yards in front of our guns. Hundreds of our planes about.\n\n12-8-1917\n\nThunderstorm, this evening, Another baloon of our brought down in flames; Twice this baloon was attacked by the same plane; Our men (2) landed well. Two Hun planes brought done by our men. My shop shelled, working in a place like a barn, cow-shed, pig pens, and stable combined, Three shots missed, the fourth a direct hit, what a mess, tiles, bricks, and timber flying in all directions, boxes of shoes buried. The Brigade Head Quarters cook house filled with dirt. Our B.H.Q camped here, I managed to get out of the wreckage with- out harm. Two or three bruises. Packing\n\nammunition. 3,000 rounds to be at guns tomorrow; The D.A.C assisting us, one of their men wounded, both of his mules killed. Drivers on the same job last night; One horse killed and one lost, One man shell shock, another fractured ankle. One horse blown off road, landed in a shell hole, rescued by B. H. Q later, none the worse for his adventure. A big stunt coming off. The Scottish regiments here. Sgt Crane wounded in arm. Fourth Sgt wounded in this position. Saw some shells land in a horse line, scattering horses in all directions. These shells are 8 inch high explosives. Gun positions quiet, first time since coming to this position\n\n13-9-1917\n\nThree horses killed, and one lost, last night taking ammunition to Bty. One gunner wounded; Scores of shoes torn off. Two drivers shell shock. Our Bty relieves the 3rd tonight, they go from our gun position, where we only have 3 guns, and take over the 3rd as a whole Bty. A 12 inch gun on the \n\nrailway, come up occasionaly and fires a few rounds. Her target is a German concentration camp. The Huns try hard to get her. Range 8 miles.\n\n14-8-1917 In action East of Zillebecke\n\nSgt Gibson to 2nd Sect. D.A.C. The enemy made a raid on our baloons, brought one down in flames. Seven men jumped out of others. The day was cloudy. A squadron of 6 or 7 machines, dived on our baloons, men and Paraschutes, everywhere; Some landing on trees, some in water holes; All landed in their own lines. New canisters issued for gas helmets, an improved idea. Another Sgt from DAC attached to Bty, to replace Sgt Gibson. Three of our original drivers back, also a man that was reported dead (Piccles) Some of these men away 14 months.\n\n15-8-1917\n\nRaid Bty hostile aeroplanes. 7 in all. Dropped bombs on our Brigade wagon lines , and also on the 2nd Bde. commiting awful slaughter. 7 of our horses in B subsection were killed, and\n\nsix wounded, and were destroyed. A long time since I saw horses mutilated so badly. One in particular, had near hind foot blown off at upper pastern, And intestines hanging on the ground. Some of the nails in shoe on off foot were almost blown out. My horse, poor old Dixie, was killed, shot through the lungs. The old chap died game, I had him almost three years. He was the right sort, I feel as if I lost a friend. One man Roberts wounded in both legs. One man in 1st Bty, which is just opposite had his brains blown out, another in same Bty wounded in arm. On the road about 150 yard from us, a working party had 12 killed and 25 wounded, and 40 horses killed. One of our battle planes tackled 4 Huns, holding them until assistence arrived, his plane was shot to pieces, he was compelled to land. Landed on top of a marque tent at dressing station, killing three of the occupants. The airman when picked up was unconcious. Only one hostile machine brought down. During the raid one man\n\nin","23":" Bty had his leg blown off. The time of this raid was 3.30.P.M. Another man just returned from the Battery wounded, taking up rations. Three new guns arrived, to go to position as soon as possible\n","24":"\n\n8 horses sent to Vet Mobile section. 5 gunners killed. Bdr Gibson, Sampson, Brady, May, and Ross. and three men wounded. Sgts Forpey Galloway","25":" time) and Bdr Sharrett. A big stunt on starting at 1. AM. Finished at 10.A.M Some wood keeping us back. German planes overhead. Put the wind up our men. A lot of wounded coming down on light railway. Another horse killed, taking up rations.\n","26":"\n\nBty coming out of action tonight. Sgt Flett slightly wounded. Lot of Hun prisoners passed here. Enemy planes over, flying very high. Firing time A. X at our baloons, knocking some of the tiles off the remaining portion of my shop. One of the men that landed from a baloon, fell into water and was drowned, got tangled in the weeds \n\nVery exciting night, dozens of hostile aircraft about. Counted 30 bombs dropped. Bty out of action safely. In this stunt, the two Brigades lost 39 officers. Col Anderson inspecting lines and horses. Pleased with condition of things.\n","27":"\n\nBeautiful fine day. Hun aircraft shot down by an anti air craft gun. This is only two that I have seen shot down, by these guns. Heavy artillery shooting a great deal. Generals Walker and Coxon, inspecting lines, stopped 10 minutes\n","28":"\n\nAnother hostile aeroplane brought down in flames The pilot was burned to death, and the observer killed. Real Hell last night enemy raiding party over. A lot of damage done. General Coxon’s two horses killed by bombs; One of our men (Welsh) wounded in arm. Some bombs fell amongst the D.A.C mules and horses, killing a number. Early this morning 4 oclock, about 50 shells fell around our wagon line. One bomb fell on Hospital, another on ammunition dump.\n","29":"\n\nFine day. Plenty of 5.9 time shrapnel fired at our baloons. Men jumping out. Enemy aeroplanes busy. Taubes over during the night, got a warm reception with machine guns, and anti air guns. Another gun blown out, leaving us with only one gun\n","30":"\n\nA very successful stunt started at 5.A.M. The heavies were at it all night. The 18 pdrs started at 5.A.M, and eased off at 7.A.M. starting again at 7-30.A.M. The heavies still firing at 7.P.M. Just witnessed a fine aeiral victory. 4 Hun planes over our lines, The anti opened up on them, they turned, and run into a fleet of ours, who promptly brought down two. A beautiful dive was made by one of our machines The other two got away our planes after them, too much speed for our planes. Shelling around our camp, this morning. Moving camp, left section go this evening, remainder tomorrow, 300 yards away. Shod 2 horses for Col Winters. Some pot in charge of a heavy group. Friend\n\nof our Capt. Wilkinson\n","31":"\n\nCamp all moved, Showery all day. One of our planes brought down by Hun gun fire. The last stunt went well 4,000 prisoners, and an advance of 2000 yards; only one of our guns in action. Fitter Staff Sgt Cross wounded in shoulder with a piece of A.X. Our Bty fitter (Gyson) a Swiss, taking his place. A trumpeter reported to Bty for duty\n\n24-8-1917\n\nCompleted three years active service. Nasty day, windy and showery. Bty in action. 1st Bty come to wagon line, down one hour, and then sent back. Things quiter than usual; Six reinforcements from 3rd division arrived, all drivers. Only one fitter Sgt left in Brigade. Sgt Ford and two men killed at 3rd Bty this morning.\n","32":"\n","33":" hostile aeroplanes dropped bombs. Four about our place. They got amongst our ammunition party, wounding 2 men and\n\none horse. Huns trying to shoot down one of our baloons. Firing 9.2 inch time shrapnel, one piece weighing about 28 pounds, landed in a dugout, no one there, the driver on duty. 10 horses and 12 mules taken on strength. Horses scarce filling up with mules.\n","34":"\n\nAnother bombing raid at 12-45.A.M and 3.A.M. Killing a number of men in a camp at rear of our lines; Battery getting shelled . Weather cloudy, starting to rain. Enemy shelling heavily; Most of the projectiles dropped last night were aerial torpedoes, making an enormous hole\n\n27-81917\n\nRaining all night and all day. Rather cold. Enemy shelling the Dickiebusche road. Lost one horse in shell hole, last night; Branded the mules and shod one; Some real beauties, slippery as eels. Two of our gun pits blown out yesterday. No men or guns hurt. The big guns bombarding. Shoeing smith Forsythe just recieved a letter, saying his\n\nmother was dead. Our second Blighty leave list out, expect to go in a day or two.\n","35":"\n\nBlowing a gale all day. Showery on and off. 7-45.P.M. now calm and fine. 3rd Bty knocked about a bit, 8 horses killed and 2 men wounded 2.A.M. Nothing doing weather too rough. Farrier of third Bty and Q M Sgt of","36":" Bty gone on leave to England\n","37":"\n\nShowery and cold, I am supposed to go on leave tonight, Front quiet\n","38":"\n\nCloudy, an ammunition party belonging to us, cut up. One man Baldwin blown to atoms, both horses missing, another horse had a leg blown off, another with a great wound in thigh. Drivers coming back in two and threes. Should have gone on leave today, but wire recieved, Channel blocked, owing to rough sea. The man killed was with us only three days\n","39":"\n\nLeft camp at 2.P.M on leave. Arrived at POPERINGHE. 5.P.M. Just as we , (The QM Sgt, a Corp and myself) left camp a raiding party of Huns, dropped bombs on road. A little further on he started to shell an ammunition dump; Got through safely.\n","40":"\n\nArrived A Calias 9.A.M. Marched to No 2 rest camp. About two miles. Likely to move tomorrow\n","41":"\n\nAfter a lot of messing about, left camp at 10-30.A.M. Arrived in London 5.P.M\n","42":"\n\nLeft London for Edinburgh at 10-50.P.M. Arrived at 8.A.M. Staying at QM Sgt Hunters place. Very quiet city, feeling the stress of war\n","43":"\n\nDuring the days between the","44":" and","45":" we visited the Eastern coast villages of Scotland. Stopped a few days at East Wemys, a coal mining village. Left Edinburgh at 9-45.P.M. arrived in London 7-45.A.M\n","46":"\n\nAll day in London\n","47":"\n\nLeft London at 8.30.A.M. Arrived at Dover 11.A.M. Move off to go on board the boat at 3-30.P.M. Landed at Calias and in rest camp 7.P.M.\n","48":"\n\nArrived in camp, 2 miles outside St. Omer at 4.P.M.\n\n14-9-1917 CLAIRMARIAS,WOOD\n\nInspection of 1st and 2nd Brigades by General Jacobs; Commanding","49":" Army. Loud in his praise of the Australian Artillery.\n","50":"\n\nBeautiful weather. Col. Anderson inspecting our horses. General Birdwood to inspect tomorrow. Things quiet. Some of our Australian airmen flying about here\n","51":"\n\nInspection by General Birdwood at 12-30.P.M. Sgt G Todd recieved his M.M.\n\n17-9-1917\n\nLike a change in the weather; A new routine\n\nin Battery now. The Sgt Major, Vet Sgt and myself, to go through the lines and inspect the horses with the Major every midday stable hour. Major Byrne is a thorough gentleman. Capt Lucas V.O. back from leave, Capt Patterson V.O. 2nd Brigade was doing the","52":" Bde also,\n","53":"\n\nShowery. Col Anderson on leave. Nothing doing only the usual stable routine, and gun drill\n","54":"\n\nFine day, half holiday. Cricket match against the A.S.C, at a village named ARQUES. We are camped in a wood, Oak and Silver beech. In ordinary times it is a game preserve; Tonight we have to supply 5 mounted men, to scour the woods, and try and find out who is shooting the pheasents. The other day I had to go to a farm where BH Q are camped and dress an entires feet; real mongrel, supposed to be a racer,\n","55":"\n\nRaining last night. Shoeing smith Forsythe returned from leave. Some of our men over-staying leave, one in particular, fined 28 days pay. Had a field day amongst the mules, some quiet, some not.\n","56":"\n\nFine weather continues. Saddler Sgt. and Sgt Flett gone on leave. Our Infantry done well on the Ypres sector yesterday.\n","57":"\n\nA little driving drill for the new hands\n","58":"\n\nThis evening half holiday. The morning was taken up with Church parade. We could hear a big bombardment all night. The nights and mornings are getting chilly. This is the quietest rest we ever had. Major Byrne on leave\n","59":"\n\nOur officers turned out of their billet. The C.R.A. and staff coming there. I suppose we will see a lot of them now.\n\nEnemy plane over, Anti’s shooting at him Weather fine\n","60":"\n\nGeneral Coxon and Staff also Col Watson, ADVS inspecting our lines; The usual complaints, horses not sufficiently groomed, harness not clean\n","61":"\n\n2nd Brigade sports on this evening. Half holiday. Col Johnstone taking Coxon’s place as.C.R.A A few decorations awards out , Sgt Flett M.M. Sgt Todd, bar to M.M. Bdr Cullen, Gr Roper, Gr Anderson, and Gr Jennings M.M. No drivers mentioned, not because they did not deserve it. Some done excellent work. No one to recommend them.\n","62":"\n\nNothing doing. Btys of other Brigade on Bty manoeuvre\n","63":"\n\nMarching orders recieved. Move off tomorrow morning, straight into action. All hurry and confusion. A party out after remounts\n\nwent away on the 26th, expected back tomorrow. Went out with a party to dinner in ARQUES. Had a good feed, poultry, vegetables and fruit. Cost 10 francs per head\n","64":"\n\nLeft Clairmarias at 9-30.A.M. arrived at OUDEZEELE at 2.P.M. Great row, the owner got us put out of his field, said that our horses were eating his grass; The rotter. Nice people to fight for,\n","65":"\n\nReveille, 2-30.A.M. Move at 5.A.M. Arrived at DICKIEBUSCHE, our old position at 12 noon. Beautiful weather.\n","66":"\n\nWent into action last night. Terrible smash up. Sgt Hanson killed. He was holding two horses, they were also killed. He was hit in right eye, and a piece went through his arm and body. He died instantly. Corp Landon wounded in leg. Another horse hit, died in wagon line. Two more horses wounded. Bombing raids by enemy, never to be forgotten\n\nstarting at 8.P.M. and ending at 5AM. Scores of aeroplanes over, wave after wave, trying to wipe us off the earth; Dropped easily 200 bombs. We moved wagon line. Passed a camp of 5 Division pioneers, 10 killed and 40 wounded, three bombs fell in their camp. A Major and Lieut, of the 13th light Horse killed also 15 horses. Our Infantry in the line. This is the first time, all of our Artillery has been in action together. Another horse killed and 2 wounded carting ammunition. Sgt Hanson burried in Dickiebusch cemetary \n","67":"\n\nMore bombs last night. Bty opened fire yesterday. 19 remounts recieved today, a fair sample. Busy carting ammunition. The road is chocked with our Infantry transport. Horses now in Bty 127 and 15 mules\n","68":"\n\nEnemy dropping bombs during the night. Sgt Nelson and Bdr Lane wounded. One gun blown out last night, and another this morning. Raining last night. Today is dull.\n\nA big stunt likely to start in the morning\n","69":" PASSCHENDAELE\n\nTerrible day, wind, rain and cold. The hop over by our 2nd Division was very successful. Mowed the Germans down like straw. Hundreds of prisoners, including some big pot officer. A train of wounded 6 trucks, 3 of our and 3 of theirs. Sgt Muddle again wounded, this is his third time. Gr Bundy, Gr Hook, drivers Irvine and Otoole, wounded last night, the latter remained on duty. 3,000 rounds of ammunition taken to Bty last night\n","70":"\n\nOne man killed, driver Andrews, and one wounded, driver Tonkin, had his foot blown off. Four horses killed, one of the four was an original named lion. Corp Jeffrie and Gunner Driver wounded. Sgt Flett and Saddler Sgt Buckler returned from leave. Saw 2 planes come down, dont know whoes they were. 9 remounts recieved. 7-30.P.M.\n","71":"\n\nWet, cold, and miserable. The bombardment\n\non our left continues. The aeroplanes I saw falling last night were ours. Several casualties in Battery. Gunner Price killed. Corp Ansell and the A.M.C. orderly wounded. A section of our Bty was to advance, shell fire too hot 10 inch and 14 inch dropping on the road. 8 direct hits on road, which is all torn up. Our planes over in scores. One horse wounded. 12 tanks moving forward, they travel about as fast as a man can walk\n","72":"\n\nWet and miserable, real Hell. two planes down, one run out of petrol, and the other pilot wounded. Bty advancing, guns bogged, horses shot and lost, men killed and wounded. Sgts and men down at wagon line; Dirty, wet and lousy. Fitter Corp Elphick killed. Brother of my shoeing smith Corp.\n","73":"\n\nFine but cloudy, Sgts and gunners gone to Bty. New position. The Hospital at St Omer bombed. Three nurces killed. Driver Leathes and two horses wounded\n\nAnother horse killed. 6-30. P.M. raining\n","74":"\n\nTerrific gale lasting all night. Two large trees uprooted near our lines. In fact our officers had a tent near these trees, fortunately the tree fell in the opposite direction. Could not advance with our guns, ground too boggy. Liuet Black wounded seriously. W.O. Hendly granted a commission in the field. Engineers erecting elephant hut in our lines. A big stunt on our left, good work done, over 1,000 prisoners, also the last ridge, we now have the Huns out of their last line of defence and on to a plain. Hundreds of our plane over, Horses feeling the cold, 4 more sent to Mobile\n","75":"\n\nStill wet, Sgt Muddle died from wounds recieved in action. One of the best. A married man with one child. Only the other day he showed me a letter from his son, saying how well he was getting on at school. 7 or 8 years old. Hun aeroplanes over this morning\n\nat 2 oclock dropped dozens of bombs. An enemy plane over at 5.P.M. Had a try for our camp, but missed it\n","76":"\n\nFine day. A few shells flying about. Hun planes over again, went through the sam performance as last evening, dropped 3 bombs. A new C.O. Colonel Dean. Col Anderson is now C.R.A. Gunner Allen wounded at gun position. Bty Sgt Major Fitzsimmons to go to B.H,Q as first class W.O. Bombardment going apace on our left.\n","77":"\n\nRaining almost all day. Terribly muddy Brother and detachment down for a rest. Only two guns in action. 8 casualties in Bty yesterday. Eleven killed and 4 wounded in the 4th Bty yesterday.\n","78":"\n\nAgain wet and windy. Terrific hail storm this morning. Very quiet on our front\n","79":"\n\nFine but cloudy. Great aerial activity by the Huns, Gotha aeroplanes over 7-and 8 at a time. Twice they tried to get right over. One of our baloons down in flames. A stunt on, on our left. Sgt Flett down for a rest. Great growling in wagon line, gum boots in store, not issued, men up to their necks in mud, and wet feet continualy\n","80":"\n\nFrosty morning, beautiful day. Hun planes over last night, dropped a cart load of bombs. Hun plane brought down by antiair craft guns. Brother going to Bty this evening.\n","81":"\n\nRaiders again over, missed our lines by inches. Some went over to Popringhe. Killed hundreds. Dropped a bomb on church army hut. Raining tonight, Enemy used gas shells yesterday. 11 casualties in 1st Bty. More remounts coming in\/tonight. One horse mobile, nasty gash in hock. Driver Tonkins who was wounded lately, is getting on well, his foot was amputated; he worked in shop\n\nwith me at one time\n","82":" 11.30 A.M\n\nWeather fine. I witnessed a most fearful sight this day. 5 Hun aeroplanes over, up a terrible height, a squadron of ours attack them, bringing down three. The first brought down caught on fire, when about half way down, and one of the occupants fell out, and crashed to earth. Some of our boys carried him away on a sheet of iron, just a mass of pulp. I believe he was a Captain. The other man was burried under the machine. Our airmen says it was a new type of machine. The man who brought this plane down, landed to get particulars, when he went to start again, his machine nose dived and broke a propeller blade. We had to mount a guard on it. Six gunners down from Bty gassed. The 3rd Bty, only 5 gnr in action, the rest got gassed. Major Thompson seriously wounded, arm off, one of our gunners went to his assistance, he also was wounded.\n\nSgt Flett and Corp Redshaw gone to Bty. 14 remounts recieved. Capt Segraves gone to Bty. Major coming down\n","83":"\n\nFine day, Major Byrne in wagon line. Enemy aeroplanes over in scores, dropped bombs on gun position and roads. Carting ammunition to Bty. Likely to advance tomorrow; A bit of a stunt on this morning at 2 oclock. Started again 5 P.M. Four Gr reinforcements arrived\n","84":"\n\nRain in torrents this evening. Hun planes over last night, dropped aerial torpedoes about BHQ, and on the roads. Played havoc with troops on the road, dropped bombs on them, men lying dead and wounded everywhere. A big stunt on just now 6.P.M.\n","85":"\n\n20 pairs of packs sent to gun position, with ammunition, also one 8 horse team to move guns forward. Shelling like hell. 10 and 11. 5.9 inch coming over at a time. Gun\n\nposition blown out; One gun blown up. Driver Cahill seriously wounded, arm blown off at the shoulder. Three horses and one mule killed. 2 Gunners wounded. This morning he dropped bombs on road and gun position. Canadians coming to our assis-tance. The Battery almost done, no men; Casualties heavy. Hun plane over last evening, another over this morning, flying about 200 feet high.\n","86":"\n\nWeather frosty in morning, but fine during the day. Last night shells flying about; Eearly this morning enemy aeroplane over, dropped bombs just behind our lines. Killed 3 men, also 4 horses, and wounded 3. In the early part of the night I counted 30 bombs dropped. A 5.30 A.M. another Hun over, he also dropped 4 bombs. 20 pairs of packs, ammunition to Bty, one horse killed\n","87":"\n\nFine day. Hun aeroplanes over, A new Sgt Major arrives.\n","88":"\n\nRaining almost all night. More bombs dropped in the early part of the night. Ammunition packs to Bty. Terrific bombardment on, S.S. Corp Elphick on leave. The 2nd Section D.A.C is 50 men and 105 mules below establishment. Mud getting worse.\n","89":"\n\nAll hands down from guns; The medicial orderly wounded. A lot of promotion in Bty. Weather wet\n","90":"\n\nTaking over another Btys position. Sgt and gun detachments left this morning at 9 oclock. Terrible rough night, blowing a gale and raining. Today is windy. Another officer, here, Lieut Irwin. Major Byrn gone to hospital slight wound on hand, also gassed\n","91":"\n\nWet cold and miserable. A big stunt on last night. Our stunt is put off untill the 1-11-17. Mud getting worse, The fore part of the night was beautiful bright moonlight,\n\nand calm. Hun aeroplanes over in dozen’s, dropping bombs, all around our camp. A fine sight to see one of the planes in the search-light, they shine like silver. Then our anti air craft opens up, also machine guns. They generally drop their load, and make off. They carry between 8 and 10 bombs\n","92":"\n\nFine day. A few time shrapnels flying about. A fleet of Gothas coming over, some of our baloons empty out.\n","93":"\n\nWhite frost, foggy all day. Terrific bombing raid by Huns; Building an elephant hut for Sgts mess; A big stunt on all night. Canadians attacking. Our Sgt Majors name is Crittenden from D.A.C. Vet Officer was telling me that the 101st Bty had 20 horses on their lines that the farriers could not shoe. Bad feet caused by faulty shoeing\n","94":"\n\nNumerous enemy planes over. Another bombing raid, last night. I am writing this\n\nin the elephant hut we built yesterday\n","95":"\n\nDirty, wet, cold, and windy. Full moon, terrific Hun air raid, all last night. Bombs dropping all around us. Although windy, the night was clear. Vance down from guns. His gun out of action. More mules coming to Bty.\n","96":"\n\nThe Hun aeroplanes night raids are getting worse. Last night was terrific. Bombs dropping in hundreds. Two more men wounded, and 2 horses lost. Our hut punctured\n","97":"\n\nLight fog; Bombing raids awful, terrific slaughter, 30 horses in one Bty killed also a number of men killed and wounded. We are still fighting for the PASSCHENDAELE ridge. The account of the Italian defeat, has cast a gloom over our troops. These bombing raids put the wind up a man. The vibration of the ground is terrible.\n","98":"\n\nFoggy, very light rain on and off all day. No Huns over last night. A party of men carting ammunition to Bty. One Gr wounded\n","99":"\n\nVery mild weather, Major McLaughlan gassed, not expected to live. He is OC 1st Bty. Hun plane about, lost I think, flying very low. Brought down later by machine gun fire. Weather still foggy. 16 mules arrived. Brother Vance sent to 4th Bty for the time being. A few prisoners passed this way 6.30 A.M. A bit of a stunt on. Major McLaughlan dead. Four officers chargers attached to Bty.\n","100":"\n\nStill dull weather, but fine. All men down from guns, handed over to another Bty.\n","101":"\n\nWeather still continues fine, and mild; Most of the Sgts and gunners gassed. A most peculiar effect on men, eyes all inflamed, and watering, throat sore\n\nand loss of voice, with a hacking cough. Brother back from the 4th Bty. Some rumour that the Bty is going out for a rest; Nothing known for certain. The enemy is putting over thousands of gas shells, day and night, the ground simply reeks with it, gas helmets to be worn almost day and night.\n","102":"\n\nGeneral muster parade. C.O. who is Colonel Dean, spoke a few words. He said he was very pleased with the work done; It was just about as much as the human frame could stand. He also spoke about the drivers, no praise was too great, they behaved admirable under very trying circumstances. Today the weather has changed to rain.\n","103":"\n\nStill raining. We are to get our guns out; G.S. Wagon and team left here at 2.A.M. report just recieved that wagon broke down in a shell hole, and the pioneers covered it over with mud and dirt, they are building a road over it. Hun aeroplanes over early \n\nthis morning. Move out when we get our guns out. Hundreds of prisoners coming down.\n","104":"\n\nA little rain. Hun air raids on this morning; One plane was brought down. Saw an aerial duel, between an enemy aeroplane , and one of ours, we were successful, the Hun coming down in flames. Later one of our baloons come down in flames. Trying to pull our guns out today. Got two out, three still bogged. Moving out in a day or two. A ten days treck rumoured, Gen. Anderson inspecting our lines. I am having a lot of trouble with mules, kick the eye out of you, our General is trying to get rid of them.\n","105":"\n\nMoving out tomorrow, got 5 guns out of the mud, one still stuck there. One horse wounded, died after getting to wagon line. Recieved orders to move at 5 oclock tonight. All hurry and confusion.\n","106":"\n\nLeft Dickiebusche wagon line at 11 A.M. Arrived at NEUVE EGLAISE. 4-15. P.M Weather cold and wet. We are at NAB camp. The best camp that we have ever been in; Accomodation for everyone; Good farriers shop. Too good to last long\n","107":"\n\nStill wet, Terrific shelling in this quarter. We are near MESSINES and VIMY RIDGE. Four horses to Mobile Vet Section.\n","108":"\n\nFrosty morning, Beautiful day, Colonel inspecting our horses; Likely to stay here a few days longer. 5 P.M. A big stunt on just now; Some big crumpers coming over all night, about a mile away from here, shelling roads and railways.\n","109":"\n\nAnother fine day. General Birdwood presenting Military Medal riband to men awarded them. My brother Vance was awarded his. The whole Brigade consisting of 4 Btys and BH.Q was on\n\nparade. The General spoke to every N.C.O on parade, asking every one how long he had been with the Battery. He even cracked a joke, Talking about the barage put up by the artillery. He said he was talking to an Infantry man , who said he was leaning up against the barage, and when it lifted he fell over. Extraordinary big stunt on, been going this last two hours\n","110":"\n\nTomorrow our guns go to workshops for repairs. Likely to stay in these lines one month\n","111":"\n\nFine, The enemy shelling, almost all night. A few bombs dropped early this morning. Col Dean in lines this evening Birdwood made a full General.\n","112":"\n\nA few isolated showers. General Anderson inspecting our horses. 11 remounts recieved. Terrific drum fire up in the line. We hear of a bit\n\nof an advance where we come from\n","113":"\n\nMild weather, foggy. Great rumours about our going away from here to Boulogne The front very quiet\n","114":"\n\nSunday, Brigade Church parade. C of E. Hun aeroplane over this morning, flying very low; Corp Ansell, who was wounded, is back again. He is without doubt a wonder, He knows no fear\n\n19-11-1917\n\nClasses for junior N.C.O. at Brigade Head Quarters. Shoeing Smith Corp Elphick mustered to duty Corp. 60 men below strength in Bty, no reinforcements available. Some talk of breaking up 4th Division to reinforce the","115":" Division. This all depends upon the result of the referendum. If conscription is carried, the Divisions will remain as they are. Weather dull, no rain. Things very quiet in front line.\n","116":"\n\nLast night we recieved definite orders that we \n\nremain here for some considerable time. Today we recieved orders to move out tomorrow. Make room for the 3rd Division. Big bombardment on, started early this morning. Rumoured we move to KEMMEL.\n","117":"\n\nThe Kammel stunt was cancelled. We arrived midway between DOULIEU and ESTAIRES at 4-30 P.M Cold wet and miserable. The trip, about 6 miles. In a terrible place, mud up to your knees. The 30th Bty 3rd Division took over our last lines. Camped in a hole of a place, about 16 feet long and 7 feet wide, this is accommodation for 6. Stink like a pole cat\n","118":"\n\nBattery scattered; Horses in two places., men in three billets. Officers in one billet on their own. Likely to be here some days. \n","119":"\n\nStill showery. Major Byrn, returned to Bty. Corp S.S Dunn, transferred to Bty, from 101st The officers in Bty are Major Byrn, O C. Lieut Irwin, Scrivenner, Duffy and Mulholland.\n\nVisited the village of DOULIEU last night. 10 Francs the price of horse shoeing. The cost of coal 35 Francs for 1,000 lbs. All stamped shoes, made out of old ones. Knock off work at 7.P.M.\n","120":"\n\nWeather, colder than usual, and windy. The people of this farm killed a pig, valued it at 650 Francs. It appears that all food stuff in this country, is under Government control. The owner of this farm, I am told is a millionare. He sold 64.000 Kilos of potatoes, to the military this year, The price is 14 Francs for 50 Kilos. Beans bring 160 Francs per bag. A Kilo is between 2 ¼ and 2 ½ lbs. All our guns here now. The two that were stuck in mud at ZONNEBEKE arrived last night. A per centage of leave granted to Estaires. This is our second time in this quarter. Sgt Todd gone to Officers training school. Lieut Watson, one of our old Sgts is dangerously wounded. Piece of A.X in abdomen. Capt Sexton, he was our original Sgt Major, is billeted about here. Clipping all of our horses.\n","121":"\n\nBitterly cold, sleet and wind. Very rough night. Sgt Buchannon back. Two more Sgts made, Anderson and Massey. Twenty three reinforcements arrived\n","122":"\n\nCold day. General Anderson inspecting our horses, Nothing doing\n","123":"\n\nStaff Fitter Gyson awarded the D.C.M. Major Selmer D.S.O. Both men well worthy of the decorations. A big stunt going on all day, hear the guns quite plain.\n","124":"\n\nFine day. 7 mules sent to D.A.C. Three horses in exchange. Stunt still continues\n","125":"\n\nEnemy aeroplanes flying about. Leave to Paris starting again. 4 men per day, from Brigade. Eight days leave, must have at least £10-0-0 in credit in pay book, befor leave will be granted. Great discussion about the referendum, voting take place on","126":"\n\nPro-clamation Bty Hughes posted on our billet\n","127":"\n\nWeather still mild, but misty. Hun aeroplane over this way, flying very low; appears to be lost. A most peculiar thing, when behind the firing line, the same as we are now, there is absolutely no defence, Today was an example, only two machine guns opened on this enemy plane. Capt Webb attached to Bty. Busy shoeing 11 sets per day. One horse to mobile, blind, Terrible eye disease in this country, as yet no cure, experimenting almost daily. They call it Ophthalmia\n","128":"\n\nCold and windy; Saturday, half holiday. Football match on. The Col, Horse Master, and Major in horse lines. Two guns sent to Army Corps. A Xmas card recieved from home.\n","129":"\n\nVery cold, General Anderson, accompanied Bty Col Dean, Major Heslop AD.V.S, Major Byrn OC Bty, and Capt Little, Adjutant, inspecting our horses this evening. Our horses are looking well.\n\nFrosty, very cold. 9 mules recieved from D.A.C. real culls. The Major very annoyed. General Walker expected tomorrow, great preparation, A Sgt from D.A.C. attached, Sgt Bourne.\n","130":"\n\nFirst snow this winter, very cold. Frosty morning. Hun aeroplane over this morning at 4-30. General Walker did not arrive.\n","131":"\n\nHard white frost, sunny day. Half holiday Wednesday, Great activity along the front, We can hear the guns firing. General Coxon and staff in our lines.\n","132":"\n\nFrosty morning, glorious day, Concert to-night\n","133":"\n\nA bit of a thaw set in, Weather fine, Concert last night rotten. Nothing doing, very quiet\n","134":"\n\nWet all day. Referendum voting tomorrow,\n\nRumours of a move into action\n","135":"\n\nFine, but dull. Voting took place today. Saw a derrigable baloon floating about this evening. A quantity of papers were thrown out. A few days ago the same thing happened. Proclo-mations were distributed, warning the civil population to get away, As they, the Huns were going to make a push\n","136":"\n\nCold, miserable, very muddy. Shod the Generals horses. He will be back from Paris tomorrow. Moving at the end of week.\n","137":"\n\nAttended a lecture in Delieu last night, by Capt Bliss M.C. Welsh Fusiliers on the battle of Verdun. Very interesting. A big stunt going on all night and day.\n\n13-12-1917\n\nMajor Byrn back from Paris. Enemy aeroplanes, Gothas 8, over. Killed and wounded 20 men in 2nd Division. Reports from the General, about 2nd Bty. Our Major had all\n\nSgts paraded before him today, and said that the reports from, D.A. was highly satisfac-tory, and this Battery was, without doubt, the best in Division. Col Henshaw inspector of wagon lines had no fault to find. Every-thing in good order. Our horses are looking splendid. One horse to mobile. This horse was pricked in the shoeing, shod on the","138":" This is the outcome of inexperienced shoeing smiths, Down at the school of instruction for shoeing smith, They teach men the trade in 6 weeks.\n","139":"\n\nMild weather, very light rain. Moving into action on Monday. 16 civilians killed in HAZLEBRUCK yesterday by shells.\n\n15-12-1917 Sunday\n\nVery cold frosty feeling in the air. Our Major, C.O. of 2nd Brigade temporaly. Frost taps and wrenches to be indented for, Capt Morris awarded the M.C. A letter recieved from Major Olding, and read out on parade. He is on his way to Australia,\n","140":" for 10 years, so the doctors say\n","141":"\n\nBitterly cold, Snow storm this evening. Move postponed till Tuesday. The General was trying to have Xmas out of the line. By all accounts we go in on the 20 inst. One officer and two Bty staff men advance party tomorrow. In the last 3 stunts our casualties were 140 Officers and men, that is killed, wounded and gassed\n","142":"\n\nSnowing, this morning. Very cold. Four subs A.B.C.D. move off tomorrow. Reveille 5.A.M. Move off at 8.A.M. We relieve the 50th Bty. E and F subscetions, move the following day\n","143":"\n\nMoved off at 7-45 A.M. Arrived at KEMEL. 12-15 P.M. Billeted in a Chateau. Four gun crews gone to gun position to take over 4 guns. Four subsections of the 50th Bty moved from here at 1.P.M. Left section move out tomorrow. Our left section coming in. Roads frosty and slippery, very cold.\n","144":"\n\nAgain frosty. The remaining section of 50th Bty moved off at 12-30. P.M. Our left section arrived at 12-15.P.M. Terrific bombardment over this way. Not far from MESSINES\n","145":"\n\nA most terrific frost, all day; Freezing hard. A heavy white mist hanging about. Ground as hard as flint. Frost taps and wrenches recieved. I have an excellent shop. Good stables for our horses. We Sgts are living in the basement of the chateau. Two large rooms. Our sleeping roon is about 25 feet square, containg 8 stretchers, very comfortable; This has been a beautiful building. Brick foundations, the remainder wood. Three stories high. We are in the middle of the village of KEMEL. No civilians here. This house has the appearance of a summer residence. Of course things are knocked to pieces. Our Bty position at present is quiet. Rations sent to guns at 3-30 AM. Cold trip for drivers, Avoid\n\ngoing there in day light, give the position away\n","146":"\n\nDuring the last two day 57 enemy troop trains passed this front. Expecting some big move here shortly. All horses that go out, to be frost caged. Preparations made for a Xmas dinner for the Bty; cost 300 Francs.\n","147":"\n\nA thaw has sent in. Aeroplanes busy. A beautiful day sun shining. Almost full moon. One Sgt to go to Lark Hill as instructor, a war worn man preferred.\n","148":"\n\nAgain frozen, very cold. Sgt Horan a lately promoted sgt to go to England. There were until today three officers in wagon line. Mulholland, Irwin, and (Wallace) French Mortor Bty attached for experience. Lieut Irwin is senior by a few days. Been in France only a few months. Today Lieut Wallace go to Bty, and Lieut Mulholland to a school (gas). Our gun position still\n\nquiet\n","149":"\n\nSick, in bed all day.\n","150":"\n\nStill off colour, Dogs disease.;The troops had an excellent dinner, consisting of, (turkey roast) 3 Francs 70 per lb. Peas, boiled potatoes, cabbage, and ham, also plum pudding and sauce, and one pint of beer per man\n","151":"\n\nHeavy fall of snow. Terrible wild night, About 4 m of snow; on the ground. Leather jerkins issued, Fit George Reid, Big stunt on \n","152":"\n\nEnemy planes over, dropped a few bombs. Weather mild. Snow still on ground. Great trouble with frost coggs.\n","153":"\n\nCold, and windy. Enemy aeroplanes busy. 11 drivers evacuated to hospital in four days, suffering from Dysentery. All horses, harness, rugs, and nose bags to be dipped; Mange amongst the horses.\n","154":"\n\nAnother fall of snow during the night. Enemy planes over, flying very low. Still cold. Our people are terrebly frightened that the Germans are going to break through here. Reserve gun positions, are already alloted. One Bty the 6th have 9 different positions alloted. A reserve position for one of our guns, is 900 yards behind our firing line.\n","155":"\n\nA thaw has set in again. Every N.C.O. and man to know the route to the gun position. Lieut Scrivenner here with a sprained ankle. Court Martial, one man overstaying leave, another A.M.C orderly, not reporting to a unit when ordered to do so\n","156":"\n\nA large brick Chateau burned to the ground at 3. oclock this morning. Occupied by some of our Infantry. Weather cold, freezing. All horses dipped. Never saw such a turnout. Started out without frost coggs. Stuck up on road, Horses down. Roads like glass. Working\n\nhard last week, and up to date, shoeing for frost coggs, with the result mentioned. This is the result of inferior N.C.O. Drivers do just as they like; Too tired to screw a few frost coggs into the shoes, Reported the matter to Officer.\n","157":"\n\nStarting another year, still the struggle goes on. Terrible lot of drunkeness going on in Bty. Great aerial activity. Today is fine, but still freezing.\n","158":"\n\nChange in weather, thawing, also raining. Our gun pits to be raised, two feet, to clear the crest in front. Relieving gun crews. Vet Sgt gone on Paris leave, I carry on in his absence\n","159":"\n\nLight fall of snow; Shoeing mules, dirty brutes, kick the eye out of you, use the rope freely. Still a number of our men suffering from Dysentery. At the dressing station near our lines 500 were treated yesterday\n","160":"\n\nNumerous enemy aeroplanes busy; A huge shell fired at one of our baloons, burst over our stables. Terrific report, pieces of shell all over the place. Our trumpeter was sounding a call, a piece missed him by inches; No damage done.\n","161":"\n\nCold and frosty. One horse and two mules to Mobile Vet section. Sgt Horan, back from Paris. Now recieved a pass to England. Six months instructor in Reserve Brigade Australian, Artillery. General Anderson inspecting our lines this evening\n","162":"\n\nWet and sloppy. Rumoured that we move out on the 18th inst.\n","163":"\n\nThings exceptionaly quiet, Busy shoeing, getting ready for the roads,\n","164":"\n\nVery heavy snow storm. Tonight is terrebly cold. Sgt Torpey returned, away four months, wounded, Major Byrn coming back on the 10th inst \n","165":"\n\nTerrific snow storm, inches of snow on ground. Tonight is cold and windy. General Anderson inspecting our wagon lines. A few Hun planes about. Great discussion about the British peace terms, as in the paper yesterday\n","166":"\n\nSnow all thawed, mud and slush. A number of old hands returned. At times today aeroplanes were busy. Routine orders says, As are to be worn by all men who served on the peninsula\n","167":"\n\nOne gun out of action, sent to workshops. The forward gun in action has been regestered by the Huns. Orders recieved to pull it back tomorrow if it is a dull day. General Walker was suppose to be around today, did not turn up. Our Colonel gone on leave, Major Selmes acting in his place. Seven Paris passes recieved today. Hospital near our lines taken over by our people. Vet Sgt back from Paris\n","168":"\n\nGeneral Walker inspected our lines. Well\n\nsatisfied. Thaw set in, plenty of mud. One charger (Officers) recieved.\n","169":"\n\nFrosty morning. General Birdwood decorating Officers and men. General Coxon. C.M.G. Sgt Torpey, M.M. Aeroplanes busy; Gun in forward position pulled back, stuck in mud, sent up another team at 4. A.M. Bty shelled with 8 inch. 4th Bty 2 guns knocked out.\n","170":"\n\nSevere snow storm, very cold, Service cheverens to be worn. One red and three blues for 1914 men. Q.M. S. Cable sent to D.A.C. from 101st Bty\n","171":"\n\nWet and stormy. Raining all day. Nothing doing.\n","172":"\n\nStill wet and cold. Lieut Wallace of French Mortor Bty, returned to his unit. Lieut Johnstone of T.M.B here for instructional purposes. Terrific wind storm last night. A large tree near stables had to be felled, split almost in two. Sgt Henry to go to gun position\n\nCorp Bourne from guns to wagon line. Three men on Paris leave\n","173":"\n\nDirty day, snow, rain, sleet and wind. Ammunition carting. Lieut Irwin gone to a pigeon school for three days. Lieut Scrivenner going to a signalling school tomorrow. Washing horses with mange dressing. Capt Lucas going on leave to England. Shod a mule today that wear a pair of front shoes out in 4 days. Standing on concrete standings and always pawing.\n","174":"\n\nWet day; Major Byrn returned to Bty. Lieut Irwin recalled from school. The report about our horses by General Walker, very unsatisfactory. The 2nd and 5th Btys, worst in Divis Great aeroplane activity. Hundreds of men behind the line, some big stunt coming off\n","175":"\n\nFine day, visited the Bty yesterday. Very quiet at guns, a few shells half a mile away. One of our baloons broke loose, anti air craft\n\nguns firing at it, did not hit it. General Anderson in our lines, 21 rounds to regester a gun, Mug officer.\n","176":"\n\nFine day, Sgts Flett and Buchannon down from guns. Major Byrne gon to Bty. A Terrific stunt away on our right. A 14 inch gun in action, somewhere in rear of our wagon line firing at 50,000 yards. The Chateau that was burned down was valued at 50,000 Francs. Lieut Stoddart rejoined Bty. Been away some months.\n","177":"\n\nShowery, All day. Moonlight nights. Cold. Shod General Andersons horses. Capt Staley at wagon line. Lieut Mulholland transferred to 3rd Bty.\n","178":"\n\nBeautiful day. Our aeroplanes busy. Fair amount of artillery work. The French advanced 21 Kilometres without opposition\n","179":"\n\nA few isolated showers, Otherwise fine,\n\nCivilian horses are now to be shod at Government forges, and charged for. One gun gone to work shops. The piece worn out. Aeroplanes busy. Measles broke out in 1st Bty. Our Bty out of bounds.\n","180":"\n\nFine day. Weather mild; Brigade Commander (Major Selmes) inspecting wagon line. A few Hun aeroplanes flying about very high. Indications of an early spring. Some trees budding. No one taking Vet officers place, who is on Blighty leave\n","181":"\n\nTerrific fog. Evening fine. Beautiful moonlight night. Civilian Population allowed here in Kamel. An old man looking at our billet, and shaking his head. He seem sad. A few planes about tonight\n","182":"\n\nAnother fog with showers during the day. Half holiday for men, not on duty. A lot of RE material to draw, for making roads and bomb proff screens around our stables\n\nWe recieved a Phonograph from comforts\n","183":"\n\nDirty, foggy day. very cold; Prisoners repairing roads in our wagon line. Rumoured that we move out in a few days. Ordnance move on the 29 inst.\n","184":"\n\nFine day. Saw a Hun aeroplane attack one of our baloons, used two machine guns on it, The men jumped out, and landed safely. The baloon was uninjured. This happened with-in 200 yard of our lines. My Corp (Dunn) go on Paris leave tomorrow. Four in all, to leave.\n","185":"\n\nOne gun to be drawn from workshops and taken to gun position tonight. Corp Bourne to go to army school for one month. Today was fine and warm. Lieut Irwin to go to 101st Bty for four days. Q.M.S Gibson on leave to Blighty\n","186":"\n\nInspector General of wagon lines here this\n\nmorning. General Rosenthall in command of 1st Australian Division Artillery. The 102nd Howitzer Bty had a premature, killing two of their own men. This happens very often, the fuzes are very sensitive. Frosty morning, fine sunny day. Our planes about in hundreds. A bit of a stunt on this evening. It is now quiet 5-30.P.M.\n","187":"\n\nSevere cold, freezing and foggy all day. Major Byrne at wagon line. Painting all vehicles. Supposed to move out in a day or two. Three ambulances at Hospital full of wounded.\n","188":"\n\nMost severe cold, icicles inches long hanging from the trees, wind blowing, and branches breaking off the trees, but strange to say the ground is not frozen. We move out on the 4th and 5th inst. New Vet Sgt arrived, Sgt Bunn to go to Calias base hospital. General Anderson inspecting our lines\n","189":"\n\nFine day. Preparations for moving. Right\n\nsection move on Monday. Remainder on Tuesday\n","190":"\n\nThree guns drawn from 16th Bty. Right section move out tomorrow at 2-30.P.M. Relieved by the 50th Bty\n","191":"\n\nFine but cloudy. Right section of the 50th Bty arrived at 1.P.M. The remaining sections of our Bty move off tomorrow. Our front very quiet.\n","192":" SEC. BOIS\n\nLeft KAMEL at 1-30.P.M. Weather fine. Arrived at MERRIS aeria 9-30.P.M. Horses in one large stable mud up to their hocks, in a filthy condition. Trying to get a local farriers shop to work in. Today is cold and cloudy.\n","193":"\n\nEverything upside down, Baggage all over the shop. Today I was awarded the Croix De Guerre, Belgium.\n","194":"\n\nThe name of the village is Sec. Bois; A very\n\nsmall village. The weather has changed wind and rain. I am now working in a French blacksmiths shop. Shoeing smith Heyden on Paris leave\n","195":"\n\nWet and miserable. As to be worn, Bty order. One N.C.O. and one man to go to Australia on 6 months leave. Driver Dawes nominated from this Bty. Later, Dawes gone to Australia.\n","196":"\n\nCold and windy. Football match. Half holiday Our Major and officers playing. General Rosenthal inspecting\n","197":"\n\nSunday, nothing doing. Lecture for junior N.C.O. tonight. Weather windy and cold\n","198":"\n\nOur Bty S.M. (Crittenden) assaulted last night. Three men under arrest in guard tent. Real wasters. All this disturbance was caused by drink, In almost every farm house , beer is sold. Named bock, 11\/2 Francs per bottle. Col Watson inspecting our horses\n","199":"\n\nThe three men up before the Colonel, waiting a Field, General, Court, Martial. Sent to compound. Things are now very quiet.\n","200":"\n\nRaining all day. The whole of the civilian population going to church Town picquet to be furnished, consisting of one officer, one Sgt, Corp Bdr and six other ranks. Horses to be again dipped for mange.\n","201":"\n\nCold and miserable. The Colonel back from leave. Our S.M. in Hospital. Having his nose X rayed . The M.O. fears that it is fractured. The Farrier of the 3rd Bty. Sgt Quelch, evacuated to hospital. Heart affected\n","202":"\n\nGeneral Walker inspecting our lines this evening. Scabie and teeth inspection. Col Dean acting C.R.A. During General Anderson absence. Tonight is bitterly cold, freezing 7-30.P.M. Artillery active\n","203":"\n\nTerrific frost. Our 8th Brigade had a hop over \n\nnear Messines, in front of our last position, and captured 100 prisoners. This morning at 4 oclock the Hun made a counter attack. The artillery opened fire and cut them to pieces. Tonight is beautiful and moonlight. Plenty of aerial activity. An enemy aeroplane was brought down near Balieul today.\n","204":"\n\nBeautiful day. Enemy aeroplanes over, Our Artillery busy. The anti-air craft guns hammering away 8.P.M. Numerous search-lights are trying to pick up hostile aircraft\n","205":"\n\nField General Court Martial on this evening. Two men found guilty, one man acquitted. This was the assault on the Sgt. Major\n","206":"\n\nStill frosty, not sufficient to warrant frost coggs. Hun aeroplanes over, no bombs dropped. Two deaths in village. One an old man 80 odd years old. The other a lad. The custom of this country, when a death occurs in a family, is to put a straw cross on road\n\nin front of house. The children coming home from school, stop at the cross and bless themselves\n","207":"\n\nRaining. Tonight blowing a gale. Rumoured that we are likely to move into action any day. The Huns using gas extensively. We are a reserve Brigade\n","208":"\n\nThe Major one Lieut. and two Sgts, went to look at gun positions. Farrier Sgt Haglund returned to unit. Day fine\n","209":"\n\nA big stunt on just now.8.P.M. All of our vehicles to be packed tomorrow, and we are to be ready to move off with two hours notice. The French population here says, that the war will be over in another three months. Tonight is terrebly windy. The award of the court martial. Driver Thompson 6 months hard labour. The other man 10 day 2nd field punishment, which means 10 days pay stopped\n","210":"\n\nFine day, but cloudy. Nothing doing, simply waiting and wondering what sort of a position we are going into. We are all convinced that we will have a hell of a time. We are part of the 4th Army. Now storm troops, which mean that we will be moved from pillow to post. Trying my hand at the French way of shoeing. A failure, practised on some mules, never saw such a scatter, one turned a complete summersault. Some real beautie; Cast one for Vice yesterday. Horses are scarce.\n","211":"\n\nTomorrow we make a start for action. Everything to be ready by the 3rd of next month for the hop over. Estimate two days to get into position. Some rotter stole my anvil and sledge hammer, last night,\n","212":"\n\nReveille 4-30.A.M. Pass starting point at 9.A.M. The day is wet cold and miserable. Arrived at VAUXHALL 4-30P.M. Here for three\n\nor four days. Bombs almost amongst our G.S. wagons, as they were coming along the road. Our journey today 23 miles\n","213":"\n\nFrosty morning. Cold day. Two guns gone into action. Range 7.500 yards, over 1,000 yards out of range. No shooting just at present. If we want to range, our Infantry are cleared out of the trenches. We are to be ready if the Huns attack. An enemy aeroplane brought down at 4.00A.M. Machine out of control. We are again camped in a Chateau, or rather outside one. Near the noted scotchmans wood\n","214":"\n\nThree more guns gone into action this evening, making in all five. A bit of a stunt on last night, taking a pill box. Just now 8-30 P.M another stunt is on. We move from here to our proper wagon line on the","215":" of next month. Today we are supposed to regester our range. Tonight raining.\n","216":"\n\nLight fall of snow. On the 3rd of March, the 38th Bty take over from us. A bit of a stunt on 8-30. P.M lasting about 10 minutes. Bits of raids. We now have a Lewis machine gun attached to Bty, to be worked by the gunners\n","217":"\n\nI am writing this in an iron shack, and guns shooting and enemy shells flying about. Some heavy ones which causes the earth to tremble, when they explode. The weather is rough and cold, wind, rain, and hail and snow. Vance and I live together, we have a bit if a fire going, It takes a little of the discomforture off. Last evening a Hun plane attacked one of our baloons. Both men dropped out attached to their paraschutes. Our anti-air craft shot the plane down, a direct hit; A few comforts recieved from comfort funds. Our guns (5) regestered last evening 5.800 yards in less than half an hour\n\nThe artillery stunt still continues during the night. Just now 6-30 A.M a terrific bombardment has started. Another machine gun in Battery.\n\n2-3-1918 POMIER. CAMP \n\nBetween LA. CLYEAT & KAMEL\n\nMoved camp, cold miserable day. Good stabling for our horses. Taking over another gun position from the 38th Bty. Today I met W. O Schmidt; first time since leaving the peninsula. Also B. S. M Stack, a member of my old Bty in Sydney, Both doing well. Our men billeted in elephant huts, all in a row, B.H.Q. 1st Bty","218":" Bty 39th and 110th Howitzer Bty.\n","219":"\n\nThe enemy hopped over last night, captured some of our people, left a number of dead hanging on our barb wire. The 1st Division are relieving the 4th Div; all branches.\n","220":"\n\nRaining all day. Big attacks all along the line. Great success, Colonel Major & etc in \n\nlines. Three horses to mobile. A large number going blind. (Opthalmia)\n","221":"\n\nFine day. Small attacks all along the line. Great artillery activity. Our Major (Byrne) in hospital. The Bty. S. M. with Bty again; Had his nose repaired.\n","222":"\n\nSaw an aeroplane land, and turned turtle, Only one occupant, escaped with a black eye. Brother gone on Blighty leave. Fine day.\n","223":"\n\nRather foggy. A number of teams to be harnessed up, ready for immediate use, Big raids by our troops. Artillery active\n","224":"\n\nHuns used gas extensively two nights ago, caught a lot of our men. A few bombs dropped about here last night.\n","225":"\n\nOur planes escorting a German aeroplane to our aerodrome. Fine day, Major Byrne back from hospital.\n\n \n\n10-3-1918\n\nHalf holiday for drivers, Glorious day. Clocks put on one hour. Lieut Johnstone gassed. The enemy tried to break through at MENIN road, but failed. He is pouring gas into our troops wholesale. Our 9th Batt of Infantry suffered heavy casualties from gas\n\n11-3-1918\n\nThe back aeria is being shelled by enemy 15in. The plane our men escorted to earth the other day, was one of our planes, conducted by two Huns. One of our airmen signalled to them. The Huns did not answer. Suspicions were aroused, with the result stated. Old Colonel Headstalls, giving instructions in singing horses, Disgusting, to think, a man like that, getting about £ 2-00 per day, can’t make himself more useful. Waste of public money. An acting Bdr in 1st Bty reduced to the ranks. This is the first time such a thing has occured in 1st Bde. He was stripped on a general muster parade. The Bty S M cut off his\n\nstripe\n\n12-3-1918\n\nShod General Andersons horses. An Officers horse was sent to 2nd Brigade and shod in front. I was annoyed, and reported it to our Major, who happened to be in our lines. In no way whatever was I consulted, been shoeing the horse for years. Captain Patterson V.O. of","226":" Brigade was the man responsible. If he watched his own Brigade horses, and Farriers, he would have more work than he could do. A German baloon brought down. It was floating about the heavens. Our aeroplanes opened fire on it , and the gas escaped, it floated over our lines and fell\n","227":"\n\n9-30 A.M. Fritz shelling, eleven horses and a few men killed. The 6th Bty had an officer and one Sgt killed, and one Sgt wounded. They evacuated. 160 shells on gun position. A few 9.2 shells in front of our Bty. Major gone to Bty, Capt Staley in wagon line; Weather very good. B S. M original","228":" Division who was attached to this Bty, while our \n\nB S.M was in hospital, sent to 101st Bty. 300 rounds fired every 24 hours by Bty. Some very fierce bombardments on at times, as a rule they last about 15 minutes. Very few Hun aeroplanes about today. I saw the first one since coming here.\n","229":"\n\nWet, all day and half the night. Bty shelled. A paper baloon let loose by Fritz, floated over our way. Captured by the 39th Bty. Some proclamation attached.\n","230":"\n\nVery cold day; Enemy shelling last night , put over 14 large shells. Sgt Stone sent to","231":" Bty. A large number of our aeroplanes going over enemy lines. A new moon in evidence, Our Major going on leave to England\n","232":"\n\nAn anti-tank attached to Bty. Sgt Torpey digging it in. Some large shells over during the night, fair way from our lines; Went for a walk to Renninghelst this evening, half holiday. Place almost deserted, very few troops\n\nabout. Fine sunny day\n","233":"\n\nSt Patricks day. Beautiful weather. Thirty aeroplanes in one squadron passed over our lines. Appears to be on a bombing excursion. The enemy shelling our baloons. Austrian Artillery, in front of our portion of the line. The report says, that they are using some of the guns captured from the Russians, against us. A few large shell flying about, This morning some landed on Kemel hill.\n","234":"\n\nThe gunners had to leave the guns yesterday. The enemy peppered them with 4.7, and then put up a barage of gas shells, Sgt Flett slightly wounded in cheek. Lieut Stoddart one of our officers, mistaken for a German spy, and arrested, by two of our Infantry Corpls, he was taken to gun position to be identified. By all accounts, some person has been cutting our wires, thereby severing our communication. The baloon Fritz was shelling, was evidently brought down. This evening he is on another; Plenty of shells \n\nflying about. Corp Elphick and Bdr Powell gone to Officers school. Yesterday an aeroplane shoot was carried out, a 15 inch Howitzer Bty got busy and smashed up a Chateau, some German Head Quarters. This Bty is a few hundred yards behind our Bty. We are using a new gas. The first experiment was followed up by Infantry, who found Fritz dead everywhere. Some in the act of eating, and others in their dug outs\n\nContinued\n\n"}}