{"Document Name":{"0":"Diary_0473","1":"Diary_0473","2":"Diary_0473","3":"Diary_0473","4":"Diary_0473","5":"Diary_0473","6":"Diary_0473","7":"Diary_0473","8":"Diary_0473","9":"Diary_0473","10":"Diary_0473","11":"Diary_0473","12":"Diary_0473","13":"Diary_0473","14":"Diary_0473","15":"Diary_0473","16":"Diary_0473","17":"Diary_0473","18":"Diary_0473","19":"Diary_0473","20":"Diary_0473","21":"Diary_0473","22":"Diary_0473","23":"Diary_0473","24":"Diary_0473","25":"Diary_0473","26":"Diary_0473","27":"Diary_0473","28":"Diary_0473","29":"Diary_0473","30":"Diary_0473","31":"Diary_0473","32":"Diary_0473","33":"Diary_0473","34":"Diary_0473","35":"Diary_0473","36":"Diary_0473","37":"Diary_0473","38":"Diary_0473","39":"Diary_0473","40":"Diary_0473","41":"Diary_0473","42":"Diary_0473","43":"Diary_0473","44":"Diary_0473","45":"Diary_0473","46":"Diary_0473","47":"Diary_0473","48":"Diary_0473","49":"Diary_0473","50":"Diary_0473","51":"Diary_0473","52":"Diary_0473","53":"Diary_0473","54":"Diary_0473","55":"Diary_0473","56":"Diary_0473","57":"Diary_0473","58":"Diary_0473","59":"Diary_0473","60":"Diary_0473","61":"Diary_0473","62":"Diary_0473","63":"Diary_0473","64":"Diary_0473","65":"Diary_0473","66":"Diary_0473","67":"Diary_0473","68":"Diary_0473","69":"Diary_0473","70":"Diary_0473","71":"Diary_0473","72":"Diary_0473","73":"Diary_0473","74":"Diary_0473","75":"Diary_0473","76":"Diary_0473","77":"Diary_0473","78":"Diary_0473","79":"Diary_0473","80":"Diary_0473","81":"Diary_0473","82":"Diary_0473","83":"Diary_0473","84":"Diary_0473","85":"Diary_0473","86":"Diary_0473","87":"Diary_0473","88":"Diary_0473","89":"Diary_0473","90":"Diary_0473","91":"Diary_0473","92":"Diary_0473","93":"Diary_0473","94":"Diary_0473","95":"Diary_0473","96":"Diary_0473","97":"Diary_0473","98":"Diary_0473","99":"Diary_0473","100":"Diary_0473","101":"Diary_0473","102":"Diary_0473","103":"Diary_0473","104":"Diary_0473","105":"Diary_0473","106":"Diary_0473","107":"Diary_0473","108":"Diary_0473","109":"Diary_0473","110":"Diary_0473","111":"Diary_0473","112":"Diary_0473","113":"Diary_0473","114":"Diary_0473","115":"Diary_0473","116":"Diary_0473","117":"Diary_0473","118":"Diary_0473","119":"Diary_0473","120":"Diary_0473","121":"Diary_0473","122":"Diary_0473","123":"Diary_0473","124":"Diary_0473","125":"Diary_0473","126":"Diary_0473","127":"Diary_0473","128":"Diary_0473","129":"Diary_0473","130":"Diary_0473","131":"Diary_0473","132":"Diary_0473","133":"Diary_0473","134":"Diary_0473","135":"Diary_0473","136":"Diary_0473","137":"Diary_0473","138":"Diary_0473","139":"Diary_0473","140":"Diary_0473","141":"Diary_0473","142":"Diary_0473","143":"Diary_0473","144":"Diary_0473","145":"Diary_0473","146":"Diary_0473","147":"Diary_0473","148":"Diary_0473","149":"Diary_0473","150":"Diary_0473","151":"Diary_0473","152":"Diary_0473","153":"Diary_0473","154":"Diary_0473","155":"Diary_0473","156":"Diary_0473","157":"Diary_0473","158":"Diary_0473","159":"Diary_0473","160":"Diary_0473","161":"Diary_0473","162":"Diary_0473","163":"Diary_0473","164":"Diary_0473","165":"Diary_0473","166":"Diary_0473","167":"Diary_0473","168":"Diary_0473","169":"Diary_0473","170":"Diary_0473","171":"Diary_0473","172":"Diary_0473","173":"Diary_0473","174":"Diary_0473","175":"Diary_0473","176":"Diary_0473","177":"Diary_0473","178":"Diary_0473","179":"Diary_0473","180":"Diary_0473","181":"Diary_0473","182":"Diary_0473","183":"Diary_0473","184":"Diary_0473","185":"Diary_0473","186":"Diary_0473","187":"Diary_0473","188":"Diary_0473","189":"Diary_0473","190":"Diary_0473","191":"Diary_0473","192":"Diary_0473","193":"Diary_0473","194":"Diary_0473","195":"Diary_0473","196":"Diary_0473","197":"Diary_0473","198":"Diary_0473","199":"Diary_0473","200":"Diary_0473","201":"Diary_0473","202":"Diary_0473","203":"Diary_0473","204":"Diary_0473","205":"Diary_0473","206":"Diary_0473"},"Date":{"0":"unknown","1":1657.0,"2":1658.0,"3":1659.0,"4":1660.0,"5":1661.0,"6":1662.0,"7":1663.0,"8":1664.0,"9":1665.0,"10":1666.0,"11":1667.0,"12":1668.0,"13":1669.0,"14":1670.0,"15":1671.0,"16":1673.0,"17":1674.0,"18":1675.0,"19":1676.0,"20":1677.0,"21":1678.0,"22":1679.0,"23":1680.0,"24":1681.0,"25":1682.0,"26":1683.0,"27":1684.0,"28":1685.0,"29":1686.0,"30":1687.0,"31":1688.0,"32":1689.0,"33":1690.0,"34":1691.0,"35":1692.0,"36":1693.0,"37":1694.0,"38":1695.0,"39":1696.0,"40":1697.0,"41":1698.0,"42":1699.0,"43":1700.0,"44":1701.0,"45":1702.0,"46":1703.0,"47":1704.0,"48":1705.0,"49":1706.0,"50":1707.0,"51":1708.0,"52":1709.0,"53":1710.0,"54":1711.0,"55":1712.0,"56":1713.0,"57":1714.0,"58":1715.0,"59":1716.0,"60":1717.0,"61":1718.0,"62":1719.0,"63":1720.0,"64":1721.0,"65":1722.0,"66":1723.0,"67":1724.0,"68":1725.0,"69":1726.0,"70":1727.0,"71":1728.0,"72":1729.0,"73":1730.0,"74":1731.0,"75":1735.0,"76":1736.0,"77":1737.0,"78":1738.0,"79":1739.0,"80":1740.0,"81":1741.0,"82":1742.0,"83":1743.0,"84":1744.0,"85":1745.0,"86":1746.0,"87":1747.0,"88":1748.0,"89":1749.0,"90":1750.0,"91":1751.0,"92":1752.0,"93":1753.0,"94":1754.0,"95":1755.0,"96":1756.0,"97":1757.0,"98":1758.0,"99":1759.0,"100":1760.0,"101":1761.0,"102":1762.0,"103":1763.0,"104":1764.0,"105":1768.0,"106":1769.0,"107":1770.0,"108":1771.0,"109":1772.0,"110":1773.0,"111":1774.0,"112":1775.0,"113":1776.0,"114":1777.0,"115":1778.0,"116":1779.0,"117":1780.0,"118":1781.0,"119":1782.0,"120":1783.0,"121":1784.0,"122":1785.0,"123":1786.0,"124":1787.0,"125":1788.0,"126":1789.0,"127":1790.0,"128":1791.0,"129":1792.0,"130":1793.0,"131":1794.0,"132":1795.0,"133":1796.0,"134":1797.0,"135":1798.0,"136":1799.0,"137":1800.0,"138":1801.0,"139":1802.0,"140":1803.0,"141":1804.0,"142":1805.0,"143":1806.0,"144":1807.0,"145":1808.0,"146":1809.0,"147":1810.0,"148":1811.0,"149":1812.0,"150":1813.0,"151":1814.0,"152":1815.0,"153":1816.0,"154":1817.0,"155":1818.0,"156":1819.0,"157":1820.0,"158":1821.0,"159":1822.0,"160":1823.0,"161":1824.0,"162":1825.0,"163":1826.0,"164":1827.0,"165":1828.0,"166":1829.0,"167":1830.0,"168":1831.0,"169":1832.0,"170":1833.0,"171":1834.0,"172":1835.0,"173":1836.0,"174":1837.0,"175":1838.0,"176":1839.0,"177":1840.0,"178":1841.0,"179":1842.0,"180":1843.0,"181":1844.0,"182":1845.0,"183":1846.0,"184":1847.0,"185":1848.0,"186":1849.0,"187":1850.0,"188":1851.0,"189":1852.0,"190":1853.0,"191":1854.0,"192":1855.0,"193":1856.0,"194":1857.0,"195":1858.0,"196":1859.0,"197":1860.0,"198":1861.0,"199":1862.0,"200":1863.0,"201":1864.0,"202":1865.0,"203":1866.0,"204":1867.0,"205":1868.0,"206":1869.0},"Entry":{"0":"\n\n","1":"\n\n1411 day of the war\n\nI have completed 10 books since I left Victoria and have sent 8 of them home, describing my travels & adventures up to the end of last year.\n\nThe war still drags on increasing in fury and intensity as time goes on. There is no doubt that the enemy is seeking a decisive issue this year. Their present onslaught is their final flutter and although they have gained some territory it is at a terrible cost. Their army is being gradually wiped out, while the army of the allies is increasing. It is officially reported that the Americans have 300,000 men in France. It is only a matter of time when the enemies’ army is defeated and perhaps that may be this year, for he is making the pace though lately his onslaughts have been appreciably weakened.\n\nThe weather this summer is in marked contrast to that of last year, which was very showery. This is a very pleasant summer up to date. The days as a \n\nrule being fine & warm with a blue sky dotted with clouds. Occasionally there are dull cloudy days with some cool winds but on the whole the weather is good and also the visibility. The days are very long. It is not dark until about 10 o’clock and it is again daylight at 3.30.\n\nThese long mornings and evenings afford plenty of time for reading and writing, and the time goes quickly and pleasantly. But there is always the danger that we may be shelled at any moment, for the enemy has shelled all round us day after day and night after night in pursuance of his policy of harrasing back areas.\n\nIn the river Somme which flows past here, there are plenty of fish, and some of the lads have been fishing but with little success with the hook but with a net made out of wire netting & placed in a likely spot over night they have had better luck.\n\nThere are few shops in these villages except an occasional stamminet and coffee houses, but other shops are nil.\n\nConsequently Post cards & note books are unobtainable. This book was given to me by Jack Watson and there are a few of his notes in the front pages mostly addresses of friends.\n\nThis year we all experience great difficulty in keeping down vermin especially lice. I have repeatedly put on clean clothes and next day found lice on them. Their bites itch very much and I believe they carry the scavey, which is a very annoying skin disease. It is a parasite that burrows under the skin which causes itchiness, therefore scratching. This makes them blead and they turn into sores which are very itchey & don’t get a chance to heal up on account of the scratching. Thus a scavey patient becomes covered in scabs unless he seeks early treatment. The treatment consists of frequent baths & rubbing with sulphur ointment.\n\nI was issued with a pair of Trousers (slacks) this evening. This is the first pair that I have been issued with since I have been in the Transports. My old pants are thread bare shabby & torn. The other blacksmiths are worse than mine. It is a disgrace to the army. If the authorities cannot cloth us properly they ought\n\nto send us back yet they are asking for more reinforcements. There are some who can get clothes anytime they want them. I don’t know how they manage it. Palm oil perhaps. I am on 2nd picquet (sentry duty) tonight from 12.15 to 3.30.\n","2":" 1412\n\nA beautiful morning. It was rather cold on picquet last night & I kept walking about most of the time. The time passed away uneventful until 10 to 3 when I heard some noisy fellows coming up the road. On investigating I found that they were both merry but one was very drunk &\n\nconstantly falling down & singing out. To my surprise I ascertained that it was Mr Chapman bringing home Mr Boyland, who had been indulging more freely than wisely. These are our two Transport officers. \n\nThere was the usual half holiday this afternoon\n\nThe weather changed this evening. It is now cold & windy & looks very much like rain. I went for a walk this afternoon & had a good view of the surrounding country from a height above our camp. I counted 17 of our observation baloons up. I suppose there were at least a space of 50 miles in length from the furthest one on our right to the furthest one on the left. I also had a good\n\nof part of Amiens, which is only a few miles away and of at least six villages, among them being Camon, Lamotte, Glissey and Allonville. In a field I saw a clever contrivance attached to an American mower for laying out the hay in straight swarths. It was hinged to the knife bar guide and consisted of a small tublike affair with wires radiating from it. The tub was caused to revolve by a wheel underneath it, which ran on the ground. The tub was fitted to an iron platform.\n\nAt 9.30 this morning an enemy aeroplane attacked one of our observation baloons and brought it down in flames. The enemy escaped.\n","3":" 1413.\n\nDull & cloudy but fine. Last night was fairly quiet. There was some spasmodic artillery activity by the enemy.\n\nThe \"Mail\" reports an attack on an 80 mile front in Italy. The Italians held the enemy in check everywhere. We were issued with Comfort fund cigarettes (Havelock) and also the usual weekly issue of cigarettes & tobacco.\n","4":" 1414\n\nCloudy and windy. One of the advantages of this place is that we can buy sweet milk, an enterprising Frenchman drives past every morning with his little cart and donkey selling milk. He charges 6f for about\n\ntwo cup fulls not enough to fill a dixey. The \"Daily Mail\" prints today more details of the enemy push in Italy. It was on a front of 94 miles and was a complete failure. Italians, French & British are fighting side by side. They rewon lost positions and took over 3,000 prisoners.\n\nAfter dinner today, the enemy shot down one of our observation baloons in flames. The hostile plane darted from behind a cloud fired incendiary bullets at the baloon & escaped.\n\nThe enemy raided our trenches last night and left with us 6 prisoners from the Prussian Guards.\n\nWednesday June 19. 1918. 1415.\n\nCool & cloudy. There was some rain early this morning which has laid the dust. I finished reading a great detective story \"The Hollow Needle\" by Maurice LeBlance. A French story reciting the exploits and adventures of Arsine Lupin. It is full of interest from start to finish, because the reader is kept in uncertainty and doubt about the mystery of the needle until the end. This front is very quiet today & last night\t.\n\nToday we are 4 weeks in this camp, which is about the longest time we have spent in one camp for months.\n\nThis evening I received a copy of the Portland Observer of Feb 14 containing a report of the Portland show & races.\n\nThursday June 20. 1918. 1416.\n\nCloudy with a few light misty showers. Last night some shells burst not far from our camp. I am on 1st picquet tonight with W.A. Wilson 9 to 12.15. Yesterday some teams not of our brigade were observed and shelled by the enemy near the front line.\n\nAt several canteens here we can buy Australian brands of\n\ntobacco cheaper than in Australia. There is no duty on it, and it probably comes from America from one of the branch houses there. I received two letters from my wife to date – dated April 15 No. 130 and April 18. 131 also one from Annie Kennedy Otway St Portland of","5":"\n\n (I wrote to my wife this evening.Letter 133. 2 pages)\n\nThis evening on the road to the front near Villiers Bretonneux some of our rations limbers had a very exciting time. The enemy shelled the roads as the limbers were passing and Driver Vollmann was hit in the back and both horses wounded. A Red Cross motor ambulance\n\nwhich is always stationed near this spot to this driver to the hospital and Q.M. Piddis took the limber back to the Q.M. Store and brought both horses back to the Transports lines. A soldier who was in the limber escaped unhurt and also our little dog named Fritz. The vet Cpt. Davidson was sent for and dressed the wounds of the horses but held out little hope for one of them, as he feared a piece of schrapnel had entered the lungs.\n","6":" 1417.\n\nThis morning the Vet decided there was no hope for the badly wounded\n\nhorse and it was shot, the other horse is alright.\n\nThree German Divisions tried to capture Rheims. They failed completely and lost heavily. The attack was on a 15 mile front. Austrians made a furious battle for Venice & failed dismally. They are penned in a small loop, where the artillery plays on them & airmen drop bombs. The Italians & Allies since the battle opened on Saturday took over 9,000 prisoners many guns & hundreds of machine guns & have brought down 50 planes. The war news all along the line is very encouraging.\n\nToday is the longest day. It is getting clear about 3.30 and it is not dark\n\nuntil about 10 o’clock. We go to bed in the daylight and get up in the daylight.\n","7":" 1418.\n\nIt is very windy and cloudy today, also cloudy. There are no aeroplanes about. Last evening Harry McDonald saw our stolen horse in an English transport. He came to the camp, told the sergeant who went away and claimed it. After some argument they brought it back this morning.\n\nWe were issued with green envelopes today. I wrote to my father today in the Y.M.C.A hut and while there\n\nFred Holmes and Mr of Drik Drik. They are both looking well. Later the sergeant sent for me and with 6 others we had to take up 6 pack mules with 2 boxes of ammunition to a village called Blangy-Tronville where we are to stay for some time. We are here in reserve to take up ammunition to the front line in case it is required. It is a good job if Fritz behaves himself otherwise it is a tuff job. There are some dug outs to sleep in. We arrived before dark and got things\n\nfixed up. Tonight we are sleeping in an officers dug out as our own is too dirty and chatty. We will clean it out tomorrow as this dug out will be occupied tomorrow night by Mr Chapman.\n","8":" 1419.\n\nA fine day. Charlie, Henry & I slept in a spring bed in the officers dug out last night but I slept very little and I was glad to get out of it after being used so long to a hard bed.\n\nI cleaned out a dug out this morning. It was full of rubbish and old bags & straw and vermin but it is shrapnel proof and that is the mail consideration these times. A lot of enemy shells fell fairly close to us last night & this morning searching for the big guns that are in the vicinity the concussion of which shakes our dug outs and brings down small stones, dirt etc. These dug outs are all made in the side of a chalk bank. They are roofed over with timber & sheet iron covered over with earth and chalk. I received two letters today from my wife dated April 2 No. 128 and","9":"\n","10":" 1420.\n\nA fine day. Last night 4 hacks and two men came up from\n\nthe Transport lines about 12 o’clock. Mr Chapman is now staying with us & of course we have to keep a picquet. The hours are 10. pm. to 530. am.\n\n(I wrote to my dear wife today. Letter 134. 3 pages and included it in the official green envelope)\n\nThis evening the enemy put several shells on a road in front of us but done no damage.\n\n (In the last lot of letters I received from my wife she mentions that she received a shell case pack of and a pack of post cards.)\n","11":" 1421.\n\nI am on second picquet to night from 12.30 to 3. Before I came on picquet last night the enemy shelled the road to the right of us. The shells fell close and several times showers of dirt and stones fell on our dug out. A company man named Jefferies got the wind up and ran outside without any boots or coat on & stayed in a deeper dug out used for an exchange station by the signallers for a new underground telegraph cable. He with some of the cooks stayed there all the time I was on picquet. Later he got his blankets & overcoat & slept on the stairs until morning.\n\nI had a look around this morning. Some of the shell holes are quite close to the dug outs about a chain away\n\non each side of the road. Some were landed in the village and again at breakfast time some more shells were lobed in the village.\n\nI have not seen any papers since I came here but am told that the Austrians are on the run and have lost a lot of men & guns. It is very difficult to get a good quality of ink, or to carry it about. I carry mine in a rifle oil bottle, but the brass of which the bottle is composed weakens the quality of the ink, making it thin & watery. One often finds a bottle of ink in a dug out where some soldier has left it rather than carry it. It makes an awful mess if the bottle gets broken. So I filled my pen and bottle with fresh ink.\n\nThis evening one of our observation baloons broke away from its moorings. The observers jumped out in their parachoots & the baloon rose high above the clouds & floated away over the German lines. The archies tried to bring it down with their shells to prevent the enemy getting it but failed. The enemy heavily shelled one of our roads this evening. There was a lot of traffic on it but all the limbers escaped. I was detailed to go up in a limber with Charlie & Henry to Villiers Breton-\n\n-neau to bring back German ammunition & salt. He shells the road almost every evening and also the town and it is a very riskey job. Later I was taken off the job as two guides were going up and I was not required.\n\nWe are to leave this camp tomorrow & the whole Battalion is to go out for a short rest.\n\nCharlie Henry & the guides got up to & returned safely from Villiers Bretonneaux and also got their loading. On the road they passed mutalated horses water carts & a G.S. wagon.\n","12":" 1918. 1422.\n\nA fine morning. I was up at 5. had an early\n\nbreakfast of 2 sausages - the first on issue in France and left before 6. and reached Lamotte camp before 7, where they had just got up.\n\nMr Chapman told me last night that Lieut. N. McNicol has received the V.C. The Transport Sargeant (Partridge)) is to receive the Meritorious Medal.\n\nAt 2.p.m. we were all ready to move and started at once for Allonville passing by our old camp there which had several shell holes near the waggon lines one in the shed that was used as a Q.M. Store\n\nand the billets that we used to sleep in were wrecked. I hear that 27 were killed and over a hundred wounded all Australians.\n\nBefore we left Lamotte camp the Transport of the 28 Battalion 2. Division were there waiting to go in. They will have a good place as we made a lot of improvements including a good wall 5 ft high all round the horses and mules to protect them from the bombs and shells.\n\nWe did not stay at the old camp at Allonville but passed on through\n\nthe village through the aerodrome and on to a wood were we unlimbered and stayed for the night.\n\nI am on 2 picquet tonight 11.30 to 2.a.m. 2 ½ hours. All the drivers but one are out tonight. They had to return to bring on the officers things and some of the Q.M. stores\n","13":" 1423.\n\nA beautiful day. Last night a fleet of enemy planes came over and dropped bombs on adjacent villages. There was a large number of them and a great many bombs were dropped\n\nbut fortunately none in this wood.\n\nThis afternoon several enemy scout planes were hovering around at a great height. They were kept high up by our numerous archies.\n","14":" 1424\n\nRevlie 5.a.m. A beautiful morning. Breakfast 5.30. We were packed up and loaded and a way at 7 a.m. and a few kilometters along the road towards Franvillers until we got to Querrieu , we we stoped and unloaded the limbers and pitched our tents which are improvised ones being made out of pack covers & waterproofs sheets, old blankets etc. After tea I had a bath in the Somme lagoon which is only a few chains away from our camp. The water was beautiful & I felt much refreshed. There are two cemeteries quite close to the camp. A French civilian cemetery and a military one mostly all Australians in it. There are two English Aviation officers buried side by side and the propeller of an aeroplane is their headstone, which is very appropriate. All the graves are new and within the past few months. There are a number of open graves in\n\nreadiness.\n","15":" 1425.\n\nA beautiful day but rather warm at midday. An order has come out to get all the limbers cleaned oil painted also the harness in readiness for a competition. Today I was busy making lids for the tool boxes on the limbers.\n\nThis afternoon I went with Alick Holmes to the adjoining village of Pont Noyelles to the canteens but they were sold out of beer, matches etc. Coming back we kept on the far side of the canal and at a Battery canteen Alick bought a bottle of champagne. He paid 9\/ francs for it which was very dear but it was very good & strong. We drank it and then came home.\n","16":" June 30.1918. 1426.\n\nA beautiful day. I am carrying on with making the new lids for the tool boxes. There is a lot of work in each lid for at each end a piece of wood has to be dovetailed in to keep it from splitting and hinges has also to be fitted on.\n\nToday I finished reading \"South Sea Tales\" by Jack London. A series of tales of the South Sea Islands, mostly of the blood curdling sort.\n\nI was again out for a long walk with A. Holmes & visited Pont Noyelles and from there \nwent\n came back & went to the Y.M.C.A.\n\nThere were several tommies buried in the cemetary this afternoon. I knew nothing about it although I was working a few chains away until I heard the Last Post blown.\n\nI saw a fleet of our booming planes very high up – they appeared like birds in the air they were so high – going over to bomb the enemies positions and back areas.\n\nThere was a heavy straff on this morning. Everyone is expecting a big offensive shortly.\n","17":" 1427.\n\nanother hot day.\n\nThere were a number of enemy planes over last night dropping bombs. The enemy was active in shelling the area across the river evidently in search of Batteries dump stables etc.\n\nIn honour of the Americans the Fourth of July is to be a red letter day in France French & Allied troops will honour the day.\n\nI went for a swim in the bathing dam this evening & thoroughly enjoyed it for the day was very hot. In this dam which is very large & deep & made by the French for bathing purposes – the enemy dropped a shell\n\nsome time ago when there were 100 men on the banks & in the water & there was only one man slightly wounded in the leg.\n\nTo day Darkey Tregenza and Paddy Ryan were paraded before the Colonel for being drunk and A.W.L. Paddy was fined 3 days pay and Darkey sent back to his company as he was a frequent offender.\n\nA new man named Waters was sent to the Transports this morning. There is half of the year gone and the prospects of the war finishing this year are very bright. The papers every day are full of good news and the Americans are getting stronger every day.\n","18":" 1428.\n\nAnother hot day. Last night was fairly chilly. In fact, every night is cool though the days are hot. Everyone is busy making preperations for the Brigade competition which is to come off on Friday. Some half dozen men are busy cleaning filing & polishing the drag washers and the points of the axles on the limbers. A waste of time it all is for after the show they will all get dusty unless they are again painted. Moreover with all the grease taken off they will quickly grind away the\n\nlinch pins & increase the friction. Even the heads & points of the linch pins had the paint scraped off, the surface filed & polished. This is the way we are winning the war. Another new man S. Smith was sent to the Transports this morning to fill Darkey Tregenza’s place.\n\nToday I posted to my wife a large piece of German shell that fell near my dug out when I was in Blangy Tronville. 1\/3 1\/2d. \n\nTo day W. M. Hughes Prime Minister of Australia & Joe Cook visited this area, and inspected our Brigade, part of the 37. Battalion forming a guard of honour. They were accompanied by Sir John Monash.\n","19":" 1429.\n\nA beautiful day but much cooler.\n\nMore men were sent from the Battalion to assist in the preparations for the competition on Friday. At 2 o’clock we were all lined up and accompanied by Mr Boyland and Mr Chapman were marched to brigade Headquarters where our respirators were inspected and we were all put through a gas room with the respirators on. Before coming out we had to take the respirators off in order to get a taste of the gas\n\nwhich consisted of three different varieties. This is to get us used to the gas and to be able to detect its presence. Our little dog Fritz came in with us (unknown of course) and was nothing the worse for his experience.\n\nThere was a very heavy bombardment last night. It is said today that our aeroplanes caught the enemy massing troops and the guns were turned upon them. A big offensive by the Allies is expected tomorrow as it is the fourth of July, the American Independence day and it is thought to be a fitting occasion to tune up the enemy. We are quite prepared to do it too.\n","20":" 1430\n\nA fine day much cooler. There was a terrific bombardment last night from Villiers Bretonneux towards Albert. As a result of it we heard this morning that the Australians and the Americans advanced on a 16 mile front to a depth of about 2000 yards and captured.\n\nThe papers report an advance by the Americans & French & 500 prisoners in the Chateau Thierry region.\n\nToday Capt. Cereily Quarter Master inspected the clothing and boots of the Transports and condemned a lot of the clothes as being too shabby for the show\n\ntomorrow. There was a difficulty in supplying. One man was fitted out in a pair of the Captain’s pants and a tunic borrowed from the interperetor and a pair of puttees from the Sargeant Taylor while for another man they had to borrow pants from another unit. The clothes of some of the men were a disgrace and they should have been supplied with new ones months ago.\n\nThere is a terrific bombardment tonight apparently in the same sector as last night. It commenced at about 9. pm and continued with great intensity & violence until about 11.30 when it suddenly ceased owing to a fleet of enemy palnes coming over and observing & booming.\n","21":" 1431\n\nA beautiful day. Last night a fleet of enemy boming planes flew over and dropped bombs all around the camp and many along the river which by the way is not the Somme but a tributary called L’Hallieu \n\nToday I received a letter from my dear wife No 132 and dated April 22. 1918.\n\nThe show of the Transports in the 10 Brigade started at 11. am. It was a success from\n\ntomorrow. There was a difficulty in supplying. One man was fitted out in a pair of the Captain’s pants and a tunic borrowed from the interperetor and a pair of puttees from the Sargeant Taylor while for another man they had to borrow pants from another unit. The clothes of some of the men were a disgrace and they should have been supplied with new ones months ago.\n\nThere is a terrific bombardment tonight apparently in the same sector as last night. It commenced at about 9. pm and continued with great intensity & violence until about 11.30 when it suddenly ceased owing to a fleet of enemy palnes coming over and observing & booming.\n","22":" 1431\n\nA beautiful day. Last night a fleet of enemy boming planes flew over and dropped bombs all around the camp and many along the river which by the way is not the Somme but a tributary called L’Hallieu \n\nToday I received a letter from my dear wife No 132 and dated","23":"\n\nThe show of the Transports in the 10 Brigade started at 11. am. It was a success from\n\nspectator point of view. The 37 Battalion was only 3 points behind the winner and would have won only that two men who acted as brakermen from the Battalion had dirty rifles & lost two points. However we were first for the best cooker & team and first for the best limber and pair of mules.\n\nAfter dinner there was sports which consisted mostly of mules races. There were two casks of free beer on the ground which was done full justice too.\n\nThere were several casualities during last nights aerial raid. Two gunners in the R.G.A.were killed and some wounded. And there may have been other casualities that I have not heard of.\n\nCapt Crrily was wounded this morning in experimenting with a new kind of smoke bomb. It exploded.\n\nThe Brigadier was present at the show this morning. The cost of the show to the 37 Battalion in wages to the men who were engaged in cleaning & repairing the limbers without including the harness was £14.8.0. For the four brigades a total of something like £50. It does nothing towards winning the war. Then there was the time of an\n\narmy of officer judges to inspect and make the awards.\n","24":" 1432\n\nA beautiful day. I was on picquet last night from 2 to 4\/30. The night was fine and everything very quiet. There were no enemy planes about.\n\nThis morning on parade Mr Boylan gave 10 francs on behalf of himself & Mr Chapman to W. A. Wilson for proficiency in cleaning the limbers and 10 francs also to H. McDonald and W. Grey for riding contests. He also gave 50 francs to the mess funds which was much appreciated.\n\nThere were sports evening in the park across the creek\n\nI did not go but stayed & finished making a souvenir for Mr Boyland. It is a sugar scuttle made with a Fritz shell case, with a lid hinged on & cut at an angle with a handle on the lid made out of a bullet & a handle on the scuttle made out of a piece of driving band and two bullets in front for legs. A few days ago I made him & also Mr Chapman a match box cover to imitate a book.\n\nThis evening I received a packet containing 4 letters. Two from my wife No 133.","25":" April 28. and a letter & P.C. from of April 27. I posted a registered\n\npacket to my wife this evening containing one German machine gun belt for use in aeroplanes.\n\nSunday July 7. 1918. 1433.\n\nClose and cloudy. There is a swimming carnaval today in the lagoon & the swimming pond.\n\nThis morning I received a letter dated June 24 from Russell Dusting a gunner in the 38. Battery inquiring how Willie was getting on. He wrote often but got no reply. Before dinner a primus stove blew up in the camp of the 10 machine gunners camped alongside of us and burned down the cook house and mess house and several officers tents alongside narrowly escaped.\n\n(I wrote to my dear wife this evening. Letter 135. 2 Pages and included a cartoon from the Daily Mirror. \n\nGreen envelope).\n\nI got a cake of dark American Havelock tobacco given to me last night. We have no difficulty in getting American tobacco now as the authorities have made arrangements to get a supply from America every month instead of Australia. There is less trouble with shipping arrangements.\n\nThere is a burial in the cemetary here almost every day. There were 3 a few days ago and 1 this morning. Daily Mail reports that 195 enemy planes were downed last week, a record.\n\nMonday July 8. 1918. 1434.\n\nA hot day.\n\nI cleaned up all my equipment and polished the brass work for an inspection at 2. p.m in full marching order by the Colonel Instead of the Colonel inspecting us Mr Boyland did so and there was also a kit inspection at the same time. I was nothing short except a few rounds of ammunition. Today has been very warm and close. The sky is cloudy. I received a letter from Kitty Martin of Inniskillen this evening.\n\nCharley Charles returned from hospital today. He left us at Lamotte Camp.\n\nAbout 8.p.m this evening there was a stand to of all the forces in this sector. Limbers were hastily loaded, horses harnessed, blankets rolled and put in a heap, the roll called we waited in readiness for a move. About 2 a.m. orders came through to stand down. Horses were hastily unharnessed fed and our blankets collected and then we went to bed, very tired , and with many imprecations on the inventors of the \"stand to’s.\" The cook made some hot coffee about 9 a.m there was also a light shower, About 10 p.m. there was intense artillery bombardment by guns of various calibres. It is said that there was a big\n\nhop over on a wide front during the night but the rumour though persistent is not confirmed.\n\n(I had a bath in the swimming hole early this evening).\n\n Tuesday July 9. 1918. 1435.\n\nA fine day hot but cloudy. Revellie was at 7.30 instead of 6.45.\n\nThis afternoon there were light showers & again at night\n","26":" 1436.\n\nA fine morning. A nice bright sun shining. We expect to move further up to the line at any time, in all probability tomorrow and to Corby or the vicinity. It was very windy and stormy for a while this afternoon with some heavy showers but the wind fell before 5 o’clock.\n\nEver since we have been at this camp we have been able to get the \"Daily Mail\" at an adjoining Y.M.C.A. every morning about 11. They sell it for 2d. which is 1d. less than the French girls charge for it.\n\nLate this evening orders came through from H.Q. that we are to move out early in the morning. Revellie is at 3.30 a.m. and the cooker drivers have to leave earlier than that in order to move off with the Battalion. The Battalion have breakfast on the road.\n","27":" 1437.\n\nWarm & cloudy with a few light showers. We were up at 3.30 loaded the limbers, fed up\n\nand had a cup of hot tea before starting. We got away about 6.a.m. and after about an hour travelling reached our destination at a place called Daours in sight of the town of Corbie, the twin spires of the church being a conspicuous landmark. There are three little villages quite close to us, the furthest not being much more than a mile away. We are camped in a little narrow wood and took over from the 13 Battalion, who relieve us at Querrieu. Our Q.M. store & H.Q. is alongside of us which is an advantage. There are numerous transport camps in some big gravel & earth quarries adjoining us. We are sleeping in holes in the ground which we roofed over with pack covers etc. The camp is a good one, unless the enemy shells us or drops bombs. One bomb fell the other night in a trench a few chains away but done no damage.\n\nWe were saved a lot of extra carting today. Instead of carting the S.A. Ammunition we exchanged with the Transport that we relieved as we carry some 80 odd cases weighting 80 lbs it meant 3 tons less to\n\nremove. It was of equal advantage to the other Transport. It is a wonder some brilliant genius did not discover this before.\n","28":" 1438\n\nI was on 3 picquet this morning from 2 to 4.30. It was a quiet time and no shelling in this quarter by the enemy.\n\nAbout 7 a.m. there was a very heavy artillery activity south of us on the French sector. Today is cloudy, windy and occasional light showers.\n\n(I wrote to gunner R. Dusting this evening)\n","29":" 1918. 1439\n\nA beautiful day. Today I have been repairing Lewis Gun Carriers for the limbers\n\nThis evening I wrote to Kitty Martin & to Cis in reply to their letters.\n\nThis afternoon an enemy shell fell a few hundred yards from our camp. Just before dark I saw the enemy planes shoot down two of our baloons in quick succession and then make off admidst a hail of machine gun bullets & shrapnel.\n","30":" 1440\n\nThe fourteenth of July is France’s great national day. The French soldiers are to get extra rations today also wine & a cigar.\n\nBill Wilson & I celebrated the French Fete day by getting a bottle of Port Wine 5\/Francs. It was the Real Thing. We\n\ngot it at our own Canteen.\n","31":" 1441\n\nA fine day but cloudy. We have about a mile to ride every morning taking the mules and horses to water at a trouch in the village of Daours.\n\nThere was an inspection of the Transports today in drill order. These inspections will be every week in future until further orders.\n\nThis afternoon I saw the enemy shoot down one of our baloons in flames by one of his planes. I brazed 8 serviette rings made out of copper driving bands for some of the Transports. Late this evening some\n\nof the Battalion officers put together a German machine gun and fired a large number of rounds into a trench. The cartridges kept jamming because the web belt was defective.\n\nI received a tin of Havelock tobacco from my sister.\n","32":" 1442\n\nThere was some very heavy rain, thunder and lightning before revellie this morning & the water came through some of the tents. The ground was covered with water\n","33":" 1443\n\nVery close & cloudy with occasional light showers. The heat is very muggy.\n\nThis past few days I have been repairing machine gun carriers.\n\nPlan of a German wire or light bolt cutters. The special feature of it is that the handles are made out of sheet steel folded as shown in the sketch. The cutter guide has 3 holes to take an extra rivet between the jaws. Where the handles are hinged (a) one is made smaller to pass inside the other, and a thick washer is placed in the smaller to fill up the intervening space. B. when folded is drilled to hold the jaws of the cutters.\n\nJ.D.Wilson\n\nDaours\n\n17. 7. 18.\n\nI have read a number of late magazines since we came to this camp, including Pearsons, The Strand etc and part of Nelson’s history of the war dealing with the Naval battle in the North Sea.\n\nA large number of troops are laid up with \"dog\" fever a kind of influenza which is very prevelent in France now. There are several in the Transports attacked with it.\n\nBill Wilson & George Dodd was to go on leave in the morning but at the last moment it was posponed for a week owing to the German attack down South. This is their second attempt. Bill started to go on leave in March got as far as Calais when he with a number of others were recalled & were digging trenches near Neuve Eglise for a fortnight, which were subsequently captured by the enemy I was to be picquet tonight but was taken off to go as brakesman on a limber up the line tonight.\n","34":" 1444.\n\nFrank Kyne and I started off with the limber on an engineer’s stunt at 8.30 from the 40th Transports where we were joined by others. 7 limbers in all. We passed through Daours, Aubingey, Fouilloy and some other battered villages until we were between\n\nCorbie and the enemy where we halted and after some delay were informed that the stunt was cancelled. There were guns of various calabres all around us but principally 18 pounders and they opened up. The flashes lighted up the country, and some from the big guns were blinding while the noise was deafening. All around the ground was strewn with shell holes. We made all haste to get out but the enemy did no shelling while we were there. We got back about 11.15 nothing the worse except for a wetting we got from a shower at the start. I saw a collection of souvenirs that the Battalion is sending to the museum consisting of machine guns, light & heavy and an aerial bomb much like a 3 inch shell with a nose cap and a wind vane in the tail to keep it straight.\n","35":" 1445.\n\nA cool cloudy morning. Alf Amos went on leave today. He is the feed King.\n\nI finished making a cigarette holder & ashtray out of a German shell case. Enemy planes dropped bombs in the vicinity of this camp last night.\n","36":" 1446.\n\nEarly this morning enemy planes were hovering around at a great height and were met with a big barrage of shells.\n\nI have been so busy making souvenirs in my spare time that my correspondence is getting behind. It is nearly a fortnight since I wrote my wife, so I must write today.136\n\nThe French side by side with the Americans have had a brilliant victory between the Marne & the Aisne on a front of 28 miles. They are still advancing and have captured thousands of prisoners, large and small guns, and a great lot of other booty. It is one of the most brilliant victories of the war.\n\n I wrote to my wife this evening. Letter 136\n\nI am on 3rd picquet tonight.\n","37":" 1447\n\nThe news from the battle front between the Aisne & the Marne continues good. The Franco-American captures amount to over 17,000 prisoners, 360 guns including a battery of 8 in guns. The enemy brought up reserves along the whole line but failed to stop the advance. On the left the Allies held their positions on the plateaux S.W. of Soissons & the Chaudun district. In the centre they have gone\n\nnearly 2 miles. On the right they captured the plateaux N.W. of Monnes the heights N. of Courchamps & advanced beyond Torcy.\n\nDuring the past few weeks there has been a plague of horse flies. They are almost unbearable this past few days. I tried to sleep this afternoon but the flies would not let me. They were never like this before and I think it is due to so many transports camps behind the lines affording breeding grounds for the pest.\n\nThe crops especially wheat is fast ripening and the rains are hastening the process some of them are fit to cut.\n\nA great amount of salvage is being obtained on this front. Every night the limbers bring back German helmets, rifles bayonettes, equipment machine guns and ammunition. Yesterday some trophies were sent to Maffa by the Battalion. I have obtained a new German bayonette. For the enemy time is the essence of victory. Each weeks delay by the Germans means that another 60,000 American soldiers arrive.\n\nI have to go up the line tonight as brakesman on a water cart which is hard luck as I was on picquet last night.\n\nMonday July 22. 1918. 1448.\n\nCharlie Parish was driving the water cart,\n\nand we left here with the ration limbers about 8.30 and reached our destination at Head Quarters without mishap. We took a road that passed around the villages and woods & thus lessened the liability of being shelled. After we passed the Engineers Dump we travelled for several miles along the foot of a ride, the top of which the enemy was constantly shelling all the time as it was bristling with guns. The shells used were H.E. and gas. When we arrived we hooked into our empty water cart and with several fatigues supplied there went about 2 miles to the village of Hamel to fill the tank, at a house well. The pump was out of order & it took nearly an hour to fill the tank & hard work at that. While we were pumping hostile planes dropped bombs in the village which fell on 3 sides of us & some of them within a few hundred yards. The big guns in & around the village renewed operations as soon as the planes were gone. We returned with the water cart & by this time the one we brought up first was emptied and we had to take it to the village\n\nand refill it for the Y.M.C.A. & bring it back to H.Q. All the time the enemy was shelling the ridge & the side of it a few of the shells falling close to the road & the pieces whizzing overhead. We hooked into the empty water cart & started for home. When we had gone about a mile the gas had penetrated down to the road, and for ¾ of a mile we had to pass through it, which we did at a trott. We were over 5 hours up at the front among the shells, leaving about 3.15 and arriving back at the camp soon after 4.a.m. when the picquet had some tea ready for us. It was a quarter to 5 when I got to bed being nearly 8 hours on the trip. Fortunately the night was bright & fine. I am off duty today and staying in bed.\n\nW.A.Wilson & G. Dodd went on leave today. This is their first leave & Bill came with the Battalion.\n\nEnemy aerial activity is on the increase in this sector. I saw a hostile plane attack one of our baloons at midday today & it was brought down in flames, a column of black smoke rising from it as it fell. The observers jumped out in their\n\nparachootes as also did those in adjoining baloons. Fritz attack another but was driven off by gunfire without affecting his purpose.\n\nThis evening I received a packet containing 3 letters one from my wife dated May 8. (135) one from Tom Douglas May 12. one from Cis","38":"\n\nThis evening I finished reading \"The Door Ajar\" & other short stories they are of the occulut and errie kind.\n\nRay Ward & Bryan Dowden returned from Blighty leave today. Bryan was to go to Ireland but was stopped when he got to London, on account of the Political situation there. Hard luck as he has relatives there. W. A. Wilson & George Dodd went on leave this morning for Blighty.\n","39":" 1449.\n\nA dirty miserable day. This evening I was put in charge of the limbers in the park. My duty is to see that they are kept greased and cleaned.\n\nThere is good news in today’s paper. S. W. of Rheims the Germans are blowing up their dumps & retreating. The rumour that the ex Czar of Russia has been shot is confirmed. He was shot on the 16 July. Mr Chapman has \n\nbeen called back to the trenches & is temporly with the 38. Bttn. He went up Sunday evening.\n\nLast week the total distance travelled by the Limbers up and down the line with rations, Engineers materials etc, was 2,300 kilometres.\n","40":" 1450.\n\nA fine day but cloudy. Amongst the salvage this morning was a German sand bag made out of woven paper. The paper is cut into narrow stripes, twisted into threads and woven together like ordinary Hessian. It appears to be very satisfactory.\n\nMany of their ropes are also made out of paper twisted together.\n\nThis evening I was working late making souvenirs, I started to make a cigar tray and holder out of a tank shell for Charlie Henry & two match box covers for a driver in the Brigade.\n\nWord came through a few days ago that Hughie Gannon who left the Transports when we were at Allonville, that he was torpored near the English coast when on his way to Australia. He says there are some missing.\n","41":" 1451\n\nA fine day with some showers in the afternoon. It is two years today since we landed at Plymouth England.\n\nThere was a bathing parade today to the baths at Daours in an old mill worked by a waterwheel. The water was hot. We got a heavy shower coming back.\n\nSince we came to this camp there has been a great plague of horse flies though they have been in evidence all of the summer but not very bad until lately. Up North we were free from all flys.\n\nThis morning the enemy put up a barrage, the smoke of which we could see on a line from the right of Corbie to beyond Merricourt where it was lost in the distance.\n\nThe smoke of it was like a forest on fire and it lasted for a couple of hours. We heard this evening that he attempted to come over.\n\nI received six francs this evening for the match box covers & C. P. Wilson & J. Boon to pay. I have nearly finished making a cigarette holder &: ashtray for C. Hinery out of a 6 pounder tank shell.\n","42":" 1452\n\nFine with occasional\n\nshowers. Amongst the salvage that came down from the line this morning were a dozen or more German shells in their cases. There were also some with iron cases instead of brass ones. The shells were of all the same size, corresponding to our 18 pounders but were of 3 distinct varieties but of them concussion shells & the other a time fuse. I got 5 francs from Geo Deveroux for taking the cases off three.\n\nI finished C. Hinerys souvenir this evening. 5 francs I am charging for it.\n","43":" 1453.\n\nA dirty, wet, miserable day. We are getting a lot of showery weather lately.\n\nMr Narick who left us after the Q.M. store was removed from Ploesteert over 12 months ago came back yesterday and was sent up to the Battalion. He is in B company with the rank of 1 star.\n\nI have almost finished making a sugar scuttle for J. Chippendale another 5 francs. I have orders for at least half a dozen more & lots of matchbox covers.\n\nThis evening I posted to my wife the souvenir cigarette ashtray that I made a few days ago out of a German shell case.\n","44":" 1454.\n\nA showery day. We did not water up the\n\nanimals until after breakfast. This being Sunday evening and a half holiday, I wrote a long letter to my wife this evening.\n\nLetter 137 5 pages\n\nA couple of duds from the anti aircraft guns fell near the horse lines this morning but did no damage.\n","45":" 1455.\n\nA fine day. I was on second picquet last night from 11.30 to 2. Soon after 12 there was a very heavy bombardment which lasted with varying intensity for about 2 hours. The second batch of ration limbers left here at 1.am and the first returned before 12. It helped to make the time pass more quickly.\n\nThis evening I made an ashtray out of a Fritz shell case for J. Chippendale.\n\nThe papers contain further news of the German retreat on the Marne. Allied cavalry and tanks follow the Infantry.\n","46":" 1456.\n\nA fine day warm and cloudy.\n\nI finished Chips ashtray & made & sold several matchbox covers this evening.\n\nThis morning the wheel\n\ncame off the water cart when it was bring back a load of water to the camp. S. Smith & I were sent to jack it up & put it on. We had our work cut out.\n\n","47":" 1457.\n\nA hot day. The weather has taken up again. I made a small jug out of a Fritz whiz bang shell case for J. Chipendale. This makes 3 souvenirs I made for him at 5 francs each.\n","48":" 1458.\n\nSeven months of the year gone and there is a prospect of the war finishing at the end of the year. The enemy is anxious to have it ended this year before America has her full strength in the field.\n\nToday is very hot.\n\nLast night the enemy was very active on this front. About midnight numerous planes dropped a large number of bombs in the vicinity of this camp, but chiefly along the river. This morning his batteries shelled gun positions for several hours.\n\nThis afternoon the enemies aeroplanes brought down 4 of our observation baloons in flames & escaped despite anti aircraft fire apparently unharmed.\n\nI had a bath in the canal this evening near Blangy Tronville about a mile from our camp. I enjoyed it. I made a small milk jug for Geo Deveroux this evening\n","49":" Augsut 2, 1918.1459\n\nAfter breakfast it started raining and continued. In a few hours the sand was again wet & slopprey. The rain continued all day & I stayed in my tent most of the time reading making souvenirs and packing one to go away.\n","50":" 1460.\n\nMuch finer today. Last night a limber driven by C.P.Wilson had one of the wheels\n\nsmashed in a collision with a tank while crossing a bridge. 4 spokes were ripped out & 4 broken.\n\nFor the past few days it has been known that a big push is to take place all along this front and tonight a portion of the stores were sent up to Corbie so that when the advance does take place there will be less stuff to remove from here. It was the intention tonight to make a gas attack but the wind is not favourable unless gas shell is used. 3 of the cookers are to go forward tonight.\n","51":" 1461.\n\n4 years of the war has gone by and today is the commencement of the 5th year of Britain’s entry to the war. A big push and advance is expected at any time to celebrate the event & to remind the enemy that war does not pay. All along the lines on the Western front the allies have had a succession of victories & it is believed that greater successes are about to take place any day now.\n\nThis morning I posted to my wife a German cartridge pouch from their equipment. It is made of leather. It contains some empty cartridge cases and some German equipment buttons.\n\nAmerican troops are taking over this camp & large numbers of soldiers were billeted in the trenches around here & their cookers & limbers came into the wood tonight.\n\nThe papers are full of good news every day but it is difficult to get one now. I received two copies of the Southern Cross this evening. Although it was Sunday we did not get a holiday owing to the pressure of work & in the view of us moving at any time I was obliged to make a number of match box covers this evening in order to get rid of them.\n\nI am on second picquet tonight from 11.30 to 2.am\n","52":" 1462.\n\nLast night was very dark but the time soon passed as there was a lot to do. All the teams were late. They were held up on the road for 2 hours in order to let a Battalion of tanks pass. Unfortunately one of the drivers will not come back. George McLeod was killed last night by a shell & one of the mules wounded & also L\/C A, Borthwick slightly wounded. They were taking rations to one of the companies. One of the cooker drivers at H.Q. is reported to be wounded, but it is not confirmed. When we leave here which is daily & nightly expected we are to go to Corbie which is a very hot shop.\n\nI saw L\/C Borthwick this morning. He is shook up a bit. He was walking ahead of the limber when the shell lobed & George when hit fell off & the mules bolted. Borthwick carried him off the road but he died almost immediately & said only Archie. Jim Anderson who was walking behind the limber was severely wounded & taken to hospital.\n\nThis afternoon is wet & muddy.\n","53":" 1463\n\nThere was very heavy rain last night & it is showery today.\n\nSome of the teams that went out last night did not get back until breakfast time this morning.\n\nThe \"Daily Mail\" says that since July 18. the Allies have captured 40 thousand prisoners on the West front. The franco-Americans have straightened the line between Rheims Soissons and have captured Fismes after heavy fighting. There is great depression in Germany at the news of the Crown Princes heavy losses.\n\nAlf Amos returned from leave today.\n\nWe packed up the Lewis Gun limbers this evening also one of the tool waggons in readiness for a move at any time. George Deveroux gave me a lot of Hamilton Spectators which I was very interested in.\n","54":" 1464\n\nOccasional showers & very muddy.\n\nLast night enemy planes were over dropping bombs on the adjoining woods & along the river.\n\nThe French report that they have captured 1,000,000 3 in shells in their advance besides other booty.\n\nThe balance of the limbers with the exception of those in use were loaded today.\n\nWe were lined up this evening & told that the big push is to start tonight at Zero time & we are to move out about\n\nabout dawn. Roll our blankets, tents etc & be in readiness we a to cross Daours bridge, & a prisoner says the enemy has a 15 in gun registered on it, and also on gully where General McLeod was killed. I have all my things in readiness only to pull down the tent and load them up on the limber when it comes in. If the push is successful we will have advanced 12 miles from the front line. Our Brigade is a reserve one to the army core & if all goes well will have nothing to do. If not they will go where required.\n","55":" 1465.\n\nWe were working most of the night and only laid down for a few hours in the open. We had breakfast at 3. harnessed up and were in readiness and moved off when the barage opened at 4.30. It was a splendid barage and lasted for many hours. We passed through Daours Aubigney Fouilloy and Hamelet batteries on either side of us and along the road. The noise was deafening and the smoke was like that of a bush fire spreading over the land and filling the valleys. There was a dense stream of traffic all going forward. We halted\n\nat Batt. H.Q. at 6.30 never meeting with an enemy shell on way. As we were going up light guns were limbered up and advanced closer to the enemy and prisoners were being taken to the rear. We waited several hours at H.Q. & had something to eat when we started to go back to the village of Hamelet for a camp when the enemy started shelling on our right & in front of us. We had a very narrow escape shells falling both sides of us and on the road we had passed over. We passed several bunches of prisoners carrying wounded. At the camp in the evening Earnie Attenborough\n\nhad a bullet through his hat from an enemy plane. The push was a brilliant success in every way, the 9th & 11 Brigades refusing to be relived & continue to push on. Before 8.am they had advanced 5 kilos & was not was not a living man found in the enemies front line trenches. When the horses were fed & rested word came through that the advance was so successful that we had to move further up. On the way through Hamel we were shelled but after we passed through this villiage we were left alone. The enemies front line\n\nand trenches were badly cut up & we saw a lot of booty as we passed through. Engineers had made roads for us and put up sign posts along the way & in the captured village of When we came to the Batt. we halted for the night & slept in our clothes. Our camp is in a deep narrow ravine the scene of a German Battery. There are numerous guns here of 4 in calabre and heaps of enemy ammunition & shells. We passed some German cemeteries this evening.\n","56":" 1466\n\nA beautiful day. Fortunately the weather has kept fine for the push.\n\nThis ravine leads down to a lagoon where we watered the animals this morning under shell fire. Only about a dozen could go in at once & some of them had narrow escapes. The sides of this ravine is lined with enemy dugouts & camps and there are some dead about. Strange to say I never saw any dead yesterday but we did not stop to examine the trenches.\n\nWe don’t expect to stop here long as this gully is under observation and some Tommies on our left are held up & we are subjected to an enfilading fire from the enemy.\n\nThe advance here is held up owing to the stoppage on our left. At the foot of this gully and at the approach is the lagoon there is a village which is not very much damaged but the one we passed through yesterday was a heap of bricks, mortar and rafters. Ruined beyond repair. The streets are blotted out and the ruins are indescriable.\n\nFor the first time today I could see our own shells bursting on the enemies positions.\n\nA terrific barage opened up on our left where the enemy was holding out in a wood & the Tommies could not take it yesterday and consequently held us up. Nothing could live through the shelling and it was not very long before the wood was taken & the enemy retreating.\n\nOur position is a very dangerous one, and we should not be in it - the enemy has direct observation from two baloons, it is the site of his batteries and now our 18 pounders & 4.5 are in position.\n\nThis afternoon he is shelling the wood alongside us. Finally he put shells in the gully & we got orders to take them out. Several shells lobed among the limbers & one between the shafts of the mess cart as we were removing\n\nthe animals. We got out safely with the animals and we were just out when 3 shells lobed opposite the cookers wounding the men and killing A Company’s signaler. When the shelling ceased we came back and hauled out all the limbers which took some time as some were unloaded and a steep hill to go up. Once out of the gully it is all level country and we scattered out and tied up the animals to the limbers for the night again sleeping in our clothes. We were exceedingly fortunate that the casualties were so light as A Comp-any were sleeping on the bank beside us.\n\nThis is the first time the Transports have advanced with the Battl. in an action. It is a novelty.\n","57":" 1467.\n\nAt 4.30 we were up again. He shelled all night especially the gully & the adjoining wood & a main road. Planes were dropping bombs so the night was pretty lively. We removed the horses to a wood for shelter.\n\nYesterday some men & horses were killed & wounded by some Tommy shells falling short & landing in the wood. They were rung up and notified.\n\nHospitals and nurses\n\nwere captured yesterday from the enemy and the number of prisoners taken is variously estimated from 20,000 upwards, 600 guns and thousands of machine guns.\n\nIt is reported that we have taken 39,000 prisoners and 6,000 horses & the French \nand\n have also done well. It is said that the French & Canadians have cut off 2 divisions of the enemy.\n\nI earned 5 francs this evening by taking another man’s horses to water. He is very windy.\n\nOur brigade goes over the top tonight and 6 pack mules & drivers carrying each 2 boxes of ammunition goes with them. We are to remain here tonight although we expected to move with the Battalion. The Battalion will proceed up accompanied by a barrage on each side of them and it is not expected that they will meet with any opposition. Tanks have been over the country & reported it clear of the enemy. This is the first time that pack animals have accompanied the Battalion into action.\n\nSunday Aug. 11. 1918. 1468.\n\nThe weather continues fine. Today is hot & sultry foggy in the morning. The stunt last night was a failure. Every battalion in the Brigade was severely handled by the enemy.\n\nWe lost our Colonel. He was wounded & when was being helped to a place of safety was killed by a shell. Two of our pack mules were killed but all the drivers escaped safely. Our casualties in men were heavy. All the Battalions suffered & had to get help from the 11 Brigade. The 40. Batl. lost 8 pack mules & the drivers all wounded.\n\nLast night the enemy planes bombed all around here & many animals were killed. Our artillery team of 6 mules were killed a few chains from our camp & 1 driver killed & the others wounded. 3 other horses were killed along side of them and 7 drivers in all wounded. One bomb did all the damage. This morning I had a look at them & saw the tail of the bomb. It had the broad arrow on it & English markings. One of our planes flew over at the time & it is possible they were all killed by our own bombs, through the observer making a mistake. In the adjoining wood several horses were killed & men wounded by Tommy artillery a few days ago. There are a lot of mistakes made in this war. An artillery man secured the piece of bomb & was to show it to his own officer with a view to having enquiries made\n\nAll day yesterday & this morning an enemy big gun is shelling the main road on our right. This morning a Battery of big guns pulled in along side of us and they will be sure to draw the enemy fire. They are 6 in.\n\nBill Wilson & G Dodd returned from leave on Friday Aug 9. & the two Haynes went on leave on","58":" This is the first Blighty leave for them.\n\nOur artillery is using the enemies guns and ammunition against them. This evening I had a unique experience. I carried up 3 6 in shells set the fuse, loaded the gun and fired two of them at a village occupied by the enemy. A. Homes fired the third shot. In all 17 shots were fired at this target when I was there. They were all armour piercing shells.\n","59":" 1469.\n\nVery hot today. Our limbers took up the rations last night & all returned safely.\n\nThis morning when watering the horses we stayed over an hour and grazed the animals on the river flats. The enemy again bombed all around us last night but done no damage in our immediate vicinity\n\nWe expect to move further forward to night with our camp.\n\nWhile watering the horses this evening we all striped off and had a swim in the river. It was very refreshing, the water was warm & there was an entire absence of shells.\n","60":" 1470.\n\nAnother fine warm day. Last night the enemies bombing planes were over and dropped a lot of bombs in close proximity to our camp. Last night our Battalion came out of support and are now camped to the rear of us. They have again numerious casualities amongst\n\nthem being Sgt. Linton who was killed along with several other original men.\n\nThis afternoon I received a packet containing 5 letters 1 from Cis of May 24. 1 from Annie of June 2 and three from Lizzie No. 136 May 15. May 26. No.138. and June 4. also same number 138.\n","61":" 1471.\n\nVery hot today. I was on 3rd picquet last night from 2 to 4.30.\n\nEarly in the night enemy bombing machines were over and droped bombs on the adjoining woods. He also shelled the woods and roads about here. Throughout the night there\n\nthere was constant artillery activity on both sides from 3 to 4 it was very intense. At dinner timer today the enemy shelled Susan wood behind which we are camped, in search of guns in it.\n\nWe may shift from this camp this evening\n","62":" 1472.\n\nAnother hot day Foggy early this morning. We did not get orders to shift last night but may do so today. In the recent stunt our Division took 4000 prisoners. A good record.\n\nThis morning three of us were late on parade myself amongst the number and we have to do an extra picquet tonight.\n","63":" 1918.1473.\n\nAnother hot day. I drew first picquet from 9 to 11.30. About 10pm enemy bombing planes were over in large numbers boming woods roads & gullies in search of troops, Transports and artillery.\n\nI had a walk around Susan wood yesterday and saw a number of German 9 in guns and two of their 3 in guns which latter they had rendered useless by exploding charges in the barrels thereby bursting them.\n\nThis evening with Mathews I had another tour around\n\nGerman dugouts, camps etc. and saw many interesting things. They have got some clever devices in box fasteners, and make ropes string, belts and canvas out of paper & it appears to be very effective.\n\nTonight we had an issue of Rum the second issue that the Transports have received in France and the first that I had issued to me.\n\nI received a letter from Kitty Martin this evening July 8.\n","64":" 1474.\n\nDull & cloudy but fine.\n\n I wrote to my wife this evening Letter 138\n\nIn the gully on our way to the river there are stacks of German war material, including\n\nheaps of wire posts for barb wire entanglements. Most of these have been rendered useless before the enemy evacuated by being fused together presumably by the oxygen welding process. A few enemy bombing planes were over last night but did not drop any bombs in this locality. There is an observation baloon stationed near us and the enemy shelled the car to which it is attached for some hours, causing the baloon car to move nearer to us. Some of the shells fell very near to us & prevented me going to the Q. M. Store to post\n\nmy letters. The shells were very big ones and wounded some men near a Red Cross Station.\n","65":" 1475.\n\nDull & cloudy with an occasional light shower. This afternoon the enemy brought down one of our observation baloons in flames. When the enemy was shelling the balloon truck yesterday several of the shells lobed near the Q. M. Stores and the staff bolted. One of them got back at midnight – the Q. M. S. This evening was a half holiday.\n","66":" 1476.\n\nEarly this morning the enemy dropped bombs & again in the daylight after breakfast.\n\nWhen we brought in the horses from grazing on the lucerne plots about half the Transports went to Saily for a bath. It was about 4 miles away and when we got there there was no hot water & no new changes only old stuff. It was 3.30 when we got back rather a late dinner.\n\nYesterday evening one of our observation baloons was brought down in flames\n\nI wrote to my sister this evening.\n","67":" 1477\n\nA dull cloudy day. The enemy was shelling around here on both sides of us and set one dump on fire that we had captured from him in the big push.\n\nSome are complaining of the chats & blame the baths.\n\nThis evening I received a letter from Willie written at Cape B- dated June 17 & one from my wife dated June 24. no. No\n","68":" 1478.\n\nA pretty hot day.\n\nThere is nothing special to chronicle today. I did some repairs to the G. S. wagon today but did not get it finished.\n\nThere were rumours that we were to shift this afternoon but we did not get orders until very late, and it was after 9.p.m when we were ready to move. Fortunately the night was fine but a beautiful moonlight. It was after midnight when we reached our destination which we reached by a long circuterous route.\n\nSome of the party got lost and it was nearly 2 when they arrived. The name of the camp we left was susan wood near Morecourt, & the new one is in a long narrow gully about a mile from the river Somme & is on the opposite bank. We crossed the river on an improvised bridge made by the Engineers since the big push.\n","69":" 1479.\n\nWe soon found camp on arriving here, lay down for a few hours & was up early and had breakfast about 4.30 as we had orders to expect an early move.\n\nIt is again hot today ideal weather for the next big fury. Our artillery was very active this morning.\n\nThe Push this morning is reported to be successful. Only the 9 & 11 Brigades of our Division was in it. The 10. will probably be in it tomorrow. One of them was badly cut up after they gained their objective by attacks from bombing aeroplanes. Unlike the last push the Infantry were not accompanied by aeroplanes. I bought 1 tin of Apricots 2.2. 1 tin condensed milk 1.9 and 2 packets of biscuits 4d. Total 4 francs 5d.\n\nI wrote to my wife this evening. Letter 139\n\nMajor Storey has been appointed colonel of our Battalion in succession to the late Lieut. Colonel Knox Knight and the appointment has met with universal approval from all ranks.\n","70":" 1480.\n\nAnother very hot day As a result of the push this morning which was preceded by a heavy bombardment, over a thousand prisoners were brought in before midday, and some big guns captured. We rolled our blankets & loaded the limbers in preparation for a move forward tonight as our Brigade is moving forward & each transport has to follow its own Battalion.\n\nIt is reported this evening that 1100 prisoners were taken yesterday and 5000 today. There is a lot of\n\ndissatisfaction with the behaviour of the Tommies. They were given positions to hold that our Division had captured & lost it. The 11 Brigade had to capture it again for them. This has occured on several occasions. Tonight it is very doubtful whether we shift tonight or in the morning. Our officer has got no orders yet.\n\nThere is a great shortage of matches and they are unatainable at present at any price. The last issue we got was one box between two men. There is an abundant supply of tobacco.\n","71":" 1481.\n\nWe are still here and likely to remain here for a few days longer. Plans have been altered. \n\nThere was a terrific bombardment last night when I was on picquet between one and 3 o’clock it was very intense.\n\nC and D companies went over the top last night and had 15 casualties.\n","72":" 1482.\n\nA fleet of hostile planes came over last night bombing and dropped several bombs in the vicinity of our camp. Some of the splashes hit the bank of our dugout.\n\nAt midday we received orders to move up closer to the line from Mr Saddler the Brigade T. O. and all the limbers but one & the Buckshee G. S. moved off. I and J.R. Mathews were repairing\n\nthe G.S. & when we got it finished & loaded which was at 5.30 we started and passed through Sailly Lorette, and another village along a very dusty chalkey road bordered on one side by the river Somme and high chalk hills on the other side, then up a steep hill on to the top of the ride and to where the cookers were stationed near the village of Etinchem. We passed two bunches of German prisoners on the way.\n\nThe valley we were camped in was deserted when we left but it was thickly populated in the morning & all the time we were there. Artillery transports Australian light horse and & Infantry transports, some Q. M. stores canteens etc. We were in shallow dugouts in the chalky banks on the back of the ridge nearest the enemy in order to escape the full force of his shells. It is difficult to see a paper now & when we do they are generally a few days old but they are all full of good news of victories over the enemy. It is reported here that the enemy is evacuating.\n\nMonday Aug 26. 1918. 1483.\n\nBill Kiely and I were not long in bed when\n\nit started to rain heavily and it poured through the roof of our dug out, wetting our blankets. We had two waterproof sheets under us and we pulled them out & put them on top which proved effective. Our camp is on top of a high ridge overlooking the river & the village of Etinchem. The ground on the opposite bank of the river rises gradually. Along the river there are numerous lagoons, and a forest of green trees fringing a road on each side of the river.\n\nThere is a cooker here that belonged to the 11th brigade that has one of the wheels blown\n\nclean off it, a few days ago. One of the cooks was killed.\n\nThere is a German ammunition dump alongside of us chiefly S.A.A. stick bombs, egg bombs and veri lights. Several of us detoniated over 50 stick bombs and threw them into the lagoon to get fish but we only got a few for our trouble.\n\nThis evening one of our observation baloons was brought down in flames by a hostile plane.\n","73":" 1484.\n\nA dull cloudy day. This afternoon we packed up and loaded\n\nthe limbers in readiness to move from this camp on the banks of the Somme near Etinchem Village, because the Battalion came out of the line last night being relieved by the 9th Brigade. We left about 3.30 and went through Bray on the outskirts of which we pitched our camp.\n\nWednesday Aug 28. 1918. 1485\n\nDull and cloudy with occasional showers. Yesterday evening the enemy shelled the river and flats on the edge of our camp. There is a large German Dump here containing Engineers stores etc. and presumably he was in search of it.\n\nOur dugout holds 4 and was already made and covered with German iron and the sides with German sand bags.\n\nI was twice down at Fritzes dump today. It extends along the railway on both sides of it & covers some acres. There are numerous sheds & heaps of war material and the ashes of many that the Hun burned before evacuating. There is one German truck on the line filled with ammunition. There is a heap of bar iron neatly assorted in sizes containing at least 10 tons and a stack of half inch round iron for concrete works. There is a shed filled with lime & cement, there is a\n\nhigh stack of timber for trenches and dugouts extending for several chains along the railway, while there are innumerable heaps of heavy timber scattered about and also spars, and a huge stack of scrub timber which the enemy uses for lining his trenches. There is an enormous stack of wire probably 50 tons or more and numerous stacks of wire netting, another shed contains sand bags made out of woven paper while still another is filled screens to hang across roads to block the view. Another shed has been a workshop for it is fitted up with vices and anvils of French make & probably took from the villages. In the ashes of the burned heaps & sheds there are tons of bolts of every description thousands of picks trenching tools, axes, adzes and a great collection of blacksmiths and fitters tools and some half dozen huge French anvils. There are saws, hammers chisels punches, braces & carpenters tools all burned as well as shovels and a variety of other tools. Many of these are of French and English make take in some big German push last March when the Hun broke through and overran all this country in the Somme area and the Tommies were in headlong flight leaving everything behind that they could not\n\nor take with them. Another shed burned to the ground contains the remains of several Minnie guns, and a varied collection of war material. Several other sheds that are intact and apart from the others contains shells and various kinds of ammunition. There are some thousands of pounds worth of good material untouched as well as thousands destroyed or burnt, a lot of which can be used again by retempering & fitting new handles. Most of the sheds were mined & it only required the pull of a string to set the friction fuse in motion, and the whole lot would go sky high. But so great was the haste of the wily Hun to make himself scarce that he had not time to blow them all up. This morning an engineer officer was going around cutting all the mine wires he could see. Parked up in a neat row was a collection of French farm carts and vehicles that the Hun had purloined from the invaded people of the district. Now that the tables are turned the German is in hasty retreat and the British, French and Australian & other troops are in hot pursuit. Such is the fortunes of war. Today one of our Brigades advanced several miles before midday. Where there is heavy fighting to do the Australians are\n\nalways pushed into it and the English papers relunctly give them very little credit for it. They have won position after position and handed them over to the Tommies who have lost them & the Australians have had to go in again & take them the second time. There is no mention of this in the English papers but an eulogy of the fighting Tommy. This is causing a good deal of feeling among Australians who frequently tell off the Tommies to their faces. But the fault lies with their officers who are far inferior to either the Australians French or German. Of course there are some brilliant exceptions. None of the foregoing remarks apply to Scotch or Irish troops who are out to do or die. French papers in contrast to the English give all credit to the Australians and BilJim has a gay time when on leave in Paris.\n\nThere are many soldiers visiting the dump and they are taking away the things they require some are after souvenirs and some are wanting tools sandbags sheet iron etc. \n\nThursday Aug 29. 1918. 1486.\n\nA fine day. Heavy frost last night. We may move today. There was a very heavy bombardment last night by our artillery which are keeping pace with the advance & getting into position.\n\nThe observation baloons are also advancing almost every day now.\n\nWe packed up and left Bray camp about 11. a.m. and travelled East passing many enemy shell dumps on the way and one dead German. Then we passed through Suzanne village which is only slightly damaged by shells & that only recently. When the Germans were driven out they shelled the village. We halted on the outskirts of the town behind a chalk bank and started to make dug outs to sleep in. After dinner we got word that the army had gone through Peronne – and that we were to move forward to keep\n\nin touch with our battalion. At 4 this afternoon we continued on our journey from Suzanne camp and ascended a high ridge which forms one of the numerous bends of the Somme. It was with difficulty we got up and several teams got stuck & had to be assisted. We crossed over the ridge and descended its high precipitous banks by a zig zag road and followed the bend of the Somme at the foot of the ridge until we came to Curlu where we halted. On the road we passed several dead Germans on the side of the road\n\nas well as some of their horses. Curlu is levelled to the ground except a small portion of the Church that is standing. There are numerous Batteries all around and roads. We were not hear very long when the enemy started to shell the hill in front of us about 300 yards away & kept it up for over an hour. There are a lot of German dug outs here some of them very smelly & some in good condition. There is one excellent dug out built for officers & secure against small shells. 5 of us slept in one that was only half finished and was very comfortable, & fitted up with double beds one above the other. It had only a corrugated iron roof. The enemy is putting up some resistance and three wounded were carried in early this evening.\n\n Friday Aug 30 1918. 1487.\n\nA dull cloudy day.\n\nThree wounded including Captain Clairborugh walked in this morning about 7. a.m. Early this morning the roads were congested with artillery limbers bringing up shells to the front. Since we came into territory occupied by the Germans a feature of the sign posts is that are notices are painted in German. Many of the words have resemblance\n\nto English & are easily understood thus – Laegor Park.\n\nThis morning I received a packet of 5 letters, one from Cis and 4 from my wife No. 139. May 9. 140. June 15. 141. June 16. 142. June 18. Cis letter was dated","74":" No. 15\n\nYesterday and today a lot of prisoners have been taken past here they all seem to be a fine lot of men. Prussian Guards they are fresh troops and volunteers to stop the Australians.\n\nOur Battalion has suffered very heavily during the past few days. It is said that there are only 15 fighting men left in A. Company\n","75":" 1488.\n\nA dull cloudy day with occasional light showers. Jim Hammett the Pioneer Sargeant had his leg badly fractured yesterday at B.H.Q. The papers came up yesterday and are full of great victories all along the front from Arras to Rheims, the French capturing Roye and Noyon.\n\nSeveral batches of prisoners were sent to the rear this morning and again in the afternoon. Bil Kiely who is up at Headquarters with a limber had one of his mules wounded today & brought it down here this afternoon. This is the second mule that was wounded up there.\n\nLast night & the night before we had an issue of rum- a record.\n\nI am first picquet tonight 9 to 11.30 Things were very busy Limbers were going out to make preparations for the Battalion coming out tonight.\n","76":" 1489\n\nSome of the companies were very late in arriving here. In fact B Company did not get in until morning, we gave them our beds, as they have had practically no sleep or bed for over a week. There are only about 60 men left in the Battalion. They have had one of the roughest spins ever they had in length of time. Officers & men look a wreck this morning.\n\nSeveral small parties of prisoners went down the road this morning without an escort and about 150\n\nbefore midday on their way to the rear. The prison cages are full up.\n\nThis month last year I was at Bleakin and we all thought that the war would be finished before another year. It is still raging fiercer than ever but the tide is turned in our favour and I think we are at the beginning of the end and possibly peace before this time next year.\n","77":" 1490\n\nA dull cloudy day with threatening rain. A large number of prisoners went down the road this morning. – 140 in one batch and again this afternoon. It is reported that 1100\n\nof the Kaiser’s Prussian Guards have been captured.\n\nIt was reported that Peronne was captured yesterday morning. I saw several Hindooes today in their turbans driving horses.\n\nWe were issued with a weak rum ration tonight\n","78":" 1491.\n\nA dull cloudy day but no rain.\n\nA Scotch Battalion came here a few days ago and went into the line. It was their first fighting in France. They came from Egypt.\n\nI saw a Hindoo transport this evening accompanied by two Hindoo officers.\n\n I wrote to my wife this evening. No. 140 Green envelope. 163\n\nEnemy bombing planes were over last night & the night before but dropped no bombs close to us. This evening he shelled the ridge and around our camp, with a long range gun.\n","79":" 1492.\n\nA fine day but cloudy.\n\nYesterday it was 2 years and 3 months since we left Victoria. We are to remain in this location for about a fortnight. We and also the companies are better fed than usual We got some cake from the comforts fund tonight for tea and extra rations, they evidently want to fatten us up a bit.\n\nThe baloons are now shifted up a long way ahead of us & the front\n\nline is a long way advanced.\n","80":" 1493.\n\nFine but cool & cloudy. Yesterday we shifted our horse lines across the road to a German stable that was lately occupied by some of our artillery transports. It is on the edge of marsh that forms part of the river here.\n\n14,600 prisoners have been taken since the first of the month.\n\nThe limbers were loaded & shifted to the stables today & in the evening orders came through to move forwards. We got away after tea. The roads were very dusty, in fact suffocating for there was a lot of traffic. Presently a storm blew up. Thunder & lightning & heavy rain which lasted half an hour. Many were wet through I had an oil skin in the limber. On the way the Perch pole of one of the cookers broken when crossing the railway near Hem & had to be left behind. We reached our destination after 8 p.m. & camped in an open field, pitching a cover against a bank alongside some Scotch & Welsh burial parties. Fortunately the rain cleared & the night was fine.\n","81":" 1494.\n\nA fine morning. Yesterday when we ascended the hill coming from Curlu we could see the smoke of about a dozen big fires on the skyline. The heavy rain failed to put some of them out.\n\nThe enemy was evidently burning dumps & villages before evacuating.\n\nC. Handcock of the Pioneers & I repaired the Perch pole of the cooker today.\n\nThe name of this camp is Clery-sur-Somme and we will probably stay here tonight. Today has been very hot.\n\nOn the main road there was a continuous stream of traffic to the front all day long & far into the night. There were troop, limbers, lorries tractors & later motors two deckers loaded with troops (58 Batl.) all going to the front.\n","82":" 1495.\n\nRevellie 5.30\n\nWe left Clery-sur-Somme at 8 am this morning and travelled East passing Peronne on the Northside over a high ridge & stopped for dinner about a mile North of Courceley. On the road we passed a large number of dead horses. Peronne is a large town surrounded by hills and there are many large factories in it which are considerably damaged by shells as well as other buildings.\n\nThe enemy has shown considerable aerial activity today & yesterday. His reconnerating planes have been very presistent & game with it.\n\nIn the evening we left Courcelles accompanied by the Battalion & went in an Easterly direction\n\nnear the Somme until we came to Tincourt where we halted for the night. The Battalion being camped alongside of us and went into the lines before morning.\n","83":" 1496.\n\nA fine morning.\n\nCapt. Toule was severely wounded last night.\n\nThis morning the enemy shelled the Village alongside of us. There is a big railway siding here and a lot of enemy material. In a wood I counted 156 German limbers, wagons cookers and field bakeries. All in need of repair and were evidently dumped here for that purpose. There is a new double line railway built for war purposes \n\nmost of the joints in the line have been blown up with slabs of gun cotton. He did this to the line at Clery-sur-Somme.\n\nI am on 3rd picquet tonight from 2 to 4.30.\n\nToday one of our horses was stolen at midday. Later in the day it was found in a horse artillery limber driven by Tommies. They had the horse camouflaged by painting a star on his forehead black, clipping his fetlocks and cutting No 118 on the hairs on his rump. Never the less driver Kiely recognised him & claimed the horse. They at first refused to give him up but eventually did so.\n\nThere are a lot of ammunition in dumps & empty shell cases\n\naround this village & in the next one Bouchy just across the swamp & railway line. The Village church is a heap of bricks stones & morter. It has been a large & beautiful building before the war as the chiseled stones & fluted pillars show.\n","84":" 1497.\n\nThere was a lot of rain in the evening yesterday but fortunately it cleared up last night. A large fleet of enemy planes were over last night \nshelling\n bombing back areas. It took them over an hour to pass here. The sky was lit up with searchlights & they were met with machine guns & Archie fire. The Battalion is expected out at any time, and corps relief is overdue. Yesterday I received a letter from my wife No. 144 dated July 1 and one from Douglas. Tonight I got a copy of the Bulletin sent to me. May 16. There was an issue of rum & tobacco tonight.\n\nIt has been cold all day with rain.\n\nBil Grey went on leave this morning J.R.Mathews & McDonald a few days ago. They are all original men & this is their first Blighty leave. But McDonald did not come over with the Battalion.\n","85":" 1498.\n\nA wet miserable day.\n\nWe left Tincourt camp this afternoon and retreated about 5 kilos to the rear and camped\n\nat a ruined village known as Bussu. The Battalion comes out tonight. This is the first time that the transports have went back since the big push started on Aug 8. We will be here only for a few days when we expect to either go forward or go out for a rest as circumstances permit. There are numerous dugouts here but like Tincourt most of them are mined. The enemy is very ingenious in setting mines of all descriptions & camouflaging them to make them most innocent looking. A burial party here saw some dead Fritzes and started to bury them. When they moved the bodies a spring\n\nwas released & a terrific explosion followed killing several & wounding others. This camp is most inconveniently situated for water. The horses have to be taken to Courcelles on the Somme for water about 2 ½ or 3 miles away. Last evening it was nearly dark when we got back & we had to pitch our tarpolon after night in a shell hole. There are a large number of bomb holes around & many dead horses. The enemy bombed this village again tonight.\n","86":" 1499\n\nCold & cloudy with occasional showers.\n\nThe sergeant & one of the drivers went to Curlu for blankets & were out all night\n\nThe casualties for the Batl. since the big push were 49 killed & some 4 or 5 times that many wounded.\n","87":" 1500\n\nA cold miserable day with high winds from the S. W. We were wet through returning from watering the horses this morning, and our clothes had to dry on us.\n","88":" 1501\n\nCloudy with occasional showers. The weather has moderated & the wind has fallen.\n\nThere are presistent Rumours that the Battalion is to be broken up straight away. These rumours are in constant circulation all day they started last night. It is generally believed that there is some truth in it. This cutting up of the Battalion is owing to lack of reinforcements.\n\nComing out of the line a few days ago the 39 Batl. was badly cut up by the enemy planes observing them probably by the glow of cigarettes & dropping bombs on them. One company suffered badly.\n\nThere was a kit inspection this afternoon and shortages taken as well as exchanges.\n\nThere was a special parade this evening & Mr Chapman in the absence of Mr Boyland who went on leave yesterday read out two notices. The first dealt with some victories by the Americans\n\n& French who captured 10 prisoners & is it believed have cut off two German divisions. The second confirmed the rumour about breaking up the Battalion. The two strongest companies are to go to the 39. The two weakest to the 38 & 40 pending their absorbing by the 39th. The transports will go to the divisional train & from there will be divided between various units.\n\nAll ranks are greatly cut up about the breaking up of the Battalion & it is the sole topic of conversation.\n\nAll the companies held\n\nmeetings of protest & appointed two delegates to wait upon the Colonel. The Transports also sent two. The Colonel was very sympathetic & explained that he had done all that was possible. He interviewed the Brigadier & the Divisional Commander & also sent a letter of protest to Mr Hughes in London. The Battalion is being broken up on the grounds of economy to save a Colonel & Adjutants pay as well as the transports. The Colonel explained to the authorities that he was willing to act in a subordinate position to keep the Battalion going & with a reasonable rest their strength would be augmented.\n\nby a large number of men returning from hospital. The esprit-de-core that had taken nearly 3 would be gone in a day if the Battalion was disbanded & that would be no light matter. Another reason was that the Battalion done 8 stunts in the recent push to the 40th 6 stunts and 4 each to the 38th & 39, also that the two latter Battalions refused to go in the line. Furthermore in memory of the fallen comrades & also in memory of the late Colonel the Battalion should be kept going. As a fighting unit the 37. Bat. has more gains to their credit than any other Battalion in the Brigade and their general efficiency and drill is superior.\n\nLater on mass meeting of men & N.C.O.s was held & one of the delegates Private P O’Connor explained all that had been done and the men were unanimous in sticking together & would refuse to move as seperate sections when the breaking up order came through & Transports would refuse to move the mobilisation stores. As a Battalion they would carry out all orders,\n\nbut as separate units they would point blank refuse to move.\n","89":" 1502.\n\nLast night was clear & moonlight consequently it was a good night for the enemies bombing planes to come over. They came in large numbers, and 5 of them were picked up by our numerous searchlights & received a hot fire from numerous machine guns & a few archies. Two planes were brought down in flames. One was very high up & making for back areas he was met with a barrage of shells & machine gun bullets, but persisted in going. He was hit & came down with all his bombs which exploded on striking the ground lighting up the sky in one vivid flash for miles around. The other had dropped his bombs & was making back when hit. Several of the others dropped their bombs & returned home when caught in the barrage. They both fell some distance from our camp. The pilots & observers in the planes must have been burned to a cinder when they fell. Shorthand: I wrote to my wife this evening. Letter 141.\n\nWord came through yesterday that Capt. Toule died of wounds in hospital. He had been wounded 3 times before.\n\nWe were informed today unofficially that that the C.O. had been relieved of his command. Later we heard that Major Robinson who had been away temporary in charge of the 40. Batl. refused to take command. The Batl. is determined to stick to Colonel Storey. All the officers are in accord with the men but cannot say or do anything in the matter but believe that the men will succeed.\n\nThe lines have been repaired and the trains are running every day & night now both on the light & heavy lines bringing up war material.\n","90":" 1503\n\nA fine day, warm in the evening\n\nEarly this morning there was a terrific bombardment on our left.\n\nThe Battalion delegates went over to the 38 Camp this afternoon to interview Mr Hughes who is to visit there today.\n\nThere are rumours of many brilliant French & American victories in the South. This afternoon is a half holiday. I packed up a parcel to my wife containing 1 German haversack and a paper protector for enemy shell nose caps.\n\nWe had an issue of American & Australian tobaccoes from the Comforts funds today. Our delegates after chasing all over the country failed to find Mr Hughes.\n","91":" 1504.\n\nA fine day, rather warm\n\nWe had an issue of lollies a handful per man from the Comforts funds today. Enemy planes were over last night & at least one was brought down in flames. I am on second picquet tonight from 11.30 to 2 a.m.\n\nTuesday September 17. 1918. 1505\n\nFine but cloudy with S.W. wind. Enemy planes were over last night but not in force. Some of them were caught in the light & turned with machine gun & archie fire.\n\nThere was a very heavy shower accompanied with thunder & lightning when I was on picquet. It was bright moonlight when I went on and pitch dark when I came off. Later in the night there was a tremendous storm with high winds thunder and lightning, with torrential rain.\n\nThis morning when returning from watering up, the mule ridden by J.T. Ferguson slipped & fell on his leg, he got caught in the stirrup & was dragged a few yards. He was bruised but not seriously hurt. The roads are very slippery since the rain & the country is very hilly. I estimate that we ride about 5 miles every morning & evening going to and returning from water at Courcelles which is the nearest watering place here. There are some deep wells here but no convenient means of drawing the water. There is also an oil engine & pump on a bore but it is not in working order. It requires\n\nextensive repairs as some parts have been removed & others are broken. The water carts go to Doingt for drinking water. Yesterday evening I received a packet of letters, one from Cis a postcard view of J,Norringhem & 2 letters from my wife No. 145 dated July 7, 146","92":" & one from Annie I wrote to my wife this evening. Letter 142. I sent her a German haversack and a sample of German cloth made up of paper .\n","93":" 1506.\n\nThere was some heavy rain last night but today it is fine and cloudy.\n\nShorthand symbols: I wrote to Cis to day.\n\nThis evening while watering the horses we saw the enemy bring down two of our observation baloons in flames. And we also saw between 600 & 700 prisoners march through Courcelles on their way to the rear. Behind them were 37 wounded prisoners marching slowly along. While we were away about 300 prisoners passed through Bussu. There was a big bombardment last night & enemy planes made repeated attempts to come over but were driven back by a hail of bullets.\n\nThis evening I gave in particulars to C Company office about my Blighty leave. Several more batches of prisoners passed along the road this evening. Notices have been published at the Orderly Room concerning big victories by the French & British last night & early this morning. It is generally believed that Foch’s big push has started. It is\n\nalso rumoured that 74 planes bombed Berlin & 70 returned. The horse lines were shifted yesterday to a sunken road to guard against bombs.\n","94":" 1507.\n\nFine but cloudy & windy. It is rumoured that the Battalion is likely to go in the lines again.\n\nSome more prisoners were sent to the rear today. There are presistent rumours that the Battalion will receive their breaking up orders tomorrow. Colonel Storey is going to the base tomorrow morning. Major Robinson is in command.\n","95":" 1508.\n\nShowery today. The Brigadier McNicol addressed the whole Batln this morning & expressed his sorrow on returning last night from leave to hear that the 37. Batln was to be cut up and advised the men to obey all lawful commands however unpleasant.\n\nAt 5.30 this evening there was another meeting of the whole Battalion and it was considerably stronger in returned men coming back from Hospital. There were several speakers in favour of confirming the decision arrived at before & one L\/C against. A division was taken & it was almost unanimously agreed to stand firm & refuse to move unless as a\n\nas a Battalion. The Sargeants will hold a meeting tonight to consider their position. Sargeant Partridge who has been expecting to go to the O.T.S. at Cambridge went away this afternoon.\n","96":" 1509\n\nCold & windy today. All the attached men in the Transports received orders to report to their respective companies at 9. am this morning. I don’t know whether I have to report to C Company or H. Quarters. Everyone is on the Que Vie in expectation of something doing.\n\nI reported to C Company at 9.30. Capt. Cooper addressed the men and\n\nstrongly advised the men to obey all moving off orders. Otherwise they would only be injuring Colonel Storey & probably a charge of inciting to mutiny would be laid against him if the men refused. The men held a short meeting & decided not to go. Later we fell in & marched to the parade ground and Major Robinson addressed the men on the same lines as Capt. Cooper. The usual parade ceremonies were gone through. Finally the men shouldered arms, formed fours right turned & at the order to quick march not a man moved. Each company was tried in turn with the same result. Finally the platoons were tried\n\nand all remained firm. Then the officers were ordered to move & they all moved to a man. Then the N.C.O.s & men. Most of the sergeants & a few corporals and about a dozen privates including myself fell out on the right. Then there was a long wait to give the men time to think. Finally all were ordered to fall in again & the same procedure was gone through again with the same results. A message was sent to the Brigade & the Brigadier, Brigade major & the staff Captain appeared. The Brigadier addressed the men expressing his disappointment, explaining the circumstances concerning Colonel Storey & why he was relieved of his\n\ncommand. Finally he gave instructions to Major Robinson to give the order to the officers & N.C.O.s & men who fell out & were now of the 38 Battalion & those who wished to fall out & march off to the 38. Battalion and the remainder would be given to 4 p.m. to go to the 38 & 39 Battls. We marched off Major Robinson leading & reached the 38th about 1.35 & had to dinner & were allotted huts in the afternoon.\n\nLater I heard that the company that was to be cut out in the 39 to make room for A & B companies refused to be cut out.\n\nIt was intended to keep the men of the 37 in the\n\nother two Battalions in seperate companies with their own officers & N.C.O.s\n\nWe heard this evening that General Jellibrand met the delegates and had a long talk with them, resulting that they would be supplied with rations and they were to carry on as a Battalion. Also that the Padre bought a large box of tinned fish to give the men their dinner. The men had a concert & meeting in the evening & the padre was vigorously cheered.\n","97":" 1510\n\nA fine day. We are all to return to the 37 today. The battalion is to be rebuilt & strengthened. Several including myself do not want to go back but rather remain here with this Battalion.\n\nThe 38. Battalion is camped on the side of a ridge facing the ruined village of Allaines.\n\nEnemy aircraft were very active this morning. There was plenty of rain this evening & the ground is very muddy.\n","98":" 1511.\n\nThis is my birthday. I am 43 today.\n\nIt is fine today but cold and windy.\n\nThe companies here are having bath parades in fighting order. The sun crosses the line today going south & this moon is the harvest moon.\n\nI put in an application to the C.O. of the 38 Batln to remain here & to be transferred to the Transports as a farrier.\n\nThe Potts brothers also put in applications for transfers to the Pioneer Battalion. Later we were told to hold the transfers for a few days as at present the C.O. could do nothing until it was decided what was to become of the 37th.\n\nI was at a concert tonight Sgt Westbrook gave an exhibition in boxing & showed the various hits and their counters.\n","99":" 1918. 1512.\n\nA beautiful morning. We heard a rumour last night that the authorities had decided to cut up the 37th at all costs & that the men would not get a win after all. This cheered up those who came here, many of whom coming & were very anxious to get back. There has been great victories on 3 fronts. The Western, the Balkin states and in Palestine where the Turkish army is anilated & 18,000 prisoners taken.\n\nThe 38. Batln is preparing for another stunt today.\n\nThere was a heavy bombardment last night and again this morning. It is reported this evening that St Quintin has fallen to the Yanks. I had a bath in a big dam this afternoon. The enemy brought down 2 of our baloons in flames today.\n","100":" 1513.\n\nA dull cold showery day. I went for a walk to Moislains this morning with\n\nJ.Shanahan and Jay Potts. There is a Y.M.C.A. there and we had a cup of hot tea but could get nothing else. Moislains is a ruined village, with a large church now smashed up. Their is a big cannal not finished running past Moislains and through the valley in front of this camp. All the locks and bridges have been blown up by the Germans as well as the railway. The railway is being repaired by the Canadians who are sawing off the broken ends of the rails and putting them together again.\n\nYesterday evening I was at a Canadian on the outskirts of Peronne to get a paper which gave more details of the victories in Serbia and Palestine.\n\nPeronne is now full of troops and there are numerous trains running in all directions with war materials and thousands of motor vans & many steam waggons are on the roads. There are many Americans here as well as other troops. There was a heavy artillery bombardment this morning & again today.\n\nI was at a concert tonight which had a few Americans & Tommy performers on it & the audience was American English & Australian\n\nwe received orders late tonight that we had to move out at 8. tomorrow morning & rejoin the 37 Batln.\n","101":" 1514\n\nA fine morning. Left the 38 Battalion camp at Allaines and marched to the 37. Batt at Bussu arriving at 9.30. The Battalion was carrying on as usual. Two of our baloons were brought down in flames this evening.\n","102":" 1515\n\nA fine morning. We are to move forward this afternoon. There was a constant artillery bombardment of the enemy’s position last night.\n\nThe boys are naturally very jubilant at their victory up to date. Whether they will finally succeed remains to be seen. It is considered certain that one Battalion in the Brigade will be cut out. This is a general order throughout the A.I.F. It is quite possible that it will not be the 37th. There are many things pointing to this conclusion. Yesterday one of the first things I heard on arriving here was that the Brigadier together with the Brigade Major & the Staff Captain had been relieved of their jobs & others put in their place. This was not done without a good reason. There is something wrong somewhere.\n\nLeft Bussu camp\n\nat 20 to 3 this afternoon and arrived at our destination in about an hours travelling & camped on the road midway between two little villages. The Battalion will follow on tonight.\n","103":" 1516\n\nA cold bleak morning. I was on first picquet last night from 9 to 11.30. There was a lot of traffic on the road last night mostly limbers. The 34 Battalion also passed through together with there Transports. It was after 3. o’clock last night when the cooker teams arrived here.\n\nThe name of the village on our right is Longavesnes and on the left is Liermont.\n\nAt watering up time this afternoon we had an exciting time. We had just started to move off to the watering place considerably over a mile to the rear when the enemy started to shell the road with heavies from a long range gun. The first shell fell near the Q.M. Stores & the A.S.C. horses there broke their fastenings & bolted. Other shells fell each side of the road and we made a wide detour to one side. The enemy kept on increasing his range following the road up and several pieces fell among the horses, one big piece\n\nlobbed up the horse I was riding without doing any harm. On the return journey he was still shelling but we got past safely!\n\nThere was another big bombardment last night & again this morning. It is believed that there is to be a big push tomorrow morning.\n\nThe roads day and night are covered with traffic of every description going both ways. His baloons are up but a long way back.\n\nSunday Sept 29. 1918. 1517.\n\nLast night I went to bed early and was only in it about 10 minutes when Mr Chapman came up to tell the Sargeant that 4 men with pack mules were to proceed to Battalion Head Quarters with two boxes of ammunition per mule.\n\nEarnie Attenborough, George Marshall, Sam Smith and I were selected for the job. We harnessed the mules loaded them and got away soon after 9 p.m. We had about 5 miles to go and reached our destination in a smashed up town without any mishap. We unloaded the mules and stood by until daylight talking to the cooks & doing odd jobs to pass away the time. At 7 we moved off with the mules following H.Q. details. The Battalion had proceeded us by about half an hour. We travelled\n\nfor over two hours through paddocks for the roads were too congested winding in & out among shell holes & barb wire entanglements and old trenches until we just about caught up to the Battalion. On the way we passed through rows upon rows of big guns, howitzers and 15 pounders. We then halted and some tanks and armoured cars came up and they were spotted by the enemies baloons who had a good view of our position and we were shelled right and left in front and behind. None of the H.Q. were hit showers of machine gun bullets fell around us & Lieut Issuewood was hit in abadomen.\n\nHe pulled the bullet out with his fingers. I was there when the doctor dressed & sent him to the station. As the doctor was dressing it shells fell all around it. We shifted our position some distance from the Batteries and remained in shell holes until dinner time. Many shells lobbed close to us & we had some fortunate escapes. Later we shifted to a sunken road fed our mules & unloaded the packs to give them a rest. Here I wrote these notes admid the din of battle. The barrage opened about 10 past 10 and continued with great intensity until about 10 a. m. when the smaller guns\n\nceased but the big guns kept up a tremendous bombardment all day long. Large numbers of wounded are continually going to the rear. They are mostly Americans. The 37. Batln. Has also many wounded. Further ahead I am told 6 tanks were blown up by a mine this morning. An enemy plane was over about 9.30 dropped lights over the tanks as a signal to their artillery but fortunately it was staunkered before it got back and delivered its message.\n\nWe spent all the afternoon and kept the mules in the shelter of a disabled to save them from machine gun bullets and schrapnel & shells\n\nI saw Major Robinson & he told us to stand by until we were relieved & guides were to show the transport officer the Batln position.\n\nThroughout the afternoon we were exposed to frequent blasts of machine gun bullets. The Battln had 15 casualities including 4 officers one of whom was killed viz. the Padre Capt Goller, the most popular man in the Batln.\n\nThere are a large number of death belonging to other units strewn about the paddocks & in the shell holes.\n\nThere is a nest of machine gunners that has not\n\nbeen wiped up & they are causing all the damage.\n\nThere are over a dozen tanks staunkered many of them were blown up by the mines set in the wire entanglements. These mines consisted of our own plum puddings set in the ground with the cap just level with the surface and when anything went over or struck it they would explode with sufficient force to put a huge tank out of action.\n\nI forgot to mention that this morning we were all slightly gassed by the enemies shells our troats & mouth & noses were hot & dry & burning but the effect wore off\n\nin a few hours.\n\nMonday Sept 30. 1918. 1518.\n\nWe camped in the shelter of the tanks last night but about midnight it started to rain & we had to get inside & remained there until daylight when we found that the Battalion had shifted.\n\nWe lit a fire boiled some water we found in a petrol tin made some tea which we found in a tank and had a good breakfast. But we had nothing for the mules so decided to stack the ammunition and return. On the road back we saw many dead Americans and Tommies & some Australians. We also\n\nheard that the Quarter master Mr Wilkins was killed last night when going up with the ration party. We found the Transports in a large village called St Emilie not very far from the village of Rossoys and our journey took about 1 ½ hours.\n\nThe mules when fed and watered had to be sent back & as there were only 3 men to relieve us one had to return which was decided by drawing for it, and George Marshall drew it. I also volunteered to go back with him as they were short of men but Mr Chapman said No, as he wanted to have a talk with me about something.\n\nAfter dinner he came and saw me and read me a telegram he received from H.Q. informing me that my Father had died suddenly at Cape Bridgewater on Sept 3. He expressed his sympathy and needsly to say I was greatly upset and surprised. I at once made up my mind to apply for leave to return to Australia.\n\nJ.R.Mathews showed me a good dug out and helped me make comfortable. He was sympathetic in my trouble and I am writing todays notes in it, also the later\n\npart of yesterdays notes. I will try and have a sleep this afternoon feel tired, weary and worn out & degusted.\n\nTuesday Oct 1. 1918. 1519.\n\nA fine day.\n\nThe name of this town is St Emilie and we are camped near a sugar refinery. It is a heap of ruins and is one of the third largest in Europe. It is owned by an English firm – the makers of Lyles Golden Syrup which is often issued to us. The machinery is French and there is an engineering works attached to it. It has a lathe, the bed of which\n\nis 8 yards long with a gap large enough for turning flywheels.\n\nThe paper (Sunday’s) is full of good news all along the Western front.\n\nThere was an issue of rum last night which I had in bed & this morning we had chocolate, tobacco and cocoa given by the Americans who have a large camp in the factory and we much appreciated it.\n\nI received two letters from my dear wife today No 148. July 28. & 149 Aug 1.\n\nTonight I received a cable from Kittson stating \"father died suddenly,","104":" Kittson\"\n\nThe cable was dated Sept. from Lower Cape Bridgewater.\n\nThe cable Mr Chapman gave me was an army one with the same words and signed Wilson.\n\nThe Americans have been burying their dead here all day. In one open grave I saw 17 bodies buried at once. A short ceremony was held over it. A few minutes another open grave was filled with bodies all sown in canvas & another short ceremony held over it by two American chaplains. In both cases the graves were a continuation of\n\ntwo long graves. The enemy brought down one of our observation baloons this evening\n","105":" 1520.\n\nVery cold. There was a white frost this morning.\n\nThe papers are full of great news today. Bulgaria surrenders unconditionally to the Allies. Hostilities suspended. Armistice signed at Salonica on Sunday evening. On the Western front there is a succession of victories. It is only a matter of time when Turkey must give in.\n\nWe have two German horses in our lines to day that our boys captured yesterday. They are two out of 6 that were brought\n\nup to remove a gun. The Americans finished burying their dead today. A large gang of men have been employed on it.\n\nIt is officially reported in an English tunnelling coy that St Quentin has fallen & that our cavalry has broken through on the flanks of Lile. There are also Furphies about the landing of troops at Ostend.\n\nWe have great difficulty in getting water for the horses here. The well the only one we can find has run dry and many hundreds of horses had to be watered at it. Tonight water had to be carted in a tank to them.\n\nThe Enemy\n\ndropped bombs on Peronne last night and killed 4 and wounded of our band who were there resting.\n","106":" 1521.\n\nDull & cloudy.\n\nThe Battalion came out of the line last night about 12. We are to leave this town – St Emilie at 11.30 today. We got away about the appointed time and travelled along a road very slowly as it was congested with traffic for several hours passing through LonganesVes and to our old camp near the village and halted in a gulley several kilometres beyond near Aizecourt-le-basi\n","107":" 1522.\n\nA fine morning cloudy.\n\nReveIlie 6 a.m. We watered up first thing & then fed the animals in preperation for an early start. But later we were informed that we were to remain in this camp today to clean up. I saw 21 aeroplanes cross over the enemys territory today in one squadron.\n\nThe weather was bitterly cold this evening with W. wind & we thought it was going to snow.\n\nYesterdays daily mail says the Germans have withdrawn on a wide front near La Bussee canal & the British\n\nare following up closely. Whole of St Quentin occupied. The Cambrai fight still raging. Hun throw in new divisions. Damascus is won & the first troops to enter were Australians.\n\nThe Brigadier was up to here this evening. He is yet in charge of this Brigade.\n\nCharlie Gillespie returned this evening with a draught. He was wounded at Heily soon after we came to the Somme.\n","108":" 1523.\n\nCold & frosty this morning. We watered the horses at Livermouth and at 11 a.m.\n\nthe bulk of the Transports including all the Limbers 3 of the cookers went off by road. Later the pack mules & hacks two water carts & cokers went to Peronne which we reached before 3. We had some dinner there & then entrained with the Battalion & a portion of the Transports from the other Battalions. I had 1 pack mule & 1 horse. It was 5.30 O’clock before we got away from Peronne.\n","109":" 1524\n\nWe reached our destination soon after 12. O’clock. I was asleep when we got there in one of the horse trucks. There was a big railway yard but it took several hours to get all the Transports unloaded. Capt. Ceruty\n\nwas in charge of all the Brigade Transports and accompanied us on the journey all the way. The name of the town was Pont Rheims and it was after 3. a.m. before we got away. We passed along a good metal road for about an hour with a keen cold wind blowing across us until we came to the village of Sorel where we left D Company’s cooker and proceeded about 1 kilometer along the road to the village of Wanel which was our destination. Here we unloaded tied up the animals & again went to bed. The Billets an old barn were very dirty.\n\nand I slept in a dray outside in a shed.\n\nToday Oct 6 wintertime is adopted in France. The clocks were put back one hour this morning. Winter time was adopted some time ago in England.\n","110":" 1525.\n\nA fine but cloudy day. I am sleeping in an old French dray in a shed. It is dry but rather windy.\n\nA. Borthwick arrived at midday. He came ahead of the transports and returned again to show them the road. They are expected here tonight.\n\nThe central Powers and\n\nTurkey have made a proposal to president Wilson for a general & immediate armistice & the opening of negotiations for Peace on the basis of Wilson’s message to Congress last January. I don’t think the Armistice will be granted unless they unconditionally surrender which Germany will not do until she is forced.\n\nKing Ferdinand of Bulgaria has abdicated the Crown in favour of the Crown Prince Boris who has assumed the reins of Government.\n\nToday I received a large parcel from my wife containing 3 pkts of Havelock, 1 tin Dex cheese, 1 tin ham paste, 1 tin Eucalyptus\n\ndiamonds & some butter scotch, 1 pkt of tobacco was from Annie and the other from Curtis.\n","111":" 1526.\n\nA dirty wet morning but it was finer in the afternoon. There is only routine work to do today such as feeding and grooming the animals.\n\nMost of the Transports had a gay time last night for there is beauchamp beer and wine to be had in this village.\n\nCapt Ceruty who is now O.C. of the Transports addressed the men this evening prior to paying them. We are not to take any notice of the numerous rumours that are in circulation or assist by repeating them. Some of\n\nthem owed their origin to German propaganda as the one that Turkey surrendered. He had given credience to this as it came from official circles nevertheless it was false & its origin is a bit of a mystery. Other rumours about the37 battalion were not to be believed. The heads knew nothing at present. As the Batln was not below strength A & B companies would be made into one & called No 1 company & C. D No 2. The Transport strength was to be reduced in men Limbers and mules and horses. The number of hacks were also to be reduced.\n","112":" \n\nA fine day but rather cold and windy with cloudy sky. We were busy cleaning up the limbers for an inspection tomorrow.\n\nOn Tuesday 3 big new blows were delivered by the Allies in France. 1. By the British American & French on a front of 20 miles between Cambrai & St Quentin. 2.By the French under General Gourand on the little river Arnes N.E. of Rheims, on a front of 4 to 5 miles. 3. By the French & Americans east of Verdun. Very important progress was made in every case.\n","113":" 1528.\n\nFine but cloudy I wrote to Katy Martin yesterday. \n\n I also drafted a letter to the Officer commanding this battalion to apply for my discharge.\n\nThere is a great shortage of good water in this village none except what is in wells for domestic use. There is a dam here filled by street drainage and it is thick black & filthy. So this evening we took the animals to the next village Halllencourt 1. K .7 away and there the water supply was the same source and only a little better in quality.\n\nTonight I done some writing in a French farm house & had some hot coffee.\n","114":" 1529.\n\nA misty morning. The Allies are continuing\n\ntheir victories on all the fronts. During the past 7 weeks 110,000 prisoners have been taken on the Western front by the British.\n\nP.Wilson’s reply to the German overtures for peace is in the form of 3 pointed questions, to test the enemies sincerity, and practically mean unconditional surrender.\n\nThis morning I was in a bath parade to the baths at Liercourt which is over 4 kilos away on the other side of Sorrel on the road to Abbeville. Liercourt is a fairly large village. The baths had an ample supply of hot water and were run by Tommies\n\nI got my boots exchanged today for a comfortable pair of second hand ones size 7 – 4.\n\nIt is reported that the Battalion is to be broken up at once, but it is not confirmed but is regarded as correct.\n\nThis afternoon Cpt Ceruty addressed the Transports & Q. M. staff and read out the orders concerning the breaking up of the Battalion. The bulk of which was to become A & B companies of the 38. Btln and were to remain in their present billets. Some officers N.C.O & about 90 men would be sent to the 39. Batln, and when that Batln came up\n\nto strength again would be allowed to return to the A & B companies of the 38. Those who were sent to the 38 would be allowed to were their old colours and would be become the Right half Battalion. The transports would be sent to the 3rd Divisional train and would remain a compact unit and would eventually rejoin the battalion and all go back to Australia as the 37. Batln.\n\nThe Battalion War diary would be continued as A and B Companies Right half Battalion of the 38 Battalion.\n","115":" 1530.\n\nA showery morning. This morning about 10. a.m. I received a written notice warning me to be in readiness to move off to the 39. Btln.\n\nAfter dinner today I with two others in the Transports were told to report to C Companies parade ground at 3 p.m. in full marching order to proceed to the 39. Batln.\n\nLater this order was amended & the time changed to 1.30 all the companies did so or rather the men detailed to do so, and assembled on the street where Major Robinson\n\naddressed a few words to them, expressing the hope to see them all back again. We then marched off the band playing. \"It is hard to part I know wipe the tears baby dear from your eyes\". We had full packs up and had only two spells on the road. We passed through Hallencourt and then to a little village called Harquincourt and then went into billets lately occupied by C Company of the 39th Battalion. The billets are an old barn dry and fairly comfortable but it is a sea of mud outside for it has been showery this afternoon.\n\nIt was 6 o’clock when we had our tea for we were not expected for tea & the cooks after serving their own company had to start to get tea ready for us. \n","116":" 1531.\n\nShowery all morning and most of the night. There was no parade today.\n\nI put in a pass to go to Wanel to see some of my mates & to get some things I left behind.\n\nAbout 20 of us went to the old Battalion this afternoon. I went to the transports. All the attached men had been called in to their companies with the exception of Len Sherham. I got\n\nthe German bayonet that I had left behind and came back after tea.\n\nThe Daily Mail today as well as the French papers announce the acceptance by the German Government of all President Wilson’s 14 points & the subsequent 4 points, which amounts to unconditional surrender. There is great jubilation everywhere when the papers came along at midday today. Civilians and soldiers were shaking hands & all were in great glee.\n\n\"Le Guerre finished\"\n","117":" 1532.\n\nCold & frosty this morning. I was as cold as a frog when I got out of bed this morning.\n\nAs I had a sore throat last night & this morning I paraded sick & got some tablets and light duties. After dinner we were all paraded to Hallencourt for hot baths. This evening I got some sulphur ointment from the and past to rub in for the scarvey. I have had a slight attack of scabies for some time & it is very hard to get rid off.\n","118":" 1533\n\nDull & cloudy today. C. Company went on parade this morning with the exception of 4 of us who were detailed to remain in the billets and clean & paint the steel hubs.\n\nI sent a Christmas Post card to my wife today. This afternoon is wet and miserable & there is not much prospect of the weather clearing up for a while.\n\nI rode up to Hallencourt this afternoon to exercise Capt Allens horse and when I came back I saw the Transport officer of the 39 with the result\n\nthat I was to come to the Transport as soon as possible. When I came back to C Company I reported to Mr Bean and I was given permission to go this evening. I gave in my webb equipment to the company Sergeant Major J Lowe, and I took all my things to the Transport lines. I am sleeping in a loft tonight.\n\nMondays paper said that the German acceptance of peace was only a trap to gain time to extricate their armies from France & Belgium and that it really came\n\nfrom the Kaiser. To days paper reports big victories in Flanders. Over 8000 prisoners were taken by the Belgain British and French. I arrived at the transports tonight before 6 p.m. made my bed & soon went to it.\n","119":" 1534.\n\nCloudy with occasional showers.\n\nI started shoeing for the 39th transports this morning. I had Jimmy Fry helping me who done most of the floor work. I did all the fitting. We had 1 mule & 1 black draught mare\n\nthis morning we shod 1 donkey & 1 black mare this afternoon.\n\nWe were paid this afternoon I drew 30 francs £ 1.3.0. This is the first money that I have drawn since I was on London leave. I have been kept going by the money that I got for making souvenirs.\n\nI was issued with 3 blue stripes called today and the tailor sewed them on my right sleeve. These stripes are for length of service. I am also entitled to 2 ordinary stripes on my left sleeve for good conduct.\n\n1535","120":"\n\nA fine day.\n\nWe were shoeing all day both horses and mules.\n\nThere is to be a Brigade inspection tomorrow.\n","121":" 1536.\n\nA fine day but cloudy. There was a heavy fog this morning which lasted several hours.\n\nThe inspection was held this morning. The transports left here at 9.30 for the Parade ground about half a mile away. I was a brakesman on Jones limber. The whole battalion was already there. C Company composed of men & officers from the old 37. was the largest company there. We were inspected by\n\nColonel Jess the new Brigadier and the battalion went through several movements and all marched past.\n\nC Company was the smartest and more soldier like. The Transports were not so smart looking as the 37th as far as limbers were concerned but the men were equally as good. We returned home in good time for dinner. Yesterdays paper reports the encircling of Lille & the neighbouring towns by the British. Courtrai is outflanked and many more guns are taken. Mr Wilsons note in Germany has had a\n\ncold douche effect. The Germans realise that their peace by trickery has failed.\n\nThis evening being a half holiday I wrote to my uncle John Gilmore telling him of my father’s death. I also sent French P.C. \nto Maggie Kittson Kitty Kittson\n Irene Ring & W. Curtis. Cis & my mother all Christmas cards.\n\nI sent a French pocket handkerchief to Maggie & Kitty Kittson.\n\nA few days ago I received a letter from my wife dated","122":" No. 147. & one from Cis dated July 30. I have received later letters than these over\n\na fortnight ago. All the last mail contained old letters. A new & later mail is due any day now.\n\nTodays \"Daily mail\" announces that Lile Ostend and Douri have been taken.\n\n The British entered with bands playing and the inhabitants were overjoyed to meet them. There is great rejoicing in Paris today, especially among the refugees from Lile who were moved to tears.\n\nI was at a very good concert tonight in Hallencourt, given by the Coo-ees, the 39 Battalion was there by invitation.\n\nHallencourt\n\nSaturday Oct 19 1918. 1537.\n\nA fine day. This morning I was engaged on repairing the forge which is a portable one with a round bellows and one of the connecting rods was broken. I made a new one & forged it out of old horse shoes.\n\nThis evening is a half holiday. I received two letters from my wife this evening dated Aug 21 No 152 and Aug 24, No 153. I was pleased to read that the vause made out of the French 75 shell case had arrived safely\n\n I wrote to my wife today letter 144- 3 pages\n\nCharlie Henry joined up this Transports last night with a cooker & a team of horses. We are out together tonight and had some hot coffee and chips.\n","123":" 1538.\n\nA dull showery day. This morning J Fry and I shod 1 wild mule. This afternoon is a half holiday but it is too wet and muddy to go anywhere.\n\nThe Daily mail reports today that the whole Flanders coast has been won, Zeebrugge & Bruges occupied. The Belgians are halfway to Ghent.\n","124":" 1539.\n\nA fine day. I was shoeing horses and mules all day with two others.\n\nTonight I went out and had a feed of chips with Rogers. C. Company cook.\n\nParticulars of an educational scheme has been issued to the troops during the past few days, which is intended to give the troops something to do in order to fit themselves for civilian life. The scheme is intended for the demobilisation period & also before that time comes.\n","125":" 1540.\n\nA fine day We were shoeing and repairing limbers & a mess cart also a stove pipe. Our work is pretty constant and varied.\n\nWednesday Oct 23 1918. 1541.\n\nA fine day. Last night I received two copies of the \"Weekly Times\" of May 18. &","126":" also a letter card from the base Post office in acknowledgement of my letter notifying change of address. Tonight I received another copy of the \"Weekly times\" of May 25.\n\nWe finished repairing the limbers to date which consisted in fitting a G. S. wagon axle &\n\naltering the irons to suit.\n","127":" 1542.\n\nI was working in the forge to date by myself. Jim Fry went to Abbeville today in a motor lorry. These trips are organised to give the troops an opportunity of seeing France.\n\nI shod one bay mare this morning – a hack and made a pair of tongs this afternoon for our kitchen.\n\nInfluenza is very prevelent at present. There are 3 men in the transports laid up with it. It is also prevelent in England. I sent a registered parcel to my wife today containing a German\n\nsand bag made out of woven paper.\n","128":" 1543.\n\nA fine day frosty last night. One of 3 men who was laid up with influenza was sent to the hospital this morning. There is another one sick today. They all have very high temperatures & the doctor was up to see them this morning.\n\nWe were busy shoeing all day.\n","129":" 1544.\n\nThere is a change in the weather today. It is damp & misty.\n\nWe were issued with two green envelopes this morning and also 1 pair of underpants and a singlete.\n\nJimmy Fry is laid\n\nup with influenza today. I was therefore working in the forge on my own this morning. I put on a pair of front shoes on a mule & made 2 new handles for the hammer, an easy morning’s work. This afternoon is a half holiday.\n\nI got a pass this evening to Hallencourt and called at Divisional H.Q. where I saw Victor Lightbody. He is cooking for 16 men.\n","130":" 1545.\n","131":" 1546.\n\nI was in bed all day yesterday laid up with the influenza. I was too sick to do any writing.\n\nI am in bed a today but feel much better. There are now 6 drivers in hospital with influenza. Ford Kieler was the last one to go to the hospital. I received a pkt of letters today, 2 from my wife dated Aug 6. No. 150 & Aug 14 No. 151 & P.C. from Cis, one from Griffiths Bros. notifying the arrival of a parcel for me, or rather on the way, one from T. Douglas one from Mrs. Emerson.\n","132":" Oct.29.1928.1547\n\nThe doctor Cpt Collins late of the 37th who is now M.O. of the 39 battalion said I required a good rest & sent me to hospital today which was about 2 miles away at a\n\nplace called Grandsart. Firdie Kilier is here also. There were 9 of us in the van.\n\nOwing to the ravages of the influenza epidemic all leave has been cut out for the present.\n\n1548","133":"\n\nA fine day. The doctors decided to send men on to Abbieville today. I left at 2 & arrived soon after 3. I went as a stretcher case.\n","134":" 1549.\n\nA quiet day in the 3rd Australian General hospital.\n\nThis is a large hospital & there are many nurses. German prisoners scrubed out the floor of this ward today.\n","135":" 1550.\n\nA fine day. I am too ill to write any letters yet or even to post away some Christmas P. Cards.\n\nTurkey has surrendered unconditionally.\n","136":" 1551.\n\nA fine day but cloudy. I feel much better today. German prisoners scrubed out our ward before breakfast this morning.\n","137":" 1552.\n\nA dull cloudy day.\n\nSome of the patients were discharged today.\n\nMy father is two months dead today & I have heard no particulars yet.\n","138":" 1553.\n\nA fine day. I feel much better today. Austria has issued an appeal for an Armistice. She is thoroughly beaten & cannot hold out any longer. The Italians have reached her frontier.\n\nToday’s D. Mail says an Armistice has been signed with Austria and hostilities ceased at 3 o’clock today.\n\nGermany is now fighting alone. The Southern\n\nfrontier of Germany is now open to attack and the Bavarians are hastily digging trenches. Berlin is now within 80 minutes journey by aeroplane.\n\nI was up today the first time since I came to this hospital.\n","139":" 1554.\n\nShowery. Heavy rain last night. I am up again today. The nurse told me that I am to be sent to Blighty, but she did not know when but soon. That will be Tres bon\n\nThe nurse told me tonight that I am to go to Blighty first thing in the morning at 5 a.m.\n","140":" 1555 days of the war.\n\nI was wakened by the nurse at 20 past 4 who came along with a dish of water for me to have a wash. Then I got dressed in hospital clothes & had a bread & jam breakfast & was ready to start for Blighty at 5 o’clock.\n\nAfter a long wait during which we had some more breakfast – 3 sardines & bread & butter, we were put into stretchers at 9 a.m. in readiness for the Red Cross cars to take us to the train. The cars were busy all\n\nmorning removing patients to the station. At a quarter to 10 we were informed that we would not be sent away today as the train had completed its load & was gone. So we will have to wait here a few days longer.\n","141":" 1556.\n\nA fine day. A nice change from the past few wet days.\n\nThere is a possibility of those who are detailed for Blighty being sent away this afternoon.\n\nI was up early 9 a.m. this morning and had a walk around the hospital grounds.\n\n7 patients died last night.\n\nWe left the hospital in motor cars driven by W.A.C. girls. All sent as stretcher cases. It was 2 p.m. when we left the hospital for the train but it was 4 when the train started. We travelled all night and had tea supper and breakfast in the train. We were in bed all the time and had a fairly comfortable trip. There are 4 patients in each compartment one on each seat and a stretcher above.\n\nWe are to go to Le Havre. We had a good many stoppages on the way but it did not seem long for I went to sleep.\n\nBefore we got to our destination the train stopped on the line for several hours.\n","142":" 1557.\n\nA fine morning. It is 9 a.m. now and we are still in the train waiting on the line.\n\nWe spent most of the day waiting in the train. It was after 4 o’clock before we got on board the Red Cross boat. We had nice soft beds to go to. The beds consisted of mattresses spread close together between decks and we were packed together like sardines with one white blanket each.\n\nThe beds were very comfortable & warm. We were starving because the supper did not come along until nearly 7 p.m. It was a hot stew & we thoroughly enjoyed it. There are presistent rumours today that peace is about to be concluded with Germany, that hostilities cease at 3 p.m. today and that have crossed over to General Foch who is now in Supreme Command of all the Allied forces on all the fronts. There is great rejoicing at the news\n\nand it is generally believed that peace is not very far off.\n","143":" 1558.\n\nA fine morning in marked contrast to the rain of yesterday.\n\nWe had a splendid passage over to Southampton last night. We left sometime in the night & so steady was the Glentully Castle that we did not know she was moving except for a very slight noise from the engines from which we are located a considerable distance near the front. At 1.15 I woke up and found the ship was\n\nmoving. We arrived at Southampton waters before daylight and lay too for some time. We do not expect to leave the ship until late in the afternoon for there are 5 hospital ships ahead of us, & it will take some time for them to unload.\n\nWe had a first class breakfast this morning at 8. am.\n\nWe were ordered to sleep in our life belts last night. Yesterday’s Daily Mail prints the the wireless telegrams that passed between the German General staff & Marshall Foch on Thursday,\n\nand the arrangements made for the journey of the German Peace delegates through the lines. It is reported today on board the ship that the Germans have up to 11. a.m on Monday to make up their minds one way or the other.\n\nThis morning we were all issued with a cardboard box containing a pipe , a tin of tobacco and 4 pkts of Wild Woodbine cigarettes by the owners of the Glentully Castle the Union Castle line of steamers with their compliments and\n\nbest wishes for a speedy recovery. We left the ship at 3.15 and were on board the train by 3.30\n\nWe left Southampton about 4.30 and reached Exeter by 9. p.m. where we stayed for more than half an hour. Here we were met by the citizens and treated with extraordinary kindness. They gave us fresh grapes, apples & sliced apples cake and cigarettes. We did full justice to all the good things. Here many of the patients were taken off voluntary workers doing the\n\nstretcher bearing. We then left for Devonport arriving at Plymouth North Road station about 12. o’clock & from there we went by motor car to the hospital which had formerly been a large public school. We reached it before 1.am.\n","144":" 1559.\n\nI with others were carried upstairs and put in B1. ward. We were put to bed inspected and later I had a good hot bath and then some more supper about 2. am. this morning which consisted of bread & butter & a boiled egg and eggs are 7 ½ each.\n\nThis morning we had an early breakfast which was bread & butter & a boiled egg.\n\nI forgot to say that an English chaplain visited us on board the Glentully Castle when she was alongside the pier at Southampton and told us the latest war news & distributed post cards to write home to our friends. We also were given Post Cards on the train which we filled in.\n\nTodays \"National News\" says this is \"the last Sunday that will echo to the sounds of battle & that in a few\n\nshort hours the agonies of war will cease.\"\n\nThe latest news is that the Kaiser abdicates, Crown Prince renounces succession. Clean sweep of the House of Hohenzollern. A Regency is to be set up with Prince Max of Baden as the probable Regent. An unconditional surrender of the army is expected hourly. A free parliament is to be set up with socialist Deputy as New Chancellor.\n\nThe revolutionary movement in Germany is spreading and there is a mutiny in the German fleet at Kiel. There was mild excitement in London last night\n\nwhen the abdication news became known. Papers were eagerly bought up & there was applause in the Theatres. All is well and right has triumphed over might. Meanwhile the allied armies are pressing in closely following the retreating Germans gaining new possessions & fresh victories.\n\nThe name of this hospital is Camel’s Head Devonport and I am in B1 ward with 4 other Australians and some South Africians, who were in the war in German Africa and are only a weeks in England.\n","145":" 1560.\n\nThis morning is the last day of the war.\n\nAt 9. o’clock this morning all the factory whistles in the city and the steamers in the harbour blew their whistles and horns and kept it up for an hour. All the patients who were able got up and went down stairs. There was great excitement and school boys paraded the streets with flags & tin cans. The ships hoisted their flags. This morning’s London papers which arrived here about 9 had no official news of peace being signed but reported that the Kaiser, Crown\n\nPrince & Hindenburg had gone to Holland in great haste. Revolution in Berlin and the troops had joined the Socialists, the Red flag floated over the palace of the Crown Prince.\n\nAt 11. o’clock the whistles were again sounded for a quarter of an hour or more, as further news of Peace came through. The war is ended and Peace signed is the universal topic of conversation. There is great rejoicing everywhere. This is the end of a bloody war lasting 1559 days, in which right and justice\n\nhas prevailed over might and truth vindicated.\n\nAt different periods throughout the afternoon there were processions and great cheering.\n\nI finished reading a book \"Old schoolfellows and what became of them\" published by the R. J. Society a very readable and interesting book.\n\nThe papers today publish the official confirmation of the news of Peace.\n\nThe Plymouth \"Western Evening Herald\" prints:- The Prime Minister announced today armistice signed at 5 o’clock and hostilities\n\n \n\nThere is a big revolution in Germany which has spread all over the country all power is in the hands of the soldiers & workmen’s Council. 10 Kings have been deposed but there is no news from the smaller states. It is reported but not confirmed that the Crown Prince has been shot.\n","146":"","147":" Day of Peace.\n\nI sent Post cards to the following 2 to Cis 2 to my wife & 1 to A. Kennedy.\n\nUntil this morning no doctor has visited\n\nthis ward, when a lady doctor came along and examined the patients.\n\nWe were given a tea at 4.30 this evening by the Baptists. There were oceans of cake which was done full justice too. At 6. they gave us a concert\n","148":" 4th..\n\nA fine morning. I have a hot bath every morning before breakfast and thoroughly enjoy it.\n\nThe death of the Crown Prince is confirmed – said to be suicide on the Dutch frontier.\n\nIt is reported that Bulgaria has declared war on Germany\n\nher former ally.\n\nThe \"Daily Express\" says that the Kaiser’s abdication may be only a theatrical sham. No formal renunciation or farewell by the Kaiser and urges his surrender to the allies as a necessity.\n\nThe report of the Crown Princes death appears in the language of Mark Twain to be \"greatly exaggerated\" He is reported to be in Holland says the \"Express\" & crossed the frontier in disguise.\n\nThe British fleet are at Constantinople and the forts on both sides manned by Indian troops saluted them. A decree issued by the new German Government is rather mysterious in\n\nin view of the armistice terms. It stipulates among other things that prisoners are not to leave their work, that they are to receive the same pay as other workers & that failure to comply forfeits their right to be fed.\n\nThe \"Chronicle\" says there is a threatened revolution in Holland.\n\nThe concert last night was a success. The programme consisted of songs, recitations a Cornish reading, piano and violin solos and what is unique at concerts a number of concertina performances by an old man who knew his job.\n\nToday the matron issued from the Comfort fund shaving soap, brush, tooth brush & paste, hair brush,\n\ncake soap, pipe etc to all who required them. As most of mine were in France with the exception my shaving outfit I was issued with the lot.\n","149":" 5th.Day of peace\n\nA beautiful morning. At 9.30 I went to the clothing store & received a pair of secondhand boots on loan until I can receive a new pair from the A.I.F. London. Now I will be able to go out every fine day and see the sights.\n\nI met a machine gun corporal from the 39. Battalion yesterday who came over here on Monday night. He told me that Farrier Jim\n\nByrnes of the 39 Transports who was in Hospital before I joined the 39th died in hospital suffering from Influenza and Pneumonia, and that there were a lot more sick.\n\nI went out for a long walk at 1. O’clock today I walked into Devonport through Keyham along the Tram line, had a feed there, posted letters and bought some post cards of Devonport etc. A German warship met the British Fleet yesterday to make arrangements about handing over the German fleet. They were conducted to Admiral Beatty.\n\nI wrote to Kitty Martin today,\n","150":" 6 Day of peace.\n\nA cold morning. I drew an overcoat this morning & went for a short walk to St Beoudeux.\n\nThere is great distrust of the new German Government in France & England. It is questionable if they are truly representative of the people. They have received no mandate and are self appointed.\n\nI wrote to my uncle in Ireland today.\n\nI received a note from the Base Post Office this morning in answer to my letter informing me that my mail would be forwarded to my new location.\n\nI was out for another walk today as far as Maurice Square & came back\n\non the electric tram for 1d.\n\nWe were given our Hospital pay today the princely sum of 3\/6 per week.\n","151":" 7.\n\nFine but rather chilly in the morning.\n\nThere was a church parade this morning in the Hall which I attended. It was conducted by an army chaplain of the Church of England.\n\nThis evening with a welsh soldier named Davies I went for a walk around this part, coming home we were passing a church. We heard singing & went in. it turned out to be a Methodist Sunday School. They made\n\nus very welcome. It was the first time I had been in a Sunday School since a child. The church was full of children and there were a lot of teachers most of whom were Cornish.\n","152":" 8 Days of peace\n\nA fine day but cloudy. I went for a walk around one of the suburbs this afternoon and tonight I went out & got a loaf of bread 11 ½ and 1 lb of German Sausage for 1\/6 because we do not get enough to eat in the wards especially for tea which is only bread & butter & very little of that. I went round all the wards this evening and as a result we are all going to lodge a complaint with the matron that we are\n\nnot getting enough of bread and the potatoes are rotten.\n","153":" 9.\n\nFine but very cloudy. We complained this morning about the food when the matron came around and the result was that we were promised an improvement. She said she would speak to Cpt. Lindsey. We were issued today by the matron with tobacco & cigarettes, also a clean change of underclothes towels sheets etc.\n\nThis evening I walked into Devonport through Keyham to Maurice Square & from there took a train to Plymouth which was at least half and hours ride. I got out of the terminus in front of the\n\nTheatre Royal. I had tea in a restaurant close by and left at 4. o’clock. It was after 5 when I got back & I came all the way in the train changing at Maurice Square for Camel’s Head hospital. There was a concert here last night and again tonight. I attended tonight. There were some very good conjuring tricks done by a man from one of the warships.\n\nThe Germans are making pathetic appeals for an alteration of the Armistice terms on economic grounds. President Wilson has referred them to the Allies as the proper channel through which to make the appeals. There is great distrust of\n\nthe Germans everywhere & I don’t think there will be any alterations in the terms. The German Admiral met Admiral Beaty and discussed the manner of handing over the fleet.\n","154":" 10 Day of peace.\n\nDull & cloudy. Today I finished reading a history of General Booth by George S. Railton – his first Commissioner.\n\nThis afternoon a large number of us were invited to the Criterion restaurant by Navial officers & friends. We left here by tram and arrived at the Criterion in Keyham about 2.15. where we found that there were there a large number of soldiers & sailors from other hospitals\n\ntogether with naval officers ladies and the W.R.N.S. and they made us very welcome. In one upper room there were whist parties and on the top floors games of various kinds including Kiss in the Ring, sack races 3 leg races and lighting a candle sitting on a bottle which ensured a great deal of fun. At about 6.30 we retired to another floor where a first class tea was set for us which was done full justice too.\n\nThen the tables were removed & a programme of dancing, singing and conjuring was given, many of the items being contributed by the sailors.\n\nThe conjuring being done by a much bemedalled naval officer was splendid and elected much applause. Some of the tricks being exceptionally clever. We left at 9.p.m. by tram for the Hospital which stops in front of the Hospital.\n\nTomorrow we are invited by the Mayor to attend a banquet in the Guildhall Plymouth.\n","155":" 11 Day of peace\n\nA fine day. I wrote to Kitty Martin this morning in answer to her letter of","156":" which I received a few days ago.\n\nThis morning I received a packet containing one letter from Annie\n\nwritten from Dookie dated Aug 31. also a P.C. written from Shepparton.\n\nOne letter written from Merrigum from my wife dated Aug 31. No 154.\n\nToday we were supplied with writing paper comb housewife etc. etc from the Red Cross funds.\n\nYesterday \n\nToday the German High seas fleet surrenders. An allied Commission is proceeding to Wilhelmshaven the German base to superintend the disarmament of the rest of the Fleet.\n\nComing back from the concert tonight we heard that the German\n\nFleet had surrendered to the British.\n\nFriday Nov 22 1918. 12Day of peace \n\nThe banquet yesterday was a brilliant success. We left here at 3.p.m. in special tram cars and went right through to the Guildhall at Plymouth without changing cars. When we got there there was a long line of convalescents 4 deep slowly marching into the Hall. Once we got inside we were seated at tables near the back for the Hall was already well filled. It is said that there were 1000 soldiers present & some sailors. Ladies waited on the tables on which were\n\nspread a plentiful supply of eatables such as meats hams jellies trifles and a variety of cakes.\n\nThe Mayor in his robes of office made a short speech and then followed a programme of music which was of a high order and supplied by artists from the Theatres. There were many organ recitals for Plymouth is said to have one of the best organs in England. The last organ recital was a rendering of the \"Storm\" by a long haired professor and it was awarded with rounds upon rounds of applause. It sounded like the real thing, it was so\n\nrealistic we could hear the storm coming, a ships bell ringing, the storm at its height and gradually dying away in the distance.\n\nWe left the hall at 7.p.m. and arrived at the Hospital about 8.p.m. when there was another small concert about to be started but beyond having a look most of us went to bed\n\nI wrote to my wife today. Letter 146 \n\nThe Daily Chronicle \"says:- \" Five great German battle cruisers 9 selected battleships, 7 light cruisers, and 49 of the latest destroyers\n\nlay moored in the Firth of Fourth last night after their surrender to the Grand Fleet yesterday 50 miles off the coast of Fife. One destroyer had been mined on its way across the North Sea.\n\n\"It was the greatest surrender in naval history. In mighty array the Grand Fleet in two parallel thirteen miles long led by Queen Elizabeth & Lion set out to the rendezvous before daybreak. A few hours later captors and captives were at their moorings in the Firth of Fourth\"\n\nIt is the grand and final climax to the four years vigil of the British Navy. Germany’s\n\nbest ships were handed over whatever may be their final distribution will never be returned to Germany.\n\nIt is reported that the Kaiser has 10 tons of gold & silver deposited in hiding places in Holland.\n","157":" 13 Day of peace.\n\nLast night we received our hospital pay, 6d per day for Australians the munificient sum of 3\/6 per week. The Tommies only get 2\/- per week.\n\nThere are now 161 patients in this Hospital and 55 vacant beds – a total of 216 beds in all. No more patients are to be taken in as the hospital which is only a branch\n\nof the big military hospital in Devonport is to be closed down, presumably to reopen the school. Since the war has finished there are no more wounded cases coming into the hospitals in France, consequently they are not taxed for accomodation.\n\nThe patients here are mostly Australians and Tommies with a sprinkling of Canadians Americans, South Africians and New Zealanders. The nurses comprise English Canadians, Australians.\n\nOne English nurse comes from the Channel Islands and her mother was a\n\nFrench woman. Nurse Miller is her name and she is one of the most pleasant in the ward. Another nurse was born in India.\n\nTwo of the Tommies in this ward were issued with their uniform today so they will probably go out on Monday. They came in from France since we came here. The Australian uniform has to come from Horseferry Road.\n\nThis afternoon I walked to Saltash about 2 miles away to see a great bridge across the Tamer. The bridge was built in 1859 by a German Engineer and stands 100 ft high above the water which is about 60 feet deep. It\n\nconnects Cornwall with Devonshire and carries a single line of rails. Trains pass along it about every 15 minutes. It does not look a strong bridge & when built was condemned but eventually passed. It was intended for two lines of rails. The builder afterwards committed suicide by drowning himself off the Great Eastern.\n\nA soldier – a Tommie died here this afternoon in No. 9 ward from Influenza and double Pneumonia.\n","158":" 14.\n\nCloudy looks like rain. There was some rain\n\nlast night & the night before.\n\nAcross the Tamer there is a large ferry boat which crosses backwards & forwards conveying passengers horses & vehicles etc. It is worked by steam which which picks up a chain and pulls the ferry from side to side, the chain sinking down into the wake as the ferry moves along, so that ships can pass over.\n\nThere are also a number of small boats, in one of which I crossed over to Cornwall paying the boatman 2d for the trip over which took 6 minutes. Saltash is built on the side of a very steep hill the houses running down to the\n\nwaters edge.\n\nThere was an early church parade this morning in the Hall. It was conducted by the same military Chaplain as on the previous Sunday.\n\nThe attendance was very poor.\n\nI went for a short walk this afternoon before tea. The weather was very threatening and it had been raining lightly most of the afternoon.\n","159":" 15.\n\nDull & cloudy. Since I came here I have had a bath every morning with the exception of yesterday.\n\nThe time is slipping away fast. It is only a month to Christmas today.\n\nand I hope to be about returning to Australia by then if not already on the way.\n\nI wrote to Tom Douglas this morning in reply to a letter I received in France.\n\nThe Doctor was around this morning & and asked if there were any patients who wished to be discharged. The lady Doctor N. O. Walk does not visit this hospital now.\n\nI went in to Devonport this afternoon and got the hands fixed on my watch.\n\nThere was a very good concert here in the Hall tonight. It was given by some Naval Officers & their friends.\n\nAnother batch of German U. boats surrendered yesterday. The officers looked ashamed but the men were not.\n","160":" 16.\n\nThere is a light misty rain all this morning. This evening I made up a parcel for my wife containing the following. 1 envelope – 12 French P.C. of Abbeville, 1 envelope - 12 views of Devonport & Plymouth. 1 envelope – 21 P.C. views of Boulogne and 5 others mostly of famous views that were dug outs. 50 P. Cards in all.\n","161":" 17.\n\nA fine mild day. I sent two Anzac Bulletins\n\nto my wife & 2 P.C. to A. Kennedy & posted the packet of Post Cards in Devonport this afternoon. I had a ramble around Devonport today passed the barracks the General’s house & the Admiral’s House, the bluff which slopes steeply down to the waters edge. In the Sound which is very narrow there are three training ships anchored fore & aft. One of them is the last wooden war ship built & the other the first ironclad.\n\nIn the distance I could see the break water stretching away in front of the entrance and the place where the \"Persic\" hove too on our arrival from Australia.\n\nThere are some fine parks in and around Devonport and in one of them there is a Boer gun that was captured during the S. African war.\n","162":" 18.\n\nCold & cloudy. There was a very good concert here last night. It was poorly attended for patients are going out every day & no more are coming in. The concert was a very bright one & the performers were mostly ladies.\n\nWe expect to be discharged from this hospital very soon. Part of our kit has arrived from Horseferry Rd. I walked up to Ford House Military hospital\n\ntoday and from there to Devonport Park and the city. Stayed an hour at the Y.M.C.A. Fort St had some tins at the \"Welcome\" caught a tram at Morice Square and back to the Hospital travelling between 4 and 5 miles.\n\nTwo transports with Australians on board left Plymouth yesterday for home. All Australians and Americans are to be out of this hospital on Monday.\n","163":" 19.\n\nA dull cloudy day, looks very much like rain.\n\nI wrote to Cis today & sent a \"Daily Express\" to George.\n\nThis afternoon I went to the Hoe at Plymouth, going through\n\nKeyham Devonport and Stonebourne, on my way to the train. The Hoe is the fore shore on which much labour has been expended. There are many fine Hotels and other buildings facing the Hoe. There is a pier for pleasure boats and rising above it a grandstand built entirely of stone. In the harbour I saw a British submarine and two sea planes and some destroyers. Here I met a gentleman a Mr Johnson a businessman in Union St Plymouth who showed me around the Hoe, the citadel\n\nwhich was built by Charles II to when people for Plymouth took sides with the Parliament against the King. The Citadel is a huge place and is filled with military barracks. I entered the barracks through the main gates. It was from the Citadel that the Mayflower sailed for America with the Quakers. Drake’s statue and the Spanish Armada memorial are two of the from statues on the Hoe. There is also a fine column erected to the memory of those who\n\nfell in the South African war. The old second Eddystone lighthouse has been re-erected on the Hoe. 1d is charged for admission and it brings in about £ 100 a year. From it a fine view can be obtained on clear days. This lighthouse had a great list on it so a new one was built at Eddystone and the council got permission to remove the old one to the Hoe. They left about 16 feet of the base of it which always shows in pictures of the present lighthouse.\n\nWe had a good look around the Hoe and Mr Johnson invited\n","164":" for tea to his residence. He showed me over his shops and work rooms. We then had tea, a long talk about Australia and I left catching a car for Devonport and from there another to the Hospital where I arrived in ample time to go to a concert in the school hall down stairs. During an interval in the concert tea, sandwiches and cakes were handed round.\n\nIn Devonport I got a lot of views of Plymouth.\n","165":" 20.\n\nDull & cloudy. The weather has changed\n\na lot this week. The atmosphere is foggy and it is impossible to see very far.\n\nThis morning I made up a packet of 18 P.C. for my wife mostly of Plymouth & Devonport with a short descriptive note written on the back.\n\nThis morning I was pleased to get a tin of Australian tobacco by post.\n\nI was issued with an Australian overcoat tunic & pants today. Also boots. I returned the Tommy overcoat and boots issued to me in the hospital.\n\nI was in Devonport this afternoon and\n\nposted some letters & a packet at the Post Office. I had tea at the Sailors rest. Two sausages, potato mash a bun & cup of coffee for 9d. the cheapest place I have yet been in.\n","166":" 21.\n\nThree weeks of peace.\n\nThe time is fleeing fast. Christmas will soon be upon us. Probably the year will be out before we start on our way home to Australia.\n\nI was at a C. E. Church parade this morning in the Hall. It was poorly attended. It was conducted by the same chaplain as on the previous Sundays.\n\nThere was a very good concert here last night by the Americans. The best items was some of the conjuring and acting. Afterwards a few dances were held until 10 o’clock.\n\n I wrote to my dear wife to day Letter 148 6 pages\n","167":" 22.\n\nFine but cloudy.\n\nPresident Poncairie in reply to the King’s speech in Paris concluded by saying in regard to the relations between France & England. \"Together we have suffered. Together we have fought. Together we have conquered. We are united forever.\"\n\nAll the english papers devote most of their space to election news.\n\nNomination day is next","168":" Polling day","169":" and counting of votes Saturday Dec. 28.\n\nFrom one end of the country to the other Indemnities and Repatriation are the test that the people require from candidates. They look to the candidates to answer their cardinal questions in straight unequivocal terms. The \"Nations News\" says. \"Any man of good repute and honourable political record who while sound on these points will promise seasoned support to Mr Lloyd\n\nGeorge & a coalition government be he Liberal Unionist or Labour deserves the confidence of the electorate.\" It goes on to \"detest the misguided & dangerous policy of political ostracism sought to be imposed on men who refuse blind allegiance to the coalition \"never was it more necessary to secure a patriotic and a free Parliament – one which by its very composition will be trusted by all.\"\n\nThis evening with Turner & Cpl. Phelan I went to Plymouth Hoe & visited the\n\nAcquarium which is well worth a visit. It is stoked with English fish of various kinds also shells & .\n\nThe Acquarium is alongside the citadel and is built out of stone that once formed the outer ramparts of the citadel.\n\nWe had tea at the Royal Sailors Rest Devonport.\n\nTuesday December 3. 1918. 23.\n\nWe are to be issued with new hats and as they have not arrived yet, we are detained here until they come. That may be any day or it may not be for a week.\n\nWe were issued with tobacco & cigarettes today.\n\nAbout 1000 Australians\n\nall 1914 men marched past here this morning from St Budeaux on their way to join a Transport at Plymouth en route to Australia.\n\nI walked into Devonport this afternoon had tea there at the Royal Sailors Rest got my hair cut & came back in the tram as it was raining & very dark. I passed the Hospital without seeing it so had to go on to St. Budeaux & came back in the same tram to the Hospital.\n","170":" 24.\n\nThis is nomination day for the English elections consequently orders\n\nhave been issued that all patients in hospital must not go out and all men in camps and barracks are confined therein.\n\nThis morning I received a packet from the Base Post Office London containing 4 letters from my wife Sept 8. 156. Spt 16. No157. Sept 23. No 158. Sept. 1. 155.\n\nThree of them gave me a few particulars of my father’s death. Also 1 letter and Post card from Maggie Sept 11. and one letter from Cis dated Sept 13. 1918. giving a few details about my father’s death but omitting many important things that I would like to know. I wrote to Cis today and\n\nand sent P. cards to Maggie & Kitty.\n\nI finished reading \"The Adventures of Lieut Lawless R.N.\" by Rolf Bennett. It is an interesting and exciting series of stories of the seas before & during the war.\n\nThere was another concert here last night. The programme consisted of singing reciting stories and ventriloquism. The concert was amusing and entertaining but was not so good as some we have had here.\n\nI have been warned today that I am to go out \ntomorrow\n on Friday.\n\nThursday Dec. 5. 1918. 25.\n\nA dull cloudy morning but fine.\n\n I wrote to my wife to day 8 pages Letter 149\n\nWe received our Hospital pay 3\/6. this morning.\n\nThis afternoon I went to Torpont across the harbour. I crossed over in a ferry steamer. \nTorquay\n Torpont is in Cornwall and there is not much to be seen there. It only takes about 5 minutes to cross the harbour in the ferry boat. There are also two ferry bridges worked on chains that drop down into the sea as the\n\nferry goes along. The chains run through the ferry & the machinery grips the chains and hawls the ferry over.\n\nTonight I went to an entertainment at St Budeaux given by the Girls Club. There were the usual games songs and recitations & a few dances. Tea and cakes and cigarettes were handed round.\n","171":" 26.\n\nI was up at 6. am this morning. Had and early breakfast & left Camels Head Hospital about 7.30 in a motor van with a lot of others which\n\ntook us to Millbay Station Plymouth where we boarded a train bound for Paddington, London. We passed through Exeter, Taunton, and Bristol, at one part of the journey the railway ran along the beach at the foot of a cliff for several miles and we passed through many tunnels on the way, one particularly long one, which I understand runs under the river Avon.\n\nWe arrived at Paddington about 3.pm and took the tube to St James Park\n\nStation where we were met and conducted to the A.I.F. at Horseferry Road. We had some tea & buns a lecture in Health & Veneral diseases then to the Medical Room where we were questioned about our ailments wounds etc, I elected to go for a week into a convalesent camp so that my leave would extend over Christmas. I am to report at the A.I.F office at 10 o’clock tomorrow. Got some of my clothes exchanged and am staying at the War Chest Club tonight, where I\n\nwill have tea and do some writing.\n\n I wrote to my wife tonight Letter 150 2 pages\n","172":" 27.\n\nAt 10 o’clock this morning I reported at Headquarters. Previous to that I went to Church House and saw Fred Prichard and he paid me 10\/- that he owed me since last January.\n\nI saw Harry Wight at Breakfast this morning. He is looking well and expects to be sent back soon. He told me that the new Pioneer Sargeant Charlie Handcock died of\n\ninfluenza. He was my mate when I was with the Pioneers, & a very nice fellow.\n\nAfter considerable delay a batch of us accompanied by an officer were sent to Waterloo Station. We crossed over Westminster Bridge and saw the captured German submarine U. C. I got a Post card of it. We had something to eat at the Railway Buffett and was on the train and away by 12.30.\n\nWe reached Weymouth about 4.30 and I felt pretty tired for it was a long journey.\n\nWe passed through Southampton West Bournmouth on the way.\n\nWe were told on reaching here that furlough is cut out except for very special reasons from here and that we may be on board a boat for Australia within a few days. This is hard luck and I fell in by going to this camp.\n\nAt Weymouth Station we were driven to Littlemoor Camp, our names taken issued with 4 blankets and then put in a hut & served with a very good tea & plenty of it.\n","173":" 28.\n\nThere is nothing doing this morning. There has been no parades and no roll call. Most of the lads are very pleased at the prospect of getting away so quick. But a few of us will be greatly disappointed if we do not get leave. It was my own fault I should have taken it when I had the chance, but my object in the delay was to have Christmas in Ireland during my leave.\n\nI wrote to Mr Fischer today explaining my case and asking him to see if he could get me leave.\n","174":" 29.\n\nThe weather is dull and cloudy today.\n\nWe are very well fed here. About 10. o’clock we were paraded the roll called for this ward & then paraded to the A.M.C. Hut and examined by a doctor for classification.\n\nI wrote to Mr Hughes about my leave but I have not much hope og getting it. Several others have also written.\n","175":" 30.\n\nCold & showery. I am in BIB categatory as the result of the examination yesterday.\n\nWe attended a dental parade this afternoon.\n\nand I am to get a tooth on my plate which will cause another delay.\n\nThese delays will be of an advantage as they will prolong our stay here and enable Mr Hughes to get to work.\n\nI wrote to Kitty Martin and my uncle in Ireland this afternoon.\n","176":" 31.\n\nVery cloudy. There was some heavy rain last night.\n\nI am one of 3 mess orderlies today.\n\nThis afternoon we were all shifted from No.15 Hut and distributed between 71. 72. & 73. huts. I am in 71. hut. There are men here from almost every unit in the A.I.F.\n\nand they are being sent away as fast as possible.\n\nNow boat rolls are coming out, but I understand that all men who are clased BIB will not be put on a boat roll until they undergo another medical examination. This is the category that all men in hut 15 were in. All BIB men are under observation and most new men coming in to this camp are so classed until they are again examined.\n\nThere are a number of German prisoners working in this camp. Some of them can speak very good English and a corporal amongst\n\nthem is a very pleasant intelligent young man.\n","177":" 32.\n","178":" 33.\n","179":" 34.\n","180":" 35.\n","181":" 36.\n","182":" 37.\n","183":" 38.\n\nDuring the past week I have had a most awful time. And have not been able to make any notes att all. I have been in Hospital all the time & still in bed but well on the road to recovery. Thursday\n\nmorning I reported sick & was at once put into hospital I became worse & was sent to another hospital at Monte Video. For the first few days I got no better then I gradually improved. My left side which was very sore & tender was put in adhesive straps after hot poultices had failed to give relief. I had pneumonia in the left lung.\n\nThose of us who had pay books were paid today I drew £ 1-15-0.\n\nOn Monday I received a packet of letters , 4 from my wife No. 159. Oct 6. 160 Oct 13; 161. Oct 20; 162. Oct 23. And one from Cis Oct. 11.\n","184":" 39.\n\nI feel much better this morning. My temperature respiration & pulse are again nominal. My temperature ranged from 103. down to 97.\n\nThere is not much news in the papers now. President Wilson got a great reception in France. Haig & some of his Generals are coming to London today.\n","185":" 40.\n\nI feel much better today. Though I had a bad night. I could not sleep though I was given Brandy and sleeping draughts, but all in vain.\n\nI coughed most of the night. I slept several this this forenoon. There is a registered parcel for me at the P.O. The parcel turned out to be from Mrs A. Pavey. After having my signature witnessed on a card & sending up my pay book I was able to obtain it.\n\nThe parcel contained a tin coffee biscuits 1 pkt. butter scotch. 1 pkt. loaf sugar. 1 tin tea tablets & 1 pkt spearmints. 1 tin veal & tongue paste. 1 large cake chocolate 7 items in all.\n","186":" 41.\n\nThe doctor Cpt. again examined me\n\nthis morning. He is a left handed man & writes with the left hand.\n\nHe took the adhesive strapping from my chest & said my heart was little if any displaced.\n\nPreparations are being made for Christmas. The ward is being decorated by the patients.\n\nA Salvation Army Padre was around distributing writing paper.\n","187":" Dec.22. 1918. 42.\n\nA very cloudy day. I finished reading today\n\n\"Feats on the Fiord\" by Harriet Martineau an interesting story of life in Norway.\n","188":" 43.\n\nFeel much better today, I am not yet allowed out of bed. My temperature is nominal. A new doctor was around today.\n\nThe lads have finished decorating the ward for Christmas. Among the decorations are small branches of gum trees & wattles.\n\nThis afternoon two red cross ladies visited the wards and distributed tobacco & cigarettes, also sweets.\n","189":" 44.\n\nChristmas Eve.\n\nSeveral men from this ward left here early this morning to go on board a troop ship for Australia.\n\nI finished reading a book called \"In the Grip of the White Slave Trader\" by the author of the \"The White Slave Traffic\". It deals principally with the methods of the Procurer in England, France Belgium & Holland.\n\nTwo ladies and an old gentleman visit the ward this afternoon\n\nand distribute some comforts.\n","190":" 45.\n\nChristmas Day\n\nIt was frosty last night but today is beautiful & fine. Just like a spring day in Victoria bright warm sunshine and a clear blue sky speckled with light fleecy clouds .\n\nWe all had a glass of wine or brandy as preferred and a piece of cake this morning and a visit from several officers who gave us these refreshments.\n\nI was up this morning for the first time but had to go back to bed as I was too weak. I\n\nalso shaved myself for the first time since I have been sick.\n\nWe all received a Christmas box from the Red Cross Society containing cake tobacco cigarettes chocolates and dried fruit. There boxes were packed in London as the originals sent from Australia were burned in a big fire where they were stored.\n\nWe had a splendid dinner. The Menu was turkey, ham, baked potatoes peas vegetables etc. followed by Australian plum duff and fruit oranges grapes, nuts etc.\n\nBeer and porter were also served. I had two bottles of porter. Of course I had my dinner in bed but all who were able to get up sat at the table which was specially decorated for the occasion. Then cigars were handed round. Each man received three.\n\nWe had a real good Christmas dinner & everyone enjoyed themselves. The old lady and gentleman & their daughter again visited us before dinner to make sure that everyone was comfortable and also some officers.\n\nThis evening the\n\nY.M.C.A. gave each man a little wallet and tonight The Salvation army came around to each ward and sang a little Christmas carol led by an Australian who represents the S.A. here.\n","191":" 46.\n\nBoxing Day.\n\nA fine day but cloudy. After dinner I got up and sat at the fire in my overcoat reading for about 2 hours.\n\nPresident Wilson comes from Paris today & will be the guest of the King at Buckingham Palace.\n","192":" 47.\n\nA fine day.\n\nI was up for a little while this afternoon. The papers today are full of the visit of P. Wilson to London a million people welcomed him & he got the greatest reception ever given to any visitor to London.\n\nOne of the patients in this ward had a fit and there were several doctors attending on him for a long while.\n","193":" 48.\n\nA dull cloudy day. The M.O. Captain Black was back again this morning and resumed his duties in this ward No. 44. He examined me this morning.\n","194":" 49.\n\nA dull cloudy day but remarkably fine for this time of year.\n\nSince I came into this ward I was given liberal & frequent does of brandy everyday but today it was changed to wine which I like much better.\n\nThe papers today publish the result of the election count yesterday. There are some surprises such as Mr Asquith’s defeat. But all are agreed that it was a great victory for Mr. Lloyd George the greatest victory in\n\nBritish politics. The Pacifists & Bolshevisks are badly defeated everywhere. Ramsay McDonald, P. Snowden & A Henderson are kicked out with scorn as they deserve to be while Mr Horatio Bottomley – the soldiers’ friend – is returned by a very big majority. Only one woman candidate was returned – a sinn Finner in Dublin.\n\nSince I have been in this ward I think that I have drank more brandy than ever I did before. At first my principal food was brandy & sweet milk but now it is being\n\ngradually slackened off.\n","195":" 50.\n\nI have read a lot of short stories in magazines especially \"The Wide World Magazine for July & August. This is one of the best magazines published in England.\n\n I wrote to my wife today. Letter 151. Pages 4\n","196":" 51.\n\nA fine day.\n\nThe Red Cross distributed cigarettes & other comforts today.\n\nEnd of 1918.\n","197":" 52.\n\nNew Years day.\n\nI was up early this morning, and stayed up for about an hour when I went to bed again as it was more comfortable to read in bed. My bed is opposite a window and I have a good light.\n\nI get up every afternoon. I was greatly pleased to get a parcel from my wife forwarded by Griffiths Bros. It contained 1 tin Canterbury cake 1 tin IXL chicken tamale, 1 tin lemon butter 1 bottle Bonox fluid , 1 tin tea tablets 1 large cake chocolate 1 pkt chewing gum. 1 pkt sugar tablets. 8 items in all.\n\nToday is wet cold and miserable so I stayed in bed most of the day. The days are now very very short and the night is very long.\n","198":" 53.\n\nMuch finer than yesterday but showery.\n\nI am reading a book called the \"Golden Butterfly\" by Walter Besant and James Rice a tale of a rich American who has come to London to learn how to spend his money. The story opens in America & is very interesting at first but becomes less interesting when the American enters into society & business life\n\nin London. There is the usual love story in it. The book is brilliant in places but on the whole the story is heavy with too much detail and drags slowly to an end. It is not a style that I like.\n","199":" 54.\n\nA showery day. The doctor put me down for a boat roll which means that I will not go into camp but will go direct from the hospital to the ship, which may not be for a few weeks.\n\nLast night or rather this morning about 4. a.m Saunders who had fits some time ago and has been very\n\nunwell died. He was shot through the head in France and had never completely recovered. He was partly paralysed & at times was unconscious.\n","200":" 55.\n\nCold & cloudy with occassional showers. Three men from this ward were sent away at 4 oclock this morning to join a ship at Cardiff for Australia.\n\nThe Doctor Cpt. Black was surprised to see me here this morning. He intended me to go this morning, and had ordered an ambulance & a stretcher to take me to the train,\n\nbut as there was another Wilson in the ward he was sent in my place by some mistake, although he was also intended to go. The doctor had forgotten that there were two Wilsons in this ward. I am just as well pleased for there is an Australian mail in and I am expecting letters any day now.\n\nI have finished reading the \"Golden Butterfly.\"\n","201":" 56.\n\nThis morning I had series of surprises and pleasant ones too. First a Sargeant came round with a form filled up for my furlough ready for the\n\nM. O to sign certifying that I was fit to go on leave on the 15. He was surprised but as the leave would not be due for 10 days he signed it with the right to cancel it, for at present I am not fit & the weather is too bad.\n\nThen a parcel came along from the residents of Cape Bridgewater which I did not expect. It was the best parcel I have yet received. It contained the following:- 1 tin plum pudding 1 tin Bacchus Marsh cocoa & milk 1 tin Nestles cream 1 tin Rex Camp Pie 1 tin cheddar cheese\n\n1 tin Eucalyptus diamond 1 tin Havelock tobacco, 1 pkt lump sugar 1 tin Capstan cigarettes with a tin of tobacco in end, 1 tin cream wafers, 1 tooth brush, 1 tube lanoline for face 1 pkt spearmint 1 pkt Iffs mint chewing gum, 15 items in all\n\nThe parcel also contained a P.C. of Julia St Portland stating that the parcel came from the residents of Bridgewater.\n\nSister Cann who is our day nurse has been relieved for the day by Sister Staford. They have one day a week off duty. Sister McIlroy is the night nurse.\n\nThis evening I\n\nfinished reading the \"Brood of the Witch Queen\" by Sax Rohmer a weird story of Sorcery as it was formerly practised in Egypt & Europe during the Middle Ages.\n","202":" 57.\n\nMuch finer today but I do not feel so well. I had a sore throat when I woke up this morning.\n\nOne of the repatriated prisoners is a patient in this ward. He was exchanged early last year and spent some considerable time in Germany. He tells some harrowing details of the treatment meted out to the allied prisoners in\n\nGermany especially the Russians and Roumanians. He was in a camp at Doulkans where there were 8000 prisoners. The sanitary conditions were awful and they were on a starvation diet of Mangold – Wurzel & beetroot. They died at the rate of 30 per day faster than they could be buried. The dead bodies were stacked in the yard in the camp crosswise like piles of firewood. Occasional casks of fish were brought to the camp & boiled with the mangolds. The stench of these fish\n\nwas so bad that the cooks had to go outside when they were boiling. Sick men when they eat them frequently vomited it up again. The men were so hungary & this rotten food so scarce that others came along with a spoon & basin gathered up the vomit & eat it. They also ill treated the prisoners & would knock them down with the but end of a rifle if they asked for more. On some of the prisoners they tattooed the German eagle on their cheeks and foreheads. This never got into the papers. The British authorities made these prisoners when they arrived in England wear a mask so that the public would not know – such was their regard for the beastly Hun. I have had talks with a number of repatriated prisoners & they all very reluctantly tell the same tale of cruelity & starvation. They don’t like to talk of their sufferings for they say people in England do not believe them.\n\n I wrote to my wife to day. Letter 152\n","203":" 58.\n\nMuch finer today. There has been great\n\nsnow storms in the Midlands & much damage done to roads, telegraph wires etc.\n\nThe papers today announced the death of ex-President Roosevelt at Oyster Bay.\n\nAnarchy and Bolshevism still continue in Germany.\n","204":" 59.\n\nA fine day but cloudy.\n\nI took a 1\/- ticket in a raffle for a French watch today.\n\nI am reading a magazine called \"My Magazine\" which is one of the best that I have seen. The articles are\n\nmostly technical and scientific.\n\nI received a letter from my wife today dated Oct 27. No 163 written from Melbourne.\n","205":" 60.\n\nA very stormy day. I was issued with a new tunic today and a pair of second hand boots in place of the ones left behind at Little Moor.\n\nI am on a supplementary boat roll the boat is the … this will put an end to my prospects of leave.\n","206":" 61.\n\nDull & cloudy but fine. I finished reading \"Pan’s mountain\" a classical story by Amelie Rives (Princess Troubetzkoy.\n\nThe scene of the story is in Italy & it is rather weird tale and it ends unhappily. The lovers do not get married.\n\n I wrote to my wife to day. Letter 153\n\nA new patient came in this evening. The ward is now full up.\n\n"}}