{"Document Name":{"0":"Diary_0508","1":"Diary_0508","2":"Diary_0508","3":"Diary_0508","4":"Diary_0508","5":"Diary_0508","6":"Diary_0508","7":"Diary_0508","8":"Diary_0508","9":"Diary_0508","10":"Diary_0508","11":"Diary_0508","12":"Diary_0508","13":"Diary_0508","14":"Diary_0508","15":"Diary_0508","16":"Diary_0508","17":"Diary_0508","18":"Diary_0508","19":"Diary_0508","20":"Diary_0508","21":"Diary_0508","22":"Diary_0508","23":"Diary_0508","24":"Diary_0508","25":"Diary_0508","26":"Diary_0508","27":"Diary_0508","28":"Diary_0508","29":"Diary_0508","30":"Diary_0508","31":"Diary_0508","32":"Diary_0508","33":"Diary_0508","34":"Diary_0508","35":"Diary_0508","36":"Diary_0508","37":"Diary_0508","38":"Diary_0508","39":"Diary_0508","40":"Diary_0508","41":"Diary_0508","42":"Diary_0508","43":"Diary_0508","44":"Diary_0508","45":"Diary_0508","46":"Diary_0508","47":"Diary_0508","48":"Diary_0508","49":"Diary_0508","50":"Diary_0508","51":"Diary_0508"},"Date":{"0":"unknown","1":677.0,"2":678.0,"3":679.0,"4":680.0,"5":681.0,"6":684.0,"7":685.0,"8":686.0,"9":687.0,"10":688.0,"11":689.0,"12":690.0,"13":691.0,"14":692.0,"15":697.0,"16":698.0,"17":702.0,"18":705.0,"19":706.0,"20":707.0,"21":709.0,"22":713.0,"23":716.0,"24":717.0,"25":718.0,"26":719.0,"27":720.0,"28":721.0,"29":722.0,"30":723.0,"31":724.0,"32":725.0,"33":726.0,"34":727.0,"35":729.0,"36":730.0,"37":732.0,"38":734.0,"39":737.0,"40":738.0,"41":739.0,"42":740.0,"43":741.0,"44":742.0,"45":743.0,"46":759.0,"47":760.0,"48":770.0,"49":775.0,"50":783.0,"51":785.0},"Entry":{"0":"\n\n","1":" - Got on board ‘Oxuauich’ for the front a practical illustration of packing sardines or boxing dates\n","2":" - Still on board too rough to land betting 10 to 1 on Anzac\n","3":" - Still on board betting 100 to 1 Anzac\n","4":" - Landed at Anzac started hill climbing the Major leading with a walking stick in one hand and fist full of air in the other we had packs so lost the Major.\n","5":" to ","6":" - Nothing doing, digging dug outs all day for some one else all spare time devoted to swearing and commenting on the wonderful organisation of the army especially the Aus Quota\n","7":" - Sick as a dog went to Europe and done my ivories\n","8":" - Installed in my new dug out 2nd I wonder for how long\n","9":" - Sitting on a phone in the trenches lisping messages and cursing everything & everybody. Had three spoonfuls of cornflower three times a day, and Im hungry\n\nJust heard got to vacate my dug out we’ll dig no more, Sigs busted up dam the army\n","10":" - feeling crook, our company goes to reinforce Lighthorse tonight Rumour says were going to take a trench\n","11":" - Went to the Light Horse outfit last night took what we wanted 18 casualties plenty of bombs, feeling better\n","12":" - nothing doing. Capt Simpson gone to grass, sick\n","13":" - 6 o'clock AM, looks wet, chap just told me that Birdwood's been given a week to do the job, I, being the idiot, asked what job \"why grow feathers on his tail like any ordinary \"birdwould\" smart eh.\n","14":" to","15":" - nothing doing at all\n","16":" - Went to see the Dr Re my ivories, over a fortnight now, nothing doing Oh he says \"hang on\", this hanging on racket is up to putty come up \"he says and get some light diet \" taking into consideration the fact that I have to walk about a mile up a big hill to get it, and when I do I can just see a little bit of\n\nsticky cornflower adhering to the sides of my dixie I said NO thanks Id rather eat bully and suffer indigestion \"well\" he said \" You eat bully\"\n\nStormy all day, Ive seen some storms but if anyone wants something extra special I can recommend Galipoli, she's a winner sure.\n\nbeen swearing all day till the dust got down and turned into mud, no water to wash it out with so am digging some out with my handkerchief! \n\nforgive the mark but its and old singlet that I have worn for six weeks or more. and there is some good sport in it. \n\ngot a rum issue half an hour ago it was good though it was muddy and had feathers \n","17":" sent 14\/-to Embros to get some scran I hope it comes \n","18":" \"Stood to\" at 4.30 AM this morning till 6 AM, Lord it was cold and drizzling rain was falling softly to the earth mostly by way of my back & neck. Trying to kid Abdul were going to vacate this little lot may just as well\n\ntry and kid or suck himself up a tree\n","19":" Paid a quid tried to buy jam & matches no luck\n","20":" managed to buy 1lb Margarine 3\/- and some chocolate 1\/- for cake \"cheap\" but not too bad \n","21":" Snow falling, very cold, started at 1.01 AM this morning still going strong no one seems very pleased about either, Im not, Im just wondering whether I own my own feet or not . Got an idea that they are cold for I cant feel any sensation at all.\n","22":" Nice day after 3 days severe cold snow started in to thaw\n\nParaded to OC yesterday about my teeth he is going to see about it and that is just about all about it I think.\n\nPut some biscuits to soak yesterday at dinner time they have been there 24 hours now and they are still as hard as flint \n\nThe battalion has been on half rations for over a week now and we will be on ¼ rations next week. Gott Strafe Kaiser Bill and Enver Pasha\n\nThe turks gave the beach nothing a few days ago blew our half\n\nfinished condenser to blazes and now we cant get water. I thawed some muddy ice to do me yesterday and xmas will soon be here I wish the parcel from home was here and that there is something to eat in it\n","23":" Went down to the beach got 4 tins sardines at","24":" per small tin and 6 milk at 2\/0 Jove I had a feed had the lot of sardines at one sitting finished up in fine style with a tin of milk\n\nAbdul been very busy with his big guns I wish he'd chuck it \n\nSmokes all gone reduced to looking for bumpers\n","25":" Tobacco issue day result 1 pkt cigs and 6 matches for a week . Problem how the hell are we going to do it that’s what the corp said at dinner time when they sent up enough meat to do 4 men for one meal and expected it to do 29 of our platoon. I said make it 28 corp I wont dirty my dixie.\n\nOh she was a winner.\n\nIve just smashed some biscuit and boiled them added \"some chase me Charlie\" cheese bumped a slight sensation of jam in it stewed the lot and shot it down my throat\n\nThere are strong rumours afloat that we are going to have xmas dinner in Egypt I'll make an awful mess of something if we do just heard that there is a mail in so am off to see if Im lucky\n","26":" The Colonel has returned things may look up a bit they could do with it. \n\nThe warships are putting in a bit of overtime handing out \"Iron rations’ to \"Abdul\" in slick time nice music, I hope \"Abdul\" gets them all\n","27":" nothing doing, either in the canteen at Embros or here Oh what a lovely system we work under.\n","28":" Issue of Gift Goods I collected a tin of Tomato Soup and it was good a nice \"niff\" about it quite distinct from that arising from dead Turks and Bully beef and such like stuff.\n\nWe move on Saturday for the Trenches of the 2nd Bn. Did not collect any mail. hard luck\n\nThey say old Kaizer Bill is going to dictate terms of peace on Saturday, poor old Bill he must be suffering from some slight hallucination of the brain or over indulgence in the delights of modern warfare.\n","29":" supposed to move at 6 AM for 2nd Bn trenches, order cancelled, ordered to move at noon for","30":" Light horse order cancelled, stop where we are, a little later ordered to move to old H.Q. after due deliberation and many varied comments on the armies administration, all of which, though very lucid and original, I could roll into one and lay out nicely and then add some, we moved.\n","31":" Installed in old H.Q. looks as if it has lately been occupied by a herd of swine taken all day to clean up.\n","32":" Tobacco issue again one tin for 4 men for a week. \n\nQ.M.S. Erwin gone to grass, sick , gee he's a fine sport, he looked as though he were going to die nearly made me sick to look at him\n","33":" Strange rumours afloat, we are going to evacuate one minute the next we are going to charge and the latest is no letters allowed either on or off the island sounds nice and comfy I don’t think \n\nI went down on the beach and that some big move is about to take place is evident, but what it is is the question. All the ASC and Odinance together Div HQ have gone The ordinance are giving away any amount of clothing I got a pair leggings\n","34":" Shelled heavily by 75s.Rumour very strong about evacuation and relief etc .\n\nThe order re the non posting of letters has been fluctuating on and off all day guess the heads are bit worried.\n\nWe have just been issued with a record issue of cigarettes 8 Pkt per man good egg Im going to have a smoke now\n\n16\/112\/15 We are evacuating the Peninsular at last the notice is official and the great move is about to come off the exact date I do not know\n","35":" Preparations still going on for the big move have to muffle one feet when the final act is staged\n","36":" Still preparing expect to move at any time now by jove if \"Jacko\" gets wise there will be a mix but he is quite welcome to come if he likes we are not particular whether we carry all our ammunition off or not. \n\nBeing fed well lately and plenty of clothes are being issued but will have to be left behind \n\nI wonder if \"Abdul\" knows \"Old Long Tom\" the big 4.7\" naval gun just below me while I am writing has been rendered hors de combat by having his breech blown off. By our our own people. \n\nIts hard to leave when you come to think of all your pals lying buried here or lying between the trenches and think that we are going to give up what have fought so hard to have and hold guess theres a screw loose in the machinery somewhere previously I just feel tired\n\nwe had to wait ‘our turn’ it came about 9.30 and we moved off leaving a very few men to follow when we reached the beach we got there after a hard march, 35 mins, duration , and embarked safely as did all the rest \n\nId have liked to have seen old Envers face when he got wise to it\n","37":" Arrived at Lemnos Is and transhipped on to a transport and from there on to the Island, of all the God Forsaken places on earth Lemnos take the bun, Wet cold and wind combined with all the little seemingly childish things and orders carried out regimentally makes life very nice indeed.\n\nA lot of gift stuff is coming to hand sheep skin vests etc.\n\nI believe we are going to get a plum pudding for Xmas we want it.\n\nThey say that Kitchener is big boss now and that we are going over to hammer or otherwise belt the arabs Turks and square heads etc in Egypt\n","38":" – Xmas eve; on board SS Simla for destination unknown. Egypt I guess, best boat Ive been on yet. \n\nI received a billy can with a lot of odds and ends in yesterday which was very acceptable one chap got a flask of what he thought was brandy but upon sampling it was found to be something entirely different. \n\nAlso had a xmas pudding between 3 of us which stuck to your ribs and was not at all hard to take.\n\nI had a bit of breeze with the capt yesterday went in to get paid the large amount of £1 and my way way of saluting did not please his majesty so he made me do it 6 times and gave me to understand that if I didn't hand it out properly on the seventh he wouldnt pay me, I didn’t – so I grabbed my pay book and pulled out, he called me in later on and after\n\nanother 5 attempts to reach the perfect article he handed me a note with a heavy sigh, I sighed in sympathy and made a graceful exit. Poor old Capt I think he ought to have medical attention or put under gentle coated with light diet: \n","39":" . Am not doing too bad considering all things had a fair dinner Roast Beef Potatoes and topped up with a slice of pudding just about the best Ive had I think. Still lying in Lemnos harbour but I think we sail this evening for destination unknown.\n","40":" . At Sea. Putting in time at submarine practice etc. the tin fish are fairly attentive round these parts I believe.\n\nWe were to have had a bottle of beer yesterday but an old wouser of a general we have on board vetoed the arrangement.\n","41":" all my money yesterday at Neptunes Palace nothing left to hit it high in the town.\n\nExpect to hit port tomorrow Im not at all particular when we hit port for they are feeding us well here\n","42":" Had a bit of a sea running last night and half the outfit was sick Im a pretty good sailor so did not have that luxury expect to get into port today sometime.\n\nArrived in Port at about 11.30 AM I hope we get ashore I could easily do a drink and feed after 8 mths of fighting!\n","43":" Went ashore last night on French leave, left ship by means of a rope over the side had a good time and hit ship, after inspecting two or three others at 6AM this morning without getting caught.\n\nAre camped in a square here now, with Mr Fanning in charge of the Bn, he is making use of his temporary promotion, he put me under arrest for tossing \n\nthe pennies. Ive got no money but I guess Ill beat it to town again.\n","44":" Got back at 6AM this morning after good fly in town, equipment and everything else gone Yours truly put into the guard tent , entraining for some where, arrived at as somewhere it’s a place called Tel-el-Kebir about 40 miles from Cairo, all the First Div. is here and they are exspecting some big stoush.\n","45":" feeling very crook after effects I suppose. Got to go before the Colonel this morning for sentence \n\nwent before the CO of the company Colonel evidently c ouldn't stand for my dial got severe reprimand which went in one ear and out the other\n","46":" Finding myself landed once more in \"Clink\" I take the opportunity\n\nMajor Heane has arrived back in camp and I put it on him for leave to get my teeth done but nothing ever came of it. Got a parcel from Bill and a sheepskin from Aunt Pris\n\nThe xmas one from home has not hit here yet and I don’t suppose it will either.\n\nWent on leave with a pass this time, and came back under escort so here I am in durance while awaiting trial but I had a fair time and hope to have many another \n","47":" Went before the Colonel this morning and was handed out a nice long lecture and 10 FP No 2, which is no joke\n\nwill write more fully on the subject and releive my poor brain from trying to solve the problem.\n\nI am forwarding this through the same medium as I received yours hoping it reaches you safely, and that your health is all as it should be, and that you are progressing well with your music, Hoping that the correspondence so started will not be allowed to peter out but no more enigmatical ones please. \n\nI will close. Yours etc.\n\nThey are feeding us in a very rotten way here, had tea only for tea tonight, greasy stew for dinner and tea & porridge for breakfast, no bread and tin of salmon between three men and we are supposed to get 8½ per day per man for extras I wonder where it goes to\n\nyou may as well complain to a log of wood as spit it out to any of the officers but the officers or \"one star artists\" as they are called are just about on par with a block of wood.\n\nWent up to get the impression taken for my teeth today and the joint said id have to get two more out, I got em, Gee he was some dentist, nearly pulled my head off and it was with a blessing and a softly spoken curse that I left that tent so have to wait another fortnight before my gums heal, Ive been over 3 months now without them. Oh its some life this sporting life. I wonder what it would be like to sleep in a decent bed get up at a decent hour have a bath and put on some clothes that\n\nwere clean and free from vermin guess the reaction would be more than I could stand. \n\nI think I ll turn in only one more defaulter call to answer thank God .\n\nI hope he chokes when blows it.\n\nSixth day of my defaulters just put me on fatigue but was not in the humour to do any digging so I pulled out suppose I will be up again tomorrow\n\nSaw Walter Christian last night he looks alright. They say we are going to move out on Wednesday and speculation is rife as to our destination personally I don’t care where to . After all I have posted that letter to Miss R. I hope it does not reach her .\n\nI put it in Lills letter and forget to take it out.\n\nI don’t think that things can be too good at home so have written to Griff\n\nfor news \n","48":" here I am on the last night of my defaulter, Im not sorry either got 3 days extra tacked on for having dirty rifle but the sentences were not concurrent so I fell in well. \n\nHad a big route march yesterday on an empty stomach it was rotten we kicked up a row and got a little cocoa at 9 o'clock at night. But today the tucker has been a bit better. Capt Fanning my pet has been transferred to Transport and is making himself extremely popular I don’t think.\n\nOur boss is just beginning to fall on his feet now its nearly twice too.\n\nCampey , our lance jack gone to grass, sick? Some of the boys have gone on leave and have taken more than they should have and \n\nthe Sgt is going crook. \n\nI wish they would pay me.\n\nId take french leave again.\n\nThe crowd are relating anecdotes of the war and the reinforcements wont believe half of it, say we are telling lies though we are not, that is what the general public will say when we hit back and start in to tell a few yarns. But it wont worry me any as long as I hit back with a full hide.\n\nHave not got my teeth yet, this humbug is getting on my nerve got some out for a start, a few days later had the impression taken the other day the bight was fixed and to-today I was to have got a fit in but it rained and they had to close .\n\nOh its nice and Im\n\nsuch a stiff sort of a chap. In fact I think that if I was the angel Gabriel flying up to heaven some idiot would take me for a crow and pat me.\n\nBy the way I found the letter I wrote to Miss R roday I evidently did not post it at all. She is a queer stick cant see how Lill came to connect her with mine I never did anything to her and I don’t think Lill has a grudge against me. \n\nI hear Billy Ley is coming here hope he last longer than who was in my opinion and that of the crowd a little rotter and the men are rather accurate judges of men very quick at picking out defects in their character etc.\n\nThey have plenty of scope just at present for\n\nemploying their ability\n","49":"\n\na new month started and we are still here, the first bde it seems are the divisional reserve for a while.\n\nI got my teeth day and they are the roughest ever. But as the quack told me they were not made in an up to date dentists parlour.\n\nI know that but I only smiled and it hurt too.\n\n5.2.6\n\nThe three chaps that went to the Lectoun signalling school have returned and 3 more are going I was not picked in fact they re sending reinforcements who have just joined up and left me out of course I went dead cold and as I heard that they were refusing to give me my\n\nleave I had a yarn to the boss and acquainted him with my view on the subject but he was not having any, he started in to blush and stammer offering explanations all in one breath finally ending up by getting wild told me I was not the OC of the Sigs and wound up with the request \"not to try and ride the daddy over him\" \n\nOh well he may grow up some day.\n\nI was some bodys birthday last night and as there was a brand new canteen open we celebrated and had rather a wild night of it. \n\nWe just send out scouts for some more but the beer outfit is closed up. So we all are sober and bad\n\ntempered its raining like forty cats too outside not at all a nice night the rain is coming in the tent so have to set to and do a bit to keep it out.\n","50":"\n\na lot of rumours flying about re leaving I only wish a few of them would eventuate. Got some Photos done the other day and have sent a set home. I hope they get there a long with the new testament which the Padre handed to me with strict injuctions to read.\n\nI go on leave tomorrow for 12 hours got 30 piatres about 6\/- to do it on\n","51":"\n\nWent on leave yesterday to Cairo had a rotten time had feed and couple of wads and all money was gone. \n\nCairo I think\n\nis just about the worst place out, dirt and the beautiful perfume of rotting vegetables and enumerable fowl and animals make a walk through its lanes very enjoyable \n\nA lot of the houses in one part have had a very rough passage, all wrecked by fire done by the Australians of course, \n\nOn the whole I had a rotten time and the 3 hours ride home in a cattle truck did not improve things.\n\nOrders to day to the effect that all leave is stopped and everyone is being recalled to their units \n\nI wonder whats on I hope it’s a more here out of this anyway.\n\nWeather warm\n\n"}}