{"Document Name":{"0":"Diary_0321","1":"Diary_0321","2":"Diary_0321","3":"Diary_0321","4":"Diary_0321","5":"Diary_0321","6":"Diary_0321","7":"Diary_0321","8":"Diary_0321","9":"Diary_0321","10":"Diary_0321","11":"Diary_0321","12":"Diary_0321","13":"Diary_0321","14":"Diary_0321","15":"Diary_0321","16":"Diary_0321","17":"Diary_0321","18":"Diary_0321","19":"Diary_0321","20":"Diary_0321","21":"Diary_0321","22":"Diary_0321","23":"Diary_0321","24":"Diary_0321","25":"Diary_0321","26":"Diary_0321","27":"Diary_0321","28":"Diary_0321","29":"Diary_0321","30":"Diary_0321","31":"Diary_0321","32":"Diary_0321","33":"Diary_0321","34":"Diary_0321","35":"Diary_0321","36":"Diary_0321","37":"Diary_0321","38":"Diary_0321","39":"Diary_0321","40":"Diary_0321","41":"Diary_0321","42":"Diary_0321","43":"Diary_0321","44":"Diary_0321","45":"Diary_0321","46":"Diary_0321","47":"Diary_0321","48":"Diary_0321","49":"Diary_0321","50":"Diary_0321","51":"Diary_0321","52":"Diary_0321","53":"Diary_0321","54":"Diary_0321","55":"Diary_0321","56":"Diary_0321","57":"Diary_0321","58":"Diary_0321","59":"Diary_0321","60":"Diary_0321","61":"Diary_0321","62":"Diary_0321","63":"Diary_0321","64":"Diary_0321","65":"Diary_0321","66":"Diary_0321","67":"Diary_0321","68":"Diary_0321","69":"Diary_0321","70":"Diary_0321","71":"Diary_0321","72":"Diary_0321","73":"Diary_0321","74":"Diary_0321","75":"Diary_0321","76":"Diary_0321","77":"Diary_0321","78":"Diary_0321","79":"Diary_0321","80":"Diary_0321","81":"Diary_0321","82":"Diary_0321","83":"Diary_0321","84":"Diary_0321","85":"Diary_0321","86":"Diary_0321","87":"Diary_0321","88":"Diary_0321","89":"Diary_0321","90":"Diary_0321","91":"Diary_0321","92":"Diary_0321","93":"Diary_0321","94":"Diary_0321","95":"Diary_0321","96":"Diary_0321","97":"Diary_0321","98":"Diary_0321","99":"Diary_0321","100":"Diary_0321","101":"Diary_0321","102":"Diary_0321","103":"Diary_0321","104":"Diary_0321","105":"Diary_0321","106":"Diary_0321","107":"Diary_0321","108":"Diary_0321","109":"Diary_0321","110":"Diary_0321","111":"Diary_0321","112":"Diary_0321","113":"Diary_0321","114":"Diary_0321","115":"Diary_0321","116":"Diary_0321","117":"Diary_0321","118":"Diary_0321","119":"Diary_0321","120":"Diary_0321","121":"Diary_0321","122":"Diary_0321","123":"Diary_0321","124":"Diary_0321","125":"Diary_0321","126":"Diary_0321","127":"Diary_0321","128":"Diary_0321","129":"Diary_0321","130":"Diary_0321","131":"Diary_0321","132":"Diary_0321","133":"Diary_0321","134":"Diary_0321","135":"Diary_0321","136":"Diary_0321","137":"Diary_0321","138":"Diary_0321","139":"Diary_0321","140":"Diary_0321","141":"Diary_0321","142":"Diary_0321","143":"Diary_0321","144":"Diary_0321","145":"Diary_0321","146":"Diary_0321","147":"Diary_0321","148":"Diary_0321","149":"Diary_0321","150":"Diary_0321","151":"Diary_0321","152":"Diary_0321","153":"Diary_0321","154":"Diary_0321","155":"Diary_0321","156":"Diary_0321","157":"Diary_0321","158":"Diary_0321","159":"Diary_0321","160":"Diary_0321","161":"Diary_0321","162":"Diary_0321","163":"Diary_0321","164":"Diary_0321","165":"Diary_0321","166":"Diary_0321","167":"Diary_0321","168":"Diary_0321","169":"Diary_0321","170":"Diary_0321","171":"Diary_0321","172":"Diary_0321","173":"Diary_0321","174":"Diary_0321","175":"Diary_0321","176":"Diary_0321","177":"Diary_0321","178":"Diary_0321","179":"Diary_0321","180":"Diary_0321","181":"Diary_0321","182":"Diary_0321","183":"Diary_0321","184":"Diary_0321","185":"Diary_0321","186":"Diary_0321","187":"Diary_0321","188":"Diary_0321","189":"Diary_0321","190":"Diary_0321","191":"Diary_0321","192":"Diary_0321","193":"Diary_0321","194":"Diary_0321","195":"Diary_0321","196":"Diary_0321","197":"Diary_0321","198":"Diary_0321","199":"Diary_0321","200":"Diary_0321","201":"Diary_0321","202":"Diary_0321","203":"Diary_0321","204":"Diary_0321","205":"Diary_0321","206":"Diary_0321","207":"Diary_0321","208":"Diary_0321"},"Date":{"0":"unknown","1":667.0,"2":668.0,"3":669.0,"4":670.0,"5":671.0,"6":672.0,"7":673.0,"8":674.0,"9":675.0,"10":676.0,"11":677.0,"12":678.0,"13":679.0,"14":680.0,"15":681.0,"16":682.0,"17":683.0,"18":684.0,"19":685.0,"20":686.0,"21":687.0,"22":688.0,"23":689.0,"24":690.0,"25":691.0,"26":692.0,"27":693.0,"28":694.0,"29":695.0,"30":696.0,"31":697.0,"32":698.0,"33":699.0,"34":700.0,"35":701.0,"36":702.0,"37":703.0,"38":704.0,"39":705.0,"40":706.0,"41":707.0,"42":708.0,"43":709.0,"44":710.0,"45":711.0,"46":713.0,"47":714.0,"48":715.0,"49":716.0,"50":717.0,"51":718.0,"52":719.0,"53":720.0,"54":721.0,"55":722.0,"56":723.0,"57":724.0,"58":725.0,"59":726.0,"60":727.0,"61":728.0,"62":729.0,"63":730.0,"64":731.0,"65":732.0,"66":733.0,"67":734.0,"68":735.0,"69":736.0,"70":737.0,"71":738.0,"72":739.0,"73":740.0,"74":741.0,"75":742.0,"76":743.0,"77":744.0,"78":745.0,"79":746.0,"80":747.0,"81":748.0,"82":749.0,"83":750.0,"84":751.0,"85":752.0,"86":753.0,"87":754.0,"88":755.0,"89":756.0,"90":757.0,"91":758.0,"92":759.0,"93":760.0,"94":761.0,"95":762.0,"96":763.0,"97":764.0,"98":765.0,"99":766.0,"100":767.0,"101":768.0,"102":769.0,"103":770.0,"104":771.0,"105":772.0,"106":773.0,"107":774.0,"108":775.0,"109":776.0,"110":777.0,"111":778.0,"112":779.0,"113":780.0,"114":781.0,"115":782.0,"116":783.0,"117":784.0,"118":785.0,"119":786.0,"120":787.0,"121":788.0,"122":789.0,"123":790.0,"124":791.0,"125":792.0,"126":793.0,"127":794.0,"128":795.0,"129":796.0,"130":797.0,"131":798.0,"132":799.0,"133":800.0,"134":801.0,"135":802.0,"136":803.0,"137":806.0,"138":807.0,"139":808.0,"140":809.0,"141":810.0,"142":811.0,"143":812.0,"144":813.0,"145":814.0,"146":815.0,"147":816.0,"148":817.0,"149":818.0,"150":819.0,"151":820.0,"152":821.0,"153":822.0,"154":823.0,"155":824.0,"156":825.0,"157":826.0,"158":827.0,"159":828.0,"160":829.0,"161":830.0,"162":831.0,"163":832.0,"164":833.0,"165":834.0,"166":835.0,"167":836.0,"168":837.0,"169":838.0,"170":839.0,"171":840.0,"172":841.0,"173":842.0,"174":843.0,"175":844.0,"176":845.0,"177":846.0,"178":847.0,"179":848.0,"180":849.0,"181":850.0,"182":851.0,"183":852.0,"184":853.0,"185":854.0,"186":855.0,"187":856.0,"188":857.0,"189":858.0,"190":859.0,"191":860.0,"192":861.0,"193":862.0,"194":863.0,"195":864.0,"196":865.0,"197":866.0,"198":868.0,"199":869.0,"200":870.0,"201":871.0,"202":872.0,"203":873.0,"204":874.0,"205":875.0,"206":876.0,"207":877.0,"208":878.0},"Entry":{"0":"\n\n","1":" – Anzac 1st A.L.H.\n\nC. P. by Capt Green, fine attendance, day bleak & wet. Furious naval bombardment at The Narrows judging by report of big guns. Wrote home to Mother and enclosed poem. St Luke’s day, on which Chaplain prays for Drs & med orderlies.\n","2":" Feeling a bit off indigestion had a good rest during the day. Good news from France & Russia but ominous concerning the Balkans. This is the period that the Turks have for a four days religious feast and we are fearing an attack so the trenches are doubly manned batmen sanitary & cooks all go in to make up extra strength.\n\nTuesday 19 Last night the 3rd L.H. Regs patrol was due home at 2.30 am but had not put an appearance in up till 10 am an officer and a man went out to look for them fearing they had been ambushed. The man returned wounded in the neck & the officer is still missing. The patrol was found later, they had been lost and nearly ambushed. Sir Ian Hamilton is leaving this Force, being succeeded by Sir C C Munro. He has written a fine thanking farewell to all men serving under him. \n\nRec mail today dated","3":" including parcels & papers but more letters to come. One of my parcels contained a Balaclava a welcome gift.\n","4":" A bulletin is published in the Peninsular Press giving particulars concerning the winter here and the time it appears worse. The coldest snap is about Xmas time when it snows heavily, birds are migrating daily in swarms including wild geese. When a flock comes over both the Turks and our trenches open machine guns on to them in the hope of getting a good bag. There is some possibility of our spell after all . The chap that got laid out whilst carrying a stretcher with me at Chailak Dere has now returned to the Amb after two pleasant mos in England – my luck is right out. \n","5":" Cold day spent time cleaning tank & sterilizing water. Our patrol found a party of Turks digging last night & returned & trained the machine guns on the spot & then went back & sent flare up. They gave the gunners some splendid shooting. Further good news from France & Russia but there is going to be serious trouble in the Balkans soon, owing to broken treatys & neutral respects.\n","6":" Cold bleak day with grissily showers. announced that we are likely to spend winter in Egypt. If so thats Heaven. Reported big allied victory 60 miles north of Salonika. Italy has declared war on Bulgaria.\n","7":" A cold bleak day, rained nearly all day in grissiyly showers. Inoculated against Tyhoid as it is getting very common, consequence sore shoulder all day. News comes that a British submarine sank two big steamers in Bergas Bay which I presume is on the coast of Bulgaria in the Black Sea. Wrote home to Mother in reply to letters .\n\nSunday 24th C.P. at the Amb in a large hospital tent. Col Merrington preached on the trial of our faith. Met two of the drivers who had bolted from Egypt to join us. Great news from Bulgaria & Serbia the enemy have had a severe reverse. During the night 85 reinforcements arrived creating a fearful row, they are part of the 5th 6th & 8th. They were a good stamp of men. It does not look as if we are now going for our holiday.\n","8":" Anniversary of the day 6 mos since our lads first landed on Gallipoli. There has been some great fighting about Bulgaria this past week but we have not heard particulars. The C.O. Colonel Meredith had the reinforcements paraded to day. He told them that they had to keep the good name of the Regiment up both \n\nin behaviour & fighting & working abilities. It is a name second to none on the peninsular. A few of the reinforcements went into A Squadron. The remainder went to make up old B, C being the same & the","9":" LH that are at present B, make up D squadron attached. I cannot help thinking that we are in for another fight before we leave the peninsular.\n","10":" Fine day again treat to get a little sunshine after recent weather. The Turks have lately obtained a lot more ammunition & they peppered the road at Anzac yesterday. Reinforcements went out sapping first time last night all have blistered hands this morning.\n","11":" Col Merrington our Chaplain left at 6 am this morning for England, then he returns to Aust. A furious bombardment on the Turks part with big shells occurred on the Lonesome Pine Plateau, a few bursting over Courtneys & Quinns Post. Then our batteries answered and it terminated in an artillery duel. Every body seems to have the rumour that we are leaving in a few days. I supervised the issue of water all day. The supply is now cut down to 3\/4 gal per man I only had 360 gallons to divide between 400 odd men but I got through to the last drop.\n","12":" A long list of successes have come to hand. The allies are doing well, Bulgaria has had a nasty knock and a British submarine has sunk a big German Cruiser \"Prince Adalbert\". We have lost two more transports. We now hear that we are going away in squadrons. Another busy day for me issuing water. The new reinforcements have a fearful thirst. The sea is very rough and the small boats are suffering. The tug has a job to reach the hospital boats with the sick in. So fierce were the breakers that whilst enjoying a swim I got washed right up on to the rocks.\n","13":" Every night two sergeants take it in turns to go out on a scouting patrol and each had reported a different story every morning. One man said that they could see a Turkish outpost changing reliefs, and the other said he used to go further and reported all sorts of wild tales but no outposts - an officer went with them last night & saw the outpost but the other man refused to see it. Something serious may come of it. A battery near us blew up a lot of wire entanglements on their trenches with 6 high explosive shells last night. Rec a letter from my brother to day.\n","14":" Derby Day in Melbourne and the same as other days on Gallipoli, the same old routine, although everything points to a move shortly. We have not lived so well lately, the beef & bread that was for us was washed off the barges during the recent rough weather.\n","15":" We hear that there has been a bit of an advance at Helles, our sapping party were fired on to-day. C.P. by Capt Green. at the my mates swim To go one of us must always be near the dressing station.\n","16":" I received a sturdy mail two letters from my brothers & papers & letters from friends in Egypt including a p.c. written in French which I translated. Our patrol went out last night to try & capture a Turkish patrol but returned unsuccessful. Good all round news from the fronts but no word of us going away and yet other brigades keep coming back.\n","17":" Cup day in Australia, every man is talking about his luck at being here, there is a sweep on it but we don’t even know the starters. Wrote a lot of letters to my Brothers, & sent many to home\n","18":" A glorious sunny day followed by a perfect night, there was a wonderful sunset over Imbros & Scrannathos Islands. The 4th & 1st Brigades are back They say they had a wretched time at Lemnos. The 2nd Brigade are still there sickness has broken our rather badly amongst them. rumours that there is to be an attack on Sunday\n","19":" Big mail in but no Victorian letters arrived yet. About nine pm just as we were going to bed a terrible amount of rifle fire started near Walker’s and they seemed to go round to Lonesome Pine. The fire became very fierce and we all had to stand to arms in readiness for two hours not knowing what the attack was.\n","20":" It has transpired what happened last night part of the 2nd Brigade LH had been out the previously night and commenced digging a big firing trench nearer the Turkish lines, but when they went out last night the Turks attacked them and there were heavy losses on both sides 3 of our men being killed. Rec 8 letters but all of a back date so I have a lot yet to get – rec some more canteen stores.\n","21":" Big changes here Col Meredith has been made temporary Brigadier & Major Granville is in charge of the Regiment. We also hear that some of us are going off for a spell in a few days being divided into classes for those that have never had a spell in the six months. I belong to this class. Shaved my mo off to day and getting a lot of chaff over it. Next day I excelled myself by cooking a big roast & potatoes & onions & a big raisin pudding. Inoculated again against Typhoid.\n","22":" I was on sick list all day I thought I was getting attack of Influenza, lay in all day & had a fast. Received mail to-day of a later date up to Sept 20th. Wrote home & just posted letters before I received others. We had two men hit to-day one on our anti-aircraft gun and the other sniped through going out on to forbidden ground, he got shot in the spine and there is little hope for him. More changes amongst officers our Brigadier General Chauvel has taken over command of the 1st Bde Inf in place of General Walker wounded.\n","23":" Another day on my back worse of any day lack of appetite & pains all over, as I have no temp The Dr cannot diagnose it. Put in a wretched day. There was 2\/6 sweep on the Melb Cup & over two hundred were in it. The winner who was not myself took £20 for first, we got the result through the wireless. A sergt in A Squadron won it.\n","24":" No better stooping over like an old man Dr at last has name for it – Lumbago and he sent me round to the L.H.F.A. Hospital so I am back again being nursed by my old mates. I was soon in bed and after interviewing all my mates went to sleep with a hot water bottle on my back. 90 of the 1st L.H. have gone for their spell. I was to have gone with them.\n","25":" On back all day pain getting worse Dr confirms Lumbago & is trying to fix me up if he cannot I will go away. Had a bevy of mates in to see me all through the day. Next to the hospital on the nearest poss is No 3 and the 2nd LH &","26":" are there, and they were all astonished by receiving a fusillade of 8\" shells amongst them, they killed & buried two wounded some & buried others alive, the wireless plant was destroyed & the operator killed.\n\nThursday 11th Major Fowler is going to give me a good trial evidently as he kept me here to-day & sent others on, my only relief is hot water bottles. I cannot lie in one position for more than a few minutes am on the ground now instead of a stretcher. Divisional Headquarters suffered from shell fire to-day they killed four & blew up various dugouts. It is surmised these shells come from the new howitzers we heard so much about.\n","27":" Spent a day of agony lying on my back, as they could not get the alcohol to inject they have decided to send me away & I will go to-morrow morning. The pain has now gone in to my shoulders and it is put down as muscular rheumatism. To-morrow all the drivers are due here from Egypt.\n","28":" All our drivers arrived this morning and I \nwill\n missed seeing them as I was transferred to the 13 British Clearing Hospital at nine am. I always said that if I left the peninsular it would be on a stretcher, and it was for two of my old mates had to carry me down as I could not walk I was put into a tent at the CS to await the barge that was to take us out to the hospital ship but the sea was so rough that the barge could not get in and we had to be there all day & night. During the day a terrific cheer went up and we all wondered it was it was a welcome to Lord Kitchener as he stepped ashore, surrounded by generals & staff officers. He made a short address to the men & then went up to the trenches, he passed the hospital so I just caught a glimpse of him. It was dreary waiting in the hospital no food only milk to drink and to cap it all during the night one of the men commenced delirious raving, he was suffering from religious mania.\n","29":" Weather rough all day barge could not come in for us so we had to lie there all day on starvation diet. My mates came down to see me. I was glad to meet them before I left. The hospital is full and none going off so it is to be hoped we go tomorrow.\n","30":"\n\nRegular gale all day sea running very high hospital boat had to take shelter in Imbros harbour, consequence we\n\nhad to put in another day – my mates brought me down some food, we were literally starving. The Turks shelled the ridge above us to day and shrapnel bullets came right through the tent one landed at my feet. No one was hit. In our tent is an Egyptian who is attached to a beach fatigue poor beggar was bad and I had to act as interpreter for him to the doctor.\n","31":" Calmer day and they commenced clearing the patients. They got off three barge loads during the night but I have to go in the morning providing the weather does not get rough again. The previous night we had a great victory on the left, as Hill 60 was blown up and captured with very few casualties on our side.\n","32":" We felt certain that we would get away about nine am as in the morning the sea was very calm and then to our chagrin another gale got up a regular hurricane. The wind howled and the sea came up in big breakers washing the jetty away and doing a lot of damage. The hospital boats had to take shelter at Imbros and we had to resign ourselves to another days misery, cursing at our luck for not getting off with the others. After tea it poured and the Turks got a scare and commenced firing madly thinking we were likely to attack.\n","33":" Day much calmer but as sea had washed away the jetty and the other one was wanted to unload provisions we could not get away but expect to to-morrow. I feel better but my back is still weak but I wish I was out of this starvation shop. Since I have been here 3 men have died \n","34":" About nine in the morning a sergeant called out walking cases for the boat only and knowing the rush I took no chances so by means of a stick & assistance hobbled into the barge it was just as well I did so for we were all taken on board my old friend the Galeka. My old tent mates that were evacuated a few days ago met me on the gangway & they had a bed reserved for me. I was done up by this time but after a while glory of glories I had a hot\n\nbath and changed into a new set of pyjamas and as soon as I touched the sheets was sound asleep, we filled up and proceeded at once to Lemnos where we anchored along side the gigantic Aquatania who is also a hospital boat.\n","35":" Did not sleep too well previous night in my new unusual surroundings of comfort but appreciated a fine breakfast. We left Lemnos for Malta about 9 pm after unloading all the Indians. The sea was a bit rough and to wards evening it became very cold and my Rheumatism became acute in every joint. a little Australian sister rubbed me with camphorated oil and then wrapped my limbs in cotton wool until I looked like a mummy - There is a fine Chaplain on board and he comes and sits on each mans cot and has a chat, we also sing hymns after tea and we have a fine little song service. He is always distributing cigs & comforts he is holding a communion service to-morrow. Last night he sat on my cot and talked for hours finding we had a lot in common.\n","36":" Had a good nights sleep, sea was very rough passing Cape Mataplan & the Graecian Archapelago and the boat rolled a good deal. I got up on deck to go to the service in the Saloon, it played up with me and I could hardly stand for the hymns although the service was good one of the sisters played the piano. We are being fed exceptionally well in great contrast to six months ago when we did that never to be forgotten trip.\n","37":" Terribly rough all day big sea boat rolled & pitched heavily, beds patients & crockery flying in all directions many seasick. We could not get in to Malta before to-morrow morning so the skipper changed his course and went with the gale to fill in the time. Had a good day and felt decidedly better.\n","38":" Sea still rough and as we had gone so far S. we had a lot to make up and only arrived at Malta at 6 pm anchored in St Pauls Bay disembarked in morning\n","39":" Commenced unloading about nine am. I was taken off on a stretcher as I was placed in a motor ambulance, some English ladies provided us with cigarettes & milk flowers etc. Then the motor took us right out of Valetta to a big bare building known as St Georges Hospital, I was placed in a large cheerless looking ward and was washed and put in a nice bed then the Dr came around and me he will overhaul me to-morrow. Had a high temperature and slept soundly.\n","40":" Early in the morning the night sister washed me and I felt easier, nine a.m. the Dr a fine clever physician examined me thoroughly and diagnosed something different but I have not yet heard its name. This is an English Hospital with the usual dull obvious Tommy Orderlies however the sisters are very fine we have one Aust in our ward and two young English Girls belonging to the VAD. Wrote to brothers\n","41":" Feel better, informed I was suffering also from sciatica, spent a restless day. Was plastered again by sister, consequently very sore.\n","42":" Cabled home to-day, we were paid also the big sum of 2\/- being our allowance whilst in hospital. We were all moved upstairs in the pm to G. 5 Ward we were sorry to leave the old one as both the Dr & sisters were splendid, the two sisters were Scotch and a young lady of the VAD. Our new ward overlooks the sea and at night time it is bitterly cold, their are two nice sisters in this ward both braw Scotch. I am lucky as I have two Austs each side of me and we manage to fill in the day.\n","43":" not care for new Dr so much as other, his treatment is not half so good. Have for the past two days been suffering from Neuralgia so I must have my last molar out when I am able. Wrote home during the day.\n","44":" Had a bad night with my head but my back is much easier. Dr has put me on No 3 diet for tomorrow after 6 weeks on milk. We hear there has been some big scrapping at the Dardanelles but nothing further – The Balkan situation is still critical owing to the hesitancy of Greece.\n","45":" Feeling much better excepting my neuralgia which troubles me at night, I am on ordinary diet now after six weeks of milk. Dr examined some of the old patients with a view to sending them on to England to convalesce. There is a big convalescent camp to be opened in Sicily shortly and it is expected that a lot of Australians will go there.\n","46":" Twelve months to-day since we arrived at Suez. Spent day resting up & writing letters. Felt better all day. Greece has not yet decided and The Balkans Crisis is the principle topic of discussion.\n","47":" Some men went to the convalescent camp just above the hospital to-day & a lot left for England yesterday. There was big row in Valletta last night between Maltese & soldiers . The Maltese being in fault however they are clearing a lot of troops out of Malta through it. In the p.m I got very bad with Rheumatic pains in the shoulders & had to get a special call from the Dr. Writing lying in bed I wrote a poem to my sister Elfie.\n","48":" Two men from this ward went to Eng to-day. We had an order read by the Dr from Lord Methuen the Governor of the island concerning the row in Valetta the other night. Feeling better Dr has ordered me a rest my nerves are pretty bad. I had a notice in Malta paper inquiring for some of my mates on the island. \n","49":" A lot more were booked for Eng to-day from this ward but no Austs. They are having a bad time on the peninsular for a lot of men are coming in suffering from frost bite & Rheumatism. My bed was carried out on to the verandah & I enjoyed a couple of hours in the sun. According to the papers Austria is suing for peace.\n","50":" All the warned men went to England to-day but there were no Australians amongst them – Every trouble or scrape that happens here a poor Australian is blamed for. They get blamed for every thing and it is all out of pure jealousy. The English people are not playing the game as they are making things unbearable\n","51":" Wrote home, I got up to-day for the first time surprised at my own weakness as I could hardly walk. I am now on tonics. Two boats have lately been torpedoed in the Med. Greece has not yet decided and as the Serbs are still retreating the situation is very grave.\n","52":" Managed to walk up & down the verandah a few times this morning but am terribly weak. Germany is trying in ridiculous terms to negotiate the peace, she must be on her last legs. There are no less than 75 hospitals in Malta. They dont know where to send the Australians as England is too cold & Sicily is still in abeyance.\n","53":" More Englishmen in this ward marked for England to-day but no Australians. Being a beautifully clear day we had the rare opportunity of seeing Mt Etna in Sicily. At night time there was a concert by a civilian party in the concert hall, I struggled across with the aid of a stick, but returned shortly as my leg would not stand the strain.\n","54":" Managed to get over to the recreation room, it is a fine place and as well as a good library has a nice coffee bar and a dry canteen. This is an immense place and has over 1000 patients in at present. It is rumoured that Greece has joined the Allies.\n","55":" Three men went to Eng from this ward, they are clearing Malta right out. a Tommy can get home with a toothache. There are only Australians left here now.\n","56":" Walked down to see a football match (soccer) between St Georges & St Davids resulted in a draw. They play on the hard stony ground. Greece & Rumania have both promised support to the Allies.\n","57":" Leg became very sore last night after I had been to pictures so I had a good rest to-day. A big bundle of Aust papers came to hand to-day and were very welcome to the ward we only just learned what one the Caulfield Cup run two months ago.\n","58":" There has been a big reverse in Salonika to the Allies and it is expected that 3000 wounded will shortly arrive. Up all day feeling better but\n\nI have developed the nasty habit of talking in my sleep and I awake suddenly and shout and light matches. The Dr says it is due to the state of my nerves.\n","59":" We received a lot of patients in our ward to-day they were Tommies from Suvla Bay they say it is is terribly cold there and the frosts are awful.\n","60":" Had to journey up to St Andrews Hosp a distance of about a mile to see the Dentist. He extracted a tooth (a wisdom) but I may have to go up again. Nearly all the inmates of our ward are up now and consequently there are a lot of jokes I was the victim to-day my two eggs with my name on were blown & the yolks extracted and the empty shells boiled. On retiring to bed I found my blankets & sheets reefed.\n","61":" More patients arrived from the peninsular to-day, they expect a lot from Salonika. I heard to-day incidentally that I have a chance of going to Australia yet.\n","62":" More troops arriving from the peninsular. They say that the left is heavily mined and is being evacuated but the Anzac position is the same. A few trenches have been taken lately & there is to be a final flutter to force the Narrows from both sides with the Russians on the Bosphorus. We drew our large weekly allowance of 2\/- to-day I also sent a Xmas Cable home.\n","63":" I believe I am booked for England after all, the registrar was around to-day marking destinations. We are all busy making Xmas decorations. Wrote home to-day.\n","64":" More wounded arrived from Serbia they say that the position is not very favourable and they had retreated seven miles. The Connaught Rangers being practically wiped out. At night went to Church in recreation room.\n","65":" Good news reported from all our fronts. day passed as usual in hospital\n","66":" Commenced hanging Xmas decorations, great rivalry between the wards.\n","67":" Accordingly to the Telegraph Mr Asquith has stated in the house that all troops have evacuated Anzac & Suvla Bay with insignificant loss. Where they have gone to we know not but we are naturally interested & bewildered at the news after Australians have lost so heavily. Greece is practically now in with us.\n","68":" All day we were busy designing & decorating our ward every ward is being done and there is keen rivalry between them, ours is easily the best in G Block it is one mass of coloured paper chains & Chinese lanterns the walls are our feature we have an Aust Coat of Arms over an Aust flag & I made on black paper and with cotton wool a large map of Aust and in it the words a Merry X to all those at home. At night we had some great revelry nearly every bed was tipped up & we laughed till our sides ached another chap & I gave some Amateur Theatricals of the Prodigal son & the laughter brought in a lot of other sisters to see the cause of the disturbance. Our night sister is a real sport and gives us a lot of privileges. We lost our doctor to-day.\n","69":" Who will forget Xmas Eve in Malta, we were busy all day completing the decoration of our ward, I designed four blankets with cotton wool and they are the admiration of all, the blankets were hung on the wall and in coloured wools we worked mottoes & a hospital ship etc. Our ward is I think easily the best and if not the prettiest the most original. At night time there was great revelry and at lights out all the day sisters came to the various wards and sang Xmas Carrols. They had three violins and they looked very pretty, it was a fine moonlight night and we were all disinclined to go to bed.\n","70":" One of the happiest I have ever spent, in the morning we received a very nice present from the Aust Red Cross Soc. And then our ward was judged and awarded first prize. We were all delighted as their was very keen competition. We sat down to a nicely decorated table and after singing Grace we had a splendid dinner with Xmas Pudding as well, in the p.m. we went to various wards\n\ngiving concerts at which I recited then to the Recreation room where we were entertained by a concert party at which the Governor of the Island Lord Methuen thanked us for what we had done. Our Xmas Tea was wholly provided by our sisters who bore all the expense. They gave us a delicious feast and we will never forget their kindness. At night time everyone was happy and many were two happy. It was a perfect day followed by a perfect night and as I did not feel like retiring I sat up nearly all night with the night sister and did the orderlie’s work as he was incapable. It was one of the happiest Xmas’s I have ever spent.\n","71":" I rec a welcome letter from O’R family this morning with Xmas wishes & card also a note from my young brother who is apparently in Cairo and I have been writing to him in Alexandria. I asked the Dr could I go convalescent to-day and thereby get back to Egypt where we believe the rest of the Austs are. He agreed and I will soon be back in Khakhi. Wrote home sending photo\n","72":" Quiet after Xmas festivities, went for a walk around the shore in the morning with the night sister, she is a bright little Irish Colleen from County Cork. Have heard no news from any of the fronts lately.\n","73":" We hear that there is likely to be big trouble in Egypt shortly so I am trying to get back there without going convalescent\n","74":" Rec an order that I was to go down and get my clothes and be in readiness for the convalescent camp. I was very pleased to be back in khakhi again almost as pleased as when I got back to civilian clothes again. However we did not go to-day There are six out of our ward nearly all Austs. I suffered a little at night with insomnia so got up and sat before the fire with the little night sister. She loves my poems and would go further if I allowed her, she is a dear little Irish girl and that is all to me.\n","75":" We did not go away to-day and after attending a football match we decided to break out in a party of four and go into Valletta\n\nWe got out alright and had a great time but coming back we had a misfortune it is very hard to get into the hospital for guards & police and we were handicapped by a Irishman who belonged here and whom we picked up incapable, however we dodged all sorts of adventures and we got him safely in his ward but two of my mates who were walking in the rear got caught and we were chased and only got back in the ward by climbing up a drain pipe at the back. The night sister had everything right for us.\n","76":" Eve. Orderly room for my two mates in the morning and they received a drastic punishment the corporal losing his stripes whilst the Aust received 10 days F.P. No.2. We are all incensed at the verdict and it is only another mark against the accursed Tommy Army regulations and their hate of Austs. Especially when the police are lot of cold feets whose duty it is to crime men who have done their bit. There is a great rumour going about that all the 1st Aust. Contingent are going home on 6 mos furlough - If it were only true. Sports meeting for the orderlies in the pm.\n\n Sat up and saw the old year out and the new year in with little night sister.\n","77":" Have not rec any mail yet and not away from here, so my mate & I paraded to the C.O. & asked if we could be sent back immediately. There was a splendid concert at night rendered by the nurses & Drs of St Andrews Hospital. The night sisters had a party afterwards.\n","78":" As usual no sign of getting away, a dreary day, no mail or news. Went to Church at night returned to Ward to find the boys having great fun pulling down the Xmas decorations and stuffing them into an absentee’s bed. Wrote home and to others. N. Sister and I spent a happy night, it is the only bright spot in this hospital. \n","79":" There has been some scrapping in Egypt but everything points to a big fight there shortly preparations are being made here for refugees if needed. Another false alarm about going away to-day. Rec parcel & letters from O’Rs & & \n","80":" My mate Nagle the wild Irishman got caught in Town last night and was awarded 6 days F.P. There is quite\n\na squad of Aust LH men doing C.B. and they are all longing to see me with them. Many false alarms about Egypt. The mail boat Persia that called here a few days ago has been torpedoed. Could not get away again to-day. N.S.A night. \n","81":" At last the news has come, they are making a big clearance out of the hospital to-day 110 Convalescents are going into camp. We formed up at 4.30 and were marched to the orderly room. Thence the long procession set off for All Saints about a mile & a half. We got a great send off from the other inmates my two mates & I were at the rear so we waited and got a cab & drove up whilst the others lugged their packs up a steep hill. We arrived at the camp and were designated to tents, we were fortunate in not being separated and four of us are in the one tent, after going to the canteen we retired on to our hard beds and simply froze all night through cold and we only had two thin blankets.\n","82":" In the morning we were busy making our single beds into double so as to get extra warmth. Then we were medically inspected I had a job to pass the doctor, as I paraded for active service then we were put on the pay roll and we had the rest of the day to look around this splendidly equipped camp, it is a real home but is full of fellows who intend staying here for the duration, I am ashamed of some the Australians, men who have only seen a quarter of the service I have, and are yet dodging the firing line. I feel quite proud of my record in comparison. My wife & I slept warmly last night as we cuddled up under four blankets. Rec two letters from my brothers.\n","83":" We were paid in morning and went on leave in pm and had a rattling good time in Valletta Messudich & Sliema had my little mate & mine’s photo taken, we returned home in time to enjoy a splendid concert given by English civilians in the beautifully equipped Y.M.C.A. tent.\n","84":" Went down to St Gs and saw who were left of the old patients of G. then we went into Sliema and walked home. It is a jolly shame to see the number of men walking about here who are swinging the lead for the duration of the war. I thank Heaven I am proud to say I have not shirked\n","85":" Wrote home, bitterly cold day rained heavily at night. Went to Church at Pembroke in morning to meet N.S. At night went to service in Y.M.C.A.\n","86":" Met N.S. in the morning down at the beach stayed there till dinner time. A lot of men went to Gaza to-day I could have gone if I wanted to but preferred to take chance of getting back to Egypt sooner from here. Went into Valletta in pm & called in St G on way back. \n","87":" Down at beach again, she is a dear little thing and is very much in love with me, but to me she is just a bonnie little pal. We hear that the whole of Gallipoli has now been evacuated so there will be something doing soon. Another British battleship has been mined This time the King Edward VII. Concert in Y.M.C.A. at night. I rec two encores for two pieces\n","88":" Bitterly cold day, medical parade for Active Service I missed it through being out with N.S. my mates got marked A, so I am endeavouring to do same. Debate at night, wrote home.\n","89":" Cold dreary windy day, but lovely night met N.S. & went for a drive in returning in time for her to go on duty I got marked for Active Service to-day but had a hard job.\n","90":" Pay day drew £ 1. A terrific gale blew all day, hail & wind tents were flying up in the air in all directions, bitterly cold and nowhere to go save to the Y.M.C.A. where their was a concert given by a very amateurish civilian party, it was agony sitting there freezing returned to tent expecting warmth in blankets only to find our tent down.\n","91":" Met N.S. in morning went to Valletta & Sliema in pm had enjoyable day went to pictures at Sliema on return. Met pretty little French girl inside had a pleasant chat sorry when we had to face the cold miserable long drive home. Probably be going away this week. \n\nBeautiful","92":" day met N.S. in am. Wrote home in pm then went down to St G to say good bye N.S. got night off and we went for a stroll & drive perfect night.\n","93":" We did not go away as expected stayed home all day & played cards had damnable luck all day went down to St G at night saw N.S. after saying good-bye previous night. Hear all sorts of rumours concerning the Light Horse and an engagement, we are desperately trying to get away in case we miss anything. Rec letter to-day from my brothers – All Correct\n","94":" Met N.S. in morning and through some intuition she said that it would be our last meeting & so it was for shortly after dinner a call came for 61 men to go to Alexandria this afternoon. There was a great race to the orderly room and a scramble to get our names in we four mates were very fortunate, so we packed our kits and were marched right into Sliema thence across the ferry to the Grand Harbour then a roll call and so on three stowaways were sent back. Then on to a trawler which took us out to the big Orient troopship Orsova which was crowded with Tommies who were all very eager to see some Austs. We were besieged with questions until tea time and night and then we slept on deck. I managed to send a note to Win poor little thing she was broken up over it and I felt rather miserable too, as it has been a delightful romance but on my part could not develop any more, although I grew very fond of her and her sweet Irish ways.\n","95":" We sailed at six am and then the fun started, all the troops on board are going out for their first time and the officers and men are all as raw as can be. Red Tape is everywhere and Tommyism is in its first place. There are only 37 Colonials on board and we fell foul of the officers immediately, an order was issued that every man had to wear a lifebelt night and day and go about the deck bare-footed. We all ignored the order and were being chased by subs & Tommy sergeants. The recruits regard us a semi-gods and ask all sorts of questions, as soon as one talks he is surrounded. It is like the old soldiers & the schoolboys. The best of all was when they made us sleep on deck at night. It seems as if they are really certain of being sunk and the officers and men are all panicky. They talk of nothing else except periscopes & submarines day & night.\n","96":" In the morning a big sea was running and the boat rolled about a lot, most of the Tommies & officers were sick and we had a bit of our own back as we played steeplechases over them on the deck. A rumour says that a boat was torpedoed 12 hrs astern of us at 6 pm at the same spot that we passed at 6 am.\n","97":" We now hear that there were two boats torpedoed yesterday both French, one however escaped. We were too far ahead to take notice of their frantic SOS message, and it would have been useless to turn back, we presume she sank.\n\nArrived at Alexandria at 2.30 and safe in the harbour. Many a time in the recent few months have I wondered whether I would ever again be here.\n","98":" After a lot of humbugging we eventually disembarked after lunch. The infantry going to Tel el Kebir and the nine Light Horse all went to Cairo. We walked into the town thence took train to C. after a few hours leave eventually after the tedious journey we arrived there and I was immediately met by my good friends Lewis O’R & whom I had previously wired. Then my disappoint came. Firstly my brothers had gone to Tel el Kebir and Lionel had only just left at six o’clock, Then we learnt that our brigade had gone away to Wardan on patrol a week ago, and full strength to so all was left for me to do was to go into our Detail Camp. \n\nMy Chagrin was pitiful after 18 mos soldiering here I am back as a reinforcement, my luck has been proverbial then as our reward for what we had done on Gallipoli they gave us two sweaty smelling saddle blankets to sleep in, I was so angry that I walked about all night and learnt all the news off the guards but that will come later. It has been one of the cruellist blows I have ever had as moreover I was promised and assured of a sergeants position and now what am I – only a recruit again with men who enlisted only a few months ago and I with five engagements & 18 mos service – Ough --- In the morning I will learn my fate as to my future intentions\n","99":" Paraded to Orderly Room in morning and was taken on strength. The W.O. is one of my friends and he gave me the best job he could, that of AMC Detail with the rank of Temporary Sergeant but no extra pay and only priviledges which are worth it for we live in the sergeants mess. I started work immediately with the mornings sick parade there are two others helping me and the Dr seems a decent sort his name is Capt Hill, we did a very large sick parade and I had a lot of dressings. Then I went on leave to O’R’s and received a splendid welcome from Mrs O’R & Family. Then in the midst of it, we heard a commotion at the door and in rushed my bonny two brothers, looking in splendid health, it was a touching meeting and one of my proudest moments as I shook hands & kissed them for the first time all in uniform. After about two hours frantic questions we adjourned to a photographers where we had our photos taken Then we returned for tea, leaving for the tram about 10, the boys stopped in town and are returning to Tel el Kebir in a.m. If our mother could only have seen us to-day we met whilst she was at Church it was one of the happiest days of my life.\n","100":" Got through a big sick parade in morning over 130. I do all the dressing & rubbings & massaging. I then went on leave to Cairo armed with about 10 different passes. Firstly I went for my long lost mail only to find it was at Alex. Then I had to go to the Pay Office to try and draw some of my back pay. They only gave me half of what I asked for from there I went out to Ghezhireh to the Aust Overseas Base and I got my black kit bag that I stored at Alex eight mos ago it was all intact, thence to Mrs O’Rs where I had a great talk to her about the boys. I returned home to find the Medical Tent shifted and I walked all over the camp before I found it. It rained heavily all night and I got wet through by Egypts annual rain.\n","101":" Rained heavily all last night and to-day was the wettest and bleakest day I can remember ever in Egypt. Last year it was lovely at this time. To-day I received a splendid surprise when I walked into the P.O. here and was handed no less than46 letters being part of the bundle my mate has been holding for me, it took me a long time to read them & they all contained good news, one the news I have been waiting for for mos. \n","102":" Big sick parade in am. 270 in all a lot of mumps patients and a lot of malingerers. In pm went to Cairo and cabled to thence to Mrs O’Rs. I then went to see the Sisters of Mercy at the Convent, they have prayed for me every day since I have been away. Got photos of Boys & O.R’s & myself.\n","103":" Rained bleakly all day spent time writing letters I got through a dozen. Everything points to me getting the sergeants position with the 12 LH when they reform, it is up to me to get a decent job now. There must be 200,000 Austs in Cairo now, there are camps everywhere Tel el Kebir is enormous. We hear the brigade is a bit split up one half being at Wardan and one Regiment at Katatbar, whilst another squadron is further out scouting on the enemy who are only a few miles away they are Senussis desperadoes.\n","104":" We hear rumours of canal scraps and of our brigade and the Bedoins, the latter are now likely to forget their other hiding. This regiment is steadily growing stronger and now the strength is 80 to a troop. There are 2000 men in camp here altogether. Went to O’Rs at night.\n","105":" \nWent to\n Received pay in morning and after lunch went out to Ghezireh to the races. I had an enjoyable day but an unfinancial one as I lost Too many of the Australian Turf riff raff are getting there and many make books whilst a lot of the boys are riding. They had a hurdle race for Aust Horses and it was a great joke it was won by Geramy ridden by Foley. Met a lot of old friends from the brigade. Apparently they are not having too good a time. Went to O’Rs at night.\n","106":" About 10 am. great rumours were flying around the camp. Then all the leave was stopped. Then the 8th LH were sent into town and the reserve Inf Battalion were issued with ball ammunition and despatched. It appears that the Egyptian Reservists were dissatisfied with their pay and the Arabs that were with the Camel Corp were getting more pay than them so they marched in a body to the Sultan’s palace and a riot occurred and our chaps had to settle it and they did it properly. There were a few casualties but nothing to what was anticipated.\n","107":" In the morning we got leave to go to Tel-el Kebir but after rushing in we just missed the train so we had an enjoyable holiday in Cairo, visiting Maspero Freres, we had a pleasant holiday and I think we deserved it.\n","108":" Anniversary of the day we left Ma’adi for Heliopolis and made this camp. Now to look at it and see the changes on such a gigantic scale it makes us feel real pioneers. There are camps everywhere stretching from Oasis to Helmich Zeitoun & Matarieh and when we came here it was just one vast stretch of loose desert sand, now it was hard as a rock stamped by the feet of thousands who followed us. Never went out to-day & sick parade much smaller, we have a fine doctor and altogether a good time as I have all the privileges of a sergeant. Did big SA parade of 560 in pm only one delinquent.\n","109":" Another big SA parade few coughs I received some sad news that they had buried poor little George Briggs of the Amb he died of meningitis he was the NCO of our tent and one of the very best.\n","110":" To-day I left the camp early in the am and caught the train to Tel-el-Kebir, after a long tiresome journey I arrived there only to find that all the brigades had gone to Ismaliah, but after walking about two miles I was very fortunate in finding the 6th F Amb who had been left behind so I met my two brothers and had an enjoyable day, I did not leave until ten and it was one o’clock in the morning before I arrived at the camp. \nadventure Princess \n \n","111":" A beautiful day sick parade much smaller in pm went down to Abbassia No 4 to try & see Sullie but being a meningitis contact I was not allowed in the ward so I bought a lot of oranges and distributed them amongst the convalescents.\n","112":" Went into town at midday to buy Gwennie a birthday present then went to the house it poured raining all the time I was coming home and I got drenched. There was a bit of a riot here at night some of the men broke the canteen open and took out 3 barrels of baksheesh beer, 31 arrests were made.\n","113":" A bright sunny day I awoke feeling some thing wrong with my eyes, and on looking in the glass I saw the usual dilation of one of the pupils, this has been quite regular and I put it down to reaction of the nerves, then my right eye was up to-day so I went to find the doctor and as soon as I went out in the bright sun I went temporily blind and lost the use of the lids. I saw the doctor and he gave me a fright by saying I had partial paralysis. I put on black glasses and they immediately got better. I am going to a specialist in the morning.\n","114":" Went into specialist at 1 AGH in morning and I was thoroughly examined, I went before two doctors and the test lasted about an hour eventually he told me that my optic nerve was alright and I need not worry but as soon as the eye again enlarged I am immediately to go down. It was a great relief to me as I have been dreading it. I believe all my mates of the L.H. F Amb are now contacts at Abbassia.\n","115":" I went down to Abbassia to see all my old LHFA mates who are in hospital as meningitis contacts, only one is at all suspicious the others are just contacts. At night I went to the big entertainment at the Opera House, we reserved seats. The company were Red Cross Helpers and were very good, all professionals. They called themselves The Pops. It is the best show I have seen since I left Aust. During the day the remaining squadron of the composite Regt returned from the Western Frontier. They report they had a big scrap on 23rd Jan but beat the enemy although there were 300 casualties in the force.\n","116":" Worried all day as I am in peculiar predicament I have an opportunity of going home to Aust as AMC Detail on a hospital ship and my application is written out & signed by the Dr. Then again I am promised the sergeants job with the 12 LH and they expect to reform this week so I am between two fires but I have decided to withhold my application for a few days. Rec letter from Malta NS.\n","117":" Had a touch of old Gallipoli dread again had to drug myself heavily to avoid it. Five old LHFA mates are here in the camp now as they have returned from meningitis hospital I had them up sleeping with me and financed them.\n","118":" Went on leave with Bert W & Jim K. Called on Sullie and then went to town spent day there went to Kursall and Abbaye-de-Roses a soir.\n","119":" My turn to stay home and it was an eventful day, casualties kept coming in I had to stitch up a chap who was wounded by a bayonet through skylarking then there were two football matches on and I had nearly all the losers over to be treated one man was brought in unconscious and another who was drunk was run over by a gharri. There was no doctor in camp he was at the races, one of our lads was riding Gossamer and his mount fell and rolled on him. After Tea I sent four men to hospital suffering from Ague Pleurisy, Ptomaine Poisoning and Meningitis Query (Temp 104°). Wrote home and to others.\n","120":" Big parade in a m. I did all the dressings by myself, in pm took Bert W to O’Rs spent pleasant day went to Bulac had game of tennis etc. returned for Gwennie to give me my French lessons.\n","121":" Have not received my mail for a month except strays. To-day I had the pleasure of meeting Major Lewis who as Captain I nursed back to life on I assisted at his operation on that awful night of May 20th and then I had to sit up and fight him all night while he was unconscious if any man passed the gates of death he did. He was very pleased to meet me and anxious to hear all about his behaviour etc. It is a pleasure to meet any old patients it makes us think we did some good after all.\n","122":" Another of those miserable wet days. I had to go to town to see ADMS concerning transport work. Saw Col but he cannot promise anything definite as order has been cancelled. Had my book Audited and drew money for dentist, then went to Shoubra and spent evening there All the LHFA lads have returned to Mena\n\nnear Luxor. The 1st Brigade has left Wardan for there and expect a scrap there shortly.\n","123":" Paid to-day I have had a lot of money lately but it has all been to dentist etc Had my teeth thoroughly attended to, crowned etc\n\nThursday 17th Over at drug store getting full supply in we are now doing sick parade for 3000 men as the 13th LH Details are now attached here. The 12th LH are now detached from the","124":" My mate Sullie has now turned up and is anxious to get back, but we are having a good time together.\n","125":" Did a lot of dressings during the day all fresh accidents and just as I was getting into bed after returning from the Kursaal with Sullie, a drunk was brought in with his head split open I had to shave and put four sutures in and he fainted on me and I had a job with him. However I made a decent job of it and he was able to walk back to his tent.\n","126":" (Eventful) Alongside our dressing stn is a stable and the famous Boom is trained here by a boy who I used to know well in Melbourne. To-day I journeyed out to the races to back him but we worked a joke and I had a good win on the winner Geramly, I had a wonderful day and I backed five winners out of five bets I could not go wrong. We celebrated it at night, by driving to the Kursall to the Review ‘Smile Up’ and afterwards had a six course supper. It was great day for me but Sullie did not do at all well, nor any of my mates.\n","127":" Sullie & I went to town in pm to Bulac to the club and then to Shoubra but we stayed too late and we never troubled about passes and the consequence was that we were caught in a raid on the tram by the red caps, we don’t know what will happen but I hope Sullie will get out of it alright. A big mail in and I rec some old strays, wrote home to Mother during the day.\n","128":" About 12 am I was sitting in dressing station when I heard a shout \"AMC at the Double. I rushed down to find that a poor chap named Le Mesaurier had shot himself through the heart I attended him before the Dr arrived and luckily got him away in an ambulance that happened to be handy. He was just alive before we sent him away. Poor chap admitted he did it himself, it was a heart breaking case of a brave man. This man was in my right on the Peninsular and although he wore glasses and was med. unfit he was one of the pluckiest men in the reg, he would go anywhere. Since he has been in Egypt he has been sent back from the reg as unfit and it hurt his pride so much that he ended his worry. He was a DCM man too. In pm went for a ride my first for 10 months all around the various camps and I met a lot of old friends, evening Kursaal with .\n","129":" We had a meningitis case a few nights ago. Le Mesurier by some freak is still alive. The 12th ALH went away to-day. I will follow.\n","130":" Rec some stray mail, The 12th sent for me to-day and I went over but my transfer is not yet cleared but I hope to be temporarily attached. \n","131":" Went over to Oasis to the 12th LH to make arrangements about my transfer. Town at night rec two letters from home.\n","132":" The Dr at Oasis is very busy and no arrangements have been made yet so I went over and arranged with him to temporarily attach me pending my final transfer. Major Vernon released me and I came over here late at night.\n","133":" In morning did sick parade in a rough way with my new Dr Single the great cricketer he seems a very decent fellow, I was very busy in the morning and I rushed away in pm to races as I had made previous arrangements. I had a disastrous day as I lost PT. Boom ran third. Describe the 12th later.\n","134":" Did sick parade in morning and then chased around various camps and drug stores trying to obtain essentials. Everything is chaos as we are not settled and are at present in a bell tent and all my drugs are on the ground. I cannot even dispense my own medicines. Wrote for Lionel to join me as Dr has given consent for me to claim him as I am his guardian. \n","135":" Had busy day as I was chasing round various camps pinching & begging odds and ends. The 3rd LH Bde left to-day for Serapim and I received nearly all their tables chairs and surplus drugs of the 10th LH. I fixed everything up nice and comfortable and by night time I had the hospital tent looking like a chemists shop. Wrote two letters home and received three more.\n","136":" Last day of Leap Year. What a time the girls in Australia must be having. I spent the whole day dispensing medicines. I made up four gallons of cough mixture Pot Chlor, Astringents, Soda Salays etc. I made enough to last me for a month. Dr prescribed and I dispensed. It was a busy day for me as I am unaided and doing four men’s work I was going from 6 am to 8 pm.\n","137":" Hot day miserably so, after a busy day decided to run into O’Rs to get away from the desert heat. Rec three more letters from home. Sullie went back to Mena to-day. \n","138":" One of those cursed dusty days It blew all day all my drugs & dressings were coated inches deep with thick dust. To-day was the anniversary of the formation of the 12th Reg and the men had a half holiday whilst the officers had a spread, it will soon be my second anniversary.\n","139":" Five AMC men were sent over to-day by mistake so I took one and the others were sent back. I want to keep the place open for my young brother. \n","140":" In a m over at drug store I met an old schoolmate there and consequently did very well as I obtained more than my req. In pm went to Races at Ghezireh had a miserable day, poor meeting small fields, backed three winners and yet lost 300 PT. Then went to O’Rs where a letter was waiting from my brother Harold no address heavily censored apparently his other letters to me have been destroyed.\n","141":" Small sick parade spent pm writing letters. Dispensed five bottles of drugs.\n","142":" During the day I rec a telegram from Lionel saying he was in Cairo I went into O’Rs to meet him found him looking well and hearty he had not received my letter as Harold and he were separated owing to the new regulations that Ambs only carry two sections and Hal is staying in his corp whilst Lionels section has been formed in the 12th F Amb and he is at Tel-el-Kebir.\n","143":" Lionel came out to see me in a m and agreed to come with me in regt and he took a letter signed by the adjt and myself back with him. I went in to see him off by night train and then to O’Rs Wrote two letters home. I will be very glad when the youngster is with me. It seems now as if we are not going as Divisional troops after all but are being attached to the 2nd LH Bde, so we may not see France after all. I think all the inf will go, in fact they are preparing now. There will be Five Aust Divisions then & one NZ making two Complete Army Corps.\n","144":" Our Col is making things hum and fully intends to make soldiers of the men, there was a Review inspection to-day and the drill was perfect. It seems certain that we are now joining the 2nd LH Bde.\n","145":" Great news from the Caucasus apparently Turkey is wavering. The big German offensive at Verdun is resulting in huge enemy losses I fully expect it to be the turning point of the war. Concert in mess room at night at which Drs & sisters attended great revelry. \n","146":" Rec two letters from home in receipt of my cable when I met the boys. A lot of troops have left Cairo recently and we know for certain that most of them are for France.\n","147":" Went to Ghezireh races in p m another poor meeting, I had poor luck as I backed three winners and only came home square. After to O’Rs.\n","148":" My busy day dispensing all morning did sick parade myself, Dr out for day and I let my assistant go. In p m wrote an article for London Daily Mail, called Anzacs – The Unconventionables.\n","149":" More troops have gone to France, but we do not know our intentions we have not even got our horses yet. Went into Cairo for a walk round in\n\np m.\n","150":" Ceremonial Parades every day there is a rumour gaining currency that the regiment is going to England. Now that they have up to the 64th Batt they are making a lot of new Artillery Brigades and are building them up out of the Detail Camps of LH.\n","151":" Dispensing Day. My transfer has at last arrived and in the night orders I was read out as to be Corporal to Lance Sergeant. So after 20 months service I have my confirmed rank. I received a great ovation from the mess when I entered. Went to O’Rs at night.\n","152":" It has cost me something to christen my confirmed stripes and there was a celebration by my fellow sergeants at the mess. I am proud of my rank now as I know I have had a hard fight for them with all previous luck against me.\n","153":" For the past week I have had a brutal cold that has been causing a lot of trouble. It is the worst I have ever had, medicines wont break it and it leaves me gasping for breath.\n","154":" I believe the 2nd Division has gone to France and if so my brother Harold has gone with the 6th F Amb. I have not heard a word from my other brother. I fully expect to see Peace declared in a few months as all the Central Powers seem to be weakening. Nearly all the LH Details have transferred to the new Artillery Brigades and I had an excellent chance of receiving a commission had I applied. In pm went to Bulac to see the big football match between England & Scotland. The former winning.\n","155":" Medical Examination of Regiment, A Squadron done to-day, wrote home, lately my mails have been very unsatisfactory. The Price of Wales is now in Egypt and it is rumoured that he will inspect this regiment.\n","156":" My cold is much worst and I have completely lost my voice. The damned thing has also brought on Rheumatism. B Squadron examined to-day. I now have my surgery & dispensary complete and it is second to none of any regiments in Egypt.\n","157":" Very few troops are now seen in Cairo in day time, discipline has become very strict. No 1 AGH is closing down and I am now sending all my patients to Col Flasches No 3 Abbassia. About 6 pm my young brother Lionel arrived he could not get his transfer through he is coming however we went to O’Rs and then he returned and slept with me. \n","158":" Lionel left in am with note from adjt. Pay day for us I stayed till late at night doing prophileptic treatment.\n","159":" Sick parade exceptionally good Our neighbours the 11th are doing four times as many as us. Getting very hot.\n","160":" Gordon Gabriel came out and stayed all night We hear that there is a probability of going to Alexandretta to Navy and at Constantinople concert and lectures Sergeants Mess.\n","161":" Went to races at Ghezireh backed four winners but did not win on day missed the two big ones. Nick White rode two seconds at night went to Kursaal to hear sing afterwards Tiger Lily Abbaye-de-Roses\n","162":" Hot day wrote home one of my serg mates came down ill and I put him on my bed, later I became anxious and finally sent him away with meningitis with very little hope he is the bandmaster.\n","163":" Had to go to A.D.M.S. at Abbassiah and coming back I had a bad turn I got a sunstroke and\n\n \n\nTeenies News \n\nfell down in the middle of Heliopololis and one of my mates brought me home in a gharrie. I received five letters when I got back and one contained the news I have been dreading it just about broke me up, and as I was ill it made me a pretty desperate man. It knocked me all of a heap as it was my last castle on the ground my shattered idol. \n","164":" Felt better in morning but frightfully upset over news but have made a resolve not to worry over it as it is final now and lost beyond recovery. Had to go to A.D.M.S in a.m. Then to Drug Store.\n","165":" Rec another letter from . It is rumoured that another troopship has been torpedoed with some of the 6th Brigade on its way to France. At night I took Gwennie to Y.M.C.A.at Kas-il-Nil where I recited I was to appear at opening of Anzac Hostel. O’Rs have moved into a lovely home in Upper and G and I walked all the way.\n","166":" Feeling miserable all day. I am brooding a good deal over my trouble. If I go to the mess at night I do what I should.\n","167":" Every Australian has to be out of Cairo by a certain date and they are packing troops off daily for Tel el Kebir all the Aerodrome Details have gone.\n","168":" Did not go to races but went to Ghezireh and instructed some Boy Scouts in Amb. First did work then went to O’Rs Mrs O’R is all sympathy.\n","169":" Blues all day, wrote home received our marching orders for this week to go to Tel el Kebir. A Squadron goes to town to morrow for weeks picquet duty. Am being congratulated on my success with my V D cases which have all turned out well saving the poor devils disgrace and pain.\n","170":" Everybody was packing in a.m but I am too old a soldier now to rush things and my forecast was correct for I don’t think we will go for a few days.\n\nA Squadron turned out as a body for Town Picquet for a fortnight and then half of B was sent for so it does not look like going.\n","171":" A Squadron went off then nearly all B and then the regiment had to find guards & picquets for all Cairo. There are only three Australian LH Regts in Cairo now and all duties will fall on them. Our Details went away yesterday morning.\n","172":" Being so frightfully short handed I volunteered to go as one of the NCOs to Maadi for horses and left at 5.30 am, we went there by train it was my first trip to Maadi since we left 16 months ago. We drew our horses 190 and then the fun started , buckjumping in all directions, I had a fair mount and we rode home through the dead city and had a lot of fun then arrived back hot dusty and tired at the camp. Paid my enormous mess bill and had little left for town, however took Westy to O’Rs and then we had a nights fun, we were I think about the only soldiers in Cairo.\n","173":" Sick Parade is a joke now only about 5 a day except my V Ds who are now seven in number. Cairo is deserted all the cosmopolitan dealers are wringing their hands and complaining they are ruined. Good news from all fronts, but nothing important.\n","174":" We hear that the 1st AGH has gone to Cyprus. So that looks like an expedition to Palestine.\n","175":" During the day I wrote some verse called Cairo’s lament dealing with the woe begotten expression of the cosmopolitan dealers now the Aust have gone. Went to to arrange about picnic on\n","176":" With two other sergeants we left camp at 6.30 am and met Mrs O’R and family and some nice girls at the station, we then journeyed to the beautiful Delta Barrage which was at its best . We had a very happy day and enjoyed the lovely change. We were so tired when we arrived home we could hardly drag our legs.\n","177":" Tired and stiff after yesterday. All the horses were ridden to-day, some buckjumping indulged in. Wrote home. My mail has been absolutely rotten received a letter from Mother enclosure from I wish I had not recd as it only opened the wounds again.\n","178":" It is reported that Aust Troops are at Alexandretta, it is very feasible. Tel-el-Kebir is now a monstrous camp and Cairo is deserted. It is a query as to what is to happen to this regt. They have made a name as picquets and we are dreading being sent back for police duty.\n","179":" Went into town to get a new pay book and have my old one altered. Could not make new allotment as my transfer has not yet come through headquarters. Met a lot of other sergeants went to new Review at Kursaal rotten show did not get back until morning. Four welcome letters awaiting me on return.\n","180":" An awful Khamseen sprang up to-day The worst I have ever seen in Egypt. Tents were blown all directions, I had to literally dig my bottles out of the dispensary. The dust was choking and I was very pleased when Gwennie O’R rang me up to meet her in Cairo. Town was much more pleasant and went to Ecole du Nos here du Apostles, saw the sister and we then went to the beautiful Reparatrice\n","181":" Still blowing but not so badly. Squadron has not yet come back. There is some talk of forming a LH Brigade composed of 4th \/11\/12th ALH Regts with Col Royston as Brigadier. Wrote a lot of letters at night, no word from my brothers I am becoming anxious about them. \n","182":" Our Colonel is now camp Commandant for Cairo District and our orderly room is Garrison Headquarters. Everything is being messed up. Went to O’Rs with Westy at night returned late.\n","183":" P.M. saddled up a lovely mare & she and I went for a long ride it\n\nwas a lovely day and we went to Roubeh, Cairo, Shaubra, Bulac, and returned home through Abbassia late at night after an enjoyable ride.\n","184":" Rumoured we are to move off in a few days to Salhia, the air is thick with rumours and one cannot write anything without Foundation. Drew Fiver back pay. Concert at night by party from Dermatological Hospital It was very good.\n","185":" Rumours of movements still in the air but they are all contradictory. The 9th LH have been in action and done good work the other side of Serapeum. \n","186":" Letters are being rec from our pals from but they are not yet in action. Am anxious about my brother as I have not heard from him. Went to town . \n","187":" Chasing about getting final drug supplies, inoculating all day.\n","188":" Anniversary of Battle of Wazza went to O’Rs in p.m. met Gwennie and for the second time in Egypt went to the impressive Stations of the Cross and after tea to the beautiful Benediction at the Reparatrice\n","189":" About one pm I was sent for to see a man in C Squadron and as soon as I saw him I at once rang for an urgent car, I took him to No 3 Hosp and just got him there and that was all for he died of Euremia shortly after. My Dr was out of camp. My brother arrived during the day from Serapeum looking well, his transfer has gone astray. We went into town together to concert at Anzac Hostel where he stayed for the night. I had a feeling something was wrong so returned to camp just in time to answer telephone to prepare report for post mortem.\n","190":" To commemorate the Anzac Landing it was decided to hold a sports meeting on 25\/ between 4th 11th 12th ALH Regts and the men have been practicing tentpegging etc but it is all knocked on the head for we have our marching orders for Wednesday. My brother was out to see me before he returned to Serapeum. I have made out a fresh transfer for him.\n","191":" Busy packing my drugs in morning in readiness, in p.m big muster parade on marching order, it was the first parade I have been on for twelve months. I was put in charge of head quarters and marched my squad out and when inspected the Col blew my head off for not having my men properly equipped but it is a way of the army, I never saw the men before and they were just put in to make up . At night I went to Cinema with Gwennie.\n","192":" Commemoration Service in Cairo and big ceremony at Anzac Hostel. We could not participate as we were packing up all day and were busy. \n\nGeneral leave was granted in pm went to say goodbye to Mrs O’R.\n","193":" Reveille at 4.30 all my gear was packed on Maltese waggons and was ready to go when first party left. I was in second party and in charge, instead of marching down put my party in gharries and drove to Helmich where after a lot of bother got all our stuff on board and we did not reach Tel-el-Kebir until 1.30, then we had to unload the train in a temperature of 111° we then went out about two & half miles right into the desert and not a thing was done not even horse lines put down, however things eventually righted. Went to sleep under Maltese waggon and woke to find the mules had eaten part of my bedding.\n","194":" Broiling day, tent erecting and chasing about getting men into hospital and pinching and claiming gear I did not get my dispensary erected until late in pm. There has been scrapping down the other side of the canal, a squadron of yeomanry were cut off and a lot of caught asleep in their beds and we believe some LH had a go. We are getting a bit restive. \n\n","195":" Got my dispensary in order and commenced operations. Big mail in I got four letters. Everybody is disgusted with the Yeomanry and their defeat on the canal. Three Hospital trains went up to-day, so there must be another scrap down there. The 4th Regt had to stand to arms last night owing to the disgraceful scenes at Tel-el-Kebir station. Every night something is set on fire and last night five canteens were burned down & raided. The scum are the of Wooloomooloo, and are the same crowd that wrecked Sydney they are our companions in arms.\n","196":" cases of comforts have arrived and been distributed mostly foodstuffs Truly we are very grateful to the people of Australia. I got a big box of tinned foods etc for my men, and took charge of all the med comforts for the march. In the p m the officers played the men cricket and the men won easily, Albert Cotton made 102. Everyman had a bottle of beer presented him to-day, it was regiments funds shout.\n","197":" Still busy am treating my cases just the same as at Oasis. The camp is much neater looking than the old one, it is an immense camp of over twelve miles circuit and nearly 10000 men here, but they are a tough lot, sticking at nothing.\n","198":" Bad news received that Gen Townshends force had surrendered, another crying shame to the B.. Also that marshal law had been proclaimed in Ireland. Things are looking blacker than ever. \n","199":" Since we have been here I have had no less than eight new patients making a total of over seventy eight men. I am very busy and needlessly so for I am the only AMC man doing it in the camp, all others sent to Hospital.\n","200":" Every morning I have to take men to hospital down to No 2 stationary Hospital at Tel-el-Kebir. About eight p m two rifle shots were heard and a man came running into our camp, he was immediately pounced on. Two of them had escaped from the barbed wire prison at the back, one got away.\n","201":" With another I rode over to the famous Battle ground of Tel-el-Kebir. It is an interesting sight of the British victory of 1882. Skulls and graves are everywhere and we got some interesting curios. The trenches are obsolete and would be easily taken with modern methods, we then rode over to a native village and did not get back to camp until 8 pm.\n","202":" Busy finishing inoculations, good news from all fronts this war. More troops arriving from Australia. \n","203":" Smallpox has broken out in the 11th Regt adjoining us and consequently all ranks have to be inoculated. The Dr is doing MO work of both regiments. Our horses are looking very badly owing to the Colonel galloping them, he is very hard on horses and drills like a maniac \n","204":" Vaccinating all day, every man was examined. The heat was stifling and I was glad to get out of the tent. The rest of the regs arrived back in camp from town picquet.\n","205":" Finished vaccinating regs to-day I am very anxious about my brother in France I have not heard a word from him since he left\n","206":" More bombs dropped on Port Said by force of Turks said to be approaching the canal. Two more AMC Details were sent to me to-day, I am now entitled to four. Smallpox patient dead, we finished vaccinating regs to-day.\n","207":" Early in morning we received the news that there was a big scrap going on at the Canal and we could hear the guns plainly. Then the news came that two squadrons of the 12th and two of the 11th are to be prepared to move off immediately, one squadron remaining behind to look after the horses There is a definite promise that they will follow us on but in the meantime we must go as Infantry. The news was startling to each man, and not popular but we will all be glad to get into action.\n","208":" I now close my diary down for the second time and with a regret for I start on a new book that seems strange to me, whilst you my old friend have faithfully chronicled the daily events of my active service career. I often wondered if I would ever finish you but my good luck has stuck to me so hoping your successor also reaches your destination safely.\n\nI wish you good luck on the voyage.\n\nAlf P K Morris\n\n"}}