{"Document Name":{"0":"Diary_0155","1":"Diary_0155","2":"Diary_0155","3":"Diary_0155","4":"Diary_0155","5":"Diary_0155","6":"Diary_0155","7":"Diary_0155","8":"Diary_0155","9":"Diary_0155","10":"Diary_0155","11":"Diary_0155","12":"Diary_0155","13":"Diary_0155","14":"Diary_0155","15":"Diary_0155","16":"Diary_0155","17":"Diary_0155","18":"Diary_0155","19":"Diary_0155","20":"Diary_0155","21":"Diary_0155","22":"Diary_0155","23":"Diary_0155","24":"Diary_0155","25":"Diary_0155","26":"Diary_0155","27":"Diary_0155","28":"Diary_0155","29":"Diary_0155","30":"Diary_0155","31":"Diary_0155","32":"Diary_0155","33":"Diary_0155","34":"Diary_0155","35":"Diary_0155","36":"Diary_0155","37":"Diary_0155","38":"Diary_0155","39":"Diary_0155","40":"Diary_0155","41":"Diary_0155","42":"Diary_0155","43":"Diary_0155","44":"Diary_0155","45":"Diary_0155","46":"Diary_0155","47":"Diary_0155","48":"Diary_0155","49":"Diary_0155","50":"Diary_0155","51":"Diary_0155","52":"Diary_0155","53":"Diary_0155","54":"Diary_0155","55":"Diary_0155","56":"Diary_0155","57":"Diary_0155","58":"Diary_0155","59":"Diary_0155","60":"Diary_0155","61":"Diary_0155","62":"Diary_0155","63":"Diary_0155","64":"Diary_0155","65":"Diary_0155","66":"Diary_0155","67":"Diary_0155","68":"Diary_0155","69":"Diary_0155","70":"Diary_0155","71":"Diary_0155","72":"Diary_0155","73":"Diary_0155","74":"Diary_0155","75":"Diary_0155","76":"Diary_0155","77":"Diary_0155","78":"Diary_0155","79":"Diary_0155","80":"Diary_0155"},"Date":{"0":"unknown","1":824.0,"2":825.0,"3":826.0,"4":827.0,"5":828.0,"6":829.0,"7":830.0,"8":831.0,"9":832.0,"10":833.0,"11":836.0,"12":837.0,"13":838.0,"14":839.0,"15":840.0,"16":841.0,"17":842.0,"18":843.0,"19":844.0,"20":845.0,"21":846.0,"22":847.0,"23":848.0,"24":849.0,"25":850.0,"26":851.0,"27":852.0,"28":853.0,"29":854.0,"30":855.0,"31":856.0,"32":857.0,"33":858.0,"34":859.0,"35":860.0,"36":861.0,"37":862.0,"38":863.0,"39":865.0,"40":866.0,"41":872.0,"42":873.0,"43":874.0,"44":875.0,"45":876.0,"46":877.0,"47":878.0,"48":879.0,"49":880.0,"50":881.0,"51":882.0,"52":883.0,"53":884.0,"54":885.0,"55":886.0,"56":887.0,"57":888.0,"58":889.0,"59":890.0,"60":891.0,"61":892.0,"62":893.0,"63":894.0,"64":895.0,"65":896.0,"66":897.0,"67":898.0,"68":899.0,"69":900.0,"70":901.0,"71":902.0,"72":903.0,"73":904.0,"74":905.0,"75":906.0,"76":907.0,"77":908.0,"78":909.0,"79":910.0,"80":911.0},"Entry":{"0":"\n","1":" Arrival at Marseilles in A.41 (Minnapoles). Impression of Marseilles Harbour and township.\n","2":"\n\nLeft vessel and marched to special encampment site of Indian G.H. originally German residence- fine grounds with abundance of fruit trees and luxuriant vegetation- great contrast with Egypt.\n","3":" \n\nBully beef and biscuits. Inspection by a French General. Break camp at Marseilles – Baggage party leave by train for unknown\n\nDestination –sleep (or at least try to sleep in train.\n","4":" \n\nNo Reveille necessary- spend all day in train (1\/2 mile in length). Pass through Lyons, Dijon, Avignon and other big towns, also through finest pastures, villages, orchards and farms it has been my good fortune to see, trees and hedges on roads, very fine. Apparent absence of all young men, places on farms in offices etc taken by women and girls. Most enthusiastic welcome by French at various stations\n","5":" \n\nB and B very cold, no sleep previous night, well into North of France, agricultural country still continues. Souvenirs requested by French children. Monotony of journey broken by most beautiful landscape scenery. Journey completed 10pm. Rejoin baggage party. Guard baggage while remainder of troops (1500 march to encampment). Spend night in snow out in the open, fall of about 6 inches (Thiennes)\n","6":" \n\nGuard baggage\n\ntill midday \"My first good meal in a long time and how I came by it\"\n\nFrench hospitality. Rejoin my unit in the afternoon-Australians encamped at Morbecque 7th Field in an old school and residence.\n\nMar.25th \n\nFatigue in morning Route march to Hazerbrucke in afternoon much larger place than our village\n\n\"Coffee au Lait\" (?)\n","7":" \n\nSabbath mass in village church service in French\n\nissue in underclothing and extra et (very acceptable) more coffee- continuous rain throughout the day.\n","8":" \n\nInspection of our 7th B’ade by General Sir Douglas Haig C.I.C. in village streets-march past- Sir Douglas said: I am very pleased with","9":" Brigade and I am sure they will acquit themselves excellently- Moving day from our quarters to Hospital in same village.\n","10":" \n\nQuartered in barn over stables-Route march- sick parade. Constant firing of British Artillery plainly heard. Coffee au Lait.\n\nMar.29th \n\nSick Parade- Fatigue-Practical Experience in combating gas by means of helmet \"Weeping gas\" Accident to Major Dolman –myself Mess Orderly.\n\nMar.30th \n\n\"Pay Day\" (45fr) Busy estaminets and Canteens. Big Battle evident judging by continuous firing.\n","11":" \n\nEarly morning march- game of football- host of Aeroplanes \"herring and pears\" for lunch- stretcher drill.\n","12":" \n\nApril Fools Day- no practical jokes or false alarms- Football and Boxing under Capt Brownell- Lecture Capt Hamilton \"Veneral Disease\". Continued Bombardment on British front heard throughout day. Half holiday in afternoon.\n","13":" \n\nSabbath. Mass at 9am. Pleasure walk- Issue of two \"respirators for combating gases\" - Salmon sauce – Pears and Lime juice for lunch. Letters written during afternoon.\n","14":" \n\nSick parade Marching Orders- Preparation of baggage and Examination of kit- Day of Rest Generally.\n","15":" \n\nLeave Chateau with","16":" Field- Join 7th Brigade- Depart from Morbecque.\n\nin marching order 10.30am Destination Unknown- pass through Hazebrouck and other French villages- lunch on the road- march proving strenuous to many, encamped at 3pm in a barn at village of Ottersheene (11 miles 3½\nhours)\n\nApril 5th \n\nMarch resumed in Marching Order at 10.30am suitable weather but bad roads pass through Strazeele, Steinberg(?) etc. mainly aeroplanes visible- signs German destruction in village.\n\na dried flower and leaves occludes the writing on this page which is repeated\n\nDestination reached after 9 miles travelling (20m in all). Encamped in Hospital previously a Brewery. House adjourning occupied for one day and a night by Crown Prince. Quarters very comfortable-Village of Sailly.\n","17":" \n\nBaggage guard 3am -6am (3hrs) chosen in a party of 36 bearers march of 3 miles with full kit and ets. Observation Balloon march lengthened to 6 m owing to error of our guide. Arrived at Red Cross Station. Billeted in \n\na dried pressed flower occludes the writing and this page is repeated\n\nbarn. Sleeping bags of straw (improvised) Leave granted in afternoon the visit Steenwerch in the Evening \n","18":" \n\nOur encampment in village of Le Estrade, and on the road to Armentieres-Capt Strachan our O.C. Squad drill and letters in morning -\n\nSudden departure in afternoon for unknown destination. We are all surprised by being driven in the cars instead of footing it. Are we off to the trenches? NO! \n","19":" \n\nOur party (24) take up duties in 2nd Division Baths-work very trying and oppressive owing chiefly to heat of rooms. New French friends (coffee). Shelling and bombardment about out abode-Baths ½ mile from Armentieres.\n","20":" \n\nWork on drying room. Sunday 9 but no holiday (Our first glimpse of \" Mad Major\"-200 shells wasted by Huns) Leave in afternoon to Armentiers. \n\nApril 10th \n\nOur party Evacuate Baths at midday and leave for 7th P.A.Base- Dinner supplied \"on route\" by","21":" F.A. Arrival at and departure from Base to Resling Station at le Estrade- Heavy bombardment heard during night.\n","22":" \n\nReport ‘re’ German Spies in neighbourhood- letters to home etc. Evening spent in French home eggs, coffee, toast etc. songs. Self \"on guard\" (3hrs) against German gas attack 9 mths today since enlistment.\n\na sticker occludes the text on this page which is repeated\n","23":" \n\nEggs and bacon for breakfast. Route march under Cpt.Strachan to Steenwercke. Lecture on Haemorrhage. FIRST MAIL very happy\n","24":" \n\nLetters and P.C (12) written home. More wet weather. Route march and lecture. Eggs and bacon a regular.\n","25":" \n\nEvacuation of Rest Station. Long and weary march through mud and rain arrived at our Base\n","26":"\n\n3 months (13 weeks) since departing Sydney. March in afternoon and visit Erquinghem in evening.\n","27":"\n\nSabbath- attended Mass at village of \"Croix du Bac\". Later written home Y.M.C.A. in afternoon. Gas Picket at night (6 hour shift).\n","28":"\n\nHappy day * letters from home Y.M.C.A. Gas Picket.\n","29":"\n\nSame as usual sleep till mid-day. Gas picket at night.\n","30":"\n\nPicked in party of 33 to take up duties at Bois Grenier (advanced dressing station). To leave for destination in Cars at 8pm. Rough ride (no lights)\n","31":"\n\nFirst day in action stretcher bearing in support trenches. Our dug-out very comfortable \"Jenolan\n\nCaves\"- danger of shells at all times \"Maggie’s socks\"- Big British Guns Active round about us. Leave trench at 6pm for Dressing Station-Great destruction of village - no inhabitants - our billet carries no Red Cross and our chaps no Brassards - owing to handiness of British Batteries to our Station we are liable to German shells at all times.\n","32":"\n\nGood Friday no Buns, plenty of rain\n\nDuty in trenches at night (5pm till 9am next day) sleep in dug-out.\n","33":"\n\nEaster Saturday quiet day in trenches, night duty ‘College Green’.\n","34":"\n\nEaster Sunday proves a bad day for our boys. Germans fire 250 shells in 40 minutes on Australian lines- 4 killed and many wounded in our Dressing Station, indescribable sight of wounds only equalled by remarkable fortitude of our boys.\n\n23rd cont. Airoplanes take advantage of fine weather \"Mad Major\" teaches the Germans (1) how to fly (2) how to use a machine gun in flight and (3) that British pluck and daring is unparalleled.\n","35":" Germans still busy shelling. No1 squad duties, badly wounded Australians, popularity and coolness of our officers in dealing with cases. Our FIRST BIG BOMBARDMENT\n\nMotor ambulance run to Fort Rompu as Waggon\n\n \n\nOrderly. Very busy night.\n","36":"\n\nANZAC DAY \"Good luck to all our comrades in Khaki\". The fine day is well in keeping with anything Australian. Stretcher Bearing duties at College Green Trenches.\n\nReturn to our base at Ft. Rompu at night.\n","37":" Detailed for one weeks hospital work. I take up my duties. \n\n \n","38":" to","39":" (inclusive) Hospital duties 7am to 7pm Dublin riots news.\n","40":" to","41":" Hospital duties- many letters written home and friends- Aeroplanes again plentiful. Weather perfect.\n","42":" German bombardment has telling effect on 20th Btl. Courage work of R.Bearers- Our Ambulance has a very busy time- true stories of courage, humour and fortitude in and after bombardment. I take part in Y.M.C.A. concert\n\n \n","43":"\n\n Relieved by \"A\" Section form hospital duties- Charlie and I go to Mass - French Services. Letters. Guns very silent all day\n","44":"\n\nCapt. Strachan makes his debut as lead, Barbe of Grand Bayon- Lena Ashwell No 2, I line part \"Tres Bon\"\n","45":"\n\nInspection of hospital, billets etc. by General Birdwood.\n\nwho expressed our quarters as \"perfect\" weather decidedly wet.\n","46":"\n\nEnglish papers publish \"Anzacs\" landing in France. Many letters and P.C.S sent during week.\n","47":"\n\nSame as usual Y.M.C.A. once more\n\nMat","48":"\n\nI witnessed first Post Mortem given by Capt. Culpin. Y.M.C.A \n\n \n","49":"\n\nSome of our boys returned from the trenches. Weather very wet. Quiet day along the line.\n","50":" (Sabbath)\n\nAnother quiet day artillery inactive- today is \"Mother’s\" Day. Church in the morning pleasure walk in afternoon, hospital duties during the night. Two letters arrived.\n","51":"\n\nCool and wet weather 14 hours sleep. Usual routine\n","52":" and","53":"\n\n\"B\" Section party leave for Erquinghem duties in Fld. Hospital. Y.M.C.A. and correspondence (average 4 a night for 2 weeks)\n","54":" \n\nRed letter day. 12 letters arrive in morning (3 from home) and photo of Eva and Perc. Good news. Concert in our own quarters, Major B. in the chair \"Yours Sincerely \"goes well\". Concert a success. Incident with H.O (L.C.)\n\n \n","55":"\n\nIn party to Bois Grenier arrive in afternoon (march 4½\n\nmls.) British batteries very busy during latter part of march.\n","56":"\n\nChange of duties from S. bearing to dressing room, quiet day- R.Bice.\n","57":"\n\nSabbath, no chapel (?) 7 more letters, Roy develops and prints photos of self. German guns busier \n\n \n\ntowards evening (as usual on Sundays).\n","58":"\n\nMeals very good (puddings a speciality), assist in a few cases during the day. Pathetic case of two brothers\n","59":"\n\nBusier day I learnt ‘whist’ from R.B.\n\nLt. Porteous death (?)\n","60":"\n\n\"Bribbage\" a few cases (only 1 serious)\n\n 2nd case of brothers –\n\n meals most enjoyable\n\nSince leaving home (eggs, porridge, toast, tinned fruit, rissoles, puddings etc.)\n","61":"\n\nMore cribbage – 10 letters, good news. Still well, plenty shells.\n","62":"\n\nA few more cases than usual, cleaning up day. Our Gooseberry picking expedition brought to a hurried close by shell landing about 15-20 yds. away. \n\nOur party return to our base at Ft. Rompu. Gooseberry bush.\n","63":"\n\nTake up my duties in Dressing Room. Return of less appreciated food. Very busy day.\n","64":"\n\nDressing room inspection of our Hospital and quarters by the A.D.M.O. and Surgeon Generals Porter and House. \"All well pleased with our (self and pal) dressing room.\n\nSabbath Church and communion.\n","65":"\n\nBusy day again 18 letters received (Tres Bon) Witness and assist in operation. (Bronchial artery and two veins severed) \n\nadmitted to Hospital 9pm influenza.\n","66":"\n\nAnniversary of Original Members leaving S.A. First day in hospital.\n","67":"\n\n Second day in hospital much better.\n","68":"\n\nDischarged from hospital. Inspection by Messrs. Am. Hughes and A Fisher.\n","69":"\n\nDigging Trenches in our own grounds (in case of German Bombardment), good work. Parcel (handkerchief (11) silk apron, disc etc.) sent home, writing letters.\n","70":"\n\nDigging trenches, Stretcher case from Erquingham (use wheels) weather wet.\n","71":" \n\nSabbath Mass 7.30am (Bac-St- Maur)\n\nNews of Naval Engagement. Reported German victory. Easy day.\n","72":"\n\nBritish Victory apparent- weather still wet and miserable. Take part in Concert at Y.M.C.A.- \"Australian Corroboree\".\n","73":"\n\nPay day. We leave Ft. Rompu for Advanced Dressing Station at Bois Grenier- safe arrival- detailed to Dressing Rooms. (Fierce prolonged bombardment of our guns) \n","74":"\n\n Letters written to home and friends. (Photo R.B.) Visit surrounding gardens. Fruit flowers etc. in abundance. \"Gooseberries\"\n\nNight duty. Dressing Room\n","75":"\n\nTragic news of Lord Kitchener’s death.\n\nBritain loses its idol, Kof K- Russian progress. Shrapnel from Huns.\n","76":" \n\nQuiet day. Duties in dressing room (1 case only). Cribbage- Good food.\n","77":"\n\nGerman guns silent. We witness eight of our planes chasing 2 Taubes one of which was brought down. Truth of Naval Engagement.\n","78":"\n\nWhitsun day. Verdan fiercer than ever. Burial of a 20th lad. Miserable weather (N.D.)\n","79":"\n\nEnemy guns very silent in our quarters. Ypres battle going strong. Artillery heard by us. Our party returns from Bois Grenier to Ft. Rompu. Quick march under wretched conditions. \n\nJune\n","80":"\n\nDuties in hospital at Ft. Rompu-mail from home.\n\n"}}