{"Document Name":{"0":"Diary_0171","1":"Diary_0171","2":"Diary_0171","3":"Diary_0171","4":"Diary_0171","5":"Diary_0171","6":"Diary_0171","7":"Diary_0171","8":"Diary_0171","9":"Diary_0171","10":"Diary_0171","11":"Diary_0171","12":"Diary_0171","13":"Diary_0171","14":"Diary_0171","15":"Diary_0171","16":"Diary_0171","17":"Diary_0171","18":"Diary_0171","19":"Diary_0171","20":"Diary_0171","21":"Diary_0171","22":"Diary_0171","23":"Diary_0171","24":"Diary_0171","25":"Diary_0171","26":"Diary_0171","27":"Diary_0171","28":"Diary_0171","29":"Diary_0171","30":"Diary_0171","31":"Diary_0171","32":"Diary_0171","33":"Diary_0171","34":"Diary_0171","35":"Diary_0171","36":"Diary_0171","37":"Diary_0171","38":"Diary_0171","39":"Diary_0171","40":"Diary_0171","41":"Diary_0171","42":"Diary_0171","43":"Diary_0171","44":"Diary_0171","45":"Diary_0171","46":"Diary_0171","47":"Diary_0171","48":"Diary_0171","49":"Diary_0171","50":"Diary_0171","51":"Diary_0171","52":"Diary_0171","53":"Diary_0171","54":"Diary_0171","55":"Diary_0171","56":"Diary_0171","57":"Diary_0171","58":"Diary_0171","59":"Diary_0171","60":"Diary_0171","61":"Diary_0171","62":"Diary_0171","63":"Diary_0171","64":"Diary_0171","65":"Diary_0171","66":"Diary_0171","67":"Diary_0171","68":"Diary_0171","69":"Diary_0171","70":"Diary_0171","71":"Diary_0171","72":"Diary_0171","73":"Diary_0171","74":"Diary_0171","75":"Diary_0171","76":"Diary_0171","77":"Diary_0171","78":"Diary_0171","79":"Diary_0171","80":"Diary_0171","81":"Diary_0171","82":"Diary_0171","83":"Diary_0171","84":"Diary_0171","85":"Diary_0171","86":"Diary_0171","87":"Diary_0171","88":"Diary_0171","89":"Diary_0171","90":"Diary_0171","91":"Diary_0171","92":"Diary_0171","93":"Diary_0171","94":"Diary_0171","95":"Diary_0171","96":"Diary_0171","97":"Diary_0171","98":"Diary_0171","99":"Diary_0171","100":"Diary_0171","101":"Diary_0171","102":"Diary_0171","103":"Diary_0171","104":"Diary_0171","105":"Diary_0171","106":"Diary_0171","107":"Diary_0171","108":"Diary_0171","109":"Diary_0171","110":"Diary_0171","111":"Diary_0171","112":"Diary_0171","113":"Diary_0171","114":"Diary_0171"},"Date":{"0":"unknown","1":1218.0,"2":1219.0,"3":1220.0,"4":1221.0,"5":1222.0,"6":1223.0,"7":1225.0,"8":1227.0,"9":1228.0,"10":1229.0,"11":1230.0,"12":1231.0,"13":1232.0,"14":1233.0,"15":1234.0,"16":1235.0,"17":1236.0,"18":1237.0,"19":1238.0,"20":1239.0,"21":1240.0,"22":1241.0,"23":1242.0,"24":1243.0,"25":1244.0,"26":1245.0,"27":1246.0,"28":1247.0,"29":1248.0,"30":1249.0,"31":1251.0,"32":1252.0,"33":1253.0,"34":1254.0,"35":1255.0,"36":1256.0,"37":1257.0,"38":1258.0,"39":1259.0,"40":1260.0,"41":1261.0,"42":1262.0,"43":1269.0,"44":1276.0,"45":1277.0,"46":1281.0,"47":1282.0,"48":1283.0,"49":1286.0,"50":1287.0,"51":1291.0,"52":1302.0,"53":1305.0,"54":1308.0,"55":1309.0,"56":1310.0,"57":1311.0,"58":1315.0,"59":1324.0,"60":1327.0,"61":1328.0,"62":1329.0,"63":1330.0,"64":1331.0,"65":1332.0,"66":1333.0,"67":1334.0,"68":1335.0,"69":1336.0,"70":1338.0,"71":1339.0,"72":1340.0,"73":1341.0,"74":1342.0,"75":1343.0,"76":1344.0,"77":1345.0,"78":1346.0,"79":1347.0,"80":1348.0,"81":1349.0,"82":1350.0,"83":1351.0,"84":1352.0,"85":1353.0,"86":1354.0,"87":1355.0,"88":1357.0,"89":1358.0,"90":1359.0,"91":1360.0,"92":1361.0,"93":1362.0,"94":1363.0,"95":1364.0,"96":1365.0,"97":1366.0,"98":1367.0,"99":1368.0,"100":1369.0,"101":1371.0,"102":1372.0,"103":1373.0,"104":1374.0,"105":1375.0,"106":1376.0,"107":1378.0,"108":1379.0,"109":1380.0,"110":1381.0,"111":1382.0,"112":1383.0,"113":1384.0,"114":1385.0},"Entry":{"0":"\n\n","1":"\n\nI start this new diary the 4th since enlistment under conditions perhaps brighter & more promising than any we have had since the commencement. We are in the midst of a big advance & an offensive started north of Arras has been at once successful, on all sides we stand to win. Americas moves also will assist, the whole world now being frantically arrayed against a common enemy. How long it will take Germany to admit defeat is now the only question I trust it will be soon. Had a kit inspection today which interfered with our routine making a very heavy afternoon, however all finished well. Weather most changeable snow one minute then bright sunshine still very cold. Our present location a chateau, I learnt today belongs to Baron Rothschild, it has certainly been a very fine place.\n","2":"\n\nWeather cold with plenty of snow. Had our dinner & concert which had been postponed & which now turned out a huge success. The Dinner was soup, meat & vegetables, fruit salad custard, pudding, with biscuits chocolates, nuts etc beer & cigars plenty of everything & the best feed I have seen in the army. Then the concert went very well everyone being in good spirits, the Colonel was in the chair & did very well, altogether the celebration being a huge success. General Howse was round today & inspected the whole concern a job he does not waste time about as many do & seemed well satisfied\n","3":"\n\nEveryone feeling heady today, not at all brisk. An easy day at the baths so\n\nmanaged to do some reading. Weather very cold with more snow most unseasonable & I hope not interfering with an advance at Arras. Am avidly awaiting more mail as it is weeks behind.\n","4":" ‘17\n\nA very heavy day finishing off at night very tired. Weather good & went for a stroll round the village in the evening. Much knocked about & practically empty. Had a look at the church & found it \"knocked rotten\" as usual the centre being absent. The cemetary was a large one & contained representatives of all regiments among the number being about six colonels & one honourable. An Indian officer had been buried here the day before but we found that he had been removed & reburied by himself about 100 yards away. Came across a notice reading rather strange- Tanks salvage company, a sign of the times. We\n\nsaw two more which had been brought in from round Le Sars where I saw about ten in different stages of ruin. Witnessed a post mortem on a fellow who had died some 5 days previously nearby, result- death from exposure following on drunkenness, not the first case I have known. Strange how a man the worse for drink will die from one nights exposure when badly wounded men will live for days in No Mans Land and ultimately recover.\n","5":"\n\nWeather much improved. Had trouble with a patient, a sergeant, who was too high & mighty to bathe with the men & finished up by abusing me roundly, will run him up for it. Did some letter writing at night.\n","6":"\n\nAttended a communion service, four of us present, the first I have been able to attend since last October. Had my sgt friend up to orderly room before the Colonel, but fear that he will\n\nget out of it. He brought up three other sergeants as evidence on his side while I only could produce a couple of privates. Our Colonel has not the power to deal with it himself, he simply collects the evidence & sends it & the crime sheet onto the mans C.O. who deals with it & very leniently unless of a serious nature, however I’m not vindictive but simply wanted to show the blighter he could not bounce me with impunity. Weather wet & cold & miserable. The sound of the Arras guns quite plain & very continuous. Rumours fairly thick about our fellows bumping trouble in one sector but have not yet learnt the truth of it. Walked to the village of \"Martinsart\" to night & brought back some pieces of glass from the church the whole place being deserted, the whole district in fact is almost deserted owing to the advance.\n","7":"\n\nMy","8":" birthday & I begin to feel that I am getting old. With good fortune I may be home for my 30th. But it does not give me much time to work up a business before touching 40 & previously I reckoned on having something good by 30. Yesterday was wet & cold but went for a walk after tea to \"Thiepval\" about 3 miles from here & was very pleased I did so as t’was wonderfully interesting, so much so that I determined to go again. Coming home saw three lengths of 3’’ rubber\ny\n piping so we confiscated it for the baths. Followed the railway coming home & had a perilous walk on the wet sleepers where it crossed the lagoon, rather wet by time I got home. Fixed up the pump this morning with the hosing we carried home & find it a great success just about halveing the work. Set off for Thiepval after dinner arriving back after six having explored all the fighting area of this locality. The shelling must have been truly awful & \n\nnowhere have I seen the same amount of shrapnel used as here. Shrapnel cases & pellets absolutely covered the ground & in one place were so numerous that they were used to form\ned\n a road. Many dead germans were still to be seen in the last stages of decomposition & skulls were numerous. After viewing such a battlefield one is convinced that nothing on earth can withstand our attack providing the artillery is sufficient. Met a couple of tanks being salvaged one the \"Crème de menthe\" being rather an historic one. Brought home some driving bands etc & a German bayonet. \"Thiepval\" itself has disappeared but a mound with cellars underneath still remains & is all that is left of what was once the Chateau. \n","9":"\n\nLast three days being changeable weather wet cold & fine. Played the 8th football & won 16 to 6 thus upholding our record & that of the 1st. Good news of our stunt at Arras & that\n\nof the French. The guns can be plainly head day & night. Great signs of our being relieved several new divisions of tommies having arrived, ‘tis now six months since we came to the Somme. Spent some idle moments in trying to make some souveniers but found lack of tools the great drawback. Am troubled a little with my old trouble of biliousness otherwise O.K. my foot being now better so that I can walk without a limp.\n","10":"\n\nA beautiful day warm & bright. B. section arrived back today & great rumours of our being relieved. Went out after tea for a ride with the two W. O.’s & thoroughly enjoyed it visiting \" Bouizencourt \" & Senlis two decent looking villages now almost deserted. Saw a lot of Indians all mounted men. Had coffee & piece of bread at Senlis & paid 1 franc a piece for it. Coming back had a most enjoyable gallop.\n","11":"\n\nNice bright weather. Played the 8th Australian rules & won 67 to 23. Some win. Four English letters in mail & wrote four at night Australian mail still slow.\n","12":"\n\nBeautiful day. Sound of guns still going another hopover in the offensive being about due, walked into Albert, where taubes dropped bombs last week, & went to a Show, the company being called \"The Anzac Coves,\" not of much class & nothing to write home about, still it’s a good work & does the fellows good. Wonderful how the chaps hoy with delight when a fellow dressed as a girl comes on ‘tis almost the most popular item\n","13":" \n\nSailed out of Lemnos Bay for the landing this day two years ago, it seems but yesterday. Beautiful weather today & every promise of spring being now with us. News came this morning of another hopover in the offensive, 2000 prisoners\n\n& two batteries captured with 25 planes & 7 balloons brought down, not too bad for a start. Rumours of something doing on our front to assist the main effort no doubt, so far we are due to send up 20 horses & 10 men but expect all our bearers to be called for. Morris will be in it I expect as the 2nd Div. are in. Feeling better myself today but can hardly walk from the stiffness after football. Have great ideas of starting to learn French again but find it requires a lot of will power, the spirit being willing but the flesh weak especially as I have not come in contact with the French people for the last six months.\n","14":"\n\nAnzac Day when Australia was born a nation. Two years since the landing on the Peninsula. Weather still fine. Played the 8th Field football & beat them 7 to nil, very good & hard game, went into Albert to see the match. Had a drive in the \n\nold Ford & went in to collect drugs at the depot in Albert. Very strict in saluting there now as ‘tis Army Headquarters and passes signed by the A.P.M. are necessary to get in. I don’t blame them for insisting on the salute, ‘tis really the outward & visible sign of discipline when out of the line & most necessary, in fact I believe in being regimental. Scored my mail today but not from home.\n","15":"\n\nStill fine weather. Guns started off at full force again so apparently the second hop over has finished protem. By the paper our Air Service has gained some notable victories & the prisoners of the stunt number over 3000 with some guns. Went to \"Millencourt\" today by horse & had tea with the 12th. where I found Blackall installed as dispenser. Had a good outing & arrived back just on dark.\n\n‘Tis a good place they are in, the whole village of Millencourt having been used as a C.R.S. taking about 2000 patients a fine idea being far better than tents.\n","16":"\n\nChief item of day was the receipt of mail from Australia something from each member of the family. Had a bad bilious headache most of the day being slightly off colour since coming to this place, everyday someone tells me I am not looking well. Had a couple of hours hearty enjoyment talking of old times with two 1st. Field chaps, the army is a happy place after all, I have never laughed so heartily out of it as I have since I joined. Bombardment still going on, otherwise things the same here, nothing but scabies before my eyes from morning till night, I do indeed see some lovely sights some of the patients being prize winners in scabby hides. With the bile tickling me up today I felt like\n\ndoing anything rather than run the baths, actually I would far prefer general duty work & envy those doing route marches & drill. Weather still fine.\n","17":"\n\nFine weather again. Had a heavy day as we shifted into the new baths which we start properly tomorrow. Went for a walk along the banks of the \"Ancre\" & the lagoon tonight a positive treat. In a months time it will be ideal. The river is crossed by several bridges also the swamp this part being a part of an old line of defence & was evidently a very strong point, shell holes could be seen in the river itself & at places along the bank & a grave yard near, many of the crosses are splintered with the Shrapnel. A pastime of the patients & others is to throw bombs into the river & lagoon for fish & some beauties were obtained, rather\n\na dear way of fishing altho that does not trouble the average man here. Now anyone found doing it is supposed to be run up.\n","18":"\n A day almost to warm, it being such a sudden change. I had a busy day working into the new baths. The motor column band assisted at the church parade today & proved a positive treat, violins cellos etc, the first piece they played sounded as the finest music ever heard. Had some old friends from the","19":" to visit us they being new to Pozieres. Guns very silent today a big \"hopover\" evidently being in progress. Went for a stroll along the river this evening, most enjoyable picked some violets, primroses etc growing wild in the woods. Voted today for the Ministerial party & I believe & hope influenced some others to do the same. ‘Tis remarkable however, the \n\nridiculous ideas some men have. Some wont vote at all. Others object to a party from the presence of one man, one man put a cross in each square thus making an informal vote, he did this in order to say he had voted but yet begrudged his vote as likely to influence either candidate or party. No event I know of shows man in such a ridiculous light as an election the greater the issue the greater the bungle he will make of it. Tis impossible for women to abuse the privilege of the vote more than the men do now, I would give it them every time. Judging from what one sees, the Ministerial or Nationalist party will gain a substantial majority. Let us hope so & thus redeem the honour of the country, giving Hughes the opportunity of making a name unique in the Annals of Australian politics if not in those of the Empire I believe he has it in him.\n","20":"\n Beautiful day. Was inoculated for paru-typhoid it being over 12 months since the last dose in Egypt, it being a great success. Several discussions with the Colonel about clarifying soapy water from the baths before it entered the river culminated today by me hitting on alum & chloride of lime as the medium. It was amusing to hear us discussing it. I find that I have forgotten the chemistry of the subject & he is no better, we could each speak of oleates, stearates, & fulmitates, but there we stopped & looked at each other. However I scored as my idea is superior to his on his own admission. When ‘tis working properly he will show it to all his cronies & A. D. M. S’s etc when round on inspection was the victim of a practical joke. In the 2 M store various members of the Amb. are invited inside a back room to see a reported new cricket set. On entering two husky offsiders promptly set upon the unlucky\n\none with boxing gloves & make it willing for a few minutes. Most of the Sgts have been caught including the W.O. The army is free of such happy incidents pure fun, & yet they say we are always miserable. Man wounded on the lake with a bomb today.\n","21":"\n Had a tryout today amongst the fellows to get entries for proposed Divisional Sports but could not get along to see them. Nearly everybody nursing a sore arm & several sick from the inoculation. Mine is almost better. Inquiry held today on death of a man from the bomb yesterday, ‘tis a terrible thing that a man should so lose his life through wilfully disobeying orders trying to bomb fish. Waters clarification scheme going on first rate. With the advent of the moon we often hear our planes going over in the night, probably on bombing expeditions. A taube was over today.\n","22":"\n The bearers ordered out today suddenly which points to a stunt coming off especially as 50 extra M.A.C. Cars to go out , Morris now in the line will be in it. Went for a ride this evening on the S.M’s horse & had a look at a village of \nMenlis\n \"Mesnil\" absolutely destroyed by the huns. ‘Tis a remarkable sight from here as the whole ground can be seen which had to be won from Fritz prior to taking \"Thiepval,\" uphill going all the time, trenches intersecting the slopes in all directions. Saw evidence of salvage operations going on but there is yet a fearful waste going on. In one return I saw the largest percentage of returns in shell cases was 50% of one kind, the others ranging from 5 to 20% the remainder being a waste not necessary They are now sending away the tanks they have lately salvaged, six being now at the railway, they climb\n\nup a sloping platform right onto the truck. The general verdict seems to be that they are a success but I have seen a terrible lot \"knocked rotten\" & six which went over with our chaps a few weeks ago all failed to do any good. Only one managed to get back the others being abandoned, altho’ not actually in the hands of the enemy. Feeling much better today due to cutting out meat for a few days.\n","23":"\n On hottest day so far & almost too hot, felt quite sleepy. Heard the bombardment preparatory to the \"hop over\" during the night, the latest reports being that ‘twas successful. Went for a ride tonight about 10 miles on the S. M’s horse & thoroughly enjoyed it. It was beautifully cool like a sea breeze blowing & the country beginning to look well & mounted on a good hack all was merry & bright (& the war still on)\n\nPassed through \"Englebelmer\" and Mailly the latter being almost a town coming home through \"Hedauville\" & Bruzenam on all sides signs can be seen of the Civilians flocking back to their homes, they being lucky who can find their homes intact. News of an Australian transport having been sunk also a mail boat which latter will hit us to our vitals if it be true.\n","24":"\n Received somewhat of a shock today when the Colonel ask me if I would like to go to Amiens. He has been granted 10 days leave to Nice & was going \nto\n in by car to get the train. Arrived in there by 3.30 & left about 8.30, so had a good afternoon buying a few things & wandering round the town in general finishing up by having a first rate dinner for 4 Francs. Coming back had a blowout the road being a little broken, large numbers of Fritzs being employed in it. Saw\n\nsome Japanese officers getting around in a car & a large number of the French soldiers, wounded & otherwise. There are two New Zealand Hospitals in the town & I believe six of the fellows are married to French women. At the sports we scored a win & one second.\n","25":"\n Word through that about 16 of our bearers have been knocked, two being killed. Came as a bit of a shock as they only went up to help the stunt being a second divisional affair- although our div. had to go up as supports. From all accounts the ambulances suffered rather severely. Morris will be well in it altho’ I have an idea he is O.K. Horse show today our Amb. wagon coming second. The Arras affair seems to be extending & now takes in our front, the paper today speaking of \"Bullecourt\" which\n\nis where our crowd hopped over. We cannot yet learn the complete results as Fritz is putting up a stiff fight. Heavy cannonading to be heard tonight one continual roar. Very hot weather with prospect of a change.\n","26":"\n Cool wind blowing all day. Heavy gun fire still going on our fellows being mixed up in heavy fighting, 18 casualties in our Amb, two deaths so far, feel it very much as the men lately working with me caught it worst. Church parade today with a band, the band afterwards treating us to a few pieces one of \nof\n which recalled Sydney as it was a tune played on every trip of the old Manly steamers called, I believe, \"In a Mississippi Cabaret.\" Had a Summer Hill lad, William of pill fame, arrive on the scene today.\n","27":"\n Rain at last, very continuous all the morning. Orders came through during the afternoon for C. section\n\nto get ready to move off at an hours notice so we packed our wagons that night. It came as an absolute tonic & I was as happy as a King until I had an argument with the Q.M. over a water tester he saying it belonged to A Section when I knew it belonged to my section, even his crawl down an hour later did not quite square me up. For a farewell evening four of us bought twelve bottles of Bass & some biscuits & had a \"hop over\" in other words & a good time. We decided to turn in about 2 A M, but before doing so decided to let the S.M’s tent down. Unfortunately the wooden floor it had prevented it from collapsing altogether & he was able to get out & fix it up. We had a great old laugh, however seeing him come out in his pyjamas swearing at the silly -----etc. Great aerial activity at night it being moonlight. Bombardment heavy. \n","28":"\n Handed over my duties altho’ final orders for the move have not yet arrived. Weather fine. Papers give a slight British reverse also news of the Nationalist Party’s win in Australia. Had a go at cricket also at Badminton the Q.M. producing a set, some game. Mail from Australia more papers than letters for me however. Our deaths in last stunt now total 4, all fine fellows two of my section & two being orderlys for the Sgt’s mess. My section suffered the worst as usual.\n\nThursday 10th May \n Fine day, rain in the evening. More casualties in an Amb, one man killed in the transport & a horse or two wounded also two motor Ambulances blown up, one riddled and a Sgt Symes of paper fame in Melbourne killed in one of them. I last saw him at Lemnos. The cars were hit standing in front of the Main D.S. Orders out\n\nfor us to move up, the actual date not yet being decided upon but we think tomorrow. Everything is packed up ready. Will probably have a hot time as our destination is close up & heavily shelled according to reports, more so than places nearer the line. Had another game at Badminton tonight & a shower after no mail today but sent home my aviators boots as could not carry them.\n\nFriday 11th May\n Handed over to the 6th Field Amb and left by motor lorry passing through Bapaume until we came to near \"Favreuil\" where the 8th &","29":" had the main Dressing Station. Had tea picnic fashion & slept out in the open & enjoyed it as the weather was ideal. The situation was fine being surrounded by broad fields covered with green grass. Alongside was a plot reserved for an aerodrome and I had an opportunity of seeing several planes at close quarters. Just before we\n\narrived the main Dressing station had been heavily shelled causing it to shift its location. Heavy firing at night the","30":" Div. having a hopover, result some 200 odd prisoners, other gains doubtful.\n","31":"\n Was disturbed about 5 A.M. by anti aircraft guns firing close to us, taubes coming over at intervals during the day. A & B sections moved off to a forward post leaving C behind. When I had unpacked word came from C section also to go up. Packed my boxes to do so of course without growling! Our new position turned out to be near village of Vaulx, the station opened up after Fritz had shelled them out. There we do walking cases only, the stretcher cases going further back. ‘Tis a delightful situation being on a rise where we can see the fields on all sides covered with tents men & horses, mostly transport & artillery horse lines. We can see the shells landing near the original position of this Station only \n\na few hundred yards away & our guns are firing in front of us & behind. As I sit on the grass during the cool of the evening the sound of laughter & happy voices can be plainly heard all round. Football is being played and contentment apparently reigns supreme, and all within full view of at least six German observation balloons.\n","32":"\n Not a great deal doing just the usual firing going on & ordinary flow of wounded. Had tea at the 14th Battery where I knew a few fellows. Had a couple of taubes over, the lads firing away with their rifles at them weather hot & oppressive.\n","33":"\n Spent the morning taking over & sorting drugs & dressings left behind by the 3rd Fd.a. their condition showing a messer of a dispenser. Witnessed a very thrilling incident at midday. A taube came over & was promptly shelled by our batteries.\n\nAll at once when three shells burst close to him, he dived & commenced to fall. At once cheers rang out, the greatest excitement & glee being shewn. The fall? Was peculiar, altho coming straight down, he appeared to make a spiral dive of it, wobbling from side to side , at once our guns ceased firing & we all waited for him to crash down when all at once when only a few hundred feet up he righted himself & shot away for home. At once the guns started but too late & two of our airmen dived at him but missed & it seemed to us that he got clean away altho’ later we were told he had been brought down. Opinions differed as to whether he had been hit & had made a great fight to regain control or whether he did the whole thing as a trick so as to get low down in order to locate a battery. This latter appears to be the truth, his kidding being so clever as to call forth admiration from all, the general opinion being that he deserved to get away. The \n\naircraft battery came in for much satire & will not cease fire so quickly another time. Had a look at \"Favreuil\" village & found it had been a pretty place containing a German cemetary with several hundred occupants amongst which was one Australian Capt. Pemberton. Every cross had had the regiment & date of death erased, the object being to suppress all information, so as not to assist our intelligence branch. Had another casualty today, one of our Sgts, Sgt Vicars being killed whilst handing over to one of the 15th. He was buried at 8 P.M. in \"Beugnetie\" close by. Heavy shelling during the night, our barrage at 4 A.M. being particularly heavy, more Rain.\n","34":"\n Had a fair number of cases through the result of Fritz’s attack in the morning. From all accounts he suffered very heavily. Orderly Sgt for the day with very few duties so ultimately found myself in the dressing tent. Rain at night. Spent a bad night with a sore ankle result\n\nof a kick at football.\n","35":" May,\n Received a good mail last night. A fellow came in today to tell me Morris had been killed. It took some time for the full realisation of it to come to me. I seemed so sure of him being safe that two days ago it was a mere matter of form for me to look through the A & D books at the C.C.S. Being some distance from the 2nd Div. I have been unable to find out anything or even to verify what I heard today. Only last night I received a letter from Will with an account of his time spent with Morris also some photos of them together. Poor old Morris, the finest man I ever will know. Honourable christianlike & upright at all times, having a brilliant intellect & firm determination which impressed everyone with whom he came in contact. The greatest honour ever conferred upon me was\n\nto be called his friend. In all my heartsearching as to what manner of man I was & how I appeared to my comrades his calling me friend was sufficient answer for me. David & Jonathan, & now David (Morris?) has gone to his maker. For over 10 years we have been all in all to one another- no influence between us, two bodies as one, a brother & a friend, the greatest asset in this life. Some day I will join him, ‘tis in Gods hand, Gods will be done.\n","36":"\n Approached the Major about time off to find out about Morris. He straightway sent me to the A.P.M. in Bapaume to find out where the","37":" Batt were. They could not tell me as they were on the move. On reporting this, the Major said he was sorry he could not spare me a car but would give me any time off I required\n\nto find them. At 2 P.M. therefore I went by car to Bapaume picked up a lorry near there which dropped me in Albert. I then walked to Belleview Farm where a friend rang up headquarters & found out that the 18th. were at \"Senlis\" for the night so I started off back having some tea & biscuit at the Y.M.C.A. in Albert for my tea. After walking about 6 miles I found them & was fortunate in finding an old acquaintance as orderly room Sergt & the Adjutant as an old Ashfield boy who gave me all the information I wanted. They told me he was shot through the head by a machine gun on the night of the 3rd. & that they had buried him not too far from \"Noreil.\" (Noreuil) All expressed the greatest sorrow \n\nat the loss and also admiration for Morris himself. I spent the night there & set off home about 9 A.M. walking through Millencourt near where I picked up a lorry which took me to Albert from there I managed to get to Le Sars where I located Will Harris’s grave, a great friend of Morris’s Near here I picked up a lorry to Bapaume & later an ambulance in which I finished my journey having covered in all about 36 miles. Now I have just finished a letter to Will which I will send over to him tomorrow\n","38":"\n Just an ordinary day with Fritz sending a few over near by. Watched a Howitzer battery firing in the afternoon & could plainly see the shell by standing behind the \n\ngun as she fired. Heavy barrage just on dusk & big stuff from the enemy.\n","39":"\n am marching out orders arrived and we move off tomorrow for pastures new. Some of the tommies arrived today. Weather fine again. Artillery and aircraft active during the day.\n","40":"\n O.S. again so had a bit to do getting the camp fixed up. Handed over to the new crowd, the 61st. Amb. at midday & marched to \"Avesnes les Bapaume.\" Here we took over a Gas Case hospital from the 3rd. & I met some of the old","41":" stationary chaps who had been sent out for duty in the field. Had a look at the cemetary where two of our bearers were buried & later inspected a Wilds Cooker at the C.C.S. which is a wonderful affair & does an extraordinary amount\n\nof work. On my way back I had a yarn with one of the pigeon fraternity. We use pigeons for conveying messages from the front line etc & at present have no fewer than 70 movable lofts. The birds are brought over as squeakers from England. Two birds are always entrusted with the same message as they sometimes get knocked but they apparently have no trouble in passing through a barrage\n","42":"\n C.section marched out again at 7.30 A.M to take over the Scabies Hospital at Aveluy again. Took over at 12 midday & spent the afternoon squaring things up.\n","43":"\n A week since I made the last entry. Things very quiet indeed, hardly anything doing. Running the dispensary & found the \n\nthe","44":" Had run out of supplies so had to fly around & get some. I had my first swim of the season in the \"Ancre\" the water being quite warm. Had a trip to Amiens yesterday. Major Metcalfe was called to London to receive his M.C. so four of us went by car with him as far as Amiens. We had a good time, the main item being a royal feed, Soup veal, fish, asparagus, omelette etc and Champayne. Left there after 8 and had an exciting ride back. The road which is part of the Grand Prix course was in good order & at one time had a race with another Amb. which bumped us trying to pass doing between 30 & 40. He gave in however & we arrived safely feeling very fit. Received a new fountain pen from home in the last mail, tres bon. Weather still good and the place looking beautiful, trees & flowers in full swing, a remarkable change from its appearance\n\nduring the winter.\n","45":"\n A. section now with us & I am doing general duties. Have had a couple of outings on a horse. On Sunday I rode to Miramont (Miraumont) passing over one of the most keenly contested battlefields of the war i.e. Thiepval, Beamont-Hamel etc. although spring had improved the appearance of the country signs were not wanting of the fearful shelling. Saw where a shell had buried itself in a tree without exploding. Tonight rode to \"Hedencourt\" a village favoured by Napoleon, the chateau being a splendid place, surrounded by beautiful woods and parks through which we had a splendid gallop. Now having regular swims in the \"Ancre\" & find it hard to take. Decorations out for the last stunt we receiving four Military Medals & the colonel a D.S.O. Our Amb easily holds the place of\n\nbeing one of the best in the A.I.F.\n","46":"\n \n\nTwelve days since I made an entry. Had a very quiet time at \"Aveluy\" being on General Duties towards the end. The river being handy- swimming helped to brake the monotony & several units handy held swimming carnivals. Had one good trip to \"Doullens\" by car coming back via \"Raineville\" a distance of about 45 miles thus covering almost the whole route of the Grand Prix, perfectly straight roads. In Doullens we had dinner & some dinner too, costing 3 Francs, after which I bought sundry vegetables, papers etc. At Raineville we stopped for about an hour for refreshments & arrived back for tea after a great outing. On the","47":" we had a party, in other words a \"hop over\" eleven of us joined together with the aid of a parcel sent\n","48":" from Glasgow & some Bass’s Ale I managed to procure, we had a royal time actually to commemorate a birthday. At 1 A.M. we decided the evening being well spent could then come to an end but before retiring let the W.O’s tent down for which some of us next morning were thrown out of bed. Such a party goes a long way towards brightening one’s life here & I can honestly say I always feel better after it, of course noone gets boozed or anything like it. On the","49":" we left \"Aveluy\" & went to \"Warloy\" a distance of about 7 miles & took over the rest station from the","50":" Field Amb. I went across by car in order to take over the Dispensary but found a bigger job awaiting me i.e. taking over the whole camp, going round with their Q.M. & checking tents, blankets, stretchers, food, etc etc. Had a very\n\nstrenuous time fixing up the Dispensary which job is not quite finished yet. The long looked for Australian mail arrived yesterday & I scored 7 altogether, there is still another mail due however. After some thought as to how Mother would take it I decided to apply for a commission in the artillery. I have always regretted not taking it on earlier & fretted at my restricted job in the A.M.C. the thought of Mum only restraining me from making the change. This time however one of the Captains started me off by asking me if I had ever thought of accepting a Com. adding that I would have no trouble. After weighing it over I decided to word the Colonel & did so he saying that he would certainly recommend me but adding that the Artillery is very difficult to get into. As things now stand I have put in a written application for admission to a school. ‘Tis probable that it will\n\nbe refused, in which case I will probably carry on as I am for the time being and have another cut later. As is usual when a crowd move into a village there is a lot of drunkenness & playing up but after a few days things will quieten down, it needs a certain amount of tact to put up with it however. Saw a fine concert two nights ago, a party visiting us from the motor column. The items were fresh to us & the performers good so thoroughly enjoyed it.\n","51":"\n Very quiet once more altho’ we had 4 orderly room cases before the chaps settled down. Weather much cooler & a fair bit of rain. Have just learnt that commissions are being granted to Pharmacists & all particulars of Dispensers has been asked for. It will mean nothing for me as there are plenty of qualified men with longer service as staff Sgts than myself. Have made a few friends in the village\n\nto whom we nightly repair for conversation. These French people are remarkably free, no modesty whatever in their composition. Very difficult to get wine or beer worth drinking all a fearful quality almost enforcing temperance.\n","52":"\n Nothing of importance to chronicle just carrying on usual duties & taking a stroll in the evening. When out Sunday afternoon we went to \"Toutencourt\" about 4 miles & found it a very decent village with several nurserys. Weather much cooler with several bursts of heavy rain. We have entered a competition at the Skill of Arms Competitions or sports, all branches of the service being represented. The Ambulances each put in a squad for drill, best wagon, tent pitching and First Aid & I was told off to train the first aid party an easy job as I managed to pick out a splendid team. Outside the actual men engaged very little interest is being\n\nshewn which is rather disheartening. Australian mail arrived again so feel pleased accordingly.\n","53":"\n The sports came off today in dull weather & proved a great success. The men engaged were awfully keen the spirit of competition shewn being the best recommendation possible for the spirit & morale of the troops. The drill was excellent & worthy of the Guards although very little time was given to prepare for it. A party of 150 men of the brigade gave an exhibition of physical drill under an English instructor & it was one of the finest exhibitions possible. Our Ambulance did not win chiefly through lack of interest. The wagon was faulty the work being left to a couple of men & no brassards were provided for the men. The drill was very even, we lost on the wagon & also the tent altho’ the Judges decision on the latter was open to dispute. \n\nWe won the First Aid, actually an only victory so I reaped somewhat of a reputation altho’ the men being proficient was the cause. It taught us a lesson which will probably be forgotten however that to win a comp. of this description nothing must be left to chance. The A.S.C. turnouts were wonderful & could not be excelled by any coachbuilder. General Birdwood of course was well to the fore, chatting to the men etc & it shews what the men think of him, that when he is seen speaking to the men, the onlookers always say, there goes Birdie slinging in the kidstakes again. He has a great reputation of kidding to the men & there is no doubt he does a lot of it, at one time this being the secret of his popularity.\n\nI failed to get the commission in the Artillery. A reply came back saying that no such commissions were granted outside of the Artillery itself but added\n\nthat if I wished I could proceed to a class for a comm. in the Infantry. I turned this down however as the shock would be great at home. My recommendation read- Sgt G. is well educated & in every way suitable for a comm. etc Has shewn himself adaptable & capable in every branch of the military service etc. etc. I consider his talents wasted as Sgt Dispenser in this unit.\n","54":"\n Went to the pictures again last night & thoroughly enjoyed them. On coming out we started copying some of the antics with the result I nearly broke my arm. One of the chaps jumped on it when it was resting on a tree & severely strained the tendons at the elbow. I actually saw the renowned Charlie Chaplin here for the first time & altho’ he was not at his best I can well imagine his drawing power.\n","55":"\n Our unit was inspected by General Birdwood today and he presented M.M. medals to four of our chaps at the same time. His inspection was typical of the man. He yarned with every","56":" or","57":" man took a delight in picking out the old hands etc mentioning certain incidents of the Peninsular etc. After which he said a few words of praise adding that there was as yet no sign of the end of the war. Game of \"pitch penny\" now all the rage, consists of throwing pennies to a line or peg, the closest collecting the lot, plenty of spare time making the game popular. Find myself quite an adept at the art generally finishing up to the good. The lads worked a great joke last evening. One man put out a challenge that he could guess any mans weight by lifting him on his back pick-a-back style, when the victim was in this position the onlookers would then baste his trouser seat with sticks. This lasted for\n\nhours newcomers falling into the trap and scouts went around hunting up Sgts and all to try & beat this weight lifter, needless to say each new victim provided mirth especially if they could not see the joke & went \"sour.\"\n","58":"\n On Thursday this Division was visited by the King. The sports of last week were repeated for his benefit & were more splendidly managed, he remaining ¾ of an hour during which time he strolled round the ground & shewed himself to everyone. Special instructions were given to the men to cheer him well but ‘twas a feeble lot of cheering except when he was going away. He appeared to be much as when I saw him in 1914. I believe the Queen is over with him but as the papers have not yet announced his visit here I do not know for certain, I do know however She came as far as Boulogne.\n\nProspects of an early move now as we have commenced to strike our tents, the North being our probable destination. Have just finished the last of four books I had sent to me some time ago, \"The Heart of Midlothian,\" \"Confessions of an English Opium Eater,\" \"Origin of Species\" Diary of Samuel Pepys, and have thoroughly enjoyed the four & have gained much from the reading.\n","59":"\n Still in the same place but our move is now much closer, 3 or 4 days should see us on the move. Am having a busy time as my partner is on leave in Paris & all the packing up etc falls to me. Had a good day in Amiens last week & saw more of the town than before visiting the Art Gallery, Town Hall etc. Main items of the day were a hot bath, & two good feeds. Still no mail & have received the information that the last was sunk so our luck was out. A new Dental unit attached for a few days brought to light some friends of 12 months ago when in \"Estairs.\"\n","60":"\n As some dastard has stolen my new fountain pen I am forced to use the best available, an old broad nib. Had a busy time packing up & completed the majority of it so that I could move into a smaller tent to carry on for the remaining days Things going very smoothly as we had plenty of notice for the move. Had a night with Capt. Mc. Being rather lonely he often comes down for a yarn, this particular evening we made a late sitting with the help of some champayne. One of our chaps down with Dipth. & I took a number of swabs from contacts.\n","61":" 27th..\n\nMy partner home again after a splendid time in Paris, was quite envious after hearing an account of his doings. More packing up during the day also some games at Badminton, my arm being almost better for the exercise.\n\n \n","62":"\n At last all packing up finished, the surplus drugs returned to the depot & now all ready to move off when the time comes. Had some tennis today, the first for years & find myself not the worst of the crowd by any means, so enjoyed it immensely. Am looking forward to our move helping me to shake off my bilious attacks which lately have been very frequent. Orders out tonight for our move on Monday.\n","63":"\n \n\nHeavy rain all day. Mail arrived at last, everybody delighted as the last being sunk we were hungering for some letters. We all feel better for the letters.\n","64":"\n\nNothing to do bar load the wagons during the day & clean up the camp it being inspected by the Town Mayor. At 5.30 P.M. we moved off marching through \"Contay\" \"Toutencourt to \n\n\"Pushevillers\" Here we loaded up the train with the aid of the Infantry, all our wagons tentage etc going on & had a supper of biscuits & bully & tea about 10.30 P.M. We then boarded the train which consisted of trucks, everyone being in a happy frame of mind, singing & cracking jokes. We lay down in our overcoats & although the truck had been lately inhabited by horses I slept right through the night.\n","65":"\n Arrived in \"Arques\" about 9.30 A.M. detrained & received a cup of cocoa from the Y.M.C.A. their sign read \"Buckshee cocoa for the troops\" We then marched about six miles to \"Eblingham\" distant about 6 miles from Hazebrouck\" & arrived feeling rather tired & hungry about 1.P.M. At 2.30 we had dinner which saved our lives & did nothing till teatime. The village is very scattered \n\n& not the best for billeting but two of us arranged for a billet of our own & we were extremely comfortable, in an attic.\n","66":"\n Raining all day & most miserable everyone almost being wet through. Not having much to do spent a part of the time in my attic writing letters. The place full of refugees as the huns have been shelling places 20 miles behind the line. Very sad to see a load of furniture followed by the owners trudging along looking for a home. For 3 years this area has been safe to within a couple of miles of the line, now the new offensive has changed the whole area. A vast effort is apparently going to be made here, troops are everywhere & any day we expect it to start when we will all take our turn. The huns know that it is coming & are attempting to upset our arrangements\n","67":"\n Raining again all day, very miserable. Orders out that B & C sections leave tomorrow for a four days training stunt with the brigade. Luckily I did not unpack my stuff so am ready to move off. It will be a rough trip if the weather does not alter. Spent the great part of the day writing.\n","68":"\n Rain all day. Went to St Omer for the first time & had about an hour there. Tis a very fair sized town & will try to get back again. Our four days stunt postponed for the time being, no doubt because of the weather.\n","69":"\n Nothing doing except another trip into St Omer. Visited the Cathedral & found it very fine, much brighter than Amiens & very old. The town itself is very old possessing an ancient wall. Made several purchases & had a stroll round the place being full of\n\nof soldiers officers nurses & girl aids, the latter tastefully dressed in a brown costume.\n","70":"\n \n\nFinal orders out last night about our trek. Reveille 4.30 Breakfast 5, move off 5.30. We marched a short distance and then took motors in which we journeyed to \"Lumbres\" about 8 miles from St. Omer. The trip was very interesting it all being new country to us. Fixed up billets etc. by dinner time & had the remainder of day free. Our mess very good, a room in our billet.\n","71":"\n Orderly Sgt for day. Bearers marched out to attend a sham fight in the training operations. Village of \"Lumbres\" about the best we have been in. People of good class & estaminets etc high class Liquors Benedictine whisky etc sold freely in marked contrast to other places, the regulations not being enforced to any\n\ngreat extent, owing no doubt to there being very few soldiers in the place. Bought some views etc.\n","72":"\n On dispensing duties the bearers going out to attend the training nothing else being attempted. Heavy rain at night.\n","73":"\n Orderly Sgt. Orders came out the night before, reveille at 6 Breakfast 6.30 so I was out at 5.30 firing things up. Everything O.K. & men got away by 7.30 Had a singsong last night impromptu & successful. More rain. The training as carried out is rather thorough, crops & such obstacles not being troubled about if they come in the way of the men, the owners no doubt putting in a claim for the damage.\n","74":"\n The day of our return. My section moved off at 9.15 A.M. embussing on the edge of the town being carried to \"Arques\" about 10 miles\n\nfinishing the journey to Eblingham on foot. Found things as before but learnt that during my absence the Colonel had given me a very high recommendation for the position of Warrant Officer. He was called on to recommend three names from this Unit but don’t expect anything from it as there must be some others who have been Sgts longer than myself & that carrys a lot of weight. Then again through being deprived of my crown lowers my position of seniority & if I received such a position now it would be over the heads of several\n","75":"\n Had a very easy day wrote letters in the morning and had kit inspection during the afternoon. Have made a start on French again but will probably have to drop it when we start work again.\n","76":"\n Church parade in morning, afternoon free. Had a go at looking up French.\n","77":"\n Things now very brisk in the ambulance in the way of drill & training. We have been so long out of the line that the officers are looking round for something to do & the unit actually was deteriorating. The Co. has now taken a grip on things in general and everyone has to attend all parades & drill, route marches, etc are the order of the day. The result will be good even if ‘tis irksome. This morning we had Gas drill & inspection of helmets in which latter they utilised my services as usual. In the afternoon we had a lecture, the usual style & then I had a run into St Omer on one of the cars I have had to move out of my billet, apparently I was too comfortable or else they thought I was too far from their influence, however I had to leave & take up my quarters in a loft with the others. The colonel is evidently trying to hand over a very smart ambulance to his successor.\n","78":"\n Now have to go on the early morning parade 7.A.M. simply a roll call. At 9.A.M. we went for a route march through \"Renescure\" passing through some beautiful country, the road running along a ridge from which splendid views could be seen. Harvesting now in progress altho’ sadly upset by the rain which we have had lately almost daily. Before returning we called in at the Engineers Camp for our Gas lecture. A new gas used by the Hun this last month has caused a lot of casualties & apparently went a long way to check our Flanders offensive. This gas is like mustard ol sinapes perhaps & is fired in shells 7.7 & 10.5 containing the liquid combined with a small explosive sufficient to burst the shell. The liquid then becomes gas & affects both the eyes & lungs in addition to the skin. The eyes become entirely closed with great pain but ultimately recover, the lungs may be affected for months or even years, while the \n\nskin is blistered if it comes in contact with it. The enemy with his usual thoroughness only uses it when tis most favourable i.e. night & morning, wind about 4 ½ miles per hour or light mist. Strong wind hot sun & heavy rain weakens its affect so under those conditions tis rarely used. Our casualties apparently were very heavy altho’ ‘twas proved conclusively that our helmets were a perfect protection, they were either not put on properly or quickly enough either through carelessness or failure to smell or realise the seriousness of the gas. Armentieres was bombarded early in the morning very suddenly, 120 gas shells to the minute being rained on the town followed by a heavy bombardment of H.E. & shrapnel designed to make the troops etc seek cover in dugouts & cellars already filled with gas. The idea was successful. The civilian casualties totalled 1500 but cannot find out how many amongst the troops.\n\nLecture to tent subdivision during the afternoon.\n","79":"\n Heavy rain during the morning the usual route march however, a short distance only. In the afternoon received more gas lectures from our officers, one in particular being painful to listen to, he had not the faintest idea of his subject.\n","80":"\n Route march in the morning about 7 miles passing through some beautiful country quite the best we have yet experienced in France. During the afternoon we had the Company drill with the Officers. The Sgts & officers together practised giving orders, each in turn yelling out the orders, later we drilled with ropes, the results at times being funny. The band visited us later & so finished an event-ful day.\n","81":"\n Gas drill all the morning getting very monotonous altho’ very necessary\n\nWent into \"Arques\" to find the 18th. in the afternoon but found that they had shifted & the Colonel was in England. So therefore went to St Omer. Had a couple of hours there & had a look at some old church ruins. Did a little shopping & arrived back about 5.30. Had tea in the village by invitation & had a splendid evening. Shelling very heavy once more, the sky being lit by continuous flashes Star shells also prominent.\n","82":"\n Breakfast 6.30. Marched off at 7 A.M. to \"Blaringham\" to the baths about 4 miles. They were very poor so examined the church & had a drink while the lads bathed. Kit inspection afternoon & wrote a couple of letters. \n","83":"\n Church parade in the morning with the afternoon free\n","84":"\n Inspection by General Birdwood & march past. We had to march to \"Blaringham\" in tin hats & full packs\n\npassing General Birdwood & his staff in the square & home again, about 8 or 9 miles altogether Nothing doing the remainder of the day. Taubes over at night bomb dropping but ignored our village.\n","85":"\n My section took over the Hospital as I had the dispensary again. Went to Hazebruck for drugs then out further to the depot as they had moved owing to the town being shelled. Found them just opening up so went on to No 19 which was at Godewaersvelde almost in Belgium. They could not supply my wants so returned again having at least had a splendid run in the Ford which I drove most of the way. ‘Twas a very interesting run saw plenty of Hop plantations & a large number of new British regiments.\n","86":"\n Had another trip for drugs this time being fixed up at No. 11 so did not have so far to go as before. Spent a couple of hours going\n\nfull speed fixing up the Battalions with the stuff they required to go out early in the morning. Heard the taubes over at night again, the searchlights & anti-aircraft guns making quite a good display. One machine bombed \"St Omer\" killing seven & wounding 22, we could follow the machine over & on its way back again.\n","87":"\n Friday very quiet again went out for company drill in the afternoon good practice, & took my turn drilling the others. Mail arrived at last had a few from Australia & a parcel from Glasgow.\n","88":"\n Very little doing so managed to write a few letters. More company drill in the afternoon. At night had a mild hopover & farewelled Capt Mc. as he was going to the Artillery next morning. More rain during the day, harvesting not quite completed.\n","89":"\n Not feeling too bright my parcel from Glasgow proving rather indigestible Heard from Tommy Gissing & tried to locate him, found he was at \"Arques\" so might see him any day. Usual walk at night & listened to the band.\n","90":"\n General review by Sir Doug. Haig coming off, one section from the three Ambs of this Division uniting to form one Amb for the March past. This Amb has been given pride of place with our Colonel in command and my section has been chosen to represent the Unit. We handed over the Hospital today so as to be free for it. Great preparation for a concert for tonight but ‘tis raining so will probably be postponed. Learnt some facts concerning myself which shows our Colonel up very favourably. By right I should have a crown which would\n\nmean another 1\/6 a day but the A.D.M.S has refused to grant it, altho’ the promotion has been given in the divisions. Only last week a L\/cpl was promoted to Staff Sgt & the Colonel hearing of this personally approached the A.D.M.S explaining the injustice to myself. He admitted the injustice but showed that if he granted the promotion he would render himself liable to have to pay the difference himself. As things now stand 4 divisions of the A.I.F. grant it whilst 2 refuse, a ridiculous state of affairs & injurious to me as I thus lose my seniority. More Australian mail today so feel well set up.\n","91":"\n Had rather a miserable day. In order to rehearse the divisional inspection we marched out at 8 A.M. a distance of about 4 miles and just when we reached the place word came that it was postponed until the afternoon. It was raining practically all the time\n\n& we had to mess about in it until final word came that it had been postponed for the day. Luckily we had some lunch with us so set off about 2 oclock for home again rather forlorn.\n","92":"\n Set off again at 8 A.M. for the review & this time it came off despite the rain. It was held on a beautiful piece of ground on which the whole division formed up in a square quite easily.\n\nSir Douglas Haig then arrived with his staff & inspected the crowd pretty thoroughly calling up & congratulating the various heads. A march past in line then took place after which he made his adieus and departed. He was a man to give confidence, strong & determined in face with heavy moustache reminding me strongly of Kitchener but with a more virile look, perhaps because he was younger. Had the weather been fine it would have been a splendid\n\nspectacle, as it was it was well worth seeing & certainly inspiring despite the rain which fell at intervals. Machine guns were posted in case of enemy aircraft appearing. After lunch we marched home it raining all the time.\n","93":"\n Had a very quiet day as a rest after the rough day of before. In the afternoon gave some gas drill etc. At night our concert came off having been postponed several nights owing to the rain. It was the first appearance of the concert party, dressed up as Pierot\nt\ns & the show was first rate being well attended by troops billeted around. Twice during the evening it rained but not sufficient to stop the performances.\n","94":"\n Route march in the morning for which I took C section & during the afternoon we \n\nhad company drill. Had trouble with a couple of the men, the usual thing after pay day they run amuck.\n","95":"\n\nvery little doing. Company drill in the morning and lecture during the afternoon. Felt very off colour but managed to write several letters to catch the mail.\n","96":"\n Went to Church of England Church Parade at 9.30 and was pleased to see Padre Holliday back who was with us 12 months ago. He is an exceptionally fine man and does good work. After the service Cummunion was held under a tree, 15 of us staying back for it and before the service was over the next Church parade had assembled and were interested spectators of our service. To my shame be it said the presence of the 100 or so onlookers tended to prevent me following the service properly so selfconscious does one become. Went\n\nfor a long walk in the afternoon round the surrounding villages but could not find the unit I was looking for. The night being a moonlight one both our own & those of the Huns were out bombing. Several bombs were dropped nearby, the antiaircraft guns & all making a great din for about an hour.\n","97":"\n General drill etc. Moonlight night so taubes were over & dropped bombs near by. One hole left was 10 ft deep & 30ft wide in the middle of a field. The aircraft guns put up a tremendous effort with no result so far as we could see.\n","98":"\n Had the section out drilling in the morning & introduced the O’Grady drill to make it more interesting. Inspected Gas helmets in the afternoon. More aircraft over at night. Trying to learn French in my spare moments now and will try & stick it out.\n","99":"\n Route march 2 ½ miles to the canal for a swim, most enjoyable. Lecture in afternoon on Gas etc.\n","100":"\n Route march in morning, afternoon off to \"Arques\" to do several things. Two I failed to carry out. One to see Colonel Murphy of","101":" because he was away for the day, second to see Tommy Gis, he also was away. I saw a wonderful system of locks in the canal there. The canal level drops some 70 ft or more necessitating 5 continuous locks, there is also a lift or rather two lifts which raise one boat up to the higher level at the same time \nlowing\n lowering one. ‘Tis worked by the hydraulic power & consists of a long basin into which the barge is steered the ends being then closed. A lever is then pressed & the whole affair basin, water & barge is raised or lowered as the case may be, the end is then raised & the barge passes out into the stream the process being repeated like a see saw\n\n \n\nIt was built in 1887 & is a wonderful affair Had tea of 3 eggs & chips- 2 francs 2 & by means of a lift on two different cars managed to get home without getting wet, it having come into rain very hard.\n","102":"\n Taken over the dispensary again so finish parades for a time. Signs of a move in the air & about time as we are fed up of the joint. Weather much improved beautiful days still doing a bit of French but do not get a great deal of time what with work, letter writing & reading etc.\n","103":"\n ordinary routine. Very Good concert at night by our own fellows. They have worked up a very fair concert party & have given some very decent shows.\n","104":"\n Collected drugs from depot & issued same to Battalions so had a strenuous time for a few hours. Our cricket team won the Brigade Championship today after an exciting match.\n","105":"\n ordinary routine during the day. At night went to a good concert given by the A.L.T.M.B. They started off with the Trial Scene in \"The Merchant of Venice\" in which they were very good and then gave skits on soldiering, the officers, and humorous items in general, a very fine show.\n","106":"\n Had to collect more drugs & issue to the Artillery. A cool change set in a feeling of winter being in the air. Preparing for a move up to the line which should come off inside a week. Report gives the place a very bad name and we are looking forward to a rough time. \n","107":"\n Orders out for a move so every one is elated. We have been idle too long and a move always puts everyone in a good mood. Had a busy time packing up & sending stuff to the Battalions. At night a concert given by our own party but very poor as they did not know their items, through rushing\n\nround giving concerts in \"St Omer\" instead of to the men in the field.\n","108":"\n Spent the day in packing up the remainder of our drugs & going off to the Depot for a few odds & ends. Had a good drive on the old Ford. At night had a final dinner at our late billet in the village as a send off. The madame excelled herself in her cooking especially in preparing potatoes, specially mashed with egg etc & baked in boiling fat. Perfect.\n","109":"\n Reveille 5.30, an early start in order to clean up camp. Marched out at 9.30 passing through Wallen-cappell, St Sylvestre-cappell & so on to \"Steenvoorde\" a very fair sized place, the march being about 9 miles & very trying in parts as we met roads with cobbles. The whole division were on the road. Reached Steenvoorde about 4 oclock tired but feeling well & fit. Had a wash & clean up in a creek & then after tea a few of us strolled back into\n\nthe town. The church proved to be a very fine building with a splendid tower. Some of the windows were really beautiful quite as good as any I have seen in France so far. We stayed awhile & listened to the service the singing sounded beautiful. Later we visited a few of the shops, bought some odds & ends, sampled their beere & met Parisian Bock which we had not seen since we left this area 12 months ago. On our return to our billet which was once a pigstye divided by a partition we found the other Sgts in a joyful mood which developed into a series of raids until about 11.30 P.M. The partition dividing us into two parties was the origin of the affair & it took a long time next morning to sort out our different belongings, blankets puttees & clothing being mixed up together, altogether a pleasant evening. Hop picking is in full swing in the neighbourhood the first time I had actually witnessed it.\n\nWe now have a new O.C. Our Colonel handed over the command to Major Thompson on Friday a special parade being held at which he inspected the unit & was introduced to all the N. C. O’s. On Saturday the Colonel said good bye & left the same night on his way to Australia. Good luck be with him, a man I have great respect for, St. Col A. H. Tebbutt D.S.O.\n","110":"\n On the wallaby once more. We started off at 9.30 again passing through Abeeli & so to \"Reninghelst\" crossing the border into Belgium at 11.50 A.M. finishing the journey about 3 oclock a distance of about 8 miles. We were all fairly tired but only one man dropped out. On arrival I had a sponge over & clean change of underclothes & felt a new man. Heavy traffic on the roads large numbers of motor lorries being in evidence also a lot of Chinese Coolies \n\nsome of them big men & superior to the type we know in Australia. I feel sure a visit to China would raise our estimation of the Chinese much higher than it is now.\n","111":"\n Had a very busy day. Took over the dispensary and was kept going strong all the morning attending to sick parade etc. There are a large number of men in the place without an M.O. attached & the nearest Ambulance has to attend them. Requisitions began to flow in so prepared an order on the Depot. Did not get an opportunity to see the village. \n","112":"\n Another heavy day over 200 on sick parade & admitted 40. Collected the drugs & issued nearly them all during the afternoon the work kept two of us going hard all day. Had a look at the village at night & found the place packed with men of all regiments & races, a motley crowd. The\n\ntraffic was very great & took some controlling. Good reports about our men in the line, all objectives said to be gained & held, a fair number of prisoners have filtered back. Had two mishaps during the day, one motor driver fell & hurt an eye & our dispatch rider was knocked down & had his leg broken by a motor lorry, both being evacuated. The majority of our bearers went up to the line today, we expect to follow any day being at present between 12 & 14 miles behind the front line.\n","113":"\n Another busy day but easy for myself as another dispenser turned up on the scene. Managed to write a couple of letters home. Had a stroll round the village at night also witnessed a soccer match, a very good game indeed. The place is packed with soldiers of all description. Witnessed a beautiful sight at night. Several\n\ntaubes were over and our Searchlights got on to two of them. About 9 or 10 beams of light all concentrated on the plane & it showed up like a golden beetle. The a-aircraft guns boomed out & the machine guns poured in a stream of bullets all to no purpose. Their bullets or some of them are luminous & they can be seen going through the air.\n","114":"\n Am writing this sitting on the floor in a stable belonging to Hennicks Chateau. Our bearers came down from the line this morning leaving 7 dead behind all from B. Section. Orders then came for us all to move up at 6 P.M. So we packed up during the afternoon, evacuated all our patients & boarded motor lorries about 7 P.M. My party arrived at this Chateau O.K. but we are going on further in the morning this place I think being where the transport are going to remain. Collected a car load of dressings etc this morning from the depot so are all prepared for a big stunt, the opening stages of which have been very successful and \n\nadvance having been made on an 8 mile front, managed to get a few letters away before I came up but had to pack my washing in my kit wet, as it was not dry. I have hung it out now to give it a chance through the night.\n\n"}}