{"Document Name":{"0":"Diary_0130","1":"Diary_0130","2":"Diary_0130","3":"Diary_0130","4":"Diary_0130","5":"Diary_0130","6":"Diary_0130","7":"Diary_0130","8":"Diary_0130","9":"Diary_0130","10":"Diary_0130","11":"Diary_0130","12":"Diary_0130","13":"Diary_0130","14":"Diary_0130","15":"Diary_0130","16":"Diary_0130","17":"Diary_0130","18":"Diary_0130","19":"Diary_0130","20":"Diary_0130","21":"Diary_0130","22":"Diary_0130","23":"Diary_0130","24":"Diary_0130","25":"Diary_0130","26":"Diary_0130","27":"Diary_0130","28":"Diary_0130","29":"Diary_0130","30":"Diary_0130","31":"Diary_0130","32":"Diary_0130","33":"Diary_0130","34":"Diary_0130","35":"Diary_0130","36":"Diary_0130","37":"Diary_0130","38":"Diary_0130","39":"Diary_0130","40":"Diary_0130","41":"Diary_0130","42":"Diary_0130","43":"Diary_0130","44":"Diary_0130","45":"Diary_0130"},"Date":{"0":"unknown","1":1584.0,"2":1587.0,"3":1590.0,"4":1591.0,"5":1594.0,"6":1595.0,"7":1598.0,"8":1609.0,"9":1616.0,"10":1617.0,"11":1618.0,"12":1620.0,"13":1628.0,"14":1629.0,"15":1633.0,"16":1634.0,"17":1635.0,"18":1645.0,"19":1651.0,"20":1653.0,"21":1656.0,"22":1663.0,"23":1670.0,"24":1678.0,"25":1683.0,"26":1684.0,"27":1685.0,"28":1686.0,"29":1687.0,"30":1700.0,"31":1705.0,"32":1715.0,"33":1718.0,"34":1719.0,"35":1723.0,"36":1726.0,"37":1727.0,"38":1728.0,"39":1729.0,"40":1730.0,"41":1734.0,"42":1735.0,"43":1740.0,"44":1741.0,"45":1743.0},"Entry":{"0":"\n\n","1":" \n\nStill in this damnable Jordan Valley. Yesterday morning some ½ doz. turkish planes came over & bombed us & this morning they were here before I was out of bed; the result being that I had to run out in my pyjamas & dive into an old well about 6 feet deep.\n\nIt was just as well that I did so too, for I had no sooner done so than 4 bombs exploded about 10 yds away. We had two white men wounded & eight natives & one\n\nnative killed outright: and all in about 15mins & before breakfast. The stunt out here has not been an unqualified success, we advanced 40 miles & blew up 15 miles of the Hedjaz railway but could not get the tunnel which we were after & and had to retire with the Turks close behind. This morning they could be seen coming down the hills on to the \nplane\n valley through the glasses & now we can see the shells bursting over on the other\n\nside of the Jordan.\n","2":" \n\nNothing much doing the last few days. I heard tonight that we had let the Turks bridge over the Jordan & send two aeroplanes over & then we landed a big shell fair in the middle of the bridge & smashed it & took the two companies prisoner\n\nSome of these lads here get hold of some weirde ideas to amuse themselves now & again; the other day two \"dags\" were on leave in Cairo\n\nand as a matter of course\n\nout for the pyramids.\n\nThey passed several officers on their way & one of these fellows with Paulette on his knee paid each officer the \nmilitary\n correct military compliment but instead of using his hand with which to salute, he used his Paulette’s leg! \n\nSome say that we are leaving this place on the","3":" but as far as I can gather there seems to be every chance of being here for a considerable while yet.\n\nI now understand the true inwardness of the proverbial request to \"go to Jericho\" for, this valley being 1200 feet below sea level it is most insufferably hot & so that in summer time one can easily understand that it would be merely a synonym for that other Place where there are\n\nno Coal queues\n","4":"\n\nThis morning we woke up to the noise of great guns & a fierce bombardment. The Turks made an attack starting at 3am this morning. \n\nIt was abortive & I hear that they suffered very heavy casualties 2000 being the number estimated while we lost 17 men killed & 40 wounded. Now every thing is quiet again, but there has been great activity all through the day.\n\nI was much amused today by one fellow - rough as guts- as the saying is who declared the subject under discussion being the Jordan Valley in Full Summer, that the man who would live in Jericho in the summer would \"Box on in Hell\"\n","5":"\n\nYesterday we were ordered to move our site so in the afternoon we moved about half a mile into a patch of scrub close to 32 Coy the company to which we are attached for rations etc……\n\nI came down first & prospected for a good site & now we are in quite a decent little place amongst the scrub, which is composed of a prickly tree after the style of the English Hawthorn & which bears quantities of little berries just like apples only about","6":" the size. I am told this species grows only in parts of South Africa & this valley The natives call it \"Nebbuck\", the fruit when ripe is good to eat & just like an apple in taste.\n\nThere are quite a number of fireflies here too & the scrub at\n\nnight is really quite pretty. But in day time I would rather be anywhere but here. Great rumours of moving back near the coast on the","7":" Personally I shall be very pleased & I think everybody else too for this is the hottest & most unhealthy place we have yet struck.\n","8":"\n\nJordan Valley\n\nStill here living through days which combine to make one dull monotone: Everything precisely the same day after day, with the exception of the heat which grows steadily \n\ngreater & more intense.\n\nSince I last wrote we have moved three times, a few hundred yards only on each occasion, which proceeding is extremely irritating.\n\nNow we are on the eve of another move – a proper one this time – we were to have moved at 10 30 this morning but the turks conceived the idea of either running one of their guns up closer or opening up with a big one: At all events they proceeded to place some 40 HE. shells with great accuracy on our proposed campsite, where at the enthusiasm for moving seems to have\n\nbeen somewhat damped & we are still in our old camp ready to move at an hours notice. This move has something to do with a stunt which is coming off, \nwhose\n the apparent purpose of which is I believe the taking of Ahmon(the objective of the last raid) & holding it & joining up with the Sherif of Mecca. But that of course is mere hearsay\n","9":"\n\nI am writing from the same spot as last time, but, as perhaps , if you were a boy scout in your early youth you will have noticed, a week has elapsed & during\n\nthat \nwe we\n week we have been encamped about 5 miles further across the flat about a mile this side of the Jordan. We moved down after dark & arrived on the shelled spot about 9 pm, the regiments & first line troops started out the same night & there was heavy shelling on our part in the morning. It was just after Lunch when we were about to put up a bivvy when suddenly a shell dropped 60 yds away & exploded with a feeble report. You never saw such surprised people in \n\nyour life as we were, it seemed to drop out of the clouds. However we soon discovered it was a long range gun firing from the hills about 6 miles the other side of the river. \n\nHe was going for the road which ran up past us about 300 yds away & all the other shells, about 15, dropped fairly near the road doing no damage whatever.\n\nThe stunt developed in a curious way the Anzac Division went away about eight miles straight up the Jordan & then struck in & captured \n\nEs Salt, while the Infantry made a frontal attack on Shunet Nimrin. We got about 1200 prisoners but the Turks brought Reinforcements up from Nablis which complicated matters & nearly caught our mounted Brigades. Now the impression seems to be that we have failed and the Anzac Div is, I believe, out of it now, but I dont think the fighting is over yet by any means. The position was a curious one, as far as I could understand it was according to the map on the next page.\n\n \n\nWith the exception of the few shells which fell & frightened us, we were out of it altogether. And very nice too.\n","10":"\n\nOf very boredom, I am sitting down to write having absolutely nothing else to do. Oh! Life in the Jordan valley Oh! Dulce et Decorum est! Oh! Lord how long? A great expanse twelve miles broad hedged in with high hills on either side covered with scrub & nothing to be seen save innumerable dust whorls. Now one of our antis is firing at a turkish\n\nplane & presently we shall have bits of HE shell scattered all over the place. No. I have just had a look he is going up the valley.\n\nThere is nothing to see beside the dust whorls except the Dead Sea lying motionless down to the south like some noisome big cesspool. With a little imagination one can almost see the obnoxious odours & poisonous fumes issue up from its tepid glassy surface.\n","11":"\n\nRoused from my bed in haste this morning by the advent of some 15 enemy planes bombing. Fortunately we had no casualties this time. It must have been amusing for anybody who had enough time to watch us, for I had dug my hole too small & this morning when I tripped forth in my pyjamas, I could not get into it. I tried all sorts of ways but it was no good first my head stuck out & then my backside, however only one plane came over the train & the nearest \n\nbomb he dropped was a hundred yds away Ss we were all right.\n\nI got three letters last night. I was pleased to get them, but nowadays they always depress me because they recall times which are past & which can never quite come again. What an unrelenting spectre Time is! How inexorable! Try you never so hard, you cannot catch & have again those precious hours which are past & are even now passing. Now they are here, in a flash they are gone never to be recalled\n\nleaving a bitter-sweet memory behind like the cloying bouquet of some sweet dish upon the palate.\n\nComplete happiness is impossible for even as you enjoy a certain measure, you realize that it is even then slipping from your grasp. \n\nThe passing of time is the greatest tragedy in a man’s life\n\nAnd what a tragedy is this! six tenths of the populations of the world wasting four, five, precious years in war! What senseless profligacy we have here! They are lost never to be recalled\n\nThings can never be the same again\n\n‘History repeats itself’ you will say.\n\nYes the same scene is laid & the play is played over & over again, but with the same cast, never. But the world advances steadily civilization grows, man improves his status . True, but the individual regrets always his youth, the golden years when he was so happy & - did not know it \n\nThe Thread is spun, woven & cut, cut, woven, & spun & still Time remains inexorable, unrelenting, transient.\n\n \n","12":"\n\nAve! Fossa damnata triplica, te obiturus saluto. Ave atque Vale. In other words, thank God, we are off at last. We leave at 6pm today Jerusalem wards.\n\nThe ‘planes came over again yesterday morning but dropped no bombs at all near us. Today we slept on in peace. The first morning he did most damage accounting for 100 odd of which quite 40 were killed. This morning – two days too late – our planes were up patrolling.\n","13":"\n\nOn the last day on which I wrote we reached Talut ed Dune, a spot - & a very dirty one at that – in the hills about a mile or two in the hills towards Jerusalem. \n\nHere we languished & Hope nearly died but finally on the","14":" we left for Jerusalem which we reached just as it was breaking dawn after a very tedious & slow trek. The next evening we started down the Bethlehem Road passed through Bethlehem – the modern Brit Lahm\n\nNot Transcribed\n\nand finally pulled up by a series of bumps on a rocky patch of ground about two miles south of Bethlehem.\n\nNow a word as to the celebrated girls of Bethlehem. I can’t say that I can fully endorse William Kinglakes immortal description of them, but there is no doubt whatever but that they stand out on their own quite distinct from any others both in personal appearance & deportment. The womens headgear is another thing that is entirely distinct. It takes one back some 800 years to the\n\nmedaeval England; for they wear the elongated conical cap \nwhat\n with a white shawl affair draped over it. Indeed I have heard this explained as being the last fashion that these good ladies ever saw, namely that of the era of the crusades, when they copied the latest thing that Queen Berengere brought out from England. Anyway it is very simple & yet most fascinating.\n\nNB. Only married women wear the headdress, the girls wear a sort of small tagiah with a mantilla over it.\n\nNear Bethlehem","15":"\n\nSolomon’s Ponds\n\nThe above mentioned are three enormous water reservoirs let into the ground each about 100yds x 80yds. Their history I do not know as yet.\n\nWe have two new members on the strength now. One is a little pup, name undecided yet, the other is my horse which I got from J. .. backsheesh. Whether they will let me keep it I dont know yet but I see no reason why they should not as I had Bernard with me when here\n\nat Xmas time. There has been no row about it as yet anyhow & I hope to have many pleasant rides around the place on him. I have decided to call him ‘Henry’. He is not nearly as good a beast as Bernard nor so pleasant to ride but still I dont intend to look (or is it smack?) him in the mouth for he is a gift horse. He stands about 15 hands & is a very dark chessnut almost a brown. I have only ridden him once as yet but so far shying seems to be his only fault. This\n\nrather an awkward fault too in this sort of country as often there is a shere drop off the road of 10 – 50 feet. It is beautifully cool up here now, in fact it is absolutely cold after Jericho. I have to put everything I have on top of me at nights to keep warm.\n\nTonight, for example, there is a bitterly cold wind & one feels it in a tent, as I am, by myself.\n\nBut it is much better than Jericho God forbid that I should ever see the place again as a soldier at any\n\nrate. The present rumour is that the","16":" Bgde at all events stays here for about a month & then the whole Division goes down to a Rest Camp at Jaffa. mais, nous verrous. \n","17":" \n\nI seem to have made rather a hit with my two washerwomen, both very handsome girls, chiefly I think because I have not put \n\n Anyhow they darn my socks & mend my shirt & brought me some flowers this morning. They are a cheery\n\npair & derive much amusement from my Arabic conversation.\n","18":"\n\nSolomons Ponds\n\nHenry, the pup & I still continue to lead a blameless if somewhat mononotonous existence. \n\nWe are still at Solomons Ponds & a very comfortable camp it is too.\n\nAs you, whoever & if ever, you may be, can see I am writing this merely from a sense of duty. I have nothing whatever to put down. At present I alternate between \n\ncomfortable satisfaction of myself, my job & everything else, & deep dissatisfaction at everything.\n\nAnd yet it would be difficult to find a better job. I live in a tent sleep on a stretcher have about three hours of work to do a day, a horse & saddle of my own to amuse myself & 10\/- per diem for doing it. upon you for a thankless wretch! \n","19":"\n\nHere is a night to make the devils in Hell to shiver! A roaring, raging blustering wind, cold as a foretaste of the North Pole. Low wisps \nof\n & damp streamers of clouds racing along a few feet up from the ground & enveloping every hill, for we are often up in the clouds here at times; a cold, cheerless, uncharitable night to make a man dream of drawn curtains and a \nrearing\n fire roaring up the chimney. And what have I? A draughty tent & a guttering\n\ncandle. Two blankets for a bed\n","20":"\n\nBasset, Captain, Officer, Medical, (our) has gone on leave to Alexandria. Behold me, for 23 hours out of 24 per diem the supreme fount of medical knowledge & advice for some 500+ souls - what irony! The remaining hour is when a New Zealand MO. comes & takes Sick Parade in the morning. My treatment is largely one of faith. I say that I know exactly what they are suffering \n\ncandle. two blankets for a bed\n\nfrom give them Quin Hyd Z & aspirin V & tell them to go to bed. My diagnosis is usually \"malaria\" or if it is obviously not malaria I fall back on good old \"Pyrexia N.Y.D\".\n\nPeople without Temperatures are a little more difficult, but I give them all something. Never shall it be said that I sent them empty away.\n\nAnd the most amusing part is that they ask me my opinion as\n\nwhether any \ndoctor\n new doctor we may happen to have is any good or not!\n\nI met a beautiful new complaint this morning \"metatars algia\"\n\nThe next one who comes to me with a pain in his foot will be diagnosed \"metatarsalgia\" & will go away duly impressed I am sure.\n\nMiriam Hielios my christian though dusky washer girl 15, & quite good to look upon, continues to \nbring\n supply me with flowers &\n\n& we converse every day to her huge amusement.\n\nI got her sewing the other day & she went through my entire wardrobe & sewed buttons & darned etc until everything was complete. A most useful girl. We make a beautiful picture of domesticity. I smoking my pipe at the table after lunch. Miriam sitting at the tent door sewing in the sunshine. Henry placiding munching the contents of his feed bag & the pup playing on \n\nthe floor with one of my Turkish slippers.\n","21":"\n\nThis is a great spot. I have come out for a ride this afternoon as usual & have halted at a spot of which I am very fond. From here, away to the North can be seen the Holy city. To the N.W. the little point & cluster of buildings belonging to Kuryet el Enab jut up, one of the highest points in the Judaean Hills. In front of me hills & rocks with here and there a little mud village clinging to their sides\n\naway below me; while far in the distance can be seen the Plains of Sharon & the glittering Mediterranean. A soft & cool breeze blows up the Hillside. One has the sensation of being on top of the world. On three sides one looks on & on until sea, land & sky merge in a delicate blue haze. Just now these hills are quite beautiful. The grey outcrops of stone contrasting with numerous little terraces of the yellowing corn while here & there is the fresh green splash of a vineyard. And soon now we leave it \nall\n","22":"\n\nWe are now back in the Jordan Valley. Since two days as our Allies put it. And it is now a holy terror. A fine powdery dust lies about an inch thick over all of it Scorpions tarantulas etc abound & amongst other things, there is a plague of venomous snakes whose bite is practically certain death. The heat is stifling, occassonally reaching 120° F. Malignant Malaria very prevalent & mosquitos very bad. There you have some faint idea\n\nof the Purgatory in which we are doomed to spend the next four weeks. Add to this the fact that the Turks have brought up a long range gun with which they shell us now & again & I think that that ends our catalogue of woes. \n","23":"\n\nYesterday the Gun nearly dished us up in fine style he lobbed some 20 HES. just short of us & then some to others just beyond us\n\non the whole a most disturbing business especially as we were hugging a sweet delusion that a certain big hill prevented him from getting anywhere near us. There is a very strong report that the Turks are going to attack tonight.\n\nAllenby was down here today & they have been bringing brigades up all the evening, one is passing now in half sections, a very fine sight in the moonlight. Anyhow I am afraid the Turk\n\nis doomed to another costly disappointment\n\nMore anon\n","24":"\n\nThe Turk has not attacked up to date, neither have we been hit by his big gun. We have one or two big guns out here now, I believe, anyhow there is our enormous noise which goes on intermittently all night. There is seldom much shelling in the daytime. I think everyone in the Line sleeps these days the last two days have\n\nbeen awful about 116° so sustained too, it is over a 100° at 6.30 or 7 in the morning & doesnt touch it again until about 5.30 in the evening. I find the best way of enduring it is to be out riding about in it. At present there is a rumour about that we are going back on the","25":" towards Jaffa but nothing official as yet.\n","26":"\n\nI have just been able to have a smoke again now, I have been unable to touch tobacco for over a week to the great detriment of my temper.\n\nThere was a concert last night down at the main Supply Dump Jericho, given by the \"Bats\" They were extremely good indeed. One of the cleverest & funniest things being one fellow who came in dressed as rather a moth eaten Prima Donna & proceeded to sing \"Il Miserere\" in falsetto They had a wonderful stock of clothes & were all good dancers. They even\n\nproduced a minuet clothes powder & all. One fellow made a most charming lady & had some beautiful evening dresses. Altogether it was very good indeed they finished up with the Toreador scene from Carmen if you please! & did it well too.\n","27":"\n\nI went to the concert on the next night, which promised to be as good & was as good as the first night, when it was spoilt by a curious occurrence. There were I suppose some 300 in the audience, all sitting & lying down\n\non the ground in front of the stage with a thick ring of men standing at the back, suddenly there was a sound of galloping horses (two was I believe the number) & the people at the back ran forward on to the fellows sitting down & in two seconds there was the wildest stampede I have ever seen. They ran right on to the stage & smashed the properties & knocked down the property tent & from then on the concert was spoilt: for about half a hour afterwards men were looking & groping for hats, money,\n\nsmashed spectacles etc\n\nIt just shows how very nervy men get out here.\n\nJust before the concert I was unwell for a few days. For two days I ran a temperature 102-3° & & then went off my food for several days: I could not smoke for 10 days & got \nawfully\n painfully irritable.\n\non `the","28":" the Enemy attacked at last. Our first intimation was Jericho Jane starting to fire big HES all over the place the evening before. She kept it up with a few intervals all night \n\nto my sleepless sorrow for she was bursting about a mile away & at that distance with no hills in between it sounds very loud & near. 800 German Shock Troops attacked early in the morning & broke through the Second Bgde & grabbed all their comforts & rations, but the posts stayed out & we put a barrage behind the 800. The two divisions of Turks who were to support the Germans thought better of it & so when the Germans looked behind them for their supports they saw the 1st Bgde \n\ncharging from behind them.\n\nIn short we captured 400 & I think killed the rest at the cost of about 40 men in the actual scrap though we lost many more in the subsequent shelling. The Turks brought up two 59s & shelled the horses killing over 100 in one day.\n\nThe Australian Division is now taking over the","29":" Brigade which back the day before yesterday the NZs go back tonight & we-el Hamed lillah – go back straight through to Jerusalem tomorrow night.\n","30":"\n\nArrived at our old camp at Solomons Ponds after an exhausting & inexcuseably long trek of 16 hours. Beautiful climate here now. Perfect. I had a bath this morning. – not that a bath in itself is so unusual as to call for comment, far from it – but all of a sudden when bathing one of those fair damsels that infest the camp came round the end of the tent & found me clothed in soapsuds & chastity. She gave me an appraising glance, smiled, said\n\n\"good morning\" & drifted away.\n\nThey are queer creatures they have no modesty – or should I say false modesty? at all. At all events they will discuss anything under the sun with you.\n","31":"\n\nI have not yet got quite rid of my August superstition yet. However unless anything out of the way turns up, we should spend a quiet August this year as we are at Bethlehem. I put in for leave a little while \n\nback which I hope will come off in a month or so.\n\nWe are spending a delightfully quiet time here there is practically no work to do, in the afternoon I often go out for a ride to the top of a hill here from whence one can see about 40 miles in three directions.\n\nWe live now mostly on Eggs, which by the way have travelled all the way from Egypt & you would be amused\n\nnothing specifically wrong but I have lumbago slightly & every day my temperature goes up to about 99.5 & I get the tired feeling badly. I suppose it is just 4 years of this existence.\n","32":"\n\nBethlehem.\n\nQuite a gay week this week. \n\nA concert early in the week\n\nvery good\n Two very good lectures one on the Eastern question 1870 – 1914 & the other on International Politics &\n\ndiplomacy 1870 – 1914 by a member of the American Corps diplomatique.\n\nLast night a concert got up by the NZFH and such a thing you could not imagine anything like it in your wildest nightmare. It was fact in the vernacular- ‘as rough as guts.’\n\nIt was beautifully got up, the dresses were good, the stage decorations were excellent, the only thing lacking was, unfortunately, talent.\n\nThe ‘lady’ of the Company was\n\nbeautiffl\n beautifully dressed in a red & black evening dress & looked just the thing, & about the middle of the programme she proceeded to give us a dance. She had no idea of dancing but the delight & enthusiasm of the audience – all males of course – knew no bounds when, on the lady executing a none too graceful pirouette, they discovered that her lingerie was non existant, that there was in fact a large hiatus between the\n\ntail of her shirt and a pair of beautiful black silk stockings! She was encored vociferously. But it was an unrehearsed & entirely unintended effect she was bashfully unresponsive to the delighted requests of the audience.\n\nJust received a letter from Miss S. requesting my permission to send my letters to the papers if you please. Where at I was forced to send a humiliating list of incidents which I had seen in\n\nother papers & which I had probably passed off on her as my own. However the majority are original. \n\nOpinion very divided now as to whether we return to that damnable Jordan valley or not when we move next. I hope to Heaven that we don’t. \n\nMoving about the","33":" I think . Every sign of another big advance coming off soon to Damascus or thereabouts:\n","34":"\n\nYesterday the NZ. Bgde held their sports, or rather show. It was a very good spectacle everything beautifully turned out. \n\nThe only amusing incident that occurred was during the Officers Chargers competition & when all the officers were riding round the ring it was just into the hands of the spectators. Cries of \"Ride that horse,\" \"get off his neck,\" \"Keep your distance there\" & so on & so forth, but it reached\n\nits climax when all the officers & horses were lined up to be judged. An officer leaned forward & patted his horse, where upon a drawling voice came from the crowd in tones of great disgust \"Don’t pat ’im , get off & kick him in the guts\"\n","35":"\n\nTomorrow we leave this little Valley of Avilion, which has been all the more delightful the last few days as there has been\n\nno one here but ourselves.\n\nWe go to Jericho in three instalments, starting tomorrow at 4 ac emma we journey even unto Bethany which is distant three Kilos from Jerusalem along the via Doloroso – Tensan – Jerichosa. Tarrying there until the sun is low again we gird up our loins & journey forth to Talat Ed Durum in the direction of the Moabites, & having eaten & drunken & (possibly) anointed ourselves on evening late of the third day\n\nwe come even to that haven where we would not be, the erstwhile City of the Palms.\n","36":"\n\nAnd we have now done it.\n\n It was enough to make angels weep tears of Blood. We spent 36 mortal hours at Talat Ed Durum from whence we looked forth on the world through an all pervading cloud of fine dust.\n\nWe left that delectable spot at 3 pm or rather I should say 1500 and arrived at our destination \n\nhere under the Mount of Temptation beside the Brook Kerith about dusk. I now hear them say that it is three mins to eleven. We have pitched the tent, set our gear, fed Henry, had a final cup of tea & now the other two are in bed while I am writing this nonsense by the light of the full moon sitting at the table, homemade, folding, 1, in my pyjamas, in the much maligned Valley of the Jordan.\n\nJericho Jane has been firing \n\nagain the last few days, curious how she always starts when we get down here. I expected her to have a go at us as we came along the road but fortunately there was nothing doing.\n\nThere is a big stunt or something toward the end of this month (August again!) for big secret dumps are being formed right out almost in the front line. At present 2000 camels go out nightly loaded up to form it\n\nAnd so, with a sense of something accomplished, even though it be merely a dusty trek, to bed.\n","37":"\n\nSing Ho for the Fleshpots of Egypt. I am, Imshallah, stunts etc permitting, going on short leave to Egypt in a few days, where I intend to \"live up big\" at the National for seven carefree days.\n\nThis Jordan Valley apparently good for the growth of stripes. When we were here before I had my \n\nrank of corporal confirmed from the","38":" & now on the","39":" they make me a Lance Sgt which is another stripe backshish, no earthly good to us here except it looks well on ones coat.\n\nI attended a convivial evening in the A.I.F. canteen the other night given by the canteen Sgt. who is a bit of a celebrity in his way, claiming as he does, to be the only man in the AIF. who has achieved the distinction \n\nof having been \"fourteen times a Lance-Jack\"\n\nWhen the evening had progressed a bit & everyone was – let us say – exceedingly easily amused, our host proceeded to tell us a rambling tale in a most amusing manner.\n\nHe was at Details at the time. He had, he declared, been stony broke on this particular evening & hence had spent the evening in camp. Here he digressed & gave us a masterly treatise \n\non the delicate art known as \"humming beer\" so that we thoroughly credited his statement that he was not a little drunk when the evening roll was called. His name was called & he answered his number quite correctly & then shortly afterwards he heard the orderly Sgt call the name of one of his friends whom he had seen leave the camp previously. He knew his friend’s number, it was 1015, but he could not get his unruly tongue round it\n","40":" he shouted out \"a quarter past ten\" Again the name was called, again he vociferated \"a quarter past ten\" The orderly Sgt approached & asked him what he meant by answering in such a fashion. Whereupon our friend after speaking of the Sgt’s birth & upbringing in terms of contumely he declared that the Sgt was several kinds of a fool-all enumerated at length – if he did not know that a quarter past ten was ten fifteen. \"But\" \n\nchuckled our host \" the funny part of it was that the real ten fifteen was up on the mat in the morning & got seven days field punishment No2 & pay stopped for what I had told the Sergeant\"\n\nIt is still fiendishly hot down here but it has improved upon last time I think\n","41":"\n\nHere Endeth the fourth August of the war or rather I should say the fifth. What am I talking about, ana magnoon. Of course August has 31 days \n","42":" there is yet a day to go.\n\nJericho Jane is up to her tricks again, She sent over about ten shells this evening, one of which pitched right in amongst the nightly camel convoy which was going out. It was a beautiful shot but it was shrapnel & burst into the ground, so did no damage at all beyond giving the native a big fright; at least, as far as we could see. \n\nI have not gone on leave yet but I hope to go with the next lot which\n\nwill go, all things permitting, about the","43":" I expect\n","44":"\n\n\"There was no motion in the dumb, dead, air\n\nNo Song of Bird, nor sound of rill;\n\nGross darkness of the inner Sepulchre, \n\nIs not not so deadly still \n\nAs this wide valley\"\n\nWhich is adapted of course but which at the same time most completely fills the case.\n\nWhat I wrote a few days ago about the heat having improved immensely, I wrote on the strength \n\nof apparently one phenomenally cool day. There is no doubt that the temperature is not so high now, but to my mind it is just as bad for now from 8am until 6 pm there is not a breath of air stirring, which tends to make life a very burdensome affair indeed. \n\nIn the vernacular \"I have come a gutzer\" for this leave & shall now not go in all probability until the middle of the month.\n\nHowever I dont mind as the man\n\nwho is getting it before me is only getting his due & Cairo will be many days the cooler, also I shall be here for the next pay, (I have stipulated for £ 18) & shall not have to borrow at all, I hope, as I can get another tenner when I get to Cairo & that should see me through all right. The only thing of which I am afraid is that this stunt will be coming off soon & may stop the leave altogether.\n","45":"\n\nI passed two graves today beside the track to water, which I had not noticed before.\n\nOn one of them I read R.H. Welham – Coy RE. and underneath the date & the inscription \"Killed by aircraft.\" The strangeness of those familiar words suddenly struck me. I paused to think. Formerly I had seen plenty of graves with all sorts of inscriptions \"Killed in Action\" \"Died on Service\" \"Died of Wounds\" \"accidentally Killed\" & so on & so forth \n\nBut suddenly the place & the words \"Killed by aircraft\" seemed strange, like an echo of H.G. Wells \n\n\"On a sudden in the midst of men and day \n\nAnd while I walked and talked as heretofore \n\nI seemed to move among a world of ghosts \n\nAnd feel myself the shadow of a dream\" \n\nI asked myself whether I should have believed just six years ago one who told me that a few years hence I should be standing at the roadside by Jericho by the lonely grave of one who was \"Killed by Aircraft\" ! \n\nThe world is so mad & the pace so fast nowadays that when one pauses in the hectic advance & thinks of all the unbelieveable & indelible events that have taken place in the so short time one is assailed by a feeling of unreality. And when all is over & one has time & leisure to plan & look about one, the events of the years of war will assume the blurred proportions of a feverish dream. Only the results will (it is to be hoped at any rate) \n\nstand out clear amidst a confused jumble of impressions.\n\nWhich explains to a certain extent why the only possible mode of life is to live for the moment. He who attempted to get a reasonable perspective of the whole thing & took this existence seriously, not as an uncomfortable & puzzling, but fortunately transient, phase would have gone home to Australia as a mental case some time ago. Which also reminds me at this particular moment I want a shave.\n\n"}}