{"Document Name":{"0":"Diary_0031","1":"Diary_0031","2":"Diary_0031","3":"Diary_0031","4":"Diary_0031","5":"Diary_0031","6":"Diary_0031","7":"Diary_0031","8":"Diary_0031","9":"Diary_0031","10":"Diary_0031","11":"Diary_0031","12":"Diary_0031","13":"Diary_0031","14":"Diary_0031","15":"Diary_0031","16":"Diary_0031","17":"Diary_0031","18":"Diary_0031","19":"Diary_0031","20":"Diary_0031","21":"Diary_0031","22":"Diary_0031","23":"Diary_0031","24":"Diary_0031","25":"Diary_0031","26":"Diary_0031","27":"Diary_0031","28":"Diary_0031","29":"Diary_0031","30":"Diary_0031","31":"Diary_0031","32":"Diary_0031","33":"Diary_0031","34":"Diary_0031","35":"Diary_0031","36":"Diary_0031","37":"Diary_0031","38":"Diary_0031","39":"Diary_0031","40":"Diary_0031","41":"Diary_0031","42":"Diary_0031","43":"Diary_0031","44":"Diary_0031","45":"Diary_0031","46":"Diary_0031","47":"Diary_0031","48":"Diary_0031","49":"Diary_0031","50":"Diary_0031","51":"Diary_0031","52":"Diary_0031","53":"Diary_0031","54":"Diary_0031","55":"Diary_0031","56":"Diary_0031","57":"Diary_0031","58":"Diary_0031","59":"Diary_0031","60":"Diary_0031","61":"Diary_0031","62":"Diary_0031","63":"Diary_0031","64":"Diary_0031","65":"Diary_0031","66":"Diary_0031","67":"Diary_0031","68":"Diary_0031","69":"Diary_0031","70":"Diary_0031","71":"Diary_0031","72":"Diary_0031","73":"Diary_0031","74":"Diary_0031","75":"Diary_0031","76":"Diary_0031","77":"Diary_0031","78":"Diary_0031","79":"Diary_0031","80":"Diary_0031","81":"Diary_0031","82":"Diary_0031","83":"Diary_0031","84":"Diary_0031","85":"Diary_0031","86":"Diary_0031","87":"Diary_0031","88":"Diary_0031","89":"Diary_0031","90":"Diary_0031","91":"Diary_0031","92":"Diary_0031","93":"Diary_0031","94":"Diary_0031","95":"Diary_0031","96":"Diary_0031","97":"Diary_0031","98":"Diary_0031","99":"Diary_0031","100":"Diary_0031","101":"Diary_0031","102":"Diary_0031","103":"Diary_0031","104":"Diary_0031","105":"Diary_0031","106":"Diary_0031","107":"Diary_0031","108":"Diary_0031","109":"Diary_0031","110":"Diary_0031","111":"Diary_0031","112":"Diary_0031","113":"Diary_0031","114":"Diary_0031","115":"Diary_0031","116":"Diary_0031","117":"Diary_0031","118":"Diary_0031","119":"Diary_0031","120":"Diary_0031","121":"Diary_0031","122":"Diary_0031","123":"Diary_0031","124":"Diary_0031","125":"Diary_0031","126":"Diary_0031","127":"Diary_0031","128":"Diary_0031","129":"Diary_0031","130":"Diary_0031","131":"Diary_0031","132":"Diary_0031","133":"Diary_0031","134":"Diary_0031","135":"Diary_0031","136":"Diary_0031","137":"Diary_0031","138":"Diary_0031","139":"Diary_0031","140":"Diary_0031","141":"Diary_0031","142":"Diary_0031","143":"Diary_0031","144":"Diary_0031","145":"Diary_0031","146":"Diary_0031","147":"Diary_0031"},"Date":{"0":"unknown","1":1219.0,"2":1220.0,"3":1221.0,"4":1222.0,"5":1223.0,"6":1224.0,"7":1225.0,"8":1226.0,"9":1227.0,"10":1228.0,"11":1229.0,"12":1230.0,"13":1231.0,"14":1232.0,"15":1233.0,"16":1234.0,"17":1235.0,"18":1236.0,"19":1237.0,"20":1238.0,"21":1240.0,"22":1241.0,"23":1242.0,"24":1243.0,"25":1250.0,"26":1251.0,"27":1252.0,"28":1253.0,"29":1254.0,"30":1255.0,"31":1262.0,"32":1263.0,"33":1264.0,"34":1268.0,"35":1271.0,"36":1272.0,"37":1273.0,"38":1274.0,"39":1275.0,"40":1276.0,"41":1277.0,"42":1278.0,"43":1279.0,"44":1280.0,"45":1281.0,"46":1282.0,"47":1290.0,"48":1300.0,"49":1302.0,"50":1303.0,"51":1304.0,"52":1308.0,"53":1312.0,"54":1313.0,"55":1333.0,"56":1334.0,"57":1359.0,"58":1360.0,"59":1362.0,"60":1363.0,"61":1364.0,"62":1365.0,"63":1372.0,"64":1381.0,"65":1386.0,"66":1390.0,"67":1393.0,"68":1395.0,"69":1396.0,"70":1397.0,"71":1403.0,"72":1404.0,"73":1405.0,"74":1426.0,"75":1427.0,"76":1434.0,"77":1435.0,"78":1436.0,"79":1457.0,"80":1466.0,"81":1467.0,"82":1468.0,"83":1480.0,"84":1481.0,"85":1482.0,"86":1487.0,"87":1488.0,"88":1489.0,"89":1496.0,"90":1504.0,"91":1505.0,"92":1506.0,"93":1507.0,"94":1508.0,"95":1517.0,"96":1518.0,"97":1519.0,"98":1520.0,"99":1521.0,"100":1522.0,"101":1528.0,"102":1560.0,"103":1561.0,"104":1563.0,"105":1564.0,"106":1565.0,"107":1570.0,"108":1571.0,"109":1572.0,"110":1573.0,"111":1574.0,"112":1575.0,"113":1576.0,"114":1577.0,"115":1578.0,"116":1579.0,"117":1580.0,"118":1581.0,"119":1582.0,"120":1589.0,"121":1590.0,"122":1595.0,"123":1596.0,"124":1601.0,"125":1602.0,"126":1603.0,"127":1604.0,"128":1605.0,"129":1606.0,"130":1607.0,"131":1608.0,"132":1609.0,"133":1610.0,"134":1612.0,"135":1613.0,"136":1614.0,"137":1615.0,"138":1616.0,"139":1617.0,"140":1618.0,"141":1619.0,"142":1620.0,"143":1621.0,"144":1622.0,"145":1623.0,"146":1624.0,"147":1625.0},"Entry":{"0":"\n\n1917 ","1":" The rain drizzled down miserably, as Fritz shelled the sunken road consistently, causing everyone to feel more uncomfortable than usual. I stood shivering with cold near the bank, eagerly waiting for the order to \"hop over\" and my section (Lewis Gunners) stood nearby, similarly anxious to commence the mornings work; which at least would lend a little warmth to one’s body. My clothes were saturated with mud and wet, causing the cold morning air to pierce into one’s very bones.\n\nThe 1st. 2nd. and 3rd. waves assisted by Tanks of the latest pattern had already gone forward to attack the Bosche. The incessant noise of the motors had apparently aroused the advanced Hun machine gun positions, and their Maxims were already pouring forth a heavy barrage – under cover of Artillery fire. Fortunately the latter was not extensive, consequently the effect caused few casualties, although the first salvos on the sunken road (where the men assembled in mass formation), inflicted many casualties.\n\nThe darkness was intense, and to maintain a straight line and keep touch with the various sections, involved most difficult work. We however pushed forward quickly and silently. The first 200 yards traversed towards the Hun lines, were dangerously broken by innumerable shell holes and craters, which impeded our progress considerably, and made the alignment irregular. I could see the Tanks busily breaking the first line of wire, constructed formidably in front of the Hun first line of trenches. The Tanks guns played havoc amongst the opposing M. G. detachments; they of course, offered the enemy a prominent and conspicuous target for his heavy guns, subsequently the shells fairly rained amongst us. One Tank received a direct\n\nhit rendering it partially out of action; undaunted, the gallant crew promptly rallied and turned their undamaged guns upon the enemy – this action assisted greatly, in the capture of the first objective.\n\nThe 4th. wave was not 400 yards out. The Hun Maxims and bombers and riflemen poured a veritable hail of lead into us from their second line. Simultaneously numerous maxim outposts effectively covered the Hun retirement from the first line of trenches. Our lands, wounded and killed – fell incessantly. My pal by my side, received several bullets through his right arm, and staggered painfully against my shoulder; I promptly relieved him of his equipment and endeavored to persuade him to retire; hoping he might reach the original line. He eagerly persisted to move forward again; (as he was so keenly bent upon knocking a few Huns before retiring) ultimately loss of blood rendered him too weak for the effort. Unfortunately I do not know how he fared after leaving me. The first line of wire was approximately, 500 yards from the sunken road. As I approached, myriads of bullets whizzed past and cracked in my equipment and under my feet. We were enfiladed from both flanks.\n\nThe Corporal of the Lewis gun team and myself with two men, were at this stage, the only representatives of 10 men; the other six had fallen. With vindictive determination We struggled into the wire, which was about 30 feet deep, and only partially broken; a veritable death trap. Luckily, we four, managed to scramble through safely; although considerably scratched and bruised. A few seconds later we entered the 1st trench so recently occupied by Huns, but now in the hands of the 1st. and 2nd waves. Immediately I entered the trench I jumped over the parados eager to begin the second phase of the battle. My companions soon joined me; we four managed to keep in touch; none of us had the remotest idea of the whereabouts of our Platoon or company. The morning was still intensely dark but fortunately we knew the direction in which the second objective lay; providing one escaped shell and bullet, the Company \n\nwould be found ultimately.\n\nHell was certainly opened by now. The maxims cracked in hundreds (they seemed thousands to me); simultaneously, trench mortars and additional batteries opened fire from all points of the field. Ping, ping, whiz bang,\n\nK-r-upp of High explosives accompanied by explosions everywhere; we continued to advance without giving those things a thought.\n\nMy one and only desire, was to reach the second trench, - my objective. It is very difficult to estimate the distance covered in an advance of this kind, but roughly speaking, I was then 800 yards from the original line. The second wire proved a very formidable obstacle. The opposition reached a most critical and devastating stage here and the air was thick with a hail of lead and shells. No. 1. Gunner Best; fell dead at my feet, pierced with dozens of M.G. bullets. The invaluable Lewis gun fell into the wire entanglements and I immediately rescued it and plunged further into the barbed wire, my clothes were torn and my skin scratched from head to foot. The party now numbered three, Within a few minutes the third man fell. The Corporal and myself pushed forward, I carried the gun and a pannier of ammunition, which was a very heavy load in addition to my equipment. The Corporal scouted round the immediate vicinity and managed to find two additional panniers.\n\nI could see the trenches quite plainly by now; whence Huns, in hundreds were hurling bombs and firing guns and rifles and trench mortars and etc, from various quarters. On my extreme right I could distinguish men of A Coy – 16th Batt, engaged in a hellish struggle with the Huns, and facing terrific odds; in fact wherever one looked the same sort of fighting presented itself. I had little time to consider and much less to study others, whilst in such a dangerous and critical position. Moreover, I was keen upon reaching the second trench, to make use of my Lewis gun in clearing saps leading up in a horse shoe construction, to the chief objective. My left arm suddenly fell limp and useless to my side; simultaneously the gun shot forward into the thick mud a few yards in front of me; my right arm was still\n\nuseful and uninjured, so I immediately leaped forward and seized the Lewis. This action occupied a very few seconds. Within a few moments I could feel the blood trickling down my back and arm - the bullet having entered under the shoulder blade; the injury did not deter me and of course was not sufficient to stop me; in fact it increased my determination.\n\nI could see my opponent (Fritz) quite plainly, only 80 yards distant, where he operated a maxim with deadly accuracy upon the Corporal, several strange men and myself. Fortunately there were very few men within the Hun’s sector; his shooting unfortunately proved effective. My legs suddenly collapsed under me; to my utmost dismay I found myself sitting up in a huge crater only 10 yards from the trench. My left knee was shattered, in addition to the wound in my back. Overcome I fell backwards exhausted and bleeding profusely; and try as I might I could not rise. I promptly roused myself and upon looking round I dsicovered another man of the same Battalion as myself; coincidently he too, was a Lewis gunner, and had received several bullets in the legs, rendering him incapable to further action. Shortly afterwards the Corporal came rushing down in search of the gun and he remained with us a few moments, whilst I growled out my troubles; he departed forthwith. How he fared I do not know.\n\n7 A.M. 11th. The terrific roar of artillery and incessant rattle of Maxims, continued fiercely. Hundreds of stick-handle bombs (German grenades) fell round us, whilst myriads passed over head, but whether the Huns intended them for us or not I do not know. Their heavy trench mortar shells pounded the ground nearby, apparently in search of our lads who had established themselves in a sap further to the left, and others who were in occupation of the trenches. The dead and wounded lay thickly all around; each man carried his own ammunition. Those who managed to reach the objective were few, consequently the work and fighting were most difficult and hazardous in repelling the incessant Hun counter attacks.\n\nAnother man, suffering severe multiple wounds in his back, joined us in the hole a few minutes later, whilst many unfortunates\n\nfell dead within a few yards of the hole. Apart from this, I have no idea how the struggle progressed. Voices were plainly audible which I supposed to be Huns; accountable to the terrific shouting and squealing; Under the worse of extreme circumstances no Australian would act so weakly. Any moment I and my comrades expected a bomb or heavy mortar shell to fall amongst us, which would blow the excavation to atoms. The kind hand of Providence however spared us. As time elapsed the fighting gradually quietened; on the other hand my wounds caused extreme pain, and stiffness set in in every joint. Wilks (who originally through misadventure found this hole) bandaged my knee from a limited supply of dressing, (he left my back without a bandage). Many wounded lay around unable to move; this I discovered by hearing the awful groans of men in pain. The terrific storm of stick-bombs continued, until 4 p.m. and was succeeded by an awe- inspiring calm, accompanied by showers of rain, which soaked us to the very skin. Our real troubles then commenced.\n\nI was just conscious of my surroundings, never-the-less I concluded that our boys had succeeded in taking the line; a few minutes later our own artillery opened a terrific barrage. Our astonishment was horribly realistic, inasmuch, it was obvious that the Huns held the position, thus securing the unwounded men in occupation of the trenches. The shells fell thickly, dozens bursting on the very brink of our covering shell-hole or crater (what the place really was I had not time to discover); fragments fell amongst us and struck our equipment, fortunately without inflicting further wounds. The duration of the barrage was tolerably short; followed by calm. Temby, who was able to stand, managed to peer across the field to ascertain our actual position. Within a few minutes he conveyed to us the dreaded and least expected news; we were surrounded and completely cut off, a thousand yards from our original line. Whilst observing, Temby caught a glimpse of unwounded Australians marching into the interior of the Hun lines; they were unarmed and securely guarded by sentries. Many of the brave lade were shot whilst attempting to free themselves, but\n\nultimately all possible means of escape was cut off.\n\n5 p.m. I have already spent 12 hours in this wretched place, bleeding profusely and unable to move an inch. Subsequently death or captivity will befall me. Either convey unpleasant feelings. Whilst contemplating, the snow commenced to fall in thick flakes and soon we were nearly buried in mud and water; the damp earth however, caused the snow to thaw immediately it fell. Later, it fell so thickly and incessantly, that we were almost snowed in. During this awful dilemma several Hun officers passed by; they spat at us and jabbered something unintelligible to me. A few minutes later, a bullying \"square head\" walked down to us (what bombs etc. we carried had been discarded) and selected a bomb. He walked a few yards away, and motioned as though he intended throwing it upon us and no doubt he would have done so, but thought it unwise whilst his officers were about. Instead of despatching us as expected, he merely threw the bomb down without releasing the pin. I began to feel light-headed again through loss of blood, and would have welcomed death as a relief to my agony. During the last hour, another man had crawled into the hole making the number four in this miserable place; he was badly wounded in his back, and undoubtedly suffered intense pain. Despite these troubles he insisted upon making me as comfortable as possible, giving me some water and a cigarette. Oh! how soothing is a smoke to a wounded man. The incessant show storm drenched us and smoking became an utter impossibility. At sunset a Hun rushed out to us, Hunnishly affecting sorrow and sympathy; with the assistance of a few French words, I managed to make him understand, that not one of us could either walk or stand, and therefore we needed a stretcher to carry us into a shelter. We gave the brute considerable quantities of food (we carried 3 days rations each) and tobacco. Upon receipt he promised to send assistance within a few minutes. This inhuman brute, grinned and laughed with joy, whilst the food was being placed in his hands, and then pretended to extend sympathy. Anyhow within a very few minutes he ran off, but needless to say he failed to return. In the meantime the snow continued to fall thickly and darkness set in. Oh! how \n\nmy feet swelled and ached, my teeth chattered, and every bone in my body ached. I was soaked through, and laying in a pool of blood and water and covered with snow.\n\nFrostbite had already effected my hands and feet. My God! the misery and agonies of that night are indescribable. Wilks tried in vain to crawl back to our lines, and I became frantic with pain. Kay and myself together shouted and yelled until our throats were hoarse. Despite those appeals for help, the Huns ignored us. I tried repeatedly to crawl, but failed to move more than a few inches.\n\nDaylight dawned, and so ended this horrible night. We bucked up a little courage, and hoped to be released by a British counter attack. However, the agony was only prolonged by an exceptional calm.\n","2":" 7 A.M. Two Hun stretcher bearers came out to us, and assisted Kay out. He is the man who gave his last cigarette to me, and helped me in many ways, despite his own intense suffering. I had cigarettes but they were damp. Temby left us several hours earlier. Wilks crawled about 20 yards, and was picked up by two Huns and carried away in an oil sheet fastened to a pole. I could not bear this suffering any longer: the pain strengthened my determination and I plucked sufficient courage to crawl; this was after waiting several hours for the Huns to return. I managed to crawl within 2 yards of the top of the hole and then rolled back exhausted. However after a few minutes rest, I made another unsuccessful attempt but my third effort succeeded. My wounds commenced bleeding again, but the stiffness relaxed; by crawling on my right side, I was able to move a short distance. Upon reaching the surface I surveyed my surroundings, which offered no means of escape. Any attempt to return would mean certain death. The Hun trenches were only 10 yards distant and seemed to lure me on. I struggled through the mud and reached the parapet, which revealed a deep muddy trench without the customary duckboards; In it I saw no signs of life. Two dead Huns lay over the parapet. My next difficulty was to get into the trench, but it seemed an impossible task. I gazed about me looking for assistance of any kind; the only persons within\n\nsight were two Huns who were intently stripping ammunition and rations from off the dead bodies. They performed this despicable duty with apparent relish, chiefly when they found a pack containing food. These inhuman beasts continued the search for some time, and during the few minutes I was able to watch them, they made a systematic plunder and appropriated everything which was useful; and with special precaution secured the perishable food stuffs from the damp ground. Not infrequently did they laugh and jest as they kicked the bodies over, while searching for useful articles.\n\nSeveral British shells soared overhead, and these Huns quickly ran off in search of shelter, probably a deep and safe dugout. During this time my position remained precarious and unaltered. Realizing eminent danger I crawled to the very edge of the trench and allowed myself to fall to the bottom. The sudden bump and shock caused excruciating pain, nevertheless the action secured safety. I thought every limb had fallen off. From the shell hole to the trench, I think I had struggled for fully one and half hours. I lay in awful pain in the mud, unable to move again, and more or less unconscious for a considerable time. Quite unexpectedly two Huns approached me, they halted, stood for a few moments looking daggers of hatred and scorn. I thought my end was swiftly coming. However, they merely made a display with their bayonets, meditating whether it would be advisable to finish me or not, then passed on. A few minutes later a Hun Red Cross man came on the scene, and unlike my previous visitors, offered to assist me to the interior of the Hun lines. Oh! what relief! he lifted and supported me whilst I stood on my right leg, and then I fully realized my excessive weakness. He then motioned me to get on his back, the order was most comforting and I immediately forced up my left arm, and gripped both hands round his neck. My legs being limp and useless; he proceeded to carry me towards the village of Reincourt, which was a few hundred yards behind the trenches. He struggled along for about 50 yards, then I collapsed in a heap behind him, but fortunately I managed to struggle on to \n\nmy right leg again. The circulation of my blood was much improved by the violence of this short journey, consequently the pain lessened en route. The awful ride continued for more than an hour; my rescuer finally carried me through the outskirts of the village to a huge tunnel or dug-out. The stairs leading to the bottom of the dug-out were at least 50 feet deep; further down were many spacious compartments – such as dressing station and officers quarters etc. Undoubtedly the tunnel extended for miles, and could comfortably accommodate thousands of men and unlimited quantities of materials. This elaborate dug-out is fitted with electric light, and securely boarded. My stay was brief on account no doubt, the Huns considering the place too elaborate for such people as myself. The Hun stood near me whilst making inquiries about my disposal, and refused my offer of money and badges. I admired the man immensely for his action; as undoubtedly I owe my life to him, and that is not a small debt even though the coming months may prove miserable and uncomfortable. Several Huns carried me from that safe haven, through the battered ruins of the village, to a badly damaged building containing six wounded Australians. \n\nA small fire was burning with a mess tin full of snow meting over it; this appears to be the only means of obtaining water. Meanwhile innumerable Huns, including an officer, amused themselves studying us, their revelry however, was abruptly terminated by a British shell exploding within a few yards of the dilapidated building. They then scattered like rats. When the flying debris had subsided, the Huns returned, but were quickly dispersed by British artillery which opened a barrage on the village. Our captors commenced dancing about in an awful state of nervousness and fright, jabbering and shouting distressingly. Despite our pains we prisoners enjoyed their source of distress. This extraordinary performance continued for quarter of an hour until the shelling ceased. A horse ambulance arrived soon afterwards, much to the joy of we unfortunate wounded prisoners. We were packed in one on the\n\ntop of another. My wounds were very painfully severe, but not nearly so bad as several of the party, who were suffering from dangerous and painfully fractured limbs which are excessively torturing. The conveyance was drawn by two horses. The first few yards of travel passed without causing discomfort. Then our machine gunners opened a barrage of indirect fire, causing great excitement among the Huns in charge. The horses were whipped into a gallop, regardless of the wounded inside, and in such manner, we travelled over the rough cobble stone roads for nearly an hour. The cries of men in agony were awful. I suffered too much pain to notice anyting in particular as we travelled, but I remember passing several batteries camouflaged similarly to our own. His defence work does not extend beyond the village and the country is very flat for miles to the rear of the front. This insufferable journey eventually terminated by our arrival at Hun billets, approximately 10 kilometres distant from Reincourt. Shortly afterwards I was carried into an old stable and placed with many wounded Australians who were lying on the stones, awaiting surgical attention. Scores of Hun troops crowded rounds us, subsequently we were subjected to much embarrassment incurred by Hun curiosity. My boots, razor and badges were forcibly taken from me; I felt too miserable to protest so unresistingly allowed these articles to be taken. The articles were eagerly and jealously examined and appeared to afford the Hun much pleasure and interest. Many offered me cigars and cigarettes, and later we all received hot soup which was a most acceptable stimulant.\n\nExcepting the above incident the average hun treated us decently; and with those not dangerously wounded they endeavoured to encourage conversation, that however proved futile. None of us could speak German. No doubt the Huns near the fighting Zone, realize the hardship and misery experienced, and on that account treated us fairly well whilst amongst them. (The home service man is a different type of Hun.)\n\nBy this time my feet had swollen horribly and were quite black with frostbite\n\nthe inevitable result of exposure. Several hours later I was taken into a small room in the adjacent building where the first dressing was applied. During the operation an orderly attempted to steal my wallet; much to my amazement the Doctor prevented him by shouting something unintelligible to me. I appreciated his humane action. The Doctor then proceeded with his work, placed a rough dry dressing over my knee, and a piece or board under my leg to prevent any movement of the knee. I was then carried to my former resting place in the stable to await removal to an ambulance station.\n\nSmall horse transports are used for conveying wounded, (those unable to walk) to the Railway.\n\n7 P.M. I was hoisted into a transport \nabout\n with a badly wounded Sergeant. Wood shavings and straw were thrown over us, as we lay on the hard boards. The driver whipped the horses, and we were soon travelling along a rough cobble stone road. I cursed the French for building cobble stone roads. The roads are very rough under ordinary conditions, especially to one badly wounded travelling under these trying conditions; we simply made the best of it. The progress varied from walking to a trot, and the rain commenced to fall, much to our misery. I suffered two hours of this rough travelling, and at the end of the journey, I was taken into a huge marquee tent, crowded with wounded awaiting a hospital train to convey them further inland.\n","3":" I suffered another sleepless night without food, the only stimulant received since my capture, is a cup of soup at the first Hun billet. I still possessed a few damp cigarettes, which fortunately were smokable. A smoke soothes the nerves, and greatly assists to combat pain. The tent was most unpleasantly congested with wounded prisoners and securely guarded by \"Uhlans\". Sentries are quite unnecessary but no doubt they are posted as a matter of form. A Hun orderly sat near us, but never attempted to relieve our sufferings, or assist in any way. Three small pieces of black bread per man were issued this morning. None of us could eat a morsal of the horrid stuff, it was extremely sour\n\nand otherwise tasteless and useless; we were starving, we could not possibly manage to eat the stuff. Later I regretted refusing the bread, and discovered that this was a very large ration for one day.\n","4":" Still awaiting removal to hospital, and suffering awful agony, especially with my frostbitten feet. Much bustling going on outside the tent, that is probably caused by Hun wounded moving in and out or entraining for Germany. During the day I experienced a very unpleasant accident. Whilst smoking a cigarette, it dropped inside my shirt, and rolled underneath me during an attempt to raise my body. I was unable to sit up and my comrades were also unable to assist me in any way. The lighted ash burned a hold through my shirt and ignited my tunic, at the same time blistering my skin. The orderly ignored my frequent cries for help. I plucked up courage and squashed the cigarette against my bare skin; the forced action extinguished the fire. It reads like something trifling, nevertheless it caused me a few minutes uneasiness. Moreover, it clearly shows what feelingless brutes one meets. My tunic is torn and my breeches are also in tatters; my clothes are a mass of congealed blood and mud and cause me intolerable misery these cold nights, without blankets or covering. The wind blows under the tent flaps, and pierces through my very body. I shall certainly stick it while an atom of strength remains – I shall never die in the hands of these brutes.\n\nTowards evening many men were removed to entrain for hospital. The most serious cases reminaing behind; unfortunately my lot fell with the latter party.\n","5":" I am almost frozen to death, and there is not a spark of activity left in me. This is an awful Hell. God! When will we receive attention? I am afraid a few days longer will end my miseries. During the past four days, I have existed without food; in fact, the only nourishment received, was a cup of soup on the 12th, another on the 13th and a bowl of coffee this morning. Despite my hunger and thirst, the coffee made me retch immediately \n\nI drank the filthy beverage. The Huns call it coffee, but it has not the slightest resemblance to English coffee, either in smell or taste. About 1-30 p.m. several Hun officers entered with stretcher bearers. I felt a sensation of relief immediately they entered. After much shouting and gesticulating, the bearers commenced removing the wounded to the train. Four big dark Prussians took possession of me near the train and lifted me into the carriage. Instead of gently, lowering me, they merely dropped the stretcher (with a thud) to the floor. My arms were folded across my chest. \nand\n One Hun noticed a wristlet watch fastened to my arm; he immediately seized my arm roughly, and tried to wrench the watch free, loath to lose the watch, I endeavoured to free my arm and protested by shouting. my attempt to resist him proved useless, as my strength was ebbing fast. He then struck me in the face and forced the watch from my wrist, leaving me helpless and bleeding, caused by the exertion. After much fuss and excitement, the other three Huns lifted me in the stretcher level with the bunk, and rolled me off without the slightest consideration. Despite the rough handling, I still retained consciousness – but suffered extreme pain. The departure of the train cheered, and encouraged me. The journey occupied six hours, and a severe jolting increased my pain and bleeding. The carriage I travelled in accommodated twenty men, all badly wounded-stretcher cases. We were detrained at Valenciennes, approximately forty kilometres behind Cambrai. The station was crowded with Hun officers and troops, here and there a French civilian appeared. The arrival of the hospital train created great excitement agmonst the Huns; the numerous Australian prisoners accounted for that. The station buildings are similar in size and construction to Amiens. Owing to my critical condition I was unable to make further observations. I felt inclined for food and rest only. After much jabbering and rushing to and fro, two orderlies (dressed in navy blue, wearing the red Cross amulets and the weird Hun cap with badges), carried me to a motor ambulance. I detest people staring at me, and I felt considerably relieved, when I was placed in the ambulance away from the cruel, hateful eyes of Huns. This rough conveyance, accommodated six\n\nstretcher cases with two trailers attached, carrying a similar number. The tyres were badly worn, and the horrid odious smoke from the engine, almost suffocated we unfortunate occupants. The ambulance was securely closed in; \nand\n all chance of observation was cut off. I travelled for half an hour bumping and jolting, until the car finally stopped in front of a large stone building, situated in a dilapidated quarter of the town. However, \nit\n rough it may be, I welcomed the chance of rest and protection from the cold winds. Many French women and children collected round us, and we were soon enveloped in a crowd of children and unhealthy depicted looking women, who cheered us and endeavoured to give us biscuits and cigarettes. The Huns quickly dispersed the crowd, and threatened them with bayonets and rifle butts and kicked children within reach. These unhappy people were unfortunately accustomed to Hun cruelty and merely walked to a safe distance to watch the proceedings. The Hun under-officers should commands, and grey uniforms were soon busy fetching old prisoners to carry the wounded indoors. \n\nThe Hun Soldier appears to be and I firmly believe he is, in mortal fear of his superior, consequently great excitement prevailed during the time those wretches were removing us indoors. My stretcher was carried into the Lazarett by two haggard, half starved Russians. After entering the hospital, my first shock was caused by the sight of many men wearing long filthy beards, haggard faces and in a frightful state of physical collapse. To add to their weird, dejected appearance, is the Hun hospital uniform; Ragged and torn and saturated with filth. The coats reached below the knees, and the footwear is a mass of dirty rags enveloped in large wooded clogs, many sizes too large. The clogs are similar to those worn over boots during the winter months in Northern France.\n\nSeveral men approached me, and greeted me in a feeble voiice \"Hullo chum, have yer come to join us in this earthly hell?\" I was amazed when the fellows addressed me in English. They looked akin to walking skeletons with long unkempt dishevelled \n\nhair and beads, and limbs like broom-sticks. Later, one man asked me if I had a cigarette. I produced the required goods from my small supply of mud-stained cigarettes and handed it to him. Immediately the poor fellow lit the \"smoke\" a crowd gathered round and each enjoyed a puff from the precious weed. Their faces brightened immediately, under the effect of the cigarettes. Poor unfortunates! They thought more of those few whiffs than life. My first visitor, an elderly man of Manchester, whispered in my ear \"Have yer any money chum? If you have give it me, l’ll mind it until mornin\". He then proceeded to acquaint me with the trickery and cunning of Russian soldiers. I could see honesty written in his eyes and realized immediately, he was a friend indeed. Without fear or restraint in entrusted my few belongings to his care, and he promptly disappeared. A little later on a Hun under-officer passed along the corridor where I was waiting for attention. This creature shouted and stormed, until several Russian prisoners carried me into a small room, containing several tubs of odious, filthy water. My torn stained clothes were removed, and before I could speak, much less ask for soap; I was thrown bodily into a tub of water. My bandages were not removed, consequently they were saturated. The bath merely meant ducking, and then back to the stretcher without being dried. The ordeal and my misery fully completed my frightful suffering. Several Russians carried me feet first upstairs at a terrific pace. When I reached the fourth flight of stone stairs, my bearers carried me into a large room and tossed me on a rough bed. Oh! what relief! Although the bed was hard it was almost heavenly to me who had suffered hell in addition to the rough journey. A few minutes later a Hun threw me a girl’s blouse infested with vermin and saturated in congealed blood. I looked at the thing, and despite my excessive weakness and pain, I could not suppress a laugh. The Hun stormed and took the disreputable filthy garment from me; \nand\n I suppose his shouts meant put it on, however, my astonishment was soon confirmed. He put it on for me and I was given to understand, that the blouse represented pyjamas.\n\nThe thing hardly reached my waist, and the wet bandages clung to it. Had I desired, I was unable to remove the garment. I am certain a man could not feel more miserable than I felt then. I submitted to the inevitable, and merely lay gazing at my surroundings. About twenty Australians, numerous Englishmen and an assortment of Russians, French and Belgians occupied the ward. Two Hun orderlies assumed control of this forlorn crowd of (approximately) 150 prisoners of various nationalities. The Doctor (a young man, Hun under-officer) visited us later. He speaks a few words of \"Pidgin\" English. This creature strutted round the ward, finally coming to the English section. Pain? Yes? No? and before one could answer he would run off to another bed. He is truly a most absurd despicable creature. Later the interpreter accompanied by a French linguist entered; they proceeded to obtain our Military particulars forthwith. I asked for food. The interpreter informed me that rations were issued at 10 a.m, daily, consequently, I would wait until morning before receiving any food, whatsoever. I was given a cup of coffee later. In consequence of my extreme hunger, pain and fatigue I suffered an awful night without sleep or rest. \n","6":" 7.30 A.M. Breakfast; merely a cup of coffee. At 9.30 a.m, the days rations arrived. The bread was placed on a table and a great struggle ensued amid shouts and yells from Russians crowding round the table; the distribution of bread is a most pitiable sight. After much difficulty, I managed to persuade the Hun orderly to give me my share of the rations. I received a piece of black bread two inches thick, and four inches square. Although the taste sickened me I soon demolished my ration. One is glad to eat anything when desperately hungry, the bread merely increased my appetite. Regrettably a further supply was not procurable under any conditions.\n\n11.30. A.M. The Doctor made his daily visit, and although I showed him my blood and mud-stained bandages, he ignored my entreaties for dressing. When the Doctor left the room, I managed to make the orderly understand that my feet were badly\n\nfrostbitten and causing me intense pain. After persistent exhortation on my part, he applied ether and paper bandages, which relieved me considerably.\n\nNoon brought my next excitement in the shape of dinner. A large bowl containing \"Saur Kraut\" and hot water. The odour of the stuff is repulsive, despite my extreme hunger, I could not eat more than one mouthful, which sickened me immediately. Several Russians staring wildly, with eager anticipation of the result, rushed to my bed as soon as I placed the bowl upon the floor. Then a scene of fisticuffs commenced. Five or six additional Russians joined in the fray. Eventually a half-starved disreputable looking Jew, succeeded in capturing the much coveted bowl of \"saur Kraut\". For a few moments I lay astounded, wondering why such awful struggles were made over a bowl of rubbish like that. I watched the Russian Jew, who ate ravenously as he walked away; with eager repetition he thrust his fingers into the bowl and crammed the cabbage into his mouth. His action caused me to realize the hell these fellows were accustomed to. Even a crumb is picked from the floor and eaten. Many men walk about the ward searching for anything eatable. Several men died during the night. The groans and shouts of men in delirium are awful.\n\nSgt. Mjr. Smith of my own Batt, was strapped to his bed where he lay struggling and screaming in delirium. He was badly wounded in the stomach and received no attention. Towards evening several Huns approached his bed and watched him for a few minutes, then tightened the straps. He died a few hours later. Pte. Moore also of my Batt. had a leg amputated and shared Smith’s fate. None of the English were able to assist these men, owing to their own severe wounds. The other nationalities treated the matter with indifference. No doubt, that sort of thing is common to them. Everybody’s wounds are discharging profusely, and the odious smells in the ward are almost unendurable.\n\nUp to date, the death rate has averaged four daily in \n\nthis ward alone. It is quite customary to wake and find a dead man near you. Invariably the cause is inattention, neglect and cruelty. I have seen horrible sights, and have experienced roughness and etc, in France and Gallipoli, but they cannot bear comparison with this. \nand\n I am told by men from camps nearby, that this Lazarett is homely, compared with the reprisal camps; where torture and cruelty and starvation and exposure are items of the daily routine. The awfulness of the life is undescribable. \n","7":" Suffering with chronic diarrhoea, caused by the unwholesome black bread and soups. I have explained my illness to the Doctor through the interpreter. Subsequently for my 24 hours rations I received four ounces of French white bread, and a plate of porridge for dinner and tea. I enjoyed the change immensely; I have never eaten anything with such relish. The only medicine obtainable appears to be asperin, which of course is useless in my case. Reminiscence of some of the scenes one sees here, recalls many humourous happenings, for instance. The French language is used as a medium, and everybody’s conversation is unavoidably overheard. When the interpreter is busy elsewhere, the Doctor will endeavour to speak English.\n\nAn amusing incident occurred this day. The Doctor endeavored to converse with an Australian. He asked in German \"Smatzen Nay!\" no response, then he tried French \"vous avez souffre\" (distorted naturally). Still the Australian failed to comprez. Consequently the Hun made an effort in English \"Pin,yes,no?\" This conveyed intelligence, and the Australian replied in the affirmative, much to the joy of the Hun, who, \"Ya,Ya’d\" vociferously. My knee is still bleeding profusely and the wound in my back is discharging freely. My bed is saturated, consequently my misery is increased. I worried the orderly persistently, and eventually persuaded him to apply an additional pad of paper which I think is the common substitute for wool. I have not seen cotton wool in the hospital up to date. The paper absorbs moisture rapidly, so my comfort is hardly improved. My leg is black, swollen and painful; my entreaties for a clean dressing however, are ignored. The bed is a very crude arrangement; a large palliasse filled with wood\n\nshavings and sawdust partly covered with a filthy sheet, and two, thin, torn blankets for warmth. These are enclosed in a linen case which conceals filth, that I think is the virtue of the case. No doubt the Huns consider the beds to be clean and fit for occupation. My bed is under a window facing the court yard and out-houses. By struggling on to my right elbow, I am able to get a clear view of things happening below. During the afternoon, I was lying quietly thinking of the time I would be enjoying in \"Blighty\", had I escaped the Huns, when my attention was suddenly attracted by the yelps, and barks of dogs in the yard. I peered through the window, and to my utmost surprise, I saw dogs being butchered and taken into the cook hours; in addition to these were several small pigs. Ough! The mere thought of eating dog flesh caused a sickly feeling to run through my body. I explained the cause of my astonishment to several older prisoners, they merely expressed surprise at my ignorance of the food shortage, and explained some of their experiences in Reprisal camps, where dog and horse flesh were considered rare luxuries. They said Hun posterns often shot dogs and cats for their own personal use; beef and mutton are unheard of. Two ounces per week is an exceptionally good issue of that meat, consequently, one can imagine how seldom beef and mutton are seen. This statement has been corroborated and is precisely authentic.\n","8":" 10 A.M. I was carried into the operating theatre for dressing (the first dressing since my capture). The room is quite a small compartment, containing three operating tables, and various stands for surgical instruments. Three Hun Doctors, two nurses, and four Russian orderlies in attendance, and crowds of wounded waiting outside. While the Doctors were operating on a man near me, I waited half an hour. I am accustomed to wounds and roughness, despite those experiences I almost fainted through the oppressive heat and foul air and chloroform. I was compelled to stick it; whilst I lay waiting, a Hun nurse amused herself by thrusting knives and instruments near my face and sprinkling cold water on my bare stomach. This inhuman wench with another in con-\n\njunction, attend the operating room only; I think it is fortunate for the patients \nthat\n they are not allowed in the wards. A very nervous person would succumb to their treatment alone. They certainly adhere to the motto \"Gott straffe\" England. Subsequently my bandages were roughly removed and a dry dressing applied. I was almost enveloped in paper ere I was finished. I was indeed relieved when I reached my bed again.\n\nLater, a Prussian acted as night orderly, for the whole ward. During the night I asked him for a receptacle. It was very difficult to make him understand, which I eventually succeeded in doing, by making signs and motions. He \"donner wetted\" and cursed; however, he gave me the required article after pulling my bed clothes off, and striking me across the stomach with a stick. When I asked him to remove it, he roared furiously and walked away. I was unable to sleep, so lit a cigarette to soothe my nerves and enduce sleep. Without speaking the Hun strutted to my bed, and struck me on the face with his open hand, forcing the lighted cigarette into my mouth. This incident awakened the whole ward; \nand\n any man who spoke was struck in a similar manner. He carried a stick which he used freely. Towards morning Pte. Ellis 14th Batt, severely wounded in the shoulder, struggled out of bed and walked to the orderlies table and asked for a light, (matches are unprocurable). The brutal Hun turned, stood up and deliberately pushed him over; Ellis regained his feet and the Hun struck him in the face with his hand, rendering him unconscious. Several Englishmen able to walk a little, scrambled out of bed and assisted Ellis to his bed; then made the Hun understand that he would be reported in the morning. \nand\n If he attempted to act so unnecessarily cruel again, they would deal with him personally. The men unfit to struggle otherwise, the Hun would have received punishment there and then.\n","9":" Very tired and miserable after the wretched night. My inside is not unlike a butter churn, I am craving for food.\n\n9.30. A.M. Bread issued. This is the only variation or excitement one sees nowadays. The Hun supervises the issuing, and commences \n\ncounting something like this \"Alles’ Loose Gosen, Eine, Swei, drei\" a Russian interrupts and a storm of language peals forth. Again the Hun commences, \"Eine Swei, Drei\" then a party of Russians weighing their bread, will create a disturbance. One fellow discovers that his neighbour has a fraction of an ounce extra; and the scene turns into an indescribable medley. However, the Hun succeeds \nis\n issuing the bread. The Russians use an improvised scale, made with three sticks and several pieces of string resembling a capital T. The weighting is quite fair and is the only means of giving satisfaction where Russians are concerned. The ward \ngets\n is more repulsive daily.\n","10":" 10. A. M. The interpreter informed me that I was required for X-ray. A few minutes later, several Englishmen (recovering from wounds and illness received in reprisal camps) carried me down stairs (head up this time) into the street. I was carried about one mile, to a Hun Lazarett near the railway station. The Lazarett is a gorgeous building. Judging the interior from meagre observation, I should say it is fitted with the most up-to-date wards and appliances essential to the comfort of wounded and sick, returned from the lines. Men unfit to travel into Germany are detained here, and treated until sufficiently well enough to travel and not infrequently the numbers exceed ambulance accomodation. This type of hospital is used exclusively for Huns. I passed down a long corridor before reaching the X-Ray room, which is beautifully fitted with \"Rontgen\"rays and numerous photographic appliances. I noticed innumerable French girls working in the hospital, including two in the X-Ray room. Two photos were taken of my knee. During this time not a single word was spoken to me. I was finally carried into the corridor where several Hun officers signalled the bearers to stop. They asked questions in German, which were meaningless to me. They showed great interest, and not until they were quite satisfied with our identity, did they allow the bearers to proceed. During the journey back to the Prisoner of War hospital, French women endeavoured to give me cigarettes and biscuits, but, unfortunately, the Postern promptly interrupted, and threatened\n\nthe women with his rifle. Awed and dejected the generous women retired. \nand\n When I looked round they waved to me, and I noticed one woman weeping. What an awful life they must live under Hun barbarism, and cruelty. These women undoubtedly realize the awful conditions in hospitals and camps, that accounts for their persistent kindness and assistance. I continued my journey, until within a few yards of the hospital, where several Huns stopped my bearers. Whilst they jabbered a girl rushed across the street from a doorway; flung her arms about my neck and placed several biscuits and a packet of cigarettes under the blanket covering me, and then kissed me, deliberately. I cannot explain the joyous feeling and desire to express my gratitude; the girl quickly ran off without waiting for thanks. If the Hun had seen her he would assuredly have struck the child. A few minutes later, I was behind the prison walls, feeling desperately hungry, and awfully weak. Oh! what would I give for home comforts?\n","11":" Although the diarrhoea had improved considerably, the suffering is hellish. If one could obtain a few books to occupy one’s mind the intense monotony and starvation, would not be nearly so harrassing. Unfortunately literature is unprocurable. Not even French or German papers or books are allowed in the wards. Life is eked out in pain mentally and physically day and night. I very seldom sleep more than two hours in twenty four, and then often awaken suddenly soaked with perspiration, remembering a dream of home. That is alone sufficient to unhinge one’s mind. I am however, determined to stick it.\n","12":" I am beginning to realize my precarious situation, the whole thing seems a nightmare at times. During my two years and a half experience, I have never imagined myself a prisoner. I can bear pain, but hunger almost drives me insane; but it is useless trouble to worry; \nand\n the only alternative is, hang on until the last. I have often wished myself dead, but thank God that desire is quickly expelled.\n","13":" Men able to walk, go through to Germany daily? Many Australians, able to get about a little, have already gone across the border. \nand\n A\n\nlarge party has been detailed to entrain to-day. Frenchmen captured in the early stages of the war, tell us that prison life in Germany is considerably better than prisoners hospitals accessible to retaliation sector in France. The food is more substantial, and the general treatment is less severe. This news is very encouraging. I have existed on soups and black bread up to date; my white bread was stopped this morning, so I must accustom myself to the black, that however, will not b e difficult now, as I am only too glad to get anything eatable. I think I have lost my palate. The ordinary diet is as follows: Breakfast 7-30, coffee. 9.30 six ounces of black bread. noon (dinner) bowl of \"saur kraut\" or swedes in hot water. 3 p.m, cup of coffee; tea 6 p.m, Bowl of hot water and two table spoonfuls of barley. The barley water, in color is uncommonly like dish-water, and smells odiously. The dinner soups, probably have a little dog or horse flesh mixed with them, possibly to give \nit\n a greasy appearance, incidentally it improves the taste. One seldom receives any of the meat. In the event of a stroke of good luck, it is merely a fraction of an ounce, with the nutriment stewed out of it. Dangerously bad cases occasionally receive a small piece of flesh as described above. Occasionally a Russian manages to steal a loaf of bread from the cook-house; in this case he invariably offers it for sale. I dare say he withholds additional quantities for himself. Money is absolutely valueless here; those in possession of a few francs, are glad to purchase food regardless of the price. I offered forty francs for a loaf of bread this morning and the offer was refused. Jam is purchaseable sometimes. It is sold in eight ounce jars at six marks. Soap is an exceptionally rare luxury, and is obtainable only through Russians. Half penny tablets, cost four marks. Where those fellows get it, is quite a mystery, as Huns are unable to procure soap for themselves. French cigarettes are procurable at 1 1\/2d each. Unfortunately, very few of us have money to purchase with. Most of the men were robbed before reaching Valenciennes. My few francs are decreasing rapidly, however, I am glad to spend, as I shall probably be robbed later.\n","14":" Usual ordeal. An under-officer visited us during the \n\nday and offered to exchange Hun money for French paper. His rates are 15½ marks = 20 francs. The mark and Franc are equivalent. Despite the loss, it is necessary to have Hun money to purchase cigarettes and jam, which are obtainable occasionally; through this creature only. This sort of thing is strictly forbidden, but the Hun cautiously smuggles the articles into the hospital. My \"Manchester\" pal had previously returned my wallet, it is now secured under my bed. The Hun asked me if I had any French money and I immediately produced the wallet; he grabbed it, and before I realized what had happened, he was counting out German money for my French money. I consider myself fortunate, although I have suffered considerable loss on the exchange; he may have taken it without returning Hun money, if I had protested. It is either submission or disaster here, I prefer the former.\n\nThe most awful thing one could possibly witness, is the Russian soldier collecting cigarettes ends from the floor. The unfortunate Russian makes a practise of standing near one’s bed when one is smoking, immediately one throws the meagre end away, he eagerly catches it; they ask for the end. I give liberally, but it is quite impossible to supply everybody with cigarettes. My own comrades need assistance and I find it impossible to accomodate all nationalities. The Englishmen scrape tobacco fragments from the floor and also smoke leaves and rubbish, but I am glad to say there are few who allow the habit to grip them so firmly. When I am unable to get tobacco or cigarettes, I merely do without, and under ordinary conditions I smoke heavily. Smoke is the most soothing comfort one can have under these conditions, however, I think one should remain human and decent, even under this ordeal.\n","15":" My knee is considerably less painful and the wound in my back is quite comfortable; freedom from pain is conducive to better health and assists one to combat the starvation. My weight appears to decrease however, but I am in good condition when compared with others. There is a scotchman in the ward, and although suffering much pain and hunger, he still possesses a little humor. This morning he said \"Well lads ye’ll have the usual order of excitements \n\ntoday numbering three i.e. bread issue, doctors visit and dinner. The incident caused we unfortunates much amusement, although the average uninterested person will fail to see the humour. The monotony is cruel. \nand\n The incessant craving for food is almost insufferable. During the afternoon several British aeroplanes raided the town; they dropped many bombs near the Railway station. Huns were running in all directions, shouting and yelling as tho panic stricken. Anti air craft guns opened up and the machines returned. This is a very daring exploit, and we all felt cheered. Raids in broad daylight are not customary, however, those men bombed the railway station with impunity. A Frenchman who watched the raid, told me that our machines returned safely. I am unable to ascertain the damage, but the bombs were of an extremely heavy pattern. I felt the subsidiary effects in hospital.\n","16":" 10. A.M. (Second dressing since 12th inst.) I was taken into the dressing room; my X-ray photo’s were produced, and examined by the Doctor. During the time I waited for attention, the Interpreter informed me that the tibial head was badly splintered. (His words \"the bone in your leg is split\".) Immediately afterwards the Doctor commenced an operation. They extracted shattered bone from a Russian’s hand, he was only three feet from my side. \nand\n The anaesthetic coupled with the unpleasant scene caused me to get the \"wind up\" as I expected something similar on my leg. When the operation was finished the Huns directed their attention to me. I was under this treatment for 30 minutes. The chief doctor extracted between twenty and thirty small fragments of bone, including several pieces an inch in length. The operation was performed without anaesthetic or cocaine. I suffered extreme pain, and bled profusely; how I retained consciousness is quite marvellous. My nerves were in a frightful state after the operation. The only consolation one has, is the knowledge of others who have suffered infinitely worse. \ntherefore\n It is however, one less ordeal on the future list. Anaesthetic is only used for exceptional cases. Hours after returning to my bed, my nerves twitched and irritated me, however, I \nreceived\n regained my equanimity.\n","17":" German field post-cards were issued this morning. Each man is allowed to write one weekly. I asked the interpreter if the cards would go through. He replied in the affirmative, adding \"why do you thing they are issued, if the cards are to be confiscated\"? This is a case where silence is golden. I merely remained silent. (Months later I discovered that these cards were only a hoax, and all such cards or letters were destroyed in France). Therefore the period confined to the prisoners hospital Valenciennes, was unknown to those at home, incidentally, an additional two months without food parcels.\n","18":" Rumours favour our transfer to Germany at an early date. I have a very poor chance of numbering in the party, on account of my wounds. Severely wounded are not allowed to travel, chiefly on account of the lack of accommodation in hospital trains. The usual ordeal.\n","19":" Many sick and wounded Englishmen admitted to hospital. Amongst the latest batch, are two young fellows of the Lincolnshire Regiment, who were deliberately shot at and wounded by Hun posterns \"en route\" to work from a Reprisal camp. Although this sort of thing appears incredible to the average person, especially to those living in luxury at home, it is absolutely authentic and quite common. For instance, numerous prisoners arrive here daily suffering with broken limbs and scars about the head, caused by Hun rifle butts and sticks. One of the lads above-mentioned, was shot through the wrist, simultaneously the same bullet struck another unfortunate nearly, piercing his heart, killing him instantaneously. This barbarism and despicable mal-treatment was the outcome of the two men stepping only severl feet from the ranks (whilst marching to work) to receive a little bread offered by a French woman, running along\nside\n the roadside. The Tommies were desperate with ravenous hunger and glad to accept anything eatable. Without warning or remark the Hun levelled his rifle at them and fired. If a postern notices a man stoop to pick up a cigarette end, or anything likely to be of use, he immediately fires; or clubs the culprit, with his rifle butt. Many men have been shot and clubbed for less. The men march ten or twelve kilo’s to and from their billets to work. Invariably the work is of the roughest and most strenuous kind, under British \n\nshell fire. Any man attempting to walk from his work without permission is instantly shot; \nand\n not infrequently have men been murdered under his heading. If the men stop working and the postern is near, he promptly strikes the unfortunate men with his rifle butt. The awful human wrecks who pass through this hospital, are sufficient evidence to prove the truth of this statement. Men arrive here dressed in rags and tatters; thin, haggard, distorted, faces; their limbs are merely skin and bone-like broomsticks. One could easily count every bone in their bodies. How they manage to walk or even stand, is indeed, beyond conception. No doubt the undaunted, dogged, British spirit, carries them through.\n\nAs I have already stated, French people (mostly women) give our lads clothes and food when possible. Man arrive here daily, wearing top hats, frock coats, white dress shirts, some sort of rags for trousers, all frightfully torn and filthy. Their frightful weak state, and thin starved bodies, add ludicrously to their weird appearance. Despite the awful state the men are in, one cannot, however, suppress a laugh occasionally; they look so extra-ordinarily funny. The Huns delight in taking warm clothing and boots from Englishmen. When captured all men are promptly deprived of these articles. Many French women have been shot, and not infrequently, are they whipped and clubbed, for attempting to assist the English \"slaves\". We owe much to the self-sacrifice and assistance of these noble women. Not one man would survive the Reprisal treatment, without the assistance given by the French women. Very little is obtained individually and always it is secured under the most difficult and dangerous conditions. The Hun food rations are extremely small in camps near here. For instance; twenty four hours food supply seldom exceeds the following details. Eleven men to a small black loaf. Breakfast, cup of coffee. Dinner, nil. Tea; one bowl of greasy filthy hot water, containing at the very most ten pieces of \"mangel wurzel\". Consequently the poor wretches are compelled to resort to extreme measures to obtain additional food. Men think nothing\n\nof risking a bullet to obtain \nadditional food\n a few fragments of food, whilst working in the vicinity of Hun lines and billets. Fortunately it is possible to make an occasional, hasty raid on a canteen or billet; this however entails considerable danger. The usual procedure is to knock the occupants down and seize what useful articles are within reach and make a stealthy exit. This is very dangerous work and invariably the exploit results in severe rifle butting and not infrequently, bullets. Starvation is cruel, and the incessant craving for food makes men terrible desperate. It is really wonderful how their weak state permits them to work or march, however, it is forced, and one knows not his strength, until tested by endurance and suffering. This sort of thing is common. I know of cases where men have collected rubbish from refuse tubs and grass and bones; in fact anything likely to contain a fraction of nourishment. They stew this awful assortment in a pot of water and consume with relish. (On the other hand however, these facts are not within human \nsuffering\n conception.) Subsequently the disease and filth cause abscesses and internal complaints. Hundreds of these cases are admitted here. No doubt these disclosures appear too highly colored. The commandant at a Reprisal Camp nearby, roughly eight kilos’ from Valenciennes; revels in the practise of increasing the burden and misery of the men’s lives. The following is a good example of the brutish manner in which he carries out his plans. Every Sunday morning the men are compelled to parade with a clean change of underclothing and foot rags. Not one particle of clothing is every issued. The Commandant knows perfectly well that it is impossible to wash the few rags the man have, without causing additional, intense misery. Soap is unprocurable, (as I have mentioned before) and to comply with this beast’s order, it is necessary to soak the clothes over night and carry on at work without underclothing. The weather is invariably wet and cold and miserable; fires are unheard of, consequently the tattered clothing is worn while still wet. The cold alone, tortures the unfortunate men almost to death. If a man is suffering with frostbit, or other complaints, he is not allowed to cease work, which of course he should do; he is clubbed along\n\nthe roads and not until he falls unconscious, is he admitted to hospital. Very many have succumbed under these awful ordeals. The work, is always of the most strenuous nature. The greater portion of the famous \"Hinderburg Line\" has been constructed by prisoners of war. Russians do the cement work and gun emplacements whilst the British and French erect wire entanglements. The Hun possibly realizes that the British are cunning and cute, therefore he never allows them to do important work especially, where an opportunity presents itself, wherein there is any possible means of doing faulty work or setting traps. The strong cordon of Hun posterns supervise the work and guard the prisoners, both at work and during journeys to and from the barbed wire enclosure. The details I have given are not exaggerated and those men who have experienced the life and have managed to escape or had the luck to be repatriated, could tell of hundreds of similar miseries imposed upon helpless prisoners by Hun malefactors. I know of many less severe phases, but they are not my own personal experiences, therefore, I leave details to those man who have survived the atrocious Hun Retaliation.\n","20":" I am considerably handicapped by the danger involved in keeping a diary of this sort, moreover it incurs the maximum punishment in the event of discovery; subsequently I shall, through necessity have to rely upon my memory. I think however that experiences under Hun rule will remain indelibly fixed in my memory. The notes unavoidably get badly damaged and soiled, under my method of concealing them. For this purpose I use a large tube of tooth paste for secreting them. The moisture quickly soils and often obliterates pencil writing. I unfasten the end of the tube and roll the paper into a ball and insert it in the centre of the paste; when the tube is refastened, one would not imagine anything to be concealed inside. I cannot use more than three tubes, on account of arousing suspicion; the Hun is clever and shrewd with his brutality; and is intolerably observant. Anything likely to convey information is promptly seized; so one must necessarily be prepared for periodical inspections which are\n\nmade here. By changing the paper often, I am able to preserve the notes. I always use a tube partially depressed and smear a little of the substance on the outside to blind suspicion. My diary will necessarily be written weekly, or even longer periods may elapse. Nevertheless, the details and dates are correctly stated. I would give anything to be able to forget the scenes of misery, agony and brutality, however, that is impossible, owing to the lack of literature and other possible means of occupying one’s mind. Nothing very unusual has occurred recently. A small party entrained for Germany today, this of course excited the Huns. I asked the Interpreter if I would be transferred shortly. He replied that I was unfit to travel. I wonder how it is possible for these inhuman brutes to consider one’s state of health and comfort. No doubt the Hun casualties awaiting train ambulance, are too numerous to allow prisoners to be entrained. Consequently, he advantageously attributes the \ntrouble\n delay to ill-health. One Hun told me, \nthat\n special trains were employed to remove the wounded from the Arras sector, this I think is significant evidence. I am almost bored to death and still unable to procure books or literature of any kind. The food has not improved, although the menu was changed today. Instead of \"Saur kraut\" we each received a bowl of decomposed sweedes. I ate the stuff; Ugh! but it is awful.\n","21":" My temperature is falling and I think I am nearly normal today. My wounds are less painful and my unhappy comrades appear to be improving. Freedom from pain merely increases the incessant craving for food. Up to the present date, very little conversation has taken place between us; none of us are equal to the effort; life seems to so vague and oppressive. I actually found a piece of grissel in my soup at dinner. I chewed it ravenously for some time and then carefully laid it aside for another time. No doubt this seems absurd, in fact it is, however, it is perfectly true, and I though it a real treat.\n","22":" Several Australians sufficiently recovered from wounds to permit walking; visited us from another ward. According to\n\ntheir stories, they are even worse off that we. They have a very brutal orderly who delights in worrying those unable to leave bed. Most of them have not had their wounds dressed for 10 days and not a few have lingered for weeks without any attention whatsoever. The beds are infested with vermin; and horribly filthy and uncomfortably hard. The repulsive, odious smells from wounds and latrine buckets, are almost suffocating and unendurable. Nothing is administered to those unable to sleep or in pain. God! what a hell of suffering. \nthis is\n Deliberate and cruel brutality.\n","23":" I have received only three dressings since arrival here, and many have not fared as well. When dressing wounds, the Doctor probes and pushes gauze thro – and thro – until the wound bleeds profusely, thus causing unnecessary pain. I dread those days; but it is essential and I make a practise of worrying the Doctor until he attends to me. Otherwise, one may wait weeks for dressing. Those who are too weak to ask often, are overlooked. The Doctors are certainly busy, but they could easily arrange more frequent dressings. Probably they hate handling us, anyhow their detestation of the British is displayed forcibly.\n","24":" to","25":" The routine has not altered. \nand\n The monotony and incessant craving for food increases. Reading matter is still unprocurable. I am in great danger of submitting to ennui, which is awful in its turn. The hope of transfer to Germany keeps my spirits up. Food parcels and mail are allowed through to Germany. This pleasant inspiring information was conveyed to me by a Frenchman, captured in the early part of the war and a recent arrival here. Parcels and letters are strictly forbidden entrance or despatch whilst in the Retaliation sector. This is one of the cruel Hun reprisal impositions. \n","26":" Several local French papers were smuggled into the ward. One glance is sufficient, convincing evidence of the manner in which the war news is distorted. Everything is absurdly exaggerated, nevertheless I interest myself in struggling through\n\nthe French. I noticed one paragraph worthy of comment. \nwhich is\n -- It contained a list of the casualties inflicted upon the British air service, during one week. The number brought down, exceeded the aggregate of machines employed on the whole Somme front. The report referred to one sector only. I read many similarly exaggerated and absurd reports, but they are not worth paper space. The papers are no doubt, editored according to Hun dictation. Moreover, the misled French population, is continually tortured in this typical Hun manner. I have discovered the advisability of learning the German language. I loathe the very sound of German; it is however, beneficial to overcome this dislike. \"Ya ya\" and \"Nicht\" are the only words I understand at present; \"Verbotten\" of course, is indelibly fixed in the mind of every man who has suffered Hunland trials. The word is printed everywhere and those unable to see the placards are impolitely told of its meaning. \"Forbidden\" is the literal meaning.\n","27":" The interpreter informed me that all men in possession of money or valuables, must hand them in for safe keeping pending transfer to Germany. I have no intention of risking my few pence. My unfortunate companions are equally determined to retain their money whilst possible. Personally, I think the order is a new form of trickery. Usual ordeal.\n","28":" My name was called during the announcing of a list of men going to Hunland in the morning. This pleasant advice cheered me considerably. We all hope for better treatment in Germany; in any case letters and parcels will subsequently reach us. The mere thought of getting in touch with friends, caused all and sundry much elation.\n\n14TH. Very exciting morning. Huns rushing about in frantic haste, cursing and jabbering wildly. The ridiculous and excited manner in which orders were obeyed and little jobs attended to, is very remarkable. The slightest alteration in daily routine seems to upset their equilibrium. They lack courage and coolness, this I have experienced both at the Front and here. (England er alles schwindler, England er sweinori) followed by storms of \"Donnerwotter\" are the only remarks received in reply to a question. If one\n\ndoes not move away quickly, the first spasm will be followed by an avalanche of \"Loose, vic, donnerwetter\". French and various adjectives are roared in a bullying rage and vile temper, which displays the hatred and miserably low animal instinct. Those unaccustomed to this sort of thing would positively feel nervous under this barrage of vociferous language.\n\nThe hospital was almost panic stricken until 3 p.m. At about that time I was carried out on a rough stretcher. I was amongst the last few men to leave and not until I had passed through the ward, did I know that my friend Cpl Wilks was in the same ward. I may add \nthat\n it was he, who shared the unhappy, unenviable 26 hours I spent in \"No man’s land\" shell hole. A great crowd of French civilians assembled to watch our departure. I noticed the flicker of smile on many of the sad faces. \nand\n When a woman or child attempted to approach a stretcher occupied by a Britisher, a Hun postern promptly intercepted with a bayonet or rifle butt. Shortly afterwards I discovered that many fellows had received gifts of biscuits and bread during the first rush of excitement. After considerable delay and confusion I eventually reached the hospital train. I lay for an hour waiting to be taken into a carriage. During the time I waited, I noticed many crippled Hun Red Cross men \nleading\n carrying stretchers; four of them had artificial legs. Viewing the train from the outside, one gathered a very bad impression regarding its capacity and comfort. However, when I entered I was indeed, agreeably astonished. The compartment was spotlessly clean, and quite comfortably fitted with hospital necessities. I thought the beds most comfy and clean, in consequence I soon fell asleep. I enjoyed the refreshing sleep for several hours. I was abruptly awakened by a nurse, who spoke to me in excellent English. For a few seconds I though myself safely back in the hands of the British. But! Ugh! what an unpleasant reality. A volume of Hun jabbering issuing from outside had filtered into my sluggish brain, thus, clearing all misapprehension.\n\nThe nurse promptly told me that all prisoners were to return to hospital in Valenciennes. For a few moments I think I felt\n\nthe most dejected and miserable human being on earth. Was all this a merely a new method of torturing we unfortunate British? A little later several nurses entered with our first visitor, and asked, \"Can zee anyone speak German?\" \"Alles nay\". Our first visitor commenced discussing war; she received few comments. That ingenious person then walked round the beds, carrying a small basket containing medicine tablets, also a note book and pencil. Whilst asking if one required medicine, she cross-examined and asked many questions. I noticed that she scribbled many notes. Fortunately few men ventured to talk; her writing I am convinced was done under the pretence of recording the various ailments.\n","29":" P.M. I re-entered ths hospital. To make my exile worse, I was taken to a different ward; much smaller and even more uncomfortable than the first. I felt desperately hungry, but tea was over. I lost a meal; barley water.\n","30":" to","31":" The Interpreter often volunteers information, regarding transfer to Hunland. He says we shall go soon. My recent misfortune has caused me to give up hope of going for weeks. There is only one orderly in this ward, but he is worse than twenty ordinary Huns. He is a typical \"square head\". He wears glasses and has a fair complexion, similar to his brethren; moreover, he shouts and storms continuously. I and my associates are doubtful about his mental balance. When the Doctor is expected to visit the ward, he stands near the door peering through the key hole looking for signs of the Doctors approach. Every few minutes he rushes round the ward, yelling at the occupants and pulling at the untidy, filthy beds. I am nearly accustomed to Hun explosions; and like my compatriots treat this creature as a clown. The Doctor enters, and \"square head\" \"springs to it\", by stamping his foot on the floor with a thud; he then salutes. We also have a different Doctor, who treats us with cool contempt; if not a villainous stare of hatred. If he desires to see one’s bandages, he takes the bed cover between thumb and forefinger, and after a cursory glance, throws it down with a haughty gesture, as much as to \n","32":" I shall not allow my fingers to touch you or anything near you, you filthy Britisher. Then a spasm of \"Ya ya\" followed by \"Ya\" from the orderly. Although weak and hungry, one smiles at this performance. I should love to take a few snapshots of them, I am sure they would be exhibited in London as curios of \"Hunland at War\". I have succeeded in getting a fresh dressing since returning. My leg is septic and contains also fragments of broken bone; despite these troubles, I have been ordered to walk. I refused to obey this cruel order and have repeatedly asked for proper attention. However, my persistent requests are ignored.\n\n24TH-31ST.","33":" The orderly pulled me out of bed and endeavored to make me walk. I protested, but he commenced handling me roughly, consequently I collapsed on account of weakness. I eventually tried to walk and each effort failed, my leg simply doubled under me. The Hun saw the impossibility of walking, so brought me a pair of crutches. With the aid of crutches I struggled about for an hour, he allowed me to return to my bed. The walking exercise or torture continued for three days. I was then made to walk with a stick. I suffered awful agony, subsequently the swelling increased; I told the Doctor, who merely laughed and said \"Nicht\" meaning nothing, and that I must continue walking. Ultimately my temperature commenced to rise in fever. I was not allowed to return to my bed until the","34":"\n\nThere are many seriously wounded men in here, but they receive no attention other than an occasional dry dressing. In every case an operation is necessary to remove \neither\n fragments of bone. The Sanitation is horrible and disgraceful; a large bucket stands in a corner a few yards from my bed, and is invariably overflowing with urine and excreta, it very often remains so for days – disinfectant is never used. The stench is odious and repulsive. Despite our persistent requests to have the receptacle removed, the Huns are indifferently unresponsive. A pigsty is healthy compared with this hovel. The food has improved a little. Twice during \n\nthe week we received a small quantity of horse or dog flesh for dinner. We have many arguments regarding the nature of the meat, however it is quite a vague controversy. A welcome adjunct to the soup is an occasional spoonful of peas. This is quite a treat after \"saur kraut\" and \"swedes\" but I am afraid it will not continue.\n","35":" The weather is ideal much to our comfort in one sense; on the other hand, the odious smells are more abominable. The hot weather \nso\n effects wounds not dressed regularly. Numerous deaths have been recorded lately; amongst the most recent, are four Australians. This morning a man of my Battalion, had a leg amputated without anaesthetic. He certainly was too weak to take the ether, but on the other hand, his life should have been saved. The operation was necessary weeks ago and his health would have withstood a general anaesthetic. However, the operation was performed this morning. A local injection was administered to ease the pain. His screams of agony were awful; he died several hours later. Usual ordeal.\n","36":" Pte. Muller of the 14th Batt. A.I.F, died. He had \nthe\n one foot amputated, and severe body wounds in addition to a badly frostbitten foot. The foot was green and decomposed with mortification. Muller suffered extreme pain and misery, caused through ill-treatment. I am certain he would have survived the operation had the Huns amputated the remaining foot earlier. He was very cheerful until the last few days; I saw and spoke to him waiting in the operating room only a few days back. Men who knew him in the Battalion, all say he was a fine athlete and strong and healthy. Very severe cases receive one raw egg and a little horse flesh and periodically four ounces of white bread, if the meat is not issued. They perforce, rely upon the ordinary soups. In an ordinary British hospital, these cases would receive whatever food, stout, or nourishment they cared to ask for. The Muller case is quite a common thing here. Death through neglect and inattention, is more prevalent amongst the Russians; the numbers\n\nare of course, larger and the Russian spirit is not nearly so reliable as the British. Nevertheless, the sole cause of ninety nine per cent of deaths, is neglect and starvation. I am not exaggerating, I have seen and witnessed the misery I am describing. There are dozens of cases one knows nothing of. I could fill a volume with accounts of that sort alone, but it is not necessary.\n","37":" My suspicion of Hun food shortage, was confirmed this morning when the bread ration arrived. The orderly promptly cut a slice from each man’s ration and demolished it before our very eyes. Several men asked him why he ate the prisoner’s food; and proceeded to complain.. He interrupted, and through the medium of a Scotch man – conversant with the language, I learned that the Huns received a small ration and were unable to procure anything locally, or from Germany. It is most unwise to report the matter as in all probability we would receive worse treatment for complaining.\n","38":" Several Hun Generals inspected the hospital. The inspection created a stir similar to previous unusual events. The orderlies \ncreated a stir si\n were frightfully excited and troubled. We unfortunates received the brunt of their wrath. The \"red-tape heads\" appeared overfed if anything. Towards evening the interpreter informed us that our departure for Germany was confirmed. \nand\n We would entrain in the morning. This information inspirited us.\n","39":" The day commenced rather briskly. The Huns fairly ran amok preparing a large party for departure to Hunland. Whilst I lay patiently waiting for bearers to carry me down stairs, I was suddenly startled by two Hun brutes, who had rushed across to Wilks a few yards distant. They demanded him to walk refusing to carry him on a stretcher. The unfortunate man could not stand; try as he might. They pulled him out of bed and struck him several blows. Wilks endeavoured to stand, but that was impossible. The brutes insisted upon harassing him; \nthe\n they certainly knew perfectly well that he was incapable of complying with this absurd order. He was handled very roughly for half an hour, and quite exhausted and injured. They \n\n \n\ncarried him away, eventually. I quite expected a similar rough handling, but fortunately two Russian bearers entered and carried me out. Crowds of women and children had already assembled near the motor ambulances. Whilst I lay on the road waiting my turn to depart, a girl standing a few yards away, rushed to me and threw her arms round my neck and kissed me repeatedly – until a Hun postern shouted and rushed at her with a rifle. I firmly believe that the wretch could have struck the girl had she not disappeared forthwith. After considerable day and jolting in the ambulance, I arrived at the station. During the time I waited, I noticed several large cisterns containing gas; no doubt in readiness for use on the British lines. Later, I was carried into the train and placed in a swinging stretcher. I nervously hoped that my first experience would not be repeated. The train moved out in the evening, this pleased everyone. \nThe train\n We travelled at a great speed, consequently the jolting of the carriage, soon irritated my wounds, however the journey was tolerable. During the early part of the journey we passed through Mons. The environs of the City are surrounded with huge hills of solid rock, which form a natural fortress extending miles along the frontier. I managed to sleep a few hours during the night.\n","40":" The food is much more nourishing, but not nearly sufficient to appease one’s craving desire for food. The following is a fair specimen; Breakfast, cup of coffee and two thin slices of black bread and smeared with cheese; (I shall not venture a name), it was much too strong for most of us) although ravenously hungry, I could not eat the cheese portion. Dinner, bowl of rice which I enjoyed immenseley. Tea, similar to breakfast. This is a very appreciable improvement on the Valenciennes menu. The weather is ideal and the country looks beautifully abundent with crops. Every inch of ground is under cultivation. Providing the Huns are blessed with the necessary rain, they should reap a good harvest. I have seen some very beautiful country,\n\nbut I have not seen anything to compare with this – although it is Hunland. We stopped at several large stations, en route to Stettin, \nthese\n including Hanover and Berlin. At every station crowds of people flocked to the train to see us; fortunately we were not subjected to any unpleasantness or criticism; the posterns promptly dispersed the crowds. We crossed the River Spree and circled round Berlin, finally stopping in a suberb for a few minutes. Within the environs of the city every available foot of soil is under cultivation; the earth is sandy but no doubt properly manured. I noticed hundreds of prisoners working on the railroads and at factories near Berlin.\n","41":" 10 p.m. Arrived Stettin. The train shunted about for some time before stopping; no time was lost in conveying us to a large hall, which appeared specially constructed for receiving sick and wounded. I was placed amongst Russians and French to await removal to hospital. Under-officers and civil police were rushing about excitedly. I am accustomed to their peculiarities. The police dress in navy blue uniform and a huge spiked helmet bearing the weird spread eagle. Very few of the orderlies appeared healthy or physically fit, but they struggled through the work alright. Hun wounded were also taken through this room; they were welcomed cordially by the O.C. who gave each a hand shake. He roared and stormed at the orderlies and under-officers they obeyed quickly and \nprepared\n appeared to be awfully nervous and afraid of him. I have never heard a man curse and shout in such a terrific voice. In his hand he carried a drawn sword. I \npartly\n fully expected him to strike somebody, however his fury and threats \nseemed based upon\n proved mere Hun bluff and vile temper. We were confined to the receiving room for an unconscionable time, while waiting to go on to the hospital; many of us grew so tired and miserable that we volunteered to be carried pick-a-back to the trams \nthat\n which were held in readiness to convey us to hospital.\n\n1. a.m. I was taken to a tram and placed in a cramped position in a small compartment. I was most uncomfortable, nevertheless I felt relieved. We were soon travelling through the streets of the city. During the journey, I noticed many broken windows \n\nfrom which machine guns were pointing into the streets; others were prominent on top of buildings. Huge plate glass windows had been shattered; debris lay about the pavement, in fact the aspect was most uninviting. We travelled approximately 4 miles finally stopping in front of a dilapidated building in Johannisthal. This old melancholy looking structure was destined to be our future prison. I informed the orderlies that I was unable to walk without causing severe pain and injuring \nto\n my wounds. Heedless of my remarks, they dragged me from the car. I was compelled to struggle along with one Hun on each side, supposed to be assisting me; they hindered me if anything. The distance was roughly 100 yards. Despite my agony and difficulty in walking, I managed to walk through the building, finally halting near a bath-room. I possessed several small articles which I carried in a Hun pack sack. Before I realized the action, my bag had disappeared. A Hun or Russian appropriated it. I hopped into the bath-room and undressed. A Hun orderley followed and forcibly compelled me to bath in a tub containing filthy water. He gave me a handful of sand (substitute for soap) and I managed to wash myself. Later, an Englishman entered and assisted me to a bed. The only refreshment I received was a cup of cold coffee. The ward is a very spacious room, and accommodates 130 patients. English were allotted to the centre beds of the room, French in the rear, and a host of Russians in front. Many of the latter were dying, but received no attention. Men who arrived early in the night, received fresh clean dressings. Those able to jest, were creating much excitement displaying the paper bandages wrapped round limbs and bodies. Linen bandages are unobtainable here. Several prisoners who had experienced reprisal camps and were now convalescent, acquainted us with the hospital routine. The food was our chief topic.\n","42":" I have learned the cause of the extraordinary scenes I saw last night, whilst coming through the streets of Stettin. Thousands of people rioted and ransacked the shops of every particle of food stuff within reach. Soldiers were promptly\n\nassembled to disperse the crowd. Machine guns were used freely, effectively killing and wounding hundreds of people in the struggle. Old men, women and children were shot ruthlessly in the streets. This sort of thing is quite common in Stettin and other large towns; prisoners who have worked in this district for some period, confirm the reports. Everything is monopolized by the Militarty, consequently the civilian population suffer the wrost of the food difficulties. When the civilian people attempt to riot or protest, forcibly, the army promptly squashes the trouble by force of Arms, without regard for life.\n\nI was dressed and like my compatriots, I was enveloped in a mass of paper. The head Surgeon is a Hun and supervises the work which is performed by two Russian surgeons (captured in 1914. A Hun student assists, chiefly to complete his surgical training; he of course is allowed to practise on we unfortunate prisoners. The operating theatre is a large double room, containing 4 tables, Two Hun nurses \nassists\n attend. Their duties are handing the gauze and instruments to the Surgeons. The room is invariably crowded with wounded; approximately 20 men waiting continually; beside stretcher bearers running in and out. The odious smells are repulsive. Whilst I was waiting my turn this morning three men fainted, but received no assistance or restorative. The Russian Surgeons unavoidably tolerate a miserable existence under the Huns. They have but one privilege- they may visit the town twice weekly, under guard. Their quarters are fairly comfortable, but food is very short; what there is of it lacks nourishment. Fortunately, the Doctors receive occasional parcels from Russia, also a little assistance from Englishmen able to spare small gifts of food. Despite my recent arrival here, the friendship existing between these men is noticeable. French and Russian prisoners are not treated nearly so well as the English by the Russian Surgeons. The Doctors are overworked and otherwise suffer awful inconvenience at the hands of the Hun.\n","43":" Most of my time is occupied by inquiries. I have heard everything regarding the general routine. i.e. wounds are dressed twice weekly, and exceptional cases are taken before the \n\nHun for consultation. He decides whether the operation is necessary or otherwise. The Russians are forbidden to operate without permission, and when allowed to operate they always do the rough work; such as amputations etc. The Hun merely attends to interesting cases, chiefly those likely to benefit him professionally. Capt. Lubinsky (Russian) is considered very clever; not infrequently he argues against foolish and unnecessary operations. This consequently subjects him to much abuse and insult from the Huns.\n","44":" The Felfaber (Sergeant Major) collected all cards, paybooks and papers from those in possession of such articles. Everything goes to the Censor for examination. I have lost everything excepting my diary notes so I am free from that strictly enforced order. The food is considerably more nourishing than the Valenciennes– diet. For instance, compare the following with previous fare; Breakfast, 6 ounces of black bread and grease (substitute for dripping) and a cup of coffee. The dripping is most acceptable, there is however, unfortunately not sufficient to cover each slice; \nhowever\n what there is however, is enjoyable. My skin is dry and scaling. This unpleasant irritation is caused through months of meatless food and not fat. For dinner we each receive a large bowl of swedes. Tea, (afternoon) cup of coffee. Supper, bowl of barley or bone meal. One is always ravenously hungry; that however is unavoidable \nmoreover the food is more substantial than our previous fare.\n I have received reliable information to the effect that all cards and letters written from Valenciennes, were destroyed. This is in confirmation of my previous assertion. Prisoners here are permitted to write one short letter and two field cards fortnightly. Special cards were issued, to forward to the Red Cross Society; parcels containing food and clothing will be received in return, but the mail service is very irregular. Consequently a reply will take 2 ½ months, possibly longer. Many men captured at Mons recently arrived, they of course, are in receipt of food parcels. These men are a few of the survivors of 500 men taken to Russia from Doberetz Lager in Pommern, to undergo Hun reprisal torture to vindicate the supposed cruelty of\n\nHun prisoners in British captivity. This is deliberate cruelty in disguise. Retaliation is merely an excuse to ill-treat British. About thirty of the unfortunate men returned during April and May. \nEach\n They are awful wrecks; frostbitten, injured and starved. One would think it impossible for men to survive and awful treatment meted out to these unhappy men; quite a number have lost limbs and fingers. There are two who have lost all toes.\n\nWhen I first heard the truth I discredited the story, however, many have told me of their experiences; in each case they agree. I am positively convinced that the man speak the truth. They worked under shell fire, cut ice from rivers; and suffered other inhuman impositions. Boots and warm clothing were taken from every man; the food was not fit for human consumption; parcels were confiscated; men were shot and whipped unmercifully; hundreds were knocked down in the snow, unconscious, and left to perish. Human bones and refuse were eaten to sustain their miserable, starved bodies. I know of even worse privations and suffering but they are too awful to describe. When these men are liberated, they will undoubtedly tell the exact circumstances of the Hun imposition. These disclosures possibly appear incredible, nevertheless every word is true.\n","45":" My knee is still septic. Since the torture I suffered in Valenciennes, nothing has been done to remove the remaining fragments of shattered bone still embedded in my leg. The Russian dressed me this morning and told me that an operation is necessary. The Hun refused to touch my wound perforce I must await his pleasure. I discovered this morning that men wearing iron leg splints were allowed linen bandages. I saw a large assortment of bandages in the operating theatre; on close inspection I noticed that they are mostly strips of window curtains and dress materials. They are mostly stained with blood and pus. One man told he had worn one bandage for six weeks; despite the pus and his persistent requests for a clean bandage, he is refused. The scene in wards and operating theatre, would disgust British surgeons and nurses. The place is \n\nindescribably repulsive, and absolutely unfit for hospital use. \n","46":" A French Sergeant visited us, to take details of our Military particulars which are immediately forwarded to the War Office, London. The Sgt, (Bracq) is a very clever linguist and is very popular amongst the British. His duties are arduous and multifarious; he deserves much credit for the work voluntarily done to assist we unfortunates.\n\n13th-20th. I am the only Englishman confined to bed in this ward, consequently I feel lonely and miserable. The windows are seldom opened and the sanitary arrangements are abominable. Medical and Surgical cases are not separated; even ten dangerous venereal cases (Russians) are confined to this room. Two Huns supervise all work which is performed by convalescent Russians. The unfortunate wretches, however, are glad to accept these duties, on account of the comfort and possible chance of obtaining extra food. The commando work is very strenuous in addition to shortage of food and maltreatment and constant misery and hardship. The Russians are awful rogues – they steal anything they can possibly make use of. Clothing and boots are the most suitable articles for providing indirect means of obtaining money. It is very difficult to secure one’s property; unhappily I am destitute, consequently I experience less trouble on that score. I have not had a smoke for ten days and the prospect of obtaining cigarettes or tobacco is remote. This new experience is a minor trouble, however the shortage of the weed causes me to realize the joys of tobacco. Some fellows collect leaves, fragments of tobacco and cigarette ends, and roll them in a piece of paper bandage and smoke the awful mixture with apparent relish. I envy anyone passing my bed smoking, but I shall not allows the habit to become so degrading to myself. \"Smokes\" are a wonderful nerve restorer, and like most people, I miss the weed. Some men take advantage of the liberality of the older prisoners; by this means they secure a little tobacco occasionally.\n","47":" There is not any literature at all. I was taken before the Hun specialist, for examination. He decided to operate, the decision pleased me immensely. The date is uncertain. I dread\n\nthe mere thought of undergoing anaesthetic in the hands of Huns, but it is wise to preserve one’s outward composure.\n\n21st.-28th. My leg was agin X-rayed. During the performance I experienced another phase of Hun torture. The bandages were removed in the operating theatre. After two hours suspense and waiting, I was forcibly compelled to walk a distance of ten yards to the \"Rontfon\" room where I was ordered to get on a table. Unfortunately my discharging wound soiled the table cover. It is customary to place a cloth or paper pad under the leg, or wherever the wound may be; to prevent the table cover being soiled. In this case I was merely told to get on the table and wait until they were ready to attend to me. When a Hun finally commenced to operate; he discovered a spot of pus; and promptly lost control of his vile temper. He roared furiously and struck me several blows on the face and body. I was quite unable to retaliate, but did my utmost to guard myself and strike him in return; which of course was futile, on account of my state of incapacity. During the struggle the door was locked, thus shutting off any chance of assistance. If I had called or shouted to anyone outside; Hun orderlies would have promptly appeared and my tormenter would explain the circumstances, to suit his own purposes. I would undoubtedly, have received additional \"straffing\". Subsequently I was X-rayed and glad to free myself from that Hun brute. The latter four days of the week were extremely miserable. Each morning at eight a.m, I was taken into the operating room expecting to undergo an operation. On each occasion I waited (one hour; sometimes longer) in the room during operations, expecting to go on the table every moment. This sort of thing has an awful effect upon one’s nerves, especially when so weak. Fortunately I am accustomed to open wounds, but the anaesthetic and odious smells, nearly caused me to faint. Each morning, my heart palpitated horribly after the severe strain. The Huns’ delight in placing a man near a table whilst an amputation or similar ghastly operation is\n\nin progress. During the operations the two nurses laugh and joke, whilst amusing themselves tying pieces of cat gut on the unfortunates, toes or fingers. This unwomanly horseplay clearly shows their inhuman, cruel and feelingless nature. I am position most men who have experienced Hun brutality, will agree with me in saying that the women are more inhuman than the men. The above is quite common here. Men are so accustomed to it, that they laugh at one if one ventures to speak of it.\n\n29th-30th. Usual ordeal.","48":" Transferred to No. 7 barrack, situated in a block of ten huts, similar to huts in British training camps.\n\nThe weather is glorious. If I were free from vermin and hunger I should be quite content. The huts are an agreeable change from the awful ward just evacuated. The Russian Surgeon informed me that the Hun intended operating on the 3rd. July. I have waited three months for this operation, which had I been in a British hospital would have taken place within a few days of the date I received my wounds. Prior to the war the hospital building was a beer house, beer gardens adjoin the building and are still pleasant. Even now a few tables are used on Sunday. The beer is very light but it does not appeal to me in any way. The people tantalize us whilst sitting in the open; it reminds one of the pleasant days in the West. Beer and coffee are the only refreshments obtainable. The customers seem to derive such enjoyment from the slight diversion which is apparently, typical Hun pastime.\n\nThe lack of literature adds immensely to my misery. The crisp, cool air is my only delight, also I am unable to improve my health considerably by spending a few hours in the garden. I hope to receive a food parcel from Copenhagen shortly; the mere though of food encourages one. The men returned from reprisal in Russia, receive many re-directed parcels – they invariably find the contents missing. Undoubtedly the Huns make short work of the food \"en route\" from Russia.\n","49":" I am entering my third month in captivity; it seems an eternity since that fateful day in April. Ugh! I am awed when I \n\nthink of seeing my reflection in a mirror; fortunately one is not obtainable. I have not brushed my hair since capture; my beard which is normally light, is now long and thick to say nothing of the filth. This is however a mere incident in the usual ordeal. I have decreased fully three stone in weight, since the 11th of April. The operation will probably complete my physical weakness. Keep smiling is the only alternative; I have stuck it to date, so shall go on sticking it. \n","50":" I received cards from Copenhagen, advising despatch of two parcels containing food; Oh! what a great tonic! my spirits rose from zero to state of exhilaration. Thank Providence for encouraging news.\n","51":" 8 a.m. Two Russians carried me to the bath-house, inconsequently the third bath since April. I experienced much humiliati during the process of scrubbing. A Hun, Russian and Frenchman attended me whilst in the bath. In accordance with the usual Hun procedure; the Hun insisted upon having the trifling duty performed according to his orders. He shouted and cursed furiously, but failed to impress anyone. He \"donner-wetted\" and \"sweineried\"; ineffectively until I was taken into the operating theatre. The last thing I remembered, is struggling with several Russians who were holding me down whilst the Surgeon administered anaesthetic. Two hours later I regained consciousness, and found my leg securely bound to a long iron splint. I suffered awful pain during the night, but received nothing to ease the pain or induce sleep.\n\n4th-6th. Very ill.\n\n7th-10th.","52":" I was dressed by Lubinsky; the first dressing since the operation. A thick rubber tube was inserted and forced through and through my leg, causing extreme pain; one cannot complain on that account after an operation. The latter three days were miserably uninteresting.\n","53":" Oh what a treat! I received two parcels; bread and groceries. My happiness is heavenly. I ate ravenously and and smoked until I was fully satisfied. A substantial meal is\n\nirreproachable nowadays.\n","54":" I was dressed again. The tube was roughly removed and gauze pushed through and through, until the blood poured from the incision. The doctors always use dry gauze; with it they probe and push in a zig zag fashion, regardless of the pain caused and without the slightest consideration.\n\n13-31st. My food stuffs were quickly demolished. I am now anticipating news from England, on the other hand I may wait weeks for news, nevertheless I am much improved in health and feel more comfortable. I can easily combat the trial during the next few weeks. My wound unfortunately, is not doing favourably, the puss increases daily. Dressings are very painful and most unsatisfactory. The instruments are badly sterilized and frequently, the one probe or pincers is used for five or six cases. I have discovered a true and genuine friend, he is a Canadian; one Sgt. Johnson of the Fort Garry Horse; He was captured in March at Cambrai. Despite serious wounds in his stomach, Johnson insists upon helping men unable to leave bed, and not infrequently, he gives his own small food ration to men who are dangerously ill. He cheers me considerably. When he receives a cigarette from a Tommy in receipt of parcels he always insists upon me smoking the weed. He also arranges for me to be taken into the garden on a stretcher. Innumerable other acts of unselfishness and kindness, are shown to men unable to help themselves. I appreciate little kindnesses of this kind more than anything they certainly offer some inducement to get well.\n","55":" I managed to get a Strand Magazine dated 1894. Needless to say, I devoured every word; the diversion had a most pleasing effect. I am eagerly anticipating news from England. I shall never forget these weeks of torture and anxiety whilst eagerly awaiting communication from home. A Russian officer and several privates, effected an escape from here during the night. Subsequently a strong guard was placed near fences and gates, cutting off all possible chance of escape in the future. The posterns are mostly cripples and I think, would gladly accept a suitable\n\nbribe; unfortunately very few of us are strong enough to venture on such an arduous journey as that entailed in making escape.\n","56":"","57":" Usual Hell. Several men who arrived here in June, have received parcel advice from England. Upon receipt of this good news my spark of vitality ignited sufficiently to cheer me, as I hope to receive something daily. My wound still shows no improvement.\n","58":" Many food parcels arrived; Great excitement prevailed. The lucky recipients remind one of a children’s picnic. My mouth fairly watered when I saw a long white loaf of bread being carried into the ward. A fellow gave me a slice, which I speedily demolished, feeling much akin to a grateful dog. Oh! what a God-send these parcels are! The first parcel from England conveys indescribable happiness.\n\n29th-30th. My first packet from England arrived on the","59":" inst. I already feel years younger, and quite able to bear any future trials. The parcels contained a varied assortment of food stuffs. For instance, canned meat, jam, dripping, tea, sugar, milk, oxo and several additional articles. The number despatched from England; are three food parcels fortnightly and one clothing half yearly. Bread is forwarded from Berne under the auspices of the R.C.S. Regrettably, many parcels go astray in transit, probably Huns steal them. Despite this misfortune, however, when one commences a regular receipt of parcels they suffice to stave off hunger. If every packet arrived intact, one would always have ample provisions. I am certain I could not exist longer than twelve months under previous conditions. Hundreds have died from starvation alone; chiefly those men who arrive here frequently, from retaliation camps behind the Hun lines in France. Consumption is prevalent and medicine is unobtainable, so those victims merely die without attention. It is nothing less than deliberate murder. No. 9 Barrack situated at the bottom of the garden, is specially prepared for tuberculosis cases. I have seen hundreds enter, but I have never seen one man return alive. These figures include French and Russian. The French receive a little assistance from France. The Russians unfortunately, depend entirely upon the Hun rations. Occasionally a very small quantity of sugar and biscuits are issued, the small quantity is hardly worth considering as assistance. I have\n\nreceived several comforting letters from Miss M. Chomley, Australian Red Cross Society, London. We Australians owe our lives to Miss Chomley and her lady helpers. Everybody receives letters expressing sympathy and desire to relieve the awful situation. These few typewritten words act like magic. It is impossible to express the feeling of gratitude extended to her and her helpers.\n","60":" I had my second operation today. Later I was told that a rubber tube, two inches in length, was found buried in my leg; it has been embedded in my wound for three or four weeks. This, is think is sufficient proof of the careless manner in which wounds are dressed.\n","61":" Transferred to No. 1 Barrack. No. 3 which is along side, is occupied by British. Most of the men have lost a limb; one Tommy I know, has had both feet amputated. Despite the pain, starvation and inattention, this young fellow is always cheerful. He is a typical example of the Britisher, high spirited, staunch, brave and indomitable. He lay six days in \"No mans Land\" without attention or assistance. During the major portion of the time, snow fell thickly causing frostbite, which is the sole cause of his present disability. In consequence of the operation my leg is naturally painful; my nerves are completely broken; but I am still smiling. Whilst waiting for my turn on the table, I lay beside three men undergoing operations and witnessed this nerve-distracting ordeal. Before I received the anaesthetic I was strapped to a table and roughly pushed aside like a carcase of beef awaiting to be butchered. One is always roughly handled.\n","62":" –","63":" Many additional parcels arrived during the week, but my luck has deserted me. My wound was dressed recently. During the performance I asked the Russian Surgeon, if he would mind dressing me daily because of the profusion of puss saturating my bandages; he agreed. I suffer considerably more pain, but it is better for my wound although the rough probing and general style of dressing wounds irritates the nerves. My own privation is insignificant compared with hundreds of more unfortunate sufferers, here and elsewhere. Everyday I go for dressing I hear the cries and screams of men in agony. Always the screams are from\n\nRussians and French; an Englishman suffers in silence; much to the Huns’ astonishment. To have dressings applied, it is necessary to go to the operating theatre consequently, one is taken from a ward bed and carried about a hundred yards through the open and left in the cold, draughtly hall. I have often waited an hour for my turn. Several Englishmen have contracted pleurisy through this practise. The death rate daily averages five, fortunately few English number amongst them. A dangerous case has no possible chance of pulling through; should the patient receive proper surgical attention the nourishment received is not sufficient to revive strength. The most trying ordeal for dangerous cases, is the awful bowl of swedes, which is pushed under one’s very nose, that alone is a torture. Only those who have suffered these miseries can possibly imagine how horrible it is; it is indescribable.\n\n10th-17th. My wound continues favourably, but is not painful. I am quite hardened to the rough life here now. I think a little pain occasionally enlivens one. A third operation will be necessary and if my wound does not improve, my leg will be amputated. The date for the operation has not been decided. Hence my terrified suspense. I hate the thought of losing my leg after so much suffering, neglect and inattention. On the other hand, it is quite foolish to lose heart, and dwell upon the possibility of an amputation. One must take things as they come and hope for the best. A brave Tommy had a leg amputated a few days ago. He was not expected to live through the operation on account of exceptional weakness following loss of blood. During the proceedings however, the iron hearted Hun nurses amused themselves by tying pieces of cat gut round the other foot. As I have previously stated, the nurses hold various instruments etc. in readiness for the Surgeon. They play and laugh whilst watching operations; fortunately, Cripps is a brave hearted young man. After the operation, Col. Goldenberg, a Russian Doctor (prisoner of war), injected salt water into his veins to make his heart beat. Also he gave him a bottle of cognac purchased from his own personal funds. Cripps is still living and doing well, and I think, will recover.\n\nWounded prisoners, despite inattention and maltreatment fare better than men captured unwounded. They of course are employed in Reprisal camps. My suffering is inconsiderable when, compared with the horrors and tortures imposed upon those men; I sincerely hope some of these will, when liberated give a full account of their experiences. No doubt many will be glad to refrain from speaking or writing of their horrible life in Germany. \n\n18th-25th. I received a clothing parcel on the","64":" and a grocery on the","65":" the latter is the second food parcel I have received since capture. Some men have had ten, on the other hand many have received nothing. Australians receive three loaves of bread weekly from Berne (in the cool weather) and hard biscuits during the summer months. The bread is always stale and hard, caused by the long period occupied in transit. Happily however, it is eatable, therefore it is very acceptable. The biscuits are extremely hard, but when soaked in water for several days, one can enjoy them. Not infrequently parcels are mislaid; in that case the bread and biscuits are unfit for consumption. Many are stolen en route, but one has no definite evidence to prove the fact. Regrettably my bread parcels have not yet commenced, but my compatriots assist liberally. My people will have received news of my capture. It is indeed a relief to know that they have no particulars. I am glad they are quite ignorant regarding my treatment here. I have experienced fighting and hardships in Egypt, Gallipoli and France, but those experiences do not bear comparison with Hun tortures.\n\n26th-30th. The weather is cool and boisterous. My parcels from England have commenced to arrive regularly.","66":" I persuaded an Englishman to carry me into No. 3 Barrack, to chat with several of my pals who are unable to leave their beds. Immediately I entered I was almost suffocated. Ugh! What awful smells! The Barrack is infested with vermin and this coupled with the repulsive stench from wounds, is insufferable. Despite my eagerness to talk with the boys, I made a speedy exit.","67":" The Russian Surgeon informed me that my operation was arranged for the 2nd of October. He tells me that my knee will be opened and although the operation entails considerable danger to the patella and arteries it should\n\nbe successful. I am hopeful.\n","68":" The weather is inclement and miserable, inspite of this, I spent several hours in the garden, talking with the officers. There are seven British officers imprisoned here to receive Surgical attention. Their mode of living is similar to ours, but they are allowed a small amount of money weekly. From this meagre pittance the Huns deduct the cost of their rations. They are unable to procure anything in addition to the Hun food. Capt. Lubinsky, voluntarily purchases articles for those who have a little spare money.\n","69":" 8 a.m. I was carried across to the bathroom and placed with four Englishmen awaiting operations. My turn eventually came, much to my relief, 11 a.m. Quite recovered from the ether. Soon afterwards a man handed me several food parcels, which had arrived a few hours earlier. To my joy, I discovered a tablet of chocolate, which I consumed forthwith. 4. p.m. Although suffering much pain, and quite unfit for removal (Brass Buttons) a Hun under officer ordered all hands to return to the hall, my original ward. I suffered awful agony during removal.\n","70":" -10th. I am awfully weak and have suffered much pain during the week. I was informed by an Australian who watched my operation, that a large piece of bone was removed from the tibial head. When being dressed, the Hun Surgeon lifts the flesh over my knee-cap thus exposing the bone, which he probes and scrapes cruelly. It is essential that the cavity be thoroughly cleansed, so I am prepared to stick the pain. On the","71":" the Hun Surgeon, informed me through the Russian Surgeon, that my leg would be amputated unless it improved within two days, this unexpected news depressed me very much. \"Brass Buttons\" who delights in worrying the Englishmen, created much excitement to-day, during the distribution of parcels. This specimen of Hun brutishness, curses madly and when everything is arranged according to his orders he invents trouble. Most of us display the contents of parcels in a conspicuous place, merely to tantalize the Huns; this is our only means of revenge. Huns are persistently worrying us to sell them food which is unprocurable in Stettin. The few household articles obtainable are abnormally expensive. Needless to say the Huns never receive an atom from\n\nBritishers, despite their repeated pleadings for various things. I shall give a few specimens hereunder. Soap ½ d. tablet, two marks; ½ lb, tea 5 marks and upwards; boots 100 marks per pair; 1 lb. canned meat, 8 marks; jam 1 lb tins 5 marks; bread 2 lb. loaf 20 marks. Similar exhorbitant prices are offered for clothing and food. These figures are merely prices offered by Huns employed on the hospital staff. The street prices are considerably higher. Many of the above mentioned articles are unprocurable. One cannot afford to sell or give; personally I would rather destroy my parcels that allow the Huns to have any. This sort of thing makes them ravenous and furious, much to my delight and satisfaction. No doubt the individual Hun would appropriate our supplies without asking. The military orders, are strict in regard to parcels and the punishment imposed upon defaulters is severe. The maximum Hun punishment, is dreaded by all Huns i.e. They are promptly sent to the Western Front. I have not heard of a Hun who expressed his desire to visit the Front.\n\n11th. My wound has improved beyond expectation and I think, will heal in time. During the day I managed to obtain several French books so I am deeply interested in polishing my French. I have omitted to mention an incident of the","72":" of July, i.e. the Hun recommended me for internment in Switzerland. The Spanish Red Cross representative is expected here shortly and I intend lodging several complaints regardless of consequences. The (Ober inspector) C.O. is a typical Hun. He revels in worrying the British. He is commonly known as \"Old Bill\" and is a most comical creature; he suffers with gout, which adds immensely to his peculiarities. Although we are allowed to receive parcels, it is forbidden to cook anything on the stoves in the ward. The fires are very seldom burning, although they are the only convenience for preparing food. Those able to walk however, take full advantage of the fires. If \"Old Bill\" comes into the ward and notices anybody cooking, stealthily he creeps up to the unfortunate and without mercy throws the contents of the pot (or whatever it may be) over him. The Russians act as orderlies to we British, unable to do for ourselves; in return for their voluntary aid we give them what ever food we can spare. About \n","73":" p.m. is a favourite hour for cooking. When the fires are out the Russians collect any rubbish they can possibly find; by this means they soon get a blaze sufficiently strong for the purpose. The scene is very amusing to an onlooker. The average Russian is by dint of privation cunning and shrewd; it is quite interesting to watch them dodging \"Old Bill\". Hence our tormentor finds his surprise visits unfruitful. In that case he invents trouble and a host of complaints simultaneously pouring forth an awful storm of \"donnerwetter verfluch ter mench, loose, vic etc.\" At the same time striking right and left at anybody standing within his reach. The terrified Russian, usually stands trembling under \"Bill’S\" outburst of fury. I am quite accustomed to these storms and merely take them as a matter of course. Like my English comrades I treat this unreasonable beast with indifference.\n\n12th-31st. My parcels continue to arrive regularly, subsequently my strength improves daily, likewise my wound is progressing favourably and I feel much happier. During the last few weeks, I have had my photograph taken in several international groups. I am desirous of collecting souvenir pictures, this practise, of course is forbidden, but I am prepared to risk punishment. A Frenchman employed in the X-ray room, takes and develops the photos; the Hun in charge of the \"Rontgen\" rays supplies the camera and material. Prisoners in possession of a few pence are all eager to purchase. The Hun of course is well-satisfied. The cards are procurable at the moderate cost of 4d. each. I have made innumerable inquiries regarding remittances from England and learn that 15\/- monthly is allowed into Hunland. One really does not need money here, but a few shillings are always useful. I avoid circulating money in this country, nevertheless one often requires small articles procurable in Stettin. Parcels addressed to deceased men, are distributed amongst men not receiving food parcels. Convoys of newly captured prisoners arrive frequently. Most of us realize the urgent necessity for assistance in these cases, so we do our utmost towards relieving their mouths of incessant craving for food. Innumerable women are employed in and about the hospital; these are mostly cooks and clerks. Just recently, I discovered that the Hun women are rationed similarly to prisoners, excepting a little extra meat.\n\nObviously fresh trouble is in store for us owing to the approaching winter. Already the nights are miserably cold out of doors. The air in the ward is odious; my persistent requests for the windows to be opened are futile. The Russians are the sold cause of this discomfort. Britishers are continually opening the windows, but they are promptly closed by a Russian. If one says anything to him, he merely remarks \"Nee karoshaw tavarich\" (No good friend). The Russian language is extremely difficult to learn without an apt tutor; at least fifty dialects are spoken here. My experience with the average Russian soldier, conveys to me their awful ignorance of things in general; many do not even know why they have fought or what their object was. The usual reply to questions regarding Military affairs, is \"Nipenimoyu\" (I do not understand) followed by a meaningless shrug of the shoulders. The Russian Jew however is very intellectual and a clever linguist. I have spent many interesting hours chatting with the Jews; they are deceitful, and keep in close touch with the Huns, so I strictly avoid military matters.\n","74":" Very heavy snow storm. My wound is quite comfortable, and is healing splendidly. A Russian Jew trasferred from ward Swei, entered this ward to-day; he is bandaged with filthy torn paper; his beard is fully 18 in! in length and saturated in saliva etc. he refuses to cut it. His features are similar to a baboon’s and his antics are uncommonly akin. This human disfigurement provides much amusement. Despite these peculiarities, the man is not nearly so daft as most fellows consider him. His ability as a scout is excellent. Immediately after the meal hours, he arrives in the ward carrying three or four bowls of soup; he promptly seats himself upon the nearest bed and drinks ravenously. During this weird performance the men in the ward laugh heartily, and throw pieces of paper at him; he treats this ill-usuage with contempt. What little soup he cannot consume, he places safely under his own bed; he then makes a tour round the ward collecting cigarette ends and fragments of tobacco. The Englishmen call this peculiar fellow \"Chimpanzee\" and shout\n\n\"idu sudah Chimpanzee papihros Horoche\"? (come here, good cigarettes). Needless to say the man complies willingly, invariably securing a few cigarette ends; at the same time providing much amusement for all. His peculiar actions alone cause shrieks of laughter. \"Chimpanzee\" speaks excellent German.\n","75":" –","76":" Many wounded Russians including two officers arrived from Riga. They were captured only a few days ago. I have learned through a reliable source, that the fighting is severe near Riga, alto that much treachery has been discovered amongst the officers. The men state that their officers accept Hun Military pay and firmly believe that most of them are German Jews. These traitors have absolute control of the operations and surrender the men in thousands; in addition to leading them into specially prepared traps, where they are murdered ruthlessly in hundreds. One of the officers here at present, admits candidly that he received Hun money; he considers the matter an ordinary business transaction. Personally, I consider the average Russian soldier equally as good as any nationality. With good, genuine leaders, they would fight bravely and successfully. The physique of those recently admitted, is excellent; very few understand the treachery and intrigue effectively organized in their very midst. My bed is between two Russians and I have great sport endeavouring to converse with them. They stare wildly, and are amazed at the food stuff contained in my parcels; subsequently I am subjected to much discomfort and embarrassment. I\n\ngive them a little I can spare, but they appear to regard me as a permanent support, the more I give, the more they expect. My small store will not however permit me to supply them continually. I understand a few words in Russian. For instance; \"Tabac\" and \"papihros\" (tobacco and cigarettes). These two words are shouted in my ears incessantly, despite my protests and remarks. If I ignore their pleading, one fellow promptly tears a small piece from his paper bandage and waves it in my face. I merely reply \"Nipenymeyu towarische\" But the persistent barrage on my small supply of tobacco continues. Very often I \n\nhave no tobacco and not infrequently some \"blighter\" robs me during the night. Men roam about the ward day and night, consequently one grows quite accustomed to their prowling, and accepts it as part of the daily routine. Hence the numerous thefts. \n\n10th-17th. The air is pleasant although we are nearly snowed in. The Huns have discovered a new method of causing further inconvenience. Orders were recently issued to the effect, that all canned food must be left in the Store-room; when anything is required, the applicant must use a bowl. The tins are opened in the present of the Felfaber, who censors everything. The men able to walk, tell me it is very satisfying to watch the Hun handling the meats. He stands livid and fuming inwardly and no doubt, wishing he were able to purchase some of the food. He is deathly white at any time, but during the issue hour his face is an interesting feature; showing distinct signs of jealously and anger. One is able to avenge some of the Hun tortures, by constantly tantalizing them in the wards, this is possible whey they stand round the beds feasting their eyes on the supplies received from England. I take special delight in occasionally calling one whilst exhibiting my food stuffs; I ask him the cost in Germany. When told the small cost in England the Hun expresses great astonishment and discredits the figures. One Hun who always patrols my section of the ward; almost begs for food. He is a very effeminate man, in consequence thereof he is commonly known as \"Maudie\". A few days ago I called him and gave him a small piece of whitebread, this he devoured ravenously, and expressed great satisfaction and stated that white bread was unprocurable in Hunland. This small gift touched \"Maudie’s\" heart; he promptly told me his family troubles. His mother is old, and depends entirely, on him; food is unprocurable in the City, moreover the Military allowance is barley sufficient to sustain her. He has not been to the Front, and is very nervous and afraid he will shortly be compelled to shoulder arms. He tried means of inducing me to give or sell him food. His last endeavour was to offer me a bottle of Port Wine; I declined. He then proceeded to tell me the articles purchaseable in Stettin, \n\nand if I gave him the money to cover the cost of any article I needed, he would smuggle it into the hospital. I wanted a razor so I gave him the necessary money. Some hours later \"Maudie\" nervously approached my bed, looking right and left fearing someone would notice him; he eventually handed me the razor, which cost six marks. My bread parcels have not commenced yet.\n\n18th-25th. I am anxiously looking forward to letters from home. Many men have already received correspondence, re-directed from their various units. Mail takes six weeks to reach England, and probably three and a half months to Australia.","77":" I received £ 1, from the Australian Red Cross Society, London, the remittance was forwarded through the American Express Company. Cigars and cigarettes and lemonade are purchaseable at the canteen. The cigars are excellent, but the cigarettes are intolerable; the lemonade is an awful concoction of mineral waters. Cigars cost 4d. each; cigarettes 1 mark for ten, and lemonade 2","78":" d. per bottle. My wound continues to improve, and I feel more comfortable despite the numerous bed sores caused by the hard uneven bed. I am quite accustomed to the latter and thoroughly broken into vermin.\n\n26th-30th. The long splint was removed today, which naturally is a great relief; I have had it fastened to my leg for five months. I am eagerly looking forward to walking on crutches. The officers visit us frequently. On every occasion they have generously distributed cigarettes amongst the men not receiving parcels. These cigarettes are purchased out of their small allowance, (which is according to British agreement). A Russian was admitted lately, suffering with a slight injury to his shoulder. He was neglected for days, consequently he contracted septic poisoning. Despite his repeated requests for attention, the Huns ignored him until his temperature reached a very dangerous degree; he was then taken to the operating theatre. The Hun Surgeon made a small incision, to allow the pus and congealed blood to escape. Unfortunately his condition gradually became worse and he died. The day of his death the Russian \n\nSurgeon visited him and suggested another operation, but the Hun declined. Another case of carelessness occurred in \"Swei\" ward. A Russian recently captured had a leg amputated. He was taken to his bed and whilst the orderly was placing the blankets over him, he noticed blood oozing through the bandages; he promptly informed the Doctor who had him taken into the theatre again. When he removed the bandages, he discovered an artery not securely tied. Fortunately the man was in good health; that alone saved his life. Col. Goldenberg and Capt. Lubinsky, have lately been transferred to \n\nGefangenen Lazarett (Prisoner of war hospital) Castle; they are both a sad loss to all patients here, the new Russian Surgeon is a keen worker, but unfortunately his duties are performed in another ward. A Hun student has attended me lately; I experience much inconvenience and discomfort at his hands. Recently my wound has been dressed regularly and it appears my case is a very complicated and unusual one, naturally interesting him. Huns always show exceptional interest in cases likely to benefit their profession.\n","79":" Life continues in the same old groove of misery and monotony; occasion ally interrupted by a little excitement caused by \"Old Bill\" who makes innumerable inspections and strafing raids. His latest scheme is collecting horse chestnuts from the gardens. Many substitutes are extracted from these nuts; chiefly a milky juice which is used as milk, and the shells as a substitute for coffee. Wounded and sick men able to walk are detailed for this work. Every evening odious smells issue from the kitchen, where the cooks burn barley, this is used as a substitute for coffee. Potatoes, barley, bone meal and occasionally macaroni (substitute) are the chief foods. The soups are considerably more substantial and quite palatable nowadays. If I have any parcels in hand I extract the potatoes, with which I mix a little canned meat. This is a tasty dish in Hunland. The only means of making parcels last for any time, is to share with a partner or as the Tommies put it \"muck in\" from experience, I find it the only suitable means for providing\n\nfor \"a rainy day\".\n\n2nd-9th. My health improves daily. I attribute the improvement to the food parcels. I am hoping daily to leave my bed and look forward to taking a little fresh air. My lungs are awfully congested owing to the months I have spent in bed, inhaling this awful air. I have experienced much humiliation lately, through my parcels, very often one waits weeks without them, then four or five will arrive sumiltaneously; on these occasions Huns and Russian collect in crowds round one’s bed, offering to purchase. Despite refusal they persist, and even after the Huns have retired the Russians continue their entreaties. Inadvertently one is unable to explain the circumstances, so they think one miserly and selfish. For instance I have often had 15 or 20 tins of foodstuff on hand at one time, that is caused by the accumulation of delayed parcels. On the other hand, I often find my locker bare. When a number of them arrive together, it is necessary to retain several tins or packets, (as the case may be) to meet the weeks of delay. I often give packets of rice, sago etc. despite the various offers of money ranging from four to six marks, according to the quantity. I have several Russians nursing me, therefore my supplies are decreased by their demands. It is quite common to see forty or fifty gathered round different Englishmen, opening new arrived parcels. The unhappy men are always desperately hungry and have an insatiable appetite for cigarettes and tobacco. I often feel inclined to throw several whole parcels amongst the crowd, to free myself from the piercing eyes of these starving men. Like the Huns, the Russians think our parcels are forwarded from America, but I do not wast time endeavouring to explain. Poor deluded wretches.\n","80":" 9 a.m. \"Old Bill\" visited the ward and to his joy, he discovered several men using the stove for cooking purposes, He silently approached them, and siezed several pots of boiling oats; promptly throwing the contents over the unfortunate victims. Then a thunderstorm commenced. He kicked everything within \n\nreach. extinguished the fire, and tried to run round the ward, unfortunately for him his gout prevented him endulging in such violent exercise. He \"donnerwetted and sweineried\" for ten minutes. I am sure his voice would be audible three miles away; I have never heard such a terrific outburst before. I had much difficulty in suppressing my shouts of laughter, if \"Old bill\" had noticed or heard me, I am certain I would have found a place amongst the pots. He finally departed, fiercely, chewing the end of his cigar.\n","81":" I ventured out of bed this morning, when I stood up, I immediately fell in a heap on the floor. After lunch, struggling with assistance I managed to prop myself up between two crutches; by this means I walked a few yards. I continued my walking exercise for an hour; I returned to bed quite exhausted but satisfied. Under ordinary conditions, one would be able to walk in a few hours, but here the first attempt to walk, is similar to a child’s first trial; owing to excessive weakness.\n\n12th-19th. I have practised walking on crutches each day. At the end of the week I could walk 50 yards without assistance.\n\nThe famous British tormentor \"Brass Buttons\" has transferred to another Lazarette; much to the delight of all. He was \"Old Bill’s\" aide de camp. He hated we English and revelled in causing trouble and misery. I am certain \"Old Bill\" is lonely without the wretch. Previously the two worked a systematic strafing raid and we were continually harassed by them. I remember on one occasion I was recovering from anaesthetic. As the bearers carried me through the hall, \"Brass Buttons\" passed near by, at the time I was shouting, he promptly pushed a whole rolled paper bandage into my mouth. Being in a state of coma at the time, his action had no effect; I think it shows the brute nature in the man. In pre-war days \"Old Bill\" was P.M.G. at Stettin. He now holds temporary rank of Colonel and acts as ober inspector,","82":" Reserve Lazarett, Johannisthal, Stettin.\n\n20th-24th.20th. Early this morning I weighed myself and not by \n\nany means surprised, discovered that I had decreased 3 stone 7 lbs, since April. Before my parcels commenced I had decreased considerably more. The French Interpreter brought me a letter from home, (the first since capture). I was almost overcome with joy, you can imagine the pleasure derived from those few lines; I had suffered eight and a half months torture without news; my happiness is indescribable. Only men in captivity can understand the trouble obviated by news from home.\n","83":" I assisted several officers to organize a concert. We experienced great difficulty in obtaining permission from the Huns to celebrate the occasion. The officers arranged this part of the programme and managed to persuade the C.O. to grant permission. The evening was very interesting and cheered many weary souls. The most humourous and enjoyable item, was contributed by four Russian dancers accompanied by a badly damaged concertina. Various nationalities contributed and now a few good artists numbered in the programme. The evening concluded in the midst of many national anthems, regardless of Hun feeling. Later a \"canny Scot\" visited me, to my surprise he produced a bottle of port wine. He obtained the wine through a Hun sentry. \"Posterns\" are easily bribed and no doubt \"Jock\" gave him two or three small biscuits to get it. The officers were allowed three small bottles of red wine and I think, managed to create a little diversion.\n","84":" The ground is covered with snow but the air is quite pleasant. The Huns supplied a Xmas tree and decoration and ordered us to complete the decorating. Huns celebrate this custom very conscientiously; per force we were obliged to submit. Dinner was served at noon. A very agreeable change. First course: two ounces of roast pork, boiled potatoes and vinegar sauce. Dessert (a mystery) the mixture looked very much like jelly, but was quite tasteless. I soon disposed of my dish by handing it to a Russian. We also received a small bottle of lemonade. I had recently received a parcel of niceties from the 16th Battn. A.I.F., this supplemented the meal. I thoroughly enjoyed the day. Many lads in \"Swei Ward\" shared our parcels --\n\nThanks being due to Miss Chomley, Mrs Reid and their lady helpers, Australian Red Cross, London.\n","85":" to","86":" I have quite recovered from the little Xmas excitement. Bored almost to death and have nothing definite in view, unless it is to be prolonged misery and monotony in Hunland. \"Old Bill\" is absent on leave much to the relief of all. It is a treat to be free from the old bounder’s visits; even a short period of 24 hours absence, is conspicuous. Most of the men who shared my early days of misery have sufficiently recovered to go to the Laager (camp). My companion who arrived","87":" June, is the only other man in this ward who arrived with the first convoy from Valenciennes. My wound is nearly healed.\n\nThe Spanish Red Cross representative visited us recently. It is supposed by most men that he is a Hun in disguise. This may or may not be so. Anyway, I risked consequences and asked him if I were not eligible for exchange. He conversed with the Hun Surgeon, who merely \"Ya! Ya’d\" and walked away. The supposed Spanish gentleman informed me that he would do his utmost in assisting me out of Germany. \n\n1918.","88":" Usual Monotony. The Huns consumed ale during the greater part of the day and received extra food but we prisoners fared poorly on the ordinary diet. A Hun under-officer has constantly worried me lately to sell him soap and food stuff, which of course, I refused. He persistently remarks \"lager, Bell\", when the specialist makes his weekly tour of inspection, he does his utmost to persuade the Hun Surgeon to mark me for discharge to the Altdamm Camp. Fortunately, the Surgeon wishes me to remain until my wound heals properly. The under-officer came to me today and offered me a walking-stick, which I refused. He then endeavored to compel me to walk, my refusal increased his vile temper and jealousy. No doubt he will eventually succeed in victimising me; in any case I am desirous of seeking a change and feel quite prepared for future misery and hardship.\n\nMen who have experienced the Lager ordeals, speak very discouragingly of the camp conditions, but matters cannot be\n\nmuch worse than in this filthy place. The daily sight of sick, wounded and dying men is horribly depressing. My nerves are in a frightful state and undoubtedly a change of air and surroundings will improve my health. Most of my friends, made during the last few months, have long since gone to Altdamn. One is forbidden to write to anybody in Germany. \n\n2nd-8th The specialist accompanied by the C.O. made the weekly tour. The latter examined the food, tasted all soups and appeared quite satisfied. The catering is in the hands of the proprietor, who, by the way, is an old Australian veteran, He speaks excellent English, but seldom condescends to converse with a prisoner. He approached me several days ago and asked me where I hailed from. He spoke of many Australian towns and told me that he had spent 18 years in Australia; most of them in Victoria. He returned to Hunland a few months prior to the outbreak of hostilities. He is Hun to the core and will never venture to speak unless he knows the coast is clear. I was very astonished, when he told me of his experiences in Victoria. I avoid the man when possible as he obviously wishes to extract information in the usual Hun manner.\n","89":" I was marked out today. I expect to leave here shortly. My Hun opponent has gained his object; that, however, is immaterial to me.\n\n10th-17th. My wound has healed. The specialist has examined my leg closely and expressed much satisfaction. He actually smiled when he looked at the wound; he jabbered something unintelligible to me. He hates English men and has on all occasions avoided us as much as possible. He especially detests our officers; on one occasion, when an English Flying officer entered the operating theatre (whilst I was awaiting attention) and spoke to him, he promptly turned his back, looking hatefully at those standing by. Ah well! What else could one expect from a Hun?\n","90":" I donned my prisoner’s uniform, and prepared myself for departure to Altdamn. The uniform is forwarded from England, but is made according to Hun specifications. The cap is black, with broad brown band; coat, black with broad brown armlet; trousers black and decorated with a huge brown strip on each leg.\n\nThis curious costume adds weirdly to one’s appearance, consequently there is little chance for an escaped prisoner to avoid detection. I also have a pair of Australian military boots and a full kit of underclothing. The Huns issue nothing, unless one accepts clogs and a few filthy rags for clothing. I was taken, in company with four Englishmen, through the gates into the street to await a tram. We waited a few moments. The trams were crowded with people, consequently we were the objects of keen criticism and scrutiny. There are few men civilians to be seen about, but crowds of women and soldiers. The women wear very short gowns; in most cases the skirts barely covering the knees. All dress material is rationed, consequently the women folk dress similarly to children. The journey occupied an hour; I saw quite a lot of the city. The streets are awarming with half-starved, ragged children. The poorer class seldom wear boots, in fact those able to procure footwear invariably use badly worn shoes and boots. I took particular note of shops – hundreds of butchers’, bakers’ and grocers’ -. Their windows were mostly empty. Beer houses are innumerable and are crowded with soldiers. I also saw dozens of restaurants and large buildings; mostly vacant. The whole city reeks with poverty and misery. On the other hand, I noticed many officers and well dressed women, who appeared healthy, but with an air of discontent. I eventually arrived at the railway station; whence I was marched to a military waiting room. During the hour or so that I remained there, hundreds of soldiers passed through. Later a postern signalled us to march out. (N.B.- There were three sentries to guard five cripples.) We stood on the platform waiting for further orders, during which time many people gathered round some of whom spat at us, whilst others endeavoured to engage us in conversation, but the postern promptly interrupted them. I loved to see the jealous hungry eyes studying our clothing, particularly our boots, and not a few pointed at them and seemed astonished. The unfortunate deluded Huns are told that the English are starving and in dire straits. This, no doubt, accounts for their amazement. Leather goods are almost unprocurable in Germany. Military boots cost £ 15 per pair. Everything is at least 60 % more expensive than in England; many food necessaries\n\nare unprocurable. I finally reached a third class compartment, and within a few minutes I was travelling towards Altdamn, twelve miles distant. The journey was quite uneventful. On arrival at Altdamn the party was taken to an obsolete railway carriage, occupied by six Russians who were, apparently, appointed to assist the wounded. We remained in the carriage for several hours. A Hun under-officer, accompanied by a Russian N.C.O., entered and ordered us to walk to the camp, an order which I refused to obey. The Hun \"Donnerwettered and stormed at me vociferously for some time, and realizing the futility of his absurd order he then told me to wait until a vehicle arrived. Altdamm is a large manufacturing town, but most of the works are closed. The local resources are exhausted. The car arrived and I scrambled into it and commenced my journey to Altdamm Laager. The roads were mostly\n\nfrozen. We travelled through the outskirts of the town until we passed over a sand hill and came upon the camp. I saw numerous huts and miles of wire enclosures, securely guarded. The camp is divided into four sections – No 1. Receiving Camp, No 2. Strafe Barracks, No. 3. Exchange Camp, No 4. Cemetery and Barrack Lazarettes. I was taken into a Receiving-hut and allocated to a Barrack. The postern escorted me to the hut and then asked for my crutches. After considerable argument and protest on my part he secured them and left me standing on one leg with no option but to carry my own kit-bag into the hut. Several Englishmen assisted me to a bunk. The awful stench and disgustingly foul air almost stifled me immediately I entered the odious hut, which was about 50 feet square, accommodating 200 men of various nationalities. The beds were two feet wide; made of boards and arranged in two tiers round the sides leaving a small square space in the centre. There were several rough benches and forms in the hut for personal use. I was not given blankets or straw to protect my body from the extreme cold. I sat on my bunk, with a filthy Russian on either side and tried to settle down, but the repulsive smell almost overcame me. Despite the cold, I hopped outside, and sat in the frozen mud bemoaning my miserable situation. My only plan was to return and endeavour to make myself as comfortable as possible, which I did, after meditating for nearly two hours. Fortunately I still\n\npossessed a small tin of meat and several rations of black bread. Later the soup arrived and with it the odious smell of decomposed fish and vegetables, which sickened me. The Russians and many Englishmen, ate the stuff greedily and with apparent relish. Regrettably these Englishmen had had no parcels, which apparently had been held up for some weeks, so they were compelled to eat anything in the way of food. I met several men who had spent months with me in Setettin. One fellow had a stick and crutch and allowed me the use of them. I found it very difficult to walk with such crude makeshifts, however; I managed to get along somehow. The latrines are nearly half a mile distant and the sand is frozen and dangerously slippery. My first journey in the dark occupied two hours and needless to say I was quite exhausted by the time I regained the hut. My old friends Sergeant Johnson and Corporal Wilks visited me later. They inspired me by promising that they would find me a pair of crutches. This cheered me considerably. I eventually retired for the night and spent an awful eight hours of misery, caused by the cold and hard boards. My bones were protruding horribly and my left knee was stiff; thus adding to my inconvenience. Under ordinary conditions of health I would not have minded the roughness, but when one is weak and crippled this suffering is intense.\n","91":" –","92":" On the","93":" I received two thin filthy blankets and a palliasse filled with wood shavings and infested with vermin. The soups are abominable. I intend to suffer hunger until my parcels arrive again. Johnson gave me two sticks and I was able to get about a little. Several of us were inspected by the Hun doctor and marked for internment in Switzerland – the second occasion in six months.- The medical papers are forwarded to Berlin for confirmation before anyone is allowed to proceed to the frontier. There are many men here at present, who were marked for exchange twelve months ago. The ice if now thawing rapidly and will soon expose a waste of sand and filth. \n","94":" –","95":" Numbers of men have returned from reprisal camps, 600 arriving in one day. Thousands of parcels have arrived recently but the bread is mostly mouldy and unfit for human consumption. The men are all in a frightful state, starved, sick, filthy; their clothes\n\ntattered and torn. Obviously many have not washed for months. It is awful to watch these unfortunate men. They eat anything they can manage to get hold of. I watched one man take 2 lbs of tinned meat; 1 tin of jam; a loaf of bread and several packets of biscuits; he ate every morsel ravenously without stopping for a moment. \"God! it is cruel and awful! The poor unfortunate fellows have been starved and ill-treated for months. They alone can realise the tortures they have had to endure. The Huns increase their miseries by making perpetual straffing raids. The slightest breach of discipline involves punishment in the straffe barracks, which means hard labour on black bread and water. Many men, I knew in my battalion, have arrived recently. They have recognised me, but I could not see any resemblance in them to the strong healthy men I knew in France. Towards the end of the month additional numbers arrived; others were despatched to commandos, although unfit for any kind of work. The Huns consider each prisoner an asset. Each prisoner is registered in a specified camps which is attached to a Hun divison and employed accordingly. For all money changed here the Hun camp money is substituted. This is valueless? It merely consists of tin tamped ‘Kriegs-Gefangenen-Laager,Altdamn’ and the amount ranging from 1 pfennig to 50 pfennig. We have the use of a Hun canteen, but food and drink of any sort are unprocurable. Cigars, cigarettes and ironmongery are purchaseable at exhorbitant prices. Eating utensils are not issued, consequently it is essential to purchase spoons, knives etc. from the Huns. The rate of pay varies according to the work, but never exceeds 1 mark daily and seldom more than 4d. Unemployed do not receive pay. Thousands are employed in chemical fabric manufactories. The work is very strenuous and extremely injurious to the health. The only means of escaping from these hellish places is to contract illness or to strike a civilian or postern. The defaulter is promptly returned to the laager to await court-martial. Many men have punched civilians and posterns to escape from the chemical fabric works. Several Tommies are here now, awaiting trial, but they are prepared to be straffed, in preference to working in these places. \n\nMy own friends who have experienced Hun brutality, have told me of the treatment they have received. Where many men are employed in commandos the treatment is extremely severe. It is quite common to see a man knocked down by a rifle-butt or bayoneted. Farm work is hard, but the ill-treatment is not so common. Small commandos (2 or 3 men) are quite pleasant, providing parcels are received regularly. Russians, returning from factories often smuggle goods into camp – sugar, candles, flour etc. which they retail to Russian Jews, who, in their turn sell them to others. These articles are unprocurable in towns, and indeed, are considered exceptional luxuries in Hun families. The Russian Jews obtain eggs, spirits and wines and retail them at enormous prices in camp. For instance; eggs @ 1 ½ marks each, wines and spirits which are invariably adulterated @ 45 marks per bottle. These articles are also unobtainable in the towns. How the Jews secure them is really wonderful. No doubt they smuggle the goods into camp, and if necessary bribe the posterns. They all speak excellent German. The Hun soldiers here suffer similarly to those at Stettin. Any serious breach of discipline means instant despatch to the Front. Some enterprising enthusiastic English N.C.O’s exempt from work, have collected sufficient money to build a small improvised theatre. The Huns allowed them to purchase timber and instruments. The various nationalities stage a concert or impromptu play occasionally. I thoroughly enjoyed one of these entertainments last evening. The orchestra is composed of every nationality, nevertheless it is quite an excellent diversion. The French stage very humorous concerts. How they obtain the female clothing, necessary for the make-up, is quite wonderful. The English usually have a fortnightly concert. Sergeant Post, London Rifle Brigade; Sergeant Gutteridge; Cpl. H.M. Wilks,","96":" A.I.F. Purser Hancock and Sgt. Johnson, Canadian; are the chief organisers, and much credit is due to them for the weeks of untiring energetic struggling they must have passed through, whilst arrnging the theatre, and securing the musical instruments. The moderate charge of 5d. per man is collected from those desirous of enjoying these performances. Needless \n\nto say, the house is always crowded. The proceeds are absorbed in improvements and in the purchase of additional, musical instruments.\n","97":" The spring is already approaching, so the climate is quite congenial. The sand is very deep and I find my progress on crutches a slow and arduous process; however, I enjoy the change from hospital life. Happily, my living quarters have improved greatly. The Huns ordered everybody to have a bath and all clothes and blankets to be fumigated – quite a treat under ordinary circumstances. Innocently I strapped my clothing and blankets together and threw them into the fumigator, expecting to get them, when I had finished my bath. I need hardly say how thoroughly I enjoyed that wash, but on returning for my property, imagine my astonishment, when I discovered that everything had been stolen. Some cunning Russian had appropriated the whole lot. I stood naked, and shivering, wondering how on earth to supply the deficiency, when a kind, considerate Englishman came to my rescue. He lectured me for being so careless and explained the Russian method of obtaining money. It appears these men trade with others, selling old clothes etc, which they manage to steal now and then. My kind, compatriot finally supplied me with a temporary suit. I am sure I shall avoid a similar mistake in the future.\n","98":" –","99":" Recently two men returned to camp under escort. They were captured whilst attempting to make their escape from commando. The punishment for such breach of Hun discipline is six weeks on bread and water (very little bread) in the straffe barrack. The work imposed upon victims serving sentence is extremely strenuous. Fortunately, food is smuggled in unknown to the Huns, but this smuggling is a very dangerous practice; still the men are prepared to risk the additional penalty. Sgt. Gutteridge, Australian, serving with a Canadian Battalion, has made three unsuccessful efforts to escape. His last attempt was made in company with two Tommies. They travelled 270 kilometres suffering extreme fatigue and hunger, until they were obliged to risk a visit to a farm house in order to replenish\n\ntheir food supply. Gutteridge speaks German fluently; he persuaded the Hun farmer to give him some potatoes. He and his companions promptly commenced cooking them and whilst they were doing this, the \"frau\" by accident discovered their identity. She immediately informed her husband, who rushed out with a blunder-buss and covering the party, ordered them to accompany him into the house. Seeing that the Hun farmer and his \"frau\" were in a state of nervous fear: the party merely ignored his order and calmly proceeded with their cooking, telling the Hun to wait until they had eaten. The Hun protested, but the party obstinately refused to move until the potatoes were demolished, whey they accompanied the Huns indoors, and consented to be locked in a room. Whilst the Hun was gone to inform the local military authority, the party forced open the door and escaped. They then continued their trek for two days: on the second day they were recaptured, but succeeded in again effecting an escape. Their next experience was disasterous. The whole countryside was on the alert, and the party was surrounded and cut off by heavy fire. A host of soldiers and civilians had gathered with firearms to intercept them. Sgt. Gutteridge returned to Altdamn under armed escort. He received six weeks straffe. He intends making the fourth attempt, when the weather is warmer and the fruit ripe. Thousands of men have attempted escape, but, unfortunately, few have succeeded in reaching safety; many have been shot in the bush and hundreds returned to strafe. Travelling is only possible at night and the constant weeks of walking become a very severe strain. Prisoners interned in Pommern are considerably handicapped by the long distance to the frontier. The Dutch frontier is a most formidable obstacle. Sentries are posted at intervals of 100 yards and bloodhounds are employed. A stream of water runs parallel with the border and numerous Hun outposts are concealed in the scrub within range of the water. Despite these obstacles, many men have already succeeded in crossing the frontier.\n\nMy health improves daily, thanks to the care of the Australian Red Cross Society. I am messing with two Londoners\n\nwho are excellent bush-cooks; considering their previous environment. Potatoes are obtainable through the Jews. We often exchange canned meat for them. Indeed vegetables are essential, when living entirely on canned food; otherwise we would never allow English food to pass out of our hands.\n\n10th-17th My most recent discovery is a small compartment in a spare barrack, used by Englishmen on Sundays. Several energetic men have arranged a regular service, which makes our miserable lives more bearable. I have also found lots of English literature, forwarded through the British Red Cross Society, so I spend most of my time devouring books or studying French. The N.C.O.’s of each nationality have little to occupy their minds; to kill time they often make a study of different languages. Russians, who have been years in this camp, speak almost every language and delight in tutoring men interested in French, Russian or English. Otherwise the camp is quite uninteresting and is terribly slow and monotonous. One suffers from incessant frenzy.\n\n18th-28th. Despite my eagerness to study, and my desire to kill time, my mind wanders now and again and tends to become morbid. I am bored almost to distraction by the intense monotony. Fortunately my living quarters have improved lately. All men awaiting internment and exchange are living in a barrack separated from the ordinary huts. This barrack faces the main raod, leading into the town. The hut is crowded with various nationalities, mostly Russians, who are repulsively filthy. One must not tax them with this without due consideration of the circumstances under which their unhappy lot is cast. For these men receive barely any assistance and have therefore, to rely upon their cunning. They are starved, incessantly at work and ill-treated. 80% of the Russians have no interest in life and would undoubtedly welcome death. Their few clothes are tattered and torn; to wash them means that they must remain naked until the clothes are dry. Through weakness and ill-health the poor wretches feel unequal to the lightest work, and their awful ignorance handicaps them considerably. When the soup arrives they swarm round the tubs, ravenously struggling and fighting to secure a little extra. The\n\nresult is the weakest, get the least. Medicine is unobtainable, consequently the death roll is high. The only means of retaining one’s property is to nail a box to the floor and lock it securely. Despite these precautions, attempts are frequently made to remove the contents, or even to carry off box and all. I am certain I should act similarly if I were compelled to exist under these awful conditions. I have had considerable experience of similar burdens and can quite sympathize with the Russians. All the English help generously, but unfortunately the sufferers are so numerous that our assistance does not go very far. My mess-mates and I have four Russians doing odd jobs for us, merely in order to assist them. The Hun soups which we do not use, and anything which we can spare, they have. The same sort of thing is done throughout the camp. One man in the barrack suffers from apoplectic fits and is quite unable to battle for himself, so I often give him biscuits and fragments of food. The poor unfortunate shows his gratitude by kneeling and kissing my boot. Many similar indescribable cases occur constantly in the camp. Thousands suffer in this awful hell. The camp is crowded with cripples, many of whom have lost their limbs through accidents in Hun factories. Often they wait twelve months before being released. During that time they are obliged to look after themselves; crutches are never issued and the unfortunates use any stick or piece of timber they can find in the camp. The horrors and monotony are beyond description. The few details I have already enumerated are mere daily incidents and no doubt the average person living comfortably at home, may be disposed to doubt my veracity; nevertheless my disclosures are by no means too highly colored. Thousands can vouch for the truth of these statements. Camp life is considered devine, compared with commandos and fabrics, so it is easy to imagine the suffering in these hellish places. The starved, distorted, frames of strong healthy men, who arrive here in hundreds, is sufficient explanation. English and French alike complain, despite the fact that they receive parcels containing\n\nfood and clothing; but these poor unfortunates bear their misery and torture, silently gallantly and nobly. I detest sitting down to a meal in the presence of these dejected men; but what can one do. Nothing! beyond giving a little occasionally. I am glad to say most Englishmen do the same. In my Barrack there are two Russian Sergeant-majors, one of whom speaks excellent English, and is a well-bred and educated man. It is pitiful to see his haggard face and starved body, bearing the marks of long years of suffering in Hun hands. His veins are shrunken, his bones protruding, but the heart withing is still staunch and brave. As I have already stated, he is one of thousands of Hun victims. Sundays usually bring a little excitement. Hun people promenade the road, which passes through the fences. They stare and gaze at us. The prisoners gather round the fences to see the people displaying this curiosity. This practice is strictly forbidden, but the Hun posterns seldom interfere unless an officer or under-officer approaches, which very often happens. Much shouting generally announces their presence. The crowd usually disperses, until the \"Donnerwetting\" ceases. The damp is very unhealthy and although the weather is mild; I sincerely hope I shall be liberated before the summer months. Urinals and refuse pits are covered by a few inches of sand, and fresh ones are made nearby, so that the camp is more or less a huge refuse dump. One is never free from bugs and lice. I use a whole packet of naptholene daily. The vermin and lice still swarm in my clothing and blankets. The bath-house is open daily and by continual washing one can alay the irritation.\n\nMch. 1. The weather is ideal. A party of Englishmen left here this morning to cross the frontier. Many still await the happy day of their release. My leg is very painful and I think, contains some foreign substance. My health, is improving and I am increasing in weight; thanks to the care of the Red Cross Society. The English provided a concert last night, which I enjoyed immensely.\n","100":" –","101":" Awfully fed up and bored. I am keenly anticipating repatriation, but I must wait patiently. A case occurred today that really deserves mention. Two men, one of my own battalion\n\nand the other a Londoner, who have undergone amputation of both legs, and curiously also have each a fractured hand. The unfortunate men were brought into my barrack, and obliged to submit to the same conditions as the rest of us. The vermin, the filth and the smells, which alone were nearly enough to stifle me, were borne by these men in addition to all other sufferings; cheerfully and without complaint. The former, Bunter, had been captured on the","102":" He had lost one foot, sustained a fractured hand, and received several bullet wounds. An artery near the knee joint of the other leg had been severed. Many operations had been performed on him at Stettin, whilst I was confined there. His wounds had healed, with the exception of the artery incision, which was nearly well, when he was discharged to Altdamm. The customary procedure here, is to place all new arrivals in the straffe barracks for 24 or 48 hours, to await examination by the censor. Fortunately I escaped this ordeal. Bunter was subjected to the straffe treatment. Throughout this time severe frosts occurred, which naturally were detrimental to wounds only partially healed. Owing to the intense cold and exposure \"erysipelas\" supervened. His repeated requests for attention being ignored, ultimately caused him to lose the limb. For weeks Bunter suffered intense agony. His indomitable spirit undoubtedly saved his life. Perhaps these two men have already told their experiences at home. I sincerely hope that they will have a convincing effect. \n\nA newspaper dated 1917 supposed to be a British edition of the continental times, was recently discovered in the camp. Obviously the paper was printed in Germany and circulated in the camps to put the wind up the British prisoners I read several absurd articles but unfortunately I took no copy of them. I recollect enough of one of these which ran somewhat as follows: \"Many large Queues assembled in the streets of London to receive whatever food they could possibly get. During the struggle for fragments of food many people were injured. Those who managed to secure a bone, thrown to them through the bars of windows, considered themselves very fortunate. The Food Controller in his speech to the people; stated that he could prolong the war until March provided the population assisted him to preserve the food supplies. This was possible only by strict individual economy.\n","103":" –","104":" Still patiently awaiting exchange. I have managed to find another means of killing time. Every evening I visit the English barrack and have a few rubbers of Auction Bridge – an exceptional treat. During the past few days I have made the acquaintance of Lce. Cpl. Hogan,","105":" A.I.F, who deserves special mention for his valuable assistance to Englishmen unable to look after themselves. Hogan has saved many lives in Altdamm. He also suffered for many months in reprisal camps and therefore, is greatly interested in others who, owing to similar maltreatment are in a helpless condition. The few weeks rest here with plenty of food received in accumulated parcels has improved his own health, although, he is still unfit for commando work. This accounts for his presence in camp. He receives medicine and special parcels containing nourishing food from the Red Cross Society, which he distributes to sick men recently returned from reprisal camps. His untiring energy, and devotion to the work are beyond all praise. I am keenly interested in his self sacrifice and devotion to his self-imposed duties and have been myself, the recipient of much assistance and kindness. During my visits to other barracks I constantly come across him in attendance on sick men. The barrack lazarette near by is crowded with English and \n\nRussian tuberculosus cases. In spite of the danger of infection he visits them frequently. Being one day in his company I was an eye witness to fresh instances of torture and brutality. The lazarette consists of a number of roughly constructed huts, fitted with rough beds, quite unsuitable for hospital use. The cases there are all men taken ill in camp and constitute a small fraction of the total number of sick in the camp. There are at least 200 of them. Several Russian doctors (themselves prisoners) attend under Hun supervision. Medicine is unobtainable; the food is unfit for human consumption, but the unfortunate men are compelled to eat it. The daily average of Russian deaths is 35. French and English seldom exceed 2. the Russian bodies are piled in a heap outside the huts, to await burial in a long trench. Often identification is impossible and no inquiries are made. It is impossible for Russian interpreters to improve the situation on account of food difficulties and shortage of medicine; they are also heavily taxed with work. The cemetery is quite near and contains hundreds of rough graves. The French and English sections are attended by their respective nationalities, when permission is granted by the Huns. The Russian section is distinguished by a huge monument erected by Huns at an exhorbitant price. The funds are collected in camp. The English are at present, endeavouring to raise sufficient money to erect a memorial.\n\nDuring my return to camp I encountered several Huns who \"Donnerwettered\" furiously and \"Sweinerid\" until I almost lost my nerve. I succeeded in reaching the barrack safely. Prisoners are not permitted to visit the barrack lazarette without a permit and when on duly only. In the evening I pictured my return to dear old Blighty and retired happily to my bed of bugs and lice; one could be worse off and it is useless to worry.\n","106":" I received four food parcels to my surprise and joy a Berne bread parcel numbered amongst the packets. This is the second bread parcel I have received since entering into captivity. I have repeatedly written to London and Berne, but \n\nno doubt my correspondence has been destroyed. The Red Cross people are quite exempt from blame. I received a photo of a girl friend taken on horse-back; the photo was free from writing. The Huns nevertheless, disfigured the picture making it look absurd and ridiculous. This sort of thing is quite common, merely another method of cruelty. The Huns know perfectly well that letters and especially photos are very cheering and comforting to prisoners. By cutting pieces from letters and disfiguring photos they cause us additional unpleasantness. This little incident aroused my anger and determined me to avenge these months of torture and misery. I have often received letters from my people with pieces cut from the centre making the text unintelligible; I am certain the writing contained only family talk and matters of no importance to the Huns. Of course the Hun excuses himself by saying the matter was contrary to military censorship. That is absurd, as our own censors exercise a strict, rigorous examination of all correspondence. My own personal experience in this unpleasant affair is quite insignificant compared to other men. Undoubtedly thousands of letters are destroyed solely to cause uneasiness and worry. One has no privileges under Hun discipline and brutality. Many newly captured prisoners arrived from the Cambrai Sector. The latest war news is conveyed to us through prisoners. The Stettin Times and Berliner Tageblatt are often smuggled into camp. News is brief where Allied successes are concerned, Hun victories are exaggerated and advertised conspicuously. The newspapers compare badly with the statement made by recent arrivals from the front. We are all confident despite the Hun flag which flies high over the Commandant’s office, when encouraging news comes through. The flag is a source of amusement to most of us. When a slight improvement is made in the soup, everybody jestingly asks if the flag is flying. I have seen the \"Black Eagle\" taken down as often as four times in one day. I have not however, discovered the mystery of its varied positions and movements. The most reliable means of confirming Allied success is to observe the Hun\n\nofficers and under-officers, who worry everybody by shouting and storming and making up additional working parties. The Hun temper is vile and he delights to increase our torture and misery. Food riots and strikes are very prevalent in large towns. The newspapers are often suppressed in Berlin and other cities. The most recent orders issued are very unsatisfactory, i.e. all men must be out of barracks before 7.30 a.m. to exercise in the square. Hun posterns and under-officers see that the orders are carried out. Sick, wounded and cripples are included in this order. Those able to get about on sticks or crutches quite agree with the idea but unfortunately sick men who are unfit to exercise or walk, are included. Many men unfit to leave bed are compelled to join in the queue and not a few have fainted before reaching the square. Men cuaght in bed are struck with riffle butts and prodded with bayonets. The second morning after the order was issued 250 men were taken to the straffe barrack by a Hun captain to suffer four days black bread and water and eight hours daily incessant marching round the enclosure. Several sick men refused to comply with the order, consequently this punishment was imposed upon all. The following I think is worth mentioning. The rate of exchange various often and according to the progress made on the various fronts. The Mark has decreased lately. This is due entirely to the recent British success on the Western Front.\n\n16th-20th. My parcels have ceased. Hun reports state, that transport difficulties have caused thousands of parcels to be intercepted at Limburg and held up indefinitely. Usually my mess mates and I manage to reserve a little food in case of emergency; at present our locker is bare. Ah! well. I have been able to exist on Hun soups previously so I think I am able to do it again. Nearly every Friday we receive a raw herring which I have tried in vain to eat. The only possible means of making the more or less decomposed fish palatable, is to roast it, even then the odious smell nearly stifles one. Fish soups are the chief foods nowadays. Despite my hunger I have not yet managed to eat a bowl of this horrid stuff; the Russians make short work of it. The monotony is awful and my wound is very painful, accidently, I fell over a\n\nstool a few days ago and knocked my knee. On the other hand the weather is pleasant. Huge crowds of men gather near the fences every Sunday. The civilians who pass are mostly women and old men, I have not noticed a single eligible military man. On one occasion a man shouted \"Hello Tommy, you are in your place now\". The remark was ignored. The prisoners joke and laugh and the people appear to think we are happy to be in Hunland; poor deluded wretches. Old prisoners say the camp is intolerable during the hot weather, on account of disease and repulsive smells issuing from the sand. The sanitary arrangements are abominable. Hereunder are a few of the daily camp incidents. The centre of the camp is a very busy spot between 5 p.m. and 7 p.m. where hundreds of men assemble to cook, it is very interesting to watch them cooking and especially those standing about collecting scraps of food. The Russians and others who manage to scrape up a few fragments boil the concoction over papers and anything likely to give sufficient heat to make a rough stew; the mixture is demolished forthwith. The less fortunate wait about in the hope of having something given to them; if that fails they scratch about the ashes and near places where men have been cooking in hope of finding something carelessly thrown aside. The most illustrious Russian collects wood and pieces of coke found lying in the sand and makes a fire near the cooking area. He charges a penny per vessel to those desirous of using his fire. I often stand a few yards off studying this awful spectacle; it is depressing to watch the unfortunate fellows struggling to get a morsel of food. It is a hellish life for these men, it is nearly too horrifying to write of. Several wells are situated in the square surrounded with refuse pits and filth, consequently the water is bad and injurious to one’s health. Notwithstanding hundreds of men collect round the pump to wash bowls etc. Russians and Serbians who have lost a limb, arm or leg as the case may be, struggle along on two sticks. Whilst striving to wash their dish, they are bumped and jostled unmercifully. I have never seen a man offer to assist. When the rush has subsided these unfortunates scratch the ground for bones or scraps of food likely\n\nto contain nourishment. At night, Hun posterns patrol the interior of the camp as well as the outside fences. These men are very badly clothed. Their boots, especially, are always old and worn. Often during the night they visit the barracks hoping to purchase food or clothing. Astounding prices are offered for these articles. When trying to persuade one to sell or give the Hun speaks nicely and invariably asks if you need anything purchased in the town. They are the most deceitful cruel and dishonorable specimens of humanity I have even seen and not until Germany’s militarism is crushed and extinct will the world be free from Hun treachery. I paid a visit to the English section of the Cemetery; the graves are carefully attended to by our own lads. During my observations, I noticed an old Hun grave, the words on the headstone read something like this \"Here lies the remains of a good worker:. Work is no doubt the Hun motto. My wound is painful and inflamed. I am quite convinced that there is something concealed under the bone.\n","107":" to","108":" Usual routine and monotony. On the","109":" we saw a little excitement, an Englishmen acting as interpreter was suddenly arrested and secured by a strong armed guard. He is a staunch Briton and well-known journalist. During the period he has spent in captivity he has worked hard and under many difficulties caused by the ill-treatment and abuse received from the commandant. His health is very uncertain but the Huns will not grant him permission to leave the country. Immediately he was seized all intercourse with friends was prevented, consequently nobody knows why he was so securely guarded and removed. Possibly he succeeded in conveying useful information to English military authorities, whatever the crime, the Huns obviously cannot produce definite evidence. Some months ago a Spanish Red Cross representative visited the camp, and the man I speak of engaged him in conversation in the presence of Huns, they however, could not understand the language. No doubt this is what first aroused suspicion; luckily he has evaded the hands of the censor.\n","110":" to","111":" Very high temperature caused by my wounds. I paraded sick and the Russian camp Doctor advised me to go to hospital. I reluctantly submitted. I waited several hours for stretcher bearers and escort. Finally I was hoisted on the shoulders of 4 Russians; I was taken to a hospital situated in the town of Altdamn, roughly 2 ½ miles from the camp. In pre-war days the building was a beer house, with gardens and shooting galleries attached; it was appropriately named \"Schutzen Haus\". Despite any objections to washing in a tub of water used by four or five filthy Russians before me, I was thrown into the tub. I was eventually, taken to a small room occupied by ten English and two Russians. One Englishman who had experienced reprisal in Russia now acting as Interpreter, arranged for my accommodation and I was soon abed. The sheets were black and filthy but, I felt ill and submitted willingly. Parcels have not arrived lately, consequently I am obliged to resort to the Hun’s rations. Fortunately I did not require food at the time, on account of high temperature.\n","112":" 10 a.m. Hun and Russian surgeons visited the ward. Through the Interpreter I explained my troubles and was promptly ordered to report in the operating theatre in the morning. The Hun Doctor is a rough, ugly specimen of humanity; judging him by appearance I think he was a butcher or barman prior to the war.\n","113":" At 10.30. a.m. I was taken into the operating room and placed on a table to await attention. Half an hour elapsed before the Hun looked at me, he then called the Russian who apparently does all the work. The Russian selected a surgical knife and motioned me to look away. I felt a sharp incision and then thought it time to see what he was doing. Upon looking round I saw a stream of blood and pus; a few seconds later I was glad to look away. He had commenced cleaning the wound with dry gauze. To do this he probed and scraped for fully ten or fifteen minutes, causing me extreme pain. I managed to stick it without a word but nearly chewed my shirt sleeve in two. When the probing process ceased I felt considerably relieved although the thing pained awfully. My leg was swathed in paper bandages and the Hun told me to walk back to the ward. I refused to obey this cruel, ridiculous \n\norder and after much trouble I was allowed to return on a stretcher. Towards evening the pain ceased and my fever abated. I asked the interpreter to explain the reason for my treatment in this manner. He informed me that the Hun ordered all operations, excepting amputations, to be performed without anaesthetic. Some cases are allowed cocaine, chloroform and ether are difficult to obtain here.\n","114":" to","115":" My wound discharges freely, despite these convincing facts, I am not allowed to remain in bed. I invariably disobey the order. The weather is very pleasant, so I spend most of the day in the garden. Books are obtainable from the camp so I am quite content. My appetite is very keen, but unfortunately no food other than black bread and soup is obtainable. I am able to see quite a lot of the town, by looking over the garden fence. Hundreds of factory girls pass to and fro during the day.\n","116":" An Englishman suffering with chronic lung trouble was taken into the operating theatre. The Hun made a long deep incision in his back to remove an abscess from his lung. The operation was performed with out any anaesthetic, ultimately the man died. It is quite possible for a man to recover from a similar operation, but in this case the patient was placed in bed and received no further attention. Nourishment is unprocurable, consequently serious cases merely suffer prolonged agony followed by death.\n","117":" Usual ordeal.\n","118":" My wound is progressing favourably.\n\nThe interpreter told me of a discovery he made whilst carrying sacks of food, into a room above this ward. Large quantities of sugar, soap and candles are concealed and as safely and secretly guarded by the Felfaber. The Hun told him that these foods are special reserves and are secreted here from the civilians. Visitors are forbidden; therefore, anything secured in a prisoners’ hospital is quite safe. There are large quantities of potatoes deposited in the cellars. The artful Russian is a very cunning gentleman and not infrequently his compatriots appear laden with \n\nwith\n potatoes. The Huns know the \"Kartoffels\" are stolen but they cannot lay hands on the culprits. Periodical searches are made in the wards and outhouses. Beds and mattresses are closely inspected but never reveal anything. Subsequently the Hun wrath attains a terrific velocity and the usual thunderstorm bursts amongst the nearest men. A Russian soldier recovering from a fractured leg provides rare amusement in the ward. The antics this fellow performs are amusing; he imitates Huns and describes with much humour the relief fund issue of food. He speaks a little German and English and in that way makes himself understood. Although suffering with hunger and wounds he displays wonderful spirit and vitality. His criticisms regarding the Russian’s relief, are particularly humourous and amusing. The Russian issue is absurdly small: for instance: six men to one egg, 15 men to a packet of chocolate, two small biscuits a piece and several very small articles of food, comprise the fortnightly issue. He adds ludicrously by introducing imaginery items.\n","119":" to","120":" My wound is quite painless and comfortable, but discharges freely. The weather fully repairs the other troubles. The garden is my favourite abode. I received a food parcel on the","121":" and enjoyed several good meals. Subsequently I feel much stronger and happier. Transport difficulties still prevail. Happily I manage to satisfy the inner man with black bread, and stolen potatoes. Many accident cases are admitted here from Commandos and factories near by. Recently a Chemical Fabric was demolished by fire; the few survivors badly burned and otherwise injured came here. I noticed one man who was completely enveloped in paper bandages; he has my sympathy during this weather. Two suicide cases also arrived with a party of mental sufferers returned from Commandors. Afflictions of this kind are quite common. The cause is monotony, starvation and brutality. During the last few days I have taken keen observations of the civilians and outside world. On Sundays hundreds of pedestrians pass to and fro, during the week there is an incessant stream of military traffic. Recently my notice was attracted\n\nby motor lorries creating a terrific noise whilst passing; close inspection revealed tyres made of steel, between the outer and inner tyres springs are inserted. This ingenious device serves and substitutes rubber. I have seen hundreds of motor wagons and in every case the tyres are rubberless. Bycicle tyres are mostly rope and compressed paper; not a few are plain iron. A few army cars have passed, although rubber tyres are used they are invariably badly worn. The majority of women folk are deplorably attired and mostly wear wooden clogs. They look very unhealthy and dejected. The children are mostly barefooted and dressed in rags and appear to be weaklings. People often step outside the fence and talk to us. The conversation is chiefly food and personal requirements; those I have conversed with, whine about the military predomination. One day I was sitting under a tree near the fence, and noticed a woman signalling to me, so I walked across. She spoke to me in \"Pidgin\" English; in any case I understood sufficient German to follow her conversation. I asked her how the children fared in Germany and she told me that many large homes were instituted for their education and extra nourishment was provided, but the schools were not able to cope with the numbers. I was just beginning to learn a few interesting facts when a postern interrupted by ordering the woman away and pouring forth a volley \"Donnerwetter Englishe Sweiner\" upon me. The state of affairs locally is very conspicuous, and one need only observe closely to see the misery and poverty amongst the civilian population. Several Zeppelins passed overhead on the","122":" they travelled very rapidly, so I was unable to see as much of them as I would have liked.\n","123":" to","124":" No parcels through yet, but I expect something shortly. The weather is glorious, but adds to my incessant hunger. The pangs of starvation are setting in, perforce I have tackled the soups again. A few weeks without parcels humbles one considerably, in consequence any sort of food is acceptable. I crossed swords with the Hun Surgeon on\n\nthe","125":" Whilst sitting on a bed chatting with several men unable to leave their beds, the Hun entered the ward without attracting my attention. (I am still obliged to use crutches) He (donnerwettered and ‘loosed’ in awful rage). Through the Interpreter he told me that if I did not stand up when he entered, in the future I would be sent to the Straffe Barracks for seven days. Naturally I submitted and obeyed his order. It is foolish to display pride and independence with the Hun. They always retaliate by imposing greater punishment. Huns cannot speak without shrieking and gesticulating wildly. A common practice to display their hatred and vile temper, is by waving the right forefinger at one and spitting over it between weird yells and shouts. The average Hun relies upon his frightfulness to bluff one. If however a Hun pounces on one unexpectedly, it is startling, but when prepared I am quite unconcerned, and treat it as a matter of course. Similar outbursts are the source of much amusement o most prisoners (after the fray of course). There is a Hun here at present not unlike the Crown Prince and he is commonly known as such. He is partial to the English and seldom causes trouble. It is suitable and wise very often, to try and please him; it assists greatly to increase comfort. The \"Schutzen Haus\" has exhausted its novelty; I am beginning to get morbid through monotony. There is one other Australian here who was victimized at Bullecourt. He has experienced the reprisal camps in France and is now suffering with abscess caused by lack of food, prolonged exposure and filth. The retaliation ceased on","126":" and according to reports all prisoners have been removed from the fighting zone. Thousands have been freed from France but I think many unfortunates are still suffering in camps near Valenciennes. A young fellow of Leicester regiment was admitted recently; he has suffered amputation of the left foot. Several men who knew him in reprisal camps corroborate his tale. He tells me he was given an old pair of badly worn Hun boots in exchange for his own. A nail pierced his food causing septic poisoning\n\nbut he continued working, until the pain unnerved him. He reported sick but was not allowed to cease work, so he continued under those conditions until he collapsed on the road, subsequently his foot was amputated. He has repeatedly asked to be exchanged, but the Hun refuses to grant permission on the grounds that it is a case of self-infliction. The lad is thin and delicate but has the British heart and spirit which will carry him through. Three Russian students captured during 1914, act as orderlies here. They are very obliging to all. One fellow speaks a little English and I fill in many pleasant hours taking with him. He confirms my previous statement regarding treachery in the Russian army, also he informs me that a constant exchange of prisoners was brought into operation following the declaration of peace. Incapicitated Russian soldiers are exchanged for Hun officers; thousands have returned to Germany recently. The Russians are compelled to agree to the Hun dictation. A convoy of newly captured Britain and Portuguese arrived here","127":" They are securely guarded in a small room, consequently it is impossible to hear the latest war news. The local Hun newspaper is smuggled in occasionally. I recently saw a cartoon, which caused much amusement amongst the English here. The British War Loan contrasted with the Reichstag failures - converted into a ludicrous success … The Interpreter occasionally visits the town to fetch goods from storerooms. During his most recent visit, he saw several large posterns illustrating recent British failures. The whole thing is absurdly exaggerated, but no doubt, the deluded people think it correct. Only today I found a small booklet titled \"Gott straffe England\". It contains many verses of hatred and articles of the most ludicrous kind. The book is, I suppose, intended to incite hatred and malice amongst the population. Owing to an accident I was unable to retain the book and foolishly neglected to copy the contents. As a matter of fact the disgusting article was destroyed by an Englishman.\n","128":" I had barely donned my suit of white and filthy hospital clothes when several Huns rushed into the ward shouting \"Bell vic loose Schwiss\". I promptly called the interpretor and asked him the meaning of this unusual excitement. He informed me that I was\n\nto leave the \"Schutzen Haus\" within a few days to go to Alddamm Laager prior to departure for Switzerland. The glorious news overwhelmed me and not until the Huns departed shouting \"Schweiss\" did I believe the news to be true. I lost my pangs of hunger and fell to hopping about excitedly. \nI lost my pangs of hunger and\n I neither ate nor slept that day or night.\n","129":" to","130":" On the morning of the 26th. the Hun Doctor confirmed the glorious news and told me to hold myself in readiness to leave on the","131":" I was the happiest and most excited man on earth, during the 27th and 28th I did not require food or sleep despite my previous intense hunger. The only regret I had, was leaving my unfortunate comrades to suffer the Hunland hell.\n","132":" 10 a.m. Several Huns escorted me to the Laager. I found my old bunk still vacant and the familiar faces smiling but haggard and thinner. Sergt. Johnson and Cpl: Wilks visited me from the original British barrack and extended congratulations. I hate leaving such men as these behind. Sergt. Johnson is eligible for exchange on account of serious wounds in the stomach and Wilks is lame and ill. Nevertheless, they are pleased to see others leave the country. These two men have comforted me and extended kindness and assistance during the most difficult trials of my captivity, despite their own wounds and misery. The men in Altdamm owe much to the untiring energy of these two staunch Britons.\n","133":" The whole morning was spent in preparing for departure. Huns raved and stormed \nin preparing for\n out particulars. In the afternoon the men fit and exempt from work provided a few hours diversion by playing football. Parcels have resumed the ordinary routine. I received two badly damaged grocery packets and managed to recover sufficient for several good meals. The party for exchange consists of four disabled men and two men returned from Commandos. Between twenty and thirty disabled men are still awaiting exchange. Many of the latter are old prisoners and are more entitled to exchange than myself. There are also many men in the English Company unfit for work, but the Huns will not release them. These men have repeatedly asked the Hun doctor to arrange for repatriation. He offers no assistance, whatsoever.\n","134":" More Hun excitement. We were informed that our luggage must not exceed 25lbs in weight. Photos pertaining to anything in Germany, gold, papers etc. are not allowed out of the camp. Any man discovered carrying similar articles will be promptly struck off the exchange list and returned to his camp. Despite the Hun orders I risked taking my diary notes and several photos. We were taken into the censor’s office for inspection. The censor commenced his inspection. Whilst he was examining a kit I seized the opportunity to place all cards (allowed through on top of my album) hoping he would merely glance at them and walk off. Fortunately he acted as I desired and after scrutinizing several \nother\n carelessly, \nif\n and in a tired way, he merely \nhe\n glanced at \nour\n my belongings. Immediately after the inspection the party marched out of the camp. The walk to the station occupied nearly two hours, although on crutches I felt equal to twenty miles. I experienced the greatest happiness a man could possibly imagine. Upon arrival at the station, we were received by a Hun Cpl who it appears was doing night duties whilst convalescing. He introduced himself by speaking to an old 1914 prisoner who speaks excellent German. A few minutes later he addressed us in perfect English. He spoke freely on various subjects, including anecdotes relating to experiences in London, Paris, Cairo and several other countries. His knowledge of London is remarkable and exact regarding the most celebrated houses and buildings. During the conversation he stated that the war would end within 4 months from date. Italy would declare war on France, in short the collapse of France and Briton was assured. I felt greatly amused at the Man’s audacity. Possibly he wished us to argue and express open opinions. Most of us had experienced sufficient Hun-cunning to know when to refrain from war-topics. The Hun told us of an attack in which he took part in at Ypres: stating that they captured several lines of trenches and relieved the Tommies of their breakfast. He said \"Of course you know you English live riotously. The food prepared on that occasion would suffice for four times\n\nthe nmber of Germans\". This I did not doubt, necessity is a virtue. Comparing this man however with the Huns, I had met previously, I considered him a very decent fellow. I asked him how the German people accepted the present condition of affairs; Oh! said he \"Our people are thoroughly accustomed to militarism and soft foods.\" This I granted, but what of the poverty and misery, to be seen everywhere? The question threw him offguard and he promptly changed the subject, but I owed him a few knocks. I asked him why the Germans treated the British so cruelly. He merely \"Donnerwettered\" to his delight the train arrived. He carried our bags to the trains and wished us all a pleasant and safe journey. Undoubtedly he wished to impress us favorably, we were returning to England. It is really marvellous how cruelty and shrewdness are combined so perfectly. Our Six foot \"postern\" entered the compartment and stood gazing through the widow. When an officer passed he shivered nervously and muttered inaudibly. Crowds of people flocked in and out of the trains. The percentage of properly dressed people, is small. Everybody bears the stamp of poverty and misery. After a short wait, much to my relief the train steamed out of the station. I had settled into a corner into a","135":" class filthy compartment. Two of us were using crutches and had open wounds, consequently there was little room for resting one’s legs. We numbered seven in all; we suffered in silence. The thought of seeing friends and dear old England consoled us. 7 p.m. Arrived in Berlin. The \"postern\" informed us that we should detrain and proceed to another station. Upon alighting I walked in the rear and took advantage of seeing a little of the Hun metropolis. The station was crowded and the streets in the vicinity were similarly congested. When we had freed ourselves from the first crush the people thinned out considerably. The pedestrians were mostly military; I noticed very few men civilians. The people stared and collected round and not infrequently they spat at us; on the other hand many showed signs of interest and even ventured to speak. These people, the \"postern\" promptly interrupted, so we continued the journey. The Streets were exceptionally clean. I noticed in-\n\nnumerable cafes mostly crowded with soldiers and women. The first café I saw, caused me to stop and look inside, despite protests from the \"postern\". The orchestras were composed of women artists. The music was excellent, especially to one who had not heard the joyous strains of music for ages. I noticed very little food. Smoking appeared the chief enjoyment. Most of the shops were closed with blinds drawn, consequently I was unable to satisfy my curiosity to see exactly what quantities of foodstuffs were purchaseable. The few I did notice however, were quite barren.\n\n8. p.m. Arrived at the second station. I did not record the names at the time. I was unable to take any notes. Moreover German words are not easily remembered. Our train was due to depart at 8.30. p.m. This involved standing about for half an hour. During the time wewaited for the train, crowds collected round us. The piercing scrutiny was very embarrassiang. Several attempted conversation in English but the \"postern\" promptly intercepted. The fact that we were prisoners returning to England was quickly \naccumulated\n assimilated. This, I discovered by the pointing and exclamations of \"Ya! ya\" Achzo\" and a closer inspection. Several passing women spat at us. Others, however showed signs of mutual interest. Collectively, there was a very apparent tone of hatred, I am quite accustomed to this however. The arrival of the train dispersed the train. After considerable talking and rushing about, the \"postern\" escorted us to a vacant compartment. We travelled all night, stopping at several large towns, without receiving food or drink.\n\n2nd. We arrived at Hanover at 6 a.m. We worried the \"postern\" until he finally ran off to the refreshment bar and purchased several cups of coffee, which he carried in his water bottle. The fellow was awfully nervous. We enjoyed the coffee immensely. Fortunately, we had a little food-stuff with us and we happily enjoyed a light meal before leaving the station. (Before leaving Altdamm, we asked for food to suffice until we reached Aachen, but our requests were ignored).\n\nWe continued the train journey and I enjoyed the day’s travelling. En route we passed through Westphalia and Rhineland. The country was gorgeous and looked very prosperous, but the demands from\n\nother states quickly absorbed the local resources. Undoubtedly the major portion of the Hun wealth is supplied by these two states. The people look much healthier, in fact everything is brighter. Food is not however procurable at Railway stations. We passed through Essen in the evening. The town \nwas\n is enveloped by hills and is studded with mines; I counted no less than 20 pits near the line. Many were closed, probably on account of the labor difficulties. Hundreds of women dressed in dungarees, work about the mines and railroads. The trains were staffed entirely by girls who dress in male attire and it is very difficult to detect their sex. The hair is cut short and they wear military caps which add to the masculine appearance. \n\nI saw quite a lot of Essen, which is the hot bed of Krupp and his infernal works. Factories are innumerable. I noticed several troop trains standing near by abundantly decorated with green stuff; they were congested with soldiers, mostly young boys. They looked very dejected. What a contrast between Hun and British troops \"en route\" to the Front. Our boys usually cheer and laugh lustily and happily. The nervous \"postern\" refused to leave the carriage to purchase coffee or obtain water; his only remarks \"Officer, officer\" sickened us. The train finally moved out; after a short journey into the \n\nRhineland we stopped at . We rushed across to another platform to catch the train to Acachen, unfortunately we missed it. \n\nThe \"postern\" almost ran amok. He \"donnerwettered and vefluchtered\" vociferously until his vile temper subsided. He kept exclaiming \"Offizer\". I take it he was afraid of an officer asking where he was going; happily he did not encounter an officer. Griffiths who speaks German, asked him if we might enter a soldiers’ waiting room to wash and have something to eat. This request astonished \"Fritz\" but when Griffiths offered him a few biscuits he submitted willingly. We thoroughly enjoyed the douche, afterwards we spread our goods on the table to exhibit before any trespassers. Much to our delight many Huns passed through the room. They in turn, stopped in wonder when they saw the food stuff. We had consumed the bulk of our supplies during the journey; However we had sufficient for the \n\npurpose. We had eaten little, as we hoped to tantalize the Huns later. The postern made inquiries regarding the trains. He looked dumbdounded when he found that the next would be 5 a.m.\n","136":" He decided to take us to the waiting room, where we proceeded forthwith. The place was horribly crowded with soldiers and women. Whilst the \"Postern\" made inquiries about accommodation for the night, several of the party commandeered a large table and six chairs. We made ourselves comfortable near the doorway facing the foodless refreshment bar. The parcels were duly opened and the food displayed; much to the amazement of the Huns. We procured coffee and commenced the meal eating slowly to prolong the exhibition. The curious people quickly gathered about the table. I heard many exclamation of \"wonnershon\" (wonderful). Several children ran over to me and I could not resist giving them a biscuit each, they looked so hungry and forlorn. A civilian looked intently at a piece of white bread, picked it up and asked permission to hand it round for inspection. The bread was passed round and the people examined it. Their astonishment was profound. Griffiths saw that no one ran off with the bread.\n\nTo continue the display, one man placed his feet on the chair, the boots attracted every eye and many questions were asked regarding their origin. When told the modest English cost, the people were astounded. We concluded the exhibition by demolishing every morsel of food; lit cigarettes and awaited further orders from the postern. We sat in the waiting room for hours; towards midnight we were conducted to a small room and told to remain until called next morning. Despite the cold draught and hardboards I managed to sleep.\n\n3rd. 4 a.m. I was awakened by a kick in the ribs, upon looking up I saw the postern treating my comrades in a similar rough manner. A few minutes later a Hun under-officer entered bowing and scraping, endeavoring to explain that he conducted all English officers to Aachen.","137":" We entrained and resumed the journey. The only interesting feature en route was the River Rhine. A civilian entered from an adjoining compartment and conversed lucidly in English, he asked up to sing a rag time\n","138":" which we declined to do. I asked him if he had ever visited England, he replied in the negative, stating that he had been taught in a Berlitz school. He also told me that English was a compulsory course in all schools. The journey to Aachen was very fatiguing and I suffered extreme pain; I was indeed glad to detrain. We received pronounced cordiality in Aachen, obviously, owing to one being exchanged. We were promptly taken to a tram. The journey through the city lasted about half an hour; it was very interesting. After alighting we walked some distance and entered a huge building. We were allotted to wards very different to any I had seen before. I was indeed, surprised when I saw the white counterpanes and spring mattresses. This was a most appreciable change and quite heavenly to we prisoners. Approximately twenty had arrived before us so we settled down to await further orders. Several Hun orderlies entered and spoke to us in fairly intelligible English, they appeared to be quite mutual. Circumstances alter cases no doubt. Dinner was served at noon, macaroni and horseflesh. The food was quite palatable and I think, most of the party enjoyed the meal. Personally I thought it an excellent treat compared with any previous fare. 2 p.m. to 4 p.m. walking exercise in the court yard, which is dotted here and there with posterns and surrounded by a huge iron spiked fence. According to the orders posted in the wards prisoners were permitted to exercise in the yard for two or three hours daily. Towards evening additional parties arrived increasing the total to about 700, including 41 officers. A medical and surgical Commission site daily. Immediately the board is finished those marked for Switzerland, Holland or England \nwith care may be,\n are taken to the borders. The Commission is composed of two Huns; one Swiss and one Dutch doctor. 4.30. p.m. tea; soup and black bread, but eatable. During my tour of the building I encountered many Huns who addressed me in excellent English. I asked one Hun why we received better treatment and food in Aachen than in previous hospitals and camps. (The idea is obvious). He merely stated that Germans returned from England and Holland passed through this hospital also the local food supplies are less restricted than\n\nin other provinces. The Hun asked many questions regarding the war and English opinion; I refrained from answering such questions. I enjoyed a glorious night’s rest and awakened early feeling refreshed and happy. \n","139":" a.m. coffee and two slices black bread smeared with honey substitute. The substitute tastes much like treacle flavored with ants. Notwithstanding I enjoyed the change. Later, orders were read. The discipline is very severe and rigorous. \nLater orders were read.\n This is tolerable whilst waiting to cross the border. Any breach of discipline is punished by return to camp. Needless to say all men \nimminently\n adhere to orders. \n\n4th. 9.30 a.m. I was taken (with 25 men) to the examination room for classification. I stripped, entered and stood before the Hun on my crutches. he examined my knee and asked if I could bend it, of course I replied in the negative and prepared for his trial. He promptly seized the leg in a grip of iron and tried to move the knee, the pressure gradually forced my knee, when I felt him moving the joint I wildly threw my crutches on the floor and shouted, at the same time jumping several feet in the air. This action startled the Hun and he allowed me to pass and called to his orderly \"Ainse\" meaning England.\n\nI quickly disappeared behind the men waiting for inspection and persuaded an orderly to apply a new dressing. I eventually reached the ward and announced my luck to all present. My joy was indescribable. I had successfully passed the final examination, subsequently liberty and freedom. Many officers and men failed despite -- their previous successful tests in hospitals and camps. 41 officers appeared for exchange, unfortunately only 4 succeeded. Hundred of men were returned to camps. Many using crutches and sticks. The examination was very strict, not a few were given anaesthetic to have stiff limbs tested. Despite their failure the rejected men cheered and wished us luck. I shall never forget the expression on the faces of the unhappy men; returning to Hun misery and starvation. Whilst exercising in the yard during the afternoon a postern stopped me and motioned me to walk aside, clear of the men in the yard. He addressed me in French and told me that he was a Belgian civilian. According to his story, he and his brother were seized by the Huns in 1914 and \n\ncompelled to wear Hun uniform. His brother successfully escaped some months previous to this date; this man however, was recaptured whilst attempting to cross the Dutch frontier. His correspondence and parcels were confiscated, consequently he was unable to communicate with relatives and friends in Belgium. He stated that the Huns kept him under keen observation and the food received was not nearly sufficient to sustain his impaired health. Before we finished conversing, he suddenly told me to move of as someone was watching. Many Huns disguise in that manner, but I am quite convinced that this man is genuine.\n\n5th –","140":" Patiently waiting for orders to proceed to the frontier. Aachen is only a few miles from Holland, but exchange trains take an indirect route. Hence the indefinite time of waiting. Escape from here is impossible owing to the myriads of posterns and troops stationed in the district. Until recently Mannheim was the chief exchange station. British airmen have caused considerable damage to Mannheim, consequently all important military persons have evacuated the town. My only diversion is watching the people passing to and fro in the streets below the building. Like all German towns Aachen is quite destitute of her civilian population. The exchange hospital is a magnificent building; in pre-war days it was an Engineering Institute. The joyous news came to us on the","141":" All walking cases were marched to the station and we crutch cases were conveyed in ambulances. The party consisted of one hundred and fifty for internment in Holland and thirty two for exchange to England. Pilgrim of the 51st Batt and myself were the only Australians for repatriation. Whilst standing outside the Aachen station – awaiting further instructions, many people crowded round us. My impression was that they too would like to join us. Eventually we entrained and steamed out amid cheers and shouts from the men for release. The Huns resented our jubilent display and promptly demanded silence, the order was willingly obeyed. The slow uninteresting train journey, continued until we reached a small town, one and a half miles from the frontier. I thought the journey would never end. The time was very dull. Upon receipt\n\nof papers from the escort, several Dutch officers joined us and we continued the journey. Every head was pushed through the windows, and eyes searched the country for signs of the barrier separating Holland from Hunland. Suddenly, Hun posterns stationed on a road facing Holland became visible. We all cooeed and shouted excitedly. The train seemed to crawl across the border; finally we passed posts painted in Hun colors and then the Dutch. The cheers echoed and re-echoed, I thought some of the men would jump through the windows in their excitement.\n\nWe were in Holland, free, happy and independent. No more Hun tortures and starvation, it seemed unreal, a dream, try as I might I could not realize being free. The Dutch people cheered and welcomed us cordially. We detrained at and entered first class compartments in the Dutch train. The Huns had the audacity to offer their hands when departing for Germany. It was our turn to say \"Sweinris\" (Swines). Several English and many Dutch ladies, supplied us with refreshments and \"Smokes\" and English literature, chiefly papers and magazines. My happiness during those few minutes, is indescribable. I felt childish and ignorant and very much out of place. We travelled through the south of Holland, and were welcomed with great enthusiasm and cordiality everywhere. Unfortunately I have forgotten the names of an English voluntary lady worker and a Flying officer, who welcomed us and attended to every detail essential to our comforts. The lady has sacrificed home and comforts to assist the men interned here. The officer suffered many months in Hunland, and is now interned. We eventually arrived at Rotterdam. The men for internment, detrained, and we for \"Blighty\" were taken to the wharf and treated right royally by Dutch nurses. Immediately after tea, I retired, and enjoyed a good night’s rest.\n","142":" to","143":" During the two days, I thoroughly enjoyed the Dutch hospitality, I fed well and basked in the glorious sunshine whilst patiently waiting for the arrival of hospital ships to convey \nus\n me to England. Many English ladies visited us and loaded us with chocolates, books and other nice things. Everything possible\n\nwas given and done towards comforting us.\n","144":" Three Dutch hospital ships arrived, and unloaded hundreds of Huns. During the day the Englishmen were forbidden to speak or approach the Germans. The Huns were welcomed by several Hun women, but the feeling of happiness was lacking. The Dutch people treated them quite indifferently. Towards evening the last party of Huns disembarked and the Englishmen embarked. We were comfortably distributed on the three vessels.\n","145":" 6 a.m. Sailed within a few hours; the vessels passed the Hook and entered the North Sea.\n","146":" We passed many British vessels. Those within a short distance signalled to us. The English cheers poured forth from every vessel, causing one to feel intensely happy. The sea was calm and the sunshine was ideal. I have never enjoyed a sea voy age so much in all my previous travels. We anchored off Boston in the evening. Unfortunately the low tide preventing us embarking. I think everybody slept peacefully and content.\n","147":" Tenders came alongside, and we were soon flying through the water. Sirens tooted and whistles cock-a-doodled, amidst cheers from the wharf and tenders. Within a few minutes, we were safely landed on the shore. I was thrilled with happiness and pride. Try as I might it is impossible to describe the happiness and joy that I so gladly experienced. \n5 a.m.\n Free, happy and amongst human beings again. We were welcomed by the mayor of Boston and catered for by the ladies of that port. The military authorities escorted us to a hospital train and several hours later, we detrained at Waterloo, where we received a real English welcome, prior to admission to King George’s Hospital, London.\n\n"}}