{"Document Name":{"0":"Diary_0433","1":"Diary_0433","2":"Diary_0433","3":"Diary_0433","4":"Diary_0433","5":"Diary_0433","6":"Diary_0433","7":"Diary_0433","8":"Diary_0433","9":"Diary_0433","10":"Diary_0433","11":"Diary_0433","12":"Diary_0433","13":"Diary_0433","14":"Diary_0433","15":"Diary_0433","16":"Diary_0433","17":"Diary_0433","18":"Diary_0433","19":"Diary_0433","20":"Diary_0433","21":"Diary_0433","22":"Diary_0433","23":"Diary_0433","24":"Diary_0433","25":"Diary_0433","26":"Diary_0433","27":"Diary_0433","28":"Diary_0433","29":"Diary_0433","30":"Diary_0433","31":"Diary_0433","32":"Diary_0433","33":"Diary_0433","34":"Diary_0433","35":"Diary_0433","36":"Diary_0433","37":"Diary_0433","38":"Diary_0433","39":"Diary_0433","40":"Diary_0433","41":"Diary_0433","42":"Diary_0433","43":"Diary_0433","44":"Diary_0433","45":"Diary_0433","46":"Diary_0433","47":"Diary_0433","48":"Diary_0433","49":"Diary_0433","50":"Diary_0433","51":"Diary_0433","52":"Diary_0433","53":"Diary_0433","54":"Diary_0433","55":"Diary_0433","56":"Diary_0433","57":"Diary_0433","58":"Diary_0433"},"Date":{"0":"unknown","1":1076.0,"2":1077.0,"3":1078.0,"4":1079.0,"5":1080.0,"6":1081.0,"7":1082.0,"8":1083.0,"9":1084.0,"10":1085.0,"11":1086.0,"12":1087.0,"13":1088.0,"14":1089.0,"15":1090.0,"16":1091.0,"17":1092.0,"18":1093.0,"19":1094.0,"20":1095.0,"21":1096.0,"22":1097.0,"23":1098.0,"24":1099.0,"25":1100.0,"26":1101.0,"27":1102.0,"28":1103.0,"29":1104.0,"30":1105.0,"31":1106.0,"32":1107.0,"33":1108.0,"34":1109.0,"35":1110.0,"36":1111.0,"37":1112.0,"38":1113.0,"39":1114.0,"40":1115.0,"41":1116.0,"42":1117.0,"43":1118.0,"44":1119.0,"45":1120.0,"46":1121.0,"47":1122.0,"48":1123.0,"49":1124.0,"50":1125.0,"51":1126.0,"52":1127.0,"53":1128.0,"54":1129.0,"55":1130.0,"56":1131.0,"57":1132.0,"58":1133.0},"Entry":{"0":"\n\n","1":"\n\nThurs 23rd\n\nCamels arrived at 6.30 this morning & took all gear that is to go by train to Salmana. Col. Granville is to be married shortly & over £ 50 was subscribed from the Regt to buy a wedding present, he is to be married to a Miss Beveridge & by the noise in the Officers Mess tonight they appear to be drinking a few healths. A message came through tonight granting \"Granny\" 3 weeks leave from the Commander in Chief. On account of the quantity of work the Sigs a getting now, I am doing the 6 to 10 PM shift. A parade of pack horses loaded was held this morning as the C.O. said the horses have been too heavily packed.\n","2":"\n\nFri 24th\n\nRolled our blankets as soon as we rose this morning, our camels have been cut down from 3 camels to 2 for Head Qrs. The C.O. of a Regt. has a camel for himself & the rest of the Officers have a camel to two Officers. Colonel Granville left this morning for Cairo, where he is to be married, each sqdn gave him 3 cheers as he went. Major Irwin is in command while \"Granny\" is away. At 10.30 this morning we watered our horses & saddled up, filed off the lines to the East of the Hod to wait for a section of the Imp. Camel Corps to come along as they are to take over. We waited till 1.30 & then decided to go without handing over, before going I rang up the Tommies at Gamal & sent a\n\n24-11-16\n\nmessage through them to the Anzac Mtd Division Bir-El-Abd. One horse died about 4 miles from Willegha from Colic. We were coming through Tommies camps all the way & it was dark before we arrived at Moseifig where we are to camp for the night; we have only 16 Fantassies of water (8 gallons in a Fantassie) to last us till tomorrow night, this allows us a waterbottle per man; Watered our horses at 8.30 tonight.\n","3":"\n\nSat 25th\n\nReveille at 5.30 this morning & left Moseifig at 7. oclock stopped for dinner at Bir El Matha & found the water supply very poor, taking the Bde 3 hours to water. We then went on to Arnussi. The 2nd Regt. arrived early & supplied the outposts for\n\n25-11-16\n\nTonight; we got in at sundown & are not watering our horses tonight as they had a drink at 3 oclock & the water supply here is not too plentiful yet. After tea Laney & I went down to the Hod where Bde Head Qrs are & heard the Emperor of Austria died a few days ago. A large air raid is expected within the next few days; We are within 22 miles of El Arish here & the maps we have been using are of no further use to us. A few miles to the South of us is a large sandstone ridge which is impassable to troops.The troop of Military Police are attached to Head Qrs at present for rations. No lights are allowed in this Camp after dark. The sand dunes we crossed this afternoon were very steep.\n","4":"\n\nSun 26th\n\nThe 3rd Regt. being duty Regt today are having a rather rough time of it as they have to find 4 Outpost during the day & 1 ½ Sqdn of men out on Outpost tonight. We had to shift our horse lines a few yards today & now have the troop of Military Police doing Head Qrs pickets fatigues etc. a snake was killed tonight in the Orderly room they are fairly plentiful about here especially the deadly asp. The Turks came into our Outposts last night, we could see their tracks. they came up on camels & crawled right up almost on to the Outpost. Was called down to Bde H.Q. tonight to get orders for putting Sigs. stations out tomorrow.\n","5":"\n\nMon 27th\n\nSaddled up before breakfast this morning & went out & posted 4 helio stations, the country around the camp is very heavy on horses, the sand very loose & soft & the sand dunes very steep, am sending out 2 telephone stations on Outpost tonight & have to work one phone from camp so the Sigs are having a fairly rough time but I am making use of the supernumeries Wall (Col Granvilles Batman) left here today to go to Port Said he is to meet \"Granny\" there, \nA large range of steep\n RSM Frost was also out this morning posting men on Outpost he caught a Turk who was coming in to give himself up. Jack Wright who was Acting RSM went back to C Sqdn today.\n","6":"\n\nTue 28th\n\nSergt Hill was sent to this Regt from B.H.Q. this morning as a spare Sergt waiting for a vacancy, & has been put on Head Qrs & is taking charge of stables fatigues etc. & has relieved me of a lot of work. I have nothing to do now but supervise signallers. Received orders to have 5 Helio stations out tomorrow as we are duty Regt again. Sergt Browne went into Mazar today to get G.T.T. Canteen stores we ordered from W.O. Frost before leaving Willegha, he arrived back before dark with a good supply of goods. Gen. Cox went to Gererat today, Leask & Mann went with him for Signalling work, the Turks have evacuated Gererat & it will be our next camp.\n","7":"\n\nWed 29th\n\nThe Helio stations went out with the Outposts at 6 oclock this morning to find the 3rd Light Horse were finding the Outposts so our men came back. Jack Hillier & Bult went to \"255\" with a troop on patrol at 9 oclock, saddled Roger up soon after breakfast & rode down to the Hod (Bde H Q) had a yarn to Lieut Smith & put the morning in reading the Anzac Book. I believe the Heads do not want the Turks to evacuate El Arish & if they fancy we are going to attack with only a small force they will get a surprise. We have orders to move to Gererat on the 1st. We never see a sign of an enemy plane & ours have orders not to bomb any of the Turks first lines.\n","8":"\n","9":"\n\nAt 6 oclock this morning I went to the Central Helio station to see the Outpost stations were properly posted & to get their report. Roger objected to going out so early without company & gave a good exhibition of rooting. The day before yesterday our secret service agent (a Bedouin) went out through our lines to pay the enemy a visit & bring back information, he proved a good friend before the battle of Romani, bringing in news of just what was going to happen: I am having a very easy time here & do just what pleases me & have no parades at all to attend.\n","10":"\n\nFri 1st\n\nThis morning Edwards & I went out to Gererat with a troop of A Sqdn as body guard to Gen. Cox & 4 staff Officers belonging to a Welch Division now marching from Kantara to Mazar, we found Gererat a depression in the ground with no sign of palms & a party of Australian Engineers trying to get a good water supply. The Welch Officers rode camels out, we arrived back in camp at 1 PM, had Bains from D.A.D.O.S. here for dinner. The Adj (Gerbill) told me this afternoon that we would have to find the observation posts tomorrow & after 8 oclock tonight he discovered that we would not have to find it. that is the second time he has discovered a mistake, which puts me to a good deal of unnecessary work warning men.\n","11":"\n\nSat 2nd\n\nAt 8.30 this morning a dozen Australian belonging to the Camel Corps passed this camp escorting one Bedouin on a camel & several on foot, making for Head Qrs at Mazar. This morning I sent Les Olson \nto bring out\n to Mazar to bring along 8 miles of wire & a bundle of flag poles sent on by train, he arrived back with the poles but said there is no wire there, so that means a trip for me tomorrow. Lt. Garbett & Maj. Irwin went out today (East) & were within 12 miles of El Arish & could see the spire in El Arish. A Turkish \nOutpost\n patrol went within half a mile of them & quite close to one of our Outposts who have received orders not to fire on them, we believe there are about 8,000\n\nat El Arish or this side & we do not want them to retire, apparently our heads appear to think we can take them all prisoners if they wait till we are ready;\n","12":"\n\nSun 3rd\n\nAt 8 oclock this morning Jack Hillier & I left Arnussi & went into Mazar passing a large number of Infantry & Artillery on the way amongst these are three 60 pounder long range guns; We found Mazar quite a little township & a very busy centre, after a good deal of inquiry I found where the spare goods of the 1st Bde was dumped but no wire so took the Sergt (a Tommy Artilleryman) with me to the dump on the platform\n\n3-12-16\n\ninquiries from the R.T.O. brought forth nothing, so I rummaged through the gear at the dump & eventually came across 24 coils of wire D1 belonging to the 52nd Divisional Sigs but they convinced me that it was theirs. Bought a good supply of tinned fruit etc. then went to Ordnance saw Bains & at last found the wire amongst some 2nd Regt stuff at Ordnance, coming back to Camp we passed an old Tomb & several fresh Turkish graves. Apparently they were killed when we attacked Mazar some time ago. Just before we arrived in Camp a Taube dropped bombs on Div. Head Qrs (Bil El-Abd) & our Anti Air Craft guns opened fire & several of our ‘planes rose for battle. One of these (a Martinsyde) was soon giving chase & drew up close enough to fight & their machine guns brought\n\n3-12-16\n\ninto action: our plane had the position & the Taube had to wheel along the coast to save herself, she tried to double back but two of our ‘planes coming behind drove her out to sea where they say they brought her down; the bombs dropped only killed one horse. We shift camp tomorrow.\n","13":"\n\nMon 4th \n\nLeft Arnussi at 11 oclock this morning & went North about 3 or 4 miles arriving at a newly made well at 1.30 & put our horse lines down half a mile East of the well, this place is not shown on the map & is three miles from Gererat, where the rest of the Brigade has moved to. Put out an observation post as soon as we arrived & after dinner ran out two telephone lines where\n\n4-12-16\n\nthe outposts will be tonight. Two troops will be on Outpost every night & that means 9 Signallers on ‘phone duty every night besides working the day ‘phone to Bde & day observation posts & patrols, so the Sigs will have plenty of work.\n","14":"\n\nTue 5th\n\nRode up to the Observation Post this morning to see what stations we could get into communication with. The Bde Major (Chisholm) paid us a visit to get the bearings of our Camp. I put in a couple of hours with him & told him I intended to ride over to Arnussi this afternoon as we could not raise them with Helio; he said it was a good idea. After dinner Athorn & I\n\n5-12-16\n\nwent to Arnussi & found it deserted, the New Zealanders who took over from us left last night. We watered & fed our horses there & arrived back in Camp before sundown & arranged for a half limber to go to Mazar tomorrow to take in some spare Signalling stores I can do without & bring back wire, we are not allowed lights after dark. A Troop of the 2nd Regt with some Engineers go out tonight to Wadi El Arish to tap for water; at Gererat water is 20 ft below the surface & there is a difficulty of getting water at all further out along this flank; the Troop going out tonight are on a risky job as they will be right among the Turkish Outposts & patrols & only a few miles from El Arish itself. An enemy ‘plane dropped 3 bombs today on the 2nd L.H. Regt while they were watering but did no damage, she did not go within range of our Anti Air Craft guns at Mazar.\n","15":"\n\nWed 6th\n\nCould not get a limber today & put the time in knocking around the Camp. Sergt Partridge is under open arrest & has to report to Bde H.Q. this morning for refusing innoculation.The troop from the 2nd Regt with Engineers who went out to tap for water returned this afternoon & reported good going for horses a little out & found the ground too hard to take the drill & considers the outlook for water is very bad along the flank; a good number of Bedouins followed them several miles coming back, they sighted a Turkish patrol but did not clash; A patrol goes to Aabash from here daily, they go in 10 miles & only 8 from El Arish & can see it plainly through glasses. Turkish troops\n\n6-12-16\n\n& entrenchments can also be seen from Aabash. The Sigs are now getting more work than they have ever had before. Capt Weir is due back tomorrow from England.\n","16":"\n\nThurs 7th\n\nAthorn & I went to Mazar today accompanied by Cpl Harris who has a couple of inventions to improve the Lewis gun, & apparently Division thinks it will be a success as they asked for him to be sent in. We hit the Railway line at Kilo 127 & from there had a good road in to Mazar. I took 1450 piastres in with me to buy goods but could only get 430 piastres worth, coming home we \nto\n struck right in a direct line for our camp cutting\n\n7-12-16\n\noff a couple of miles & found it good going & was back in Camp at 2.30. The Bedouin spy that went out a few days ago returned today & we supplied an escort to see that he is not molested on his way to Div. Head Qrs. Have to keep up communication with 133 (Imp. Camel Corps) during the night with lamps, they are about 5 miles to the East of us.\n","17":"\n\nFri 8th\n\nHeard on good authority today that our Intelligence man brought in the report yesterday that there are five 9 inch guns besides smaller batteries at El Arish, a Turkish army of 120,000 men & 20,000 German Cavalry, & a \n\n8-12-16\n\nlarge Army expected there within a week so things look like a lively time ahead. Put in the time this afternoon on the observation post. A parcel mail arrived today but will not be sorted till tomorrow. Patrol, escort parties etc. are detailed daily here & the Outpost work at night but it practically the same routine daily.\n\n9-12-16+\n\nSat 9th\n\nHad no luck with parcel mail today but the limber was sent over to Kilo 127 again this afternoon & returned with a couple of bags of letters & papers. Reports tonight state that enemy are busy & for patrols to El Aabash to be careful. An enemy ‘plane flew over us today very high\n","18":"\n\nmaking East, she was reported from Bayur & one of our machines was up to meet her but could not see her as there were a good many clouds. I came on the phone from 6 to 10 tonight as we are having a hard job to find Sigs to carry on, had to send 3 Sigs out with patrols this morning; at 9.45 tonight a ‘plane flying west from El Arish caused \ncaused\n a stir. She dropped two flares to the East of us probably at \nMazar\n Salmana or Bil El Abd.\n","19":"\n\nSun 10th\n\nHeard this morning the ‘plane that came in last night was one of our which went on a trip to Palestine, the flares were dropped to find the landing ground; Church parade was held this morning & an\n\n10-12-16\n\ninspection of the horse lines by Gen Cox. I put in the morning at the Observation Post; Browne & Frost went to Mazar this morning with the pack horse & bought back a big load of tinned goods for us. Pack horses go in daily for canteen goods & we fare very well, we have been getting very poor rations during the last few weeks & would be in a bad way if we failed to get canteen stores; An enemy plane caused us to stand to our horses again today she came from Mazar way & had quite a number of shells pelted at her as she passed Mazar, she dropped no bombs; there is a likelihood of some long \"stunts\" very shortly but we cannot make a camp farther in as the Engineers cannot strike water. \n","20":"\n\nMon 11th\n\nThe Anzac Troops took a pack horse in today for canteen stores & we had Mr Frost with us for dinner. An enemy ‘plane came over about dinner time & had us standing to our horses, she dropped 3 bombs 300 yards from the 3rd Regt lines but did no damage, she was too high for accuracy. Snowy Wride returned from the School of Instruction today & reports a good many batteries of Artillery & Scottish Infantrymen on the road out. The Infantry march from Kantara to get fit, they march on wire netting rolled out along the desert & it makes a very good road to march on. The gunners at Mazar boast they scored a hit with the third shot yesterday damaging the tail of the ‘plane.\n","21":"\n\nTue 12th\n\nAnother enemy ‘plane came over today & dropped three bombs at the 3rd L. H. Bde who are camped at Malha two did no damage, the third fell on a horse & killed him but fortunately it failed to explode otherwise it may have done a good deal of damage. Frost, Lindsell & Browne went to some ancient Roman ruins on the Coast today to get some photos & say they are well worth going to see; Last night I received orders to try & get in communications with Div. Head Qrs at Mazar this morning while trying to raise them we struck a sig station who gave their call as LF, as that is the 6th Regt call I\n\n12-12-16\n\nnaturally concluded they were the 6th Regt & did not find out till this afternoon when we called up to enquire how some of our friends were doing that they were Lancastershire Fusiliers. There must be a mistake somewhere as no two stations should have the same call in the same Division; I have been doing 6 to 10 shift on the ‘phone every night lately & tonight got word from Bde that a test message was being sent from Mazar to Hill 133 tonight & to try to intercept it, but found we are too far South to get enough light at this distance & had a trip up to the Observation post for nothing; C.O’s of all units had to report to BHQ tonight so there must be something doing shortly.\n\n13-13-16\n","22":"\n\nI received orders this morning that the 8th Royal Scots were to connect on to our line as they are well digging between us & Bde. I took a ride to Bde just before dinner & camped at the Scotties camp on my way back & found they had connected on to the 127th Brigade line as it ran right by their Camp. Tomorrow is to be a big Field day & we expect to see something interesting here; Major Smith in charge of a Troop from C Sqdn is going to El Arish tonight with Engineers to try again to find water, he took his 3 Sigs with him & expects to be away 48 hours. I was given 3 more supernumeries from A Sqdn today.\n","23":"\n\nThurs 14th\n\nSeveral of our ‘planes have been busy this morning dropping smoke bombs directing theTroops who were making a sham attack from Arnussi to the North of us & it was surprising to see the number of Troops taking part; We had 2 Bristol ‘planes & one Martinsyde flying very high all the morning to chase away any Taubes that may come along. but at 2 oclock the manouvres finished & our ‘planes disappeared & a few minutes later an enemy plane came over us from the West & dropping 3 bombs at us doing no damage the nearest bomb dropped 200 yards from us. General Chauvel is back & was present at the operation today.\n","24":"\n\nFri 15th\n\nAt 10 oclock last night orders came through from Bde for us to \nmove\n move to Gimel at 11 oclock tomorrow morning so we were busy enough this morning cleaning up the camp; got away to time arrived at Gimel at 1 oclock to find it nothing at all but a few Tommy Engineers at work digging wells for us; The Signal Troop had already laid the line down but were bad judges of where our camp was to be & I had to run out another mile of wire but we lost no time in getting in touch with helio & it was \njust\n well we did as we found the line broken when we connected up. I went back\n\n15-12-16\n\nalong the line & met the linesman from Bde H.Q. repairing a break about a mile from Bde. sig Office, it was then dark & I had 3 miles to come back over strange country but I took good care not to get too far East & eventually found half a mile West of the Camp & was here halted by a Tommy Outpost, was having tea when the line broke again so Olson & I mounted up & went out again & found the telephone line about 2 miles from Camp tapped in & found the Bde linesman had mended it so we returned arriving back in camp at 10 oclock tonight. The troops had to take \n\ntheir horses to railhead (2 miles) to water this afternoon as the wells are hardly ready.\n","25":"\n\nSat 16th\n\nEarly this morning our patrol captured a Turk who apparently has had enough fighting & was coming in. I covered the telephone line across the camel & horse roads today & have a lamp aligned on Bde H.Q. in case the line breaks tonight. Today we received a large quantity of Xmas gift goods which were very acceptable. From our observation post we can see the Spire of El Arish & Turkish Outpost on the hills through the Telescope. I forgot to report that Major Smith with the Troop of C Sqdn men returned from Wady El Arish on Thursday night after a very successful trip. Early Thursday\n\n16-12-16\n\nmorning they passed between a Turkish Outpost & Camp & picked up two Turkish \"mess orderlies\" who were washing \"dixies\" at the well. They found plenty of water on the Wady released four pidgeons they took with them reporting they were on the Wady & found water & within an hour the pidgeons had returned to Kantara & the news sent on by cable to the Regt. They were fired on coming back by theTurkish \npatrol\n Outpost doing no damage, the two Turks & 5 Bedouins were brought in. 1\/6 Manchesters ran a line across from their Outpost to us today we have thousands of English & Scottish Troop behind us, but at present we are the front line, we expect to be here only a few days. This afternoon an enemy\n\n16-12-16\n\nplane was sighted & the Mazar guns opened fire & 3 of our machines rose the Taube dropped her bombs doing no damage & ran, one of our planes though much lower gave chase they exchanged shots at long range & after they were out of sight we could still hear their machine guns at work, our ‘plane returned half an hour later flying very high.\n","26":"\n\nSun 17th\n\nThis morning Gen. Cox inspected the horses & lines. 12 of our ‘planes flew over & this morning landed on the beach about 3 miles to the North of us to wait for the Taube which came over soon after midday, our planes gave her a good\n\n \n\n17-12-16\n\nchase but could not catch up to her. Bde ran out another line to us today. I believe it was very amusing this morning an English Colonel came over with Cox & wanted 3 Sqdn of Light Horse to protect working parties in from of our lines.Cox blew him up properly & told him a Troop was quite sufficient; He then wanted to have our camp shifted as he said we interfered with the right flank of the 127th Bde & Cox told him to go to Jericho.\n","27":"\n\nMon 18th\n\nJimmy Leask & I decided to go back on to the Coast & have a look at the old Roman ruins today & left here at 8 oclock, had a very interesting trip coming upon an old Bedouin fishing\n\n18-12-16\n\ncamp on the salt lakes, there were about a dozen old boats in good order & fishing nets lying on the beach as though the Bedouin had left in a hurry. The New Zealanders were camped here for some time, the lakes are full of fish & we sighted a large fish very close & in shallow water. I jumped off my horse & shot it through the eye, we then cut its head off with a bayonet cleaned it & brought it back with us we saw the remains of one of our planes burnt on the beach but we decided it would be too late when we returned if we went on to the ruins so we fed our horses, had dinner & came back arriving in Camp soon after 4 oclock. Our ‘planes came over to the \n\n18-12-16\n\nsalt lakes again this morning to wait for the Taube but he beat them again as he flew over so high in the air that he looked like a speck, our ‘planes went up after him but could do no good; The Bedouin (Secret Service) who has proved such a good friend to us right through was sent up on the train today & we had to send a horse to Kilo 128 to meet him, he curled up by the orderly Room & is sleeping here tonight.\n","28":"\n\nTue 19th\n\nOur black friend left us at 6.30 this morning & made a bee line for El Arish received a cable from home today saying Jessie would arrive\n\n19-12-16\n\nat Aden on the 4th January so I put in an application from the 3rd till the 10th & will meet her at Port Suez if possible. This afternoon Lindsell & I took a trip over to B.H.Q. & it is rumored there that we all go on next Thursday, so we hope to have any scrapping we may have for El Arish before Xmas day. All gear we cannot carry on horses goes back to Mazar tomorrow & only a spare shirt & pair of socks are allowed each man; I have managed to bring the 4 Sig. Panniers along to here but will send them back tomorrow as they are unnecessary; Two Taubes caught our men napping this morning coming over at sunrise dropped a load of bombs each & then made back, have taken the ‘phone till 12 oclock tonight to write letters.\n","29":"\n\nWed 20th\n\nHad orders early this morning to move to Gererat as the 3rd Bde is coming here to Gimal, we arrived at Gererat at 1 oclock this afternoon & just got settled when we were told we are to start out at 6 oclock tonight & are to attack El Arish early tomorrow morning., we have been kept on the bustle all day we are only allowed to take a pair of socks & a spare shirt with us & the rest is being sent to Kilo 128. I have put what signalling gear we cannot do without into 2 panniers & sending two back; Sergt Browne who does all the QM work for Head Q stayed at Gimal till sundown which gave us a good deal of extra work.\n\n21-12-16\n\nThurs 21st\n\nWe left Camp at 6 clock yesterday evening formed up with the 1st Regt leading, 2nd next & 3rd last C Sqdn of 1st Regt was the advance guard as usual. We had a very trying nights ride as we had all been on the go \nfrom\n since \"stand to Arms\" at 5 oclock yesterday morning, just at daybreak we struck the Wadi one mile south of El Arish crossing the wadi we spread out & soon had a large circle around the town, three Turks on camels trying to get away found themselves inside the screen & made back to the town where they surrendered, the Regiments took up positions on the hills a mile or two to the East of El Arish\n","30":"\n\npickets were sent into the town & find it is deserted so far as troops are concerned though all the civilian population are carrying on just the same as usual, a good many Bedouins on camels have been rounded up during the day; At 10 oclock this morning George Shephard & Struthers were down swimming on the beach, apparently a mine had been set for bathers for after the explosion only very small portions of flesh could be found & both lads are missing, the mine may have been laid as the Turks have been led to believe that a force was to be landed here, the mine was one of the biggest I have yet heard; Had a \n\n21-12-16\n\ncouple of hours sleep this morning & at 2 oclock shifted our position from a village we were camped by to the range of hills & ran telephone lines to each of the Squadrons & connected up with Bde. No one is allowed on the beach now. El Arish from where we are looks to be a lot of white building with the mosque with a high spire on it in the centre, running down to the beach is a large palm grove with several mud villages scattered about. The water is good.\n","31":"\n\nFri 22nd\n\nA large number of loaded camels were captured last night by our patrols & outposts; this morning two destroyers & a cruiser are in quite close.\n\n22-12-16\n\n6 of our aeroplane heavily loaded with bombs flew over us making East, these were followed later by 5 others & they gave the Turks at Maghaba (18 miles South) a rough time mine sweepers have been at work all day & exploded six mines, two men were killed & 3 wounded they discovered the mines were exploded by trip wire on the beach; this morning Sgt Edwards Lindsell, Bat Pearson & I went on an exploring party through the town of El Arish. We mustered up what little Arabic we knew & got along fairly well & managed to buy a few oranges at 2 ½ each & the natives were also asking 1 PT (2 ½) lack for eggs so we decided to leave the eggs alone, paid the mosque a visit & found it\n\n22-12-16\n\npacked with natives apparantly a service was in full swing we took several snapshots & it was 1 pm when we got back & Taube flew over very high this afternoon. received word at 4 oclock this afternoon that we are to go out to attack the Turks at Maghaba leaving here at 5.30 this afternoon; found the rations could not be drawn before 6 oclock & it was decided to issue them out to the Brigade where they had formed up.\n\n23-12-16\n\nSat 22nd\n\nIt was after midnight last night before we left the vicinity of El Arish, the night was very cold & were given 10 minutes walk every\n\n23-12-16\n\nhour & it was looked forward to, to warm us up; We followed the Wady all night & at daylight pulled up just north of Maghaba. Here we met the I.C.C. & the New Zealanders & 3rd L.H. Bde soon came on the scene, also a Battery of Artillery, the Indian Camel Corps also a Battery of Indian 9 pounders. The 1st Regt was in reserve. The New Zealanders & 3rd Bde commenced the ball rolling by opening out & galloping around the Turks position, & the 2nd & 3rd Regt of this Bde soon followed; 4 of our aeroplanes was out early & gave us the exact position of the Turks by dropping bombs on them; It was a fine sight to see the Troops galloping into position & the rattle of machine guns\n","32":"\n\n& rifle fire soon followed & our battery of Artillery lost no time in picking up the range giving the two redoubts a very hot time of it, an hour after the fight commenced we were in possession of the mud houses of the village, but the Turks fought well from the redoubts. At 11 oclock the Battery of Indian mountain guns (9 pounders) came into action taking up a position within one hundred yards of where we were waiting in reserve due North of the village & it was a treat to see the way the Indians worked. At midday our Ambulance waggons galloped up to the firing line to pick up a few wounded & Abdul gave us another instance of fair fighting as he \n\n23-12-16\n\nstopped firing in the direction of the Ambulance. The Turkish Artillery was in positions in the steep hills at the South of the Camp & out of range from where we were they kept up a constant fire on the troops attacking the redoubts but did little or no damage. At 3 oclock C Sqdn was sent out to attack the Redoubts from the back, but they did not fire a shot as both Redoubts surrended as they came into position. C Sqdn with both Col Granville & Major Smith pushed on South, with a Sqdn from each of the other Regts to secure the guns in the hills, these they captured trying to get away; Prisoners (176) & 3 officers) came up \nto\n under escort at 4 oclock & at 6 oclock the remainder\n\n23-12-16\n\ntotalling 1300 were with us they were allowed to camp here & make themselves comfortable for the night & a guard was posted around them, the first lot that came in were marched off to El Arish as soon as they arrived, there were a good many slightly wounded amongst them & the Medical men were kept busy tonight, the mud huts (one of which was a Field Hospital) were all turned into hospitals. The Turks casualties were very heavy in the redoubts dead & dying were lying everywhere, our shooting was very accurate scores of Turks were found standing in the firing position leaning on the parapet with a bullet hole through the forehead.; our casualties were very light amounting ony to 146 & only four of \n\n23-12-16\n\nthese were killed outright but 3 or four have since died from wounds, this was for the whole of the Division. Our catch amounted to 1300 prisoners, 8 Field pieces & 6 machine guns. C Sqdn of this Regt are to remain here till tomorrow to clean up; It was 10 oclock tonight before we were ready to start on our 1.8 mile trip back to El Arish. The ground is hard here & the travelling good & can travel the horses.\n","33":"\n\nSun 24th\n\nHad a trying trip in last night everyone was dead beat the men dropping off to sleep as they rode along; the 3rd Bde started in an hour before we did but we caught them up \n\n24-12-16\n\nbefore they were half way in. the Wadi was congested with troop & horses with riders asleep wandered from one troop to another, it was very amusing to see someone wake up & ask where he was to find himself with the wrong Bde. I had a busy time checking sleeping Head Qrts men whose horses took a fit to roam; it was rumored in El Arish that we had 2000 Turks held up but were beat for rations & the Scottish Infantry who marched in to E Arish as we left for Maghaba volunteered to march out & carry rations to us, however horsefeed was ordered to be sent out to us as they thought up til the last that we would stop out all night\n\n \n24-12-16\n\nseven miles from El Arish we met these & were issued with 6 handfulls of oats per horse for a feed when we got to camp; we then continued our journey & it was daylight when we pulled up at the troughs to water our horses & sunrise when we arrived in camp; had breakfast & all slept till dinner time. I then went to the wells had a bath & took a ride to the beach only a few hundred yards away to find the pier run out & boats unloading & a good many tommies in swimming so the minesweepers must have cleared all the mines out & horse feed & rations now come by boat & saves a long camel train across the desert; 2 Taubes came over at dinner time dropping\n\n \n24-12-16\n\nbombs on the beach & along the hills to the West of El Arish wounding two Tommies; I forgot to mention yesterday that we never saw a Taube all day our ‘planes came out & 3 landed by us & it was a queer sight to see the airmen in their flying togs galloping about on horses for a change, they were all Australians & could all ride, they went up at intervals & flying low over the Turkish trenches open up with their machine guns; B Sqdn of this Regt has to find the Outpost for the safety of the camps tonight ;The Turkish prisoners marched into El Arish today & started across the desert to Railhead; A Russian & a French officer was out witnessing the attack on Maghaba.\n\n ","34":"\n\nMon 25th\n\nXmas day in El Arish. Maj. Smith in Command of C Sqdn turned up from Maghaba some time last night & brought back 4 mountain Battery Guns (9 pounders) 4 prisoners, a large supply of rifles & all sorts of equipment 100,000 rounds of Turkish ammunition & a small box of German fine telephone wire. I lost no time in pinching 12 reels of this & left only two as he reported he had telephone wire. I had to leave some to go on to B.H.Q. there was also one telephone but it was too big to be of use for a Regt as it is too awkward to carry about, this I took over to B.H.Q. this afternoon put in \n\n \n25-12-16\n\nthe afternoon yarning at Brigade & while riding down to the wells to water Roger on my way back, he took a fit into his head to give an exhibition of rooting & very nearly succeeded in getting rid of me. I was hoping he had given the habit best as it was his first go for a week but I fancy he is liable to buck any time when he is being ridden on his own: It has come up very cloudy & cold this afternoon & it look like a storm approaching from the North: built a shelter this afternoon in anticipation of rain.\n","35":"\n\nTues 26th\n\nThis morning Col. Granville called me up & advised me to alter the dates\n\n \nin my application for leave as all the boats are running late & Lieut. Kater who is going to Port Said tomorrow is to try & find out the date the boat will arrive at Suez; I told Colonel Granville that I heard at Bde yesterday that Lieut Sutherland was in charge of the Signallers in Details & that he is B Class for 6 months & asked the CO if he thought it advisable for me to put in an application for a Commission. he told me he would enquire; we had a heavy shower of rain last night but were under good shelter & remained dry.; An order came through this morning saying Maj. Gen. Chaytor who is in command of the Desert Column would say a few words to us at 2.30 & we\n\n \n26-12-16\n\nheartily wished him in Jericho with his congratulations however we fell in at 2 oclock in full drill order & it was 3.30 before he turned up & Gen. Cox gave the order to present Arms without first fixing bayonets, then he wanted the Officers away to allow the troops to close up & gave the order: Officers clear out: It was absolutely the roughest parade I have ever been on & everyone enjoyed the joke, the G.O.C. did not keep us long saying it was the first time in the annals of history that mounted troops have taken an entrenched position & then thanked us for the work. Cox then told the CO’s of Regts to march the men to their parade grounds & dismiss them, just then rain commenced to \n\n \n26-12-16\n\nfall & we got the order to double & the strongest runner got home first & there was no dismiss; it was a rough ending to a rough parade: Found out this morning that C Sqdn Sigs brought back a Turkish Field ‘Phone & 5 reels of light wire with them on the pack horse. Made some improvements on our \"Bivy\" this afternoon as it has been showery & looks like heavy rain tonight.\n","36":"\n\nWed 27th\n\nHad some heavy rain last night & early this morning but managed to keep fairly dry. Went for a ride down to the pier this afternoon with Lindsell to give our horses some exercise\n\n \n27-12-16\n\n& found the seamen in difficulties trying to row from the shore to the boats but the sea was too heavy & kept driving the boats back to shore, an army of natives had the unenviable job of pushing the boats off from the shores into the breakers the day is very cold. We ran into all the Generals in this part of the world here.The sea has been too rough to get the wounded on board yet, but they are fairly comfortable in Hospital tents; Just before dark Lindsell & I went out & run a telephone line from the centre Outpost to the one on the right & it was after dark when we returned, looks like rain again tonight.\n\n ","37":"\n\nThurs 28th\n\nRained a treat last night but we managed to keep fairly dry, bodies of Bedouins come in daily waving white flags to show they are friendly a good many of these are armed & are coming in for orders & the head of El Arish sent out messages for them soon after we took possession, there is no doubt they are quite willing to fight with the winning side, the Sheik of Mecca fighting with us greatly influences the actions of the Arabs in this part of the world, it is now asserted that the Turks are all concentrating at Rafa & reinforcements are coming for them.\n\n ","38":"\n\nFri 29th\n\nMore rain again last night & this morning; I never get out of bed here before 7.30 or 8 oclock as I have not to attend \"stables\", & do not think of getting out of bed before Bat Pearson (the Sergts batman) calls me for breakfast; It has been very cold the last few days, today all the gear we left at Gererat came along & we are pretty right again for gear; Took a ride to Bde Head Qrs again this afternoon we leave here tomorrow on a 20 mile \"Stunt\" to Sheikh Towait.\n","39":"\n\nSat 30th\n\nHad to get from between the blankets at 6 oclock sharp this\n\n \n30-12-16\n\nmorning & left camp at 8 oclock in drizzling rain. the sky was very cloudy & the wind cold but blowing the same way as we were going (East), had a fairly interesting trip passing several villages along the coast, a good deal of the country is cultivated the crops just above the ground these we travelled over doing a good deal of damage to all the fields we passed over, there are no fences & the fields are seperated by a narrow strip of weeds which are allowed to grow; We followed a good road for the transports all day & arrived at Sheik Towait about 4.30 & built a \"bivy\" with two blankets to keep the rain off. Frost, Lindsell,\n\n \n30-12-16\n\nHill & myself ran out ¾ of a mile of wire to the Outposts supplied by A & C Squadron & it was dark when I got back for tea; We have a cramped home tonight & packed like sardines, it is very cold.\n","40":"\n\nSun 31st\n\nWas hauled out at 3.15 this morning as the Adj. (Capt Weir) came over to the lines & could not find the horse picket. Foster was on & I found him between the blankets & put him under open arrest & went back to bed, we all slept cold till \"Stand to Arms\" at 5 oclock; made tea at 6.30 & were ready for the return trip at 8 oclock. Sheikh Towait\n\n \n31-12-16\n\nis 12 miles from Rafa which is reported to be occupied by 3 Btn of Infantry, 1 battery of Artillery & 1 Regt of Cavalry. It was showery all last night & cloudy this morning but no rain & had a decent trip home to El Arish arriving here 3.30; After having a snack I rode over to B.H.Q. & saw Capt Hudson (Bde Capt) in reference to my application for leave which was returned to me this morning saying I could only be granted 3 days, I can get leave but am leaving it stand till Lieut Kater returns the day after tomorrow from Port Said; Laid another line back to the Regt as we have been having trouble with the old one. Had enough cake to last us through the trip as I got 4 parcels on the 29th\n\n ","41":"\n\nMon 1st\n\nSmall Pox has broken out in El Arish & the villages are all \"out of bounds\" to all ranks; The sun came out bright this morning for a change but it did not last long as the clouds banked up after dinner & a very cold wind blowing & rain tonight; A couple of \"Scotty\" Officers paid the Regt a visit today to see some of our Officers & they say the 42nd Division is leaving El Arish tonight for Rafa, we hope they have a pleasant trip but are not anxious to accompany them; A rum issue was given out today the first since we left Gallipoli; Put in today writing letters; A\/Sgt Hill who has relieved me of a good deal of work, is being sent to A Sqdn tomorrow as L\/Cpl\n\n ","42":"\n\nTues 2nd\n\nPut in one of the most miserable days we have yet had cold, & a heavy wind blowing. the sand blowing everywhere; B Squadron is on Outpost tonight & must be having a miserable time as the rain commenced at sundown & it promises to be a miserable night. Hill reported to A Sqdn for duty today. The Tommies went out last night & were followed by more this morning; Rang up Bde this afternoon to see if Lieut Kater is back but found him still away: The Egyptian labor corps are now camped in the palm grove, at El Arish they appear rather comfortable with 1 tent to 6 men & here we are camped within a mile of them & not even a tent for the C.O. or Orderly Room.\n\n ","43":"\n\nWed 3rd\n\nHeavy thunder & lightning last night & a good deal of rain, in fact it rained all night. B Sqdn (on Outpost) had a very rough time of it. The rain stopped at 8 oclock this morning but it is cloudy & very cold, I went to Bde Head Qrs this morning & Roger gave me a lively 10 minutes to start with warming us both up, I ran the coil of Turkish wire in today as the Sig Troop put up posts yesterday & we now have an air line & we cannot very well do without it here as the wire on the ground gets covered with sand & the rains keeping the ground always wet runs the current to earth;\n\n ","44":"\n\nThurs 4th\n\nAnother wet night & a cold miserable day. I went to Bde HQs this morning & saw Capt Hudson about my leave but as Mr Kater does not arrive back till tomorrow I am waiting till he returns. Col Granville says he feels sure I will miss the boat if I go down before the 10th, so I am in a query when to go, but can get away any day I like, but am only allowed 3 days at Port Said. 30 English Tommies are up for a court martial & they smuggled 25 jars of rum & all got drunk on it, one man drank himself to death. Roger gave me another lively time this morning; Septic sores are very plentiful at present;\n\n ","45":"\n\nFri 5th\n\nRained again last night; This morning I went to Bde HQs & found Mr Kater was expected at any time, rode along the beach & met Mr Kater & Max Wright returning. Kater said the boat is due at Port Said on the 9th. Soon after tea this evening I went to the 3rd Regt & saw Mr Wint who is going in to catch the same boat & we decided to go in together if possible. he has a pass from the","46":" till the 12th, I then went to Bde & applied for the same leave, but Capt Hudson said 4 days was the limit for other ranks & made it out from the 7th till the 11th. I am rather disappointed as Wint & I intended going to Suez together & I shall have to go direct to Port Said now.\n\n \n6-1-17\n\nSat 6th\n\nHad a fine day for a change & an enemy ‘plane with it, but she dropped no bombs & two of our ‘planes lost no time in getting up after her chasing her away. Wint went away early this morning; 6 Sqdn captured a Turkish gramaphone at Maghaba & the Dr has been using Turkish records on the officers machine this afternoon, they are rather queer productions, reminds one of the drinking shops of Cairo. Received a parcel from home today. \n","47":"\n\nSun 7th\n\nRose earlier than usual this morning had breakfast & left camp at 7 oclock taking Locke\n\n \nwith me to lead Roger back, met the train about a mile from El Arish. also met Sergt Browne there returning from his trip to Kantara on duty; The train started at 10 oclock & I \nput\n had the worst train journey I have ever had we were in an open truck & did not get to Kantara till 6.45 broke walking records to the pontoon bridge across the Canal (3\/4 of a mile) & got there just as it was opening to let a mail boat through, & had to wait for it to close again, but managed to get to the Railway Station in time to catch the train to Ismalia at 7.30, when buying my ticket I asked the clerk how long would I have to \n\n \n7-1-17\n\nwait at Ismalia to catch the frist train to Suez., he told me 1 oclock tomorrow morning: On the way to Ismalia I got chummy with some A.M.C. Sergts stationed in Ismalia & advised me to go with them to their Mess to get something to eat & drink as it was only a few minutes walk from the station. This I did, had several drinks & cheese sandwiches & turned up at the station at 10 oclock to hear the last passenger train left Ismalia for Suez at 9.30. paraded myself up to a Capt who appeared to have some influence on the Station, stated my case & told him I wanted to go to Suez on the perishable goods train leaving at 10.30 he saw\n\n \n7-1-17\n\nthe station master & told me to go in the brake van. I tipped the guard & wanted an empty carriage to sleep in till morning, as the train arrived at Suez at 2 AM & it was too late to try & get into an hotel which would have been impossible but the guard advised me to go home with him & he might be able to find an empty cot; This I did & had a decent bed to sleep in even if it was previously occupied by a nigger.\n","48":"\n\nMon 8th\n\nI told the guard when going to bed to wake me at 7 oclock & this he did at 7.30 had a wash & a shave & went to the WindsorHotel &\n\n \n8-1-17\n\nengaged a room, had breakfast & a brush up, engaged a \"garry\" & drove toTewfik Bay interviewed the manager of the P&O Line & was told the Kaiserhind has not left Aden yet & to call again tomorrow. I found him very obliging but they are not allowed to give any information concerning the arrival or departure of boats to any one. When leaving the P&O office I met Mr Wint he is stopping at the Bel Air Hotel & I decided on putting up there also but found it out of bounds to Troop as it is reserved for Officers; However I had a hot bath there; took a couple of watches to the watchmakers for repair & some films to a photographers to print & had dinner at the Windsor where I am boarding.\n\n \n8-1-17\n\nI am not in love with this place but am told it is the best Hotel in town not out of bounds to soldiers so will have to be satisfied, one cannot even get a hot bath here & the tariff is 12 per day. My pass is made out for Port Said & not Suez & everyone who is staying at Hotels have to sign their names & where they come from also their Regt. for the information of Military Police so I may get into trouble here before I return especially as I shall probably have to overstay my leave. Sent a cable home this morning; A Russian cruiser passed through the canal on the 5th & either hit a floating mine, torpeoded, or internal explosion, anyhow she went\n\n \n8-1-17\n\ndown near Port Said. Several of the crew died after being rescued & about 130 are missing the remainder were saved. I had a couple of hours sleep after dinner & then took a walk round met several Australian Engineers who are down on leave & put in the afternoon with them. had dinner at 6 oclock & wrote a letter to Ede before going to bed.\n","49":"\n\nTues 9th\n\nRose at 7.30 this morning had a shave & breakfast, then a general shine up with Kiwi, engaged a \"garry\" & drove to Tewfik Bay interviewed the Manager at the P&O office & was told to report there at 6 oclock tomorrow\n\n \n9-1-17\n\nmorning & he would take me out on a launch with him & get me on board. I then went to the A.P.M. to see if I required a pass from him but found it was not necessary, dismissed the cabby & walked back for exercise. Met Wint as he was coming up for information; I can get a passage to Port Said but am waiting to find if Jessie is landing at Suez or going on; As the Windsor Hotel is a couple of miles from Tewfik Bay I changed my hotel this afternoon & came to the Savoy at Tewfik & find it much better than the Windsor they even supply an English billiard table. I put in an hour with a afternoon a Tommy playing before dinner.\n\n ","50":"\n\nWed 10th\n\nRose at 5 oclock this morning & walked to the P&O office arriving there well before 6 oclock. Windt came on the scene a little later; the Kaiserhind came in at 6.30. at 7 oclock we boarded the managers pinnace & steamed off to the boat. Met Jessie as came off on the same boat & landed on the Wharf by the Railway Station & as the Nurses were to go to Abbassia I decided to go too; could not find a carriage to take me to Suez & cut the two mile out on foot in good time, found the photos hardly ready & arranged for the photographer to meet me at the train with them, got the C.O’s watch & drove back to Tewfik at the gallap, called at the Savoy\n\n \n10-1-17\n\nHotel to get my overcoat & caught the train just before it moved out & went to Cairo in the same carriage as Jessie, Faulkner & Hills:left them at the Cairo station as they were going to Abbassia in the Ambulance waggons. I drove to the Anzac Hostel, had dinner, then walked into the billiard room & met Kennedy who was our despatch rider & badly wounded on Aug 4th; he is now a cripple & returning to Australia next month; had dinner again with him & then saw the cinamatograph pictures at the Hostel & found them very good; had a cup of tea & retired to bed;everything is very cheap at the Hostel besides being clean & good. It is run by the YMCA & another instance of the good work the YMCA is\n\n \n10-1-17\n\ndoing in this war. It was a treat meeting Jessie & the other nurses & I was very lucky in not going to Port Said to await the boat as I intended.\n","51":"\n\nThurs 11th\n\nRose at 5 AM. Had breakfast at 5.30 & was at the Cairo Railway Station at 6 oclock & had to wait till 7 for the train to Kantara to move out, played bridge till we reached Ismalia with some other Australians I met on the Cairo platform; here I decided to get out to buy films & send a cable, had lunch & put in a couple of hours moping around the town sent a cable from the Railway Station, & readjusted the photos putting them in a smaller \n\n \n11-1-17\n\nparcel & left Ismailia at 2 oclock arriving at Kantara at 3 PM, crossed the Canal & took my time walking to the station to catch the train to El Arish & when I got there found I had to wait till 6 PM to catch a train; while waiting a Hospital train came in from El Arish loaded with wounded soldiers (mostly leg & arm wounds) from one of the lads I heard Major Irwin & Lieut Tony Hordern* were both wounded & a good many other ranks also, but they managed to take Rafa & captured all in it. The train to El Arish left at 6 oclock & had to change trains at Romani & again at Mazar & riding all night on a load of sleepers.\n\n*Tony Hordern is at present in the officers ward. Major Lewis was hit the same day, some are returning to Australia tomorrow. J.M.T.\n\n ","52":"\n\nFri 12th\n\nThe train pulled up at Kilo 152 at 4.30 & I then had 4 miles to walk to the camp & got there at 6.30 & heard Johnny Law, Leece & two or three other lads were killed at Rafa, the casualties for the 1st Regt was 23. Percy Treasure (Sgt) received a bad wound through the hip. It is reported that 2008 prisoners were taken & the Turks suffered heavily from casualties; only Mounted Troops were fighting & the Yeomanry were with us this time & fought very well; I am feeling very sore on account of the rough train trip last night, every bone & muscle in my body is aching. I had no sleep on the way out & done nothing today. Heard today Butler, Cameron & Treasure were wounded.\n\n ","53":"\n\nSat 13th\n\nI had no idea that I would feel so disappointed in missing a scrap as I felt last night when the lads were telling me the details of it; The Brigade formed up this morning to be addressed by Gen. Chauvel. Gen.Cox came on the scene a few minutes before Chauvel & thanked us in a few words for the work done at Rafa & finished up with & here come the General & I thank you that’s all I’ve got to say causing a good deal of amusement; he is as rough as it is possible to be. Gen. Chauvel spoke well & as usual gave us a good deal of information & the reason why such & such orders were given reason for any delays etc. he proved interesting, he said we captured 35 Officers 1460 Other Ranks & the enemy \n\n \n13-1-17\n\nkilled is estimated at about 300. The camels & waggons we had out were not sufficient to bring in the stores & equipment captured & they had to go ut again the next day (10th); the 8th Regt were left out on the night of the 9th to protect the A.M.C. men working on the wounded, a Squadron of the 8th were attacked by Cavalry & Camelry at 10 oclock next morning, the attack was repulsed & 14 prisoners taken. Today 16 Turks marching under a white flag came in & were brought in by our patrol; they say they came from Gaza (60 miles) & have had enough fighting. The German Brigadier captured at Rafa said he knew they could beat off 2 Divisions & thought 3 could not shift them & they came to the conclusion that 5 or 6 Divisions were attacking. They were rather surprised to find one Mtd. Division\n\n \n13-1-17\n\nhad beaten them. Had some sparring tonight with a professional boxer from Sydney named Barr; he is in the Anzac Troop & won the middleweight championship of Egypt a few weeks ago. I would like the opportunity of meeting him for the title; Taube paid the camp a visit at 9.30 one night while I was away & dropped bombs in the moonlight but did no damage. Two came over again today & dropped a few bombs & the empty cases & pellets from the Anti-Air-Craft guns were a bigger danger to us than the Taubes, but no one was hit.\n","54":"\n\nSun 14th\n\nA couple of Taubes came within sight this morning but kept out of range of the guns & dropped no bombs, I was down\n\n \n14-1-17\n\nat the wells on the beach this afternoon in charge of Head Qrs watering the horse when the orderly Sgt came down in a hurry with orders for all horses to get back to the lines at the double, as soon as we arrived we received orders to be ready to move out at a moments notice, as the Camel Corps patrol had reported 150 Cavalry advancing & it is thought they may be an advance guard to a big army; The 2nd Regt were sent out to investigate & the machine gun squadron took up positions at the double. The 2nd Regt went out 10 miles & then came upon 150 English Yeomanry who were wandering about lost, they went out on patrol & lost themselves & were going East instead of West when the 2nd Regt overtook them. \n\n ","55":"\n\nMon 15th\n\nAt 9 oclock last night several of our ‘planes came in showing blue lights apparently they have been on a night raid; & again this morning 7 went out heavily laden, it is a fine sight to see them one fast battle ‘plane flying very high & some distance ahead to clear the way followed by the bomb carriers flying close together in line followed by a light scouting ‘plane on either flank. All the ‘planes returned soon after dinner: We had a Taube over early this morning but she did not stay long & dropped no bombs. 14 Turks came in & gave themselves up yesterday & several more today; The weather has been perfect since I returned from my trip.\n\n ","56":"\n\nTue 16th\n\nA Taube came over early this morning & tried to drop 3 bombs on our hangars but missed badly, one of our ‘planes chased her off; at 8 oclock this morning 11 of our planes flew over loaded with bombs & they came back independantly during the day at intervals, it is a treat to watch them descending in small circles & head first; Several Tommies in swimming this morning were carried out by the undertow & drowned the surf is very treacherous & one dip is generally enough to satisfy poor swimmers to have a fresh water wash instead of the surf. A mine was discovered this morning & fired off about a mile from the beach floating in the sea.\n\n ","57":"\n\nWed 17th\n\nEleven lads from Details arrived today Tancred being amongst, he is looking well but has had a bad time of it; F.C.M.S. McSweeney went away today with septic sore they are very prevalent here; Ally Hargreaves also came back today & has his old job of Sig to C Squadron. Sturgeon had his place but was kicked on the knee by a horse a few days ago & sent away. Had no ‘planes (enemy) over today 7 of ours went out loaded with bomb to pay them an early morning visit (a new style of Reveille).\n\n \n","58":"\n\nThurs 18th\n\nHad a visit paid us by two Taubes early this morning & the Anti Air Craft guns fired a great number of shells at her, but the Taubes were too high (out of range) they dropped no bombs & came in from the West. The Squadron now do Regimental drill & I have the Sigs out on visual work, we commenced this morning; it is a lot of rot taking the men out mounted as the horses would be much better off resting after their Rafa trip, but a bit of work to get the men fit will do them no harm. We have been having perfect weather; It is rumored we may get 5 days leave to Cairo & Alexandria shortly.\n\n"}}