{"Document Name":{"0":"Diary_0117","1":"Diary_0117","2":"Diary_0117","3":"Diary_0117","4":"Diary_0117","5":"Diary_0117","6":"Diary_0117","7":"Diary_0117","8":"Diary_0117","9":"Diary_0117","10":"Diary_0117","11":"Diary_0117","12":"Diary_0117","13":"Diary_0117","14":"Diary_0117","15":"Diary_0117","16":"Diary_0117","17":"Diary_0117","18":"Diary_0117","19":"Diary_0117","20":"Diary_0117","21":"Diary_0117","22":"Diary_0117","23":"Diary_0117","24":"Diary_0117","25":"Diary_0117","26":"Diary_0117","27":"Diary_0117","28":"Diary_0117","29":"Diary_0117","30":"Diary_0117","31":"Diary_0117","32":"Diary_0117","33":"Diary_0117","34":"Diary_0117","35":"Diary_0117","36":"Diary_0117","37":"Diary_0117","38":"Diary_0117","39":"Diary_0117","40":"Diary_0117","41":"Diary_0117","42":"Diary_0117","43":"Diary_0117","44":"Diary_0117","45":"Diary_0117","46":"Diary_0117","47":"Diary_0117","48":"Diary_0117","49":"Diary_0117","50":"Diary_0117","51":"Diary_0117","52":"Diary_0117","53":"Diary_0117","54":"Diary_0117","55":"Diary_0117","56":"Diary_0117","57":"Diary_0117","58":"Diary_0117","59":"Diary_0117","60":"Diary_0117","61":"Diary_0117","62":"Diary_0117","63":"Diary_0117","64":"Diary_0117","65":"Diary_0117","66":"Diary_0117","67":"Diary_0117","68":"Diary_0117","69":"Diary_0117","70":"Diary_0117","71":"Diary_0117","72":"Diary_0117","73":"Diary_0117","74":"Diary_0117","75":"Diary_0117","76":"Diary_0117","77":"Diary_0117","78":"Diary_0117","79":"Diary_0117","80":"Diary_0117","81":"Diary_0117"},"Date":{"0":"unknown","1":1310.0,"2":1311.0,"3":1316.0,"4":1317.0,"5":1337.0,"6":1338.0,"7":1339.0,"8":1340.0,"9":1349.0,"10":1350.0,"11":1353.0,"12":1354.0,"13":1355.0,"14":1357.0,"15":1358.0,"16":1359.0,"17":1360.0,"18":1361.0,"19":1362.0,"20":1363.0,"21":1364.0,"22":1368.0,"23":1369.0,"24":1370.0,"25":1371.0,"26":1372.0,"27":1373.0,"28":1374.0,"29":1375.0,"30":1376.0,"31":1377.0,"32":1378.0,"33":1379.0,"34":1380.0,"35":1381.0,"36":1382.0,"37":1383.0,"38":1390.0,"39":1391.0,"40":1392.0,"41":1393.0,"42":1394.0,"43":1400.0,"44":1401.0,"45":1402.0,"46":1405.0,"47":1508.0,"48":1706.0,"49":1708.0,"50":1709.0,"51":1710.0,"52":1711.0,"53":1712.0,"54":1714.0,"55":1715.0,"56":1716.0,"57":1717.0,"58":1718.0,"59":1719.0,"60":1720.0,"61":1721.0,"62":1722.0,"63":1723.0,"64":1724.0,"65":1725.0,"66":1726.0,"67":1727.0,"68":1728.0,"69":1729.0,"70":1730.0,"71":1731.0,"72":1732.0,"73":1786.0,"74":1789.0,"75":1795.0,"76":1796.0,"77":1797.0,"78":1808.0,"79":1809.0,"80":1810.0,"81":1818.0},"Entry":{"0":"\n\n","1":" – E deM\n\nThe cruise of the \"Anchises\" from Fremantle W.A. to Liverpool England.\n\nLeft Fremantle the A68 \"Anchises\" at 5 pm on","2":" had a calm and uneventful voyage to Port Melbourne. We arrived here at 9p.m. on Saturday the","3":"\n\nMarched to the Domain Melbourne on Sunday morning the","4":" We were marched to this camp which is a distance of 5 miles. Got to camp about 11am. Had lunch & then had leave till 12 midnight. Monday we got leave from 11a.m. 1p.m. & entrained for Seymour Camp at 2p. Arrived at Seymour about 5.30 pm. & got to the camp at 7p had tea & turned in. During the 3 weeks at Seymour I had no training whatever. \n\nLeft Seymour","5":" at 7.30 pm. for Sydney and 20.","6":" only 3 of us went straight on to Sydney the rest got off at Liverpool & remained there all night & came on board early next morning. There was a big railway strike on in Sydney & owing to this I had to ride in a cart 5 miles to Willoughby to see my Mater. I left her about 10 & was fortunate enough to be overtaken by a motorist who gave me a lift\n","7":" – E deM\n\nover the ferry as far as the G.P.O. Sydney. Left Sydney Wednesday at noon on","8":" & strange & fortunate to say we struck the same boat viz A68 \"Anchises\"\n\nThere was a good crowd at the wharf to see the boat off we pulled out from the wharf about 9 am. & went into the saloon till noon – we had a good voyage to the Marquees Islands which we sighted 5 pm on the","9":" Saw no sign of civilization although I believe there is a population of 5000 inhabitants mostly French whose export mostly is guano. The coast we saw was very high rocky and dangerous. These islands are about half way to the Panama. Having had winds and fairly high seas doing about 13 miles an hour. We have averaged 310 miles per day the last 24 hours run has been the worst so far since leaving Sydney. What has struck me very forcibly is the almost absolute lack of bird life but to make up for this there are plenty of flying fish. \n\nHad sports on board which started on","10":" & finished up about the","11":" far all on board enjoying best of health & looking forward\n","12":" – E deM\n\nto our arrival at Panama so as (as we know we call at Colon for coal & water & will remain there some days) we can go ashore of course there are a few in the ships hospital but nothing serious.\n","13":" Have boxing tournament with the sailor lads of which there are about 40 on board going home for the first time to join their respective boats. One boxing bout was very funny 4 of them were blind folded it was very amusing to see the way each would hit out & swing round as soon as they touched one another. – The referee got mixed up among them for some minutes & had rather a rough time of it. The weather has been lovely but a little rain fell this morning for the first time for a few days. Prior to day our sailing average fell to 280 miles per diem but has now again pulled up to her 310 the falling off was due to a defective boiler but is now O.K.\n","14":" Very quiet day had given by the A.M.C. which was very good indeed.\n","15":" Finished up the boxing tournament & out of 3 events the Div. Sigs only won one. A\n","16":" – E deMouncey\n\nconcert was given by the workers but this was very poor indeed one of their number a man named Dow made up & recited an awful doggerel of a thing called Anchises & her living cargo. He was cheered and counted out alternatively but he did not mind this but continued to the end.\n","17":" Beautiful weather but only did 274 miles for the run the A.M.B. & the A.S.C. gave a combined concert which was quite passable.\n","18":" Washing & mending parade today as I had done mine a day or so before decided to have a good spell. I might mention as I had been appointed mess commander & made a Lance Corporal I had very little to do & as a matter of fact the whole unit had very little to do in the way of drill or anything else. Today received orders that 2 signallers & one L\/Corporal has to go on the Bridge for signalling purposes, also to keep a look out for submarines etc. with the officers. This has to be done day & night. When in convoy there is both a lot of lamp & semaphore signalling besides knowledge of international flag work.\n\n5 – E deM\n\n29th Did 334 miles today improving in speed \n","19":" 348 miles today record up to the present. Weather looks as if we are going to have a change a little rain fell today but nothing to speak of.\n","20":" did 342 miles calm weather with rain, weather hot and sultry quite tropical, saw a great number of bonita was in a bridge tournament but we lost.\n\nStarted on the bridge for Semaphore & lookout duty very heavy rains.\n","21":" days out. On the","22":" which was a Monday owing to crossing the longtitude of 180% which necessitated no dropping one day so we had two Mondays & two 17th in the one week so far we have come 7750 miles at noon today. \n\nSighted land at 11 am. today about 20 miles North by East. This Island about 80 miles from the entrance to Panama.Very calm here & water literally covered with bonito this is a fish weighing from 10 to 50 lbs rather good eating & easily caught with line & coloured rag saw soft back turtles floating by also a couple of seals.\n","23":" – E deM\n\nCape Milo sighted 25 miles Nor.East at 5.5 PM horizon being black & a heavy storm over the island but did not reach us. Mainland about 27 miles off. This country is very mountainous. The course here was altered to North East by North. Very heavy clouds with lightning & heavy showers.\n\nFancy dress ball took place in the evening by all hands on the ship great success some very good costumes considering the small amount of stuff to make up from. \n\nExpect to arrive at Mouth of Canal early in the morning.\n\n2nd. Sunday arrived in the roads 6.15 am. A land locked bay with good anchorage. Anchored. Met by U.S.A. destroyer who steamed round us several times & then informed us a pilot would board us before long. He (the pilot) came on board about 7am.\n\nThe country about here consists of the main land & numerous islands everything beautiful & green a great contrast to the shores of Western Australia, trees, palms etc.\n\n \n","24":" – E deM\n\ngrowing down to the water`s edge.\n\nGot underway 7.15 a.m. On the left going into the channel there is a small township nestling at the foot of a mountainous island which makes a very picturesque and interesting scene. On the right side entrance of the Canal numbers of storages. Stores for oil. There seems to be a good deal of oil exported from here. On the left here nothing but tropical vegetation, coconut palms etc. The French tried to construct this Canal but failed owing to not having exterminated the germ carrying mosquito whose bite used to cause malarial & other fevers. The French expended 80,000,000 dollars.\n\nThe first thing the Yankees did was to exterminate all the disease germs. This ran into millions of dollars, & for miles around there is not a mosquito to be seen or felt. Thus having killed & removed the cause of the fevers etc the Americans set to work & succeeded in constructing building & carrying out one of the greatest pieces of engineering work ever undertaken in the world. Money in this case was no object.\n\n8 \n\nThe following will in a measure point out what has been done to make it such a success :-\n\nThe Canal is length 40 miles channel with at top 500 to 1000 feet, bottom 300 to 650 feet. Time to take passage through canal 10 hours, through the locks 3 hours. The first lock from the Pacific entrance is called Mira Flores which has two set of locks width 110 feet.\n\n2nd Lock Pedo Miguel, 1 set length 1000 feet 3rd Gatun Locks\n\nAt Gatun Locks 3 double sets average lift 32 feet.\n\nGatun dam length of crest 8000 feet 2600 height above normal lake level 30 feet.\n\nTotal number of men employed 41,000 estimated total cost 375,000,000 dollars.\n\nArea canal 448 sq. miles & highest we raise to is 85 ft. above sea level. The pacific ocean side is 10 ft. higher than the Atlantic ocean side.\n\nThere is a saving of over 10,000 miles from the northern ports of America, saved by going through the canal instead of going round Cape Horn. Taking the farthest northern port \n\n9 – E deM\n\nit is 2141 miles & the closer ports 1000 through the Canal instead of 10,020 miles. That is from Boston to Panama via the Cape it is 10,020 miles & only 2141 through the canal, a saving of 7000 odd miles.\n\nOf course had America not declared against Germany we would not have been allowed to come this way & all would have missed this great sight.\n\nThen summarising points Panama, which the \"Changes\" is the most important. It rises in the centre of the republic & empties itself into the Carribean Sea. Climate tropical dry season January to May the rest wet, and it is wet rains here every day. Sometimes on and off all day 80% to 100% is the usual heat rainfall 40 to 155 inches per annum. Products coffee, cocoa, tobacco,& rubber is collected in the mountains, cotton indigo nuts & spices grow wild & are cultivated also, there are extensive forests of timber also stock raising, gold, salt, copper and coal & mineral water are found in different parts but are almost wholly underdeveloped. Population 450,000 mostly mixed race and 31,570 square miles.\n\n10 – E deM\n\nThe president is elected very four years by the people with 6 ministers. Was formerly a department in the Republic of Colombia, was established","25":" It has a centralised form of Government which applies to all parts of the Isthmus excepting the Canal zone which the U.S.A. has a concession for 5 miles on either side. There is plenty of fish in the canal & the native employees pass a lot of their spare time in this pastime.\n\nCame in sight of the first lock at 8.40 am. They have an electric one compartment car for hauling, it is done on the grip system & its impossible to pull them off the line they have to climb almost perpendicular at times & it is wonderful how they get up the way they do. \n\nThe steel rope is caught in the middle of the engine, one pulled in front & a couple we hitched on towards the stern so as to prevent the ship from going too fast. Dredges are constantly used to keep the canal clear. The entrance to the canal is hidden from view by high land.\n\nThe \"Anchises\" is the","26":" transport to come this way from Australia. The Themostocles which is the flagship so far, Media, Miltiades, & \"Anchises\"– but there has been some NZ hospital\n","27":" – E DeM\n\nboats gone through homeward bound. The locks in appearance look all the world like a switch back railway but more steep in places.\n\n9.30 am. Right alongside the first lock Mira Flores – built in 1913 – we went forward into the first lock & the water is then pumped in to raise us up. There is another boat following up behind but only one boat can go through each way at a time. The people here, mostly black come alongside & exchange things with our boys.\n\nThe American soldier is a lith; well built man mostly young. There youthfulness being very noticeable.\n\nThe pilot takes us through to Colon which is the city on the Atlantic side. (All towns in America are called cities.) The pilot returns by train. They call their little engines electric mules & they can pull some.\n\nThe Americans had a different engine in view when they first started but some inventative Yankee introduced these which were accepted by the American Government.\n\nThe locks have armed guards & at the entrance to the canal they have wire nets\n","28":" – E deM\n\nstretched across. These are closed at 6pm. & opened again at 6 am. so as to prevent sub-marines entering during the night. We entered the 2nd lock,Pedro Miguel at 11 am. Passed through 11.30 am.\n\nGreat excitement here with the usual populas made up mostly of blacks & sprinkled with whites. This black labour is imported from Jamaica & the adjacent islands the natives of the country here do no work to speak of that is the Panamanians.\n\nThe workers get 16 cents an hour that is 8d. They have the 8 hours a day system & overtime after that time Sunday & holidays are all the same to them.\n\nThe white girls looked very pretty in their cool beautifully white dresses with their coloured ribbons pink & blue stuck in their hair, most of them came although it was very hot with out hats & their complexion is very good indeed what amused us was to see the native women who are as black as coal with parasols up to save their complexion afraid I suppose of freckles.\n\nAbout 1\/2 mile from this lock we entered the famous Culebra Cut which is 9 miles long,\n","29":" – E deM\n\n& noted for its land slips, 3 years ago the land slipped on both sides which closed up the canal for some time & cost thousand of dollars to clear again. About half a mile out of the 2nd lock passed the Norwegian steamer \"Talbot\" going South. (The channel runs North South) this was about 12.30 pm. When away from the locks boats go under their own steam. \n\n1.30 pm. Passed large powerful wireless station with 3 stands. This is Lentand wireless station. I believe.\n\n1.40 came into the lake proper, this is a great stretch of water. It appears as if there has been a great deal of damming here- passed several canals of the real old kind. Natives with bananas & cocoanuts, It seems strange that within a fortnights sail from England we should experience such tropical weather.The canal water is muddy with a sort of waterlily growing in it but seems to be growing on top of the water.\n\n3.35 pm. Left the","30":" and last lock – 4.30 pm. Through the last of the locks. In sight of Colon about 2 miles distant from the last lock. Both Colon & Panama are on the south side of America. Panama is on the main –\n","31":" – E deM\n\nland but Colon is an island separated from the Mainland by a narrow passage of water. Panama is the seat of Government whereas the surrounding country of Panama is hilly the country just round Colon is flat very flat compared with the other side.\n\nThere is a break water in Colon Bay extending about 5½ miles with an opening in the middle quarter mile wide. They take the same precautions here against submarines as at Panama that is opened or closed with a wire net at 6 am. & 6 pm. So before and after these hours no boat can either go out or come in,. The speed in the lake is much greater than when in the channel we passed the American Steamer \"Colinga\" going south all dark crew. Had an interesting conversation with the pilot on the bridge where I was told off to keep a look out. The pilot told me they were kept so long down in this part of the world that they lose all ambition in life. The life he says is terribly monotonous.\n\nToday, being Sunday every where we passed through every body black & white were dressed in their Sunday best - & I tell\n","32":" – E deM\n\nyou some of the coons & their ladies were dressed to kill.\n\nWe also passed the U.S.A. steamer New York going south.\n\nThe people here will not cultivate any land as if they do so the Panamanian Government confiscate t, as it is impossible to get a title to any ground, hence the neglect of cultivation. This ground would grow anything almost.\n\nAt the entrance to each lock they have a large arrow used for an indictor pointing to which side of the lock we enter.\n\nAnchored in Colon Bay at 4.40pm in 40 feet of water. At 7 pm sent the first message by lamp to the flagship Themistocles & received an answer about 8 pm. We got under weigh again about nine, & went alongside to coal & water. Christobel is the name of the Coaling Station. This place is separated from Colon by a railway. This is one of the best coaling places in the world & is capable of handling 6000 tons of coal an hour. They use tremendous elevators. The coal is brought in 10 ton electric trucks emptied into a receiver & then carried by \ncarriers\n \n\n16 – E deM\n\ncarries something like those used at the north wharf Fremantle. The coaling station is built oblong & can load boats on 8 sides at a time. They say the whole American fleet could be coaled here in 24 hours. I do not know whether this is true or not, or just the usual American tall talk, but no doubt they can coal some – as the Yanks say. \n\nWashington Hotel is the most imposing building in Colon. A portion is used as offices, other parts are used as a hotel. They do all their signalling to the boats in the bay from the roof of this building.\n\nThe labour here is black with white overseers. Black labour and electricity predominate here as the principle labour commodity.\n\nMonday, we all expected to go ashore today & as we had been over 3 weeks on the water we naturally made sure of leave passes, but this was rudely dispelled by the following posted on the notice board:-\n\nThe O.C. regrets to inform all on board that owing to neutrality regulations at this port the British Consul advises that no shore leave is to be granted\n\n19 – E deM\n\n(sgd) J. H. O’Halloran Major\n\nO.C. Troops A68\n\nColon,","33":"\n\nFor my own part I did not believe the above as all the officers and nurses also the N.C.O.s were allowed leave ashore and I have found out since that the NZ. troops were allowed to land as the following will show which appeared in the Panama Journal of the 5th.\n\nI should be pleased if you will kindly make public the high appreciation of the N.Z. Government for the cordial reception accorded to the N.Z. Hospital ships on recent passages through he canal.\n\nThis was sent by the Governor General of N.Z. Lord Liverpool who had it sent through the British Minister. Why then could not the Australian Government have had an opportunity of thanking the Panama Government for the same thing by allowing the Australians ashore? Something wrong somewhere. \n\nAre the NZ troops so much better behaved than the Australians that they should be allowed off and not us?\n\nMules are used here instead of horses\n","34":" – E deM\n\nand there are some fine specimens of them here to\n\nThere was some trouble with the munition workers as they demanded to go ashore, but the OC was obdurate and they like us were compelled to remain on board. Their contention was they were civilians and were not under the same conditions as the soldiers. This idea was overruled much to their disgust. It is very galling to see the officers and others going ashore and keeping us all cramped up on board.\n\nDrew away from Christobel about 9pm Monday night.\n\nTuesday 3rd Anchored here all day. Saw submarines manoeuvring all round the harbour. They were being submerged and bought to the surface again chiefly for our edification. So we could form a good idea what to expect later on in the danger zone we\n\nWe came upon the before mentioned Australian troop boat here waiting for us the Medic, She is well known in the west with her one funnel and 4 masts. She has had two or three deaths on board. The Themistocles left\n","35":" – E deM\n\nMelbourne the Saturday before we left. She has some of the lost boys belonging to the signalling school.\n\nGreat excitement. A motor launch came alongside with 3 armed American soldiers. It appears that one of the engineers got a uniform off on of the American soldiers & went ashore and deserted. The American in the meantime got a suit of private clothes and stowed away amongst the munition workers where he was unearthed during the day and handed over to the American Soldiers. They seem to think that Uncle Sam deals rather severely with these sort of men.\n\nOur engineer was arrested ashore and brought aboard still with the uniform of the American soldier on. Don’t know yet how he got on.\n\nSome of the Miltiades boats took off their boys ashore for swimming purposes, but would not let them near the town. Of course we were not allowed, too much bother for our O.C. to do anything of that kind for us. We wanted the same concession & after a lot of bother it came out in orders\n\n20 – E deM \n\nthat we would be allowed ashore next day. The other boats got away early in the morning, ours got away after 10 am. Half the day over before we started. We had a swim got coconuts and enjoyed the sweet fresh milk, it rained all day whilst we were ashore so were saturated with rain.\n\nThey have a very good dry canteen here. The quarters are a credit to any notion, no meaness about them. The roads and paths about them are all concreted, the quarters are built two story high on piles placed on concrete foundations 3 to 4 feet off the ground. Wired in all round with mosquito proof gauze mesh, nice beds & decent linen good food and everything of the best. Not like the camps of Australia, no wonder we get menginitis sleeping on the floor within a few inches of the damp and wet ground of Seqmour and Blackboy. Decent large cupboards to keep their kit and things in, it would do some of the military heads of Australia good to take a trip over here to see how the Americans treat their soldiers. They are considered as some-\n\n21 – E deM\n\nthing worth looking after and are treated accordingly.\n\nWednesday, no more shore leave, broke a paltry oar or two and on account of that we are compelled to sweat ourselves on board without a chance of getting off again for a swim. The other crowd of course were ashore as usual all day having a dam good time. The irony of it is the other ships boats & men are off just the same.\n\nThe man Dow whom I mentioned before deserted on Wednesday & was bought back again by the police from shore today. He refused to be taken under arrest as he considered himself as a civilian, but that did not prevent him from being bundled into the boob. I suppose his next ode will be to the injustice meted out to him, or about his prison cells etc.\n\nRelieved the lookout a midnight, a nice cool breeze blowing, it is a fine and safe harbour owing to the breakwater and being otherwise land locked. No danger of dragging anchor, never mind what direction the wind\n\n22 – E deM\n\nmight blow.\n\nOur Australian mails which had been posted and censored on board were sent ashore today. I do hope all our dear ones will get these letters as that is the only pleasure we have is in that they will be received O.K. God only knows when we will hear from Australia, it will be months I suppose.\n\n3 am. A very lively storm coming up from the sea, seems as if it is going to be a fairly severe one, it was too while whilst it lasted, which tropical like was short but very sharp\n\nHad concert on board from some of the local talent but missed it being ashore swimming.\n\n11th the following interesting information I got from the Canal record.\n\nTraffic through the canal in the first fiscal year. Total number of ships making transit of the Canal during the first year ending","36":" in seagoing traffic was 1876. In the final year 1916 total was 787. In 1915 it was 1,088. the aggregate gross & net tonnage of the 1876 ships in 1917\n\n23 – E deM\n\naccording to the rules of measurements for the Panama Canal were 8,530,121, and 6,009,358 tons respectfully, The cargo carried through was 7.229,255 tons.\n\nFriday 7th Had orders to prepare to leave as it was expected that two new Zealand boats which arrived yesterday would have finished coaling. But this was not the case as the second one had not finished coaling until after 6pm. Boats after that time can not leave Colon on account of the submarine nets being closed, therefore we were forced to remain.\n\nSometime after six we got advice to be ready for sea the first thing in the morning.\n\nThe N Zealand boats that joined us were the \"Ruahine\" & \"Makia\"\n\nSaturday 8th. Under way at last. 6am all the convoys got anchors out headed and waiting for the final signal for departure ( Which came at last ) we headed by the U.S.A. battleship \"Charleston\" steamed out of Colon Bay.\n\nFirst of the troopships was our flagship \"Thermistocles’, then the \"Anchises\", \"Milteades\", \"Ruahine\"\n\n24 – E deM\n\n\"Makia\" & Medic last. We got through the submarine netting at 6.30 heading north for the Atlantic. Destination at present \nunknown\n uncertain, but think it is \nuncertain\n Halifax Nova Scotia. Wherever it is I hope we have better luck & have a chance to stretch our legs ashore, but on reflection I do not think for a moment we will as there are now six boats, where there was only one before, so if they would not let us go when there was only one it is not likely now there are six.\n\nSunday 9th Very quiet day the sea here is much rougher than the other side of the continent. \n\nOnly did 257 miles. We are continually zig zagging from one side to the other.\n\nMonday 10th not quite so rough today.Did 245 mjiles.\n\nWe although so far away from the active portion of the world`s war are now in the danger zone. All precautions are being taken. Portholes, doors, etc are closed. A canvas shelter is put completely round the main deck. No matches after dark allowed to be struck and of course no smoking\n\n25 – E deM\n\noutside of very sheltered parts. The ship is in complete darkness. A submarine armed guard has been formed & there are other men told off at different points to keep a sharp lookout for anything suspicious. We have to carry our lifebelts round with us wherever we go. The Thermistocles looks quite comical as out of the forward funnel can be seen two men keeping watch from out of the structure. It is a dummy one & a stage has been built\nintead\n inside it for the above purpose, but looking at it either closely or from a distance you would stake your life that it is a real one, especially as they have a steam pipe running up the side of it and the steam comes out of this pipe, you naturally think it is emited from the chimney,.\n\nOn the bridge, Still fairly rough and whilst on the bridge I cannot help thinking that the officers of the ship have a great deal of responsibility on their shoulders and let me assure those that are inclined to belittle the officers & seamen of these transports that they are doing their bit as much as any man that has volunteered\n\n26 – E deM\n\nfor the front. Imagine on dark and stormy nights within a few hundred yards of one another these boats which might mean the utter destruction of the ships and perhaps of hundreds of men should the slightest error of judgement be made by the one in charge.\n\nWednesday 12th Fairly good weather all day. 225 miles done.\n\nAbout 10 pm. we went through the Mona Pass which separates Pao and Porto Rico but unfortunately being night time we could not see anything of interest.\n\nThursday 13th Yesterday the \"Miltiades\" lost a man overboard. Who or what he was we do not know yet, but as all are now in the danger zone no ship is allowed under any circumstances to stop and pick up a man who falls over board.\n\nThe \"Militiades\" ran up a signal \"man Overboard\" and blew her siren but could not stop owing to strict orders to the contrary. The \"Medic\" crossed her stern in the hopes of getting him by throwing ropes out but the poor unfortunate was never sighted again the sea being fairly high. Of course it seems \nhigh\n harsh but instructions were\n\n27 – E deM\n\nissued as soon as we came into the danger zone for the safety of others. Ships would not stop to fish up any one who fell overboard.\n\nSaturday 15th Sighted land at 7 am. Turned out to be Bermuda which is made up of numerous islands very close together. Hove to off the island about a mile. It is rather a pretty place, it is a very fashionable watering place for the \n\nAmericans of the North during the winter.\n\nIt is owned by Great Britain & it is a delightful climate especially about this time of the year. During New York`s winter season the people who can, come here to escape the cold. The houses are mostly white.\n\nOf course none were allowed ashore. We could not get any particulars about the place. \n\nThis was the rendezvous for us to pick up with a British Convoy which we did. The H.M.S. Carnarvon taking us in charge & Uncle Sam took leave of us about 2 pm. We remained hove till 5pm. being delayed by the Ruahine`s steaming gear out of order which had to be adjusted here.\n\nLeft Bermuda 5.10 pm heading still north for Halifax which we reach in a day or two\n\n28 – E deM\n\nAnyway we are getting a trip before we get into the midst of the fray.\n\nThe weather is changing & we are getting into a cooler climate everyday.\n\nToday being Sunday 16th there is church parade and everybody who is not on guard etc must attend. We have this parade every Sunday.\n\nThere is one thing I am glad of and that is we are out of Trade winds which have been blowing ever since we left Colon. Very stiff they are too from the North.\n\nWe are in the gulf Stream and each day we pass through a great deal of seaweed floating by. This is bought from the Saragossa Sea whose edge we are now passing through.\n\n18th &","37":" It’s a case of out of the frying pan into the fire. We were congratulating ourselves having got out of the strong north winds, but after one fine day we have had squalls, heavy seas, rain and bad weather altogether, so give me the north trades before this in future. Sighted a small smack about which makes me think we are nearing Halifax which place we should arrive sometime tomorrow.\n\nThe weather here is terribly hazy one cannot see beyond a hundred yards or so in front and its\n","38":" – E deM\n\nrather an anxious time for the officers of the different boats & the cruiser which is leading the way is still steaming fairly fast as the Captain is quite sure of our position although not known to us.\n\nAbout half past three today the breeze & fog lifted & once more the coast of America was sighted some 10 or 12 miles away. At 5 o`clock we rounded a humming buoy some eight miles from the town of Halifax. Owing to the foggy weather it has been impossible to take any bearings by the sun for three days and yet the H.M.S. Carnarvon brought us right up to this humming buoy (Which by the way gives out a most weird sound) which is a very small object & about 8 or 10 miles from land. No doubt the skipper of the warboat must have had a thorough knowledge of this part of the world & as the density of the fog was so great at the time it was impossible to see more than 100yards in front of you & without that knowledge it would have been impossible for anyone to pick such a small object up. About 3 miles up on the Southern side we were grieved to see a fine hospital ship with her bows high & dry on\n","39":" – E deM\n\nshore & her stern submerged. It was the hospital ship \"Latisha\" which was well known out of Halifax as she had for some time been carrying the sick & wounded back to Canada from the war zone. \n\nBy accounts it happened in the following way. The passage up to the town is somewhat narrow & careful navigation here is absolutely required, but in this case as in many others somebody blundered. He pilot bordered her & asked (so the evidence goes) the officer of the watch had they passed a certain buoy & he was answered in the affirmative, he then (the Pilot) gave orders full speed ahead & within a few minutes with a fearful crash she was practically hurled her quarter length on the rocky coast, just here the coast was rather low lying otherwise had it been a bit more southerly there must have been a great loss of life as there were 600 sick and wounded soldiers on board. 200 of which were cot cases. All hands were safely landed & I believe no lives were lost. This happened on the 1st August and their she lies a fine boat destroyed within less than an hours steam of her anchorage. There\n\n31 – E deM\n\nis some talk of trying to get her off.\n\nAt the entrance to the harbour proper there are submarine nets, but in this case there are two lots of nets a distance of 200 yards separating them & like Colon they are closed every night & opened in the morning. We all came safely to anchor, the last one the Medic dropping hers about 8 pm. \n","40":" Today is a beautiful sunshining day typical of an Australian Spring day without a cloud to be seen and to us who have had nothing but rain for days passed is quite enjoyable.\n\nHalifax as we see it from the boat is an extremely pretty little place with a population between 40,000 and 50,000 inhabitants. The harbour is nearly landlocked and extends some distance up and is capable of anchoring numerous ships. At first glance it seems very small as the land being close in on it and thus hides a great portion of the harbour from view. Behind where we are anchored is Lollah fort named after the island it is on, it is a small island about a mile in circumference right in front & inside the heads. In front is Halifax. The sig-\n\n32 – E deM\n\nnalling station is on a hill rising straight up from the town which makes an ideal place of observation. On our right is Dartmouth where in capacious and well wooded grounds is the Mt. Hope Hospital for the insane. The grounds are extensive and reach to the water’s edge with a fine building standing on the brow of a hill. Some 300 or 400 yards further back on this side they have several mills including one very large sugar refining mill, also numerous oil tanks, the rest is principally private homes which look extremely picturesque nestling in among the fir trees. They go in for great variety of colours. Here you see houses painted green, yellow, red, grey and various other colours. They are mostly built of shingles.\n\nThe people are decidedly American, some with a decided touch of French in them. They are very obliging & hospitable, treating those who have had the good fortune to go ashore with the greatest of hospitality and kindness. I was sorry I had not an opportunity of going ashore here. It came out in orders that general leave would be granted for tomorrow Thursday the","41":" but as luck would have\n\n33 – E deM\n\nit the following was posted within an hour of the above notice-\n\nCapt. Superintendent H.M.S.Dockyard Halifax\n\nCommanding officer \"Anchesis\"","42":" It is regretted it is impossible to give permission to any officers (?) or men from transports in Port to visit the Shore tomorrow Thursday, unless for urgent duty reasons.\n","43":" p.m.\n\nUnsigned\n\n(Stamped) H.M.S.Dockyard, Halifax. \n","44":" after once more looking forward to going ashore we were again disappointed. Of course the officers accompanied by the nurses got ashore alright ready and waiting first thing in the morning and did not show up again till late in the evening. Some of the men took their disappointment very hard but having seen such a lot of troopers at Fremantle W.A. and what happened in each case when the men got ashore, I was neither surprised nor greatly disappointed. This town of Halifax is a dry one, beer and spirits have been cut out since","45":"\n\n34 – E deM\n\n& although there are hotels etc it is impossible unless at a private house to get any drinks. If a person should want any beer he must order it direct from the brewery & get it sent to his private house for private consumption. Spirits you must send to Quebec or elsewhere for it & that also is for private consumption & not for retailing out. I believe there are here as in Australia places where it can be had sub rosa but if the vendors are caught the fine is heavy and in some cases imprisonment for six months.\n\nThe weather here just now is delightful but prior to our arrival it had rained for weeks. In winter it freezes from 10 – 30 % below zero but also rains a good deal during the summer.\n\nAt present there is plenty of work & skilled labour is paid for at the rate of above 11\/- per diem of 9 hours.\n\nYesterday another boat joined us the S.S. Carmania. We are being delayed getting another cannon fixed up on our stern the one we had being too small, also one forward on the bows.\n\n35 – E deM\n\nIt was a grand sight to see the \"Carmania\" coming in, she passed close to us & had 2,500 American Soldiers on board. This is the boat that on the","46":" (I believe) sank the Hamburg Auxillary line Cape Trafalgar after a heated go in between them, the \"Carmania\" being very much but not seriously.\n\nOn account of the above order countermanding our leave a deputation went ashore with our adjutant and were successful in getting the order countermanded & at 12.30 pm a tug came alongside and took us over to Dartmouth but our O.C. would not let us go to Halifax so I did not see the town proper. We were very well treated indeed & they gave the school children a half holiday for the occasion. It is not a very large place only the suburban portion of Halifax and a ferry runs across every 15 minutes, we were ashore 3 hours and through the kindness of the residents enjoyed ourselves very much. We were the first Australian troops to call and I am glad to say owing to the town being \"dry\" everyone on our boat conducted himself properly and \n\n36 – E deM\n\nwe had the good \nfortune\n wishes of all.\n\nThe children here do not, I suppose owing to the cold grow so sturdy as the Australian Colonials & a very noticeable feature is the very bad state of the teeth of the majority of the youngsters. \n\nLiving here is higer than in Australia and the wages all round do not compare favourably with Australias \n & the wages all round\n","47":" No more leave as some as usual overstayed theirs & so spoilt us from going over again. Twas ever thus.\n\nGot orders to get ready to sail at 5pm. There are fourteen troop boats, several auxillary war boats & others. Punctually at 5 pm. The boats began to get under way. The Carpathia leading and the others proceeding in the following order- \"Kroonland\", Mongolia\", (a new one) \"Themistocles\", \"Ionian\", \"Canada\", \"Carmania\", \"Ruahine\", \"Krokoia\", \"Anchises\", \"Miltiades\", \"Orita\", Orissa\", \"Grampion\", the auxillary cruiser Victoria, bringing up the rear. I was on the bridge as they passed out checking their numbers, & it is one of those sights that one rarely has the chance of seeing. It was a \n\n37 – E deM\n\ngrand sight to see all these boats with their soldiers answering the call, and I wondered as they passed by what would the Kaiser think to see these boats with all these men on board coming not only from America, Canada, Australlia in such numbers but every part of the world to help in this great cause of freedom.\n\nThe Medic was left behind at Halifax owing to her not being speedy enough for us. Her compliment was transferred to the Orrisa & the Ovila.\n\nThere are approximately 17,300 soldiers all told, almost an army in itself.\n\nReached Liverpool safely after being met by 14 destroyers at daylight on Tuesday the","48":" and got at Park House Camp Salisbury mid-night same day\n\nSapper E de Mouncey\n\nDiary Part II\n\nE deM\n\nS.S. \"Runic\" at sea","49":"\n\nWe left Weymouth on Monday 23rd September for Liverpool, Embarked that night & sailed under escort 12.30 pm. Tuesday. As a rule the troops are generally three or four days sometimes longer on board before sailing, but I am glad to say we were more fortunate getting away so soon. The way we were steaming the first few days made us think we \n were steering \n would go back to Aussie via the Panama but a few days out, our escort of destroyers left us they with their convoy heading for America and we for the Cape. I was a little disappointed as I should liked to have seen mother, Una, Lorna and the rest of the family before finally reaching the as it is hard to say when I`d visit the East again.\n\nThe journey to WA. Will take about 7 weeks and by the time the voyage is over I`ll have been around the world. I have a lot to be very thankful for indeed, here I am homeward bound and have come so far without any \n\n2– E deM\n\nserious results although it will be some time before I am myself again. At present I am enjoying fairly good health although of course like the majority I went through a bad time in France. You cannot without being there realize the awfulness of it all & I can hardly realize it yet that I am really homeward bound. How on earth anyone gets out of it I cannot understand. It is one continuous roar of guns and big ones at that. At first you take no notice of their bursting overhead & all round but after a time, when you have seen fellows falling all about & you get blown up once or twice then you become to get a bit windy. In civilian life the thought of a broken limb would be something awful but its very common in the lines to hear the men wish for a loss of an arm or leg if a fellow gets a leg or arm shattered he is looked on by his mates as a very lucky beggar and they congratulate him, and regret it is not themselves who got it. \n\nI do wish it were all over for all the boys sake. We had the wind up very badly on the \n\n3– E deM\n\nnight of the 25th About 6.30 pm I was in my hammock dozing when we heard an awful explosion and felt a dreadful concussion & you could imagine you could hear the iron plates of the ship being torn apart it was fearfully realistic, every body thought we had been struck by a torpedo & of course there was a stampede for the boats. By the time I had got out of my hammock there was not a soul left below but myself. Whilst making up my mind what to do another roar and concussion occurred and I naturally thought we had got another torpedo into us,& I was just making up my mind to make for the boat I had been allotted to, when to my great surprise and delight I heard them returning singing out it was one of the guns that had been fired. By jove some of the fellows got a terrible shock & small wonder. As for myself strange to say I did not experience the slightest feeling of fear & was taking things quite calmly but all the same was more than delighted it was nothing serious as we have a number of cot and helpless cases on board\n\n4– E deM\n\nYou can understand what our position would have been had it been a torpedo.\n\nThe facts are that one of our destroyers about a quarter of a mile away had dropped two depth charges & the noise and concussions were such as to make us think that the ship had been struck. No doubt they saw a submarine & so put it out of action before it had time to discharge its torpedo for which thank god. These charges are dropped from the stern of a destroyer which has to put up its best speed to get away before it explodes, it being effective on a submarine anywhere within a radius of a 100 yards or more.\n\nThere is no mistake about the good work we (that is our navy) and the yanks have been able to do with these charges. This accounts for the comparatively few boats we are losing now. A couple of months ago a transport homeward bound to Aussie laden with returned \n soldiers\n wounded and sick soldiers was torpedoed 24 hours out from Liverpool, but no lives were lost I am glad to say and they all returned to camp none the worse for their\n\n5 – E deM\n\nexperience with the exception they lost everything.\n\nI was evacuated from the firing line on the","50":" from a very hot shop called Villas Brecneaux, I amongst 800 were gassed some of them very badly indeed. I being more fortunate was not so badly burned. Fritz put over gas shells for 17 hours in a sector of ½ mile by a ¼, it was hot I can assure you. Although that was pretty warm we experienced a much hotter day on the 5th \n August\n April when he put over terribly heavy high explosive shells for nearly 24 hours. They fell just like hail and yet strange to say although there were a great number of casualties a good number of us escaped without a scratch.\n\nThey were falling & bursting all round us dozens to the second & the country round about the day before which showed no signs of shell holes, after the barrage you could not take a step without walking into one. Horses and men lying all around for some distance, it was a fearful \nsight\n time. We had no shells of any kind, and all one had to do was to sit through it all &\n\n6 – E deM\n\nwonder who was next, but like everything else it came to an end.\n\nWe moved to a big chateau about a mile back, several being hit getting there & two or three killed at the chateau itself. In my letters to mother I have mentioned this chateau. Here remained some days. \n\nWhilst at Laverville about the 29th March I got a bit of shell shock. He had been shelling as usual blew in the side of a room with a 5.9 where 5 of our men were siting without injuring one of them. I was near a big building when over came a beauty landing just near me. Brought the whole structure down about my ears and burying me amongst the debris. I got such a shock I did not recover for a couple of weeks, and the","51":" stunt did not improve things. \n\nI was in hospital six weeks in France & having been marked unfit for further service was evacuated to England where I arrived on the 1st of August.\n\nI spent 7 months in France & Belgium was as far north as now the historic Ypres, although Fritz tried again & again to get this city they were never really \nsuccessful\n in it\n","52":" – E deM\n\nalthough close on the outskirts. It has been bombed & shelled to such an extent that there is nothing left now but a heap of bricks & a few odd walls, here I used to go a couple of times a week for a bath, & it was always getting a warm time from the Boch. I was as far south as Albert when the Madonna & child on the top of the cathedral tower could be seen for miles around. This statue had been drooping towards the earth for some time, having been hit by a Fritz shell but was ultimately dislodged with a portion of their tower by our own shells. This tower was a danger to us being used as an observation post by the Germans & we had no alternative but to destroy the tower which was done. As a matter of fact I was watching the effects of our batteries on the church when it was shattered one afternoon in April. From here we went to Villers Bretneaux in the Somme where you know the Aussies did such good work counter attacking the Germans and getting it back & holding it after it had been taken from the Tommies by the Boche. This now is all\n","53":" – E deM\n\nancient history as Fritz is miles away from the scene of these famous battle grounds. Nearly all the towns and villages of Belgium & the Somme are all raized to the ground & in places not even a sign of the village or town is to be seen practically wiped away as if they never existed. The French soldier is a wonderful chap & to my mind the best soldier in the world very indifferent to appearances when in the lines not like the Tommy army that has to keep his buttons, the brass work of his harness bright, his limbers & harness clean. Froggy & his officers do not worry about these unnecessary details which are not essential after all in winning great battles.\n\nThe French are business like & methodical, & are out to win without any of this nonsense of polishing up & breaking the soldiers heart, this sort of thing is the bone of contention in the English army it does not apply to us to the same extent because we don`t care whether out boots are clean or not or nore do out officers but with the Tommies it is different. One day an English officer came up to a French battery of 75s polished up fit for a drawing room the sun was being reflected back by the brass work of his equipment, the French officer was terribly\n\n9– E deM\n\nannoyed at him riding up to his battery shining like that and immediately ordered him away it is most important that the position of a battery should not be known to the enemy. So as to keep him from shelling it,& this English officer was doing what the French had been trying so hard by camouflaging & other means not to do that is drawing the attention of the enemy to this particular spot so he was hunted away without further ceremony.\n\nThere is nothing shiny about the French soldiers & the way they have struck it is wonderful & they have never doubted but that their day would come sooner or later. And in the large towns such as Abeville, Etaples Rouen etc. you would hardly know a war was on only that the estaminet (or boozer as the soldiers call them) close at 9 pm. & all lights are turned out leaving the towns in darkness on account of the Gothas who visit these back areas after dark.\n\nIn the summer it is still light enough to read by at10 pm.. & after 11 before it is perfectly dark. Twilight is all very well in its way but it has its drawbacks as one does not fancy going to bed in broad daylight & its generally pretty late before we turn in, but we never got up in the morning till about 9am. One advantage of being a signaller.\n","54":" – E deM\n\nin these larger towns there is plenty of diversion. one can enjoy a real good time. The French people treating us very well & they go about enjoying themselves having great faith in themselves & their allies. If there are civilians in any of the villages they remain till Fritz advises them that he is going to shell the place on such & such a date & then they leave. This information is generally conveyed by small balloons, they are sent floating over our lines & brought down by machine guns. They contain messages to the people of the different villages & are delivered by our men to the village concerned. Of course this is not done in every case but very often & they get to know by othere means, anyway you generally see them moving out a day or two before Fritz starts sending them over (the shells). Although it is pretty warm in the lines the boys generally find something to do to pass the time away when not fighting, playing card, mostly nap & poker also \"two up\". Never mind when there are Australians either in small or large numbers, some one will start spinning pennies & from small silver bits it soon gets into pounds, you see this in the lines and out of it, of course it is against regulations but its all one to them. \n\nThe boys generally speaking very rarely get\n","55":" – E deM\n\nthe blues, one thing that strikes one is the great longing they all have to get back to Australia whether they are in England or France. There is always something to take ones mind off the serious part of the business its wonderful how light hearted they all are to how they are continually cracking jokes & other pleasantries they go in for without one another & however hard the life is, however many shells may be coming from the Boches, there is always a smile on the lips be he French, American, British they are all the same & you will hear during the heaviest shelling some funny remarks from one or the other.\n\nI liked France very much & now and again had some very pleasant times during my short sojurn there.\n\nWe left Le Havre on the 31st July arriving safely 9 am.next day at Southampton. After a beautiful passage across. But I am sorry to say a few days later in the same water the \"Warilda\" a hospital ship was torpedoed when unfortunately a number of lives were lost. The above boat I knew well, she used to sail between West & East Australia. One thing about the Military is that they believe in the troops being in plenty of time to catch either \n","56":" – E deM\n\nboat or train. We had to get up at 3 am. To catch the train for Liverpool which left Weymouth at 6.00 & only a quarter of a mile from the camp. When catching our boat from Le Havre which left at 10 pm, we arrived at the wharf at 3pm. this was to ensure us getting there in plenty of time & should not miss it. Although the steamer was there waiting we were not allowed to board until just before sailing and as we were not allowed off the wharf to get any liquid refreshment we all were in despair of getting anything to drink but after hunting round about the wharf (the main wharf had been turned into a hospital for the yanks) I stumbled upon wet canteen stowed away in an out of the way corner where I saw numerous barrels of ale. I immediately conveyed the glad tidings to the troops firstly tasting it to make sure it was genuine. In a very short time the boys were gathered round making short work of the beer. We remained there till we boarded the boat thus relieving the monotony of an otherwise tedious wait & feeling somewhat in a better frame of mind. A sergeant from WA & I got a two berth saloon cabin to ourselves & slept well till early morning & were half way up the Solent & within sight of Southampton where we\n","57":" – E deM\n\narrived shortly after. We had a good breakfast of bloaters which we thoroughly enjoyed, it was the cheapest feed I ever paid for in England costing us 5d each, anywhere else the same breakfast would have cost from 1\/6d to 2\/- each. The station being a mile or so away was too far for some of us to walk. So we waited for a motor which did not arrive till nearly 12 o’clock thus missing the main crowd who caught the 11 train, ours not leaving till 2 pm. So we had a couple of hours stroll round the town paying sundry visits to any inviting looking establishments. We arrived safely at Weymouth in due course & was duly removed to Littlemoor camp a day or two later. This camp is one & half miles out of Weymouth & you would see of an evening after 4 o`clock, men in crutches & sticks hobbling into town unable to resist the fascination of being once more amongst an English speaking crowd. I would walk in & motor back.\n\nJust out of this camp is a little village called Upway a very pretty little place as most English villages are. It also like most of these places has some place of special interest. The pride of this village is the wishing well where an old lady looking a century or two\n","58":" – E deM\n\nold for a fee hands you glass of water from this well and after wishing & drinking some the balance is thrown over the left shoulder. I think it must be genuine as my wish so far has come true it being a speedy return to Aussie & I only hope that all good wishes made at this well, have, & will come to pass. Of course the Aussie soldier must have his bit of fun out of it. As we were waiting our turn in close order one of the boys after drinking instead of gently pouring it over his shoulder dashed the contents into the face of the man behind which caused a good deal of laughter. The rest of us retreated then coming up in very extended instead of close file. The well known white horse is also a most important feature of this district, it is to be seen marked out of the side of a hill its an enormous fellow with a somewhat disjointed tail, both the well & the horse are very old relics of this part of the country. In the meantime I have written Aunt Florence who sent me a very kind invitation to come & stay with her at Brighton during my holidays of 14 days. When I applied for my ticket, the furlough clerk informed me I would have to take a ticket via London, although Brighton was between us & London but on a branch line. I protested as I did not want particularly to go to London again but it\n","59":" – E deM\n\nwas no use, so I made up my mind to stay few days there & wire aunty when I would arrive but on getting my ticket next day I found the sergt had had it made direct to Brighton after all, so I determined to spend a day or two at Portsmouth which was on the same line. I left on Thursday morning a beautiful day in August this month without exception is the best of the year, the weather being beautiful & warm. Portsmouth is a fine big place & like other watering places well patronised by visitors at this time of the season. The old \"Victory\" of Nelsons time is still to be seen floating here although open to the public.I did not have time to go aboard. It is one of largest naval depots & nearly all men in blue are to be seen here and very little Kakhi.\n\nI remaind till Saturday, having gone to the theatre and looking round the place as much as possible in the gem of watering places & greatly patronised by the wealth people. Here you see the wealthy Jew & his family adorned with their flash jewellery & greasy coarseness, they have left London & come to Brighton as the latter place is safe from air raids & they come here to get away from any chance of being bombed by the Gothas. There are some splendid hotels with accomodation for almost unlimited number. One class come down and are called guinea\n","60":" – E deM\n\npigs as a guinea is the charge for the week ends, hence the name. All sorts motor down from London on Sundays & as of course the fair sex predominate you see them sitting round in very careless attitudes showing a good deal of lace etc. sipping their different beverages & smoking cigarettes. Being an Aussie there is a continuous flash of the glad eye from these unaccompanied fair ladies & were it not that we were unmanned from the fascinating dart of cupid I am sure we would soon fall a victim to their blandishments & join in with them.\n\nThe Aussie soldier is a very very popular chap indeed with the majority of the feminine portion of the English people, that is easily accounted for they have made a fuss of the girls, practically brought them out of the old groove they have lived in so long. For instance a tommy takes his dinah for an evenings outing he treats her to the 3d or 6d seats in the pictures or theatre, buys her peppermint lollies has fish and chips for supper, takes a twopenny tube or a penny bus or tram home. She was quite satisfied with this till the following happens. The same girl meets an Aussie a night or two after the above outing first thing he does is to buy her the best box of chocolates he can get, pays for the best seats in the theatre or pictures expense being no object, she reclines back in the plush seat of the dress circle or front stalls trying\n","61":" – E deM\n\nto make herself and people think she has been born to it & thinks of the difference between this & the 3d or 6d touch of the night or two before. She is then taken to one of the best places in town for supper amongst officers and ladies of all degrees here again she compares her fish & chips in some oily smelling restaurant & at last when homeward bound nothing but a motor car is good enough for her, think of the contrast & home she goes pleased with herself, her Aussie boy & the outing & having once tasted this kind of life is it any wonder she does not wish to return to the former state & after thinking it all over next day she decides to drop her old sweetheart & thus tommy is left. Mind you nearly all the English lassies at present dress well, so she never puts herself or you at a disadvantage when you take her out & she is a charming companion & can as a rule, run rings round the average Englishman. Tommy on this account does not like us they have no chance, they cannot compete with the Aussie nor have they the assurance that our boys have. Well to return to Brighton I arrived about midday Saturday and after lunch took a train to \n","62":" – E deM\n\nHove which is the \nplace\n of Brighton, and finding 36 Brunswick Square knocked somewhat timidly at the door, as the camp life is still strong upon me & it hardly seems possibly I am to be the guests of the folks in this huge 5 story mansion, after so many months of cellars and dugouts, the contrast for the moment was too great, I was brought to my senses by a study in black & white, asking what name please? & trying to gather my wandering wits, I stammer \"Sapper de Mouncey\" not having brought any visiting cards with me.\n\nBrunswick Square is built (three parts) of very grand houses of brick & stone, very imposing indeed, with a garden in the middle of the square & the eastern side opening on to the promenade & sea. 36 is near the top of the square with goodness knows how many rooms. I was ushered into a large room with lovely oil paintings & beautifully furnished, but what struck me most was the amount of all kinds of china, china tea, breakfast dinner & other sets on shelves & in glass cases, the room is full of all kinds of other\n","63":" – E deM\n\nweid & grotesque china & I wondered to myself what its all for, when later I find Aunty is one of the best judges of old China in England. China is one of her hobbies (she has another) I found in every room more China. She sold some thousands of pounds worth of this hobby to advance her other hobby. Aunt was not there but Uncle Harry was there to receive me. He is in uniform being a major in one of the Sussex regiments, an eye specialist & all cases of eyes that come to the military hospitals in and around Brighton are attended to by him. He being English and I Colonial, there for a very short period is a little shyness which quickly wears of. This shyness is very prevalent among the better class of Englishmen with strangers & that accounts for a great deal of their reserve. We became great friends & I really belive he was as sorry when I left as I was at leaving.\n\nPresently in walked Aunt Florence who welcomed me in the real old Aussie way & although she has been so many years in England her heart still is with & yearns\n","64":" – E deM\n\nfor Australia. She looked really lovely such a sweet good face and very much like Mother, so different from what I expected. I thought she would look old plain & bad tempered & all sorts of funny things, but instead there was a little angel if ever there was one on earth. I grew to love her very much indeed. Of course I told Aunt Florence about Mother, Una and the family etc and told them about mother adopting Doreen & Uncle Harry laughed & passed a remark about it being in the family. I did not understand what he meant, but I did later. A neice of Uncle Harry`s stayed with them sometimes & was there during my stay. She was born at Chatswood Sydney about 22 years ago but both parents are dead she is rather a nice girl & she & I got on very well together, but unfortunately took ill some few days before I left which put an end to our promenades. She having an income of her own makes her somewhat inclined to be self willed. Se went in for gardening as a means of augmenting her income. I laughed when she told me about it in all seriousness,\n","65":" – E deM\n\nthat ladies made a study of the above to gain a livihood. She having to pay for tuition to learn how to dig, weed, set seed & manure a garden properly, but I was not surprised when she told me she had given it up and I told her so. \n\nShe is now going in for massage treatment & after wielding the spade so long, I pity the poor unfortunate delicate invalid that she gets to wok on. Whether it will be like the gardening, a novelty for a time & then given up remains to be seen. She and I used to visit the lovely large piers jutting out from the promenade which at night during peace time was one blaze of fantastic lights. A charge of 2d each is made the band plays in one or the other every afternoon, there being some half dozen. Deck chairs are provided which necessitates another little dip to the tune of 2d each. In England its nothing else but little dips or otherwise (mostly otherwise). The weather is beautiful, the sea calm & covered with small boats. The beach is crowded with women & children & mixed bathing is very popular. On the pier itself\n","66":" – E deM\n\nmay be seen some of the beauty of England & what with them in their cool summer dresses the lovely weather and the band all add to the charm of passing a pleasing afternoon in such pleasant company as one lady cousin. \n\nDuring my stay here, I see a great deal of Brighton & the surrounding Country. The downs at this time of the year looking beautifully and green, such a green that is never seen in Australia. \n\nOne Saturday afternoon Uncle Harry took me out to a place called Kingscote some distance away to see the Cruickshanks, Mother`s & Aunts cousins. They live in a very large mansion with an enormous library, polished oak floors with skins of different animals that he had killed in Africa he being a big game hunter, he has also a large room filled with stuffed animals including two lions both of which he killed the same day they being together at the time were brought down with two consective shots. He is (Harry Cruickshank) in receipt of somewhere about\n","67":" – E deM\n\n£25,000 a year. There are acres & acres of ground also a small village belonging to the estate. They treated me very kindly indeed & wanted me to stay with them but of course I could not as I was due back on the following Monday. Aunt Florence not liking town life decided on buying an old fashioned Cottage where she & Uncle could live after he had retired from his practice. After some little time she hit upon her ideal & bought a very old place about 500 years old ten miles out of Brighton but to her great disappointment Uncle would not live there, it being too quiet for him. She has it furnished to her liking more China & pictures a delightful little house within close vicinity. She has bought another house which contains her other hobby in the shape of 20 adopted kiddies all girls with the exception of two or three little boys. They are the prettiest kiddies I have seen all happy and very bright there is one little Indian girl about 5 black as can be with large black eyes such a funny little thing. They all call Aunt Florence Aunt & very fond of her.\n","68":" – E deM\n\nUncle Harry does not care too much for her hobby, aunty goes down amongst them every day. She has three governesses looking after them & educates them in every branch, there are no less than three pianos for their use. They are mostly the children of officers at the front whose mothers are dead or engaged in war work. In some cases she gets a small remuneration but she gets nothing for the majority of them – the whole of the expense is born by herself. There is a gymnasium & skating is also taught, also plenty of ground for them to run about in, & the scenery and surroundings are perfect for a little home of this kind. Their ages range from sixteen to two years of age.\n\nI received a telegram from the camp to return four days before my leave was up as I was on a boat roll. Uncle`s official motor was put at my disposal (his two having been taken for war use) one Monday morning & with great regret I said goodbye to Aunt Florence, Uncle Harry met me at the station & where final goodbyes were said, & once more I was off to camp & the pleasure of being\n","69":" – E deM\n\nfree was brought to a close.\n\nOn arrival at camp found to my great disappointment my name had been deleted from that boat roll on account of me being a West Australian man as the boat was going to the East. Thus I was delayed a month and four days but as it was shortly a few put on this boat roll & removed from Littlemoor to Westham camp I did not mind it so much Westham is at Weymouth. As you slip out of the camp gates you are in the town & a few minutes walk bring you on the promenade which is neither so long or fashionable as Brighton. \n\nYou notice the difference in appearance of the people, they mostly being the working class. At Brighton there were no Australian soldiers, here there are hundreds. The promenade is thick with them, in fact one can hardly get through, the crowd is so great, these men are mostly those who are waiting for a boat to return to Australia.\n\nThe promenade frontage here is only about a mile long no piers. On the right the high ground of Portland is seen, connected to the main land by Chesil Beach, this beach \n","70":" – E deM\n\nof a million tons of pebbles was washed up in one night. During a terrific storm, some years ago. A light railways runs across from Weymouth an Australian Camp is called Berne their, but it is better known as Portland Prison where the very worst of criminals are kept, it is well fortified, & there is very little chance of any prisoners getting away from there.\n\nWeymouth like all watering places has its clock tower on the promenade & when appointments are made they generally make this tower the place of meeting which means about 6 pm a congestion of both sexes waiting for their sweethearts.\n\nThere are some very delightful & interesting walks about here & on Saturday & Sunday afternoons would take long walks to the different points of interest.\n\nAfter a journey of 12 hours we arrived at Liverpool, where 12 months before I disembarked on my arrival in England. We drew out in the stream Monday night, At midday Sunday we up anchor & the last we saw of Liverpool was the Liver insurance office with its two huge sculptured birds\n","71":" – E deM\n\nstanding out clear against the sky line. It appears some years ago two huge birds settled here whilst passing & the people of that time decided to build this town & call it after the birds, they were two liver birds & Liverpool derived its name from them.\n\nOne thing in England that always annoyed the Aussie was the following legends you`d see on notice boards in every field or paddock \"Private\" \"out of bounds\" \"Trespassers will be prosecuted\" etc, we would take no notice of these signs but walk anywhere our fancy took us, not so the natives if we were walking with any of these & came to a place with one of these signs up, it would take all one’s persuasion to get them to trespass, it had been instilled into them for centuries that they must keep to the lanes & roads & not go on to any field so marked, they could not get out of this old habit. If these landowners had their way they would keep everybody off their grounds.\n\nAs we entered Birmingham Station a dozen or more red cross ladies were standing at attention\n","72":" – E deM\n\nwaiting to provide us with refreshments, no small job for so many.,\n\nWe crossed the line about 3 weeks out & as everyone with one or two exceptions has crossed the line before, father Neptune & his court did not visit us, no doubt he knew - all were all old hands so did not call on that account.\n\nAnchored in Table Bay, 8.30an","73":" but owing to a very bad epidemic of Spanish influenza did not go into the harbour. Table Mountain was heavily draped in black clouds as if in morning for the stricken city there having been 4000 to 5000 deaths within a fortnight.\n\nThe Western entrance to Table Bay has a white beach extending for miles & a little back from the foreshore runs ranges upon ranges of peaked and rugged mountains.\n\nCapetown is a straggling town laying at the foot of Table Mountain, a rough old warrior looking like some grim defender of the little town, nestling at its base. The harbour proper is very small & square with a very narrow entrance. We remained there for\n\n29– E deM\n\na few hours & at 1.30pm. up anchor & steamed for Durban. As we leave the bay Table Mountain in all its rugged nakedness may be clearly seen as the clouds which have enveloped it all the morning have now lifted. The town with its red tiled roofs makes rather a pretty picture with its making a picturesque back ground. The town extends East and west two or three miles and ends abruptly at the conical shaped hill which rises straight up from the water’s edge.\n\nAs we steam slowly out of the bay, heavy white fleecy clouds once more envelope the mountain top which makes it appear from the distance as if it were capped with snow. We hug the shore & come closer into land as we near the bluff the west entrance to Durban harbour, we reach this at 6.30 pm","74":" too late to go in so have to anchor in the roads till 6.30 am next am. & as the evening deepens into night the lights of the town show out in all their brightness & make us wish that we were once more on terra firma after our month on the water, but it is not for us as the sickness of Capetown has also reached this beautiful port. Early next morning we enter the harbour. On the right is a breakwater on our left is the bluff with its lighthouse. The entrance is very narrow & reminds one very much of a bottle. On the Eastern side is the wharf the Western side the coaling station & reserves &\n","75":" – E deM\n\npleasure grounds, at the bottom is the town, not at the foot of a hill like Capetown but built on a gradually rising hill from he water, it is one of the prettiest & safest harbours I have ever been in. You can imagine with what longing we all gazed at the shore but we are doomed to disappointment & remain out in the harbour fastened to a buoy & here we coal & water remaining 3 days.\n\nAs early as it is there is a young lady named Mrs Campbell on the wharf to welcome us & sends per semaphore a message of welcome & regret at our inablility of getting ashore. She is wonderfully kind & has fruit, cigarettes, books etc sent off for us, she does this to every Australian boat coming from & going to Australia. Every soldier who has called here know her & has a warm spot in their heart for this lady whose sole object in life seems to be in furthering the comforts of the Australian troops & trying to make their lot somewhat softer when coming to this beautiful city & she does it too, & as we finally glide past the end of the breakwater a cheer is raised, for there at the extreme end is this sweet lady sending us a final farewell by means\n","76":" – E deM\n\nof her flags, God bless her & may her future life be blessed with the happiness she deserves.\n\nAs we are slowly making our way out one of our fellows seemingly not having had enough of France & thinking to get back there quicker by staying at Durban, puts on his life belt & jumps some 40 or 50 feet off the top deck of the boat into the channel, lucky for him the propellers are moving very slowly otherwise he would have been drawn in by them & killed, he is brought on board again having been picked up by the pilot boat none the worse for his dunking. After parting with the pilot at 5pm on Saturday the","77":" we got on our course & steer once more for Aussie & if all goes well all will arrive in Fremantle in a fortnight or so. \n\nThe trip is terrible sometimes broken only by a concert or lecture, but taking the trip all through it was not too bad, and the weather taking it all round was exceptionally good. A few hours prior to anchoring the man Williams who jumped overboard at Durban jumped overboard again & although a life belt was thrown quite close to him he refused to get hold of it & sank\n\n32 – E deM\n\nbefore the boat got where he was last seen\n\nWe arrived at Gage Roads, Fremantle Western Australia at 2.30pm","78":"\n\nThe Armistice was signed that day & it was flashed to us by lamp about 10.45 pm.\n","79":" All day not a soul came near the ship. At noon the men lowered the boats & went ashore. All boats with the exception of two being taken, & over 400 men went ashore.\n","80":" taken to Woodmans Point Quarantine Station remained till Monday the","81":" arrived back Fremantle Midday same day,. \n\n"}}