{"Document Name":{"0":"Diary_0240","1":"Diary_0240","2":"Diary_0240","3":"Diary_0240","4":"Diary_0240","5":"Diary_0240","6":"Diary_0240","7":"Diary_0240","8":"Diary_0240","9":"Diary_0240","10":"Diary_0240","11":"Diary_0240","12":"Diary_0240","13":"Diary_0240","14":"Diary_0240","15":"Diary_0240","16":"Diary_0240","17":"Diary_0240","18":"Diary_0240","19":"Diary_0240","20":"Diary_0240","21":"Diary_0240","22":"Diary_0240","23":"Diary_0240","24":"Diary_0240","25":"Diary_0240","26":"Diary_0240","27":"Diary_0240","28":"Diary_0240"},"Date":{"0":"unknown","1":908.0,"2":909.0,"3":910.0,"4":911.0,"5":912.0,"6":913.0,"7":914.0,"8":915.0,"9":925.0,"10":926.0,"11":927.0,"12":928.0,"13":929.0,"14":930.0,"15":931.0,"16":932.0,"17":933.0,"18":934.0,"19":935.0,"20":936.0,"21":943.0,"22":944.0,"23":945.0,"24":946.0,"25":947.0,"26":948.0,"27":949.0,"28":960.0},"Entry":{"0":"\n\nSat. 10-6-’16 – ","1":"\n\nThis interval was filled in at Etaples Camp by physical Jerks in a.m., Route marches during forenoon, & washing parades in afternoons. On Thursday 70 men of \"C\" Coy 9th paraded in full marching Order & were inspected by a Major? \"Gallipoli\" pack\n\nThurs. 15-6-’16.\n\nturned down \n\nJ. McMahon & self evaded Dr’s inspection & are holding ourselves in readiness for the Trenches \"Up the Line\". Gas helmets etc issued late to night.\n\nFrid. 16-6-‘16\n\nReveille 2.45 a.m. Bk’fast 3 a.m. Marched away with\n\nBand playing 3.30 a.m. Down Etaples road past Hospitals (#26 Genl. Canadian) Night Nurses bade us God-speed at Dawn. Entrained with hundreds of all Regiments & got away at 6 a.m. Our crowd in Horse boxes. Weather cold. No money. Mac & self carrying extra blanket contrary to orders. Steenwerck our destination reached\n\nFrid. 16-6-’16.\n\n1.30 p.m. Got rid of our blankets when we heard of the 12 mile march ahead of us – Mac’s put on seat of Motor Transport the other given to Kiddies working on Rlys. These Kiddies & women work in father’s & hubby’s place. Allotment only = 1 Franc per diem. I pity them.\n\nFrid. 16-6-’16.\n\nMarched to Sailly. Billetted in Farm house for the night. Noted Sailly Church destroyed by shells. Germans were here a year ago & had machine guns on top of steeple. Our sleeping quarters were on straw in the Pens. Quite a homely scene. Discovered & took Mac along to see Misther Murphy.\n\nSat. 17-6-’16.\n\nAltho. Tired last night & we retired very early, we were disappointed in our sleep. At midnight the Gas Alarm was sounded. For awhile Confusion reigned until everyone was shaken awake & helmets donned Mac. & self Got up straight away put our helmets on & got out to the roadside along the Canal La Lys. After 2 hours we resumed our broken sleep. We were nicely settled when once again they got us up. (We were sleeping with clothes on of course)\n\n2 Lt. Joint fussed around & soon we were on the road again. Marched to a Theatre in Sailly. Had a Gas Lecture\n\nSat. 17-6-’16.\n\nWere told that attack of night before had taken unawares a good few – especially 270 Tommies – Ugh! After Lecture we marched to \"Lethal Chamber\" & were \"Gassed & smoked\". Then we marched to 1st Div. Baths – a matter of about 10K with full packs up.\n\nHere we were given change of U’clothing & clean Towels. Baths Hot & Cold plunges OK. Another Route march landed us at H.Q. of 7th Batt. Major Jess now Lt. Col. & Capt Bastion addressed us. Mac. Tiche Elliott & self to \"C\" Coy 10th Platoon (I wanted the 9th). Finally marched off to our respective Companies. Ted Game\n\nSat. 17-6-’16.\n\nLittle Gertie Hart, Sgt. Clutterbuck. Gordon Anderson acting S.M. during Townsend’s absence in England. These & others welcomed me back to \"C\" Coy. We were all very happy in the \"Estaminet\" where \"C\" Coy billeted.\n\nSun. 18-6-’16.\n\nCh Parade by Canadian Minister v. Good. \"Live a day at a time\". He struck the right note at the right time. Leaning against a Pear tree in the orchard (he said, \"he liked to be up against something when he talked\") he talked in a charming manner to men face to face with the \nGreat Unknown\n\nRemainder of the day our own.\n\nCows & Horses visited.\n\nMon. 19-6-’16.\n\nPhysical Jerks this a.m. Good fun. I won \"Kangaroo hop\". Full marching order again at 2 p.m. We marched as a Coy. to \"Aldershot Camp\" at \"Neuve Eglise\" Belgium. Bivouacs erected & allotted. Mac. Tich & self shared one \nhalf\n fourth of number 3 sections Bivouac. I must have the protean faculty of adaptability alright.\n\nTues. 20-6-’16.\n\n9 a.m. parade with Gas helmet Inspection. \nPatrols all night. Wed. 21-6-‘16\n\n20-6-‘16\n\nHelmet Inspection 9 a.m. Then march to Fatigue Job. We dug trench (or rather finished one already started) 6’ deep x 2’ or so\n\nTues. 20-6-’16 Tues.\n\nInto this was put 10 wires 5pr flexi R.C. & B. We covered trench in & came home about 9 p.m. I count this my very 1st bit done for \"King & Country\", as it was done under fire from Enemy & was a useful work. \n\nHot tea provided when we came to Bivouacs.\n\nTrench was full of water in places & kept falling in owning to? Prop. of depth to width.\n\nThurs.\n 21-6-’16. Wed.\n\nGuns Hel Insp etc. 9 a.m. Fatigue again to-night at 9 p.m. We marched in the Twilight again to-night at 9 p.m.& dark right into danger Zone. In Artillery formation = in this case to parties of 8 or 10 in Single File.\n\nThurs 22\n Wed. 21-6-‘16\n\nmarching close to hedges at about 30 paces interval. We passed thru a mined village (Pictures recalled London Illust. & Cinema). One corner, where was an old Church in ruins, we came under fire from M. Gun Traversing. Bulletts whissed overhead nearly all the way & buried themselves in the road all around. It was dark when we came behind the firing line about 1000 yds. From the Huns. Flares lit up the snakelike formation of \n\nthe fatigue party = 100 or more men of all regiments. We halted at 3 paces interval & then I noticed that we formed a line from our own front line back.\n\nThurs\n Wed. \n22\n 21-6-’16 21-6-‘16\n\nAll carried digging Tools as well as fight order. Each man did his 3 paces & went down 6’ = 2 shovel lengths & Width to suit himself. It was 12 mid night when we started & at 3 a.m. we had buried another 5 pu cable as before. The march home was a trial alright. I could have slept anywhere in spite of danger. Hot tea helped a lot about 5 a.m. when we reached Bivouac Camp. Transferred to #9\n\nThurs 22-6-‘16\n\nAs stated above we reached camp 5 am. this a.m. At 9 am. Everybody was up & had breakfasted\n\nThurs \n23-6-’16\n 22-6-16\n\n& packed up everything Bivouacs & all ready for to move into the Trenches to-night. We sat in our Packs pretty well all day. 9 P.M. Gene Forsyth addressed Battalion & we moved off. In 2 hrs we arrived at an Estaminet back (false Gas alarm siren) of lines & settled in a loft. Midsummer day. Battery just in rear of our loft. Midsummer day. Battery just in rear of our loft opened up & made sleep for some impossible.\n\nFrid. 23-6-’16.\n\nBk’fast in loft. Barbour & self had swim in Creek & did some washing. I am now in #9 Platoon 2nd sec. with Chas Anderson. We left Estaminet about 8.30pm & marched in very\n\nFrid. 23-6-’16.\n\nopen formation to the Trenches. We were under fire all the time & observation too. We cut thru a wood & found the going very heavy on account wet & mud. \"A\" Sector Subsidary line reached just about dark & a dugout allotted to C.R.A., Frank Sullivan, Jack Toogood & self. My 1st exp. Of duck-boards & dug-outs. Our Dug out faced West (S.S.W) & was built of Sand bags, 3\" timber, Corrug. iron, V iron & steel sections Length = 4 sleepers. Width = 3 sleepers. Height = sitting up – just Steel sec. on roof with bags of mud on top supposed to be shrapnel proof. 10 p.m. we \"Stood To\"\n\nFrid. 23-6-’16.\n\nFighting order, with Bayonets fixed in a Sap with a \"Fire step running parallel to Sap in which our Dug-out located but nearer the Enemy. 11 P.M. we \"Stood Down\". Slept in our clothes until 3 a.m. when we \"Stood To\" again until 4 am. Slept until Tea + Bacon arrived at \"Dump\" \n\nSat. 24-6-’16.\n\nJack Toogood & self Mess Ord. with #9. Difficult to negotiate slippery up-hill duck-bds. with large Dixie of Tea & issue to each Dug-out. Retd. Dixie after ea meal. Found plenty of ok Water in large Shell holes in \"Anns Croft Avenue leading to Actons Farm\". \"Stood To\" again @ 9.30 pm – 11 p.m. Enemy replied to our bombardment Noisy Noise Very ?\n\nSun. 25-6-’16.\n\n\"Stand To\" 3am – ok 4 am.\n\nGas Guard – 8 a.m.\n\nHuns not recognize Sabbath evidently as they kept things humming to-day.\n\nMon. 26-6-’16.\n\nUsual Trench Routine.\n\nWrote \"Anntat\", Gordon, & H.B. Smythe, also Base re my lost mail. Posted above with one I had already written to Kid. \n\nTues. 27-6-’16.\n\n3 am all on Dug-out awakened & ordered to proceed to Cook - house . 4 times to-day we made the return trip & fetched all Rations to men in \"C\" Coy in Trenches. Little Railway a great help but work pretty solid\n\nWed. 28-6-’16.\n\nVery tired this a.m. after yesterday. At 11 p.m. \"Stand Down\" there started the fiercest shell I have yet been under. Shrapnel, High Explosives of all Calibres dropped all around us. We knew that if our Dug-out was struck we would be buried alive beneath the solid steel roof & we also knew that roof not shell-proof only shrapnel & pellet proof. For 2 hrs. both sides kept Hell open & we feared greatly. The ground shook with the vibrations & so did my knees. Secty Gen L. Cpl & 4 others of our section retd. to-night from Bombing School. 2 of them\n\nWed. 28-6-’16.\n\nsought shelter in our Dug-out until Bombardment ceased. We then slept soundly Thanks be:\n\nThurs. 29-6-’16.\n\n50 Casualties last night & many suffering from Shock. Lt Paynton killed cruelly. Both Hips broken & Spine inf.\n\n5-6-’16 (see Pay book for Etaples)\n\nTo-night another heavy bombardment same as last night. Felt easier to-night. Moustache vs smoking scheme\n\nFrid. 30-6-’16.\n\n10 p.m. Scrty Gen, C.R.A. & self mounted as all night patrol. Heavy bombardment going on. Saw a good many shells close enough in all.\n\nFrid. 30-6-’16.\n\n. Track bet. #11 (Supports) & #10 Plat. bullet swept. We transect safely however. Gas sent over to-night again 12-2.3 a.m. during a terrific shelling.\n\nSat. 1-7-’16.\n\nCasualties = 100 approx. already. We came off duty 3 a.m. & were glad to sleep until arrival of Bk’fast. Gordon Anderson likely to go to Etaples. Hs notified office re M.G. with me. Paid 20 Fr to-day\n\nSun. 2-7-’16.\n\nAll our Dug-out wished our Mick Many Happy Returns of the Day. Things a little quieter. Orders to pack up given C.R.A. Jack Toogood & self departed 10 p.m. for all\n\nSun. 2-7-’16.\n\nnight Gas Patrol. I mounted 10 p.m.- 1 a.m. then woke C.R.A. During my watch the Germans put 9 Shells (incendiary) into a Farmouse & fired it. This caused a great confraglation.\n\nMon. 3-7-’16.\n\nOff duty 1 a.m. Awake again at \"Stood To\" 3 am. & at 4 a.m. Have had a cold since coming into Trenches. oak-leaf of Trenches \n\nThis has caused slight Neuralgia. Took some Quinine Tablets & sat in Sun reading French. Diff. in time here & Melb. = 10 hrs approx. Thought of Kid at Bk’fast time this a.m., when I was on Guard last night at 10 p.m.-1 am. This a.m. We are now in Belgiume.\n\nTues. 4-7-’16.\n\n9th Ord. Platoon to-day. Fatigue work making Sap to new Coy. HQrs. Posted letter to P’down & to Dan Toohey 59th. S.M. re my mail. Told off to take charge of Guides who will lead Eng. Regt. (\"B\" Coy West Kents) into Saps we are evacuating t-night. This Job took all evg. up 8.45-11 P.M.\n\nLeft \"A\" Sector Subsidary Line 12 midnight\n\nGordon Anderson off to Etaples.\n\nWed. 5-7-’16.\n\nArrived in Huts in Wood 2 a.m. ½ mile back from Firing line. Good Sleep. Bk’fast 10 am. Rest of day ours.\n\nWed. 5-7-’16.\n\nVisited Estaminet where we spent the night 22nd 6-’16. 7 P.M. We left huts for Reserve Trenches. Arrived Alloted Dugouts & settled down. 9 P.M. Found a Maple growing close to Dugouts also heaps of wild strawberries (praise)\n\nThurs. 6-7-’16.\n\nReveille 7 a.m. & Bk’fast 7.30. Wash in Shell-hole under trees. Quite nice waking up in these woods with the birds busy etc. Danger from Shrapnel fired at Aeroplanes by German Anti Aircraft Guns\n\nThurs. 6-7-’16\n\nMcMahon, Tiche Elliott & Self visited Estaminet N.B. how Belgian peasantry \nmake\n off Soldiers. 2 number tin salmon 1\/3. Tin of Apricots 2\/-. Slice of Bread & Butter 1½d. Mess-tn cold Coffee 5d Biscuits \"Adam\" 3 a d. Fake \"Spearmint\" 2 ½d pkt. (Oven cake 10d). Mc & self enjoyed stroll thru. Fields examining the wild flowers etc. 3 different kinds of grasses noted - all new to us. Full Mching order 9.30 p.m. Moved to Dugouts back of \"Hill 63\". Passed over same & noted number 60 too! Mix up re allotting\n\nThurs. 6-7-’16\n\nof Dug outs. Had to evacuate Officers Dug out. Finally patched & floored a very dilapidated Dugout & Rats not withstanding got to sleep 12-15 am.\n\nFri. 7-7-’16\n\nAwaked to Stand To 2-30 a.m. – 3-30 a.m. Toogood & self Mess Ord to-day. Allotted Dug-out with Cpl Gorr & 4 of us together. 9 P.M. – Fighting Order very fatigue. \nReturned 2\n\nSat. 8-7-’16\n\nReturned from Fatigue of Sap digging at 2 a.m. We had 6 Casualties. Bullet grazed me too. M.G. trained on us all time.\n\nSat. 8-7-’16\n\nSlept till 9 a.m. Bath afternoon. Full Mching Order 9.30 P.M. Marched to Aldershot Camp Neuve Eglise\n\nSlept between Bivouacs from 2 a.m.\n\nSunday 9-7-’16\n\nSports during Afternoon. Packed up & marched to Bailleul 8.30 pm. – 11.30 P.M. Billetted in large School 12 Midnight\n\nSunday 9-7-‘16\n\nAbove\n\nMon. 10-7-’16\n\nAwake 7-30 am. Bk’fast. Wained for Guard 9-35 a.m. Mounted same 10 a.m. Little girls of School Sang danced & played for us in exchange for pennies. Nearly all Orphans here. Y.M.C.A tent here very good & cheap. Daily Mail Map of \n\nMon. 10-7-’16\n\nBritish – print number 1 Sec to fitting. Shows all this country. Noted School Knitting. Very - machine–like 4 Pins used. One under Right Arm.\n\nX Marched to stn 2 midnight.\n\nTues. 11-7-’16\n\nHorse Tracks to Douellens 6 a.m. this a.m. Bk’fast & wash near river on Billeted with Mon Revillon number 22 1st Bed since Hosp. called out for Guard 10 p.m.\n","2":" 12-7-’16\n\n11.30 am. Off again. Beau pays. Short marches. Long spells. Arrived Talmas 8.30 p.m. Billetted in Barn with 60 others.\n","3":" 13-7-’16.\n\nSlept Under Apple tree last night. Cold at dawn. Rain my reveille 6.30 a.m. Enjoyed wash in Farmyard. Pet Rabbits Little Chickens. Dog called \"Coquette\" Purchased bread & Butter for our bag. Baker & wife & Grand Mere Vin Rouge et Citron\n\n \n\nGot new gas helmet after Lunch. Left Talmas 3.30 p.m. Arrived 7 p.m. & Rainneville. Billetted with Mme & Mon Clement. Dog called \"Tambour\". Paul Gente 19 + Gaston Clement 16 very bright boys. 4 cows to milk we helped old Grand Mere Clement\n\nThurs. 13-7-’16\n\na regular old skinflint.\n\nFrid. 14-7-’16\n\nParade to-day in lane for details re new method of attack copied from the Germans.\n\nSat. 15-7-’16\n\nParade today & drill 2 Boys & self got on well with our French!\n\nSun. 16-7-’16\n\nAll arrangements made for Ch. Parade at 9 am. Reveille & parade 6.30 am.\n","4":" a.m. Notified to move on 9.30 am Full Marching Orders Passed thru Toutencourt etc & arrived\n","5":" 16-7-’16\n\nVarennes 5 p.m.\n\nAllotted huts ea platoon.\n","6":"\n\nDrill. Rapid Loading etc. Horrible. Paid 20F after tea. Dir. Baths OK.\n\nTues. 18-7-’16\n\nPacked ready for moving off 10 am. Remained so all day. Mac & self searched Town for du Pain without success. \"Nm Faune Monsieur\". Wained at 10 P.M. with Quarter Guard to morrow \"C\" Coy kept out of bed until 10 p.m. for some unknown reason. Loaned ex. Cpl Pearce 7.51\n\nWed. 19-7-’16\n\nReveille 6.30 am. Got ready & mounted Guard 8.30 a\/m. Big mail in to-day. None for Joyce as usual. ex Sgt Gunther told me about Sgt Cousins getting a Star Oh Lux! New Style marching order adopted to-day. O’coat strapped below H’sack on (Pink sewn on back\\Tunic) back. My relief 11-1\n","7":" 20-7-’16\n","8":" a.m. Guard relieved packed up & marched off. Left packs at Varennes Passed thru Senlis Hedeauville & arrived \"Albert\" by easy stages 5 p.m. Bivouached in sight of Cathedral in ruins with 19 Observation, behind it on ) line ) Large Gilt figure \"Madonna\"\n","9":" 20-7-’16\n\nJust hanging ) tower suspended by its base. Factory Chimney have a decided kink in them. Transports named \"Bon Crachit\" \"Nat Winkle\" \"Lancashire Lass\" \"Bit O’ London\" 19 Balloons within ½ mile \n Slept in clothes c W’proof under & O’coat over only very cold. No sleep for most.\n","10":" 21-7-’16\n\nM. Ord, to-day with Hollier. Instead of Parade 3 of us on Lines Fatigue. Heath & self visited Town of Albert. Struck by size of abbey ruins. Madonna in Gilt with Child held out blessing City = 50’ suspended at R. angle to tower. No Civilian pop. Passports granted Majority\n","11":" 21-7-’16\n\nlast May to remainder of Civilians who fled town. During A’noon Anderson & self again in Town. We went thru ruins of a ) Sugar factory also Schneiders Sewing Machine factory & Foundary. Several private dwellings entered two. One evidently Resid Flats, top milliner, Next Chemist & Clergyman Found remains of Laboratory & a library. Had to leave some valuable busts here. Small china jug beautifully made a big temptation. We were all ready & wained at 9.30 p.m. to march to our Enemy. Nothing doing saw Lt. Barker M.G. Cry.\n","12":" 22-7-’16\n\nAwaked after Midnight \"Gas Alert\". Affixed Helmet to Chest & fell asleep again. Drill 9.30 am – 12 Noon. A’noon Physical Jerks & Church Service. Packed moved off 6.30 p.m. bound for Sausage valley midway bet. Albert Pozieres where was the old German front line of Trenches. We passed (in single file at big intervals) thru. a veritable battlefield. Description = X bet. A Q. Masters store & a cemetery on Resurrection a.m. Charlie & self explored one dug-out of Germans = 30’ deep 2 stairways, Canadian store with pipe for cooking etc. 3 Wire Mattresses\n","13":" 22-7-’16\n\n& other evidences of comfortable living & also provision for a long stay. Part of","14":" B’gade moved out as we moved in. We started a big fire & I searched & found a German Dixie & filled same at W’cart on road & we had Cocoa & Biscuits & cheese supper. \n\nSun. 23-7-’16.\n\n1 a.m. still up at fire. Charlie self slept at intervals on M. G. emplacement. Very cold with only O’coats & W’proof sheets. Up at 4.30 a.m. Started fire again & was looking around for water when orders came to dump O’coats & move on to Support the men who had taken Part of Pozieres during the night\n\nC.R. Anderson\n\n13 Browning St.\n\nSeddon\n\nVic.\n\nStruck water Camp. From \"Gordon Dump\" to Trenches in Petrol tins. All along we passed evidences of last night’s fray. Dead & dying every where. Stretcher bearers hurrying past with bloody stretchers & wnd. figures. Sickening horrors in the trenches Germans & our own dead uncovered. One man of ours blew himself & mate up with Mills bomb in pocket. Phosforus & stink fare use to a horrible headache & I lost all interest in the war. A’fternoon we dug shelves & with Equip on & W’proof sheets over us spent the night in fear & trembling. Shelling fierce.\n\nSun. 23-7-’16\n\nScratchy Wilson wounded thru both arms. Brewer of #10 Platoon badly hit. A nip of rum at midnight very acceptable as no tea possible on a\/c fire showing position. We are 700 yds from Poziers & our Enemy. Our Div. took R. side of this imp. Village & as I write the Tommies are shelling their portion preparatory to attacking it & capturing it. Bill Barbour & other Orig. #7 of Peninsula fame admit that this is much worse than ever they had on Penin. \"It was Child’s play compared to this\" said one. We managed to secure another w’proof sheet & O’coat which had been dumped by the other B’gade. Very acceptable.\n\nMon. 24-7-’16\n\nPermission granted us to make tea. This was a Godsend. Never did tea taste so good. Water & wood scarce former not too clean, but when hot the drink was Nectar & now I have an new interest in surroundings 50 yds. Over parapet there lies one of our Aeroplanes brought down by Germans. Charlie & I intend sneaking out to-night & looking her over. We did so & collected some souvenirs. Order came at midnight to prepare to move to support of our A & B Coy’s. McMahon buried 11 P.M.\n\nTues. 25-7-’16\n\n1.30 a.m. we moved into Sap parallel with our own but leading directly to Fritz at Poziers. Here we stayed until noon. Much happened in that time. From 2 am – 2.30\n\nTues. 25-7-’16\n\na.m. we witnessed the fiercest bombardment etc. 400 yds. away that any of us had seen. This was kept up intermittedly until dawn. With the dawn & long before arrived the wounded. 4 a.m. shortage of Ammo & Bombs reported from firing trench. Charlie & self continued carrying same from Reserve & Gordon Dump until 10 a.m. \nall day\n On the 1st trip to firing line I experienced the raw recruits experience of seeing our dead everywhere. Coming back from line to Dump we were assisting the S.B. with a hvy wounded and was in front shafts when I heard a voice with something familiar about it say \"They’re making it pretty willing aren’t they?\" On enquiry from our S.B.\n\nTues. 25-7-’16\n\nI learned that it was Keith H. of the 3rd R.A. coming back with shells for Trench Mortars I encountered him carrying a man we had indicated in the up journey who had fallen in the track. \"Here Bill take hold of this ‘till I have a chat with this Bloke. This in answer to my \"Hallo Keith how are you?\"\n\nFor 3 mins we exchanged ? & answers. He had no mail for 3 mos. Been Transferred to #3 F.A. Only 1 sec. of S Aus in # 3 F.A. He looks well & seemed quite at Home. Notwithstanding the constant danger he was in. Introduced Charlie. Passed him a couple of times later. Last time as I carried Charlie to Red X Ambulance.\n\nTues. 25-7-’16\n\n10 a.m. we had to report to C Coy. Prepared to Reinforce front line. Under a very hvy bombardment we made our way to line. Gas turned on us made progress very difficult. Enemy had range of communicating trench too true used his knowledge to our disadvantage. Bombardment at Poziers \n worst of all at any front of line not excepting Verdun. After hanging in for a couple of hours word came thru that no counter attack coming & we were withdrawn to","15":" line Casualties all the time every shell almost. Charlie & self with 5 others buried. Saw to Charlie 1st found him breathing Cleared next man’s head & lungs\n\n \n\nTues. 25-7-’16\n\n& made for 3rd Found when pulled out to be almost gone. His legs broke under. By this time sufficient help with shovels in \n spot to dig out remainder so I retd. to Cobber Charlie with great difficulty (He weighs 14 stone) we got him over \n & with Cpl Fraser’s help (A boy’s scouts) succeeded in restoring him to \n \n\nShells dropping all around. I took him out of trench because more shells dropping in than out of Trench & it was full of men. A & C Coy. occupied 100+ yds of it. Frank Sullivan & Jack Salter helped to carry Charlie to 1st Dressing stn. Where his case was diagnosed as Shell Shock. I accompanied S.B.’s of F.A. Coy.\n\nTues. 25-7-’16\n\nHere split up & divided amongst other 3 Platoon Barbour & self to #12 9.30 p.m. We retd. to trenches on left this time. Felt rather weary of it all. Had no equip. hence no covering.\n\nWed. 26-7-’16\n\nMcClean & self slept in \n trench within \n Very cold. Woke up\n\nWed. 26-7-’16\n\n & sought something warm. Found 3 sand bags to put over us. Pulled down a part breastwork & laid upon it until a.m. All night long Shrapnel & high explosives burst around us; files of men marched over us & still we slept the sleep of the truly \"All out\". During the a.m. I went for water to Gordon dump & had a wash (1st for 3 days) Discerned Gunner Dreine behind a very active 18 Pdr. He \"will always take off his hat to the Infantry\" he says. During A’f’noon I picked up some equip. an O’coat & W’proof sheet. Our Trench came in for some hvy. shelling & I witnessed Comrades being hit. My Helmet stove in.\n","16":" 26-7-’16\n\nevery few minutes C’main Jack Woods amongst them, also \"Pretty\" Morrison. Required all the fortitude you have inspired to keep me & help by example to calm others. We #12 platoon took Rifles & Bandoliers & marched (or ran rather) to Gordon Dump for rations. Here news awaited us. The","17":" Div. to be relieved that very night. This was confirmed & we slept around \"C\" Coy’s Cooker all night. Good feed \n \n","18":" 27-7-’16\n\n4.25 a.m. awaked by noise or something. I stole away back to when Charlie & I had been burried. I was after my diary & Charlie’s Haversack. After risking it I was doomed to disappointment.\n","19":" 27-7-’16\n\nBoth haversacks looted. Discovered","20":" Diary tossed to one side a little way up. Goodbye #2. This is #3. To-day I am a soldier of 1 yrs service & find myself risking life & limb for these records. These days it’s a case of \"Courage rising with danger\". Much too busy to worry. Later on 8 a.m. or so we found \"C\" Coy in old German trench in Sausage Valley. Moved again 6.30 p.m. Marched to Bivouac \n beyond & overlooking Albert. . Rejoiced to note signs of returning Civilian life in this fine town.\n","21":" 28-7-’15\n\nAfter midnight last night when we got to sleep Wild Goose chase all thru Albert in search of Equip. Very tired. Left\n","22":" 28-7-’15\n\nCamp 1 p.m. & marched to Vadencourt (near Contay) slept in huts. March cruel on men whose feet have grown tender in trenches.\n","23":" 29-7-’15\n\n3.45 am. Reveille. Off 5.15 am. Another cruel forced march to Lavicogne beyond Talmas) Billetted in Café stable 11 a.m. Everybody finished. Slept until 5.30 p.m. tea & clean up to bed again. Sneaked away & wandered around outskirts of very pretty village with decided Home atmosphere.\n","24":" 30-7-’16\n\nReveille 7 a.m. Left 8.30 am. Very hot but everyone seems fit. Scenery most delightful yet. Valleys Cultivated every square inch of them.\n","25":" 30-7-’16\n\nHomely patchwork effect of Landscape. Flax with fields of bearded wheat Poppies & Corn flower blue. Arrived Canaples 11 a.m. Billetted with Mde. Vasseur Cat’s name Minnette. Tante 72 taught me refrain of \"Marseillaises\" Letter from Mother Bob anxious re me Mick married. Had 1 son. Meg son & fille Jack & Elsie.\n","26":" 31-7-’16\n\nParaded with ointment for nasty rash. Iodine painted on neck. Paid.\n","27":" F to-day 2Lt. chgr of #12. Mentioned with L. Cpl for work last Tues. Can I accept the honour? Joy unspeakable a letter from Beloved Hannah. Dated","28":" Well & pay OK. Bon\n\nJ’ami vous!\n\n"}}