{"Document Name":{"0":"Diary_0388","1":"Diary_0388","2":"Diary_0388","3":"Diary_0388","4":"Diary_0388","5":"Diary_0388","6":"Diary_0388","7":"Diary_0388","8":"Diary_0388","9":"Diary_0388","10":"Diary_0388","11":"Diary_0388","12":"Diary_0388","13":"Diary_0388","14":"Diary_0388","15":"Diary_0388","16":"Diary_0388","17":"Diary_0388","18":"Diary_0388","19":"Diary_0388","20":"Diary_0388","21":"Diary_0388","22":"Diary_0388","23":"Diary_0388","24":"Diary_0388","25":"Diary_0388","26":"Diary_0388","27":"Diary_0388","28":"Diary_0388","29":"Diary_0388","30":"Diary_0388","31":"Diary_0388","32":"Diary_0388","33":"Diary_0388","34":"Diary_0388","35":"Diary_0388","36":"Diary_0388","37":"Diary_0388","38":"Diary_0388","39":"Diary_0388","40":"Diary_0388","41":"Diary_0388","42":"Diary_0388","43":"Diary_0388","44":"Diary_0388","45":"Diary_0388","46":"Diary_0388","47":"Diary_0388","48":"Diary_0388","49":"Diary_0388","50":"Diary_0388","51":"Diary_0388","52":"Diary_0388","53":"Diary_0388","54":"Diary_0388","55":"Diary_0388","56":"Diary_0388","57":"Diary_0388","58":"Diary_0388","59":"Diary_0388","60":"Diary_0388","61":"Diary_0388","62":"Diary_0388","63":"Diary_0388","64":"Diary_0388","65":"Diary_0388","66":"Diary_0388","67":"Diary_0388","68":"Diary_0388","69":"Diary_0388","70":"Diary_0388","71":"Diary_0388","72":"Diary_0388","73":"Diary_0388","74":"Diary_0388","75":"Diary_0388","76":"Diary_0388","77":"Diary_0388","78":"Diary_0388","79":"Diary_0388","80":"Diary_0388","81":"Diary_0388","82":"Diary_0388","83":"Diary_0388","84":"Diary_0388","85":"Diary_0388","86":"Diary_0388","87":"Diary_0388","88":"Diary_0388","89":"Diary_0388","90":"Diary_0388","91":"Diary_0388","92":"Diary_0388","93":"Diary_0388","94":"Diary_0388","95":"Diary_0388","96":"Diary_0388","97":"Diary_0388","98":"Diary_0388","99":"Diary_0388","100":"Diary_0388","101":"Diary_0388","102":"Diary_0388","103":"Diary_0388","104":"Diary_0388","105":"Diary_0388","106":"Diary_0388","107":"Diary_0388","108":"Diary_0388","109":"Diary_0388","110":"Diary_0388","111":"Diary_0388","112":"Diary_0388","113":"Diary_0388","114":"Diary_0388","115":"Diary_0388","116":"Diary_0388","117":"Diary_0388","118":"Diary_0388","119":"Diary_0388","120":"Diary_0388","121":"Diary_0388","122":"Diary_0388","123":"Diary_0388","124":"Diary_0388","125":"Diary_0388","126":"Diary_0388","127":"Diary_0388","128":"Diary_0388","129":"Diary_0388","130":"Diary_0388","131":"Diary_0388","132":"Diary_0388","133":"Diary_0388","134":"Diary_0388","135":"Diary_0388","136":"Diary_0388","137":"Diary_0388","138":"Diary_0388","139":"Diary_0388","140":"Diary_0388","141":"Diary_0388","142":"Diary_0388","143":"Diary_0388","144":"Diary_0388","145":"Diary_0388","146":"Diary_0388"},"Date":{"0":"unknown","1":401.0,"2":402.0,"3":403.0,"4":404.0,"5":405.0,"6":406.0,"7":407.0,"8":408.0,"9":409.0,"10":410.0,"11":411.0,"12":412.0,"13":415.0,"14":416.0,"15":417.0,"16":418.0,"17":419.0,"18":420.0,"19":439.0,"20":440.0,"21":441.0,"22":442.0,"23":443.0,"24":444.0,"25":445.0,"26":456.0,"27":457.0,"28":458.0,"29":459.0,"30":480.0,"31":485.0,"32":486.0,"33":487.0,"34":506.0,"35":507.0,"36":508.0,"37":509.0,"38":510.0,"39":511.0,"40":512.0,"41":513.0,"42":514.0,"43":515.0,"44":516.0,"45":517.0,"46":519.0,"47":520.0,"48":521.0,"49":522.0,"50":523.0,"51":524.0,"52":525.0,"53":526.0,"54":527.0,"55":528.0,"56":529.0,"57":530.0,"58":531.0,"59":532.0,"60":533.0,"61":534.0,"62":535.0,"63":536.0,"64":537.0,"65":538.0,"66":539.0,"67":540.0,"68":541.0,"69":542.0,"70":543.0,"71":544.0,"72":545.0,"73":546.0,"74":547.0,"75":548.0,"76":549.0,"77":550.0,"78":551.0,"79":552.0,"80":553.0,"81":554.0,"82":555.0,"83":556.0,"84":558.0,"85":559.0,"86":560.0,"87":561.0,"88":562.0,"89":563.0,"90":564.0,"91":565.0,"92":566.0,"93":567.0,"94":568.0,"95":569.0,"96":570.0,"97":571.0,"98":572.0,"99":574.0,"100":575.0,"101":576.0,"102":577.0,"103":578.0,"104":579.0,"105":580.0,"106":581.0,"107":582.0,"108":585.0,"109":586.0,"110":587.0,"111":588.0,"112":589.0,"113":590.0,"114":591.0,"115":592.0,"116":593.0,"117":594.0,"118":595.0,"119":596.0,"120":597.0,"121":598.0,"122":599.0,"123":600.0,"124":601.0,"125":603.0,"126":604.0,"127":605.0,"128":606.0,"129":607.0,"130":608.0,"131":609.0,"132":610.0,"133":611.0,"134":612.0,"135":614.0,"136":615.0,"137":616.0,"138":617.0,"139":618.0,"140":619.0,"141":628.0,"142":666.0,"143":674.0,"144":676.0,"145":677.0,"146":685.0},"Entry":{"0":"\n\n","1":" Went from Maadi to Zeitun Marched it mounted Dept abt 9.30 am arr 2 pm.\n","2":" quiet day Mess orderly.\n","3":"\n\nTuesday Field day out by an oasis all day went into town.\n","4":" Major Fulton said possible six weeks to the front.\n","5":" Out all day. Picket at night \n","6":" Out all day Met Lance in city\n","7":" Long march all day & fiasco of an affair\n","8":" \n\nQuiet day Wings died \n\nPosted to Mater & Cousin\n","9":" Quiet day Wings funeral Mr & Mde Snow came out at 5 am Went into Heliopolis with them and Butcher in evening. Watched the pictures from Pension Verandah Back for feed up.\n","10":" Off mounted in good time to the range only fired five rounds when called in.\n\nI scored a 12 group at the 100 yds just missed eight. Eat our ration at midday then at abt 3 we all marched out into the desert. Messed about all day until dark Dismounted & waited & then about 9 we started to dig trenches after a feed of bread & cheese & water. It was hard The soil, also d-d dark candles & rags improvised for light. Much remark about the tucker we were expected to dig trenches on. Dig Dig Dig of Dollys. Back to camp 2 am \n","11":" Another field day out early until about 3 30 pm.\n\nHappily we were allowed to feed up early & go to bed.\n","12":"\n\nOn Regimental guard at 8.30 am until next day Peaceful rest.\n","13":" Went into Cairo with Wright & to Zoo.\n","14":" Quiet day\n\nWent into Heliopolis in evening with Wright & had bath etc\n","15":" Went Shooting Hell fire in charge on return trip of course a galloping affair right up to the troughs. Lecture in evening by Viney\n","16":" Shooting again We did fairly well especially in the schillouette firing Mess orderly.\n","17":" Out for field firing until 3 45. Our Squadron did very well I was horse holder. Lecture by Viney on the \n\nshooting & no losses for \"C\" Squadron Also lecture by Rowell on his trip to the Canal & the","18":" Turkish attack Also re the closing of all bars when the Austs went to Ishmailia.\n\nOn this morn for the first time the Sgt Mjr posted the picquet\n\nSix months for them to learn this.\n","19":"\n\nRoll Call 6.30. Water & Feed Bkfst 7.45 abt 9 Saddle up Drill order About to file out when ordered tie up horses again & clean up tents & place all kits outside. This done after much dressing & so on.\n\nRode out. Some scouting etc On return rearguard action. Officers brought out of walletts, bottles of beer biscuits etc & had a feed in front\n\nof men. Sports eh? Fulton also told us in concluding a speech re manoeuvres which chiefly hit the officers that cleanliness meant efficiency & that we must \nsave our money\n & spend less on beer & ciggers & more on polish.\n\nReturn at two. Individual feed up. Done. Next order stand to feeds. Done. Feed up. Dinner. Item 3 fall in again To groom etc until the High Commissioner\n\nhad been along, & groom while he passed. This he did with full gold laced staff with red fittings. Brains perhaps but no appearance. Dark suit black knee boots & glasses Black hat. felt That over. Water horses. Feed. Fall in draw shirts & socks. Tea. Dry feed. fill nose bags. Had to tidy kit bags & bedding as it had been set on.\n\nCapt Viney Most D - Viney\n\nWhence does your language flow\n\nYour carmine yells\n\nAnd blankeys hells\n\nEven the troopers glow.\n\nCapt Viney.\n\nMost Deviney\n\nWhence are these swears you know\n\nIn a school of state\n\nWith a penny slate\n\nWhat a lot those kids must know\n\nSave your money\n\n8 When tempted with a sandy thirst\n","20":" When the risk in the deserts done\n","21":" Just slake your thirst with water\n\nA can of boys beer’s piastre one\n\nSave your Money.\n\nWhen eating stew for seven days \n\nMultiplied by seven without end,\n\nAnd you feel you’d like something solid boys\n\nJust buckle your belt to the end.\n\nSave your money\n\nWhen the officers call grub\n\nPudding & pies remember pray\n\nThat they have stars on their shoulders\n\nThey’re built in a different way.\n\nSave your money.\n\nWhen gum has glued your inner man\n\nFor days beyond recall\n\nRemember your boots to polish boys\n\nTo fleshy lusts don’t fall\n\nSave your money\n\nFive bob a day they told you\n\nWould be your daily legal pay\n\nBut they knocked you down to two bob boys\n\nT’is just their usual way\n\nSave your money\n\n8 Don’t fill your guts with luxuries\n\n7 At the hill Robbery Co\n\n8 Go buy a tin of polish, Boys\n","22":" And give the heads a show\n\nJust think of the grub you’re getting\n\nAnd the duff you never see\n\nBuckle your belt up tighter boys\n\nBuy a tin of the great Kiwi\n\nBut always turn out neat\n\nAn army will march on its stomach\n\nNapoleon its said did say\n\nBut Nap only imagined Europe Boys\n\nIts Viney \nwho\n rules today\n\nWhen temped with a sandy thirst\n\nWhen the daily Bull cross o’er\n\nAt the rag time routine’s end\n\nJust slake your thirst with water boys.\n\nYou’ll notice the officers daily \n\nTheir bottles with water fill\n\nThey never drink beer or spirits boys\n","23":" follow you leaders will\n\nIf you come far away to fight\n\nThen kill in a kinder way\n\nDazzle \nthe\n your foes with your polish Boys\n\nBlinded they’ll lose the day\n\nEach fortnight when you get your pay\n\nBuy polish & cleaning gear\n\nPerhaps & cake & or ginger beer Boys\n\nBut","24":" for Gods sake buy beer\n\nWhen you’ve eaten stew for endless days\n\nJust think of the grub you’re getting\n\nAnd the Duffs you never see\n","25":" pine for a meal square feed\n\nBuy a tin of the great Kiwi\n\nBuckle your b\n\nRiding one day desert across \n\nI saw a queer object on a brown horse\n\nHis leg were like shafts\n\nHis toes in the air\n\nHis words were the best of Billingsgate fair\n\nFor a boys Brigade Captn his language was rare\n\nFor an ex state School master his lang was rare\n","26":"\n\nLeft for Meadi Sham fight en route arr about 4.30 Spent evening at Mr Heaths till 12 am\n","27":" Went on by road to Helouan beside river Nile arr about 2 45.\n\nUsual mess up over watering.\n\nThe General Godley came & inspected the lines as soon as all was settled\n","28":" Left Helouan Reached Meadi\n\nSix inches between Viney horses!\n","29":" Left Meadi \n\nFight did not come off or we so nix\n\nof it Arr camp abt 3 pm\n\nNight","30":" returned from Barrage & left same night for Luxor arr next morn at 8 a.m. went to Karnak\n\nBarrage trip Short tucker & messing up on the horse swimming biz. Also no pay. All stony broke.\n\nNote – July. When will it dawn upon the organisers of a modern army that doctors or properly qualified men are those who should see to the scientific feeding of troops A tin of milk. So little & yet so much.\n","31":" Left for Helwan. Stopped at Maadi that night.\n\nHelwan, Thursday night Friday half day Sat Silly sham fight in hot sun\n","32":" to the Sakara Pyramids, & tombs of Bull & Ti\n\nHell of dust storm there Back by 4.30. Quiet evening in the town\n","33":" March morning some of Major Fulton’s BS re advance & halt & distance Noon bathing parade\n\nSchool girl treat at own expense No dinner one dixie 31 men out – Growls Ducked all noon; night we left for Meadi at 7 pm our Regmt only one which marched light out & no smoking Heads might have heard some remarks re the whole outfit. Mr Fulton’s 4 o’c cricket match.\n\nMeadi 12 noon. Lines down & sleep. Tucker nil.\n\nReturn Tuesday to Helio no tucker for midday & no meat for tea usual jam etc\n","34":"\n\nCame to anchor on Eastern side of the peninsula at some Bay Heavy bombardment down coast We moved up the coast noon off a supply base They were giving the Turks hell on a coast ridge all noon & night. Heavy & continuous rifle fire above supply base Also the base was being shelled by shrapnel for a while.\n\nWe landed per Torpedo boat\n\nColne about 9 pm. Landing stage Bullelts spitting in the water around now & again on the way. One or two hit the boat. We proceeded up the track towards the trenches & near the top bivouacked for the night to the music (?) of the rifle fire & the sing of the bullets I slept some Our chaps took the whole piece so far jolly quietly & did not show much excitement.\n\nJ’son thought he might catch cold with the sweaty walk up & then resting. Up at 4 & stood to arms.\n\nFine dawn Still firing One fellow carried down head tied up quiet.\n\nHeard there had been terrible losses & the chief hill the objective was a mass of killed & wounded so much so as to hamper further action\n\nTurks having gained by force of numbers.\n","35":"\n\nWe moved up a gully about 8 or 9 am & camped in old dug outs which we improved The Sharp shooters made it pretty hot down the main vally about 10 & got 6 of B Squadron. The bullets sing continually I went for water for a dozen or so & It was pretty lively about then. Don’t like the Shrapnel or Mixed\n\npills. The firing overhead & then bust with a vicious bang which in itself is nasty.\n\nAlso, the explosion knocks the dirt in the dug outs down on us While building a barricade near Headquarters on main track Saw several wounded carried down One had got it in elbow & leg & was biting the collar of his over coat to ease his \n\npoor nerves. We finished the Barricade about five. \n\nThen returned & boiled the billie for tea – Biscuits tea & butter.\n\nA welcome feed Amount of caste material from clothing to rifles lying about is surprising in a way.\n\nHeard one fellow blown to bits on the beach by shrapnel. Met Rexon at the water hole. Can’t imagine coming out of this\n\nscathless.\n\nSeems impossible\n","36":" At 11.30 about 16 of us from \"C\" Squdn went trench digging on left near flank (Communication trench) Maxwell & self worked together. A pretty lively fire overhead whole time. We had to run for it going & coming back as a sniper was at work on about 150 yds of main track & one man \"Irish\" was killed & another badly wounded.\n\nGodley missed it by a few seconds going down hill with\n\n \n\nMadame R. Maadi (Egypt) (Near Cairo)\n\nEdward D. \n\nYou Coxcombo \n\nWhat did you join the army for\n\nWas it for glory gain stars need you on yr shoulders to be a harlots swain\n\n13th\n\nBirdwood & the staff the bullet hiting the road bank just behind him. One went between Butcher & myself when we made our dash There were many hitting the bank on each side as we waited for our sprint. It was like a rabbit side stepping a strap\n\nIn the evening they poured several shrapnel & grape into the bushes about 20 yds on the beach side of our dug outs Booty Butler was hit by a bullett in the leg (in the knee) & had to go to hospital.\n\nWright went to beach with dysentery & Johnson with a boil The latter I can’t stick. Dave Downey & Con – Cunime came along in the evening & stayed for a yarn. It was good to see them again.\n\n13th his yarns were amusing & lurid No doubt the landing & driving back of the enemy was a thing which no regular forces would have succeeded in or attempted. Only an amateur army would have been so daring & fool hardy. It must have been a fine piece of work.\n\n14th Saty On reliefs of communication trench digging all day till 4 30 pm Under rifle & occasional shrapnel fire hardly had near\n\nsqueak. Then 10 of us under Sgt Burbury went down to beach for bathe & to fill water bottles. Shrapnel came along close when half way & we ran for it. Two exploded close to us, one drove the sand into my right hand the next sent a piece across the sole of my boot below the instep when on the trot. The sea was sprayed in front of us while undressing but we had our dip & it was refreshing The first wash I’ve had since landing.\n\n14th\n\nFilled bottles & back Yarned & tea til 8 pm when turned in Up at 10.15 to work on a barricade which kept us going until about 2 am.\n\nAbout 1.15. The enemy sent up a sort of star shell which was evidently the signal for a hellish fullisade of rifle fire & apparently bombs & was kept up for about 15 minutes.\n\n15th Sunday.\n\nThe firing was slacker today then since we landed & we all put in\n\na fairly quiet day.\n\n16th Mon\n\nQMS fatigue in morn 5 15 then on road fatigue from 8 am – 12 noon. our mtn guns gave the trench of enemy at head of valley a lively time all morn & we saw some lovely hits. \n\nOne man flew in the air & his clothing apparently in shreds after him, another was later deprived of his rifle which went away in rings into the gully.\n\nThe smell of the dead.\n\nWashing. 10\n\n1 Breeches\n\n5 Hanks\n\n1 Singlet\n\n1 Shirt\n","37":" Towel\n","38":" is not at all pleasant & many of the poor fellows lie rotting in the sun where the RMLI made a bold & useless charge some days ago up a face sleeper a house roof. In the burial ground at foot of hill are many graves & one of our fellows feet you could see sticking\n\nout in its boot while the big grave waited for the next. At night I was on fatigue at 8 pm again, digging a way & bank which went to fill sandbags for a new barricade near B Viney’s hole Copley in charge. Our party came on three corpses buried where we were digging & the smell hung heavy. A lovely night with the cresent of the three day old moon & never a cloud. Rumour that Hamilton has given the enemy 4 days in \n\nLand of the cheerful sun\n\nLand of the endless sand\n\nLand of the Turquoise sky\n\nLand of the band\n\nwhich to surrender. \n\nTwo big howitzers are on the beach today. A lot of the sniping has stopped. Bed 2 30 am Tues.\n\nNo rain after our long spell. Viney has been reading text books on barricades & its his new hobby.\n","39":"\n\nOpened with several shells down the valley with the enemy’s\n\nAlbert Sion\n\nEtude de Maitre\n\nBrouaro Avocat\n\n4 El Soufi \n\nCairo\n\nP.C. Tite\n\nThe Hollies\n\nByron Road\n\nHarrow on Hill Mid.\n\nPension \n\nGarden St No. 12 1st Floor\n\nNr Soldiers Club\n\n2\/746 Gunner James Lance\n\nNo 3 Battery \n\nN.Z.F.A.\n","40":" heavy guns which made our fellows laugh at first. But one landing within 50 yds of their holes made the tune alter a little & there were one or two pasty faces. I was asleep at the first & thought it was our naval guns & came out to see what was doing. Was not pleasantly surprised at the real facts. To be blown to cats-meat at short notice without firing a shot would be a little off.\n\nReported one man near road blown free of his arms & legs poor devil. Young Bell \n\nA perfect morn with a lovely sea & a splendid sailing breeze. Shrapnel pretty busy today so far. The Indians do great work with their transport up the hill to store base Also one infantry man & his donkey who fetches down all those wounded in the feet or legs that he can get. Story man on stretcher with bearers Shrapnel bursts near Bearers bolt & wounded one jumps up & runs\n\nfor it. Another man comes to Dr asks if he is busy with hand over his eye. Eye shot away & bullet through his head. Saw one fellow badly smashed on stretcher pale & bloody smoking cigarette.\n\nThe glories of war.\n\nMiss Thurlow\n\nHigh St\n\nEpping Essex\n\nEvening same day\n\nTheir big gun again drops two shells into the valley not far below \"Shrapnel Gulley\" or \n\nElizabeth St as I call it & raised great clouds of muck. Butch and I went up to a little \"possie\" on the hill side to see it It then ranged the hill side & gradually worked along to the big bluff where it put in it’s last shot before it knocked off about 7 pm\n","41":" We all slept in our bandoliers ready.\n\nAt about 1 am or moon set a terrific fire burst out on all fronts & the din was awful This was kept up till near dawn & in fact after twice we were marched up the road to the barricades & back again. Saw many\n\nwounded & dead this morn, some horribly messed up. A Sniper put in some good work on the opposite bank while we waited to go up to trenches. Got one fellow through the upper leg whom Balmer carried down at some risk. The next got it as far as I could see in the stomach & he was bandaged up in his dug out & Robinson helped to carry him down. He looked to have got it badly as we saw him later at the F H & he was like death then\n\nTen minutes before full of health & vigour next the relics of a man. War is pretty sure enough & picturesque to those who sit at home & write about it from their office chair or study. Pity some don’t know more of the putrid side of it such as we experienced when we went into the trench on the left flank about 1 or 2 pm with several corpses rotting in the sun between our lines. They were blown up with putrifying gases faces to the sun We had a hot 15 min while the NZs on our left made as we heard\n\na charge to drive enemy back. Capt Lewis got shot in the chest just as I felt a flank fire & called a warning to him. The bullets & sand flew & we did some firing. I used the periscope a good deal & watched the shots our chaps made at times. The big gun got a couple more shots into the valley about 3 pm & also one or two on or near our trenches. She was supposed to have been silenced too.\n\nOur chaps behaved jolly well I think & there were no signs \n\nof fear. What I felt was curiosity & excitement\n\nAt 9 PM we went to the firing line again Butcher & self on observation post on extreme left in small sap. Might hot corner & I had to occasionally pop my head up to see what was doing on our front.\n\nHell of fire all night which petered out at dawn & we were relieved at 10 pm Hand grenades given us with most amusing instructions at 12 m n.\n\nWhite hat white & grey stone copper colour face & shadow blue coat Blue \n","42":" At about six a general armistice was made by Turks & white flag show all along the line Our Amateur officers as I always expected made a hash of it at a critical time & allowed the officer of the Turks a German to come right up to our advanced trench with several Turks Three came in But after an hours parley & the enemy having seen all there was to be seen \n\nwere permitted to return to their trenches & at once a hot fire commenced. Such are the methods of our amateur officers.\n\nI don’t expect to see dawn as we are a mere skeleton army here & no reserves to reinforce\n\nThis spells finish here if they charge & are massing at the \n\nback as it is said they are doing. To finish damn all amateur armies & especially officers who were blasted canvassers & storekeepers in their native land\n\nThis should read","43":" & I am perhaps a day behind in my date tho’ the days are correct.\n","44":" morn","45":"\n\nWe had a night of Qui Vive & the fire was pretty hot at times also the fighting on our right which was kept up well & the machine gun had a hot time & I hear did great damage We did enjoy our tot of rum in the morn & it is most welcome. I slept all morn & at 4 pm we went into the the supports while I went into the front firing trench as they were short a man or two. It was not an unusually\n\nlively night. \n\nWe stood by all day Saturday as supports & it rained in the morning\n\nButcher & self remained in firing trench until 9 30 am & the rain turned everything into mud & we were in the hell of a mess Snatched about 2 hours sleep at our spell time in a small hole\n\nIn the supports again at 7 pm & I was on guard at corner (left.) A very quiet night & we stood to arms at 3.30 At 5 we dismissed Whit Sunday & I was \n\nQM fatigue Sadlier gave me a fine tot of rum on coming off & I got Kenyons rag out real well.\n\nSaw Hudson in the morning on way back Slept all morn with Butch in a dug out at hill base\n\nA silly fatigue at noon which I passively resisted Cleaning the gully of tins. Into the trenches again at 4 pm. Self firing line at old loop hole same place I had near shave at former night. Letters from Tassy KMW & KW\n\nVernon joined warned to keep low as our howitzer is to shell with lyddite in a few minutes\n","46":" \n\nA wonderful quiet night which kept us all on the peep. I had several looks over our trench was made much shallower by removal of bags We gave them shots at times Early in the evening we used our Japanese bomb thrower which it appears does great damage & goes up a great height & then falls nearly vertical. Firing trench 9 – 1.30 The Armistice was on at 7. A great night\n\nGreat number of dead buried & the stench was awful. The position gruesome. Turks largely in the majority. Godley & many staff men up all morn twigging the field. Only heard one shot fired all day. Concluded at 4.30pm Shooting commenced again about 5 pm.\n\nIn supports all night on ammunition guard Nothing special, heavy thunder & some rain.\n\nSaw Scan & another a Corp of Engineers this evening yarn re battleship & the guns a little ruse which scored about 1200 of the enemy.\n\nBiscuits & jam with Balmer \n\nat 1 am.\n","47":" \n\nCame out of supports at 5 am & turned in at 5 30 & slept till 7 & bed again in dug out Had a good sleep till 12 30. During the morn a battle ship was sunk (torpedoed?) just in the bay. I did not see it. Noon the torpedo destroyers & the airship were making great search while the battle ships went out to sea. \n\nHMS Triumph.\n\nIn the trenches again at 4 pm. After a wet after noon. Things damned cloggy.\n\nQuiet night. On alert but little doing. hardly awake all night.\n\nBeastly blowflies off the buried dead come\n\ninto the trenches for want of place to go. They give one a clammy feel.\n\nJust off the dead.\n\nDawn hours (Geo) shot dead while in trench just prior to relieving & going off. Took too much chance. G’gow gave some plain facts on phone re the sniping & our mens reply\n\nTook up our new posse","48":" about midday. Rotten quarters Butch Seymour & self went down with Dolly for bathe in evening. Troops landing under shrapnel or case shot from gun boats. Lovely evening. Quigley got it in the foot\n","49":" \n\nQuiet day. felt off colour Rather depressed about loss off Majestic. Airship over head noon dropped bomb or two on enemy.\n\nUp left trench at arms midday & again at 12 30 am till 3 30 No one knew why. B.S.\n","50":" Went to see Tom B about 11 am on right flank.\n\nIX Platoon C Comp","51":" Bgde. Sgt now seems well & as his old self. Had lunch with him. Good trenches Young Bailey shot by snipers in morn & killed also Hdqtr Staff fellow. Sniping damnable All efforts to cope with it\n\nseem feeble. Ch’l a damn old woman. Up to 4 pm seems a quiet day. Some talk of a confab between Allies & Turks Went for swim in evening Some got strayed with Shrapnel & Butch was hit in the arm while on his way back.\n\nWe were turned out at 3 am Heavy fighting especially on Quinns post.\n\nWe saw a lot of it in distance Turks charged A shell shrapnel & bomb duel for about an hour We kept filing up & down the Comm trench all morn. A heap of dead in gully on right 10 we tied up, kits etc & again went up hill\n\n& kept going up & down till about 3 pm. NZs walked over us & then we went right to top Stayed there about an hour then came down again & settled into dug outs again. The messing abt cost 4 NZs their lives at one corner.\n\nSaw the Aeroplane in evening drop four indications over Turks lines. Picquet all night. McDolly kept in her posse all night Shes a great officer.\n","52":" Quiet morn about 1 pm we all stood to arms a fairly heavy attack on our front shrapnel, shells & machine guns which was kept\n\nup till about 5 pm Slowly dying down Turks repulsed & it is said one or two machine guns out of action & two trenches taken. Alf Cook hit in arm while standing outside posse. Quiet night a few of us quite F.U. with the Rag time Farce from which the RT is never absent.\n\nMon 31st. Quiet morn lay in & slept all morn Aeroplane & the job below spotted submarine perhaps. She seems to do some great work Webster shot at noon while carrying timber up road. Dead.\n\nIt seems unnecessary waste of life to have men \n\nMen in hospital to shave or be shaved each morning\n","53":" \n\ndoing fatigues up main road in board daylight. I’d like to come out of this affair sound even if wounded but the chances do seem small. \n\nTurned out at 12 m n for a barricade building fatigue. Kept at it as long as sand bags lasted which was till 2. None of em had any tiers. Sgt B is not in high favour with his men. \n","54":"\n\nQuiet day Rumours of move to L.H. Several of my chums are quite agreed that this whole LH & Aust Army (?) is managed up \n\nThis book if found should I be killed is to be sent without fail to:-\n\nMrs Reynolds\n\n47 Gunterstone Road\n\nKensington W\n\nLondon\n\nMother\n\nAlso\n\nMrs K.M. White\n\nWattle Park\n\nGlenorchy \n\nHobart\n\nTasmania\n\nto putty & that the Englishman or ex African is not wanted. On Sap cutting fatigue from 6 – 10 pm Turned in Quiet night. Heard today of Dave Downey’s death by bomb. A damned fine fellow a real loss. Blast this blankey war.\n","55":" On fatigues. Met Lyte. Yarn in evening till late\n","56":" Fatigue morn Moved to gully in evening below Popes hill\n","57":" Fatigues till midday or 2 pm. Then quiet till night. Yarn Sgt Scan noon. Also Hamilton Sgt Paul Shot dead. Brown Big firing during night Some talk of charge from Quinns. Big cannon \n\nading by warships down coast from 1 – about 6. Goeben reported sunk again At Quinns there was another abortive charge which caused some useless loss of life No officers led the men & only one non com. Drove Turks were driven out but our fellows could not hold the trench they took. Slept this night will kit on.\n","58":"\n\nUp to Popes hill 8 – 12 improving & finishing support trench. Weather very fine. Quiet for rest of day Bathe in evening until shrapnel began. A yarn with Lyte & Lt Alexander & Swainy in evening till 9. Turk prisoners brought in from party at trenches while I was in signallers office Quiet night. Stood to arms Sunday morn 4 am.\n","59":" Road making up Dead Mans Gully morn & in sap 4 – 8 pm on Popes hill noon. Quiet.\n\nCalled on Tite in evening.\n","60":" Quiet day. No fatigues. Tom B came up in morning for yarn. Seems well, Bathe first parade noon. Elfick. No shrapnel. Met Cumine later. Tuft hair present fad. Up to Viney’s Folly at dark under McCloud. Fine night. Some heavy firing & star shells. Visited Tite & Alexander at 7 – 8 Had short letter from Mater with enclosure. Posted Mtr in F L.H.P.\n","61":" A quiet day in Vineys Folly. Heat unpleasant & no shade. Relieved at 8 15 Some tucker & to bed. picquet.\n\nCapt B can’t say I like him he a morose & conceited sod. Tho’ he appears not to be \n","62":" Left the gully about 9 am. Usual messing & delay The Planets don’t seem to become any more efficient Stomach bad all day Another bit of not cleaning up all the other dirty squadrons old tins etc. Into the trenches as supports about 8 pm. Some talk of a charge to come off. Rumour many of our ships sunk by submarines somewhere.\n","63":" Into trenches at 5 I spelled till 12 md, then till 5 am in firing line Quiet night Out at 5. Cold night. No rum Damn Band of Hope Army. To act as men & be treated as boys. Bread.\n","64":" Slept & lay down all day. Into supports at 7 pm Quiet night & cold Slept well. Yarns colera among Turks. Many our fellows sent away high temperature. Talked of Peace. Splendidly fine weather. Never join an army again under amateur officers. What about Aust. Democracy.\n","65":" Into trenches 5 am Seymour & self into look out. Some shelling of enemy by battle ship early & enemy shelling our right flank trenches. Yarn. Fall of the big hill 971? Our ships through narrows? Slept noon. Into trenches about 7 pm I was near Ludby & Solea who were look outs. Officers & non-coms had the jerks. Out at 5. Tea & to bed.","66":"\n\nSlept in all morn. Heavy bombdmt down coast. Turks said to be driven this way. QM Fatigue noon. Saw Tite. Quiet well. Into supports at 7. Good sleep. S.T.A. at 3. Into look out at 5 with Seymour. Posted PCs to Mtr & Mrs D. & notes to Mrs F & KMW per Vincent. Big gun duel in morn & our night got it pretty hot.\n","67":" Trenches. Observation Pst Fairly quiet\n","68":" Supports. Bombdmt on coast Quiet our way. Enemy shelling\n","69":" Relieved from Trenches about 9.30 am. Removed to Gully by Hdqtrs Staff. Severed partnshp with Seymour. Tea with Tite & Swainey. Met Cooper. This are worse than the bullets Far more annoying Godly supposed to have some\n\nWed 16\n\ngood news to impart soon Wish they’d issue rum again Heard from M.T.L. Men are mostly fed up with this eternal fatigue racket & stationary posts. More disheartening than fighting. Most men lousy.\n","70":" Quiet Usual little firing. Aeroplane now & again drops bombs during this period. Reported – first two trenches at Gaba Teke taken. Reported troops landed to North. – Bulgaria has come in also Greece. Cheval ill & away also Johnson. Tom Called morn\n","71":" Swim\n","72":" Swim\n\nTea with Tite.\n","73":" Heavy bombardment at Cape Helles all day & evening Went down & had yarn\n\nwith Tom in evening. Found him well.\n","74":" More bombardmt early Heard from Mater Four hours fatigue 12 – 4\n","75":" Quiet day News of success of our or Allies force South Bathe in eve Missed shrapnel. Two caught it one in water. Some thing doing with battleships Aeroplane & another boat about 8 or 9 miles out. C Squdn officers most stuck up – upstarts of whole bally crowd bar Clarke & Bennett is both fool & cad. Down to Tite in evening Most peculiar blister on moon\n","76":" Fatigue 12 – 3 Bathe after. Very hot day Price Hobart had his arm cut nearly off below elbow by shrapnel case when bathing. Beastly wound. Tea with Tite & Co.\n","77":" As usual quiet day. Fatigue at 8 pm – 12 m n.\n","78":" Quiet day. Weather Very hot.\n","79":" Little doing. Weeks shot with Shrapnel. Turks Ammn is improving in explosive power They also have a new bomb fired by gun which has a fiery track.\n","80":" A short attack by enemy in morn abt 5 am Otherwise very quiet day. Our battleships appear to play hell for couple of days or so down coast (Achi Baba) & then cease for week to give enemy time to repair damage done. We comment on it. The planets appear to have might easy time & devote it to discovering fatigue\n\nfor the men. The hillside side now is a maze of saps The rum is quite stopped & I see no lime juice at all Rations a farce a times 11 Small spuds for a troop 30 men sent down for 3 bags of mail. Bunny Bennett tries to cure N of swearing!! The ignorant pigs McCloud has not yet returned from hospital. Very pleased to see that Federal House has had to debate treatment of troops in Egypt & food etc Someday I hope there will be a day of reckoning with the curs of officers from top to bottom with few exceptions. What about Young of NZ infantry & Dug out King.\n\n7.15 pm","81":" Nothing special quiet day. Still very hot.\n\nTue 29 Firing still on down coast\n\nMon 28 June Heavy firing towards Achi Baba by Battleships another landing effected. Counted 24 small mine trawlers & torpedo destroyers lined between Imbros & there. Firing all day Midday a fizzle on our front on right reported trenches taken from Turks Own men went too far & fired on by own side. Some big old shells on our hill side Also shrapnel. Another display at night with fire works & cheering (Eggs.)\n\nFine swim in the dusk with Arthur\n","82":" Ctd A heavy fire opened up all along own front abt 9 45 pm as well as heavy bombardment down the coast. This with the cloudy night & the flares made\n\nit look quite an inferno.\n","83":" We had to stand to arms at 1 am. As only just got to sleep was wild as we most were.\n\n(The aeroplane which dropped the papers on Sunday night asked us Austns to come over to them & we would be well fed etc & were only mercenaries.)\n\nFive dead in morgue one of them a Turk. Said to have been the Ottoman Guard who attacked on left. Drunk or partially. 250 left dead or badly wounded in front of the trenches.\n\nWe went into trenches in morn. Rotten trenches, shallow narrow & enfiladed on both sides. No possie supports Heavy thunder storm at night & some rain not too pleasant. Some firing at night. No rum just when needed\n","84":" Out of trenches at 5 & to blankets. Rested to 12 Out of sorts. Feel need of different tucker, want tinned milk & cocoa or coffee. Officers can buy or obtain all they require but a private even if he has money can get nothing Day in day out Bully Sun bathed for weeks, bacon & cheese & jam. None of them bar former too bad but the stomach revolts at the eternal sameness No fruit preserved or otherwise\n\nRice \nsecond\n time to day - Bennett roots Bob Harrison up with his foot. Bob curses him. This is a fair idea of what one can expect from such officers (cads) as we have. Dolly McLeod is back. Heard him say he’d lost a stone, but he’s gained no savoir faire. Makes no attempt to greet his men or ask how things are going\n\nI think they daren’t. Many men sick & many very weak. Into supports at 7 pm after handful of boiled rice for tea No stomach for anything. Sgt Trimble killed about 7 pm Bullett burst his brain open. Heavy sea on the beach.\n","85":" Went into trenches at 5 am. A rum issue. Marvellous. Trenches at 7 pm till next morn\n","86":" Out at 5 am Sleep all morn till fool S.M. woke me up To call on Tite noon. Supports at 7. Some rain in night\n\nSun 4th Into trenches at 12 We all feel the need of a canteen or the need of somewhere to purchase such things as coffee milk etc. At present unfavourable. Letter from Jeannie 3rd\n\n& paper from mater.\n","87":" Submarine rptd in offing at noon. Into trenches at 12 pm till 5 am Mon. Reported – Bulgaria Turkey – French Transport sunk 6 lives lost. Quiet day night Letter from Cripps 9th June\n","88":" In supports all day & night.\n","89":" Into trenches at 5 am – 12 & 7 pm to 5 am\n","90":" when we went down the hill to reserve gully 12 of us right away into Vineys folly. Draws lots to leave 4 & I got out. Went to tea with Tite. met Kirkwood there. A tot & home at 9 pm .\n\nThur 8th Fatigue at","91":" a argument with Mjr Glasgow re the fatigue which was \n\nlater refer d to Bell per Rowell Eight of us on peq noon for late fatigue – Bell as nervous & white as sheet. Griffin the swine lied as usual. Result an extra four hour fatigue. I spoke to Griffin re the business & he lied again Bell refused to hear what I had to say. Convinced he shielded Griffin & he is what I always believed an arbitary self aggrandised weak unjust prejudiced cad. Such a thing could not have happened with a fair man His phisiognamy is a give away. It’s the worst of having cads as officers. In evening while we were on the fatigue he came & worked for a while The usual crack hearty game of his kidney. I’ll get even\n","92":" To Walkers Ridge in morn with Arthur Foster for rice & curry also scored some beans & beef. Bathe. Quiet noon. Cooked a good tea with curry beef onions & rice. Best feed for weeks We go into outpost about 8. Persistent rumours of a move soon by our Brigade.\n","93":" On outpost all day Heavy shelling of Kabid Baba \n","94":" Fatigue 6 – 10 finished in good time Bathe Heard from Mater & Mr B Guard in evening 9 till 4 am\n\nMon 11th. Fatigue 2 – 5 contract so finished fairly early. Tile came & had a curry tea with me & later I went down to get water can Crowd damnable poor devils\n\nMon 11th Some have to walk nearly two miles – Heavy shelling Achi Baba\n","95":" Heavy gun firing in morning on our front & enemy shelled Courtnays during noon Rather many casualities going down to beach. Had a good bathe in evening with Besier. Called on Tite on way back met a S.M.\n\nwho knew R.E. Wright well in Fiji. Posted PC & letters to Mater & PC to Janet.\n\nWed 13th Stand to Arms. At 3 am then told to carry on till 4 am. To move off at 8.30 am for Popes Post Up packs & moved off. Many got to top of hill & some half way then were told all to go back again as we were not wanted & so back again to our possies & unpack. This is the best our Heads (!) can do after 11 months of it. Waste of mens strength & temper in this heat.\n","96":" This eternal Duke of Malborough gag is getting monotonous\n\nHeard from Butcher.\n\nTook over the job of S.P. in evening vice. Harry Taylor returned to troops\n\nMoved down in evening to Biv’ near Mortuary\n\nBathe in evening.\n","97":" Took over new duties. Inspected Steeles & Saps during day. Bathe at night with Jenkins & Mac T. Splendid night Tea with Tite. Drew rations\n","98":" Inspecting Steeles & Saps. Fixed up possee noon. Bathe in evening Fine night. Tried hard to buy some milk. NG\n","99":" as Fri\n","100":" On Morgue all day one man in. Shot through head\n","101":" Inspected Steeles & saps work. Cleaned up road noon with Kiwi Jenkins & Murray Very hot day. Talk of early advance or move Reptd. – Andrianople in hands of Bulgars Also 100000 turks reinforcements. The balloon up today. Much reconnaissance going on it appears.\n","102":" Much same as day before. Missed bathe as all bathing stopped after 7.30 PM. So had soap wash Second since we arrived\n","103":" I took on cooking for the SP did not go out till noon when went see Tite. The charge is to come soon it appears All preparing for an attack or conter ditto. Fine bathe in evening with Bill Jenkins Tea late & most unusually pleasant free fr m flies\n\nThur 22 Another quiet day Aeroplane making great reconnaissance. Shrapnel vainly trying to bring him down. More yarns of attack. One dead Turk in Mortuary. Shot while trying to cut our wire entanglements. Some shelling in evening by our guns S.P. Corpl slept with his Sqdn who were cutting a trench on side of dead man’s gully\n","104":" The charge is supposed to come off tonight Slept with boots on.\n\nNothing however came off. Kiwi returned in the night.\n","105":" Cooking for SP’s Called & saw Tite in evening The Turks attack has not yet come off. Slept with boots on again.\n","106":" Cooking. Went for Bathe with Bill Jenkins noon. Enemy giving beach a warm time with shrapnel & big shell. Some of former burst very close & peppered within arms length. Rum Issue. No attack came off this night. Much discussion re officers General opinion seems the same. They (the majority) are a lot of vain self-seeking selfish pigs. \n","107":" 27 still much as usual. Am still cooking for our little crowd.\n","108":" A sharp burst of firing in morning about 4 am. Bugle was blown on Courtenays by our fellows or NZs & loud cheering. Made enemy fire like the deuce for some while. Tues a young fellow, name Reynolds in Morgue shot in heart N.Z. Enemy have a big sort of explosive bomb like cannon ball which they use at times now. Makes hellish explosion Piece of shell fell into our possie in afternoon & tore newspaper on my knee.\n","109":" Quiet day. Heard in evening that a Brigde of Ghurkas had landed & possible more on Sunday with Light Horse left to man trenches in support.\n\nAlso letter & enclosure & papers from Mater Taube came over evening\n","110":" In or about possie all day. Nothing fresh. Sharp burst of firing about 5 pm\n\nSat 31st Taube overhead early dropped several bombs one fell quite close to our possie. Could hear falling. To call on Tite in evening. Report 14.000 000 shells will be fired on Achi Baba in all or now by Allies. Some firing in evening. Godley made some shake up over water this date. Yarn re the Taube dropping bombs in own lines. Bathe noon. Splendid Heard Elfick wounded in leg with shrapnel on Fri Posted to Mater Eustace Lady S PC Cripps & Mrs White\n","111":" Met some our troop at Beach. 48 strong in Squadron now 30 odd for duty. \n\nRolled overcoats on outpost. Light horse I heard 700 strong out of 1500. Percentage of sick everywhere too heavy. Still hot & dry. Bits of bomb & shrapnel fell near possie at night. Attack on right Two trenches reported taken\n","112":"\n\nQuiet day played cards with Morrie noon. Still hot & dry.\n","113":" Still nothing doing Made some dice. Called on Tite in evening. Alexander gave me three eggs. Bust ‘em don’t eggs in your shirt\n\nespecially when shirt has no buttons. Damn.\n\nWe talked of the so called Advance. The opinions of L & I are not optimistic They are giving out rum again now. Courage. A la demi John.\n","114":" All talk is of the move.\n","115":" Tite & Cooper came to tea & voted it a blow out. False attack by our front at 9 pm. The Aust & Col generally seems to lack an eye for method & thoroughness\n","116":" Called on Tite in morn. They cleared over to left in evening & same with NZs. Bill Jenkins left & Fred Price went away sick The move begins soon I hear Tommies landing every day or night now\n","117":" Some bombardment at night & action on left\n","118":" Things very lively early Heavy musketry rifle gun & battleship fire.\n\nMany dead brought down to Morgue a false attack early to screen operations on left cost the 1st & 2nd Light Horse dear on Popes & Quinns also the Welsh Fulisiers up Pope’s gully & the Light Horse on the left Walkers. Our little corpl did not turn up all day & it is said he has gone over parapet with his brother who was a bomb thrower. The losses are pretty heavy on this front at least 26 in Mortuary & 8 or more\n\nup the road. Some shelled to pieces. The valley seems to be blood & disorder I did some rounds & helped at Mortuary on which Mac was until 11.30 pm.\n\nReported self on behalf of SPO to Capt Farr at 4 30 or 5 & was told to carry on He also said we were within 150 yds of top of 971 & they were doing well on left tho we had had a bit of a dusting here. To bed late & very tired To be a soldier it is also necessary to realise that ones life is of very little value when history has to be made.\n","119":" Stanchan killed by shell splinter. He was breathing his last when I looked in at Red X\n\nSun 8th Woke early big gun fire & the general circus Then 3 shells came close to our possie & burst below woke the boys up. They became more frequent & close & one drove several loads of earth just on to my late bed. Then we bolted for it. Place thick with smoke & dust. Wandered homeless till 9 when we went back & had some tucker. Discovered they were 75 m\/m shells percussion. 11 dead still in Mortuary. Did a fair round in morn. Mac on Morty. Saw Capt Tan 2.30. All serene. Up to Walker’s Ridge Met Cheval. Reckons things going fair to good on left. Jack Clark & self to summit for look at scene. Great. Ambulance busy. Many ships all sorts. Guns along beach. Sapping on \n\nflat. Horsemen. Down Cantby Gully. Leinsters gone. No more in Mortuary. Had good tea & then home (?) to bed.\n","120":" Things still lively on the left it appears & large numbers of wounded being sent in also plenty of rumours Commenced collecting rifles & equipment\n","121":" Nothing very fresh Hill taken – Hill retaken Hill not taken at all etc etc Corp Villis not yet found or body in. Turks gave the valley the dence of a shrapneling in the morning & got some Terriers.\n","122":" Heard from Eustace also paper from Watson Butterworth & Jacobs injured by own bomb. Former serious Seymour had arm smashed\n\nby bomb possibly lose it. Collected some more rifles etc. Things much cleaner One body in A. Squad 3rd. Very quiet day so far as firing is concerned. 2 men & a mule sniped down road. Capt Farr does not seem so d-d cheerful as a week ago Met Lieut Margills & another on the beach. Had short yarn. Bathe. Detail of 3 men & Corpl on shifting tins from Morgue to destructor. Bill Jenkins said to be Killed.\n\nBirdwood’s manifesto admits \nvery heavy\n losses this means most severe I should say.\n","123":"","124":" 14th Things quiet & nothing\n\nof any special mention Pretty busy & much to see to\n","125":" Made a biggish round this day.\n\nGot Merrington’s rag out re tins & waste Poor devil Bathe in evening & a sharp dose of shrapnel as a finale \nCamm QM\n Many rumours but no news\n","126":" . Busy day. Rumours sunken troop ship with Hampshires on bd Also captured Turkish submarine in nets at Lemnos. Farr Comes from Devon stock. Busy day. New sanitary matters to see to. Visited Courtney’s V.B. Yarn we all go to left. Muir return to his Batt. A scheming dog.\n\nOpen Letter to The Officers \n\nNotes\n\nThe service from whence the officers drawn\n\nThe original appts made in a holiday spirit for what was thought to be a holiday trip.\n\nNow the error. Too late The state of turmoil since the commencement Orders & counter orders The uniform. The pay The Manual.\n\nThe want of correct discipline. Pin prick tactics are not discipline Actual offenders not punished but nearly always the whole squadron The food. The meal hours. The example of the officers\n\nof the AIE Force\n\nThe element of youth in the force. Youth may be efficient but experience of men should count. The boy scout element. Horseman ship does not make soldiers.\n\nPolish not achieved with sand & dust & 16 hour days Active service when it suits them. Others parade & polish.\n\nThe duties of an officer\n\n1st duty to his men Their food & comfort Soldiers boot laces – Six mths for this progress Whose to blame.\n\nThere must be some duffers as we can’t all be privates\n","127":" 18 Thur 19 & Fri 20 Everything pretty much as usual\n\nVery few dead coming in at our Morty & not much firing Benetto came to tea on Thursday. His comments on the treatment of the sick at Lemnos are sweet. Chaos & incompetence RAMC on boat across.\n\nThrow in 1\/- each & can get you some cakes. 8\/- = 1 small box of inferior cakes.\n\nDr Campbell & his stretcher to the landing stage. The latrines at Lemnos etc. The doctors & officers who go away sick when any engagement is coming off. Goucher of 2 ALH one of em.\n\nCan’t all be his. Copley has gone now & officer from another Squadron is \n\nQueries\n Re the lst time cavalry charge - ?\n\nRe the rifles piled when digging trenches Which side. \n\nappointed to take his place Rumoured Greeks are into it. We all hope so.\n\nThat Japan has given Turks 10 days to open Dardanelles That we are all going away to recuperate at a place where there is \nno beer\n. What about the officers Mac F & his yarn re Mjr Bourne. Dismount to receive Camelry. The Ghurka who cut the turks head off. \n\nThe Turkish champion bomb thrower\n\nHave not met a man yet who\n\nonce away from his squadron is anxious to return. They all seem to hate it.\n","128":" Met Kim Went up to Cantly Gully. Heard Grace was dead. Hard luck. Milk","129":" tin from Lyons & glad to get it. Snipers had a couple at me in morning. Jack Clarke has got hit in the throat this happened several nights ago Serious but perhaps not dangerous.\n\nPosted\n this week to Mater Eustace & Photo to Mrs Brooks. The nights are getting colder & the days closing in. At midday (?) heard had to be examined re home commission. Dr Mainwaring examined me Lt I believe \n\nSome demonstration at 3.30 by our front as a general attack was taking place on left flank in day light Heavy firing on left all noon & night. The bombing by our men on Quinns seemed specially good. Absence of machine gun fire noticeable.","130":" Div I believe it is have landed on left also","131":" Aust reinforcements.\n","132":" Before breakfast did Walkers saps & firing line Courtneys & main sap. Former of last two very unsanitary.\n\nSnipers had two goes at me early. One close. I am pleased with notice re saps\n\nSun 22 Bathe noon below Snipers Peak Mac T unwell & off duty. Jock came to tea.\n","133":" Fatigue of Leinsters at 8 am took down rifles & ammtn & equipment from Popes Cross roads. Turks snipers been busy – caught two. Had burn at incinerator in morn.\n","134":" 25\n\nOn our front things quiet Was up on Quinns & saw some of the boys. Seemed glad to see me – Letter from Denys.\n\nButcher returned from Egypt. He slept at our possie Lyte & Swaney came to lunch & brought half bott rum & took\n\naway some things in tucker line\n\nOn left we have a well & they say Anafarta\n","135":"\n\nBusy day Heavy rally at night twice. Near shave of shrapnel at Morgue noon\n","136":" Heard from Mtr papers from Whites & home & goods from Denys Another busy day Burn at incinerator noon We move round to left they say soon.\n\nJack Riley & Gleeson sick Met them going into rest.\n","137":" Woke up stiff in joints & sore of head\n","138":" Still feel old & rotten. Rested all morn\n","139":" Went to doctor in morning. Pills & to lie down \nEvening\n come tomorrow\n","140":" Sent down to Hospital in evening 103 ° Sun sent aboard\n","141":" arr in Cairo No 2 G.H. off S.S. Salva\n","142":" Went into Cairo & drew £ 10. First trip into the city since return Met Mr C Sinder.\n","143":" To Ghiza Zoo with Brookhouse & Baird Met Sisters Lehmann at 2.30 & had a most pleasant day.\n","144":"\n\nLeft Ghezireh at 11 by motor lorry. Station Dept 12 o’c. Reached Montazah about 4 pm. Not a pleasant journey. Hungry to bed. First impressions not very good.\n","145":" Posted to Sister Lehman, & Card to Base office.\n","146":" Posted to Mr & Mrs Cripps also Massingham\n\n"}}