{"Document Name":{"0":"Diary_0261","1":"Diary_0261","2":"Diary_0261","3":"Diary_0261","4":"Diary_0261","5":"Diary_0261","6":"Diary_0261","7":"Diary_0261","8":"Diary_0261","9":"Diary_0261","10":"Diary_0261","11":"Diary_0261","12":"Diary_0261","13":"Diary_0261","14":"Diary_0261","15":"Diary_0261","16":"Diary_0261","17":"Diary_0261","18":"Diary_0261","19":"Diary_0261","20":"Diary_0261","21":"Diary_0261","22":"Diary_0261","23":"Diary_0261","24":"Diary_0261","25":"Diary_0261","26":"Diary_0261","27":"Diary_0261","28":"Diary_0261","29":"Diary_0261","30":"Diary_0261","31":"Diary_0261","32":"Diary_0261","33":"Diary_0261","34":"Diary_0261","35":"Diary_0261","36":"Diary_0261","37":"Diary_0261","38":"Diary_0261","39":"Diary_0261","40":"Diary_0261","41":"Diary_0261","42":"Diary_0261","43":"Diary_0261","44":"Diary_0261","45":"Diary_0261","46":"Diary_0261","47":"Diary_0261","48":"Diary_0261","49":"Diary_0261","50":"Diary_0261","51":"Diary_0261","52":"Diary_0261","53":"Diary_0261","54":"Diary_0261","55":"Diary_0261","56":"Diary_0261","57":"Diary_0261","58":"Diary_0261","59":"Diary_0261","60":"Diary_0261","61":"Diary_0261","62":"Diary_0261","63":"Diary_0261","64":"Diary_0261","65":"Diary_0261","66":"Diary_0261","67":"Diary_0261","68":"Diary_0261","69":"Diary_0261","70":"Diary_0261","71":"Diary_0261","72":"Diary_0261","73":"Diary_0261","74":"Diary_0261","75":"Diary_0261","76":"Diary_0261","77":"Diary_0261","78":"Diary_0261","79":"Diary_0261","80":"Diary_0261","81":"Diary_0261","82":"Diary_0261","83":"Diary_0261","84":"Diary_0261","85":"Diary_0261","86":"Diary_0261","87":"Diary_0261","88":"Diary_0261","89":"Diary_0261","90":"Diary_0261","91":"Diary_0261","92":"Diary_0261","93":"Diary_0261","94":"Diary_0261","95":"Diary_0261","96":"Diary_0261","97":"Diary_0261","98":"Diary_0261","99":"Diary_0261","100":"Diary_0261","101":"Diary_0261"},"Date":{"0":"unknown","1":775.0,"2":776.0,"3":777.0,"4":778.0,"5":779.0,"6":780.0,"7":781.0,"8":782.0,"9":783.0,"10":784.0,"11":785.0,"12":786.0,"13":787.0,"14":788.0,"15":789.0,"16":790.0,"17":791.0,"18":792.0,"19":793.0,"20":794.0,"21":795.0,"22":796.0,"23":797.0,"24":798.0,"25":799.0,"26":800.0,"27":801.0,"28":802.0,"29":803.0,"30":806.0,"31":807.0,"32":808.0,"33":809.0,"34":810.0,"35":811.0,"36":812.0,"37":813.0,"38":814.0,"39":815.0,"40":816.0,"41":817.0,"42":818.0,"43":819.0,"44":820.0,"45":821.0,"46":823.0,"47":824.0,"48":825.0,"49":826.0,"50":827.0,"51":828.0,"52":829.0,"53":830.0,"54":831.0,"55":832.0,"56":833.0,"57":834.0,"58":835.0,"59":836.0,"60":837.0,"61":838.0,"62":839.0,"63":840.0,"64":841.0,"65":842.0,"66":843.0,"67":844.0,"68":845.0,"69":846.0,"70":847.0,"71":848.0,"72":849.0,"73":850.0,"74":851.0,"75":852.0,"76":853.0,"77":854.0,"78":855.0,"79":856.0,"80":857.0,"81":858.0,"82":859.0,"83":860.0,"84":861.0,"85":862.0,"86":863.0,"87":864.0,"88":865.0,"89":866.0,"90":868.0,"91":869.0,"92":870.0,"93":871.0,"94":872.0,"95":873.0,"96":874.0,"97":875.0,"98":876.0,"99":877.0,"100":878.0,"101":879.0},"Entry":{"0":"\n\n \n\nDairy ","1":"\n\nFeb 1st Still on Engineering but given orders to rejoin unit tomorrow. Bright sun cool breeze, exempt from Outpost duty.\n","2":"\n\nLecture on Outposts & positions etc. Afternoon 1 hours Signaling. Letterwriting afternoon & evening. Short Rations. 96 Biscuits 4 Breads 8 tins (1lb) Jam & light cheese between 34 men for 24 hours.\n","3":"\n\nBkfast ½ hr. earlier marched with Packs, East forward past \"Camels Humps\" returned to camp 1.30pm. 3Pm. pitching tents for D.Coy & C.Coy\n\nOn Outpost 7 & 8 Platoons.\n\n \n","4":"\n\nMorning resting . Afternoon Courtmarshall Sentence passed on A.Coy man then on Protection on March. Writing evening, sent 3 in to Cairo privately.\n","5":" Wet night\n\nStruck camp 9am. to move East about 1500 yds. everything transported and all tents up by 2Pm. Dinner 2.30. 3 biscuits, fair cheese 2\/3 lid of tea. Writing after.\n","6":"\n\nB.Coy for duty. Myself & 4 men on Teliscope Sentry Group 7am till 8pm. No relief sent out for us nor knowledge of. Did letter writing & reading. Meals sent out to us.\n","7":"\n\nDrilling morning, Trench diging afternoon. Represented Coy. for General Complaint\n\n looked into & extra issue sought for.\n","8":" \n\nDrill all day, nothing out of the way. Bread issue but rations still short.\n","9":"\n\nB.Coy for duty. Trench diging all day. Outpost all night myself on reserves connecting with A.Coy. ½ hours transfer. Turned in about 10.30pm. Beautiful night.\n","10":"\n\nAwoke under heavy fog with blkts. etc soaking got back to Camp about 6.15am.\n\nSunbathing & writing morning. Coy. in attack afternoon. Very hot & settled.\n","11":"\n\nCoy Orderly Cpl, busy morn quiet afternoon writing; Parcel from Eileen.\n\n \n","12":"\n\nCoy for duty diging till midday, With 12 men & Camels to HQrs for Ammunition for Gundagi then back to Railhead leaving camp Sunset second time & reaching destination about 8Pm.\n","13":"\n\nLoading Camels 41 with Water for 17th sent off at 7.30. Bkfast then loading Rations returning to Gundagi about 3Pm.\n","14":"\n\nDiging morning. Drill after dinner. Parcel from Aunt Annie.\n","15":"\n\nDrill morning. Diging afternoon. Outpost all night. Wet most of day, cleared off from teatime but cold.\n","16":"\n\nMorning off rest & writing\n\n \n\ndiging afternoon, took few photos in camp after parade. Writing. raining heavy afternoon 2 showers. Parcel Mrs Landers Socks.\n","17":"\n\nSignalling & Musketry till dinner time. Dressed for Cairo left camp 3Pm. on foot to Road West of 353 & caught motor transport from the 9 Kilom peg geting to Ferry Post at sunset. Had fast tea turned in 11pm.\n","18":" \n\nUp at 4am walked to Ismalia stn caught train 6am arriving Cairo 9.40 Much business, went to Heliopolis to see Derek & Syd about 5 to 7pm. then back to Cairo, finished shopping & went to my Room. Hotel Metropol 9pm.\n","19":"\n\nUp 5.30am Cold bath dressed & walked up to\n\n \n\nrailway 9.45, had snack Cakes & Coffee & with extra for journey, strayed out 7am reaching Ismalia 10-40 am by train to railhead 1.30Pm. back to Camp 3.30Pm.\n","20":"\n\nOrderly Cpl. easy day, showers during day. Platoon off duty from after Church Parade\n","21":" \n\nCpl of Qr. Guard easy day, reading & writing.\n","22":"\n\nOff duty 9am to 2Pm. Diging afternoon.\n","23":"\n\nDiging all day.\n","24":"\n\nDiging all day. Recd photos from Cairo . Orderly Cpl all night.\n","25":"\n\noff duty morning. Writing etc afternoon digging.\n","26":"\n\nDiging all day. Reading night.\n","27":"\n\nChurch Parade morning.\n\nOutPost 2 to 4.30Pm. 2 Miles East 1 North then returned. \n\n3 letters 2 parcels from Johnstons.\n","28":"\n\nDiging all day. Patrol all night\n\n7Pm saw camel passing us, No1 Picket & Camp. Challenged it , it turned & fled, so opened fire & dropping it about 100 yds off. Great excitement fun all round Gundagai all Standing too, & manned new trenches till report was sent in.\n","29":"\n\nBattalion Parade to congratulate all hands on Previous nights \"Action\". Also Enquiry by Spl Board re Matter of Shooting & killing Camel which called for written statement by \n\n \n\nself & 3 other monikers entailed. I was at time in charge of the Picquet, about 16 men.\n\nDiging afternoon on B2 Trench. Writing afternoon & evening.\n","30":"\n\nStopped off parade all morn writing etc. rec’d Black Kits midday. Afternoon holiday. Beauti full day & hot & cloudy windless. \n","31":"\n\nOrderly Cpl for day, awful wind sand storm with heavy sky. Writing.\n","32":"\n\nStill sand-storming too heavy for diging or rifle sighting, drill all day.\n\nOutpost night, very dark but mild sleeping out.\n","33":"\n\nStorm ceased but sky overcast. Morning off. \n\nAfternoon on trenches. Photoes taken\n\n \n","34":"\n\nMusketry Grouping morning afternoon off. Warned to shift Camp\n","35":"\n\nBkfast 7am. Messed clear of camp about 8am. Cleaned up lines and struck camp about 10am. N.Z.M.R. took over about same time. Our band played them in: looked well. Marched off about 11.30am. Picked up A.Coy & with 30 minute marches reached road 1pm. & Ferry Post 5pm. Pitched tents & settled down with O.K. about 7.30.\n","36":"\n\nWithout previous warning struck tents about 8am and prepared to move out. Camp cleaned & OK ready for marching 10.15am. Marched Pontoon Bridge & halted at Ordinance Stores where we changed rifles\n\n \n\nhad lunch & marched on again 1pm about at attention all the way, most unreasonable men couldn’t stand it 110 falling out in the last mile. 1st rest 1.2 mile from final Camp ½ hours rest. Tents were ready to take over up ready & settled down about 4.30pm. Stew & tea evening meal. \n","37":"\n\nCoy. for duty. Orderly Cpl self. Bathing Parade 9.15am. \n","38":"\n\nChecking equipment etc. all parts made up.\n","39":"\n\nDrill morning. Routmarch afternoon.\n","40":"\n\nArodom Guard \ntill \n 24 hrs Photoes many\n","41":"\n\nRelief not brought till 2Pm instead of 9.30am.\n\n \n\nTook myself for a bathe till 5Pm. also photographying\n","42":"\n\nPlatoon & Musketry Drill morning. Leave to Ismalia 1 to 5Pm. Registering letter to Syd & taking photoes roundabout.\n","43":"\n\nRifle range allday very bright and hot.\n","44":"\n\nShooting morning. Bathing Parade afternoon. Writing YMCA and with Martin met MacArthur.\n","45":"\n\nDrill morning. Handed in one spare Blkt. Afternoon cleaned lines & other preparation for leaving. Battalion moved out of lines with everything complete at 5.30pm Bivouaced the night near railway so as to leave camp clean.\n\n \n\n17.th. Friday. March.\n\nRoused 1.30am. Moved off to entrain and aboard about 3am in open goods trucks 23 men per. truck. Got down to is & slept till about &am passed Tel-el-Tebir about 6am. Slept most of the trip & had meals Bread, eggs, jam, paste, oranges and reached Alexandria Docks about 1.30pm. train going right along side of ship where we detrained and a couple of hours later embarked on S.S. ‘ARCADIA’, P.&.O. Line. making about 3000 three thousand troops aboard. \n\nActed Coy-Orderly Cpl & had tea 5Pm. leaving moorings an hour later 6Pm. Slept in hammock on Messdeck.\n","46":"\n\nRoused about 6.30am. Bkfast 7am. intended parade 9am. but Coy. being on Duty was cut out. Dinner 12. Slept all afternoon. Tea 5Pm. Reading and making up Diary later.\n","47":"\n\nReading & Cards morning, ditto afternoon. Weather calm & clear. Writing evening.\n","48":"\n\nWeather continues good. parade for innoculations & reading. Afternoon Rifle cleaning & Seniority lists gone into. Recommended for 3rd Stripe. Writing eve. Passed Malta 5.30Pm. Looked fine Rugged & strong & large.\n","49":"\n\nWeather fair but cold. Good Hot Bath after lunch rooms. Finished up letter writing for mail. Sea rising & heavy wind towards evening\n","50":"\n\nMail closed 9am. Weather fair again. S.A. Inspection. reading & washing.\n","51":" \n\nOrderly Cpl. Dissembarked about 10.30 Lunch on wharf dealing with French people\n\n \n\nat gate opp. for fruit, cakes etc, great sport, admirably honest dealers – thoroughly cheered us up. Paraded & marched to railway about 2.30. entrained about 3.15 8 per apartment good cabs. Girls generally beautiful.\n\nTrained steamed out 4.40pm beautifull scenery allround wonderfull works, embankments, viaducts, roads etc. Very slow train many halts evidently running between timetables. Hot liquered tea 12Pm.\n","52":"\n\nStill good scenery, small allotments country gardens etc. Reached Lyon 7am on Grand river wonderfully bridged about six (6) within sight of rail. Stopped about 10am for hot tea. Rations for tea issued 4Pm but delayed till about 8. good French bread & butter. Riding on top of\n\nof car to light gass burners. Wet more or less all day.\n","53":"\n\n4am Hot tea at Les Lauines Alesia stayed till 7.30. Hot water from engine for shav wash & tea. 5 Fast expresses passed in that time. Very heavy frost.\n\nNoon till 1Pm at Montreau tea issued, cleaned out our compartments. At Melum turned to left on side line. 2.30Pm. Ran along left of river (very pretty) and reached Juvisy about 3.30. Stayed there till 4Pm when engine changed ends & took us back again some distance & finally turned South & ran west, Passed about 5Pm. Very large and fine Palace with extensive lawns & lakes in front. Juvisy is about 9 kilometres from Paris, rather dissapointing so near\n\n \n\nyet so far. Many aeroplanes about this district which is very pretty. French people throughtout welcomed us heartily. Weather changeable more or less dull. Arrived at Oriele 10pm\n","54":"\n\nWet morning reached sea coast 6.30am. small ship sunk close in shore masts visible from train. Passing Calis 8.15, small place apparently & nothing striking, later 9.30 reached St. Amiene much like Calis & general townships\n\nRunning more South East reached Hazebrouck 10.40 country very wet & cold. farms mainly. seriel crops \n\nTommies seen along latter end of journey making railways etc.\n\n \n\nReached our destination Thiennes about 11.30 and issued with second blanket at railway about 12.30 later to march with band playing through the town & billeted in French houses Eastern end of same. Our Barn contains 20, with straw to sleep on. Army Rations issued arrange our own meals. feel the cold very much. \n","55":"\n\nRose around 7 to 7.30am.\n\nParade 10 to 12. Told off for Permanent Patrol with 6 men within Coy’s boundaries 6Pm to 8.30Pm. exempt from other parades during day.\n","56":"\n\nPatrols to be kept up all day also 2 men at one time got Blk Kit bag. Little snow fell midday. very cloudy & cold.\n\n \n","57":" &","58":"\n\nWeather still cold but more settled nice sun at time. evenings much milder.\n\n31th. Saturday\n\nWeather fine & warm morning marched full order to place of Gass test about 5 miles. Helmets proved big use in passing through Trench well gassed about 10 yards long; after this test we removed Helmets and experience Weeping Gass nearby where a Bomb had been exploded for purpose. Later causes eyes to tingle & water freely & sight impossible temporarily. 20th Battn represented 5th Bgde. in Kitcheners inspection at Aire during afternoon.","59":" returned to Billets 4.30Pm footsore & ready for meal.\n\n \n","60":"\n\nWeather very pleasant, warm visited village 10 to 12 (noon) Recd. parcel from Eileen. N.Z.\n","61":"\n\nWalked with other mates to Steenbeck for afternoon took 2 snaps returned about sundown, put about 1 hour in Thiennes & returned to billet. Nice day.\n","62":"\n\nusual duty, weather good\n","63":"\n\nAfternoon Snaps along canal in rear. evening develloped same & others beautiful weather bed in Pm. Parcel of Kodak films Fowler N.Z.\n","64":"\n\nAll day Route march 10 miles with Transports etc. well organised with rests. Developing finished night 11Pm. Results of 10 films very fair. weather dull moderate temperature.\n","65":"\n\nColder & dull weather, all films\n\n \n\ndried & trimmed. Anzac Address Forms filled in afternoon to Kitty & Mrs Sanders.\n","66":"\n\nBlkts stowed in Transports 7am. Bkfasted & Fell in 8am. 17th in rear of Bgde. marched via Steenbeck Morbeck Hazebrouck after 10 miles had dinner at Borre East a little at 2 Pm. Continued reaching Outtersteen about 4Pm. Billeted in big farmhouse on road to & about 2 ½ K. from was occupied 16 mth. ago by Germans. Comfortable straw bedding.\n","67":"\n\nUp 7am. Blkts stowed 8 Fell in 9. 17 in rear back through Outtersteen & on forward march 10am. Lunch W. of Steenwerk which was passed through at 2Pm. very roundabout course & quiet cemetry surrounding. rechd \n\n \n\nBillets at Erquinghem about 4.30 after march of about 10 miles. Good tea. Board floored huts to hold 17 each. Bed 8Pm. Much heavy artillery fire around us.\n","68":"\n\nReveille 7 Bkfst 8. No duty at all went up town with Roberts where we had dinner returning about 2Pm to write & rest till later. Tea in town again. went for walk after through St. Maur. very nice met in with H.L.I. Reg. Highland light Infantry who treated us tiptop, spent evening singing reciting dancing & joking, getting home 10Pm. after being stuck up by Sentry on way. Really enjoyed ourselves immensely.\n","69":"\n\nReveille 8am. Muster Parade 7 lecture 10.30 regarding entrenching. 11am went up town for dinner etc, getting home again about 3Pm. leaving for Trenches 6.45Pm. about\n\n \n\n2 hrs march, through very open country roads. several rests. no opposing fire. Relieved Northumberland Fusilers about 9.30Pm. Weather dull. Business quiet.\n","70":"\n\nPosition very fair 450 range quiet. raining. very rough trenches. real bogs & flooded saps. no comforts or shelter from weather whatever, soon got to & made some & fires going.\n","71":" \nSaturday. \n Wed.\n\nWeather very nice during day. night moonlight & quiet.\n","72":"\n\nRaining again & changable quiet morn opposing artillery gave us a few light shells no casualties in B. Coy otherwise very quiet.\n","73":" English parcel. Film. Weather very dirty, rain, hail & snow with light wind. Teasing enemy machine guns. enemy fire very reckless & poor seen bailing their trenches out early morning.\n","74":"\n\nWeather as Friday more sunshine\n\n \n\nbut changable with snow. General Legg & Holmes visited us. one of my Boy earmarked by bullet from Sniper. good rations today best since the 10th inst. Relieved by 19th Battn 9.30 PM.\n","75":" \n\nB.Coy. Billeted in large farmhouse nearest direct road to 3 Emergency Rd. Self Ordly Cpl. 150 men on Engineers Fat. to Trenches\n\nLetterwriting after dinner walking about after tea. Weather grand.\n","76":"\n\nB.Coy Part to Erquinghem labouring; bathing etc. self letterwriting. Weather miserably wet & windy & cold.\n","77":"\n\nEngineers fatigue 100 men to first line of Supports weather dirty.\n\nHad an interesting chat on personal matters occupation & promotion with General Holmes.\n","78":"\n\n150 men Trench Fat again 3am till 2Pm. Incharge of Cook\n\n \n\nration supply for party between The cottage & party sections. Trench mortar fired 2 shots (good direction) into enemy 1st line & brought on a searching fire 40 rounds in return 4.7\" H Exp. 1 casualty no damage whatever done us. Raced home and thence to Hot Bath House & change of underware, enjoyed it immensely, organisation perfect throughout. returned to trenches 7.30 took over 10Pm. Brutal night, route terribly sloppy.\n","79":"\n\nUsual trench routine. Acting Sgt. now on. Black away found it very busy. 16 men & 2 NCO’s from each platoon on Engineers Fatigue 6am till 2Pm. Showery weather by day – night good\n","80":"\n\nBeautiful weather till dinner after cloudy evening very wet. Exciting aerial chases all day. duels in air.\n\n \n\nafternoon enemy guns played on our first line & supports also on our left. no great damage nor casualty. Parcel from V.W. socks & mittons also several letters Aus. NZ. & Eng. Used Dugout evening.\n","81":"\n\nVery wet day. engineering fatigue dismissed on that a\/c. slept all morn. 9.2\" Guns bombarded enemys heavy bateres & rear 1Pm. trench warfare very quiet\n","82":"\n\nWeather very fair with lovely sun. Enemy artillery 6\" opened on our 1st line & supports. 1 gun till noon then a battery of 6 guns put in 292 shots in 33 minutes only 1 casualty, though parapets knocked about in many places. Our guns replied fully & enemy silenced. many aeroplanes (ours) about later one flying over enemy battery & lines & fired on fiercely but all O.K. \n\nSeveral snaps taken. \n\n \n","83":"\n\nRevielle 9am. Nothing special on.\n\n25th. Tuesday. 1st. London leave","84":" Coy. on Trench Fatigue. Saw Dr. re teeth no vacancies. Parcel from Syd.\n","85":" weather grand. Visited Erquinghem 10 till 12 Noon letterwriting etc afternoon. 7.15 till 1Pm on Engineers fatigue cuting new sap off Tramway Avenue.\n","86":"\n\nRelieved 19th Battn in Reserve about midday. Bombing about 8pm a little left and 10pm enemy spring a Gass demonstration without effect Gass clouds passing from left to right across frontage got taste of it in Reserves\n\nOur light artillery poured much fire into enemy & had some returned also H.Exl. 6\" by sound \"Carry on\" about 11.15pm. Engineers carrying fatigue till 2.30am Friday. weather beautifull\n","87":"\n\n\"Standto\" 3.30 to 5am sky clear & beautiful.\n","88":"\n\nWith representatives from other platoons went to new positions west of A Coy. to learn disposition etc of trenches.\n","89":"\n\nMails in returned to Reserve till midday & boys taking stock for handing over later. B.Coy relieved 8.30pm. all well weather conditions glorious.\n","90":" May\n\nSky a little unsettled no rain all quiet on front, relieved by 19th. Batt 9pm. returned to Billets.\n","91":"\n\nThreatening rain but cleared off. Up 4.30am. Reported to Engineers 6am in Sap for trench fatigue till noon.\n\n \n","92":"\n\nWeather fair, went to Erquinghem 5th F.P.O. to register Money 70F to Ern home 2Pm. Camera working badly. film blocking.\n","93":"\n\nWeather changable, nothing out of way.\n","94":"\n\nWeather windy & dull, mild 7pm. as engineers fatigue were on way to trenches Enemy bombardment began very heavy & concentrated on the Salient where","95":" Battn were holding, fire very feirce by both sides & casualty list heavy. 17th stood too in billits, Gas helmets on on a\/c of alarm, later reinforced our line, stood too in reserve all night though all was quiet from 9.30Pm. returned to billits 6am day after.\n\n \n","96":"\n\nWent for a bath after lunch weather changable. slept all morning.\n\n7th. Sunday.\n\nLetterwriting most of day, sleeping afternoon, weather showery cleared toward sun set. Church service after tea very nice. Snaps taken.\n","97":"\n\nUP 4.30am trench fatigue till midday with 30 men visited salient between 11 & noon. \"snaps\" taken Bath afternoon, showery & cold, hailstorm.\n","98":"\n\nDay cold & showery, Sgts lectured by Mansfield, Raid in thought by our side for tonight. Slept afternoon. fatigue of 80 went to trenches. No Raid or standtoo after all.\n\n \n","99":"\n\nWeather more fair, leave interfered with, promised next N.C.O. Orderly Sgt with Cpl. Simpson. Indexed photos sending Kitty from England also negs.\n","100":"\n\nWeather unsettled. Bathing afternoon. Engineers Fatigue of 4 men 7.45pm. to 3am.\n\n12th Friday\n\nSlept in till dinner time Bath afternoon. trenches, Relieved 19th 10pm.\n\nAnniversary of Sydney Farewell","101":"\n\n"}}