{"Document Name":{"0":"Diary_0410","1":"Diary_0410","2":"Diary_0410","3":"Diary_0410","4":"Diary_0410","5":"Diary_0410","6":"Diary_0410","7":"Diary_0410","8":"Diary_0410","9":"Diary_0410","10":"Diary_0410","11":"Diary_0410","12":"Diary_0410","13":"Diary_0410","14":"Diary_0410","15":"Diary_0410","16":"Diary_0410","17":"Diary_0410","18":"Diary_0410","19":"Diary_0410","20":"Diary_0410","21":"Diary_0410","22":"Diary_0410","23":"Diary_0410","24":"Diary_0410","25":"Diary_0410","26":"Diary_0410","27":"Diary_0410","28":"Diary_0410","29":"Diary_0410","30":"Diary_0410","31":"Diary_0410","32":"Diary_0410","33":"Diary_0410","34":"Diary_0410","35":"Diary_0410","36":"Diary_0410","37":"Diary_0410","38":"Diary_0410","39":"Diary_0410","40":"Diary_0410","41":"Diary_0410","42":"Diary_0410","43":"Diary_0410","44":"Diary_0410","45":"Diary_0410","46":"Diary_0410","47":"Diary_0410","48":"Diary_0410","49":"Diary_0410","50":"Diary_0410","51":"Diary_0410","52":"Diary_0410","53":"Diary_0410","54":"Diary_0410","55":"Diary_0410","56":"Diary_0410","57":"Diary_0410","58":"Diary_0410","59":"Diary_0410","60":"Diary_0410","61":"Diary_0410","62":"Diary_0410","63":"Diary_0410","64":"Diary_0410","65":"Diary_0410","66":"Diary_0410","67":"Diary_0410","68":"Diary_0410","69":"Diary_0410","70":"Diary_0410","71":"Diary_0410","72":"Diary_0410","73":"Diary_0410","74":"Diary_0410","75":"Diary_0410","76":"Diary_0410","77":"Diary_0410","78":"Diary_0410","79":"Diary_0410","80":"Diary_0410","81":"Diary_0410","82":"Diary_0410","83":"Diary_0410","84":"Diary_0410","85":"Diary_0410","86":"Diary_0410","87":"Diary_0410","88":"Diary_0410","89":"Diary_0410","90":"Diary_0410","91":"Diary_0410","92":"Diary_0410","93":"Diary_0410","94":"Diary_0410","95":"Diary_0410","96":"Diary_0410","97":"Diary_0410","98":"Diary_0410","99":"Diary_0410","100":"Diary_0410","101":"Diary_0410","102":"Diary_0410","103":"Diary_0410","104":"Diary_0410","105":"Diary_0410","106":"Diary_0410","107":"Diary_0410","108":"Diary_0410","109":"Diary_0410","110":"Diary_0410","111":"Diary_0410","112":"Diary_0410","113":"Diary_0410","114":"Diary_0410","115":"Diary_0410","116":"Diary_0410","117":"Diary_0410","118":"Diary_0410","119":"Diary_0410","120":"Diary_0410","121":"Diary_0410","122":"Diary_0410","123":"Diary_0410","124":"Diary_0410","125":"Diary_0410","126":"Diary_0410","127":"Diary_0410","128":"Diary_0410","129":"Diary_0410","130":"Diary_0410","131":"Diary_0410","132":"Diary_0410","133":"Diary_0410","134":"Diary_0410","135":"Diary_0410","136":"Diary_0410","137":"Diary_0410","138":"Diary_0410","139":"Diary_0410","140":"Diary_0410","141":"Diary_0410","142":"Diary_0410","143":"Diary_0410","144":"Diary_0410","145":"Diary_0410","146":"Diary_0410","147":"Diary_0410","148":"Diary_0410","149":"Diary_0410","150":"Diary_0410","151":"Diary_0410","152":"Diary_0410","153":"Diary_0410","154":"Diary_0410","155":"Diary_0410","156":"Diary_0410","157":"Diary_0410","158":"Diary_0410","159":"Diary_0410","160":"Diary_0410","161":"Diary_0410","162":"Diary_0410","163":"Diary_0410","164":"Diary_0410","165":"Diary_0410","166":"Diary_0410","167":"Diary_0410","168":"Diary_0410","169":"Diary_0410","170":"Diary_0410","171":"Diary_0410","172":"Diary_0410","173":"Diary_0410","174":"Diary_0410","175":"Diary_0410","176":"Diary_0410","177":"Diary_0410","178":"Diary_0410","179":"Diary_0410","180":"Diary_0410","181":"Diary_0410","182":"Diary_0410","183":"Diary_0410","184":"Diary_0410","185":"Diary_0410","186":"Diary_0410","187":"Diary_0410","188":"Diary_0410","189":"Diary_0410","190":"Diary_0410","191":"Diary_0410","192":"Diary_0410","193":"Diary_0410","194":"Diary_0410","195":"Diary_0410","196":"Diary_0410","197":"Diary_0410","198":"Diary_0410","199":"Diary_0410","200":"Diary_0410","201":"Diary_0410","202":"Diary_0410","203":"Diary_0410"},"Date":{"0":"unknown","1":535.0,"2":536.0,"3":537.0,"4":538.0,"5":539.0,"6":540.0,"7":541.0,"8":542.0,"9":543.0,"10":544.0,"11":545.0,"12":546.0,"13":547.0,"14":548.0,"15":555.0,"16":556.0,"17":558.0,"18":559.0,"19":560.0,"20":561.0,"21":562.0,"22":563.0,"23":564.0,"24":565.0,"25":566.0,"26":567.0,"27":568.0,"28":569.0,"29":570.0,"30":571.0,"31":572.0,"32":573.0,"33":574.0,"34":575.0,"35":576.0,"36":577.0,"37":578.0,"38":579.0,"39":580.0,"40":581.0,"41":582.0,"42":583.0,"43":584.0,"44":585.0,"45":586.0,"46":587.0,"47":588.0,"48":589.0,"49":590.0,"50":591.0,"51":592.0,"52":593.0,"53":594.0,"54":595.0,"55":596.0,"56":597.0,"57":598.0,"58":599.0,"59":600.0,"60":601.0,"61":602.0,"62":603.0,"63":604.0,"64":605.0,"65":606.0,"66":607.0,"67":608.0,"68":609.0,"69":610.0,"70":611.0,"71":612.0,"72":613.0,"73":614.0,"74":615.0,"75":616.0,"76":617.0,"77":618.0,"78":619.0,"79":620.0,"80":621.0,"81":622.0,"82":623.0,"83":624.0,"84":625.0,"85":626.0,"86":627.0,"87":628.0,"88":629.0,"89":630.0,"90":631.0,"91":632.0,"92":633.0,"93":634.0,"94":635.0,"95":636.0,"96":637.0,"97":638.0,"98":639.0,"99":640.0,"100":641.0,"101":642.0,"102":643.0,"103":644.0,"104":645.0,"105":646.0,"106":647.0,"107":648.0,"108":649.0,"109":651.0,"110":652.0,"111":653.0,"112":654.0,"113":655.0,"114":656.0,"115":657.0,"116":658.0,"117":659.0,"118":660.0,"119":661.0,"120":662.0,"121":663.0,"122":664.0,"123":665.0,"124":666.0,"125":667.0,"126":668.0,"127":669.0,"128":670.0,"129":671.0,"130":672.0,"131":673.0,"132":674.0,"133":675.0,"134":676.0,"135":677.0,"136":678.0,"137":679.0,"138":680.0,"139":681.0,"140":682.0,"141":683.0,"142":684.0,"143":685.0,"144":686.0,"145":687.0,"146":688.0,"147":689.0,"148":690.0,"149":691.0,"150":692.0,"151":693.0,"152":696.0,"153":697.0,"154":698.0,"155":699.0,"156":700.0,"157":701.0,"158":702.0,"159":703.0,"160":704.0,"161":705.0,"162":706.0,"163":707.0,"164":708.0,"165":709.0,"166":710.0,"167":711.0,"168":713.0,"169":714.0,"170":715.0,"171":716.0,"172":717.0,"173":718.0,"174":719.0,"175":720.0,"176":721.0,"177":722.0,"178":723.0,"179":724.0,"180":725.0,"181":726.0,"182":727.0,"183":728.0,"184":729.0,"185":730.0,"186":731.0,"187":732.0,"188":733.0,"189":734.0,"190":735.0,"191":736.0,"192":737.0,"193":738.0,"194":739.0,"195":740.0,"196":741.0,"197":742.0,"198":743.0,"199":744.0,"200":745.0,"201":746.0,"202":747.0,"203":748.0},"Entry":{"0":"\n\n1915\n\n","1":"\n\nFollowing on my other letters which ended with a description of my conveyance to the Egyptian capital alexandria when wounded. After becoming an inmate there I was moved out to Etaples Convalescent Hospital which was on the beach, its only redeeming feature. bathes etc which healed wounds quickly & I was very soon anxious to get back to my Battery.\n\nDay same as before. Swim in surf etc. \n","2":"\n\nTed Coleman & I went to town & \n","3":"\n\nAnother trip to town. Sent letters home packet & Corp. Coleman & I were photographed. Visited Presbyterian Mission & other places. Ended up at Cafes full of men – Bars & wines etc. Found Egyptian Gazette\n\noffice to see re Paper & to printing - amused Ted Coleman. Asked Dr (colonel) to let me out and he referred me to Colonel who asked me several questions & whether I felt quite fit & I said I would be willing to take risk on leaving he asked me if I was a regular. I felt a little flattered as hearing this from an Imperial Colonel\n","4":"\n\nCaptain Jack Fitzgerald called last evening & left note that he was back and I took an early trip in to see him also met Mr Hogdens etc.\n\nSergt Wallace Bombd Fox & ohs left for England etc\n\nWent down to Base Details Camp at 6PM with them. Here we were informed that a ship was leaving in the morning and we could go by that. I immediately went out to Zihriah Camp and said Good Bye to our Battery Drivers. Also read a batch of letters. Went to Town and got some cigarettes for to take back to our Chaps at Gaba Tepe \n\nReturned home to a desolate tent late.\n","5":"\n\nUp early & saw Ted Coleman. Recvd issue of stuff etc Packed up etc. A big crowd of irresponsibles in Details.\n\nLoaded up in motors for embarking at 9am tomorrow. We had some of the wild Australians in our motor who persisted in exclamations and noises at every one as we passed along. On arrival at wharf I was placed in charge of the Artillery Light Horse & other Details to see that they served something to replenish the inner man. I have had little varied experience as to Troopships up to now but the “Annaberg\" has beaten everything by far for dirt and other inconveniences. She was most disgraceful in every way and all the Australians were consigned to the lower decks – or I should say the lowest hold a place not fit for pigs. There was nothing to sleep on – no (I have since heard that a lot of these ships are much the same as the Annaberg)\n\nblankets – no tables for messing on. There were no life-saving appliances, or one half enough boats to save life in case of an accident. There must be at least over 1000 men on board – what with Imperial Tommies, Australians & NV’s. I never saw such a mixture of men and arrangements. No wireless or life saving boats or appliances. Dinner was issued and there was a glorious rush and scramble. Loading proceeded but about 5PM we were all ordered ashore and taken back to camp. The only explanation we got was a bomb had exploded in the coal and the bunkers were on fire. I managed to get on a motor wagon back to camp and got back quickly and met Ted Coleman who had just come down to the Detail Camp. We went into town and rather enjoyed a run around although I was fagged.\n\nMonday 14th\n\nWe recd no orders to go\n\nbut at 2PM we were fallen in again and taken in motor wagon to B “Southland\". She was a fine ship to look at but our quarters in the 3rd class were not too good. They were very hot and stuffy and I elected to stay on deck in a horse stall.\n\nA cosmopolitan place like Alexandria is full of intrigue etc.\n\nThe Southland was really named “Vaderland\" a Belgium ship and had good quarters in the 1st &","6":" class. I had a good opportunity to survey the Eastern Harbour of Alexandria which was full of craft. It was a very warm day as we left. I spent to day expecting to find we would be out at sea by morning.\n","7":"\n\nWe were still at the wharf at daybreak. Anchor was weighed about 8 o’clock. I was overjoyed to think we had at last started. It was dreadfully hot.\n\nand my spirits received a rude shock as we moved out to an anchorage off the sea wall and dropped anchor. A Parade was held at 10am & arrangements made for messing. The outlook was not too promising as it was fearfully warm – no canteen of soft drinks etc. Something seemed to be afoot as two steamers came back in the harbour that had left with troops a few days ago. The usual crop of rumours were as persistent as ever. At last at about 6 o’clock up came the anchor & we headed out to sea. A submarine guard was posted and life belts issued, and as one can imagine, it was all torpedoed talk. It was delightful to sit on deck and enjoy the brisk ocean breeze once again.\n","8":"\n\nIn was up before daybreak to bid good day to the ocean swell. I noticed our Bunk mattresses were all filled with\n\nsea grass that one see collected on any ocean beach. It seems to be a soft clean material for this purpose and no doubt it is washed before using to take any salt out.\n\nWe had a parade at 11am. Saw old 15 lber on board – Waiting for the approach of a Periscope has an element of excitement in it.\n\nSurrey Yeomanry detachment on board. \n\nIt was a cool day with a very small sea.\n","9":"\n\nI wake early to find a very cool and crisp and strong breeze blowing. We were now amongst the Islands of the Agean Sea. We passed several very high ones. The waves were lashing themselves into a white foam with the breeze but no sign was yet discovered of a submarine.\n\nFare on board was not of the best. RMLI Scott- Bradshaw, Sergt Wallace, E.L Hughes-Darfield R.D.F Morris S.W.B.\n\nIt is deliciously cool & the Southland is wonderfully steady as we steamed along on the face of a very strong wind. Passed a lot of Islands & we were still going when I retired.\n","10":"\n\nI was up before 5 o’clock just as the engines stopped and am going on deck after a bath in a tub. I found we were just outside the boom at the entrance of Murdros Harbour. After a little wait we went inside and anchored not far beyond the entrance. In the far distance we could see a large number of Cruisers etc anchored in the Harbour. I noticed the Island shores did not look as beautifully green as on the last occasion I was here. It seemed as if a winters blast had passed over leaving its lingering touch.\n\nWe have emergency rations served out and we ordered to be ready to leave for the Dardanelles at 5 o’clock. The hour came but we were still waiting and at\n\nlast found our departure was postponed till tomorrow. Alas another night on board the “Southland\"\n","11":"\n\nMustupha is a place of much concern as all wounded soldiers to their sorrow soon learn. A few weeks there and back your turn to where the bullets fly and make you squirm.\n\nScotty and I met in this place of renown. \n\nIt wasn’t all comfort or feather down. \n\nWe were there a few weeks on bread and jam and good hot tea that made you very down.\n\nNow we are off where the bullets fly \n\nand hope to meet again in the Street bye and bye.\n\nLimerick to Cecil Thomas Scott (RMLI)\n\n58 Alexandra St, Warsop, Notts.\n\nWe were all day waiting on board\n\nand as you can understand tired and impatient at the delay. At that the SS Prince Abbas came alongside our craft and we were ordered to be ready at 5PM. A number of cases were ordered to go ashore for further medical attention. One of the disgraceful incidents in connection with the Convalescent hospital. Men being returned to the front before ready or in a state of not being fit for further Service. I discussed Service Corp with a Q-M on board. I regretted I had not written home about no comforts reaching us at the front etc.\n\nThe SS Clacton also came alongside & I found she was our ship. The Prince Abbas taking some Imperial men back to their units at Gallipoli to be transferred on the Trawler Clacton at 5PM & then called at the “SS Aragon\" after which we started on our journey to Gaba Tepe. It was delightfully cool & Lemnos Island now an Island of tents of \n\nPrisoners, Hospital & soon faded to the view. I tried to sleep a little bit as we passed Cape Hellies the booming of the guns woke me and it was not long before the anchor was overboard at Gaba Tepe. The Pontoon came alongside and we loaded up and were once more under a rain of bullets although it was only about 3am.\n","12":"\n\nI was first on the landing stage and alone I met Major Griffith. I went along the beach looking at the old familiar spots & what memories it arose. The graves of some of our heroes now had crosses showing who laid beneath the inscriptions. I had with me 2-8th Battery Drivers who had come over without authority. Our guns were just in the same positions I was told – no advance and shrapnel was as much in evidence as before.\n\nI got a lot of information from Wm Hurst the first one of our Sub Lieut.\n\nI see Turks had given themselves up.\n\ntoday arranged for an armistice had given themselves up in our trenches & they were treated well to counteract any impression that they were supposed to have re getting badly used by our troops when their men were captured. It was done so as to allow them to be able to deny this on returning to their trenches & to enable them to return they were sent to gather firewood with the idea of allowing them to stray back. You can imagine our dismay when they came in with a large bundle of wood in preference to going back to their trenches.\n\nI was pleased to greet old Pals – talk of the doings of the past few weeks. It was indeed a pleasure. I saw Olly Gunderson. Our section gun which was knocked out when I was wounded had been repaired etc.\n\nI found the flies very bad\n\n& heat unbearable. Something I did not expect here. There was a great dampness everywhere & our position was getting a vast amount of earthworks on all sides. Some chocolates books & cigars I brought over were greatly appreciated by our own gun section. Hills all defaced of the lovely green hedges.\n\nMonday 21st\n\nA newspaper called Peninsular Press is now printed every day at our Base and a copy sent to each unit. At our gun the Officer reads out the news printed on the large leaflet. It contains most of the up to date military news from all quarters of the front. Yesterday it was a sort of visiting day for me for I took back cigars chocolates etc which I distributed amongst our boys. I also saw Cyril Woods – Olly Gunderson & ohs . To-day I started work but altogether I was disappointed to find that things \n\nwere very quiet. Roads had been made. Larger dugouts etc and our front was just like a Township. This waiting for me is certainly very trying. The heat and flies are very bad in comparison with when I left. Our engineers and Infantry had done a lot of sapping and making a fresh line of trenches in front etc.\n\nWent for swim on beach. Had to go in from Battery on swimming . There is a sniper doing a lot of damage along the beach. As we left our gully for the only portion we are now allowed to swim in one poor chap was shot just a few yards in front of me. Enjoyed swim and returned once more to gun pit. Our Battery does not get relieved as promised.\n\nWe have speaking tubes from one gun to another & a canteen abt to be opened I understand on \n\nthe beach. This afternoon we had a detachment of men from the Am Column to instruct and the Sergt Major & I took the instructing of them. It seems strange to be instructing gunners right on the firing line. A big bombardment took place this afternoon on to the Gaba Tepe look out. All day long there was a big bombardment over Achi bar near where the Imperial Division & French were operating & the guns beyond & boomed all day. I hoped while in Alexandria no mention was made of our artillery in the operations at Gaba Tepe. The absence of reading matter is greatly felt by us now we have not so much to do while in the gun post. The object of our gun is now await special developments & guard the infantry in case of a night attack.\n\nTuesday 22nd \n\nMet young Burns and also A.S. Office Boy. I forget his name. It was quiet last night except a little splash about 11PM. to-day it is a little cool. Saw Col Rosenthal. Our aeroplane was up today and the Turks had a number of shots at it and also at the Trawlers anchored out off the shore. I am told by all those who saw the Triumph sink that it was a great sight. I missed this while at Alexandria wounded. I read a report on the fight at Achi Baba for 3 days in which our boys & NZ and the Imperial Division figured so bravely. It was a splendid spectacle.\n\nTo-day unfortunately I had to take charge of the prisoners to see they did fatigues.\n\nWednesday 23rd\n\nHad a lovely swim in the moonlight last evening. It was \n\nsimply delightful. There was a bit of shooting at our gun pit early in the evening. To-day I am in charge of guard over Prisoners. Not a pleasant piece of work. The guard has the worst part of it having to stand out in the sun etc and see they do their work.\n\nI have never seen such persistent flies as these Turkish breed. They settle in your bread and jam on your tea dixie mess tin & stick like lice.\n\nIt is wonderful how callous one is now to the flying bullets & the splashing shrapnel.\n\nThe strapping of our prisoners to the wheel was not a very enviable piece of work.\n\nTwo female mules belonging to some Turkish farmer wandered round behind our firing line & seemed perfectly at home. The part round our Battery cook house seemed a very attractive to them.\n\n \n\nAn incident which was very amusing occurred in a gun pit. One gunner on duty was showing some Infantry men. A Sergt ordered another the mechanism of the gun & how it was fired. It had a shell in it & the Sergeant pulled the firing lever to see how it worked. The gun went off and gave the Infantry men an awful big fright knocking them over off the seat. They just fled away. An enquiry into the matter resulted in a reprimand to our Gunner.\n\nThursday 24th\n\nIt is strange to see the many different styles of dress adapted by our lads. You see them all over the ridges and our firing line now in short britches. Some showing the poor tailoring efforts in shortening the long ones. Others turned their trousers inside out to stop the vermin breeding. A few were found in rather amateurish style. Some resorted to freakish hats and caps and other Deshabble uniforms. It is also peculiar to see a smiling through a bunch of whiskers. Every one I ever meet is letting nature take its course. I did so until I got to Alexandria\n\nwhen wounded. I must have been somewhat like the wild man from Borneo judging from the reflection of my appearance in the looking glass. I had it all removed except my moustache. This morning broke with a hot fusilade of shelling. I was up early and went down the ridge below where we had our guard room pit. It was lovely and cool & the cooing of the doves was the only music to greet me until the guns burst out to spoil the strains of nature.\n\nThere are many funny names given to the different parts of our field of battle. Between the beach & the firing line is Shrapnel Gully – a place very appropriately named owing to the amount that the enemy sent to that spot. Casualty Corner is another spot on the beach and which you must hurry as a Turkish sniper on a far ridge gives you a taste of his bullets.\n\nAnzac Cove where nearly all our landing takes place now should be a celebrated spot in the future and no doubt looks or other Tourists will\n\n Anzac is Australian New Z Army Corp\n\nadvertise trips to this celebrated immortalised place. Up on the ridge near our gun is a pretty knoll where a number of Queenslanders \nare buried\n who so bravely bled for their Empire now before resting. The graves have been decorated with crosses and stones by Qld Pioneers of the 9th Battalion. I noticed names on the crosses of Corp Baldie , Pvtes E. Bird, E. Booth, , D. Hall Pv E Taylor (9 May same day as me L Corp Davton, Corp Pentecost, Priv A, EL Gilmore, , Clarke, Barlow, Stevenson, Mc Jeffereys, Haig and . One felt thrilled as you gazed upon the last resting places of our hereos \n I’m looking out across the green fields from our gun pit\n It was a charming sight to look out upon from our gun pit. The fields nearby are still lovely and green as when I left and bathed in the brilliant sunshine with the dazzling colors of the world\n\nmade the landscape a charming picture. could enjoy it best early morning or at sundown when there was not the piercing shriek of the shell or the of the bullets to break the harmony of the picture or ones thoughts occasionally had a lull. The ground between our trenches and the beach was not of course like pictures taken. There had been too many Australian Kangaroos from the shouts and treading over the green \n\nThe enemys shells came crashing and raised sods of dirt to a terrific height. They fell at regular intervals – a kind of malignant aberation seemed to characterise their efforts. The shrieking shells are hardly us with some of the lovely sunsets seen every day here from our \n\nhigh ridge. His Majesty sets in all his fiery splendour just on the edge of a high island in the Agean Sea and there is nearly always a strata of cloud overhanging the island and the effect is glorious. This island is a good height out of the water but does not appear to change. It is North of Embros Island. The setting sun as he kisses the sparkling ocean throws rays of lovely tinted hues for miles and the clouds are also very finely illuminated with a similar effect.\n\nOn Hill – Graves of Privates Barnwell Carrick & Sewell, Burton, Wilson, Byrne Gonski,\n\nI do’nt know if I referred before in my letters to an operation we call “chatting the Enemy\" every day almost all of us have a chat but it’s never a chat in the sense that the \n\nword conveys but it means to convey that we were just cleaning the vermin off our shirts & clothes. I had heard of these things in connection with serving in wars but its very simple to have these parasites on one under the conditions we have got to live in. Not getting a chance to change or wash clothes living such an animal life. Are you “chatty\" – is a well known question on all sides.\n\nChathams Post, Boulder Dump, Hell’s Spit, Quinn’s Post – Pope’s Hill other names\n\nBeach Bill the name of the gun - as we call it that fires along the beach and gets many victims. The 9th Battery and premature bursts. Several men killed.\n\nThe mules and the Indian men are still doing splendid work carrying stores up the ridges. Nearly all this work is done at night. I had another \n\nswim in the moonlight last evening and there must have been at least 4000 ducking about. Very little swimming is now done in the day as there had been too many casualties.\n\nFriday 25th June \n\nCorp Coleman & Lieut Hodgens returned to-day. A Cruiser came over to-day & fired a few broadsides into part of hill no 2. She was surrounded by Torpedo Destroyers to protect her from Submarines.\n\nCorp A Hurly Pvte A Ball, H Tyrrell on beach 9th Battalion\n\nIn went along beach at sunset and one gun of the enemys called Ab Dullah sent several shells towards the landing beach. It was intensely funny to see the scatter of the swimmers. I fled also I can tell you and had to hop in an old\n\nunused dug out for about 15 mins. Shells burst all around our hiding place and a few shrapnel pellets fell into the dug-out but luckily did not hit me. It’s not too comfortable to be alone in these circumstances as you might get badly hit and get no help. I walked along and saw Major Griffith and on returning along the beach I had a dip as it was then dusk and the moon was shining beautifully on the rippling water. \n\nSaturday 26th \n\nIt is strange the effect a bit of “nerves\" has on some: you can see many men almost physical wrecks of their former selves. Of course there has been complete breakdowns & the men have had to go out for a rest. Last night we opened fire on the Turks and there was a movement of our infantry synchronal with this on the left flank.\n\nSince I returned to gun pit and trench life I find there is not so much stooping required as while away most of these places have been deepened. It is still a very underground army life. Sitting and sleeping about in the deep dug out places. The only redeeming features being a swim after dark, reading off our Peninsula Press News and what magazines we can get hold of. Although we had to be always available to our gun in case of firing there was many fatigue duties digging or erecting latrines cleaning up etc. Sir Ian Hamilton and Staff came around to our gun pit to-day and had a short talk in the pit.\n\nSunday 27th\n\nAt day-break the enemy gave us a warm fusilade of shell. Those\n\nthat happened to be resting were rather unceremoniously wakened. It was a thrilling spectacle to see the explosion of the shells everywhere and to hear the rattle of the rifles all along the trench line. Several came over us and we got a shower of shrapnel in our pit. Luckily no one was hit. The attack lulled when the sun was high in the heavens. \n\nThere are many pathetic sights in our everyday life, and when one passes the casualty station there is often one of our brave hereos laid out for his last resting place. In places there will be a small gathering of men placing all that remains mortal of another away below or perhaps there will be a stretcher bearing away a wounded comrade from the firing line to the dressing Station.\n\nA Proclamation dropped by a Turkish Aeroplane was sent round in\n\n \n\nthe orders to-day. It was rather amusing and contained a lot of news to the effect that all our ships had now deserted us and it meant utter perdition for us as we would be unable to get stores water etc. We were called upon to surrender to avoid further bloodshed and the proclamation assured us we would get well treated.\n\nIt is needless to say that we treated the invitation with derision. \n\nI have said before that this war life is an animal one – it’s not only the killing part but living like rats in holes often one comes to consider it is wonderful the patience shown by our lads in staying un under the existing conditions. You can well understand that a number are chafing under the confinement and want to make a forward attack movement no matter what the sacrifice might be but of course that is impossible just now until the Imperial Forces link up \n\nfrom Achi Baba. Some of the enemy’s shells on the beach caught a number of victims this afternoon. A few were horribly mutilated.\n\nMonday 28th \n\nI do not think I mentioned before that we now get fresh bread every 2nd or 3rd day. It is baked over at Imbros Island and sent across. Imbros Isl is only a few miles away and you can see it well from our firing line & I can assure you it ids greatly appreciated. Last evening Corp Coleman & I went for water but alas were dissappd as all that could be obtained was brackish owing a hole having been made buy a shell in the pontoon while coming in. On returning we had a moonlit swim. The moon rose a bit late and its silvery face smiled over the ridge above the beach just as we entered the water. It was charming to see the streams of silvery light reflected over the rippling ocean swell.\n\nLieut Archie Raymondo is now posted to our Battery and looks well. He was previously acting as transport officer. Lieut Richards is officer in charge of one of our guns – a real good sort. Capt Crisp of the 9th Battery was transferred to gun Battery in place of Capt Leslie dead. Lieut Urquhart has gone back to Alexandria – a wreck – enough said. Lieut Hodgens has come over from Alexandria & Lieut Ross is still at No 3 gun. Our Major (Gus Hughes) is not well and looks as if he wants a good rest from his responsibilities. Sergt Major Handsford is still the same old customer.\n\nCapt Dr Marks is much thinner than when we left Mena.\n\nWeary Willie the name we call one of the guns of the enemy commenced to shell the beach again to-day. The shells have a weary kind of shrieking sound – hence the name\n\napplied to the gun. Gunner Freddy King was wounded slightly yesterday afternoon.\n\nAt 11am a determined attack was made by the Imperial Division on Achi Baba. We had instructions to stand by in case we should have to prevent any reinforcements attempting to reach the enemy forces there. As I write there is the continual boom boom of heavy guns and flashes all over the far slopes. There are a number of the Australian and NZ forces helping the British Imperial men there and in other attacks on the same position. Their behaviour is spoken of in the highest of terms of all the British Leaders.\n\nIn the afternoon we received instructions to engage the Turks at our end so it would prevent them from sending any reinforcements along towards Achi Baba. Several parties went out – one on our right flank\n\nand one on gun ridge. The latter one was comprised of our Qld 9th Battalion and the Qld 5th Light Horse. They did some splendid and brave work but suffered badly. A number to the extent of 30 inj one of the","13":" boy’s was missing. Amongst the killed was Corp Hunter who I had come into contact with while the","14":" was on duty near our gun pit. Dingley a very fine dark chap was another who fell. I understand the object that was desired by the generals was achieved and the Turkish Artillery replied to our guns with an unceasing fire till sundown. We did a little of what the wily Turk had been doing at Gaba Tepe – and that what to fire about a dozen shells and run the gun out of our own pit into a deep roadway cut into the ridge. They sent about ½ a dozen shells right into the pit but fortunately \n\n(Captain Bean the official correspondent of the Aus Papers was in the trench near our gun & took a snap of us at work)\n\nwe had the gun clear by then. After a short interval we ran the gun back and started firing. This was done several times and was most successful and as we are situated it is really the only thing we can do as our gun while in the pit is right in the open and a most conspicuous target to the enemy who know the range to a yard. As I said before having guns on the firing line is unprecedented in any modern warfare and artillery is supposed to be always under cover and able to change its position. It was quite like old time for me to get back on to the firing lever. \n\nWe heard that good progress had been made by our forces at Achi Baba and we had to keep the enemy busy during the night to allow them to dig in and get cover after their advancement. \n\nA sham attack was planned and all along the line cheers were \n\nloudly sounded, brilliant start shells were fired off lighting up the ridges and to give the Turks an idea we were advancing. For some reason or other the Turks lit fires near their quarters and whether it was to show up our men if they came one could not tell.\n","15":"\n\nThis morning our Turkish friends could be seen working near the old Balkan Trenches (Some of which were used in the Balkan War) and are not far from our firing line. Old Pip-Squeak – a gun off gun ridge sends a few shells over every morning to our lines. All you hear is a Pip noise then a squeakish sound – hence its name.\n\nSaw Harry Tiddy to-day & young Lieut Chambers. It is remarkable when one considers the savage unscrupulous \n\nthe Germans are displaying in this great war. It seems now to speak of the wild beast at bay. To secure a quick decision he suffocates his opponents with poison gas. He endeavours to terrorise and unnerve us by dropping incendiary bombs amongst our inofensive civilian population of England. He resorts to all kinds dastardly outrages to secure the end he seeks.\n\nFrom our gun pit outlook the orders of several of our men who fell yesterday can be seen on a far ridge in the deep of death. Some bodies were secured last night and as I went down from our pit after 10pm I saw them laying them away in their last resting place.\n\nWithin our battle field some have telephones water pipes and other conveniences are being added every week. The advance made by our\n\nTroops at Achi Baba is described as splendid and even better than had been hoped for.\n","16":" \n\nLast night it was very windy dusty & rain threatened and the Turks took advantage to make a small attack. I think what chivied them up was the fact that we had sent out several patrol parties to bring in the \ndead\n comrades who fell in the attack made on Monday last.\n\nTo-day was quiet and in the evening we had a thunderstorm accompanied by heavy rain. This is the first storm I have experienced since leaving Qld in Sept last and it brought back memories as you can understand. Most of us sat up wrapped in oil sheets while the storm lasted.\n","17":"\n\nThis morning our aeroplane while making a reconnaissance was \n\nsubjected to a fusilade of shell.\n\nLast night the news came that the Turks were moving Nor’ East and very likely could come over to attack us. What was expected though did not occur. It was a rather anxious on watch and my time fell at 3am in the morning. \n\nIn orders today it was specially mentioned about the great work done by the 29th Division assisted by our Aus and NZ Forces. Mention was also made of an attack made by the Turks on our left Flank on Wednesday evening and the heavy losses we had inflicted on them. Some prisoners captured on this occasion stated the Enver Pasha was in their trenches on the night of the attack and had given them orders to advance as they were assisted by several new battalions. After this attack hundreds of their dead could be seen laying off our trenches.\n","18":"\n\n \n\nFrom our trench we could see large numbers of Turks moving from Achi Baba. Matters seem quieter in that direction and it was also somewhat similar with us.\n\nThe Prisoners taken and also several who surrendered at various times all speak in the highest terms of the accuracy of our fire and its disastrous effect on their forces.\n\nOne of the shells that recently landed in one of our gun pits was a high explosive one made up of small thick pieces with a thin coating of shell over them. On bursting all of the pieces scatter all over the place – a very different effect for our 18 lbder is shrapnel which contains 375 lead bullets and all have a forward direction on the burst. They have used a quantity of 12 & 15 lbder shrapnel shells against us.\n\nI have always understood officers were not entitled to servants once they \n\nwere in the firing line. I am rather confused to see our officers have set aside a special Day Out where they have an Officers Mess and all their Batmen wait on them – in fact this is all their servants do. They are exempted from all fatigue and other duties and just fetch and carry for their Officers – a thing I can hardly understand when one is fighting. In camp life there was a certain amount of excuse but why officers are provided with a servant by the Authorities when they are paid well is beyond my comprehension.\n\nSome days the weather is splendid here – Not a cloud anywhere to break the beautiful blue and the sun shining with a pleasant warmth. Every now and then there was just a caress from a gentle zephyr out of the sweet South blowing – in fact what one might term it was peerless spring weather. Of\n\ncourse we had some atrocious hot days with millions of flies to add further to the inconvenience of the heat. \n\nOur Howitzers had a series of shots into some trenches of the enemy today and we had our gun and one other trained on to open fire. We did not fire but the enemy shelled us and killed one of our gunners named Driver. He was a fine little chap. About a week ago another of our lads named Bombardier McFarlane was shot by a machine gun. When he left for the Hospital Ship he was not expected to live. I am not sure if I mentioned before about the net-work of trenches in front of our gun by the Turks. Everywhere as far as the eye can see loopholes for attacking us can be observed. \n\nAt 10PM we fired several shots over into the Turks trenches and then withdrew our gun from the Pit. Star \n\nAll that he had he gave\n\nHis joy of life is youth\n\nTo Battle for the truth \n\nAll that he has - this grave\n\nshells were also fired but the object in trying to draw fire was not attained as the impossible and unspeakable Turk did not reply – Young Driver was buried around 11 PM.\n","19":"\n\nIt was a bit damp late last night and still looks like rain this morning.\n\nIn connection with recent attack made by us on the Turks I understand one member of the 9th Battalion (Qld) was to be recommended for his bravery in carrying 5 wounded men from near the Turkish trenches back to our firing line under heavy fire.\n\nWe were shelled again this morning & lost a fine chap in Gunner Manning. He was speaking to another chap at the time & this man was only wounded in the nose.\n","20":" \n\nTo-day I attended an open air church service at the back of our firing line. The Padre was a Presbyterian Chaplain attached to the 7th Light Horse. He spoke finely and gave an address from the text relating to Esther’s life especially relating to her decision to attempt to save her people by an \n\nappeal to the King and when she said “If I perish I perish.\"\n\nOur major (Gus Hughes) went away to-day for a spell. He had not been well for some weeks and thoroughly deserved a change after the strenuous and responsible work since he landed here. We all think so highly of him.\n\nThe Turkish Summer days are now returning and one enjoys a Twilight which we Australians have certainly not been used to in the tropical regions. It makes a long day.\n\nThere was a rumour to-day that several transports had been sunk at Cape Helles by submarines. Several Prisoners were captured by a Patrol of our men to-day.\n","21":"\n\nIt was a quiet night last evening but the Turks made up for it this morning, as they commenced to\n\nshell us from all quarters for about an hour starting as early as 4am. A very big gun opened fire on us later and landed large shells towards the beach.\n\nWar is going to make old men of a lot of our lads.\n\nOur infantry has done a lot of sapping tunneling underground from one trench and coming out on another ridge where further trenches are cut when out of view of the enemy. It is hard and tedious work as all the earth out of the tunnel has to be carried out and to the back of the firing line in small bags. In this way we are often all able to sap up to the enemys trenches and blow them up – often men and all – just as they would do to us.\n","22":" \n\nTo-day I was warned that I would be temporarily transferred to another gun in our Battery now in command of Lieut Hodgens. \n\nSpoke to Capt Keith Miller Chaplain","23":" L Horse.\n\nWednesday 7th July\\A quiet morning. Weather still hot and flies as bad as ever.\n\nJust a bit of Prose I put together to-day.\n\nAustralian Boys rough rugged and true\n\nTo their Empire call they bravely came\n\nAdding from to the grand old day\n\n veterans renowned whom we all \n\nWere never beaten in the ages long ago\n\nAway sailed our boys in Khaki so great\n\nFor Earths Sunny clime across the mighty deep\n\nThey trained for months with every satisfaction\n\nWhere it seldom rains and the \n\nAmid the scorching sandy desert plains\n\nOrders to move were hailed with delight\n\nHurrah Hurrah They cried with all their might.\n\nIt meant farewell to the desert plains\n\nThe heat, the flies and other pests\n\nTo put our boys to a more serious test\n\nThe assault was made before the break of day\n\nBut many difficulties turned their way\n\nAnd not a man did flinch that fight\n\nBut charged the enemy till put to flight\n\nWe said well done – They were heroes every one\n\nIn the years to come history will tell\n\nOf the great charge and how the brave Australian fell\n\nAnd as we ponder a deep prayer we breathe\n\nFor the many heroes who now lay a-sleep\n\nIn a place well known as Gaba-Tepe (Teep)\n","24":"\n\nI was on duty between 2am -3am this morning. Very lonely and plenty of bullets coming over and on our gun pit. At noon we opened fire on the enemy on to some gun pits. It some demoralised them and\n\nthey did not return much fire. At 6 PM we were again to open fire but the enemy anticipated us and we had to withdraw our gun. We are now playing the enemy at his own game as he treated us when they had guns at Gaba Tepe\n","25":"\n\nThamothrace Island near Embros. This morning I was temporarily attached to another gun as there was only one N.C.O. there. I spent some time in making a comfortable Dug out which faced out to sea. It was a delightful outlook from the side of the ridge. We were to draw fire at 5 P.M. from our gun if any target appeared. Unfortunately no opportunity was given to us by the enemy. A 6 inch Howitzer just near us fired several shots and as the concussion is fairly strong we were advised to lay low. I managed to get down the \n\nridge to my dug out but my knee gave and I had to be carried up to Dr Marks who tried to get the muscle back. He succeeded in relieving it a little and I was take back to rest for the evening.\n","26":"\n\nMy knee was right again to-day & at about 5PM I went down to the beach and had a dip. It was lovely I gathered a few pods of yellow Brown flowers.\n\nIf any one ever suggests Bully Beef & Biscuits to me or stew when I get back it will be as much as their life is worth. I have tummy aches every day etc. Of course it might be the water that was responsible for it.\n\nWe fired a few rounds in the afternoon to register the distance of certain targets. One of our Cruisers sent in a fusilade of shells on to where the Turks are putting guns. The snipers got a few\n\n \n\nvictims to-day. My knee is alright now.\n","27":"\n\nYou should see enormous fountains of dust smoke, fragments and blocks of earth as the big guns of the Cruisers further bombarded part of the enemy’s trenches. Every day we are subjected to shells & a rain of bullets.\n\nWent along to Headquarters on beach to see Olly Gunderson who is now working at stores. Had a long talk. Saw one of the large shells which the Turks fired some days ago. It was 11 inches across base and the thickness of the outside to the hollow in center was 3 inches. A tremendous lump of steel. My throat is not too good.\n","28":"\n\nWe bombarded the enemy’s position this morning early\n\nand in return received a lot of shelling. Several Light-Horse men were killed.\n","29":" \n\nTobacco issue day. Fairly quiet except towards evening when the firing line was very busy as the Turks tried to creep up on our trenches. I was transferred back to my old gun and shifted up. Olly Gunderson visited me.\n","30":"\n\nNot too good – no appetite\n\nMentioned in despatches in connection with work done early in our operations . Myself and a few others of our","31":" Battery. Last night there was plenty of rifle fire.\n\nThursday 25th July\n\nFeel better today. Quiet up till sundown. I wrote a number of one page letters while at Gaba Tepe and these were all done while the shells thundered & the bullets pinged on all sides. Of course you would all have heard\n\nof the casualties on the Turkish sides. Every day we have men wounded.\n","32":"\n\nFresh meat for breakfast. How delightful it was and what a break in the monotony of our daily fare. I noticed that the Light Horse Brigades were getting Travelling Kitchens from funds collected in Brisbane and I thought that we should have one for our 7th Battery – and wrote home to that effect.\n\nEach day to fill in moments when not reading or shelling the unspeakable Turks there were many odd jobs we did such as etc. We always kept ourselves shaved even while bullets or shells played merrily over the dug outs and trenches. We got an issue of English War notes to-day. Small pieces of paper which hardly looked genuine\n","33":"\n\nI spent a bad night last evening. Fearful stomach Pains. Had little or no\n\nsleep till early morn. Very early our officer Mjr P.J. Ross with Howarth & Matt & ohs left for Imbros Isld for a short spell. So far I am left in charge of the gun & detachment. I was inoculated yesterday for cholera epidemic. \n\nA German Taube dropped several bombs over our camp this evening. Luckily one of them did not explode. The one dropped on the beach exploded without incurring any casualties.\n","34":"\n\nA quiet day. Bought a tin of Nestles milk today for 2\/-. Some of the soldiers bring over a packages of goods in their trips and can get anything they ask for them almost. Fancy 2\/6 a packet for envelopes.\n","35":"\n\nHarvey Turton arrived. Of course it meant plenty of chats about our drivers at Alexandria etc.\n\nI must say candidly my health & the weakness which came on me has interfered greatly with my nerve just now. One requires perfect health to be in good fighting trim. \n","36":"\n\nA quiet day. Last night we altered our gun pit considerably a lot of digging etc. We took a vote of 3 out of those names who were mentioned in Despatches to have their name submitted etc. The enemy shelled us for about ½ an hour late in afternoon. I heard of one victoria they got in the L Horse.\n","37":"\n\nLast night the Turks gave us a lot of severe rifle fire. It is a bit cooler to-day. In orders we heard that the enemy intended to make a big attack shortly.\n","38":"\n\nThose who went to Embros Isld returned to-day. Everything was made ready in the morning in case of an attack. It is expected that the attack will be made to celebrate the Turkish Constitution Day which is to-morrow. We set fire to all the bush in front of our lines so as to prevent the Turks creeping up on us. \n\nI was not feeling at all well to-day. We had a change of officers Lieut Garling taking the place of Mjr P.J. Ross.\n","39":" \n\nFelt a bit better to-day but still not up to the usual. We had to keep a good look out yet as attack still expected. It was quiet all day. Turks fired a few shells in the evening late for the first time.\n","40":"\n\nGeneral Birdwood came round on inspection. I was further inoculated to-day for cholera. All day long I had diarrohea pains cooked bread & milk to make a change. Condensed milk used & it proved a great change. We got some flour issued and I made a few chapatties (Pancakes) fixed up in fat. I mixed the flour up in condensed milk and water and when finished ate them with jam.\n\nAs I managed to get hold of several tins of condensed milk from those who came from Embros Isld I make a little bread and \n\nsop in the mornings. I got one tin of Nestles cream and this I whipped and ate with apricot jam which happened to be in large pieces like preserves. I never enjoyed anything so much before.\n\nA little warm to-day. Although we love our Battery Cooks who dish up food and it is sent up to our different gun detachments we are always experimenting with small dainties. We have to do this or we go very hungry. Pancakes, Bread and milk scores of broken biscuits, fat sugar etc welsh rabbit made of cheese etc are amongst the new varieties. We have had a lot of dissatisfaction over the Battery cooking as the open oven cooking does not allow of much variety in large dishes. I have for this reason endeavoured to get my friends in Qld to secure funds to purchase a Travelling Kitchen. I was in charge of aeroplane signalling party. The aeroplane circled overhead to direct fire and are sent \n\nthe message by means of large cloth letters on the ground. The aeroplane is fitted with wireless and can send messages but cannot receive. The old Donkey foaled a few days ago. The little one is such a darling black little thing. The other one died or I should say we had him shot as his wounds were too bad to allow the poor thing to foal.\n","41":"\n\nA fairly quiet day a little shelling. We are rather resenting the intrusion of foreigners in our Battery.\n\nThe","42":" is well known as the fatigue Battery etc.\n\nOur detachment & one of the detachments had been mentioned in Divisional Despatches on account of special works done under fire early in May last. Headquarters had requested the names of 3 of the number for some reason & a vote was taken and resulting in Corp Coleman from our Gun & Bomb Macfarlane & Baynes from the other gun being chosen.\n","43":"\n\nYesterday afternoon the enemy gave us taste of big shell fire. Things were a bit lively for some time but fortunately little damage was done. I went for a swim late in the evening. The nights are lovely and moonlight just now. A beautiful full moon. I was on watch late last night and left alone with my thoughts broken only by the crack of a rifle here and there or the staccato stutter of a machine gun. I looked back for all that had passed since I participated in this great warfare. One could not help feeling sad as one dwelt on the loss of so many fine lads as I had seen removed from our ranks on all sides. This present waiting game of ours has very little glory in it and we all feel impatient to attack the unspeakable Turks or be attacked by them. Our existence here is getting indescribably dreary.\n\nI think I have mentioned before that from the beach up (Anzac Cove) there\n\nare huge ridges covered with undergrowth and small shrubs. Just now the lingering touch of Summer has removed all signs of the many wild flowers which months ago were intertwined amongst the greenery. From the ridge where our trenches are you look out on to country of somewhat similar formation and beyond that there is that piece of landscape and then a huge hill acts as the horizon of our zone. To the right stretches Achi Baba and the Gaba Tepe outlook. In between the flats are covered with long grass on which goats and cattle can be noticed grazing. In places there are patches of trees and one long grove known as the “Olive Grove\" which occasions us a great deal of trouble as it provides a good hiding ground for guns. \n\nI do not think I mentioned that while digging outside our gun pit in view of the enemy’s position the other evening we\n\n \n\ndisturbed the remains of some poor unfortunate Turk or one of our own Boys. This gave us Horror after Horror.\n\nEarly this morning Lieut. Thorn was killed while in charge of the machine gun of the 7th Light Horse.\n\nThis evening I went over to headquarters and saw Major Griffith and had a chat. He with almost all others are suffering the effects of Diarhea pains etc. Saw Olly G at Engineers Stores & arranged to secure eggs, milk etc On the way back I had a good swim. The moon was lovely. It was at the full and the strong light had robbed even the planets of their lustre. The smaller stars were not visible at all & the sky formed of its dark color, curved overhead, pearly hued and luminous\n","44":"\n\nA fairly quiet day.\n","45":"\n\nI cooked some eggs this morning. These are what was secured by Olly on the cheap from one of the men who managed to get them across from Embros Isld. There they are 1\/- a dozen but we have to pay 2\/6\n\nhere. Milk obtained there for 1\/- costs from the illicit traders 2\/-. The authorities are greatly to blame for not having established a Canteen where these articles could be purchased. Surely it cannot be said that our rations are sufficient – the other day we had tea for breakfast & 10 eggs between 13 men. At dinner rice with a few prunes in it and then cheese & tea for tea. This with biscuits constituted our days rations. The rice & prunes & eggs are a substitute in lieu of jam & bacon which we usually have issued. This goes on day after day etc.\n","46":"\n\nWent for water on beach. Long wait. Absurd rules could not secure before 7am. Lovely swim at dusk and coming back up ridge a fuze of one of the enemy’s bombs fell at my feet. Another one of the many miraculous escapes. The enemy sent up aeroplanes early morning for the last few days and dropped bombs on \n\nour camp. We had many anxious moments waiting till he passed over.\n","47":"\n\n had another experience today. I was sitting down slowly in my dug out near our gun and swish bang a shell lands just above me on the bank of the dug out. A tremendous amount of smoke dust and dirt was lying on all sides and I was on my feet and really had to fight my way out to clearer air. It was wonderful that I escaped without being wounded or buried. Gunner Hurst who sleeps below me fortunately was away otherwise he would have certainly been buried.\n\nThe Turkish aeroplane which flew over our quarters this morning dropped darts as well as bombing. \n\nFrom our lookout over the Turkish countryside other new long trains of camels which seem to be largely used as a\n\nmeans of transport. Speaking about camels reminds me of a criticism I read one time of these animals. It was something to the effect that camels on sunlit sand – and at a respectable distance are I think always decorative. From an artistic point of view it is always advisable to keep them there – namely on sand and at a distance because nearness to the workaday camel quite takes the enchantment from the view of him. To begin with he is mangy from his deck to his splay feet and out of every ten square inches that ought to be covered with hair he wears nine square inches . He emits evil noises and an evil smell. When he bites - which he does with his lips, not teeth – the effect is very much the same as having one’s finger slammed into the hinge side of a railway carriage door. He is as ungrateful as a Greek and as trecherous as a Turk. A horse will not drink after him; sheep avoid the pasture he has fouled and even a Jackal will not eat him when he is dead\n\nif there is other carrion within reach. You know we’ve seen so much of the poor camel since our stay in Egypt and now he intrudes himself before our eyes in the eyes .\n\nThis evening we made an attack on the Turkish trenches and several were captured. All the plans were carefully laid and our infantry cheered as they charged the enemy’s position. Our part in the scheme was to bombard a certain part of the right flank trenches of the Turks and we commenced to open fire about 10 PM. Our guns pounded forth and the enemy replied to us shot after shot. Fortunately for us all their shells went high but they made it warm. Of course we fired indirect and had all our angles laid out on to a light and in this way we could engage certain places of the enemy lines at night. The moon shone out about 1am but we still pounded on \n\ntill 3am when the fire gradually eased down. Outside of a jam of our breach and the siege lamps not giving satisfaction our arrangements went well. Several big mines were fired by our Engineers at the commencement of the action and the report of the explosion was tremendous. We heard that a number of Turks were buried beneath the fall of earth where the mines were fired.\n","48":"\n\nThis morning we had a fair idea of the casualties of the engagement and on our side about 20 were killed & 80 wounded. In our own unit we were fortunate and escaped without a loss. How the enemy fared we could not say to any definite extent but their losses must have been considerable. We expected to have a big counter attack this morning but it was a quiet \n\nsabbath morn after such an angry night. The screaming of shells and the crack crack of rifle fire made a perfect pandemonium. You could not hear yourself speak.\n\nWe had to keep a very careful watch in the evening as we expected our Turkish enemy to attack in reply to the previous evening’s incident. The expected did not happen.\n","49":"\n\nIt was fairly warm today but quiet. Col Hubert Harris who was killed on the evening of the attack on the Turkish position was buried last night. Col Harris who was attached to the 5th Light Horse was well known in Brisbane. The Turkish aeroplane circled above our trenches to-day and there was a rush for cover when several bombs were dropped. Luckily they did no damage.\n","50":"\n\nWent for fresh water at Headquarters today. Had a delightful swim. In the evening there was a small demonstration by our Infantry. A few mines were fired and the idea was to attract the attention of the enemy while some other troops were landed here, included Gurkas British Tommies and about 1000 more Australians. Just now there is a persistent rumour that we are to be relived especially those who have been in the firing line during the past 3 months. You can quite understand the strain is telling and our ranks have been greatly depleted owing to sickness and casualties.\n","51":"\n\nI do not know whether it was the effect of the pancakes I ate last night or the want of something substantial that made me enter the land of dreams. I was amidst the smell of the East and the noises and the domes of its mosques – the hot sun\n\nthe rabble in its streets. I dreamt of Port Said and the waterway of the Canal and the song of the Arabs coaling the ship was in my ears and so loud that I could see them as they went at night time up and down the planks between the barges and the ship’s deck an endless chain of naked figures monotonously chanting. It was a rude awakening when a large shell from the enemy’s gun went overhead and exploded near us. A large number of troops landed last evening mostly South Wales Borderers.\n","52":"\n\nFelt very bad today. Stomach and head trouble. Every preparation is being for an advance. Instructions as to water bottles and rations. Everyone to have a distinguishing marks of white cloth on back and arm. The enemy seemed to have an idea that troops were landing last night and they put a good many shells \n\ntowards the beach and only one of them did any damages and it got 7 victims – all killed.\n","53":"\n\nWe had a rather rude awakening early this morning. The Turks opened with heavy fire and attempted to retake the trench at Tasmania Post. There was a tremendous heavy bombardment and incessant rifle fire from 4am till about 8 o’clock\n\nWe engaged one of the enemy’s guns and have an artillery duel. Unfortunately our gun pit Embrasure fell in and put us out of action. I was temporarily out of action as I had not recovered from my indisposition and had to look on. I feel very much broken up or down in health which ever one might term it. We had the first batch of casualties at our gun this morning. A fine little chap named Wm Hurst was shot in the lungs and died in a few minutes. We buried him just before sundown.\n\n \n\nAll day long our detachment worked very hard to square up the gun pit and final arrangements were made for the coming attack. A message was read to us from General Birdwood as to the duty of every man and that he was sure al, Australians and New Zealanders would maintain the splendid reputation of their past actions at Gaba Tepe. From what we could ascertain the Division of Troops landed during the last few days were to push ahead on the left flank and all along the line there would be a general advance heavy fighting. Every man had to wear a distinguishing mark of a white band on each arm and a square patch on the back so that our own men could easily be distinguished in any operations during the evening. Those markings we put on at 4 PM and about 5 o’clock the battle commenced.\n\nOur gun fired nearly 200 shells before midnight and put in splendid work. I felt very miserable not feeling very well and did not appreciate the excitement attending the manoeuvres. My head was splitting. After a few hours of the commencement of the fight word came through that our infantry had taken a number of trenches on Lone Pine Ridge. It was magnificent I was told by an eye witness to see our lads charging the enemy’s trenches and clearing the Turks. They were supported by the Tommies who also leaped over the trenches and joined in the great charge. Our gun was fired intermittently during the night. At daybreak (of","54":" things were quieter and well down below our landing Base of Anzac could be seen a number of Troopships and Cruisers and from the former thousands of Troops were being landed. No sooner on shore than they pushed ahead\n\nin companies to take part in the charge being made on the left.\n\nThe Cruisers were pouring shell fire well over to cover the advance of our men and as can be naturally expected the Turks were sending plenty of shrapnel towards the shore. Where I was looking from of course one could not tell the effect of the shooting. Altogether it was a most telling time.\n\nSaturday 7th Audust \n\nThe battle still continues in full force. It is a delightful day in every way as far as weather is concerned. On every side shot and shell are flying in thick profusion. We had another sad duty to perform to-day and that was to bury our sergeant major who was killed while on duty \n\nlast night. The news today told that our infantry were advancing to take Hill 961 . The casualties on our side are expected to be very and from an account I heard up to 2PM there were quite 2000 killed and wounded. Of course it is almost impossible to estimate the enemy’s losses but we are told that they are terribly heavy. As we attacked we suffered the disadvantage naturally. To-day owing to the death of our Sergt Major one of the sergeants was appointed temporarily to the vacancy and as he was himself and as he was himself holding the Quarter Sergeant’s position our Captain asked me to take over these duties temporarily. I consented to do so and I am now the 7th Battery’s Quarter master’s Sergeant and have many duties to carry out including the victualling and clothing of all our men here. It calls for a good deal of risk in going about in\n\nthe open – even more apparent than doing duty on the gun.\n\nIn the evening I went along to Headquarters and secured what goods I could and of course all Q-M’s as we are generally called tell fibs to get extras for their units and I made my initial bow as one of these special kind of animals. On the way back on the beach I had a dip in the briny and it was rather lonesome as I was entirely on my own having sent my forage party on to the stores near our Battery.\n\nMy quarters are in the store which hardly deserves that name except for the reason that it is a heap of boxes covered over with a blanket here or a piece of bag there and old rubber sheets in other parts. I did not fully enjoy my sleep as the \n\nHowitzers near my camp kept up an incessant fire all the night and the roar invariably woke me before I fell soundly asleep\n","55":"\n\nI was up early and it was fairly cool but bracing. There was still plenty of munitions flying about – in the air of course.\n\nIt was a perfect pandemonium Cracking and barging on all sides. At about 10 am the Turks put one of our guns out of action and our mechanics immediately set to work to have it fixed up. Their shell hit the gun well on the buffer which contains the springs. The enemy gave us a good deal of what our chaps call hurry up stuff in artillery vernacular. In my store apology a large piece of shell fell and hit the top of a case piercing it right through to the biscuits inside.\n\nOne of our guns is to be shifted and placed in a new position and this necessitated a lot of work to some of our chaps to-day. It is wonderful the perfect Sang Froid of our chaps as they go to and fro carrying ammunition and other articles regardless of the shells and missiles flying all around. Went down to our base store in the evening with my forage Party and finished up around 10 PM. Every night now I have to go round to our guns and give an issue of rum. It is a great stimulant now as things are at such a high pitch.\n","56":"\n\nThe Battle is raging at higher force than ever and the enemy is certainly fighting very stubborn. This morning they sent shells all around our store quarters while our guns kept them very busy indeed. Just at daybreak\n\nas I got up our Battleships were also pouring forth a tremendous fusilade. At one of our guns this morning we had the misfortune to lose a fine young fellow in Bombardier Ted Baynes while Lieut Ross was wounded slightly. The Turks gave us a good deal of shelling – it was unceasing all day till sundown. As I went along the beach in the afternoon the casualty sheds were full telling their own mournful tale. I had occasion also to do my usual evening trip that way for stores. As you can understand store journeys are very tedious specially the ascent of the steep grade of ridges going back to the firing line. Late in the evening Bomb Ted Baynes was laid away.\n","57":"\n\nThe burst of the screaming shells heralded the break of dawn. It was a bit misty looking and no doubt\n\nthe discharges from the shells would account for this. Reports received so far state our men are fighting magnificently. In the afternoon we witnessed a race between one of our aeroplanes and a German Taube. Our aviator made a great dash at him but the Taube is a fast machine and made good his escape. It was exciting to see our circle above him before he pursued him and of course his action was to gain an advantage of height.\n","58":"\n\nIt opened up a dull hot day but the firing was a lot quieter. Later in the afternoon the enemy opened up and gave us a hot time while it lasted. It is miracluous how some men escape. A number of shells landed within a few yds of my store. They make you feel \n\na bit shaky I can assure you. The earth went about 50 feet into the air. Unfortunately our Battery had another disaster on No. 2 gun. A shell hit the gun and caught the gun detachment badly wounding Bomb. McKinnon and Gun Moore while Bomb Dingwall & Gnr Thornihill were also wounded. Only one man escaped without a scratch. In these important operations lately our Battery has figured well and the General Commanding gave the Battery special thanks. It has certainly been wonderful how the Battery has got off so lucky. Up till now the Battery has had a charmed existence.\n","59":"\n\nStill oppressive weather. A fairly quiet day. We could hear a great deal of firing over towards Achi Baba in the evening and also towards where the \n\n \n\nnew landing was effected higher up the Peninsular.\n","60":"\n\nI was feeling bad again to-day I was not too well yesterday. Last night it was very oppressive and added to this was the odour of the dead blowing over from the trenches on our front. Heaps of dead men are visible all over the Country Side to the left of our position. I felt very weak coming to and from the stores back to our line.\n","61":"\n\nStill oppressive weather. It was quiet up till fairly late. A few shells were poured on to our beach by Baechy Bill who we thought had forgotten our existence by his attention having attracted by the attack on the left. It has been a few days since we heard from him. I was a little better today after some cornflower and milk\n\nsupplied by the Medical officer. We have now a number of Brigade Ammunition men attached to our Battery as our ranks were so depleted. Had a long talk with Major Griffith\n","62":"\n\nA windy blowy day and much cooler. It seems from all appearances that a terrible mess has been made by our leaders in the campaign here. Everything points to this. I hear our casualties in this new development have been enormous and yet we seem no nearer the end. Something is radically wrong somewhere. Yesterday one of our observers spotted a large number of Turks organising apparently for an attack and instantly one of our guns poured into them about 8 high explosives with great effect. They scattered in all directions. The force against which it was thought the attack was to \n\nbe made was a ridge called Lonesome Pine and it has been a source of danger as it was not too strong since we had captured it. The odour from the dead is very strong and no doubt the hot oppressive weather has accentuated the decomposition of the bodies.\n","63":"\n\nWater has been a rather troublesome matter to deal with recently. With the new movements there has been a big drain on resources and our men have had to be content with about half rations. It is a bad time to stand it now with the weather oppressive. Bread and fresh meat is also off issue just now also any fresh vegetables. Received parcel from Capt Jack Fitzgerald with a writing pad envels & chocolates etc sent by him from Alexandria. It was welcome. I can\n\nassure you. While along at Ordnance I met Major Griffith. It is a very tiresome walk there in the heat along the sand and back up the precipitous ridges. It was a charming sunset this afternoon. His Majesty went down a perfect globe of gold and it was delightful to see him dipping his head behind the Island near Embros. For some minutes he was peeping over the side of the island but he was soon lost to sight leaving a crimson glow reflecting over a diaphanous sky. The cruisers just below us were still sending their messages of death ashore somewhat breaking the otherwise tranquil scene for one could only hear an occasional crack of a bullet just at the same time. The boom of the guns dispelled any idea of Peace. Sergt Stewart returned from Lemnos yesterday after his illness.\n","64":" \n\nStill on the oppressive side. Things a bit quieter. I went to Ordnance after dinner. Had a swim on beach. There was about a dozen of us in and the Turks sent a few shells at us. I was not long in getting out of operation and hurried dress under the high bank while shrapnel fell all overhead. One poor young chap in leaving the water got a shrapnel bullet in his leg right on the Shinbone. He was only a few yds from me and it was not till two of his comrades assisted him up the bank that I knew he was wounded. The shells are from our old friend “Beachy Bill\" as he is known. Saw Olly Gunderson at the Engineers Stores as I passed through. I secured boots and socks for our men at Ordnance. We saw 4 bombs dropped by a German Taube on to the landing position below us. They were\n\nevidently intended for the Battleships off the beach there. Huge volumes of smoke rose from where the bombs struck.\n","65":"\n\nIt was a bit cooler this morning. Nothing Fresh.\n","66":"\n\nI woke up pretty early and found it very overcast and sprinkling rain. My poor old store covering was unable to keep out the slight downpour and I was very uncomfortable for a few hours. The rainwater used to collect on top in patches and the wind shifted the covering and in it would come in large splatches. Another of our Gunners “Darkie Alderson\" was killed to-day working in No. 4 Gun Pit. He was a very dark swarthy complexion and that is how he gained his nickname. He was a good fellow in every way.\n\nHad my usual trip to the beach stores in the evening. In the evening I also went down to Ordnance to see if Canteen Ship in and to obtain stores if possible. After taking party down I found we could only see a list of goods & prices and articles would be distributed to various Divisional Headquarters etc. It suddenly turned very cool to-night and it made it much more pleasant. I trust that we shall have a continuance of these conditions for a time. \n","67":"\n\nIt was nice & cool again this morning. I had a trip to Ordnance in the afternoon to buy & obtain boots but I was disappointed as the sizes required had not arrived. A Turkish shell had my quarters a visit or one might say it said “Good day\" as it was a few yards off my doorway. When it fell\n\nthe earth rose quite 50 feet high in the air leaving a huge crevass in the earth. \n\nReceived parcel this morning from Mrs Attwater & Miss Elliot. How welcome the items were. I felt tremendously pleased to get the particles and it seemed as if it was a link with the other world I had previously lived in. The sweet smell of scent after the odiferous smells here.\n","68":"\n\nIt was a little warmer today although it became cool. We had another misfortune this morning. The enemy got on to our No 2 Gun rather badly and four men were wounded – 3 were fresh men up from the B.A. Column and the other F. Pacey an old Battery man was I’m afraid mortally wounded. He was badly cut about – the result of a burst from a high explosive. Late in the evening there was as big advance on the left and a number of trenches taken by our forces. As can\n\nbe understood we are all hoping that the forward movement will continue so as to allow us to move on to finish this campaign against Turkey.\n","69":"\n\nIt is cooler to-day and some of our men are complaining of the chill of the wind. In the afternoon there was an artillery duel – some of the enemies shells falling just over my store. There was the thud thud as one gun fired after the other & the loud cracks as the Turkish shells burst in the air around us. We heard that the new Australian Division which landed below our zone did splendid work yesterday and they had got the Turks moving well.\n\nA tremendous big shell went over us just about sundown and fell 30 yds the other side of the store. The earth rose up fully \n\n100 feet into the air & a large crevass enough to bury a cart & house in was the result of the burst.\n\nThere was a demonstration against certain trenches occupied by the Turks on our right – called by us the echleon trenches. The object was really to see if they could be well defended by the enemy. A good deal of fire resulted and there was several casualties on our side.\n","70":"\n\nI could hear a lot of firing early this morning & it was evidently a continuation of last nights affair. As the morning wore on the wind rose and it was blowing fearfully gusty and with heaps of dust making it very disagreeable. We heard that 3 bags of mailing matter \n\n \n\nfor the 3rd Artillery Brigade had got lost or rather sank in a lighter coming ashore. I’m hoping that its not true as I will miss my letters very much. The young Donkey which I mentioned was born some weeks back is growing fast and frolicking around our lines quite at home with its old Mother. A male donkey has joined the mother a few weeks back & our lads make use of it for transport purposes.\n","71":"\n\nStill gusty and blowy. I received some papers but no letters & was a bit disappointed. Am still acting as Quartermaster Sergeant & Pay my daily visit to the beach for victuals etc.\n","72":"\n\nThe other day I met Wilson brother of Jack Wilson who is with our 5th Light Horse. He is acting in Col\n\nHubert Harris position since he was killed. It is very sultry to-day and looks like a storm. Yesterday it also blew up like a storm and we had a sprinkle of rain only. If we get anything like a rainy season here we shall really be in for a bad time. It is quiet today except for Beachy Bills sending a shell over occasionally & a rifle Bullet cracking here & there. Lower down where the new Division landed the Cruisers are sending a few broadsides ashore. The outlook on to the water looks very dull owing to the threatening state of the weather. Sergeant Turton went away today.\n","73":"\n\nIt is much cooler today 7 it looks like rain. It was fairly quiet all day but about 10 PM at night there was very heavy rifle\n\nfire on our left flank. It opened up just after I had returned from the stores on the beach. During the evening it rained a little. We got a very welcome mail in the afternoon. \n","74":"\n\nIt was blowing fairly cold to-day and was still like rain. We were pleased to see our Major returned yesterday. His presence was very welcome. A high explosive shell burst just above where my store is situated & wounded about 8 men. It was a cry of stretcher bearers everywhere for a few minutes. The men that were wounded were standing round on the ridge side where their dug outs were. A very big shell fell just below our latrines this afternoon.\n","75":"\n\nNot much doing. A good deal of rifle fire took place yesterday & we have \n\nheard that our left flank moved forward & took a number of trenches. Our Major went over to Headquarters to take the place of Col. Rosenthal who had gone away ill.\n","76":"\n\nIt was deliciously cool this morning. One of our transports got in a bit close and went aground for some hours. The Turkish Artillery opened fire over her but luckily did not hit her before she got off. We often get a good view of the trawlers & other boats moving in to the landing stage under fire. A shell goes over them one behind – perhaps one in front and so on. It’s very interesting to look on while this drama is being enacted. The 12th Light Horse came up to our lines this afternoon & I understand merged into the 7th L Horse flanks. They had only arrived from Egypt in the morning early.\n","77":"\n\nIt is nice & cool early this morning. I got a few more letters & Papers which had been amongst the bags on the sunken barge. Went to Ordnance to get Bags Boots & Tunics etc. Saw Olly Gunderson.\n","78":"\n\nThere is a tinge of Winter in the air & it is lovely after the hot days. Our chaps are commencing to cover themselves up a little more. There is not that absence of clothing on their backs that I spoke of some time ago.\n","79":"\n\nThere was a decided change last night & I felt the chill of the air as I had to unceremoniously leave my bed for the rear. It was about midnight at the time & I had five others to keep me company when I arrived\n\nthere. It shows the state of the health of our lads just now.\n\nAll day it blew a strong Nor’ Westerly and cold with it & plenty of dust. I had several trips to for timber etc to Stores\n","80":"\n\nI was bad during the night and had to go to the rear on several occasions. Although it was midnight & later had company on nearly every occasion. Things were still a bit quiet during the day.\n","81":"\n\nThe weather nice & crisp with a cool breeze. Getting the store rebuilt a little in case of Winter protection – a quiet day. Went to Ordnance for clothing etc.\n","82":"\n\nA cool breeze blowing but I am\n\nnot feeling too well. Stomach trouble again.\n","83":" \n\nA bit better to-day. Had to get a return of equipment for Battery & went round to gun detachments. Fairly cool but a nice day. Saw Jack Fowles.\n","84":" \n\nA nice day – Fairly busy re equipment. It is lovely to out over the ocean as the breeze comes wafting over its rippling water.\n","85":" \n\nA little shelling otherwise quiet. Preparing for winter etc\n\nxxxx\n\nEnd of letter home\n","86":"\n\nNice & crisp still. Fairly quiet. Still building up my store for Winter etc.\n","87":"\n\nBusy finishing off roof of store with old blankets W.P Sheets etc. It is now twice the size it was and fairly comfortable except that it really requires Galvanised iron roof. None of that material is yet available. A quantity is on the water we are told & will arrive in about 5 weeks time.\n","88":"\n\nA windy day but cool. My store had a calamity the side wall fell over. It was heaped up sand bags – luckily no one was near it. The work of building it up was no small one I went along to Headquarters to try & see Jack Fitz but he had not arrived yet. There was a good deal of\n\nshelling to-day.\n","89":"\n\nVery keen & cool – windy. A number of our men due to go away for a spell for a few weeks.\n","90":"\n\nVery like rain. Men to leave late to night. Mouse bit finger while laying half dozing. They run in & out of bags of which my store wall is built etc.\n\nFixed up a stretcher in store to make myself a little more comfortable. It was fine – you can bet I slept finely this evening.\n","91":"\n\nOur men did not leave as anticipated but came back early in the evening very disappointed. I had a lot of trouble to fix up extra\n\nrations for them as they were off our strength. “Beachy Bill\" our old friend sent a lot of shells over towards the beach to-day.\n","92":"\n\nI went to Ordnance to get officers clothing etc also to arrange about mules for drawing indent goods on the following day. Received note from Jack Fitzgerald our Field Cashier\n","93":"\n\nIt rained. Had to get up to catch the drops through my roof etc. Mud everywhere – sticks like glue much worse than our black earth etc. Fairly cold etc. Fine big mail arrived.\n","94":"\n\nA fine day. Felt tired after going to Ordnance yesterday to\n\n \n\nget articles indented etc.\n","95":"\n\nA cool breeze blowing all day. Like rain again. Every one wants blankets etc. Wrote letters to-day.\n","96":"\n\nQuiet\n","97":"\n\nWent to Ordnance again. My gang fitted themselves out - ! – a good deal of artillery firing to-day. last night our infantry attacked the Turks & captured several trenches near lone Pine\n","98":"\n\nA Blowy day & keen\n","99":"\n\nThe same. We had a lot of shelling to-day.\n","100":"\n\nVery keen again. Winds just like our Westerly. Busy on fresh indents etc. Ordnance & Ground\n\nsheets.\n","101":"\n\nWent again to Ordnance. Had busy day getting goods and etc and later on when mules brought parcels up I issued to those required\n","102":"\n\nWeather still keen. There is an absence of the short Pants now. Everyone is commencing to cover themselves up a little more. The wind is the worst part of the weather – it is so cutting just now. I made an appeal to Supply O.C. about bread & in future our Battery is to be treated similar to the Infantry Brigades etc.\n","103":"\n\nA nice day. Just a little cool Zephyr blowing. We have a demonstration against the Turkish positions late in the evening. There was a tremendous fusilade of bullets & shells for about 2 hours etc.\n","104":"\n\nIt was again a lovely day. Ordnance visit again.\n","105":"\n\nA lovely day again – just mild. On the hills of the islands as the sun is setting there is a wonderful glow tinted with every shade reflecting on the white clouds that seem to be resting on the ridges. It has been quiet all day excepting a few fusilades from several Batteries on our left flank. \n","106":"\n\nI had a quiet day. In the evening there was a very heavy bombardment taking place both on our right & on our left. The sky was lit with the bursting of the shells & the searchlights from the man-o-war vessels. Towards midnight one of the enemy’s Taubes flew over our lines very low and dropped some \n\nbombs happily for us without any serious effect.\n","107":"\n\nA little sultry. The Turkish Artillery opened up on us about 5 o’clock and made it warm for about half an hour. Our guns replied and the bursts and crash was deafening. One of our men named Gnr Turner a recent transfer from the Ammunition Column was hit in the legs and several L Horse men just near my store were wounded 2 of them died about an hour after. One shrapnel shell burst about 190 yds from my dug out door & a shower of bullets scattered over a space of a ¼ acre.\n","108":"\n\nWent to Ordnance. It was warm to-day – Well the flies know it. They seem to come from nowhere as while we had the cold spell you could not see any about. Now they are in droves &\n\nhow they cling. I think the Turks must have given them instructions. In the afternoon one of our Cruisers poured shells into part of Gaba Tepe Look Out Point. How they raised the dust & earth! I can assure you it is good to have them on our side. The Turks sent some shells over on to our ridges and also towards the beach. It may seem strange to say we just watch – or perhaps I should say follow the sound of the shell – as it hisses through the to see where it will fall or burst. You can always tell if the shell is going well overhead. Of course if it going to burst very near you well – you don’t have time to follow any sound as it is on you before you can move. You generally do a dodge after the danger is past.\n","109":"\n\nThis morning there is a \n\nthick mist enclosing all the ocean skirting the shores of our battle field zone. The Islands of the Agean see are shut out from view and all the ridges hardly visible – the air being so thick & hazy.\n\nSaw Capt Jack Fitzgerald our Field Cashier and had long talk. He was over to pay any monies required by the different units.\n","110":"\n\nAnother quiet day. I went to Ordnance for Battle Lamp glass & wick. Saw Major in the afternoon. There was an attack during the evening & a lot of rifle fire. \n","111":"\n\nThe morning opened hazy and sultry \nTemperamental inability of the Germans to understand decent behaviour\n\nI went along to Ordnance. Very hot journey. Coming back I saw Major \n\nGriffiths and had chat also went up to Capt Jack Fitzgerald to bid him Au Revoir as he was to leave next morning. He showed me a bank demand order which had been found on one of our men who had been killed. The papers had an awful stench as he had been dead some time before his body was recovered.\n\nOn the beach now there are parties of Greeks, Maltese, and the awful Egyptian chaps. One had thought that the last had been heard of the monotonous lilt of their chorus as they worked but no it must follow one across to Turkey.\n","112":"\n\nIt was a delightful morning as you looked across the peaceful blue ocean. Just a gentle Zephyr stirred the surface of the \n\nwater and there was not the crack of a rifle shot to disturb the peacefulness of the dawn. How we all look forward to the time that such conditions will exist all over the world and the great glorious peace proclaimed (see next page xxxx). When the actions – the brutality and questionable fighting of the Germans is considered there seems to be a temperamental inability of the race to properly understand the decent behaviour. One only requires to follow the reports of the treatment meted out to prisoners – the women folk of the places which the Germans at present occupy.\n\nI write the above remarks before 9 am at which time there was a complete disallusionment of our surroundings. The Turks opened up with their artillery & shells came from all directions.\n\nA perfect pandemonium reigned for about an hour. Our guns were not slow in replying and in the far distance on our left flank could be heard the rattle of heavy rifle fire. Guns were booming in the direction of Cape Helles. Captn Crisp returned to-day.\n\nWith the coming of Winter the little ground larks are getting plentiful. I can see them flitting here & there with their pleasant little chirps.\n\nIn going & coming from Ordnance and the Beach Headquarters I have to pass along a stretch of open sand and here one has to run the gauntlet of Snipers from the Gaba Tepe Lookout Point & adjacent country. It is certainly not pleasant to feel & know you are a special target when you are innocently walking along. To be \n\nwounded when making a charge or taking part in any fray it is entirely different & one does not mind. There has been several air chases during the last few days. Our aeroplane making a dash at the German Taube.\n\nxxxx\n\nBlow Bugles Blow! They brought us, fore on dearth\n\nHoliness backed so long and Love & Pain\n\nHonour has come back, as a king to earth,\n\nand paid his subjects with a royal wage\n\nAnd Nobleness walks in our ways again\n\nAnd we have come into our heritage\n","113":"\n\nA little sultry. Went along the beach & saw Olly G. Passed a young chap & at first glance I could tell I knew him. I stopped him & said “are you not a \n\nfriend of John Bulgins\". Yes he replied. I did not know his name but on him informing me I remember playing Tennis with him on one occasion. His name was Joyner & lived at Samson Vale. I am good at remembering faces but names ----\n\nThere are things & there are faces which when felt or seen for the first time stamp themselves upon the mind like a Sun image on a sensitised plate & there remain unalterably fixed.\n\nTake the instance of a face or most faces one might say – the same smile or a frown – the same look.\n","114":"\n\nSeveral small skirmishes took place but nothing of any\n\nimportance. Late last evening I awoke by hearing voices outside my dugout store quarters & found our boys who were away resting had come back from Lemnos. It had been rumoured that another batch of men were to go & any one over 3 months of continuous service on the Peninsular was entitled to the holiday. I declined to be included as I was fairly busy with various indents and issues & I decided to wait till the next batch went.\n","115":"\n\nTo-night there was a demonstration by our forces against the enemy’s trenches but nothing of a decisive nature. A very bombardment took place on the Southern end of the Peninsular and the booming of the heavy guns was very pronounced.\n","116":"\n\nIt threatened rain all day &\n\ntowards evening the wind rose & lightening lashed in the S. Western portion of the heavens. I had secured our supply and conveyed all the goods to the store by the mules and had just returned when the rain commenced to pour down accompanied by strong gusty wind. I was anxious about the roof of my dug out store standing as it was only Water P sheets & blankets. Fortunately it stood the test but I was up most of the evening catching the drops of water as it leaked through in various places. To catch the water I had large Dixies we make tea in & I emptied several of these during the night. It eased off towards the morning & I fell asleep very tired but satisfied I had protected the bread & other perishable stores.\n","117":"\n\nIt was a delightful morning after the rain. Of course there was plenty of mud about & you could see traces of the storm which had just abated. In the afternoon I went to Ordnance & on the beach there was a fearful muddle. The various jetties & landing stages were carried away. Barges & small vessels were high & dry on the sand. Biscuit boxes & others were strewn all over the place. The debacle could not have been better completed by the heaviest of bombardments. \n\nThe sea was still a little angry as it lashed into spray against the rocks & barges on the sandy beach. One could hardly call the storm a very big one yet the damage was enormous & if the weather did get very bad\n\nhere we shall have a very trying time as stores & water could not be possibly landed.\n","118":"\n\nThe day opened up nice & fine. The ocean looked very calm & peaceful in the distance. Recently we have been able to obtain eggs here at 2\/6 dzn & it is wonderful how palatable they make anything. I have boiled a little condensed milk mixed with water and this with heated up eggs & cornflour made a delicious dish. For a change beaten up eggs & flour fried in fat was also added to my menu occasionally. I am now more able to do a little cooking having the cook house near my store. There was a good deal of shelling in the afternoon. Our guns exchanging shell for shell with the enemy. A burst near the 7th L.H. trenches caught 9 men\n\nabout 4 of whom were considered mortally wounded. I had a bad toe – it was really a corn which ached very badly & I felt a bit off. Rumour has it that the Navy will force the narrows on Tuesday m=night.\n","119":"\n\nIt was sultry to-day & threatened rain in the morning. Just near my quarters a position is used as a Grave-yard & those killed in the trenches just in front are carried to the rear & layed away. Several killed yesterday were buried early this morning. It certainly looks as if the season is here – it’s what we have dreaded. The heavy black clouds hung about very ominously all the morning and about noon the sea was obscured from view & the echo of distant thunder the first I have heard since \n\nleaving dear old sunny Qld. It came over the hills. The wind also rose and with it came the rain. I had to go to Ordnance & just at the present I am sitting in my dug out store catching the drops of rain which are oozing through & waiting for the squall to abate.\n\nIt fined up & I went to Ordnance.\n","120":"\n\nNice & crisp to-day. Just refreshing weather.\n\nWednesday 13th\n\nIt was cool with very fresh winds. One could tell the difference in the seasons as every person you came across was well wrapped up. I ascertained that both Cyril V & Cyril Kirkwood were away ill. In the afternoon visited Ordnance & met Stan Schooley on the way. He was\n\n \n\nin the Field Ambulance near Ordnance & we had a long talk & I promised to try & get along & have tea with him some afternoon if things were quiet. Coming back I had to run the gauntlet of shell fire and my assistants and I had to take refuge for some little time.\n","121":"\n\nThe morning again opened up keen and looked as if it would continue so. The breeze got strong and it made one find the warm spots. In the afternoon I saw Garth Billington of the 5th Light Horse and had a good yarn & then went over the","122":" Trenches with Capt Wright. It was wonderful the networks of cuttings & dugouts – all splendidly arranged.\n","123":"\n\nA little cool and very like \n\nrain.\n","124":"\n\nIt was nice and crisp. I had a busy day. Went Ordnance for blankets etc. Saw Stan Shooley again and called on Major Griffith re appt.\n","125":"\n\nA sprinkling of rain ∧ very overcast. Last night I received a bundle of Papers from Egypt and have not so far any knowledge of the sender. We heard some days ago that Bombardier McKinnon Gunners Clark and Moore had died through the result of their injuries.\n","126":"\n\nLast night I did not sleep well. It rained towards morning and the Turkish mice also disturbed my dreams. These rodents have made a comfortable home between the sand bags and as\n\nI make my bunk up close to the wall they make me form a bridge as they go to & fro you can imagine the feeling as these creatures run across your blanket. It takes a lot to get to sleep once you have felt them about.\n\nToday I am sorry to have to note a Naval gun 4 point 5 which is on a ridge behind our guns & the trenches had a premature burst. The early explosion of the shell wounded four Light Horse men just rear of my store.\n","127":"\n\nIt was overcast again to-day and very cool. We were Subjected to a lot of shelling early in the day.\n","128":"\n\nQuiet – except the usual daily shower of Bullets & shells. \n\nApptd Temporary Corp to-day.\n","129":"\n\nApptd Temporary Corp vice 20th Bliss\n\nIt was a crisp nice day. In the morning I was along to Ordnance.\n","130":"\n\nWet and windy. Very miserable in the morning but in the afternoon it cleared up a little & I went to Ordnance but got wet coming back as it poured til about ted . Our trip to supply that night was not too pleasant.\n","131":"\n\nIt fined up to-day a little but still it was overcast & windy. Had a trip to Ordnance & saw Owens of YMCA who run a Canteen Store with goods from Embross Isld. He makes trip to & fro every week. A big crowd was there but I managed to get inside knowing Owens & secured some cakes & tin fish\n\nare delicious quite in this region. Going along the beach to Supply about Sundown “Beachy\" opened up on our party & sent several shells at us. There was a scramble for shelter on the high banks & we had to hide there for some little time & then venture forth one at a time. It was the number together that attracted the shelling & luckily no one was hit. The scramble on top of my tea rather interfered with my digestion. I saw Captn Brunditt a Brisbane chap I knew well to-day. He is with the 5th Light Horse. Our rations are now wonderfully improved. We get fresh meat & Bread almost every day or two & I often wonder if it is too good to last.\n\nA ration of wood 1 lb per man at present a daily occurrence whereas before we were lucky to get any. There was occasionally an issue about once a month. All the wood has to be brought in as this country is devoid of trees. It is all undergrowth & brushwood holly etc. There was such a scarcity of fuel that we had to resort to grubbing out roots of the shrubs & burn them with the aid of a little piece off a case the rations arrive in.\n\nThe other day I managed to secure a few eggs & as our cooks had erected an oven made up a bread pudding – one of my old favourites.\n\nVery cold to-day.\n","132":"\n\nEnd of letters page\n\nXXXXX\n\nIt was a nice day & quiet.\n","133":"\n\nIt was cool to-day. A surprise was in store for me as about midnight I was awakened by voices & found Corp Coleman & QM. Augusteen at my dug out door. They had just come back & were looking for somewhere to bunk. I thought it cool of our QM to wake me up by coming in & striking a match. \n","134":" \n\nCaptn Crisp told me to hang on to my position & work in Store at present – the Q.M went into Sergt Major Runcorn’s Dug Out. So far I hardly know my position. Had long chat with Corp ted Coleman. Went to ordnance again & “Beachy\" was acting. I had to take refuge in dug out on beach. The Turks seem \n\nto have a fresh lot of ammunition now as their guns are more active.\n","135":"\n\nIt is windy to-day & dusty. There was a big fusilade of shelling before midday. The Turks opened up on us from most of their Batteries.\n","136":"\n\nHad a quiet day. Captn Crip informed me I was chosen by Officers Commanding 3rd Brigade F.A. to take charge of Brigade Canteen it was decided to form. This would mean my being attached to Headquarters.\n\nLast night one of the old limbers which had been broken up by shells was erected up in one of our Gun Pits as a Dummy to draw fire.\n","137":"\n\nHad a meeting of Canteen\n\nCommittee at Headquarters. Each Battery having a representative present. Lieut Forrest explained scheme as to Purchasing Stores from Embross Island Canteen and an order was drawn up as a first foundation to Store. Each Unit was to subscribe £20-0-0 as a capital to finance scheme & only such articles to be purchased as would benefit the men in adding to present ration.\n","138":"\n\nIn charge of fatigue Party in digging out place for Store at Headquarters. We had to tunnel into the side of a hill well underground.\n","139":"\n\nSimilar duty – Receive instructions that I had to go over to Embros Island to get articles from a Military Canteen there for all the Artillery Brigades in the 1st\n\nDivision tomorrow.\n","140":"\n\nMade all Preparations to leave for Embros Island. Visited Don AC in Divisional Artillery Headquarters to get instructions from Captn Knox and then went on to Divis Headquarters to see Captn Hastie. In was then informed that owing to bad weather the ship would not go. Went along beach to the landing stage & found if sea moderated we could go. Stayed till 4 ocl & auths then decided to postpone trip till tomorrow.\n\nI went back to Olly G at Engineers Store on Beach and had tea with him and then returned to 3rd Brigade Headquarters where I reported weather too bad to proceed etc. Olly & I then visited 9th Batallion R Quartermaster Sergeant where\n\n \n\nwe talked of the doings of the 1st day ashore & of the incidents of the great charge etc.\n\nAll of the battle was once more fought all over again. Returned to the Engineers Store where I slept for the night. Olly made me up a bunk on a stretcher in a shed & I was very comfortable indeed. Olly being like a mother even to me even dosing my blankets with powder for fleas.\n","141":"\n\nWoke up very refreshed. The shed in which I slept was right on the beach & the roll of the waves on the shore was very sweet music. I was to go along to the landing stage to see if the ship was leaving\n\nLife under active service does not tend to improve ones morals as far as cribbing is concerned. To use an Australianism one is rather forced – I should say tempted but the word is hardly strong enough – to pinch anything in the form of eatables that might be handy. Those working on the Beach have ample opportunity to make use of their “pinching\" propensities.\n\nDuring the last few days a good deal of shelling has been taking place on the other side of the Peninsula. The rolling boom of heavy guns can be heard daily.\n\nAt last after a good deal\n\nof waiting I boarded the Keravonos a small Ship & we were taken out to a trawler anchored out.\n\nThere was a good deal of messing about transferring from one boat to another. As we were anchored out a splendid view was obtained of out Battle Zone & ridges & the scene looked pretty dotted here & there with white tent. The trip up to cape Helles was enjoyable. There one could see the wonderful preparations made on building a landing stage etc. a wall of stone & then some large ships were sunk to make a breakwall. You could see Motor Cycles Horses etc. Every kind of tent & erected. It looked quite like a huge town. Near where we anchored we could see the HMS Majestic which had \n\nbeen torpedoed. She was laying bottom up. Arrived at Embros at dusk. The sea was very rough and it was blowing cold but after over 4 months on the peninsular under fire since I returned wounded, it was a great relief. In coming into the wharf or Pier it was situated in a little Harbour & on the outer side to make a breakwater some half dozen large steamers had been sunk. I was soon ashore but in the dark nothing but tents could be seen. After making arrangements for a tent to sleep in at the rest camp I went out for a walk and saw the little that could be viewed. The YMCA had a small refreshment Canteen run under contract with the Greeks. It was a rather poor affair – just a cup of weak cocoa & buns – occasionally I should \n\nshould say the later were supplied. There was a large tent there also in which a Piano was installed & a few tables.\n\nI returned early to my tenet where there was a Quarter Master Sergeant, Sergeant Major & a few others living.\n","142":"\n\nWoke up early & scouted round for breakfast. Found we were not on ration list but it was being arranged etc. Had a wash & felt a little brighter. The scenes of the this little place was peculiar to most of the Islands in the Aegean Sea. The Port is called Thephelos & all the inhabitants are Greeks who live in tiny Villages somewhat similar to those on Lemnos Island.\n\nTheir picturesque costume of vest &\n\nsemi pantaloon skirt arrangement is a decided change to ones eye after so much Khaki uniform. The velvet caps & vest are much affected and the turned up shoe like the Dutch effect. At Embros it is really a Headquarters where some of the Heads are centred and an airadrome is being erected there. Other large operations are in view. There is a large number of Arabs working under contract. The same old style with drivers adding them on with whips to do their best. The place is also used as a sort of rest to some of the troops stationed at Cape Helles. In the afternoon I did some purchasing at the canteen but found things very unsuitable. Not much to be had\n\nI did my bit & then arranged with one of those guarding other goods to look after mine.\n\nI managed to get some Post cards, nuts etc and did a little buying off the celebrated “Bum\" Boats which can even be found at Embros. \n","143":"\n\nDid further buying to-day and managed to secure a few more items. It looked like rain & QMS Maclaren who I had chumed in with decided to leave next day by trawler but I was inclined to stay another day. How I am to get all my cases away I don’t know. The task for one man is an impossible one\n\nbut those that can do the impossible are the ones required in this great campaign to lead.\n","144":"\n\nJust nosed about to-day getting a little here and there. There was only one Greek fruit & nut shop to buy from & it was in charge of or owned by a very excitable individual and also very independant. He would close up shop just when it suited him even if there was dozens of customers waiting. The prices were restricted by the military Authorities. I got some nice apples & nuts to bring back. R.Q.M.S. Perry 7th LH was also over to purchase for his unit and he went up to one of the Villages on Thursday but up till to-day he had not returned.\n\nAs my work in buying guarding was so much I could not leave \n\nThephelos. I made arrangements to get some capes made to take back next morning from the Greek Bakery. Had a game of Bridge that evening in the tent of some members of the 27th Battalion who were across making purchases for their unit.\n","145":"\n\nI was up very early – ion fact about 4 o’clock. Got capes packed & fixed up other cases etc. Had hard work lifting cases into transport & getting down to wharf by 7 o’clock. I left very off. The Egyptian Arabs hauled the 29 cases I had aboard & we lifted anchor sharp at 7 am. It was nice & cool and made a fine run. We called in at Suvla first. This is where the recent landing took place. There was not much to see except tents horses etc. & plenty of war material. On the \n\nrocks ashore was a Torpedo Destroyer broken in halves. She was driven ashore by the rough weather last Sunday we found & was a total wreck. All her guns had been dismantled & she was stripped of everything possible so that it would not be further destroyed by shelling from the Turkish guns.\n\nWe heard plenty of the crash & booming of the guns as we neared the shore. On board the Trawler we had a lot of Greeks who had come over from Embros evidently to work at Suvla on contract. At Embros they get the magnificent sum of 2\/6 per day while working for the Authorities. Those we carried over were a motley looking crew as far as dress was concerned & which gave some of them a very cut throat appearance. Some in caps vests coats sashes of considerable length which were wound round & round them others had ordinary sacks cut as vests or aprons etc\n\n \n\nThe Greeks were placed aboard one of the steamers at Suvla & it was amusing to see them bundled off with their belongings by the sailors. They had all their goods in sacks & one poor unfortunate lost his overboard. The poor fellow wildly gesticulated & when put off he sobbed bitterly. One of our men threw him a blanket & he seemed very thankful.\n\nArrived \nWalkers Pier\n off Anzac at 1 PM. There we had to tranship from the Trawler to a small Pinnace. The Trawler could not go in too close to the Pier (Walkers Pier). It was a nuisance changing over & I had really no one to help me. When I got to the Wharf it was just the same. Not a soul to meet me. I telephoned & a small party came down to guard the cases & I handed over\n\ncases to 1st & 2nd Brigade’s representatives. A large wagon of the 8th Battery came down to take our cases about 8 oclock & we soon had everything in it & started our journey to Headquarters. It was a very rough trip & I felt tired when we arrived there – having had little to eat since the day previous. I slept at Headquarters making a bunk in the underground store wh had been dug.\n","146":"\n\nTo-day we fixed prices to allow of a little profit for breakages etc & then called for orders from the Batterys. Needless to say the orders far exceeded the stock I had secured. In the evening I made up the orders working late to have them ready early.\n\nDuring the evening our Light \n\nHorse went out & took a Turkish Trench on the right. Our Artillery did a lot of firing to keep off any reinforcements. There was little or no opposition to the stunt as we call these little affairs. I am sorry to say the Lieut Tibby Brunditt an old Brisbane Boy who was in our 5th Light Horse was killed by a Turk. He shot him when only a few yards away.\n","147":"\n\nTo-day I was occupied in handing out orders & receiving cash in place of goods. In the afternoon I went round to North Beach to Y.M.C.A. & arranged to get some items from their Canteen to supply our chaps with. Saw QM. Sergt McLaren of Lowland Battery & had a good talk. Also saw Olly.\n\nThe Turkish Artillery were shelling our positions this afternoon but they did not do much damage. Several shells fell round near our 7th Battery and one near my old store which I have now vacated.\n","148":"\n\nIt looks overcast to-day. This afternoon I went along to Y.M.C.A. Canteen to get cakes for Headquarters. Every day I will make this trip now & let the different units of our Brigade take the goods secured.\n\nWednesday 10th Nov\n\nHad quiet morning. Took trip to Y.M.C.A. Canteen in afternoon for 7th Battery. Called on Q.M.S. Mclaren Lowland Battery and had chat.\n\nThursday 11th Nov\n\nAnother quite morning. A few shells scattered about our area. Canteen to-day for 8th Battery. Called in at Olly’s coming back & had a chat. It was nice & crisp and I enjoyed it. Had to dodge a little shelling.\n","149":"\n\nCalled up at 9th Bty and in the afternoon went to Canteen for them and secured cakes & on the way back a shell lodged in a dressing shed of the Ambulance at Brown’s Dip and killed 3 poor unfortunates who were there while about 4 others were wounded. I saw the poor fellows getting taken away on stretchers and one seemed in a very bad way. \n\nSaturday 13th Nov\n\nHeard that Kitchener was to come to-day. It was a little like rain and I put my blankets out early to air but as it looked very threatening I went to bring them in before I left Headquarters for the 7th Battery and as I bundled them up a shell came over the ridge very quickly slap-bang – just a few yds from me. It is needless to say that I ducked pretty smartly but possibly after the danger had passed. Another shell followed but hit a little higher up and I cleared out to my dug out. Went to Y.M.C.A. Canteen for Ammunition Column to-day. Saw Olly when I was returning etc.\n\nTo-day was a lovely bright clean Autumn day & with a touch of sharpness in the air that did not chill but tingled the blood like draughts of wine.\n\nI stood on the ridge commanding the outlook to the Aegean Sea drinking in with all my soul the beauty of the blue rippling sea, the roughness of the landscape and the sky studded with white clouds like heaps of wool.\n\nSunday 4th Nov\n\nTo-day all our guns opened up with a tremendous bombardment of the Turkish Positions. The place was a babel of noise and the Turkish Artillery commenced to return the fire and added to the Inferno. I went to the Y.M.C.A. Canteen for Headquarters this afternoon. It was a lovely crisp day. Kitchener is reported to have spoken to some of our lads to-day on the beach.\n","150":"\n\nTo-day it was showery and looked as if we were in for some heavy weather. Owing to bad sea the 3rd Brigade Infantry could not leave last evening for a spell at Lemnos. Went Y.M.C.A. Canteen for","151":" Battery but found no supplies had come across. The Turkish Artillery opened up on all our positions and sent across a big lot of shells. On the beach a number of men were wounded. It rained heavy in the evening.\n","152":"\n\nThe sea is still very angry looking. Yesterday while coming along to North Beach the scene was very fine although carrying destruction with it. The sea was lashed into spray on the beach & over the jetties etc.\n\nThe Gurkas here are a fine\n\nclass of men - very mongolian looking but sturdy & well made always smiling through their dark eyes and boyish in their character.\n\nWent to Y.M.C.A in the afternoon again for the","153":" but found no Trawler had arrived & consequently no cakes.\n","154":"\n\nIt was another angry day. Cloudy and a stormy wind blowing which made the sea a wonderful sight. The waves lashing into heaps of spray & coming onto the beach in large breakers carrying everything before it. The jetties could hardly be seen & it looked as if they would go any moment. A steamer ashore at North Beach was a picture. The breakers dashing against leapt \n\nup her bridge and broke over the top of the masts. The beach was a scene of debris – biscuit boxes, tins, pieces of barges & other floating matter. The Trawlers & other ships anchored out must have anticipated the storm to increase as they had all cleared out to get under the lea of some island for protection. They were well advised for the angry sea was like a demon lashed to fury later and the mountainous seas something magnificent to view. There was a rumour that one of the Trawlers had sunk with all hands but I did not hear that the rumour was\n\nAbout 8 PM I was just going to make my bunk and the very heavens seemed to open\n\nand let forth their addition to the discomforture of all. I have experience heavy rain in Qld but it came down in torrents here but we can be thankful it did not last long. Unfortunately the damage was done though. Dug outs were full of water – trenches had fallen in & poor hapless infantrymen were wandering everywhere wet through & not a dry spot to lay their heads on. Poor devils I did pity them. The water flooded into my dug out but I managed to get a dry spot in an underground store.\n","155":"\n\nThe morning opened up fine but chilly. The sea had not gone down very much. Everywhere\n\nthe Infantry were wandering about trying to get dry & warm. Blankets were everywhere out on the grass & shrubs to dry. The Turkish Artillery opened up early in the morning & made things lively. Gave us plenty of “Hurry ups’ as our chaps say. In the afternoon I went to Y.M.C.A. Canteen & again enjoyed Owens & McDonald cooking dinner afterwards visited the Battgoo Battery (Lowlands) Division and saw my friend McLaren R.Q.M.S. and on my way back called in to see Olly Gunderson. On the beach it was chaos – the result of last night’s storm was only too evident. All the jetties but one had gone – Barges & Tugs were ashore. The Tug “Gaby\" had been sunk & I am told had some \n\nof our outgoing mails on. This was very unfortunate as it was really the Xmas mail and one could not tell what letters had been lost. I had to take refuge on my returning as the shelling was very free. I decided to take teas with Olly G and went the sun set. I started on my return to our Headquarters. The sap through which we generally travelled was full up of water – the result of last night’s storm – and it meant the road in the open had to be traversed. I had only gone a little way when I heard a shell coming and in the instant – a fleeting moment of time – I could tell it was coming close to me. I dived not unceremoniously into\n\na hole and not a second too soon as the shell landed about a dozen yards beyond me. It rather gives on palpitation of the heart, but I was lucky as it was a percussion shell. Had it been a fine shrapnel it would have caught me badly.\n\nI do not relate all the narrow escapes I have. In the position we are in they happen so often and it often seems as if many of us here have charmed lives.\n\nFriday 10th Nov\n\n“Beachy\" was very busy early and was even shelling all through the night intermittently. I went to Canteen again & secured a few nuts & figs for the","156":" Battery. I had tea with\n\nthe Battgoo Battery (my friend Q.M.S McLaren of the Lowland Scottish Battery).\n","157":"\n\nWe heard that goods or stores had arrived over at Embros & had a meeting of our Canteen Committee. I suggested I slip across & get in early if I could as all other represtvs would be going next week. I left hurriedly & caught Trawler after a lot of humbugging in getting pass etc. It was very chilly & a strong wind was blowing but I was well wrapped up. On board we had several Turkish Prisoners & as we got to Suvla the sea got mountainous. Things ashore at this place seemed quiet. It was dark as we got to Imbros Isld and the sea was still increasing in size\n\nand our little ship heaved and rolled. She stood it all very finely and we entered the Harbour about 7 P.M. I was feeling famished as I had had nothing to eat since morning except a few “Gaba Tepe\" Drops – a kind of fried scone cooked by our Cooks at Headquarters.\n\nAs soon as I was ashore I got my tent assigned to me & went & had a cup of “Cocoa\" as it is called at the Y.M.C.A. Greek place. I tried to sleep at night but it was only a miserable attempt as it was perishingly cold with a high wind blowing & everything seemed to be one the wind with its terrific force.\n","158":"\n\nSaw Capt Stowe & arranged to buy next day. I visited Owens Y.M.C.A. & had a chat with him\n\nand more than likely I will purchase a good deal of Oranges from him. I spent a very miserable day. The wind was simply awful & chilled one to the bones. Luckily I had my Balaclava cap & it greatly amused the Greeks. In my tent was Sergeant W.R. Smith 32 Avenue Rd Forrest gate Essex England and he and I chummed up. That evening we made ourselves a little bit more comfortable. I secured 2 other blankets under me, 4 over me – my mits on also my Balaclava cap & my Canadian Jacket & yet I was a little chilly. The wind found its way under the gaps of the tent & in at the door but I must say I slept a little better. The clouds are very heavy & the sea is roaring outside.\n\nSteamers went out owing to its roughness. I was lucky to miss the early boat over the other day as the 1st one got badly knocked about against the wind up from Cape Helles.\n","159":"\n\nUp very late this morning. I did not like to leave my bed. Had wash & a drink of tea. Saw Capt Stowe and spent most of the day buying & marking my cases. It was well after dinner when I had finished & I then went to the Wash Tent and fortunately secured a little hot water – what a luxury. I then stripped & bathed. How I enjoyed it. I felt several years younger after it. Whether it was the weight of the dirt being off or not I cannot say. Had Cocoa with Smith at Y.M.C.A. Called Owens “Any \"\n\nMade a tour round & called on Crewe Australian Bakery etc arranged to get vegetables etc & then returned to Blankets. They were very welcome with the wind blowing etc.\n\nVery disquieting news as to Greece’s actions. No steamers leaving here to-day.\n","160":"\n\nI slept a little better last night. It was more comfortable & the wind had abated a little. I did not rise early & Sergt Smith discovered that there was no tea for Breakfast as no water was available. Imagine this in a supposed rest camp. We had no recourse but to visit the Cocoa Shop & get a cup of hot colored water & a bun. After this Smith & I took a walk round to general Head Quarters – a place where the Generals reside – It was up in a lovely\n\nlittle nook in the rocky Hills. The rocks were all colored & interspersed with green shrubs the appearance was fine. Everything looked comfortable – Tents – Hats & other conveniences. I saw some of the Surrey Yeomanry chaps who came over on the “Southland\" when I returned to the front after being wounded. After a chat we walked a few miles to the aerodrome & saw the celebrated Samsons air ship – a converted Seaplane. Had talks with mechanics & enquired for Capt Japp & found he was over at No 3 Wing on the other side of harbour. Retd to Camp & had dinner of Salmon & cabbage. It tasted like lobster when mashed together & I can recommend it.\n","161":"\n\nSergt Smith left early this morning as the sea had moderated.\n\nThe man who was to come had not arrived as I had expected in the evening but I was surprised to hear voices outside my tent early & I gathered that parties had just come across. I found it correct & then I searched for Gunner who was to come as a buyer for our Brigade. I came across Gnr Eltham & found he was the man & fixed up things & he Purchased some goods as well. I decided to leave in the morning & leave him to get other items. Had a hot water Bath & then loaded up Transport & got cases to wharf shed for the early morning Boat. I was to sleep there & guard the cases & Potatos & oranges etc I had got. We made several good bargains in Potatoes & oranges & it made the day pass quickly. The shed was not a very comfortable\n\nplace but it might have been worse. I could not sleep though. There were some Manchester Chaps there & we made tea & had several tins of Salmon.\n\nQMS Alex McLaren\n\n27 Park Street\n\nWhiteinch\n\nGlasgow N.B.\n\nThe M.L.O came down & informed us owing to the congested state of Transport & on the other side no goods could be taken by the Trawlers. This disturbed me greatly & I immediately saw principal M.L.O after mess & had to journey up near the Turkish Prisoners Camp. I got no satisfaction & was told that 20 cases only cld go by each boat. If the rule was to apply long it meant a delay of over a month for some of the goods purchased by other representatives. I interviewed\n\nH.Q. officers & asked to be allowed to take half one day & leave the others to follow. He did not say no & next morning I was\n","162":"\n\nup early & bundled as many boxes as I & Eltham & the Manchester chaps could. I found I had 50 cases on board. It was a rough & cold journey up to Suvla I felt perished & the spray dashed all over us. The sea was big I arrived at Anzac Pier about midday but as usual there was no one to help me & I had to transfer my boxes to the Horse Boat Barge & then when at Pier up on it. The M.L.O. there got some Infantry chaps to take the stuff off on to the Beach.\n\nI telephoned up & it was nearly 8 P.M before anyone came down with the Wagon etc. QMS McLaren had to telephone before some Adjutant got message. Mc kindly let me have a cup tea while he looked after the stores. After loading up Wagon we started our ride to Headquarters. It was a rough trip along beach over obstacles etc. We could not get up hill & had to get unloaded at Clark’s Gully & a fatigue Party had to cart up the cases. I was fagged after no Breakfast & dinner & hauling about cases. I did not get to sleep till midnight.\n","163":"\n\nA message arrived other cases were coming over by Trawler to-day & I went\n\ndown & met them. Eltham did not come & I again had to haul about cases several times. One bag seemed to be missing & I was worried. It ultimately came to light & was found on end of Pier. The weather seemed to be getting bad & things were busy all around the landing Pier getting things secured. The wind & sea rose & in less than an hour everything was disturbed. I had to ship the cases again to side of bank. A guard came down & relieved me & I went to tea with McLaren Lowland Battery. It rained heavy & I got coats for my men from McLaren. After tea a Corp & three men came along to Guard cases for the night as the Wagon could not get\n\ndown owing to the sea breaking all along the shore. It was a wild night indeed. I went over to McLaren & in getting back to beach I fell into a sap about 12 feet deep. I was more frightened than injured but my eye hit side of wall. It was dark black as Hades & I had to grope my way about & feel my feet in between the lightning flashes. It thundered & crashed just like an Australian Storm. In fact in that sense quite enjoyed it. In getting to Headquarters I had to grope & slip my way in the mud & I was fairly fagged – wet etc I had a good nip of rum on getting into bed.\n","164":"\n\nWent down to Beach again this morning & saw McLaren Lowlands. On way down arranged for Mules to take cases away from Beach. Waited till they arrived & got wet through again. It was bitterly cold. Had long journey back up ridges top escape view of enemy as we were attempting to mislead the Turks that we were evacuating the positions we held. I found 2 cases were missing after everything was checked over but where they had gone it was hard to say.\n","165":"\n\nWhat a big surprise to-day. On waking up found it was snowing heavily. What a picture of whiteness everywhere it was lovely to \n\nlook on but how cold. My feet were like lumps of lead. I can now well imagine the scenes pictured of Xmas snow storms etc. How the snowflakes dance merrily along sometimes to cling to me or to go on to some shrub where it hung till it became part of an icle. Some were whirled away down to the gullies where the snow was feet deep. The wind made it piercing cold. We had a meeting of Canteen Committee & fixed prices of goods on hand as we had to provide for boxes etc for transport. I went & visited 7th Battery & slipped & slided all over the place. Mud & slush everywhere & the snow commenced to fall a little intermittently & in places it was thawing. It looked a thoroughly Siberian Scene \n\nIt took me a long time to get warm when I went between my blankets to-night but I pitied the Infantry who were not so well placed as we were. Some of the poor beggars had only arrived from Lemnos & had to dig positions while it was snowing. \n","166":" \n\nTo-day I received orders for Canteen goods fixed up lists in preparation & issued the Headquarters lot. It was devilish cold & the snow was still thick on the ground. I could not get my feet warm. The wind was blowing hard & it made the ground dray & frozen. Everything was hard as if frozen together. It was amazing to see our\n\nBoys gathering snow in cups to melt it down for boiling purposes as the supply of water was extremely short & we were on half rations. With the boisterous weather nothing could be landed on the beach. The Turks shelled us to-day and a number of our lads were wounded & killed up on Lone Pine quarter.\n","167":"\n\nTo-day the sun shone brightly & the scene was lovely. The snow dazzled & sparkled like diamonds under its feet. Of course by now most of it was hard & frozen into icles. It was lovely to get the heatening of the rays of the sun.\n\nI was busy all the day moving Canteen goods to Units.\n","168":"\n\nIt was a little warmer to-da & the snow commenced to thaw. The ground which had been frozen hard soon became soft again & although it was previously as dry as it possibly could be from appearances it soon became a quagmire. Wherever there was much traffic it was muddy & soft & where the water lay in any corner it was frozen into ice. The mountains in the far distance Islands of the Aegean Sea looked a picture in the Sun. I was busy issuing out to the various Units again to-day. Went down to Olly\n\nGunderson & gave him a few stores. It was late & a cool trip to the Beach\n","169":"\n\nI was busy fixing up matters in connection with the stores & word came through that we could send over a representative to Imbros again. This we decided to do & I was chosen to go over & represent Divisional Artillery. Things were very hurriedly arranged & I had to pack up & get a little dinner & hurry to get the Steamer. I saw several sad sights on my way. There were a number of poor Gurkas & others who had been frost bitten on their feet & could not walk. They had to be carried on to the Pier for transference\n\non to the Hospital ship. It was a nice crisp trip across to Imbros. We called in at Cape Helles & went right round into the Straits. We saw the ruins of Sed dol Bah Fort and went in near the Aiasiatic Coast. The celebrated SS “River Clyde\" which was run ashore full of Troops was on the Beach a monument to the many brave lives that were lost in the landing which was effected from her. Every one will remember how she was run up & all her sides opened to provide a quick exit for troops. Unfortunately the “Clyde\" did not beach as expected & it meant certain death to go out on the planks provided for the landing on the lighters. In the Walls of the Fort were huge holes which our naval Guns had \n\nhewn out with their powerful guns. When we departed from Cape Helles it was almost dusk & it was not long before the scene of the war zone on the Peninsular faded from view. \n\nWe were not long getting over to Kehopalos as this part of Imbros is called. It was dark – I soon found Eltham a Gunner from our Brigade who was over with Captn Edwards as I said before in my notes days ago. I made myself comfortable in his tent – got blankets etc.\n","170":"\n\nTo-day I made up my list & as Lieut Sparrow in charge of our Party was going to Panaghia I arranged with him to include me in his party on the pass which had to be obtained. \n\nsee next Page\n\nPloughing Oxen\n\nRocks Old Greeks\n\nTurmoil of Camp after storm\n\nEgyptians gore \n\nSparrow Lieut\n\nGreek children\n\nMountain scenes & rocks\n\nClouds encompassed – Villages of red tiles – Poplars & Olives in lovely position\n\nDinner Partridge \n\nWine – Buying – Goats\n\nShave & Hair Cut – Drunken men\n\nShops – Buying – children out of school\n\nPartridge & Mutton\n\nPanagia\n\ntea & British Subalterns gift of mits etc\n\nJoined them afterwards with champagne etc.\n\nSlept in Cottage etc one long bed\n\nA Host of children there\n\nPicturesque - Streets of flag\n\nStores. No verandahs – cleanliness etc\n\nGovenor & Settlement of dispute 3 Brothers\n\nFasting day (Sat) till Xmas 40 days\n\nI omitted to mention change in Imbros. The ravages of the storm could be seen. The Egyptians gone etc\n\nFriday 3rd Dec\n\nI left list of goods to be got at Canteen with Eltham & we made a start for Panaghia about 10 oclock – Lieut Sparrow, Sergt Warner (N.Z. Artillery) Sapper Bates (6th Brigade) & myself. We decided to walk in place of riding Donkeys & I quite enjoyed the trip which proved very exhilerating indeed. Up over the hills – down rocky pathways & ravines. The sky was overcast & the clouds were low – quite enveloping the high peaks & as we passed through them we got quite damp. We passed some Greek hamlets. Built of rough stones but they looked comfortable. Here & there were spaces in the Valleys which were cultivated & the old time custom ploughing with Wooden Planks & oxen could be seen. \n\nIt was a lovely scene as Panaghia came into view. We had just mounted from a valley to a high ridge & down below lay the village on a flat piece of land & beyond it could be noticed the sea. Hills surrounded the place except the opening towards the sea. We had really travelled right across the island. The village was just a collection of rock houses with red tiles & interspersed were the tall Poplar & also Olive trees. The contrast of red & green was very striking after the uninteresting view of trenches one had been used to of recent months on the Peninsula. As we entered the village the path lay through an avenue of Olive trees. The streets were laid with large big stones. We sought out the hotel called the London over which an Englishman who was called\n\nJim presided. It only had one bedroom & one sitting room upstairs & the kitchen was downstairs somewhere. On the landing upstairs there was a little round table to seat 4 & we promptly confiscated this & ordered dinner as our appetites were keen to a degree after the walk which took us 2 hours. The dinner was good just imagine Partridge baked in the tenderest of Mutton or was it Goat & potatoes after which a sweet omelette was served. This with a little wine & fruit finished our feast for such it was after the daily menu over at Anzac.\n\nI was delighted with the Greek children who crowded the principal street. Their quaint little faces smiling with dark eyes was pleasant to look on\n\nI had a hair cut 7 shave after dinner & felt quite refreshed. We went into the few shops that Panaghia boasted & some of our party made purchases. I was content to take notes till the following day & I afterwards found it was the best procedure as I got the best values & low prices – the competition in the little place being very keen. During the afternoon the children came trooping out of School & what memories that brought back to me with their happy gambols.\n\nAt tea we had another spread & several Imperial Subalterns who were staying at the London came along & gave us nuts mandarins & figs & in their own words “Let us have a dam good feed\". We got a few bottles of fiz (Champagne)\n","171":"\n\nWe asked them to join us they said they would welcome us to their table which was in the only sitting room. We had a jolly good time until about 11 PM & then as there was only 3 beds & a sofa we had to go to a cottage & sleep there. Our bed proved to be a long one on the floor. Mattress laid out & we found 3 Tommies already in bed. We were not long in getting into bed but I could not sleep & morning dawned but I had hardly closed my eyes.\n\nI got up and managed to obtain a bucket of hot water from the good housewife. Of course she could not speak English & it took a lot of explanations to make her understand. Again refreshed I made a good breakfast on fried eggs\n\n& then I went out purchasing. I left everything cased up ready to take away after dinner. Dinner over & Partridges enjoyed again I secured 3 Donkeys & went out to get my stores. We had previously ordered 8 Donkeys & the others were to take the balance. I got my Mules loaded up & the others seemed slow so off I went. When once the Mules are loaded they must be on the move otherwise the burden is too much to stand. I had 4 with my cases & I felt fairly well satisfied with my purchases. I had to walk alongside the Donkey as they picked their way over the hills & down valleys & it was dark before I arrived. I must say that the cleanliness of the \n\nGreek Houses impressed me. One scene in the street interested me & it was the settlement of a dispute. It was in the Street & the Governor seemed to be the Arbitrator.\n\nTo-day was the commencement of their fasting extended till over Xmas – the great 40 days fast & early in the morning I noticed a goodly crowd of women folk coming out of the church all carrying their tapers which I was informed they purchased there & carried home to burn before their own little altar.\n","172":"\n\nThis morning Eltham & I got busy & I marked cases & we managed to get transport down to the wharf. I spent the day getting final matters fixed up\n\n& we intended to move things early next day to get aboard if possible. to our surprise the Trawler who had left in the morning came back without taking off any of the cases sent over. Things looked blue for us to get ours away in view of this. We concocted a scheme to try & work ours in on the same boat & to move them early in the morning. I took first watch till about 1 am & instructed Eltham to wake me at 3.45. This he did & we bustled all our stores aboard before any one was moving.\n","173":"\n\nAbout 7 am our Trawler was off and we settled down to the trip. Called at\n\nSuvla first and it was a crisp nice trip. I was tired & slept most of the time. Were off to Anzac & arrived about 12.30 & waited patiently for a Horse barge top come out to tranship our stores to. Unfortunately they were all engaged & only small Pinnaces came & a few cases were taken ashore. I made a bid to get a few on only got 7 on & those I took ashore & left Eltham with the others – the Trawler having to back again to Imbros at her usual starting time. The fatigue party was waiting & I had a little tea with McLaren (Lowland Bty) & left cases with Ammunition Party. I went along to Olly Gunderson to arrange to get some coal put on wagon we passed along\n\nat night. After dark I waited for the wagon & met the horses & Drivers coming back having left the wagon as Pole had been broken. It was the first misfortune since I arrived this time but was followed up later with another one more serious. I telephoned to headquarters about accident & a Limber was sent down. On this I put some cases etc & the balance was carried by the party. On travelling up a narrow road on one of the ridges the Limber was taken in too loose & she turned upside down & nearly rolled down the hill. As the Limber commenced to turn over I let myself go & went down the hill till caught on some roots etc &\n\nthey pulled me up. I was not hurt – only scratched - & I it was a miraculous escape on the limber – was right upside down one of the drivers also went down the Hill & twisted his leg & his horse was down. We had great difficulty in extricating the horses & it was exciting for some time. I was pleased the affair turned out no worse than it was. After a wash when I arrived at Headquarters I felt refreshed again & it was not long before I was in bed in my dug out.\n","174":"\n\nTo-day I went down to Pier to meet Gunner Eltham & we took the cases \n\nashore this time safely. Wagon was loaded up & the broken Pole had been mended during the day. I let Eltham go to his Battery & get a change & wash & I stayed on & had tea with the Lowland Battery Q.M.S. McLaren. When the Horses arrived after dark to take the stores we started on our round journey to Headquarters. We had to unload a number of cases at Victoria Gully & then took the others up to the top of ridge & unloaded there. With a big fatigue Party the cases were carried up to Headquarters. Unfortunately one of the Ammunition Column got away with a case of milk & we had other losses in items getting broke etc\n","175":"\n\nTo-day the Canteen Committee\n\nfixed Prices of items & a list was issued & orders received from the different units. I opened a few cases to check etc\n","176":"\n\nI apportioned the items overordered by the different Units & in the afternoon issued the Headquarters stores. There was a good deal of shelling to-day.\n","177":"\n\nI had to serve the 7th & 9th Batteries to-day & it kept me very busy indeed. There was a terrific Bombardment to-day by the Warships. It was good to hear the guns booming out once again. How they echoed & re-echoed across the Peninsula when their broadsides went forth.\n","178":"\n\nThe Ammunition Column was still to be served & I fixed them up this morning after the Anti Aircraft Gun. There was a good deal of excitement in air last night & to-day owing to a number of guns being ordered away from here & also men. They were to have gone last night but it was cancelled at the last moment. QMS McLaren came up in the afternoon & I went along Beach with him to pay a\/c of Canteen Stores & also to cash cheques for him. He enticed me along to his quarters for tea. I returned about dark.\n","179":"\n\nThis morning I had everything cleared up.\n\nS. McDuley\n\n340 Cathcart Road \n\nGovan Hill\n\nGlasgow\n\nKnown as Sam Lowlands\n\nTennyson said\n\nDead sounds at night come from the inmost hill,\n\nLike footsteps upon wool\n\nI went down & seen Olly late in the evening – Coming back I was challenged by 2 sentries on beach. I was dodging along the bank to get cover from “Beachy\" – who was sweeping the roadway with shell fire. The sentries thought I was up to some move & they hopped out very quickly & had 2 rifles pointing at me. I took it\n\nEnd of letter page.\n\nas a joke & when questioned they were assured & explained that Turks were likely to come on Beach with Boats to get information etc.\n\nEverything seems to point to an evacuation of our present position here. Arrangements are being made to get goods away etc.\n","180":"\n\nIt was overcast to-day & things were a bit quiet. There was a little shelling late in the afternoon & “Beachy\" was active till well on in the evening. I went down to the Lowland Battery and had tea with QM McLaren & SM Burrows. I found SM Scarrott of our Headquarters. He was supposed to have left for Egypt the previous evening with despatches but the boat did not go.\n\nI said “good Bye\" in case our Unit might be called away at any moment. Things are still very unsettled several of our guys have gone away & a batch of men. There are wild rumours that there is to be another landing etc. On hardly knows what to think.\n\nWhile on my way to Ordinance this afternoon I found that there was a free distribution of anything one required. There was about 200 men ransacking the stores there & it was amusing to see the Punjaubies taking away a dozen pairs of boots. The waste was really shameful & I consider a systematic distribution could have been made & ensured that those who required these items got them. In view of the usual red tape formalities to get Ordnance goods in this part when men really required \n\nclothes it seemed very ominous that they were now giving them away – apparently so as to not to have the trouble of taking it away. It seemed cruel to have to leave the place after the severe losses of men & misery we have had. The landing & our attacks were great feats of arms but the mistake made was to keep us waiting till the Troops moved up from Cape Helles. In my notes written in May last I mentioned we were waiting. It has proved a costly wait & a great failure in leadership.\n","181":"\n\nI went to see Olly G this afternoon & on returning to Headquarters I found all our records packed up in cases &\n\nother gear. I was informed I was to be in charge of it & after tea it was all carried down & we were supposed to leave with it late in the evening. For some reason we did not go & I had to sleep on the Beach. Some of our men & another gun went by way of a Transport. My instructions were to stick to the luggage no matter where it went.\n","182":"\n\nIt seems a coincidence. I was guard on the baggage leaving Enoggera & Pinkerba in Sept last year & now I am the same on leaving the Peninsula. I went to the Engineers Store for a little Breakfast with Olly Gunderson & had a wash & also had dinner there later on.\n\nNo barge came to take the luggage and it meant another sleep on the Beach. I waited up patiently to see if any orders might come through but nothing arrived & I went to bed – Bed I call it.\n\nThursday 16th December\n\nI was up late – I saw no reason to get up early & went along to the Engineers Store & had breakfast with Olly G. It was cruel to see the waste of munitions & clothes & stores. It would make one shed tears – A few weeks ago we were on half rations now we can get almost anything. Everywhere goods can be got for the asking. The old 4.7 naval Gun which we had up by the right was blown up – Gun cotton is being placed in various places as mines. Ammunition is being dumped into the sea also\n\nvarious other sorts of ammunition – as you can imagine everything is done under a certain amount of veiled excitement. You can see huge transports in close to shore every evening & men are leaving in small batches from every unit. What a disappointment to think we have fought so hard – lost so many brave men only to give it all up again. I would certainly like to be there at the final withdrawal from the position but fate wills it otherwise.\n\nthe Barge came alongside our Pier at about 7PM & it was a rush to get Baggage on. A lot of it the Landing Officer would not let it come & I am afraid it will be burnt as they will never be able to get it away. Our Barge went alongside a small Steamer called the Princess Abbess & we had to \n\nbundle all our stuff on to it. This took some time & before it was finished the Steamer had instructions to get away & all the blankets kits etc were dumped over the side. We started on our journey & reached Lemnos about 7 next morning\n\nFriday 17th December\n\nOur Steamer went up close to the Headquarters Steamer & received instructions & soon two Barges were alongside – one to take the men from other units off & the other for our Baggage & Party. It did not take very long to get the lot of stuff on her & off we went to the shore & were dumped onto a wharf. There were other Units besides those over which I had charge (the 3rd F.A. Brigade Headquarters 8th –","183":" Batteries & Am Column). Every ones baggage got mixed up\n\nhorribly every time we moved from one place to another and then it was a case of sorting out & seeing what was missing. Once on shore I interviewed the M.L.O. (Military Landing Officer) & we were shifted by means of transport to another wharf & he told me we were likely to leave for Egypt in a few days & the Baggage would not go into the Sarpie Camp – the place where our Units were joining up after coming away in small batches. We made ourselves as comfortable as we could near the South Pier (wharf) as it was called & waited instructions. I sent word to Sarpie Camp & got a few extra men down to guard the Baggage etc. They came down & walked over there & slept for the night. Saw Walter\n\nEast & Hodgens & ohs .\n","184":"\n\nMy sleep was a good one last night notwithstanding I did not appear a welcome visitor in the Sergeants tent in which I had to rest. They tried to crowd me out. After Breakfast I packed up & went back to the Baggage it the Pier. I went to the Canteen & got some tinned fruit etc for the Guard & also got some Beer which I had to manage with a little bit of diplomacy. We fared well in cooking stuff & I had a game of Bridge with the","185":" Batallion Corpl & Corpl Preston & another comrade\n","186":"\n\nIt looked overcast to-day and I am dreading any rain. The evacuation still continues and batches of men are arriving from Anzac & Suvla here every day.\n\nI do not know where our Guns have gone but assume they have gone on to Egypt. We are now living well – cooking good & plenty of extras we can purchase.\n","187":"\n\nI forgot to mention that in getting the Beer the other day I forgot to mention I asked the officer to have a drink & they would not serve me as it was for Officers only. I had to see my officer friend drink his first while I looked on & paid for it. \n\nWhere our Baggage Guard is camped is on the side of the road & we have officers enquiring every day who we are etc.\n\nWe had several officers round our Baggage today making enquiries as to how many wagons it would take to carry our \n\nrecords, Baggage etc away. We could not glean any information as to where we were likely to go – a rumour said Mesopotamia. An officer informed us that everyone had left Anzac & there had not been any attack by the Turks. There was only 3 casualties – one was shot by a Sniper & 2 had sprained ankles. It was a magnificent undertaking to have escaped the position with such a success. The last few in the trenches erected rifles loaded & had a patent firer – a bucket of water dripping into another suspended from the trigger. It was an exciting time for those left.\n","188":"\n\nIt was very cool last night. To-day it rained & we got a bad time in our\n\nour little Baggage Pile. We got some Tarpaulins & it kept the rain off but as the ground was so flat the water hung around. We had to dig trenches to carry the water off. I slept in a tin shed in the yard in the evening to escape the wet ground.\n","189":"\n\nIt was fine to-day & things were a little more comfortable. I recvd my first Xmas Hamper to-day – one from dear Mrs Attwater & a bundle of papers from others. It was a bit cold.\n","190":"\n\nIt was bitterly cold. I went across to Camp & got some Pay & also an Xmas Billy Can sent by \n\nMiss Bailey\n\n57 Taronga Road\n\nE. Malvern\n\nVictoria\n","191":"\n\nTo-day we shifted our Baggage etc round to Sarpi Pier. It was a long journey & we had 2 wagons & I understand we are to go on to a Transport at any moment. We made another covering to sleep in with baggage all around us. I was still a little off color but I was getting better each day. I omitted to mention I had to go to The Hospital here to see what was wrong a few days ago. It was Xmas Eve & a quiet one. On the Harbour in the distance we could hear carol singing but it hardly cheered me.\n","192":"\n\nTo-day was warmer & an ideal Xmas Day. I was indisposed & cold not look at dinner, cooked in the evening. I went up to see Dr McCardle & got a prescription.\n\nNothing would stay on my stomach & I had windy spasms. In the evening our chaps got some whisky & this made me feel a little better.\n\nSunday 26th Dec\n\nBoxing Day passed quietly the 10th Battalion went away from the wharf near where they were camped. Young Lieut. Gray (9th Battalion) came down to see me – Brother of Alick Gray of","193":" Bty – Saw Olly Gunderson at Ordnance when happened to visit there to get a tunic for one of our chaps who had ruined his. Curly McIntire was in charge of the Ordnance but was out.\n","194":"\n\nLast night it rained & in the morning things were\n\nunpleasant but later on it fined & became a lovely day. Several of us got a boat & went out to a store ship & secured a quantity of stores etc.\n\nSaw Tom Watson of D.A.Park. Tents were promised to us etc. Guard of Groves – Clark Corp Preston & Thannett returned to the camp at Sarpi .\n","195":"\n\nFelt much better. Saw Jack Fowles unloading stores from Wagon. A lot of Egyptians left here to-day. I must say my regard for the Australian Aboriginal has greatly improved since coming into contact with the lower order of the Egyptian race. The character & cleanliness of the Australian Native bears more than favourable comparison. It may be that our natives living in \n\n(The scenarios of the world)\n\nthe roughness of nature are more of nature’s children whereas the Egyptian is the one contaminated by the ages & especially now amidst modern surroundings. We are still waiting for orders to sift from this Island of Lemnos. There has again been rumours of Submarines at work.\n","196":"\n\nStill at Sarpi Pier. The weather is delightfully mild for Winter. No news of our leaving yet – an Officer was placed in charge over the different Baggage Parties now camped round the Pier etc.\n\nWent round the Sarpi Camp & visited Tom Watson, S.M. McLaren Groves & ors .\n","197":"\n\nThis morning we received some news to the effect we were\n\nvery likely to leave , things were stirring early & our Artillery Units came down to the Pier. We had everything packed up & ready & about 11 am we moved off the cases etc on to Barge. Then we left for our transport & I was lucky enough to get our cases on board before the Steamer moved off to the Outer Harbour where we layed till early morning. Things were very mixed up on board, & one could not tell what was what. The Tunisian was our Transport & we are reputed to have several distinguished Generals on board. I had a lovely refreshing hot bath & a shave before going to bed.\n","198":"\n\nThe last day of this great year of Battle & misery\n\nI slept well in my cabin last night all from rank of Sergeants up had cabin bunks. It was arranged to have a New Years Eve Concert in the evening & a little liquor was procured for the occasion. The affair went of middling well but I retired early & had a read while in my bunk. It was not a bad journey so far – very smooth & the food air etc.\n","199":" Janbuary 1916\n\nAnother smooth day. We had an escort of Torpedo Boats etc & we were credited with having 7 Generals on board including 2 Lords. A submarine was sighted & it created a good deal of excitement but no Torpedo was fired at us & she got away. It was wonderfully calm. Had good dinner & returned early.\n","200":"\n\nwe arrived in\n\nAlexandria Harbour about 8am. It rained during the evening. The water in the Harbour was alive with gulls. How they soared & chased each other round & round to their merry little squeak. The Tunisian anchored & a rumour is current on board that a Transport called the Sultana ? was submarined just behind us last night. We had a lot of waiting to do as usual before we got any instructions. At last we got ashore with our baggage etc & then we had to wait till well on 8 PM before we could get a train. I saw Col Rosenthal & also young Charlie Fortescue who had both returned from England the same day as we arrived in Alexandria. We bundled our stores etc on to the train in the baggage van & I and my party travelled with it. (Nigger & Whisky for 4\/6 – Water) It was a tiring\n\njourney & it was about 4 in the morning.\n","201":"\n\nIt was about 9 oclock when Transport came for the stores at Tel-el-Kebir Station where our camp was situated. The place is on the Suez Line about 60 miles from Cairo – Quiet & a lovely place. I arrived where our headquarters was situated and everyone was pleased to see that the records etc were safe etc.\n\nIt rained to-day - very welcome after the windy sandy blowey day. We are back once more amidst the sand & desert etc.\n","202":"\n\nTo-day I reported back to the 7th Battery for duty & I was put in “D\" Sub & I did not do much just nosed round to\n\nsee how things stood. Our horses were there all looking well. I went round & greeted the old Drivers. How pleasant it was to meet old comrades again.\n\nI must say I did not like going back to a Bell tent with about 10 men in it its all in the game.\n","203":"\n\nI applied for leave.\n\n"}}