{"Document Name":{"0":"Diary_0151","1":"Diary_0151","2":"Diary_0151","3":"Diary_0151","4":"Diary_0151","5":"Diary_0151","6":"Diary_0151","7":"Diary_0151","8":"Diary_0151","9":"Diary_0151","10":"Diary_0151","11":"Diary_0151","12":"Diary_0151","13":"Diary_0151","14":"Diary_0151","15":"Diary_0151","16":"Diary_0151","17":"Diary_0151","18":"Diary_0151","19":"Diary_0151","20":"Diary_0151","21":"Diary_0151","22":"Diary_0151","23":"Diary_0151","24":"Diary_0151","25":"Diary_0151","26":"Diary_0151","27":"Diary_0151","28":"Diary_0151","29":"Diary_0151","30":"Diary_0151","31":"Diary_0151","32":"Diary_0151","33":"Diary_0151","34":"Diary_0151","35":"Diary_0151","36":"Diary_0151","37":"Diary_0151","38":"Diary_0151","39":"Diary_0151","40":"Diary_0151","41":"Diary_0151","42":"Diary_0151","43":"Diary_0151","44":"Diary_0151","45":"Diary_0151","46":"Diary_0151","47":"Diary_0151","48":"Diary_0151","49":"Diary_0151","50":"Diary_0151","51":"Diary_0151","52":"Diary_0151","53":"Diary_0151","54":"Diary_0151","55":"Diary_0151","56":"Diary_0151","57":"Diary_0151","58":"Diary_0151","59":"Diary_0151","60":"Diary_0151","61":"Diary_0151","62":"Diary_0151","63":"Diary_0151","64":"Diary_0151","65":"Diary_0151","66":"Diary_0151","67":"Diary_0151","68":"Diary_0151","69":"Diary_0151","70":"Diary_0151","71":"Diary_0151","72":"Diary_0151","73":"Diary_0151","74":"Diary_0151","75":"Diary_0151","76":"Diary_0151","77":"Diary_0151","78":"Diary_0151","79":"Diary_0151","80":"Diary_0151","81":"Diary_0151","82":"Diary_0151","83":"Diary_0151","84":"Diary_0151","85":"Diary_0151","86":"Diary_0151","87":"Diary_0151","88":"Diary_0151","89":"Diary_0151","90":"Diary_0151","91":"Diary_0151","92":"Diary_0151","93":"Diary_0151","94":"Diary_0151","95":"Diary_0151","96":"Diary_0151","97":"Diary_0151","98":"Diary_0151","99":"Diary_0151","100":"Diary_0151","101":"Diary_0151","102":"Diary_0151","103":"Diary_0151","104":"Diary_0151","105":"Diary_0151","106":"Diary_0151","107":"Diary_0151","108":"Diary_0151","109":"Diary_0151","110":"Diary_0151","111":"Diary_0151","112":"Diary_0151","113":"Diary_0151","114":"Diary_0151","115":"Diary_0151","116":"Diary_0151","117":"Diary_0151","118":"Diary_0151","119":"Diary_0151","120":"Diary_0151","121":"Diary_0151","122":"Diary_0151"},"Date":{"0":"unknown","1":1580.0,"2":1581.0,"3":1582.0,"4":1583.0,"5":1584.0,"6":1585.0,"7":1586.0,"8":1587.0,"9":1588.0,"10":1589.0,"11":1590.0,"12":1591.0,"13":1592.0,"14":1593.0,"15":1594.0,"16":1595.0,"17":1596.0,"18":1597.0,"19":1598.0,"20":1599.0,"21":1600.0,"22":1601.0,"23":1602.0,"24":1603.0,"25":1606.0,"26":1607.0,"27":1608.0,"28":1609.0,"29":1610.0,"30":1612.0,"31":1613.0,"32":1614.0,"33":1615.0,"34":1616.0,"35":1617.0,"36":1618.0,"37":1619.0,"38":1620.0,"39":1621.0,"40":1622.0,"41":1623.0,"42":1624.0,"43":1625.0,"44":1626.0,"45":1627.0,"46":1628.0,"47":1629.0,"48":1630.0,"49":1631.0,"50":1632.0,"51":1633.0,"52":1634.0,"53":1635.0,"54":1636.0,"55":1637.0,"56":1638.0,"57":1639.0,"58":1640.0,"59":1641.0,"60":1643.0,"61":1644.0,"62":1645.0,"63":1646.0,"64":1647.0,"65":1648.0,"66":1649.0,"67":1650.0,"68":1651.0,"69":1652.0,"70":1653.0,"71":1654.0,"72":1655.0,"73":1656.0,"74":1657.0,"75":1658.0,"76":1659.0,"77":1660.0,"78":1661.0,"79":1662.0,"80":1663.0,"81":1664.0,"82":1665.0,"83":1666.0,"84":1667.0,"85":1668.0,"86":1669.0,"87":1670.0,"88":1671.0,"89":1672.0,"90":1673.0,"91":1674.0,"92":1675.0,"93":1676.0,"94":1677.0,"95":1678.0,"96":1679.0,"97":1680.0,"98":1681.0,"99":1682.0,"100":1683.0,"101":1684.0,"102":1685.0,"103":1686.0,"104":1687.0,"105":1688.0,"106":1689.0,"107":1690.0,"108":1691.0,"109":1692.0,"110":1693.0,"111":1694.0,"112":1695.0,"113":1696.0,"114":1697.0,"115":1698.0,"116":1699.0,"117":1700.0,"118":1701.0,"119":1702.0,"120":1703.0,"121":1704.0,"122":1705.0},"Entry":{"0":"\n\n","1":"\n\nI am starting this as the train was moving along. We have just (10 to 7 p.m.) steamed out from Codford bound for the front. In the carriage are Ferns, Merrett, Bennett-Caten, Aubrey & myself, the 5 sergeants who sailed from Sydney on","2":" last with the 10th of the 56th Bn. Aubrey won the billiard tournament at the sergeants’ mess at the camp before leaving. It started raining before we got to Westbury. Passed the huge white horse on the hill near Westbury, cut out of the chalk hill. We switched to another line at Kensington, London, & rattled past houses about 10pm. & window blinds were pulled aside, women waved to the soldiers, off to the front to try & stay the Hun’s advance. Had a bit of a sleep in the train, we got out at Dover Harbour station at 20 to 2. Monday1 April We marched through the streets of Dover for a devil of a distance, or it seemed so with this infernal load up. At last we arrived at a lovely set of buildings, evidently boarding houses or flats before the war\n\nput into different rooms. We five got in a room together at 2.30 a.m. Lay down on the floor, I had a blanket rolled round my pack, but didn’t undo my pack, as I knew Id have a job to get it together again. Lor’, it was cold lying on the floor. Reveille went at 5 a.m. so we didn’t have long. Breakfast was an awful mess-up, & very few chaps got anything out of it. There were crowds of Australians lined up in fours, & only two small mess tents, they waited patiently for a long time, then pushed in with a crush, most got a drink of tea but very few anything to eat. Luckily I put some things out of Elsie’s parcel last week in my haversack, & I had a tin of salmon for breakfast. We fell in early & marched through the streets of Dover to the wharf. There were a crowd of Tommies there waiting to go across to France. We got on a boat called the King Edward, & 4 of them choc-a-bloc with soldiers, went out through the nets accompanied by destroyers. It was a lovely day & it was no time before we saw the coast of France & \n\nhad disembarked at the historic old spot of Calais. We wore life-belts on the run across. I can hardly believe I am in France. Oh well, we are right at the serious part of the business now, & a big gun firing near where we landed gave a chap a nasty reminder he’s at the real thing now. On stepping ashore there was a Red Cross train waiting, filled with wounded from the present big battle, about to go across to \"Blighty\", where we had just come from. We marched off with this awful load on our back, & wondering how far we would have to lump it. Passed a camp of Chinese who do labour duties, they were looking through barbed wire fences like monkeys. Imagine trying to control them in action, eh, wouldn’t they yabber? Saw French soldiers in all colored uniforms, Belgians, Scotties in their skirts & bare knees. Our packs were feeling very weighty, & shoulders getting pinched, when we had a halt, & immediately flopped down on the ground for a rest, near a hospital, where we saw some Aussies come out for a yarn.\n\nCalais has some awful smells in the streets. Then our hearts brightened at the sight of some well proportioned fine looking Belgian nurses at a Belgian hospital. On we went, & at last arrived at the Overflow Camp & flopped down in the sand about 1.30. An officer said we’d be shown our tents as soon as some Tommies had vacated them, & that they would get dinner, which would be ready about 4 p.m. As several have had no breakfast, they must be famished. I ate a tin of sardines now, am glad I brought some tucker with me. The tents & sand everywhere put me in mind of Egypt. There are crowd of troops here, just for a day or so on their way from the ship up to the line. Scotties, Lincolns, Kings own, Inniskillings, Australians, & all together; the 5 of us actually struck a tent on our own again. Dinner was a scramble, instead of the hot dinner we thought we’d get, it was bully beef, bread & jam & tea, but nice white bread & sweet tea, both better than I \n\never had in England. There were hundreds pushing outside the mess huts trying to get in, crowds of chaps of all regiments; finally I got in, enjoyed the drink of tea immensely. Aubrey, Merrett & I went in to Calais after tea, walked a couple of miles to the tram terminus & caught a tram, women drive the trams here. I was standing up in the little part in front where the driver is, among about 10 French & Belgian soldiers, & this lady drove the tram & collected the fares in front too. A woman also collected the fares inside. It is quite a large town, the theatre being a very fine building. The thing one notices most in the streets of England & France is the absence of verandahs, and no posts on the footpath. The sanitary arrangements in the main streets in Calais would stagger an Australian. The streets were full of soldiers of all sorts, Frenchmen in all colors & many old men among them, Belgians, Tommies, Scotchmen in their tam o’ shanters, & short skirts & bare knees, the Scotties are my favorites, they\n\n \n\nmust be jolly cold these nights with the wind whistling up their bare knees. We went into a post-card shop, & had great fun trying to speak to the pretty, smart, well-dressed French girls. There is a great charm about their manner, there’s no doubt, quite different from our English folk. Windows were smashed in many parts of the town in air raids, I suppose. Many places bore \"cafe\" as a sign, & contained soldiers drinking beer mostly. We looked for a restaurant, but it had just gone 8 o’clock & everything closes at 8, the women simply made grimaces & said \"huit heures, impossible.\" We looked in a pub door as a last resort, but we were greeted with a shake of the head, the woman said \"mange\" – I knew that meant \"eat\", & said \"Oui\" & she pointed to a door lower down, we went in, & luckily struck an excellent meal with \"vin blanc\", very nice to drink. The bread was a treat, nice white bread we never saw in England, & no meat cards necessary. An English\n\nsoldier & 4 French people at a corner table were very merry, as the dinner & wine progressed. One girl was stuffing a paper serviette down the neck of the men. We came out at 9, the trams had stopped running & all lights were out & the town in darkness, & we had a very long walk, could follow the tram line luckily as there was nobody about to ask the way, nor would they have understood us. Got \"home\" about 10.30 alright, Aubrey, Merrett & I slept together, I was in the middle & kept pretty warm, but the other two complained of being cold all night. During the night, we were awakened by the roar of the guns, an air raid was on by the Huns, & the guns were booming. Through the door of our tent I could see the flashes of the bursting shells from the French guns & search lights playing about the sky trying to locate the enemy aeroplanes. One loud explosion fairly shook our tent, & it evidently didn’t drop too far away. After some time the roar of the guns ceased, but what happened I do not know.","3":" Today is Elsie’s birthday. Heard Reveille go at 6, & Lincolns being fallen in to draw ammunition & waterproof \n\nsheets ready to move up. Had some breakfast very late, got in with the last batch without any rush. A nice drink of tea (with plenty of sugar) went well! Had a wash, cleaned my teeth & had a shave & felt much livened up. Watched an aeroplane rise up from the aviation ground nearby, & fly around – my word, he was a beauty, turned head over heels, corkscrewed round, fired his machine gun, & flew low over our tents home. Had a good dinner at the sergeants mess, just pinned up the stripe I took down in England, & went in with the other 4 chaps, it was nicer having your tucker brought to you on a plate, than being pushed & squeezed to get in early in the crush. Wrote short letters to mother & Elsie today, but they will be censored & I can’t say where I am. The others went in to Calais after tea, but I didn’t fancy the 5 mile walk back to the Overflow Camp so didn’t go in, saw the town last evening. I went up to the Y.M.C.A. in camp, talk about a crowd! There\n\n \n\nwas a long queue lined up trying to get to the refreshment counter, & as long a queue filing along to a table where a woman was handing out a sheet of paper & envelope. Raining tonight & the Huns didn’t make any air raid. Spread the blanket I drew at this camp on the floor, & had my own blanket & waterproof sheet over me, took off my boots, puttees, socks, tunic & top pants, but it was jolly cold in the tent during the night, especially on the feet.","4":" Reveille went at 6, we didn’t get up in our tent till 8. We expected to move on today, but no word came. Some of the Jocks, Irishmen & Tommies marched out, but thousands of Tommies came in, & I’m blowed if I know where they’re putting ‘em all. I’d like just to know how many troops must have come across from England this last fortnight, the camps there must be pretty much emptied. The Jocks take my fancy most of all the boys here, with their tartan skirts & tam a shanter caps. There is\n\na camp of \"Wacks\" ((girls) W.A.A.C) across the road. Had an easy day, ate well at the sergeants’ mess, the extra stripe is handy, & saves a lot of pushing about, & lining up with the different groups at the men’s mess huts. Had a sleep in the tent all the afternoon. More Tommies arrived tonight, & there weren’t enough empty tents to put them in. Poor devils asked us for a drink, they had been in trucks for 22 hours coming from Le Havre, & had had 3 biscuits. Turned in early & had a fair sleep, all things being considered – it was pretty chilly again.","5":" Our lot moved on this morning, the reinforcements for the 3rd, 4th, & 5th divisions marched out. We drew 120 rounds of ammunition & rations, so have that & the waterproof sheet in addition to the load we left England with. Talk about heavy, it was a God-send when the two halts came, & we could lie down & ease the weight on our backs. We marched 2 or 3 miles through the streets to Fontinette’s station, where there was a canteen \n\n& we could buy a drink of nice hot tea. Got into horse waggons, there were about 40 of the chaps in the waggon Aubrey & I were in. The train went slowly along. I saw women loading sand, & wheeling it in barrows at one place with men - poor old France is suffering alright, & one never sees an able bodied man anywhere, they are all at the front fighting the invader. We passed on through Etaples, where there was a huge camp, Tommies & New Zealanders, also hospitals, & nice Red Cross trains. I am writing this as the train is rolling on, hence the scrawly writing. The country is lovely, all is cultivated, the lines of trees are dead now, but when they are in leaf it must be a picture. Passed many small villages & farm houses, & our chaps waved & threw Kisses to the French women. All the trucks on the train are marked \"Hommes 40 Chevaux 8\" so 5 poor soldiers are equal to 1 horse. The fellows looked\n\nthrough the open doors of the waggon till heavy rain about dusk made them shut the doors. Then we tried to sleep, & there wasn’t half a crush! I was pretty right, curled up on the floor & had a pack to lean my head on. Some of them had other chaps boots as a pillow, & when they moved they got a kick in the face. I was having a nice sleep when a voice outside roared \"All 3rd & 4th Divisions out here.\" It was pitch dark & raining, luckily a chap in the trucks had a candle, & we found our respective rifles & equipment & gas respirators. Turned out in the rain & muck with these infernally heavy packs on, & there was the usual army arrangements – no one to tell us what to do or where to go. The chaps swore & counted the army out & roared out \"What are we here for?\" We stood or leaned about as best we could; knowing what the Army is, I took things easy, leaned my heavy pack against a cart & rested the best I could. Aubrey, like the big goat he always is, rushed round looking for officers \n\ndespite the fact it wasn’t his pigeon. It was lovely, no one seemed to be there in charge & none of us knew where to go. Finally after many calls in the dark \"Where are the 18th, hello the 48th we moved down the street, & an old W.O. with one of the battalions bustled round, & we were put wherever they could shove us into barns & lofts. Aub, Barney Davis & I slept on top of a waggon on some bags of oats. Took off my puttees, boots & socks.Friday","6":" The sheep in the stable woke us up early with their bleating there are also cows & horses in different stalls & fowls & pigeons feeding in the straw. Altogether there is a very \"stably\" \"strawey\" smell about, more farmlike than warlike. Had some of our bully beef & bread (that we carried) for breakfast, also got some hot water from some Tommies, & made tea from the ration we carried. The name of the village is Canaples, & I hear it is 25 miles to Divisional Head quarters. I can’t imagine we are so close to hellish war. If we have to march \n\nthat far with this load up. I’m afraid a few will drop out. Drew some more bully beef & biscuits this morning. At 10 o’clock we fell in with our big load on in the slushy street, & of course stood there for half an hour, that is the killer in the army, the way they mess you about. I took mine off & put it in the footpath. Finally we set off through the slushy streets, lor’ talk about an awful load, it nearly cut one’s shoulders in two where the braces are. We went about 3 miles, the last str&ch up a hill & many of the boys dropped out by the wayside, but I stuck it. Then we entered a village called Bonne Ville, & we were allotted to different billets in the village. I struck a very decent spot, an old hay shed with straw on the floor, that about 12 of us were put in. The roof has some holes in, but I don’t think it will rain tonight. We dropped our beloved packs on the floor, & walked \"up town\", had 2 glasses of vin rouge at a cafe, every place seems to be either a cafe or an estaminet. Came back to our \"billet\", & \n\nSmith boiled some water on the stove of the house near our hayshed, I went in to see if the woman would fry us some potatoes, & it was funnier than a circus, trying to make a bargain. She couldn’t speak English, I could speak enough French to tell her what I wanted, but when she rattled out her answers, she had me. I told her we wanted fried potatoes for 4. She poured water in a saucepan to imitate boiling the spuds, & pointed to the fat in the pan & said it was \"tres chere\", but finally I got her to cut up some spuds and fry them for a franc. To show how well we made ourselves understood by each other, I learned that her husband is wounded through the head & in hospital at Paris, she is 32 years old & has 1boy & 1girl. We had bully beef, fried potatoes & tea. In the stall next door some French kiddies are playing, & fowls are scratching on the straw in our billet. We made some tea again at tea-time. These places in the French villages are funny – the barns surround the houses, & cows & fowls & pigs are fed near the front door, & live\n\nin the house, & a heap of manure lies in front of the house. I had a yarn to the French woman & the kids. Some of the episodes were funny. One chap said to the woman whose barn we occupy \"Bon soir, Madame\", then \"you needn’t say anything that’s all I know.\" I must mention one other incident. A woman was chasing a fowl that got away, & an Australian joined in & caught it. The woman was jabbering in French, & throwing her arms about, & the Australian thought she wanted it killed, so he wrung its neck. She did go crook then, it turned out the hen was clucky & she wanted to catch it & put it on some eggs. Turned in at dark, as there was nothing to do, & slept in on the straw till 7a.m. \n","7":" Fell in in the street in morning, while a sergeant lectured on the gas mask, & we looked to the different points he mentioned to see the respirator was O.K. It’s a cheerful war, there’s no doubt, Fritz is throwing \n\nmustard gas now as well as the poisonous stuff, & it blisters the flesh. Drew more rations today, made tea & ate bully beef, bread & biscuits. The village of Bonnevllle contains nothing but barns that house troops, cafes, a few houses, a fine church, & mucky streets. Were issued with jam, cheese & milk today, which went well. We got orders to move on this afternoon, & at ¼ to 4 once more set off along the road with our heavy load up. Marched 4 kilometers through very nice country all under cultivation, saw 15 aeroplanes up together, they looked like big birds moving gracefully up in the sky. We came to a big village called Candas & our unit, 100 men for the 13th Bn. were billeted in a big barn, in the straw once more. There are a lot of Australian troops here, & motor lorries in dozens are passing continuously through the town. Many of the inhabitants are leaving with their belongings, poor unfortunate women, as the Germans are still advancing & they are afraid they will take the town. Well in this town, I struck one\n\nof the best chaps I’ve ever come across, an English Lance corporal. Aubrey was asking a chap at the Y.M.C.A. if he could get any hot water to make some tea, & this lance corporal, overhearing his question, went over to him & told him to go along to where he was, & he’d fix him up with tea & butter. He told Aub to bring me too. We went along, & talk about comfortable! there are some good jobs in the army anyway. This lance corporal & an Australian corporal have a room to themselves in a French house, have comfortable bunks, a table, fireplace & coal fire, &c. They are attached to the Purchase Dept, buy hay from the French farmers & have it trucked up to the line for the horses, & such work. Well this English lance corporal made some tea for us, gave us sugar, butter & bread, & boiled some water for us to have a good wash. Of course, he could do this easily, as they are so comfortable here, but still he went out of his way in the crowded Y.M.C.A. to speak to Aubrey, & no woman could have \n\ndone more for us. We toasted the bread & enjoyed some toast & butter. Oh well I, suppose this will be our last stop in safety, as the centre of the German advance & fierce fighting is not more than 20 miles from here & our next move will probably be up to the line. The corporal told me a lot of Australian wounded passed through here from the trenches today. I wrote up to here in my diary in their crib, & then (at 9pm) went back to my hayshed to sleep. It was raining hard & I was glad we have a warm shed with a roof on. Slept well in the hay.","8":" Got up at 8. There was a parade at 9am, & a sergeant asked me what sort of a clerk I was, & said to report at Brigade orderly room. Everything was chaos as the troops have only just arrived, & there are no headquarters or anything yet. Did nothing but make a nominal roll of 13th Bn all day & there’s nothing to do, so I suppose I’ll go on parade instead tomorrow. Aubrey was buzzing round working as usual, & was put on\n\nas brigade quartermaster sergeant – he draws the rations for the 4th brigade from divisional Q.M. and issues them to the Q.M. of 13th, 14th, 15 & 16 Bns. His good friend, Eldridge, he collared as assistant & they have a billet to themselves in a hayshed at an estaminet, so I shifted my diggings to their crib – nothing like making yourself at home in the army. The people here are bonza & I had a ripping time. While Booey & Eldridge were using the tucker I put some water on the stove to boil for our tea. There were two girls, 29 & 27 ( I always ask them \"quel age\") & a very kind old lady & 2 or three other nice women, talk about fun, I got on splendidly rattling out French. About 8 p,m. I came in to the room to write up my diary, they were all just sitting down to tea, as the estaminet is open to the soldiers from 6 to 8, I suppose they leave tea till late. When I entered the room behind the bar, there was the family sitting down to tea, there was Georgette, the pick of the bunch, Bertha, both of whom are engaged to soldiers\n\n one an English soldier & one French, Thea, 2 old dames, a boy & 3 men. I asked if I was \"de trop\" but received a huge welcome of \"No, tres bon monsieur\" & was handed a chair. They also said to call my camarades, so I called Booey & Eldridge, & the happy little party sat round the room. I’d have given anything if they could have seen us at home, as they will be worrying about us, & we are as happy as school kids. I’m getting on a treat with the French yabber, & it’s a God send to be able to speak enough to have a chat & some sport. They gave us each a small cup of coffee after their meal (strange to say the French don’t drink tea much at all) after which some of the village folk left, evidently they were visitors. Booey combed the two girls hair & platted it, much to their amusement. I was last to leave, as I was writing my diary, asked Georgette if she would kiss me Good night, but she was too bashful. I said \"Peutetre nous partons demain\" amp; she agreed \"si vous partez demain \" but alas, as it turned out next morning we got\n\nINSERT\n\nI wrote their names on the front of this diary, also address, as it will remind me in the future of our stay in France\n\nsudden orders to leave, & Georgette being a teacher at the school, I didn’t see her to say good-bye.","9":" Don’t they mess you about in the army, eh! Blowed if we didn’t get orders to move on again at 10\/30 a.m., just as we are nice & comfortable in Candas. We are like a travelling circus, the way we are moved on every day or two. Booey, Eldridge & I slept on the loft in the straw. I could hear the mice moving about in the night. Slept well till towards morning, when as usual it turns that cold, it wakes me up. Through the night I could hear the dull roar of the guns where the battle is raging. It was so dark in the barn that we didn’t get up till 9 am. – madame said \"bon jour monsieur, tres dernier\", she was right, we were late. We boiled some water on their stove (nice & convenient, isn’t it?) ate our rations of bully, bread, cheese & jam & then word came to be prepared to move on at 10. Packed up & said goodbye to madame, the old lady & Berthe - unfortunately Georgette was at the school, won’t she be sorry when she comes down for dinner, eh? We\n\n told madam we had to go, she said \"parti no bon, Candas tres bon\". I said \"oui\" & inwardly cursed the Hun. Said good-bye to the French village folk, they said \"au revoir, monsieur\", Bon sante,\" and once more we fell in with this awful load like a pack-horse, & set off in the pouring rain for the town of Vignacourt where we arrived at 2.45 p.m. after a march of about 6 or 7 miles in the mud & rain. Passed through several villages, & blowed if we didn’t go through Canaples on the way. As we arrived there by train last Thursday night, it shows the way they mess you about, we’ve been marching about France with a pack up since then. The only way in the army is not to give a dam about anything, or care what they do, & then nothing worries you, otherwise their methods would drive you dilly. We had several halts by the wayside & sat on the wet ground. Passed some Indians carrying picks & shovels & wrapped up in their waterproof sheets – a more forlorn, miserable, fed up crowd of human beings one never saw. The pack was a fearful weight, & the Braces cutting our shoulders, when at last we reached Vignancourt. There \n\n the same old thing again, shoved into billets, 80 were put in a big shed. I struck a sort of room with a board floor for a change, 24 of us. I’d much rather a hayshed & straw. The fellows boiled some water in their mess tins, made tea, we got out our bully & bread & had dinner, 3 p.m. Boots & puttees all mud, wonder when a chap will have the pleasure of polishing his boots among pleasant surroundings away from war’s proximity again! Wrote up my diary after eating, then took a walk up town, & got a shock when I saw trenches dug through the town & up the hill. It looks as if they expect the Hun to drive us back further still, & are getting trenches ready to fall back on. I went into a cemetry & had a look at French graves, some were very fine stones & vaults. Came back to the billet, & talk about rough! some of our chaps had pinched a fowl, potatoes, carrots, & had the \"chook\" on boiling. An old woman spotted another cove taking sheaves from the loft to put on the board floor, & said \"No bon\" & took it from him, but she would have said more than \"No Bon\" if she knew her fowls had been reduced\n\n in numbers. French villages are all alike, dirty, & have barns galore round the houses, with fowls & animals at them all. However the barns are mighty handy to sleep in, & I don’t know how we’d fare without them in the wet & cold. Rations were issued in the evening, & it was comical the size of the piece of cheese & margarine a chap got to last tomorrow. Had a good sleep, put 2 sheaves of hay on the floor, & lay my waterproof on that & curled up in blanket – we were all tired after our long tramp. Tuesday 9 April There was supposed to be a parade at 7a.m., but very few of the chaps got up. Parade after breakfast fell in at 8.30, they called the roll in the street & left us standing in the slush for an hour, & I’m blowed if we didn’t go for a route march till 11.30. Suppose they don’t know what else to do, but they could let us have a spell instead of route marching, as we’ve lumped the pack enough lately. The 1st Division Artillery arrived this morning & I saw the 8th Battalion marching through the slushy streets. The eternal procession of motor lorries continues& Goodness knows where all the petrol comes from. Big movements of our troops must be on. The rumble of the\n\nbig guns in the distance was very distinct this morning. These villages don’t contain any lovely females, all the women seem to be old & fat, with big hips & one rarely sees any girls. The parts between the houses and the barns where the animals are housed & hay stored, is all muck & filth, manure &c. & the streets are muddier than Codford, & that says a lot, but the heavy military traffic goes unceasingly. We tramped out about 2 miles to a paddock & had our rifles inspected & then came back again – its a great life alright. I struck a couple of Tommies who are cooking for an officer & a few of the staff – they belonged to the","10":" Corps, but it was cut up by the Germans, & now they are with the Australians. I had a friendly chat (nothing like being with the cooks) & they gave me some steak & onions & potatoes for dinner, tres bon it was too. The roar of the guns in the distance can still be heard like far off thunder & it kept on during the night without a break.","11":" Slept pretty well, on the floor with hay & waterproof \n\nunder me, & blanket over. Acted as 4th Brigade orderly corporal today, only had to parade the sick up to the doctor. Waggon after waggon of Tommy artillery passed through the town all the morning, & crowds more Australians, including many officers, arrived in the town. I wrote a long letter to mother, mentioned a few villages, but hope the censor isn’t a \"nark\". \n","12":" Sick parade was at 7 am. up at the top of the street, so I had to get up at 6.30 to march ‘em up – the early hour had the effect the doctor wished & kept some of the malingerers off. I saw Fisk one of the old 3rd Bn. lads, in the street today. – I saw him last at St. Patrick’s Hospital, Malta in 1915. At night we saw some stirring sights – a German aeroplane must have been up, as from the door we could see the flash of bursting shells in the sky, & 8 searchlights playing about the sky, but we couldn’t see the enemy ’plane – then some of the Allies’ ’planes tore along with two bright lights showing but it didn’t seem as if they got the Hun, as the searchlights still played about the clouds & the burst of shells lit the cloudy sky \nlight\n like lightning. Occasionally a loud roar told that a bomb had fallen. Whether\n\nit was on some village or the trenches, I know not.","13":" Col’s birthday, eh! Once more we packed up, loaded our poor backs like camels, and marched out of Vignacourt, we had quite a long stay here, 4 nights. It was a march of about 6 kilos, an absolutely ideal day, quite the nicest I’ve struck so far on this side, bright & sunny & blue sky. We lay down in a field by the roadside for 3 hours, as arrangements had not been completed for allotting billets to the different units. All along the road the country was lovely, and all cultivated, Lor’ Knows who did the ploughing, as few men are ever seen. Well in the field where we waited, was one of our aeroplanes which had to descend owing to engine trouble, so the airman asked for a guard to look after the ’plane. I had a good look at it, the first time I’ve seen one close. We had a snooze in the lovely sunshine for a couple of hours after partaking of bully beef for dinner, then moved into a town called Berteaucourt, where the usual mess-up occurred, fellows being put into barns, sheds &c. some all mud on the floor, but the chaps soon\n\n got sheaves of straw for those billets where there weren’t any, & settled down. I struck a barn of straw with about 10 N.C.O’s, including the 13th Bn. Q.M.S., so we have plenty of tucker, nothing like being with the quartermaster. Aubrey & Eldridge are as usual looking to brigade rations & a place to issue them – I am disgusted beyond words Aub is let in for that job, he is always on the run round as soon as we hit a new village – he’s the best fellow to other people, & the worst to himself I’ve ever known, & it’s rotten to see a good hearted cove imposed on in the army. It makes me wild to see him put his neck in the rope for work when paid sergeants hang back & loaf, while he has all the work & worry, & only gets abuse. Why he hasn’t the savvy to look after himself & let others rip, as everyone in the army does, beats me. It is a lovely clear day, & just the one for flying. In the afternoon, 7 of Fritz’s aeroplanes could be seen away up in the sky, & the roar of bombs they dropped was heard not far away. We watched them above us at a great height & I wondered why no Allies’ ’planes went up to fight them. The village people got a fright, & were lucky. In the field where we were waiting an hour or two before, a bomb \n\nkilled a farmer & his two horses. His body was brought in to the town in a cart. Talk about the irony of fate, the aviator who had to descend, was himself struck in the leg by a fragment & wounded, but the guard round his ‘plane weren’t hurt. French soldiers took our place in Vignacourt today, when we left & I heard a lot of them were killed & wounded by bombs, but it may not be true. The French are taking over the part defending Amiens with the Australians – our chaps never yield any ground, but the Tommies seem to be letting Fritz through badly lately. At night, it was clear & starlight, & aeroplanes were humming overhead, but no bombs dropped in Berteaucourt, thank goodness. Slept quite warmly in the straw tonight. \n","14":" It is 5 years today since Father died, how the years go by! Wish we were driving the Germans back instead, & the war was about ending. Got up at 6.30, & attended to brigade sick parade, the same malingerers seem to attend each morning. Had a stroll round the town in morning, soldiers are billeted in every barn & the place is full of Australians. I saw a little stone building, evidently a shrine, it was locked up, but through the bars could be seen an altar & a \n\nfigure nailed to the Cross, also a figure of a priest with a book in his hand. Sgt Merrett & I walked out to the field to have a look where the bombs dropped. There was a poor old grey horse lying dead with a wound in the top of his head, and altogether 7 holes from bombs, evidently one from each ’plane. Three were very close to where the English ’plane was, but it has been taken away now. Had the Germans came over an hour sooner, they’d have caught us nicely at that spot. I had a look at the church & cemetery in the town in afternoon. It seemed funny to see a clock in the church; they go in for a lot of statues, there were 3 of Christ hanging on the Cross, dismal looking things with blood painted as flowing from the side, & where the nails penetrated the hands & feet. There were other figures, & some huge candles. In the cemetery, were some old tombs & gravestones, but over many graves was a sort of little house with glass front (resembling a bird cage) inside which were wreaths & the name of the person buried. The human heart was represented on several also. At the billet where I am now is a bonza little girl of 13 named Angele, she is a great little kid, very smart & witty & can speak a few words of English. She pointed to a very\n\nfat sergeant, & said \"Plenty bully beef\", & she always calls him \"Bully beef.\" Whenever I ask any French girls their name, they always just give the first one, no surname. In the afternoon Merrett & I walked down to the next village, St Leger. Merrett is brigade orderly sergeant & I am brigade orderly corporal, it is a sweet job, nothing to do, & better than falling in for drill. Most of the blokes are stoney broke & yelling out for pay, but I saw a crowd by the roadside playing two up with what they had left. Actually saw a shop in St Leger, the first one, except for cafes & estaminets, I’ve seen in these villages. The woman at the billet we are in now is a spinster aged 48, & has Angele as a domestique for company. She milks a cow, which occupies a stall near ours (they have no paddocks for animals like we have, but stable them) has some fowls (there are fowls at every house) some rabbits & a pig, and sells milk & eggs. We boil the water for our tea at her fireplace; of course we eat our issued rations. I was sitting in the kitchen at night talking to the kiddie & madame, when 4 girls bounced in for some milk, about 21 each. Got quite a shock, hadn’t \n\nseen anything young & tasty in the town, most of the villages only contain old women. Two looked very nice, my French combined with the little English they knew, enabled us to have a talk & laugh for a few minutes before they went. Slept in the barn fairly \"comfy\"\". \n\nSunday 14 April\n\nUp at 6.30, took the Brigade sick along to the Divisional orderly corporal, & at 7a.m my day’s job was done. A chap & I went to church in morning to see what a French service is like, & it is very novel to us. The choir boys wore a red cloak & small red cap, & the priest rattled out the sermon in French, too fast to understand it, though he was a good speaker. A sad part was the sight of almost every woman in mourning, nearly all wore deep black & some had long black veils nearly to the ground. It was a long service, plenty of chanting. We had to watch the others to know when we stood up, or knelt or sat down. It was a queer way the collection was taken, the priest went round with a little girl, he carried a silver cup & the girl a little bag, he passed the cup along & I noticed it only contained coppers, & I was surprised when the girl poked the bag along too, but not many put coins in the bag. The priest had \n\na white robe on, the bottom part was of lace & he looked as if he was wearing a petticoat. A small round patch on the crown of his head was shaved. It was a cold windy day today, & I sat on a chair before the fire place in madame’s kitchen all day, reading & talking to Angele, she’s a smart kid, has taught us a little French song, & has as quick a wit as I have seen. They had an Indian captain billeted in the house once, & the kid sat on the floor & chanted some queer tune & bowed to the earth, a perfect imitation of the way I’ve seen the Mohammedans pray in Egypt, & the kid laughed when she finished. Gave madame 25 centimes for a fried egg tonight, & I fried some bread in the pan also. The church bells were ringing all day for the man killed by the German bomb. We all commandeered Madame’s fireplace at night, sat round it in the kitchen till 9 with Angele & old Pauline – the latter is a typical old spinster. \n\nMonday 15 April The ten of us slept in the stable as per usual, one chap acts as batman & boils the dixie of tea & washes the mess tins. A private prefers that job to drilling\n\n& it’s alright for us. The funeral was only held today for the man killed by the bomb last Friday, & all the village turned out, dressed up & clean looking for a change. In front marched the choir boys dressed in red cloaks & caps, then the priest & pall bearers, & men dressed up in tall hats, & behind them the women in deep mourning, a dismal procession. There are some rotters amongst our chaps, two shots rang out today, fellows firing at fowls, & two old Chows came to the orderly room & said \"Australian soldier stealee all their money\" they grabbed their purses & bolted with 57 francs, all the Chinks owned. All the soldiers are \"broke\" but I hear pay will be brought here tomorrow. Had a bonza sleep tonight, a chap in the orderly room had a big double bed in a house next door & I slept in it too – tres bon it was after the barn, lovely & soft & warm. Tuesday 16 April A military dentist is in the village, & I got a tooth filled that broke the other day. Merrett & I had a look at a flour mill this morning, the machinery was all worked by a water wheel, very primitive, but very effective & simple – marvellous, the different uses water\n\ncan be put to. Well once more we moved on, & this time it will be towards the big battle. Drew rations & marched out of Berteaucourt les Dames, kissed little Angele good-bye, she’s a bonny kid, I wrote to Elsie today, & enclosed a letter the youngster wrote to her in French. I gave her Nin’s address, & she is going to write a letter in French to her tonight – hope Nin gets it, as she will be so interested. I hope I see the dear little girl again. We marched about 3 kilos to another village & sat down by the roadside waiting for a train. One with wounded on ran through, also one carrying refugees, driven from their houses by the German menace. Boarded the train at Pernois; Before leaving Berteaucourt les Dames we were paid, I drew 70 francs, entered in pay-book as £ 2-11-4. 30 N.C.O’s were in our truck, one chap bought a pack of cards & some of them were soon playing poker for francs. The train went slowly along, & we got out at some station about 11.30 pm & then had a hellish march. In the distance the sky was just like as if a storm was on – the flash of the shells lit up the sky like sheet lightning, & the roar of the guns resembled thunder. We went on, with various halts of \n\ncourse, over stones amp; holes in the road, on & on, till the chaps began to roar & call the guide nasty names. I think he got lost, & at last several dropped out & lay down to sleep by the roadside. The pack was an awful load & it wasn’t till 5 am. that we hit a village called Coineux, all tired & footsore. The 4th brigade was resting in this village, & we immediately joined our battalions. Wedn. 17 April We were given a drink of tea on arriving, & I joined the 13th Battalion don’t like it as Id rather be with the old 3rd, & I suppose I’ll have to take down the good old chocolate & green colours now. The brigade is just out for a short spell from the line, so we are right in it now, & shall soon be in the thick of it. The trenches are 4 or 5 miles from here, & I saw one of our ’planes up & shrapnel bursts around it. I went to the battalion post office & found some letters waiting for me from Bon, Miss Tofft & Elsie; there were shoals for Boo, including 2 from Will but strange to say none for either of us from home. Could hardly keep my eyes open today after our night march, & had a snooze after dinner. I am attached to D Coy. 13th Bn. & took off the chocolate & green colors \n\n& sewed on the two Blues of the 13th. Our company are in a big barn, very crowded, & no conveniences. One of our big guns is in a hollow a few hundred yards away, & when it fires at the Germans, our tin roof rattles & shakes as if a German shell had hit us. I have never been in such a cramped space as this barn, there are three layers of bunks, with wire netting str&ched across to lie on, & your own little oblong space is all you have to sleep on & put your equipment, gear, belongings, rifle & &c., but nails in the brick wall are very convenient. It rained today & talk about mud – its stickiness is beyond belief, you slide & slip & slither, & can scarcely move at all, its so slippery. Swallows perch in the roof of our barn at night. There are some very fine chaps in the battalion, & one notices the fine men of the early units compared to some we have just brought over. I only wish some of my old pals of the 3rd Bn were still alive, I feel as if I could face anything with them. The","15":" has done some great work too. Some of the old hands are fed up, as our chaps always hold Fritz & beat him back, then the Tommies let him through, & they are sent elsewhere to tackle him when they should be resting.","16":"\n\nParade in fighting order. It was windy & wet & very cold, did a little physical & bayonet drill. Came in at 11.30, & the","17":"\n\n Bn band dispensed some very nice music. It is an excellent band & played catchy, up to date music, instead of all regimental marching stuff. It was very enjoyable, they played \"Yaaka Hula,\" \"Tonight’s the night\", \"The Girl in the Taxi,\" & other pieces. We had an easy afternoon, short arm inspection by the M.O., the quickest I’ve ever seen in the army; instead of filing past him, we stood in line out in the wind, \"presented arms\" & he walked along. Aubrey arrived here yesterday some hours after us, he & a party were looking to the rations, I was put in D Coy, & he is in B. He has had to take down his 3 stripes now he has joined the Bn. In a way I am glad as he is too conscientious for an N.C.O., & was continually running about for others; now he won’t have the chance to. I had a yarn to him & some of our chaps after tea, they are in tents, but it was so bitterly cold & airy there, that I soon came back to our warm shed. The big gun fired several shots in the evening, it is in the hollow near us & is 5 miles behind our trenches. The chaps from the line are all writing a lot of letters now they have the chance. I am a section commander, & it’s not all beer & skittles; issued the rations \n\nto the section in the evening, 4 to a loaf of bread, 8 to a tin of jam, a few dates (it worked out about 3 each) & at bed-time an issue of rum, about a mouthful each. Tonight was very cold, & the cold kept me awake all night, & my wire-netting bed is out of shape & mighty uncomfortable to lie on.","18":" The sun shone brightly when we got up, & I thought it was going to be a lovely day, but it soon disappeared, & sleet fell all day, & the muck is muckier than ever. The reinforcements did a little shooting today in the cold & wet. It was the first time I have fired my rifle as I only drew my overseas rifle just before we left Codford. The bolt is very stiff, & hard to work, & won’t be of much service for rapid fire if the Huns come over in masses. We go up into the reserves tomorrow, so will have a very muddy entry into the war zone, still it’s got to be faced. Wrote home & to Miss Tofft today.","19":" Had to fall in in battle order at 9.30 to be inspected & it was a great rush to get ready. Blanket & greatcoat had to be carried rolled, waterproof sheet under the haversack, box respirator, 220 rounds of ammunition, a day’s iron rations & steel helmet worn, some load to carry. I had a shave\n\n in cold tea, left in my mess-tin from breakfast - it’s marvellous what a chap will do in the army. If you were told in civil life what you’d do when you joined the army, you’d never believe it, one thing no trifling inconveniences will ever trouble a chap who comes safely through the war. Our company commander told us we’d move up into close reserves this evening to Sailly au Bois, the front line is at Hebuterne. In the afternoon I got a lovely mail, 10 letters, 6 from Elsie, & I’ve now received every one of hers up to No. 30 which is splendid- also got 2 from Will, 1 from Nin, & 1 from Miss Tofft. Had read 8 of the 10 when at 5.30 p.m. the order to fall in was given. We marched away in the rain, & the road was like pea soup. We went 1 ½ mile without a halt, & for the first time since hitting England, the perspiration was dripping from under my steel hat, altho’ it was rather chilly. The helmet makes my head ache. We went into good dugouts took the place of the 14th Bn. in reserve, they went up into supports. The whiz of shells from our guns shrieks through the air, & all around I see holes where Fritz’s shells have dropped. I hope he doesn’t \n\nput any on our cosy dug out. I went a couple of hundred yards to where B Coy. are in a village, & showed Boo the home letter. My section of 5 are in a dug out with the stretcher bearers. They made a fire in an oil drum (Australians are great on a fire) & yarned about their war experiences – it is easy to see what grand chaps there are over here, & it is awful beyond words that so many fine men have been sacrificed. Had a good sleep in my clothes, blanket, & overcoat, but the roar of guns woke me up about 12 – it always turns very cold towards morning.","20":" At 7 a.m. 13 platoon set off with picks & shovels about a mile, digging new trenches. It was heavy walking across the mud of ploughed fields, & heavier still digging in the sticky stuff. I’m glad I’m a N.C.O. & don’t have to do this hard fatigue, though I did a bit of shovelling. There was a white frost on the grass this morning, & the day was bright & sunny. An aeroplane of Fritz’s was up a great height, & our anti-aircraft guns were spreading white puffs of bursting shrapnel in the air near him, but didn’t have the luck to bring him down. Fritz was lobbing some shells into Hebuterne, & there \n\nwon’t be many houses & barns left there, when the owners return. None came where we were working. At 10 a.m. another working party relieved us, & we came back, & had a good loaf for the rest of the day, reading & sleeping. I walked across to B Coy. to see Boo for a few minutes, he has a cold. His lot are in a dugout beneath a ruined barn. We had a bit of a concert round the fire in our dugout & turned in at 11p.m. Being in reserves & a mile or so behind the front line, there are several guns all around us; during the night they were tearing it in at one time very solidly.\n","21":" Breakfast at 6.15. Our platoon went digging again at the new trenches from 10 to1. It is a new position to fall back on in case Fritz drives them back. Shell holes are everywhere, on one I saw a white wooden cross, denoting a lonely grave, it bore this simple inscription, written in pencil, \"In memory of 17602 Pte Wharton W., Ches. Rgt.\" Fritz poured about 20 shells on one spot a couple of hundred yards from where we were digging, don’t know what he thought was there. It is very peculiar to see the smoke of the bursting shell, & seconds later to hear the sound of it coming through the air & then \n\nthe explosion, even though you have already seen it explode, the reason is that sound takes time to travel. At breakfast time, two Fritz aeroplanes were up a great height, & I watched our shrapnel bursts of smoke in the sky, hoping they would bring them down, but though the shooting was good, & went jolly close, the Fritzies sailed away. About midday 6 of our aeroplanes were overhead like graceful birds, & they each wheeled in turn following in the wake of the leader. Where our ’planes are when Fritz is up, beats me. Had stew for dinner, & a rifle inspection in the afternoon. This is a lovely life here in reserve, better than camp, with only 3 hours work a day, & a nice cosy dug out to live in, as long as Fritz doesn’t lob ‘em over too straight. The boys had a game of football after tea (it’s not dark till after 8 now), as happy as school kids – the Australians are grand chaps, friendly good pals always, reliable in an emergency, plenty of initiative, & I’m proud to be one, & among the fine chaps over here, the \nfirst\n best chaps are here alright, & the shirkers, who have no ties, at home. Had a chat to Captain Wallach, O.C. of D Coy. this afternoon, he’s a fine\n\n chap – is a brother of \"Doss\", the N.S.W. rep footballer, & told me the latter nearly went under recently with severe wounds, & has had his left leg amputated. I thought our easy time was too good to last, & tomorrow we are to move off to fresh adventures. Went across to Boo’s \"pozzy\" after tea, they had a close go this afternoon, Fritz lobbed a couple of shells near where he was washing & two chaps shaving, & they dived below to their dugout under the old barn, just as another shell hit the barn & smashed a rifle where a chap was shaving before. My word the world is small – in our dugout tonight, two chaps were yarning round the little fire & I heard one mention Warialda. I spoke up & said I used to live there, & he told me his father had a blacksmith’s shop there, & he said he went to school under Percy Hall & Miss Brown. Great Scot, eh, to think that in a dugout on the Arras front in France, I should strike a fellow who was in the same school in my old home town in the country in N.S.W. My section of 4 were on gas guard tonight, looking out for gas from the Huns or the S.O.S. signal while the rest slumbered. I didn’t have to stay up, each woke the other at the end of his 2 hours. Rum issue tonight, it’s very warming.\n\nbut I don’t like it. Tuesday 23 April Had nothing to do all the morning. At 3.30 p.m. we left this easy snap & marched back to where we came from on Saturday. This time D Coy were put in the tents instead of the shed. The New Zealanders took our place in reserve. Passed over cultivated fields - France seems to be cultivated everywhere - & saw a good many guns on the way. I got a parcel from Elsie, a tin of biscuits she made, cocoanut macaroons, & they were very tasty & acceptable. Aub also got two parcels. Had a chat to Frank Mattocks today, he is a Lt. in the A.S.C. attached to this Brigade, the 4th; was at the Maitland High School with me. Fritz startled us by pouring some big shells right over tonight. Wedn. 24 April Capt. Wallach read out orders this morning, including one by General Rawlinson, commanding the 4th Army, saying he expected every man to hang on to the last in the defence of Amiens, & as we are going to that front by ‘buses today, things are going to be very warm; oh well, a man can only take his chance. It is cold and misty today, yesterday was quite warm. There was a battalion parade this morning - after dinner we moved out in full marching order a mile or two\n\n to a road, where we waited for the motor buses to come. A great lot came along one after the other, 25 got on each ’bus & the 4th Brigade (13, 14, 15, & 16th Btns.) travelled on them, so there were a few. Passed through several villages, & cultivated fields were on each side of the road. A long line of new trench was dug, & barbed wire ready, a new position to fall back on. We eventually came to a village full of French troops, & some wore loose hanging caps & different colored uniform to the usual light blue, they were fine styles of men, very solid & big, one told me they were chasseurs, & they have just come from the Italian front. Every French soldier I have seen is a big chap, much different to the weedy Tommies about. I thought we would be billeted in this town, but we straightway marched out of it, & wondered where we were off to, & why the motors couldn’t have taken us right there. We went 2 or 3 miles & halted in the midst of big trees & long \ntrees\n grass, & it looked very cheerless with rain threatening. It was 6.30 p.m., & to our delight tents arrived, & were soon put up, & when we got them up, it began to rain, so we were O.K. The field kitchens arrived & hot tea & rations were given out. We are near Amiens for \n\nwhich the Germans are striving, & oh lor’, what a difference to the front we have just come from. The roar of the guns never ceases for one second tonight, & it is a test of the two great armies for this town. It must be hell in the line, the rumble is rolling on eternally. We are in reserve, & may be pushed in any moment. Let us hope Fritz gets such a doing that he won’t recover from. I wrote long letters to Mother & Elsie before we came here this morning. Slept very cosily in our tent tonight.","22":" Anzac Day, 3 years today since my first experience of warfare at the Landing with the grand old 3rd Bn., most of whom are no more. I was Battalion orderly corporal today, only had to go to the village of Allauville to B.H.Q. with the sick parade. Poor old Boo was on sick parade, he looked very crook & has got thin. He has diarrhea & vomiting. There was a church parade in afternoon. Coffee & cocoa were on for dinner. After tea I went to a concert by the","23":" Brigade Pierrots, it was held in an old aerodrome, & the stage was on a waggon. The boys in the audience sat in the big shed on empty petrol tins for seats. Brigadier General Brand, commander of the","24":" Brigade & called \"the old Brig\" by all the chaps\n\ngave us the dinkum oil from the front. Rained a little tonight, & the piano had to be moved, as the rain was coming through a crack in the roof. There was an issue of beer, 5 bottles to a platoon (not a mouth-wash) so the sections drew for it, ours didn’t win. The guns were quiet today on the front, but at night the barrage rolled out without a break. Suppose we will be sent up any time.","25":" Our present abode is in a most picturesque situation, the tents are placed in among big trees & long grass & bushes. At the side is a lovely cleared paddock covered with green grass. We did a couple of hours parade before & after dinner, bayonet drill & platoon & company drill. Walked to the village with Boo after Tea, he went to the R.A.P. for a pill, still looks very crook. I went to a couple of canteens to buy some chocolates &c. but there was an enormous queue, hundreds of soldiers lined up outside, so I didn’t wait. We are quite like Robin Hood & his merry men, camped in the forest now.","26":" Moved on again today. Dumped our packs & marched out in fighting order. On the road we passed General Birdwood, he had on an Australian felt hat, turned up at the side. A chap in C Coy in front of us fell \n\nout to do up his puttee, & as we passed he caught hold of my arm. It was Freedman, he was in the same company as I at La Perouse & Duntroon schools, & I saw him at Codford. He only rejoined this battalion today. We marched a good way, & our feet were fairly sore when we reached the deserted village of Daours. There are some nice buildings in the town, & it is a great pity these poor French people have to leave their homes. The town is full of \nAustralian\n Australian soldiers. Our company are quartered in a big building which looks as if it was once workshops, we are up on the top storey. We took off our boots & socks for foot inspections, & as the river Somme was right alongside I washed my feet there. It was a perfect treat, as for a month now we haven’t had a change of clothes or an opportunity of a bath. I hope they ‘ll let us go in & wash our bodies tomorrow. It is a narrow river, but runs swiftly, & the water is nice & clear. After tea, I went up the village looking for B Coy. & Boo, found him in a barn, he is a terrible old stick-in-the-mud. I always find him in his quarters, he never seems to be up the villages enjoying what little there is to see, & trying to forget the army, & if I didn’t go looking for him wherever we\n\nhalt for a few days, we wouldn’t see each other, as he doesn’t buck up & drag himself away from the dull routine of army life when he has the chance. Saw the 47th Bn. of our lads fall in to march up to the line, it was rotten to see them go up so short; they have had heavy casualties, but held their ground, & wiped out far more Germans. As usual there is a very fine church in this village. It rained tonight, & came through our roof in places. Just a few yards outside are some big guns, 60 pounders. Lor’, when one fires, it makes our building shake, & if you happen to be doing anything, your arm jumps & you nearly drop whatever is in your hand, & the roar is deafening. Couldn’t sleep much at night, had a nice comfortable bed on straw with blanket, greatcoat & waterproof sheet, but the big gun was blazing every now & again, & making a fearful row.","27":" Had a nice quiet day, one parade to inspect arms &c. It is dull & cold after a very wet night, & altogether too cold to go into the river for a clean up, worse luck. They are great gamblers in this company, always playing two-up, &c. 331\/3 % (one third) of the Bn. stay out every time we go into the line, those who are left out are envied (in spite of newspaper rot to the contrary) & those who go in hope \n\nfor a nice little \"Blighty\", that will get them to England. I wrote earlier we had a nice easy day. Lor’ the evening & night made up for it, one of the hardest toil I’ve ever had to bear. It is marvellous what men can go through in war. We left Daours at 5 p.m. for the line, & today I had my first glimpse of war in France, & all its hideousness. If people at home could see what happens, the cursed war would be stopped. We are to be the reserve company of the battalion & have to dig a new line. Boo’s company, B, are to go in the front line – may Good Luck always be with him. Our company set off along the road, & on both sides of it near the station were shell holes & dead mules – Fritz was evidently after the railway line. Of course it began to rain, but on & on we marched without a stop, the captain in front was riding, so what would he know about how tired we were. Passed a field where there were 11 dead horses & mules, poor brutes, that they should be victims of shells. The rain was running of the top of my steel helmet, & underneath it the perspiration was trickling. At last we halted by a sunken road, & the cooker was there, & we each got a drink of hot cocoa. Moved on again, & I thought we were about at our destination, but I’ve never had such\n\na tramp in my life. Talk about hard work, the clay was sticking to our boots, the load on our back was heavy, & we were getting weary. Passed along a road where I saw some of the N.C.O’s of the 56th in dugouts who were in Codford when I was at the 14th I.B. Then we tramped across ploughed fields with the grain just growing, which the old Frenchies have had to abandon, & I thought we were never going to stop. I don’t know how we kept going, no halt, on & on across the heavy ground. I was so weary I wouldn’t have cared if a shell hit me. Then we drew near a hedge on the side of a village, & the field was simply honeycombed with shell holes, there were thousands, & Lor’ knows how any human body lived in such a place. And yet, as we walked across the field, not a single shell was falling there. The village was Villers Bretonneux, it was taken by the Germans last Wednesday, but our boys have since won it back. We got through the hedge, & came, without warning, on several dead Germans lying in the open, a most gruesome sight. Two I looked at were shot in the head. They lay there unburied, & our chaps started to look for souvenirs, but somebody had been through their pockets before. I could have got a German bayonet & small entrenching tool, water bottle, bomb handle &c. had I any chance of getting them away. I got a small note\n\nbook with German writing in it, also a charger & 5 cartridges. His chargers work much easier than ours. At dusk we began to dig new trenches in sections, isolated ones & not connected. Just in front of us is a lovely big house, deserted & ruined by shell fire. Our supports are a short distance in front of us, & our front line in front of them. Flares were constantly going up & lighting up No Man’s Land, it was a misty night. A German machine gun’s bullets were zipping about our ears, & made us lie flat on the grass for a while. We are to dig all night, & stay in the \"pozzy\" by day in case he attacks; also we couldn’t dig by day, or he’d spot us & wipe us out. At midnight we had to knock off & carry up rations. It had been raining for some time, we had no shelter, & just put waterproof sheets over our shoulders & stood in it.","28":" At midnight, as I said, we reported to Company headquarters in an old house, & were detailed into ration parties. Reported at battalion headquarters in the village, & found we shouldn’t have come till 2a.m, so we went into the cellar of a house to wait. It simply reeked with gas down in the small space. Fritz has been raining gas shells into the village we were told. There were lots of bed clothes \n\nthere & it is awful to see this desolated place. Nearly every building is smashed, great holes in the walls, & holes in the streets. At 2 a.m. we went down the street & waited at the Crucifix, a fine bit of work. On a tall stone column is a figure of Christ hanging on the Cross in front a lovely piece of statuary of a woman standing in white. The limbers were to bring the rations here at 2 a.m. On the road was one of our big motor lorries with only the wheels left, a shell must have got it properly, & the driver too I suppose. The two limbers & mules arrived, & began to unload the rations, & Fritz began to put his shells over, the brutes must have known the spot. They were bursting about 30 yards away luckily. The different parties got the rations, & the limbers drove away. I was one of Cpl. Begg’s party carrying tea & food to C Coy in supports, don’t know how these chaps find their way, was glad I wasn’t in charge. Got the tucker up alright, then drew our own rations for tomorrow, & camouflaged our trench, that is put new earth on the parapet & parados, to make it look to an airman as if it’s ordinary ground. Settled down at daybreak, after mighty hard & heavy toil from 5p.m. the evening before. I am in a short bit of isolated trench with a chap named Shortland we have no shelter, just have to lie in the bottom of the trench as best we can, &, of course, it rained lightly again. We had breakfast under \n\ndifficulties, our hands were very muddy, but we extracted some bully beef, bread & cheese from our tucker bags, & then commenced to try & sleep. For a start the chats were biting me, I’ve had these clothes on for over a month, then it was pretty cold on the clay floor of the trench, & aeroplanes were droning overhead, not to mention shells. What a life , eh! I’d give many quidlets now to be back in Sydney harbour. Seven of our ‘planes were circling about on high. In spite of the shells, the skylarks sing their sweet music up in the air, like canaries. Fritz gave me a nasty feeling by sending over shells that we’d hear coming & burst after passing our trench, others would drop nearer, & each time you think \"Where will the next drop?\". I sat huddled in the bottom of the trench, & wrote up this diary. Near where the dead Germans are, there are rolls of knitting wool & I saw a new pair of women’s stockings not yet used, evidently Fritz helped himself in the deserted village. Slept off & on during the day, aeroplanes were flying about all the time, & Fritz poured his shells in the deserted town, he gave us a very nasty five minutes by dropping several just over our trench. At 8 pm we carried new cardigans, that were taken from one of the mills in the village, up to A, B & C Coys\n\nin the line. I was with the party that went to B Coy. & it is an eye-opener. They talk of \"front line\" of trenches, it was simply isolated holes & dugouts, & on a dark night one could easily walk right into the German lines. It was more like outposts than the front line. I found Boo while there, he was O.K. Unfortunately, our company have had 3 casualties; Cpl. Evans was hit by a shell while handing out rations, & died later, Dibden & Holmes, the latter Capt Wallach’s batman, were wounded by shells when well back. It is a hard job to find your way at night, in fact the Germans seem to be right round in a circle, & Lor’ knows how a commander allots his front. Hot stew & tea came up on the limbers at 8 p.m. in big thermos heaters & petrol tins, my word it was acceptable. The dirt on this page is trench mud, & the smudges are rain drops as I lay in this desolate pozzy writing. \n","29":" At 3 a.m. we were on ration carrying again. The different parties went down the road to the Crucifix, where the limber brings the rations. I hate that spot, Fritz knows it, & two shells burst with a roar right in our ears. We quickly grabbed a petrol tin of tea each & the bacon, & hurried away. It beat me how the mules stood there so quietly. We took the tucker to C Coy. & had to come back to the Crucifix again with the\n\nempty thermos & tins from the stew & tea earlier in the night. The party did growl, it’s a long way down to that Crucifix & in the dark you stumble into shell holes. The pace was a cracker too, wasn’t I tired & fed up; the only comic side, & I couldn’t help laughing, was when two chaps in front of me were carrying a thermos, there was a ledge about 2 feet high, but one didn’t see the drop down, he took the next step as usual, & simply slid & lay flat on his back. Didn’t he swear, eh, it was the finishing touch to his pent-up opinion of the war. The other cove who allowed for the drop, said \" I told you it was there, you dope.\" Found our way back to our respective pozzies again, & got our tea & bacon. A drop of rum was issued later, also 3 packets of cigarettes & box of matches, & tomorrow’s ration of bread, margarine & jam, it is mighty scanty for a day too, I could simply devour some roast beef & spuds now. \"Turned in\" at 5a.m., woke at 10, had \"chat\" (not a talk), & Shortland & I ate some of our bread & margarine & jam, could have eaten it all myself in one act. It is very misty with drizzling rain, no aeroplanes are up, & some of our guns are firing as I write at 1 p.m., but not a shot\n\nfrom Fritz, he might have vanished for all he’s doing, but the brute will break out any time I suppose. I then lay on the bottom of the wet, clayey trench & slept again; oh, its a lovely war! Well I slept, off & on, in my little narrow bit of trench all through the day, until at 5 p.m,, as it was beginning to get dark, our work commenced again, ration carrying. Went down in parties to the Crucifix as usual, & the limbers brought along stew & tea in big thermos dixies & petrol tins. One thing the tucker is kept up well. The party I was with carried to A Coy. We got back to our pozzy, had our own hot stew & tea which was glorious, & got into the trench. Gee whiz! didn’t Fritz pour in the shells then, it was a God-send our trip was finished. They fell thick & fast round where Shortland & I were huddled up in our narrow trench. It’s an awful sensation as they roar just outside your parapet, & you can hear the shriek of another coming, & wonder if it will get you. A hole about 9 yards round I afterwards saw 3 yards outside where I sat in the trench. Jagged bits of iron fell on our parados & in the trench & it was a very near thing. Later in the night, as I’ll tell, he gave us even a hotter ¼ of an hour. Our guns opened on him, & there was a continuous shriek of our shells passing through the air over to him. Sgt Purcell is a very brave chap, he is walking about from post to post with orders, & seeing things \n\nare all right, has had some very near squeaks but doesn’t seem to fear the shells. ","30":" About 2.30a.m. Sgt. Purcell came over to tell us to go company headquarters to join the ration parties as usual. Tea comes up now, & bread jam, &c. for that day. Well, the German shells were raining down round our trench. Lor’ they hit every bit of ground except our trench I think. It was awful, shell fire in salvos I think, frightens any man. We couldn’t attempt to move for a while till they eased down, & as luck would have it, we went right down to the road at the Figure on the Cross, carried the hot tea & rations up to A Coy., carried the empty tins from their earlier night meal right back to the limbers (they take them away back to the cookers) & got back to our trenches without any more shells. Luckily his two bursts came when we weren’t out carrying. Hope Boo’s alright up in the front line, but I think we’re having a worse time here, what with the shelling & ration carrying; no wonder it’s done at night. It is marvellous how some men have stood 3 years of this, a chap is lucky to do 3 days. Lay down in my overcoat at 5 a.m. (nothing to do till night now) we have no blankets here, too muddy for them, but, it was jolly cold. My body was warm, the small issue of\n\n rum is very acceptable but the feet get icy. It is very misty again, & as it is the 1st of May, its high time the weather turned warm & sunny. Lay in the bottom of the trench till my feet got that cold I stood up, it’s like solitary confinement in this narrow, short space. My fellow occupant, who is a bit of a dope, & I opened our tin of beef & vegetables, which went very well, & Sgt. Alton threw us over a tin of German bully beef, so I can say I’ve eaten that. The tin had on it \"Conservenfabrik Braunschweig Runingen, 1917, 2 port Rindfl. In Bruhe.\" Alton went salvaging in the village, he said it is terrible the way things are ruined, he saw 3 pianos undamaged. He found many Germans’ packs full of women’s clothes & stockings, so they must be scarce in Germany, as Fritz would hardly lump it about for fun. He said there was plenty of bully beef & rye bread in their packs, so they’re not starving. I suppose when they first took this village, the brutes made the most of it before they were driven out. Our shells were shrieking across today, & I saw black bursts of smoke where they were landing, no reply from Fritz, but I suppose he’ll give us pie tonight. \nLater\n He shelled us fiercely about 7.30p.m. It was rotten, they fell thick around, & you can only sit there & listen to the shriek of more approaching. One of his ’planes was over this morning & spotted some of the 15th Bn \n\ndigging. It was the only one up on either side all day, ours don’t seem to be about when Fritz appears, but it was a dull misty day. When we went over to company headquarters to join the usual carrying parties, some sad news was heard. His shells have been falling thereabouts all the time, & Captain Wallach who came up from the cellar he was in to have his tea was killed in the room by a shell. Not only that, but D Coy. hasn’t an officer left, as Lieutenants Smith, Watson & Jones have all been wounded by shells. Lt. Lilley, in charge of our platoon, was evacuated last night sick luckily, or he might have gone with Capt. Wallach. It’s an awful business; he was one of the best, only a very young chap but tall & wiry, & liked by all his company, rose from the ranks too I think, & won the Military Cross. Our section was there first, & as it was too light at ¼ to 8 to go for rations, the company sergeant major told us to wait below in the cellar, as shells were dropping occasionally. We talked to some signallers there, & were jolly glad when a chap came in later & said the rations were all up. Had some hot stew & tea, went back to our trench till the 3a.m. trip is due with tea & next day’s dry rations of bully, bread & jam. I was on gas guard from 11 till 12, & the cursed shells\n\n rained over fiercely for 20 minutes, but luckily didn’t get us, though they were too close to be ignored. \n","31":" At 2.30a.m. he poured over a good many shells again, same time as yesterday, & before we had got out of the trench to go for rations luckily. When they stopped, we went over to Coy. Hdqrs. I was carrying to C Coy. in supports, & was glad it wasn’t to A & B in the front line, much further out. I had 2 tins of tea & they got mighty heavy, as Cpl. Begg led us at a brisk walk in single file across the heavy ground. I’d have given anything for a rest, but you drop behind if you stop, & I stuck with it, besides the sooner these jobs are finished the better, the way he shells at intervals. I trudged along with the tins till the perspiration rolled under my tin hat into my eyes, & I was quite wet with it, as we at last reached C Coy’s trench & a sergeant took the tucker. Then there was the long walk back to the Crucifix (where the limber comes), with the empties from the tea & stew at 8 p.m. I struck a big thermos, & it was heavy enough empty. I reckon the chap who carts these right up to the front line filled with stew deserves the D.C.M. Machine gun bullets whizzed uncomfortably near in the grass at times, but we got back with them, & then another long walk back to our trench by 4.30 a.m. without \n\nmishap, & have the day free in the trench till night once more appears. Had a drink of rum as usual before daylight, after which I slept like a top for a few hours. It turned out a glorious sunny day at last. I took off my boots for a while & wrote up my diary. Haven’t had a wash or shave for 4 days, & am yellow mud all over, it is 5 weeks since I had a bath or change, & wouldn’t one be a luxury. Gosh civil life will be like heaven again, if I have the luck to come through this awful business. Haven’t seen Boo since Monday night, trust he’s OK., they are not getting the shells in the front line we are back here, & if there’s no hop over, I think he’s pretty right, though one never knows what minute he’ll be hit at this game. The skylarks sing up in the air, & that’s the only nice thing there is. The day passed very quietly, it was a lovely, sunny day, & aeroplanes were constantly up. I was thrilled to see one for the first time on fire, I heard machine gun fire in the air & looked up, & there was a German machine with flames in the rear, 5 of our planes were up & another German. The chap kept his nerve, brought his machine gracefully down with the flames growing bigger & I expected it to collapse, but it was still descending\n\nin perfect order as it disappeared behind some houses in the town in the direction of the enemy’s line. Shortly afterwards a big machine circled over my head (ours had gone home) & I looked up & got a nasty shock when I saw a black cross on the wings, the German sign, but he didn’t drop a bomb. Our ’planes have a circle with a dot in the centre as their sign. One was up behind us most of the day, & the Huns were pelting shrapnel, & you could see the black puffs in the sky where the shells burst, but a moving aeroplane is a very hard target to hit. Fritz didn’t shell us about 7 p.m. as usual. I carried tea from the road to our company tonight, & about 10.30 we moved up to the front line to relieve A Coy. March in single file silently, & as flares are being sent up all the time, each man stands without a move when \nit\n a flare goes up, there is less chance of being seen than if moving; it seems a long time that the pretty flare, which lights up everything like day, takes to circle up in the air & fall to earth & go out, & while it’s alight, you expect a machine gun to open up on you. When it goes out the procession moves silently on, but stops dead when another soars up. We got to A Coy’s trench finally & they got out without trouble, & took up our respective positions. We are holding it too lightly, one platoon of ours only taking up the same front as two of theirs, & 5 others & I occupy about 50 yards. Wouldn’t keep him back\n\nif he attacked in mass, but there is a machine gun on our right that would give him pie. Right in front of us are some hangars & stone buildings in No Man’s Land, much battered by shell fire. A listening party of 3 men went out to a post in front till daylight & patrols went out. You can see them standing out in front when a flare goes up, & it’s wonderful how cool they are, though the chap’s feelings who sees a flare going to fall about his head must be rotten.","32":" Here I am, writing this diary, leaning on the parapet in the frontline, on the Amiens front in France. Rather interesting book for that reason, eh? My fountain pen is a positive treasure. At 2.30 a.m. our guns opened on Fritz, Great Scot, they gave him rats, he replied, & wasn’t there a din! We weren’t touched, both sides’ shells were going over our heads, but our company in support were getting some big brutes on their trench. It’s unbelievable that in these advanced days, men should go through this. About daylight I could spot a Fritz’s head in the distance, & had my first shot in France. Collins, near me, who has never seen war before, said he had never shot at a man before, but the temptation was too great, & he let 3 bullets go but that Fritz’s wife isn’t a widow yet. I had a sleep in the bottom of the yellow trench for 4 hours this morning. I’ve never felt so filthy \n\nin my life, would give anything for a bath (pen just run dry.) It is a lovely sunny day, & I saw a great sight this morning with the aeroplanes. Droves of \nus\n ours went across & bombed his trenches & didn’t Fritz chuck up shrapnel at them! It is marvellous how they escaped, the black puffs of shrapnel burst all round them but they just stayed there finishing their job. So thick were the bursts that until the smoke cleared I could hardly tell which was aeroplane, & which shrapnel puffs. I didn’t see any fall, the Boche’s have no shortage of shells, the money wasted in war eh! Thousands of shells never hit anything. It’s a glorious day, & the skylarks sing in the air in spite of war. For the rest of the day everything was very quiet & you’d hardly know there was a war on, but overhead in the evening the air was thick with aeroplanes. Lots of ours were over their lines at times, but to show we haven’t all the planes, I saw 17of Fritz’s up on high once. Some of his tackled one of our chaps about 7 pm. but he drew out with the two after him, & by corkscrew dives drew away unharmed, a very neat bit of work. I wouldn’t like to say how many ’planes I saw today, dozens & dozens, & with the hundreds of shells fired at them not one was brought down; shows what a difficult target they are. It has been all aeroplanes today, but tonight the fun will start again with all the guns, & we will be on the\n\nalert. Soon after dark, I could hear the drone of one of our ’planes in the sky, & then a flash & mighty roar as it dropped bombs in Fritz’s territory. It put the wind up him, as he had a searchlight playing about the sky for hours afterwards, but no more ’planes came. Fritz was sending up some very pretty lights spiral green ones like a snake, a signal of some sort. The usual bright flares were also plentiful. The listening post party went out, & a Lewis gun team took up a position in front. A party was also put on wiring round the walls of the brick house. Fritz spotted them, turned on a machine gun, & a corporal came in with that rotten question, that means so much \"Are the stretcher bearers there ?\" These brave chaps went out twice & carried in two badly wounded men. Later Cpl, Oakes struggled in groaning & said \"Is there an officer there, he’s coming up the bridge, & we’ll lose all our men soon. \"Oakes was wounded by a grenade – there were only three chaps in our part of the trench, & Cpl Brandt & I were sent out, the dozen or so chaps lined a bank away from that cursed house, & strained their eyes, but no Germans were coming. The coot kept sending up flares which light the ground like day, but luckily we were behind a bank & kept down, so we weren’t seen by him. An officer sent out another \n\nparty to dig in behind the bank, under Cpl Begg – they were untouched further, & I returned to the front trench. To my surprise Fritz didn’t pour over his usual supply of shells tonight, in fact sent none, wonder what his game is.","33":" It rained for about 10 minutes in the night, & oh Lor’, mud, it’s something awful. Such a small fall would make no difference in our country, but here it’s vile. It was heartbreaking to see the state my rifle was in this morning. Goodness only knows how the chaps live & get their tucker, & are able to move the bolt of their rifles when it’s winter time & properly wet & muddy. It turned out a glorious sunny day with blue sky. Those lovely little singing birds, the skylarks, we whistling sweeter than canaries before day broke. They keep singing as they rise up & up out of sight, & come back to earth in one straight swift dive. I was only thinking what a cursed thing this war is, no one wants to go to war on either side, but yet it goes on month after month, year after year & thousands of good men are mutilated daily. Those fighting have no say in the matter, & the women at home don’t know what happens, or public opinion would demand the end. Not that I’m not here voluntarily, & anxious & proud to do my bit ( I wouldn’t be a shirker for anything) but I’m speaking of the hellish thing called war. Our guns are shelling Fritz occasionally this morning, but he’s uncannily quiet again.\n\nIn the afternoon we poured shrapnel on the part opposite a battalion on our right, thick & fast. The air was full of the white puffs as it burst over his lines. Three of his ‘planes at dusk circled round overhead & took stock of our position for an hour, & I was disgusted none of our ‘planes turnedup to tackle him – however he stays over his own lines mostly. We were relieved tonight by the","34":" Bn., so the tea & stew didn’t come up to the line at 9 p.m. The 16th came up about 10, & each section got into its own part of the trench, we filed out & went off quietly without mishap. A few flares were sent up as we were moving to the rear, but each man stood stock still till it burnt out & then moved on. We had a long walk, someone said it was a kilo but I’m getting suspicious of these French kilos, they tell you its a kilo on a route march & the kilos grow on the journey. We got away down to the Crucifix where our guides took us on to our place of rest. Beats me how they find their way in the dark. It was a long walk, & it was nearly midnight when we reached a place in open country where dugouts were ready. We hadn’t eaten since midday & I was hungry & dead beat. I\n\nwas dying for a drink, asked several chaps but their water bottles were empty also, & they were hungry & thirsty. No one knew where to find the cooker in the dark, but the poor platoon sergt & officer found ‘em alright, & I just devoured the nice hot stew & tea – it was like new life. I yarned to the two chaps in my dug-out then & we went to sleep soon after. Just as we got here, 3 shells nearly hit us. It put the wind up us, tired as we were, & it’s the queer part of war to think that in the front line no shells troubled us, & now we are a couple of miles back we nearly got whacked. Just about here are several of our guns, & he must be after them. Sunday 5 May It was a perfect treat to have a wash today, the first for a week, & it was nice to have a clean face after a week’s growth. The chaps are looking less like bushrangers today. Had a lovely loaf all day – I see the usual sight of dead horses lying about. In the distance is the city of Amiens which the Germans are anxious to take, but I think they are about held now. In the afternoon I went to find B Coy’s dugouts in a sunken road near us, & was delighted to find Boo well after his long week in the line, also Eldridge who was as jolly as ever. While I was down there, I saw Stone give himself a nasty wound. He was pulling the cover off his rifle, but the thing must have been loaded & cocked, for it went off & bored a hole in his right hand. It gave \n\nhim a great shock, after talking for a while he asked for a drink & fainted. He will lose the middle finger. There will be an enquiry, & he will have to account for a self inflicted wound, as some chaps do that to get away from the shells, but Stone would be one of the last, & there will be several to say how it happened. Had tea with Boo & Eldridge, they had been to the canteen & had biscuits & salmon as well as the issue rations – one thing , once you get out of the line, there is a canteen attached to the Brigade where you can buy some luxuries. It is a lovely peaceful Sabbath, the beautiful green slopes of France are all round, I feel clean & refreshed & can’t imagine I was in the front line opposite the Boche not many hours ago. Unfortunately, we lost some good men while up there, but \"c’est la guerre.\" Am in a very cosy dug-out with Shortland, we have candles & blankets & a quilt, the latter being salvaged from the village by the chaps before us evidently. Had a read \"in bed\" by candle-light. ","35":" We were up at 4 a.m., our platoon had to do some wiring making another position to beat back the Hun in case he comes again. There was a magnificent chateau not far from where we were working, & when an officer told me to see if I could find some pickets to drive into the \n\nground for the wire, I grabbed the chance of going across from the wood to the chateau. From the distance the lovely building looked unharmed, but what a difference close. It was a cruel example of war’s awful destruction. In front of the building was a winding pond with the fish all dead, poisoned by the gas shells. The walls of the building had many shell holes, & we mounted the stone steps & entered the drawing room. It was a shameful sight, sheets of music lay strewn all over the floor, pictures & costly ornaments broken by shell fire, lovely cushioned chairs broken, & a fine piano, open, had 4 shrapnel holes in the woodwork, & strange to say not one note was harmed. A billiard table was also untouched. I could have got some nice souvenirs if I had a motor lorry, but the place was ransacked pretty well. I went in all the rooms amp; up the stairs to the 3rd storey, there was even a lift in the building. In one room, evidently the daughter’s, was a lovely big mirror with electric light bulbs in front & various powder boxes & feminine arts for making the beautiful more so. Some lovely cabinets & chests of drawers were unharmed by the shells, but I couldn’t get any \"souvenirs\", they were all empty, others had been there before. In another room was an album of books on bird life, costly well bound.\n\nbooks, & the family were evidently bird lovers. In one room, a girls, there only remained a pair of good boots from a Paris shop, in another bedroom were hat Boxes (but no hats) bearing the names of Paris shops also. In another room was a fine blue French military coat & several white stiff shirts. There was a big album of views I’d liked to have been able to take & send home. In one set of shelves I saw some fine crockery, but everything carriable if not broken had been taken, the destruction by shells was awful. A lovely carpet ran up all the stairs, & it was unharmed. Lying on the floor on a beautiful curtain was an unexploded shell. The whole lovely deserted chateau was a standing example of war’s hideousness. I got a few souvenirs in the shape of letters & cards written in French to Madame Delacour, who evidently lived here, & thanking her for gifts. There was still a smell of gas about the place. When I got back to the party, Lt Hall asked me where I’d been, I told him we couldn’t find any small stakes, saw plenty of trees in the wood, but had no axe to cut them. He said \"where are your 3 men?\" I lost them when we were roaming through the chateau & told him they were all back. \n\nHe didn’t roar, just said \"I didn’t send you souvenir hunting.\" Out of the line resting, is different to camp discipline, & the officers & men are more pally. We came back to our rest place from the wiring at 10 a.m. & had a loaf all day. I got a huge mail in the afternoon, letters galore from home & Elsie, & Bon sent a crowd he had received. I also got letters No 31 & 32 from Elsie, & one from Miss Tofft in the front line trench last Friday night, today I got a parcel from Miss Tofft, some sweets, she’s a good sort, there’s no doubt, as I only met her in England. If our chaps aren’t the limit! I saw a sight this afternoon that would be worth pounds in the illustrated papers; some of our coves whom I told about the piano, went into the town, found an old shell-torn cart, pulled it to the chateau, & actually arrived at our dugout, pulling the cart with the piano on. They unloaded it, & in no time one of them was playing the latest airs, & the soft, lively music was better than the roar of shells. An English major went by & asked them would they sell it, he said it was worth 2000 francs; had he offered them they’d have said \"It’s yours\" pretty quickly. We have all got nice new cardigans, there are\n\nhundreds of them in the woollen mills in the town – it was a great performance of our Australian lads to drive Fritz out of this town of Villers Bretonneux. Lately it seems always a case of the Pommies losing a position, & our chaps holding Fritz, or having to win back what the Pommies lost. I had to laugh to see some more of our characters come back from the village, one chap had a tall black hat & white lace parasol, & on the post where our Lewis gun is hung to shoot up at any German aeroplanes that come over, is a pair of girl’s white draws. Lor’ isn’t it funny, they take nothing, not even war, seriously, though in the trenches Fritz learns what they are made of. \n","36":" Up at 4 am. early breakfast, & we set off laying barbed wire. It came on to rain again at 9 am. & we came back. Had to carry a box of bombs each up to the new position we are making, & it was heavy work in the mud. Turned out fine afterwards, & we did some more wiring in afternoon. Went to see Boo in afternoon, poor beggar was away on fatigue. I waited till he & Eldrige returned, very weary, from carrying ammunition. Noticed a parcel\n\n in his dugout from Mone, so I opened it. It was a tin of plum pudding, very nice too. Fritz opened up his shelling again suddenly tonight, there have been rumours for days he is to make an offensive tomorrow. We had to keep our boots on tonight & be ready to move up on 5 minutes notice. \n","37":" Well, Fritz didn’t come over. About 3 a.m. our side poured over a heavy barrage of shells for about 20 minutes. We got up at 3 a.m., had breakfast (tea & Maconnochies) & worked till 9 , putting up barbed wire, & if he breaks through in front, he’ll get what he’s looking for in the rear. The chaps worked hard & got a lot done. I had a sleep till dinner time. At 5 p.m. went across to Boo’s dugout, & was disgusted to find that he & Eldridge were away again digging. Poor beggar, talk about coming out for a rest, he’s been on fatigue day & night since they came out of the line. Our company is lucky in the job we struck. At 7 p.m. we went up to the Crucifix to carry barbed wire to our position ready to put up tomorrow. Fritz sent over some gas shells & we had to put our masks on, some of the chaps nearest to where they burst got a whiff that made their nose\n\n & eyes sore, before they could get their respirators on. The wagon hadn’t brought the wire up, so we didn’t wait long. Two German aeroplanes came right over our lines & had a good screw this afternoon, it was misty & they were pretty low, none of ours were about. Our machine guns fired at them, & Jerry Sexton had a bang at them with his Lewis gun on a post when they came over us, but they weren’t brought down. In the evening 17 of ours were up in the sky like graceful birds circling about, the Germans fired lots of shrapnel which burst in the air about them without result. When I got back to our dugout, I saw some wonderful feats by an airman, don’t know whether he was showing off his prowess, or giving us a treat, or what, but our boys were all out watching. He was flying just above the ground, another machine followed him up, but didn’t do what he did. He turned a complete somersault in his ’plane several times, you’d think he’d crash to earth but he’d right it, then sail on, turn round & do some more. He was so low I could see his head & I waved my hand, & he waved his over the side of \n\nhis ’plane. After his exhibition, he flew away. Boo & Eldridge looked very weary & fed up. I wrote to Bon & Miss Tofft today.","38":"\n\nWas feeling very sleepy when we had to turn out at 4 a.m., had breakfast & set off to our wiring job, & after carrying stakes & barbed wire & putting it up, we were all very weary when we knocked off at 9 a.m. I grabbed the opportunity to have a sleep till dinner time, after which we fell in joyfully with our towels to have a bath. I haven’t had a change of clothes or a bath since we left England 6 weeks ago. Imagine our disgust when they said the bath was off as we had to dig a trench, & we fell in with fighting order & rifles, & pick or shovel each & set off for our job, - oh it’s a lovely life in the army. After tea, we packed up & once more moved to a fresh spot. A big crowd of ’planes were up again this evening. (Thank Goodness I’ve been able to fill my fountain pen again.). We went a few kilos to a spot in the forest, it was very pretty, lots of tall, bright green trees everywhere. There were pozzies there, a trench dug with covering overhead in parts, from the rain. There was a Y.M.C.A. handy, thank Goodness, & at 10 p.m. I went through the bush to it &\n\nbought some biscuits, cocoa was on tap \"buckshee,\" so I returned to \"bed\" nice & full. I was on gas guard, struck a good shift, 10.30 till midnight, so didn’t go to sleep till then, & didn’t have a disturbed night. There are several big guns in the wood around us, and the roar of them woke one up at times. ","39":" Breakfast 7 a.m. & at 8.30 we fell in to march to a village for a bath, it was a long tramp, but when we got there, wasn’t the bath a luxury. It was a hot shower & we just revelled in getting clean again, & as we handed in our dirty shirt, socks & underpants, & got clean, new ones, we marched back to our pozzy like new people. It was my first bath & change since leaving England 6 weeks ago. On the way back we called in at the Y.M. & had a drink of cocoa, baksheesh, cocoa is a favorite drink of mine. There is a canteen opposite & I got some chocolate, so am not feeling hungry. The underpants we drew are shorts, but the weather is getting warmer now, & they wont be so \"chatty\" either. I went to the YM after tea (it is in a shed with a \n\ncorner of the roof knocked in by shell) to write to Elsie & home, a chap there had a bottle of ink & I took advantage of the opportunity to fill my fountain pen, hence the writing in ink once again. Had a drink of cocoa, & went to B Coy’s trench & had a yarn to Boo, Eldridge & Bradford. Their luck is dead out, they only have a trench they dug, & haven’t a sleeping pozzy, whereas our company struck good covered in pozzies. Fritz sent some big shells into the wood tonight, after our guns. Saty.11 May\n\nThe brutes had us up at 3 a.m. & we began digging a dug-out for headquarters by the side of the railway line at 4. They call this a rest too. Fritz made us hide by sending over some shells on to the line near us, but they missed, & that’s the main thing. Knocked off at 8, & I had a sleep till dinner time. I finished my long letter to Elsie & home tonight, gave it to \"Darky\" Austin, who gets them signed by Darcy Irvine without being read, so I can write a decent letter. Read a \"Sydney Mail\" by candle light in the trench for a while, & went to bye-bye at 10.30 p.m.","40":" Had a long night’s sleep, didn’t get up till 7.30 for breakfast, no digging for a wonder. \n\nThe C. of E. Chaplain, Capt. Hinsly, held a service followed by Holy Communion, at 10.30. It is Mother’s Day, & he gave a lovely sermon. The service was held in a beautiful spot in the forest, the tall green beech trees forming a canopy overhead. Wrote to Mother in afternoon, & at 6 pm the","41":" Brigade padre had a little service in the Y.M. barn. I got a parcel from Elsie today, a nice cake. We go back in the line tomorrow night, wonder what sort of a spin we’ll have.","42":" Before daybreak, I was aroused by our machine guns firing hard, & could hear the drone of aeroplanes, & knew Fritz was overhead. They dropped several bombs, & his guns also began shelling, & I could hear the awful roar as the shells burst unpleasantly close to our pozzy. He knows our guns are about here. On getting up for breakfast, I saw one huge hole only 2 yards from the trench where two of our chaps were sleeping. Other holes were round about, & the road was torn up in places. I slept most of the day, wasn’t tired, but getting ready for tonight when we go back into the line. Unfortunately it rained all day & will\n\n be rotten there in the mud & clay, but it’s part of the game they call war. Had a letter from Mr Smithers, London, today. Also managed to get hold of a couple of \"Daily Mails\", & see some war news. It seems funny that they know more about how the war is going in Australia, 12000 miles away, than we do here in it, but we only know what’s happening on our own tiny bit of front, & don’t often see a paper with the full news. Boo dropped across at 9 p.m. for a while. At 10 we fell in, our platoon, 13, had to wait on the road till 14 & 15 went on, & he was sending shells into the wood about 20 yards to our right. We were wishing the other two platoons would shake it up, it is rotten standing where the shells are dropping, & if he turned them a bit to the left he had us. Finally we set off down the road, along into the town then along the railway line, Goodness knows how they find their way at night, its a mystery to me; the Huns flares seem to be going up on all sides. It was very slippery, the mud in France is vile. I had a buster once; took care to follow straight in the footsteps of the man in front, as occasionally he trips over wire or falls in a shell hole which can hardly be seen in the dark, & it puts you right. After a long heavy tramp (as\n\nusual we lumped a shovel & extra stuff , on to our usual weight) we came to some trench where we were told to halt. We are the company in support, as usual had to start digging a new trench, but thank Goodness, there’s an excellent sleeping pozzy dug, covered in overhead.","43":" At 2 a.m. we knocked off digging, reported to company headquarters & went on ration carrying. I hate that job, we went down to an overhead bridge in the town near the railway station (ruined by shells now). It was a slippery walk, but coming back, after the limber arrived, & carrying the tea, it was brighter & a chap could see better where he was going. We only carried to D Coy, so didn’t have the long walk to the front line. Had some tea & bacon at 4 a.m., the latter was all fat. We did look-out duty in turn for 2 hours in our section (only 5 of us), & slept in our pozzy all day long. I had a snack of bread, butter (margarine rather) & jam at 5 p.m.. It is very quiet, some aeroplanes up now, but not many shells flying here just now. Went down for rations (stew & tea) at 9 p.m. It struck me while waiting at the place where the limbers bring the food, what a mess Fritz would make\n\nmake if he knew the 4 parties of men & the limbers were in a heap there twice a night. After carrying up the food & partaking of ours, we began digging again about 10.30 p.m. About midnight a chap carrying a big thermos stumbled on to the trench we were digging in the dark, poor beggar was lost, he had been carrying stew to B Coy’s posts out in front, & lost his way trying to get back. It is a great shame to send a man alone on that, as the front is not joined up & is only a collection of outposts really. He said a Fritz flare was sent up only 20 yards from him once, & there he was without a rifle, & a big thermos on his back. He was in an unnerved state when he struck us, & we put him on the track to B Coy. Headqrs. pozzy alright. It was a good job the Fritz flare went up, or he might have walked right into their lines. Our company is to go into the front line tomorrow night, so it looks as if we are only up for 4 days. If the two there are as quiet as in supports, we’ll be right.","44":" Knocked off digging at 1.30 am & went down for the dry rations & tea, they were carried back & handed out before daylight. Had a quiet day, slept all day in our pozzy, bar the line each one was on the look-out. I saw an aeroplane sent to earth by machine gun fire from another, \n\nbut couldn’t tell from where I was whether it was ours or his. When he comes over our side, he keeps up a great height, & our shrapnel followed two of his ’planes for a long time, went very close, but didn’t bring them down. He sent more shells into the already ruined town of Villers- Bretonneux. It was a lovely sunny day today. When it got dark about 10 p.m. we went on up & relieved B Coy. in the front line. I was in a detached post with 3 others in unusual surroundings, we were right on the edge of a steep railway cutting, below us in the cutting were the two sets of train lines, & on the high bank opposite was a post of the 14th Bn. A hedge ran right in front, & we had to keep a sharp look-out for Fritz in case he came sneaking along it. Our own shells were dropping short, & rather close to us at times. Hadn’t been there half an hour when another cove & I had to go along to 15 Platoon, they were short of men, & as 4 of them were going out on patrol, 4 of us from 13 Platoon went along to their post. It was a very quiet spot, our shells were carrying souvenirs over to him pretty regularly, & some of our planes were droning overhead, & Fritz was displaying searchlights & other pretty lights all night. Once a ‘plane\n\n of his dropped some bombs with an awful roar up to our right, & trench mortars dropped some on our left, but we weren’t troubled. The patrol returned safely after a 2 hour roam in No Man’s Land, saw nothing.","45":" Were digging till dawn, connecting our post with the next. Bright sunny day; did 2 hours lookout each, & slept most of the day. The order of life is reversed at war, awake at night, & sleep (when the enemy will let you) by day. I was grieved to see in \"The Times\", which I glanced at today that Pidcock has died of wounds. Curse the war, nearly every good man is going, they will be very sorry to hear it at home. It seems to be cruel to go under after being at the war since the start. The hot stew & tea arrived at 10 p.m. by the good old ration carriers. Stew & tea never taste so nice as in the line, where you have been all day without a hot meal, with bread, jam, cheese &c. Started digging then & knocked off when daylight began to appear at 3.30.","46":" Hot tea & the day’s rations arrived as usual before daylight. Fritz made us duck to the foot of the trench by suddenly sending over those horrible whizz-bangs, which are on you with a \"swish\" before you know they’re coming. They seemed to be\n\njust on top of our heads, but hit the edge of the town in rear, am glad he didn’t shorten his range by 150 yards. Very quiet all day, hot & sunny. One man on the post watched every 2 hours, & the rest slept most of the day. What a strange existence! There I was with my boots & equipment off, sleeping in the front line, blue sky overhead, bright sunshine, & skylarks singing in the air; & yet this cursed war goes on month after month, with good men dying daily in hundreds. Though it is so quiet here, we know any minute his guns could open & it would turn to Hell itself. He is uncannily quiet, but our guns were sending them over quietly all day, & at 5 pm. they sent over a fierce fire for 20 minutes on a wood to the right of us. We watched the bombardment, shells were raining down & throwing up the earth, & any Germans under it must have had a fearful time. There are all sorts of insects about the trenches, but the chats are not nearly as bad as I expected they’d be. I saw the wing of one of our ‘planes falling from the air this morning, a chap told me the ’plane itself crashed to the ground just before; another airman would be reported \"Killed in action\" in the papers. When we were digging a connecting trench to the next post before daylight this morning, I was surprised to see Boo come along\n\n with one of our patrols. My word he has rotten luck, he had just done two nights patrol with B Coy. whose place we took & they went back in supports. One night one of their patrol of 4 men disappeared, & hasn’t been heard of since. Well, one of D Coy. patrol got crook or something, & instead of sending out one of our men, they sent to B Coy. & poor old Boo was the Jonah. It’s a rotten job out on patrol in No Man’s Land, walking up & down, & every now & again Fritz sends up flares, & the poor old patrol is out there standing fast while they’re up, & wondering if a machine gun has spotted them. Besides this, they are in an unknown land between the two sides, & never know when they’ll run fair into an enemy patrol. He used to bring all sorts of extra jobs on himself when in camp as a sergeant, but now he’s over here as a \nsergeant\n private he seems to have bad luck in striking the extra things that crop up. A couple of hours later I saw them return all right, & he should have had a full day’s sleep today, as there is no moving about in the day time. The stew & tea arrived about 10.30 p.m., after which my little party carried on with the trench digging as usual till dawn.","47":" We watched our trench mortars giving pie to an old house & heap of rubbish at daybreak, where Fritz is supposed to have\n\na machine gun pozzy. They did throw the dirt up. When it was properly light, issued the day’s rations, which, with hot tea, had just been brought up as usual, & then we turned into our burrows like rabbits, & slept all day. It is exceedingly quiet, wonderfully so considering it is the front line on the Amiens front, but the Hun is evidently just waiting for the time to make his next mighty attack. Our guns, however, give him very little peace, & send the shells over pretty constantly. We were relieved tonight by the 16th Bn. Got right out without mishap, not a shell coming then – just as well the enemy doesn’t know the right moment to pour them over. We got back to dugouts by a sunken road about midnight, & the tea & stew were very acceptable. Warburton & I shared one, I found the previous tenant had left some chocolate in it, & I soon polished it off.","48":" 3 years today, eh, since the Turks made the big attack on Gallipoli to try & drive us into the sea, & still the war goes on. The cookers are a mile & a half away, & we have to tramp to them three times a day & lump the tea & food. When there is no hop over, a man has more rest in the front line. It is \n\nmarvellous the luck of this game, half an hour after we had carried the breakfast from the cookers to our company, Fritz plastered the road with shells for ¼ of an hour, but we quietly watched them bursting from our pozzies by the embankment 100 yards away; as I said before, if he only knew when & where to put ’em exactly!. The first job after breakfast was to have a shave and get our weekly whiskers off, didn’t it hurt too! then cleaned my teeth, had a wash, & sat in the glorious bright sunshine with no shirt on. It is a perfect day, Sunday too, one can’t imagine there is an awful war right near us, it is a real Sydney day, when one takes a run over to Manly, or in to the Gardens, the bush around us is a picture but a dead horse & uprooted trees tell of war’s destruction. Across on the opposite slope is a very nice white cross in memory of some of our brave Australian boys, it bears this inscription \"In memory of Officers. N.C.Os & Men of the 50th Batt’n , AIF who fell in the counter attack which recaptured Villers Bretonneux on 24\/25 April 1918,\" the battalion’s colors were under the inscription . I got a parcel from Mone today, a tin of biscuits, took them down to Boo & Eldridge, who were comfortably resting in their dugout, & we had a feed. There was some boxing on in the air between our ’planes & Fritz’s, & one of his\n\ncame down crash. We started walking over in that direction but it was too far away.","49":" Blowed if they didn’t have us digging a new trench back here (in case Fritz breaks through) from midnight till 4 a.m. It was hot work. Had Breakfast at 5. Had a sleep before & after dinner, but it’s not like a night sleep. Anyway, we are to go out for a spell, the 3rd Australian Division are relieving us tonight. Another lovely sunny day. About 11 p.m. we marched out by platoons along the road, the Y.M.C.A. had a drink of cocoa by the roadside. It was a bright moonlight night, & it was a beautiful sight coming along the road, which ran between avenues of big green trees, which were a picture in the moonlight. We stopped in open country where some overhead covering was up to sleep under, the weather is dry lately luckily. Had a drink of tea on arriving at midnight, then spread our oilsheets on the ground under the awning & went to sleep.","50":" Had a lovely loaf all day in the green fields of France, the trenches are only a couple of miles away, but we have forgotten war already, it is so nice here. It was a very hot day, & 3 pm. we went to Blangy Tronville & had a swim in the Somme River. It was \n\na perfect treat, & we did enjoy it. It is a peculiar river, more like a canal, very narrow & has a swift current. Has no high banks like our Australian rivers, & if it rose a few feet it would be well over the bank. Saw Boo on the opposite bank, he was dressed ready to march back with B Coy. as we got in. I was surprised to see Strangman -Taylor there, he is in the 15th Bn. now, I used to be in the same Coy. as he in camp at Liverpool. We got back about 6, & after tea all sat out in the grass reading, then some had a game of leapfrog & jumping. We were having a read in our tent after turning in, when the throb of a Fritz ’plane was heard on a night raid, so we promptly put our candles out. ","51":" We moved on again, & some brainy \"head\" in his wisdom, made the hour of starting 12 noon. It was a hot day, & as we carried fighting order & oilsheet, greatcoat & &c ., the march soon became positive torture. We were absolutely soaked in perspiration in our heavy uniform, rifle & load, but we simply had to trudge on, & with more than a feeling of relief we turned into the beautiful grounds of a fine chateau, & halted under lovely big green trees in the shade beside the river. The scenery was beautiful – the chaps threw off their equipment & clothes, & soon the battalion was having a swim in the swift current of the Somme. The chateau, of course is not\n\noccupied by its owner, the Huns’ advance having forced him to leave. I was thinking what a glorious spot it would be for a holiday or a picnic in peace time. We had some tea & bully beef, & at 2.30 pm moved on again, this time we didn’t wear our tunics, strapped them on our back with the other gear. It was a terribly hot march, but through lovely scenery, green trees & crops & grass; some of the crops are out in ear, & it is cruel to see them going to waste, the inhabitants, of course, have had to clear out. On either side of the road we marched along, were lovely big green leafy trees, & if it were a holiday instead of war, how one would enjoy it! The band met us, & we came to the village of Allonville, where we went into billets – my platoon are in the usual old barn. I’d much rather be in the open field we spent the last two days in, but one thing here, we are away from the roar of the guns & there is no digging or wiring, & we will have sleep at nights. Don’t know how long our spell lasts. Saw Boo tonight, his barn is just up the street. Was very sorry to see by the casualty list in the \"Daily Mail\" that Lt. Bonnily has died of wounds. He was\n\nwith the reinforcements in the villages on our way to join the battalions, was a grand chap, told me he had never been away from his battalion (a Tasmanian) one day on account of wounds or sickness, & had been in every stunt, but his turn has come now. Still another life gone in this cursed war! Thursday 23 May Went on sick parade today, as I want to get a couple of teeth stopped which got broken lately. The doctor gave me a chit for the dentist, & he fixed ‘em up. I had to laugh to see Boo, he was on fatigue, picking up paper & rubbish in the gutter, it’s a rum life in the army. Barney Davis & I used our nuts & had the afternoon off parade also, supposedly with the dentist, of course. Bought some chocolate at the canteen, & adjourned to a lovely park & ate it & had a read. At night there was a concert by the 4th Brigade Pierrots, it wasn’t bad. Our billet has the usual space between the barn & house full of filth. & green scum, & a pig, & cow & horse are stalled around us – wish we were camped in the lovely green forest near the village, instead of in it in barns. Sat outside the door writing letters till it got dark at 10 p.m. Boo came along with a lovely lot of letters for me, as I was turning in. They were enclosed with his in an envelope from the Bank in London, \n\n7 from Elsie, & 1 each from Will, Nin & Mone. They were full of interesting news, & it took me nearly till midnight to digest them. The chaps around me are snoring, bar a happy party who are talking & laughing, happy & half shick after partaking of much vin banc. \n","52":" I was told to attend at a N.C.O’s class today, it lasts 6 days. There are 16 corporals at it. The 4 of us from D Coy reported at B.O.R., & were told to go to the hangars to the battalion parade ground. Over we went to the hangars in the green field, & the 14th Bn were there, no sign of our lot; we looked round, sat down, then returned to the village, & found our battalion were in a field on the other side. It was a glorious site, the clover was thick with flowers, & red poppies grew amongst the green grass, & lovely green trees waved in the breeze. I had to smile when we turned up at the school, they started on left & right turn, & sloping arms by numbers. A Lt is in charge. Some of the chaps have been in the trenches a long time & are pretty rotten on their detail, but I’ve had so much of this stuff, I know it off by heart. It rained & we didn’t go out in the afternoon. After tea \n\nI wrote long letters to Mother & Elsie. ","53":" Had saluting by numbers & rifle exercises today. At 3 pm. we marched down to the next village, Cardonette, & had a hot shower, & were given a clean shirt & underpants each, it was very nice to feel quite clean & ‘new’ again. At night a cove from the 16th Bn. & I found an estaminet where they had eggs, & we had a good feed, 5 fried eggs & 3 glasses of coffee each. It was the only one in the town, most of the people have gone, & they were making a fortune. The place was full of soldiers & an old chap fried the eggs on a small stove in a little pan, so it was a case of wait your turn. The chap I was with, is billeted down at Cardonette, & he got a dozen eggs & carted them in his hat. On the stool near us sat a V.C. hero, a country-looking old chap from W.A., named O’Mara. Came back, had a yarn to Boo, & went to \"bed\".","54":" Reveille at 6.30. pretty tough for Sunday, but it was a big morning. We fell in at 8.30, & the whole of the 4th Brigade marched out a couple of miles along the road; before church parade started, the old Brig. (Brig.-Gen Brand) pointed out a ridge & wood to us, & explained a night stunt we are to carry out tomorrow\n\nnight – we weren’t delighted to hear it, as apart from the night stunt itself, it points to a hop over for us as soon as we go back in the line. After church parade General Birdwood presented military medals, D.C.Ms & M.Cs to men & officers who won them some time back. Then he gave us all a very fine address, a sort of farewell, as he is to leave the Australian Corps & go to an Army. However, he said the Commander in Chief had promised him the Australians would still be with him. He referred to the","55":" years he had been with the boys in Egypt, Gallipoli & France, also he said the Australian soldiers had done more for the name of Australia than all the politicians since the days of Adam. We all then marched past old Birdie, he had on one of our turned up felt hats, & came back to Allonville. After dinner I played in a cricket match, D Coy. v. Bn. Headqrs. We went to one field, & some chaps were having a practice, then we were told the match would be in a field where the Bn. parade ground is, so we went there, but the 14th Bn. were playing there.\n\nThen our band arrived, so we had a band & no ground or gear. Lt. Col Marks & the Adjt. came along then, & we adjourned to where we were first. Couldn’t persuade the others there to give up the wicket they made, so we played on the grass, it was a very rough wicket. I was sent in first with Wilkinson, & after I had scored 2, a shooter got me. We got 60, & they won by 3 wickets. Was just starting to read the \"Daily Mail\" by candle light as usual after turning in, when the drone of a Fritz ’plane was heard, & all lights were put out. The searchlight tried to locate it, & our Lewis gunners poured some rounds up towards the sky.","56":"\n\nWas stiff & tired after the cricket yesterday, was drilling at the N.C.O’s school all morning. There was no afternoon parade, on account of tonight’s big stunt. I would have liked a sleep in the afternoon, but they had a scratch match, so I couldn’t resist a game of cricket. My arm was stiff from yesterday, but I was bowling most of the time & got 3 wickets. They made 79 – it was on the same bumpy wicket as yesterday. However, our side won, I was very tired when I finished, got top score, 26 & was given run\n\nout, tho’ I was well home. \"Sundries\" was the only other double figures on our side. Fell in at 8.30p.m. for the night stunt. We marched out along the road a couple of miles, & formed \noff\n up at the starting point. We were reserve battalion. The moon rose before we started luckily, so a chap could see where he was walking. We had to go through a wood & thick crop, which was in ear & up to our shoulders. The forest was a beautiful sight in the moonlight, lovely green trees overhead, & brought thoughts of romance rather than war. Our searchlights were playing about the sky trying to locate a Fritz ’plane which could be heard, & they found him, & all the lights were concentrated on him, he looked like a pretty, silver bird in the light. Then our anti-aircraft guns opened out, & we saw the flash of bursting shells, & hoped to see him come down. Some shrapnel burst in front of him & I thought they’d get him, especially as the rap, rap of the Lewis guns , firing on all sides, joined in. However, he turned after a while, & got out of the rays of the search-lights, & they couldn’t pick him up again. Later on we heard the awful roar of bombs exploding. We went through \n\nthe crop & forest in single file, don’t know how the leader kept his direction. Our company stopped at a spot at midnight, it was jolly cold, we lay on the grass for an hour, & then the welcome sound of a bugle sounding \"no parade\" denoted that the stunt was over.","57":" We set off for \"home\" at 1a.m., there were some fireworks on view, lovely lights of different kinds Fritz was sending up, Goodness knows what they mean. Hot cocoa was ready when we got in. Morning parade was cut out, I didn’t get up for breakfast, was too tired after the cricket & night march. Got up at 11, cleaned my boots, rifle &c for parade after dinner. Carried on at the N.C.Os school. We played cricket after parade at 4 p.m., D Coy. v B Coy. Knocked off at 5 for tea, resumed at 5.30. They made 83 & 89, we got 71, & going at the bowling in the fading light won the match before 9 p.m. (can play later here than Australia) by 3 wickets. I got 6 in the first innings, 19 the second. Had a letter from Col today. Wedn. 29 May After falling in in morning, we were lined up along the road to see an armoured car, & the officer of it described it to us. It can travel both forward & backward. Then I went along with the N.C.O’s school party. In the afternoon I didn’t have to go on parade, Wilkinson, Crain, & I were picked from\n\nD. Coy to play with the 13th Bn. against the 4th Machine gunners. They elected me captain, they made 88 & we had 9 for 164, so won easily; I scored 8, had no luck, pulled a short ball off the wicket on to the stumps. After tea, at 6.30p.m., my platoon,","58":" played the rest of D Coy & we won by 117 to 73, I got 5 runs & 4 wickets. We finished at 9, & Crain & I had a feed of fried eggs at the estaminet before \"bed\". I was pleased to get a couple of photos from Elsie today, they are excellent ones of her.","59":"\n\nHad a bit of an exam at the school this morning, he said \"very good\" when I had done my little bit, but it was simple stuff I had often done before. In the afternoon, we dumped our packs & blankets, & are ready to start for the line again in the morning. I am not one of the lucky 331\/3 % to be left out – the war news is very rotten again, the British being driven back once more. After tea, Cpl. Mann, Skipper, & I went to the \"Smart Set\", the 4th Division concert party – they were splendid, every item very good. One chap was very clever, dressed as a woman, wore some nice frocks\n\nlast night, as two shells fell right in their billets, & 19 men were killed, & 62 wounded. It is a cruel business, men back resting too, & it was bad luck getting fair on to the sheds they were sleeping in. We halted beside the Somme River about 9.30 a.m. under the lovely trees, & stayed there during the day. I had a sleep before dinner, & a dip in the swift flowing river in the afternoon, & feel nice & fresh. A gun is blazing away at the Huns with an awful roar near where we are. At 9 p.m. we marched off, went along a narrow road which ran along the bank of the river, & walked without a stop for 2 ½ hours. We came (pen run dry) to Corbie, a nice town now deserted, crossed the river & various swamps by means of footbridges of wood, followed a track through long green grass, & trees, & eventually came to the position in reserves we took up. We had a very narrow squeak. Fritz sent some shells over just where my section passed half a minute before. We got against a bank by the sunken road, & more burst 10 yards or so in front of us, just where we had come past. A bit of stone hit me under the left eye, & further along the bank a chap was wounded in the leg by a piece of shell, & got a nice \"Blighty\". When the shells stopped we continued to the dugout we are\n\n to occupy. Relieved the 53rd Bn. who went off when we arrived. The dugouts are very comfortable, I’m in one with Crain, there is a mattress on the ground, pillows, & curtains round the side, salvaged from the houses in the abandoned town, of course.","60":" Slept & read all day. In the evening we watched a lot of our big aeroplanes up above, Fritz was pouring shrapnel at them, the weather is still bright & sunny, the country everywhere being a picture, what a contrast to the winter! The news in the paper is bad, the Germans have now captured Soissons, wonder if they’ll come at us in this sector. When it got dark about 10 p.m. we started on the usual old fatigue. Marched along the road in fighting order, carrying picks & shovels, turned into long grass, & dug a communication trench towards the front line. Tape was laid on the ground to show the direction. As we were digging, in the dark, one of our chaps was hit in the temple by a bullet, & it came out his nose. We came back to our dugouts about 3 a.m., it always beats me how the leader finds his way in the dark, I’m hanged if I knew whether we were going towards our pozzy or Fritz.","61":"\n\nGot back at 3 a.m., & at 3.30 the limber arrived with our breakfast. What an opening for the Sabbath day we had! We had about half finished our\n\nbacon & tea , when the Brute began to drop shells very close. The two mules in the limber stood with their ears up, frightened, but steady. Then a strong smell & burning sensation in the nostrils told us he was sending over gas shells with the others, & we had to let breakfast rip & put on our gas masks. The driver of the limber jumped on the back of one of the mules, & very hurriedly drove away, & luckily got away safely. For over an hour we sat with our respirators on, & with nose gripped, & breathing through a mouthpiece, you feel every now & again as if you want to swallow or clear your mouth of saliva, but you daren’t take your mask off. The shells poured over on the flat, & round the dugouts till 5 a.m., when we took our masks off. I had a sleep till hot tea arrived at 11, then went across to B Coy’s pozzies, & was delighted to find Boo was alright, also Eldridge, tho’ shells had dropped very close. Unfortunately one fell right in a dugout two signallers were in, one was killed, the other died of wounds. One poor chap’s hand lay right the other side of the road to the dugout. Had a sleep & read in the afternoon. Stew & tea came up by the limber at 5 p.m. As usual on Sunday I read a few chapters of the New\n\nTestament Mother gave me before I sailed the first time in 1914 & which I’ve carried ever since. I always read a bit on Sundays. A 10.30 p.m. we set off again on the eternal digging fatigue, halted for a while for orders, & he sent over some more gas, & we had to put on our respirators. It didn’t last long fortunately; it is very awkward with your mouth over the mouthpiece breathing that way, & to make things worse mine was clogged somehow temporarily, & I nearly choked, no air seemed to be coming through for a while, & I was glad when the officer said \"All clear\", & we could take them off. We dug at a new trench till 2 a.m., I had a devil of a head ache & was glad to get back to our good old dugout. Once an aeroplane overhead dropped a magnificent flare, one mass of red spangles, we stood stock still, & Fritz sent out a salvo near it but no one was hit.","62":" I went to sleep at 2.30 a.m. when we got in; was awakened when breakfast came up at 3.15. Fritz was shelling a bit, & the driver hurried away with the limber. Had our tea, & once again, the brute sent over the gas shells, the driver came back just as the shells were falling round; poor beggar has a rough spin the last few mornings, as he can’t dive into a dugout & leave the limber & mules. He yelled out \"Are the empty dixies ready?\" & a chap said \"That’s gas, boy\". He dug his spurs into the mule he was riding, wheeled them round, & away\n\nrattled the limber. The \"all clear\" was given after we had worn our respirators about ¼ of an hour. I lay down then for another snooze, but was soon awake as I could hear the chaps talking as they watched two Fritz ’planes up very early, & a couple of our old slow scouts came across. Our chap sailed slowly through the air with a Fritz ’plane on top of him, & it looked a million to one on Fritz. The Hun swooped down on to the tail of our machine, & ours quietly turned the tail upwards, poured in a few bullets from his machine gun, & to the delight of our lads watching, the Fritz ’plane went crashing to the earth. It was the coolest thing out, so unexpected too. The other Fritz ’plane & ours then exchanged fire at close range from their machine guns, when our two turned off & Fritz went back towards his lines. We could hear our machine guns in the front trenches rapping out bullets at the Hun. Our two ’planes just watched round slowly up above, & the old sport who had the win must feel very proud & happy. Below us, the town of Corbie lies partly hidden in the green trees, & now & again the roar of the Huns’ big shells can be heard crashing there. The green slopes between look lovely covered with yellow flowers but the black & white smoke of Fritz’s bursting shells\n\n churns them up at intervals. Had a sleep till 12,when tucker again came up. The Brigadier of our 4th Brigade (Brand) & 4th Division commander (Major Gen. Mc Lagan) passed our dugout, & the latter said \"Good morning boys\" as he passed. (Got my pen filled when I went back to the transport lines, as I’ll now relate). I was told by the A.S.M. that I had to report to B.O.R. at 4 p.m., so I shaved, packed my gear & set off; was told I had to go down to the transport lines to give evidence in a court martial. I was surprised, as I knew nothing about any court martial case. Didn’t know where the transport lines are either, but an officer said they were on the other side of Daours, so I started on a long trudge of 7 miles. Got about a mile along the Somme Canal when a 13th Bn. limber, which had been up with the rations, came along, & I worded the driver & hopped in. Luckily he was going right back, so besides saving me the walk, I didn’t have to hunt round for the place. The field cookers were a few miles back, so I had tea there, as I had left our pozzy before the stew arrived. On reporting at the orderly room back at the transport lines, they didn’t know what I had been sent down for, & I’m blowed if it wasn’t Corporal Geikie who was wanted , & not I. Our names aren’t much alike either, still it’s the army.\n\nall over. H.Q. staff & stores staff are back there, & I had mutton & onion sauce, followed by rice \nwith\n milk & sugar none the less, from their cook-house. It’s always the way, the chaps in the Q.M’s well back have the easy time & tons of good tucker, & the boys who do the fighting the rough stuff. I’ll have to tramp back to the lines tomorrow, but as I got a lift down, have had a good feed, & will have no fatigue tonight, & none of Fritz’s gas shells, I don’t mind their silly mistake. The lousy brutes said there were no blankets there, & I had a pretty cold sleep in my overcoat.","63":" There was a limber going back to the line at 3 p.m., but the officer back here thought I’d better go straight back for fear the adjutant might say something, then when I asked him if I could leave my equipment, rifle & gear to come up by the limber, he said I’d be passing brigade head quarters, & the Brigadier would go off pop if he saw me not in fighting order, so I had to set off on the long tramp back lumping everything, over their mistake too, - a pity some of these brutes didn’t have to carry it themselves. Well I struck the 3rd Division limber going as far as\n\nDaours, & hopped in that, & it cut about a mile off, then I trudged along the road by the Somme Canal, it was a nice cool cloudy day luckily. A couple of miles along the canal I came to our battalion cookers, had a drink of tea, & left my equipment & load there with the Q.M.S, to send up on the limber with the rations, in spite of the other fiddler in the rear. The walk the rest of the way was nothing to an infantryman, not having that gear to carry. On arriving at Corbie, the town about a kilo from our line, I saw the two chaps going back on a waggon to to give evidence on the case in question. Bennett- Caten was one, & he said \"Go & have a drink of cocoa at the Y.M,\" – they were in a deserted brick building, & alongside were military hot showers & change of clothing, so I had a bath & felt clean & free from the old chats, so all’s well that ends well. I came on back, saw Boo, he gave me a pair of socks Mum had enclosed in a parcel. The limber brought up my gear alright. Fritz shelled us pretty solidly about 3 p.m., but none fell in any of the dugouts thank Goodness; one chap coming across the fields was wounded by a shell. I got a parcel today from the\n\nAustralian Comforts Funds, London sent on behalf of the Head Office Staff of Bank N.S.W., very nice things in it too & a nice letter enclosed from K.A. Birkmyre hon. sec for the committee. The limber arrived with a hot drink of cocoa about 9.30 p.m. as usual, & when it was dark at 10.30 we set off on our customary digging job about a mile away. An engineer officer pointed out the work, digging a trench 4 feet deep – it was soft earth , & already half dug, so didn’t take long, & we were back in our little \"homes\" at 1.30 a.m. Even when home is only a dugout, it’s the nicest spot there is, just because it is home, & Crain & I are comfortable in our pozzy, with the mattress on the ground, & quilts round the sides, evidently salvaged from the houses in Corbie by previous soldier boys.","64":" Went straight to sleep on coming in from digging at 1.30, roused up at 3 when breakfast arrived (tea & bacon), went to sleep again till cocoa came up at 11.30. About 4 dinner comes up (tea & stew) & at 10 p.m. cocoa before starting out on fatigue. The rations for 24 hours (bread, jam & cheese or margarine) are issued each afternoon. We had a good day as regards shelling \n\nhe didn’t put many over our way today. Some of the chaps have been sent down to the base, crook with the gas lately. Went out digging as usual at dark, 10.30 p.m.; were at a new spot tonight, the line to be dug was marked out by tape laid on the ground by the engineers. It was very hard ground, the pick would hardly go in it, let alone a shovel, & it was jolly hard work. My back was aching, when at 2.30 a.m. the welcome order was given \"Get your gear on\", not that the work was done, but it was beginning to get a bit like daylight, & it wouldn’t do for Fritz’s ’planes or balloons to spot a big working party.\n","65":" The usual routine today, sleeping in our dugouts, reading & eating. If only all this precious time & energy were devoted to production instead of destruction, what a different world this would be. Wish an earthquake would wipe out the Huns, & we could all get back home. His shells again gave us a quiet time today, he is putting a few well back on the road near Corbie. We went out digging again at the same hard ground as last night, & returned at 2.30 a.m. Saw Boo go past with a fatigue party from B Coy. ","66":" Limber\n\narrived at 3 a.m. with breakfast, after which we went to sleep in our dugouts, & slept & read the papers all day as usual. I saw an Inverell Argus a chap gave me, haven’t seen one for years, since I was a kid in Warialda. The weather is still bright & fine, the nights are pretty cool though. Went out digging as usual at 10.30 p.m., just as we started the brute sent over shells too close to be pleasant, but they weren’t straight enough. It’s a coot digging, with no dugout to get in, & hear them whistling towards you.","67":"\n\nCame back at 2 a.m., breakfast came up at 3, then we lay down in our dugouts & slept till noon, isn’t it a rotten existence, as the Froggies say, \"la guerre no bon.\" I got a parcel today from Elsie, a cake. Went across to see Boo this afternoon, he’s O.K. I was having a read in my dugout before we went out digging, & heard a big shell roaring in the distance. It then sounded as if it was going to fall horribly close, & it shook the ground as it burst near a dugout on the slope. It blew the candle out there, & made some chaps scatter, who were playing cards. Went out \n\ntrench digging as usual, and after we had done about an hours work, he began to shell, & sent gas over too. We had to cease & put our gas masks on, & as it continued to come over, the digging was stopped. We stayed in a trench till 2 a.m., & then returned \"home\" to our dugouts. \n","68":" Usual thing again today. I wrote to Mother & Elsie this afternoon. The weather turned cold, & we had some rain this evening. Lumped a lot of shell cases from an old gun pozzy today, they will be sent back as salvage. Went out trench digging as usual at 10.30 p.m., & came back at 2.30 a.m. without mishap. It is a queer game, there we were digging this new reserve line, & shells soaring well over our heads both to & from Fritz.","69":" Slept till noon as per usual. At 2 p.m. our company went down to Corbie, & had hot showers & change of clothes, very nice & refreshing the bath was too. We went to a postcard shop (the town is deserted & shell torn) & there were thousands & thousands of very nice postcards & c. Our chaps were groping on the floor among the cards making a collection, I got a fair lot & shall send them home tomorrow. Fritz opened up a\n\nnasty fire on us for a while in the evening, one shell lobbed just behind my dugout, & as it only has a sheet of galvanised iron on top, another 5 yards & it would have \"been good night nurse\". He spread them about too, but nobody was hit. Went out digging as usual, had to deepen a trench, & as we finished & had our work passed, we were allowed to come home in groups of 10 without waiting for the whole company, & my mate & I were back before 1 a.m.","70":" Had a sleep till the tea & bacon came up at 3 a.m., & then slept till dinner time. In the afternoon I did a lot of writing, sent the postcards I salvaged to Min, Mone, Elsie, Will & Dorothy, & wrote letters to Bon & Kathleen Tofft. We didn’t go out digging tonight.","71":" Breakfast 6 a.m. & we set off with the old pick & shovel once more down the road through a village with everything smashed by shells as usual, & came to our job. We had to dig a trench 6 feet deep to lay a cable in. It was a filthy job, first of all, insects were sucking blood from our arms, & getting in one’s eyes & ears, & about 4 or 5 feet down the ground held water & was muck\n\nwith a rotten smell. It was a job to throw it out from the bottom, you couldn’t hoist it off the shovel, it was too sticky, & if you put it near the edge at your head, some of the muck fell in on you. The engineers brought the cable, 3 ropes of it, laid it along the bottom, & we shovelled 6 feet of earth in again. The poor old infantry do all the dirty work & fighting too. Got back about 12, when I was sad indeed to hear Freedman was killed by a shell last night, & 5 others wounded. I went across to A Coy’s dugouts, & it was only too true, his body was on a stretcher, & 4 of them carried it off, the chaplain with them. No language could describe the horror of this cursed war, & if God would only end this awful slaughter of good men! A man hasn’t a chance, here was Freedman back here at night, & suddenly struck down like a leaf. Only a few days ago, I was talking to him, & he looked a picture of health & vigour, he said he had a whiff of gas, & was hoping he might get worse & get a Blighty out of it. Everyone hopes for a \"Blighty\", that is a wound or sickness just bad enough to get them over to England out of it all. At night I\n\nwent up to the front line with Lts. Irvine & Lilley & 2 other N.C.Os to have a look at the part we will be taking over from the 14th Bn. Went along a road, & then out through a field, & came to the support trench. It is a queer game, this war. Fritz has the high ground here, & we were in plain view of his position as we went on up to the front line, but evidently it was too dark for him to see us, as no bullets interfered with us. There is a high crop in No Man’s Land which is awkward for a patrol, as they couldn’t help making a noise walking about in it. Fritz dropped some shells in front of where the officer was showing us our platoon would be, & we got down into the trench till they stopped. We got back about midnight.","72":" Had a good sleep in morning. Boo came across in afternoon, bringing a parcel from home with him. We ate a tin of peaches & some chocolate. There were 3 pairs of socks too, & we both have more socks than we can carry now. Our Company went out on this everlasting digging at dark, we dug, dug, dug, while up in the front, Fritz kept up his flares & so lighting the\n\ndarkness, & overhead shells shrieked each way. It must cost him a lot for flares, we rarely send any up. We dug a trench 6 feet deep, then the engineers laid a cable in it , & we shovelled the dirt in again, & arrived back, weary, at 3.30 a.m.","73":" Very cold & windy today. Slept & read papers during the day. He didn’t send more than a few shells our way all day \nLater\n A Fritz ’plane was up before dark, & our Lewis gunners had a crack at him without result. Later on, Fritz sent over some big shells, & we watched them from our dugouts bursting near the dugouts of 15 platoon of our company, on the slope below us. They seemed to burst fair on some dugouts & it seemed certain someone would be hit. It was funny to see some of the chaps scurrying across like rabbits to battalion headquarters, where there is a deep tunnel dug, evidently the shells were too close to risk staying where they were. When Fritz stopped, I took a stroll over, & it was wonderful how some escaped. One chap was standing near his dugout talking , & heard it coming, & before he could crawl in , the shell burst & made a big hole in the ground, not more\n\nthan a single yard away from him. It actually blew the heavy steel helmet off his head, & it was a miracle how he escaped. He wasn’t harmed in the slightest, another hole was two yards in front of a dugout, nearly a direct hit on the chaps in it. In this cursed game, one never knows when peaceful moments are suddenly ended by the roar of a shell, & someone is knocked out. No digging tonight, thank Goodness.","74":" Sleeping & reading in the old dugout most of the day, sent some picture books home to the kiddies that I got down in Corbie. Nasty, cold wind blowing today. There is a raid on by the 14th Bn. up in front tonight, & at 11.30 p.m. the guns round us opened up the barrages. Unfortunately, I’ve got to go up to the line tonight, so won’t have much sleep. A N.C.O. from each platoon & an officer are going up to prepare for the relief tomorrow night.","75":"\n\nWas having a nice sleep when I was called at 2.30 a.m. Lt Hall led 5 of us up to the line, I went to the part in close supports my platoon will occupy. The party our lot will relieve had just returned from their raid & were\n\neagerly discussing their experiences. They had a good scrap with the Huns, killed several & brought in 3 prisoners & a machine gun, they were lucky, only had 4 wounded. Was having a sleep during the morning, when he put some shells near our dugout in the trench, & woke me up with a start. Rained a bit today, then came out nice & sunny again. A big drove of our planes came over in the evening, & I counted 26 in the air at once. Fritz poured shrapnel up at them, & the black puffs burst all round them, but they just flew on over his lines like big birds. Saw a great bit of work by one of our airmen, a batch of 6 were coming from his way, & a Fritz ’plane was up & set off for home. Two of ours turned round & set after him, they came down quickly & gained on the Fritz. The chase went on till they caught him, one went underneath him, used his machine gun, & down went Fritz on his long fall to the ground. The victor quietly rose up high again, & resumed his flight. Then I watched a grand exhibition of trick work by another Allied airman. Up above, he turned a back somersault, & flew upside down, then turned sideways firing his machine gun, circled round, turning over & over & doing most marvellous things. It was dirt to Fritz doing it in front of his eyes, & I wish\n\nwe were boss of the ground as we are of the air , & the cursed war would soon be over. Our company came up about 11.30 p.m., & the 14th went out. He shelled pretty solidly, & they roared around the trench as they burst, but a miss is as good as a mile. Old Mitchell & I slept in a dugout together, I would have liked a blanket it was pretty cold. Although it is June, the nights are cold, & pity help us next winter.","76":" Breakfast arrived at 3 a.m., such as it was, a drink of tea, which was glorious & put fresh life into one after the night, & a piece of bacon, all fat, not so nice. Slept till 2 p.m. when old Mitchell boiled a mess tin of water, & we had a drink & some bread & jam. I have a tin of chocolate & milk Mone sent. The hot drink was very nice , as we can’t get a hot meal till after dark up here, it’s not safe to bring it up in daylight, as when we were back in reserve. Just before dark one of our ’planes flew low over Fritz’s lines, & I saw the bullets as they flashed from his machine gun, he was firing tracer bullets at the Hun; they fired machine guns & rifles back at the ’plane, but didn’t bring it down. I was walking along the trench about 10.30 p.m.with my mess tin\n\nas we filed along to get our stew, & was talking to the chap in front of me, when a shell burst right in my ear up on the parapet, it seemed to force the words back down my throat. Then when we were filing back, one hit the parapet & knocked the dirt in one chap’s tin, & just missed mine as a chap was pouring my tea into it. There were 4 or 5 of us at the spot, & we had a miraculous escape, as the shell was a dud, & there it was poking through into the trench without having exploded.","77":"\n\nSlept till noon when old Mitchell & I had a hot drink & a snack. In the afternoon, I walked through the sap back to B Coy. in reserve to see Boo, & got a nice lot of letters which the Bank in London had sent on to him. I got 4 from Elsie, & 1 from Mother & Mone. Min was then up at Gwydirfield for a holiday. Just as I am writing this in my diary, LT Col Murray, V.C. DSO & bar, D.C.M. walked by & asked me how I was getting on. He is a grand chap, very brave, & very, very few men live to gain the honors he has. Our company are relieving C Coy in the front line tomorrow night, & I have to go up tonight in advance for our platoon.","78":" Raining at 2 a.m. when the advance party from the different platoons assembled at Coy. Headq’r’s. Had the usual wait there for half an hour, then set off up the sap to the front line. It was a job to push along the narrow trench with\n\nequipment on, got out of the sap & walked along a road to the front line, & then away along the top, my platoon was on the right. The trench was already very muddy from the rain, & luckily there was an empty dugout, so not \ncarrying\n caring a hang for the Boche over the way, I crawled in & had a sleep. As usual the front line is the best place to be, no shells. The sun came out later, & I was hoping the mud would dry up, but the confounded rain came on again. My dugout in the front of the trench, with waterproof sheet over the face, resisted valiantly, but at last drip, drip, came the muddy splashes, & I bent like the figure 8 in the narrow pozzy, dodging the drops. The rain stopped later & the trench was 6 inches deep in yellow water. Little Baddock, only a kid & a mere handful, got out & drained with a shovel, then he took his boots & socks off. The water ran on round the corner, so the chaps in those pozzies had to deal with it then. This French mud takes beating, - it’s a queer life, we were ignoring old Fritz opposite; he no doubt, was busy baling out water & mud too. Had a snack of bread & jam, & some nice hot tea a chap made, the little Tommy cookers are great for boiling water in the trench. \n\nRead the war news in the \"Daily Mail\" of Monday. The Austrians are making a big offensive now. D Coy arrived at 11.30 p.m. & C Coy went back to supports. I was disgusted to hear my company had had their stew & tea before coming up, & C Coy won’t have theirs till they get \nup\n back; I was mighty hungry, & to use a military term thought I’d \"come a gutser\", but the three of us who came up last night were told to go back to supports with C Coy for tea, so I went back, had a hot meal, & came back to the line.","79":" Quiet night on our front, the 3rd Division on our right came down & said they could see a Fritz working party out. Dawn arrived early, & on \"stand down\" all except the observation on post turned into their dugouts for a sleep. Cruel luck befell us today, our company commander Capt. Darcy Irvine & our platoon officer, Lt Lilley both being shot by our own A Company, & the former died soon afterwards. They went out to have a look at a chalkpit in front in bright daylight, & A Coy., on our left, fired with the above result. It is very sad Darcy Irvine was one of the best, both in & out of the line, & after 3 years war in Gallipoli & France to be killed by our own men is very rotten. Another officer came up to take charge of the Company, also one for our platoon. The\n\nlatter is a one star artist named Smith, who has just got his com. Sgt. Dwyer, platoon sgt. turned into his dugout feeling crook, so I showed the new cove over our section of the trench. Found out yarning to him he was in the same officers’ school as Dad Ryan & Clarrie Hall. A young American soldier (NCO) was brought to our platoon tonight, a few of them have come up for experience of the trenches, before their huge armies come in to finish the Hun. I could hardly talk to him for laughing, I had heard coves on the stage taking off Yanks, & it seemed funny to hear this chap talking in the same strain seriously. He said to me \"We’re keen to be right in it, we’ve got a fine lot of young guys.\" I asked him what the general opinion was in America about the war, & he said the ‘opinion is we’ll whip em right soon.\" The poor Yank didn’t have a very nice night for a start, as it was raining, & very mucky under foot. We had no pozzy for him to sleep in tomorrow, so he’ll have to dig himself one. Our platoon is only 22 strong. A listening post & digging jobs used up all bar the No 1 & & 2 of the Lewis gun in the trench, so if Fritz only knew \n\nthe trench opposite to him was lightly held. Patrols were constantly out till dawn came at 3 a.m. when everything was quiet once more.","80":"\n\nNearly got hit in the head by a bullet today; one of our ‘planes was up & the Huns were firing with their machine guns. I was just drying my face with a towel after shaving. & was standing in the trench talking, & I stepped aside as Sgt. Dwyer came along & stood where I had been. There was a crack as a bullet fired at the aeroplane hit on the sergeant’s steel hat, knocking a hole in it & then falling off. What luck, eh, there was I without a hat on, so it would have gone through my skull. Had a sleep & read all day, the front is very quiet & only for the artillery you would hardly know there’s a war on. We saw a big black dog run across No Man’s land & into the wood by Fritz’s trenches today, some of them fired at him but missed him, I suppose he was carrying a message. The confounded rain came on again tonight, & it was sticky & miserable underfoot. I had to go with a party to 15 platoon, deepening & widening a trench, & it was a rotten job – you got wet if you didn’t wear your macintosh, & if you did wear it you could hardly use the pick & shovel so not much work was done; didn’t the chaps roar, eh! \n\nIt’s a rotten life there’s no doubt, don’t know what a man lumps a rifle everywhere for, half the time he is using a pick & shovel. Out in front, Fritz’s flare kings were constantly sending up flares & lighting up No Man’s land. We were all pleased when the first streaks of dawn at 3 a.m. put an end to the digging. It is dead funny, there’s Fritz over the way, & we here, & only for the artillery, neither seems to take any notice of the other, yet if either were to attack, it would be hell itself set loose, & death raining down everywhere.","81":" Slept & read all day, on observation for an hour. It is very cold today, an icy wind blowing & as this is summer, pity help us in the winter. Thank Goodness, it is fine again, & the trench is dry under foot. Life commenced again when it got dark at 10.30 p.m.. all hands being awake & ready for whatever the night brings forth. It is a moonlight night, our side poured some shrapnel over his way. The stew & tea arrived at 11.30 p.m., & weren’t we all awaiting it, after only having the bread & jam ration all day. Fritz startled us by suddenly shelling our front line tonight, the first\n\n time he has done so since we came in. He spread them right along our company, & they dropped very close, but only one fell in the trench, & no one was there. The ration party had been up & gone luckily. I went down on the left with a digging party tonight, & as B Coy were digging further along, I took the opportunity of slipping along to see Boo. He & Eldridge & big Browny were wielding the pick & shovel. He gave me letters from Bon & Dorothy, am glad Bon is still in England, he has been put in a mounted section & expects to be there another month. Fritz dropped more shells very close to where we were digging, it is a bright, moonlight night & rather too light to be walking along on top, a bullet whizzed by my ear once, so I got down & walked along the trench. Got a lovely parcel from Elsie tonight, butter scotch, chocolate ginger, figs & butter – won’t it be a treat here in the front line where there’s no canteen eh.\n","82":" Slept till 3.p.m, wrote a long letter to Elsie & home in the afternoon. Smith, our new one star artist, signed it without reading it, decent bloke. Uneventful day, ’planes up as usual, artillery fire fairly regular from our side, Fritz quiet during day. Stew arrived up at 11 p.m., then the night jobs commenced. I took a party \n\n \n\ndown to Lt. Hall, & we were deepening the front line trench, the usual patrols were out, & in the moonlight we were pretty visible. Knocked off work 3 a.m., had tea & bacon, slept as usual.","83":" On observation 1 to 2 p.m. Old Mitchell made some coffee & milk as per usual, & we ate our daily ration of bread & jam; the chocolates Elsie sent went well today. Bitterly cold again considering it is midsummer. Dull & rainy in evening, a Fritz ’plane flew low over our lines & our machine guns rattled out on him, but didn’t fetch him down. The usual party from our platoon went down to the left deepening the trench again tonight. Our side sent gas over tonight, & after a while Fritz shelled us solidly for 1\/4 hour, we sat huddled in the trench where we were digging while they fell all round us, it is a rotten feeling. About 3 a.m. we knocked off & wearily returned to our own part of the trench.","84":" The usual lot of fat bacon & tea for breakfast. I issued my section with the day’s ration of bread, cheese & margarine, plum jam today, a change after apricot. A couple of little Tommy cookers & tin of cocoa & milk were also issued for the section. Very foggy this morning, & \n\n \n\nwe can’t see far into No Man’s land. My turn on observation & gas guard from 5 to 6 a.m.. after which I had just turned into my comfy little dugout, & was nicely asleep when the order \"Stand to\" came along & all the sleepers had to turn out, much to their disgust. As not a gun could be heard, we were hoping old Sol would disperse the fog, & make the light brighter so as they’d let us go back to \"bed\". It was certainly a good morning for a silent raid, the message said Fritz showed signs of massing on the left, but evidently someone had the \"windup\", as after standing wearily for two hours, \"stand down\" came along, & all but the look-out man turned in. Slept till 2 p.m. when old Mitchell & I had our customary snack & hot drink. Our ’planes were conspicuous by their absence this evening, & Fritz had a lot flying about, got quite cocky & when our Lewis guns opened out on one ’plane flying above us, he returned fire from his machine gun, & made us get under the parapet. Later on, when our ’planes appeared, he kept away behind his own lines. We sat down & had the usual \"chat\" hunt in shirts & pants, & it proved successful, of course. Nice sunny day, but it came up cloudy & rainy looking again at night . On fatigue again deepening & widening the front line trench.\n\nThere was a Hun in a pozzy just about 70 yards in front of our trench, & he had a bang at me as I was walking along the top of the top of the trench, it is safer walking along the bottom of the trench but a bally nuisance round corners & bumping the narrow sides, so generally we take a risk & walk in comfort, & much more quickly along the top. He threw over some shells for a while tonight, but they fell about 30 yards behind us. Our trench mortar shook one of his machine gun pozzies up in No Man’s land. Things were very lively away over to our left, artillery fire galore, & Fritz was sending up all sorts of flares, white lights, red, green & all sorts, evidently he was being raided by one of our battalions.","85":" Came back to our platoon at daybreak. We are being relieved tonight by the 50th Bn. & I had to go back as guide for our platoon. They’d break your heart the great method they show; instead of, as I expected, meeting the new company just down the road by supports, & guiding them up to their position in the line, the guide for each platoon had to go away back to where the 50th were resting near Daours. They gave us scarcely any directions for getting there, but luckily I had been down on the false alarm trip some \n\nweeks ago, & knew the way to take my company guides. It was 5 miles when we got there, the captain of the company our lot take up, who of course, had already been up to see the line he was to take over, was surprised we had come so far back, said he expected we’d guide his platoons up from the cross-roads. Of course, the coots who sent us down don’t care if we have to do the trip down, back & down again (15 miles). We got down to the 50th about 6 p.m., they gave us some tea, & about 10p.m their battalion moved on up. I went with the platoon who will relieve the lot I’m with in the line. There were other guides at the crossroads, & the new lot got to the line, & took over from us without mishap. It is just as well the enemy don’t know when a relief is taking place in this game, or his shells would do some harm. Our company didn’t have the same fortune going out, & there’s no doubt this war is an awful business. We left by platoons, ours had a rough spin going down to the rear, don’t know whether the Boche had an idea of what was on, or was just shelling the rear as per usual, but some shells hit the road in front of us. We made off to the left, & others fell\n\nin the direction we had to go, but trusting to fate we went on, wondering if the next would come over before we passed where the last one burst. We came to the village of Fouilloy , & my nose bled a bit, - strange to say, it bled this afternoon for a while too. He was putting over high explosive shells that were bursting to our left with an awful roar, & we noticed a strong smell of gas that burnt the nose & made us sneeze, so we put on our gas masks. We came out on the road by the Somme Canal, & halted where the cookers were, & had a hot meal., tea & stew. On reaching there we heard the rotten news that No15 platoon of our company were amongst the shells & Bartholomew was killed, Warne died later of wounds, & 5 others were wounded. It is cruel luck after doing 7 days in the front line without mishap to be knocked going out for a spell.","86":"\n\nAfter having our meal, we went on to the place near Daours where we are to rest, it is a nice spot among green trees & grass, & a river & ponds near. We arrived at 3.30 a.m. & soon turned in wearily. Breakfast 10 a.m. Of course, they must\n\n worry the men, & had a parade at 4 p.m., rifle inspection & foot inspection, then we had to burn the straw in the dugouts, & got fresh stuff. I’m in a dugout with old Mitchell, he’s not a bad old chap, but I miss my good pals of the grand old 3rd Bn, & have no particular pal here. Went along to B Coy to see Boo, was delighted to find him fit & well, also Eldridge. Had a letter from Will today. ","87":" Decent sleep last night, reveille 7.30 this morning. They wouldn’t let us rest in peace, there was a parade at 9 & inspection. Lewis gun teams fell out for instruction, then the scouts, & there were only 6 of us left, the company is pretty weak now. We were put on filling in shell holes on the ground where we fall in, it would be laughable, only it annoys you after coming out of the line. The sergeant major went crook on us, because the O.C. (a big, fat, bullock driver to look at, who has just come to us, after the good man we lost) went off at him because there was nobody working once; they had all sloped. We fell in again at 2 p.m., & a sergeant was told to march us away, & give us rifle exercises. Didn’t the boys growl as they marched off; no wonder, men out from the front line for a rest getting recruits’\n\ndrill. The sergeant took us into the trees, gave us slope arms, fix & unfix bayonets, then pile arms, & we sat down & yarned till we came back. Had a swim in the Somme afterwards; a Fritz ’plane came right over, & our anti-aircraft & Lewis guns opened out on all sides from the trees, he turned & there were several of our chaps undressed on the bank, wouldn’t their white bodies be a plain target from above, eh! However Fritz was travelling too fast to get away from the shrap, to fire his machine gun at a few of us. The battalion was paid today, & the gambling soon started, two up being first favorite, & there were groups in a circle, & shouts of \"some money tails\", \"I want 200\", & c. Saw Boo again today, he was playing cards with some of his company, & the francs & franc notes lay on the waterproof sheet in the centre.","88":" Had a practice at platoon in attack this morning, then we went along the Somme Canal into Daours, & all had hot showers at the military baths, & handed in our dirty clothes, & got washed ones. It was bonza to feel thoroughly clean again but one soon gets chatty. Everything looked a picture\n\n as we came back along the canal, the green trees & grass & among the grass the yellow flowers & red poppies were lovely. In the afternoon we fell in & had rifle exercises, old Kelaher being in his element. The","89":" Brigade Pierrots gave a concert in the open up here tonight, they weren’t bad. Got a couple of delayed letters from Min & Elsie today, also one from Bon, Boo had one too written a week later. Bon is still in camp in England & having a pretty fair time. There are some big guns in the wood near us, & the scenery is beautiful, la belle France. Had a read by candle light in the dugout till midnight.","90":" Had an interesting day today. Breakfast 7.30, & then parties from each company of each of the 4 battalions in our brigade set off, we marched to the other side of Daours where motor lorries took us on, through the city of Amiens, to the place where we had a practice attack with tanks. There are rumours that we are to be in a big hop over with tanks soon, it looks as if it’s right by this, - well, a man can only take what comes his way, & trust to Providence. We got off the lorries & there were the tanks, an English Brigadier-general explained the scheme of attack & the objective. I was \n\n \n\ndelighted when he said we could have a ride on them afterwards. I sat on the back of one, our chaps filled it inside & on top. They are wonderful things there’s no doubt, they have a crew of 8, an officer, N.C.O & 6 men, they are proof against bullets, but a direct hit from a shell knocks them out, & as they can only travel so slowly over the rough, shell-torn ground, this often happens. Well, it started off with a jerk, came to a shell-hole, quietly went into it, & up again the other side, then crossed a trench, & came to a steep bank & stopped. It then simply raised its nose, climbed the bank & went on, travelled right along a trench, & could have poured fire into any Huns there. It came to some small trees & just knocked them down & went on & knocked out an imaginary enemy strong post with its 6 pounder guns. On the level ground they can go pretty fast, look just like huge caterpillars plodding along. Provided they get across to the enemy lines alright, they’d be grand things in an attack & would put the wind up the enemy infantry, who would be powerless to defend themselves, but they draw the \n\nenemy’s artillery fire, & the poor old infantry advancing with them get pie. We had some lunch we took & came back by the lorries to Daours, & walked the rest. Amiens is a big city, all but a few of the 90 odd thousand people have had to leave there, as Fritz is not far away & shells & bombs it, \"but he’ll never take it while we’re here\", say the Aussies. When we got back to our spot, there were a lot of Yanks there, they will be mixed up with us, good style of chaps they look too, as they ought to, as America hasn’t lost her best men yet like the other Allies. Saw Boo again this evening. Wrote to Bon at night.","91":" Well, we are in for a hop over alright. Lt. Col. Marks addressed the Battalion under the trees this evening, & explained the part the battalion is to play in the attack. My Company D is to go over first, take the first two trenches, & stay there, & A, B, & C companies will go on past us, our battalion will have three tanks, & aeroplanes will take part too. It is to be hoped Fritz doesn’t get wind of it, if he spots the extra artillery & tanks beforehand, things will be only middling. There is a fearful lot of thinking to be done by the heads preparing for it, the good old Brig. (Brig. Gen Brand) rode along, & the boys cheered him, he got \n\noff his horse, said he had just been across to England, & brought back a cricket cup with him for a Brigade competition, & that we’d be able to play next Sunday he thought (I guess the lucky ones who come out, will). The old chap didn’t say much, seemed pretty worried, & not his usual hard case self. Lt. Col. Marks said the Prime Minister would be here tomorrow; the chaps laughed & I don’t think old Billy Hughes will get much of a reception. Boo, Eldridge, Smith & I had tea under the trees, had some extra stuff from the canteen & from parcels. Wrote a letter home & to Elsie this evening.","92":" We were addressed by two of our Australian politicians this afternoon, Billy Hughes & Joe Cook. Little Billy made a good speech, there’s no doubt he’s a marvellous man, he hasn’t the strength of a child to look at, is a poor, thin, miserable, misshapen looking chap, & his head is the biggest part of his body, but his eloquence is there. I don’t know how he stands the life, continual worry & speechifying. Joe Cook made a speech too. A big gun in the wood fired while Billy was speaking, he said \"Damn that gun.\" General Birdwood was\n\nthere, I like \"Birdy\", he gave me a friendly nod, not that he knows me, but he’s not a bit like a general with the boys. Generals Monash & McLagan were also there. Billy came round afterwards, & shook hands with two ranks, & our old Brig., who was evidently busy & wanted to get away, said \"Is there anyone here knows Mr Hughes personally?\" There was no reply, so he spoke in Billy’s ear & drew him away. I was one of the last to shake with Billy, he called me \"sir.\" After tea we all drew extra arms, bombs & grenades, pick & shovel. Lor’ knows how we’ll go over the top with all this load, a chap won’t have the strength to bayonet a plum pudding, let alone a Fritz. Our platoon officer Mr Smith, explained our position on the map, & how to read a map by the numbers & letters, to the N.C.O’s of his platoon. We are hoping the attack will be very successful, & that few of our good lads may fall. Our company moved up to the line tonight, Boo’s will go up tomorrow night. I saw him, also Smith & Eldridge before we went up, & wished them luck. We got to the front line safely, & the 50th Bn went out. There is a lot of luck in this game alright, on the road up, Fritz was dropping shells both\n\non the right & left of the road, but none on it luckily where we were going along, also lots of limbers going to & from the line. Just as well he doesn’t know the exact spot to put them.","93":" At 4 a.m. the usual one man watch started, an hour each in turn, & the others slept all day. I had a good \nluck\n look at the ground we are to go over, it is a long way across to the ridge & wood where Fritz’s trenches start, but he is sure to have isolated machine gun pozzies in the open that will trouble us, & there is a high crop in No Man’ land too. Everything is very quiet today, & there are no signs that he has any idea of what is to happen. I don’t feel the slightest bit excited now, but when the starting moment arrives, & our hopes rest on the tanks working without any hitch, it will be more sensational. Had a good sleep during the day.Thursday","94":" America’s National Day today, & the Yanks & Australians carried out the attack. Well I’ll describe this grand & wonderful thing, & in its results unutterably horrible, they call a battle. After hot stew last night, at 2.30 a.m. my platoon (our barbed wire having previously been cut) crawled out, & lay along a tape line.\n\nAll other companies carried out their allotted duties, but of course, what happened with them I don’t know, I can only describe my own experiences. At 3.2 a.m. the usual morning strafe was put into Vaire Wood by our artillery for 8 minutes, & at 3.10 crash came the barrage from all our guns, & we moved forward slowly – one would think the awful crash of artillery & bursting shells would deafen or drive you crazy, but your blood is warm, & really, I felt as cool as could be, just slightly \"Keen\" I’ll admit. We moved to within 30 to 50 yards of our barrage, & one felt he could go through to Berlin under it. However, there is a temptation to go too fast, & one of our shells burst fair among our company, & played havoc. I was pleased to see the tanks moving forward, they had arrived to time without mishap. After 3 minutes our barrage lifted another 100 yards, & we moved on, the companies were now rather mixed up. Came to a trench, & I saw a Fritz with his hands up surrendering to some of our boys, they fired into other dugouts, in case there were some hiding in there before we moved on. I was amongst some Yanks & A Coy now, the tanks still trudged along, & day was breaking. I then saw the tank in front of me hit with a shell. After going about 800 yards, D Company’s objective was reached & we immediately began to dig in, while A, B & C Coys. \n\npushed on past us ,& went ahead. The shells still screamed & our aeroplanes flew low overhead. Fritz prisoners in twos & threes were being brought back, then a tank came along, & a chap was pulled out of it dead drunk, a tank officer came along with a revolver, & was almost going to shoot him; the officer in charge of the tank this corporal came out of, said \"he’s not drunk, he’s delirious from the shell fumes\", but one whiff of his breath told me he was drunk too. The corporal was struggling, so I was told to tie his hands behind his back, & put him in a shell hole. He soon was in a heavy sleep, & we tried to put 3 Fritz prisoners on carrying him back, but he was so heavy & limp from booze the young Fritzies couldn’t. We dug in unmolested while our other lads pushed on ahead, & I was digging when I heard a chap from B Coy who came over on the \"Euripides\" say \"Geddes is hit\". I questioned him, & he told me Boo was hit in the thigh, & was lying in a shell hole, so I went ahead to B Coy in front (didn’t give a hang for permission) anyway our platoon officer & sergeant are both wounded), so Cpl. Curley is head man of the platoon). I was wishing before, I was with the lot pushing ahead whacking the\n\nHun, but when I got to where Boo was I saw some sights – the men who brought this war on the world ought to be tortured to death. It was very strange, for a start our chaps were digging in & standing up in daylight walking about, their objective was reached, & Fritz wasn’t yet kicking back. I was delighted to see Boo lying in a shell hole, pale but conscious, his right thigh bandaged & all blood, but a smile on his face as he spoke. Near by, were cruel sights, dead Australians & Yanks, & men groaning with awful wounds. They had to be there till the stretcher bearers could take them, they had been hit by our shells, moved too fast behind the barrage. Boo said a shell burst near, & Eldridge dived into a deep hole, & he in one very shallow, & as he tried to get in a deeper one, another shell burst & blew him into a hole, & he sat on his rifle. Just then a young German looked over the edge, & the comical part was, Boo, wounded in the leg, made an attempt to point his rifle at the young Fritz & told him to surrender. Fritz put up his hands, & said \"Kamarad\", & there was Booey with his wounded leg & Fritz opposite; he said the latter could have knocked him out easily. All the wounded chaps were shivering with cold, one poor Yank said to \n","95":" \"I’m shot to pieces, are the stretcher bearers coming?\" 3","96":" Bn. stretcher bearers came along & said they could take one if someone could give a hand, so the 4 of us carried the Yank (he seemed worst) away back to the dressing station, one at each corner, & with the stretcher on our shoulders. Lor’ it was hard work, talk about heavy, I was done when we reached the dressing station, & how these grand stretcher bearers make trip after trip down with the wounded, Goodness only knows. Some time later 4 of the 13th Bn. bearers brought Boo down, & I saw him safely carried off by 4 Field Ambulance bearers to the relay station, where motors carry them off to hospital. He was very bright, smoked his pipe, & hasn’t a serious wound, 3 nasty flesh hits. I’m relieved he is safely out of the cursed business ( for a while anyhow). ’Planes were up & Fritz’s came over too, & one of ours I saw falling to earth. He shelled behind our new line solidly before noon. I saw some pals lying dead, also Yanks, Aussies & Huns, a hellish, cruel business war is. After Boo had been taken, I went back to my trench. On the road up, I was talking to an English artillery officer & he said the\n\n whole thing was successful so far, many prisoners being sent back. Of course it will look very nice in the papers. \"gallant advance by Australians.\" but the people who write it, & delight in reading it, don’t know the horror of it all. The thing that was grand to see was the way our chaps bandaged wounded Huns, & carried them back to the dressing station, with just the same care as our own men, & Australians, Yanks & Fritzes lay side by side on stretchers. Some of the Yanks soon went under in their first battle, they only arrived in France a little while ago too. When I got back to our company’s trench, I was just about to jump in, when a shell burst right in front of me, I don’t know how it missed me. He sent more over all round our not-too-secure trench, & we & the Yanks were huddled up in the bottom like chickens, & didn’t know which way to turn to get away from them. It’s an awful feeling, so helpless, under shell fire. It’s a fine day, & our ‘planes are up in crowds trying to detect the Boche’s next move. I was mighty hungry, & had a feed of bread, butter & jam at noon., \nwhich\n while Fritz’s shells were dropping uncomfortably near. He shelled both front & rear. & there was a slight sniff of gas, which made us sneeze. Old Mitchell \n\nthe only one left in my section, & I had a Tommy cooker & tin of cocoa & milk, & we soon boiled some water in the trench & had a nice hot drink of cocoa. Vaire Wood is behind our line now, & it is now very thin & the trees bare from the continual shelling. I found a Fritz pocket book containing note book, post cards, letters, German little printed books, photos, & c. The name of the previous owner was Wilhelm Kulka., 4 Komp. Inftr. Regt. 13 The letters were not a week old, were dated 26 June & 27 June from Essen, & a postcard from Mulheim 26 June, wish I could read German. Our company had to carry the rations tonight for the battalion. I had 10 men, & had to carry to B Coy. in the front line. I went along the trench to the C.S.M. at 10 p.m., & the different parties were just being sent off under a corporal, when I had the narrowest escape any man could well have. The bullets from a German machine gun away in the distance suddenly swished along, & one with a loud whack thumped me on the steel helmet at the back of the skull. It dented the hat making a big hollow, but didn’t pierce it, & I was unharmed, only the weight of the blow on the steel hat making my head ache the\n\nchap near me got a nice \"Blighty\" a hit in the shoulder, the stretcher bearers took him away, lucky dog. Had I been closer to where the bullet was fired from, it would have gone through the hat, but without it, as it was, I’d have been killed on the spot. Before I could get away with my lot, both sides started shelling ferociously. Fritz’s shells crashed all round our trench, & it was useless to attempt to set off to the rear with the party. The artillery (ours firing the most) played their duet for an hour, & as Fritz seemed to be letting our trench alone for a while, I set off with my party of chaps, & Americans. The Yanks were very windy. No wonder poor beggars, their first sight of war. We had to go away down to the chalkpit beside a road where the limbers could bring them so far, & we had to carry them on. His shells were falling back here too. The rations hadn’t arrived, so the 4 parties waited in the chalkpit, we were tired & dozed off to sleep. Talk about the luck of the game, the shells were bursting up on top of each side of the hollow, & had they dropped in, they’d have got lots. The limbers finally came up about 12, & the lads lumped the petrol tins full of tea & the big thermos of stew for the line. We reached our D Coy trench alright, & a guide from B Coy was to lead my party to the\n\nline. However in the dark, he got properly mixed & lost, & as the walking was awful, the ground being a mass of shell holes & very rough, the chaps carrying the thermos roared a treat. The Yanks, new at the game & under the guidance of Australians in their first experience of war, never said a word in protest. We began to wonder if our guide would ever find his company, & as the line is not connected up, but only isolated posts, there was a danger of going into the Hun lines in the dark. Finally he struck A Coy., & they showed him where B Coy. were. We dropped the tucker, came back & had our own stew, then set off for the ration dump to bring the rations (bread, jam, cheese) & bacon for breakfast. We got to B Coy. without any trouble this time, & then had to take the empty thermos back. Fritz sent gas over, as we came back, making the air white, but it was hard enough to see as it was, & we walked through it without putting the gas masks on; it made us sneeze & our eyes water, but wasn’t strong, just tear gas. Had another weary tramp back to the ration dump with the empty thermos & back to our lines, & thank goodness, the night’s labors are over. The 4th of July, eh, its been a strenuous day, many poor chaps have given their lives, & the Yanks have spent it differently to anything they did before. Friday 5July Had bacon &\n\nwe made some cocoa with the Tommy cooker at 4 a.m. was fine, & the air was alive with German ‘planes - where ours were I don’t know, but I’ve never seen so many Huns up before, crowds of them flying where they liked; some came right over where we were, & one big chunky ‘plane flying fairly low, Mitchell & I fired at, but he sailed on. It’s very exceptional for Fritz to be in the majority in the air. Wrote up my diary in morning & lay down in the bottom of our new trench, & had an uncomfortable sleep. There was a new idea in yesterday’s battle, our aeroplanes brought ammunition, & dropped it from above for us in parachutes, which slowly dropped to the earth. Our company had some sad luck today, some big shells seemed to burst very close to 15 Platoon, on our right. One shell hit the trench, & 2 corporals, Charlie Mann & Marie Holt, two of the finest chaps in the whole battalion, were lying asleep in the bottom of the trench. They were blown to pieces, another chap was badly wounded, another deafened & a fifth got a very bad shaking. One chap, instead of sleeping in the trench, decided to sleep in a shell hole just behind it, & he was untouched, although his equipment was blown to bits. The two were so knocked about that they buried them in the broken trench, & I went along there, as Lt Player read\n\nthe burial service. Cpl Holt’s head was missing, & one leg knocked off. Good heavens, it’s an awful business. You never know what a minute will bring forth. Only last night I saw Charlie Mann, who was in charge of one of the ration carrying parties, & told him I was glad he was still alright. There \nis\n are only \none\n two officers & two sergeants here now in our company, & our platoon strength is 9, we came in with 26. The drone of aeroplanes filled the air towards evening, & I counted 63, wouldn’t civilians go mad if they saw that many up at once, eh! Ration carrying again tonight, I had a party of 10 carrying to C Coy from the chalkpit where the limbers come up to. The signallers on the ’phone wire in our trench have two pigeons in a basket; they are for use, in case of emergency, to send a message back to headquarters, in case the line is cut, & runners killed. They are always fed at headq’rs by the one man, & not fed here, so when released they go to their home. This evening two were sent back, after two others were brought up in another basket & they flew like one thing for our headquarters. We set off down to the quarry for the tucker, & luckily got there without being shelled. We sat there & waited for an hour, & shells roared all round the quarry luckily none fell in it; gas\n\nalso came over & noticing it in our eyes & nose, we put our gas masks on. A chap came along to say the limbers had left the tucker away back at our old trench, so we had to go down there for it. The chaps did roar, said \"Why didn’t you leave it down in Corbie ?\" another said, (very fed up) \"You mustn’t expect horses to come up this road, horses are more valuable than men.\" We got the stew & tea to C Coy alright, ration carrying is an awful job, toiling on over rough ground full of shell holes, & the poor beggars with the heavy thermos of stew on their backs are to be pitied. The papers say its for liberty & freedom, so they ought to know, but I wish the brutes had to do it. We had our own tea, & then went down again for the rations, Fritz dropped some shells on the road, we got the tucker safely to C Coy’s C.S.M., & went back to our trenches, when our side began to pour a heavy bombardment over to Fritz. He replied, & there was a fierce artillery duet. The shells dropped right about our trench, we sat huddled up in the bottom of the trench, while these big iron foundries burst with a dreadful crash, & one wondered when he would be hit, & his torture ended. It was something cruel to be under, but I didn’t feel very frightened, one sort of gets resigned to it. A young signaller near to me quivered all over as the awful things could be\n\nheard whistling near, but he still clung to his receiver. He shuddered as a 5.9 burst over us, & said \"I cant stand it much longer\", but I knew sooner or later the shelling would cease, which it did at last. Another N.C.O., Cpl. Bolus, the Coy. Clerk, was badly wounded in the leg, & several had to leave with bad shell shock. We had some breakfast then.Saty. 6 July Our sadly dwindling company lay down in the bottom of the trench, & had a sleep. A chap made me laugh this morning, he was bending down laying some wire, & there was a snap inside his pocket he said \"I’ve done my fountain pen\", then he looked in his tunic pocket; & said \"No, its only my watch.\" Fritz poured shells galore in the open ground behind us during the day, & did make the dust fly. Thank goodness we’re going out tonight, there are only 9 in our platoon left. We set off from the trench about 10 p.m.` Some papers (Daily Mails) came up today, & we eagerly read the account of our advance on Thursday. We got back to dugouts about 11.30 p.m., & after the usual old hot stew, turned in wearily. Five of us were in one dugout, & the chaps salvaged a couple of mattresses from other dugouts, & we lay side by side, & had a bonza sleep. We were amused in the night, when a chap suddenly jumped\n\nup & crawled over us, must have been dreaming of the Huns.","97":" It was lovely to have a nice quiet day of rest again here behind the line, although Fritz sent over a shell that sent us scurrying into our dugouts. It’s funny, one seems to be more frightened of the stray shell here, than the many in the line. Had a letter from Bon today, wrote to him after tea. We went & had a look at an anti-\naircraft\n tank gun which our chaps captured in Hamel in the hop over. The Tommies were firing it back at the Huns, they found some ammunition for it there.","98":" We went down to Corbie for a hot shower & change of clothing this morning, it was a treat after the trenches. I was amused at a notice I saw on the wall of a shell torn building in Corbie, it was in pencil \"13,000 miles to Griffiths Bros’, teas,\" with a railway signal drawn near it, like the notices one sees along the railway lines towards Sydney. Had an easy day, reading & resting. There are guns galore all round us here, I saw a chap named McIntyre on one gun, he used to be in the Light Horse, & was in the same ward as I at St. Andrew’s, Malta in 1915. ","99":" We went on the usual old digging fatigue today, had to go a long way down through\n\nthe deserted & shattered village of Fouilloy, & along the Somme Canal. The job was to dig a 6 feet trench for the engineers to lay a cable in; the boys didn’t bust themselves, & we didn’t finish the job today, as the ground was too rocky. The field cookers were handy, & we had a nice drink of cocoa for lunch. The boys gave a cheer when the \"put your equipment on\" order was given soon after lunch. There was a tricky scrap at our dugouts this evening, an Irishman & an Englishman (in the A.I.F.) had a row, & resorted to fists. It was a rum fight, they both ended with faces all blood, & dead beat; one chap had a cut lip from his false teeth, & was sent to the A.M.C. to have it patched. It was comical when a chap tried to stop them, said \"you’ll be gathering a crowd, & Fritz’s aeroplanes will spot ‘em\". The infantry & artillery around soon spotted the scrap, but no Huns were in the air. Had a little rain this evening, & the ground as usual was soon very slippery.","100":" Had some porridge for breakfast, it was very nice. I went over with a N.C.O. from each of the other 3 companies today as advance agents to our new pozzy. We set off at 12.30p.m. and\n\nwent down through Corbie & stopped at the Y.M. for a drink of cocoa. Corbie is a lovely town, prettily situated on the Somme, with some very nice buildings, & it is a shame to see it shattered. We walked through Corbie & on through lovely country, the crops all out in, & flowers growing wild in the fields, red poppies among blue & white flowers. The Crops, like the villages have had to be abandoned when Fritz pushed in March. We came finally to a village called Lahoussoye & were told that the 37th Battalion was camped hereabouts, & we are to take their pozzies when they go out. All the directions we got were practically nil, but I suppose being Australians, they thought we had plenty of savvy & could find the place. Nearly every soldier we asked on the road, belonging to other Australian divisions, hadn’t the slightest idea, but at least we found them. A, B, C & D Coys were spread all over the compass. Merrett & I went to C & D, & the two for A & B left us a mile further back. I got there at 3.30, went to the cook-house; & had a bonza feed, roast rabbit & potatoes. I don’t know when I last tasted roast spuds. I had a chat to the 37th chaps, & then looked up the company sergeant major, he showed me round the pozzies. It is a lovely spot here tall green \n\ntrees with grassy slopes leading up to woods on the hills, & two villages can be seen below among the trees. The chaps tell me Fritz never shells here either, so we ought to have a decent time. I got a comfortable pozzy, & a blanket from one of the boys.","101":" The 37th Bn. reveille was at 3 a.m., they had breakfast, & then moved away. Their cook was a white man if ever there was one, he brought me a dixie of tea, hot toast, & 3 rissoles before they left. I got up at 7. & went up the road to the village of La Houssoye. D Coy. came along about 8, & I escorted them to our pozzies. Our packs came along, so we have our felt hats instead of the \"heavy steel\" helmets. Had a roll call & rifle inspection at 2 p.m. I wrote a long letter home this evening. There was a heavy shower of rain this afternoon; the chaps went off to sample the village wine, & to see what’s to be seen there after tea. About 11 p.m. several rolled home tight in the rain, singing \"I must go home tonight.\"","102":" We had a parade in the morning, & new Lewis gun sections were formed to replace the casualties. There was a cricket match after dinner, our \n\ncompany, D, played C. The wicket was the road, we had no matting, but it wasn’t too bad a wicket. We went in first & got 142. They went in & got 27, Wilkinson & I bowled unchanged, & I got 6 wickets for 10. They went in again, & he gave some other chaps a bowl until 5 were out, when I went on again, & got 5 wickets for 3; they scored 59, so we won by an innings & 56 runs. I finished with an average alright, 11 wickets for 13. Read the \"Daily Mail\" outside my dugout in the evening; it is nice back here, no Hun shells, or digging, or ration carrying.","103":" Usual parade in morning, but it was of the kill- time variety. We did a few rifle exercises, & sat down. The sports were continued in the afternoon, D Coy. pulling C in the tug-of-war. I had a letter from Boo today, he was taken to Rouen & went under an operation on Saturday so his leg must have been pretty bad. I hope he does not come back to la guerre anyhow; also had a letter from Bon, he is having a bonza spin in England. An aeroplane of Fritz’s came over this evening & set one of our balloons on fire, the two occupants jumped out in parachutes in time luckily. The balloon\n\nburst into flame, & fell till it vanished in smoke. The Hun plane then turned to the next balloon, we saw two forms come from it, & two parachutes opened & came slowly towards the earth. Fritz fired into that balloon, & it soon burst into flame & was consumed. Our anti-aircraft guns opened, but couldn’t hit the brute. We then saw two men jump from a third balloon, & the parachutes opened alright & they came slowly to earth, while the balloon was hauled down before it was destroyed. It was a victory for Fritz alright, who flew back to his own lines; how I wished some of our ’planes were about to give him what for.","104":" \n\nD Coy. played B Coy. this afternoon, but it was a rotten match, the wicket being too bad. Some other soldiers were playing on the nice little ground & road pitch where we played C Coy., & we played on a rough wicket over near B Coy. We went in & only got 45, I got bowled first ball. Soon after they went in, it rained, & on this French clay the ball was very slippery to hold, & I couldn’t get near my usual pace bowling. However, we managed to get them out for 36, I got 5 wickets. Came back to our pozzy for tea, & I was on piquet. We fell in, Lt. Hall,\n\na sergeant, 2 corporals & 20 men & went down to Querrieu, a long walk of 5 Kilos, but it was along a beautiful road, the best I’ve seen in France, with avenues of tall green trees on the sides. I got a lovely Aussie mail this evening, 5 letters from Elsie, didn’t have time to read them before we fell in, so when we were allowed to break off for an hour in Querrieu, I lay on the grass in the lovely grounds of a big chateau, & read them. No civilians are in the town, & of course the big chateau is occupied by Brigade Headquarters staff, old barns & sheds are good enough for soldiers. We were lucky to get a ride back, hailed a Tommy motor lorry passing & got inside. Raining again tonight, & we are lucky to be out resting instead of in the slippery old muddy trenches, France stands alone for slippery soil. Saw Eldridge this afternoon, he’s O.K. thank goodness; he gave me Boo’s haversack with some things in it. Monday 15 July Taking part in the Battalion & brigade sports is no bon, as it’s rather strenuous, & the chaps not taking part are having the real rest. Five out of our company tramped away up to A Coy. in the morning, & a scratch match was played between two teams after which the selectors picked a team to represent the\n\n13th Bn against the 14th. I was picked, & with the 3 others from D Coy. selected, walked on to Querrieu, & the match was played in the chateau grounds. Our team went under, as after leading by 9 runs on the first innings the","105":" got us out very cheaply, & won by 4 wickets. Fathers bowled well for us, & they had a brother of Hughie Trumble (the old Australian XI man) with them, he is a young chap, the Bn. doctor. We played till 8 p.m., & I got back to D Coy’s pozzy, hot & weary, & disgusted to find that those on parade were taken for a bath & change of clothing today, so I missed it. Playing cricket in military clothes & boots (we have no other) is rather sweaty work. Fritz flew over & burnt a couple more of our balloons today, the anti-aircraft guns poured in their fire, but didn’t get him. It rained heavily, a thunderstorm, before morning, & came into my shelter, & I had to sit up instead of lie down after 6 a.m.","106":"\n\nVery hot & muggy today, the perspiration poured off one. I had the pleasure of a quiet afternoon, had a decent rest for a change, didn’t tramp down to Querrieu with the swimmers for their trial swim. Got parcels from Elsie & Kathleen Tofft today 17 July Played the 16th Bn. cricket\n\n today on their ground. Four of us went from our company, & it was a long way, but there is lots of military traffic on the road, & we got in an Australian waggon, & had a ride down to Querrieu. Coming back I jumped in the back of a Tommy motor lorry, & got a ride nearly back to our \"pozzy\". We finished cricket at 8 p.m., the","107":" won by 16 runs. There was a heavy shower as I was walking on \"home\" from where the lorry stopped. There must have been something doing on the front tonight, as there was a continuous rumbling of the guns.","108":" Had a game of cricket in morning. After dinner the Bn. sports were held, footracing, &c in the chateau grounds at Querrieu.","109":" There was a Battalion parade on this morning, inspection by Lt. Col. Marks, after which we did some movements in Battalion drill. I was acting as platoon commander of 13 platoon, rather comical a corporal being such on a battalion parade, but owing to casualties in the line, that’s how we’re situated at the moment. The long walk down & back to the chateau grounds was very trying, as the heat was terribly muggy, & one perspired a treat. In the afternoon I had the pleasure of a \n\n \n\n \nrest in the shade of the trees, & had a sleep & a read. Saty. 20 July\n\nToday was a great day, the 4th Brigade sports were held in the chateau grounds at Querrieu, when the men who proved best in the different Battalion’s competitions during the week, met in the Brigade Championships, swimming, footracing, & c. We marched down after breakfast, & the field cookers of the battalions went too, & everybody had their meals in the grounds beneath the big trees, real picnic style. The","110":" Bn. band won the band contest, ours being second. A very nice Yankee silver band came along & played, & our chaps gave the Yanks a great reception, we hit it well with them. The day was like a big country show day in Australia, there were sideshows, bookmakers calling the odds on every event, & some bonza fancy costumes. Frank Mattocks who was at Maitland High School with me, & is now a lieutenant in the A.S.C., had a side show (about 10 chaps out of the A.S.C.) & it was screamingly funny, mostly skits on the old life in Cairo. The admission was a silver coin, which was in aid of the Prisoner of War Fund, & I had the best laugh for a long time, at\n\n \n\n a boxing match between Virtuous Violet & Charley Chaplin. The chap done up as Violet had reddish brown hair, & rushed on to the platform clad in a very tight pair of stays, bare arms, a very short underskirt not down to the knees, blue stockings & yellow garters. After a couple of rounds, her chest paddings began to poke out the front of the stays, Lor’ the chaps nearly exploded with laughter. The American Engineers gave a concert at night from the verandah of the chateau & the chaps were in the open, but it began to rain, so I started for home, had the luck to strike a motor lorry, & got a lift most of the way. All the heads were at the sports, General Birdwood among them. Although he has been succeeded by Lt. Gen. Monash in the command of the Australians, & has gone on to a bigger command, \"Birdie\" still wears the Australian felt hat cocked up at the side. To see him standing among the Knuts, you’d never think he was the King bee of the lot, there’s no swank about him. His pants had been stitched in several places, he had an old green coat on, & instead of a red banded cap the old Aussie felt hat. He yarned to the boys, & laid his hands on their\n\nshoulders when he strolled up. He has a soft spot for our chaps alright, & would get a good reception from the people at home if he went out to Australia after the war. I was delighted to get a card from Boo yesterday, saying he had arrived in \"Blighty\", he didn’t say much about his leg.\n","111":" Had a bonza day’s outing today; two motors have been at the disposal of the battalions of the brigade in turn, & today about 50 of the 13th Bn. went to Abbeville. We got up at 6 a.m. had breakfast walked down to Bn. Headqrs at Querrieu, where we got aboard the two motors about 8 a.m. It was raining when we got up, but the sun soon came out & it turned out a glorious day with a nice breeze. The country everywhere looked beautiful, green trees lined the road on both sides all the way, & everywhere the grass & crops & trees are green & luxuriant. We passed through Les Allencons, Amiens (now a deserted city), St Sauveur, Triancourt, Belloy, Flixecourt, Monflis & Ailly, & got to Abbeville about 11 a.m. We got out of the lorries & were given a free leg till 8.30 p.m., when we all had to assemble at the lorries to go home. I spent the day with two other chaps eating, drinking vin blanc & c, & strolling round Abbeville. In parts Fritz’s bombs have played Old Harry\n\n with the buildings. It was nice to be off the chain for the day, & to see a decent town & some women once again. There was a very pretty French girl, dark, 19 she told us, where we had dinner. She had picked up English well, & her quaint way of expressing herself in English language, added to her charm. It was after 9.30 before all the chaps turned up at the motor lorries to go home, & they were all full, & carried sundry bottles of vin blanc, which were emptied on the journey, in between songs. We got home, very tired, at 1 a.m. ","112":" Up at 6 a.m. Races were held today, near Allonville. Our Company were marched there, about 12 kilos, & being a hot, muggy day we were knocked up when we got there. Two chaps & I looked at one race, had a bit of dinner, & then waited on the road for a lift of some sort to come home. I was too weary after yesterday at Abbeville, & the walk, to stop there, & there were no conveniences like a big meeting at Randwick. They were all army horses & army riders; a very sad accident happened in the first race, two horses fell down, & two officers, both captains were killed. We got a lift home in a wagon of the Australian engineers. Got a bonza mail tonight, letters from Mone, Elsie, Will, Boo & Bon Tuesday 23 July Had to go down to Bn. Headqrs. at Querrieu, there was a 4th Brigade canteen meeting, & I was representative for \n\nthe 13th Bn. Heavy rain again today, the weather is very unsettled lately.\n","113":" Had some shooting today, had a devil of a walk as usual to get there, hot & muggy, & mud underfoot. Only fired at small targets at 25 yards; first we had a grouping practice with gas masks on, then rapid fire for a minute with masks on, then for a minute without mask with fixed bayonet, & then a snapshooting practice. In the afternoon, I played cricket with the 13th Bn against the Honorable Artillery Company (Tommies) on their ground. We finished at 8 p.m. then there was the long trip back, so a chap is about knocked up. The Tommies won by 30 runs, they had a good batting team, one chap had played with Somerset, & one with Yorkshire seconds. They gave us tea, the usual army issue plus boiled eggs, very decent of them. I got a ride back to La Houssoye on a motor lorry, & it was raining heavily as I walked on to our dugouts, the ground was very slippery.","114":"\n\nReveille at 6, didn’t I wish I could have slept on. We are supposed to be having an easy time, but with the distance from Querrieu we are always tramping, & cricket till 8, & the trip back to our company afterwards, a man is always tired. Today we had a gas\n\nstunt & had a long walk away through Querrieu, & on the other side of Allonville, about 12 kilos. The gas officer explained the different sorts of gas the Germans send over, now classed as Blue Cross, Green Cross, & Yellow Cross gas. We put on our respirators while gas shells were fired, & then had a smell of the different gases, so that we’ll know the smell the minute Fritz sends it over, & get our respirators on quickly. Then they fired some projectors (empty), which flew through the air like big drums, so that we’ll know them. We came back to Allonville & had lunch, the field cookers made a drink of cocoa there. The","115":" Machine Gun Coy were holding sports at Allonville, & instead of being marched home, we were given leave to go to the sports. They had no attractions for anybody, especially as we were hampered with rifles & equipment, Foster & I waited wearily on the roadside for a lift; after an hour & a half, we got a lift to Querrieu in an Aussie wagon, on which many more stragglers hopped as it went along. Then we sat down for a good while, & finally got on a Tommy wagon which took us nearly to our ‘pozzy’, where we arrived about 6 p.m., very tired & had a hot meal, stew & tea. Had another letter from Bon this evening, he was just going on more leave & \n\nwas going to see Boo in hospital at Richmond. Boo will be delighted to see him.","116":" Three years today since I left Gallipoli (the old Peninsh), & still the war goes on. We had rifle exercises all the morning. marvellous eh, they’d give you the pip. I was on guard in the afternoon, we had to go down to Bn. Headqrs at Querrieu with full gear on, it was a heavy tramp in the mud. Soon after we mounted, the prisoners were taken to the baths, & as I missed our company bath parade on Wednesday through playing cricket, I grabbed a chance of a shower, & got clean clothes, it was tres bon. I posted the reliefs to 10 p.m., then No.1 Sentry woke them up till daylight, & the sergeant & I had a sleep. The prisoners are good blokes & were all snoring, so why worry.","117":" Rained all last night & today. I wrote a letter to Mone in morning. The new guard relieved us at 4 p.m., the band & two buglers were present at changing of guard. We were marched off from the chateau, but on reaching the road, hopped on a motor lorry to go to our pozzy. Everything is slushy & slippery underfoot , & I’m glad we are not in the\n\n in this continual rain. Had a read in my little shelter, & blew the candle out at 11.30 p.m.","118":" Had to go down to Bn. Headqrs. again this morning; Lt Col Marks wanted to see the report I wrote of the canteen committee meeting. Blast their canteen committee, I wish someone else was the representative, these extra jobs are no bon. It is 5 kilos down there, but I got a ride back on a motor lorry. I heard bombs being dropped last night by a Fritz plane, & I saw today where one dropped beside the road where the motor lorries are parked. The drivers sleep in their lorries, but a corporal was in a dugout by the road, & the bomb must have blown him to pieces. I saw his greatcoat, which was riddled with holes & had been blown up into a big tree on the other side of the road. One never knows when his time is coming at this game. After tea I had a look at some tanks which are lying in the wood near us, they are awful weapons to the enemy against them, there’s no doubt.","119":" Had rifle exercises, pile arms & c all the morning. It makes us very wild, this recruits’ drill when out of the line; it will take a good bit of sloping arms by numbers to drive back the Hun anyhow. After tea D Coy played a Tommy Siege Battery cricket, but the ground wicket made cricket not of the best \n","120":" The battalion goes into the line tomorrow. I am one of the nucleus this time (33 1\/3 % stop out each time), & as the company supply duties today, I was on guard again. After being inspected, we had that awful walk in full pack down to Bn. Headq’rs. As we won’t be coming back to this pozzy, we had to carry all our belongings. Lor’ it was a cruel walk, I had full pack, blanket, oilsheet, tin hat & c & c, & it was a very hot day. We got there at 4 p.m., wet with perspiration & very tired, & I was very glad when the \"old guard present arms\" rot, was finished, & we took over from the old guard, & got our heavy packs off. The silly part was that Sgt Alton & 6 men who are to go in the line were sent down on guard, & at 9.30 p.m. others came to relieve them, & they had to go all the way back again. It’s a grandly managed army there’s no doubt. The calamity was that when the new sergeant went to take over the prisoners one was missing. It had to be reported, & Webster the adjutant , came up & went crook & poor old Alton & the two sentries were put under open arrest. As Corporal of the guard. I wasn’t responsible for the prisoners\n\nroom is near a room where a crowd are living, & only has 4 big windows (open too) in it, & the average Australian Sentry doesn’t take guarding his own men seriously. Poor old Alton won’t have much sleep tonight, he set off for D Coy. about 11 p.m.. The case will have to wait till they come out of the line. I had a bit of a sleep at midnight on the hard, \"chatty\" floor.","121":" Reveille went at 4.30, for breakfast we had bully beef, & at 7 a.m. the nucleus, followed by our guard & the prisoners, set off for Hivery, a walk of 10 kilos. On practically no sleep & no breakfast I don’t know how I did the cursed tramp. I was humping (the other chaps also) a load like a pack horse, & motor lorries, empty \ntwo\n too were passing us the whole time. The road was a beauty, though, smooth & straight & ran right on between avenues of big trees which cast their welcome shade over the road. Whenever a spell was called, we wearily dropped on the ground by the wayside. We turned off at the edge of the city of Amiens, & eventually arrived at dugouts where the 49th Bn. were, we sat down & rested till they \n\nleft for the line at 7 p.m. when we got in our burrows, I got a nice little one to myself, it’s more comfortable on your own than with 3 or 4 others. There was no clink for my \"birds\", but they had no wish to clear out, it was a relief to hand them over to another guard in the evening & be free. Our cooker didn’t arrive till night, & we thus had no dinner, but I was so weary I didn’t try to \"hum\" a feed of the 49th Bn., but lay in the grass, & had a sleep. I won’t carry even a handkerchief too much in future- touring France per boot & full pack is no bon. There are some black West Indians camped near us. Old Dad Hart waved to us from a motor lorry as he passed, didn’t he look happy, & no wonder, was going on Blighty leave, the soldier’s joy in France. Dad is a bonza old chap, 58 years old, though he has been giving his military age as 44 for the last 2 or 3 years, is lively & active, & won the military medal for bravery .Thursday","122":" Was orderly corporal today, our bn. supplied guard & piquet to go to Amiens. I was amused today, one of the B.W.I. troops, a black cove from Jamaica whom I\n\n"}}