{"Document Name":{"0":"Diary_0347","1":"Diary_0347","2":"Diary_0347","3":"Diary_0347","4":"Diary_0347","5":"Diary_0347","6":"Diary_0347","7":"Diary_0347","8":"Diary_0347","9":"Diary_0347","10":"Diary_0347","11":"Diary_0347","12":"Diary_0347","13":"Diary_0347","14":"Diary_0347","15":"Diary_0347","16":"Diary_0347","17":"Diary_0347","18":"Diary_0347","19":"Diary_0347","20":"Diary_0347","21":"Diary_0347","22":"Diary_0347","23":"Diary_0347","24":"Diary_0347","25":"Diary_0347","26":"Diary_0347","27":"Diary_0347","28":"Diary_0347","29":"Diary_0347","30":"Diary_0347","31":"Diary_0347","32":"Diary_0347","33":"Diary_0347","34":"Diary_0347","35":"Diary_0347","36":"Diary_0347","37":"Diary_0347","38":"Diary_0347","39":"Diary_0347","40":"Diary_0347","41":"Diary_0347","42":"Diary_0347","43":"Diary_0347","44":"Diary_0347","45":"Diary_0347","46":"Diary_0347","47":"Diary_0347","48":"Diary_0347","49":"Diary_0347","50":"Diary_0347","51":"Diary_0347","52":"Diary_0347","53":"Diary_0347","54":"Diary_0347","55":"Diary_0347","56":"Diary_0347","57":"Diary_0347","58":"Diary_0347","59":"Diary_0347","60":"Diary_0347","61":"Diary_0347","62":"Diary_0347","63":"Diary_0347","64":"Diary_0347","65":"Diary_0347","66":"Diary_0347","67":"Diary_0347","68":"Diary_0347","69":"Diary_0347","70":"Diary_0347","71":"Diary_0347","72":"Diary_0347","73":"Diary_0347","74":"Diary_0347","75":"Diary_0347","76":"Diary_0347","77":"Diary_0347","78":"Diary_0347","79":"Diary_0347","80":"Diary_0347","81":"Diary_0347","82":"Diary_0347","83":"Diary_0347","84":"Diary_0347","85":"Diary_0347","86":"Diary_0347","87":"Diary_0347","88":"Diary_0347","89":"Diary_0347","90":"Diary_0347","91":"Diary_0347","92":"Diary_0347","93":"Diary_0347","94":"Diary_0347","95":"Diary_0347","96":"Diary_0347","97":"Diary_0347","98":"Diary_0347","99":"Diary_0347","100":"Diary_0347","101":"Diary_0347","102":"Diary_0347","103":"Diary_0347","104":"Diary_0347","105":"Diary_0347","106":"Diary_0347","107":"Diary_0347","108":"Diary_0347","109":"Diary_0347","110":"Diary_0347","111":"Diary_0347","112":"Diary_0347","113":"Diary_0347","114":"Diary_0347","115":"Diary_0347","116":"Diary_0347","117":"Diary_0347","118":"Diary_0347","119":"Diary_0347","120":"Diary_0347","121":"Diary_0347","122":"Diary_0347","123":"Diary_0347","124":"Diary_0347","125":"Diary_0347","126":"Diary_0347","127":"Diary_0347","128":"Diary_0347","129":"Diary_0347","130":"Diary_0347","131":"Diary_0347","132":"Diary_0347","133":"Diary_0347","134":"Diary_0347","135":"Diary_0347","136":"Diary_0347","137":"Diary_0347","138":"Diary_0347","139":"Diary_0347","140":"Diary_0347","141":"Diary_0347","142":"Diary_0347","143":"Diary_0347","144":"Diary_0347","145":"Diary_0347","146":"Diary_0347","147":"Diary_0347","148":"Diary_0347","149":"Diary_0347","150":"Diary_0347","151":"Diary_0347","152":"Diary_0347","153":"Diary_0347","154":"Diary_0347","155":"Diary_0347","156":"Diary_0347","157":"Diary_0347","158":"Diary_0347","159":"Diary_0347","160":"Diary_0347","161":"Diary_0347","162":"Diary_0347","163":"Diary_0347","164":"Diary_0347","165":"Diary_0347","166":"Diary_0347","167":"Diary_0347","168":"Diary_0347","169":"Diary_0347","170":"Diary_0347","171":"Diary_0347","172":"Diary_0347","173":"Diary_0347","174":"Diary_0347","175":"Diary_0347","176":"Diary_0347","177":"Diary_0347","178":"Diary_0347","179":"Diary_0347","180":"Diary_0347","181":"Diary_0347","182":"Diary_0347","183":"Diary_0347","184":"Diary_0347","185":"Diary_0347","186":"Diary_0347","187":"Diary_0347","188":"Diary_0347","189":"Diary_0347","190":"Diary_0347","191":"Diary_0347","192":"Diary_0347","193":"Diary_0347","194":"Diary_0347","195":"Diary_0347","196":"Diary_0347","197":"Diary_0347","198":"Diary_0347","199":"Diary_0347","200":"Diary_0347","201":"Diary_0347","202":"Diary_0347","203":"Diary_0347","204":"Diary_0347","205":"Diary_0347","206":"Diary_0347","207":"Diary_0347","208":"Diary_0347","209":"Diary_0347","210":"Diary_0347","211":"Diary_0347","212":"Diary_0347","213":"Diary_0347","214":"Diary_0347","215":"Diary_0347","216":"Diary_0347","217":"Diary_0347","218":"Diary_0347","219":"Diary_0347","220":"Diary_0347","221":"Diary_0347","222":"Diary_0347","223":"Diary_0347","224":"Diary_0347","225":"Diary_0347","226":"Diary_0347","227":"Diary_0347","228":"Diary_0347","229":"Diary_0347","230":"Diary_0347","231":"Diary_0347","232":"Diary_0347","233":"Diary_0347","234":"Diary_0347","235":"Diary_0347","236":"Diary_0347","237":"Diary_0347","238":"Diary_0347","239":"Diary_0347","240":"Diary_0347","241":"Diary_0347","242":"Diary_0347","243":"Diary_0347","244":"Diary_0347","245":"Diary_0347","246":"Diary_0347","247":"Diary_0347","248":"Diary_0347","249":"Diary_0347","250":"Diary_0347","251":"Diary_0347"},"Date":{"0":"unknown","1":1116.0,"2":1117.0,"3":1118.0,"4":1119.0,"5":1120.0,"6":1121.0,"7":1122.0,"8":1125.0,"9":1127.0,"10":1128.0,"11":1130.0,"12":1132.0,"13":1133.0,"14":1135.0,"15":1137.0,"16":1138.0,"17":1141.0,"18":1142.0,"19":1144.0,"20":1146.0,"21":1147.0,"22":1148.0,"23":1149.0,"24":1150.0,"25":1151.0,"26":1152.0,"27":1153.0,"28":1154.0,"29":1155.0,"30":1159.0,"31":1161.0,"32":1166.0,"33":1171.0,"34":1172.0,"35":1175.0,"36":1178.0,"37":1180.0,"38":1181.0,"39":1182.0,"40":1183.0,"41":1184.0,"42":1185.0,"43":1187.0,"44":1194.0,"45":1199.0,"46":1202.0,"47":1205.0,"48":1207.0,"49":1209.0,"50":1210.0,"51":1211.0,"52":1212.0,"53":1213.0,"54":1214.0,"55":1215.0,"56":1216.0,"57":1217.0,"58":1218.0,"59":1219.0,"60":1221.0,"61":1222.0,"62":1223.0,"63":1224.0,"64":1225.0,"65":1228.0,"66":1229.0,"67":1230.0,"68":1231.0,"69":1233.0,"70":1235.0,"71":1236.0,"72":1237.0,"73":1240.0,"74":1241.0,"75":1243.0,"76":1244.0,"77":1245.0,"78":1252.0,"79":1255.0,"80":1256.0,"81":1258.0,"82":1259.0,"83":1260.0,"84":1261.0,"85":1262.0,"86":1266.0,"87":1271.0,"88":1272.0,"89":1273.0,"90":1274.0,"91":1275.0,"92":1279.0,"93":1280.0,"94":1281.0,"95":1282.0,"96":1283.0,"97":1284.0,"98":1285.0,"99":1286.0,"100":1287.0,"101":1288.0,"102":1289.0,"103":1290.0,"104":1291.0,"105":1294.0,"106":1295.0,"107":1296.0,"108":1297.0,"109":1298.0,"110":1300.0,"111":1303.0,"112":1306.0,"113":1307.0,"114":1309.0,"115":1312.0,"116":1313.0,"117":1314.0,"118":1315.0,"119":1316.0,"120":1320.0,"121":1324.0,"122":1325.0,"123":1326.0,"124":1328.0,"125":1330.0,"126":1333.0,"127":1336.0,"128":1337.0,"129":1340.0,"130":1341.0,"131":1342.0,"132":1343.0,"133":1344.0,"134":1345.0,"135":1346.0,"136":1347.0,"137":1348.0,"138":1349.0,"139":1350.0,"140":1351.0,"141":1352.0,"142":1353.0,"143":1354.0,"144":1356.0,"145":1358.0,"146":1359.0,"147":1360.0,"148":1362.0,"149":1364.0,"150":1366.0,"151":1367.0,"152":1368.0,"153":1369.0,"154":1370.0,"155":1371.0,"156":1382.0,"157":1383.0,"158":1384.0,"159":1387.0,"160":1388.0,"161":1389.0,"162":1390.0,"163":1392.0,"164":1393.0,"165":1395.0,"166":1396.0,"167":1397.0,"168":1398.0,"169":1399.0,"170":1400.0,"171":1401.0,"172":1402.0,"173":1403.0,"174":1404.0,"175":1407.0,"176":1408.0,"177":1409.0,"178":1410.0,"179":1412.0,"180":1414.0,"181":1416.0,"182":1419.0,"183":1422.0,"184":1426.0,"185":1428.0,"186":1429.0,"187":1430.0,"188":1431.0,"189":1432.0,"190":1433.0,"191":1434.0,"192":1442.0,"193":1452.0,"194":1455.0,"195":1458.0,"196":1465.0,"197":1468.0,"198":1469.0,"199":1470.0,"200":1471.0,"201":1475.0,"202":1481.0,"203":1487.0,"204":1495.0,"205":1517.0,"206":1518.0,"207":1519.0,"208":1522.0,"209":1524.0,"210":1525.0,"211":1526.0,"212":1533.0,"213":1541.0,"214":1545.0,"215":1552.0,"216":1553.0,"217":1556.0,"218":1560.0,"219":1561.0,"220":1563.0,"221":1565.0,"222":1568.0,"223":1576.0,"224":1577.0,"225":1578.0,"226":1582.0,"227":1589.0,"228":1592.0,"229":1594.0,"230":1595.0,"231":1596.0,"232":1597.0,"233":1598.0,"234":1599.0,"235":1600.0,"236":1602.0,"237":1603.0,"238":1605.0,"239":1606.0,"240":1607.0,"241":1608.0,"242":1610.0,"243":1613.0,"244":1618.0,"245":1622.0,"246":1625.0,"247":1626.0,"248":1631.0,"249":1632.0,"250":1633.0,"251":1634.0},"Entry":{"0":"\n\n \n\n","1":" January.1917.\n\nCame out of the line last night to reserves in \"Gap Trench.\" The shelters here are rough affairs; not rain proof. Some mail was sent up to us. Rested all day except for a few odd carring jobs.\n","2":"\n\nWent to work on the \"Anzac Tunnel\"; which is being constructed in the communication tunnel with the supports of the Geudecourt sector. It is over a mile long and is 30 feet underground. A light railway is being constructed so that the wounded can be brought through it. The","3":" Pioneer Battalion takes the credit of this work. \"Hinie\" has our duckboard track that leads to the line so well marked that he punks holes in it till it looks like a section of a cribbage Board.\n","4":" \n\nThe cold, wet weather continues so work in the tunnel, out of the rain is very acceptable. Fritz is suspicious of our mine shafts and tries to plunk a shell down them occasionally. He put a shell into the back of my little wet home where I sleep with Sheperd, last night. Fortunately it was a \"dud.\"\n","5":"\n\nWas sent to mend the duck board track known as \"Cavalry Track\". The Bosche was in a peevish humour and peppered us with shrapnel. We had just completed repairing it; when he destroyed a chain of it with three well placed shells. He uses the high velocity shrapel shell here we know as \"Yellow Jack!\" or \"Yellow Peril!\" Beastly climate. Paid 20 Franc’s.\n\n \n","6":"\n\nVery cold day. Were releived and went out via Delville Wood and Langueval to \"Brisbane Camp\" near Bazentin; or what is left of it. Will camp here for the night in Bow Huts. The slush was freezing underfoot today.\n","7":"\n\nSaw Roy Lennon today, where he was working on the stone dump I must have been unutterably filthy for even he remarked that I had some mud on myself. Left \"Brisbane Camp\" and got a ride on a train as far as Meaulte; then we marched beside the Ancre as far as Ribemont. Went into good billets. Not a bad village this. Went to the bathhouse, and had a good bath and a change. Wonderfully refreshing makes one feel like a little rainwashed daisy.\n","8":"\n\nIt has been announced that this is our official Christmas, stretching over three days yesterday, today, and tomorrow. Was handed a box of stuff from the Comforts fund; there was no other Christmas cheer. Scott, and I decided to get some. Captured a rooster at the back of a farm house plucked and dressed him; took him round the front of the house and asked Madame to cook it. She did not recognise him with his head off; and she cooked him nicely with trimmings; so we dined well on this auspicious day. Explained the extraordinary circumstances to madame and she produced some good \"Vin Rouge\" which she presented to us as \"Un Souvenir\". A decent old lady, shall pay her for the poultry when I have some money.\n","9":"\n\nHalf day yesterday and the heavy rain again interfered with parade so I wrote \"Beaucoup\" letters. Was paid 20 Francs, for which Allah be praised.\n","10":"\n\nGot our gear ready and marched out of Ribemont after dinner to camp in tents near Bazeiux. There is too much wast ground around here for my liking for everything points to hard drill for a while. This Bayeiux is a dreadful hole but Warloy and Contay are in the valley. Shall tootle down to the sign of the \"Lion d-Or\" in Warloy tonight.\n","11":"\n\nStarted to drill, do five hours a day. Chiefly bayonet fighting. Went for a bath. The new chaplain held a \n\nservice yesterday; complained about the way the troops swore. I don’t know yet whether he was drunk or is just a fool, anyway his remarks were absurd.\n","12":"\n\nA heavy fall of snow last night. It is very warm in these tents at night; but bitterly cold outside. The","13":" Battalion played a game of soccer football with the Northumberland fusiliers. Got licked. A concert in the evening. The snow makes everything look beautiful.\n","14":"\n\nA Brigade field day stunting round Contay. Cinema Operaters in attendance; so that the generals and staff could be featured conducting an assault. Got a new tunic today, the first I’ve had since I left. My old one was torn to ribbons in the barbed wire on the Geudecourt sector.\n\n \n","15":"\n\nDid a route march with packs up. Got letters this afternoon. Wrote some letters for we shall not be long now.\n","16":"\n\nI guessed so. Gave in our blankets and marched from Bazeiux to Becourt Camp; about 12 miles. The coldest day I have ever known. Sent for a dixie of beer tonight, and it froze solid before we could drink it. Made the blokes gnash their teeth a bit. The ground is freezing hard tonight; all the better finish mud!\n","17":"\n\nRolled Blankets and moved up about five miles and went into huts at Bazentim. Covers with moustaches are busy shaving them off now, for they were coated with ice today; as their breath froze in the frosty air. Paid 20 Frs.\n\n \n","18":"\n\nStayed in camp preparing for the line; until this evening when we moved up here to supports and took over from the East Kent Regiment. It was a good quiet releif. Had to wear sand bags on our feet to prevent slipping on the frozen ground. Have a neat little \"possie\" here.\n","19":"\n\nHaving a quiet time here. Absolutely nothing doing this ground is a vast improvement on the mud; it is hard as steel. Stayed under shelter all day for the wind is nippy. Am wearing full winter kit; Woollen Cap and muffler, sheep skin vest; Greatcoat and a blanket wrapped round, my hands in sheepskin mitts. The name of this possie is \"Yarra Trench\". There was a fair fall of snow this evening.\n","20":"\n\nMoved up to the front line at \"Yarra Bank\". Went onto a post in No Mans Land. Have to creep over the snow to it for there are no trenches. A hun post is only 40 yards away on our right front. We are clearly visible to each other. Because of these peculiar circumstances the sector has become neutral. The Germans try to make friendly demonstrations; one played a whistle and the other sang softly last night. No hostile demonstration was made by either side last night his rations approached, searching over the snow and singing vociferously to a point not a hundred yards away. Our carrying parties were similarly exposed I never expected to see this; but everyone is too busy keeping warm to worry about the war in this exposed position. There is no mud the whole country\n\nside is frozen solid. There are blocks of ice in the shell holes six feet thick, and everything is as still as the South Pole.\n","21":"\n\nA quiet day and night but it is frightfully cold. Twenty degrees of frost I am told. Our musical Huns in the post opposite had booze; they were very jovial, one waved a bottle at us inviting us to drink. There is one strand of barbed wire stretched along the middle of No Mans Land to prevent eitherside from getting lost this snow is very confusing. This is a most extraordinary sector, here we stand all night in full view of the Fritz’s, yet we dare not shoot at him or he at us. I hope to hear the Bosches sing the Hymn of Hate, before I go away from here. \n","22":"\n\nClear bright, frosty days, hot meals are sent to us at night but the stuff freezes before we can eat it. I have to massage my feet briskly at times to prevent Jack Frost from nipping them. Got some mail this evening, letters from the Lennon girls. Fritz has a new species of unpleasantness, a large rifle grenade we call a \"pineapple\". They burst beautifully when they strike this hard ground and the bird who is shooting them is most energetic. Will not go to the post tonight, have wangled a job as gas guard on Company Headquarters.\n","23":"\n\nThe Hun artillery sang a hymn of Hate last night. One of his heavy batteries dropped it shells short, right onto the post of my genial Bosche acquaintances. They were badly strafed I am told. A shower\n\nof pink signal lights rose from his lines to give evidence of the confusion that was reigning there. It made me chortle to see Fritz in trouble. This morning all the front of my clothes was covered with hoar frost where my breath had frozen.\n","24":"\n\nWitnessed a wonderful spectacle; from this height we overlook a lot of country and I was able to see the 4th Australian Division attacking at night, the sound of bursting shells; Bombs, rifles and machine guns rose to a roar. While the flashes of our guns made the western sky look like a red dawn. The German position around Bayonet Trench, lit by the light of rockets and flashes from bursting shells, was hidden by a swirlling cloud of smoke. Into this our fellows charged; and it was soon over. Then there was a strange quiet; \n\nexcept for the German shells barraging the our supports. After a little while there came a sharp crackle of rifle fire and as the machine guns added their chatter to the sound; a rocket rose and burst into stars, two red, one green. Then another and another. A similar rocket answered this \"S.O.S\" signal from the heights near Delville Wood; a pause, then as one gun our batteries spoke; their thunder rising to a crescendo of sound, as they hurled a hail of shells onto the Germans advancing in a counter-attack. A star shell burst, and lit up the clouds of black and grey smoke that hid the hillside from view. Though there, men were fighting fiercely; this sector was quiet. All around, the horizon was red with the flickering flashes form the guns. We seemed to be ringed in with fire. We were all \"standing\n\nto\", but Fritz never showed. The day remained quiet. Received some tobacco from Onlo. It was popular for all the chaps were short.\n","25":"\n\nSpent another day in. Was releived in the evening, but had to stay back half the night on fatigue. Some animal pinched my little rifle, my best friend. She was a good little \"hipe\"; her number was 9751 so was an original and had been in Mons; as the inscription on its plate proved. No.196. 2nd Royal Fusiliers. The one I have collected to replace it is only just a rifle; made last year.\n","26":"\n\nCame out this morning to High Wood. Went foraging, had glorious luck! Found a good feed and a bottle of whisky. A bosker new overcoat and other sundries of wearing apparel.\n","27":"\n\nThe rest of the night fatigue had a spell today; but as the 2nd Brigade in the sector we have just left; shot down the Hun’s ration parties; as they approached singing \"Die Wast am Rein\" and generally making the night hideous; Fritz declared war on them, and I had to go and bury six of that brigade this morning. The Brigadier of the","28":" is very zealous and has no time for neutral warfare. The Bosche is every ready to accommodate these violent people. Because of the frozen ground I had to bring these poor fellows out about six miles to a cemetery.\n","29":"\n\nWas advance Guard to the Battalion when we moved to Marmetz Wood Camp yesterday. Got a heap of mail. We still go back to High Wood\n\nto do fatigue pushing truckloads of material to \"Factory Corner\" and other points. At one place on the train line there is a long incline where we ride on the trucks and let them go at a terrific speed. Derailments are common. The weather is bad, damp cold.\n","30":"\n\nThe weather grows warmer and the thaw is commencing. Mud on the train line makes the work harder sometimes we have to go 3 miles with stuff. Hinie has become annoyed at our activity and enfilades the \"Incline\" with \"Wizz-Bangs\". This makes our joyride even more exhilarating; for there is a chance of him blowing up the rails before we get to the bottom of the long slope. Wrote letters to every one today.\n","31":"\n\nHad a bath yesterday. My heels are slightly frostbitten or something. They are sore anyway, and I am doing no duty at present. This is the first indisposition I’ve had since I joined. Our man murdering quack killed young Roberts by his deliberate cruel treatment. He will doubtless get further honours for this.\n","32":"\n\nHaving a decent time on light duty pottering round the camp. The quack has a quaint idea of light labour though. We have (the sick, lame, and lazy mob;) only to carry the Battalions rations from the railway, half a mile away. There is a competition running in the camp for the best kept hut of the day. The prize is a pudding; and because of the extra rations the boys compte with zest. My hut won it the\n\nlast two days. We will not win it again.\n\n223\/2\/17.\n\nAn extra prize of 40 Francs worth of canteen dry goods was added to the Hut Prize today. Our hut pulled it off again. So I was set up for an enormous spread. My feet are quite alright again. Have returned to duty.\n","33":"\n\nThe alarm sounded this morning at 2 A.M. Turned out \"toute suite\". A big disturbance in the line. Our fellows attacking, found many of Fritzs positions unoccupied. Thought he had gone home, hence the excitement. A squadron of cavalry went by at a gallop while we stood by our arms; waiting till they had located Fritz. They found him, he was not far away. Then we went back to bed. Stood by all day. Was Paid 20 Francs.\n\n ","34":"\n\nNo alarm last night. Things are normal. Foggy weather, which is very favourable for Fritz he has retired some distance, and is still falling back. We will catch him soon enough I’m thinking.\n","35":"\n\nWas issued with extras, sandbags Bombs, ammunition etc. and went to the trenches, in battle order, no blankets. Were loaded like mules with all kinds of gear. Occupied the old German line in front of our Yarra Bank position. The industrious Hun had constructed deep dugouts here, which we are in and feel grateful for. Our chaps are still advancing slowly, have seized all this strong point we know as the \"Maze\" and have pushed him beyond the village of Thilloy a thousand yards in front.\n","36":"\n\nThe snow is all gone from the ground and has uncovered the bodies of hundreds of the brave fellows of our Second Division who fought over this\n\nGround in November last year. The bodies of, New Zealanders, Scots, and Tommies also lie around to show where the waves of previous attacks had hurled themselves at this position in vain. A glance at this position tells a tale of bravery, more glowing than any words. It shows how the Prussian Guard leapt out of their trenches, to where our fellows stood unable to advance and fought there with the bayonet; breast to breast; for I saw the body of a Victorian who held the throat of a German in such a grip that even how he could not be separated from his victim. We are burying them now just where they fell. The more I see of our fellows\n\nthe more my admiration for them grows. they are splendid in victory and even more splendid in defeat. It seems to me, that they say as they lie here in rows; \"We could do no more\"!\n","37":"\n\nMoved closer to the line last night. The Hun has destroyed most of his dug outs here so we sleep in the open. It is not the rule to occupy newly taken trenches, it pays to dig fresh ones. But a little before dawn, a very lively barrage came down on us, and a strong force of German Raiders attacked our sector. The barrage fell too short else we would have been wiped out, as it was the ground rocked with the shock and the trench collapsed in places. Our Battalion surrounded the raiding party, about 200 of the","38":" Potsdam Guards, the Keisers Own; When they found they were trapped, the stood\n\nand fought till every man was down. No snivelling, baby-killers these, but big men, all very tall. One fellow was 7 feet high. The day was fairly quiet.\n","39":"\n\nThere was no incident yesterday, a couple of unlucky shells caused casualties in the company. We moved up further, for the advance continues slowly. There was no incident last night except dug a new trench in a field that was fairly free from shell holes. This is curious remembering the bogs we have been living in for the past months. Have a cold time of it, the weather is bitter and we have no shelter, and no blankets. Am in a post in the front line. Hinie is not far away, one of his snipers nearby bagged this little one today. Have his \"possie\" marked and will have something to say to him presently. \n","40":"\n\nSpent a very miserable night there was a heavy fall of snow and there was no shelter from it in this open trench. One of our airmen was forced to do a deed of great daring today. He was flying home crippled and hardly able to make his machine go, when he was attacked by a big black Hun machine. When our machine was barely 200 feet up and right over No Mans Land, the Hun fired, then our chap unable to defend himself put his machine into a spinning nose dive, fell to within 30 feet of the ground where he regained control and flew off leaving the Huns discomforted and followed by our cheers.\n","41":"\n\nAnother night spent in consolidating our position. My post is near the great national French road that leads to the Frontier via Bapaume. We get no sleep in \n\nthis bitter weather, and the rations are very scanty. The enemy shelling was heavy today. Shall be relieved this evening.\n","42":"\n\nCame right out to Bazentin last night. It was a very long drag and the mud is as bad as ever. After that 6 mile stunt we had a couple of hours rest and marched on to Mametz a few miles away.\n","43":"\n\nThe last few days spent in business as usual. Arch Mclveen dropped in to see me. The sluices of Heaven have been opened again, and rain falls most of the time.\n","44":"\n\nMarched 7 miles to this village Dermancourt yesterday. Billeted here while we get some polish put on our movements. Went for a bath at Vivier Mill, the best I’ve had since Sailly. Went to Bacourt and had a yarn with Arch McIlveen.\n","45":"\n\nAfter some days of solid drill we moved on to Ribemont this afternoon. Saw Roy Lennon today on the road with his Battalion. Will do duty tonight as \"billet guard\".\n","46":"\n\nA Brigade church parade. We will continue the training here. Wrote some letters. Noticed the inhabitants of this village carrying green boughs to church with them this morning. Have discovered a pleasant possie in Mericourt. Will go there this evening.\n","47":"\n\nWent to the Corps baths at Heilly. Our ammunition was taken from us today. Had some rifle practice yesterday, my rifle is a dud will have to pinch another. We do some pretty severe marches here.\n","48":"\n\nRain stopped Parade this evening. Two deserters from this Battalion who were sentenced to be shot were liberated today. Was offered a \"bar\" as a tempory Acting Unpaid, wouldn’t take it for various reasons. It is bad enough to be a senior Private and have to do their work, without being entitled to the abuse.\n","49":"\n\nA Brigade march past this morning yesterday at Churchparade a courtmartial was read on one of the","50":" who got 10 years. A good concert in Mericourt tonight.\n","51":"\n\nMarched out of Ribemont, 12 miles or so to Montanban Camp. Road very slushy, cold and wet. The signs show that our guns are hard on the heels of the Germans, who are retiring beyond Bapaume.\n","52":"\n\nMoved on again today across the old front line; at a point known as \"Millers Son\" on the right of Guedecourt. This ground that was once so active is now a lifeless waste strewn with all manner of the wreckage of war. The mud was very bad and there was snow and sleet all the way. Covered about 10 miles and camped in the ruins of a place that a shattered signboard tells me is called Fremicourt. A good deal of Hun \"frightfulness\" is noticeable here. poisoned wells, orchards cut down churches blown up, etc.\n","53":"\n\nMoved on this evening and camped for the night in a certain village. The whole countryside is a ruin, trees, shrubs. Villages have been ruthlessly destroyed, our gentle Hun is nothing if not thorough. He made great belts of barbed wire entanglements to stop our cavalry. He is still retiring slowly.\n","54":"\n\nWent to the line last night with ammunition for Machine guns. It was strange to be walking about over stubble feilds ducking bullets. There is not a bit of cover. We were moved to a bivouac in Velu Wood. Have made a shelter of the boughs of a Yew Tree. It is an evergreen. Generally from the pastoral aspect of everything it is hard to believe there is a war on.\n\n","55":"\n\nIt was a wild wet night. We take the rations from here to the firing line. This is part of the grounds of what was once a fine old Chateau. It is a shapeless heap of rubble now. We do not loiter round those places for the Hun sets mines and other traps with diabolical cunning. \n","56":"\n\nA fine Day. Did the ordinary work last night. Received some mail. We have drawn bombs, extra ammunition, shovels etc. for we attack in the morning. By our orders we are supposed to clear p a large tract of Hun infested territory between now and tomorrow morning. Won’t be surprised if we get it in the neck, these heads are too confidant. A chap on the baggage guard will keep this book for me until tomorrow.\n","57":"\n\n‘D’ & ‘C’ Company attacked this morning at dawn. Advanced 2000 yards.\n\nTook over 100 prisoners and 22 machine guns. The other Battalion on the left took 100 prisoners and 8 machine guns. The Germans were ready for us and opened fire immediately we left our lines. Had to walk 600 yards up a hill crowned by the Germans position in the Village of Hermico. We got it dealt out to us hot and strong, all the way and, 16 Platoon was held up in front of a strong post when 80 yards from it. The Platoon on the left had withered away under the fire, communications with the right had been stopped; lay on the ground under cruel fire for about ten minutes. Got full of it. Rose up with a whoop and charged straight at them. Hunted them away with Easter Eggs. There was \n\nfive machine guns in this post, ten of us took it, for the rest of our half platoon had been shot down. Nine were killed. Advanced through wire to the right of the village; was caught in an open field by heavy rifle fire. Had a most exciting race for cover. Two were wounded in our party. Continued to wander about in Hunland until we located the Company, a very exhilarating game. Seized the Germans stores and rations including all their mail, and gained much plunder thereby. Nearly got fixed this morning, three machine gun bullets passed through my tunic in different places, and two through the haversack on my back. My good comrade Palmer was killed this morning, and many other splendid chaps. We are holding a chalk pit here on the right front of Hermico which village we hold\n","58":"\n\nSince the grand win yesterday, open fighting continues, in rain and snow. There is no shelter here, I have found a large wooden tub and am living in it like Diogenes the Philosopher; if his cramped quarters were anything like mine I don’t wonder that he was a crabbed old gezer.\n","59":"\n\nAnother very bitter day, a great deal of snow and rain. Advanced to the cemetery and dug a funk hole in the side of a sunken road. There is no shell fire here to speak of by either side.\n","60":"\n\nCame back to the chalk pit yesterday do duty as rations fatigue, was able to get a sleep in a cellar here. We carry hot rations twice a night. We get very little rum here it leaks out at Company Headquarters. The chap who drank it all\n\nlast year is with us again but he is teetotal and distinguished himself this last stunt.\n","61":"\n\nWe advanced our line another 1000 yards last night. Happily we met no opposition. Worked furiously digging a new trench. There were a strong party of Huns about 40 yards away why they did not fire on us is a mystery. They were in a small copse and we hunted them out of it at dawn. A sunny day. Had a snooze in this copse it is a little place abut 40 yards square.\n","62":"\n\nThe enemy launched a strong attack against ‘B’ Company, was called on to support; but ‘B’ Coy towelled them up in fine style, simply mowing them down. Dick Roberts and were killed this morning, and now I’m the last of 9 good mates. We are in the elbow of \n\nthe Canal du Nord here and we caught some Germans massing in the bottom of it. Opened fire and dispersed them. Hot shell fire was poured into our little copse as a reward. He nearly blew it away altogether. Had some trouble getting out of it, because of his machine gun fire from Havrincourt in front and Havrincourt Wood on the right. Got slightly wounded in the heel and hand. There were some killed.\n","63":"\n\nSpent the night in No. 5 post. A fine day but rained again this evening Hope to be releived tonight.\n","64":"\n\nWas releived last night in howling darkness and rain. Came back about 5 miles to reserve on another sector. Fritz blew up a powerful mine in Hermico yesterday eveing. Got\n\na dinkum issue of rum when we arrived. In our weak state it made us all so sleepy that most of us lay down in the mud and were able to get some sleep there were no shelters of any kind. Have made myself a little home this evening. Rain and snow continues. Mail! Ever welcome Mail was issued.\n","65":"\n\nHave had three days splendid rest here. Everything has been quiet and lovely except for a bit of a disturbance near Lagnicourt.\n","66":"\n\nGave our blanket in and moved into the line again on the Doignes sector. I don’t like the look of this \"possie\" but I expect it is no worse than some I’ve been in. Saw the German dead lying in heaps where \"B\" Coy and the","67":" Battalion passed them a week ago. \n","68":"\n\nStayed in the outposts all day after two nights here. Came back to close support this evening. Very quiet here except for a few odd shells. But he has the range of this place too well and makes me feel nervous Received some parcels of eats.\n\n24\/4\/17\/\n\nA fter a fine warm day, was relieved by th York and Lancaster Regiment. Came right out to Velu Wood. Bivouacked among the trees.\n","69":"\n\nThe mob came back to a camp near Beaulincourt on the Peronne Road. They say the Gordon Bennet Motor Race used to be run over this road.\n","70":"\n\nYesterday we moved over to the left to support the","71":" Division in \n\nsome stunt. Marched about all night returned today. Arch Mc was here to see me. Hope to move back out of this. My heel is not improved any by that shrapnel splinter seems to be getting worse.\n","72":"\n\nWe moved over to the left again this morning near the Village of Vanx. Strikes me by the amount of guns that we will strike trouble if we stay about here.\n","73":"\n\nYesterday we moved towards the in line open order and got into positions to the left of Bullecourt. The","74":" Division has been heavily engaged here. Am confused with the procedure of this stunt. The huns seem to be all round us, and fighting is proceeding on all sides. The trench I occupy is a part of the Hindenburg Line. It is very deep and wide.\n\nThe enemy appears determined to regain these positions, he has already sent over several attacks; using bombs lavishly. Had some dinkum stoush with a party this morning showers of egg bombs fell around, but our good old Mills Bomb was too much for him. Reincourt is in front and Bullecourt is being pounded into dust. The enemy shells us furiously and use many \"minenwerfers\". We are holding a desperate salient here.\n","75":"\n\nThe Boches here are giving us one hell of a fight for it. Fighting backwards and forwards with bombs. We use thousands of them. Have been carrying supplies of them today through a heavy barrage. Don’t know where I am now; cannot go observing the scenery these stirring times there\n\nis a railway embankment not far away. Our boys have not gone back a yard here yet.\n","76":"\n\nYesterday evening the enemy came over again and it was flaming hell for a while. I don’t think he gained ground anywhere our machine guns cut him to pieces. The slaughter on both sides is sickening surely we will not be asked to hold this death trap much longer, the mob has lost heavily and the enemy is trying to cut us off; there are thousands of him but we have him well in hand as yet. The wound in my heel has been giving me fits, it has turned septic and is very sore.\n","77":" Came out a couple of miles last night with the remnant of \"D\" Company 20 officers and men. Went in about 200 odd strong. Reported my septic \n\nheel and was sent in a motor ambulance to a rest hospital near Avalluy. Had the wound cleaned up; half the heel is eaten away. Was injected with anti tetanus serum went to bed, ordered to stop here. Can I? I should worry.\n","78":"\n\nHave been asleep on and off for a week. The foot is doing nicely. Lots of good food here, and I am enjoying this rest; the doctors \"insist\" that I stay in bed they will get tired of it before I will. This hospital is known as No.9 C.C.S., I am still on the strength of the unit till I leave here.\n","79":"\n\nHave had a rotten fever the last couple of days. The reaction after that hell at Bullecourt. A very painful complaint, is called French\n","80":" I think, it has left me pretty weak but I would sooner suffer it here than be pushing up the diasies at Bullecourt. The Battalion has come back, by easy stages to a camp not far from here.\n","81":"\n\nThe bandages were taken from my foot yesterday. Was issued with boots and went exercising about the place. Bombed some fine trout in the River Ancre that runs past here. Mill’s bombs are exellent things to fish with. A party of us borrowed some beer from the back of the canteen in Avulley; had a party on the river bank.\n","82":"\n\nWas marked for duty today have drawn all my gear from the stores; and once again I’m a soldier; fit for war. Some of those incorrigable theives the Australians stole some beer last night. They searched this hospital for the culprits.\n\nI have not been detected so far. They have no case anyway, the evidence is all drunk.\n","83":"\n\nLeft No9.C.C.S. and marched via Albert, to Buire, where I rejoined 16 Platoon. There are only 3 of the fellows left who marched through this town with me 6 weeks ago. We lost about 40 men out of the Platoon. All the rest of the fellows here are Reinforcements I do not know any of them. A military rule says that, a unit is disorganised when it has lost 60 per cent of its effectives but the 3rd Battalion was still a force to be reckoned with when it had lost nearly 90 per cent. One British division was smashed in 12 hours of that fight. two others were used up in holding the flank so that the Australian divisions would not be cut off. There are no flies on the Incomparable, Fighting,","84":"\n","85":"\n\nWe drill about the place; it is dead here with none of the old boys left. Have been having a couple of days off. The fever has not quite left me yet.\n","86":"\n\nA brigade church parade. a new Padre. Our Brigadier, General Leslie lost his head in addressing us this morning. He had to say that he had received the personal compliment of Field Marshal, Sir.Douglas Haig, and was instructed by him to convey his congratulations to the first brigade for their conduct in the Bullecourt Battle. He was very proud off us, the old boy and said, because it was the first time it had ever happened that Haig had ever singled out any unit for his personal praise. There were tears in the old bloke’s eyes when\n\nhe told us that we are the best infantry brigade in France. He is rather a decent old bird this Leslie; even if he is a Canadian.\n","87":"\n\nThere is a divisional competition pending, and a contest was held in the Battalion this week to decide which Company would represent the","88":" Battalion; in the competition between the crack \"coys\" of the other battalions of the Brigade. The winner of which, will represent the first brigade in the divisional Competition. The scheme is to decide which is the crack infantry company in the 1st Division. My Company will represent the","89":" Battalion in the Brigade Contest next week. It will mean hard work, but we will pull it off for the glory of the good old 3rd. Was paid 40Francs.\n","90":"\n\nThe Brigade competition started. Met the other 3 opposing companies in a 3 mile cross country run. My Company won it easily. Tomorrow we will carry out rifle shooting and route marching, and field work. Having for judges officers of other battalions\n\n7\/6\/17.\n\n\"D\" Company has won the Brigade Contest, a company of the 1st Bat were \"runners up\". We will go to meet the crack Companies of the 2nd and","91":" Brigades next week. Had leave for the day in Amiens. A fine city, it is splendid to get back into civilisation again. It was a \"day of days\". A special leave train conveyed us from Ribemont station. Amiens has been out of bonds till now. They say this consideration has been granted us because of our good work in\n\nthe Hindenburg Line. It is high time we got some recognition. There is a beautiful old cathedral in Amiens, that is well worth seeing.\n","92":"\n\nWent to Amiens again yesterday. Had a good time, missed the train smuggled myself on a motor-lorry came home via the Albert Road. We are training briskly preparing for the Contest. Went out today and did a stunt, practicing with \"Contact\" aeroplanes. Who kept in touch with us during the operation. We attacked in mimic battle over the hills around Dermacourt and burnt flares and made fireworks generally. The country is very pretty now that spring has come again. Am feeling quite fit again.\n","93":"\n\nWrote some letters. Were practicing with hand grenades, throwing etc. One exploded accidently. 11 wounded. I am becoming a fair shot with a bomb.\n","94":"\n\n1st Divisional sports at Henencourt today. All the mob but \"D\" Company went over. My Company stayed behind polishing up and cleaning ourselves up for the Competition.\n","95":"\n\nMarched in light marching order to Henencourt. Were we will stay during the competition week. A small place; chiefly composed of a magnificent Old Chateau, in splendid grounds. The cast iron gates on the Chateau’s entrance are cast in replica of the crest and arms of its owner. The Duc de Henencourt I suppose. For some\n\nreason this chateau has not been handed over to the tender mercies of the Military, and there is an air of mystery about it. Have a comfy billet here and the \"Estaminet de Petit Corporal\" is just over the way so everything is lovely.\n\n14\/6\/17.\n\nCommenced the Divisional Compention today against a company of the 8th Battalion and one of the 10th Battalion. Business of field exercises. Bayonet Fighting, Rifle grenade shooting, Bombing. Did good practice. An accident in the bomb throwing, 3 of the","96":" were wounded.\n","97":"\n\nRifle practice today. This is where I shine. Scored a possible maximum of points. They ought to help our average along. Not so well today; trench fever is on me again. The other company’s are giving us a go for it.\n","98":"\n\nFelt a bit bucked today. Went out and finished the Rifle Grenade shoot. This afternoon we ran a 3¼ mile, cross country race. I got in about 16th in 23 minutes. An easy win for \"D\" Company securing 1. 2nd and","99":" places. During a stunt by the trench mortar batteries there were four more casualties.\n","100":"\n\nShould have had a day off, but we paraded, and did some exercises just to keep our eye in. We were paid yesterday. Went over to Senlis and found \n\nJ. B. F. McKenzie. Saw Dick Chisholm.\n","101":"\n\nDid the field day today. Route marched 7 miles a severe test; then carried out an attack in open formation using ball ammunition. Unusually hot today. Got some mail letters from everybody.\n\n20\/6\/17.\n\nThere was rain yesterday and the final course of the Competition was postponed till today. Finished it off this morning. The verdict was issued this evening. My company won. We are \"D\" Company 3rd Battalion, the crack infantry company in the crack Division of the finest Corps of troops in France. Some boys us! Returned to Buire this evening. The 1st Brigade turned out and cheered us as we passed through the town. By bringing back the honours to the","102":" Brigade we covered ourselves with glory.\n","103":"\n\nA holiday today resting after our labour. I managed to get into Amiens again. We of the Anzac Corps are supposed to be in reserve to the","104":" Army. It will always do me, but I guess as soon as we are fit again – Hush! Don’t wake it up!\n","105":"\n\nHave carried on with the Battalion. A Brigade church parade this morning. Birdwood was present and handed out a large number of medals and decorations. Said the usual sweet nothing about our gallantry. Received a parcel of tobacco. Tootled over to Senlis again met Norman McClymont and Sandy Mitchell.\n","106":"\n\nWent to the Cinema hall in Brasle to hear a lecture by Arch Deakin Ward and other people instructing on a subject they don’t seem to know much about. \n","107":"\n\nThe 3rd Battalion was ordered to provide a guard of Honour on the person of His Highness Field Marshal; the Duke of Connaught. The guard will be composed of about 50 picked men. I am selected. Spent the evening sprucing up, went and had tea with J.BF at Senlis.\n","108":"\n\nSpent the day getting ready and getting snap into a few points of our ceremonial drill. Our boys can drill too when they like. This bunch is as smart a lot as I have ever seen, and any Duke ought to feel honoured when he sees them.\n","109":"\n\nThe Battalion moved today. The Guard marched in drill order to Albert, and drew up in front of Headquarters. Having in our rear a glass greenhouse within four inches of our bayonet points when at the slope. The Duke of Connaught arrived we gave him the salute; and as we returned to the slope; as one man; we crashed our bayonet points through the glass in our rear. Saluting him with a glorious crash. We stood steady; but the old boy laughed, he\n\nsaw that we did it purposely. He inspected us and spoke to some of the chaps. The whole thing was done splendidly, the best of its kind I have ever seen. Our fellows can drill better than the \"Guards\" when they like. Left Albert in motor lorries and joined the Battalion in camp at Englebelmer. Had to make a bivouac.\n","110":"\n\nOpen country round here, take advantage of it by do in field manouvers. Went to a Brigade parade, where Billy Holman the Politition came to inspect us. Birdwood was there also. I wish these damned political jonnies would keep away, they are not satisfied with \"Joy Riding\" round at their country’s expense, but must have the troops marching and counter marching for their edification.\n\nHolman reckoned Australia would have conscription inside 6 weeks But he is such a liar, no one takes any notice of him.\n","111":"\n\nDid a bit of a stunt this morning; over the old \"Somme\" positions Red poppies bloom in the vallys looking like pools of blood; and fields of daisys and yellow mustard make the country round here beautiful. This evening we moved over beyond the town of Mailly Went foraging, found some cherry trees in a deserted garden. We are ordered to prepare for a big field day tomorrow, over the ground where there was such fierce fighting this time last year when the \"Somme\" offensive opened.\n","112":"\n\nWas out all last night doing a night attack practice against the Beaumont Harnel positions, that foiled our assaults, so long last year. There are few land marks left on this landscape now. The ground is still littered with barbed wire and other material, a few skeletons lie amongst the grass and flowers, it is almost unbelievable that this bare country, called for almost superhuman effort to capture it. Returned to camp a 7.A.M. Wrote some letters home.\n","113":"\n\nPut the blankets in and marched from Mailly to Buire, about 9 miles. A good march, for the fellows are in much better nick now. The Battalion is growing up to strength again too many of the old hands are back again. Am in the same billet at Buire.\n","114":"\n\nWent to see the unvieling of the Pozieres Memorial. There was a good deal of rain all day. The memorial is a simple affair; a small granite column with an inscription plate, erected not far from where the village once stood. It is hard to recognise the position again, for grass has overgrown everything where I thought grass could never grow again.\n","115":"\n\nThere was some ceremonial drill today, they must be expecting some Head along. Yesterday, there was a demonstration with a German \"Flammenwerper\", (\"Flame Throwers\") As I have already seen these engines in actual battle it was no novelty. This dreadful weapon throws a \"jet\" of withering flame about 90 feet; but it is easily dealt with.\n","116":"\n\nWent up to the Amiens-Albert Road full marching order. The whole of the Anzac Corps was lining both sides of this road, waiting for the King to pass. We stood up once when loud cheering came rolling down the lines of troops thinking it was His Majesty. But it was only a squad of \"Mounted Military Police\" at the fighting men were cheering these \"too shrewed to fight\"; gentlemen.to the Echo. After a wait of some hours the King drove past in a motor car accompanied by various Generals, and staff in other automobiles. There was no such vociferous demonstration for him. Most of the fellows thought the same as I did, that it is ridiculous for grown men to howl like a lot of idiots, because a King is passing. He saw in us I hope, fighting men,\n\nstanding to attention, to do him honour. Sufficient for anyone, man or King. He seems to be a decent little man; this George.V. Returned to Buire. Pitched for the Main Guard.\n","117":"\n\nThe mob moved away today. I remain here, acting Corporal of the Guard with a prisoner. Turned out the Guard to the","118":" Brigade as they passed. This is my reward for being a \"Senior Private\" by the Grace of God; doing some corporal’s work for him. They will say of me perhaps when I am pushing up the daisies; \"He was a good poor beggar!\"\n","119":"\n\nLeft Buire with the prisoner. Marched 12 miles via Bray-sur-Somme, to Maricourt; where we rejoined the Battalion in a camp. Will have the same procedure here\n\nas at Mailly. Drill furiously for 6 hours a day. Was paid 20 Franc’s.\n","120":"\n\nWe route march a good deal always with full gear up. To ensure that everything is carried and no straw is used to fill the packs; Police search the huts and confisticate all stray gear. There are some quaint subjects of the King on this front, Chinamen, Kaffirs, Negros, etc; but some natives of Kasmir, India, that I saw today take the biscuit. They look as if they had been cannibals in civil life, and stretch the lobes of their areas by boring them and wearing brass ornaments in the holes. One fellow I saw was wearing a large brass door knocker in his left ear and about 16 brass hooks in the other. He was a big \n\nchief I suppose. Last night, with some of the chaps, went to a village some distance away across the Somme River. Saw some American regular troops there, rough chaps whose blustering manner annoyed us. They \"guessed\" this was their town and they didn’t want any Australians in it. There were about 8 of them in a Café where I was all wearing heavy automatic pistols. In the physical argument that followed I was flung outside but returning to the attack, we succeeded in driving whole lot of them out of the town. If these fellows fight anything like the way they \"RoughHouse\" they will do. They will be decent chaps too when they learn that their name is \"Mud\" here. Managed to get back to camp in the \"wee small hours.\" A grand day.\n","121":"\n\nStill exercising vigourously. Route marching mostly. Everybody is in the pink judging by the distance some go in search of diversion. Killed a snake today the first I’ve seen in France.\n","122":"\n\nMoved from Maricourt back to Buire. A fair march. Am in the same old billet. Spent the evening in Ville-sur-Avere.\n","123":"\n\nAn inspection today and a march past, full marching order. I suppose we are pronounced fit for war, and this gay life is finished. Our probable movements are shrouded in mystery; one rumour says \"Italy!\" another \"Flanders,\"\n","124":"\n\nEntrained at Guire this morning at 3. A.M. Travelled to the north, and\n\ndetrained at Cassels at 2 P.M. Marched about 7 kilos along that curse of Flanders; a cobbled road, to billets near Ebblingham. Very stiff from being cramped in the trucks. A comfortable, fat land this, where I have been before. \n","125":"\n\nHeavy storm this morning no Church Parade. Wrote letters. Billeted in a brick barn, a thing a man never sees in the Somme region where even the dwelling places are built of mud and straw plastered on sticks. Rare enough here too, so we appreciate it. Was paid yesterday.\n","126":"\n\nHas rained for several days. Stayed in billets and wrote letters. Beer and eats are obtainable at this form so every thing is right.\n","127":"\n\nThe sluices of Heaven have been open for a week, but they closed yesterday and we went for a route march this morning. This country is typical of the Flanders area. Rich flat field, and roads planted with tall poplars. The farmers do not cluster in villages, as they do in the south but in scattered farm houses. Hedges enclose the fields.\n","128":"\n\nNorman McClymont came over to see me. We went down into Ebblingham and had some diversion. A nice little town. We do the usual parades here when the weather permits, 6 hours a day.\n","129":"\n\nTook our packs on a route march today. Was out until two oclock. Had the afternoon off.\n","130":"\n\nMoved by route march. Via Hazebrouck, to Sec-Bois about 10 miles. The Hun was shelling Hazebrouck with a long range 13 inch gun. As we approached the town the roads were thronged with French civilians flying for their lives. Several German aeroplanes were flying high over the town spotting for the gun and dropping bombs. The Hun is becoming most unreasonable; I guess we are on our way to remonstrate with him; for we passed Birdwood on the road today. This German gun is firing from a place about 22 miles away. He will be destroying a few pubs, and that will tear it. He planted one in the New Zealand Hospital, I guess all the Hospitals will have to be removed from the town.\n","131":"\n\nSec-Bois is a nice area. Have a comfortable billet and a very confined space to drill in, hence we occupy most of the time marching. Was paid today. The old soldiers do well here; by some mysterious means our ration of vegetables has been strongly reinforced, with, potatoes onions, carrots, cabbages, eschalots and other stuff such as is never issued by a fatherly government. I was presented with a young pig by a farmer in the","132":" Battalions area; or strictly speaking I presented myself with it in his name which is much the same thing. He didn’t see things in that light but raised Cain throughout the brigade. The porker was found done to a turn in our cookhouse. We had to pay for him, cost 5 Franc’s apiece. It is sad, the way I fall into temptation by the sight of anything edible. It is the same with all the rest of the boys\n\nyou could strew sovereigns in their path and the would not touch them. But leave a tin of Bully Beef lying about; and it is spirited away in a moment.\n","133":"\n\nWent for a","134":" miles. Passed Borre and other towns. Was over in Borre last night. A rifle regiment is camped there.\n","135":"\n\nThis afternoon Captain Hewish handed me my furlough pass for England! 10 days of the best and brightest from tomorrow! Went and saw the Medical officer and was pronounced free of vermin, scabies, and other contagious diseases. Received a certificate to this effect. Went to Div.H.Q. and got some clean clothes. Will start tomorrow. Tonight we will celebrate. A Glorious Day!\n","136":"\n\nSet out from Sec-Bois in a Motor Bus at 10.30 A.M. Went to Hazebrouck; the Leave train left at 12.30 P.M. Arrived at Bolougne at 7 P.M. Marched to St Martins Camp on the top of a high hill. No crossing tonight; our passes will be redated to commence on the","137":" No leave from this camp except for Warrant Officers. Put my \"crown\" up, and bluffed my way out the gate; for not one moment of this liberty shall be lost. A splendid city this, clean and well ordered.\n","138":"\n\nGot away from St Martin’s early this morning. Embarked at 7.30 AM on the Leave Ship, \"St Andrew\". Sailed from Bolougne at 8.30.A.M. A rough crossing got to London at 3.30 P.M. Went to Australian Headquarters, Horseferry Road Drew money got fixed up. Went for a walk round the town. I feel like a wild man come to town.\n","139":"\n\nWent to the Bank and drew some money this morning – Was fooled around for an hour. Fitted myself out in wonderful holiday attire. Went for a tour of the sights Westminister Abbey is the most wonderful piece of work. Then I presented myself at Manchester Street. Spent the night in town. Oh! This is a lovely city.\n","140":"\n\nYesterday I went to Kensington in the morning, to see Holman Hunts collection of pictures. I catch on fine with these people even if I never heard of them before. They seem to like to have a tame Australian; and so intelligent too! It appears to me that this comfortable class of English people; thought the Australians were a savage tribe; were very fierce amd cantankerous; and wore bones in their noses. There is no need to tell them yarns drawn from my imagination. \n\nThe truth seems to entertain them sufficiently. Formed a party and drove around then went to the Theatre, \"Airs & Graces\". Today, went to Manchester Street and took one of the girls to church. A Service conducted in St Pauls Cathedral by the Bishop of London. The singing of the choir was anglic. Saw numerous Lords, etc; in their pews. The church itself is a very grand piece of work. Inspected Holman Hunts picture. \"The Light of the World\". Shifted my diggings to Manchester Square near Baker Street. Haven’t stopped at the same place twice so far. I can get about in this city good oh now, but I would have to be here a couple of years before I could see half of it.\n","141":" \n\nWent to Hampton Court with a girl friend from Manchester Street. A charming place. \n\nReturned by way of a boat on the River Thames. The most beautiful trip \n\nI have ever seen. At this time of the year the flower gardens that sweep down to the river a ablaze with colour and the clipped trees and neat lawns make a charming scene. I had not dreamed that the work of man could be so beautiful. Had dinner at \"Les Goblins\" Regent St. and went to see \"Theodore & Co\" London is very quiet of a night, now that the lighting restrictions are in.\n","142":"\n\nAn odd morning, so went to the Tower of London, and half a score of other places, including the Royal Stables where I inspected the Kings Horses. Splendid beasts they are too. Saw much cunning craftsmanship in steel and gold at the Tower. I wonder how those ancient workmen did it. Saw the Crown Jewels; £4.000.000 worth, all in a heap. A dazzling sight. They are quarded by \"Beefeaters\", husky chaps too.\n\nThat tower is crammed with places of historical interest, and wonderfully fascinating. Lunched at \"Les Goblins.\" Called on the Kensington people as per Appointment. An enjoyable afternoon with the girls. A party of us had dinner at \"Lyons Popular Café; then went to \"Chu Chin Chow\"; played by Oscar Ashe. The most gorgeous show I have ever seen.\n","143":"\n\nSnached an opportunity to go over the \"London General Electric Company’s power House, and to inspect the workings of the Underground Railway \n\nSystem. It is postively uncanny. The proverbial courtesy of the management I was able to inspect two big stores; Selfridges & Harrods. There was an air attack by German Raiders but I was too busy to take any notice of them. Went to a matinee at the Paladium; dined in town, and spent a pleasant evening \n\nJust caught the Scotch Express at Euston at 10.30 P.M. Writing this in the train as it rushes to the north Splendid rolling stock here, and the lighted stations that flash by look like a lighted street.\n","144":"\n\nArrived in Edinburough at 7.30 A.M. yesterday morning. Put up at the Waverly put myself outside a real Scotch breakfast porrige, herrings an \"a\". Got my bearings in the morning; a very nice city it is too, a delightful quiet place after London. Had a splendid day here; there are a lot of our chaps about. Inspected the Cannongate, the Castle, Queensferry and the Forth Bridge; sampled the whisky, it is good and there isn’t a \"heid-ache in a gallon o’it.\"\n\nWent to the theatre and Observatory Hill. Where those interested in astronomy can have the necessary seclusion. Back to Waverley; and \n\nthis morning the Management informed me that I had spent the night in someone else’s room. They make allowances for us however. Went with my letter of intro from the Kensington people to the Gibruth’s, they are nice people and made me quite at home. Threatening weather this morning; but it had cleared and we went motoring round Edinburough. The countryside looks bonny. Made a party for the theatre. Am back at the Waverly. \n","145":"\n\nSpent another day in Edinburough. Having a lovely time. There was rain in the morning Miss Gibruth and I played billiards. I promised her I would come and see them again; rather a reckless statement seeing as I return to France tomorrow. Left \"Edinbro’ Toon\", by the 10 A.M. train and arrived in Kings Cross at 7.30 P.M, after an interesting journey. Went and had a dinner at \n\nPicadilly. It was a dinkum dinner too, the last! Happily the \"U\" boats have had no effect on the food supply here as yet. I finished with a flourish I would not go back for a while yet; but money finish; \"Mafeesh filoos.\" \n","146":"\n\nWhen that damn janitor woke me this morning, I realised that this dream of a furlough was finished. Entrained at Victoria Street on the leave train; detrained at Shornecliffe, near Folkstone. Went up to billets in some residential mansions, and waited till evening. Embarked on the \"St George\" and landed back at Bolougne. Went to St Martins Camp again. Worked the oracle with the \"crown\" again, spent my last Franc.\n","147":"\n\nEntrained in Bolougne at 2 A.M. By a roundabout way we got to \n\nHazebrouk at 12.noon. Rejoined the Battalion at Sec-Bois. I’m not a full wake- up yet.\n","148":"\n\nHaving to drop back into the old rut has been very hard. Have been suffering the last few days, what the boys call \"Leavitis\" a curious malady. A sort of enlarged \"morning after the night before\". A huge new Hun Bombing ‘plane called a \"Gotha\" came over the place promiscuously. Missed our billet fortunately and was brought down a few miles away. This unlooked for reception has helped me to remember that there is a war raging hereabouts.\n","149":"\n\nWarned for the Line today inspected in Heavy Marching order. We shall not be long now.\n","150":"\n\nStill standing by under orders for the line. The gunfire from the north has sounded heavier lately. I guess our little \"infantry slaughterer’s are roaring to be fed. A Battalion parade. Major-General Walker was present. He presented Captain Hewish with the trophy; a large silver cup; won by the Company in the Divisional Competition. Had a \"march past\" the boys looked fine; \"zerm!, zest!. Snap!. Leiut. Col. J.C. Moore; our Colonel; smiled. As rare a thing as a sunny day in this country. Went on a night stunt, through the woods around La Motte – sur – Bois. Our Leiut fell into a canal. Otherwise nothing doing. He told me I had recommened me for promotion; two bars. A Corporal’s billet will do me.\n","151":"\n\nThe order to proceed to the forward area was cancelled. Spent another week in training. Lieut Smith was killed by a bomb from an aeroplane guess my promotion will hang fire again. Went over to La Motte. Reconnoitered the Chateau La Motte where General Birdwood is. Saw some peaches growing on a wall; swam the canal that separated me from them, and sampled them, for they are a novelty. They were good.\n","152":"\n\nThe Battalion moved today. Went up to the Dominion Lines and camped in Huts. This is familiar ground we were here last year.\n\n16\/9\/17.\n\nWe are in reserve to the 2nd & 3rd Brigades. Have position in deep dugouts in what was once the old Hun line.\n\nMoved up here via Dickebuche. Having it fairly quiet here tho’ there is plenty of work.\n","153":"\n\nThe","154":" Brigade is reserve to the stunt coming off on the Menin Road. and as ‘D’ Company is reserve to the","155":" Brigade we are not likely to get a chop. Working carrying stores etc. \n","156":"\n\nOrdered to report to Battalion H.Q. yesterday evening. Sent away to the N.C.O’s school at Castre. Went out in a motor lorry and reported to the commandant of the school. A nice little camp in tents. A decent town near my luck is in for once.\n","157":"\n\nWent out on parade, drilling with junior N.C.O’s. The work is brisk but it is no trouble to me. Did duty as section N.C.O.\n","158":"\n\nWorking with the school. We went with targets to a rifle range, for a shootng test. A chap beat me by a point for first place. The work is solid here nearly 8 hours a day.\n","159":"\n\nThe school was moved today. Went about 9 kilos past Steenvoorde to billet in a farm. We are only a few hundred yards from the frontier. Heard the","160":" Divison was about, went into Steenvoorde looking for Bob. He was not around. If I had got a fair go I would have been with the school a fortnight ago.\n","161":"\n\nLeft for billet yesterday and made a new camp in a field. Carried on with the training today. There are no new stunts and I am wise to all the old ones.\n","162":"\n\nOrdered to rejoin the unit today. The School broke up after a hurried examination. Rejoined the Company at their billet a few miles away. Collected some mail. Went to Steenvorde for the evening.\n","163":"\n\nWorking with the Platoon. Showing them some stunts no word of my being gazetted yet; though I do the work. On parade today the Colonel gave us the \"dinkum oil\". There is trouble before us.\n","164":"\n\nA Churchparade this morning where the padre piled on the agony about being killed in action. Then we moved this afternoon, to a point near Dickebusche, being comveyed in motor buses along the Ypres road. Have possies in the old trenches.\n","165":"\n\nSpent a couple of days preparing for the line. Have been instructed in the coming stunt. We of the","166":" Battalion will be \"Right on the Line\" and the first wave of attack. It has been quiet here except that the hun’s bombing machines come over and make the night hideous. Have received a fat mail of letters and parcels. We move up to the line tonight.\n","167":"\n\nCame into this rotten possie on Anzac Ridge last night. An old waterlogged trench. Intermittant shelling all day. He is wearing a new brand of frightfulness liberally here; the \"mustard gas\" shell. It is not dangerous till he puts ‘em in thick. He also used the incendiary shells to light up our roads, so that his bombing planes can see to shoot at night. We go over the top in the morning to take Broodseinde Ridge.\n","168":"\n\nWent up over a bad track early this morning and lay down before the front line, in attacking formation, waiting for our barrage to come down on his position. About half an hour before our \"zero\" time we were subjected to a heavy bombardment one of the worst I was ever out in. As I lay on the ground a large projectile; a 9\".2; I think; burst right underneath me and I was hurled many yards through the air. An extraordinary sensation. As I lay on the ground where I fell with all my physical functions except my brain; paralysed with shock; I was so mystified by my inert position that after several ineffectual attempts to move, I decided I was dead; for I could not understand why I felt so comfortable; a light and airy,\n\nfeeling. Even my heard did not seem to beat for what appeared to be a long time. When I began to recover I felt sick enough. Crawled forward and ordered the section forward out of the German Barrage. In the smoke and confusion it was almost impossible to tell whether the Battalion was still there or not. Then our shells decended on the Hun position like a thunderbolt. Went right ahead in among the Germans, there was hundreds of them. As we neared the crest of the ridge, I came onto a trench full of Huns, they saw I was armed with a hand grenade and threw their hands up immediately, in the few seconds I had ‘em bluffed our warriors hopped in on them and fixed them up. We took all our objectives, and the ground we won is no a souvenir hunters paradise. It appears that the German were massed here to attack our \n\nposition at precisely the same moment as we launched our attack. Our splendid fellows simply rolled over them. Have dug the support trench.\n\n A Hun airman came over early and observed this position we are being heavily shelled now. Was slightly wounded in the shoulder. Have dug a funk hole; but an enemy 5.9 gun has ranged right into my sector; and is blowing it to bits. Am not feeling to good, that infernal shell has shook me up.\n","169":"\n\nHolding our positions here. That 5.9 gun nearly got me last night; it placed a shell within a yard of me and buried me in debris. Was left for dead, but came round at daylight. Think I must have been asleep. Covered with blood but it was not mine. The company suffered \n\nheavily from the shelling during the night. My arm is very stiff and painful from the crack I received on the shoulder. We may be releived tonight.\n","170":"\n\nWas releived by the","171":" Battalion last night, in furious rain and wind. The guides got lost. I lead the company out, or rather they followed me; for after we got floundering in the marches it was \"sauve qui peut.\" Got out to our old position in Reserves, where I seized a \"Bon\" position in a concrete \"pill Box\", a vast improvement on the mud holes. There is plenty of tucker, and feel the better of a good sleep. I do believe the Hun deliberately tried to do for me in that last stunt. The walls of this \"Pill Box\" are four feet thick, and are strongly reinforced with steel rails and bars. This space inside is only about four feet high.\n","172":"\n\nStayed about reserves yesterday doing fatigue, in a steady downpour of rain. An alarm went and we stood-to ready to go back to the front line. Fritz counterattacked during the night, but we were not called upon. The sight of our guns answering the S.O.S. signal was a grand spectacle. The ground seemed to shake, with the shock of thousands of guns firing. Went and buried a cable for the Signal Company this morning. The excited way the enemy artillery is firing shows that he is badly rattled. Expect to be releived tonight.\n","173":"\n\nGot releived alright, came back to Dickebushe by way of roads that were an indescribable sight. They were lined along with shattered; waggons, lorries, guns, ambulances; dead horses\n\nand mules, all mixed up and piled in heaps. We covered about 8 miles; the track was very bad and a dark night with heavy rain. We suffered no casualties however. Had a clean up there, received some mail, then after a snack, we got on board the motor lorries; which conveyed us back to a new camp near Popperinghe\n","174":"\n\nA muster parade; roll call, etc; otherwise an easy day. Are not expecting to stay here long; we will move either forward or back. So I spent the evening in Popperinghe.\n","175":"\n\nHaving an easy time, with Bathing Parades and light drill. Was on guard last night a wild, wet one too. Have received 3 parcels; 1 registered, from Nell. The Huns bomb this area. Particularly the Hospitals near Popperinghe; we have him over almost every night.\n\n \n","176":"\n\nA church parade otherwise – nothing doing. Wrote letters to every one. A fine day. I am not sparking very well lately; guess it is a reaction\n","177":"\n\nMoved up into the forward area by way of boot and motor lorry. These are liberal with their motors in this 2nd Army. We are camped in Bow Huts now at \"Belgian Battery Corner\". Went over to the","178":" D.A.C. Had tea with Arch McIlveen.\n","179":"\n\nThe Battalion is doing duty building a light railway up to the positions we have captured. We get shelled just as heavily as if we were in the front line. Hinie objects to us building railways right under his nose and blows our line to bits as fast as we lay it down. Found\n\nJ.B.F. in the dressing station.\n","180":"\n\nGot shelled off our job yesterday. Scuttled for shelter when we were ordered to cover. I made a bee line for Jack’s dug out, and paid him a call. Found the 33rd last night but Bob has been wounded. They have decided to work at night. So we went out at 4 A.m. this morning and got back early. Went across to the \"D.A.C.\" again.\n","181":"\n\nHad a day off yesterday. Rested. Went up on a train; a most exil\n\narating ride; one of the Hun batteries tried to snipe us, we rattled along the line. Went tolerable close too; killed the brakesman on the end of the train. Three men were killed on the line. brought them back to the cemetary. next to our camp. It is a neat little\n\nplace, and I will be satisfied if I am brought back to it one of these days.\n","182":"\n\nWe are getting on with our railway. Fritz still objects strongly and tears up whole lengths of it. A big squadron of \"Gothas\" escorted by fighting machines came over this morning and keyed us up with bombs. This form of attack takes some getting used to and when I hear the engines of a \"Gotha\", I expierence that sensation known as \"wind-up.\" They come nearly every night and bomb all round our camp. They hit it the night before last and a lot of chaps were killed. Went to work very early this morning so dodged the most of the daily \"strafe\". Went to the D.A.C. lines and ate Arch Mc out of house and home again.\n","183":"\n\nThey are bringing up guns over our line now, and I had doubted that a line could be constructed over that dreadful marsh. The Battalions achievements with the shovel are no less creditable than its deeds with the bayonet. A \"Gotha\" was brought down not far from here. It is a gigantic machine. Both its occupants were killed. Arch Mc came to see me. Have received an Australian mail.\n","184":" November.1917.\n\nHave been on guard. Had a day off yesterday wrote letters and went to a show given by the \"Kookaburra\" concert Party. Spent last night riding round on the net work of light railway couldn’t get up to the line we are making, the track was destroyed came back to camp, through Ypres at 3 A.M. Drew some cocoa at the Comforts Stall.\n\non the Menin Road. Got our gear together and moved up further; to camp on dugouts on the Yser Canal. Have a good possie.\n","185":"\n\nStill hanging fire here. The railway construction job is finished there are more stiring things forward. Went for a bath. Met Syd Chisholm and George Doyle, they have just returned to the Battalion. Paid 20 Franc’s.\n","186":"\n\nDrew our fighting gear; bombs, grenades, etc. Was inspected. Warned to proceed to the line in the morning. I have slipped a lot in condition lately. Went and saw the new O.C. about my promotion, he reckons that it has not been gazetted yet. Captain Hewish’s death was a great loss to the company. He was a very fine solider.\n\nand he had promised me a fair deal. If I could wangle these stripes I could get a rest in England; I reckon that is what I need, I am about worn out.\n","187":"\n\nMoved up to the line and releived the","188":" Battalion; at 11 A.M. A new stunt this releiving in daylight. Am in a forward post. With Passchendale on the left front; a very rough \"possie\". The march into the line distressed me a good deal, fell down several times I have an Idea that shell last month; has fixed me.\n","189":"\n\nStill in the post, have built some cover for we must lay low in the day time. Have been off colour these last couple of days, have a fever. Have to lie in mud so it may be \"trench fever\" I am down to it. I will get some dope tomorrow\n","190":"\n\nWas releived form the post yesterday reported to the quack. Had a high temperature, was give a \"P.U.O\" ticket and was sent out. Walked out 6 miles\n\nto the 7th Field Ambulance. Was made a stretcher case there and sent on to the","191":" Canadian Casualty Clearing Station. Woke up this morning in between lovely sheets, and washed sweet and clean, in the 7. Canadian General Hosp. Etables. My ticket is marked No.19.A.T. so I guess I was sent straight on in an Ambulance train. There does not appear to be much the matter with me. They tell me I am to rest quietly. Can I? I should worry!\n","192":"\n\nHave been asleep for about a week. The doctor has not examined me yet. I rest in bed and read. I could die happy now. Glorious weather ouside. \n","193":"\n\nStill enjoying the \"rest cure\"; but I don’t seem to be getting much stronger. However I suppose these \"saw bones\" know what they are about. Every thing here is lovely. Bonzer nurses, good food, and a real live girl, a Motor Driver; comes to visit the bloke in the next bed and she talks to me. I am well set!\n","194":"\n\nThe Doctor told me to get up today \"Rest Cure\" finish. No feeling to gay however.\n","195":"\n\nWas marked for the Convalescent Camp yesterday. Drew my fighting gear after from the stores, a new set. Had a curious fainting turn this morning, can’t account for it, must want work. Shall go to the Con Camp tomorrow.\n","196":"\n\nNever got to the Con-Camp. Had a relapse with Pheumonia\n\ncomplications. Laid me out completely, nearly passed in my cheque. But the quack told me today, I will go to England when I’m strong enough. The sweetest words I ever heard. Five doctors held a consultation over me; I seem to have \"em mystified. \n","197":"\n\nFeeling better. Major Polson marked my ticket for \"Blighty today. I voted on the Conscription Referendum.\n","198":"\n\nWent out, a stretcher case into the No 24 Ambulance Train. Went to Calais; was carried out of France into the stateroom of the Ambulance Ship \"Brighton\"; by four stalwart Huns. A swift run to Dover; still treated as a serious case, was first to be\n\ntaken off the \"Brighton\". Placed in an ambulance train and was sent to London.\n","199":"\n\nWas taken from the train at \"Kings Cross\" sent in an ambulance to the","200":" London General Hospital, was admitted at 9 P.M.last night. Sent a cable home today. The doctor came to examine me, rewrote my case to suit himself. A small ward this nothing to see except four walls, and eight other beds. There is a staff of v.a.d.’s in this Hospital it is a gigantic place. There must be 2000 beds in it. It seems to be very well run, as are all English Hospitals. I will soon mend here.\n","201":"\n\nWe have some air raids here some times. The \"baby kittens\" fly over and drop bombs on this benighted city. All the patients are shifted down into the basement when the warning sounds \n\nThree incendary bombs dropped into the Hospital grounds the other night, but did not explode. By the crashes I could hear all his bombs are not \"duds\". The gunfire from the defences of London is terrific, and the \"Gothas\" get a warm reception. Still kept in bed. Swallowing gallons of dope. Received a bundle of letters from the Base Post Office.\n","202":"\n\nThis Christmas Day is vastly different from the last. Had an enjoyable day although I spent it in bed. The staff here worked hard for us and, the mistletoe, and other ancient English customs were celebrated. Generally the life in this ward is very quiet. The weather outside is mostly foggy. A chap in this ward has first come from the Italian Front, he tells some interesting yarns.\n","203":"\n\nSome of the Kensington people came to see me yesterday. They promise me a good time when I get my sick furlough. This is the quietest New Years Eve I have ever known, but I have never known a better one.\n","204":" January.1918.\n\nWas to have left here today, but the Sister-in Charge, reckoned I was not fit to travel the distance to Harefield in Middlesex. So I was not moved. I am utterly mystified with my condition, I seem only a shadow of my old self; and I’m just like a broken down horse. Anyhow this rest treatment, if it does me no good, it can do no harm.\n","205":"\n\nHave been out of bed two days, feel a heap better though very wobbly on my legs. Am to be transferred to Harefield tomorrow.\n","206":"\n\nTransferred to Harefield; No1 Australian Auxillary Hospital. Went as a sitting case in motor ambulance across London to Paddington Station. Half an hour train journey. I \"peaked\" on the journey and went to bed when I arrived here.\n","207":"\n\nThe quack came round this morning Major Adams. He decided my case was severe \"shell concussion\". He sent in my Board Papers; and he tells me that I am going home. I suppose he is pulling my leg. But if my case is as bad as he reckons it is I ought to go.\n","208":"\n\nMy papers came back from the Medical Board and I am marked to go home to Australia! Oh! What gorgeous luck! The Major says he will grant me no sick furlough, for the sooner I am \n\nback in \"Aussie\" the better. But I don’t mind. Lead me to that homeward bound transport. I will leave here tomorrow to wait for a ship in Weymouth Camp.\n","209":"\n\nLeft Harefield, and went to Waymouth via Paddington Station, London. Five hours in the train. Reported at Westham Camp. Headquarters of the","210":" Command Depot. Am in Dorsetshire now, a pretty county. Waymouth is a nice town; and there are hundreds of our chaps here; invallids, waiting for ships.\n","211":"\n\nBoarded again and classified C.2. permanantly unfit for Active Service; unfit for home service 6 months. So I am well set for a trip home. Was posted in No.4 Company, Westham Camp Classed unfit for duty; and there is leave every day from 4 P.M. till 9 P.M. I am recovering rapidly to take\n\nadvantage of it; for an opportunity like this would bring me back from the grave. I will have a splendid holiday here.\n","212":"\n\nJack came down from London to see me yesterday. He is looking fit. Went to town with him today, had a most enjoyable time. He went back to London this afternoon.\n","213":"\n\nWent for a run down into Devon during the week; was away two days but was not missed, it is lovely down there; well might they call it Glorious Devon! Had tea down town with Arch McKenzie this evening, and went to a show.\n","214":"\n\n\"X\" Carrier went yesterday and I am on the roll of Carrier \"D.2.\" We shall not be long now.\n","215":"\n\nAs the roll of Carrier D.2. is over strength my name was deleted. Curses!\n","216":"\n\nAnother gleam of hope. My name was added to the roll of Carrier \"D.1.\" Spent the evening with Arch Mc at the \"Red House\".\n","217":"\n\nMy name again deleted from the Boat Roll. Did anyone ever have such stiff luck. I’m anxious to get aboard that ship before I wake up and find it is a dream. Having a good time here though.\n","218":"\n\nPut in for sick furlough this morning was full of waiting about here. I dodged the parade; and at four oclock, went to the Red Cross hut to get the oil. Found I was on the roll of Carrier D.1.\" Nearly fainted tore down to the hall where the roll\n\nwas being called, just in time to get my ticket for the boat. I break into a cold sweat when I think of my narrow escape. We are off tomorrow morning.\n","219":"\n\nReveille 5 A.M. Entrained at Weymouth at 9 A.M. A 5 hour train journey to Plymouth through beautiful county all fresh with the green of early spring. The train went right into the docks, where we embarked on the Union Castle Liner \"Kenilworth Castle\". I have a good position on board. This is a splendid ship, 13,000 tons, carring passengers in the Saloon. There are many interesting sights in the docks here. Just alongside is the German Raider \"Czar\" which has just been captured. Nearby is the Hospital Ship \"Austuria\" which the Huns torpeoded. And the American steamer \"Palma\" that has been badly mawled by a \"U\" Boat.\n","220":"\n\nDropped down the stream yesterday and anchored in the sound. We make up a convoy including the \"Carriers\" BB (Durham Castle) B.2 (Dunvegan Castle) and a Newzealand ship \"Remura\". There are 16 ships at anchor here. Saw many warships including one of the mysterious \"Hush\"! ships. Mad March weather, windy and cold. We are very comfortable on this ship, the tucker is exellent. We are waiting to make up a convoy, do not know when we sail.\n","221":"\n\nWe sailed from Plymouth at 4.30 P.M. A convoy of 7 ships, with an escort of 3 cruisers, one American, and many destroyers, one balloon, and a seaplane. A fine sight. A splendid clear fine night we passed Eddystone light at 6 P.M. No lights are visible in the convoy. At last we are really homeward bound.\n","222":"\n\nA heavy swell today making good time about 13 ½ knots. The armed merchantman \"Mantua\" left us yesterday. There are only four ships besides us in the convoy now. Our course is about due west.\n","223":"\n\nSteaming on in beautiful weather blue sky above deep blue sea below. All sorts of strange creatures swimming in the sea, including flying fish a good omen we have covered nearly 3000 miles to date and still no land. Having a splendid tme.\n","224":"\n\nLand was visable at 7 A.M, this morning. The convoy sailed \"line ahead\" because of mine fields I suppose. Anchored off Freetown, Seirra Leone. at 10 A.M. there is a good anchorage here in the channel of a large river.\n\nRather pretty scenery here, tropical; but it is rather hot. No leave is granted here because of fever. Have run to date 3165 miles.\n","225":"\n\nSaw the blue miasma mist rising off the land this morning; they say that it is as deadly as poison gas to a white man. We took in fresh water; and the natives came alongside selling fruit etc. Then the convoy sailed at 5.P.M. with the light cruiser \"Kent\" as escort; this cruiser played a part in the destruction of Von Spee’s squadron. The niggers here are a fine stamp physically; they paint texts on the sides of their canoes and chant hymns. Evidently religious.\n","226":"\n\nGuess we crossed the equator yesterday. Weather is very hot. There was some gun practice in the convoy today at a target towed by our cruiser escort.\n\nthis ship made good practice with 6 rounds of 6 inch and 6 of Howitzer depth charges. I do some duty as guard, I reckon I won’t be caught again. \n","227":"\n\nNothing doing. There is a vast amount of wetness in the world, but every turn of the propellers is driving us nearer to the dear old Southland. Splendid weather continues, and everyone is debating when we will get to Capetown. The anniversary of the attack on Hermies and the death of my good comrade Palmer.\n","228":"\n\nTable Mountain was visable at dawn; also a fine big sailing ship sweeping along under full sail a grand sight.Got into the Capetown docks at 10. A.M. General leave from 11. A.M. till 11. P.M. Went and inspected the city and did some business.\n","229":"\n\nHave had two more days general leave here in Capetown, in very pleasant weather. A striking feature of the town is the variety of colours to be seen in the population. It is only just a burg and the dutch appear to be very luke warm. There are very modern docks here. The \"Orontes\" has arrived and will take on board the fellows from the other ships we will go on to Durban.\n","230":"\n\nSailed from Capetown at 10.A.M. We are getting along at a spanking rate now, must be doing 15 knots. We are steaming alone.\n","231":"\n\nKept steaming at a high speed all day. At 6.P.M. we swept round a point and came into a semi circular bay and anchored off the Town of Port Elizabeth. The lights of the town stretch all around the bay.\n","232":"\n\nBy night the lights of Port Elizabeth present a fairy appearance, but daylight revealed just an ordinary town. I managed to get among the percenage of men who were allowed ashore. We were the first Australian troops to land here. The townspeople gave us a rattling good time. A reception in the Town Hall and splendid entertainment. There are no wharves here all cargo is transported into lighters. We all returned to the ship at 6.P.M. more or less the worse for the generous hospitality of the townsfolk. A nice little city.\n","233":"\n\nSailed from Port Elizabeth at midnight. A reorganisation was made on the ship today when the men were made into companies one for each state. Arrived off East London at 11.A.M. \n\nThe anchorage is very treacherous here so no leave was granted. I slipped aboard a tender and stowed away was ashore for an hour and a half. A charming little port this. By a miracle I was not pinched when I returned. I should say that the hills around here would be the home of jumbucks. A lot of cargo was transhipped into lighters, and then we sailed a 8.P.M.\n","234":"\n\nSteamed along within sight of the coast all day. Arrived at Durban at 5.P.M. the harbour is shallow here but the wharves are decent. A white girl was signalling to the ship from the breakwater, she is said to meet every transport. The nigger stevedores are very active here, cargo and coal is flying everywhere. Durban seems to be a fair sized town from here.\n","235":"\n\nDisembarked from the \"Kenilworth Castle\" this morning. Entrained on the wharf and went about two miles to \"Cornella Camp\", where we camped in Huts. Not much chop of a place. Took a Rickshaw and went into Durban. All the trams are free to troops. A very pretty, clean, town. Met \"Tiny\" Hanlon’s brother, spent the evening at his place. Stayed the night at the hotel in town.\n","236":"\n\nHaving a great time here, they have not found a ship for us yet, to take us on our way. I am staying in town and several people are giving me an \"insight\" into the place. The zoo here is a poor place, I expected to see something out of the common. Splendid weather continues and I like this town fine.\n","237":"\n\nWent back to camp this morning but everything was right. The town was giving a welcome to the boys at Mitchell Park this afternoon; I did not go but \"clicked\" with a party called Norwoods, and we went motoring along the Maritzburg Road. Spent the evening at their home. A very pleasant evening. Returned to camp.\n","238":"\n\nSpent another day in town yesterday it was good Oh! Reveille at 5.A.M. this morning; got fixed up and went on the train, and was down at the wharf at 9.A.M. Embarked on the Ex-German East African Liner; \"Field Marschal\", and at midday we went out into the stream. This ship was sunk by the Huns to block the channel of the Fugi River somewhere in East Africa; but was raised by the British and refitted here. \n\nThis is her first commission since she was raised and there is some arguement, about whether she is seaworthy. I am certain we will see more dinner times than dinners for there is not suffient accomodation for half the men.\n","239":"\n\nThe Colonel has refused to sail until alterations are made in the accomodation on board. We drew alongside the wharf again and had general leave from 9.A.M. Went to town and went for a spin in Norwood’s car. Spent a pleasant evening, and returned to the ship at 11 oclock.\n","240":"\n\nLeave again, all day. I guess I can say a long while in this bonzer burg. Motoring with a chap all the morning. Called on the Norwood’s again. They wandered back to the ship. Where they are. \n\n \n\nWorking day and night on the alterations. They say we will be ready to sail in the morning.\n","241":"\n\nWe sailed from Durban I the \"Field Marshal\" this morning. We were making good time until we ran into a heavy gale. The ship threw herself about in an extraordinary manner; nearly everyone was sea sick. The lascar crew were down to it and I volunteered with other chaps to lash the lifeboats down they were breaking lose. A sea smashed our forward cookhouse, and we hove to for a while. Heavy sea’s are coming aboard and the decks are washing with water. The ship is rolling heavily, but as we have shifted our course to meet the gale it is not so bad now. Have never seen a big storm at sea before and I am enjoying the sight of flung spray and foam.\n","242":"\n\nThe gale has been blowing for three days now. It is giving us a most uncomfortable time in our crowded quarters. We do not get much to eat and have a wash sometime; we ship a wave occasionally, and it makes up for the deficiency of water. Many of the chaps are afraid the ship will capsize; she does roll very badly, But the old hooker is battling along at a fair speed. I like to stand for hours by the forward rail of the Promenade Deck to watch the flying spray and spume and swing with the ship as she rolls over giant combers, that seem to tower over us one moment then, rush beneath the ship leaving a great valley into which we sink. I think this storm is the most fascinating thing I have ever seen. A good sailor was lost in me.\n","243":" May.1918.\n\nThe gale has abated, though there is still a heavy swell. The old hooker is making good time always over the 300 miles a day. I did not think it was in her. We have minor engine troubles, and are very short-handed, so some of the chaps have been enlisted to work the ship. Most of the fellows are recovered from the sea-sickness. The food is very poor.\n","244":"\n\nFair weather with a southerly wind, a strong current has been noticeable during the past few days. We have had a general medical inspection for some reason; to mark our progress I suppose. Have been having trouble with the starboard engine. Passed between two islands today. \"St Paul\" to starboard and \"New Amsterdam\" to Port. They are very small and barren. \"St Paul\" is the crater\n\nof a huge extint volcano. Nothing doing on board here. Read a magazine article written on this ship by a fellow who travelled in her before the war. She has slipped a lot since those palmy days and is quite unsuitable for an invalid transport.\n","245":"\n\n Have had four more days very rough weather. Many complaints have been made and orders were read; that application had been made by the Senior Medical Officer by wireless to the Defence Department to have the ship condemned. Starboard engine is broken down again.\n","246":"\n\nOut early this morning and there was a great stir when the ships bell tolled the magic signal \"Land Ho!\" Everyone crowded the rail to get a glimpse of the good old native land. It looked \n\ngood too. Arrived at Fremantle at 7.30 P.M. men went ashore this morning, then there was general leave from 2.P.M. Went to Perth where the city tendered us a welcome at the town hall gave us a \"bun struggle\"; the freedom of the City and generally did us grand. Genuine people here, for this is dear old \"Aussie\"; and everyone is satisfied with our royal welcome home.\n","247":"\n\nSailed from Fremantle at 7.30 A.M. the H.M.H.S. Kanowna sailed just after us. A bit of a head sea. Passed Leewin light at 7.P.M.\n","248":"\n\nExperienced splendid weather all the way across the Australian Bight. Light winds, smooth sea. Have been going slowly, but we are making better speed now. Sighted land again this evening.\n","249":"\n\nWas on deck very early; and was able to recognise many of the light houses, for this coast is familiar to me. Entered the Port Phillip heads at 9.A.M. Queenscliff and Point Londsdale look well. Went up the bay and anchored of Williamstown. There is no leave for they want to hold an enquiry into the conditions on the ship. If we were along side the pier we would soon be ashore. As it is there is much cursing and nothing to eat. We will stay here all night.\n","250":"\n\nLanded at the new Jetty Port Melbourne and entrained on the Pier. Started at 11-30 A.M. and went straight through Spencer Street. Stopped at Seymour and other free buffets along the line, reached Albury at 7.P.M. Free Buffet some more Entrained in a \"Sleeping Car\", at 8.P.M. \n","251":"\n\nWhile on the train was issued with a pass for fourteen days leave, after which I shall report to No 4 A.G.H. for my six months treatment. All along the line we were heartily welcomed and as the train sped on, the boys leaning from the windows would shout; 22 miles to Griffiths Brothers\"; then presently again, \"twenty miles to Griffiths Bros!\" Arrived in Central Station, Sydney, at Mid-day. Went in a procession of motor cars to the Domain Buffet. The streets were decked with bunting, and the enthusiastic crowds in the streets were most embarrassing. A pretty girl I did not know kissed me heartily. A worthy reward! Left the Domain immediately.\n\nWent Home.\n\n"}}