{"Document Name":{"0":"Diary_0250","1":"Diary_0250","2":"Diary_0250","3":"Diary_0250","4":"Diary_0250","5":"Diary_0250","6":"Diary_0250","7":"Diary_0250","8":"Diary_0250","9":"Diary_0250","10":"Diary_0250","11":"Diary_0250","12":"Diary_0250","13":"Diary_0250","14":"Diary_0250","15":"Diary_0250","16":"Diary_0250","17":"Diary_0250","18":"Diary_0250","19":"Diary_0250","20":"Diary_0250","21":"Diary_0250","22":"Diary_0250","23":"Diary_0250","24":"Diary_0250","25":"Diary_0250","26":"Diary_0250","27":"Diary_0250","28":"Diary_0250","29":"Diary_0250","30":"Diary_0250","31":"Diary_0250","32":"Diary_0250","33":"Diary_0250","34":"Diary_0250","35":"Diary_0250","36":"Diary_0250","37":"Diary_0250","38":"Diary_0250","39":"Diary_0250","40":"Diary_0250","41":"Diary_0250","42":"Diary_0250","43":"Diary_0250","44":"Diary_0250","45":"Diary_0250","46":"Diary_0250","47":"Diary_0250","48":"Diary_0250","49":"Diary_0250","50":"Diary_0250","51":"Diary_0250","52":"Diary_0250","53":"Diary_0250","54":"Diary_0250","55":"Diary_0250","56":"Diary_0250","57":"Diary_0250","58":"Diary_0250","59":"Diary_0250","60":"Diary_0250","61":"Diary_0250","62":"Diary_0250","63":"Diary_0250","64":"Diary_0250","65":"Diary_0250","66":"Diary_0250","67":"Diary_0250","68":"Diary_0250","69":"Diary_0250","70":"Diary_0250","71":"Diary_0250","72":"Diary_0250","73":"Diary_0250","74":"Diary_0250","75":"Diary_0250","76":"Diary_0250","77":"Diary_0250","78":"Diary_0250","79":"Diary_0250","80":"Diary_0250","81":"Diary_0250","82":"Diary_0250","83":"Diary_0250","84":"Diary_0250","85":"Diary_0250","86":"Diary_0250","87":"Diary_0250","88":"Diary_0250","89":"Diary_0250","90":"Diary_0250","91":"Diary_0250","92":"Diary_0250","93":"Diary_0250","94":"Diary_0250","95":"Diary_0250","96":"Diary_0250","97":"Diary_0250","98":"Diary_0250","99":"Diary_0250","100":"Diary_0250","101":"Diary_0250","102":"Diary_0250","103":"Diary_0250","104":"Diary_0250","105":"Diary_0250","106":"Diary_0250","107":"Diary_0250","108":"Diary_0250","109":"Diary_0250"},"Date":{"0":"unknown","1":1229.0,"2":1231.0,"3":1232.0,"4":1233.0,"5":1234.0,"6":1235.0,"7":1236.0,"8":1237.0,"9":1238.0,"10":1239.0,"11":1240.0,"12":1241.0,"13":1242.0,"14":1244.0,"15":1245.0,"16":1246.0,"17":1247.0,"18":1248.0,"19":1249.0,"20":1250.0,"21":1251.0,"22":1252.0,"23":1253.0,"24":1254.0,"25":1255.0,"26":1256.0,"27":1257.0,"28":1258.0,"29":1259.0,"30":1260.0,"31":1261.0,"32":1262.0,"33":1263.0,"34":1264.0,"35":1265.0,"36":1266.0,"37":1267.0,"38":1268.0,"39":1269.0,"40":1271.0,"41":1272.0,"42":1273.0,"43":1274.0,"44":1275.0,"45":1276.0,"46":1277.0,"47":1278.0,"48":1281.0,"49":1284.0,"50":1285.0,"51":1286.0,"52":1289.0,"53":1290.0,"54":1291.0,"55":1296.0,"56":1297.0,"57":1300.0,"58":1301.0,"59":1437.0,"60":1443.0,"61":1451.0,"62":1458.0,"63":1459.0,"64":1460.0,"65":1461.0,"66":1462.0,"67":1472.0,"68":1496.0,"69":1497.0,"70":1499.0,"71":1503.0,"72":1512.0,"73":1532.0,"74":1550.0,"75":1562.0,"76":1563.0,"77":1564.0,"78":1565.0,"79":1566.0,"80":1567.0,"81":1568.0,"82":1569.0,"83":1575.0,"84":1577.0,"85":1578.0,"86":1581.0,"87":1583.0,"88":1584.0,"89":1585.0,"90":1591.0,"91":1592.0,"92":1593.0,"93":1594.0,"94":1595.0,"95":1597.0,"96":1598.0,"97":1599.0,"98":1600.0,"99":1612.0,"100":1618.0,"101":1630.0,"102":1631.0,"103":1632.0,"104":1633.0,"105":1635.0,"106":1649.0,"107":1655.0,"108":1656.0,"109":1657.0},"Entry":{"0":" \n\n","1":"\n\nWarned for Draft.\n","2":"\n\nDraft moves off from Camp at 10 p.m.\n\nEntrained at 11.45 p.m. The boys from our mess gave us a dandy send off, a large hamper & plenty of Beer.\n","3":"\n\nDetrained at Folkestone Pier at 6.30 a.m.\n\nWere billetted in town & had breakfast & lunch. Embarked at 1 p.m. for Boulonge reaching it 1 hour later.\n\nDisembarked & marched to Rest Camp.\n\nHad a hell of a time with the men, getting blankets & rations.\n","4":"\n\nMarched, with full pack from Boulogne to Camiers. Went into tents dead beat after the 14 mile march.\n","5":"\n\nMarches to Etaples for rifles, Bayonets, steel hats, & gas helmets. Went through gas chamber. One man got rather badly gassed.\n\nAfter dinner fired stoppages on 25 yd. range.\n","6":"\n\nParades all day & kit inspection. Another draft from Perham Downs marched in. Put them into tents.\n","7":"\n\nMarched Perham Downs draft to Etaples & back.\n\nHad afternoon off. Later second draft from Grantham came in.\n","8":"\n\nHad a bath parade, then a walk to the beach.\n","9":"\n\nWarned for the line in real earnest, issued w\/- iron rations, amtn. etc.\n","10":"\n","11":"\n\nWeather very hot. Altered draft from a small one of returned men to large one of reinforcements about 300.\n","12":"\n\nWindy, still standing by.\n","13":"\n","14":"\n\nDrew 48 hrs. rations and proceeded by rail to \"Albert\". Saw the famous hanging statue of the Madonna & child on Albert Cath. Stayed in rest camp all night.\n","15":"\n\nMarched to a village near Bapaume viz:- \"Ligney Thilloy\" where we joined the","16":" M.G.C., received a hearty welcome from officers & men.\n\nSeveral of the officers are old friends of mine. The village consists of a farmhouse & a large heap of Bricks.\n","17":"\n\nStarted at 9 p.m. for the Front line. After a strenuous march we reached our positions near Bullecourt. Mine was with a Gun in a strong position, one of the forward positions on the Hindenburg Line. Heavy shelling all night.\n","18":"\n\nStill in Trenches\n","19":"\n\nStill in Trenches\n","20":"\n\nFritz started shelling at 6 p.m. & kept it up until 6 a.m. on 12th, in all, a 12 hour bombardment.\n\nThe Huns evidently intended making an attack but our division (5th) took the job out of their hands, hopped over the top at 4 a.m., succeeded after 3 attempts to take trenches & over 300 prisoners. We stood by our gun all night despite the heavy shell fire & only I got a crack on my tin hat.\n","21":"\n\nWounded & prisoners started passing our position at about 5 a.m. The whole operation was a success but at an awful cost.\n\nSome Battalions have hardly an officer left. Altogether it was one of the worst stunts this year.\n\nWe buried a cove out of the 7th Bn. who had been lying in front of our posy & stinking awful.\n","22":"\n\nFritz bombarded all day & nearly all night w\/- shrapnel & 5\/9’s. Had a thunder storm during night & a heavy fall of rain.\n","23":"\n\nBombarded us all morning w\/- whiz bangs. The shelling increased in ferocity during the afternoon making it impossible to have a decent meal.\n\nThe early part of the night was a little better, but at 4 a.m. the Hun\n\nstarted firing every gun he could bring to bear to cover a tremendous counter attack. The air was practically full of flying iron, there was no space between the shells bursting, as soon as one had burst another took its place.\n\nAt about 5 a.m. it reached its worst & our Coy. was losing one gun after another. At 5.30 I stood up for a minute to have a look at the position & was just sitting back when a fragment of shell struck my \"tin ‘at\" punched a hole in it & then stuck into my head where it is at present.\n","24":"\n\nMade my way to Coy. H.Q. & reported to my officer, then went to the dressing Stn., after seeing the Doctor went back to H.Q. & had a drop of whiskey which I was very much in need of.\n\nAbout 7 o’clock I started for the clearing Stn.\n\nWent from there by motor to Bapaume where we spent the night.\n","25":"\n\nAt 9 a.m. we were put aboard the hosp. train, made a very slow passage to Boulogne where we were carried by motor to No. 3 Canadian Gen. Hosp.\n","26":"\n\nAfter a good sleep woke up feeling real good & Hungry.\n\nAfter breakfast the doctor had a look at us & we had our hurts dressed.\n\nThe weather is perishingly cold again.\n","27":"\n\nStill resting. Cut now almost O.K. again.\n","28":"\n\nSame again, getting restless & want to get out.\n","29":"\n\nBeautiful day. It is an awful pity to be shut up in Hosp.\n\nDoc. not satisfied with my head yet.\n\nMon. 21st\n\nThe M.O. operated on my head this morning & removed a piece of steel helmet. *\n\n*Unfortunately lost during Ypres offensive,","30":" J.C.L.\n","31":" \n\nMaking very satisfactory progress.\n","32":"\n\nStill doing O.K. expect to get out in a couple of day.\n\nAnother man died of wds. in the ward this morning.\n","33":"\n\nDischarged from Hosp. to No. 7 Con. Camp.\n","34":"\n\nSpent day in camp.\n","35":"\n\nWent into Boulogne at 2.30 p.m.\n\nFine town but not as good as Marseille.\n","36":"\n\nIn camp.\n","37":"\n\nIn Camp.\n","38":"\n\nLeave to Boulogne.\n","39":"\n\nLeave to Boulogne, saw the American medical unit arrive. Climbed to top of Grand Army Column.\n\nMarked out.\n","40":"\n\nMarched out of No. 7 Con. Camp to Base Details & went to town.\n","41":"\n\nWent out i\/c of big fatigue party to Rue Constantine Bks., Boulogne.\n","42":"\n","43":" as yesterday.\n\nMon. & Tues. 4 &","44":"\n\nSame job.\n","45":"\n\nWarned for Base.\n","46":"\n\nMarched out & went by train to Dannes, Camiers.\n","47":"\n\nExamined by M.O. (3 days L.D.).\n","48":"\n\nMet two Sgts. from our Coy. down on course of Inst. Had quite a celebration. (The Coy. suffered terribly at Bullecourt.)\n","49":"\n\nWarned again for line draft.\n\nFrom","50":"\n\nReturned to unit by way of Achiet-le-Grand, Albert & Becourt, found ‘em at Warloy-Baillon.\n\nHad a good time there practising for a competition (which, by the way, never came off). Aug. 17, J.C.L.\n\nWent from Warloy to Mailley \n\nfor field training. It is quite close to where all the big fights took place in 1916, Delville Wd., The Sugar factory * & several other famous fights.\n\nWe did some day & night manoeuvers but not much good in my opinion.\n\nWe returned from Mailley to the town of Contay.\n\n* Contal Maison & Beaumont-Hamel.\n\nWe did very little in Contay except gun work. We put in several hours per day on mechanical work & also spent the time in training 40 men. We got from the Bde., our reinfor. not coming to light quickly enough.\n\nFrom Contay we went north by rail to a town called Arques\n\n& marched from there to the village of Ebblingham a distance of about 14 kilos. We were billetted in three farms, 3 sections & the officers in one, 1 Section in another & the Sgts. in a third. Well we had a great time for about six weeks, with the exception of three days. We had to go some distance away to do field firing & classification. My section was an easy winner in the classification tests having all but 2 passed","51":" class gunners.\n\nOn our return to the farms we had a great spread & lived like lords, plenty of everything, eggs, milk, butter, apples, champagne vin Blanc, etc.\n\nPorridge w\/- plenty of milk & Ham & Eggs or Poached eggs on toast or omelette for Breakfast every morning, oh lor! it breaks my poor old heart when I think of what we had to leave.\n\nWell, as all good things must come to an end so our great holiday finished one fine day at noon.\n\nThe Bde. Captain rode up to our O.C. & asked if he could be ready to move in two hours & if so the motor Buses would be at the farm at 2 p.m.\n\nThese Buses carted us to a spot just outside Ypres, \"Belgian Battery Corner\" or \"Chateau Belge\".\n\nWe were issued w\/- Bivouac tents, 1 per 6 men & shown a spot where to pitch camp.\n\nThe second night we were paraded w\/- rifles & amtn. We marched through Ypres out on to the Menin Road as far as Birr X Rds., then went across country to a spot about half way between Neil House & Westhoek Ridge.\n\nWe sat down there for some time while our officers plotted our gun positions, where they were marked by pegs. We set to work to dig our gun pits according to instructions.\n\nWe had to make that trip four\n\ntimes under heavy shell fire, but were very lucky & had no casualties, but it was rather nerve wracking for the first two nights, after that we got used to it. Well, on the night of the","52":" we took our guns & Belts with us & occupied the positions. We had 26 Belts (7100 Rds.) per gun ready filled & a reserve of 20,000 Rds. per gun in S.A.A. Boxes. Seven minutes after the Artillary Barrage opened next morning","53":" we opened fire on our first Barrage line, after that it was one wild excitement, the main trouble being to control the rate of fire, the boys wanted to fire far too quickly.\n\nWhen we finished the barrage at about 9 a.m. we relieved alternate men for breakfast.\n\nWe have a couple of small primus stoves to each section which means we can always have a warm drink. After breakfast we changed barrels & stood by for S.O.S. signs. Altogether we answered 4 S.O.S. calls during the next 24 hours.\n\nWe were withdrawn about 4 p.m. on the","54":" got back to camp dead tired & hungry. After a good feed of hot stew & a cup of tea we were ready for bed. \n\nNext day was spent in cleaning the guns & putting things in order. We also had that night in bed, next day Nos. 1 & 2 sections were warned for the line to take part in the hop over on the","55":" We were given all the\n\nrevolvers in the Coy. & carried no rifles, each gun team had to have 6 men including the N.C.O. i\/c. All we were to carry was the Gun (42 lbs.), Tripod (48 lbs.) & the other 4 men had 4 belt Boxes each (84 lbs.) & a shovel, so we were pretty heavily laden. On reaching our destination that night we were told to store our gear in a captured \"Pill Box\" & then were guided back about 2 miles to some dugouts where were to stay till the night before the attack. Fritz shelled the whole area continuously and we never knew when or where the next shell would fall. We had to send one team to an isolated spot next day & unfortunately had two men & the officer wounded, the same day a splinter struck my other Sgt. in the\n\nback & we had to carry him away. All this was leaving us very short handed, which meant so much less amtn. with each gun.\n\nOn the night of the","56":" we drew rations & water & proceeded back to our gun store. There the whole attack was explained to the gun commanders & we were given maps of the ground over which we were to move. At about 3 a.m. we got out our gear & started to move forward to the front line.\n\nShells were dropping occasionally but did no damage. We were detailed off to the officers with whom we were to co-operate. I had to go with the 55th Bn. to the final objective. Sharp at 5.50 a.m. the\n\nArtillary Barrage opened up & a couple of minutes later the infantry started forward in Artillary formation. I saw several men hit just as we started. After that there were very few casualties. We were advancing at the rate of about 100 yds. in 4 mins. which enabled us to have frequent spells & drop our heavy loads for a couple of minutes, that is the only thing that enabled us to keep going.\n\nWhen we reached the first objective we had to wait there an hour while the guns smashed Fritz a bit more. When the hour was up we started forward again for another 800. Then we started to dig in, while\n\nsome parties went forward to clear out a \"Pill Box\" & a couple of broken down houses in front of us. We got a good yield of prisoners all dead frightened.\n\nBut there must have been some concealed snipers missed because quite a number of men were being knocked while standing about.\n\nWe had just decided on a position for our gun on a bit of high ground behind the new front line so that we could fire over the heads of the Infantry & cover their retirement should they be forced back at all. While the boys were getting the hole ready I turned round to look at the tripod when\n\nthe sniper got me, hit me a clean knock out in the chest, a nice clean little hole in front & a great big one where it came out behind, bleeding like a pump at every breath. I had to lay still for a couple of mins., then they got my equipment & clothing off & found the bullet had entered my left breast & come out at the back, the exit hole was bleeding profusely but they did their best to staunch it, gave me a drink & one of them went for the Stretcher Bearers. After some trouble he found a party & brought them along. They bandaged me more carefully & put me on the stretcher. From then on for about an hour & a half\n\nthey carried me over hills & hollows, round shell holes & god knows what. The shaking almost drove me crazy w\/- pain, but could not complain. It was very hard work even for 4 of them. On reaching a dressing stn. the doctor had a look at it and bandaged it carefully & sent me on to the motors about a mile further on. The trip in the motor was even worse than the bearers, theirs was a slow swing, the motor was a succession of violent jerks which nearly shook the remainder of my life out. After a long trip through Ypres we reached the C.C.S. in Poperinge. I was immediately put to bed, my clothes taken away to be burnt, they were all covered in mud & Blood. That same afternoon\n\nI was operated on & properly stitched up. For the next four days I did not do too bad & was marked fit to go down to the base Hosp. On the afternoon of the","57":" I was put aboard the Hosp. train & carted down country to Etaples, where we were taken to No. 24 Gen. Hosp. where I have been ever since.\n\nThis is now the","58":" of Oct, I had some ups & downs & at present seem as far off getting to Blighty as when I arrived.\n","59":"\n\nAm making some definite progress at last, temperature is down & am feeling real good.\n","60":"\n\nStill going strong, marked improvement this week so am hoping for the Best.\n","61":"\n\nStill going on O.K., am feeling well. Looking well & am well. Hope to get away shortly.\n","62":"\n\nLeft Hosp. 7.30 a.m., A.T. to Calais, got on board ship same day.\n\nDe.","63":"\n\nToo rough to cross, slept well, plenty to eat.\n","64":"\n\nMoved out at 9.30, arrived Dover 10.50, A.T. again, taken to Aux. Hosp. at Sholden Lodge, Deal, Kent. Very good home.\n","65":"\n\nLovely weather, cold. Feeling very well & want to get up. Wrote letters.\n\nFrom","66":" I made good progress until","67":" when I had to be opened up again on account of a collection of puss.\n\nAbout the","68":" I was allowed out of bed. From then until now","69":" I have been getting steadily stronger. I am able to take fair walks without undue fatigue. Have received letters from home and am feeling at peace with the world.\n\nOn","70":" was sent to Military Hosp. at Shorncliffe (Sandgate). Spent several slow & rather miserable days waiting to be sent to the Aust. Base Hosp. for a medical board.\n","71":" arrived in No. 3 A.A.H. at Dartford, examined by M.O. & marked for Board.\n","72":"\n\nBoard marked me C2 & am now waiting to see the Major.\n\nOn leaving Dartford I proceeded to No. 2 Command depot at Weymouth.\n\nWent on Furlough from","73":" to","74":"\n\nWent to London & Edinburgh, had a good time but was glad to get back.\n","75":"\n\nLeft Upwey Jnct. for Plymouth & embarked on H.M.S. Dunvegan Castle same day.\n","76":"\n\nPulled out into stream to await completion of convoy.\n","77":"\n\nHigh wind & choppy sea, issued w\/- Red X kit.\n","78":"\n\nSailed at 5 p.m. Large convoy & escort.\n\nPassed Eddystone Lighthouse at 6 p.m., ship rolling a bit.\n","79":"\n\nFound this morning that we have missed the remainder. Later were picked up by Destroyer & Balloon. Caught up in\n\nthe afternoon.\n","80":"\n\nNaval escort & several ships left us during the night, we are now only 4 Ships & an Aux. Cruiser.\n","81":"\n\nHeavey swell on & ship is rolling awful making reading, writing & eating a misery to say nothing of mal-de-mer.\n","82":" to","83":"\n\nSplendid weather. Have been receiving very bad news per wireless re enemy advance. Not much doing on board. Convoy keeping well together & improving speed, now about 12 Knots.\n","84":"\n\nSaw land just before breakfast & made Freetown (Sierra Leone) about 10 a.m.\n\nHad some fun &\n\nplenty of fruit from the native \"Bum boats\", very hot & sultry. The town is small but prettily situated at the foot of some fine hills.\n","85":"\n\nPulled out at 5 p.m. & continued our so far very pleasant trip.\n","86":"\n\nShips fired big guns. One S.A. boy effected by firing.\n","87":"\n\nSouth African died.\n","88":"\n\nDead man buried at 9.30 a.m.\n","89":"\n\nAm Orderly Sgt.\n","90":"\n\nSaw the Southern X for the first time. Sighted 4 ships to N. at 6 p.m. Lost them at dusk.\n","91":"\n\nSighted Table Mt. very early – made the bay about 10 a.m., berthed & disembarked the Springboks.\n\nAfter dinner we disembarked & went by train to a Rest Camp at Sea Point. Went into Cape Town in the evening.\n","92":"\n\nWent into Town & had a good look round Cape Town. Find it very pleasant.\n","93":"\n\nWent to dinner w\/- Mr. & Mrs. Alton & had a fine afternoon & evening. The people cannot do enough for us.\n","94":" & 16\n\nSpent in Camp fixing up tents, Sgts. Mess etc. Weather pleasant but threatening rain.\n\nAll men from Qld., S.A. & W.A. went off on Monday to Durban.\n","95":"\n\nI went on my own to Tea w\/- Alton’s & spent a very happy evening with much talk & music.\n","96":"\n\nA bunch of us visited the United Tobbacco Co’s works in the morning & had an interesting couple of hours. Went to free entertainment in the Tivoli after dinner.\n","97":"\n\nHad a bust up in the mess. A lot of men are drunk in Camp.\n\nWent to Pictures after tea.\n","98":" to","99":"\n\nThings going easy. I go frequently to Alton’s & am having a real good time.\n","100":"\n\nGrand Concert by Aussies in City Hall.\n\nHave been going all over the country seeing everything worth looking at.\n\nWent one day w\/- large party to town of Stellenboseh & had a fine time.\n","101":"\n\nOrders to pack up.\n","102":"\n\nEmbarked on TSS Tofua.\n","103":"\n\nPulled out at dawn & sailed about 11 a.m., very rough & stormy.\n","104":" & 23, Wed., Thur.\n\nStill very rough & rolling, tucker & quarters pretty good.\n","105":"\n","106":"\n\nSighted land 11 a.m. Picked up Fremantle Pilot at 1 p.m., berthed about 2 p.m.\n\nAfter tea Perth Ladies came on board w\/- fruit & cake for us & we had a great feed.\n\nPulled out about 9 p.m., sea very rough.\n","107":"\n\nArrived Port Melbourne about midnight. Disembarked from \"Tofua\" & reembarked on \"Suevic\" same morning,","108":" Sailed at noon. Beautiful weather.\n","109":"\n\nWeather continues \"Bon\".\n\nWe are getting quite excited.\n\n"}}