{"Document Name":{"0":"Diary_0499","1":"Diary_0499","2":"Diary_0499","3":"Diary_0499","4":"Diary_0499","5":"Diary_0499","6":"Diary_0499","7":"Diary_0499","8":"Diary_0499","9":"Diary_0499","10":"Diary_0499","11":"Diary_0499","12":"Diary_0499","13":"Diary_0499","14":"Diary_0499","15":"Diary_0499","16":"Diary_0499","17":"Diary_0499","18":"Diary_0499","19":"Diary_0499","20":"Diary_0499","21":"Diary_0499","22":"Diary_0499","23":"Diary_0499","24":"Diary_0499","25":"Diary_0499","26":"Diary_0499","27":"Diary_0499","28":"Diary_0499","29":"Diary_0499","30":"Diary_0499","31":"Diary_0499","32":"Diary_0499","33":"Diary_0499","34":"Diary_0499","35":"Diary_0499","36":"Diary_0499","37":"Diary_0499","38":"Diary_0499","39":"Diary_0499","40":"Diary_0499","41":"Diary_0499","42":"Diary_0499","43":"Diary_0499","44":"Diary_0499","45":"Diary_0499","46":"Diary_0499","47":"Diary_0499","48":"Diary_0499","49":"Diary_0499","50":"Diary_0499","51":"Diary_0499","52":"Diary_0499","53":"Diary_0499","54":"Diary_0499","55":"Diary_0499","56":"Diary_0499","57":"Diary_0499","58":"Diary_0499","59":"Diary_0499","60":"Diary_0499","61":"Diary_0499","62":"Diary_0499","63":"Diary_0499","64":"Diary_0499"},"Date":{"0":"unknown","1":1727.0,"2":1728.0,"3":1729.0,"4":1730.0,"5":1736.0,"6":1737.0,"7":1738.0,"8":1739.0,"9":1740.0,"10":1741.0,"11":1742.0,"12":1743.0,"13":1744.0,"14":1745.0,"15":1746.0,"16":1747.0,"17":1748.0,"18":1749.0,"19":1750.0,"20":1751.0,"21":1752.0,"22":1753.0,"23":1754.0,"24":1755.0,"25":1756.0,"26":1757.0,"27":1758.0,"28":1759.0,"29":1760.0,"30":1761.0,"31":1762.0,"32":1763.0,"33":1764.0,"34":1765.0,"35":1767.0,"36":1768.0,"37":1769.0,"38":1770.0,"39":1771.0,"40":1772.0,"41":1773.0,"42":1774.0,"43":1775.0,"44":1776.0,"45":1777.0,"46":1778.0,"47":1779.0,"48":1780.0,"49":1781.0,"50":1782.0,"51":1783.0,"52":1784.0,"53":1785.0,"54":1786.0,"55":1787.0,"56":1788.0,"57":1789.0,"58":1790.0,"59":1791.0,"60":1792.0,"61":1793.0,"62":1794.0,"63":1795.0,"64":1796.0},"Entry":{"0":"\n\n \n\n","1":" Vecquemont\n\nAnother fine warm day. The companies paraded under the trees on the river flat and were engaged on Lewis gun and other specialist training. General Robertson came round and had a look round. It is interesting to walk around the Transport QM’s department and the cooks lines. Our canteen under Sergt Kohn is running a splendid stock of all sorts of things. After lunch we had baths for the men in at Vecquemont. Word through of the 3rd Division battling away and of more prisoners passing through. Today J. Smith came back from leave and Mackinnon was evacuated to hospital. In the evening our band played a good programme down near our Y.M.C.A. tent. The troops are much bucked up by this spell and in good heart.\n\n \n","2":" Vecquemont \n\nThe Battalion paraded on the grassy flat and looked quite respectable in numbers. The men were clean and neatly dressed. We did a few movements in ceremonial and found that they were rusty enough in their drill. Lewis gun and other specialist training then followed. Tried a case or two at Orderly Room. At 3 pm walked down and met Colonel Duggan with whom I went to a conference in the Mill at Daours presided over by Major General Rosenthal. Generals Wisdom, Robertson, & Martin were there and all the Colonels of the Division. Transport was the main topic. Our future operations were also discussed and the news from the front is decidedly good. There is a prospect of our being here for a few days longer yet and \n\n \n\n24\/8\/18 Vequemont \n\nto us will fall the first blow of the stunt when it does take place Went to dinner with General Robertson at 6th Bde H.Q. in the evening when Cols. Brazenor and Duggan were also there and our cheery quack Doc Simmonds. Dinner was a merry meal although our old waiter Victor (of Savoy fame) was much missed. His death has here left a gap. The war seemed afar off as we dined but soon after, the crash of the antiaircraft batteries and a rattle of Lewis guns told of an air raid in progress. Walked back to our camp with Duggan. A splendid moonlight night with sweet scents of the summer in the air. In the moonlight faint fingers of searchlight beams were looking out for \"Jerries\" planes.\n\n \n\n25\/8\/18 Vecquemont\n\nThe Battalion paraded for church parade at 9.55 and marched down to Daours on to a vacant piece of land where the other battalions also assembled. The parade was less of a bore than these religious functions are as a rule. In the middle the General was called away and each Battalion commander in the marchpast, took the salute of his battalion. The columns looked well as they swung past to the tune of the band. We reached camp rather hot and dusty and then sudden orders came for me to report to Bde H.Q. at once and prepare to move. Went to Bde H.Q. and had a conference with the General & all the other officers of the group there. Got the dinkum and rode right back to our\n\n \n\n25\/8\/18 Vecquemont\n\ncamp for a bite of lunch and to hold a conference there. After talking the matter over with the company commanders L.G.O.T.O. Q.M. and others we hurried to call in all the packs great coats and all other surplus gear and to cart it to a dump over at Corbie. The Genl. went ahead in a car to make the preliminary arrangements and is to send word back to us. Today comes news of Bapaume in our hands and we ‘bus up to Pragart tonight, bivouac, relieve the 1st Divn tomorrow night and then attack at dawn the morning afterwards. Our camp changed its aspect completely in a few minutes – from a quiet Sunday afternoon show it became transformed to a hive of business – greatcoats rolled and handed in, rations issued and hats and other gear tucked away in\n\n \n\n25\/8\/18 Vecquemont\n\nthe packs which were handed in too. Steel helmets made their appearance and our new reinforcement men were joking one another about their appearance in them. We embus at a point just about 700ft from here. Our objectives unlimited enough and vaguely indicated as Peronne and the Somme river. From the accounts received the Hun is in a bad way now. We leave no Nucleus behind us – no one except WMC Braithwaite and 3 war worn and shaken veterans per company. This is necessary owing to lack of men and all will hop over. I am very short of officers barely running to 3 per company now. Wall I am putting with Harricks to give him his third. Today a good many wounded are coming down from the line and passing through here in motor ambulances en\n\n \n\n25\/8\/18 Vecquemont\n\nroute for the C.C.S’s of which there are several around here. The Lewis gun N.C.Os have a lot to do in the way of regulating magazines and their supplies and their rough & ready way of getting things done is amusing and instructive. The gems of language that float on this hillside and occasionally filter through into this dugout would make the straightest hair curl. Our small rest here has proved enjoyable and we could easily have done with a couple of days longer. The river so handy has been a godsend to the men Some of the chaps are getting rattled owing to the hard fighting recently and nothing is more pathetic I think than the man whose nerve is gone and who tries to avoid going up and yet stops short of clearing out until desperation compels it.\n\n \n\n25\/8\/18 Vecquemont\n\nOne such case today – of \"C\" Coy – who has really not seen enough fighting to leave him out and yet his nerve is gone. Will have to force him up in fairness to the other men. At 7 p.m. we moved out of camp to the tune of our band marching in platoons at a hundred yards interval. A very dusty track in the twilight down to where the ‘busses were to come in. The grass on the ground where we distributed ourselves beside the road was white with dust. An endless chain of motor ambulances, French British & American went past and there appeared to be a large number of gas cases. These chaps all had their eyes padded and many were asleep sitting up rocking to and fro with every movement of the car. Others had blankets pinned over their heads to keep the dust off them. A good many Frenchmen also gassed\n\n \n\n25\/8\/18 Vecquemont\n\nand blinded passed. There were plenty of wounded in addition and the sight rather sobered up our newer men. We embussed at about 8 p.m. and eventually got off alright. The cars each held 25 and saved us a very long march. The journey appeared interminable and was made in ink black darkness broken only by vivid flashes of chain lightning and later a deluge. Those men who were on the outside of the busses got rather a soaking. We passed through the wrecked streets of Villers Bretonneux in black darkness relieved only by flashes. Passed the old familiar Dolls House & rattled out into what recently was No Man’s Land. The flares were plainly visible from here. After much steady plugging away we came to a halt and waited a while in the darkness. Eventually two\n\n \n\n25\/8\/18 Vecquemont\n\nofficers came up and said that the heavy rain had so softened the second class road that we could not go further by convoy. So we had to debus, send for the guides and wait until they returned. Then we plugged along for about 3 miles over muddy tracks and all were tired by the time we reached our position – open fields sunken roads and not a particle of shelter. I lay down in a little hole in the ground and spent a miserable night. Nearly tired out I could not rouse myself enough to get up and walk about. Towards dawn Charlesworth flung a blanket over me and I got a confused and vexed kind of sleep for an hour or two until wakened by the duties of a busy day again.\n\n \n\n26\/8\/18 \nVecquemont\n Cappy\n\nPulled out at 10 a.m. to the Bde HQ to hear the exciting news from the General that we are to attack at dawn tomorrow. A busy prospect with all sorts of reconnaisances to be made. The 1st Division who we relieve appear to be pushing ahead on peaceful penetration lines and doing good work. Went back to camp to eat a bit of lunch and conduct a very hurried conference before getting into the saddle and pushing off towards the front line with Thewlis. Passed Chingnolles and there found the 11th Bn.HQ in a dugout where we got full details of their dispositions. This little village bearing many signs of German occupation is much knocked about. Leaving the village we passed a dead Hun his head covered with a bag\n\n \n\n26\/8\/18 Cappy\n\nnot from any reasons of tenderness but to hide his terrible injuries. Reconnoitred the valley to which we had ordered the Battalion and then tryed to locate 10th Bn H.Q. working on a map location given. The place was not there and we were subjected to very heavy shelling while waiting. Walked into Cappy which lies in a hollow and was only taken last night and there at last found 10th Bn HQ. and had a \"wad\" with Colonel Wilder Neligan C.M.G., D.S.O., D.C.M. who was very tired and anxious. His chaps were still pushing ahead well. A long walk back from here to Bde HQ. along the banks of the Somme. High green cliffs arise from the valley of the river and the village of Bray rises on the other side. The scenery round \n\n \n\n26\/8\/18 Cappy\n\nhere is diversified and interesting plenty of little hills and dales. Attended another conference at Bde – the attack is not to take place but we are to \"Peacefully penetrate\" another 1000 yards. Coming out from here found the battalion waiting for me scattered on the hillside and called the company commanders together for another conference. Snatched a bite at a few biscuits and set off for a deep Quarry where a sort of pillbox contained Bn H.Q. People had recently been killed here for there was a stink of new dead about. A few gas shells. The evening dragged on until midnight and owing to Brigade wire going we were out of touch there while Hughes had messed up forward communications to such an \n\n \n\n26\/8\/18 Cappy\n\nextent that we were out of touch with the companies. Went over and had a yarn with Nelligan and Duggan who are mutually relieving. A fine and bright moon tonight. A good amount of ironmongery is flying about. After relief we commenced silent penetration and pushed our line forward nearly ¾ mile. The penetration was not peaceful as Huns were encountered frequently. Harry Wall was killed by a shot through the groin and died almost at once. A veteran of the \"landing’, an M.C. winner and a very gallant gentleman. Corporal Rasdell & 3 others were killed too and there 5 wounded. We secured 3 prisoners & 1 badly wounded from a Mills bomb and covered with bloodstained bandages. The relief went through alright and the succeeding penetration\n\n \n\n27\/8\/18\n\nwas accomplished without a great deal of trouble beyond the few regrettable casualties and the high proportion of killed. The rest of the day was devoted to pushing further and further ahead until at last the men were unable to go any further. This day was one of the busiest I can ever remember. Telephone going all day and personal reconnaissance. Up the line in the morning while we were pushing ahead C Coy’s men were dodging over open places to bomb along the trenches and snipers were closely pegging away at them and worrying them. Each little rush over the open was a gamble with death and some of the shots went very close indeed. For ourselves in the evening I had a very heavy gassing and good rattling of machine guns. Our new headquarters was nearly shelled during evening\n\n \n\n28\/8\/18 Dompierre\n\nAwakened early to speak on the ‘phone to the General and found that conditions were abnormally quiet on our front. Decided to push the line forward once more and to use B & D Coys for so doing. Issued the necessary orders and having taken a very little breakfast set off to a new headquarters up near Dompierre which Harricks had just occupied. In the meanwhile Chalmers pushed ahead having occasional bombing scraps, until he reached Black Wood. From our headquarters we could see the bursts of the bombs they threw and Fritz was sending up flares from in front of Herbancourt and using machine guns. Chalmers soon established his line and connected with the 21st. Harricks then went through the village of Dompierre and the 24th connected up with him. We now had a Corporal of the German guards\n\n \n\n28\/8\/18 Dompierre\n\nbrought into us as a prisoner and under interrogation he said they had just been hurriedly bussed up from Ham and only came into the line last night. Their regiment evacuated the line opposite us at midnight. He was frankly fed up and declared Germany must lose the War. Sent a T.M. and a party for carrying the shells up to Chalmers. Spargo was the Corporal in charge of the party and was talking to him. A little later he was killed by machine gun fire. Chalmers now worked out until he had advanced his line ¾ mile ahead of the 21st having several scraps and young Layburn was killed. Issued the necessary orders for Harricks to come up on Chalmers right and pushed up a Stokes mortar and a Vickers gun to cover his left flank Fritz was \n\n \n\n28\/8\/18 Dompierre\n\nfiring occasional salvoes so I arranged for our guns to give Herbecourt another caning up with shell fire. This took place although owing to all the batteries moving forward there were not many guns sufficiently far forward to be in range of the place. This is the first stunt I recollect where we have been able to carry out lamp signalling and in which the Colonel has been able to direct the show with field glasses and map standing out in the open and watching the men getting into position. Getting up ammunition is one of the many problems here as we are going ahead so fast. On our right the 18th is going through the 21st & I hope this hurries the Boche on. Our prisoner says they are going back over the Somme. Heard later that the 18th had taken 30\n\n \n\n28\/8\/18 Dompierre\n\nprisoners. Our line had to come back quite a lot owing to the Hun activity on the left flank but our right swung up correspondingly. Our Lewis gunners caught a party of 5 Huns and killed them all on Chalmers front. After dark they are going to rat them. In the twilight the Hun put down a heavy lot of barrages and blotted out a good deal of the landscape with smoke. A little comic relief was provided by a Ford motor ambulance which very carefully careered along the main road up to our right post. Then turned about on our challenges and made for the rear at top speed. The General rang up to tell us to sit tight and have a quiet night. About 8.20 just after I had turned in to attempt to sleep for the first time for 2 days he rang up and said we were to \n\n \n\n28\/8\/18 Herbecourt\n\nadvance again tonight and to work around Herbecourt. No more sleep! Hurriedly issued orders and made arrangements and at 11 pm. left for a forward HQ. at Black Wood. When we arrived there, after a rough passage in the dark, we found plenty of dugout accommodation in the trench. Held a conference then of Davis & Chalmers and arranged for them to go ahead at 2 am. The 23rd did the same at 1 am (though stated so in their order it was later perhaps). Issued orders for Greene also to move up here leaving down below at 1.45 am. The ground here is that of the old battlefield pocked and scarred with shell fire and now grown over with rank grass and thistles. Everyone very tired and exhausted with this business of constant moving.\n\n \n\n29\/8\/18 Herbecourt\n\nThe Hun showed us a point and we carried out our operation on empty trenches. By 3.30 we had all our objectives and there was no sign of the Hun there or for a distance of 800’ in front. The 7th Bde went through us at 7.30 and the 5th Division accompanied by artillery were also moving through about that hour. There was absolute quiet on the front. Thus our \"front line\" very soon became a back one and we were free to wander round and look at what was, until a few hours ago, the dark and death haunted No Mansland. The good trenches were full of fine dugouts and bivouacs. Smith & Hewlis just at dawn heard grunting sounds out in front and discovered an old wounded Hun wandering about. Collared him and made him prisoner. He said he had been wounded 24 hours before.\n\n \n\n29\/8\/18 Herbecourt\n\nLaid down and tried to get some sleep but it was a hard matter on account of the constant interruption of the telephone. The few dead lying around were soon well ratted and we got a large haul of postcards and other effects. The day was not a bad one. At 1 pm I moved the battalion through Herbecourt to trenches in H26c. The village has been smashed to pieces. Found two heavy German machine guns lying in a trench here and captured them. (Yesterday we sent two 77’s, which he had damaged about the muzzle, back to the Transport Lines). We got into open trenches all round Herbecourt and put headquarters in an old captured English Y.M.C.A. which the Germans had been using as a hospital. The other H.Q. officers and myself located\n\n \n\n29\/8\/18 Herbecourt\n\nourselves in the old Isolation fever ward. From this place we see a high ridge covered with woods about 5 kilos away and taking a sharp right angled turn this is the far bank of the River Somme and at the foot of the portion directly to our front is the town of Peronne. The enemy is holding this and the other side of the village strongly and preventing our crossing. The 23rd have some of their companies in old YMCAs which adjoin here but as Fritz was using a high velocity gun with good effect close to here I issued orders for all my chaps to be in trenches and am shifting out myself. Tonight the men get a hot meal and a meat supper and draw their greatcoats for the night. No word of an immediate move.\n\n \n\n30\/8\/18 Herbecourt\n\nEveryone had a jolly good sleep in comparative comfort last night. The men had a splendid supper of tea and hot rissoles. Our men are wonderful – here they were running round like a lot of kids and having singsongs in their dugouts. Received word that my battalion is under the orders of G.O.C 5th Bde and that I am to see the General at 11 am. Went over to the Quarry where ours and the 5th Bde HQ were situated and first saw General Martin who told me that he was held up on the Somme and could not cross but that he was sending three battalions back to cross it behind our own lines and then working round that way towards Mt St. Quentin. Peronne should soon fall and to us & the 5th Aust. Divn the credit of getting it should accrue. Saw General\n\n \n\n30\/8\/18 Herbecourt\n\nRobertson then and had a talk about things. We may be pushed through the 5th to take further objectives. A very beautiful view from the high ground at Mericourt Wood looking over towards Peronne. Wood clad ridges in the distance add to a very beautiful scene – at a distant glance. A closer look revealing batteries in action and shells bursting and the knowledge that one is looking at a bloody field of battle does not make one any the more appreciative of its beauty. Spent the afternoon at Bn HQ writing recommendations for decorations and for the next half yearly lists. After dark the heavy guns started their nightly hate and their flashes lit up the surroundings. The flares along the front were infrequent and our troops in reserve were amusing themselves by firing their ones too.\n\n \n\n31\/8\/18 Herbecourt\n\nSlept in until 7.30. At 8 orders came to be ready to move at an hours notice. We are now so mobile that an order for a lightning move like this causes no perturbation. Greatcoats are quickly rolled into section bundles and dumped under the guard of a cook at the cookers. The Lewis gun panniers are put on the fighting Ambers and the No 1’s carry their guns. Signalling stores are among other gear put on to be carried forward as far as we can. Attached we have 2 Stokes Mortars with their shells and a limber to cart them also 4 Vickers guns with their transport and packs. This raises our fighting total to something like 350 fighters. The amount of Officers leave that is now being granted is proving a serious drain on our officers strength but as I told them yesterday the War must not be let to \n\n \n\n31\/8\/18 Herbecourt\n\ninterfere with so serious a matter as Officer’s leave!!. Today is dull and drizzly and there is a singular absence of shell fire on the front. We hear rumours of some of our people having got a knockback near Perrone . The 3rd Div. are said to have sent back 200 prisoners this morning. Called suddenly to Bde H.Q. and there saw the General who said that Mont St Quentin is in our hands and we are working Peronne. Our 5th Division unable to cross in front here is coming round and crossing it behind our line & then working round across us South. Saw a big crowd of Hun prisoners in column of route sitting down near Bde H.Q. Off one Cavalry Captain captured here we got valuable papers. Our 5th Bde did not have very\n\n \n\n31\/8\/18 Herbecourt\n\nstrenuous resistance but I see a number of wounded passing here. Received orders to move at 11.30 am across the river by a small bridge constructed by the Engineers our transport passing through Feullieres. The other bus all moving on ahead. We are to concentrate in certain map squares across the river and just north of Peronne near Mont St Quentin Here this area has not yet been mopped clear of enemy and our 23rd Battalion is to do the mopping up here. Everyone is being prepared for the move. I gave the men a drink of tea from the cookers and sent Thewlis ahead with them and all the Transport to cross the river and pick us up over there. Our padre is impossible absolutely and always blows in at the most inconvenient\n\n \n\n31\/8\/18 Herbecourt\n\ntimes usually just as we are having a meal (and rations are carefully calculated and we can’t provide for visitors) or just when we are moving. He is here now. Our five 77 guns captured at Dompierre were sent back to the War Museum by Miles yesterday. The front seems quiet from here. An India rubber gun is dropping an odd big one into the village of Herbecourt just beside us here. The loss of these prisoners this morning will upset our worthy friend the Boche. He could have made a very nasty stand on these heights overlooking the Somme had he determined to make his line here. Our men are still tired in spite of their two nights rest and the 7 miles march will not improve their condition. However as our bivouac formation is 24 23 22 21 it looks better.\n\n \n\n31\/8\/18 Feullieres\n\nWe went through the above village when we moved off until we struck a towpath which led up to a pontoon bridge put across by the Engineers. The little village is ruined and overgrown with weeds having been one of those destroyed by the bombardments of the Battle of the Somme in 1916. The canal has silted up and weed grown. We passed several groups of prisoners making for the rear some of them walking along carrying wounded unguarded inquiring the way as they went along. Fritz has a couple of balloons up and is strafing parts of the route we will be going over so perhaps we may have to get into artillery formations later. In any case I intend breaking down into half platoons as soon as we cross the bridge. Moved off again at 1.30 and got up to close to Clery sur Somme. The 21st Bn & their transport \n\n \n\n31\/8\/18 Clery\n\nhad just entered when he furiously strafed them so I held up our limbers and distributed the panniers to the chaps following. Shortly afterwards I met H Smith who had been going on ahead to act as advance party & he said the 23rd were held up and 24th just ahead of the village. Advised to sit fast so spread the Battalion out into artillery formations scattered in various shellholes and they were very well concealed only an occasional steel hat being visible. Waited here and thro’ the glasses could see our troops going over the skyline but whether from this Bde. or not it was impossible to say. The enemy also saw them and shelled the ridge heavily with 59’s. The glasses revealed several tragedies – a group of men, a sudden pillar of smoke and fire, some running back stunned and then the stretcherbearers doubling out to succour the wounded.\n\n \n\n31\/8\/18 Clery sur Somme \n\nAt 5.30 p.m. moved up to a Chalk cliff beyond Clery and there I saw Col Duggan. En route passed a dead man of the 7th F Co Engineers lying crumpled in the dust. It is extraordinary how a man’s face shrinks in death and looks like a skull - all the plumpness seems to go in a second The face a ghastly yellow and eyes glazed and staring. There was dust in his hair and I got two men passing to pull the body out of the way. Met Col Duggan and went to Lost Ravine. On the way the Boche put a shell close enough to put the wind up us both. Found Col Brazenor and he told us that the line was just in front of us about 1200’ and that the 5th Bde had been driven out of Mt St Quentin and were re-organizing in Gottlieb Trench. The General came in and we\n\n \n\n31\/8\/18 Halle. Peronne\n\ndrew up plans for an attack at 5 a.m. tomorrow morning and our Brigade will assault the Northern Suburbs of Peronne. The 24, 21, 23rd attack and we are in reserve. All my men dug into a high chalky bank and I hope to keep them there all night. Sent up a party of volunteer stretcherbearers to the Gottlieb Tr to clear 5th Bde. wounded. \n\nRoused hell into Sutherland for having returns late at Bde H.Q. The Boche consistently plastered our gully and kept dropping salvoes in it with a monotonous regularity. All these dugouts are on the wrong side and although one is safe enough when right inside the surroundings are dangerous and the doorways are death traps Orders & boundaries were altered and 24 &","3":" were ordered to attack with ourselves &","4":" in reserve.\n\n \n\n31\/8\/1\n","5":" St Quentin – Peronne\n\nAwakened in the early morning to issue orders and at about 5.40 heard a heavy bombardment open up on our left. At 6 a.m. the two other battalions attacked and the opening of our barrage was the signal for this ravine to get merry hell. Our doorway was persistently shelled. At about 7 a.m. over 200 Huns passed our door en route for the rear and when I went out at 8 a.m. the gully presented a remarkable sight. There were crowds of prisoners and plenty of our own and enemy wounded. Some of the wounds were very bad. One of our chaps passed me deluged with blood and with an arm blown off. Others were drenched to the skin with scarlet arterial blood. Germans were carrying stretchers with very badly hit men on them. I went up to the 23rd H.Q. and found\n\n \n","6":" Mt St Quentin – Peronne\n\nthat their doorway had been blown in and smashed to pieces. Three dead men lay under the ruins and stepping inside to see Col. Brazenor I had to tread on the mangled head of a 5th Div officer who lay dead and pinned in the debris. Found that Brazenors people had been having a very hard time and were much cut up. Moss and a number of other officers were very badly wounded. Others killed. They seem to have got well out but still short of their objective. On the right the 5th Div had a partial success and entering Peronne had collared a good wad of prisoners. I then went down to the 24th and found that their portal had been treated similarly – five dead men were lying there under a blanket. And sticky stuff on the floor was covered with dry grass. Found James in \n\n \n","7":" Mt St Quentin – Peronne\n\nthe dugout and his chaps had evidently pushed on better with higher casualties but were still very much up against it. Duggan rang me up to say that he had moved two companies up to work round Mt. St Quentin with another to rush up and another in Nucleus in Save Trench. Warned my \"C\" Coy to be ready for a prospective move. Our gully still congested. I put the R.S.M. on to reorganizing men of the 5th Division and sending them back to the line. Fellows who carry wounded down or escort prisoners accumulate in safe places if one is not watchful. Very bloody sights here this morning – so many poor rent bodies and shattered limbs. Some men dead on stretchers. Passing Germans are used to carry the wounded away to the rear A.M.C.\n\n \n\n1\/9\/18 Mt St Quentin – Peronne\n\nChance shells into our bank wounded King and A.N. Smith & 12 of \"Ours\". 8 Vickers gunners also wounded. Outside later I met two German officers one of whom spoke very good English. He was Lieutenant of a company stationed in Peronne and he had been in England in 1912 – a very decent jovial chap with glasses. He said our chaps surrounded them this morning and mopped him up. Their orders were to hold the place at all costs. He thought this was to be their winter line, knew nothing of doings except on his own front and had been opposite us at Herieville just two weeks ago. He said people in Germany were quite confident until our recent pushes when they felt that they could no longer hope to win. Conferred with the other C.O’s and Brazenor decided\n\n \n\n1\/9\/18 Peronne\n\nto push Duggan’s people up round Mt. St. Quentin which we did. Our communications back are rotten and we are out of touch with the guns which are losing opportunities of inflicting much damage on the Hun. Over 600 prisoners have passed here today. Too few men, inability to mop up m.g’s which remain active after our scanty numbers have passed – these are our recent defects or rather those of our leaders because officers & men are alright. At 1 pm I went up on to a high bank just in front of this ravine and from there could look right up to the commanding height of Mt St Quentin. Our heavies strafed the place heavily quickening up just before the assault and a battery of 13 pounders well advanced put over some very good bursts of\n\n \n\n1\/9\/18 Mt St Quentin – Peronne\n\nshrapnel Our men could be seen thro the glasses entering the village and working up through the ruins. After they disappeared from sight other came up in support. Shortly afterwards we saw them debouch out into the open and assault a Hun trench on the ridge. As they approached several of our men were bowled over. Presently they entered the trench and about 30 Huns emerged with hands elevated kamerading. They were collected & despatched to the rear. Returned to see Duggan and then moved the Bn. up in daylight to Gottlieb & Oder Trs. and Hgram Alley. Some dead lying round in huddled heaps. Wounded still continue to arrive and we have used the Huns time and time again as carriers for the stretchers. The 5th Division are now through Peronne and consolidating on the other side of it. A sunny day.\n\n \n\n1\/9\/18 Mt St Quentin – Peronne\n\nReceived some very extraordinary orders from Bde H.Q. which if acted upon would have mucked us well as I pointed out to the General. D Co with Harricks had a rotten job in getting to a place called Gott Mitt Uns Trench and Harry Thewlis was wounded by a 5.9. The situation in front here was obscure. The R.S.M while supervising ration distribution got a crack in the nose and had to get it plastered by the A.M.C. Apart from this minor bloodletting there was not much doing on the front. The night was dark and only gun flashes now and then and a few flares broke it. The 5th Divn on our right had rather a rough passage and the position was obscure. I had much trouble in getting touch with Harricks who was in Gott Mitt Uns Trench. Sent Sutherland to bed and did the midnight watch.\n\n \n\n2\/9\/18 Mt St Quentin – Peronne\n\nAt dawn the 7th Bde went out through us and evidently met heavy trouble as the position soon became obscure. I stayed in bed and rested until about 9.30 when I walked down to see Colonel Brazenor many of whose people turned up alright during the night and enabled him to get a little re-organised. While down here I received a priority message from Bde telling me that I was attached to General Wisdom 7th Bde. to meet any tactical requirements. Issued orders at once for the 3 left Coys. to move at once to Tortelle Trench. The right company (Harricks) to remain in their position in Gott mit Uns Trench because the Hun is in front of it and it is practically front line. Decided to transfer H.Q. to where Davis is moving out. Davis got his I\/ majority this morning. The 7th Bde report \n\n \n\n2\/9\/18 Haut-Allaines\n\nseeing signs of forming up for counterattack near above place. General Wisdom rang up about 1 pm and said that the Tommies on the left had received rather a smack and he wanted me to push a company up through Haut Allanes in 4 b to cover their flank. Issued the necessary orders for this. Communications as usual are the trouble again. Shifted H.Q. on to Oder Tr having a few salvoes splashed at us on the way and got into a deep German dugout. The number of these dugouts and the thorough work they have put into them is remarkable. Only 700 ft in front of us lies Mt St Quentin which our troops stormed yesterday while we watched through field glasses. On the left is Feuillacourt – a mass of green weed covered ruins – relics of the year 16.\n\n \n\n2\/9\/18 Haut-Allaines\n\nIn support of 7th Bde pushed Greene’s (\"C\" Coy) out to the Lock on the Canal. Gained touch here during the night with Pommies on both flanks. On our ration dump here 3 of our men were killed and others much shaken. Major Davis had some crying their eyes out up in the trenches after a bombardment – poor chaps their nerves are all upset. Remained on duty myself until pretty late and then turned in to bed. All our rations reached the Companies without incident.\n","8":" \n\nNo change in the situation during the night. I went out early – a fine day – and walked up past Mt St Quentin to where Davis is in Tortelle Tr. Passed several of our dead chaps and a German or two. More of ours. One chap had died with his head between his hands sitting slightly bent forward poor\n\n \n\n3\/9\/18 Haut-Allines\n\ndevil. Crossed over to Greene and found him dug into a canal bank and well looked down into by the Boche. All the men tired out and asking for relief. Not much stuff flying round. Haut Allines village is a mass of ruins. Our chaps are taking too many prisoners lately they want to kill more. We are getting plenty of men killed they avoid it by surrendering. Returned to Bn H.Q. at 1 pm. The Tommies on our left carried out a peaceful penetration stunt this afternoon pushing out patrols with platoons advancing after them. The rest of the day and evening was moderately quiet but the Boche pumped over a large amount of sneezing gas which seems now to be often enclosed in H.E. shells. QM Miles was up here later in the evening. Our searchlights and the Boche’s searching for aircraft are pretty.\n\n \n","9":" Haut-Allines\n\nA very quiet day. Did not go far away from BattnH.Q. The 29th Battn 8th Bde marched in to our relief later in the afternoon with advance parties followed in by the main body just after dark. There was not a shell near us as we came out and just simply hit a mapsquare. Fortunately on this square there was Habel and the mess and a few other things. Just like a home from home. Our family of officers is now painfully small. The last few days has further added to the large list of good chaps either killed or wounded.\n\n5\/9\/18 Fine hot day. Dressed in good clothes and rode down to 7th Bde (under whose orders we are still) to have a talk to their B.M. Arranged to move off from here at 1.15 pm to Cappy area where our own Bde is.\n\n \n\n5\/9\/18 Cappy\n\nRoute marched 5 miles to Cappy and went into bivouacs close to the Canal. Just after most of the men had got under cover a tropical downpour of rain occured and the whole place got flooded out. My palatial dwelling is a wooden room lately vacated by its German owners and mostly below ground level. The combined exertions of myself with an entrenching tool and the dutiful Charlesworth with a spade barely sufficed to keep the place from further flooding. The General called for a talk and said we are likely to be here for a week and to be inspected by Haig. Our mess tonight is in an old stable but we still manage to dine en famillie under the care of Otto Habel. Plenty of paper warfare after mess & in cleaning up of odds and ends of administration.\n\n \n","10":" Cappy\n\nA quiet day in bivouacs on the Canal bank with a pleasant warm sun and gentle breeze. Just the sort of day to do the troops a lot of good and they sat in the sun cleaning up. Went and saw James for a yarn and after lunch went to Bde HQ where we had a conference and afternoon tea with the General. The whole Division is concentrated round here just now. Cappy is knocked about and scarcely a whole house standing. Bde HQ is in the old Quarry – the firing line of a few days ago. \n\nReturned to a busy evening after mess. Major Dr Drummond called for a yarn and brought a dentist friend with him. We refought Gallipoli and other battles. Charlesworth salvaged one old copper and had a hot bath prepared for me. \n\n \n","11":" Cappy\n\nMost of the men at Baths today. Had a busy morning doing New Year Honour recommendations and did not move out much all day. Our Band playing in the afternoon. Camped along the Canal du Nord in little bivouacs and scattered dugouts. The life will be pleasant provided the weather could keep good but I should like the men to get back to a place where they could see something of French families and girls and a little civilization. They might just as well be in the backblocks as stuck out here perpetually in a military zone. Had an early mess to allow most of the Officers to go over to a 3rd Divisional concert party over at Suzanne just across the river where 3rd D.H.Q. were.\n\n \n","12":" Cappy\n\nSunday. Church parade with a painfully small Bde. there and a ridiculous sermon by a fool of a parson. Rain coming on we moved off without a march past. Later in the afternoon came a heavy downpour which washed the air and made visibility good. Wandered round the Transport and had a look how they were getting on with cleaning it up. Put in the afternoon writing and reading and making preparations for tomorrow’s work. Brigade have allotted us \n300\n bath vacancies which rather cuts into the day. At mess spoke rather strongly to the officers on the matter of saluting & of their relations with the men. This seemed have a good effect as several took the remarks directly to themselves. Read and wrote all the evening.\n\n \n","13":" Cappy\n\nThe Battalion formed up and was instructed by me at 9.15. Roused several people up. They then got on to cleaning their equipment. Walked round among them and watched the work. In the afternoon rode down to D.H.Q. and there saw . These staff lilies bore me to death. No doubt the feeling is reciprocal! After mess went to an excellent concert given by the 3rd Division Coo-ees over at Suzanne.\n","14":" \n\nA quiet and wet day. C. Brumby on his way to join 8th Bn came in and I phoned for Jack. We foregathered and had a pleasant yarn recalling old times. Great preparations for G.O.C’s inspection on tomorrow – a Brigadier’s inspection only. Our band played at mess. The rain made the camp roads & the bivouacs most uncomfortable and wet.\n\n \n","15":" Cappy\n\nToday the General was to have inspected the Battalion on parade but rain setting in early the thing was cancelled. Consequently the sky cleared and the morning turned out not half bad. Inspected the whole Transport section and found a fair turn out there. The remainder of the Battalion carried on with drill of various kinds. After lunch we held some Battalion Sports but the weather rather operated against us. Was summoned to Bde HQs to a conference and the G. told us the fiat had gone forth that one Battalion of this Brigade was to be disbanded. We decided \nthe\n to leave the matter to him and abide by his decision. There will be some broken hearts in the 22nd Battalion if he touches it. We shall await the decision with impatience.\n\n \n","16":" Cappy\n\nAnother threatening day. Formed up the Battalion for parade and practised the General Salute with the Band. The rain then came down and put a stopper on the show. Let all the men go back to their \"bivvies\" and arranged some form of gas inspection but the morning was wasted. The afternoon like others lately was fine. The companies were at games. \"C\" Coy had a competition for the best turned out platoon and were very keen. It was a good smart turnout altogether and we decided on No 12 as first with 10 second. Towards evening we had a sunny hour or two. After mess walked out for a while in the twilight but another shower (the prelude to a wet evening) forced me home to my little room half above half underground. It will flood in winter time.\n\n \n","17":" Cappy\n\nA good deal of rain fell during night and the morning was showery. Brigade telephoned that Sports were postponed so I arranged for the specialists to have a morning after their own hearts. Smith was among his Lewis gunners & Hughes with his signallers. Put different people on the job of building sheds and making other improvements round the camp. Since our arrival we have made a great change in the look of this place.\n","18":" \n\nWent to D.HQ and sat with Colonel Ralston and others on a F.G.C.M. We tried Major Packer 105 How. Bty on various counts mostly connected with paybooks and passed sentence. Attended Bde Sports in the afternoon and we won a number of events – especially the field race but crashed on the tug of war.\n\n \n","19":" Cappy\n\nA beautiful cool sunny day. Being Sunday we held a Church parade and exempted the Band as they are practising for a competition. A Y.M.C.A. piano played by some stray Billjim proved a poor substitute. After lunch Padre left for Australia – unmourned and unwept. The afternoon continuing fine I went up to the top of a hill close by with my glasses and could easily see Mt. St. Quentin and the scenes of our late battles. It was quiet and peaceful up here and the country had a \"Sunday\" look. The night turned out a mild moonlit one with plenty of planes humming overhead. Our planes were outlined with electric lights looking very pretty – a new idea. Continued writing some Battalion history.\n\n \n","20":" Cappy\n\nIt was a beautiful fine day. We marched to Divnl Sports near Eclusier and they proved a great turnout. The tote and Tatts-sur-Somme were busy – a crowd of gamblers. The great event of the day was the Band Competition well won by 4th Battalion We crashed on the music - being first the men were nervous and had no wind. There were some fine bands here. The 21st were second. Some nurses arrived and Birdwood Monash & Rosenthal were also there. Fell in with and yarned to some of the former and then drifted on to some of the latter. Some good fancy costumes. A lovely view from here today over the surrounding country. Returned to camp about 8 after a day full of varied experiences and very enjoyable.\n\n \n","21":" Cappy\n\nEarly this morning a young hurricane accompanied by lightening and thunder caused a great deal of damage in the trees along the Canal Bank. Formed up the whole Battalion for inspection at 9 a.m. and was not at all pleased with the turnout saying nasty things to a lot of people. Indeed today I have been very snaggy and excitable. The General came in just before lunch for a yarn but let drop no hint as to which of the Battalions is being broken up – this is the burning question at present. Afternoon nearly everyone was playing football and the matches were interesting. Feel dopey and cannot concentrate lately on any work. This tiredness is the tiredness of staleness I think. One can be too long on the job. 1914 men are hurriedly being pulled out first for a trip home.\n\n \n","22":" Cappy\n\nA fairly fine day. Turned out the whole Battalion for parade but 200 men had to be bathed which cut into our work. Smith took some Lewis gunners away for live shooting. Our N.C.Os school is also on the go and the new N.C.Os seem to be rapidly acquiring confidence. The afternoon was filled in completely by football matches and it was great to see all the officers and men out and to note to interest displayed by all in it. Took a walk into the Village and there saw Major Reed and Bowes Kelly at the","23":" Headquarters. Returning from here looked in at the 24th for a yarn to Elwood. A moonlight night with grey scurrying clouds. Choice gems of language from the troops kept floating on the wind’s wings.\n\n \n","24":" Cappy\n\nA fine day again. After the morning inspection we carried on with the programme of work laid down. Some men away bombing and others doing live shooting with their Lewis guns. In the afternoon we carried on with football. The G. gave me a furphey that the 5 of Bdes were each to lose a Battn. Went to a good concert at 23rd in their P.O.W. cage. Saw Jack. \n\n20\/9\/18 \n\nParaded the whole Battn. and its transport and formed up on a large piece of adjoining open ground. Got a very good and smart turnout. The timbers looked very well with their new varnish. Had a march past after the parade. Lunchtime a conference at which the General announced disbandment of 21st. Another Conference later re a stunt.\n\n \n","25":" Cappy\n\nThis Saturday morning is blowy and lowering. Last night the crispness of the air was verging on frost – summer has left us. Great scheming and wondering is going on about the 21st – probably all of no avail. Everyone feels very sorry for them. Poor Leon Barbier came down yesterday in a terrible state searching a new home. This morning the 21st held a mass meeting and deputations of officers and men waited on the General in the hope of avoiding being broken up. We carried on with providing more accommodation. I went to 6th Field Ambulance and had afternoon tea with Colonel Welch and Simmonds. After that returned. The evening calm and moonlit. Rambled to Bde & 21st and saw Reed.\n\n \n","26":" Cappy\n\nChurch parade out in the field. Fool of a padre and fool of a sermon – the church parades do the men little good and the parsons make asses of themselves. The afternoon was wet. Rode over to Herbeville and went over the old battle ground there. There was nothing (except the small stone base) left of the Crucifix but we could see where it had been. Looking from here one wonders at our temerity in attacking this position with 100 men on a front of half a mile. The empty cartridge cases told of the machine gun fire. A heap of torn equipment blood covered marked where a shell had burst and furnished occupants for some surrounding small graves. Madden with here. Saw Leo’s Grave. On the way back we noticed the \n\n \n\n22\/9\/18 Cappy\n\nbig Naval gun lying blown up near its emplacement. After mess I went up to Bde. H.Q and had quite a long yarn with General Robertson about things in general and the 21st in particular. The General was in a talkative mood and discussed the whole war situation with the air of one who, knowing all, knows nothing.\n","27":" After a wet night the day kept fine and I sent the Battalion out for a route march under Davis to see the big gun. Myself walked down to see Duggan and had a yarn with him about the proposed split and do not think that I came away having done any harm. Some 24th people bombing and in the air were sounds of much machine gun rattle of units practising. Saw Jack for a while in Cappy.\n\n \n\n23\/9\/18 Cappy\n\nThere were several football matches in the afternoon. For mess Dr. Simmonds and Jack arrived and stayed afterwards to a game of bridge. The night was cold frosty and moonlit and the drone of aeroplane engines high up was very audible. The rumble of transport very noticeable on all the roads as American divisions move up. They sleep by day and move up by night. All indications point to an early and large operation on this front. The heavy machinery (in the way of large pieces) is also to be seen on the roads. The Billjims soon seem to get wind of it if there is anything doing at all. Their sources of information are varied & numerous.\n\n \n\n23\/9\/18 Cappy\n\nAn exquisite day. The first leaves fell from the trees today – Autumn. On the grass was a heavy dew. From the front came a rolling and heavy cannonade that continued until late in the day. The Battalion paraded as a whole and then did specialist work. In the afternoon were Sports and we received word that the break up of the 21st was definitely decided upon. All the coys. supplied 50 men each for a concert at D.H.Q. I went along later to see Col. Durrant about Wood and other matters and then looked in. It was not a bad show at all. Coming back had a yarn with Dr. and others. There is talk of the 21st. jibbing tomorrow but I don’t think it will come to anything. After a yarn in the mess – routine work.\n\n \n","28":" Cappy\n\nA rather memorable day in the history of the A.I.F. and of the Bde. \"A\" Co.","29":" allotted to us were ordered to march in at 9.45. They refused to move. After lunch their officers reported but their demeanour was such as leave no doubt as to where the men were getting their support from. I endeavoured to say a few welcoming words but might as well have spoken to icebergs. Later on the General came and I suggested a scheme of compromise which he welcomed. After mess word came through that for the present \"everything was suspended\" which looks like an ignominious crawl down on the part of the authorities and straight out and complete victory for the strikers. A fine chilly evening.\n\n \n","30":" Cappy\n\nEarly reveille and marched to Herlieville where we did a practice with tanks. A fine day, keen air and an enjoyable march. The tanks were lined up on our old battle ground and the troops followed them. Noticed in their wake several horribly decayed and rotten German bodies. It says something for the callousness we have when corpses can lie on a training ground that has been used by the troops of two Divisions. On our way back we called in & saw the big German gun near Chuignes. Salvaged a big Hun minnie. After mess received warning order for a move forward tomorrow and that Thewlis & Fulton have M.C.s and Jack has a Bar to his M.C.\n\n \n","31":" Cappy\n\nMoving day. Knowing the rubbish and salvage that accumulates after a 3 weeks stay in any one place I ordered a full marching order parade & piled arms and dumped kits out on the grass. Cleaning parties then went through the lines. At midday I made a close inspection and found some lines good and others distinctly bad. After lunch all the salvage was collected in a heap and it will take a limber to shift it. Tried covertly to keep our football team out by putting them on a guard but Anderson innocently referred to footballers being kept out so I cancelled the whole thing and ordered every man Jack of them up the line. We do a night march and concentrate 10 miles away near Peronne before dawn. A busy\n\n \n\n27\/9\/18 Cappy\n\nday for T.O. and Q.M. We are taking in 6 L.G’s per company this time. We know very little about things impending but the Americans are supposed to be pushing on followed by our \"O\" and \"D\" and we exploit their gains. At 6.30 we pushed off and reached the starting point where the 21st were going by. They made several jokes about the dugouts we built for them and said that we \"could take the curtains down\". Right through Dompierre and Assevillers we went. Here we took a wrong turn following the 21st who were well astray and they had 2 coys and their transport mules. We realized our mistake and two coys had about a couple of extra kilos. to do – much to their loudly expressed disgust as\n\n \n\n27\/9\/18 Le Mesnil\n\npacks were heavy. Passed Corps HQ at Assevillers and swung on till we met our guides. It must have been a good 12 mile march and the fellows finished cursing at the top of their voices and fed up to the teeth. To my disgust I found the cooks had no tea ready for the men but cooly said that it would be ready in a quarter of an hour. I was in a boiling rage. Camped in trenches and shelters scattered round open paddocks. Trench shelters and the like. Sent out for Q.M. Miles to strafe furiously about the tea business and then went to bed in a well ventilated leanto which caught in its many cracks every wind that blows. Slept soundly and well rolled up in the blankets of my valise until 9.30 next morning.\n\n \n","32":" Doingt – Le Mesnil\n\nA dull showery unpleasant and cold day. Got the QM and the Sergeant Cook up and vented my spleen on them for not having tea ready for the troops last night. Rain fell nearly all the morning and made the chalky ground unpleasantly slippery. The men all in little trench shelter covered bivouacs in the trenches. Behind us we have Peronne on the left is the famous Mont St Quentin showing very visible evidence of the battering it got that memorable afternoon when our lads went into it. Doingt surrounded by hospitals and camps is just ahead of us. Rolling bare downs all round give great fields of fire for Lewis guns or German machine guns. The General came round and told me that we shift on \n\n \n\n28\/9\/18 Le Mesnil\n\ntonight. These rapid moves are all being conducted silently. We do not know how things are going on the front elsewhere but absence of news of large advances and many prisoners lead me to believe either that the show has not started or that things are going too slow. Packs valises & blankets called in and everyone got into battle order ready to move. We passed our starting point at 7.45 p.m. and had a good march in the dark all things considered. Our band was playing as we passed about 300 German prisoners (some wounded) being escorted to the rear. They picked up the step to the tune of the band. It was dark but starlit and the searchlights and aeroplanes were active. The searchlights were thick and used on an angle sweeping method. We passed through\n\n \n\n28\/9\/18 Marquaix\n\nthe ruined villages of Boucly and Tincourt. At the latter place we met our guides who took us overland to the side of a hill which is where we are to stay. It was fine fortunately and all the men in the dark soon settled down. Tea was ready on the cookers – thanks to my performance last night. The Q.M. delivered the blankets and there were some trench shelters. Out of the mix up soon came order and a reasonable amount of contentment. A lot of chaps calling out to one another in the dark. Lots of filthy obscene but cheerful language being used by the coarse soldiery. One of two big shells whistled over towards Marquaix – our reintroduction to the species. The cheerful but disgusting profanity of the troops very marked the last few days.\n\n \n","33":" Marquaix\n\nDawn was heralded by an intense bombardment which dwindled off into the sustained rattle \nof\n & rumble of the heavies later in the morning. A fine clear day. The bivouacs turn out to be not so bad after all – dug in to little banks and sunken hedges round a hillside. Many of the men slept on the grass and pulled their trench shelters over themselves & their blankets. General Robertson was round and said the Americans succeeded in their attack this morning after a little trouble on the left. A very large gun of ours is firing from the railway near Marquaix this morning. A few big shells came to hand from Fritz occasionally. Took a walk up on to the high ground near the camp and got a good birdseye view of the countryside. On the horizon was smoke of shell bursts.\n\n \n\n29\/9\/18 Marquaix\n\nHad a talk to a Lieutenant of English artillery and saw crowds of Hun prisoners in a cage. Late in the afternoon the weather set in cold windy and bleak. Long strings of cavalry were moving up before dark and the railways surrounding here were busy with many trains. Flares show up a tremendous distance off. Although the firing line averages 8 miles off yet the flares seem only about a mile off. At twilight went up again on to the high ground – a windy dark cold night – one for a home fire and peace but here in war, bloody war and a hole in the ground for a dwelling. Charlesworth my batman is a good man. Little as A\/Adj is splendid capable little soldier who will go far in civil life.\n\n \n","34":" Marquaix\n\nDuring the night there were heavy gales and rain and my fragile shelter looked like getting flooded out. A bleak cold night and terrible for \"poor bloody Bill lying beleaguered wounded in a shell hole on the ridge\". Some of our little bivouacs were blown clean away. Dawn showed a raw gusty and sullen day. The B.M. came with news that the left American Division had come rather a crash and were back where they had jumped off from. Later in the day a few stragglers were back this far looking for Y.M.C.A.s etc. Recd. word that our 5 Div will attack tonight and we may expect to go in tomorrow night. After dark our little bank with the battalion dug in along it was like a little Bourke St with fairy lights shining. Had to get a lot extinguished o\/a Hun planes.\n\n \n\n1\/10\/ Bellicourt\n\nA fine warm sunny day heralded in October. First thing it was frosty but warmed up into delightfulness. Just after turning in last night an order came to prepare for a move at 9 a.m. Ordered early breakfast and heard nothing more until 0835 when an order came for us to shift at 0900. Moved off at that hour all equipped in Battle Order and taking our transport with us. The route lay through Hervilly – Hestecourt and across a bad third class road to Villeret – some of the transport got bogged. Formed into bivouac formation close to some 6 mch guns and the cookers came and dispensed lunch. Our billeting parties had already gone on ahead. On moving off again we crossed a valley and made for a line of trenches on top of a ridge. In these there was absolutely no kind of accommodation and the men \n\n \n","35":" Bellicourt\n\nhad to dig in with the aid of their groundsheets. From this ridge we look down on Bellicourt Estrees & Nauroy – Hindenburg Line citadels now in our possession. A beautiful sunny panorama. The sound of guns is continuous here and the whole air vibrates with it. Aeroplanes are active. There are many Americans about. Walked over to an adjoining Quarry where we found five or six 6 inch German guns abandoned. The Americans had evidently jumped off from here as a number were lying about dead. Two were lying together in one place – one a fine big chap was lying on his back half resting on the other who was like a heap of butchers meat having received a direct hit that had dismembered him. A rumour was very persistent among the troops that there was a corpse boiling down establishment\n\n \n\n1\/10\/18 Bellicourt\n\nin Bellicourt. Investigation proved that there were some coppers in a room here and a shell had landed among a group of assembled men blowing them to fragments and thus giving rise to the rumours of chopped up bodies being here. A freak of explosion had thrown one corpse into one of the boilers. Passed several dead rotting frightful bodies (German) but so callous are we now that death has no horrors in its appearance for us. During the afternoon a heavy barrage was opened on Joncourt and intensified to something quite out of the ordinary. It was a hail of shells their white bursts presenting a fine sight viewed from our height. It was the 5 Division doing an attack and the Hun putting down a retaliatory barrage for it. Just about ¾ hour before dark B.M. McCall rang up to say that\n\n \n\n1\/10\/18 Bellicourt\n\nwe must move off again to a place near Nauroy. This was particularly annoying as the boys had gone to a lot of pains to dig their bivouacs but they did not growl and just carried on splendidly. It was getting dark and the ground was all new to us. It was covered with obstacles – barbed wire, the Hindenburg Line and a great Canal and was devoid of landmarks. There followed a demonstration of just what the trained man can do with a compass at night. H Smith took a bearing on a copse called Billiard Copse which we could see 3 miles away and we marched on this bearing in the dark and ended up exactly at the copse. Here we were well bombed by enemy ‘planes and searchlights were very fine but no casualties resulted. Our guides had very little time to do\n\n \n\n1\/10\/18 Bellicourt\n\nmuch and the companies were led to so many yards of muddy trench and that is where the chaps had to sleep. So they all dug little places and could lie down. Old Tom Burrage came up with his transport later and before the night is out we hope to have the boys blankets up. My H.Q. is quite a wonderful place deep down concreted and has a trapdoor connecting it with further chambers of concrete below. A fear that perhaps it is mined assails me!! The men’s blankets came up about 11 p.m. and saved them from having a wretchedly cold night although it was bad enough. We had a quiet night except for a few stray shells. On our direct right the cathedral at St Quentin can be seen though the rest of the city is hidden by the hills. Great rumours of Lille falling etc.\n\n \n","36":" Nauroy\n\nA fine day. Cavalry advancing were seen by German aeroplanes who called artillery on to them and caused a grand scatter. A look in daylight round these strong positions makes one marvel how the Hun ever was got out of them. Waning morale is the only explanation I can advance. Great landscape views from here – miles of rolling downs , ruined villages and the Canal du Nord running by all. Went to Bde H.Q. to a Conference at 1530 and there met the General & other battalion commanders. We went into plans for the attack tomorrow morning. The","37":" Bde (right) & 7th Bde (left) are doing it. Zero 6.5 am. We shall probably take over the front line the same night. 21 & 22 in front. Hun bombed round here later but our a.a. work in the drizzly rain did no good. Bed 9.30.\n\n \n","38":" Nauroy\n\nA fine day. The 5th & 7th Bdes attacked this morning on a front of 6000’. The prisoners came past fairly early and stray wounded ones also continued to drift past for some time. Took H. Smith and went forward to the ridge between Joncourt & Estrees to have a look round. A splendid birdseye view from here. Down in a hollow the pretty little village of Niancourt was burning. In front was the village of Beaurevoir with our barrage on it and the troops just entering it. Between Beaurevoir & Pont Choux was a road along which transport was getting away to the rear at the gallop – there seemed to be gun teams pulling out. Smoke and shell bursts spoilt a pretty landscape. Hun planes active and plenty of balloons up – one was burnt down by our planes. Artillery retaliation slight. At Noon ordered to move up &\n\n \n","39":" Waincourt (Wiancourt)\n\nreplace the 23rd Bn who had moved on ahead. We had not been here long when General Martin rang up and gave me preliminary orders for a stunt – we are to pass through the 5th Bde and carry further objectives. At once hurriedly summoned \nfour\n 3 company commanders and issued warning orders. Braithwaite Greene & Patterson were the officers concerned. We marched on the map and massed in trenches East of Estrees. I went on ahead and got into the trench but was very nearly sent aloft by one of our 18 pounders shooting short. Many Huns lying dead in the trench with dreadful wounds. The Battalion now filed into its J.O.T. positions but was spotted by Hun planes which called down artillery fire on us. I was summoned to 19th Bn HQ to speak over the phone to General\n\n \n\n3\/10\/18 Wiancourt\n\nMartin. I returned to the J.O.T. at 6.23. The attack was to start at 6.30. Anderson & Sutherland rushed round to the companies and the boys (white and nervous some of them) went out over the top. We could see the 23rd on right & 24th on left. All the dead Huns were dragged away from our dugout entrance and we established H.Q. Our communications were rotten. At last word came through and things turned out to be alright. We captured 100 prisoners 2 .77 guns and a 5.9 howitzer. Casualties light but Patterson was killed and I fear Braithwaite too. McAlpine D Co old character also died. We got a young aspirant officer as prisoner. He could speak a little English and some French and seemed a good chap. He could talk and told us a lot of interesting things. He said the \n\n \n\n3\/10\/18 Wiancourt\n\n\"War is lost\" but fiercely resented our laughing at the matter. He said the morale of his men is no good. Other prisoners also kept arriving. I now received orders to again attack at dawn and drew up & issued orders. This meant going up personally into our newly captured ground and seeing Greene & Proudfoot to whom I personally issued orders. Returned then to Bn H.Q. getting a few shells round our ears. Ordered the RAP up to a Copse now about our front line and sent up Anderson to make a report centre there. We had a long wait before rations turned up and found that Burrage had been wounded in the leg and sent away. Settled down to arranging details and was very busy over the telephone for quite a time. At 6 a.m. the barrage opened and is to continue for half an hour. It seems a good one.\n\n \n","40":" Beaurevoir\n\nThe attack in the main was a success as we got to within 200 yards of our objective but during the morning our casualty list grew and grew. In all about 20 odd prisoners passed through us going rearwards. Joe Greene has had a very rough time & men returning from him say all there are wiped out. Dawsett is dead and Billy Braithwaite has also run his race. About 60 wounded and others lying around. Our forward telephone lines were cut again and again and at last I decided to go up myself and find out how things were. Found K. Anderson and his men with our Dr. and R.A.P. on top of a crest and had a very rough passage getting up to the place. A few wounded were lying here – Splatt the driver was badly hit through the body. The place was littered with Hun dead. I have never before seen such ghastly\n\n \n\n4\/10\/18 Beaurevoir\n\nhead wounds as these poor chaps have. One sees the whole of the headcase stripped off and brains and so on inside. One German killed by our boys yesterday afternoon lay on his back with one hand uplifted as if to ward a blow off. The 77 guns & the 5.9 we captured are still lying in their emplacements. Returned to BnH.Q. over heavily barraged area and rang up the General telling him how the situation stands. All our trouble comes from Pont Choux which the Tommies find too hard a nut for them. Just after lunch Colonel James was over and we noticed men coming in waves into Beaurevoir about 1700 yards away. It turned out later that they were Huns! The rest of the day was quiet. Got some sleep. Matthews returned. We were bombed. Things seem good up forward. The 21st & 24th attack at 6 in the morning. \n\n \n\n5\/10\/18 Beaurevoir\n\nThe Tommies on our left hopped over at dawn and do not appear to have done very much good as far as I can judge. Our flank in the front line is still well up in the air. The 21st and 24th on the right seem to have done alright in their go for Montbrehain and over 100 prisoners have passed through en route for the rear. In Beaurevoir there has been a great deal of bombing and hand to hand fighting and our forward people can see combats in the village square. We have had a few wounded people passing here. The weather has been extraordinarily good & today is fine and sunny. We received orders that the Battalion is to be relieved by Americans tonight and we concentrate near Nauroy. Towards evening the advance party of the Americans arrived and proved to be in a hopelessly mixed up state. They had been rushed up on busses and thought that they were\n\n \n\n5\/10\/18 Beaurevoir\n\ngoing to billets. They had neither telephones or Lewis guns and were much upset by the sudden orders. Their old Colonel of the Regiment was a fine old chap. All of them seemed at sea. We got to work with plenty of effort and they took over alright but after a tremendous amount of trouble. Left 1 N.C.O per Coy, 3 signallers, 16 Lewis guns, 3 ‘phones & Major Matthews to tide them over their troubles. Their coys. were 225 strong and the whole area was crowded with men. At 6pm under a heavy barrage the Tommies attacked Montbrehain and their assaulting waves looked very well as they crossed the open. Relief was not complete until 3.30 a.m. As we came through Estrees on our return journey we were shelled. Ended up before dawn in cold dugouts near Billiard Wood.\n\n \n\n6\/10\/18 \nBeaurevoir\n Nauroy\n\nOur time was today put back an hour. A raw day and dull. Marched to trenches and bivouacs near Hervilly. Just near the Canal passed a terribly congested waterpoint with a thousand horses at least. We marched over deserted country for miles and ended up at L22 where were dugouts & shelters. At 5 pm rode to Hesbecourt Church where all the CO.s of the Division were assembled and met General Rosenthal who told us G.H.Q said there was talk of Germany & Austria wanting an armistice. He also discussed the matter of the 21st disbanding and ordered that it be proceeded with at once. Returned to BnH.Q. and held a conference of O.C.s discussing the recent battles that we took part in. All were tired out and glad to turn in.\n\n \n","41":" Villeret\n\nAwakened at 6.30 with orders which involved the Battalion moving at 7.30. Great rush and scurry and at last we started off half an hour late for which I told off Anderson. The Keithlet has a poisoned foot and is much handicapped. I miss the capable and willing little chap. Routemarched via Hesbecourt to Roisel where our cookers gave us a drink of tea before marching to the station. The 6th Field Ambulance came in here and I asked their officers to have a cup with us. Then proceeded to the Railway Station where there was great troop concentration and got about the familiar French trucks \"Hommes 30-35 Chevaux en long 8\". Our journey was all through the reconquered ground and took us to Peronne – a fine town laid waste. We also went through Chaulnes all the time\n\n \n\n7\/10\/18 Villeret\n\npassing trenches and strongposts and positions ravaged by War. Came back through Villers Brettoneux and passed all the woods and trenches so familiar to us. Pulled into St Roch station and marched off down the boulevards with band playing. A group of Frenchmen gave us a great ovation. It was impossible to help feeling a thrill of pride while marching through the town Australian men had saved. A long route march in the dark brought us via Ailly-sur-Somme to the poor village of St. Vast. (En route today we passed an enormous N.S.W gun & train and also a most luxurious camouflaged train of an Army Commander). All were tired out on reaching St Vast and soon tumbled into billets. At night the tramp of troops resounded through the village. Our transport delayed on another train meant there was no food or no blankets here.\n\n \n","42":" St. Vast \n\nOur transport has not yet turned up owing to a railway smash but was reported at Vignacourt at 10 a.m. so ought not to be long coming across. An old Frenchman the owner of the house where I am lodged woke me up this morning to present a cup of hot coffee. Charlesworth managed to get a dish of omellette and tea for me later. Dull rainy and wretched today. Our Transport turned up just before lunch. All the afternoon I was busy on Report on Operations & on Honours & Rewards. We messed in the house of a pretty little widow. I inspected some of the billets (they are not bad) and yarned with all the old wives round the village. Today \n\n \n","43":" St. Vast \n\nSpent nearly all day at work on my report on operations and Honors & Awards. The Battalion paraded under Kennedy on some ground just outside the village. The village church was busy with white robed little girls having their first communions. \n","44":"\n\nAnother hellish busy day on recommendations and honours. Rather drizzly and cold. Spent most of it indoors and did not have the troops doing much work. Jack came in for dinner and afterwards the little mademoiselle at the billet played some pieces on the pianoforte. We then adjourned to my billet where I nursed the little girl and Madame prepared a cup of coffee for us. Drinking this coffee slashed with rum is some ceremony \"A la votre\" \"Bon Sante\" etc. The little girl is named Yvette.\n\n \n","45":" St. Vast \n\nDrizzly morning. Rode to Yzeux going via La Chaussee and Belloy – a pleasant ride through the most delightful country. Down towards the Somme it gets absolutely lovely soft shades of green, pleasant villages and lovely trees. France is indeed a lovely country. The 21 & 24th are camped in the same village. Found Bde H.Q. in a Chateau of Yzeux – a pleasant place with lovely grounds. Much enjoyed a walk through the avenues with leafy trees meeting overhead all full of the most lovely tints of autumn. Dined with the General and then discussed affairs of state with him. Rode back by a circuitous route and went to a football match. After mess had a yarn to Speechly and then Matthews came in with stories of his American doings.\n\n \n","46":" St. Vast \n\nDull and misty. A great improvement in the appearance of the men today though our Battalion with its 3 companies is very small in size. They did ordinary work on the parade ground. I inspected the Transport Lines and found the horses rather pinched by the cold and right out in the open. There is a good amount of drunkenness going on. Why our fellows should be so vicious in this regard I don’t know. Perhaps too much money is the cause but I know that the wineshop keepers are making fortunes. Sports in the afternoon. A dull grey afternoon. Very pretty undulating gentle country round here with little woods all round. In the distance the Vignacourt church stands out bold and high. Yarned with Madame & Mademoiselle round at the mess. They freely discuss quite forbidden topics. \n\n \n","47":" St. Vast\n\nLet Matthews take church parade while I remained in. after lunch rode to Flessells a lovely ride. The country round here exquisitely green. No, Australia can produce nothing to equal France in autumn! But winter -- ??! Passed the old Chateau – the Marquis is in Midi. Rode up to Rue du Chateau and the door was opened by Georgette now 17 and a changed kid. Not a bad looking little mademoiselle\n\n \n","48":" St. Vast \n\nThe Battalion formed up for inspection in the morning and looked pitifully small with its 269 men on parade. We only have a ration strength of 450. I then made an inspection of the billets and find the men not badly placed. After lunch I rode to Amiens. The old Cathedral stands out and is visible over the plains for many miles. Rode into the city any amount of damage being apparent. Many civilians have now returned and are in the shops and houses. Got into the Place Gambetta and put the horse up at the Hotel de la Paix. Went first to the Cathedral which has had a charmed life against bombardments of all kinds as the surrounding houses all show signs of damage and destruction. Some of the windows have been destroyed but from many\n\n \n\n14\/10\/18 St Vast – Amiens\n\nthe glass has been removed. The front is quite intact although a few chips are off the stonework here and there. Entering there are many alterations much more sandbagging. The old bronze recumbent statues, the pictures many of the windows have been removed. L’Ange pleurant was left and looked cold & lonely. Around the town many French people returned but still the damage and desolation (after the Amiens of old days) are terrible. Rode home in time for mess. Pleasant riding through sweetsmelling country\n\n \n","49":" St. Vast \n\nUp early. Said Au Revoir to little Yvette, reminded Madame of the 22\/10 and rode off with Colonel McKenzie and Major Beath. A dull damp morning as we galloped along slushy roads and over stubble fields towards St Ouen. A few farmers ploughing in the fields and some peasant women at work. They age quickly the girls here and early look haggish – yet powdered and painted these are the incomparable houris of Paris. The road got very slushy as we approached the Foret de Vignacourt which is extensive and beautiful full of the most gorgeous autumn tints – the leaves just beginning to fall but there is no indication of the bleak and bare months yet to come. The road now crossed over open ground from which we could look back and feast the eye on the full extent of\n\n \n","50":" St. Vast – St. Ouen\n\nthe forest. An open road now led us down in St. Ouen which is an unattractive village chiefly noted for a jute factory. At the Mairie here we met General Wisdom and others to sit on a G.C.M. Col. Ralph AAG 5 Div. was there as a witness and catching a boat for England almost at once. We tried and dismissed Granter on a charge of Drunk and then heard a charge of cowardice which we adjourned to allow witnesses to attend. Went down to Wisdom’s H.Q. to have a spot. The 21st had an affray with some A.W.Ls who were in subterranean passages near the old Roman Camp opposite Ailly sur Somme and collected a few of them. Rode back round Foret de V. hitting the main Flixecourt road and arriving at Yzeux in time for lunch. Took over command of the\n\n \n\n16\/10\/18 Yzeux\n\nBrigade from General Robertson who goes to Division. We are here in a fine Chateau. McColl B.M. Selleck S.C. Milligan Hislop & Jackson Mayer interpreter. The grounds full of lovely trees. After tea walked down to Bourlon getting on to high ground overlooking the Somme basin across on to the Picquigny side. Quiet and peaceful twilight here – no gun roar or flash. Had a good dinner with the Brigade Staff and sat yarning after it. Then went out for a while into the cold night air. Spent the rest of the evening writing a story for the \"Echo\" and signing a few papers. A case today of a Sergt M.M. receives a letter from his wife in Australia saying she has a youngster not his. Rather a knock for a chap fighting 3 years over here. \n\n \n\n17\/10\/18 Yzeux\n\nDid nothing except write and wander round the village all the morning and round the grounds of the Chateau. Trees – these are the beauty of this land. Acre for acre it is many times more densely wooded than home. Duggan came in for a yarn. After lunch I rode down to Bourdon to the 6th Field Ambulance and there had a tooth stopped by the dentist. While waiting drifted into a yarn with three Billjims there and much enjoyed their views of things. After leaving here rode on to Flixecourt passing many German prisoners at work on the roads and making a railway. The view coming into Flixecourt at this season could not well be bettered. The town is almost surrounded by dense woods and perched up on a height, embowered in green is a fine Chateau of red stone most beautifully placed. There are some\n\n \n","51":" Yzeux\n\njute factories here but they are hidden from view down in a hollow. Passed only through the outskirts of the town and came on to the main road again. Gangs of Chinese working along here. Leaves falling from the trees. In one place there is as fine a half mile of autumn leaves as could be seen in a day’s march. Returned to Chateau – this is indeed an existence of luxury! Dressed for dinner and then took a turn round the grounds. In Yzeux someone old died today and much tolling of bells took place. The Cure is aged and sporty with a nose convivial in looks. He lives beside the old church. At the rear is an old churchyard. These old villages are very picturesque but terribly damp and unhealthy – no wonder so many people are doubled with rheumatics.\n\n \n","52":" Yzeux\n\nFirst thing Colonel Durrant AA & Q.M.G called with a car and we motored round the whole Brigade area. A fine morning it was very exhilarating speeding along the good roads. Saw Duggan and others in La Chaussee where the good news of Lille’s fall took second place to public amusement over a baby born to Madame whose husband was at Salonica. Much speculation as to whether it was English Irish Scotch or Australian. Had a yarn with Matthews at","53":" and old Mackenzie and others at the 23rd. Called in at D.H.Q on our way back to Bde. and saw Col. Miles G.S.O.1 there. After lunch went off on a long walk all over the country in among woods and hills – a very pleasant day indeed.\n\n \n\n19\/10\/18 Yzeux\n\nA rather dull day. Remained indoors all the morning having a fine boil on the right cheek. Did not go out until afternoon. Rambled about until twilight. Spent the evening indoors.\n","54":"\n","55":" and wet. Remained abed all day. Dog’s disease rather rife among the troops again.\n","56":"\n\nStayed in bed. Visit from Genl.Robertson.\n\nStill in bed. Winter coming on fast and the air full of falling leaves. Today at 3 pm I was to have kept a rendezvous at Villers Bocage but it must wait until later. Things very quiet in the Brigade and no news of interest to chronicle. Very little sun these days and a lot of gloomy weather.\n","57":"\n\nStayed in bed. Visit from General. A Lena Ashwell Concert Party to afternoon tea. \n\n \n","58":" Yzeux\n\nGot up today. It was fine with gleams of a weak sun. The ground now covered with fallen leaves and a good heavy wind would clear the trees. Rumours that 4th Division are to move up again soon and stories of a big Yank concentration towards Meuse. Remained in room all day and except for a visit from Matthews nothing of interest. \n","59":"\n\nThe General called round at about 10 with his car – a closed and neat car-de-luxe with its red pennon flying. The morning was dull and foggy. First visited the T.M. Battery and the G. inspected them rousing hard and kicking up the devil’s delight. Several people very very upset and hurt by his caustic remarks and I don’t doubt there will be an immediate and continuing improvement there. On re-entering the car the G. sat back and laughed and we both laughed\n\n \n\n25\/10\/ Yzeux\n\nat what had passed. That is how we run the Army! Through Belloy over to St. Vast and saw Beith and the 23rd. A fine stubble field here for parading. Down in a hollow is a bayonet course and room for L.G. and miniature ranges. We then returned to Yzeux. After lunch I went for a walk and did a ramble through pretty woods full of falling leaves and fast assuming winter looks. Inclined to rain. After dinner met Muirhead and others from 6 Field Ambulance and went into Belloy to see a full dress rehearsal of the Dinkum Diamonds the Divisional Concert Party. It was not a bad show but there was a good deal of stiffness to start off with as some of the performers were nervous. The doctors are rather worried about the epidemic of influenza and are \"windy\" about it.\n\n \n","60":" Yzeux\n\nA rather dull and foggy morning. Went first of all to Yzeux where I saw the P.M.s and then round back again to the Chateau. All villages here cluster in the hollows on account of the climate. To horse intended to go down to Lachaussee and see James & Duggan but en route I met the latter heading the Battalion with drums and band. Rode along with him yarning. Came back to the Chateau being bored stiff on the job. The crowd of officers on Bde. H.Q. makes for a lot of loafing out of the line. About 2pm set off on a long solitary ramble into and among the many woods there are here. Very beautiful they are. Singing gangs of Chinese coolies were cutting all the timber and carting logs. A pleasant job I should say this forestry. Dined at 7 p.m. Selleck acting S.C. is a dear capable little chap and has plenty of confidence. We are sending 23 Bn into Flesselles.\n\n \n","61":" Yzeux\n\nChurch parade at 9.30 just at the Chateau door. Cold. Puerile sermon. Afterwards went for a walk over near a Chinese Labour Corps camp and noticed a distinct smell of Little Bourke St – an odour pure Chinese. After lunch Durrant called re the move of 23 to Arqewes & St. Saveur. Selleck McColl and he then went off in the car to look into it. Walked down through Belloy to the 24th and had afternoon tea with them. Then James walked back nearly to Yzeux with me talking. It was quite dark and the French people were gathered in groups standing and gossiping. Spent the evening sitting quietly in the front of a large coal fire and taking things easy.\n","62":"\n\nUp early and to horse. With McColl, Selleck, Mayer rode over to St. Vast and pulled up at my billet there where I saw\n\n \n\n28\/10\/18 Yzeux\n\nIt was nearly dark when I set out on the return journey to Yzeux and it took about 40 minutes to cover the distance. From the fields tired peasants were returning – many women among them. In one place the farmer was still ploughing although darkness was well fallen. The evening was mild and pleasant and sweet odours coming out of the ground. At mess Selleck and Mayer were still absent over at Flesselles where they are finally billeting the 23rd Bn in among Divisional Trans and other units. For this Chateau the Army is paying 600 fr. (£ 25) per month which is gross extortion and waste of public money. It is often not used by troops at all.\n\n \n\n29\/10\/18 Yzeux\n\nI went over to St Vast first thing and would have enjoyed the ride had the horse been anything like decent at all. The air was splendid and the country looking lovely. Saw Matthews and remained here the whole morning. The 23rd moved to Flesselles. Lunched at the 22nd and rode back to Yzeux. Saw James who was very enraged about some lousy shirts from Divisional Baths. The 23rd rang up much enraged about their move and painting a doleful picture so I got a car from DHQ and we ripped over through the darkness after mess – the BM, Mayer, & self. The driver let her go. Found Beith in a bad temper at Col Crowthers HQ and eventually ordered the Battalion to move on to better billets at Vaux tomorrow. I have said nasty things to a lot of messers over this. After several words with\n\n \n","63":" Yzeux\n\nCrowther we again got in the car and soon covered the ground back to Bde. Called at D.H.Q and saw the General who was playing bridge. Evidently the people here are something of hunters as antlers brushes and hunting horns adorned the hall entrance. Had another wad here – it was just as well that there were not many more places to call at. A fine frosty night but pretty dark as the car dumped us down at the Chateau again. Today Selleck went into Abbeville and I was annoyed.\n","64":"\n\nAnother perfect day. The air was full of falling leaves as there was a slight breeze. The ground covered with a rustling carpet. Put in the morning going round the Brigade Signal School and the French Mortar Battery. Afternoon a good football match with Bde.\n\n"}}