{"Document Name":{"0":"Diary_0495","1":"Diary_0495","2":"Diary_0495","3":"Diary_0495","4":"Diary_0495","5":"Diary_0495","6":"Diary_0495","7":"Diary_0495","8":"Diary_0495","9":"Diary_0495","10":"Diary_0495","11":"Diary_0495","12":"Diary_0495","13":"Diary_0495","14":"Diary_0495","15":"Diary_0495","16":"Diary_0495","17":"Diary_0495","18":"Diary_0495","19":"Diary_0495","20":"Diary_0495","21":"Diary_0495","22":"Diary_0495","23":"Diary_0495","24":"Diary_0495","25":"Diary_0495","26":"Diary_0495","27":"Diary_0495","28":"Diary_0495","29":"Diary_0495","30":"Diary_0495","31":"Diary_0495","32":"Diary_0495","33":"Diary_0495","34":"Diary_0495"},"Date":{"0":"unknown","1":1572.0,"2":1573.0,"3":1574.0,"4":1575.0,"5":1576.0,"6":1577.0,"7":1578.0,"8":1579.0,"9":1580.0,"10":1581.0,"11":1582.0,"12":1583.0,"13":1584.0,"14":1585.0,"15":1586.0,"16":1587.0,"17":1588.0,"18":1589.0,"19":1590.0,"20":1591.0,"21":1592.0,"22":1593.0,"23":1594.0,"24":1595.0,"25":1596.0,"26":1597.0,"27":1598.0,"28":1599.0,"29":1600.0,"30":1601.0,"31":1602.0,"32":1603.0,"33":1604.0,"34":1605.0},"Entry":{"0":"\n\n","1":" - Red Lodge\n\nWent down to Bde. H.Q. about 11 a.m. and saw the G. who was on his way to D.H.Q. where General Plumer was presiding at a Conference. The day was warm and close. Had a little council of war at the Catacombs and arranged rather stronger standing and listening patrols than usual in order to cover our relief tonight better. The capture of a few men of 21st might mean that the Hun can get some information from them regarding our movements. After lunch most of the rear coy. men were taken out of their dugouts and spent the afternoon sitting down in the sun.\n\n23\/3\/18 - Red Lodge\n\nHad a yarn with some of our officers and Gorman was amusing with his starting of discussions re \"Whether there is a Future State\" and \"Whether the War has made us Better or Worse\". News through that the Hun has reached Vaux and elsewhere claiming 16000 prisoners and 200 guns. Fighting is apparently very heavy. All leave has now been stopped and our leave parties at the Base ports will all be sent back which is rather a \"crash\" for them. Tonight the 5th Bde. is going in on our left and the 24th is doing nucleus garrisons behind the 23rd Battalion. At 7 p.m. moved\n\n23\/3\/18 – La Basse Ville\n\nup to the line and relieved Col. Duggan. His people would be glad to get out tonight as they are tired out. The body of one of his men has been found out in No Mans Land where the Hun raiders must have left him. His throat was cut. Kennedy who is in reserve called in and got his orders for action in case of attack. Minnenwerfers were again worrying us last night and we seem to be unable to cope with their demoralizing work owing to our inferior trench artillery. Had a quiet night but very restless. Rats in plenty.\n","2":" – La Basse Ville\n\nAn officer of a special Gas company called in early. An enthusiastic youth whose preparation caused recipients to vomit and so pull off their masks thus getting their lungs full of poison. A fine day but a thick haze is hanging about. Went up to the O.P. \nof\n & from there got a good view of the country as far as the haze permitted. The village of Warneton looks like Warlencourt used to when viewed from Gallwitz Tr. . A number of 5.9’s were being chucked into La Basse Ville and sending up big columns of dirt and debris. Had a talk to a Tommy sound ranging\n\n24\/3\/18 – La Basse Ville\n\nofficer and returned to Bn. H.Q. Remained indoors all the afternoon writing and reading. Left at 8 p.m. for my tour of the line. A beautiful mild moonlight night with much hum of aircraft overhead. From his trenches the enemy was releasing peculiar little lights that ran up in strings ( so) irregularly spaced. Perhaps for guidance to his aircraft. Our planes were over and bombed his positions just across the Lys. Went first to Mackinnon and then to Braithwaite with whom we (self and Keith Sutherland) went out to the post. Found No. 9 and walked straight out there\n\n24\/3\/18 – La Basse Ville\n\nwithout hindrance or being fired on. Things were extraordinarily quiet and one could see a long way in the moonlight. The Germans were out wiring and we could plainly hear them talking and coughing. Rang through to the artillery & presently bang: crash: flash and smoke as shells landed right in among them. During the afternoon one of our shells was seen to send up duckboards &c. and after cries some stretcher bearing Huns came. A very quiet trip round the other posts. On the right our people saw the Hun come out to his posts and\n\n24\/3\/18 – La Basse Ville\n\nour posts fired on him. We had wiring parties out putting over concertina barbed wire. Saw Major Dooley who this morning got a crack under the eye with a piece of shell but the skin was not broken. Rested a while in a listening post well down near the river bank. The Lys shining in moonlight like a a silver ribbon. On the other side the sounds of German transport could be heard – wheels and voices. A little railway train puffed along the top of the rise in the moonlight. Saw Rodda who was inclined to\n\n24\/3\/18 – La Basse Ville\n\nbe a bit \"windy\" on account of imagined shortage of men. Went out to the two right posts and hurried back because at midnight our Stokes opened up and put 50 rounds over on to the Spinney. The men tonight were in good heart. A quiet and uneventful walk back to Bn. H.Q. along a tortuous and winding C.T. We passed one or two ration parties and the sentries of Vickers Guns standing near their emplacements. Up in the moon was the drone of heavy aeroplane engines and from his trenches climbing .\n","3":" – La Basse Ville\n\nAnother clear day. There was a clearing wind that made visibility really remarkable. After lunch went up to the different O.P.s and got a grand panoramic view. Behind the stricken ruins of Warneton rise the church towers of Comines. Bulbous Flemish looking towers. Nearer were pleasant and comfortable looking houses. An estaminet at a cross roads looking snug and hedge surrounded just like so many behind our own trenches. Further right were snug farmhouses hedge surrounded and, in the distance, a factory sending out dense volumes of smoke. The\n\n25\/3\/18 – La Basse Ville\n\nO.P.’s command a splendid view and our observers tell us of many Huns seen, some with maps and glasses, on the sector to our left. Returned to Bn. H.Q. and word came through from Bde. that the S.O.S. had come through on wireless. Great excitement. All our cooks, batmen and direlicts stood to arms and as no attack developed we concluded that our wireless had caught a message errant from down South. The G. found two of my men drunk in a sap today owing to some officer’s carelessness of supervision re issue of rum.\n","4":" – La Basse Ville\n\nRather late before getting up. An officer of the M.G.M.’s came in and reported himself and I gave him a very rough telling off that quite upset him and will lead most likely to his Battery taking a more active part in operations in the future. The B.M. called in with Coglan of the Engineers. Our patrol last night found a demolition charge evidently carried by the Hun raiders the other night. It was covered with blood. We had 2 men wounded slightly last night. The enemy is wonderfully quiet in front of us and has evidently thinned his front system very much.\n\n26\/3\/18 – La Basse Ville\n\nPreliminary warning orders received for our move down South. Our dump is to be at Merris and Stewart will go down tomorrow to overhaul our gear. Our specialists to the number of 108 are all detailed and ready to go to the Details Camp. They come out of the line tonight. About 4 p.m. our guns shelled the Spinning Mill and got on to a splendid cluster of Huns. About 150 were seen scattering but our shrapnel was just about 100 y. short which was rather unfortunate. Our liaison artillery officer put\n\n26\/3\/18 – La Basse Ville\n\nin some good work. Owing to reduced numbers had to juggle with the men on our forward positions and rearrange dispositions. Went up about 10 p.m. to the different company headquarters. An exquisite cloudless bright moonlight night. Behind the Hun line was a bright revolving light evidently a guide for the aeroplanes that were humming overhead. His trailer lights were also being sent up from the front line. Called in first at Mackinnon’s headquarters and then went along to \"C\" Coy seeing Barney Horan, T. Carter and \n\n26\/3\/18 – La Basse Ville\n\nothers. Except for a few m.g. bullets the walk round to \"A\" Coy was uneventful. Arrived there saw Dooley. A stunt now commenced on the left and there was a stiff enough barrage with much flare illumination. We returned via the sap and the shelling and m.g’s were pretty solid. Had a very rough passage along this trench. Shells blew it in about 6 times just in front and behind us and we tore over the duckboards as if the devil was after us. Called at \"C\" Coy and then as things had quietened slowly back to H.Q.\n","5":" – La Basse Ville\n\nAbout 1 a.m. Braithwaite rang up to say that Gorman was wounded and sure enough the fighting Pat soon came in with a white face, a useless arm and blood all over his face and tunic. He joined our standing patrol and they worked close up to an enemy post on the railway line. There were plenty of Huns moving round and our chaps got well on to them with sniping. Their post is at the foot of a sign post. A couple of hedges were running alongside the railway and presently Sgt. Fraser yelled \"Look out\" and, in the words of the poet, the \"box on\"\n\n27\/3\/18 – La Basse Ville\n\nstarted. About 15 Huns were trying to cut off our chaps. Gorman got a slight crack but continued on and emptied his revolver. Barker did the same and bombs and shots were flying about. Our No. 9 post hopped out and reinforced the patrol and our Lewis gun champion Binns, put three magazines right into the Boche. His barrage had come down and withdrawal took place. One man had not hopped out with the others and when they returned he was found dead with a shell wound in the head. Later on in the\n\n27\/3\/18 – La Basse Ville\n\nnight a stray minnenwerfer came over on to No. 7 post and killed Parsons. Blew one leg right off and also the other foot. Decorated with M.M. & Croix de Guerre this good lad was one of the best and a good cool young subaltern is gone. Slept until mid-day. About 2 p.m. walked across to James’ H.Q. and had a yarn with him. Sellick ticked off the British Line down South in accordance with the latest messages. Hun now holds a line about where it was when we hopped off in July 1916. The which is rotten for our morale.\n\n27\/3\/18 – La Basse Ville\n\nThe cross country between James and my H.Q. runs along the old No Mans Land that existed before the Battle of Messines. It is now very free from shell holes and scattered across it are a fair number of vegetable plots. A broad guage peace railway line runs across here and there are remnants of flower and other gardens to be seen. Returning to my dugout I met General Birdwood and his son Chris, General Paton & old Chirnside. Yarned for a while & then walked up and showed them Ultimo Crater – one of the great \n\n27\/3\/18 – La Basse Ville\n\nmine craters of the Messines show. General Birdwood pointed out Warneton & other places to \"Chris\". Talked with him about the War and he was very pessimistic and not half as cheerful as we are here, sleepless & lousy. As one dirty old Billjim said, \"We’ve stopped Fritz before we’ll stop him again!\" Darky Johnson asked him if there was any truth in the rumour that we were being relieved here by the W.A.A.Cs. There is a furphy that 300 W.A.A.Cs were taken prisoner at Bapaume. Also that an Irish division is going to relieve us here.\n\n27\/3\/18 – La Basse Ville\n\nWent up the line after dark & saw all the O.C. Coys. There was an inter Company relief on which was carried out quietly and without incident. At 10.30 we put gas over on him, up went his red lights and we had a rough passage to \"C\" Coy. Little Scotty O’Neill one of my old original boys was found dead in a dugout this morning killed by shell last night. Poor Parsons died very bravely this morning. Realising both his legs were off he asked for a revolver to shoot himself but presently he had less pain. Carricks held him in his arms and he said \"It is hard, Larry, but I’m not afraid to die\". He passed out a couple of hours later his last words being apologies to the stretcher bearers for giving them so much work.\n","6":" – La Basse Ville\n\nA quiet day. Slept until well after noon and then read and wrote. The Boche shelled H.Q. and the Ultimo Sap blowing the latter in about 4 times. After dark it commenced to rain and I made off up the line with little K. Sutherland in tow. First called at Braithwaite’s H.Q. and waited there while a bombardment took place on our right and the Tommies raided them. Then walked out to No. 9 post with that lurid languaged gentleman Pte. J.C. D.C.M., slaughterman in civil life and waster out of the\n\n28\/3\/18 – La Basse Ville\n\nline. Some runner. Cursing sliding and falling in the mud we reached No. 9 post dug in between the sleepers of a railway & esconsced in an ruined railway truck. We had a patrol out in front. On the left is a fair sized lagoon. Minnies were hurtling over sending up clouds of mud & water. Visited all the posts & found all the men uniformly cheerful and happy. On the right they told me \"’es only gotter grey whiskered old bloke here who rides up and down firing off flares\". A few flicks of m.g. fire. Did not reach H.Q. until 2 a.m.\n","7":" – La Basse Ville\n\nA quiet day. The B.M. came in for a private conversation and got some plain home truths and a little good advice. Later went to Bde. H.Q. and there met James, Duggan, Braeznor and the General. The latter had just returned from a Conference presided over by General Plumer and consequently we heard much of interest including the order of battle of the Hun as well as our own. Went up the line. It was pitch dark and wet and had two little Company conferences passing on all I had picked up there. Everyone up the line is in the highest spirits\n\ndespite news far from cheerful. It is indeed remarkable. It was a quiet night on the front and we tried to get a Hun dead or alive but did not succeed. Very dark at first it became lighter later on and movement was difficult. Our patrols went out into No Mans Land and there is an old aeroplane there. Lt. (Digger) Barker hopped up into it for a seat. Six fine dead Huns are lying out in front the result of a raid. Some of them were carrying little pick-axes in lieu of knobkerries. Returned back to Bn. H.Q. at about 2 a.m. and turned in feeling very tired.\n","8":" – La Basse Ville\n\nA dull and wet day today – the league of Gott & the Hun once more. The first issue of the \"22nds Salvo\" put in its appearance today. Before lunch Colonel Miles, C.M.G., D.S.O. called with the B.M. for a yarn. Sent a few fresh officers up the line to relieve others. Afternoon Jack came along and we spent the time talking about family affairs. A gas stunt is projected for tonight and all the orders are being made out now. Rain came on at dusk and made conditions miserable. All the trenches wet and slippery. He was shelling more than usual\n\n30\/3\/18 – La Basse Ville\n\nbefore dusk. At 7.30 went up the line and walked round to La Basse Ville where I saw my two firing line O.Cs and Major Dooley having a yarn. The place was all dripping and wet. The Billjims standing to arms were all encased in ground sheets and all fairly cheerful. Some of them were not wearing their water-proofs because out on patrol or on wiring party they glisten. A shrewd old bird is our Billjim. Back to Bn. H.Q. calling first at the R.A.P. The night was most devilishly dark and we kept tumbling all over the shop.\n","9":" – La Basse Ville\n\nWas called at 1 a.m. and ascended the dugout stairs and mounted on the parapet alongside the gas sentry. With dull explosions our gas bombardment went over with projectors and gas Stokes mortars. They burst well into Warneton. There was silence was a few minutes and then up went all kinds of flares & lights, Serpents, clusters, twin lights red and green and other flares mostly white. A heavy white dense cloud drifted back over the enemy lines on the breeze. In response to his calls for artillery fire a fair number of\n\n31\/3\/18 – La Basse Ville\n\nshells came over on us and a constant and growing rattle of m.g. fire commenced. Our telephonic communications held throughout. His fireworks were very pretty. A thoroughly clean, correct, neat, well groomed officer of an English Engineer Coy. stayed with me. This gas is deadly. As soon as we estimate that his stretcher bearers are busy removing his gassed and wounded men, our m.g’s and artillery open on all his roads and tracks so as to hinder the humane work. This is civilised warfare! Things quietened by 1.50 a.m.\n\n31\/3\/18 – La Basse Ville\n\nSlept on until about 9 a.m. then confined to studying a bit of French and doing some writing. During the morning his m.w’s were active and took some silencing. After noon about 3.30 walked down to Bde. H.Q. and there saw the General and the B.M. and got some information regarding our relief tomorrow night. Orders for a little more gas to be sent over tonight. According to the observers the stretcher bearers have been observed to be very busy round the rear of Warneton today. Fortunately the\n\n31\/3\/18 – La Basse Ville\n\nrain has ceased and the weather now remains dull and mild. A walk down to the Red Lodge Baths was fruitless owing to them being closed. 8\" shells were landing round the batteries south of the Namur . The subalterns of artillery who we get here as liaiason officers are not a bad type at all and extremely keen on their jobs. At 8.45 p.m. left to go round the posts and had a trip not devoid of excitement. Hopped over the top with Pte. J.C. McFarlane, D.C.M., commonly known as \"Darky\", \"Coon\" or \"that black c---\". Our\n\n31\/3\/18 – La Basse Ville\n\ngreeting was a minnenwerfer not a thousand miles away. Along a slippery track to the railway and from there up to No. 8 post halting frequently for flares to burn out. Then made for No. 9, found Armstrong alright and stayed there yarning for a while. Pineapples & minnies were flying round the trail of the burning fuze of the latter could be seen coming through the air. They were landing about No. 7 but ceased as our guns retaliated. We crossed to 7 in a lull and had to stay there while he slowly bombarded the place covering us with mud and nearly deafening us. One\n\n31\/3\/18 – La Basse Ville\n\nlanded on No. 6 and wounded two chaps, the others of the post were badly rattled and shocked. Spoke to them all and cheered them up then walking right down through to Barker’s post. Barker was hit today but carried on duty. All the Billjims are in good heart and fine spirits. Called and saw all the different Company Commanders and found all well. Coming down Ultimo Avenue we had to breathe through our box respirators as the trench was full of gas & irritated the throat & lungs. A lovely moonlit night as we homed.\n","10":" – La Basse Ville\n\nMy first visitor after awakening was the Colonel of the 10th Cheshires who relieve us tonight. He had been an Instructor at the Senior Officers School Aldershot. His battn. will be inspected by General Plumer this afternoon and bathed so they have a busy enough day. Discussed dispositions and arranged details, he is much weaker than we are. Then lunched and walked up forward to discuss orders with the O.C. Coys. The sun brightly shining and visibility splendid. A few shells flying round but otherwise all is quiet. On a day\n\n1\/4\/18 – La Basse Ville\n\nlike this one realises what a wretched existence it is in a dugout or pillbox dimly candle lit and filled with the breaths and odours of crowded humanity. At 6.30 p.m. the sun was shining and showing up the country about vividly. The villages for miles behind the German lines stood out most clearly and any movement could be seen. High up in the cloudless sky an enemy ‘plane was being shot at by our archies. The Tommies were to have come up at this time but balloons & bright conditions made it not at all advisable so to do.\n\n1\/4\/18 – La Basse Ville\n\nThe 10th Cheshires marched in to our relief at 8 p.m. and duly completed it about midnight. Their fat Colonel was insistent on the mess people all doing their job and presently poor sweating Tommies covered my table with many bottles – gin & vermouth port wine soda whisky and many other things. How they expect to win the war doing this sort of thing one does not know. On a post we had two men wounded and also one out on patrol. The Tommies were very tired as they had been given a fruitless march to Baths. The minnies were active. We left Bn. H.Q. about midnight and the\n\n1\/4\/18 – La Basse Ville\n\nBoche was then heavily strafing Prowse Point with gas shells. We made a detour via Racine dump and struck more shells there. One gas shell burst only a very few yards from Stewart and myself without hurting us. At Hyde Park Corner, Murphy and Splatt had our horses and we made good going right back to Shank Hill Camp. The men came down most of the way by railway. All very tired. There was hot food waiting for them and for the officers we had our mess. A very heavy bombardment started about 1 a.m.\n","11":" – Shank Hill Camp\n\nAwakened several times in the early hours to receive and issue orders. We embus at 5 p.m. but Transport, cookers &c move at different times. The General came round about 11 a.m. and was in good form. The men did good work in cleaning themselves up and the band was playing. Transport is limited and some of the officer’s valises were too large altogether. Matthews is now back from his term on leave. The Royal Welsh Fusiliers marched into camp about 2 p.m. Yarned with their Colonel. Travers of 26th came over to see me. At 4 p.m. the Battalion\n\n2\/4\/18 – Shank Hill Camp\n\nfell in and moved down to embus in a column of busses. We paid today and consequently there were a few drunks about the place. The men were looking tired but clean. We marched through the ruined village of Neuve Eglise. Passed long columns of English reinforcements – in many cases under Australian officers. Many were children of the 18 class and were straggling all over the road. A great exhibition of disorganization. We put 25 men into each bus in the column & then set off. The road lay through Locre, Dranoutre and right back to near Mont des Cats.\n\n2\/4\/18 – Mont Rouge\n\nThe road was fringed with hedges that were just beginning to show a tinge of green and on the trees were green tints. A climb brought us up to Mont Rouge from the top of which is an excellent view in all directions for miles. From here you can see more than from Kemmell or Cassell, I think because the country behind is also visible. The smoke of trains & factories in enemy territory could be plainly observed. We seemed to circle round Bailleul now deserted and ruined. The tower of the old Hotel de Ville has been knocked off and later on we saw the flame of burning houses, Poperinghe one way and Steenwerke\n\n2\/4\/18 – Berthen\n\nthe other showed out clearly. Near Mont Rouge is a Corps H.Q. delightfully situated and having only come out of a filthy line last night we were well able to appreciate how much ease goes towards losing us the War. Ran down into Berthen a little place at the foot of Mont des Cats and there debussed. Walked out to billets a short distance out. Some of the officers were at a Corps Reinforcement Camp and myself had a stuffy little room in a dilapidated farmhouse. The folk all speak a Guttural Flemish & fair English. A late mess dinner (9-10 p.m.) and so to bed very tired.\n","12":" – Berthen\n\nHeavy rain fell during the night but the day broke fair. An air of spring is now abroad and soon every little hedge & copse will be a thing of joy and beauty. Arranged baths today for all the men and put Matthews in charge of looking after the programme. Plenty of officers here now with no leave or schools going. Rode over to Mont des Cats with Davis to the old Trappist Monastery which is such a dominating feature of this district. The road runs through Berthen (an ordinary village) and pursues a winding course up a hill to where the Abbey is. We entered at the\n\n3\/4\/18 – Mont des Cats\n\nmain door first having a look at the chapel on the road. This is a modern and uninteresting place except for some good modern wood carving and a rather ingenuous notice requesting people \"out of respect for the Holy Sacrement to refrain from spitting on the floor\". This same request is also put up in the Cassel church. All notices are in Flemish as well as French. The Abbey was occupied by an Eye Hospital of Australians in process of relief by Tommies. We met a lay brother in gown and hood but could not get him to speak as Trappists are vowed to silence. And this is\n\n3\/4\/18 – Mont des Cats & Berthen\n\na civilised age! From a terrace here is a splendid panorama of towns and villages but a ground mist prevented a properly good view. Walked round the Courtyard where are buried a few Lancer officers who fell in ’14. There was also buried here a German Prince but his body was stolen by an enterprising local inhabitant who is said to hold it out at a ransom but no one appears to know definitely now where it is. One of the doctors here took us inside and showed us all over the place. Upstairs to the gallery of the Chapel of the Monastery.\n\n3\/4\/18 – Berthen\n\nIt is a fine chapel, modern and the whole place is said to be largely supported by English money. The original place was erected in 1088 and renovated 1630 and after. Had a drink with the Dr. in their mess and then rode back to Berthen. The re-action after a month’s hard trench work is on the men and a little beer knocks them over. About m.n. received word that L\/ Cpl. Lee had died in the 22nd Corps Guard Room. This man was well known in Australia as comedian for Branscombe’s \"Dandies\". Lately he has been getting drunk a lot & generally going to the pack. Possibly killed in a brawl but the doctor can see no injury.\n","13":" – Berthen\n\nUp betimes a dull close day. One can almost hear the trees and hedges breaking bud. The whole countryside is a restful picture of the most verdant shades. The Old World is a place very beautiful at this season. Arranged firing party &c and details for the burial of Lee with all solemnity but could not help thinking of parallel in case of Mr. Bardell of Bardwell & Pickwick. Bardell died in his prime from a blow on the head with a pewter pot in a London cellar! M. le Cure here is a fluent speaker of English. Walked down to the Church where our pioneers had dug a grave. Inside the\n\n4\/4\/18 – Berthen\n\nchurch is comparatively new and garish with the tawdry waxen painted images and imitation flowers so dear to the Catholic. At the last minute the doctors forbade burial until post-mortem. Not having the necessary tools the body will have to go to a C.C.S. for burial. Rain fell fairly heavily so I ordered greatcoats for our march today. Valises and other gear are much reduced in size and necessarily so as there are now about 40 officers here. One of the characters of the regiment is L\/Cpl. Habel of the Mess. Always has nothing to eat, can produce nothing, always despairs but always turns up with a good meal for us under any circumstances.\n\n4\/4\/18 – Berthen Godersvelde \n\nThe Battalion moved off in column of route at 12.30 some of its members being slightly inebriated but otherwise all correct, some marched wearing g. coats, via Mont de Cats. Heavy going for men with their full packs up. Passed Mont de Cats – from here the view was not good owing to misty conditions. Pulled up in a paddock just outside Goedersvelde and stowed the away there while the entraining people got ready for us. At the station there were hot drinks for the troops. Left \"C\" Co. under Major Dooley behind and put the rest of the Battn. on the train. Left about 3.30 and our next stop was Caestre. The railway track is here kept in good condition by\n\n4\/4\/18 - Caestre\n\ngangs of Chinese coolies. Noticed that many gates here are formed by cutting down a tree and lopping its roots. This heavy part hangs over a gate post and balances the gate. Pleasant flat country hereabouts with plenty of cultivation, winding roads and red thatched farm houses. Travelled all night in the usual uncomfortable manner. Trying to snatch a little sleep half sitting, half lying. No gas on in the carriage so we stuck candles all round the doors and windows. Passed Hazebrouck, St. Omer, Calais in daylight and came through Etaples and Boulogne after dark. A journey of 12 hours.\n","14":" – Amiens\n\nOur train pulled in to St. Roch station at about 4 a.m. and rain was falling. Left a company behind to detrain our transport and then marched off from St. Roch just as dawn was breaking. The boulevard into the city was quiet and deserted owing as much as anything to the early hour. A few of the houses showed signs of being knocked about by shell fire or air raids. As we moved out I noticed that the Cathedral was still majestically intact its top wreathed in morning mist. A Frenchwoman told me afterwards that one little Chapel was wrecked. Our men were heavily\n\n5\/4\/18 – Amiens\n\nladen so the pace was perforce slow. Marching through silent streets we halted just outside the town where horse lines have been established. All the Tommies are filthy dirty and grimy owing to lack of baths. Three young girls passed our column here – all about 13-14 – and stamped by clothing and dreamy looks as soldiers trulls. Their mother lives in a scrupulously clean house close by and probably is one of those creatures without conscience who are content enough to live on the kids’ shame. Leaving the town we had a good view of the long sweeping moors and flat grazing treeless land\n\n5\/4\/18 – Bertangles\n\nso characteristic of Picardy. Our transport pushed on ahead of us and left the cookers which later gave the men hot tea. Most of the men in their usual improvident way had already eaten their breakfasts. Arrived on the far side of Poulainville and had a long halt. Met Thwaites’ brother-in-law and he told me Corbie had fallen and that our 18th & 20th Battns. were chucked in last night after marching & training all day. He is in charge of big ammunition dumps here. Hundreds of motor lorries travelling top speed out of Amiens. Marched into Bertangles while\n\n5\/4\/18 – Bertangles\n\nthe Band played. Crowded with troops, part of Corps H.Q. and D.H.Q. are here. Found my billet a nice clean room and talked to Madame who was an old woman, only son killed, and very despondent about the War. The estaminets were open between 12-2 and some men speedily got drunk & riotous on the wretched local wine. Beer is unobtainable. Had to put a strong picquet on to quell brawls – disgraceful. The men are excited at the prospect of hopping over and there is a tense feeling. The wine affects them very much. Saw A.P.M. & hope avoid recurrence tonight.\n\n5\/4\/18 – Bertangles\n\nThe poor people here are very excited and in terror of the Boche. After absolute security for so long they now feel unsafe and the sound of cannon can be heard. Sent Sutherland to Bde. H.Q. and he there received orders for our move tomorrow. Had a hot bath in Madame’s tub and then turned in. Had to stay awake to read the orders.\n","15":"\n\nReveille 5 a.m. Orders arrived about quarter of an hour before for an earlier move and there was much mix-up consequently. At 7 a.m. got aboard busses – there were 120 for the brigade – and had a lot of messing about. We went by bus right to Amiens and\n\n6\/4\/18 – Baizieux\n\nto Frankvillers en route for Heilly. This place I believe has been well ratted by the Tommies – all is abandoned and there are jewellers shops &c to pillage. An interesting journey through Querrieu by bus. We were on the road when our orders were altered and had to route march towards Baizieux where we went across country and took up a position in some undulating ground. Then made for St. Lawrence Farm a large ruined place evidently vacated in a hurry and much pillaged by the Tommies who seem to have gone to the pack completely. Orders now commenced to arrive.\n\n6\/4\/18 – Baizieux\n\nWe were under orders for the front line in relief of the 12th Bde. The men all very dead tired. Made preliminary arrangements. About 6 p.m. he put down an awful barrage which formed an impressive sight using much shrapnel. Set off with Thewlis about 8 and found our way entirely on the map to where the other people were. A much shelled road now is this main Albert road. Relieved 3 battns. and some pioneers with my chaps seeing Colonels Imlay, Ford, Leane and Major Owen. A pitch dark night many shell bursts, a tale of dead & wounded.\n\n6\/4\/18 – Front Line – Albert Dernacourt\n\nIt was a wretched and trying night for the men but they stuck it in fine spirits and cheerfulness. Owing to the pitch darkness nobody knew the way round and they had to stand out in heavy rain up to the knees in mud and slush. Then \"A\" Coy (already very tired and worn) had to furnish a platoon to carry up the rations to the front line. It was pouring all the time. Fortunately I found a petrol tin of rum in the dugout and was able to give a tot to all the men who were working. It put them in good heart as they waited for dawn. Out in front they settled down quietly. We had one flare in the air & found the line well back.\n","16":" – Albert-Dernacourt Line\n\nOur people here held the Railway until a few days ago but were pushed back. Out in front of the posts there are many dead. The Huns have been ratting the canteens captured from us. Everyone speaks contemptuously of the Tommies and the way they cleared out in panic from the Boche. There must be many deserters and looting of French villages and drunkenness are rife. So much for the vaunted discipline of the British Army! Our chaps are wonderful and set an example of courage and determination. Everywhere they are enthusiastically hailed by the French inhabitants as the saviours of their country.\n\n7\/4\/18 – Albert-Dernacourt Line\n\nThe artillery activity of the enemy is very marked and fierce shelling continued all night. Round Bn. H.Q. we had a rough time and some shells landed very close. Fortunately there were no casualties. Dawn passed uneventfully and there was no attack. Mud is deep abround . Walked round the men’s bivvies and some of the sights would make an angel weep. Poor dirty tired lads sleeping crouched in filthy wet holes. Those who were awake were cheerful and happy – what an example to us are our men. It appears strange to be fighting on the old well known road\n\n7\/4\/18 – Albert-Dernacourt Line\n\nbetween Amiens and Albert. Our cookers are now at Millencourt. Our guard and prisoners are right up in the support trenches. It is a good idea to bring the devils right up forward with us. The weather cleared up later in the day and aircraft were active patrolling up and down the line. Our archies and M.Gs engaged them blazing off much ammunition for nothing. The Boche today has been engaged in blowing to bits the pleasant little villages of Henencourt & Millencourt. His artillery has been less active but during the afternoon he got a direct hit right on top of our battalion H.Q.\n\n7\/4\/18\n\nWent over and saw Colonel Brazenor and had a yarn with him. About dusk there was much excitement when a French motor lorry laden with merchandise salvaged from Corbie dashed down the Amiens road into our firing line. The driver was brought to me – a funny little chap who had taken a wrong turning and got lost. The roads here are still excellent. At 8 p.m. went up the firing line and saw the outposts ordering certain new dispositions. The men are commencing to feel the wet and cold weather. Saw Major Dooley. The line now runs through pleasant fields and unspoiled land. Except for billets and a few shells it was hardly like war.\n","17":" – Albert-Amiens Road\n\nDuring the night we had a few men hit – some by a mills bomb exploded by a sniper’s bullet. The Hun was firing a good deal of tracer ammunition mixed in with his ordinary m.g. stuff. Otherwise the night was comparatively quiet. Day broke dull and turned out wet and miserable. The men are standing in mud and the only cover they have is waterproof sheets. Many cannot lie down at all. Hot food is hard to get forward and then is most likely cold by the time it is issued. The foot question will begin to arise soon if special care is not taken. Tried to get some timber and material up from some of \n\n8\/4\/18 – Lavieville\n\nadjacent evacuated villages. In these villages the property of the poor people is everywhere lying about – furniture, clothes, table and bed linen – and everything that the people treasure so much at ordinary times. The General was round the line early and called in at Battn. H.Q. for a talk. The 7th Brigade move in and take over on our right tonight. There was an amount of shelling round here this morning and we had some very close at hand. Contrary to his usual custom he is firing salvos and we have an uncomfortable feeling that our own 18 pounder shells are being sent back on to us from our dumps captured by them.\n\n8\/4\/18 – Albert-Amiens Road\n\nThe afternoon was quiet. There were many callers in the way of Artillery and Engineer officers who were making reconnaisances. Our guns put over a couple of practice barrages towards dark. \"A\" Coy moved forward and relieved \"C\" Coy about 10 p.m. Sent the ration limbers up to the rear of the support trenches and landed hot food there in much better condition than last night. Unfortunately no dry sox or any Tommy cookers came to hand. Rum came and was sent up later. Walked round the Pioneer Line after dusk and found everyone up there in good spirits but the little bivvies are too\n\n8\/4\/18 – Amiens-Albert Road\n\nclosely crowded together and if a heavy strafe occurs there are going to be many killed and wounded. Dug in a couple of strong posts about 200 y. behind the front outposts and garrisoned them. Things were quiet enough on the front. Coming back to Bn. H.Q. found some daily papers and read some war news therein. It appeared strange to think that all the world’s eyes are on this push at Amiens and here are we sitting down across the road to Amiens & wondering what the war news is. Plenty of dead about – collected a lot of belongings off them. Our snipers killed a number of Huns yesterday.\n","18":" – Amiens-Albert Road\n\nGooley and his flock got down here about 1 a.m. and we saw the men more or less stowed round the trenches. Some of them just slept out in the open anywhere. Put old Dooley to bed in a blanket and gave him and the others a drink. Sparrow has a neat hole drilled right through his steel helmet when he was \"en occasion\" up at the front. A marvellous escape. Rodda got in alright and settled down. Just before dawn the Hun commenced a furious bombardment & rained small calibre shells admixed with gas on to us. We had to suck our gas tubes. A dense fog came on and the barrage made much smoke. All\n\nsignal wires soon went. McCartin very bravely faced death and hopped out with a little band of signallers and runners and tried to get a lamp going. This was impossible a\/c smoke and fog. He then repaired the wires and got me into touch with the firing line. The Hun did not hop over. Until 7.30 all wires to Bde. were down and the General the rang me up to ask if all O.K. We had a rough house round here and many shells burst within inches. Some men wounded – one 23rd killed. The barraging was mostly on roads and tracks and continued until noon. Yesterday I suspended Capt. Lanyon for unsatisfactory work. Today I recommended Bubsie McCartin for M.C.\n\n9\/4\/18 – Amiens-Albert Road\n\nThe men round the trenches here are all miserable and dirty and very tired out. The day has cleared up a bit and the sun has come out a bit. Round here there are a fair number of dead lying about and we have been collecting any gear from the bodies. Am considering the advisability of shifting H.Q. to another hole in the ground as this one is too consistently strafed at all hours. Took a tour round the men of \"C\" Co. & H.Q. in their little bivvies and found all of them very tired indeed and just dying for a good rest and a sleep. They were fatigued but had made\n\nlittle shelters of iron and any other odds and ends about. Saw Brazenor and Jack. The General rang up and talked a bit about things on the map. The Boche strafed us heavily at intervals filling the air with smoke and explosions. Went up the line after dark. This business so far is just like manoevers. Posts and trenches dug in beautiful green untrenched meadow – people walking round everywhere in a casual manner. No bullets or shells up forward the only sign of war being an occasional shell chucked over towards the rear. Returned to Battn. H.Q. interviewed the S.O. & Q.M. and then turned in to a jolly good sleep.\n","19":" – Amiens-Albert Road\n\nAn uneventful dawn heralded a finer day but still dull. Not a shell anywhere near the place up to midday. People walking about all over the place not under cover and plenty of working parties about. The Engineers set to work improving Bn. H.Q. and putting in wireless. The General came up and had a talk about the tactical situation. Green fields, not a shot anywhere – it might have been a peacetime field day. Colonel Duggan came up after lunch and discussed our new dispositions for relief tonight. Went up myself to see Rodda and found him\n\n10\/4\/18 – Amiens-Albert Road\n\nsitting in his little bivouac out in such a pleasant paddock. Was fired at once only when going in here and concluded there are few Huns opposite. Found out the reason later when on returning to Bn. H.Qrs. there was the awful news that the Hun is right through up north now. What is the matter with the English! Decided on altering the dispositions of some posts of A Coy which are ridiculously sited. Saw Kennedy and others in their trenches all very muddy and dirty. A good view of Albert with Fanny Durack hanging. Three men killed by snipers. Relieved by Duggan & complete by m.n.\n","20":" - Lavieville\n\nReached a cellar in the residence of the late Mayor of this village. Here were good beds with white sheets rifled from Madame’s deserted linen press. Such a scene of desolation would break anyone’s heart – to think of these poor folk their homes fast being blown to pieces and all their property abandoned to a soldiery. As yet the house is fairly intact but shells are falling all round and there are batteries very close alongside. Had a late supper early this morning upstairs. Did not get up until noon and my batman then had a bath ready for me. Clothes &c all lying round\n\nas left by the people in their hurried flight. Salvaged some clocks and all the deeds and registers of the Mairie and sent them back to our Transport Lines for Leon Barbier. A bright day. Walked round these pleasant open paddocks to see all the Corp. Everyone very tired as the guides lost them last night getting here. All the men feeling a bit better after a sleep and a wash. The Hun was shelling at intervals. A good view of Albert which means we are under observation. He did not shell this village today but Mellincourt was going up in flames & smoke. Sent Stewart down to Transport and kept Sutherland here.\n","21":" – Lavieville\n\nA lovely sunny day. The Boche shelling very close to here and sending up debris & smoke. Found the dead bodies of a Scotch officer and a private at the local church. They had evidently been there some days and had bad wounds. Met a Major of the Tanks and with him made a reconnaisance of a new line forward. The weather was so clear that the observation from Albert was absolutely wonderful. After lunch met Rodda and Kennedy & made yet another reconnaisance, this time of the right flank. In a little copse there are now many\n\nflowering bushes and the whole countryside is bathed in beautiful sun. Overhead shells kept whistling and not a few are landing round here close at hand. The ruined villages are full of abandoned property – one of our funny sights the last few days has been C.S.M. Blackmore decked out in a Mademoiselles chemise instead of his own lousy shirt. Some canteen stores came up in the evening much to everyone’s delight and we were able to make an issue of cigarettes to the men. A bombing plane came over and a noisy fusillade commenced.\n\n13\/4\/18 – Lavieville\n\nWindy and dull conditions are prevailing again. It was nearly midday when shaving and washing were completed. Everyone attends impatiently the war news for there are big things doing. This morning there is something in Intelligence of the renewal of the push to Amiens. Our reserves must be in a funny state. We hear of the 1st Division brought down here and then rushed back after a couple of days. What a waste of transport. Walked up to Duggan and arranged about relieving him tomorrow night. Saw James and also a Colonel\n\n13\/4\/18\n\nof the Scots Guards now commanding a Welsh Regiment on our left. Two men of the 4th Div. were captured by the Hun in his Dernacourt push and taken to Bray where they were put in a prisoners cage. One of our shells landed in there and upset the sentries so our chaps escaped. Being old bushmen and knowing the country they set out to get through the Hun line and after many experiences they succeeded in reaching the German front line. Here they were many times challenged but got on alright and out into No Mans Land at last rushing into one of \n","22":" – Lavieville\n\nour posts with both sides blazing away at them. Their information is very interesting & they say the Hun is talking of attacking tomorrow. At latest news he is about 8 miles from Hazebrouck in the northern area. What a dinge it is! Matthews came up and took a Summary of Evidence in the case of Lanyon. Major General Smythe came in for a short talk about dusk but did not have much to say. We rigged up quite good baths out of a few tubs and by keeping them going all night we hope to get everybody bathed and\n\n13\/4\/18\n\ngiven a clean change of clothing before we go into the line. Bourke and Hunter came up when the rations arrived and some more canteen goods came to hand. Dealt out 28 days to a couple of A Co. absentees. Owing to unsettled conditions it is hard to get anybody court martialled – witnesses &c are all to blazes. Very little shelling here today. All my men well dug in and cheerful. We keep a cow here and milk it! Most of the artillery batteries also have a cow. Poultry, veal &c have varied the troop’s menu.\n","23":" – Lavieville\n\nNot at all a promising day for our relief – dull low grey clouds. The Staff Captain was the first visitor and talks of a good many F.G.C.Ms pending. The S.O.S. was sent up on the 24th front last night and heavy bombardments commenced. The 21st tried to carry out a small raid on a post last night under artillery support but did no good, having 1 officer killed, 7 wounded and 3 missing. Rather a disastrous little show. The 7th Bde. succeeded in getting one prisoner. News continues to arrive of the Hun advance up\n\n14\/4\/18\n\nNorth and generally there is much mixup. He has got us thinking. Arranged details for our relief of the 21st tonight and fixed up guides &c &c. After lunch walked round the companies and saw the different O.Cs whose preparations for moving forward are now well in hand. The wind is strong and piercing and gives promise of bringing up rain or snow. In any weather except absolute sunshine the Somme is a beastly place. The village is becoming daily more and more shell battered and delapidated. We are leaving a foot washing establishment here.\n","24":" – Lavieville\n\nSome shells were put round our headquarters before dark but did no damage. The Transport took back all our blankets and soiled clothes to the Transport Lines. It was a windy and bitterly cold night. The light continued good until about 8 p.m. and it was after that hour before any forward movement of our relief commenced. Walked up across country to 24th Battalion H.Q. and there saw Col. James and talked for a while. Then across to 21st H.Q. and took over from Col. Duggan completing the relief by about 11 p.m. What\n\nwith ration parties, parties carrying wire &c things were rather mixed. Our guns very active and heavy shells were going high overhead and landing well in rear of Fritz’s line. Little flashing sparks high up in the distance showed where shrapnel was bursting. Very wroth with our batmen who failed to turn out a cup of tea for us and duly strafed them. Parties carrying wire up to the front line to be put up in front of the Outposts. Machine guns on our front except for an occasional flick were quiet.\n\n15\/4\/18 – Lavieville\n\nA cold dull day but fortunately no rain. The night was quiet and uneventful. At half an hour before dawn I was awakened but dropped off again for a sleep when it became apparent that no attack was coming. Our guns registered on an S.O.S. line and I recommended a drop of 50-75 y. in order to catch any advancing troops very soon. Plenty of engineers material is now being dumped round this part – indeed too much. The day was very quiet and we had sundry visitors – Engineers &c. Walked up to Pioneer Trench and saw Rodda & Dooley. The latter I am sending out\n\n15\/4\/18 – Lavieville\n\ntonight to Transport. Had a narrow escape from a whizzbang. He was shelling Pioneer Tr. and buried 3 men & wounded Corporal Hanship. Went up again at dark and visited the men in all the posts on the Battalion front. All cheerful but cold. The Boche is only 50 y. away from our listening posts on the right. Today our men saw a German blown right up into the air by an 18 pounder burst. While up at B Coy posts near where 4 dead men lay, a heavy barrage was put down behind us and things became willing. Our ration parties were much upset and some were blown out. All B Co’s rum missing and some bacon. Sgt. Aspinall killed, 4 wounded. Sgt. Draper sniped in the head at dawn – not severe.\n","25":" – Lavieville\n\nThere was a heavy bombardment by our guns just at dawn and the roar was terrific. Dawn was ushered in by this and the heavy reply of the enemy. Our ration parties still continue to be upset and stuff does not reach its destination. Aspinall was in charge of the rations when he was killed. The General came in and discussed barrages and S.O.S. Several artillery officers on the same errand. After lunch a fair sized shell landed fair on the corner of our shelter knocking in a great deal of earth on us and burying many things. Except for being a bit bruised and shaken\n\n16\/4\/18 – Lavieville\n\nno one was at all the worse. Walked up forward to Pioneer Trench, passing through a moderate barrage and met Rodda and Sparrow discussing several matters of carrying &c. Our guns knocked down this afternoon the celebrated Falling Virgin of Albert commonly known as Mademoiselle or Fanny Durack. Received word that enemy massing down a couple of Divns. on our right meant that probably we would be attacked at dawn. Sent up Miles and Sutherland and let them do the posts. A quiet night. Sgt. Grey wounded.\n","26":" – Lavieville\n\nSlept in this morning until late and then got on to details and arrangements in re our relief tomorrow. Pay, canteen, bathing are three principle items that have to be looked after. Col. Duggan called in and made usual arrangements re guides. Some rain came on about noon but fortunately soon cleared off. The shelling around us much lighter today than yesterday but towards evening stunts commenced on both flank. Our gunners were registering on new S.O.S. lines endeavouring to get them as close as possible to\n\n17\/4\/18 – Lavieville\n\nour trench system. Stewart & the Matthews came up about 4.30 and had a little news from the rear mostly that our back villages are filled with French troops. Life back as far as the transport lines is usually a quiet business and their ‘lines’ lie in pleasant places. Put in some good work on our headquarters making the rear splinterproof. Yarning as we had some tea last night I found that Patterson has 3 kids – eldest 13. Smith has 3, eldest 9, Abercrombie has 2 – I feel a youth among these subs.\n\n17\/4\/18 - Lavieville\n\nWent across and saw Brazenor & Jack. A great deal of heavy stuff has been going over all day soaring up high in the air, humming steadily. About dusk two of our planes flew up and down behind our lines – fairly low certainly. Their job it would seem is to see if the enemy is massing. They omitted to do the two things necessary, (1) go over the enemy lines (2) fly down very low over it. Doubtless they return to the aerodrome and report all correct another triumph for the air men. Have had the Q.M’s staff making tommy cookers out of sawdust, bag, kerosene and old 18 pounder\n\ncharge tins. These provide the only means the men have of heating up any of their food. Carrying forward hot food is not a success unless you have Thermos. Our phones vary very much in their utility – the weather I think has a great deal to do with their working. \"Shake your ‘phone\" is a great byword here. Leo McCartin (Bubbie) is a splendid Signal Officer and a most likeable boy – good looking and brave. One of the best. Jack Smith (brother of General Bob), and as rugged, is a good conscientious officer and keen on his Lewis Guns.\n\n17\/4\/18 – Lavieville\n\nThings were quiet after stand to so I took Groves with me to go round the line, some gas shells were being put over and one spattered us with earth. The angle of descent was very steep. Passed over Pioneer Trench and made up for Mackinnon’s headquarters. A good deal of shelling was in progress on back areas and the air carried many softly swinging messengers. Went round the outposts and found all the men very cheerful and happy. Our wiring parties were busily wiring but some of the wire had been pulled too hard and too much flattened. Found near some of our dead a German\n\n17\/4\/18 – Lavieville\n\nmap case full of maps. Visited the left posts and saw Hunter. Greene and his patrol were out and decided to cut across to another post and having got the direction they followed a path. They were challenged in due course \"Halt\" and replied \"Window\" (the password). The next query was \"Valt?\" and they answered \"Window\" again. The next thing was a shower of bullets and one man was hit. All withdrew safely and while bandaging the wounded man there was much laughing over the incident. An uneventful passage back to Bn. H.Q.\n","27":" – Lavieville\n\nThe makings of a very unpleasant day. Slight rain and cold wind. Things were quiet round this sector at dawn. Sleep is a broken business \"up the line\" one must be awakened for stand to arms and signing of intelligence reports &c. Went over and saw Colonel Brazenor and had a yarn with him before lunch. Slight rain and very cold conditions commenced during the afternoon. Very little hostile shelling. Put in some work on improving our H.Q. here. Duggan arrived early and some of his people marched up too early so we had to stop them.\n\n18\/4\/18 – Lavieville\n\nOur parties going out ran into a barrage and had a hot time. Sergt. Corry (a good lad) was killed and Sgt. Perrass was wounded. We have had bad luck with our sergeants this week. The relief was completed in good time. A chilly moonlight night. Our batteries firing their shrapnel could be seen bursting in starry lights over the enemy line. The village has been knocked about since last time. A hot meal was awaiting us down here. The war news from up north is still bad – evidently the Tommies are still running. If they only heard how our chaps talk.\n","28":" – Lavieville\n\nAwakened for stand to arms but, nothing transpiring, turned in for further sleep. Got up about 10.30 and had a good hot bath which my man Charlesworth had prepared for me. While we were lunching a couple of shells whizzed over and killed a couple just outside so the doctor had to leave. Rodda called in and with him I walked over to his company. There was a little sleety hail or snow falling and I was very glad that all the men had blankets. A good many were fast asleep in their bivouacs\n\nand others were getting paid in the trench a section or so at a time. There was also a little canteen with each platoon and the \"Echo\" was being sold to different chaps. The trenches were in a very dirty state with old tins, food and salvage. A good view right down into Albert where the church tower now looks strangely short after the image having been knocked down. Returned to Bn. H.Q. and saw that arrangements were in train for giving every man a bath tonight. Owing to batteries being close round this has become a very hot spot.\n","29":" – Lavieville\n\nAfter dressing set off and walked across country to Henencourt. Very pleasant going across clover and cultivated paddocks. There is a dressing station in the village and all the way along the centre of the road was a trickle of blood from someone’s bad wounds. On the left hand side of the ruined street is an old church with a square tower. From inside its shattered walls came the sound of someone at the organ. The old Chateau dominates the village. It is built after the style of a miniature Versailles. Found Bde. H.Q. down in the cellars. In all the rooms\n\nare household treasures, fine pictures and books lying round everywhere and good furniture being used for any old use. Out in the garden the lawns lead to a fountain fed from cisterns. Lovely groves are cut through the wood converging from the central spot and giving enchanting views of the surrounding country. All the trees are flushing out into green leaf and the sight down these leafy lanes was a very beautiful one. Now horses are being watered at the fountain and shells are falling round the house. The old Marquis has had to leave his chateau to the mercy of the Tommies & Biljims and the Countess is living in Morocco.\n\n20\/4\/18 - Lavieville\n\nWent round all the companies and gave them jobs in the way of digging a connected line of trench and linking up our position. A Hun plane was over & being futilely blazed at. Went up and saw Sparrow and put the acid on him for several things. The Boche was putting over heavy salvoes of 4.2’s on top of the trenches round the forward Bn. H.Q. The air was rather full of splinters and not too healthy. Came back to our cellar at about 3.00 and had some lunch. The Padre blew along to say \nof\n a prayer over a better man than he is.\n\n20\/4\/18 – Lavieville\n\nDooley and others came up tonight and sent other officers out in their place. It was a quiet evening and there was nothing doing until our guns heavily opened up on a strafe about dusk. The General & I were recalling old battles this morning in connection with the Flers battle. Plenty of papers &c came up tonight. Put 3 companies on the job digging tonight and some more people on wiring. The battle will begin here again soon and it simply boils down to who can shift his divisions the quickest. I back the Germans for transport every time.\n","30":" – Lavieville\n\nAt dawn our guns opened up a terrific bombardment all roaring as hard as they could and making rather a rough awakening for our last reinforcement draft who only came in last night. It was a heavy rattle and rumble this bombardment. Had a good hot bath and then lunched. Walked round all the Coys and saw the different officers. He was shelling in a desultory fashion. It was a lovely day to be abroad, a warm sun was tempered by a gentle cool wind. Overhead squadrons of Hun\n\nplanes alternated with ours and archies and machine guns wasted a great deal of cartridges. Albert lay well in the hollow and the church tower, now void of its Virgin, stuck up. Some observation balloons were up. Went to 24th Bn. H.Q. and saw Colonel James who is well. His signalling Corporal was killed last night. After yarning here for a while went up to Colonel Duggan with James and got his dispositions for tomorrow night’s relief. Walked back with Groves to the village, pausing on its fringe to look at a cellar for\n\n21\/4\/18 – Lavieville\n\na battle headquarters. The air is full of Spring all the fruit trees are blossoming and a great flush rests on all the woods and copses. Our chaps potting away at grouse and partridges are a dangerous nuisance. The Hun started to search for a battery near here with 5.9’s and for a couple of hours he steadily potted away in an endeavour to get it. The shells were going just 100 yards over our heads and we thanked the good gunnery of the enemy that he kept so well on his mark.\n\n21\/4\/18\n\nOne indeed did fall short and wounded our cook Robson in the arm. It burst in the roof and splinters came through. Our 5th Divn. Lewis Gunners dispute with the Corps Aust. Air squadron the honour of bringing down Baron Richtofen the German crack flier. Towards midnight a fair amount of shelling went on and some gas was mixed in but nothing much. His activity in the way of gunning has shown an increase the last few days. A few wounded men came through here during the night.\n","31":" – Lavieville\n\nLaid abed until 10.30 a.m. and then rose and had a hot bath. This did not suffer despite the presence of many tea leaves from an old petrol tin. Soon after dressing Major Borwick Wertheim and Capt. Furlong (4 Army) blew in. The latter is very affected and effeminate. Rather a disguise I think that conceals ability. One or two apparently inane observations of this youth were deeply shrewd. He went on to the front line. Walked with Borwick over to Henencourt Chateau. The ruin and\n\ndestruction would break the heart of anyone. Returned overland. Our new work last night drew heavy fire of 4.2’s and 5.9’s. Ran into this. The first one landed none too far away. Got into a trench with some \"D\" Co. men and had to sit under a heavy barrage for an hour alternately standing up and bending down. He bombarded the whole of the valley and made it alive with flame and smoke sending an ammunition dump up in the air. The men from batteries and surrounding trenches were\n\n22\/4\/18 – Lavieville\n\nall on the run. Sgt. Hewitson was talking to me and got a smack on the finger that drew blood. Fatty Sutherland a subaltern who only joined up yesterday after a long time on soft jobs was wounded in two places. Luck!. After dinner Bowes Kelly blew in – 6 feet odd of misery. Put him to bed and gave him some tea. He has had a rough time today having a number of men killed and others wounded. At 7.30 p.m. the English on our left hopped over under a barrage and stormed the enemy positions opposite. Our guns cooperated. It was a heavy\n\nbombardment and noisy. We had to wait until things became tranquil and then set off. A great deal of noise and flashing as we silently moved up in Indian file. Flares and lights going up in all directions. Relieved Duggan quietly and without mishap & then went along and saw James. Scotty Lang his Pioneer sergeant is amusing. \"Keeping me busy. The b— are dying every day!\" The night except for machine gunning & some restlessness on the left was quiet. A little misty rain made conditions sloppy under foot. There is rarely a moment of complete silence on the front.\n","32":" – Lavieville\n\nIt was the early hours of the morning before we could consider ourselves settled down and as it was getting on towards \"stand to\" I did not go to bed at all. Dawn broke late and slowly low dark clouds and a misty rain. On our left the English put down a heavy barrage early to counter any attempt at counterattack. As soon as it became apparent that the Hun was not going to attack I went to sleep and continued so until awakened by General Paton. Gave him a dig about the B.M.S. faux pas last night – ordering us to take a post that is very well behind our\n\nown lines! After some lunch went over and saw Colonel James. It was a quiet sunny day. Some planes crashed. Dermody D Co. killed by a stray shell. The Hun furiously bombarded Henencourt for a while nearly covering it with the smoke of bursting shells. Some wounded men of the 24th were coming down on stretchers. Took a walk up forward to see the positions on this flank and was rewarded by an interesting sight. A splendid long C.T. leads up to the forward line and our lines being up well up on the hillside there is a splendid view looking down into Albert. Our\n\n23\/4\/18 – Lavieville\n\nheavies were plastering heavily into Albert and also getting some good direct hits on roads. Saw quite a number of Huns walking up and down the roads well behind Albert. On the left is Bouzaincourt where we spent a very pleasant month once. It is wretched to think of all these places being in Hun hands. Spent a very busy afternoon in arranging details of our relief tomorrow night. Col. Dawson of the 25th Battn. came and we pored over maps together. This large sidestep is a complicated business.\n\n23\/4\/18\n\nStewart came up tonight from the Transport & Sutherland is returning. While we were having tea word came of Bubbsie McCartin’s M.C. A good boy and an old original. Brought up R.S.M. Porter to replace Cadwell for a few days. There was a fair lot of shelling round the place and much heavy stuff going overhead. Rations arrived and their distribution was not too satisfactory. Our chaps had some shots at the Huns coming out to their posts. They could also be heard talking &c.\n","33":" – Lavieville\n\nA busy night with bright moonlight. At 3.20 died very bravely young Barker a good boy, upright, capable, brave and everything that a gallant young officer should be – and one of our originals. With Waxman he took our a patrol to endeavour to cut off a Hun post. He was reconnoitring and had gone forward about 250 y. with Waxman. They were half-lying half-kneeling listening when suddenly two Huns appeared on them. Barker halted them and fired. They also opened but had automatic pistols and a full burst ripped into Barker’s groin.\n\n24\/4\/18 – Lavieville\n\nWaxman meantime fired his revolver but it jammed. The Hun’s superiority in \nevery\n weapon costs us a price of human blood & life. He then threw two bombs and the Huns ran – one screaming evidently wounded. Barker was still conscious as Waxman pulled him to cover but soon died and W. dragged his body back to our lines. At dawn I went outside of here and it was lying stiff on a stretcher with staring eyes. I ordered the Roncers to cover it with a blanket. At 4.30 a.m. the Hun opened a gas and shell bombardment and soon had us all sucking our gas tubes.\n\n24\/4\/18 – Lavieville\n\nThe bombardment intensified and the outlook was a mass of big shells bursting and tinging the grey dawn with thrown up earth debris and with smoke. Altogether there were promising barrages and the festoons of S.O.S’s on the Welsh front made me expect an attack here. Colhoun our observer was killed by a Hun m.g. which drilled his thigh as he was going to an O.P. A married man. 20 minutes before he had been talking to me here. Air communications went so I had to use the power buzzer. Bubbsie McCartin, M.C. was trying\n\nto get through on his lamp when a shell burst got him in the neck and gushing blood from the wound made our Bubs a sick boy. The doctor bandaged him and I let him lie on my pillow until things calmed. A blood stained pillow. He pushed off on foot to hospital supported by 2 men. The Hun attacked well on our right & recaptured Villers Breteneux. To allow our counter attack to come off our relief & side step here tonight are put off for 24 hours. A quiet day with usual visitors. Went up the line as soon as it was dark and saw Dooley and all the others. L\/Cpl. Douglas M.A., L.L.B.\n\n24\/4\/18 – Lavieville\n\nof Melbourne University was this morning killed out near a listening post. It is a hard thing to say but both he and the other L\/Cpl. killed this morning were victims of their own carelessness in taking risks. Hun does a lot of sniping with rifles and machine guns about our posts at dawn and at dusk. While I was going round the posts he was using tracer bullets. It was bright moonlight and there were crowds of men standing and moving about our outposts. Ration carriers, wirers and a thousand and one other details. You would have thought that\n\n24\/4\/18 – Lavieville\n\na m.g. could hardly have failed to knock a number. Brian Winston son of Right Rev. Bishop was wounded in the scalp and had to be evacuated. Wandered round to the right and out to our listening post where was old Thomas of \"A\" Coy. His hard old criminal face would scare of any Boche I warrant. A few growls about rations. Really they are good but Billjim always growls on principal. Walked out into No Mans Land and saw where Barker was killed. It was late before we returned back to Bn. H.Q. for a cup of tea & then to bed.\n","34":" \n\nSome Hun raiders are lying dead out in front of our posts. Some had a kind of tomahawk. Our chaps found a body with the tomahawk close alongside. On the body was a good finger ring. Billjim broke the bone of finger and tore it about trying to wrench off the ring. Said he afterwards \"I had to leave it. I didn’t have the heart to chop the finger off.\" \n\nSaid one chap \"I see the m.g’s are killing thousands of Huns down South\". \"Yes\", said his mate, \"it must be terrible, fancy having to rat all the bastards!\" \n\nA Billjims reason for Fritzs aeroplane trailer light fired from the ground and throwing off a string of rising \n\nlittle sparks. \"You see the bloke in the ‘plane has got both his hands on the control wheel all the time and the only way the poor b— can get a light is by his cobbers sending him up a spark or two now & then.\"\n\n -\n\nThe password was \"paper\". An officer crossing from one One Post to Another is halted. Answers \"Paper\". Comes the reply, \"Have you got \"Truth\" Digger.\n\n \nLatest expression is \"dragging\" meaning \"about\". \"Any gas about\" is rendered \"Any gas dragging\".\n\n \nIn the Battalion there is a recognized \"Batmen’s Union\". They always thrust up one of their number as a candidate when a new officer appears. If a blackleg gets the job he is boycotted and cannot get hot water and things like that.\n\n"}}