{"Document Name":{"0":"Diary_0404","1":"Diary_0404","2":"Diary_0404","3":"Diary_0404","4":"Diary_0404","5":"Diary_0404","6":"Diary_0404","7":"Diary_0404","8":"Diary_0404","9":"Diary_0404","10":"Diary_0404","11":"Diary_0404","12":"Diary_0404","13":"Diary_0404","14":"Diary_0404","15":"Diary_0404","16":"Diary_0404","17":"Diary_0404","18":"Diary_0404","19":"Diary_0404","20":"Diary_0404","21":"Diary_0404","22":"Diary_0404","23":"Diary_0404","24":"Diary_0404","25":"Diary_0404","26":"Diary_0404","27":"Diary_0404","28":"Diary_0404","29":"Diary_0404","30":"Diary_0404","31":"Diary_0404","32":"Diary_0404","33":"Diary_0404","34":"Diary_0404","35":"Diary_0404","36":"Diary_0404","37":"Diary_0404","38":"Diary_0404","39":"Diary_0404","40":"Diary_0404","41":"Diary_0404","42":"Diary_0404","43":"Diary_0404","44":"Diary_0404","45":"Diary_0404","46":"Diary_0404","47":"Diary_0404","48":"Diary_0404","49":"Diary_0404","50":"Diary_0404","51":"Diary_0404","52":"Diary_0404","53":"Diary_0404","54":"Diary_0404","55":"Diary_0404","56":"Diary_0404","57":"Diary_0404","58":"Diary_0404","59":"Diary_0404","60":"Diary_0404","61":"Diary_0404","62":"Diary_0404","63":"Diary_0404","64":"Diary_0404","65":"Diary_0404","66":"Diary_0404","67":"Diary_0404","68":"Diary_0404","69":"Diary_0404","70":"Diary_0404","71":"Diary_0404","72":"Diary_0404","73":"Diary_0404","74":"Diary_0404","75":"Diary_0404","76":"Diary_0404","77":"Diary_0404","78":"Diary_0404","79":"Diary_0404","80":"Diary_0404","81":"Diary_0404","82":"Diary_0404","83":"Diary_0404","84":"Diary_0404","85":"Diary_0404","86":"Diary_0404","87":"Diary_0404","88":"Diary_0404","89":"Diary_0404","90":"Diary_0404","91":"Diary_0404","92":"Diary_0404","93":"Diary_0404","94":"Diary_0404","95":"Diary_0404","96":"Diary_0404","97":"Diary_0404","98":"Diary_0404","99":"Diary_0404","100":"Diary_0404","101":"Diary_0404","102":"Diary_0404","103":"Diary_0404","104":"Diary_0404","105":"Diary_0404","106":"Diary_0404","107":"Diary_0404","108":"Diary_0404","109":"Diary_0404","110":"Diary_0404","111":"Diary_0404","112":"Diary_0404","113":"Diary_0404","114":"Diary_0404","115":"Diary_0404","116":"Diary_0404","117":"Diary_0404","118":"Diary_0404","119":"Diary_0404","120":"Diary_0404","121":"Diary_0404","122":"Diary_0404","123":"Diary_0404","124":"Diary_0404","125":"Diary_0404","126":"Diary_0404","127":"Diary_0404","128":"Diary_0404","129":"Diary_0404","130":"Diary_0404","131":"Diary_0404","132":"Diary_0404","133":"Diary_0404","134":"Diary_0404","135":"Diary_0404","136":"Diary_0404","137":"Diary_0404","138":"Diary_0404","139":"Diary_0404","140":"Diary_0404","141":"Diary_0404","142":"Diary_0404"},"Date":{"0":"unknown","1":571.0,"2":572.0,"3":573.0,"4":574.0,"5":575.0,"6":576.0,"7":577.0,"8":578.0,"9":579.0,"10":580.0,"11":581.0,"12":582.0,"13":583.0,"14":584.0,"15":585.0,"16":586.0,"17":587.0,"18":588.0,"19":589.0,"20":590.0,"21":591.0,"22":592.0,"23":593.0,"24":594.0,"25":595.0,"26":596.0,"27":597.0,"28":598.0,"29":599.0,"30":600.0,"31":601.0,"32":602.0,"33":603.0,"34":604.0,"35":605.0,"36":606.0,"37":607.0,"38":608.0,"39":609.0,"40":610.0,"41":611.0,"42":612.0,"43":613.0,"44":614.0,"45":615.0,"46":616.0,"47":617.0,"48":618.0,"49":619.0,"50":620.0,"51":621.0,"52":622.0,"53":623.0,"54":624.0,"55":625.0,"56":626.0,"57":627.0,"58":628.0,"59":629.0,"60":630.0,"61":631.0,"62":632.0,"63":633.0,"64":634.0,"65":635.0,"66":636.0,"67":637.0,"68":638.0,"69":639.0,"70":640.0,"71":641.0,"72":642.0,"73":643.0,"74":644.0,"75":645.0,"76":646.0,"77":647.0,"78":648.0,"79":649.0,"80":651.0,"81":652.0,"82":653.0,"83":654.0,"84":655.0,"85":656.0,"86":657.0,"87":658.0,"88":659.0,"89":660.0,"90":661.0,"91":662.0,"92":663.0,"93":664.0,"94":665.0,"95":666.0,"96":667.0,"97":668.0,"98":669.0,"99":670.0,"100":671.0,"101":672.0,"102":673.0,"103":674.0,"104":675.0,"105":676.0,"106":677.0,"107":678.0,"108":679.0,"109":680.0,"110":681.0,"111":682.0,"112":683.0,"113":684.0,"114":685.0,"115":686.0,"116":687.0,"117":688.0,"118":689.0,"119":690.0,"120":691.0,"121":692.0,"122":693.0,"123":694.0,"124":695.0,"125":696.0,"126":697.0,"127":698.0,"128":699.0,"129":700.0,"130":701.0,"131":702.0,"132":703.0,"133":704.0,"134":705.0,"135":706.0,"136":707.0,"137":708.0,"138":709.0,"139":710.0,"140":711.0,"141":713.0,"142":714.0},"Entry":{"0":"\n\n","1":"\n\nA happy and yet unhappy day for me is to-day. Happy, because I know that I am off to do something to help the cause, and, unhappy, to know that war so demands Australia’s men to fight and fall leaving loved ones behind them, sad, yet glad and proud. \n\nOur boat \"SS Orsova\" carries from Sydney a score or so of nurses, a similar number of medical men, some 200 infantry; (reinforcements for the lately departed 3rd and","2":" Battalions) and 40, A.M.C. men who are to act as orderlies in the numerous Convalescent homes for Australians in England.\n\nOur unit consists of 84 men but I fear that 80 are not too cheerful as we steam from the wharf at 10 am, though, a warmer and more enthusiastic farewell was never accorded a body of departing troops. To make things perhaps more disquietening rain has set in and it remains until we sail through the heads at 4 pm on our voyage, afar. \n\nLittle was done to-night and after tea we turned in to our hammocks, very tired, but I, very very glad nevertheless for reasons known to myself alone.\n\nJuly 25th: -\n\nReveille 6 am to-day, and, upon arrangements being made & I were appointed mess orderlies for\n\nthe ensuing week at Table 2, where besides ourselves 8 other chaps were allotted for meals. Cool it is, but later, the day became pleasant, and my spirits rose considerably. \n\nUnfortunately, a man was lost overboard at 3 pm (an Infantry private) and though boats were lowered nothing could be seen of him. Tea to-night tasted fine and we were as hungry as hawks so it did not take long to dispense with it. The night was cold and windy and the ship began her tossing and rolling performance which resulted in many aboard becoming ill. Fortunately I was not so and slept well.\n","3":" -\n\nThe morning cold and dull. At 10 am we drew up at the wharf at South Melbourne and during the afternoon an inspection was made by the Governor-General. \n\nAt 4 pm the \"Demosthenes\" with 1600 Victorians aboard departed from the wharf opposite to ours and an inspiring sight it was. She was literally packed, and the cheers from her men deafening. I have seen nothing finer than this and I think it made me just a little sad knowing the errand that these chaps were departing on.\n","4":" -\n\nStill alongside wharf at 12 am when the \"SS Kyarra which carried the first batch of returned men\n\nberthed opposite to us. We gave them a warm welcome and so did the Melbourne residents who went literally mad. She carried a large number of Victorians thus accounting for the joy of those on the wharf. \n\nDuring the morning, the unit for number 2 ship, along with more nurses and doctors joined the ship, and, at 1 pm, the Victorian Battery of Seige Artillery being also aboard, we sailed, clearing Pt Philip heads at 4 pm and running into a heavy sea and a threatening storm.\n","5":" -\n\nTo-day broke very cold and dismal. By 10 am 90% of men were down with sea-sickness and parades thus made impossible. Fortunately, and, I must say remarkably, I was not unwell all day, sleeping well throughout the night.\n","6":" -\n\nStill cold and dull. My joy turned very suddenly during the afternoon for I became very ill and sighed for land or at least calm weather. All night I was the same, and, you can guess, not too cheerful or merry.\n","7":" -\n\nTo-day, as suddenly as it overtook me, the sickness left me and with the return of fine weather so did my spirits. The afternoon was perfect and the night so mild that a number of us ventured up\n\non deck \nfor\n to sleep there. The move was a successful one and I slept finely.\n","8":"\n\nThe morning broke dull and cold but by 2 pm all was sunshine again. Parades called at 10 am & 3 pm and instructions issued as to how to act in case of fire or other disaster. \n\nAt 1 am (\nduring the night\n) we sighted (sleeping on deck) the Leeuwin Light and rounded it in a stiff breeze.\n","9":" -\n\nPassed the light at Cape Naturalist, 6 am. Between 10 & 11 am, Rottenest Island, on which the West Australian German Concentration Camp is, was passed, and at 2 pm our ship berthed in Fremantle Harbour. Here, a number of those aboard broke leave, it having been refused them, and took train for Perth. \n\nDuring the afternoon more nurses and medical men came aboard and at 3 am \nearly\n next morning we sailed, leaving, so it was later ascertained, some 20 men behind who had not returned from the capital.\n","10":" -\n\nTo-day was dull but decidedly warm. Other than one parade being called there was absolutely nothing to do but to read and loll about deck. Two of our men, one being my chum Bob Atwill, entered hospital, he with a mild attack of pleurisy. \n\nSlept on deck again the night being cool and pleasant.\n","11":" -\n\nDay excessively warm and sea exceptionally\n\nsmooth. \n\nPay distributed during the afternoon by Major Mills of Strathfield, who, in conversation, asked, that when I next wrote home, his kindest regards be sent to father. As the night was a glorious one we again slept on the upper deck. We, embracing, Nick Johnston, \nBob Atwill\n, Reg Single & myself.\n","12":" -\n\nUpon awakening this morning I discovered that my throat was sore and that a cold had taken possession of me with vengeance. Paraded sick at 4-30 pm, and, upon being examined by Capt Kirkwood was admitted to ship’s hospital with Tonsolitis and Influenza. Temperature 104° when first taken. Slept poorly throughout the night but felt better in the morning.\n","13":" -\n\nExamined by Capt again at 10 am. Temperature considerably lower and though I was kept in bed all day, by evening I was almost OK again. Night fearfully close though beautifully mild.\n","14":" -\n\nUp at 10 am, discharged. The day was as glorious as one could imagine but very hot. A concert was held on the well deck and proved very successful. The ship covered 360m, which was to-date, her record day’s sailing since our departure.\n","15":" -\n\nAnother glorious day and so warm that our apparel consisted only of hat, trousers and soft shoes. Nothing of importance occurred with\nout\n the exception of a lecture given by our O.C. to our unit on \"Care of patients in sick-room.\"\n","16":" -\n\nStill fearfully hot and sea calm. A lecture was given by Capt Lewis in the morning but no parades were called throughout the afternoon. The ship covered 264 miles to-day. Slept on deck.\n","17":" -\n\nTo-day, Australia Day, a public holiday was declared and a successful sports meeting held. Racing, boxing and other events up and made a pleasant day for us, whilst a splendid concert was held at night. This was patronised by practically everyone aboard, and, at the completion, several articles were auctioned realising a substantial sum for the Australia Day funds.\n","18":" -\n\nFine but extremely hot. Crossed the line at 6 pm having covered 384 miles. Slept on deck but \nthe night was unbearably\n close.\n","19":" -\n\nStill hot and fine, while sea remained like glass. Divine Service held in morning, and\n\na lecture on first-aid given on deck at 3 pm by Capt Johnston of our Unit. We were all innoculated against Enteric fever, not compelled, but advised to undergo same by O.C. as a precautionary measure.\n","20":" -\n\nSea still calm and the day perfect. We are indeed having a splendid trip and I am enjoying it wonderfully, feeling fine and in the best of spirits. A lecture was given us on \"Wounds and the treatment thereof\" by Capt Taylor at 3 pm. \n\nThe night absolutely glorious, cool and calm.\n","21":" -\n\nContrary to yesterday, to-day was very windy and the sea high. I was on guard from 1 – 5 pm at a fixed post and found it hard to keep my feet so rough was it. Another lecture given, dealing with \"Wounds caused by shells and bullets\" this being exceptionally interesting to us.\n","22":" -\n\nSea still rough and some of our boys ill in consequence. Fortunately I felt splendid. A lecture on \"Bleeding\" was given by our O.C. at 3 pm and a concert held on deck at 8 pm.\n","23":" -\n\nA scorcher; unbearably hot and our spirits only raised by our first sight of land at 4 pm. This, was Aden, a barren and yet a very\n\npicturesque place, inhabited by few whites owing to it’s terrible climate. \n\nWe anchored in the bay at 5 pm and were in no time surrounded by natives selling at exhorbitant prices, silks, cigarettes, toffee and fancy goods. Their goods were of a very poor quality, and, unless you were very careful, one would find that they had been deceived grossly over their purchases. \n\nAt 7 pm the coal barges came alongside, and, all through night could the weird noises made by these natives be heard throughout the ship.\n","24":" -\n\nTo-day I felt exceptionally happy, why, I cannot say, but I did. We left Aden at 6 am, the morning being hot with not a breath of breeze stirring. Our passage to-day was made through the Straits of Babel-man-deb and several small rocky islands were sighted during the afternoon, but all were terribly barren and devoid of any vegetation whatsoever.\n","25":" -\n\nEntered the famous Red Sea on a day as perfect as day could be. Passed several large steamers also the island of Perim where a small settlement exists. The night following this glorious day was likewise and we again slept on deck.\n","26":" -\n\nTo-day we were satisfied indeed as to the strength of old Sol’s rays in this portion of the world for a hotter day I have never experienced. Church Service was held at 10 am and at 7 pm, but both services were, I fear, poorly attended. Sleep was made almost impossible and I hope that we shall soon quit these regions, for the closeness of the atmosphere at night was intolerable.\n","27":" -\n\nSuch a relief upon coming upon deck to-day. The air was delightfully cool and the change welcomed by all aboard. \n\nPassed several armed merchantmen and a considerable number of large steamers some having their name and nationality displayed conspicuously on their sides to announce their belonging to a neutral power. \n\nTo-day our unit began duty in the ship hospital, and, accordingly I was appointed an orderly with 8 patients under my care. There were 52 men in bed suffering chiefly with influenza and tonsolitis whilst 8 in the isolation ward had contracted measles. Slept on deck again.\n","28":" -\n\nThe Red Sea was to-day of the most beautiful blue imaginable, so it belies it’s name\n\nsomewhat.\n\nThe day was cool and pleasant and flying fish could be seen disporting themselves everywhere. We passed at 5 pm an outward bound P & O Steamer and it brought a memory back of dear old Sydney, for we guessed that this was it’s destination. \n\nI am still in fine spirits & the best of health, enjoying the trip wonderfully.\n","29":" -\n\nAt 5-30 am our boat cast anchor at Suez and in the early morning the approach to this port presented a truly beautiful sight. A large mountain lies directly opposite the town which is flat and uninteresting looking, the desert being plainly visible in the background. All the larger buildings are painted a light colour and the effect under the fierce sun’s rays is a glaring one. \n\nWe laid in the harbour all night, taking water aboard.\n","30":" -\n\nAt 7 am we moved to the wharf where the disembarkation of 2\/3 of our ship’s company was to take place. Punctually at 10 pm the Infantry reinforcements and the AMC details began leaving, together with their respective officers and baggage. \n\nThe first train load to leave the wharf carried about 300 men and it’s departure was the signal for a tremendous\n\noutburst of fervent cheering. I felt somewhat unhappy at seeing these chaps go off for I knew that they were on their way to perform duties as trying as man could be called on to do, but they were, on the contrary, delighted. The second train was also farewelled with none the less enthusiasm, whilst the third, carrying the 100 nurses was given a great cheer by those going right through to England. \n\nRemaining now, \nwere\n was our party, that of number 2 ship and the Siege Artillery battery, and a vast difference was seen, as, at 4 pm we steamed across towards the entrance of the Canal which was entered at 4-20 pm. The view presented directly on entering the Canal, is , for about ¼ mile, rather pretty as the European quarter of Suez faces the canal, but, beyond this the dreary desert waste is seen on either side until Port Said is reached.\n","31":" - \n\nLast night we passed, in the canal, several large steamers including the \"Osterley\", outward bound to Australia. \n\nAt 9 am our ship anchored at Pt Said, a place which appeared prosperous and busy enough, for the harbour was full of large steamers and a number of French men-o-war, all of \nwhom\n which\n\nsaluted as we passed. \n\nDuring the afternoon, 300 Territorials who were recovering from fevers & wounds were taken aboard, some being admitted to the ship’s hospital immediately. These chaps told some stirring tales of incidents at Gallipoli and of the conflict on the continent, for 70% had fought in both places. \n\nOn a glorious evening at 5 pm we left and turned into the Mediterranean which was of a most glorious blue colour, and the last lap of our journey began. I was in fine spirits and perfect health, & so had good cause to be, as I indeed was, very happy.\n","32":" -\n\nA glorious day and one which passed without an incident of note occurring.\n","33":" -\n\nTo-day, a day as perfect as day can be. Divine Service held at 10 am and a parade at 3 pm. Slept on deck with Reg, Nick & Bob. \n","34":" -\n\nOur unit completed hospital duty to-day it being taken over by No 2 ship. The weather still continues to be perfect and we have lazy days before us for a week or so. Slept on deck again.\n","35":" -\n\nAt 6 am, Sicily was sighted, objects on the shore being plainly discernible. Until 4 pm\n\nland was in sight, and, at 4-30 pm we came across a Sicilian fishing fleet which presented a pretty & novel sight for us. \n\nTo-night, perfect, as it is mild and gloriously moonlight.\n","36":" -\n\nUntil 5 pm to-day nothing of interest took place when we passed close to a large up-to-date French cruiser. I can vouschafe that three of the heartiest cheers ever given were accorded her, and she looked very fine and imposing indeed.\n","37":" -\n\nAnother glorious day followed by a perfect night. \n\nAn exceptionally large number of steamers were passed to-day and greetings exchanged with several.\n","38":" -\n\nAt 8 am on a dull morning we gazed on the impregnable Gibraltar. \n\nHere we were interested in the manoeuvres of the numerous gun-boats which formed a portion of the fleet stationed there, and, until our departure at 4 pm we marvelled at what we saw of this giant fortress. Two 4-7 inch guns were mounted as defence against submarine attacks and I confess that I felt muchly relieved at this precautionary measure. \n\nAs we steamed out we witnessed a sight which I think will always remain\n\nfresh in my memory, for close to us passed the colossal \"Aquiatania\", carrying, so we ascertained later, some 3000 Englishmen from Gallipoli. A truly imposing scene it was and one which I consider myself extremely fortunate in viewing.\n","39":" -\n\nUnlike yesterday, to-day is again fine and cool. No parades called and nothing of interest took-place.\n","40":" -\n\nVery windy to-day and sea choppy. Divine service held at 10 am, sermon being very impressive. Strangely, the night was bitterly cold.\n","41":" -\n\nThe last day of our preliminary journey. \n\nAt 8 am two destroyers joined us as an escort and well it was that they did so. Later, we were told that a submarine had been sighted at about 7-30 am, and, upon reflection I well remember that all water tight doors were suddenly closed and extra speed put on at that particular time. \n\nUpon the destroyers being signalled, one, literally flew across our bows and manoeuvred for 30 minutes on our starboard side as if in pursuit of something, whilst the other dodged from side to side until the first-\n\narrival rejoined us.\n\nAt 10 am, wreckage, consisting of casks, cases and a lifeboat were passed, and a little later, two corpses (which were later picked up, so I believe). The wreckage was that of the steamer \"Diomed\" which had been torpedoed only 18 hours prior to our arrival in that zone, and, mighty glad were we in knowing that we had such reliable protection as we did.\n\nAt 3-30 pm the famous Eddy-Stone was sighted and at 4 pm in all the glory of a beautiful English evening we entered Plymouth harbour which I thought absolutely the most glorious place on god’s earth. The hills surrounding appeared so picturesque that I immediately conceived a liking for England which I kew would take a lot to supplant, and a great ovation was accorded us as we passed the numerous destroyers and several training ships which lay in the harbour. \n\nAt 7 pm an unexpected order was issued for disembarkation to commence at once, and, until 10-30 pm every chap in our unit went his hardest, handling, firstly the convalescent men, secondly their own belongings, & thirdly the hundreds of portmanteaux, trunks, bags etc which were aboard. \n\nThe Artillery battery left\n\nfor Weymouth at 10 pm and we tumbled into our train, very very tired, with the prospects of a 4 hours journey before us. At 4 am next morning we arrived at Southampton & remained on the station & wharf, combined, until 6 am.\n","42":" -\n\nAlthough feeling extremely tired we went aboard a hospital yacht, the \"St David\" elaborately appointed for use by officers only and donated by an English Lord. \n\nAt 11 am with happy hearts our unit was marched to the rest camp lying 1 mile out and there began an encampment which I knew was to be extremely pleasant for the park surroundings were glorious. I thought that Southampton was as ideal a spot as one could wish for to spend a week or so in and I hoped that I should not be disappointed. \n\nThe night was quietly spent for all were too tired to do anything but sleep and we did until 9 am next morn.\n","43":" -\n\nA beautiful day. Parade held at 10 am & the glorious news announced that leave may be given us in a few days. The rest of the day was ours and advantage was taken to explore the Common on which the camp was pitched and the general verdict, was, that of all public reserves or parks we had seen, this was undoubt-\n\nedly the most picturesque and delightful.\n","44":" -\n\nA happy day was to-day, for, at 2 pm we were informed that leave had been sanctioned, although until our pay arrived we could not leave Southampton. In the afternoon with Bob, Jack & Reg I went to Bitterne Park a pretty riverside suburb of the city and completed a pleasant day by visiting a Vaudeville show at the Palace Theatre. \n\nI found that in some respects goods were in England far cheaper than in Australia but meals and foodstuffs considerably dearer with the exception of confectionary which is remarkably low in price considering the quality.\n","45":" -\n\nWe are fortunate indeed in having the perfect weather of which to-day was a fair sample, for in a place such as I now am, to be alive & well is truly a blessing. \n\nThis afternoon, 55 of our boys began their leave whilst the second party remained until their return. \n\nOn guard from 2 until 4 pm so could not leave camp, but, after tea, about 10 of us went to a picture show where to our surprise, two films, screened I think for the purpose of encouraging immigration to Australia, were shown. We applauded these in fine style, you can guess.\n","46":" -\n\nWent to service in C of England church at 11 am and caught the 2 pm train to Netley, later,\n\nwhere we were shown over the largest military hospital in the United Kingdom. The main building which has an immense frontage and which commands an extensive view of the bay can accommodate over 3000 patients, whilst the number who can be treated in the smaller wings is considerably over 1500. The whole hospital is perfectly equipped and staffed by English nurses and R.A.M.C. orderlies numbering about 300. About 20 Australians were patients here and they were very pleased to see us, for, of Australian they saw little, few ever finding their way down that far.\n","47":" -\n\nAlong with Nick, Bob & Fred Ross I had an enjoyable morning in the baths which are fine. \n\nCaught the 1-30 pm boat to Southsea, a watering place lying 30 miles away, which posseses a promenade and a very large pier. From here we took tram to Portsmouth and saw there the old \"Victory\" which lies in the inner harbour. In Portsmouth are also immense naval barracks and a Museum containing some extremely interesting relics of ancient times. Whilst there we also saw the \"H.M.S. Lion\" which had done and sustained damage in a recent naval engagement; she lay amongst a perfect flotilla of small war craft comprising destroyers and gun-boats. \n\nAt 7 pm\n\nwe caught the steamer back, arriving at Southampton at 10 pm having spent a very pleasant day.\n","48":" -\n\nSpent the morning, which was a glorious one, in visiting Bitterne again. This place has a particular charm for me and I could repeat the trip a dozen times without wearying of it.\n\nAt the baths again in the afternoon and at night went to see \"Sealed Orders\" which was splendidly staged at the Royal Theatre.\n\nI thought to-day how fortunate I am in being able to see those things which I am and of the really great time we are all having. Nevertheless I shall not be sorry when our boat is ready for it seems absurd that Active Service should mean this state of affairs.\n","49":" -\n\nAn eventful day for me was this one. \n\nCaught the 8 am train for London where we arrived at 11 am. Went from Waterloo Station to the YMCA building and booked for 4 days. As a preliminary, after dinner we mounted a bus and went to the famous Picadilly Circus where I thought the whole of the traffic in the universe had congregated. I shall never forget the impression that this and my first walk along Regent Street (where we saw the most wonderful shops) gave me. \n\nI could scarcely imagine that this was really London, and I also\n\ntried to conceive, that, if this is London in war time what must it be in time of peace, for we were told that the traffic and crowds had diminished immensely since war had been proclaimed.\n\nAfter lunch we visited the truly glorious Westminster Abbey, Houses of Parliament and the Art Gallery, seeing also a hundred other places of note on our way to & fro. Afternoon was all too short for us. Had tea and went to the Hippodrome, a beautifully decorated & appointed theatre where a revue \"Bric-a-Brac\" was produced with all the splendour of up-to-date theatrical attractions. \n\nBed at 12 pm very welcome for we were all dog-tired though happy, anticipating the joys that the morrow was to bring forth for us.\n","50":" -\n\nA fine but dull day. \n\nVisited Whitehall Palace and St Pauls Cathedral during the morning and whilst at the latter, stayed for a short service. St Pauls I thought marvellous. It is a colossal structure and its interior perfect. \n\nAt the invitation of Lady who at one time resided in Australia, we, along with 20 other Australians visited her beautiful home at Tulse Hill and we were there entertained royally until 8 pm when conveyed us right home.\n\nDuring the morning Reg & I were accosted by Australia’s singer Madame\n\nAda Crossley who invited us to visit her that afternoon. With regret we were forced to refuse, having accepted the aforementioned but she accompanied us for over an hour in Oxford Street advising us where to go and inquiring as to affairs in Australia when we left.\n","51":" -\n\nTook Motor to Hyde Park early in the morning & saw the famous drives therein. From there we went to Albert Hall, seeing on our way the beautiful Albert Memorial. Albert Hall had been recently decorated and looked glorious, the boxes of the king & nobility being sumptuously decorated with silks, ready for the ensuing season. \n\nAfter lunch we went to the Tower Bridge on the towers of which Anti-Aircraft guns are mounted, and from here to the historic Tower of London. Here we shown everything by the \"Beefeaters\" who form the guard, and every spot of interest was pointed out to us and facts about it related by them. \n\nAt night, \"Betty\", a new and pretty comic opera which was running at Daly’s Theatre was patronised and proved very enjoyable.\n","52":" -\n\nAnother fine and cool day. Spent the morning in Oxford & Bond Streets which mark the chief shopping centres of the city and here we saw to what perfection goods can be displayed. \n\nIn the afternoon took\n\nmotor to Kew Gardens and Richmond Gardens. The former are the most glorious public gardens that the world possesses, and there, every conceivable shrub and tree is growing. The gardens lie on the Thames bank with Richmond Terrace above them and they cover an area of 800 acres. They are visited by thousands during the boating seasons as the King’s own boatshed lies opposite and the river course in front of the gardens is the popular resort on summer afternoons of London Society. \n\nAt 8 pm we took train for Southampton which we are loath to have to return to for four days was not really enough to see a quarter let alone the whole of London. I am hoping that we shall be again able to visit this wonderful place which so appealed to me.\n\n3rd\n","53":" -\n\nBeing still on leave we went to-day to Bitterne Park again and in the afternoon to Portswood which is a pretty suburb containing some very nice residences. \n\nSouthampton abounds with fine avenues of beautiful trees and almost every house has a garden containing gay and multi-coloured flowers, so that a pretty scene greets the eye in looking along any of the suburban streets. \n\nAs all of us were very tired, after a pleasant hour in the Y.M.C.A. rooms, we returned to camp and slept soundly until 8 am, on, \n","54":" -\n\nAnother glorious day. \n\nIn camp all the morning and caught the 1 pm train to Bournemouth which lies about 30 miles away. As this place is a favourite resort we were fortunate in visiting it on a day when the attractions and crowd were both numerous and brilliant, for the fine promenade and pier were thronged with a host of remarkably distinguished and well-dressed people. \n\nThe beach which is a pebble-strewn one looked picturesque with it’s numerous coloured bathing machines, though, strange to say, considering the perfect day that it was, there were few bathers. To reach the beach, one passes through a small but delightful park which contained dozens of plots of brilliantly hued flowers, and a number of small ponds which are stocked with gold and silver fish. \n\nLeft at 6 pm & arrived at Southampton at 7 pm when we went to a concert on the pier.\n","55":" -\n\nWent for an early morning swim this morning and later for a walk through the portion of the Common which so far we had not seen.\n\nOn guard from 2 until 4 pm so was unable to leave camp. \n\nAfter tea we visited a couple of Soldier’s rest houses and went to bed early, sleeping under the trees.\n","56":" -\n\nInformed this morning that we were to have a good time as to-morrow would see us on our boat. \n\nAccordingly, we did, starting with a motor trip to Bitterne & from here to St Denys which lies also along the river. At the baths again in the afternoon and to the Palace after tea, finishing with a hilarious supper party at the \"Grosvenor\" where we have had many a pleasant meal since our arrival in this town. \n\nRetired at 2 am pleased that we were going, yet loth to leave a place of such pleasant recollections as this recalls.\n","57":" -\n\nAt 9 am sharp we marched out of camp arriving on board at 10 am. \n\nAt 11 am she moved into the stream and after lunch we began work on the wards which were full of rubbish of all descriptions. Along with 3 others I was assigned to F1 and 2 where there are 182 beds all told and where we went hard at it until 5 pm. \n\nOff duty after tea and to bed early knowing that to-morrow would bring plenty to do for us all.\n","58":" -\n\nIn Convalescent wards all day. Bed frames scalded and walls washed along with ports. This brought a fine old sweat out on us for the day\n\nwas a warm one. A concert was held on the well deck beginning at 8 pm & every item was a first class one. Slept on deck as the night was perfect. Sailed at 6 pm, sharp.\n\nNo 1. Australian Hospital Ship\n\nThe \"SS Karoola\" of 7900 tons, which, eight months ago was a popular and well-known passenger and cargo steamer trading between Sydney and Fremantle, to-day, \nNovember 15th\n, rides the seas as a splendidly equipped, up-to-date hospital ship. \n\nThe transformation, which was a rapid one, took place at Southampton (England) during August and early in September, and, on the 9th day of the latter month, her staff consisting of 11 experienced medical men, 21 capable nursing sisters and 84 orderlies, took possesion and \ncompleted\n began the work of preparing the wards and offices for the reception of patients at Alexandria where it was anticipated we would arrive about 20th of September. \n\nWhen fully stocked i.e. when every bed is occupied, 484 men can be accommodated though 500 can be carried by the slinging of hammocks on the well deck for the additional 16 men. \n\nThe largest ward is F2, situated in the foreward part of the ship, and this, along with F1 which contains 52 beds, totalling 182 all told, is reserved for convalescent patients who are able to a certain\n\nextent to care for themselves; Accordingly a separate mess room containing 18 tables, adjoining these wards, has been provided, and the labour of bringing meals to the beds has therefore been dispensed with here. In these quarters the bunks are arranged in double decker fashion, but in the remaining 12 wards, swinging cots are installed for it would be awkward to have to attend cot cases in a top bed, especially if dressings are needed.\n\nWards B1 and 2 lie on the promenade deck and occupy the space originally held by the 1st and 2nd class Smoke rooms. They are perhaps the most pleasant aboard and therefore the first mentioned is used by commissioned officers only. Another smaller ward on the same deck, containing 12 beds, accommodates any Warrant-officers, but should there not be a dozen aboard the empty beds are used by any of the other patients. \n\nThe \"E\" division contains 6 wards, 1, 2 & 3 being used for medical cases, whilst 4, 5 and 6 have as inmates Surgical cases alone. Of these 6, numbers 3 and 5 are the largest, the latter having two divisions to it, and 3 is perhaps the nicest in appearance, it serving originally as the 1st Saloon dining-room. \n\nOpening on to the well deck aft is D1 where the most serious cases are treated, it being in some respects more elaborately appointed than the others.\n\nThe Isolation ward D2 lies right aft and contains 10 beds and all out offices of it’s own so that infection could not spread to the other patients quarters. \n\nAt either end of the boat are lifts to enable the moving of bed cases on to deck, for dis or embarkation purposes, and, in the case of that lying aft, for the conveyance of patients to the operating theatre which is on the boat-deck. The theatre is spacious with two dressing rooms and a dental parlor adjoining, having a tiled floor and walls, and brass and copper fittings. For the purpose of conducting operations, every appliance and instrument necessary is kept in the glass cupboards, and the dressings and bandages, likewise. \n\nIn each of the wards already mentioned is a pantry, bathrooms, lavatories, washplace, linen-locker, steriliser, earthenware sinks and \nnumerous\n several cupboards to hold medicines, instruments and would dressing appliances which are numerous. \n\nEach patient has a locker, corresponding to his bed number, and in it can keep toilet articles, towel and any private property small in size. Packs and clothing are kept below in a \"Pack Store\" on racks, and they\n\ncan be had whenever one pleases to abstract anything from their kit. \n\nOf Red Cross goods and medical comforts, an enormous quantity is kept in stock. Pyjamas, socks, shirts, hats, mufflers, Convalescent suits, ties, handkerchiefs, razors & strops, tooth-hair-nail & clothes brushes, combs, tooth-paste and soaps are in abundance and are issued to any patient upon approval being given by the sister-in-charge of the ward wherein he is.\n\nAs, of course, the patients cannot all have similar food, a diet sheet has been prepared and 5 different courses can be had, the medical officers deciding on which the man is to \nhave\n be fed. Arrowroot, sago, custards, milk foods, sterilised milk, biscuits, cocoa, beef-tea, chicken, tapioca, rice and tinned fruits comprise the special diet list and they are in most cases prepared in the wards by orderlies only the ordinary diet being drawn from the kitchen. \n\nIn every other respect as well as those mentioned the ship is conducted and managed admirably, and Australians at home will be proud indeed when they see her returning with a batch of unfortunate wounded who have done their bit towards helping the Motherland at this critical juncture.\n","59":" -\n\nHard at work in ward F2 all day; drew from Quartermaster’s Store, mattresses & pillows and a gay old time our party had in dragging 182 of each article up steep steps. Finished for day at 4 pm and slept soundly throughout the night which was very mild and pleasant.\n","60":" -\n\nTo-day there was the same joy awaiting us below, for we ran and pushed and tugged at ward fittings from 9 am until 5 pm. I enjoyed the work nevertheless for with such chaps as I am mated with, one can work and be happy. Another concert held after tea it proving very enjoyable.\n","61":" -\n\nA beautiful day throughout & work proclaimed off, it being the Sabbath. Divine service held at 11 am, Major Patterson officiating.\n","62":" -\n\nThis morning was extremely cool and windy, sea being choppy in consequence. Innoculated against Dysentery & Cholera, not by compulsion but by choice, the possibilities of our developing these complaints being pointed out by our O.C. A debate was held, the subject being \"Is the pen mightier than the sword\", the \"for\" party scoring an easy victory over those \"against\".\n","63":" -\n\nContrary to yesterday to-day was again fine and warm. Changed from F2 to E6 ward, but still on cleaning although the latter was clean in comparison to that from which I came. Another debate held, the subject being \"Should America declare war on Germany\" \nand\n the discussions on either side being interesting, and the voting resulting in a win for the \"Aye\" party by 3 votes only.\n","64":" -\n\nFine and cool all day. Working in ward E5 & 6 under Sister Morphett. Slept on deck again.\n","65":" -\n\nStill fine but very warm all day, and night on the contrary, cold. The work to-day was not so severe as the wards are almost ready for the admission of patients. We anticipate finishing to-morrow.\n","66":" -\n\nCompleted the preliminary work early and at 4 pm an inspection of the ship was made by the O.C. who expressed much pleasure and satisfaction at the way things were. After tea a first class concert was held on the well deck.\n","67":" -\n\nAs all was ready, to-day was an off one for us and we spent it on deck. Sighted land at 1 pm and at 3 pm anchored in the harbour of Alexandria; several other hospital ships being also there. Colonel & Adjutant went ashore, we men awaiting their return eagerly\n\nfor 3 reasons; 1stly for our mail, 2ndly to learn where our destination was to be and 3rdly, if leave was to be granted us. Slept on deck, night being glorious.\n","68":" -\n\nFine all day. Divine service in morning and at 11 am, I, along with Reg, Bob, Nick & Jack went ashore on leave until 5 pm. Spent a pleasant day, though I think Alexandria a dirty & uninviting place. \n\nA large camp occupied by the Australian Ammunition Column & another, where an Infantry brigade was encamped were paid a flying visit.\n\nSuch a dreary waste of desert surrounds the town; the smells arising from the native quarters and the dirty customs of the race make the place in my opinion loathsome, although there are fine gardens in the European quarters which are fairly extensive. \n\nVisited the famous Catacombs which contain mummies dating thousands of years back, but I think that this is the only place of interest throughout.\n\nAt 5-30 pm upon our return, and inspection of the ship was made by the chief medical officer then in the town who expressed appreciation at the appearance of our boat. Slept on deck again.\n","69":" -\n\nA happy day was to-day for we received our first mail from Australia. Owing to the letters\n\nhaving accumulated we each received a fair number and our boys were intensely pleased; in fact high jinks commenced and lasted all day & practically all night. \n\nI was on leave from 6 pm until 11-30 pm and we had scratch races on donkeys which was just to our liking after our tedious trip. \nand\n We finished with a cruise around the harbour at 11 pm in a large sailing boat, 12 of us having a night which I enjoyed immensely. \n\nNight perfect so we were up on deck again, reveille not sounding until 8 am on\n","70":" -\n\nBoat coaled to-day & a fine mess was made everywhere. \n\nFortunately we obtained leave at night, when, it appears, that life in Eastern cities is gayest. This is so, for we witnessed, hilarity in it’s highest degree at the wonderful Casino which is here. I like this place better to-day, somehow, and I found the customs of the natives very interesting indeed, but I did dislike the dozens of goats which wander the streets, especially the enormous one which I fell over into the shop of an old Allah who feared that a hostile invasion was night and who abused us freely.\n","71":" -\n\nStill gloriously fine and after giving the wards another freshen up, we, at 4 pm went ashore\n\nagain. \n\nIn an open carriage, built about 1500AD, 6 of us drove around the outer portion of the city for 2 hours, seeing anything that was to be seen. The natives here are great rogues and one has to be careful of his purse and his person as well, especially at night. Went to another music hall which began at the peculiar hour of 10 pm and finished at 12 pm when a supper was served for 1\/-; we had a good shilling’s worth, enjoying the show immensely. \n\nArrived on board at 1-30 am, on\n","72":" -\n\nWork begain in earnest to-day, for at 9 am the wounded began to arrive, some by train and others by ambulance. \n\nAt 5-30 pm, 292 men were aboard most of the cases being serious ones and all cot patients. Dysentery & cholera seems to have laid low a great number of chaps and the cases in E2 were most unpleasant, whilst E4 had the amputation cases, which, I, as night orderly had to attend to. Began duty at 9 pm with Sister Matthews and was busy all night. \n\nThe men were exceptionally restless, and, having been upset by the travelling, the lights were alight all night whilst the wounds were being freshly dressed. I saw to-night what some chaps have to contend with when they are wounded, and though\n\nat first, the sights disclosed upon the bandages being removed were to me repulsive. I was glad to know that I was in the ward where the sufferers were and I felt as though one could not do enough to relieve these poor beggars who could not help themselves. \n\nWhen 7 am arrived and, with it, the day staff, I was as tired as I have ever been, but I was satisfied in my weariness and went off to bed at 8 am on\n","73":" -\n\nSlept well all day, although it seemed strange doing so. \n\nWhen at 9 pm I went on duty again a stiff breeze was blowing and the sea rough, so, by midnight I was sprinting in great style as 50% of the patients were seasick in addition to their other complaints. One chap became delirious at 1 am and the doctor was summoned, he, pronouncing the case a serious one which needed close attention. Hourly temperatures were to be taken & spongings also, so I had a busy night again, few of the others sleeping well. \n\nRelieved at 7 am on\n","74":" -\n\nSlept well, being very tired. \n\nOn duty again at 9 pm, but, fortunately to-night was far easier than the previous one. I was very pleased at being able to attend when the wounds were being dressed for it was interesting indeed to see the numerous & various effects\n\nworked by the injections and applications which so relieve the sufferers, though the actual process of dressing is very painful to the patients concerned. \n\nIn this ward were 4 leg and 5 arm amputation cases, fresh ones, where the stump required the constant application of sterilised lints, and, it was in these cases that we had to exercise the utmost care when handling the instruments necessary for to perform the dressing. The necessity of using the hands for nothing instead of everything was at first an awkward problem, but it did not take long to become acquainted with the tongs and forceps which are used to handle everything concerned. \n\nThe night passed quickly, and, as usual I was relieved sharp at 7 am my old legs being very weary especially around the knees.\n","75":" -\n\nSlept well throughout the morning and in the afternoon until 3 pm when I had an appointment with the dentist with whom I was for 1 hour. \n\nAt 4 pm we drew in to St Paul’s Bay at Malta passing two other British Hospital Ships. As there was no vacant berth we were forced to lie off all night. Work was easier whilst I was on duty as the ship was stationery & the patients sleeping well. \n\nRelieved at 6 am, when, \n\nwe moved alongside the pier in the inner harbour\n","76":" -\n\nA perfect day, on which I slept but little. \n\nMalta, from what I saw of it, is a barren yet interesting place, very hilly and swept by strong winds. Its race, the Maltese, are far superior in all matters to the Egyptians, their habits and habitations being close in resemblance to those of the European. We were not disappointed in our anticipations by seeing a large number of cruisers & gunboats here, the latter being, so I believe, engaged in patrol work. \n\nTook aboard 180 men, 90% of whom were walking cases fortunately. None were admitted to the ward in which I am stationed so no difference was made in my duty at night. \n\nHaving sailed immediately upon the reception of the patients, we were at sea by 9 pm and if ever a wind blew with the intention of discomforting bad sailers, we caught it, with a vengeance, for, by midnight the old ship was tossing in a most distracting manner, upsetting crockery, chairs, \nan\n orderlies and patients alike in no time. When however at 7 am I was relieved all was normal again and smiles reappeared.\n","77":" -\n\nFine & cool all day thereby enabling me to sleep well. \n\nNothing exceptional occurred through-\n\nout the night which was a pleasant one.\n","78":" -\n\nCool again with a severe breeze blowing which had by night worked up a choppy sea. Again we experienced the antics of this ship, for she slid & rolled with great gusto, upsetting some of our boys again. I was fortunately splendid & went through the night without anything of note occurring.\n","79":" -\n\nA fateful day for us orderlies. Almost directly after dinner 50% of our chaps complained of pains in stomach and by 5 pm some of the cases were serious enough to warrant medical attention. \n\nI was fortunately OK at tea-time and paraded for duty at 9 pm, as usual. By 2 am however, Louis was also smitten and I passed very miserable hours until 7 am when I took worse. Capt attended me and I partook of luscious castor oil & . I had a gay morn & a still gayer afternoon, though, I am sorry to say that the condition of others, worse than I, occasioned some alarm to the O.C. who personally attended them. \n\nOff duty to-night, though I slept poorly.\n","80":" -\n\nCool again & I, still very far from well. \n\nA patient who had died during the night from general weakness following dysentery was buried at\n\n11 am, though all I heard of the proceedings was the sounding of the Last Post. \n\nCapt Johnston visited me again & declared that I was not to go on duty again that night. By morning however I was much better.\n","81":" -\n\nFine & cool, with a severe breeze blowing all day. \n\nSlept well, and, feeling OK by 9 pm, I paraded for duty. All serene until 2 am when a S.O.S call for help was received from a steamer which had gone ashore on the Portuguese coast, some 60 miles behind us. \n\nOur ship immediately turned and at 6 am through a drizzling rain we could discern, lying high upon the rocks of the mainland, a large, up-to-date steamer, whose appearance was similar to that of our own ship. She had been firing rockets and flashing wireless calls but we were the only receipients of such messages, and, consequently the task of rescuing the unfortunate passengers fell upon the captain & officers of our vessel.\n\nTheir boats, four in number, put off in a heavy sea and after a laborious struggle \nthey\n their occupants were brought alongside and hoisted aboard in baskets. Those rescued totalled 29, 12 being women, 12 children & the remainder, men. They were very upset, one and all after such a trying\n\nexperience and were grateful of the welcome extended them by our O.C. & the stewards & stewardesses aboard. As the crew & captain remained on the stranded vessel (which was the \"SS Highland Warrior\" of the Nelson line) \nstayed aboard her\n, we departed at 1 pm on\n","82":" -\n\nA glorious day, on which, at 5 pm, I was subject to a further attack of the violent pains which I had considered myself free from by this. I was by 9 pm, however, considerably better and therefore resumed duty in the ward, nothing of note occurring during the night.\n","83":" -\n\nCold & windy all day. Slept well throughout, and, as usual went on duty again at 9 pm. Busy all night preparing men for disembarking which was to begin early, not being relieved until 8 am.\n","84":" -\n\nCame alongside wharf at 8-30 am at Southampton, and, at 9 am, the hospital trains being ready at the Station and the R.A.M.C. orderlies in attendance the landing of patients began. By 12 am the ship was free from them and the wards clean, so leave was given us until 11 pm. \n\nWent to the Common in the afternoon and after tea to a concert at the Rest Camp close by.\n","85":" -\n\nCool all day and particularly so at night. \n\nWent to Bitterne by car in the afternoon and\n\nafter having tea there, we visited the Palace Theatre where a good programme was presented. Upon our return to the ship the good news was received that extensive leave was to begin on the morrow & accordingly we decided that London should be our destination.\n","86":" -\n\nUp bright and early. \n\nPaid and caught the 11 am train from the Dock Station along with Reg, Bob, Nick & Mac. Arrived at Waterloo at 1-30 pm & went to the YMCA where we booked a large room for us alone. \n\nAfter lunch walked to Westminster Abbey again, St Pauls Cathedral and to Picadilly Circus where, as before, the traffic was astounding. Had a sumptuous but very expensive tea and went to the Shaftesbury Theatre where \"Madame Butterfly\" was given in English. The singing was glorious and I enjoyed the performance immensely.\n","87":" -\n\nEarly, before breakfast we took a taxi & had a spin around Hyde Park which is a favourite driving place at such a time, back at YMCA at 8 am. Had breakfast and afterwards went to the famous Bank of England, the Commonwealth Offices and Charing Cross where the head tube station is. Came to Tottenham Court by tube and walked home from\n\nthere. \n\nWent after tea to a \nnew\n revue \"Push & Go\" which was wonderfully staged at the Palace Theatre. London playhouses are enormous in comparison to ours & this one was most lavishly decorated inside. \n\nAfter the show, just \nfor\n to see what the theatre suppers are, we went to Claridges which is perhaps the most noted Cafe in the city and here we had a supper, which was wonderfully served and as extensive in it’s courses as a midday dinner would be. The bill was in keeping with the place and just as alarming so we have decided not to venture there for some time yet, to come.\n","88":" -\n\nFine & very cool all day.\n\nCaught the 10 am train to Epsom, where at the famous Grandstand Hospital I saw the brother of my chum, Leo Drinkwater. He was doing splendidly & recovering from a severe wound which had kept him in bed 13 weeks. \n\nEpsom is a pretty place, very picturesque and it’s racecourse wonderful. The Grandstand & the King’s own stand have both been converted into hospitals and they are kept in splendid condition.\n\nBack at Waterloo at 6 pm and with Reg, after tea witnessed a performance of \"Romance\" a pretty piece staged at the \"Prince of Wales\" theatre. Night wet, dismal & very cold.\n\nAfter dinner we went by bus to the beautiful Hampton Court where the most beautiful gardens are. The beds are glorious and the old Court or palace intensely interesting; in fact I enjoyed this place better than any which I had previously visited. Came back to Putney by car & then caught the river steamer to Westminster. \n\nAfter tea we went to service at the Abbey, the singing of the choiristers being enjoyable and pleasing.\n","89":" -\n\nWalked the length of Oxford Street where there are some wonderful shops and from there to Regent Street which is likewise. \n\nAfter dinner went by taxi to Clapham Junction where there is a fine park and Industrial School. Visited, whilst there, the","90":" London General hospital which contained about 2000 patients including 100 Australians. Came back by train and went from Waterloo to the Ivanhoe Hotel where I saw my friend Miss Morehead who was staying there. \n\nHad an early tea and caught the 8 pm train to Southampton Dock Station where we arrived at 11 pm. In travelling to the ship from here, a wheel came off our go-cart & a great smash up occurred, the 6 of us being violently pitched out, though all escaped unhurt. Needless to say, we walked the rest of the way after helping the driver to take out his horses from the wreck. \n\nArrived on board 1 am on\n","91":" -\n\nA glorious day and free again were we.\n\nCaught the 10 am train to Winchester which lies 24 miles away. Visited the wonderful Cathedral there and also the hill where, history tells, Alfred the Great first listened to the readings of the Bible. Winchester abounds with places of interest and it’s buildings and houses are quaint and very very ancient. \n\nAt 3 pm, having been invited, we went to the Uplands hospital containing only 19 beds, which\n\nis under the charge of an Australian sister to whom I have since written. Of all the delightful houses I did not see one to surpass this one. \n\nIt was originally the residence of a wealthy Englishman who vacated it with his wife, and presented it with it’s cost of upkeep to the British Govt. for use by wounded Tommies. The grounds surrounding the house are delightfully laid out and it is maintained sumptuously; we were fortunate in meeting Mrs Hurst who is the wife of the donor and she entertained us to tea at her new residence which is close at hand. \n\nLeft at 6 pm, and, after tea attended the second performance of the show at the Palace Theatre, commencing at 8-45 pm.\n","92":" -\n\nWent to the baths soon after breakfast and enjoyed the dip immensely.\n\nAt 12-30 pm, 3 of us caught the river steamer to Cowes on the Isle of Wight, which is a famous holiday resort. On this Isle are the magnificent homes of many of the English nobility and the place Cowes is a veritable paradise. A fine promenade extends around one front for 2 miles and when the regatta is held each year it is the parading place of the genuine Aristocracy who are generally in residence there when this event takes place. Visited the old home of Queen Victoria and caught the 6 pm steamer back.\n\nWent to bed early to-night as we were very tired. Slept on deck.\n","93":" -\n\nAnother beautiful day, cool and mild. \n\nBeing still on leave we took train at 9 am to Lyndhurst Road, which is in the centre of the New Forest district. From the station we went by motor along a perfectly made road for 6 miles until the village of New Forest was reached. Here we left the car and spent the rest of the day in rambling around this glorious forest. \n\nIn history it is famous as the retreat of Robin Hood & his gang, the church containing a fine painting of the afore-mentioned and his comrade Friar Tuck. The trees are in this district, of every conceivable green and the farm houses very picturesque; we had lunch at one and enjoyed it immensely. After dinner we saw a pack of hounds used for the hunt, numbering 120; they were the property of a Lord whose home stood in the centre of the forest, and the sight was a very pretty one as they stood or lay on the green in front of the inn which is in the village.\n\nAt 5 pm we had a stroke of luck, for a motorist passing invited us to join him and he kindly drove us back to Southampton, the trip being a fine one. \n\nA concert was held on board at 8 pm and the items, all good.\n","94":" -\n\nWent, early after breakfast to the baths and from there to the Common where we had a pleasant stroll. \n\nAfter lunch we walked to Itchen, an outlying suburb and took\n\ntrain to Netley: Visited the ruined Abbey and the hospital again, seeing the Australians who were patients therein. \n\nReturned at 6 pm, had tea and went afterwards to the Hippodrome where a good show was presented.\n","95":" - \n\nCool to-day and dull throughout. \n\nDuring the morning we went by car to Bitterne and in the afternoon to Swathyling which is reached by train. On arrival here we walked to Eastleigh where we were shown over a large Remount Depot by a Melbourne Captain, named who was off to France shortly afterwards. The visit to his camp was interesting and he generously entertained us to tea. \n\nLeft at 7 pm and upon reaching Southampton we accompanied some ladies to a concert & dance on the pier. \n\nSlept below as night was very cool.\n","96":" -\n\nDull again but without rain.\n\nWent to the baths in the morning and to Lyndhurst again in the afternoon, visiting the forests and river which flows through the same. Walked from here to Brockenhurst where we took train back to Southampton arriving at 8 pm.\n","97":" -\n\nColdest day experienced and very dull. As we anticipated sailing on the morrow we were detailed for ward duties for the morning, I being sent to E6. Upon finishing the cleaning and having the\n\nafternoon free, Reg, Bob, Nick & I went again to Netley to the hospital. \n\nReturned early, and, went after tea to the Palace Theatre where a piece \"Kings & Queens\" was staged. The performance was enjoyable and we finished up with a midnight supper at the \"Grosvenor\" arriving on board at 1 am.\n","98":" -\n\nLeave stopped and therefore ward duties began again.\n\nSailed at 4 pm, having aboard, only 10 officers, 1 nurse & 6 men, the latter coming from Weymouth depot. This turn of events was a surprise for we anticipated leaving with a full ship but it was announced that the rest were to be taken on at Malta, so we had the prospects of an easy trip until this place was reached.\n\nNight cool but calm and sea smooth.\n","99":" -\n\nCool still and very windy.\n\nOn ward D1 where the officers were situated and busy all day as the meal getting is a big item for men of rank. \n\nRelieved at 5 pm and went to bed soon after tea. During the night sea became very choppy and a number of the boys heaved to again. I was fortunately OK.\n","100":" -\n\nCool and very windy all day. On duty in D1 again throughout the day. Sister Treyhearne operated on for appendicitis. Slept on deck the wind easing after tea.\n","101":" -\n\nTwenty-one to-day and feeling absolutely splendid. \n\nThe weather was perfect and the change a welcome one. Being relieved from Ward there was little to do, so the day was spent on deck. \n\nWe passed Gibraltar about midnight, the night fine and warm.\n","102":" -\n\nAgain, to our dismay it was cold & windy. \n\nOn duty in F2, cleaning, for morning only, the afternoon being free. A debate, on \"Should sport be abolished during the war\" was held after tea and the arguments on both sides good & convincing. The Aye party, however, won.\n","103":" -\n\nSunny and warm to-day. Divine service on well deck at 10 am & 7 pm and nothing done between.\n","104":" -\n\nFinished to-day the preparations in F2 for the reception of patients on the morrow at Malta. A fine concert was held after tea every item being enjoyable.\n","105":" -\n\nSighted Malta at 7 am, and, whilst making our way to the inner harbour at 10 am an alarming incident occurred. \n\nAt 9-45 am several destroyers were sighted, and one came close enough to us for to pass a message to our captain. She had just turned to leave us when her guns fired (2) and almost simultaneously a gun on shore also spoke. The shells were fired into the water about ¼ mile off and the destroyer immediately rushed cross the\n\nVery spot where the shots were aimed at. \n\nWe attributed the disturbance to a submarine and were not incorrect in our surmises for we were informed that submarines had been lurking in the vicinity of late. In the harbour were also 2 transports laden with Territorials who had been aboard ready to sail for 2 days, so it seems as if they had not set out, fearing that they should be torpedoed. \n\nAt Malta, we were at 11 am allowed ashore until 4 pm & we had a hasty look around the town of Valetta. By far the most glorious piece of decorative work that I have seen is the interior of the \"Chapel of St John\" in the town. It is sumptuously decorated throughout, many of the wall panels being painted by the famous Michael Angelo. Whilst the domed ceiling is magnificent, Valetta, I thought rather dirty but far superior to Alexandria, it’s streets are however full of steps, and it’s shops mostly full of beautiful lace made on the island. \n\nWe sailed at 5 pm sharp, two of our boys having missed us (Burke & Childs). Whatever became of them I do not know; they were aware of what time we sailed & as the ship could not be kept they were left behind. Our O.C. anticipates that they will be sent to one of the hospitals there until our return.\n\nPrior to sailing we received 20 patients; ten were\n\ncot and ten walking cases, so here again our anticipations were upset, leaving us still practically empty until we reach Port Said which is our next port of call.\n","106":" -\n\nA fearfully windy day during which rain fell heavily at times making it almost impossible to stay on deck for any length of time. \n\nOn ward duty in the morning but off for afternoon and night; the latter fortunately was perfect after 8 pm when the rain cleared off suddenly.\n","107":" -\n\nA glorious day throughout. Ship travelled at a great pace all day in perfectly smooth waters. Slept on deck.\n","108":" -\n\nSimilar to the previous day, it being perfect. On ward duties all day but not very busy.\n","109":" -\n\nArrived at Port Said at 7 am, the morning being fine & clear. Took aboard 30 convalescent patients all of whom were sent to Wards F1 & 2. \n\nSailed at 1 pm and at 1-15 pm we entered the famous Canal in which were passed several large steamers. \n\nAt 11 pm we anchored in the salt lake and remained there until 5 am as our ship had no headlight.\n","110":" -\n\nSailed on at 5 am & at 12 o’clock we arrived at Suez where we cast anchor. \n\nDivine Service in morning and at 2 pm a joyous event took place for our mail was received; 47 letters was my lot along with a dozen papers & the boys were in wild delight for the rest of the day.\n","111":" -\n\nWarm & fine all day. Our boat laid out in the stream no berth being available for her to proceed to. A splendid concert was held on the boat deck after tea. \n\nSlept on deck the night being perfect.\n","112":" -\n\nHot to-day & absolutely no breeze. \n\nA party of doctors & nurses from a large Indian Hospital ship visited our boat in the\n\nMorning and a party from shore also. \n\nSlept on deck, night being very close.\n","113":" -\n\nExceedingly hot all day.\n\nMoved from mid-stream to a wharf at 10 am, and, shortly after 1 pm the first trainload of patients arrived. At 4 pm the 2nd batch came aboard, practically all these being walking cases, the men in many instances having contracted fever in Egypt and therefore they had never been to the front.\n\nWard D1, was filled with the most serious cases, most of the amputation cases being here admitted. In E1 & 2 some severe dysentery cases were taken along with a few isolated enteric patients and 2 others who had been operated upon for an appendicitis whilst in Egypt. \n\nRemained alongside wharf all night which was very close and muggy.\n","114":" -\n\nLeft Suez at 9 am sharp & lost sight of the land at 10-30 am. On duty in E3 all day there\n\nbeing plenty to do. Slept on deck again after a busy day. \n\nThis trip will be different from the preceding one as nearly all the chaps in our ward can wash and care for themselves. Only 3 cases require wet dressings and two, dry. I am doing thee and enjoy it finely. One is a head wound, the patient’s head being shaved to enable keeping the cut clean and the process of dressing is more painful to him than to either of the other two who are suffering from shrapnel wounds in the leg.\n\nWe have 27 to care for but they are all fine chaps and will not cause much worry I am sure, partly, I suppose, because they are all so delighted at going home that they are easily pleased.\n","115":" -\n\nOur first in the Red Sea and a scorcher at that. I am glad that our ward is so cool for the chaps below sweated all day & work I know, is not pleasant under such circumstances. \n\nSlept on deck.\n","116":" -\n\nHot in the extremes & work made very uncomfortable. We perspired freely all day but fortunately there was not a great deal to do so we did not feel it as some of the others did. \n\nOff duty from 5 pm for the night which was fearfully close and thereby preventing us from sleeping soundly.\n","117":" -\n\nStill unbearably close and therefore some of our cases required extra attention which made the day a busy one. \n\nIn addition, one of our leg patients was operated upon and I was selected to attend him in the operating theatre. A small piece of bone was successfully extracted, our O.C. performing the extraction which took 17 minutes. He came to in the ward about 1 hour after & was remarkably well by night time, although, of course his leg was sore and painful if it were moved.\n","118":" -\n\nTo-day, fortunately was decidedly cooler and the sea like glass so smooth was it. \n\nOff from 5 pm and at 7 o’clock another concert was held on the boat deck each item being appreciated by the large audience.\n","119":" -\n\nA glorious day and the sea like glass so calm was it – Passed an Orient liner at 11 am bound west. \n\nAnother patient in our ward was operated up during the afternoon for appendicitis. \n\nThe operation which was performed by Captain Johnston, was successful, and, not a very severe one. Before leaving at 9 pm the chap was out of the Anaesthetic and doing well.\n\nSlept on deck again.\n","120":" -\n\nSame as the previous day but a little warmer. \n\nOn duty in F2 to-day a transfer having been made all round. After tea I was off for the evening as\n\nthere are no permanent cot cases in this ward. It will mean easier times for us & not so much running about as was necessary in E3.\n","121":" -\n\nDecidely cooler to-day, ship covering 340 miles. Towards evening several sharp showers of rain fell and kept us below for the night. \n\nIn F2 to-day I dressed & attended to 5 eye cases and one with a side which requires fomentations twice daily. The eye patients, all, singularly enough have completely lost the sight of the right eye, one having received a bullet through the cheek which deflected upwards causing the damage, another, a bayonet through it, and a third lost his through a bomb bursting in his hand prior to his throwing it. The latter also lost two of his fingers so he is sadly maimed. \n\nI like the work of attending to these chaps & they are all in great spirits despite their misfortune.\n\nIn one case only is the whole eye not removed; this eye to one glancing casually at it appears normal but the sight has completely gone nevertheless, the patient having an ugly wound above it which takes careful probing when the sterilised lint is being thrust into it during the dressing process. The chap whose side is bad received a bullet in it, which,\n\nin passing through fractured 2 ribs. He is however nearly OK and is coming home on furlogh only. All dressings are done twice every day, at 10 am and 7 pm and at the morning one all wet packs are applied whilst those at 7 pm are always dry. \n\nShip is now travelling very quickly, though at any time she travels much faster at night than during the day.\n","122":" -\n\nTo-day in a calm sea 321 miles were covered. Although the day was glorious at 7 pm a storm overtook us and rain fell heavily preventing us from sleeping above.\n","123":" -\n\nOn duty as usual all day nothing unusual taking place. More rain fell at dusk but it soon cleared off and the night was pleasantly cool.\n","124":"\n\nDivine service on boat deck at 10 am & 7 pm, Captain Patterson officiating. \n\nThe day was a perfect one & the pleasant announcement made that leave would be given us at Colombo where we were due on the morrow.\n","125":" -\n\nSighted land at 6 am, and, at 10-30 am we were anchored in the harbour alongside an English Cruiser. \n\nAt 11 am leave began for staff and patients I being amongst the first off. Spent a pleasant day until 7 pm in seeing the town which is very quaint & interesting. \n\nWent by carriage, having hired a guide to Mt Lavinia where there\n\nare beautiful and extensive cinnamon gardens. \n\nThe trees & plants in the public gardens are glorious and comprise almost every kind of tree growing, even two Australian gums growing therein. In the English quarter are the very pretty bungalow residences built on piles and painted a bright colour, each having an extensive verandah encircling the house which is delightfully cool looking.\n\nThe Cingalese are a superior coloured race and they speak fluent English, whilst their quarters are very clean and almost European in appearance. \n\nWe visited the City Temple and were taken around the outer town in rickshaws which are remarkably cheap for hire, ours costing us ½ each for 2 hours. During the day a sharp shower fell as is customary at this period of the year, but, an hour afterwards all traces had vanished as the moisture dries quickly under the Equatorial Sun. \n\nThe patients ashore were treated royally by the English residents who entertained them with motor rides and luncheon at their homes many of which are beautiful indeed. \n\nBack on board at 7 pm and at 10 pm a storm broke, rain falling heavily during the night.\n","126":" -\n\nFine again but very warm. On ward duty all day. Left at 1 pm and encountered a severe storm\n\nwhich abated at about 8 pm. Night cool.\n","127":" -\n\nA glorious day covering 322 miles. Slept on deck night being very close. On ward duty as usual.\n","128":" -\n\nFine again but very warm. Crossed the Equator at 3 pm, ship covering 335 miles during the day. On duty in ward as usual, doing dressings with sister and other customary jobs. Slept on deck night being perfect.\n","129":" - \n\nClose but fine all day. At 7 pm heavy rain fell though by 10 o’clock the sky had cleared again. Slept on deck under cover.\n","130":" - \n\nOn ward duty in F2 all day doing the usual dressings etc. The day was cool and very windy and in consequence the ship dipped a great deal making some of our boys and patients sick for a while.\n","131":" -\n\nA breezy but pleasant day. \n\nDivine service at 10 am on boat deck Major Patterson officiating. \n\nAt 3 pm Ross Island which is one of the Cocos group where the \"Emden\" was destroyed, was sighted. Nothing of interest could be seen ashore although our ship received wireless news on Current events from a station situated thereon.\n","132":" -\n\nCool all day & beautifully fine. Still on ward duties nothing unusual occurring.\n","133":" -\n\nA very breezy day which caused the same\n\nold batch of poor sailors aboard, sick again. \n\nA Concert was held on the main deck at 7 pm which passed off splendidly.\n","134":" -\n\nCool & fine again to-day. On dressings as per usual in morning, off duty for afternoon until 5 pm. Slept on deck as night was pleasantly cool.\n","135":" -\n\nBoat covered 340 miles to-day which is a fine run for her. Slept on deck after an uneventful day.\n","136":" -\n\nAn absolutely perfect day. Sighted Rottnest Island at 4 pm and at 7 pm anchored in Fremantle Harbour, the evening being truly glorious. \n\nAt 9 pm a steamer conveying a party of representative Fremantle citizens came aboard & entertained us with a concert & refreshments. \n\nWe were all highly delighted to be back in dear old Australia & our boys had high jinks at bedtime, retiring at midnight & not before.\n","137":" -\n\nAnother glorious day. \n\nAt 10 am the Western Australian lads numbering about 30 were taken off and were cheered vociferously upon leaving. \n\nAt 10-30 am a party of W.A. ladies came aboard and again entertained the patients to a concert & refreshments and a first rate spread was given them.\n\nLeft at 4 pm & on steaming out passed the \"Ourah\" with whose passengers we exchanged greetings.\n\nSlept on deck, night cool & windy.\n","138":" -\n\nA cold and bleak day with a strong head-blowing. Ship hugged the coast all day, it being, along with objects ashore, plainly visible. \n\nDivine service held in morning and also afternoon. \n\nSlept above in night.\n","139":" -\n\nExtremely cold and still windy. \n\nOn ward duties all day as usual. \n\nThe night was the coldest that we had experienced so far and it seemed hard to realise that Australia was having her summer then.\n","140":" -\n\nStill cold & windy. \n\nPassed the Orient liner \"Orontes\" at 8 am bound west. \n\nOff duty for the afternoon, but on again at night.\n","141":" -\n\nA cool but pleasant day. \n\nPassed Kangaroo Island which lies at the mouth of Spencers Gulf at 10 am. \n\nAt 4 pm, having arrived at Semaphore we anchored and prepared the S.A. men for disembarking. Owing to the lateness, however, this was postponed until next morning and consequently we laid in the stream all night.\n","142":" -\n\nAt 8 am this morning a tender came along side and the S.A. patients, numbering 80 were put aboard. Their departure was singularly enough of any noise and demonstration. Why, I still wonder, for I should have certainly liked to give them a cheer as they left us at 9-30 am.\n\n"}}