{"Document Name":{"0":"Diary_0172","1":"Diary_0172","2":"Diary_0172","3":"Diary_0172","4":"Diary_0172","5":"Diary_0172","6":"Diary_0172","7":"Diary_0172","8":"Diary_0172","9":"Diary_0172","10":"Diary_0172","11":"Diary_0172","12":"Diary_0172","13":"Diary_0172","14":"Diary_0172","15":"Diary_0172","16":"Diary_0172","17":"Diary_0172","18":"Diary_0172","19":"Diary_0172","20":"Diary_0172","21":"Diary_0172","22":"Diary_0172","23":"Diary_0172","24":"Diary_0172","25":"Diary_0172","26":"Diary_0172","27":"Diary_0172","28":"Diary_0172","29":"Diary_0172","30":"Diary_0172","31":"Diary_0172","32":"Diary_0172","33":"Diary_0172","34":"Diary_0172","35":"Diary_0172","36":"Diary_0172","37":"Diary_0172","38":"Diary_0172","39":"Diary_0172","40":"Diary_0172","41":"Diary_0172","42":"Diary_0172","43":"Diary_0172","44":"Diary_0172","45":"Diary_0172","46":"Diary_0172","47":"Diary_0172","48":"Diary_0172","49":"Diary_0172","50":"Diary_0172","51":"Diary_0172","52":"Diary_0172","53":"Diary_0172","54":"Diary_0172","55":"Diary_0172","56":"Diary_0172","57":"Diary_0172","58":"Diary_0172","59":"Diary_0172","60":"Diary_0172","61":"Diary_0172","62":"Diary_0172","63":"Diary_0172","64":"Diary_0172","65":"Diary_0172","66":"Diary_0172","67":"Diary_0172","68":"Diary_0172","69":"Diary_0172"},"Date":{"0":"unknown","1":1386.0,"2":1387.0,"3":1388.0,"4":1389.0,"5":1390.0,"6":1391.0,"7":1392.0,"8":1393.0,"9":1395.0,"10":1396.0,"11":1397.0,"12":1398.0,"13":1399.0,"14":1400.0,"15":1401.0,"16":1402.0,"17":1403.0,"18":1404.0,"19":1405.0,"20":1406.0,"21":1407.0,"22":1408.0,"23":1409.0,"24":1410.0,"25":1411.0,"26":1412.0,"27":1413.0,"28":1414.0,"29":1415.0,"30":1416.0,"31":1417.0,"32":1418.0,"33":1419.0,"34":1420.0,"35":1421.0,"36":1422.0,"37":1423.0,"38":1424.0,"39":1425.0,"40":1426.0,"41":1427.0,"42":1428.0,"43":1429.0,"44":1432.0,"45":1433.0,"46":1434.0,"47":1435.0,"48":1436.0,"49":1437.0,"50":1438.0,"51":1439.0,"52":1440.0,"53":1441.0,"54":1457.0,"55":1458.0,"56":1461.0,"57":1462.0,"58":1463.0,"59":1464.0,"60":1465.0,"61":1467.0,"62":1468.0,"63":1469.0,"64":1470.0,"65":1471.0,"66":1472.0,"67":1473.0,"68":1474.0,"69":1475.0},"Entry":{"0":"\n\n","1":"\n\nI start this new diary the 5th since enlistment with the prospect of another winter of warfare before me. We had hoped that the end would at least be in sight by now but various incidents unforseen have delayed the final victory. Russia`s collapse following the revolution at a time when we wanted her help to support our great offensive & Germany’s strategic retreat to the Hindenburg line had a great effect on our plans, how much we may never know. Our final victory however is as certain as ever.\n\nI arrived at the Dressing station this morning about 8 o’clock. We left Chateau & came up in a Ford passing through \"Ypres\" through the Menin Gate, the station being on the Menin Road. Ypres is a wonderful sight, a large town smashed level & it is still heavily shelled. The Square\n\nthrough which all traffic passes is heavily shelled & causes heavy casualties, the shells bursting with deadly effect on the cobbles. Guns are everywhere in the ruins, in fact guns are everywhere & the din is fearful at times. Right opposite our station 100 yds away is a particularly heavy howitzer & the noise & concussion something to remember. Guns of all sizes are around us & the traffic being heavy Fritz generally scores when he puts a shell over. We took over from the 3rd Fd amb & I went on to the Gas cases. The new gas, mustard, is very effective burning the skin as well as affecting the eyes etc. We have to take their clothes off with rubber gloves on & wearing our mask as the gas on their clothes is sufficient to gas the operator. They are then sprayed with a 5% Soda solution, the patients dressed in pyjamas & sent \n\noff to the Gas Hospital. We only had 11 cases through during the day. In wounded we had a good few both from the line & wounded nearby also several of our own bearers with two deaths amongst them. Only one shell actually threatened the A.D.S. dropping just across the road & throw earth all over the ruins & road. The A.D.S. itself is under the ruins of the building, in the cellar part which is reinforced with concrete, the men sleeping in various dugouts around. Aerial activity is very great several battles taking place in the air without result so far as I could see. The Hun appears to come over very freely & in the dusk the machine gun bullets being luminous can be seen quite plainly. one taube was brought down by Ani-Air-Craft guns last night.\n","2":" Had a heavy day & through not being called did not have time for breakfast. Put through about 50 Gas cases & felt a bit off colour at midday through having no breakfast. The afternoon was quieter and enabled me to get everything square. Wounded totalled something over 130 cases. Had very few shells over close to us & the guns were a shade more silent than the day before. Aircraft busy but nothing exciting as there was a thick haze on.\n","3":" A quiet day in regard to gas cases but busy in other respects. Fritz shelled our neighbourhood heavily & the road was blocked for some time. He caught an ambulance & set it on fire early in the morning & then continued shelling the same place catching about 8 motor lorries & several dumps besides blowing out several dugouts one of ours being included. Quite the majority of our cases came from this area, wounded from the line being comparatively few. He also put over a lot of shrapnel especially over Ypres, altogether it \n\nbeing a very hot morning only having10 gas cases through I helped with evacuations and unloading etc. Our gunfire on the quiet side. As I write this about 9 p.m. he has started again to put over some heavy stuff which is falling unpleasantly close. I still have to marvel at the way men can carry on under these conditions After a while the majority produce a kind of indifference to it all & move about freely while the shells are falling & see their comrades horribly mutilated in front of them. Some of the ambulance tyres show where they have been running through blood & yet it makes no difference, the majority just carry on. Our Colonel was wounded today & Major Metcalf & several of our bearers & a couple more killed, so many in fact that I have lost count.\n","4":" A very heavy day for all hands. Our artillery opened up at 5.45 A.M. & our fellows went over. Shortly after 8 the wounded began to come in\n\nwalking cases & others & it was a welcome sight to see German prisoners carrying in the wounded. A large number passed through wounded & otherwise & we made use of about 30 to help us handle the wounded. They worked splendidly almost to a standstill all the morning unloading cars & lorries & carrying the men along. only a couple of Gas cases so I was running the loading & unloading of patients & it was wonderful the way we were able to move the wounded. The arrangements were wonderful the M.A.C. officer & Sgt getting the cars up & handing them over to me to fill up. In a twinkling this would be done & another would take its place in an instant. This went on all the morning during which time Fritz shelled the place, the shells falling in two parallel lines on either side of the road not one actually hitting the road. Our water tank was punctured & one man wounded on the road during all this shelling. About two oclock whilst I was snatching a feed at the Cook house, a shell\n\nfell just outside & killed a fine little fellow a cook, working outside. Only the wall in between saved me & when the dust cleared I went out to look for the lad I found him lying face downwards one arm & one leg practically severed & other wounds. Two of us put him on a stretcher but he breathed his last as we did so & after showing him to an M.O. we carried him round to where the other dead were lying. This was our only casualty for the day, a remarkable thing as several times debris thrown up by shells fell over us. Am pleased to say that I did not know what nervousness was even after the Cookhouse incident, the work being sufficient to key one up to anything. The whole crowd worked wonderfully & not once was there a block altho’ only one road was available for the whole traffic. Things slackened up during the afternoon & a block in the road towards evening caused a hold up for\n\nhalf an hour. Saw several damaged guns go back also some lorries & caterpillars which had been knocked & burnt. Altogether a wonderful day, one to demonstrate our ferver & the wonder of our organisation. What the result of our \n\nhopover was we do not know yet for certain. The noise of the artillery was fearful.\n","5":" A much quieter day although we had a fair number of wounded through during the morning the night being much the same. Guns very quiet during the day but opened up on a counter attack of Fritz about 6 at night. Only had about 10 gas cases through & spent my time controlling the loading & unloading & forwarding dressings & supplies to the other posts.\n","6":" A very quiet day, perhaps because Fritz was readjusting his gun positions our advance being close on a mile. Very few wounded coming in\n\nmostly strays who were missed the previous day. About 6 p.m. he opened up & put several over one being very close to me a wall shielding me from the flying bricks etc. With one he hit the road about 50 yds from the D.Station & got 8, the others falling into soft ground without doing any damage.\n","7":" A busy day again. Several gas shells came over during the night with the result we had 38 cases through, all mustard gas which he is specialising on & it is very successful in putting men temporarily out of action. Wounded came through in a steady flow except in the afternoon when we had an inrush of cases from a bomb dropped from an aeroplane. Several Fritzes came over & dropped about 5 bombs, one landing less than 100yds from our possy another a few hundred yds down the street & this one fell amongst a body\n\nof men outside one of our Comforts fund places. Eighteen were killed outright and 26 were rushed up to us some with legs off the majority being fearfully mangled altogether 57 casualties came from that one bomb. He was also active with his shelling a lot of casualties being sustained in Ypres. The weather still very fine so expect another stunt in a few days but expect to be relieved before then. Three more of our bearers wounded today.\n","8":" Absolutely a beautiful day yet things were very hot in our neighbourhood. Shrapnel & H.E. came over especially along towards Hell Fire Corner where he caught a dump which burnt for hours. Wounded & gas cases were few nevertheless. We move out tomorrow.\n","9":" A very quiet day no gassed men coming through and few wounded. C Section marched out\n\ntoday but I remained back until next day when A & B Sections hand over. O.S. for the day. In the morning I went up to Birr Crossroads to collect stores & hand over the place to the 1st Field. Things were fairly quiet except for our Artillery but this section of the road is perhaps the most dangerous of any in this region. A tremendous amount of traffic is always on hand & it is lined with Ammunition dumps for the concealment of which is practically impossible. Hell Fire Corner perhaps the hottest part has a particularly bad reputation, rarely a day goes by without casualties occurring here & dead horses and smashed waggons with the remains of exploded & burnt out dumps line the road. I have known days when the casualties from this section of the road exceeded those from the line & yet the stream of traffic carries on. Our guns are so numerous that concealment is impossible, they simply lie in the open with camouflage netting over\n\nthem & during a bombardment or barrage the din is deafening. The ammunition dumps are generally set alight by incendiary shells & the spectacle although grand is fearful, the flames creep around the shells & one by one they explode & destroy everything nearby. Gas shells play an important part especially with artillery, the new mustard gas being very effective & yet more humane than Phosgene. It burns the flesh even when the respirator protects the throat & eyes & having practically no smell men are often gassed without knowing it especially if they use a dugout which had previously been gassed. Time & again I have seen men report from battery for several days in succession having been gassed from the same source. Very few of the Field units escape casualties now-a-days, the back areas being shelled and bomb dropping increasing daily. Even when men are relieved from the line unless taken well back they are harassed\n\nby bombs etc so that daily the strain on men is becoming greater. Motor lorries in this area have suffered fairly heavily on this particular road they go to within 3 or 4 miles of the line & I have known 8 to be destroyed together. Last night was bright moonlight & several bombs were dropped especially round the camp. Of course the planes were fired at the luminous \"tracer\" bullets from the machine guns being a pretty sight. Early this morning there was a heavy bombardment & now as I write this our guns have opened up on Fritz & are shelling him heavily. It looks as if the crowd relieving us tomorrow will have a hopover which is a good sign & if it is as successful as ours we will be doing very well. I don’t envy the hun these times.\n","10":" We were relieved today. The 6th took over at 10 A.M. and we went by bus to Devonshire Camp about 5 miles back and what a relief it was\n\nThings fairly quiet as we left. Arrived at the camp just before lunch but managed to have a sponge over and change of underclothing first & my word what a relief it was. I felt a new man being further stimulated by the receipt of a large mail. Walked into Reninghelst at night.\n","11":" Had a day of rest & it was much appreciated. Managed to write a few letters owing a long time. Disturbed at night by guns posted near firing at aircraft.\n","12":" Did my washing & packed up most of my curios for the post, also went through my panniers etc & got things square again, they being all mixed up with A Section gear. At midday word came that B & C sections tent subdivision had to report to No. 3 Canadian & No 17 British C.C.S. for duty so we packed up & reported about 6 p.m. B to the Canadians C to the British\n\nI was put in charge of evacuations at night and had a fairly busy time but had a man to show me the ropes. Had a good supper at midnight in the Cookhouse my friend being good with the Cook. It rained during our march down & made things very uncomfortable & cold & may interfere with the stunt which is on. They hopped the bags this morning & reports are very glowing.\n\nFriday night & Saturday morning","13":" &","14":" Slept all day Friday & slept well & started again at 8 P.M. but found practically nothing to do. Practically all the patients had been cleared out & very few were coming in, however I made the rounds collected the figures of those marked for evacuation as well as those of the other C.C.S.’s & found that there were not enough to fill a train so that they will wait until\n\ndaylight. Wrote some letters during the night alongside a heater as ‘tis very cold.\n","15":" morning","16":" Bitterly cold. Very few patients coming in so my job is practically nil, the result being I spend all my time in the Cookhouse the warmest & most comfortable place in the camp. I am also good friends with the Cook a very valuable asset. Walked into Poperinghe before going to bed yesterday. Before leaving for this place our Adjutant Major Close called me up to say a few words. He said I want to thank you for the good work you did during the stunt, it relieved us of a good deal of work & worry etc. etc. – very gratifying as I had worked hard but did not think so much as to be noticeable. Before going in they had the wind up about the gas & \n\ntold off a Major to look after it specially but by my work I apparently saved that & also the handling of the patients on the day of the rush, a job I always take to.\n","17":" Had an ambulance train to load at midnight my contribution being 82 stretcher cases and 102 walkers which I loaded in one hour, my predecessor had previously told me that 42 stretchers for him was the average and 52 the record so my effort was an attempt to beat his, a little of the right kind of hustle doing the trick. Retired to the Cookhouse & dined on pie, a beauty & a rare dish in the army. Weather bitterly cold. A stunt in view all medical arrangements having been made.\n","18":" Had one train to load during the night but I only put 20 stretchers and 162 walkers. The stunt apparently checked by the weather as more Amb. Trains have arrived but we\n\nhave no cases to load up. Cavalry have moved up, some Indian medical services being attached to deal with their own men. Weather bitterly cold, more rain in evidence. The hopovers we have been concerned in have yielded 9000 prisoners, & 50,000 huns, are calculated to have been put out of action, also commanding positions on ridges have been gained, a very successful effort.\n\nThursday night","19":" Another hopover going on, this one the French also taking part in but the weather is awful, cold, wind, & rain. Had a quiet night only one train being loaded our complement being 40 stretchers only. It looks as if further movement on our front will be checked as at the best of times round Ypres is very marshy.\n\nFriday night","20":" A very busy night as we loaded up three trains. We appear to have had another hop-over\n\nnotwithstanding the fearful weather & reports vary as to its success. The men coming in were in a fearful state, soaked through & through caked with mud and shivering with the cold. Trench feet has already shown its presence & we had several bad cases, also a fair number of gas.\n\nSaturday night","21":" Another quiet night very few coming in. The system of admitting patients is now well controlled. There are 4 C.C.S’s together & each take it in turn to admit patients up to 150 stretchers, two walkers counting as one stretcher, they then close down & the next in turn admit. By this method no matter how great the rush the work is evenly distributed & time is given to sort out one lot before receiving a second. A system of booking is in use by which headquarters are notified up to the hour if necessary the number of casualties so that the heads know\n\nexactly how things are going & can act accordingly. The evacuating is pooled under one Evacuating Medical Officer which makes for efficiency and surgical teams are in attendance who travel the whole front for use where the casualties are. By this means the best surgeons are used where most needed, & best results with small wastage of man power is gained. Instead of going to bed during the day I went to see my unit about 10 miles away at Dickebush where they are running an M.D.S. but have very little to do. It was well worth the trip if only to see the concentration of material, munitions etc. on the road. At one siding there were new guns of all calibre as well as G.S. waggons, watercarts, limbers etc. all new & ammunition unlimited. There is no shortage in Material with us. Saw two lots of taubes over apparently\n\nwithout much opposition from our planes, even our anti-aircraft fire seemed feeble.\n\nSunday night","22":" Things still quiet. Sent one batch of walkers away during the night & managed to get a sleep to make up for none during the day Weather has cleared up considerably but it will take some time to make much improvement in the line. More sickness coming through also gas from which we have had some deaths. Taubes over during the night. \n\nMonday night","23":" No train during the night so had four hours sleep. Frost now making its appearance & weather shewing signs of improvement. The last stunts which draw in the French on our left gave us a mile with about 500 prisoners. The weather prevented a full success being attained. Fritz fighting\n\n \n\nstrongly to check our advance further.\n\nTuesday night","24":" The last stunt totalled 943 prisoners but we did not reach all our objectives. Had one train to load during the night it being late owing to large troop movements going on. Signs are not wanting that we will be shifting shortly, the Canadians now making their appearance. My Section has received something in the nature of a disaster only 5 men being left out of the bearers. Gas was the medium of destruction, those not wounded or killed coming under its influence. The enemy put over a large quantity of gas shells & two dugouts which contained our men were affected with the aforementioned result, two of our officers being also affected. I saw the majority of them going through & managed to go to the M.D.S. & get their personal effects for them before they went on the train. This occupied my time until about 3 o’clock in the afternoon after which I turned in to get a few hours sleep before going on at night again.\n\nWednesday night","25":" Had a strenuous day instead of going to bed. Two of us went to & \"Bailleue\" about 10 or 11 miles away to see old friends. We walked part of the distance down & got a lift by a lorry reaching there in two hours. Had dinner with my friends & a good yarn it just being 12 months since I was last there. We then went to \"Bailleue\" where we spent a hour, when we set off home again at 5 P.M. reaching camp at 7 A.M. & going on duty at 8 P.M. We had a fair way to walk coming back & also boarded four vehicles during the journey luckily threatening rain held off until we reached camp. No train in during the night so managed to snatch a few hours sleep which made up for not having any during the day.\n\nThursday night","26":" No train during the night so did some writing & addressed my Xmas cards for Australia and\n\ntook them to our camp at Dickebush during the day following. Gunfire increasing again which points to another attack shortly.\n","27":" Went to Dickebush with my letters for the post. Saw where they were bombed the night before, one tent being destroyed, luckily no one was in it at the time. While waiting for a car to come back had an hours sleep & two hours when I reached the C.C.S. before going on duty. Night quiet so did some reading & two more hours of sleep.\n","28":" When thinking about going to bed I heard that a lorry was going to Dunkerque on the coast so asked the S.M. if he had any objection to my going. He had but gave way & we left at 9 A.M. reaching Dunkerque shortly after 11 A.M. The roads were good & we passed through the sector held by the French then reached that of the British again when we approached the coast.\n\nCountry extremely flat & uninteresting the beet crops being gathered. On reaching Dunkerque I ascertained that the lorry was leaving at 4.30 so set off to explore the place as well as \"Malo- les- bains\" which is actually on the coast. The town itself was very lively, a market day being in full swing notwithstanding the fact that ‘tis bombed so regularly. Many of the buildings are damaged & windows are broken everywhere. A fair service of trams was in evidence & I took one to Malo & strolled along the beach on the sand, a splendid beach too, & dipped my hands into the channel. The Casino a fine building has a shell through the roof & other places shew evidence of having been bombarded from the sea. Very few people about, tourists being necessary to keep the place going. Barbed wire entanglements run right along the\n\nbeach for checking a landing. Everywhere concrete dugouts were being built for the protection of the people during raids & all safe positions such as cellars were well marked to show people where to take cover. I had dinner at the Hotel Moderne, four courses for 4 francs & it was first rate after which I did some shopping, postcards cap for F.W.G.W. & sundry other things. I had a look at the churches but they have all been damaged. When I returned to the lorry I found that it had gone although I was there to time so that I was left in a hole having to get back by 8 to go on duty. After scouting around I discovered a Ford which was going part of the way but they were not too anxious to take me until I had assisted the driver to start it which took the best part of an hour. However they took me as far as where I started to walk but after doing about a mile, a lorry came along \n\nwhich I boarded ultimately reaching my camp at 8.5 P.M. Here I found a state of great excitement. The S.M. had been told that I was left behind & was as wild as possible & when I appeared he seemed to take it as a personal offence & all at once lost his temper & told me that I was not playing the game & that I need not ask him for any more privileges. This set me off & I gave him something to think over telling him that I wanted no privileges from him but that I would demand it. He quite lost his head at being spoken to like this as he rules this crowd with a rod of iron. I then went on night duty but there being nothing doing I managed to get 5 ½ hours sleep to make up for shortages during the last few days. My conflict with the S.M. had to come, he has been looking for it all the time & I expect more developments.\n","29":" Went to Communion at 7.30 A.M., only two of us present. Turned in during the afternoon. At night nothing doing so read & slept. Slight rain. Heavy bombardment suggesting another hopover. Papers also speak of it. Canadians now in the line, a big change over of troops having taken place, artillery & others. Our A.D.M.S. Col Hearne killed & Major Bullan wounded. Four Generals at his funeral. \n","30":" Nowt to narrate.\n","31":" Went up to our camp at Diekelush to see the crowd & also brought back the mail. Wet & dreary, big movement of artillery on the roads. Four of our Sgts now casualities. Roy Campbell amongst the crowd gassed, not seriously. No evac. at night so had a sleep of about 4 hours.\n","32":" Slept all day heavy rain & wind. No evacuation at night so read & had a couple\n\nhours sleep. Rumours of a big French victory. Disaster to Zeppelins returning from London, 4 destroyed in France & rumours of 5 others meeting the same fate.\n","33":" Nothing doing bar a minor hopover on our left. French victory near Soissons 11,000 prisoners & 160 guns. Weather fine again.\n","34":" Turned in about midday after writing some letters. Night quiet. Minor hopover in progress. Received 7 letters from Australia. Rumours of a push against Italy.\n","35":" A beautiful day and feeling particularly bright decided to go to \"Steenwerck\" in order to locate Dave Drummond’s grave supposed to be in \"Troi Arbres\" cemetery there. Reached there at midday & after a lunch of Pomme de terre et des oeuff set about exploring the cemetery. No luck however the grave was not there & there was no record in the\n\nin the books of the Cemetery nor those of the Hospital. Decided then to examine\n\nother cemeterys in the neighbourhood, but there was no trace of him. This took me to within 4 miles of the line but everything was quiet, like a home in comparison with the Ypres Salient. Then set off to Bailleue to the grave registration corps but they had no trace of him either, it looks as if his grave has been lost sight of notwithstanding the fact that the Chaplain said he buried him. It was good to see the old places after 12 months absent & it was all looking bright. Arrived back about 7 P.M. after covering about 26 miles, walking part of the way & getting a lift in lorries the remainder. At night had one train to load which was completed by midnight. Italy heavily attacked Germans helping Austria, first report gives 60,000 prisoners & 300 guns taken from the Dagoes.\n","36":" ’17 Went up to see the ambulance which had shifted back a bit. Collected some mail & returned in time to turn in a 3 o’clock feeling very tired. Spoke about Paris leave again. Learnt that our crowd were given 12 M.M’s & 1 D.C.M. The lucky ones all being good fellows. Weather fine still but cold. Night quiet.\n","37":" ’17 \n\nFine day so walked to Mont de Cats a small mount surmounted by a Monastery about 4 miles away. ‘Tis the highest spot I have been on in France & the view obtained was splendid but spoilt for the day by being hazy. The Monastery & Abbey now used as a C.C.S. Felt dead tired coming back as have had very little sleep lately turning in at 2 P.M. Bought some views of the place also of Godeswelveldt. Taubes over & plenty of bombing at night.\n","38":" Had a good sleep during the day and loaded one train at night. Things fairly busy. Taubes over at night.\n","39":" Had a day out with another Sg here. He took me round to see his old haunts in the neighbourhood walking miles. Had a good & merry time arriving back in time for two hours sleep. Loaded one train at night. Taubes over & had this crowd properly frightened. I never witnessed so much terror as shewn by this C.C.S. An Aerodrome about 1 ½ miles away was bombed\n","40":" Went for a walk in the morning but turned in at 11 A.M. Taubes over again & caught some of our artillery. More casualties from bombs than the line during the night. Trench feet much in evidence, Gas cases also being numerous. Loaded two trains during the night getting 320 cases away.\n","41":" Italian breakout now total 120,000 prisoners & 7000 guns, we are reported to be rushing help to them, they need it. Wrote a letter in the morning & turned in at midday. At 4 P.M. I was awakened & handed a letter from England & shortly after two of our Sgts came for me to go on leave to Paris straight away. Great excitement. Packed my kit and hopped into the car and returned to my unit. After a snack went along to the Paymaster in the dark & through the mud & drew £ 9 all my book would allow. With a refund of £ 5 from my pal & what I had this made £18 available for the trip of 4 days so I felt safe. I then had a bath & change of clothing, shaved & sat down to patiently wait until time to go for the train. I obtained a signed order which stated that I was a day behind in going on the leave. A very anxious wait. Had no regrets on leaving the C.C.S.\n","42":" Trip to Paris in company with Sgt Hopkins.\n\n \n\nWalked in Poperinghe through the rain & mud & reported at the station & obtained a movement order by which we obtained a concession at Calais when buying the ticket for Paris. A tip to the train chap gave us a good seat and the train left at 1.35 A.M. & reached Calais at 7 P.M. Here we had to change so left our bags with a Red Cap & had breakfast in the town. Then we wandered round the town rather a fine place & had a good view of market day, beach, splendid sands & pier etc, bought some fruit,had a shave & shampoo &bought postcards views of the place & then tram to the station catching the 12.30 train to Paris, tickets 6.20F each second class & reached Paris at 10 P.M. Before leaving Calais procured tickets for dinner on the train & entered the dining car at Boulogne there being no corridor getting off at Etaples, the train starting off again before we could get seated. This dinner was very good & very well served costing 6 ½ Francs. Had an interesting conversation\n\nwith people in the train about customs etc. tea drinking & so on, they being astounded at the amount of tea we drink in Australia. We caught the Metro tube at the Gare du Nord to Opera station & after enquiring the way a couple of times found our Hotel Montana in Rue l’Echelles, the streets very misty & dark. Engaged a room with two beds with bathroom attached 18f per day for two. The night porter spoke English so had no trouble. Lovely beds & a wash before turning in, the luxury of it all after our late home being taken quite naturally. At the station we were met by a representative of the Soldiers home who tried to persuade us to stay there but we were only in Paris for 4 days so did not mind the expense of a decent hotel. The work these people are doing is of great value and makes it possible to men with little money to see the city without being robbed or getting into trouble.\n","43":" We were called at 7 A.M. by request, had a bath at 8 but the \"boots\" lost our boots by some misunderstanding & we had to ring three times & then only received them just before 10. Spent a good night. Spent a good night, the bed being luxurious, shaved etc before going out. Had no time for breakfast as had to report at the Police Headquarters, Caserne de la Pepiniere, Place St Augustin. Walked to it & found it by asking the direction & had our passes stamped to leave Paris by 11.40 train on the","44":" We then went into the Church of St Augustin very fine built in 1860, splendid dome 82 ft wide, 260 ft high, style approaching Renaissance. The Place St Augustin contains a statue of Joan of Arc. We then went down the Boulevard Malesherbes to the Madelain commenced in Louis XV reign, in 1806 Napoleon wished to convert it into a Temple of Glory, opened for R.C. worship in 1840. The interior forms one vast nave with cupolas receiving light from above. The outside is surrounded by fine colonnade of pillars. Then went down the Rue Royale a splendid street where we decided to have lunch. We chose the Tavern Royal, Maxims & \n\n \n\nWebers being alongside. The Royal was on the flash side, but the meal was simple & good, beautifully served 10F, had an adventure with a female here. We then went on & reached the Place de la Concorde which is the finest & most spacious in Paris. In the centre stands the Obelisque of Luxor from the ruins of Thebes. On this spot stood the guillotine where Louis XVI & Marie Antoinette were executed","45":" Splendid fountains & statues representing various towns are scattered about the place. From the bank of the Seine the Pont de la Concorde leads to the Chambre des Deputes, the colonnade of which matches that of the Madelaine at the opposite extremity. The Boulevard commences at the Place de la Madelaine. From the Obilesque we passed through the Champs Elysees & strolled through the Jardin de Paris to the Grand-Palais on either side of the Avenue Alexandra III 1897, both splendid buildings. We were able to enter the Petit Palais which contained statuary, \n\npictures & relics of the invaded citys, such as Verdun etc. We then proceeded over the Seine by the Pont de Alexandre III into the Esplanade des Invalides, a large open space. Splendid gold figures surmounted the four columns on the bridge. Youngsters were roller skating on the concrete places & a large concourse of people were trekking in the one direction to the Hotel des Invalides built 1671 & restored by Napoleon I & III. The building provides a home for wounded and aged soldiers, originally for 6000 soldiers but now a few hundred. The courtyard contained trophies captured from the enemy such as guns, parts of Zeppelins, aeroplanes, Fokkers & so on & also Captain Guynerners aeroplane all bedecked with flowers & ribbons. Napoleons tomb is in this building but we failed to see it, only the three stone slabs from his tomb at St Helena and the Copper Sarcophagus with the mourning flag used for bringing his ashes to France in 1810. There was a fearful crush of people visiting the tomb. We then proceeded via Rue de Grenelles to the Parc \n\ndu Champs de Mars, thence to the Eiffel Tower erected in 1887, nearly 1000 ft high & the highest building in the world, constructed of iron work on four points, a wonderful edifice now used as a wireless station. Then across the Seine by the Pont A’lena to the Palais du Trocadero . The Palais built for the exhibition of 1878 is now a museum & has accommodation for 5000 people, a splendid series of Cascades & water fountains with statuary is in front of the building but not working at present. Had tea in the Place du Trocadero & then drove by cab to the Hotel where I enquired where my friends resided. Took a taxi but found the girls out & a Doctor and his wife being with Madam. I was received very well & had an interesting yarn with the Doctor who was a Russian. He & his wife knew very little English but we managed to hold a conversation OK & they ended up by inviting me to dinner the following day. Russian is a beautiful language to listen to, being sweet & soft. Later Madam Dobbevitch went & rang up to tell her daughters \n\n \n\nthat I had arrived & they came back immediately. It was rather funny when the Eldest girl shook hands she forgot what to say, not having had practice at English for 3 years. We had a long talk, Sonia the eldest girl, improving in English as we proceeded & I arranged to meet the two girls in the Rue de Medecin at 3.30 the next day. Went home to the Hotel by tube the girls showing me the station & my friend arrived at the same time having gone to a theatre. Had a night cap & turned in well pleased with the day. Altho’ Paris was comparatively dead & autumn had reduced all foliage to falling leaves, it was yet a great sight to us & we could well imagine what it is like in the proper season.\n","46":" We were called at 7 o’clock, bath shave & breakfast etc then by the aid of a guide book set off to do the city until 3.30. Starting from the Rue de l’opera, a street of splendid shops. We proceeded down Rue St.Roch to the Church of St Roch, a large plain church & the Place of Roch, the scene of a scrap of Napoleon & the Royalists 1795. We then passed a statue of Jeanne d’arc in the Rue de Rivoli, Rue des Tuleries \n\ninto the Jardin des Tuileries about 72 acres 1665 divided into two equal parts by an avenue. Looking west one sees the Obelisk of Luxor, a finer example than the one in London & the Arc de Triomphe de l’Etoile at the extremity of the Champs des Elysees. The Gardens contain numerous statues & fountains. We then passed through the Arc de Triomphe du Carrousel by the statue of Lafayette & saw facing the Arc, the Monument to Gambetta 1888. We then encircled the Louvre, large buildings once the residence of the Kings, now a museum but closed. They are noble buildings adorned with carvings & statues. Retracing our steps we crossed the Rue de Rivoli & passed through the Jardin du Palais-Royale where we saw Sir Douglas Haig having a constitutional. We gave him the salute. We then visited the Church of Notre-Dame des Victories, a pilgrims resort. The Place des Victories contains an equestrian statue of Louis XIV. Passing along the Rue Coquilliere we reached the Church of St Eustache, a very old & beautiful church 1532 to 1642 in Gothic & Renaissance styles. In the interior the Chapels are decorated with beautiful paintings\n\ndating from Louis XIII & the stained glass windows are extremely beautiful. Many famous men are buried here. Opposite the church is the Halles Centrales, the largest market in Paris built in 1851. We strolled through these purchasing some fruit on our way. Then by way of Rue Berger, passing the Bourse du Commerce, we turned to the left down the Rue du Louvre & entered the church of St Germain-l’auxerrois opposite the Colonnade of the Palais du Louvre. The Colonnade is very imposing 550 ft long with 52 columns. The flower beds being laid out in the French style with several statues. The Church of St. Germain-l’Auxerrois was built in XIII century. The beautiful porch dates from 1425, adorned with frescoes on a gold ground, now very dilapidated. The Bell Tower of the","47":" Century contains the bell which gave the signal for the Massacre of St Bartholomew. Various chapels statues & woodwork very pretty & stained glass windows of the 15th Century very fine enquiring our way here from a Cure, in 5 minutes we had a small crowd around us only dispelled by \n\nan Englishman joining in the conversation. He had lived 19 years in Paris & was a typical John Bull. Crossing the Pont des Arts & turning to the right we passed a statue of Voltaire, then to the left down the Rue Bonaparte & reached the Ecole des Beaux-Arts. We could not enter the building but in the forecourt we saw the celebrated portal of the Chateau d’Anet which Henry11built for Diane di Portiers . .It forms the entrance to the old Chapel. Erected in the centre of the court is the portice of the Chateau de Gaillon,the facade of which is one of the finest specimensof French arhitecture of the 19th Century. Noticing a restaurant opposite we decided to risk it so went in & had lunch. It turned out to be a regular Bohemian place this being the Latin Quarter & although we ordered what we thought to be veal & received liver, it was so beautifully prepared that this meal was one of the best & certainly the cheapest we had in Paris. I found myself capable of more French than I thought possible & so far we managed very well indeed. After lunch we\n\nwe wandered into some shops in the same street & purchased various postcards & prints of watercolours which we had posted from the shop. It was now approaching the time when we had to meet my friends so we took a taxi to the \"Montana\" had a wash & brush up & then another taxi to the Rue de Medicin. Here we met my girl friends. Under their guidance we visited the Jardin du Luxembourg of 63 acres comprising beautifully laid out terraces typically French also an English garden with numerous statues of illustrious women of France, altogether a very beautiful & peaceful spot. Returning we saw the Pantheon in the distance & then visited the old citie, on an island in the Seine. Being late we had a cursory glance only & on our way to the Palais de Justice we saw the Horlage in the wall of a building on the street corner, the oldest public clock in France constructed 1370. We then saw the Church of Notre Dame, it being closed we could not view the inside. Walking along the bank of the Seine we saw the quaint custom\n\nfollowed by booksellers in Paris, the stone parapet being covered for a considerable distance with boxes or stalls filled with literature of every kind, the lid being locked down on closing. Here we saw the bridge Pont-Neuf commenced in 1578 under Henri III. Crossing the Seine by the Pont du Carrousel we entered the Jardin des Tuileries & learnt that at certain times of the year when standing at the statue de Gambetta the sun can be seen setting in the west in the distance through the Arc de Triomphe de l’Etoile a distance of nearly 2 miles. Walking through the Tuileries which extend for 72 acres designed in 1665, we reached the Place de la Concorde near where we took tram to Passy. After dinner the two girls & myself went to the Comedy Francaise by taxi. This is one of the three national theatres & is still conducted on rules laid down by Napoleon. The people were quietly dressed as a law forbids evening dress during wartime, the audience struck me as being very orderly & undemonstrative.\n\nNovember 6th. Called at 6 in order to catch the 8.20 from the Gare des Invalides but missing my friends there I thought that I was at the wrong place so wandered further on & eventually had to enlist the services of a taxi to return to where I had been before. This meant we missed the train so caught one at 9.20. Whilst standing in the crowd a man in quite a matter of fact tone turned round & asked me for a match. One gets accustomed to these surprises in a foreign country after travelling, as Englishmen are found in every quarter of the globe. The train, electric, took 35 minutes to do the 12 miles but the country was not very interesting apart from seeing the wall of Paris & several aerodromes & aeroplane factories. On reaching Versailles we walked to the Palace through the town of 54000 inhabitants but very uninteresting in appearance. The Palace, the residence of the Court of France prior to the revolution is unique in France. In 1660 the building was commenced & was enlarged & extended by the succeeding Kings. The site being most unsuitable to the project, a vast\n\narmy of men were employed at tremendous cost. More than 30,000 men were employed at one time & great loss of life was occasioned by sickness from the draining of the swamps. The system of fountains & lakes called for such a large supply of water, that the famous Machine de Marly was constructed in 1680 to conduct water from the Seine. The cost irrespective of unpaid labour has been computed at £ 14,880,000 in modern money. The building being closed we were unable to see the interior so after viewing the exterior we passed into the Park or more accurately the Gardens of Versailles, the work of Le Notre 1613-1708, the master of gardening who laid them out for Louis XIV. The Gardens are divided into many symetrical parts each having its own particular features. Fountains of various designs abound and statues & buildings each with its own history are scattered over the Park. Looking down from the Terrace one gazes over the Park, the limits of which cannot be seen. The Tapis Vert a green carpet (a long lawn) stretches down from the Chateau to the fountain of Chard Apollon, then commences the Grand \n\nCanal over a mile long\n\n& 57 yards wide on either side paths lead in all directions with mathematical precision. The Trianons, Grand & Petit, the latter the favourite resort of Marie Antoinette being laid out in English fashion are more private than the remainder and a village constructed for the Queen consisting of the Mill Boudoir, Tower, Dairy etc. all thatched dwellings are extremely picturesque. In the time we had available it was impossible to explore it to any extent, one could only marvel at the great mind which conceived & carried out such a tremendous project. Autumn & the War of course meant that the place was almost deserted but it lent a particular beauty of its own, the autumnal colour & falling leaves being very pretty. Leaving here in time to catch the 12.30 train we had lunch at Dewals in the Boulevard St Germain, a very decent meal. Leaving the girls we crossed the Seine to the old Citie, actually an island in the Seine, in order to complete our tour of the day before. First we saw the Sainte Chapelle Church, a beautiful chapel surrounded by the Palais de Justice. Commenced\n\nin 1245 by St Louis it consists of an upper & lower chapel & was built to contain the crown of thorns & a piece of the real cross obtained from the Emperor of Constantinople. The principal feature consists of the stained glass windows which are the most complete example of the work of the latter part of the 13th century & are extremely beautiful. Each of the windows is a dazzling jewel, the large rose which dates from Charles VIII being divided into 79 frames, the whole having a glorious effect. We bought postcards etc before leaving. Next we strolled through the Palais de Justice into some of the Law courts but it being the meal hour, the Court was adjourned. The Notre Dame then claimed our attention as we had not seen the interior the day before. On entering we saw before us a man sitting at a table holding a brush. His job was to dip the brush into Holy water & touch the hand of those coming in, we perforce had to collect our sample. So many people coming in means that several Holywater founts are provided & at times one sees one person dipping their hand in & touching the hand with it of their friends or those nearby. This\n\nbuilding which was completed in the 13th Century is considered one of the finest in France. Its length is 415 ft & 150 ft wide whilst its towers reach 220 ft. The ball on the steeple which supports the cross contains fragments of the real cross & of the crown of thorns. The Stained Glass windows are particularly beautiful especially the three Roses, one of which is over 40 ft in diameter. Enquiring our way we next came to the Church of Saint Sulpice & just about here my pal received a shock. I had primed him up on how to ask the way & he bravely went up to a Taxi driver & delivered forth the oration. After listening respectfully for a few minutes, he said – Oh! You want the Church & directed him. He could not decide whether to feel proud of his effort or kick himself for not speaking in English which the man spoke perfectly. The Church was very fine, built in 1645, the organ being considered one of the finest in existence & the Holywater fount being presented by the Republic of Venice to Francois I. Leaving here, by chance we came to the museum of the Palais du Luxembourg. On entering the main hall we\n\nwere struck by the beauty of the many statues in white marble chiefly & spent some time examining them. Other rooms contained paintings representing different schools, English being amongst the number & before leaving, purchased postcards of some of the best to send home. One wonderful statue of a woman modelled apparently from one piece, shewed the feet head & bust of white marble, the head gear of a cream coloured marble & the dress a variegated marble, a wonderful chance piece of stone which allowed of such treatment. Returning to the Boulevard St Germain past the Church of Saint Germain des Pres, we took a taxi to the Opera Comique where I booked seats for the evening performance of La Tosca. This was rather a difficult performance as my French is very poor. However, I examined the plan & then joined the throng waiting for tickets when my turn came I first asked if she could speak English, no, was the answer so then I started off as well as I could & asked for 4 seats. She \"got me\" OK but did not have 4, only 6 together & asked me if I objected to a French Officer & his wife taking the other two. Right O, said I and\n\npaid for the six after which I collected the French officer’s share & arranged at what time I would be there. When this was done an interpreter appeared on the scene but we had managed to arrange everything satisfactorily without his aid. By taxi then to the Nicka Bocka Bar a yankee resort of some repute but hardly a Sunday School & proceeded by the same car to W.H.Smith & Sons English shop in the Rue Rivoli where I purchased books of views of Paris postcards etc. which I had posted home direct. If all my purchases in this line reach home they will have to remove to larger premises. Returning to the Hotel we had dinner & then met our friends in the vestibule of the theatre. The piece La Tosca, of course in French was very good but at times it was an effort to keep awake as we had had a strenuous time with very little sleep, several times I had to dig my pal in the ribs. I thought the audience much like our own until some particularly good singing called for extra applause & as well as clapping, the women present started calling out, it sounded like a lot of hysterical girls crying. I understand they always show their appreciation in this way, the opposite effect being gained by whistling\n\nthis showing great contempt for the actors & playing. Some Americans I believe who often show approval by whistling were much misunderstood one evening. After the show we saw the girls to the Metro Station & walked to our Hotel & turned in content with the day & dead tired.\n\n7th November Being called at 6 we breakfasted at 7 & caught the Metro tube at the Palais Royale station to Pont Maillot, that being the station at the Boi de Boulogne. We then engaged an open taxi & entered the Bois by the Allee de Longchamp. The driver was determined to show us the place very thoroughly for he twisted & turned in all directions, passing lakes, cascades beyond number, the Hippodrome de Longchamp, Polo & Lawn Tennis grounds, the garden Zoologique de Acclimatation, the leading race course of Paris & various buildings. The place was at most deserted the weather being cold & inclined to rain but the woods with there autumn tints had a beauty all their own. A number of deer were seen just before we left by the Avenue du Birs de Boulogne, a beautiful avenue which led to the Arc de Triomphe d’Voile built at a cost of £360,000.\n\nin 1806. Various panels & sculpture depict the departure & return of the French armies & on the ceiling of the Arch are panels bearing the names of the principal victories under the Republic & the Empire. At the four feet are four large sculpture groups. It is very massive being 150 ft high 146 ft wide & 90 ft under the Arch. Driving on down the Avenue des Champs Elysees, a broad magnificent avenue to the Place de la Concorde, we reached the Hotel well nigh frozen but pleased with the trip. Cost 21 Francs. Obtaining our waterproofs as it had commenced to rain, we set out both to view the shops & see further places of interest. By way of Rue de Rivoli we turned left into the Boulevard de Sebastopal until we came to the Conservatoire des Arts-et-Metiers but found it closed. Returning on the opposite side of the street we reached Tour St-Jacques, all that remains of the Church of Saint-Jacques-la-Boucherie. It is 170 ft high & was built in 1508. By way of the Avenue Victoria we came to the Hotel-de-ville & passing through we reached the Church of St. Gervais et St Protais built in the 13 & 14th Century. The chapels inside contain many fine paintings. Crossing the Seine behind the Notre Dame\n\nwe came to the Church of St Nicolas-du-chardonnet built in 1656, the most notable feature being the beautiful organ. Just about here an old lady stopped us & asked when the war was going to end & after yarning I complimented her on her English, a sure way to please. It turned out that she was a governess & taught English regularly. Inside of 5 minutes we were again stopped by a benevolent female who asked if she could direct us anywhere. This may suggest that we were lost or appeared so but it was really because these people like to practice their English & find out who we were, Australians being rather uncommon. We then went to the Church of Saint-Etienne-du-Mont, one of the oldest & most original churches in Paris. Built in 14517 it contains much of interest. The stained glass windows date from the 16th Century & are very beautiful, especially 22 magnificent windows in the Chapelle de St-Genevieve. A marble slab at the entrance to the nave indicates the spot where Sibour, the Archbishop of Paris was assassinated in 1857. The Pantheon being close by we proceeded to visit it, but found it closed. It is a magnificent building, surmounted by a dome 270 ft high & the\n\nPeristyle in the front is supported by 22 fluted columns with the inscription – ‘aux grands hommes la Patrie reconnaissante.’ (The states tribute to its great men) In the crypt are buried such well known men as Victo Hugo, J.J.Rousseau, Voltaire, Soufflot, Emile Zola & many others. Lunch time being nigh we visited a restaurant in the Boulevard St Germain. After lunch we walked by way of the boulevard to the Hotel des Invalides in order to see Napoleon’s tomb which we missed on our previous visit, but found it closed, so then taking a cab we drove to the Caserne in Place St Augustin to report, having orders to catch the 11.40 train that night. Before proceeding to do some shopping we had another look at the Saint-Augustin Church, a splendid building indeed & altho’ quite modern, has quite fine stained glass windows. For our shopping we then walked along the Boulevarde to the Rue Royale calling in for a few minutes at the Madelaine which we had seen the first day imperfectly owing to a service being on. Our many visits to these churches convinced us of the control the church has over the people & the great comfort the people get from the church all day & every day the people enter for worship or prayers \n\nit matters not if they understand the service or not. At the service the people take no part as we know it, the priest performing his office in the dim distance assisted by a boy & a bell rings at intervals which apparently tells the people when to stand up & sit down & so on. The collections are taken up by men preceeded by gaudily dressed persons in cocked hats, like budding admirals. The opera was our next port of call, a vast building built in 1864. On the summit of the building is the figure of Apollo holding his Golden Lyre, the interior we could not see it being closed. Returning to the Hotel for a brush up I next caught a taxi in order to go to say goodbye to my friends at Passey. Here I had tea & met a Russian who before the revolution was an anarchist & had lost a hand with a bomb, he was now almost a conservative to such an extreme has the revolution gone. I was really sorry to say good-bye as they had treated me so well & on leaving they gave me two books Notre Dame & Tartarin of Tarascon. Dandel. It was very interesting to be in the home of these Russians. Habits & customs they have different to ours altho having lived in England\n\nthey tried to treat me in that fashion. The old lady was a heavy smoker & rolled cigarettes for me as well as for herself. Wine they do not drink to any extent, tea being their drink as it is ours but the men in Russia always drink it out of a glass, the women only, using cups. A taxi (to save time) took me to the Boulant Restaurant in the Boulevard Capuchines where I met my pal & his aunt & we had dinner together. We then adjourned to the Nicka Bocka bar for light refreshment, took leave of my pals aunt, then taxied to the Folies Bergere a music Hall of doubtful reputation, a visit to which is necessary before one knows Paris. The show itself was poor but the Parienne life there pictured was at least interesting. Prior to this we had decided not to return by the night train so wended our way to the Hotel & turned in after a yarn & smoke with two Australian officers during which we exchanged our respective experiences & adventures in Paris. Believe me they were some yarns.\n\n8th November We were called at 6 & had our final hot bath. After breakfast we settled our account & tipped the various employees we had come in contact with, an important thing as they do not receive wages at these hotels. This done we took a taxi to the Gare du Nord & bought our tickets to Boulogne intending to get off there & if possible go to see our friends at No.2.A.G.H. We left at 9.10 A.M. & arrived at Boulogne at 3 p.m. having spent part of the time in the train making notes of items of interest connected with the trip. Leaving the train & station we had something to eat at the Soldiers institute & then returned to the R.T.O’s office in order to enquire the time the next train left. This turned out to be midnight so after strolling round the town, without opposition from the Military Police (we were a day overdue) we took tram to & had tea with our friends. After a yarn we were shewn round the chief wards & operating theatre, being struck by their excellence, this Hospital being considered one of the 3 best in France. Composed of huts\n\n& splendidly laid out, everything showed signs of splendid organisation & serious cases such as fractured femurs were treated by new methods of suspending the limb which guaranteed the greatest degree of comfort to the patients, many of whom spent from 5 to 6 months in the same position. A Dance & concert with supper being held in the nurses quarters we were invited round & spent a jolly couple of hours. I thoroughly enjoyed myself, meeting old friends & officers who introduced me round to the nurses. The officers & Sgts of the 3rd Division ambulances were there by invitation & the evening was a splendid jovial one, the crowd being composed of all ranks from Lt Colonels down to privates, forming a social evening impossible in any army other than the Australian. One nurse, bless her soul, on learning that we were returning to the line that night insisted on giving us hot soup before going & also a packet of sandwiches with an invitation to come again. It was a fitting end to a glorious trip. A car going in to the station took\n\nus along but before going I procured a blanket for the train as it was cold & many of the windows of the carriages are missing. With some difficulty we managed to get a seat & also some sleep during the journey & reached Poperinghe at 9 A.M. perfectly content with our trip, the extra time we had in Boulogne through missing our train (on purpose) absolutely capping the bill. \n","48":" We reached our camp at 10 A.M. & luckily found only one section gone so we were at home straight away. In the afternoon I started to write up the trip from my notes & turned in perfectly happy despite the rain & mud & slept the sleep dedicated to the just. Throughout the weather was good with a little rain one day but not enough to interfere with us & altho. it was late autumn & would be considered by most a bad time for a visit, yet we found it otherwise being perfectly content. My opinion of the French was improved by the trip, the effusive demonstrative side was not in evidence once (except perhaps at the theatre)\n\n& it would do us good to emulate at least their politeness. We saw representatives of several armies the American being most in evidence, then there were Russians & Serbians & of course Belgians French British & Australian. English was spoken everywhere & one found English people in all quarters. At the restaurants, the meals were always well cooked & service quite up to the reputation of French cooks & in places other than swell where one expects to pay heavily for show they were cheap. The number of churches we visited were many but in these old cities they are a part of the history & development of the city & are thus interesting. Owing to the war & economy many of the places were closed but this had its merits, it enabled us to see more exteriors & more of the city.\n\nNov.10th Wet & dreary with nothing to do wrote home & sent off some pkts of postcards etc & wrote up the diary, a big undertaking Received a big mail about 15 letters & some papers.\n","49":" Wet & dreary. Orderly Sgt for the day with very little to do so finished writing up the Paris trip.\n","50":" Still very little doing us we are awaiting orders to move. All my time spent on answering my mail & getting things straight. We are in camp at Sohiers Farm midway between Poperinghe and Reninghelst. Everything quiet except heavy firing on our left. Italian situation still serious, they have lost 2500 guns and 200,000 prisoners. British & French troops have been rushed across, a lot of trains having been withdrawn for the purpose. Went to a concert at Reninghelst at night and it was a splendid show quite equal to a Music Hall at home. These troupes have now been brought to a high state of excellence & do a lot of good. Visited Pop. during the afternoon to buy a writing tablet & other things weather cold & wet under foot but fine otherwise.\n","51":" Spent the morning of the","52":" writing letters & orders came through suddenly for my section to move to Soere to join up A.Section. We marched out at 12.30 for Frere a distance of about 5 miles & found our new billets a splendid lot. We took over from a British Field Amb., a splendid lot of fellows to, in a convent being run as a rest station. The Sgts quarters are the best we have yet had, although only a fowl house tis a two story building, one large room at the bottom for a mess with kitchen adjourning & above 4 small rooms. Built for pedigree fowls it was made like an ordinary dwelling & has a balcony round 3 sides. A piano goes with the building & we had a sing song the first night. Next morning we took over finally & spent the day getting things into order etc. If we are here long we will be lucky & should our stay go over Christmas we will be able to have a rare old time.\n","53":" Weather cool. Had a dinner in the evening. The good things are provided out of Corps funds & we were fortunate in having a large room in the Convent for the purpose. About 200 sat down with 10 officers and the Sgts acted as waiters. It was a strenuous job as the dinner consisted of 3 courses not counting drinks which were coffee & beer & altogether it was a very successful show. At 6 oclock the dinner commenced & a concert carried on the fun until about 10. Several speeches were made & the Esprit de Corps of the Unit was much improved by the Affair.\n\nDecember 2nd Nothing of note taking place I have let the diary slide. I first started on the dispensing but when we were made the gas centre, I was put in charge of that section. We were to try new treatment, certain inhalants to be used to prevent development of pneumonia. Got\n\neverything fixed up but still had to keep an eye on the dispensary through one of the dispensers going on leave. The weather on the whole has been extremely mild and our first snow appeared on","54":" but a very light fall & soon disappeared. Have had a couple of trips into Bailleue for drugs & also visited the 1st C.C.S. to see friends & find out about Howard Carr a great friend of mine who has been killed. He was a splendid fellow from Adelaide. Our stay in this place has been most enjoyable. We have breakfast at 8 then lunch at 12.30. At 4 p.m. we have tea & at 6 P.M. dinner after the English style, between then & 8 I play cards the first time for years & then write letters or try my hand at some French. Everyone appears to be in good spirits and every meal the fun waxes fast & furious. Altho’ only 10 miles from the line it is a quiet sector being 11 miles from Ypres and we appreciate it after our last\n\nposition. Leave to England has slackened off. I am about 17 on the list & at first it appeared as if I would get there for Christmas but now it will be about New Year before I get it. My old friend here of the 1st Field Staff Sgt Say has received his commission at last. After 3 years they have at last given pharmacists a comm. in General Hospitals & C.C.S. Last June they called for particulars & on","55":" the first 5 were appointed not a bad selection but not of the fairest as the 3 men who came away with the","56":" Field in 1915 each received one. There are older men with a better claim. Being only Sgt & that only for 18 months did not put me in the running. The night before Geo Say went away we had a hopover in his honour & it was most successful. Seventeen of us graced the festive board with trifle, champagne coffee & rum as extra. The fun was\n\nfinished at 12.30 when twelve of us joined hands for Auld Lang Syne, the others having been put to bed. We had the piano of course & there were songs dances & joking all the evening. We had to catch a train at 7.30 in the morning and myself & a friend went with him in the car to see him off. I will miss him greatly as we were boon companions. He was one of the best characters I ever met, upright & honest, always fair, he gave the battalion patients & others a fair spin always. The Ambulance can ill afford to lose his sort. We have been able to put up a good stunt at Cambrai, by a surprise attack with Tanks we advanced several miles & and captured about 100 guns & 10000 men & have held the ground despite heavy attacks. ‘Tis certainly a serious blow to the hun as it destroys his security in this part. The Italians appear to be\n\n \n\nholding their line now & better news is coming from that quarter & with the new allied council of 3 men we can hope for better things in the future.\n","57":" Have been too busy to add anything during the week. I have been by myself as the","58":" dispenser is away on leave & have been kept going all the time. Am now in A section, I decided to make the change, not knowing what the new man would turn out to be & it would give me control of spare instruments & all requisitioning etc. The Colonel also sent on a strong recommendation for me to get the Crown but do not expect anything to come of it. We have had a little snow but the weather has changed again & it is now quite mild, a rare thing at this time of the year. The huns have been putting up a great fight at Cambrai & have pushed us back a little, he evidently realises the seriousness of the position & is making extraordinary efforts to straighten\n\nout the line. Our fourth division I believe has gone down & probably we also will get our turn as it appears that we are destined to be storming troops for a while. We are told that we are going for a spell near Boulogne which will not come amiss altho’ the march there will be some effort. I expect that we will be leaving at the end of the week. My leave is now closer, my name being seventh on the list. During the week a couple of concert parties have visited the patients & given them a show, I saw one & it was first rate. On Thursday I had a trip to Fletre about 8 miles away, having to collect drugs, it was very cold sitting in front of the car. Inside ‘tis beautifully warm now as they are heated by an arrangement of the exhaust & patients this winter will have a better time than last\n","59":" Sudden orders arrived today for the transport to move off tomorrow at \n","60":" A.M. This meant a great hustle to pack up our equipment as it all had to be loaded up. Apparently the patients we have to the number of 240 were not considered for one moment by the heads. By this order we had to withdraw all our gear which included feeding utensils etc. which left the Hospital destitute. Shift was made tonight with a few odd cups & the patients mess tins but ‘tis a scandal that such poor consideration has been shewn to the men. Having a new A.D.M.S. may be the cause, however, it is a blunder but one which fortunately rarely occurs. Packed up all my dispensing gear tonight, being still by myself. When I changed over to A section I took with me C panniers which I have been looking after, it caused a slight commotion amongst the 2 M staff but I considered that I was entitled to do it because of the care I had lavished on them making them the best set. An answer to the Colonel’s recommendation has been received.\n\nThe A.D.M.S. returned answer that the D.M.S. had ruled that no Staff Sgts could be made in Field Ambulances. In the Colonels letter he spoke of my long service, qualifications, had good command of men and would make an efficient Warrant Officer. When I said – its hardluck Sir, he replied, I’m not so sure about that, I’m going to take up the matter privately & see what I can do. What he meant, I don’t quite know as he was called away just then. Had 5 taubes or rather Gothas over yesterday & quite low down comparatively speaking. It was a most brazen flight & they apparently got away. Voted on conscription today. ‘Tis hard to say how it will go with the troops, there being a good number of Noes. Personally I think that it will be carried this time & I sincerely hope so. Those against it have no real argument, some say they don’t believe in forcing others to come, some are agin the government, some vote no because\n\nthey are up against certain officers & so on, they never attempt to look at the matter from a National standpoint. It demonstrates what I believe, that the people cannot be trusted to decide such National questions which appeal to their natural selfishnesses & bias.\n","61":" Got all my gear safely away by the transport this morning. After lunch I went by car to the depot to return some serum & also took in a load of patients. Then I decided to make a big effort to get to the","62":" Batt which I was told was about 5 K.M. out of Bailleue. I found them alright & saw Col. Murphy who told me of what happened when Morris was killed. I did not have long with him however as the Brigadier arrived and I had to clear out. It’s extraordinary how difficult I have found it to locate this Battalion & then when I did find it I had to leave before I had really learned anything\n\nthat I did not know before. I then saw one of our chaps going on leave to Fletre & no sooner got out of the town when Fritz came over & bombed it. We had a good concert at night, the first of our new concert party & it was first rate, one of the visitors being General Hobbs.\n","63":" Reveille at 6 for our move. Marched out at 9.30 leaving B section behind to hand over to the incoming crowd. To entrain we had to march towards the line about 7 miles, thus boarding the train 2 ½ miles behind the front line, a proof of how quiet this sector is. Passed through \"Dranoutre\" & New Eglise on the route. The train we boarded had just brought up part of the 1st Division who were to take our place. The trip was very slow & monotonous, taking about 8 hours to do 50 miles to \"Devres\" were we detrained & after getting a sip of cocoa from the Y.M.C.A. marched\n\nto billets in the town. Ours was a huge shed at the Cement works.\n","64":" Up next morning after a fair night with one blanket & set off again at 8.45 to march to \"Cormont\" a distance of 12 miles. Fortunately they carried our packs in the cars as their feeding arrangements were bad & we had not had a decent feed since we left, due to our own officers who are inexperienced. The infantry had a much better spin. We reached our destination about 1 p.m. after a fair march but were disappointed in the village, a real dead hole & miles from anywhere. Managed to get a room in the village so will be comfortable during my stay which will probably be short as I expect my leave before Christmas being now eight on the list.\n","65":" Had a parade of all hands in the morning at which the Colonel warned us all to behave ourselves as we had the village to ourselves. Walked to French 2 ½ miles away in the afternoon in order to get the mail but received none myself. Wrote several letters at night. Our transport arrived today so will be able to open up the dispensary tomorrow.\n","66":" Heavy fall of snow during the night which transformed the village for the morning. Fixed up a good dispensary in a barn during the day so everything now is in full going order.\n","67":" Three years ago today since I enlisted & still going strong with the end apparently no nearer. Had a splendid day. I went with the Car to the four battalions who are billeted in neighbouring villages to collect their sick for hospital and then continued on through \"Samer\" to Boulogne.\n\nat Samer I had a requisition for drugs signed but was unable to get them at the depot owing to the fact that the Major in charge could not be bothered with smaller indents than for a whole division for one month. This means that it will be nearly a fortnight before we obtain supplies and in the meantime the Battalions have practically nothing to go on with. Such autocratic behaviour should not be put up with for a moment & I trust that action will be taken over the matter. At Boulogne I had lunch and then went out to No. 2. General to see my friends. After having dinner here the car called for me & we set off for home a distance of about 15 miles in a snow storm. Sitting in the front of the car was fairly severe the snow stinging the face but it was enjoyable nevertheless. We reached home at 7 p.m. & I sat\n\ndown to another dinner for which I was quite ready after the ride. The whole outing was most enjoyable, the country looking lovely under its covering of snow.\n","68":" Frost during the night so everything was frozen hard during the day. Had a quiet day as having no drugs could not issue to the Battalions. Had a narrow escape last night coming home. We were coming down hill very fast when another car appeared coming in the opposite direction & neither could turn off the track in the snow until about 4 ft divided us head on. We just missed a head on collision but the sides banged together with a crash & we skidded sideways down the hill but luckily without turning over. Fortunately no damage was done & we continued on our way.\n","69":" Frost still on. Had another trip to Boulogne today and a most enjoyable one. First to Samer & then to the 5 D.R.S. which the 15th are running & a very bleak place it is. Here I had lunch & then went on to Boulogne continuing on to where I saw George Say. He was able to tell me that he was talking to General about Pharmacy in general & quoted my case whereupon the General said that I should have had promotion long since & told him to tell Col. Thompson my Colonel, to forward on the application to him & he would see that it was granted immediately. Returning to Boulogne I did some shopping then called at the depot for the drugs and was surprised to receive them. They were waiting for me re my complaints and we had a great discussion the Major joining in the result being that we parted good friends our disagreement being settled, each recognising that the others case was a good one. It appears\n\nthat the 1st Division sent in a ridiculous number of requisitions & even the battalions sent in orders, a most irregular procedure, all with the idea of getting joy rides into Boulogne in order to collect the stuff. The countryside still covered in snow, the whole trip being something to remember. This book finishes without the end being any closer in sight but with evidences of a stronger enemy before us owing to Russia’s withdrawal & the heavy set back to Italy. A splendid advance at Cambrai has unfortunately been lessened as evidence of this, the enemy being able to put up a very heavy counter attack which regained some of their territory. Still we hold a good portion of it however. Then Canada has voted for Conscription and Australia is at present voting for the same thing & I hope will pass it whilst Gt Britain is bracing herself to withstand the enemy, until America can give efficient help. In the East we have captured Jerusalem an event of great Political importance so all’s well.\n\n"}}