{"Document Name":{"0":"Diary_0372","1":"Diary_0372","2":"Diary_0372","3":"Diary_0372","4":"Diary_0372","5":"Diary_0372","6":"Diary_0372","7":"Diary_0372","8":"Diary_0372","9":"Diary_0372","10":"Diary_0372","11":"Diary_0372","12":"Diary_0372","13":"Diary_0372","14":"Diary_0372","15":"Diary_0372","16":"Diary_0372","17":"Diary_0372","18":"Diary_0372","19":"Diary_0372","20":"Diary_0372","21":"Diary_0372","22":"Diary_0372","23":"Diary_0372","24":"Diary_0372","25":"Diary_0372","26":"Diary_0372","27":"Diary_0372","28":"Diary_0372","29":"Diary_0372","30":"Diary_0372","31":"Diary_0372","32":"Diary_0372","33":"Diary_0372","34":"Diary_0372","35":"Diary_0372","36":"Diary_0372","37":"Diary_0372","38":"Diary_0372","39":"Diary_0372","40":"Diary_0372","41":"Diary_0372","42":"Diary_0372","43":"Diary_0372","44":"Diary_0372","45":"Diary_0372","46":"Diary_0372","47":"Diary_0372","48":"Diary_0372","49":"Diary_0372","50":"Diary_0372","51":"Diary_0372","52":"Diary_0372","53":"Diary_0372","54":"Diary_0372","55":"Diary_0372","56":"Diary_0372","57":"Diary_0372","58":"Diary_0372","59":"Diary_0372","60":"Diary_0372","61":"Diary_0372","62":"Diary_0372","63":"Diary_0372","64":"Diary_0372","65":"Diary_0372","66":"Diary_0372","67":"Diary_0372","68":"Diary_0372","69":"Diary_0372","70":"Diary_0372","71":"Diary_0372","72":"Diary_0372","73":"Diary_0372","74":"Diary_0372","75":"Diary_0372","76":"Diary_0372","77":"Diary_0372","78":"Diary_0372"},"Date":{"0":"unknown","1":237.0,"2":238.0,"3":239.0,"4":245.0,"5":246.0,"6":249.0,"7":250.0,"8":251.0,"9":270.0,"10":299.0,"11":304.0,"12":305.0,"13":306.0,"14":307.0,"15":308.0,"16":309.0,"17":310.0,"18":311.0,"19":312.0,"20":313.0,"21":314.0,"22":315.0,"23":316.0,"24":317.0,"25":318.0,"26":319.0,"27":320.0,"28":321.0,"29":322.0,"30":323.0,"31":324.0,"32":325.0,"33":326.0,"34":327.0,"35":328.0,"36":329.0,"37":330.0,"38":331.0,"39":332.0,"40":333.0,"41":334.0,"42":335.0,"43":336.0,"44":337.0,"45":338.0,"46":339.0,"47":340.0,"48":341.0,"49":342.0,"50":343.0,"51":344.0,"52":345.0,"53":346.0,"54":347.0,"55":348.0,"56":349.0,"57":350.0,"58":351.0,"59":352.0,"60":353.0,"61":354.0,"62":355.0,"63":356.0,"64":357.0,"65":358.0,"66":359.0,"67":360.0,"68":361.0,"69":362.0,"70":363.0,"71":364.0,"72":365.0,"73":366.0,"74":367.0,"75":368.0,"76":369.0,"77":370.0,"78":371.0},"Entry":{"0":"\n\n","1":"\n\nLeft Broken Hill for Adelaide with Australian Expeditionary Force with Engineers.\n","2":"\n\nArrived in Adelaide at 8.30 a.m. Had breakfast & \ncaught train for Morphetville at 9.40 a.m. Arrived at Morphetville camp & \nstarted fixing up latrines, soak pits & tents etc.\nWent to Glenelg (without tea) for a swim. Had tea (a big one too) & \nthen went and saw Kernots. After we went for a stroll & walked back home to camp.\n","3":"\n\nGot up at 6 & \nfixed things up. Went to Adelaide in the afternoon. Saw Uncle Jack & got gold ring from him. Went on the river rowing. Had tea in town & pinched Knife, fork & spoon. Came back to Glenelg in the evening & \ngot back in camp at 8.15.\n","4":"\n\nLeft Adelaide for Melbourne & arrived on Sunday morning.\n\nBroadmeadows\n","5":"\n\nMarched to Camp but was not expected so had to march back to station & then went back to Melbourne. Took Owens to Hospital (or FBM Hosp) went onto camp at Alexandra Avenue. Engineers Depot\n","6":"\n\nTransferred from","7":" Field Coy to","8":" Field Coy as Quarter Master Sergeant.\n","9":"\n\nHad a terrific fall came back as Corporal in No. 4 Section. Didn’t like it very much\n\nOpened Banking account\n\nin Commonwealth S. Bank . Banked 1£\n","10":"\n\nLeft Melbourne with transport for boat. Left Port Melbourne on \nOsterley\n Orvieto at 9 am. Very big crowd to see us off. Band played God Save the King \n","11":"\n\nReached Albany at 8 am. A good many transport boats in beside Melbourne. Rained very heavy in the morning.\n\nLooked grand seeing land again after 5 days on water. Two big islands of rock just before coming into port. A light house & two houses on first one. Must be very lonely there. \n\nMothers birthday today.\n","12":"\n\nNew Zealand troops came into port in the afternoon\n","13":"\n\nGot inoculated for enterics in the morning & had a \nbad\n sore arm by dinner time.\n","14":"\n\nStrict censorship put on all letters post cards & telegrams. Place, & any information likely to let the enemy know whereabouts of troopships is strictly censored.\n\nArm inflamed & sore.\n","15":"\n\nNothing doing just ordinary life\n","16":"\n\nVery funny thing happened today. No parade in the afternoon & 4 of us were playing cards when one of the boys came in & through his white hat at one of us that went clean through the port hole without touching. Lost hat.\n","17":"\n\nLeft Albany at 6 o’clock for England \non the Sydney Menetor\n Menator in the lead & Orvieto following. \n\nChurch parade in the morning by Meth. Minister. Slept all afternoon after having a good read.\n\nCaught Orderly Corporal at 6 o’clock for next day until 6 o’clock\n\nTravelled 44 miles\n","18":"\n\nOrderly Corporal until 6 o’clock.\n\nSick in morning & again just after dinner. Had no dinner, but ate apples instead & of course got sick.\n\nTravelled 241 miles\n","19":"\n\nDidn’t go on parade but stayed in bunk. Went up about 11 & got inoculated again on right arm. Arm sore at night. \n\nTravelled 216 Knots. \nvery\n Rough.\n","20":"\n\nAttended not any parades again.\n\nInoc. Went to neck & made it very sore. \n\nNot a bad day. Big roll. Travelled 219 Knots. Bit tired of things in general to-day. Will attend parades tomorrow & break the monotony of things.\n\nHad a very good concert in the Sergeants Mess in the evening. It was really A1. Went to bed at ¼ to 11 the latest since being on boat.\n\nThursday:","21":"\n\nHave to start thinking about washing dirty clothes. Am getting a big pile. Lovely weather again, but a slight roll on boat. \n\nWent on parade & did physical drill & Knotting lashing & splicing. Menator crossed on the port-side going back to the rear. Travelled 242 miles up to 12 o’clock “Osterly\" passed up tonight at about 7.15PM. Full lights. She looked real well too. She is a sister ship to this.\n","22":"\n\nInstead of going to physical drill at 6.30 washed clothes & had to go to office over it. Only got told to see that was there in future. Easy let off.\n\nVery funny experience last night. A private from inf. Who was drunk came to our cabin (I suppose because our door was open) & was very sick at 3 in the morning. I woke up & thought it was one of our boys in the cabin but it wasn’t. Very nasty.\n\nTravelled 253 miles yesterday & today.\n\nHad a lifebelt inspection & a lecture on earthworks this afternoon. Everyone had to turn out with a life belt on. Came into the tropics today & it is getting real hot.\n\nWent to Mjr. Brand’s lecture on “Ammunition supply in the Pula\". It was very interesting.\n","23":"\n\nGot up & went to Physical Training.\n\nGetting real hot now. Had a half holiday & No 1 & 2 Sections played cricket against G. Coy Inf. Had a washing day & washed sox.\n\nTravelled 253 miles again today. Doing well now. Had a close crop Hair cut. \n","24":"\n\nGot bad news about the English cruisers at Valpariso. Menator came back though line at 6 AM & steamed away. Probably looking for Emden or other German Cruisers. The Melbourne came through the lines & took up the Menator position at 9 o’clock. Plenty of flying fish about. \n\nHad a church parade in the morning.\n\nThe Euripedes had a funeral. One of the soldiers died at 20 to 4 this morning & was buried which we had our church parade. Travelled 234 miles.\n","25":"\n\nNo physical Drill this morning.\n\nThe Sydney went away to the port side & Melbourne left off & took her place, then the Japenese Cruiser came from Starboard side & also went over to her port side.\n\nNext we hear is that Sydney was engaged & made a German beach instead of being sunk. Good luck.\n\nTravelled 239 Knots today up to 12 o’clock.\n\nCopy of Message received later “Emden beached & done for “Good old Sydney.\n\nTwo more deaths today One again on the Euripedes & the other on the Afric. We heard that their disease was pneumonia. \n\nOrderly Corporal again tonight.\n\nJust got word through that the Sydney lost. 2 Killed & 13 wounded & was chasing the collier & the other War Lights went out at 7.30 & everyone was in darkness. No lights at all.\n","26":"\n\nUp at 5.30 ready for Orderly Corporal.\n\nVery hot today. Got news about the Sydney. Captured by German collier took the men off & then sank her. Travelled 249 Knots today.\n\nGot word late tonight that the Sydney was coming back with the prisoners.\n","27":"\n\nGot up at 7 o’clock. Nothing much doing. Only we stopped & all the centre line passed us & then we caught them all up. Expect the Sydney any time now. Travelled 240 Knots today. Doing real well. Attended 2 lectures in the afternoon & then rifle drill.\n","28":"\n\nNothing much doing. Travelled 260 Knots today. A big boat looms in sight. Can’t make out her name only see her color & has 3 funnels. Painted Grey. Got a message from the Jap (she is called Ibuki) saying that the grey boat was the Empress of Asia. She then sent a message saying “Good luck Australians. We sent back “Thank you\". And everything passed alright. Another boat of her type is expected, she is the Hampshire. They are bound for Cocos to fix up the station. Had a lecture this afternoon. & it was stopped owing to a squall breaking in on us. Hampshire never arrived but the Empress of Russia did in her place. All the Sergeants on Deck \nhad\n on the port side to had give up their cabins & make room for the Emdens prisoners. But when the Empress of Russia arrived she said she was going to take the prisoners. So of course it suited us.\n","29":"\n\nEary this morning the New Zealand moved ahead. Not going too fast as they took a good while coming up the lines. They will only get into Columbo a few hours before us. The Hampshire is a \n\ncruiser & arrived this morning & took up a position on the star. side. She sent over all the latest War news.\n\nBeen raining all the morning. Not much drill done. Only phy. exercise & signalling.\n\nTravelled 248 Knots & just passed the equator. Been 37 min. over. it. Nothing much doing.\n\nNos 3 & 4 Sections on guard at 6. & I had to take Orderly sergeant.\n","30":"\n\nOrderly Sergeant today, nothing much doing. Had the drivers drilling them in physical exercise & signallings. Then they had a washing parade. Travelled 234 miles.\n\nHad a half holiday & 1 & 2 sections played cricket against the Infantry. We won. I read & lied down & fell asleep. Have prickly heat pretty bad.\n","31":"\n\nBugle band marched around at 6 am for the first time. Got up & saw land. then went to doctors at 6.30 for prickly heat. Told me to wash in salt water & gave me some zinc ointment.\n\nSydney & Empress of Russia passed this morning about ¼ to 6. Passed a big school of porpoises & a lot of birds hovering around some long fish like eels, which were close to the top of the water. Saw plenty of catamarans. Funny looking boats they are. They are very narrow but deep. Should think about 2’ or 1’6\" wide & on one side they have 2 outriggers (bent pieces of wood with longer pieces floating in the water), for balancing the boat. They may have 2 masts on this is fastened a square\n\nsail more like a blanket than anything else. Travelled 244 miles up to 12 o’clock & only have 14 1\/2 miles more to get to Columbo which we can easily see in the distance. Got in & anchored at ¼ to 2. Coming in noticed a very big brick building like a large Hotel, then saw the wireless plant & a lot of big houses. Mostly white. Plenty of ships in. the NZ & a few of ours besides a few cruisers & the Empress of Russia. The Sydney & Melbourne were in & the Sydney only received one shot. Plenty of green trees about right down to the water A big breakwater wall made of stone protects the ships. The country here is low but about an hour before anchoring it was hilly. There was a Russian 5 funnel cruiser in & just after we came she came out. \n\nThe Hampshire sent her pinnance over with their Capt. & a couple of motor boats with only natives in came out too. One bringing the Governor. Saw a couple of big schooners & a few more catamarans only this time without the outriggers. Well nothing much more happened today.\n","32":"\n\nA couple of tugs keep coming here. They are the Lady MacKay & Lady Inchcape both have only black men to manage them. The smaller craft (the motor boats) are all painted white. The boys threw money down & the niggers grabbed it well.\n\nTwo niggers climbed the masts by their toes to fix up the pulley – which one of the motor boats was trying to tie up here, One of the niggers from her fell in, but very\n\nquickly got out. The water boat came up alongside on the port side & it was the fun of the world watching them. They are manned wholly by niggers & they couldn’t tie up. One of the boats broke away & the tug had to pull it up again. Took them nearly all the morning to get them fixed. Our boys threw down money to them & they would let the ropes go & grab for the money.\n\nThe English cruiser “Yarmouth\" came in this morning. The water boat men are real funny. Two of our boys went ashore & I ordered 6 silk handkerchiefs & a field manual of Engrs. The German prisoners from the Emden. 45 men 2 warrant officers, 2 Officers & the captain also a nephew of the Kaiser’s were the total strength of the prisoners. They came \nonboa\n aboard & the guard fixed bayonets & charged their rifles in front of the prisoners. They were put in the after end & they were stripped & all their clothing examined. Some had on their caps SMS Emden, others 4II Torpedo Division. & Scheiff Artillerie Sch\narez\n warz. The name of the nephew is \nCount\n Prince Franz Joseph of Hohenzollern. Nothing much else only watching the boats coming back with our men. We took on tea, & marrows.\n","33":"\n\nAt 12.30 was awaked by the Kidlets here. The YMCA man had only just got back then bringing oranges, cocoanuts, & bananas. The boys bought & we ate. Got up at ¼ to 7 & felt very tired. It is real hot here in the daytime & cool in the morning & night. \n\nLeft Columbo at 11.20 AM. Before going some natives came near & dived in for pennies thrown in by us. Could get them before they got 1 yard down. Travelled 4 miles up to 12 o’clock. Had a very interesting lecture from 3 till 4 by the war correspondent about the Emden & Sydney fight. The Sydney lost 3 Killed & 13 wounded of which 1 died. & the Emden lost 132 Killed & \n52\n 53 wounded of which 1 officer & 4 men died. The Emden was a complete wreck when she surrendered & fired 1500 \n0\n shots of which 15 took effect. The Sydney wasn’t damaged much at all & fired 650 \n0\n shots of which 70 took effect. We took altogether about 150 prisoners. While we had this lecture the prisoners on board were being exercised. Lights were made very dull at 8 o’clock. Fell asleep in another cabin & woke up at 3.30. Went into my own bunk then.\n","34":"\n\nNo water on. It is getting scarce here. We only took on 100 gall. where we should have taken on 800. We believe our Escort fired 3 shots last night, challenging boats. Our escort is the \nYarmouth\n & Hampshire only.\n\nTravelled 250 miles to 12 o’clock. Went to another lecture on the Sydney Emden fight by Mr Bean the reporter. It was exactly the same.\n","35":"\n\nSame old routine. Travelled 237 miles to day. \n\nWent to a lecture in afternoon.\n","36":"\n\nThe Hampshire went to the stern this morning to meet the Jap “Ibuki\". \n\nTravelled 254 miles today. Can see smoke of the rest of the fleet in the distance. Other boats came up during the night\n","37":"\n\nUp early every day now on account of getting was to wash in issued & if not early only get a little. The late line of ships are away to the port side jumbled up & we heard had had a collision. Travelled 265 miles (the record so far). Just finished reading “Black Dwarf\" & “A Legend of Montrose\" by Sir W. Scott. Have started “Kenilworth\". It had been rumoured that the Ascanius & Shropshire collided last night & has now been confirmed.\n\nOrderly Corporal again tonight. Played cricket this afternoon & made \/ & got a couple of wickets. Real hot. Am real fat must weight a good deal now. \n\nReg Titford’s 25th Birthday & we all celebrated it (14 of us). They had beer, stout, lemonade, & cake. Real good old time we had.\n","38":"\n\nUp early being orderly Corp. The Suffolk has broken down again & the Hampshire went back to have a look at her. Travelled 257 miles today. Hampshire came along twice & is coming again at 5 o’clock to take on board provisions.\n","39":"\n\nGot up early & had physical training. Land in sight on port side & find out is island of Sokotra. Very hilly place & looks like if had been volcanic. Travelled 269 miles today. The island is very long & high. It has 12000 inhabitants.\n","40":"\n\nNothing much doing on sea is very calm & smooth. Travelled 271 miles. Calm lasted all day.\n","41":"\n\nLand in sight at 6.15 Am. Came in to Aden & dropped anchor at 7.30. Two larger promontories of nothing but rock to entrance. One on starboard side has 2 lighthouses & about 3 signalling stations. No trees or grass & no jetty or wharf. Travelled 295 miles. Natives came over to us from the shore selling tobacco, preserved fruit, post cards etc. Fired a blank off to frighten them away. A S.M. threw some water over them & nearly got thrown overboard for doing it. The place itself is placed near the shore & behind are the big rocky mountains. A clock is placed on a hill \nin the\n town & has only its . Quite lonely it looks. It isn’t lit up at night either. A very good search light is used by the garrison stationed there. Have a headache & sore chest.\n","42":"\n\nLeft Aden at 5 AM & going straight to Port Said.\n\nPlenty of news yesterday about war. \n\nTravelled 66 miles up to 12 o’clock. \n\nLand all along our starboard side & at 1 o’clock land on port side (Africa).\n\n Passed the island of Parim at 4 o’clock. Very bare, has a lighthouse & a small town on it. also a couple of wrecks. Reread all letters from MG & mother tonight.\n","43":"\n\nLand in sight. only islands on star side. Travelled 262 miles. Both the Hampshire & the Geelong came along side for meat & take off her firemen.\n","44":"\n\nNews that we land & go into quarters at Cairo in Egypt as a garrison. Good. Everyone is excited over the news. Travelled 257 miles.\n","45":"\n\nHad a marching order parade at 9 o’clock. & a church parade at 10. Opposite the Daedalus lighthouse at 11.45 which is 365 mile from Suez. A S. Ship is stationed there as a provision boat. Travelled 382 miles today. Opposite the Brothers Islands (two) at 6 PM. Lighthouse on one which has acetylene light. Got up at 11.30 PM. & got some eucalyptus & had it rubbed in. Very bad cold on chest & hurt when coughed.\n","46":"\n\nLand in sight on both sides when got up. Landed in Suez at 10.30 & dropped anchor. Plenty of boats came alongside for selling goods but were sent away. Had a pay day & received 30\/-\n\nSuez looks a quiet city & town. All house are square & white. No verandahs. A couple of poppet heads whether for water or views I don’t know yet. Our boys on guard today on the prisoners. At 1 o’clock the relief came in & when easing springs one of them McMinn fired a cartridge off. It hit one of the guard in the arm but not seriously. Was standing about 5 yds away from them The Prins der Nederlanden a Dutch boat came in just after us. Received\n\nletter from Madge today. Posted on","47":" at Adelaide. Left Suez at 3 o’clock & started in the canal which is 89 miles long & about 2 chs wide. Passed some English Field Engineers on the track, Also. Egyptian & Indian Engineers guarding the Canal.\n","48":"\n\nFinished the canal at 6.30 am & arrived at Port Said. Dropped anchor at 6.50 am. Two French cruisers & a couple of English in & an old vessel dismantled & all guns taken off her. A very big place. Plenty of niggers on coal boats. Coaled & took water. Coaling done by niggers with baskets. Got an old tin ring & some Egyptian money. Had a muster parade & a few missing. Had sneaked ashore & were all caught when coming back.\n","49":" weeks on 4th from B. Hill\n","50":"\n\nN.Z. came in early. A. Coy. Inf. Went ashore to act as advance party or putting up tents etc. at Mena. An Arab funeral on shore. See the hearse painted black & gold\n\nRaised anchor at 3.25 PM. & started for Alexandria. A few NZ & a couple of our boats went ahead. Got a letter & parcel from Wah gunyah. Saw a brawl & one nigger run in.\n\nThursday.3rd\/ Nov 14.\n\nDroppe\n When woke up were coming into Alexandria & was alongside wharf at 7 o’clock. All bustle in the morning bringing Kits up & putting them on train. Saw the native police give some of the niggers hidings with their canes.\n\nChanged £ 1 & got 97 ½ piastres Went up street for 2 hours & drove around Alexandria Had a real good look at the town. 500000 people live here & 800000 at Cairo. When came aboard was orderly corporal so went on duty. Very funny. Plenty of drunks & we sent out a patrol to bring in the drunks.\n","51":"\n\nOrderly Corporal. Plenty of work today. Had to parade a few of the drunks for duty in hold. Entrained at ¼ to 2 & left at 3.30 pm. Arrived at Cairo at 8.30 pm. The country is very well irrigated all the way & very green at present. Saw 3 or 4 cemetries. plenty of date palms.\n\nGot out at a siding ¼ mile after Cairo. Picked up Stylo pen when getting out of train. Went to Mena in electric cars & camped at foot of pyramids in sand. Eat sand & drink it.\n","52":"\n\nWent to have a look at pyramids from hill. Large one is 457 ft high. Altogether 9 of them & sphinz. Camped on edge of Saraha Desert. Windy & of course plenty of sand to eat. Put up tents all the morning. All meals on tin meat & dog biscuits so far. Plenty of donkeys here.\n\nHard work today putting up tent for Head quarters. Went into Cairo in the night & saw some real sights. Dirty & clean both, but dirty predominantly Went right through the slums. Real funny there too. Got home at 12.30 & had a row with the cabby over his fare. Wanted 20 piastres & we only gave him 10 for two of us. Am learning Egyptian very slowly.\n","53":"\n\nParade as usual. Put up tents all day. & went into Cairo in the night Got some very small money & had a real good talk to an Egyptian who spoke English very well. Bought stamps & had a look at their fire station. Very up to date. 2 motors 2 pump & a man ladder besides horse ladders & a chemical pump. Went to Post Office & posted letters home etc. Bought a 1915 diary cost 15 piastre\n","54":"\n\nOrderly Corporal again last night. Went to Cairo with mail & went to jeweller & bought a silver chain, identity disc. Have to call for photo on Thursday. \n\nWas mail collector yesterday\n","55":"\n\nCold in the night. Wrote in the afternoon & went over the pyramids & sphinx in the night. The big pyramid is 451 feet high 75 ft square at base & 4731 BC. years old. Queen Harmakus & King Cheops were both\n\nburied in the pyramid. Saw the Queen’s burying chamber & the Kings also saw. his coffin. In the rear of the big pyramids there are 3 smaller (or rather more to the left than rear) The Kings 3 daughters were buried in these. In the rear of these there is again the place where King Mena was buried. He can’t be found. This place named after him because of it having been a city in his time. Saw the coffin or Sacaphagus where Mena’s daughter was buried. Saw the Sphinx. Nose was knocked off by Napoleon. Then alongside of Sphinx is the Temple of the Sphinx. The family of was the only thing found in this. Rained all the time we were going over.\n","56":"\n\nRained all night & of course made it cold. First rain for a couple of years. Nothing much doing all day. Bill Adams came over and saw me.\n\nThursday.10th. Dec.14.\n\nPosted more letters home. Nothing unusual. Went to Cairo & got etc. & met a fellow who wants me to exchange stamps with him. Caught a car at 9.35 & got home at 12.\n","57":" 11th.Dec 14.\n\nBroken Hill boys came during the night. Met most. of them in the morning. Went down to the infantry lines & made a rifle range.\n\nWent to the city & got etc. Got a few stamps from a Maltese.\n","58":"\n\nPut up tents & took notes from old papers I had. Got a tent for the corporals (only 7 of us). Got payed in the night. Collected £ 2 = 195 piastre\n","59":" .13th.","60":"\n\nSwimming parade & general leave from 1 P.M. till 10 PM. for us.\n\nOrderly Corp. again tomorrow. Went into the city at 3.30. went around a bit & came home at 10. Was told off by Mr Dawkins.\n","61":"\n\nThings getting stirred up in the company. All the sergeants reported for neglect of duty, (for not reporting men absent.) Nothing much else doing so far. Went into the city & had a good feed of oranges.\n","62":"\n\nSame as usual. Went down to the rifle range & worked all the morning & got hooked for corporal of the Quarter Guard. Had 9 men. On for 24 hours from 2 PM to 2 PM tomorrow. Stayed awake most of the night. Got a prisoner sent in. Saw the morning Star & a very pretty sunrise.\n","63":"\n\nVery pretty sunrise. Nothing startling happened. Knocked off guard at 2 o’clock & went into the city at 3. Went out to Heliopolis. Very good & large stone buildings. Had a look all over Luna Park. Has tea & didn’t pay for it. Bought a fez (cap). Came home at 11 P.M.\n\n","64":"\n\nWorked on Sergeants Mess all day. 4 of us went into city in the evening & bought & stole a few items. Payed 100 piastres for a shawls & 50 for others. Payed altogether 150 piastres for 4 silk shawls & 1 silk handkerchief. Am sending 1 to MG. & 3 home to mother & Chris & Madge. Got home at 11.\n","65":"\n\nWorked on Sergeants Mess \n\nEgypt made a British Protectorate & a 101 shots were fired as a salute from the citadel. All leave stopped for us on account of a man being absent in the city without leave. Tom Norton’s brother came over to see me.\n","66":"\n\nAl leave was stopped yesterday because a sapper was away without leave.\n\n& we have to wait until he comes back before we get leave again. This morning a grave was made. It had a cross with a tomato on top & some green stuff. A couple of beer bottles with inscriptions on. Biscuits & a skull. The inscriptions were many but here is a couple.\n\n“Specially erected for Sapper Fuller who departed from the lines. Deeply mourned by all Sappers\"\n\n“Here lies the body of Sapper Fuller who Killed general leave at Mena on 18th. Dec 1914.\n\n A couple of notices on the board were. “Its nice to be full, but it will be rotten to be Fuller.\" £ 100 reward for sapper Fuller. Finder please return to No 3 Section\"\n\nHad a football match (scratch) in the afternoon. A very good game. Came home at 11. Met some French boys. one’s \nSunday\n name was Morel too. Am going to meet them tomorrow. Received 2 letters from Nath & mother .\n","67":"\n\nWent for a swimming parade & the water was too dirty so no one went in. Two of the French boys called in the morning & I took them into dinner in the Sergeants’ Mess. Went into the City, way up to the end of Mousky Street & went into a picture show at 5 & came \n\nout at 8.30. Came home at 11. Eygpt was proclaimed a British Protectorate too Plenty of new Eygptian flags kicking about. The flag has 3 crescents & 3 Stars on a red ground.\n","68":"\n\nNCOs marched up & down the hill all the morning. A route march in the afternoon & I got a blister on my heel. \n\nWrote 3 letters & went to bed early.\n","69":"\n\nCold this morning. \n\nWent for marching both in the morning & afternoon \n\nwent to city in the evening.\n","70":"\n\nCold again. Big marching order parade all day. \n\nWent all over the desert \n\nleft at 9.30 & got back at 4.15. Went out to Sheeshara tonite. Some real lovely granite there. A big hole & all this granite in it.\n\nComing home saw the American & his party digging for the ancient mummies etc. Saw 2 lads climb the second pyramid. (Only a \n\nfew have climbed it).\n\nPassed the Sphinx & all the pyramids near Mena. Wrote some more on to the letters.\n","71":"\n\nMarching again this morning. Pay day this afternoon. Collected 10\/6. or 51 piastre.\n\nWent to see No 3 Coy. sapping & mining. Going to the city tonight. Went to the city & had a good time. Came home at 11.30 PM.\n","72":"\n\nChristmas Day.\n\nHad a check parade at 7 o’clock in the morning.\n\nWent out towards the pyramids & met a lot of Egyptian students. Played football after saying prayers & singing etc. Came home after showing them the sappery & mining of No 3.\n\nHad dinner at 1.30. & had for dinner. Geese & meat. potatoes & cabbage. Jellies, custard. pudding fruit (apples & oranges). almonds & raisins. Plenty of wine on the table too. In fact a very good Xmas dinner. Went to the Zoo in the afternoon\n\n& had a look round.\n\nLion & lioness with 3 cubs. Giraffe (terrible height), vultures, Australian parrots of all descriptions, hyena’s & Egyptian foxes. & many other natives of Egypt. Heard an Egyptian band, composed only of boys It was very good. Has a very bad heel & could hardly walk. Had to limp. Went into city & came straight back. Rode a bicycle home from the Armenue as heel was so bad. \nGot a letter from M.G. dated 4th\n \n","73":"\n\nBoxing Day.\n\nWent to doctor with foot & had the skin cut off from the blister. On light duty so am going to write letters. Got a letter from MG. dated 4th. Nov. saying she met Marj. Stayed home all the afternoon & went into the city in the night. Only walked about & came home at 11.00. Went in motor car & came home in one. Had a bosker race coming home\n","74":"\n\nGot up in 5 minutes was very nearly late. Went for a swim in the morning & played football. French boys came out & had their photo taken in our clothes.\n\nTook a car into city in the afternoon & went with the french boys to their debating society. Everything was in french but I enjoyed it. They sang & recited in french. I sang. God Save the King & Tipperary for them. Went for a walk after & had tea. Left society at 7.15. After tea went for a walk towards the boy’s home. After leaving them went to Saults & had supper. Came home at 11.\n","75":"\n\nTook over duties from No 1.\n\nSent on to the lines repairing them. Very funny this morning. Detailed for line repairing – got taken off & told for guard. guard knocked in the head by the Comm. Enges. & then had to go as an escort for 4 prisoners.\n\nThen waited for next job. \n\nWas line rep. Went on it all day. Went for a run after tea\n\n& had a rub down. Had a lecture at 7 am Field work. Went to bed at 8.30.\n","76":"\n\nWe started trenching & sapping. on the flat. before the camp. worked all day & after we had finished No 1 section came on shift. No 1 is also sinking 3 shafts & driving into each one. Went into the city & met the boys but came home early as they “had to go home\" very early. Reg Titford was sent to Hospital with influenza\n","77":"\n\nFalse alarm for a parade. Yesterday told we had to parade at ¼ to 7, after getting up told it wasn’t till 8.30. Took sick to parade & when came back was detailed for orderly Corporal as the man detailed before was in the hospital with a bad back. \n\nDid orderly corporal all day & at 5 PM had to go on trenching until 12 AM. Plenty of work. A march past by ½ this camp before Geo Reid.\n\nHad a payday but I didn’t collect \n","78":"\n\nGot up at 7.30 & had breakfast in pygamas. Then went back to bed. Got up at 11 for a lecture. Went to Geo Reid big parade at 2 o’clock. He spoke to us but we couldn’t hear much. We marched past him. The parade was very good. Went down & found Major Bennetts tent but he was at Mess, so couldn’t see him. Went to bed at 8 o’clock & asked to be awakened at 10.30 but woke up myself at 12.5. And so started the new Year.\n\nMust start a new book now so good night or rather morning.\n\nFinished\n\n"}}