{"Document Name":{"0":"Diary_0282","1":"Diary_0282","2":"Diary_0282","3":"Diary_0282","4":"Diary_0282","5":"Diary_0282","6":"Diary_0282","7":"Diary_0282","8":"Diary_0282","9":"Diary_0282","10":"Diary_0282","11":"Diary_0282","12":"Diary_0282","13":"Diary_0282","14":"Diary_0282","15":"Diary_0282","16":"Diary_0282","17":"Diary_0282","18":"Diary_0282","19":"Diary_0282","20":"Diary_0282","21":"Diary_0282","22":"Diary_0282","23":"Diary_0282","24":"Diary_0282","25":"Diary_0282","26":"Diary_0282","27":"Diary_0282","28":"Diary_0282","29":"Diary_0282","30":"Diary_0282","31":"Diary_0282","32":"Diary_0282","33":"Diary_0282","34":"Diary_0282","35":"Diary_0282","36":"Diary_0282","37":"Diary_0282","38":"Diary_0282","39":"Diary_0282","40":"Diary_0282","41":"Diary_0282","42":"Diary_0282","43":"Diary_0282","44":"Diary_0282","45":"Diary_0282","46":"Diary_0282","47":"Diary_0282","48":"Diary_0282","49":"Diary_0282","50":"Diary_0282","51":"Diary_0282","52":"Diary_0282","53":"Diary_0282","54":"Diary_0282","55":"Diary_0282","56":"Diary_0282","57":"Diary_0282","58":"Diary_0282","59":"Diary_0282","60":"Diary_0282","61":"Diary_0282","62":"Diary_0282","63":"Diary_0282","64":"Diary_0282","65":"Diary_0282","66":"Diary_0282","67":"Diary_0282","68":"Diary_0282","69":"Diary_0282","70":"Diary_0282","71":"Diary_0282","72":"Diary_0282","73":"Diary_0282","74":"Diary_0282","75":"Diary_0282","76":"Diary_0282"},"Date":{"0":"unknown","1":905.0,"2":906.0,"3":907.0,"4":908.0,"5":922.0,"6":923.0,"7":939.0,"8":942.0,"9":943.0,"10":944.0,"11":945.0,"12":946.0,"13":947.0,"14":1080.0,"15":1081.0,"16":1082.0,"17":1085.0,"18":1086.0,"19":1087.0,"20":1088.0,"21":1089.0,"22":1090.0,"23":1091.0,"24":1092.0,"25":1093.0,"26":1094.0,"27":1095.0,"28":1096.0,"29":1097.0,"30":1098.0,"31":1099.0,"32":1100.0,"33":1101.0,"34":1102.0,"35":1103.0,"36":1104.0,"37":1105.0,"38":1106.0,"39":1107.0,"40":1108.0,"41":1109.0,"42":1110.0,"43":1111.0,"44":1112.0,"45":1113.0,"46":1114.0,"47":1115.0,"48":1116.0,"49":1117.0,"50":1118.0,"51":1119.0,"52":1120.0,"53":1121.0,"54":1122.0,"55":1123.0,"56":1124.0,"57":1127.0,"58":1128.0,"59":1129.0,"60":1130.0,"61":1131.0,"62":1134.0,"63":1137.0,"64":1138.0,"65":1139.0,"66":1140.0,"67":1141.0,"68":1142.0,"69":1143.0,"70":1144.0,"71":1145.0,"72":1146.0,"73":1147.0,"74":1148.0,"75":1149.0,"76":1150.0},"Entry":{"0":"\n\n​​ \n\nWednesady ","1":"\n\nWe arrived at marseilles today at eleven am after 5½ days sail from Alexandria & having arrived at marseilles all preparations were made for disembarking that afternoon about 3pm we left the wharf and marched through the town on to the railway Station we all got aboard there train there and about 5.30pm. the train moved out on a 3 day journey to the north of france. the people were all allong the railways waving and by all appearances glad to see us This is where I seen the first German prisoners They were working on the wharf under\n\n​\n\nan armed guard.our Boyshooted them when they seen them. They looked as if they did not mind being in the care of the francs.\n","2":" The 8th.16\nno sleep last night. we were all to busy looking out of the window at the towns it is raining at present and the boys are running about as if the sun were out. we are stooped for Breakfast The french people are about the train selling all sorts of nice things They are doing a good Biz.\n\n​\n","3":" The","4":" 1916\n\nAfter three Day Journey from theSouth to the north of france we have at last arrived we pulled up at Bailleulabout 4pm this morning we passed through Some Big towns and seen some of the most beautyful country that I have Ever seen we are now Billeting at Steen Jee in a barn about 5 miles from the firing line we will be there soon\n\n \n\n​\n\nname of Streets \n\nShaftsbury Avenue\nQueens St.\n\nThe White City\nEmma Avenue\nStannary Avenue\nmoat farm\n\nWe marched from Fricourt farm this morning and our destination is Bapaume which we will reach late tomorrow afternoon. The distance to Bapaume is 7 miles up till last night we were have fairly good weather but it rained last night and today the roads are very muddy and things very uncomfortable for us The town Hall in Bapaume was blown up last night by an machine planted by theGermans There was 200 casualties\n\n\n\n\n\n \n\nWIRELESS NEWS\n\nany man found Bird nesting in Woodmans land will be considiablylowered\nany man found damping down the hard out in no mans land will be severely dealt with.\n","5":" 2. 17\nRibemont\nnothing much doing today Went to Heillyonce this morning We are in snug billets for aweekand then wil go back to Mametzand in the line once more\n\n\n\n\n","6":"\n\nMametzCamps\n\nOh it's raining again and that spells more unpleasantness for us because it means that we will have to wade through the mud Somme mud is the worst in france up till now it has been snowfrost and sunshine no aeroplanes over this morning on account of the clouds lying so low. Nothing at all doing today\n\nMcClintock\n","7":"\n\nreceived letter from A Corrigan andBob a few days ago. also one from \n\nreceived 3 papers from Bob and one letter from lena parcel from Dad and Birthday Card from mother\n\n","8":" 2.17\n Camp the roads has been mixed up to a paste from the continual flow of traffic on it things are going to arrive in a few days time\n\n\n","9":"\n\nPte JG Corrigon was killed in action on the above date. Essie Corrigon wrote and told me the news\n\nletters received last mail","10":" in France ","11":"\n: replied\n\nmales recieved 20th July 1916\n: replied to\n\nEssies received 31st July 1916\n: replied to\n\nMrs Coopers received 26th July 1916\n replied to\n\nJess received July 29th 1916\n replied to\n\n\nWent to Fricourtthis morning with 2 carts of water going - \n- more shells over today \n13th Bn\n\n\n\nWounded\nAugust 10th\n\n\n\n9th Feb 1917\nthere is nothing much doing today we are going back to Mametz Camp this afternoon\n\n9th Feb 17\nMametz camp things rather quiet today The will be in tonight - some time\n","12":"\nMametz Camp\nallsettled down again - after the unit water cart out of order\n\n11th FEB\nMAMETZ\n\nThis afternoon The Huns fired HEschrapnel across our Camp and Killed 2 men. He put about 30 shells across - things quiet.\n","13":" on page 23. \n","14":"\nin CRS camp things are not too Busy today.\n","15":"\nIn CRS Camp\nThings have been rather quiet here today Still very cold\nheard the Boys\n\n\n\n\n\nwill up when winter comes properly\n\nThe","16":" Brigade go into the line on the 3rd of Dec and home on the 15th for a month spell\n","17":"\nCrs on the Somme front\n\nThings are very quiet here today and very coldbut my complaint has not improved any since I came into this camp and I dont think there is any chance of it doing so as this place is very damp\nBattalion went into the trenches yesterday\n\n14th \n","18":"\nin Crs on the Somme front -\n\nI am still in the rest Camp and find that I am not getting any better. This camp is too damp for any one to make any improvement. My life is no better now than when I first came here\n","19":"1916\n\nIn the Corps rest stn on the Somme front.\n\nThings are still very dullhere. The Doc made his usual instructions This morningI am going to ask himto put me out as I amnot feeling any Better. I can be Doing work withmy battalion There I will be DoingSomme good. Here I am doing nothingBut lying around the camp all day.\n\n\n","20":"\n\nAlbert\nI came out of hospital this morning and not feeling any Better than when I first wentto hospt but I asked the Doctor to let me join my unit which he allowed me to Do. We are now in the rest camp about 600 yards from the above named town. There is not much Difference here than what there was 3 months ago when we passed through here.\n\n\n\n\n\nmy Division Comes out of the trenches tomorrow some time they are going back to which is about 8 miles from Albert\n","21":"\nAlbert\nOh more rain whenever will we get some more sunshine I have only seen the sun once in the past fortnight Things arevery quiet This morn I was on fatigues Building a Bridge and needless for me to say we made a good job of it.\n\n\n\ntoo. We are going to remain here until tomorrow and then the comes out and we join them once more I hear that we have all down the line Met Jim Hurley this morning he has just come back from Blighty leave\n\n 3 17\nBapaume\nWas up at 6.25 this morn and into Bapaume for water arrived home at 10-30 had Breakfast by 11 177\n goes in this afternoon and again in the morn Cannot hear any guns firing today rumour goes thet the huns are on the again\n","22":"\nAll well today\n","23":"\nNothing much doing today arriving Ribemontabout 2pm and rejoin the 13th Btn\n","24":"\nQuiet here to day \n","25":"\n\nNothing doing to day About 100 men reported sick this morning\n","26":"\nRibemont\nNothing to report\n","27":"\nRibemont\nThings still quiet\n","28":"\nRibemont\nStill in the above \n\n\nvillage. I have been informed that I am due for leave in a few days time\n","29":"\nRibement\nSgt Plaistow has just told me that I am going on leave tomorrow night Oh wont I have a gay timein London town\n","30":"\nRibemont\nhave just been told that I am not going on leave tonight as major marks is going in my place I am supposed to go tomorrow night\n","31":"\n\nPte Geo McClintock\n17th Btn\n\n15th Dec 1916\n\nAt 4,30 this morning we left Ribemont bound for Havre and then on again to Blighty. The we aredue at Havre some time in the morning\n\n22nd March 1917\n\nOnce more we are on the move at 9 - 0 this morn We left Ribemont and arrived in the Camp Fricourt farm about 4 pm the march passed off without mishap Fricourt farm is about 1½ miles from mametz camp\n\n\n","32":"\n\nWe arrived in the above town about 3 am this morning\nat 1-30 we are to fall in and get our warrants stamped\ntime 3 pm passes have been stamped We leave for Southampton tonight\n\n23rd 1917\n\nWe are now settled down in our new Camp and things are going along Quiet peacefully no shells has come this way since since we arrived here a german prisoner was captured he was wounded in the leg\n\n17thDec 1916\n\nWe arrive at Southhampton This morning about 9 am and entrained for london at 9.50 which we hope to reach about 1 pm\n\ntime 3 pm have just landed at Waterloo\n\nThe War office\nThe Navy office\nThe General P.O.\n\n18th Dec 1916\nOn board ship bound for Belfast\n\nThe time is 11.39 and am on board\n\nThe Steamer bound for Belfast So far the Ship is not rocking much Drew£10 from the Com Bank\n\n24th\nadmitted to FA Sgt Coleman and another unknown Captain unknown ?\n\n12th Feb 1917\nMametz Camp\n\n13th Feb\n--------Do\n\nfritz aeroplanes came over this morning and dropped bombs no one hurt.\n\n14th Feb\nMametz\nGerman planes over again this morning more bombs but no one hurt\n\n15th Feb 1917\nMametz\n\nNothing doing. more aeroplanes over this morning no bombs dropped\n\none man for ambulance. name pte McDade c Coy","33":" Btn.\nComplaint Bronchitis\n","34":"\ntime 8-30\n\nhave just arrived at Belfast Bound for Ballymena to see my Auntie \n\nTime 10.30 am had a walk round Belfast and think it a fine town\n\ntime 11 30 am on board train bound for Ballymena\n","35":" pm have just landed at Ballymena having had lunch and on my \n\nway to Racavan \ntime 3 pm have just arrived at Aunt's place and they have received me \n","36":"\nRacavan\n\nThings\n\n\n\nrather quiet here today having only just got out of bed 7 pm\nall well at the \n\nRacavan \nIreland\n22nd Dec 1916\n\nStill Snowing today But not too cold. went into Broughshanewith Minnieand went to the Doctorwho tells me that I have Bronchitisand gave me a Bottle of medicine to take he said that I ought to go into hospital when I arrive Back in France. he would not take any money for Examining me. his name is Dr James McMaster he knows that \n\ntoday is the Second anniversary of my departure from Aust in 1914. Since that time I have been to the following places\n\nEgypt Dardanelles Malta Greek Is France England Ireland and the last the best of all. Go into Ballymena on a \n\nWinnie and I went into Broughshane on the the roads were very slippery\n\n\n\n\n\nRacavan\n23rd Dec 1916\n\nSnowed very heavy last night its about 3 inches thick on the ground but one cannot say that it is too cold its what you would call \nThis afternoon Minnie and I went up to the Banks and seen the stacks of pete and the place where Dad used to the petewhen he was a boy in this country Some years ago I dont suppose when he left he ever thought that one of his sons would\n\nEver be on the very same ground. The view from the mouintain over looking the is beautiful indeed\n\nMinnie says that it is much prettier in summer time than what it is now whilewe were going to the pete bank but she did not succeed once in doing what she wanted Oh dear no was too good \n\non my have had 2 doses of of medicine today and felt much better than what I did yesterday afternoon Tomorrow is Sunday and I leave on monday for france via Scotland and due to arrive at St pancras station London on Tuesday morning at 8 am\n\nRacavan","37":"\n\nnothing doing today Minnie sitting by the fire but will not talkno doubt She is thinking of her Boy who is in \n\n\n\nFrance fighting for King and Country in the Somme mud.\n\n25th Dec 1916\nRacavan\n\n and uncle drove me into Ballymena today But I will have to wait untill \n\n36162 Driver HG \n3rd Canadian Div\nSupply Column\nBEF\nFrance\n\ntomorrow night for a train\n\n26th Dec 1916\n\nstayed at uncle Roberts place last night am leaving here tonight for London\n\nNo 5171Gunner Len P. Hay\n3rd Bde AFA\nFrance\n\nNo 5171 Gunner L P \n3rd Brigade AFA\nFrance\n\nNo5171Gunner LP.Hay\n3rd Brigade AFA\nFrance\nowes me 5\/- borrowed in London December 1916\n","38":"\nLondon\n\narrived London at 10.30am am not going to france until tomorrow night one day late Things quiet in London today\n\n22.4.17\nWimereux\nI am now stationed at 2nd G Hospital which is just out of Boulogne 7 days ago I came here from the 13th Battalion which I was with for 2½ years this hospExchanged with me and is at the present with the","39":"Things down this way do not seem to bad but one cannot express any sort of an opinion being here such a short time Joe should be here with him in a few days he is Changing with pte who is more than\n\n\n","40":"\nFricourt farm\n\nWe were supposed to move to Bapaume this morning but the move order was cancelled at the last moment We are moving tomorrow at 9 AM not being much doing around this place just now altho this morning and last night there has been a heavy bombardment going on The huns were supposed to have made three counter attacks on the British troops last night all were repelled with severe losses to the enemy Joe has gone to this afternoon to have a look at the\n\non friday night last the Germans sea fleet bombardedCalaisinflicting 2000 casualties on the civillian population of that city The British met them at 10.30 same night and sunk three destroyers belonging to the germans We could hear the bombardment from here Boulogne some 29 Ks away from the scene of action 100 cases sent to Blighty this afternoon Lucky chaps or unlucky Idont\n","41":"\nLondon\n\nthe awful fog that was inLondon last Night has cleared away thismorning Not to bad am leaving here this afternoon at 4 pm for france and will arrive at havre in the morning sometime\n\n13th March 1917\nRibemont\nFrance\n\nThis will be the first account of my happeningsince we left mametz This is not much to keep of while we are in ribemont for the past 2 weeks We have been in this village and the work has been the same every day going to once per day for water & this afternoon Yorkie and I went to to a Boxing Exhibition it was not too dusty\n\nand back again to the muddy Somme once more am I sorry that I am on my return journey yes I am but it is over there where duty lies and we must go my trip to Ireland I shall never forget for many a day to come Every\n\nbody treated me with the utmost kindness and auntie and the family could not do enough for me one day I hope to see Ireland again this morning Ibought Minnie a bracelet and sent it to her This afternoon\n\nI do hope that she will not be offended when she receives it. She was so good to me during my stay there and was my guide where ever I went On the","42":" we went out to uncle Roberts and stayed there the night\n\nWe left the on the","43":"for Ballymena where I left for Larne Harbour and across to Scotland The distance from Crumkill to Ballymena is 2 miles\nhats off toDear old Ireland\n\n\n\n19th 217\nMametz\n\nWent for four carts of water to day to things very quiet started raining\n\n16th 2 17\nMametz Camp\n\nThis morning while the troops were sleeping a german aeroplane made a raid on our ammunition dump I am sorry to say that he caught 2 of them one about a mile away has been exploding all day long This dump was thousands of shells and bombs have ben exploding at other dumps has been going\n","44":"\nHavre\n\narriving from Southampton this morning we are now awaiting a train to take us back to the Somme one goes at 6-30 in the morning and we go too\n\n29th 12 16\n\narrived from Southampton this mornong We are now awaiting a train to take us back to the Somme which leaves here at 6.30 am this morning more Glorious mud to wade through oh this is a war Co\n","45":"\nHavre\n\ntime 2-30 pm\n and myself have just been for a stroleround the wharves but we did not remainlong as the smell was enough to knock one We are going to try and get across to Havre to night byhook or by crook\n\nThis book is the property of private G McClintock\nNo 63 13th Batn\nAMC\n4th Brigade","46":" Division AIF\nFrance\n","47":"1916\non Board train Bound for amiens\n\nat 6 this morning we left the Docks RestCamp and marched to Havre Railway Station through a heavy downpour of rain needless for me to say that we received a drenching. I am writing this in the train at some wayside Station and it is still Raining I have just come to the conclusion that this country was made for Ducks to live in not men. Well my trip to the old country is now at an End. But it is one that I will always be able to look back with the fondest memories I was in England Scotland and lastly But the best of all was Ireland. Some day if god Spares me, I will go again\n\n\n\nwe are due in Amiens some time tomorrow morning I should say about 7 am Wrote a pc to Minnie yesterday but cannot post it until I return to the Battalion But met Jordan at havre last night he goes to Blighty tonight with 9 others of the","48":" Battn\n\nNight time\nhave been travelling all day in the train and its raining like one thing Since tuesday night I have been on my way back Tuesday night I left Larne Harbour in Ireland and went to Stranraer by boat from there I caught the train forLondon via Scotland arrived there at 10.30 wednesday morning stopped that day in London and left waterloo station at 4 pm\n\nOn Thursday afternoon arrived at Southampton 7:30 went on board Ship again and across the English Channel to havre where we landed on Friday morning at 8 Stayed in the RestCamp at caught the train at 6.30 this morning we will arrive sometime in theearly morning at Amiens where we will join up with the Battalion.\n\n31 12 16\nCoisy\n\narrived home at 12pm today from Blighty arrived at amiens at 2AM and rested in the YMCA until 8pm and then we met geo Smith and they showed us the way home it is raining here tonight\n\nand no doubt tomorrow New year sports will be postponed we are leaving here on Tuesday for Ribemont and back into the trenches once more Wrote to Auntieand Cousin Harry to night\n","49":"\nCoisy\n\nOh oh what a rotten possie we are in Coisy is its name But cannot say that it is what one would call Cosy. Since I have been away to Ireland the sick parades have deminished a lot When I left they used to be 100 strong now they are not more than 30 strong Joe goes away to Ireland on leave tonight and hopethat he has a time like I had and that\n\n\n\none of the best times that I have hadsince leaving australia in 1914. Tomorrow we are going to march to Ribemont Distance 15 miles we are on our way back to the firing line which is on the Somme In a few months time from now the allies are going to smash thegermans to atoms We will have more guns and ammunition than ever we had and best of all we are going to havea million fresh\n\ntroops oh Kaiser will need to look to your laurels in the near future for a certain we are going to crush you and your army in the spring and the war will end before next xmas that is the belief of every allied soldier today\n\nGH Grant returned to the Btn today 29th March 1917\n\n2nd\/1\/14\nRibemont\n\nMarched from Coisy today andwas very tiredat the end of the day. We are to stop here for a rest, and then we are going to go up closer to the trenches. We have not received any Xmas mail yet the roads are very muddy oh that Somme mud I wrote to auntie yesterday and Minnie from Havre nothing more today\n\n\n\n\n","50":"\nRibemont\n\nWent to Heilly this morning with the water carts The roads were very muddy indeed.\n","51":" Ribemont\nJust the samework as before I received 8 letters from Aust last night it was Xmas mail\n","52":" Ribemont\nThe sun is shining like one thing and roads may have a chance to dry up. Went to Heilly this morning\n\nand filled the cart up This afternoon the Bde stretcher bearers\n","53":"\nRibemont\nI went to Heilly this morning and again this afternoon for water the reason why I made 2 trips was that tomorrow morning we are leaving Ribemont for Mametz wood which is about 9 miles from here. and the water will be needed on the march up. We are to relieve in the line for 6 weeks. then we come out and go up north again. I suppose it will be somewhere about Ypres or Bois Grenier again when we left those positions some months ago things were very quiet have not received any news\n\nfrom Minnie yet. No doubt one ought to come along shortly it rained here last night so you can bet the roads are very muddy they must be terrible up the line. By this time nothing more to mention for today Thomas has not arrived yet I do not know what can be delaying him at all he is 9 days he may reach home tomorrow sometime lets hope so at all events\n\nAu Re Voir\n","54":"\nMametz Wood\n\nWe have just landed at the above wood which is about miles from Ribemont We left Ribemont at 8 this morning and reached here about 1 pm the roads are very muddy indeed I have received orders that I am to go to Quarries Siding in the morning with A and D Company They are going up on fatigue duty\n","55":"\nQuarries Siding\n\nleft Mametz Wood this morning at 7-20 this morning for the above Siding Coming up the roads indeed there is one thing certain and that is none of us will be sorrywhen the Summer comes along again We are in Huts I am with the Sergeants but I would rather be amongst the men\n\nAu Re Voir\n","56":"\nQuarries Siding\n\nStill very wet here and the mud is something cruel today I have been up to my neck in it looking for a good Supply of water but there there is none better than Coisy Capt Murray hasobtained me a special pass for the roads so I should be able to get along wiithout any trouble Now Capt was here today having a look round also Atkins Thompson has not returned from Blighty yet Joe is due about the","57":" of the month\n\nthe Companies unloaded a lot of ammunitiontoday the boys reckon they are the answerto the german are they downhearted (No) not yet at any event. met Gallager today he is going to Mametz Camp The 14th Battalion relieved the 15th Battalion B Coy 13th Bn moved this morn at 6 AM Do not know where they have gone to\nCigarettes\n\n\n\nWere on this afternoon 7 men reported sick this morning one was evacuated to F Ambulance his complaint I do not know, There is some talk of us not going into the trenches this time we are supposed to be reserve Battalion but I am afraid it is too good to be true. No shells havelanded about us since we occupied these huts yesterday morning\n\nNo more news\n\nAu Re Voir\n\n19th Jan 17\nQuarries Siding\n\nThings have been pretty quiet today I made 2 journeys to Coisy for water but tomorrow I will not have to go more than 300 yards as the pump has been repaired We can thank the Mayor for this also Capt Murray of the 13th Battalion a small mail came\n","58":"\n\nCapt went to Blighty yesterday morning Jim Richardsfritz has started to throw some Krupps factories about Every time a German shell bursts Spells Bertha Krupps\n\nKRUPP\n","59":"\nQuarrie Siding\n\nThings have been quiet here today it snowed last night & fritz put a few shells here last night received the today There is still plenty of mud around this part of the all today\n","60":" `17\nQuarry\nToday nothing doing\n","61":"\nQuarrie Siding\n\nThe water pump has and we get any water for the cooks\n","62":"\nour heavy guns caught the Germans forces coming into the line this afternoon This side of Bapaume they must have suffered as our guns gave them about 200 rounds rapid these guns fire 12 miles Bapaume on a big german Camp \n","63":" things are not too bad today but its very cold\n","64":"\nfritz has been verybusy today by putting a few shells on the railway line\n\n17th Btn A.M.C.\nBlack\nStillman\n\nAbbey\nMcClintock\nMajor Mc\n","65":"\nMametz Camp\n\nThe battalion went up to flers today and I am back in the above camp with the water carts I do not know if they will be or not but I suppose they will\n\n25th ","66":"\n\nWe went to flers today with the 2 water carts the Dirty huns shelled us when we were on the road between Longueval and flers but so farhe has missed us but can see that we are in for\n\nLivelytime When we go along this road twice a daybut we will just have to trust to Luck\n","67":"\nBernafay Wd\n\nmade 2 trips to flers today with waterthe huns - left us alone pretty welltoday he was shelling moreto the right. have had only one man wounded in the Battalion since they went to flers. is not home after our Guns have been Straffing the huns this morning \n","68":"\nBernafay Wood\n\nwent to flers today during last night the 29th English Div attacked the germans They were very successful as they captured 500 prisoners I seen them marching in this morning and they did not look to bad at all the 15th Btn also made an attack last night and captured 2 lines of trenches The 29th Division was the gallant Englishmen that made the landing at Cape Helles at the dardenelles on the 25th April 1915 it\n\nis no better Division in the British army Than the 29th.\n","69":"\nBernafay Wood\n\nI delivered 4 carts of water today at flers Nothing happened This morning Fritzy kept pretty quiet but coming home this afternoon just as we reached Longueval Corner Fritzy shot a Big Shell just on the corner That place was too unhealthy for me so I beckoned to the driver to hurry which he did We had just passed the corner when I heard another one coming and I took cover Behind a motor lorry\n\nas. Soon as I did the Shells hit the side of the Road not more than six yards away from where I was. Indeed I was lucky to get away unhurt - it missed the water carts by inches we will get another of these receptions shortly Seen 3 German aeroplanes brought down yesterday the artillery was very active today in front of the 14th armys positions they are progressing well and I believe they are makeing for Transloy. Rumors go that they are closer than half way from the English front 110 on the \n","70":"\nBernafay\nWent to flers once today and the Dirty huns shelled us again as we went along the Longueval road. He just missed shelling the water carts Lot of action this afternoon we to go \n","71":"\nBernafay W\n\nNothing much to report today Went over to flers today The huns shelled the road.\n","72":"\nBernafay\nThings have been good today on our front. but on our right in front of the 14th army the artillery was intense.\n","73":"\nWent out to flers once today the huns didn't shell us today he had 2 observation Balloons up wedo another load tomorrow\n\nand return to Camp in the afternoon 13th Battalion goes into the trenches tomorrow afternoon.\n","74":"\nBernafay\nI went to Flers this morning and delivered one load of water received a note from Mr Davis for the QM to Draw petrol tins and despatch them to flers by the mule train 24 tins were sent out under Von Kluck Command returned to the transport this afternoon to get a new water cart from ordnance depot heavy artillery duelsare taking place today onthe Somme front\n","75":"\nBernafay Wd\n\na couple of german aeroplanes came over our Camp this morning but after a few shots from our anti air craft guns they pushed home The germans fly very high and are very hard to hit I am sure their observation cannot be very good from such a height artillary duels going on about flers the 15th Batt attacked a german strong point on the first and capturedit but were blown out later They captured prisoners Seen 2 germans this mormning with the Iron Cross\n\n\n\n\n\nI would have liked to have stolen one of them but there was an English officer with them so my chances of success was small indeed\n","76":"\nQuarry Siding\n\ntoday has been rather a busy one water had to be sent to the trenches after that was done we had to pack up and change our camp from Bernafay wood to the Quarry The 13th Battalion are going to make an attack tonight in conjunction with various other Battalions no doubt the 13 will make good\n\n\n\n"}}