{"Document Name":{"0":"Diary_0304","1":"Diary_0304","2":"Diary_0304","3":"Diary_0304","4":"Diary_0304","5":"Diary_0304","6":"Diary_0304","7":"Diary_0304","8":"Diary_0304","9":"Diary_0304","10":"Diary_0304","11":"Diary_0304","12":"Diary_0304","13":"Diary_0304","14":"Diary_0304","15":"Diary_0304","16":"Diary_0304","17":"Diary_0304","18":"Diary_0304","19":"Diary_0304","20":"Diary_0304","21":"Diary_0304","22":"Diary_0304","23":"Diary_0304","24":"Diary_0304","25":"Diary_0304","26":"Diary_0304","27":"Diary_0304","28":"Diary_0304","29":"Diary_0304","30":"Diary_0304","31":"Diary_0304","32":"Diary_0304","33":"Diary_0304","34":"Diary_0304","35":"Diary_0304","36":"Diary_0304","37":"Diary_0304","38":"Diary_0304","39":"Diary_0304","40":"Diary_0304","41":"Diary_0304","42":"Diary_0304","43":"Diary_0304","44":"Diary_0304","45":"Diary_0304","46":"Diary_0304","47":"Diary_0304","48":"Diary_0304","49":"Diary_0304","50":"Diary_0304","51":"Diary_0304","52":"Diary_0304","53":"Diary_0304","54":"Diary_0304","55":"Diary_0304","56":"Diary_0304","57":"Diary_0304","58":"Diary_0304","59":"Diary_0304","60":"Diary_0304","61":"Diary_0304","62":"Diary_0304","63":"Diary_0304","64":"Diary_0304","65":"Diary_0304","66":"Diary_0304","67":"Diary_0304","68":"Diary_0304","69":"Diary_0304","70":"Diary_0304","71":"Diary_0304"},"Date":{"0":"unknown","1":744.0,"2":869.0,"3":870.0,"4":871.0,"5":880.0,"6":1133.0,"7":1195.0,"8":1196.0,"9":1240.0,"10":1241.0,"11":1242.0,"12":1243.0,"13":1244.0,"14":1245.0,"15":1246.0,"16":1247.0,"17":1248.0,"18":1249.0,"19":1250.0,"20":1251.0,"21":1252.0,"22":1253.0,"23":1254.0,"24":1255.0,"25":1256.0,"26":1257.0,"27":1258.0,"28":1259.0,"29":1260.0,"30":1261.0,"31":1262.0,"32":1263.0,"33":1264.0,"34":1265.0,"35":1266.0,"36":1267.0,"37":1268.0,"38":1269.0,"39":1270.0,"40":1271.0,"41":1272.0,"42":1273.0,"43":1274.0,"44":1275.0,"45":1276.0,"46":1277.0,"47":1278.0,"48":1279.0,"49":1280.0,"50":1281.0,"51":1282.0,"52":1283.0,"53":1284.0,"54":1285.0,"55":1286.0,"56":1287.0,"57":1288.0,"58":1289.0,"59":1290.0,"60":1291.0,"61":1292.0,"62":1293.0,"63":1294.0,"64":1295.0,"65":1296.0,"66":1297.0,"67":1298.0,"68":1299.0,"69":1300.0,"70":1301.0,"71":1302.0},"Entry":{"0":"\n\n","1":" Pozieres.","2":"\n\nYesterday evening, coming back to unit camp at Pozieres from Beaulencourt. Mail included, one from Mat, who’s passed her B.A. exam, and one from Jake… Amongst parcels, three of Books, two from Erskine Macdonald – result of sub. to Malory Fellowship, and one from Harry. Harry’s included this journal, and Conrad’s \"Within the Tides\" in the Standard Collection. Continental library – 2F.\n\nThe first two sets of Malory F’ship. booklists. as follow.\n\n\"Breton Songs\" Into Eng by. Ruth Rodgers.\n\n\"Songs of Protest\" Frederic Mitchell\n\n\"The Harvesting\" W. Fothergill Robinson\n\n\"The White Roads\" R. B. Ince\n\n\"The Woman & the Sage\" C. A. Jergens\n\n\"The Joyous Journey\" Duncan Grey \n\n\"Dream Songs.\" Kath. Braimbridge\n\n– The last four on the L.B.G.V. series. \n\n\"The Poetry Review\" May number the","3":" pcl.\n\nWhen I first wrote to Erskine Macdonald with the idea of subscribing to the M.F, and asked for particulars, I received them, and a backsheesh booklet, \"From an Outpost\" by Leslie Coulson, (the late). This little wk – from what Ive as yet read of the 7 lately received, is worth them all – plus. As Coulson wrote , so should I wish to, if I were so able.\n","4":" Diary of the day.","5":"\n\nParade at 9.30. – same old fatigues as before this last stunt – shell hole filling. Parade at orderley room called for \"all men who considered they were due for leave\". Waiting there. Ed Banks in – looking for his cousin – Hogkins: had long yarn with him. – and learnt that what Gerald had written – that Dosh had been killed was true. Ed’s one colour up – French Medal Militaire.\n\nGerald to \"have his guts\" when he sees him ... Paraded with the crowd over leave – and now live in revived hopes. Parade at 2, – for bath to Albert. Bath and change goodo, but hardly worth 8 mls marching through stifling heat \n\nTodays paper gives Beith Thomas’ account of our fighting round, and the capture of Bullecourt.\n\nHome mail in – Dad, March 18, Grandma’s 19 – with photograph of self. Mater’s 11, and","6":" One from Mrs Louther,","7":" in answer to letter I sent sympathising on Erics death. Geoff short note also 18. \n\nParade at 6 pm. Col. Inspected us for new rig outs. From the manner of issuing – we’re losing – and badly.\n\nParcel of Clarrie – a big fruit cake for light refreshment during the day. Clarrie at C.C.S. Ridge at Rouen, well. \n","8":" Three pages still remain to be filled in, in old journal. Last entry there","9":"\n\n4. To fill in a few of the happenings between May 2, and Today. \n\nUsually the unluckiest of Ambulances this stunt we’ve been the luckiest. The Ambulances in were, the","10":" 2nd,","11":" 4th,","12":" 6th, 7th, 8th, 14th and the 15th.\n\nOur casualties were –\n\nLeask, killed and Marley wounded by some fragment. The shell piece went through poor Scotty and through Marleys shoulder. Both were only boys, both, new since myself to the 1st.\n\nHagan, gassed at the sunken road, and evacuated from there in a fairly bad condition. Medcalff was slightly gassed too, but able to carry on. \n\nThen \ncame\n comes in order, Cliff, – the luckiest and narrowest escape of all: the shell burst inches away almost, and all he got was a small fragment in the Right elbow. Andy took his place on the post. While Cliff was handing over to Andy – in waiting at the entrance to the R.A.P, a shell burst behind us, and Ridge got a large piece in his Right thigh. \n\nClarrie elected next – a lovely piece in his leg – \"safely wounded\".\n\nOther casualties were at the other posts. Maddox, in the \nhead\n arm. Gibson in the head. Perry James in the leg and Bill Dunn the latest – back at the M.D.S. that first day there Boche shelled it. Bills as far as we’ve yet heard is bad, but not a serious wound. \n\nThe second time in, three were out of it. Billy Kiel, Peter and Miles – the three were ordered to \"stand by\" at the M.D.S. to go on leave.\n\n\"Oh what a fall (what a gutzer!) was there.\"\n\nResting at the M.D.S. in between stunts on the afternoon of the , ? watching some of the Battalion coming out – the remnants rather – sighted Len at the head of his company – a 1st Lieut. and just back in time for the stunt from a School. I met him again the day before yesterday – Friday – in the ruined church of the ruined villiage of Beaulencourt. There he introduced me to one of his Company Officers - who opened a conversation on Architectural Styles – and the soul of France as expressed in the Cathedral of Albert!!!!\n\nThat walk in the twilight through Beaulencourt with Toby I enjoyed immensly: but these ruined villiages – once so obviously beautiful in their simplicity and rusticness make one very sad, and bring alive to the mind terrible visions and sounds. \n\nThe spirit of Bapaume, of the ruins – is the most terrible I know, and all fear seems in one while we are near it.\n\nThe Gordons supported our chaps – on our left: and together the honors of the taking of Bullecourt are shared. They’re the finest of fellows, hard as nails where the Boche is concerned, without mercy for their prisoners. There is perhaps their only and greatest difference compared with our chaps.\n\nTales innumerable were told of them... and they’re true, nearly all of them. \n\nThere is one…\n\nThe Boche prisoners were bearing – as in, shoulder high: Scotty the guard, behind with an\n\never present bayonet naturally excited one of the Boche – and he bore badly: he was threatened, failed to satisfy again, and – now he’s dead… shot. \n\nWhich is in some way, looked at coolly, a reprisal for those Australian boys that the Boche captured, – and left them with their throats cut. This was at Hermies.\n\nIt is in their treatment of the prisoners that our chaps contrast with Scotty. We treat them as Christians. Scotty as he was treated when he was a prisoner at the beginning of la Guerre.\n","13":" Tonight Maj. Wilson has come back from Paris… so now as the censor stamp has returned with him, we’ll be again able to post envelopes other than the Green ones. \n","14":" Diary of the day. May 14\n\nMuggy day – heavy rain this afternoon. Issued this morning with new Tunic, Colars and new \nAust\n Boots: Boots a \"Moral Victory\" but Tunic a necessity of necessities.\n\nNo Mail. Off fatigues this afternoon feeling dopey and stiff in joints. Hope its not Trench Fever.\n\n7. In the Poetry Review, May number \"A Lament from the Dead\" by W E K. one of the most serious and beautiful I’ve read lately. \n\nFirst two verses –\n\n1 Peace! Vex us not: we are Dead,\n\nWe are dead for England slain.\n\n(Oh England, and the English Spring\n\nThe English Spring, the Spring-tide rain:\n\nAh, God, dear God, in England now!)…\n\nPeace! Vex us not, we are dead\n\nThe snows of Death are on our brow.\n\n2 Peace! Vex us not!\n\nBrothers the footfalls of the year\n\n(The Maiden months in England now!)...\n\nI feel them pass above my head:\n\nAlas, they echo on my heart\n\n(Ah, God, dear God, but England now!)…\n\nPeace! Vex me not, for I am dead:\n\nThe snows of Death are on my brow.\n","15":" Peace! Vex me not!\n\nBrother, I beg you be at rest \n\nBe quiet at rest for Englands sake:\n\nThe flowerful hours in England now\n\nSing in your sleep to English ears:\n\nAnd would ye have your sorrows wake\n\nThe Mother’s heart to further tears?...\n\nNay! be at peace, her loyal dead\n\nSleep! Vex her not!\n\nBrian Hill – S\/Lieut D.L.I in Salonika in November, is true to place, and his 4 short verses are one of the finer contributions to the May number.\n","16":" Diary of the day. May 15.\n\nTurned in early last night – and we’d all to \"turn out\" an hour or so later – a special parade. The relief of the troops indescribable when the parade turned out to be only to discover what underclothing we possess’t.\n\nToday – this morning C section and \"dug-outs\" from the transport, and Train, and Sisters – \"up the line with the best of luck\". Presumably to Bullecourt. A. Section now holding all the \"cushy\" jobs. \n\nStill dopey – still off colour. Nick in same condition. But he’s something to show for it – blotches and swellings all about his legs and thighs. Says the Colonel – \"Tinned Fruits Move it!\"\n\nLeave to Amiens starting: may possibly go, but it’s the getting back that spoils the pleasure.\n","17":" Wrote for Verhaerens \"Plays.\" and read article – review – in The Poetry Review on the Poetry of Alan Seeger. Constable are publishing the set, 5\/- introduced by William Archer. \"Poems\".\n","18":" Amiens – Aix en Provence, The Blue Mosque Cairo, and the statue of David – reproduction of Michael Angelo. \n\nLaon will be one of the villiages of this year – and in what state will we find the Cathedral?\n\nRheims now dead of the war – will Laon follow the same ending? Reprisals should then be the order – and Cologne should go – followed by the Kaisers grandiose palace of Potsdam. Bombs in \"Unter den Linden\" would be very convincing arguments against the Boche’s usual vandalism.\n\nComing out the first time last week from the embankment near the Hindenburg line – the miles back to Veulx – one place only I kept in my mind: Aix en Provence.\n\nIn imagination I was in that lovely cathedral again – in its Temple tapestry – before its tapestries so cool and fitting in their place. \n\nIf the soul can in life travel without its body then that day mine did: We were fagged out when we left the R.A.P. – under heavy fire all the while, – and without water and the day hot as February at home. To the first sunken road I was in the principal boulevard before the station of Rive of Anjou, and from the sunken road to the M.D.S. I was about the Cathedral.\n","19":" There’s a picture here for Branguin – chaps washing near shell holes. – naked in the sun, standing on green and gold covered ground\n\nand against a sky of brilliant blue, and heaped splendid clouds.\n\nDiary of the day","20":"\n\nJust finished the writing of 7 pages of a letter to the Mater – that I’ll not post.\n\nIt’s a cold miserable day and raining hard now.\n\nOn sanitary fatigues – with Andys party.\n\nNick in hosp. and seems very \"crook\". Sol and Arthur are on leave to Amiens.\n\nRead in between whiles, three of the four tales in Conrads \"Within the Tides\" – all fine tales and good reading. \n\n(17.). Turning in, put on Tram Duty in place of Jimmy – who’s returning to Base. A Good job and a \"Cushy one\".\n","21":" Diary of the Day. ","22":"\n\nTram: day in Meaulte. – and an expensive one. Frank Dunn in same truck. – and full of drawing: he’s joined some Corres. School and is living in expectation. Had various yarns all day on different artists and their styles.\n\nRead in Mag., short story by the inimitable Max Beerbohm. – A.V.Laider.\n\nThe day dull and sunless, but the greenness of new leaves on all trees, deep green grass, and heavily white blossomed trees hardly needed for the the sun. \n\nEggs for tea – still to be enjoyed – and the fire still to be lit.\n\nWrote three letters, & one to Elsie – one to Batsford asking for Catalogue and another to T.B.C. asking for \"Drawing and Painting\" – the second letter to them in as many days.\n\n14 Under this date in Diary of last year the following classic note – Everything putrid and the games rotten. \"Things were crook\" – quite evidently.\n","23":" Diary of the Day","24":"\n\nFew patients on trip down from Pozieres to Meaulte: dull day that imposed sleep on us all the afternoon. Both lunch and tea failures: batching an un-holy failure. Back at Meaulte after evening run, yarned to Frank – from Whistler and Wilde to da Vinci. Deal of evening spent then in discussing interior decorations.\n\n– and I remembered an entry in the first journal No.116.\n\nNow added to this scheme, a carpet square of red – blue and green – and a fairly large vase of vivid sapphire on cobalt blue. Furniture Flemish oak – and books, books, folios and more books.\n\nLetter from Gerald about some not quite understandable fall and smash up – followed by account of Springs manifestation in Blighty.\n\nHaven’t yet written to Mrs Leask – must get – borrow or steal a pen for it. And get her address from orderly Room.\n\n16 Diary of the Day","25":"\n\nA Muggy day. Paid at Pozieres early before tram left, – 50 Francs. Wrote to Gerald enclosing 10, asking for pencils and a Windsor & Newton Artists note book: also copy of Bourkes London Lamps – same author of splendidly reviewed Limehouse Nights.\n\nTrip to Maulte Canteen – French cakes etc. Posted letter I wrote near Bullecourt, to Ron. Word now that we’re leaving Pozieres next Tuesday for …? \n\nTurned in early. Still have rheumatics in both legs and couldn’t sleep. \n\nI forgot an entry: had a good hot bath – in half a Petrol tin, and a sunbake to follow.\n\n17 Diary of the Day May 20.\n\nSame morning trip down same trip back. Sunny and muggy weather. Wrote this afternoon letter of condolance to Mrs Leask. will get address from OR tonight at Pozieres. \n\nGot address from O.R. and found his nearest kin, his sister, married and living at Queensland. \n\nThe Portuguese didn’t turn up again tonight. I was disappointed as I wanted to see again the \"Mythopoen of all Paganism\". He was a living \"wood thing\" – strongly built, dark, full of a merry vitality, slim and lithe. Even his old worn out uniform couldn’t hide his physical beauties, profile and full face – he was a Faun.\n","26":"\n\nFrank D once sent a drawing to the Bulletin – and in it drew his men with their hands in their pockets. In the A.T.C. column a few weeks later, ‘F.D. – what a Godsend pockets are to the young illustrator!’\n","27":" Diary of the Day.","28":"\n\nRaining early. And a hot day following.\n\nTo the Maulte Canteen with Frank, then Dinner. Wrote to Mother and Matin. \n\nAt Pozieries this morning sent away the first collection of Malory Fellowship\n\nBooklets. Maj Wilson censored them. – with \"Well Molony: more books! Do you think they’ll ever read them?! I’m pretty certain ‘they’ wont, but if I have the luck to get the chance, \nI\n certainly will.\n\ne was a living \"wood tghing\" – strongly built, land He was a living \"wood thing\" – strongly built H\n\ncolum a few weeks later. F.D. – what a godsend on to the young illustrator!\n\n20. Diary of the day.","29":"\n\nEntry made 23rd Henencourt\n\nLast night 14th F.A. took over the Pozieres Camp – and we lost our Tram job.\n\nAwakened at 5. am. breakfast 6 and we moved off at 7: first rest at La Boiselle Mine crater – and a rest of a good half hour while transports of the Engineers came away from the Right of the Albert road to the road itself just in front of us. Right in to Albert then, rests the order every few minutes. From Albert to Henencourt good marching – the rain slowed down to a very slight drizzle – and we arrived at our Henencourt Billets – Barns – about 1 am. Then the troops started. \n\nAll Australians are billeted here – no Tommies. In the first farmhouse we went to – Success: About 17 of the unit collected there in half that number of minutes and we started with big jugs of stout. Then followed Omlette – 4 eggs each biscuits and wine. \n\nThe troops were Merry!\n\nToby, Nick and self then on a walk to the Chateau – then back to the Billets: many of the troops asleep! In a car in front the three of us lay till it started going – then out and another walk.\n\nTea in Billets and out again, Bert making 4th: walked over half way to Lavieville then back the Bresle road as it leaves Henencourt and a short laze: on then to the second Farmhouse – our discovery of the early afternoon when we had Cafe there – and an early supper of Fried eggs. Eggs fried in a wonderfully clean pan, and eaten from clean china, in a clean Farmhouse Kitchen. About seven other chaps there – all decent fellows and good company. Back then to the Bresle crossroads, a haf hour there, and in through the villiage again. \n\nTo the Estaminet.\n\nThe Troops in it were everywhere, but mostly in the garden behind it. Stout is plentiful as water, and wine and champagne bottles everywhere. They were a jolly crowd of revellers, many full of Rabelaisan wit, – and not a non-smoker amongst them.\n\nBob was there – in his babbblin glory! With the tale from him of his and Tob \"hen hunt\" and its success.\n\n(They had the hens for breakfast the \n\nmorning. 23rd)\n\nThen back to Billets – and bed. We were dog tired after the march but Henencourt is a bonzer little villiage – all green trees and blossom – buttercups and new grass, and new turned earth. Just outside the villiage we came across a splendid type of French Peasant, full breasted full hipped – digging deeply and evenly – working with a perfect rythm and ease: her complexion was richly brown, and her hair carelessly coiled back: she wore no hat, – a rough well worn skirt and a loose jacket blouse.\n\nNorman Lindsay would have enjoyed her.\n\n21 Diary of the Day","30":"\n\nUnder the flowering trees in an old deep grass and buttercup grown orchard, Tony and self.\n\nUnloading wagons fatigue the morning: our \"going it with in a few days battle\" is slowly dissolving.\n\nAfter dinner on Post office fatigue – to the next villiage with Tommy to help him back with the Mail. Amongst letters last night one from Phyllis – her news is that Jake in Blighty wounded in the hand: I wrote him a line today – and mentioned the Nov loan. \n\nMust write also \nagain\n to Times Book Club: saw last night in Graphic critique of new book of W.B.Yeats – \"Extract from the Fallen\" pub by Cuala Press 11\/- a limited edition of 400 copies. Must try hard to get this.\n\nNear here there’s an Aerodrome: and the sky’s dotted at all time with their planes. One lately gave a few \"stunts\" – collapse and recovery. – Loop the loop, volplane etc. etc. as good as I’ve seen.\n\nShorts are coming out amongst the Troops – must get a pair somewhere.\n\nIt’s a bonzer day – too perfect to waste writing. When I came back from the Unit I pulled Toby out of the billet and brought him here – to write. Ten minutes ago – \n\n\"Its too jolly nice to write here – I can’t!\"\n\nTea tonight (D.V.) at our discovery Farmhouse.\n\nTonights mail two from Elsie, and one from Harry – saying he’s sent on the tunic and Breeches Saved!\n\nSilvers as drunk as a lord tonight – been to Aveluy or somewhere near and – that was the end of him, His long suit is extreme mirth – at his own expense: he brought home a loaf of bread. and can’t\n\naccount for it.\n\nIn Elsie letter – some snaps of herself, Gladys, and others presumably \"the Girls\" and one of Court. Her news of the office – things must be very slack. Court’s in charge and Bert – evidently away in by her letter and an early one of the dads – about dying.\n\nAfter tea at the Farmhouse Toby we left at the Bresle road and walked on to that villiage after Andy and Lofty.\n\nBresle from the road entry is a particularly pretty little place – hundreds of trees but built deeply in a valley.\n\nThe day a full and a great one. The troops biletted about in these three villiages look already exceptionally well and full blooded.\n\n22 Diary of the Day.","31":"\n\nParade at 7. – and all the officers with the exc. of the \"interrupter\" on \"jerks\" – doubling to the Chateau, then about 500 yds outside the villiage.\n\nParade at 9. – \"The brightest thing God ever made\" in canary breeches and Kiwi leggings, a dainty tunic cut and heavily adorned with brilliants. – \"gave his gutz.\" \n\n\"Fall out on the left all those who fell out in the doubling this morning\". They were severely questioned – and sent to Maj Wilson at the Chateau – \"With my compliments and he’s to submit you to a medical examination. Morning fatigues levelling ground in Cookhouse Billet.\n\nAfternoon fatigue at the Chateau – constructing an incinerator and burning off stuff, and digging a grease trap. We did it, and wandered over the Park of the Chateau. In the Main walk – from the main front of the Chateau, just beyond the great lake in the shade of the deep avenue trees, the daughter of the dying ‘Madam la Marquess de Henencourt.’ \n\nGraciously she gave Morrie and self permission to explore the beauties of the place - and then later we’d to apologize for King and his crowd for their trespassing.\n\nTobys in hosp – a temp and feeling bad generally. \n\nRead tonight walking just outside that crossing avenue along the villiage. Romeo and Juliet.\n\nTea at Farmhouse – Bill, Nick & self.\n\n23. Forgot to note it. May 22, big home mail – one from the Dad, one the Mater, Mat, Betty and Phyllis. Betts contained bonny little snap – in an Annette Kellerman suggesting pose – the impression.\n\n24 Yesterday the first of wounded of the Bullecourt stunt back. Eric Gibson, Clarrie now in a convalesent camp at Rouen.\n\n25 In this mornings orders – 8087, Pte F.H. Molony Stretcher Bearer, to be Tent Section from","32":"\n\nPalmer, and two others also transferred.\n","33":"\n\nThe Rumour of the day, is that 4 of the 16 Batt, prisoners in Bocheland have escaped – and bring back the oil: – a retirement of the Boche again in the air – and this time if we stick it hard – he’ll never stop. The second part of oil is that to those of our chaps captured who give them good information the Boche send them back above Lille, those that fail, he puts to carrying munitions in bad areas. The \"Dinkum oil\".\n\n27 W… a superb Moll – nervy knees thick set.. well Knit.. living colour.\n\n28 Diary of the Day. May 25.\n\nNot such a breakneck early morning stunt. Drilling all morning – ordinary damnable squad drill.\n\nMail midday – two expected parcels – one from Harry of Breeches and Tunic – gave old one to Nick and one from Sister Dougall, three shirts, pair of sox and Turf cigarettes \n\nWrote to Harry and to Mon… to Mon asking him to get for me a watch key – for my wristlet.\n\nTea by self at the Farmhouse – and exclusive eggs – 4. Cafe – Cakes and Biscuits. Went over to Chateau Hosp and saw Toby. He’s well now and on the patch. Last night his temp 104°.\n\n29 May 26\n\nDiary of the Day\n\nEntering up in old orchard – just near Farmhouse before evening Coffee. Funds \n\nlow so no eggs tonight. \n\nA fine and hot day. The Ring Master of the \"Society Circus\" up till three this afternoon changed three times. 1st parade at 7 am slacks, short sox, shoes, and light tunic N.B. strange thing about tunic, bar of the Rising sun UNPOLISHED. 2nd, slacks turned up 1\/8 \", dark sox, shoes and Glinting Tunic, 3rd Canary Breeches. Kiwi leggings, Dazzling tunic \n\nGeorge`s suggestion for Motto of Day \"Jesus Wept\".\n\nMorning – stretcher Drill. Afternoon Gas drill (God help us!) AND squad Drill. \n\nIn orders this morning 4 M.M.s for Bullecourt stunt. Andy, Ern, and Lofty – all on sanitary fatigues and Mitch – away on leave in Blighty.\n\nCatalogues from Batsford by days mail – and some seven temptations amongst \n\nan enclosed S.A. list.\n\nSome I’ll get – get an advance sum Pay Day if Lord Brasso will stand it: saw Maj Wilson. A parcel too – but for Clarrie from sister Chisholm. Sox. sweets etc and the pencil. Tres Bon Sis Chisholm.\n\nMadam at the Billets greatly filled with brilliant idea for the Troops Comfort. She’s a motherly old sort – strongly suggestive of a cow. Then tonights idea – a long seat outside alongside the Farmhouse wall. Algy – half stripped, washing elected by her as fatigue for carrying an immense log – George, another and self included. \n\nLeft my new Tunic with her to have colour sewn on – at the \"Tout de suit Monsieur.\"\n\n30. Todays mail brings Frank D. the first of the CS paper of the A.B.C. \n\nOn the door of the billet tonight a sketch – \" A Deserving Case \" – of Andy AND his M.M. F Ds the criminal – and it’s a jolly good Crime: its Andy to a T. and as a caricature well drawn throughout. If Frank goes through the War and does as he intends – works through the Society of Artists classes. – he ought to bloom well. He has enthusiasm – and talent. I’m tempted to get hold of the tacked up sketch – as a \"souvenir\"!\n\n31. By a copy of the Daily Mail saw in catalogue of the continental edition – that Sir J M Barries \"Half Hours\" has been issued in the last Batch: at Becordel in a Christmas Number of the Bookroom saw there announcement of an edition with frontpiece of some \"Rosalind\". Evidently as it certanly should be, the book has gone into several editions.\n\nOn its publication I got hold of one of the first Australian copies – to read on the Train going to Blackheath for the New Year, 1914 (?) – to stay at the Staffords. \n\nIt was a good trip up that, – I’d a carriage to myself, 1st Class \"Half Hours\" and some Mags. I read \"Pantaloon\"! – quietly and with a dozen layings down enjoying it with the country.\n\nI thought of a hundred things that journey – principally though of trees and their personalities: It struck me early that personalities were to be seen in trees – and the journey I spent in finding them. It \n\nwas a good holiday that – long walks with Mat and Gerald with Rosalind, walks where love hovered always on the lovely air and we moved slowly down a perfect stream. All the holiday those trees were living – they’d almost visible dryads that seem always visible – especially in the Grand Canyon, when they seemed daringly delighted yet wondering at the wonderful roots of their trees – those roots that Rackham so splendidly draws.\n\nDream Days of a Golden Age.\n\n32. Diary of the Day May 27.\n\nSunday – and a most un Sunday like Sunday. Those on leave to Amiens had to turn out for the 7 parade – and so lose their Tram from Albert. Six of us with Toney digging new tunnel Pit at the Chateau – the crowd squad drilling. Afternoon ditto – the crowd road repairing: since the second Pozieres stunt the Australians off and on have been in the villiage – upon our Brasso has decended the honour of Promising .\n\nA hot, hot, day.\n\n33. Franks sprouted again. – and tonight on the billet door a jolly fine caricature of \"The Brightest thing God ever Made\" \"Shineo – the Man of Many Suits\" is Franks title – but Georges suggestion tops all – \"Solomon in all his glory, was not arrayed as –\" \n\nIt was another surprise as to what F could do – Andy was the first. (Shot I \"grouted\" late last night).\n\n34. In the Farmhouse Living Room one other A. man here. – promising for an unusual yarn. S.S. by the manner. \n\nFlies, Mosquitoes and other plagues drove me from the orchard – where I’d looked forward to an hours Keats, \"Cafe et Gateau\" the order of the hour.\n\n35. Today Palmer, Ern, Bert Jack and another \"to the seaside\" somewhere at the mouth of the Somme, to a R. camp.\n\n36. May 28.\n\nJust read Shakeltons speech in Martin place – it was enclosed – a cutting from the Telegraph in Elsie’s last letter. Her note is 7 . 7 after a speech like that. He said in it – \"there may be no Gallipoli, no er note is 7 minHer not is 7 minets of speech like that . ThHe said in it –\"Her hhhPozieres, no Bapaume –\" well already there’s been a Bullecourt and now the Battalion (\nand\n their followers) are training as before the first Pozieres.\n\n37. Aitken last night to the billet, and told us he’d taken down Franks caricature of Lord Brasso: there was a gentle roar a protest, and an inquiry:– Explanation –\n\n\"Well if you’re not tired of squad drill I am!\"\n\nIt was sufficient.\n\n38. \n\nAdd it by the verse –\n\nAnd much as Wine has played the Infidel of the Ricardo Press edition of Omar – Reputation, reputation, reputation! Oh I have lost my reputation! I have lost the immortal part of myself, and what remains is bestial. \nMy reputation\n Cassio. Othello 2.3.\n\n39. Diary of the Day X. May 28.\n\nNo early 7 parade – breakfast – and Bath parade to Bresle at 7.30. Dismissed back at Billet about 10. Afternoon Insp of Kit by Brilliance – \nand\n squad drill.\n\nBilly and Mitch back from Blighty leave. No Mail.\n\n40 \n\nSister Corelli testifies. Nashs June 17.\n\n‘Yet, when brought to the test he had proved himself a hero of undaunted mettle – he had roughed it with his men – and had saved many of them at the risk of his own life – he had \"played about\" among bursting shells and flaming shrapnel as a child among tossing shuttlecocks, and was constantly getting \"mentioned in despatches which he declared was absurd and superfluous.\"\n\nHe and his ‘cobber’\n\n‘had gone up to Oxford at the same time, and in later days had fought together side by side in a veriatable hell of fire bombs, performing deeds of magnificent heroism, which had won for them both the Vict. Cross, as well as the \"Croix Militaire\" from their French Allies.\n\nSome ’ero!\n\n41. May 29.\n\nLooking through pocket wallet yesterday came upon P.S. salvaged from dugout in the Sunken Road by Noreuil, the first night we were out from the last Bullecourt stunt.\n\nAt 4 am the next morning the original owners returned – and found us in occupation – and when they found we were stretcher bearers told us to hang on and they’d find another place.\n\nThese are names on the back.\n\nPte Jon Crow\n\n25 Batt.\n\nHobart, Tas.\n\nPte Bruce Miller\n\n25 Batt.\n\nLaunceston Tas.\n\nPte W. H. Turner\n\n3 Batt\n\nTenterfield Aust.\n\nPte J White\n\n3 Batt\n\nSydney Aust.\n\nPte W Keil\n\n1st F. Amb.\n\nBallarat Vic.\n\nPte F H Molony\n\n","34":" F. Amb\n\nWoollahra Aust.\n\nOut of curiosity I’ll look up Anzac Bulletin casualties – and see how these blessed dugout buddies got on.\n\n41. Diary of the Day","35":"\n\nMorning – Jerks. paraded Dentist and had back tooth treated: afternoon parade squad drill and route march. Elected secretary for Meeting called by Col. re Unit sports.\n\nBilly brought Andy back \"The Seven Seas\" – had a copy from Mon so he passed it to me. For the second time in two days \"yearning\" towards sketching – and filled borders of pages V 162-186. Hope to get book and pencil from Gerald... will fill in later blank pages of \"Ginger Mick\".\n\n43. \n\nLate tonight, after writing up meeting – brought down to billet copy of order of sports: on the door new caricature – Bob. making the","36":" now in ruin. There was a rush when I posted the \"Events\" up – \"Who’s this this time\" – disappointment, then enthusiasm and trial tests.\n\n44. The billet a rubble-built barn – high walls and steeply pitched roof – rough hand-worked beams and struts innumerable – suggesting in the classic candle light at night an old Gotha hall. And \nall night\n the troops sing loud Rabelaisian songs – rich in melody and harmony – and Madame de Billet enquires if they’re hymns. Then the singing changes – \"The Long Long Trail,\" \"The Only Girl in the World.\" and Tennasee.\n\nBillet nights are good: better than Marquee Nights – though we had some good ones at Becordel – and of those Becordel men Clarrie, Ridge, Cliff, Max & Mon have gone, – and new men are in their places.\n\nThe old order changeth, yielding place to new – and the new aren’t half the men whose place they’ve filled.\n","37":"\n\nDiary of the Day\n\n45 Jerks – the usual run – Sports next Saturday... 9.30 parade squad drill – 2 pm Ye Gods! Gas drill and the unutterable Green decides my helmet’s useless – it did me at Bullecourt though – and it’ll do me again.\n\nTea eggs and coffee with Nick, to the Rugby A. v B & C then to supper again at Farmhouse eggs and Coffee repeated.\n\n gave in tonight, and admitted me with Nick to her band of favourites.\n\nToby still in Hosp – still feeling bad. Will perhaps get leave to Amiens next week – maybe with Frank.\n\n46. At the Farmhouse an old Red Page and reviewed on it two desirable books. –\n\n5\/- Spanish Sketches A. B. Piddington Oxf. Uni Press\n","38":" Short Hist of Australia Ernest Scott \n\nWill get the last after \"Interior Decoration\".\n\n47","39":"\n\nDiary of the Day\n\nWith the Col – all evil influence about the villiage seems to have departed into Paris; Maj Wilson acting C.O. – and it was obvious from the 7 parade. Morning squad drill till 12, Muster parade 2, – and \"Dismiss!\"\n\nMail today came Verhaerens ‘Plays’ – and already I’ve read \"The Cloister\" – one of the most perfect and beautiful plays I’ve read.\n\nToby up today – and we together at the farmhouse for Cafe.\n\nFrom the match last night – A. v B & C (B. C. now 6 – 3) two As in hosp - Underwood wrenched leg – Frank bad knee.\n\nThe days been perfect and it lovely now: and the sunken road – overgrown and bordered by buttercups and irregularly lined by young – greening old fruit trees – the old road between Henencour and Lavieville is lovely in the light of a low sun. A hundred yards ahead – just outside the villiage, a pagan pastoral modernised – a young girl peasant, richly browned, strongly limbed, full breasted standing half leaning on a spade handle, and an Australian, bareheaded and sun browned sitting by her, leaning back on his arms. And twenty miles away there’s a shrieking hell and rotting stinking bodies...\n\n48. Phillip 2. – The Inquisition and a terrible play: but not in the class of beauty that The Cloister is in.\n\n49 \n\nHenencourt June Rue de Bas. 64.\n\nPay of all happenings the most important – then in its run the following tea at the Farmhouse. Drew 60 F. and applied for Amiens leave for Sunday. Fatigues, morning and afternoon, cleaning and checking contents of Panniers, A. Section.\n\n50 \"Billet Night\": they’re here at it tonight – a farewell speech to Mim – Gus Kelly, by Andy – his reply – and many and several interjections. Then following a Salvation Meeting – a repetition of last night’s: Loudness and thoughtless blasphemy? ... Well perhaps to a Baptist, but its very issue is so impersonal and wholly humourous, that like the Comic Opera of today – its story is killed by its absurdity.\n\n51 \n\nToday read and finished Shaws \"The Doctors Dilemma\".\n\nShaw, Barrie, Wilde, Pinero. – the Moderns to join with the old Immortals.\n\n52","40":"\n\nDiary of the Day\n\nA day of a terrible mortal struggle. Since getting catalogue from Batsford I’ve decided for and against \"Interior Decoration\" again and again \n\nYesterday for pay drew 60 Franc – with Amiens next week in view. \n\nTonight wrote to Mon at No 2. – for Int. Dec. and to fill out the money – 75 F – a copy of the Studies and for Toby – for \"Belgiums Agony\" of Verhaeren\n\nTonight near the Aerodrome we played","41":" Batt – won by 18 – nil. A lovely day – trifle muggy and light rain this evening. Three times at the Farmhouse Morning Eggs coffee. Evening eggs coffe and supper Biscuits and Coffee\n\nMust borrow if I get a next Wednesday.\n\n53 Diary of the Day","42":"\n\nA lovely home Spring Day – Sunny and warm. Spent the afternoon amongst little clumps of trees half way between Henencourt and Lavieville – took Keats with me but didn’t read more than half a sonnet. Coming back met Nick under one of the Sunken Road trees writing. Billets for tea – and now here – in the little Farmhouse. \n\nMorning – an hours drill – and a word from Maj Wilson about the affair of last night – the raid on our billet by the three M.P officers and their reception.\n\nAs time goes, more and more the spirit behind old Headquarter staff becomes meaner and more ridiculous.\n\nThe spirit of Militarism is the most terrible deadening and murdering of all the duties of Hell.\n\n54.\n\nToday is the Kings Birthday... \"Gentlemen – the King\" \n\n\" \"im\" sums up the feelings of Billet 62 Rue de Bas.\n\n55 \n\nSome time ago the Bulletin held on its Red Page a competition – \"Toasts for Australia!\"\n\nWhy not Kiplings –\n\n\"To the men of a million acres. To the Sons of the Golden South! (The Native Born.)\n\nKiplings strong in the Billet. Andy introducing him in \"The Seven Seas\". and they’re fine – above all \"The Song of the English\".\n\n56 What is the explanation of the terrible gulf separating the English Tommy and his officers – the gulf of manner\n\nspeech and ideas? To us, and its been most noticeable since our first coming into touch with them in Egypt, they belong to different peoples.\n\n57 \n\nRe 26. entry May 25.\n\nIn yesterdays mail an account of the escape and their experience of two of our Inf boys. So for once Rumour has proved himself...\n\n\"All is confirmed my Lord, Which was Reported. \n\n58 Diary of the Day","43":"\n\nAnother lovely home Summer Day.\n\nGetting ready ground behind Henencourt Wood all day – ready for tomorrow’s sports. Erecting afternoon two Swiss Cottage Tents –. Tea at Farmhouse 4 Eggs, Cafe, Fruit and Cakes – George Eaton – Ern Gibson, King & Self.\n\nAfter \"Lights Out\" a Concert in Billet grounds – finishing with \"Something Seems Tingle – ingle – ingling\" from \"High Jinks\" and by George E. \"A Private Bold\". Eric’s to go on leave to Blighty tomorrow.\n\n59 June 5.\n\nSports of the first three ambulances:\n\nThe usual sports...\n\nA Hot Hot day\n\nTea with Toby and Underwood at the Farmhouse.\n\nMail two – one T.B.C Invoice for Verhaerens Plays – one Commonwealth Bank asking for number of account Book and particulars that don’t exist.\n\n\"The Practice of Oil Painting\" Soloman J Soloman arrived – written for as Drawing and Painting about 15 days back. The one I’d wanted was \"The Practice of Drawing\" by H Spurl. May possibly get it later.\n\nBorrowed tonight of Nick 2 F.\n\nLeave for Amiens posted up as on Thursday.\n\nFrom today a new MP. regulation which prohibits the selling to Troops of \nall\n drinks Coffee included, out of Estaminet hours: which means we may only drink water at the Farmhouse with our Eggs or Cakes out of \"drinking\" hours. This new regulation is one of the new \"Win the War\" reforms.\n\n60 \n\nOn the spur sketched tonight Johnno and one of the new reinstouchments playing Chess – a chap having his hair cut, and Andy watching the Chess... back end page of Verhaerens Plays.\n\n61. Diary of the Day. June 6.\n\nAnother lovely day – but with Amiens leave tomorrow, tonight looks black. \n\nMorning cleaning sportsground. After Stretcher Drill. – and Amb. loading. \n\nToby out of hospital – also Frank and Flint.\n\n62. Today made and handed in to Orderley Room Last Will and Testament – all to Mother. Wittnesses Underwood and Nick.\n\n63. June 7.\n\nDiary of the Day. (8.6.17).\n\nLeave to Amiens.\n\nTram from Ribemont at 8.45 and arrived there about 10, a regular invasion of the Australians. Before leaving Henencourt we’d only tea for breakfast, so first step was towards Breakfasting... and we struck an Arts and Crafts (?) shop. Ye Gods. Blue bright peacock sateen drapings, – slate wall and stencilled frieze of black-blue (and stencilled upside down) – pictures of violently impressionistic style, and two big screens, stencilled with flower and fruit designs (?)\n\nThe Gas tracked bed with with blue and red ribbon bows – a vase of peaches on a glass fruit stand encircled by a ribbon of emerald green, and small tables set for unsafe teas... Waitress... \nvery\n Arty...\n\nMax and Adamson away then towards the N.Z.H to see Wilson. Roland and self to fix shopping and execute several commissions.\n\nSent home No 3 copy of Bairnsfather – and bought this fountain pen – long promised – and a Ring-bound drawing book (which I sold today to Frank, and will use in its place as more convenient the note book I bought later in the afternoon) two drawing pencils and envelopes.\n\nAt the next stop – a secluded little shop in one of the strands bought a rubber and a box of jolly decent writing paper – dull milk-blue and envelopes dark blue lined.\n\nMet at Cathedral at midday, and then towards Hotel de la Paix (where I had dinner last Jan). Menu good \nalso\n wine. Chablis followed by Curacoa and Coffee.\n\nTram to the Hippodrome, and off again to print and art shop... City again bought some Post cards for Betty – cathedral again where we saw a fine confirmation service, then to Anzac Buffet – where they’ve what they ought to have had months ago, – an A.V. Treatment room. Rue Gambetta again then Tea. The Station at 7.30 train again for home (?) at 8, and back in billet about 11.0\n\nA good day – worth the travelling for, and a break from the hellish drill and camp routine.\n\n64. Diary of the Day. June 8.\n\nWrote off two letters – one to the Mater, and one to Mat... Drill this morning – squad and stretcher. Afternoon hour and half cleaning up the Rue de Bas.\n\nToby and self to Farmhouse for Coffee finances low, so only two cups each.\n\nFilled in three pages in new sketch note book. A Fine day.\n\n65. \n\nToday, in the just out Anzac Bulletin A.M.C Casualties Freddie Portus.\n\n66. Diary of the Day. June 9.\n\n9.30 parade half squad and stretcher drill, self on party measuring out 100, 220, 440 yds for handicaps. Afternoon parade 2, races at ground commencing about 3. In heat came 3rd – so no place in final.\n\nToday our wet canteen opened... Did \n4\n 5. pages of sketching three from Tea – under trees behind billets.\n\n67. Last night after Tea turned in. George bowled in and wanted something pithy – some parody on , did one on \"Three Blind Mice\" for some affair they’re getting up.\n\n68. Cliff’s back, back last night. Arm still stiff at times and troublesome but not permanently disabling.\n\n69. Leacocks got a new book out – \"Further Foolishness\" satires of the Day. Lane 3\/6 – must get hold of it later.\n\n70. Since the day we heard the 4th Div. had arrived North – we heard reports of an with the 3rd. Now the reports – or furphy of casualties comes through – 27 Killed and about 60 wounded.\n\nReturning the 3rd Div. – the start seems to have been one of them saying – \"It’s about time you relieved us!\". – which considering the while the 4th have been on the Somme, and the Nursing the 3rd have held – was rather solid.\n\n71. Diary of the Day. June 10.\n\nUnit Sports – from 11 am till 5.30 \n\nDinner behind Sergents Mess Billet under the trees and a Concert following. Went well – especially the Dinner – Rabbit – Meat potatoes and Green Peas. Custard and Pudding, Jelly and Custard finishing Beer – and Lime juice.\n\nConcert – best item on on Anzac Day George’s singing. ending with farce, jolly good. \n\nParody on Three Blind Mice went well especially one on Colonel.\n\nWrote to Commonwealth Bank and Hazel. Letter yesterday from Gerald.\n\nTonight under trees sketched that M.G. lately attached to us. Yarning after found he’s a reader – reader of essays and \n\nGeorge Barker\n\n3rd Brigade\n\nM.G.\n\nKillara?\n\nPhilosophies... and has carried since leaving home a copy of Sopochales (?)\n\n72. June 11.\n\nLast night – about midnight the most solid thunderstorm I’ve heard in France: the one at Monsset last year was good, but last nights was quite Australian!\n\n73 Library list\n\n\"The Practice of Oil Painting\" S J Solomon\n\n\"Greenmantle\" John Buchan\n\n\"Shakespeare\" and \"Keats\". \"Imitation of Christ\"\n\n\"Ginger Mick\" Dennis.\n\n\"Plays\" Verhaerens.\n\n Henri and Navarre\", D. \n\nTwo journals and a sketch note book.\n\nExpecting – from T.B.C \"Extracts from letters of J. B. Yeats\" and from Gerald \"London Lamps\" by Bourke (author of splendidly reviewed \"Limehouse Nights\").\n\n74. Diary of the Day. 11.\n\nMorning fatigue (lasted half hour or less) cleaning up ground under trees where we had dinner last night.\n\nFinished morning under trees towards Bresle side of Henencourt reading – or rather with a couple of books.\n\nAfternoon fatigue to Divisional Sports Ground behind Chateau pitching Swiss Cottage Tent for tomorrow... finished at 4 and then with Adamson lazed about watching 2nd Brigade Sports. Some good running – and a bonzer sight made by our chaps under the trees and on the steep bank terraced from the flat where the sports were held.\n\nTea at Farmhouse – eggs coffee – then back to billets.\n\nAfter 8 a while sketching \nunder\n with Frank – Tea as previous.\n\n75.","44":"\n\nToday and tomorrow declared yesterday Divisional holidays for 1st Div. sports.\n\nYesterday match against the 2nd Field lost... (Cricket).\n\n76. Diary of the Day.","45":" \n\nDivisional Sports. Morning writing under Sunken Road Trees with Addy – to Betty. Evening wrote to T.B.C acknowledging receipt of Plays, Painting and Letters of Yeats received today, also asked for list of Eugene Masons work, and for 1st printing of Beans \"Letters from France\" – which most probably I won’t get till I pay up cash.\n\nSports not up to yesterdays Brigade.\n\n77. Day’s Diary.","46":"\n\nCricket morning – lunch 11.30 paraded to Sports Ground: repetition of yesterday. Back early with Toby. Did the usual few pages of sketching (?). and read on sunken road Letters of W. B Yeats.\n\nRumours of back to the line starting: about 20 given as date.\n\n78. Tonight in Billets, – given birth to by the most desireable rumour of yesterday – that Germany was holding a big conference and had put out most tangible feelers for peace on the Terms of the Allies – comes up the subject of annexation. New Guinea, we as a young and wealthy nation \nmust\n have: for Germany to return to occupation here would be equivalent to our sharpening a razor to put in the hands of a madman roaming with us.\n\nNo treaties, no agreements no promises must be accepted by us of Germany for the non establishing of a military or naval base there. New Guinea, even though she lay another tax upon us for the Keeping, must be the same colour as Australasia.\n\n79.","47":"\n\nInfantry on the march:– sleeves rolled neck buttons undone – and their skin full of the sun – rifles carried by sling over right or left shoulder, – and marching to the beat of Kettledrums or blowing of bugles – is the greatest beauty the Military can show. Yet always with them seems a future death hovering – and a bloody reeking skeleton hand – pausing for a sweep amongst them – to rend and tear – to savagely end lives that by the promise of their vitality and beauty will one day lift Australia to the magnificence of the greatest Nation of the South.\n\nThere is a beauty in their faces – in their full expression even when in repose, that the Tommies lack: marching, the faces of the Tommies express, nothing – express only a mind beaten dead – beaten to the ideals of Militarism: They seem dull or surly. And in their beauty – there is none of that paganism that is in the Australian face.\n\nThere is a sensuousness in his lips – a something in the modelling of his nose – in that end turn up from the Greek nose, that suggests only satire, and in light behind the colour of the eye – that make his face entirely Australian.\n\nJake is a fine example of this type – so is Wilkinson.\n\n80. Diary of the Day 14.\n\nOff morning parade for Dentist – and made appointment for 2 pm afternoon.\n\nTurned down at 2 till tomorrow morning, which is seemly and most desireable.\n\nAiken drilled them from 9.30 till after 12 today – saluting – closing and forming 4s all by numbers. Much blood sun and windy battle the result. Sleeping out.\n\nBeat 5th F.A. 13-nil Rugby.\n\n81. June 15.\n\nDentist – then appointment for 5.30 pm which kept found about 7 Inf chaps waiting so dropped it. Cricket against the 3rd Field afternoon behind Chateau – a win to the 1st.\n\nWrote couple of pages of letter home,\n\nPayed – 70 Francs. Nick still 80 in hand so kept one 20 I owe him.\n\nNot on parade – 7 am – slept in under the trees the best \"doss\" since home. On a grass and butter cup spot – ringed by tall green trees growing in splendid imitation of Const. Yarned till late with Toby – Bullecourt half the spoken while. To be quiet in a spot like that, under a sky of dull blue grey pale star intricacies, the height of bliss.\n\nPosted home \"Plays\" and \"Letters of Yeats\", also 6 booklets of cards for Betty. Registered both.\n\n82 Day’s Diary June 16.\n\nDentist – and after hour and half working on it – he finished the tooth. Afternoon played the Cyclists – Cricket and Rugby.\n\nThe first trickle of Aussy mail, one from Mother April 15 and one same date from Betty.\n\nStint in place of at canteen hundred better.\n\nAmongst mail first Bulletin I’ve had for over a month: March 31.\n\n83. Diary of the Day. June 17.\n\nStretcher drill and a sweltering day – and the Canteens’ dry – stint Mafeesh! Another trickle of mail – one from Mother April 12 and one from the dad April 15.\n\nSo far \"London Lamps\" and pencils expected of Gerald haven’t yet turned up. Played – a draw – the 2nd Battery: a good solid and exciting game, afterward entertained them to tea then to a concert – that lasted from 8.30 till 11. It went splendidly – full of pleasant fooling, and the Night in Egypt A.1.\n\nMet at Pump just after match Alf Whitcombe – from the 3rd.\n\nEarly tea before bath with Toby at the Farmhouse.\n\n84. June 18.\n\n\"Bought but not Paid for\" – George and A.1. Ford as a young aspirant to Theatrical honours – youth and beauty in short skirts the best youngster make up of the show. George as Sir Henry Irving – meeting his wife in a theatrical office, and finding on her a letter for Lord Algy signed your popsy wopsy threatens murder. Complications arrive in the persons of the daughter Ford, a tough – Max, and \nBishop\n\nCaruso – Bishop.\n\nAltogether the funniest and most idiotic piece of fooling I’ve seen.\n\nSatires included good one on Brasso – the theatrical agents’ servant (Morry) on the shore up start every few moments, and shoring up from a drum of \"Brasso\".\n\nThe second half ending – \"A Night in Egypt\" went along at top speed – some of the \"Gyppos\" darkly tumbling over their various parts. As the Kan-Kan girl – Ford and Max – splendidly made up, really in A.1. ‘properties’ were splendid.\n\nTwo scenes – \"Near the Continental\" – a cafe obviously meant for the \"Egyptian Bar\" and \"A Room near Esbekiah\" – well got up and a fine background but as far above the typical Wassah room as Moet is above the village \"champagne\". \n\nTo repeat the programme already there are half a dozen requests, and an especial one from the Lavieville Aerodrome – who lost us the – to visit them for a show and feed.\n\n85. Saw Cliff today about Amiens leave, and got it for Thursday. Toby, Nick and self.\n\n86. Diary of the Day. \n17\n 18.\n\nSlept out as usual last night, and had to arise and run about 2 am. At 6 am the 8th Batt marched by – Bugles and Kettledrums: Squad Drill first half of morning then A Section in to load Section wagons – full Dressing Station equip.\n\nBack to parade ground, and unloaded set up sectional Dressing station fully eqptd. Said by the oil to be practise for a three days (moving picture) stunt of the taking of Pozieres.\n\nThis afternoon struck tents – after a solid quick thunder storm and sleep, back to Qr’s. Tomorrow B Section out on same stunt. The day before the storm hot and clammy.\n\nCable to the Dad for a Tenner: With the £20 to my account in Blighty it ought to fix well for leave. When I get it I’ll send along to the T.B.C. a couple of pounds and keep them going awhile. Cost 5.40.\n\nAmt of 70 F. drawn last Friday I’ve a total of something about 35.\n\nWill finish letter home I’ve held open a few days:– rewrite the last page – which I’ll alter:– for the reading of it would only much make the Mater worry – worry over the statement of possibilities.\n\nFrom the Sydney Mail","48":" \n\n\"The Soul of the Anzac\" by. Roderic Quinn.\n\n1 \n\nThe form that was mine was brown and hard\n\nAnd thewed and muscled, and tall & straight\n\nAnd often it rode from the station yard.\n\nAnd often it passed through the stockyard gate\n\nAnd often it paused on the grey skyline\n\n’Twixt Mulga and mallee or gum or pine.\n\n2 \n\nThere was never a task it would not do:\n\nThere was never a labour it left undone:\n\nBut ever and always it battled through\n\nAnd took the rest that its toil had won.\n\nAnd slept the sleep of the weary-limbed\n\nTill the stars grew pale, and the planets dimmed.\n\n3 \n\nThe form that was mine, is mine no more\n\nFor low it lies in a soldier’s grave\n\nBy an alien sea, on an alien shore:\n\nAnd over its sleep no wattles wave,\n\nAnd stars unseen on their journey creep.\n\nBut it wakes no more from its dreamless sleep.\n\n4 \n\nOh. Mother of myne, what is is best.\n\nAnd our graves are dug at the hour of birth:\n\nAnd the form that slept in your shielding trust.\n\nSleeps soundly here in the mothering earth,\n\nAnd dust to dust! When our part is played\n\nDoes it matter much where the change is made?\n\n9 \n\nOh Man that I was, you were foe to Death:\n\nFor life was fair to you – wonderful rare:\n\nYou had your being and drew your breath.\n\nIn ample spaces of earth and air:\n\nWhich ever and always by night and day\n\nBright Promise pointed the Golden Way.\n\n88. Diary of the Day. June 19.\n\nA day similar to all other days – a day that opened with rain and started early with the sun. Cricket team played the 1st Batt and beat them: game on our ground.\n\nWalked down to Buire – to have a look at the new battery: about half a battalion in – the 2nd and 3rd mostly – strung out along the narrow quick winding river.\n\nThe rivers’ bordered by old willows – and in places where the rivers sufficiently deep and broad they use the trees as diving stands. There’s a bonzer picture there – a bend of the stream – groups on both banks – one standing among the foliage of the trees ready to dive – or climbing the tree to get his place, others drying or dressing, and brilliant sun patches on them and the young grass.\n\nTomorrow, if it’s at all fine will get down there, with Toby and Adamson.\n\nLeave to Amiens – we’re down for Sunday instead of Thursday\n\nThursday night were giving our show at the Aerodromes, Mac’s to join us.\n\n89. Last night – casually met MacClure out. and the Amiens Cathedral and Gothic art came up. At about 10 went round to his paticular tree in the next billets grounds – and we yarned till midnight on a hundred subjects. He was at the College while I was there – so that’s how it is his face has always seemed familiar. Engineering’s his love – and the relationship of Architecture and Engineering, we spent a good half hour on. Mim turned up \nabout\n then with a bottle of Benedictine – and sacrilege followed – the drinking of it from a mug – like drinking champagne from a cut down jam tin.\n\nMythology led to Theosophy and Theosophy to bed.\n\n90. Days Diary.","49":"\n\nDay before yesterdays stunt over again – erecting of complicated Dressing station. Struck at 12 am.\n\nAfternoon full parade, and a march with towels to Buire for swimming: spoiling our last nights decsion of half a doz of us going. Good swim though, especially with the stream which is jolly strong.\n\nRain just as we reached Henencourt.\n\nHeard from Mon – through Johnny that he’ll find for me as early as possible the two books \"Interior Decoration\" and \"Belgium’s Agony\" by Verhaerens (for Toby). Wrote to him, registered letter last 3rd of this month – 17 days back.\n\nMust write again to Merriam heard nothing from him since that parcel of books at Becordel.\n\n91. Wrote to – and posted two letters today – one to the Dad, and one to Betty. Posted yesterday letter of 14 pages to the Mater – green envelope.\n\n92. Diary of the Day June 21.\n\nRun – Breakfast – Parade. Gas Drill Dinner: Walked to Lavieville and read a little of Les Miserables. Wrote to Elsie Grant and to Elsa of the N.Z. husband: received from her card in answer to letter of a few weeks back – with the word that she’s been down with Measles.\n\nA card I enjoyed – and that read well. Tonight the chaps are giving at the Aerodrome \"Bought but not paid for\" and \"A Night in Egypt\".\n\nCash in hand somewhere about 20 Francs: and Amiens Sunday, must tackle Toby for a quid: wrote to Commonwealth Bank for £3. to be forwarded here.\n\nRoland in Amiens today commissioned to buy two note books one for next journal and one for sketching.\n\n 93. Day’s Diary. June 22.\n\nStagnancy has set in – almost. This afternoon when I’d intended going down to Buire to the river, rain fell, so I’d nothing to do but read or write – so started writing up at the end of this journal the diary of the first few months of 1916 – not included in the first journal.\n\nTonight supper at the Farmhouse. Cherries just after tea \"granted\" from the orchard next door.\n\n94. \n\nLast nights concert at the Aerodrome jolly fine: that is their part exceptionally so, our two farces good: somehow they lacked the fire they seemed full of last Saturday: but they went well, especially \"Bought but Not Paid For\".\n\nThere’s the idea of a Revue – say \"Lift stretchers\" or \"No Bon Maddame!\" with a full run company. Ford would make a hit as say Gaby . \n\n95. \n\nIn The Anzac Bulletin June 13, that arrived today is Bean’s account of the attack and taking of the Messines Ridge – a Diary from Hour to Hour.\n\nLately this ‘Hour to Hour’ manner of reporting he’s adopted a good deal, and in his hands it becomes the most practical and sincere style for the subject.\n\nPart I only appears in Issue 23 Part II. – \"Commences in our next.\" Good old Bean: he beats the rest of the war journalists by points in every line, and his impressionistic style is full of beauty and realism.\n\n96. \n\nToday I heard the tale of \"A Little Child shall Lead Them\" – the song evidently started by some wag when Len got his commission in the Desert – he marching ahead of his company then was the song shortly hummed.\n\n97. Days Diary. June 23.\n\nMorning stretcher Drill – a most blessed thunder and rain storm that \nruined\n delivered us of our misery. In the afternoon walked to Buire.\n\nClarrie back from Le Havre – from Hospital, well and broke.\n\nTomorrow. D.V. Amiens.\n\n98. Diary of the Day June 24.\n\nAmiens – with Mac, Toby and Nick: Motored to Albert, to train: arrived Amiens early and straight to the Bains: a bonzer bath, the best since the \n\nones we had at Ghezireh Palace.\n\nTo the church – to the American Bar where Mac introduced us to a bonzer new liquer – Quantreau – or some such name: to the Hotel de la Paix – dinner which we sat over and enjoyed – for two hours. To the Cemetary, and there straight to the grave of Jules Verne: an interval for Beer – good stuff at only 20 a glass, then back to the City. \n\nTo the Cathedral – where Mac and self lost Toby and Nick: Nick having more than half our available cash, he being chancellor of the exchequer this was ackward – but luckily didn’t ruin the day.\n\nThen to the Musee de Picardy, and a most lovely and wonderful Musee it is: left it at about 7. then to the American Bar and half a doz liquer – to a Cafe for coffee and cake, then to the station for home.\n\nThe best day in Amiens I’ve had.\n\n99. The grave of Jules Verne – very original in its design, and striking. The ordinary graves cobbled over, and backed by the usual heading stone. The remarkable part is the figure – the sepulchre stone has been forced away – and rests strongly on the back of the resurrected Verne – his great figure half shrouded forcing his way from the tomb, the right arm raised towards heaven, over the weight of the body, of the sepulchre stone and the effort of bursting forth, taken on to the left arm, hardly gripping the bed of the raised covering stone. It is most majestic and arresting – and of all the monuments the most splendid.\n\nMany others, wonderful and original in design, seem almost spoilt by the introduction of novel features – giving an almost obvious \"Arty\" effect. In the designers effort after novelty and originality, he has overstepped the of perfect taste.\n\n100. June 25\n\nMusee de Picardie.\n\nClosed – for duration of the War: but Mac and self had a private view: \n\nMagnificence of interior \nof\n I’ve seen till yesterday only in pictures and photographs and in my preference in decoration have always been along the supremely simple – and upon the beauties of contrast:– a decorative preference, along almost Japanese lines: and the magnificent beauty of old Renaissance building I’ve in theory looked upon as \n\ndecoration of the wonderful order certainly, but decoration carried to excess. The Musee de Picardie! that Staircase Hall and its wonderful Mural Decorative Paintings of Pierre de Chavannes: There is a magnificence and beauty about it that is intoxicating.\n\nOnce I rather looked down upon velvet drapings – heavy curtains hung from great arches: Between the two stair flights, the Entrance to one of the Galleries, is a high arched entrance, hung in lovely black green velvet – velvet in wonderful folds and all the beauty of the perfect weaving in it.\n\nLike the Musee de Longchamps the Galleries seem too high – but here the lighting is good – where in Marseilles it is rotten.\n\nThe paintings ... we only had less than two hours to see the whole, but their impression left is one of lovliness and wonder. Especially one little nude study – ‘Dormeuse’ by Jean-Jacques Henner (1829-1907). \n\nA small canvas of about 24\" x 55\" an exquisite white living gleaming white nude – and hair of rich dull red – that supplies the note of the background – black gleaming through black reds.\n\nTonight, Mac, Ford and self are putting in again for leave leave for Thursday.\n\nCash in hand – about 7 F.!!!\n\n101. Days’ Diary. June 25.\n\nMorning Run – well didn’t run! Paraded to Dentist, and made appointment for this afternoon which didn’t keep owing to the cross Country-run. Cam in about the middle crowd – 30. 20.\n\nTonight writing. Wrote to Angus & Robertsons asking for Arthur H Adams \"Aust. Plays\" Allens \"Gods and Good Things\" and Lindsays \"Curate in Bohemia\".\n\nRobbin back tonight – he left us at Buire last Jan. run over by Ambulance.\n\n102. June 26\n\n\"Roman Catholicism doesn’t appeal to me, so it wouldn’t impress me: This by one of the new men: who yesterday visited Amiens, and said in speaking of the most wonderful building.\n\n103. \n\nDiary of the Day. 26.\n\nApplied for leave – Thursday, and had it granted. Frank Stone asked me if I’d give him a hand in the Orderley Room finding and filing papers ... so got off morning parade. Its a job that can be worked to last the week out so \"Laus Deo\".\n\nDidn’t see the Col at the cookhouse when I went down at lunch to clean dixie – and when Tommy King roared (because Brasso was there) at me for \"chucking water abhout!\" said \"Right\". \n\"He\"\n chipped in, and again I incurred \"Right\". He lost his Mick, roared like an Aurelian gentleman, and took my name. When I turned round and saw him, I said \"I beg your pardon sir,\" nothing else. \n\nIf he’d been a gentleman instead of the flash larrikin he’s prooved himself perhaps Id have given him more satisfaction.\n\nBlack is another Popinjay – and he’ll be very shortly taken down by the men if he doesn’t \"take a tumble to himself\".\n\nMail today one letter from the T.B.C regretting their unsuccess at not being able to obtain Beerbohms \"Yet Again\". So far, and its about due, \"Letters from France\" hasn’t turned up: nor Int. Decoration from Mon. overdue by about 7 days.\n\nTonight the men who’vre been at the 3rd C.CS beyond Bapaume arrived back: their oil was that we were all moving on the 27 – tomorrow.\n\nCricket against the Signallers 1st Team beaten. 2nd won.\n\nToday, and yesterday have been cold: Read about 60 pages after tea of Corelli’s \"The Sorrows of Satan\". Once perhaps I’d have enjoyed it, but already its too obvious, too much by far of Corelli.\n\nMust write next to T.B.C. for something of Lambs or Lucus’s or Materlincks – something to read something of matter.\n\n104. Diary of the Day. June 27.\n\nOrderley Room making out returns and lists of wagon and Ambulance equipment. Wrote 3 pages of letter to the Mater on the Musee de Picardie.\n\nLeave granted for tomorrow.\n\nRaining now, after hot day – that is hot in comparison with last few days, but still warmer than Sunday.\n\n105. Letter today from the T.B.C – invoice for Bean’s \"Letters from France\" and a list of Eugene Masons work:– the three I knew, but none of those I’d wanted. Must somehow or other get hold of some more of his poetic translations of French verse.\n\n106. June 29.\n\nPay’d tonight, and with a spine quivering asked Lee for \"80 Francs\" – and he granted it without any question – and so saved me a remarkable explanation.\n\nWhen I’ve cleared off I’ll have about 30 left: so perhaps may manage another Amiens trip.\n\nYesterday’s was a success – Don, Ross, Mac, Les, and self: We motored in in the Ambulance car and arrived Amiens about 8.30. – had a quick bath, a haircut and so to the Musee de Picardie. Made a couple of rough composition sketches in sketch book, and a lot of notes in the catalogue: and then later in the day I lost it: This trip all the galleries were open, and saw some wonderful paintings, carvings and embroideries.\n\nOne painting – the Vision of Oreste was very fine, sombre rather in colour, but beautiful. Orestes, a young gloriously developed boy, starting up from a bed, and throwing from him the coverlet, looking up at the vision. – a beautiful weirdly statuesque group of 4, a lovely great-limbed woman, three man figures behind her – one on either side one behind and above her.\n\nDinner, liquers, and chablis mellowed the afternoon and the tea at a bonzer little cake shop finished it. Train left about 10.30 and at Billets we turned in about a half hour after midnight.\n\n107. Days Diary June 29\n\nFinished job at orderley Room. Big post arrived \"Letters from France\": I’ve half read it and half the unit want it. The 24th number of the Anzac Bulletin out today and contains the second half of Bean’s account of the Messines affair\n\nIn a match – Ambulance only – between N.S.W v rest of Australia N.S.W won.\n\n108. Alan Vodle and his fantastick drawings – only seen in \"Gypy\". I remember in a diary writing \"when things appear as living drawings designed by Alan Vodle . \n\nLovely Muscat: all the wonders of amber in its colour all the idea of glory in its taste and effect. Muscat Yes Lord muscat: were drunk on it tonight, but magnificently drunk – no been in cheap champagne. but only lovely\n\nMuscat\n\nThe Lord of the Yellow gold wine Muscat!!! Skaal! Skaal!! Skaal!!!\n\n109. Last night wed some lovely Muscat: only about 10 Francs a bottle, lovely amber gold stuff of exquisite flavour.\n\nThen half party to the little Farmhouse for eggs and coffee – then to the Canteen. I’ll say I’ve never known the unit so absolutely on the rocks: and last nights two up schools – and todays Poker tell the tale of a wonderful mind relief.\n\n110. Days Diary\n\nEarly morning run only six officers out: parade at 9.30 declared off owing to rain but a bugle damned us at about 11, before then though I’d written and posted 4 letters. one to the Mater one of two cards to Betty, one to Mamselle (Dutton) and another to the T.B.C – \"asking for more\" – for Materlincks \"Our Eternity\" and Beerbohms \"More\".\n\nThis afternoon – its still young – rainy and dull. Finished \"Letters from France\" and enjoyed every page, every line.\n\nHe boosts Australians: yes. But he’s the Australian correspondent, and its his official work, but he only boosts them as they are – and the emotions behind all his letters I’ve known a hundred times.\n\n111. Today strong on Rumours – the oils. The one is that about Bullecourt the Boche has withdrawn to a depth of 2 miles, and we to a depth of 1 mile – Black fever given as the cause. Christ! if Cholera gets about... its possible but... yet the hundred of dead – rotting terribly in the hot sun... and the manure poisoned with...\n\nAnother, that we’ll be leaving here, and for a big stunt on Tuesday – and this makes it the 10th ...\n\nToday wrote up a little more of Feb. diary of 1916 and decided to leave the remainder of this journal – for its completion: the new journal to start tomorrow July 1.\n\n112. For some of that Muscat tonight: Toby and Nick are for Amiens tomorrow though – so there a Kybosh on it for tonight anyhow.\n\nSupper – after eggs and coffee at the farmhouse – sausage (tinned) and shortbread.\n\nHenencourt. June 22.\n\nA diary of the first four months of the year 1916 – written up from a small pocket diary – completed to April 26: April 26 when the first Journal was started at Marseille – by the Cornish Coast.\n\nJanuary. Saturday 1.\n\nA New Years day that only differed from other days by the dinner served us: It was only at dinner our Mess discovered the arrival of the New Year.\n\nHospital – Mumps and in isolation at Abbassiah, outside Heliopolis in the desert:\n\nDays then following the 1st, till the 8th – days of no changes. Days spent reading and writing.\n\nSaturday 8.\n\nTo vary the monotony – and out of curiosity, – broke isolation and dressed in the \"greys\" – walked across the desert to what had always looked like two great iron pillars: It was part of the ruins of an old Fortress – the two gate buttresses.\n\nFor an hour or more I lay dozing in the sun, watching the L.H drilling and the new Aerodrome. About two miles away was the Hospital Camp, and alongside the Convalescent Camp. Presently from\n\nthe latter the convalescents came marching across, marching towards the mounds. I sighted them too late, and there was only one escape:– to stuff it out – by passing them – back to the Hosp: I passed them at about 200 yds distance, but an N.C.O was detailled after me, and I was honored by a curtain lecture from their Capt. – and ordered to fall in behind I did: – and they were bound for a mile beyond the mound...\n\nI was behind: and the fortress ruins to be passed were about 8’ high: the officers were in the lead: and when the head of the squad disappeared over the rise I ducked back.\n\nAbout midday from the Hosp. I watched with the other groups the Convs. return – and heard \"That man that broke camp fall out –\". He swore he’ll remember me, and even matters later.\n\nSunday 9.\n\nThe Expected transfer to Tents didn’t come off – as usual \"Church Parade\" and \"House\" great rivals: \"House\" wins though today: the Chaplain bleats too much.\n\nMonday 10.\n\nTransferred to Tents: with White. (White – of the Engineers came into Ghizereh just after Christmas, and from there to Abbassiah we were both evacuated: about a week ago – on the Henencourt Wood ground met him again.)\n\nThe two other chaps in my tent are Miners – one of Coal and the other Copper. Both not half bad chaps.\n\nTuesday 11.\n\nTents 1. 2. and 3. detailed for Camp fatigue – so didn’t do march & came under C.O’s notice. Laus Deo! Spent morning back in Hospital yarning with that N.Z. chap from Otago.\n\nWednesday 12.\n\nOn the Desert Morning march. The chap in charge a young Lieut. – and from him we’d a jolly fine lecture – or more like a ‘yarning’ – on the sanitation of the trenches and beach in the Peninsula. The lack and the nature of water there, and the careless burying at the beginning that later caused so much contamination – he was jolly interesting on.\n\nBack in Tents in afternoon, saw my chance, and fixed for discharge – though period spent \n\nin the Conv. Camp supposed to fill one week.\n\nThursday 13. \n\nPaid £1.0.0. and discharged from Abbassiah. Had dinner at the Petrograd – drove there from the Hospital. Arrived back at Ghizereh about 8. – and found half the friends I’d made had transferred to the 1st L.H.F.A. – Jimmy Kingston amongst them.\n\nSpent remainder of evening reading a big batch of home mail – and heard from Harry for the first time, relieved to hear he’s not dying as G. said in his last.\n\n(That was the only letter I had from Harry: following it at about a months interval came one from Maddame, then months later in one of the Dad ‘Geoff and I both attended poor Harrys funeral last Tuesday.\"\n\nFriday 14.\n\nToday I fell into a good job in the Q.Ms office.\n\nJolly thankful for this as I felt particularly against all ward works...\n\nPhillips is well again, and is to be boarded for Australia (Phillips – the first patient Id ever anything to do with.\n\nSomewhere about the beginning of December I was detailled as special orderley – with a special sister (Sister Leaman) to watch this chap: he’s had several pieces of bottle extracted from his skull, and was dying of blood or something forming on the brain. Till Christmas I watched that chap from 8 pm till 7 am. – for two weeks with Sister Leaman. And Leaman did a jolly decent thing there: his brother from detach came up to see him, and she fixed things so that he could sleep by him, so that he would be handy if his brother became consious again.)\n\nSaturday 15.\n\nIn the office of the Q.M’s. A \"staff\" job.\n\nSunday 16.\n\nSecond time to the Pyramids, and \"did\" the Pyramid of Cheops.\n\nThe Interior with Les Botts brother: inside a hellish crowd of sweating Tommies – suggesting a Join Labour meeting.\n\nTook no snapshots, (if I remember rightly for a most obvious reason: ...)\n\nMonday 17.\n\nIn to Ordanance near station.\n\nTuesday 18\n\nTo the Red Barracks Abbassiah for clothing etc for store.\n\nN.Z. A.S.C. G.S. wagons.\n\nWednesday 19.\n\nBorrowed £1. of A.J.S. \n\n(Remarkable.)\n\nThursday 20.\n\nWent out with Dick through Cairo, and bought a shirt. Had supper at Groppi’s: much better than Saults though only just lately realising this.\n\nSaturday 22.\n\nClimbed Pyramid of Cheops with A.J.S. and took some good snaps. Afterwards \"touristed\" round a bit, and \"did\" tomb of Mother of Cephron – jolly interesting.\n\nGot back late, – after calling in at Mena House to look up Gen Curtiss – and in Kitchen met Sister Millar she promises to come out to Pyramids one Moonlight night. (she was a bonzer little Girl, to walse with divine.).\n\nMonday 24.\n\nPaid £1.8.0. Out with Capt Bass to Int. Base and Anglo Egyptian Bank. Caught by rain – but the Ford travelled some, back to the Palace \n\nBack at Ghizereh into the Officers Mess, and a whisky each.\n\nWednesday 26.\n\nA hellish tea: the water leather was boiled in.\n\nSaturday 29.\n\nGinger up from Wardan.\n\nOut with Dick for afternoon with full pockets. Started with intention of making for Maadi to see Ron, but only got as far as Bahalisk. Afternoon tea there – then engaged Gharry for the afternoon. Through the Mousky – dinner at St James. Met there two very decent 1st L H chaps, and joined them Rest of night at the El Dorado. Realised on Camera.\n\nSunday. 30.\n\n14. A.S.C wagons from Mena unloaded, and 14 more at 9.15 pm. finished by 11, and supper in Dicks tent.\n\nMonday 31.\n\nStoring away stuff that arrived yesterday.\n\nJanuary altogether a good month, but spoilt by half of the best chaps leaving while I was at Abbassiah.\n\nHeard from Jackie Howe this month, and lived a quiet life away from the wards.\n","50":"\n\nTuesday 1.\n\nSaw Dearberg re exchange to 1st L.H.F.A. Tried hard to get Dick to promise to think \nof\n exchange seriously over, but wasn’t successful.\n\nStill working at getting newly arrived stuff into store.\n\nTried to be paraded to O.C to get transfer through.\n\nWednesday 2.\n\nTried again for parade before O.C. Eventually had to send in application in writing with the letter to Dearberg appended (this letter was one written to Dearberg by the mate of the chap he was transferring with – asking him to work the transfer for two).\n\nOne of patients – McCloud by name – came over to stores to borrow corkscrew. – and spent greater part of night there. Interesting chap, and knew a lot of Sydney people, I do.\n\nThursday 3.\n\nMet Snow in Cairo – he’s in 1st L.H.F.A. and at Wardan.\n\nReceived letter from Anglo Egyptian Bank ... reached bank just after 1, and had to wait till 3 pm. A lot waiting for money, and very complicated ceremony getting it. \"The Kaisers Garland\" and with it bought \"Iota\" by de Vere Stacpoole.\n\nTo the pictures with Harry & some 5th F. chaps. Spent part of evening in Blanchards, and spent about 65 P.T. on necklace for Betty.\n\nFriday 4. (entered June 30).\n\nThe parade this morning 6.30, turned out with the usual \"To your duties quick march\"! Glad I didn’t turn out as I intended last night on orders.\n\nSent back by new A.S.C. (?) 400 mattresses to ordinance. Report confirmed from there that France from March to be our base ... a lot of changes lately point to this.\n\nTommy treats our niggers too well ... and they’re a dam sight too familiar.\n\nNew addition to dog family an Irish Terrier: good.\n\nWrote to Father.\n\nSaturday 5.\n\nTook me all my time to keep an eye on six niggers taking beds to Sisters quarters. Each trip up meant a chase after them all ... I’d have given anything for a riding whip.\n\nKursaal with Dearberg and supper at St James. (devilled eggs).\n\nRained about midday, teamed at night.\n\nKursaal audience 99% Australian – better than the show itself Met one of P. Lincoln A.S.C chaps at Shepherds.\n\nSunday 6.\n\nRound Diana’s neck a guy of the Marquee was tied a few days ago. Nature decreed that she should fall ... and she lost her head and fell – also her arm and part of her back. Luckily her lost arm wasn’t the one holding her scant drapery. We put her back on the pedestal, but expect there’ll be a board sit on it, (the disaster – not the pedestal).\n\nLatest latrine has it that the 4th Brigade enshipped yesterday – destination unknown.\n\nYarned till late with Deaberg on \"The Eternal Question\"\n\nMonday 7.\n\nPaid £1.8.0.\n\nTook breeches to Indian Tailors and offered him 5 P.T more if he’d have them done by Thursday – on account of Transfer. He jumped at it. Tried to get \"Songs from the Trenches\" but couldn’t.\n\nHad supper at St James by self 15. P.T. and Gharried home.\n\nThe F.A. chap sleeping in my tent grew very confident before sleep ... he comes from the E end of London – ran away to Australia at 15, enlisted at 16, at beginning of warr. Enlisted because a chap said they wouldn’t have ‘shrimp’ like him, an amusing chap.\n\nTuesday 8.\n\nSent 100 old Mattresses to V. Hosp. at Abassiah. Seems that the men lately from Lemnos have taken over the V. Hosp por devils ...\n\nFell ill: took oil. had a nightmare last night about home people coming over in a transport, landing on W.A, and a surf (and I still now remember the details terribly) ending disastrously.\n\nChaps fined 2\/6 for not being in 4th, full muster again this morning - excepting self.\n\nWednesday 9.\n\nMy night on duty.\n\nPacked and parcelled up beads for Betty also Cards, and Book of Sullivan Cartoons. also Paters \"Renaissance\" and \"War\".\n\nDearberg talking today at Mess\n\nof the recall of all Medical students: seems in favor of going home: but dislikes idea of being called \"coldfooted\". Hope he lasts out till our transfer to 1st LHFA come through.\n\nGetting out of store lot of old Medical stuff: a deal of Elliot’s packing rotten – also their chemicals. \"a bloody scandal\".\n\nThursday 10.\n\nBecause a form team didn’t turn up, and because an Indian tailor didn’t have my breeches ready at 3.15. and because I made for Groppi’s, I met Ron – and he’s not changed an Iota. \n\nSpent till about 10 pm with him – and one of his friends. Am to meet him next Sunday.\n\nAlso met again a Woollahra chap – by name Monckton, at the Egyptian cafe – in the same squadron as that Ron attached to.\n\nGinger (my last mate) had his nose broken at Kasr-el-Nil skating rink.\n\nThursday 10. – what a bonzer night that was – dinner at St James, liquers and wine, afternoon tea at Groppis and a night sitting drinking outside the Egyptian cafe.\n\nFriday 11\n\nDisappointed at no letters from home. – none now since 26 Dec. letter from Dave C(urtiss). and one from 2nd Base with Vivs address. Wrote to him just now.\n\nYesterday a ‘Red’ letter day, to day a ‘Black,’ at 10 am had to report to F. ward – a surgical ward – for duty. Had to take C Venn’s – who’s going on post mortem.\n\nGot trousers from tailors: fit well, but not exceptionally well.\n","51":"\n\nGot up at Revelle today first time this year ... about time too.\n\nSmith (training on transport) my ward mate, sisters all very nice ( – there was lolly Riley and – ye they were nice – tres bon.)\n\nSaw first copy of the Sentimental Bloke – present by publisher to M.R. She’s very nice \nand capable\n – my oath, (that was nasty way of summing her up).\n\nMail late last night one from London, one from Joyce, from Geoff, at Leura. Three polite letters, or rather two – wanted home news, not homesick, but want to hear the news from \nthem\n.\n\nSent parcel home – beads, cartoons and Pater’s \"Renaissance\".\n","52":"\n\nWard till 1 and met Ron at 2.15 at Steins. Programme: Petrograd, Citidal – Dinner St James – failure at Kursaal and Picture show so Wassahwards: Met two of Rons friends (Arabic!). Egyptian Bar and met a third and finished night reeling off Omar. Gharry drive back to Ghizereh didn’t quite understand the beauty of those wonderful lines. Remember I’ve to meet Ron on Tuesday at 4 pm again at Steins.\n\nHope to get back to QMs job. George is back in hospital.\n\nMonday 14.\n\nMet G. Weir at breakfast – he looks like wild Irishman: likes his job. Hope transfer soon comes through – sick of hosp: Not much hope though as the 1st left for XX, 50 miles further out. All Meds recalled perhaps I may get into Charlie Burns place in same Amb. Will try if transfer isn’t through before end of week.\n\nBack at Pere again – this time E.I. Cleared out of hosp nearly 200 patients. Latest is Bombay for Hospital and Persia for the troops.\n\nTuesday 15.\n\nIn this morning’s orders – \"Anyone caught having a bath will be dealt with\" etc etc.\" Something wrong with water supply. On parade first time this year.\n\nMidday – raining: set me thinking of day, July 19, marching from Barracks to station through teaming rain. I won’t forget that day in a hurry – almost as bad as first Military Camp at Liverpool in 1913.\n\nMet Ron and Lowie in Cairo, also Jimmy, Slanger – also the two Watts (F.A) Loo is not Lieut as I thought but Corp. (Loo shortly after got his commission).\n\nDinner at St James – 4 of us Chablis etc. Kursaal and Groppi’s. Gharry home: Meet again next Thursday.\n\nWednesday 16\n\nDuty 6.30 am till 9 pm. Ward F now nearly empty. \n\nAm going to parade tomorrow re transfer.\n\nRead \"Sentimental Bloke\" turning in but by . also Wallace’s \"The Prayer\" – old piece at Liverpool Keep it with Brooks \"The Soldier\".\n\nThursday. 17.\n\nWorked till midday\n\nLetters from Mother, Father, Betty Aunty Gert and Geoff: also long one amongst them from Mat – in Melbourne. Betties best of all – short because – she \"hadn’t any more to say because it wouldn’t fit.\" One of Maters written 6.30 am First batch of letters received home.\n\nWent into Cairo for a while.\n\nFriday 18.\n\nMore letters, also two Bulletins. A long day: hosp: quietly emptying only about 200 - 250 in now.\n\nParaded re transfer but no definate satisfaction.\n\nSaturday 19.\n\nWard till midday.\n\nSmith again in Cairo – \"on business\" rotten!\n\nMet Ron and Lowe: I had 10 P.T.\n\nYarning and drinking all afternoon: Had rushed dinner and then on to Kursaal – a Revue \"Smile Up\". Missed first part, but what we saw enjoyed. Although dress \"quite respectable\" horrible air of beastliness about most things. \"Allies maids\" rather good. Belgium, an exquisite girl in tights, and red, black and gold marching: lovely ankles and figure much admired.\n\nSunday 20.\n\nA Long day, and a slow Day on ward. \"Concertina\" the limit, worst day I’ve had with him.\n\nMonday 21.\n\nPaid £1.8 0.\n\nWent into Cairo, and had long needed haircut and shampoo. Called at Stores in Savoy Hotel enquired after parcels: nothing doing.\n\nVisited two R.C (or rather G.C) churches: one dark with very fever’d yellow candlelight, – the other light and not ineffective, – rather too much imitation Mosaics.\n\nKursaal with Harry, Berry and Dick. Supper then to the Wassah.\n\nTuesday 22.\n\nStill getting things out of Hospital: general clearance still going on.\n\nHad dinner and tea – as lately – up stairs: Tea out on Terrace by self – read and finished Lockes \"Glory of Clementina Wing\". Not half bad.\n\nFrance still continues with favour. Nothing yet through re transfer to L.H.F.A.\n\nWednesday 23.\n\nWard till midday.\n\nSpent greater part of afternoon in Cairo Museum – 2nd visit: The perfection of the carvings and the scarcophagi ... marvellous, stood at side of Seti I for long while ... should be enshrined in special gallery as the David of Michaelangelo.\n\nEarly tea at Groppi’s. Wrote long letter home, and bed at 8.\n\nTired – so tired that I put Meth. spirits in lamp in place of Kerosene. Called for Fires.\n\nThursday 24. \n\nHarry got photographs?!!!\n\nWard empty now. \"High Jinks\", Emptied tin of baking powder over Sister – and got salt in return. Cocoa and sock backsheesh.\n\nAll hosp. goods are being packed very securely so \"it looks \nlike\n as if France is no latrine after all.\n\nPersonally seems France is our destination – say another six weeks.\n\nBombay possible but not probable.\n\nFriday 25.\n\nEmptying Wards J. K. E etc. Visited Old Cairo with Bartlett. Coptic Churches – Resting places of Mary and Joseph. Roman and Egypt columns in church vault under altars etc hideously crude and like. Affected more by old French graveyard.\n\nCoffins old and new, falling to rot in open Tombs easy to jump into. French soldiers for most part. Bones, shrouds and dried rotting bodies mixed .\n\nYMCA Book Carravan and then Tea. Yarning with a F.A. chap. Said broke into Taratium, and then abuse of the Wassah. Glad to lose him while he went after a book.\n\nSaturday 26.\n\nClearing Wards. Museum with Harold Squires till 4.30 Had Tea Es be Kieh Gardens and evening in Wassah instead of Kursaal as intended Supper at YMCA and on to bed.\n\nLatrines\n – No 3 Aux at Heliopolis and opening new Hosp at Alex.\n\nSunday 27.\n\nLetters from Mater and Grandma. \n\nTaking down Marquee and moving beds till midday. Slept and read \"The Sphinx’s \" till tea.\n\nWandered over to grotto first time this year and read R.C. communion service in chapel. Met Pres chaplain Friend of Uncle Nick’s: he had ‘heard of me and seen my photo’ he said.\n\nHad supper in grocer’s shop behind hosp. Sardine sandwich etc.\n\nFelt more down in dumps since enlistment.\n\nThat Padre was Capt Gordon – more Capt than Padre.\n\nMonday 28.\n\nBlanket rolling morn and after.\n\nNothing new in \"latrines\" except No 3 Aux not so mentioned.\n\nWent out to Pyramids with Harold for first time at night Splendid masses. Sphinx especially wonderful.\n\nNative Policeman makes caustic remarks re officers ...\n\n\"Shweigen ist Golten.\" \n\nTuesday 29.\n\nDick lost ends of moustache last night and appeared at mess this morning with a shaven upper lip... Sensation.\n\nBlanket rolling and baling of white ones all day.\n\nReceived a parcel with soap – so I needn’t borrow of Dick.\n\nBoomerang from Estelle. Wrote short note to the Mater.\n\nMarch. Wed 1.\n\nBaling. Walk with Harold S.\n\nThursday 2.\n\nMet Jefferson to yarn to for any time tonight, a jolly nice chap and I’ll be glad to cultivate him. Sorry now he didn’t take place in our Unit in the first instance.\n\nBed early, hot and muggy\n\nFriday 3.\n\nBaling fatigues. Divided into sections on this morning’s parade \n\n9 am parade called for volunteers for Field – in Base details. 31 to be picked before we leave here. \n\nVery hot, changed into shorts for first time.\n\nTransfer to LHFA came through \nbut\n approved, but too late.\n\nSaturday 4.\n\nDinner and Dance after to staff by Col: went off very well: Lights out by Medcalf at midnight – sounded in Main Reception hall – at foot of state staircase.\n\nThe Cols speech very tactless and in the manner of Wellington reference to Lord Bathurst, of his \"detestable army\". Col Martin didn’t certainly go so far as that, but being very pithy and addressing Base only he slandered the Inf ‘bloodily’.\n\nDances good – some bonzer waltzes with Sisters. ‘Tres Bon’. The Marble floor splendidly prepared was fast and bonzer.\n\nSunday 5.\n\nSlept all afternoon and wrote home. Church parade 10.15. Special order of Gen. Birdwood read by Col. Ammounted to the statement that Canadians etc in France paid particular attention to saluting, so we must also. Ron mentioned this order last time I saw him.\n\nService conducted by Staff, whose delivery is perfect, his treatment though of his text – re the temptation of Christ by the Devil, rather rough. Generally he’s detested by the staff, but he’s not entirely bad: certainly he’ straightforward in his vices, which aren’t less than he intends.\n\nMonday 6.\n\nPaid pound;1.8.0\n\nVisited Bank. but no luck, also boot polishing place of Rons! nigger enquired after Ron in way he’d not appreciate.\n\nPictures with Jefferson, supper at Groppi’s. Walked home – he moralising self confounding him.\n\nHe’s a damnably good chap, but very unsympathetic towards the Wassah woman, – and that type generally.\n\nThursday 7.\n\nIssued with Waterproof sheet, Fork, Knife and Spoon and F’Dressing leather pouch. Spent afternoon at Cairo Medical School and in their dissecting rooms.\n\nStudents working – three new bodies on table – seemed quite natural and in no way sickened me as I’d expected. Couple of heads, arms and legs lying in corner – unclaimed. Syphlittic collection unique and awful.\n\nWednesday 8.\n\nBaling all day. Gave in 3 blankets and Mattress to QMs. – to sleep on base bed frame tonight – one blanket. Read at Tea YMCA \"Songs from The Trenches\" they’re jolly good ... Wrote to Harry and Geoff and sent home A. Frances \"Path of Glory\" Hichins \"Imaginative Man\" (1st edition) and Dobells war verse.\n\nThursday 9.\n\nOut with Jefferson evening after heavy day baling. Most of staff now ready. Sidy is in Kitchen \"Crawling for stripes\" (popular saying that couldn’t possibly be applie to Sidy).\n\nWrote home.\n\nFriday 10\n\nGetting Sisters out – also their luggage. Solid work all day, bed early.\n\nSaturday 11\n\nSpent whole afternoon going through Mouski bazzars with Harold. Very enjoyable. – and amusing native funeral fight. Had tea at YMCA. and back to hosp early for mail. 2 from Mother, Geoff, Betty (a bosker) and one from Elsie jolly nice one enclosing one of Court.\n\nMothers both ment. cable. Sorry I had to \nsend \n cable especially second time. However ...\n\nSunday 12.\n\nChurch parade Staff preached. Lovely delivery ... but ...\n\nWrote to Mother re money, and long letter to Betty on Mouski.\n\nMonday 13.\n\nClearing dispensary. sisters quarters and Mess Room. also P. office.\n\nLetter from Nick – he doesn’t know yet his brother is in No 1 with appendicitis. \n\nWe move tomorrow at 9.30. Packed up.\n\n\"All day long the noise of battle rolle’d.\"\n","53":"\n\nBroke camp at Ghizireh and marched through Cairo to Abassieh. – to the Dermatological Hosp. Half to No 3 Aux.\n\nParaded at 5, and detailled ward work. Patients 2500. Some awful cases.\n\nBill and Self on No 6 Ward: maj of case from Sydney.\n","54":"\n\nHours Reveille at 6.30 Parade 7.0 ward Breakfast 8. Parade 9. Ward till 12 Dinner 1.15. Parade 2 – ward till 5 Tea 5.45, Mafeesh.\n\nThis afternoon the old chap and Bill did. Bubos – I ; Interesting work – but glad were only here \"loaned\" and \"on strength\" temporarily awaiting orders.\n","55":"\n\nAfternoon off, Borrowed 5 PT of Bill and went into Bank. Nothing doing, Lost my block; and wrote beastly letter to the Dad, which I’m sorry about. Hope he doesn’t get it but its beastliness will carry it along.\n","56":"\n\nWork.\n\nHarry away so had all Ch. and Cn. to do\n\nLatest\n We’re all to stay!!!\n\nStill Later Leave for Alex next week.\n","57":"\n\nWard all day.\n\nBack at night and did fomenting. Made Cocoa and listened to real good concert by AMC mess. One chaps sang particularly well number of old English Ballades: his voice gained appreciation alone.\n","58":"\n\nWard till Midday.\n\nGave Harry a hand for while afternoon. Had tea and into Heliopolis, with intention of attending \"Benediction\" at the Basilica: Closed also another very beautiful little Catholic Church. Beautiful domed tower.\n\nWalked to that weird building on edge of desert. – and found it to be what I’d supposed from decoration a Hindo Temple. Built on three terraces, – and of most fantastick weirdly ugly, and beautiful Architecture. Tea at Empire Club.\n","59":"\n\nWard.\n\nPay – and out with Harold to Mouski, Bought two strings of beads for Betty, one amber and the other Cornelian.\n\nGot prints of Sidy’s photographs. 33 P.T. Tea at YMCA and remainder of evening wandering round Cairo.\n\nBought for 5 P.T. Two Tauchnitz edition book of \"Alywin\" – I’ve long wanted to read. Cold in ear and head.\n","60":"\n\nHarry off so had greater part of dressings. Read fair bit of \"Alywin\"\n\nRumoured we move off at end of week for Alex then for Brighton.\n","61":"\n\nIn orders – Officers, Rank & File of No 2 A. G. H. will hold themselves in readiness to move off on Fri or Sat.\n\nWent to Bank. Nothing!\n\nSpent remainder of afternoon in Coronation Mosque, sketching columns pillars and plan in R. & MC book.\n\nWrote to Mother, Mat, and Court from Soldiers Cafe in Gardens. Took away from there copy of \"The Antagonists\", Read on way back.\n","62":"\n\nWard. Got evening leave and wrote to Uncle Harry, Aunt Estelle, Geoff, Elsie and Gert in America. Got second vol – (companion to \"The Antagonists)\" from Cafe Tea at YMCA.\n","63":"\n\nS.A. Parade at 7.30, supposed to have moved off at 7 this evening. Packed Kit against tomorrow.\n\nFatigue Party to No 1 A.G.H, Most beautiful building inside. Made some sketches of mantles etc, seemingly same throughout building.\n\nArtificial lighting inc. fine – fretted brass work of the Mouski.\n","64":"\n\nLeft Dama at 7.45 am and marched to No 3 Aux. Caught Helio Tram. Left Cairo station at 9.55. Heard Col tell Lady , on station that as far as he knew, France our destination. Arrived Alex about 12.45, unloaded train of luggage etc, and enshipped about 2.30. Fatigue of unloading and placing of Sisters luggage in hold, all afternoon and part of night.\n\nBed at 9.15 and out again on wharf to unload spirits. Amount of Sisters luggage positive scandal.\n","65":"\n\nSailed out of Alex about midday. Mess orderley. After breakfast Messes altered now of C. 1, of 31 men still orderly, had to move bunk from \"first floor\" to \"basement\"\n\nDinner rather complicated affair Read all afternoon and finished \"The Antagonists\" Anxious to compleat 3 vols: start good. Sing-Song Morn aft evening with violin.\n\nBed about 9. Cocoa with Harley. Life belt parade – set points 5 pm.\n","66":"\n\nLife Belt parade. Calm all day, but rather cold at night Wrote three page of close writing to Mother. Innoc. against Typhoid this morning, Deck swabbing fatigue – twice daily 11 am and 4 pm, Concert tonight in Saloon – not going: feel too tired and fed up. Concert 8.30.\n","67":"\n\nFatigues sweeping lower decks and swabbing down: Don’t feel well – suppose effects of inoculation. Most of chaps seem this afternoon sleeping on deck – or trying to. Rained little during afternoon. Turned in early, and finished \"Richard Furlong\", Jolly good book.\n","68":"\n\nPassed Malta. Gozo island far more beautiful than Malta, passed two French destroyers and a submarine – also couple of French troopers and an empty Eng one. Day very lovely: read \"Picture of Dorian Grey\"\n","69":"\n\nLong argument with Peachy as to wether Whistler was a wit or a humourist: Peach contends he was a humourist. Argument led on to Portraiture of Brush and of Camera:– so led to Sunlight in Pictures.\n\nHeadache from innoculation.\n","70":"\n\nSailing into rough seas: paraded with headache – and spent Morning lying in. Very rough, nearly all our chaps seasick. Up afternoon on Aft deck. Water wonderful. Felt well – but bad again below, so up again. Bed at 6.\n","71":"\n\nArrived Marseilles.\n\nParaded full marching order insp by Col. S.A Parade. Moored against one of wharves for about 1 hour early, then again back in stream. Moored to buoy.\n\nTroopers disembarking at different parts. No leave.\n\nSunday 2\n\nIn stream. Three troopers passed early – about 6.15 pm. Tommy Trooper about 9.40 and large Aust at 11. Exchange of cheers – also compls. Church Parade. Tried to write home but couldn’t succeed. Must get fountain pen at first opportunity.\n\n(Note – July 18.17). This Tommy trooper – asked where for they roared at \"Blighty\" – that was the first we’d heard of that place.\n\n"}}