{"Document Name":{"0":"Diary_0173","1":"Diary_0173","2":"Diary_0173","3":"Diary_0173","4":"Diary_0173","5":"Diary_0173","6":"Diary_0173","7":"Diary_0173","8":"Diary_0173","9":"Diary_0173","10":"Diary_0173","11":"Diary_0173","12":"Diary_0173","13":"Diary_0173","14":"Diary_0173","15":"Diary_0173","16":"Diary_0173","17":"Diary_0173","18":"Diary_0173","19":"Diary_0173","20":"Diary_0173","21":"Diary_0173","22":"Diary_0173","23":"Diary_0173","24":"Diary_0173","25":"Diary_0173","26":"Diary_0173","27":"Diary_0173","28":"Diary_0173","29":"Diary_0173","30":"Diary_0173","31":"Diary_0173","32":"Diary_0173","33":"Diary_0173","34":"Diary_0173","35":"Diary_0173","36":"Diary_0173","37":"Diary_0173","38":"Diary_0173","39":"Diary_0173","40":"Diary_0173","41":"Diary_0173","42":"Diary_0173","43":"Diary_0173","44":"Diary_0173","45":"Diary_0173","46":"Diary_0173","47":"Diary_0173","48":"Diary_0173","49":"Diary_0173","50":"Diary_0173","51":"Diary_0173","52":"Diary_0173","53":"Diary_0173","54":"Diary_0173","55":"Diary_0173","56":"Diary_0173","57":"Diary_0173","58":"Diary_0173","59":"Diary_0173","60":"Diary_0173","61":"Diary_0173","62":"Diary_0173","63":"Diary_0173","64":"Diary_0173","65":"Diary_0173","66":"Diary_0173","67":"Diary_0173","68":"Diary_0173","69":"Diary_0173","70":"Diary_0173","71":"Diary_0173","72":"Diary_0173","73":"Diary_0173","74":"Diary_0173","75":"Diary_0173","76":"Diary_0173","77":"Diary_0173","78":"Diary_0173","79":"Diary_0173","80":"Diary_0173","81":"Diary_0173","82":"Diary_0173","83":"Diary_0173","84":"Diary_0173","85":"Diary_0173","86":"Diary_0173","87":"Diary_0173","88":"Diary_0173","89":"Diary_0173","90":"Diary_0173","91":"Diary_0173","92":"Diary_0173","93":"Diary_0173","94":"Diary_0173","95":"Diary_0173","96":"Diary_0173","97":"Diary_0173","98":"Diary_0173","99":"Diary_0173","100":"Diary_0173","101":"Diary_0173","102":"Diary_0173","103":"Diary_0173","104":"Diary_0173","105":"Diary_0173","106":"Diary_0173","107":"Diary_0173","108":"Diary_0173"},"Date":{"0":"unknown","1":1476.0,"2":1477.0,"3":1478.0,"4":1479.0,"5":1480.0,"6":1481.0,"7":1482.0,"8":1483.0,"9":1484.0,"10":1485.0,"11":1486.0,"12":1487.0,"13":1488.0,"14":1489.0,"15":1490.0,"16":1491.0,"17":1492.0,"18":1493.0,"19":1494.0,"20":1495.0,"21":1496.0,"22":1497.0,"23":1498.0,"24":1499.0,"25":1500.0,"26":1501.0,"27":1502.0,"28":1503.0,"29":1504.0,"30":1505.0,"31":1506.0,"32":1507.0,"33":1508.0,"34":1509.0,"35":1510.0,"36":1511.0,"37":1512.0,"38":1513.0,"39":1514.0,"40":1515.0,"41":1516.0,"42":1517.0,"43":1518.0,"44":1519.0,"45":1520.0,"46":1521.0,"47":1522.0,"48":1523.0,"49":1524.0,"50":1525.0,"51":1526.0,"52":1527.0,"53":1528.0,"54":1529.0,"55":1530.0,"56":1531.0,"57":1532.0,"58":1533.0,"59":1534.0,"60":1535.0,"61":1537.0,"62":1538.0,"63":1539.0,"64":1540.0,"65":1541.0,"66":1542.0,"67":1543.0,"68":1544.0,"69":1545.0,"70":1546.0,"71":1550.0,"72":1551.0,"73":1552.0,"74":1553.0,"75":1554.0,"76":1555.0,"77":1556.0,"78":1557.0,"79":1558.0,"80":1560.0,"81":1561.0,"82":1562.0,"83":1563.0,"84":1564.0,"85":1568.0,"86":1569.0,"87":1570.0,"88":1571.0,"89":1572.0,"90":1573.0,"91":1574.0,"92":1575.0,"93":1576.0,"94":1577.0,"95":1578.0,"96":1579.0,"97":1580.0,"98":1581.0,"99":1582.0,"100":1583.0,"101":1584.0,"102":1585.0,"103":1586.0,"104":1587.0,"105":1588.0,"106":1589.0,"107":1590.0,"108":1591.0},"Entry":{"0":"\n\n","1":"\n I start this book, the 6th since enlistment in the midst of winter whilst out in rest in Cormont a quiet village of about 300 inhabitants almost 15 miles from Boulogne. The war situation is stern, the enemy being strengthened by Russian withdrawal so that more of the burden is falling on Great Britain. Americas advent is very welcome at this stage. I expect to go to England on leave any day now being 3rd on the list & may be fortunate enough to be there for both Christmas & new year. The weather is now cold, the frost remaining on the trees all day making a very pretty sight. Had a busy time supplying the brigade with drugs otherwise nothing doing.\n","2":"\n Nothing of importance doing & nothing new in the papers. Went for a long walk during the afternoon to chase away some cobwebs.\n","3":"\n Very anxious about my leave but do not expect to get it now until after Xmas; I hope not as I do \n\nnot like the idea of travelling on Christmas . Great preparations on for our dinner here & would be sorry to miss it. Frost still on but the thaw commenced during the day. Had a 5 mile walk after 4 this afternoon & it was beautiful coming home in the moonlight over the snow. Orders out now which definitely make dispensers Staff Sgts so that it will surely come to me now without anymore delay. Heard a report this evening that the referendum was going for No, it made me feel quite bad.\n","4":"\n Very cold frost on. Went by car to the 15th Field Amb to collect drugs which they had drawn for the division. Had a few minutes in \"Samer\" & returned in time for tea.\n","5":"\n Christmas Eve. Worked hard making mixtures etc for the Battalions & sorting out their requirements for issue with the car in the morning. Had a bad bilious turn so did not feel at all jovial. Thaw set\n\nin & country almost clear of snow.\n","6":"\n Christmas Day. Sent off the stuff to the Battalion & then went through my kit so as to be ready to go on leave when the pass came through. Washed a few things etc. At 6 P.M. we had our Christmas Dinner the unit having theirs at midday. Ive had 10 courses, very fine indeed but it very nearly resulted in a tragedy. The first courses where much too liberal with the result that out of respect to the Cook we simply overate ourselves & when the dinner was over we were all helpless for an hour or more. I have never seen such a spectacle before. The fun of evening commenced about 9 when we began to move about & the drinks began to circulate. Then with songs & fun with the help of the piano we kept going till abut 12.30 when we closed the evening. The menu consisted of –\n\nOysters, Soup, Asparagus, Fish, Steak & Kidney Pie, Poultry peas & potatoes, Plum Pudding, Blancmange, Fruit Salad, Coffee. Drinks were two wines, beer, Whiskey & Brandy. During the night there was a heavy fall of snow the country being once more covered in a white mantle.\n","7":"\n Boxing Day. Christmas morning the Sgts played the men a game of Soccer football. The Field was a sheet of ice owing to the thaw of the snow & the result freezing & it was almost impossible to walk upon it much less run. However we played & were beaten by 4 to nil, a good result for us as we were actually playing the units soccer team which so far is unbeaten. This was my first game for two years of any kind of football & they say now that I have to join the team permanently. Felt very sore afterwards with a bad wrist owing to a fall. Had breakfast about 9 & spent the remainder\n\nof the day near the fire, snow falling all day. Played patience & otherwise filled in the time as well as we could.\n","8":"\n Plenty of snow and fairly cold. Still awaiting my pass now due so finished packing up and otherwise fixed things up so that I could leave all straight . Am taking across a French bayonet I brought from Cape Helles also a German bayonet, a couple of bombs etc etc. The usual game of Crib. at night, a rubber each night now being quite a habit with me.\n","9":"\n Cold with plenty of snow. Walked to ‘Frenck’ in order to work off some of my stiffness after the football match. arrived back at 1 P.M. & found that my pass for \"blighty\" had arrived with that of C. Price: our cry of, \"Will they never come\" now answered. Heard of a car going to Boulogne so went by that & had tea at the Soldiers Institute there. Could not\n\nget accommodation there so had to go to the ordinary billets for leave men. These are not very good. Obtained two blankets but did a freeze at night as it was bitterly cold. We were amused until morning by a tommy rather full who was enjoying himself shaving his comrades & bandying repartee. He was good with the razor but it was a risk that I would not take. Could not sleep at night.\n","10":"\n Up at 6 oclock but a blighter of a Scotty would not let us out in time to get breakfast. Out at 7 however & called at Station for our gear which we had left overnight & then walked down to the boat, a vast difference to the procedure of last year. When all the Australians had collected we went on together. Sir Douglas Haig & other heads being on the same boat. The crossing was fine & fast having 3 other boats & 3 destroyers as escort. Passed several other boats, mine sweepers etc etc. Reached Folkestone almost midday & boarded the \n\ntrain which left about half an hour late the first train being full of officers. Had a snack at the station, tea & bun our last being a sandwich at the Canteen in Boulogne. Reached London shortly after two oclock & marched to Horseferry road where refreshments awaited us and splendid treatment otherwise, quite different to my previous experience. In fact \"going on leave\" is now a glorified Cooks Tour whereas before it was worse than a nightmare. Left my spare gear in the Pack Store & swapped my old hat for a new one in the clothing store, did not worry about my other gear as I had a good Uniform at Dartford. We then took taxi to the National Hotel where I had a bath & clean change & then booked seats at the Haymarket to see \"General Post\" a first rate show with a war interest. Had dinner at the Hotel & turned in well satisfied after a yarn with an Aussie.\n","11":"\n In the morning went for a walk round Oxford st. Strand & Trafalgar Square returning per bus, it was good to see the old place again. Saw C.P. off just before lunch; he going to Birmingham. I then went & had lunch at the Australian Y.M.C.A. at the Aldwych Theatre; a splendid affair. There I had what they called a Standard meal for 1\/3, Soup, meat & two vegs; pudding & coffee. Splendid value. Then caught train to Dartford about 15 miles out of London where I saw friend Ramsay now with two dots up. Also changed into my good Uniform which I had there. Had a look round the place & had tea at the Sgts Mess, all very grand, billiard table, bar etc, & met several old friends of Lemnos days. Returned with Ramsay to London with the idea of going to a show but there was nothing on, so went out to his cousins at Kensington instead. Turned in well satisfied with myself.\n","12":"\n Feeling pretty fit. After breakfast went along by bus to S.M. & Co to collect some money & mail which would let me know where D.W.A. was. Weather very mild & did not wear greatcoat. Drew £10 to start with. Had a walk round, London pleasing me muchly as usual & came across a margarine queue, which was rather depressing. Had lunch at the Y.M.C.A. Aldwych again & sent off a letter to Mum. In the afternoon I went out to NottingHill Gate to see D.W.A. & Aunt & spent the evening there. Reached the Hotel at midnight being just in time to join a dance with which they brought the New Year in. Danced till 3 A.M. but the show was a poor one being dominated by some wild Russians from the Embassy who carried on in such a way that it spoilt it for others.\n","13":"\n\nThe New Year and how does it find us, seemingly no nearer the end & we are in\n\nour fourth year of war. Germany with a new lease of life is still strong and we are counting on the help of America to a large degree. Our greatest danger is at home, the civilians are the hardest to control & scarcity of food & hardship find many of them little prepared to stick it. Personally I have no fears providing we can control our allies, we at least can stick it out. Those of us who have been on Active service for 3 years or over at times long for a return to ordinary conditions but with maimed and sick men at home the fit are doomed to stick it out to the end, and if we come through it will be a service to be proud of ……. First went along to Bumpus & Co Booksellers Oxford st. who had sent me books whilst in France & purchased several more, some to send home to Sydney. Next to the Waterman Co re fountain pen. Went to NottingHill for tea & then went out for dinner and the Theatre. We had dinner at The Gourmet a French restaurant very decent & quiet being\n\ntucked away in Soho, finishing up at Pamela at the Palace a very good show on revue lines with Lily Elsie & G.P. Huntley in the leading parts. Bertie Adams, an Australian Girl I met here in 1914 also had a good part, she having advanced well in the profession. Supper at & missed tube so walked home, about 3 miles. Sent a cable to Australia telling of my leave during the day. Had lunch at the Bun House Holborn an old resort of mine of prewar days.\n","14":"\n Decided on my future movements which were to go to Glasgow tonight & return on Sunday to London after calling at Birmingham. Sent off a telegram to Glasgow & and wrote to Elliston then took a taxi to Bunton &so to NottingHill for lunch then to the Matinee of \"When Knights were bold\" quite the funniest play I have ever seen. I laughed till I cried & felt quite tired out when it was all over, Challener being the mirth medium at the Kingway Theatre.\n\nHad tea at a Belgian Café in Oxford street & then returned to the Hotel, packed a Haversack & after dinner caught the 8.50 P.M. to Glasgow from Euston. A good train & it landed me there about 7 A.M. stopping at Carlisle & Crew on the way up.\n","15":"\n\nIn Glasgow. Arrived a the Harpers about 8 A.M. & received the usual good welcome. Henry was home on leave & later Charlie Moore arrived. After Breakfast they insisted on me having a sleep on the couch before the fire which I did feeling much refreshed at 11 A.M. Will was free having holidays so we went for a walk during the afternoon & a good yarn at night. Turned in pretty late.\n","16":"\n Did not wake until 10 oclock. Had a stroll round Glasgow in the afternoon, the streets being packed with people all in a holiday mode. Most of the factories had closed down for \n\nrepairs over the holidays & there were also a lot of visitors in the City. At night we went to a Music Hall but it was second rate after the London shows. Enjoying my stay very much.\n","17":"\n Decided to catch the 9.50 P.M. to Birmingham so sent a telegram to Elliston. Had a good walk with Mr Harper in the morning but stayed in during the afternoon to yarn with the girls as I was leaving that night. Four of them saw me off Elsie & Sophie coming on to the Station. The train was crowded but managed to get a seat O.K. Had a look at the Municipal buildings before leaving Glasgow the Staircase being one of the wonders of the place.\n","18":"\n Arrived at Birmingham about 6 A.M. after having changed trains at Crewe, put in an hour or so in the waiting room & then strolled round the place in order to fill in time until 10 A.M. when I judged that Elliston would be about.\n\nIt so happened that the Tank which was parading round the country as a Bank was shifting that morning so I saw it on the move, quiet a huge crowd had collected to see it off. First came a line of Police then a squad of home defence troops, quite the funniest lot of soldiers I had ever seen. They were old & grey headed but their intense pride made them carry themselves like wooden soldiers, a sight indeed. The music for the march past was supplied by a Police band making quite a triumphal procession. I then took train out to Ellistons boarding house & I was pleased with his appearance, he had developed into quite a man & we spent a good day together, yarning in the morning & a walk to a park in the afternoon, the weather being still mild. I caught the 6.20 P.M. back to London & arrived at the Hotel a little before 9 oclock a wee bit tired after all my travelling but very pleased with it.\n","19":"\n First went to S.M. & Co. to draw another £10 after which I felt much safer also received a letter from Paris. Went along to Bumpus again & settled up for my books. Had lunch at the Y.M.C.A. Went out to tea at N.Hill & had dinner at The Rendezvous another of the French places round Soho & very nice too. Then went along to Princes & saw Carminetta, a real good musical play, Delysia, a French girl being very good. Supper at Bustos & tube home. Weather rather cool with a little snow.\n","20":"\n Spent most of the morning ringing up Dartford to get Ramsay up for the evening as I had arranged to meet M.L. & D.W.A. for dinner & the theatre after. Had lunch at the Y.M. & met Ramsay at Charing Cross Station. This was the coldest day I had yet experienced in London & although I did not mind, I noticed that others did. Met Ramsay about 2.30 & we strolled round finishing up at Bussards in Oxford\n\nstreet for afternoon tea which we sat over yarning for a long time. At 6.30 P.M. we met M.L. & D.W.A. & went along to \"The Rendezvous\" for dinner which was first rate. We then went along to see \"Arlette\" at The Shaftesbury. It was about the best of its kind I had seen having good music & plenty of fun. Joseph Coyne & Winifred Barnes the leaders. Then tube to Nottinghill Gate, supper at Bustos and taxi back to Hotel. Nearly repeated my previous mistake of losing one glove, but this time went back & found it, the last time I did this it cost me 10\/6 for a new pair. Ramsay could not book a room at the Hotel, so we slept together in my single bed, some squeeze but we managed. We had breakfast together next morning.\n","21":"\n Decided to have a quiet evening so arranged a day for that purpose. Saw Ramsay off first &\n\nthen walked to Ludgate Circus in order to buy some books having lunch on my way in Fleet st., a good meal with a bottle of wine & coffee to finish up. Then met D.W.A. & went along to Burlington House to see The Imperial War exhibition. It had just been opened and was first rate being a collection trophies, guns, planes, helmets notices etc and a large number of photos. An Australian section was very interesting, the photos being familiar. One huge photo showed the Australian band 18’ x 10’ marching in Bapaume. There was also a section showing the work of Munitions. We then had tea at The Popular Piccadilly Circus proceeding next to The Leicester Galleries where there was an exhibition of drawings by Will Dyson. Several I recognised especially one of the Gas Centre I controlled on the Menin Road. It was a splendid drawing, absolutely true to life & brought the same scene back vividly to my memory. Went out to NottingHill\n\nGate for dinner after which I listened to good music & had a nice quiet homely evening.\n","22":"\n Went along to S.M. & Co. & drew £5 & also left my souvenirs, 2 bayonets, 2 bombs, diary & maps etc. Had lunch at the Y.M. and wrote a couple of letters. Visited Hugos & Times Book Club having tea & dinner & NottingHill Gate. Then went to see The Beauty Spot at The Gaiety. The show was rather good but not quite what it was refuted to be. Felt very downhearted all day at the thought of things in general so walked home to work it off. Very successful as I felt better next day.\n","23":"\n Spent the morning in the hotel & met C. Price at 2 oclock at Euston. Then had a busy time. First had lunch, paid my bill at the Hotel, took a taxi to Horseferry road & get the remainder of my Kit then on to Wilton Hotel at Victoria where we booked a room for the night. I then ran out to Nottinghill Gate to say goodbye, had tea there & met C.P. again a Piccadilly \n\nat 7 P.M. Had dinner at The Popular & then went to see ZigZag at the London Hippodrome. It was a Revue in which George Robey was the Chief item. Walked home to Victoria & on my way had some tea & cake at a street coffee stall, the first time I had visited one. T’was an interesting experience as the crowd round these stalls after midnight is rather a mixed & interesting one. Packed my my kit & fixed up my uniform to be posted in the morning so that I could get it if I return to London. Went to bed about 1.30.\n","24":"\n We were called at 5 A.M. had breakfast at 6 A.M. & caught the train which left Victoria at 6.50 A.M. As usual the crowd were very silent on the way to Folkestone, for myself I slept most of the way. When we reached Folkestone we went into some billets alongside the Station & were there long enough to get refreshments at the Y.M.C.A. We then went onto the boat\n\n& after a fairly rough trip we reached Boulogne about 1.30 P.M. Four boats were in the convoy & we had Torpedo boats as an escort. We were free when we reached France so we straightway had a good dinner at a restaurant nearby. Then after leaving our kit at the Station we took the tram to Wimmereaux in order to see our friends at the Hospital. After tea we returned in order to catch a leave bus which was going to our camp. However much to our disgust we found that the blanky thing did not go so perforce had to walk back to the Hospital this time with our kit, a distance of about 2 ½ miles. On arrival we were given a bed in a ward so spent the night in comfort.\n","25":"\n Had breakfast and dinner at the Hospital also a stroll round the Hospital & Wimmereaux. Went into Boulogne & spent a couple of hours in the \n\nSquare looking out for one of our cars to take us back to the camp. Just as we had given up all hope one appeared and also gave us the news that the Sgts were having a dinner at Etaples that night. The two officers told us that we could take the car along if we wished so they got off when about 3 kilos from the camp & finished on foot and we continued on to Etaples. The dinner had commenced and we received a great welcome as the others did not expect our return. We soon caught up with the Courses and had a right royal time, the dinner being to commemorate 2 mentions, and a Meritorious Service Medal. At 9 P.M. we finished up and returned to camp about 6 miles away when I received my mail which consisted of 22 letters 20 papers and one parcel. It was a splendid finish up to our trip, the whole journey going off without a hitch.\n","26":"\n Read all my letters before going to sleep last night. Heavy fall of snow during the night but it did not last long. Nothing much doing so tried to do some writing and also wrote up the old diary. My general impression of England during ‘my trip was splendid.’ The people appeared to be solid & were putting up with discomforts such as shortage of sugar tea & meat and were quite content to put up with more. Their general spirit was very cheering & I returned to France satisfied that we in the Field were being backed up by those at home. Concerning our voting on Conscription I went over prepared to bury my head with shame but I found that the matter had been dismissed as of no importance and they had not condemned us because of the great love they have for us, some even go so far to say that probably they would have voted the same if they were in our place. Latest voting gives a small majority for YES in the Soldiers vote. Hughes has apparently gone back on his word as \n\nhe has not gone to the country on the question. His reason I know not, his action is damnable making a farce of political honesty.\n","27":"\n Weather mild with some heavy rain. Felt a bit off colour during the day but managed to get some writing done during the evening. Received more mail during the day.\n","28":"\n Fairly cold and felt very off colour a reaction from my trip. Did some writing and made another start on learning French. Drugs very hard to get all the battalions etc crying out for stuff.\n","29":"\n Much milder and feeling better. Spent some time reading my papers. Will return them to Oldnance as waste paper is now being collected, a step in the right direction in economy. Had a sponge bath before turning in. Rain during the day.\n","30":"\n Very mild, almost recovered my usual spirits. Did my own washing as funds very short. On my return from leave I had\n\nto pay out over 80 francs for dinners etc in the mess so am rather stumped and will have to go steady for sometime. Paid my billet bill today which further reduced my purse, paying ½ franc per night, a good bed & hot water in the morning. Military rate for a Sgt is 2 per night but when we look out for ourselves we have to pay more.\n","31":"\n Had a poor day & finished up with an awful headache through biliousness. Very little to do.\n","32":"\n After the parade three of us, W.O. Sutton, Sgt Campbell, & myself set off for a days outing. We left about 11.30 & walked to Etaples a distance of 6 miles. There are large camps in this area, mostly New Zealanders & Canadians, the Australian having been shifted to Havre. The town itself very poor, not much better than a village but it possesses a tram which runs onto Paris Plages, a fine watering place on the Coast. We had lunch in Etaples & then took a cab & had a rollicking drive\n\nto Paris Plage passing everything on our way, the distance being 5 kilos. Paris Plage itself is a beautiful place, quite famous & one of the best watering places. The buildings are fine & of special architecture many being of swiss design. The beach is exceptionally fine & in the season must be a splendid sight. At night when the place was lit up it was a grand sight, the streets being filled with soldiers & people & the shops being of a high class character gave the place quite an air of jollity. We had tea here and it was quite good. After visiting the various sights such as the English Church, Gardens etc etc we caught the 7 oclock tram back to Etaples & walked from there to Cormont making in all 14 miles for the days walk.\n","33":"\n Felt well after the walk and did a couple of miles before tea. Tried my hand at French again. Lovely weather.\n","34":"\n Weather very mild. Had some rain but not enough to make things unpleasant. Nothing doing bar the ordinary sick parades.\n\nWednesday 23rd\n Beautiful mild weather. Had a recurrence of biliousness. Went along by car to the 15th to pick up supplies. Had to wait for them so had tea there, then helped to unpack the stuff, about 24 cases, then set off home with my own requirements about 6.30. We then had to sort it all out for the various units which was completed at midnight. The Battalions have been badly treated in the way of supplies since I went on leave as they were unable to get supplies.\n\nThursday 24th Jan\n Sent off all the drugs this morning to the various units. A bright sunny day all day, really exceptional weather for this time of the year, it being hard to realise that it\n\nis winter. My promotion to Staff Sgt came out to day being dated back to the","35":" on which date an order came out affecting the matter. I now draw","36":" per day so will feel more comfortable, as since my alteration of allotment last March I have been drawing only 1\/- per day which is not enough really for me to carry on with comfortably.\n","37":"\n A perfect day, bright & sunny, the trees showing the effect of the warm days by commencing to bud, of course a couple of months before their proper time. Went to Frenck to see a football match in the afternoon, one of the semifinals of the sports conducted in this area. Our team was known as the No 5 group being chosen from all the technical units of the division. However only one pioneer was chosen so that the team was practically chosen from the 3 ambulances. The opponents were the 14th\n\nbrigade being drawn from over 3000 men. The game was very close & our team won a splendid game 8 to 7. I was quite hoarse from barracking. Started to pack up as the transport has to move out tomorrow morning.\n","38":"\n Transport moved out today as they were going by road all the way. Sent off all my equipment & only left enough to carry on sick parades & send some stuff to battalions.\n","39":"\n Sent the last lot of stuff out to the battalions this morning: in the afternoon walked to Etaples & went to Paris Plage again. Had a good afternoon capped by good feed in Paris Plage. Felt quite fit on my return.\n","40":"\n Our last day in \"Cormont\" so did final packing and returned all surplus & empties to the main depot for the 15th Field. Needing a haircut badly, took the car on into Boulogne & had the luxury of a first\n\nclass haircut & shave. Had tea at the soldiers institute. Met Major Beard just returned from leave by accident so brought him back with us. Arrived home about 7 P.M. & packed up my kit etc ready for marching out as we were timed to start at 2.15 A.M. Turned in at 9 P.M. to be called at 1 A.M. Paid for my billet before turning in & consider that the majority of people in this village are an avaricious, grasping lot. Besides what we pay for our billets they collect from the British Government and the slightest thing they can claim as damaged is also paid for by the same good Samaritan. I really believe if the wind blew a fence down the people would put a claim in against the British Government. Lovely weather.\n","41":"\n Reveille at 1 A.M. Had breakfast at 1.30 and marched out at 2.30 A.M. the lads all singing in great spirits. Reached Samer in about 2 hours\n\n& had a cup of hot tea before getting on to the train, the usual mixture of 3rd class carriages & trucks minus doors windows etc there not being sufficient time to repair them. Set off out 6 A.M. & after a tedious trip reached the Dekemabeek siding in Belguim near Kemmel at 12 P.M. MIDDAY. There the Y.M.C.A. had a cup of hot Cocoa awaiting us & we marched a short distance to Rossignol Camp where we spent the night. Had a wash & brush up & walked to the M.D.S. at night to see the place we were taking over. Had a good yarn to old members of the 2nd Field Amb. Returned to camp & turned in about 9 P.M. feeling tired but could not sleep much owing to the cold, the weather having changed a lot.\n","42":"\n Up at 8 A.M. after a rough night, it being very cold. Had breakfast & then walked out to the A.D.S. at Wijtschaete. This is supposed to be one of the best in France, being constructed by a company of Engineers\n\nand two British Field Ambulances in spare time during the winter. Almost entirely constructed of concrete it would take a tremendous amount of shelling to damage it. We then returned & the M.D.S. had a look round & then proceeded to our camp where we had dinner. We then marched out with the crowd to the M.D.S. & had a good evening with the 2nd Field crowd taking over the place early next morning. The night was cold but I spent a better night then the one previous. This sector is remarkably quiet hardly any shelling at all & one can walk about quite freely.\n","43":"\n Took over from the 2nd & straightway had 3 cases, quite an event. I was put in charge of the station so had a busy time fixing everything up. The place was left in rather a bad state so with the small staff available we all had plenty to do. I had a dispenser with me\n\nbut as he was fresh from Australia he had to be shown everything, then there was the operating theatre, Gas room, sick room, ordinary duties, evacuations, requisitions to battalions stocking the A.D.S. & a dozen other things to be done so that between the lot I had plenty of running about to do. As I always feel better & happier when busy I was well satisfied with things. Weather very cold, well below freezing point. I have a good dugout with the W.O. & it will be most comfortable when I get it fixed up with my photos etc on the wall.\n","44":"\n Managed to get things fairly straight today but had very busy time fixing up requisitions etc. Had very few cases through only one wounded man but several sick. Weather very cold, heavy frost all day. Hopped into my mail at night & polished off six letters before going to bed.\n","45":"\n Frost disappeared today the sun coming out & making everything mucky through the thaw. In the afternoon took a car to collect drugs at Outtersteene but took patients to Dranoutre, & the C.C.S. at Nieffe on my way. Had trouble with punctures but managed to get a new tire, our final mishap being a skid into a ditch through trying to pass a lorry on a greasy road. Luckily we did not capsize & another lorry pulled us out without difficulty. Collected my stores, a big load, chiefly dressings & returned to our station, Young street M.D.S. about 6 P.M. Did some writing at night.\n","46":"\n Had a busy day sending out dressings & supplies to the different posts etc. Weather beautiful. Practically no wounded coming through but a few sick.\n","47":"\n Nothing of moment. Weather good. Have now got the station in pretty good order looking well & fit for anything. Had a bath at night before a fire. Tackled French again.\n","48":"\n ’18 Caught a cold most probably through my bath & felt rather heavy all day. Took a stroll in the afternoon up to Kemmel Hill, the highest point of the district & a very valuable observation post of ours before the Messines Advance. ‘Tis honeycombed with trenches dugouts & tunnels with machine gun possies all strongly built with steel & cement. Had a good view of the surrounding country but it being hazy it could have been better.\n","49":"\n Had a quiet day and did a little writing also prepared a requisition for stores to be drawn tomorrow. Had some music at nigh with piano in mess. Weather beautiful. A.D.M.S. inspected the place and was very pleased.\n","50":"\n Nothing much doing. Sent my offsider to collect the stores. Had an evening in the Mess, good fun, singing, piano yarning etc. Bed about one, feeling O.K. although I had a cold. Very cold wind blowing all day.\n","51":" &","52":"\n Issued some drugs etc to outside units & also sent stuff to B. Section. Cold developing rather badly pains in the head, in for a bad time. Piano still in the Mess so have some music occasionally. Trying hard to get a go on with French again but its difficult, I’m not in the mood. More mail arriving but no home letters.\n","53":"\n Feeling very off colour Neuralgia having developed to some time. Kept quiet during the day & out of the cold wind when possible. Church service in our mess at night the hymns being played by a tommy Sgt we dug up nearby. He turns out to be some hit in Music being a Doctor of Music & after the service we had a great treat. Capt Stevens of Melbourne singing several songs. He is wonderful indeed & his Toreador is a wonderful effort. After that we made an evening of it & I turned in about 1 A.M. being at peace with the world at large.\n","54":"\n Had great difficulty in getting up as I have never felt worse. Heavy cold with neuralgia pains etc. However got up about 9 but could not do breakfast, began to feel better towards evening. At night 5 machine gun officers, Stevens & 3 of our own officers with the aforementioned tommy visited us in our mess & we had a great musical evening with piano, dulcephone, clarinet & flute with card tricks as a side line. I stuck it until 10 oclock when my neuralgia drove me to bed.\n","55":" &","56":"\n Heavy cold still but improving. Had a quiet time as not much doing. Made up the weekly requisition & sent it on to A.D.M.S. Mail coming in very slowly some new sorting management being in force. French very quiet.\n","57":"\n Good weather. Cold much improves but bilious attack in evidence. Changed over the night & day staff. Went & collected drugs during the afternoon. Inspection of \n\ncars & station by A.D.M.S. & heads. \n","58":"\n Needing exercise & wishing to examine some graveyards I decided to walk to B. Section who are at Kandahar Farm about 3 miles. Walked across the fields in parts & saw that we had completed a lot of ploughing. This work is being done in this area by soldiers. All the horses which can be spared are used and central dumps for manure have been made. Tractors are also used and large areas are being ploughed which would otherwise be wasted owing to there being no civilians about. Had dinner at Kandahar & then proceeded onto Neuve Eglise (much knocked about) to the office of the G.R.U. They looked through all their papers for Dave Drummonds grave but could give me no information. I then ran up through sigs, the D.A.D.G.R.& E but they also could give me no information. Set off for home then getting a lift by a motor lorry. Weather very cold.\n","59":"\n Decided to have a look at our posts & Frontline today. Set off about 11 oclock & first called at the A.D.S. at Wijtschaete. Passing this point we had to give our names to a sentry as a check is kept of everyone past this point. The first post we came to after passing through the remains of the village was Verne R.A.P. There were a few of our bearers & we ran into our Major & a couple of Captains. Then we crossed country, passing several fill boxes of Fritzs now used by our chaps & came to another post, Cabaret corner. Picking up a Lance Jack as a guide here we then went on to the most advanced R.A.P. at Ravine wood. We here visited the Frontline and were well repaid for our trouble. Things being quiet we were able to proceed out to one of our fill boxes which commanded a wonderful view of Fritzs trenches, fill boxes etc. I crawled out in front and before me I could see innumerable\n\nvillages etc with Church steeples quiet undamaged. The enemy’s line here was close & we were fortunate enough to witness several of his strong points being shelled both by our guns and trench mortars. The trench mortars were firing a new type of shell, about 160 lbs weight, with wings like a torpedo. When fired we could see them quite plainly in the air soaring upwards and then descending on the target. Several direct hits were scored and one I saw apparently landed near a tree as tree & all went up into the air. With the glasses one could see practically everything & places as far as \"Menin\" could be seen. It was indeed an unique position & we certainly do here hold the dominating position. After about an hour of it we dragged ourselves away but before going far an enemy\n\nplane came across & flew low down over our trenches. I was trying to locate the Mortar which had been firing. Machine guns & rifles blazed out from all sides but he seemed to lead a charmed life as he was still going strong when we left. Back again through Ravine Wood we touched at another post & reached Camp shortly after 5 P.M. after a day of great interest. The ground we covered was the scene of the great Messine battle & the trenches, notices & fill boxes of Fritz still stand & serve to show what a wonderful advance it was. It was a grand day, bright & clear & we could see, Ypres & such places quite plainly & shewed what a death trap it was for us prior to this advance.\n","60":"\n Went to Communion at 9 A.M. Padre Holliday. 3 of us present. A beautiful day, bright sunshine but nippy. A great day for the Aeroplanes\n\na Fritz being brought down near Bailleul. The Balloon at Kemmel was carried forward today for an hour or so. It was rather a strange sight to see a motor car going up the road with a huge balloon attached.\n\nMonday18th Feb\n A cold day but bright sunshine. Nearly finished a cross for Dave Harper’s grave at Trois Arbres. Am very disgusted with myself as all the time I have been looking for this grave I have been looking for the wrong name. Each time that I have made a verbal enquiry I have asked for the grave of Dave Drummond instead of Harper & the mistake did not dawn on me until yesterday I saw the two names together. Then it came to me in a flash altho. that I should do such a thing is almost unbelieveable. However I went to the Cemetery today & verified\n\nit so that now I have only to fix up the cross. I wonder what \"records\" will say to me as I wrote & denied that the grave was there.\n","61":"\n Cold but fine beautiful sunshine. Aerial activity one fight taking place overhead – which I believe our plane was later successful. Finished the Cross & gave it one coat of paint. Tackled French again.\n","62":"\n Made up an indent for drugs & sent it along for signature. Nothing doing much except about 4 wounded through in the early morning. A very successful raid on our sector. 15 men went over and brought back 7 prisoners without sustaining a casualty. The bombardment we put up was very sudden, a whole brigade opening up & putting a wall round the point raided and as suddenly ceasing.\n","63":"\n Saw a tommy measuring the Cross this morning. A Major saw it when passing & sent back a Corporal to take the measurement as he wanted one exactly the same, some compliment. When off by car with 2.M. Price at 1.30 to get the drugs. First left a patient at the C.C.S. & then went into Outtersteene. Had a wait so went along to the femaires, old friends where we had a yarn & cup of coffee. It was remarkable what they knew of our movements. They could tell us when we were to be relieved etc also how many divisions we had in Italy (ie. 7.) & who they were & what ones were coming back none of which I knew before & they gather the information from the tattling of officers & adding threads of such news together. Collected the drugs & then went onto Bailleul where we tried to buy a present for Sgt. Jones who has just been married. We had no\n\nluck but had some fun with a very entertaining M’elle in one of the shops. I also bought some putty, black paint & a brush with \nwith\n which to finish the Cross.\n","64":"\n Fixed up the supplies I drew yesterday & then gave my Cross a second coat of paint. In the afternoon had a visit from Tommy Gissing, he walking out about 7 miles to see me. I was very glad to see him as it must be about 8 years since we met. He was much the same as of old & we had a great yarn. Wrote my first letter in French at night, to S. Dobbevitch in Paris some effort & much better than I thought possible.\n","65":"\n Beautiful day. Had a go at the rats as they were becoming a nuisance at night. All I could do was to gas them with acetylene but I fear that it was not very successful. A lecture\n\nat night by Major Strachan on Water. I did a couple of experiments for him prepared hydrogen & made an explosion as well as shewed the flame. Lecture very good.\n","66":"\n Nice cool day, very little doing but had 10 cases through during the night. Finished the Cross today & I’m glad that I did the writing myself as it looks alright. Received a parcel today from Fan.\n","67":"\n Rain in the morning but cleared up during the day. Enemy planes over at night. Had a rude awakening during the night or rather morning. The Capt Q.M. & his W.O. became very merry on rum & at 3 A.M. came to my dugout to disturb the other W.O. & myself. They stayed for ¾ hour alternately wrestling & talking. One of them seeing Gwens photo was calm for 15 minutes going into raptures over it. Eventually they left & we remade our beds & went to sleep again. At night we had a lecture by a Tommy\n\nSgt a bachelor of Music & it was a real treat. He briefly traced music from the beginning, named & described the various composers playing selections from several & made on the whole, an enjoyable evening. I feel that I have been musically starved & certainly appreciate it more than I did in prewar days. Wrote several letters during the day.\n","68":"\n Orders out for us to move to \"Dranoutre\" on the","69":" to take over a Scabies Hosp. from the 15th, so did a little packing up. Sent off two men as advance guard & to get familiar with the workings. Orders now out for A. (representing Anzac) to be worn by those entitled to it, service chevrons also being compulsory. This means that I will have to put these decorations up now. Heard my first lark of the year this morning singing at it’s best.\n","70":"\n Had rather a busy halfday. Set off with 5 patients at 1 P.M. for the","71":" A.C.C.S. taking D.H.’s Cross with\n","72":" as Trois Arbres cemetery is alongside. Fixed it up with the help of one of the grave staff & it looked real well, quite as good as any there. Then went into Bailleul where I attended a lecture (with the W.O.) representatives of all units were there by invitation. The object of the lecture was to explain the food question to troops, so as to dispel any doubts & fears as to whether the people at home were suffering from want or were likely to be. It appears that British troops have been much perturbed over the subject & the Government have sent out lecturers with the idea of explaining things & so improving their morale. Dr Cameron of Glasgow was the lecturer & he gave a pretty graphic description of what has been done & is to be done to grapple with the subject. Much of it was familiar but certain figures he gave were new. Causes of deficiency of food caused by (1) France have a shortage of 50% (2) & Italy","73":" & (3) sinkings by U Boats. Since","74":" we had 1302\n\nships sunk. The merchant navy commandeered by Government up to 50%. 1800 ships used for army & navy transport. In December we lost ships carrying 3000000 lbs bacon and 4000000 lbs cheese. Luckily U.S.A. crop had been increased by 4,000,000,000 & Canada 200,000,000. U.S.A. by care had been able to send us at end of January 150000000 lbs of bacon & 25000000 lbs of meat. By extra tilling in England we had raised 2,000,000 lbs of potatoes & in 6 months pigs had increased by 500,000. Germany suffering heavily proof from Authentic source. Had no coffee, tea etc & were often weeks without meat & bread. They had 10000 food substitutes in use, a tribute to their inventive genius. At commencement of war we captured 6 ¼ years supply of coffee & now hold 2 years supply we having exchanged a lot with Sweden for iron ore. We have established large factories to make margarine & now turn out 4 times previous quantity. Its export practically stopped from Denmark & Holland as they demanded wheat in exchange which we\n\nwould not give them as it finds its way to the enemy. Russias position very severe, sweets non-existent & clothing very dear, a suit costing £16. Our food control officers employ 5000 people, 20000000 food tickets printed weighing 68 tons. Queues now expected to be finished those we have had being for Butter, Meat, picture shows & whisky. Tea has been scarce only expensive brands being available but Government have taken over all stocks & made a blend which sells at 2\/8 per lb, Manchester has been made the Clearing house for tea & tea experts have been sent there. Other lines are treated in a like manner. Potato flour being now used to better effect as experts have demonstrated its use to the bakers. Sugar beet cultivation also commenced. Sinkings of U Boats now said to be faster than the enemy can build them. General Carruthers then spoke saying that every effort was being made by use of Cookery schools to improve our cooking in the Army so as to give us better food and to\n\neliminate waste. The great spirit of the people was touched on, they being satisfied to put up with shortages so long as we, the Army, had plenty & the general feeling amongst the troops that we could spare a little for the civilian population. Altogether an afternoon well spent. Coming back called at the","75":" Field to get some of the place re taking over & then back to camp.\n\nThursday 28th Feb\n Received orders at the last minute that I had to go on ahead & take over at the 15th Field. Packed up quickly & arranged with my offsider to fix things up at the M.D.S. & then went in the car to Dranoutre at 11 oclock. Had a look round & lunch with the 15th Sgts & then fixed up all the duties in order to take over the Hospital & got the men to have a look at their job ready for the morning. Also took over the dispensary. At night went into the Y.M.C.A. & listened to a lecture on Seamen of Drakes time by a Mr Fitzgerald, very good & stimulating. He also gave several humourous recitations.\n\nFriday 1st March\n Spent a good night taking everything into consideration. Up early & took over at 7 A.M. Found plenty to do as there were 123 patients serious & otherwise & Baths, treatment, disinfecting & a dozen other sidelines had to be fixed up. However had all square by about 10 A.M. & by night had everything running perfectly. Rigged up my bunk in the dispensary at night as I still have to watch over that.\n\nSaturday 2nd March\n Bitterly cold day, the coldest this winter I think as a wind was blowing at the same time. Everything going on smoothly at the Hospital, M.O.’s & men satisfied which is a good sign. Made a few alterations during the day & drafted ward rules at night so that matters should be perfect tomorrow. Had a bath before tea & it was a real treat to get under a warm shower. Heavy bombardment last night, brought on\n\nI believe from Fritz raiding us. We do not know the real result but there are tons of rumours. We are about to raid him on a large scale, 200 picked men being specially trained & we have sent bearers up to the line to be in readiness if needed. Sent a car today for drugs so everything is now O.K. & I should be able to put an hour in on French after tomorrow. Mail today from Australia also a parcel.\n","76":"\n A very busy day with the Hospital but everything went off O.K. Bitterly cold, the usual March change but there are signs of an improvement. Managed to get off one letter at night.\n","77":"\n Things going on very well, everything working smoothly. O.C. expressed his satisfaction at the show so I’m satisfied with that. Made a special arrangement with the Baths to fumigate our blankets so now everything should run\n\nsmoothly. Weather still cold with rain.\n","78":"\n The last few days just steady going, nothing of importance happening. The weather has been fine & the cold snap has disappeared. The inspection by the A.D.M.S. quite satisfactory notwithstanding that it came without warning. The O.C. afterwards said when talking to me, they tell me that you have been in every job under the sun, referring to the different jobs I have carried out in the Amb, someone must have told him of it as he has not been long with us. Matters fairly lively on the front as Fritz raided us & we raided him. The bombardments were fairly sudden & intense. Mail been coming in well of late which points to an increased shipping service to Australia.\n","79":"\n a beautiful day. Just the ordinary routine going. I get up at 7 A.M. stir out the orderlys, see them on their job \n\nget the Hospital slate & fix up for the rations etc then come & get my own breakfast. Then do the rounds with the M.O. check evacuation etc & generally do whatever turns up. Lunch at 12.30. Cup of tea at 4 & dinner at 6. then a look round the Hospital & either write or try & do some French. Bed at 10 oclock which allows me to get up at 7 without difficulty. A lot of leave going through now, men going who were on leave 6 months ago whilst I had to wait full 12 months for mine. C’est la guerre.\n","80":"\n St Patricks Day. The last week much has happened. ","81":" the two nursing Sgts arrived back from leave & I handed the Hospital over to them & then before I could dig into the Dispensary the Colonel got me to take charge of the revetting work round the huts. He was awfully keen on getting it done & gave me about\n\n50 men, batmen being made to work & the Hospital staff was also cut down. One afternoon 4 of the officers slogged in with the lads. If the weather keeps good we will complete in a week what was being done at the rate of being finished in 6 months. Two balloons of Fritz have come over in the last few days, one voluntarily, the other not. The first named was a hot air affair which came over laden with newspapers, The Ardennes Gazette containing matter of a proganda nature. We had some of them in the Camp but orders have come out that all must be handed \nof\n over to G.H.Q. The other balloon was a sausage & had apparently broken loose as it drifted over our lines. Two of our planes set it on fire & it commenced to fall rapidly. The flames soon went out however, quite a lot of it being \n\nleft & this when it reached the ground was soon torn to shreds by the Australians who rushed it for Souvenirs. \n","82":"\n Splendid weather. Had a busy & hard day. This was the day we were celebrating our","83":" anniversary on & great trouble had been taken a week past to make it a success. My particular job was to carry out the decorations & arrange the lighting & stage but I still had to carry on my job outside. I had made a trip into Bailleul & purchased fancy paper, chinese lanterns & hired a number of flags also purchased some mimosa, the counterpart of our wattle but grown in the South of France. All day we worked & it really looked well. The tables were laid out the full length of the mess hut while covers & the cutlery which we borrowed all being new looked splendid. At 6 oclock the dinner started about 250 sitting down, patients doing all the\n\nwaiting. Amongst the visitors was Colonel Manifold D.D.M.S. Col. Downie A.D.M.S. Lt Col Kenneth Smith of the","84":" & various other heads, officers & all sitting down together. The dinner itself was also a success being about 8 courses, the Menus being written in Flemish. After the speeches the curtain went up and our Concert party put on a very good show which finished the evening about 9.45. It was a most successful spread, nothing to mar the proceeding the whole evening. The patients did very well as there was a lot of stuff left over which was handed over to them to deal with. I was dead tired when I turned in.\n","85":"\n Raining all day so I had a holiday, a very welcome one. Helped to clean up the debris of the night before & did some reading. Fritz now sends shells over fairly regularly but so far has confined his attentions to places \n\noutside the village, some go right over to Bailleul. Did up several papers etc to post home.\n","86":"\n A little rain again, did nothing myself but the new orderly officer put a few men to work on the revetting so apparently he is going to run it himself in the future especially now that there are three General Duty Sgts available. Did a little reading & writing & sent some papers home. Fritz shelling all round us & we have had several casualties in. The line is much more active now and our planes appear to have the air well in hand. We have been warned that Fritz is sending over large gas shells up to 9 inch & the heads apparently expect much from him in that respect. Gas drill now on every day. Fritz was over bombing last night but did not hit the village. The people here (Dranoutre) rather a good class lot & speak perfect English altho’ many cannot speak French. There are many 1914 graves in the place.\n\nCommencement of Great hun offensive\n","87":"\n Fine weather again, Fritz still sending over heavy stuff at regular intervals & we had several cases in during the night. Did not go on parade as I had an idea that the new Orderly Officer wanted to run the revetting job himself. However the Colonel when he learnt this, sent a message that I was to carry on so they held the parade up, until I was sent for, when I carried on as before. Had a stroll in the evening & then a bath with a clean change of new underclothing also a new pair of pyjamas, a real luxury.\n","88":"\n Beautiful weather. Had a rather trying day. Fritz, instead of shelling the same area as before switched on to us. Early in the morning we had several cases in from close by but it was not till shortly after 2 oclock that he caught any of the am lot. I had just sent a party of four men with three limbers down the \n\nroad to get soil when a shell came over killed one man named & one horse & slightly wounded 3 others. Well we buried the horse, when a couple more came across but not actually in the camp then just on 4 oclock one landed right in the Camp, wounding abut 5 men & making a mess of a few of the huts. By this time things were getting warm & the Colonel ordered everyone into some big trenches. Then just as tea was on & plans were being formed to restart revetting after tea two more came over so once more the Hospital was emptied out. Plans were then made to shift everyone for the night & the unit were billeted in the Dispensary & other houses which were in the village itself. The decision to leave the Camp for the night was much strengthened by two more which came over about 9 oclock one man being hit near the Q.M. Store. Altogether t’is a very trying time as there is really nothing\n\nto do bar sit down & wait for them. Being large calibre high velocity shells they burst with a tremendous crash without the slightest warning screech whatever, practically no hole being made in the ground, shewing that they burst on the slightest contact. C Section went away today & I guess are congratulating themselves on the fact. Practically all the back areas are being shelled, Bailleul getting a bad time & from all sides reports are coming in of a like nature & then to cap all we read in todays paper, an article by a correspondent Percival, in which he says – fruitless shelling of back areas, our men tickled & amused at the Huns wild shelling & so on. A greater insult to the Soldiers could not be imagined as this kind of shelling is one of the most trying & causes numerous casualties besides disorganising things, quite a number of units having shifted their quarters. In one camp about half a mile away over 50 horses have been hit & yet this waster says that we are amused.\n","89":"\n A very strenuous day. Some 90 odd patients were evacuated last night by means of lorrys & fortunately without casualties. This left about 40 who had cleared off in all directions to take cover from the shellings & they turned up this morning. Then we had about 30 cases (various, gas etc) to be evacuated also & what with fixing up their particulars & those of the men who were sent off last night we were going hard all day. I was looking after the evacuating. The enemy sent very few more shells over but we cleared up the old camp, our quarters now being in the School in the Village itself. Civilians are moving back & we are under orders to supply cars to evacuate aged civilians from Bailleul which is being heavily shelled. Most of the C.C.S.’s are full today so the shelling must be very general & we have reports of places being shelled 20 odd miles back. Tonight \n\norders have come through that all leave has been stopped to England & Paris & we have sent out orders recalling some of our officers & men from Schools. There is certainly something in the Air.\n","90":"\n Fine weather still. Had a busy day with Sick getting them away in cars etc. Our old camp shelled again, the salvage workers having a narrow escape. Started making an inventory of Dispensary as we expect a sudden move. At night had a mild hop over with music finishing up at 12 midnight. Our piano I noticed has some shell splinters embedded in it from our late experience.\n","91":"\n Definite news though of the Hun offensive & altho’ the news is serious still everyone is confident. Germans claim 25000 prisoners & 400 guns which is probably correct & we have been pushed back about 15 miles. Our \n\norders are through & we are about to take our place in the line against the enemy. All day has been a rush not improved by the fact that we had a lot of casualties in from Battalions who were marching out. A shell landed amongst the 59th, & the 60th altho they waited ¾ of an hour also received a shell almost in the same place, almost uncanny as there was apparently no direct observation on the spot. One of the men hit had just returned from England, he had gone on leave & had reached Victoria Station only to be returned immediately to France owing to all leave being cancelled. Definite orders came about 7 P.M. that we had to shift all stores which included the Dispensary so I had to set to & start packing up. However I will have part of tomorrow to complete it in as altho the main body move out at 10 A.M. a party will be left behind to square things up. This sector will have so few men to hold it that at present there is no ambulance to take over\n\nfrom us. We stop the night at Reninghelst & then entrain – for what. Time will tell as this is to be the most momentous period in the Great War.\n","92":"\n Up at 7. A.M. ready for a good days work. The main body left at 10 A.M. leaving about 10 men to clean up help to pack & shift the gear. My part was completed before midday when I set to & helped the S.M. to complete his section. Going back to the camp was most depressing, silent & deserted, the huts splinted & torn & clothing & gear of all kind in abundance. The village itself was deserted practically no troops to be seen & this was typical of the whole district, all seem to be on the way to the great conflict. About 4 oclock all was square & I picked up the crowd by car at Van Sohiers Farm near Poperinghe where we had been once before. It was now cold & after tea started skylarking to get warm finishing up with a game of hockey fiercely contested. All are in good \n\nspirits notwithstanding the fact that all sorts of rumours are rife saying that we have lost 600 guns & 60000 prisoners.\n\n0\n\n ","93":"\n News today rather more reassuring the number of prisoners being 45,000. A statement given to us today said that matters were improving & that the situation would shortly be well in hand. The weather today very cold. Had a parade at 2 P.M. full marching order for a rehearsal the final orders being that we march out at midnight to entrain, our destination being not far from Doullens. It will be a cold move. Had two games of hockey today & won both but feel rather tired altho’ on the whole most of us are full of energy & good spirits. Last night we had a couple of hours skylarking altho’ only 3 of us were active members. My blankets were rolled up into a tight roll & we used it for bombarding purposes everyone\n\nbeing knocked rotten in turn. A move generally has the affect of bucking us up considerably. Very few soldiers in the area & things look very deserted.\n","94":"\n \nSpent the morning overhauling my pack etc. At 2 oclock we\n Had a doze for about an hour after tea last night then had a few biscuits for supper preparatory to falling in at midnight. We then marched out to siding near Poperinghe about 3 miles where we boarded the train. The train was composed of trucks, the (30 hommes or chevans. 8 (en long)) variety but they were good enough & I spread my blanket & slept the remainder of the night. We reached St Pol about 7 A.M. a fairly large place & saw where the preceeding train with the 58th Battalion aboard had been shelled. Part of the train was wrecked with about 15 killed. Made a breakfast of biscuits with a cup of tea from the Y.M.C.A. Passed through Doullens \n\n& reached our Siding 5 miles the other side about 2.30. A cold biting wind made things most uncomfortable. Waited whilst the cooks prepared a meal of Maconochies then leaving our packs to be brought on later set off on an 8 mile march to Louvencourt. It started to rain at the same time & we were well soaked on our arrival. Passed heaving traffic on the way, large numbers of troops being in the neighbourhood, many of whom appeared to be in the Fields. Thousands of men are employed digging new trenches & wiring them in case we are forced to fall further back. Turned in after having tea our billet being a good one, one time the town Hall.\n","95":"\n Good Friday\n I suppose it is so I won’t argue. Sick began to pour in & we had a lot to evacuate. Managed to get a special room for a dispensary etc but owing to expecting a sudden order to move hardly knew what to do. However\n\nby midday the battalions had sent in their requisitions for drugs dressings etc so I took a car & went off to Beauval about 15 miles away to get them. There I found the Depot which had been in Albert but left hurridly on Monday. They had no drugs to issue, all having been sent to the base, only dressings were being handled, until matters became normal. Learnt that the huns had captured two of our Depots & about 3 C.C.S.’s so we must have lost heavily in stores of all kinds. A lot of traffic on the roads & many guns coming forward. Had a few large shells fall within a radius of 100 yds of our billet during the early part of the night but no damage was done.\n","96":"\n Still at Louvencourt & awaiting our orders. The place is full of troops but news is very scarce, we know practically nothing of what is going on & certainly don’t worry much such is our \n\nfaith in things. We know that there are plenty of troops in the neighbourhood, guns are going forward, the general routine is going on as before so all is well. Had a fairly busy day with sick but we did not evacuate as many as before owing to the number going sick. Had one Tommy in, a relic of the retreat. He was nearly handed over to a guard as a deserter but I managed to get him off & after warning him what would happen if he was caught again, sent him off the report to the first English unit he could find. He had been loose for 5 days having bolted when the hun was attacking albert. Wrote a few short letters during the evening. Paper reports give German official as 40,000 prisoners & 600 guns with an advance on a 50 mile front, in a deepest part to a distance of 37 ½ miles, yet we are still undaunted.\n","97":"\n Had a busy day with sick, & issuing dressings to Battalions. Had a welcome sight of 200 Huns marched through the village, they had been captured\n\nby the New Zealanders who are doing good work. Met Lance Todd, he being a Captain in the New Zealand A.S.C. I happened to ask a patient if he knew him & then sent my name up & he came down to see me. Later in the day I went up to his camp & had a royal time. About six other officers were present & Lance in his old way telling stories etc kept the crowd laughing. Wrote several letters during the evening. Hun planes over during the night also day, one being very low but apparently got away safely. Heard some particulars of our retreat which tends to prove that some of the Tommies put up a very poor show whilst others fought splendidly. Unfortunately we arrived at a time when they were some demoralised & our chaps have judged them accordingly.\n","98":"\n Usual routine of sick parades. Several Hun planes over during the day. In the afternoon had a game of Hockey & my team was once more victorious. Paper news today gives the German official as 70,000 prisoners & 1100 guns, some knock but we have repulsed him severely near Arras.\n\nWent to a Communion Service today & no wine being available the service was carried on without my first experience of such a service.\n","99":"\n Very quiet, weather good. Usual sick through during the day. More hockey during the afternoon, my team winning 13 to nil. New Zealanders are running the local train (narrow guage) as an Ambulance train, quite a decent stunt. Bread very scarce, we being on biscuits the last 2 days.\n","100":"\n Usual routine, showery weather. A very large number of soldiers in the village & thousands passing through daily some with splendid bands & troops looking well. Two games of hockey today & won both my team being unbeaten so far. Feeling very fit from the exercise. Heard today, official on Tuesday, that General Gough of 5th Army had been relieved of his command, we had this rumour a week ago, one of the rare occasions a rumour came true. Certainly the 5th army did not do well at all & its good to think that it was from faulty leadership rather than the squibbing of the men.\n\nJust sent for 2 more of these Diarys the cost being 3\/3 each, being practically double what I paid for the first I bought in Sydney before the war. Orders out that soldiers asking for rations to be handed over to a guard as their are still a large number roaming about the country, relics of the retreat. A body of 30 marched into the village yesterday & tried to get rations.\n","101":"\n Rainy weather. Made up a requisituion for dressings etc & went along to Beauval to get them in the afternoon spending about an hour in Doullens on the way. Passed large gangs of Chinese & labour battalions digging trenches & wiring them in readiness for Fritz should he advance. Had word that we were about to move on my return so walked to \"Acheux\" the next village to see what the 54th Bn wanted. Brought back one of their A.M.C. Staff & gave him dressings etc. Then supplied the 56th 55th Bris & 28th A.S.C. & then had to turn to & pack up my own stuff as well as evacuate several sick to Hospital. Turned in about 11 P.M. all my things being ready\n\nto load on wagons. Reveille 4 A.M. move off 4.45 being the orders for next day. News through that the enemy was massing again for the attack.\n","102":"\n Up at 4 A.M., breakfast of a kind & then I had to get my stuff on the wagons as best I could. Raining & miserable. The crowd moved off without me but I caught them up before they reached the embussing point which was about two miles away. We are supposed to embuss at 5.30 but had to wait until 8.30 standing in the rain, until the busses & lorries were ready. We then set off, the whole brigade in one column of close on 200 busses about 9 A.M. reaching our destination a few miles from Corbie about 1 oclock passing through Seaviller, Puchevilles, Rebenfre Rainecourt etc. & Amiens. Amiens much deserted & signs everywhere of the civilians moving back. Had a snack of bully & dry bread when in the lorry. After disembussing had a wait of about an hour before we moved off to our destination. Arriving at Daours we found our Cooks who had tea ready. 15 minutes later we set off again & marched to Aubigny where we\n\nput in the night. \"Daours\" was rather a sad sight. The people had fled & abandoned all their belongings, the houses stood just as they were, furniture, pots & pans, pictures on the walls & books on the shelves. Most of the livestock such as fowls had already been used by the soldiers but our fellows procured a few also some rabbbits. A few guns were banging away & some of the roads were mined as the hun was only some 4 miles away. \"Aubigny\" was a smaller place but equally deserted & it had already been well looted by the various soldiers who had passed through, all livestock had disappeared with the exception of pigeons & there were quite 200 of these flying about wildly as each gun fired. Clothes, books etc were strewn all over the place & hay & wheat was lying about the lofts being trampled on by all & sundry. A small cottage allotted for our mess when cleaned up was first rate & we had dinkum crockery for a change. After tea set to & fixed up a dressing room as the line was only 3 miles distant. Had 4 sick in from \n\nthe battalion & fixed them up for the night but had to get two stables scrubbed out to make them presentable. Turned in about 10 oclock after issuing some dressings to the 53rd.\n","103":"\n Called up at 4 A.M. breakfast 4.30. C. section to move out at 5.30. A & B Sections to stand by to move out at 7.30. Packed up everything & had fallen in when orders came to stand by again. Managed to find extra rations so had another breakfast. More sick arriving had to unpack again in order to attend to them. Great aerial activity, large numbers of our planes being about, one of ours being driven down & a Fritz being brought down in flames in our vicinity. C. Section sent down for urgent supplies so went along in Car after dinner to see what they required. Rather an interesting trip as I passed through the support lines & posts which had their complement of men mostly occupied in cleaning themselves up & basking in the sun as it had been wet. Straw from neighbouring stacks was availed of to make them comfortable. Several dead horses lying about\n\nmostly gassed I think as their were many more sick. The guns were firing with their teams fully harnessed standing to ready to more at any moment. Fixed C. Section up with dressings, from my stock now getting very low. Packed up again before dark as I guessed we would be moving in the morning.\n","104":"\n Orders out to move back to \"Daours\" & take over from the 15th Field Amb. Went down in Car with my gear at 9 A.M. & took over the Dressing station which they had established there in the school. Spent most of the day arranging this place to deal with sick & wounded my section running the place. Made up a requisition for drugs & dressings which the collected for me from \"Namps\". Went round the village with the Major to choose another place to fall back on should our dressing station be shelled as we expect to be at anytime. It was a sad sight, most of the places had been vacated by the owners without notice & the soldiers had systematically looted everything. Not a nook or corner had been missed & clothing etc was strewn\n\nin all directions. It was a shameful sight as some civilians still remain & dare not leave the house a moment lest it be ramsacked. One woman of a good house went to have lunch at another house returning an hour later to find the place broken up & everything looted, beds upset & clothing taken, locks broken off & her entire stock of 11 fowls taken besides the Mother of a few days old rabbits and yet the penalty for looting is supposed to be death. I blame the Authorities for not picketing the town but perhaps they think it better to pay what damage is claimed rather than spare a few men for the job. It is certainly making ill feeling between the French & ourselves which added to the ill feeling between a section of the Australians & Tommys makes things very topsy turvy. An English officer told me that our fellows when taking over called the Tommys all the insulting names they could imagine accusing them of funking & shewing the white feather. Such conduct is disgraceful & yet many of our officers encourage it.\n","105":"\n Matters fairly quite; a few wounded & sick coming through also Trench feet brought about by the recent wet weather. During the afternoon went over all my & put them in apple pie order by getting some extra things. Matters running very smoothly altho’ this is the first time in the history of the Amb. that A Section has been able to run a dressing station with its own equipment & personnel. This is due to the fact that I control the nursing as well as the Dispensary duties & have been working for some time past improving the equipment & personnel of the Section. It means hard work but I don’t mind that. Turned in about 10.30 after reading the local paper sent by Syd where I was pleased to see his name figure so prominently.\n","106":"\n Patients started coming in early & by early afternoon we had passed through 80, wounded trenchfeet & sick, just like the old Somme conditions. We used motor lorries to evacuate them to Amiens. We passed through one Australian\n\nwho had a self inflicted wound, his finger. Too busy for lunch so had some of what we were giving the patients. A man had to be bad before he is evacuated. V.D.s being kept in the line & scabies & skin diseases as well. We returned several to the line & even some of those we evacuated were turned back at Amiens. Camps are situated at different points with guards to stop stragglers & return them to their Units. The dentists have had to send all their gear back to the base & we have stored all our surplus equipment so that we are very mobile. Our Colonel is a very mixed personality. Efficient in many ways, he is yet domineering and treats the other officers harshly. Our Major has not a free hand, being restricted & hedged in by the Colonel & all the officers have in turn been \"told off\" in turn by him, not quite the thing in times such as these. B & C Sections are doing nothing but standing by awaiting anything which may turn up, the Sgts in particular being rather astonished that their aid has not been for the dressing room.\n","107":"\n Rather a quite day but it was made up for by large sick parades from the 4th Division which took up most of the morning. Again sent back several men who were not quite bad enough to be evacuated. After tea had a game of hockey which my team won as usual. A stunt expected tonight so will sleep on the premises in case of a rush.\n","108":"\n Nothing doing during the night. Big sick parades during the morning. After dinner made out a requisition for drugs etc & went along to Namps to collect them. First went to Amiens about 9 miles for a refugee to collect some gear & then we proceeded on to a place near \"Hornoy\" passing through \"Pissy\" & Fluy. After dropping our passenger we went across country to \"Namps\" where the depot No. 13 had set up shop after having to evacuate from Nam. The stock they lost there is reckoned to be worth over £40,000 as they had stocked up for the stunt. We passed a large number of people leaving Amiens which had been heavily shelled, & making for villages further back. Horses & carts being scarce, many old people had their belongings packed on wheelbarrows & it was a sad sight to see them resting by the wayside. Waggon after wagon was passed\n\nsome containing household gear others shop gear, such as boots etc. There was no dejection apparent all were cheerful. Saw a fair number of French soldiers as we were well on the French section. Several familiar places in Amiens had been hit. The ‘Tavern Moulard’ where I had had many a dinner had received a direct hit & a building opposite the Museum had been harshly treated, the surrounding windows all being smashed. Practically all the shops were closed or had their shutters up & the whole town appeared to be deserted except for soldiers. The various bridges across the Somme were mined ready to be blown up in case of a retreat & some were being strengthened as well to permit of heavy guns etc proceeding by more than one route. Arrived back about 6 oclock after having done a good many miles over new country. 9 Fritzers came over when we were near Amiens & it was a treat to see our guns in action. They were still going strong when we lost sight of them. News of another push through. The enemy has forced us back on an old sector of ours, Sailly, & has crossed the Sys River. Then at Messine he has pushed forward & we hold him at the Fidge Wystchaete where our advanced dressing station used to be. Altogether\n\nthis diary ends at a time when things look very black for us. The enemy certainly has the initiative & apparently can make an impression where he wills. I fancy however that the main effort has still to come & will be towards Amiens. General Foch, now generalissimo certainly has a trying time but I think that we will pull through. American troops are to be brigaded with ours which means that they are immediately available which is certainly something as they have a fair number in France. Lloyd George has warned the nation of the serious position we stand in & proposals have been put forward to call on men between the ages of 17 to 50 & conscription to be applied to Ireland, a very pleasing thing the latter. What opposition will be met remains to be seen. The spirit generally amongst the men is good, all are convinced that we will win but few look for the end this side of years. Our enemy is certainly strong & for my part I cannot see as winning until we have suffered further extraordinary losses. I sometimes wonder will I survive to the end, for my mothers sake, I hope so.\n\n"}}