{"Document Name":{"0":"Diary_0482","1":"Diary_0482","2":"Diary_0482","3":"Diary_0482","4":"Diary_0482","5":"Diary_0482","6":"Diary_0482","7":"Diary_0482","8":"Diary_0482","9":"Diary_0482","10":"Diary_0482","11":"Diary_0482","12":"Diary_0482","13":"Diary_0482","14":"Diary_0482","15":"Diary_0482","16":"Diary_0482","17":"Diary_0482","18":"Diary_0482","19":"Diary_0482","20":"Diary_0482","21":"Diary_0482","22":"Diary_0482","23":"Diary_0482","24":"Diary_0482","25":"Diary_0482","26":"Diary_0482","27":"Diary_0482","28":"Diary_0482","29":"Diary_0482","30":"Diary_0482","31":"Diary_0482","32":"Diary_0482","33":"Diary_0482","34":"Diary_0482","35":"Diary_0482","36":"Diary_0482","37":"Diary_0482","38":"Diary_0482","39":"Diary_0482","40":"Diary_0482","41":"Diary_0482","42":"Diary_0482","43":"Diary_0482","44":"Diary_0482","45":"Diary_0482","46":"Diary_0482","47":"Diary_0482","48":"Diary_0482","49":"Diary_0482","50":"Diary_0482","51":"Diary_0482","52":"Diary_0482","53":"Diary_0482","54":"Diary_0482","55":"Diary_0482","56":"Diary_0482","57":"Diary_0482","58":"Diary_0482","59":"Diary_0482","60":"Diary_0482","61":"Diary_0482","62":"Diary_0482","63":"Diary_0482","64":"Diary_0482","65":"Diary_0482","66":"Diary_0482","67":"Diary_0482","68":"Diary_0482","69":"Diary_0482","70":"Diary_0482","71":"Diary_0482","72":"Diary_0482","73":"Diary_0482","74":"Diary_0482","75":"Diary_0482","76":"Diary_0482","77":"Diary_0482","78":"Diary_0482","79":"Diary_0482","80":"Diary_0482","81":"Diary_0482","82":"Diary_0482","83":"Diary_0482","84":"Diary_0482","85":"Diary_0482","86":"Diary_0482","87":"Diary_0482","88":"Diary_0482","89":"Diary_0482","90":"Diary_0482","91":"Diary_0482","92":"Diary_0482","93":"Diary_0482","94":"Diary_0482","95":"Diary_0482","96":"Diary_0482","97":"Diary_0482","98":"Diary_0482","99":"Diary_0482"},"Date":{"0":"unknown","1":822.0,"2":823.0,"3":824.0,"4":825.0,"5":826.0,"6":827.0,"7":828.0,"8":829.0,"9":830.0,"10":831.0,"11":832.0,"12":833.0,"13":834.0,"14":835.0,"15":837.0,"16":838.0,"17":839.0,"18":840.0,"19":841.0,"20":842.0,"21":843.0,"22":844.0,"23":845.0,"24":846.0,"25":847.0,"26":848.0,"27":849.0,"28":850.0,"29":851.0,"30":852.0,"31":853.0,"32":854.0,"33":855.0,"34":856.0,"35":857.0,"36":858.0,"37":859.0,"38":861.0,"39":862.0,"40":863.0,"41":864.0,"42":865.0,"43":866.0,"44":867.0,"45":868.0,"46":869.0,"47":870.0,"48":871.0,"49":887.0,"50":888.0,"51":889.0,"52":890.0,"53":891.0,"54":892.0,"55":893.0,"56":894.0,"57":895.0,"58":896.0,"59":897.0,"60":898.0,"61":899.0,"62":900.0,"63":901.0,"64":902.0,"65":903.0,"66":904.0,"67":905.0,"68":906.0,"69":907.0,"70":908.0,"71":909.0,"72":910.0,"73":911.0,"74":912.0,"75":913.0,"76":914.0,"77":915.0,"78":916.0,"79":917.0,"80":918.0,"81":919.0,"82":920.0,"83":921.0,"84":922.0,"85":923.0,"86":924.0,"87":925.0,"88":926.0,"89":927.0,"90":928.0,"91":929.0,"92":930.0,"93":931.0,"94":932.0,"95":933.0,"96":934.0,"97":935.0,"98":936.0,"99":937.0},"Entry":{"0":"\n\n","1":"\n\nCarried out in the morning a battalion attack practice carrying it as far as the phase preliminary to the assault. Excellent work very finely carried out by the men who are now trained up to a high standard. Operated over an uninteresting piece of desert between a railway line and the canal. Upon the latter were sailing craft with full mast and in the absence of breeze being hauled on towlines by niggers ashore.\n\nThe Naficha station buildings for the natives are of the usual barrack type neatly built but the Egyptian by his habit of putting manure lumber and fowls upon roofs has detracted rather from the appearance of these places. The afternoon parade was spent checking kits and repacking bags and placing them at head of lines ready for removal. We are now ready to move at an hours notice. We sail tomorrow night or perhaps Sunday morning – our favourite day. We left Melbne on Sunday, landed at Gallipoli and evacuated there on Sunday and our intermediate ships have also come upon Sunday frequently. \n\nAt 1200 I managed to get rid of 8 wasters and transferred them to Details as undesirables much to their indignation. Roth left today for Pioneer Battalion. H. Smith is to be C.O. 6th Bde Training Battalion. Issued orders no man was to have long hair cropped up the sides and not longer than ¼ inch on top – an epidemic of barbering at once set in! My friend Pte \"Jerry\" Bernnau is back again after having been boarded for return to Australia.\n\nHave had my cabin trunk all day and have been diving in among belongings that have been stored away for sometime. We have not had a mess since being here and have been living on the same as the men feeding in our tents. Most uncomfortable as the tent is a dilapidated one and sand keeps coming in. A good many of the railway carriages have a large Red Crescent painted on a white background and also the roofs marked similarly – a Geneva protection against aeroplanes. \n\nAmbergris cigarettes last night gave a Caviene odour to the tent reminiscent of past hours of dalliance and pleasure.\n\nQuiet preparation and bustle. Formerly we’d have been excited, but now regard going to the front as mere nuisance.\n","2":"\n\nA filthy day. The sand blowing in everywhere the dilapidated tent and making eyes red raw blotches in a damp ring of gritting dust. Received word the Battn was to march past and then be inspected by the Prince of Wales, of whom the prevailing opinion seems to be one of compassion in his insignificant stature. \n\nReceived further particulars of our shift and that I was to act for the voyage as Ships Adjutant. Grabbing a few clothes and Plart boarded a passing train for Alexandria and in the seclusion of a lavatory worked a transformation emerging resplendent in full uniform and Sam Browne belt. Changed trains at Benha for Alexandria. \n\nVery pleasant journey through waving plots of cultivation like one large market garden. Whole families at work in the fields surrounded by their live stock. Good roads pleasantly shaded with trees running across country. Bengal lancers patrolling railway Tel el Kebir a forest of tents with very substantive mess and recreation sheds – probably 60000 in camp. Some rain during afternoon, niggers sucking sugarcane. In some places their custom of putting lucerne and other green stuff upon the roofs of their houses makes the places look like an untidy feed heap.\n\nThrough Sidi Gabr reached Alexandria about 1940 and drove round in gharry. Tropical down pour of rain which soaked driver through \"plenty moyn\".\n\nHad great trouble in finding way to quay and at Gabbary docks found all others there but ours – the \"Llandovery Castle\" – \"anchored out in stream\" said a drunken sailor and cordially invited us to his bunk for the night. Most of the sentries rather beery. A cold wind was coming off the sea and constant inquiries seemed to get us no further. After promising oneself the luxury of white sheets, a bath and some soft bed it was hard to be so grievously disappointed.\n\nFor nearly three hours we drove in search of information and purchased some fruit in the native shops. Visited the big embarkation office in the Customs\n\nAlexandria\n","3":"\n\nPulled up at a small brick shed after mightily tired out and intended to settle down to a cheerless bivouac on a paved verandah open to the four winds. Tommy guard inside well oiled. One in return for 10 piastres backsheesh handed over two lousy blankets and we went inside and dossed down on the floor amid grappling irons, oars, ropes and other lumber.\n\nTwo drunken Tommies stretched out alongside asking for \"whuskey\". The 77 berth was just in front and occupied by the \"Ascania```\" – our ship being still out in the stream. \"Haverford\". \"Southland\", \"Mumewshe\" and some others were also in.\n\nA wild wet night with heavy seas dashing over the breakwater. Slept in all clothes fitfully until dawn. Asking a growl now and then to see if our boat had berthed. The blankets lent to us by the soldiers were lousy and full of fleas, – so much for our dreams of white sheets, hot baths and rich meats & drink! At about 0800 the first train arrived with news the others were late so set off for the city with Sergt. Plart for a wash and some breakfast, getting a ride up to Mohammed Aly square in a postal motor. Cut the pace out scattering natives right and left in our course. Then made for the Windsor Hotel and had a good breakfast in comfort. A good English hotel well patronised bt officers, overlooking the grey sea, the sea appears to cut right behind the city, the portion here a about seeming modern and newly built.\n\nFrom there to Rue Cherst Pacha and Rue de Ramlep both fine streets rather narrow but full of good shops – no verandahs of course. Only Moslem shops open being Sunday. Past La Bowise to the square seeing nothing startling outside the always high coloured everyday scenes. Squatting on the footpath an old man had a brazier of charcoal with incense burning. Its fragrance spread all round. The shops packed side by side with robed owners sitting at ease. \n\nThe curious indefinable not unpleasant pigsty smell predominates over all. Through the red light quarters and saw two girls wearing an adaptation of the AIF uniform the hats looking neat soldiers frills.\n\nAlexandria\n\n19\/3\/16\n\nReaching place again found transport sections disembarking from the trains and from then on troops came pouring in having spent nearly 12 hours in the train cramped up in trucks but all merry and plenty ready to suishi up the town for a fly round. \n\nThe \"Axania\" sailed at 1100 and our transport the \"Llandovery Castle\" then took up her place. She is a comparatively new boat about 11500 tons and with 3 decks. She is fairly short in length comparatively. Went aboard with Capt Palmer, the M.R.O. and found her fairly fresh from the African trade and full of . Splendid saloon, lifts and cabins enough for all the officers & sergeants and troop deck for over 2000 men.\n\nSat down to lunch with the purser & M.R.O. having started the Pioneer Battn embarking. The A.M.C. & Sanitary section followed them and the 22nd followed. All went well. Saw Chief Officer Mr Roland and arranged the usual boat and collision stations. Plart Ships ORS so promoted him forthwith to Sergeant Major. This part of the Gabbary quays is far removed from the scene of previous emarkations being about 2 ½ miles further round and beyond the pesrol and other isolated quays. The area is proclaimed a military zone with a view to secrecy but one realizes it is almost impossible it is to keep big movements quiet. \n\nDinner was a long drawn out menu of delicacies served at 1900 to the accompaniment of full uniform. The evening seemed short and there was plenty of noise of rattling winches and shrill cries and chants of the working gangs. Changed my Egyptian money into English 1042½ piastres fetched £10-7-9 in sovereigns, of a dusky native at the gates.\n\nHave the job of Ship’s Adjt well in hand and having organized things asked C.O. to relieve me. His cabin & mine adjoin. We have washing and bath rooms opening off and great comfort, wardrobes, brass bedsteads and electric lights, fans. Our steward Phythian very smart. This is a great ship for accommodation. Started to write diary but too tired to think after heavy day. Turned in about 2130 and slept like a top, the caress of sheets and the luxivec of a matress very agreeable after sand and more sand.\n\nAlexandria\n","4":"\n\nBath at 0630 and tea brought in. Dressed in slacks & took 3 No 9’s. After palatial breakfast went up to office and told off officers to their boats. Winches still busy and usual routine now being carried on with. A few men finished up the town last night but not very many. Detained a while to disembark Corporal Peters who had the misfortune to damage his eye on his bayonet. \n\nAfter the gangway was lowered, two beery looking hard cases blew along evidently much alarmed at the prospect of remaining behind. However grasping a fender rope they shinned up. All men on parade today with their lifebelts and submarine guards at their stations as well as a supplementary crew for the 4.7 gun. \n\nWe sail anytime before noon and are taking probably our last view of Egypt. Fascinating oriental and the home of a remarkable people. I like it so much that the prospect of living there would be rather pleasant. The quaint people and their customs, the wonderful buildings, the desert, the heavy scent, the Eastern dress, the veiled women, the tarboushed men, the mighty religion and the undreamt of vice make up a remarkable mixture. We had a good time in Egypt, he knows our Cairo from A to Z and he knows a lot who can teach us anymore about the wonderful underworld there that exists where the tourist never penetrates. \n\nAll hands are very pleased with the accommodation on board and there are no complaints at all. The quays seem comparatively bare as most of the others have already sailed. A fresh wind blowing & a fresh sea running making a good roll even before clearing the harbour and a few messes will be vacant at lunch.\n\nPalm trees and desert we can see on the outskirts of the town as we move out, glaring in the sun the pilot is dropped clear of the boom stretched across the entrance. This boom is closed at night. We have no convoy, all hands to wear life belts constantly and boat parties are to be called for as wanted. \n\nPuttees are not being worn but all the doctors are in favour of not stripping, entering the water so clothes can keep temperature up. The warmth of woollen bathing dress is instanced in support of this. All very glad to realise the fruition of so many furpheys and that we are at last on our way to France. \n\nShall we call at Malta. This ship has just completed one run to Marseilles with English troops.\n\nHigh Seas\n\n20\/3\/16\n\nThe Egyptian native upon the telephone is as funny as can be. First item to keep wrenching the hand round furiously and having raised Central commence violent gesticulations and wild talk \"Aie! \"die \"Isura\" and the inevitable \"mafish\" are often used. The exchange operators must have a rough time as they have to reply in Arabic, French, English, Greek or Italian as the nationality of the phone user demands.\n\nIn Moascar I saw the only drunken Mohomacedan I’ve seen during my Egyptian tour and he was very drunk. Yesterday all the mens piastres were called in and changed into English money. This withdrawal of the sinews of war strikes them as a very shrewd move on our part to prevent them . Heard some of No 2 platoon talking \"Little Jackie (McCane) comes down looking very pretty and says he be able to get 6d more for our money than the niggers give. Of course we hands it over like lambs, ‘es a shrewd head!\"\n\nFairly heavy sea running so feeling giddy, lay down all afternoon & had some tea & biscuits brought in. Started on ship inspection at 1420 but relinquished it early in proceedings. Not being in the most robust health, turned in at 2000 and read Lane’s \"Manners & Customs of the Modern Egyptians\" which would have been worth its weight in gold when we landed in Egypt first and it is a great pity I did not come across it earlier. A fine record of their manners and daily life.\n\nBunning reported to be initiated into the intricacies of Ships Adjutant. Retired to a cosy brass bedstead, snowy sheets, electric light, fans and every comfort, bathroom opens off these state cabins which R’s also shares. After dark the systematic darkening up of the ship commenced, deadlights were affixed to all portholes and black paper shutters to all the cabins. Some men sleeping on deck but striking of matches and any noise are strictly forbidden on account of \"sousmarins\". These are now said to come in so close as to get too close in for the 4.7 gun to get sufficiently depressed to fire. Lewis gunners day & night at their stations with guns ready. \n\nA lot of the men very sick and lying about helplessly. No wet canteen aboard I am glad to say but beer is procurable and a signed order from an officer. Intend to sit as far back as possible for next day or two. \n\nAt Sea\n","5":"\n\nHot bath, shave and promenade before breakfast. Sea calmer, a warship on the starboard bow and a cargo boat astern., water very blue. This ship bisected into two equal parts to minimise pitching. The two can be seen interlocking rails all joined and moving in and out as she rolls. Inspection at 1000, mess decks not too bad but the bathing accommodation for the men rather inadequate.\n\nRead and wrote most of the day. Arranged for the men to get daily upon payment one bottle of beer apiece. After lunch there was a short arms inspection and an inoculations parade. Got another injection of para thyphoid vaccine.\n\nWe shall not call at any port en route but will pass close to Malta and to Corsica. After dinner went up on the promenade deck. All lights doused and the ship like some big black monster gliding along. The lights of one bright star lighting a shining trail across the water. Great comments about the miserable appearance and physique of the poor little Prince of Wales. The feeling of our big men is one of compassion & pity!\n","6":"\n\nAfter bath promenaded deck with ships surgeon, a decent old chap who saw service in South Africa. He says it was bitterly cold when last trip to Marseilles and a cold wind called the mistral blew so strong as to render use of cranes impossible. A fresh morning and walked a few miles on these fine promenade decks. Remarked what a tremendous amount of information the demimonde gather knowing movements of units & commanders. A good many of them spies.\n\nNothing doing no land in sight, do not resume company command until tomorrow. Remarkable number of customs of Muslims similar to Roman Catholics. The form of salutation on meeting (touching forehead & chest) is curiously like crossing. The viel of the women is like a nun’s and also the robes. The devout carry rosary on which they tell the beads off for so many repetitions of Koranic texts. Copts undesirable bigots. \n\nA lovely smooth day today with a fair sea. Passed a small gunboat or cruiser about 1600. Otherwise nothing to record.\n\nAt Sea\n","7":"\n\nAt breakfast we were about 40 miles South of Malta, a fine sunny morning with a calm blue sea and a cold wind. Paraded on the after well deck and took it easy in the sun after a strenuous half hour of physical exercises. Changed our course on coming in sight of Malta at 1045. \n\nA fair sized island terminating on the Western end in a high bluff. Apparently pretty clear of trees can see a fair sized town inland a little from the coast. On coming closer one sees the countryside is terraced and subdivided by small stone walls which in the distance seem like hedges. It is said that the island is almost solid rock and earth was shipped from other places & deposited in these enclosures. The difference in height of adjoining blocks is sometimes much as 10 feet. \n\nWe passed several forts and lighthouses and a tugboat met us off Valetta where we lay to for about an hour. Valetta appears to be a fair-sized town behind the breakwater could see some meno’war flying French colours and some other ships. There is a gradual rise from the sea and the general run of houses seem like Egyptian. A church tower overtops other buildings. An aqueduct was visible on the skyline and a ruined castle perhaps that of the Knights of Malta. The coast appears to be an easy one and some small yachts looked well with their white sails. The western extremity of the island terminates in a steep bluff which drops sheer into the sea. I should say the highest point on the island would not be more than 400 feet. The most singular thing without doubt is the terraced hillside with its hedge like walls.\n\nReceived a wireless that General Ivanoff had delivered a crushing blow to the Germans. Passed a torpedo destroyer going into Valetta. Left the island behind and are now steering towards Marseilles but zigzagging a lot. During the night we passed some islands and CAPE BON on the north coast of TUNIS. Dinner here is at 1900 which cuts the evening fairly short. \n\nBed 2045\n\nAt Sea\n","8":"\n\nAt 0800 passed an island with fairly high peaks. A big hospital ship on the starboard about 4 miles and a horse boat on the left. Expect to make Marseilles before dark tomorrow night but some doubt owing to devious course we steer. A heavy ground swell running this morning. Two sailing ships on the portside looking beautiful with every stitch of canvas spread in the gentle breeze. About lunch time came abreast of SARDINIA, a rough country, and ran up the coast several large rocks isolated with waves dashing up them and little patches of cultivation. \n\nCORSIA followed, very similar in appearance higher peaks in rear spoke of inland ranges. All over the hillsides vivid white patches which are houses of the square blankwall Eastern type and apparently whitewashed. We have some characters & Skeene Smith & Jock Munro are not the least of them. \"No 11 platurn\" and the unfortunate \"Pukkis\" (Purkis\").\n\nChecked kit again today a thing we never appear to get much forward with. Had a game of drawpoker before lunch & won. Very pleasant in the sun today but the constant ground swell is rather upsetting. In this part of the Mediterranean we are encountering more sailing vessels than we have seen up to date. The two islands are very long and we have been abreast of them all day & after dark played poker before dinner with five others. Colbran (the nuisance) wants a transfer. Shall be glad to get on shore and handle the company, it to hard on board ship.\n\nBed 2215\n\n \n\nMarseilles\n","9":"\n\nWe were tugged into a berth behind the stone breakwater and tied up there. Many other ships were there and some Australian transports. French soldiers in their ungainly baggy uniforms were on duty on the wharves and all the way along we were welcomed by waving hands and hats. The French bayonet is a long fearsome swordlike affair. Gangs of English tommies were at work on the pier and poor looking specimens they were. The M.R.O’s and Medical Govt people were soon aboard. The thing that strikes one most about this delightful city is the steep and ragged background of the Mighty Alps, - it certainly is a place of which a resident could say that he was a citizen of no mean city. \n\nNestling among trees are two camps neither very large. About 1700 two French officers arrived alongside on the quay escorting two ladies. The officers came aboard and the men cheered them to the echo. The elder was a funny fat old chap with a clanging sword and called and paid his respects. A good deal of bustle re disembarkation but thank heaven it’s not to worry me this voyage.\n\nEveryone has enjoyed the trip from Egypt on this fine ship. We disembark tomorrow and go by train right up a place on the seacoast not far from Belgium. Rumour has it that the \"Minneapolis\" which was two hours behind us has been torpedoed. If so we are strangely lucky as the \"Southland\" two hours behind us on the way to Gallipoli was sunk and we were missed.\n\nThe latest furphy is that we are going to take part in a new landing up near Antwerp. The place we are to camp in is only 6 hours from England. Lying quietly tied up in the docks here tonight and we have strong guards on though I don’t think any men will \"imshi\". Today has been a lovely day – the trip up the coast will live in memory.\n\nBed 2115\n\nMarseilles\n","10":"\n\nCharacteristic Australian! Troops hailing us from another transport as we pass \"What mob are yer\"? which recalls a little incident as we came through Suez Canal a year ago. Our chaps on ship hailing Tommies on bank \"Who are you?\" Reply from Tommies \"HAC Honorable Artillery Company London – Who are you\"? Our men \"AUSTRALIANS!\" Tommies in concert \"Then God help the b--- w--- in Cairo!\" By unanimous consent the Pioneer Battn has been dubbed \"the Sigheaders. \n\nThey are disembarking now – a lovely spring morning with a nip in the air. We move off at 1130 and shall spend about 56 hours in the train. Yesterday there was the shock of its kind on the voyage – a surprise muster shortarms inspection which the men treat as a huge joke but is really a necessary degradation. The unfortunate detected wish a discharge as a rule. As a great \"ahoy\" from his comrades, and any wowser individual who falls by the way gets especial attention. Church parade at 0900 and the men then got busy packing kits, - told them all mess tins and rations were to be stowed in the pack – impossible of course but they will all try to get them in. \n\nOur moves appear to always embrace Sunday. We left Australia, Gallipoli, Zel el Kebir, Ismailia & Marseilles on Sundays and landed in Gallipoli, Zel el Kebir also on Sundays. Disembarked at 1130 and moved off at 1330 after sitting down. Marched through the streets with band playing to the station, seeing very little of the city proper as the streets were all small back ones. The people turned out as we passed and when the Marsellaies was struck up they showed their appreciation by hand clapping and \"bravos\". \n\nReaching the train we entrained and from our carriages could see some nice girls who waved to our chaps. They are awfully fascinating women – so neat. Some men playing a kind of bowls, and in a most unconcerned way urinating against a wall in a public street. They are careless of conventions.\n\nSaw some German prisoners at work on station.\n\nRhone Valley\n\n26\/3\/16\n\nVery pleasant country with prosperous smiling people who wave much. Crowds of youngsters. All the fruit trees in the gardens were in bloom – a lovely sight. Very few young men about and nearly every one is in mourning. Passed through some long tunnels through white stone hills – one tunnel took 10 minutes to traverse. A feature of the country for the first 50 miles was a high bluff on one side and on the other pleasant cultivated slopes orchards & vineyard down to the waters of the Mediterranean. On the bluff side the rock often terminated in the queerest old castles which seemed cut right into them (are these the old castles of Provence & days of chivalry?) and there were frequent old cities with walls round them.\n\nThe country is very populous. The people ask everywhere for a \"souvenir\". Fine roads of a white surface stretch everyway and are perfect in their appearance. All sorry that night is upon us and we shall pass such good country in the dark.\n\nWe have a \"haltes\" of 3 hours at Orange and dixies will there be boiled. At Arles a woman news vendor gave me a 5 centime copy of \"La Petit Parisien\" backsheese. At 2330 arrived at Orange & met by a French soldier proceeded to a restaurant for supper. Wine, soup & meat cost 4 francs. The men had tea provided for them in French fashion. It smelt of cognac or cordial.\n\nBedded down on floors and seats of carving . All night we kept going but we slept soundly \n\n.and knew nothing more till daybreak when a bugler sounded reveille. \n\nLyon\n","11":"\n\nDaybreak showed a pleasant countryside full of small farms, the country most densely populated, the farm houses being continuos and gathering every few miles into substantial towns. The trees were elms, poplars & all were just breaking into leaf although we passed many woods that were not even sprouting.\n\nThe Rhone is a fine river and was swollen, running a swift current. Alders and other trees lining the banks. Cultivation divides the hillsides and valleys into small blocks all beautifully neat and trim and trees planted in rows.\n\nLyon is a fine city and some good bridges span the Rhone there. At factories we passed German prisoners were working under the guard of French tommees. Soldiers are on guard at public buildings &c. \n\nAfter the glaring sands of Egypt, this beautiful green land is enchanting. Trim little meadows \"not with daises pied\", but with primroses violets & jonquils spangling the grass. On the orchard boughs black birds were singing. Blossom of all kinds made the orchard gay. \n\nWe now branched off up the Soane and noticed some people wearing a local costume much like the Greeks. Upon the Gare Lyon we saw some sentries wearing the steel helmets. If we had been passing through here a week or so hence the place would have been still more enchanting as the trees would then be covered with their leaves. The poplar is a very popular tree. For miles we seemed to be going through suburbs, the houses some of them very old were close together but each had its garden or small meadow surrounding it. \n\nOnce we passed an enormous cutting which was so large that one had doubts whether it was not natural. The men are not supposed to leave the train except at authorised haltes but every small stop means that a good many get out. The slate colour of the French uniforms is a good concealing colour. Walking the country roads and in the streets all the women appear to be in black.\n\nValley Of Soane\n Marcon\n\n27\/3\/16\n\nJust before coming in the district seems to become more countrified and the houses further apart. Good stretches of wood and cultivated land and green all over. Along the little brooks green short stumpy trees. To the west a range of hills with villages nestling close in to them. The tops quite barren and rocky. \n\nAll the houses very old fashioned along one quiet road a funeral procession was going towards the church. \n\nAt Marcon at 1100 we had lunch, the men being specially provided for. The country between Marcon & Rully is nothing like as heavily populated as the Rhone Valley but consists of fine farms delightfully green & neat with the farm houses nearly out of sight of each other. \n\nGreat attention seems to be paid to forestry, definite areas are set out for planting and for reserves. Definite parts of forest seems to be left and men who are work felling and cutting up the larger trees and thinning out the small ones. Wherever water is willows grow thickly and are kept well pruned down the trunk perhaps 2’ through and a head of long suckers shooting up from there. These I thought were alders at first and are quite a feature in the landscape. The cuttings are tied up in sheaves and used for brooms &c. Such old farm houses and inns. \n\nToday is dull and grey with some rain. Passed a company of French infantry who had their arms piled on a road. They ran over to cheer us on – everyone comes out of houses and waves, the girls throw kisses most demonstrative. \n\nBrooks running between the green paddocks and overhung with shrub. The meadows carpeted with heavy green grass with daises violets primroses & jonquils growing wild. No fences but poplars planted rows mark boundaries. \n\nChagny\n\n27\/3\/16\n\nThe roads and lanes all avenued with bare poplars and elms. We pass small villages with Monsieur Le Curee upon his rounds. At one small station the people very kindly buy our men beer and wine and refuse payment but all ask for souvenirs, badges being most popular. Young soldiers upon the platform all in very neat blue uniforms and wearing the steel hat. Asked one to let me see his which he did. Fairly light these helmets should at least stop the force of a bullet or glance it off. This youth was dix-sept (17) and in the artillery. Another man on guard showed us his rifle which was very old, single loading and took a soft nosed dum-dum, which he said was not used on service.\n\nRead La Vie Paresienne & La Fantasis – pictures would not be permitted in Melbourne. \n\nAll agriculture hereabout and pleasant open fields and vineyards running up to foothills. Paddocks planted out in small bare paplings. Ever since leaving the Rhone Valley upon the western side of the line we have had a range of hills running along parallel about 2 ½ miles distant. At their feet at frequent intervals cluster old villages.\n\nAbout Beaune are very considerable plantations of elms &c and vineyards. Bundles of the stakes are cut in the adjoining woods which are not destroyed but thinned out. Orchards are very frequent and every inch of ground on the levels is cultivated. The hills seem barren and are not much touched. In the fields we see only very old and very young people. The hawthorn is in bloom. Poplars surround the high roofed moss grown dwellings. \n\nThe train travels slowly and is now two hours behind time. We hope it continues to lose ground to enable us to see Paris in daylight. Find it hard to understand the spoken language owing to access but can attemp it.\n\nDijon\n\n27\/3\/16\n\nWe reached Dijon at 1700. It is a fine town built close under the hills which tower up behind. Some of the buildings have the 17th century appearance and are good in architecture. A Jardin Botanique is near the centre of the town. The railway yards are extensive and under guards, fatigues of soldiers were also at work, shifting material. What strikes one is the lot of water lying round either in ponds or brooks – we should consider the place very damp. \n\nAt the station crowds of men & women wished us bon voyage and the girls got a lot of badges from the fellows – they will have to pay for them afterwards. There is no doubt about it the French women are great \n\nbeauties with delightful complexions & charming vivacity.\n\nThe railway locomotives are good and wedge shaped on funnel, boiler & cab to render less opposition to air. The roads are white and excellent, avenued with trees at present bare of leaves. We do not now expect to go through Paris but to make a detour round it.\n\nThe houses are high often 3 storied with attics and sloping roofs. Very big cuttings had to be made when this line was built. Our trip today has been a carnival of green lovely grass and shades. Every thing looks so trim and clean and the people match their surroundings. They certainly have a country that is worth dying for. \n\nAbout 3 miles from Dijon is a high peak upon the summit of which is a statue – religious?\n\n \n\nParis – Lyon et Mediterranean Railway\n\n27\/3\/16\n\nArrived Les Laumes 2030 and had some dinner at the station buffet – omelette jamon et café lait F.3 which was rather hot. Meals today have cost about 10\/6. The men all very pleased with the look of the country. In future to save paying exorbitant prices we will forage around adjoining restaurants for food. We shall have a seven hour run now to Monteren and spend a halte of ¾ hour there. Then to Judicy on the outskirts of Paris. \n\nAfter Egypt it is pleasant to travel among these people, so clean and cheerful and intelligent to talk to. The girls without doubt are tres jolie. At dinner the question arose of where to pay and the waitress indicated the proprietoress. Thomsen as usual rose to the occasion. \"No! No! Pay Madame\" recalling X Cont experiences.\n\n A French soldier at Les Laumes showed me his steel helmet which was querced by a bullet and also a clip of German cartridges. \n\nToday have found the map I got from the restaurant at Orange. Most useful and shall never start on a journey without one if possible. This day has been an education to all of us. It is a lovely land and the quiet peaceful country so trim and neat grips one. \n\nA French pioupiou is on the train. He is an energetic youth who keeps buzzing round and knows no English.\n\nCorbeil\n\n28\/3\/16\n\nSlept like a top through last night’s journey and we ran along the Seine up to Corbeil some very nice houses fronting the river but no chateaux as it probably too close to the railway for large holdings. Reached Juvicy on the outskirts of Paris at 0740 and waited there. We shall make a detour round the outside of the city. At Juvicy are fair sized railway yards. We were then backed on to an outer circle through beautiful wooded land with nice houses and at 0945 passed Versailles.\n\nLadies with jugs of coffee very kindly filled the men’s dixies and exchanged small souvenir flags for buttons &c. Passed a very large palace with a large oblong lake in front and fine grounds. Passed a school of instruction in trigonometry working in a lovely place in some woods. The railway here about takes some very sharp curves. At St CYR at 1000. The forest of Versailles is very extensive but there are few very large trees. Most of them being 10-12 years old and well thinned out.\n\nWe could a glimpse of an old wall or viaduct and in the distance over the woods could see Paris, the Eiffel Tower sticking up very prominently and catching the eye. \n\nOur impression of France up to the present is one of fruit blossom and bare elm and poplar trees. The villages with their tree lined streets and intensly cultivated kitchen gardens resemble Mr & Mrs Marsh very m.uch. \n\nAt 1300 at Eplauches we lunched and in a village shop bargained with some French women for sausages and bread. Argument very animated, drunk café au lait out of long glasses and then got back to train . At each halt they have water and tea ready for the men and sufficient rations were put aboard to keep us fed. At Champagne we saw trenches with wicker revet tinents and plenty of open tanglements good field of fire. Saw a troop of cavalry on a road. This nation must have a great system of forests as the land is heavily wooded & .\n\nChampagne\n","12":"\n\nAbout 5 miles out the country is very open and in large meadows. All the people run out as we pass and everyone waves jovially and smiles. The girls throw kisses. Our destination is a place near Le Havre which we hope to reach at 2100 tonight. Conversation with a citizen he said the war should end about September to avoid another winter and asked what the Germans thought said they do not count.\n\nFrom here up to Clarmont & Precy we passed through very cultivated country heavily wooded, the farmers working in their fields ploughing and harrowing. In places the woods are very dense and if they had been out in leaf we should not have seen anything like as much as we can through \"bare poles\". Passed one creeper clad chateau with drives and lakes.\n\nThe country from now on became more open until reaching Longerau where we had a halte. An icy wind blowing and scattered showers. The station at Longerau was deserted save for military, the buffet news stall is closed. Several troop trains of dirty trench soldiers passed and our men fraternized though unable to converse. \n\nPlenty of water lying about here and of course any number of the clipped willows, with their thick trunks and small bushy tops. The metal helmet is light and very durable and smart withal.\n\nBiscuits bought locally are long and very sweet and tasty. \n\nThe rule about no men leaving the train until the three \"Gs\" sounding is not well observed by the men and causes trouble. I have one under open arrest and shall deal with him – warned the Sergt Major that NCO’s were no exception to my orders and that the consequences of any breach would be severe if coming under my notice.\n\nAmiens\n\n28\/3\/16\n\nAmiens is a large town with big railway yards. We notice canals and more soldiers. The men cheering great deal. Noticed in the town quite a quarter devoted to sage femme. From here on the country became far more open with very few people about and very flat and low lying. We saw a Dutch looking windmill. A few English tommies about.\n\nFrom now on our journey with lights out. The whole aspect of the country is altered here we have big open spaces and a deserted land upon which a blight seems to be. There is no one about and creeping alone at snails pace through the dark in pitch dark silent carriages reminders of our trip to Gallipoli beach in the dark . \n\nAfter a very tiresome slow journey in the dark we pulled up at a siding. All the railway lights were shaded overhead and gas lights used. It was bitterly cold and into the darkness outside we could see the white flakes of snow falling. Slept fully dressed fitfully until midnight.\n","13":"\n\nRoused by Adjutant and turned out in freezing wind and sleet. Detrained and waited for guides in the railway yards at Aire. Brigade Major left orders. Intense cold felt very much by the men who wore full kit. We were kept standing there waiting and one wag suggested it was to permit us to become acclimatized. Marched through sleeping town along country roads and lanes to Linge Roquetoire,a village upon which we were to billet. Halted in the village streets and dawn broke extremely early in being quite light at 0430.\n\nEarly dawn perhaps accounted for by the extremely flat country. Moved out with \"D\" Co and proceeded to billet. Marched along in fours and at each house with guide and interpreter dropped so many men. A long business especially as the billets for \"D\" Co were mostly small, - \"I was lucky\".\n\nLigne Roquetoire\n\n29\/3\/16\n\nThe houses of the inhabitants were mostly small and the men were accommodated in barns and lofts. Only the officers occupied dwellings. Managed to pack the whole company into 8 houses, some lofts taking a platoon each. Skene Smith struck a good place in a clean farm house with a pretty girl. Fixed my head quarters at a farm occupied by Lombard and his family – very clean people and an old bedroom with wooden bed.,\n\nThe back of these farm houses takes the form of a courtyard in which are the stables one side, the storeroom the other and the peoples entrance the other. In the centre is a large dung heap which is the central thing in each farmyard. Found I could make the people understand my bad French fairly well. The old man and his wife and married daughter live on the place with the daughters two boys who are at school and a farm hand (Augustine) and a serving wench.\n\nThe husband and the old mans son are both soldiers, the latter being a prisoner in Germany. Very hospitably they offered Flemings & myself cale and cognac and lit a fire for us in the parlour in which were the family portraits and a stuffed fox and a pheasant. The inevitable few Catholic pictures were of course on the walls. \n\nAt odd places along the road we noticed small shrines perhaps in a hedge or nailed to a tree in which were a few images. Stuck in the hedge all round or upon the ground were many little wooden crosses evidently placed there by devotees.\n\nOutside the village church was a large stone crucifix and graves alround the old church. Passed Monsieur Le Curie wearing a square biretta. \n\nThe quite lanes hedged with green budding hawthorn and the orderly lines of elm trees round the old red roofed cottages make one think of village pictures. My team of officers at present is Elnings second in command. Hogarth No 9 platoon Skene Smith No 11, Bazelle (Military Cross) No 10 and Mackay late Brigade Orderly office and Captain of the Melbourne Grammar School.\n\nLigne-Roquetoire\n\n29\/3\/16\n\nRumored we are to take over the section from Armentieres to Neuve Chappele, meantime doing routine marches and close order drill. In the village the youngsters we playing eggcap and two girls with delightful complexions are in a small epicurie near the Regtl HQ. Some few flakes of snow fell just after lunch. The little Madame of the farm house after lunch tidied herself and the house up making it look a new pin and herself look very neat with her lovely healthy clean colour.\n\nAfter the filth of the Sigheadders the nattiness and neatness of the French is delightful. It does seem strange though having the dungheap right in front of the door (it is the same everywhere) and all the drainage of the farmyard running into the small stagnant pool in the corner and smelling. The farmer seems to have a very small place not more than about 30 acres.\n\nA friend came in to visit the lady of the house about teatime and although they do not know a word of English we managed to carry on quite an animated conversation. The little womans husband is away fighting and she has two boys. Asked her if she had any girls and she replied \"girl’s la guerre!\". Such a quiet peaceful place this seems looked at from the distance of a kilometre off.\n\nThe Germans advanced to further \"sept kilometres\" from here at the first. A fair number of the men are drunk tonight on wine old Calhoun & Lucas the cook being bad. \n\nThe family circle is pleasant to see after being away so long from one, the ‘petit garcons’ doing their home work and the women folf reading and chatting. \n\nThe latrines of the billets are dug on the French system, just in rear of the stalls – the niceties of convention do not appear to be much regarded.\n\nBed 2000.\n\n Ligne-Roquetoire \n\n30\/3\/16\n\nSlept for a while in the old wooden bed with eiderdown quiet being very tired after train journey. The whole family after retiring to the attics last night recited prayers at top speed for about 10 minutes. Bugler Macdonald blew a stentorian reveille that echoed down these leafy lanes.\n\nNo transport available yet so 30 men have to stay off parade daily as fatigue to C.Q.M. 3 miles have got the cooks working for their own platoons separately. Some loss of numbers will be inevitable owing to sick parade being at 1000. The M.O. will be a busy man daily inspecting all billets. \n\nA lovely day today with birds singing in the tress. The people give great attention to their hedges and spend a lot of work thinning them out and trimming the branches. In a few weeks the leaves will be out and this will be a lovely district. Though not considered a pleasant portion of the country in comParison with that of Southern France, we find it very charming. The little town a kilometre away with its church predominating with its brick tower and clock which very persistently points to ½ past 2 as has done so ever since our arrival.\n\nAt 1000 the Battalion fell in at Roquefort and with the band route marched for about 6 miles through farming country all the way we could now hear the guns firing at La Bassee. The country folk in each house turned out as we passed, it is refreshing to see them perhaps half a dozen women folk the girls beautifully clean and with lovely rosy complexions all honest looking and good. By the roadside in one place with a fence around it we passed a cross with a lifesize figure of stone upon it and returned across the fields to LIGNE at the place of our billets.\n\nMost unconvential people these, my housewife last night indicated an armful of white linen which she wanted me to take. I said it did not matter thinking it was a tablecloth. They were sheets so soon accepted. Hogarth said a damsel of 18 showed him to his room turned down the sheets and their from beneath the bed produced the jardiniere which she presented to him with most smiling innocence.\n\nIn the afternoon route marched as a company over to THOURBONNE, a pleasant little village. Over the shop doors are peculiar little signs i.e. \"To the Joyous Heart – J.B. – Cordonnie\". \"God has blest this house\". \"God bless travellers\" &c. Returned early and had a foot inspection, a few cases of blisters due to the hard roads but not many. Dealt with an orderly room case after parade.\n\nToday a dull chilly day. The sound of artillery fairly constant and three aeroplanes up, - one looked like a Faube. The ploughs used here are single share mounted on a sort of light carriage and the harrows are wooden ones. Holdings being so small it evidentally does not pay the farmer to go in for elaborate plant. \n\nThe men all \"stony\" but the pay should be along today. The school children home today \"because it is jeudi says the good wife\". Paid the men men after tea.\n\nLigne\n\n31\/3\/16\n\nEarly parade physical drill in meadows ajoining the billets, rather foggy and rain and heavy dew drops running of the bare branches of trees and hedges. The ground running with moisture and little rills tinkling along crossing the roads and winding in among the farmhouses. Ploughmen driving their horses to work, - dress much favoured – peak cap and corduroy clothes with small gaiters. Our barmen preparing good meals buying the provisions from the people of the house and also using the army ration which is good.\n\nMadam went to market at Aire putting on a small hat and driving in, in a small cart looking very nice. In the leafy lanes we carried on with rifle exercises and close order drill until lunch. Rather difficult owing to cultivation to find sufficient ground to manoeuvre. Found a good grassy paddock all dry with daises and primroses to say nothing of buttercups & violets but the approach is bad owing to a small brook. \n\nAfter lunch received orders to rendezvous at 1300 at Roquefort for inspection by Lord Kitchener. Dress full marching order. Fell in hurriedly & set off. Breathless orderly arrived \"no packs to be worn\". Dropped packs and set off again. Got as far as half way and a cyclist arrived \"greatcoats will be worn – equipment outside\". Trudged back a mile and got coats. Set off again and on reaching destination was told to put officers equipment under greatcoat! An instance of contradiction orders.\n\nSet off and marched to Aire, a fair sized prosperous town and after much manoeuvring lined a street – 21st on one side and ourselves upon the other. Stood at the slope for a long time and the men felt the fatigue – one took a fit and another fainted. I had charge of about 450 men and they gave a good present in the general salute. Was disappointed in Lo\/K. His face was bloated and the opens of his nose and cheeks stand out terribly as upon the face of a heavy drinker. His eyes are bleary. He is a fine big man and his service tunic was ablaze with war ribbons. General Monro accompanied him – and a man with a limp. \n\nWe marched past afterwards in fours and to my disgust, missed the salute being past the point without knowing about 5 paces. Fortunately Mackay used his head and gave the order & whipped round & saluted but too late to catch his eye. Cursed myself for being caught napping. The 5th Bge looked small without greatcoats. The 23rd & 24th are in quarantine owing to Ayphus. \n\nTomorrow I go to the trenches on transport work and the Battalion goes in on the","14":" Pretty open country passed on the line of march & the clean good looking people are much respected by our men. Reached home about 1700, tea and paid out some more pay. We are luckier than some in our billets, some are with poor refugees. Sign on shop \"J.C. Debitant A la reunion de Crasserves\".\n\nBed early.\n\nEriquinghem\n","15":"\n\nWe left Roquefort at 0900 meeting the Brigade Staff and started off seated upon two motor buses. We picked up the Divisional Staff and Generals Holmes and Watson. It was a delightful morning and very pleasant riding upon the top od the bus, the country was much the same as we had known already but as we progressed towards the firing line it became very much more marshy and flat and uninteresting comparatively speaking. We passed through the Forest de Steenbecque and also through a long avenue of elm trees. \n\nSuch churches as we passed had there churchyards closely packed with crosses &c. They evidently bury the dead one upon the top of the other. Nearly every tomb has its headstone shaped as a crucifix and we passed many images, one was very lifelike the cross being sculptured to resemble an elm tree and the figure upon it lifesize. Glass cases containing wreaths are common in the churchyards.\n\nJust past Melville we struck a military burial ground full of graves and wooden crosses and here abouts we saw trenches and entanglements, all quite rudimentary compared with our Dardanelle ones. Revetted with brushwood they were very shallow & full of water. The appearance of the whole place hereabouts is that of where a heavy bog has been – all saturated and muddy. \n\nPlenty of motor transport plugging along. An aeroplane did a very fine landing in a field close by and we saw 6 high up following one another. Further on we saw a ‘plane being bombarded surrounded by fleecy bursting German shells which seemed very thick round it. Intermittent reports of guns all the time. Right up to the firing line the commonfolk carry on their daily avocation and most of them are undesirable and distrusted very much by our people as treacherous. In the event of a retreat the fate of these folk must be hideous.\n\n Eriquinghem \n","16":"\n\nLa Gorgue Estaires and Sailly are all fine towns and one notices the splendid sign posts which are erected at every business. The information they give is wonderful and of great assistance to the traveller. Pulled up at at the","17":" Divisional headquarters and there met English officers. My job being to inquire into the method of getting supplies up to the trenches. I was met by a representative of the 101st Brigade, an officer of the Tyneside Section. He showed me a cigarette case a bullet had hit the night before going through his tunic pocket sideways. We rode about three miles out and transferred to another officer went to the camp of the transport sections about two miles behind the firing line. Here I met officers of the 15th & 16th Royal Scots and the 11th Suffolk and 10th Lincolns – very nice fellows.\n\nHad lunch with them and inspected their transport park & animals and discussed their system of supply. They say this is a fairly portion of the line and the Germans do not worry much as long as we keep fairly quiet. Some shells land round the rear but all the houses and land are intact. I went later in the afternoon into Eriquingmem and went into a billet. A very comfortable upstairs bedroom, with snowy bed and good furniture overlooking a street.\n\nI am writing this here two miles behind the firing line and would not know there was a war on. The corner house has been blown in a bit by a shell but otherwise life goes on as usual. The children are playing in the streets and people doing their daily work. The sound of an occasional gun is heard but no musketry perhaps after nightfall that will be heard.\n\n Eriquinghem \n\n1\/4\/16\n\nThe river Lys runs through the town and when in flood inundates the surrounding country. It has been straightened out into a canal. After dark with Lieut Anderson the 101st Bde transport officer I am going up to the trenches and round the dumps. At night things are said to liven up with flares &c. They speak feelingly of the rough time during the winter here and I can quite understand it. Judging by the look of the ground. The roofing of the houses here is mostly red Marseilles tiles and often inlet in glazed tiles they have a cross or date 1837.\n\nFor more attic accommodation and snow fall the roofs are often shaped bludging slightly at the bottom. Most of the decent people have cleared out and those left are pretty tough. At the billet of the transport a number of children are those of the unmarried daughters by British soldiers and there are few virgins in this part of France. However the behaviour of the troops is excellent and our men at LIGNE are excellently well conducted and the change among healthy clean decent women and clean homes has done them good. \n\nWe carry gas helmets everywhere here and placards in the streets inform the inhabitants of protective measures. In the shops the chief sign appears to be \"Beer\". The Royal Scots wear Tam o Shanters and seem a good smart body of chaps taking them all round. In my billet here are crucifix & sacred pictures and framed certificates of first communion and membership of some society of the church. An old oil painting is also upon the wall. The bed is a wooden one, wash basin & ewer rest upon a small table and a small cabinet and a desk complete the furniture.\n\n Eriquinghem \n\n1\/4\/16\n\nHorses arrived at 1915 and we set off for the trenches carrying the rations for the 15th Royal Scots. Just after we left the village and came upon open country a fairly heavy shelling started and continued for 15 minutes. Flares were going up at intervals all along the line and I am told this continues all night. It is very different in that respect to Gallipoli and the enemy so arrange that the whole line is thus lit up. Practically no musketry was heard except scattered snipers and only now & then was there any machinegun firing.\n\nThe noise was just about equal to that of about midday at Anzac. Went up for a dump and dropped the rations which were done up in sandbags for the sections and they were then loaded upon trolleys and sent up to the firing line. No lights or smoking allowed and the tommies worked well, the transport drivers being a fine lot of men. \n\nThe resting battalions are in houses termed stand to billets which bear signs of being heavily shelled often. Noticed hereabout flagrant disregard by the men of sanitation. Returning we could see the line \tof flares the horseshoe shape of the line here. The whole country traversed by the wagons is open and fireswept in daytime and liable to sweeping by machineguns at night.\n\nThe column opens out to leave a good interval between each limber in case of shell burst. On the left a dangerous spot exists where wagons go up separately – a man was killed there tonight. A relief was taking place and troops coming out they go in by sections and platoons to avoid losses. Back to billet and had a supper of bully beef and bread at 2215.\n\nBed 2300.\n\nCroix-Du-Bac\n\n2\/4\/16\n\nUp at 0630 to hear the church bells ringing and mademoiselle got us for a franc a very nice breakfast of eggs and toast. Driver called for us at 0745 and calling in to say au revoir to our English & Scotch friends, we made for the Divisional headquarters and met some of the staff officers there. Left for home again in motorbus at 1000 – a lovely Sunday morning and we had a delightful trip through sunny lanes and green fields.\n\nVisited quite a number of small towns on the return journey taking a slightly different course to that we took in going in the first place. Passed again through the Forest of Sebenque which is very thick but foresters had been at work thinning out the wood and cutting the wood into lengths. A strait paved road runs through the forest and stretches across the country straight as a dart for miles – a splendid thoroughfare.\n\nWe had lunch at a wayside tavern where everything was beautifully clean and the lady of the house spotless. She gave us for 70 centimes cups of tea and biscuits and cakes. Two charming mademoiselles aged about 15 and 16 respectively dressed very smartly in nice dresses were the serving wenches. \n\nThe dung heap in the centre of the farmyard is used unconventionally by both sexes for latrines and just outside the kitchen window at this little tavern was a trough which we used in full view of all; all passing & repassing as a matter of course. \n\nReached Roquefort at about 1500 and wrote a report. Barzely returned & there so walked down to his billet with him. Found all quiet down here. Yesterday they had a practice attack with actual gas here using their helmets. Passed some minutes in dalliance with the coy mademoiselle Marcello? Aged dix huit. Rum on issue again to all ranks and is much looked forward to by the soldiers.\n\nTalking to a girl in a debitant about 5 miles away. She was a school teacher prior to all such positions being given to refugees and could speak English splendidly having taken it for matrice subject. She said the people here spoke with clipping accent, not fully sounding words and using Flemish slang as well, and that on the contrary, in the South the people speak far better emphasising every single syllable throughout. She said she only learned English because she had to never thinking how handy it would be. Mainezzed speaks rather well and improving daily.\n\nCouchez 2150.\n\nLigne de Roquefort \n\n3\/4\/16\n\nEarly morning rather foggy but later sun shone warmly. Platoon drill second parade in pleasant small meadow dotted with wild flowers and full of trees. Arranged with Monsieur Lombard pasturage for my horse for 1 franc per day. Here they put saltpetre all over the grass for fertilizing reasons and horses are unable to eat it as a consequence. The hedges are becoming very green and the whole country will be robed in leaf soon.\n\nRoute marched as a Battalion in the afternoon but struck little new ground. Came down pretty lanes beside the Chateau de Roquefort which in its time judging by the grounds has been a fine place. \n\nIn the evening called in and received orders for moving off in the morning we marched into billets 10 miles away and complete the whole journey in 3 days. Great deal of beer flying round – had 11 absentees for parade & shot 7 into guard room drunk to sober up and had 4 dealt with tonight.\n\nIn the evening the road from here to the other village was one drunk shewn stretch and I heard one thick voice proclaim \"Plach’d, never see a cobber pinched\". We shall be very sorry to leave LIGNE in this pretty place we were quite happy. Told the family \"partin demaine\" and had great jokes with madam and mademoiselle and great arguments in bad French. \n\nA mail arrived today and it is not yet fully sorted. The army rations are very good. Boiled meat, marmalade and bread & cheese for breakfast, bacon and ditto for lunch and meat, butter &c for tea.\n\nSeveral aeroplanes over today, one of them German. Arranged with Steward for a new horse, mine having gone lame. All the cows here are kept in stalls and handfed until May. They are shut away in darkness and one would never know they were there. A great deal of farm work is done by women stacking hay milking cleaning stables feeding &c and today I saw a woman ploughing. This cannot but have a beneficial effect on the race. All able bodied men are away – only decrepit and unfit are left. \n\nEncountered a fine echo today in the woods of Chateau de Roquefort, the music of the band was flung back with interest. Had on up and issued orders for platoon commanders for the shift tomorrow.\n\nCouchez 2300.\n\nHaverquirk\n","18":"\n\nOn early parade collected all blankets & got ready to move. Spendlove drunk and did no work so sacked him and took on Smith as batman, he says he is a bookmaker at home! Ready to move off at 1000 when orders arrived postponing two hours and also an order for me to proceed to Aire and act as guide to the Brigade. \n\nHad difficulty in finding road but found one eventually but it was not the correct one it transpired subsequently marched through Thiennes. The men very tired & sore in feet. Reached Havesquirk and billeted. \n\nNever before have I seen such drunkeness in the force as lately. My best men are degenerating and boys who never before drank, one never sober here. There can be no two opinions – for good work and fighting drunk must be prohibited ablsolutely and cleaned well away. Many carried wine in their water bottles and immediately upon reaching billets the first thought seemed to be \"more liquor\".\n\nA cold misty day. The A.I.F. has wonderfully improved in saluting and the men put the Tommies in the shade with their punctiliousness in this respect. Today I acknowledged so many salutes that my arm is quite tired. The Column was a long one, mounted men and wagons led followed by 21st with all their wagons & limbers and then 22nd with ditto. The hard roads played deuce with men’s feet.\n\nBilleted in barns and stables very crowded. Drunken batman neglected horse but new man is looking after it. Rout drunk. My room comfortable and clean. Messing with Hogarth across road two buxom daughters busy selling beer to the men. No one relishes the march to Sailly tomorrow. In Aire pleasant shops and markets quite country town. Armoured cars and crowds of motor wagons. Went to co’s billet and heard two mademoiselles play & sing \"beaucoup chantans’. Saw Croix de Geurre & Medaille Militiare won by the son of Madame. \n\nSailly\n","19":"\n\nHeavy frost and ice at about 0630, at which time I turned out. Shifting arrangements progressed apace and at 0815 the Coy. Marched to the place appointed for the place of assemble. Billets has great advantages over camping in tents as well as possessing some disadvantages. At the house this morning there were two charming mademoiselles and there are worse occupations than rocking a cradle shaped churn and indulging with small talk and nonsense. Pretty, clean and honest some of these French women are charming indeed.\n\nNearer the trenches owing to the war, all decent females have left and only \"witherers beldames old & drawn\" remain. The lower classes who chiefly live on the sale of beer. So different to our ideas is the dungheap in the centre of the courtyard and the smells that there from arise and also the pool of farms drainage lying stagnantly near the entrance. The latrine arrangements are also very primitive and in attending to the functions of nature great commonsense is shown, nothing being thought of the presence of members of the opposite sex at the time.\n\nThe wildflowers through the green grass carpet the whole place. Some hawthorn hedges are blooming & fruit trees also. Looking into a forest, a green blush seems to have caught the \"lower boughs & the brushwood skirt\". \n\nWe moved of in Pde. Column of route at 0900 and each company had its cookers. \"D\" Co. brought theirs along and my horse took fright sliding down a bank into a ditch full of about a foot of slimy mud. The horse was covered with it and saddle as well and myself had feet and putties to say nothing of tunic smothered. Fortunate indeed not to have been rolled headfirst into it. Marched all day in 50 minute stretches with 10 minute halts. The cookers served up hot meal at noon.\n\nMerville is a good town with first class shops and a fine church. In front of the church a fair was in progress, women had most of the booths and finery and other rubbish were on sale. Some statuary on the outskirts of the town. All along the route are shrines evidently erected in memory of some pious deceased person. Inside a small image or group and some flowers. On top an inscription such as \"Notre Dame de Deliveransee priez pour nous\" – or as it is frequently shortened to \"p.p.n.\". Stone crosses bearing a life size crucified Christ are erected alone the road.\n\n \n\n\/9\n\nSailly\n\n5\/4\/16\n\nEvery room in the houses we are billeted in is full of pictures of sacred hearts and crucifixes. On most roofs a cross is let in in glazed tiles and the date as well. Some houses have thatched roofs and look very pretty just like old pictures. After leaving Merville we passed what was evidently a munition factory separated from us by a fair broad brook. Upon the grass on the opposite bank buxom wenches indulged in amorous sport and suggestive invitation to our men. \"By G-\" say one \"I wouldn’t mind being among them\". \"Yes\" said the other \"but you x lose it swimming over\".\n\nThe men had dreadfully sore and tender feet but stuck it out well the roads here takes the skin off and we wanted more hardening. Saluting of the AIF is splendid and we struck some smart Tommies. My arm got quite tired returning salutes. The fellows chip the tommies slinging off in their own broad way \"My, choom, ‘ev yer got a Woodbine?\".\n\nWe passed an aeroplane hanger all mottled with disguising paint and from then onwards the rattle of guns was incessant. Passed a well packed cemetery. Public notices in the street warn the inhabitants against gas and there are alarm posts.\n\nReaching Sailly we cleared the town and billeting among farmhouses. Everything very poor and rough owing to ravages of war only lower class staying about. The roads here are marvellously good and all day we have been marching upon roads as good as am Australian suburban street. All glad to reach billet and get boots off the sore & chafed feet. We are billeted in a pretty spot outside the town but the house is squalid and bare and the farmyard stinks.\n\nNearly every house along the main roads is an Estaminet and in the windows are exposed for sale lollies and various food stuffs. \"Debitant de Bouissons\" is another frequent sign but \"Estaminet\" is the most prevalent. In the small enclosure in rear of this place standing out among bare trees is a fine pear tree in full blossom, indeed, this whole place reminds me of an orchard. The flares from German trenches can be plainly seen around us like a horseshoe.\n\nSailly\n","20":"\n\nReveille at 0700 and all feeling pretty stiff after yesterdays 18 mile march. Parade feet washing and examination on at 0930, very cold and bleak. Ready with orderly room at 1000 but CO having gone up to trenches had to be postponed. At 1800 the same performance occurred most exasperating. In the afternoon cut the work up into different headings and essayed some company drill late in the afternoon. May out riding to Estaires fell and broke his arm. \n\nOur supplies very slow in coming to hand and this coy. Goes in to action short 48 identification discs and 50 field dressings to say nothing of men’s boots being worn out. No doubt it is the fault of regimental people. After dark the artillery had some heavy exchanges and an intermittent machine gun fire was kept up. At night the enemy flares show line of the trenches stretching round horseshoe fashion. We move off tomorrow in the afternoon sometime.\n\nEddy and the other batmen foraged around Sailly today and brought some stuff. \"Ideal\" milk great stuff never go short for cream. The batmen also bought a fowl which they stuffed and served up roast with potatoes for tea so we had high mess in the little back room. Also bespoke charcoal from the housewife and got the stove going. She is in trouble her good man having been killed at VERDUN. \n\nToday at midday we received here yesterday’s London Daily Mail. Upon the roads here abouts English tommies are employed with pick and shovel mending and patching. It seems strange to us seeing the dung heap at every backdoor. Reeking in the raw morning air. The twilight hereabouts are long. It gets light about 0430 and not dark till 1915. Early morning is decked with dew jewels every hedge and every blade of grass.\n\nBed early.\n\nSailly\n","21":"\n\nWoke up with a sore throat and felt very unwell so slept in till 0900. All day felt cold and shivery. Big orderly room and got substantial penalties inflicted. Last night the noise in the loft kept me awake – so many drunks returning and \tdoing dances on the ceiling. Roared a bit and they kept quiet. Got the marching orders for our march to Fleurbaix 5 minute intervals between companies until the crossing of railway near Bac St. Maur when an advance by platoons at 2 minute intervals takes place. If dark connecting files at intervals of 4 paces promise to be necessary and the march should be an interesting one. \n\nVery cold raw day after heavy rain last night. All our company transport marches in rear of the company – a cooker (on which I hope to have some hot tea ready when we reach our destination). G.S. wagon with blankets and kits and officers luggage. Left at 6 pm on our 6 mile march and found it very hard to keep in touch, at one time only 3 men in one platoon were left all the others being connecting files. An impressive slow silent march getting closer every instant to the enemy trenches.\n\nReached Fleurbaix about 10 pm and struck good billets taking over from the Sussex Regiment. Their officers very decent and put us up to all the ropes. Had great trouble on the march watching intercommunication and had to keep riding up and down the line. Roads blocked by fills dropped but once very nearly took wrong course. \n\nThe billets are fairly comfortable and better than the last we had. Stores mess &c already on the scene. Other officers fixed up further down the road near the stand to Company. On morning off some men were very drunk and having them under guard looked bad. Still feeling unwell tonight and would like to sleep in tomorrow but no such luxury in these times.\n\nFleurbaix\n","22":"\n\nStill feeling very unwell and rotten, so secured from M.O. four No. 13’s. Rode up to Batt. H.Q. at 0830 and got few trivial orders. The office is situated in a good building near the Church. Curnoir’ horse fell with him and sprained his ankle. Went down to Elbow Farm and found the billets there riddled with shells and all concerned living in dugouts. Trenches there of the stereotyped design and very damp – in the big communications sap there was two feet of clear running water.\n\nAllocated the platoons there stations right up the Tin Barn Avenue also. Along the road canvas screens are erected to hide movement from the enemy’s eyes. After lunch went into H.Q. again and found the cobblestones very dangerous for the horse. With C.O. and the others went round the whole regimental billet area and coming down our own way the enemy opened up a heavy bombardment of a battery of ours. Sat down by road and watched the shells tearing into the earth about 200 yards off and sending dirt and debris yards up in the air. An occasional \"dud\" struck yards dully and shook the earth. Further down our artillery have crows nest observation post up the trees.\n\nLater in the afternoon the enemy returned the shelling of the battery and our guns replied. The shells came in very thick and we watched from the windows. Hedges and fields were being smashed about and we thanked our stars they did not shorten their range a little and get us. Windows rattling with concussion. Rather nerve racking after being away from it for a few months. Aeroplane up spotting, our sentries gave whistle signals for taking cover when enemy plane appears. \n\nAll officers of the company messing here together with Skenes as mess Secretary. After tea settled down in a cosy room with a book in front of fire and but for machine gun rattle might well have imagined ourselves at home instead of only about a mile in rear of the trenches. They certainly take no risks keeping their flares up continuously. \n\nTurning in early & hope to feel more fit tomorrow. Bennett No. 10 platoon lost his voice on the Peninsula and had been attending the doctor in search of relief ever since. Got drunk the other day and can now speak stentivianly again.\n\n Fleurbaix \n","23":"\n\nWaken early by the C.O. and Major Matthews and discussed the question of a certain spy and laid plans accordingly. Met at Elbow Farm at 1030 and set off for firing line. Passed burial ground into communication trench along which we walked on duck boards raised above the water and covered with expanded metal to prevent slipping. All along pumps were being worked by men by hand. Trenches very shallow in places.\n\nEventually reached firing line and found it very like a wall of sand bags, the men in \"bays\" and wearing steel helmets, the dugouts decently constructed and not too bad. Periscopes scarce, only two in the company. Plenty of wire out in front and the \"noman’s land\" is flat green grass. Two hundred yards away is another sandbag wall – the German trenches, No shooting going on except with one of the scarce periscope rifles. \n\nOn the right of this company is a dangerous salient unoccupied and about the responsibility for which there seems great uncertainty. Taken all round there is not much difference between our trenches and those at Gallipoli. Inspected thoroughly the whole line I am to take over with my Sgt. Major & Hogarth. \n\nYeadon is an amazingly smart chap and like a ferret for finding out things. Returning he kept us amused at his remarks made in his squeaky voice.\n\nJay's Post is a stronghold just in rear and consists of two redoubts. McKay will be detailed as garrison of this. This particular spot is shaped thus the dotted line representing the enemy who are all round so the importance of our stronghold X is self apparent. We can see from behind our trenches in rear of Fritz and it strikes me we can put a few good shots up our trees when they have their full coat of leaves and snipe the enemy well.\n\nReturned to lunch and sent down the platoon commanders to get the lay of the land so they can go on alright in the dark. Dr Barzelley goes away once more to a Brigade this time and French mortar battery and bombing claim 3 others. Of the original staff of officers who left Australia we now only have about 14 still with us out of 32. Only about 6 have been right through without a spell in hospital.\n\nBefore tea saw a spy marched down under guard. Yesterday’s shelling of the town is blamed upon him, ploughing quietly in a field with a white horse, he pulled it to right or left to denote the place of impact of each shell. \n\nVisited Curnoir laid up with his bad foot, Thomsen with a bad finger and the Dr. has a wretched cold. Myself have a face twice normal size which is to be lanced tomorrow. The Padre was being teased at Batt HQ. It is Sunday today.\n\n Fleurbaix \n","24":"\n\nA little practical joke was put up last night. The movements of a certain white horse were found to coincide with shelling by Fritz so we determined to \ndye\n the horse. Having located its stable the Sergeant Major (Yeadon) and a couple of kindred spirits set out with a strong solution of permangate of potash. Gaining access to the stable they transformed the horse’s white coat into a bay one and then decamped. The owner evidently heard some noise but merely closed the top half of the stable door and then went away again. The effect of the dyeing was extraordinary – one coat is insufficient and the horse now is skebald. Being restive, its head and legs stay their original colour!!\n\nThe Company marched down to the laundries and bathed there in vats of hot water and leaving their old socks received clean good ones in there place. After lunch the enemy commenced close round and put a shell through the farmhouse opposite. The women all ran for the trenches and the soldiers were streaking like ants all over the fields not knowing which direction to go. More shells followed landing all round us and one bursting closer wounded two men who were standing near our gate. One of them was a 7th Field Ambulance Sergeant and the shrapnel got him between the eyes. He was unconscious when taken away in the motor vehicle. \n\nAeroplanes were up all day and one of ours had a very warm passage. Our guns put some good smacks into them. There is a battery on each side of the house and the sudden detonations are nerve shaking at first. \n\nRum issue this afternoon – one demijohn of potent spirit to each platoon. More worry than it is worth as we found out in Anzac and encourages the youngest boys to take their tot. Rumoured we are not here for long and go next to the left near Armentieres and after that some weeks into rest. Squads of men of the Pioneers passing wearing the steel helmet and looking the toughest of the tough cases.\n\nOnly small parties of about a section strength in one along the roads and then in Indian file which looks funny. Furphy that a mail is at Brigade and should reach here tonight. After tea one of our ‘planes had a most exciting passage while flying pretty low the shells from the German antiaircraft guns were bursting thick all round it and they went very close. In the shape of a large rectangle the sky was dotted white thickly with the smoke of shell bursts. It got away safely.\n\nIn another which went up later the machine guns kept popping. \n\nC.O. down inquired about Miles as QM strongly recommended him for the job in succession to May, Hawkins to be R.Q.M.S. Received orders for detail of extensive working parties by day & night tomorrow at Tin Barn and Dead Dog & other sweet sounding places.\n\nBed 2200\n\n\t\n\n Fleurbaix \n","25":"\n\nFatigues left early in soft rain for their tasks. A wet morning. Coy. clerk is named Glasscock. Reg No. 606 and is too slow for me altogether. New batman (Smith) shaping well and has a good job now as the horse has been returned to the Transport section.\n\nEnemy artillery very quite until about 3 pm when they got onto the farmhouse opposite and three shells landed right through it setting it on fire. The Tommies billeted there made fantastic efforts to save their gear. The place went up in flames and before long there were only the bare walls remaining standing. Rather distressing to the people of the house who fled to the adjacent old trenches for cover – a decent snug thached old farmhouse it was of the usual square style with courtyard in the centre. \n\nAbout dusk two shells hit my other billet and one man got a slight graze that only necessitated field dressing. (N.B. \nCairo\n In the Wazir actually saw one night in a laundry beneath a brothel, natives spitting water from their mouth over clothes to damp them prior to ironing.\n","26":"\n\nThe Coy moved down at intervals by sections to Elbow Farm and took over from \"D\" Co who went to the baths. All the billets were much blown about by shells and the OCs dugout is one of 3\/8 steel shaped like an Aldershot oven with about 3 feet of sandbags upon the top and sides. Wooden floor and table and at the far end a small stove – quite comfortable. Here I spent the whole beastly cold wet rain morning crouching over the stove and later playing poker with Elmiger winning 5 francs. \n\nReturned to our own billets at about noon and found an excellent dinner cooked and ready for us. Baker the cook, is a hard worker who loves his pots and pans and slogs in hard among them all day. At other soldiering work he is a \"blob\" and a shirker but at this congenial occupation would work like a nigger all night as well as all day.\n\nThe day keeping very wintry we spent the rest of the time around the fire reading and yarning. The hostile artillery put a shell or two round our other billet but where otherwise very quiet. Miles having gone to Q.M.’s job, put Groves on in his place. The 23rd had their H.Q. blown out yesterday and a man killed last night.\n","27":"\n\nSpent a restless night with neuralgia pains. No rain today but a bitter cold wind that augurs an unpleasant journey through mud and water up the communication trenches. The old gum boots are about the best invention ever made but far from dressy. \n\nLeft about 0700 in platoons in single file at two minute intervals for the trenches and had a long walk in darkness along \"duckboards\" but the communication trenches were dry enough. No many bullets flying round but no doubt those men who had not been in before found the experience some what exciting. Loaded rifles at Elbow Farm and one took his tinbox out to put the charger in. Reaching firing line took over from Capt Reed of 21st Battn, things quiet enough on both sides. \n\nAll baggage had been sent or brought on before and we expect a stay of 4 – 7 days in here. Very cold in the dugouts. Not much machine gun fire, in fact Anzac was easily three times as noisy.\n\nFiring Line France (N 64)\n","28":"\n\nStand to arms 0400 which is too late as in this flat country dawn appears about 3.45 am. Enemy very quiet probably feeling as cold and uncomfortable as we are. The Coy headquarters dug out is a wooden room about 9’ square with an iron and sandbag roof pretty low and apt to catch ones head. On each side is a rude bunk one used as bed and the other as a seat. In one corner is a small stove with a flue that sticks through the wall, this has been made out of beaten biscuit tins by someone \"handy\". \n\nThe old firing line was just above and in the right hand corner of the dugout now is an evil looking recess which was an old sally port. On the rear wall are a few orders stuck up above them is a shelf covered with maps and personal gear and above that is a picture of white fanged actress making a meal of a rose. Mess tins, field glasses, rockets, flairs and the other odds and ends adorn the walls. On the floor is an overdose of lovely mud and to complete a picture of absolute dreariness and discomfort is myself with greatcoat revolver & a \"gorblime\" cap to say nothing of the a pair of gumboots covered with filthy mud right up to the knees. \n\nA path runs all the way along the line and a pretty continuous stream of water is abreast of that crossed at intervals by bridges. Mud is everywhere and the men splash along cursing through it, those on duty wearing the ugly but useful steel helmet. The crack of the snipers rifles and an odd bomb are the only sounds and everyone sits about huddled up to avoid the cold wind.\n\nAt 7 I went down to Jays Post with Mackay and splashed around through over 6 inches of water in places. Poked around firing line and sniping places &c during rest of morning. Very amusing to see the old Anzac dugout dwellers pottering round their own little shows and getting as snug and comfortable as old soldiers can. Just after lunch the enemy put some shells round the place about 300 yards right of Jays Post.\n\nWent into Fleurbaix to prosecute in a Courtmartial (RQMS) and had the walk of three miles in and the same back for nothing as an adjournment was granted until tomorrow morning. Returning to the trenches met Sir William Birdwood who stopped and talked a minute or two. The wounded are brought from tramhead to our Fleurbeaux billet by wheeled stretchers. \n\nBack in the trenches by 3.30 and commenced paying at once. Some snow fell and it got very cold but sun came out about ½ hour afterwards. \n\nSuddenly the enemy lashed over 4 whiz bang shrapnel shells immediately followed by dead silence. All at once shrieks of agony broke out – the anguished cry of a human being, the very sound of which makes one feel so helpless & small. Poor Jordan, one of my best men and an old South African campaigner, had received a dreadful wound at Jay's Post, a big piece of shell entering his back & protruding just under his heart.\n\nWe could hear his cries right up here poor chap and the stretcher bearers went down at once. He was conscious when he left. A married man, hope he gets well.\n\nEight in out mess here so we work it in two sittings in case a shell should wipe us all out. After tea the Colonel gave in and gave me a telescopic periscope to try. Had a look at the enemy trenches but the light was failing.\n\nSniper but his bullets pretty close to it. We stood to arms at 6.50 pm in silent rain and all the men have all kinds of garb in readiness for a bad night. All wearing cap comforters turban like, heavy greatcoats and their waterproof sheet shawlwise over their shoulders. After standing to paid the company in dribs & drabs which occupied all the evening. Counting franc notes is easy being decimal denominations like Egyptian currency. \n\nFlares sniping and machine guns rattling is the programme now – during the long twilight guns rolling down towards Armentieres & YPRES.\n\nFiring Line \"45\"\n","29":"\n\nIn the early hours Jack McCane went out with a patrol through a sally forth to have a look over towards the German trenches. Returning by mistake one of our posts fired on him wounding him in the buttock and calf and smashing up the wrist and arm of this backsheese Corporal. Small demonstration down on the left but in front of us there was nothing doing. Stood to arms before 4 am, no wind. \n\nWonderful how soon it gets light in these parts – the thrushes and other birds were singing vigorously. The whole place is infested with rats and in the hours of darkness you can hear the broods of young ones round the sandbag walls whimpering and some of the men have had the biscuits of their iron ration eaten by them and holes gnawed in their haversacks. Coming up into the trenches the other night we several times encountered rats nearly as big as kittens – ugly soft beasts which gave up the ghost with sickening squelch under the feet of the men marching up. \n\nRound the trenches at 8 am with telescopic periscope. Delightful green grass and some good elm trees on No Mans Land between ourselves and the Germans. The smoke rising from their breakfast fires. A neat trim meadow of 170 yards width between us and them and their neat trim trenches beyond that, - so in keeping with the country. Railway whistles heard in rear of them – only heard a locomotive whistle once at Gallipoli (probably from MAIDOS way). Bitterly cold this morning my hands were like ice. Gave my spare wraps to one of the sentries last night and tonight at stand to will dishout a tot of rum to each of the boys on the fire step. \n\nWent into Fleurbaix in the morning on a courtmartial – all the roads very slushy and snow fell twice during the morning and only lay for a few minutes like hail upon the ground. The hedges are all beautifully green and every day more are breaking into white hawthorn blossom. Every mile seems to bring you into a village – quiet brown old groups of houses with leafless branches of the trees round them.\n\nAfter lunch along firing line and ordered lowering of duck boards in places as from some high points we could see the enemy trenches. Cpl Thurlow prowling round with all his sniping gear and selecting places to lie in wait and pick Huns off. Pumping parties at work all day on the communication trenches to Jays Post but as fast as they pump the water out more trickles in. However they manage to keep a bit ahead of it by constant work. There are several springs running in along here and great deal of soakage.\n\nInspected Jays Post and found all correct – fair number of H.E. and shrapnel shells plastered around them today but no casualties. Just about 6 pm went along to \"B\" Co and saw Andrew, enemy commenced bombarding field just in rear, the shells whizzing very low overhead and bursting about 300 yards away. They also endevoured to get Battalion headquarters and merry strafe kept on for some time. Stood to at 6.45, inspected whole section and found them correct every man standing silently at his post with full equipment on and bayonet fixed.\n\nImproved the gangway in rear of firing line just before dark by lowering it in places where exposed to enemy snipers. Also put an extra 1000 rounds of ball on each post so they can break the seal once if attack starts. Our machine guns from Wye Farm fired indirect on the enemy’s trains &c and the bullets went singing across 30 feet over our heads. During the night they swept over parapets with machine gun fire and the sniping livened up.\n\nBright moonlight until about 2 am and cold sharp night. Rather hard to get to sleep owing to noise and several times woke up with a start when firing got very loud. Wakened a couple of times by messengers.\n\nFiring Line France\n","30":"\n\nStand to arms 3.45 white frost pitch dark. Went right round and inspected all posts, everyone correct. The enemy’s trenches becoming visible we carried on at 4.20 am and reduced the posts today strength. Turned in again and slept till 7 after writing reports. After breakfast went round again and had good look at the opposing trenches. \n\nSunny morning some sticks or planks being moved in German trenches so put the French mortars on to it at 300 yards range. The first shot went 400 yards to the right as did the second and third but the next went to the left. One landed right in there firing line and sent debris high into the air. \n\nAt 1000 we were treated to an aerial demonstration the Germans bombarding two of our planes simultaneously. One flew very low and tore across at a tremendous pace. One shell burst right under it and it seemed to commence to descend but righted itself and carried on. There planes fly very high.\n\nAm connected by phone with a battery some mile or so back and they have to fire a shell at my order any hour of the day – the shell to reach here within 30 secs of my issuing order. Tested at 1000 and shell arrived skimming low overhead and bursting on enemy line. \n\nAlong the rear of the trench are crosses and graves with such inscriptions in indelible pencil \"Two unknown British soldiers\" or \"One of the Worcestors\", some of the graves have been scoped out all round and it would not take much rain to wash the bodies out. From Jays Post post right to Wye Farm are scattered graves in among the green grass and at the Farm is a well cared for cemetery with rows of neat white crosses. \n\nSent two of the batmen up the town to buy stuff for the mess. There are 8 in the mess in my dugout and we run two sittings to avoid risk of all being blown out by the one shell. Today is Sunday. General Legge through at noon and Brigadier then came along from the other direction. \n\nReading in dugout for most of the afternoon and it was so quiet that one wouldn’t have known a war was on. Later on the enemy started shelling towards our rear and succeeded in setting a house on fire in the direction of Elbow Farm, probably my 11 & 12 platoons billet. \n\nWe have been treated to some fine aerial displays today, 6 were up at one time. Our planes very daring and fly low and hundreds of shells were put all round them, fragments fell round our ears here. Taubes were over later but fly very high. Our observation balloons up – the Germans also had one up. Floating down from a plane we saw a big white object – perhaps it was from a shell and some ranging device.\n\nVisited Jays Post at stand to and found all correct, then did the firing line here. Our machine guns at Wye Farm opened up after dark one fired too low and dangerously grazed our parapets. Firing briskened up around after stand to arms. \n\nRations and stores come up on trucks after dark when enemy cannot see the tramlines. Rats run about all over this place and also swim across the stagnant pools of water. \n\nThey send a little mail up nightly – papers and so on. The firing line here is much more comfortable than some of the billets round and certainly safer since enemy has been shelling all houses. At 10 pm heavy fire commenced on our right and continued 10 minutes. The air full of flares. Germans working out in front of us so sent up a parachute flare and turned machine gun on them.\n\nFrance Firing Line \"45\"\n","31":"\n\nDark at stand to arms (3.45), turned out and inspected all the posts. Carried on at 4.20 am the enemy trenches being clearly visible and daylight rapidly gaining strength. At this time we are treated to a concert by the song birds in the fields. Test shell from battery at 9.30 landed 5 yards short of enemy parapet. After stand to went back to bed and slept quietly until 7. A dirty muddy drizzly cold morning. \n\nReceived word my wounded man Jordan had died so wrote to his wife. He was a good soldier and got a terrible wound. Wallace of \"A\" Coy (shot by our own men) is also dead. \n\nPut party on filling sandbags ready to heighten parapet tonight and also had a new dugout built for men without shelter and shelters put up for cooks. Enemy artillery put some shells over before tea and got onto \"B\" Coy parapet. A very loafing quiet day here stayed in dugout reading and writing. Had some men from Jays Post up here working and owing to shelling ordered them to return in twos instead of as a body. One remarked as a shell landed \"By God we’ll reach there by ones if this keeps up\". Quinn is very dark and they call him Abdul. Dyson of the squeaky voice is another card and the hero of that desert drama, Bennett who recovered his voice after three months loss by getting drunk on rum and salt is also a wag. \n\nHeavy rain at stand to 7 – 8 pm. Inspected firing line. Our machine guns firing indirect fire from Wye Farm. After dark put up row of 50 headers on parapet above my dugout the working party got well sniped in the process. An uncomfortable night for the men on the fire steps. Various patrols going out necessitating very careful warning of all concerned.\n\nCloudy but moonlight at 10 pm and cold.\n","32":"\n\nDark and raining at stand to. Inspected firing line all cheerful and waggish. One man had his w.p.sheet laced up and over his head and shoulders only nose showing. Went down to Jays Post wading through from 6 – 12 inches of water along the trench. Pumps at work. Inspected parapets on return and marked out some work. Cold and raining. Very heavy bombardment raging some miles away.\n\nLast night in bitter cold and wet a man was working digging out slush in rear when a bullet whistled past him, \"No byes – I haven’t got the luck to stop one of you\" he said and threw up another shovelful. \n\nArtillery officers called in and we tested the battery, the shell taking 1 minute to arrive and landed right in the enemy firing line before exploding. At lunch time they threw over some heavy stuff which landed about 600 yards in rear. The heavy roll of guns still keeps going further round. On account of gas there are a good many windvanes erected and some men have made model aeroplanes very ingenious. Fastened to the sandbags here propellers race round with every breath of air. \n\nThe Padre, Dr Craig and Matthews all round this morning. Plenty of time for reading and writing here – the men all who are not on posts busy on fatigues &c. Ammunition redistributed today, plenty of bombs now on each post. Found an armour piercing bullet used by enemy to go through our steel loophole plates.\n\nAt evening stand to it rained heavily and makes it rough for the lads on the fire step all night. Today we got an order giving number of cases of men shot for disciplinary reasons – a very impressive list – but the casual Australian merely passes a verdict \"G’struth\" and carries on! All work well in firing line no trouble with even the work, Vousden the old ventriloquist\n\n is a character. Aged 60 he enlisted as 43 and has the heart of a lion but is always ailing, as night on the post he was all doubled up and in Gallipoli had to often be lifted down. Lucas the cook is a wag too. Yesterday he spoke roughly to Vousden who picked up a stick and gave \"Bob\" a few tapes on the pate laying open.\n\nVery quiet night wet cold & light.\n\n \n\nFiring Line France (45)\n","33":"\n\nStand to at 3.45 am. Cold dark and wet. Got up in gum boots & heavy coat inspected the men. All looking forward to getting back into billets and rest. Enemy extremely quiet and not a shot was fired during breakfast they probably feeling the weather as much as we, since arriving here it has been wet every day. Rations and supplies come up at night by trolley from a place where they are dumped at La Croix Marchel by the transport. The C.O.M.S. is quartered in Erquinham and comes down on the limbers at night. He buys a paper for us and today we have the \"Times\" 48 hours old. Some mail came in last night late. \n\nThe troops opposing us here are Bavarians and keep very quiet. The distance between the trenches 200 – 300 is just too far to be interesting. Pumping parties hard at work and 20 men away on Engineers work. Patrols out last night report wire fairly good on our front. Put three trench mortar bombs across at enemy’s pump and blew in some of their parapet for them. Behind our line there are many small graves some surrounded with barb wire and covered with green grass, small crosses on top denoting that they are bodies on men unknown. In places these graves are nearly covered over with mud, in others only a couple of inches of dirt covers them. Noticed a leg bone knocking round the firing line. \n\nCold and bleak again today, we have had wet every day of late – a wretched climate. Web at stand to arranged order of march and route for the relief and got all men into marching order at stand to. Inspected Jays Post and firing line.\n\nAt 7.15 pm No. 13 reported suspicious lights near a ruined tower at Bois Grenier immediately phoned to Batt. Office. About half an hour afterwards the enemy machine guns opened, heavily scouring our communication trenches. An incoming platoon of the 21st had a very rough passage having to crawl part of the way through mud with bullets all round them and crouch with bullets hitting all round them. \n\nAt about 9, the taking over was complete and I started my chaps moving off. The enemy was sending up some very brilliant flares as we quickly filed through the trenches to the rear but we bustled along past exposed places and had no adventures. \n\nReaching billets we had get tucked in very close together owing to our other place having been blown to bits by shells. The scene in our mess room reminded us of Bairnsfather’s cartoon – tired and dirty officers sitting happily round all filthy with mud. Turned in early and all slept very soundly. \n","34":"\n\nReveille was rather a dead letter. All dogtired and fast asleep as late as 8 o’clock and I had trouble in getting anything to eat before 9.45 at which hour meeting the Major at Batt HQ we proceeded to 23rd HQ where Colonel Watson joined us and formed a Court Martial. Tried 5 cases and passed sentence. The MMP’s told us they had received orders to be very respectful and chary in handling our Australian lads. They are lovely. To see the twinkle in the eye of some sunburnt hones Australian free and easy lad as he gives his evidence regarding a good night out or brawl he took part in, is good. We spent all day there and lunched with the C.O. at his billet where we indulged in French conversation with the interpreter. \n\nIt is great to get out into rest after the dirty firing line. Spies very active of late and those who get caught disappear to their fate promptly. Great amount of barbed wire round Fleubaix, it is a great furphey today that the Russians have captured Trebizond. \n\nAll the hedges and elms are pushing out great coats of green leaves and getting their summer coats. The little village is much knocked about with shells. Frequent little shrines about and niches in walls with sacred images. Also on the inside of doors a cross painted with \"In hoc signore\". \n\nOrders out tonight that an orderly has to accompany us whenever we move abroad. The people of the house are shifting out all their furniture, are we going to get shelled tomorrow??\n\nFleurbaix\n","35":"\n\nAbout 80 of my men were working on fatigue all night doing repairs close up to the firing line. About 4 am one chap called out \"Someone’s winged\" and it was found that Warner had received a dangerous wound shattering the jaw, the bullet lodging among the blood vessels of the neck. Bazely in charge of tramline again says machine guns were very active sweeping the roads. \n\nSlept in until 8.30 am. Noticed a small cart pass drawn by a pair of dogs in harness. The dogs were not very large but must be strong as they were pulling a fairly heavy little cart in which a boy was sitting driving them. \n\nAn issue of jerkins to all ranks today and more rum – they had a good dose yesterday too. Got parties on to cleaning up all round the billet. Four of my officers sleeping on the stone floor of the sitting room – very uncomfortable.\n\nAeroplanes fairly active today and the whistles of the men on watch are frequent. The report of the guns firing at them is a dull thud and readily distinguishable for ordinary artillery fire. Enemy agents & spies are very active cutting our phone wires and signalling a hundred other ways has been made a rule that all church and town clocks shall point to 12 as this ingenious method has been tried for sig.\n\nToday is Good Friday and after lunch Padre came down for service. Buckley returned from England recovered from his wounds after being away about 6 months. Curnon to hospital today with fractured foot. More fatigues – the whole company will be out tonight working. \n\nAbout 13.30 two of our planes flew over and enemy shelled them heavily. It was a cloudy cold afternoon and they were flying very low. Some of the shells went very close. \n\nFirst Division men working on barbed wire entanglements outside Fleurbaix. In the barns the men were playing \"two-up\" and had a \"yow\" out so that nothing was doing if I were to come out. All wearing their leather jerkins. Everything the Australian wears he seems to give a free and easy look. This is well topped off by the insolent gay felt hat our most distinctive article of dress.\n\nC.O. says Armentieres is mostly deserted but there are good shops there. Boys run up as soon as you arrive \"Hold horse Mister Captain\", \"You want Mam’selle, Mister Captn?\" Grey days these with very little sun. Marvellous what a growth of green the hedges and trees are putting on. Rain commenced after tea and the fatigues went away in the wet. \n\nCalled into Battalion office and there saw C.O. all very cosy and snug inside and a gramophone going. Outside mud and slush everywhere in the old twisting street and the whole place chocked with transport on its way to the dumps. Pitch dark and raining had a heavy journey back to the billet only light being that of the flares of the enemy shining high in the air above the trenches and illuminating fully the road even this far back. Soaked through and muddy – and this is war.\n\nReceived tonight a copy of yesterday’s \"Daily Mail\". A number of letters also came to hand out a photo of Valerie.\n\nFatigue parties returned very late wet, cold and had a liberal tot of rum issued to all hands. Very awkward the CQMS being stationed right at ERQUINGHEM and only coming down at night. He divides the rations out in bulk and delivers here or at the frontline but the main part – the final distribution – has to be done by the C.S.M. in addition to his other work. \n\nThe men will only get about two hours sleep as all have to turn out fairly early and leave for the laundries for hot bath and change of clothes. After getting into bed orderlies came along with orders on fatigue The fellows had an awful time working up to their eyes in mud and trying to shovel mud out with the result it only clung to the spades all the time.\n\nFleurbaix\n\n22\/4\/16\n\nA very cold and rainy morning. Great trouble in getting the lads out, they were dogtired after last night and their clothes all sopping still. Moved off by sections to Erquinham and went through the old fashioned little town to a brick building once a laundry and a dye factory now Divisional baths. Thomas late of S\/6, now an AMC Corporal was in charge. The men marched in and took off all their clothes, lousy garments were disinfected while they were bathing and on coming out all were issued with clean underclothes & socks. Passing inside there are big wooden vats full of hot steaming water. The men all got right in up to their necks and soaked and washed for about half an hour. Great joy and splashing – about 500 there altogether. Special place for officers – had the best bath since last at Shepheards Hotel Cairo. A canteen on the premises and great sales of cake were made . All agreed it was worth the walk there through the heavy rain.\n\nReturned through the slush and mud – still raining indeed it had done little else but rain since we left Roquefort, much struck with the beautiful green everywhere. Lovely high grass and leafy hedges, each meadow with its elm tree & other trees. \n\nThe old thatched farm houses with there farm yards. All along the roads are small brick shrines or chapels, just big enough to hold a small altar and statue. Inscriptions \"Notre Dame de Lourdes, pries pour nos. Salut Regine\". Over all shops are signs. \"The Break of Day\". \"The Three Kings\". &c. All towns are very close together. Fleurbaix is in sight of Erquinham & so on. Quaint old damaged church here with square tower and thickly crowded graveyard. They seem to favor iron tombstones with circular tops and hang wreaths on these.\n\nAfter lunch round the town on Court Martial business and then home. Still wet. Quiet evening and then early to bed.\n\n23\/4\/16\n\nAll moved down at 8.30 am and took over the garrison at Elbow Farm in order to permit \"D\" Co to bathe. After their tramp up there they had to return without a wash owing to Engineers &c. having them. Padre Gordinich came down at 9 and said mass and Padre Durnford followed with a service it being Easter Sunday.\n\nAeroplanes very active during the morning and heavily bombarded by the anti aircraft guns. A few shells landed not far off and blew out some machine gunners, one getting his cheek blown about. The Brigadier round and annoyed at one of my men (who was not aware of his passing) using the utterly depraved term \"f---ing\" in referring to an aeroplane, and also handed out a jolt with reference to a fellow who went out into full view of the enemy \"just to watch it better\". \n\nReturned to my billet at noon and got word our artillery were going to strafe \"Fritz at 3 pm. Arranged dispositions in case this place get blown out and got all gear out into the courtyard in case of fire. Rumoured 8th Batt. Relieve us on Thursday and we don’t go into the trenches again before going into reserve. Our artillery did a mild strafe in the afternoon and after tea we had a daring exhibition of flying by British Aeroplanes. Hundreds of shells bursting round them but very daring flights continued. Am in charge of 200 men doing odd jobs on trenches almost up to the firing line and do not expect to finish until the dawn of next day commences to break.\n\nFleurbaix\n\n24\/4\/16\n\nSupervised the work of fatigue parties all night up until 3 am. A dreadfully tedious business. The work consisted of working in the most filthy muddy trenches revetting sand bagging and building the reserve trench parapets. The light was not bad and flares from the German firing line silhouetted the figures of our men in the working parties and from behind their lines came a red glow from one of their billets set on fire by our shells today. Within a hundred yards or so of the front line the work was of a dangerous nature as we were out in front of the parapet and exposed all the time. Bullets whistled overhead and some kicked up the earth unpleasantly close but no one was hit. Our machine guns were firing over our heads and the not unpleasant smell of the burnt cordite was very insistent. Slipping through mud and splashing through deep water over floating duckboards was rotten especially as many of the men’s boots are in a deplorable state. \n\nWe could see someone in rear of enemy lines signalling and someone near the village responding. About midnight it became very much colder and correspondingly miserable. The fellows worked very well and hard calling themselves the \"Sigheaders\" because carrying baskets of earth like the Egyptians. Each little spell they got down under cover and stole 40 winks. Tired and wet, in mud and water, one could not help cursing the folly of the war and wishing to God it had come to an honourable end. To add to the joy of these fatigues it is often wet, and casualties also often occur.\n\nKnocked off at 3 am and plugged off home going through Gunnes Walk – every now and then some tired chap would slip off a duck board & souse up past the knees in slush letting loose shocking profanity – the language is filthy in the extreme. Even at this early hour (3.15) dawn had commenced and the skylarks were aloft singing their exquisite morning carol. \n\nReturned to billet and gave all hands a stiff nip of neat rum and then, removing muddy garments turned in for a couple of hours sleep. Awakened by batman with shaving water at 7 just in time to witness a heavy bombardment of our aeroplanes, hundreds of shell bursts flecking the sky. After breakfast inspected billets and all the morning our planes were aloft in couples and the enemy fired thousands of pounds worth of shells at them all to no purpose. They have taken to even sailing in the air under fake colours and using our marks so our chaps go up in couples and seem to have them bluffed. It is rarely we see a Taube & then they sail so high as to not be able to see much.\n\nAfter lunch the same intrepid airman whom the men have now named the \"Mad Major\" kept deliberately flying above the enemy anti-aircraft batteries and drawing there fire. They could not hit him but some of the shells went very close. However he dodged them in a most marvellous manner. They were firing H.E. at him and pieces of shell fell all round here. Very quite afternoon. Went up the village and saw two dogs about collie size pulling a loaded cart with a youth on top. \n\nGot a few reinforcements today. Party away all day unloading a coal barge on the LYS and another crowd had a bath this morning at Erquinchem. All the rest work tonight up in the reserve trench. People of the house removing all there furniture tonight.\n\nQuiet night.\n\nFleurbaix\n\n25\/4\/16\n\nA beautiful morning with the feel of Spring in the air and a warm slight breeze blowing scented with fruit blossom. The meadows covered with daisies and other wildflowers among which bees drone busily. Went to Elbow Farm to revise a Court Martial and all round pieces of H.E. shells were plonking falling from bursts up in the clouds at an aeroplane. The trees shedding their catkins. \n\nLast night the Germans ambushed a 21st patrol and got well home on them, killing a Corporal and wounded another man & Robertson as well. At 1330 the Coy. fell in in the courtyard close under the eaves of the farm buildings for inspection by me, when the Germans commenced shelling us. The first shell landed and burst in the fields on the enemy side and exploded within a few of 17 boxes of bomb. \n\nAnother following immediately decided to put all the men into the narrow topped trenches just outside and hid from enemy view. They filed out quietly some getting steel helmets until the supply was exhausted. The trenches just took the 230 of them. The bombardment then started properly one going through the barn and bursting inside wrecking the contents. Others followed in quick succession and it was funny hearing the remarks. Immediately the report of the gun was heard 230 heads would disappear from view as all crouched down. After the burst 230 heads would appear like magic \"Jacks in the box\" only to dive down again when the next arrived. One H.E. burst on the corner of the trench but no one was hurt and we had no casualties at all. \n\nWent up to the firing line at 3 pm with Yeadon whose squeak voice & funny comments are a most amusing. Noticed that the heads of Erquinchem the trench is very dangerous the enemy’s trenches 300 yds in front being clearly in view. \n\nAerial torpedo bombs seem to have been fairly thick in those parts of late. The old tower at Bois Grenier has been still further ruined by shell fire. The last few days Furphy that Turkey has sued for peace but no confirmation. \n\nSome AMC men billeted here, when bombardment started today ran for their lives up to the village. Court Martial if they had been my men. Between here and our old demolished billet are numbers of shell holes and the Estamines next door had a H.E. in one side and out the other without exploding. Some very heavy stuff came over about tea time going towards ERQUIGHEM. \n\nOur guns let go a few occasionally. Left for the trenches at 7.45 pm in platoons in single file with two minute intervals and had an uneventful passage. Took over and had a cup of tea with the 21st officers before they left. We had a patrol out at this time and by our cessation of snipping they evidently smelt a rat and put up their flares often. Excellent flares too and fired with some force – one very bright one travelled at least 350 yards and landed well in rear of firing line. Some men got lost coming in and delayed things somewhat but the 21st had a lot of delays and had to wait 1 ½ hours before moving. \n\nRemark by gentleman who fell off a duckboard and soused into the water \"Wish to God I’d been hatched a f--------duck!\". Visited Jays Post at 10.20 and found them all correct there.\n\nSlightly more activity than usual along the front. Rations and supplies coming up by tram was a rather noisy business. Remark that there is not much of Belgium left to defend – it’s nearly all in sand bags. Rats very bad and running about like young kittens. \n\nNotice up in trenches on bays:- \"Anzac buffet – Iron rations obtainable here. \"Grand concert tonight. Admission Gentlemen free. Officers 5 francs\".\n\nBunk 0000\n\nFrance Firing Line \"45\"\n\n26\/4\/16\n\nDawn at 3.30 am. Stood to arms until 4.45, the enemy sniping being very brisk. Inspected firing line and found all correct. Some new reinforcements having their first experience of active service Passing one dugout I saw a form suddenly shoot out – I shrewdly suspicion it was propelled by a sergeants boot – and stood blinking and looking round. Roused like hell at the poor beggar for not being out on his post but the dazed look of the fellow’s face made one feel rather sorry for the new chums first rough trench wakening.\n\nLovely spring morning – a Taube flew up and down and our aviguns put some shells very close and he turned tail and made off – very unlike ours who take no notice and finish their reconnaissance however badly bombarded. Very pretty upaloft made of some transparent airlike substance. Trenches very dirty and require a lot of cleaning up. Party on lowering exposed gangway at communication trench. \n\nAt about noon our artillery commenced a bombardment of the enemy trenches about 3\/4 mile on our left and the flash and fire of bursting shells was thick among the trees there. The enterprising enemy rose to the occasion and responded in kind, shells following each other in very close succession and crashing into and around buildings near Bois Grenier sending up showers of dirt. Noticed that the shower of debris was visible while the scream of the shell and its subsequent noise of explosion followed. A good example of sight being faster than hearing. \n\nSome of the stuff they put over was very heavy. Rigged up a periscope by means of which it is possible to sit at ease on the forestep and focus field glasses on the image of the opposing parapets. \n\nToday being a lovely day the skylarks are very busy singing and fierce argument rages as to whether they are \"imported birds\" or not. Fare very much better for food here than in Gallipoli for lunch today stewed rabbit & bacon bread butter, jam tea, boiled rice and preserved fruit & condensed milk.\n\nVisited Jay's Post at 3.30 and had a look at enemy’s trenches through glasses. Sniped at, at the head of communication trench. Inspected JAYS and returning had the narrowest escape of death one wants Walked along the trench a shell burst directly in front wounding a machine gunner. Dropped down just as another burst overhead and the shrapnel splashed alround. Crept along and joined four men crouched up near a trench pump meantime four others burst before one could breathe almost. Reached firing line passing stretcher bearers on the way.\n\nAfter tea received orders for a stunt planned as follows. At 8.15pm stand to arms again at 8.20 a gramophone placed on parapet was to play two loud records and to still be going strong at 8.30. The idea being the novelty would induce the enemy to listen with heads over parapet a little more than usual. Suddenly at 8.30 two flares were to go up and simultaneously all the machine guns (laid dead or during daylight) were to suddenly sweep the parapets and each man here was to fire two rounds rapid dead in. We would surely have killed some. All men were warned and eager for the fray when orders arrived within a few minutes of the stunt cancelling it. Most damnably annoying. I cursed for about 10 minutes and then calmed down a little but these d. contradictive orders get me raging. Very heavy bombardment towards ST. E201 we could see some shells blowing.\n\nGems\n\n1.\t\"There’s a furphy going round the Turks have chucked it & joined the Allies\"\n\n2.\t\"AW: that’s nothing I’ll give yer some dinkum. There was a black baby born in Russia three years ago and the little b------ never talked. The other day it sat up and told its nurse the war would finish in June. Then it dropped dead:\"\n\n1.\t\"AW: Gawd struck the \nlittle\n b----r dead for telling b----- lies!\"\n\nC.O.:- \"You’re charged with drunkenness. Were you drunk?\"\n\nTucker Vienna:- Oui! Oyi! \n\nC.O.:- 28 days F.P.N.Z. Compree?\"!\n\nRout:- What’s their game, wotcher do it fer Sir, I ain’t no bomber I’m a slaughterman I’ve had no edu-b-acution.\"\n\nMcCormick:- I’ll show yeu I’ll march yeu yards any time yer cow’. I’ll carry \ncaut\n two blankets to your one and pack up, and march the b----a---- off you:\"\n","36":" Some of No. 10. having breakfast and sniper sent bullet right through sandbag scattering dirt on their food \"You inconsiderate b------, wait till after breakfast yer cow\".\n\nRout:- (Referring to tommy tunics) \"They’re too short, they’re too short after wearing them loung Orstralian ones a feller ‘ll feel it across ‘ees loins. Why when yer bend, the waist of it does for a collar\".\n\n\"Squeaker\" Dyson of No. 10 platoon has a high falsetto voice and is a constant visitor to sick parade. The other day attacked by nose bleed he was going round with nostrils plugged with cotton wool.\n\nO.C. \"Hullo, Dyson, what’s the matter now eh\"?\n\nSqueak: \"Oh. Sir, me nose won’t stop bleedin’. I been to the Doctor & ‘e says its too much rich food but I’ve gotter pain in my shoulder & carn’t eat!\"\n\nIt was an awful night and soaked and cold the men just off duty turned to their dugout, one entered and encountered the beady eyes of the filthy, corpse eating rats who infest the trenches. One glance was enough to tell him that the heavy rain had flooded their dugout and the blankets were afloat and muddy. His trite remarks reached those outside\n\n1. \"What’s the matter Bill? What’cher grousing erbout eh?\"\n\n2. \"Au’nothing! Did yer ever hear ther song \"When their Sunset turns the Ocean’s blue ter gold?\" Yaors: why:\n","37":" \"Aw’well, orl yer \nwant\n here is ther Sunset!\"\n\nCorporal: \"What are you doing down here again\"\n\nPte : \"Well I was told to come down for something\"\n\nCorp : \"Well I don’t want you\"\n\nPte : Well, he don’t know what ‘e wants but I’ve gotter obey Him\".\n\nThe \"French\" of our men is very funny. One chap completing a march with heavy pack up and all his gear and then having to start pick & shovel work flings down his load with this remark – \"Promenade new bloody bong!\"\n\nFrance Firing Line \"45\"\n","38":"\n\nAwakened by Mackay late for stand to owing to a misunderstanding so did not inspect as usual. After breakfast went down to where Thurlow has a telescope sticking over the parapet and through there had a look at things located a working party digging a trench and advised artillery. They could not see and owing to my setting my map magnetic instead of true north their shell went ½ miles to left. Worked out square lateral and advised them but by this time the enemy were dug right in out of sight.\n\nThis is where they lick us. We should have an observer from the battery in our firing line who could switch sig right on to the exact spot as soon as winking as blow them out. They do it to us and yet this morning it took 4 hours before anything was done and then all was over. An artillery man who knows his map like a book is wanted. \n\nJust before lunch received word that Buckley had been blown to pieces by a bomb at the bomb school – a dreadful thing that no one seems to know how happened. 11 others injured. Today is a warm close day and looks like more rain. Had a good look over parapet through my field glasses at the enemy firing line and could see the top of an occasional head and moving periscope there, but gazing over in that manner is highly dangerous pastime. \n\nVery busy working in firing line improving duckboards and making dugouts shell proof. Padre called in for lunch and left some papers he bought in Armientiers this morning. Le Petit Journal & Daily Mail, La Vie Parisienne is not in his lines. \n\nMembers of the","39":" Battn round today, preliminary to taking over on Saturday night – rather a coincidence that we relieved them at Gallipoli – guant haggard men then of a stricken battalion of only 300 men.\n\nVery quiet until stand to at 7 pm when I inspected and found all correct along the line. Stood to arms once more at 8.15 pm ready for demonstration as arranged last night and punctually at 8.30pm up went the flares. All blazed away then with great noise but only very feeble response was elicited. Some very bright flares went up and a little extra sniping carried on at 8.50pm. Turned in at 10pm settled down to quiet night. Suddenly our 18 pounders started dropping shells at 1015 on enemies firing line and supports. Strolled along and asked nearest sentries if they could see anything but they said \"no\". Could not help laughing as the beggars had their heads down so low in safety they could see nothing. Took a look over the top and the shells from our batteries came so thick the affair developed into a stunt. \n\nSignaller met me and gave gas alarm from Batt. Fourth on our left. Stood all to arms and donned gas helmets. The enemy replied to our artillery and a terrific bombardment enraged. All this took place within 10 minutes of my first turning out of bunk. The men behaved splendidly falling quietly in at their posts all muffled up like divers groping about in the dark nearly unable to see through the little glass windows. All the big guns were now properly awake and the shells rocked the ground with their concussion the air full of smoke and the din indescribable. Shrapnel from shells just out in front cleared the floor of the dugout. It was lovely. Slackened off at 11 and entirely ceased at 11.15. Our telephone wires cut early so got on through artillery. Felt very anxious for Jays Post but all were safe there though terifically shelled. A good stunt all enjoyed it the men are splendid & got into their gas outfit well. The whole show lasted one hour – it seemed no longer than 5 minutes. Turned in at 12.15am – All quiet and serene. No casualties in this Coy. but total for Regiment to date is 1 killed 3 wounded. \n","40":"\n\nFiring Line 45 France\n\nStood to arms at 3.30 and inspected the firing line. All in great fettle after the engagement last night. After breakfast went along to snipers position and through telescope could see that our guns had severely knocked about the German parapets. In places breaches had been made and we could see the men there passing with head and shoulders visible. Some wearing their steel helmets and others the round sailor caps. Some","41":" Battn. People up all very quiet today.\n\nLovely spring weather with singing birds. A bit of bombarding at aeroplanes late in the afternoon. We rigged up a platform for a French mortar firing a 60lb luddite shell which is to bombard Corner Fort and arranged all details. At last moment we found that only 10 friction tubes had arrived which reduced programme by a quarter. Arranged an elaborate system of arcing parachute flares to deaden or conceal flash of mortar.\n\nAt 8.30 the show started by trench mortars and rifle grenades opening on Angle Fort they got well home apparently. The big 2\" mortar was a failure and its bombs burst either in No Mans Land or close to their parapet about 200 yards from the objective. One, indeed short fused burst in the air close in front of us and its explosion shook the very earth. Ordered it to cease fire. Within 5 minutes the enemy retaliated by heavily shelling us, the bursts occurring in sheets of fire about 100 yards out. Their barrage is thereabouts and they have another of heavy stuff further back. \n\nLittle Sanderson was killed last night in \"A\" Co by shell and they say he was worse knocked about than anyone we have had yet.\n","42":"\n\nQuiet. After breakfast men changing old tunics for Tommy ones which don’t look bad when buttons are changed. Saying to each other \"’Ullo chum, ave yer gotten Woodboine\" \n\nLooking through telescope espied a German gun emplacement only about 500 yards in rear of their lines probably a 77mm and where the shells last night came from. Fine sunny day but a strong wind blowing direct from the hostile position causes us to be very alert in case of gas attack. \n\nPaid most of the men today . All very keen about the leave – picked 5 for British leave (8 days). Ordnance have tightened up their regulations regarding clothing and equipment the last few days and today has been a regular nightmare calling stuff in and issuing others. Things have been awfully slack in this regard previously thanks to an inefficient QM who absolutely neglected his work. After removing brass buttons & sewing on bone ones the English tunic does not look so very unlike the Australian article. Our hats are the distinctive dress – gay and insolent and it is hoped we are allowed to retain this distinguishing mark and that our Australian uniforms soon come to hand again. \n\nA general feeling exists that it is unpatriotic to wear any other but Australian stuff – a good feeling to see. Censored letters after tea, Birtwistle writes well. ‘In this open life under the broad heavens one instinctively becomes somewhat of a pantheist and when in Gallipoli at times worn & shaken I used to go to quiet ledge overlooking the depths and be alone for a while under those wonderful skies, returning to the trenches a new man calm & steady. The open spaces are always with us and the same stars that used to comfort and solace me here can be seen from Collins St.’\n\nAt about 10pm our patrol returned and it was amusing to hear them discussing experiences. They went right up to German lines and say there seemed few there. One German sentry was whistling \"Yip-i-adds quietly on his post. Cessation of fire give show away so had men firing up in air.\n\nFiring Line France \"45\"\n","43":"\n\nAwakened at 1am with urgent messages of gas attack on our left and took precautions to see that all could be turned out at once. Another message at 2am told of deserters saying gas attack probable at dawn so turned out at 3.15 when lemon colour flush of day break first showed up. It turned out a lovely morning beautiful warm sun, not a breath of air and the songs of larks and other birds sounding all round.\n\nA Taube over our line about breakfast time so made all keep still. This attempt to reconnoitre further back was frustrated by our shells. Made of some transparent material the planes are hard to see. \n\nAn extremely quiet day with practically nothing doing. Let the men rest all day as they have to march about 8 miles tonight. In fact relief will not be here until midnight I think and we shall be lucky if we get to bunk before dawn. The enemy made a gas attack near Armientiers last night and tonight after tea a very heavy cannonade commenced which continued some time. \n\nThe rats are a pest here with their filthy beady eyes and gnaw through the men’s haversacks and eat the biscuits of the emergency ration. After an action they grow fat on ghastly banquets of the mouldering flesh of the corpses. \n\nStand to arms is a solemn business, everyman stands up at his post silently with full fighting kit on and with bayonet fixed. I walk round with strict look and pounce here on the unfortunate whose gas helmet is missing and here on another who only has 4 instead of 5 cartridges in his magazine. They stand like rocks till an hour or half perhaps & then the \"carry on\" relieves the tension and those not on sentry turn in and sleep with full kit on at the feet of the others ready in an instant to spring up on the alarm.\n\nThe other night the enemy put over an aerial torpedo and it brushed past the upturned side of a gunners hat tearing it but not hurting the man then plunging into deep mud and bursting . Sounds incredible but actually happened.\n\nA very quiet evening in the trenches. We were relieved by the","44":" Battalion about 11pm and then moved out through the communication trenches for Rue Dormoire. The evening was very close and the march with full packs and blanket up was most fatiguing. Reaching the road near our old billets a message arrived to have respirators out for gas which was being used at Armientiers. Comment noted that in the last stages of fatigue consequent upon long marches the action of the brain becomes dull & a detached feeling ensues.\n\nLarge drops of sweat drop from the head and splashing on the hand one instinctively thinks it to be blood and hurriedly examines the hands. Reaching Fleurbaix No. 10 under me took the wrong turning and went about 3 miles down the wrong road which brought us very close to the trenches again. Sgt. Watkins guided us back. A wretched misfortune this 6 miles extra for tired men with full packs. Dies irae! Dies irae: & also unfortunately mea culpa, mea culpa, mea maxima culpa. \n\nRue Dormoire near Erquinghem - Lys\n","45":"\n\nReached billets here at 2.15pm and turned in. This place is about a mile south of our original destination Jesus Farm. The house is a large brick one, being comfortable and old (1659 is the date above the door) and our whole battalion is quartered here in wooden huts. The officers huts are in an orchard full of blossom and birds \"and the chaffinch sings on the orchard bough – in England now\", it was April that Browning was thinking of too. \n\nGot up at 9 and had a short order reading parade. Shells seemed to be going about in the vicinity and a good aerial bombardment took place. After lunch we fell in for drill 700 in a small paddock only 8 miles from the enemy artillery as they sent up an observation balloon we ceased drill. \n\nThis has been a fine old farm and boasts some lovely trees in its courtyard. The country seems to grow lovely every day and we dined in the open air under low laden fruit blossom boughs. A languid spring feeling is in the air.\n\nIn Le Matin today we read of the fall of Kut surely the final disgrace to British arms. Had they sent us Australians there instead of to Sinai desert we surely would have forced their hands in the open fighting and prevented such an awful mess up. Our French interpreter a very decent chap and puts up with as much bad French as you can fire at him. \n\nSanitation is shockingly neglected by the French. The household latrines are septic arrangement and consist of a deep well which is never cleaned out and in which the matter decomposes, The household pump is upon another well driven in close alongside. The slops all drain into the manure heap in the centre of the yard and lie there in scumming putrescence. \n\nIn the morning we proceed to the baths for a wash and in the afternoon will probably get fatigue parties to hold off to work all night. Am looking forward to a sleep tonight having not had a proper rest for days now. We have our meals out in the open in the orchard among the fruit blossom. The old trees are close together and fine old elms encircle the place. The house itself is of the usual quadrilateral shape and is encircled by a moat on three sides. It looks very pretty and quite as old as it 280 years, embowered in the green and pink of tree foliage and bloom. Crowds of birds all round sing all day. The fields ploughed and sown come right up to the building. \n\nWe are about half an hour from Erquinghem. Other snug farms surround us. In this place is a sort of canteen where eggs biscuits fruit &c are for sale and beer can also be obtained but is said to be a watery nature and not strong enough for the Australian seasoned palate. Very tired for want of sleep so turned in early and knew no more until break of day.\n\nFrance. Rue Dormoire near Erquinghem - Lys\n","46":"\n\nUp at 5.30 and arranged men’s breakfast at 6.15, left at 7.15 for the Divisional baths at Erquinghem in platoons in file at 2 minutes interval. Arrived there, after a pleasant sunny march and enjoyed hot baths. Soaked luxuriously in the water and had breeches disinfected. New clean underclothes were issued in lieu of the old ones. At 11.00 the company fell in for a rifle inspection and the platoon officers took their NCO’s & coached them upon the afternoons work based on a syllabus drawn up by me. Fell in again at 1.30 a dull afternoon and first of all made all sprint 100 yards down the road then carried on with a varied afternoons work.\n\nThis place was looking delightful green and quiet to the eye lovely green hedges and trees. The enemy sent over some very large shells during the afternoon hurtling over with hissing sound. A little rain, after parade met Major Matthews and set out to walk to Armientiers. A fine town but very deserted. The approach is via old roads and the Rue de Lys leads right on to the heart of the city. \n\nA fine park is now a mud trampled waste bare of vegetation and a mere bog from cavalry horses. Further on we passed a fine public school where soldiers were billeted and calling in at a few shops eventually reached the market place in the centre of the town. The town hall is an old picturesque building which has evidently been remodelled and added to. The date 1485 appears on the outside and I should say the greater part is of that age. 1746 & 1880 also appear possibly reconstruction dates. In this deserted place we saw utterly what it means to have \"grass growing in the market place\". There is quite a fine crop here and buildings are all knocked to blazes with shelling.\n\nProstitution is very rife most decent people have left, one is assailed by little boy touts who run up \"You want mam’selle\", \"I show you officer’s place\" – so on. We saw some fine banks & other buildings all closed & the deserted post office is a shattered wreck.\n\nHad a fine diner at \"Au Bouef\" with good beer but \"poulet\" was high, cost francs 5. Called in at a shop to buy some papers and the charming salesgirl produced a great array of indecent suggestive postcards and delated charmingly on the hot stuff \"Look monsier, femme couchez\". At another shop tried to buy a shirt but mademoiselle wanted 16 francs for it and another appeared and were prepared for amorous dalliance. We left them.\n\nThe place has been deserted by everyone decent only the dregs remain and it gives one the blues to see the weeds growing up in the streets of such a fine city. Returned home 9 and received orders to move off at 4 am.\n\nBed 1045.\n","47":"\n\nErquinghem & Armentieres\n\nReveille at 3am and had a cup of tea. Moved off in alarm order at 4am. Everyone wearing steel shrapnel proof helmets covered with sandbag to neutralise color. Round unsightly things the sandbag adds to the odd appearance. Mine must have looked extra funny as I had many queries as to how my banana plantation was looking! Very heavy upon the head until one gets used to them but the protection to the head from the shrapnel bullets is very great.\n\nDrew tools from factory and steering by the map made for a set of trenches two miles in rear of firing line. Sat down there at 5am and had breakfast. Delightful old age warn farmhouse dated 1634, its gable surmounted by a weather vane shaped like an angel. Partly destroyed by shellfire, indeed all places hereabouts like Armentieres are partially gutted. \n\nGot to work at 6am digging and improving trenches. Luxuriant green grass everywhere and feet soon get wet walking through it. Buttercups and other wildflowers spangle the grass thickly. The hedges (now in full leaf) are breaking into may and hawthorn blossom and scenting the air with their delicate perfume. The trees have put on great coating of leaves but many are still bare – every fruit tree is a miracle of beauty with the most delicate of blossom & cherry almond & others.\n\nWent with my Sergeant Major (Yeadon) up to my night alarm positions (about 1 ½ mile behind firing line) and find the trenches full of water and canvas screens out. Sent the platoon commanders over the ground to facilitate any night advance. Men in alarm order carry pack with great coat rations 2 sandbags extra ammunition bombs & steel helmet. Content of packs stored in sandbags left under guard in billet. \n\nEmergency roads run across meadows and along the country lanes delightful little scenes are seen. The railway skirting Armenteires looks deserted and runs direct through the German lines. Fringing the town are trenches. The city factories were sending columns of smoke but drew no shells probably because theirs are the same as & retaliation would ensue.\n\nHeavy shells passing over all the morning. Down tools at 11.45 and left for home at 12. All new earth was disguised by scattering cut grass over it.\n\nThe fields are intensely cultivated and ground carefully rolled & scarified to fences but the pruned willows cut right back to their thick stumpy bole and running along every ditch probably mark the boundaries. Saw a long 4.7 gun with caterpillar wheels in a shed. Reached home very tired.\n\nWhat a lovely green beautiful land this is and what a fool thing the war seems. After lunch went to bed and slept until 5pm. The enemy putting some very heavy stuff into the surroundings of Erquinghem. In the morning we leave again on the same job and hope to get more work done. A good many men have diarrhoea very badly and some also have bad boots.\n\n4\/5\/16\n\nErquinghem & near La Chappelle D’Armentieres\n\nRevielle 2.45am and while still in bed my batman brought me a hot dish of liver & steak and tea and bread. Moved off at blush of dawn 3.55 and drew shovels at the usual place. Across country to our task at the halfway house and all hands got to work with pick and shovels doing improvements and drainage, deepening and making dugouts. \n\nWent over to Rue Fleurie & Rue Alec with Britwistle (\"Age\" reporter) as my orderly and went over the trenches there sketching and deciding upon alterations to be made. Peeping out of a brasserie hereabouts among ruined brickwork is the wicked muzzle of a 4.7. The distance to firing line is about 2000’ and canvas screens are much used being painted to resemble trees and buildings. Some shrapnel shells landed round. \n\nAbout 7 returned across the fields skirting Armentiers where civilians were busy on trench digging. Across fields of shooting corn peas &c and sat down for a while watching our antiaircft gun potting at a Taube. A big gun was firing very heavy long range shells well over. The report could be heard and then 40 seconds after the shell explosion. Why do big shells hurtling through the air seem to go in spurts. Anyway the sound of their progress as it reaches us consists of distinct jerks,\n\nIt was a very pleasant morning & good to listen to the circling skylarks. About 7am a pretty stiff bombardment was in progress into the city. There was a large sick parade today but those men I had out did good work. Before we left at midday, all was concealed by spreading cut grass over the newly turned earth.\n\nBeached here for lunch at 1 and afterwards all turned in for a sleep. The number of details of our Coy. are extraordinary. With sigs, scouts, m.guns, bombers, cooks, sick orderlies, guard &c out of 221 men only 136 are available for parade. All wear steel helmets at work all day and the weight on the head is considerable. Wearing one continuously for 8 hours today has given me a pain in the neck.\n\nThe quality of the draughthorses and the cows we see here is excellent. The cattle are hand fed in stalls and well groomed. In a field today saw men threshing wheat with heavy wooden flails worked dexterously by a turn of the wrist. Also saw two large hares running along lush green grass and trees here. One throws oneself down on a sward of grass 4 to 5 inches high scattered thick with buttercups and other wild flowers some of which we cultivate in our gardens.\n\nEnglish, Australian mail to hand today. The only biscuits obtainable here are Petit Beure and cake is a rare commodity in La France. \n\nNew scheme for work tomorrow doing it by half companies 7-1, 8pm-2am. Spent part of the evening and afternoon construing the vivacious of \"la vie Pariesiene\". Those returning from Armentiers have great collections of art studies sold with rare descriptive talk by the shop girls there.\n\n5\/5\/16\n\nRue Dormoire\n\nReveille 4.45am and two platoons left at 6 for the Halfway House. Breakfast in bed at 5am rose at 7am and set out on bicycle for the spot. Reaching the AMC Depot just before laundry 6 inch shells started landing pretty close and splinters coming over menacing and went inside. Found Bruce King there mortally wounded. As he was breakfasting a splinter tore a hole large enough to take a clenched fist in his back & tore away the backbone. He was sent away in Ambulance quite unconscious & died soon after – one of the best.\n\nThe Germans proceeded to give this spot hell searching for a battery, sometimes two screaming shells landing at once and one always in the air. Had a whisky with Imperial Artillery officer and meantime a shell set the house on fire. They continued to plaster the place but no other casualties resulted. \n\nThought of making a dash but the Artillery fortunately dissuaded me. It turned out afterwards the shells were only 10-15 yards from the road. Working on the map made a detour which however did not secure one from occasional whizzing splinters. \n\nAfter looking at work done went over to Rues Allee & Fleurie with the Colonel. Returned by cycle about 10,tres fatigue being so very close & warm. After lunch went to the funeral of poor King. He was buried in the churchyard of the old church at Erguinghem, sewed up in a blanket. The corpse lowered by ropes passed under arms and about knees and gently put down. An ugly red splotch upon the stretcher showed where the blood had soaked through the blanket. His face was calm like one asleep.\n\nWe went into the old church afterwards but the interior was disappointing being all new. Noticed statues of Jean d’Arc and St Michael on either side of the chancel. The churchyard like most French churchyards was quite disfigured by the old tawdry wooden crosses. We saw a rare stone tombstone. These wooden crosses are elaborately made of board with a round top painted with flourishes and all inscriptions commence \"Ici repose le corps de ----\" and add that the decd. died fortified with the sacraments. in the way of glass cases of flowers are common and no dates old than about 10 years were noticed. Do they dig up the ground again after a few years for other burials. \n\nAfter went with Doctor for a cup of café and prattled French for mademoiselle. Local people confirm German . At about 8 a violent bombardment commenced & continued without intermission for an hour and a half. The gas alarm was sounded and all hurriedly donned their helmets ready for the fray but a message soon came along saying that there was none. All stood\n\n5\/5\/16\n\nRue Dormoire\n\nin their billets with full gear on ready to move at a moments notice. There was some very heavy rifle & machine gun fire and green alarm flares were frequent. Our guns opened up in response to theirs and generally there seemed to be merry hell round the trenches.\n\nHad intended to go down to advanced post but the bombardment made me stay here instead. Some rain tonight and strong wind. Those passing the scene of King’s death and this mornings bombardment, saw tonight a woman in black with her little orphans, sobbing over the ruins of what yesterday was her happy home. Now, a smoking heap of debris. It is cruel, first the man of war takes herfrom it is her home. \n\nMy men are at their best in the firing line, there everyday. I have funny sayings to go down and there is great willingness and individual enterprise shown in all they do. At present no one is enthusiastic at this pick & shovel job, - ½ the men working all day and the balance all night. Up to date our men have learnt two French phrases which they air upon all occasions \"\", \"Compree\".\n\n6\/5\/16\n\nAfter breakfast went down to the trench and stayed out until nearly lunch time supervising work there and siting new trenches. Rode down on bicycle. A very quiet morning. After lunch went down to Rue Fleurue with Dr Craig and had to pull up to wait until shrapnel ceased. Tested water down there with an interesting chlorine test using iodide of zinc for the reaction. It is proposed to put 4 platoons down here for work and in my humble opinion is most injudicious. It will be interesting to just wait & see Mackay and his platoon go down at 9 tonight.\n\nElmigler is transferred to \"B\" Co. Thomsen comes to me as my second in command. The German artillery is good. If not able to definitely locate a battery on the map but only get approximate square they proceed to bombard the square aforesaid landing the shells methodically in this manner . The lines are quite as even as this and the result is that they cover every inch of the square in question.\n\nIt does not follow that they knock the gun out though they may kill all the crew. Only a direct hit on the gun is effective.\n\nAfter tea rode out to the Halfway House again stopping on the way to order a British Warm (overcoat). Only 26 men out on the entrenching job and it was so dark nothing could be seen. Quite a force going out. The C.O. in at Armentieres tonight again.\n\nBed 10.45 \n\n7\/5\/16\n\nArmentieres\n\n7\/5\/16\n\nLeft about 8 for Half Way House and rode there on a bicycle. Went over the works there and then moved to Rue Fleurie where 220 troops now are. Found all my men comfortable there. After walking round with the C.O. cycled into Armentieres and an Australian nurse in an ambulance car hailed me with a query about the location of a place. It was a treat to speak to a nice girl. Went into one or two shops but saw nothing fresh beyond what we saw last time in there and rode home to lunch. Very quiet drowsy day and nothing doing. It is Sunday by the way. \n\nIt now seems with regard to the heavy shelling of trenches the other night that 100 of the enemy came right over and took 2 Stokes guns out of our firing line and some prisoners also. No one knew anything about it till our signal service stopped a German wireless telling of it. It hardly seems credible.\n\nQuiet evening here.\n\n8\/5\/16\n\nCaptain of the day after inspecting the billets accompanied Dr Craig upon our tour of inspection finding \"B\" Coy the very model of what a billet should be. Then to Rue Fleurie and he examined the sick there. Remarkable varieties of ills here putting his finger into the mouth of a neuralgic patient here examining a case of piles. \n\nWork proceeding satisfactorily on trenches so returned home through the town. Some establishments bear the sign \"The Grand . \"The Resort of the Boatmen\". Great appetite for lunch. The doctor one of the most witty & dry Scotchmen. \n\nGreat disgrace the loss of those Stokes (guns) which were being so carefully guarded. Saw General Birdwood who flies a small Australian starred ensign upon the front of his car.\n\n9\/5\/16\n\nA very quiet cold wet day. In the morning went out late to the task and found very good progress had been made last night on wire & on the communications trench. Returned and stayed about all day. 50 men extra (all my party usually on night work) went tonight to Fleurie and did wire work there, sent Thomsen with them.\n\nAn artillery officer told me the other day the Germans were shelling our people and one bald headed old Hun stood right up to see where his bomb landed. Just at that moment a shrapnel shell caught him fair in the chest. They have scored some good hits lately judging by ambulances seen. In the Stokes gun raid they used maces and clubbed all our wounded to death. We do the same it being too dangerous to leave any men wounded behind you in the trench.\n\n\"The Boys\"\n\nA popular song :- \n\nAfter the war is over\n\nAustralian Soldiers go away\n\nMademoiselles of Roguetour stay & weep\n\nAnd nurse the babies.\n\nShrapnel coming over an officer gave the order \"helmets\" so steel helmets could be donned, One said \"does he mean gas helmets?\"\n\nHeard on the march – a column of Australians passing one of \"Scotchies\" both fairly merry\n\n\tAust. \"I’ll swop yer caps Jock\"\n\nScot. \"No b---- fear you won’t! Pause \"I’ll sworp yer b----- paybooks tho’ laddie\"\n\nIt was a shocking wet cold night, the barbed wire party were at work under fire behind our trenches. It was pitch dark and the only light was that given by the enemies flares. One chap fell into a deep ditch with high slippery sides & could not get out in the dark not being able to see where to climb up. This was his prayer intoned in a supplicating tone as if offered up by some altar. \"Fitzy you b-----rd: send up a b----- candle for C----- sake.\n\nThe same night Thomson was out & heard two men talking in the dark\n\n(1) \"What officers have you got out with you?\"\n\n(2) \"Skeenie & Thomson are here\"\n\n(1) \"And a pair of b----- beauties they are too!\"\n\nA popular song. (Hymn tune \"On, steadily on!\"\n\n\t\"I want to go home, I want to go home\n\n\t\"Machine guns & mortars they whiz & they roar\n\n\t\"I don’t want to go in the trenches no more\n\n\t\"Take me right over the sea\n\n\t\"Where the Germans they can’t get at me\n\n\t\"Oh: my: I don’t want to die\n\n\t\"I want to go home.\n\nHeading on top of a letter written home by one of the men :- \"Somewhere in France where they shoot iron foundries at a bloke\".\n\nIn conversation about rations and ridicule currant issue in lieu of jam, Thomsen suggested they issue acorns!\n\nErquinghe & Armentieres\n\n10\/5\/16\n\nAfter breakfast went down to Half Way House and had a look at the work there. Met my batman with clean clothes at corner of the road to the Baths and went up there and had a luxurious hot bath. A very opulent resort. Lounged around until after lunch and at 4 pm left with Major Matthews for Armentieres and soon found ourselves near the Town Hall the old roof and clock tower of which seemed to have received fresh damage since we last saw them. \n\nVisited various shops and found the shop girls in some of at least doubtful virtue. Small boys approached us in the street with cries of \"You want mademoiselle\". Just round corner to a large well built church dated 1842 and went in. It was beautifully appointed inside and the fine stained glass windows all bore traces of shell fire. Some of the faithful came in, an attendant lighted the altar candles, the priest followed and commenced a service. All within a very short distance of the trenches, the clash of antiaircraft guns bombarding a Taube reverberating all through the building.\n\nWe made off past this church and seemed to find in Rue de Jesuits and older portion of the town one house dated 1722. Did some shopping in the main street and had afternoon tea at a special quiet place for officers. Went for dinner to \"Au Bôulf\" and had same in the upper room hors d’ouvres, pork cutlet &c. No pudding in France. \n\nWalked well round again. All banks closed including Banque de France, Credit Lyonnais, Comptoir National of Paris. Bought La Vie Parisien and a novel from a sprightly girl in and Estaminet who also sells art studies and postcards of a very hot nature and very animatedly points out all the special points of each picture. The town full of troops most of them Tommies and after dark became lively with wheeled transport flares going up from German trenches all around.\n\nLeft for Half Way House and Rue Fleurie going over the whole battalion ground and seeing all working parties on their jobs. Kept busy answering sentries challenges.\n\nBed 12.\n\n11\/5\/16\n\nAn extremely quiet day in all ways. Slept in until late in the morning and then made arrangements for relief of men at Rue Fleurie. Paid all those in camp during the afternoon and of course it was inevitable that about 16 imshied before marching off. Skenesmith went on leave and we gave him a send off drinking his health in the Champagne of the country which is fairly good stuff. C.O. on a Court of Inquiry re the Stokes Guns, rumoured we are going into the section of trench just in front of Rue Fleurie. \n\nMounted at 6 pm as orderly officer for the Battalion. Trying hard to learn French and spend a lot of time with the dictionary.\n\nErquinghem – Sur. Lys\n\n12\/5\/16\n\nA most quiet uneventful day. Parties out on fatigue. Visited wire parties at night and also inspected my Fleurie House people.\n\n13\/5\/16\n\nVery wet last thing and the men had a rotten time working. Went out with evening party who had a very tiring four mile passage the latter through heavy mud which nearly exhausted ones. On the trench Bazeley rejoined us with his Fleurie party and having seen them well settled down returned home.\n\nSome strafing going on near to Houplines. Very vivid gun flashes. On the way down we passed the detention compound where some of our Australian soldiers were tied to posts with their hands strapped over their heads. This is a form of punishment very repugnant to Australians and livid were the men’s comments vented on some unfortunate Tommies standing near. \"Tying b----- men up\". \"They wouldn’t do it to me\". \"Poor b------ds\".\n\n14\/5\/16\n\nExceedingly quiet day. Stayed in all day and went out at night to the trenches. The Germans had a very large searchlight at work. In broad daylight a train steamed briskly in and around Armentieres.\n\n15\/5\/16\n\nStayed in all day. After lunch sited some trenches round the billets for protection against shell fire. Thomsen in all the afternoon and we yarned of sights seen since leaving Australia and between the two of us have seen some funny people and had some quaint experiences particularly in Egypt. He was most amusing by his talk and mimicry. \n\nAfter tea went out with the barbed wire fatigue 55 strong and saw them well at work when Bazely returned from Armentieres & took over. Not a bad night at all, things quiet in the trenches but there was some rumouring of artillery on the left. Erquinghem very quiet after 8.30 when all the soldiers returned to their billets. It is a funny old place and no doubt has seen many sights in its time.\n\nAn old looking shrine is erected in the main street and beneath is a recumbent effigy – very roughly done. The chimes are very faint from the church. We are fairly comfortable in our billet here, but the night fatigues week in and week out without rest are very tiring. \n\nYesterday was Sunday but none knew it. From dark until midnight the roads echo with the rumble of transport wagons going their rounds. They work all night and sleep all day.\n\nBed 1030.\n\nErquinghem-Lys\n\n16\/5\/16\n\nA fine spring day, and an easy day for the men, digging trenches in the ploughed field near the billet. Aeroplanes fairly active and some big shells pitched in not so far from us. Our big observation was up close by and the observer could be plainly seen in the basket. Skylarks mounting in circles with a \"banking\" movement sing all day.\n\nCommencing at noon I made a searching inspection of every man looking at ammunition, rations and alarm order generally. Curnow returned about tea time and after tea Thomsen had a terrible encounter with the jaw which has been very obtusive of late. A fine batch of letters arrived. Wiring party out as usual tonight.\n\n17\/5\/16\n\nA lovely day again. No day fatigues so carried on in billets. Wonderful where the men to :-\n\nCoy. strength 5 Off – 224 Men – 229 Total\n\nMPs – 2 Light Duties - 4\n\nHQ Cook – 1\n\nBomb school cook – 1 – Exempt - 1\n\nBatt. Bombers – 8 – Coy drivers - 4\n\nSalvage man – 1 – on leave - 1\n\nBde Sketcher – 1 –on leave - 1\n\nBde Typist – 1\n\nReg Eng fatigue – 4 – Duties - 69\n\nSignallers – 9 – night barbed wire men - 55\n\nScouts – 4 – Available for drill – 105 -\n\nMGS (Vickers) – 1 - 229\n\nMGS (Lewis) – 4\n\nBatt orderly – 1\n\nQMs Storemen – 2\n\nQMS & Clerk – 2\n\nCooks, fatigue – 5\n\nSanitary Fat. – 2\n\nPicquet – 7\n\nBatman – 1\n\nOrderly NCO – 1\n\nSick in bed – 1\n\nHospital – 2\n\nOn days when we are the Company on duty these figures are larger. Besides these men we have others told off as platoon bombers, Intelligence men, gas men:\n\nHave also 25 men detailed today to attend a concert by Miss Ann Ashwell and 50 to go for a bath. Went for a bath myself after lunch at the laundry and also save the AMC dentist who said nothing needed doing to my mouth.\n\nInspected unserviceable kit and at had a complaint re rations from No 9 platoon which was looked into. The Army rations cuts things very fine and men feel it short. Certainly at times it is not enough for pick and shovel work particularly when they go & substitute currants for jam. \n\nWord received gas attack the other side of Armentieres & took precaution.\n\n \n\nErquinghem-Lys\n\n18\/5\/16\n\nA lovely fine day the warmest we have so far had and extremely quiet. Nothing much doing in the morning and the war was extremely quiet all day, one would never have known it was on. After lunch some Taubes flew over far more daring than usual and our guns got going on them. Their air coloured material is superior to our white fabric. The village was shelled during the afternoon and the 4.7 gun house was burnt down yesterday.\n\nRumoured that we stay on here for another fortnight. This afternoon the official photographer came round and got photographs of our men. Went down to the job after tea and heavy shelling of aeroplanes was going on so had to take cover against falling fragments of shells. Returned passing busy transport, enemy putting big shells on to it.\n\n19\/5\/16\n\nAnother beautiful day. Aeroplanes were very active and the sky was flecked with the old familiar white flecks of the shells fired at them. All hands enjoyed watching these aerial fights. During the morning heavy strafing was in progress down north of Armentieres. Went out and looked over the work at Half Way House and found all correct. \n\nWent into Armentieres on the return journey and rode on the bicycle through its old streets. What a variety of troops the old Hotel de Ville must have looked on. Dated 1480 and much remodelled since it still stands slightly shell damaged but otherwise intact. Old cobble stoned streets. At Estanune bought some papers & mademoiselle dilated on the various risqué postcards &c by Kirchne and others, and also has some quite up to Egyptian standard. \n\nAttended a gas lecture in the afternoon.\n\nMen’s rations :- 1 lb fresh or frozen meat or 3\/4 lb bully (3\/4 tin), 1 1\/4 lb of bread or 3\/4 lb biscuits, bacon, 4 oz cheese, 3 oz Dried vegetables, 2 oz Tea, 5\/8 oz Jam, 3 oz sugar, 3 oz salt, 1\/2 oz mustard, 1\/4 oz pepper, 1\/36 oz Cond milk, 1\/12 oz Equivalent, ½ lb fresh vegetable = 2 oz dried, 4 oz rice = 4 oz bread, 4 oz dried fruit = 4 oz jam, 2 oz honey = 4 oz jam, 4 oz bacon = 1\/4 tin , 1 lt flour bread.\n\n\"The Boys\"\n\nIt happened at Mouscau. It was a dark night and they had decided to sleep out. One had blankets and the other only had his greatcoat, so they determined to sleep together. This was the dialogue heard from an officers tent nearby :-\n\n(1) \"You take up a f----- lot of room:\"\n\nSilence for 5 minutes but sounds of restlessness\n\n(1) \"Shift you’re a-----!\"\n\n(2) \"I won’t shift my a-----\"\n\n(1) \"Shift your b----- a-----\"\n\n(2) \"I won’t shift my b----- a-----\"\n\n(1) \"Shift yer f----- a----- I tell yer!\"\n\n(2) \"I won’t shift my f----- a-----\"\n\nCrash! Plonk! Biff! The sounds of heavy blows kept up for five minutes as they fought it out with fists.\n\nA pause & they went back to bed.\n\nThen in a most conciliatory insinuating voice came\n\n(1) \"Aw, Frank, shift your f----- a----- old boy. Don’t be a cow.\"\n\n1. \"I’m tired of this ------ war \".\n\n2. Well: it’s the longest job you have ever had, anyway\".\n\nDr Craig suggests for concealment of patrols either carrying out a hole ready dug and getting into it or going out disguised as a sardine.\n\nRout had been fairly tanked all day and put under open arrest for AWL from parade. Pay was made late in the afternoon and by that time he was well oiled. He walked in straight and stood up to attention but had great difficulty in signing the acquittance roll. Having at length completed the operation he stood regarding the poor attempt and then pointing to his shaky signature cast a quizzing look at me and said with a gruis & giggle – \"Gh. Sir (hic) ‘cs a hard case, this bloke\"!\n\nHeard on fatigue work at Boisgrenier – 11.30 pm at night after a hard day\n\n1. \"Eh, did yer hear about our doctor?\n\n2. \"What did he do?\n\n1. \"Old Joe & Frank paraded sick to get out of fatigue and he marked Frank \"D & Y\" (dirty & treatment) but he marked Joe \"P & S\"\n\n2. \"What’s P & S mean?\n","48":" \"Aw – pick & shovel of course\".\n\nErquinghem-Lys\n","49":"\n\nFatigue as usual left early and after breakfast in bed at 5.30 I went to sleep again. Spent morning round the place in the delightful sun and spread canvas over the billet trenches. The enemy shelled our trenches at the bask tearing a very large crater with one extra big shell. A good many were duds. At 3.30 fell all hands in for rapid loading and there was great slackness in No. 9 for which gave them extra drill and roused Craner up. Niel put the acid on but really do not wonder at some grumbling for they are overworked.\n\nAfter tea the night fatigue left for Gris Pot. Went down to Halfway House after dark passing rumbling transport everywhere. Bombardments have wrecked the whole place round the \"clink\" and shattered the place to pieces. One place has had a notice put up \"Shaving & Haircutting\". It was blown to pieces yesterday and another notice runs \"Business as usual during alterations\". Reaching the old house I found all No. 12 lying about having taken the wrong road in the dark. Took them along to Gris Pot and put them on the job there, digging trenches by the fitful light of German flares.\n\nReturned to La Armee which has also been well knocked about and climbed up the dark stairs of an Estaminet to a bedroom occupied by Mackay who was Bde. Advanced line Officer. The old man and his daughter still occupy this place which is but 2000f from firing line and already half wrecked. Just opposite is another place also nearly in ruins which is still inhabited for a home by a woman & children.\n\nSentries challenging along road. Came back across Emergency Road and passed through Erquing again the church chime pealing very softly and the hour striking. The post office and Mairie still are quiet intact and mark the business centre of the village. The whole place at this hour 11 pm was almost quite deserted and our long walk (Smith, my batman came as my orderly) was only broken after this by the challenges of sentries. Our fellows have to this long march & 6 hours pick and shovel work on top of it.\n\nBed 11.45\n\nL’Armee Post\n","50":"\n\nAnother very fine warm day with the unmistakable smell of summer in the air. Parade in the morning for those not on fatigue consisted of rapid loading with and without gas helmets. Most of them had done it in the regulation time – 30 rounds in 60 secs by three goes. In the helmets some look irresistibly comic with the rubber mouthpiece in their mouths. After lunch bayonet fighting and physical drill under Sergt, even this was much relished by all ranks.\n\nSkene Smith returned from leave and also Peart full of expectations. At 7.30 arrive at L’Armee post as the officer representing the Brigade and to take charge of the advanced line in case of alarm or attack. Enemy bombarding in the direction of Erquinghem and our batteries replying from here. The place much shell shattered as also are adjoining farms but people still live on here. It is a rough life with uncouth soldiers about and makes women coarse: one hears young girls using filthy soldier oaths.\n\nAs instancing the unconventionality of these people there is on sale in the shops a beautiful picture of a lightly clad pretty girl injecting morphine into her leg. It is called \"Consolation\". This drug habit is very widespread among the demimonde. While talking to a girl she will make some excuse and furtively glancing round sniff vigourously at a small bottle in her handkerchief – sniffing cocaine. Ether is also used and can be smelt for sometimes after on the clothes after being with the used. An instance of the wrecks it makes was seen by us at Cairo – a shrieking naked maniac locked up in a vomit strewn room. \n\nMy room here is a small one upstairs and decorated with the usual religious pictures. It is a pretty little crossroad this summers night. A drunken civilian is roaring across the road to the amusement of some women. The crops have come on apace the last few days and potatoes are in flower. The grass is luxuriant and hedges all abloom. Twilight is very long and dawn comes early there is only about 6 hours of darkness. The men are being worked very hard & all have a full up feeling. We want to get back in the firing line again. \n\nToday is Sunday. \n\nErquinghem-Lys\n","51":"\n\nAwakened about 6 and started Smith my batman homewards and followed myself at 7. Going through the village found that some heavy shells had cleaned out the Estaminet at Sandbag Corner. One landed in front of Captain Mackenzie AMC and blew him to bits and General Gellibrand was slightly wounded.\n\nLast night an aeroplane painted our colours sailed down in the twilight within 200 feet of the ground over our billet. It was a German we now find out and today they registered the place with peculiar empty shells.\n\nAfter breakfast proceeded over Steenwerck bridge past Jesus Farm to 24th HQ and sat with Forbes Manning and a Yorks. Officer upon a Courtmartial. Tried some serious cases had lunch there. Very pleasant closely cultivated country in places like Egyptian irrigation but with the pretty old farmhouses.\n\nGreat transport activity hereabouts. The great respect our soldiers show to womenfolk is remarkable. Most of them are good women, free of speech, but virtuous. There is no calling out or molestation. During the evening tried a method of concealing the figure of a scout. The contrivance was a wooden frame 5’ x 2’6\" covered with brown paper and irregularly earth tinted. A man walking along holding this in front of him was almost quite invisible within 10 yards distance judged in a fairly light night. The feet as a detached object were visible some 50’ away and the figure of another man walking alongside showed up plainly in detail long after the other had vanished.\n","52":"\n\nOff to Courtmartial again and sentenced our worthy friend Walters to 2 years penal servitude and also heard another case. With such large numbers of offences here the only crime about that we don’t get is bigamy. Paid the men during the afternoon. \n\nMackenzie of the AMC got a direct hit from a shell which so completely blew him to pieces that the largest piece recovered was only the size of his head. At the graveyard they also buried 1 officer & 4 men together so blown to pieces as to just make a bag of odd bits. After the burial more pieces were found and another grave had to be dug. Fatigues having ceased temporally for the present all hands are doing drill instead. \n\nEverything very quiet today and nothing doing at all. We had our meals in orchard under fruit trees that are now shedding their blossom before the growing fruit crop.\n\nErquinghem-Lys\n","53":"\n\nAwakened early by vigorous bombardment at an aeroplane and turned out hurriedly at the sound of a big explosion close by which turned out to be an aeroplane bomb landing on \"B\" Co. billet. Major Forbes rang up to say Courtmartial was adjourned. Went on parade. Gas drill in helmets, rapid adjustment, passing orders, musketry &c. After lunch marched to baths at laundry and all had an excellent hot bath. Things fairly quiet but rumours current of big preparations for a stunt in a few days. \n\nA Taube was overhead about 3 o’c and our gunners are said to have brought it down the other side of Armentieres. At teatime an instructional sergeant major delivered a lecture in bayonet fighting in the new style. It should take on very well.\n","54":"\n\nUp at 5.50 and on parade. Owing to Orderly Sergeant’s mistake No. 12 platoon were ½ hour late in turning out. Roused and gave them any extra half hours drill, making them go like hell until nearly 7.30. Varied syllabus of games, gas drill & bayonet fighting the rest of the day. M. Seigfried our interpreter put in hours conversation with us. After tea went for a walk down to the Riverhys with Bert Swindon. Lovely hedged lanes and green meadows covered with wild flowers, daises, flags &c. Lovely picturesque old farm houses mostly full of soldiers.\n","55":"\n\nParades all day. Work varied – drill, bayonet fighting, physical drill and games, the latter very popular and \"smack a ----\" extremely so. \n\nAbout lunch time Dyett found a German field message dropped from one of their aircraft. A long flag about 3’6\"\" x 6\" had a small metal case attached. This was corked, inside was a letter addressed to Royal Flying Corps stating Lieut B. Basden had died from injuries caused by his aeroplane crashing down into their lines & that he had been buried with full military honours. \n\nThey enclosed 5 photographs showing German soldiers attending the funeral. Smart men well uniformed. Officers on parade wearing all their medals. In fact the thing seems rather overdone and one wonders whether it really is this chaps funeral and not one of some stock photographs. Our officers dying are here shot into any old grave the same as the men. Only an officer gets a grave to himself.\n\nL’Armee Post\n","56":"\n\nReceived orders to move down to L’Armee Post and relieve \"D\" Co. Early morning parade called in one blanket from each man leaving them now only with one each. It is the official summer but all the same it is chilly work sleeping with only one these nights. \n\nCarried on with usual drill after breakfast and at 10 am left for La Vesee to have a look over the ground I am to occupy in case of need. Went round through Armentieres and noticed that the New Z. are very slack. \n\nWent to postcard shop and found mademoiselle in good form and like a good sales girl pointed out the many good points in the goods for sale. Pictures by Kirchnor & Heroweard were also in stock many of them ingeniously indecent and suggestive. Mademoiselle pointed out emphatically where the \"point\" was each time. Through the city down to L’Armee found the billet not s\n\nto bad the officers being put up at a shop and the men in rooms and attics.\n\nReturned to Rue Dorinoire and spent the afternoon asleep. Moved off for L’Armee with the company at 7 and relieved Mackay. All bustle. Transport brought all our gear and rations along correctly. The old dame poured out very voluble French at me explaining her experiences when the Germans were here and what they did. Beaucoup bombardment\". \n\nPosted guards and issued orders prohibiting any lights. Some shells going into Armentieres when we came down and they were bombarding at our aeroplanes. The shells were bursting like big stars spangling the sky but the planes got away alright. There were several up and the bursts looked very pretty.\n\nBatmen got to work again and soon had all comfortable in the billet here. Arranged fatigues. 70 men start work at 3 am tomorrow morning and work till 9 and then another 70 go on duty. 60 men from \"B\" Coy report tomorrow to furnish a third shift.\n\nTook Glasscock off Coy clerk today & put Wherrett on. Transferred Trevena to No 9 where discipline wants tightening up. L\/Cpl Smyth reverts at his own request. The number of cold footers hanging round and the unnecessary waste of troops who never hear a bullet, all loafing about behind the firing line makes one sick.\n\nL’Armee Post\n","57":"\n\nFatigue commenced work at 3 am and shifts of 70 continued all day on new trenches near the Rue de Agretes. Inspected the billets at 10 am and found them rather dirty. Our men got to work on improvements in the way of sanitation &c. All the people hereabouts in their good clothes it being Sunday. No wonder frogs are an article of French diet, - the grass teems with them, both big ones and little.\n","58":"\n\nAt 2 am our batteries started bombarding enemy firing line and communication trenches. At about 11.45 the Germans put over some shells which landed about 500ft away from here. A lovely day, a Taube over fairly early and then ours came over much shelling at them. \n\nRound the billets and over the work with the C.O. Some shells round during the afternoon but otherwise very quiet. Shifts for the fatigues all altered and we now moving 100 men at 1.30 am and they work until 8. Just about dusk the guns had a rally but it died down. \n\nThe work we engaged on is being reproduced from an aeroplane map and is a replica of a portion of the enemy lines it is proposed to raid. The men will be practising over this particular bit until they are familiar with its layout. \n\nTime hangs fairly heavy on the men’s hands and \"two-up\" & cards occupy a good deal of their time. If they get careless and play openly the M.P.’s have to step in. After tea went over to the trench again which is now being very vigorously pushed on with. A big party of the 23rd are also on this job. Six men are said to have been casualties as the result of this afternoons shelling.\n\nReturned to billets and sat down in the shop and talked French to the mademoiselle & the demoiselle there. A good looking wench is mademoiselle of some 21 years and she says she has never been kissed. I have a shrewd idea she has been that & worse. Unfortunately she is \"cockeyed\" and so is one of her small sisters too. \n\nA good way to pick up French is talking to these girls. The elder went to school in Armentieres and finished off at a college in Lille. Her brother is at school at Hazebrouck and her father is there too. She is a \"Catholique\" & repeats the ruling phrase that in France there are many with no religion many Catholique but \"beaucoup les mavais catholique.\n\nL’Armee, Armentieres, & Erquinghem-Lys\n","59":"\n\nUp at 8. Some rain and a dull grey morning. Held orderly room ay 9.30 and tried Moodie who was off his sentry beat last night. Remanded him under close arrest to the C.O. Left for Armentieres at 10.30 & put in the morning shopping there. Visited my little friend at the postcard shop and she brought out a great display of very risqué books and pictures. Then to Bourberus and to the library. Madam \"tres jolie\". To the shirt shop but did no business as they wanted 20 francs for a shirt. The coffee these French people make is delectable they use a good deal of cream with it which gives a grand soft flavour to it.\n\nIn the afternoon the Brigade Major called in at L’Armee and we had afternoon tea. Dr Craig was also in and with Palmmre we put in some good French conversation. It has improved wonderfully the last few days just by yarning with the people here.\n\nReceived orders to return to our old billets and so made arrangements accordingly. Phoned for transport, blankets and other gear will be taken up for those men off duty but 100 work from 2 am until 8 and then follow on after us. \n\nIn the afternoon attended a lecture at the Cinema Hall Erquinghem upon \"aeroplane photographs\" and saw some good examples. L’Armee is a most peculiar place in this respect that it is extremely hard to get ones bearing owing to the torturous roads of approach. Roads twist and turn here in a most extraordinary way and there is no definite surveyed plan. They just ramble about anywhere and at crossroads it is very easy to go astray.\n\nAfter tea two of our ‘planes flew across very low and drew some shellfire. The people say the whole of the place hereabouts is called La Chapelle d’Armentieres. \n\nThe transport turned to time and we left at 9.30 pm. Kissed the 3 girls and gave them all a squeeze before leaving. They squealed a good deal but really enjoyed having their charms ravished in this manner. Some heavy shelling going on at the toads to which we replied.\n\n \n\nErquingem-Lys\n","60":"\n\nForty men only paraded this morning the others were exempt having been working all night. Met Curnow after breakfast and cycled with him along Rue Delys to Fort Rompu and Bac St Mavr very pretty along this road. Swung through to Croix du Bac and called on Field Cashier. Returned via transport to our billets. Attended a conference of Coy. Commanders at 10 am and we drew for English leave. Nothing much doing during the day.\n\nCrandge is to go before a medical board today for nerves. At Gallipoli his mate was killed beside him and his state ever since has been deplorable. Old Dad Kavanagh a fine old chap goes to hospital today with a bad back. Dr Drummond called in today for afternoon tea.\n","61":"\n\nA day of ceremonial. Fell in at 6 am for inspection and then dismissed the men to shave & clean up. Fell in again on battalion parade at 8.30 and then had lunch at 11 am. Moved off at 11.30 the whole Battn divided into 2 coys. Curnow & myself commanding respectively. Passed our coal heaving fatigue on its way back black as sweeps but cheerful. Up before daylight they put in 6 hours hard and now I have use same tonight as well. Very rough on them calling in their second blanket is a great hardship too, and one is felt very cold.\n\nA pleasant march through leafy lanes towards Croix du Bac and turned into a paddock there 500 of the 23rd and Artillery & other details were in attendance too. Plenty of swank pretty staff boys. Platform was erected. General Birdwood arrived with Hughes, Fisher and others. General Birdwood was received with the general salute, made a short speech, Hughes looking ill as he spoke too. Fisher wearing an old white coat looked a hard case and spoke blunt & to the point. \n\nFairly heavy shelling going on further back and one of our planes put up a good chase after a Taube. Returned to billets fairly tired for tea and then received orders that take all men out on fatigue tonight. Many girls returning from church today in their white confirmation dresses & veils like brides. Just at Fort Rompu noticed a calvary and one at H.Q. Div. train dedicated to Sainte Godeline.\n\nErquinghem\n\n1\/6\/16\n\nThe country is looking lovely and the lanes are screened by the dense hedges and render any movement along them very hard to detect from aircraft. The people are so beautifully clean and the little children spotless and well looked after. There seems to be much happy family life. The old thatched farmhouses so neat and well kept with cultivation all around. Not an inch of land is wasted, the plots are hoed and weeded and most are carefully tendered. The roads wind in and out from place to place and nothing like a surveyed layout is attempted.\n\nHaving to take chaps out tonight who have been hard at it all day is very rough indeed but cannot be avoided it seems. It is no life for the weakling. Some paraded about it but what can one do. Went out at 7 pm in charge of the battalion fatigues. We had to march to a place 5 miles away and there settle down after an exhausting march to a nights pick & shovel work. Carried on working hard burying telephone cables until 1 pm and then set out on the march home again 5 long miles all the lads dog tired. Some have been on duty continuously for 24 hours.\n\nRose at 4 am 1\/6\/16 and then set off the Dump to unload coal, marching 3 miles there and 3 back. Worked hard for 6 hours on that job. Had 6 hours off and then fell in for 10 miles of marching and this pick and shovel task, not ceasing until 4 am 2\/6\/16. Others worked all last night marched 10 miles in the course of that same work. Returned 3 am and fell in again at 8.30 marched to Croix du Bac, 8 miles in all on parade all the afternoon and then fell in again at 7 pm for this nights 10 miles march & labor. \n\nOnly the toughest veterans could possibly stand work of this exhausting nature, on such fine cut food. Of course it wears them down very fine. No recruit could possibly live through it. We were under fire all night and a heavy bombardment just in front of us caused 15 casualties who were carried past us. On their return the\n\nErquinghem-Sur-Lys\n\n1\/6\/16\n\ncooks had hot tea ready and the men had some before they turned into bed at 4 am. \n\nOn the way out we could see the captive balloon being hoisted into position and I thought that she was tugging a bit. Next thing she at broken away and our antiaircraft guns started blazing at her in order to prevent her drifting over to the Germans. The three airmen descended in parachutes – we saw the whole occurrence. The parachutes just appeared like big umbrellas in the air floating softly sideways down. The men were suspended to a bar underneath and one was rocking terrifically from side to side. Some of the men said this man lost his grip and they saw him fall from midair.\n\nThe balloon had meantime drifted towards the enemy lines and the flaming cores of our bursting shells showed up bright in the black clouds surrounding it. Eventually one seemed to take effect and our last view of the gas bag it was standing on its end and some of the fabric appeared loose. Aeroplanes were very active.\n\nThe Rolanderie Farm passed on the way down has been a very fine old place indeed. On the fatigue each man was put on piece work and was allotted a digging task of 1' x 5'6\" x 2' to excavate, lay cables and then fill in. This with the march of 10 miles in all constituted our nights work. Flares brightened the scene and an occasional overshoot bullet came thudding with nasty force into the bank near. All the men growling like hell.\n\nThis afternoon the enemy were successful in bringing down one of our aeroplanes. They also got the balloon and blew out 3 guns in a battery just before we passed the place they were at. They also got 15 casualties from the same shelling and generally it seems to be Fritzs day out.\n","62":"\n\n3 am. Am just going to bed very tired. Even at this late hour it is quite light and the birds are still singing.\n\nErquinghem\n\n2\/6\/16\n\nRested in bed until 9.30 am and then leisurely rose, washed and shaved. The men were very tired and there were few astir before midday. \n\nSome shrewd heads retained more than the regulation one blanket so fell them in at noon, each man to have his blanket. Most were just up from sleep so said they could fall in in any dress or undress. The wags of course turned out hatless, barefooted and swathed in their blankets like a lot of Gyppies, called out \"Sigheader\" \"G-----\" and all the other native Arabic redundancies of speech. \n\nA quiet afternoon. Fatigue again at night but not the full coy. out by any means so was able to rest yesterdays toil worn warriors. Another observation balloon has appeared in place of that roving one that broke away last night. \n\nParaded all the N.C.O’s at 6 and spoke to them about the necessity for great strictness in performing the ceremonial with regard to posting & relieving sentries. At L’Armee Moody acting as sentry of the billet guard was found to be absent from his beat and was put under close arrest. His plea was that he had not been properly posted as a sentry having been awakened by his mate & changing places the Corporal (Thurlow) being asleep. This was quite valid and the charge was dismissed.\n\nExplained to them the great importance of strictness in this regard particularly in the firing line. Arranged with C.S.M. had to put at least 2 N.C.O’s on every guard in future.\n\nThe 23rd have their band up today and it is playing at the Fort Rompu billets. Commenced gardens round the huts today putting in flower & vegetable seeds. Glad to have an evening off boys are full of beer and very boisterous in the huts. All round the houses are estaments where the flowing bowl runs and light French beer can be obtained at 1' per glass. \n\n2 officers and 80 men went out on fatigue down near firing line south of Armentieres and one of the \"D\" Coy. was killed. He was not wearing his steel helmet so inquiry will be held into the circumstances. \n\nTurned in early after reading a French roman very slowly. Sold in all shops it is plus grand not to say tres, chaud.\n\nErquinghem\n","63":"\n\nUp at 6 am and had early parade for the men available. After breakfast they went over to L’Estrade for a gas demonstration. I rode over on a bicycle with Curnow. In a small trench gas was liberated and the men walked through it. The smoke was yellowish in colour. Approaching without the helmet the smell strikes one as that of sulphur. Cartridges and other metal exposed to the gas became corroded and all round the crops are bleached a yellow colour. \n\nLachrymatory gas was then liberated and the spicer goggles tried and nothing at all was noticed except a pleasant sweet smell like tinned fruit. Walked through without goggles and the eyes were too blinded and stinging to see. A demonstration of a smoke cloud followed the bombs bursting vigorously and a dense wall of smoke coming forward on the breeze and obliterating everything in front of it.\n\nReturned home for lunch clothes stinking of the gas. The inter relation of taste with the sense of smell was curiously exemplified today. Passing through the tear gas its sweet smell immediately made me think of tinned pears and the men coming out remarked \"Pineapple\" or \"B----- sweet stuff\", evidently receiving the same impression. \n\nAfter lunch cycled with Major Matthews down to Rue Marle to attend a lecture on \"Aeroplanes and their cooperation with Infantry\" by a Major of the Royal Flying Corps. General Legge and the C.O’s and Senior Officers of all the reserve Divisional units were present. \n\nThe lecturer was purely a flying man and was nervous. After a rather technical lecture in rambling fashion Colonel (\"Gunner\") Lloyd got up and in a speech said \"our friend is evidently more at home in the air than on a lecture platform\". Which tactless remark was enough to flatten the poor chap. \n\nReturned via the Rue de Biez which is a splendid smooth road but the rough cobblestones jolt one up intensely.\n\nPersistent furphies that the Brigade is going back to Boulogne as a labor brigade for ships unloading and cargo shifting. Volunteers called for a trench raid and myself, Bazeley, Mackay volunteered but I was told I was not to lead it. Nothing further has been said about the others.\n\nCherries are ripening on the trees.\n\n\"The Boys\"\n\nAt the gas demonstration the Major in charge said gas does not affect rations except to turn bread brown. One chap remarked :- \"I don’t suppose, Sir, it has any multiplying effect on food has it?\"\n\nThe Major also produced the \"Glasso\" used for preventing the eyepieces from misting. It is a paste something like rubber. He said to one chap :-\n\n\t\"Do you use \"Glasso\" regularly?\"\n\n\t\"Yes\", said the chap, \"I done me boots with it yesterday\".\n\nAn Australian officer had an argument with an English officer who was a bounder and used some grossly offensive remarks re Australians. The Australian silenced him at once with these few words \"You run away & play, Mister \nSUVLA!\n\"\n\nGeneral Legge was walking along the other day and was wearing a steel helmet and a cloak. A sentry seeing him to be an officer saluted but did not know the rank he held. The General was annoyed not to get the \"present\"\n\n\tGeneral :- \"Don’t you know who I am?\"\n\n\tSentry :- No, Sir, I don’t know your name.\n\n\tGeneral :- Do you mean to say you don’t know me at all?\n\n\tSentry :- No sir. I only know you are an officer that’s all.\n\n\tGeneral :- Well, I am Major General Legge.\n\n\tSentry :- (presenting arms) \"Gords (1) Bl----y (2) Struth (3) (getting a smart click on each separate movement of the present & timing it with oaths)\n\nThe 7th Bde made a raid on the German lines and got some prisoners. One of our chaps who was prodding along a German who showed no disposition to hurry was heard to make the following remark \"Eggere, you b----, the Jumbo’s have got you!\"\n\nAnother bringing in two Germans called out – \"Is there an officer there?\"\n\n\"Yes, what do you want?\" – \"Well here’s two prisoners for you!\" sent in the action to the word & throwing them over the parapet neck & crop.\n\nErqunghem-Sur. Lys\n","64":"\n\nFall in at 6 o’c and drilled about 70 men. After breakfast commenced again. News of Gallipoli honours arrived today, Stewart awarded the Military Cross which makes two to the Battalion now & Coran awarded the DCM of which we now have 3. The other item of interest is the North Sea disaster and the fact that Germany is floating a loan of £300,000,000 – probably there is some connection. \n\nThomsen came in about lunch time and is full of his air experiences and ballooning. He says a man is invisible from 5000 feet and horse is a minute speck and that last night the Canadians lost 1000 yards of trenches and that all these operations are visible from the balloon. The little row of baskets and the cup in the fabric are for rudder purposes.\n\nC.O. witnessed a preliminary cante at a trench raid and a long pipe full of ammonal is used to clear the barbed wire. Just pushed right through it explodes sideways and clears a lane for the attackers. Those 6’ behind are quite safe.\n\nColonel Watson granted the C.B. these honours are simply put in a hat and drawn for. \n\nToday every blanket in the company was called in which leaves my men to expect to sleep on a bare floor with a waterproof sheet underneath and no blanket at all. All excreta is now burned in the incinerators mixed with sawdust and the system acts very well. \n\nWent out with fatigue 200 strong and buried cable up near the firing line occupied by 17th Battn. Very good tramway and excellent trenches that could not be recognised as those left by the Tommies. Went up to the 17th Battn H.Q. – a very comfortable dugout and yarned there for a while.\n\nThe men being on piece work soon dug in well. It was grey cold night and the gun flashes and flare lights gave the sky a weird look. The German flares are very good and appear to be of magnesium kind and float on the air. About 11 a heavy bombardment commenced about a mile south of Fleurbaix and raged for an hour. The fitful flashes of the artillery shone halfway across the sky and the flares turned night into day. We marched the 5 miles back in the cold and my good lads had to turn in without blankets.\n\nErquinghem-Sur-Lys\n","65":"\n\nAwakened at 6 pm by Sergt Major re fatigues and put on gumboots and overcoat and went over to have a look at the men. They had no bed clothes or blankets at all and were lying huddled up in restless cold sleep on their hut floors. There was a great deal of coughing.\n\nLater on in the day all were pleased to see the transports come up bearing our blankets home again. It is to be hoped that the brass hatted idiot who was responsible for the calling in of thousands & thousands of blankets and the transport and trouble of checking them at Ordinance only to have them sent back again when we protested – it is to hope that that idiot falls into the fat over his performance particularly as it means men sleeping on a big cold windy night with no wrap but a greatcoat. This cursed lack of sense and ridiculous orders and the messing about of everyone owing to incompetence whinnies whose only qualification is some all aged blue blood all this is fast losing us the war. \n\nSlept in until 10.30am, my batman bringing me breakfast in bed. After lunch went with Curnow to the baths and had a voluptuous steaming and clean change. \n\nWalked along to the old Erquinghem church which looks very old but bears no date at all. The churchyard is crowded with hideous wooden tomb \"stones\" with circular tops. This points all ways in some cases an enormous oblong glass case is erected at the head of the graves, just like an upended coffin with glass top. Inside are tawdry wreaths, tiny china images &c and in some cases there is even a photograph of the late lamented. \n\nThe inscriptions are painted on the wood in most cases. Here are two \"Ici Repose le Corps de Mademoiselle Blanche Hbeline Turck decedee 17 Janvier 1907 v’age de 22 ans. Admministore des acrements. R.I.P.\" \"Ici repose le Corps de Levantime Alphonsine Charles Espouse de Henri Parsy De D’Accidentelement\n\nErquinghem\n\n5\/6\/16\n\n\"Le 4 Decembre 1906.A L’Age de 52 ans R.I.P.\"\n\nThere are some good stone monuments of the conventional style we know at home and there is one portion entirely devoted to them. The recent dates on all these graves inclines one to the belief that the churchyard is used over and over again and graves dug up and other people buried there after a few years. Another portion is sold off for soldiers and there are a good many buried there. Various beds close together. \n\nThe grave digger (a Tommy says \"I allers keeps a few ready dug and then I’as something to come and go on. I allers likes to have a few ready dug on hand and there, any corpses come down I’ve allers got a couple of neat graves all ready & waiting up me sleeve so to speak\".\n\nInside the church everything is very clean & neat. In the chancel are statues of Jean d’Arc and St. Michael and a few processional banners. Just outside is a Calvary the rear wall of which has been painted to represent the walls and city of Jerusalem. I asked the sacristan how old the church was and he fired off in answer a jumble of \"sanks\" & \"kattrs\" that might be anything.\n\nOn the canalised River Lys are good clean lighter barges on which people live a nautical existence up and down the canals.\n\nA cold rain windy night.\n","66":"\n\nThe Coy is on day fatigue now and they were all away early. Heavy showers if rain and a bitter wind continued up until noon. Paid the men after lunch and spent the rest of the day knocking round very quietly and later in the afternoon was called up to the Colonel for an opinion of a trench raid scheme. Raised a number of points in the proposed plan of action.\n\nErquinghem & Armentieres\n","67":"\n\nAll available men on fatigue and they got away early. No officers out. Went down to Ordnance at Bac St. Maur but could get nothing there – they appear to be quite strangled by red tape and everything has to come on indent from Calais. Some languid of sergeants there I should dearly love to have in my company just to discipline them. \n\nFort Rompu is a pleasant but shows no sign of being a fort. Great green trees border the road and there is a wealth of foliage. \n\nThe 7th Bde. Trench raid last night was evidently a success as some German prisoners (some wounded went past here under guard early. We relieve them soon. A man in \"D\" Co got 5 years penal servitude for insubordination. \n\nA man named Porter \"B\" Co while apparently quite normal in other respects has of late developed a craze that he is fighting against God and does not want to kill Germans. He says Jesus is on their side and he therefore refuses to go out on fatigue or to fight. He is being sent for a Court Martial.\n\nWent down to the Cinema Hall Erquinghem at 4 pm for a lecture by Colonel Blamey but he had left for England and Colonel Brand, the New Brigadier, carried on. Went direct from there with Curnow into Armrntieres calling in to see Mademoiselle at the paper shop and there saw a book of art studies that would cause a riot in the old fashioned city of Melbourne. \n\nDid some shopping and went into the church – the stained glass mostly dated 1901 being very restful to the eye. Great work has been lavished on the altars of this fine place. Some shell damage.\n\nTo Au Boeuf for dinner, the old lady dishing up hors d’ouver omelette and fillet of beef with \"petit cakes\" biere and fruit. The latter lovely peaches at 1 fr each grown at Bailleul. Plenty of beer flowing being the night after pay.\n\nErquinghem-Sur-Lys\n","68":"\n\nAll men again out in fatigue and for the officers the day was in consequence a slack one. Heard of Lord Kitchener’s death. During the afternoon went down to Sparrows battery and saw the Stokes guns there. Fired a couple of bombs from them – such amazingly simple things that one wonders at their very simplicity.\n\nThe other day a big stack of bombs was stored near some guns and an officer accidentally kicked one. A Sergt Major noticed this and said quickly, \"Gentlemen, there is a bomb smoking run for your lives\"! All ran except one and got over a little crest before the big explosion. One man stayed on unable to grasp the meaning and was killed. \n\nHad a painful scene with Coltman tonight when telling him his transfer was refused. He cried pitifully poor chap. The dog is a good deal used locally for the purpose of hauling loads and is usually strapped into small harnesses affixed to the axle and thus pushes the cart ahead.\n","69":"\n\nFurphy going round that 20,000 Germans have surrendered at Verdun. Despatched Skene Smith 4 Sgts & 16 men as advance party to our new place. I am to be in charge of Lille Post, a dugout post about 1200’ behind the firing line and there will be a reserve to the firing line. The remainder of the battalion are further are further back in billets. 1100 shells are said recently to have landed in this section. \n\nAll men being out on fatigue the day has been a quiet one. It is unfortunate that we have to leave behind us here trees full of fruit which will not ripen for some weeks yet.\n\nMackay & Bazeley went into Armentieres and Skenes having gone down to the reserve line to take over our billets I was alone for tea. Mounted as Orderly Officer at 5 pm. After tea the antiaircraft gun in the next paddock started heavy shelling at a Taube flecking the sky with white one shell burst within feet of the plane. Very rapid fire maintained the voice of the range taker keeping up a shrill babble. Four of our aeroplanes were up together. The Germans are far more economical with their air shooting latterly.\n\n \n\nRue Dormoire, Erquinghem, Lille Post\n","70":"\n\nLeft at 8 am per bicycle for the trenches. Crossed emergency road to Rue Marle – a very muddy track. Turned round into La Chapelle d’Armentieres and found it nearly blown to bits. Every house & every room in every house is in ruins and the place looks like a dead resting place. In one old place some soldiers were bashing tunes out of a piano. \n\nNo civilians live as far forward as this. The whole place is under view from the enemy lines and from here we can see the high ground in rear of their trenches. Pushing on we came to a railway crossing near which is a neat little new post office and a room in which the village are. It was partially wrecked by shell fire. \n\nOn the left hand side of the road are clusters of graves with their wooden crosses nearly lost in the luxuriant growth of herbage surrounding them. Further one there is a church square and imposing surrounded by good type of house. The whole is literally blown to shreds as and grass covers the floors instead of carpet. \n\n there is another crossing and one suddenly runs into a sand bag barrier right across the road and a sentry with a fixed bayonet. To right and left the trenches start. The road is blocked and bushes and grass grown and deserted right trough the trenches. It is the main Lille Road and runs on like a broad stone ribbon right through the German lines.\n\nDismounting from the bicycle one walks along the familiar duck walks past dugouts full of men shaving washing and lousing. Noticed in one place a patch of graves close pass which the saps have been dug. Shavers rested their glasses on the grave of Pte so and so while they shaved. It was pathetic to see the grave decorations. There a faded wreath, there a Catholic image, there a big 6\" shell case there a bismark kerosene lamp\n\nRue Dormoire & Lille Post\n\n10\/6\/16\n\nA short walk through the trenches and reached the destination and had a talk with the O.C. This is a strong post. The buildings have been shattered to pieces. One wall (evidently of a mill) is full of round holes where shells have gone through and burst inside. Evidently a very well built one to stand without collapsing with so many breaches. Returned via Armentieres, called at paper shop and then to Baths. Home for lunch at 1 pm. Busy with orders all the rest of the afternoon. \n\nFell in at 7.45 in full marching order having first got all men out and sitting down. Inspected billets – it is marvellous what stuff turns up in the huts when you clear everyone out. Warned men of the dangers of light and movement &c. round the new place. Moved off at 8.15 in platoons in file and made good going until we reached the emergency road. \n\nFull packs very heavy & I made a mistake in not prearranging in such a long march liberal halts. The fellows were passing vivid comments on the \"farmy\". Guides were to have met us at Rue Marlt but we had to conclude the journey without them owing to their going to the wrong spot. Paraded them all afterwards, being in a hell of rage about it and savage as the devil. I found out that their officers orders were too vague.\n\nReaching the trenches took over from the 28th, and had a slow job tucking all the men in as the accommodation was cramped. The company we relieved being only 150 strong. All rations had to be manhandled up the communication trench and took a lot of men.\n\nLille Post\n","71":"\n\nStood to arms in heavy rain at about 2.15 am, at which hour the first glimmerings of dawn had put in their appearance. Carried on at 3.15 – it was then broad daylight. Went to bed again and slept in until 9. All the men very tired and did not turn at till midday. \n\nThis dugout is most elaborate being built up against a wall of brick. There is a fireplace mantel shelf mirror, vases full of flowers a carpet on the floor and two easy chairs and a bunk. In this country one gets much more comfortable than in Anzac. Poked around all day mostly cleaning up as the place was very dirty. \n\nA very quite day, thundery. Have been in a snappy temper ever since last night. Our raiding party has been told off and starts practice soon under Eliniger, Mackay goes from \"C\" Coy. The trenches connecting up these posts are a mass of lovely green and are often behind hedges. By No. 12 there is a little creek all fringed with stunted willows and the water well covered. A very pretty little place.\n\nIn this company there is now a family spirit among the men. They look after each other and are nearly all quiet steady going chaps. We don’t realise how well trained we are. Fatigues and duties always turn out on time, whatever late hour they are detailed at. The NCO’s do everything the officers merely giving their orders and walking out at the appointed time & finding all ready for them to carry on. Ever since Anzac have been troubled with the itch and my crutch at present is nearly raw with irritation. \n\nLille Post\n\n12\/6\/16\n\nGot up at 7 am and after breakfast went up towards the firing line having a look round. There is high ground wooded in places behind the German lines from which we must be constantly under observation. Davey got sniped and I passed the stretcher bearers taking him along. The bullet went through just above his knee and left a jagged wound. Pedley was along later in the day and told me of an officer who had 5 bullets hit his steel helmet and none went through.\n\nWent down to Batt. H.Q. during afternoon. Stood to arms at 8.15 until 8.45. Cold and raw. All day there has been continuous heavy cannonading at Ypres, probably the Canadians counterattacking.\n\n13\/6\/16\n\nAll night long the roar of cannon was continuous rising to terrific violence just before dawn 2 am and then continuing in one steady rumble. A big battle is evidently in progress at Ypres and we are very likely trying to retake the lost trenches there. Just after midnight our Army Corps carried out a raid on trenches opposite Fleurbaix under cover of an intense bombardment. Altogether a very active noisy night.\n\nStood to arms in rain at 2.15 until 3.15 when it was broad daylight. Men slow in turning out on to their alarm posts, the dugouts being very crowded. A good many got wet owing the rain coming in on them. Our trenches run through a building under which it is pitch dark. Loopholes cut flush with the ground through the foundations and the weight of the superstructure is taken on beams and stays. One man per yard here and as black as pitch.\n\nNo fatigue today so far. Went round with Sergeant Trevena inspecting the post and mapped out enough cleaning up to keep him going with 100 men all the afternoon. Wet and dreary, there is mud everywhere and most of the men are rolled up in their blankets reading & writing. At midday the bombardment of Ypres slackened down to an occasional heavy gun boom. Our raid by 5th Bde last night is said to have resulted in 50 Germans being killed & 6 (including an officer captured) also some m.g’s & trench mortars. Our loss 1 officer killed 1 man killed. \n\nFurphy about\n\nLille Post\n\n13\/6\/16\n\nthat this Division is to be withdrawn from the line and with the Guards Regts used as a mobile Corps. After lunch attended a conference of company commanders at Batt H.Q. and after tea met Colonel Hutchinson and had a talk with him. Received news that the Canadians had recovered the trenches they lost the other day. Forty men out on fatigue tonight. Sloppy and cold.\n\n14\/6\/16\n\nStood at arms in cold and wet from 2 o’c till 3. Breakfast for 80 men at 3.30 and they paraded for work at 4 am and kept on till lunch time. Teeming with rain most of the morning. Went round the post with the Brigadier, Col Newcombe, Col Hutchinson and some New Zealanders. C.O. in this afternoon. I am to command the attack when the trench raid comes off. \n\nAll men were very tired and kept inside their dugouts all day sleeping. A most peculiar expression has arisen lately with which they express disgust, or designate \"nothing\" or \"not much\". It is \"f---- all!\" This morning heard a chap announce that he had \"sweet f---- all!\" for breakfast which meant he had a rotten breakfast. \n\nIt is remarkable how long the days are here. It does not get dark until after 9 pm at night and it is broad daylight at 2.15 am. One can understand the plain commonsense of the daylight saving scheme. France having adopted the new time the whole army is changing over tonight and we advanced our watches 60 minutes at 11 pm, so that 11 pm becomes midnight.\n\nMackay and his raid party leave tonight for L’Armee. The chief thing we noticed about the daylight saving was that the sentries on duty when the time was changed had the shift cut down by half to which none of them objected. \n\nYeadon proves himself to be a first rate C.S.M., indeed all the NCO’s are good trustworthy men. But like Yeadon, tireless smart keen, cheerful and clean – a manly chap.\n\nThe Boys\n\nTo ascertain the results obtained by steel helmets an order came out that the sick report accompanying injured men to hospital was to state if the wounded man was wearing his steel helmet when hit. One unit sent in a case of chancre (cold sore-primary syphilis ?)and the MO wrote on the report \"He was not wearing his steel helmet at the time\"!\n\nThe 8th Brigade are known as \"Fiveys darlings\" having missed Gallipoli and never yet fired a shot. Here is a bit of repartee between one of them and a 7th Brigade veteran, heard in an Erquinghem estaminet –\n\n\t7th :- \"So yer’ere are yer. G’struth fancy seeing you blokes where there’s any bullets!\"\n\n\t8th :- \"We didn’t get pushed off Gallipoli anyway!\"\n\n\t7th :- \"No, and we didn’t get pushed out of Australia by the womenfolk!\"\n\nOne of the","72":" Bde officers has a habit when teaching bayonet fighting of repeating \"In! Out! Off you go\"! in ordering the point to be delivered. The other night in the trenches we raided a German prisoner had to be killed close to their wire. One of the wags in passing said \"In! Out! Off you go!\" suiting the action to the word.\n\nA very popular song at present is the following – the men are always humming it\n\n\t\"Apres la guerre fini\n\n\t\"Australie soldats parti\n\n\t\"Mademoiselle in the family way\n\n\t\"NO b-------y born to me\"\n\nBefore the raiding party left a","73":" Bde trench their Major said to one man \"I’ll bet you 5 to 1 you don’t get a prisoner!\" \"Right sir\" said the chap \"I’ll take you in francs\". Halfway through the stunt a head was stuck over the parapet and roared out \"Is the Major there?\" The Major hurried up thinking something had gone very wrong \"What’s the matter\"? \"Oh, you owe me 5 francs, Sir, - Come on Fritz\" . He lugged a German in. \"Now Fritz, show them what you can do, hands up, hands down, hands up, hands down\". Then our friend kicked the Huns two feet from under him saying \"Sit down old cock have a cigarette! Goodbye Major, I’m going over to get another cony\" \n\nLille Post\n","74":"\n\nAll men left on fatigue rising at 3 am and all was quiet here during the morning. Furphys that we move 10 miles north up towards St Eloi are confirmed and we commence preparations. Went to Batt H.Q. at 3 pm and then came back with Curinow and Andrew. Some shells burst round Andrew’s dugouts and then over the communication trench we had just come out of. \n\nSome complaints about the rations again more especially the breakfast owing to shortage of bacon. Each man is entitled to 4 ozs and our issue yesterday included large bones in the weight. This is not much good to the men who have to go out and work on a comparatively empty stomach. Intend having Groves up tonight and discussing the matter.\n\nParaded young Payne, - the little jockey boy aged only 16 who has been getting the into trouble a bit lately. Some older men who ought know better delight in getting the young devil drunk and are going about the right way to spoil him. I gave him a good dressing down about getting a bad character that would make his parents ashamed of him and it is to be hoped he pulls himself up.\n\nThe coal issue here contains a good deal of sulphur and gives off fumes when burning. The smelly poison gas is not a smell of chlorine but rather one of sulphur. \n\nAll information here commences as furphy and more often than not comes quite true. Two persistent rumours have been going round 1. that we are to be withdrawn & form a mobile reserve. 2 that we march down to trenches 10 miles north. The latter is quite correct but still an official secret. A week before anyone knew of the evacuation of Anzac, the rumour to that effect was strong & Tel el Kebir named as our next camp. All quite true.\n\nLille Post\n","75":"\n\nVery quiet day here fatigues as usual. 50 for baths in the afternoon. The Brigadier was round in the afternoon.The enemy bombarded the trench line containing our Batt. H.Q. Went up into loft of a ruined building before lunch and from there and had a good view of the German lines and the country behind them. There is a belt of forest behind the trenches. Their firing line runs through the front of Wez Macquart. They have erected canvas screens and I could see no one in sight. The observer can watch them coming and going very freely. A good many observation balloons up today & some aeroplanes. \n\nAt 20 minutes past 10 tonight it was still daylight enough to stand outside the dugout and read a paper, owing to two things (1) the abnormally long twilight (2) true time being 20 past 9. \n\nJust about 10.45 pm the ration fatigue reported that they could see two men moving about on top of the ruined wall of the of mill directly I looked and thought there seemed to be a moving shadow so took a party and surrounded the place and then went in myself. Found that it had been an old observation post and there were long ladders leading right up. Crawled up and searched the little roof left but found nothing. A splendid view of the trenches at night from here. \n\nAt about 11.15 the artillery opened up and merry hell started while we raided their trenches on the NZ front. The air was soon lurid with flashes and the bursting shells were pretty viewed through field glasses. The air was full of noise of course and a haze of smoke soon collected from the guns, the smell of explosives being very pungent in the air. The first time this has been noticed. Most of the men being old soldiers just slept on though ready to turn out at a moments notice. The area affected by the bursting shells was a mass of darting flames flashing up and down.\n\nLille Post\n","76":"\n\nThe retaliation from the enemy was as far as we could see practically \"nil\" though just between us and the firing line we could hear shells bursting. We had just carried on and returned to our dugouts when a faint banging of gongs and ringing of bells sounded. At first its import was not realized then it grew in volume and presently a sentry dashed in \"Gas alarm on the left Sir\", my helmet was on in a trice and within a few seconds a good many men were out fully equipped and the rest were sitting up in their blankets like divers. The artillery then opened up at a great rate in a fresh bombardment just north of Houplines and there seemed to be merry hell up there.\n\nWhen it was apparent the gas was not on this front, I gave the \"carry on\" but instituted a gas alert, doubled all the sentries and made them wear their helmets turban wise and put special men outside each set of dugouts. We discovered that our Strombos Horn in Leith Walk \"roared as gently as any sucking dove\" When we turned it on owing to some defect in the cylinder so Griffen changed it.\n\nSome of the men have had a very strenuous day today what with their ordinary fatigue which lasted from 3 this morning until 12, and then with an 8 mile march for a bath this afternoon followed by this strenuous night with all its alarms and excursions and the usual \"stand tos\" to be done.\n\n17\/6\/16\n\nStand to arms at 3 am and after that did not sleep too well. A very quiet morning, 50 to the Baths and others on fatigue. Persistent rumours today that the C.O. is going to the 8th Battn. and Watson is coming here also that Mackay is leaving the Regiment.\n\nBeing a lovely day the men off duty lay in the sun and loused themselves. Some ‘planes up and antiaircraft guns tried for them. Some Taubes (transparent) passed over.\n\nLille Post\n","77":"\n\nAfter lunch went to the Baths and had a luxurious soak then proceeded to Armentieres calling upon Mademoiselle at the bookshop. She was looking very nice. Also the library where the charming lady in black presides. The town full of soldiers, transport coming and going. At Burberry paid 29 ½ francs for shirt collar and tie. Old French civil guards pottering about on little posts – clad in their baggy trousers and postman looking uniforms.\n\nComing through La Chapelle some artillery strafing was going on and had to wait till the shells burst less thick around the road. Our gun positions very cleverly concealed in places by dropping a painted curtain over the opening. Left bike heavy shelling of our Bois Grenier line using about 6 inch stuff H.E. admixed with shrapnel.\n\nBird was wounded in the leg but there were no other casualties. Proposed trench raid tonight was put off until tomorrow. Stand to arms 9.15 inspected everyone and after that supervised the rum issue. In the company there is hardly a man now who does not draw his issue. When we first went to the Dardanelles there were a good many teetotallers but gradually their scruples have been overcome.\n\nI consider the rum issues quite unnecessary and creates an appetite. Something else should substituted for it – say something extra for breakfast or tea. The rattle of transport resound over the country side at night. Today I heard a train whistling just behind the Germans & also spotted a soldier doing pick & shovel work under a hedge.\n\n \n\nLille Post\n","78":"\n\nStand to arms at 3 am. Went right round and inspected everyone. Not very many on fatigue today, it is first rest some of the chaps have had for a long time. After breakfast went down to Battn office and received particulars of Brigade raid 230 strong against 400y trench, which I am to lead. Poked round all morning and went up to observing station and had a look round the rear of the enemy trenches.\n\nArtillery fairly active salvos of heavy stuff going over towards the town but our guns replied in kind. Balloons & planes up. After lunch attended a conference re the trench raid tonight. It commences at midnight and a new departure is to be made in this respect that after all is quiet another intense bombardment will commence. It is anticipated that the enemy will be curious as to damage done and a good cluster will go along to the trench after our party leaves. Our shelling ought to catch these people. \n\nThe Coy. stood to arms at 11.45 and punctually at 12 the shelling commenced – our guns lashing out in fine style for over half an hour. At times the noise lulled temporarily but all the time it was scarcely possible to hear the voice of the person next to you. Lurid gun flashes lit up the whole sky in a wild illumination. It was a good sight.\n\nOur raiding party failed to make a success of the job and did not reach the enemy wire. The reason given was that hostile machine gun fire prevented their further advance but only one man was hit and that slightly. It is considered the failure was due to loss of nerve by the officer. Our bombs did good work.\n\nThe enemy retaliation was slight resulting in 1 killed & 3 wounded for us. At 1.30 the one minute intense bombardment commenced and was a tame affair. The enemy played a searchlight right down the whole of No Mans Land and it was a tiresome stand to and all were glad when it was over. The smoke from the guns was not very noticeable.\n\nLille Post & L’Armee\n","79":"\n\nFelling unwell. Slept in until 10 am and then rose and went to Batt. H.Q. Had breakfast with C.O. at 11.30 and then left with him for Bde H.Q. Went round the \"stunt\" premises and found things rather mixed. Had a yarn to the leader of the raid last night and arranged to go into the billet we previously occupied. Had lunch at H.Q. and worked in my Sergt. Major (Yeadon) to come with me.\n\nOur guns very active today and we now appear to have plenty of shells. The turn in the tide appears to have been reached. News of great Russian victories comes to hand and the policy of aggression on this front seems to have passed over to us. All along the line we raid and shell and there is talk of big things to happen soon.\n\nHanded over to Skene Smith temporarily after tea and despatched my bed and other gear on ahead to L’Armee by a fatigue party. Selected as my billet the abode of the cockeyed damsels with whom during most of the evening artillerymen were consorting and coarse badinage exchanged. \n\nWent to Bdl. H.Q. and could get little information from the Brigade Major owing to the plans not yet being laid. Had to battle round for myself digging up previous plans of action & spent a very busy evening drafting up scheme and copying same for my officers. All are comfortably billeted between Rue Marle & L’Armee.\n","80":"\n\nUp early as orders came for inspection by the Brigadier at 9 am. Fell the battalion’s parties in as a company with close column to 4 paces. Received the Brigadier ceremonially with sloped arms to which he replied with a roar \"What the d----- have you got your eyes turned this way for\" – referring to an unfortunate in the rear rank who could not keep his head to the front. At once proceeded to fall out the men by parties as for the raid and got them all marked off.\n\nHeld a conference of my officers at 10.30 & threshed out a few difficulties. They then carried on with bomb throwing and physical drill. Owing to the damage caused to clothes by crawling through the grass we\n\nHalfway House\n\n20\/6\/16\n\nApplied for a complete change of clothes to issue the men with. These have arrived and with them are 230 cholera belts! The army again! These are an article of clothing on official lists.\n\nA German shell set fire to the tower of the church near Armentieres station and being a grey day (like every day is here) the flames showed up brightly. The spire was a mass of flames leaping up to heaven and the place was soon gutted. \n\nMy officers in this operation at present are Lieuts. Macneil & Sandford Lieuts. Hunter & Russell, Capt. Conran, Lieut. Cull & Rossiter & Lieut. Carwick Kerr & 2\/Lieut Smythe. With them are the 250 best men in the Brigade. All ranks attended a lecture at N.Z. Northops at 5.30 which had to be held in two sittings owing to the crowd being too big. \n\nAn expert lectured on the photo from aeroplane of the actual trench we assaulted and the Brigadier and Colonel Jackson followed with the tactics of the show. It was most lucid and enjoyable. It is remarkable how every shell hole shows up distinctly on the photograph. Light and shade also produce uncommon effects on the picture. \n\nCalled in at Brigade H.Q. on the way home and had supper there. Some strafing was in progress down south apparently. I turned in at 11.30 dog tired.\n","81":"\n\nVery busy all day. The Lt Gill who went out with the 7th Bde was with us all day. Staff people round thick. At night every one crawled. No sleep today.\n","82":"\n\nTurned in 1.30 am. Up at 7 and started one of the busiest days since commencing soldiering. Nearly killed a few times by \"whizz bangs\" in the firing line. Great deal of strafing today. searching for Lavesee battery sending columns of dirt up in the air in very quick succession. \n\nTearing about all day. Crawling all the evening and rode on bikes through heavy strafe & gas alarms to trenches.\n\n22\/6\/16\n\nThey were all torn about with the afternoon shelling. Went along to where patrol was going out and found one of the scouts had gone right out in front by himself – quite drunk. Put him under close arrest and took his bombs away. Dressed myself in English private’s clothes and wore a muslin mask: Sent one patrol out White \"B\" Co. blown about by bomb and passed me on his stretcher very bad. Had some supper. Got to bed 2.30 am.\n","83":"\n\nUp at 8. Busy again. At night went out on patrol into No Mans Land to select lie positions. Masked and blackened faces, they carried knob kerry. Left our trenches and crawled along ditches through wire and then across country. The long grass swishing under foot.\n\nWe remained frozen as their flares went up and were soon soaked through. with falling among the wet grass. Carried on for about 200’ sheltering in shell holes and then reached a creek. Could hear their men repairing wire entanglement 70’ in front coughing & talking. One of their patrols nearly walked on top of us and we spent an anxious time flattened to the earth, the swish of rain in the grass caused a thousand alarming noises.\n\nFlares kept shooting overhead and an occasional bullet. Whispers -hisses formed our signals – this little strip of earth is a Land of Death. Returned to our lines and soon the artillery and trench mortars pasted hell into the trenches and wire we had just reconnoitred. The wire party must have been blown to pieces.\n\nA thick bank of fog, the smoke from the explosions obscured all in front. Vivid blasts of flames showed up certain points we wished to observe. Their retaliation soon commenced and all crouched close to the wall of the parapet. We were all within an inch of death a number of times.\n\nThe battalion escaped with 3 dead and 2 wounded. Bill Blackley was killed today – a good honest Australian lad of was one. Covered with mud & wet to the skin. Turned in at 2.30 for a few hours sleep.\n\nHalfway House\n","84":"\n\nQuieter today but still kept going and hoping for a little rest someday. After \n\nlunch I saw a big shell crash on the road and fell a tree right across it in front of a billet. Followed closely by a second which blew the inside out of the centre of a terrace with a mighty rush. It went clean through the roof & killed a woman and some men and wounded others.\n\nA man ran up to me and said he had the body of an officer & what would he do with it. Told him I didn’t want it and gave orders for its disposal. Wounded men taken past, one naked to the waist dripped blood everywhere. Passages in the house blood splashed. \n\nAttended a conference with the Brigadier & discussed plans for stunt 22nd catching it lately, padre busy burying people. Things are warming up properly, this game is getting damned unhealthy! \n\nAt 9 o’clock left for the trenches with Gill, the daring Bde. Military Cross officer accompanied by Genton, Horan, Morey, Martin. Lance Cpl Wylie, Russell and some more tough characters. Reached Avinous dugout & was talking to Col Smith when shells bursting close round made us take cover. This strafe kept up for some time & as one of their aeroplanes was flying up and down No Man’s Land we concluded they expected a call from us.\n\nAt 10.15 disguised in English private soldiers clothes and loaded with bombs &c. lead by Horan we slipped over the parapet and slip down into a ditch & there had a whispered consultation. Crawled & crouched up to within 100' of the enemy wire remaining frozen to the spot now & again as the enemy flares nearly dropped on the top of us. \n\nAs we crept on we skirted an old onion field full of dried stalks. Once a form was seen coming straight on to us & Russell nervously drew his revolver & rustled the grass. Morey’s absolute calmness as he reassured his office by silent gestures impressed me much. We were just about to creep up closer to the enemy (we could\n\n \n\n\"No Man’s Land\"\n\n24\/6\/16\n\nhear them talking & coughing) when shells started landing on their trenches as our artillery commenced a bombardment. It was a very rotten position to be in right on their wire with a heavy strafe commencing. We tumbled into the ditch & crouched down. It was now as bright as day and their batteries and machine guns opened up and we lay flat only once getting a little shrapnel.\n\nWhen it was quieter we crawled right back with nary a halt & breathless pause as we made a flying leap back over our parapet into the firing line.\n\nBed 2 am.\n","85":"\n\nWork as usual but finding out that it was Sunday I let the chaps off with an easy day. Padre Stewart had his farewell today and will be much missed having made himself a living force in his Regiment.\n\nSaw the Brigadier in the morning and discussed some details with him. This Halfway House conforms to the local rule and its courtyard is surrounded by the house on one side and barns, cowsheds & outbuilding on the others. The place is most capacious and capable of holding many men in billets in war time and plenty of stock and fodder in peace. Our battalion lines got \"well strafed\" today in retaliation for last nights strafe and we had some casualties.\n\nOne of the men in my special party was hit .. Jock Munro also stopped one and is away.\n\nOfficers\n in my \"stunt\" : Capt Corvian Lt Cull Rositer Lt Machell Sale Sandford, Lieut Carwick, Kerr Smythe, Hunter, Mackay Fussell. Our vocabulary has acquired some terms which I used violently to detest but am now habitually using as everyone does \"Stunt\", \"strafe\" & \"Hun\" are a few of these.\n\nIn the evening we had a full dress rehearsal with phones &c. on the whole it was not too bad. The phones worked well in spite of scratch connections & men tripping over wires.\n\nBed 1200\n\nHalfway House\n","86":"\n\nAll stayed in and enjoyed the first rest for a long time not having to be on parade until 10 am.\n\nLast night 5th Bde raid was a success and the N.Z. got 3 officers as prisoners. The show started about 11 and the air was soon split with the crashes. Walking along the road with Colonel Brand a living sheet of flame would now and then flash across the road nearly blinding one – the deafening crash followed at once.Oldfield was killed in the retaliation and Corpl Shield & 2 others wounded.\n\nThis morning was spent quietly by us here. Grey day as usual. The jargon the men talk in with the rustics here is a peculiar mixture of English, Arabic & French. \"Bonpour you backsheese\" said a girl today. A small boy in the street addressing another say \"Eggere: you b------, you compree dat?\"\n\nAt 8.30 pm one of our aeroplanes charged direct at a German balloon & dropped what looked like a bonquet of liquid flame on it. It descended in flames. Dotted flashes all over the sky denoted them going hard at the ‘plane. \n\nSet out for practice trench at 10 pm but heavy rain set in coincident with a vigorous bombardment. The Germans opened up on us and Capt Davis, Cawthorne, & Robinson fell wounded. 1 man killed & 2 others also wounded. From now on till after midnight there was no peace for the roar and crash of destructive shells. \n\nWe raided on the right and got 4 prisoners and 1 machine gun. My scouts could not possibly get out indeed some of them were buried by shell bursts. The heavy rain made the whole place a streaming mess.\n\nA strenuous day.\n","87":"\n\nQuiet morning. Men throwing live bombs &c. Met Colonel Lloyd DSO the dashing artillery Comdr and went over the aeroplane photographs with him and he arranged to meet me to go to his observation post and watch their registering shots.\n\nA showery morning. Dropped in for yarns with different parties clearing up doubts and offering advice. Had a splendid rehearsal of stunt at night.\n\n \n\nHalfway House\n","88":"\n\nWet and grey day again. It is not safe to venture out without a cloak. Col Jackson & Brig. round to look at our men revolver shooting. After lunch went up to the firing line and saw the different points of exit very clearly indicated and made arrangements for breaching the parapet and cutting the wire. Attended a conference by Brigadier, - General Gellibrand was also present. \n\nTurned in and slept like a top.\n","89":"\n\n\"The Day\". Busy fixing up final details and expect to have a success. Conferred with the artillery brigadier & others and arranged to give my officers final orders tonight. I am in command of 13 officers and 270 men in a daring venture and shall return either crowned with laurel or wreathed with cypress. Be propitious O Jupiter.\n","90":"\n\nPunctually at midnight our intense barrages commenced and our lads got to work. The net result is estimated at about 100 Germans dead officially. We lost a number of men poor chaps and the stretches congested the saps terribly. Our rear communication trenches were crowded and hostile shells would have been awful. In our trenches the shells were very thick.\n\nWe brought back all our dead Carwick doing splendid work in carrying 5 corpses right across sheltering in shell holes with them. The booty in helmets &c. was considerable. The first prisoner was brought to me. He was a fresh faced young chap dressed neatly & cleanly in their grey uniform with cap. He said \"B----- clever done!\" and could speak English very well.\n\nThe attack lasted ¾ hours and was considered a great success. It was entirely under my command. The whole was reviewed by General Legge in the afternoon. After refused giving to drink on excited . Some disgusting sights were seen. Cut it out next time.\n\nHalfway House\n","91":"\n\nWent into Armentieres for tea, overhead passed 15 aeroplanes in open formation heading for Lille – a great sight. Funny old dame at the eating house \"Voici in sien merci meceir\" drawing out the syllables greatly.So polite. \n\n Hunter and Fussell both wounded. One man’s body was not brought back, a 2\" mortar blew it into a thousand fragments. It was a haunting night blood & pain. The reaction on the men was very remarkable and two were removed in a state of alcoholic coma. Next stunt I am saw this the curse of our army will be unavailable. Our men wasted little time with prisoners killing them ruthlessly if any trouble was expected from them hanging back nervousness. \n\nPoor Carwick after his dreadful journey lugging the dead was quite unnerved & I had to put him to bed grimacing like a child, This, the slashing Viking who a few hours before led his men right in killing right and left. The signallers were buried in their dugout and took a lot of getting out. Until I came along no one thought of digging them out. I heard one was dead.\n\nThe fellows get callous – dropping a stretcher with a dead man in a trench and sitting round arguing the point about it. We got out of the trench and wandered across country. \n\nOur telephones worked well. I was in direct communication right through, I even our men were in the German trenches where they rigged up a line. The pocketbooks our men brought back had some photos of very pretty girls in them. \n\nHunter was quite distressed when he returned – almost raving. So does excitement work on some natures. Thank God for a cool head. I was able to talk to the artillery all the time as well as converse with our men in the German trenches.\n\n \n\nHalfway House\n","92":"\n\nSpent the day running round with pieces of paper concerning recommendations for rewards. Sergt. Major Yeadon busy taking in stores. Big flight of aeroplanes today and some good \"woolly-bear\" shrapnel bursts near us. Heavy bombardment in the twilight owing to the Allemand sending out smoke opposite the New Zealanders. Roar of guns down south.\n","93":"\n\nUneventful, saw everyone back to their own regiments. N.Z. officer arrived while I was taking over from Bunning in the new position. Complementary letter re our raid came to hand from General Birdwood. \n\nA quiet sunny afternoon. Glad to get back to my own lads who have been getting plenty of fatigue and little rest. They are all nervous and fired after the heavy shelling they have had. \n\nAbout 11.30 we made on the right an unsuccessful attempt to raid the trenches of the enemy. The accompanying bombardment was heavy – one gun just directly behind here kept letting out two ear splitting barks to the minute. \n\nThe bombardment lasted for nearly and hour and it struck one as resembling chimes or a giant organ. First there was the strident bark of the nearest gun and the subdued low base notes of the distant batteries. Then the mingled sound of 18 pounders and the heavy \"phut\" of howitzers keep joining in making quite a variety of notes joined in one crashing piece of music. The bass was most striking – all slight pauses were filled it with this undercurrent like the chimes of some giant bell. \n\nThe enemies reply was limited to the duration of our fire and this far back consisted of some heavy crashing shells that shook the whole place with their concussion.\n","94":"\n\nAfter break of day there being no \"stand to\" here, I turned over and slept till 8.30. During breakfast the enemy started to shell a working party of about 10 men who were repairing with sandbags a breach in our line here. Some of the shells came very close but one only a few yards away\n\nBois-Grenier Line\n\n3\/7\/16\n\ncaused me to give quite an exhibition of \"nerves\". An involuntary duck which caused my cup of tea to splash all into the marmalade! More shells followed and dug big craters. Fritz has recommenced putting up his observation balloons. \n\nDuring the evening a flight of cranes came flying over in echelon squawking loudly. A warm sunny day today. \n\nBeing in the trenches &c. so long has made the men very careless about their appearance and neglect of shaving & clothing is apparent. Will commence the shaking up process in a day or so. \n\nTonight having been relieved by the N.Z. we proceed to march 10 miles to La Creche and will be marching all night as the men are loaded up with packs it is proposed to march 30 minutes and rest 10 in intervals. It will not be easy to forget the unnerved unhinged men after their experiences in the raid!\n\nCarwick quite upset, kept repeating \"poor dead men\", \"poor chaps\". \"3 dead men lying on top of me in a shell hole\" and so on just like some one babbling. Although the big \"push\" is in progress down on the Somme we hear very little of it here except at night when the guns roar to some purpose.\n\nJust about 10 pm as our relief was about to start the enemy opened up a heavy shelling of the line to our left and sent up single red flares. In a second or two flashes were illuminating the whole line and our batteries opened up. It was a fine fireworks display to watch but too noisy and the poor devils up in front were getting hell put into them. Our transport was in process of shifting our gear & had to imshi. \n\nSigns of slackening at 11.10 pm. Later it was rumoured that the enemy had raided our lines at L’Epinette. The 2nd N.Z. Rifle Batt. relieved us during the strafe and we moved out via La Chapelle. The roads were awfully congested, a N.Z. batt & and our 23rd were coming out as well as ourselves and kept crowding up. The fellows felt their packs very heavy. We turned over the Steenwerck bridge close along the towpath and marching on to Jesus Farm.\n","95":"\n\nEnemy shells had started a fire in Armentieres & its fitful glare lit up our path as we went along.\n\nStenwerck & La Becque\n\n4\/7\/16\n\nNear Jesus Farm the 23rd had their cookers all at work ready to dish up a meal of bacon & tea. Lay down on the ground and had a long wait until about 4 am. Nearly all of us were fast asleep lying in equipment. Roused and pushed on in the growing dawn, all the men labouring hard under their heavy packs and feeling the foot soreness very much.\n\nPassing showers wet us as we came into Stenwerck. This is a quaint little town with a fine church. The sound of bells ringing was home like. From here the country becomes remarkably pretty and much like Roquetoire. All the wheat and oat crops are heavy in ear and there are also acres of beans and other greens. The whole landscape is a delightful emerald green most restful to the eye. \n\nWinding roads and lanes with hedges and tree fringed brooks add to the delight of this scene. The houses are all old and pretty looking very neat and comfortable and not blown about and ruined like those we are by now quite used to seeing. \n\nOn the outskirts of the town we got into single file and wound our way through a pretty little overrun path and them among the growing crops. The fellows were just about done up by now and could hardly struggle into the billets. To our disgust the billet we were to put the men in was a barn that was not fit to be the habitation of pigs far less of men. A lousy filthy place wet and reeking. To crown all after their 10 mile march there was no breakfast! The transport had been messed up with contradictory orders and there was no food for the boys. \n\nI was raging & stormed up to the C.O. and got things properly stirred up. Gave Sgt 20 francs to buy food for the men and later went out in heavy rain and allotted decent billets to which we moved later! As soon as possible after arrival all threw themselves down on hard floors and slept like tops without any covering at all. Hardened veterans now.\n\nA noticeable feature in the fields was little thatched haycocks like stooks of hay, some of the buildings farmhouses &c. are very old and bear the date on their walls by means of light coloured bricks let in to the brickwork. \n\nThe little shrines by the roadside in some cases look very old but the earliest date noticed on one was 1852. In the cemeteries one notices that all tombstones are wooden and dates all recent. This is accounted for by the fact that the grounds continually being reused the graves being all dug up every five years and the bones removed. No one is allowed to buy land in perpetuity here.\n\nLa Becque\n\n4\/7\/16\n\nIn nearly every farm building or barn in the outside walls is let in a little niche with a glass front containing little sacred images usually coloured white. \n\nAll sugar used here is loaf sugar made of beet, the sweeting power is small. The salt is coarse and strong. Pepper is also coarse. The women are all great adept at making omelettes into which they introduce quite a number of different ingredients just as if they were mixing a cocktail. They also exceed in making delightful coffee which is always served up in small bowls.\n\nHeavy rain continued all the afternoon but after the men had finished their tea we moved a mile further down into clean wholesome billets with plenty of straw. Mackay’s billet was especially good being a fine brick farm with enormous lofts that would take a battalion. A fine old farmer here. Their house very comfortable and officers quarters good.\n\nTired out tonight. The country people of France appear to me to be a most chaste sober folk and genuinely & intensely religious and to some extent superstitious. \n\nAlthough a large soldiery is constantly moving round, the women appear to be very decent and preserve their chastity to all appearances. No undue amount of immorality is seen outside the usual regular brothels which are meet with infrequently. The soldier who trys to seduce a local lady is always politely rebuffed but in the most naïve way they discuss the merits of respective known gay houses & direct the men there to. \n\nIn houses the chief wall decorations seem to be certificates of confirmation and first communion & framed coloured souvenir pictures of certain sacred hearts &c. Crucifixes are in every room. Photos showing family groups are rather rare but when the family sits the local curie is generally among them and some religious festival is made the occasion for the picture so all can wear paper medal, ribbons &c. \n\nMy room tonight contains an old wooden bed which is not lonf enough for a six footer. Slept soundly until the morning.\n\nSteen-Je\n","96":"\n\nUp at 7 for early morning parade in the trim little green meadow. After breakfast marched to battalion parade ground and then returned and carried on with platoon work & rifle exercises. All very rusty after being off drill so long. After lunch did battalion drill and then the same as the morning.\n\nAt 4 pm met Bert Curnow and we found our way to Bailleul proceeding by winding pretty lanes. These twisting ways are very disconcerting for the place you are steering for is now in front, not on your right and then a few minutes after on your left. The town (13500) is chiefly noted in these days for the rapes & atrocities committed there by the enemy. It is a Flemish style of town noted for its hand made lace of which we saw quantities in shop windows and many women had the little lace machines.\n\nThe town is built on a hill and clusters thickly round its big church & town hall just as if it had been walled and made compact for defensive purposes. There is a fair sized square in front of the town hall where no doubt market is held – today there was fishmonger’s booth there. The Hotel de Ville is a fine old place dated 1536 and has a square tower with peculiar globed top. Its many bells give it a novel look.\n\nBehind it is the Church of St Vaast which is dated 1609 and has a square old tower. The door is finely carved. Inside the place smells very stuffy owing to lack of ventilation. It is a big church with the usual praying chairs and an elaborate carved wooden pulpit. The oak panelling carved into medallions. Windows recent. Plenty of side altars. The confessionals are wood hand carved to resemble curtains and quite deceive one at first being so cleverly done. There are no mural tablets to indicate antiquity but the altars are wooden carved & have Latin inscriptions. \n\nAn old priest with flowing white locks delivered a great haranguer from the pulpit to the congregation and a girl sang a solo from the organ loft. The old priest was wearing a white surplice and the remark \"that the chap evidently belonged to the Druids\" was a trite one. \n\nBehind this church is another (1639) smaller. It was awfully stuffy and musty inside. There were some fine and an altar to Jean d’ Arc as Notre Dame de Low. \n\nBailleul\n\n5\/7\/16\n\nWe passed the 2nd Casualty Clearing Station outside which was a great fleet of ambulances. An excellent officers tea room is close handy where we had afternoon tea and later a great dinner of asparagus strawberries &c. Unearthed a branch of Burberrys and also another officers clothing place very reasonable in prices.\n\nThe Tommies about were mostly ASC &c. & very slack saluters. Going in we passed a few brothels.\n\nBed early.\n","97":"\n\nEarly physical drill parade, morning battalion parade. Route marched through leafy lanes delightful country Bailleul looks down from its hill, the Hotel de Ville & Church of St Vaast standing out prominently. In the afternoon drill.\n","98":"\n\nParades ditto. Reorganized whole company on consolidation basis for attack carriers, bombers &c. Pay after tea.\n","99":"\n\nEarly morning received orders to move. Roads very slippery for the horse. We shall be very sorry to leave here as the little place is so pleasant and quiet. The thick grass underfoot everywhere is just like a carpet – soft and springy.\n\n"}}