{"Document Name":{"0":"Diary_0494","1":"Diary_0494","2":"Diary_0494","3":"Diary_0494","4":"Diary_0494","5":"Diary_0494","6":"Diary_0494","7":"Diary_0494","8":"Diary_0494","9":"Diary_0494","10":"Diary_0494","11":"Diary_0494","12":"Diary_0494","13":"Diary_0494","14":"Diary_0494","15":"Diary_0494","16":"Diary_0494","17":"Diary_0494","18":"Diary_0494","19":"Diary_0494","20":"Diary_0494","21":"Diary_0494","22":"Diary_0494","23":"Diary_0494","24":"Diary_0494","25":"Diary_0494","26":"Diary_0494","27":"Diary_0494","28":"Diary_0494","29":"Diary_0494","30":"Diary_0494","31":"Diary_0494","32":"Diary_0494","33":"Diary_0494","34":"Diary_0494","35":"Diary_0494","36":"Diary_0494","37":"Diary_0494","38":"Diary_0494","39":"Diary_0494","40":"Diary_0494","41":"Diary_0494","42":"Diary_0494","43":"Diary_0494","44":"Diary_0494","45":"Diary_0494","46":"Diary_0494","47":"Diary_0494","48":"Diary_0494","49":"Diary_0494","50":"Diary_0494","51":"Diary_0494","52":"Diary_0494","53":"Diary_0494","54":"Diary_0494"},"Date":{"0":"unknown","1":1516.0,"2":1517.0,"3":1518.0,"4":1519.0,"5":1520.0,"6":1521.0,"7":1522.0,"8":1523.0,"9":1524.0,"10":1525.0,"11":1526.0,"12":1527.0,"13":1528.0,"14":1529.0,"15":1530.0,"16":1531.0,"17":1532.0,"18":1533.0,"19":1534.0,"20":1535.0,"21":1536.0,"22":1537.0,"23":1538.0,"24":1539.0,"25":1540.0,"26":1541.0,"27":1542.0,"28":1543.0,"29":1544.0,"30":1545.0,"31":1546.0,"32":1547.0,"33":1550.0,"34":1551.0,"35":1552.0,"36":1553.0,"37":1554.0,"38":1555.0,"39":1556.0,"40":1557.0,"41":1558.0,"42":1559.0,"43":1560.0,"44":1561.0,"45":1562.0,"46":1563.0,"47":1564.0,"48":1565.0,"49":1566.0,"50":1567.0,"51":1568.0,"52":1569.0,"53":1570.0,"54":1571.0},"Entry":{"0":"\n\n \n\n","1":" London\n\nFeeling rather tired did not go out until about 11 o’c and then walked to Leicester Square there taking the tube to the Bank. Found that there were no letters for me and then tubed back to Piccadilly. Before that, had lunch costing 8d at a Lyon’s cafe. Much struck by the tired wornout looks of many of these women workers. Poor neurotic sweated looking things.. Some very pretty girls among them but they have no colour. In the tube the type of men is undersized and weak looking. To the New Theatre to see \"Peter Pan’ which I much enjoyed and then walked up the Strand dining at a cost of 10d. A dark thronged street this. Tubed back to hotel about 8 pm.\n\n \n","2":" London\n\nWent up to Piccadilly Circus and had a shave and haircut. A fair sample this morning of a London fog, one could not see very far in front and crossings were dangerous. Tubed up to the Bank and got a fair number of letters there and then walked round Cheapside and St. Pauls. Had a look in at St. Sepulchre’s Church – it look like one too with fog wreathing its interior! Here they have a tablet recording pealing of the bells and also they have the old hand bell that used to be rung outside the condemned hole before executions at Newgate opposite. As the carts passed this church it was customary to give a bunch of white flowers to each of the doomed men. There is also a tablet to John Smith of Virginia which records his wonderful achievements and also how he has come at last to be the firey\n\n \n\n30\/1\/18 London\n\nof \"worms and flyes\" Lunched for 10d at a Lyons cafe and then went into Old Bailey and heard the Recorder try and acquit two soldiers for assault. Then heard part of a case of procuring charged before Judge Athelan Jones (?) Walked down Fleet St. and then to Blackfriars bridge where I bought a surprising number of packets of biscuits for 1\/6 and had to carry this large parcel back via tube to Hotel. There cast off my mufti and resumed uniform once more. Packed up all my belongings. Went for dinner to Ye Olde Cheshyre Cheese in Fleet St and in the old place dined off the Pudding Pancake Toasted cheese and Ale having as table companions an NSA naval officer and his consort! To hotel about 9 and did some writing. The whole city very dark after sunset.\n\n \n","3":" London\n\nRose at 6.30 and bathed and breakfasted. Slung a few tips around and then made for Victoria station. There is no doubt at all that tipping gets you wonderfully well served. Here a few pence got my heavy bag carried and myself led to a corner seat in the covered part of the train without having to run round finding out myself. The morning was foggy and raw and as we ran out of the yards fog signals were detonating on the rails. The fog was too dense to see out of the window at first but later the sun came out and the weather was splendid. We ran through pleasant country all brimmed with frost and entered Folkstone about 10 pulling up well down the pier and not far from our boat. Embarked with crowds of others. A contingent of Chinese was embarking on another vessel close by\n\n \n\n31\/1\/18 London – Boulogne\n\nWe were part of a convoy accompanied by torpedo boat destroyers. Although the sun was bright and the water calm the temperature became very cold & made the trip disagreeable. Pulled in at Boulogne at 1 pm and made for the EFC Officer’s Club which is splendidly comfortable. It is staffed by W.A.A.Cs and I noticed them also at the Signal Office. Very neat and smart in their brown uniforms but what an atmosphere for a young girl. At lunch we had ample white bread and a flowing sugar bowl which was much appreciated. Walked down the promenade by the beach. The town is built on rather a steep upward slope and some of the streets are stepped like stairs. Along the quays were plenty of fishing craft and fishermen in loose red blouses. Rather dark looking class of people talking volubly in French.\n\n \n\n31\/1\/18 Boulogne\n\nand gesticulating. From the sea front there seems to be only one entry to the business portion of the town and the streets are winding & narrow. There are some fine shops and buildings and it was almost an English crowd. Red Cross Workers, VAD nurses, soldiers of Britain and the dependencies. Many schools out walking under the guidance of priests – all the youngsters dressed uniformly. Retired to Club about 4 o’c. The place is heavily staffed and there are far more waitresses than there would be if this was a private concern – one more instance of the wastefulness of Military labour. Dined at and spent the evening at the Club which is hardly large enough but is nevertheless a splendid institution.\n\n \n","4":" Boulogne\n\ndid a fair amount of reading at the Club during the morning. A fine sunny day. Walked out after lunch and noticed the dirtiness round the quays. Tough looking old fishers and their women hereabout. Nothing doing up the street but, at a picture sellers was rather nauseated by the French taste and their glorification of intrigue. At the Club the decadence of the class of officer noticeably subs drinking on until boozed. Caught the 4.17 train for Desvres a distance of 16 miles which took two hours to do. Had arranged to meet the messcart here but it was missing so I was stranded on a dark platform miles away from anywhere. Met our party en route for the 6th T.B.and then set out on a voyage of exploration and found a Wing of Divnl Rest Camp.\n\n \n\n1\/2\/18 Desvres\n\nThey fixed me up with a billet at a house of a woman whose husband is a Lieut. in the French Army, and a prisoner of War in Germany. Two little old fashioned kids. Chatted away to the family in execrable French and Madam made some coffee and an omelette. A lively person this and she speaks a bit of English. The children showed me their school books and their dolls. the bedroom is a small one upstairs and is void of any religious pictures at all – rather unusual in this part of France. A neighbour looked in and we had a yarn together. The French get on better with us because we are sociable and polite to them and not proud and standoffish like the English whose manners & ways they cannot understand.\n\n \n","5":" Desvres & Selles\n\nAbout 9 o’c Madame prepared some coffee and I had some bread and butter. Then set off to find a means of rejoining the Battalion. A fine clear day. Was lucky enough to strike Capt Ross of the D.A.C just on the point of motoring to DHQ and he ran me up there. A drive along pleasant roads all the twigs of the trees thickly ice encrusted and looking most beautiful in the sun. Reaching the D.HQ I saw Col Durrant & others and had a yarn and then Ross drove me along quiet pretty roads right into Selles where the old purple and reds again hove into sight. Was soon settled down in a billet on a farm owned by a prosperous family. The young son who spoke good English has the Croix de Guerre and Medaille Militaire and an artificial \n\n \n\nSelles\n\nleg. having lost his at the Somme. Went to the mess and met all the chaps again and afternoon was devoted first to a conference and then on odds and ends. At dinner we had formal mess and they drank my health on my return from leave and also that of Matthews. A good pleasant mess. After returned to billet and did some transfers &c &c and read screeds &c. Yarned with the family and had a café with then – three rather nice mademoiSelles the eldest being somewhat of a beauty. Matthews and Sutherland came along with a good many things that needed attention so the evening was a busy one towards its finish. A dark cloudy night and looks like snow.\n\n \n","6":" Selles\n\nA busy day. Prior to church parade took a walk round with the General who came to the parade, having first had a look round some of the billets and their surroundings.This is a pretty tiny village and must be lovely in the Springtime. After church parade took the G. to my billet and there yarned to him. At noon made for the mess where he lectured all the officers and then met all those who had joined since he was last here. After mess he rode off. Spent the afternoon going through papers and getting up to date in the happenings of the last month. After mess in the evening continued at the same and had various interviews with one and another. About 9 went down to the Regimental office which was\n\n \n\n3\/2\/18 Selles\n\nbusy with typewriter and clerks. The amount of paper used in this War is something enormous and seems to increase. Returns and memorandums of all sorts everywhere – no wonder they are kept busy. Old P.V. Martin is in trouble once more and now in the guard room. Put different specialist officers on to new jobs - JA Smith on the Lewis guns, Greene on the Musketry &c and hope that these new brooms will sweep clean. Owing to so much business I have had no time to talk with the family here today beyond ‘Bon Jour’ and ‘Bon Soir’. There is a decidedly good looking wench & full of blushes. The small one’s a little flapper. A dull raw day and fuel for fires is short.\n\n \n","7":" Selles\n\nA dull but mild day. Went round to \"C\" Coys billets and saw them at work there and had a talk about NCOs and the company work generally. The carrying out and the supervision of training here is going to be a matter of some difficulty owing to the way the billets are scattered. The country here is very English in its aspect having many hedges and trim whitewashed thatched farmhouses. At my billet the usual dirty midden is absent but at our mess room there is a splendid example of it. In the afternoon went down to ‘D’ Co – two companies had baths today. At 4 o’c I was entertained to a coffee cognac and liquers by the family to whom M le Cure was paying a visit. For 21 years he has lived in\n\n \n\n4\/2\/18 Selles\n\nthis tiny quiet spot. He spoke much of politics and religion and I followed the gist of his French. With all these people the Foreign Legion has a great reputation – a corps d’elite with the fourragere of the legion of honour. Tried a case at Orderly Room. After mess had a talk with the company commanders over the work for tomorrow. A pleasant hour at the mess with good chaps. the night was very dark with a cold wind and my sore throat has come back once more. Our band is just now at the Army School and is much missed. We are hoping to get them back soon. This life is so quiet that we will have to go to great trouble to provide entertainment &c for the mess\n\n \n","8":" Selles\n\nWalked down to \"B\" Coy who are some distance out of the village along the pleasantest secluded country lanes which must be lovely in the Spring. Found most of the men engaged on making a miniature rifle range Later the doctor came down and gave a lecture on VD. Just close to the town is an old burned down chateau. After lunch rode around the billets and inspected the Transport lines and the Signalling School and the School of Instruction. After mess went to BdeHds saw the General (Paton) arranging matters re P.V. Martin and others. He goes on leave in the morning leaving me in charge. On return handed everything over to Matthews and did a lot of writing. A sore throat and a bad cold just like before going on leave last. Rotten\n\n \n","9":" Vilinghem\n\nTurned out at 6.30 and at 7.30 rode down to Bde.H.Q.. A chilly morning with some drizzly rain. The country here is remarkably well wooded and closely timbered. Every little farm has its fields bordered by trees and its small copse and all the winding roads are hedge bordered. On arrival at BdeH.Q. I breakfasted with the General Paton who handed over the command and motored off to catch the 10 am boat at Boulogne. The headquarters are in a chateau or large two storied house. The owner is a Judge of the French Court who has a few other houses and does not reside here. It is remarkable how careless people on small units like this become. The personnel of Bde.H.Q. appear to be dirtier and more slovenly than any of the men in a Battn, Stewart acting as Staff Captain goes this morning to visit the 21st Battallion.\n\n \n\n6\/2\/18 Villinghem\n\nQuite a remarkable number of people are at present on leave – the 3 BGs and MG Smythe goes in a few days time so there will be a battalion commander in command of the Division. The Staff here is completely different to what it was a short time since. Capt Sale is acting B.M. and Capt Stewart acting S.C. both Regimental officers. Last night had some interesting conversation with the good people at my billet about some of our war experiences and the best method of reclaiming the devasted areas after the War. French politics and a certain amount of religion also formed topics. Their politeness and courtesy are formal to the extreme. Black coffee in small cups is the popular drink. A small glass of cognac is served with it. After drinking half the cup of coffee they pour in the cognac and then drink this\n\n \n\n6\/2\/18 Villinghem\n\nslashed mixture. If desirous of being ceremonious they will also serve another small glass of cordial and the drinking of this furnishes an excuse for all rising and much bowing and good luck & \"best of health\". The girls of the house sit round bovinely and do not enter into the conversation unless directly addressed when they bridle and giggle. Yet these girls are of the same stock and constitute the recruits who make up the little finished Parisiennes of the city. The little church in the centre of the village is surrounded by wooden grave crosses and is perched on the highest little knoll in the centre of the place. The Angelus sounds at 7 am and 6 pm. I was to have paid a ceremonious visit to M. leMaire who is a fine neat and alert old man of substance but circumstances arose which prevented me from calling on him. At\n\n \n\n6\/2\/18 Velinghem\n\nthe 23rd Battalion yesterday a man was checking the aim of another with an aiming disc and a live round somehow got into the rifle, killing the man with the disc. He was buried with full Military honours this afternoon by Padre Campbell. Rode down to see Col James 24th Bn. at his billet at Lottinghen – only a short ride and had a long yarn with him there. Also had tea with him and other officers at their billet. James then walked back to Bde H.Q. and we enjoyed a good long yarn about affairs in general. Following on the matters of P.V. Martin’s promises to the General yesterday it is interesting to note that he was today in a neighbouring village and has ceased playing the game already. Each battalion has a motor lorry attached to it for leave\n\n \n\n6\/2\/18 Velinghem\n\nmen going to Boulogne. It is a bad place for canteen stores and Etaples would be much better. Attached to Brigade are two interpreters Mayes (French) and Albrecht (Belgium) both decent chaps and kept busy here. The people here and their youngsters are aimiable and sociable and never fail to pass the time of day in passing. Spent the evening in the Mess. Most staff work is done in the evening and between 8 and 10 pm. The telephones are kept busy between Division and Bde and out to the several battalions. On BdeH.Q. at present they have about 120 people mostly loafers – dirty and undrilled. The tendency on these units is for them to get careless and become uncared for & dirty in looks.\n\n \n","10":" Velinghem\n\nA cold wet day. At 9.30 am rode over to 21st Battalion about 6 miles passing through Quesques where the 23rd Battalion is, and going up hill for most of the distance. The road winds over open exposed moors which were being swept by squalls. To the H.Q. of Colonel Duggan at Fromentel and had a cup of tea and a yarn. Coad is now acting as his Adjutant. Bowes Kelly as a company commander. These will be people of importance after the War especially the latter who will be behind millions. Yarned for a couple of hours with Duggan and then rode back getting well soaked and having to change before lunch time. After lunch talked with Sale about training\n\n \n","11":" Velinghem\n\nand matters of interior economy. Then spent the rest of a blustery afternoon sitting by a fire and reading and writing. After mess walked along dark slushy lanes to 22nd H.Q. and mess and there saw Matthews and others and had a yarn. Our poor little padre came along in a great state today having received a letter from a Chaplain in the 5th Bde that there Capotes-Anglaises were being sold in a regimental canteen. He was deeply shocked to find that we had bought £5-5\/. worth for issue to leave men. Returned to Bde H.Q. about 10 pm and dealt with a few matters before turning in. A wet cold and windy night – not much good to the unfortunate people in the trenches.\n\n \n","12":" Velinghem\n\nAnother bad wet day. Walked over to Quesques to see the 23rd Battalion & reaching there at 10.30 found Bate still in bed which gives an index to the Regt. Much struck on the way over by the resemblance of this country to Somersetshire – the hedged fields and winding roads and the brown snug farm houses. Quesques is in a hollow and is a snug little mass of brown tiled and thatched roads wedged as close together as can be. In our good Australian custom had a cup of tea with Bateman and also a yarn with Jack who is well and fit! Found Pottinger the dentist hard at work in an old farmhouse busily engaged on mouths and after a yarn with him set off for home again. It rained all\n\n \n\nthe way and reached Bde very wet. Stayed in all the afternoon reading and writing and about dusk Dick Dowden arrived from Lumbers to see me and we had a good yarn about old times and recalled old friends and comrades of the Yarra Borderers. General Bob Smith is away on leave in England just now, This morning Major McColl (GSOI) and Teddy Bazeley came in for a yarn. What strikes one is the absence of advice re training and the absence of criticism from our Staff. They don’t seem to pick on points that are not all they should be. Victor, the Bde Messman is a character an Italian sometime head waiter of the Melbourne Savoy. He speaks French fluently and does well with the local inhabitants. Our 22nd mess under old Habel takes some beating\n\n \n\n9\/2\/18 Velinghem\n\nDowden rode as far as Quesques with me at 9.30 am & then rode on to Selles to see Matthews. It was a blowy dull morning. Put up my horse at the billet and went down to the Regimental Office where I found word waiting for me that General Smythe was coming over. He duly turned up with Pat OHara Wood and we had a long talk. His V.C. C.Bs., war ribbons, Medaille Militaire and Legion of Honour make a fine show on his tunic. He confirms the 3 battalion to a brigade and suggests the highest numbered in each Bde. to be broken up. We talked of manpower and the War office and he said he would hang the Armys Council if he had his way for so letting the nation down.\n\n \n\nThe scandal of pushing \"dud\" Generals and Colonels into safe War office jobs was also mentioned. Discussed decorations with him and then some tactical training proposals. The number of senior officers to be returned to Australia is, he says, going to be large and he wanted to know any useless ones. Dined with Dooley and his officers and then walked back to Selles and at the billet there saw the lad and the good looking Mslle. set out on a shopping excursion into Desvres – this place is noted for pottery, porcelain & Desvres ware. Rode back to Bde H.Q. and spent the rest of the time reading and writing or yarning with people. A very dark and windy night. General Smith CMG DSO & Bar now adds C Guerre & our old RSM Cadwell and Brodie the sniper also score\n\n \n","13":" Velinghem\n\nRode out through Ledinghem with Sale down to Watterdal and the high ground on the other side of the village. The lanes were pretty and hedge bordered and the little village of Watterdal is an old fashioned irregular one with old neat thatched moss covered farmhouses. Passing through here we gained some high ground from which was an excellent view. A strong wind was blowing and women were coming along the roads many of the accompanied by Australian soldiers. A very fine panorama from here. Went over the ground for an operation order writing stunt for Division covering some miles and traversing a couple of small leafless woods. From here we rode through Colombra\n\n \n\n10\/2\/18 Velinghem\n\na scattered rambling place, To the 21st through Harlette and had lunch at Colonel Duggan’s billet. Stayed there until about 3 p.m. and then rode back to H.Q. through Quesques. Passed a cart with one of our chaps driving sandwiched between two MSelles He gunned in passing. Peter Borwick the D.A.D.M.S and G.S.OI McCall were in at afternoon tea. Mathews came in to dinner. We had a great argument about White Australia. Afterwards Sous Lieut Mayer Armee Francaise and Sous Lieut Franz Albercts, Armee Belge argued furiously with Wright the Machine gunner about Verdun and losses and the Cambrai and Paschendaele stunt.\n\n \n","14":" Velinghem\n\nAt 9.30 met General Smythes staff at Le Grand Bois and did a staff ride going over the same ground as yesterday. The day was blustery and cold and most unpleasant. Went over the ground with Sellick and wrote the orders in conjunction with the 5th Bde staff in a billet of the French Mortars. After a bite of sandwiches rode up to the Wood & Chateau with General Smythe who rides daredevil fashion and at breakneck speed. From here we rode back along a high ridge with a great panorama stretching in both directions. Little farms, ploughed fields and cultivations lay below like a chessboard. An interesting and instructive day & educative for the Staff as well as others\n\n \n\n11\/2\/18 Velinghem\n\nRode back through Lottinghen expecting to see Colonel James but he was out. Reached Bde.H.Q. after 3.30 and found a fair amount of routine stuff there. A ride like today over lovely peaceful country without troops at all is an enjoyable preparation for the real thing. It only wants a little imagination from one who knows to picture the whine of shell and whiz of bullet over the scene and the aftermath of stinking corpses and living pain. War is becoming scientific murder as soft flesh and blood have no chance against hard steel. All the hedges hereabouts are commencing to bud and on the trees are all the little green nodules of early Spring\n\n \n","15":" Velinghem\n\nSpent the whole day in bed feeling very unwell owing to an over dose of J.Walker the previous evening. Having a head could not help noticing what an amount of noise there is about the place. Some of the men had put up a swing in some trees & this was a source of great delight to the little French kiddies around who flocked to it chattering and squealing as loud as they could.\n","16":" Quite recovered and carried on. A drizzly wet day. Went down to the 24th and yarned with Col. James. Received an invitation from Matron and Sisters No 2 AGH Boulogne for an evening and sent two lorries with forty officers. James is in a comfortable billet & Madam’s stove gives out great heat. Returned to BdeHqs and Peter Borwick came in\n\n \n","17":" Velinghem\n\nto lunch. After this walked down to the 22nd and saw Matthews & then put in the afternoon with the French family at the billet. Found the elder M’selle – a girl of 19 – quite passable to talk to. Very nice dimples. Mere & Pere also came in later on and we drank café, cognac and Geneve (gin) – the two latter out of tiny glasses. Talked nonsense in pigeon French. The son 25 MM& C Guevre speaks English well having learned for 5 years at St Omer. Returned to BdeHqs in time for Mess. Franz Albrechts the Belg. interpreter is a studious youth of 19 and will be a fat old Fritz at forty. Our talk after mess turned on ghastly wounds and was rather gruesome – the things we discuss would chill one.\n\n \n\n14\/2\/18 – Velinghem\n\nAt 9.30 rode down to the 22nd Bde and first of all inspected the NCOs School of Instruction on the ground at the Rifle Range. Then went along to \"D\" Coy and inspected the billets and from there on to \"C\" Coy for a yarn with Major Dooley. Returned to the mess and dined there having a yarn with Sparrow and others who had returned. Tayles was evacuated today. The A.D.M.S. came round & inspected our details. After mess rode out to \"B\" Coy and saw them on the range. They have few men after taking out all details. Talking to some men here they told me that they know of a fair number of bigamy cases, that many cables for money are going home and that the snifters of London are known as\n\n \n\n14\/2\/18 Velinghem\n\n\"Strand grenades\" from the numbers who get blown out thereby. In the morning had seen Groves doing a lot of bombing work. We have here three canteens altogether. Rode back direct to Bde.H.Q and wrote some letters. Hogge dined with us. Hearing that the Red & Whites were scrubbing their equipment I got on to Matthews to do the same so as not to get left Hereabouts the roads are kept in good order by very old chaps who potter around using metal. A good many trees are being felled round about for the use of the Boulogne bakeries. Wright is in charge of the Brigade Troupe of entertainers and has been showing in the different villages. Late afternoon was wet and drizzly\n\n \n","18":" Velinghem\n\nTo Quesques to see Pottinger the dentist and had an impression taken and then saw Bateman at his headquarters. We had a cup of tea in good Australian style and then to horse and went out to look at a Training area up on the top of high Moors overlooking the village. Up here the air was bracing and cold and we looked down into a large basin full of little farms and criscrossed with hedges woods and lines of trees. Back to the village passing several wayside Calvaries of the type so popular round here and dined at the 23rd H.Q. Mess. The sun came out faintly after lunch and the 22nd marched in to the football ground headed by the band and the football team came\n\n \n\n15\/2\/18 Velinghem\n\nsoon after in a motor lorry. After an exciting match the purple and reds won by 2 goals. Great barracking. Returned for yet more tea with Bateman and returned to Velinghem just at dusk. The roads slippery with the renewed cold. At Bde.H.Q. they have a rotten smoky brazier that sends smut all over all. Tonight is paynight for the troops. We drink much tea – we Australians. The French people take tea as a medicine using it to get thin so they say. In the Army it is bad taste to ring up between 6.30-8 pm. everyone then being at mess. Conversations recommence after the latter hour when people come back into their offices and ready to carry on with the War.\n\n \n","19":" Selles\n\nWent over to Quesques and saw the dentist Pottinger. The day was a lovely one and there was a good frost. All the roads were hard and ice was on the ponds but the sky was clear and cloudless and we had bright sun. Rode to Colonel Brazenor and others who were inspecting high ground suitable for a training area. The land here is moorland and from the top of the ridge there is an extensive sweeping view for many miles. A great basin full of snug villages and farms formed a splendid and memorable sight as everything was bathed in golden sunlight. We rode back then and I lunched with Brazenor at his billet and then we both went back to Bde.H.Q where I handed over commission of the Brigade to him. It was such a fine afternoon\n\n \n\nthat I sent the horses on ahead and walked over to Selles, there having a great yarn with the Lefevres and drinking the inevitable coffee. At mess had afternoon tea and listened to our new London records. At dinner had a good yarn to different officers as we sat round the fire. Some have recently returned from Paris in very good fettle – Lennon & Kennedy had their wives down there with them. After mess Charlesworth put a fire in the sitting room and worked there at odds and ends going into money matters with Froomes and getting a grip on the show generally. Quite a deal of correspondence to hand and more anguished Mother’s letters to General Birdwood whose time must be well occupied by dealing with them all.\n\n \n","20":" Selles\n\nAnother clear sunny day, all the pools frozen and the ground ringing underfoot. Church parade in a field at 9.45 a good attendance The Band playing. The equipment was not cleaned to my satisfaction so I roused the Company Commanders before moving off. The Band played on its way back to the village and a number of civilians and a French soldier or two also followed – rather amusing. Between now and lunch I interviewed a number of different people. Lunched and then had a conference with the Band N.C.Os – musicians are as fickle & hard to handle as women. The Band played a programme during the afternoon At 3.30 rode out with Sutherland to the neighbouring high moors\n\n \n\n17\/2\/1\/8 Selles\n\nto go over some tactical schemes Bitterly cold on top here despite the sun. Little villages with their churches clustering in every valley. Winding lanes through which one’s way is hard to find. Back to billet and there yarned with the family. Several farmers called for the loan of men for farm work. A bowed old dame came in and said she went to Mass if only to pray for Peace, Victory and Deliverance. Two of her sons are dead on the front and she burst out crying so we changed the subject of discussions To Mess – always a pleasant time with us as the lads are all good chaps and gentlemen. A clear moonlight evening . A fire in my sittingroom & M. leCure came in for a game of cards with the family\n\n \n","21":" Selles\n\nHeavy frost but continued good fine weather. An extremely fine large Battalion parade ground close to where our Battn school of instruction is. Would hold a Brigade easily. Tested the various N.C.Os in the school and found them excellent on words of command but weak in detail. Fulton’s company on the platoon demonstration work. Our school instructors – Barker, Sgts McDonald, Bregenza, Draper and a Tommy bayonet fighter. Rode out to \"D\" Coy after lunch and found that they had very few on parade owing to so many details being out of the Company. Then to \"C\" Co who were down for recreational training and found a fierce football match in progress all in and great fun. Their programme was recreational\n\n \n\n18\/2\/18 Selles\n\ntraining. A very pretty spot, hedge lined roads and a very large snug farm house surrounded by woods. Inspected the Canteen and the A.M.C. and then made for the Regimental Office there to hold Orderly Room and to interview sundry people. Back to my billet and had a talk with my good friends there and eventually persuaded them to play and sing. Their prononciation of a couple of English songs was comical. Good honest people whom I like. Dined at the mess and talked mostly of football and other Sport. Arranged to get some cups and things from Paris – better than going \n down\n to England for them. Writing cards and other work in the evening at my own billet.\n\n \n","22":" – Selles\n\nA busy day with a warm and pleasant sun. The days are now lengthening out a good deal. On the Battalion parade ground we watched the School at work. Dismissed platoon then went over the course – Decided to prohibit rifle firing on the range here as I consider it unsafe. The height behind is covered with very dense wood and undergrowth through which it was impossible to force a passage All sound travels a long way today owing to the frosty conditions. At my billet before lunch G.S.O.II Borwick and B.M. F Sale came in for a yarn. Lunched and then went down to see \"A\" Coy’s football match. A few men on live bombing. A running stream near here turns an old Mill\n\n \n\n19\/2\/18 Selles\n\nwaterwheel. At 3o’c inspected the men and horses of the Regimental transport and got a good turnout. The horses are looking well in spite of a reduced ration and our painters were at work on the limbers. In the transports we have a number of elderly men and they are a very happy family. Mostly country chaps they are great stay at homes and amuse themselves in their own little circle. Knowing that they are on a good job they look to their behaviour and we get no orderly room cases from them. After mess held a conference of my O.C. Coys Dooley Kennedy Fulton & Mackinnon and discussed generalities. At mess we drank the King and the dinner was excellent. Old Habel & Cutler are a good pair.\n\n \n","23":" Selles\n\nThe fine weather has evidently passed for today is wet and windy. Rode down to the \"B\" Co and found all there all early on at work Had my groom Murphy back again today from leave. Most of the farmers are ploughing but there is no trouble in getting parade grounds so far. Visited A. & D. Coys at their work & also inspected the Regimental Canteen. At 10.45 inspected the Schools of Instruction – Scout, N.C.Os and Signallers – who were drawn up under their officers. The Band played during the inspection and then the Adjutant closed the parade to close column and I addressed them. Headed by the band & looking very smart they marched back to the village and dismissed Colonel\n\n \n\nJames came over to see me and stayed to dinner with me. Afterwards it was met and I rode over to see the dentist at Quesques returning to our football match with the 6th Bde.H.Q. at our ground. This was a mud scramble and our chaps ran over them. Stayed in the mess talking until after mess. Sparrow gave an excellent talk on his trip to the Salvage Works at Calais and the methods they have there for remaking gear. At my billet spent the evening talking to the Lefevre family in bad French and reading aloud with the son from a manual of conversation. A very amusing & instructive night and I am afraid that by talking on I kept the family rather late out of bed.\n\n \n\n21\/1\/18 Selles\n\nFortunately the weather has cleared up and a bright sun was shining when 160 men marched out 8 kilometres to Lottingen to carry out musketry on the range down there. Went over to the Battalion parade ground where \"A\" & \"C\" Coys carried out artillery formations – a practice we are very rusty on - and made a good job of it. \"B\" Coy were in the meantime slogging into the making of a bombing ground. It was a lovely mild and sunny morning and a thing of joy to be alive. McLeish of \"D\" Co is doing good work and is now an S.B. One of the oldest heads and a good chap. Morey has returned from a safe job to join the boys in the front line once more.\n\n \n","24":" Selles\n\nAfternoon Rode down to the Bombing ground and saw all \"D\" Coy working hard entrenching with pick and shovel. Then back to Battalion parade ground where were \"B\" Coy doing their artillery formations. It looked very well. Then made for A Coy who were doing the picture of a raiding party and who later went down for a bath. Tried a case at Orderly Room and then had some afternoon tea at the Mess. The old RSM (Cadwell) now wearing his ribbon of the Croix de Guerre Belge presented by the one and only Birdwood yesterday. After mess yarned with the MSelles and then settled down to a busy evening of writing and detail.\n\n \n\n22.2.18 Selles\n\nA dull and blustery day & had all the men on cleaning equipment and kit inspection. Rode around the companies calling at B & C and staying for a while at the former and watching the work Peasants at work in their fields under the shade of adjacent Calvaries. It is hard to find one’s way round these twisting lanes. Rode back to Bn.H.Q. and did some cleaning up there and then had all the O.C. Coys paraded for a thorough roaring up about lateness of return and parades etc Rodda returned here today from leave and is a splendid dear chap whom everyone loves. After lunch all the companies marched down to the football match where a marque had been erected and where they band was performing. The 6th F. Amb\n\n \n\n22\/2\/18 Selles\n\nput in a good team against us but after a most exciting game we won by 2 goals. Colonel Moseley and others came round to afternoon tea at the mess. Great enthusiasm & celebration over our win & dinner was a noisy meal. Afterwards Matthews and myself dallied and yarned until everyone was out of the mess and so saved too much jollification. Some of our chaps have completely \"blancoed\" their equipment and the guard was a very smart sight Issued orders forbidding it in future. Walked down to BdeHqs and had a yarn to Brazenor. We move on 3rd Rumors of 4th & 5th Divs hopping over. M. le Cure was in before tea & we had a yarn and a glass of geneve gin. Yarned with family.\n\n \n","25":" Selles\n\nCalled by batman (Charlesworth) at 7 am and at 8 was abroad to see B & D Coys ready to match off to the rifle range at Lottingen. Then round to the mess for some breakfast. At 9 am held orderly room and tried a few cases of AWL and overstaying leave. Then did some writing prior to attending conference at BdeHq. Rode down there with Carrick and saw General Paton and Colonels Brazenor & James. A good and interesting conference rather different to some we have attended. The General had some figures of interest re man power. We also while here fixed up the question of previous Brigade Sports. Back to my billet for some lunch & \n\n \n","26":"\n\nto bandy words with Mademoiselle Inge and the other good people of the house. To horse again at 12.30 and rode down to Lottinghen to catch James’ leave lorry for Boulogne. A long drive but a pleasant one through very pretty country. The motor lorry was a fast one and got over the ground very well. The forests en route are being gradually cut out being thinned scientifically instead of being cleared. The French in this thickly timbered country of theirs are far more careful of forestry than we are in our very sparsely timbered land. After passing through several larger villages we ran down into Boulogne. The first prominent\n\n \n\n23\/2\/18 Boulogne\n\nobject to heave into sight was the tall Napoleonic Monument which on a dominating point gazes over towards England. Our lorry ran down into the town and parked in the square near the Church. Went to the Officer’s Club to put up but they directed me to the branch opposite the Station which it seems they keep for Colonels. Got a room there and then walked out to Wimereuse along the beach front. The tide was out and some fisher-wives were on the sand with their nets after shell fish. Many officers about and very many W.A.A.C’s. Some of these girls are very neat and good looking. They walk about with the Tommies and there seems\n\n \n\n23\/2\/18 Boulogne\n\nmany innocent acquaintances. The Anzacs are popular with them & I noticed a few rather tough looking W.A.A.Cs. It seems our chaps had a shooting affray with Portugese (called Pork & Beans & very generally hated) the other night. 5 Australians & 1 W.A.A.C. were wounded. To No.1 AGH and spent the afternoon yarning to sisters there .Returned to Boulogne with Hoad riding part way on an Ambulance. It had a freight of \"head cases\" and I could see one man a ghastly mask of white bandages with very small slits cut for eyes mouth & nostrils Many hospitals round here \n\n \n\n23\/2\/18\n\ndined well for fr. 5 afterwards reading and writing in the sitting room. Not as comfortable here as in the other Club & talking with an English Officer he remarked on the desirability of enforcing the death sentence for our deserters. The number of hospitals here and the quantity of town and battered humanity make one realise how futile and a rotten a thing is war. Instead of being manned by WAACs This Club is run by French girls who are neither as good on the job or as alert. Sister at the A.G.H. is a hard know all\n\n \n","27":" Boulogne\n\nBreakfasted with Colonel Duggan about 9 .15 and were waited on \n\nby French Girls who are not half as nice or attentive as the WAACs. Indeed this club is far below the standard as the one round near the Church. Walked across the bridge and along the Quay where fishing boats laden with their catch were pulling in. the fish were being scooped up from the holds in baskets and packed into boxes with ice. A curious crowd watching. Some tough old salts among these fishermen. Wearing beards and sou’ westers they might have stepped out of some picture. Covered with fishscales. Up the street where most of the shops were open and had a haircut.\n\n \n\n24\/1\/18 Boulogne\n\nThe people were coming and going from Mass. Crowds of Tommie drafts leave men &c marching about and I see they now have a Band to play the drafts for front on to the train. Went for lunch to the other Club in Place Caperscue and had a good meal for 3f.50. Waited on by WAACs. Talked with some of them. They are not allowed to go out with an officer without a pass but are quite willing to risk it. As Dug. And I came away four at an upper window waved and smiled to us. C’est la guerre. A number of the Boulogne fishermen go about wearing loose red blouses which are rather picturesque but, take it all round, this city is a dull\n\n \n\n24\/2\/18 Boulogne\n\nand uninteresting one. The people seem to match it and in no sense is the place typically French because there are so many English troops & establishments here that it has lost its identity as a French town with acquiring that of an English place. Saw the RTO and caught the 4.17 train for Lottinghen (cost 90c’s): and had for companions three other officers. A girl dressed in civilian clothes jumped into the carriages hurriedly handed papers to an officer saying that an Intelligence man was on her track. She was a WAAC dressed up in plain clothes. Got out at Lottinghen & walked to Selles. Had some tea and dealt with a few matters and then did some French reading with Inge LeFebvre.\n\n \n\n25\/2\/12 \nBoulogne\n Selles\n\nThe Battalion was to have gone up to Carlettes to carry out a gas attack practice but dawn showed heavy rain falling. So the scheme was postponed and a programme of indoor work was carried out. Rode out to Quesques and saw the dentist. From here across to the 4th Army range through Lottinghen and looked up Gorman & Greene who are billeted here with our demonstration platoon. The farm people seem miserably poor and sullen. An old man crouching over a fire and a tired looking woman. Stayed here for a while and had lunch with the officers. Then rode across to Bde.H.Q and fixed up a number of details regarding competitions. From\n\n \n","28":" Selles\n\nhere rode out through Quesques on to the Ecoueville ridge from which a magnificent view is to be had. Walked all over this and decided on a plan for our attack practice. Back to BnH.Q. and tried a number of cases of overstaying leave which offence is becoming altogether too frequent. Old Crowley reverts to rank of Corporal at his own request. Fixed up some routine matters. My host at the billet complains of trees cut up and used by our men for fires and has claimed 100 francs therefore. This will be paid by the men concerned Our new Padre (Smith) was in to mess. Held a conference of officers afterwards.\n\n \n","29":" Selles\n\nUp early and saw A.Co off to the Lottinghen rifle range, Then met the Coy Commanders at my billet at 9 a.m. and discussed the Battalion tactical scheme with them. We rode out to the ground above Quesques – a pleasant ride and a lovely morning. Went over the ground and allotted the frontages &c. We then met the Battalion in column of route with the Band and marched through ESCOUEVILLES out on to the main road to Corlettes. This is a splendid National Road and straight as a die. We went right through the wood before Corletttes and pulled up for lunch on a green field\n\n \n\n26\/2\/18 Selles\n\njust outside the village. It was bitterly cold up here. The officers had a talk to their men on the subject of last night’s conference and we then pushed on to the Gas School. Had a demonstration of gas and smoke attack & an interesting display of the flammenwefer at work. Marched back home and came into billets about 5 pm. I took the salute at my billet and the men marched in very well. Before dinner I had a cup of coffee with the people of the house & the local miller. After mess proposed the Padre’s health & we drank it with honours. After mess yarned with Angel & the family & wrote\n\n \n","30":" Selles\n\nA fine morning. Men down to our Battalion parade ground for bombers and there saw \"D\" Company carry out a rather good live bombing operation. These bombs are dreadfully shattering things. \"A\" Company came down afterwards and continued the practice. At 11.30 I inspected our men, horses and limbers for the horse show. They were smart in clothes and turnout but many finishing touches have yet to be made. Badges and lanyards are being fixed up for them. Young Murphy and Snowden have their horses looking very fit and well and the limbers are all shining with new paint.\n\n \n\n27\/2\/18 Selles\n\nHad an early lunch and then rode out with Groves and Smith to reconnoitre the ground for tomorrow’s operation. Returned to the football grounds marching in rear of the 24th. A great crowd at the football ground where they beat us after a good game. Great excitement and barracking. Col. Durran, General Paton & others were on the ground. Word came to hand that our demonstration platoon under Gorman had won the Brigade Championships. Very pleased about this win. Arranged all details for our operation tomorrow. Some rain came on just before mess. Sutherland Barker & Abercrombie go on leave tomorrow\n\n \n","31":" Selles\n\nFine but cold morning. The whole Battalion marched out at 9.15 am to the high ground near Quesques. The Band represented the barrage and the attack was not badly carried out. Groves sent up a good smoke S.O.S. Complications were caused by a supposed failure of the battalion on the right and a defensive flank had to be formed. This had to be done in a gas attack represented by smoke. At the same time Dooley had to exploit success on the left flank and a counter attack from supposed enemy was to develope behind him. After the show had a conference of the officers and discussed the faults. Rode to Quesques after lunch to the Bde. horse show\n\n28\/2\/18 Selles\n\nwhere we had stiff luck throughout getting three seconds. Our cooker was undoubtedly the best and our other entries were well up to the standard. Our men were splendidly turned out and smart. The whole brigade (except the","32":" put up a very good show. Colonel Durrant was a judge and there was much gorgeous Staff there. Jack rode the winner in the officer’s packs. Went home about 5 and brought Jack along to Mess. Afterwards the family gave us a cup of coffee and we yarned with them for a while. Then spent the evening talking about things in general. Plans and details now to arrange for a Bde. stunt on Saturday.\n\n \n","33":" Selles\n\nHeavy snow had fallen during the night and it continued during the day. Accordingly cancelled parades to some extent and had an interview with old Bob Moss reducing him to Corporal. Rode out in heavy snow to the","34":" Army range at Blequin where I met Generals Smith & Paton. The ground all white is snow covered and the basin all snowy. Our platoon under Gorman won the Divisional Championship after a good tussle. 20th Bn second and the 28th Bn third. Everyone was hugely delighted about it as some of the others were very cocky. Received congratulations from all round. Rode back to Bn HQ and put all the afternoon in indoors it being cold and snowy\n\n \n\n1\/3\/18 Selles\n\noutside. Took this chance of getting well up to date in matters of routine & correspondence. Recommendations preparing for the Birthday Honours List. Have not had much change for yarning with family here owing to being so busy today. In the evening received orders to go to Flixecourt on the 3rd March and cursed it rather as all my preparations are in train for going up the line. It will mean that tomorrow I see the last of as nice a billet as one could wish for. A cold dark and wet night that must be rotten for the poor chaps in the line. At mess tonight with Fulton & others recalling old experiences and the many hard cases we have had in the regiment\n\n \n\n2\/3\/18 Selles\n\nA fine day with everything frozen hard. After breakfast handed over the command to Dooley and made as many arrangements as possible in readiness for going up the line. Stewart came down and fixed up about his return to the Battn. Said goodbye to the Lefebrvre family and at 11.30 left in the leave lorry bound for Boulogne. An icy cold wind cut our faces. Obtained magnificent views from the high road which we went over. Ran down into Boulogne at 1.35 and found a train leaving for Amiens at 2.10. Had a hurried lunch at the Club & caught this train in good time. Met Colonel Harwood 16th Bn whose mission was the same as mine. Our train ran into Amiens about 6.30 &\n\n \n\n2\/3\/18 Amiens\n\nwe then had the deuce of a job to find a room. All the hotels were full and we had to chase all round the streets from one place to another. Eventually a woman at a café directed us to a place in a back street and we then left our luggage. She is to have the Rooms ready for us at 9.30 pm. Found other officers searching for rooms. Made for the Officers Club where we had a medium dinner. Did this writing in a cold room upstairs after dinner. All the old streets are very dark and full of civilians and soldiers. There are crowds of little girls but as the Madam of our Rooms say:- Beaucoup des M’Selles in Amiens sont malads!\n\n \n","35":" Amiens\n\nA cold and drizzly day. Rose about 9 and paid 6 francs for the room I slept in last night – not a bad place at all – in a private house. Walked round to the Officers Club and there had a good breakfast at 2.50. It is remarkable how they can do it at the price. Walked down to the Cathedral and viewed it first from the Place Notre Dame in front. The whole of the lower portion of the front is now all sandbagged up to a height of about 30 feet. There is something fascinating and irresistibly beautiful about the front of this place. A large row of statues representing ancient Kings of France runs right across the centre of the façade in niches. The flowers, fruits and minor decorations cover the whole nearly every stone being carved in some manner. Went\n\n \n\nAmiens\n\ninside and found a service of some kind in progress. An aged priest harannging from the old elevated pulpit to a small congregation of women and children. Had a look at the Crying Angel and the very fine and ancient windows behind the sanctuary All the carving of the choir is covered by sandbags and hidden from view. There are two splendid rose windows one on each side of the nave. All these things I have seen before but there is a severe beauty about Amiens that is not elsewhere. On going out had another glance at the front of the place and then walked back to the Club. Crowds of Tommies, Scotch, Canadians, American & French soldiers in the streets. A dull cold drizzle in old streets. Church bells quietly ringing\n\n \n\n3\/3\/18 Flixecourt\n\nLeft Amiens at 11.15 getting a seat in the Paris-Calais express as far as Longpre. On detraining fell in with some other Colonels mostly of British regiments and took a bus for the 4th Army School at Flixecourt. A Tommy guided us to billets – mine is rather bare but Madame seems a cheery soul and owns two daughters one a Mademoiselle and the other aged 7. Walked back to the H.Q. Mess and found our way into a rather palatial place where they have a jolly good mess. The Chateau is a new one with walls carved and wood panelled and in the Mess they have W.A.A.Cs for waitresses. The Commandant is a full Colonel of the A & Sutherlands\n\n \n\n3\/3\/18 Flixecourt\n\nand sports a monocle. The talk of everyone rather vapid and effeminate quite in keeping with the degenerate turn of such a portion of the English. On the other hand there were a number of very practical men here just down from the line. Heard that General Plumer is returning from Italy to take the 4th Army and that Lord Cavan is to command in Italy – another sop evidently to blue blood & God help the poor Tommy who gets no satisfaction for the corresponding lack of brains. Met Colonel Herrod 7th Battalion and spent most of the afternoon in the Mess writing and reading in the smoke room. Being Sunday\n\n \n\n3\/3\/18 Flixecourt\n\nthere was nothing doing at the School. The Village is a large one and clean – being a manufacturing town there are no middens. Went out for a walk before tea and passed the Chateau a fine place on a commanding position and set in comfortable grounds. Returned to the village and to my billet where I made friends with the people, was admitted to the bosom of the family and spent a half hour or so yarning with the woman who proved to be a great talker. Returned to the Mess, there to read, write and to yarn with the other chaps. In the visitors book there is a signed caricature for H.M. Bateman evidently a recent visitor. Sir H Rawlinson now of\n\n \n\nVersailles was evidently in here not long ago too. Dined at 7.30 in state and yarned to a Colonel of the Scots Guards with many war ribbons. A fine type of the British Regular Officer – they are nearly always first rate fellows. His face all wound scarred and he admits that the Soudan has got him fascinated. Consumed a number of drinks before going in to an elaborate dinner. After this there was a short lecture by the Commandant more drinks and yarning and then I made off through dark streets to a cold bedroom and to sleep. The people of the house seem to be poor and evidently just barely live on their separation allowance.\n\n \n","36":" Flixecourt\n\nA cold and snowy morning. The snow lightly falling in feathery dissolving flakes. Breakfasted and then joined everyone else in cursing the weather. Many of the instructors here are Guards officers. One has lost his right arm. All seem good chaps but wars are not won in the atmosphere of ease and luxury that is so dear to them. It is the crude uneducated & brutal person who can get along anywhere and brave discomfort who does best at War. Went first of all up to the top of a hill and saw a drill school in progress and some rapid wiring being carried out. We walked round the different classes and then returned to lunch at the Chateau and\n\n \n\n4\/3\/18 Flixecourt\n\nlunched. Then to see the musketry school at work where there were some smart instructors. Saw the piggery gardens at the rear of the school and then came back to the Chateau to consume sundry drinks & quantities of food. At 5 pm General Gilson C.R.A. 10th Corps gave a lecture on Cooperation of Artillery and Infantry. He remained to Mess and we had a great dinner. They put into one a variety of assorted drinks and conversation comes to be very genial and good fellowship beams on everyone. Everyone sitting round afterwards busy yarning & playing bridge\n\n \n","37":" Flixecourt\n\nUp early and breakfasted. A dull cold day. To the parade ground and saw the whole School fallen in to the ruffle of drums. Band & pipers played during the inspection. All NCOs and officers and the parade was rather a good sight. A march past followed – there are a number of Americans here. We then inspected the bayonet work and other items before going back to the Chateau for lunch. Inspected the Lance Corporals platoon after lunch and they drilled very smartly indeed under the Adjutant – a Major of the Guards. These Guardsmen are good chaps and all affect a certain type of looks & dress.\n\n \n\n5\/3\/18 Flixecourt\n\nA bus was then waiting to take us to Bouchon Sniping School and we passed through L’Etoile where we were billetted after the Somme coming down to Flers. Saw a good deal of camouflage work out here including a ruined farm. Ideal ground for rifle ranges and shooting. Returned and had tea & then attended a lecture on Court Martial by Capt Hills DAAG 4th Army. Col. Lucknoff Director of Trg gave us a lecture earlier in the afternoon. Then met Colonel Denton 4th Division & yarned and so on till mess. After mess adjourned to a Follies entertainment & so to bed. Your Guardsmen O regular is a fine chap\n\n \n","38":" Flixecourt\n\nA perfect day warm and sunny without a cloud in the sky. The little town is largely industrial and coming down to breakfast one passed crowds of women and other workers going to the factories. Many were waiting for the gates to open and there eating a frugal meal of bread cut off in lumps by a jack knife. Had breakfast with Colonel Romilly of the Scouts Guards – one of the best. One gets through an astonishing amount of drinks at a place like this as nearly all the talk is done over a glass. Sherry and bitters before port and brandy after a meal and many whiskey and sodas in between times. Yarned on\n\n \n\n6\/3\/18 Flixecourt\n\nthe terrace with various C.O.s until the time arrived for catching the bus to the station. It was a most enjoyable drive to the Longpre station and everyone rode on top of the bus. We passed along sunny pleasant country right up to L’Etoile where cavalry people were billeted. The old church here is on a domination position and the Somme runs round at the foot of the slope. The number of villages in this thickly populated country is remarkable. Arrived at Longpre station we did not have long to wait for a train and caught the Paris-Calais express. The usual mixed crowd of fellow passengers – French Belgians and British officers\n\n \n\n6\/3\/18 Boulogne\n\nWe pulled into Boulogne at about 3 pm and found that the new officers club was full up so had to put up at the old one with McConnaughty Harwood &Herrod all Colonels. Went and saw the R.T.O. regarding the train for Bailleul tomorrow. Met Col. Travers in the street and had a yarn with him. With McConnaughty & Herrod walked up the street and made some purchases All the streets thronged with people and very dark. Had an amusing conversation in one lingerie shop. The W.A.A.Cs hunt in pairs and don’t seem averse to glad eye. Made round to the Officers Club and had a good dinner being waited on by a very pretty little WAAC with\n\n \n\n6\/3\/18 Boulogne\n\nwhom we made friends. With Col Watson (Notts & Derbys) we went round to Hotel Folkestone where a merry crowd were. Then went upstairs and had a fierce argument with a Captain of the R. F. C. – a wearer of the Legion of Honour. Also fiercely argued with a Captain of the Machine Gun Corps and the discussion continued until midnight when we rambled back to our cribs along deserted streets. The footways outside the Club are infested by louts (mostly little boys) from the maison tolerees of the city. The station here is a busy one and trains are busy arriving and departing all night as well as by day\n\n \n","39":" Boulogne\n\nBreakfasted at the Club. A fine sunny mild day. At 9.58 caught the Calais-Dover express in Company with others and we reached Calais at noon. Went round and dined at the Officers Club passing Rodins statue of the Burghers of Calais in their English chairs. It is a dull an uninteresting place and many Belgians are about. On a windy day there is no more unpleasant and beastly place than this town. Caught the 1 o’c train for Bailleul and changed at Hazebrouch. Railway travelling is becoming quite good and like peace conditions. The mens trucks are covered with a wooden top and stoves are put in them. Arriving at Bailleul – found the old place thronged with Australians\n\n \n\n7\/3\/218 Bailleul\n\nand picked up my horse at Hotel de Faucon but did not see the groom. Made for the Officers Club which is a good place and does you well. Had a haircut & shave here and then found Murphy my groom. Returned to the Club where there seemed to be a rather willing clique of potters up who were inclined to get noisy and make a good deal of row. The old square tower of the hotel de Yiele and the square turret of St Vaast are distinctly Flemish and in a shop up the street. I heard the Flemish patois being spoken. Dined very well at the Club and at 8 pm left there with Murphy for Warrington Lines. An amusing kid to talk to is Murphy & full of gossip & yarns.\n\n \n\n7\/3\/18 Warrington Lines & La Basse Ville\n\nThrough Kortepyp to Bde.H.Q. where saw Browne & Hoad and then to our transport lines. Changed into fighting gear and then rode off with Sgt. Smith as guide to Bn HQ. After going through Ploegsteert Village we kept too far to the right skirting the wood and I thought we were getting very close to flares and m.gs. Presently came stretcher bearers wheeling a groaning wounded man and told us we were nearly up to the support line. So we cut over land and dismounted at Hyde Park Corner. Now commenced a long trudge up duck boards to a remarkably larger well hidden dugout which was Battalian H.Q. Saw Wooley and took over from him. The main C.T. here is in good\n\n \n\n7\/3\/18 La Basse Ville\n\ncondition. It winds interminably and all the ground is torn and churned to pieces by shell fire. From the enemy lines rise the flares and their reflection is cast all around. Our men are disposed around the trenches – on each dugout or sleeping place is a sentry looking for the SOS or for gas. The front is quiet save for the rattle of occasional machine guns and the explosion of minnenwerfers and shells. Desolation and an air of death are everywhere and even to the old campaigners the whole place is hideous and ominous. In the dugout men are crouched on the duckboards and sleep sitting up or even in some cases standing\n\n \n","40":" La Basse Ville\n\nAbout midnight commenced the rounds of the frontline posts and found them to be fairly good positions but thinly held. The men all fairly happy – sentries on the firesteps – machine guns flicking bullets across every now and then. Some German flares were being fired so close that they dropped right into the trench On the right the Lys bends right round our position and the enemy are on the opposite bank. A waning moon was reflected in the water of the river. The whole scene was desolate in the extreme It took us 5 hours to go right round the line and it beats me how runners and others find their way. There are ruins of\n\n \n\n8\/3\/18 La Basse Ville\n\nhouses, railway lines, and all the debris of a populous country side. Many times I tripped and fell over things cursing hard. A beastly waste of ruin, the country just like a deep ploughed field and material lying about everywhere. The average man keeps remarkably cheerful. Called in at the Support Company and at the R.A.P and then sat up feeling very sleepy at Battallion H.Q. Signed and checked the Intelligence Reports and then descended into the lower storey of the dugout and tried to sleep in a bunk. The foul air and fetid smells kept me awake and at 4 pm I rose feeling worse and nearly doped with it all\n\n \n\n8\/3\/18 La Basse Ville\n\nEat much and drank tea often and did some writing until pm Word arrived at 8.40 of barrages at 9 pm and midnight so turned in and slept until 1 am. \n","41":" After 1 a.m. set off on a tour of the line and found the night mild and clear. Reaching A Coy. I found Rodda and learned of Riley a Lewis gunner and good man being killed during the retaliation to our barrage. Old Beacall was wounded. Went across to ‘C’ Coy and there found them downhearted as Robbins had just been blown to bits while standing at the door of the dugout. It was hard to make an identification as there were others dead and one had no head or shoulders. A leg encased in a \n\n \n\n9\/3\/18 La Basse Ville\n\ngumboot was also found but there was no owner for this and daylight will probably reveal another body. Saw Gorman up in the firing line and he had just lost a man there All the men fairly cheerful. Set off for No. 7 post but missed it and got heavily minnied – so much so that we all had to shelter in a big shell hole for five minutes until things quietened down. There were some old ruins here and he kept slashing machine gun bullets round us. Found the next two posts – one was well up an old railway track and bit far from the Boche and we stayed here for a while yarning. One of the bombers was a little chap and he was rather scared as some\n\n \n\n9\/3\/18 La Basse Ville\n\nof our 18 rounder shells had been falling short. Left here and returned down a railway track coming out at the C.T. which is a good one. A long trudge down this trench and we met stretcher bearers returning from carrying out cases. Called in at the R.A.P and found that various slightly wounded chaps had passed through there. Our communication trench had been blown in at various places during enemy retaliation. Our chaps on the left flank told me that during our barrage they could hear cries coming from the German posts opposite them. We have lost some good chaps tonight. After returning to Bn H.Q. rested a while\n\n \n\n9\/3\/18 La Basse Ville\n\nand then walked up to the O.P. about 400\" up the trench. It was a fine sunny morning and the enemy was plastering hard into the rear positions round the Ploegsteert Wood. The batteries were firing hard and the shells were humming over with splendid regularity. Walked over to see Mackinnon whose men are in breastworks on the edge of the Wood and having a quiet and easy time. On the edge of the Wood is an old camouflage tree one time used as an O.P. Went to bed after lunch but did not sleep much and about 4 o’c the General came in to say that G.H.Q. expected an attack on us tomorrow morning. Left with McCartin, Smith and Sergt Tripp for the front line at about 9 p.m.\n\n \n\n9\/3\/18 La Basse Ville\n\nand saw Rodda at ‘A’Coy finding them well except that some of our crooks had got the wind up. Bloore had declared after three landed a bit close that clink is better than this. Met our wiring party going out on to the job. Our patrols will come from the support and reserve companies to \"C\"Coy where a party of 21st were working on clearing out cellars &c and saw Dooley & Main. Braithwaite Gorman and others were also here and we stayed talking for a while. Came back along communications saps which had been blown in several times during the afternoon. The night was very dark and I had several bad tumbles spraining left hand\n\n \n\n9\/3\/18 La Basse Ville\n\nand scraping skin off the other much cursing. A heavy bombardment of large gas shells took place about 10.45 and they all went well over us towards the rear. At about 10.45 p.m. summer time came into force and all our watches were put ahead one hour. Went to bed and had a long undisturbed and refreshing sleep.\n","42":" Woke up about 8 a.m. and rose washed and ate about 9.30. Another fine day with a good deal of bombing. The minnies during the night accounted for 3 or 4 more men wounded. The day was a quiet one and filled in by odd jobs which are not easy to narrate. When one comes to look at them in\n\n \n\nThe Company is advancing in columns up route from & comes under fire from half company of enemy with 2 m gs entered near big tree on Wood.\n\nSP at left hand corner of Wood platoon attacks Lilles side of ridge. Counter attack from angle half way up to big tree.\n\nCoy in attack from Selles ridge against obj edge of white ploughed ground.\n\n2nd Crest\n\nTrench to Trench\n\n \n\nCoy open attack\n\noutposts\n\n \n\n10\/3\/18\n\n10\/3\/18 La Basse Ville\n\ndetail. The Staff Captain and the Bde Major were in. The latter says the General wants me to make a reconnaissance of the Trois Tillents Fme and such was arranged to take place at dawn. The 5th Bde are putting gas over tonight at 10.30 p.m. The alteration in times is rather awkward to get used to for order writing &c. Just now there seems to be a shortage of maps and aeroplane photographers. At various times we had trouble with minnenwerfers and I wanted our Stokes to do something but they cannot owing to limitations of range. Our 6\" M is more trouble than enough with special emplacement and it appears that with their minnenwerfers they have a weapon\n\n \n\n10\/3\/18 La Basse Ville\n\nthat we cannot touch by anything short of artillery The which is rather a ‘dinge’ for the Brit Army. Jack Drummond of the M’Gs. was also in and we discussed his dispositions. On our flanks there are gaps of 300 & 500 each respectively and his guns must cover this. Sent a couple of officers back to the transport and ordered platoon commanders up again. Our patrols tonight are being strengthened from the raiders and Hutton will be in charge of one of these. Our phones are holding well in spite of shelling but they would all go in event of a stunt taking place. Remained in all the evening writing and odd jobs.\n\n \n","43":" La Basse Ville\n\nAt a few minutes after midnight walked up the line calling at D Coy in Support on the way up. A very long trudge up the winding duckboarded trench to A Coy where I found Rodda out and all in peace & quietness. Round the sap and into \"C\" Coy and there found Rod. visiting and also Braithwaite Dooley & Co. With CSM Carter went over to No 1 post through broken houses and ruins and then down a grassy slope to the Lys River. Found Green and his chaps all happy and cheerful Walked all round his posts and crawled out to our O.P. he has on a heap of rubble behind an old wall and where he overlooks the river. In the next post they told of a chap who said he saw a German in the\n\n \n\n11\/3\/18 La Basse Ville\n\ntrench when they came out of their dayposts to mount the night ones. We had some narrow shaves with beastly minnenwerfers and at last completed the tour of the whole lines less 2 posts. Remained up until dawn when a heavy strafe took place on our right the 38th British Division having sent up the S.O.S. All was fairly quiet when an Engineer officer and myself set off to reconnoitre the Trois Tillents Fme. We set off over ground to the place which is on our right flank. A heavy fog settled on the white frost covered ground but Gillespie as a splendid man with the major and landed us right on top of the place. It is a pillbox erected on the ruins of a old moated farm and constituted an\n\n \n\n11\/3\/18 La Basse Ville\n\nalmost impregnable place. On three sides \nare\n is a deep wide and unbridged moat full of water. They enemy evidently strafed hell into this place but even his biggest shells make but little impression on its wall of solid concrete feet thick. We crawled inside and found it quite habitable and also chanced on many belts of Hun machine gun ammunition and old beer and mineral water bottles. The surrounding trenches are delapidated. Walked back & to bed but constant visits and all sorts of interruptions occurred until afternoon. Slept then all night. At 10.30 we raided on the left Divnl front & brought back 6 prisoners & no casualties. The two rear coys here relieved the firing line without incident\n\n \n","44":" La Basse Ville\n\nProudfoot was wounded by a pine apple bomb and rather shaken. A few others also wounded. Got up around 9 and found the day a good one. Bright sunshine and pleasant conditions so the War must needs get worse and fighting get heavy. After lunch went up to our O.P. from which there is a splendid view today. Behind the German lines in Warneton much knocked about and to the left Bas-Warneton & Deulemont. In the distance is Comines with a large church steeple and the chimneys of factories showing up very plainly. Woods looking pleasantly green and undamaged ground – all in sight. Just to the direct left of this battalion H.Q. is a ridge on the\n\n \n\n12\/3\/18 La Basse Ville\n\ncrest of which are a few ruins and a higher mound of earth. This is the celebrated Messines and the mound was once the Church. Behind our territory and well in rear rises the tree clad slope on Mt Kemmell. Looking to the direct front of this O.P. could be seen the ruins of La Basse Ville and its surroundings where my firing line is. Our shells were bursting puffily white over his area. He was shelling our positions round Plogsteert Woods. Visited the men I have at Ultimo Crater. A German balloon broke away and drifted over across our lines. Met Major Dooley and had a yarn to him and then walked over to Ploegsteert Wood and saw\n\n \n\n12\/3\/18 La Basse Ville\n\nBraithwaite & Co. Ordered certain changes in dispositions with a view to getting my reserves further forward. Gas was to have been put over on our right by the next Bde. but the wind evidently was unfavourable because the thing was postponed frequently and eventually cancelled. The evening was quiet and there was nothing doing. Left with McCartin at about 10.30 for a tour of the front line and got a whiff of gas when going up the C.T. His flares were conspicuous by their absence on our front so we concluded that he has either patrols or wiring parties out. It is a long and weary trudge right up to the line round the traverses of the Communications Trench and the night was very dark and moonless.\n\n \n","45":" La Basse Ville\n\nWent to left Kennedy’s HQ and from there with Sgt Topliff as a guide trudged overground by a duckboard track to No. 8 post. This track lies through big shelling in boggy ground and full of water. A machine gun was flicking across and one sweep nearly got us in the legs sending us all flat on our stomachs and pressed close against the ground with bullets just skimming across us. A man feels very large on an occasion like this. Minnenwerfers now were commencing to drop round. We could hear the dull pop of discharge and then see something mounting up, up, up against the stars with a burning trail of sparks with it – the burning fuze. Then nothing more can been seen but a \n\n \n\n13\/3\/18 La Basse Ville\n\nrushing sound can be heard followed soon by a crashing explosion and the air full of whizzing fragments as it bursts more or less close. We wended our way through this, stopping now and then as each flare went up and soon we were challenged. Replying \"Oyster:’ the pass-word we slipped into quite a good little post (No 5) full of Billjims all anxiously watching the flight of minnies. While here we were heavily bombarded with them and some of the remarks were very amusing as the fellows watched them coming over. A wiring party of ours was working all the time out in front of No. 9 post. Went from 7 down to 6 on the right of which post a platoon of the 21st was\n\n \n\n13\/3\/18 La Basse Ville\n\nengaged digging out a trench. Walked through the posts right down to the bank of the River Lys, the ground is marshy. Back to the Coy H.Q. and then out across to Posts 1 & 2 \nnear\n and saw them all there. Returned to Bn HQ via Rodda at Iron Gate and turned in for a little sleep. Had a few visitors during the afternoon & managed to keep busy. Major Crowther was in. Arranged a bombardment of the Spinney by our Stokes Mortars. The 34th shot a Hun this morning and captured another alive. It looks as if they had lost their way on patrol and got into our wire. At 9 pm left with Smith & Thewles for the front line. To Iron Gate first and there saw Rodda and yarned for a while, then continued on to\n\n \n\n13\/3\/18 La Basse Ville\n\nKennedy. A fairly heavy gun duel now sprang up on both sides and there was plenty of ironmongery flying round. Kennedy was ill with trench fever. Got a runner here to take us to No 9 post but soon found that he was quite at sea and made for ‘B’ Co headquarters. Here picked up another runner and went out to Nos 1 & 2 posts overlooking the river and had a talk with the men there, They can hear the Hun transport coming up and the drivers speaking to their horses. Very few flares were going up on the front tonight. Walked round a new sap to No. 3 post and then along through 4, 5 & 6. The men were at work building little possies of sandbags to ward off blowbacks\n\n \n\n13.3.18 La Basse Ville\n\nOut to No. 7 post – a shallow place where the men are practically in the open. Here a disturbance occurred out in front bombing rifle fire and a great display of flares. It afterwards turned out to be an encounter between our covering party to the wirers and some Boche people. He turned a machine gun on to our post & did good ripping along the parapet. Went over to No. 8 and had the performance repeated there. Then to No. 9 post and found all well and cheerful. Returned along the old railway to Battalion H.Q. Things were now very quiet and the different working parties were coming off their tasks plodding homewards.\n\n \n\n14.3.18 La Basse Ville\n\nSlept until nearly 8 am despite the fact that a heavy bombardment was in progress on our left. The 5th Dvn raided and took 6 prisoners. No information about our F M shoot owing to Bruce not reaching his objective with his patrol. I was highly amazed about this. After breakfast drizzling rain commenced to fall and there soon was abundance of mud. It is a filthy unhealthy life living in these stinking dugout. The foul and oft breathed air makes one wake up absolutely doped and ill. Never taking ones clothes off they soon commence to stink and one’s skin gets itchy and unhealthy. After 8 days the men, poor devils, stink like polecats. Stayed underground all day. Colonel Duggan came round to\n\n \n\n14.3.18 La Basse Ville\n\nget particulars for his taking over tomorrow night. Everything quiet on our front except that the Hun is registering which is ominous and that a captured prisoner speaks of the 6th Division relieving the one now in – and that means an offensive operation. At 9 pm left for the front line with McCartin. It was very dark and inclined to be muddy. Fritz was sending up very few flares. As we progressed along the trench he commenced shelling and chased us all the way along. Some of them landed very close to us and we crouched low for each burst. Our runner made a great pace and it was difficult to keep up. Visited Rodda and then made for D.Co. meeting Kennedy just outside There was a bombardment on & \n\n \n\n14\/3\/18 La Basse Ville\n\nthe fire tailed minnies were landing pretty consistently round the railway track to No. 9. Kept to the sap and reached Mackinnon’s headquarters. Found him phoning for retaliation so took a hand and asked for 100 4.5’s. These came over in good form and burst well on to him. Our Stokes mortars also fired. We were close up under the descent of our 18 pounders and they whistled fearsomely close overhead. Three companies of Pioneers were digging a trench connecting us with the 5th Brigade. Visited the posts facing the river and then went round the others passing through 5 & 6. Found No. 7 after a trudge through mud and Sgt DeBoos was in charge there\n\n \n","46":" La Basse Ville\n\nNow on to No. 8* and while there got a few flicks of m.g. bullets that sent us close to the earth. Main guided us to no. 9 where things were rather miserable owing to the rain. The Boche evidently spied our wiring party out in front because he worked flare and m.g. together and sent his bullets kicking up the mud. Leaving here we followed the old torn up railway line right back to our trenches. It is all torn up and we had some terrible tumbles. Once, flattened in the mud to avoid m.g. fire, I got a kick in the face from someone in front. Called at D Co and then made direct back for the Batt H.Q.\n\n \n\n15\/3\/18 La Basse Ville\n\nAwakened to sign Intelligence Reports and then breakfasted. It was a fine and sunny day when I set out to walk down the C.T. to Prouse Point, the duckboard going by little crops of crosses. The wood is commencing to show signs of budding. Past Hyde Park corner down to Red Lodge where Murphy was waiting for me with my horse Rode down the slope and soon was out of the shelled area – the peasant people are surprisingly close to our line. I saw one family including an old woman living in a place that is in front of our heavies. Down through Romarin getting a good view of Neuve Eglise over to the right. Down to 5th. Bde H.Q. at Brune Gage and saw\n\n \n\n15\/3\/18 La Basse Ville\n\nGeneral Smith. Other Senior Officers assembled for a General C Martial. The Court consisted of General Smith, Myself, a Colonel of English Artillery, Col. Chalmers & Pat Currie. We tried the chap – a Captain of the 7th Bde on a charge of drunkenness and sentenced him to be dismissed the service. Rode back from there to Red Lodge and there left the horse and walked back to Bn H.Q. Slept most of the afternoon. One of the Boche propoganda balloons dropped close to our left post this afternoon. This morning something rather amusing occurred showing the present tensions. A sniper saw a couple of men or a small party of enemy come down a road into Warneton. He reported this and\n\n \n","47":" La Basse Ville\n\nsaid \"Considerable movement on road\". This somehow reached Bde as \"Large bodies of troops moving into Warneton\". This caused some excitement to the Higher Command. The Brigadier General and the Divisional Major General were both at the ‘phone ringing up and querying and everyone on our right and left flanks was advised of this conversation and things were much excited until I phone through the correct report. Duggan came along about 8 pm and the red and blacks had completely relieved us by 10 pm when we trudged back to the Catacombs, all electrically lighted & comparatively comfortable. At 10.30 there was a terrific bombardment and the air was full of flash and flame. The 38th Divn near Armentieres were raiding the Huns\n\n \n","48":" Red Lodge & Catacombs\n\nDid not get up until 9.30. My home now is like a corrugated iron tank turned over on one side. It is well dug in and has earth steel and concrete bursters on top. There is not much room to move about and it resembles living in a tube. A lovely sunny day and after the tired chaps got up they went outside and sat in the sun quietly and deliberately lousing themselves. I walked to Bde H.Q. and found them many feet underground. Down dripping stairs and along passages. The air down below is good and fresh and evidently there is good ventilation. Discussed plans and operations with the General who was in an amiable mood. All the Officers dined here today in an alfresco mess. Looking out from a little mess room verandah over pleasant fields it was hard\n\n \n\n16\/3\/18 Red Lodge\n\nto realise that we were so close to bloody war. In the afternoon had a good hot bath at the Brigade baths and then tried a number of Orderly Room cases – mostly overstaying English leave. This offence has been very prevalent of late mainly because the authorities in England have been tightening up the supervision there. After dinner the moon came out and there was a grand starlit night. Aeroplanes buzzing above. A few very big shells burst fairly close but they did no damage. Nine platoons have gone forward tonight on working parties up around the front line. The \"three Diggers\" – Sutherland, Howell and Barker are reunited today but the return of two of them from leave. They are fine upright and manly boys these\n\n \n","49":" Red Lodge\n\nAnother fine day and things are not too bad at all for the troops. The Band was playing here all the morning and went down to the Catacombs in the afternoon. Colonel James called in for a yarn being much bucked up by his leave. Afternoon walked to the Catacombs. Wonderful tunnels and drives all underground, electric light and fitted with bunks. Just like a Troop-deck. As one chaps says \"you only want to put a propeller on now and turn her head to home\" Dr Simmonds leaves us for the Field Ambulance & McMahon now reigns in his stead. The war seemed far away tonight as we sat in our open air mess yarning. Habel, the mess Corpl was hit tonight slightly on the hand\n\n \n","50":" Red Lodge\n\nAbout the warmest and mostly sultry day we have had this season so far. Visited the Military Cemetery close here and saw the graves of the men and officer (Robbins) killed during the last tour of duty. With Dooley walked down to the Catacombs and then went up on top of the Hill 63 from which is a splendid view. There was a good deal of smoke about which prevented Lille being seen. After lunch went down to Bde H.Q. and had a yarn with the B M & S.C. Then met Brazenor & James – the latter is one of the very best and I like him very much. Put Cpl Blatchford in charge of our Battalion Paper. All the machinery is now lying at the Transport Lines. A very close evening. The enemy putting over some high bursting shrapnel high bursting and doing no damage.\n\n \n","51":" Red Lodge\n\nThe weather has completely changed today and we now have cold and wet conditions. Mud and slush are everywhere. Last night gas projectors were put over to the Hun from this front. Capt Davis returned today from sick leave in England. Yarned for a long while with him. Tonight we only have about 75 men on fatigue jobs and all the rest are off duty. It seems as if we shall have to start them on some job of work or training to keep them occupied. Down below where all are crowded is not healthy. Dined with Braithwaite Gorman & Co. in their quarters and them saw Mackinnon. Talked to groups of men along the corridors and underground passages.\n\n \n","52":" Red Lodge\n\nAgain thoroughly wet. As it has cleared somewhat by 11 a.m. I took Grove with me and reconnoitred the left battalion sector. The front edge of Ploegsteert Wood was evidently where most of the dwellings were and still among the ruins could be seen a few flowering garden shrubs. We passed Advanced Estaminet and came to La Douve Walk which consisted to duckboards skirting the creek – for the R Douve is not more than a creek. Messines dominated all this ground and the shattered rubbish heap that was once the village here looked down upon us. Passed the different zones of trenches – the old German wire in many places is still more of an obstacle than our own. On arrival at Bn H.Q. saw Major Bateman and had a talk to him. The enemy\n\n \n\n20\/3\/18 Red Lodge\n\ncommenced shelling round here with dull thudding gas shells which made little sound of detonation and liberated a small gas cloud. This blew away from us. Returned along a trench called the ‘Only Way’ and had lunch at \"B\" Co. at the Catacomb. Our canteen was doing good work here and seemed to attract a good crowd. Went down below and round the corridors of the Catacombs. All the men were in their bunks mostly reading and writing. Returned to Red Lodge where our Band was playing and later in the day Officer & McSomebody of the Corps Staff called in to see me bringing with them 2nd Lieut Birdwood a nice little kid who is very much like his\n\n \n\n20\/3\/1\/8 Red Lodge\n\nfather. Held Orderly Room where there was a rather deplorable case of a man deserting through nerves – something the Army takes no account of. Walked down to BdeH.Q. and there saw the General who discussed the projected stunt out an event re which the utmost secrecy is being observed and yet my own men have been discussing it for days!. Returning, our archies were potting away at an odd enemy craft overhead. Saw James and with him discussed the latest ‘developments of the tactical situation’ and then had tea with Braithwaite & Coy. Went down into the Catacombes and talked with the men. They are wonderful take them all round. These chaps undergo things in the way of discomfort that make me have a great admiration for them.\n\n \n","53":" Red Lodge\n\nAt 3.45 a.m. was awakened by a heavy bombardment all the big guns just in rear of this hill having opened up solidly. The dull rattle and rumble of the 18 pounders could be heard like an undercurrent. The Hun put over some gas and our gas sentry used his rattle to alarm people. Received a message after breakfast to the effect that the Hun had launched his offensive between St Quentin & Cambrai this morning but that, as yet, no particulars regarding it are to hand. On this sector there seems to be much more heavy stuff flying round than usual. The Catacombs where three of the Coys. are is about half a mile from here. At this spot we have H.Q. and 1 Coy\n\n \n\n21\/3\/18 Red Lodge\n\nand sick parades are held here. It is found that the company here furnishes three times as many patients as any other company and this is because they are handy to the A.M.C. hut. Yesterday afternoon passed four stretcher bearers carrying a stretcher on their shoulders – a dead man covered with blanket and ground sheet. Another tribute of life to the War God. It appears as if we can now expect to have to do a hop over here and I have cut all Paris leave in consequence and will have to carefully sort out the people to go on English leave and to School. At 3 p.m. walked down to the Catacombs and there saw Colonel James together we\n\n \n\n21\/3\/18 Red Lodge\n\nwalked down to Bde H.Q. where the other three C.O’s and the General were assembled. We then proceeded to a definite discussion of the plans for the projected attack on Warneton the General having all the barrage maps and other plans in hand. The discussion took some time and we were not behind hand in suggesting amendments to the scheme on foot. It looks like our having a very light barrage for the job. The news through today from the South goes to show that the enemy artillery preparation is still in progress and that he has attacked in several places but evidently not in force. He has lately been putting down smoke screens to cover\n\n \n\n21\/3\/18 Red Lodge\n\nmovement in rear of his lines. After our discussion we had afternoon tea and spoke of general things. James had his chaps well gassed last night for four hours and 2 officers & 20 men are now affected vomiting unwell &c Rather struck with a phrase today \"a diversion to be created by a definite artillery action and the sacrifice of a certain amount of infantry\" C’est la guerre! Down the duckboards today there passed another small procession of four stretcherbearers carrying todays tribute to Moloch. The weather today is fine and mild with some ground mist. This haze is quite sufficiently thick to screen movement and permit assemblage of troops.\n\n \n\n21\/3\/18 Red Lodge\n\nOn our right last night the 5th Bde tried to get at the Boche in a raid but did no good. On our left two officers and an N.C.O. on a special reconnaisance were run right into by a party of 60(?) Boche and utterly routed them by point blank shooting with two revolvers and one rifle! At least, that is the story! A very quiet evening and we dined happily in our mess where \"A\" Coy – Rodda Fulton & Co visit us. The team just now is Major Dooley, Capt Stewart, Lts K Sutherland, Groves, Thewlis, McCartin, Smith JA, Bourke, Capt Miles, D McMahon, Padre Smith. \"A\" Coy. Capt, Rodda, Lanyan, Lts. Fulton, Anderson Bruce (all 13 LH) Abercrombie. \"B\" Coy Capt. Mackinnon, Lt Westaway, Armstrong\n\n \n\n21\/3\/18 Red Lodge\n\nLt King, Dundas \"C\" Co. Lt Braithwaite, Cpt Main, Lt Harricks, Gorman, Chalmers, \"D\" Co Capt Kennedy, Hunter, Lt. Southwell, Kohn & Barker. There are 16 away on jobs of various natures. The question of absences is again beginning to cause worry but I see no reason to consider my unit any worse in that respect than others and have at any rate the consciousness of being engaged in doing my best which they can take or leave. About 250 men are out tonight on various tasks and Engineers jobs. Spent the evening in my little tin bivouac writing and reading. To the study of French in common with others I find it hard to put my mind seriously owing to constant interruptions. A quiet dark night on the front so far.\n\n \n\n22\/3\/18 Red Lodge\n\nAwakened at 3 a.m. by a loud and heavy bombardment and by the adjacent heavy batteries firing hard. Most of the stuff coming over was German and landing heavily around Prowse Point and the Hyde Park corner. It seems that they raided the 21st posts and the most contradictory reports are to hand here. Some say that 5,6,7,8 & 9 posts were raided and that our casualties are not light. Went down to the A.D.L. at breakfast time and saw Dr Simmonds who says he has had only a few wounded through and they say only 5 & 6 were raided. However there is a good fog this morning and the 21st should be able to look round and to see exactly how things stand. Abercrombie was forward\n\n \n","54":" Red Lodge\n\njust at that time with 48 men on wiring and had 4 wounded Jones & Maxwell being hit seriously. Simmonds our \"C\" Coy cook was also wounded. The delayed affects of the gas bombardment on the 24th the night before last are now becoming apparent and between 30 and 40 men have been evacuated since then through the A.D.S. slightly wounded. Lunched early and at 1 p.m. Left for the line passing Prowse Point where the smell of gas was extremely heavy. Of the 24th 5 off 168 others have been evacuated gassed and others were passing us with swollen eyes and all the other wretched symptoms. Fulton of \"A\" Co has his eyes all burned and swollen up and possibly will\n\n \n\n22\/3\/18 Red Lodge\n\nhave to go away for that reason. Found Ultimo Avenue rather blown about and reached BdeHQ where Duggan was. The Boche seems to have got well into them this morning with excellent hip firing automatic revolvers of a new pattern. About 12 of our men are missing and we only got one of theirs. The 23rd of the left lost 7 killed. A feature of the Hun raid was the breakdown of our communications. After returning to BdeHQ went for a bath at the Red Lodge baths. It is a fine bright and sunny afternoon with planes flying very high up above. News of the loss of Bullecourt will not raise the morale of the people at home.\n\n \n\n22\/3\/18 Red Lodge\n\nFalconer of the Y.M.C.A. had dinner with me. Tried a couple of cases at Orderly Room and handed young Jockey Payne a present of 28 days F.P. No 1. At 7.45 p.m. had a conference of Coy. Commanders and with them discussed all our plans and details for this tour of duty in the line. Many points of interest arise at a conference like this. Also gave the, the latest information re our projected attack on Warneton. The enemy having taken 12 prisoners from us last night there may be a chance of some of them saying too much. The fact Bde. were not notified early about last night’s raid and also did not pass information on seems likely to\n\n \n\n22\/3\/18 Red Lodge\n\nlead to trouble and there is the making of a great Paper War regarding the casualties of the 24th in their little gas operation. Sutherland had a great plaster of papers and documents for me up to an hour as late as 11o’c. There is an immense amount of writing involved in this job of ours.\n\n \n\nMet \"Jonah\" of the Q.M’s staff unexpectedly and took him by surprise – so \n\nmuch so that he saluted with both hands. A great expression lately is \"dwelling on a thing\" i.e. waiting for it. Spoke to a LCpl and asked him why his tunic was ragged and he said he was \"dwelling on a large size\". \n\nOur German prisoners were sitting in the Quarry at Mouquet Fire when a coal box burst and blew off one’s foot and sliced his leg open from thigh to toe. He stood up raging & swearing in English and cursed the Kaiser tearing off his badges as he balanced on one leg.\n\n"}}