{"Document Name":{"0":"Diary_0103","1":"Diary_0103","2":"Diary_0103","3":"Diary_0103","4":"Diary_0103","5":"Diary_0103","6":"Diary_0103","7":"Diary_0103","8":"Diary_0103","9":"Diary_0103","10":"Diary_0103","11":"Diary_0103","12":"Diary_0103","13":"Diary_0103","14":"Diary_0103","15":"Diary_0103","16":"Diary_0103","17":"Diary_0103","18":"Diary_0103","19":"Diary_0103","20":"Diary_0103","21":"Diary_0103","22":"Diary_0103","23":"Diary_0103","24":"Diary_0103","25":"Diary_0103","26":"Diary_0103","27":"Diary_0103","28":"Diary_0103","29":"Diary_0103","30":"Diary_0103","31":"Diary_0103","32":"Diary_0103","33":"Diary_0103","34":"Diary_0103","35":"Diary_0103","36":"Diary_0103","37":"Diary_0103","38":"Diary_0103","39":"Diary_0103","40":"Diary_0103","41":"Diary_0103","42":"Diary_0103","43":"Diary_0103","44":"Diary_0103","45":"Diary_0103","46":"Diary_0103","47":"Diary_0103","48":"Diary_0103","49":"Diary_0103","50":"Diary_0103","51":"Diary_0103","52":"Diary_0103","53":"Diary_0103","54":"Diary_0103","55":"Diary_0103","56":"Diary_0103","57":"Diary_0103","58":"Diary_0103","59":"Diary_0103","60":"Diary_0103","61":"Diary_0103","62":"Diary_0103","63":"Diary_0103","64":"Diary_0103","65":"Diary_0103","66":"Diary_0103","67":"Diary_0103","68":"Diary_0103","69":"Diary_0103","70":"Diary_0103","71":"Diary_0103","72":"Diary_0103","73":"Diary_0103","74":"Diary_0103","75":"Diary_0103","76":"Diary_0103","77":"Diary_0103","78":"Diary_0103","79":"Diary_0103","80":"Diary_0103","81":"Diary_0103","82":"Diary_0103","83":"Diary_0103","84":"Diary_0103","85":"Diary_0103","86":"Diary_0103","87":"Diary_0103","88":"Diary_0103","89":"Diary_0103","90":"Diary_0103","91":"Diary_0103","92":"Diary_0103","93":"Diary_0103","94":"Diary_0103","95":"Diary_0103","96":"Diary_0103","97":"Diary_0103","98":"Diary_0103","99":"Diary_0103","100":"Diary_0103","101":"Diary_0103","102":"Diary_0103","103":"Diary_0103","104":"Diary_0103","105":"Diary_0103","106":"Diary_0103","107":"Diary_0103","108":"Diary_0103","109":"Diary_0103","110":"Diary_0103","111":"Diary_0103","112":"Diary_0103","113":"Diary_0103","114":"Diary_0103","115":"Diary_0103","116":"Diary_0103","117":"Diary_0103","118":"Diary_0103","119":"Diary_0103","120":"Diary_0103","121":"Diary_0103","122":"Diary_0103","123":"Diary_0103","124":"Diary_0103","125":"Diary_0103","126":"Diary_0103","127":"Diary_0103","128":"Diary_0103","129":"Diary_0103","130":"Diary_0103","131":"Diary_0103","132":"Diary_0103","133":"Diary_0103","134":"Diary_0103","135":"Diary_0103","136":"Diary_0103","137":"Diary_0103","138":"Diary_0103","139":"Diary_0103","140":"Diary_0103","141":"Diary_0103","142":"Diary_0103","143":"Diary_0103","144":"Diary_0103","145":"Diary_0103","146":"Diary_0103","147":"Diary_0103","148":"Diary_0103","149":"Diary_0103","150":"Diary_0103","151":"Diary_0103","152":"Diary_0103","153":"Diary_0103","154":"Diary_0103","155":"Diary_0103","156":"Diary_0103","157":"Diary_0103","158":"Diary_0103","159":"Diary_0103","160":"Diary_0103","161":"Diary_0103","162":"Diary_0103","163":"Diary_0103","164":"Diary_0103","165":"Diary_0103","166":"Diary_0103","167":"Diary_0103","168":"Diary_0103","169":"Diary_0103","170":"Diary_0103","171":"Diary_0103","172":"Diary_0103","173":"Diary_0103","174":"Diary_0103","175":"Diary_0103","176":"Diary_0103","177":"Diary_0103","178":"Diary_0103","179":"Diary_0103","180":"Diary_0103","181":"Diary_0103","182":"Diary_0103","183":"Diary_0103"},"Date":{"0":"unknown","1":1771.0,"2":1772.0,"3":1773.0,"4":1774.0,"5":1775.0,"6":1776.0,"7":1777.0,"8":1778.0,"9":1779.0,"10":1780.0,"11":1781.0,"12":1782.0,"13":1783.0,"14":1784.0,"15":1785.0,"16":1786.0,"17":1787.0,"18":1788.0,"19":1789.0,"20":1790.0,"21":1791.0,"22":1792.0,"23":1793.0,"24":1794.0,"25":1795.0,"26":1796.0,"27":1797.0,"28":1798.0,"29":1799.0,"30":1800.0,"31":1801.0,"32":1802.0,"33":1803.0,"34":1804.0,"35":1805.0,"36":1806.0,"37":1807.0,"38":1808.0,"39":1809.0,"40":1810.0,"41":1811.0,"42":1812.0,"43":1813.0,"44":1814.0,"45":1815.0,"46":1816.0,"47":1821.0,"48":1822.0,"49":1823.0,"50":1824.0,"51":1825.0,"52":1826.0,"53":1827.0,"54":1829.0,"55":1830.0,"56":1831.0,"57":1832.0,"58":1833.0,"59":1834.0,"60":1835.0,"61":1836.0,"62":1837.0,"63":1838.0,"64":1839.0,"65":1840.0,"66":1841.0,"67":1842.0,"68":1843.0,"69":1844.0,"70":1845.0,"71":1846.0,"72":1847.0,"73":1848.0,"74":1849.0,"75":1850.0,"76":1851.0,"77":1852.0,"78":1853.0,"79":1854.0,"80":1855.0,"81":1856.0,"82":1857.0,"83":1858.0,"84":1859.0,"85":1860.0,"86":1861.0,"87":1862.0,"88":1863.0,"89":1864.0,"90":1865.0,"91":1866.0,"92":1867.0,"93":1868.0,"94":1869.0,"95":1870.0,"96":1871.0,"97":1872.0,"98":1873.0,"99":1874.0,"100":1875.0,"101":1876.0,"102":1877.0,"103":1878.0,"104":1879.0,"105":1880.0,"106":1881.0,"107":1882.0,"108":1883.0,"109":1884.0,"110":1885.0,"111":1886.0,"112":1887.0,"113":1888.0,"114":1889.0,"115":1890.0,"116":1891.0,"117":1892.0,"118":1893.0,"119":1894.0,"120":1895.0,"121":1896.0,"122":1897.0,"123":1898.0,"124":1899.0,"125":1900.0,"126":1901.0,"127":1902.0,"128":1903.0,"129":1904.0,"130":1905.0,"131":1906.0,"132":1907.0,"133":1908.0,"134":1909.0,"135":1910.0,"136":1911.0,"137":1912.0,"138":1913.0,"139":1914.0,"140":1915.0,"141":1916.0,"142":1917.0,"143":1918.0,"144":1922.0,"145":1923.0,"146":1924.0,"147":1925.0,"148":1926.0,"149":1927.0,"150":1928.0,"151":1929.0,"152":1930.0,"153":1931.0,"154":1932.0,"155":1933.0,"156":1934.0,"157":1935.0,"158":1936.0,"159":1937.0,"160":1938.0,"161":1939.0,"162":1940.0,"163":1941.0,"164":1942.0,"165":1943.0,"166":1944.0,"167":1945.0,"168":1946.0,"169":1947.0,"170":1948.0,"171":1949.0,"172":1950.0,"173":1951.0,"174":1952.0,"175":1953.0,"176":1954.0,"177":1956.0,"178":1957.0,"179":1958.0,"180":1959.0,"181":1960.0,"182":1961.0,"183":1962.0},"Entry":{"0":"\n\n","1":" Arrived in Edinburgh at 8.30 and have to wait till 9.30 for train. Went up Princes Street and has some breakfast. Caught train comfortably and over Forth Bridge two stations beyond. Lovely sight and a lot of fleet in harbour. Arrived about 10 and set out to find Dhuloch. Got on wrong track and landed at Hillend & then took a short cut to Dhuloch about 2 miles. Very kind old lady and lovely house. Connected with Andrew Carnegie. Had lunch at 12.30 with 30 other men who were out shooting. After lunch walked through Inverkeithing to Admiralty Road to Rosyth and caught train to Hospital Hill after tea at Y.M.C.A in Rosyth. Walked 3 miles home and landed at 5 in time for a good tea- In evening played Poker Patience till 9 and had some supper and bed before ten. Very comfortable indeed. Dull and a trifle windy.\n","2":" Breakfast at 8.30 and Miss Lauder not down. Stayed in all morning and too rainy and windy to go out. In afternoon still windy and rainy but set out for Dunfermline and caught two showers. Many sailors on leave and paid a visit to glen and gardens and also Robert Bruce church & burial ground. Home by car to Hospital Hill and in time for tea at 5. In evening some gramophone very good and bed after supper.\n","3":" Up at 8 and caught train to Edinburgh at 9.20. Spent morning at Bonnington Road and a walk down Princes Street and a good look round. Some tea and dinner and in aftn. too windy to do anything but go to a picture show. Only fair. Caught train\n\nat 5.5. and back for late tea. Rotten day and hats and umbrellas going in all directions In evening another game of poker and bed at 10.\n","4":" Rotten day again & very windy. In morning read and passed time pleasantly and at 4 o’clock out for a ride in Victoria. To Dunfermline and visited Butchers and then round to Technical School and also to old ruins. Then round to tea at 2 old ladies. After tea visit to Mrs George Miss Lauders sister and home after calling at Station. Very amusing. Not so windy and fairly fine out.\n","5":" Up at 8 and went down to catch train at 9.17. Just missed it and had to catch one at 9.30 to Dalmeny & thence by bus to Edinburgh. Spent day wandering round and Picture show in aftn. Also met Clarke. Rotten day. Tried to catch seven train but too crowded. Caught 9.30 train and got a good seat although very crowded. Good trip and fast.\n","6":" Landed about 7.45 and had a good clean & spent morning cleaning up and getting ready for Brighton. Caught train at 11.52 & had to change at Haywards Heath very slow train. Landed at Rottingdean at 3 and spent evening quietly with cats. Bed early and had some good post and bath.\n\nMrs Herd.\n","7":" Showery. Went in to Brighton at 11.30 and did some shopping and back at 2 and lunch Visit to Jimmy in aftn and quiet evening.\n","8":" Fine but showery. Visit to Rottingdean and saw graves. Some trouble over packing and pretty rotten. Caught train at 5.5 and Sarah saw me off. Good trip up\n\nand Victoria at 6.30. Put pack away at Aldwych and hurried to Excellent show. a little late. Announcement of peace terms. Back at 11 and some trouble about bed. Bare necessities in room. Bed at 12 very tired.\n","9":" up at 5.15 and got ready and walked down to Victoria. Thence to Horseferry Road and got gear. Some wait for train but got away about 8.30 and good run to Shorncliffe. Had to walk about 1 ½ mile to Folkestone and in good unfurnished houses taken over by military. Went for a walk down town till dinner at 1 and very nice place. Marched off at 2.30 and caught boat about 4. Landed at Boulogne and up to One Blanket Hill. Slept well and plenty to eat.\n\nno rain\n","10":" Up at 4.30 and got mobile and moved off about 7 or 6.30 and marched to train got going about 8 and very slow trip through to Longpre. Caught connection straight away to St Ouen and marched on my own to Surcamps. Found company moved and went on to Ergnies and met on way Fair billets but rotten after Blighty. Some trouble about blankets and got to bed about 10 tired. Fine day.\n","11":" Some rain, and dull. Didn’t go on parade and spent day reading letters and writing diary and rolls and generally getting mobile. Lots of changes in crowd and not very satisfied. Got Blankets etc but a bad shirt in exchange. Played some bridge in evening and bed about 10.\n","12":" Up at 7 and parade at 7.30 company parade. Drill order parade\n\nat 9 and spent till 10 on guard drill. Dismissed for awhile and cleaned machine gun from 11-12. Fatigue order parade at 2 and dismissed. Played cards awhile and wrote a good few letters until bed time. Very dull and some showers.\n","13":" Check parade on new ground at 7.30 and on guard at 9. Everything quiet and put in time writing letters Garrow O.O. Bed about 10. Cloudy and inclined to rain.\n","14":" Off guard at 9 and everything good. In morning wrote letters. Dinner at 11.45 and bath parade at 12.45. Went down and changed shirt and marched back and dismissed and spent rest of leisure writing letters. Fine day clearing up.\n","15":" Woke at 6.30 by Carrick. usual. Some frost and fog in morning clearing up to fine. In morning fixed up pontoons ready for mooring to-morrow back to old camp and in aftn. finished off some more writing and ended batch finishing by getting mobile late at night. \n","16":" Up fairly early had breakfast and loaded up, transport moving at 8 and we moved off about 10. Some showers and very dull all day. Arrived about 12 and good old billets. Straw in beds and comfortable. In afternoon did a fatigue on tent erecting. In evening cleaned up and read.\n","17":" Up at 7 and parade at 9. Some details and odd jobs which I escaped. and read in morning. In aftn. had game of tennis on court. Nobody any class and rackets very weak & strings broken. In evening on picket and went down to Surchamps for a drink and back again.\n\nBed at 8 not feeling very well and slept well. Dull.\n","18":" Up at 6.30 and set off for parade ground after a preliminary run round and marched in drill order through Surcamps, Brucamps and Ailly-le-haut-clocher about 2 kilos beyond town Did some company ceremonial drill and back again at 11.30. Very dull and rotten roads about 10 kilos each way. I aftn. rested and issue of blanket, gloves. Paid in evening and rest of evening spent in writing diary and getting mobile. Bed at 9.30.\n\n22.10.18. Check parade at 7.30 and drill order at 9. Dismissed and only some fatigues going and model section etc. In aftn. game of tennis, and evening read. Dull\n","19":" Dull. Usual. Dismissed in morning and played cards. In aftn. read and played on game of tennis and after tea caught lorry to Port-Remy via Ailly. Lobbed at 6.30 and good show by Sentimental Blokes. Home by 9. through Long. Bed tired.\n","20":" Dull should have gone with Tuck but went down & marked Sports Ground with Robb. In aftn. played good tennis game while tryouts on. In evening bridge.\n","21":" Guard. Quiet One cycle lost. Dull\n","22":" Off guard at 9. and wrote diary and read in morning. In aftn. game of tennis and read in evening. Dull.\n","23":" Parade at 9 and few fatigues and dismissed in aftn. and played tennis and read\n\nin evening. \nLovely day\n dull. Sent in washing to .\n","24":" Fatigues at 9 and helped making obstacles and laying tapes for sports. Lovely day tennis in aftn. & read in evening after game of bridge.\n","25":" Spent till after 10 in fixing obstacles for sports. Very successful meeting and three free drinks each. We won nearly everything. Section turn out. tool cart Wrestling on horseback hurdles, football kicking Obstacle race Relay race. Lovely day. Few ladies, Episode of and Co in evening. tennis.\n","26":" Spent morning working hard all sections on clearing up Some rain and dull. In aftn. game of tennis very slow. Some rain and dull.\n","27":" Dull all day. Check parade 7.30 and ready for leave. Fell in at 9 and those not on fatigues went for route march. Walked with Linton to main road at Moufflers and after a wait caught ambulance right in. Very few cars running Had a walk round to canteen and had dinner with Linton. Then another walk round all over town and made some purchases. Met Linton at 3 and decided to come home. Some wait but caught an ambulance (lady driver) right to Moufflers and walked home carrying a box for seat on way. Short game of bridge and spent time till bed at 9.30 getting mobile for tomorrow. Home about 6. Anzacs home to-day. Influenza getting\n\nvery prevalent and a large number of deaths.\n","28":" Up at 6. Breakfast at 6.30 and set off at 7.30 in drill order with ground sheet for Ailly for parade stunt. Dull all day. Landed there at 9.30. Linton wouldn’t go in charge of section so I had to take charge. Did well. Robb had to leave at half time as no belt and I had to take charge of section. Did some wheeling and other drill and at 11.30 prepared for inspection by C.E. 4th Army. Got through all right and marched back at 12.20 arriving at 8.30. Rested in aftn and read and wrote letters in evening. Bed at 10.\n","29":" Check parade at 7.30 and on guard at 9. Dull all day. Rest of company drill order parade at 9.30 and out searching for strays all morning. At 12 pontoon went to Ergnies for running 100 yd Champ. Won by us. Parry Jones and Blight. Quiet guard all day and did some reading and also wrote a good deal of letters. Stayed up till 10 and then went to bed upstairs. Quiet.\n","30":" Up at 7.30 and changed over at 9 quietly. 24 hours off. Not first parade, and rest washing wagons and packing tool carts in morning & same in afternoon. Wrote a good deal in morning played gramophone, and washed clothes in aftn. Bridge in evening. Edmonds back Rumours of moving north up line again. Sunday. Dull all day Light showers.\n","31":" Slight frost and cool. Lovely day. Check parade at 7.30 but guard didn’t go on. Drill order at 9 and\n\ngot 100 rounds ammunition issued. Then got off. Played gramophone in morning and read Pelman in morning In aftn. watched Rugby for awhile against MG Batt (lost) and then went to Domart for my washing. Very quaint old town and had a good look round & stopped by picquet for pass. Had tea there plenty steak and chips & back by six. Played 500 until 8 and read for awhile till 9 L? Fatigue order at 2 and dismissed. Moving about Wednesday North to near Lille & thence towards Brussels. Ultimatum if not successful big stoush.\n","32":" Raining pretty heavily till 9 and no check parade. At 9 fell in O.O. and some loading pontoon and rest washing G.S. wagon. Me not working & L in morning. In aftn. fatigue order and carried on on G. Setc. Played some cards and read a bit Went to Domart at 5.30 and had a very good bath after some trouble to find it. Home about 8 and played 500 till 9 & bed. Dodged rain but very wet and showers all day & dull.\n","33":" Up at 7.45 and no first parade as raining heavily fatigue order at 9 and got pay books about 10.30 after orders read out. I am \nSec Corp\n full corporal (temporary) Then detailed the section for fatigues & played cards awhile. 2 o’clock parade off as too wet, and played 500 for awhile. Read in intervall. In evening went to bed early and read electricity. Raining heavily all day. Ultimatum to Germany for surrender to Foch, alone. Good progress everywhere.\n\nRead til 9 and bed. May move to-morrow but rumours of 24 hour postponement.\n","34":" No first parade and drill order at 9 and dismissed. Fatigue at 2 and dismissed to play football. 1 & 2 V 3 & 4 won by 3 & 4. Played cards and read in interval. Not moving. Dull all day and a few showers. Peace envoys sent from Berlin\n","35":" Dull day but clearing up. No first parade and drill order at 9 dismissed after inspection, and in morning read wireless. Moving early to-morrow morning Fatigue order at 2 and did some cleaning up of billets. Dinner at 11 and early tea. Played some cards till 8 and then slept a little. Only carrying one blanket and some gear in sandbag.\n","36":" Up at 1.45 and had breakfast and fell in at 3 moving off at 3.15. marching via L’etoile to Longpre and arriving about 6.30. Pretty cold and fair frost and fine. day found train mightn’t be in for all hours. Spent day wandering round village and played cards a bit. Just going to settle down for night but we got a train and M.G. men loaded transport for us. Got aboard alright and about 13 in our truck of various sections. Got to bed and moved off about 12. Slept warm and fairly well.\n","37":" Chaulnes soon after daylight and on to Ham and a long wait there. Reserve rations being used as rest gone on. Very slow trip and line blown up between Chaulnes and Peronne. On towards St Quentin and bed again sleeping well.\n","38":" Arrived at Roisel about 7.30 and were to catch lorries at 8 but got them delayed while we marched up to our billets and had breakfast and plenty of rations Went down to motor buses about 10 but had to wait till 1.30 before a start. Met A.M.C. captain. Through Bellicourt and straight on to Maretz and St Souplet to present billets landing at about 4.45. to Mazinghien. Place fairly badly knocked about and only a few civilians. Fair billet, crowded and not waterproof and perhaps L. Fine day and some frost. Bed about 8 and slept well. War over at 11\n","39":" Up fairly early and no frost. Cloudy but soon cleared up Spent day clearing up and in aftn. fell in at 2 and rest dismissed. Put up 3 tents and 7 trench covers. Wrote diary in evening. Cool. Perhaps moving to-morrow \nat\n back to Surcamps. Very uncomfortable & tight and L both sides.\n","40":" Got up at 8 and drill order at 9.30 and route march to Cambresis and back, good long way. In aftn. dismissed at 2 P.M. fatigue parade and cleaned up. Got mobile in evening and probably moving forward in morning \nonto\n towards German territory Very heavy frost and cool all day. Sleeping out with Linton & Storr tonight under tarpaulin. Slept rather cold but better than the crowded . \n","41":" Very frosty again but fine day. Reveille at 7. Breakfast 8 and packed limbers at 9. Fell in at\n\n9.30 and moved off about 10 and marched behind brigade. Very slow and frequent stops. Through Ribeauville, La vallee, Andigny-les-fermes, Regnicourt, Bohain arriving about 4.30. Big town and good billets in good house , Bare rooms, and rather draughty, but convenient. May be here some days, as English moving to-morrow We are going to Coblenz. All division here and fairly crowded. Haven’t seen many civilians yet. In evening went to canteen & also cleaned up and wrote diary in evening. Read letters and papers. Frosty night again.\n","42":" Up at 8 and breakfast at 8.30. Spent morning getting washing tins and fixing up the billets. Fatigue order at 2 and a few fatigues. Went for walk with Edmond round town to Railway and had a good look round. Many civilians coming back and all pathetically busy remaking their homes. Only a few places knocked about by bombs. Fairly big town. Back and after tea read a little before going to bed early. Frosty\n\n16.11.18. Up at 7.30 and parade at 9.30 in fatigue order. Rest in drill order and drilled from 9.30 to 12 under infantry officer from 10th. Some fatigues and washed all wagons finishing at 11.30. Fatigue at 2 and rest drill order and dismissed Washed more wagons till 3. Did washing in aftn. and concert \"Fancies\" in evening very good. Read and wrote till 11. Frosty.\n","43":" No frost cloudy all day and fairly cold. Up at 7.30 and and church order at 9. Not much time. Rest went down to 3rd Bde parade and not up to much\n\nI stayed back with 4 others and some fatigue men and went down to horselines building a hessian cover for horses. Came back and dried clothes till dinner. No parades in afternoon but had to carry on with fatigues and spent aftn. down there. Finished at 4 and finished drying and after tea in evening did letter writing. Sergts mess to-day. Cleaned streets in aftn. Finished at 10.30 and rest playing poker.\n\n18.11.18. Cloudy. Not so cold in \naftn.\n morning but some snow in and again in aftn. In morning. Worked on stables from 9.30 to 11.30 and finished in aftn. from 2-3.30. Rest sweeping roads and various fatigues. Football aust rules against machine gunners at 2 won by 1 point. Saw Sentimental Blokes in evening with & Linton Poor show. Back at 8.30 and bed soon after. Inspection by Glasgow & retinue\n\n19.11.18. Dull all day. Kit frightfulness until 10 and then on road sweeping frightfulness. Rest various fatigues Bought camera. In afternoon, some more sweeping and stopped before. Wrote letter before tea. Went again to Fancies new programme and very excellent. Home at 8.30 and wrote till 10.30 and read till 10.30.\n\n20.11.18. Stood by Kits from 9-10 and then bath parade. Didn’t have a bath but got two new shirts. Fine day only a trifle cloudy Rumours of moving in a few days. In aftn. some fatigues and on street cleaning. In evening and in intervals finished letters. In evening went to bed at 10.30\n\n21.11.18. Lovely day. Change over from working section & No 3 carrying on.\n\nstand by kits at 9 and drill order at 9.30. Got off for boots but couldn’t get them done. Spent all day washing towels and handkerchiefs and drying them. Pay at 2 and in evening read magazine and passed time till 9.30 and bed.\n\n22.11.18. Fine day a little cloudy. Fatigue order at 9 and spent morning on washing pontoons and loading. Nothing doing in afternoon so washed feet and got Got pack in evening ready and bed at 10. Moving to-morrow morning at 9.30 behind brigade to Mazinghien. 1st & 2nd already gone and 4th division also going through. 2nd Division","44":" company coming here. In evening read a little till 9.30 and after getting gear ready went to bed.\n","45":" Up early at 6.30 as Sefton going on ahead for billets with Kernot. Lovely day and got ready in plenty of time. Moved off at 10.15 behind","46":" Brigade and marched through Vaux-Andigny, Molain, , L’arbre-de-guise, and Mazinghien. Marched on to Rejet de Beaulieu and got fair billets and Sgts Mess. Had dinner at St Martin and rather scrappy. Arrived about 4.30 and spent evening clearing up. Bed at 8 tired. Very cold and slept mobile. L. Frosty.\n","47":" Heavy frost. Up at 7 and plenty of time to get ready. Moved off at 9.30, behind brigade again. Found brigade on main road. Passed through Catillon , La Groise, Prisches to west side of Cartignies. Brigade at Prisches. dinner at La Groise.\n\nFairly good billets and good Sgts Mess. Everybody rather tired and rather over excited. Cleaned up and wrote diary in evening. Some rain in evening and prospects of snow. Moving to-morrow to Solre-le-Chateau on Belgian border. Some men bad feet. Walsh and Smith and brigade taking our cycles. Bed at 9.30 after getting things ready.\n","48":" Reveille at 5 and breakfast at 5.15. Moved off at 6.45 and waited outside Cartignies for awhile then moved off behind gunners and sigs and rest of column behind. Through Cartignies and Avesnes, then Flaumont & Felleries and then Solre-le-Chateau. Very strenuous passage and tired on arrival at 3.30. Had dinner at Felleries in town & no tea. In barracks used as hospital and 3 companies together. Fair mess and board floor. Bustled round getting things and bed at 8 very tired. L ?\n\n26.11.\n Showery misty rain all day.\n","49":" Up at 8 Cloudy all day. C.R.E. inspection at 10 and stood by kits. No other parade till 2 and only check parade. Cleaned up all day and played some cards in evening. Bed at 10 after some gambling.\n","50":" Cloudy all day. Stood by kits at 9 and fatigue at 9.30 and washing pontoon, limber & tool cart. However limber only necessary. Went to bootmaker and C.R.E. in morning. In aftn 2 P.M. fatigue & rested rest of time. Parcel and read in evening gambling & played some patience and read. Bed at 10.30.\n","51":" Fell in at 9 instead of 9.30 in drill order and after inspection dismissed. Check parade at 2 & dismissed, spent spare time\n\nreading and played some cards. Bridge with No2. Some showers and cloudy all day but mild. Fell in again at 10 and down to for baths. Rotten. \n","52":" Drill order at 9.30 & mob went for route march. I went & had boots mended. Check parade at 2 dismissed. Good game of bridge in evening with Kendal, Hannan Bed at 10.30.\n","53":" Cloudy & very foggy and raw in morning. Route march to Clairfayts and back at 11.30. Check parade at 2 and watched football in aftn. 1st Coy v. Combined 1st brigade. Won by 1st Coy 11-8. In evening read wireless and wrote diary. Bed at 9.30.\n","54":" Cloudy but fine. Church parade at 9 with other two coys and marched to square. Parade in Concert hall by Dexter and fair. In aftn. played bridge and again in evening. Bed at 10.30. No parade at 2.\n","55":" Cloudy. Stood by kits at 9 and drill order at 9.30. Started Coy drill & then went for route march towards Sivry and sat down in shed for half hour then home by and also Kernot. Check parade at 2. In aftn. got water and bed and generally got mobile. Bridge in evening very enjoyable. , Hannan, Fox. Bed at 10.30 gone\n","56":" Cloudy. Slight shower in evening. Usual parade and marched to same shed with Kernot and Garrow. No parade at 2 and particulars of education scheme which is going strong. Bridge, Fox, Hannan, Barnes. Slow. Read before bed at 11\n","57":" Cloudy and drizzling rain most of day. Carried on with education scheme all morning & no parades. Check parade at 2 & dismissed. In afternoon cleaned up and played bridge and in evening went to concert but couldn’t get in so came home and wrote letters and read until 10.30. and to bed. Baldwin back yesterday.\n","58":" Drill order at 9.30 and only Bremner on parade. Put gear away and got out of road and played football in mud until after inspection. Came back and got boots and puttees fixed up. Check parade at 2 and in aftn. played bridge. In evening washed boots and wrote letters. Cloudy some sun.\n","59":" Duty Section. Glimmers of sunlight through cloud. \nFat\n Drill order at 9.30 but we didn’t fall in. Some odd jobs. Inspection by Glasgow at 10.30 and dodged out of road. In aftn. pay at 2.30 orderly room at 2 and spent aftn. washing boots. In evening played bridge for awhile. No candles.\n","60":" Washed wagons G.S in morning and loafed round till after inspection. In aftn. Lecture on demobilisation and education scheme by Price. Rest of aftn. drizzling and cloudy all day. Pictures in evening at first Batt fairly good. Did some writing in intervals. Bed at 10.30.\n","61":" All fatigue order at 9.30 and 3 sections working on compass. We cleaned and oiled wagons and played football to avoid inspection. No parade in afternoon and watched football. Won by 2 & 3 against 1st. Soccer. In evening played some bridge & read letters and got them mobile. Bed at 11. Lovely day. McGlaughlin back\n","62":" Got up early to get mobile. Drill order at 9.30 cancelled, as drizzling rain all day. Wrote all morning. Check parade at 2 and making 18 rack lashings. Played football for awhile & then came in. After tea wrote letters while rest at pictures. Bed at 10.\n","63":" Fell in at 9.30 in courtyard drill order we in fatigue. Rest went for route march & we finished rack lashings and played football awhile. Parade at 2 and lecture by Robb in top room. During aftn. wrote. Drizzle from 11 onwards. In evening went to pictures at 1st Battalion with Henville & Lenard.\n","64":" Fatigue order at 9.30 everybody and horse lines moved. Finished lashings in blacksmiths and didn’t go back to billet till 12 as inspection on. Drizzling all morning. In aftn. check parade at 2 and played bridge in aftn. In evening went to show at Town hall at 7 and fair Big crush. Bridge on return and bed at 11.\n","65":" Rifle inspection in billets at 9.30 and played bridge all morning. Went to lecture on America of to-day by Ozanne\n\nin cinema hall but lecturer didn’t come. Saw pictures instead. In evening wrote and read Wireless Drizzling rain all day and miserable weather. Spencer gone to relieve Smith who went away on","66":"\n\n13.12.18.Rain all morning. Check parade at 9.30 in billets and inspection. M’s letter walk in aftn. to Clairfayts and saw tower. 4 photos. No rain. Drizzling again in evening. Bed at 7 and wrote till 12. Tired\n","67":" Cloudy. Slight sun in morning. Walk to Clairfayts and again after fatigue order at 9.30 dismissed. Parade at 2 dismissed and I was late. In aftn. wrote. Bed early as no lights.\n","68":" Cloudy all day. Sunday. Drill order at 9.30. and dismissed and went for a walk round town & watched 1st Brigade go through. Check parade at 2 and went looking for photos with Pictures at 5 and very fair. Read on return and detail of men going to Charleroi. Vincent away Bed at 11.\n","69":" Cloudy. Fatigue order at 9.30. Vincent back at 10 and Mooney gone in place. Waited for Prince of Wales but just missed him at 11.30. Check parade dismissed at 2 and read in aftn. In evening had a good bath and got mobile for move to-morrow at 8.\n\nBed at 10.\n","70":" Cloudy all day. Moved off at 8.30 and waited on hill for half an hour for column and marched past Glasgow at crossroads. Through Hestrud and on to Solre-St-Gery Fair billets near church and arrived at about 1. Had lunch & walked into Beaumont with Edmonds. Very slow and only old fortress or castle. Back at 4.30 and had dinner and bed about 8. Flook back.\n","71":" Very wind on our and raining nearly all day. Up at 6 and moved off at 7.45 after some hurry. Through Barbencon, Boussu & Walcourt (big town 2nd Bdge & ambulances german) to Thy-le-Chateau. Fair billets. Stopped for half hour for dinner at main road before Walcourt. Very tired and miserable and rotten trip. Spent aftn. & evening trying to get dry. Bed at 9 tired.\n","72":" Up at 6.30 and moved off at 8.30. Some sun and showers moved through Somzee, , Gerpinnes, Villers Poteries through wood to Sart-Eustache arriving about 2. Spent aftn. Cleaning up and getting bed ready & slept on floor. Fairly good billets and some sleeping out. Bed at 9 tired. Only 1st Coy here.\n","73":" Finished bed in morning King ill. Aftn. cleaned rifle and got fairly mobile. Everything scarce. In room with Gibbs & Carrick. In evening wrote diary and read. Bed at 9. \n","74":" Inspection of rifles at 9 and had a walk round town in search of washing tins. Unsuccessful.\n\nTook photo of church. In afternoon washed boot and puttees and dried in evening. Bed at 11. Gibbs & Fox on leave to Charleroi. Cloudy touches of sun.\n","75":" Cloudy. Drizzling rain in evening. Washed sox & handkchfs in morning. Read & pay in aftn. at 3.30. Bed at 9.\n","76":" Raining from 11-4 cloudy in morning and lovely clear evening Decided not to go to Namur and went with Edmonds on G.S. to Chatelet at 9.30. Caught lorry right into Charleroi. Dinner poor at 12 for 5f. Had a good look all over town. Saw Triage picture show at café & Nouveau Theatre. Fair. Some drinks and into several cabinets. Up one of mines slag heaps. Home at 10 after waiting for some time for car and only went as far as Gilly. Walked rest and home by 12.30 after drink at café half way tired. Had a good supper off and fruit Bed at 1.30.\n","77":" Up at 8. Some sun mostly cloudy. Down to section at 9.30. Washed towel and sox. and in intervals wrote letters till 9 and bed. 4 men of 1915 home to-morrow. Nothing extra for christmas bar C.F. parcels rotten.\n","78":" No parades all day. Did washing all morning and then dried clothes. Fairly fine and in afternoon dried clothes. In evening some gone out and rest of us after tea some drink Fair. Bed at 9.30. Lenard & King\n\nmerry.\n","79":" Sunny in aftn. & cold in evening. Cloudy in morning. No parades. Offers up last night. Bremner. Had a bath in morning and afternoon rode to Fosse on bikes and only one photo. Not very exciting. In evening wrote letters. Robertson & Spencer away. Bed at 9.30.\n","80":" Windy and some rain. No parades. Visit from Education Officer at 11.45. Lighted fire in morning and in aftn. finished washing and some drying in evening. Sent in films Read till 11.\n","81":" Windy & raining all day and very miserable. Dried clothes in morning and cut up biscuits. In aftn. read & wrote letters. Wrote letters in evening. Robertson to drivers. Doyle to school carpentry. Poole Brakesman. Bed at 11.\n","82":" Windy and rain all day. Wrote letter in morning Walk in aftn. with Edmonds. News of going home. Joy. In evening finished letter. Bed at 12.30.\n","83":" Fine in morning, dull in afternoon, some rain in \nafternoo\n evening. In morning got mobile and wrote application form. In aftn. rode to Villers Poteries to see football & prince of Wales. Very rough track going better returning on main road. Very dull light but got 3 of H.R.H. and two football matches. In evening cut tobacco and wrote diary and read. Carrick back to-day. Edmonds Scott McGloughlin Linton to Charleroi.\n","84":" Usual. Read in leisure. In aftn. walk towards Le Roux Read in evening till 11.\n","85":" Usual nothing extra. Fine Walked to Chatelet & back by 4. With 1st Coy man back from leave. Rest out. Spent evening reading.\n","86":" On leave to Namur. Caught lorry at 10 right in although cramped Fine look round. Picture show at 6. Train late. Got away at 10.10. Home at 1.15. Read till 3. Bed tired\n","87":" Cloudy. Read in leisure. Tied & bed at 7.\n","88":" in morning rather cloudy in afternoon. Visit from Birdwood at 11.30 and got some photos also of staff. Full turn out of officers and C.R.E. In aftn. walk to Devant les Bois with Edmonds. Some more photos, and enjoyed it. Nice people there. Home for tea at 4. In evening wrote diary and read wireless till 10.\n","89":" Dull, windy, and some showers all day. Parade at 9.15 cancelled. Soaked equipment and spent rest of spare time reading French, Pelman & Wireless. Bed at 9.30.\n","90":" Rather good day and only sometimes cloudy, couple of light showers. Drill order parade for all hands at 9.30. Set out for Charleroi about 10 and got ride in lorry from Presles. Usual dinner. Got 6 photos. Walked round a good deal and gave in films. Very enjoyable. Walked back at 3.30. Saw Edmonds at Chatelet. Home at 7. Bed at 10 after some reading.\n","91":" Usual. Fine day. Spent morning and part of afternoon fixing equipment. Rest of time read.\n","92":" Fine day & sun in morning\n\ncloudy in afternoon. Off at 9 with blankets to Chatelet. Unloaded and back to ordinance and then to dump Back to ordinance & then to blankets and got plane from carpenters. Off to dump again and had lunch. To Charleroi through Couillet to dump and went up for films but not done. Back in lorry with Edmonds and got tea in Chatelet Sentimental Blokes at 6.30. Fair show. Walked home with and Sparkes. Home at 9.30 and bed at 11.\n","93":" Rain in morning. Finer in aftn. Some wind. Parade at 9.30. and spent morning and afternoon on equipment. Bed at 10\n","94":" Dull all day and didn’t go out at all. Usual parade at 9.30. Guard at 5 over horses and up till 11.30 and some gramophone to pass time.\n","95":" Off all day. Cloudy. Finished equipment & didn’t go out. Read till 10. Films back and car.\n","96":" No parades. Some photos in morning & gramophone. In aftn. read and again in evening till 10.30. Cloudy.\n","97":" Drill order at 9.30 and some orders. Went for bath to Presles good. Dull. In aftn. cleaned up letters etc for Brussels leave Bed at 10.\n","98":" Up in good time and left about 10. Dull all day. In pontoon wagon to Chatelet and got paid. Kendall in charge. Had dinner and down to train at 1.30. Spent till 3 waiting for train & came without much time to spare. Set out with good seat and arrived at Brussels after dark at 6 o’clock.\n\nMarched to leave club and then Kendall and I went in search of a hotel. Tried Continental, Metro but no luck so found Café de l’esperance near Anspach Monument and close to Y.M.C.A. Good rooms for 15frs & 10 frs except Mo. Went out at once and had dinner. Soup. omlette & coffee for 10 frs each at flash restaurant. Then promenaded. Saw a picture show, theatre and american bar and home to hotel at 12. Bed at 1 but couldn’t sleep till 3 excitement.\n","99":" Dull. Spent day hunting up sights with and also visited lace factories. Some rain. Up at 10. Dinner and tea at Y.M.C.A. 1\n","100":"\n In evening misty showers all evening. Spent time at Madrid and other cabarats. Bed at 1. Incident of Funny Boy.\n\n16.1.19. Up at 9. Lovely day. Bustled round all morning with getting photos of places of interest. Met Kendall at 12 and went down to station after trying to get dinner at Y.M.C.A. Found a good restaurant and only finished 4 of 6 courses for 10frs and then missed train at 2.10 went at 2. Caught one at 3 and walked from Luttre about 5 kilos to Gosselies. Some civilians with us and some fun. Gosselies to Charleroi by car and some more fun. Had dinner good and more fun caught car to Chatelet and walked home arriving about 10 and bed soon after.\n","101":" Dull. Spent day cleaning up\n","102":" Dull and froze. did washing and dried in evening. 2 sections amalgamate & trouble with cooks\n","103":" Some sun. Froze again. Finished drying in aftn. spent most of day running round looking for chaps. No parades. 1915 men up to November go home and cheered Barnes & Harvey gone on 17. Gibbs, Sparks, today. with Linton & . Coy very small. Sunday. One film developed in evening with Sidman. Very good Wrote till 11.\n","104":" Heavy frost. Fair sun. Drill order parade at 9.30 usual. Then took some photos of chateau and in aftn. walked to Devant les-bois and took monument and had tea at House Good fun. Back at 4.30. Dog. Edmonds in evening. Developed film with Lenard in evening. Good. Read papers till 10.30. Marble works.\n","105":" Ordinary parade at 9.30 and in morning printed films. Wrote all aftn. Turner & Webster to Mess. Read in evening. Bed at 10. Heavy frost & snow slight in even.\n","106":" Frost. Usual. Nothing of interest Good deal of reading until 10. Visit to Devant-les-Bois in aftn.\n","107":" Usual. Spent day on books. Heavy frost.\n","108":" Usual. McGlaughlin on guard. Sefton & Parsons promoted. Despatch re. Varsity men to Australia. Sentimental Blokes in evening didn’t go. Mooted move to Bouffioulx French possession of No 1 & 2 billets. Wrote all evening till 11. Visit to Devant in aftn. ice patterns on window\n","109":" Still frosty. and some snow. Usual. Spend all day doing some washing and having a bath. Le Havre men back. On piquet in\n\nevening. Visit from Garrow at 8 and all to bed at 10. Bed at 10.30 after some reading.\n","110":" no parades. Snow all day and got some fairly good snaps round village. In aftn. did some writing and several odd jobs and read in evening till 10.\n","111":" Slight snow, cloudy but not extra cool. No drill order parade at 9.30. Some photos in morning and good fun snowballing. Some more in afternoon. Read and wrote in intervals. Bed at 10. Orders of demobilisation for 29th at dinner time.\n","112":" Snow in night. Fell in at 9.30 as usual and nothing doing. Some photos about dinner time and good fun snowballing. Read in spare time. In evening got mobile and trouble about gear. Eventually to take everything. Goodbye to Blackmore Tuck, Robb. Bed at 10.30 tired.\n","113":" Up at 7 and finished getting ready. Had to wait some time for limbers to get ready with frost clogs. Very cool and hard frost. Got off at 9.45 and not time to say goodbye to all. In to Chatelet about 10.30 after quick ride. Went to see Edmonds and spent some time with him. Then on to Charleroi by car after farewell drinks with Edmonds. Got to camp about 11.30. and reported. Sleeping in cold machinery shed on floor No fires. Steele ill. Met rest of engineers. Had a clean up and back to Charleroi. Had dinner and in aftn. saw pictures in\n\narcade after visiting Y.M.C.A. and then had tea and went to Dinkum Diamonds Show. Only fair. Back to bed at 10. and sleeping on narrow table. Lot of row and couldn’t sleep for some time.\n","114":" Up at 7 and rather cold. Had a wash and big scramble for breakfast. Marched off to main station at Charleroi at 9 and train moved off about 9.45. 28 U.V. men in a german cattle truck with seats and a stove- at one time.\n\nCold travelling. Route by Mons, Valenciennes, Douai, Arras, Doullens missing Rouen. Passed Douai in light. Drew rations at Mons and good stuff mostly comforts. Bed at 8 and crowded but sleepable and slept fairly well.\n","115":" Cold again but we had salvaged a good stove fairly early and every comfortable after fire buckets. Discovered a ration train and collected biscuits wine, soap in great quantities. Arrived at Arras about 2 and stayed there till about 9. Slept fairly well again although very dirty feeling.\n","116":" Very heavy snow during night. No map for guide. At Motterville accident to chap for getting tangled in passing train Results unknown. Arrived at Harfleur at 3 and soon afterwards marched to A.I.B.D about 2 kilos and got into tents in A.G.B.D. Very cold and miserable although a fair number of blankets. Bed at about 9. Boundy, Elder, Nicol, Lint Child and 2 Fairly comfortable although 9 in tent. Had tea in mess huts and very rough.\n","117":" Up at 8 for breakfast and still freezing. Sunday. Check roll call. No other parades. and in aftn. walk to Harfleur. Spent rest of time finding run of camp and reading in Y.M.C.A. In aftn. also listened to band for awhile and in evening saw parts of pictures and show concert party all pretty feeble. Bed after meals in mess hutt at 9.30 Had a good vapour bath and 2 changes of clothes.\n","118":" Gave in equipment. Still frosty. In evening orders to take with water bottle and haversack. Short walk in morning with Elder & Child. In evening saw parts of pictures and concert party. Usual rubbish. Very cold and miserable here. Met Bill in evening at 9. Bed at 9.30. Slight thaw in evening.\n","119":" Thaw. Some sun and wind in afternoon. No parades. Stayed in bed till 9.30 and missed breakfast. Usual dinner. Wrote diary and letter in afternoon. Saw Bill in morning. Passed time reading in Y.M.C.A. in evening.\n","120":" Very sloppy and heavy rain during night. Had to resalvage equipment in afternoon and to go with pack, haversack & water bottle. Breakfast in bed. Standing by all evening till 8 and then not moving. Bed as usual at 9.30 after some discussion and arguments.\n","121":" Cloudy all day and still sloppy. Breakfast in bed. In aftn wandered round. No pictures\n\nin aftn. In evening visited Salvation Army and two games of draughts. After saw lecture in cinema hall poor. Bed at 11 after another discussion. Heavy rain till late at night and some leaks Heavy snow later on.\n","122":" Thaw nearly all day and some sun. No breakfast. May move this afternoon. Handed in all gear and got sea kit bag. Froze again at 3.30 and very cold. Elder to hospital. Went to S.A. in evening. Lecture on Russia. Very good and some amusement. Bed at 10 after refreshment. Extremely cold and everything solid. Slept fairly cold.\n","123":" Sunny but extremely cold all day. Up at 9 and moved to new quarters in huts past cinema. Rest fell in for a route march but most of us dodged it. In aftn read Dante Inferno at S.A hut. In evening wrote two letters. Had to stand by from 3.30 but not going after all. Bed at 10 after refreshment.\n","124":" Sunny but cold and hard. Parade at 9.30 for church but dodged it. Also some fatigues. Spent morning cleaning up. In aftn. lecture by Y.M.C.A. in cinema hut and band. No sign of going. Usual cry of to-morrow or perhaps to-night. Read in evening.\n\n10.2.18. Sunny but cool. No breakfast and out at 10. Read paper till dinner. Warned at dinner time to get ready for draft and fell in about 12.45 after some bustle round.\n\nCollected rations and embarkation card and paraded on main ground and marched off to . Met and caught train at 1.30 arriving at Le Havre about. Marched about ¾ mile to quay and after some wait got aboard. Mostly Tommies and some \nBritish\n. Yanks. Waited till 5.30 and then set sail in St David. 20 knots, 3 screw 2500 tons. Good crossing very slight breeze and gentle roll occasionally. Not so cold as expected. Passed I of Wight about 10.30 (Wreck of American Leave Boat and dropped anchor at Southampton at 12.30. Fairly cold trying to sleep on open deck and didn’t sleep a wink\n","125":" Sunny and cool. No breakfast and parade at 9.30. Most of us got called out for guard and Lynch, Olley & myself on. Awful mess changing over and bad guard room. All well until 4 and got relieved tea expecting to go on draft that night. However only 5 going. Bed at 10.\n","126":" Passed time somehow until 7.15 and weighed anchor and up alongside Mauritania at 8.15. Met our representative and got some refreshment and also rations for journey and then marched off to station about 1 mile away. Caught train at 11 in 1st Class carriages to Salisbury with 5 of us in compartment. Very good trip and felt no cold at all.\n\nChanged and on to Warminster.","127":" part of journey had lunch and good wash. Walked from Warminster about 2 miles to No 1 Brigade camp arriving about 2.15. Roll call and some orders. Leave of 7 days within the next four and then fairly quick move out. Drew wood beds palliases and shockingly dirty blankets. Met Roach and after wash had a scrambled tea. In evening wrote diary and arranged Blighty trip. Read a little and bed at 8 very tired after walk to Sutton\n","128":" Up at 8.45 and no breakfast. Parade at 9 and guard told off and Q.M.S. fatigue. I was on and didn’t do much except borrow a new haversack. Off at 11. In aftn. Medical board and told I was short of breath. Cleaned up a bit and walked in to Warminster with Child in evening. Not very exciting. Back at 7 and down to Greenhill Y.M.C.A. Had supper and to bed at 9.30. Not feeling perfectly well at all.\n","129":" Not too bad Thawed a good deal during night and more during daytime. Fell in at 9 after a poor breakfast and I went on dental parade missing the other. In aftn. walk to Sutton Veney and shifted camp. Pay at 11 and to go on leave on Monday. In evening met & the rest at No 12 camp Came back and supper at Greenhill\n","130":" Thaw and some rain. Went on parade and got told off for Mess Hut Corporal. Nothing to do.\n\nSpent spare time getting gear together. In evening walk towards \nSutton Veney\n Warminster and some purchases Back and supper at Club room. Got boots fixed up and five of us had a good look round and to concert in evening. Not much. Supper afterwards. Walked back to camp and more supper. Bed as usual at 9.30.\n","131":" Late for breakfast. Good deal of rain during day. Mess hut all right. Got things ready for leave. Took kit bag down in aftn and got passes at 5. Some going to-night to Salisbury. Had bath before tea. Nothing in evening. Supper in club hall. Still raining after walk to Sutton Veney to take washing and attempt to change puttees. Bed about 10.\n","132":" Reveille at 5.30 and breakfast about 6. Pretty scrambled. Got quite ready and went down to orderly room. Fell in but didn’t wait for officer and marched off without him. Very early for train and read paper till 8.20 when train arrived. Changed at Westbury and good trip right through arrived at Paddington about 11.30. Went with Child to Russell Sq & booked rooms at Imperial for Wednesday. Then to Horseferry Rd Crowded so had lunch at Victoria Restaurant. Very good although lost lot of time. Got a couple of things and caught train for Brighton at 6.30 in Pullman, arriving at 7.45 about. Missed bus through train engine breaking\n\ndown. Got to Dyxcroft about 9 and had a good supper and bath and also met Katie. Bed about 10.30. ","133":"\n very foggy in aftn. in London. after reading letters M’s letter\n\n18.2.19. Fairly windy and some showers and cloudy but not very cold. Had breakfast in bed and also dinner and didn’t get up till 4. Spent until then pleasantly in bed reading and watching Sarah with presents for home. Had dinner and after walked to Rottingdean with Sarah and made a few small purchases. Cold much better. Then walked to Katies school and after a wait met her and said goodbye. Back at 8.30 and spent till 10.15 on supper and packing portmanteau. Very full and heavy but wonderful things and I will try my best to get it over. Bed pleasantly tired and slept well.\n","134":" Up at 8 and just time to get everything ready. Caught taxi at 9.15 and soon in Brighton after a bonza ride. Got a good seat after tipping the porter and spoke to Auntie before train went out Good trip up and arrived about 11.20 Put portmanteau in cloak room and rushed off to see Dot Hilditch. Booked seat for Lilac Domino and had lunch at Aldwych by myself Fine show in aftn. and Clara Butterworth very fascinating. Show over about 4.50 and a walk before meeting Dot at 5.30. Caught bus to Bayswater and to Princes Mansion Hotel.\n\nHad dinner straight away and hurried to underground and soon got to Alhambra show. Only fair Elsie Janis best but not wonderful and some stories at the end. Dot has a very forced and annoying laugh. Back by underground and decided to act the same next day. Back to Imperial and got room alright and bed about 1 after taking Dot home. Day cloudy and some showers.\n","135":" Up too late for breakfast and walked to Strand and had lunch at Aldwych. Went by tube to Kings Cross and after some trouble found Post Office at St Pancras Granary. No mail. Back by bus to Strand. Visited Guildhall before going to Post Office but not in and walked there catching tube from Aldgate. Met Dot at 5.30 and went by tube from Trafalgar Square. Hurried meal and caught taxi just in time for pantomime at 7.30. Rather disappointed and very long drawn out. Back by 12.30 by tube and caught last trains for Russell Square. Bed at 1.30. Cloudy all day and some showers in evening\n","136":" Up in time for breakfast at 9.30 and quite fresh. Walked to Strand and Piccadilly Circus and Regent Street. Very pleasant with some sun. Spent till after show to 6 having a clean up. By tube to Bayswater and had dinner and off to Box of Tricks by tube to Leicester Square Not much of a show and \n\nquite ordinary. Over at 10.30 and after taking Dot home walk to Waterloo Bridge before bed. Things rather slow. Bed 12. Coliseum in aftn.\n","137":" Up in time for breakfast and walked down to Strand and Regent Street before dinner. Had lunch in Aldwych and spent aftn. in theatre. Met Hooper yesterday after lunch in Aldwych theatre. Very fine show at Coliseum & Hambourg 2 encores. Very miserable in aftn. and poor show in theatre.\n\nSaw Chinese puzzle in evening after dinner at Aldwych. Very fine and back to hut for supper. Walk before bed at 12. Cloudy.\n","138":" Cloudy and some showers. Up at 9.30 and met Child. Intended to go to Southend but no time so walked down Regent Street to Regents Park, and spent afternoon. Very interesting there and pretty. Back at 5 and after some dinner walked to Queens hall. Met A.F.C. Sergt and heard performance. Very fair. Back to hotel after a walk back and a while in Lounge and bed at 12.\n","139":" Cloudy all day. Up at 8.30 and after breakfast walked to Strand and caught a bus for Fenchurch St. Purchased watch and after early lunch took bad round to Paddington after a mistake on the district. Then off to St Pancras but still no mail. Came back and had dinner and met Danby. Hurried to Russell Sq. on bus and walked back to Coy. performance.\n\nSplendid show. Came back for supper at Aldwych and home after a walk round.\n\nDecide to stay an extra day.\n","140":" Cloudy. Up for breakfast at 9.30 and down to Fenchurch Street again. Got chain for watch and after lunch trip to Harrods at Knightsbridge. Wonderful shop and some purchases. Back and a walk down Strand and Whitehall before dinner. Down to catch train at 5 and a while to wait. However, got trunk and away at 6.30. Fine trip to Chippenham about 90 miles arriving about 8.15. Then train to Trowbridge and then to Warminster two stations on arriving about 10.30. Had to walk to camp and on arrival no beds left and more men put in hut. Also boat roll called and most paid and inoculated. Came back with Leslie & left port in cloakroom at Warminster Bed with only two blankets at 12.\n","141":" Stayed in bed as long as possible before 9 parade and then found boat roll was all right and got paid £ 4 and inoculated at 11. Fell in again at 2 and passed through Q.M.S. Got Kit bag safely and in evening went to Greenhill Y.M. to write letters but too crowded couldn’t change puttees. Back about 8. In morning moved belongings to N016 across way and plenty of room and fairly good clean\n\nblankets. Slept well. No meals from military\n","142":" Up at 9 & no breakfast. In morning fixed up postal affairs and finished for day. Cleaned up and at 4 went to Warminster walked. Got a good tea, eggs & sausages and purchased nuts, Kitbag fastener and wrote letters came home by car and sent cable from Greenhill. Bed at 9 after getting two parcels. Cloudy showers.\n","143":" Fine day and beautifully sunny. Reveille at 5.15 and up at 6. Got ready in good time and set out about 8 arriving at Warminster at 8.30. First train went at 7.50 8 in a carriage and got on board safely and also had no trouble at all with Kitbags. Out at 9.30 and route through Taunton. Groome Exeter, Dawlish Teignmouth and Plymouth to Devonport. Got tea and buns at Exeter from Lady Mayoress and quite good. Very pretty trip and along coast at Dawlish and extremely pretty. Train took us right to Anchises side and a brief wait got on board safely. - also the port. Spent aftn. settling down and everything all right. Fairly good food but rather crowded. Bed at 11 after some trouble with hammock Henville, Hardwick, Hooper, Downey, Kneebone, Darwin, Colman. and various others aboard here also Jeffreys from A. Varsity. Slept fairly well although rather uncomfortable in hammock.\n","144":" Awoke at 6 by calling for mess orderlies and breakfast at 8. \nFair\n None. Supposed to sail at but postponed till 4.30 Met Colman in morning and after cleaning up had a go at diary and read a magazine. Dinner at 1.30. Fair Wrote more diary in aftn. and again in evening. Set sail exactly at 4.30 and very interesting. Lion & Tiger, Colossus. , a 47 knot boat. An aeroplane boat, destroyers, 3 submariners and numerous merchant boats. Also Yarra, & Melbourne & Derbyshire. Cloudy all day and fairly misty. Quite choppy directly we left harbour and rather unpleasant. However not sick yet although a lot have been. Strong head breeze. Had a few walks on deck and turned in at 10-11.\n\nSunday\n","145":" Fine in morning but foggy and some light showers in aftn. and foghorn used. Still just as rough. Slept extremely well and up at 8.30. In morning spent most of time on deck. Fairly strong headwind good deal of sickness still. Stomach still rather upset but not sick yet at all. In aftn. had to be mess orderly and washed up. Boat drill at 4 and yarn to Colman and got a book from him. Read in evening and some time on deck. Eggs boiled for breakfast & bacon and fish for tea. Very\n\ngood food so far. \nTh\n Time put back 40 minutes. Bed at 10.\n","146":" Dull all day and a good deal rougher. Very few sick. Still feeling a bit unhappy and no appetite. Spent most of time on promenade deck and in aftn. sprayed in hospital. Had supper and bed at 10. Slept well.\n","147":" Not so rough. Sunny in morning. Good headbreeze yet. In aftn. cloudy and some heavy showers. Some visits to canteen but only fruit amp; lemonade available Bridge in evening. Rest of time read and spent on promenade. Saw Colman. Supper at 8.30 and a pipe on deck before turning in Getting a good deal warmer. Passed a cargo boat in morning about 11.\n","148":" Dull. Much calmer and still inclined to roll a lot. Didn’t get up till 9 and without breakfast. Not hungry. Spent time on promenade in morning. Ship changing course a lot. Sports and entertainments being organised. In aftn. read on promenade in pleasant sunshine. Supper in evening and read before bed a magazine till 11.\n","149":" Up at 7.30. Beautiful sunny day and lovely blue water with white horses. In morning read motor, and more and letters in aftn. and evening still not hungry. Passed warship going to England after tea. Highflyer 5600 46\" guns. Nothing else exciting Awnings put over ship in aftn. Bed at 9.30.\n","150":" Up at 7.30 and rather early breakfast. Two canvas baths fixed in morning. Warmer but beautiful cool breeze mostly behind and partly from Africa. Spent nearly all spare time reading Pelman and Motor Manual. In evening played dominoes and cards for awhile. Had some supper and a walk on deck with Child & Nicoll. Nicoll out of hospital to-morrow. Bed at 11 after reading awhile in bed. Porpoises\n","151":" Up at 7.30 and nothing unusual. Warm following breeze and well in tropics now. Plenty of schools of flying fish. Not hungry yet although almost fasted yesterday. Read more Pelman and Motor and also some Roll Call. Bed at 11.\n","152":" Duty Company. Very warm with some breeze and misty sun. Read and played bridge. Supper and bed at 12 after reading. Church parade at 9.30 but didn’t go. Finished Roll-Call.\n","153":" Warm but good few heavy showers all day. Up at 7.30 and played bridge in morning and got inoculated. Read in aftn. Bridge in evening and good supper afterwards. Average of 330 miles a day. Breeze in front.\n","154":" Had a good S.W. shower and wash with last night. Fair breeze and cloudy. Read Pelman in morning and played some bridge in intervals. Bed at 11. Crossed equator about 4 P.M. Cloudy and fairly cool head breeze. Warm down below.\n","155":" Sunny but good breeze and not too warm. Played bridge a good deal and read a little in intervals. Saw Pole star & Southern Cross in evening. Dinner on deck.\n","156":" Sunny and beautiful breeze. Read calculus nearly all day. In evening some concerts going on. Dinner on deck. Bed at 11.30. Fine sunset.\n","157":" Calculus all day. Lovely day. Watched sports in morning and met John Hill. Dinner on deck. Calculus going well. Bed 11.30 after some light reading. Duty Company. Filled in forms for bank money.\n","158":" Fine day Spent mostly on calculus. Boxing in aftn.\n","159":" Still fine with head wind. Church parade at 9.30 rather hopeless. Watched boxing finals in aftn. some good. Missed dinner and not feeling at all good. Bed fairly early and supper later on.\n","160":" Fine with heavy clouds on horizon and fairly rough all day with strong head wind. Found it started at early morning Stayed in bed til 9 and not feeling good at all. Nothing to eat till tea-time. Haven’t seen rest all day and did practically nothing all day. Talk with Colman at 12 and paid £1 in afternoon. Propeller racing and a good deal of spray. Feeling slightly better in evening. Bed at 9.\n","161":" Still rough and strong head wind. Only did 76 miles. Feeling a good deal better today. Didn’t do much all day and slept on promenade for awhile his morning. Biscuits and lemonade for dinner. Some reading in aftn in hammock. Posted letters before dinner. Played dominoes in evening and had supper and bed at 10 after reading.\n","162":" Perfect day, gentle swell and glorious breeze. Did some calculus in morning. Orderly corporal aft to-day. Expect to reach Cape Town to-night or to-morrow morning. Sea oily and very muddy looking and due to sea weed. Some ropes of it floating about. Sighted land at 12 and followed coast towards Table Mountain. Still a good way off at 6.30. A good deal of tacking. Expect plenty of leave. and rumours of two decks going at a time. Spent aftn. talking to Lynch and light reading. Anchored about 8.30 and we were playing dominoes. Went up on deck and had a look round before supper. Town circled by Table Mountain and the others and light of city rather pretty. Supposed to be pulling in in morning to wharf. Read till after 12.\n","163":" Nearly everybody up at 6 and breakfast 7, as clocks put on to summer time here. I didn’t get up till last although a good deal of row on. Spent morning on deck. Heavy fog on all morning but otherwise fine and we couldn’t much of\n\nanything. Cool last night. Only tug called twice and brought doctor on board. Clean medical sheet I believe but no sign of moving. Yellow flag run up and a lot think it means quarantine. Incident of doctor kept standing on steamers ladder. Trouble about wanting us to out here and not letting us on shore. Captain refused and going into dock to-morrow morning but no general leave expected and maybe some trouble to-morrow Spent afternoon sleeping and reading and some more reading in evening. Supper and a stroll on deck before bed at 10.50. Read till 12.\n","164":" Fine day and very hot in middle. Up at 8 and got ready to go ashore at 10. Spent awhile on deck and leave arranged properly now. Leaflets given out. Down on deck at 10 and a lecture by O.C. F Coy. Good. Going ashore by companies and got off about 10.50 marched out to Dock Gates and then broke off. Missed child, Mc & Lynch. and out with Nicol. Walked to Adderley Street and got some books and visited the Dutch Reformed Church. Then straight on and into gardens. Very pretty and full of colour and plenty of plain and gum trees. Places very similar to Australia. On to Museum and spent a few minutes looking at exhibits. On to main path and met the three others. First called to Anzac Lounge and booked seats to Hout Bay. Walked down end of avenue and very pretty and shady and then back to University Met Townsend and had a good\n\nlook round shop and talk to instructor Quite a good shop and slightly better than ours. Came back to Adderley Street and had lunch. Very good meal at Creamery for 2\/- of 6 courses. Went down to Anzac Lounge at 2 and caught charabanc straight away for Hout Bay. Rather bumpy but otherwise good. Went by Strand Street & Somerset Road to Sea Point, Camps Bay. After Sea Point followed Road on sea front all the way winding with the mountain and very pretty with views of bays and private houses. Got to Hout Bay at 3.15 and walked down to Bay and spent a good time clambering over the rocks and admiring the scenery. Came back at 4.30 and had welcome afternoon tea in the Pavilion. Very hot but shady everywhere and house surrounded by trees. Met the three others who went by a different car Started back at 5 and cooler. Pretty stiff climb but wonderfully pretty through long cool avenues and pretty groves of pines and undergrowth. came through Wynberg and Rondebosch and over Kloof Nek. Wonderful view right across peninsula to Simons Town and Cape town and stayed there about 10 minutes admiring the view and back through town to Anzac Lounge. Suburban private houses very pretty and original. Had a good wash and a good meal of egg and tomato sandwiches and fruit salad afterwards. Arrived back about 6 and after tea went on to pics after deciding not to go to Theatre. Didn’t go to Pierrot\n\nshow and some boredness till Nicholl and Townsend went off together to Pierrots and Mc & Lynch found two & Child & I people to talk to. Not particularly interesting but stayed till pier closed and then went up to Anzac Lounge and then back to boat about 12. and met the rest. Bed about 12.30. Not many cases of bad behaviour\n","165":"\n Except drunk who was sick on charabanc.\n\n22.3.19. Up at 8 for breakfast. Fine day and warm again. Got cleaned up and things straight and leave at 10 to 8 in evening. Went with Lynch and Mc. Child on guard and lost Nicholl. Got off at 10 with B Coy and up to town. Spent morning purchasing salts etc Took a few photos and then walk on pier after refreshment at Anzac Lounge. Had some fruit before going into town. \nWent down to pier before lunch\n . Went down to pier before lunch and watched a conjurer for a while. A stroll on pier and lost Mc so went back to shop and met Townsend by chance and \nlost\n had lunch. Nicholl & someone else came in when we had finished and we went down to pier and got rid of Townsend Got the hump and decided to go to Camps Bay and stopping at Sea Point. Pleasant trip by car and at Sea Point soon fixed up Lynch. Not many people there Very hot and walked up hill towards Camps Bay and caught car. Very pleasant there and got a number of snaps.\n\nand so met someone to talk. Very interesting and quite satisfied. Hot and walked about without finding a shady spot and then went up for afternoon tea. Very enjoyable and lost at about 5. Another walk and caught car back to city arriving about 6.30. and went to Anzac Lounge. Met Child Mac & Lynch. Had some cool drinks before leaving Camps Bay and some more at Y.M before meeting others. Then some more fruit and lemonade and down to pier. Spent awhile there and back to boat about 9. On evening of 21 met a chap from Riverton and down to pier with him but soon said goodbye. Still coaling and no sign of going out. To bed after a talk about our experiences and slept well.\n","166":" Fine slightly cloudy. Up at 8 and feeling dopily tired all day. Still coaling and finished about 11. Tug moved us out at 11.50 and rather good send off. Good crowd on various piers cheered us and most of ships dipped their flags. Took some time to manoeuvre round and watched on deck and got some more photos. Only had pudding for dinner. Had a game of bridge in morning and played awhile in aftn. and wrote diary rest of time and in evening.\n\nIn sight of Africa. Heavy fog just outside Capetown. In aftn. good issue of grapes enjoyed. Spent some time on deck in evening and glorious sunset Had supper of grapes and tinned pineapple and to bed at 9.30 after some reading & very tired.\n","167":" Fine day. Nearly head wind. Up at 8 and nearly missed breakfast. Passed morning on deck not doing anything. Had pineapples for lunch and slept in afternoon till tea time. Played dominoes and had supper in evening and a good bath after supper. Bed at 11 after reading a magazine.\n","168":" Up at 7.30. Fine, some clouds. Spent morning reading magazine and brought portmanteau to our deck. All well. Eat dinner and almost sick after it. Read magazine in afternoon and evening. Bed at 10.\n","169":" Fine and fairly smooth. Up at 8 and after breakfast usual. Talk to Colman in morning Read magazine in aftn. & evening. Bed at 12. Supper & dominoes in evng.\n","170":" Up at 8 Fine. Read magazine all day. Watched sports for awhile in morning & annoyed Nicholl. Mac to hospital. Did some calculus in evng & spent most of time on deck. Not feeling very grand. Fairly rough in evening and strong side wind. Some dominoes and supper in evng.\n","171":" Beautifully fine a little on cool side. Up at 8 and did some Pelman and calculus during odd moments.\n\nMedical board in morning and saw Mac. In aftn. played bridge till 3.30. and then read below till tea after some biscuits & fizz. In evening played dominoes for awhile and then read Pelman. Supper at 10 with Child and Nicoll and bed at 11.\n","172":" Up at 8 and fine and a good deal warmer. Spent morning on deck reading Pelman Calculus and Scots Calendar after a yarn with Basher. Couldn’t manage dinner and not feeling fit yet. Had a sleep in aftn. and a little more reading. Did main calculus in evng and dominoes at supper Bed at 11 and read till 1. Rather cloudy and a good wind behind.\n","173":" Cloudy. Up at 8 and rather tired. Rolling rather a lot and strong wind behind us. SUNDAY. Rather rough in aftn. and evening and some waves on promenade deck. Didn’t do much and read Scots in aftn and had a sleep on deck. Bed fairly early. Church parade at 9.30 and usual Photos taken afterwards by Jeffreys.\n","174":" Fine day. L. Finished calculus and read a little Pelman in evening. Feeling pretty rotten. squirrel died. In aftn. had a bath and washed clothes. Evening boiled clothes and played dominoes at supper at 9. Sleep at 12.30. Still rolling but not so rough. Kit inspection at 10. Got oil from Colman who put my things through. Rather a nuisance but everything alright.\n","175":" Communication with Australia yesterday. Fine cool wind Hung out washing. Still uncomfortable\n\nWrote diary and some organisation in morning. Spent some time exercising up and down. Slept a little in afternoon and read Pelman. Read more in evening and supper as usual at 10. Didn’t sleep till 12.30.\n","176":" Up at 8. Fine day & pleasant cool breeze. Last night after tea had another bath and very cold. Washed clothes after but very bad yet. Yarn to Basher. Late for breakfast. Read all Pelman books during intervals. Boxing at 10 and watched with Lynch. Fair. Spent aftn. in hammock. Spud peeling tomorrow at 6. Couldn’t get a look at boxing in afternoon Read in evening and supper as usual at 10. after some dominoes. Bed at 12 and didn’t sleep very well.\n\n3.4.19.Called at 6.30 but didn’t get up till 8. Cloudy all day and fairly cool. Got on to spuds at 8.30. Some trouble to collect men but satisfactory in end. Did some peeling myself. Finished alright at 12 and at 1 only carried 2 trays of meat from butchers. Still feeling uncomfortable. In aftn. dried handkerchiefs and read and slept in hammock till tea time. Supper as usual and some dominoes Bed at 11 and sleep at 1.\n","177":" Cloudy but fine. Spent time on deck in morning and met Colman at 11. Got clothes back and also a book by Ethel Dell. Read all aftn. and evening in hammock and finished book. Very fair. Supper at 9.30 and bed after 12 and put clothes in portmanteau.\n\nexpect to reach Fremantle on Monday about 12 and Outer Harbour on Saturday aftn.\n","178":" Fine slightly cloudy. Feeling rather sleepy. Spent morning on deck with Mac after a talk and aftn. had a sleep in hammock. In evening some Pelman and some dominoes before supper at 9.30. Bed at 10.30 and sleep at 12.30. Expect to hit Albany on Monday morning.\n","179":" Fine and rather warm. Up at 7.30 and after usual, canteen fatigue at 9. Nothing doing and during morning sent telegram and wrote letter. In aftn. slept in hammock and read a little. In evening spent time on deck and some dominoes and supper at 10 Sleep at 11.\n","180":" Warm and fine. Reveille at 5.30 but didn’t get up till 7 had a wash and clean up and breakfast as usual. Land in sight after breakfast. Spent all morning on deck watching land. Got some photos. Rather pretty coming in past rocky islands. and some reefs and passing pretty close. Pretty harbour but very narrow entrance and not much in wharves. Dropped anchor at 12 and then moved after motor boat pilots through the entrance. Dropped anchor off Albany and usual array of lighters etc. Flying a good few flags but not much enthusiasm. First batch of 200 off at 1.15 and continued on. Rumours of being quarantined for\n\nfour days for all West Australians Not a very big town. Spent all aftn. taking on water, luggage and some comforts and taking off troops. Tea at 5 on poky A. Deck and then watched her pull out at about 0.15 through entrance and past islands again. Watched from top of washhouse. Walk round and supper on C deck and Bed at 10. Read till 11 and hammock swung fairly good. Very strong head wind and rolling a good deal especially on our deck.\n","181":" Fine some clouds and strong head winds still ahead. Up at 7 at breakfast at 7.30. Warned for guard. On at 9 and some trouble to find men. On 1st relief and all seems well. Quiet all day and did a good deal of walking and reading. Stayed up till 12 and had some coffee and biscuits for supper. Did washing in evening.\n","182":" Fine and windy in morning Dried clothes in morning and spent day reading. Had a bath in evening. Read till 12 and sleep at 1. Passed \n","183":" Fine\n a steamer at 4 and another about 8 both going to West.\n\n10.4.19. Fine. Up at 7 and passed another steamer going to West. Cleaned up and spent morning on deck reading after going through spray and doing after breakfast before spray at 9. Sighted land about 11.30 and passed althorpes lighthouse and after Cape Borda and Kangaroo I. In sight of rather interesting land until dark and some lighthouses and steamers. Had a bath after tea and changed into clean clothes and packed gear and got mobile.\n\nSpent some time on deck in evening and then went below for supper at 9.30. Everything fairly quiet and bed at 11. Have good hopes of not going into quarantine to-morrow. HOME.\n\n"}}