{"Document Name":{"0":"Diary_0370","1":"Diary_0370","2":"Diary_0370","3":"Diary_0370","4":"Diary_0370","5":"Diary_0370","6":"Diary_0370","7":"Diary_0370","8":"Diary_0370","9":"Diary_0370","10":"Diary_0370","11":"Diary_0370","12":"Diary_0370","13":"Diary_0370","14":"Diary_0370","15":"Diary_0370","16":"Diary_0370","17":"Diary_0370","18":"Diary_0370","19":"Diary_0370","20":"Diary_0370","21":"Diary_0370"},"Date":{"0":"unknown","1":1721.0,"2":1722.0,"3":1723.0,"4":1731.0,"5":1732.0,"6":1735.0,"7":1743.0,"8":1749.0,"9":1750.0,"10":1751.0,"11":1756.0,"12":1757.0,"13":1776.0,"14":1777.0,"15":1805.0,"16":1808.0,"17":1809.0,"18":1810.0,"19":1833.0,"20":1874.0,"21":1875.0},"Entry":{"0":"\n\n \n\nLe Havre ","1":"\n\nSitting here in the Salvation Army Hut tonight, I must confess that Lord Byron's Poem, written before he left England, is a puzzle to me\n\nI know my sentiments are entirely different from those expressed therein.\n","2":" morning - the morning of the day I was again to leave Blighty for France dawned bright & calm & clear, & seemed altogether incompatible with the thought of war or violence. \n\nAfter breakfast the Draft assembled & marched out to the Lakes for a swim. These lakes lay about 3 miles distant from Sand Hill camp; & the journey there through lovely wooded hills & along over arched roadways, should have been very pleasant. Yet to one, at least, of the number it was not. For who could be glad when he was about to leave home & peace & - England - \"to wander on a foreign strand\" where, instead of peace & the peaceful songs of the birds, the hills resound\n\nwith the roar of the guns and the cries of the wounded and dying. However the water was grand & in it I forgot to project my vision into the future & so really enjoyed the dip - my last swim in Blighty.\n\nAfter dinner we had the usual kit inspection & at about 9 PM - having been subjected to the usual attendant irritations for a matter of hours, we set out as drunken & disorderly a rabble as ever marched to War, for Warminster. It was about 11 oclock when we entrained & 5.30 A.M. when we reached Folkestone or rather Shorn Cliff.\n\nWe stayed in the rest camp until 9.30 & then marched down to the pier where we boarded the boat & sailed for Boulogne reaching it at 3.30 in the afternoon. Next came the tiresome route march to the camp on the crest of the well known (to Australians) One Blanket Hill distant from the town about 3 miles. We stayed there overnight, during which we were forcibly\n\nreminded that the war was still on, by the fact of an air raid, of which we received warning at midnight. All were commanded to retire to the trenches, but I am afraid most of us were very tired, or very badly disciplined & so we kept to our tents & took the extra risk.\n\nOn Thursday morning at 8.30 we retraced our steps to Boulogne & entrained at the central railway station. The train consisted of the ponderous, foul French cattle trucks and in these we were stacked like sardines; so, needless to remark, our 14 hours trip was not too pleasant still, though I have often had better journeys I have also had worse.\n\nWe reached Harfleur at 11 in the night & from there marched into this camp, a distance of approximately three miles. By the time we had had a drink of tea (army variety) been issued with out blankets & tumbled - I was going to say \"into bed\" But that would give a wrong impression - into our tents , it was nearly 2 A.M.\n\n& as Reveille blew at 5.30, it will be easily understood that I was not too anxious to get out of my blankets when the time came although I did not know what pleasant surprises or new joys the day had in store for me.\n\nThe morning passed in the usual kit and medical inspections; & this afternoon we all had \"to go through gas\". This meant a walk of fully 3 miles, but it is always a pleasure at this time of the year, to travel beneath the glorious arching elms of France, unless indeed one is tired & hungry & despondent, & the end of the journey is 'God knows where'.\n\nThe \"going through gas\" today, as always, involved listening to several sleepy lectures on gases and respirators and hunnish cunning & our methods of stultifying it; all of which things we heard reiterated at every conceivable opportunity for the last two years. Still, those who are in the position to know & have the capacity for knowing say it is necessary to win the war, so I\n\ndaresay it is.\n\nIt was 5 oclock when the business was over and we had reached home & fully 6 when we got tea over. Since then I have been sitting here in the Salvation Army Hut writing letters, choosing \nrather\n to spend my evening in this manner in preference to attending the Picures and Concert in the Y.M.C.A.\n\nTis now 8 o'clock & I am very sleepy so am going to bed - Goodnight.\n","3":" Morning I was awakened by the beating of rain on the tent & found that, during the night I had contrived to get very wet owing to the roof being leaky. But such things are only trifles to the soldier & we did not make much fuss about it. Just a few homely Anzac epithets & the incident was considered closed. Now if such a thing had happened in Blighty ???\n\nAt 10 o'clock we all assembled & attended a church parade. I enjoyed it very much, too. The sermon was from the text \"My God will hear me\" & was very\n\nably delivered by the chaplain. During the singing of the last two hymns Holy Communion was administered & I was among the number who partook.\n\nAt 2 P.M. the advance guard of which I was one, set out to march for Le Havre. Arriving there at about 4.30 we were at once put on picquet to guard the place of exit and ingress from & to the station; & to prevent French children selling alcoholic liquor to the soldiers.\n\nConsequently on the trip up here the only two really drunken people on the train were two of the picquet, who, though they might have prevented others from imbibing imposed no such restrictions on themselves.\n\nIt was 8 oclock when we left Le Havre & we had the usual uncomfortable trip, being packed \"two thick\" in cattle trucks. I, especially had a very rough time of it as I happened to be next to (or underneath) one of the men who had too much \"Vin Blanc\". Such a hubbub they kicked\n\nup all night long with their singing & quarrelling & joking & love making! Well, all good things come to an end in time - even French train journeys - & ours ended today at about 11 A.M.\n\nWe detrained at a little village, the name of which I do not know, & marched here (Bertancourt) after submitting to the inconvenience and irritation of a \"gassy\" gas lecture, on the way up. Since arriving we have had a bath & are now ready for movement at 7 A.M. tomorrow.\n\nDaours, Thurday afternoon \n\nIn accordance with plan we set out from Bertancourt on Wednesday morning & carried our gear to Vignacourt a fairly considerable village 3 miles away. Here we rested for a couple of hours & expended our energies & our patience in a futile endeavour to get some hot water to make tea. A few managed to get their dixies filled at an old tank which was there officially to supply the Eau Chaude but most of us \"slipped\" badly of course, in times of peace\n\n& \"In the land of Lots of Time along the Castlereagh,\" this missing of a drink wouldn’t count for much, but here C'est une autre chose.Towards 10 oclock we boarded the Anzac Light railway & after a 5 hours trip, reached this battered old place in the afternoon.\n\nYesterday morning I went to Hamel and Corbie or what’s left of them in search of Graham, but was unsuccessful as his Battalion was moving up the line in the evening. This camp is very pleasantly situated right on the banks of the canal & the lads are having the time of their lives in the water. Some, I think, spend fully 12 hours a day in it & 5 more parading the shores in nakedness. For here the trammels of civilisation and the restrictions of conventionality are forgotten. I wish that I, too, were a good swimmer. But though I cant swim I can paddle & wash; & I would not mind a long spell here. However I don’t expect it as there\n\nare rumours that in a few days we shall be well in the thick of the tussel again.\n\nToday I have done nothing but swelter in the heat, as the heat is simply intolerable. Since tea I have been down to the old Y.M.C.A. in the village, to a concert and now am going for a dip - Good night.\n","4":" Evening. Nothing fresh has transpired. We are still in the same place doing practically nothing but eat & sleep & swim. Yesterday saw the passing back of loads & loads of wounded of the first Brigade, so I suppose Graham's Batt. have been dealing out the stoush again & getting the change . Our turn, as far as I know, is coming next week..\n\nYesterday morning & last night the bombardments were terrific. Last night, especially it was so violent that I was unable to sleep. Perhaps my short stay in Blighty has made me super-sensitive or over fastidious, and I’ll want baptizing over again. Today the guns have been\n\ncomparatively quiet as if worn out by their nocturnal activity . Tomorrow morning we are going salvaging somewhere around the village. Of course no other day but Sunday could be chosen for the business - There, there - that’s my over niceness coming up again. Soldiers I know, shouldnt be too particular.\n\nI should be writing letters tonight, but stationery is hereabout altogether unprocurable, so I shall have to wait till I am more conveniently circumstanced. \n\nIf one only had a book to read, what a difference it would make to these long lonely evenings. For they are long & lonely & wearisome too. Well the war may not last forever.\n","5":"\n\nWhat a lot has happened since I wrote last week & what a lot may happen before I get a chance of writing again, On Sunday morning we had church parade, & all augered \n\nwell for the spending of a quiet peaceful day. But during service the general & colonel walked away, and scarcely had we returned to our tents before movement orders were flying around, & by half past one we were all ready for the march. We lay about & wondered what would be the outcome of the order to each, until oclock when we set off in busses that in peaceful times used to traverse the streets of London.\n\nAfter 4 hours jolting through a heavy thunderstorm, we alighted in an open field & straightway went forward on foot. An hours march brought us to an old trench where had to bivouac for the night. The rain was still falling steadily & the trench was so flooded that we found it better to lie out in the open & take the risk. We had not been allowed to keep even our blanket so the night did not pass very pleasantly & the morning found us not in the acme\n\nof good humour. We sat there wooing the few stray beams of sunlight until late in the afternoon, when we again moved forward this time into the front line\n\nThe position was somewhere near Suzanne and Suzanne is somewhere in the vicinity of Peronne. We spent the night in an old trench of two years standing, The weather is getting very cold already and as the night was wet I didn’t enjoy my sojourn there one bit. However I enjoyed much less the treat that was in store for me next day.\n\nAt 12, noon, we set off from the trench to advance a distance of 2000 yards. For awhile we got along famously. Not a shot or shell came near enough to disturb our reflections. Far away in the blue a balloon was serenely smiling at us. We cursed it and wished it away but it still smiled on. Things remained very peaceful until we were about 400 yards distant from our objective, an old quarry containing several dugouts of Fritz's own construction. I didn’t like the look of the balloon; and I said so\n\nI had hardly finished speaking when Plonk! came a 5.9 within a few feet of us (we were only the remnants of a platoon, numbering about 15) Down we all went, as one man. Two more followed the first in rapid succession. We arose and an exciting race began. Even at the time when it seemed morally certain that we should be blown heavenward at any second I could not help marvelling at the precision and accuracy of those Fritz gunners.\n\nIf ever anyone has covered 400 yards, as heavily loaded and in as quick a time as we, then they have surely broken a record, But fast as we travelled we could not got away from those pursuing shells. They literally rained round us like hailstones, and how any of us finally reached that old quarry, will ever remain a mystery - yet we did.\n\nSurely God must often say \"No\" to Death just as the victim seems certain. I felt during that race for life, as a hare must feel when pursued by a hundred greyhounds each a little faster than itself, or like a man in\n\nthe D.T.’s who tries to shut out, and escape from, the implacable fiends that clamour to destroy him.\n\nWe were at last in the dugout and Fritz knew it as well as we did though, I doubt not, was not so thankful for the fact. To get out again we had to face a veritable tornado of shells and machine gun bullets and of course we had to move almost as soon as got there.\n\nYesterday morning at 4 A.M. we again \"hopped the bags\" to advance another two kilos for the Bosche was retiring on Peronne and it was necessary to keep within speaking distance. We had little opposition from the shells but the machine guns were chattering continuously and we knew from experience that the German gunners were excellent marksmen; a knowledge that by no means increased our confidence or aided our advance. \n\nWe took up a position is some old French trenches and established a couple \n\nof\n\nLewis Gun posts. Quite close to these posts was an elaborate German dugout - a neat little room with a window and table; a bunk and a stool. the roof covered with heavy iron truck rails, having on them a covering of \"elephant\" iron, and above that again about 3 feet of earth. I thought it practically safe from anything but armour piercing shells, and as it was not my turn to go on post, I lay down and went to sleep on the floor. \n\nAt 11.30 I went on duty a few shells were dropping round but only a few. A heavy shower was also coming on. Just as we reached the post however, both rain and shells came down \"thick and heavy\" The latter splashed all round us and once again I relinquished my hold on life - or almost. \"Lets shift up the trench\" I said. And we made the attempt. Fritz headed us off as if he were cognizant of our very intentions. We returned. The shells came faster and faster. \"Go to the dugout\n\nfor your lives\" I yelled; and we all went. We could not have been gone more than three minutes before we were back in the shelter again. But while we were away things had happened. A shell (4.2) striking the roof, had penetrated earth and iron and railway sleepers and entered. It was broken in two by the force of impact and the detonating charge did its work, but the main charge, fortunately, failed to explode. Had it done so there could not possibly have remained a living person in the place. \n\nAs it was all were drenched in the horrible, foul-smelling, ineradicable, yellow liquid explosive, and the chap who occupied the position so lately vacated by me had his leg shorn off and pulverised just below the knee. We did our best to tie it up, and sent him away with a smile but - - - . I wonder did he ever reach the dressing station; or is his mother whispering her prayers tonight\n\nfor the return of a son that is dead. Had I not gone out at that moment I certainly should not be here now. Verily I think God is watching over me. I never knew the beauty of the Twenty Third Psalm until I came into the line this time. What comfort there is in these words to those whose faith has become a reality.\n\n\"Yea though I walk through the valley of the shadow of Death. I shall fear no evil; for thou art with me…….\n\nWe should have been relieved last night but our O.C. forgot us, so we did not get out till 8 oclock this morning. And Oh! What a cold night we put in up in those old shelterless trenches; and to make matters worse we had had no rations at all during the previous 24 hours. Needless to say we were quite ready for our breakfast this morning.\n\nI fondly hoped we were out for a day or two’s spell, but at one oclock we were ordered to return again to the land of shells and bullets.\n\nAnd that’s where you find me now -\n\nJust resting by the way. And Tomorrow? why tomorrow I may be - Myself with yesterday’s seven thousand years. \n","6":"\n\nYesterday - no! the day before - we left our homes of an hours and returned to the trench we had just vacated, where we stayed for the night in some dugouts.\n\nYesterday morning we again moved \"Vers Allemagne\" and took up our position just in front of a couple of noisy howitzer batteries that had just come up.\n\nHaving dinner there we left in the early afternoon and came here to some old German huts on the bank of the canal. We had a fair nights' rest despite the fact that the droning of Fritzs bombing planes could be heard all through the hours of darkness; and once or twice in the early evening bombs crashed uncomfortably close to out burrows and caused rather an undignified smothering of fires and extinguishing of candles One of the idiosyncrasies of the Digger is his inability to realise the presence of danger until it is forced upon his\n\nnotice by the most unmistakable evidence .\n\nWe have had a decent meal (the retreating Germans have destroyed the locks and the consequent emptying of the canal left great numbers of eels stranded, and these we subjected to the tender mercies of our Babbling Brooks) and we are now getting rid of our hastily written letters for many of us doubtless the farewell lines - prior to moving on. The enemy is retreating very rapidly and we must keep plodding on to keep in touch with him. The idea of the authorities seems to be to keep him hustling. He must be driven back to Peronne now and I have no doubt he shall make a determined stand there. If he does, it will be \"He and us for it\"\n\nCappy","7":"\n\nWe left the huts mentioned above on the morning of August 31, and marched toward the ever shifting (now) front line. One time the \"Front Line\" meant an elaborate system of drained ? revetted and duckboarded trenches with\n\nshelters - called by courtesy, Dugouts - but now it is a very \"sparsely populated\" line of soldiers crouching in any cutting, declivity hole or trench that offers itself, soldiers who just wait long enough to draw breath and open a tin of Bully; and then move on; if so be it is their good fortune to be left whole. Halting for dinner near some eighteen pounder batteries, we stayed there for an hour and then continued our journey á Berlin\n\nFritz put up a terrific \nbarrage\n bombardment on the road up and it is marvellous how so many of us escaped death. If ever this is read it will doubtless occur to the reader that I have too often reiterated this statement. But every day that one lives in this shell swept area, is to me and must be, I think, to any who seriously reflect - at once a bewilderment, a marvel and a miracle.\n\nAbout 3 in the afternoon we halted beside the Somme in a railway cutting\n\nand there for eight hours, we were subjected to a most merciless bombardment and during the whole of the hours of daylight, platoon after platoon , company after company, battalion after battalion, hove into sight across the stream, sauntered placidly and slowly - or was it wearily and apathetically? - along the shell torn road, crossed the crude narrow, shell-torn little bridge across the Somme and nestled close as they could under those almost perpendicular heights of this region there to wait till the friendly but dreadful darkness made it possible to struggle further on.\n\nI shall never forget the heroism of a few engineers who, amid a tornado of shells, kept repairing this little bridge across the river. Shell after shell burst alongside them with a deafening roar and splashed the water mountain high, yet they went on with their work unperturbed and unhurried as though they were working in the peaceful solitudes of their own Australian\n\nbushland; and they never desisted while the daylight was good. They seemed to bear charmed lives until the dusk fell and their work was done - With the waning of the day, the troops who were to participate in tomorrow’s orgie were disposed in the cracks and crevices on the right side of the Somme, and the little bridge with the help of the dauntless engineers had served its immediate purpose; and the former was awaiting demolition by a well directed shell; and the latter were busily engaged in preparing their scanty supper.\n\nSome were attending a fire which had been alighted under the foot of the cutting - rather a dangerous precedent considering our proximity to the line and the activity of Fritz's planes. - some were sitting round and smoking and others shopping. Nearly all were singing snatches of the latest songs; (it is marvellous how quickly choruses find their way from the London theatres to the Front) \n\nFritz had\n\nshortened his range and his shells were bursting just on the edge of the bank. Somehow I sensed an impending catastrophe. Those most concerned didn’t. or, sensing it took no notice. A vivid flash of light, a more angry crash than usual and Death had descended and hurled those gallant souls into eternity.\n\nBut why particularise when Death is here, Death is there Death is busy everywhere\n\nWe remained crouching under the bank till nearly midnight and then moved on to a similar cutting a little further on where we stayed till just on day break. Then we went into the Front Line trench.\n\nJust as the sun was rising the","8":" Brigade emerged from the bush to the rear and filed into the trench. The Germans evidently saw them coming and presaged trouble - how could they help doing either? - for they immediately laid down an intense barrage on top \n\nof us. I think our boys must have been a little late for they hadn’t a minute to rest before \"hopping over\". It was like saying Goodbye to Life to put ones head above ground level but I only saw one poor lad hesitate. I don’t think I shall ever forget the signs of struggle on his young but haggard and horrified face - during that brief moment of indecision. By a supreme effort he mastered his faculties and caught up with the rest. Within two minutes the poor lad was carried back on a stretcher.\n\nWithin the first hundred yards from our parapet the casualties among our men were very numerous, and for the next hour it was hell for us, for our comrades and - for fritz especially for Fritz who lost more, in prisoners alone, than the total number of those who were attacking. We stayed in the trench till nearly dinner time and then moved along to the left behind a tree clothed hill \n","9":" St Quentin.\n\nAlong the trench were many gruesome evidences of the ordeal of the morning; among which was the almost unrecognisable mangled remains of sergeant Teagul, a fine young fellow who gave me my first instruction in Squad drill at Cootamundra, who was with me on the voyage over, during those arduous, heartbreaking months at Lark Hill and almost ever since - and now\n\n Well! \"We are called we must go \n\n Laid low, very low in the ground we must lie\n\n Nine times goes the passing bell \n\n Ye merry souls Farewell …\"\n\nAbout one o’clock we attacked this stronghold - a mere handful of men without any support whatever. The summit of the hill was very heavily wooded and on the extreme left (as we afterwards discovered) was a very deep steep crater in which there were numerous machine guns (63 I have heard was the exact number) and so the task before us was not an easy one. The passage\n\nthrough the wood, by reason of the havoc wrought by the artillery was slow and irksome, but we were sheltered from direct observation, and, considering all things, got through without much trouble. Whether by design or accident the enemy let us get through the wood without any opposition except the intermittent dropping of a few \"Plonkers\"\n\nThe moment we emerged, however, he opened up on us from both front and rear. For either our progress had been more rapid than that of C Company (on our left) or we had missed a gun or two; also a couple of snipers who had positions in the tree tops, fired on us with deadly effect.\n\nWe got cover from the machine guns on the main Peronne road and this was the signal as if it had been preconcerted - for him to pepper us with high explosive. While crouching here a young chap named Macintosh was shot dead alongside me This\n\nimpressed me because out of the three of the names that I knew over here, two were killed at my side. We crouched like rabbits in a shallow trench, and he merely proceeded to blow us out by concentrating a couple of batteries of 6 in. guns on the spot.\n\nTo raise our heads an inch or two was to have our heads ventilated; to stay was to be blown to hades; to go forward was to step off the earth.\n\nOur O.C. once told us in Lark Hill that when we reached the front there would be times when\n\n\"If we go forwards we die\n\nIf we go backwards we die\n","10":" better go forward and die\n\nThan backward and die\"\n\nI had been in the position more than once since but never had it seemed so absolutely certain the only possibilities of the situation as now. And so we chose \"The better part\"\n\nto die going forward - and made a rush across the road. Not the one we had crossed before but the one that runs down towards that formidable looking old Farm house, at right angles to the Peronne road. Of course Fritz had his guns trained on the spot; and playfully sent his missiles careering across the path. Some got fairly started and the game was finished for them; some got half way across; some almost into the old trench opposite when they, too, had to stop I was one of the number who got through and below ground level in the old chalk trench. Strange too, as I was hampered by my Lewis Gun and a poor chap who had got his issue at the entrance of the trench and was painfully dragging himself to such shelter as it afforded. \n\nWe had gained our object but would any live to tell the tale, Fritz had us \"logged\" and sent over such a local\n\nbarrage of heavies as I have seen only twice in the war. And for almost 3 days he continued to pound away merrily at us, as if he were enjoying it, I don’t think the most sanguine of us expected to get out without some mishap, but again the unexpected happened. Indeed our casualties though heavy, were remarkably light when the circumstances are considered. How Human Nature can stand such a strain as was imposed upon it during those few days is altogether incomprehensible, for Hell itself could not be like that! I never prayed before as I prayed during those awful days; and never so thankful to my God as I was (and am) for his wonderful care and protection.\n\nI cannot think it is just \"Luck\" that has kept me safe and shifted me hither and thither in the right way to the right place at the right time. \n\nWas there not more than \"Luck\" in this -\n\nAfter making the old trench above mentioned, our officer directed me to take up a certain position and mount the L.G. I worked with my entrenching tool for an hour or so and was just getting a decent bit of cover and a place for the gun when a Vicars' Gun officer came and ousted me to set up his gun. I moved along to the left saying sugary somethings about the lordly machine-gun officers under my breath - and commenced to burrow in again, After the same expenditure of energy resulting in the same progress I had to shift to give place to another Vicars gun crew. I went further along the trench to a place where it wasn’t a trench at all and waited (without digging this time) for a shell to send me in some other direction.\n\nWell, during the night not a shell came within a dozen yards, and in the morning out of the two guns, there remained two whole men and some fragments of steel.\n\nOn Wednesday evening we were relieved and by 10.30 P.M. had put some 16 Kilos between ourselves and Fritz.\n\nSince then we have had an easy time although overshadowed by the probability of having soon to go back and face again what we have just left. We are on the bank of the canal in the old dismantled village of Cappy three and a half kilos from Bray. Roy and Brice Farmer are just across the stream and I have seen them on a couple of occasions.\n\n\"Scotty\" Salmon and I have an old room - without walls of course - to ourselves and afford even the luxury of a bed, which we salvaged among the debris. Church parade this morning - nothing since.\n\nCappy Sept 23,1918\n\nSince writing last nothing of importance has happened . We are still in the same place, doing the same things i.e. a little drill and a few games each day and plenty of sleep\n\neach night.\n\nNot far from here is a 15\" gun captured by the first Brigade toward the end of August. I have been over to see it a couple of times and I think it is one of the most wonderful bits of machinery I have ever see. The barrel is about 45 feet long; measures 7 feet in circumference at the muzzle , and 15feet at the breech. It has been used - four shells are supposed to have been fired from it, most likely upon Amiens, which is distant about 30 kilos - for the trees \"toward\" the front are blackened and withered and blasted. It is thought that it was blown up by the bursting of a shell in the barrel (a \"premature burst\") although it is not known definitely. Whatever the cause the explosion must have been terrific; for solid pieces of steel, weighing almost a ton each, are lying about the site: and I saw a piece weighing fully 6 cwt. Lying 800 yards\n\naway. The thickness of the steel at the breech is 13 inches, and this has been shattered into great jagged splinters that now hang down and testify to the power of the Bosche H.E. The circular platform on which the gun revolves is fully 20 yards in diameter, And the monster was doubtless put there for the purpose of hurling shells, a ton weight, amongst the unsuspecting residents of Amiens.\n\nMany a stroll I have had across these quondam - lovely fields of Picardy, and marvelled at the profusion of cornflowers and poppies that almost hide the ugly shell holes and uglier trenches and I wonder if those really responsible for the war, \"could have dipt into the future\" and seen the result to this rich and lovely land, would they have been demonic enough to have launched it on the world. Surely none but the archfiend himself could have been so utterly insensitive.\n\nWe have had a very nice, quiet time\n\nhere and I am sorry the time has come - or will come, in a day or two - for departure. We have had church parade and Padre Buckley spoke very earnestly and very interestingly about writing home regularly. I have always done so when circumstances permitted for I know how the home folks treasure every scrap of intelligence they receive from us. He drew a vivid picture of an anxious mother waiting and watching for the letter that never came.- Again he’s gone - O God! no look no sign -The cruel postman’s past my gate again.\n\nMy son! My son! No letter not one line.\n\nFor hours I’ve stood here in the wind and rain\n\nAnd watched the busy traffic thread the street\n\nOr saw, at times, a yellow Winter’s leaf\n\nAs down it whirled and rested at my feet,\n\nLike some dead hope, that masks a living grief.\n\n These things I saw - yet as from far off lands\n\n One form alone was plain to these old eyes;\n\nAnd it was marked as suppliant marks the hands\n\nThat heart’s desire gives or else denies. \n\nI saw him turn the corner and stroll on\n\nUnconscious of the precious freight he bore.\n\nHe slowly oped a gate and crossed the lawn,\n\nAnd, standing framed within a neighbour’s door \n\nBlew that shrill note that music makes to ears\n\nOf mother, sister, sweetheart, daughter, wife;\n\nMakes hearts to leap for joy, and calms the fears\n\nFor him so far away in that red strife.\n\n He gave the boon to trembling hands, and turned\n\nAnd Fancy saw \"He’s coming to your gate.\n\nBehold that well loved scrawl of his\". I yearned\n\nTo grasp my prize; but something bade me wait,\n\nAnd now he’s gone, and my old eyes are dim.\n\nA blackness surges oer me like a sea.\n\nAll hope is gone, Forgotten! and by him.\n\nWhose love was all that life held dear to me.\n\nWeek after week Ive striven to trace my heart\n\nIn ill - formed characters, with time - tired hands,\n\nAnd tear dimmed eyes; and heeded not the smart.\n\nFor what do these things count when love commands.\n\nDay after day for hours and hours I’ve stood.\n\nAnd waited - all in vain - some word from thee.\n\nIf you but knew the love of motherhood.\n\nMy son! for shame you could not silent be.\n\nI gave thee life! it was my hand that lead\n\nFrom helplessness to strength, my heart that yearned\n\nWhen sorrow came your way; when tears were shed.\n\nI gave thee love and love is not returned.\n\nHadst thou remembered, Son, I could have borne\n\nThe utter weariness for Loves dear sake - \n\nThou Lov’st me not - and now all joy is gone\n\nMy heart is chilled - O God, that it would break.\n\nMy letters are not coming as regularly as I could wish and the fact seems to make this hard life, harder. Of course we have to make innumerable allowances for \"lost in transit\" and yet we cant help wondering, and putting the worst construction on it when they do not turn up.\n\nI crouch low in the cold muddy trenches\n\nAs the bullets go whistling by; \n\nAnd the shells go shrieking and screaming \n\nAnd the flashes are brightening the sky. \n\nThe thunders on thunders go rolling\n\nAs the Titans their awful bolts hurl. \n\nBut I’m wondering, and wondering and wondering \n\nwhy no letter comes out from the girl.\n\n Now the daylight the darkness is hustling \n\nAnd the flashes grow dim in the dawn,\n\nThe night of our waiting is over, \n\nAnd the moment of Zero rolls on\n\nThe world seems to crumble beneath us\n\nOut there in the Devil’s mad whirl\n\nYet vaguely and dimly I’m wondering \n\nWhy no letter comes out from the girl.\n\nWe are out of the trench in the open \n\nNow each moment is surely our last\n\nThick as hailstones in hailstorms of summer\n\nThe bullets are scurrying past.\n\nMy comrades are failing and falling, \n\nThey die where the blue vapours curl.\n\nAnd their eyes seem to ask as they’re glazing \n\nWhy no letter comes out from the Girl,\n\nI’m not such a fool as to fancy\n\nThat the sunrise will find me alive\n\nFor here in this Hellish tornado\n\nScarce an insect can hope to survive\n\nBut I’d leave the old world more contented\n\nAnd Death wouldn’t seem such a churl\n\nIf the morning had brought me a message\n\nIf a letter had come from the girl.\n\nNow there comes a brief lull in the conflict\n\nAll around me lie comrades and foe\n\nBut though, Oh! so weary Im scatheless\n\nNow only High Heaven doth know, \n\nStill my thoughts turn away from the carnage\n\nTo the land where the burns splash and furl\n\nAnd my heart keeps on asking the question\n\nWhy no letter comes out from the girl\n\nRoisel.Sept 30, 1918\n\nFour weeks ago, almost to the hour we were up at Mont St Quentin face to face with death and now we are hurrying up, as fast as we can to tempt Azrael again. Mt. St Quentin is now a long way behind us and still we are not in the Front Line - will be in a day or two though. We left Cappy on Friday at 7 P.M. and, marching through the warm rainy night, reached Peronne after midnight. We camped in some old trench shelters just outside the township during the day, and last evening (again at about 7) we set out on another long march,\n\nalong an unknown, rough, and boggy road; and reached here at midnight. We are just now awaiting orders to move forward and have another tilt with Death.\n\nThings seem to be going very well for the allies at present, and we are making rapid progress all along the line. Word has just come through to the effect that Bulgaria has sued for peace. God grant, that Germany too may do so within a few days.\n\nDick More, - Theo Starr and I are in possession of an old cellar somewhere down in the bowels of the earth under Roisel or the debris that once formed Roisel. -\n\nIt is a cold enough camp \"but awfully select you know\", and fairly dry - in fact everything that can be desired. Except when our monster gun which is situated a couple of miles behind us vomits forth its ton of metal and sets everything aquaking and ashaking.\n\nOld Dick is the gloomiest of the trio\n\nand is rather resentful at having to go forward again when it certainly is his due to remain out in the \"Details\" Some fellows seem to slip automatically into this company of men every time there is any \"stoush\" to be done; while others go into the line time after time and can hope for no respite unless Fritz is kind enough to give them a \"Blighty\".\n\nAnd it isn’t as if it meant nothing more than the difference between a few days of privation and nights of waking on the one hand; and a little drill back at some reinforcement wing, on the other. We know that when go into an affair of this sort that, at the very least , one of three must \"Go West;\" while those who are drafted into the Nucleus\" are sent into comparative safety. Last time I wrote (at Cappy) I mentioned that the first had gone forth that we were to strike the old Black and Red, and lose our identity as a Battalion and I didn’t know how much attached\n\nto the Battalion I was until ordered to report to another. I am glad to be able to say now, that, for the present at least, we are to remain the","11":" Batt. For one day we were officially in the","12":" but on that day we were all absentees. When it came to the official handing over and the relinquishing of his command over the Battalion which he had lead and worked for almost since its inception, our grand old Colonel(Duggin) broke up completely and had to leave the heart breaking business to Major Reid. So when we should have reported to our respective new O.C.s we refused to be disbanded; and remained and drilled under our sergeant Majors as a protest against the business. In military parlance - I suppose we were mutineers, but it seemed a little \"over the odds\" to keep us pegging away until we were nearly all killed, and then to join forces so that we could go in and get finished off. If we must\n\nbe wiped out completely it is not too much to ask that we go under as the batt. we have been in all through the \"play\". We were told that no amount of objecting could alter the decision of the Authorities but at any rate it gained us a little time; and many a fine chap will have paid the final toll before we get out of the line again.\n\nInstead of Battalions coalescing as required we still have the four Battalions to the Brigade, but in each there are three companies instead of four.\n\nTirancourt.","13":"\n\nStaying two nights at Roisel we left in the morning of the first, and, marching about 8 kilos took up a position in what had been the front line trench a couple of day before. From it the yanks had \"Hopped off;\" no doubt as the dawn was breaking, and they left a mournful testimony to the past on the slope\n\nin front of the trench. What a lot of suns set here as the Great God of Day, shed his first rosy beams across the field of carnage!\n\nThe poor mutilated, or simply transfixed bodies lay littered around all over the ground, notwithstanding the fact that the burial party had since been very busy. But the survivors had stormed what was possibly the most impregnable part of the Hindenberg Line and won through in the face of almost insurmountable difficulties, where perhaps more seasoned troops, better realising the nature of the obstacles would not have accomplished so much.\n\nRumour has it that most of the casualties were inflicted by our own artillery owing to the Yanks being too anxious and getting ahead of our barrage. But this is evident If the Germans had had \"any stomach for the fight\" and adequate artillery support not an American could have crossed the canal and threaded that\n\nmaze of barbed wire.\n\nWe spent the day there and in our wanderings came across a peculiar thing. At the entrance of the tunnel (constructed by Napoleon over a hundred years ago) through which runs a canal connecting the Somme with the Escaut is a concrete chamber a vile, foul, dungeon like place that conjures up visions of the Inquisition Days and gives one the Horrors as he enters it.\n\nGroping our way up the dismal spiral staircase by the uncertain light of a candle we entered the chamber and this is the spectacle that greeted our horrified gazes. A pile of German dead on the floor all in the first stage of decay, an old bucket half full of fat; three coppers, all of which contained water and in one of which - most revolting of all - was the mangled remains of the body of a German just as if it were jammed there for the awful stew.\n\nI had heard much concerning the alleged German practice of boiling down their dead for\n\nfat; but had always disbelieved it, thinking it too inhuman and satanic to be permitted by a civilised people, no matter how dire the necessity. But here at last was the most damning and irrefutable evidence. I hated to believe it and yet there was no alternative.\n\nAnd then we saw a round hole drilled through the concrete; and noticed that the corner of the copper had been blown away. Then we knew - though some seemed loathe to believe it, that a shell or a bomb had entered the compartment hurling one man into the copper and all into Eternity. Possibly they were engaged in bathing or cooking at the time, and no doubt felt quite secure - behind their concrete protection poor wretches.\n\nThat evening we left the trench and marched up to the next village - Nauroy. Just behind it in another trench we stayed for the night. On the following day we made some cover for ourselves with material gleaned from the debris of the town, and slept fairly comfortably during the\n\nensuing night. Next afternoon we marched a mile or so farther on. The road wound round the foot of the hill in full view of the enemy and along it lorries and ASC wagons and limbers were stringing as Fritzy merrily pounded them with 20 shells a minute, There was a hundred yards or so where the road was not sunken and on this spot the cunning gunners concentrated their attention And with almost human sagacity the horses and Donks sensed the danger and galloped for dear life across the valley. The stream of traffic on the road diverted the enemy’s attention from our shrunken company and so we did not get our just proportion of shells.\n\nWhen we had taken up our position in the old system of trenches, however we could not complain of any shortage in this respect. \n\nWhen night fell we went into supports near Rameka ? and stayed there until 2 AM on the","14":" We then set out to \"line the tape\" in\n\n\"Noman's Land\"\n\nThree tanks were coming up to assist in the attack and they were moving up at the same time as us. The sound of their engines as they waddled over the roadless, uprooted land, could be heard quite plainly in the clear frosty air - for the rain had gone - and our 18 pounders were barking out gamely in a vain endeavour to cover their noisy advance.\n\nPoor old Fritz heard them coming, too, for he sent in his heavies in quick succession, and so added to the unpleasantness of our nocturnal wanderings. \n\nWell, we all got within a hundred yards of the tape before he secured a hit. Then a salvo of 5.9's came over and one landed right amongst our column. I don’t know how many were rendered \"hors de combat\" by that burst, for we could not stop to see but I know they were lying round and groaning when I passed by.\n\nWhen we had at last taken our position on the tape there was still a few minutes' space to wait for the opening of our artillery\n\nbarrage. - a few minutes to dream of days gone by; and friends and dear ones far away; to say Goodbye to everything and prepare ourselves for the end; for he is an optimist indeed who crosses that narrow white line in the expectation of ever returning.\n\nFritz was still pounding away persistently and doing his best to interrupt our reflections, when a terrific roar which made the hills rock and reverberate, told us that the game was afoot, and we at once began to advance. All frailties, failings fears, and, feelings were left behind when we stepped across the tape, and we now went forward more like marionettes than men, quite oblivious to all externalities.\n\nIf a shell burst 100 yards from us as we were coming up, there would be an irresistible desire to \"duck\", and a shudder of dread would run down our backs; but now they were bursting within 5 yards and exciting no emotion. Sometimes we would see a gap made in our ranks; sometimes a comrade alongside would fall. perhaps to lie there, or perhaps\n\nto arise immediately and make to the rear, with a swinging arm, a limping leg or a bleeding face; but these things had nothing to do with us and left us quite unaffected.\n\nAll we had to do was to walk leisurely, mechanically, forward, with the creeping barrage - and forward we went.\n\nWe had gone about 3 hundred yards from the \"Hopping off Tape\" before our little party paid mortal toll to the enemy, though shells seemed to fall on every inch that held no man.\n\nJust then our officer (Mr. Stan Bennie) who had used his own bandage on my head when I received my issue in April) came over to Dick More and me; and for a moment I stood between the two in that scene of utter confusion; unconscious of any extraordinary emotion; and feeling in no sense out of my natural environment and remarking casually on the intensity and effect of our barrage ,- and waiting for it to lift. \n\nA couple of hundred yards from us, across\n\nthe valley a score of Germans were scampering up the hill. \"Put a burst into them\" said Bennie - get down and take your time.\" So down I got and sent a shower of lead after the unfortunate wretches. Down they went as if blown over by a strong gust of wind. Simultaneously an enemy machines gun opened upon us from a chalk pit just in front. Almost with the first shot I saw old Bennie - put his hand to his breast turn away and lie gently on the ground! I turned my head silently toward Dick More; to see him grasp at his face, and knew that he had received a \"Blighty\" an \"Aussie\" or a France, for the whole of his cheek had been blown away by an explosive bullet.\n\nAs I dropped to his side he said calmly \"I think it’s all up with me now, don’t you\"? \"Not it\", I replied cheerfully though I was by no means sure that I was speaking the truth. \"Will you please try and put a \n\nbandage on me then!\" he asked. I wormed my way a few inches closer and did my best to staunch the flow of blood. One bandage was not sufficient to cover the gaping wound so I had to requisition another. It was a clumsy and tedious process as I couldn’t raise myself an inch without having my head riddled; but at length I came to the end. In trying to pin it I must have raised myself slightly, and of course Fritz had a pot shot at me.\n\nPoor old Dick's head just dropped from my arms, and at the same time a bullet, striking the rim of my steel hat grazed my forehead and went whistling after the others. It had passed through Dick's brain, somehow between my hands. Death was instantaneous, so being unable to do anything for him I at once rolled over to attend to Mr. Bennie.\n\nOne glance, however sufficed to show me that he was past human aid. His eyes were already glazing, and my question elicited no reply. All this time the bullets\n\nwere whistling and zip-zipping past and missing by inches - and why they \ndid\n miss I cannot understand.\n\nHowever the crew in the chalk-pit were now outflanked by some of our company and forced to surrender. They came running out, poor bedraggled, abject looking creatures, crying for mercy. Then, for the first time in the war, I thought I could shoot them without compunction for with my comrades life-blood warm on my hands, thoughts of mercy and rational judgment seemed out of place. Yet when I saw one of our number taking deliberate aim at a cringing captive I couldn’t resist the impulse to knock up the muzzle of his rifle and bid him be British. \n\nFor the next hour we pushed on in the face of a deluge of fire We soon lost connection with the rest of the company and didn’t know where they were but we still kept advancing until we reached out objective - just to the right of Mont Brehaine.\n\nWe topped the ridge and commenced dipping in\n\nunder heavy shell and machine gun fire. Just across the valley (about 400 yards away) we could see a battery of \"Whizbangs\" firing at us point blank. These played havoc amongst us and the company of pioneers on our right; and rendered our position untenable. We attemped to silence them with our Lewis Gun but we only succeeded in aggravating them and drawing upon ourselves a quicker rain of fire than ever. \n\nThat was the first time I have had artillery trained on me at such a close range and I hope it will be the last. It is bad enough to have machine gun bullets zipping past one but it is completely demoralising to have shells grazing your head and almost flattening you with concussion.\n\nThe hill must have been a little steeper than the trajectory of the shells; for if they missed the summit they would hurtle over us and reach the opposite slopes. A few of the pioneers fell into confusion and began to retire toward an old sunken road\n\nFritz followed them beautifully with his whizbangs and they halted irresolute for a moment. This gave him an admirable chance to drop one right in the midst of them; with the result that four of them were finished , for the time being, at least,\n\nThough we had our post well advanced it now became very apparent that we could no longer stay on the summit of the hill in full view of his gunners - who were screened by trees and bushes - so we retired about 20 yards and commenced digging in again. It was a trying experience to sit there - under his persistent fire essay to dig a hole large enough to afford cover with nothing but an entrenching tool - really only a play thing - but it was the only thing to be done when all who had been carrying shovels were dead or had lost these most valuable weapons of modern warfare. So we scratched and dug and grumbled until we had finally scooped out a bit of shelter.\n\nWith the exception of the Whizbang battery, we were not now getting many German shells and were looking forward to having a fairly \"peaceful\" day, when suddenly we began to be pounded with our own \"sixty pounders\" \n\nEvidently they thought we had not attained our objective, or that we had retired, or possibly we had gone a bit too far. \n\nAny road, almost all day we were harassed by the intermittent shelling by these guns; and being subjected to Fritz's usual issue, we began to have a feeling of pity for him, and to feel grateful that we were not in the ranks of the \"Kaiser’s conquering Army\"\n\nIt was altogether too bad, though, to have to crouch there all day and pose as targets for our own artillery as well as the German. \n\nTo accentuate our discomfiture we seemed to be completely isolated and could not make any connection with the remainder of the company. After awhile the gun crews who had so strenuously opposed our\n\noccupation of the crest, realising that we had come to stay, slunk off and left their guns much to our gratification.\n\nAnd later in the day someone \"came to light\" with a ground flare, and by seizing an opportune moment, we let our airmen know where we were soon afterwards the sixty pounders began to tear up the ground a quarter of a mile ahead.\n\nAll the afternoon we could see the German troops marching along the ridges obliquely to the left of Mont Brehain and it looked as if we were going to be outflanked and surrounded. Altogether it was a very disconcerting position to be in.\n\nN.C.O.’s and officers were gone and our remaining strength consisted of about a dozen infantry and a few pioneers. L\/Cpl. Starr had practically taken things in his own hands after Lieut. Bennie's death, and if any one deserved a decoration it was he, but of course he wont get it no officers round.\n\nSoon after reaching our objective he got\n\nsome shrap in the heel, and scott got winged, and so both set off with light hearts for \"Blighty\". One couldn’t help feeling a little resentful at Fritz's partiality. Especially as I, personally considered it equal chances that we would be making roads in the Vaterland in a day or two. I didn’t like that seemingly endless column of Germans marching through the afternoon, apparently unopposed, to our left rear . Still we hung on, for to retire at all was to leave the Village open to him. And we didn’t want that.\n\nWhen we had completed our trench or rather pit- and got rid of our own gun fire we spent the rest of the day in comparative comfort and security. Toward dusk, Germans who had been concealed here and there about the fields and the machine gun posts began to make covertly towards the German lines; and our fellows seemed to enjoy themselves pumping lead after (and into) them, but I took no part in this diversion.\n\nIn the evening (about 8 o'clock) we were relieved by the Yanks and returned to Nouroy where we spent the night in the same trench we had previously occupied on our lineward journey . Our numbers had sadly diminished so there was plenty of shelter - of a sort - for all.\n\nNext morning we left and marched back to Villerette and, resting there for the night; next morning proceeded to Roisel , where we entrained at about 11 o’clock.\n\nIn the evening we alighted at Amiens and straightway set out on a fourteen kilo march through a dreary drizzle to here (Tirancourt).\n\nTirancourt itself consists of a few houses and squalid back yards and foul smells, same as any other French village - just a blot on a beautiful landscape.\n\nBeyond Tirancourt about a Kilo is La Chaussee, and beyond La Chaussee across the canal that ubiquitous canal - is Picquigny, a much better style\n\nof a village. Here in the Tirancourt chateau our Battalion is billeted and, generally speaking, we have a real good time and pass the days something like civilised beings.\n\nI am in the kitchen with one companion (Jim Miller) and we live in luxury by spending our \"wages\" in Picquigny buying butter (at 6 francs a pound) bread, tomatoes condensed milk etc.\n\nThe mornings we spend on the Parade ground executing all sorts of manoeuvres and contortions; and in the afternoons we are expected to attend a football match, \"sports\" or some other such thing. Hower those who wish can easily dodge them without entailing any disagreeable consequences; so it is very rarely that I am to be seen outside my kitchen, where we usually have a nice fire blazing, during the afternoon or evening. We have been here four weeks now and for war time I have been very happy indeed.\n\nThe good news in the papers regarding the rapid retreat of the enemy (truly a splendid\n\nperformance) and the no less rapid advance of the Allies; and the immediate prospect of peace, have no doubt contributed largely to this state of mind. We have a large War map down in the old shelter that we call the cook house; and every morning it is the centre of more - interested diggers that the proverbial dixie of stew. I do not know whether it is more edifying or confusing to hear \"our clever ones\" work out the exact time of Fritz's expulsion from France and Belglium, basing their calculations on the distance advanced the last 24 hours. These calculations are very much at variance but are all (of course) absolutely irrefutable.\n\nMy greatest worry these days is over my letters, which do not seem to be arriving with wonted regularity or frequency.\n\nToday’s paper contained specially good news; to wit that delegates from Berlin had approached Marshall Foch\n\nto demand an armistice. What if it should really mean Peace in a few days! Wouldn’t it be just the most glorious event in the worlds history!.\n\nI have been instructing a Lewis Gun class this week, going over and over the same old rigmarole that was new 18 months ago. Well it is certainly as easy a job as ever anyone earned six bob a day at - for we simply sit about and play with the gun for about 2½ hours in the forenoon and are exempt from all other duties. All the afternoon we have to ourselves to do whatsoever seemeth us good. I hope it may last as long as the war which should not be long now.\n","15":"\n\nToday was even wetter than the previous days of this week.\n\nAt last there can be no doubt that winter is here. The trees which a week ago were resplendent with a wealth of brown and yellow foliage are now but a wilderness of dried sticks; mud is\n\nknee-deep everywhere and the sun seems to have deserted us altogether. \n\nStill all this is of little moment if war will only end; and the end seems to be approaching very close. Last night the rumour was circulated that the armistice had been signed and that hostilities were to cease from 12 o’clock today.\n\nI was waiting down the road for the paper today an hour before it was due, that I might be one of the first to read the joyful news for myself. However no such thing had happened - yet. Perhaps tomorrow we will know exactly how the situation stands; Last night I went to a concert which proved to be one of the best I have attended over this side. We came home and boiled our dixies and after having \"café au lait\" went to bed. But my sleep during the night was disturbed by the clanging at quarter hours intervals of \n\nan old bell across the way, ringing as I suppose to celebrate the cessation of hostilities - May it clang again tonight, and with better cause.\n\nThis afternoon the brigade sports were held down at St Vast, a village about 4 kilos from here, but I didn’t go. Am not feeling very well tonight so am going to bed at once.\n","16":"\n\nYesterday we had a church parade in the YMCA at La Chaussee, conducted by a strange Padre - in both senses - who talked about baptism and communion And the Saints; and marked out a very hard and narrow path for all and sundry, and condemned all who did not travel it in his style, to everlasting fire.\n\nThe afternoon I spent sitting at the fire in out chateau kitchen and in the evening went for a walk across the hills. \n\nThis morning at 11 word came through from headquarters to the effect that the\n\nArmistice had been signed by the German delegates; and that hostilities were to cease as from that hour. \n\nAt the time I was instructing a class on the Lewis Gun. But as soon as the news was read they, with one accord, said they would do no more work, and went out to kick the football. It is truly remarkable how little demonstration was made by the boys on the reception of this, the intelligence for which they had longed, hoped, prayed and suffered for years. 'One would naturally expect them to go into ecstacies of delight and to make a great hubbub, but nothing of the kind happened.\n\nIn the evening my \"fellow lodger\" and I took a stroll up to Picquigny to see what celebrations were in progress there - But there, as here things were little more than normal. Now and then we met little groups of soldiers and would be greeted with a feeble \"hurrah\"; across the principal streets the tricolour was suspended and candles burned in the top story windows fantastically shaded by coloured paper.\n\nBefore the door of the chief Estaminet a number of French children had congregated and were amusing themselves by sending up Verey lights, and letting off crackers. Perhaps, too, a few in khaki who would otherwise only have been exhilarated had over stepped the mark and were completely intoxicated.\n\nTwo Frenchmen were roaming the street and filling the air with the bellicose strains of the La Marsellaise in such a manner as would justify the hearer in thinking that the previous occasion on which they had sung it was at Waterloo or Sedan.\n\nThese were the only abnormalities! Why is it? Is it that we don’t yet realise what the whole thing signifies? Or is it that the vicissitudes through which we have passed have eradicated all emotionalism form our composition and taught us to accept victories, and reverses alike, mechanically & stoically?\n","17":"\n\nToday has brought the confirmation of the glorious news of the signing of the armistice. The full account of the terms appeared in The Daily Mail and I don’t think there could ever have been more victorious terms dictated by a conqueror; or more humiliating terms accepted by the vanquished.\n\nYesterday I should not have been more surprised at a resumption of the fighting but in view of today’s publication such a thing is almost inconceivable. I think that within a week or so I shall be \"Somewhere in Germany\"; but it will only be to garrison a German town; not to make roads and munitions, as I anticipated last time in the line. Well, if we go I hope there is no trouble for, sure as can be, if a pop-gun only goes off by accident now, one will be skittled.\n\nThis morning we had a lecture on the Educational scheme, to be put in operation during the period of demobilisation; while the troops are in concentration camps \n\neither in France, England or Egypt. I am afraid it is going to be a long long time yet before we step off the boat at the Dear Old Quay at Sydney; but a few months more or less will not matter much now that the Hell is over. I only hope that we go, in the meantime, to England. I have had enough of France - for the time being, and I don’t welcome the prospect of a sojourn in Egypt. But I suppose I shall have to take what is coming to me and to go where I am sent.\n\nThere are some incredibly despicable cads amongst us here. Men who for the price of a Vin Blanc do not hesitate to commit outrage, robbery and even murder. One cannot walk along the canal after sundown without being in peril of being knocked on the head by these human wolves. A couple of nights ago a French civilian was thrown into the canal after having been murdered.\n","18":" we have just had a round up and made a thorough scanning of the countryside with\n\nresult that a few of these renegades were \"gathered in\" A soldier, who, for paltry gain would stoop to injure or rob a comrade can only be a person of the most depraved type and deserves no quarter.\n\nParis, Friday, Nov. 22.1918\n\nI arrived here about 4.30 on Tuesday evening. After walking from Tirancourt to Amiens I took the 2.30 train and had a really \"packed\" passage (but in a first class carriage) to the great City Metrop. I was almost stony broke when I reached the Gare Du Nord, having only 5 francs in my possession. It was just on dark as we left the station; and I was anxiously wondering how I was going to manage about my bed and breakfast; when some of Miss Rouls' agents came up and conducted me (and others) to the New Hotel. We were taken upstairs to a room full of soldiers and equipment; and in a few minutes Miss Roule herself appeared. I must confess I was not a \n\nlittle surprised to be the recipient of a motherly kiss from the bustling and unconventional little New Zealand lady; but it nevertheless made me feel that I was not quite a stranger in a strange city. She divined my needs (doubtless she thought that Aussies were all, always broke) and loaned me ten francs, which were to be repaid at my own convenience - So I took a room on the fourth floor and passed my first night in Paris in peace and quietness.\n\nNext morning I found my way to the Casserne Pepinniere and reported to the authorities there. I then proceeded to the hotel Windsor in the Rue Petrograd and drew my allowance (100 francs) \n\nAfter dinner (which I had at the Canadian Y.M.C.A. at Pepinniere) I and two other Australian soldiers went exploring. We walked along the Avenue Friedmann to the Arc De Triomphe which stands at the junction of 11 streets\n\ncalled the Etroit. From there we sauntered down the Champs Elyseés crossed the Pont Alexander III. Visited the Hotel Aux Invalides and saw Napoleon’s coffin, shrine and tomb. The shrine with its never-changing, never-waning golden light, and the tomb with its unvarying sombre grey are about the most beautiful and impressive things ever I have seen.\n\nIt is only here that one adequately realises all that Napoleon is to Frenchmen. He is more than an Emperor; more than a King. He is a demi-god. On his shrine, as nearly as I can remember, is this inscription which, as the very last wish of the exiled Emperor, indicates that the love which the French people bestowed upon him was fully reciprocated.\n\n\"Je desire que mes cendres reposent au bord de La Seine dans le millieu au ce people qui j'ai tant aimé.\"\n\nAfter leaving the Hotel Aux Invalides we walked to the Eiffel Tower (but were\n\nnot allowed to ascend) and back to Pepinniere by way of the Trocadero and the Etoile.\n\nNext day we visited the Opera and La Madelaine; and found Rue Edourd VII\n\n(YMCA information Bureau) and booked for the Theatre party that night. Then we went to the Place Vendome and found the British Post Office. There I met an Australian lady who had been married by the Rev. Frewin at Kempsey; and who was a particular friend of the Jobson family. After dinner we visited the Beatac Virgini wandered out to La Place Concorde, in the Champs Elysees, the finest thoroughfare in the world.\n\nThere stands the obelisk and a great number of glorious statues; and there too, is a stupendous collection of guns and other trophies of war. We walked on into the Tuilleries gardens and after listening for awhile to the band, strolled down to the Louvre. There we met an Englishman who \"gave us the whole history of the outfit. After tea we walked to the \n\nHotel Windsor, had dinner and walked round to the Theatre Albert Premier, where we saw staged the play \"The Man who stayed at home. From there I walked home; reaching my hotel about midnight - was lost for about an hour. Next day was spent \"footing it \"and tubing it\" all over the city and on Friday joined the YMCA party for Versailles.\n\nI shall never forget that trip though I shall never be able to convey any idea of the splendour and magnificence of the palace. We saw the famous ante chamber and rooms of Louis 14; the Guard Room; the Salle de Glace, and Salle Des Batailles; the Salle de La Paip and Salle De La Guerre; the Salle De Printemps; the Ball room the chapel and the Chambre Des Deputés.\n\nAfterwards we roamed through the gardens, which unfortunately are not looking their best just now. Many of the most valuable bronze statues are hidden by concrete coverings and the fountains are not playing. Still from what they are today we can realise the transcendent beauty and splendour of what they are in the Spring and Summer - of Peace. The\n\nlecturer told us that the Palace and Gardens cost 128 million pounds, and I can easily believe it. On Saturday and Sunday we continued our exploration of the city and on the latter day had a ride on the Big Wheel - the World’s biggest. This gigantic structure stands not far from the Tour Eiffel; and is well patronised by the youths of Paris. It measures 100 metres in diameter and the trip round occupies approximately 30 minutes. After this elevated trip we attended a French concert in the grounds. In the evening I went to the British Embassy church and heard the Bishop of London preach. After that I sauntered along to the Rue Lafayette near the Gare St Lazarre and stood looking at the glare of a cinema house. A girl came up and enquired in broken English if I would not go inside. So I did. It was late when we got out, and my companion missed the last tube home - on purpose, as\n\nI discovered later. This necessitated my accompanying her to the Place De La Bastille, and resulted in my reaching the New Hotel after the doors had secured for the night. It was St Catherines Eve and all the unmarried eligibles were roaming the streets with all their regalia on; and dancing and music and singing were in progress at every street corner; So I stood a not uninterested spectator for the remainder of the night . The cafes opened at 4. A.M. I had some coffee and bought the American daily paper and went up to bed at about 6.30 AM. That is the first night ever I spent parading the streets.\n\nFor the rest of my stay I had the wee mademoiselle to show me round and explain what we saw.\n\nOn Monday night we went to a music hall at the 'Place De La Bastille. On Tuesday we visited the Hotel De Ville; the church St Gervaise where the German\n\nshell did such awful work on Good Friday; and the Notre Dame Cathedrale.\n\nIn the evening I attended the Gaumont Palace - a cinema show.\n\nOn Wednesday we found our way to the Pantheon and in the evening went to a variety entertainment - a really marvellous Programme - at the Place De La Republic. Other places of interest visited during my brief sojourn were St Genevieve, St Pauls; St Augustus. Holy Trinité and Sacre Coeur. The last named is, I think of all the places I have visited the most beautiful and distinctive. It is situated on the top of a hill (Mont Marte) and is just as one would expect to find - some of the oriental edifices with their domes and minarets glistening in the sun. Some service was in progress when we entered and the sombre aisles were lighted by thousands of candles; for nearly every one who entered would bring one or more candles, and having lighted it, or them, place on the altar of their patron\n\nsaint. This gave I know not what of glamour and enchantment to the scene.\n\nOn Thursday I did little but go out to the Champs Elysees and stand in the rain at the Place De La Concorde to view King George’s Procession. With Wednesday ended my stay in Paris for on Friday morning at 8.30 I was heading for my Battalion.\n\nI reached Amiens at 11.30 and visited some of the old Familiar Places; and left again at 3 in the afternoon, on a Leave Train. For during my absence the Batt. had received marching orders and were well on the way to Germany.\n\nAt 4.30 on the morning of Saturday we alighted at Busigny. Nobody seemed to want us now; and nobody seemed to care where we were or to know where - our Battaliion was. We had no rations and there didn’t seem to be any prospect of buying or begging any in that inhospitable region. I felt very gloomy and devoutly wished myself back in the Boulevard Voltaire, and would very much have appreciated a \n\nbuttered roll or a cup of chocolate; But I know there was a more depressed and pessimistic soul than I there, for one poor chap, after trying to hunt up some breakfast solved the problem for himself by putting a bullet through his head. \n\nHaving received some very hazy information that our div. wing was farther ahead we set out along the railway, marching through Honesche to St Souplet, where we put in a day and night of starvation.\n\nThe railway lines were all out of repair and bridges all blown up so transport difficulties were considerably enhanced. The wonder is that we were able to get anything to eat at all.\n\nOn Sunday morning I met Snooks again but didn’t have much to say to him; as we were just about to move further ahead in search of our Divisional Wing - where we had stayed was really the","19":" Div. Wing but all divisions passed through here and \"batted\" some biscuits and Bully\n\nto carry them further on. Small wonder that these commodities became scarce. The Q.M.’s must have had a task similar to feeding the multitude on the loaves and fishes.\n\nWe marched all day, passing the villages and towns of B? Abre De Guise, Le Catalet, La Croise and Favril. and arriving at dusk at Prisches, a pretty considerable town. Here we found the Divisional Wing, had a good \"fill up\" of stew and an issue of a couple of blankets. Needless to say we slept soundly on the old hay loft that night.\n\nEarly next morning (Monday) we were again on the road this time with definite questions for finding our battalion. We had an eleven kilo march in front of us and had to pass Prisches and Cartigny on route. By 12.30 we had anchored here in Boulogne Du Nord. I really do not think the authorities would have made any fuss if I had taken a month’s \n\nextended leave.\n\nThis is a miserable, squalid hamlet far from civilisation. There are a few civilians remaining but they are in a pitiable plight and are dependent for their food on our military authorities. They tell some very pitiful stories about the depredations of the Germans during their occupancy of the place; and seem to want to be sociable and to have lost the knack. We are billeted in an old barn where we live in almost perpetual darkness. The sun never shines in this part of the world at this time of the year, and candles are absolutely unprocurable - In point of fact, everything that a civilised human being usually requires is unprocurable here.\n\nOn the whole we fare very well for rations and have little to complain of in that respect. Certainly we have nothing very Epicurean on our menu; and only run one course meals; the same course every meal and that course of course limited but it might be worse. There are some cabbage patches not far away and some of the \n\nmore venturesome lads \"go souveniring\" apres le coucher du soleil. They have an old bucket and some pieces of an old froggie's cart and I am sometimes asked to take a little cabbage with my stew. We haven’t much to do and the real trouble is to put in the time. It is too cold, and wet and muddy and miserable to do much walking, and it is too dark in the old barn to read. So I generally make a nest in the hay, for warmth, and imitate the snake as nearly as possible. One night I walked along to Avesnes (4½ kilos away) to a concert but it proved such a rotten turnout that I am not likely to repeat the visit.\n\nThe last of the old Afric crew fell this morning while playing some Tomfool game on the parade ground. He broke his knee cap and was sent back - a sure Blighty.\n\nCharleroi, Jan .3. 1919 - We left Boulogne on November 17, our final\n\ndestination being Nallines. On the first day we came as far as Sobre Le Chateau, a distance of 23 kilos, passing on the way through the towns of Avesnes, Avesnelles, Flaumont, Wardrechen and Felleries.\n\nOn the following morning we again set out, through driving wind and rain, at about 7 o'clock and after tramping all day in the mud and slush; we reached Sobre St Gery in the evening and stayed there for the night in some outbuildings of the Chateau. On Thursday morning we were on the tramp again and after negotiating 18 kilos and leaving behind us the considerable villages of Soussey Le Walcourt and -? We anchored for the night at Walcourt only 9 kilos from our destination. We were all very glad to be nearing the end of this sustained marching with all \"our personal effects\" on our backs and under adverse conditions; for nearly all were beginning to be tender footed and would have preferred a means of locomotion fraught with less exertion and weariness.\n\nIt was Friday at dinner time when we reached\n\nour billets at Nallines. We settled down there, fairly comfortably, in lofts and unfurnished rooms belonging to the inhabitants who do as much as possible to make us at home. The weather is cold and miserable and the brick floor on which we sleep isn’t exactly \"torrid\"; but we go to bed in the blessed assurance that we will not be asked to hurry up the line at midnight.\n\nHere, as in the other places I have visited in France and Belgium a householder’s status is gauged by the size of the manure heap he has at his front door; and the women folk seem to take a specially keen delight in watching the growth of the fragrant pile, and adding thereto every conceivable and inconceivable opportunity.\n\nUntil I visited these places I regarded Mark Twain as purely a humorist but now know him to be more. He is a vivid and accurate painter of national characteristics.\n\nThere was great preparation for the xmas dinner in our Battalion and for a\n\nweek preceding the","20":" everything and every body was in a state of continual effervescence. After the event was over it was pronounced to have been a splendid success but I was not well enough to attend and so missed my one chance of having a real good meal in Europe, After putting in a week in Nallines, I with a party of others, was sent in here on picquet duty on Boxing day -just a week ago. During the time I have had a fairly decent stay though as a rule I abhor picquets. Our task has been to keep order of an evening and to see that all soldiers were out of the Estaminets by 9 o'clock. Fortunately the beer in this place seems to be too weak to affect the Diggers very much; and when they are not over loaded they are generally responsible - enough. They give no serious trouble and of course we are all most careful not to see any little irregularities.\n\nI spend nearly all my time on duty,\n\nin a picture show; or window gazing; and I think the others spend theirs in the beer houses themselves. On new Year’s night things were fairly lively but such a state of affairs is only to be expected on these special occasions.\n\nWe had to stand around the place Centrale until after the New Year was born and had a few refractory groups to induce to melt away; but no serious trouble ensued.\n\nThis city is a very fine place having some very substantial structures; well appointed shops and three quarters of a million inhabitants. The shops are all well stacked and there is absolutely no sign of war about. In fact during my different sojourns in Blighty I have never seen such a plentiful and varied display of essential commodities in the windows. Certainly everything is awfully dear but that is only to be expected. But the most characteristic thing about\n\nCharlerois is its flagrant and shameless immorality which walks the streets, and dominates the cafes, without disguise. One cannot walk the length of a block without seeing women of all ages from 14 to 40, with faces ranging from pretty to ugly; with clothes from expensive to mere rags; who will boldly accost him and let him know plainly what it is they want and their desires are all and always the same.\n\nMy stay here has finished now, for this evening we are being recalled to our Battalion at Nallines. I am not sorry to go either, though the job here has been so good. If they are starting anything in the Education line out there I don’t want to miss it. I shall sadly miss my bed and table; and above all, the bright coal fires and my toast, but perhaps there will be other advantages\n\nto compensate for these things. We are just waiting orders now to move. We have to carry all our gear and have over 11 kilos to tramp half the distance over those cruel ,cobble stones so the sooner the order is given the better I shall like it.\n","21":"\n\nI am going into Charleroi in the morning in connection with an application I lodged the other day, for a position as Stenographer at Horse Ferry Road, London.\n\nWhether I get there or not I fancy I shall have no more parades and physical jerks; for I shall get on at Divisional Headquarters if I get no further. It is just a matter of putting in time now until my turn comes for demobilisation. And our impatience is growing in proportion to the nearness of that time.\n\n"}}