{"Document Name":{"0":"Diary_0281","1":"Diary_0281","2":"Diary_0281","3":"Diary_0281","4":"Diary_0281","5":"Diary_0281","6":"Diary_0281","7":"Diary_0281","8":"Diary_0281","9":"Diary_0281","10":"Diary_0281","11":"Diary_0281","12":"Diary_0281","13":"Diary_0281","14":"Diary_0281","15":"Diary_0281","16":"Diary_0281","17":"Diary_0281","18":"Diary_0281","19":"Diary_0281","20":"Diary_0281","21":"Diary_0281","22":"Diary_0281","23":"Diary_0281","24":"Diary_0281","25":"Diary_0281","26":"Diary_0281","27":"Diary_0281","28":"Diary_0281","29":"Diary_0281","30":"Diary_0281","31":"Diary_0281","32":"Diary_0281","33":"Diary_0281","34":"Diary_0281","35":"Diary_0281","36":"Diary_0281","37":"Diary_0281","38":"Diary_0281","39":"Diary_0281","40":"Diary_0281","41":"Diary_0281","42":"Diary_0281","43":"Diary_0281","44":"Diary_0281","45":"Diary_0281","46":"Diary_0281","47":"Diary_0281","48":"Diary_0281","49":"Diary_0281","50":"Diary_0281","51":"Diary_0281","52":"Diary_0281","53":"Diary_0281","54":"Diary_0281","55":"Diary_0281","56":"Diary_0281","57":"Diary_0281","58":"Diary_0281","59":"Diary_0281","60":"Diary_0281","61":"Diary_0281","62":"Diary_0281","63":"Diary_0281","64":"Diary_0281","65":"Diary_0281","66":"Diary_0281","67":"Diary_0281","68":"Diary_0281","69":"Diary_0281","70":"Diary_0281","71":"Diary_0281","72":"Diary_0281","73":"Diary_0281","74":"Diary_0281","75":"Diary_0281","76":"Diary_0281","77":"Diary_0281","78":"Diary_0281","79":"Diary_0281","80":"Diary_0281","81":"Diary_0281","82":"Diary_0281","83":"Diary_0281","84":"Diary_0281","85":"Diary_0281","86":"Diary_0281","87":"Diary_0281","88":"Diary_0281","89":"Diary_0281","90":"Diary_0281","91":"Diary_0281","92":"Diary_0281","93":"Diary_0281","94":"Diary_0281","95":"Diary_0281","96":"Diary_0281","97":"Diary_0281","98":"Diary_0281","99":"Diary_0281","100":"Diary_0281","101":"Diary_0281","102":"Diary_0281","103":"Diary_0281","104":"Diary_0281","105":"Diary_0281","106":"Diary_0281","107":"Diary_0281","108":"Diary_0281","109":"Diary_0281","110":"Diary_0281","111":"Diary_0281","112":"Diary_0281","113":"Diary_0281","114":"Diary_0281","115":"Diary_0281","116":"Diary_0281","117":"Diary_0281","118":"Diary_0281","119":"Diary_0281","120":"Diary_0281","121":"Diary_0281","122":"Diary_0281","123":"Diary_0281","124":"Diary_0281","125":"Diary_0281","126":"Diary_0281","127":"Diary_0281","128":"Diary_0281","129":"Diary_0281","130":"Diary_0281","131":"Diary_0281","132":"Diary_0281","133":"Diary_0281","134":"Diary_0281","135":"Diary_0281","136":"Diary_0281","137":"Diary_0281","138":"Diary_0281","139":"Diary_0281","140":"Diary_0281","141":"Diary_0281","142":"Diary_0281","143":"Diary_0281","144":"Diary_0281","145":"Diary_0281","146":"Diary_0281","147":"Diary_0281","148":"Diary_0281","149":"Diary_0281","150":"Diary_0281","151":"Diary_0281","152":"Diary_0281","153":"Diary_0281","154":"Diary_0281","155":"Diary_0281","156":"Diary_0281","157":"Diary_0281","158":"Diary_0281","159":"Diary_0281","160":"Diary_0281","161":"Diary_0281","162":"Diary_0281","163":"Diary_0281","164":"Diary_0281","165":"Diary_0281","166":"Diary_0281","167":"Diary_0281","168":"Diary_0281","169":"Diary_0281","170":"Diary_0281","171":"Diary_0281","172":"Diary_0281","173":"Diary_0281","174":"Diary_0281","175":"Diary_0281","176":"Diary_0281","177":"Diary_0281","178":"Diary_0281"},"Date":{"0":"unknown","1":825.0,"2":826.0,"3":827.0,"4":834.0,"5":837.0,"6":838.0,"7":849.0,"8":865.0,"9":904.0,"10":905.0,"11":906.0,"12":907.0,"13":908.0,"14":909.0,"15":910.0,"16":911.0,"17":912.0,"18":913.0,"19":914.0,"20":915.0,"21":916.0,"22":917.0,"23":918.0,"24":919.0,"25":920.0,"26":921.0,"27":922.0,"28":923.0,"29":924.0,"30":925.0,"31":926.0,"32":927.0,"33":928.0,"34":930.0,"35":931.0,"36":932.0,"37":933.0,"38":934.0,"39":935.0,"40":936.0,"41":937.0,"42":938.0,"43":939.0,"44":940.0,"45":941.0,"46":942.0,"47":943.0,"48":944.0,"49":945.0,"50":946.0,"51":947.0,"52":948.0,"53":949.0,"54":950.0,"55":951.0,"56":952.0,"57":953.0,"58":954.0,"59":955.0,"60":956.0,"61":957.0,"62":958.0,"63":959.0,"64":960.0,"65":961.0,"66":962.0,"67":963.0,"68":964.0,"69":965.0,"70":966.0,"71":967.0,"72":968.0,"73":969.0,"74":970.0,"75":971.0,"76":975.0,"77":976.0,"78":977.0,"79":978.0,"80":979.0,"81":980.0,"82":981.0,"83":982.0,"84":983.0,"85":984.0,"86":987.0,"87":988.0,"88":989.0,"89":990.0,"90":991.0,"91":992.0,"92":993.0,"93":994.0,"94":995.0,"95":996.0,"96":997.0,"97":998.0,"98":999.0,"99":1000.0,"100":1001.0,"101":1002.0,"102":1003.0,"103":1004.0,"104":1005.0,"105":1006.0,"106":1007.0,"107":1008.0,"108":1009.0,"109":1010.0,"110":1011.0,"111":1012.0,"112":1013.0,"113":1014.0,"114":1015.0,"115":1016.0,"116":1017.0,"117":1018.0,"118":1019.0,"119":1020.0,"120":1021.0,"121":1023.0,"122":1024.0,"123":1025.0,"124":1026.0,"125":1027.0,"126":1028.0,"127":1029.0,"128":1030.0,"129":1031.0,"130":1032.0,"131":1033.0,"132":1034.0,"133":1035.0,"134":1036.0,"135":1037.0,"136":1038.0,"137":1039.0,"138":1040.0,"139":1041.0,"140":1042.0,"141":1043.0,"142":1045.0,"143":1046.0,"144":1047.0,"145":1048.0,"146":1049.0,"147":1050.0,"148":1051.0,"149":1052.0,"150":1053.0,"151":1054.0,"152":1055.0,"153":1056.0,"154":1057.0,"155":1058.0,"156":1059.0,"157":1060.0,"158":1061.0,"159":1062.0,"160":1063.0,"161":1064.0,"162":1065.0,"163":1066.0,"164":1067.0,"165":1068.0,"166":1069.0,"167":1070.0,"168":1071.0,"169":1072.0,"170":1073.0,"171":1074.0,"172":1075.0,"173":1076.0,"174":1077.0,"175":1078.0,"176":1079.0,"177":1080.0,"178":1081.0},"Entry":{"0":"\n\n","1":" 3 16\nTel-El-Kebir\n\nLast night I was on guard and today I am off duty untill 3 oclock:all this morning the artillery have been haveing a few shots,no doubt getting ready for our next campaign where ever that may be.I myself think it will be the gulf to have another go at Jonny the turk, and I am sure they will get something like they got on the Gallipoli peninsula. This place is getting rather warm and the flies are getting rather troublesome. Where we are now camped is where the English fought the Egyptians it is the old battle field of TelEl Kebir and the Battle took place more than 35 years ago, and even now one can go out and pick up bones of those who fell.I believe there was a good many killed here no doubt. This was an ideal ground for the Defenders of itbecause it is all\n\n(4)\n\nso open you can see for miles all around you This is where the English formed their famous Square which was Broken by the Egyptians in the Battle for Tel El Kebir\n\nCamp\nlast week I went to Cairo to see if there was any money for me from Aust and I find that there is 5 pounds for me in the anglo Egyptian Bank.\n\nMet Jack Margan yesterday also Bull Gurder.\n\n(5)\n\nTel-El-Kebir\n21st 3 16\ntoday the prince of wales was here haveing a look round and when he was departing the troops lined the road and cheered for all they were worth.\n\nSerapeum 29th 3 16\nwe left Tel El-Kebir on Sunday for Serapeumwhere we have now arrived after 3 weary days marching through the Sand. The first night we reached Massamah the second Moascar and the third day we crossed the Suez Canal and wealloted to our tents the distance being 45 miles. On the way down we were without water and whenever the men rushed any holes that they came to they were stopped by the General from drinking he saying that it was not fit for drinking.\n\n\n\n(6)\n\n18. 6.16\nSomewhere in france\n\nThe Stretchers have arrived and they may be needed any time now. 4 men have to be on Duty byday and night on the Square in case any one gets knocked out\n","2":" 6. 16\ntoday we leave for a position nearer the fireing line. The name of this village is and is situatedabout 2½ miles behind the fireing line.The Germans are giveing the planesmore straff. The poor germans god forgive them because we will not.\n","3":"\n","4":"\nWe are now camped at Serapeumon the Side of the Canal where we arrived a few days ago from Tel El Kebir which is about 45 miles away and we had to walk at times without water in our Bottles.\n","5":"","6":" has arrived once more and the boys are haveing great Catches I myself have been caught once.It is windy here today I have made several attempts to write a letter but the dust won't let me.\n","7":"\nAll day yesterday and again today it has been very dusty. Last night I shall not forget for some time to come there was 3 of us in the tent and were just going to bed when a duststorm struck us.\n","8":"","9":"\nBoulogne\n\n\n","10":"\n\nWimereux RAMC \n","11":" afternoon from 4.30 Pte Norman and me for a stroll along the Beach \n\nMcClintock\nG T C\n\n\n","12":" \n\n16. 6.16\nCaptMarks and Seargeant Clinen and W.O. rogers go to londonon 8 days leave. They were the first 3 to leave from the Batt.\n\n12.4.16\ntoday has been rather Dusty here and now it is about 7 am and there is a heavy Storm passing over and the tent is rocking like a ship in a heaveySea we are all Cursing the windfor Blowing So much we are covered with Dust from head to to foot, I have Eaten about 3 pounds of it. \n\n13.4.16\nno improvment on last night weather plenty of Dust and more hell to go into.\n\n(9)\n\nThese are the names of the men in our hut.\nSgt.Clark, S\nCp Thomas,K\nCplBeech, S\nPteMcClintock,S Phand\nPteWild,U\nPteSneesby, T\nPte Banning, Right m w\nPteMcCarthy,Burnt\nPte Workman,right\nPte McKerlie,Killed\nPte Baxter,wounded\nPte Sipple, T\nPte Curley,wounded\n \n\n\n(10)\n\n5.6.16\ntime about 8.30 we will reach port some time tomorrow morning after 5 and a ½ daysail from Alexandria. Thank god thatwe have left Egypt S.S.S.S. We will land in france with a Smile because we knows that is where the germans are.\n\n13.4.16\nWe clean out the tanks. They were very Dusty.\n","13":"\nRMS transylvaniaat sea\nWe left Alexandria on friday morning last bound for france which we will reach late tomorrow night or Early next morning up till now nothing of any notice has occured no Submarines Sighted yet there is 2 parades per day on the ship one at 9.30 and the other at 4.30. We are now passing the islands of Sardinia. We passed Cape last night also islands of Create \n\n\n","14":"\n\nFrance 20.6.16\nNothing much Doing last night only a few of the guns Speaking. Meek has got Boils on his neck pity they were not on his toungue and then he would not be able to talk So much.\n","15":"5.16\non Board Ship at Sea\nThe food on Board this Ship is rotten and not worthing Eating it is a damn disgrace the way the men are looked after the officers do pretty well. Theywill watch that part of the Business it will hurt some of them when the war is finished. They will have to go home and live on Bread and fat.\n","16":" 6 16\ntime 8.30 pm\nSeven of our aeroplanes have just returned from the German lineswhere they have been observing. During our occupation of the\n\nGallipoli peninsula I have seen hundreds of Shells thrown at the planes but here it is thousands and what I have just seen has Surprised me. The Enemy have just covered the sky with Schrapnel it is a grand Sight to See the way our take it. There is nothing to frighten them away if a Shell happens to hit any where near them theyjust turnand say fire again.\n\nSerapeum 14.5.16\nWhenever will we get away from this place we have been in this Camp for the past 6 weeks and we are all getting tired of the place. The life is dead to us. wWen we first came to this place things were one mass of Curios But now this place is nothing But Dust and Sand. The tempture here today is 120 in the Shade.\n","17":"\n\n28.5.16\ntoday we have to take our clothes to the other side of the Suez Canal to get them fumigated This is to kill any vermin that may be in the uniforms. Theydo want us to in france. Will we be Sorry when we disembarkat Marseilles I dont think so.\n\nMay 31st 16\ntonight we commence to leave dusty Egypt for france. We will reach Alexandria about 2 am, The journey being 10 hours. Not one of us are sorry we are going.\n\n(14)\n\n22.6.16\nBefore we were out of Bed this morning the germans opened fire on one of our Battries it is only about 300 yards away they must have put 100 Shells into the positions the Shells being about 8 inch. The rumour goes that they put one gun out of action I dont know if it were true. The german aeroplanes came over our lines this morning. They were the 1st hun planesthat I have seen over here our anti aircraft guns opened fire on them one or 2 went to close to them,they turned and went for their lives,no casualties in the 13 yet. There is some talk of us going into the first line trenches on Saturday.\n","18":"\n\nBang Bang Crack\nThat is the Sound of the Bursting Shells today They are on our right, left and in the front and also behind. The ones behind are our own and will not harm us the ones in front will. The boys are watching the huns Straffing our planes gott Straff the Kaiser and his Staff.\n\nSomewhere in france","19":"\nWe are now about 3 miles behind the fireing line and within range of the german guns, and all day there has been Shells Bursting about 300 yards away They have not managed to get them into our billetsbut may land one here any time. from where I am writing I can see the German observation Balloons. They like us use Balloons for the purpose. There is some talk of the 13 going into the trenches soon\nThe night before last\n\n(16)\n\nthe Enemy made a gas attack on our troops. The rumour goes that there was 400 Canadians cooped it. The has just burstedabout 300 yards away 6 inch Shells only a couple of them about an hour ago. I was watching a shell bursting in the air and I have not seen any smoke like it before. The germans have just Set fire to a house by shell firewhich I believe was Burnt to the ground. This means that some poor unfortunate persons will be without a home tonight and they call this war. We troops all expect to meet our fate on the field But these people who are not fighting have too put up with a lot that is not known to many. Some of them will not leave their villages under any circumstances.Before thewar no doubt this is where many of them\n","20":"\n\nreared their families and now find it hard to leave and some of those who were Brought up haveingtheir lives for france and many more will do the same before the war is ended. Not one of us likes war no it is hell and was not meant for the men to die the way they are doing in this war. The germans are using all sorts of cowardly methods to kill their enemies,firstly the gas which has not proved so successful as theygermans hoped it would be and then there is the tear shell. Only yesterday morning we went through the gas but not the german gas it was demonstration to show us how inaffective their gas is against our gas helmets. We did not feel any after affects. This\n","21":"\n\nTear Shell when it Burns in the vicinity of you if you are close enough it she will make you Blind. The Kaiser or whoever is to blame for this war will get the punishment which they so deserve when the war is finished. There is no doubt about it we are going to win this war.One has only to walk behind the lines to see that.\n\n18.6.16\ntoday we have been issured with fags one pkt.and one Box matches. I believe we get paid tonight the first since the 25.5.16 we want it badlywant it. There is no money in the . The germans are giveing our aeroplanes a little bit of Straff.\n","22":"\n\n19.6.16\nThere is nothing much doing today. I went to See miss concert party it was not up to much it was held about 1½ miles along the road. I got a hair cut, the first for about 3 months. It is very windy at present the enemy may take advantage of it and use the gas.Wrote 2 letters one to Annie and one to Essie. English mail comes but no Aust . I hope we get some soon. Enemy used gas last night we were called out and had to put our helmets on in case of a emergency. we stood to for a hour and a half waiting for it too reach us but it failed to do so. The New Zealanders attacked the germans last night we have not heard the result yet,I hope it was a success.\n","23":"\n\n18.6. 16 British Bombardment of the German Trenches\n\nlast night about the hour of 12 pm the british artillery opened up on the german trenches,it was a beautiful Sight,but alas a terrableone. The English sent up Star Shells in thousands and when they bursted in the there was nothing but colors of all kinds,blue green red and many others and then the fun began. The guns opened all along the line,the noise was terrific.The cause for this Bombardment was I believe the enemy used the gas on our boys and the gun fire was to raise it from the ground by doing this we compel the gas to rise and it is not so harmful to us. The gas is heavier than air.\n","24":"\n\nFrance\n21st 6.16\nThere was not much Doing only a little Bombardment last night some of our boys went into the trenches for 72 hours Sergt C. H. has been there since yesterday afternoon the name of the village we are in is called \n","25":" time 4.30 pm\nat the present moment there is a intence Bombardment going on. the Germans are giveing it to our Boys hot and strong and we are Straffing them. while I am writing this I can hear nothing but the Shells coming and going Bang in the air. the Germans are now trying to get one of our aeroplanes. there is a Battry close by and the Germans have been after it Since 7 pm this morning but they have not managed to knock them out\n\nThere is agreat Crowd of the men watching the shells falling\n\n(22)\n\na Shell may lob amongst them any moment. They will catch it ifone does. The huns are still after the planes I have not seen any Shot Downas yet. They are rather Difficult to hit when they are going through the air \ntime 5 pm\nThe Enemy are Still Bombarding our positions and we are doing the same to them I have seen a peculiar Shell Bursting in the air taffy reckons it is gas But I don't think so. the Enemy set the town Hall on fire this morning at ......\n","26":" 6.16\nnothing doing on the front today on account of a thunderstorm that is passing over\n\n24 nothing\n\n25th 6.16\nThis afternoon our aeroplanes attacked theirenemy look out postand a observation Balloon and also downed a Taube. The Enemy Shellthe village of Erquingham\n\n(23)\n\n26.6.16\nFrance. time 4pm\n\nup till the present nothing of any note has occured the weather looks like being very warm. one of our aeroplanes has just returned from the German trenches. the rumour goes that we go into the trenches tomorrow night some time. I dont know if we will because one cannot believe what he hears here. I have spent all my pay so there will have too be a limited Supply of Smokes untill I can manage to get some more money. one of the men who has been out in the trenches Since Saturday last tells us that our first man Killed since we came to France is Pte Wild of B Company Since we have been in this Campaign we have lost about 10 men The onethat got Killed last night was assisting the 18th Btn in a raid on the German trench Sergeant has been sent to the 5th F.A \n","27":"\n\n29 6 16 France\n\nwe came into the Trenches last night about 2pm we arrived we are now settled down in the Dressing Station Sincewe came here we have had a few men wounded. Cpl Barnes is lying Dead out side the door he got hit on the head. he went through Gallipoli with the Battalion and fought in the landing on","28":"\n\nThings have not been too bad since we came not much artillery going on that is all that can harm us here as we are supposed to occupy a gas and shell proof Dugout but I think if a was to land on top it would be about up with us\n\n(25)\n\n29th 6 16\nFrance\n\nDuring this last couple of weeks our Boys have been Keeping the Germans thinking we have raided their trenches a couple of times lately and last nighttheystarting throwing Bombs into their ownBarb wire This amused our Boys The other night some of the 18th Btn took some prisoners and they pinched all their Buttons as souvenirs. one of them was and before he could reach our lines our Boys were after him while they were doing this a Shell from the Germans wounded the whole lot of them\n","29":"\n\nThe Trenches\n30.6.16\n\nLast night our Boys carried out a raid on the germans. itseems to have been a success because there was only one man hit with our own trench mortar not seriously. how these raids are carried on first of all the men Blacken their faces and do not carry rifles. The carry a Stick with a Spiked head on it. The artillery Bomb the Enemies trenches and then all of a sudden stop and then our men go forward and when they are finished the artillery cover their retreat thus keeping the Germanin his Sec or Third line Trench\n","30":"\n\nThis afternoon a fleet of 20 of our aeroplanes went over the german lines no doubt for the purpose of dropping Bombs on their positions. They all returned safely it was a greatsight to see them going through the air they looked like a flock of Eagles. The Enemy fired on them with schrapnel But did not get within miles of them. Just before the planes went across the Enemy started to put some shells into D Coys Billets. one shot hit a house and you could See Bricks going in all Directions. I dont know if they managed to get any Body But I am afraidthey must have as they were right in amongst them. There has been no wounded men come\n","31":"\n\ninto the Dressing Stn today and only one last night a private from the 17th Battalion Pte Stokes was in this Dug out yesterday afternoon with six of his mates when the Germans put a bomb amongst them. Pte Stokes had his face Blown right away. The poor chap was only a boy his age being Eighteen. to young for this Sort of work. the other Six with him had better luck one Being wounded and four Suffering from Shell Shock remainin the fireing line the name of this place is Bois Grenier. Curley, Wild, Sneesby Foster Knox pay us a today\n","32":"\n\nThe food here is not too considering we are on active service. These are amongst the issue that we get Butter pickles Bread. These things we did not see much of while we were on the Gallipoli penn.the tucker here is much Better. mail came today But no letters for me I wrote about 8 this afternoon. we received word this morning that the English troops at la Basse took 300 yards of trenches off the german the french are Doing well at Verdun. The number of troops engaged at la Basse was thirty two Divisions I think within this next 6 weeks the allies will make a big offencive on this front.\n","33":"\n","34":"\n\nWe had rather a busy night no sleep on account of the wounded coming the Germans managed to get a couple of Bombs amongst our Boys\n\nI have just come back from the 4th field amb where I and Banneyhad been with a case Shell Shock.\nour artillery gave the Germans a little Straff they will not return the fire on account of our aeroplanes who are watching for the German gun positions.\nA couple have been killedup till the present and a few wounded\n\n(31)\n","35":"\n\nThis morning I have had a look at the first line trenches and my first Empressions are that they look fine. The Dugouts being much Better than they were on Gallipoli line There we had the Hills to protect us and they were much better than the DOs If a shell manages to get at them it will be all up. from the first line we went over to an old farm house to some water for Drinking purposeswe also had a look at the enemy position from the distance they are in the wood. There was a few men killed last night is in the Dressing Station having a yarn to us he tells us that\n\n(32)\n\nthat the Germans put some aerial torpedos over into their trench these wepons are giveing it to our Boys lately This sort of thing is what gives them Shell Shock. Things are quite so faryou cant hear a Shot being fired But at the hour of 12 pm that is when they start to Straff and then there are some flying about\n\nI have just seen the mostly gastly sight in my life. The pioneers just Brought a man in from the trenches and the poor chap had half his face blown right away his friend was Blown into peices and some parts of him was found 70 yards away. my god the\n\n(33)\n\nSights we see are awful. people who only sit and read about the war have no idea what the troops have to through Since I left australia I have seen many terriable Sights and I Dont think that I Seen anything in the landing at gallipoli to come up to what I have seen here During this last couple of Days awful is not the word for it it is hell upon earth right Enough and yet do the Boys want peace. yes we all want peace But we realise that it must be with complete Victory for the arms of the allies\n\nA German taubehas just come across our lines and has penetrated our lines for a good Distance in\n\n(34)\n\nThis is the first German aeroplane that I have seen over our lines our anti aircraft guns are after him But are shooting a good deal short of the mark he is up a great Distance he looks like a Sky lark in the clouds our planes will be after him shortly as we are masters of the air 100 shots have now gone after the taube. There is going to be a big Boombardment of the german trenches tonight By our Boys we are going to Straff Fritz for all we are worth\n\n(35)\n","36":"\n\nlast night the 14th Battalion made a raid on the german Trenches. from what I can hear it was not a success. Eighty men went out and only Twenty Seven returned fifteen of them being wounded. They got hung up in the German Barb wire The artillery was violent\nNews has Just come through that there is thirty missing in last nights raid and twenty Casualties. 2 men came in this morning.\n\nThe Germans put up a sign this morning Saying Dont inflict to many casualties peace in two months time. We will wait and see I think they\n\n(36)\n\nare Trying have a joke with us. buy all counts they Dont like the Bombardment our Boys have been giveing them this last week\n\none of our aeroplanes was over the german lines this afternoon it received the usual Straffing. \"D\" Company releives C Company tonight nothing much Doing in the artillery line this Evening. that will come tonightabout 12 pm the usual time\n\nBrigadier General monash came along the Trenches today and had a look at the Boys. no casualties During the day The german machine gun has started\n\n(37)\n","37":" france\n\nThe germans attack the 14th Battalion last night They gave our Boys an un merciful hours Bombardment it was kept up for about 12 hours we have not heard how many casualties they had we only had one man Killed During the past 24 hours and none wounded\n\nit has been raining here all day. The ground is very Sloopyour Boys Bombard the Germans this evening. The Huns have not replied to our fire. I have been reading the account of the great offencive on this front we seem to be getting right into fritz anyhow it is time that we Done something We\n\n(38)\n\nhave been idle long enough we all hope that the adancewill continue not because we are not in the we are allways ready when the order comes and I Dont think that will be very long.\nI went to C Company this afternoon for the Doc to warn 5 men to return to the Dressing Station Could only find one Jim the other 4 are missing there is a rumour that A Comp is going to have a go tonight hope they Do not get knocked about too much\n\nLieut boccardfound a message from the Germans this morning asking how Do you like our trench mortars we hate yours\n\n(39)\n\nyour artlillery is Rotten what is ours like no Doubt some of the huns have a little humour. They wont have to much when our boys Start to move forward oh Dear no not they\n\nour guns that have just been put into position opened up on Fritzs trenches this Evening maccarthy went to Erquinghamthis afternoon hope he brings back something nice to Eat the food issure in the trenches is the best tha I have seen since I left Australia in 1914\n\n(40)\n","38":"\n\nvery Dull here today I went to the waterfarm this morning with Sgt Clark and McCarthy also Workman we fixed things up. we are going to get a warm time up there shortly our boys are putting two trench mortars along side the tank when they start the germans will try and find them with heavey artillery and the tanks will go Sky high we threw some Big Shells at the germans today\n\nThey gave us a few Big uns too\n\nThe germans Bombarded our trenches this Evening 2 men supposed to have been killed in D Company There was 2 wounded in X Coy\n\n(41)\n\none was private mason he has just left the Dressing Station for the fourth field ambulance he had rather a bad knock. one wound in the stomach 3 in the Knee and one in each foot makeing Six in all there was not a mermor from from him he Stuck to it like anAustralian Does when he gets wounded. issured with tobbaco this afternoon. Bonney is not feeling too well to day. I hope he is better tomorrow. I have Sent to Erquingham for 6 tins of good flake cigarettes. wont I have a time after meals when I can sit down on Couch (the floor) and smoke till the cows come home. I took Sgt major Compton to the 4th F.A. he goes to fort \n\n(42)\n","39":" 7 1916\n\nThe artillery was on the left was going some last night it being the most violent that I have heard on this front. There was also a gas alarm at midnight we were told to have our helmets ready After siting up in bed for about an hour we received the order no gas the horns were blowing for they were worth this being the alarm for the gas. It was us \nbeing\n giveing the huns a taste of there own medicine The Enemy threw about 15 Big Shells about 100 yds away. They were trying to find the Battery\n\n(43)\n\nThis afternoon the Germans were trying to find our head quarters with heavey artillery they lobed them all round the Dressing Station and Drove me out. I went into the front trenches as that was the safest place they did not do any damage how they tried to find the HQ was the first shot went about 200yards wide of the mark the next 150and each shot they reduced 50 yards This is what we call feeling for their object. They Knocked the machine guns dug outs into the air no one was hit\n\nThere was a taube up observeing for the Germans artillery I think we get relieved tomorrow night by the 15 Battalion and a good one it is too\n\n\n\n(44)\n\nviolent artillery Duels on our right and left have just received word that the total number of prisoners takeing in the great Franco- British offencive reaches thirteen thousand Good Boys Keep on going you will soon be in Berlin and have the two Willies By the Heels.\n","40":"\n\nvery wet here today went to water farm this morning and filled to tanks thing are rather quite so far here today not many shells flying round But I suppose there will bethe usual Straff tonight only one man wounded in the past 24 hours\n\n(45)\n","41":"\n\nThere has not been much Doing here today only a fewoccasional shots going Down to C Company Billets no one has been hit\n","42":"\n\nlast night our Guns opened a Bombardment of the German trenches commencing at 10-30 and ending at 11 pm. Then our trench mortars gave them something for half an hour. we expected the germans to retaliate vigriously But they did not their reply was very feeble only one man being slightly wounded. A German plane come over our lines this morning but after our anti aircraft guns put a few shots close to him he turned tail\n\n\n\n(46)\n\nand went for his Dear life. received more good news from the russian front yesterday also the Franco British front who have now captured 15000 prisoners\n\nWe leave here for Steen JEEtomorrow night and after a few days rest then on to La Basse or Ypres to assist in the great offencive. are we Downhearted. no. I went to water this morning. word has just come through that the russians have taken 12000 prisoners 300 officers and 45 guns and crossed the river The Germans gave us a little Straff this afternoon they put 80 Big Shells over and they were Dropping all round the Dressing Stn some only going about 20 yards away\n\n(47)\n\nWe all Done a Skoot out ofthe Station We can all schrapnel but not high explosives if one was to lob on the top of it there would be about 9 or 10 men Buried there is no escape at all. no one wounded So far to day our artillery on the right are Straffing the Germans this afternoon\nreceived good news from the allies fronts to day\n\ntwo German Taubes over our lines at 6 pm two of ours gave chase. The Germans put Schrapnel all over the Sky after them But as usual missed rumoured that the Socialist party are causing some trouble in Germany. They can End the war quicker than we can\n\n(48)\n","43":" 7th 1916\n\n2 german Taubes over our lines this morning our artillery open fire on the enemy trenches at 4.00 this morning This is rather an unusual to Start. we nearly allways commence about midnight one of our planes fly over the german at 1 pm The germans give it a little Straff General Cox walks through the trenches this morning and Bid the men good day. half the Battalion get releived tonight and go to Steen JEE. Filled 2 water cans for two men wounded to day so far none killed.\n\n(49)\n","44":" 7. 1916\n\nlast night was the quietest that we have had Since we came into the fireing line. The","45":" Battalion releived the 13th last night we leave here tonight for Steen JEE 3 men wounded in the last 24 hours Taffy cut his finger badly last night and had to get the Doc to put four stitches in it\n\ntime 9 pm\nwe are all ready to go when the 29th Btn amc come they ought to be here now The Germans are putting high explosives Shells into Bois Grenier. one 39th Battalian man wounded to day the first of that Btn. his name was Cochran he was not Badly hit Slight wounds on the head and the worst one was on thehip we go to Erquinghanto night also\n\n\n\n(50)\n\nwe rest untill 1 pm tomorrow when we resume our march on to Steen JEEwhich we ought to reach about 6 pm tomorrow my today from received a \n\n12th July 1916\n\nwe left the trenches at 2.30 this morning and arrived at Erquinghem at 4.40 here we rest untill 1 pm and then resume our march again we go to SteenJEE.\nfoot Sore and weary we arrive at Steen JEEtime 6.30. we leave here tomorrow\n\n\n\n(51)\n","46":"\n\nWe are leaving here in a few minutes for the rail station we do not know where we are going But most of the Boys think we are going on the Somme to assist in the push there.\n\nhad a good nights sleep last night the best since we left the village for the fireing line 3 weeks ago.\n\nleft Steen JEE10 pm arrived at Bailleul 12 pm entrained at 12.15 pm and departed at 12.30. arrived at Candas6.30. left 7 am on 7 miles march finishing at 11 pm foot Sore and weary oh who wouldent be a Soldiers\n\n(52)\n\n14 . 7 . 1916\n\nwe are now in Billets at a little village. We are standing by ready to move off at ½ hours notice. we have 20 miles to do tonight oh what a pleasure to look forward too This village is not Bad plenty of wine and not much food\n\n(53)\n","47":"\n\nwe are now in a little Village where we arrived last night we are now standing by ready to move off at half hours notice we have no idea where we are going to but we do know that we have Something like a 20 miles march in front of us. rumours go that we will be marching for the next three days only a few men fell out on the march from Candasto here But I think there will be a great number fall out tomorrow on account the bad Boots and hard roads. I went up to the Village this morning and did not see any thing worth to mention. only all the houses are Estaminets.\n\n15 7 1916\n\ntime 1 pm. we are about 4 miles from home on a rout march and are now haveing Dinner in a wheat field the cause for this march is the men have made Damn fools of themselves Drinking and the general sent the whole Division out to keep them away from the pubs. we are now Billeted at DomartI think we will push on tomorrow and get nearer the fireing line we are now about30 miles from where the big push is going on \n\n(55)\n\ngeneral over us monash goes as head of the 3rdaustralian Division he will be missed in the Brigade\n\nI joined 17th Btn 2\/12\/17\n\n(55)\n","48":"\n\nThere is nothing much to mention today we went on a rout march of about 10 miles the reason for this being comeing from Candasto Dormartthe general says there was no Dicipline on the march and gave us this to Cure us\n","49":"\n\nwe are on our way to the front we left Domartat 4.30 this evening on a 9 miles march to naourswhich we reached at about 6.30 pm.\n\n(56)\n","50":"\n\nwe are now settled Down in Billets at naourswe expect to leave here in a few days time we are going to march right up to the front which is about 20 miles we will get there in about 8 Days time\n","51":" 1916\n\nraining here today very uncomfortable we get paid some time today the church Bells are ringing and have been all night. we are here for about 9 Days\n\ntime 6 pm\n\n(57)\n\nI am now out for a walk with Bonney and Baxter and must get Down onthe roadside to Describe what the Scene is like we are surrounded by beautyful and fieldsof all sorts of Beautyful flowers poppys and what not. the frenchman who would refuse to fight for france wants executing god one would be proud to Die on such ground as this that I now look upon. my pen cannot write what I think of it\n\n(58)\n","52":"\n\nit is a bright Sunny day and we are getting the full Benefit from it Fraser is Sick and going to the field ambulance. not much Doing otherwise. we were paid yesterday receiving more good news from the russian front. The anglo British offencive in the west is going on first rate taken after ten days hand to hand fighting\n\nThe war is now costing Britain 6 millions Daily\n\n(59)\n","53":" 7 . 1916\n\nI went to Domart this morning on one of the Sigs Bikes I had to take the a.a.m.s report in and the Journey was first rate going but coming home was hilly and the old Cychad to be pushed all the way I left naoursat 10.30 and arrived back at 1.20 the Distance was 19 miles return next time I go there I want a motor car and some one to Drive it oh yes\n\nnothing much Doing otherwise the troops have gone out on a rout march the english attacks are going on well.\nwe will be amongst it very soon\n\n(60)\n","54":"\n\nnothing much Doing today we are supposed to be leaving here about Sunday &went up to the amb with pte who is Suffering from toncolitisand there went to CaptHenderson and got the teethforceps off him for Beechly to Drain Sgt Coles tooth and took the a.a.m.s report Yesterday afternoon with pte Baxter I went to the caves that are Situated about half a mile out of the village and had a good look underneath them They were Something after the style of the pyramids underneath Chapels of all sorts and in memory of many Saints france is a very Religious Country and no matter\n\n(61)\n\nwhere one rambles too he will allways See altars on the roadside we changed our Billets this morning and now we are in the house where a french Doctor lives this morning while Sick parade was on he was rather interested and was sayingwhat he thought of the Cases.\n\nWilliams of the 13th Battalion Died a few Days ago from pneumonia\n\n\n\n(62)\n","55":"\n\ntoday we go for a rout march to Flesselles the distance from NaoursBeing about 9 miles return Journey This was not enough walking for Baxter and I we had to come away without tea and walkto Havernasabout another 7 miles return what do you think of us Deserveno rest at all\n\nreceived a letter from Both Essand Tess I am now in a shop at Havernas going to buy Something to quench our thirst\n\nJuly 22nd\nsomewhere in france\n1916\n\n(63)\n","56":"\n\nnothing doing today went for a stroll with Charlie. received a letter from Ess and Tess\n","57":"\n\ntime 1.30 I am on Duty at the water tank nothing Doing otherwise we are leaveing here tomorrow have no idea where we are going too But theSome is\n\n(64)\n","58":"\n\nWe left Naours at 8.45 this morning and marched about 6 miles nearer the fireing line we rest here for 24 hours and then go onto the last billets which are about another Six miles ahead we are going to the Somme to assist in the big offencive thatis nowtaking place the first australian Divisions are in action and rumours go that they were Cut up badly but not before they gained their object. the germans were Supposed to have flooded them out of their trenches. we have a great amount of Calvery waiting untill the next line is taken and then they are going to act in a way that the germans wont like. I went to Talmasyesterday with Charlie Baxter\n\n(65)\n","59":"\n\nnothing much has occured today we arrived in this village yesterday we marched from naours to rubempre. we leave here some time tomorrow for our last Billets which will not be far from the fireing line\n\n27th July 1916\nWarloy\n\nThis morning we were called at 5 oclock and told to get ready to move at once but Did not leave until 9 oclock after marching about\n\n(66)\n\neight miles we arrived at our Destination This is our last billets, from here we go into the fireing line There is a rumour that we are going up tomorrow as reserves But I Dont think it can be true as there is many things that we are short of and must get before we go to meet the troops The first aust Division are coming out of the line the 12th Batt passedthrough this village this morning looking very much Knocked up they have had a rough time of it in the big push on the Somme wehave to receive our up their and we are sure to catchit hot and Strong\n\n(67)\n\n28th","60":"\nfrance\nWarloy\n\nThere is not much Doing today the weather is nice and hot last night the first Australian Division came out of the trenches they were on the Somme taking part in the great push They still Kept the good name of the australians up and did not our name that we made on gallipoli The first Battalion must have got it rather hot because there were only about 300 hundred of them came back with their Battalion the Second Seems to have suffered just as bad if not worse Their only about 250 from thisBattalion left. one poor chap that I asked about was Killed in the Charge his name was G Corrigon. The third and fourth Battalions are not soweak as the 2 former Battalions\n\n(68)\n\nthey were a gaylot of boys as they swung past Singing all Sorts of Songs not forgetting Aust. we'll be there.\nThey were there right enough and will be there again before the offencive is finished There was a great number of German helmets with the Boys which they prized more than anything elsethat was in their possion and rifles and pistols were another trophy which was very promminent amongst them. one Chap perched up on top of a timber waggon had a goat with him I Dont Know if he captured it but everything points that he did the way he had his arms round it you would think he was curting his best girl. we are now in a village its name is - and is situated about 7 miles behind the fireing line. we are stopping here for\n\n(69)\n\nfor a while and then go up and releive the 2nd Division who are now in the trenches The first Division were in for about 4 Days and I Suppose the","61":" will Do the Same length of time and then us. are we Downhearted no but we soon will be. There is a concert in the village Square tonight. post 14 letters today the last until we come out from the big push. There is a rumour that austria is Sueing for peace hope she is and getsit it will go a long way to finish this warbut She must take what we give her or be crushed completely which will be the result if she continues with the war turkey and bulgaria will Share a Similar fate and germany will not be much more\n\n(70)\n\nallies peace terms\n\nthe allies have Submitted their peace terms to germany and this is what they are Supposed to be. of Course this is only a rumour I have not read it officially The german navy goes to england also heligoland and germany must pay a big endemnity to england. to France goes alsas lorriane and other territory. Italy gets a big Slice of austria and Servia a lump of Bulgaria while turkey ceases to exist in Europethe Dardanelles remaining a free port with russia the main nation in the Sectorengland also has all the german marine Shipping These terms are very Staggering to Germany and ones that I Dont think She will accept at least not for the present. She will continue to fight to the last man but we will be at her in the line and she will have totake any\n\n(71)\n\nanything that we offer of course there may be no truth in england offering her these terms. I myself Dont think She has I have only put them Down in the Diary as I just heard of it \n","62":"\n\nI was paid 40 franks yesterday nothing Doing today we are Standing by ready to march out at 1½ hours notice we are going up to the big push and will very likely be there before tomorrow night or it may be tonight about 50 reported Sick this morning one man was sent in field ambulence with ear trouble.\n\nWarloy\n\n(74)\n","63":" 7th 1916\nWarloy\nFrance\ntime 5 pm\n\nwe have just received 3 hours notice to get ready and move out at 6.30 pm we are now waiting for the order to move. time 6.30. we have now received word that we are not going tonight. oh this is lovely we handed our blankets in last night and we had to Sleep on the hard brick floor with only an overcoat on and the medical cars will have to be unpacked again in the morning this will be the third time that we have packed it. in the village we handed our felt hats in and now we are going about in the Steel helmets and they are a good weight on our heads. The name of this village is Warloy - Baillonabout 10 miles from Albert\n\n(75)\n","64":"\n\nnothing Doing today took a patient to the 4th F.A. and seen two men that was gassed by the Germans one Died while I was there and the other one coming round very close by but I am he will Die or be a cripple for Life poor chap\n\nGeorge\n\n\n\n\n\n(76)\n","65":"\nFrance\nWarloy\n\nabout Dinner time today four german aeroplanes Come over the village but Did not Drop any bombs our anti aircraft guns opened fire without any affect. fragments of Shells were falling in the village and one unexploded 12 pounder Dropped behind the","66":" Bn Q.M.Store\n\n(78)\n\nWe went out this morning and had a sham fight and we go out again tonight at 9.30 and return at 12 pm While we were out this morning we rested in the aerodrome and while we were there we seen many planes go up and many alight.\n\n(79)\n\nif the German airman that were over and knew that they were so close to an aerodrome I think they would have Dropped bombs. no one was hit in this mornings raid The 12 Brigade left for Albert tonight we leave Soon now the 12th is a part of our Division\n\nH and C Coy went to Delville Wood on Sunday\n\n(80)\n\n6 men and one officer have been wounded out of these 2 Coys There are out Digging Graves and a fatigue party\n\nI had my boots mended today So did Spud\n\n(81)\n\nAugust 2nd\nnothing Doing today\n","67":"\nnothing much Doing today the weather is fine\nWarloy\n","68":"\nwe are leaving for the fireing line tonight which is about 8 miles from here the rumour goes that our Division is going to make a big charge tomorrow night to commerate the Declaration of war between england and germany We all hope that it will turn out asuccess The name of this village is Warloy Baillionand we have not had a bad time During the 9 days that we have been Billeted in it\n\n(82)\n","69":"\nAlbert\n\nwe are now a couple of hundred yards out of Albertand within reach of the enemy guns all last night there was a rollingBombardment and it was the worst that ever I have heard including the landing on gallipoli Star Shells were continually going up and remind one of empire day. up above our aeroplanes are Skipping through the air. now and again one will fly over head quarters and drop a message. there is 20 of our observation Balloons in the air and one of the germans\n\n(83)\n\nthe enemy shelled albert this morning when one comes into these french villages he wonders are the german a civilized race. albert is all in ruins caused by the German Shells I suppose before the war there was a population of 7 or 8 thousands and to house them all would take a great many houses. there is hardly one undamaged. the germans seem to try and Break all the Churchs. up here from where I am writing this I can look upon that was once a beautiful church. at the present it has Shell holes all through it and a beautiful Statue of our lady is hanging from the Stepple\n\n(84)\n\nwith its hands pointing to the ground this may indicate the down fall of Germany. one man was wounded this morning belonging to the 13 transport. we leave here tomorrow for the first line trenches\n","70":"\nanniversary of Suvlabay landing one year ago - -\nto day we were putting our equipment in rest gulleys on gallipoli waiting for the order to move out and charge and capture which we failed to do. it was won and lost again and the turks held it until the last\n\n\n\n(85)\n\nat this very hour we were listening to our warships and land Batteries Bombarding the turkish positions and nowat the present moment I am watching our guns Bombarding the germans positions. the artillery is violent. if one were to have asked me this time last year were I would be in 1916 I would have answered Still on gallipoli. our boys took 2 lines of trenches last night the germans were Shelling albert all last night we are now in TaraValley and may move up to the line tomorrow\n\n(86)\n","71":" Sausage gulley Somme\n\narrived in the above named gulley this morning from taravalley the guns in this gulley are many\n","72":"\nSomme\n\nnothing much Doing so far today the artillery are keeping a Steady fire on the german trenches our Boys are going to attack the germans tonight\n","73":"\nSomme\n\nlast nights attack very successful. our Brigade advanced 500 yards and captured the german trench without any opposition and took Some\n\n(87)\n\nprisoners who came through this morning the Bombardment was timed to Start at 9.20 and at that very sec hundreds of our guns Started. there was nothing But one mass of flames coming from the mouths of the guns and Death at the enemy. The roar of the Shells going through the air was Deafening the Sky was lit up with Bursting Schrapnel and Star Shells were up and Down in thousandsturning Darkness into Daylight\n\n(88)\n","74":" Somme\nfrance\n1916\n\ntime 2 pm\n\nwe are now lined up ready to go on the front line trenches the","75":" Brigade are having another stunt tonight. time 4.15 pm. after couple of hours marching we arrived at the D Stn But oh what a time we have had in reaching here. just about 20 yards out a Shell Burst within 7yards of the post and Ithought for the moment that we were all goners\n\n(89)\n\nBut I was the only one that was Doing anydamage\nwe hope the Boyscome off well tonight\n","76":"\nSomme front\n\nwe are now of the fireing line we have been in the line for the past 6 days. we leave Albert for Warloyon the above Date\n","77":"\n\nwe are now Billetted in the same place that we were in before we went intothe line mcafferyand were Both Killed in action\n\n(90)\n","78":"\nWarloy\n\nwe are leaving here this morning for pernoiswhich is 12 miles away. time 5 pm. we have not gone to pernoisBut are camped out under the trees in a village near Talmaswe are footsore and tired\n","79":" pernois\n\nwe are resuming our journey this morning and will reach pernoissome time this afternoon the Distance is 6 miles. time 2.30 pm. we have just arrived at the above village and they seem to be rather quiet here\n","80":" pernois\n\nStill in pernois there is of us remaining here for 10 days rest\n\n \n\n(91)\n\nBut I Dont think that Can be right as the first and second aust Division passed us going Back to the line. There is some talk of Capt phillips leaving the Battalion. not one of the a.m.care Sorry. hehis a rotter of the 1st water\n","81":" pernois\n\nCapt phillips leaves us in a few Days time for good thank heavens we are getting rid of him\n\n21st pernois\n\nnothing Doing to Day\n\n22nd pernois\n\ntime 1 pm we have just received\n\n(92)\n\norders to get ready and move by one thirty we are going Back to the same front line. remain at Talmastonight and go on tomorrow morning\n\n23rd Talmas\n\nwe arrived in the above named village at 5.30 yesterday afternoon we are going on this morning we camp in a wood tonight just outSide warloy. we are Dure in the line on the 28th of this month. lets hope we come out alive. this will make 6 times that I have been into the trenches and I have a Bullet mark for each time and one over\n\nG McClintock\n\n(93)\n\n24th August 1916\nVadencourt Wood\n\nwe arrived here last night and are camped in the woods just outside the village. from this position one has a great view of the surrounding country which is very Beautiful. I counted 35 of our observation Balloons in the air this afternoon nothing much Doing otherwise\n\nThe new M.O. gives a first aid Lecture this morning which wasvery interesting\n\nG McClintock\n\n(94)\n\nPte J Kingdon Esq\n\nperth\nwestern australia\n\n\n\n(95)\n\n25th Aug 1916\nVadencourt wood\n\nthere was another fall in Stars last night. god what is the AIF coming too. here we have men who have not seen more than days fighting giveing commands over men that left aust in 1914 if the old colonel was here he would cry when he seen how the battalion is officered. Why these men get preference Beats me and is certainly an insult against those men that fought in the landing at anzac no encouragement is given to the oldmen\n\n(96)\n\nand those that have 2 years Service those that received Stars last night were\n\nJ Allen old Battalion\nBrown old Battalion\nMorgan\nSmith 11th rein\nPatrick\nCole\n old Battalion\n 2nd rein\n\noh how thankful I will be when I get out of this army englandcan go to hell I will neverlift a finger again for her only for aust do wefight for now\n\nwe have received word that we leave here at 10 oclock tomorrow\n\n(97)\n\nfor albert\n\n25 Aug 1916\nAlbert\n\nafter three hours marching we arrived at albert. we are all camped out in the paddock and the ground will be our Bed.\nlooking from where I am writing this note one Sees nothing but long lines of transports of all Decriptions\n\n\n\n(98)\n\nfrom this position I can See 20 or 30 thousands horses and thousands of limber waggon guns motor and horse ambulance tents cookers and thousands of troops one cannot but praise the wonderful system of organization\n\n(99)\n\nthat exists in the British army. aeroplanes are sauring overhead and observation Balloons are all over the place. the 14th and 15th Battalions go into the trenches tomorrow morning. the is some talk that the 13th will not go in again on this\n\n(100)\n\nfront. our new MO is a fine chap and ought to go well under fire phillips has left for good and a good jobtoo\n\nRandell went to F A this morning\n\n(101)\n\ntime 7.30 pm\n\nBanney and I have just had a look at Bouzincourt there is nothing to see in the village it ispractically Deserted By the civilians population. one noticeable thing is that you can not See one place that has been affected by the German Shells\n\n\n\n(102)\n\nit is raininglike one thing and everything pointsthat we are going to get wet before morning\nWe are camped in the openfields \n\n(103)\n\n(105)\n","82":"\n\nSausage Gulley\n\nBack once more in Sausage Gulley after about 10 Days away things have changed in this valley since we were here last all the guns have moved up closer to the german lines there is not much traffic on this road now it all comes up the Boiselle rd. the 14th and 15th Btn went into the line last night the 13 and","83":" releive them tomorrow some time there is three Big guns on our right and every time they fire they almost makeones Stomach come up to his mouth\n\n(106)\n\nit is raining like one thing at present we all got Drenched this morning coming from albert who tobe our has Been given command of the 13 Battalion. he his a fine chap and one that all the boys like has gone to england to command one of the training Battalions\n\ntime 2 pm\n\nthe sun has come outand things point going to have a nice afternoon\n\n(107)\n\ntime 6 pm\n\nthe sun is now shining Bright and the guns are going like one thing the air is infested by our aeroplanes the germanare trying to Bring them Down with Schrapnelthe germans have started to Bombard our position from where I am\n\n(108)\n\nstanding I can See where they have just 4 Big Jack Johnsons. our guns have been giving them Hell this last 20 minutes There is nothing\n\n(109)\n\nBut the continual of iron The German have Started to lengthen their range the cause of the fire is some aeroplanes have Discovered a Body of huns\n\n(110)\n\ntroops coming up to reinforce those in the trench theywill have Suffered heavily in action.\n\n(111)\n\ngod help those who are under our fire. time 7pm The fight Still goes on the artillery is more active than at 6 pm. I am writing this account in Sausage Gulley we have only returned to it this morning after 10 days absence we are getting a\n\n(112)\n\nLively reception on our return to what we call our home are we Downhearted no not untill they come a Bitcloser and then I am afraid we will be. fritz is getting 3 Shells forevery one that he is putting over. they are all Jack Johnsons that are being\n\n(113)\n","84":"\nSausage Gulley\n\nmore Rain today and more Discomfort too there was violent artillery Duels last night the german knocked 2 of our 18 poundersout of action. The Battalion has received orders that they are going to releive the 15th at midnight and will make their stunt tomorrow night. The","85":" attacked last night and Both it and the 15 were cut up. Jack Brown paid us a visit this morning he has had \n\n(114)\n","86":"\n\ntime 7 pm. Things have just begun to Brighten up There is about 15 of our aeroplanes and about 50 observation Baloons in the air the Germans had 5 of their planes over this evening But they Did not venture over our lines and to good care to keep up\nSomething like 1000 feet. they will not show fight with our Boys if they can possableavoid it. fritz also has 4 Baloons up. we have just received word to Dump our Blankets on account of going into the trenches at midnight\n\n(115)\n","87":"\n\nthis afternoon the artillery officer Sang out to his men roumania has Declared war against austraia. give them a salvo and they Did. This is good news for us now we have things in the Balkans in our own hands we can now stop Germany from Doing any Damage in that particular theatre of the front. the germans have not Shelled the gulley today. sickparade was held at 2.30 pm noone was sentaway the Doc also gave a lecture to the Stretcher Bearers on the art of Bandaging we are sure to get a warm reception going in tonight anyhow lets hope no one gets hurt\n\nleft SausageGulley last night\n\n(116)\n","88":"\n1916\n\nonce again we are settled Down in the Dressing Station the same that we occupied when we were here a fortnight ago\n\ntime 7 pm. the Doc left here this afternoon to go to the front line trenches to have a look at a Dug out. if its is suitable we are going to make our D.S there then we will be in the front line trenches. has just received a notice from the Doc to pack up and go up to the line he has Desideredto occupy the Dug out.\ntime 9.30. we have at last arrived in our new DS and it is not too Bad things are quiet at present. We expect\n\n\n\n(117)\n\na busy night on account of an attack that the 13 and 16th Btn are making they are attacking farm again. this will be the second time that the Btn attackedit. last time the Btn Did well But were compelled to retire through the fault of another Battalion\n","89":"\nthe trenchs on the Somme\n\nthings have been very Busy During the night. the attack last night was a failure and our Boys have been cut up very Badly. in all we put through about 80 cases last night and some of the poor chaps are mauled about Something terriable I will not give any account of the attack\n\n(118)\n\n30th August\ntime 5 pm\n\nwe are being kept Busy again today getting more wounded in and others. we have about 8 stretchers cases waiting to be removed But I am afraid it is to late to get any more of them away tonight the amc bearers will take them in the morning. we are releived sometime tonight\n","90":"\n\nalbert\nonce again we are Back in albert and how pleased we all are to be away from that hell up there. one cannot write what he really thinks But this time has Been hell and no Doubt\n\n\n\n\n\n\n\n\n\n(119)\n\nwe left the Dressing Station this morning about 9 pm and as we were coming away light we Brought out a few Stretcher cases with us we did not Bring them through the Saps because they were to Sloppy and impassable to make way through them so what we Did Do was to tie a tringular bandage on to the end of a stick and Bring them over no mans land we all got across without any Damage. all the same a few Shells Droped pretty close to us of course they were not fired at us. if then the germanSnipers wished they could have Shot the lot of us But they let us come along our own way\n\n(120)\n\nand we allow them to go across unmolested that is if they carry a flag. we are leaveing here at 5 pm this evening for Warloy which we will Do in about 2½ hours marching and I can tell you I am none too strong for the journey my feet are aching and we have not had a change of clothes for about 5 days But we Dont cry we all grin and bear it. So are we Downhearted no I don't think So\n\n(121)\n\nFrance","91":" on the march to Rubempre from warloy\n\nleft warloy this morning at 9.15 for Rubemprewhich is about 8 miles Distance the time is now about 1 oclock and we have pulled up alongside of the road for Dinner. The Brigadier has just had us on parade and gives the Brigade great praise for their work on the western front. he said that if general Birdwood wanted a Brigade of aust to do a ticklish job he would Select the 4th Brigade. to Do it we will be in the trenches in a weeks time and where we are going is Ypres\n\n(122)\n\nwhere the Canadians have just left they are releiving the australians on the Somme. we will reach Rubemprein about another hours march. Snowy Gillman was killed in the attack on mouquet farm also Cpl Dingle Both fine Boys\n\ngillespie and Solomon missing\n\nthe 1st Canadian Divisional HQ are in Rubempre. passed through vadencourt and contay.\nthree Battalions are making another attack on the farm tonight lets all hope they\n\n(123)\n\nSuccessful because there has Been a good many casualties there allready and it is still inthe germans hands the Brig says that the allies have practally Bought Bulgaria over and that they will be on our side shortly. the Kingis finished and his successor says he wontfight against the russians so things in the Balkans are particularly Bright for the allies The British are attacking all along the line from Theipval to Guillemont tonight poor old fritz he his getting a roughtime of it lately. receiveda letter from mabs last night\n\n(124)\n\ntime 4 pm\n\nhave just arrived in Rubempre after seven hours marching from Warloy things are just the same here as when we were here last time the are plenty of canadian troops here at presentthere was a great hullaboloo in the Billet when we Brought the A M.C. cart in the yard madarm went crook because we brought the mule in and was throwing her arms about in all Directions and Shouting eventually we quietened her\n\npay Day tomorrow\n\n(125)\n","92":"\nRubempre\nSomme District\n\nreceived 20 francsthis morning from D Compthere is a parade this afternoon at 4 oclock when general Birdwood will present military medals won in the recent push on the Somme there will be a good many given out we remain in this Billet for a few days and then go on to Ypres Salient 33 on Sick parade this morning no one sent to \n\ngeneral Birdwood presented Military Medal Ribbons this afternoon Cock Wild received his. the ceremony was a simple one there is a\n\n(126)\n\nBrigade concert at 7 pm. Sgt Clark and Joe Banney are Both recommendedfor a Military Medal Both belong to the 13th Btn a m c good luck to them they Both Deserve what they get may it a victoria cross. The Doc is for a D.S.O. he also Deserves what he gets also\n\n(126)\n","93":"\nRubempre\n\nnothing Doing today we have received order that we resume our march tomorrow morning at 9\n","94":"\nMontrelet\n\nafter about 6 hours marching we have arrived in montrelet and things point that this is a Dead place nothing unusual occured on the march\n\n(127)\n","95":"\nMontrelet\n\nnothing Doing today raining a little we leave here in the morning\n","96":"\nGezincourt \n\nwe marched from montrelet to the above named village the Distance being 6 miles. the place is a little larger than those which we have passed through During our Sojourn on the Somme front line also entrain here on the 8th for the north\n\n(128)\n\nThis is the Property\nof Pte G TMc Clintock A A M C\n17th Btn\nLate 13th Battalion\n12th 11 1917\nBelgium\n\n5th Sept 1916\n\n(129)\n\nMontrelet\n\nraining here today this village is only a small one and you cannot buy anything in it every village that we have been Billeted in Seems to be the same we are leaveing here tomorrow morning for somewhere we may and we may not entrain here for Ypres\n\nnothing else\nAu Re Voir\n\n(130)\n","97":"\nGezaincourt\n\nnothing much Doing here today we have received Definite orders that we leave here tomorrow morning we entrain at Doullens for Ypres which is almost 6 hours run from here. the 1st and the 2nd anzac Divisions are in the trenches at Ypres we are supposed to go in on the 11th of this month we will strike the gas there. the Somme Battle is going good for us\n\n(131)\n","98":"\nBelgium\n\nThis morning at 6.15 we left Doulleens and landed at our Destination at 12.30. after having Dinner we started to march for this village the name of which I have not found out at 2 pm the Distance we had to make being about 3 miles.\nthe train journey was very nice after travelling about the Somme District none of us are sorry to get away from there although we all realise that the\n\n(132)\n\nthe stouch about these parts are no joke. the gallant Canadians have withstood the German onslaught for the past 18 months and I am surewe can do the same as them. time 9 oclock nightat the present moment there is falling heavey artillery fire going on upin the line But not so bad as round pozieres we have received a gas alert and all the men are waiting with their gas helmets for the gas to come close enough to us this place certainly looks as if it has not Been affectedBy that Deadly poision\n\n(133)\n\nit turns anything a yellow color and perhaps will Do the same to us that isif it comes close enough and we are sure to get it hot and strong in the Ypres Salient where the australians are now fighting. General Birdwood says if we can get our helmets on in 9 or 10 seconds we are allright we not too the germans dont allow us enough time to get ready for them. I wentto the Y.M.C.A hut tonight and heard\n\n(134)\n\nDr McGrath lecture on the allies east and west and the present situation the lecture was not of a very enlighting character.\n\na yarntold By Dr McGrath tonight.\na general was paying a vicit to the front line trenches and was very Strict about the men wearing their helmets. Coming along his AD.C said excuse me Sir you have not your helmet. the G turned in Disgust and startted Blaming\n\n(135)\n\nothers for not Supplying him with one Before he left H.Q. Seeing a pte Standing close By the called out come here my man Show me your gas helmet Sorry Sir said the pte I have Strict orders not to give my hat to any Body. yes I know that said the G But you can get one from Q.M.S this Done the G walked round and spotted a outside his his Dug out without his helmet in great rage the G\n\n\n\n(136)\n\nsaid where is your gas helmet the being taken unawares try to say that it was inside. fancy seeing an officer without it I could expect to find the ptes without one But an officer its outragerous here take my said the general and let meSee you put it on while I count three 1 2 3 the gave one heave and pulled out 2 pair of Dirty socks this is a Dinkumtale\n\nrather hard on the general concerned Dont you think\n\n(137)\n\ntime 10 pm\nI am soon going to Bed and or try to have a good nights rest au re voir\n","99":"\nin Belgium\n\non the Ypres front there is fairly heavey artillery Duels going on we are 10 miles behind the line and I canhear the big guns Bursting very plainly I am led to believe that the germans have some Big guns on this front there is one thing certain and\n\n(137)\n\nthat is theycant be any worse here than on the Somme where there is a violent Battle now raging and going well for the allies. the Doc said that I must take some for my cold he heard me coughing last night. wouldent it be a shame if he Sent me away to hospital\n\nThere is a concert onin the Y.M.C.A. hut tonight which I am going too\nhave tried to Gain admittance to the concert But one cannot get within\n\n(138)\n\n20 yards of the Door it is packed like sardines\n\n(139)\n","100":" 9th 16\nReninghelst\n\nStill resting nothing Doing here at present this place is better than those which we have just left behind us in france we are now in Belgium\n\n(140)\n\nand there is a lot more english Spoken here than france. We have no idea when we go into the trenches here But I Dont Suppose it will be long. received a few papers from home this morning But no letters\n\n(141)\n","101":"\nnothing Doing today we are Still in Billets\n","102":"\nvery cold here today nothing Doing otherwise\n","103":"\ntoday major general Cox\n\n(142)\n\npresented congratulation cards to those who Displayed great gallantry in the recent fighting on the Somme Jo Banney and the Doc got one Joe will get a m.m and the Doc DSO\n\n(143)\n\nThey Both Deserve all they get and I only wish it was a VC for them\n","104":"\ntoday there is a heavey wind Blowing and by Jove it is cold I my little Shorts Shivering\n\n(145)\n\nlike one thing we are going into the trenches on saturday and this will be our first experience at Ypres and from what I can hear this will be the of the lot\n\nBeech had to postpone his journey\n\n(146)\n\nto the on account of the rair he might get his feet wet he is suffering from consumption\n\n(147)\n","105":"\nnothing Doing today\n","106":"\nI have just received orders that I am to go into the trenches this afternoon Davis and foster are coming with me I go to the Dressing Station of the 75 Canadian Infantry they are making a Stunt tonight\n\n(148)\n","107":" 1916\nin the trenches at Ypres\n\nwe arrived here last night at about 9. nothing unusual occured on the way outno one being wounded. the Canadians carried out a Successful raid on the enemys trenches last night at midnight our guns opened up and Bombarded the german positions very heavely our casualties were very Small only one man killed and 10 wounded the 13 comes in today this front is very quiet compared with the Some. The Bombardments are nothing like what it isup there\n\n(149)\n\nthe Dressing Station is in what is known as the Brasserie it is a house But places the roof has been knocked in from the concussion of the guns. not one Shell has hit it just close by there is a cemertary where many of our comrades from Canada are Buried\n","108":"\nYpres\nnothing Doing today Everything quiet at the Base\n\n(150)\n","109":" in the trenches\nYpres\n\nThings are very quiet today not a shot being fired this afternoon with Beech and mcCarthy I went gathering Black Berries. the Doc is going to giveSmith the head q cook to make some jelly from them they ought to be tray Bon. I am up tonight on Duty\n","110":"\ntrenches\nthere has been nothing important Doing here to day the time is now\n\n(151)\n\nabout Seven oclock and there is a Belgium Battery close By just giving the germans a little Straffing we have only had one man wounded since we came into this Dressing 3 days agoany how I hope that none comesat all we Do not want to See any one wounded\n\n(153)\n","111":"\nin the trenches at Ypres\n\nas usual things have been very quiet indeed coming from the Somme one could not beleive that things could be so quiet on certain Sectors of the front Joe Banney has been in the front line since we came into the tenches. today the a.d.m.s. was round and he wanted to know where the Details were. the Doc told him that he was in the front line he has now received orders to withdraw him at once Bill Clark returned from England last night he told us that he has had a Bonny time I am now wishing for my turn to come along quicker than ever\n\n(154)\n\nSince coming into these trenches it makes it the seventh time that I have been into the fireing line and carry a Bullet mark for each occasion I suppose I will be in many more times before the war is finished whenever that may be I am sureI have no idea But there is one thing certain and that is I will not be Sorry when the guns fire their last Shot and we all return to those that are dear to us. I went to head quarters 3 times today with the sick reports. wrote to Essie mabs and mrs Cooper a few Days ago\n\nSigned pteMcClintock\n\n(154)\n","112":"\nin the trenches\n\ngeneral Birdwood looks through the lines this morning. nothing much Doing otherwise. the huns trew Schrapnel along the road this morning. last night one of our observers Spotted an enemy machine gun possie our guns have now opened up on their position its good Bye machine gun. was paid this morning we have only had three men wounded since we came into the trenches last Sunday so the reader can guess things are very quiet nowI went to H.Q. 3 times today\n\nold Bill Clark has a Shave\n\n\n\n(156)\n","113":" in the trenches\nYpres\n\nToday the germans have been throwing some heavey Shells trying to find a Battery. there are a great many Belgian Batteries about here. our guns opened up on fritz today itsmy up tonight oh Dear there is no rest for the wicked\n\nBill has another Shave he will soon have his face shaved away\n\nno letters from home yet\n\nau Revoir\n\n(157)\n","114":" in the trenches\nnothing much doing today only a few Shells Dropping round all week at the Base\n","115":" trenches\nYpres\nthings are very quiet\n\n26th trenches Ypres\nThe Germans Shell all around us this afternoon But none hit the Brasserie no one hurt this was the first time they have put any Shells about the Dressing Station Since we came in 10 Days ago. the 15th Battalion are going to carry out a raid tonight on the german trenches we hope they are success. I went to the 12th FA this afternoon for\n\n(158)\n\nDrugs but did not get any they are coming along later\n","116":" in the trenches\nYpres\n\nthings have been rather lively here During the past 36 hours the raid last night was a success our Battalion the 13th are going to make a raid tonight lets hope they make the germans run home to berlin there is rumours that the germans are avacuating here I dont know if there is any truth in the report But it is strange that every time a raid is made the Enemy trenches are all\n\n(159)\n\nways found empty we will Soon find out if they are leaveing or not. received moregood news from the Somme front this morning Thiepvaland Combleshas fallen into our hands we will Soon be pushing through Bapume there is a rumour that we are going to the Somme. I wouldent be Surprised at all we have had about 8 men wounded in 11 days So the reader can guess how quietthings are on the particular portion of the front I can assure the reader that this place is much Better than the Somme up there it is just Hell we are gaining great victories over the germans But have we Stopped to consider at what a cost\n\n(160)\n\n things look allright on paperBut we are looseing thousands of our Best men\nStanmeagher of the 45 Battalion is in the DShaveing afternoon tea with us\nJoe Banney is Still in the lines\nour Doc has been on to me about Smokeing to much he means well But I find it rather hard to knock them off I went to the 12 FA this morning for more drugs But none was available\n\n\n\n(161)\n","117":"\nYpres\n\nthe","118":" Btn raided this morning at 3 oclock there was not much Bombarding before the attack our Boys succeeded in Entering the german Second line the germans did not fire a Shot But our own artillery got amongst them and wounded a few and killed a couplethey could not be Blamed for doing this as the men had orders to go into the first line of trenches not finding anyone there they thoughtthat they would work into the Second resultcaught by our own fire\n\nThe reader no doubt Blames the artillery for this But they have their orders to fire on a certain\n\n(162)\n\nSquare and no one is Supposed to go on to it we are Supposed to be releived tomorrow at the present moment their is some artillery activity going on on the front line.\n\nmacarthy is making pankakes for tea we are liveing like fighting cocks just now. for Dinner we had roast Beef Baked potatoes tinned fruit and Custard and coffee oh no we do not allways live like this at the Somme we had only Biscuits and water for five Days\n\n(163)\n","119":" in the trenches\nYpres\nnothing Doing\n","120":" in the tren\nYpres\nall guns are quiet today they are getting cleaned up ready for the raid that is to take place tonight By2 Battalions the 45th and 48th a canadian Battery came up this morning and has taken up a position ready forthe fray tonight this Battery alone will fire 800 rounds poor old fritz he is getting knocked about lately this will be the fourth raid we have made within a week I carried a Despatch this afternoon to la Clytte for the M.O. all well at the base But I am not there to enjoy it\n\n(164)\n","121":"\nin the trenches\n\nlast nights raid a success 5 prisoners taken things are very quiet today \nJoe Banney\n Joe Banney returned to the Dressing Station from the trenches my night up tonight.\nreceived more Brilliant sucess at the Somme\n","122":"\nYpres trenches\n\nThere is nothing much Doing today only a few shots being fired one has nothing to put in a Diary here things are so tame I went to the 1st canadian this afternoon \nBut\n for But did not get\n\n(165)\n","123":"\nYpres trenches\n\nStill very quiet on this position the germans \nto\n opened up with machine guns last night and things were pretty Lively for a few moments theywere covering a working party of theirs they put up work and our guns Blew it away this morning\n","124":"\nYpres trenches\n\ngeneral cox was round this morning he has been in our lines pretty often since we came here only a few shots going today\n","125":"\nYpres trenches\nnothing Doing today\n","126":"\nYpres trenches\nthings are quiet here today Imay go into town this afternoon to Send the maltese cart out for the medical Equipment\n\ntime 3 pm\nI have just received orders to go and get the cart\n\ntime 5.30 pm\nhave just arrived at the transports foot Sore and wearey I am sleeeping in the Band hut tonight\n","127":"\nreninghelst\nI have all the medical Equipment unpack ready for the Boys when they arrive they should reach here about 6 oclock\n","128":"\nreninghelst\nnothing Doing Beyond church parade it has been raining all day received 40 francs today the Band are going toplay a programme this afternoon\nwe thought that we were going to have at least\n\nthree weeks Spell\n\nBut I have just been informed that we are going to receive the first Division in a weeks time and they are going Back to the Somme why do they keep thesethings a secret\n\nBy jove I dont know what our leaders think we are. one thing they do think and that is we love fighting. they are going to make fight while the good weather is with us. I dont think there is many aus who want to go back to the Somme\n","129":"\nreninghelst\nBelgium\nnothing much doing today Casey and went to England Lucock transferred to D Company as temporary corporal","130":"\n\"\n\"\nnothing much doing today only the usualparade J Banney goes to orderly room re decoration","131":"\n\"\n\"\nJoe was presented Brig general Cox\n\nwith the Military medal he Deserves all he gets Bill Clark gets the m.m also. another fine chap\n","132":"\n\"\n\"\nwe are leaveing reninghelst this afternoon for the trenches we have only Been out 4 days and now we are at it again we are reserve Battalion this time\n","133":"\narrived at 7 pm last night without any one getting knocked\n\nwe are Billeted at a place which was once the King of Belgiums countrySeat But it will not be so again. it is knocked almost down to the ground\n\nThis morning I went up to the fireing line with Doctor to holdsick parade up there. there was only 2 men to see one was marked no Duty and the other Duty the Distance being about 4 miles return nothing occured on the journey looking from where I am writeing this note I canget a good view of ypres But one can see nothing But ruins. ypres was once a Beautiful city what will those think when they return the their past homes one thing is certain and that is they will\n\nnever be to thing of the germans without a thought of vengence. Mccarthy went to Bailleulthis morning\n","134":"\nin the trenches at Ypres\n\nthe time is now about (8 oclock night) this morning I came up with the Doctor to hold sick parade and he Desided to leave me up here to look after the men with Sores on them and there is a good many of them. I have pills of all Description with me also ointments\n\n\n\nand to make Solution in fact I am an emergency Doctor\n\nI am camped in the tunnells whichare about 40 feet Deep and it would take a Big Shell to make any affect on it It will Do me for the Duration of the war and I am no hero McKerlie and I went Down to HQ for my gear one thing I left behind was a Basin which was very important the Distance from here to HQ is fully three miles and takes about 75 minutes to walk this afternoon the huns threw a lot of rum jars over no Battalion men hit McCarthy returned this morning minus\n\nhis mostaucewhich makes him look a knut. received word from the Base yesterday cablegram Despatched to head on the 7th of the month money oughtto be in London By now. my leave Should come in about 3 weeks time the Sick parade this morning was fairly Big. three men Sent to ambulence which is at Bedford house.\n\nCane turned up this morning. he was tried and given 21 days no 2 field punishment that means forfit 21 Days pay at 6\/- per \n\nnothing more at present\n","135":"\nYpres trenches\n\nthings have been a Bit Lively today. no one hurt news has just come trough that 5 of our men have been wounded at the ration Dump one 16th Battalion man killed\n\n1916\n16th Oct trenches\nYpres\n\nthings have Been rather Brisk today fritz has been putting a good many Big Shells across our lines and we have replied vigeriously.\nthe huns Brought Down\n\n15th Oct 1916\nin the trenches\nat Ypres \n\nthere was only 5 men on Sick parade this morning one was sent to F.A. with Scabies Things are quiet at present there has only Been a few Shells from the germans come across.\n\nBill Clark occampioned the Doctor this morning\n\nhad Stew for Dinner I wrote to the London Bank yesterday Inquiring if any money had arrrived from home am sending another card to the Base to find out about J Corrigan I have three foments to do at\n\n4 oclock.\nnone of the 13th wounded up till the present (good luck too) Slept very Bad last night (cause unknown)\n\nWilliam Brought me 3 cakes of chocolate and 2 pkts of cigarettes this morning\n","136":"\nContinued from opposite page \n\nour aeroplane which was well over the german lines unfortunately he fell on german ground the conduct of our airman is wonderful the come out amongst us and are Subjected to very violent fire from the german anti aircraft\n\nguns. But they just ride through the clouds as we would on parade Every British Soldier will allways Be proud to lift his hat to men of the royal air Service \n\nJoe Banney came up with the Doctor this morning. the Doc left here at 5 oclock he Dinedwith the officers McCarthy has not Shown his face to the huns yet\n\nthe time is now about 8 oclock and we are just going to make Some coffee before \nre\nturning into Bed\n\noh dont we Soldiers live high oh I am Sure we do But at our own expence I have Spent about 20 francs Since coming into the trenches\n\n opinion on concription\n\nin a couple of Days time we will be called upon to vote yes on the concription Bill But will the troops vote yes. I say they will not and quite right too we ourselves are volunteers and will not help to force men against their wish. if they cannot See that it is their Duty to come let them Stop away. a very unjust thing about the voteing is all under 21 years of age are not allowed a (vote)no But they can and are allowed to come away and give their lives this is not takeing into consideration\n\none noticable thing about the Exemptions are that all men who are the Sole Support of their parents are Exempt But what about those who were the Sole Support of their parents and came over here and have Died for their country and those that are liveing will they be recalled to look after their aged parents oh Dear no they are now soldiers and do not count we all want the allies to win this war and we will win there is not the Slightest Doubt about that\n\nBut I think that we can do it without concription in australia Billy Hughes is going to do himself and his government a lot of harm he Seems to has caught that complaint that we do not want in aust and that is to much wait and See\n","137":"1916\nYpres trenches\n\nnothing much doing today\n","138":"\nYpres trenches\n\nthe usual artillery Duels today no one wounded or killed about 5 men on Sick parade all well\n","139":"\nYpres trenches\n\nit has been raining all night and today the ground is very sloppy. I amgoing Back to Head Quarters this afternoon\n\ntime 1.30\nI have just arrived at H.Q. of course wet through to the Skin things have been Excepionly Quiet here to Day\n\nwe leave here tonight for reninghelst\n","140":"\nReninghelst\nBelgium\n\ntoday is a Beautyful one the Sun is Shineing and Should Dry the ground up first rate one of Fritz aeroplanes came over this morning But he was greeted with about 500 Shots from our anti aircraft guns which were to warm forhim he went home to the Kaiser we leave here tomorrow morning for an unknown Destination today all our gas helmets and Steel Helmets were takeing from us all Surplus winter clothing have to be returned to the Q M we all are very curiess to know where we are going to Some Say Egypt Solonika India Blighty or the Some\n\nI wonder which of the 5 it will be we go for a Bath this morning\n\nSCanlon put back in the Company the reason I dont know mail last night But no letters as usual for me\n","141":"\nreninghelst\n\nwent for a bath this morn nothing else Doing\n\nSteenwerck\n\nwe left reninghelst yesterday morning at 9 oclock and arrived at the above about 5.30 the Distance was about 10 miles\n\nthis place is tray Bon last night Clark and I were called out to attend a Sick man in D Coy it was Thompson\n\nwe get paid this afternoon another mail arrived this morning\n","142":"\nSteenvorde \n\nthings are quiet today we are having Dinner at 6\n","143":"\nSteenvorde\n\nlast night Supper was great Success\nthis was the menu\ntomatoes\nSalmon\nroast Beef\nchipped potatoes\n\ncakes\ngrapes\napples\noranges\nchampagne\nBeer\nwine\n\nSo you can bet we had a gay time there was seven of us present there names were\n\nPauling Bombers\n D Coy\nMcCarthy AMC\n Bombers\nMcClintock AMC\nBlizzard D Coy\nChristie Sanitary Section\n\nwe are thing of haveing another supper tonight beforwe depart on our journey we are leaveing here at a 11oclock tonight and march about 5 miles and entrain at 5 in the morning for an unknown Destination the Somme is favourite 100 to 1 is the Betting 20 to 1 athens and Blighty 6 to 4\n\n24th continued from previous page\n\nMcCarthy and myself had leave Steenvorde had a hot Bath today at the Military Bath rooms wrote to E Corrigan that afternoon re \n\nI was presented with 2 good Stripesby capt marks\n","144":"\nSteevorde\n\nthe weather here today is very it has been raining for the last 48 hours things are all packed away ready for our Departure tonight McKerlie leave has been cancelled on account of a particular friends of the colonels wanting to go to Blighty\n","145":" on trainEn rout for the Somme\n\nat 2.30 this morning we left Steenvorde for an unknown Destination we Entrained at 5 am we passed through Calais at 10.30 Bolongne at 11.15 we are Steering Straight for the Somme the country we are passing through is mostBeautiousand Some of the Best agricultural ground that I have Seen for a long time. passed Etaples around 2 oclock also paris plage we expect to reach our Destination at 4 pm and then march about 4 miles to our Billets\n\narrived at pont remeny and marched to Vouchelles \n","146":"\n\nhad a good nights Sleep after our train journey Joe Jim and myself are going into Abbeyville this Evening it is three Kilos away and we have to go per foot\n\nTIme 7.25 pm\nin an Abbeyville Restaurant\n\nhere we are again only had a feedan hour ago and here we are again looking for more Joe says he feels rather hungary he is Simpley Starving and Do you.know I canhardly eat anything at all they will force me to Dine with them I wish they would not .so much and \n","147":"\nVouchelles\n\nthings are rather tame here today I went to abbeville last night and was impressed with what I Seen there it is the best place that I Been in Since I arrived in this country Some 5 months ago. about 50 on Sick parade this morning one goes to FA\n\nheard on Sick parade\n\nright let them come. the words are addressed to one of the amc BoysStanding at the Door with the names of the who wish to See the Doctor. very good Sir.\nin comes the first.whats your name, - patient SmithSir.\nm.o. yes what are you complaining of - patient kindney troubleSir\nm.o. how do you know its kidney trouble who told you you were Suffering you ought to know that you come here for me to tell whats wrong with you -patient yes Sir But - -\nm.o. yes I know all about that lets have a look at\n\n\n\nyour back and See if I can find any trace of Kindney Disease -patient, will I take my coat off Sir.\nmo yes thats right just hold your Shirt up there.here the mo taps the patients back Several times Does that hurt - patient no.\nmo Does that, and giveing him a harder tap further up the Back - patient oh yes Sir.\nmo right put your coat on. - the patient Starts to dress again.\nmo how long have you noticed your kindneys were out of order\n\npatient, about a month Sir.\nmo why Dident you come to me before and have it looked at -patient, I Dident think it Serious enough Sir.\nmo were you ever troubled with your kidney - Patient yes Sir I was in hospital for about a month with them Before I enlisted and when the cold weather comes the pain at times is unbearable.\nmo yes But Did you not think at the time you going up you would not make a good Soldier. - patient I thought it would wear off Sir.\nmo what reason did you have to think so -patient well Sir I thought the warm climate in Egypt would Do it good\n\nmo But Surely you Did not Expect to Stop in Egypt all the time - Did you you know there is not much fighting going on there and you came away from australia with the intentions of going anywhere you were Sent. Isent that right - patient yes sir.\nhere the mo goes to his medical orderly and they put their heads together and Decide to give him a no 9 and Duty. \nIt was found out laterthattherewas a 15 mile rout march\n","148":"\nVouchelles\nnear Abbeville\n\nraining again today fixed Lieut Brown up all quiet at the base. But I am not there\n","149":"\nVouchelles\n\nanother patient to look after Lieut Perrysprained his knee coming from abbeyville I have to see him and Jack Brown at 8 tonight Still raining here\n","150":" 10 \/ 16\nVouchelles\n\nStill raining here and no Sign of clearing away \n","151":" 11\/16\n\nagain we have started to march about France we left Vouchelles this morning arrived here at 1.30.\nthe Distence was Eight miles the Name of thisvillage is we leave again tomorrow\n\nBelloys","152":" 11\/16\n\nat seven this morning I left with the Billeting party to make arrangements for the water Supply for the Battalion I testthree seperate wells and passed 2 as fit for Drinking and condemned the other one. the name of this place is Belloys-Sur the Distence covered to Day was 10 miles per Bike.\nThe Battalion arrived at 5 oclock\n","153":" 11 \/ 16 Belloys\n\nmade another testthis morningat Brigade HQ and passed the\n\nwater fit for Drinking after chloration we were paid 40 francs last night.\nwe are Supposed to Be here for Seven days its a rottenposie to be in all well at the Base\n","154":"\n1916\nBelloys-Sur \n\nthings have been rather quiet here today I went to pickingny with Jack this morning the Doc asked me to go and put foments \nof\n on a couple of the civies\n\nin the village. they were to old women one was about 90 and the other 80 or more the are very Bad with Septic Sores I will go again tomorrow and put another foment on each of them\n","155":"\nBelloys-Sur \n\nthis morning I went with the Doc into a village about 2 miles away to holdSick parade at the machine gunners and trench mortarsno one turned up I fixed Both my civies up this morning they are looking fine the one with the arms ought to be right in a week But I am afraid thatI will not be\n\nhere to look after them\n","156":"\nBelloys\n\nnothing Doing today\n","157":" Belloys\n\nthis morning I left Belloys for Rehemont the Distence Being 25 miles We came as far as amiens on the Bikes and came from there on the train\n","158":"\nRehemont\n\nthe Battalion are Due at 2 this afternoon. the water is all good in the village\n","159":"\nRehemont\n\nthings are Dull here today still raining. \nall well at the base\n","160":"\n\nRehemont\n\nthings are very quiet here today there is a rumour going round that we are not going into the line But are going to do fatigue work while the other 2 Brigades go in the trenches\n","161":"\nRehemont\n\nthings are all A1 at lloyds its still raining in fact it has been raining ever Since we left about a fortnight ago and there is no out look of it clearing off oh what a time we anzacs are going to have in france when the winter Does come propely there was Seventeen thousand Sick cases alone pass through the canadians hospitals in one month\n","162":"\nSomewhere Nearthe trenches\non the Somme\n\nWe have just arrived at this from Rehemont which is about 12 kilos away we left Rehemont at 9 this morning the time is now 4 oclock there is 2 companies out of each Battalion in the Brigade Doing fatigue Duty. we are camped just By Fricourt wood where there was Some Heavey fighting at the Beginning of the Somme offencive. looking from my tent one cannot But wonder and certainly cannot praise the wonderful organization that I am watching at the\n\nthe present moment there is a road not more than 800 yards away and there is allways 10 miles of traffic on it - motor lorries horses transport motor ambulences horseman and many other things to numerous to mention. I thought that I had Seen the wonderful way the British army work But I am now Sure that I knew nothing and Seen less Before today when I arrived in the valley. all last night our guns were pounding at the huns for all they were worth there is not the Slightest Doubt about it that the germans must be completely Demoralised By our Shell fire The Canadians advance to day and are Still holding the ground now the french Scored a Success on the right\n","163":"\nFricourt wood\n\nthings have Been pretty Busy here today the artillery are Still pouring iron into the huns poor fritz. today has Been one of the Best that I have Seen for the past fortnight. as I Sit and write up todays Events there is one thing which appeals to me and that is the Limber waggons and horses that are passing notthat they are paintedpretty But Because the amount mudthey are carring the the wheels a chockablock the axls the same in fact the whole waggon is covered with mud and there\n\n\n\nis the horses and the harness that they wear they are every Bit as bad as the waggons the mud is awfuland many of our Boys are suffering from trench feetwhich is not the Best of Diseases that trouble the troops. I met Beatty Moffats Brother this morning he is inthe 17th Battalion and told me that most of that battalion were Suffering from trench feet and the Doctor Declared them unfit for further active Service on this attack I met young McKer from Bathurst yesterday he was marching along the Road with his Battalion and called out hullo mac how goes it must Be 8 years ago Since I last Seen him its marvellous how he knew\n","164":"\nin Death Valleyon the Somme front\n\ntoday has Been rather a Busy one for me at 10 thismorning I took Sick parade over tothe DAC Doc he Sent 2 men to FA there names were and Kebblewhite all this occupied the Best part of the morning and then I had to take them to the 5th field ambulence which is notless than miles return this afternoon I went with mr to the Doc I am glad to say that there is nothing wrong with this fine chap the Battalion passed about oclock they are gone 3 miles further into the valley\n\nwe move up to them in the morning at 8 am things have Been very active all day our guns are still Supplying the germanswith iron rations from where I am siting I can count thirty Balloons on the french and British posts and about 40 aeroplanes (ours of course) fritz only Dares to come out on a moonlight night this Battalion are going into the line on last night we were told thatthe germans carried out a zepplin raid on London with 37 zeps and caused 4000 casualties and there was 6 zeps Brought Down this will make our men more eager to get at the huns why Dont we Bombard open towns the Same as them. our mottoShould be an Eye for an Eye\n","165":" 1916|\nDeath Valleyon the Somme\n\nBy jove its coldhere today one can hardly feel anything at all on account of our limbs being numbed So much about 4 this morning our artillery opened up on the germans and they have not ceased fireing the time now is 4 pm our troops captured 500 prisoners and the English 3500 last night we have Bapume cut off on Both flanks we should capture it within 3 Days from today we were Supposed to move this morning But it was cancelled and we have no idea when we will move\n\nnow.\nThree men were Sent to F ambulence this morning thier Names be Hansen and who had a V.C I have Sent all the Sick reports along to old Bill by pte Fordwho goes his way tonightSometime nothing more to report all well at the Theatre. Theatre of war I mean not the one in Castlereagh St Syd\n","166":"\non the Somme\n\nI have now rejoined the other 2 Companies of the Battalion we left Death Valley at 9 this morning and marched about miles to wherewe are now camped I arrived at 4 pm with the water cart\n","167":"\non the Somme\n\ntoday is one of the Best that I have Seen for the past month or So the Sun came out and Bright this morning. No casualties in this valley from Shot or Shell Bill Clark was Evacuated this morning to FA and reccomended\n\nBy the Doctor for aust I hope that he has the Luck to get through Because has Done his Bit as much as the Next one has au Revoir Bill\n","168":"\non the Somme\n\noh Christ its cold today when we woke up this morning the frost was on the ground 2 inches thick and our feetwere all frozen By jingo it was cold and no Doubt about it the time is now 2.30 and the frost has all melted and the ground is very muddy and sloppy\n\nindeed how we are going to Stand a winter here I Do not know why the men will not be able to Stand the cold Just take this morning for insance it was you might say the first cold Day that we have had and the result was 45 men reported Sick out of the 45 there was 2 Evacuated to F.A During one month there was Seventeen thousandSick cases alone pass through the Canadian Stations Capt say he is going to Sleep with us tonight wont he have a good Sleep I Dont think. I willcough all night long. yesterday Clark went away and Since then I have received the Biggest Set Back that Ireceived Since joining the army over 2 years ago\n\na 12th reinforcement man has Been reccomend for promotion to corpral over 2 of us. why or what for I Do not know. Workman is all right I have nothing against the man But I Do Blame Capt who Does not in this case give justice to whom justice is Due. when Workman went to See him yesterday he told the Doc that there were 2 men Senior to him in the AMC But the Doc saidoh you are the Naturaly I am annoyed at this promotion and why Shouldent I be. anyhow there is one thing Sure and that is that I have allways Done my Best and if I cannot get along without crawling well I will allways remain a private with a clear mind\n","169":"\non the Somme front\n\ntoday is not a Bad one But there is Still plenty of mud on the ground we are going to remain here untill Dec 15th then we go out for a month or more a couple more men Evacuated this morning there is a great manySick men about the camp now there was 56 on parade this morning\n","170":"\non the Somme front\n\nthere has not been much Doing today\n\n\n\nfritz has Been putting a few more Shells on the road today But I Dont think he hurt any Body at all a couple of Days ago he Shelled the road and killed 6 horses and 2 men and wounded three men this part of the line is very quiet considering that it is a Sector of the Somme its nothing to what pozierers was one thing it could not be any worse the time is now about 9 pm and and old fritz is at the road again he only puts a few Shells across and then gives up he has not to many Shells to Spare the position that we are now in is about 4 miles from the front line\n\nand he Does not Shell us muchthis goes to Show that he must have his guns a long way Back Because he is afraid of us making a Big advance and captureing the lot. fifteen thousand huns passed through our compounds last week as prisoners of course I am going to give up nowand Dream happy Dreams of the good times gone By.\n\nall well on the base\n","171":"\non the Somme front\n\nthings have not been too Busytoday fritz put a few more Shells on the road this afternoon I Do not know if he managed to catch anyone. lets hope not. I am not up to the mark to day as I have a Slight touchof indfluenza which makes things more than uncomfortable indeed no word from Bill Clark yet no Doubt he is in a cozy possie somewhere in France or Blighty nothing more\n","172":"\nStill on the Somme front\n\ntoday I Seen the first aeroplane Brought Down unfortunately it was one of our own I Should Say that it was up 5000 feet when it commenced to fall to Earth and as it fell it was turning over and over and would not have given a penny for the mens lives But wonderful did Happen Sometimes and one certainly Did Happen today because neither of the 2 men were killed the observer had compound fracture of the leg while the pilot\n\nreceived a Bullet in the head I Do not know wheather it was Serious or otherwise. the time is now 7.30pm and at present there is a very violent Bombardment going on By our guns By all appearence there is a Big attack about to be launched By our troops poor old Kaiser Bill Ill Bet he is Sorry that he started the war one thing his troops must get an time from our gunswho are to Be pitiedrather than Blamed\n\nat Seven tonight we received orders to pack up\n\nas we are leaving here tomorrow morning Between 8 and 9 oclock we are going to Carlton Camp wherever that might Be the Maltese cart is now packed and ready for the tomorrows Journey Influenza has not Improved at all\n","173":"\non the Somme front\n\nnothing much Doing today fritz put a few Shells over last night right in amongst the Boys tentsBut Did not hit anybody\n","174":"\non the Somme front\n\ntoday we came to Carlton Camp which is about 3 miles from the front line the Brigade go into the trenches on the 30th nothing Else Doing\n\n25th Nov 1916\nSomewhere\n\nthis morning Capt ShierlawSent me to field amb\n\nand marked me Chronic Bronchitis I left the Battalion about 9 this morning and went to the 4th FA per ambulence car and oh what a rough ride it was too afterleaving the 4th FA we were takeing to Quarry Sideing and remained there untill 6 oclockwhen we entrained for the Clearing Stn arrived at the 5th FA about 7 oclock and from there we were put on motor lorries and Sent tothe CRS where I am at present I Do not know if I am going to remain here untill I am right or not\n\nI am hopeing that they will Evacuate me to Hospital as I am Sure that I will not get cured at this camp I have been Suffering from this Complaint for Some months now and this is where a man is put to get right in days where months in other places have failed anyhow we will See what the future Brings forth. lets hope Dear old Blighty I think I am too unlucky to get across there This is the","175":" time that I have been a \n\n\n\nSince I left aust in 1914 nearly 2 years ago and I hope its the last time\n","176":"\nCorps Rest Station\non the Somme\n\nthis morning the mo came and had a look at us one man was Sent to CGS and a couple have to return to their units he ordered me three times per day and inhallation for the voice which has practally failed me During the past fortnight or so I am not feeling any Better\n\ntoday the cough is Still very troublesome that I am put into hospital as that is the only place that I can possably cured at. that is I mean completely I cannot See Dear old Blighty in Sight this is not a Badcamp of its kind it is Situated near Rehemont where we were Billeted at Before we moved upto the front\n\nall well at the Base and in Australia\n","177":"\nCorps Rest Station\non the Somme\n\nthe Doctor has just Been round the tents when he came to me he asked me how I felt and I told him not too good So he is going to keep me here untill tomorrow and if I was no Better he will Evacuate me to CCS which means that I will have to go into Hospital lets hope its Blighty I think I am too to get across there\n","178":"\nCRS on the Somme\n\nThe Doc has just been round and has Desided to give me Still another Day here and if I am no Better tomorrow he will no Doubt Send me to CCS I hope he Does as I am Sure that they cannot cure me completely at this camp I have been suffering from this complaint for some time now lets see what tomorrow Brings forth lets hope CCS and then forBlighty\n\n"}}