{"Document Name":{"0":"Diary_0255","1":"Diary_0255","2":"Diary_0255","3":"Diary_0255","4":"Diary_0255","5":"Diary_0255","6":"Diary_0255","7":"Diary_0255","8":"Diary_0255","9":"Diary_0255","10":"Diary_0255","11":"Diary_0255","12":"Diary_0255","13":"Diary_0255","14":"Diary_0255","15":"Diary_0255","16":"Diary_0255","17":"Diary_0255","18":"Diary_0255","19":"Diary_0255","20":"Diary_0255","21":"Diary_0255","22":"Diary_0255","23":"Diary_0255","24":"Diary_0255","25":"Diary_0255","26":"Diary_0255","27":"Diary_0255","28":"Diary_0255","29":"Diary_0255","30":"Diary_0255","31":"Diary_0255","32":"Diary_0255","33":"Diary_0255","34":"Diary_0255","35":"Diary_0255","36":"Diary_0255","37":"Diary_0255","38":"Diary_0255","39":"Diary_0255","40":"Diary_0255","41":"Diary_0255","42":"Diary_0255","43":"Diary_0255","44":"Diary_0255","45":"Diary_0255","46":"Diary_0255","47":"Diary_0255","48":"Diary_0255","49":"Diary_0255","50":"Diary_0255","51":"Diary_0255","52":"Diary_0255","53":"Diary_0255","54":"Diary_0255","55":"Diary_0255","56":"Diary_0255","57":"Diary_0255","58":"Diary_0255","59":"Diary_0255","60":"Diary_0255","61":"Diary_0255","62":"Diary_0255","63":"Diary_0255","64":"Diary_0255","65":"Diary_0255","66":"Diary_0255","67":"Diary_0255","68":"Diary_0255","69":"Diary_0255","70":"Diary_0255","71":"Diary_0255","72":"Diary_0255","73":"Diary_0255","74":"Diary_0255","75":"Diary_0255","76":"Diary_0255","77":"Diary_0255","78":"Diary_0255","79":"Diary_0255","80":"Diary_0255","81":"Diary_0255","82":"Diary_0255","83":"Diary_0255","84":"Diary_0255","85":"Diary_0255","86":"Diary_0255","87":"Diary_0255","88":"Diary_0255","89":"Diary_0255","90":"Diary_0255","91":"Diary_0255","92":"Diary_0255","93":"Diary_0255","94":"Diary_0255","95":"Diary_0255","96":"Diary_0255","97":"Diary_0255","98":"Diary_0255","99":"Diary_0255","100":"Diary_0255","101":"Diary_0255","102":"Diary_0255","103":"Diary_0255","104":"Diary_0255","105":"Diary_0255","106":"Diary_0255","107":"Diary_0255","108":"Diary_0255","109":"Diary_0255","110":"Diary_0255","111":"Diary_0255","112":"Diary_0255","113":"Diary_0255","114":"Diary_0255","115":"Diary_0255","116":"Diary_0255","117":"Diary_0255","118":"Diary_0255","119":"Diary_0255","120":"Diary_0255","121":"Diary_0255"},"Date":{"0":"unknown","1":2008.0,"2":2009.0,"3":2010.0,"4":2011.0,"5":2012.0,"6":2013.0,"7":2014.0,"8":2015.0,"9":2016.0,"10":2017.0,"11":2018.0,"12":2019.0,"13":2020.0,"14":2021.0,"15":2022.0,"16":2023.0,"17":2024.0,"18":2025.0,"19":2026.0,"20":2027.0,"21":2028.0,"22":2029.0,"23":2030.0,"24":2031.0,"25":2032.0,"26":2033.0,"27":2034.0,"28":2035.0,"29":2036.0,"30":2037.0,"31":2038.0,"32":2039.0,"33":2040.0,"34":2041.0,"35":2042.0,"36":2043.0,"37":2044.0,"38":2046.0,"39":2047.0,"40":2048.0,"41":2049.0,"42":2050.0,"43":2051.0,"44":2052.0,"45":2053.0,"46":2054.0,"47":2055.0,"48":2056.0,"49":2057.0,"50":2058.0,"51":2059.0,"52":2060.0,"53":2061.0,"54":2062.0,"55":2063.0,"56":2064.0,"57":2065.0,"58":2066.0,"59":2067.0,"60":2068.0,"61":2069.0,"62":2070.0,"63":2071.0,"64":2072.0,"65":2073.0,"66":2074.0,"67":2075.0,"68":2076.0,"69":2077.0,"70":2078.0,"71":2079.0,"72":2080.0,"73":2081.0,"74":2082.0,"75":2083.0,"76":2084.0,"77":2085.0,"78":2086.0,"79":2087.0,"80":2088.0,"81":2089.0,"82":2090.0,"83":2091.0,"84":2092.0,"85":2093.0,"86":2094.0,"87":2095.0,"88":2096.0,"89":2097.0,"90":2098.0,"91":2099.0,"92":2100.0,"93":2101.0,"94":2102.0,"95":2103.0,"96":2106.0,"97":2107.0,"98":2109.0,"99":2113.0,"100":2114.0,"101":2115.0,"102":2116.0,"103":2117.0,"104":2118.0,"105":2119.0,"106":2122.0,"107":2123.0,"108":2124.0,"109":2125.0,"110":2126.0,"111":2127.0,"112":2128.0,"113":2129.0,"114":2135.0,"115":2139.0,"116":2140.0,"117":2143.0,"118":2144.0,"119":2148.0,"120":2149.0,"121":2150.0},"Entry":{"0":"\n\n(continued)\n\n","1":"\n\nAll this morning I wandered about in the glorious wilderness garden making plans of it even the tree & shrubs. \n\nIn the afternoon we go over to Foxholm crossing meadows yellow as mustard with buttercups & through a belt of ancient timber growing on a very steep slope which has cloud like blue mists apparently rolling up its side. This fairy cloud are really millions of little blue bell which in big patches here are without number & were well worth the visit.\n\nFoxholm is an old Tudor built house in the middle of a \nspace\n clearing in a plantation. The forest has been cleared a little too much round house & at the present time is neither thick enough to be wild & too thin enough to be beautiful. I see some old birch with their white bark, with little round leaves. The lime seems the best of the deciduous here, for it grows fast & does not rob the ground under it like the beech. The elm grows too slowly.\n","2":"\n\nAll leave today for London except myself & I am going the other way\n\n1\n\nthis afternoon. I return the pony & trap to Foxholm before leaving the pony now quite understands me & will come to my call, much to other peoples surprise –\n\nI met Baines at Foxholm & search for trains & finally wander home through the fields of fragrant bluebells to the Manor House, where I dine on in the big dining room & then have a final walk in the wilderness which has quite caught my fancy & set off for Weybridge which has a choice of routes to Codford but the time of connection the official refuses to disclose as it would mean travelling by the other company\n\nThis lands me at Salisbury & I revisit the cathedral & glorious exterior & plain interiors to of which admission is charged, eg chancel – always & casus belli to me & finally reach camp about 7 pm\n","3":"\n\nNo new through to-day but visit QM see Cpl Costing & change all my gear & hand in overcoat & trousers as I have no need for them. No one has yet returned from leave – everything including meals is go as you please – \n\nVisit Education officer & see Mearns who is in charge of matters & promises\n\nto make a special mention of my case at London to night which by the way he neglected to do. Rest of officers return from leave including Simpson with whom I yarn & discuss future plans he being very much in favour of banana growing.\n","4":"\n\nMore officers return including Allen who is very excited about his NME. I dont look for work no one knows I am here so I keep out of sight in my cubicle & read. \n\nAt night I walk through Stockton Park & past the quaint little thatched house that I have described before. These are cleaner than those of French farmer but the cleanliness seems a burden for nowhere are the face so contented as the frenchman seems to be even when in the midst of squalor. This contentment is something I could desire very much, & is surely a great national asset\n","5":"\n\nInoculated today & had time I have for Major Clark has into the bone. I send wires to everyone I know to day hoping to get\n\nacross much quicker. \n\nTonight I walk into & return along the river bed & through meadows on which a large amount of irrigation has been done In parts the stream sinking into a steep hollow look from the high banks (tree clad) just like a burn in Scotland.\n\nEverywhere the hawthorn is in bloom and hedges apart from the slight perfume are simply glorious a wavy line of moving white for in expectation of blooming the hedges have not been cut. Often we come upon red hawthorn which is even pretty than the white when close to it though in the distance the colour does not show up so well as the white\n","6":"\n\n11.30 This morning I get message to report tomorrow as the wire supposed to have been sent on 14\/5\/19 has now arrived. \n\nTo night I climb up the hill to have what will probably be my last look at Codford & remark on the fact that while the valley is full of trees & contains the best land it is the hills around that are cultivated. This is because perhaps the valley is the only part possible for meadow land for this\n\nis intensely irrigated.\n\nThe monotonous call of the cuckoo here haunts one for it is unceasing & has no music like the lark now trilling so clearly in the sky above.\n","7":"\n\nLeave camp at 9 but do not catch train till 1 pm & then pay my fare to Salisbury as there is a train for France via Southampton which leaves from this station & so if I go by this route I need not change my baggage \n\nI leave my baggage in the cloak room & have dinner at Chinese restaurant (4\/10) where I met 2 African airmen who volunteer to take me up in their plane if I can get leave to go up to Northolt junction before I leave. I then find Lily Brookes & take her to the pictures after which I go home to Baywater Rd\n","8":"\n\nGet up this morning at 11.30 & take a walk in the park & listen to the speeches There is a big police meeting here to day to decide if the London police should strike. I ask a policeman what I can do to fill in time & suggests going up the river in the boat & I add visiting Kew Gardens to myself.\n\nThe interval I fill in by visiting Cleopatra’s\n","9":"\n\nneedle which is very dilapidated & black when compared with it clear cut & well preserved companion in the Place de la Concorde. The \nlio\n sphinx on upper side is much cut about as result of a bomb dropped in this vicinity & I understood that the damage is not to be repaired but left as a souvenir of the war.\n\nThe current of the river is fairly strong & the water very dirty. Opposite is the unfinished County Council building in the excavation for the foundations of which a Roman boat was found, & several other Roman relics. The first part of river trip is not very interesting as it is really London & the busy commercial centre, the name of many factory being well known eg Doulton whose premises stretch for nearly a mile – Cross & Blackwell \n\nFurther up the river becomes more interesting. Locks begin. In places river is banked up by weirs to keep water at nearly same level & the method of travelling is to enter a basin & the gate is shut behind you & then the bassin is filled to level of other side by valves & then the other gate is opened & you continue your\n\njourney. \n\nThe boats here are often square ended punts & the method of propulsion poling – a inane method that only an Englishman would continue for it has no advantage either in ease or speed of propulsion.\n\nOne thing that would not be tolerated in Australia is the shameless cuddling that takes place right in the crowded river. Hang it all we do go into the bush. Another is the prevalence of smoking among the women. \n\nRiver is very pretty & it simply teems with life the house parties on shore & hotels & tea gardens that fringe the bank. Richmond with its terrace concealed by lofty trees but still showing its Star & Garter hotel is passed & many places once the abode of the aristocracy & still bearing trace of that refined beauty which a cultured & leisured class always leaves in its wake\n\nWe pass Hampton Court which I have visited before & go a fair distance past it. I then go to catch a bus for Kew & find a long queue waiting so I put myself in it & walk on first bus & get to Kew. \n\nThese gardens far surpass the Botanic gardens & are now for more beautiful than when I saw them last which was in winter & the trees were leafless. The azalea are wonderful while the valley of the\n\n7\n\nRhododendrons \nare\n is a thing of beauty, the memory of which passeth now away. A mass of gorgeous blooms of every conceivable colour & every inch often 15 or 20 ft high a mass of blooms \n\nThence I pass the walk which leads to Queens Cottage – a concentration of rustic loveliness & wildness – without an apparent sign of human attention save the handrail on path & the notices.\n\nOn return everyone has same idea all bus places are lined with people in queues & I take underground Ticket collector tells me to take the first train & change at Hammersmith. I take the first train & after passing about 12 station ask where Hammersmith is & am told that I am in wrong train & return to station whence I started. \n\nAt last after nearly 3 hours travelling during which I have been as far north as Camden Town I reach London such is the railway & generally speaking the Londoners idea of humour. \n\nArriving in London at 10.30 I have difficulty in getting meals & even the policeman cannot tell me a place. However, I fossick one out for I rarely take a midday meal as my money is not sufficient to allow such extravagance. Room cost 8\/- & meals 6\/- or 7\/- sometimes\n\na little less & as this exceeds my pay I must go careful or else I shall be bankrupt.\n","10":"\n\nI report at Georges Square & am sent on to DAAG at Horseferry Road who wants to send me back to Georges Square but ultimately finds the papers in his own office. \n\nAs I must wait 4 days to report back on Thursday for my orders. I then try to collect the allowance payable last march & I am told that it has been posted to my unit. When I tell them I shall never see the unit again they consent to enter the amount in my pay book. \n\nI then visit Harrowby & Lady Francis strafes me for not going to Mrs Wilkinson. \n\nI visit the Daily News – a daily & see all through the printing works from the reproduction of photographs with their dots to the machine which prints & rolls & turns out 20,000 copies in 19 minutes – This is a double machine. \n\nFrom the linotype I get my name set up. I see the linotype block made from paper & the molten metal does not burn it though it is only paper covered with a solution. It is cast in cylinder form & put in machine\n\n9\n\nI have afternoon tea with the Wilkinsons Portland Square & then at night visit Palace Hotel where an informal dinner is being held & a Masonic Club is being inaugerated. \n\nAn invitation is given to Motherland Lodge where the Prince of Wales has recently been initiated. I met an American Mayor & had a long discussion about Universities which are very similar lines to our. Also met Fred Bland & Watts from Lands Title Office. Went to Room of Earle Wayne Whitney Capt & Attorney at law Wewoka Oklahoma & then wandered home\n\n3-6-19\n\nThis is the day for my aeroplane stunt so I catch 10.29 train from Paddington for Northolt Junction a sleepy little place with about 2 houses but none near station It is on a branch line & they run a single railway carriage to it. \n\nI meet Henstridge who cannot get a machine & as an alternative shows me all the different types of planes Snipe – Bristol – Kitten etc. & then as Mayor has gone he gets an Avro out & up we go I am not least frightened of accident to machine for his life is equally as dear to him as mine is to me & he is not going\n\nto take any risks now war is over. \n\nWhen\n My only fear is my heart but when he side stalls & I feel no evil result he does what he like – the whole program – the loop is unnoticeable except that it is funny to see the earth on your head & the sky under your feet the shimmy nose dive & the \nleaf fall\n falling leaf shake your stomach up & leave it round your ears\n\nI then have dinner at the aerodrome & return to London now the worse for the adventure. I now want to get into a submarine & then I shall have completed in water – under water & in air.\n","11":"\n\nVisit Harrowby although this is Derby Day but I do not know the horses & do not see the use of wasting all days in queues & being crushed especially as I have little money to spare. \n\nI visit Mrs Talbot of 32 St George Road Eccleston Square with Mrs Gore for luncheon. She is one of the Buxtons & a Miss Buxton is present the exact replica of Mrs Rutson.\n\nThe old joke of numbering street entirely upsets Mrs Gore & if an English person cannot understand the system how can a\n\n11\n\nstranger solve such conundrums.\n\nI visit Alcocks in the afternoon & then dine with Miss Rose Richards 38 Hyde Park Gates near Albert Hall. Here the party consists of 2 other Lieutes from USA though in RAF & Ralston from Sydney. We play poker & at last hand I wage all & end up by losing 5\/-. \n\nThis is night of Savage Ball at Albert Hall & there are rows of taxi & a good crowd of people even at this time (midnight) to watch the costumes. I try to cross Hyde Park but this is closed at 12. Fancy closing our domain at 12 for Hyde Park has nothing valuable in it like the Gardens. These people are not as civilised as Sydney. The Tubes also stop at 12 & there are none which run an all night service.\n","12":"\n\nOrders to move have arrived & I start to morrow – 6.45 am. I rush about pricing clothes but afraid to buy lest I should be stranded in Paris, though I know clothes will cost almost double in Paris. \n\nMy pay book is taken from me & an account will be opened in Paris at Lloyd Bank. I am again at Chinese restaurant & after that get my luggage from Paddington to Victoria whence the train starts. \n\nI meet Evans on my \nback\n road home & yarn for an hour\n\nor so & then return to my domicile intending to get up at 5 am but with some thoughts of missing the train & catching the next\n","13":"\n\nI rise at 5 am but do not start for 6.45 am which naturally I miss. Arriving in time for 8.30 am I am informed that I cannot travel by it so wait till 10.30 which does not go as far as wharf & costs me the expense of transportation to wharf though assured by officialdom that I need not worry. \n\nAt Folkestone I met 2 Yankee medical officers with whom I dine & visit the township of Folkestone. \n\nEmbark on Princess Victoria at 2.45 & a sailor picks up a chair from a heap & puts it down 2 ft away & expects a tip for this – usually 6d or 1\/-. This is the way you are robbed in England by English people One can forgive the continental people to some extent because we are foreigners & so liable to be exploited \n\nArrive at Boulogne & boat enters from sea stern first as there is no room to turn in harbour without inconveniencing the traffic & perhaps the knife edged design is difficult to handle if she has not much way. \n\nI go to Club & then go for a\n\n13\n\nwalk down to Jitee & along the sea front. The child like prank that grown ups can play reflect this light tempered race, eg a man tries to overturn a little shelter where his mother-in-law & wife is sitting. Another man rolls his wife over in the sand & both find it funny I should find it uncomfortable but they dont seem to mind.\n\nMen & women take advantage of the evening to go for a stroll but no one dresses. They go as they are when the idea comes into their head. And the girls seem proud of their lovers even though he be in working drabs & they seem to get a lot of pleasure out of their evening stroll.\n\nI saw one boat come alongside quay & it showed that Frenchmen were never made to handle boats. 2 well dressed girls & their mother at top of wharf are amused & the sailors exchange remarks with them as if they were old friends. There is no resentment & no forwardness. It all seems natural here. \n\nAt the club all are English & I am isolated. I now never speak to an Englishmen unless he first speaks & then I sometimes only answer rarely. My dislike for the average Englishman is daily increasing\n","14":"\n\nAfter a good sleep & bath & breakfast at 10 (porridge egg & bacon 2 ½ fr. bath 1 fr. dinner 4 f) I set off to see the town. \n\nThe town is divided into Hauteville. The old wall town of history & the Basse Ville – the town which has since developed. The port across the river being known as . The fisher folk still retaining their peculiar & distinctive areas espec on Sunday lie in a quarter to themselves. \n\nThe streets nearby railway are disgusting filthy & if they had much hot weather & less rainfall the whole population would be swept off by disease. Still I should say that this is due to the crudeness of their ideas of sanitation rather than filthiness for in some things they are scrupulously clean & the absence of inspectors of nuisance in our own towns would let a number of dirty conditions spring up \n\nThe old town is the more interesting The old ramports still remain as a pleasant walk covered in shade by rows of trees planted upon it, & scattered throughout its length are seats to rest the weary limb & often used by lover where Mdlle has managed to slip away from work for a little while to discuss some matter of vital interest only to themselves. \n\nThe walls are & 60 ft \n\n15\n\nhigh & the trees in the surrounding avenues below mars the view, as these trees are ancient & lofty. At one point on north west corner the trees open & a glorious view is obtained of surrounding hills here & their covered with isolated clumps of trees. \n\nIn winter these trees would be leafless & the panorama would balance the loss of the shady retreats. The day is very hot but underneath these trees lofty & cool the shaded walk are filled with a cooling breeze & the air itself is full of the song of myriad of birds who have found these pleasant parts.\n\nThe Church of Notre Dame is in the Italian style The roof is doubled the lower one having huge semicircles & the upper painted group above these semicircles gives the idea of a glimpse into Heaven. The decoration is all in a silver grey. The dome is closed till 2 pm but I do not wait. The Palais de Justice, Hotel de Ville are beautiful building whose beauty is robbed by the narrow streets which are so hot & sultry that I again seek the ramparts. \n\nI then set off to visit the Colonne de la Grande Armee & ask a Frenchman who instead of merely directing me he accompanies me & makes interesting conversation to pass the time unlike an Englishman\n\nwho if polite enough would merely give you wrong direction & walk on alone.\n\nThe Avenue to Colonne consists of a road flanked with trees then a narrow walk & on outside about 6 ft dense shrubs & trees & a hedge. Around the Colonne \nare\n is a dense park & numbers of strips of grass belts. . In squares around base are areas containing 700 each little rounded plants. \n\nThe Colonne is 172 ft high of white marble Napoleon on top dressed as a Roman with his back turned on England – meant as an insult but perhaps prophetic as showing that the path of glory did not lie in that direction. The description of the country from the top is best seen from the pc. I cannot see England as there is a heavy fog to sea portions of which roll inland occassionally like an invading army. \n\nAt night I wander along to ruins of Caligula ruined lighthouse which he built in 4010 to light the Channel for his ships & there with the town & Establissement des Bain at my feet. Overhearing a remark of two French chaps below they join me & we wander into the town & catch the train. \n\nAs first is too crowded I take the second & get \n\n17\n\na very good seat compartment all to myself & stretch out. A sleeper would have cost me 25 fr. & this is as good, I spend all the night travelling\n","15":"\n\nArrived in Paris Gare du Nord & set out for Hotel Windsor & have a bath & breakfast – meet Miss Andrews from Leura & Miss Wilson who is in charge \n\nI take room & go for a walk down city to fill in time as I have made arrangements to go with this party \nto\n on the river up as far as the Maine to down as far as St Cloud. The river is not pretty being spurned by numerous bridges & lined on the bank by historic buildings. However near St Cloud its forest clad hill in which scarcely a house can be see is beautiful.\n\nWe land at St Cloud & take refreshment, & then return to Hotel where after dinner I help Miss Wilson to make Orangeade.\n","16":"\n\nI get up too late to have breakfast – & all the ringing in the world seems unable to rouse the girl so I miss my bath. I report in accordance with my orders & find no one there as this is Whitsunday\n\na universal holiday & all British officers are not supposed to work on holidays in the army not even in reliefs – I go back to hotel & for the afternoon go to St Cloud races.\n\nAt first the betting system worries me how the prices 5 fr 10 fr 50 fr at each bets are made in these prices You can bet that horse wins or that it gets a place & the prices are determined afterwards. You are ignorant at the time. Horses names are not used only the numbers. Horses running & results of last race & prices paid are shown on an indicator. I do fairly well ending up losing about 16\/- not as bad considering I knew absolutely nothing of the horses & no one on the ground. \n\nLeaving course with friend I had found I went to Rue des Paradis & thence to Restaurant Rabbie 69 Boiel Magenta en face de la Gare de L’Est where I met M & Mde Cayer & Oliver a retired French captain & Lucille. They give me a pleasant evening. The freedom from restraint & other peoples opinion on their own innocent enjoyment is very refreshing after the staidness of England.\n\nAfter dinner we take café in those open spaces in the street so dear to Parisian life. Here the enjoyment is fast & furious. A lady singer looking for arrives & her\n\n19\n\nsong is silenced by the audience who takes it up \nall\n In street people stop but everyone takes it as natural & joins in. \n\nAt dinner M. Cayer a regular customer has a complicated bill so girl allows him to make it out himself just fancy such trust in Australia. When you order entrees you are served with a little saucer with the price marked on it. No one asks you to pay & you may remain 1 or 2 hours. If you pay the saucer is turned upside down and no one thinks of turning saucer upside down without paying or of putting saucer in your pocket. Such trust is startling to me. \n\nOn my way back I am lost & have to make many enquiries to go home but everyone is eager to help & some go out of their way to show me.\n","17":"\n\nI report & find that no one knows of me or cares for me I am a loose end & can apparently do as I like. I find my way to the University seeking a M. as no one knows Dr Siegfried & find myself in with the Americains. The Sorbonne has closed but an Americain course is continuing for 2 weeks and I join with it finding these Americans who\n\nare mostly legal men a fine lot of fellows. \n\nMoney is running very low & I am going without one meal a day & taking no amusements till I know where I stand. I wish I had some account on which I could draw. I have £15 on me due to my account at London but I am frightened to spend a penny till I know when my next pay will be forwarded. How I shall last till November I have not the slightest idea but I mean to stay here all the same even if I have no meals & no bed. \n\nAll the organisations & clubs are closing & there is no recourse. Even the Americans are closing down in July I am continuing the American course until its conclusion & then I shall have to take a tutor whose fees will be 10 fr per hour. The University people give me a lot of address at which I can find board & lodging ranging from 80 fr to 300 fr.\n","18":" \n\nI spend all the morning looking for rooms & visiting the addresses which have been given to me. Most of the rooms will not be free until the student vacant in some cases 15 day in other a month & finally take rooms temporarily in Hotel des Grand Hommes in Place de la Pantheon at 70 fr\n\n21\n\nper night. I then set out to collect my baggage as I am frightened it may have gone astray but find enormous crowds around the entrance. Here as at tram stop if there is a crowd you can always take a ticket thus ensuring your turn in proper order. This is especially useful in the case of trams while this strike continues. \n\nAt railway I have difficulty in getting a taxi & a YMCA Aussi comes along & offers me his big motor lorry which takes me first to Windsor & then to hotel & for which I give then 10 f. It would probably have cost me 25 f in a taxi & ie if he would have taken me, for during strikes short runs mean more money. \n\nI dine at Rabbie tonight & meet my friends but leave them to look after my baggage.\n","19":"\n\nI visit Grand Magasins du Louvre & Samantaine looking for this book & walk along the Grand Boulevard when even in daylight the queens of love & powder are plying their trade. I take in a modest place & get little for 7.50 & in the afternoon I attend my first lecture, & seem to be the only one who can follow his little jokes\n\nTo night I find a little café where one can dine conveniently well for 3 to 4 francs & which several American officers have turned into a mess. I meet here a fine chap & destined to be my sole companion.\n","20":"\n\nThis day I have nothing to eat till dinner & have a long yarn with Madam who runs the hotel. Louvre again this evening at 3.30 till 6.0 pm & then invites me to the concert organised by the Americans prior to their departure. \n\nI spend all the morning in the garden de Luxemburg the prettiest gardens in this pretty city. The play of fountain & walls of spray from the watering pipes under shaded walk among sculptures lends an enchantment to this fairy dell of green grass & greener trees. \n\nAlongside of me is a musical student who is huming Il Balen & on the other side a would be artist who is spending his time feeding the sparrows with morsels of bread which he has specially brought hither for the purpose\n","21":"\n\nRose in time to go to concert which is really excellent A W Browning an American\n","22":"\n\nofficer possessing a remarkable voice while S Dushken is a fine violinist. Among the French Mdlle Mona Gondra sang some old French songs which were more action than song but she is . She gave as an encore oh johnny & made love to pianist & finally pulled him out of the chair which certainly terminated the song. Among the American student songs I was rather surprised to find “Once in the dear dear days beyond recall\". \n\nTo night I dined at the little café & meeting Maintor visit Montmartre. The Café du Ciel is open but Enfer is closed. Entrance is 2f 50 & on entering one sees fat old objects dressed as monks who ring wooden bells & worship the golden calf. The room is small with a long table down the centre & alcoves in the side. You can take & are expected if at table to order a glass of inferior beer (75 centimes). Then there is a tableaux of supposed angels in tights on pouring out champagne to the other – not bad looking wenches – these are apparently the heavenly residents though they would be just as happy anywhere else I should say.\n\nAfter a few more we are invited to ascend to upper room which is decked out like the interior of a house & in distance another\n\nstage with clouds shown or reflected on a mirror. \n\nHere angel Gabriel appears at monks call or rather does not appear & he has to go behind the scenes to find her. At second call she appears & is more like a actress or tight rope dancer than angel. She revolves upside down & in all positions & then anyone in the audience is asked to represent Gabriel. One girl volunteer & as she passes in the monk declares that there goes an angel almost Everyone laughs & badinage is rampant. This girl is given a pair of wings & revolves around. Then two other tight clad angels balance on the moon. \n\nThen applicants for job of angel or monk are called for & a soldier offers. The monk says he will not be able to work tomorrow & his girl answers it does not matter as he is on strike (tho he is a soldier) & so an angel appear alongside of him emptying gold into a basin at his elbow & of being a reflection he is ignorant & disregards. The monk him for the loss of good opportunity to enrich himself. Then a group of beautiful angels appear & then in same way he ignores from outside appear a large pair of to finish the performance. All laugh & soldier return to his sweetheart\n\n25\n\nThe heavenly chorus of girls gives a noisy display with tambourines & the audience is informed that search is finished, & they must return to earth receiving a blessing at foot of stairs I forgot to mention that St Peter with his crook welcomed us at door on entering & conducted us into heaven. \n\nAfter this we adjourned to Le Chat Noir a much more interesting show. Price of admission is 1.85 & beer costs 75 centimes & was flat. On entering we were greeting with a remark Here are live real Parisians All girls are addressed as Princess, soldier as generals & civilians as monseigneur & some remark passed about each. A lady accompanied by 2 men enter, & are introduced as the man his wife & the baby. A front man entering introduces himself as the l’amant. \n\nThe songs are rather good & at conclusion singers try to sell them. There seem to be 4 male & 1 finale singer & a pianist. How it pays I dont know. The method of acclamation is directed by one of show & many be a succession of 3, 4 or 5 claps repeated 3, 4 or 5 times. The shallow shows are over the odds of the soldier who sees a girl & much movement after which a duel & then his funeral. \n\nSome of the songs are very hot & much talk is of Americans\n\nof whom several are present but none understand the jokes against them \n\nThe hall is partly underground – with a vaulted roof in imitation masonry & at far end a little stage on left a box for director of performance overhead a window whence drinks are drawn & on the other side a staircase used for performers. .\n\nThe walls are adorned with black cats in all position & by drawings by renowned artists probably the proprietors. A representation of jazz band by all nationalities is excellently arranged & the badinage is fare I really amused myself very much & so did my American friend though he could not follow many items. \n\nOn our return we are stopped many times but are to the alluring beauty that frequents Paris by night & near home meet 2 student & then I accompany them to “Rue Mezet & have a drink & then making arrangements to meet them at La Source go home having experienced an strike stricken person on my way home.\n","23":"\n\nNow 2.30 pm & I have not dressed. Yesterday & today & the preceding day I have spent writing up my diary but most of the impression have been lost on account of the lapse of time. I will\n\n27\n\ntry to record any new ones though often it may mean repetition. \n\nThis afternoon I decide to visit Parc de Montsouris & commence to walk there. Day is hot & I have had no meals I dont go very far when I decide to visit parc any day & go up to top of Eiffel Tower 904 ft high an iron structure from where a most glorious panorama of the city can be obtained. \n\nThe people are no bigger than small points & the houses have the same effect as from an aeroplane. Day is clear & every suburb is plainly visible. Clamart with its dense wood & Sacre Cour rising like a whitened – a heathen symbol rising out of a godless city – The direction & names of suburbs are marked above the glass 3rd platform is half glassed in but the","24":" a few feet higher is exposed. \n\nTelegram & PC\n can be despatched here but time does not allow me to send one. Paper thrown from top often wander a mile or so before dropping to earth or becoming lost to sight & it is interesting to watch the childish play of expression whether of anxiety or delight that even adults take in this sport. Sunday ascents can be made for 2 fr weekdays 5 fr. Hence place is crowded on Sunday & long queues wait at each platform for cages At one\n\nplace I waited for ¾ hours. \n\nRestaurant is on first floor & attendance likewise prices A glass of water with a couple of slices of orange costs 2 fr, & it takes nearly an hour to get that much French men do not make good waiter. They get needlesly excited & run all over the place forget your order or give it to some one who does not want it. \n\nI walked back arriving at 8.30 pm so far having had nothing to eat & feeling a little faint as I have walked nearly 12 miles on a hot day. I have a good meal at the little restaurant I have discovered & where one can dine for about 3 fr & dine well with wine, salads & cheese, & strawberries. \n\nHere I get talking with an American officer & he offers to take me round to some of the less known cafés The first we visit is off Place St Michel on left hand side facing cite. We pass through an archway & some & I begin to think I am in Spain Group of gypsy looking women & wild looking men with guitars seem in abound though they are only about 4 group some presented in groups on the table & some on the grounds – chairs dont exist. \n\nWe pass along an arcade like room ie there is no front into a small room adorned with crude painting with small tables & benches round wall. This leads into another small room reserved only for\n\narrangements with my American friend to visit the Bohemian life in Montmartre & as he will be leaving in a fortnight I decide to see what he can show me. \n\nWe leave at 5 pm sharp & wander along to Rue Sauluier where we visit Bar des Artistes. This is the rendezvous of the English actresses in Paris. As we sit down there are two asleep on couches with their money bags lying on table yet no one touches them This would be a wonderful place for pick pockets & light fingered gentlemen.\n\nHowever we passed on from here to another similar institution in Rue Geoffroy Marie where I met Hilda Little & Hetty Hedges of a club mainly Australians known as the B – d Club Then we went to Boulevard des Italians near Wax works & obtained a good meal for 2 fr 75 Rather wonderful in a place where prices range for same meal 20 fr & upwards \n\nAfter this we took the Metro (I forgot to mention the strike of trains has ended to day & the service though not good is not bad) The trains go very much slower than similar ones in London. We get off at Lamark & turning to our right ascend the Rue des Saules though no willows are present & the neighbourhood is wild for a city. \n\nAt top we reach “Le lapin agile\" a little café & on entering thro a small room find ourselves in a large room lightened by two gas lamps which are shrouded in a red cloth. The light thus \n\n31\n\nsupplied leaving room quite dark till ones eyes are accustomed to it & then in one corner there is a large statute of a Madonna or some angel & on another a crucified figure horribly carved or chopped out with one knee bent & once plastered in silver & now in dust. The tables are bare & round wall runs a bench no other seating accommodation but if crowd is great boxes are handed out \n\nThe proprietor is a little stunted figure with corduroys 16 sizes too big & straggling white beard while the head is always covered with a pointed felt hat which hides a rather intellectual forehead. One could easily imagine him as a rag-picker ready to murder any one for a . I should have certainly put him down at that had I met him outside. He is as wild as his looks & hops about floor yelling & shouting to himself. \n\nWhen all are served with drinks he gets his guitar & sings an old love song “Aupres de ma blonde il fait beau (4 times) Aupres de ma blonde il fait beau .\" At conclusion he calls upon the poet Goyard to recite some of his masterpiece ie poems composed by himself, the best being La Visiteuse but the recitation part is bad though the poems possess some merit. Then a girl sings. \n\nMost of the audience is of the student class living a Bohemian existence delighting in art for arts sake\n\ngenerally proclaiming the fact by some peculiarity of dress, eg big black cravats, long hair, etc. The programme is pleasant & impromptu more like a family musical evening than a café. \n\nThence we adjourned to a Bohemian Club “Nostre Logis\" 10 Rue Couston where admission is restricted. Here we had the Bohemian world of Murger – big hats, craving look, large cravats all proclaimed that status. On old bird is the reputed spendthrift of the old nobility. Guitar is very much used here & song of \nthe\n love are the common type. \n\nGoyard recites “J’aime tes cheveux blonds\" We talk & yarn & drink (one drink only a glass of water with 3 slices of lemon & sugar 3 fr) & leave about 2.30 am. for a four mile walk home. Still evening has been a pleasant glimpse into Bohemia & I shall often revisit it. \n\nIn fact one of the party is a girl with a lovely voice who sing me songs of Chaminade & Verlaine. I agree to continue our acquaintance to morrow. This girl we accompany home & in spite of her education & high poetic soul find she is reduced to ironing by night & washing by day Until 2 years ago she was a dancer but when stagework fell off her old Bohemian instincts reasserted\n\n33\n\nthemselves & she returned to the life which still held its charm amidst a thankless world\n","25":"\n\nMet the in Café Legrand Place Blanche which still holds the Moulin Rouge & decide to spend the evening visiting the same places as the previous night.\n\nNotre Logis is more interesting & more talent to present plays nocturne after nocturne from Chopin. I met a young painter named Caillous & accompany him home leaving the girl among her friends who will see her home \n","26":"\n\nThere is a dinner tonight at Military Cercle Rue di Volney the aristocratic French military Club of Paris to receive 2 Americains. I have asked permission to be present & so make a friend of Duke an American on GHQ once stationed in Paris who goes out of his way to make friends for me. \n\nDinner costs 13 fr & we get champagne & an excellent concert The Club rooms were the War Office of 1849 & are spacious. All servitors wear white stockings. The court is a green lawn & cool & inviting. There are 2 courts.\n\n35\n\nWhen this will be exhausted I know not where I can find money nor what I can do. \n\nAfter changing money in London & County Bank in Place Vendome I went along to Hotel Windsor & find that they are not closing up till end of month & have good yarn with Miss Kellerman & then hurry back to meet an American officer who is taking me round to meet a possible tutor in law for me M Hensson 9 Place Delambre where I spend a pleasant afternoon & am asked if I should like to join the students club. They ask me round on Monday for this purpose but as there is something to pay I am too busy.\n\nStill I am glad to have gained an entrée into this real French family as such introductions are difficult to obtain\n\nChanged residence to Hotel Marigny 13 Rue de Sommerard.\n","27":"\n\nSpent the morning in the Garden & at 12-30 had an invite to luncheon with Capt. Rouquerol at Press Club 80 Champs d’Elysees (or Champs d’Lizzie)\n\nThe building is the magnificent private residence of M Dufayet the man who exploited the cash payment system in Paris. He erected this building at a cost of 50,000,000 fr. & then died. He has no wife nor children nor mistresses so why he built\n\nsuch a magnificent home I do not know \n\nThe rather vulgar taste of its owner is evidenced by the lavish display of gold everywhere. Naked figures appear everywhere. All the chambers are vast – the private dining room for himself only is twice as large as our ground floor & can seat about 50 people. The great concert room has a stage which rises out of the floor at will & if room is required for a dance subsides again. Near roof there is a hidden galleries on roof of which are several painting of nymphs surrounded by trains & clouds.\n\nLuncheon preceded by cocktails & followed by cigars is very pleasant. My companion is very interesting & as \nmy\n his ideas coincide with I promise to buy him an edition. I leave him about 4 pm & visit Villejuif to find Angels friend but find the mother & 2 children with scarlet fever & the girl is away at Montmartre all day & only returns about 7 pm to her home.\n\nTo night on the Boulevarde I met a Lt Donnet an English officer in the Royal West Kent whom I had previously met at Cox Bank. He invites me to his rooms at Wagram for a drink. His suite is magnificent an enormously large room filled with roses & on\n\n37\n\ncorner of building with large bedroom & a washroom opening off it \n\nSuite cost 90 fr per day (20\/- = 29.80 fr). The view is superb but yet melancholy. The dark & gloomy Tuileries hiding as it were some secret deed of shame or nothing a vague unknown & beyond in the midst of garish light rises the obelisk or is it the guillontine on the Place de la Revolution\n\nOn the left stretches that stupendous pile of buildings known as the Louvre while at every instant that part of the Tuileries in front change with the changing light. One can almost see the shade of the courtly seigneurs & stately dames who once walked these squares which were formed & made to suit another age \n","28":" long as the Tuileries remain so long will Louis XIV & his age dominate Paris & remain alive in French & foreign minds \n\nLeaving Wagram (where Paderewski is staying) after considering a proposition put up by Donnet that I should assist him for a week offering £10 as wages or a share in a business of colossal proportions Somehow or other I dont trust the man & I think he is dealing with the enemy & so do not close but in spite of my lack of funds think that I better leave him alone & remain without money.\n\nI spend night at\n\nHotel De L’Yvonne near the rue a where Mathilde the friend of an American officer lives.\n","29":"\n\nThis is the day that I have received the invite to M. Edouard Dolleans Rue Marbeau. He is a professor of the Law School & has some political pull He is the centre of a very nice social circle & I enjoy myself very much. Remaining dancing till nearly 8 pm I meet a M. Truechi a Professor of Law school & he thinks it is hopeless for me to get a law degree or official recognition but will make enquiries from the Dean. \n\nI dine with Duke at his rooms tonight & we yarn so late into the night re poetry that I stay the night at his place in Rue de Petite Ecuries \n","30":"\n\nSpend day with Loepp – dine at YMCA & then to Mont . We return to Rue de Montaigne to meet Duke & then decide to go to a concert. While at dinner siren sounds & we know that Germans have signified their intention of signing the peace We decide to visit the town & if\n\n39\n\nthere is any excitement to remain in town. Guns are fired near Champ de Mars but so far few people are \n\n“L’Enfer\"\n\nCabaret Artistique\n\n(Paris-Montmartre)\n\nEntrée : 2 Fr. 50\n\n(Tous droits compris)\n\nConsommations En Sus\n\nA conserver et a presenter a toute Requisition\n\nNo 1231\n\nhas been torn up & every vehicle stopping owing to difficulty is attacked by crowd. Further along dancing is common. Altogether considering the French temperament it is a mild display but perhaps the long time since cessation of hostilities has somewhat damped enthousiasm or perhaps I shall see more on the night when peace is signed ie Tuesday, Thursday & later on it is fixed for Friday. I leave Duke\n\n“L’Enfer\"\n\nCabaret Artistique\n\n(Paris-Montmartre)\n\nEntrée : 2 Fr. 50\n\n(Tous droits compris)\n\nConsommations En Sus\n\nA conserver et a presenter a toute Requisition\n\nNo 1231\n\n39\n\nthere is any excitement to remain in town. Guns are fired near Champ de Mars but so far few people are stirring so we attend concert in Theatre in Champs Elysee a beautifully furnished place with a roof of hidden light which illuminated the frescoes & the building but which was itself invisible. \n\nAfter performance we visited Boulevards. Crowds have now arrived but beyond trying to or forming a chain across the street & enveloping people & then romping round them in a circle there is little excitement. We enter café Grand & beyond a little larger & noisier crowd it is the same. \n\nWe descend to Taverne Olympia & there matters are livelier. Everyone dances with anyone & place is a revel of victory nest & return to Boulevards. Processions are formed & in one place road has been torn up & every vehicle stopping owing to difficulty is attacked by crowds. Further along dancing is common.\n\nAltogether considering the French temperament it is a mild display but perhaps the long time since cessation of hostilities has somewhat damped enthousiasm or perhaps I shall see more on the night when peace is signed ie Tuesday, Thursday & later on it is fixed for Friday. \n\nI leave Duke\n\nspend the night at Hotel du Centre near Porte di St Denis near which a little girl has been singing for my especial benefit. “Pres de la porte de St Denis till I imagine that I am among my beloved isles again with Mdlle Bozon.\n","31":"\n\nAfter turning in about 6 am this morning I remain in bed till 3 pm & then visit Bank to see if my money is across & find that I am still without pay & may be stranded any day. \n\nI then dine at our little restaurant & then go a dance organised for American officers by the French Homes. After being without a partner I am introduced a lady with a & Mdlle Madelon Le Neef Rue de la Sorborne. She is a dental student & after a dance or two we adjourn to the garden in the house which was once the home of Napoleon physician & then the residence of M. Ribot. \n\nWe talk over philosophic matters & become firm friends I accompany her home & then we decide to visit the town & see if there is any excitement We have a very pleasant promenade & then walk home\n\nThe town is still crowded\n\n41\n\nbut on the whole very quite\n","32":"\n\nI rise at 10 am & breakfast in bed & then write up diary from 18\/6\/19. \n\nIn the afternoon I meet Duke at 53 Ave Montaigne which is the American HQ or rather one of them for they are over organised which perhaps accounts for their failure as an army unit. We drive down in a car to Place du Theatre Francias & dine at for 4.50 fr which is cheap considering locality. \n\nAfter this as it is too early to visit Montmarte & Duke wishes to meet someone at 8 pm who incidentally does not turn up. We take coffee at Grand Café & met one of Duke friends & we arrange a little dinner for tomorrow night. \n\nAbout 9 I take the lead to introduce Duke into Bohemia for he has been very good to me. We visit Café Enfer This adjoins & is similar to Ciel. Demons await on you everywhere – Consommations cost 75c – Red lights & red decorations \n\nPlace resembles a grotto & the statutes are usually human & guillotined heads with the blood still oozing. Guitar & string band supply music & when hall is full we are invited upstair to the which on arrival is absent. There is a stage & on this a woman is standing in tights & then flames mount at the bidding of Satan & consume her till nothing\n\nremains.\n\nA lady from audience is invited up & one man gives away his sweetheart & tell audience it is a good way of getting rid of her. She appears fully dressed & immediately afterwards is \nin\n almost naked with only a chemise & the Shes in a reflection with her real face. Flames consume & then as they die down she gradually reappears dressed as she was when she mounted platform a minute ago The seven sins are then shown in a series of tableaux After which we are told show is finished & as we pass out door the demon informs us that we are very fortunate to see the earth again. \n\nAs time is getting on I decide to head for L’Agile Lapin & on way meet Goyard. Things are quiet at this place & at 11 pm I take him round to the Society of 10 Rue Couston see The place seems to be losing its Bohemian characteristic owing to an influx of an undesirable element & also of tourists for we found two cars drawn up outside. But these may have been old Bohemians now grown wealthy & visiting old resorts.\n\nHere Duke is fascinated by my little friend Dedi Perry of 38 Rue Fontaine & dances with her. Dancing takes place to night for the first time. We at least, Dedi, Caillous, & I tire & we leave but somehow we find ourselves in Duke\n\n43\n\nflat for coffee – which is followed by chocolat & then & I read & we talk right on till Caillous & Duke decide not to go to bed, so we talk on & a very interesting night we spend. We are 4 3 men & a woman – all without money all Bohemian – a girl – a poet, a painter & myself who might be called a writer\n\nThe top attic the freedom of idea & get a girl confident of her self – & when she points to the dawn with a gesture, I hear in every cubic inch of air the strains of Boheme Puccini might have been present in the room. How these words will always conjure up that Bohemian night At length Dedi heart under the strong coffee gives out & we lay her down. \n\nIs it or not this frail girl whose life has been so full of sorrow that once she tried to end it. We close the door & leave her to her privacy – an act natural to us but so unlike a Frenchman that \nshe\n it touches her deeply. About 7 we leave & I go with Caillous to her home\n","33":"\n\nCaillous atelir in 3 Rue de Campagne Premiere in a courtyard which from above is a green mass \n\nof waving acacia & from below a summer arbour with flagged floor His studio is a large room adorned with sketches of naked women by himself with a little screen portion for toilette & store & a very large divan or bed. We breakfast on bread & butter & salt & chocolat & then I return home & sleep to 2 pm. \n\nI look up Capt Rouquerol & find he cannot dine with me, this is fortunate as my fortune consists of 70 fr. & this must last till goodness knows when. \n\nThen I run across for Duke & find that he has not been in his office & is sick I profess my intention of seeing him at once & the Colonel gives me a U.S car & away I speed to find him.\n\nHe was simply exhausted & we set out to buy for tonight’s dinner 6 small veal cutlets cost 7 fr 50 – Sardines are 2.25 f a small tin a small cauliflower costs 3 fr. Unfortunately our guests do not arrive but send a little note We eat the dinner ourselves & then I visit Mde Brisson & have some difficulty in finding the place but it is only within ¼ hr walk from my home. \n","34":" \n\nNothing special but see page 47\n","35":"\n\nSlept till 2 pm & spent afternoon writing up diary This is the day\n\n45\n\non which peace is to be signed & I go to Versaille to take part in this wondrous event. I go via Montparnasse & so miss much of the crowd though there are over 50,000 there but these are a mere handful in the vast grounds of the Palace. \n\nTo describe Versaille is impossible & God knows what kind of intellect it was which fashioned it. It is stupendous & cost about £20,000,000 & has accomodation for 10,000 inmates The approach has 16 colossal statutes perhaps 20 ft high of statesmen & soldier of Louis XV & in the centre is a statue of the Grand Monarch himself. Each of the pavilions are inscribed with “To the great glories of France\" but this is probably by Louis XV \n\nThe Broad Avenue de Paris is lined with thousand of blue clad, steel helmeted cavalry who are guarding every road. The Palace itself is out of bounds save with a ticket which I do not possess \n\nThe grounds are one complicated mass of tree covered avenues & thickets & shrubberies – with temple & fountains & sculptures every at unexpected places Over 100 sculptors were employed embellishing the grounds \n\nAt 10 to 4 the battery of artillery commences. This is signal that peace has been signed & then plenipotentiaries file out & into the terrace & simultaneously the fountains commence to play – & a majestic sight they are though big ones are not in action\n\nThis is the first time they have played since the commencement of the war. Then I press forward &am see the plenipotentiaries off & get into the different courts by assuming I have the right to go there & the soldiers let me go & finally return to town. \n\nAt night the town goes mad The Boulevards big as they are are impassable save at a snails paces. The crowd form processions & barge through one procession consists of a Union Jack & 2 Australian flags probably the most conspicuous procession in Paris Place de l’Opera is crowded & one of the opera singers sing to crowds ending up with Marseillaise & crowd dont join in the chorus. How unlike Australia & this in the highly temperamental nation of France.\n\nEverywhere street dancing is in progress. Wild groups dance hand in hand – carry the girls shoulder high & do all that the thousand & one mad freaks that can be done in moments of excitement – at 3-30 pm I have to lay down as my heart is giving signs of knocking up. \n\nI reach home about 7 am the following morning – tired & all that but still it is the only time that a peace like this will be signed in ones life & that one will be at Paris.\n\n27-6-19\n\n47\n\nTo night visited Montmartre – Café du Neant. Here there are coffins for tables & as each enters a funeral dirge is set up. Choose your coffin to right or to left everything is black & everyone addressed as Moribund.\n\nAfter a while the taper which was given to you on entering dies out & you are dead. The lights go out & a purple ghastly light fills room from a glass tube. Pictures are then shown on wall which change before your eyes eg a picture of Messina & then earthquake & fire consuming the building & then above the ruins Death with his scythe.\n\nThe dance at Bal Tabarin with the figure of all turning to skeletons. We then pass through narrow & vaulted passages illuminated if at all by green ghastly lights. This passage leads into a vault where we are shown one of the audience transformed into a skelon – very well done as the face becomes very waxy & ghastly before the transformation\n\nThen through outer vaulted to a churchyard where the seats are all tombs – Here on the stage revels are held – a fairy strips herself all but her chemise & after this we are sent out & told to let the moral sink in. The only moral I could see is dont die. \n\nFrom here Madelon & I \n\nwent exploring & entered the Café d’ where visitor is hailed with jokes. \n\nConcert which lasts till 2 am is much the same as Chat Nour. Present proprietor has run show for years & has a red shirt & red collar. Mde takes no interest in show but busies herself among her accounts as if the air was congenial even necessary for complicated computations. Entrance fee is 1.60 & 75 centimes. \n\nAfter show at Madelon request we walk home even though the Metro were still running when we started.\n","36":" \n\nThe day after peace – sleep till 11 am ie from 7 am & then get up & go to the races at Longschamp. \n\nThis is the race of the year The Grand Prix of Paris & everyone is there. For my part there is too much of a crowd. Entrance is 25 fr & as my fortune is 48 fr I spend most in entering & looking at the wonderful dresses which only a Parisian could wear.\n\nI succeed in losing on both my bets & return with only 15 francs to my name & not knowing where I can raise anymore. \n\n Brisson has invited me to dine at her place to night & I get away from course after the Grand Prix which was won by an English horse Galloper Light owned by Rothschild\n\n49\n\nAt 6 Ortolan St off Square Monge They are awaiting. Dinner is specially prepared I think Soup – spaghetti – tomato salade – rabbit – potatoes in kidney & gravy – with crème – biscuits fancy – coffee & wine (Graves).\n\nAfter dinner I read some poems to improve my French & amuse them by my imitation of Goyard – They seem to think it rather good. I copy some pieces out & will learn them. She lends me her Larousse & L’Archeologie Egyptienne, & as I have a cold coming on she doctors me up with aspirin & an infusion.\n","37":"\n\nWrote up diary & intended to go to bank but miss doing so. In afternoon I seek for but being unable to read Prof Truchi writing find myself in Rue Ponthien instead of Place \n\nPontheon \n\nVisit Duke at 5 & ride in staff car to his home. After which I return to mine by metro. \n\nMetro here have no seats in some carriages & very few in the others. Each train of 5 carriages contains 1","38":" class car & as I am not a Frenchman ie I give my seat to any lady & will not seat myself so long as a lady is standing I generally stand & as often as not stand 2nd class for my boots are as comfortable in 2nd class as in 1st\n\nThe Frenchman is superficially polite but under the surface he lacks all the finer feeling for his women that we possess He will thrust her out of his way in a rush for seats. Never will he offer his seat to a lady. Women will offer their seats to crippled soldiers or women with baby in arms & occasionally a young man will do the same thing but this is rare. \n\nFares in Metro are 30c & 20c. First class tickets are always inspected. All tickets are inspected as you enter platform & if 2nd class are never inspected again.\n\nAfter dinner to night Clements intends to visit Nostre Rogis & I dig out Cailloud to accompany us. After a drink of wine in his atelier we set off & visit Nostre Logis \n\nSinging is exceptionally good this evening. Everyone seems to excel. Cailloud finds a modele & makes a appointment with her but he is like all Frenchmen never confident in a womans promise & says perhaps she will be there & perhaps not. \n\nAfter a while I try to sleep for 6 am very tired. In fact the sleeping fits that used to trouble at Woolwich seem to have returned. Perhaps it is weakness owing to lack of nutriment I have only 1 meal per day & in morning a little dry bread & cheese & water. This is my every day fare & perhaps is not sufficient but if I do not live in this manner I should have no money\n\n51\n\non which to exist. \n\nWe walk home again but this is a usual proceeding from Montmatre. Distance is 3 to 4 miles\n\n1-7-19 (Tues)\n\nIntended to go to a dance at Rue Tournon but as Mdlle Brisson has given me a invitation to a Bohemian evening I accept invitation & take Cailloud along with me \n\nWe visit the rooms of some artist in rear of Hotel de Ville There is a piano in room & grand pianist is expected. Also a violiniste who has been all day at her examinations at Conservatoire. Neither however arrive but company composed of painter & artist with 3 girls from Gallerie La Fayette & a man & his wife who tells Fortunes & after that we have two animated discussions (1) as to whether & similar institutions represent the real Bohemian life at Paris (2) Spiritualism. But were very interesting & illuminating.\n\nOn way home I try to buy some bread & Brisson gives me a loaf & a tin of sardines at her home. The evening was indeed artiste & Bohemian & I look forward to a similar one\n","39":"\n\nHad an appointment for 2 pm with Madelon to visit Le Louvre but receive a \n\nnote calling it off with the real reason given namely she wishes to spend the evening with an American officer who is leaving for America to night. Such candidness appeals to me. \n\nI visit Mdlle Hensson & find friends from Tahiti there. Mde Julien who knows Mde Tomel very well indeed & once made some trip with her. These people are very good & offer to get their son to buy my law books for me & the son makes an appointment the following day.\n\nTo day I visited M Chapries at Law School & find that I can pass my exams on producing certain certificates which I have left in England\n","40":"\n\nVisited bank this morning & find that after repaying money expended I have 246 fr (£8) to carry on with This places me on firm footing again for the other day all the money I possessed was 1 ½ francs & no opportunity of getting more even by borrowing although 2 ladies had offered to lend it to me\n\nBelieve the knowledge that you are without money in strange country & with no friends from whom you would care to borrow or ask for a meal is not a pleasant sensation\n\nI call round to Hensson we go out to buy some books costing about\n\n53\n\n30 fr but by buying secondhand books as recent as the latest edition I save 10 francs on deal even though one book is new\n","41":"\n\n Fourth & though about 40,000 Americans in Paris day passes off without any demonstrations save a fireworks display at stadium \n\nI visit HQ to ask permission to visit England & find them just on Dinner. gives me a lift as far as hospital to visit a friend of his his Dr Shackleton for I have not been feeling well lately but he assures me nothing is wrong. \n\nI then visit the Masonic Headquarter Vicor Emmanuel III & register. Then not knowing what to do & hearing that Coghill is fighting to day I find myself at Stadium. Find it impossible to get in. Having met Nathan one of the teams at Viviennes or rather in an ambulance car which was going to stadium we try in vain to get in \n\nAt last Nathan besieged a full colonel a APM & by his courtesy we get in & the stadium is a large oval in which several events are going on at same time The pavilions are all done in concrete & probably place will be permanent\n\nTo day Australia seems to be unlucky running into second place in nearly\n\nevery event America generally getting first place But result is not bad when you consider that our selection is from our little battle scarred army while Americas with her big conscripted population & also the fact that she has brought across from America about 70 competitor who have never seen France or the war seem to have been left long ago. \n\nAustralia I think has proved her worth – Another item is that USA pays each competitor an allowance on which to train. Coghill who has run up to finals goes out on first round to Martin (USA) \n\nI meet Roy Hendy who is liaison officer. Also Solomons from Rose Bay & Hardwicke – I dine at camp at Hendys invitation & then come into town with Nathan & Coghill We intend to go to Opera but having changed cars about 5 times the last one finally breaks down & we are miles too late for Opera. \n\nWe visit Montmartre which is now a crowded alley of all sorts of side shows, merrygorounds & a crowd in which it is impossible to move After a while we enter Elysee where there is dancing & skating. One of party wishing to see a cabaret artistique I take him to Neant which I have described before. After which I leave party & come home. \n\nSo ended the 4\/7\/19 for\n\n55\n\nwhich I had made no arrangements \nbut\n & though I tried to meet my American friend failed yet spent a very interesting day\n","42":"\n\nMet Madelon this afternoon at 2 pm also her friend. We were going to Louvre but day is so inviting that we change our plans & visit St Cloud the chateau of which was destroyed in 1870 by the Germans. \n\nThe lawns are not green & springy but rather neglected. The grounds are exquisite long shady avenues & quiet rotunda in the basin of the fountain you find a reflection prettier even than the trees themselves. I have bought 21 pc \nabout\n of this spot & they describe place much better than pen. \n\nWe see some chairs on top of Trocadero – the Emperors private garden & go up & seat ourselves Soon after a young women comes along & demands 10c each though there was no notice to show that chairs were not public property. Any how the view was worth the 10c & we sat there for over an hour overlooking Bois de Boulogne & Paris. \n\nThen we wander through the private garden where no artificial lines hurt the eye. The garden is a rustic wilderness with a lake & kiosk\n\n& a view that covers city & forest. \n\nAbout 7 pm I return to meet Hendy Hotel Continental (expense (1500 to 2000 for 15 days) & have an oporto, accompany him to his room & then find I am too late to get dinner in my old haunts. \n\nI choose an American grill room at the cheapest looking place hereabout. When I enter the lady in charge shakes hands. This seems ominous. I have chicken & rice & bread & cheese, no wine only water Bill 8.50 fr + 80 fr tip – Ice cream costs 3 fr Salmon Mayonaise 7.50. Such is the price one pays in the city. It is a big expenditure for me if I desire to return to England & purchase some clothes.\n","43":"\n\nCan get to sleep till nearly 4 At 5 am some mad singing enthusiast commence his practices. A funeral goes by then morning most of the mourners are in their ordinary working dress. Some appear to have just quitted their work & without changing joined up This absence of dress is very noticeable especially when going for an evening stroll round about home. \n\nTonight I dined with Mde Brisson. Soup Vermicelli fish & lobster, beef – beans – cheese & cream – fruit with wine & coffee & yet these are poor people After dinner we talked & I left fairly early for I am not in best of health\n\n57\n\nbut am always sleepy. I think it is the lack of exercise\n","44":"\n\nSlept till 3 this afternoon although I was in bed by 12. Wrote letters & then to Windsor where I posted them – then took a warm bath at Florida Hotel Rue & then home to escort Marie Brisson for her first visit to Montmartre. I took her to Chat Nour & Neant & she was highly pleased.\n","45":"\n\nAccording to arrangement went to meet Nathan at Bal Tabarin in Rue Victor Masse This is large hall brilliantly lit balcony on one side & raised platform underneath it on other bar beyond both & at far end chairs & tables \n\nImpossible to remain single you are seized as soon as you enter. Floor is too crowded as a rule After while a quadrille is put – girls hold up their heavy & exaggerated petticoats as high as their shoulders all the time they are strutting about showing their unmentionables in all their piquant glory. Show rather disgusts me on the whole. Price entry 4.50 Drink 2.50 lemonade 2.50 Articles left in cloak room cost 25 cent each & Hat stick & coat costs 75c. Rather warm \n\nNathan & Solomon both leave to morrow. Walked home for exercise of which\n\n1) am not getting enough\n","46":"\n\nI have been invited to Volney Club 7 Rue Volney to night as the guest of M. Dolleans & meet quite a nice number of peoples. Dinner as usual is good 2 wines, Soup, Fish, Meat, Jalousie, liqueur & coffee & all for 11 fr. Ordinary meal is 7 fr \n\nAfter there is a pleasant concert & the girl who has gained the highest prize at Conservatoire this week plays on piano – a wonderful exhibition. \n\nThe Frenchmen here are very interesting being the first Australian to be entertained by Club I am treated as a little hero & treated to champagne etc. & introduced to lady singers. Upstair I visited the gaming rooms. All French clubs are kept going by the gambling clique & play is always very high. \n\nI go home with & Dolleans promises to put me up as a non resident member but I do not accept for the present as I must consider expenses.\n","47":"\n\nFrom this date till 27-7-19 I have not written up anything and as in this period there was the French celebration of peace & national fete trip to Eng & peace celebrations there followed by a return & change of residence. \n\nAs\n\n59\n\nmuch has occurred that it is almost impossible to remember what happened on the different days so much so that I cannot recall what I did on some dates.\n\nThis day I took Madelon to Sacre Coeur – Place – Madame Nini & Spanish Bar, & then walked home in the early hours of the morning\n","48":"\n\nImpossible to say what happened\n","49":"\n\nMadelon has asked me to an afternoon tea that is given by herself & friends Besides myself there are 3 other men all Grecian but either naturlised or students one of them has been in French Air Service & carries a bracelet of thin gold chain which he says is distinguishing mark of Air Force. The refreshments are on luxurious scale for two students Conversation is ordinary. \n\nMadelon I think intended this to be a celebration of her exam which ended this morning but unfortunately she failed on the last day.\n\n12-7-19\n\nSlept nearly all day in order to get some sleep in hand as this is the commencement of the festivaties\n\namp; for the next three nights I do not go to sleep or to bed. \n\nThis year the celebrations are united & combined with the official peace celebrations & you can imagine what days these will be – days that have been looked forward to during 5 years now. \n\nThe streets are crowded & everyone seems to be out & as a crowd it is as good natured as one of our own but pulsing more with life. I was surrounded by a party of young imps all girls who whipped off my hat as a souvenir & when I pinned one of the girls as a hostage the hat was returned on condition that I kissed all the group, & they were so sprightly that I willingly paid toll & recovered my hat though it would have been returned with the kissing.\n\nOnly with difficulty can you get along the Grand Boulevards. Every taxi is surrounded & the crowd try to rock it till it capsizes but usually a gendarme arrives before this or the driver asks pity & they let him go. Often a crowd of 10 or more all sorts girls soldiers sailors foreigners (Americans or English or British) surround & dance in a circle round any one they meet. \n\nEveryone who can\n\n61\n\nplay any instrument places himself freely at disposal of the crowd & whole crowd dances in sheer joy staid old age with boisterous youth. It matters little whether you have met your partner or whether you will ever see her again It is the pleasure of the moment which is passing & must be caught & lived ere it passes for ever\n\nTowards 2 or 3 am the better class of people have gone home but the libertine & those whose trade it is to walk by night continue one.\n","50":"\n\nTo night I decide to take Mdlle Brisson along with me She has been very good to me, asking me to dinner at her place, arranging Bohemian outings & getting tickets for concerts & as she cannot go out alone. \n\nAfter dining with her & her mother I take charge of operation show a parisienne who has passed 15 years in Paris; Paris I take tube to Obligades to see Arc de Triomphe from which these emotional people will break the chains which has shut off this arch from traffic ever since their tragic defeat in 1870. \n\nAlongside or rather at this moment under the arch is a cenotaph erected as an altar to the\n\nmemory of those who have not returned from the war but whose memory this city places above all else on this day of rejoicing. The statue is only of wood & plaster but the entire city files past it in a silence that is heartrending.\n\nThe amount of black in the crowd & the homage paid to it no matter what the condition in life of the person is a tribute of never dying gratitudes to one who has lost some dear one for their liberty The spirit of is entirely absent in this vast crowd which has come to pay its homage to the immortal & nameless dead. \n\nThis spirit of sadness seems to tinge all the festivities. Whether the losses are in every family or whether the cenotaph looming at top of Av. Champs Elysee is an ever silent reminder I know not but there is a sadness here which later in England I failed to detect. \n\nThe tubes are packed & it took us nearly ½ hour to get on to the station & in the train – well ordinary trains are packed but to night sardines are not more tightly packed & the hot smell of the tube & the body smell of the crowd some of whom are country people is not the incense breath of Morn.\n\n63\n\nIt is impossible to get near the cenotaph even though we have gone to Obligads to try so we decide to omit the ceremony religious in its nature & officiated by the highest dignatory in the land as the most fitting person to honour the fallen\n\nWe pass down the beflagged & bepoled avenue & looking back in the distance saw the enormous catafalque veil removed 8.30 enshroued in clouds of incense which while under the glare of strong electric lights seems clad in ghostly clouds. \n\nAt Place de Concorde the fountains are playing & white green or red searchlights are played upon the pulsing water with an effect that is beautiful. \n\nAlready at this time midnight nearly 1,000,000 people have taken up their positions along the route to see procession to morrow Chairs & food carried from home which sometimes is not to near. After crossing Rue de la Paix we enter the Boulevards in which some of the buildings are very well illuminated \n\nAt several places there are open public balls orchestras provided by the State. At one of these the Bouise we visited. Every adjoining café with an eye to business has placed tables right up to middle & in one case across the road which now\n\nhas no traffic. \n\nHere I saw a one legged soldier looking mournfully on the hilarity & dancing & then go up & ask a girl for a dance & she pretending not to notice the wooden leg did a few slow turns with him for he had gained the right to such a small return at least that is how this pretty laughing little creature put it though he smiles were lost in tears as she spoke. \n\nWe did not dance but moved on to Montmartre\n","51":"\n\nI have called this 14-7-19 but really there was no division line. I do not know where midnight found me. \n\nMontmartre ie Boul-Clichy, Rochechouart has been transformed into a pleasure ground. Side Show, shows for real champagne swings, aeroplanes, merrygorounds of all kinds from motor cars to pigs, steam swings, relics from Noumea. Every conceivable side show is there. \n\nWe visit steam swings a contrivance which succeeded in frightening more girls than all other side shows combined & hence most popular. Ride last about 2 minutes & costs 1 fr Merrygorounds are usually hand propelled & cost 50c. The machine asks a pourboire but never gets any. \n\nThe relics of torture were good but nothing from Noumea was visible though this is what attracted me. We saw pancakes\n\n65\n\nbeing made in street & bought & ate them. \n\nI may add that for to night I have taken off my belt & stars & appears as a real digger. \n\nWhen matters began to quieten a little here we descend to the Boulevards again & about 4.30 am I think breakfast would be nice & as I know a nice little restaurant in Rue Reelle which is open all night or at least in the early morning for Les Halles we go there only to find place crowded & that no more are being admitted\n\nWe try other places with same result & then adjourn to first to await our turn. Inside I sample the famous Soupe de l’oignon which is only bread soup with a concoction of cheese on top no onion is visible hence the name.\n\nAt 6 am I take a trip to see if it would be possible to see procession as Brise wishes to see it. To go along Boulevarde is absolutely impossible & as we are near end of route Champs Elysee is out of the question. \n\nSeeing the ground a little elevated some distance from curb with a street that has not been closed up. We take up our stand with 2 hours to wait for commencement of procession & another 2 hours before it reaches us & then it comes.\n\nMarchhaux & all who have been or have done anything in this great struggle – one after the after – & the colours of all the regiments\n\nsome of the colours being only shreds. After a long gap came the British with the standards flaunting in the streets of this Paris the name of battles which have stopped the victorious career of a militant France & saved her from her own Prussianism. \n\nWhen all have passed we slowly or rather as fast as crowd permits us walk towards home finding a tram for Montrouge start somewhere on route we rush it & thanks to my strength get in though I strain one of my fingers in doing so\n\nI take Brise home & have a meal at her place & return to my room for 2 hrs sleep if I can get them. Unfortunately I miss them as I have to meet Harrison a scotch officer at Pigalle Restaurant Place Pigalle. He is not there so I dine alone in one of the cafes on the Boul Clichy & leave before meal is half way through as service is too slow. Waiter reminds me of waiter in Merry Widow only he possesses more sense.\n\nI turn torwards Montmartre Sacre Coeur to see fireworks & here again luck favours me Finding Sacre Coeur crowded I enter Parc St Pierre from the bottom – the only possible way I find out afterwards as everyone has gone to top first & cannot get down\n\nI find a nice spot for a seat & a nice bush into which I can withdraw if it rains (as it subsequently does) Here I see all the successive points of\n\n67\n\ndisplay, Point Neuf, Parc Mountsouris, Buttes Chaumont, the St Louis both points which to me resemble Hotel de Ville & Louvre. \n\nSuch a display I have never seen, vast fountains of fire 300 or 400 ft high & continous for 15 minutes or so. The vast spidery webs like a gigantic spiders are glorious. The magnificent rocket displays grander than anything we have had out our way, are simple alongside the other displays. Never have I seen anything to equal it & probably never will again.\n\nBelow in square there are 30 or 40 thousand people waiting to see the display behind me at Sacre Coeur. From time to time the building is thrown in red by port fires & at others it is illuminated by 6 powerful held searchlights which are stationed here for display purposes\n\nEarlier in night there was a sortege lumineux consisting of a torchlight processions with 800 soldiers bearing torches, bands etc being supplied it formed at Av. d’Antin thence Concorde, rue Rivoli, Chalelet, Pont au Change, Boul du Palais, St Michel, St Germain, Quart D’orsay & Pont Alexandre. There has been one for peace & peace signatures & are always difficult to approach on account of crowds. \n\nAt 1:0 pm there was a Fete in Tuilueries with concerts & country dancing & at 8 pm a free operatic display at Arenes de Lutece\n\na name which recalls Roman occupation\n\nAfter quitting Montmartre I descend to the Boulevards & dance, gambol carry girls on my shoulder & generally act like a school kid till I am too exhausted to carry on & wander home at 8 pm. Eiffel Tour & Panthion with port fires & winds streaking it into layers – beautiful \n","52":"\n\nCan recall what happened to day\n","53":"\n\nWent to GHQ & saw Harrison & got leave to go to UK & am leaving at 11.15 pm to night. With Harrison visited canteen, then to RTU & then home to pack up prior to leaving. I am dining to night at Volney Club (11 fr 50) & draw money. \n\nIn street Madelin de Neef meets me & as she is looking for a house I assist her giving her a list of names & escorting her to many of them myself. She gives me a letter to Molle Gallagher Tavistock Square London in case I can not get a room. \n\nI dine at our little café & then adjourn to La Source et the Grand & get train at 11.15 pm with a compartment to myself & another man, so I can stretch out & go to sleep.\n","54":"\n\nTrain was due to arrive in Boulogne\n\n69\n\nat 6.30 but at 6 am it is at Abbeville A wool administrator a Miss Tompkins from Yorshire joins us in carriage. \n\nOn arrival I find that early boat is postponed till 12.30 on account of victory troops going across. When I come for my ticket there is some trouble as MLO wants the authority. I do not argue & then WO at gangway will not let me on board & then I return to MLO & get a return ticket & all is now well.\n\nBiarritz pushes off about 2 pm & we get to Dover at 4.15. I am unable to buy any pc of Dover as the train meets the boat & the town is about 2 miles away. Dover is a harbour that has been erected at an enormous expenditure of money with too small openings for vessels. Within there is a fair amount of water. Over all on the hill is the old castle of Dover & outside the harbour the German wreck that I saw when I first entered the channel \n\nI arrive in London about 6.21 & find that in spite of crowded condition of London I can still get room here though I may have to sleep one night on a stretcher.\n\n18-7-19\n\nI forgot to mention that object of my visit to London is to obtain a certificate of my university degrees which are in my trunk at Kit Store for if I can\n\nproduce some evidence to Minister of Education I will be able to sit for degree of LLB – a two years course & I have 8 mos to take it & the exam is oral & in french \n\nSo first visit I make is to Kit Store get the certificate – my coco palm walking stick & several things of use to me & then back to town – to Bank & draw all I have £16 leaving 30\/- in Bank. This is all my reserve.\n\nI then visit Alcock but they are closed. I then make arrangement to repair my stick & have job finished to day as I intend to leave London Saturday night if I can get all done. \n\nI see & French contingent arrive & then at Moss find that a ready to wear uniform costs 7 ½ gns. I visit & buy some puttees, collars shoes (17\/6) & then Myers Tunic & slacks £2-10-0 Buttons must be changed etc but still a great saving. Then to Dean & annex a civilian suit for £5 & hat 4\/6. In Strand I got silk faced white shirt for 8\/6 & repairs to walking stick cost 2\/6. \n\nAs I can move quicker without parcels I adopt plan of buying & leaving parcels & of course fail to collect one worth £2-9-0 a havresack with puttees etc. This means that I must wait till Monday, & pay for two days extra here & in France. However it is better to do this than lose £2-9-0\n\nI dine to night as usual in Soho\n\n71\n\n& to night at Restaurant Dieppe the only one I can find open. It is next to Au Petit Riche. Here I make friends with a Bank clerk from Lloyds Bank. Two French soldiers of the visiting contingent are being entertained by French party & the restaurateurs. In return the soldiers sing songs & one of them has an exceptionally fine voice which makes the evening pass very agreeably until ","55":" pm\n 1 am when I start for last tube\n","56":"\n\nThis is the English date for the official celebrations of the Peace There is to be a procession similar to that at Paris but this of course will be mainly English – a tribute by the British nation to the victorious heroes. For this reason, Foch would not come across thinking he might detract from Haig’s triumph a thoughtful & kindly act I think but is prevailed upon to come. \n\nAt Paris procession started 8-20 here at 10 am. At both cases it took about 2 hrs to pass. I have wonderful luck at 9 am I am in bed & at 10.15 am I am looking at procession from a position that many who have waited several hours cannot better \n\nor equal. \n\nIt happened like this I was too late to be certain that buses would get as far as Whitehall so I went for Tube. There was a big crush but I got in & in train some gent whose little boy I had saved from being crushed advises me to go to St James Park which is inside the ring which procession makes & hence after this train is out of bounds This reasoning is good & we get an excellent view in Rochester Row.\n\nHer Navy marches first after the visiting contingents of course Haig is very pale & as it turns out afterward is very ill. After all has passed I try to get out but policeman says only way is by ‘plane but if I wait an hour at Tube station I may get in. \n\nAs I want something to eat having missed my breakfast I decide to wait but imagine my surprise when I walk right in. Everybody has expected the crush & avoided it. I reach town long before procession has reach town & dine in comfort as all the world is still looking at the procession. \n\nAt 2 pm there are several concerts in Hyde Park & rustic dancing including a revival of the old English dances\n\nAt 7 pm there is a choir of 10,000 which perform in Hyde Park \n\nI dine tonight at Pinveli & lucky to get in as special dinners are being given in every cafés called Victory dinners & every table has been booked for weeks ahead. \n\nI meet an Englishman & his wife John O. Mayes of Constantia, Cienfuegos Cuba & now of Overseas Club, Aldwych London) & we join up in order to get in as there is a table for 3 available.\n\nInside all is a wild scene of revelry. A party of RAF & WRAF in one corner 2 opera or theatrical singers near by a Belgian woman & her husband a spanish lady all more or less half seas over & all making the greatest possible amount of noise. \n\nWe order a boule of Chianti not knowing what a bottle is & behold a bottle which takes both hands to hold & about 18 in high arrives. Much excitement is caused by its arrival & many participate in its contents. One Aussie from Egypt a law student from Adelaide nips me for 10\/-. \n\nFun runs high & I did all sorts of things like the rest. Autographs are frequently collected & 2 chaps collect me & we do a forward rush down room clearing all before us including tables\n\nLeaving here for the streets I encountered such an infernal din as I never heard before. Every kind of noise making instrument seemed to have been concentrated in streets & whistles & etc add to enlivement. voices are too weak to be heard in the din \n\nThe fireworks display contains fire portraits of King & Queen & beautiful rocket displays but cannot equal the display on the other side of the channel. Then English display cost £20,000 the other must has cost £100,000 or more \n\nAs room is not certain to night & stretcher is all I can expect I do not go home but try RAC & am advised to go to Savoy Baths which I do. This is really a Turkish Baths but the cubicles used to recline on are used for sleeping apartments by night, a cooker is kept on premises & breakfast can be obtained so it is as good as an hotel. \n\nMy word I have slept in some queer places since leaving Aussie.\n","57":"\n\nLeaving Baths at 12 30, I do not know what to do & decide to visit Madelins friend Miss Gallagher & \n\n73\n\nfind her to be an exceptionally pretty & entertaining young person so much so that I invite her to spend the afternoon with me. \n\nWe visit the Angels at Selfridge guarding 3 figures of soldier sailor & airman We then visit the Imperial room of Trocadero & find nice music & nice refreshments & fruit salad served for 2\/6 apiece & we have an interesting talk. I see her home & she invites me to supper & after a talk I leave her promising to call again in November but most likely shall never see her again\n","58":"\n\nSpent morning collecting my goods & find at Railway that to go to France via Dover & Calais I must wait till to morrow at 7.50 am\n\nIn the evening I take a girl Lily Brooks who is staying in house to see decorations & illuminations. We commence at Constitution Hill & then to Palace & the Mall. The route here is lined with columns of plaster & on each amid a group of flags (allied) is the crest of some British Regiments, & in front of Palace four square columns with 112 of the big battles of the campaign \n\nHow would the Americans get on with their stars on the ribbons\n\nwith numbers like this Illuminations there are none for the electricians have gone on strike. The decorations are I think better than those of Paris & some of the private firms are excellent eg Frascatis & Army & Navy\n\nAfter supper at the Strand we adjourn home. \n\nThere was one thing that I liked about the French procession & that was that in front of all marcher were wheeled a 1000 war cripples. This had no counterpart in England but seats in the Mall were assigned to widows & orphans, to Chelsea pensioners to wounded soldiers & to school children. In France school children were provided for but I dont know about the others. Seats were made of empty ammunition boxes. Some was done at Paris I find\n","59":"\n\nRose at 5-30 am this morning & breakfast was ready for me & Lily was waiting to say good bye. This will be the last time I shall see her as she is being married on Bank holiday. \n\nI get a good seat & run into Folkestone at 10 am By mistake of MLO I get on Boulogne boat & dont bother to change when I see Calais boat or tub, a Belgian affair. MLO tells me I can run\n\n75\n\nup to Calais by train. \n\nArrived at Boulogne entering stern first as usual. Passage has been slightly rough but everyone has been sick Arrived in Boulogne I invent a story about my luggage having been put on the other boat & get a free railway pass to Calais.\n\nTrain leaves at 2 am & is 2 hours late. It arrives in Calais to let me have a good look round I have travelled up with an English sister stationed for 2 years in Calais & she puts me wise to best way of seeing . \n\nI visit Bassin des Chasses a pretty lake full of boats & life separated from sea by a narrow stretch of sand. Place Richelieu with its Bourgeois de Calais by Rodin taken away & packed in a cave below Musee thence Place D’Armes with it beautiful old Musee once the Hotel de Ville\n\nThe Garden Richelieu I forgot to mention a pretty piece of rustic wildness – the Esplanade now filled with huts & an army transport centre & citadelle in rear. The old Notre Dame seems to me to have been a castle as well as a church for the surrounding wall & a gate is certainly not clerical. It is situated in a very dirty & secluded quarter hemmed in by dirty buildings\n\nEverything here seems to have \n\nsuffered from the bombardments & still mark the place where war has been. On other side of Town Boul Jacquart passing Place Centrale & Parc de St Pierre passes the markets & leads up to Theatre a fine building with a statue of Jacquart in front of it\n\nI dine at Club but being among English officers do not say one word to anyone such is my admiration of English manner that I have adopted them with English men. \n\nI get train for Paris at 10.30 pm & find myself in compartment with Mdlle a descendant of the poet & a nurse residing temporarily at \nSceaux\n Rue Amyot but actually at Sceaux\n","60":"\n\nAfter a pleasant night in the train I arrive in Paris at 7.15 & after putting my luggage in cloak room go straight to Brise No 6 in Rue Ortolan & breakfast there. \n\nWe then start out to get key of my new abode but find that Marie Le Breton is out. Key is to be left at Concierge but is not there so we search restaurant, her home, but not till nearly 5 pm do we get key, having spent afternoon\n\n77\n\nin a picture show, the cheapest part of which usually costs 3 francs here. \n\nRoom is a chaos of disorder but Brise is a gem & soon place is straight enough to sleep in. I dine with Brise & then collect baggage from Gare du Nord, & then see Brise home.\n\nOn the afternoon I had collected baggage from Marignon & said good bye to Rue du Sommerard. Although I had given over my room 5 days before leaving yet lady refused to let me have one night in addition & I told the maid she might have compromised\n","61":"\n\nRose 9 am & at 9.30 Brise arrived with cheese, bread, coffee, milk etc & went out for warm milk. We start in to clean up & in course of a thorough search find punaise in the divan. This causes great consternation & energetic measures are taken \n\nBrise is desolated for she has found these rooms for me & is ashamed of her recommendation I on the other hand am quite pleased\n","62":"\n\nBrise arrives early again armed\n\nwith no end of death dealing liquids & also food supplies. After cleaning is finished she buys some meat & cooks it & we dine together She stays the afternoon & I go to her place for dinner. \n\nAfter dinner we go for a walk in the Bois des Boulogne, but it is late when we arrive there 10.30 pm. We encounter groups of men who apparent aim is to waylay anyone they can catch but on two occasions when I wheeled on them they did not seem to like my manner & cleared off in one case without waiting to answer my query.\n","63":"\n\nAnother I have lost at Montesquare Huesson & arrangement for Monday\n","64":"\n\nExpected Le Neef but she did not arrive. \n\nBrise blew in & wanted me to dine with her. \n\nVisited Le Neef but she is out & then went onto Montmatre to search for Mde Nini in Rue Norvius but dined at Place du Tertre in the public square It is deliciously fresh but one time I would not have eaten in public. Farmers used to worry me Dinner cost 7.30\n\nIf wine is not taken the profit is\n\n79\n\nadded to the bill as a supplement. I visited Nostre Logis but found no one there whom I knew.\n","65":"\n\nWent to visit Harrison & then to Canteen where I made purchase amount to 27 fr then to see Shackleton but he will not be there an address is given 13 Rue Marche du St Honore & I pick up driver looking for him & ride along with him. \n\nMeet Shackleton & arrange to see him to morrow at Pepiniere Barracks Place St Augustin at 10 am rather early for me. Then dine with Brise & take her to No 2 Rue Brown Sequard & we pass a pleasant evening with the Gamels & the Huesson who drops in.\n","66":"\n\nReach home at midnight & find parcel Brise has left for me contains sweetmeats as a birthday present. \n\nYesterday I got a packet from Australia containing my pyjama 2 handkerchief & some chocolates & so the first thing I did after reaching home was to eat some of the two chocolates & sleep in pyjama & think of home Was it not lucky to arrive at such\n\nan opportune moment\n\nIn morning I visited Barrack but Shakleton is not there However by waiting for a car I make the acquaintance of Whelton an Irish in Air Force & he invites me out to lunch at Buc. The drive out there through the Bois di Boulogne then St Cloud & Versailles is beautiful. These parks would be worth being a monarch for even if once in a while some one more unfortunate than the others lost his head. \n\nI spend day at Buc & then return in a ambulance waggon which travels at 40 miles an hour most of time to amazement of all French police but being military they do not interfere. \n\nWe go to Nord & then in Champs Elysee have an accident in which a gendarme narrowly escapes being killed This delays us for some time & we have to run him to a place where he can put his bicycle However we part the best of friends & he will claim against John Bull & some day will be paid perhaps.\n\nAfter dining in a little place in Rue Pergolese\n\n81\n\nWe hit the trail for Montmatre & commence a series of wild drivings with a madman at the wheel who can not drive under 30 miles an hour & so never can turn at proper turnings & is so far past when he can pull up that we have no idea of proper turn. \n\nWe go from Boulevard to & finally pick up two girls & spend night in Senga – a dancing cabaret & finally dropping girls one an Algerian & the other a Belge but both speaking Russian fluently at their homes promising to meet them at Taverne de Paris Aven. Clichy. \n\nSuch was history of my birthday. Rather a rapid one\n","67":"\n\nCleaning up again & finally declare place clean. Brise cooks dinner & dines with me & then I go to her place for dinner. Where she puts buttons on my new coat & sews up pockets, after a vain attempt to blacken the buttons\n","68":"\n\nStudy all day & make some progress Have warm bath in evening\n","69":"\n\nSame story. Marie Le Breton\n\nvisits me to day to see if I am quite comfortable. This is her rooms & she is letting me have them for 30 francs a month seems too good to be true.\n","70":"\n\nBrise arrives this morning & spends all the morning cleaning up & disinfecting place. She brings me hot café au lait. I can keep rooms for as long as I remain here – The price is 25 fr per month only, & with Marie Le Bretons furniture it is very chic.\n","71":"\n\nMake arrangements to take Brise out for the afternoon. We go to Cimitiere Pere La Chaise. Originally the gardens & grounds of the confessor of Louis XIII & now the resting of the Parisian dead, not of the famous dead for a special place The Pantheon has been reserved for them but so far not many, for it commenced only with Mirabeau. Pere La Chaise contains all prior to that date.\n\nWe talk of Rookwood as a city of the dead but it is a wilderness to this city of the dead when the dead are crowded as thickly as the living in tenements, so much so\n\n83\n\nthat as the price for a concession a is so dear that you can buy a tomb for 30 years or less & at end of time boxes are removed to make room for others. \n\nOften the cover of a tomb is opened to let air in or stink out. I dont know which I suppose the system of embalming is up to their ordinary standards in hygiene. I looked down several & found them to be walled in down to 20 or 30 ft & at sides & on crevices were masques apparently of inmates who rest somewhere below perhaps near Australia. \n\nThe monument aux morts is an impressive affair. A void towards which suffering humanity whilst two lovers are passing over threshold. Below the angel of immortality shows a family whom death has reunited But it would have been better if this lower group had been the other side of the veil. \n\nAbove that is the Chapelle from the terrace in front of which a beautifull panorama of the city unfold itself Quite close is a with a dominating figure of Casimir Perrier whose head is surrounded by a swarm of bees or flies. \n\nTrees abound everywhere & one is almost always in the shades among the shades. The magnifence of some of the tombs eg the Demidoffs is beyond any description. Fontaine & Molier rest in same tomb. \n\nAmongst the tomb in older part of cemetery that\n\nof the tragedian Talma with just this one word on it. This part of cemetry is a closely packed system of vaults all above 10 ft high & all under shade. It is as the city of the honoured & ancient dead for most of the old families & well known personages are envaulted here. \n\nFurther on we pass to the crematory with its arcade for the ashes which has been cheapened by arranging flowers most of which die in a few hours & the appearance is worse than if they had never been placed there. \n\nThence on to Musselman cemetery enclosed with a little hedge & finally out. Of some of principal graves I have purchased some pc from a woman the chapel whose clothes reeked of human corruption I dont know how she stood it but I had to get out in fresh air. I dont mind visiting a cemetery but I dont wish to caress & commune with the putrefied remains of what was once humanity. \n\nLeaving here we visited Notre Dame de la Croix it was closed. We then went up Menil Montant to Buttes Chaumont once a disused quarry & garbage tip but now transformed into a glorious park with walk, grottoes, cascades & a lake. \n\nFrom a temple on island a glorious panorame of the N.W & beyond of Paris unfolds itself though the city is veiled & must be seen\n\n85\n\nfrom other side of Parc. Thence home to Mde Brisson where I dined & then sat up all night with a sick friend\n","72":"\n\n I am ill & cant walk – lay up & do nothing\n","73":"\n","74":"\n\nStill the same – am attended on almost night & day with an attention that is beyond comprehension till secret is revealed\n","75":"\n\nStill the same – state – if matters do not improve I shall have to call in a Doctor. \n\nTo night my little friend who has wished to give me a substantial birthday present has invited me to Opera Comique where one plays what is known as Grand Opera which here is reserved for the Opera. The seats are excellent & cost only 10 fr but there is a box for poor, a war tax – a supplement – 2 fr for booking & in sum one pays 15 francs.\n\nThe theatre is like that at Bruselles – gilt everywhere Piece is Manon & some of singers are excellent though the best have left the city in this hot weather. It is like\n\nour spring. The foyer is large but the balcon open on the rue & has little attraction except for smokers. Most of world promenades in foyer & I limp there also. My leg is now very painful.\n","76":"\n\nPay a visit to M. Petit Dupalle re my certificate but he is out & I arrange to see him to morrow. (When however I am to ill to move) \n\nI then visit garden & Musee de Luxembourg with its wonderful statuary though one can find fault with much that is there In fact it turns out that is not the by which one is placed in Luxemburg but rather \n\nThe paintings are removed in place to an exhibition of Carolus Duran whose early painting, The Dame au gant (1848) are the best. The finest picture in collection is a painting of Duran himself by one of his pupils an \nEnglishman\n American named John S Sargent. It is a masterpiece & puts to shame the rest of the collection. I should very much like to see more of Sergents work.\n\nAfter this we reached the Church of St Sulpice in front of which is the Square St Sulpice with it fountain supported by the 4 leading preachers of France & alongside The Seminaire du St Sulpice where one of the acts of Manon has peace. The church is in Renaissance style – a roomy edifice once a Temple of Victory in times \n\n87\n\nof Convention & the scene of a dinner party to General Bonaparte. The frescoes are excellent though some are showing signs of wear The altar & pulpit are best described by reference to pc which I have forwarded. There is a meridan line in this church but I forgot to notice it. \n\nAfter this I returned to Rue Delambre a pied The day was rather too much for me\n","77":"\n\nRepose all day headache – fever, glanular swellings –\n","78":"\n\nToss about all day. Brise makes many trips per day & suggest that I rest at her home where I can be looked after. It will save her an hours walk 2 or 3 times per day & she will call in her doctor. If I am no better I have decided to this \n\nTonight we went to Odeon one of the 4 theatres subsided by Govt entirely (Opera, Comedie Francaise & Palais Royal being the other). Drama was L’Arlesienne. The music by Bezet was excellent. Orchestra had 14 violins alone The acting was good but at times a little tedious. It needed a Pauline Frederic to play one part & she was not in cast. \n\nAfter theatre as I am still ill, I take taxi home to her place & put in a miserable night. Brise pleading to for me\n","79":"\n\nDr came to day & so expect relief tonight All the day is spend in bed. I have a tonic to take & poultices & hot compress\n","80":"\n\nAll day in bed waited on hand & foot by Brise who is making a slave of herself for me, nothing is too much no journey is too long. Food is her greatest worry what will please me most & in these day there are big food troubles\n\nFirst the consumers refuse to buy then the suppliers refuse to supply Often she has long walks to get anything & all the while humping the big load she has already bought. She has a heart of gold, & that refined.\n","81":"\n\nStill in bed but making great strides towards recovery. Still the same patient & careful attention. Was ever man so carefully & thoughtfully tended I wonder A cousin arrives & stays the night\n","82":"\n\nRecovery is rapid. I do not put foot to ground. Breakfast is shared on the bed with me. Now I change rooms at night for the two girls. Tomorrow is Brises fete & she is the recipient of many flowers & letters & a Salome by Wilde.\n","83":"\n\nFete de l’Assomption – a great day & once Napoleons day but now used by worn out city people to take a holiday into the country & owing to the rush the papers wisely comment that those who stay in the city show best sense for the struggle to get away is too much. \n\nSave for Church services \n\n89\n\nthere is nothing doing & though I am sure I can walk without detriment I remain within. At night Marie Le Breton & her husband come to dinner. \n\nThey have seen Paris. It is absolutely deserted & the papers have pictures showing the places ordinarily thronged with people without a single person or vehicles visible. – A scene of desolation & the photos are taken at 2 pm & onwards & the photo are those that are taken in an ordinary stroll. \n\nSo I have not missed much by staying in.\n","84":"\n\nLife at Rue Ortalon is very pleasant I pass all day in pyjamas & study all the time Meals are provided without waste of time by hands that \nare\n only ask the right to do something Life has its charm. \n\nAll tenements a little court. Everyone is curious – & every one is talkative No one cares who overhears or oversees them. There is no such element as self consciousness, & often their language is not classical. \n\nOne family below take their meals where all can see & hear them accompanied by 4 cats 2 rabbits 2 dogs & other animals all running loose. To back is a collection of slums patched up by rags & temporary makeshifts & filled with a population whose chief characteristics are age & filth, & into whose daily habits you can inspect. There are some children aged about 10 though how they have survived so long. Goodness knows. \n\nTo left is Rue , a street which contracts to 7 ft wide for almost ½ its length & has railed balconies\n\nof the part where the houses were built before the level of street was taken & still exist at night, the street is alive with rats. In fact almost any street in Paris has its rats by night owing to garbage systems. \n\nGarbage here are placed out in street at night & are then visited by cheffoniers miserable creatures half human who overall the garbage for & do not pick up the litter they have made. The garbage cart comes along some time before the morning. No wonder the plagues used to kill off Europe 600 yrs ago when sanitary conditions were not so good or rather less worse.\n\nIn Rue Monge coming home one night with a girl time 9 or just after dusk, an old dame rushed ahead into first doorway – it was closed – & standing upright soon a sound of rushing water was heard & the old dame laughs & made some remark. No sense of shame though my companion was overwhelmed.\n","85":"\n\nLeg is better – study is going good & I have half made up my mind to take the licence – ie to do 3 years work in 6 weeks rather a tall order & too big I am afraid. However I will make up my mind later\n","86":"\n\nMake my first visit out to day but avoid walking as much as possible. These avenues are simply glorious with their shaded walks of trees. Raspail has an avenue down the centre of itself & every few yard a bed of flowers\n\n91\n\nor shrubs. Montparnasse has its acacia trees on the footpath a row on either side. The streets are constantly watered & there is a freshness in the air that reminds one of the country even in this overcrowded city.\n\nI find disappointment everywhere. Petit Dutailles is on leave. No letter at bank – a shop where I wished to buy pc closed – a difficulty looming to obtain the books requisite for my study, & there will be no dinner at Cercle Volney\n","87":"\n\nSame story of care & attention & study \n\nIn the night we take a stroll to Parc Montsouris a pleasant little park just within the city walls the summit of which forms the country for the poorer class & they are legion in this quartier.\n","88":"\n\nThis day as there is no Volney circle I accept an invitation to help celebrate the fete of St Jeanne chez Rue Merlin near Pere La Chaise though poor they do themselves well for the fete which is merely the saints day after whom you have been named. Wine is Chianti red & white & champagne to finish party is 6. Morel is a big cycle ride of some repute. \n\nWe miss last metro connection but find a taxi (7 fr) It was a wild night.\n","89":"\n\nSame story, study, sloth & attention. M. Arison & his daughter arrive to day. I am off colour\n","90":"\n\nVentured out again to find some information re this Dutailles who seems to me a bit of a humbug. I find that I must make the application. I could have & would have done this 4 weeks ago if Dutailles had not appeared on the scene. I walk thro garden du Luxembourg & thence to Rue Ortalon.\n","91":"\n\nRise late – cant study – write letters to M C Ministre who they say is to be the next president. I am alone almost all day.\n","92":"\n\nVisit Versailles to day – rather late starting but get there at 2 pm. I have previously seen the grounds of the palace. The palais an enormous structure erected by Louis XIV or rather Levan & Mansart would cost to day £20,000,000 It has accomodation for 10,000 inmates rather a large family but then the King brought his Ministers & Parliament to be close to him for it was from here that Louis XIV directed the affaires of France during its most illustrous period. \n\nWe entered the chamber of deputies but find that here even the French people are exploited for the benefit of the garden. People are grouped in a room to number of about 80 & then door is opened & you are led like a flock of sheep to room & on going out you move as a herd & pay something to the flunkey who opens the door. \n\nBeing treated like this does not\n\n93\n\naccord with my tastes & I determine to leave visiting till another day. \n\nI pass along thro avenues of arched trees bordered by ivyclad wilderness till I reach the Grand Trianon. Yesterday was fete day of St Sidonie & the Roses of Trianon bring back memories. \n\nThe building of which the columns are all red marble is one storied & extremely \npleasant\n handsome while the gardens in front are a dream. The wooded walks & shaded avenues lead on to Hamlet of Marie Antoinette with its temple of Love & English gardens. \n\nIf all the gardeners who throng the palais were put to the useful task of cleaning up the glades & drives & were put down the palais would be paradise.\n\nWe visit the Petit Trianon & then back to a tour of the fountains of the Palais. Next Sunday they will play & I will let you know more about them.\n","93":"\n\nPresented my demand for Equivalence to day to Monsieur (in full if you please) C Ministre de l’instruction Publique & continue to study But several things have been omitted. \n\nHe requires proof that I have been born & says birth certificate must be produced. I point out Australia is more than 100 yds away & he says get a military certificate & get it legalised by British consul, & have translations of all certificates for this vast\n\ndepartment does not apparently possess one individual whose mental capacity is equal to the task of mastering the English language. Even in our Customs I used to interpret French certificates & did not insist that translations should be forwarded.\n\nIt is this official procedure which cripples commerce & civic relations in this country Never was there a country whrere Liberty means less especially as it figures everywhere alongside of Equality & Fraternite. Equality is non existent \nbeing\n the social gradations being changed for a hierachy of Officialdom & militarism. \n","94":"\n\nLost day\n","95":"\n\nObtain a certificate of birth from British AP.M. & demand a translation which gives me an introduction to the French liason officer a law student named Rochenback who gives me much information re law course. \n\nI visit consul to get certificate legalised. This consists in certifying to my signature & costs me 8.75 & a\n\n95\n\nwait of 2 hours even though I obtained a priority of admission over 50 or 60 who were waiting. Consulates are institutions formed by Govts to fleece its subjects found in a foreign country. If I were destitute I should never go near a consulate unless compelled. In N.C it was the same robbery.\n\nIt is this system of fleecing by ones own countryman I cannot understand. A foreigner has some right in his own country. Just imagine 875 f to verify a signature the work of 1 minute & work which any fool could do. The good that these institution do is annulled by the extortions they make. \n\nI then make my way to rue Grenelle where M. le Ministre has his bureau at 110. The building is absolutely destitute of human beings. Knowing where to go I enter a large room which a flunkey possesses to himself & leave my papers & call again in 15 days. \n\nOn my way thither one circumstance amused me. I wanted to know way & looked for nearest policeman. I saw a senior officer in French army approach him, salute him, ask him way & resalute & go away. I did the same saluting act which is mere common politeness here. But fancy\n\nsaluting a policeman in George St. Sort of makes you think what Equality means here. \n\nPassing along Boulevard St Germain (which contains many princely mansions & courtyards which are lost by the system of building in that is rampant here) I notice several demolition for rebuilding purposes in each case there is a single wall between each property & not a wall to each house as we possess.\n\nThere is one thing I forgot to mention ie that cats are not expected to kill a rat. Any person claiming that his cat has killed a rat must produce the rat as evidence before he will be believed. What on earth they keep cats for in this rat infested city I do not know.\n\n28, 29. \n& 30\n \n\nLost days – \n","96":" ()\n\nIntended to see the Grands at Versailles in the afternoon but a heavy thunderstorm decided me to remain away\n\nof living softened & cadenced by reason. \n\nPassing onwards & upwards to Escalier Daru rests the Victory of Samothrace without head or arm but yet of arresting workmanship – clothed in fine linen & not in heavy wrappings – Her marvellous body was not designed for daily tasks but was of the gods – a beauty that was in itself an ideal. Her movements though vigorous were always harmoniously balanced \n\nThis the best somewhat dimmed the undoubted beauty of latter works but one in special took my fancy a light & almost living figure in bronze another was the Young Neapolitan by Rude a child with laughing face playing with a tortoise.\n\nAll the picture were not yet in their place Titian & the school are missing But Van Eyck, Rembrandt & who can write of the play of light & shade that the master has shown in the two philosophers. Alone in the centre of a room stands Mona Lisa with her mystic smile of ever bewildering fascination. \n\nIn one of the by itself is a small statute not 3 ft high of a young boy called L’Ephebe\n\n99\n\nattribute to Andrea Sansovino circa","97":" siecle but whoever be the author its beauty & surpassing excellence render it worthy of Praxiteles himself. To my mind it equals the ancient Greek – Every line & muscle on the body is true to life & the grace & freedom of action render the child alive.\n\nOf the many wonders the place contains I cannot write but I return again & perhaps many times ere I leave Paris.\n","98":"\n\nVisited Bank & found education inspector had gone & then home to find whole place rather awkward as I was accompanied\n\n3,3,4 lost days\n","99":"\n\nBrise has gone to Marie Le Bretons & I am alone all day but meals have been prepared for me. Veal roasted in its own humidity & blood gravy in jelly when cold. \n\nTo night is just type of night for reverie all the neighbours are still out & a band in Place Monge sends measured cadences of melody across slum that now are picturesque in the golden moonlight. \n\nThe moon which can ever make beautiful\n\nthe slum of the Latin Quarter & Rue St Medard while in the shadow of it attracted by its pure rays two little waif have crept from the bundle of rags to the windows & in whisper are telling each other something – & the happy & innocent thrill in the tone makes me wonder if money is worth seeking if it give not happiness for these children of poverty (& I know what it is for I can see into their rooms) have something in their voices that is lacking from mine, perhaps because life in its unreality lies before them while to me all its illusions have faded. \n\nI wished to night I were like these children\n","100":"\n\nTo day is the fete of St. Cloud & the fountains play to day & also on the 14-9-19 but after Versaille they are a poor show or rather are overshadowed by the number. One jet here rises to a height of 136 ft. \n\nIn the afternoon or rather midday we start out for St. Denis the burial place of most of the French Kings The façade built in 1140 preserves the old pre Gothic arch while the battlements along the top were built for other than peaceful pursuits. \n\nThe French king from Dagolert 1 (638 AD) to the Last Louis are nearly all interred here with the relics of St Denis. Tomb of Henry IIX Catherine de\n\n101\n\nMedici is a masterpiece by Pierre Lescot but the old dame not relishing the propriety of being shown in the nude created another tomb or effigy showing herself & husband clothed. \n\nTomb of Francois 1 also merits attention with black marble in top & sculptured in the marble the tombs of Marignam & Ceresole. Behind by Pierre Bontemp is an urn containing his heart. On the crypt is the burial vault of the Bourbons. \n\nTaking train we went on to Enghien where we wandered through vegetable gardens until one found one of Brise friends Alece & her husband. Here we were invited to stay for dinner. Women wages pre war at highest was 7 f per day This railway employee 3 fr 50 per day passes for himself & family.\n\nThence we set out for Montmorency & its forest. associations of JJ Rousseau. The view from the terrace of the church is very fine. The town is very old & some of its streets are fully 4 to 6 ft wide & often so steep that the authorities have placed a handrail along the building to support you in the task of ascending the street.\n\nThe Mairie Arts park reminds one of a little chateau de Trianon & is exceedingly artistic We overlook the Orangerie & enter the Chataignerie but this is for most part dotted with building & the ancient\n\nforest has to a large extent ceased to exist. Much has been cut down during the war & also for defensive purposes as the wood contains Montmorency & Montlegnon two of the outer ring of of Paris. Rousseau sheltering place is in Rue Gretry which we entered in error. \n\nA cafe called the Ermitage was our aim in Boul. d. l’Ermitage we return to chez abel & pass a pleasant evening & then set off for Lake Enghien (1\/2 M by ¼ mile). \n\nThe edge of the lake is fringed with the houses of the noveau riche of Napoleonic times but very beautiful. One in particular took my fancy & I may reproduce it in my chateau. \n\nThe avenue forms a pleasant wooded walk especially on such a night as this is. Calm & peaceful with a full moon – the moon whose silver rays can lend enchantment to any scene & which gloss & beautify what the glaring light of unsympathetic day only reveals in its squalor. \n\nOn the banks of the lac stand the great Casino where life & gambling run high. Now it stands a white skeleton in the moonlight – a souvenir of remembrance of the devasting influence of war for it has not opened its door & the myriad lights that once shone in its gardens are now extinguished soon however it may re open\n\n103\n","101":"\n\nSome few things that strike me as peculiar which came under my notice this morning. Here in Paris there are still town criers & with a bell to announce facts to populace Men bearing placards – – walk along all day in the street though not to same extent as in London.\n\nPolice here all carry a useless bayonet & even on hot days a cape overcoat. In Paris itself many of the roads are rough cobble instead of wooden blocks & makes omnibus travelling very uncomfortable. \n\nI have lately commenced to eat horseflesh & like it better than beef. I commenced with a fillet of steak both at same time – one bite of horse & one of bullock & I prefer horse It is tenderer & much cheaper. \n\nPrices here are exhorbitant. A Commission has just been formed which regulate the prices for the week & even so prices are high. Here are the prices of commission for \n","102":" to","103":" (a Kilo = 2 ½ lb)\n\nButter 5.20 for ½ kilo\n\nEggs .50 each\n\nBeef Filet 12.40 per kilo – Rumsteak 9.90\n\nPorc Filet 12.30 – Hams 11 – trotter 2.40 an kilo\n\nVeal Gigot 9.20 shoulder 7.10\n\nPoulet per demi kilo 5.75 – Rabbit 2.25 3.30\n\nThese are best quality the lowest grade is always 2 francs cheaper.\n","104":"\n\nVisit Ministre & after met Mdlle & we sit & talk in garden near Palais \n\nAbout sundown the trees the leaves of which are already beginning to take their autumn tints a wonderful nuance of colour aided by a mist which in reality is only a shadow effect. At each instant the colour seems to change but only in shades. I shall for the future always have deciduous trees in my chateau grounds.\n","105":"\n\nAt atelier of Mdlle Brisson with Mdlle Marga & after that to Luxembourg on far side near Rue Guynemer with Chopin monument near. The long lanes never straight in this part of garden \nall\n overshadowed walks & patches of bright flowers far surpass any garden I have seen & leave a memory of beauty that will always be present\n","106":"\n\nFountainbleau – rise 6.30 & take our dinner provided by Brise a fowl a bottle of wine, fancy biscuits & cake & fruit, not bad for a rural dinner in the forest. \n\nWe reach station & instead of going to town & chateau strike off in opposite direction the only ones to do so & as always untrodden paths are pleasantest we find a treasure trove\n\n105\n\nTour Denefort which commands a view for nearly 40 miles around. Tour Eiffel can be seen in clear weather. \n\nThen we went round Butte a Guay under branching ardours & amid greens & mosses which in the early morning gave that delightful perfume of the bush. Then we reached Croix which overlooks town. Then striking through the forest & across the road we enter the park of the chateau & follow the ancient avenue of trees to the parterre which is not even imposing in its severity.\n\nFrench gardens have no grace but are a series of straight lines at right angles to each other. The squareness of angles ones eyes accustomed to graceful lines & unexpected effects. \n\nThe chateau is closed till 2 pm to enable the guardians to take their meals. The shift system being apparently unknown or rather in this country where beaurocracy has replaced autocracy it is a system to let people know that they are merely the people – the common herd. \n\nWe searched vainly for a place to dejeune having passed so many little beauty spots in the forest. Happily we find the Plaines des which though surrounded by public roads 100 yds away yet is completely private. Then we visited chateau (of which pc best explain) with its wealth of Napoleone\n\nrecords even to his hat.\n\nLeaving the chateau & taking a pleasant beer beneath the shade of trees & refilling our wine bottle we wandered over sandy path with innumerable sign posts & directions which directed nowhere \n\nIntelligently we reach the grand Gorges de Franchard a collection of stones or pebbles in a gully not as deep as middle harbour – yet a Gorge – wonderful name. Franchard was an old hermit her in XII siecle & part of old monastery still remains & also his well (see pc)\n\nAfter this Gorge & with a thunderstorm approaching & a 7 mile walk back to town I decide not to visit the Gorges of but finally take a look at them. The forest in the half light & after the shower is glorious especially the George du Houx.\n\nWe just catch a train & board train while in motion & finally reach after & finish chicken. Walked this day 28 KM – 17 ½ M\n","107":"\n\nWent to Bouffe Parisien with Mdlle Marga & Mde & M Julien her tickets were wrongly dated & we spend evening in Grand Cafe regarding the life of Paris as it passes by & you cannot imagine how interesting it is\n","108":"\n\n107\n\nChantilly to day – the prettiest & most homely of all the chateaux. As usual I stray from beaten tracks & descend at Orry Coye. \n\nWe are very late starting owing to having spent night previous at Montmartre & then to cap all having to take an omnibus train. \n\nThe forest of Coye lightly timbered & yet completely shaded is a subject for a picture but what shall I say of the Pool & Chateau of the Queen Blanche. The small tower situated over falling cascades on to a velvet \ncarpet\n tree covered carpet while a view of the railway viaduct of 15 arches towering overheard. \n\nThe lake, down to edge of which the forest descend Coye on one side & \n\nChantilly on other though really the same forest, is fringed with a road – forest on one hand & a hedge on the water side. Sunlight & then a heavy shower followed by a mist rising from lake makes varied pictures \n","109":" enraptured are we by the scene that we dine on rising ground in view of lake & chateau under an enormous elm & though rain is heavy & we have no macs we continue to dine well & dry on chicken & wine & cheese & cakes, while the million drops of gold splash on the gilded surface beneath us, & the air is full of that sweet odour of woods after april shower. \n\nThis is the prettiest spot I found\n\nin this fair land of France.\n\nAfter a farewell look at the lac we trudge through the rain soaked forest along tracks that would have been sand but are fairly easy walking now. We pass a plantation of silver birch (boulean) & the series of silver trunk glistening in the sun add another note to this pleasant forest. \n\nIn due course we land in the road that leads to castle, when suddenly in a little clearing in the woods we find the flotsam of the wave of war which passed by here in 1914 – a cemetery of the dead but only of men who fell here\n\nThe chateau is situated in a lake – part built in 1560 by Constable Anne de Montmorency whose stature adorns the entrance road – She is a man & the companion of \nHenri IV le Vert Galant\n Francois 1. \n\nIt is famous in history for the brilliant fetes given by the Prince de Conde (the Grand Conde) whose maitre d’hotel Vatel committed suicide because the fish did not arrive for the feast given to Louis XIV It finally came in the possession of the a son of Louis Phillips who entered army as a private & became a – famous for his african campaigns – Dying he left the property to Institute of France together with the art treasures of his family. \n\nThe collection of pictures is the finest for a private collection that I have seen including Rafaels Madonna of the Orleans family & The Three Grace a little work about 1 ft square containing figures of 3 naked women & yet in 1885 it was bought for £25,000 & is now without a price. There is also one of the earliest\n\n111\n\nFrench painting.\n\nA Book of Hours or rather 40 miniatures from the Book of Hours by Jean Focquet in 1452-60. They cost £13,000. Also the banner taken at Rocroy (1643) the oldest military trophy in France. \n\nThis chateau was occupied by the Germans in 1914 (It is only 25 miles from Paris) & after during the war by the French H.Q. Many of the musee & chateau are only recently opened & a visitor who has passed through France just after the armistice does not know what treasures he has missed.\n\nI am writing this 20-30-20 & it was only the other day that the English & French school was opened at Louvre & the Dutch school is not yet opened. \n\nThen we visit the English garden – the Temple of Love but miss the Hamlet on the other side. Water is everywhere & fountains numerous. Many apparent alles are tree bordered strips of water, & then the parc de Silvie with its allees like cathedral aisles – the trunks & the overhead folige must have inspired many a church of the gotheque (or francais) order. \n\nBeautiful as this is yet nature has thought fit to embellish her handiwork & has put \nvelvet\n plush along all the walks & the soft springing feel of these path with the vistas at the other ends often illumed by rays of sunshine.\n\nIf only I could possess such a parc no other place in the world would hold any charms for me, & then with the setting sun the of sunshine & shade falling through the forest – the opening clearing at end of allees & beneath the wealth of dead leaves in the\n\never present heritage of a past that is dead but which is always with us. \n\nSadly we quit this scene of beauty which perhaps I shall never again see but whose memory will for ever haunt me. We follow Route de l’Ayle to station passing the magnificent stables & the Grand Stands. A long wait for train & then a short run packed like sardines – debout – & thus ended one of the most beautiful days I have passed \nhere\n in France.\n","110":"\n\nFor the greater part all days & their events which follow so quickly here are forgotten. I have no record whatever of what I have done & I have copied the following dates from the journal of Maria who has noted those events which concerned us two. \n\nThey are for the most part outings taken together on Sunday which I continued in spite even of exams I worked so hard till my exams that I never left my room \ntill\n all the week & Sunday was the only break.\n\nUsual routine was petit dejeuner 8 am coffee & rolls & butter (the rolls are long layers of crust) specially sought by loving hands when I broke my tooth on the ordinary kind. This petit dejeuner I take in bed. M. rises about 6 am to search the\n\n113\n\nmilk for which she takes a place in the queue & how her health stands the strain of her work & the wait in the cold damp air of these dark winter morning with the snow on the ground passes my comprehesion I would have succumbed to it long ago She really possese a reserve of energy that if I could acquire I could be whatever I desired.\n\nAfter breakfast I dress quickly in old clothes which I possess & a pair of Marie Lebretors slippers that I salvaged at my little chateau de 17 Rue Campagne Premier. Then I betake myself into bedroom with a blanket & hot water bottle or brick provided by Brise or her mother & dig into law then the hour of dejeuner (noon)\n\nI am not called till the soup is even in the plate & then I am called. I might add that I am consulted as to if I am ready before meal is served. Everyone must speak in whispers & tread on tip toe if I am working. A King could not be better served. \n\nA wish is always interpreted as an order & obeyed as such. The food I eat is chosen If I once refuse a plat it never appears again. If I show a\n\n.\n\npreference it is often found on the table. I must not eat same dishes too often – Food is changed. If bilous certain vegetables or salades are bought. Expense is not considered & as you know prices are very high here. Sunday is always a feast. Fowl is always there (costing about 13\/- a piece) & this is only a working girl who is sacrificing her all to give me pleasure.\n\nShe was very hurt when I told her that I would not stay in the house in spite of all her kindness if I could not contribute towards the expenses & until Nov. I was allowed to contribute my quota on a basis of a week when only current provision were bought. Coffee, sago, tapioca & all standards – like these were not included, & though prices doubled & trebled I was not allowed to change the basis.\n\nSince Nov. I have been her guest & nothing can make her change this status; without her I never could have stood the & she has saved me perhaps 10,000 francs. When I was paying 12 franc a day for a room she found me furnished quarter 2 rooms rez de chausse – private cour – no concierge library for 25 frc a month. The price elsewhere would have been at least 800 to 1000 fr a month. \n\nEvery day she came to bring me something that rooms lacked – a curtain of lace – oil for lamps – a knick knack – coffee hot in morning – she cleaned up the room & bought all my provisions for me\n\n115\n\nSometimes twice a day she came across a trip of 1900M.? each way, ie 2 ½ miles – no joke for a frail little woman who after that walked all over Paris to find her work. 5 miles on to her days work & that for me. \n\nSugar can not be bought but she gives me of her own store knowing that her ration tickets can not be given & it is a loss for her & her mother. She even gives me her kerosene because it is unprocurable. \n\nShe cooks my meals – brings breakfasts & washes up all dishes. She visits chateau once a week to clean it up. Never have I found anyone who cared & looked after me so much. If a man can be bought surely she has bought me for never can I repay her. \n\nBut to continue my story of study I return to my books with blanket (the old one) around my legs & my hands in my pockets to keep them warm. This continues till 7 pm when I adjourn to divan (& bed) when I linger over dinner till 9 pm & then to work again. \n\nBrise often sleeping & dozing alongside of me the little No noise is allowed & I commence to talk or chat she returns me to my work In fact this habit of chatting is hopeless & in the later days I used to spend all the time in other room. \n\nA salamander is kept going night & day so that I should not have cold & fuel costs something here ie when one can get it. If I lack a book her own work stops still till she finds it & that at a reasonable price of prices of books have just doubled & in some cases they are rare & the prices are fantastique eg costs 5 fr I paid second hand 17 francs\n\nAll that this girl has done for me would take too long to tell but I shall return to her tout a l’heure.\n\nThis is the usual programme for each day now though I realise the strain cannot endure very long. But if human energy & application can conquer I am determined to win. When I have a definite task which depends on my efforts I can generally bend my will to it there is no end in view like the Bar I have fear.\n\nMy health here does gives out finally & suffer from extreme exhaustion on return from Italy. The eyes too give under the strain but Brise doctors me up with colargyrol which is magn. She really ought to have been a doctoresse. \n","111":" many of my days follows the above programme that I need not rechronicle it. \n\nI wish I had some records of all the little thoughtful acts \nthat\n of Brise during this period when at the best I could but be regarded as a nuisance in the house. She is all goodness but I have yet to realise the depth of her affection when my life lay in danger in","112":" She is a jewel without any price. \n\nEvery Sunday I cease work & spend the day in an outing something always taking Brise who represents it herself\n\n119\n\nmy pleasantest souvenirs of Paris & so you find diary will principally tell only of Sundays & not very much as I am writing in","113":" (9 mos after)\n","114":"\n\nTo day we visited Musee Guimet. Brise accompanies on all my visits to Musee as they interest her. \n\nShe is of the type that seeks instruction everywhere & does not expect to find it in dances or cafes. Of little school education for she was educated like Dad She has acquired more knowledge than the ordinary girl especially in the world of art A little savage who shuns puberty & is as \nshy\n timid a dear in company she only shows her knowledge when she meets a kindred spirit.\n\nThe musee contains contains a wonderful collection of Chinese pottery which shows how advanced the Chinese are & how ignorant we are. They shame Sevres & that when Europe was almost savage. \n\nOn entering sticks & umbrellas must as usual be given up. No fee is demanded but you cannot get therein without a considerable pourboires which is same thing in my eyes I shall be glad to find a country\n\nwhere there is no pourboires. A foreigner is always expected. \n\nOne spends more in tips here than one pays for articles. Go into a tea room your cane & hat is taken (tip) waiter serves you (tip) another makes up bill (tip) band plays (tip) woman sings (tip) etc. If tip is not big enough they will tell you. A foreigner pays more than a francais & an officer more than others.\n\nIt is because I have no funds that I spend most of time in civvies against orders. It exposes to insults & you cannot retaliate but saves a lot of money & you can go into many a place where uniform would be looked on askance.\n\nHowever to my musee. Upstairs there is a white mummy (222AD) & a mummy of Thais but query if The Thais of Nicias & the accursed Alexandria. \n\nThe day is a typical Sydney winters day Deluge of rain with a cutting wind which makes you shiver though the temperature is not really low. We shelter while waiting for tram in the open door of some wealthy individual & dive for tram when it arrives.\n\nHere where all buildings are building close to one another there can be no carriage drive to your front door. So the rich have a door wide enough to admit a motor car & you decend inside & are under cover all the time. \n\nIf you were\n\n121\n\nto descend in street you would be wet or your satin shoes would be spoilt in traversing the footpath (In cafes & hotel a flunkey man with a large umbrella protects you from rain). . There is no front door at all & no grand & official exterior entrance. \n\nOn returning we changed our wet clothes & light a huge fire in the open fireplace to dry our things. For here there is no place – no court to dry clothes hence even the poorest is forced to send them to a laundry which even in the poorest families cost 4 to 15 francs per week.\n\nHandkerchiefs cost – 10c\n\nKitchen Towels – 15c\n","115":" small Tablecloth – 40c\n\n1 apron (noir) – 10c\n\n1 \nserviette\n dish cloth – 15c\n\n1 Blouse – 1.00\n\n1 Bed Sheet – 1.25\n","116":" pyjamas – 2.00\n\nNever will I be able to adjust my ideas after the prices here. These prices are all a consequences of guerre & the high cost of living. \n\nIn front of huge fire we stretched a eiderdown & read to our hearts content while outside the rain fell & the wind howled. The following day & the rest of week the usual regime of study. I am really worse off than a prisoner in the \n","117":"\n\nTo day being sunday I go on strike as usual. Being late in starting & rather than spoil an excellent dinner we change our plans & start for St German en laye.\n\nIn the town itself there is nothing save the chapel which Maurice Denys has erected to memory of his femme & which is private & more not yet finished. The church into which I did not enter contains a bust of James II (erected by Geo IV) who occupied chateau for 12 yrs. \n\nOn other side was another palais of which rests only Pavilion Henri IV. It was at the chateau that peace with Austria was signed. The building is strange not being built square but roughly like plan. The effect is not pleasing. \n\nThe cheauteau is not pretty being built for strength as huge moat indicates but it has none of dignity of old strongholds for one has tried to make it beautiful as well as strong. Brickwork white & red alternated. Statues in bay windows – Effect is heavy. \n\nBuilding itself is occupied for most as residence for guardian what is left is a musee of everything in French history of early times down to . Not of much interest except to students. The \n\n123\n\nGothic chapel constructed by St Louis is beautiful. But the grand attraction is the Terrace 1 ½ miles long erected by at God knows what cost. But the view of the valley of love is magnificent If weather is clear Montmarte & Eifel Tower are visible. \n\nBehind terrace is a delightfully laid out garden of the English type & then a hunting area surrounded by a vast wall through which however we find a breach. We continue along the terrace to the end & thence to Chateau du Val where the grounds are admirably laid out. \n\nI regret that I did not ask permission to enter & make a copy for my future castle. We then entered the Forest 11,000 acres of waste land. The timber is worth nothing but could be easily afforested but here no one cares & all at Paris.\n\nWe had a little sandwich of cheese which Brise had carried in her parosol till now & after a little rest & having gathered some ferns & flowers we wandered on. Brise is very fond of flowers & will often buy them for the house. She collected so much that in my eyes were useless that I asked why she wasted her energy carrying useless flowers homes. \n\nHalf an hour after all her flowers had disappeared & I thought she had dropped but no she had thrown them away because she\n\nthought they displeased me & she admitted this like an infant who has done wrong in gathering them or one being found out in doing some good act. Truly her affection & desire to do what I should wish are very touching.\n\nAt Maison Lafitte we had an example of the triomph of commercialism over The Chateau de Maison constructed in 1717 in the midst of a beautiful park was acquired in 1818 by Lafitte a banker who lacked sentiment & cut up parts into small building lots which he sold at high prices in order to keep it select & incidentally realise more. The chateau itself is isolated without even a tree to relieve it & fenced in by an iron picket fence it seems a prisoner or a criminal guilty of some crime.\n\nDisgusted we turn homeward & I have just finished selecting a few pc when before I can pay the town supply of electricity fails or is probably cut one is never certain here where respect for law is always lacking. \n\nAt the railway there are two entrances but which is entrance & which exit no one can say. However the entrance is closed & the exit is the entrance & you cross the rails to reach the departure platform. Rather a strange performance & incomprehensible for\n\n125\n\na foreigner who values his life. But then this is France.\n","118":" to","119":"\n\nStudy as usual which I will not chronicle for future as it is always the same. My eyes are giving under the strain & it is only Brise & her coleyrol keep them going. \n\nI begin to get work a little in hand but the task is almost hopeless though while there is a possibility I will carry on perhaps I can fluke it at the worst. While there is life there is hope But to attempt 2 years work in a few months even if the language was the same is somewhat of a large order\n","120":"\n","121":" again & a pleasant outing I have arranged for to day. \n\nBrise has arranged a lovely luncheon basket ctg\/fowl, , cheese, fruit, etc – her idea of contributing to expenses. The value she furnishes is out of all proportion to other expenses. \n\nWe start very early & take train at Luxemburg. This is an underground where no attempt to supply fresh air has ever entered into the mind of Directors of the Coy. All lights alight in train\n\nwhich are extinguished by girl who verifies the tickets & for 5 minutes or so before depart of train of train you rest in darkness except for station lights. \n\nThe line follows Boul Mich in which are escape boxes for steam. Often a surprise to a stranger when he sees one of these boxes idly smoking. Port Royal is an open station & after that tunnel again till clear of city. \n\nAt St Remy les Chevreuse (20 miles from Paris) we descend & as usual French customs we must cross line to leave station. After 5 more miles \nthe\n during which train empties passengers who flock to point opposite gate the train moves on but stops immediately & remains there for about ¼ hour. Everyone gets impatient & I suggest to Brise to cross the compartment of train but train moves on. \n\nDay is glorious & sky clear. \n\nThere is a track leading to Chevreuse & naturally I take to avoid main road. We pass Chateau de Cobertin a deserted & badly placed chateau when so many lovely spots about here. \n\nOn other side some one desirous of view has constructed a chateau on the side of a hill that is almost perpendicular & without any visible means of communication save by climbing hill & by facing his chateau he has lost the best view of the valley. The ruins are visible & easily find the way\n\n127\n\nAs ruins they possess no interest though guardian thinks different but the view of the valley especially in the sunshine to day with its squares & patches is well worth the climb. See pc for view.\n\nWe descend the chateau by a steep private path used by inmates when during visited here & in a few minutes are in the town. \n\nWe then take the high for Dampierre & the road passes several times a thicket in which the grand trees make a rustic alley though one side is hidden by a high stone wall & one knows that some rich noble has his home behind it. One is hidden by wall but when one comes to the chateau itself the wall ceases & a deep ditch takes its place & a view of grounds & cheateau is possible & it is is nothing exceptional so why the enormous 16 ft wall.\n\nAt Dampierre is Chauteau of Lugnes family but we do not enter as family is in residence (but see pc). The road is hot & uninteresting now. Brise finds some apples but they are sour & afterwards some pears. Road has no shelter. \n\nSenlisse lies to left of hills and so path leads on till we arrive at the Vaux\n\n"}}