{"Document Name":{"0":"Diary_0498","1":"Diary_0498","2":"Diary_0498","3":"Diary_0498","4":"Diary_0498","5":"Diary_0498","6":"Diary_0498","7":"Diary_0498","8":"Diary_0498","9":"Diary_0498","10":"Diary_0498","11":"Diary_0498","12":"Diary_0498","13":"Diary_0498","14":"Diary_0498","15":"Diary_0498","16":"Diary_0498","17":"Diary_0498","18":"Diary_0498","19":"Diary_0498","20":"Diary_0498","21":"Diary_0498","22":"Diary_0498","23":"Diary_0498","24":"Diary_0498","25":"Diary_0498","26":"Diary_0498","27":"Diary_0498","28":"Diary_0498","29":"Diary_0498","30":"Diary_0498","31":"Diary_0498","32":"Diary_0498","33":"Diary_0498","34":"Diary_0498","35":"Diary_0498","36":"Diary_0498","37":"Diary_0498","38":"Diary_0498"},"Date":{"0":"unknown","1":1689.0,"2":1690.0,"3":1691.0,"4":1692.0,"5":1693.0,"6":1694.0,"7":1695.0,"8":1696.0,"9":1697.0,"10":1698.0,"11":1699.0,"12":1700.0,"13":1701.0,"14":1702.0,"15":1703.0,"16":1704.0,"17":1705.0,"18":1706.0,"19":1707.0,"20":1708.0,"21":1709.0,"22":1710.0,"23":1711.0,"24":1712.0,"25":1713.0,"26":1714.0,"27":1715.0,"28":1716.0,"29":1717.0,"30":1718.0,"31":1719.0,"32":1720.0,"33":1721.0,"34":1722.0,"35":1723.0,"36":1724.0,"37":1725.0,"38":1726.0},"Entry":{"0":"\n\n \n\n","1":"\n\nLondon\n\nWalked down to Berkleys in Victoria Street and got them to alter my uniform tunic. A rather close day but being in mufti found it cooler than uniform. To Westminster Abbey and had a look round inside. Grotesque monuments detract from the beauty of one of the most beautiful of places. To the Bank by ‘bus and to the Bank of Australasia for mail &c. Walked a lot around Cheapside and the old parts thereabouts and eventually ended up in St. Pauls Cathedral for rest. Had a walk down the Strand and went into St Clements Danes Church and St Mary le Strand – old smelly places with the odour of ages. Lunched at Lyons café very well and then went down to Old Bailey and heard the Common Serjeant Mr A.\n\n \n\n16\/7\/18\n\nLondon\n\nF. Dickens K.C. try Curzon & Lawson on a charge of financial conspiracy. Back via Trafalgar Square to the R.A.C in Pall Mall to read the evening papers. Noticed little girls dressed in pages clothes calling taxis &c. For dinner to the Cheshire Cheese in Fleet Street and had a good dinner. This old quaint place is my favourite resort for dinner but you have to pay for its oddness. Took a ‘bus down to Trafalgar Sq which seems to be a concentration point for all the stray Tabbies Anzacs and others about. It keeps \ndark\n light until well after 10.30 and remained so until long after. I had packed up for my trip tomorrow and had changed back into uniform. An aeroplane flying over the city seems to attract a lot of attention.\n\n \n","2":"\n\nLondon – Edinburgh\n\nCaught the 10 a.m. express from Kings Cross taxi-ing there and got a corner seat. A long day travelling and did not reach Edinburgh until ¼ to 8 pm. The country all the way was looking much more heavily cultivated than I have ever seen it before. All along the line are fields of vegetables. Harvesting is in progress. The country is looking very well. England’s distinctive feature compared with France seems to be its many trim hedges and its luxuriant irregular woods. Durham seen from the train seems a oldfashioned medieval looking city. From Berwick on good sea views. Reached Waverly station Edinburgh at ¼ to 8 and took a cab out to 27 Abercromby Place where Mrs Craig and Sheila received me and after dinner we had a great yarn.\n\n \n","3":"\n\nEdinburgh\n\nAfter breakfast walked with Col Craig through the gardens fronting Abercromby Place and down to Princes Street where gardens commence just about where Scotts monument is. The old town and the castle are perched up on steep severe and rocky crags. Went up to the Westport and saw the scene of the Porteus riots and the Grassmarket. Crowds of kiddies playing about all barefooted and talking such broad Scotch that one could hardly understand a word of their talk. From here to the Food Office where the Colonel wanted to fix up some business and we then walked to the Trongate passing the medical schools and the Royal College of Surgeons. All the shops round here are full of books and surgical requisites. We went into the courtyard of the University\n\n \n\nEdinburgh\n\n18\/7\/18\n\nand then walked down to the North British Hotel where we lunched and yarned until well after noon. Just here at the top of some steps coming up from the Waverly station is surely the most windy place in Edinburgh and all passersby have to here keep a hold on their hats. Went back to Abercromby Place and a young middy from the “Lion\" was in. we had much talk about the Navy and had afternoon tea. Talked until dinner and after that had some music and spent an enjoyable evening in a home circle which is a rare pleasure to one after being so long away out away from all these things. It was still quite daylight at 10.30 pm when we went to bed.\n\n \n","4":"\n\nEdinburgh\n\nSpent the morning indoors and then went down with the Colonel to Royal Bank of Scotland and saw the mgr. – a creeping crawling looking man. Walked to the N. B. Hotel and there lunched and had a quiet talk before returning to Abercromby Place where the Col. took me to see a Dr. and got a prescription for a tonic. Took Sheila out for a walk and had a good stroll round all the shopping portion of the town after which we returned for dinner. It was another long day and still daylight at 10.30 when we went to bed. Yarned over whisky and soda until a late hour on any amount & variety of subjects. Audrey at Carron has influenza & Sheila had to go to bed with the same.\n\n \n","5":"\n\nEdinburgh\n","6":" and until late in the afternoon it teemed. Remained indoors until after 4 when I walked down to the Caledonian Station with the Colonel and saw him off in the train to meet his boy Jimmy who is returning from Rugby. After dinner again went out and walked all along Princes St and round Waverly. The castle frowning down from its precipitous height and the high peaks of Arthur’s Seat &c are very fine. Looking down Hanover Street are views right over the Firth of Forth to the hills of Fifeshire – a pleasant prospect. There are private gardens fronting Abercromby Place and looking from there we get a tinge of green to relieve the drab of the surroundings. Talked with Mrs Craig & Sheila all the rest of the evening and had a quiet & enjoyable evening.\n\n \n","7":"\n\nEdinburgh\n\nThe first excitement was the arrival from Rugby of Jimmy the Colonels 14 yr old boy and there was great joy in the house. At 12 noon we had an early lunch packed up a few things in a bag and went to the Waverly station where we caught a train for Perth. The first place of interest was the Forth Bridge with big battleships on one side and smaller vessels on the other. They were a fine sight ranged in lines ready for inspection by the King who went through in the Royal train this morning. Passing on we came to Ben Ard – a not very high mount and then Loch Leven with its pretty little islands. This is handy to Edinburgh and is much fished. The train now commenced to go through very beautiful scenery with lovely woods high bluffs and bonny glens. We came into the\n\n \n\n22\/7\/18\n\nPerth – Pilochtry \n\nfair town of Perth about 3 pm and changed into the “local\" for Pitlochtry. Put up here at Frazers Hotel surrounded by lovely garden. This place is lovely, the air fresh and bracing. Before dinner walked along out to the Pass of Killiecrankie crossing the Tummell river. High peaks forest covered on either side of the road and neat rim cottages here and there. This is wild Highland scenery. It was raining but with coats on it did not matter and we thoroughly enjoyed as delightful a walk as one could well make. At dinner at the hotel there were not a great many people and afterwards the Colonel & I sat in the smoking room and yarned over whisky and soda. Retired to bed at a little before 11 and slept well.\n\n \n","8":"\n\nPitlochtry\n\nLeft Pitlochtry by a train at 8 and got a splendid view of the Pass of Killiecrankie and the Soldiers Leap. The train commenced to climb until we got up into barren heatherclad & treeless hills. The scenery was truly wonderful. Brooks ran on both sides of the line and all down the hillsides were cascades. After crossing the summit we ran down rapidly through fine wooded glens and past lochs till we came to the little town of Aviemore. We were now in Invernesshire and then went on to another little place called Boat of Garten where we had a stay of a couple of hours. Walking through the clean little village we came to a moor all heather covered and there sat down until lunchtime plucking a few sprigs & enjoying the view.\n\n \n\n23\/7\/18\n\nCarron, Morayshire\n\nArrived here after passing through very pleasant country at about 2.30. It is situated on the Spey River in the midst of forests. Around are a number of distilleries which come here for the good water. All around are firclad hills rising up from the river – in some places there are Canadian lumbermen at work in sawmills and otherwise dealing with the timber. We found Audrey at a cottage with some other girls – all were sunburned. Audrey was just up from her ‘flu and not at all well. These patriotic girls volunteering for this forestry war work seem to have been most shamefully sweated by the owner here. Four miles to walk to work and then 8 hours on the job is beyond all reason. Left the Colonel to talk with her and went down to the river. A broad & rapid stream running over a stony bed judging by its babbling. All around the beauty of Scottish mountain & forest\n\n \n\n23\/7\/18\n\nAberlour\n\nWe left Carron at about 6.30 after meeting Audreys comrades – “land girls\" in smocks, leggings & breeches. Arriving at Aberlour – a small stone village – we found our arrival to be the chief excitement of the place. Went along to the local barber’s with the Colonel and then went for a walk along the village streets. All the shops bore Scotch names – Grant & MacPherson, Thomson, Gordon &c. We had dinner and absorbed a number of w. & s’s and then went for a long walk along side the broad river Spey with its tributaries with their waters all black and peat stained. There were a few fishermen plying the rod but not getting much result. As we walked along heavy rain commenced and was continuing after our return & going to bed.\n\n \n","9":"\n\nAbelour\n\nThe Colonel came in early and said as it was raining he was determined to get a motor car and go back to Carron to motor Audrey down to the train. He departed at about 8 and I then got up and did an errand or two down the little street before having breakfast. These Banffshire people are not as clean as they might be – everywhere else I have found nothing but the most scrupulous cleanliness. They also speak a peculiar dialect of their own different to elsewhere. Caught the 9.20 train and we had a very pleasant journey along through wooded valleys and forest country and beside swift running streams. Our first big stop was at Aberdeen. The farmhouses were stone with slate rooves but here and there was an odd thatched roof. We only had a few\n\n \n\n24\/7\/18\n\nAberdeen\n\nminutes at Aberdeen but then I could notice that many of the houses were built of the native granite. When it rains these are said to shine and to be more than ordinarily remarkable for beauty. We had Audrey as our carriage mate and looked after her very well. She was still weak after her influenza. Next after Aberdeen came the city of Bonny Dundee and the famous Tay Bridge which is a long low one across the Firth of Tay but nothing like as imposing as the Forth Bridge. We passed low sand-duny country crowded with Glaswegian pleasure seekers out for the trades holidays. After crossing the Tay bridge we got a splendid view of Bonny Dundee with its background of hills and with the sun shining brightly upon it, it certainly was a very bonny place.\n\n \n\n24\/7\/18\n\nEdinburgh\n\nOur next point of interest was the now familiar Forth bridge which being high arched on the cantilever principle is a very imposing sight. The fleet was lying ranged in lines above and below the bridge and some U.S.A. ships with their latticed masts were conspicuous. Electric signal lamps blinked conspicuously from the mastheads of some of them. Hereabouts a fair crowd of naval officers gay in gold lace and buttons joined our train and the remainder of the journey was without event. We cabbed to 27 Abercromby Place and just in time for afternoon tea and had pleasant tete-a-tete. The Colonel and I after dinner lingered over the walnuts & wine and it was late when we turned in.\n\n \n","10":"\n\nEdinburgh\n\nRemained indoors until about 11.30 when we walked down to 27 York Place to Col. Craig’s office and then commenced a round of the different places where the Colonel had business. Then we went to the North British hotel where we lunched on (among other things) sausages and bacon (no coupons!) and then went to the Waverly station to see about Audrey’s Box. On the station we saw a crowd stupidly surrounding a man in a fit and then went on to Princes St where another crowd was following an Australian soldier being “run in\" or rather “carried in\" as the M.P.s were taking his weight among them. Princes St was very animated as usual and\n\n25\/7\/18\n\nEdinburgh\n\nthe biggest proportion of the crowd would I am sure be foreigners to Edinburgh. After performing various commissions we returned to Abercromby Place and, after afternoon tea, we strolled into the gardens for a yarn. Before dinner we had great conversation en famillie and after dinner a little music.\n","11":"\n\nEdinburgh\n\nAwakened at 7 a.m. and breakfast with the family at 8. The Colonel was in bed with his impending influenza. At 9 a.m. a cab called and took me off and away to the Waverly station. Although the train leaves at 10 it is necessary in order to get a seat to leave at 9 and get on the spot. Succeeded in getting a seat in a smoker. The day is fine and sunny and the city looks well. The old castle perched on the cliff and all the old town there also make Edinburgh a very pretty place. Had a good journey but it is tiring and I did not get into London until 8 pm. Taxicabs were very short so I dined at the Kings Cross Hotel before taking a taxi to the Grosvenor where I got a room presided over by a maid with the Crown of Venus. Bought a paper &c. Later walked up Piccadilly and fell to a jaunt in company to Great Russell Street.\n","12":"\n\nLondon\n\nIt was 2 a.m. when I got into bed after a walk all the way from Great Russell St. to Victoria – the Grosvenor Hotel where my room is. The streets were deserted except for policemen scavengers and an occasional night prowler. Put in the morning after rising by tubing up to the Bank for my letters and then coming back to Ludgate Circus to see Cooks about my trunk. Various shopping commissions took me until lunch time which found me near Piccadilly. Walked round to Drury Lane and got a seat for this afternoons opera and then had a cheap lunch in a Lyons restaurant. The Theatre Royal in Drury Lane is situated near the expansive Covent Garden. I wandered round\n\n27\/7\/18\n\nLondon\n\nwhich appears to be entirely devoted to the sale of fruit and flowers. It was long after the busy hours here and there was really not as much to see as at Les Halles in Paris. The opera (Carmen) commenced at 2 p.m. and the theatre was a good one and appeared to be exceptionally well equipped with exits. The last time I saw “Carmen\" was at Rome and the English version today was far more enjoyable. Webster Millar was Don Jose, Doris Woodall Carmen, and Desiree Ellinger was Micaela. The conductor of a fine orchestra was a very young chap named Harrison. There was only a short pause between acts and most people did not leave their seats. One could not help being struck by girls\n\n27\/7\/18\n\nLondon\n\nleaving their seats and going out for a smoke, lounging in the corridor with the men. An English captain picked up a very charming befurred piece of French mischief. Returned tired to hotel at 5 pm. After a rest tubed up to Blackfriars and walked down to the old Cheshire Cheese for an excellent dinner at a reasonable rate. Then to Piccadilly and up to the Regents Palace for some coffee but the place was too crowded to get in. Tubed back to Victoria – the streets all crowded here around with sailors and soldiers. Nearly every second person wears a uniform of some sort. Back to the Grosvenor Hotel and did some reading and some writing there.\n","13":"\n\nLondon\n\nAwakened at 6.15 and had a breakfast before going to the Station. Being Sunday there were not many newsvendors round but managed to get an “Observer\" and a seat in the Pullman for Folkestone. The partings of officers on the platform were rather amusing to watch but, in cases where it was close relatives seeing their boys off again, there was a good deal of pathos about it. The Pullman was full but I did not breakfast. The charges are pretty exorbitant anyway. We reached Folkestone before 10 and embarked on the leave boat. The voyage across was uneventful and we were convoyed by the usual flotilla of destroyers and a French silver fish balloon. Met Dowden on deck on some Australian sisters\n\n28\/7\/18\n\nBoulogne\n\nwith whom we talked until coming into Boulogne. On arrival went to the Officers Club opposite the station and dined there. The food is good and plentiful but I do not like the place and much prefer the junior officers club round in Place Capecure. There the waitresses are W.A.A.Cs, here they are French girls. Went up to the Signal office to send a telegram about my horse but, being a Base, they would have none of it. Did some shopping and returned to the Junior Officers Club where I met Dowden and some American officers who were good chaps. Wrote some letters and read before having dinner. Met an English Colonel, aged, with C.M.G Mons S.A. and other ribbons. He was just over from Italy and had\n\n28\/7\/18\n\nBoulogne\n\nbeen on leave at Penzance. Having been in both places soon got deep in conversation and we fought many old battles over again in the smoking room over a glass of port. Walking round to the other club I met Bateman & took him around to the R.T.O. & fixed up him to travel by the passenger train tomorrow. Returned to the Club and there had a yarn with a little mademoiselle who came in to close the shutters. She spoke no English but could follow my bad French. The streets were thronged with soldiers of all kinds. Before going to bed walked along the darkened streets and up the quay.\n","14":"\n\nBoulogne\n\nWhile having breakfast a funeral passed headed by a man carrying a crucifix. Followed a surpliced priest, the widow, the tawdry hearse and a small crowd of mourners. At 10 a.m. with Bateman caught the passenger train for Abbeville and at our first stop two girls (rather goodlooking) entered. I found some excuse for getting into conversation with one and tried a bit in French about air raids. She came out with some English later and it turned out that she had left London only a month ago having been there on a holiday. She had learned English from her governess. They have a townhouse in Paris and divide their time between there, Biarritz, Nice & the other pleasure haunts of moneyed people. A nice family. Reached Abbeville at about 1.30 and\n\n29\/7\/17\n\nAbbeville\n\nput our baggage in the consigne. Then walked down to the Officers Club noting on the way how air raids had practically demolished some blocks of houses. The square also had one right in the middle and every one of the fine shops surrounding it is completely gutted. At the Club we had a good lunch for 3.50 being waited on by a pretty but surly W.A.A.C who was frankly fed up and rebellious – mostly on account of no leave. The atmosphere here is different to Boulogne and there must be something wrong with the management. At 4 p.m. we caught the train for Ailly sur Somme and had an uneventful journey. At the station we left our luggage and\n\n29\/7\/18\n\nGlisy\n\nsoon found Harricks with horses. Rode to Glisy passing through the outskirts of Amiens and heard news there of Swanton being killed and that the battalion has had a very rough time – over 150 gas cases and a fighting strength of only 180. 200 Yankees are attached to make up the strength. After a yarn with Miles Rodda Aber & Co. I went over to the Nucleus and saw the fellows there and talked with different ones. Returned to the Q.M.S and we then put in all the rest of the evening until after midnight discoursing on our various experiences and particularly about the rough times and scenes of Pozieres. Rodda, McCarbin, Harricks what a splendid trio they are to be sure.\n","15":"\n\nGlisy\n\nStayed in bed until about 10 and then did a lot of writing before lunch. Walked down to the Regtl. Office and found Cox and his minions very hard at work. Dealt with a large accumulated mass of paper re all kinds of military business. After lunch Rodda pushed off for the commencement of his trip to London and we shall miss him a great deal. Of late his nerve has not been as good as heretofore. During the afternoon conducted private correspondence. A hot and oppresive day. At 5 received orders to go up the line and take over the battalion again. After some dinner rode up to where Bde. H.Q. was – about 2 miles from Villers Brettoneux and there saw General Robertson C.M.G. D.S.O.\n\n30\/7\/18\n\nGlisy\n\nThey were just finishing dinner & I had a liquer and a talk with them before going up to the line. Found the battalion encamped in a chalk pit as far as H.Q. were concerned and the rest of the men scattered all over the place. Our strength up here now is only about 200 all told but we have about 200 Yankees attached all of whom are good chaps and very keen. Saw Colonel James and had a talk with him about the situation and then went exhaustively into matters with Elwood and the others. Our gas casualties have been very serious & someone is culpable. Who – remains to be seen. Flares, machine guns & shells very prevalent here tonight. Gorman is acting as T.M., Hughes S.M. This cursed dugout has started me sneezing & coughing & my eyes are streaming.\n","16":"\n\nGlisy\n\nCommenced to get a grip on this morning and found that, to some extent, things have gone to the pack and that the men have been getting overworked and that their morale is not as good as it should be. Because they were worked last night, immediately after coming out of the line, they got very dissatisfied. I went round & got the strength of the show & then saw the General getting definite promise of a holiday tomorrow night and thereafter work only every second night. The G. was very decent about the matter. Villers Brettoneux holds one company of ours only. It is a god forsaken wrent and wracked place and as we came out this afternoon one house was\n\n31\/7\/18\n\nGlisy\n V-B\n\nsilently burning itself away to nothing. The Boche put quite a number of shells about and some went close enough. Took a walk round the companies talking to all the old heads & being seen so as to buck the chaps up. After dark a couple of Boche planes came over and dropped a few bombs close handy to us. Received orders to shift tomorrow night in advance of Villers Brettoneux in support. Brazenor came over to talk to me and we decided to sit outside instead of down in the dugout. A shell plunged into the ground only a few yards off without any preliminary warning and we hurriedly decamped downstairs. Went to bed in the foetid aired dugout at about m.n.\n","17":"\n\nVillers-Bretonneux\n\nA busy day. While shaving General Wisdom came in with Col Murphy and had a cup of tea. Pottered round doing a thousand and one things until lunch time. After lunch \n\nwalked round with Stewart and Gorman on a reconnaisance. Passed through the unhealthy and terribly damaged streets of Villers Bretonneux where houses still full of furniture and people’s goods are slowly being bashed to pieces. The cemetery has its monuments upturned and smashed. Found 21st H.Q. in a dugout in Villers switch and had a yarn with Reed. Then walked round the surrounding trenches and picked upon positions for our men. There is not very much accomodation here but we shall have to just dig in tomorrow night. The Hun was\n\nheavily pounding away with shells at one or two favourite spots of his. Two of his planes downed four of our observation balloons in flames. They spiralled down in twisting smoke and their occupants were in parachutes. The Hun was hit but, although in difficulties, got clear away. We returned to Villers B. first calling on Col. James and arranging definite boundaries with him. After mess had a conference of O.C.’s having the American O.C. attached also there. 200 of them are under my care & they are jolly good & capable chaps. There was a great amount of paper to deal with and plenty of administration work to be done by me before I could think of turning in. A quiet night on the front. Jack looked me up.\n","18":"\n\nVillers-Bretonneux\n\nThe morning broke wet and the place was soon covered with a sort of white cement slush, like cream from the water on the \nslush\n chalk. The General called in early on his way back from a tour round the line. Sale, Harris and others were also buzzing round. A few shells whistling over. An American officer and a private fell into Boche hands last night getting lost. Although the greatest secrecy is observed it looks as if there is to be something doing here soon but what: - no one yet knows. Went up to see Capt Davis in the village after lunch and found him in a cellar. The Hun was putting a few shells around but not much out of the ordinary. Visited the other companies and\n\n2\/8\/18\n\nVillers-Brettoneux\n\nfound them alright and that there is limited accomodation only for the companies. Went to see the doctor later in the afternoon and had a talk to him regarding Sparrow who arrived later in the afternoon. Returning from here just on the fringe of Villers Brettoneux we could get a grand view of the Cathedral of Amiens dominating the plain. The 28th Battalion relieving us has a number of people up here reconnoitring. The rain kept on for a long while and after mess one of the walls of our little mess fell in and I had just left the place in time to avoid injury. There is surely “something doing\" as all sorts of rumours are going the rounds. Major Mitchell\n\n2\/8\/18\n\nVillers-Brettoneux \n\n28th Bn came in to our relief and at 10.30 pm in company with our Yank comrades we set off for the front line trenches. Just before we left the enemy put a few shells around just for luck. It was pitch dark as we set out on our walk up through the village – the notorious village – of Villers Bretonneux. Gun flash and crash, the sickly light of flares and all round devastation. Machine guns were active but none came near us. We started to pass men moving in all ways as the 21st as well as ourselves were on the move. We trudged through slushy mud – the result of the rain today. On a stretcher was laid an American with a hole in his head and another wounded man laid alongside also – cracked by a shell.\n","19":"\n\nVillers-Bretonneux\n\nFound that our headquarters was a dirty and stuffy dugout crowded to the utmost limits. The 21st Bn - Sullivan’s coy. – was in the place when we arrived. Our men gradually commenced to come into their positions. It was dark, the trenches were full of slush and of water and many of the bivouacs had fallen in. So all hands had to set to work to try to make their places into some sort of shape. We had to put on a fatigue party to carry timber up to the place where a new power buzzer is being put in. Our Yanks are very novel with their accent and their “figuring, guessing, outfits, &c &c. They are as keen as mustard and full of buck. A very great fillip to our morale.\n\n3\/8\/18\n\nVillers-Bretonneux\n\nWent all round the companies in the growing dawn and found them all making the best of a very bad job. Most of the chaps had a smile of some sort in return but they were carrying on under wretched conditions. When we got round to the right we found that it was not possible to get along to where Westaway was. Gorman did it and got a couple of shots at him. There was a wood in plain sight and this was occupied by the Boche. After returning to our filthy dugout I had a doped kind of sleep and could not rouse again until major Harris came in and talked about fatigues. After that I had a shave and eventually got up in the late afternoon. The Hun was chucking a few shells around and it quickened \n\n3\/8\/18\n\nVillers-Bretonneux\n\nto a kind of slow barrage. Received word that the Hun has evacuated Dernancourt and that there are signs of him retiring from Mondidier. Efforts on the part of the 21st to capture a prisoner proved futile. The men had a terribly hard night tonight they had to do 6 hours digging without having had anything to eat for 12 hours. Every gas guard and all other details had to go on the job. They are working my men to breaking point and it worries me a lot. The people behind simply don’t realize what the chaps have to do. Stayed up until 1 a.m. We shifted our headquarters from this wretched and evil smelling dugout up to where the 21st H.Q. is and settled down there.\n","20":"\n\nVillers-Bretonneux\n\nCharlesworth roused my ire by being late with breakfast. Soon after getting up I pushed off through Villers Bretonneux off down to Bde. H.Q. The village had been shelled and there was a great lot of transport about last night. A number of dead horses and some \ndirect\n as wagons & limbers were lying round direlict. Coming up I met Canadians & Tommies all coming up to make reconnaissance and it was only God’s goodness that the boch did not get well on to them. Got a lift in an ambulance for a good part of the way down and reached Bde. H.Q. where I saw the General. He went into the plans for the projected big attack – a very large thing. The main road is covered with\n\n4\/8\/18\n\nVillers-Bretonneux\n\ndumps of 18 pounder shells and there are dumps right up to the present front line almost. Got back and commenced to make preliminary arrangements for the relief. We go into the line on X-Y night and the 21st hop over on a defensive flank job. Remained down in the stuffy dugout until very late and then went around the line of the supports and saw my chaps. Keith Sutherland had come up and came around with me. Saw Col. Brazenor and then visited D & C Coys. The Hun was firing green flares and putting a few shells over. Guns are being put in close behind us now. Received word that wireless points to the Hun using gas tonight. Much transport in Villers Bretonneux.\n","21":"\n\nVillers-Bretonneux\n\nThe night was quiet except was a few salvoes of gas shells. Once again the roads were thronged & busy in preparation for the attack. The noise of tanks, tractors, guns and transport getting into position could be plainly heard in our front line and must have been audible to the Boche. Thousands of shells are being dumped in little heaps and camouflaged. There were several little fires burning in Marcelcave. Corpl. Wigger of our Transport was up forward carting S.A.A. up for Bde and somehow got out into No Mans Land being lost. The 21st post put a bullet through him. Got up at about 8.30. We lit a fire to create a draught through the dugout as the air was so thick that you could cut\n\n5\/8\/18\n\nVillers-Bretonneux\n\nit in chunks. Outside this morning we found the day dull and misty. On the front things were quiet. It is a great pity to look back and to see behind us here the pleasant homes and nice houses of Villers Bretonneux all smashed and bashed to pieces. Our Yanks leave us today and it leaves me with only about 160 men to take over the whole sector tonight & of these only about 120 are available for manning the front line posts. We shall be sorry to leave Lindroth, Petrie & Co. Their sayings & accent are very funny. Our chaps are very friendly with them. At about 2 pm all the Americans moved out in 5’s and made their way off to the rear. Fairly solid rain now came on and \n\n \n\n5\/8\/18\n\nVillers-Bretonneux\n\nin it – set off on a round of the companies. Slipped and slid about a good deal and found the chaps all crouched up in their bivvies. They are tired. All the officers are pretty well. Met my old friend Pte. “Squeaker\" Dyson and we very cordially shook hands! This is a democratic Army. Noticed our Yanks today cordially shake hands with some of their sergeants. Found some chaps rather uncomfortable and arranged to put them in bivvies vacated by Yanks. Called on Colonel Brazenor and then returned back. Rumoured that the Boche raided about two Bns. down on our right last night so we are exercising special care. Guns of all calibres coming up here tonight.\n","22":"\n\nVillers-Bretonneux\n\nThe morning broke a fine sunny one and I found that I was in grip of the prevailing diarrhoea, which in many cases, is turning to dysentery. The sky soon clouded up and rain commenced. A couple of 21st were killed last night and their bodies brought down for burial. Laid down and rested until after lunch. During the afternoon received detailed orders for the projected attack and thereupon commenced to make all arrangements. All the Company Commanders came to Bn. H.Q. at 6.30 p.m. and went into the scheme with me. The supply of rations tomorrow night is going to be difficult. Q. matters discussed with Burrage. Salmon & Mallinson came up with Harricks tonight. Sutherland went back to Transport.\n\n6\/8\/18\n\nVillers-Bretonneux\n\nOur chaps had their dinner and then moved off for the front line posts some time about 11. Fritz planes came over and dropped a few bombs. Our searchlights were a great sight all massed together. The Boche had one solitary ray only and was releasing his famous “onion\" strings. Our relief of the 21st Battalion was not completed until the early hours of the morning. While Barley of the 21st was showing Madden the location of the flank post of next door battalion he got sniped and received a nasty wound in his forehead. Only his steel helmet saved his life. He came down to Bn. H.Q. with much array of blood stained bandage and was cheerful enough but will feel the shock in a few hours.\n","23":"\n\nVillers-Bretonneux\n\nThe day broke fair but rainclouds are still hanging about. The General called early for a final talk over preparations for the attack. The tanks are massed in the village and guns are dug in nearly up as far forward as the firing line and their emplacements are camouflaged. The 5 & 7th Bdes will capture objectives as far as the guns and the 5th Division will go right through them cooperating with the Carricks on the right. Our task is light. We clear everyone out of the line at – 4h. and leave only about 5 posts to cover the forming up. They remain there until – ½ hour. This operation is one of the most ambitious we have yet attempted and everyone will be anxious until we know how it goes.\n\n7\/8\/18\n\nVillers-Bretonneux\n\nAfter lunch I received a secret message which named tomorrow as the day of zero. In later despatches came a special order of the day from Sir John Monash. We were busy here writing and drafting orders. All over the countryside there is a great deal of movement but, as the day is hazy, I doubt if the Hun will see a great deal of it. Our khaki matches the present dry crops and grass rather well. The Hun was quiet and very few shells came over. This crowded dugout 30’ underground is a stifling and stinking place full of foul vitiated air that saps the energy out of one and leaves absolute and complete limpness. Except for an unusual amount of movement on our part the rest of the day was normal. About 4 pm a chance\n\n7\/8\/18\n\nVillers-Bretonneux\n\nHun shell set fire to a dump in Villers B and clouds of smoke went up to the tune of crackling SAA and heavier explosions. In all 20 supply tanks were destroyed by this fire. Soon after dark our tanks began to move up and all throughout the night they made a devil of low humming noise. The low flying aeroplanes which were to have screened the noise were conspicuous by their absence. Flares were normal. In the early evening the Hun enthusiastically dropped shells into his own front line – much to the indignation of his infantry if his liberal display of flares could be taken as a criterion. After midnight infantry commenced filing on to their tapes and our companies withdrew to their “A\" positions clear of the barrage line\n","24":"\n\nVillers-Brettoneux\n\nall except 5 posts each of 1 officer & 10 men who remained in position in the front line. At 3.30 things were very quiet on the front and a slight fog had come up. At 4.15 the front was quiet except for a few of his shells dropped anywhere over the mapsquare. Some of the shells were incendiary ones and started small fires in the dry crop. The assaulting troops were densely massed on their tapes and voices could be heard calling so doubtless a few were hit. Just about 30 yards from our dugout door was a 6 gun battery of 18 pounders and so close the trajectory being flat we had to take care to ensure that all men were in the trenches. At 4.19 the battery commander’s word of command could be heard. The attack was launched at 4.20 a.m. when far back the heavies first belched out\n\n8\/8\/18\n\nVillers-Bretonneux\n\ntheir call was quickly taken up for miles round and the battery just behind us nearly blinded us with fire and deafened us with noise. The flashes lit up the sky in weird illumination and the roar was shattering to the ear drums. The amazement of the Hun in seeing new batteries spring into being and places close to his line spitting out fire can well be imagined. Going down into the dugout the noise was nearly as bad and the whole place was reverberating. The light was just right for the attack. Down the main road out of Villers Brettoneux armoured cars commenced running. Our tanks were well ahead with the attacking waves. Our artillery were well enough advanced – 8 & 9 inch guns on a level with this\n\n8\/8\/18\n\nVillers-Bretonneux\n\ndugout only 1400 yards from the enemy front line. The 18 pounder battery close to us had a couple of prematures to start with. The blast and fire and hellish din of this barrage give one an idea of what modern war is. Soft flesh and blood has no chance and personal valour is of no avail against merciless machinery. Walking close up under the wall of shells and taking the inevitable “shorts\" are our men & Canadians. Further south are 15 French Divisions. A great battle. A few of our wounded and many German prisoners were soon coming down the road and being dexterously ratted by our boys. Stewart acquired a ring from one chap in the twinkling of an eye. Walked over to the battery close by and watched it in action.\n\n8\/8\/18\n\nVillers-Bretonneux\n\nThe battery commander (St. Clair) a dim figure walking up and down. The gunners loading and firing at a fixed rate mechanically laying the gun and setting the sights by the aid of electric torches. The recoiling portion of the gun running well back but these well trained men not getting in the way at all. The Hun put a few shells right on this place very soon. The smoke formed a dense cloud all round the landscape in a very short time and made the keeping of direction a very difficult task. Despatch riders and motor ambulances with doctors were soon on their way up the road towards Warfusee. Almost before it could be captured. Supply tanks and Armoured Cars were also soon on the move. A Major \n\n8\/8\/18\n\nVillers-Bretonneux\n\nof the armoured cars came in and yarned of Egypt, Gallipoli and Salonica. Sent Harricks over to the Railway cutting as Smith’s prisoner post was reported as not being in position. The procession of prisoners continued to grow every minute. At 8.15 I issued orders for the troops to occupy the old front line system. General Robertson and staff soon arrived and took over the place I had vacated and used the dugout. Pushed off with Stewart down the road and passed many groups of Huns marching along. The total we saw along this road alone must be hundreds. As we neared the old front line we passed the mouldering body of an Australian soldier who had evidently been shot while out on patrol. One the other side was a clay coloured thing with four large white teeth – the dead “face\" of\n\n8\/8\/18\n\nVillers-Bretonneux\n\na Hun. The road was now thronged with guns and limbers and all kinds of transport. We passed along passing several badly wounded men limping along with the help of others. Outside a little Dressing station was a group of Huns. One had been struck through the face and kept raising and lowering himself on his stretcher groaning with agony. Others all bloody also lay around. A little further on lay what appeared to be a long dead German corpse with a dreadful face all torn about. While looking at it one of its hands raised and lowered itself. A Hun plane did a daring reconnaissance & was forced back by one of ours. Passing over our front line the smell of phosphorus from our “few hours ago\" bombardment was very noticeable.\n\n8\/8\/18\n\nVillers-Bretonneux\n\nOur aeroplanes were flying very low. We walked well over what last night were positions very strongly held by the Germans. A few lay dead. But considering the fierceness of the struggle the small number of dead was truly remarkable. Found 2 Coys in trenches near an Aerodrome and 2 Coys a little further on. Hughes very dopey today had neither selected a headquarters or established his communications. Decided to make a little burrow under a road the Bn H.Q and then went round the men. They are dog tired & weary & have not an ounce of fight in them. Col. James later called and said his chaps were the same. Near here is an aerodrome and Stewart salvaged 150 new petrol tins there. The Warfusee – V.B. road is one\n\n8\/8\/18\n\nVillers-Bretonneux\n\ncongested mass of traffic. The crowds of Huns passing comprise all types. Two tank officers walking in front of their tanks were run over & crushed to death this morning. Stewart and others went forward as part of a reconnaissance party up through Warfusee and report all fairly quiet on the front. Our Corps took (it is said) 3600 prisoners today and it looks like very many more being the grand total. The cavalry are said to have captured a train load of reinforcements in one place. Our Transport moved up closer to us but is still too far away. Motor cars are running tonight over what was machine gun swept No Mans Land last evening. All the men are very excited over todays affair. Tanks, aeroplanes, artillery, armoured cars, cavalry –it has been a full day.\n","25":"\n\nVillers-Bretonneux\n\nWas awakened at 4.20 am by my batman with breakfast and found that through mistaken orders the whole Battalion was breakfasting at that time. No orders to move came until about 8.20 when we received word to proceed to a certain map square near Marcelcave. Moved over there across country and got into artillery formations behind the 23rd who, thanks to their transport officer at Bde, were in possession of near all their transport here. Had a conference with the General and we marked up our maps – tonight we bivouac God knows how far away from here. Returned to the field where the men were resting only to find that Stewart was fast asleep on the grass and our cookers and everything else absent. A few big shells. Moved at 1.15 to a place near Guillacourt crossing by artillery formations – the whole Brigade. The 3rd Bde\n\n9\/8\/18\n\nGuillacourt\n\npassed through us in Artform and attacked. Later about 500 prisoners came down. The Yanks had rather a rough time this afternoon. Called to conference with the General and got the latest. Our 5 & 7 Bdes attacked at 4.30 pm. We remain in support perhaps all night and started to make bivvies. Our spot was a big Hun R E dump so we scored. Saw several very thrilling air fights & one downed. Established H.Q. in a flare dump underground. The men soon turned all the material to account and made fine dugouts. The cooks had good food ready for them too. Our tanks had a rough time but otherwise success again appears the order of the day. Hun planes bombed us after dark. A sausage of ours was shot down by shell.\n\n10\/8\/18\n\nGuillacourt\n\nNo orders arrived for any move of ours and we all had a good sleep in our bivouacs. With the company commanders and Stewart I left for a reconnaissance of the front line first calling at 5 & 7th Bde. HQs where I saw the two Generals – Martin & Wisdom. We then walked across very pleasant meadows that looked like anything but a battle field. Arrived at 17 Bn H.Q. I saw Col. Soulier and despatched the O.C. Coys. forward. After a yarn Stewart, Gorman & myself pushed up into the village of Framerville which a few days ago was a German Corps H.Q. The railway line near here had on it a large train carriages & trucks all the occupants of which were taken prisoner during the advance the other day before they could get away. On the railway here\n","26":"\n\nFramerville\n\nwas also captured an 11 inch gun which with all its trucks caused much interest to the troops. There were 25 shells still left on the train and a French artillery officer came up & arranged to fire off all these at the Boche. A number of German staff officers were captured at Framerville but the Corps. Commander got away. The village is one of the ordinary type & not much damaged. Just at the entrance to the village there was a German lying on his back dead and covered with flies. He was wearing the ribbon of the Iron Cross but a search of his clothes did not reveal anything worth taking. In the first houses we entered in the village we struck plenty of equipment and German clothing lying around the house, artillery wagons and other gear\n\n10\/8\/18\n\nFramerville\n\nwere lying around direlict. The place was only captured yesterday afternoon. Near the church were a number of stinking horses killed by our armoured cars and a visit to the house adjoining gave us a rich harvest of souvenirs. In the backyard was a travelling library full of cheap novels & inside the house a meal was in preparation in the kitchen meat chopped up and wine poured out. Clothing & personal belongings everywhere. One room was a shop full of books, some of them really valuable. We ratted the place and got out with our loot just as he let out a bombardment. One shell went close enough. Had a hot walk back to Harbonieres where we picked up our horses. Rode back to Camp. After lunch\n\n10\/8\/18\n\nFramerville\n\nour Band gave a programme. The first band to reach this far forward. Put in the afternoon on odds and ends & eventually met the General who told me that the 5 & 7th Bdes attack tonight and that the 24 & 23rd move forward. I move up tomorrow night & relieve in the newly captured positions. Rested the men and then got them to bomb proof their places – a wise move as we were raided later by planes. Saw two very dead Huns today near a couple of bivouacs. The flies off their wounds were getting on the bread & jam of some Billjims who were unconcernedly munching near by. Sutherland is with us tonight here and Harry Thewlis returned from his school today. Harricks is dopey.\n\n11\/8\/18\n\nGuillacourt\n\nAnother fine hot day. We were heavily bombed by enemy planes during the night. Just after getting up Colonel Duggan came over to see me. At 10.40 received a rush order from Bde. HQ. to move at once to the old French line up in front of Harbonieres and for myself to report to the General in the Pigeon House at that place. It seems this morning as if the 5th & 7th Bdes got through OK in their attack but that the 3rd Division have been held up and are unable to go further. Saw the General at the Pigeon House – a circular old tower dated 1656 in the courtyard of an old farm now very dirty from German occupation. The Battalion was now on the move and I rode out and met them and\n","27":"\n\nGuillacourt\n\nthen pushed over to a little copse where we located headquarters. I then saw Colonel James. There is a rumour that we advance this afternoon & pass through the present front line. James & I work together and have a battery of field artillery attached to us. Held a conference of my company commanders and then gave them all the information I could and allotted such frontages & formations as was possible. This little copse is full of small bivvies and yesterday dead Germans were lying around but they have now all been buried. Our cookers and L.G. limbers have now moved \noff\n up to us. The men are all disposed in the front line (Black line) and there await any orders that may be wanted. Wall came back to us here this morning.\n\n11\/8\/18\n\nFramerville\n\nThe afternoon was quiet and we only had a few shells over. Slept and dozed. Sent Eugene Gorman ahead to reconnoitre our headquarters for tonight and called in all our overcoats in case the boys have to fly the bags. Orders arrived just before dark for us to relieve some of the 19th and some of the 28th. At dark we moved. Stewart & I rode up on horseback & called on the old French line and had a talk to all my company comdrs. It was dark now and some Boche planes were low flying over and dropping bombs which burst with loud crashes. The airman came so low that we could clearly see his plane. As we rode across to the village of Framerville he followed us with bombs and I think caused some losses\n\n11\/8\/18\n\nFramerville\n\nin the 21st Bn. We rode across to the village – the roads and fields are not much shell pitted – and had a few shells and other excitement as we rode up the main street. My horse nearly threw me by stumbling into a big shell hole – the place has been much knocked about since the we were in here yesterday. The road in places was covered with debris from tonight’s air bombing. Just at the corner near the Church is the same festering heap of the horses killed by our armoured cars. The stench was awful. In a cellar I found Colonel Batemean and relieved him of a two company frontage. Our relief went fairly well. I also took over a coy. frontage from Col Currie of the 28th.\n","28":"\n\nFramerville\n\nAbout 3.30 am the General rang me up and said that they had heard nothing of Col James all night and were rather anxious about it and that I was to assume command of the 24th in addition to my own. This was only for an hour or two as James turned up alright having been lost. After breakfast set out for a look at the positions. The stench of the dead horses outside is wellnigh insupportable. The Church is much damaged and had been used as a hospital. Outside lay a dead German sprawled near the threshold. A battered Chateau was alongside the Church. Walked out into a very pleasant little field and saw the posts of our firing line of two days ago. Two of our men were lying dead on stretchers covered with groundsheets to keep the flies off. Found McCartin in the Quarry\n\n12\/8\/18\n\nFramerville\n\nand took a walk round the bivouacs and shelters there – all full of German stuff. Here there was a very old minenwerfer on which some wag had chalked “Captured by Anzac Provost Corps on the Strand\". Had a short talk with Davis and Westaway and then met H Smith and went up into the front line with him. We were well exposed to view but the Hun did not shoot. Passed a dead German with a bloody wound in the leg. Found the firing line running through pleasant fields and all very quiet only an occasional sentry on duty. Salvaged two light machine guns and carried them back to Davis H.Q. Gorman & I then pushed across country to Rainecourt which was taken yesterday. In the trenches just\n\n12\/8\/18\n\nFramerville\n\nbefore the village were evidences of fighting. Two or three of our 19th Bn. lay dead – one partially stripped of his clothes by shell burst. In the trenches lay some Huns horribly mutilated by splinters. One was wearing an automatic revolver and Gorman hopped down to rat him. A little bird hopped out of the inside of the mans head. The village itself is a small and dirty one now much shattered. Found a field ambulance tent full of medical stoves and requisites. Lying just at the back of this place was a rotting corpse of an elderly German – the whole of his face had been shot off. We left the village and passed a well filled cemetery before coming to the Town Mayors office where we collared large\n\n12\/8\/18\n\nFramerville\n\nfiles of Army Corps & Divnl Orders and sent them to Intelligence. Just outside the village was some transport which contained some elaborate band uniforms. A fat and bearded dead Hun with large gas distended belly lay out in the open. Returned to Bn H.Q. at about 11 a.m. and saw the G. who had come up to see me. Another bevy of rotting horses lay near the entrance to the village. Lieut Edgerton D.S.O M.M. & Bar was killed this morning. Things began to get a little exciting about 5 when Sale rang up (The B.M. was wounded today) to say that other people had pushed out daylight patrols some distance ahead without opposition. Ours soon met with m.g. and other fire. Braithwaite then reported\n\n12\/8\/18\n\nFramerville\n\nthat on the left of the 23rd the 1st Division were advancing in waves. Ultimately without opposition the line from our right all swung forward some distance. We remained the pivot and on our left the 24th had a rather hot time from big stuff. Enemy were seen coming down the road and massed in a wood from which they deployed under a barrage but nothing further eventuated. The 3rd Division came up ½ a mile further left and this flank with its woods & valleys was very busy. At 7 p.m. I left the cellar in Framerville and shifted to dugouts in the ravine near McCartins quarry. Just at dusk our artillery put down a heavy barrage and he responded in\n\n12\/8\/18\n\nFramerville\n\nmaking the place rather unhealthy. Things settled down about dark and I went over and saw McCartin and had a talk with him about his action in case of attack and other matters. The men were all fallen in for their ration carrying parties and moved off to time. Behind us searchlights were picking out the sky. A m.g. from the left flank was extremely troublesome and enfiladed the valley. One bullet hit Goffin, an A Coys. b, and went right through him. He is a fat man and bled like a pig. Just before midnight I decided to go round the posts and took Sutherland and a runner. Things were quiet the night dark and flares going up well back. Strings of flaming onion signals at intervals.\n","29":"\n\nFramerville\n\nFound Braithwaite and visited his posts which were connected by a wire. The posts were small ones & at the rear of some were dead Australians. Found all the chaps in good heart until I reached A Co. where the loss of a tin of stew had upset their morale altogether. I roused certain people up over this occurence and the men received an extra issue of porridge to make up for it. Shortly after the right post of C Co. was struck by a whizzbang and 1 killed 6 wounded was the result. Called and saw Davis before returning to H.Q. and to sleep. Got up at noon a fine warm and peaceful day. Expect to advance my line tonight and also the have to do a sidestep. Took Sutherland with me and made a reconnaissance of the\n\n13\/8\/18\n\nFramerville\n\npositions on the right flank. Open cultivated land with a few Hun bivvies here and there. Got of a good collection of German postcards and salved a German signalling lamp complete. Made arrangements and issued all orders for our change over tonight. Except for a few salvoes the evening was quiet. As soon as it was dark we pushed forward our line about 400 yards on a front of 700 yards and succeeded in doing it without incident. It is very hard to conduct any movement over ground so bare is the landscape of landmarks. I found that our runner had taken us out into No Mans Land right through our posts. Instinct told me we were well advanced so I stopped. The runner soon found we were well out so we returned and\n\n13\/8\/18\n\nFramerville\n\nand eventually found Bubbsie McCartin. We walked out to a deserted post in front where a number of dead were lying. The stench of rotting human bodies penetrated everything. We tried to find our way overland in the dark to the next post – rather dangerous because we were out in front and could easily be fired on by our own men. We got lost and stumbled on another post littered with dead. One of the Germans had not been ratted and our runner turned the body to get at the pockets. There was a sound of tearing as the blood soaked clothes clung to the grass and the dead man made peculiar noises as gas escaped from his mouth. Made my way across to Braithwaite’s headquarters and saw him there. They had a good\n\n13\/8\/18\n\nHerleville\n\ndeal of trouble owing to loss of direction. While sitting here talking Fritz opened up a heavy strafe and some shells landed pretty close. Gorman & I decided to make a break. We had only gone a few yards when we ran into a splendid barrage of HE and gas. I got a lungful of gas which nearly scorched my throat off. We put on our helmets and ran along a telephone wire, muzzled panting through a fog of smoke & sneezing gas. Shells were landing very close and we seemed to have charmed lives as we went through. At last we came to the gully and threw ourselves exhausted down into a hollow for shelter. Had a warm passage back to Bn. H.Q. and staggered down the stairs with masks covered with discharge from nose & mouth & bad eyes.\n","30":"\n\nHerleville\n\nSlept until 3.30 p.m. and then got up feeling none the worse for recent experiences. Went up to a conference presided over by the General at Duggans H.Q. A Hun cooker with dead putrefying cooks lies on the road here. Got back to Bn. H.Q and held a conference of company comdrs. As we were finishing mess the Hun shelled us out of the place and we precipitately retired to our dugout. Received a S.M. telling of Uncle Willie’s death. As soon as it was dark we started once more to advance our line and evidently there is some “boxing on\" as sounds of bombs & bullets reach us. Burge 24th killed & two sergts hit just at our door. One man\n\n14\/8\/18\n\nHerleville\n\nhit in the back bandaged down here. Braithwaite rang up and said he had found Sergt. Fouracre (a nice boy) lying dead near his post due to a stray bullet. Our move out on to the new line was completed without incident. One of our headquarters carrying party was wounded by a whizzbang. Cowan came up tonight and I am sending out Proudfoot.\n","31":"\n\nSlept on until after 11 and then did some odds and ends of work. After a bit of lunch went over to see Colonel Brazenor and talked over matters of importance with him. Saw Jack over there and roused him up his present venturesomeness and am annoyed at the way B. is exploiting him. The Hun has pasted our\n\n15\/8\/18\n\nHerleville\n\nheadquarters several times today. Just opposite at the R.A.P a motor ambulance was blown to pieces and a man there also. Another had his arm blown off. Our guns were putting up a nice little shrapnel barrage over St Denis wood. In the evening after the usual visits from Q.M. & S.O. I took Thewlis and Rowe the runner and set off for the firing line. With a machine gun on the left flank Fritz was making the place very hot and the bullets frequently forced us to the prone position. As we progressed towards the line the disgusting smell of rot nearly made us sick. The clothes of the men and the very food they eat become permeated with the stench of dead bodies. Our \n\n15\/8\/18\n\nHerleville\n\nrunner was rather at sea and we had a lot of chasing about before finding McCartin. With him we pushed forward to locate the posts and got right out into No Man’s Land. Low whistling brought a reply from our rear and we walked back and into the posts. He was using an extremely fast gun like a .75 tonight and appeared very nervous. After seeing Westaway and Armstrong we had a rather uneventful walk round the remainder of the line. Had a yarn to Mr. “Barney\" Oldfield at “C\" Coy and found the men very tired and war worn. Returned to Bn HQ about m.n. and had the pleasure of being bombed from by a Hun plane just as we got in.\n","32":"\n\nHerleville\n\nStayed in bed until as late as noon when Sale came in with word of a hopover to be carried out in a couple of days. They are relieving an English division with the 5th Division. Truly they are trying our Corps to breaking point. The Boche stuck repeated bursts over on us here and landed several 5.9’s bang up against our door and put out the candles. Went down to the 23rd Bn and saw Colonel Brazenor about a few details of the advance and made mutual arrangements with him. As we returned we had a few shells quite close enough for anything but we managed to dodge the pieces. A Vickers gun officer called and I detailed his action.\n\n16\/8\/18\n\nHerleville\n\nStewart has been missing all day and it now transpires that he was wounded this morning near the 21st lines. I did not go out at all during the evening but turned in early in an endeavour to snatch some sleep before m.n. Could not sleep.\n","33":"\n\nAt 1 a.m. all the company commanders and my Bn. H.Q. staff assembled at this spot and to them I issued orders for our attack tomorrow at dawn. It was pathetic in a way discussing the attack with such few numbers and with such tired & wornout men as ours now are. After the O.C.s had gone away I turned in for an hour or two and at 6.15 went down to 23rd H.Q. where I met the General and Col. Brazenor\n\n17\/8\/18\n\nHerleville\n\nand with them fixed up all details. Returned to Bn HQ and there put in a busy time seeing T.M. and other people. Wallace a M.G. officer lost his way last night and got out into No Mans Land. As he came in towards our posts he evidently did not hear their challenge and received a bullet in the stomach. The rest of the day was devoted to organization and preparation of orders. In the afternoon Brazenor struck trouble round the Maze and Weir received a crack in the head. There were five other casualties at the same time. The Hun put down a stiff barrage on the 24th sector – most of it fell on his own posts which his infantry had to quit in\n\n17\/8\/18\n\nHerleville\n\nhaste thus affording a good mark for our rifles. Our guns in addition tipped heavy shells over on them. Some officers of the 2nd K.O.Y.L.I. came along – the advance guard of our relief. The 21st sent me a company to come under my command until the stunt is over. They carried up all our rations for us tonight and it reached there alright. It turns out that old LaMotte who I met at Army H.Q. Flixecourt is the Colonel relieving me. The Major sent up to reconnoitre appeared slightly impossible. At about 12.30 after a short sleep I took Hughes Thewlis & complement of runners together with my artillery liaiason officer up to battle headquarters – the mere scratch in the ground used by\n","34":"\n\nHerleville\n\nBraithwaite previously. We had a quiet passage up except for once assuming the prone (m.g. bullets). A counter preparation strafe was opened up by him at 1.20 a.m. Am sitting in a tiny shell slit with a signaller who has a little switchboard and a ‘phone. A bullet torn blanket covers the entrance and shields the light. At 2.30 am there commenced a more general strafe in which both sides seemed to participate. Our 18 pounders over on the left opened the ball 2.40. Enemy firing a good many greens – twin & single – on the left. A fairly heavy bombardment well up on our left some miles. Received word from McCartin that he has spotted a m.g. out in front. He wanted 4.5’s but their blow back made them unsafe so I declined. At 3.12 a chance\n\n18\/8\/18\n\nHerleville\n\nshell got both our lines back to Bn. H.Q. At 3.40 things were quiet on our front except for irregular shells whistling over and the stunt on the left had died down. Lines came on again at 3.47 and I passed word to Wall for Bde. that we were all correct and conditions quiet. Twenty five minutes yet before the barrage opens. The seconds must appear to drag to the chaps out on the posts & . Braithwaite from there reports all quiet. The Hun firing flares from the Crucifix. At 4.7 things are still quiet and the last 8 minutes will seem to drag. Heavy rumble of guns on our left.\n\n4.15 Barrage opened. 4.16. 2 Reds, orange cluster. 4.18. Enemy m.g.s opened. Heavy shells falling round here. Our m.g. barrage guns ticktacking.\n\n50\n\nWed. - 8 m.\n\nFull – 10\n\nMe - 14\n\n18\/8\/18\n\nHerleville\n\n4.20. our barrage swishing over and seems good. M.g. bullets seem to come from direct front.\n\n4.26 Reports barrage on No Mans Land. Here the air full of bullets and shells. Flares in front fewer.\n\n4.35 Braithwaite thinks success signals went up at Crucifix & further round. Hun red S.O.S. at Westaways X roads. 3 Whites right coy seen by Thewlis. Wire down from rear B H.Q.\n\n4.40 Red & green from Westaway. Advised Sutherland & fired from here also asked for more protective barrage.\n\n4.45 Westaway struck m.g. in centre and held up.\n\n4.50 S.O.S.\n\n4.54 Our A Co. back.\n\nRed & green left coy.\n\nJust about this time it began to become evident that things were\n\n18\/8\/18\n\nHerleville\n\nnot going too well on the front. Braithwaite rang up that he could see A Coy coming back and an appeal for assistance came from Westaway. Presently McCartin wounded in three places rang up that A Co were not at the Crucifix and that he was in the air. Word now came that A Coy had been held up by M.G. fire and that Fulton and Evans were both wounded. Young Smith rang up and told me how matters stood and old Holloway the runner also came in. On the left Westaway’s people seem to have been surrounded. Brazenor was killed – so was Sgt Ellis of A Co. Armstrong , Westaway & Mallinson are missing. The Boche was seen to march off\n\n18\/8\/18\n\nHerleville\n\na party of Australians to the rear under escort. James had one of his posts mopped up, 4 captured, 2 wounded. We tried to do stretcherbearing under the white flag but the Boche would not permit it. Brazenor pushed Sullivan (21st Coy) round to the Crucifix and saved the situation there. Eventually the General ordered us to dig in on that line, the objective to be left untaken and 24th also pulled back. Rather an admission of defeat but what could be expected with 130 dogtired men on a front of 1000 yards. Out of this small number the casualties are heavy. Many of my boys are lying dead and wounded in the thistles. I am worried about\n\n18\/8\/18\n\nHerleville\n\nBubs McCartin. Shot twice in the arms and once in the face he told me he was going out but he never reached the R.A.P as far as I can see and stretcherbearers say they found an officer of the battn. this afternoon lying out. Someone with bloody face was seen feebly moving his arms. I hope it is not Leo. Into the line I have sent sufficient of the 21st to back up our people. The rest of the day was quiet odds and ends of people bring in terrible tales of being smashed up, surrounded. 11 survivors out of B Coy only. The effects of Bubs McCartin have been found on a 6th Bde M. gunner so the dear boy is dead. God it’s hard, the best of lads. Colonel LaMotte 2nd K.O.Y.L.S marched in to my\n\n18\/8\/18\n\nrelief just after dark bringing in about 600 men which later events showed were wanted as they were counterattacked at dawn. Our guides worked alright and we left at a time after midnight,","35":" for the cookers where we rendezvoused – what was left of us. Walked over to Harbonieres and had a great search for the busses on which we eventually mounted and got away. I was tired out and fell asleep. We went about 20 kilometres and eventually debussed at Vecquemont behind Corbie on the Somme and found our way to bivies and dugouts of a rough nature near a Canal. Went to bed at once and slept the sleep of exhaustion until about 5 pm when I rose dressed and went\n\n19\/8\/18\n\nVecquemont\n\ndown to the General. Talked about the recent stunt which is a mess up for him to open up with and shows lack of thought. Dined afterwards with him and the Staff and came back to my dugout for a round or two of paper warfare and eventually I hope, a bath.\n","36":"\n\nAnother hot and busy day. Camped in dugouts & bivvies facing the wooded valley of the River Somme. Band played for a while and all the Coys went for a swim to the river after lunch. Extremely warm and unpleasant in the mess and there were also plenty of flies.\n\n22\/8\/18\n\nVecquemont\n\nA hot boiling day. The 3rd Division attacked up front somewhere and the 1st Division go through them in the morning. The rumour is that we go in on the","37":" The Battalion paraded at 9.30 a.m. under surrounding green trees and did Lewis gun and other work. Mills with his staff and a limber went all through the lines and collared blankets and equipment galore. Our new reinforcements are settling down and should prove to be good men. They came via Panama Canal and U.S.A. Walked around and yarned to a lot of our old sergeants & others. The ground down near the river here is peaty and shakes when a horse is ridden\n\n \n","38":"\n\npast at a gallop. In the afternoon we held bathing parades. A Y.M.C A tent erected proved a great boon to the troops and I arranged for cocoa &c to be on for the men after dark. Doc. Simmonds came in to mess and we had a good chin wag with him. The evening is sultry but very peaceful and our Band is playing. Tales came in of crowds of wounded going thro’ from the 3rd Division and of plenty of prisoners. Sgt. B.V. Bridges M.M. who has of late been with the Americans has some funny tales to tell about his experiences there. Walked down to Daours with major Simmonds – a French village of the usual type winding streets & blank walls. Saw Col. James & yarned.\n\n"}}