{"Document Name":{"0":"Diary_0204","1":"Diary_0204","2":"Diary_0204","3":"Diary_0204","4":"Diary_0204","5":"Diary_0204","6":"Diary_0204","7":"Diary_0204","8":"Diary_0204","9":"Diary_0204","10":"Diary_0204","11":"Diary_0204","12":"Diary_0204","13":"Diary_0204","14":"Diary_0204","15":"Diary_0204","16":"Diary_0204","17":"Diary_0204","18":"Diary_0204","19":"Diary_0204","20":"Diary_0204","21":"Diary_0204","22":"Diary_0204","23":"Diary_0204","24":"Diary_0204","25":"Diary_0204","26":"Diary_0204","27":"Diary_0204","28":"Diary_0204","29":"Diary_0204","30":"Diary_0204","31":"Diary_0204","32":"Diary_0204","33":"Diary_0204","34":"Diary_0204","35":"Diary_0204","36":"Diary_0204","37":"Diary_0204","38":"Diary_0204","39":"Diary_0204","40":"Diary_0204","41":"Diary_0204","42":"Diary_0204","43":"Diary_0204","44":"Diary_0204","45":"Diary_0204","46":"Diary_0204","47":"Diary_0204","48":"Diary_0204","49":"Diary_0204","50":"Diary_0204","51":"Diary_0204","52":"Diary_0204","53":"Diary_0204","54":"Diary_0204","55":"Diary_0204","56":"Diary_0204","57":"Diary_0204","58":"Diary_0204","59":"Diary_0204","60":"Diary_0204","61":"Diary_0204","62":"Diary_0204","63":"Diary_0204","64":"Diary_0204","65":"Diary_0204","66":"Diary_0204","67":"Diary_0204","68":"Diary_0204","69":"Diary_0204","70":"Diary_0204","71":"Diary_0204","72":"Diary_0204","73":"Diary_0204","74":"Diary_0204","75":"Diary_0204","76":"Diary_0204","77":"Diary_0204","78":"Diary_0204","79":"Diary_0204","80":"Diary_0204","81":"Diary_0204","82":"Diary_0204","83":"Diary_0204","84":"Diary_0204","85":"Diary_0204","86":"Diary_0204","87":"Diary_0204","88":"Diary_0204","89":"Diary_0204","90":"Diary_0204"},"Date":{"0":"unknown","1":233.0,"2":234.0,"3":235.0,"4":236.0,"5":237.0,"6":238.0,"7":239.0,"8":240.0,"9":241.0,"10":242.0,"11":243.0,"12":244.0,"13":245.0,"14":246.0,"15":247.0,"16":248.0,"17":249.0,"18":250.0,"19":251.0,"20":252.0,"21":253.0,"22":254.0,"23":255.0,"24":256.0,"25":257.0,"26":258.0,"27":259.0,"28":260.0,"29":261.0,"30":262.0,"31":263.0,"32":264.0,"33":265.0,"34":266.0,"35":267.0,"36":268.0,"37":269.0,"38":270.0,"39":271.0,"40":272.0,"41":273.0,"42":274.0,"43":275.0,"44":276.0,"45":277.0,"46":279.0,"47":280.0,"48":281.0,"49":282.0,"50":283.0,"51":284.0,"52":285.0,"53":286.0,"54":287.0,"55":288.0,"56":289.0,"57":290.0,"58":291.0,"59":292.0,"60":293.0,"61":294.0,"62":295.0,"63":296.0,"64":297.0,"65":298.0,"66":299.0,"67":300.0,"68":301.0,"69":302.0,"70":303.0,"71":304.0,"72":305.0,"73":306.0,"74":307.0,"75":308.0,"76":309.0,"77":310.0,"78":311.0,"79":312.0,"80":313.0,"81":314.0,"82":315.0,"83":316.0,"84":317.0,"85":325.0,"86":326.0,"87":327.0,"88":328.0,"89":370.0,"90":371.0},"Entry":{"0":"\n\n","1":"\n\n3.30 Troops addressed & reviewed by Sir Gerald Strickland. Terribly exciting like Sams lectures\n\n5.5 Monotony relieved somewhat by the first pay 35\/- Kicked up a row because I got 5\/- too much. Scaled out by the transport gate & duly delivered up my spare cash by sundry means\n","2":"\n\n10.30 Marched down to the McQuarie Wharf. Taken by ferry to Cockatoo Is. where embarked on the Berrema – Mess C10 Dinner very decent Sling hammocks for beds – also extremely decent.\n\nSweet girl gives our hero a handkerchief as a mascot to carry him through the campaign.\n","3":"\n\n6.45 Towed out from the Dock to Farm Cove\n\n12.30 Set sail. Trip good many donate portions of their daily fare to the porpoises. Scenery exquisite. Selected as a scout for expedition – what an honour.\n","4":"\n\nContinue with the same aforesaid exquisite scenery. Receive instructions as to treatment of Papuan princesses, & incidently as to treatment of selves. Informed that letters will be taken at Moreton Bay but after writing one – long & loving – mails cancelled. Said letters heaved over board in bottle.\n\nPass evening very enjoyably with singing & cockfighting\n","5":"\n\n1 AM Enter Moreton Bay & lie all day\n\nReceive lectures on the habits of the Papuans & also on the mode of the advance of an army\n\n10.30 Again set sail after receiving sundry rumours that we were sunk in mid ocean by the German Fleet. Brisbane \"Courier\" confirms the above rumour. Sad scenes witnessed on deck by corpses of the soldiers & sailors dancing bunny hugs, rags & etc\n","6":"\n\n5 PM Picked up by the Battle Cruiser \"Sydney\" at the entrance of the passage of the Barrier reef, & subsequently steam with lights out in order to escape the vigilance of the German Fleet.\n","7":"\n\nHeave to and boat from Sydney comes aboard.\n\nEnter a region where the seas are studded with small islets apparently basalt some with a covering of pines and others bare. All greatly denuded from the ocean side.\n\nChurch parade. Service read by Lieutenant Colonel Holmes VD.\n\nSecond inoculation very severe.\n\n5.30 – 6.30 Pass through the Whitsunday Passage & sight,beneath the shadow of a lighthouse the first habitation witnessed since our departure from Sydney.\n\nScenery on both sides exquisite, with mountainous islands clad with stunted pines rising sheer out of the calm waters of the strait.\n\nLion Island at the entrance presents the figure of the king of beasts lying on the watch guarding the Passage.\n\nI have to note the first serious divergence from the menu. In order that this be appreciated, the aforesaid menu may prove useful\n\nBreakfast. Mutton & tea & bread (usually) extremely useful for killing porpoises, \n\nDinner Mutton & bread (but no tea) \n\nSupper Mutton & tea & bread.\n\nThe monotony of the course was somewhat relieved by plum duff (just as weighty as the before mentioned bread) for dinner & tinned herring for tea.\n\nThe monotony of the daily routine was also relieved by the news that a sailor lost £10 at \"banker\",& that an individual (whether sailor or soldier we do not know) was captured as a spy just as he threw the sights of one of our 4.7s over board. He was removed to the \"Sydney\" where in all probability he will be shot. Lucky dog!\n","8":"\n\n\"Sydney\" leaves us early presumably to coal at Townsville & we run into the Palm Islands where we meet the \"Encounter\" Islands very beautiful with peaks rising out of the pale blue waters. Some (to port) are bare & barren in appearance, but the large island on our right is clothed in thick tropical forest of varying hues, which against the waters of the little sandy crecent shaped bays form a very engrossing spectacle.\n\nAt two oclock a party of soldiers & sailors went ashore for skirmishing. We are likely to remain here for several days owing ,according to one of the ever rampant rumours on board, to the presence of several German cruisers off New Guinea. I note this rumour in order to show what gossips some men can be, & that women are not wholly to blame for the wild stories which are always in circulation. \n\nThe yarn about the \n\nheaving of the gun sight overboard has been reduced to very small & uninteresting dimensions now. We have been robbed of the spectacle of seeing the \"culprit\" shot as a spy, as it now turns out that the sights were left behind at Cockatoo Island. But there are vivid imaginations on board so that we may not yet be robbed of this pleasant little drama.\n\nI shall have to refrain from noting changes in the menu. The cooks sprung a huge surprise on us at dinner today by giving us \"green\" peas. Another rumour is also to hand that we are to have Cockie's joy for supper But it is probable that this will also be reduced (it certainly will not be made any wilder) during the next few minutes.\n","9":"\n\nTrixie Potts.\n\nThe above signature is rather suggestive - suggestive of several things. In the first place it may suggest that we have at last struck civilisation. We have in the form of a solitary mission station on Palm Island where we landed today to carry out some skirmishing.\n\nThe Island is of granite formation with very steep hills & shores fringed with stinking mangrove swamps. We spent some three hours ashore & some of us visited the station where pleasant memories were recalled by tea & scones. Quite a luxury compared with the fare on board. Always last on any occasion I was this time left far in the rear, my absence necessitating the operation of a search party. Another honor (until I came before the lieutenant)\n\nReturning ar 5.30 we were pleased to sight the \"Sydney\" as she returned. Prospects of the continuation of the voyage at an early date now seemed bright, but Major Martin now informed us that we will be here until Friday at the least.\n\n He also informs us that letters will be taken on Friday – the first since we left Sydney despite the fact that we all wrote & \"posted\" them at Moreton Bay.\n\nThe \"Sydney\" which was reported to have been in action is not looking much the worse for it. Perhaps the enemies shells all went astray. The \"Encounter\" which was sunk when we left Sydney is also in the best of health.\n\nNo variations in the menu. The meat gets stronger as the days pass so does the language of those game enough to eat it There should be some very interesting tragedies in connection with this during the next few days unless Trixie comes aboard with more tea & scones.\n\nI had givenup all hope of continuing with my trousseau during the campaign but to my surprise it is growing rapidly as I now have 6 knives 4 forks 2 spoons 3 belts, 3 hair brushes, 2 tooth brushes, 2 razors half a comb. It might be interesting to note that I came by them all honestly\n","10":" \n\nStill we linger so do the \"Sydney\" & \"Encounter\". No excitement. Wrote a letter. Had a wash. Got served out with sundry shirts & sweaters. Swore considerably. Soldiers & Sailors on the life boat. Sailors came back at 5.45 Soldiers not yet returned 7.46.\n\n 8.46 Weary splashes heard hard to port (a seaman's phrase) 9.46 Several weary punters retire to roost. Many other jovial punters dance rags on the promenade.\n\nSome more excitement. \"Encounter's\" brass band comes aboard 8 PM. Discourse wonderful music. More excitement. Stewards bring round chocolates 4 for 6d. Another graze with a higher civilization.\n","11":"\n\nStill we linger. So do \"Sydney\" & \"Encounter\" Posted letter. Had another wash. Swore much more than previous day.\n\nDifferent companies held a boat race. \"H\" company came second after an exciting contest for the first place and \"T\" company came first for the second. \n\nThree men were put under arrest to be sent hoe for smoking between decks. Have no \"smokes\" myself - Hard luck.\n","12":"\n\nStill we linger.. So do \"Sydney\" & \"Encounter\" Posted another letter. Had a bath today. Got reported for being insubordinate, \n\nThreatened with trans-shipment. Behave well in consequence. Received my commission (?) as scout,\n\nAnother sailor lumbered for smoking between decks. \"Constable\" Tonkin makes a daring arrest Culprit gets 10 days 2A (easy enough to get your classification aboard here.)\n","13":" Aug.Saturday\n\nStill in the same place. \"Sydney\" has drifted two feet closer to the \"Encounter\". Had usual wash. Another boat race.\"Aldenham\" called and took off mails. Brought many startling rumours. Firstly the Hampshire & Sussex Regiments were annihilated in Belgium. Secondly Samoa has fallen to New Zealanders. Thirdly & most important that the Germans have evacuated Wilhelms Haven & retreated somewhere or other. God bless them (and incidently the scouts also.)\n","14":"\n\nSunday today. Church parade. Chaplain from \"Encounter\" preaches & causes the organ player & several of the congregation to faint. Former reported to have died during the morning may be only another rumour.\n\nNothing to do after dinner, Many sleep or read or gamble or pretend they know all about the sea by sundry devices. Others make about with vaccinated arms. I joined those who slept (naturally) as I can always sleep since getting into tropical regions. Many suspect that I have caught the sleeping disease.\n","15":"\n\nStill in the same place. Our fleet has however increased. Th \"Aurange\" (?) arrived this morning from Sydney with stores & medals. We went ashore again for musketry & sat all day under a weeping forest. Returning we saw indications that the journey was to be resumed. Great joy on board.\n","16":"\n\nDespite above stated indications of a continuation of our voyage, we are still here. Early this morning the lighter \"Bobbie Towns\" came alongside with stores from Townsville. A party of \"H\" company (\"H\" every time) spent all the morning removing the dead. We stacked 70000 lbs of best Queensland beef in the refrigerator & received our rum allowance. \n\nThe lighter brought newspapers – the Townsville Daily & ;the Nth Queensland Register – aboard. Rags of the first water though they are they were more welcome than \"Truth\" on a wet Sunday. We may sail tonight. There is a prayer meeting in progress on deck to ask the almighty to instil into the Brigadier's heart the desire to advance.\n\nPosted two letters\n","17":"\n\nThe Almighty has answered our prayer. We move at 4 PM today. Early this morning the fleet was swollen by the arrival of the two submarines – one from the north & one from the south. During the night heavy firing was heard for a short time but it evidently was of no import otherwise our stay would have been prolonged.\n\n4 PM We moved out of Challenger Bay. It was a very imposing spectacle. The \"Sydney\" lead then followed the \"Encounter\" with AE1 on the port & AE2 on the starboard. The Berrima swung into line amid the cheers of the soldiers & marines on board. The \"Aurange\" brought up the rear. Our destination is still unknown. We have in all probability waited for the 2nd September as a day fitting for the sailing of such a formidable Armada.\n\n6.30 PM comes the ‘Berrima Daily Rumour.' It is well up to the standard. The chief facts contained therein are that a German naval code having been captured & brought aboard the \"Sydney\" enabled the latter vessel to intercept messages passing between\n\ntwo German vessels in the Pacific. Hence our delay for ten days in Challenger Bay. One of the messages was to the effect that the Australian Fleet is afraid to meet that of Germany. The challenge – if this is a fact – has been accepted, as shown by the presence of AE1 & AE2, which were meant to guard Port Jackson. It is further borne out by another rumour which states that the \"Australia\" & two French warships with the hospital ship \"Grantalla\" are to meet us tonight.\n","18":"\n\n8.20 Passed Green Hill Lighthouse off Cooktown. Very close to land & can see vast flocks of birds about water's edge.\n\n2 PM We passed out to sea through a break in the reef then – \n\noblivion\n","19":"\n\nStill more oblivion. Sea very heavy & witnessed interesting & novel sight of submarines in a storm.\n\n7 P.M. Oblivion passes as we enter Port Moresby past the three Torpedo Destroyers - Parramatta, Warrego & Yarra. Moonlight & the lights of the town & the piles of houses visible. \n\nCourt martial goes on below.\n\nFirst appearance of famous tin pot band.\n","20":"\n\nThe town at the entrance is a small straggling village perched on the side of one of the sandy, sparsely clad hills which encircle the bay. Down at the waters edge on poles rest the houses of the natives none of which as yet showed themselves. On going further into the port however they came out in outriggers - dug-outs formed double of the trunks of sago palms & propelled by long spear shaped oars & heart shaped sails. Each boat contained evidently a family pf Papuans, all with a vast mat of tousled hair wrought into all sorts of fantastic fashions by means of clay & combs formed of long shafts of bone.\n\nThe men are of medium eight & lithely build. The children are naked, somewhat resembling chocolate monkeys, & are expert divers. All are very sparsely clad. Some wear a shirt with a piece of coloured cloth worn after the style of the kilt. Others are naked but for a small loin cloth while others again wear the \n\nnative dress of cocoa nut fibre.\n\nAll the boats brought a cargo of cocoa nuts, pawpaws which they sold to us for a silver coin. If 1\/- was lowered down the side in a bucket, one nut was returned but if four 3d pieces were lowered four nuts were sent up. They all seemed perfectly willing to send up one of their family in place of a nut, so that any one on the look out for an adoption would not go far wrong in New Guinea. As is to be expected in such a climate the people are all rather lazy. The women do the hard work at rowing & reefing the sails, the head of the house filling the honourable position at the stern with the steering paddle. \n\nDuring the morning the Destroyer \"Yarra\" came alongside & took off some stores & late in afternoon the \"Parramatta\" drew alongside. The Queensland troopship \"Kanowna\" also took stores from us. She has 500 men on board 100 having been landed at Port Moresby. They have been out for a month & during that time have been having a rough time of it. They have had no other clothes but what they stand up in, & camp anywhere on the deck. Tonight their supper consisted of two potatoes & a piece of dry bread.\n\nWrote letters to E, Florence & Lucy & they were taken off during the night.\n","21":"\n\nBegan the day well with a skirmish with J.B. over some defects in the commissariat. The attacks were both frontal but before any decisive period was reached reinforcements arrived & both parties withdrew to the trenches.\n\nMany more outriggers came alongside. The natives are true socialists, passing their pipe round for the benefit of the whole crew. Bread given to them by the soldiers was equally divided among all the boats. They are also good business people & always get a good bargain when bartering.\n\nDuring the afternoon a party of native police came alongside. They were dressed in long dresses of blue with red facings, & all were in possession of a belt with shells, dagger, pouch & sword-bayonet. \n\nThey were a fine body of men.\n","22":"\n\n7 AM Landing party No 5 company Marines left for Fly River to guard wireless station\n\n7.45 We left port & by 8.30 were well outside the reef. During the morning we received a lecture on \"what to do in the tropics\" We are not to wash in the morning but at night, & then in hot water. Mosquito nets are to be supplied & camps burnt off to drive off the insects.\n\n12.30 do – more oblivion.\n\nDuring the morning the Queensland troopship \"Kanowna\" returned for some unaccountable reason to Townsville. Some say – probably the bloodthirsty element that her firemen struck. Li\t'ghts out.\n\nTuesday 8th September\n\nEarly this morning promoted for bad drill & insubordination to the kitchen & received the first meal since my departure from home. This is so auspicious event that the courses of the dinner might be worth noting.\n\n1 Meat Pie & vegetables.\n\n2 Rice pudding & prunes\n\n3 Tomatoes, carrots & turnips for dessert\n","23":" I remain there until the end of the voyage.\n","24":"\n\nDuring the night we ran into Rossel Island on the SE tip of New Guinea. At 10 oclock the :Australia\" (which has been due to meet us every hour since we departed from Sydney.) came in from the N.E. After tacking about the island all day we again set sail (NW by N) – a fleet of thirteen composed of the Battlecruiser \"Australia\", the cruisers \"Sydney\" \"Encounter, T.P. Ds ‘ \"Warrego\",\"Yarra\" & (God bless a civilised name) \"Parramatta\", Submarines AE1& AE2, Troopship \"Berrima\"(\nthird class cruiser\n) storeship \"Aorangi\", an oil vessel & two colliers. To see us manoeuvring about one would think that we were out to take Japan instead of New Pommern – our rumoured –destination.\n\nChucked out of the cooks galley for working too hard & was forced to return to the ranks.\n\nWe received some war news today. Not from the \"Berrima Daily Rumour\" but from H.M.A.S. \"Australia\". Among the items of interest were 200000 German casualties to date. Russians capture Lemberg. Germans draw in on Paris. Allies lines unbroken, British casualties 1500 Another defeat of German fleet. R.Harris has another bath. Many casualties\n","25":"\n\nDuring the morning the \"Sydney\" & the T.P.Ds left us & steamed for Raboul on New Pommern – the capital of German New Guinea – to demand its surrender – so the \"Rumour \" says. This time it may not be so far out as the same story was told us by the Major. Shortly afterward we passed the only point of interest seen during the day – a coral atoll. This was a very good specimen of \"this physiographical feature of the second order\". A ring of coral encircling calm pellucid seas & supporting with slight break at intervals a thick belt of tropical vegetation in which the coconut palm predominated. There appeared to be no inhabitants nor indeed any sign of life. With the breakers dashing on the fringe it presented a very beautiful spectacle - a veritable emerald set in a sparking sea.\n\nKit inspection during the morning. Second dose of quinine – \"Harris again\" many times during the parade. Had customary wash. Moustache struggles bravely on. We land to take Raboul tomorrow. Exciting details in the next issue.\n\nSince writing the foregoing startling news is to hand. The left half battalion is to attack Rabaul tomorrow, & we have to make our wills tonight. Prunes have been served out to raise the spirit of our men Excitement too intense to write more. \n\n(Please find copy of will in the back of this book)\n\nBluejackets landed at Rabaeaul.\n","26":"\n\nWhen we woke we were entering Herbertshöhe to starboard rose three volcanoes (two of which are at present in action) The \"town\" lay in vast plantations of cocoa nuts, in front of which lay our destroyers. The detachment of bluejackets have landed & three wounded & two German prisoners have been brought on board. Firing has been heard from the shore & our machine gun section has left to reinforce the bluejackets who are rumoured to be faring badly. We have been waiting all the morning to follow them.\n\nAfter being served with 200 pounds each we went ashore at 2.30 \"H\" company held the van – the scouts led. We left Herbertshohe at about 3 & held to the track leading to the wireless station. The way led through banana plantations & tropical forests.\n\nAt about 4.30 we were fired on by snipers but there were no casualties. We returned to camp at the settlement at about 9 – very tired & camped on the promenade.\n\nThe battle round the wireless still goes on. The navy men occupy the first line of trenches & our fleet are to shell the position tomorrow. We attack on the western flank & the right half on the east.\n\nDr (Captain) Prockley (?) who was wounded died today 2.20\n","27":"\n\nDuring the night skirmishing went on. The naval corps attacking the wireless station have driven the enemy off. \n\nThere were 12 casualties on our side (including 2 officers) The Germans lost several killed, about 20 white prisoners & 80 black prisoners. The remainer;’ retreated to Rabaul & brushed with our right flank. We rose at 3.30 AM & after lying all the morning in the dust, returned to the ship. The chief event of the morning was the \n\nlooting of two German commissariat stores. Many obtained sums of coin, shells, uniforms, belts, native curios, matches, lager, & many other articles too numerous to mention. \n\nThe share of \"H\" company was very small compared with the others as Major Martin rightly, was adverse to looting.\n\nThe inhabitants of the island who live in huts among the coconut plantations or in sheds close to the copra factories are darker & much smaller than those of New Guinea They doubtless work on the cocoanut & banana plantations & a system much akin to slavery appears to be in vogue. The natives appear to be very servile & straight laced, denoting by the way they greeted us that they had been oppressed by their former masters. One showed on his back raw brands.But the Union Jack now replaces the German Eagle at Herbertshohe, & will soon fly in Rabaul. It is surprising to see the number of natives who speak English. \n\nThe island as far as we saw it is surprisingly fertile. Coconuts grow with almost alarming profusion, while pineapples, bananas, paw paws & other native fruits are equally well represented.\n\nDuring the evening we descended to Rabaul. This is a very beautiful spot. The town which is larger than H. Is situated on flats along the shore on which grow tropical trees in which the cocoanuts predominate. The red roofs of villas & bungalows rising in them form a very pretty spectacle. For the background rises a volcano the top of which is brown & bare & the crater cut into a scalloped outline. Vegetation grows to about half way up the cone. \n\nThe natives came out to the water's edge in large numbers to witness our approach. Many German residents also came out in white ducks. The police were the first to land & were followed at dusk by the right half company, who are to occupy the outskirts of the town.\n\nAt 8 P.M a guard from the \"Warrego\" brought 22 native prisoners aboard with 7 German officers.\n\nWrote letters to E, Mother & Con.\n","28":"\n\nThe \"zone of constant precipitation\" of Telly. It rains here one minute & shines the next, and boils the whole time. The niggers thrive on the unhealthy flats, while we are again penned or up on board on guard.\n\nA few extra details of the fight at Herbertshohe are at hand. 25 Bluejackets held the trenches for four hours & just as the Germans were closing in on them Commander Beresford arrived & the enemy gave way. Young Moffat who was killed was shot in the stomach by a bullet which passed through the wrist of Jock Harris one of his mates.\n\nWe are reported to have had a very narrow squeak on Thursday night when returning to camp. We passed through large numbers of the enemy lying on either side of the road. How it is we were not wiped out is not understood (\nLATRINE WIRE\n)\n\nThe \"Grantala\" which has been due to arrive every day since our departure from home arrived today.\n\nThe Destroyer Parramatta brought in a recruiting vessel with a good number of prisoners (Madang)\n\nAt 2.45 we went ashore to Rabaul with the left half & a company of marines. We marched to the government house to the \"Australia\" band & formed a square on the parade, for the first time in the history of the world Australia announced a colony. It was a most imposing Langtree at Rabaul. \"Look up men you own this damn place now.\"\n\nspectacle. The proclamation was read & the British flag broken to the cheers of the soldiers & the strains of \"God save the King\" On arriving back at the ship we received instructions to reinforce the troops at Herbertshohe & proceeded there by means of the \"Encounter\"\n","29":"\n\nWe marched at 5 oclock, \"H\" Company again filling the position of advance guard. At 6.30 the warships commenced to shell the German positions. It was very invigorating to hear the shells scream & roar over head. The niggers who had been commandeered to drag the artillery (1 six pounder) thought that their end was come. The advance was slow proceeded through cocoanut & banana plantations. At intervals along the route natives were collected from their huts Many were fine well built men some short & fat some long & skinny, many scab marked & not a few suffering from skin diseases. During conversations with them they told us that the Germans treated them badly, forcing them to work for very small wages – 3d a day was considered a magnificent sum – beating them much & branding them with an arrow head.\n\nAbout five miles out the plantations gave way to virgin forest & here, for fear of ambush the progress was slower. During the afternoon\n\nrain fell heavily & was still beating down when the advance descended the German position on the brow of a hill at Tomo. The \"artillery\" was rushed into position – a very bad one it was - & the troops entrenching themselves on the road the \"battle\" began. \n\nAmong the roar & rush of the guns & the hurtling shells - & incidentally the row caused by a few hungry privates devouring paw-paws – it is hard to see full details. Then I saw however the stampede of the niggers at the first shot of the six pounder & the falling of a limb at the discharge of the second. Then the battle was over & we began to march back. Twelve miles to go tired out. No food wet to the skin & disappointed almost (?) to swearing we started out, had not gone far when a white flag was seen in the rear.\"The Governor has surrendered!\" was the first news.\n\nIt was false but it served to brighten the soldiers up. Two long marches under hellish (in the true sense) conditions had lowered their spirits. & it was marvellous to see the way they livened up at this report. But it goes without saying that it was the representative of the \"Daily Rumour\" who spread it. The real reason for the flag of truce was that the governor asked a cessation of hostilities until 11 oclock\n\nof the 15th to hold a conference to come to some understanding. Absolutely tired out we reached Herberthohe at about 9 o'clock & lay down to sleep. The night was cool, but the wet clothes made it perishing & we lay out without blankets in the main \"street.\"\n","30":"\n\n\"H\" again. We were selected as a guard of honour for the German Governor. He arrived with the officers early this morning & the conference took place. It ended at two o'clock – we do not yet know the decision. If he refused to surrender either he or us are in for a hot time.\n\nDuring the morning the French Cruiser \"Montcalm\" entered the Haven\n\nThe outcome of the interview was that the Germans have till 11 o'clock on 17th to bring in their troops.\n","31":" Had rifle inspection & bathing parades. Emulated monkeys by climbing the palms in search of cocoanuts (in millions) & despite orders to the contrary, devoured huge quantities of that fruit.\n\nWent on guard over champagne stores.\n","32":"\n\nGovernor came in and surrendered & a party of \"H\" 60 men selected from :H\" Company started for Toma to bring in a portable wireless plant. The rest of us remained behind & ate more cocoanuts.\n","33":"\n\nAte more cocoanuts\n","34":"\n\nAll other companies went aboard, & after doing a good amount of fatigue we started at 4 oclock for Toma & put up a record marching arriving at 7. Here we were met by two German officers who treated us with great courtesy & put us up for the night in a bush house. Here we tasted the first beer which arrived per medium of the owner of the plantation who brought half a dozen bottles of lager\n","35":"\n\nAll day we lay under the shadow of the bamboos to await the arrival of the rest of the column. During the morning two despatch riders came up & reported that the rest of \"H\" were labouring under heavy conditions, some twenty miles further on & would not arrive at Herb. Until tomorrow night. They reported that our prisoners were in large numbers & that they also had partaken of the hospitality of the German officers. During the morning we had an opportunity of witnessing some of\n\nthe native troops drill. It opened our eyes. They are like machines & the manner in which they carried out the movements reflects great credit on the German officers and the intelligence of the natives. The snap of their movements & the rapidity with which they spring to any order, their bearing & their true soldier like appearance, all co-operate in putting even \"H\" to shame as regards drill. But, of course, when it comes to cold steel we can put it all over them, as shown by the fact that when the bluejackets fixed bayonets at 600 yards, during the battle at the wireless stn. The road to Rabaul was soon marked by a flying \n\nNEWS BULLETIN\n\nVia Wireless per Thursday Island\n \n28th.Oct.1914\n\nViolent battle still proceeding in North France and West Belgium,at present \t'undecided.\n\nThe Allies are generally holding their ground, but the enemy have crossed the River Yser\n\nGermans reported to have sustained enormous losses here.\n\nRussians reported doing well and have crossed the Vistula, but there is little news from this quarter. First Wireless received at Madang\n\n(first half of page covered over)\n\nsoon marked by a flying cloud. They are fine muscular upstanding men, reaching about 5-10 in in height.\n\nThose which we saw this morning were clad in navy loin cloths held in position by a \"Gott mit uns,\" on which hung two bullet pouches & a saw-bayonet. How our troops envied their light equipment! All were armed with Mauser rifle & for headgear wore a grey-green slouch hat, with the turned up side held in place with the German tricolour.\n\nAt 5 oclock we returned again to camp at Herbertshohe.\n\nT Winter, Rabaul \n","36":"\n\nWe were given the most honourable position as guard of honor to the German prisoners (damn them too!)\n\nAt nine oclock they marched in. First came the 30 German prisoners & these after a lot of useless ceremony piled their arms. They all wore kharki uniforms with cartridge belts , & slouch hats. After these came about 200 native troops all with their bundles thrown over their backs.\n\nThese marched away and we took charge of the Germans conveying them aboard the \"Madangi\" (the captured recruiter) On the way we had conversation with\n\nthem. They had been rather surprised, they said, that Australia should become their captor as they were unaware that we had a fleet or army. We arrived on the Berrima at about 3 oclock & I received a letter from E. with another note enclosed. We received news of the sinking of AE2 by a German gunboat but this seems to be highly improbable. We are to sail for Wilhelmshafen in the morning & the collier is now alongside.\n\nThe rest of \"H\" are to be left behind in Rabaul as they cannot reach here in time to sail with us. According to despatch riders they have had a rough time on their seventy mile march. The roads were in an awful condition & the return with 60 bullock wagons (4 miles in length) with the German accoutrements is of necessity slow, tedious. It is also rumoured (with a fair amount of truth) that the \"color\" has struck a snag in the junior subaltern. There are several men ready for him when he & our remnant meet.\n","37":"\n\nEarly this morning a captured Krupp (14 pounder) was brought on board. At 9 AM we started for Wilhelmshafen & by midday were out of the harbour leaving the rest of \"H\" (or perhaps us) to their fate.\n\nSecond pay since enlistment. Men passed time playing banker.\n\nI might mention that our escort was the \"Australia\" \"Montcalm\" & Encounter.\n","38":"\n\nUsual routine made banker.\n","39":"\n\nBegan the morning with another skirmish over the ownership of a hat. Early we ran into Wilhlemshafen. The town which is very similar to Herbertshohe is built scattered through the cocoanut plantations on the edge of the haven the waters of which wind in through the cultivated areas & through thick virgin scrubs & mangrove swamps. The German eagle still flaunted his wings over the forests but before much time had elapsed the British Lion had displaced him.\n\nAt about 10 oclock the half company of No.2, half of \"H\" & E coys landed opposite the New Guinea Coys warehouses We began the garrison work well \n\nby lumbering 6 weeks rations to the storehouse. We received quarters in one of the New Guinea Storehouses with the Starvation Six in the right hand corner among the copra bags (&incidently copra bugs)\n\nThe niggers are much similar to those of New Britain – some dimunitive & weedy & others tall and well built. They are all very strong but nevertheless slow & work to a monotonous roar and screech. They all make use of the lime on their hair which turns it a dirty yellow.\n","40":"\n\nWent on oupost duty on the east of the town & learnt some Kanaka from a nigger. Had only one alarm. Camped all night under the cocoanut palms near a water hole, what with thoughts of being borrowed by an alligator or being blotted out by a falling cocoanut, the effects of an aching tooth, things were most comfortable.\n\nA scare was caused in the town by German residents signalling to their friends outside. During the day about 100 niggers marched in and lay down their arms & were put in the local booby hatch.\n","41":"\n\nNothing of importance happens. The inhabitants \n\nhave been executing several suspicious movements, & nothing has yet been heard from the ex-citizens.\n\nDuring the night the black prisoners rushed the guard & got out of the gaol. They went at the picket armed with all sorts of outlandish weapons but were driven back one being captured, together with all their kits.\n","42":"\n\nOn guard all day no excitement.\n","43":"\n\nLoafed all day\n","44":"\n\nCeremonial parade in the afternoon. About 30 native police who had been captured were taken into our service.\n\nMenu slightly strengthened by the introduction of fish & lime juice.\n","45":"\n\nOne of the \"Starvation Six\" caught a fish.\n\nIn the afternoon we hoisted the wireless pole & dug trenches.\n","46":"\n\nMore fatigue! Went with a boat party to gather wood in the jungle. The ants crawled over us & bit large junks of beef off our backs. The sun rendered down all the fat they left & turned it into perspiration which the mosquitoes, revelling in the glorious aroma of the mangrove swamps lapped with ferocious avidity. Needless to say I took immense pleasure in watching Pte O'Brien wielding his axe on the trunk of a huge teak; or ex-constable Sullivan\n\nfloundering with huge armfulls of drift to where the boat was moored, while I took the opportunity of observing the configuration of New Guinea or inquiring to a greater extent into the mysteries of the Fundamental Geographical Process.\n\nLikewise I volunteered to sit on the load going home while the others rowed like maniacs to get to the barracks by dinner time. Never was the old saw \"No rest for the wicked\" better illustrated. We turned our hands to sanitary engineers, copra makers, tram troubs , wireless operators, water carriers besides many other occupations too numerous to mention before we could on the sound of the retreat seek solace in our hammocks.\n","47":"\n\nTime passes very slowly at garrison work We eat bully beef & biscuit or quinine & lime juice: we sit and argue or pray for a German gun boat; occasionally have a game of cards or give Kiki to niggers. A few try to relieve\n\nthe monotony by burglarious actions such as breaking into houses & escaping with fabulous sums of gold; some overstep discipline by wandering through the lines in search of something edible. I am not so wild, so have to pass my time braving the dangers from \"sassams\" & \"pook – pooks & in the waters of the haven\n\nAll is very dry just about the camp, Grass has dried off, & water is very hard to obtain even in the mangrove swamps vegetation is drying off The cocoanut plantations stretch for miles. Then comes the rubber. On that, swamps malaria mosquitoes alligators & cannibals - 20 miles to cannibals.\n\nThe houses of the town are all built on steel frames of wood. They rest on piles about five feet high & consist of a couple of well ventilated rooms with a wide verandah running all round. They have no chimneys. What need of a chimney in a climate which would bring perspiration out of a stone?\n\nThe niggers are lazy but bring us in all sorts \n\nof curios which they exchange for biscuits of which they are very fond. Tonight they danced their \"Ki-Ki\" dance – the proper cannibal dance. It was most interesting to watch their graceful turnings as, standing two & two they sang their monotonous wailing dirge, which doubtless has often terrorised the agonised soul of some intended victim of a cannibal feast.\n\nThe \"Starvation Six\" was not very long lived. The three police have left us so that we only have Wakley Moon & myself left. So \"The Terrible Three\". I forgot to mention that I have been raised to the responsible not to mention honourable (if not carrying more pay) position of Lance Corporal. Any person reading this will do well to remember this fact as it may explain the reason for my having less work to do in the future.\n\nSo far the Swimming Club & Hockey Club have started Fine damn thing. A Hockey Club on active service. May the German gunboat arrive just as they are about to begin their first match \n","48":"\n\nI had fully made up my mind to grumble about the tucker today. Since we left the Berrima we have been living fairly well but one gets tired of the best. Today we got fish – tons of the best by way of change beside this our new cook – Steer – after expending much ingenuity pinching spuds & onions & much money buying what he could not pinch, made us some fine stews. The last dish he served up to us was the cause of a very gruesome struggle between him & J.B. the cook's mate, the latter faring rather badly. Two of \"E\" Company were courtmartialled for breaking into German's house. They were sentenced to 21 days solitary confinement, & 21 days in chains in a public place.\n\nNo more fighting has as yet taken place.\n","49":"\n\nChurch parade.,\n\nSaw some real savages. Dark & ferocious. Hair worn in high arching fringe & trimmed with strings of rat's teeth & shells. The broad flat nose rendered more picturesque by a long shaft of sharpened bone thrust through it.\n","50":"\n\nEight Hour Day quite a decent little procession through the streets of W. With the usual luck hanging in my wake I was on picket duty & had to be satisfied with seeing the last half of the pageant. Skits, equalling anything done up by the students, took off the non-coms and the officers & the A.M.C.\n\nWhat we left our Happy Home for, by some of the navy men, consisted of a cross draped with bully beef & biscuits; Satan frightened hell out of the niggers with his fiery pitchfork & skull; Chidley was there also; Skits on the rum; on the jam, were of the highest order & most laughable. One would have thought that that, we were back in the ‘old dart’ again.\n","51":" \n\nWent for a march into the \"big bush\" It was 115° on the march to Soma, & I estimated is at about 315° today. The country is very level, covered with the cocoanut & ruber plantations of the New Guinea Company. The rubber tree is very much like the\n\nMoreton Bay fig & like many tropical trees sends down numerous roots from the branches which in turn send out other roots the whole thus forming such an intricate framework that it is difficult ot detect the original stem.\n\nThe Gutta –percha tree bears no resemblance to its cousin. It is white like the white gum, has few branches which support a few leaves like those of the Elm (but longer) & red berries or flowers. It does not send down roots from its branches. \n\nThe company have also large herds of China Buffalo which beside being bred for beef are used to draw the trucks of cocoanuts. They also possess many pigs which roam at will & usually frighten the pickets by their sudden appearance at night. The herds are tended by Malays & Javanese.\n\nWe halted by the sea coast for a meal. Although the coast is low, there are no beaches & the coral reefs make them very treacherous.\n\nAmong other things we saw many beautiful butterflies. White with black blotches, black with\n\nyellow fringes ; coal black; azure with velvet black fringings.\n\nI obtained a good specimen of the latter & its coloring was the richest I have ever seen\n\nArriving home we received a horrible shock - scones for tea.(P.S. I am not able to write more)\n","52":"\n\nLate last night we received the news that a German gunboat was outside, & that we were to man the trenches early this morning Accordingly we were ready at 4 AM & number two sections \"A\": Company, marched to the trenches commanding the entrance of the harbour.\n\nWe lay there all the morning but the boat instead of coming in disappeared. The Germans evidently knew of her presence for in the night they stirred the natives up to resist us They were however detected trying to escape to the bush\n\n& detained the two Germans who had incited them to resist were captured & are to be paraded dialy in chains before the natives. Most of us here are not sorry as we have about had a \"belly-full\" of Germans. They are treated better than us, & can throw muck at us as they like.\n\nToday the only two women of this city left us & it is possible that the gunboat may return.\n\nThe afternoon passed very enjoyably – more fatigues as usual. The doctor is working us like maniacs & in clearing the town, The niggers have been cleaning \n\naway tip heaps, cutting grass & burning off for the last week or so. Wilhelmshafen was never so clean before. It has fallen our lot to drain a deep hollow in which water must have lain for months after the wet season and bred all sorts\n\nof tropical horrors & golliwogs. The trench will be about ten feet deep when finished & is being cut through fossel coral as hard as iron. A whole gang of us worked with picks & shovels in a temperature with which hell cannot compare, and succeeded in putting it down another inch or so. You may guess how we worked when I broke the handle of a pick. Nuf sed!\n","53":"\n\nStay-at-home soldiers do not know the joys of garrison lifes in the tropics. How glorious it is to be rooted out before the sun has made any impression on the gloom beneath the cocoanut palms & hurried off with picks & barrows to cut a seven foot trench out of solid limestone.The thud thud of the picks the splash of the falling perspiration & the grumbling of the inner man are sounds to make one's heart leap with very joy. Then when the daily ration of bully biscuit has been washed down by the \n\nso called beverage of coffee. We are at it again. Five feet down with the sun blazing on the back of your neck at about double its ordinary temperature of 100° & the perspiration blinding one we again set to work on two hours of rockchopping. The niggers passing imagine we are a new breed of Chinese. They never saw a German work in their lives & here we are showing them a fine example by toiling like fiends in a true hell. And yet we are daily asked to show the natives of our superiority over the Germans.\n","54":"\n\nOn guard at 2 M.S. Store. Passed a rather enjoyable time, but as usual increased my vocabulary somewhat.\n","55":"\n\nOrderly corporal for day. We were given the afternoon off & numerous parties were arranged to make excursions to the \"big bush\". Our application was refused – of course. But we did not mean to stop in barracks so, pinching a boat three of us rowed over to the other side & plunging into the thick jungle searched for pigs. Their snouts\n\nwere to be seen everwhere through the cane & grass brakes & under the matted scrubs of pawpaw trees.\n\nThe forest is, despite the fact that no rain has fallen for four months, on every side impregnable. The taller trees such as figs, & banyans, readfruit, cocoanut besides hundreds of others without name, & matted together by lawyer canes & numerous other vines all joining to make an impenetrable labrynth. We saw one pig but did not get a shot at it & eventually retuned at five to barracks. Of course we had shot a pig – a monster with wild eyes and curling tusks which charged us through the scrub & fell dead a few feet off us with two bullets buried in his brain.\n","56":"\n\nDetermined to have another day \"longa big bus: & in order that our souls would be in order in case \"longa bus' Kanaka\" killed us, we went to mass & pinching our boat set out after the pigs. The forest was much sweeter after the storm but pigs were scarce & after wandering for some hours we returned home with a bag of pawpaws & bananas.\n","57":"\n\nWe went for a march to the same place as we went a week ago, so that there is nothing fresh to add.\n\nTonight there was some excitement. An alligator was sighted by \"E\" comp at supper time, out in mid-harbour, & some extremely fine (?) shooting resulted. The fun reached its climax when Frenouth, Reynolds & O'Brien pinched a boat & rowed out to the monster amid the plaudits of the \"swattues\" on the wharf But the \"gator'''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''\" refused to move & the hunters returned saying sweet things. A few dozen more of the same breed were to be seen floating round the wharf\n\nThe excitement was not all over yet. One of the Noncoms reported a couple of men for have £500 in hiding. Fred & Ron subsequently fell in for having loot in their possession. The barracks wen wild with excitement & during the night Scotty nearly murdered the non-com, was removed to \"calabash\"\n","58":"\n\nScotty got 7 days hard for the assault & the guards got 7 days on outpost.\n\nConcert at night.\n","59":"\n\nMarched out early in the morning & had a sham fight (on active service remember)\n\n\"H\" fairly cut \"E\" to pieces. After partaking of a hasty lunch we again set out over a new route in search (so I believe) of a pole for a new wireless station. I hope they found a suitable one as we went far enough. It poured like real cats & dogs again at night and\n","60":"\n\nWe accordingly went on guard at the 2 M.S. Store. No excitement during the day as usual Jackson went to the hospital with fever. At night time passed very enjoyably watch the Germans signalling to each other by way of a little sweet pastime at midnight\n","61":"\n\nMarched out again early in the morning I & two others pushed a cart ahead of us. The object of the trip was we ultimately found out, to cut down a tree for a wireless pole, as the one we have is useless. We located a beauty & after putting ropes all over it and cutting it down it fell across a log & broke in two. Another was found & cut down. We spent all the afternoon dragging it into position & then marched home.\n","62":"\n\nOn guard again. Poor old Wakley was carried to the hospital with an unknown complaint. Personally I think he has pneumonia as he is subject to it & as Watson has also had it\n","63":"\n\nHad the day off & went for a boating expedition with some mates & succeeded in capturing a good number of fine bananas. Coming home we passed many coral reefs & saw some extremely beautiful sea bottoms. \n\nArrived home we had tea & being tired were just about to roll in when my name was called by Lieu. Chambers. Another robbery! But it was not. We received order to report with full equipment & ammunition at headquarters at eight o'clock – twelve of us. We were there on the stroke & led Major Martin & the doctor. We rowed in a boat for a few miles up the coast pulling into a creek our guide – Weir - tried to make a landing but failed for some time owing to dead trees lining the banks. At last one was effected & - ye gods! – Bugler Moore & I were left to guard our boat. The language used by us was enough to have lit up the Egyptian darkness, but it failed & our comrades blundered on through\n\nthe scrub bound for the mission station on the fringe of never – never to get hold of an arsenal or something else. We continued to swear for an hour or so & then as cannibals began to nose round we pulled out into the middle of the water & anchored. The cannibals yelled & the mosquitoes chewed big pieces out of out bodies & treatened to sink the boat & the mud hummed worse than a bone dust shop. We watched nearly all the night & towards morning fell asleep for about half an hour.\n","64":"\n\nWe woke at daybreak & pulling in to the shore landed. The \"cannibals\" had gone & in their place stood a peaceful looking mob of niggers with a glass of tea for each of us, a dish of fried bananas & a bunch of others. We breakfasted & then went to see our benefactor – a one-eyed Malay who braving the danger of the wilds had cleared a good patch of the forest & grown cocoanuts, bananas & vegetables. He treated us well & gave us breakfast & helped us to bail out our boat\n\nAbout 11 o'clock the rest returned after accomplishing nothng but catch a pig with the cas-cas & we returned tired out with a very tall tale of cannibals & cannons & precipices & impregnable swamps & bush.\n","65":"\n\nWent for wood into the bush.\n","66":"\n\nGuard 2 M.S.\n","67":" \n\nWent and helped to put up the new wireless pole. After much tugging & swearing the first section was raised & by 5 P.M. the second in position for hauling.\n","68":"\n\nTried to haul up the rest of the pole & succeeded in getting half up by 5 P.M.\n","69":"\n\nSpent morning at usual pastime & the afternoon went with Hynes & Drummond for coral. We found a patch which looked beautiful from the boat but on diving for it it was not very good so we returned. Received first war news.\n","70":"\n\nIn the afternoon we secured a native canoe, and after much manoeuvring (greatly to the merriment of the niggers) we succeeded in taking it up the harbour.. We were about to land when we were overhauled by three Chinese in an outrigger who hailing us told us in quite unconcerned tones that there were two \"pook-pooks\" on the shore. We could not realise \n\nthe fact until, with a laugh one of the party shouted \"Kai-Kai man\". We nearly sunk the boat in our excitement especially when looking in the direction of their out stretched hands we saw stretched on a small clearing by the water's edge , two of the vicious looking brutes we had\n\nsearched for, for so long. We could not run the canoe ashore quickly enough, & as I was the only one with a rifle (of course!) I sneaked along the bank in the direction of the sleeping monsters. But they were not as dead to the world as they looked, & aroused by the crackling of the vines (for it is impossible to walk in New Guinea without getting tangled in creepers) they became aware of my approach, so that I arrived just to see them dive into the water. As they were I fired, & the bullet struck one like a miniature bomb striking a brick wall. But he continued his dive, & disappointed, I returned to my comrades. Thus my first alligator has escaped. \n\nBut we did not return empty handed. Going through the bush some time later I succeeded in bringing down a suckling pig, which was carried in triumph back to camp & duly roasted & devoured\n","71":"\n\nHoisted up the wireless pole. \n","72":"\n\nWent on outpost at the cross roads for a week with Cpl Clancy, Wakley, Hynes, Drummond, Tonkin & Steer (\"Dags\" for short) The post is in a very beautiful spot where the road runs through a narrow fringe of cocoanut palms lying between a belt of massed swamp undergrowth & the waters of the haven. On the other side are the many tinted stretches of the virgin forest & arising into the mysterious clouds which ever hang their poisonous folds about them, are the blue coast ranges – the \"on top\" of the long shore Kanaka.\n\nThe spot though beautiful could by no means be called healthy for the waters of the swamp teem with mosquitoes which nightly ( & daily) terrorise the inmates\n\nof the camp. We are \"well in\" with the Malays & during conversation with one with a surprising amount of intelligence he asked us out to his place at Alexishafen, to shoot the coomool & mooroe.\n\nThere are large numbers of Malays here (large that is in proportion to the white population) They have ever treated us well & seem far in advance of the Chinese although the latter have their brother celestials in Australia far behind\n\nIn the morning we were recalled to camp for purposes of identifycation. Ye Gods for identycation! We were lined up & a gin who had been insulted stood grimacing on the steps before us. It reminded me of a Zulu witch smelling out a warrior for the sacrifice. Added to the humility of being \"smelt out\" a German (I will not say what) stood hounding the diseased looking female on to her work. But we passed through & returned to the outpost.\n","73":"\n\nContinued with oupost duty, & during the morning went down to the company's Farm where we had rather an exciting morning helping the Malays to lassoo\n\nsome of their stock. \n\nThe Company possesses a large herd of Chinese cattle which, tended by Malays, rove through the plantation & supply milk & beef to the people of the island. Received more war news.\n","74":"\n\nWent to the hospital in the morning. The place is now usually packed with patients in door & out, clamouring for admission. Some have the fever but the majority come to have their leg bandaged, for any small wound even a puncture caused by a mosquito fester & spreads often taking poison & causing great irritation. The usual treatment at the hospital is to paint the wound with iodine of which they seem to have an unlimited supply on hand.\n\nThe definition of one of the heads of our army :- One half officers & non coms, & the other made up of prisoners , spies and hospital patients is fairly correct.\n\nIn the evening we had an exciting pig chase but although we had three shots we did not get anyway near them\n","75":"\n\nWent out on Friday afternoon and succeeded in shooting a pig. Tonkin and myself skinned it while the rest went on a wild goose chase after revolvers.\n","76":"\n\nThird payment. Devoured pig. Late in the afternoon the road was blocked by niggers hurrying out of Madang on their way to a \"sing,sing\".They were painted & adorned with flowers & new lap laps, & carried newly made & painted spears. All were highly excited.\n\nHad some beer.\n","77":"\n\nAll Saints Day\n\nWe were seated at the breakfast table enjoying some of Ted Frazer's cooking & my pig, when sweeter than the Zephyr of Gül upon the morning air came a sound which for so long had been absent from the plantations of Madang – the siren of a steamer. Did we go mad? Not half. The old boat so long absent from our shores had come at last bringing the long looked for letters, I got 18 from Mother, Lucy\n\nRuth, Ernie Flo D.J.F.,A Schue.,E & Alf.\n\nDuring the afternoon some of the men off the \"Matanga\" came out to the oupost & photgraphed us for the Sydney \"Mail\"\n\nThe boat landed stores for two months. It brought news chief and of most interest was that Color sergeant L had been arrested in Rabaul on nine charges & had been sent to Sydney with a \"month\" in view.\n","78":" of Nov\n\nThe \"Matanga\" sailed at three oclock. Shot another pig. This was a fine bit of excitement We wandered along a narrow pig track into a scrub such as we had never seen before It was impossible to see a foot off the track. The luxuriance of the vegetation ,& its rare beauty could be equalled in no other part of the world with the African & Amazonian jungles taken into account. Although the place fairly stank of pig we could not see any coming out into the clearing. we ran into a number, however which took to their heels on out appearance. Hynes\n\nfired at one of the fugitives with his revolver & struck it in the shoulder. The pig ran faster. I then fired with my rifle & despite the fact that I was lucky enough to hit it on the foreleg & smash it ran still harder. Hynes fired again but missed & just as it was nearing shelter & safety I fired again and shot it through the back. It dropped dead just at the door of its impregnable home. This is my third pig – a record for the camp.\n","79":"\n\nMost of the men left the barracks to bring in a wireless pole. At two o'clock two parties left here, - one (so I believe) to raise the British flag at Petershafen & the other as a punitive expedition to Alexishafen. Only two men were taken out of \"H\" & of course I was not one of these. We nevertheless had a little excitement tonight for the timber getters not returning by eight oclock, a search party was sent out to find them. Pulling up the harbour we were\n\njust imagining finding the bloody & mutilated corpses of our comrades lying in the jungle when the \"Ranur\" was seen approaching with the men aboard.\n","80":"\n\nWe earned another bar today. We were all standing on the wharf watching the effect of a cigarette dosed with cordite upon a native policeman when the Lieu came rushing like a whirlwind to tell us to stand to arms Not since the arrival of a mail the thought of the \"Scharnhorst\" have been upper most in our heads & the thought of a scrap with a few hundred German marines quite thrilled our by now sluggish blood. We lay outside in the trenches till seven in the morning. All, we saw were the same old palm trees raising their heads into the moonlight like so many German Eagles. The warships were there all right, but learning doubtless that \"H\" Company garrisoned Madang they turned tail at daybreak\n","81":"\n\nA patrol left to scour the coast but returned after a short time\n","82":"\n\nA day of excitement. We had just finished breakfast at about 8.45 when suddenly the floor began to heave & the building to sway. Most of those both inside & outside were rather dumbfounded, as thoughts of the \"Scharnhorst\" were still rampant many thought that a shell had landed in the vicinity. But as soon as the word \"earthquake\" was uttered a rush was made to escape from the building which still swayed heavily.\n\nOutside, some of the native crouched uttering the word \"bouria\" in awed tones. In the store the floor flowed with champagne & beer & was strewn with broken glass. The Germans & natives had sought refuge in the open streets. Shortly afterwards came other shocks more or less severe & just as they ceased about 11 oclock we were beginning to enjoy the sensation. Had the buildings of the town been of brick, much devastation would have \n\ntasken place. But as they are built on steel frames which are put together to allow for such shocks (which are somewhat pentiful here) there was little damage done in comparison with the severity of the shocks..The Germans expected another & more severe sock at night. One came but not very severe one. Late at night Captn Morrison's party returned from there expedition southwards.\n","83":" \n\nSearch party (Composed of Native Police) left in search of \"Lili\" which should have returned.\n\n \n\nIn the afternoon we were issued with new uniforms\n\nThey looked rather like this, but were most acceptable up here when comfits are few.\n\nDuring the night we gave a fine fireworks display.\n\nThe \"Lili\" returned with a new boat. They had some excitement with the cannibals.\n","84":"\n\nCaught the fever & it lasted until","85":" when I came out of hospital\n","86":"\n\nConvalescent. Got paid. One of our police boys was killed by the cannibals & eaten a few miles out in the bush.\n","87":"\n\nSpent two hours at drill in the boiling sun\n","88":"\n\nWent for a route march to the Gom River. The heat was terrible & as I was just recovered from the fever did not do too well. However I succeeded in continuing & we had a swim in fresh water on our arrival. After dinner two of us went down to the ocean beach two miles away had a very acceptable surf . Coming back we thought we would take a short cut with the result that after blundering through the scrub for a few hundred yards we found ourselves bushed. We wandered – if it is possible in such bush – for an hour & completely\n\nexhausted we at last wandered out on to the sea where we found the way back to the company. Things, there were in a state of alarm. The bugle had been blowing for some time & about 50 shots had been fired for our recall. We were in a rather weary state by the time we reached camp at five oclock.\n","89":"\n\nThis day we left Madang it was a very enjoyable sight for many to see the old barracks, the store with its bad debt & incidentally the Kalabush fade from view as we turned south to Erima. Personally I did not take pleasure in it for having suffered with intermittent fever since Christmas eve, & camped as we were on the hatches, it was not too pleasant.\n\nThe trip to Rabaul where we arrived on the","90":" was calm but the fever was bad & at times I was \n\ndelirious. None of the medical staff did anything to relieve us. Arrived at Rabaul we were pitched on board\n\n"}}