{"Document Name":{"0":"Diary_0268","1":"Diary_0268","2":"Diary_0268","3":"Diary_0268","4":"Diary_0268","5":"Diary_0268","6":"Diary_0268","7":"Diary_0268","8":"Diary_0268","9":"Diary_0268","10":"Diary_0268","11":"Diary_0268","12":"Diary_0268","13":"Diary_0268","14":"Diary_0268","15":"Diary_0268","16":"Diary_0268","17":"Diary_0268","18":"Diary_0268","19":"Diary_0268","20":"Diary_0268","21":"Diary_0268","22":"Diary_0268","23":"Diary_0268","24":"Diary_0268","25":"Diary_0268","26":"Diary_0268","27":"Diary_0268","28":"Diary_0268","29":"Diary_0268","30":"Diary_0268","31":"Diary_0268","32":"Diary_0268","33":"Diary_0268","34":"Diary_0268","35":"Diary_0268","36":"Diary_0268","37":"Diary_0268","38":"Diary_0268","39":"Diary_0268","40":"Diary_0268","41":"Diary_0268","42":"Diary_0268","43":"Diary_0268","44":"Diary_0268","45":"Diary_0268","46":"Diary_0268","47":"Diary_0268","48":"Diary_0268","49":"Diary_0268","50":"Diary_0268","51":"Diary_0268","52":"Diary_0268","53":"Diary_0268","54":"Diary_0268","55":"Diary_0268","56":"Diary_0268","57":"Diary_0268","58":"Diary_0268","59":"Diary_0268","60":"Diary_0268","61":"Diary_0268","62":"Diary_0268","63":"Diary_0268","64":"Diary_0268","65":"Diary_0268","66":"Diary_0268","67":"Diary_0268","68":"Diary_0268","69":"Diary_0268","70":"Diary_0268","71":"Diary_0268","72":"Diary_0268","73":"Diary_0268","74":"Diary_0268","75":"Diary_0268","76":"Diary_0268","77":"Diary_0268","78":"Diary_0268","79":"Diary_0268","80":"Diary_0268","81":"Diary_0268","82":"Diary_0268","83":"Diary_0268","84":"Diary_0268","85":"Diary_0268","86":"Diary_0268","87":"Diary_0268","88":"Diary_0268","89":"Diary_0268","90":"Diary_0268","91":"Diary_0268","92":"Diary_0268","93":"Diary_0268","94":"Diary_0268","95":"Diary_0268","96":"Diary_0268","97":"Diary_0268","98":"Diary_0268","99":"Diary_0268","100":"Diary_0268","101":"Diary_0268","102":"Diary_0268","103":"Diary_0268","104":"Diary_0268","105":"Diary_0268","106":"Diary_0268","107":"Diary_0268","108":"Diary_0268","109":"Diary_0268","110":"Diary_0268","111":"Diary_0268","112":"Diary_0268","113":"Diary_0268","114":"Diary_0268","115":"Diary_0268","116":"Diary_0268","117":"Diary_0268","118":"Diary_0268","119":"Diary_0268","120":"Diary_0268","121":"Diary_0268","122":"Diary_0268","123":"Diary_0268","124":"Diary_0268","125":"Diary_0268"},"Date":{"0":"unknown","1":1024.0,"2":1031.0,"3":1036.0,"4":1037.0,"5":1038.0,"6":1039.0,"7":1040.0,"8":1041.0,"9":1042.0,"10":1043.0,"11":1044.0,"12":1045.0,"13":1046.0,"14":1047.0,"15":1048.0,"16":1049.0,"17":1050.0,"18":1051.0,"19":1052.0,"20":1053.0,"21":1054.0,"22":1055.0,"23":1056.0,"24":1057.0,"25":1058.0,"26":1059.0,"27":1060.0,"28":1061.0,"29":1062.0,"30":1063.0,"31":1064.0,"32":1065.0,"33":1066.0,"34":1067.0,"35":1068.0,"36":1069.0,"37":1070.0,"38":1071.0,"39":1072.0,"40":1073.0,"41":1074.0,"42":1075.0,"43":1076.0,"44":1077.0,"45":1078.0,"46":1079.0,"47":1083.0,"48":1085.0,"49":1088.0,"50":1089.0,"51":1090.0,"52":1091.0,"53":1092.0,"54":1093.0,"55":1094.0,"56":1095.0,"57":1096.0,"58":1097.0,"59":1098.0,"60":1099.0,"61":1100.0,"62":1101.0,"63":1104.0,"64":1105.0,"65":1106.0,"66":1107.0,"67":1108.0,"68":1109.0,"69":1110.0,"70":1111.0,"71":1112.0,"72":1113.0,"73":1114.0,"74":1115.0,"75":1116.0,"76":1117.0,"77":1118.0,"78":1123.0,"79":1124.0,"80":1125.0,"81":1132.0,"82":1133.0,"83":1135.0,"84":1138.0,"85":1139.0,"86":1140.0,"87":1141.0,"88":1142.0,"89":1143.0,"90":1144.0,"91":1145.0,"92":1147.0,"93":1148.0,"94":1149.0,"95":1154.0,"96":1155.0,"97":1156.0,"98":1157.0,"99":1159.0,"100":1160.0,"101":1161.0,"102":1162.0,"103":1170.0,"104":1171.0,"105":1172.0,"106":1173.0,"107":1174.0,"108":1178.0,"109":1179.0,"110":1181.0,"111":1182.0,"112":1184.0,"113":1185.0,"114":1186.0,"115":1187.0,"116":1188.0,"117":1189.0,"118":1190.0,"119":1191.0,"120":1192.0,"121":1193.0,"122":1194.0,"123":1195.0,"124":1196.0,"125":1197.0},"Entry":{"0":"\n\n1916\n\n","1":" I have now been away one year & six months of which has been in France We are still at a Dr.S near Poperinghe, Belgium, after coming back from our first part in the Offensive 1916.\n","2":" The weather here is now very changeable & every day is windy with an overcast sky. However the days are not cold and we have had very little wet weather. The trees are gradually losing their leaves and some changing in colour to real autumn tints. All the crops have been gathered, the wheat stacked, hops bagged & the flax stripped. In fact the country is much the same as when we saw it first. To-day I visited the local aerodrome & had a good look at the planes & had their business explained fully. We are moving within a few days ostensibly to St Omer but after that our destination is obscure.\n","3":" Move this afternoon to Steenvoorde a town within French Border about 8 miles from Poperinghe\n","4":" Leave Steenvoorde at 11a.m. and travelled about twelve miles north of St. Omer. En route we skirted Mont Cassel from which a view of 400 towns & villages is to be had. Also the coasts of England can be seen on clear days. The country is beautiful the hop fields giving way to pastures & beautiful trees The town of Cassel is a fashionable health resort.\n\nThe more I see of France the more I am enraptured with it. Berries now galore, blackberries, Strawberries, Raspberries Currants Red white & black.\n","5":" Continue our march at 11.15 a.m. on a beautiful day. Stop for dinner 1 mile from \nWaton\n (Watten) on River Aa a manufacturing town.\n\nArrive at La Ralousse, (Noordasque) on St Omer to Calais road about 25 kilos from Calais at 6 pm approx 12 Kilos to St Omer.\n","6":" At Nordasques P.d.C. 20 miles from Calais. Visit Ardres 18 from Calais. Record my 1st vote- on conscription-. Main Calais road very fine great trees flanking it Many fine large houses stand back.\n","7":" Still at Nordasques. Visit adjoining village of Tournehem through which runs a light railway. Calais to Bolougne via St Omer. Have very decent meal at Cafe Soupe Varlet. Village very quaint water mills being largely in use.\n","8":" At Nordasques (La recousse) but expect to leave tomorrow afternoon. This afternoon a party went to Calais & stayed the night undestected.\n\nOct","9":" to St. Omer entrain at night. Town darkened so we had no opportunity of seeing the place\n","10":" In the Somme dept once more. Journeyed via Calais, Bolougne & Abbeville to Longpre which is about midway between Amiens & Abbeville on Southern bank of River. March to Bouchon on Northern side of river. Visit L'Etoile & factory where bags for the trenches are made Factory on river bank Somme. Transferred again to 4th Army.\n","11":" Still at Bouchon. Visit L'Etoile again. This morning our transport left it is rumoured that we go on to-morrow per motor wagons\n","12":" Vauchelle March about five miles where hundreds (5) of French motor wagons were waiting to transport our division to the front. We travelled through Flexicourt & Amiens & left the wagons at Ribemont 9 kilos from Albert. From these we had another night mare march to Fricourt where we camp for the night\n","13":" This morning we continued our march through mud slush & rain & took about four hours to make three miles so congested was the traffic Our route lay on Fricourt-Bazentin Road, past Mametz & Montaubon & finally we were landed in Mametz wood at almost dark to look for dugouts for ourselves. Luckily we found a decent one, only a few drops. \n","14":" Bivouaced in Mametz wood. Today has been a repetition of yesterday in as much as it has drizzled all day & made the ground more muddy than previously. I hear that things are awful up in the line & it is impossible to get wounded through & I can easily credit it.\n","15":" Still in Mametz Wood. Early this morning a violent bombardment commenced and has been going on all day. Eric Hurt tells me that the Australians have to take a hill overlooking Baupaume & failing that we will have to return to a more advantageous position He says that it is impossible to get wounded through. Observation is impossible as the clouds are so low. This is the first bit of real rough living we have experienced in France and we are living in dugouts which are of a doubtful dryness. I have had wet feet now for about four days but manage to dry clothes at night by a fire\n","16":" Still in Mametz Wood & the weather though temporarily brightening still continues wet & dull. A mail came in & cheered things up. This afternoon I had a look at a German howitzer with its elaborate writings etc.\n","17":" Still in Mametz Wood in bad weather wind & rain. In fact the whole crowd is as miserable as the weather. I had a look at some of our guns to-day. 6\", 9.2\" etc & they are formidable in looks & numbers. Mail.\n","18":" As yesterday, no change in weather which is impeding operations\n","19":" Still in Mametz Wood in continuous rain. A couple had a look over the Tanks yesterday & also a couple of Russian Guns dated 1882 & captured from them by the Germans\n","20":" Move to-day to Longueval, passing High Wood, Delville Wood & the two Bazentins. We are about three miles west of Combles & near Trones Wood. As usual the day is sometimes dull & at others sunny, & the place is still a sea of mud. We are still a good way behind the line about four miles, the nearest point is somewhat beyond Flers. Our position is a good deal to the right & of course more advanced than before.\n","21":" Move up to the 2nd Bgde Aid Post, about four miles. On the way we passed a few stranded tanks. On arriving we had to pull the dugout down & re-erect it. The shelling is consistent but mostly on a wood & village a few hundred yards behind us. One shell burst in our sunken road five yards from the group of us but nothing else resulted except in mud & a shaking up. The country is very muddy & I anticipate a rough time when we get a case- none of which have come in yet. The trenches are thigh high in mud & the men are suffering terribly from trench feet. We have still undisturbed control of the air\n","22":" Early this morning at 12.30 we had a case & had to carry it through mud slush rain etc.\n\nAbsolutely a nightmare of a carry with everyone slipping & cursing & the patient groaning with pain. Without exageration the mud is over my leggings. This afternoon is fine & enemy aeroplanes are very active. Another carry at 7 pm. to night.\n","23":" Move back to Longueval for a rest & find the only accommodation taken & we are left in the mud. From the ridge behind Flers a good view of Baupume & the road to Peronne is to be had. Also the villages of Les Boeufs, Gaudecourt & another. Our position was just behind Gaudecourt. Weather showery. Examined a tank this morning.\n","24":" At Longueval on fatigue work at A.D.S.\n\nNov 5th. At Longueval. This morning 1st & 3rd Batts attacked the German positions The latter were successful but the","25":" had to retire with heavy loss. Details are lacking. Arthur Fleming was killed collecting & on the road, about 50 yards away a shell burst in a lorry & unfortunately North was amongst the killed, Briggs, Tweddel (?) & Wetzel were wounded, the second very badly.\n","26":" Still raining. This afternoon we among others were sent up the line on fatigue carrying timber & iron. The work had to be done at night with the result when the material was deposited at its destination we were mud from head to foot. The whole thing was a great example of gros incompetence which is rife among N.C.Os & officers generally.\n","27":" Still raining more mud & slush While on duty last night I saw a most wonderful allumination of the whole western sky accompanied by great clouds of smoke & low explosions. At the same time search lights were searching the sky. Aeroplanes were heard & bombs were dropped at many places. It is said that a big ammunition etc. dump was bombed by Zeppelins.\n","28":" Still raining but fine this afternoon.\n","29":" At the line again to the left of our late position. A few hundred yards past Flers & within easy distance.\n","30":" Beautifully fine day but place is still muddy. Shelling is not severe & very few casualties have arrived. A German aeroplane brought down in flames a few hundred yards away. Living comparatively well. Nights are now drawing in & it is dark from 5 to 6. Baupaume is distinctly visible & seems only a couple of miles away.\n","31":" Still good weather. Shelling not too severe though Fritz livened up this afternoon & night. A raid by a party of bombers failed & everyone of the party were wounded or killed. We had a trip to between trenches for a patient.\n\nNov 12th Last night was very busy & we had three stiff carries a piece. Shelling more severe than usual. The part we went to between lines was just in front of Guedocourt wood where there is a dug out in our occupation. Jack Tweddel has died of his wounds. Baupume up to this morning has not been bombarded but now the tower is missing & the bombardment of the place has commenced.\n\nNov 13th. Move back with the division to Longueval again Relieved by the 4th Division. The illumination mentioned on the 6th inst was caused by a successfull raid by German planes on a French munition dump. Damage £1,000,000. Percy James has been mentioned for work done in the stunt a few nights ago & Blondon & the W.O. have been decorated by M.M.","32":" for ?) Heavy shelling last night. Coming out this morning I noticed some men getting \"tanks\" ship shape, oiling, etc. so this with the fine weather lately seems to portend another big move.\n","33":" Awoke this morning to hear all the batteries in the dist in action. The heaviest bombardment I have heard since Pozieres. It transpires that the German line was taken in places and the ridge (commanding Baupume) & three villages have been taken & are holding. Prisoners are coming in. Our plat. was shelled as usual to-day & three men killed.\n","34":" Move this afternoon to Becordal partly along the Albert-Peronne road.\n","35":" Move along and then do Abert-Amiens road about three miles to our camp where we meet our new O.C. Colonel Williams\n","36":" Visit the adjacent village Buire sur l'Ancre. A most destitute hole. Weather very cold & the water even in the tanks has frozen & that in the gutters remains so all day Trees on the road have lost all their leaves. The sunshine is very weak.\n","37":" Weather colder than yesterday Visit Amiens tomorrow\n","38":" Visit Amiens on the Somme but the day has not been the best since it snowed last night. Dined at L'Hotel de L'Universe & in several had a good time. The distance is 25 kilo's & we did in in motor lorries\n","39":" At Buire still. Weather warmer\n","40":" As yesterday\n","41":" Bearers move to M.D.S. at Becordal to do local bearing& fatigues- Mud etc.\n","42":" Mud & cold bleak weather\n","43":" Fine weather for a change.\n","44":" News of loss of Brittannie. Feeling not too well.\n","45":" Admitted to hospital with bronchitis & laryngytis.\n","46":" In hospital at Becordal\n","47":" do do\n","48":" Discharged from hospital however not properly cured of laryngitis. Weather still cold, foggy etc.\n","49":" Move from Becordal to Longueval again. Things have improved out of sight & we are living in huts & the day is fine & sunny.\n","50":" Move up to the line & take up position at East Flers. The conditions are improved beyond recognition & we are living in comparative comfort. The railway runs up to Flers & the ground is all well\n\ntrenched & there are many new large dugouts built for the accommodation of many men. Everything points to winter quarters being taken up.\n","51":" Move to North Flers. Here also conditions are being improved & tunnelling being pushed on with. Shelling was very severe here this evening but two men killed & one wounded was the extent of his damage.\n","52":" Move back to East Flers again. Very little to do as there are practically no wounded. Weather dull & visibility very low. Baupume tower has fallen but the chimney stack is still in tact.\n","53":" Very quiet to-day. No shells from Fritz at all. Very foggy.\n","54":" Still quiet & dull.\n","55":" Still dull & things are very quiet. No wounded last night.\n","56":" Again the 1st is unlucky At Bulls Trench a shell burst on the D.S. door & wounded our officer Capt Hughes (new to the unit) & one of C. Section bearers. The doc is likely to die of his wounds. At Longueval. Barr was wounded while driving & had his horse killed. The day has been fine & Fritzs shooting very effective as a result. He tore our trainline up at two places but it has since been repaired.\n","57":" Very cold last night & this morning the ground is covered with snow a heavy fall.\n\nDec 13th Still dull. Last night the 5th Batt took German strong point without any opposition. The same as from which the 1st was repulsed on","58":" A good number of wounded came in. Capt Hughes has died of his wounds.\n","59":" Move back to A.D.S. at Longueval through Delville Wood\n","60":" Fatigue work at A.D.S. where mud is worse than at the line.\n","61":" Still at A.D.S. Weather still dull Snowing again.\n","62":" Still dull. Last night Fritz shelled our locality very consistently. Also at East Flers our relief had the cook house blown in with one fatality.\n","63":" Lately weather has been cold & snowing but to-day is fine and Fritz is making good use of the clearness. He has been shelling all round here with a big high velocity low trajectory gun & has done no little damage. However he keeps away from the hospital. Aerail activity is pronounced. Have just been down to the siding & have seen the damage The railway has been torn up & several huts blown sky high Twelve killed & several wounded.\n","64":" Shortest day & raining. Walk to Meaulte & have a bath, first for a month.\n","65":" ","66":" } Dull & quiet. Very windy \n","67":" Two Germans came through this morning. A party was attacked by the Australians & half killed & remainder made prisoners Heavy bombardment.\n","68":" Wet sloppy & foggy & plenty of work & yet people wish you a Merry Xmas.\n","69":" ","70":" ","71":" ","72":" } do\n","73":"","74":"","75":" } Still raining off & on & dull. Plenty of work. Our work lately has been the evacuation of wounded etc. to Quarry by means of a light railway.\n\n1917\n","76":" Dull & raining and in no wise different from other days.\n","77":" Move back to Buire. Saw George yesterday & he is OK. Warned to-day for leave on","78":" inst.\n","79":" Still at Buire. Lately it has been nice and fine to-day Fritz has been shelling the ridge above the village, further back than I have ever seen him before. Last night at the Dandies at Merricourt\n","80":" At Buire weather cold and windy with rain. Visit Merricourt again last night Lately the bombardments north of Thiepval have been very severe & rumours of an advance & prisoners are many. Rumour has it that Baupume has fallen but it lacks confirmation.\n","81":" This morning the ground etc were covered to four inches with snow and we had much enjoyment from snowballing Also had a hare hunt over the hill behind the camp and had best bit of sport I have had for months. Caught one hare.\n","82":" Snow beginning to thaw and making things sloppy. Another hare hunt with one catch.\n","83":" Snow still on the ground & weather cold but no happenings. We move in a day or so to another sector of this front.\n","84":" Still bitterly cold though fine Move from Buire to Albert where we billeted in the school. We are moving up to the line about Martenpeich & forming an A.D.S. at Bazentin le petit.\n","85":" At Albert. Still very cold & fine Move up to-morrow. Fritz has been shelling Albert to-day but I have heard of no casualties Go on leave on 29th so can't see much use of going up the line at all. \n\n Jan","86":" from Albert to Bazentin A.D.S. & thence to the line to the left of Flers. We went through Contalmaison & past old Casualty Corner, but the place is not recognisable, compared with July 23rd. Things are quiet here but the Division comes in tomorrow. The snow is still covering the ground and has no frozen & is hard & slippy walking.\n","87":" Snow still on the ground which is very hard & good for shell bursting. Move back to Edwards post in anticipation of going on leave. Everything is quiet & very few men come through Days are very clear & frosty.\n","88":" . As yesterday. On ration fatigue to Bazentin. Rumoured that leave has been stopped on acount of traffic congestion.\n","89":" Came back to A.D.S. at Bazentin in anticipation of going on leave but find it postponed owing to the railway congestion The British are taking over the line to Peronne now & so causing congestion. \n","90":" At Bazentin awaiting leave but still no news of its re opening\n","91":" 30,","92":"","93":" 2nd Still waiting. Weather perfect but cold with clear sunny days & moonlight nights.\n","94":" Tonight I visited Pozieres & had a look over old ground. A battery of 9.2's is where Jack 's grave is & things are as safe as houses.\n","95":" Weather still very cold and frosty. Papers say that it is the coldest winter for a generation. Fritz shelled about ¼ mile from H.D. S to day.\n","96":" Leave passes arrive I move to J.H.Q. where I find out that Leave has been stopped again\n","97":" Last night the 4th &","98":" Battalions had a raid which was an utter failure. Our casualties out of 100 men were 50 wounded and 25 or about killed and missing. Our H.D.S. is most inconvenient and our colonel most incapable. He got most flustered and in no way can compare with our ex colonel.\n","99":" Went for a walk to Edwards Post to show Perkins round. A stunt is expected in a few days & he is in charge of reserve squads. Came home through High Wood where there are many monuments to the","100":" Division which took place in most of the fighting there. There are 5 or 6 stranded tanks there & they are being cleaned in anticipation of being used again.\n","101":" Tonight we were warned that an aeroplane raid was to be attempted by Fritz on Rail heads.\n","102":" This morning I was awakend by bursting bombs & anti aircraft shells Fritz caught a big ammunition dump this morning & caused great explosions to happen all day. The damage must have been great.\n","103":" Everything lately has been quiet on the front & the casualties have been slight. The good weather has gone now & it is now muddy again. Considering the late frosty weather the weather now is warm \n","104":" Last night the long expected attack by the","105":" eventuated and wild rumours are current. The objective was gained without personel opposition and it is mooted that Fritz has detered on a good long front. Many casualties are coming through as a result of machine gun fire & shelling.\n","106":" The boys are still going and doing well but suffering a fair number of casualties. Duncan Robertson was wounded in the shoulder last night I have been ill again for the last two nights and so have not been able to go up, genuinely to my disappointment.\n","107":" The papers now confirm the above & report an advance of 2 miles on an Eleven mile front. Le Barque, Varlancourt & Liquy Thilloy fell to Australians who hold from Guidecourt to Le Sars Casualties have slackened off now Eighteen hundred yards from Baupaume.\n","108":" The Colonel went up to the line this morning & was with Shergold wounded severely in the chest. It is touch & go for his life. Reg's leg was broken Nothing fresh about the advance.\n","109":" News of the death of the Colonel. March winds in full swing.\n","110":" Move to Fricourt Farm as an advance party. The Doc. says I have trench fever & has put me on quinine daily\n","111":" Balance of unit move back to the Farm bearers excepted who have been up in the line since","112":"\n","113":" Usual March winds with snowstorms. At 4 pm. Sgt Wooster asked me if I would go on leave this evening Result I am in Amiens awaiting the 12.16 am to Bolougne. Leave is special two to a division daily.\n","114":" Arrive at Bolougne this morning and at 10.30 was on the \"Onward\" making for Folkestone. Escort by three destroyers. Arrive at Folkestone & entrain in comparatively luxurious carriages for London which I reach about 3 pm. The day is miserable & it is snowing Up to date I have only made a few purchases of necessaries\n","115":" Foggy first experience of travelling by tube & bus Visit Houses of Parliament, Abbey, Cleo's Needle & \"Theodore & Co\" at Gaiety.\n","116":" Morning Service at St Pauls Visit Richmond in afternoon Afternoon tea at Cottage Tea Rooms. Wet.\n","117":" Visit Tower & Tower Bridge Courts of Law (Chief Justices) Hyde Park & the Row High Jinks.\n","118":" Hampton Court & Palace (Magnificent) & Richmond \"Vanity Fair\"\n","119":" Hyde Park and Rotten row. \"High Jinks\" in the evening\n","120":" Pall Mall, Buckingham Palace. \"Chin Chin Chow\"\n","121":" Visit Brighton and have a good time. Wide streets and fine houses & hotels. \"Bric a brac\" in the evening Fine run of 1 hr 40 mtes through Sussex. Fine day.\n","122":" Shopping in morning & Richmond in afternoon Fine view from Richmond Hill. Beautiful day.\n","123":" Hyde Park Buckingham Palace & Rotten Row & Richmond in afternoon Glorious on River in evening\n","124":" Leave for Folkestone by Pullman (Dining) & after a rough crossing get back to France again. Rest Billet for night at Bolougne.\n","125":" At Bolougne in rest billet.\n\n"}}