{"Document Name":{"0":"Diary_0070","1":"Diary_0070","2":"Diary_0070","3":"Diary_0070","4":"Diary_0070","5":"Diary_0070","6":"Diary_0070","7":"Diary_0070","8":"Diary_0070","9":"Diary_0070","10":"Diary_0070","11":"Diary_0070","12":"Diary_0070","13":"Diary_0070","14":"Diary_0070","15":"Diary_0070","16":"Diary_0070","17":"Diary_0070","18":"Diary_0070","19":"Diary_0070","20":"Diary_0070","21":"Diary_0070","22":"Diary_0070","23":"Diary_0070","24":"Diary_0070","25":"Diary_0070","26":"Diary_0070","27":"Diary_0070","28":"Diary_0070","29":"Diary_0070","30":"Diary_0070","31":"Diary_0070","32":"Diary_0070","33":"Diary_0070","34":"Diary_0070","35":"Diary_0070","36":"Diary_0070","37":"Diary_0070","38":"Diary_0070","39":"Diary_0070","40":"Diary_0070","41":"Diary_0070","42":"Diary_0070","43":"Diary_0070","44":"Diary_0070","45":"Diary_0070","46":"Diary_0070","47":"Diary_0070","48":"Diary_0070","49":"Diary_0070","50":"Diary_0070","51":"Diary_0070","52":"Diary_0070","53":"Diary_0070","54":"Diary_0070","55":"Diary_0070","56":"Diary_0070","57":"Diary_0070","58":"Diary_0070","59":"Diary_0070","60":"Diary_0070","61":"Diary_0070","62":"Diary_0070","63":"Diary_0070","64":"Diary_0070","65":"Diary_0070","66":"Diary_0070","67":"Diary_0070","68":"Diary_0070","69":"Diary_0070","70":"Diary_0070","71":"Diary_0070","72":"Diary_0070","73":"Diary_0070","74":"Diary_0070","75":"Diary_0070","76":"Diary_0070","77":"Diary_0070","78":"Diary_0070","79":"Diary_0070","80":"Diary_0070","81":"Diary_0070","82":"Diary_0070","83":"Diary_0070","84":"Diary_0070","85":"Diary_0070","86":"Diary_0070","87":"Diary_0070","88":"Diary_0070","89":"Diary_0070","90":"Diary_0070","91":"Diary_0070","92":"Diary_0070","93":"Diary_0070","94":"Diary_0070","95":"Diary_0070","96":"Diary_0070","97":"Diary_0070","98":"Diary_0070","99":"Diary_0070","100":"Diary_0070","101":"Diary_0070","102":"Diary_0070","103":"Diary_0070","104":"Diary_0070","105":"Diary_0070","106":"Diary_0070","107":"Diary_0070","108":"Diary_0070","109":"Diary_0070","110":"Diary_0070","111":"Diary_0070","112":"Diary_0070","113":"Diary_0070","114":"Diary_0070","115":"Diary_0070","116":"Diary_0070","117":"Diary_0070","118":"Diary_0070","119":"Diary_0070","120":"Diary_0070","121":"Diary_0070","122":"Diary_0070","123":"Diary_0070","124":"Diary_0070","125":"Diary_0070","126":"Diary_0070","127":"Diary_0070","128":"Diary_0070","129":"Diary_0070","130":"Diary_0070","131":"Diary_0070","132":"Diary_0070","133":"Diary_0070","134":"Diary_0070","135":"Diary_0070","136":"Diary_0070","137":"Diary_0070","138":"Diary_0070","139":"Diary_0070","140":"Diary_0070","141":"Diary_0070","142":"Diary_0070","143":"Diary_0070","144":"Diary_0070","145":"Diary_0070","146":"Diary_0070","147":"Diary_0070","148":"Diary_0070","149":"Diary_0070","150":"Diary_0070","151":"Diary_0070","152":"Diary_0070","153":"Diary_0070","154":"Diary_0070","155":"Diary_0070","156":"Diary_0070","157":"Diary_0070","158":"Diary_0070","159":"Diary_0070","160":"Diary_0070","161":"Diary_0070","162":"Diary_0070","163":"Diary_0070","164":"Diary_0070","165":"Diary_0070","166":"Diary_0070","167":"Diary_0070","168":"Diary_0070","169":"Diary_0070","170":"Diary_0070","171":"Diary_0070","172":"Diary_0070","173":"Diary_0070","174":"Diary_0070","175":"Diary_0070","176":"Diary_0070","177":"Diary_0070","178":"Diary_0070","179":"Diary_0070","180":"Diary_0070","181":"Diary_0070","182":"Diary_0070","183":"Diary_0070"},"Date":{"0":"unknown","1":1490.0,"2":1491.0,"3":1492.0,"4":1493.0,"5":1494.0,"6":1495.0,"7":1497.0,"8":1498.0,"9":1499.0,"10":1500.0,"11":1503.0,"12":1504.0,"13":1505.0,"14":1506.0,"15":1507.0,"16":1508.0,"17":1509.0,"18":1511.0,"19":1512.0,"20":1513.0,"21":1514.0,"22":1515.0,"23":1516.0,"24":1519.0,"25":1520.0,"26":1521.0,"27":1524.0,"28":1525.0,"29":1526.0,"30":1527.0,"31":1528.0,"32":1529.0,"33":1531.0,"34":1532.0,"35":1533.0,"36":1534.0,"37":1535.0,"38":1536.0,"39":1537.0,"40":1538.0,"41":1540.0,"42":1541.0,"43":1542.0,"44":1543.0,"45":1544.0,"46":1546.0,"47":1550.0,"48":1551.0,"49":1552.0,"50":1553.0,"51":1554.0,"52":1555.0,"53":1556.0,"54":1557.0,"55":1558.0,"56":1559.0,"57":1560.0,"58":1561.0,"59":1562.0,"60":1563.0,"61":1564.0,"62":1565.0,"63":1566.0,"64":1567.0,"65":1568.0,"66":1569.0,"67":1570.0,"68":1571.0,"69":1572.0,"70":1573.0,"71":1574.0,"72":1575.0,"73":1576.0,"74":1577.0,"75":1578.0,"76":1579.0,"77":1580.0,"78":1581.0,"79":1582.0,"80":1583.0,"81":1585.0,"82":1586.0,"83":1587.0,"84":1588.0,"85":1589.0,"86":1590.0,"87":1591.0,"88":1592.0,"89":1593.0,"90":1594.0,"91":1596.0,"92":1597.0,"93":1598.0,"94":1599.0,"95":1600.0,"96":1601.0,"97":1602.0,"98":1603.0,"99":1605.0,"100":1606.0,"101":1607.0,"102":1608.0,"103":1609.0,"104":1610.0,"105":1612.0,"106":1613.0,"107":1614.0,"108":1615.0,"109":1618.0,"110":1620.0,"111":1621.0,"112":1622.0,"113":1625.0,"114":1626.0,"115":1627.0,"116":1628.0,"117":1630.0,"118":1635.0,"119":1636.0,"120":1637.0,"121":1642.0,"122":1643.0,"123":1645.0,"124":1646.0,"125":1647.0,"126":1648.0,"127":1649.0,"128":1650.0,"129":1651.0,"130":1656.0,"131":1657.0,"132":1663.0,"133":1664.0,"134":1665.0,"135":1666.0,"136":1669.0,"137":1670.0,"138":1675.0,"139":1676.0,"140":1677.0,"141":1678.0,"142":1682.0,"143":1683.0,"144":1684.0,"145":1687.0,"146":1690.0,"147":1691.0,"148":1697.0,"149":1701.0,"150":1702.0,"151":1703.0,"152":1704.0,"153":1712.0,"154":1713.0,"155":1714.0,"156":1717.0,"157":1720.0,"158":1722.0,"159":1726.0,"160":1727.0,"161":1728.0,"162":1729.0,"163":1730.0,"164":1731.0,"165":1734.0,"166":1736.0,"167":1737.0,"168":1747.0,"169":1749.0,"170":1750.0,"171":1752.0,"172":1753.0,"173":1754.0,"174":1755.0,"175":1761.0,"176":1762.0,"177":1764.0,"178":1778.0,"179":1812.0,"180":1825.0,"181":1829.0,"182":1842.0,"183":1843.0},"Entry":{"0":"\n\n","1":"\nAbbassiaCairo\n\nIve changed from hospital duds into Khurki once again. This afternoon I spent interviewing hospital officials. First theG.O. then the L.M. then pack store &last of all the linnen store to hand in the hospital clothes.\n\nIts a crook job for at each place one has to wait a good while.\n\nThe tucker has improved here since they got rid of the gippoes. Its the best food Ive had as a soldier. I will go round & see some of the boys now & leave my last years diary with young Warren to take home.\n\n\n\n\n","2":"\nPort Said\n\nI said goodbye to Cairo once again & though its not a bad old place in some ways I was not sorry to leave it. I am set now in the Rest camp here. I think it will be fairly quiet but one thing one has plenty freedom.\n","3":"\nPort Said\n\nIve put in a very quiet day. This morning I met Stevenson of the trainway who is Sgt in the remounts& Haslem also of the trainway & in the same unit. We had a walk round town this afternoon, theres not much to see.\n\nWe met at the Red Cross tent for a cup of tea & a bun & butter & yarned until lights out. I went up town then on my pat as I didnt feel sleepy, but bed is'nt a bad place after all especially as its a cold windy night. The breakers are roaring on the beach & make a chap feel shivery at the thoughtof them.\n","4":"\nPort Said.\n\nIts a motley mob that one sees here in Port Said Soldiers & sailors of all nationalities & all grades and conditions. The civil population are the same, a motley lot. The city is dark and dismal at night; all lights being masked as a precaution against air raids. One gets all sorts of change here. Its Englishmoney principally but all sorts of other coinage comes to light, even Chinese.\n","5":"\nPort Said\n\nOld Stevo is a queer oldsort. I went to the Pictureswith him & GeorgeHaslem this evening between each picture spasm he would entertain us with some caustic criticisms on the picture. Without doubt the show was crook, gave one the sort of feeling that one experiences while waiting for next go at the dentists.\n","6":"\nPort Said\n\nI've been doing some shopping today. I bought a watch for a quid which is a sourceof joy to me since each time I look at it I find it still going. A mirror was my greatest trouble I visited every shop in Port Said before I got what I wanted, indeed there was one shop I was in three times. After all, one shop is very much like another, but what a world of sarcasm was in the shopmans answer to my request on my third visit, No only those Ive shown you twice today However I am set now. They are a slow business mob anyway. Last night I proposed to George that we should dine up town tonight. He said that he thought one might as well shy cash in the gutter so I did not press the invitation. Ive dined on my pat.\n\n\n","7":"\nPort Said\n\nA moter launch took a party of us accross to the Armenian Reffugee camp during the afternoon, it was a nice outing. When we were coming back we ran along side a transport of Australians bound for France & were just tossing the usual \"How de doos\" to them when two loud explosions occurred on a ship about 500 yds distant. We higgeryed accross to the boat which was in flames & already surrounded by small craft of every discription picking up any of the crew who had jumped over-board. It was a wonderful sight at night. I went up after the concert at the Y.M. There was another big explosion on her at 10.30\n","8":"\nPort Said\n\nThe street was full of people last night veiwing the burning ship & there was a lot of excitement when the last explosion occurred, it broke most of the windows in the main part of the town & there were several narrow escapes but I think no one was hurt.\n\nThere was a children's concert at the Wesleyan Institute this evening. It was a real treat to see the dainty little folk & they capturedthe hearts of the boys, especially one wee chap who though his chubby legs wobbled as he toddled around went through a minuet with his pretty wee partner with a solemn face & the resolution of a man.\n","9":"\nPort Said\n\nI was very much afraid that I was going to be conscripted this morning but my name was not called so I'll probably have another weeks loafing. This afternoon I went out with a party on the moter launch, fishing. No one \ncaught\nhooked any fish though the chances are that several good fat colds were caught for it has been a very chilly day & was extremely fresh out there on the water.\n","10":"\n\n","11":" Wednesday1918\nPort Said\n\nThere was a queer sort of entertainment at the Y.M. tonight. All sorts of competitions. Bun eating,stump speeches etc. Stevo got going in a stump speech on \"Sweet hearts & Courting\" he got the prize too a tobacco pouch,he was some pleased.\n","12":"\nPort Said\n\nIt was a beautiful day & this afternoon I strolled out along the breakwater its a good long walk & I was surprisedto see the number of people out. The sun brought them I expect. I went to hear the kiddies at the Y.M. concert at night.\n","13":"\nPort Said\n\nI was just speaking to one of the sailors off the Aragon which was torpedoed in the Med. a week or so back. There were over 2000 on board & the submarine not only sunk the ship but the Destroyer that came to the assistance of the ship. The survivors have been knocking about Port Said & the Y.M. hasstruckthem for tucker.\n","14":"\nPort Said\n\nWent to a concert at the Y.M. at night. The Peerless boys of Kantara weregiving the show& a rattling good show it was. Stevo was highly dilighted with them & told the Y.M. bloke that the Port Said coy which gave a concert at the Eldorado the previous night were in comparison absolute rotters; which sameI thought a bit hot considering the \"bloke\" belonged to P. Said.\n","15":"\nMoascar\n\nI said a sad fare well to the rest camp this morning & 3 o'clock saw me at Moasca, a cheerless hole it is. It reeks with Guards Drill & Red tape.\n","16":"\nMoasca\n\nI thought to have a lie in this morning but the S.Maj came along rousing & dug me out while it was still dark. Later I had to attend M.O. inspection & there was innoculated in both arms, & sent to the Dentist to have my teeth examined. I got 48 hrs no duty on the strength of the innoculation however so thats not so rough.\n","17":"\nMoasca\n\nIve got my gear together again. Rifle, etc. can't say that I felt pleased to get the gear again. To night had a walk round Ismailia with Jim Draper. Its rather a contrast to Port Said. There is much more light & the streets are all lined with trees. Its a dead shop though.\n","18":"\nMoasca\n\nBilly Cruinewent to Port Said this morning, he worked hard for the trip. Had a letter from his girl in Cairo saying that she was going to the Said for a week on Tuesday so Billy went sick right away. He put in two anxious days but was happy & bright this morning & so am I for I have his bunk its a mile ahead of dossing on the floor. I struck a fatigue at Camp HQts to day, it did me instead of drill\n","19":"\nMoasca\n\nThis morning they took us all for a route march When we got out about two miles we took to the old desert & we did a bit of skirmishing. It was pretty deadly & I was glad when we got back again. To night I went on the L.M. guard, a12 hr affair.\n","20":"\nMoasca\n\nWe had to drop tents this morning & clean up generally. This afternoon I went up to the Remounts & saw Stevo, they are up to their eyes in work up there. I had a look at a footer match later between the Remounts & 2nd training Regt it was a crook match\n","21":"\nMoasca\n\nI spent the after noon in Ismailia. Saw Jimmy Kinkade going along the street with a sister each side of him. he was kept busy chucking salutes to the mob who were going along on either side of him Dont think he'd have much time to get in any fine work until he got to a quieter part of the town.\n","22":"\n\nI took Steven up to see Steve at the Remounts to night. both were highly & delighted to meet. Steve has got a hutch of rabbits next his tent. Dont know what an Australian wants to do any thing with rabbits.\n","23":"Tuesday\nMoasca\n\nI was warned for guardearly this morning & had to Kiwi up at the higgery. its some stunt shaving this weather. The chaps who are on are only kids & don't take things very seriously.\n","24":"\nMoasca\n\nHarold floated in from the Regiment this afternoon he says that they are doing more drill than we are here at present That does not sound very enticing. They are camped at present about 8 miles from Jaffa.\n","25":"\nMoasca\n\nI've been out to the range these last couple of mornings; so that finishes me with preliminarymusketry for the time. There is a fight over at the picture show to night. Some of us went over, but the place was crowded out. They must make a pile of cash out of that show. I wonder what they do with it One never sees a balance sheet. or ever hears what becomes of any of this money,& it is run by the military.\n","26":"\nIsmailia\n\nI got leave this afternoon & came in here, it shakes some of the desert off one to get where there one can walk about & kid himself that he is in civilization. Ismailia is a pretty town as towns in Egypt go. The whole place is crowded with trees.\n\nIt was a bit funny this morning. The S.M. warned McCullock to be ready at 9.0 to go to school at Zeetoun. When we got back from breakfast he was told the order was cancelled & Harold Liabrand was sent instead. Thats the way with this place there is always a feeling about that some wire pulling is going on. One has to be in the boom or a born schemer to get on here\n","27":"\nMoasca\n\nI had a rotten job this morning. First of all the S.M. told me that he wanted me in & gave me a job of parading the Fatigues to Orderley Room Then I had to escort Blue Roach to the clink: Such a rigmarole,one would think it was a General one was handing over. I had a pile of papers & Blue had all his kit & I had to bring back a receipt. This afternoon Im off parade also; still carrying on with Orderley Corp. duties.\n","28":"\nMoasca\n\nCorp Clarke six men & myself went on the Flying Corp. guardto day. Seven men are warned & one man, the best dressed gets off. They criticized each other pretty frankly at breakfast but it was a \"rank out sider that scored. They are only kids & are some nuisanceon guard. I dont know how they will get on when they get some dinkum roughing. There is a deal of sadness in store for them I guess.\n","29":"\nMoasca\n\nWe came off guardthis morning & just got back to camp in time to see the mob falling in for a route march. I took to bed, it was much more than having to strut along the road with gear up. Its cold too & showery Clarkey & I went to the sports in the afternoon. Aussies & NZs pulled off all events. We were nearly froze. We went to a tent where tea was being served thinking we could buy some scran . But got the cold snub. Sergeants & W.Os only. They do give one the pip.The sufferers had space enough reserved to serve a battallion.\n","30":"February1918\nMoasca\n\nThe sports finished up to day. The weather was crook, cold & blowy the whole time The Tommies did not win one event,they had to content them selves with a few seconds & thirds. Its a bit rough on the crack Regs. Seaforths & Black Watch.\n","31":"\n\nMounted guard this morning& proceeded to the Sports ground & relieved the guardthere but all the gear was taken away this morning so our guardfinished about 11 oclock. Went into town in the afternoon.\n","32":"\n\nMounted R.F.C. guardthis morning. they are constant on these gaurds.\n","33":"\nMoasca\n\nI say good bye to Moasca in the morning & amjolly glad too. Ive had nothing but gaurds all the time Ive been here, & to day Ive been busy onescort duty either taking men to or bringing them from the clink a crook job nearly as bad as being in the Anzac Provost. Ive drawn all my gear rations etc & Im frightened at the weight of it. Reckon they will be able to track me by the things I discard on the way.\n","34":"\n\nEighteen of us got ready for the road from the sixth & after being inspected about a doz times we got to the station. We waited at Kantara the rest of the day & got in the truck for the long trip about six oclock. 27 of us in a truck. we were crowed enough, I don't know what the Tommies were like 35 per truck\n","35":"\n\nWe had a pretty decent trip but it was too long. It got day light a bit after we had passed El Arish. When we got along the road the boys were able to get oranges off the niggers, & a couple of times they took bag oranges & all without troubling to pay, when the nig wanted to big a price. We got to Ber Salem about 6.30 at night & camped there for the night. A feature of the trip was the mud villages of the natives they looked theirbest. The rains had made the grass grow on them & every roof was covered with a bonza green coat of grass.\n","36":"\nWady Hanen \n\nThis morning the horses came over for us about eight oclock & we got over to camp about a mile & a half ride. I went into B troop. Every where along the way up one could see evidences of heavy rain. Someflats were still under water & there wasplenty of mud about. All the chaps look well & so do the horses\n","37":"\nWady Hanien\n\nI got my bivvy up & they tell me that Ill last just about 10 minutes in it if it starts to rain.I am messing with Farley &Saunders in no 1 section. They have a box full of tucker; a bonzer supply. Some baksheesh was issued last night pickles lollies sauce etc also shirts & socks. I have to go on gaurd to night, but one does not Kiwi up here thank goodness.\n","38":"\nWady Hanien\n\nIts a deal better out here; the country looks better, it is green & here & there are patches of flowers which brighten things up. Just below the camp is a Jewish village It has red tiled roofs & looks well in among the green of the orange groves which surround it.\n\nAn air raid must be expected as they have been busy colouring all the tents a dirty brown colour to make them invisible to air craft. Its cloudy & there is a smell of rain in the air.\n","39":"\nWady Hanien\n\nSix men & my self were detailed for town patrol in Hanien to day & so I had a good opportunity of having a good look at the place It is only a small village & the houses are only ordinary though from a little distance they look extremely well with their white walls & red roofs showing up brightly against the dark green of the dense orange orchards which cover & surround the whole village. There are other fruit trees also & most of these are in bloom now, its rather a pretty place, the dirt & disorder of the dwellings are the things which spoil it.\n","40":"\nWady Hanien\n\nBob Thorne is Orderly Sergeant & Wally Sharpe went it Moasca on Escort yesterday so this morning I had to take the troop, it was a bit strange especially as Ive had no mounted drill for ages. This afternoon I was down to see some of 6 sqd football. Two troops were playing for the troops issue of rum. 6 troop won the rum & old McNare was much elated. I think Bob has gone to try and arange a match for the morning between D & B troops instead of early morning parade.\n","41":"\nWady Hanien\n\nBob Thorne went away to the Cavalry School at Zeetoun to day so that leaves me in charge of the troop until Wally Sharpe comes back. There was a concert in the Y.M. to night; it was a pretty crook turn out, the band was the only thing worth listening to. The tent was crowded out too. I only just got back to the bivvy in time when down came the rain. Some of the little bints who came accross from the village would get wet going home I guess.\n","42":"\nWady Hanien\n\nIts some different here to Moasca this morning we did not turn out until after seven oclock; had a good old curl up. I went to church later. A voluntary service, there was not many there. The Y.M. bloke said last night that they were trying to get the compulsory church parades cut out on account of the bad language the chaps were in the habit of using after the service. Footer this afternoon. I played with B. sqd team against C sqd & we scored a win. The Regimental 1sts played the","43":" Rgt later & beat them too. The seventh went very crook, they have no love for the sixth. They cant beat us at footer yet though.\n","44":"\nWady Hanien\n\nThis morning on the early morning parade some 20 men were picked to train for footer instead of the usual morning walk. The Major's brother is in charge ofB sqd of the first Rgt & a match has been arranged between them & us so old Harold is a bit keen on it.\n\nA Taube came over this morning & the anti-guns gave her some hurry up & us also for we came in for a shower of shrapnel & shell cases. No damage done how ever either to Jacko or us.\n","45":"\nWady Hanien\n\nB sqd of the sixth met the B sqd of the fifth this afternoon& we got a pretty severe drubbing but I dont think they are as superior to us as todays score would indicate.\n","46":"\nWady Hanien\n\nWally has not come to light yet. I think he must have met Col Fuller in Cairo & got his leave extended, I hope he get out before we shift. There are strong rumours about that we shift on Monday out about Jericho. The sixth met the fifth firsts to day & whopped them 8 to nil.\n","47":"\nWady Hanien\n\nWally Sharpe came back this evening & I was very pleased to see him back. Every thing has to be got ready for a shift & I have been busy taking shortages.\n","48":"\nWady Hanien\n\nThis after noon our Regimental team played the Spring-Boks, a team of South Africans who had an unbeaten record. We beat them 15 to nil\n","49":"\nWady Hanien\n\nThis morning the squadron went a couple of miles out where the grass was good & let the horses get a good feed. The nags did enjoy it; clover up to their fet locks. Along the way there are lots of flowers, thay grow in patches, bright red, lilac, & yellow.\n\nThis evening I went down to the service in the Y.M. It strikes me that there is comparatively a better attendance atthese voluntary services than at the compulsory parades. The Y.M. was fairly full tonight.\n","50":"\nWady Hanien\n\nGrazing againthis morning. To night Jarvis the Orderley sergenat, dropped a bomb shell on us about 8 oclock when he came & told Wally Sharpe that he & two men were wanted for gaurd (a weeks); all their gear & rationsto be at the orderley room 5 oclock in the morning.\n\nThat leaves me in charge of the troop again, & only Bill Furner a L. Corp to carry on with.\n","51":"\nWady Hanien\n\nWally & his men got away this morning before we were up & when they got over to Reckon where the gaurd is they found the old guard still in bed & Wally was thanked for coming to releive them but they said they were not going to turn out yet, so Wally was left to wonder at the ways of the military which got him up at 3.45 to releive a mob who still stuck to the blankets long after he got there\n","52":"\nWady Hanien\n\nIt has been one of those blowy days which makes ones skin feel like as if it was sand papered after shaving: & dusts ones tucker so a chap would think he was eating charcoal. We went grazing again this morning.& it was good out there on the green flat. To night I went down to the Y.M. Padre Backhouse was giving a lecture on Jerusalem when word came down that all B squadron had to return to the lines. I had visions of a turnout at the higgery & got ready a few words so as to be able to suitably express my feelings. When we got back the L.S.M called the roll,it appears that some chaps have been mucking up in one of the villages anyway B Sqd is all present & correct.\n","53":"\nWady Hanien\n\nLife now always seems to be mostly made up of trivial annoyances, the only sort of pleasure is that of thankfullness that things are no worse. Last night I fixed the watch to the front of the bivvy for the benifet of the picquet but twice I was awakened by the picquet crawling inside to look for the watch, & the other night one cove wake me at 2.0 in the morning to tell me my horse was loose& he could not be caught. However it was our turn for Corp of the picquet to night but C troop found the corp instead & though it blew all last night & to day its bosker & calm now. Like as if the world has stopped to get its breath.\n","54":"\nWady Hanien\n\nThis morning it was raining when I got up, so there was no early parade, & I let the coves slumber peacefully on until breakfast time. It cleared up later but we had no parades except one at one oclock a gas mask & iron ration inspection. Herb Dickson our troop officer is leaving for Jericho in the morning. I think he is going to look at the country where we are going very shortly. I don't think wewill be here another week.\n","55":"\nWady Hanien\n\nThis morning all gas masks were recalled. It seems strange that they should call them in after the way they impressed their importance on us in their training Tom Mariott & I went over to Rechon to get the guards gas masks & we found them very comfy. They tried their best to get us full on wine but we got back respectable if a bit merry. The N.Z. band was playing & as to-day is the Yids Sunday there was a fair crowd about all togged up.\n","56":"\nWady Hanien\n\nSunday is supposed to be a day of rest but soldiers are outside the rule evidently; any way I've had a busy day:They kept me jigging with one thing & another. We are getting ready for this stunt. We have to ride light one blanket per man & onefor beast. Ive slipped a bit if I cant manage two for my self. I guess it'll be some cold on the track though I beleive The Jordan valley isan extremely hot locality on account of its being so far below sealevel.\n","57":"\nWady Hanien\n\nThe boys were very disgusted this afternoon when the order came for an inspection in full marching order, mounted. It didseem a bit mad for there was about a dozen men away & there was just about as much chance of checking the gear as of finding out how many boot laces theKaiser breaks in a year.\n","58":"\nWady Hanien\n\nThis morning we were to have an inspection at our saddles in the lines before breakfast, we got our gear out & it rained there was much swearing. Then we put the gear back & it was to be after breakfast but it was postponed until after watering. We are pretty well set for the track Turn out at 5 in the morning & move off at 8.30. Wally lobbed back to day with the guardjust in good time for the move off tomorrow.\n","59":"\nLatrun\n\nThis morning we moved off about 9. oclock. It was showery & very . The Brigade took the old Roman road through to Ramleh to Jerusalem. We moved in half squadrons at about 200 yds interval on account of the traffic even then there were many delays & we are 18 miles from Jerusalem now. I think we will stay here for a few days\n","60":"\nLatrun\n\nThe horses are away grazing & the poor beasts need it for the ration is poor. It is a sort of clay here & one is all one's spare time knocking clods off one's boots. We are on the edge of the hills & we will have some hard going I think. Old Joe Watts the R. Far. L.M. had a brain wave & got us to put hoop iron in the horses shoes to prevent stone bruise: We were kept busy along the track knocking the hoop iron out & some horses legs got cut with it as it worked through on the inside of the hoof.\n","61":"\nLatrun\n\nThis was a rather tragic morning when we went out grazing some Bedouins from the village came up towards Hewitson the officer, at the same time old Barcheim came galloping up waving his rifle; he jumped off & went up to the natives who ducked behind the chaps; one exposed himself a bit & Barcheim who was in a very excited state shot him dead & then tried for one of the others. It isnt quite clear why he shot the nig, but he is under arrest for murder. It appears that the natives mobbed him & there is a bint in the show too. Reckon Barcheim is up against it.\n","62":"\nLatrun\n\nSuch a morning! it rained most of the night but we did not fare badly. This morning though it teemed & most of the bivvies were flooded, the boys got out side & started cooeeing; we're mud to the eye brows & the horses are standing in running water\n","63":"\nJerusalem\n\nThis so far has been our roughest spin. It teemed all the night, our bivvies were flooded & blankets wet. We had to pull down our bivvies first thing, they & the blankets were to be in by 6 o'clock. The whole place was over the boot tops in mud. We formed up about 8.30 waiting for the move off: cold, wet, the chaps were cooeeing. Last night I heard the mob singing & cooeeing when they were washed out. It was a long slow trip. & would have been interesting if the weather had been good. The people here saw us at our worst, all covered in mud. Wally & I got a dry bed in a house near the lines. It wasnt bad; when the alternative was wet blankets in the mud & rain\n","64":"\nJerusalem\n\nThis morning it was brighter. We are camped just out side the walls of the old city. This morning I got leave with a party to go & visit the city to see all the old & sacred places but we were starving so our officer made arrangements for us \"about\" 40to get a meal at an hotel. So here we are about 10 of us have been served an omelet & we are wondering if there is any thing to follow.\n","65":"\nJerusalem\n\nThere is a lot of trouble about the natives selling cognac, it's poison & the boys are getting a lot of it. We were to move out to night but it is cancelled. Our camp is near the old city wall opposite the Mt of Olives & we can see the glistening domes of the beautiful Golden mosque which is built in the Garden of Gethsemane.In the afternoon the Moslem priests climb the minaret & sing a sort of chant calling the people to prayer\n","66":"\n\nWent to a compulsory church parade in the morning, St Georges church. The \"Bishopin Jerusalem\" had a talk to us.\n\nIn the after noon I went for another trip into the old city,& it was very interesting. We left our camp at 7.0 at night & did a higgery march until 2.0 in the morning, to a place over looking the dead sea\n\nHaven't time to light a cig,\nwe\n","67":"\n\nHavent time to light a cig, we've shifted our lines this morning as we were on the sky line & in sight of Jacko.\n\nWe got our bivvy sheets & stuck up some shelter for ourselves, Last week it was rain now we want shade from the sun. The hills here are huge & rough, all rock & stones, bare of vegatation except a few flowers & short green flim of grass on the slopes. I hear that the dead sea is marked on the official maps as being 1280 ft below sea level. We were warned when we went to bed that we might have to get on the move before morning.\n","68":"\n\nI went down with the horses to water this morning, such a road,it was littered with traffic & down a long steep hill. ANZs horse fell over on top of him. There was any quantity of water in the gully below, a good fast stream flowing. We are ready to move all the time. Col. Fuller came back this evening.\n","69":"\n\nThis evening I heard that we were to move so I thought I would go over to the ridge & see theJordan valley & Jericho from the heights before we left. After tea we received the order at short notice & moved away at seven oclock 6th LH leading.\n","70":"\nEast of Jericho & Jordan \n\nWe kept going down for a long way, the hills rising sheer on either side of the road & last we hit the plain & had easy going. Halted about 11.30; moved away again at 2 oclock this morning & shortly after crossed the Jordan by means of a narrow pontoon bridge It was slow going, when day light came the 6th LH formed a screen, B troop in suports, We passed through some bonny crops of barley & the nags did OK & came on here to the edge of the hills where we have halted boiled the quarts & had a snack. I took a risk & had a bath in a fast flowing creek. It was bonza.\n","71":"\nHills East of Jordan\n\nYesterday afternoon some Jackos were sighted just after we formed & we did the maquoon act over the hills after them & slipped; then we reformed & started our journey up hill towards East. The hills were thick with flowers & at first we enjoyed it but later it started to rain & as we got higher it grew colder the going was rougher & things were mush kwayse. how ever we got to a bedouin camp at day break & here we stayed all day & all the morning it rained, we were all sopping wet. I saw Bill Ross in the evening but had not much time to talk to him for we formed up to move off again at six. It rained all night & we all have a very stiff time of it we came to this hill side this morning (Tuesday) & have just had a bit of breakfast & arenow mounting orders.\n","72":"\n\nWe waited all day & had a good dry up. & got a bit of sleep at night. Rations are to arrive I believe & will be issued in the morning.\n","73":"\nAmman\n\nWe moved off & about 11 oclock got in touch with Jacko at Amaan & got dismounted for action. I went out in the firing line the horses were behind a big bank of rock & looked safe enough but Fred White & Dick Hawkey were killed & one horse & another wounded. Arthur Dunbar was also wounded in the firing line. we advanced in the afternoon but had to retire under a sizzling fire I had to take F Whites places in charge of the led horses we took up our original position & stayed the night. I had not much sleep holding 4 horses all night no rations.\n","74":"\nAmman\n\nThe rations came this morning & I was pretty busy issuing them as most of the men were on the hill; they advanced a bit then hung on until some infantry came up & started the advance again at one oclock, since then there has been incessant fire & some shells came our way,too close to be pleasant we are all ready now to move on with the horses & are awaiting orders. There has been a lot of casualties in the Bde I believe & expect they are still mounting up in numbers one does not know how things are jigging. Jacko is obstinate.\n","75":"\nAmman\n\nWe were cheerful enough yesterday until the wounded started to arrive. but a couple walked in & told us how things were & some of us went out to see if we could get any of the boys back. a good lot got back but a lot got out too far & we dont know \nhow \nwhats happened to them in our troop only about 3 came back out of the party who \ncame back \nwent out. It was a poor lot who lined the ridge just in front of our nags last night. Just a mere handful & the same this morning I don't know how we'll do if Jacko attacks,he is giving us shrapnel now. Wally Sharp is missing & about 7 or nine others out of the troop. Major Ryrie is badly hit & Mjr Dickson is wounded but still carrying on.\n","76":"\n\nI dont suppose I ever felt so down on it. It breaks ones heart to see the vacant places in the troop every time I got to Wally's saddle I get a lump in the throat. We are carring on as best we can & have plenty shooting at Jacko.\n","77":"\n\nWe are up near Head quarters just now & we are kept busy with the rifle.\n\nThe weather is crook\n","78":"\n\nWe inshied to near Asault to day& we were glad.\n","79":" Tuesday\n\nTo day we returned from Asault,it was a general withdrawal I'll not forget it.\n\nCold & miserable The populace is on the move too. its crook to see the poor old folk struggling back to wards Jerusalem under big loads. Its miles of down hill going. one thing the road is fair. we camp to night on the Eastern edge of the Jordan valley. Every man is leading a horse\n","80":"\nJericho\n\nWe came into here yesterday & we are glad to get a wee bit of a blow again we are busy enough though for there are so few of us. Jacko sends his planes over bombing every day. We are supposed to be ready to move at one hours notice\n","81":"\nJericho\n\nBob Thorne & Roganjoined us this evening & Smithy came out with them.\n\nA quantity of canteen stuff came to hand & was sold to the squadrons, it ran out at about £1.0.0 worth each section.\n","82":"\nJericho\n\nIt was hot all the morning Bob & Patcame to dinner growling about the heat but before we finished we had to get into our coats it turned cold & rained like mad. every thing was muddy for a while\n","83":"\nJericho\n\nWe are getting into our old swing again, only we are greatly handicapped for men. All the troop go on picquet at night & it works out at about ¾ hour per man. The horses are looking better we take them grazing each morning The creek has plenty water in it & is only a 200 yds distant,a chap can get himself clean again.\n","84":"\nJericho\n\nIt as hot as blazes here during the day. I hope we dont stay here too long. The hills on each side of the valley are rugged those toward Jerusalem look bare but the Mountains of Moab towards evening show up plain & are green though all day the look purple with the haze. The Dead sea looks like a sheet of steel; it is about seven miles south wards.\n","85":"\nJericho\n\nIt was a hot day but clear. I dont know how we would do if it wasnt for the creek near by I got dossed down for the night & as I did not feel too bright I did not bother to get all my gear together before turning in & blow me if about ten oclock we were not turned out & had to go about nine miles north wards to support the camel Corp. Some Jacko was caught & he said that they were going to attack in the morning.\n","86":"\nJericho\n\nWell they did not attack & about seven oclock we made back to camp, tired & sleepy. We went through the village of Jericho, its a poor looking shop but there are some nice green gardens about it though they are wild & look as if no one looks after them. We passed over several little streams,its fine to see the running water. To night we are all prepared for another turn out & praying that it wont come.\n","87":"\nNorth of Jericho\n\nWe got up at about six this morning & got our quarts on then the order came to get our bivvies rolled. 2 min later the order to saddle up & file out. it was some bustle. We came up to support the Camel mob, about 25 men went out of the sqd on post for the night & the rest of us camped on the banks of a wady, \nit was dry yesterday. but this morning is running a beaut. \nit was dry when we came along. I saw Bill Ross & had a talk to him\n","88":"\nNorth of Jericho\n\nThe wady has a bonny clear stream running down it this morning. We got the order last night \"standing to all night, men take their blankets off at their own risk.\" We took the risk. We are mostly grass seeds & prickles this morning. We went north wards along the flat about dinner time on a sort of patrol, there was some shells about & came back about sun down got some reeos & rations which got a rough issueing in the dark. put our lines down & camped for the night\n","89":"\nWady North of Jericho\n\nStand to about four this morning & since then we have been ready to hop right off & are still waiting. Its hot as blazes & has been so this last few days. This is a valley of prickles & heat. one thing theres plenty water. (Later) we put in a good day washing & resting. We got another reeo in the evening so now we have all our horses\n mounted \nwith a man on. Orders are 6 oclock breakfast no 'stand to' A pretty decent lot of bakshheesh stuff came to hand to day.\n\n\n\n\n","90":"\nOn patrol\n\nThey dug us out at 3.30 this morning & we went out towards the Jordan on a patrol. The new coves had some great loads on their saddles & I was busy fixing nose bags & gear along the track. we are with the horses now in a dead end of a small wady & some of the chaps have gone out to see if there are any Jacko's at a dome about 1½ mls father on. The new chaps won the race home. They were fired on with machine guns & bolted\n","91":"\nWady North Jericho\n\nwe went on patrol to the same place \nto w \nas we were on Sunday. We had a troop of Indians with us & orders to the effect that on no account these birds to go on the screen. We saw some Jacko's but they were a long way over.\n","92":"\nWady North Jericho\n\nIt has been cooler this morning & its decent. There are orders out saying we are to go stunting again tomorrow or tonight & regimental turn out.\n","93":"\n\nWe had a good night in last night & shifted at about 1.oclock today we went back to near Jericho & boiled up our quarts in some prickley scrub then before dark we moved on & camped on the Western bank of the Jordan at about 7.30\n","94":" East Jordan\n\nWe moved off early this morning & crossed the river by the pontoon bridge: & then had breakfast. later we went accross the flat & Jacko started shelling & we did a two mile gallop. with shells falling pretty thick, there was only one casualty though We stopped in a wady for a while then went on again but Jacko shelled us some more & Bob Brown was hit & another chap also a couple of horses, we are back in a little wady now a bonny stream running oleanders blooming on banks.\n","95":"\n\nWe got back last night after a long ride & I dont think I was ever so saddle tired. We camped not far from Jericho & this morning drew rations & moved back to the wady North of Jericho which we left on Thursday\n","96":"\nWady North of Jericho\n\nWe are set again & have our lines down Dickson got us on making the place look pretty this morning by making lines of stones I think he got the idea from the Indians camped next door.\n","97":"\nWady\n\nIts been hot as \nthe\n blazes this last few days; There is a big mob at sick parade two of our new chaps are marked no duty. They seem to burr up quick now a days.\n\nThere is a rumour that we are to shift again, one has alway to keep one's gear pretty handy\n","98":"\nWady\n\nBob, Dicko & a fewothers went out after wild pigs this morning they took a tomahawk & a bag. Lobbed back after dinner with a bullock, cut up. There is a great smell of frying & cooking about B troop this evening\n","99":"\n\nWe left the wady to day & went down to Jericho, to our old camp.\n","100":"\nJericho\n\nWe are in our old possie again. The wady is dry though & we have some trouble watering. We have to move off to night on a stunt & rumour speaks of Amman\n","101":"\nJericho\n\nAll day wondering whats doing: we are to shift some where to night\n","102":"\nEast Jordan\n\nLast night we moved away about 10 oclock, crossed the river & went south a few miles then camped right near the Jordan. The boys were out trench digging this morning.\n","103":"\nEast bank Jordan\n\nI went down & had a swim in the old Jordan this morning. It's a dirty looking stream but not bad drinking water. We are getting 48 mobile rations to-day & are to move again this evening. Some stoush brewing I think. Trinder came out to day. Sgt Jarvis got the willies on listening post to night & the result was that every available man went up to the trenches They all came in about ten & as soon as they got saddled moved out I stayed with the packs with Sgt Rogan & joined them later\n","104":"\n\nWe moved up the bank of the river opposite to where the bridge is accross & fooled about until about dinner time to day when we watered the nags a bit later we went on up the East bank again until we got some where opposite the ford where we patroled to last week then took to the hills & climbed all night. We had breakfast in the morning then went on to Es Salt. We went right through the town & on to the hills to wards Amman. Jacko inshied at the higgery & left a lot of bombs & gear. about 400 prisoners were taken at Es Salt. then had to wait 3 hrs for the fifth. we got down below Es Salt early this morning\n","105":"\nEs Salt\n\nWe are\n I was never so tired & sleepy as I was last night when we halted I just lay down gear & all & went to sleep I woke shivering this morning. We moved down the road a bit but could not get far for Jacko, he is cut off but is hanging on. The boys went on & lined a hill a while back & I am with the horses. Rogan & a couple of others went out to get some cattle this morning, one a regiment, they also got hold of a goat; so we'll have some meat any way, its finish rations until we get this road, the other way is too rough; good job there is plenty grass about. the nags wont starve.\n","106":"\n\nThe regiments horses went down the road about a mile to be near the men on post yesterday evening. At two this morning we pulled out from there & went out on the left as supports to the 8 Regt who had a sharp scrap early in the morning & took some Jackos We fooled about all day. Our position is serious as Jacko is giving our chaps a bad time farther back & we are pretty well cut off & cant get rations During the evening we were told that we had to get out at dark & it made us think some for we had to go back by the goat track that we came up. The sixth regiment were rear gaurd & that meant that if Jacko attacked when the others went it was good bye sixth regt. We formed up on the road & sent out listening post & got away two in the morning\n","107":"\n\nWe got away with out trouble, the sixth was responsible for the safety of the columns rear until we passed through the1 Bderode a few miles back behind ES Salt we went on right through, crossed the Jordan & halted at our old camp near Jericho. Every one was dead beat, & so were our horses We drew lots of rations & I got some stuff at the canteen so we fed up big at night\n","108":"\nJericho\n\nIts been a terrible day wind & dust, our eyes are nearly cut out of our heads. If its not Jacko thats annoying us its dust or some other pest. Some more reos came in to night so we were able to build up a bit, but we are still under strength. There is some talk of going further back; I hope we do shift off this flat, it crook here & a chap would'nt stand it too long. Last few days we were pretty well froze on the hills. & here we are baked.\n","109":"\nJericho\n\nWe were bombed this morning, one fell in the seventh & got 16 men 8 killed\n","110":"\nJericho\n\nIts some hot & the flies are the limit I think we move back to morrow. It might be a bit cooler off this flat.\n","111":"\n\nIt has been fearfully hot all day. We have to take our horses up the wady a long way to get them water, & its pretty crook to. Was up to the canteen this afternoon. There was some stuff in, fruit & meat, there was a run on it & they dished it out slathering whack. When I got back I was told that I had to report to A troop as sergeant\n","112":"\n\nWe left camp about 2 oclock, & we had a hot & fearfully dusty ride. We halted farther north & west of our previous camp north of Jericho in the wady Adju. We are about ¾ miles from a good swift running stream. The ground is very rough & stoney. We are supports to another Bde.\n","113":"\nWady Adju\n\nWe went out at dark last night on out post duty & scored supports so got a bit of snooze but this morning stood to at 3.30 & went pulling down barb wire till 7. o'clock.\n\nOut again to night & the mad mick with us this time digging until 10 - oclock\n","114":"\nWwady Adju\n\nThis morning we yanked down more barb wire came in at six its hot as blazes.\n\nNight in to night thank goodness\n","115":"\nWady Adju\n\nId give something for a long cool frothy drink today, the cooler & longer the better, its some hot\n","116":"\nWady Adju\n\nLast night we were out on the old job at the trenches again. Its two nights out & one in. The horses have it crook they stand linked with saddles on two nights out on three, & the third night they cant rest because the lines are so hard & stoney. We have had canteen stuff three days in succession, its dear & is all the culls of the canteen, never the less \nthe\n we are glad of it. I dont know how we'd have lived with out it, the rations are vile.\n","117":"\nWady Adju\n\nWe had a night in last night but had to find the patrol this morning, Mr Berry, Tom Sherry, & seven men went on it. I expect the rest of us will have to go out \nfor \nto the trenches for a little exercise to night. It would be so bad but its so hot & the flies are so bad that one cant sleep in the day time, & then stand to at 3.30 every morning, knocks the shine off. The sun can shine through some of us now & we make no shadow, dont know what we'll be like soon.\n","118":"\nWady Adju\n\nThe weather continues hot & still we go digging at night. Last night we went out & dug for 3 hours, leaving out there at 10 o'clock, \" a most delightful evening\" What gets me is that after doing that a chap has to turn out at 3.30 in the morning, saddle his horse, don his gear, & stand to \nfor\n til after day break. Jacko treated us to a little diversion in the way of some shells this morning they came close enough to inspire in one a strong inclination to duck but no one was hit. I hope it does not be come a habit with him It would be a decided nuisance\n","119":"\nWady Adju\n\nOld Jacko was very snakey this morning, he stuck a few over as I was issueing rations, there were no arguements this morning! When we were at breakfast he got right on to us & plunked a couple of shells right against Tom & I. we could'nt see one another for dust. we had to shift our horse lines, it was a lot of work, we went up the gully a couple of hundred yards we go out to night for three hours digging The boys will be pretty tired on it.\n","120":"\nWady Adju\n\nWe've had a quiet day thank goodness. Jacko has left us alone & the orderley sergeant has not bothered us much. We get a night in to night, so went down to the creek & had a good old wash up. its good to feel clean, after being smothered in dust, it blew like mad while we were having tea & I could'nt see for dust.\n","121":"\nWady Adju\n\nI was out with a working party tonight, we worked for two or three hours road making. 40 men from the squadron, 14 from this troop. I notice that though the other troops make out their same size when it comes to rations but for duty they remember that A troop has the most men. Its as hot as blazes & this dug out is full of crawling things spiders & scorpions. I expect a visit from a snake any old time. A chap in the Machine Gun Sqd was found dead in his bed, a snake in his blankets\n","122":"\nWady Adju\n\nIts cooler this evening, so a chap has some prospect of getting a bit of sleep last night was a killer I beleive we move back on Tuesday, the movement orders are out & I'll be glad. it'll be good to get back among the hills again & have a blow away from the heat reptiles & stand -tos\n","123":"\n\nTom got crook suddenly & this evening went to the doctor who said he had pleuresy & packed him straight off to hospital.\n","124":"\nWady Adju\n","125":"\nWady Adju\n\nWe are to shift tonight at seven oclock. Its as hot as can be \nI receive\n & we will be glad to get away from the heat for a while\n","126":"\nTel El \n\nWe had a pretty crook trip, it was 1.oclock this morning when we got here; we waited all day & start off again to night; its some hot even here & I received a parcel full of woolens. it seems out of place just now.\n","127":"\nBethelhem \n\nIt was a tough old ride we had last night, when we got well up on the hills it started to blow & it turned cold; we were fairly frozen I was jolly glad of the woolen stuff on the trip it came in handy. We got here after day light, had a whole nights ride of it & we were done up this morning. Its cold as ice bergs & blowing a treat\n","128":"\nBethelhem\n\nA better day to day just pleasant. we have a long trip to water about 3½ miles, its a bit rough on the horses & the men too for we are so short handed The folk come about selling eggs & tomatos etc, eggs run at 4\/- a dozen & all other thing are dear a like.\n","129":"\nBethelhem\n\nIts a wild night to night blowing furies with driving mists, we have to rug the horses every night. I dont know how we are to manage to morrow there are only threemen left in to water & feed 36 horses, all the rest are on duty Its time we got some reeos. They are going to give us drill & such rot. The heads are the limit.\n","130":"\n\nThe canteens here are the limit never have any thing in them. We water the nags every day at Solomons Pools a three mile dusty trip. The 4 Bde came back to day they are a lucky mob, only just went down about a month ago, suppose we go down shortly & will catch the worst of the heat.\n","131":"\nBethlehem\n\nThis is a character of a squadron just now Cpt Marks is in charge hes like an old woman & I believe he is going on leave. Dont know who will be in charge then Dont know where they'll be with out their NCOs One man went to hospital today. I go on leave during the week & one to a Farrier's school To morrow theres a Parade service in Bethlehem & nearly the wholesqdis going The work will get a rough go in the morning\n","132":"\nBethlehem\n\nWe leave to night at 5.0 pm. for the valley again,so we did not have much of a spell. We are nearly as short handed leaving as when we came here but personally I feel the benefit of the change & think most of the chaps do also.\n","133":"\nJalett ed Dunn\n\nWe passed through Bethlehem at sun set & it looked a pretty sight with the sun glistening on the spires of the town which is rather scattered among olive grown slopes, & vine yard & orchards. It was bright moon light when we got to Jerusalem, we had a quiet ride through the place, we halted right opposite the garden of Gethsemane at the foot of the Mount of Olives After that the trip was less interesting & we were glad when at last we struck camp here at 1.30\n","134":"\nJericho\n\nOn Friday evening as we passed through Bethlehem the boys had a great time chipping the bints along the way. One little girl went right along the column & gave an apricot to each boy who spoke to her as we passed every one handed out good natural chaff. Onefat old sport rode along on a little pony, he got his cut but took it well, he scored off Smithy. Smithy didn't think of his understanding English & said- \"What a character of a horse.\" The old pot pointed at Smithys & said \"it's better than a camel\" We got down a bit beyond Jericho last night n- o & we pull out again to night - hand over one to 3 horses & man trenches\n","135":"\nTrenches\n\nLast night we left the camp & rode here arriving about 11 oclock, handed our nags over & took over our post from the Indians I had six men with me. The guide took me to a Kisspost, & said six men here. I left three, then we went to another post & left three men there, then he took me to another post & told me 3 men here & six in reserves & apost of two, I got two more men & a sig so manned the three posts This morning B troop relieved us with 15 men & we took over another post with only one post to find.\n","136":"\nTrenches\n\nJacko was very lively last night, he started with rifle fire on the left about 10.0 then at 12.40 we demonstrated on the right, his bullets splashed amongst us from our rear, he also burst some shrapnel over us later he gave us some rifle fire & flares so far from this possie I think he is trying to get the stength of ushe kept us standing most of the night. It has been terribly hot to day, one cant get much rest.\n","137":"\nTrenches\n\nThe Turks were supposed to attack last night, but they behaved peacefully except for tossing some shells accross at intervals over to the left. There was perfect quiet on my shift except the continual hum of the persistant mosquito & the occasional howl of a Jackal. When we left Tallalt ed Dunn the other evening & saw all the Bedouins on the hill top & around I thought it apt when I heard someone call them the human jackal. The misquito hands over to the fly punctually at stand to each morning. They are increasingly active.\n","138":"\nTrenches\n\nOne hot day follows another without any variety. the nights are warm also, but it blows at night. To morrow night we get relieved & go back to the horses. I think we take over the seventh's job then & do patrols on the flanks. Jacko has been fairly quiet, he has not bothered this post with much attention in the way of shells, about 8 or 10 all told.On the flanks though he gets fairly busy every night I think the flank patrols must have a fairly exciting time.\n","139":"\nTrenches\n\nThe arrangements are complete for ourhanding over to the seventh. The advance party of the seventh is here. I was just chatting to a couple of them, telling them that we had a quiet time, Jacko not shelling much. when hanged if the contrary old pot didn't send some shells right over on top of the post one bursting close & showering us with dust. I'm afraidthe seventh covesthought I was only kidding to them.\n","140":"\nWady Audja\n\nWe got into camp here about midnight, then lay down & had a bosker sleep. Its good not to have to start to at 3 oclock in the morning. There is plenty of duty here though, but as we are in lying Sqd we don't get it heavy until our turn comes. We have to be prepared to turn out at 30 min notice.\n","141":"\nWady Audja\n\nThis morning I awoke at 5 oclock, every body was slumbering sweetly, even the picquet. The old Audja was making music running over the stones& I\n\nwent over & had a dip in a water bucket. It seems a shame that one cant get right in the stream.\n","142":"\nWady Audja\n\nMarko had me up before him this morning since Hewitson complained That I'd been insolent to him on the barb wiring job last night. Hewitson put in all the dirt he could about me & the troop, he also put Bob May on the mat for smoking after the job in the Wady 300 yds from home. The Col let Bob off & blew up Hewitson. Hewitson is a blob, don't know how such men should be officers he lacks confidence in himself & is as incompetent a man as one would meet\n","143":"\nWady Audja\n\nEvery man on duty last night except 3 who marched in as reeos. I had to go out on patrol with C & D troops, its a fairly crook job & the misquitoes nearly eat one out in that scrub at night. 12 of the boys are away on guardyet. They are getting plenty duty in this camp. Johno is Ord Cpl to day he got Hewitson & Jarvis our very incompetent acting S.S.M. They went away sick & Johno received a note of thanks.\n","144":"\nWady Audja\n\nLast night it was sleep up big, we had a night in I expect some barb wiring to night. yesterday we got a big issue of Baksheech stuff, it was good later mail cam to hand & then we got an issue of beer, not bad for one day.\n","145":"\nWady Audja\n\nWe were in fightingsquadron last night & we got word about dark that the patrols had to be pushed out as far as possible. Towards morning the artillery started & both side rocked them in, a no of shells fill about us.We had to stand to, there was a deal of Riflefire & we heard many rumours Latest now is 600 prisonersall Germans & 15 by 5 &7 weare expecting something more to be doing 4000 arrivingseem advancing on ourright.\n","146":"\nWady Milawa?\n\nWe got in here yesterday afternoon & got a pretty good possie. We struck it solid for duty right away. Snow Lester & nine men & one for guard besides plenty other minorduty. Everyone was dead tired last night. The old stand to is in force here, it takes the cream offthings.The guns got on to out old camp after we left, we were lucky to get out of it,I think. The transports got knocked about a bit too.\n","147":"\nAudja \n\nWe were to take over from the fifth yesterday but there was some hitch however we move off at one oclock to-day, I heard some one say. There's one thing we'll not be shifting in the heat of the day. Itsa bit off having to do all the bustle in the heat, the other squadrons dont move til evening. A troop were all out on the far patrol last night & the boys didn't get any sleep, the misquitoes see to that.\n","148":"\nWady Milluhar\n\nThis is about the worst camp for duty that we struck. 11 or 12 for duty every night & that hits pretty hard out of a troop 23 all told. Every day is torrid, the boys are getting worn out & irritable. It will be a good thing when we get a spell.\n","149":"\nWady Mallahar\n\nWe sent out the out post as usual but they had to have all their gear ready for the track. At about one oclock we were called up & moved out an hour later, the out posts following later. We moved down to the junction of the Wadys Audja & Mullahar & had our lines down at day break.\n","150":"\nWady Audja\n\nWe moved off at 5.0 this evening & trecked to Talat ed Dumm arriving there about 2.0 clock in the morning\n","151":"\nTalat ed Dumm\n\nWe were supposed to have breakfast over by seven oclock this morning & on stables that was Marko's orders but it was 7.15 when I woke up. There is no wood about so we had some difficulty in boiling our quarts I just got mine boiled when we had to file out to water. Marko was roaring about us being late but considering that we had had no sleep for two nights I think he has little to roar about\n","152":"\nTalated Dumm\n\nWe are over two miles from the Dumm proper. A number of nigs come down here with grapes & tomatoes & the menu is greatly improved accordingly. There is plenty of water ½ a mile away. Its a dusty place though the wind rises every evening Ive been crook the Doc is dosing me with quinine\n","153":"\nTalated Dumm\n\nWe are still in the same old camp but expect to move to morrow night. We are ribbedup now,every man is mounted & no spare horses. Five old hands came back to the troop since we came here.\n","154":"\nnear Solomons Pools\n\nI do not know the name of our camp but it is about 4 miles from Solomon's Pools along the road. It is a good possie nice & clean. We got in this morning & were tired & hungry we found it hard to boil up on account of scarcity of wood. I visited the canteen after it had a great stock in so we fed up big at dinner time\n","155":"\n\nThe duties of the camp are not heavy but we are sending away a lot on leave to port Said that mixes thing up a bit. I thought thatI might get away but there is no chance. Ive been stuck on orderley sergeant & am busy enough\n","156":"\nBethelhem\n\nWe were just getting set in the camp when A troop was ordered away on police duty to this place. we got in this evening & I had a bad time,every man is on duty & there is heaps to do.\n","157":"\nBethlehem\n\nIt would be good here if one just had the time to oneself & could go where one pleased with out \nbothering about\n being bothered with such annoyances as passes & military police. The Church of Nativity is the principle place of interest here, I was down to see it but had to get a pass from the M. governer to get inside. Some of the boys got in; I slipped no orders about shifting, but I got all ready. Orders came about 5.0 & we got away about seven & went back to our old camp\n","158":"\nSolomons Pools!\n\nI was shoved on orderly sergeant as soon as I got back. Tom Sherry came here yesterday morning & took over the troop\n","159":"","160":"\nSolomons pools\n\nWe are to pull out at 3.30 this after noon. It is a good possie here but some how it didnt seem a very happy camp.\n\n\n","161":"\nTalat edDumm\n\nWe went to a couple of miles this side of Jerusalem last night & camped for a few hours; then moved off at 3.30 this morning & came on here. Meppen was bitten by a spider yesterday just as we left he got very crook & had to be stuck on thetransport I went along with him & saw him off at Jerusalem to the quack Then I visited Mrs Chisolms & had a good tea & picked the mob up at Bethany\n","162":"\nJericho\n\nWe left the Dumm at 4.0 this morning & got here about seven, & camped for the day, we leave here for the Audja this evening.\n","163":"\nAudja\n\nWe are back in our old possie again on the Audja. we are set near the water & the camp seems a good one. Its hot, but better than when we were here before.\n","164":"\nAudja\n\nThey were not long slinging us into the collar: Last night 35 & an officer were out patroling the old flat among the misquitoes & pigs again. There are plenty grunters in the scrub out there & they keep the horses windy.I did not have a bad post, it was very quiet but one cant get much sleep with the chaps one gets nowadays. One has to sleep with one eye open\n","165":"\nAudja\n\nIt has been a terribly hot day, not a breath of wind until this evening, the heat seemed to pour down. Its fine to be near water though, its quite the best camp we've been in for some time. A lot of the boys rode down to the Jordan this afternoon for a swim, the current is too strong for swimming though. There are a lot of London yids in the trenches up the wady just now they are a comic lot.\n","166":"\nAudja\n\nI heard the srg receiving some orders about moving early this morning: but we got nothing definite until dinner time then received word to be ready to move at 5.0. Its some hot & we're all cursing the shift.\n","167":"\nEast bank Jordan\n\nWe left Audja yesterday evening & arrived here in the dark about 8.30. Were all jumbled up any way & there is a possibility of having to shift to another possie. We relieved a Yoemanry mob & they left the camp dirty, gear & rubbish all over the place. One chap got a find,£5 in a steel helmet. The NZnders are in the trenches in front, a deal of fire went on through the night. Saw one prisoner brought in this morning.\n","168":"\nEast Camp Jordan\n\nOutthis morning before day break. & did patrol & observation work. We had to scrape to get the men so many being sick.\n","169":"\nEast Bank Jordan\n\nLast night was on out post, it was a quiet night. the misquitous tormented us more than the Jackoes. Iwent for a swim when I got in this morning. later I went down to the river again, a couple of the boys tooka bomb case& we brought back enough fish to do the troop for dinner. But they were too bony to be much good\n","170":"\nEast Bank Jordan\n\nThis morning we were up at 3.0 & out on patrol at 4.0.B troop patrol got into difficulties & lost a man (prisoner) & a horse; & another horse wounded. The patrol rode right on top of Jacko who was planted in the Bushes. The horse had his leg broken so Jacko got the chap before he could get away Dicko took the mob out dismounted after beat, Jacko had gone\n","171":"\nEast Jordan\n\nB sqd were on out post last night. Some troops went out on the flat to wards the foot hills & lit fires. The fires were supposed to be camp fires as if a mob of troops had camped there & boiled up \nfor the\n in their quarts. The wind was high & the fires were more like bonfires. Jacko didnt take any notice. They thought to draw his artillary fire but slipped.\n","172":"\nWady NimrinEast Jordan\n\nThis morning we came out on patrol on the north Bank of the Wady Nimrinwe are in supports just now& go on post at 12 oclock.\n","173":"\nEast Jordan\n\nSuch a lot of rumours about. We are all ready for a move, feed given out etc. & standing to in a way. To night we go on a bit of a stunt to wards the foot hills. We can smoke going out but not on the return trip. Fooling Jacko. Ive got this fever again feel pretty crook on it.\n","174":"\nEast Jordan\n\nReported sick this morning & the Doc is sending me away, stiff luck on the verge of the stunt.\n","175":"\nGaza\n\nI got in here last night. Its been a crook trip down. I put in three days at Jericho one at Jerusalem & one at Ludd. Ive seen a lot of A troop boys who left after I did. I think I could rake up a stronger troop than Tom could. Im beginning to feel a good bit better. & wish I was back \nat \nwith the mob again\n","176":"\nGaza\n\nThe cattle trucks are on the line waiting for to take us down to Kantara. Ill be glad to get a move on; this is a crook place the only thing good about it is the bed. Its a beautiful cool morning & we should not have a bad trip, though those trucks are not much chop to ride in.\n","177":"\nPort Said\n\nYesterday morning I left Kantara. We had breakfast early. 3 pieces bread & dripping & some porridge I would not take on. At 8.30 went in a Red X car to the canal & got on the boat there. It took a long time to get here, but it was a pleasant enough trip. Its a treat to see the cool blue water again. The days are beautiful. so different from the heat of the Jordan valley. I see the boys are in Amman I wish I was with them It will be cool enough there rain most likely.\n","178":"\nPort Said\n\nI am leaving the hospital this morning for the Rest Camp Port Said. Ive had a good spell here but its a stale old place. Its some place for rumours. Turkey has chucked the sponge in regularly every 48 hours this last 8 or 10 days. A boat has been leaving at numerous dates for Suez with the \"14\" men but we're in the same old possie still. Tom Sherry came in a few days back he gets out tomorrow\n","179":"\nSuez\n\nBoarded \"Port Darwin\" this morning & started our journey in the evening\n","180":"\nColombo\n\nArrived Colombo this morning\n","181":"\nColombo\n\nLeft Colombo this morning at 6 Am\n","182":"\nFremantle\n\nArrived Fremantle this afternoon about 2.0\n","183":"\n\nLeft Fremantle this morning about 1.0\n\n"}}