{"Document Name":{"0":"Diary_0291","1":"Diary_0291","2":"Diary_0291","3":"Diary_0291","4":"Diary_0291","5":"Diary_0291","6":"Diary_0291","7":"Diary_0291","8":"Diary_0291","9":"Diary_0291","10":"Diary_0291","11":"Diary_0291","12":"Diary_0291","13":"Diary_0291","14":"Diary_0291","15":"Diary_0291","16":"Diary_0291","17":"Diary_0291","18":"Diary_0291","19":"Diary_0291","20":"Diary_0291","21":"Diary_0291","22":"Diary_0291","23":"Diary_0291","24":"Diary_0291","25":"Diary_0291","26":"Diary_0291","27":"Diary_0291","28":"Diary_0291","29":"Diary_0291","30":"Diary_0291","31":"Diary_0291","32":"Diary_0291","33":"Diary_0291","34":"Diary_0291","35":"Diary_0291","36":"Diary_0291","37":"Diary_0291","38":"Diary_0291","39":"Diary_0291","40":"Diary_0291","41":"Diary_0291","42":"Diary_0291","43":"Diary_0291","44":"Diary_0291","45":"Diary_0291","46":"Diary_0291","47":"Diary_0291","48":"Diary_0291","49":"Diary_0291","50":"Diary_0291","51":"Diary_0291","52":"Diary_0291","53":"Diary_0291","54":"Diary_0291","55":"Diary_0291","56":"Diary_0291","57":"Diary_0291","58":"Diary_0291","59":"Diary_0291","60":"Diary_0291","61":"Diary_0291","62":"Diary_0291","63":"Diary_0291","64":"Diary_0291","65":"Diary_0291","66":"Diary_0291","67":"Diary_0291","68":"Diary_0291","69":"Diary_0291","70":"Diary_0291","71":"Diary_0291","72":"Diary_0291","73":"Diary_0291","74":"Diary_0291","75":"Diary_0291","76":"Diary_0291","77":"Diary_0291","78":"Diary_0291","79":"Diary_0291","80":"Diary_0291","81":"Diary_0291","82":"Diary_0291","83":"Diary_0291","84":"Diary_0291","85":"Diary_0291","86":"Diary_0291","87":"Diary_0291","88":"Diary_0291","89":"Diary_0291","90":"Diary_0291","91":"Diary_0291","92":"Diary_0291","93":"Diary_0291","94":"Diary_0291","95":"Diary_0291","96":"Diary_0291","97":"Diary_0291","98":"Diary_0291","99":"Diary_0291","100":"Diary_0291","101":"Diary_0291","102":"Diary_0291","103":"Diary_0291","104":"Diary_0291","105":"Diary_0291","106":"Diary_0291","107":"Diary_0291","108":"Diary_0291","109":"Diary_0291","110":"Diary_0291","111":"Diary_0291","112":"Diary_0291","113":"Diary_0291","114":"Diary_0291","115":"Diary_0291","116":"Diary_0291","117":"Diary_0291","118":"Diary_0291","119":"Diary_0291","120":"Diary_0291","121":"Diary_0291","122":"Diary_0291","123":"Diary_0291","124":"Diary_0291","125":"Diary_0291","126":"Diary_0291","127":"Diary_0291","128":"Diary_0291","129":"Diary_0291","130":"Diary_0291","131":"Diary_0291","132":"Diary_0291","133":"Diary_0291","134":"Diary_0291","135":"Diary_0291","136":"Diary_0291","137":"Diary_0291","138":"Diary_0291","139":"Diary_0291","140":"Diary_0291","141":"Diary_0291","142":"Diary_0291","143":"Diary_0291","144":"Diary_0291","145":"Diary_0291","146":"Diary_0291","147":"Diary_0291","148":"Diary_0291","149":"Diary_0291","150":"Diary_0291","151":"Diary_0291","152":"Diary_0291","153":"Diary_0291","154":"Diary_0291","155":"Diary_0291","156":"Diary_0291","157":"Diary_0291","158":"Diary_0291","159":"Diary_0291","160":"Diary_0291","161":"Diary_0291","162":"Diary_0291","163":"Diary_0291"},"Date":{"0":"unknown","1":1058.0,"2":1059.0,"3":1060.0,"4":1061.0,"5":1065.0,"6":1066.0,"7":1067.0,"8":1068.0,"9":1069.0,"10":1070.0,"11":1071.0,"12":1072.0,"13":1074.0,"14":1075.0,"15":1076.0,"16":1077.0,"17":1078.0,"18":1079.0,"19":1080.0,"20":1081.0,"21":1082.0,"22":1100.0,"23":1111.0,"24":1112.0,"25":1113.0,"26":1120.0,"27":1135.0,"28":1142.0,"29":1143.0,"30":1185.0,"31":1186.0,"32":1192.0,"33":1198.0,"34":1201.0,"35":1206.0,"36":1209.0,"37":1210.0,"38":1211.0,"39":1212.0,"40":1214.0,"41":1220.0,"42":1221.0,"43":1222.0,"44":1223.0,"45":1224.0,"46":1228.0,"47":1229.0,"48":1230.0,"49":1231.0,"50":1237.0,"51":1245.0,"52":1259.0,"53":1269.0,"54":1270.0,"55":1273.0,"56":1274.0,"57":1275.0,"58":1276.0,"59":1277.0,"60":1278.0,"61":1279.0,"62":1281.0,"63":1282.0,"64":1283.0,"65":1284.0,"66":1285.0,"67":1286.0,"68":1287.0,"69":1288.0,"70":1289.0,"71":1290.0,"72":1291.0,"73":1292.0,"74":1293.0,"75":1294.0,"76":1295.0,"77":1296.0,"78":1302.0,"79":1303.0,"80":1304.0,"81":1305.0,"82":1307.0,"83":1308.0,"84":1309.0,"85":1312.0,"86":1313.0,"87":1314.0,"88":1319.0,"89":1320.0,"90":1321.0,"91":1322.0,"92":1323.0,"93":1324.0,"94":1325.0,"95":1326.0,"96":1327.0,"97":1328.0,"98":1332.0,"99":1333.0,"100":1334.0,"101":1335.0,"102":1336.0,"103":1337.0,"104":1341.0,"105":1342.0,"106":1343.0,"107":1344.0,"108":1347.0,"109":1348.0,"110":1349.0,"111":1350.0,"112":1351.0,"113":1352.0,"114":1354.0,"115":1355.0,"116":1356.0,"117":1357.0,"118":1363.0,"119":1387.0,"120":1388.0,"121":1390.0,"122":1391.0,"123":1392.0,"124":1393.0,"125":1394.0,"126":1395.0,"127":1396.0,"128":1397.0,"129":1398.0,"130":1399.0,"131":1400.0,"132":1401.0,"133":1402.0,"134":1403.0,"135":1404.0,"136":1405.0,"137":1406.0,"138":1407.0,"139":1408.0,"140":1409.0,"141":1410.0,"142":1415.0,"143":1416.0,"144":1419.0,"145":1422.0,"146":1423.0,"147":1434.0,"148":1435.0,"149":1436.0,"150":1437.0,"151":1449.0,"152":1457.0,"153":1458.0,"154":1460.0,"155":1467.0,"156":1468.0,"157":1471.0,"158":1473.0,"159":1477.0,"160":1480.0,"161":1481.0,"162":1482.0,"163":1487.0},"Entry":{"0":"\n\n","1":"\n\nThe next day Sunday 5\/11\/16 we awoke to find the city in an unspeakable quietness for in Scotland Sunday is the Lord`s day \n\nWritten at Westhof","2":" The weather was rather threatening but nevertheless Mr Mann and I stepped out, and after delaying a minute to take a snap of his home caught a tram down to Porto Bello the seaside resort of Edinburgh. The beach was narrow but the promenade alongside must have been over a mile in length. Two piers rather humble in comparison to the construction of English ocean piers stretched a long way into the shallow waters of the firth (of Forth). \n\nReturning the three miles or so by tram we arrived in time for a very enjoyable dinner. Mr Mann being very disappointed I did not help\n","3":"\n\nhim deal with some of the cellar stock bequeathed to him. \n\nDuring the afternoon and evening we just sat and yarned about the sun in Australia etc etc. Outside the weather was just Scottish and we preferred the warm fire. Oh I omitted to mention that the previous evening (Saturday) we had been for a stroll round town, so saw the sat`y night shopping crush which was rather interesting.\n\nThe next morning","4":" we set out together again crossing the bridge over Waverly Station took a few photos of Calton Hill and then mounted the cobbles to High St. down High St. We made our way seeing much of interest in the rather squalid old buildings many evidently on the tenement principle. At last at the foot of the street we came upon a flat expanse of open country in the dip between the hill, and there stood Holyrood Palace!\n","5":"\n\nWe were kept waiting just a few minutes till the opening time at 11am and then paying a nominal admission fee, were allowed to enter, but were only able to walk around the courtyard of the palace which is kept in readiness for a royal visit. We were, however able to make a close inspection of the really historic part – the Chapel Royal say we inspected it but I mean what was left of it – the front towers and the walls. These were of immense thickness being built of rubble only. No columns remain standing. We saw many historic graves set in the chapel.\n\nLeaving the chapel and palace we ascended High St again till we came upon a rather quaintly built gabled wooden house of three stories. One might wonder why this house is allowed to intrude on the footpath so, but it is the\n","6":"\n\nhouse of John Knox, where he lived whilst making his great efforts for the reformation of the Scottish people, who doubtless reverence his name and his house. An admission charge by the occupier allowed one to roam through the house. Which was full of books, pictures, furniture etc used by the great reformer, and many other things of interest concerning him. After purchasing a few souvenirs from the extensive stalls in the basement we further ascended the street till we came to St Giles Cathedral, which we entered and admired muchly, the interior being much finer than the dull exterior would suggest. The walls bore many a memorial tablet of past notabilities and the heroes of the great Scottish regiments. The great stone columns were hung with tattered banners of great antiquity.\n\nBeing only a very young and amateur sightseer of course I was unable to fully appreciate and enjoy seeing the many \n","7":"\n\nobjects of historic interest as a literate person would. In the cathedral I specially noticed one of the many very fine stained glass windows bearing the coats of arms of the leading Scottish clans including that of the McLeans of Duart.\n\nFrom one corner of the Cathedral we passed through a doorway into the rather recently built Chapel of the Order of the Thistle. This chapel only a small one about 30 feet by 20 as far as I can remember was most beautiful, being built of fine sandstone beautifully carved into multitudinous arches meeting in the centre of the roof which would only be about thirty feet high. Around the room were set the most beautifully carved oak seats of the members of the order each emblazoned with the respective arms of the successive holders. One seat being raised higher than the others and taking a commanding \n","8":"\n\nposition being the right of the King of England and Scotland. By this time it was nearly one p`clock and as I wished to spend the remaining afternoon of my holiday in seeing Glasgow we walked down to Waverly and Mr Mann returned home to dinner while I caught the one oclock express for Glasgow.\n\nArriving at Queen St Station an hour later I walked over to the fine large square in front of the Municipal, buildings which were of an imposing nature. The square was largely taken up by monuments but otherwise bare looking owing partly to the rainy climate I suppose. It is remarkable the difference in the weather conditions of the two cities, Glasgow and Edinburgh.\n\nI had a very interesting walk round about the shops of Glasgow. The city in its buildings, shops, streets and planning reminded me much of Sydney which cit I consider it resembles very much as regards the “city\" part.\n","9":"\n\nI then took a tram about two miles or more out of the city to the University, the buildings of which are finely situated on the elevated parts of a large and pretty park. Time being limited I was only able to view the exterior of the main buildings and then crossed the park to the Art Gallery and Museum in which I spent a very enjoyable half hour, as it has fine collections.\n\nReturning to town, I broke the journey and walked down to the head of the docks but was not able to see much but small shipping. Once in town again I turned up the hill under which the train runs from Edinburgh and visited the Cathedral, a rather fine building but not over large. One could also see the Necropolis beyond the Cathedral. It was now fairly late so walking down to Queen St. I was in time to catch the evening express back to Glasgow and so “home\" to Mr Mann`s to dinner. That\n\n(17)\n\nEvening I spent lette writing to catch the Australian Mail to the dear ones at home. (Written at Doulieu","10":" \n\nTravelling from Edin to London one has the choice of three routes – the LNWR, the Midland and the North East coast route which latter I decided upon. Consequently the next morning after an early breakfast and farewells to my kind host and hostess, I caught an East Coast train shortly after 8 am.\n\nThe trip lay first through flat agricultural country down to the sea coast and then over hilly timbered country for some distance. Thence it lay down to the Trent crossing that wide river at Tweedmouth by a massive stone arched bridge called Berwick Bridge, this bridge lies on the border between Berwich in Scotland and Tweedmouth in Eng. \n\nFrom here on the journey lay for the first part along the sea cliffs and further inland across great stretches of moorland cultivated except where too low-lying. Long hairy fleeced sheep could be noticed but in fairly small numbers\n\n(18)\n\nThe next event of importance was our arrival at Newcastle on Tyne, crossing the Tyne. Here we delayed less than ten minutes for refreshments, but little could be observed from the station. Our next town was Durham, and the railway being rather elevated a fairly good view of the town could be obtained from the window and the beautiful cathedral of Durham on the opposite slope.\n\nWe only made a stay of a few minutes here but at the next town, York we stayed a little longer for refreshments, which refreshments nearly cost me my small amount of luggage which I left in the train while visiting the buffet. I was last to be attended to and was only able to catch the trains by jumping in one of the last carriages already almost out of the station whereas my luggage was in the front portion of the train. However settled amongst some Canadians I didn`t worry but \n\n(19)\n\nchanged again at the next station Peterborough an hour or so later.\n\nFor a hundred miles before and after reaching Peterboro the trip lay through most uninteresting, flat, sparsely populated country. Darkness fell long before we reached London about 7pm and the journey was completed with lights shaded and blinds drawn. On the whole the journey was not one of very great interest, the main object being seemingly, to accomplish the distance of over 400 miles in the short time of about 11 hrs. At no stopping place was ten minutes delay provided for one to obtain refreshments. The passengers having to content himself with a lunch basket if obtainable.\n\nOn arrival in London I went by underground to Waterloo or Bakerloo I should say and then over to the fine Union Jack Club opposite. Here I had an enjoyable meal but missed the fast (8.30pm) train to camp at Salisbury, so had\n\n(20)\n\nthe alternative of overstaying leave a day, or of catching a later train to a town Eastleigh on another line but from whence a connecting line runs to Salisbury. This latter course decided upon spending a few hours after midnight (with many mates I may say) in the waiting room at Eastleigh, and arriving at Salisbury Station about 3 am. From here a few of us were lucky enough to be able to engage a breakdown old Ford car to camp, where I arrived about 4am and promptly turned in clothes and all for what remained of the night, I might mention all this occurred on a rainy night and Larkhill was well christened “Lark Hill-on-the –Mud\"\n\nWed.8\/11\/1919\n\nIt was soon rumoured now that we would very shortly be leaving for the front and there was much discussion as to the date, which finally transpired to be much later than we had expected\n\n(21)\n\nthe training now consisted only of loading and unloading stores and route marching, But we got a disagreeable surprise when on","11":" the afternoon found us marching round and round those ancient stones of Stonehenge practising ambulance foot drill in sections, and the same preparation on Sun 12th Nov in preparation for Mon 13th when we took our place in a try-out divisional route march of 18 miles through Winterbourne-Stoke and Shrewton home again. Up till this day I had been spending my spare moments worrying the quartermaster store for my equipment. During this route march I carried all my belongings in the pack on my back. I rather enjoyed the march but was not game to say so that day.\n","12":"\n\nBy this time we had been pretty well equipped with equipment, clothing, leatherjerkins, gas masks, identity discs iron rations, field dressings etc etc ready for the front.\n\nOur next experience was rather a pleasant one except for the two days of extreme cold preceding it – a snowstorm\n","13":"\n\nWe had great fun snow balling building snowmen etc but the fall only lasted a day and left a thickness of three or four inches. Consequently it soon thawed and the result was real slush. About this time everyone was very busy letter writing and packing his luggage to put in his kitbag to be stored by headquarters London or to send to a friend or to take with him in his “pack\" or valise in which case it must be according to a certain list.\n\nI wrote to all at home and sent my personal belongings and camera to a friend in London – Mrs Milligan. During the last week in camp 3 Lark Hill, Salisbury Plains, I made many trips into Salisbury to obtain some photos of myself, which however failed to obtain and they had to be sent home direct, and I heard later were much liked by the homefolk. During the last few days is was a work of art to reach the city as no leave could be granted anywhere.\n\n(23)\n\n(Written","14":" at Lestrade, a very small village about four \n","15":"\n\nThis is a memorable day in many lives, including that of your humble servant. For on this day we left Eng for the front. Reveille was at 3.45 am breakfast 4.30 and the “Fall in\" sounded at 5.45. no one was absent .\n\nAt 6 am. we moved off and marched the three miles to Amesbury Stn. With our “packs up\". It was fortunately a nice cool morning. By about 7.30 we had entrained with all our transport horses and wagons. We were not delayed long and by 9am had made a quiet train trip through Southampton down to the docks where we disentrained and unloaded our packed wagon onto a covered shed by the wharves. We were then marched to another covered wharf and here in company with a large number of our infantry , and some men returning from leave, we spent the remainder of the day.\n\n(24)\n\non the wharf and we were able to obtain hot tea and buns. No one was however, too financial after his leave and leaving expenses. I was not considered poor with the sum of 1\/8d. We finally fell in and about 5 pm and embarked together with other units of our division, upon a former cross-channel paddle wheel ferry boat “The Monas Queen\".\n\nShortly after dark we slipped out of harbour and with all lights out the little vessel faced the channel with her precious human freight. Each man wore a lifebelt and the vessel was crowded to its limit. It is speaking lightly to say the journey was a terrible ordel to almost everybody on board. Men who were reckoned as good sailor were seasick. Strange to say I contrived to remain at the “squeamy\" stage. The weather being rough cold and rainy the troops were obliged to remain below, where an unforgettabale scene of tired, seasick men packed together between the kits was presented.\n\n(25)\n","16":"\n\nHowever we reached our destination safely and the shores of Le Havre was a welcome sight indeed. It afterwards transpired that on this night the Germans had made a determined destroyer raid on the Channel but was defeated. \n\nWe soon disembarked about 7 am fell in on the wharf and had breakfast, and then marched about a mile along the shore to the rest camp. We thus saw very little of the city which was out of bounds to us. During the evening attended a very interesting lantern lecture given in the YMCA attached to the camp. The subject was the towns of Northern Italy – the very ones which have now been menaced by the enemy invasion .\n","17":" \n\nThis day , the following, we entrained at a station near the camp. We were amused if alarmed to see our “carriages\" arrive. They were cattle trucks marked “Chevaux 8, Hommes 36-40\" which being interpreted means that eight horses or 36-40 men and their kits could be packed inside. Fortunately the number only averaged about 32-34, but then we\n\n(26)\n\nwere unable to lie down. The journey commenced about 4 pm, and lay firstly over hilly and pretty country then up a long valley to Yvetôt. From here the line ran through prosperous agricultural country, till it descended to Abbeville, on the Somme River. But to be more detailed – The first evening the train passed Rouen and about 9 pm evening the train stopped at a small place called Abouchére and here hot tea was provided for us. Later in the evening we passed through Amiens then travelled all night and\n","18":" stopped at Hangest sur Somme for breakfast – tea and biscuits, jam and cheese, as usual. Then we passed Abbéville. From here on the journey lay through poor low coastal land through Etaples and Boulogne nearly to Calais where the line turned inland. All these towns were passed in the darkness as also was St Omer with Hazebrouck at daybreak and morning on\n","19":" found us only too ready to disentrain at out destination – Bailleul, Here we \n\n(27)\n\nCleaned out our “carriages\" and unloaded the transport wagons from the trucks. Then we were taken by motor buses (formerly of London) out about three miles to the fair sized village of Steenwerck. (This village is less than a mile away from the place of writing). \n\nHere in this village we ran a brigade hospital for three days. On the second day one section moved up to Armentieres by route march and took over an advanced dressing station and then the regimental aid posts in the line which our infantry was occupying. The next day I marched with my own “C\" section up to Pont de Nieppe, a village on the Bailleur – Armentieres road and beside the River Lys, where we took over the divisional baths on Tuesday 30 November.\n\nThese baths were arranged in a large dye works beside the Pont de Nieppe and were capable of bathing 1500 men in one day. Here each man would receive a hot bath in one of the huge vats and a clean towel and change of underclothing, his uniform being, in the meanwhile \n\n(28)\n\nwell brushed, and cleaned of vermin where any, by French girls employed from the locality. The washing of the underclothing was also done by girls with scrubbing brushes and washing machines. And the drying was effected by hanging the garments on racks in large drying rooms which were then closed and heated by steam pipes running throughout. Before drying the clothes were freed from most of the water by being put through hydraulic presses. The two latter operations were carried out by our men. The French girls earned about 3 francs (2\/6) a day but had to work hard to complete a certain number of articles each day. \n\nMany of them spoke patois and many Flemish and of course none were too genteel, but still some very ladylike. These baths are about the biggest I have seen but divisional baths are placed all along behind our lines. They are called divisional but no division excludes men of other units.\n\nWritten","20":" at Ravelsberg Nr. Bailleur, France.\n","21":"\n\nAt these baths I was only a week and was then sent for from our main dressing station in Armentieres to take the place of the dental orderly who had been evacuated to hospital with bronchitis.\n\nSoon","22":" I was relieved at the baths and then marched with kit up across the Lys by the Pont de Nieppe, across the stretch of level into Armentieres to the billets of the ambulance at the Institute St Jude`s (Roman Catholic School). These buildings were practically undamaged by shellfire except for broken windows and formed very clean if cold billets. \n\nThe next morning I commensed as dental orderly for Lieut Satchell in the Maternity Home a department of the large Hôpital Civil. This home formed a very fine main dressing station for our ambulance containing as it did a very fine operating theatre with a ward for patients on either side as well as some smaller rooms. This place was about two and a half miles from the front line which was then very quiet.\n","23":"\n\nThe town of Armentieres had a pre-war population of about 25,000. It was apparently very prosperous, being one of the smaller towns around Lille, the great iron and manufacturing centre of northern France. It also has large jute factories of its own, and of course large breweries. The town is set on flat ground partly beside the wandering Lys River or Canal. It seems to consist of an old and a new part and is on the whole a comparatively pretty town with its college quarter, modern commercial quarter and a few parks and avenues.\n\nOur division was holding the whole of the Armentieres salient. Our ambulance working with the infantry holding the right half of the 3 sectors. Thus we spent our first Christmas in France, most of the men being in the billets at the Institute St.Jude. Here on Xmas day the fatigues were few and the mutual greetings many. During the morning each man received from the Co`s hands a card board box of comforts and a fine plum pudding from the Aust. Comforts Fund.\n\n(31)\n","24":" dinner and tea were very merry, the rations being supplemented by a lot of luxuries further provided by the Comfort Fund, also by plum pudding provided by the London “Daily News Plum Pudding Fund.\n\nA few days after Christmas the dental orderly returned so on","25":" I packed up my kit once again and walked back to P.de Nieppe baths. Here my job was with another man to rinse in clean water all the clothes washed in the laundry. It was a muscle developing job alright and lasted till","26":" when our section becoming duty section at the main dressing station I was sent there and acted as rifle cleaner, cook`s offsider gas picket and surgical ward orderly till","27":" when we were relieved and returned tot he baths at P de Nieppe. \n\nHere I was one of the “sanitary experts\". We were beginning to wonder whether we really were soldiers, when on","28":" our turn came to go up the line. We marched first to the Mds and then to our left a`ds (Advance dressing station) at Chapelle Armentieres, about half a mile out \n\n(32)\n\nof the town towards the line, which was about a mile distant as the crow flies, but by the communication trench which ran past the a.d.s.to battalion headquarters and the regimental aid post and then thro` the subsidiary and support trenches it would be a mile and a half.\n\nThe dressing station was established in the tunnels of a large brick kiln some tunnels on the far side were used as a mortuary managed by Tommies unfit for active service and the tall chimney stack was used as an artillery observation post by our division`s 18 pounder batteries and others. No Geneva cross was exhibited to the enemy but he certainly knew the purpose for which the kiln was used. Here were stationed a medical officer (M.O.), some tent subdivision men for dressing the wounded, two men for cooks, and twelve men to do the stretcher bearing and fatigues. The latter are always made to form a very important part of military life. \n\nAs one of the twelve bearers I spent each third day and night\n\n(33)\n\nwith three others at the only regimental aid post to bring down the wounded brought into the aid post by the regimental stretched bearers (infantry). Here we lived in one of he ruined houses in the locality known as Square Farm. One room served all purposes. We each had a spiral spring bed souvenired from the surrounding ruins. On going up each time we took our rations with us in a sandbag. Sometimes fresh meat was included but generally it was “maconochies (or) tinned cooked meat and vegetables) and bully beef in 12 oz tins. These we cooked on a small French stove (also souvenired) and to obtain fuel we had to search most long and diligently among the ruined houses.\n\nOur chief occupation was playing five hundred on a semicircular table placed over the French stove so that we could keep warm. Of course the life had its grimmerside and very few periods of twenty hours passed without our having to carry (or wheel by road round “Suicide Corner\" three or four wounded","29":" Brigade men\n\n(34)\n\nThis was about the normal number of casualties, occurring mostly at \n\nNight (when the opposing troops were on the alert). For our division had\n\n“spoilt a good home\" according to the Tommies and fairly frequently raided\n\nthe enemy trenches, always entailing heavy casualties such as fifty out of\n\neighty men sent over. These men were specially trained and were know as\n\nraiders, receiving concessions in other matters and a good rum issue after \n\nthe stunt.\n\nThese raids usually took place about midnight and were generally proceded\n\nby about 10 minutes barrage fire from our guns to cut the barbed wire in front\n\nof the enemy`s trenches and prevent him from reinforcing his front line.\n\nUsually however he was content to retire to the cover of his strong dugouts\n\nand leave his artillery barrage to contest our mens advance and catch them\n\non the their return over no mans land. This stretch was mostly from 150 to\n\n400 yards wide. \n\nMyself only saw it from the\n\ná\n\n(35)\n\nFront line once and that was only when out for a walk. To deal with the casualties from raids on our small sector we were always reinforced by more men from the billets in Armentiéres. We usually took the patients down from the R.A.P. to the ADs along a cobbled road the stretcher being clamped on a pair of wheels for the purpose. On this road we had to pass a part known as Suicide Corner and we were inclined to fear this corner owing to its liability to machine gun fire (and its name I suppose). Anyhow we always hurried round it. If a shell burst within a hundred yards we thought it was a near thing. Now we realize what a safe place it was. Before we only realized how comfortable.\n\nWell these are stretcher bearers doings in quiet times, much different to working through the gas at Messines and the mud at Passchendaile. However.\n\nAt our ADS we lived rather comfortabley in the dark tunnels at the brick kiln. The only trouble was the terrible frosts which froze the beautiful snow and everything\n\n(36)\n\nElse including the pumps in all the houses in the neighbourhood. One of these mornings in the heart of the severest winter for seventeen years, with the 15-20º below zero, some of us, including my dear self were given pack drill for not having shaved!\n\nOur great comfort at this place was the coffee stall which consisted of a table, a soyer stove shielded around by galvanized iron. This place we took in turn to keep going and being supplied with cocoa and milk and biscuits by the Australian comforts Fund, were able to give to each man passing along the communication trench a tin of hot cocoa, and a handful of biscuits to cheer him along. It was a great institution especially for working parties going in to the line for the night, and also for the A.A.M.C. residing on the spot on bringing “cases\" down. Also wounded men were also nourished with cocoa or Bovril when their wounds would allow it. \n\nWritten at Westhof near Neuve Eglise `B` on 9-11\/2\/18\n\nAt this time the ambulance was \n\n(37)\n\nworking another A.D.s. as well taking the wounded from three three r.a.p`s. This ADs was known as the “right\". It was situated in a house in Chapelle Armentieres beside a ruined brewery. The ambulance cars also came to this a.d.s. to remove the wounded to the m.ds. After I had spent seven weeks working from this a.d.s, our division being relieved by Tommies, we were recalled to our billets in Armentiéres, that was on","30":"","31":"\n\nHere we remained waiting for further moving orders for nearly a week. Before this the town had been shelled a few times and some of the shrapnel had burst over the billets scattering the cooks in great haste. Also on a number of occasions we were warned of gas attacks, and ordered down to the cellars made gas proof with blankets sprayed with phenol hexamine. Here we would sit dismally with cases of iron rations, water and picks and shovels quite handy. It was orders which we did not appreciate, and fortunately only occurred a few times. \n\nWell on","32":" after several “round ups\" to induce the men to part \n\n(38)\n\nwith their accumulations of personal effects, we fell in and marched with full kit back out of the town along the main road to the coast to Pont de Nieppe. Here we were billeted in part of a communal school supplemented by huts, and in the other part used to run a main dressing station. The part used for billets was in the same grounds as a part used as a school for little boys, it was very interesting and sometimes amusing to watch them at their work and play. Both seemed to be run on similar lines to ours in Australia. The teachers were a grey headed old man and a young boy in knickers, illustrating the man power question in France. This school was situated behind the large village church which stood in the centre of a square. A few of the houses facing the square were of ill repute and many were the jugs of coffee our piquets accepted as “protectors\" of the same houses, altho` their attitude might have been doubtful if an occasion had arisen.\n\n(39)\n\nAttached to every church I have seen has been a public men`s urinal. A peculiar place indeed, but not unseemly according to the ideas of modesty in this part of the world. The urinals are usually iron arrangements just screening the user`s body but not his head or feet. In fact they are almost regarded as superfluous, by the civilians of course and many walls such as breweries bear in large letters “Defense d`uriner\". This is mentioned in a spirit of common sense.\n\nImmediately on arrival at Pont de Nieppe we took over the work in the line. This was the next sector to our old one and extended from the River Lys to the north of Ploegsteert Wood which was completely on our side of the line and slightly south of Messines, then in enemy possession.\n\nI remained at Pont de Nieppe for the next two weeks. During this time we received further training in drill and route marches under our section commander Major Honman. Otherwise we were employed on fatigues. On","33":" we were surprised to hear shells fall in another part of the village. We were saddened at\n\n40)\n\nthe result. The high explosive shells had landen in a side street and killed a woman and her little son and a young woman together with her sweetheart a Belgian soldier on leave for their marriage, a little girl and also three British soldiers all tommies. It was a very sad site and made many Australian lads think of their own mothers and wives in a unravaged country. \n\nWe had another experience of","34":" when a number of large shrapnel shells came over and burst near our billets. Our C.O. immediately ordered the gas masks to be worn at the alert and “tin hats\" or shrapnel helmets rather to be put on. Fortunately there were no casualties, except one of our men was hit in the wrist.\n\nOn","35":" my twin came to go “up the line\" and we were taken by motor ambulances up to the A.D.S. called Charing Cross situated on the road a little towards Messines from Poegsteert village, and on the fringe of Ploegsteert Wood.\n\n(41)\n\nPloegsteert is a Belgian village formerly of 7,000 inhabitants but now deserted and almost demolished. The a.d.s. at Charing Cross consisted of a sandbagged house used as storeroom, mess room, and kitchen, a strong concrete dugout built like the interior being like so in cross section made with great arches of elephant iron a kind of very very heavy corrugated iron, cross section thus iron brackets being set along each side of the dugouts, which were about forty feet long to hold stretchers. The remaining part of the ads was the men`s billets, sandbagged “lean\" tos in the forest and roofed with corrugated iron. The concrete dug outs were reserved for dressing the wounded and for officer`s quarters.\n\nThe same day I went up through the forest to one of the r.a.p`s and joined Alf Henderson and Bill Pearson at Dead Horse Corner – for that was the delightful name of our locality. There really was a horse`s skelton near by. In fact the skull was suspended from a tree. Another civi? near by was a dud (unexploded)\n\n(42)\n\nwhizz bang (about 12lbs) shell which had struck a slender tree and lodged in the centre of it with the nose cap showing one side and the base the other. Here in our dugout made of sand bagged elephant iron we lived very happily not often worried by shells and below the level of flying bullets. \n\nWe went down for our rations and mail daily and did our own cooking on a brazier, fuel-coke and charcoal being issued for it. At first we had two New Zealanders with us, as it was their division we were taking over from. Their rations were always almost lavish and we were able to “live well\". “All N.Z. soldiers are nice chaps\" is almost a saying in our","36":" Aust Division which holds them in great regard. \n\nThe wounded not often many in number and usually coming in at night were conveyed down to the ads through the forest on a light railway passing the r.a.p. \n\n(43)\n\nPloegsteert forest is, or was a well kept oak forest about 1¼ miles long by a mile. It was evidently used as a hunting forest, whom by I don`t know, but some say by King Albert. Of course all forests are put to a commercial use by cutting trees and undergrowth methodically.\n\nThe trees were much damaged by shellfire but not by the troops who were forbidden to do so by prominent notices. It afforded excellent cover for our approaches to the front line, many duckboard tracks leading hither and thither through the forest where otherwise trenches would have been necessary. According to Sgt SR Crooks (brave man now dead alas) arrangement we spent four days at each of the four r.a.ps with two days in between each down at the ads. So I spent the","37":" and","38":" at Charing Cross and then on","39":" went up to Rifle House where conditions were much the same as at Dead Horse. Both places were about 500 yards behind the front line near the “second support\" trenches. Our reveille was usually about 9am then two would do the “housework\" and two go down to the ADS for ratio and fuel.\n\n(44)\n\nthe pairs (usually mates) taking it in turns to take down the stretcher cases or serious walking wounded cases. It is not the part of the AMC to handle any dead whose bodies here were taken down by the battalion pioneers to the cemetery near Charing Cross.\n\nDuring the four days at Rifle House I walked to Wantage Hall another RAP a rather fine concrete dugout with a battalion canteen alongside. Canteens near the line are great sources of convenience and comfort. On","40":" while here we witnessed an aerial combat between one British battleplane and four enemy scouts, as a result of which our machine was driven down in flames in our lines one airman being killed and the other severely injured. At other times we saw a \"Fritz\" brought down burning by our “antis\" or “archies\" (anti-aircraft guns) and ours and the enemy balloons set on fire by planes.\n\nThen I returned to Charing Cross for two days fatigues etc and on","41":" went up to the remaining\n\n(45)\n\nr.a.p., Prowse Point. This was the most dangerous post of all and while here our infantry raided the enemy trenches, and our trenches including our own “possy\" were properly strafed by the enemy guns. Also we had to work hard all one night pushing trucks up and down the line. One day we saw a 42 inch shell strike the crest of the ridge about ¼ of a mile away and ricochet upon the rocks which caused it to come in our direction and lodge almost at our feet. Needless to say it was a “dud\" and it had not been there more than 10 minutes before someone shouldered it and was walking off with it till stopped by an officer going into the line .\n\nOn the last day of my four days here I was obliged to report sick with influenza and was sent on","42":" by Major Horiman into the mds as a patient. Here in Pont de Nieppe I spent a quiet six days in bed, that is , on a stretcher set on trestles and was well looked after and soon cured. While there I was glad to receive some parcels from home and do some letter writing.\n\n(46)\n\nThen on","43":" April, being discharged cured although just out of bed, I shouldered my kit and walked back to Charing Cross ADS, about four miles. I did not report at out billets as I preferred to be back in the line to doing fatigues. I might mention that at this time our ambulance was also running two other ads`s – Old Brewery and Motor Car Corner each with their own RAP`s.\n\nTo these three ads`s the ratons were brought by one of our g.s. (general service) wagons. A couple of times I had been out with it to look after the rations. On the","44":" when the cart was going from “Old Brewery\" to “Charing Cross\" a shell lobbed on the cobbled road behind it killing our three men in the wagon immediately. They were Jimmy Bridson the driver and Cpl Gus Dyer (pack store corporal) and Ernie Porter of the quartermasters store. All were original","45":" Field Ambulance men. This accident cast a gloom over the remainder of the ambulance as these were our first serious casualties and two of the men`s brothers were in the unit\n\n(47)\n\nOn","46":" at Charing Cross we saw an enemy plane brought down in flames by our shrapnel. A nose cap fell a few yards from me. Needless to say it isn`t pleasant to hear one falling seemingly on one`s head. The same day I went up Wantage Hall RAP., and hear enjoyed the quiet life away from the 18 pounders near the ads. One night we were told to stay up as the royal engineers were going to put gas over from the front line and our infantry were to follow it over in gas masks later. However it did not come off owing to unfavourable wind. The use of cloud gas is very limited.\n\nOne day I noticed a pheasant in the forest. There was plenty of small bird life despite the crashed of shells resounding through the forest. Later in the warmer weather their song was very pretty and cheerful. I suppose the birds chance of safety is nearly as good as that of the innumerable large rats found in trenches. It is a great sport – rat shooting with pistols.\n\nOn","47":" we were relieved by the","48":" Field Ambulance. Our ambulance had been in the line since our arrival in France although\n\n(48)\n\nonly two ambulances out of the three in the division had been used at a time for working the line.\n\nDuring our absence at Charing Cross our MDS and billets had about","49":" been removed from Pont de Nieppe to Pont d`Achelles a collection of houses forming a tiny village on the road midway between Pont de Nieppe and Bailleul. Here on","50":" on our return to billets from Charing Cross ADS we found the remainder of the ambulance organizing a corps main dressing station in a large collection of newly erected Nissen huts and Nissen Hospital huts. This work included the building of a road through the dressing station to accommodate ambulances especially when patients were being loaded or unloaded. We were soon fully employed cracking stones, carting bricks etc for the road also whitewashing, washing huts, pitching marquees etc etc. All this was in preparation for a battle we all knew would soon take place.\n\n(49)\n\nPm","51":" we received rather a surprise about 10pm. The enemy shelled all the roads heavily and a few shells falling near our dressing station we were ordered to evacuate all our patients not then numerous into the fields and stay there. On another occasion the gas alarms starting from the line were sounded and we evacuated our dressing station again and spent several hours out in the fields waiting for the gas which never came, it being expended. Some of the men however went to sleep and spent the night in various barns.\n\nHere at Pont d`Achilles Main Dressing Station as it was then called, we worked industriously for over a month every day but every evening we gave (or forgot to give) our names to the orderly sergeant and went out. Sometimes we boarded a passing motor lorry and went into Bailleul sometimes we walked to Steenwerck to hear our own Divisional Pierrôts the “Coo-es\" or to Nieppe to hear the “Kiwis\", the pierrots of the N.Z. Division. These last pierrots were really splendid, undoubtedly the best we\n\n(50)\n\nhave ever heard in France. They even carried a splendid string orchestra of about ten or twelve members. It was a fine social treat to hear them.\n\nOne evening returning from the show about 8.15pm we witnessed an unsuccessful attack by a Fritz aeroplane on one of our balloons nearby. At the same time we had the satisfaction of seeing one of the enemy`s burst into flames and two of his planes brought down the same evening. A burning balloon is seen for many miles. It burns for only a minute or two and then all that can be seen is a column of smoke in the sky and a dark object, the basket falling earthward. Immediately a balloon is attacked the two occupants always descend in parachutes which being white show very plainly in the sky. These parachutes although not opening very quickly and giving the user a long drop before they do, descend very slowly and are carried on the breeze quite without control. In a breeze the poor human hanging from them swings like a pendulum. \n\nOur balloons were very thick, being\n\n(51)\n\nabout half a mile apart.\n\nOn","52":" we were very sorry to hear that our late section commander Major A.V.Honman had been found dead as a result of gas in the RAP of the 37th Battalion to which unit he had gone from us as RMC. He was a most just and fearless officer. On","53":" I went with one of our working parties to sandbag our new ADS. This ADS known as the Advanced ADS was situated on the Ploegsteert – Messines Road as it ascended the side of Hill 63. It was composed mainly of two very strong concrete dugouts built into the side of the hill by our divisional engineers. It was planned like this 1 and 3 dressing rooms, 2 and 4 MO`s and dressing orderlies living rooms, 5 and 6 S.B`s sandbagged dugouts 8 trench, 7 cookhouse and 9 sandbag barrier.\n\nThe day before this a large dump shown had accidently been exploded with about 80 casualties. From","54":" to","55":" our battalions raided the enemy almost continuously and 15 men of our ambulance were \n\n(52)\n\nrequired to render assistance. The casualties were fairly heavy. These raids were mostly in daylight or semi daylight. The New Zealand division was on our left facing Messines. On","56":" all the bearers of our ambulance were fallen in at Pont d`Achelles ready to go up to the line. We were inspected to see we had our gear complete, shell dressings and identity discs, and the C.O. made us feel like lambs for the slaughter by saying he knew we would do our duty and wishing us Goodluck. On these nights it being summer time it didn`t grow dark till 8.30 although the clock had been put back one hour since about April 1st.\n\nDuring the last few days the enemy had furiously bombarded the village of Pont de Nieppe causing about 200 casualties, mostly to civilians. Many civilians had already removed with their goods and chattels from all the surrounding villages but some had remained. Well at 6.45 pm on","57":" we fell in and marched carrying stretchers up through \n\nRomarin village out along the road to Ploegsteert. The vicinity\n\n(53)\n\nof this road had been the scene of much activity for some time, and now on the eve of the battle fairly bristled with guns, some with gunpits but most with only camouflage screening. Light railways from the road had been used to accumulate great long piles of shells laid side by side. Already many guns had been knocked out and a lot of ammunition blown about by enemy fire. On reaching Charing Cross ADS we were detailed to our various squads. Most of my section were held in reserve and sent to LeTouquet Berth post for the night. I was detailed with 7 others, four of another amb and 3 of ours to bring any stretcher cases arriving at the Advance ADS, which was intended for walking cases only, down to Charing Cross A.D.S.The advance ADS on the Messines Road was half a mile behind our front line and therefore this work was not very advanced but it was not the safer for that for this stretch of road particularly the Germhuns shelled heavily as it was of such importance.\n\nWe reached the ADS about dark and had a few hours in the dugout but shortly after midnight on\n\n(54)\n","58":" the cases commenced to come in. at the same time the enemy commenced to bombard the whole area very heavily with gas shells. My mate and I took the first case, wheeling the patient on a pair of wheels as gently as possible. We passed several men lying killed on the roadside and several horses, and then coming on to the level ground had to wear our box respirators to save being gassed. Here the road was strewn with boughs from the trees, a few wrecked wagons and other war material. The whole was permeated buy the sickly minty smell of the gas.\n\nFrom then till about 5.30 am I worked hard going and returning on that half mile trip. Then a number of walking wounded requiring a guide, I was sent down with a mate and asked for to show them to a post near a farm called the Piggeries. Where it was I only had a dim idea. There the wounded were to board empty ammunition light railway trains returning to Canteen Corner from which a half mile walk\n\n(55)\n\nwould bring them to our Pont D`Achelles Corps Main Dressing station which was now run by a tent subdivision from each ambulance of the 3rd and","59":" Australian and the N.Z.Division. Well after a long search around the forest in the dark (except for the flashing of the guns roaring in our ears) eventually located the loading post and left the patients there. My mate and I had just started to return when the whole district seemed lit up and one tremendous roar announced the opening of our barrage. It was 3.10 am . At the same moment the numerous mines laid by us under the enemy positions at Messines and other places were exploded, but we were among the very few who did not feel the tremendous concussion, being too confounded by the inferno of guns around us. \n\nOn our return we had to deliver a message to Red Lodge the N Zealand ADS. This place we managed to find and returned to the ADS. From then till 2 pm I was working consistently wheeling or carrying when no wheels were available wounded down to Charing Cross. The morning was\n\n(56)\n\nmarred for us by one incident . A salvo of small H.E. shells probably three or four, lobbed on the cobbled road just in front of the ADS, killing 3 men and wounding three including two of our men – staff Sergt Dispenser J. Hosking and Pte J. Waddell. These two men were so seriously wounded that they later succumbed, Pte Waddell at Pont d`Achelles CMDS (where lies his grave) and Staff Hosking at the CCS.\n\nThe Shells fell at the point marked x on my diagram. At the time I was standing at the figure 8, fixing up a box respirator to replace mine I had given to a patient and the concussion caused me to nearly break my jaw on the tin of the respirator. Seeing the smoke of the explosion and knowing there must be casualties I immediately rushed out and three of us Freddy Lee, N. Allawdice and myself aided by a padre, managed to free the wounded and place them on stretchers. The poor chaps were given every chance possible but only one survived.\n\nMeanwhile our infantry advancing to the attack with the barrage at 3.10\n\n(58)\n\nThen after daylight I took some stores up to Cook`s Way Aid post. During the day our infantry beat off two further counter attacks. The wounded were mostly collected to Ploegsteert – Messines Road and brought back along it by the Field Ambulance SB`s some on wheels,a nd some by carrying. The road was shelled a little but not much. The enemy had evidently relied upon gas shells to smother the attack. During the nights of","60":" and th June he sent them over in tremendous numbers. \n\nThe next three days the","61":" 10th, and","62":" I spent on the same work but not at the same pressure. The next day","63":" we were relieved at the ADS by the New Zealanders and returned to Charing Cross. From here the cars took us a tired irritable lot back to the CMDS at Pont D`Achelles. Here we had dinner and a rest before moving on. There was a YMCA stall here dispensing free drinks and biscuits. I sent a note home thro the YMCA. I must not pass on without mentioning the fine work of the YMCA\n\n(59)\n\nduring the battle of Messines. Our advanced ADS can be taken as an example. Here there was a coffee stall for nearly a week. There was always hot cocoa or coffee and rum biscuits and cigarettes for all wounded men and passers-by, also f.amb stretcher bearers. The supplies were partly YMCA and partly Austn Comforts Fund. There was a YMCA representative there but the place was really run by four of our divisional pierrots, detailed for the purpose. \n\nWe did not remain at the CMDS long but at 3pm fell in and marched about 2½ miles to a camp near Westhof Corps Main Dressing Station “where I now write, only that it is now a rest station\" called Hillside Camp. After tea I went for a walk with Freddy Lee around the hills behind the camp and up to Neuve Eglise. From these hills the view of the level country below is rather fine. The next day","64":" we were supposed to be resting but in the afternoon I jumped on a motor lorry and went into Bailleul. Here we had a “feed\" and I bought some hand made lace to send home. We saw the remains \n\n(60)\n\nof an ammunition train which the enemy had observed and shelled. Some of the shell craters were about 40 ft across and twenty deep. We also sae the aerodrome just outside Bailleul. The number of machines there was then very large, including a large number of fast mounting triplanes used by the R.N.A.S. service.\n\nBailleul is an old town of prewar population of about 13,000. It occupies the crest of an isolated hill and is on the main road from Lille to the coast at Calais. This town has a very quaint town hall built in the 16th Century and a rather fine large cobbled square. Otherwise it is rather mean and squalid. Nowadays however it is of fairly considerable military importance and is a great rendezvous for officers. The old inhabitants make the Bailleul lace. Otherwise the town seems to have few industries, but it is of course the centre of an agricultural district. A YMCA hut and cinema is established there and a hall always houses the pierrots of some division.\n\n(61)\n","65":" At 10.30am we fell in with full kit and marched from Hillside Camp down into the flat country of Northern France to the village of Doulieu a distance of about 7½ miles. Here we were billeted in two large farms not used to their full extent owing to the shortage of labour. We slept on straw in the barns except on fine nights many of us slept out under the fruit trees, the night being very warm. The only trouble was mosquitoes. Of course there were plenty of frogs in the moats round the farm houses.\n\nThe remainder of the 9th Brigade were billeted round about and we were resting after the battle. In our unit we had very few parades and no early ones. Just near our billets was a barber`s shop run by an enterprising woman and here we could get a wash for 1d and a shave for 1½ d. Another experience was to have your morning paper delivered to you in your al fresco bed before rising in the morning. Some class eh!\n\n(6?)\n\nOur farms where we were billeted were about 10 minutes out of the village. The village was only a small place but boasted a large church or rather what had been a fine church, for it had been burnt completely out by the Germans in 1914, and only the walls and square belfry tower remained. The day after our arrival the 15th June 1917 we fell in at 10.30 and marched down to an assembly ground in the village. Here the 9th Brigade was formed up to be addressed later by Brig Genl Jobson, commanding the brigade and then by Lieut General Godley, commanding the","66":" Anzac Army Corps to which we belonged. The latter complimented the brigade very highly on their part in the battle, saying they were given the right flank as a difficult post post of honor. He congratulated the men who were put forward by their cols as having done especially well. Among them Jim Prentice, sgt of the Brig Signal Section.\n\nIn the afternoon we went to see Jim who was feeling very pleased. The next day\n\n(62)\n","67":" we had a kit inspection in the morning and in the afternoon were driven to the baths! – in the horse ambulance wagons.\n","68":" I was detailed as cooks fatigue for the day, and of course\"wacked into their stores while the going was good.\" We received a big mail from Australia dated 15th April and there was much uplifting of spirits.","69":" in the morning I was cooks rouse about again but in the afternoon walked with Charlie Hamblin and Alf Henderson five miles into the town of Merville passing through the villages of Neuf Berguin on the way. Merville is a town of about 10,000 inhabitants. it is not so much affected by the war as many, although it is used as a military centre especially for casualty clearing stations. From these the wounded are taken down to the base hospitals and specially fitted hospital barges along the wonderful canal systems of N France. Our first act was to procure some dainty afternoon tea. Then we felt fit for a very enjoyable swim in the canal just outside the town. After our swim\n\n(63)\n\nwe strolled up the town for a look round. Our attention was taken by the church which is a really fine massive sandstone structure, so unlike the usual style of French town church. We went inside,as is always allowed to any but the misbehaved, and admired the interior also very much .\n\nThe church contains a very large pipe organ set over the entrance. The pulpits and confessionals were of beautifully carved oak and the altar rails of finely wrought brasswork. Of the three altars or sanctuarys one of the smaller was set in the colours and markings of royalty. I would very much like to know its history as such a thing is almost unknow in republican France. By the coloured glass windows one could trace the history of the church back to about the year 1000 ad when it was burnt down and beyond that to earlier times.\n\nAfter leaving the church we went through the town down to the main canal and saw some of the locks. These were very interesting, as were the cantilever balanced steel bridges used over the canal. However it \n\n(64)\n\nhad become very showery, so after buying some view postcards we made all haste to return to camp which we reached a bit wet but quite happy. \n","70":" I walked into Doulieu in the evening after reading a budget of letters from home 29th Apr. \n","71":" in the morning a padre came along and held a communion service which I attended. In the afternoon I walked into Douleiu village and had a yarn with Jim Prentice, then on to the YMCA where I spent the afternoon writing home.\n\n(Written 19\/2\/1918 in a captured German pill box near Messines, a relay post)\n","72":" We fell in at 9.30 and marched with full kit back to Westhof Corps Main Dressing Station and took over there. This dressing station was like the one at Pont d`Achelles about 2 miles away built for the Battle of Messines and composed of Nissen huts and Nissen hospital huts. It was run by the New Zealanders and Tommies. Here we were camped in some of the large marquees floored with tarpaulins and painted in strange colours to avoid observation. \n","73":" It rained hard all day \n","74":" The enemy took advantage of \n\n(65)\n\nthe clouds to raid our balloons with a flight of five or six aeroplanes. He succeeded in setting three on fire and causing \n\nthe observers of about 8 balloons to descend in parachutes. Later however our anti aircraft guns brought down one enemy plane which fell near Steenwrck killing one occupant and wounding the others. I went down to see it, but by the time I reached it quite a crowd had collected from all directions and were giving the military police a lively time in keeping them back. Already the machine was well stripped of everything moveable for souvenirs. I contented myself with a piece of brass from the radiator. On my return journey home I called in to see George Prentice in their horselines at Le Seule\n","75":" I was on sanitary fatigue but in the afternoon went down to see George Prentice and we both went along\n\nthe YMCA singing and church service in the Warkoto (NZ)YMCA hut. In the morning Fritz had destroyed another\n\nOf our balloons. \n\n","76":" On sanitary fatigue again but after dinner I sneaked\n\n(66)\n\noff with a chap named Rosenthal, and together we boarded a passing motor lorry going into Bailleul. Here we jumped \n\non the back of another one which took us at a fair pace, through Bailleur to the large village of Strazeele. Here we were \n\nturned adrift and set out to walk to Hazebrouck, happily, however another lorry came along after we had gone a couple\n\nof miles and this one took us through the villages of Paraddelles and Boral to Hazebrouck. \n\nHazebrouck is a fairly large railway town nearly as big as Armentieres was. It boasts two churches, both built and \n\nornamented in the usual cheap and tawdry style, but with tall spires. Both had fine pipe organs as is also \n\nusual and D`Eglise de Sacre Co contained beautiful oak carvings for the altar rails and confessionals. Hazebrouch is\n\nsituated near the large commercial forest of La Motte where some of our men were stationed attending the Australian \n\nOfficers Rest House. Hazebrouck also has a very fine large market square – and facing it a rather imposing building the\n\nMairie or Town Hall. We spent \n\n(67)\n\na couple of very pleasant hours looking around Hazebrouck, and then after a nice tea, walked back to the main road and caught a lorry going to Bailleul, from whence we had to walk home to Westhof. We had had a very pleasant if unauthorised, excursion. I bought some views to send home. The next day","77":" I was occupied as cooks fatigue, but in the evening some of us walked about a mile and a half over to a wood where some tanks were parked. Here we found about 40 tanks which had taken part, so we were told in the battle for Wytschaete Ridge, they were lined up under the trees out of sight of enemy eyes. We were permitted to have a look inside them at the big petrol engines, the two small howitzers, the Lewis guns and racks of ammunition and the pilots seats and controls. We were also able to see a few on the move and the visit proved a very interesting one as we had never seen them before. The previous day they had been inspected by the King and Queen of Belgium.\n\n(68)\n","78":" For the past week I had been employed on various fatigues but mostly as cook`s offsider, peeling spuds, washing dixies, filling the hosters,,stirring the sago and so on. On this day our (C) section took over the M.D.s (it being no longer a corps M.D.S.) and I was detailed as offsider in the dispensary where I spent the next week from 8.15 am to 8 pm (more or less) sweeping out the place washing bottles, annoying the staff sergeant dispensers or running for their water for coffee, or writing up my diary as on page 10. Of course I knew enough about the drugs to fix up many of the customers.\n","79":" On this day we heard that Major General Holmes had been killed near Khandahar Farm ADS (which we afterwards came to know well) while accompanying Billy Holman on a tour of inpection. Naturally Billy was much shaken up and Australia lost one of her leading military men the commander of the","80":" Division.\n","81":" Being previously warned in the afternoon we walked over to the old Neuve Eglise – Bailleul road and saw pass by in their cars \n\n(69)\n\nThe King, the Prince of Wales, Sir D Haig, Sir Wm Birdwood, General Plumer (commanding our Army) General Godley and last but not least Mr. William Holman. The Aussies lined up by the roadside gave three cheers for His Majesty and three for Billy Holman, premier of New South Wales.\n","82":" During the night our dastardly enemy bombed the British Casualty Clearing Station at Bailleul killing 20 men largely patients and wounding about 44 others including some nurses.\n","83":" I returned to general duties and in the evening went into Bailleur to the pierrot show, returning by motor lorry. Then on \n","84":" my job was washing some hospital clothes, and then I went over to the YMCA tent in the pioneers camp opposite to write letters.\n","85":" In the afternoon a number of us walked over to Mount Kemmel about three miles away. This mountain or hill as would call it in Australia is said to be the highest point in Belgium.\n\n(70)\n\nIt is just near the southern border. Stands not far behind the lines at Messines and on a clear day commands a most glorious view of the battle area from Armentieres and Lille right up to Dickebusch, Poperinge and Ypres and even further north. \n\nThis hill is quite a mecca for soldiers who appreciate a fine view. On the top is set a concrete pillar marked as a geodetic survey point. The top of the hill is a network of old trenches and the hill was an important observation post before the advance at Messines. It was a glorious day and we enjoyed our walk very much. This chain of hills along the border is ground for many a pleasant walk. It is easily the prettiest part for many miles north or south.\n","86":" we packed up our troubles once more and marched about 3-4 miles down to the DRS (divisional rest station) at L`Estrade which we took over from the\n\n(71)\n","87":" Field Ambulance. While here I was mostly employed on fatigues but found plenty of time to walk into Steenwerck several times to see the pierrot show or go to the YMCA\n\n(Written","88":" at Douve Rap near Warneton)\n","89":" Once more on the move . we marched from the DRS at L`Estrade by a round about route about 5 miles to Ravelsberg Div Rest Station which we took over from one of the NZ Fld Ambulances while they proceeded to L`Estrade. Ravelserg is more a name than a village. The DRS is situated about a mile from Bailleul square out on the road which crosses the border later to Neuve Eglise. It is composed of huts mainly of the old rectangular type with a pleasant grass plot and garden in the centre. One of the many railway lines completed before Messines runs through the grounds. \n\nNot far from Ravelsberg nearly to Bailleul is the large aerodrome and while at the DRS one could see plenty of the work of the planes. Before the battle of Messines the Australian Flying Corps took\n\n(72)\n\ntheir place with the R.F.C. in this drome and since then their portion has gradually increased till now they are very strongly represented.\n","90":" Our work at this DRS was just the usual, looking after a large number of non-serious patients including scabies and gingivitis patients. The first of these army scourges is unfortunately fairly prevalent, but the latter more rare. being simply a plain stretcher bearer my work was usually on the customary fatigues. One might think this drearisome, but not so. The worker takes good care he is not fatigued, and also has his fun dodging the W.O. a chap named Mr Mobbs and any obnoxious NCO`s .The NCO`s are, however, on the whole a fine lot and always have been.\n","91":" In the evening I walked with a couple of others to Bailleul then along the very fine 2 miles avenue to the township of Meteren, which like Bailleul stands on a hilltop with the church tower closing the vista along the avenue. This feature of French planning is most admirable. The sameness\n\n(73)\n\nNoticeable in many places especially in Paris I believe. One instance is the dome of Boulogne Cathedral looking down upon the Rue de Calais.\n\nMeteren is only semi populated by the civilians and is used largely for army purposes. We had a look round then some tea (the inevitable eggs\" and returned. The next day \n\n22July 1917 (Sunday) After tea I set out with N.Rosenthal and we walked through Bailleul to the Belgian village of St.Jans Cappel. This village lies in a hollow under Mont Novi and is rather quaint. Walking on these late summer evening was very pleasant as well as informative. St Jans Cappell (Fr: St.Jens Chapelle) has a rather fine spired church also a large RomanCatholic institution of some sort. At Bailleul on our way home I bought a lace handkerchief to send home. It is rather interesting to watch the lace being made by the old dames who earn up to about 3 frs. A day so I was told. This h`chief was 7 francs .The value for exchange and army pay of a franc is 8","92":"\n\n(74)\n","93":" The last few days I had been mess room orderly for my daily job. Now at 6pm I went on guard that is gas picket and question answerer at the gate. During the evening Fritz came over and dropped some bombs before reaching us, but kept the remainder till he reached the aerodrome where he dropped them causing a little damage to some planes and much excitement in our horse lines near the drome.\n","94":" Coming off guard at 6pm I walked into Bailleur and had my photo taken by a woman there. I was wearing the green band issued to us as a distinguishing armlet for a coming stunt.\n\n28th July On fatigue emptying water carts into tanks with buckets\n\nIn the late afternoon Norman Rosenthal and I walked through St Jans Cappel to Mont des Cãts. This hill standing about 100 metres high affords a very fine and extensive view in all directions. \n\nUnfortunately the day was fairly dull still we could make out the chimney stacks of Armentieres. On the summit of the hill stands a large abbey. The grounds surrounding all belong to the abbey. The abbey is partly used \n\n(75)\n\nby the British army authorities as a special hospital for scabies patients. I saw a few brown robed monks about. I went through part of the abbey which is a rather fine ornamental building (built about 1856) and has a very fine pillared cloister. In rear of the the abbey on the highest part of the hill stands a high crucifix.\n\nA large old windmill also stands prominently on the summit. It would be a great curiosity in Australia with its four great wings. In the road side leading to the summit stands a shrine with the inscription in French “pray for us exiles\" . On the way back from Mont des Cats we went through Berther village and St Jans Cappel and so home.\n\nHaving heard by rumour that the 1st Division had come up from the Somme and was billeted between Hazebrouck and that the 1st Pioneers were about the village of Hondeghem in that district, I obtained a leave pass and the next day ","95":" I set out about 10am and walking into Bailleul got on a motor lorry going to Hazebrouck. From here I set out to walk up to the Bailleul Cassel Road\n\n(76)\n\nbut a chap in a Ford motor ambulance giving the lonely footpadder a lift I was soon up at rear St Sylvestre Cappel. Here I\n\nhad dinner and was directed the way to Hondighem. Arrived here I found some of the 1st Pioneers but not C company. I was directed on to the large village of Staple but here although there was a large number of the infantry there were no pioneers. However I was given a good idea where they were and walked to the espired church of Walton Cappel, a village just of the main road from Hazebrouck to St Omer. Walking along the road a short distance back towards Hazebrouck I \n\ncame to the spot where, according to all accounts and a later letter from Will, his company had camped the night before and moved off at 5 am that morning marching down towards St Omer as far as Ebblinghem. Naturally I was very disappointed to find that I had missed him and by such a short space of time. But as they were on the move (to Lumbres) and not stationery it was not remarkable so it then being late I walked towards Hazebrouck till I was able to board a passing lorry going in that direction. Arrived there\n\n(77) \n\nI obtained a good meal as a reward for my walk of about 13 miles. Then I went down to the railway station and by waiting a while was able to catch a train going to Bailleul and so home.","96":" \n\nFor some days we had understood that there was a consignment of tinned fruit from the comforts fund in the store fo us, and that there was a big raid coming off; also that we would have fruit for tea when the stunt was coming off. Well this afternoon we fell in at 4.30. then we had tea and the fatal fruit and marched up to Khandahar Farm and ads on the Neuve Eglise-Messines Road run by the 10th F.Amb who were then running the line. This was a distance of nearly 6 miles. Then some of us including myself went into the line about dark, this being a walk of about another 2 or 3 miles. I was stationed with Ralph Davidson and two others at a post called Sunken Road Railhead to which the wounded were carried to us, and when we put them on trucks and pushed them along a light railway back over Messines\n\n(78)\n\nRidge to another relay who took them on to the ADS called Gooseberry Farm. The relay was at “German Dugout\" a strong \n\ncaptured pill-box. The raid which did not occur till about 4am was carried out by the","97":" Brigade who captured all their their objectives – 8 very troublesome strong points outside Warneton","98":"\n\nOur casualties however commenced coming in about 1am. and from then on till 9am the next morning till more men arrived we worked almost exhausting ourselves trucking the wounded back. Then Charlie Hamblin, Harold Lees and others taking over my job of which I was absolutely tired, I went on further and joined the parties in carrying over land from Cross Trench to the railhead. This was quite a spell. As it happened during the morning the ground about us was well basted by German HE`s but fortunately none lodged in the trench where we were or beside out parties carrying overland although the path we were using was torn up by two shells.\n\nIt so happens that from the door of the dugout in which I am writing \n\n(79)\n\nthis to take with me and post when on leave soon, I can look out across the Douve about 50 yards to the place where we\n\nwere “basted\" and recognise the place well. Now I am at an RAP in the next sector. Well to continue the story, the number of wounded which was fairly large and our men and the men of","99":" were relieved about midday and some of our men about 5 pm by the 11th Fld Ambulance who with some of our men carried on for 24 hours and were then relieved by the 10th again. \n\nThe raid or rather attack was part of the big attack from the Lys to North of Ypres resulting in a very successful advance at Ypres. After being relieved we walked back to Khandahar Farm, had some tea and were then taken back to Ravelsberg in the horse ambulance wagons. The next day","100":" we were allowed to rest after a late breakfast, and late in the afternoon the remainder of our men returned covered in mud from head to foot and wet through\n\n(80)\n\nfor the night had been a rainy one and where they were there was practically no shelter. The new clay trenches were soon in a bad state. However they did not mind that so much as on the next morning","101":" being made by Major Lind to cut hedges, pick up papers etc, in their wet clothes. Having come home earlier I was only muddy but dry so went up to the YMCA pictures in Bailleul\n","102":" I was sent with 14 other “C\" section bearers up to Westhof to give the","103":" F Amb a hand to run the MDS. I was put on as cook`s fatigue, which was not a bad job and had its little compensations in the way of tucker of course. Some days were rainy but mostly the weather was good . \n","104":" We returned to our unit at Ravelsberg. In the evening I went up to Bailleul to see the “Merry Mauve\" divisional follies in the Caisse D`Eparque (French Savings Bank) hall.\n","105":" walked over towards the Loere road to see Jim Prentice and had a chat. \n","106":" The dental orderly being ill I was able to fill the gap for Capt.Bennett.\n","107":" Dental orderly. Little work. Attended Holy Communion.\n\n(81)\n","108":" Aug.1917. Still taking the dental orderly`s place. Evenings walked into Bailleul generally. This evening saw some pierrots at the YMCA cinema hut.\n","109":" Aug.On fatigues again. Cutting grass in the garden this time. Mounted guard at 6pm.\n","110":" Will arrived from Lumbres about 10am to see me. He had started the night before, spending the night at St Omer Officer`s rest camp. Naturally we were delighted to see each other as it was the first time since I left Australia 15 months before. Will met the CO. Colonel Maguire and I introduced some of my mates to him and showed him our quarters. Then obtaining leave we walked up to Bailleur together having a great yarn. In Bailleul we had dinner then went for a walk, found a quiet spot and spent the afternoon yarning. Then as Will had to catch a train about 5.30pm we went down to the station just in time for him to hop on. So I had some tea and went to YMCA service.\n\n20th Aug. on fatigue. In the evening I walked to Dranoutre, had a look through the old church there and\n\n(82)\n\nreturned along the Locre road home.\n\n22 August 1917. At last the expected move back had come. We had reveille at an unearthly hour and a bacon breakfast at 6.30. Then we marched to Steenwerck Station and entrained. Moving off about 11am we circumvented Hazebrouck and St Omer and arrived at WizernesStation between St Omer and Lumbres about 4pm. From here we marched a short distance with our packs and then deposited them for the motor ambulances to bring along we marched about 8 miles to the village of Ouve Wirquin and here had tea our first meal since our 6.30 breakfast. Then we were shown our billets in houses about the village and settled down pretty tired. Ouve Wirquin is a delightful little village set in the heart of Picardy hills, and on the bank of the River Aa. It is also on the light railway running through Fauquembergues to Lumbres .\n\nThe surroundings are very picturesque indeed and the river a clear rapid flowing one. The same evening tired as we were, we nearly all had a refreshing swim in the river, which was as cold as it was clear. However we enjoyed it very much.\n\n(83)\n\nPortugese and British troops had been billeted in these village before, but never Australians and we were regarded with some curiosity but treated with great hospitality. The people of this part seemed infinitely superior to the mixed race we had left behind in Flanders. \n\n24 August 1917. We had a few light fatigues to do. Knowing from a letter of Will`s that he was billeted at Lumbres about 5 miles away I nicked away for the afternoon and walked in there only to find that he had, a couple of days before gone on 6 days leave to Paris, lucky beggar. So leaving a message with the orderly room I had tea and returned to Ouve by train.\n\n25th August. At 2 pm we fell in and marched on with our houses on our backs five miles to a small village called Ecuire and near Thiembronne. Here we dumped our houses and prepared to live in peace. We were billeted in farm barns and our cookhouse and field hospital for the brigade were in a deserted farm\n\n(84)\n\n26th August. Our section being granted leave for the day Charlie Hamblin, Burkett Shearman and myself walked into Faliquembergues a township nearly as big as Lumbres and also on the Aa River. Here we managed to obtain dinner and then walked back getting caught in the rain.\n\n27,28,29 August. Very wet days. We had a few fatigues to do.\n\n30th August. Will came over from Lumbres after his return from Paris to see me. We had a chat and managed to get a “feed “at a farmhouse. Then Will had to return as he was on a borrowed bicycle and the rain was coming on. He arrived safely and the next day unexpectedly moved off to Vieux Berguin toward Bailleul.\n\n1st September 1917. Those wishing to attend the brigade sports were dismissed from the morning parade. I was among them but decided to go down to Boulogne instead. So I walked over to Nielles les Blequin railway station 3½ miles and after buying a ticket (about 8d return) boarded the 11 am train arriving at Pont de Bricques the station before Boulogne about 1.30. We got off here as there\n\n(85)\n\nwere no military police in attendance here as there were at Boulogne waiting on men with no passes. From here we partly walked and partly went by motor lorry into Boulogne about 3½ miles . we went and had some dinner at a Dago fish shop and then went for a walk round the town and down along the quay to the beach and promenade. \n\nBoulogne is a peculiar town spreading from the top of a high hill down to the bank of the river at its outlet. On the summit of the hill stands a rather fine domed cathedral with what appears to be the old city surrounding it and around that the old city wall still standing in good condition with its various gates. And around this again a belt of beautiful public garden with a number of monuments. Then below this towards the river lies the modern town very prosperous and busy looking and having a good electric tram service. But of course the main attraction of Boulogne is the beach. This is rather wide and fairly long being formed of\n\n(86)\n\npebbly sand. Along its entire length runs a very fine promenade with a broad strip of garden. At one end of the promenade near the river mouth and pier is the very imposing Casino now being used as No 13 General Hospital and its length is faced by large residential house or hotels. On the beach were a large number of bathing machines. There were some people in swimming but we did not take the water. \n\nAs our time was limited we had some tea and caught a tram back to Pont de Bricques and waited for the 5 pm tram back to Nielles. Arriving there at 7.30 we commenced to walk home but got a lift first on a three wheeled clover cart and then on a motor lorry and so with another walk we were home after a happy if stolen day .\n\nWritten 24\/2\/18 at Red Lodge ADS in Ploegsteert, Belgium.\n\n2nd September 1917. I took over a bicycle hired by one of our men and which he had to return to St Omer that day and rode over to Lumbres a distance of 5 miles to see my brother Will. I went to his billet but found that he had, on 31 Aug gone to Vieux Berquin a village towards Bailleul. So I had missed him. However the people with whom he was billeted Mde and the Mmlles Mercier – insisted on\n\n(87)\n\nmy staying to dinner. This I did and we had a pleasant meal together and a chat and exchange of views. They thought a lot of Will. After dinner as I had spoken of my necessity to return the bicycle to St. Omer, the young ladies agreed to accompany me. Thus we made part of the distance together, but being delayed to tell a NZ the where abouts of our ambulance in attempting to catch up the trap I took the wrong road at Setques and went on to St. Omer through Wisques and Longuenesse. Here I expected to rejoin my companions but they had returned soon after passing Setques as the wind had grown cold. \n\nIn St Omer I returned the bicyle to the shop and hired another one, a chainless bicycle for three days at 3 francs a day. Then I rode all around St Omer which is really a fine town. The buildings are very substantial looking many being built of stone. The town hall is a very fine domed building facing a large cobbled square. There are also two other squares. The old church on\n\n(87)\n\nCathedral by the canal is almost in ruins although the tower still stands as a landmark. It has evidently been a fine piece of architecture . another church also a fine one, now stands in a higher part of the town,. But is in very cramped surroundings. It has a very fine tower and spire. The main attraction of the town is the very fine gardens, and this being Sunday a British band was rendering pieces to a gay gathering of the civil population as well as soldiers, largely Australian. \n\nI went to the church army hut for a while and then about 6.30 pm set out and rode back to Lumbres via Tatinghem and Leulinghems. Here I had tea with the Merciers and then returned to billets at Ecuvie battling against a strong head wind and by moonlight. The distance to St Omer and back was 25 miles.\n\n3 Aug. Short route march. Passed bicycle on\n\n4 Aug Short route march. I went on cart for fodder and for clover from the Frenchies. \n\n5Aug We went for a route march to Thumbroune and there helped some French girls to load the sheaves of wheat on to the carts to take to the barns.\n\n(89)\n\n9th August (Sunday) Kit inspection\n\n10th Aug Training for unit sports.\n\n11th Aug. Attended morning parade at 8.45 then walked over to Nielles le Blequin Railway Station and caught 11am train to Pont de Bricques, then took tram into Boulogne and had a walk around. We had dinner and then three of us went out to Wimereux by train running up the coast north for about 3 miles. On the way we passed No.2 Australian General Hospital and a number of others, and we also saw Napoleons column standing out of the forest on elevated ground a little inland.\n\nAt Wimereux we sat in the sun on the warm pebbly beach for awhile but did not go in for a swim. Then we had to return to Boulogne where we had tea. Then we caught a tram back to Pont de Bricques, but as it was nearly 8 pm we had to use our wits to board a train going homewards, so walked down the line towards Boulogne to a military year for making up trains and \n\n(90)\n\nhaving squared the guard, got aboard the van of one going to Nielles where we arrived safely about 1 am. we had to walk home but were contented as well as tired, and after “niggling\" some supper from the night orderlies, turned in to bed.\n\nWed 12 Sept 1917. On this day our ambulance held very successful foot sports in a large field near our billets. The 100 yds championship was won by (Sgt) Harold Williams. I had entered for the 100 yds H`cap, in which I won the heat but only came 3rd in the final having least handicap (5yds). It was won by Tommy Mahon. Brom Bieler and I came fourth in the Siamese Race final. I led off for our team of 4 in the inter section relay race. Our team came third in the final of the h`cap the crowd collected in front of the tape and I hurt by foot by running into someone. My foot was only bruised and well within a week. Till the","111":" I was off duty. \n","112":" Recd letter re bicycle I had hired and passed on to another man of the ambulance demanding return of bicycle.\n\n(91)\n","113":" I saw Capt.Bartram re bicycle and went to St Omer to No 10 Stationery Hospital and the Railway Station to try and find the bicycle. I was unsuccessful. Later I met my friend Burkett and after tea at the Church Army returned to Drionville in motor lorry and walked home with him.\n\n21Aug. I saw the CO concerning bicycle\n","114":" Early reveille. Our division was reviewed by Field Marshal Sir D Haig. C in C France on a long rising stretch of open ground near Drionville near our billets. It was a most inspiring scene with the blue hills of Picardy away in the distance – a never to be forgotten scene.\n","115":" Still at Ecuire. Attended C of E communion in a field at the cross roads of Drionville.\n","116":" At Ecuire. Gas drill Saw CO re bike again. Received a field service card and letter from Will to say he was wounded on 17th and at 24th General Hospital at Etaples. I paraded to the C.O. for leave to go and see him, but owing to the fact that we were under orders to move\n\n(92)\n\nthe CO could not grant my request, but forwarded the application to the ADMS of the division. However we had moved away before the reply came and by that time Will had been sent to England to 3rd London Gen Hosp.\n","117":" Was paraded to CO with others for loss of box respirator lost in the Warneton stunt on","118":" Went for a walk and had a bath in a cold clear stream near Thiombronne.\n","119":" Reveille was at 4.15, breakfast at 5.15 am. We fell in at 6.30 and marched away from Ecurie with our packs up and wagons following. We were going up to the northern battlefield around Ypres. Our first day`s march lay through Drionville, Wismes , and Wavrans to Lumbres and Wizernes to Arques a large suburb of St Omer. From here we marched on to the villages of Wardrecques where we stayed for the night being billeted in barns with straw to lie upon. Needless to say, after our long march we did not fool about much but after tea about 8 pm went straight to bed. We had covered over 32 kilos (or 20 miles)\n\n(93)\n\n(Written","120":" at Dead Horse Corner relay post in Ploegsteert Wood, Belgium)\n","121":" We had an early reveille 5 am and breakfast 6 am. then resumed our trek at 6.30. I was one of those pushing a pair of stretcher wheels on which we put our gear instead of carrying it on our backs – an easier method except up hill, but much easier if you tie the wheels onto the back of a transport wagon unobserved. \n","122":" we passed through Ebblinghem on the Hazebrouck and Bailleu railway and Staple which village I had visited once before in my search for Will. Thus we were going by unimportant roads and therefore by roundabout ones. Cassell perched on its high lone line was in close view nearly all day. From Staple nearby which we halted for lunch we passed through Longue Croix and by a roundabout route to St Sylvestre Cappel with its tall spired church. From here we marched down the main road to Bailleul for a short distance and then turned to our left taking the road to Eeecke here we halted and were fortunate in finding a NZ. YMCA with a help\n\n(94)\n\nyourself notice and plenty of cocoa and biscuits, It was now about 6 pm. Then from Eecke we went on to Godewaersvelde a fair sized village behind Mt des Catts. Here we stayed for the night, sleeping in barns full of straw at a large farmhouse. \n\nThe next morning","123":" we moved off after a late breakfast arranged at the COs request and marched by a very roundabout route to Steenvoorde a large village having a very fine church indeed. From here after a halt we marched on to Winezeele where our billets were to be for a short time while resting. \n\nWinezeele is only a small village and not of any note. We were quartered here in the barns as usual but I preferred the floor of a large farm wagon and some clean straw. We had arrived at dinner time and spent that afternoon and the next day, the","124":" at 9 am we were taken by motor lorries back through Steenvoorder through L`Abeele and then the town of Poperinge, with it`s square pretty church and town hall to the large town of Ypres. Our section was taken through the town out towards the line along the road to Zonnebeke\n\n(95)\n\nto a small village of Potize, or rather to the only house left standing, a place called the White Chateuau. This ruined house had been converted into an a.d.s. by the aid of iron and sandbags, and we now took it over from the Tommies.\n\nThe bearers did not long remain here, however, and we were conducted down the road till we came to a small German piill box captured in the","125":" push by the Tommies. This we took over by leaving a few men. This pill box was a post for loading the wounded brought down by hand onto the Ford motor ambulances or motor lorries which could proceed to this point. Its name was Bavaria House. Here we turned to our right along a road constructed of facines and lined with 18 pounder batteries till we came to the Zonnebeke railway line. Here sheltered under the embankment of the line was a very fine large concrete German dugout called Wildewood dugout. Here about 12 of us, all bearers and including myself were left in\n\n(96)\n\nCharge of our general duty sergeant Sgt Crook. \n\nThe Tommies had left the place in an indescribably filthy condition swarming with flies. We soon set to work and cleaned the place out and baled it out. This dugout was afterwards a very secure and comfortable abode. It`s walls were four feet thick and made of solid concret. The roof likewise or stronger still. The inside walls were panelled with heliotrope wallpaper and one could stand up straight inside – a rare situation.The remainder of our bearers had proceeded up the railway line about ¼ of a mile to the next pill box “Rabbit Villa\" and leaving 8 men there the remaining 8 men of B section went on to the RAP. Meanwhile more men of B section worked another line for evacuation similar to ours down to Bavaria House along the Z road.\n\nOur infantry had taken over the previous night, and we commenced carrying down wounded soon after our arrival at Wilde Wood.\n","126":" we were kept busy carrying to Bavaria House. We carried in parties of 4, 2 at a time, with slings.\n\n(97)\n","127":" Except four men and a NCO left at Wilde Wood as a holding party to bring down any casualties among the artillery we were withdrawn at 10 am and returned to Ypres, where we billeted in what had been the town magazine oposite the gaol which was our headquarters. The magazine was a rather dismal building being in the shape of an enlarged brick railway tunnel, but the gaol had been a very fine ornamental building. though so knocked about it provided very fine dugouts especially in the extensive underground passages in part of which our dressing room for town casualties was established \n","128":" We continued at Ypres resting and were employed onlight fatigues. We heard later that three of the men - Pearson, Davidson and Tuffy who were left behind at Wilde Wood were wounded but not dangerously but Tuff or Harry Tuffy rather only arrived back on day of writing this and Ralph Davidson is expected to return to Aussy. At 11 pm we ret`d to the line and \n\n(\n\n98)\n","129":" that memorable day found about 20 C section bearers and myself at a small catacombs at a place called Railway Wood, amongst our heavies. From here I was sent with Len Knight (afterwards wounded) with a message to Major Taylor our MO at Frost House, a broken in pill box on the Zonnebeke Road past Bavaria House. Here we waited several hours and then returned in the rain, and under some close shellfire to Railway Wood and brought up the remainder of the men past our heavies firing in the barrage under which our infantry were now attacking. \n\nIt was now just clear daylight. The barrage opened at 6 am. we were soon all busy carrying down wounded from Frost House to Bavaria House, a distance of about half a mile. Men of other sections had been bringing the wounded back to Frost house mostly from a R.A.P. called Mitchell`s Farm, a large concrete dugout which had been a “whizz bang\" or light field gun\n\n(99)\n\nposition in the hollow a little over half a mile in advance of Frost House. Just before 10 am Len Knight was wounded by a flying piece of shell just by Frost House at the same time I noticed a party of our own section bearers leaving for Mitchell`s Farm, and like a fool joined myself to them. We did not however halt at Mitchell`s Farm as I had expected but went straight on crossing for about half a mile our own territory and then for about half a mile the ground just captured that morning . It was very thoroughly torn up by our barrage fire, and as a result the enemy dead lay thick just as they had fallen. Of course our own dead lay mingled with them but their numbers were much smaller. However we could not pay much attention to those or any to anything else except the enemys shells which were falling in great abundance all around us. Passing Levi House the two squads which had\n\n(100)\n\nnot dwindled off reached the 39th advanced rap which was set in a small shell hole. Here we only found one of our wounded and one Fritz badly wounded. The others took our man and our squad including myself and Charlie Boyall brought the Fritz. \n\nTwice we sank into the slimy mud sufficiently to throw our patient off, despite our strongest efforts. After a very heavy carry walking around shell holes, carrying with one handle of the stretched on each man`s shoulder and dragging great weights of clay on our feet we succeeded in bringing our man to Mitchell Farm. A party of bearers in front of us had been killed and we were thankful that we had not. We were too exhausted to return and were not wanted to so, after a good shell carried a patient back to Frost House. The RAP was then withdraw being in a useless and exposed position. We then worked carrying back to Bavaria House. By this time the three ambulances were thoroughly mixed.\n\n(101)\n\nWe worked till 8 pm when we were relieved by fresh men. Then Sgt Crook and I managed to find a clean German concrete dugout across the road, and obtained permission from the artillery officer in possession to sleep there. This we did till 8 am the next morning\n","130":" when at 8am we resumed our labours, carrying to Frost House. Then at 8 pm turned in again. This time we brought all our friends as fortunately the Tommy artillery observation officer had departed. At 1.30 am ","131":" some of us were recalled to relieve the men at Mitchells Farm. This we did, and after one carry , we spent the remainder of the night trying in vain to keep warm as the wind was very bitter. The dugout was untenable owing to decomposing bodies and we gained what protection we could from the wind by standing by the pillbox or sitting under a stretcher propped against it. \n\nAt 9 am, however, we were \n\n(102)\n\nrecalled to Frost House . At 11am an English F Amb came up to relieve us – a welcome sight. It was however nearly 5pm before they were fully established. Our infantry had been relieved the night before. \n\nWe then returned to Ypres, and after a hot drink and biscuit at the Red Cross Stall at the prison collected our gear and boarded motor lorries leaving the English field ambulance the prison and all in it. Our ambulance was soon way back at Winnezeele where we had a plain scramble tea in the dark. We spent the night in tents and exhibited to one another the few souvenirs we had been able to pick up while working. I had two Fritz caps and some buttons and shoulder straps. During the stunt our greatest encouragement had been seeing the prisoners coming back. They had been very numerous and some we employed for a while as stretcher bearers or at least made to carry one of their wounded out. The prisoners seemed haggard and lean but hardy\n\n(103)\n","132":" We moved across from the tents to our old billets at another farm. We were much bucked to receive a mail from Australia dated","133":"\n\n8th and","134":" We remained at the farm resting and had a bath.\n","135":" We fell in at 1pm and marched about 2 miles to a place where there was a chain of motor lorries over half a mile long. Here we embarked once more to be whirled away to battle like storm troops, and were soon on our way which led through Steenvoorde, around Poperinge to Ypres. Here we “disembarked\" on an open road outside the town. In the pitch darkness there was much confusion, but eventually we marched in single file to the prison in Ypres. Here most of us slept in the magazine as before.\n","136":" At 6pm we fell in that is the bearers fell in and after a word from Colonel Maguire saying what a stiff proposition we had to face, told us that\n\n(104)\n\nhe had obtained infantry help to the extent of 12 reinforcement men from each battalion. Then we were taken by motor lorries in the darkness to the White Chateau ADS which had been taken over by one of nursing subdivisions (A Section). \n\nAt the White Chateau the 9th men were mustered and allotted to the different battalions, each amc man having 3 infantry men to complete a squad. The three ambulances were to be employed ofcourse but our ambulance was doing the forward work. \n\nAbout 10pm I went with Wagstaffe in charge, and Jack Duggan from Buler and Frank Hughes, SB`s of my section and the 12 inf bearers who were all men just over from England and mostly nco`s from training camps over to the camp of the 40th Bat. Here the infantry battalion had a hot meal and were provided with an extra water bottle full of hot cocoa to take with them. We obtained a drink and at 11pm followed the battalion out of camp and up the road for about three miles and past Frost House\n\nto a pillpox on the Zonnebeke road called Bremen House. Here we branched off to the left and following a track called “K\" track marked by a white tape and shaded lights came after a 2 miles march and under a bombardment of small gas shells to the battalions position in the line. This was effected in complete silence. The M.O. (Captain Clarke) led us partly by the guide of a tape to the RAP which was also BHQ. It was a large concrete dugout in the rear of a collection of stumps known as Berlin Wood. Here we camped for the night the MO inside and we outside. Our pleasure in life was soon increased by a steady downpour of rain which wet everybody except those inside the pillbox. We had as companions a number of German dead lying around. \n\nThis pillbox was about 200 or 250 yards in rear of our front line which was a succession of shell hole posts more than a manned trench.\n","137":" our barrage for the attack on Passchendaele Ridge opened at 6.5am. about 6.15am the enemy laid down a heavy barrage of high explosive shells on the regions of our front line, as by then our attacking men were practically mixed with his own. Our men in advancing had severe rifle and machine gun fire to contend against and by the dim light the enemy snipers laid low many a man of ours. Our infantry advanced across the valley and up almost to the crest of Passchendaele village capturing the outskirts. \n\nOn our arrival at the RAP the night before we had found a few patients waiting to be removed but had to wait till it was light to find our way out. Three of our AMC men had just gone in to the dugout to bring out a wounded Tommy when the enemy bombardment opened. The other man and myself were sitting on the ground behind the pillbox when two shells fell near us, the second one killing my mate Frank Hughes, a bearer who had just joined us and a very fine fellow. This shell burst about 6 feet in front of us. The other shell wounding a signaller.\n\nNaturally I did not linger but cleared round to the side of the pillbox almost running into another shellburst. Seeing everything go up red, without thinking I wheeled and cleared out about thirty yards into the remains of Berlin Wood. Here things were lively also for 5 mins with only the ghosts of dead Tommies, heroes all, to keep one company. Then returned to the pill box but was unable to find the three other amc men because a shell bursting beside them while renewing thir efforts to bring the wounded Tommy out of the pill box had wounded two of them and the patient again and all gained the inside of the pillbox again. I did not know this and was very sorry to learn it afterwards as both were fine men and one Jack Duggan afterwards died of his wounds back at the CCS. The other Brom Briler is still in England. Wagstaffe escaped unhurt but shaken.\n\nMeanwhile with a signaller I managed to bring in one man lying wounded nearby, and then on trying to collect the infantry bearers attached to us could \n\nFound only four left and on being hit by a flying piece of shell in the eye almost immediately there were only four of us. We managed to get the Tommy out and onto a stretcher and set out to carrying him back. By now it was about 8 oclock. After losing our way at first and wandering towards the enemy lines we found our way and after over three and a half hours succeeded in getting our patient down to Frost House a distance of about 2½ miles. That is less than a mile an hour. The ground was always soft but the heavy rain had made the used track into a morass. We carried down to Frost House as no relay was available. \n\nFrom Frost House the three infantry bearers were allowed to return to their battalion camp and I remained at Frost House to act as a guide to take up more men asked for in a note I had obtained from the RMO. For this purpose I remained at Frost House that afternoon and night and then after all on","138":" the major sent more men up without a guide so I was\n\nsent up after them by myself. Now things were much quieter and we now carried the patients down to a nearer post called Otto Farm. More men had been sent up from billets that morning and during the morning before and the arduos work of carrying overland in sight of the enemy was proceeded with but there were many wounded to move.\n\nI must mention that the previous evening our infantry had had to retire at dark to their original line as the New Zealanders on our left had been held up by pillboxes through no fault of their own and our position was untenable owing to enfilade machine fire. The news reached us that two more of our men, bearers of B Section had paid the supreme sacrifice in a noble cause. \n\nThat afternoon of the second day we were relived and six of us carried a patient right out of the lines through the NZ section and then after a long walk tired out reached the prison at Ypres about 8.30 pm and slept there\n\nFrom now on the bearers returned to Ypres every night as it was impossible to carry in the dark and at 4 o`clock reveille and for the men fit to go up enabled them to reach the line by daylight. So at 4am","139":" another party was sent up to man the various routes of which Berlin Wood track was only one and we remained at the prison.\n\nWe paraded at 4pm to single out those still fit to go up and the next day","140":" I went up with the party to Zonnebeke Railway Station, This was a relay post to which others carried the wounded from “Seine House\" RAP, From here Chas Hamblin, Chas Noyall and Ron Ponton carried down 5 cases – a fair days work. One was a Hessian prisoner and was lectured by Chas H for taking his shoulder straps. I didn`t take his iron cross as some would have. \n\nWith our last case we went on to Bavaria House, loaded him there and then reported back to the White Chateau ADS had a drink at the YMCA stall there and jumping on a gs wagon returned to the prison at Ypres and reported\n\nBy this time one of my ankles had become very painful evidently having been strained on pulling my foot out of the mud and on the 4 oclock parade the next day","141":" I was told I would not be able to go up again, and this was so. I really was not, and spent the next four days keeping quiet at the prison. Meanwhile some bearers had to go up each day but there were not so many wounded coming in and one day (the fourth day) men from an English division relieved ours, probably to compensate for the large number of wounded left by the division we relieved for us to clear. The casualties among the artillery had been fairly heavy as they worked mostly in the open under camouflage only with the guns ranged thickly along roads built at right angles to the main Zonnebek road.\n\nThen the happy day arrived when our infantry having been relieve the night before, we were relieved by the Canadians and on","142":" we entrained\n\nnear Ypres station with our brigade, and 4.30 pm found us back again at Wizernes Railway Station between St Omer and Lumbres. From here the ambulance marched without packs back to our billets near Ecuvie Village. Some of us being unable to march the distance were taken by motor ambulance.\n","143":" I was offside in the mens cookhouse and waxed fat.\n\n23rd-25th On same job.","144":" went down with Cott to Thiembronne for bath and tea.\n","145":" attended church parade in orchard at crossroads. Le Fert\n","146":" commenced duty as offsider in the sergeants mess with Shaw and Bob Mowbray. Attended dentist`s.\n\nThe sgts mess was at a French farmhouse and here I lived very happily. We were all treated much as members of the family and given coffee, beer and cider. Appreciated the comfort of a home fire and furniture very much and was also much interested in the life of the French people and commenced to improve my French.\n\nIt was the usual type of farmhouse having a large manure pit\n\nOccupying most of the yard with the house on one side of it and barns, sties, and stables on the other three sides.\n\nThe “old girl\" of the house was a hard worker quick and careless rough but honest. The “old man\" was spoilt by the old girl, pottered around, did odd jobs showing good handicraft and generally directed the elder girl, married to a sergeant at the war, did a large share of the manual farm work and some housework. The younger daughter about 20 and rather good looking also worked out on the farm during the day. She was engaged to be married to a young fellow she liked but whom her parents did not like, preferring some one else with more money. But the girl preferred a literal “labour of love\".\n\nThen there was a farm hand named Julian treated by the family as a “domestique\" or servant for it seems the people of republican democratic France are very class distinguishing. The man Julian, altho` only 17 years was immensely strong, a good worker and shrewd. \n\nWell our sojourn here ended on\n","147":" When at 11am we fell in in marching order and marched two miles to the village of Halle. Here we boarded motor lorries which had brought down other troops and were taken through Fauquembergues, Wizernes and Hazebrouck nearly to Neuf Berguin From here we marched through darkened Neuf Berguin in the dark and rain to Dolilieu, a village about half way between Bailleul and Merville. Here we occupied our old billets in the barns.\n","148":" and","149":" Remained at Doulieu\n","150":" We marched from Doulieu to the camp now a divisional rest station at Pont d`Achelles , on the Bailleul-Nieppe road. Here we stayed for a month during the whole of which time the dental orderly was away ill in hospital and I was called upon to take his place. We worked in one end of a large Nissen hospital hut and there was no lack of patients. I was free after tea at 4.30 pm each evening, and sometimes walked to Steenwerck and Nieppe with cobbers to see Pierrot shows or the movies.\n","151":" We celebrated the anniversary of our landing in France with a very successful function – a dinner and smoke concert. Since then we have had souvenir menu programmes printed and I have sent some home. The main item of the evening was of course Lt.Col Maguires speech as OC. In this he stated the units casualties for the year had been – \n\nKilled 11 men, 6 NCOs and 2 officers. \n\n(Of course the CO did not put the men first)\n\nThe decorations awarded numbered 3 DCMs and 13 Military Medals – 14 to NCOs and 2 to privates.\n\nOf the original unit there remained or had rejoined 4 offs, 41 NCOs and 130 men\n\nThis month spent at Pont d`Achelles DRS was the brightest in our experience. We were given every consideration by a CO, now experienced. A program of amusements was embarked upon and many an evening was pleasantly taken up by a euchre euchre, five hundred, crib or bridge party or a chess or draughts tournament. Other nights we had\n\nconcerts usually by our own men but once by the “Anzac Coves\"","152":" Div pierrots and once by the","153":" ACCS (Aust. Casualty Clearing Station)\n\nThe weather gradually grew colder with icy winds.\n\nDec.2nd.Slight snowfalls\n\nDec.3rd. Heavy frost. Pond frozen.\n\nCharlie Hearne from Randwick came over from the F Amb to see me. We went out for tea and had a chat and later he went back (4 miles) by lorries.\n","154":" Football match in the thaw. Geo Prentice came up to see me from his lines about ¾ mile away. Later he often came along in the evenings.\n","155":" Gothas dropped propaganda by parachute intended for the civil population.\n","156":" Gothas dropped bombs, one falling near crowd at football match, killed our motor despatch rider Ralph Denver. He was buried at P d`A\n","157":" Packed up dental gear and our ambulance moved from Pont d`Achelles to L`Estrade near Steenwerck. Here I set up the dental gear again still being dental orderly in the real orderly`s absence.\n","158":" Thaw, more snow and cold wind\n","159":" –","160":" Decenber 1917.Intense hoar frost have covered everything as with a mantle of snow. Even to the tips of the tall trees every twig bears half an inch of frost. The weather is extremely cold\n","161":" Another xmas away from home. No work in the dental department today. I slept in till nearly noon just to mark the uniqueness of the occasion. Then came xmas dinner. I will give the menu as showing what can be arranged near the front .\n\nTomato Soup, Cold ham and beef mashed potatoes, roast turkey (canteen funds) roast potatoes, Brussels sprouts, blancmange, jelly and tinned fruit ,fruit and nuts and raisins, and beer in plenty also tea. We enjoyed our dinner very much and threw in for the cooks. Xmas tea was a very quiet affair but in the evening we held a fancy dress ball which was a great success. A large number of the men improvised dresses and rigouts and came as nurses, good women, bad women, flappers, pierrettes etc and Indians “Gippos\" Egyptian niggers dandies, clowns, Romans pierrots etc etc. The show gave up about 10pm and \n\neveryone went to bed tired but happy and some perhaps a little “in excelsior\".\n\nIn the earlier part of the evening I had been down to the YMCA service but came back to see the Ball instead of staying to the YM free treat.\n","162":" –","163":" The closing days of the year were without import. The weather was cold and windy and everyone stayed indoors as much as possible. Unfortunately no Xmas parcels or comforts arrived, but there the AIF was rescued by its well developed faculty of “Improvise\"\n\nI am afraid this diary is not what it was intended to be but is a roughly and quickly written recollection of events happening some tme before .\n\nBut going on my first leave to “Blighty\" tomorrow I am sure that this, such as it, will be of interest to my dear ones waiting patiently at home for my return, which we all hope may not be far distant but still in all honour.\n\n"}}