{"Document Name":{"0":"Diary_0476","1":"Diary_0476","2":"Diary_0476","3":"Diary_0476","4":"Diary_0476","5":"Diary_0476","6":"Diary_0476","7":"Diary_0476","8":"Diary_0476","9":"Diary_0476","10":"Diary_0476","11":"Diary_0476","12":"Diary_0476","13":"Diary_0476","14":"Diary_0476","15":"Diary_0476","16":"Diary_0476","17":"Diary_0476","18":"Diary_0476","19":"Diary_0476","20":"Diary_0476","21":"Diary_0476","22":"Diary_0476","23":"Diary_0476","24":"Diary_0476","25":"Diary_0476","26":"Diary_0476","27":"Diary_0476","28":"Diary_0476","29":"Diary_0476","30":"Diary_0476","31":"Diary_0476","32":"Diary_0476","33":"Diary_0476","34":"Diary_0476","35":"Diary_0476","36":"Diary_0476"},"Date":{"0":"unknown","1":1974.0,"2":1975.0,"3":1976.0,"4":1977.0,"5":1981.0,"6":1982.0,"7":1984.0,"8":1985.0,"9":1986.0,"10":1987.0,"11":1988.0,"12":1989.0,"13":1990.0,"14":1991.0,"15":1992.0,"16":1993.0,"17":1994.0,"18":1995.0,"19":1996.0,"20":1997.0,"21":1998.0,"22":1999.0,"23":2000.0,"24":2001.0,"25":2002.0,"26":2003.0,"27":2004.0,"28":2005.0,"29":2008.0,"30":2009.0,"31":2010.0,"32":2011.0,"33":2012.0,"34":2013.0,"35":2014.0,"36":2015.0},"Entry":{"0":"\n","1":"\n\nThe weather this morning was threatening but it soon cleared up and by mid day it was quite warm. We were all allowed ashore before 10. o’clock except those on duty. One of the first things we saw when we left the boat was a diver getting ready and going down into the water. When we left he was still under water, which was covered with bubbles from the escaping air in his diving suit, which was constantly replenished by an air pump.\n\nAt a further shop which was recommended to me by the visiting troops committee I purchased 6 ostrich feathers for &pound1.2.6. The same feathers would cost about &pound4 in Melbourne. I also obtained some books & post cards of Cape Town that I had ordered the day before and some native curios.\n\nAfter dinner I went to the Promenade Pier to see a hindoo conjurer perform some marvellous tricks\n\nSuch as producing pigeons from no where blowing smoke and fire out of his mouth, making a model swan swim and dive at his bidding, and rapid repair of a seemingly broken jar.\n\nI then had a walk along the pleasure pier, which has baths underneath and a tower at the end also a statue said to be one of the best in the city of the Dutchman, Johan Van Briebier who founded Capt Town and built the Fort.\n\nThen I had a look at the City Hall and came back to the Entertainment rooms for a rest and to do some writing. At night I attended a concert in the V.L.S. C. Hall Dock Road and was on board the ship again by 10.30.\n\nThe main street of the city was decorated with flags & bunting in honour of the soldiers, but today there was extra bunting displayed in honour of a contingent of South Africans, or Springboks as they are called, who landed this morning and marched through the city to the Town Hall where they were welcomed.\n\nIn Adderley St. there was a triumphant\n\narch erected of a very beautiful design. It was constructed of wood covered with canvas and painted white. It looked like stone. The main arch was in the centre & there were one on each side on top of which was painted in English and dutch \"Welcome Home Welkum Thuis\". Further up the street another streamer stretching across displayed the words \"Well played Springboks\" \"Nasi Gespeeled Springbokken\" Still another \"Greeting to our brave boys\" \"Welkomaan onze Jongens\" and another \"Dank U\" \"Thank you\".\n\nAll the official notices & railway signs and warnings are in both dutch and English. The Post Office is \"Postkantoor\".\n","2":"\n\nAnother fine day. We were later than usual in getting off the boat. I hurried to the V. T. S. C. Hall and was in time to secure a seat in one of the large motor busses that were specially hired by the V.T.S.C. for the use of troops, and went for \n\nmotor tour to Urrizenberg 18 miles from the Docks. The car held 25 and it was a very pleasant trip. The first few miles of the journey was through the city then the suburbs and along shady roads skirting the foot of the mountains until we came to Urrizenberg where we stayed about ¾ of an hour on the beach. There are many fine hotels and even facility for surf bathing. Urrizenberg is situated on the shores of False Bay. On the return journey part of the way we came by a different route and passed through long stretches of sturdy forest. We were back by 2. O clock. The fare cost 1\/- which needless to say shows no profit – if not a loss and included fruit & cigarettes.\n\nIn the afternoon I went for another long trip but in the opposite direction to Houts Bay. The people of Cape Town consider this to be one of the world’s beauty drives. It is certainly very exciting and one of the most dangerous. The route is by way of sea point to Camps Bay. From Sea Point the danger commences.\n\nThe road winds along the side of the mountain at varying heights above the sea level & with innumerable sharp turns, sudden ascents & descends until Camp Bay is reached where it drops down to near the sea level but before many miles are travassed along the mountain sides it rises again many hundreds of feet above the sea level. It is a wild and rugged road, with the top of the mountain playing hide and seek in the clouds and the waves washing the rocks below.\n\nThe slightest mistake on the drivers part might hurl the car into the sea – a land slip or a wash away would blot out the road. All at once the road run through a cleft in the mountains and we were out of sight of the sea with rugged barren rocks on either side of us, until we came to a large valley surrounded by mountains. We passed through the valley and Houts Bay came into view. It is merely a pleasure resort. The valley is filled with a dense scrub but near the bay there \n\nare numerous hotels and bungalows. We came back by an entirely different and much longer route at the back of the mountains which took us out near Groote Schuur (late Cecil Rhodes’ estate) and from there by the same route that we returned from Urrizenberg in the morning. The circular trip covered 33 miles and cost only 1\/-. We were back by 6.30. After tea I filled up my spare time making these notes.\n\nThe concert tonight was poorly attended most of the diggers preferring to walk about the streets. Until today the hotels were closed when the soldiers were ashore, but they were open for a few hours tonight – with the inevitable result – drunken soldiers & sailers. Some of the soldiers were fraternising with the black population, which they were warned not to do. All the slavish and menial work is done by the blacks, such as coal lumping, road making etc. Some of the blacks have good jobs such as driving horses, mules and motor cars, etc.\n\nEarly this morning the Port Macquarie left the docks for Australia & when we came back to our ship tonight the Benalla a family ship was in her place. She is densely packed with soldiers, their wives, and sweethearts. The talk of many of the soldiers is not to be admired. They are no judges of beauty and some of them must have made their selection in the dark.\n","3":"\n\nA fine day but misty in the morning.\n\nThere was a roll call early this morning to see if any were missing. We left about 1 o’clock and was soon out at sea. Owing to the low lying mist we could barely distinguish the city, but the tops of the mountains were in clear blue sky and presented a fine sight. The coast line is very high and rugged and we were in sight of land for several hours after leaving the docks but as we were far out to sea and the landline hazy we could not see very much except their outline and tops.\n\nThe ship’s course this afternoon is very near S.E. There are no classes today, in order to give the lads a rest to recover from their tour of the Cape.\n\nFriday April 25 1919\n\nA beautiful day. This morning there is nothing but a world of water with a few seabirds to look upon; the blue sky and a few clouds. We will have a similar outlook for nearly 3 weeks.\n\nSports were to be held today – Anzac Day – but they have been postponed until Monday. The Ships Paper was issued today. It is called the \"Shropshire Blimp\" and is a good souvenir of the trip. It was printed in Cape Town and contains a photo of the Shropshire. There were several short articles by myself in the paper including the First Prize Short Story, and a second prize, Reminiscence. The paper is sold at 9d. though its published price is 6d, and it finds a ready sail.\n\nThe course today is about 5 points S. of S.E.\n\nSaturday April 26 1919\n\nEasy day sail from Cape Town. \n\nThe shorthand classes were resumed yesterday and carried on today.\n\nSome of the students are well advanced. Colonel Ulrich has resumed his lessons and is getting on very well.\n\nOur course today is S.E. but the distance travelled has not been published.\n\nSunday April 27 1919\n\n4th days sail from Cape Town. Our course is S.E.\n\nThe weather since we left Cape Town has been very good in fact it has been a little too warm especially yesterday which was very close.\n\nEarly this morning the steamer Port Macquarie was in sight and by 9.30 we passed her on our port side about 2 miles away. She left Cape Town about 24 hours ahead of us with troops. In about 6 days we expect to overtake the \"Cluney Castle\" another troop ship that left Capt Town the morning we arrived there, Easter Monday.\n\nThe shorthand class was held this morning. There was a church parade today at 11. am. It was very poorly attended. There will be a sing song this evening at 7. pm. a large quantity of food is wasted every day in this ship. After every meal on both \n\nsides of the ship numerous loves of bread many of them untouched can be seen floating by besides bully beef & potatoes. Too much is issued, & what is not eaten is thrown overboard instead of being returned when it could be made into pudding. This time last year many could not get enough to eat and they may yet be glad of the bread they are not wasting.\n\nThe two prizes I won in the Literary Competition were paid to me today. 1\/6 first prize for the short story, and 5\/- second prize for the Reminiscence.\n\nGambling amongst those who have skill some money left still goes on. Sunday makes little difference.\n\nMonday April 28 1919\n\n5th sail from Cape Town. \n\nIt is very stormy this morning, the sea is rough, and the ship is rolling a lot. The decks are wet with spray.\n\nThe Shropshire is a large liner that has been made into a troop ship. She is a twin screw steamship, built and engined by John Brown & Co. Ltd. Clyde Bank in 1911. Length 525 ft.\n\nBeam 61 ft. 4 in. Depth 36 ft. 6 in. Gross tonnage 10,374 tons, net tonnage 6,586 tons, carrying capacity 12,542 tons, registered tonnage 7,817 tons. I.H.P. 644. Average speed 14 knots. Master Capt. J.L.H. Hunter. Chief Officer, D. McMillan. 2nd Officer S. Bastian. 3rd Officer G. Willis.","4":" officer J.C. Boyce. Chief Engineer G. Little. The ship is fitted with two sets of quadruple expansion expansion engines to drive her two propellers. The draft is about 25 ft. There 14 winding engines forward and 7 aft making 21 in all including an extra large one in the bow and stern.\n\nThe boiler room is fitted with 4 boilers placed side by side. Two of which are fired from both ends. There are 24 fires in all, and she burns about 80 tons of coal per day.\n\nThe ship course has been altered. We are now travelling about 30 degrees south of East which is nearly half way between E and S.E. The latitude is about 38° South and the Longitude about 40 degrees East.\n","5":" 170\n\nA fine day. The sea is much calmer, but a\n\nbit chopey. The wind is behind us consequently the ship has ceased rolling so much. Yesterday it was with difficulty that the decks could be walked without hanging on to the taffrail. The course is about 65 South by East.\n\nThe shorthand class is now in full swing and some of the students are coming on fast. The colonel is also making good progress.\n\nThe distance travelled for the 24 hrs. ending noon today is 312 miles, an average of 12.2 miles per hour.\n","6":" 171.\n\nWet and stormey with a high sea running. The ocean is covered with white foam.\n\nThe following has been posted up today by the ship’s officers.\n\nLongitude 39° 53’ South Longitude 55° 50’ East. Course South 87 East. Distance travelled 315 miles. Steaming time 23 h. 33 m. Average speed 13.4 miles. Temperature 62° Wind West. Total steaming time: 146 hours 24 min. Distance travelled from Cape Town 1872 miles. Average speed 12.8 miles. To Adelaide 3873 miles.\n","7":" 172\n\nIt is much finer today. Four months of the year has gone by and the last month has been \n\non the high seas. It is estimated that we will be in Melbourne about the 15th of the month. The course today is about the same as yesterday. The sports that should have been held last Monday, but were postponed on account of the rough weather, were held today. They consisted of , fancy dress contests, obstacle race, and threading the needle. Needless to say they made a lot of fun.\n","8":" 173.\n\nA fine day. The sea is calm but the ship is rolling a lot on account of the rear wind. Where we have a head wind she is very steady. Some of the events in yesterdays sports that were not completed yesterday are to be run off today. At noon today we were in Lat. 40° 5’ South.\n\nLong. 68° 13’East.\n\nCourse S.88 East.\n\nDistance travelled 296 miles. Average speed 12.5 miles. Wind West. Temp; 67. Steaming time, 23 hrs. 33 minutes. Yesterday the distance travelled was 287 miles & the average speed was 12.1 miles and the temperature 60° with W. Wind. Today there was an issue of very good table biscuits.\n","9":" 174.\n\nFine but cloudy with smooth sea.\n\nThis morning there was an issue of tobacco cigarettes with and McRobertsons butter scotch.\n\nThe Latitude today at noon was 40° 14 S. Longitude 74 ° 37 E. Course S.88 E. Run 295 miles. Steaming time 23 hours 34 min. Average speed 12.5 miles. Temperature 61°\n\nDistance to Adelaide 3012 miles.\n\nI changed a pair of old boots for a pair of new ones. \n","10":" 174\n\n11 days sail from the Cape. \n\nFine but dull & cloudy, rather cold with a light breeze from the N.W.\n\nLatitude by observation, 40° 14’ south.\n\nLatitude by observation, 61° 7’ east.\n\nDistance run east, 298 miles.\n\nSteaming time 23 hours, 34 minutes.\n\nAverage speed 12.7 miles.\n\nCourse and distances to Adelaide, east 2722 miles.\n\nTemperature 59°, wind north-west, light breeze, a solid sea. The ship is not rolling much.\n\nI was at church parade this morning. The congregation was small, but larger than usual. There were nearly a dozen officers present, several nurses, and officers wives.\n","11":" 175\n\n11 days sail from the Cape. \n\nA fine day but a bit cold with N.W. breeze.\n\nThe sale of books in the educational department will cease on next Thursday. On Wednesday I have to send in to the Educational Officer,\n\nMr Beer, a report concerning the Progress of my shorthand class.\n\nAt noon today we were in latitude 40°24’ S., longitude 87° 44’ south east, course S. 88 E., distance 303 miles. Steaming time 23 hours, 3 minutes. Average speed 12.8 miles. Distance to Adelaide 2409 miles. Temperature 6o, wind west north west.\n\nThere is a marked difference between this voyage and the voyage coming over. One of the most noticeable is that lights are shining brilliantly on deck and below, with the port holes open. Coming over all was in darkness and the Port holes had to be kept shut when the lights were on.\n\nOn this ship gambling goes on unheeded and discipline is very lax, while on the Persic gambling was rigorously suppressed, while discipline, though it was not severe, was observed. Again there were a few parades and physical jerks nearly every morning and occasionally during the day with lectures on military subjects. On this boat all that is absent, except a very rare fire alarm which is carried out in a desulatory way. There are a very few fatigues, which amounts to answering the roll, taking their stations\n\nand then retiring as soon as they are inspected which is as soon as they are assembled at their posts. The other two fatigues are the butchers at the canteen which do not take very long in the mornings. All other duties such as cleaning the decks (which is done by the crew) and cleaning the washhouses, latrines, etc. are done by a permanent fatigue, and they receive 1\/- per day extra. The military police formed from among volunteers who are stiff, also receive 1\/- per day extra. On the Persic all these duties and fatigues were done by the soldiers (except Pioneers and Transports) and without any extra pay.\n","12":" 176\n\n13 days sail from Cape Town. \n\nLast night we were in wireless communication with Perth. This is the first news that we have received from Westralia, and was to the effect that President Wilson had again visited Italy, and was very quietly received in fact there was no official welcome. Also the Peace Terms would be submitted to Germany in a few days, and they are to receive 15 days to\n\nconsider it and submit their answer, which is to be in writing.\n\nToday is rough wet and cloudy with a southerly wind. The sea is very lumpy and this afternoon there are some very heavy swells causing the ship to roll a lot. The distance travelled from noon yesterday to noon today is 295 miles.\n\nI bought a book from the education office today called a short history of Australia for 6\/3.\n\nI also wrote out a report re the progress of the shorthand class for presentation to the Educational officer tomorrow.\n","13":" 177\n\n14 days sail from Cape Town . \n\nIt is very stormy today, with strong southerly winds. A high sea is running, and the Portside of the ship is out of bounds on account of high waves occasionally breaking over the sides. The ship is rolling continually, and at breakfast plates and dishes were sliding all over the place Many of the mess orderlies (there are two to each table) got falls coming down the \n\nstairs, spilling the food.\n\nThis evening only one in my class turned up. Some are sick & the others are not inclined for work.\n\nThe ship rolled all day and is still rolling at time of writing tonight & likely to roll all night. The wind changed this evening to the South East.\n\nThere is a good deal of speculation as to whether we will call at Adelaide or not. The Captain’s orders are to proceed to Adelaide but there is a possibility that this may be cancelled by wireless as there are not many more than 100 S. Australians on board & it would mean reaching Melbourne a day & a half sooner. However, I doubt if the orders will be cancelled.\n\nToday & tonight nearly all the troops are below decks, as the weather is too rough to remain long on deck, and one can only walk with difficulty.\n\nToday I got the Colonel’s signature in my autograph book and left it with him to obtain some more officers.\n\nThe distance travelled today is 294 miles & the course is practically due East.\n","14":" 178\n\nA nice change in the weather.\n\nThe wind has dropped the sea is calmer, and the ship is not rolling so much.\n\nSince I left Cape Town I have signed my name many times in various autograph books and today one of the nurses have been going round collecting autographs for her book. The ships paper which has two pages for autographs was the start of the hobby. I have 3 copies of the \"Shropshire Blimp\" partly filled up with autographs.\n\nDistance travelled from news yesterday to news today is 284. \n\nThe army is a great institution for rumours. They are always floating round, and are often started by some practical joker. At sea they are as numerous as on land. On this ship there are the usual crop of rumours. One in circulation just now is to the effect that the skipper is going to spring a surprise on all by suddenly bringing us into Port a few days before the expected time and that the distances marked on the chart are faked and that we are much closer to Port than the chart shows. I doubt it. Some jokes take the form of a notice posted up on the canteen wall. One posted up was to the effect that the red cross\n\nwas issuing khakie shirts. A few were fooled by this, and another was that leave at Adelaide could be obtained by early application to the Orderly Room. Some 200 sent in applications. This raised the ire of the adjutant, Cpt. Brennan, and he had a notice posted up warning all ranks that no notice was to be taken of any notification unless it was signed by some competent authority. To day there are furphies (rumours) that there is a coal strike in Melbourne & that the ship will be bound to go to Adelaide for coal and remain there a day or two while another is to the effect that we will not call there at all. There are all sorts of rumours afloat – and they are generally contradictory, but there are always some to be found who will champion the rival merits of the opposing furphies. These debates, cards & various games help to pass away the time. While those of studious mind spent a lot of their time in learning bookkeeping, shorthand or mathematic (there are classes for each on board) or by reading books from the red cross library.\n\nDuring the last week of the voyage, the rumours become more numerous more persistent and more improbable. All owe their origin to the fertile imagination, the love of fun & practical joking of the diggers.\n","15":" (179)\n\nDull & cloudy all day. A wireless message came through last night which has greatly pleased the ship’s captain, but its nature has not yet leaked out. It is known that the skipper does not want to go to Adelaide, and it is thought that it may mean the ship is not to go there after all.\n\nLast night a concert was held in the Sargeants mess. The programme consisted of songs, commicalities and two recitations by Brigadier General Lloyd which were well received. The first was Kipling’s \"Down\" & the second a humorous one called \"When Maud puts on her new bathing suit\".\n\nA long press wireless news from the Navy office Melbourne dated May 8 states that the Peace Terms have been presented to Germany. The ceremony of presenting only occupied 14 minutes. Her delegates declare that Germany\n\nis willing to pay for the restoration of Belgium but refuses to pay other indemnities.\n\nPresident Wilson has agreed to lay before the Senate protocols for the protection of France. Lloyd George has agreed to lay similar proposals before the authorities in England.\n\nJapan has instructed her delegates not to sign treaty assigning Shantung to China.\n\nThe ex Kaiser with others responsible are to be tried Hard and fast terms are laid down for Germany in the payment of indemnities bearing interest at 2 ½ per cent. If they are not paid in the stated time they will bear interest at 10percnt;.\n\nWe were at noon today South of Cape Leuwin, distance about 200 miles.\n\nThe course is not altered. It is about 10° N. of East. The past few days very few particulars have been published about the ship’s movements, except the course marked on the map. The distance travelled from Noon to Noon is 293 miles.\n\nThe weather was showery this afternoon. Last night I noticed for the first time about 9. p.m. wireless messages. There was a loud hissing sound\n\nbroken into long and short hisses in which the letters of the Morse alphabet could be plainly heard. Any one who knew the Morse alphabet could read it. The wireless apparatus which consists of 4 wires strung between two masts and over the bridge, and insulated at the ends showed bright sparks of light, and sometimes a continuous flame where the wires were fastened to the insulation.\n","16":" 180\n\nmore wireless messages were posted up this morning, one of which was to the effect that Australia is to receive all captured German possessions south of the Equator with the exception of Samoa which goes to New Zealand. Japan is to receive all those North of the Equator. Today is fine. The sun is shining out bright and warm. In fact it is a typical Australian day.\n\nThe gun crew had some gun practice this morning. This is the first time they had any during the voyage. The gun is a 4 in 2.F. Naval type. They fired several shots at a target and succeeded in hitting it.\n\nThe following triangulations were posted up today. Latitude by observation 34° 10’ south. Longitude by observation 119° 25’ east. \n\nRun N.E. S.E., 298 miles. Steaming time 23 hours 35 minutes. Average speed 12.6 miles. Course and distance to Adelaide, 951 miles. Temperature 59, wind south west. Weather, mild to light winds. Medium sea, south west swell. \n\nThere were officers sports to provide fun for the diggers this afternoon. There were several boxing contests which afforded much fun & provoked many remarks. The musical chairs were very amusing, the Padre Cptn. won his heat and was well up in the final. He would have won had his two opponents not cheated him by keeping inside the ring. These sports will be continued tomorrow. The C.O Major Matthews and the Doctor Cpt. P. O’Shea were competitors in the musical chairs but failed to win places.\n","17":" (181)\n\nA beautiful day.\n\nEveryone is remarking that we are having Australian weather.\n\nThere is a rumour floating around that a S. O. S. signal was received from the Port Macquarie last night to the effect that her engines had broken down.\n\nThe wireless message\n\nthis morning dealt with the German delegates speech to the Peace Conference. It occupied 50 minutes, was delivered sitting and is described as studied insolence. He said it would be a lie to say that Germany was responsible for the war. All Europe was responsible. The atmosphere had been poisoned for 50 years. He spoke as if he was one of the victorious national representative instead of a delegate for a vanquished nation.\n\nCpt. Syd. Barker an Australian flew from the Thames Westminster to Margate, and delivered a message to the Major from Australian High Commissioner and delivered the reply message from the Major within 5 hours.\n\n3 of U.S. air ships in the Atlantic flight have reached Halifax.\n\nThere was a final Church Parade this morning, which was very well attended. The hymn \"God be with you\" was sung.\n\nThe following particulars have been posted up on the canteen board. Latitude by observation, 38° 19’ S. Longitude by observation, 125° 45’ east. Run north 80 E. 301 miles. Steaming time, 23 hours 36 minutes. Distance to Adelaide 650 miles. Temperature 62. Wind west. Weather, light wind, solid sea.\n\nToday I wrote two letters, one to my sister, Mrs. Gibson, one to Mr. Murphy McCallum .\n\nThe officers sports were continued this afternoon and afforded much amusement especially the pillow fight on the greasy pole which generally ended in both combatants slipping off into a large canvas trough of water below. There were no rules in this game, and one onlooker, a stoker who was sitting on a hatch above with his feet dangling below, frequently gave the contestant below him a push which sent him into the water. It ended by one of the officers who had been ducked grabbing him by the legs and pulling him down into the water admidst the laughter of the crowd.\n\nA very good concert was held tonight in the officers mess. Major Kelly contributed a recitation, and Mr Turner of the Y.M.C.A. contributed several recitations and songs which were very popular.\n\nThis was the last concert and the C.O. Major Matthews who presided took the opportunity to thank all who had contributed to the various concerts during the voyage.\n","18":" 182.\n\nThere is a sharp change\n\nin the weather this morning. The sky is overclouded and there is light misty rain at internals with a cold S.E. wind.\n\nThe following particulars were posted up today. Latitude by observation 131° 59 east. Run No. 75 E., distance 368 miles. Steaming time 23 hours 36 minutes. Average speed 13.05 miles per hour. Temperature 60°, wind S.W. Weather wind and sea. Distance to Adelaide 345 miles. \n\nToday I wrote to Tom .\n\nThe port engine broke down tonight about 9 o’clock and it was 10 before she was got going again. In the meantime only the starboard propeller was in motion. The ship was moving at only half speed.\n","19":" May 13.1919. 183\n\nA beautiful morning. Early this morning Kangaroo Island was plainly visible on the starboard bow. After breakfast we were abreast of it and quite close to the shore. It was the first glimpse of Australia that we had seen in years and the sight was a pleasant one and awoke many memories of former years. Kangaroo Island is a large one, and very fertile. At 9.30 on the port side we could see other islands standing high out of the sea ne of which had a lighthouse on it.\n\nLater we could see portions of the mainland and the channel to one of the gulfs. At 1. a.m. we had not passed Kangaroo Island.\n\nThe distance travelled from noon yesterday to noon today was only 273 miles the falling off being due to the stoppage of one of the engines last night. The distance to port is 72 miles. As we are not travelling at the usual average speed it will be close on 7 a.m. before we get into port.\n\nThis morning I spent collecting autographs, on the ship’s paper the \"Shropshire Blimp\". Throughout the afternoon we were in sight of land all the time on the starboard side. By 6. o’clock we were in the harbour and before dark we had a visit from the port medical officer, but he did not come on board. The anchor was dropped and another boat with fresh vegetables came alongside. We had a good view of Port Adelaide, which is not a very imposing place, and a good view of the harbour which had several ships and coal steamers at anchor. Also another troop ship The Balmoral Castle which had arrived a day\n\nor so before us.\n","20":" May 14.1919. 184\n\nA fine morning.\n\nThe reveille was at 6. And breakfast about 7. which was an hour earlier than usual.\n\nThe customs boat and the medical boat came alongside about 8.The medical officer came aboard and inspected all hands commencing with the crew and then the S. Australian & Westralian troops on a Deck. As the temperature of every man had to be taken it was a long job. \n\nThe South Australians troop with a number of officers & one nurse left the ship in a harbour boat about 11 this morning. The Shropshire blew several blasts on the siren at intervals, and the soldiers on board waved farewells to them.\n\nIt has been very warm this afternoon and no breeze. It was stifling below. There was no draught owing to the ship not being in motion.\n\nThe Shropshire weighed anchor and sailed at 3 o’clock. I was down below when she started, waiting my turn to be paid. All troops were paid this afternoon. This is their final pay on the boat. All men\n\nL5 and upwards according to the credits in their books. I drew £5, which was paid in English notes. These notes are guaranteed by the English Government & there is no exchange on them in Australia or South Africa.\n\nThe delay in sailing this afternoon was caused by the delay in repairing the engines.\n\nAbout 8.30 we had passed through Back Stairs Straits a narrow passage between the mainland & Kangaroo Island and was soon out into the ocean when she commenced to roll and she met the heavy swells of the Southern Ocean.\n\nThis evening I repacked my things in the two kit-bags and also crammed in the red cross goods which were issued to us in a large pillow slip. A haversack which I used to contain some souvenirs, papers, etc. I gave away to a coal trimmer to get rid of it, as in all probability our things will be inspected by the customs & military authorities in Melbourne. The customs will look for dutiable goods and the military for army goods that are not an issue.\n","21":" 185\n\nA fresh southerly breeze blowing and a heavy swell. The course is a little more than South East. At 9. A.m. this morning we passed Apollo Bay, South Australia.\n\nAll the classes have finished their works and will not again resume work on the boat.\n\nHousie, crown & anchor and two up were in full swing last evening after pay and again today. Some of the troops are nearly broke already. A subscription was taken up by one of the Sargeants at dinner hour for two English stow aways on board. At our table every man gave a shilling. Before one o’clock Cape Northumberland with its lighthouse was in view, also Mount Gambier some time previously. At 2 p.m. we had passed them and by 3.30 the Cape was out of sight but Mt. Gambier was still in view in the hazy distance until 4 p.m. The ship is rolling very much & there is a cold S.E. wind blowing.\n\nWe handed in our suits yesterday. We were paid. They are valued at 10\/-. \n\nAs Mt Gambier moved out of view Cape Bridgewater came in\n\nsight and later Cape Nelson. I spent most of the afternoon on deck to have a look at old and familiar views. At tea-time we were abreast Cape Bridgewater. About 6 pm we had passed Cape Bridgewater. The light of Cape Nelson showed out fully half an hour before we had passed the Cape. About 8 we were out of sight of the Nelson light.\n\nThe ship is not going full speed owing to the port engine being defective and only run at a very low speed.\n","22":" May 16.1919. 186\n\nDull & cloudy but fine. Most of the troops were up very early this morning in anticipation of getting ashore today, for there is always a lot of work to be done before disembarkation. Blankets and hammocks to be handed in and stored also table utensils and everything to be left clean. I woke up at 6. And we were then abreast of a little fort with a small lighthouse and about 3 ½ hours from the heads.\n\nThe pilot met us outside the heads & by 9.30 we\n\nwere opposite Barwon Bluff on the point of going through. When we got through, there was a long wait to comply with quarantine regulations. The temperature of all the troops was taken and this took a considerable time. It was 11 o’clock when H deck was finished. Blankets and hammocks had been handed in before this and life belts stored in the kit room. I saw Colonel Melrick at 9.30. He gave me £1 for teaching him shorthand which was more than I expected. In fact I did not expect anything, and did not want to take it, but he insisted. He also collected a number of high officers autographs for my book.\n\nAbout 11. 45 we were under way again up the channel to port. We were alongside the Port Melbourne pier at 3. P.m. There was a band playing, and after some delay we were allowed to go ashore and were driven in motor car to the Stuart St. finalisation depot passing through Flinders, Burke, Elizabeth \n\nand Swanston Sts. to the Stuart St depot where we met our friends and were dismissed until 10 tomorrow.\n","23":" 187\n\nI stayed at the Peoples Palace last night and was in good time at the depot. By 11.30 I had passed right through the various examinations and taken to have my eyes checked. I was given a pass to Merrigum & 7 days leave. I joined the returned soldiers association & subscribed to the \"Bayonet\" the organ of the Returned Soldiers Association.\n\nIn the afternoon I went out to Brunswick to see the Beans . They were all at home & glad to see me.\n","24":" 188\n\nA beautiful bright day. The weather has been splendid during the past few days, quite in keeping with all the welcome home coming for the troops. The streets and motor cars for the troops are decorated and great crowds were in the streets when we landed on Friday. Today more troops were landed, amid similar rejoicing.\n\nI was at St Paul’s\n\nCathedral this morning with Lizzie and this afternoon went for a walk along the St. Kilda road to the gardens & saw some returned soldiers come home to the depot. I met in the streets several men of the 37. Battalion in civies. Charlie Cunningham of the Pioneers was one.\n","25":" 189\n\nA fine day. I spent all day in Melbourne.\n\nI called at the Barracks and got my hat exchanged for a new one.\n\nI also called at Murray Moores, John Cooper & Son, also Alexander Mair & Co. I bought a book on oxygen-accteyelene by price 6\/-.\n","26":" 190\n\nI was up at 5 this morning and we caught the 6.15 train for Merrigum arriving there about 12.30.\n\nA very large crowd was there to meet Private Manley and myself. The S. children sang \"Home Sweet Home\" under the direction of the school teacher Mr Nash. One of the scholars presented us with our Battalion colours\n\non which was printed welcome home and read an address of welcome. Mr J. Andrews made a short speech welcoming us on behalf of the residents. A photographer took a snap shot of the crowd at the station. Outside the station motor cars were waiting to drive us home and another snap shot was there. Mrs Wilson & I were then driven to Mr Millers where we had dinner. When we got home the Union Jack was floating over the gate and on the door a large flag bearing the words welcome home in large white letters on a red ground.\n","27":" 191\n\nFine in the morning but showery in the afternoon.\n\nI was over at the school this morning with a large tin of lollies for the children. I spoke to the children at the request of the teacher describing some of my travels in England.\n","28":" 192\n\nThere was 10 points of rain last night, and it has\n\nChildren’s Cot\".\n","29":" 1919. 195\n\nCloudy this morning but fine in the afternoon. I had a look around the grounds this morning. The Red Cross has a large building here containing recreation, reading & writing rooms also tea rooms. The Y.M.C.A. have similar buildings. All the wards are kept scrupiously clean and neat.\n","30":" 196\n\nA fine day.\n\nI saw an eye specialist this morning at 10 and I am to go to Ward 18 tomorrow for the glasses. I saw several that I knew, Corporal D. Varden of the 37 Btln. Who was a prisoner in Germany and Walton Moor of Heywood who is now a corporal with a decoration. \n\nI wrote to Wally and also to my wife today. \n","31":" 197.\n\nA beautiful day. This afternoon I went into the city by train to see one of Sir Harry Lauder’s concerts in the Kings Theatre. It was a real treat. Sir Harry did not come on to the stage until the second part of the programme. He sang and acted a number of songs, \n\nin various characters -- a Scotch soldier, an old man, a sailor and a school boy. Finishing up with a speech, and a new Australian song composed by himself, and sung on the stage for the first time this afternoon. A General thanked him for the entertainment he had given us, and then Sir Harry got down amongst the audience of soldiers while a flash light photograph was taken.\n\nDuring the interval I met Mr Chapman who was one of the Transport officers of the 37 Battalion.\n\nI had tea at the Talare and came back to the hospital by train arriving back about 8.\n\nI failed to see Mr. Sidney Scott the optician this morning and I will have to wait to Thursday before I can get my glasses. \n","32":" 198.\n\nA nice day but rather frosty last night. In fact it is cold every night here. I filled in a card today which entitles me to a grant every week as long as I am in hospital\n\nof 8\/- per week from the State War Council. \n\nI did not go out of the hospital grounds today but spent most of the time either in the Red Cross Rest House or in the Y.M.C.A. Both institutions have a library, games the Red Cross is putting up another building. All the brick work is finished and the carpenters are putting on the roof which consists of tiles made out of cement.\n\nTonight I was shifted from No. 11 bed to No. 8 bed called \"The Hamburg West and Karramomus Cot\".\n","33":" 199.\n\nA fine morning.\n\nThis morning I was before an ear expert – Major Schuber – to see what was the cause of my deafness. He said it was of the ear canal caused by living in cold countries, and that I would have to live in a warm climate or it would get worse.\n\nThis afternoon upwards of 60 of us went for a motor trip around the outer suburbs. The trip was given by the members of the Victoria Automobile Club. The car I was in was driven by a lady. We passed through\n\nCaulfield, Camberwell, Surry Hills, Armadale and back to St Kilda where we stayed about an hour, and was given tea & refreshments by the ladies of the Y.M.C.A. Then we were driven back to the hospital at Elsternwick. It was a fine trip and everyone enjoyed it – though in places the roads were rather dusty. There were several officers with us including Mr Chapman of the 37 Btln.\n\nToday I read Professor Lyndall’s famous \"Belfast Address\" in 1874.\n","34":" 200.\n\nA fine day.\n\nI saw Mr Sydney Scott this morning about glasses & I am to go into the city this afternoon to get them.\n\nI was transferred from Ward 11 to Ward 19 bed 9 today.\n\nI obtained my pay book from the Tax Office this morning. I also received a letter from Milne this morning. This afternoon I walked out to Brighton with Dolly Varden where his people live and spent the afternoon there. We also walked down to the beach and had a look around the boat sheds where the racing boats are kept and were shown over the B.Y.C.\n\nRooms and bar. Mr Varden is Chief Clerk in the Post Master General’s Department. We came back by train to Elsternwick, Mr Varden accompanying us and then walked to the hospital.\n","35":" 201\n\nA fine day.\n\nThis afternoon I trained into the city to see the optician but he was not in. At the \"Soldiers Institute\" at St Paul’s. I wrote some letters while there I saw the men from the troopship Wyreema driven through the streets to the depot. The men from the Medic came in this morning.\n","36":" June 1, 1919, 202 days \n\nA beautiful day. Five months of the year has gone by and I am still in the Army and have entered upon another month and again in hospital but in an Australian one and with every prospect of an early discharge from the hospital & with it from the Army.\n\nThis morning I was at church in the Y.M.C.A. and directly after went for a motor trip to Mentone.\n\nA description of the trip is contained in Book 15.\n\n"}}