{"Document Name":{"0":"Diary_0371","1":"Diary_0371","2":"Diary_0371"},"Date":{"0":"unknown","1":1743.0,"2":1778.0},"Entry":{"0":"\n\n","1":"\n\nWe left the hut mentioned above on morning of August 31, and marched toward the now ever shifting \"Front Line\". One time the \"front line\" meant an elaborate system of drained & revetted and duck boarded trenches with crude shelters (called by courtesy, Dugouts – but now it is a very \"sparsely populated\" line of soldiers crouching in any cutting, declivity, hole or trench that offers itself: soldiers who just wait long enough to draw breath and open a tin of Bully, and then move on if so be it is their fortune to be able.\n\nHalting at noon near some Eighteen Pounder Batteries we stayed there for an hour and then continued our journey forward – a Berlin. Fritz put up a terrific bombardment on the road and it is marvellous how so many of us escaped death.\n\nIf ever this is read it will doubtless occur to the reader that I have too often reiterated this statement. But every day that one survives in this shell swept area is to me - and must be, I think, to any who seriously reflect – at once a bewilderment a marvel and a miracle.\n\nAbout 3 in the afternoon we halted beside the Somme in a railway cutting - and here for 8 hours we were subjected to a merciless bombardment by heavy artillery. And during the whole\n\nof the hours of daylight, platoon after platoon, company after company, battalion after battalion, hove into sight across the stream, sauntered placidly and slowly – or was it wearily and apathetically – along the shell torn road, crossed the narrow, crude, wooden bridge across the Somme, and nestled close as they could under one of those almost perpendicular heights of this region, there to wait till the friendly but portentious darkness made it possible to struggle further on. I shall never forget the heroism of a few engineers who amid a tornado of shells kept repairing this little bridge across the river. Shell after shell burst alongside them with a deafening roar and splashed the water mountain high, yet they went on with their work unperturbed and unhurried as though they were working in the peaceful solitudes of their own Australian bushland; and they never desisted while the light was good. They seemed to bear charmed \nlif\n lives until the dusk fell and their task was done. With the waning of the day the troops who were to participate in tomorrow’s orgie were disposed in the cracks and crevices on the right side of the Somme and the little bridge, with the help of the dauntless engineers had served its immediate purpose, and the former was waiting demolition by a well directed shell, and the latter\n\nwere busily engaged in preparing their \"supper\". Some were attending the fire which had been lighted under the foot of the cutting – rather an audacious precedent considering our proximity to the foe and the activity of his planes – some were sitting round and smoking, and others chopping. Nearly all were singing snatches of the latest songs (for it is marvellous how quickly the choruses find their way from the London Theatres to The Front). Fritz had shortened his range and his shells were bursting just on the edge of the bank. Somehow I sensed an impending catastrophe. Those most concerned didn’t: or, sensing it, took no notice. A flash of light, a more angry crash than usual, and Death had descended and gathered those gallant souls into eternity.\n\nBut why particularize when\n\n\"Death is here, Death is there\n\nDeath is busy everywhere.\"\n\nCappy Sept. 23\/1918\n\nSince writing last nothing of importance has happened. We are still in the same place, doing the same things i.e. a little drill and a few games each day and plenty of sleep each night. For we are making up for those \"Days of danger, Nights of waking\" up at Mt. St. Quentin.\n\nNot far from here is a fifteen inch gun, captured by the first Brigade, towards the end of August. I have been over to see it on two occasions and I think it is a triumph of implacable ingenuity. The barrel is about 45 feet long, measures 7 feet in circumference at the muzzle and 15 feet at the breech. It has been use – four shells are supposed to have been fired from it, most likely upon Amiens which is distant about 30 Kilos for the trees towards the front are blackened and blasted and withered. It is thought that the gun was blown up by the bursting of a shell in the barrel (\"a premature burst\") although it is not known definitely. Whatever the cause the explosion must have been terrific, for solid pieces of steel weighing almost a ton each are lying about the site; and I saw one piece weighing fully 6 cwt. lying 8 hundred yards away. The thickness of the steel at the breech is 13 inches and this has been shattered into great jagged\n\nsplinters that now hang down and testify to the awful power of the Bosche H.E. The circular platform on which the gun revolves is fully 20 yards in diameter. And this monster was doubtless put there for the purpose of hurling shells a ton weight among the unsuspecting residents of Amiens. Many a leisurely stroll I have had across these quondam lovely fields of Picardy and marvelled at the profusion of cornflowers and poppies that almost hide the ugly shell holes and uglier trenches; and I wonder if those responsible for the war could have \"dipt into the future\" and seen the result to this rich and beautiful land, would they have been demoniac enough to have launched it on the world.\n\nPadre Buckley gave us a nice little talk about \"writing home\" on Sunday – how the poor old Mother would wait and watch and hunger for news from France – and I can just imagine my old Mother and wee sister watching for Postie. Not that I ever miss when it is possible to write but –\n\nAgain he’s gone, O God! No look, no sign\n\nThe cruel Postman’s past my gate again.\n\nMy son! My Son! No letter – not one line.\n\nFor hours I’ve stood here in the wind and rain.\n\nAnd watched the busy traffic thread the street:\n\nOr saw at times a yellow, winter’s leaf\n\nAs down it whirled and rested at my feet\n\nLike some dead Hope that mocks a living grief.\n\n- These things I saw; yet as from far off lands.\n\nOne form alone was plain to these old eyes,\n\nAnd it was marked as suppliant marks the hands\n\nThat Heart’s Desire gives, or else denies\n\nI saw him turn the corner and stroll on,\n\nAll careless of the precious freight he bore.\n\nHe slowly oped a gate and crossed a lawn,\n\nAnd, standing framed within a neighbour’s door\n\nBlew that shrill note, that music makes to ears\n\nOf Mother, Sister, Sweetheart, daughter, Wife;\n\nMakes hearts to leap for joy and calms the fears\n\nFor him so far away in that red strife.\n\nHe gave the boon to trembling hands and turned:\n\nAnd Fancy said \"He’s crossing to \nyour\n gate\"\n\n\"Behold that well-loved scrawl of his.\" I yearned\n\nTo grasp my prize, but something bade me wait.\n\n… And now he’s gone, and my old eyes are dim.\n\nA blackness surges o’er me like a sea.\n\nAll Hope is gone. Forgotten – and by him\n\nWhose love was all that Life held dear to me.\n\nWeek after week I’ve striven to trace my heart,\n\nIn ill-formed characters; with Time-tired hands\n\nAnd tear-dimmed eyes; and heeded not the smart\n\nFor what do these things count when Love commands.\n\n… Hadst thou remembered son, I could have borne\n\nThe utter weariness for Love’s dear sake.\n\nThou lovest me not: so everything is gone.\n\nMy heart is chilled O God! that it could break!\n\nI know things take on a more sombre hue when\n\nmy\n letters do not come.\n\nI crouch low in the cold muddy trenches\n\nAs the bullets go whistling by\n\nAnd the shells go shrieking and screaming\n\nAnd the flashes are brightening the sky.\n\nThe thunders on thunders go rolling\n\nAs the Titans their awful bolts hurl\n\nBut I’m wondering and wondering and wondering\n\nWhy no letter comes out from the girl.\n\nNow the daylight the darkness is hustling\n\nAnd the flashes grow dim in the dawn\n\nThe night of our watching is over\n\nAnd the moment of Zero rolls on\n\nThe world seems to crumble beneath us\n\nYet\n Out there, in the Devil’s mad whirl\n\nYet vaguely and dimly I’m wondering\n\nWhy no letter comes out from the girl.\n\nWe are out of the trench, in the open.\n\nNow each moment is surely out last ….\n\nTirancourt","2":"\n\n…. Well we all got within a hundred yards of the tape before he secured a hit. Then a salvo of 5.9’s came over and one landed right amongst our column. I do not know how many were rendered Hors De Combat by the burst for we could not stop to see, but I know they were lying round and groaning as I passed on. When we had at last taken our position on the tape there was still a few minutes to wait for the opening of our artillery barrage – a few minutes to dream of days gone by, and friends and dear ones far away; to say Goodbye to everything and prepare ourselves for the end: for he is an optimist indeed who crosses that narrow white line in the early dawn in the expectation of returning.\n\nFritz was still pounding away persistently and doing his best to interrupt our reflections; when a terrific roar, which made the hills rock and reverberate, told us that the game was afoot, and we began at once to advance.\n\nAll frailties, failings, fears and feelings were left behind when we stepped into No Man’s Land; and we went forward, more like marionettes\n\nthan men quite oblivious of all externalities. If a shell burst 100 yards away from us as we were coming up there would be an irresistible desire to duck, and a shudder of dread would run down our backs; but now they were bursting within 5 yards and exciting no emotion. Sometimes we would see a gap made in our ranks, sometimes a comrade alongside would fall, perhaps to lie there, or perhaps to immediately rise and make for the rear with a swinging arm, a limping leg or bleeding face, but these things had nothing to do with us, and left us quite unaffected.\n\nAll \nwe\n had to do was to walk leisurely, mechanically forward, through the smoke and smell and din, behind our creeping barrage – and forward we went. We had gone about 300 yards from the \"hopping off\" tape before our little party paid mortal toll to the enemy; though shells seemed to be falling on every foot that held no man. Just then our officer (\"Stan\" Bennie, who had used his own field dressing on my head at Albert in April) came over to Dick Moore and me and for a moment we stood there – I between the two – in that scene of utter confusion, unconscious of any\n\nextraordinary sensation and feeling in no way out of our natural environment, remarking casually on the intensity and effect of our barrage, and waiting for it to lift.\n\nA couple of hundred yards from us, across the valley, a score of Germans were scampering up the hill. \"Put a burst into them\" said Bennie, \"Set down and take your time\", so I got down and sent a shower of lead amongst the unfortunate wretches. Down they went as if blown over by a strong \nburst\n gust of wind. Simultaneously with my firing an enemy machine gun opened up on us from close in front.\n\nAlmost with the first shot I saw Bennie put his hand to his breast turn away and lie gently on the ground. I turned my head silently toward Dick Moore to see him let go his rifle and grasp at his face and I knew he had received a \"Blighty\", an \"Aussie\" or a \"France\" for the whole of his cheek had been blown away by an explosive bullet. As I dropped to his side he said calmly \"I think it’s all up with me now, don’t you?\" Not it I replied cheerfully though by no means sure that \n\n"}}