{"Document Name":{"0":"Diary_0184","1":"Diary_0184","2":"Diary_0184","3":"Diary_0184","4":"Diary_0184","5":"Diary_0184","6":"Diary_0184","7":"Diary_0184","8":"Diary_0184","9":"Diary_0184","10":"Diary_0184","11":"Diary_0184","12":"Diary_0184","13":"Diary_0184","14":"Diary_0184","15":"Diary_0184","16":"Diary_0184","17":"Diary_0184","18":"Diary_0184","19":"Diary_0184","20":"Diary_0184","21":"Diary_0184","22":"Diary_0184","23":"Diary_0184","24":"Diary_0184","25":"Diary_0184","26":"Diary_0184","27":"Diary_0184","28":"Diary_0184","29":"Diary_0184","30":"Diary_0184","31":"Diary_0184","32":"Diary_0184","33":"Diary_0184","34":"Diary_0184","35":"Diary_0184","36":"Diary_0184","37":"Diary_0184","38":"Diary_0184","39":"Diary_0184","40":"Diary_0184","41":"Diary_0184","42":"Diary_0184","43":"Diary_0184","44":"Diary_0184","45":"Diary_0184","46":"Diary_0184","47":"Diary_0184"},"Date":{"0":"unknown","1":488.0,"2":489.0,"3":490.0,"4":491.0,"5":492.0,"6":493.0,"7":494.0,"8":496.0,"9":497.0,"10":498.0,"11":499.0,"12":500.0,"13":501.0,"14":502.0,"15":503.0,"16":504.0,"17":505.0,"18":506.0,"19":507.0,"20":508.0,"21":509.0,"22":510.0,"23":511.0,"24":512.0,"25":513.0,"26":514.0,"27":515.0,"28":516.0,"29":517.0,"30":518.0,"31":519.0,"32":520.0,"33":521.0,"34":522.0,"35":523.0,"36":524.0,"37":525.0,"38":526.0,"39":527.0,"40":528.0,"41":529.0,"42":530.0,"43":531.0,"44":532.0,"45":533.0,"46":534.0,"47":535.0},"Entry":{"0":"\n\n","1":"\n\nWeighed anchor at 6 am. Are with four other transports and convoy, set out for the Dardenelles. Arrived, about 12 miles the entrance and stopped till morning.\n","2":"\n\nAwoke at 3.30 am. Found we were going full steam ahead and with several other transports were surrounded by a fleet of Battleships, Cruisers, and submarines.\nAbout 4 o'clock we were atDardenells. All went into a big bay and there the Battleships opened fire. Terrific firing. Almost deafening. Just like a great thunderstorm only a hundred times worse.\n\n.\n\nSubmarines darting about all the time.\n\nA Russian cruiser about 300 yds from us was firing at a fort about 3 miles away. See the shells dropping on it.Aeroplanes flying round all the time taking observations of where the Turks were. Began to unload our pontoons about 6.30 am. On our left heavy Rifle firing could be heard were the Tommieswere making a landing. Very little reply given by Turks, a few shells dropping about. Grand to watch the destroyers darting about,Dreadnought about 1 mile off. See 7 or 8 great spurts of flames from her sidethen a terrifficnoise as you would hear the report. Great whizzing in the air as the shells shrieked past and overhead. Nine oclock had a look through the Telescope. Saw\n\none fort in flames. Received word through, that the landing party had affected a safe landing and were fighting.\n\nSome wounded were taken by two destroyers to the Hospital Ship in the rear.\n\nTen oclock got news from the flagship that 5000 troops and a battery of artillery had got ashore safely. Could hear firing as of a heavy battle. Turks retiring with heavy losses. Our losses not so great as theirs.\n\nQueen Elizabeth just on our left. Both moved in to about 1½ miles from shore. She sent 10 shells from 15\" guns into a big fort there. All of a sudden it blew up. Guns and timber flew hundreds of yds heigh. Two Hospital ships in our read .\n\nDestroyers take wounded to\n\n\n\nthem. Two big ships hit just off the bows of one of the transports. Sent cloud of water about a hundred feet heigh.\n\nBombardment still going on with great heat, very little reply from the shore.\n\nGot all our pontoons safely off. Started to go along the left hand side to land in the rear. Went about 9 miles and then stopped. Battleships still bombarding the trenches here. From one boat a large baloonwas floating, taking observations and telephoning it down to ship below.\n\nShrapnel bursting all over the place on shore. Gives a headache the continued noise of the bombarding, fierce battle going on on shore all the afternoon. We drew right in next to the shore.\n\nTurkish battery doing great\n\ndamage with Shrapnel, Battleships soon silenced it.\n\nEight boat loads of wounded brought off to Hospital Ships. Begginingto take them to another ship as she is full.\n\nWe have to leave for shore this evening. Everything ready to go off now. Left the Boat at 9.30 pm under cover of fire from the Queen Elizabeth. Destroyer took us ashore and she was firedat all the way over. Had some narrow escapes but no one hurt. From destroyer into boats and had to row into shore 300 yds.Had to wade up to our knees in water. Went straight in the dark up the mountain side and lined the top entrenches ourselves. Heavy fire from Turks. Spent the whole night in rain getting wounded seen too.\n\nDuring that morning the Third Brigade landed. First to land had to fight from edge of water up. They\n\nwere entrenched and gave our chaps a warm time. Four\n Battleships\n Battalions cut up and the remainder have joined our Battalions.\n","3":"\n\nSpent the morning seeing to wounded - every time we showed ourselves, they would put their machine guns on us and we would have to lay flat while they whizzed over us. The whole place littered with equipment, wounded and dead. Broken bayonets, rifles and ammunition every where.\n\nTurks have 6 machine guns to a Battalion while we have two. Yesterday the ninth started their guns and the Turks dropped shrapnel on them and blew them to pieces. We were forced to\n\nretreat a couple of miles. During the morning we landed three batteries and are now able to hold our own. Their Shrapnel is not so bad today as yesterday.\n\nOne Battalion had only two officers and 1 wounded left alive after the attack yesterday. Three o'clock we made a forward attack on their trenches. Their snipers very busy picking off our chaps whenthey get the chance. We have now heavily entrenched ourselves so that we will have a safe place if we have to retreat. Lieut Dickson first officer hit on our side. Shot through stomach, in a bad way. Since the time we landed the battle has not slackened, bullets whizzing about our ears all the time. The Turks on the slope on our right put to flight by our shrapnel. Had to cut\n\na path down the mountain side to carry wounded to the boats and then to the Hospital ship.\n\nAeroplanes located the battery that did the damage yesterday and the gunboats silenced it.\n\nOur forward attack driven back in centre. Men sent forward to reinforce. Made a charge but the beggars cleared when they saw the bayonets. Gave us two hours of shrapnel. Dozens of the boys wounded. Took till midnight taking them to the beach. From there it was fairly quiet till morning.\n","4":"\n\nMurderous fire with Shrapnel on us all morning. Turks using the uniforms of our dead and using explosive bullets. Not so much damage done to us this morning\n\nfrom their shrapnel for we dug ourselves in during the night. Captured 50 prisoners and have them down on the beach. German Officers in our trench giving orders. Indian battery on our left forced to retire a bit last night. Tommies coming in on their flank and we ought to have them wedged in by this evening.\n\nOur chaps got a German Officer last night, and gave him the bayonet. During morning landed another battery on shore and opened fire on the Turks with shrapnel. Turks bombarded our boats on waters edge with shrapnel for a couple of hours.\n\nNew Zealanders surrounded more of them yesterday afternoon and shot nearly all of them.\n\nUnable to get at our wounded for a while as machine guns are sweeping about.\n\nQueen Lizzie opened fire on\n\non their battery and silenced them for the time.\n\nHails of bullets flying round us for the last four hours, getting monotonous listening to their whizzing and zips although they make us lie low.\n\nSergt Combes got a bullet through his armlast night. Dressed it and took him down. \nWent up into the firing line with a stretcher bearer from the 11th Inf and\n Plenty of good water now and plenty of biscuits. Went down to the water for a wash and had a dip. Shrapnelburst on us. Talk about mixed bathing, men and bullets. Had to scale for our lives. Only 3 or 4 hit. Shelled us all the afternoon with shrapnel. Kept up the\n\nfiring on trenches all night. Got about 2 hrs sleep.\n\nOur casualties up to tonight are nearly 4000.\n\nTurks sunk one of our trawlers during the morning. Have between 125 and 150 thousands Turks fighting us. We are only 25000 to start with.\n","5":"\n\nA few shells came amongst us this morning but things are a bit quieter except for the incessant rifle fire.\n\nSheregold got shrapnel in the hand and broke a few bones. One machine gunner killed (Anderson). Capt Richardson was wounded yesterday afternoon. Capt Moran takes his place. Jock Milne seriously wounded also Wally Cox. Word through as to state of Turks. Dead piled in heaps. Having a very rough time. Queen E blew one of their armouredtrains and ammunition up, also a mile of Railway\n\nline keeps them from reinforcing. Began to rally up the other Batallions. Found no. of killed not so great. Only a few hundred. Not much firing during the night except for sniping. Rained a bit and was very cold.\n","6":"\n\nPosition the same as yesterday. Things fairly quiet during the morning. Only two wounded this morning. Capt Walsh No 3 Coy killed yesterday. Also Lieut Waters. Got two more guns (Indian) into position during the night and they did some heavy fighting during morning. About 2pm Rifle \nfiring\n fire attacking the line got fairly heavy. Gave us more shrapnel at Sundown. Our Batallion relieved by a Batl. of Marines at midnight. We\n\nwent down to the beach for the night.\n","7":"\n\nFirst thing this morning we went to our new position on the left flank. Fire very heavy here lot being wounded in the firing line. Our Batl. does not go into the line this evening. Rest today, did not get any rest for the Royal Marine light Inf. had a rough time and I and three bearers went to help them. Got a hot time for a couple of hours, had to retire from the trenches over a steep range. Every time you lifted your head you would get one round you. About 14 killed and 3 or 4 wounded. Killed all got it in the head. Pulled a Capt Hatton in from the front but he was killed while I brought him in; things cooled down in this quarter about 7pm.\n\n\n\nAll that night we had a hot fusillade of shrapnel and bullets.\n","8":"\n\nWith exception of last Sunday had about the hottest day of the battle. During morning the Turks made anadvance on our right flank. Battle waged hot all morning, neither giving way. For the amount of fire our casulaties were not many. During the whole afternoon they bombarded our centre with schrapnel. About 5pm we got to hot for them and they began to retire. Had a great time. Our machine got a fine position on the left flank and above them and gave them an awful time. The same was done on the right. Our position was\n\nDuring the day Turks did a fair amount of sniping. One got in among us and within oneshot 9 of our chaps. 3 killed and 6 wounded. Our total casualties geting \ngetting\n close to 4000. Just at dusk the Turks began to rally to the assaultagain but we repulsed them. Our machine gun cut a whole Batl. up. TheM G caught them coming up to the firing line probably as supports, marching along a road in col. of fours about 1600 yrds off. Nearly all killed. Their snipers got 30 down in the rest camp, nearly all S B and A M C. Saw Sgt Mackaybadly hit in five places. Still happy though.\n","9":"\nThings very quiet during the morning. Enemy doing some damage from trenches. ¼ of a\n\nmile in front of our position on the ridge. About 7pm. we began to attack them with the object of capturing these trenches and linking our line of advance up with the New Zealanders onour left. As our chaps advanced they were swept with machine gun fire. Captured the trench but lost it again. Had to retire to our position for we were not strong enough. An hour later we were reinforced by 3 Batl. of New Zealander Otagos, Nelsons and Wellingtons. These all rushed the trenches and after 3 or 4 hrs fighting we took them and began to dig in.\n\nFighting continued all night long. Great slaughter done. We alone attended nearly 200 case and still more lying up there\n\nTurks using explosive bullets and giving us awful wounds doing great damage.\n\nAmong our killed was the Adjutant (Capt Willis), Lieut. Freemanand Lieut Dickinson besides 3 or 4 more wounded. Killed and wounded between 250 and 300.\n\nDug ourselves in during the night.\n","10":"\nFighting hard this morning - going all night long. Knocked up this morning. Never want to see such a night again. Poor old Doctor done up. Not so many being hit now that we are dug in. Trying to capture a trench on our right this morning. 15th Batl. fagged out waiting for some one to support us or relieve us. Only have 6 officers left who are not killed or wounded.\n","11":"\n15th relieved this morning. We had a fine rest today. During the afternoon we went to the beach for a swim. Had a good one. On the way back two shraphnel shells burst in the middle of us. Only hit two of our party but hit 14 others standing around.\n\nOur guns bombarded the Turks position and gave them rough time. Made them squeak and retire about 400 yds.\n\nThink we are going to charge them again tonight. Turks using hand grenades.\n","12":"\nTommies tried to take trenches on our right,lost Officers and were demoralized\n\nCalled for Australians to help them. Our chaps took the trenches for them. Tommies a damn pest. They stand wait for Officers order.\n\nAustralians loses Officers he just digs in and fight on. Turks don't like us. Call us Kangaroo shooting b----------, from their trenches and when we rush them with the bayonet they yell for mercy and run for their lives. Our engineers at work sapping trying to undermine one of their positions and blow it up.\n\nKept pelting us with Iron rations (schraphnel) again this morning.\n","13":"\nThings very quiet today. Our Batl. Casualties only 250.","14":" Batl. 700 and 16th nearly 800.\n\nWent up to trenches this afternoon for a few shots.\n\nSnipers made it too hot to put our heads up. Built a little look out of sand bags and while one used the Perescope the others shot at the Turk. Our guns gave them a good dose of schrapnel today. Received an issue of Tobacco & Rum today. Doc. A.M.C. and SB were mentioned in Despatches today.\n\n7th May\nAll day long Turks poured Schrapnel into our position. No one hit though as they threw it a little bit to far. During afternoon went up to Capt Quinns trenches\n\nOne of the hottest corners of the firing line. One little plot set apart for graveyard just below firing line. In one grave are 29 another 18 & 14 & so on. During the night Turks make a couple of rushes on our trenches which are only 20 or 25 yds apart. 8 Turks charged one small trench and 7 of them were killed. One Turk got right to edge of our trench & was riddled. Buried him in our graveyard. SB hit in stomach.\n","15":"\nThings very quiet all day long. Very few shots fired. Do not seem to be many Turks in front to what there were. Went on exploration up the gully. Had to go very cautiously. Found a number of dead Turks who were very high. Got a dozen of their Rifles, bayonets & bullets & equipment\n\nThe Country would be good for fruit growing instead of fighting. Our position is now heavily entrenched. Only one or two causalities during the day. Just at dusk the Battleships were giving the narrows a heavy bombardment. Guns going all night. Heavy firing in our trenches all night. Turks must be missing ground in front of us. Can hear their picks going underground all day long. Turks snipers are not so bad now. They cannot lift their heads without getting a bullet & we are almost the same in the trenches.\n","16":"\nThings very quiet during the morning. In afternoon Turks 14 inch guns from Tahiti port shelled our trenches. One dropped in the trench and buried two\n\nmen, Lieut Anderson blown to pieces and 3 other chaps awfully knocked about, two of them died 5 others wounded. In evening our Batl. attacked the Turk position,great fight. Turks caught napping. Our chaps captured their trenches, shot & bayonetted all Turks there. Turks sent up heavy reinforcements and we lost some of their trenches. They threw bombs in to usall night long. Their taking reinforcements from right weakened them there & the 3rd Bat. attacked them, captured their trenches & killed many. Fought all night long & were relieved Monday morning about 10am.\n\nOur losses","17":" Batl. were about 280 killed & wounded & about 100 others from 16th Batl. & Marines who supported us. 3 Officers killed & 7 wounded from our Batl. Lieut Armstrong did great\n\nwork at Turks Hd Qrs but was killed, the slaughter was awful.\n\n10th May\nDone up from last nights fight, no sleep. Had a good sleep this morning. Fighting carried on all day. Turks tried to beat us out but couldn't.\n","18":"\nHeavy firing all day long. Rec. mail today. Grand to hear from home on the Battle field. Half the mail has to go back because of the chaps killed & wounded. Only about 500 left in our Batl. Col read a letter from the general to us all today, said we fought with great courage and was proud of us. Congratulated us.\n","19":"\nHeavy firing continued all day but only about six casualties from the trenches. Snipers very busy getting about 12 in the rest Camp. Queen Elizabeth reported to have shelled a Batl. of Turkish Cavalry, hope its true. Started to rain last nightmade things very miserable & cold. Received another issue of Tobacco & Rum. Also breadwhich was quiet a treat after 17 days of biscuits and bully beef. Fighting and bomb throwing continued all night, but no casualties on our side.\n","20":"\nThings very quiet this morning, had quite a nice rest. 1200 L Horse arrived on the field and there's another 4000 on the beach. Snipers very busy this afternoon wounding 7 of our chaps and killing one. Terrific Rifle fire & Bomb throwing\n\nduring the night, our Causulaties being only nine while they had heavy losses. The Battle ships were bombarding very heavy during the afternoon, and our artillery gave them a good supply of Iron Rations (Schrapnel).\n","21":"\nPosition unchanged firing still very heavy our Casulaties for the day being 1 killed 6 wounded. 13th, 15th & 16th Batl. relieved by L H Brg for 6 days rest which is very nice. Turks gave us twenty four hours to surrender. I think they are just about on their last. One of our Aeroplanes missing since Tuesday. Caught 2 Snipers.\n","22":"May\nBattle waged heavily all through the day. Turks artillery very active but doing very little damage, our schrapnel very effective. Causulaties during being 2 killed, 7 wounded\n\nGeneral Godley slightly wounded in the head. L. H. charged bomb trench 10 oclock last night but were repulsed after inflicting severe loses onthe enemy. In the attack Major Graham and the others killed & 43 wounded.Heavy fighting still going on. Snipers not so busy.\n","23":"\nFighting still continues but position still unchanged neither side giving way. Our position is becoming more impregnable every day, no chance of ever being driven back. Our casualities for the day being about 6 killed and 30 wounded, including General Bridges who was wounded in the leg by bullet. Heavy fighting on the right flank 10.30pm. Not much damage done. Received news tonight of Italy declaring war on Austria. Hope its right. Our Artillery did great damage to the enemy yesterday. Two New Zealand gunners court marshalled & shot for tampering with time fuse.\n","24":"\nThings very quiet all through the day. Our Artillery put one of their guns out of action (which was buried in a cave) our casulaties for the day was very light nearly all being wounded by snipers. Nearly passed in my number \nby being\n missed being hit by case of a shell by about 2 feet. Close shave.\n","25":"\nThings very quiet during the morning, position still unchanged. Schrapnel from our artillery during great during the afternoon. Rifle fire & bomb throwing continued all night but very little damage was done.\n","26":"\n\nEnemy started using 8\" shells each weighing about 400 lbs. 34 7\" in height throwing 34 through the day, did very little damage. Casulaties caused were 4 killed and about ten wounded. Rifle fire through out the day was very quiet. Turks started to attack all along the line at 10 oclock, and continued all night. We simply mowed them down. New Zealanders on the left Flank accounted for about 2000 during the night. Our Boys and Machine guns did splendid work, the casulaties estimated about 4000, while we have about 600 killed & wounded. Heaviest nights fighting we have had since coming here. Turks seem desperate, \nbut\n must be in a bad way.\n","27":"\nHeavy still continued through out the day. Turks fighting desperately, making continual attacks all along the line, but were repulsed on every occassion suffering severe losses. Our casulaties numbered about 300, very slight for such heavy fighting. ThereArtillery very active during the morning but did very little damage. Schrapnel from our guns did great work during the afternoon. Bombs were thrown from both sides in large numbers all day. German Aeroplane pays a visit every day over our lines, expect to see an attack any time from aeroplane. Received letters from which was a great treat.\n","28":"\nThings very quiet during the morning, hardly a shot fired. Would hardly know a war was on. New Zealanders\n\nsurrounded 600 Turks intending to take them prisoners. White flag was hoisted about 6pm. firing instantly ceased. Wanted amertist to bury their dead, not a shell or shot fired for about half an hour. New Zealanders see them in the distance gathering our Rifles mobilizing so they immediately opened fire and Battle was in full swing once again. Our guns was firing Lediteshells during the best part of the night, great damage being done to the enemy. 400 Turks on the Right flank surrendered. New Zealanders annialated every one of the 600. Issue of Rum & Cigarettes.\n","29":"\nRifle fire very quiet, but schrapnel in large quantity was fired by the Turks but the only damage they done was knocked two biscuit cases about. Our Artillery opened\n\nfire with a good range, doing great harm and making the Turks retreat to a safer distance. Everything quiet this afternoon, hardly think a war was on. Our casulaties during the day was very light, most be wounded by snipers. Bombs very thrown frequently during the night by both sides. Started raining during the night making itr very miserable. German General came in under flag of truce to interview our Chiefs concerning peace terms. Have not heard results. News received General Bridges dead from wounds received. Greek Brg. wounded came into our lines. Says the Turks & themselves are kicked into the war. The Batl. he\n\nbelonged to was wiped out of the 19th by fire from our guns. Using Japanesse patent bombs a great success fired from a patent gun did great damage amongst the Turks. Filled with poisonous gases. Kill at 400 yds.\n\n23rd May\nStill wet & miserable. Everything very quiet. Artillery doing the most work. Casulaties for the day very light. Bombs (Japanese) very successful, put the fear of God into their hearts. Result of Conference was peace would be granted to Turkey but not to the German Officers in charge. Wish it would stop raining. Mud galore. Worse than Rosewood.\n\n24th May\n\nEmpire Day.\n An Armstice with the Turks from 7.30am till 4.30pm. Object to bury the dead. Rifles were stacked in heaps as they were gathered. It was fixed that 400 Turks and the same number Australians with 200 from each side carrying white flags were to be the burying party midway between the two firing lines. Turks could not go on our side and we could not go on theirs. Got out with the party as they moved about. On the right was some 900 dead Turks and about 20 Australians. In the centre where the trenches were closer the number was not so bad, but on the left where our Machine guns have been firing they are lying in hundreds.\n\nI had a good look at our immediate position and it ran something like the following:\n\nWhere the trenches are only 9 yds apart we were continually being bombed. I had a good look at this and they had sapped out towards us and from this small trench they threw the bombs. In it was some dozen dead Turks and the trench was used to bury them and was filled in. This critical point is not manned by Turks but Germans. I could see a number of men in it. The Turks were all looking\n\nout of their trenches as also were our chaps. They were grinning at us in some cases, but I did not go much on their looks. They were all big mean, clean & healthy and well dressed. Apart of one Reg. had very gaudy blue uniforms on. The German Offices are very well dressed and look real dandies. Seemed strange to have 8 or 9 hour quietness without hearing a sound. Our Officers had a great screw at their positions. Some of the Naval officers were up there looking round. We discovered the position of their formidable Machine Guns on the right and are keeping sharp eye open for one there on the left. At 4.30pm hostilities once more commenced, but it was not until after dark that they got hot. The Turks made a charge but were repulsed. There was some 12 or more machine guns going.\n\nWe only had two wounded while the Turks lost a fair numbers.\n","30":"\nThings fairly quiet during the morning. About 7pm the Battleship \"Triumph\" which with a number of other boats was lying about a mile off the shore at our position was torpedoed. Immediately destroyers, barges, tugs and boats of all descriptions raced to her assistance. We hada good look at her from the shore. They appeared to get most of the Crew off, who, untill she sank kept up a heavy fire with her guns, presumable at the Submarine which Torpedoed her. About 10 mts after she was hit she turned clean over and sank. Terrible to watch a big boat like her go down. The destroyers with full steam ahead were like living things as they flew\n\nthrough the water\ns\n in all directions looking for the enemy who dared beard us in our own den. During the afternoon it rained and of course made things very uncomfortable. During the afternoon we finished our mining under the Turks trenches and the explosives we placed and everything ready for blowing them up. About 5pm the","31":" was called up in case of an attack. At 6pm we blew up the mines and they were satisfactory. The trench from which they threw bombs was completed wrecked but they made no attack.\n","32":"\nDuring the morning about 25 of the chaps in Monasch Valley were sniped, 8 of them belonged to the 15th Batl.\n\nDuring the day we got into them and they quickly shifted. Things at the firing line were very quiet today. All the miners in our Batl. were busy sapping in under the Turks position. Just before dusk one of our Biplanes flew over the Turks position and dropped two highly explosive bombs into part of them. At dusk another 2000 odd Reinforcements landed for us and the Turks through a lot of Schrapnel at them killing 6 and wounding 36 before they landed. Things were very quiet during the night except for a few bombs which were thrown.\n","33":"\nThe day started by our Aeroplanes flying over and dropping another highly explosive bomb reckonedto be on\n\nThe Turkish headquarters. Amount of damage done not known, things fairly quiet, with Artillery & Rifle fire our Engineers who are sapping could also the Turks sapping under our trenches. So we gave them another charge blowing in their sap and burying one or two.. Our sapping then continued. Received word of the loss of the Majestic. Struck by one of the cooastal torpedoed subs, a great loss. All hands saved. During the afternoon we threw a good number of bombs which from the yells were evidently satisfactory. Blew in another position of their trench at 2.30am. Everybody standing to arms. Casulaties for the 24 hours were very slight.\n","34":"\nThings fairly quiet this morning in the firing line. Aeroplane pays another visit to the Turks and drops a bomb on them. Sappers still very busy on both sides. Schrapnel from the enemy in large quanties but did no damage. During the morning another lot of Reinforcements arrived which will be a great help as they are needed. Nothing startling during the afternoon barring our Artillery playing a good game. 3.30am succeeded in blowing up part of our firing line doing a fair amount of damage. 13th Batl. in the trenches at the time. A lot of the boys were blown to pieces. The Turks held our trench for about 1 hour when the","35":" Batl. was called to retake and they was most gallant\n\nin their charge. Jumped the side of support trench and then fired. After an hours hard fighting with bayonet, Rifle & bombs the Turks retired leaving about 100 dead in our trench and then the Machine guns mowed them down as they retired. Their losses must have been enormous. Our Casulaties were about 150 killed & wounded including 5 Lieuts & 1 Major (Major Quinn being shot dead, a brave man gone).\n","36":"\nHeavy fighting continued during the morning, the Turks making continual counter attacks but they were repulsed on each occassion bayonets from our Boys being used frequently and cutting the Turks up badly. During the morning 18 prisoners were captured who seemed quite pleased to come in. About 12.30pm\n\nthings became quiet, nothing being done during the afternoon. Aeroplanes very busy dropping some kind of signal evidently range finder for Naval and Howitsers quiet during the night. Turks very busy digging towardsour trench but no casualties or rifle fire.\n","37":"\nFirst thing this morning we noticed Turks were within two yards of our trench sapping so all reserves were brought up and at midday our artillery opened up with heavy fire and the L H & New Zealanders charged them it was a grand sight. I had a good view, they succeeded in driving the Turks out and filling in the trench. We lost a few men and we also captured a machine gun. Everything was again quiet\n\nat 4.30pm and was quiet from there right through the night except for few bombs which were thrown.\n","38":"\nEverything fairly quiet during the morning occasional bomb being thrown our sappers hard at work all along the lines, sapping out towards the Turks trenches during the first part of the afternoon schrapnel was thrown frequently from both sides. 15th batl being relieved for a rest (morning off this afternoon) which was well earnt, arrived at new camp about 6pm which is about 3 miles from where we were, our camp is now in a nice valley about 5 minutes walk from the beach and about 1 mile from the New Zealands firing line so\n\nwe are in a nice quiet spot quite a change from being just behind the firing line.\n","39":"\nHaving a rest no work plenty good food andplenty of sleep, had a swim this morning and I feel A1. The first quiet wash and swimI have had since landing.\n","40":"\nStarted the day by having a nice swim which is just glorious, reminds me of a sea side trip. We are still resting, General Godley gave a very nice speech to the 4th Brig during the afternoon with reference to the good work which we have done. Doctor and I went touring after we had tea and nearly got shot by snipers.\n","41":"\n\nKings Birthday\nStill in the rest camp having an easy time sleep and eat most of the day, went for a swim during the afternoon which was very cold, but quite refreshing, everything very quiet in the firing line, very few casualties coming in, Gun Boat did some very good firing in the afternoon, Turkish troops seen mobilising in a village three miles away, so Gun Boat put some iron ration amongst them. Big rally of rifle fire in New Zealand firing line during the night, snipers very busy along the beach.\n","42":"\nHeavy fighting started very early this morning on extreme right flank, most of it being hand to hand fighting, the Turks\n\nmake numerous attempts but were repulsed with heavy losses each time, the Tommies capturing 400 prisoners, after fighting had waged some time the French artillery got them on the run and played terrible havoc amongst them. Gun Boats also did some firing. During the afternoon things were quiet and at 11.30pm our artillery opened up with heavy bombardment all along our firing line, which was a leader for a general advance. 12pm we charged capturing 2 lines of tenches, we suffered pretty heavily on one part but we are still holding on and it will take a lot to put us out. Fighting continued right throughout the night.\n","43":"\nWar waged heavily right through this morning, our boys took two lines of tenches but it was two hot with bombs to\n\nhold on so they filled in the trenches and then retreated. our casualties are something like 150 killed and wounded and missing including 1 Officer killed, 5 wounded. we captured two of their machine guns also 40 prisoners. Shrapnel Bombs and Rifle fire was very heavy right up till about 12.20pm when it slackened off a bit. during the afternoon another 7 Turks surrendered and they said they have only had six days training when they were put into the firing line also that they are using up all their reserves. the 4th Brg is still in the rest Camp so when there's nothing doing I open a Barbers Shop cutting the boys hair for them. I indulged in another swim this afternoon. issue of a new uniform today, a khaki which is & cool.\n","44":"\n\nThings fairly quiet all along the line this morning Church Parade 9 am. this morning service very nice, seemed so strange have Church on a battlefield while rifle fire was going on, Tommies and French surrounded. 5000 Turks on our extreme right \nand the Navy gave them till 4pm to surrender but 2000 was killed before they surrendered. \nOne of West Aust Engineer caught signalling to enemy. \nWas Court Marshalled and shot yesterday\n. Bombs was in great evidence during the night each one followed by a big volley of rifle fire from our chaps.\n","45":"\nThings fairly quiet during early morning but about 9.30am Turks started a bombardment with 8\" shells\n\nThey were evidently after the Hospital Ship but the shells fell short, no damage being done. At midday our Artillery started shelling the Turkish trenches and as they retreated our Machine Guns played on them. 4pm went for a swim which was lovely. On arriving back was handed letters from home & Mackay which was better than receiving . 1.30pm Turks attacked Quinns Post but were repulsed and then our Boys charged with Bayonet, doing a lot of damage. Our casulaties amounting to about 30 killed & wounded. 2 Spies captured signalling to Turks.\n","46":"\nStill holding the position. Nothing startling in the firing line. Our Art. put two of the enemys guns out of action\n\nduring the morning. Our Artillery was very active about 4pm. A prelude to an attack which came off at 8pm. We suffered pretty severely but we did great work capturing two lines of trenches at Quinns Post. Towards morning things quietened down, nothing but an occasional burst of a bomb.\n","47":"\nEverything very quiet all along the line, a miserable windy day. During the morning the boatsnoticed a traction engine bringing up a big gun, so theythey went over to a position a blew it up. Went for a swim. Water very cold. Just about tired of war. Will be glad when finished. Expect to blow two lines of Turks trenches up tomorrow night.\n\n"}}