{"Document Name":{"0":"Diary_0416","1":"Diary_0416","2":"Diary_0416","3":"Diary_0416","4":"Diary_0416","5":"Diary_0416","6":"Diary_0416","7":"Diary_0416","8":"Diary_0416","9":"Diary_0416","10":"Diary_0416","11":"Diary_0416","12":"Diary_0416","13":"Diary_0416","14":"Diary_0416","15":"Diary_0416","16":"Diary_0416","17":"Diary_0416","18":"Diary_0416","19":"Diary_0416","20":"Diary_0416","21":"Diary_0416","22":"Diary_0416","23":"Diary_0416","24":"Diary_0416","25":"Diary_0416","26":"Diary_0416","27":"Diary_0416","28":"Diary_0416","29":"Diary_0416","30":"Diary_0416","31":"Diary_0416","32":"Diary_0416","33":"Diary_0416","34":"Diary_0416","35":"Diary_0416","36":"Diary_0416","37":"Diary_0416","38":"Diary_0416","39":"Diary_0416","40":"Diary_0416","41":"Diary_0416","42":"Diary_0416","43":"Diary_0416","44":"Diary_0416","45":"Diary_0416","46":"Diary_0416","47":"Diary_0416","48":"Diary_0416","49":"Diary_0416","50":"Diary_0416","51":"Diary_0416","52":"Diary_0416","53":"Diary_0416","54":"Diary_0416","55":"Diary_0416","56":"Diary_0416","57":"Diary_0416","58":"Diary_0416","59":"Diary_0416","60":"Diary_0416","61":"Diary_0416"},"Date":{"0":"unknown","1":272.0,"2":273.0,"3":274.0,"4":275.0,"5":276.0,"6":277.0,"7":279.0,"8":280.0,"9":296.0,"10":297.0,"11":298.0,"12":299.0,"13":300.0,"14":301.0,"15":302.0,"16":303.0,"17":304.0,"18":305.0,"19":306.0,"20":307.0,"21":308.0,"22":309.0,"23":310.0,"24":311.0,"25":312.0,"26":313.0,"27":314.0,"28":315.0,"29":316.0,"30":317.0,"31":318.0,"32":319.0,"33":320.0,"34":321.0,"35":322.0,"36":323.0,"37":324.0,"38":325.0,"39":326.0,"40":327.0,"41":328.0,"42":329.0,"43":330.0,"44":331.0,"45":332.0,"46":333.0,"47":334.0,"48":335.0,"49":336.0,"50":337.0,"51":338.0,"52":339.0,"53":341.0,"54":342.0,"55":343.0,"56":344.0,"57":345.0,"58":346.0,"59":347.0,"60":348.0,"61":349.0},"Entry":{"0":"\n\nAugust \n","1":"\n\n\"B\" Coy. 2nd Battn. 1st Infy. Brigade left Kensington Race Course at 8.30 A.M. & marched to 7 Wolloomoo Wharf and embarked on board Troopship \"Suffolk\" (A.23) @ 11 A.M. belongs to Federal line commanded by Captain P. Davis visited during day by Brigadier (Col. McLaurin) & by Dist. Comdr. (Col. Wallack). Capt. Maj. Gordon. Lieuts Stewart and Burton in cabin Nos. 18-19.\n\nAugust\n","2":"\n\nRev. @ 6 A.M. Extra precautions taken to guard wharf & ship. Colonel Lee & Commander\n\nRobins (Naval) on board for breakfast. Troops not embarked as expected, news through that troops were not to sail (10 A.M.). Rest of Battn. marched out on to Domain & cheered \"B\" Coy (11 A.M.).\n\nAfternoon, Cruiser Melbourne leaves suddenly. Afternoon spent on board, 6 P.M. A company from 1st Battn under B.J. Swanell (Cpt.) goes on board \"Afric\", Evening spent on board returned 11.15 P.M. was shown down engine room @ 11 A.M.\n\nAugust\n Sept. 27 1914 Sunday\n\nRev. @ 6.30 A.M. Salt water bath on deck, down below on troop deck, breakfast, inspection\n\nof quarters by Major, found unclean, 9.15 A.M. fell in whole company out on wharf for Church parties. Mr Barton took C of E to St Andrews Cath. Colour-Sgt. Elliot took Presbys. to St. Stephens, self took R.Cs to St. Mary's Cath service began 11 A.M. ended 12.30 P,M, got back to ship @ 1 p.m. General leave for friends of men to come on to wharf from 1 to 5 p.m. during afternoon fair crowd down to see men, I spent afternoon on board + was shown over bridge, wheel + chart house by 4th Officer. had tea &spent evening on board retired 10.45 p.m. Just before dinner looked through Telephone Book and found \"Brays\" number, rang up &gave a message for Greta to come & see me\n","3":"\n","4":"\n\nRose 6 AM. on deck 6.30 splendid morning, \"Euripide\" moving out from wharf& going round domain. 7 A.M. \"Argyllshire\" also moves off. breakfast, 9. A.M. \"clan Macquorkandale moves in and unships horses. 9.30 parade, My day for duty as officer of Guard, 11.30 took guard of 18 men, 2 n.c.os to guard main gate & German ship \"Berlin\" 12.30 \"Afric\" Moves off to Neutral Bay, we are notified that we will also move off in morning. Spent afternoon on guard duty, inspected guard at\n\n2.30 and also at 3.45 p.m. 45,000 cigarettes (for free issue to troops) taken on board at 2 p.m. Visited by Greta Brettell at 4 pm. to 6 p.m. At 6.15 visited by Brigadier who inspected ship & guard. During eveing copied out instructions for Sentries & Guards & afterwards wrote letter to home, again inspected Guard @ 9.30, Retired at 10.35 A.M.\n","5":"\n\n\"Suffolk\" moved from No 7 wharf, Woolloomoo Bay at 6.15 moored to P&O Buoy at Athol Bight\n\n@ 6.45. Officer of Guard for day. 7 sentries posted one in bow, one in stern, on on forward hatch, one on gangway one on port forwd one starbd fd. 10 to 10.30 A.M. Physical drill on board, spent afternoonon board, 2.30 p.m. paid men in smoking room up to","6":"Self £7\/10\/- pay £1-15\/- field allowance. 5 to 5.30 3 ships also anchored clsoe by. 5.30 p.m. tea, 7 to 8 studying in cabin, 8 to 9.15 examining &distributing sentries written orders, 9.30 inspected guard, retired at.\n\nSept.30 Wednesday\n\nMuch the same as Tuesday again Officer of Guard\n\nowing to Mr. Barton having to personally see to discrepencies in Pay. Splendid day. Rifle and Musketry exercises on Deck from about 2.30 to 4 also individual instruction in loading with charges.\n\nMr\ns.\n Burton back to tea, brings news that company will be \nem\n disembarked tomorrow. Major Gordon details me to stay on board with Guard of 1 Sgt. (Harvey), 3 Cpls. Gibb. Hillman, Bowling, 1 Bugler Watson and 24 men. Making arrangements in Smoking Room from 7 to 8.30 p.m. retired at 11 p.m.\n","7":"\n\nRose @ 10 to 6, splendid day. Remainder of company left on \"Mina\" @ 11.50 a.m.\n\nPatrol Boat called twice in afternoon also visited @ 11.45 A.M. by Major Sands and Naval Officer. Day very uneventful and same as usual, retired @\n","8":"\n","9":"\n\nReveille at Kenso Camp @ 5 A.M. Addressed by Brigadier & moved off at 8 A.M. Outside we boarded trams & were carried to Darlinghurst Junction where it commenced to rain. Marched down Bourke St to Woolloomoo Wharf.\n\nEmbarked at Woolloomoo Bay @ 9.30 A.M. Anchored temporarily at Neutral Bay @ 10 A.M. Moved off @ 4.25 P.M. cleared Sydney Heads @ 5.10 P.M. weather very dull, stormy and rainy, nearly half of the officers sea sick. Had a very dirty night.\n\nEmbarkation of whole bttn only took 23 minutes.\n\n\n","10":"\n\nSea calmed off about mid-day and afternoon was very fine. Men sick everywhere, shortage of food all day. 180 miles to 12 noon. Sighted 4 funnel man-o-war - either Sydney or Melb - off Gabo island at 3 P.M. Lot of Military Books issued. Men had concert at night with the band after tea. Started to grow moustache this morning.\n","11":"\n\nExceptionally fine weather all day. Passed Wilson's Prom about 8 A.M. & saw sea lions, had Phy Drill for men; lost sight of Australia at noon.\n\n\n\nPicked up Cape Otway about 4 P.M. Had O'Grady Squad Drill for Officer's during morning. Herrod champion. Run for day 296 miles. No sign of seasickness anywhere.\n\nShort Arm inspection at 5 P.M. 23 men up for repairs including 5 of \"B\" Coy.\n\nConcert & boxing at night.\n\nMaj Scobie alright. Officers making inferal row trying to sign after tea. Detailed as Officer of Guard & up all night.\n","12":"\n\nUp All night everything O.K. Weather still exceptionally calm. Saw several whales during dinner hour.\n\nhad good breakfast and went to bed. Got up at dinner and went back to bed again till four.Went to bed at 9.30. Run for today 293 miles.\n","13":"\n\n\"B\" Company on duty for cleaning and swabbing Troop Deck. Weather still splendid and calm. Now crossing middle of Bight. Run for today 292 miles. Day very uneventful. Spent whole day in reading magazines, studying and yarning in the Smoking Room. Went to bed very early.\n","14":"\n\nAgain detailed as Officer of Guard; whole of \"B\" Coy. on Guard and Picket duties. Commenced duty at 8 a.m. with Guard of 21 men 1 Cpl. 1 Sgt. and life bouy picket of 1 Cpl. and 6 men. Morning uneventful, no land in sight, still crossing \"Bight\". Spent day as on 22nd. Came on rainy and stormy about 5 p.m. Played two games of deck billiards during afternoon. Gambling order to be stopped. Started series of lectures after tea. Run for day 281 knots. Up all night and during early hours of morning on duty\n","15":"\n\nThe other transports are closing in, 4 just in right now. The \"Afric\" is just ahead of us. About 4 p.m. she was seen to stop and turn around twice. Lifeboat drill and parade for whole Battn. during morning, I wasn't present as I was sleeping after my nights duty. Run for day 296 knots.\n\nSunday 25\/10\/14.\n\nArrived in King George's Sound at 5.30 a.m. this morning after doing 172 knotsto complete the 1st section of our journey. Anchored just inside heads. There were 15 transports already here. About 10 a.m. we up-anchored and moved up to the wharf in the\n","16":"\n\nPrincess Royal Harbour. Church service was held by the Colonel while we were moving up. We went up in order to take in 300 tons of water; 7 galls per man was used instead of proper allowance of 11\/4 galls. Whilst we were at the wharf, at about 12 noon the \"Indara\" came up on the other side of jetty. There was great cheering between men & passengers. Men very anxious to get newspapers, throwing coins to youngsters on the wharf. People from \"Indara\" throwing magazines on board. The \"Indara\" moved off at about 1 p.m.. After dinner gave younsterwires to \"Home\" & Greta Brettell. A newly married couple were\n\n25\/10\/14\n\ngiven about 40 telegrams to send, they and some friends came on board during the afternoon & were entertained by the Colonel & Majors. Lecture after tea by Lieut R.L. Brown on Physical Culture. Lieut Griffin was imitating commands of various officers afterwards, in the Smoke Room.\n","17":"\n\nRough & wet all day. Kelly fishing, went to sleep, Nash tugged the line and Kell woke up and thought he got a bite. The cruiser \"Melbourne\"is patrolling outside the Heads. Had good old sing song up in the Smoke Room. Squashed a few who were sining \"Sweet & Low\" down in the Saloon, by roaring\n\n26\/10\/14\n\n\"Cock Robin\", myself taking the verses. Capt Concannon gave a lecture on \"Local Patriotism\" after tea.\n\nTuesday 27\/10\/14\n\nVery wet & roughup till noon. Fine afternoon. Had \"Full Marching Order\" Parade, quite a number of shortages. Tug came with mail and took some off. Received new \"Infantry Training 1914\". Lecture on \"Scouting\" by Capt Campbell.\n\nWednesday 28\/10\/14\n\nKelly went ashore this morning to execute general commissions and purchase goods for a dry canteen for the men £100 having been collected the evening before. Contributed £3\/-\/- myself. Just between 11 & 12 A.M.\n\n28\/10\/14\n\n14 vessels showed up in line on the horizon & entered heads about 12.30 P.M. They proved to be the N.Z. convoy of 10 troopships & 4 man-o-wars. The warships were the 1st class cruiser \"Minataur\" (1908 built) from the China Station, a Japanese 1st class cruiser and two British","18":" class cruisers most likely the \"Pegasus\" and \"Encounter\". All the N.Z. Transports are painted all over the same grey colour as the warships. The painting is said to have cost £9,000. They anchored in a bunch just inside the heads. Lt. Col. Braund & Capt. Wollack (Adj) went to attend a conference on board the \"Flagship\"\n","19":"\n\n\"Orvieto\". Notification given that all correspondence will henceforward be censored. Men had boxing match at night. Lecture at night.\n","20":"\n\nHad a little rain during day. During afternoon had a hammock swinging parade, in order to see how we stood for space, found there there was not quite enough room. Lecture by Cap Wallack on night attacks. After lecture Colonel asked that person who had hidden the gramaphone needles should return them, this was done and the Phone got going again, much to the delight of some and the disgust of sundry others. We were expecting the G.O.C. Maj. General Bridges on\n\n\n\n29\/10\/14\n\nboard for an inspection to day, but he didn't come.\n","21":"\n\nKelly again went ashore gave him a wire to Home and one to Greta B. to send. Also gave him 2 letters to same. Kelly was unable to get back that evening so kept on purchasing goods for dry canteen & came aboard on a Motor Launch the next morning at 8.30. He stayed the night at the Royal George Hotel. Said that a lot of soldiers were up the town getting drunk, they were not supposed to be ashore, but had borrowed civilian clothes from the ship's crews & so sneaked ashore. Today the Beer Issue commenced at\n\n30\/10\/14\n\n11 A.M. Men thought it was a free issue & were surprised to learn that they had to pay 3d per pint for it.\n","22":"\n\nOld Dr. Kane went ashore in the same Launch that brought Kelly aboard. Kelly also bought a lot of his purchases with him. I was detailed as Officer of Guard and about 9.45 A.M. The Brigadier (Col. McLaurin) The Brigade Major (Capt. F.D. Irvine R.E.) and Orderly Officer (Lieut D.M. King) paid a surprise visit to us, were in a small lifeboat from the \"Euripedes\" & got right alongside without being seen, my sentry on the rope ladder saw them and turned out the Guard. Colonel Braund quite surprised, Guard presented\n\n31\/10\/14\n\narms and massed bugles played general salute. Hestayed on board then till noon making a inspection et. It was very funny standing out with the Guard under arms. On leaving he was saluted as before. At about 11.15 a Norwegian whaler (steam) came alongside with stores.\n\nAfter the lecture ended (10 P.M.) most of us got up in the smoke room and as it was the last night in Australia, we had a real good\"Beano\" Sang \"Cock Robin\"& \"Australia's Sons\" and toasted \"Australia\"& \"The British Empire\". The fun lasted till about 3 A.M. some of themgot very drunk. Being Officer ofGuard this was splendid for me as I \nhad \nto stay up.\n","23":"\n\nBeing on duty was up during early hours of morning. About 4.15 A.M. that same steamNor. Whaler came alongside again, with the Chief Steward & a lot of ship's stores which I put on 10 of the Guard to unload. She left about 5.15 A.M. Splendid morning, signs of activity on all the ships. The remainder of them have been arriving in twos and threes during the week. At about 5.30 A.M. the \"Minataur\" steamed out followed by the \"Orvieto\" and all the others in line, our ship going 8th. It was a splendid sight. After they had all cleared the heads we formed up in 3 lines, with the New Zealanders in 2 lines behind. The whole convoy\n\n1\/11\/14\n\njust fills up the field of vision. After breakfast I went to bed till noon. Missed the church parade by the Colonel. Was very rough during night.\n","24":"\n\nStill very rough, we rounded Cape Lewin at 3.45 A.M. this morning. One of the Mess Ords. spilt porridge all over one of the stairs. Old Face-the-noo was going down and slipped & fell into it, he was porridge all over. When the men had recovered sufficiently they scraped it off him. Instructions issued that everyone must sleep with lifebelts handy.\n","25":"\n\nStill very rough, roughest we've had yet. Fiddles on the tables.\n\n3\/11\/14\n\nA few officers including the Colonel got seasick. The Col. very much so. Very amusing at Dinner time. Capt. Wallack's soup in spite of the fiddle tipped into his lap. Too rough to have parade. The 2 W.A. troopships joined convoy this afternoon. Some of the officers had a huge \"Beano\" at night, was woke by G.T.W. coming into the cabin about 1.30 A.M. went up and had a look at them, they were as funny as a pantomime, turning handsprings dancing etc. G.T.W.climbed up the funnel guy to the platform & hung there with the ship rolling and plunging. Owing to an electric wire fusing, there was an alarm of fire during the night, one chap\n\n3\/4\/14\n\nwho started yelling fire, was promptly silenced.\n","26":"\n\nWeather beginning to get very hot as we are now nearing the tropics.A canvas bath has been rigged up on the ship and companies take it in turns to bathe.\n","27":"\n\nStill getting hotter. \"B\" Coy's turn for bathing. Major Gordon and self went in with them. While I was in the \"Minataur\" came downone line and up the other, on a tour of inspection. The \"Osterly\" overtook us about 5.15 P.M. She was crowed with passengers..\n","28":"\n\nDay very uneventful, had usual parades, semaphore signalling Physical drill& musketry. Lieut Herrod's horse which has be ailing all along died to day.\n","29":"\n\nEveryone has now adopted light clothing. Capt Stevens and Lieut Barton & self had a court of inquiry re the dead horse in the afternoon. Found that it had died from internal trouble accelerated by influenza.\n\nSunday 5th Novr\n\nChurch Service by Colonel at 10 A.M. Full Marching Order Parade at 2.30 P.M.\n\nDuring morning the \"Melbourne\"\n\n\n","30":"\n\npassed quite close to us on her way from the rear up to the front of the convoy.\n\nMonday","31":"\n\nIn early hours of morning thought I heard shots, we would then be passing close to Cocos Islands on the West, was sleeping up on boat deck.\n\nDuring morning carried on with usual parade. About 11 A.M. the Jap cruiser which was on our right was seen to be steaming furiously ahead around the van of the convoy over towards the \"Melbourne\" on our left. Great excitement ensued. She was seen to be manouvering around it at a great rate\n\n9\/11\/14\n\nAt 3.5 P.M. a wireless was received from the \"Orvieto\" stating that the \"Sydney\" had engaged the \"Emden\" off Cocos Islands the morning before and the \"Emden\" had to be beached to prevent her sinking. The \"Sydney\" had 2 killed & 13 wounded. This message was read out by the Col & great jubilation ensued. The afternoon parade was cancelled. After the \"King\" was drunk at Mess, we toasted the Sydney crew.\n\nTuesday 10th Novr\n\n\"Minataur\" passed down the lines this morning early & signalled Good Bye & Good Luck, so she must be going\n","32":"\n\nback to her old station or perhaps help to smash the German warships now in the Pacific. H.M.A.S. \"Melbourne\" now in charge of convoy. The following is a message received :- On Sunday nightthe Emden passed within 20 miles of the convoy. The wireless was silenced and the van of the convoy was so darkened that she might have passed5 miles ahead of us. Had she passed astern certain vessels, were showing lights 6 miles or more & the Emden would probably have taken toll of the Convoy before escort could have attacked her. Attribute this danger to neglect on part of commanders\n\n10\/11\/14\n\nof certain ships to carry out orders for mutual safety. The following signal messages are repeated for general information from \"Minataur\" to \"Wanganui\" (\nJap\n) N.Z. I have received orders to proceed on another service. Capt Silver of the \"Melbourne\" will assume command of escort & convoy. \"Good bye & Good luck\". Message from Wanganui to Capt Kiddle of \"Minataur\":- \"Hearing of your departure the whole NZ Expeditionary Force thank you very much for the good care you have taken of us. Hoping you will be successful on your next service & both personally & on behalf of this force, wish you the best of luck\".\n\n10\/11\/14\n\nFrom Capt Kiddle of \"Minataur\" to G.O.C. N.Z.F. \"Wanganui\" \"I am ordered on another service. Very sorry to leave you and the convoy. Wish you the best of success when you land in France. Give the Germans a good shaking up. Good bye\". A death on \"Medic\" buried at sea this morning.\n","33":"\n\nMessage received to say that the H.M.A.S. Sydney will rejoin as soon as she takes off German Prisoners & wounded. The message also confirms that Cocos Islands was the scene of the engagement. Another death on \"Medic\" all flags ½ mast. Burial @ 5 P.M.\n","34":"\n\nThursday 12\/11\/14\n\nH.M.A.S. \"Melbourne\" seen alongside Jap cruiser this morning about 9 A.M.. Boat from Melbourne visited Jap. Later a message was received stating that the \"Melbourne\" had left on another service. Much rain today, heat oppressive, more close than hot. Temperature 91° @ 2 P.M.\n\nConcert at night. King Neptune came aboard at 8 P.M. and his proclamation was read from the boat deck. Several names were read out for initiation. King Nep. announced that cleansing would take place at 2 P.M. on the morrow, & then he and his minions set off on a tour of\n\n12\/11\/14\n\ninspection of the ship. The Colonel stated that there would be no parades & that Officers might put on pyjamas for ceremony.\n","35":"\n\nCrossed the \"line\" at 7.30 A.M. this morning. Raining heavily all day. The N.Z. convoy & a few of the Austn. convoy including the \"Anglo-Egyptian\" went on ahead to Colombo early this morning to coal & water.\n\nA small bird landed on the ship and was in such an exhausted state, that it was easily caught. Nearest land (Ceylon) 400 miles away. Crossing the line was celebrated at 2 P.M. All Officers whether they had Xed before or not (except Col & Lieut Heughwere initiated.\n\n13\/11\/14\n\nThe candidate was captured by King Nep's minions & taken before his Doctor, (Maj. Gordon), who medically examined them. They then forced cand. to swallow a dough pill as big as a plum. He was then lathered by 2 men, with paint brushes and soft soap, shaved with a large wooden razor & tipped back into the swimming bath & ducked. Afterwards certificates of the initiation were issued a charge of 1\/- being made.\n","36":"\n\nSome of the ship's cooks went on strike this morning because they'd been ducked when Xing the line as a result the Sargents' Mess had very poor breakfast. About 9.30 had a terrific storm of rain which cleared and cool atmosphere.\n","37":"\n\nSunday 15\/4\/14\n\nCoast line of Ceylon in view at dawn. Later on could distinguish strips of narrowbeach & dense foliage.\n\nCountry very mountainous. A mass of peaked small mountains half hidden in mist. Anchored just outside Colombo breakwater about 2 P.M. All along the coast saw great number of sampans fishing, they are about 10 ft long with a square sail & usually contain ½ doz niggers and go about in fleets.\n\nColombo is right on a well defined regular coastline. There is no harbour but a long breakwater on the S. West.The buildings are all red-tiles & built of some terra cotta coloured substance & bricks.\n\n15\/11\/14\n\nThe roadstead looks something like the outer part of Circular Quay does from Fort Denison.\n\nSome of the Hotels are very large. There is a long promenade along the sea front, along which there is a lot of traffic. Many rickshaws ply up & down & a few motor cars. .\n\nInside breakwater is a mass of shipping including Russian, Japanese, British & Australian warships. The \"Sydney\" passed this morning at 2 A.M. with the C.P.R. mailboat \"Empress of Russia\" with prisoners from Emden on board. Said she was sorry she had to pass through so early.\n\nJust after dinner a large 5 funneled Russian cruiser the\n\n15\/11\/14\n\n\"Askold\" came out and anchored just off our seaward side. She was there all the duration of our stay. The sea close in is a bilious pea green colour, but a couple of miles further out there is a distinct change of colour to deep blue. 6 P.M. there is a warm breeze blowing off the land bring a smell of foliage and earth.\n\nMeeting held after lecture re a message received about mess contracts in England. Price 6\/6 pd. including service. Decided to mess ourselves as price is too high. Also complaints were made about quality of Saloon Food. Capt Kane A.A.M.C. complained of finding cock-roaches in his porridge. Complaints about fish not being scaled. As I was on 3rd shift Officer of Guard asked to be excused at 10.30 & went to bed.\n\n15\/11\/14\n\nStarted sleeping in bed-hammock on boat decktonight. Had a good rest.\n\nMonday 16\/11\/14\n\nHad to get out of bed at 4 A.M. to do 2nd turn of Guard duty. Relieved at 8 A.M. H.M.S. \"Yarmouth\" light town class cruiser & exact replica of the \"Sydney\" & \"Melbourne\" came up from the South & entered roadstead about 9.45 A.M. She passed quite close & with glasses I could see a shot hole in 2nd funnel through which the smoke used to belch now & then: she also had red-leaded patches on her gun casements & looked as if she had been out a long time. Started boxing with Cpl Burns.\n\n16\/11\/14\n\nBoxing this morning with Cpl Burns. Captain and 4th Officer went ashore in lifeboat about 9.30 A.M. this morning. A tug came alongside about 10 A.M. this morning. \"The Lady Mackay\" manned entirely by niggers, with an Aust Lieut in charge. She was visiting all the troopships giving & taking mail. A lot of us derived much amusement by throwing coins down on to her decks and watching the crew scrambling for them. Their zeal was remarkable. While she was alongside us about 11 A.M. a steam launch came alongside her, with a couple of English tea planters & two white women on board. The 2 Englishmen came on board to offer prices for supplies. the Q.M. Lt Whyte, who thinks he knows a bit about the language, tried to strike up a conversation\n","38":"\n\nwith one of the black boys, on the \"Lady Mackay\". After a lot of fruitless blarneying, the nigger held up his fingers & ejaculated \"I dunno!\" which caused a great roar of laughter. Boxing tournament started tonight. All the mail was one letter for Capt. Richardson, brought by the tug about 9 P.M. I was disappointed as I expected to get mail which I had just missed at Albany.\n","39":"\n\nBoxing this morning. Preparing to start once again at 11 A.M. Convoy divided - faster line of ships (\"Euripedes\" \"Shropshire\" \nWiltsh\n \"Argylshire\" \"Afric\" \"Benalla\" \"Omrah\" \" Hororata\" \" Star of Victoria\" and \"Militades\" to follow at 6 P.M. They are at present inside breakwater\n\n17\/11\/14\n\nwatering and coaling. About 10.40 the same steam launch that came yesterday, was seen coming towards us with a large wooden boat about 30' long and 9' x 9' containing vegetables & other supplies in tow. There was a fairly heavy sea running past the \"Suffolk\" & the launch brought the \"Scow\" nearly up to the side and then slipped her, with the result that it was getting rapidly carried away from us. The excitement of the ½ doz niggers on her was amusing they got out some large sweeps & made frantic efforts to bring her back, the old chap at the stern (they row at the bow) ran nimbly along the side and started on to them, there was a great\n\n17\/11\/14\n\njabbering. At last they came alongside but near the stern, the old chap made a swipe at our side with a boat hook and dropped it. They threw up a rope a couple of times but no one could catch it. At last just as they were getting under the counter some managed to get it. They then pulled themselves along the side on the rope that is along our side. They came under the stream of water from our condensers & they thought they would get swamped, when the water started pouring onto them. At last they got up to the right place & the unloading was commenced. All the crew talking at once, they had a general cessation of work, to scramble for coppers. At noon we moved into our place in the lines. We turned round quite\n\n17\/11\/14\n\nclose to the \"Askold\" and straight out N.80°W. to sea. The \"Hampshire\" steamed out on our other flank (Starbd). As we passed the \"Askold\" we all stood to attention &gave them three cheers, which they returned. We also done same to \"Hampshire\", which dipped her ensign in return. Good Bye Ceylon, we saw last of it about 3 P.M. A small contingent from Ceylon is now included with us. Had some Ceylon oranges on dinner table today - queer fruit - skin quite green - usual size but very pithy and tasteless. Boxing not held tonight owing to order prohibiting the showing of naked lights. Had Boxing @ 4 P.M.\n","40":"\n\nNo boxing Cpl Burns sick.\n\nHeavy rain at about 1 A.M. had to go below into bunk to sleep. Courts Martial held all day.\n\n18\/11\/14\n\nThe skylight over the Guard Room banged down during the evening. The splintered glass badly gashed Pte Cunich'sinstep.\n","41":"\n\nDecision of Court Martial on L\/Cpl H. Amos announced to massed battalion. Sentenced to 21 days cells and reduced to ranks.\n","42":"\n","43":"\n\nSlight collision between \"Shropshire\" and \"Ascanius\" early this morning whilst two men who had fallen overboard from the former were being rescued. \"Shropshire's\" stern slighted dented. Got word late that report of men overboard was incorrect.\n","44":"\n\nChurch parade during morning. Band playing popular airs during afternoon. Great number of small flying fish about.\n","45":"\n\nSighted the island of Socotra at 9 A.M. It looked very rugged & barren. We did not pass this island by the usual route. We came by the N side instead of the S. It is 12 miles longer by this route. Lost sight of Socotra about 6.15 P.M.\n","46":"\n\nGot news that we were to call at Aden. Sea as smooth as glass & weather fairly warm.\n","47":"\n\nVery hot day. Sighted Arabian coast near Aden at noon.\n\nDropped anchor off the big rock at 4.30. Saw a couple of big sharks. Aden is very dry and barren. It looks like a huge weather beaten ash-heap on the edge of the desert. Not a sign of vegetation anywhere.\n","48":"\n\nSteam up at 6 A.M. Whole convoy steamed off again @ 6.30 in the same order as before. Very nice fineday. Hugged the coast all day. Shortly after leaving Aden saw several native settlements on the beaches. Passed Perim about 4.30 P.M. Perim is a low bare brown island with a small harbour protected by breakwater. There\n\n26\/11\/15\n\nis a small settlement at the harbour. This island is mainly used as a coaling depôt. There were 5 ships in there when we passed. We plainly saw the wreck of the \"China\" just outside. All that remains is the red-rusted hull which is well up and out of the water. This is at the entrance to the Red Sea, the island being in the middle with a channel on either side, this is the widest passage & is 15 miles across. The African coast shows up plainly on the left, rugged peaks & table top mountains. There are a number of Turkish island - light houses in the Red sea which have been extinguished since their declararation of war. At sunset passed a returning Indian troopship.\n","49":"\n\nRed Sea\n","50":"\n\nRed Sea\n","51":"\n\nChurch parade as usual. Very warm weather. Buried dead firemanafter parade today.\n","52":"\n\nGoing up Red Sea.\n","53":"\n\nArrived in Port Suez about 11 AM - Full of troopships awaiting their turn to go thru canal - Lieut Cook was making some sketches of the mountains in the morning & I did the same & also one of Steamer Point. Everyone looking through their glasses.\n","54":"\n\nMoved in a bit closer to the canal entrance.\n","55":"\n\nStarted up the canal about 9 AM. Passing some Castle Line boats with English troops near Steamer Point great cheering. Goingup canal all day. Arrived Pt Said about midnight and commenced coaling at once by coaliers.\n\ngreat fun when cooliethrew coal down stoke hold in mistake for bunker - I was asleep but got up to see the fun.\n","56":"\n\nIn Port Said all day. Finished coaling about mid-day.\n","57":"\n\nLeft Port Said about 9 AM passing a French warship & shestood to attention & saluted.\n\nArrived Alexandria harbour about midnight & anchored.\n","58":"\n\nIn Alexandria harbour - Church Parade - Taking it easy all the afternoon.\n","59":"\n\nFine bright morning - Transports disembarking & moving out - The Colonel, Adjutant & O.R. Sgt went ashore about 10 a.m. with Capt Davies & a native chandler named Moses & his clerk in Moses' boat - On receipt of orders about 12 our ship was towed into the wharf & and unshipping of waggons, horses & stores was commenced. At 5.30 our Coy was detailed to find a Guard & Town picket; this consumed most of our men. I was placed in charge of the Guard & Gordon& Kelly tooka picket up town.\n","60":"\n\nHad a very uncomfortable time on the guard - no where to sleep - was relieved about 9 AM & returned to ship & fell into bed - Troops disembarked about 6 PM & entrained just near the wharf. Left for Cairo about 7.30 PM. Arrived Cairo about 1 AM at the Bab el Louk Stn & and after a long wait got on board the traoms& went out to Mena - No lightsexcept a couple for officers. I had to watchthe bringing of the luggage. Got to sleep about 4 AM\n","61":"\n\nVery cold and misty morning - Greatactivity - Lot of us officers walked up to see the Pyramids which we were campled quite close to. Not much doing in camp all day except making ourselves comfortable.\n\n"}}