{"Document Name":{"0":"Diary_0325","1":"Diary_0325","2":"Diary_0325","3":"Diary_0325","4":"Diary_0325","5":"Diary_0325","6":"Diary_0325","7":"Diary_0325","8":"Diary_0325","9":"Diary_0325","10":"Diary_0325","11":"Diary_0325","12":"Diary_0325","13":"Diary_0325","14":"Diary_0325","15":"Diary_0325","16":"Diary_0325","17":"Diary_0325","18":"Diary_0325","19":"Diary_0325","20":"Diary_0325","21":"Diary_0325","22":"Diary_0325","23":"Diary_0325","24":"Diary_0325","25":"Diary_0325","26":"Diary_0325","27":"Diary_0325","28":"Diary_0325","29":"Diary_0325","30":"Diary_0325","31":"Diary_0325","32":"Diary_0325","33":"Diary_0325","34":"Diary_0325","35":"Diary_0325","36":"Diary_0325","37":"Diary_0325","38":"Diary_0325","39":"Diary_0325","40":"Diary_0325","41":"Diary_0325","42":"Diary_0325","43":"Diary_0325","44":"Diary_0325","45":"Diary_0325","46":"Diary_0325","47":"Diary_0325","48":"Diary_0325","49":"Diary_0325","50":"Diary_0325","51":"Diary_0325","52":"Diary_0325","53":"Diary_0325","54":"Diary_0325","55":"Diary_0325","56":"Diary_0325","57":"Diary_0325","58":"Diary_0325","59":"Diary_0325","60":"Diary_0325","61":"Diary_0325","62":"Diary_0325","63":"Diary_0325","64":"Diary_0325","65":"Diary_0325","66":"Diary_0325","67":"Diary_0325","68":"Diary_0325","69":"Diary_0325","70":"Diary_0325","71":"Diary_0325","72":"Diary_0325","73":"Diary_0325","74":"Diary_0325","75":"Diary_0325","76":"Diary_0325","77":"Diary_0325","78":"Diary_0325","79":"Diary_0325","80":"Diary_0325","81":"Diary_0325","82":"Diary_0325","83":"Diary_0325","84":"Diary_0325","85":"Diary_0325","86":"Diary_0325","87":"Diary_0325","88":"Diary_0325","89":"Diary_0325","90":"Diary_0325","91":"Diary_0325","92":"Diary_0325","93":"Diary_0325","94":"Diary_0325","95":"Diary_0325","96":"Diary_0325","97":"Diary_0325","98":"Diary_0325","99":"Diary_0325","100":"Diary_0325","101":"Diary_0325","102":"Diary_0325","103":"Diary_0325","104":"Diary_0325","105":"Diary_0325","106":"Diary_0325","107":"Diary_0325","108":"Diary_0325","109":"Diary_0325","110":"Diary_0325","111":"Diary_0325","112":"Diary_0325","113":"Diary_0325","114":"Diary_0325","115":"Diary_0325","116":"Diary_0325","117":"Diary_0325","118":"Diary_0325","119":"Diary_0325","120":"Diary_0325","121":"Diary_0325"},"Date":{"0":"unknown","1":1493.0,"2":1494.0,"3":1495.0,"4":1499.0,"5":1500.0,"6":1505.0,"7":1533.0,"8":1534.0,"9":1535.0,"10":1536.0,"11":1537.0,"12":1538.0,"13":1539.0,"14":1540.0,"15":1541.0,"16":1542.0,"17":1543.0,"18":1544.0,"19":1546.0,"20":1553.0,"21":1554.0,"22":1555.0,"23":1556.0,"24":1557.0,"25":1558.0,"26":1559.0,"27":1560.0,"28":1561.0,"29":1562.0,"30":1563.0,"31":1564.0,"32":1565.0,"33":1566.0,"34":1567.0,"35":1568.0,"36":1569.0,"37":1570.0,"38":1571.0,"39":1572.0,"40":1573.0,"41":1574.0,"42":1577.0,"43":1579.0,"44":1581.0,"45":1582.0,"46":1583.0,"47":1584.0,"48":1585.0,"49":1591.0,"50":1592.0,"51":1597.0,"52":1598.0,"53":1599.0,"54":1600.0,"55":1612.0,"56":1613.0,"57":1614.0,"58":1615.0,"59":1616.0,"60":1619.0,"61":1621.0,"62":1627.0,"63":1631.0,"64":1632.0,"65":1633.0,"66":1634.0,"67":1635.0,"68":1675.0,"69":1687.0,"70":1689.0,"71":1696.0,"72":1697.0,"73":1699.0,"74":1700.0,"75":1704.0,"76":1720.0,"77":1721.0,"78":1722.0,"79":1723.0,"80":1725.0,"81":1726.0,"82":1736.0,"83":1737.0,"84":1742.0,"85":1743.0,"86":1744.0,"87":1748.0,"88":1750.0,"89":1754.0,"90":1755.0,"91":1756.0,"92":1757.0,"93":1758.0,"94":1759.0,"95":1760.0,"96":1761.0,"97":1762.0,"98":1769.0,"99":1770.0,"100":1771.0,"101":1775.0,"102":1780.0,"103":1782.0,"104":1783.0,"105":1786.0,"106":1787.0,"107":1797.0,"108":1798.0,"109":1799.0,"110":1800.0,"111":1801.0,"112":1802.0,"113":1803.0,"114":1804.0,"115":1824.0,"116":1846.0,"117":1878.0,"118":1879.0,"119":1895.0,"120":1896.0,"121":1897.0},"Entry":{"0":"\n\n","1":" Time 1-30 P.M. I am snug beneath the blankets in my bivvy. As it happens, there is nowhere else to go; and it is about the only place where one can keep warm, for outside it is pouring rain, with a driving, bitter wind that chills to the very marrow. Last night my \"bivvy\" mate and I had a very unpleasant experience. Quite early into the evening, after a couple of hours comparative calm, there rose with renewed force, a howling devil of a wind that lashed the sand (which had been surface dried by the earlier wind of the day) into swirling clouds, that looked like a fine mist, but which had a very different effect on the sense of touch. It cut and stung the face like a sharp slate.\n\nAs we lay in bunk that night, with everything snug we could hear the drift of it; and it was blown over the bivvy from the windward side, and slithered down the other in a never-ceasing stream. We did not pay a great deal of attention to it at the time \n\nlittle thinking of the trouble it was going to cause us later, and after a while blew out the light, and went to sleep. How long we slept I do not know, but I remember, being half awakened once by the sheet on my side banging very heavily against \nbeside me","2":" \nand\n as the wind caught it, and noted it was raining. Next thing I heard was my mate calling and saying the bivvy was down. I became aware of the weight of it then, and put out my arm, only to withdraw it as it touched wet canvas, cold as ice. Here was a pretty go. It was raining hard, and blowing a hurricane, and we were under about twelve-square feet of wet canvas, with the sides and ends securely pegged down. The sand that had been accumulating, all the night, on getting wet, proved so heavy that the shelter collapsed under it.\n\nThe great trouble was that these sheets, which are supplied for bivouacs, while they keep out the water when stretched taut, and are clear of everything, are useless if anything touches them from the inside. Consequently, as they were now resting on us, the rain was just leaking through as fast as it descended. We sat up and laughed; we couldn’t help it for it seemed irresistibly funny but it was also very cold \nlifting the heavy sheets with us\n and \nshivering\n we shivered as we dragged our warm bodies out of the blankets into contact with the wet canvas.\n\nWe tried to patch things up, but the sticks were useless, and broke again as soon as we erected them, unable to bear the weight and the force of the wind. So, after many vain and extraordinary contortions, we decided to make the best of it. Fortunately we each had our waterproof capes over our blankets and clothes, so that we might hope to keep fairly dry. At all events, it was no use going outside, to be exposed to the full force of wind and rain, so drawing our capes well up over us, we settled down \nas best we\n to sleep as best we might until reveille.\n\nBut it was a very uneasy sleep. The loose sheets, plucked out by the rough fingers of the gale, kept heaving and flapping in a most unpleasant manner. I, for one\n\nwas not sorry when reveille sounded. It was about the only time I ever welcomed it, I think. I have said that we had our waterproof capes over our blankets and clothes, and felt fairly safe on this score, but alas for my hopes, I found that the continual flapping of the bivvy sheets had worked mine up into a series of \nchann\n folds, making small channels down which the water ran, and the unfortunate part of it was, for me, that the lower \nof the\n end of \nthese\n one of these channels had chosen no less a place to empty its contents than the seat of my ____ but let me draw the veil.\n","3":" I have just been looking at some Australian papers. In the Melbourne \"Herald\" the story of the Palestine victory is told, or at least a portion of it. The amazing part is, that the Australian troops are not even mentioned. The credit of all the fighting is given to Welsh, Scotch, and other home regiments. No Australian has any wish, I am sure, to take away any of the credit due to these troops for the wonderful work they did, but fair play is a jewel all the world over. The taking of the Kuwelfieh Ridge in its final stage, was certainly the work of the Welsh and home counties troops, but for many, many hours previously, day and night, hungry, weary, and thirsty, the Anzac Mounted Division had borne the brunt of the fighting there, and the evacuation was expected the night the Infantry took over from us. \n\nThe first Regiment especially had very heavy casualties there. When General Chauvel’s report reaches Australia, the Australian public will then learn the whole truth. And, somehow, I think it is needed. There seems to be a feeling in Australia in some quarters that the A.L.H. are doing nothing. This has been made apparent in more ways than one, and the boys feel the stigma deeply. One glaring instance, will perhaps \nbear\n suffice. \n\nOne of the A.L.H. received a pair of socks (comforts) from Australia. Inside was a \n\nnote, with these words written on it. \"I hope these socks reach some brave hero in France, and \nnot\n a cold footed shirker in Egypt\". The woman who sent these socks appended her full name and address. The lad who received them went through recently to hosp. badly wounded. Writing as a non-combatant, which gives me the privilege, I honestly believe, in fact, I know, that the A.L.H. here are fighting as bravely and determinedly, aye, and dying just as splendidly as Australian troops in any part of the world. There is not so much continuous fighting, and consequently not the death-roll that there is in France, but the character of the country is altogether different. \n\nHere the struggle is for miles where in France they strive for yards. But what those wearying miles through the sun-scorched sands of Egypt, and the arid, bleak hilly wastes of lower Palestine have meant in weariness, sleeplessness, hunger and thirst, and general discomfort, is beyond the power of anyone to realize unless they have been through it.\n\nJust another word while I am \"grousing\". Orders were read out this morning, and leave to Cairo and Port Said is again on the tapes. Our enthusiasm was somewhat dampened, however, when it was announced that the National Hotel in Cairo was \"within bounds to Officers, but\" – \"out of bounds to N.C.O’s and men, owing to the\" \"shortage of accommodation for Officers\". Now already the Officers monopolize the best places, Shepheards, the Continental, etc. No soldier can cross the threshold of these places. They are sacred to stars, crowns, crossed swords, etc., and other symbols of high rank (though not always high mental capacity), and dire penalties await those of the common herd, who, greatly daring, presume to intrude in these gilded preserves. \n\nBut the National Hotel has always been the Soldiers Hotel, where first class board and lodging could be had, and now the nickel plated snobocracy have deprived us of even that place. Of course, there is the Anzac Hostel but that\n\nplace is always overcrowded, even when the National was open. There are, to be sure, other places also, but both accomodation and character are very often questionable, and none of them compare with the \"Nash\". Directly the parade was over this morning, the remark was passed, \"Oh well, there are always the brothels.\" Rough as the exclamation was, it contained a world of grim truth. There \nare always the Brothels\n and there are temptations enough for the average soldier to spend his time on leave there, without the authorities, in their intolerable exclusiveness, barring him access to the best place at his disposal.\n\nThe injustice of it rankles a bit. But it is always the same. Any extreme will be gone to to secure the acme of comfort possible for Officers, and likewise, any ridiculous addleheaded regulation that helps to harass and make uncomfortable the life of the soldier, quickly finds official approval and sanction. This too, in that most erroneously styled \"democratic\" army of Australia. Of course, we know that things like the above are the \nwork\n result of decisions of the English \"heads\", and are disliked accordingly.\n\nI say accordingly, because the average casual Australian has very little time for anything that savours of the \"Tommy\" officer, and his ludicrous ideas of class distinction, and, on the other hand, the \nEnglis\n ordinary English officer has no love for the \"beastly Australian\", who, in his eyes are \"bally chappies\" or something equally frightful. This attitude, it will be apparent at once, is confined merely to Officers of \nlow\n the lower ranks.\n\nAn Officer in a high command would, and does, naturally value his men from the point of view of their fighting qualities, and they know the Australian Soldiers \nvalue\n worth in this respect, and rate him in their command accordingly, quite irrespective of his personal\n\nqualities and temperament, which appear to be so annoying to his subordinate. Of the English Tommy too high a word of praise cannot be said. I am aware that there are quite a number of our fellows who speak in a disparaging manner of the \"Tommy\" but it is to my mind very foolish. He has proved himself in too many difficult places for any sensible Australian to speak lightly of him. And he is a very obliging and cheerful fellow at nearly all times. With the \"Scottys\" however, our fellows get on specially well, and \"Jock\" loves the Australians.\n\nOn Jan.","4":" we moved from our Camp near Esdud back into the vicinity of Deiran. The morning dawned with every promise of a good day, but by ten o’clock, a strong cold wind had risen, and half an hour after starting, about eleven, the rain was coming down in torrents, driven by a furious wind which it was difficult to make the horses face. In a very short while the black soil flats, which we had to cross, and which were just drying up nicely after the recent rains, became squashy puddles of water, treacherous to the horses feet, and with a most tenacious grip on the wheels of the waggons and limbers.\n\nThe first Wadi which the leading transport reached was impassable, and we stood for nearly an hour in the downpour while a suitable crossing was found. When we reached the ‘suitable crossing’ it made me stare. We had to slide down one greasy, precipitous side, and gallop up the other through a stream up to the girths.\n\nGetting down, of course, was simple, getting up was a different matter. We were the first sand cart \nacross\n to try the crossing and managed it, though the horses had difficulty in keeping their feet in the rush up the opposite bank. The next followed safely, but the\n\nthird, an Ambulance Waggon, was not so fortunate, and stuck fast. \nstriking a deep hole when right down in the bed of the Wadi, and unable to get a foothold for the horses on the slippery bank remained fast.\n Then the leaders of the preceding team had to be unhooked, to assist them. So we traversed three Wadis and, by dint of much unhooking of leaders, and hooking on to teams fast in the mud, and the exercise of an amazing vocabulary, at last all the Ambulance waggons and sand carts were across.\n\nThe two big G.S. waggons remained fast. But it was a wearying muddy succession of \"hold-ups\" before this was finally accomplished. Standing out in the rain, I opened a tin of Mr. Leggo’s excellent sausages and beans, and with the assistance of a biscuit, made a very fair dinner, even though the circumstances were not of the best. When the last of the carts was out, we proceeded on our journey. And camped that night on a marshy about a mile distant from \nRishon le Sion\n Deiran just as darkness set in fed up and rugged our horses, and lit a fire. It was intensely cold. All our blankets were \nback\n on the G.S. waggon which was hopelessly bogged miles back.\n\n An idiotic order had been issued that morning to the effect that the blankets, from which a man should never be parted, were to be carried on the G.S. So, thanks to blundering inefficiency, of which one gets such a wearying bellyful, we were here for the night, wet through, a temperature that felt like Zero, and minus our blankets. We sat or stood round the fire, and sang songs until about 8 o’clock, when on one of the limbers that caught up to us, a roll of blankets was found. I put a stretcher down on the ground, got a blanket from the roll, a couple of saddle blankets and my waterproof cape, and turned in, taking off my boots only, and with a bag of horse feed under my head for a pillow.\n\nIn spite of clothes and blankets I could not get any sensation of warmth. The icy wind pierced through everything.\n\nWhen I did go into an uneasy doze, I was suddenly awakened by the feed bag being whisked out from under my head in a very summary fashion. I sat up amazed, wondering for the moment what had happened. Then I became aware of the form of a horse looming up in the blackness alongside of me. I recaptured my pillow, but he refused to budge, till I got up and chased him. Henceforward the night was a nightmare. Three loose horses were promenading round, and as sure as I dozed one of them would grab my pillow, and when they did not wake me up doing it, I dreamt they did.\n\nNext morning early, the","5":" we hooked up again, and reached Camp about ten o’clock. The rain, which had cleared up in the night, had commenced again, and we arrived in a deluge. The bearers, we found, who had gone on ahead of the transport, and had reached Camp the night before, had had a worse time even than we. They had spent the night, huddled in a bed tent, in their wet clothes, without a solitary blanket between them. They must have had a rotten time.\n\nThe view of the country from here is singularly peaceful looking, and with the fruit trees just breaking into bloom, and the hills just touched with green, it is very beautiful. One would never dream that war had lately swept over it. This Camp, however was declared insanitary, and on the","6":" we moved to another about a mile and a half from the Jewish Colony of Rishon Le Sion . We are just about sick and tired of the wet season, and are longing for some continuous fine weather. We get a few days fine, and then five or six days wet and cold.\n\nBut there is no doubt of the beneficial effect on the Country. Green feed is springing up everywhere, the orchards are a mass of blossom with the most delicate tinge of green just showing. The lanes are ablaze with anemones, and small yellow flowers under the prickly pear\n\nhedges and in other shady places small lilies are displaying blossoms of a single petal, curved over at the top, of the most delicate green, with brown stripes, and a single stamen. It is a miniature Aaron Lily, but scentless. Another very beautiful variety, whose flower is barely a couple of inches from the ground is making its appearance. We have been here for just on a month now, and rumours of an early move are consistent.\n\nOn","7":" \nwe left the\n all the transport and a few bearers left this Camp on the stunt of which we had heard so much during the last few days. One rumour had it we’re going to Bethlehem, another to Jerusalem and Jericho, but none but those in charge really knew where our objective was. At about 10 A.M. on a day of beautiful sunshine, we moved off, the Divisional Band \non the\n seated on their \"donks\" (donkeys) playing us away from the Camp.\n\nLeaving Rishon le Sion on our right, we passed through the village of Deiran, and out onto the fertile undulating country that lies beyond. A journey of several miles brought our slowly moving line of transport, wriggling like a huge snake across the gentle sweep of hill and hollow, opposite to the Arabic Village of Madineh . This place which is mentioned in the book of Joshua as one of the cities of Judah, is supposed at one time to have been a place of importance, judging by the considerable ruins found here.\n\nHere we were greeted by lines of Arabs and Bedouins, with bags of oranges, and their cry \"Oringies, Kuwayis, Sitta, wahed piastre\". (Oranges, good, Rice one piastre.) On both sides of the road the fields were gorgeous with flowers. Jewish Colony near Akir (Ekion). Dinner time, when a halt was made, and the horses fed, we boiled the good old billy and had some dinner. Billy tea is the best tea in the world, and travelling on such a glorious day as this was, was enough to give anyone the appetite of a horse, even though there was only bully beef and biscuit to satisfy it.\n\nSomeone has wisely said, \"Hunger is a great sauce\", and I have can truly\n","8":" that while travelling in the glorious sunshine here, and sleeping under the stars at night, I have enjoyed a meal of bully and biscuit, with a mug of billy tea, better than any meal I have had anywhere. Shortly after dinner we began to get into rocky country, and also in an incredibly short time, the sky clouded over, a cold wind rose, and there were ominous signs of approaching rain. \n\nThe rapidity with which the weather changes here during the wet season is remarkable.\n\nThat night we made Junction Station, and camped. \nThe sky had cleared a little, and as we made our beds that night, it was in the sincere hope that the rain would hold off.\n At this place the Railway line crosses the Wadi Mewabba, a continuation of the Valley of Sorec of the Bible, and just about here it was that Samson the strong man succumbed to the charms and entreaties of the lovely Delilah, (at least, I suppose she \nwas\n lovely) was captured by the Phillistines, deprived in a summary fashion of his eyesight, and led a prisoner and weakling, into captivity to Gaza.\n\nThe sky had cleared a little by the time we were ready to turn in, and as we lay down, it was in the sincere hope that the rain would hold off.\n\nBy 10 A.M. on the","9":" we had resumed our journey. Clouds hung low around the horizon, but the morning was otherwise fine. The character of the country had now changed greatly, and instead of the long stretches of arable land of the day before there were now small patches from which the stones had been removed, under cultivation. The long low hills were very rocky.\n\nPloughing was in progress on all sides as we proceeded. The teams are unique. Here an ox and an ass, or a camel, or two donkeys, and in one instance a poor old grey horse, literally held together by his skin, was toiling painfully and slowly from end to end of the furrow, stopping every now and again, and urged to renewed efforts, by the good, and \nhoarse\n guttural cries of his\n\nArab driver. It was pitiful to see him, and his appearance called forth a storm of invective from our boys, on the head of the ploughman. It would have given me a great deal of pleasure to have been privileged to shoot the poor brute.\n\nIf the way had been gay with flowers on the day before, it was doubly so \nto da\n now. In addition to anemones, under the shelter of the rocks were cyclamens of \"perfect beauty\", blue, pale blue, pink, and white. Daisies and a yellow gorse bush flower were in abundance. The day remained fine, though a little cloudy, and we drew in and camped for the night at the foot of Mount Zacariyah , with the village of the same name at its foot. This mountain, though only a little over 900 feet in height, looks quite considerable, and a splendid panoramic view can be obtained from its summit. There are several natural caves in its sides.\n\nThough the location is not certain, it is supposed that here the Phillistines camped on one occasion of a war with Israel, after the anointing of David as King over Israel, though Saul still reigned, and here the memorable meeting, so dear to the hearts of children all the world over, took place between David and Goliath, when the youthful shepherd slew the Giant with his sling and stone. I remember with what vivid interest I listened to the story as a child, especially when David ran forward, and drew the great sword from its sheath, and cut off the shaggy head and the sword was \"all bloody\". And now I have stood, if not at the place, at least in the vicinity, and I felt all the old interest revive.\n\nNext morning the","10":" we were early on our way, as water was not obtainable here, and we were to water our horses a few miles further on. Here we got onto a good road, dating from Roman times, and \nat the villa\n in a flat rocky valley, with the little village of Beit Natyf perched on the heights above us we watered our horses. The water here is good, but full of small leeches. From here we commenced our arduous climb through the forbidding, barren waste of the hill\n\ncountry of Judea. It is a most interesting sight to see, the small patches of land, some as small as twelve feet square (about) which the natives have cultivated.\n\nThese patches which lie like dozens of small terraces of green, all the way up the mountain side, represent the only visible soil, among the ancient, time worn rocks covering and crowning these heights, and have only been made workable by dint of much manual labour in clearing them of the smaller stones. For centuries, likely enough, they have been there, handed down from father to son, each in their turn wresting from these pin point fragments of fertility a laborious and precarious living. These hills indeed, save for the beautiful flowers thrusting their delicate stalks up and the sunlight everywhere, show nature in her ugliest and most sullen mood, baring bristling teeth \nmans efforts\n to her children’s efforts to gain a livelihood on her face. No effort of imagination could call them beautiful. They are too rugged and stern for that.\n\nJust after we commenced our climb, on the right of the road we saw a broken stone pillar, I suppose nearly two feet in diameter. Several fragments of it were lying on the opposite side of the road. On one of the larger blocks were traces of a time worn inscription. We had halted a few minutes, and tried to make out the inscription, but only some letters remained, but enough to make its Roman origin clear. This \nwas what\n were the letters we could decipher, I.M.P. Caesar.\n\nBut it is very worn, and even some of these letters we had to guess at. But there it stands, a monument at one and the same time, to the genius and power of the men and Empire whose legions in the dim past marched this way, and a silent testimony in its ruins of the frailty of earthly pomp and power. As the columns ruins lie, \nwhere once it reared itself one\n so the glorious Empire whose progress it marks has long since crumbled into decay, and ruin.\n\nSo we journeyed on mile after mile, and always climbing, and always before us, and around us the vast panorama of the Judean hills.\n\nThere was an incident as we journeyed that morning, that served to impress most indelibly on one’s mind, the servile position occupied by women in this land. When we watered, \nan\n a woman toiled by us, on the upward load, with half a bag of some stuff on her back, held by a rope passing round the forehead. After we had resumed our journey some time we passed her, with bent back, and eyes set on the ground still struggling on. We proceeded for about three miles, and halted for a rest, and we had not been there half an hour, when she passed us again. As we started once more, we saw her resting herself and her burden on a rock by the side of the road. We passed her, and I said then to the driver in front, \"I wonder how far she is going. If she passes us again I think I will put her load in the limber\". An hour or two afterwards we rested again, and sure enough, presently there came round the bend, the same toiling bent figure.\n\nAs we started, I told her to put her bag into the limber. She was pretty well exhausted then, and had walked about seven or eight miles. Her bag was more than half full of oats, and weighed 80 or 90 pounds. She only had one eye, but the poor soul beamed upon us with the one that was left, and with a cavernous mouth, which disclosed a regular battery of strong milk white teeth, in such a manner as to show unmistakeably the gratitude she felt.\n\nAt the same time as we went up there were also three men climbing with us, leading three camels, not overloaded by any means. The men were carrying nothing. The woman told us as she wedged alongside the limber that she\n\nbelonged\n to them. Rather than put any more on their Camels, or carry a pound themselves, they made this poor creature carry it for them. \nAnd they were going to Bethlehem\n, anything between miles. And how far she had come before we saw her, I do not know.\n\nAt our first halt, we could see away back in the hills, a house, which through the glasses, resolved itself into a big two storied building with a large courtyard round it. Some natives passing when I asked, told me it was Bet Jemaal, then said Latine, and made the sign of the Cross to show priests were there. \nI cannot place at all in the guide book I have.\n It is I find a school and farm belonging to a Roman Catholic Brotherhood dating since 1868. Afterwards we passed the straggling little village of Kinoor, and then Bet Atab .\n\nThis village \nwhich\n is built on a rock which contains a cave sinking to a depth of 250 feet beneath the town. It is supposed to be the Cave where Samson fled to shelter from the Phillistines and here, to make peace with the Phillistines some 3000 of the Israelites took Samson, bound him and handed him over to them. But Samson broke his bonds at the sight of his enemies, and with the jawbone of an ass slew 1000 of them. From just near here we caught, away on our left, our first glimpse of the spires and steeples of Jerusalem. At last, in a series of short sharp turns the road reaches the top and then begins a rapid winding ascent. Half way down we could see the village of El Khudr lying beneath our feet in a fertile valley. The principal building being a very large Greek Monastery.\n\nJust beyond the village we camped and watered our horses that night at one of the Pools of Solomon. Nearby are the ruins of an ancient fortress. We saw only the smaller of these enormous reservoirs, which stretch in a chain along the Valley of Etam, the favourite retreat of King Solomon. These pools, which are some 200 feet above the Holy City, supply it with water today as they have done for centuries.\n\nEarly next morning, the","11":" I climbed the low rocky hill, that lay between our Camp and Bethlehem, and from the top, I saw for the\n\nfirst time, the Cradle of Christianity, the City where the Messiah was born, where, to a nation groaning under the tyranny and oppression of the Roman yoke, and waiting in its darkness and bondage for the dawning of the morning of Deliverance, He came, as a helpless Babe, for whose Mother, in her hour of travail, there was found no room in the inn, and who, perforce had to turn aside into a cave used to shelter the cattle of those who stayed at the Khan. A beautiful church, the Church of the Grotto stands over the place today.\n\nHere too, on one of these \nmemorable\n rocky slopes, on that memorable night, were the drowsy shepherds watching their flocks, when on their terrified senses burst the vision of the Heavenly Choir, which first allayed their natural fears, and then announced to them the tidings of Great Joy, of peace and Goodwill on earth among men. Along these ways, too came the Wise Men, bearing their precious gifts, and eager to worship the King of whose birth they had learned. What a host of sacred memories hover round this place.\n\nIt is fragrant with the memory of noble men and women of Bible history. It is associated with Rachel whose tomb is here, with \nRuth\n Naomi of the beautiful Book of Ruth was born here, as were the mighty men Joab and Abisai, and David Israel’s noble King, \nand\n Jacob knew it, and a host of glorious recollections come crowding upon one, as he gazes. I do not think anyone could look upon this city unmoved. He must be strangely hardened and indifferent if he could. There are some fine buildings in the town. Churches predominate, Greek, Roman Catholic and Protestant also a Turkish Mosque.\n\nAbout midday we were on our way again, this time on the final stage of the journey to Jerusalem. Our way lay through Bethlehem. I should imagine that if one could visit this\n\nplace, say a month or two later than we have done, when the vines and fruit trees were in leaf it would present a very pleasant if not beautiful picture, but as we saw it, with the shroud of winter hardly lifting from it, with its wildernesses of stone walls dividing each small allotment, and \nsurrounded by\n with the barren sterility of the rocky slopes which encompass it, it looked singularly waste and barren.\n\nOn the left, as we passed through, rises on the opposite slope the village of Beit Djalah. This village is entirely Christian, and many fine vineyards and olive orchards surround it. After we had passed a little way out of Bethlehem, we came to the tomb of Rachel, the beloved wife of Jacob, situated on the top of the rise on our left. It is a small simply constructed structure surmounted by a stone cupola. This, I believe has been destroyed, or partially so more than once, and again rebuilt, the latest addition being the closing up of the Arches by the Mohammadens. Then came the Monastry of St. Elias, an ancient edifice crowning a height on the right of the road. This place dates back to 1160 at least but, the Emporer Heraclius founded it long before that date, and restored in 1160 by the Emporer Manuel Comnenus. To the \nright\n left of the road is shown the rock where Elias was fed by the angel.\n\nA little further on is Before this\n Before this comes \nthe\n a Hospital founded by the Knights of Malta. Shortly afterwards we came in sight of the Holy City. The view is certainly not impressive from this entrance, apart of course from the associations which surround it, for right and left is country rich in historic interest. Just before we come to the Station is the plain of Raphaim on the left, the scene of many Israelitish conflicts. A long, winding, descent leads\n\ndown to the Buket es Sultan, the Ancient Pool of Gihon, which we pass on the left. The Ancient Walls built by Saladin in 1562 lie in front \nof it\n of us. We went straight up the narrow steep street to the Jaffa Gate, where we turn sharply to the left.\n\nThe first thing that struck me was the number of priests, Greek, and Catholic, that were around. They were about in dozens. After proceeding for a considerable distance along this street we turned to the right down the Hill past the Hospital of St. Louis, now used by us as a hospital, with the New Gate on our right, down past the Damascus Gate, and Herod’s Gate, and then down the winding descent past the Garden of Gethsemane, the Russian church of St. Magdalene, with the Vale of Kedron on our right past the Golden Gate, and so on up to the Mount of Olives where we had an hour’s rest. In that time we had to unload, go back some distance and draw rations, feed our horses and have a meal ourselves, and reload the limber ready to start off again.\n\nIt was a very hurried performance, all except the drawing of the rations at the dump. Officialdom in the Army is never hurried especially if you are in a hurry yourself. Then their slowness is exasperating in the extreme. Quarter masters are especially susceptible to the complaint. Anyway we had time for a mouthful, and then we were off again. This time we moved just to the borders of Bethany, and then turned sharply to the right, off the main Road, and our troubles began.\n\nPrecipitous is the only word to describe the descent we began, and in addition, it was rough and stony in the extreme, and a perilous journey for night time. We would travel for about ten or twelve yards on level \nground\n or fairly level ground, then a sharp\n\nturn to the right, with a dangerous bank \non the right\n to swing the transport clear of, and an exceedingly steep descent to the next level. Then the process would be repeated, only this time the turning would be to the left; and so on, with many stops, we finally reached the bottom, and a fair road, but not before the pole of the Water Cart had been broken, one Sand cart dislodged from its bed, and the coupling work of our rear limber broken and the limber and its contents launched almost into the Wadi, alongside the road. After fastening it as best we could we reached camp for the night after only once leaving the tail end of the limber behind us.\n\nWe slept soundly that night.\n It was rather amusing when our rear limber capsized, there were some Scotch Infantry men passing, coming from the firing line. Just as one was alongside the accident took place. The Scot moved as though shot out of a rocket, and only just in time. \"Ye pit the wund up me that time; it was worse than the shells,\" he said, when he had recovered his composure. We slept soundly that night, and without any rocking.\n\nWhen we stirred on the","12":" we found ourselves in a deep green valley by a Dry Wadi. To the flowers we were already familiar with, there were added beautiful wild stocks, scarlet sweet peas and another heliotrope specimen which I had never seen before. We watered our horses at a huge excavation in the chalky wall of the Wadi, filled with water the colour of strong tea, and quite as rich in fragrance, but of a different nature. They did not enjoy it overmuch, but it was all there was to be had.\n\nWe were able to go to the top of a neighbouring hill, and see the struggle put up by the 60th Division for the possession of a hill about three miles away. Through the glasses everything could be seen\n\nclearly. The Artillery were pounding this big bluff, sending in H.E’s and shrapnel at a great rate. Then suddenly the heavy guns ceased, and one could see the thin, straggling lines of men clambering up the slopes towards the Turkish positions. They looked like ants in the distance.\n\nPresently the firing broke out again, but this time the shells were lobbing on the far side of the hill, catching Johnny as he retreated in haste. We moved up that evening to the next hill to this, and here the transport was blocked. The road had become impassable.\n\nThis is the wildest looking district I have ever seen, I think. Though some four miles or more away from the Dead Sea, it partakes to a large extent of its barren desolate appearance. The rugged hills are limestone in character, great fissures renting their sides, where the water from the rainfall of centuries has rushed down to the Wadi below. This mount on which we spent the night must be, I think, the mount called in Arabic Arak Es Schems, or Rock of the Sun. At any rate if not it, it is in its immediate neighbourhood. An \nwinding\n extremely steep zigzag, with precipitous sides led down to what I take to be the Wadi el Mukelik, where we watered that night, at two great excavations in the sides of the Wadi, similar to the one we watered at the night before but infinitely larger. The water though very discoloured, and smelling a good deal, was slightly better.\n\nThat night, as we were boiling the billy, the rain which had been hanging about since the 16th commenced. A great mass of transport had by nightfall accumulated there, but were unable to proceed. Therefore, as the congestion on such an exposed position offered an excellent target for enemy bombs, it was very early on the morning of the","13":" that the Camp was on the move again. This time we were going back a little way, to get onto the old Roman road leading to Jericho, which was our objective.\n\nA little way brought us up to some stretcher bearers trudging along with silent burdens, men who\n\nthe day before had counted their duty dearer than life itself, and a little further we came to the melancholy assembling place for such burdens, where many still forms lay, while the graves were being dug. A padre was in attendance waiting to perform the Service. So, on this sacred soil, over which perhaps the feet of the Lord himself had wandered, these gallant men are laid to rest. Many quiet graves, some nameless, are scattered all over Egypt and Palestine.\n\nJust here, too, stand the ancient ruins of the Khan el Ahmar, the Caravansary of Red Stones. Then a few moments brought us onto the magnificent old Roman Road leading to Jericho. About an hour and a half or two hours journey and we camped for dinner. The ground all alongside the road is pitted with great shell holes from our guns. Three bridges had been destroyed by the Turks in their retreat but they were no hindrance to the traffic. The spots were ill chosen. The Wadis which the bridges crossed being easily negotiable with very little effort. \n\nIn the afternoon I took a stroll up onto the hill in front of us that the Turks had occupied the night before. All these hills are wonderful natural strongholds, and it is marvellous how they were driven out of them so soon. The side of this hill was strewn with shrapnel nearly as thickly as it was with stones. When we reached the Turks machine gun \"possies\" it was easy to see why Johnny had departed. The Artillery fire had been terribly accurate. Many of the H.E.’s had made bull’s eyes of these possies, and the trenches nearby. It was no wonder he went.\n\nA short walk of about a quarter of a mile brought us to the Khan Hathrove or Hostel of the Good Samaritan. This place, which is comparatively modern, is said to be built on the site of the inn of the Parable of the Good Samaritan of the New Testament. One end of it suffered much from shell fire, and is a complete wreck. The front wall commanding a difficult turn in the road, had been broken in two places by the Turks, who had placed machine guns there to \ncommand\n dominate the approach. Hence the necessity of firing on the building.\n\nA climb of another couple of hundred feet, and we stood on the\n\nruins of Qulast ed Doumm, or Castle of Blood. These ruins are \nvery\n extremely ancient, and built of a very red stone, from which it is generally supposed it takes its name. The present ruins were built by the Crusaders, and were spoken of by very early writers, but according to Authorities, they only replaced a much older construction. From the summit of these ruins a magnificent view can be obtained, taking in the Valley of the Jordan, and the Mount of Temptation, with the Monastry on its heights.\n\nWe were to go on to Jericho from here, but it was decided at night that only a portion of the Ambulance was going; and to my disappointment our limber was not included. \n\nWe were to go back to El Khuddr, by way of Jerusalem. At eight o’clock that evening we were hooked in and went our different ways. The rain, which had only been intermittent throughout the day commenced again, with occasional sleet and a biting wind. This we had to face all the way back to the Holy City, a weary journey, and being night, any object of interest on the way was passed unconsciously, except one place on the right of the road, where we attempted to water, but which had gone dry, which I took to be the Fountain of the Apostles.\n\nWe arrived on the Mt. of Olives, after a very rapid zig zag ascent, at about one o’clock in the morning of the","14":" The ground chosen for our Camp was a quagmire, and it was a rather low-spirited \nmob\n crowd that made their beds in the rain that night. Still even then there were jokes cracked and songs hummed as the billy boiled. The same morning, at about 8.30 we were on the way again, once more through Jerusalem, and arrived at El Khudr, frozen through and through, \nabout\n a little after midday. All the rest of that day it rained, sleeted, and froze.\n\nThe","15":" dawned in a similar state of icy misery. I stayed under the blankets all the time not occupied in attending to the horses.\n\nAt about 4.30 P.M. we received orders to yoke up \nagain\n and proceed again to the Mt. of Olives. These endless fruitless\n\nhaphazard journeyings back and forth from one place to another make one sick and weary, and inclined to call down something rather different to a blessing on the heads of the muddlers responsible. They, by the way, are \nsitting\n well-housed in warm and comfortable quarters in Jerusalem, so of course, human nature being what it is, Galles like they \"care for none of these things\".\n\nAs we climbed once more the steep slippery streets I began fervently to wish I had never seen Jerusalem. Then those in charge of us could not find their way to the Mt. of Olives, but took a wrong turning, and we had much labour to \nturn\n set the big G.S. waggons round again on the narrow road. Oh the depth, and breadth, and height, the width and circumference, the richness and fertility of the brains of the Army. By some strange brain-kink, some curious and fearful contortion of the mental processes, which should give brain specialists in the future a wide field for study, we always seem to be doing something wrong, something absurd, something so childishly and futilely stupid it would amaze an infant.\n\nMeanwhile, it still rained, and still the icy wind whipped our hands and faces, and turned our feet to blocks of ice.\n\nHowever, all’s well that ends well, and we reached our destination at last, and weary, cold, and disgusted, fed up our weary nags and sought what shelter we could construct against the elements, for a nights rest, or rather, what remained of it.\n\nWhen\n The","16":" dawned with ragged grey skies weeping alternate rain and sleet and no signs of a break. Some of our fellows went on leave to Jerusalem, after first being \"deloused\" which is a very interesting and comforting process on a wet cold day. I did not go, preferring to wait\n\ntill the morrow in the hope of better weather. That day was another succession of wintry blasts and sleety rain, cold in the extreme. I do not think I have ever been so cold in my life.\n\nPreviously I thought that parts of the New England district in N.S.W., and Ballarat in Vic., were cold enough for anything, and represented about the extremes in changes of climate, but Jerusalem, and in general the hill country of Judea, knocks it to use a colloquialism, \"into a cocked hat\".\n\nWonder of wonders! the","17":" dawned fine, though still cold. Reveille was half an hour earlier to enable leave men to get away by 7.30. I am included. There is a tremendous rush, feed up, draw rations for horses and selves, have breakfast and get ready to go on leave, all in about an hour. I got ready, but went minus my breakfast. These leave crowds that have gone these last few days must be, I think, the most bedraggled looking pilgrims these old walls have seen for some time. Boots, leggings, and in many cases clothes caked with mud, we must have made a rough looking crowd. Anyway here we were. \n\nFirst we were to go through that \ninteresting\n delightful process known as \"de-lousing\". The lice here are typhus infected, and as they are abundant, every precaution must be taken. We marched through endless dirty streets and narrow, stenchful lanes until at last we reached the place. Here are several big steam disinfectors in use. Overcoats are done first, then when they come out steaming hot and are dried which takes only a few minutes, you strip to the skin, put your overcoat on and in go the rest of one’s things. While these are \"doing\" we have a bath in tepid water. Then our clothes are out, dried in the sun, and in a few more minutes we are on our way to pick up a guide, and see what the Holy City has to offer us. Of course we can only see a little, and that little we can only glance at.\n\nWe have about four hours. At half past four we are to move camp again, this time back to Rishon le Sion.\n\nAt about 10 A.M. we meet our guide, a tall, overgrown Syrian, with a protruding bottom jaw and a drooping moustache, long legs and feet encased in heelless boots. We are yet to discover, at what a pace, and how far the same long legs can carry him. After an interval, his voice is heard \"Ve are all here? Ah yes. Ve vill begeen.\" First we were shown the Jaffa Gate, then \nDavid’s Tower\n the massive buttresses and walls of David’s Tower, from there to the ancient House of \nCaiaphas\n Annias, Father in law of Caiaphas the High Priest.The Prison of Christ, where is the ancient site of the House of Caiaphas came next. We entered the enclosure which opens into a courtyard whose floor is paved with tombstones. The guide told us they were the Tombs of the Armenian Monks of Jerusalem.\n\nTurning to the left we entered the Chapel called the Prison of the Lord, after being shown in the Courtyard the place where Peter denied his Lord. In the Chapel the Altar is built round a portion of the stone which closed the sepulchre of Christ. Three portions of the stone are left uncovered for pilgrims and visitors to touch, should they so desire.\n\nWhether this is really a portion of the stone or not is perhaps a matter for question, but is at least certain that the side of the Chapel itself marks the place where the Saviour of men was ill treated from His first condemnation \nbefore Caiaph\n until the morning, and it is very reverently that we uncover, accept the Candles lighted for us at the door and pass round the Altar, touching the stone as we go. At the end of the court we were taken down some steps and shown the remains of an ancient mosaic pavement, extending\n\napparently right under the convent. This is all that remains of the ancient church of S. Peter.\n\nComing out of the enclosure of this building we were \ntaken\n shown the site of the House of Mary, the Mother of John Mark and from there to the Cenacle of David. A number of stairs took us to the Upper Room, the place of the Last Supper & the Descent of the Holy Spirit upon the Disciples at Pentecost. The washing of feet took place in the room below us. A few more steps and we were gazing at a hideously draped structure in the shape of a Tomb, a representation of the Tomb of Royal David which lies in the vault beneath. A special permission has to be obtained to visit this vault.\n\nBack down the steps again, round many corners and by tortuous way and we were conducted to a spot on the southern wall, from where our Guide pointed out the Pool of Siloam, where the miracle of sight was performed on the blind man. The Hill of Evil Counsel, where, craftily and in secret the Jewish leaders planned the Death of Christ, where Judas betrayed Him into their hands, and where after flinging his blood-money down at their feet, he went and hanged himself.\n\nFrom there by way of the Dung Gate to the wailing place of the Jews. This is the only portion of the Ancient Temple of Solomon left to the Jew today, and here on a Friday, the Jews gather to weep for the destruction of the Temple, the glory that has vanished, and the restoration of Jerusalem. These massive stones are wonderful. They are covered with Hebrew characters and the wall goes down 80 or 90 feet below the level of the pavement. \nA few\n \n\nThis place is, I fancy, one of the most curious sights one can see. There were few people here on the occasion of our visit. Only half a dozen old dames were there, and a couple of men, mothers\n\nand fathers in Israel, with the Lamentations of Jeremiah propped up against all that remains of the Temple and city’s ancient glory in front of them, and reading its mournful passages in a high pitched wail, bowing themselves down and groaning as they read, while the tears start from the dim old eyes, and steal down the withered cheeks. How many centuries they have lamented here, and now surely it seems as though a brighter day were indeed dawning. From here we went to see the Mosque of Omar. This is reckoned to be one of the most beautiful buildings in the world. A few steps lead us up to the sacred enclosure of Mount Moriah, paved with great flat, square stones. On our right as we enter is the Mosque el Askar .\n\nIn front of this mosque is a porch with seven Arches, answering, we are told, to the seven Arches of the Church. The central one is much larger than the rest. We just had a glimpse inside. The Mussulman doorkeeper, pointing to the ceiling said, \"Lebanon\" so we judged he referred to the rafters, and meant to indicate they were made of the Cedars of Lebanon. The \"Columns of Ordeal\" were also visible, two beautiful columns placed so close together that it would take a man of average size all his time to squeeze through. \n\nOne earnest follower\n It is said that the Mussulmans believe that only those who can get through are sure of Paradise. One earnest follower of the Prophet, anxious, doubtless about, the bearing his present dimensions had on his welfare hereafter, attempted to squeeze through, and died on the spot. Since then, an iron grating has been fixed up between, lest the Census returns be depleted by other seekers after a knowledge of the future. The beautiful windows at the back, through which a soft light filters, attracts the eyes at once, as\n\nalso do the beautiful carpets.\n\nThe Mosque of Omar was closed to all but Mussulmen by order of the Military Governor, so we were debarred the privilege of entering this place. The outside is not to my mind very pleasing, but once inside, they who have seen it declare that the effect of the light streaming softly through the many marvellous windows, is a thing that fills one with pleasurable amazement and wonder. \n\nThe Mosque is reached by climbing a flight of eight steps on either of the four sides of the raised platform on which it is built. A Portico of beautiful columns, each of different color, and taken, our guide informed us, from the ruins of the ancient Temple, surmount the steps on all four sides. A very beautiful domed structure, supported by two rows of lovely pillars, eleven outside, and six inside, is called David’s Tribunal, and in Arabic Quobbet es Silseleh, or Dome of the Chain. They believe the dome is connected by heaven by an invisible chain, and that this chain, by some miraculous means or or other, will serve at the Judgement to differentiate between the just and the unjust. Under the dome of the Great Mosque of Omar, is the sacred Rock of Moriah, the same that Abraham brought Isaac to in the dim old days of his sojourn in these parts, and where in the days of the Temple’s glory, the High Priests of Israel sacrificed the daily offerings \nin the Temple\n to the \nGod\n Lord.\n\nIt is rather surprising that the Israelites of today have no desire to build again on the site of the Ancient Temple, but a Padre who had been in conversation with leaders of Jewish thought in Jerusalem assured me that they have no desire in that direction at all. From the wall, we were shown the Inner Side of the Goden Gate, walled up by the Mohammadens in\n\naccordance, it is said, with an ancient prophecy which declared that it was by this gate that the Infidel would enter Jerusalem. So he walled it up, and the Infidel, in the shape of General Allenby, entered by the Jaffa Gate instead. It was rather underhanded of the prophet, whoever he was, to play them a trick like that.\n\nFrom the Mosque we were \nwent to the Chapel\n shown the site of the house of Herod and then we went to the Church of the Flagellation where the scourging took place, and \nthen\n the Chapel of the Condemnation and Imposition of the Cross. Both of these chapels are very beautiful but, owing to the haste with which all our sightseeing was done, I am totally unable to describe them with any detail. Then we went out to the first of the Stations of the Cross. The tenth, eleventh, twelfth & thirteenth \nand\n Stations are in the Sepulchre of the Holy Cross.\n\nAlong the Via Dolorosa we wended our way, made sacred for all time by reason of the fact that along this way, bearing His Cross, the subime Saviour of Man, Kingly even in his humiliation, trod His sorrowful way to Calvary. Of the feelings which dominate one on visiting such places as these it is hard to speak; Awe, Joy, Wonder, and a \ndeep sense\n sense of deep reverence and love, all these are present, and more, but they are too deep and full for expression.\n\nThe Church of the Holy Sepulchre was not open to visitors, until 4 PM. So, as we were moving Camp at 4.30, we were unable to see it, much to our regret.\n\nGerman Protestant Church where the Kaiser preached in 1898 at opening.\n\nOur guide gave us at this point about an hour in which to purchase any curios, if we wished to do so, conducting us to the American Colony Stores to do so.\n\nAfter everyone was fixed up, we recommenced our journey. We went out the Jaffa Gate, down past the beautiful Damascus Gate, Herod’s Gate, and so to the rock just outside \nthe Greek\n the beautiful porch at the Entrance to\n\na Greek property, where St. Stephen was stoned. Then we proceed, and are shown the rocks where tradition says the disciples slept, \nwhile\n during the Agony in the Garden, and so down to the Garden of Gethsemane. On our right let into a little alcove, is a beautiful representation in marble of the Garden Scene, our guide told us by Michael Angelo, but I find the guide book says by … or, …\n\n(Previously I may mention we had passed and had pointed out the Tomb of the Virgin Mary, and the ruins of the Ancient Church which contain it.) The olive tree under which the Saviour knelt is pointed out to us, \nas\n if not the identical tree, at least shoots from the root of it. And, indeed so old and venerable does this immense bole appear, that it is not hard to believe that this is the very tree which witnessed the Divine Agony. Our time is growing very limited, so instead of going in, we walk round and then ascend, to be shown the Pillar marking the place where Christ was seized by the Soldiers, and so we proceed \non our\n up the steep ascent of the Mt. of Olives.\n\nFrom the road leading past the old Jewish Cemetry, Samuel’s tomb, on the hill on the right, is pointed out. Our guide tells us of the great fight that took place there when the Turks counter attacked in an endeavour to retake Jerusalem, and he told us also that on retiring, they put two or three shells into Samuel’s Tomb. Then we go on to the chapel of the Ascension, a circular building with a dome, very Mohammaden in appearance, under which in a square of white marble, is enclosed the stone, from which, is generally supposed our Lord ascended into heaven. Then we go to the Church of the Paternoster, a vast building.\n\n The gate of the central building is opened for us by a young girl, and we pass into a gallery built on the square, in the walls of\n\nwhich, on marble slabs is painted the Lord’s prayer in thirty five languages. Beneath us in the square are the traces left by a French Exploration Society, who were searching for the ruins of the old building when war broke out. On the far side from the gate is the tomb of the Duchess of Auvergne, who purchased the land for the Church in 1869. Napoleon III conceived the idea of the Tomb, and had it executed, and presented to the Princess while she was still living. Her body is not in the Tomb. This finished our journey and we turned our steps toward Camp. On our way we had a beautiful view of the Dead Sea and the Jordan. Arrived in Camp, after a hurried meal, we were set immediately to packing up, and by five o’clock we were on our way from the Mt.\n\nAll that night we travelled, halting for a rest and feed-up about nine o’clock. We travelled along the Jaffa Road, going on a down grade until we were right out of the hills. By about six o’clock of the","18":" we were back in Rishon-le-Sion, a distance of over 40 miles, and how weary we were, and our horses were just about done.\n\nMost of us slept that day, when not busy with our horses, and at night even we needed no rocking.\n","19":" The trees in the orchards round here have put on a wonderful amount of green since we left. Only 10 days but the difference is marvellous.\n","20":" Tomorrow morning we move again to Ramleh, I believe tomorrow, and after that, well time will tell.\n","21":" We were to move off this morning at 9.30, and great was the hurry and bustle in preparation, and many and stentorian were the orders issued, but after all the excitement, it was eleven o’clock before the Brigade got a\n\na move on, and we had to wait for them, and then after travelling about a mile, we \nhad to wait another\n received orders to wait and allow the Brigade Transport to pass, which took another hour. Twelve o’clock was blown on the Rishon le Sion wine cellars whistle before we finally got a move on.\n\nSuch is the glorious uncertainty of Military movements. At twenty past two by the clock \non the great\n on the tower of the Great Hospice of St. Josheph of Arimathea in Ramleh, where during the siege of Jaffa, Napoleon and his staff lodged in 1799, and the Church was changed into a Hospital, now it has become a H.Q. for us and also a hospital for our boys, we were passing the front entrance of that place, with the celebrated Tower of the forty Martyrs on our right, behind us the stately ruins of Cour de Leon’s Church, on our left the Great Church, \ndedicated I think to St George\n and all around us the immense olive gardens surrounding Ramleh. Some of these, judging by appearances, are extremely ancient.\n\nThe difference in Ramleh today and when we first came through about four months ago is wonderful. New main roads of excellent character have been constructed. Wide roads have been laid for light Motor Traffic, the old roads have been repaired, and their sides re-ditched, and the whole place hums and throbs with activity. Immense Motor Transport waggons pass one in \nstring\n files numbering scores, Camels loaded with all kinds of war materials, amble by in \nstrings\n groaning, bubbling strings of a hundred and more. Signs boards are everywhere. The place seems to have become a great centre of Military Operations. The work entailed has been enormous. In addition to the transformation effected by the hand of man, the new rains have \ntransformed\n changed the country surrounding the town into veritable garden of green fields and blossoming fruit trees.\n\n6th March. I feel nearly too tired to do any writing at all to-night, and only the knowledge that I will get very much behind unless I keep up day by day, spurs me up to it. We were on the way by about 8 AM. \nthis morning\n, and have only just settled down for the night. It is now about 8 P.M. All day we have travelled along the main road from Jaffa to Jerusalem, passing out of Ramleh by the main road along the side of the Mussulman Cemetry. Many villages\n\nlie along the road. Two of these close to Ramleh, evidently have no importance, as their names are not given in my guide book, the third on the right is the Village of Banishment from Ramleh. Called in Arabic, a name signifying Ramleh of the desert, and further on, still on the right the hill Tell Gezer, where once stood the important city one of the Pharoahs gave to King Solomon as a wedding present with his daughter. It has an important history. Recent excavations by the English Exploration Society have brought to light ruins and remains which prove without doubt the great antiquity of the place.\n\nLayers of ruins which prove Jewish, Roman & Muslim, and finally Arabic occupation have be found. After climbing a rather steep ascent, we passed through the village of El Koubab, and from this hill one can look down on Emmaus and Latroun and what remains of the fertile plain of Larun, before the road taking a wide curving sweep to the left, enters the hills, and away, almost in front, perched on the top of a hill, Upper Bethoron from which place Joshua, fighting five allied Kings, and fighting time as well, commanded the sun to stand still. Latroun is famous in that a bandit chief by the name of Athiony made it his stronghold for some considerable time in the year four of our era, and became a considerable nuisance till the Romans wiped him out.\n\nThere is a fine Monastry here under the control of the Trappist Fathers. In Emmaus are \nare the\n many ruins chief among them being the remains of a church built on Ancient Roman ruins in the 5th or","22":" century. We could not see these from the road. Shortly afterwards we entered the hills, passing on our right the old inn Bab el Ohad or Gate of the Valley, and then we began to ascend.\n\nAfter passing the ruins of an old Mosque, shaded by beautiful evergreen oaks on either side, there are beautiful Olive Gardens on the right of the road, and after an exceptionally steep winding climb the Village of Soris, the Soris\n\nof the Bible. From here \nthrough\n one gets a wonderful view. The Mediterranean can be seen, and a place I took to be Gezer. Also several small villages on the right. Directly afterwards we camped for the night. The place, I believe, is El Enab. There is a comparatively new building \nsmall church\n here just above the Camp which is being used as a Hospital. All along the road are Watch Towers built by the Pasha of Jerusalem in 1860 as a protection to travellers. Turkish police were stationed in them. We have had a terrible day. It blew a gale, and the fine dust from the roads, cut one’s face, and made the eyes very painful.\n","23":" At Bethel, Jacob made a pillow of stones, but at El Enab where we spent last night, we beat Jacob all to ribbons, for we had entire bed of stones. Stones everywhere, lying loose on the hillsides and when the superficial ones were cleared away, there were others bedded in the ground. However, we slept soundly, at least I did.\n\nWe were up betimes in the morning, for it was said a rough, heavy road lay before us. The first move was to water the horses. This entailed a journey of a couple of miles over rocks and boulders, and by all sorts of side tracks to the Wadi el Sikkah. Just here on our right as we descended into the Wadi, are the ruins of an immense monastry. The ruins are very ancient. On the east side the old wall rises to a height perhaps of 30 feet. It is quite seven feet thick, and its broken irregular top is a mass of weeds. Several large areas remain, notably one which supports the heap of rubbish which is practically all that remains of the interior of the building.\n\nThis is a ruin of the 12th Century, Deir el Benet or \"Convent of Daughters\". On our way down to water we passed the village of El Enab with the old church on our right. Coming up from the Wadi one gets a better view of\n\nof this old place. This is a twelfth century building also, erected by the native Christians on the ruins of an old Roman fort. The road we travelled when we finally got a start on with the transport was rough in the extreme. It knocks our horses about terribly. We took the road which branches off from the main Jaffa to Jerusalem road, just above the village of Saris and immediately before coming into sight of El Enab, which lies just round the bend. Almost immediately after starting we halted to allow the transport to straighten itself out, and could see it \nscramble\n wending away up the rocky hill in front, the horses scrambling and stumbling among the loose stones, and straining at the traces.\n\nJust here on our left, is a comparatively new building, with what is a most rare sight here, a galvanized iron roof. What it is I do not know. It was quite an hour before all the transport in front had moved and we began the ascent up towards Nebi Samwil, the highest mountain in this part of the Country. The journey was a series of halts. The limbers most of them overloaded, had their burdens shaken off at frequent intervals, and the road being so narrow, each time this occurred, the whole of the transport would have to wait.\n\nThis occured several times with us, and then, going down one big hill, our brake broke, so finding a place where we could turn to the side of the road, we pulled our team over, unloaded, and then reloaded afresh. By this time the Artillery transport had possession of the road, and we could not have got onto it had we tried without breaking their column, so we fed up, boiled the billy and had dinner ourselves of Maconochies. This is an excellent ration of meat and vegetables, and far superior to, and more liberal than bully beef. There must be going to be a great stunt up in these hills this time. For an hour and more a seemingly endless stream of big guns and gun limbers passed us, the biggest display of artillery I have seen here\n\nyet. Just as we had finished dinner and were preparing to yoke up, a curious figure made its appearance on the hill. A big stout man, dressed in a long and voluminous robe of a black coarse material with capacious hood hanging down his back, and an enormous crucifix suspended from his portly waist, and a large and bespectacled face, with full black beard, crowned with a big white cloth hat. He smilingly bade us \"good day\" in broken English. In answer to my enquiries, he pointed out the Monastry of El Khoubbieh on our left, from whence he had come, and told me that the famous Nebi Samwil lay on our right towards the north east. Crowning the height on our right was the village of El Sukir.\n\nAfter our fresh start, we found the road a good deal better. I must not forget to mention the wonderful view we had from the top of the hill previous to our accident. Looking out to the west, one can see the coast line almost up to Cesaeria, Jaffa, Ramleh, Ludd, and all the smaller towns of the plain are clearly visible, and then the blue line of the Mediterranean stretches away on the left for many many miles into country totally unrecognisable to me, though we must have seen a good deal of it.\n\nTurning our back on the Mediterranean the first thing that attracts one’s gaze is the outskirts of the Holy City. Then away in front and to the right, stretch miles of the terriced rugged hills, little spots of green cultivated patches showing vividly on their sides, and with many of them, their peaks crowned with tiny villages. A journey of perhaps a mile, and we had passed a portion of the Battery, who were unyoked for dinner. Then on the right, a couple of caves, big places with massive pillars supporting the roof, all cut out of the solid stone. There are many of these about, mostly used for stabling animals, some with mangers complete, all carved from solid rock.\n\nSoon on our right, we saw a beautiful lake of water, a natural reservoir formed in a basin\n\nof the hills. Right on the furthest edge of this the Ambulance was camped. It is good to be so near abundance of water. After unyoking and fixing the horses up, a shave and a bath are pleasant duties. The old village of Beitunia crowns the hill on the left of the road. \nhere\n","24":" We are to stay in this Camp, I hear, until afternoon. Last night I was awaked by the gentle patter of the rain on the roof of my bivvy, and this morning it is coming down steadily. We can look forward to two or three days of wet and discomfort again I suppose. As we are now well into March, the rainy season should be about over. I hope so, at any rate. Three of us went up into the village on the hill this morning. The places are of very solid construction, one in particular is very large and underneath are stone arches opening into all kinds of queer tortuous passages and underground rooms. In these the native population live in the midst of filth and odour indescribable.\n\nIn the centre of the village among the ruins are two marble columns, one upright, the other lying down. They are about 13 ft. long, with cornices top and bottom, they have no inscriptions of any kind, but have without doubt been brought from some more pretentious building than any in the village. A Turkish battery has been camped here at one time, but the ground all round his gun position is pitted with shell-holes, or H.E. leaving a tremendous cavity about 10 yds. from him. An old Arab telling us about it, said that, after that shell came many of the Turks \"slept\". I should think they did. ‘The rest’ he said \"imshied\" (ran away).\n\nFrom the top of the houses a good view of Jerusalem can be seen, and on the left crowning a hill the Christian village of \nRammalah\n Ram Allah. The promise of rain in the morning did not, fortunately for us, materialise, and the afternoon is fine. According to Brigade Orders, we were to move out at 4.30 P.M. With characteristic military precision we moved at 5 P.M. and went about 500 yards, where we stuck till about 6.30. It was already dark when we passed through the village of Ram Allah. Even in the gloom one could distinguish many fine buildings in this place, mostly, by their appearance, of a religious character.\n\nThis village is entirely Christian, and in normal times, has a population of about 5000. These figures, I expect, would be a good deal depleted during the war, especially as the inhabitants are Christian. There is one thing specially noticeable which distinguishes the Mussulman from the Christian village. The Christian place is at least fairly clean, with many decent buildings, while the entirely Mohammaden village of the same character is indescribably filthy and evil smelling. This place on the south western side is honeycombed with stone walls, about 6 ft. in height, built of the rocks and stones cleared from the soil to allow cultivation.\n\nOnce we started, we moved at a great pace. In the darkness, floundering among the rocks, and going down-hill without a brake on a heavily loaded limber, at a breakneck pace, was anything but a pleasant sensation but there was a consolation, we were only a short time on the road before reaching Camp. It is wonderful how quickly a camp takes formation. The Brigade was hardly in to night before bivvys sprung up as though by magic, and the opposite hillside to us was lit up by the flare of hundreds of Camp fires, producing a most picturesque effect. I got my bivvy up and had tea. By that time it was 9 o’clock. Then I did an hour’s picket on the horse lines, and have just come in, and am writing these few lines before turning in.\n\nThe Guns on the right have just opened up, and Jacko is answering. Big things tomorrow I expect.\n","25":" From 10 P.M. last night till dawn, the guns kept up a desultory bombardment \nall through the night\n with intermittent machine gun fire. All through the night and in the early hours this morning, squads of Infantry were tramping by going up to the firing line, some singing softly, others conversing in low tones, and again other groups marching in silence only broken by the scrunching of their feet on the loose stones and the rattle of their accoutrements. \n\nJust as dawn was breaking, \nthe guns spoke\n the big artillery broke out in earnest, and the machine guns kept up a ceaseless staccato. 8 A.M. Word has just come through (not official) that the position has fallen and Johnny is once more on the move. \nWe were to go as far as Beiten last night but for some reason or other, did not do so\n Beiten lies just ahead of us. We are camped on a rocky hillside, a little to the north east of Ram Allah. We are surely winning the War. This morning when Brigade orders came through there was an enquiry appended: \"On one of the G.S. Waggons yesterday, a man was noticed, driving and \nnot wearing his leggings\n. Did this man belong\n\nto your unit?\" and this is the front line. The Giant, Red Tape, dies hard. How could poor Turkey, or Turkey and Germany together, be expected to stand up against a spirit like that! It is irresistible.\n\nWe went this afternoon and climbed the steep terraced sides of the hill on our right. From this hill, Et Tell should be almost due east, but I could not be sure of it. My guide book tells me only that it is a hill covered with stones, and every hill, and they are legion, is a wilderness of stones in this locality. This hill is believed to be the site of the Ancient City of Hai, the inhabitants of which Joshua put to death by the sword, to the number of some 13,000 or so, burnt the city and \"made it a heap for ever\". North East rise the heights of Baal Hazor, where Absalom, David’s beautiful but erring son, ran what in Australia we would call a sheep station, and when at the close of a shearing he had a great banquet to which he invited all his brothers and, at a given signal, when his brother Amnon’s \"heart was merry with wine\" Absalom’s hired assassins fell upon him and killed him. To-day British shells are pounding it for all they are worth, and by the look of the shell-bursts, Jacko must be having quite a respectable afternoon’s enjoyment. \n\nAnd, while the big shells prepare the way, one can see the soldiers of one of the youngest nations in the world, on its sides nearest Jerusalem dismounted and waiting to advance. \n\nBeitin or Bethel is rich in interest. Here Abraham pitched his \"evening tent\" while journeying into the land of Canaan. The site, or as near to it as possible, is marked by some ruins of an ancient Church. Here, too, he and Lot, finding the growth of their flocks such that the land was unable to sustain, both, decided to separate, Lot casting envious eyes onto the well watered valley of Jordan and making it his choice, which cupidity later led him into much trouble at Sodom and Gomorrah by the Dead Sea.\n\nHere too Jacob the supplanter, after working on his brother Esau’s hunger and stealing his birthright, rested while fleeing from Esau and it was in this place he saw his vision and named it Bethel. The two Deborahs, the one who nursed Rebecca, Jacob’s mother, and Deborah the prophetess, an early day Joan of Arc, were familiar with this place. The first is buried here. It has been the scene of many Israelitish conflicts. Each year the prophet Samuel came here in exercise of his functions as Judge over Israel and here Jereboam, after the division of the tribes of Israel, fearing that if the people went up to Jerusalem they would become estranged from his rule, raised a golden calf for them to worship. The feet of Elijah, Elias and many another Biblical hero also wandered over these hills in their lifetime and here Elijah’s budding prophets underwent their training, and now, in our time, we tread the same soil, and gaze on the hills and valleys they saw, and the same hills re-echo to the sound of our great guns, as in their\n\nday they re-echoed to the war cries of their Champion of Israel, marching up against the cities that oppressed them. \n\nLater, Jacko is evidently retreating. Eight of our planes have just gone over his lines, without doubt to bomb. I can almost find it in my heart to pity \"Johnny\"\n\nWe watered this evening at Beitin. I find that our Camp is about a mile and a half or two miles from the township. There is a spring of beautiful clear water, on the South, or perhaps south west side of the village and this supplies all the water for the Brigade. It is practically inexhaustible. Besides the horses of the Brigade, others water here, all twice a day, and also all the water for the troops’ use is drawn from it, yet it always remains at the same level.\n\nThe troughs (canvas portable) are down in the ruins of an old and very large basin, about 120 yds. in length by 75 in width. The old walls, the east end of which is built of very large stones is still standing most of the way round to a height varying from four to ten feet. On the south side there is the remains of a small circular reservoir, and I noticed one or two basins cut out of the solid rock lying around, and also the base of a very large marble pillar. The larger basin and its attendant constructions have evidently been beautiful in their day, but very little is left. We could only see the newer portion of the township from the watering area but even this is now in ruins. The basin bears the name of Bahr Beitin, or Sea of Beitin. \n\nOn a hill just near are the remains of a very old construction, only one end wall and a very small side portion remaining. This is supposed to mark the site of the Altar of Abraham and Jacob which he built by Divine Command on his return journey to Bethel (Beitin). The hill is called Bordj Beitin. After comparative silence, once more the big guns are speaking. The rumour that came through this morning is only partially true. The Turks have retired from Baal Hazor, but only to a very strong position in rear of it.\n","26":" Today is perfect. After an exceedingly heavy dew, the sun rose in a cloudless sky, though later it has become a little hazy. I took a walk up to another hill today about a mile distant in search of El-Birih , and found it, discovering at the same time that it was within sight of our Camp all the time. I had taken it to be the outskirts of Ram Allah. This is a Mohammaden village, very poor in appearance. Even it has its history however. It is\n\nan old Benjamite town, and had many years previously been in Egyptian hands. I wanted to see the remains of the two large reservoirs which are here, and which are reputed to have been of very fine workmanship, but the village itself is of course like all other villages \"out of bounds\" and Tommy M.Ps. (Mounted Police) are as numerous as the rocks are about here, and are only too anxious in some cases to \"limber\" an \"innocent abroad\" so having no pass, I thought discretion the better part of valour, and contented myself with what I could see from the hill top, which was not much.\n\nThe remains of the old Khan were visible and the rest was just an ordinary Mussulman village. The Church of the Holy Family is here, receiving its name from the tradition that it was here that Mary and Joseph, on their return from Jerusalem, having gone a day’s journey, discovered that the child Jesus was not with them, and returning to the Holy City, found him in the Temple in discussion with the Elders. The Mosque of El Aksar in Jerusalem is supposed to cover the portion of the old Temple in which the discussion took place.\n","27":" The temperature undergoes wonderful changes in a short period in these latitudes. Yesterday was warm, and today is bitterly cold, with a fine chilly rain. I went with one of the other boys for a walk of about four or five miles, there and back to one of the further hills on the east of our Camp. We were rewarded with a good view of several historical villages and places. Perched on the top of a very high conical hill in a north-easterly direction we could see the village of Ophrah, called in Arabic El Tayibeh (the Good). This place is the Ephraim of the Bible. When the leaders among the Jews had decided that Jesus should die, his disciple John in his record, says that he walked no more openly among them, but retired to a city near to the desert called Ephraim.\n\nThe great desert of Beth Aven lies just on the Jordan side of this place. Almost immediately on our right as we faced Ephraim lay the village of Dai Diwan, and just showing over it the peak of the hill and a portion of the town of Ramoun. The Children of Benjamin had\n\ncome into conflict with the Children of Israel because they refused to help them right a wrong that had been done to an Israelite by the man of Gibeah. Disaster overtook the Benjamites, and in confusion and disorder they fled to the Rock Rimmon, while the men of Israel, pursuing them, slew them in thousands. Only 600 Benjamites reached the Rock alive, and for four months they held out till peace was made. This is the Ramoun of today. \n\nAway to the East through a dip in the hills, one could see the waters of the Dead Sea, and the desolate, forbidding heights that rise round it on the other side of the Jordan, and further still, behind these and on the left the majestic heights of the mountains of Amitar. \nBehind us\n On our right, as we faced the Dead Sea lay Jerusalem, the Dome of the Mosque of Omar, and that of the Holy Sepulchre being clearly visible. \nWe had had a long walk and stiff\n And in between Beitin and the Rock Rimmon, a hill that is, I feel sure, from its extraordinaryly stony character, the traditional site of the City of Hai. So though we had had a long walk and a stiff climb, I felt amply repaid for the trouble taken. \n\nThe Turks have retired for 15 or eighteen miles from the positions they occupied here, so I suppose we shall move soon.\n","28":" When reveille sounded this morning, the clouds were very low, flying along before the furious wind like great grey \nghostly\n rugged phantoms, blotting out sight of everything at a hundred yards distance. It is bitterly cold. How the native population exist, clad in their miserable rags, I do not know. They must be as hard as nails, or else they suffer terribly in the region’s winter here. Everywhere one goes now, in any direction almost, the native population are making roads for the Army. Little girls and boys, squatting down on the roadside, breaking stones, the older men and women, including those of a grey wrinkled old age, carting the broken stones in baskets on their heads, and tipping them onto the roadway, while others again are engaged rolling or carrying the big boulders from the mountain side to be broken up.\n\nThere must be thousands of them, all jabbering at a tremendous pace, or droning out their weird songs as they work, but they do very little. The inhabitants in this part are of a most wretched type. Their villages are full of filth, and I fail to see how they can be otherwise than hotbeds of disease. Their clothing is miserable in the extreme. In fact\n\nabout themselves and their dwellings is an air of squalor and wretchedness that I have not seen equalled in any other part of Palestine, foul and insanitary and squalid as most of its native villages and inhabitants are.\n\nA batch of prisoners went by this morning, about 30 in all, two Turkish Officers at their head. They were a most nondescript looking crowd. Our poor unfortunate horses are feeling the cold keenly. For five or six days now they have been on insufficient feed, two or three handfuls of grain, barley and peas, and a handful of tibn (coarse chaff) per meal. One feels ashamed to face his poor old nag these times. And the cold still continues. This country reminds one of the Bulletin Cartoon in which a Sailor asks a soldier what Mesopotamia is like, and the soldier replies, \"W’en its ‘ot its ‘ot as ‘ell, when its cold, its cold as ‘ell, and w’en it blows it blows like ‘ell. And this is the ‘Promised Land’\".\n\nAustralia is reckoned to be, I believe, one of the oldest countries in the world, but it could never have existed in the days of the Exodus, or Infinite Wisdom would surely have transported His chosen people there, but I am glad He did not, for they would have ruined and spoilt it utterly. The Lord knows our politics and politicians have more than a fair share of spineless asininity, and, in their ignorance and incompetence they have done enough towards making Australian affairs stink in the nostrils of decent people, but even they, objectionable encumbrances as they are, are preferable to an invasion of the class of \"Chosen\" that exist here.\n\nI did a little bit of an outflanking movement on the M.P’s at El Bireh this afternoon, and went away round the back of the village to get a view, if possible of the reservoirs there, but could not get very close. However, I had a good view of the Mussulman oratory, which surmounts the cistern and also of the old Khan. This has been a very large place, but beyond three or four tremendous irregularly shaped arches, which are on the Jerusalem side, and one or two others now detached, which have at one time been part of the building, very little of it now remains.\n","29":" I saw very little after all, but the hill climbing served to get my blood in circulation if nothing else. We were talking to some Royal Horse Artillery men at the Y.M.C.A. tonight, and he said that the Turks have retreated to within 3 miles of Nablous, and that\n\nthe City is expected to fall tonight. Also, that official information had come through that in France an advance had been made of 12 miles along a 30 mile front. So the old Empire is not done yet, as so many of the pessimistic crowd (and they number quite a few) would have us believe. It is most curious to hear men, bred and born and sheltered \nby the\n under the British Flag, and reaping of its benefits, both at home and what is still more curious, fighting for her abroad, who are always ready to decry what she has done, and what she is doing, and declare that she has ‘lost her punch’ and must soon have peace, but not with victory.\n\nI am glad and proud to think that never even in her darkest and most unpromising hours during this war, has my confidence in her and my belief in ultimate victory been shaken. There may be many dark hours ahead yet many precious lives that she will sorely need for her development in the future may have to pay the supreme sacrifice before the day of victory comes. Storms within as well as without may buffet and bruise her, and threaten to submerge her entirely, but the darkest hour is significant of the dawn, from the blood of those who have died will then spring the fruits of Peace, and she will ride the storms, and find her way into the still, calm waters at last, into that Harbour whose name is victory.\n\nHenry Lawson’s \nbeautiful\n stirring lines come into my mind in this connection as I write,\n\n\"She’s England yet, the nations never knew her,\n\nOr, if they did, were ready to forget.\n\nShe made new worlds that paid no homage to her\n\nBecause she called for none as for a debt.\n\nThe Bullying curs who deemed all nations craven\n\nAnd that her star of Destiny had set,\n\nWere sure that she would seek a coward’s haven, \n\nThey tempted her, and found her England Yet.\"\n\n\"We learn our England, and we soon forget\n\nTo learn again that she is England yet.\"\n","30":"\nWe took\n Sydney Bulletin","31":"\n\nWe took our departure from Beitin amid a deluge of rain this morning. To the description given of Mesopotamia, culled from Syd. Bulletin, might be added regarding Palestine, \"An w’en it rains, it rains\n\nlike ‘ell\". Gradually, however, the storms became less frequent, until when we reached Jerusalem, it was fairly fine. By the time we got to Bethlehem, the sky was clear, though it remained cold. It looks like a fine day tomorrow. We are camped in a fine, clean, sandy position right on the outskirts of Bethlehem, in an olive Garden. I had hopes of being able to get leave here, but orders tonight after \"feed up\" have knocked it on the head. \n\nEven on duty, one has to have a special pass, no one is to leave the bivouac area under any pretext whatever, unless provided with a special pass, or accompanied by an Officer. Heigho, it seems a case of \"so near and yet so far\". Contradictory \"furfies\" are flying about, one that we are here a couple of days, another that we go on to Jericho in the morning. Our poor horses sadly need at least a week’s spell, with all the feed they can eat. They are cutting up terribly, and most of them are both shin sore and foot sore, with the rough roads. There is a weary ‘fed up of the war’ look in their eyes, that are big with a mute appeal for food whenever one approaches them.\n\n15 March Yesterday was a bad day, but today is the wildest and most turbulent I have seen in this country. Enormous masses of rugged clouds have been driving low down on the hills before a furious blast all day. My own bivvy is still standing, but many were blown down. When for a moment the gale ceases the rain falls in great drops. To-night, just as it was growing dusk, the sky presented one of the wildest pictures imaginable. The clouds in the west had broken a little, and their racing banked up masses, \nof cloud were\n dark with the approaching night, were \nshot through\n at their torn and jagged edges lurid with the blood-red glow of the departing day.\n\nOver the desolate region of the Dead Sea, they hung in \nforbidding banks\n wild, weird formation pile upon pile, dark, gloomy, \nand\n forbidding, and ever changing, now banked up into a thunderous mass, and now riven asunder into long ragged streamers, and\n\never, while the light lasted, through all their swift changes suffused with the crimson fires of the day, dying in the midst of chaos and disorder. Now that the day has gone, and darkness has set in, the night is full of a fierce unrest, tumultuous \nwild\n spirits ride in the gale, wrestling with the gnarled branches of the \nancient\n venerable olive trees, tearing their leaves off in handfuls, and casting them spitefully among the stones grappling in a wild unruly anger with the \nstone\n ancient rock walls that withstand them, and shrieking their way through the hills to that bare and desolate region where surely on such a night as this, the Spirits of all the Great Army of lost Souls might congregate and hold riotous carnival together, the region of the Dead Sea.\n\nDevils that stir men to deeds of oppression and violence, fiends that sow in men’s hearts, the lust of pride and power that leads to war and bloodshed, sweep fiercely and exultingly by on the wings of the gale to the trysting place holding holding high carnival over the bones of the piled up dead, and counting those who shall fall on red fields to-morrow and howling through the barren hills, in cruel derision over those who are out wounded to-night, exposed to their fury and power. A wild, wild night, typical of the War Spirit that holds the world in its grip, wringing it to an agony of blood and tears that knows no staying. Ride on in your chariots of wind and storm and tumult ye evil spirits and rejoice for this is your hour, and the storm of darkness. And yet mayhap the world that tomorrow’s sun will rise on better for thy passing, a world cleansed and purified by the very fury of thy passing. And so, we remember no good and perfect thing can come to us without sorrow, and tears, and pain.\n\nThe Gift of the Prince of Peace made three hills echo to the lamentations of Rachael, mourning for her children and refusing to be comforted, because of the Innocents who were slain. Yet the pitiful tragedy of infant massacre and the woe of sorrowing motherhood ushered in a new era of peace and good will to man. And so the anguished Rachaels of this our day, the sorrowing motherhood of the world, walking their mournful way with dim eyes, and bowed hearts and heads, shall surely also see this dark \nnight\n wild night of fierce unbridled passion pass, and in the clean, sweet dawn of sanity and restraint which must soon come, a new and better world shall appear, purified and ennobled by the blood of their martyr boys.\n","32":" The bad weather still continues. The wind has not been so boisterous today as yesterday, but it is quite as cold, with more rain. The continuous wet and cold is telling on men and horses alike. The sick parades from the Regiment are larger every day. What this cruel weather must mean to those poor fellows who, after being wounded may have to spend some hours before the Ambulances can pick them up, is beyond conception and yet this does sometimes occur, and through no fault of the Ambulances engaged. As for instance, in the attack on the hills in the west of the Jordan on the 20th Feb. the country was absolutely impassable for vehicled transport of any kind, and most of the carrying of wounded had to be done by parties of stretcher bearers, and these had to carry their burdens a long way, the consequence being \nthat there were some they were\n their progress was slow, and some were not brought in till the morning.\n\nThe other night, while we were in Beitin, after a very cold, wet, and windy day, I was just settling down to sleep when I heard an Ambulance waggon jolting by on the rough road. They stopped opposite our Camp, and I could hear the moans of a wounded man inside. He was evidently an Officer, for in answer to an inquiry of his, the orderly replied, \"It’s not much further now, Sir\". Then evidently the wounded man asked them if they could find a smoother path for I heard the driver say it was impossible to go off the road; and so, indeed, it was. In reply to an inquiry from outside, the driver said this man had been lying out all day.\n\nEnduring intense physical torture from his wounds, he had been lying exposed to the bitter weather for many hours, \nand the\n probably without food or water, and then had a rough ride of many miles that must have been Hell to him. He still had more than a mile to do, to Ram-Allah where the clearing station was. The road was made of stones varying from the size of one’s fist to the size of one’s head. After a few minutes rest, they moved off very slowly, and right away in the distance I could hear him moaning, and imploring them to stop again. This, of course, they could not do. He had to be taken to Hospital and that as quickly as possible.\n\nI fancied I could hear him long after the sounds had died away in the distance. They say that war makes one callous, and so it undoubtedly does to a certain extent, but I should never like to think I could grow so callous as to be indifferent to sights and sounds like these.\n\nThe night is closing in as I write these lines, without any visible promise of a break in the weather. The sombre skies are hugging the earth in a grey and dreary embrace, the hills quite close at hand totally obscured, by the drifting, leaden colored masses of cloud. Will it never cease? I’m wet through, and in spite of all one’s care, even the blankets get damp. Oh for a bit of Australia and the sunshine.\n","33":" It is still raining. This afternoon the sun made some futile attempts to show us that he was still in his ordinary place, but the few beams allowed to reach us were very weak and watery. Now he has hidden himself once more, and it is raining again. To-day being Sunday, it was announced that there was to be an R.C. Service conducted in the Church of the Nativity. Although not a member of that body, I decided to go as it was probably my only chance of seeing the interior of this building. Ten of us set out, through the slush, and in a heavy downpour, walked the half mile or so that lay between our Camp and the Church, arriving in a dripping state. Our overcoats and hats were deposited in the entrance hall to the Franciscan Convent. The walls of this place are adorned with lithographs depicting Biblical scenes, from the Fall onwards. In many of them symbolical figures represent the vices and virtues. The lifting of a heavy drapery allowed us access into the Chapel of St. \nFrancis\n Catherine. \n\nApart from some fine oil paintings there is nothing of special beauty about the interior of this church. In fact, the seven large glass chandeliers, which are encrusted with dirt, and containing candles reclining in their sockets at different angles, and which have from their appearance been a long time in their places together with the rather inferior work round the altar, serve to give it a somewhat cheap appearance. One especially noticeable object was a very handsome and richly carved pulpit of some dark wood. The\n\nconfessional boxes at the back of the building were also finely carved, and of the same material.\n\nWe sat there for about three quarters of an hour, and were then informed that Brigade had no given the Padre notice, so there would be no service.\n\nAfter a little enquiry and persuasion, one of the Monks sent out and, with a Machine Gun Officer, were successful in obtaining a pass for us to go through the building. Through a small doorway, which one has to stoop to enter, we pass into the Basilica of the Nativity. This is an enormous enclosure. Forty four immense marble pillars, with the remains of old paintings on their smooth surfaces, now almost obliterated, extend the length of the building, eleven in a row. The roof is very lofty, but the bare rough wood of the rafters looks very unsightly. These were formerly covered with lead, provided by, and placed there in the time of Edward IV of England, but the Turks have stripped it of all this lead for war purposes, and the roof now lets in the water copiously. Much of the lead, doubtless, many of our boys stopped. The place has been the scene of much disgraceful rivalry between the various sects, Armenian, Greek and Latin. In some cases this enmity has gone as far as the shedding of blood, and this in a place sacred to the birthplace of, and dedicated to, the Prince of Peace. Truly, so-called religious feeling finds strange expression sometimes.\n\nAt the far end of the Aisle, an extremely ugly wall has been erected, the work, I believe, of the Greeks in 1842, and due to the same jealous spirit which seems to have prevailed so long here. Passing through this wall by a doorway, one stands in front of the Greek altar, a very tawdry affair, and on the left on a raised platform the High Altar, also Greek property, and on the extreme left the portion which is owned by the Armenians, with their altar. From there we go through a small doorway, ornamented with beautiful marble work, somewhat darkened and spoiled by a fire which took place in the 18th Century as a result of one the religious feuds. Beautiful bronze doors close these entrances. A descent of a number of steps, and we stand in front of the Altar marking the place where the Saviour was born, and from whence\n\nhas sprung all the love and charity, the kindly deeds and words done and spoken in His name ever since. A little to the right is the Altar of the Crib. The Crib itself is now in Rome. Directly opposite is the Altar of the Magi where tradition says the wise men laid their gifts before the Babe. In the passage in front of the Altar of the Nativity hang many beautiful lamps, mostly silver, some the gift of European and English notables. One is from a prince of Austria, another from an old time King of England. Set in the white marble floor of the Manger under the Altar, is a great silver star, the gift of the third Napoleon, surrounding it the inscription \"Hic de Virgine Maria, Jesus Christus natus est\". Round the star fifteen lamps burn night and day, the property of the three Sects occupying the building. The walls of the Grotto are protected by a fireproof linen, the Gift of the French Govt. \n\nFrom the Sacred Grotto we descended to St. Jerome’s Chapel. One window bearing a representation of the Saint, lights up this small place. Here St. Jerome translated the Bible into that version known as the \"Vulgate\" from the original Hebrew. Then the tomb of St. Eusebius. Further on, in a room excavated from the rock, are tombs, two face each other, St. Paula and her daughter and the Tomb of St. Jerome. Then we climbed up a flight of stairs and we were in the Church of St. Catherine once more. \n\nOur inspection was over. Nothing remains but to pay the Guide, and give something to the Satellite from the Greek arm of the Basilica, who had provided us with small candles, and who now came whining for \"Backsheesh\". \"Backsheesh\" is the curse of both Egypt and Palestine and here in this land it has established itself even in those places which from time immemorial have been regarded as sacred by Christian peoples, until it seems these places are now a source of a livelihood to innumerable loafers than anything else. It disgusts one, leaves him with a feeling of nausea, and the petty jealousies and squabbles, which have taken place in these sanctuaries deepens his disgust still more.\n\nWhy should the Catholics, Greek or Latin\n\nor Armenians, or any other, for the matter of that, fight over the possession of these places. They surely belong to the whole Christian race whether he be Greek, Latin, Armenian, Copt or Protestant, and if these so-called ‘Guardians’ of these places had the slightest portion of the Spirit of Him whose sanctuaries they \"guard\" or any reverence for them at all, such disgraceful scenes could not occur. The old saying \"Familiarity breeds contempt\" seems specially applicable in these cases.\n","34":" I have written so much about the rain and miserable weather here that, in justice to the Bethlehem climate, I must say that it is fine today, and what a Godsend this sunshine is. To have dry clothes and blankets and to get the mud dried up a bit is Heaven. To-morrow, I hear, we are leaving Bethlehem. It is a quiet, peaceful little place, with an air of serenity about itself and its people, that seems specially becoming. \n\nThe women wear an old-world costume here that is very quaint. A stiff brocaded head-dress like a Welsh -chimney pot hat, without any brim is fastened on the head by a band passing under the chin. This is anything from 6 to 10 inches high. Over this and \nround\n meeting under the chin, covering the ears a long white veil, reaching to the knees is worn. Heavily brocaded jackets, and striped draught’s board pattern skirts complete the costume. The men’s dress is very similar with the exception of the head dress. The men wear generally a red fez. The bearing of both sexes is very dignified and composed. This peculiar dress and quiet dignity of manner, distinguish them from any other people I have seen in Palestine. The streets of the town, while narrow and crooked, are much cleaner and sweeter than those of Jerusalem. \n\nBeside agriculture, a lot of work of a religious character is done here, the making of medallions, crucifixes, etc. Rosarys \nare\n and neck chains are made of Olive stones, cherry stones, mother of Pearl, Dead Sea fruit and Fruit of the Jordan. Most awful cadgers.\n","35":" Still in Bethlehem. We were to move to-day but orders were cancelled, owing to the Jordan running a banker, owing to the recent heavy rains, and being therefore impassable. Our next move will be across this historical river. The day has been a beautifully fine one, though slightly cold. A glorious\n\n rides in a cloudless sky tonight.\n","36":" On the 20th we moved out of Bethlehem at about 6.30 P.M. The night was a beautiful one, with the moon half at the full. Our progress was exceedingly slow, although travelling on the excellent main road from B. to Jerusalem. As we entered the City, the Valley of Hinnom lay in shadow, the \nold\n massive walls of the citadel looking very imposing in the moonlight. The old way so familiar to us now, round by the Damascus, New and Herod’s Gate, and down by the Garden of Gethsemane.\n\nThe Rock of Stephen’s Martyrdom showed up white and ghostly in the silvery light, the gilded domes of the Russian Church of St. Magdalene reflected, but the shadow of the city fell over the Valley of Jehosaphat hiding the outlines of Absalom’s tomb in the gloom. Deep shade lay too in the Sacred Garden on our left but over the Great Dome of Omar and the Holy City the moonlight lingered with a transfiguring touch. Our journey that night took us to the foot of the hill, where we arrived at about 3 A.M., on which is situated the Inn of the Good Samaritan, already mentioned. \n\nOur watering of the horses next morning from here was one of the worst experiences I have had in that line, I think. Just above the Camp we descended into the Wadi and followed its bed right till it junctioned with the Wadi Farar, which later on becomes the Wadi Kelt emptying into the Jordan. The sides of the Wadi are shut in with giant limestone rocks for the most part. Occasionally the precipitous sides fell away to a sharply sloping hill, clad with beautiful grass and flowers. When we reached our watering place, after a four or five mile ride, a beautiful sight met our eyes. As we turned in under the half filled up arch of a giant construction dating from Roman times, and completely bridging the Wadi, in front of us lay a beautiful stream, rushing in limpid coolness down its rocky bed. Perched on the banks of the Wadi was a large house and from underneath it the water flowed to fall in sparkling cascades to form the main stream beneath. The Wadi bed has palms, figs, olives, growing luxuriantly, the banks\n\nof the stream lined lined with bamboos. After the country we had passed through to get there, the contrast made it seem too good to be true, and one could half imagine it was once more tricked by his old acquaintance, the mirage. It was gloriously real however, and our horses who had been about 18 hrs. without water, appreciated it to the full. They had hurried us away without breakfast, so we too were ready for our dinner when we got home.\n\nThat night the","37":" we moved again, at about 6.30 P.M. In about an hour we had commenced that seemingly interminable descent, by the wonderful old Roman Road, into the Valley of the Jordan. We camped that night just at the entrance to the valley of the Jordan reaching there at about 10.30. Though moonlight, it was difficult to distinguish anything among the hills around. When morning dawned, however, we found that we were camped about a mile away from the base of Nevi Mousa (the Mount of Moses), with his so called tomb held in great veneration by the Mussulmans at its foot. \n\nThe Arabic Legend in connection with this place says that Moses 120 yrs. of age, and not yet weary of life, journeyed from the east of the Jordan to the west of the Dead Sea, and there he was lulled to sleep by the angels, and placed in a tomb, which was white without and black within. Every year in April on a Friday great processions are organized to this spot, and for eight days the Mussulmans engage in devotional exercises there. \n\nI had an opportunity, later in the day, to get into the building itself, and see the Tomb. The place is large, and substantially built with a Mosque in the centre, round the walls of which are numerous inscriptions from the Koran. Round the mosque itself, in both stories are small rooms evidently used for the accomodation of the numerous pilgrims. A narrow balcony, with low stone arches surrounds the whole building. \nUnder\n There are about 30 or 40 cupolas surmounting the edifice, all painted white and a central dome bearing\n\nthe Turkish emblem. Under this dome in a room about 12 by 14, with its four windows and door strongly guarded with iron bars stands the Tomb itself. It is draped in some kind of canvas material, the ends gable shaped, surmounted by brass spikes. About 10 or 12 rather fine lamps hang around the Tomb, and on the floor it is encircled with a carpet.\n\nThe door was securely fastened with a huge lock. Over the doorway hangs a framed inscription in Arabic, taking the form of a salutation. The whole place presents quite an imposing appearance, when viewed against the dark background of Nevi Mousa, with the sunlight glittering on the white cupolas. This mountain was that on which we saw the attack by the British troops on the","38":"\n\nThe stones around here are strongly impregnated with oil. When broken the smell is very strong. It is said the Arabs use them for feeding their camp fires. The temperature has altered wonderfully. A couple of days ago we were shivering, wet and cold in Bethlehem, and now almost into the Valley of the Jordan, \nwe are\n about 1000 feet below sea level, we are perspiring profusely, and dust abounds. We are not grousing, however, most of us are prepared to sweat, and swallow dust till further orders, so long as the weather is fine.\n\nThe Engineers are busy trying to get pontoon bridges across the Jordan, and Jacko’s shells can be seen lobbing all round its vicinity all day long. He has made more than one direct hit, destroying the work done.\n\nOn the","39":" in the morning we moved down into the Valley of the Jordan. Immense dandelions line the roadway right into the Valley, and the hills on either side rise precipitously, completely closing in the road. Looking across the Valley, the hills on the other side look quite close, though about 14 miles away. The Dead Sea, stretching away to the south on our right, its waters limpid and clear in the sunlight between its barren limestone banks, seems just at hand though 4 miles away. Distances are very deceptive in this clear air.\n\nJericho, amid its trees, stretches away on our left overhung by the rugged sides of the Mount of Temptation. Beth-Hogla lies right in front, palms and cypress showing among the houses. On first entering the valley, there is an abundance of green grass, which the horses crop eagerly. As we proceed however towards the Dead Sea, this becomes scarcer, until the only growth is a bush not unlike the Australian Salt bush.\n\nWe get the order to halt, when the Greek Convent of Calamoun is about a mile away in between us and the Dead Sea with Beth Hogla about the same distance. Once very luxuriant plantations here, now little. This convent dates from time immemorial, being restored in the eleventh century. It is being used for various purposes at present by the Military.\n\nThe Turks seem to be using a great number of machine guns to defend their positions across the Jordan. A batch of prisoners went by this morning with one of these guns, and later another batch of seven men and an Officer, with no less than three with them. The Infantry had a bad time after crossing the pontoon bridge, having to advance across some open country in the face of an intense fire. The New Zealanders too have been doing good work. One of our fellows was telling us how two N.Z’s killed 17 Turks on the road and captured 3 on their own. We moved that night about 7.30 down through Beth Hogla, following the winding road that descends right to the banks of the Jordan. On the flat ground piles of drift wood are heaped among the bushes, and the low \nhills of\n clayey hills have a most curious formation. They have a projecting cap surmounting them, as though the flood waters had nearly submerged them entirely, washing the lower soil away in its progress but it seems incredible that the waters could reach such a height, though their appearance suggests it strongly.\n\nDown on the banks of the Jordan the bushes are very dense. Trees of some kind are numerous. What they are I could not say, owing to the dim light. On ahead we could hear the transport making a terrific noise passing over the pontoon bridge. Each waggon had to wait of course until the one\n\nin front was across, so it was a series of 20 yd. advances until our turn came. In the dim light among the foliage the Jordan looked very pretty, as we rattled over, the trees and undergrowth lining its bank dipping to the rapidly flowing stream. We had not much time to spend looking at it, however, as once across on to the low banks of the other side, we were quickly in trouble. The ground here is like a quagmire. Branches and bush had been laid down to form a road, but even then it was a difficult pull with six horses. After getting across the flat we climbed an exceedingly steep hill, the position the Turks had occupied earlier, when they cut the \nadvance\n Infantry up with machine gun fire as they advanced across the pontoon and over the flat.\n\nWe went round a long winding spur of the hill and finally descended into the valley again, at about 2.30 A.M. on the morning of the","40":" Our Camp is about 8 or 10 miles from Jericho now, and Jerusalem can be seen away in the distance as one looks between Beth Hogla and Jericho. Gilgal, the place where the Ark of the Covenant was built, must be in between us and Beth Hogla, I should think.\n\nToday, the","41":" we are having some more wet weather, but minus the cold we experienced in the mountains. Johnny is retreating all the while. Yesterday he was in the hills quite close at hand. To-day he is miles away. The Second and Third regiments have gone out following him up, and it is expected that Es Salt will fall today. \n\nIn this place typhus is raging, both among the Turks and the civilian population. As many as 3000 cases are reported, and the deaths run from 30 to 100 daily. \n\nFour of our sandcarts have gone with the Regiments, but whether we (the heavy transport) will move is as yet undecided. The Y.M.C.A. car was along yesterday and distributed some comforts among the Brigades which were very acceptable. Amongst them were some copies of the Palestine News, a paper issued by the Egyptian Expeditionary Forces. The Hotel Fast in Jerusalem has an advertisement on the front page that took my fancy. \"Hotel Fast, Jerusalem. Visitors will greatly oblige the management by bringing their own rations with them. Hot baths, clean beds, arm chairs\".\n","42":" We have been camped here now much longer than we at first expected, and at last after several false alarms, we are to move on this afternoon. Just the precise spot we are going to is unknown, I fancy. The orders are \"as far up as we can get\". Our horses have been having some excellent grazing while here. Down on the banks of the Jordan there is prairie grass, fox tail, wild barley and oats up to one’s knees and more, and haven’t the poor half starved nags revelled in it? Besides we have been pulling bagfuls of it for night feeds. It is exceedingly pretty down by the banks. Graceful willows and tamarisk trees line the banks, luxuriant undergrowth is everywhere, and the air is filled with the twittering of innumerable birds. Every now and then partridges emerge from cover with a whirr. Two mornings ago I walked down to see the river in daylight and performed the time honoured custom of washing in the Jordan. The waters are very muddy at present, but good drinking.\n\nJust now the river is rising rapidly. Wadis where we walked dry-shod on our first visit, are now immense sheets of water, backwaters to the river. This is the water coming down from great Hermon and the mountains thereabouts. We can take no patients across at present. They have been extending the pontoon for a couple of days now, but the spread of the river is quicker.\n\nWe had a surprise early this morning. Just after sunrise a fleet of planes appeared, coming from the direction of the Turkish lines. \"Hullo\", said someone \"our planes have been out early this morning\". Next moment the \"Archies\" opened up and \"our planes\" which were really eleven Taubes, commenced dropping bombs.\n\nTheir aim was exceedingly bad, and they only dropped about a dozen bombs all told. Hundreds of horses and camels were grouped on the flats under them, but they evidently had \"the wind up\" to too great an\n\nextent to come down low, and all they got was two camels, one killed, and one wounded, and one ‘nigger’ got a piece in the foot.\n\nOne of them had an exceedingly bad shot for us. It dropped about fifty yards away. It made a decent hole, which in ten seconds was surrounded by fellows looking for souvenirs. All together, it was absolutely the poorest exhibition of bombing that could have been put up. The field was absolutely clear, none of our planes cruising around, the \"Archies\" could not have got them had they flown low, and with machine gun and bombs they could have done tremendous damage. Luckily for us all, however, \"Johnny\" in his fiasco was apparently far more scared than we were on the ground under him. \n\nWord has just come in that we are not moving after all. We stay where we are. Well there could be worse places. Plenty of water handy, \nand\n green feed for the horses, and good warm days. What more could one want, nothing much, except \"go forward\". We were sitting around the festive board, which in this case was a bag spread on the ground, yesterday evening, regaling ourselves with such delicacies as biscuits and cheese, jam or bully, according to taste. Some of us had finished and were discussing an after-meal cigarette, others were not yet in that state in which etiquette demands one should leave the table. Suddenly \"Archie\" barked and all eyes turned automatically to search the sky. And there they came out of the north west, one, two, three, four, five, six, seven, eight, nine, nine Taubes. Then somebody uttered an exclamation, \"Gee-whizz, look on the left\", and there were six more, fifteen Taubes, sailing out of the grey sky like big dragon flies, with semi-transparent wings. \"I say\" said another, \"there are some beautiful wild flowers in this Wadi over here, whose coming to look for them\". The response was quite encouraging. I was among the number.\n\nThe Archies did splendid work, and put up an excellent barrage, which turned Johnny. He was not game to face it, and it saved the situation for us, as he was steering straight for us. He dropped a bomb or two fairly close, then sheered off in formation towards the East. He curled round among the hills there, and dropped a number of bombs. We could not make out at the time just what he was after there but word came through at night that he had bombed the N.Z. Clearing Station, scoring 35 casualties, and killing 11 camels. With 15 Taubes up, he is not one half as game as one of our machines on his own. One of our fighting planes was up, and hovered about till he got one of them away from the others a little, and tackled him. The Taube fled, following the others who, after displaying their coolness and daring by bombing an undefended Hospital containing wounded men, had disappeared. This morning there were three or four of our planes cruising about from quite an early hour, and not a Taube showed himself.\n\nAt about 10-30 this morning (Good Friday) we moved, about 6 miles, and are now camped in a verdant \nfertile\n Wadi fairly close to Jacko’s lines. The Jordan Valley here is very fertile. Beautiful grass intermingled with flowers of every shade and kind, makes a picture of the rolling plain above which we are camped. The curiously formed hills on the other bank of the Jordan form a fantastic foreground to the dark rugged ranges where the guns are playing. It is intensely hot.\n","43":" A heavy mist came down and enveloped the hills yesterday evening, blotting out everything but the plain of the Jordan. Heavy fighting was in progress until after dark. Jacko sent a few chance shells over just before nightfall. If he had swung his gun a fraction to his left, he would have made it very uncomfortable for us. As it was they harmed nobody. It was very curious to watch them. One would\n\nsee the burst of the shell on the plain beneath, then quite eight or ten seconds after, would hear the report of the gun, then the whistle of the shell, and finally the explosion.\n\nA few of the Royal Welsh Fusiliers came in last night as a result of one of his shots. One poor fellow was terribly shattered. Hardly a portion of him escaped injury. The Welsh Padre and a burial party came over this morning and buried him on a grassy slope just near our Camp. \"Blessed are the dead\" the Padre said \"for they rest from their labours\". Rest from the turmoil of war, in this quiet green valley, with the pale blue everlastings and innumerable wild flowers bending their tender stalks over his grave. So, another \nof the many\n hero sleeps, and when the death-song of the big guns rolls on further, no grave could be quieter or more peaceful.\n\nTo-day, Easter Sunday, the fighting still continues. The Turks are holding on tenaciously to the line of hills in front, and so far has showed no disposition to move. The individual Turk is game enough, too. The night before last, a Sergeant of ours was brought in, shot by a sniper. He said he was crawling up to get a shot when he sighted a big Turk on the hill above him, fairly close. He took aim and fired. The Turk only stood up in full view and signalled a \"wash out\", that is no hit. Then, as the Sergeant raised himself a little for another shot, Johnny fired. The bullet went through the Sergeant’s hand, and into his leg. Twice after that the Turkish sniper fired, one bullet grazing one man’s neck, and the other his right temple.\n","44":" Exciting events!\n\nJust before midnight on the 1st April, we left our Camp in the Wadi across the Jordan and returned to our first camp over the river, where we were bombed on the 28th. Only our limber and the unmounted personnel with the Camels moved then, the others were to follow the next day.\n\nWe reached camp between 1 A.M. & 2 A.M. on the morning of the","45":" and turned in. We were looking forward to sleeping a little later than usual, but the Turk decided otherwise. Twelve planes came over very early, and though only three bombs were dropped\n\nin our vicinity, two of the planes put in some very nasty work with their machine guns, swooping down unpleasantly low to do so. There was a rather hasty rush from the blankets to the limber, which having a good load on, afforded pretty good protection from bombs or bullets. I did not hear of any casualties, either among men or animals. At about 2 P.M. we moved camp again, this time to cross the Jordan. All our men are withdrawing from the eastern side of the river. By the time we got to the pontoon there was a tremendous crowd of camel and wheeled transport of every kind already across, and a great crowd waiting to go over. We were not long in starting across. Owing to the recent floods the approaches to the river had become so boggy that the pontoon had to be across the flat as well as the river itself. This made a long trip on the boards, and the mules and the leader I was riding became rather scared.\n\nA frightened horse can, with care and trouble be managed, but a frightened mule is the very Devil himself. We just went down the incline to the river itself, when the pole driver shouted \"Whoa\", and we stopped. The limber was very close to the edge. We got it straightened up, and started again, and then the fiend that is in every mule asserted himself. A quarter of the way across the stream they commenced backing and prancing, and next moment there was a startled yell from the pole-driver, who was seated on the load, and the limber was over the side. The middle driver and I were off our mounts not a moment too soon.\n\nThe poor brute I was riding, scenting danger, and perhaps too feeling security in being with me, turned on the narrow bridge and followed me, but only for a moment, and then the whole team of six were struggling, harnessed, in the water.\n\nAs we ran back the pontoon tipped perilously on the side the limber went over, and then broke. With a change of the pronoun, Macaulay’s description of the plight of Herminius and Spurius Lartius on the bridge before Rome, suited us exactly. \"And as\n\n\"as we passed, beneath our feet, we felt the timbers crack\". About 12 or 15 feet of the pontoon broke away. Then the force of the current carried the poor struggling team underneath the bridge.\n\nIt was most pitiful to see the desperate struggle for life they made. The one I was riding, a big horse just on 17 hands high, must, I think, have broken his leg, for poor old \"Baby\" as he was called was only seen once. My other leader \"Ludd\" made the gamest struggle I have ever seen. He was too far down the stream to be able to reach him to cut his harness, and twice I thought he was giving up the struggle. I must confess I felt a big lump rise in my throat as I watched him. He stretched his head out along the water and lay still, sinking gradually. Then a mule rose alongside of him, and got clear of its harness, and perhaps encouraged a little, poor Ludd made another desperate effort, and struck clear of his harness. In a few moments willing hands had hold of him at the bank, and thoroughly exhausted he was hauled ashore. The mules too made an exceedingly game fight. Out of the team of six, one mule and one horse was lost.\n\nI am as free from possessions now as it is possible to be. Clothes, blankets, rations, all lie at the bottom of the Jordan. Fortunately, a short time ago, I got an old gas mask haversack, and decided to carry my diary in it and always on me, so I have saved that, but all my photos nearly two years collection are gone, together with curios. However, we were all extremely thankful to escape with our lives. Fortunately, the mules decided to go over on the off side, which gave us a chance. If they had come over on the near, we would undoubtedly have been into the river, and under the struggling horses at that.\n\nThis morning twelve enemy planes came over again, and bombed us, but did no damage. But they are trying to the nerves, even though they do miss \nwith\n their bombs, because one never knows when they \nwill\n score a hit, and there is always a sporting change of the score being very much against you.\n\nAs to this retreat across the Jordan, whether it is strategical and a trap for Johnny, or whether we \nhad\n to leave, I of course am unable to say. It was pitiful to see the strings of refugees from Es Salt. The N.Z’s and 2nd Brigade had occupied this place, and blown a bridge and some roads near. The people there are all armed to the teeth, and rejoiced exceedingly when our people appeared. They fought with our fellows, against the Turks, \nand\n especially joining with great eagerness any sniping parties. When we evacuated the place, they turned rather nasty, and things looked black for a while. Doubtless they felt, and justly, that they had been sucked in. They had taken our part against the Turk and now the Turk was coming back. So there was nothing left but to come with us. And so they came, women and children, aged and sick, carrying all they could of their poor household goods, with the Turks following close on them, these poor wretches fought their weary way to the safety of the western banks of the Jordan.\n\nOn the 3rd we went twice across the Jordan. About 11-30 AM. we moved our camp to the other side, and by 7-30 PM. we were back again. A few shells came rather unpleasantly close, and so someone deemed it advisable for the Ambulance to move back, so back we went. We are making excellent progress. \n\nOn the 2nd we left the eastern bank, and came to the western, on the","46":" in the morning we went back to the eastern, and at night we returned to the western. These futile trips are merely some of the little pleasantries that the Military Authorities are overflowing with, and, as they are absolutely certain to have a most pulverising effect on enemy hopes and plans, we endure them as silently as we may.\n\nBut the worst was to follow. Our camp on the night of the 3rd was in a beautiful, clean basin formed by the fantastically shaped hills which are so common on this western bank. The cover from air raids was excellent, but all the same next morning we had to move into the next Wadi. Why did we move this time? Because\n\nCrossed out in sincere respect for Colonel Cavi, Commanding","47":" A.L.H. F.A.\n\nthe Officers discovered in the next Wadi, an old Turkish dugout roofed in, which was large enough in their own words \"for their meals and to play cards in\". So, that their whim might be indulged, every one else was inconvenienced and annoyed, our clean and abandoned, and an area that had been an old Turkish Camel Camp, that is filthy in the extreme, and alive with lice and camel ticks was chosen instead, and there we were dumped down, and here we still are tonight (the 5th). Of course, it is clean where the Officers are camped, so what matter what it is like in our area. One does not like writing these things, he is apt to be dubbed a mal-content and agitator, but these things are nevertheless true, and many other dirty tricks done to man, all unrecorded, are true also.\n\nIt is true that our Officers in this Unit are absolutely the most selfish and self-centred of any Unit on this front. On the Western front the Germans may have officers who show superior skill in annoying men, but it is doubtful. There is a smouldering curse in every man’s heart for them, and, on the morning of our last shift, no Officers were ever cursed more heartily for utter disregard of men’s feelings on so trivial a pretext as they were.\n\nAnd they are incompetent. Perhaps because they are not military men. We are always doing something ridiculous, something stupid. Among the Regiments our popular title is \"The Circus\" and small wonder. But it is a misnomer. A circus is funny but a good one is also clever. We are not clever, only ridiculous. But it is not the men’s fault, and perhaps for some of the things done the Officers are not altogether to blame. An Officer who is a soldier as well should be in charge of an Ambulance, and these men are not soldiers. A Captaincy is too easily attained in the A.M.C. Raw youths just out of University suddenly have \"greatness thrust upon them\" by being made a Captain and it is more than some can bear, and still preserve their original hat measure. For mistakes made in matters that require a soldier’s training to deal with, one can hardly blame them. Medical men are not soldiers (that is the majority of them) for they have not had a soldier’s training.\n\nBut for their petty meannesses and disdainful snobbishnesses they are to blame, these are personal traits of character all their own, which their position gives them the opportunity of exercising, and for these they are disliked and held in contempt.\n\nOn the","48":" our limber was recovered from the bottom of the Jordan. It took a whole day’s work for about a dozen men to get out, but out it came, with all the load intact. I don’t suppose there are many limbers and limber loads \nthat\n in the British Army that have had that experience. I have recovered all my own things, and after drying most of them proved little the worse for their two days immersion. The photos, with one or two exceptions were alright. One or two had the subjects written in indelible ink across the back of them, and this was transferred to other photos but that was all.\n\nThere is a rumour afloat that we are to move in a few days, but nothing definite.\n","49":" Today, I fancy I have a much clever idea of the reason of the retirement of our troops across the Jordan. A very strong position has been built on the Eastern side of the river, with Barbed wire entanglements and systems of trenches; heavily machine-gunned. As was expected, Johnny, becoming confident, has made an attack. He launched it about dawn this morning. It was the signal for a tornado of shell fire from several batteries on this side of the river. Since dawn the deadly missives have been shrieking overhead, on positions long since marked out. Jacko’s losses have, I believe been tremendous. Big guns and little guns have been raking his lines with deadly effect almost without cessation. Wounded men coming in state that Turkish dead are lying in heaps.\n\nNow an artillery barrage is bursting behind his attacking force, and he can not go back, and the machine guns are raking him from the front. While too much reliance cannot be placed on reports coming in from single individuals, as their view and grip of the situation is necessarily limited, there can be no doubt his casualties have been tremendous. His attacking force is somewhere in the region of 3000 and if any of them see Turkey again they will be fortunate. It was a cleverly arranged trap and Johnny has fallen to the bait.\n","50":" Turko’s lie in all positions in front of our entanglements this morning. Most of them are ‘sleeping the long sleep’. Our Ambulance cars went out and brought many others in, wounded. They were very badly mauled, but it takes a lot to kill the average ‘Jacko.’ One, with a bullet through his stomach, was walking round at the Dressing Station in quite a casual way. Another had the most thoroughly \"filled\" eye I have ever seen. He looked as though he had been at the business end of a cyclone, and collected it all in his optic. 180 odd were buried in one grave.\n","51":" We are getting a humid heat wave down in this Valley that takes all the stuffing out of everybody. Scarcely a breeze of any kind stirs the heavy atmosphere, and sand flies and mosquitos by the myriad add to the discomforts. In pursuance of their admirable policy of doing the thick-headed thing in a high-handed way, Military despots have decreed that men shall not wear \"shorts\" out of camp. Riding breeches must be worn. Our watering place is a few hundred yards from our Camp, yet we are not allowed even to go there without being dressed in these accursed, heavy tight-fitting breeches. If a man wants to wear shorts at all \nthrough the day\n, he has to change into riding pants twice a day to go to water. He does it, to the accompaniment of much profanity and curses on the heads of those responsible. When will that tremendous ass, the Military Machine ever acquire the first rudiments of common-sense and decency, or is it pure \"Hunnishness\", a desire to harry and annoy the man who has no remedy against such petty tyranny.\n","52":" In orders this morning the following appeared. \"The order prohibiting the wearing of shorts when riding out of camp is constantly being disregarded by N.C.O.’s and men. To ensure the observance of this order all shorts now in N.C.O.’s and men’s possession will be handed into the Quartermaster today.\"\n\nThat means, of course, that men will be compelled to wear riding breeches \nall\n day now. From the Officers’ point of view, this is immaterial. He has good comfortable quarters, a batman to bring him water, and wait on him generally, and a nice, light summer uniform fresh from his Cairo tailor, so under these circumstances\n\nit is quite \"propah – y’know for the lowah-ordahs\" to be deprived of any little comfort they may possess. Billjim must get his satisfaction and comfort from the indisputable fact that the war will be considerably shortened by these energetic and common-sense methods.\n\n20th The gigantic Military Head\n \n\n20th Infinite wisdom, as embodied in the \nmighty\n lofty intellects of the Military Authorities is still engaged in one of the mightiest conflicts that has ever disturbed the peace and serenity of D.H.Q. in this theatre of the great war. This is no less than a desperate, prolonged, and enervating struggle with the burning question of short wearing by men. The endurance, courage and resource displayed by the Authorities has been commendable in the extreme. There are whispers of several decorations as a result. Seeing the tremendously beneficial and far reaching effects upon our future as a nation, both \nat home and abroad\n as regards our Home and Foreign policies that the settlement of this vital issue in the favour of the authorities will have, it would be an unpardonable offence to posterity if the history of \nit might be interesting to have\n the battle from the beginning was not passed on to them, as far as by personal observation and the discreet questioning of infuriated and profane Billjims, and the listening on parade to the liquid accents of several Orderly Sergeants in the reading of various brilliant efforts in the shape of G.R.O.’s can enable us to do. \n\nIn the first place a midnight meeting of the S.S.S.S. (Secret Society for the Stiffening of Soldiers) was held at 10.40. The C. in C. occupied the Chair and none under the rank of Major were admitted. The meeting opened with the singing of the Hymn of Hate (D.H.Q. issued version). As a result of their deliberations, and a commencement of hostilities, the enemy issued a proclamation, the exact date of which we are not sure (the endlessness of the attack being somewhat confusing) to the effect that all men on leaving camp, must be correctly dressed in riding breeches and leggings, no shorts to be worn. This being the front line where correct dress is an absolute essential to the vigorous prosecution of the war and the comfort of the men only a minor consideration, this order should have evoked no surprise or descent.\n\nJudge of the feelings of the hostile forces then when our side replied with withering salvos of profane sarcasm in which the Hughsonian phrase \"winning the war\" was much in evidence. The enemy, however, being totally devoid of humour, this did not have much effect. Still, we complied with the order, most of us, only wearing our shorts to water. \nwhich\n Watering horse being a fatigue we considered we were entitled to wear a fatigue dress while engaged in the execution of this duty. But the enemy \nhowever\n whose Secret Service is very complete, discovered what we were doing and considerably deconcerted us next morning by an Order prohibiting any man from even riding to water in the banned garments.\n\nBy a desperate effort however, on the same day, to prove how consistent they were, they, through Ordnance, issued our Unit with a number of shorts. In spite of the annihilating effect of the sudden onslaught our forces were rallied, and we brought the enemy’s plans to nought \nby\n while obeying the order, by walking to water and leading our horses, thus clinging to our beloved attire. Intense confusion was observed at enemy H.Q.’s. A.D.C.’s and Orderlies rushed about in wild disorder. Telephones buzzed incessantly, and the C. in C. sat with troubled brow and lips grimly set, while an attendant batman obsequiously applied a towel wrung from iced water, to his lofty brow every quarter of an hour while G.R.O’s literally flew from the typists hands. As a \n\nresult of an all night sitting during which three Majors fainted, and one Lt. Col. and two Col.’s were hastily evacuated to the Clearing Station, suffering from severe mental strain, the following order was issued on the 18th. \"The order prohibiting the wearing of shorts when riding out of Camp is constantly being disregarded by the N.C.O.’s and men. To ensure the observance of this order therefore, all shorts issued to N.C.O.’s and men, and now in their possession, must be handed into the Q.M.’s Store by 4.30 today.\"\n\nIn spite of the undoubted brilliancy of this strategical movement, designed to outflank us and compel an instant surrender, it fell absolutely flat much to the disgust and chagrin of the hostile forces. This was due to the fact that we had no \nissued\n shorts (those mentioned above not being distributed yet) and the ones we wore being bought privately.\n\nThe consternation produced in enemy High Commands by the defeat of the previous order was a tame thing compared to the confused \nproduced\n brought about by this latest discomfiture. With impressive celerity, however, for such a lethargic body they met the situation by a counter-order to the effect that the C. in C. himself would be round the various units on the","53":" and if any man was seen to be wearing the accursed garments in question, the O.C. of such Unit would be court martialled. This \nwas\n would have been exceedingly satisfactory to us, if it had not been that one very important clause was omitted viz., that on no account would the O.C. be allowed to pass the Court Martial on.\n\nToday the","54":" the threat of yesterday was followed up by an order that \"no man was to wear shorts in Camp or out, at any time\" and there the matter stands, and no man knows just how it will end.\n\nBy all the laws of precedent and general Military procedure, it should end in us all being issued with shorts very soon, with a command to wear them sleeping and waking, \nunder\n or be shot at dawn. Meanwhile with the smoke of battle still obscuring the landscape and the thunders of the recent conflict yet reverberating among the hills of the Jordan, I want to state an obscure and unimportant fact. After wearing my first issue of Australian boots for just over two years, I am compelled, with others, to wear in place of new ones, second hand Tommy boots fearfully and wonderfully patched and half soled, which cripple the feet, wear out a pair of socks every second day and possess \"an affluvium\" all their own in comparison to which all the various and combined odours of the East are violets and lavender. \n\nTrue it is only about three months since I put in for my new ones, and vital questions have been occupying the Military intellect of late, so I must not be impatient. This all important short question is very nearly settled to the discomfiture of the troops and the Ration of Red Tape, so why worry about boots? They are things of minor importance.\n","55":" The day before yesterday, on the","56":" April, we got word we were moving at 11-30 PM on a stunt across the Jordan. At eleven the order was given to harness up and hook in, but it was quite 1-30 on the 30th before we moved. A tremendous amount of transport had already gone on ahead, and for a while there was some difficulty with the pontoon bridges. However \nwe were\n finally we got over, crossed the Wadi Nimrin, and proceeded along the banks of the Jordan. We were just across the Wadi, when the fighting began on our right. Machine gun and artillery was very active, and hand grenades were being used unsparingly. This was,I believe the 60th Div. attacking. This would be, roughly, somewhere about 3 AM. One could see the burst of flame and \nthe roar\n hear the roar of our big guns in support, and mark where they struck on the hills. Also, the flash of the Turks artillery in answer could be seen, and high in the sky the spurt of flame from the exploding shrapnel. The morning star yellow and luminous, being just above the horizon, the moon just passed the full, rode serenely in a perfect sky, silvering the plain over which we travelled. Only on earth was their conflict. \n\nWe followed the course of the Jordan for some six or eight miles, but were late getting into our position. All the stars but the morning star had faded, one by one, and the dawn was pink and red in the East before we finally pulled up in a Wadi. We were raising a tremendous dust, and I for one expected a few little attentions from our friend the Turk. We went to the wrong place in the wrong way at first. We have a faculty for doing that and we generally live up to our reputation. An irate Major evidently shared my views for he came up and hastened us into our \"possie\" declaring we would draw fire if we were not quick.\n\nIt was broad daylight when we finally pulled up. I lay down at my horse’s head in my overcoat and had just dropped off into sleep when I was called for a cup of tea. The dust had been fearful and everybody looked very queer in the morning light. Everyone had white eyebrows, \nand\n eyelashes and hair, and when dark eyes looked out from under the dusty eyebrows it had a peculiar appearance.\n\nWe stayed here nearly all day. The Brigade had few casualties. At about 3 o’clock we were on the move again and pulled in alongside the Wadi Nimrin where we now are waiting, I believe, to proceed to Es Salt. Jacko is still holding on to his positions on the Es Salt Road, though I hear the Town fell last night. The Infantry had a very bad time last\n\nnight in their attack here, experiencing some 400 casualties.\n\nIt has been raining a little this morning and is very close and oppressive now. The change in the appearance of the plain on this side of the Jordan is very marked. Last time we were here it was a field of green grass and wild oats and barley. Now it is yellow like a field of ripened grain and quite dry. The hot winds and sun have dried it up. In a week or two there will be nothing but a plain of choking dust.\n\nNight of the","57":" Reports have come in to-day that are not too cheery. The Brigade has been pretty well surrounded, the Ambulance has been captured, and 8 guns. That was the first report, later reports said that 15 drivers and a Major had been captured out of the Ambulance. Both N.Z.’s and Australians went through to their relief at the double this afternoon, and the latest report says they are now holding the Turks.\n","58":" We are still in the same Camp. We will move, I understand at the bidding of a rather capricious Fate which, just now, the combined stubbornness of Turk and German is swaying. They are hanging onto the ridges in front with unusual tenacity. As far as the – is concerned, if reports are true the reinforcements arrived in time to save the Unit, and the guns and limbers are now in No Man’s land. Was there ever a worse weariness than the weariness of doing nothing. Hours are days, and days are weeks, that drag themselves slowly – oh so slowly, by. And they are bad days too. The ground around is churned by the endless heavy traffic into fine white dust, to a solid depth of seven or eight inches, and traffic is always going by, and the dust obscures everything, and hangs in a white haze round the hills. \n\nAt night the wind rises, and the evening meal becomes a fine art, the art lying in preparing and eating it before a solid coating of dust has settled on it. Getting it to one’s mouth \nbefore\n and at the same time preventing a dozen or more too adventurous flies going along with it, requires no small amount of judgement either. And the days are hot, very hot, and the giant whirlwinds many and varied. Yesterday we had three Taubes over, morning and evening, without bombs this time, but swooping daringly low, and belting in with their machine guns. It is marvellous how little damage is done, though\n\nwith all their daring. Last night, he was specially low, and bullets spattered up the dust all around the Ambulance, but not a horse or man was hit. One of the Tommy Regiments had a man hit, and that as far as I know was all. Of course we are all pretty well scattered, which makes his task harder. But he makes, on the whole, a poor display. This evening he was over again, but left the Ambulance in peace.\n","59":" I think I wrote on the third that our movements lay in the hands of the enemy, to a large extent. Last night we moved and came back onto the Western bank of the Jordan once more. Es Salt seems to be a tough proposition. Twice now we have been in possession of it, and twice we have had to evacuate it. Peculiar positions arose in the hills. We had the Turks surrounded, and they had us surrounded. It seemed to resolve itself into a question of who could hold out the longest, and our forces withdrew. Rations are the great trouble apparently. The country is extremely rough and hilly, and impassable for wheeled transport. \n\nA certain Brigadier General affectionately known by rank and file as \"Charlie\" has endeared himself more than ever to his men in this stunt. During the retirement, amid shells from enemy guns, bombs and machine gun fire from hostile planes, \"Charlie\" rode unconcernedly, not at the head of his men, but \nat the rear\n. (In a retirement; of course, the place of greatest danger.) Cheerfully optimistic, apparently unaware of the deadly missiles falling around, this fine old warrior rode, urging, and encouraging everybody. \"Fighting Charlie\" will never be forgotten by Australians.\n\nWe are camped now opposite the Mount of Temptation, and almost in between it and the Dead Sea, whose waters sparkle crystal clear, almost behind us. Reports still differ somewhat as to the F.A. I was speaking to a driver yesterday from the – and he said there were twelve captured, mostly drivers. This morning one of their Sergeants informed us there were eighteen, all told, that were missing.\n","60":" Bomb-proof dugouts are the order of the day now. Brigade orders too. We had an extra early reveille this morning while with machine gun and bombs \"Johnny\" enlivened the dull monotony of our daily round. He got some hits too unfortunately. Hence the \"dug out\" order.\n\nOn the","61":" we left the Valley of the Jordan at about 3-30 PM. All sorts of rumours were flying about, we were going onto the beach at \n\nJaffa, we were going to Ludd, we were going to Rishon, etc., and we were to have three months spell. It was one of the most fearfully hot days we had experienced in the Valley, and amid clouds of choking, blinding dust we made our way across the plain through Jericho. We were to go up the old road into the hills, but by some means or other did not turn off and proceeded along the new. So we had to turn round and go back and after getting to the base of the hills where the old road wound up the mountain, we found out we were to go the new road after all, so then we had once more to go back. \n\nOne becomes quite used to this mode of procedure after a while, and a move seems strange without more or less futility about it. The other day when we came across the Jordan to the Camp we have just vacated, one of the Units had a camp near us. When their Major had his Camp site pointed out to him he said, \"There’s our Camp straight across there, boys. We can go straight across, but perhaps we had better adhere to the grand old traditions of the Army. Suppose we go away out here, round that Wadi, and then turn round and come back again.\" \n\nEven the Major was driven to Sarcasm! We halted at about 9 P.M. just near the junction of the new and old Jericho roads, perhaps a couple of miles from Talaat ed Dumm, in one of the worst sites for a camp I have seen. Today is like a furnace, and the flies are in clustering, tormenting clouds. One thing redeems the place, we have plenty of good water handy for the horses.\n\nOn the","62":" we moved again from Talaat ed Dumm. We were out on the road at 7-15 PM and by 8 PM made a start. This is a wearisome drag on the horses coming up to Jerusalem. Ten minute stops were given in every hour, and by 4-30 or 5 AM we were at our destination. This is on the Hebron Road about three or four miles above Solomon’s Pools. The hillsides are extremely beautiful just now. Their terraces from the Valley at the foot right up to the top are green with beautiful grape vines. To come from the region of the Dead Sea here is to come to Eden. The barley crops by the Pools are wonderful. We are here for a rest, and most of us feel the need of it.\n","63":" Leave at last, after just on two years A.S. and 13 months of that with the Unit. I got special leave on duty, to Port Said and Cairo. Two of us made the trip. We went by Ambulance car as far as\n\nJerusalem, where we were to entrain. It was a delightfully cool morning, and the most heavenly sensation I have experienced for a long time, was to whisk along smoothly, with the breeze fanning one’s face, and to realise that stables, fatigues, dust, and everything else that one grows to loathe almost, by reason of their continuity and monotony, were all left behind for a few blessed days. Bethlehem and Bet Djallah, were pictures of serene beauty as we whirled through, dainty pictures of wonderful and varied greens, \nand\n grey stone, and white houses. \n\nI am glad I have seen Bethlehem in the Spring. My last experience of it was full of wretchedness on account of the rain and bitter cold. But now the skies are blue and smiling, the breezes are just deliciously cool and invigorating, and the barrenness of the surrounding country has been transformed by the magician spring into a wealth of rich verdure.\n\nAt 1-30, or as the Military time has it 1330, we moved out of Jerusalem, to commence one of the most wonderful and beautiful train journeys I have had. Alas, while beautiful, it was far from comfortable. We had our usual mode of open truck to travel in, only that it lacked a covering of any sort. To make up, perhaps for the lack of cover, the floor was several inches deep in loose \"tivn\". Of course, when we moved, the \"tivn\" moved too, and made things quite lively all along the way.\n\nDirectly after leaving Jerusalem we commenced, what I can call nothing else than a clean \"nose-dive\" down to the plains. The scenery is rugged and beautiful in the extreme. The hillsides are perfectly terraced, and from the narrow platform on the sides of the gorge where the train clings and dives down, down unceasingly, one appears to be looking up at a most gigantic staircase, carpeted with glowing greens of the richest and tenderest hue. Some beautiful old villages nestle on the sides of the mountains, at intervals surrounded by the most luxurious foliage. And always we dived down, and down, always chasing the engine round corners when it had disappeared, only to find when our truck reached that bend it had disappeared again around another.\n\nThen we reached a tiny hamlet, where a novelist would say the air was \"filled with a drowsy quiet\". Indeed, so quiet was it, such a \"Sleepy Hollow\" indeed, that it put the engine driver, the fireman, and the engine itself into a state of coma for nearly two hours. After about an hour, another engine hove into sight, and\n\nours woke up sufficiently to raise a whistle, but as the other engine then immediately slid silently back again down the hill, ours relapsed into slumber again.\n\nIt turned out it was not the quietness of the place affecting it at all, but a breakdown on the line below us. However, after a couple of hours, all was clear and away we went again, this time at an increased pace to try and catch the old enemy, Time. Rocking, swaying and rattling round breakneck bends, we roared still down and down. And the great hills closed in even closer. On our right lay the Wadi bed, many feet below, and rising from it precipitous rocky mountains. On our left, in places the great hills towered above us, sometimes rising sheer from the line in rugged rock formation. And now, also, we had done with the cultivated areas, but the mountains were \ngreen with the\n bright grasses and the glossy greens of evergreen oaks, while wild hollyhocks in glorious profusion spangled the green with colour.\n\nAnd still the enclosing hills grew wilder and more rugged, the bends sharper, and the descent steeper. Looking ahead, the line always appeared to end in a \"cul de sac\" and one wondered which way we turned next. And then, with a suddenness that was astounding, the hills on either side opened out, and with a rush and a roar we were out onto the great plain of Esdraelon, covered as far as the eye could see with fields of waving barley, growing golden towards harvest.\n\nAnd so for many miles we rode thus, the crimson of the setting sun dying to a richer hue the great ripening barley fields, and tinting too, the great fruit orchards and gardens with its ruddy fires. A rich land this, a land in this part indeed fulfilling the Old Testament description, \"flowing with milk and honey\". A land, too, across which, so peaceful and serene it looked, it seemed impossible that war should have so lately stept. And yet it had, and under the green of the trees, and growing grasses and wild flowers, Death himself held sway, and his Kingship was acknowledged in the many quiet graves with white crosses which we passed. And the setting sun gilded these too, touching them with a tender glory, as though in blessing.\n\nAnd so darkness fell, and one by one, the stars lit their lamps, and then the moon rose, and by and bye we rattled into Ludd. Here we had to change trains, and wait about three hours for our train. We went and had tea, and returned to the platform\n\nto wait. We received a great deal of comfort here from the sight of the Officers Special train, with its comfortable well lighted carriages, \ncarriages\n and luxurious sleeping berths. We thought of the hard boards of the open truck and the dust, and a glow of thankfulness suffused our hearts because we knew our dear, hard working, self-sacrificing Officers, very much against their wills, were to travel in comfort and luxury, even though there \nwas\n a cruel war on.\n\nWe remembered all the weary hours we had to spend in these same trucks, getting through how and when we could, and missing our midday train to Port Said, and again we rejoiced, because we knew the Officers would get through to time, for their train is like Time himself, it stops or stays for no man, not even if it be wounded men in a Hospital Train. The luxurious train bearing the pampered snobocracy of the British Army goes straight through, despite supplies, and troops, and even sick and wounded themselves.\n\nWhen we had the Clearing Station at 295, there was a wash away somewhere about the Wadi Ghuzzie, and for five days we could not get a Hospital train, and we had hundreds of sick men and many wounded, but the Officers special train ran every day, but they would not allow any sick or wounded to go on it, so in a Clearing Station, without proper conveniences for treating them, they had to stay, but:- \nThe Officers went through.\n What an Autocratic display we make of our Democracy!\n\nOn the","64":" at midnight we arrived in Port Said, putting in next day there, and going on to Cairo on the","65":" The Delta. It is not my purpose to say anything much about either of these places. So much excellent stuff has been written of them, by those more competent to describe them than I, that it \nwould\n is is scarcely necessary, to put it mildly, for me to write anything.\n\nSuffice it to say that, as far as Cairo was concerned, I had a stay there of 30 days owing to dental troubles, and saw in that time most of the places visited by the average tourist. Such as the Pyramids, where we did the usual inspection of the interior penetrating to the Kings and Queens Chamber at Ghezireh, in the former of \n\nwhich we sent the echoes rolling around the ancient Chamber and passages with a verse of \"Tipperary\". I did the outside, half way to the top, but having boots and leggings on, found it too wearisome. The Barrage Sukharah, the Zoo, Ghezireh Gardens, Esbekiah, Heliopolis, etc., I found my way to and that most interesting of places Mouski, the bazaar of Cairo, where scents and spices are made, and silks are spun and woven by hand into scarves, and brass is beaten into curious shapes, and engraved by workers in the open street.\n\nI must not forget too to mention the Citadel and the Mosque of Mohamed Aly, that marvellous alabaster wonder, with its 3,000 lights and exquisite carpets, and glorious windows, with fingers of softly shaded lights filtering through. Passing through the \"Wishing Arch\" surmounted by its scroll in Arabic \"God is gracious\", the guide said to me quite suddenly, \"Now wish for something as you pass through\". I could only think of one thing, but it was surely a good wish. I wished that sanity would return to the peoples of the world, that the monstrous growths of bitter hatred and savage blood lust might wither and die and peace might spread her gentle wings over the world once more. I did not of course express my wish even to my own heart in those words, but that is what it implied, I wished the war would end. May Allah indeed \"be gracious\" and hear my humble wish, and that quickly – Amen.\n\nCairo, however, is not the best place in the world to spend a holiday in at this time of the year. The heat is intense. The great thing that strikes one, that persists in thrusting itself on one’s notice is the continual warning, \"This place is out of bounds to N.C.O.’s and men\". It angers one, in spite of himself, and fills him with a supreme disgust. An attempt\n\nwas made to put Groppi’s Tea Rooms out of bounds to troops but the proprietor took a firm stand on the question, declaring that he would close it to the Military altogether if soldiers were excluded. Why should these attempts be made to close every decent place to Soldiers and keep them exclusively for men who happen to wear a star or two on their shoulders.\n\nThere is no phrase more misleading from my experience than the one \"Officers and gentlemen\". There are cases of course where the two terms are synonymous, but there are many, many others whom no amount of shoulder jewellery will ever change into the faintest semblance of gentlemen. Yet a private who in education, wealth, and social position in private life is in every way his superior, cannot dine or drink in the same building. It would spell loss of prestige and dignity to the Army. In many cases the only loss of dignity would be on the Soldier’s side.\n\nIn fairness, it is only right to say that there are also many Officers to whom this snobbish procedure is as distasteful as it is aggravating to the private, and then, again, there have been, and there are men who, by their foolishness and lack of decency, have largely brought these restrictions, not on themselves alone, but what is worse, on all their comrades. But to \nany\n decent men, and that means the great majority, the isolation is an insult thinly veiled under the pretence of the necessity of maintaining Military discipline. \n\nOn the","66":" I left Cairo, arrived in Jerusalem on the","67":" and spent that night and the next at the Desert Corps detail Camp, before I could get on a motor lorry to proceed to the Valley. In Jerusalem at present the climate is glorious, warm, sunny days and cool, almost chilly nights and mornings. From the moment we came down off the Mount of Olives the heat gradually increased, until, on arrival\n\nin the Valley, it was at furnace heat. Snakes abound here now, mostly a small greyish species, with dark wavy bands round the body, and an ugly, dark, flat head. Though only growing to a length of 13 or 15 inches, this snake is extremely dangerous, and as its size and color make it almost invisible in this chalky soil, it is a nasty specimen. \n\nBig black and red scorpions abound, evil looking things with a most painful bite. Also tremendous spiders with a double set of pincers in the front that work with a rotary motion. He is the avowed enemy of the Scorpion, and a fight between them is a wonderful exhibition of the way nature prepares her creatures for the battle of life.\n\nIf the Scorpion gets his deadly sting into the soft body of the Spider, it is a funeral service for the latter. But the first thing he does is to make a lightning dart for the tail of his enemy, and with his powerful nippers severs it from the body. The rest is easy, and in a short time he turns the Scorpion over, and makes a delicate meal out of the soft flesh under the shell of the body. \n\nIt is hard to realise that once in the history of the world this plain was a fertile place \nindecipherable of Kings\n delectable in the eyes of Kings, considered by Anthony to have been a worthy gift for that Royal spendthrift, Cleopatra. Now it is the picture of desolation. Gone are the groves of palm and other trees, gone is the irrigation system, and the palatial residences. Jericho itself is a miserable, filthy Arab village, equal in squalor to the worst of Palestine’s \nArab\n native towns. Chalk-colored hills, long ago burnt bare of their last vestige of vegetation enclose the vast plain and spring up in the plain itself at irregular intervals. These hills are torn and fissured by the rainfall (lasting about 3 months) of countless centuries, and are weird and fantastic in their shapes. Brown outcroppings of rugged rock occur everywhere. Deep Wadi’s crossing and recrossing each other, traverse the whole of the plain. The air is as the breath of a furnace, and dust hangs everywhere in grey choking, blinding clouds. Yesterday it was 25° Farenheit in the tents, and it\n\nis not midsummer yet by a long way.\n","68":"\n\nLeft the Ambulance to go as Detail to Machine Gun Squadron.\n","69":" Johnny launched a heavy attack on our lines just before dawn this morning. It was really a German attack, not a Turk. Rumours have been going round for some considerable time that Johnny and Fritz have been fighting among themselves of late. There seems to be some truth in it. When the German shock troops attacked, they made excellent progress and for a while the situation was critical but the Turks failed to rise to the occasion. Instead they refused to fight, and opened fire on the Germans from behind. \n\nWhen the Germans surrended, Jacko came up in a body of about 500 and did likewise. They said, and the Germans admitted it, that they (the Turks) had been kept two days without water in order to make them fight for the Wadi Orjan which we hold. This savage treatment had quite an opposite effect, and they refused to fight at all. When the Turkish prisoners reached the Wadi, they literally threw themselves into the water burying their faces in it, and gulping it down in great draughts.\n\nThe slaughter of the Germans caught by our Artillery at close range was heavy. Over 120 passed wounded through the F.A. to-day. The dead are estimated at about 200, and there are 300 German prisoners. Well over 500 Turkish prisoners have been brought in. Our casualties have been very light, amounting in the Anzac Division to, I believe, 20 killed, 47 wounded and 6 missing. The German objective was (I have heard) first the Wadi Orjan, and then Jericho. The result must have been a terrible disappointment.\n","70":" To-day Johnny has been shelling the Regiments and the road to Wabir very heavily. In the afternoon\n\nwhich\n Jerusalem in one stage, where we fed up and had tea, moving on again at about 9 P.M. and travelling as far as Khunet el Enab, which we reached at about 1 A.M. this morning.\n","71":" Moved on again from Enab last night at 7-30, and travelled to Latroun, or to be correct opposite the village of Deir Eyoub, reaching there about 10-30 P.M. on the","72":" Moving along the mountain top between Enab and Soris was very pleasant. Dimly in the distance one could see the great plain stretching out to the Sea, and wonderfully cool was the breeze as it came in from the ocean. The view from there on a clear day is wonderful.\n\nFrom there we descended continuously, with the hills gradually closing in on the road in the descent, till the long dusty column at last wriggled its way through the narrow defile past the ancient inn Bab el Ouad, and crept out onto the open country, the Deir Eyoub.\n","73":" At 6-30 we left Deir Eyoub for the longest stage of our journey. After climbing the hill and passing through the village of El Koubab, we left the main road. The night was close and absolutely still. The dust hung in heavy clouds as we journeyed. At about 3 A.M. on the","74":" (to-day) we finished our journey at the Wadi Heinan about five or six miles from Rishon le Zion. This is a very beautiful place, orange orchards, heavy with their second crop are everywhere. We are camped just near an orchard and the Jewish owner has very kindly given the boys the use of one of his huge irrigation reservoirs as a swimming bath.\n","75":" with plenty of cheap fruit, a warm climate, an absence of dust, and plenty of water we are in luck’s way. We are, I believe, having a considerable rest here, unless anything unforseen occurs. The pleasure of seeing green orchards, and signs of civilization again is indescribable after the heat, dust and misery in the arid regions of the Jordan Valley. We hope we have said goodbye to the Jordan forever.\n","76":" How vain are all one’s hopes, after all. Here we\n\nare today back in the Jordan Valley once more.\n\nOn the","77":" we left Wadi Hanien for Latroun, on the","78":" left Latroun for Enab, at 3 P.M. on the","79":" left Enab for Talaat Ed Dumm. Reached Jerusalem and camped for the night at about 6 P.M. Just got our saddles off, and billies on the boil, when the order came to saddle up, the Military Governor of Jerusalem would not allow us to camp there. After blessing him, we moved through Jerusalem to the Mount of Olives, reaching there about 8-30. Were on our way again at 3 A.M. the following morning and reached Talaat Ed Dumm at about 7-30 A.M. Stayed there till 4 A.M. on the morning of the","80":" when we moved down into the Valley by the Wadi Quelt. Stayed there till 6 P.M. on the","81":" then moved to our present Camp near to our old one in the Wadi. Everything is very quiet. No shelling so far, and it is rumoured we go back again on the","82":" These interminable journeyings backward and forward!\n","83":" The day of our rumoured departure is about the","84":" or","85":" of this month. I have never, even in our previous experiences here felt anything like the heat that we are enduring at present. Bivvies are no protection. By ten o’clock they are literally a furnace.\n","86":" We moved last night, so once again rumour was proved to be the \"lying jade\" she has the reputation of being. We are camped now in a place in which I have never been before on the side of a hill within about a mile of the Mount of Temptation. There is a fine view. Sitting in my bivvy and looking out as I write these lines I can see a great expanse of the Dead Sea, its waters shimmering dully, through the dust haze which clouds the plain.\n\nDown on the Flat and right in front of me lies Jericho, a patch of verdant green in the surrounding desolation. In the forefront of the town are a few gardens, watered by canals with water from the Wadi Quelt. Right in front, but a little to the right, lie the ruins of Ancient Jericho,\n\nthe city of vanished glory, strange of history and now lying buried beneath the debris of centuries. Round the site of these old relics the children of Israel marched in solemn procession, and it fell to them without any direct act of war on their part.\n\nJust near this site too the magnificent buildings of Herod once revered themselves, and the place was then a garden of fertility. It is hard, looking at it now, to imagine this was the case, and yet, some of the richest land in the world lies here, and I think the day is coming under British control, when the plains around Jericho will be unrivalled in their productivity. On my right is the Mount of Temptation, sacred for all time because it was here the Saviour of the world struggled and conquered in His first recorded battle as a man, with the concentrated energies and skill of Evil, playing for His downfall. \n\nHalf-way up the Mount is the cave where tradition says the greater part of the battle was fought. A most curious and enormous place is built here, half way up the mountain \nsight\n side. It is a Monastry which dates from very early times, and is built sheer on the edge of the precipice, and right along the side of the mountain.\n","87":" Still in the Valley, though we have moved Camp since I wrote last. The Camp is not an improvement on the last, rather the reverse. We are about a mile and a half from water, and owing to being shut in by white hills, the site is hotter. There is a tremendous amount of discontent amongst the troops in this Squadron. From \nearl\n directly after breakfast they are kept going in the tropical sun, and then the watering parade at night is so late, and grooming horses hung out so long afterwards, that it is dark before the men can sit down to their tea, and there are no candles.\n\nIn the middle of the day there is a solid half-hour’s grooming. We are the only Unit doing this. The Regmts. rub their horses’ backs down after midday watering, which no horseman would object to. But the heat is so great that the horses come home from the trip to water in a lather of sweat, and coated with thick dust. Then we turn in, and for half an hour we groom this muddy mixture into their hides, instead\n\nof pursuing the sensible course, and allowing them to dry a little first.\n\nWe have a number of men just returned from Hospital with Malaria, but these men have to stand out in the midday sun grooming for half an hour with the rest. In Egypt where the climate was not nearly as hot, we were forbidden to work in the midday sun. Here, in a place which is reckoned uninhabitable by white men in the summer we are out all day. Nearly every day there is someone going away, and who can wonder. There are hundreds of men being incapacitated by the carelessness and callousness of O.C.’s who lie about in the shade all day themselves, and send their men out on ridiculous pretexts in the sun.\n\nThe men in this squadron have not time to have a bathe, or wash their clothes, they are a mile and a half from water and enough water is not drawn to enable them to do it in Camp. There is no freedom until 8 P.M. and after that, men who are not on picket do not feel inclined to traverse the distance to water on foot.\n\nThree hundred gallons of water are drawn here a day for the use of 180 to 200 men and out of that the Officers, seven in number \ndemand\n at least three 15 gall. fanates of water daily, and have used up to four and a half. The three hundred gallons mentioned includes water for all cooking purposes, water for the farriers, 15 gallons a day, water for dressing horses, and water for medical purposes. So for seven men, there is a consumption of from 6½ to 9 gallons a day per man and for the other couple of hundred barely a gallon apiece for \nall\n purposes, such as those mentioned above. Then there is no fixed time for filling water bottles, and when the midday cart draws in for the purpose the majority of men are on duty, and a few get it, and the great number slip.\n\nI see Mr. McGrath spoke his mind about several things in the House the other day in Australia, and it was sorely needed, but he did not mention a tithe of the injustices soldiers suffer from. There are many of them cannot be named. They are indignities and insults which are difficult of proof, but nevertheless very real and very hurtful. To say you are looked on as a dog, you are spoken to as one might to a cur at his heels, to realise you are expected to feel as a dog, may be difficult to prove, but ask any man who has\n\ngone through it. Patriotism is not helped, but red raggism and deep class hatred gets a mighty leg-up. \n\nPersonally there was nothing I abhorred so much as the class-cry in any shape or form, and all it entailed, but in the Military I do not blame men. They have no redress for injury. It is all very well for Authority to say he has. In theory it is so. In practice it is not. One man makes a complaint, Authority yawns and says, \"An isolated case, everyone is perfectly happy\". A body of men complain, Authority sits up then every separate hair bristling, \"What is this\" it cries, \"But treason and mutiny. These men have been discussing \nUS\n which is plainly conduct prejudicial to good order and military discipline. We must make an example.\" After the war perhaps there may be some enquiry. If there ever is, \nit will show\n there will be such washings of filthy linen in public, as will startle that complacent Dame.\n","88":" Permission was given to the men to go for a wash at the Wadi to-day, provided they \ndid not take their horses\n. The Wadi is about a mile and a quarter, or a mile and a half, away, and the temp. at least 115. Enough said!\n","89":" For days past everyone has been on the tip toe of expectancy. Rumours of big things have been floating round, and made everyone eager. To-night we are all ready. Bivvy’s down, horse feed and our own rations on our saddles, and waiting. Many rumours have come in to-day as to success along the coastal sector.\n","90":" I am writing this among the hills just near Es Salt. We rode up last night, following a deep gorge most of the way. The road is rough in the extreme, winding on narrow paths skirting the edge of the gorge. Dismount for the steep and long winding ascents which mark the path was the order of the night. I was not on the two previous Es Salt stunts, but having seen the road travelled on them, one is amazed at the amazing audacity of the raids, and marvels at their success. If the Turk had been awake the gorges would have been veritable death traps. Now he has gone. Es Salt is clear of him, and all the country surrounding, and there are rumours that he is evacuating Amman as well.\n\nThis offensive has been wonderfully successful. There have been some 16,000 or 18,000 prisoners, Nablous is surrounded, with an army of 25,000 or 30,000 holding it, and our troops are up round Haifa and the Sea of Gallilee, and all Turkish communications are pretty well cut, whether the Hedjaz \n\nrailway is cut yet or not we have not heard, but Johnny is going back just as fast as he can go. He seems to have no desire to fight. On the Jordan a couple of days ago two troops, 60 men at the most, captured 400 Turks. They seem to be just laying down their arms and surrendering, glad, apparently to be out of the fight. They are very miserably clothed, and have a weak emaciated appearance, as though they were half-starved. One lot of about 500 who passed us on the Jordan were indeed famished with thirst and hunger. I have seen stock in drought-time in Australia go mad and rush water, but these Turks were quite as bad. They just fought for a place, and threw themselves into the stream and drank with their faces in it, like beasts. A Divisional Commander and his staff went through on the same day, the 22nd. \n\nWe have had a wearying time in the saddle. We left Wadi Es Sultan at about 8 P.M. on the","91":" reached Wadi Oajah about 11 P.M., were on the way again at 8 A.M. on the","92":" and rode without a halt, except for watering till 2-30 P.M. We were then at the extreme point of the former Turkish position, almost under the shadow of ‘Molly’s pimple’ as the boys call it. We rested there for about 3 hrs. and then rode 8 or 10 miles to an outpost reaching there and getting the guns into position at 12-30.\n\nThe poor horses had no spell even then. They were all linked together which prevents them lying down and saddles were not removed. \"Stand to\" was at 3.30. At five we moved out, went away up the Jordan Valley and drew rations, and then came straight on to here, with only one halt for a feed, a feed on the Jordan early in the morning, on a rotten track, and we reached here at 12-30 A.M. in the morning of the","93":" We move on again \"some time\" today bound for \"somewhere\".\n\n25th We left Es Salt on the","94":" passing through the town on the way to Amman. The road through the town is strewn with the flotsam and jetsam of battle. Dead Turks, some dreadfully mutilated by bombs, and dead mules, camels and horses, with a tremendous litter of broken transport and some guns, lined the way filling the air with an indescribable stench, and bringing home to one with increasing force what an uncivilized, damnable thing modern \"Civilized\" warfare is, and the effect of war on men who can estimate.\n\nLying sprawled and broken in the roadside, having died a horrible death, one sees a Dead human, probably carelessly rolled to the side to avoid being ridden over, and now being covered by the dust of the endless traffic and one has little more than a glance in passing, and certainly no time for pity to bestow on him. When there is time, when men are not too busy making others like him, he will be buried.\n\nWe are now\n Es Salt is a town of, in normal times, some 15,000 people but is practically deserted now. They are a wild, black, fierce\n\nlooking lot too. We are now just a few miles from Ammon, which is to be attacked this afternoon. We are waiting now to go in if necessary. Wonderful to relate, the \nAnzac Mounted\n Brigade are only reserves this time, and everybody is growling about it. They want to be in it.\n\n1st October 1-20 A.M. By a blazing wood fire in the Ammon Wadi, as I do my hour’s picket on the horse lines, I write this. What a wonderful success this push has been. General Allenby’s name is on everyone’s lips. No soldier has words to express his faith in him. To date 61,000 prisoners have been secured. Between Ammon and the Sheriff of Mecca’s troops, east of the Dead Sea, 10,000 Turks have surrendered to 1500 Australians. On the","95":" Ammon was taken, and our Brigade entered that night.\n\nWe could not see much of the town, as we hurried through in the dark, but it appears to be a very fair size, and winds round the bottom and sides of a very deep Wadi. There is a beautiful flow of clear fresh water at one end where we watered our horses, who had gone since the night before without and were most eager to get at it. After watering we made our way to the Station, near which we camped for the night.\n\nThere is a fairly large Turkish Hospital here. An immense amount of abandoned material littered the station and the camping area around it. In a Wadi below our Camp there had been an enemy cavalry camp which was abandoned as it stood, even to the horses already saddled and bridled. At the last minute their owners had boarded the train, which our troops arrived in time to see steaming out of the Station, but just too late to stop. The whole old camping area was a scene of the utmost confusion, and the most indescribable filth. \n\nIn the morning I went up and had a look through the Turkish Hospital. It is awful. Filth and stenches abound. This is not from lack of medical material, for thousands of pounds worth of medical stuff littered the platform. The Hospital is full, not many wounded, but a great crowd of sick. And their plight is indeed pitiable. They are dying, they say, as fast as they can carry them out. I saw many cases, men just dragging themselves painfully about, dying on their feet, hollow-cheeked, and wasted, and their eyes burning with the\n","96":" that consumed them.\n\nThe interior of the Hospital is awful. Everywhere men were huddled together on the filthy floors, mostly the beds were mattresses thrown down, all foul and insanitary with the signs of previous occupancy. Piles of similar evil-smelling beds were stacked in heaps. Tacked right on to the ward and open to it are the latrines. I do not think disinfectants have ever been used here, and the smell is overpowering, and left me feeling sick for hours.\n\nYet here unwashed, unkempt, and burning with fever, \nsuffer\n enduring stoically the pain of wounds, and operations conducted without anaesthetic, suffering the Good God alone knows what, these poor wretches lie, and are carried out to their burial. There were nine sisters in all here, of different races. The doctors were Turkish, though the medical equipment was all German. How these medical men, and nurses live in this place, indifferent, apparently to all the filth, is beyond my comprehension.\n\nRight up to the walls of the hospital, all round, patients have deposited excrement and no attempt was made to dispose of it. I saw some of the patients being fed while there, and the food consisted of dry, unboiled rice. The grain was brought in in trayfuls, and a half-dozen or so men gathered round and eat from it. Others had one tomato, and a small green cucumber.\n\nThe sights along the road from Es Salt to Ammon, and around Ammon itself beggar description, but will never fade from my memory, and must instil into everyone who saw the most deep-rooted horror of war, and all it means. Our Camp near the Station was so filthy that we moved away about half a mile the next morning, stayed there that night, and moved on next morning the","97":" to our present camp about three or four miles from the township.\n","98":" At last the war seems to be drawing somewhere near to a close, with the unconditional surrender of Bulgaria. Things should be made increasingly difficult for Turkey, the question of supplies will be made difficult of solution, and Turkey is left without a valuable ally on the Salonika front. With the complete breaking of her armies in Palestine and the latest successes in Mesopotamia, it should not be long now before she too is ready to give in. When she does, it will leave Austria in a precarious position, and she has enough trouble of her own without that. If Turkey and Austria both go, goodbye to Germany.\n\nEveryone is quite excited over the news, and some \nwho thought\n to whom Australia was \nonly\n a place they had only a dim remembrance of, and a dimmer hope of seeing again, now begin to see a glimmer of hope once more. There\n\nare rumours now of our Brigade stopping back here as Garrison. Everyone feels very disappointed over it. Personally I cannot express my chagrin. I want to see more of Palestine, Damascus, Nazareth, the Sea of Gallillee, dozens of places full of deep interest, and if report is true, we will not have an opportunity.\n","99":" We are still in our Camp at the Wadi Hammam. And we are likely to be here to for some time. Malaria has been very busy with the Brigade, and hundreds of men are going away sick. In six days, from the","100":" to the","101":" of this month, this squadron lost over 80 men and four Officers, so that with the Ambulance working top speed all the time, it has been a tremendous job to cope with evacuations, so we cannot move now until reinforcements come, and things settle down a bit.\n\nThe Camp is pleasant enough, in one way. We are beside a beautiful stream, which is lined with a flowering shrub with blossoms similar to an Oleander tree, with the same heavy scent. But there are millions of fleas. I never felt so many before, but thank God there are no lice, as yet.\n","102":" Last night the news came through that the German papers announced that Germany had accepted President Wilson’s peace terms. Strangely enough, there was not a cheer. As a matter of fact, there are few who really believe it. War has been the business of the world so long that it is most difficult to persuade oneself that really Peace is within sight. More news came through to-day confirming last night’s wire.\n\nBut it is difficult to know whether anything will come of it. Is Germany sincere? So many times she has proffessed her willingness for peace, but with reservations which were impossible. The new Chancellor’s speech is full of arrogant statements of Germany’s \"greatness\", her \"military successes\", her desire to safeguard the \"rights of others\" (ye gods and little fishes!), but nowhere does she admit her crimes. I do not think the end is yet. As President\n\nWilson said, \"even so late as","103":" Germany herself has made coming to terms with her impossible.\" They are, he said \"without honour, and do not intend justice\".\n\nI think if a vote were taken among soldiers, that is here, (and those on the western front have even more cause to detest the German) there would be a tremendous majority in favour of hammering Germany until she surrendered absolutely without condition, and placed herself and her future unreservedly at the mercy of the Allies.\n\nHere in Palestine the advance, when one views the amount of territory covered, \nand\n the character of the country, and the tremendous amount of booty and prisoners secured, reads like a page from a romance. The Turkish Empire in Palestine is no more. It has vanished, annihalated by the brilliantly and courageously executed conceptions of a master-mind. Soldiers speak of General Allenby with reverence almost. No word of praise is to high. Deservedly he has been placed on a pedestal of affection and popularity by the men who serve under him that has been reached by few Commanders. Here in Palestine at the present moment the G.O.C.’s are faced with the fact that there is no Turkish Army to oppose them. Before they could always place their finger on the map at a given line and say that the Turkish front was there, but not so now. There is no Turkish front.\n","104":" I had a very, Ptolemy Philadelphus 300 yrs. B.C., interesting day yesterday. Two of us obtained leave to go into Amman to see the ruins of the Coliseum there. I had not imagined that it would be anything like it really is. It stands just on the left as one enters the town from the Eastern side. Five huge granite columns, the caps richly carved with leaves, support four great blocks of stone, each probably nine feet by three in diameter. These blocks are also carved in a most elaborate fashion. \n\nThis was evidently one of the entrances to the Coliseum, but it seems to have had many. Most of the work is in wonderful preservation, when one considers the years that must have passed since the slaves of some mighty monarch toiled and sweated in its erection. Level with the ground are two entrances, with highly ornamented doorways, one on either side, leading into what was evidently the places where animals were kept. On the first terrace are two doors on each side opening into galleries built of enormous stone blocks. These evidently served as an exit for the vast crowds which doubtless patronised the shows.\n\n On the second\n\nterrace one door on each side opens into a similar gallery, but which have had staircases, now blocked with rubbish, leading apparently to the open air on top of the hill. The third terrace has right in the middle of the half circle an imposing seat of honour with niches which were at one time evidently occupied by statuary. There is a small ante-room here too. Evidently here the Emperor himself sat to view the sports.\n\nThe whole place is vast, the labour involved must have been enormous, and one can only gaze in wonder and admiration. On the left, as one stands facing the huge structure, are some splendidly preserved fragments of one of the outer courts. The carving over the doorways here is magnificent. Leaves, fruit and flowers, with other complicated designs, stand out as clearly to-day as when the hands of the dead master-craftsmen, with infinite skill and patience, first chiselled them from the stone. The stone has been, some red, and some white, and evidently polished to an intense degree, and what the finished construction must have looked like with the sun striking on its polished grandeur and magnificence, can only be partly imagined. \n\nWe sat on one of the rows of great stones which formed the seats, and tried to picture the scenes that had been enacted here. The stirring gladiator combats, the vast concourse of nobles and delicate ladies, the vanquished men prostrate after a sanguinary encounter, the plaudits of the multitude, and then perhaps the tense moments of waiting for the signal which gave the beaten man his life or took it from him.\n\nUnreal and shadowy, because of our own scanty knowledge of such things, the pageant moves before us and the vast assemblage rises, and the ancient galleries resound to the tramp of many feet as the throngs seek their palatial homes. Sitting here too, one looks on over the town of Amman, dirty, mean, squalid as any other Eastern town. Remarkable contrasts, links between the old and the new, the splendid and the mean, present themselves to the eye. From the centre of a cluster of mud houses with flat roofs, rises a single column of granite four or five feet in diameter and towering above its squalid surroundings to a height of thirty feet.\n\nAway on the left amid similar surroundings part of the wall and tower of some great fortress rise. An old bridge of enormous stones spans the stream. Granite and marble columns are everywhere. Over all is the mark of Arab occupation. The huge galleries of the Coliseum, and the ante-rooms all bear the unmistakable hallmarks of Turkish occupation. They have stabled their horses in the galleries and lived in the ante-room, and dirt and evil smells are everywhere. Away on the hill in front are more masses of ruins where the ancient Capitol stood.\n\n After a meal\n\nwe leave the charms of the bull ring behind and climb the steep ascent to these. The stones used on the construction of the Coliseum are mere pebbles alongside the huge blocks lying in mighty disorder here. Great circular bases for columns, which are nearly six feet through, and stand two feet high, the pillars which formerly stood upright on them now lying around. One of these pillars in five sections measured eighteen yards in length, and there are dozens of them. Pillars, bases, and caps lie about in rich profusion, all one time of sparkling polished red granite now corroded and dull by the action of time. The whole top of the hill measuring some 15 or 20 acres of ground is a mass of tumbled stones, all at one time forming a wonderful city that was perhaps unequalled in its magnificence. \nthe noble city that stood here\n \n\nOn the south-western side portion of one of the buildings still stands, and we entered it by an arched and crumbling doorway. The carving in here is superb. Whole trees are carved in the solid stone, fluted pillars, and scroll work, with a profusion of leaves, fruit and flowers are around one in this rich room. Arched doorways elaborately carved lead to other chambers now blocked by rubbish. The stone work of the domed roof is splendid.\n\nIn one place, the action of time and weather has been such that the central pillars, formerly standing on great blocks of solid stone are now supported by mere threads of rock the size of a man’s wrist. Bats flit out of the ruined chambers and in some the Turks have laid their dead, uncovered. Round the whole of the city a vast wall has run enclosing the whole hill top. Only portions of it stand now, but much of this is in an excellent state of preservation. Who built these places I do not know yet, but they are monuments of the builders’ art, and a stirring object lesson on the decay of Empires.\n\nThen we found the Catacombs. The whole of the city underneath apparently, is honeycombed. We could only enter one of the vast entrances. It was too dark to go further. A match shows as a speck of flame only in the intense darkness, and casts no light, and it is cold as a freezing room. I am going in again provided with lights to make an examination if the tunnels are clear.\n","105":" On the","106":" I went in to Amman again with light this time, to see what I could find in the way of open passages under the old Roman city. The result was disappointing. We inspected several openings, but all are blocked, some with the accumulated rubbish of years, others by rough walls erected by Arabs or Bedouins. There will be a great field for exploration societies here.\n\nEvery day now sees the skies duller. Day by day\n\nthe clouds are drifting in, piling themselves up in readiness for the coming wet season. In another month or six weeks we will, I suppose, be commencing to taste the unpleasantness of another winter, that will go on well into March. May we be well out of Palestine by then.\n","107":" Good news. Hostilities between Turkey and the Allies cease at 12 o’clock to-day. It is the anniversary of the fall of Beersheba. One short year, but what a blow has been dealt to Turkish prestige and power in that time. The news seems hard to believe. No one has got at all excited. I think everyone has got so used to war and \"soldiering on\" that \nno one\n they has really realised just what it means.\n","108":" On the","109":" we left the Wadi Hammam for our ride back to Deiran, our last trip back across this country. At 7-30 A.M. we were on the move, and at about 4 P.M. we were in Es Salt, a distance of about 24 miles, where we camped for the night. Our camp there was exceedingly rough, the barest possible space is available for camping areas, between the road and the tremendous hills rising on each side. By 8 A.M. on the second we were on the way again down the main road from Es Salt to the Jordan Valley.\n\nThis \nrough\n road is very picturesque in a wild rugged way. \nAfter\n A few miles from Es Salt the road picks up the Wadi Nimrin which flows, imprisoned for the most part in a deep rocky gorge, overhung with shrubs and creeping vines, alongside the road right down to the Valley. Occasionally there are open patches with a profusion of flowering bamboos, and a shrub with a blue flower, whose scent reminds one of a scented verbena.\n\nThis road is an engineering feat in itself. A few miles, perhaps seven or eight from the Valley, we saw the famous \"Jericho Jane\", the Turkish big gun that had caused so much unpleasantness in the Valley in other days, upside down in the Wadi Nimrin. Tackle was being affixed to get her out. Only a few weeks ago we used to hear her deep-throated cough, always a signal for trouble, now she and the Turkish Army is a thing of the past.\n\nA little further on, and the Valley was in sight. It was the first time we were ever glad to see it, but then, we are going back for good now, and the Valley marks a slip in the road. We camped in the Valley near the Wadi Nimrin that night, reaching there at about 3 o’clock in the afternoon, a distance of 25 miles from Es Salt.\n\nNext morning, the","110":" we moved at about 8 P.M. across the Valley for the foothills and the Jerusalem road. One would hardly know the Valley. All the tents are gone, the endless traffic is a thing of the past, there has been a shower or two of rain, and the dust was practically nil. The Jordan was very low as we passed.\n\nComing up on to the flat country out of the river depression, the first thing we saw was the little enclosure where some of our brave boys lie sleeping. One cannot help a feeling of sadness when one reflects that they are lying here, while the comrades they fought with are marching back in the joy of victory with peace, which these helped to win, but whom the fortunes of war did not permit share in life. And yet they may know, and share in our triumph, who can tell. Already the farmers are busy in the Valley, irrigating, ploughing, etc.\n\nWe climbed out by the old Roman Road, and from the top of the hill near the","111":" K. from Jerusalem I turned and had my last look at the Jordan Valley. Very little dust was there to-day, but it was full of shadows and the grim hills of Moab were bathed in purple haze on the further side. We reached Talaat Ed Dumm, and turned in to our old camp at about 3 P.M. We are staying here to-day.\n\nOn the","112":" we left Talaat Ed Dumm and journeyed to Jerusalem, making our Camp about 3 miles out of the city on the Bethlehem Road. Leave was granted, but I did not go. I am tired of being shepherded round by an Officer as though I were one of a pack of school boys. Afterwards I regretted it a little, as the Mosque of Omar was open for inspection, and it was closed on my first visit.\n\nNext morning early, the","113":" we rode through the new city for the last time on our way to Latroun. Coming down the hill to the Pool of Gihon a couple\n\nof comely Jewish lassies passed us, and one called out in perfect English, \"Goodbye boys, and give our love to all the girls of Australia\". A big order, but I suppose we can each do our part.\n\nLatroun was reached that afternoon about 1 P.M. A hurricane wind was blowing on our backs as we descended the hills from Jerusalem and continued all night, making it very cold. Next morning we were on our way early and got into camp at Rishon Le Zion about 2 P.M. on the afternoon of the","114":" The wide sweeps of fertile country look very pleasing, and it is with a swelling sense of satisfaction that we look on the Judean hills, blue in the distance, and comfort ourselves that we have done with them for ever. The oranges are just ripening, great crops that bear the branches down to the ground.\n","115":" I have written so little lately, there is so little to write, and yet so much. The world has been so full of tremendous events, events that will change the face of the map and the destinies of nations, events that have set people laughing, crying, and dancing from a sheer excess of joy. Kings and Emperors have fallen, the old is being replaced by the new, and a great deep solemn pride, which I cannot adequately express, stirs in me as I remember we have \nwon through\n.\n\nI always knew we would. Never in the darkest hour did I doubt the outcome of this struggle. Victory is ours now, and with clean hands, and calm clear minds, and a stern justice tempered with a pleasing quality of mercy, the Allies are settling affairs to the satisfaction of a long-anguished and blood-weary world.\n\nThe \"long, long trail\" is nearly finished. So far as night rides and wearisome stunts here are concerned it is over. There remains now the Base and the journey over the wide stretch of waters that separates us all from beloved Australia, and then Finis can be written to this record. When we are to go we do not know. Rumours are springing up and spreading like wild fire, but there is nothing settled. So till we know, here in the quiet\n\nneighbourhood this placid place (Rishon le Zion) the best camping ground in Palestine, we must wait. But in all our hearts given audible voice, or unexpressed, but none the less keenly felt there, is the strong call of home and loved one’s and an earnest desire that the day of our departure may not be delayed.\n\nOn the","116":" we moved out from Rishon. I thought our days of stunting on horseback were over, but they were not quite. We left at about 9-30 A.M. It had been raining all night, and rained consistently up till about eight, and with very heavy clouds hanging around. There seemed every prospect of a wet miserable trip. But Fortune smiled on us, and the day remained fine, though cold.\n\nWe camped that night at Khan Sukereih on the sand. Our way for the most part led us through familiar country. With the Jewish colony of Ras Deiran on our left, we were soon crossing the Nahr Ruben by the fine bridge of recent construction which spans it. Five or six miles away, along the course of this Wadi, near where it runs into the ocean, the slender spire of a Mosque pierces the sky.\n\nThis is the Mosque dedicated to the prophet Ruben, the eldest son of Jacob, and Mussulman tradition says he is buried there. As at the pretended Tomb of Moses, near the Dead Sea, many of the faithful gather here at a certain time once a year for the celebration of religious rites and festivities. A short distance from the bridge we pass Yebnah, an Arab village set in the midst of olives and orange groves. The houses are miserable in the extreme, and one can hardly realise that at one time in its history, as a Jewish possession and province, this place could put 40,000 fighting men in the field.\n\nOn the right after passing Yebnah lies Akir, the ancient Accaron from where the Philistines sent the Ark on a new cart, drawn where they would at the discretion\n\nof two cattle. At Soukerier we camped for the night near an ancient Khan. I chanced the elements and slept out, and they were kind, though it was very cold. We moved again about ten o’clock on the morning of the","117":" On our right shortly after moving one could see crowning a low hill the tomb of the prophet Jonas. Then we cross the Wadi el Medjman, a prolongation of the Valley of the Terebinth where David slew Goliath, and skirt Esdoud .\n\nThis too is a mean city with a great past. The cactus hedges here reach a remarkable height. Here the Ark was brought, and placed in the Temple of Dagon, to the destruction of the Idol of the Philistines, while epidemics smote the people. From here it was moved to Geth and then Accaron, and finally sent home to the Israelites with offerings. Villages are plentiful from here on and some of them with a history going back into the dim early ages. Others are newer, and distinctly Arab in structure and history.\n\nThat night after a very heavy day for the transport we camped near the Village of Yebnah, a place of some 8000 inhabitants in pre-war days, with palms and sycamores, and luxuriant vegetation in the gardens. This place is said to correspond to the Biblical town Migdal-Gad. \nOn the on the morn\n\nIt was a great sight at night here. The division was packed in a very small area, occupying a basin and the slopes leading down to it. In the darkness, the glow from thousands of Camp fires, and candles, in bivvys made the place look some wonderful city, en fete. \n\nOn the morning of the","118":" we resumed our journey. Villages are everywhere, and the country is wonderfully fertile. One old farmer in pre-war days turned to me with a sign, \"By Jove\", he said, \"I’d like to own about a thousand acres here, with this railway line running through it.\"\n\nBy three o’clock that evening we were in sight of Gaza. Gardens and woods surround it and from its eminence it looks down on a scene of real beauty. Bitter fighting occured here, until in the third attack on the city, in General Allenby’s first successful drive, the place was carried. Many, many hundreds of crosses are raised to the sky here, all in one quiet and well preserved \nresting place\n enclosure, marking the last resting places of those\n\nwho, by their courage and cheerful sacrifice, carried the day.\n\nWe did not get an opportunity of seeing the city except from a distance. In the morning we moved on again. By the side of the road as we journeyed we saw the shattered remnants of a tank, a mute witness to the fierceness of the fighting here on that ill-fated","119":" That evening saw us at Belah, and the next morning we started for Rafa, reaching it about 3 o’clock on the afternoon of the","120":" Here we are to stay for an indefinite period.\n","121":" The old year is gone, and the second month of the new is on its way, and we are still here at Rafa. But we will not be long now. It is pretty certain that we move from here for Kantara about the 19th and the first or second week in March we should sail for dear old \"Aussie\". That will be a glorious day. It will be worth all the hardships and struggles of the past few years to know one is homeward bound.\n\n"}}