{"Document Name":{"0":"Diary_0060","1":"Diary_0060","2":"Diary_0060","3":"Diary_0060","4":"Diary_0060","5":"Diary_0060","6":"Diary_0060","7":"Diary_0060","8":"Diary_0060","9":"Diary_0060","10":"Diary_0060","11":"Diary_0060","12":"Diary_0060","13":"Diary_0060","14":"Diary_0060","15":"Diary_0060","16":"Diary_0060","17":"Diary_0060","18":"Diary_0060","19":"Diary_0060","20":"Diary_0060","21":"Diary_0060","22":"Diary_0060","23":"Diary_0060","24":"Diary_0060","25":"Diary_0060","26":"Diary_0060","27":"Diary_0060","28":"Diary_0060","29":"Diary_0060","30":"Diary_0060","31":"Diary_0060","32":"Diary_0060","33":"Diary_0060","34":"Diary_0060","35":"Diary_0060","36":"Diary_0060","37":"Diary_0060","38":"Diary_0060","39":"Diary_0060","40":"Diary_0060","41":"Diary_0060","42":"Diary_0060","43":"Diary_0060","44":"Diary_0060","45":"Diary_0060","46":"Diary_0060","47":"Diary_0060","48":"Diary_0060","49":"Diary_0060","50":"Diary_0060","51":"Diary_0060","52":"Diary_0060","53":"Diary_0060","54":"Diary_0060","55":"Diary_0060","56":"Diary_0060","57":"Diary_0060","58":"Diary_0060","59":"Diary_0060","60":"Diary_0060","61":"Diary_0060","62":"Diary_0060","63":"Diary_0060","64":"Diary_0060","65":"Diary_0060","66":"Diary_0060","67":"Diary_0060","68":"Diary_0060","69":"Diary_0060","70":"Diary_0060","71":"Diary_0060","72":"Diary_0060","73":"Diary_0060","74":"Diary_0060","75":"Diary_0060","76":"Diary_0060","77":"Diary_0060","78":"Diary_0060","79":"Diary_0060"},"Date":{"0":"unknown","1":1708.0,"2":1709.0,"3":1710.0,"4":1711.0,"5":1712.0,"6":1713.0,"7":1714.0,"8":1715.0,"9":1716.0,"10":1717.0,"11":1718.0,"12":1719.0,"13":1720.0,"14":1721.0,"15":1722.0,"16":1723.0,"17":1724.0,"18":1725.0,"19":1726.0,"20":1727.0,"21":1728.0,"22":1729.0,"23":1730.0,"24":1731.0,"25":1732.0,"26":1733.0,"27":1734.0,"28":1737.0,"29":1738.0,"30":1740.0,"31":1741.0,"32":1742.0,"33":1743.0,"34":1744.0,"35":1745.0,"36":1746.0,"37":1747.0,"38":1748.0,"39":1749.0,"40":1750.0,"41":1758.0,"42":1759.0,"43":1760.0,"44":1761.0,"45":1762.0,"46":1763.0,"47":1764.0,"48":1765.0,"49":1767.0,"50":1768.0,"51":1769.0,"52":1770.0,"53":1771.0,"54":1772.0,"55":1773.0,"56":1774.0,"57":1775.0,"58":1776.0,"59":1777.0,"60":1781.0,"61":1782.0,"62":1783.0,"63":1784.0,"64":1785.0,"65":1789.0,"66":1792.0,"67":1793.0,"68":1794.0,"69":1798.0,"70":1799.0,"71":1800.0,"72":1801.0,"73":1802.0,"74":1803.0,"75":1804.0,"76":1805.0,"77":1806.0,"78":1807.0,"79":1808.0},"Entry":{"0":"\n\n","1":"\n\nPte. Guilliaume Casimir W. has come to me as my batman.\n\nBill, as he is called, is a Frenchman with a varied and extremely interesting career. Born at … in 1862 he was educated at \nschool\n and given every opportunity to study by a very wealthy and indulgent parent of whom he still cherishes affectionate memories. But Bill early showed a roving disposition. When quite a young man he entered the French Army where he soon rose to Commissioned Rank. He was of course too young to take part in the war of\n\n1870 but his elder brother lost an arm and a leg in this war and another (female) member of his family wounded. His father who at that time had a flourishing business in Northern France had to leave hurriedly for a safer area farther south leaving his business to the mercy of the Huns much in the same way as the French people have had to do during this war.\n\nOne of Bill’s daughters had been wounded whilst driving wounded from Verdun in a motor Ambulance. For this and other excellent reason Bill loves the Germans. He has served several years\n\nas a soldier in Morroco & Madagascar and later went to the New Hebrides where he began life as a planter. Unable to settle however he visited Australia and was attracted by the Goldfields. What success attended his gold prospecting I have not so far been able to ascertain. He spent most of his prospecting days in the West of New South Wales. One day \nabout\n early in 1916 Bill found himself in Dubbo and saw the soldiers being trained and heard the recruiting officials appealing for more men. Bill’s long-fostered hate of the Bosche \nbec\n burst into flame and he enlisted.\n\n \n\nHe spent some little time in the training camp in Bathurst and joined the 54th Battalion in France in time to go through the dreaded winter on the Somme. Many younger and stronger men broke up during the hard long months of cold but Bill stuck it out and is still as energetic and active as a two year old. As a batman he is absolutely invaluable.\n","2":"\n\nGreat preparations are in hand for a big attack on the Hun from beyond Albert down to Soissons to the French. Tanks armoured cars aeroplanes cavalry, guns and infantry are to be utilized on a scale \nmore\n greatly exceeding those used in any\n\nother battle. For the first time the whole five Australian Divisions are to work together in conjunction with the whole Canadian Corps on our right. An English Division is to operate on our left. Wotto for the flank! Aeroplanes are to carry up ammunition, tanks are also to carry supplies for the Lewis Gunners and even Lewis Gunners themselves as well as supplies for the other tanks. The men have all been instructed in the part they are to play in this attack. Necessary equipment etc. has been issued to each man to carry him through three days fighting. Night has fallen\n\nwith a bright starry \nat\n sky and keen atmosphere betokening a fair day for the morrow and the great battle. All ranks are keyed up to the highest possible pitch of enthusiasm at the prospect of \na\n taking part in so huge a conflict. The elaborate and complete plans of the high command the attention to \ndeta\n the most minute details in the organisation has filled everyone with admiration of our staff leaders \nand\n whose confidence in the troops under their command to carry out to the letter the plans laid down is absolute: and never was a confidence ","3":"\n better placed.\n\n8th Aug.\n\nWe rose at 3 a.m. and had a hot meal. We moved off in the misty morn across a large wheatfield the weeds smelling rank almost to suffocation from the amount of moisture taken in from the dewy night.\n\nWe learned to our genuine disappointment last night that we are not to take an active part in this battle as \nwe\n our brigade has been allotted the position of Reserve Brigade to the division. Very likely we will see no fighting at all as it looks as if everything is going to run off smoothly. However time will tell and we are ready anyway. Our guns began a smart tattoo up around Villers Bretonneux \n\nas we moved along slowly. It was scarcely daylight as yet. Sharp, lurid flashes broke out all along the front. Suddenly the whole length of sky sprang to life with one long flash of venoumous light. The air was filled with sharp \nthe\n detonations and continuous roar of guns which echoed and reechoed along the valleys. It was music to our ears. For they were our guns, dealing out death and destruction to to the War Lord’s hordes. The great fight has started. Gen. Monash G.O.C. A.I.F. sent a stirring address to the soldiers in the A.I.F. in France on the eve of this big battle. It ran as follows –\n\nTo The Soldiers of the Aust. Army Corps\n\nFor the first time in the history of this Corps all five divisions will tomorrow engage in the largest and most important battle operation ever undertaken by the Corps.\n\nThey will be supported by an exceptionally powerful artillery and by Tanks and aeroplanes on a scale never previously attempted. The full resources of our sister Dominion the Canadian Corps will also operate on our right, while two British Divisions will guard our left flank. The most successful offensives which the \n\nBrigades and Battalions have so brilliantly executed during the past four months have been but the prelude to and the preparation for the greatest culminating effort.\n\nBecause of the completeness of our plans and dispositions, of the magnitude of the operation, of the number of troops employed and of the depth to which we intend to over-run the enemy’s positions this battle will be one of the most memorable of the whole war and there can be no doubt that by capturing our objectives we shall inflict blows upon the enemy which will make him stagger and will bring the end apprecia-\n\n-bly nearer.\n\nI entertain no sort of doubt that every Australian soldier will worthily rise to so great an occasion and that every man imbued with the spirit of victory will in spite of every difficulty that may confront him be animated by no other resolve than a grim determination to see through to a clan finish whatever his task may be.\n\nThe work to be done tomorrow will perhaps make heavy demands upon the staying powers of many of you but I am confident that in spite of excitement, fatigue and physical strain every man will carry on\n\nto the utmost of his power until his goal is won for the sake of Australia, the Empire and our cause.\n\nI earnestly wish every soldier of the Corps the best of good fortune and a glorious and decisive victory the story of which will reecho throughout the world and will live for ever in the history of our homeland.\n\nJohn Monash Lt. Gen.\n\nG.O.C. Aust. Corps\n","4":"\n","5":" Cont.\n\nWe reached our position on the left of Villers Bretonneux and got into some trenches known by the name by the name of Banana Switch.\n\nArtillery in galore is moving up to the attack in good order. Some at the gallop, mostly light field guns these. Others the heavies moving along leisurely, others again being dragged along by crawling grunting tractors. It is a great sight enhanced by the good old infantry advancing across the long sloping ground in artillery formation. Strings of mules and horses are moving in all directions towards the battle line. A hun aeroplane dropped\n\na bomb on a group of these poor faithful beasts killing and maiming many of them and wounding a couple of artillery men. It is appalling the \nnub\n number of horses which are killed in battle.\n\nThe attack so far has been very successful. The Second Division having \nthe\n already captured the Red Line as the first objective is officially called. The","6":" and 15th Brigades of our Division carried on and captured \nthe\n the Green Line. The Tanks and Cavalry have done good work in this lot and the armoured cars especially have distinguished themselves. At one time they penetrated to a depth of\n\nnearly 12 miles a long way ahead of our own infantry and entering a town found a Corps Hqrs. Staff at \nwork\n Mess in a House on the main street. Our armoured car adventurers machine-gunned them through the open windows killing all the occupants. Spying round for fresh victims they came across a transport column and slaughtered the lot, then tore off at about 40 miles per hour \nfor\n to rejoin our own advancing infantry and to report their news of the enemy. Our Division has captured the towns of Bayonvillers Guilleaucourt and Harbonniers. Many\n\nhundreds of prisoners have passed \nc\n us on their way down to the cages. They are well clothed of good physique and have a soldierly appearance. Majority of them however appear to be quite happy under their changed conditions. Many Machine Guns and number of field guns of the whiz-bang type (4.2) and an armoured train with a 9\" gun aboard as well as naval guns have fallen to our Division. The Canadians, on our right, have also been very successful and have pushed their line up to and a little beyond ours taking the village of Wiencourt l’Equippe and a couple of other villages\n\nin their sweep. Our Casualties have been extremely few. It has been a great blow to the Hun. About 4 p.m. we received orders to move forward again and \na\n take up support \nrescue\n position behind Bayonvillers. My Coy. occupied some ground under a few trees alongside a couple of captured guns. Several dead german artillery men lay around. These fellows had been killed in the approved style with the bayonet. \nby\n Our lads have done their work well.\n","7":"\n\nArmoured cars and cavalry have done the out-post duty and patrolling for the night and the infantry have had a well earned\n\nrest. All ranks are waiting eagerly to see a newspaper and read the official report of the battle on the whole front. It is surprising how little the actual attacking force knows of its own doings, and therefore look to the rear to supply them with detailed particulars of the show. Similarly those in rear are always anxious to hear of the real state of things in the line. Is Jerry putting up a good fight or is he \nis\n surrendering freely or is he bolting away from his foes and Fritz did all three things at different times. A wounded Aussie on his way back to the dressing station was besieged by a host \ns\n of other\n\nAussies anxious to hear the latest. Perhaps he had been wounded in a stiff little scrap, when his voice would be quiet and grim and a generous tribute paid to Jerry’s tenacity. Or perhaps he had been wounded in some unaccountable way like so many others have been before him. Then his eyes would sparkle with enthusiasm and he would draw upon his imagination to a remarkable extent whilst recounting his wonderful and terrible experiences. How the tanks had knocked out a battery, how one of our planes had driven a hun plane to earth. How the cavalry had outflanked a strong\n\npoint, how the armoured cars had dashed at a terrific speed into a group of enemy infantry mowing them down \nat a\n like grass before a reaper, how our guns had \ngl\n galloped into action amidst a storm of shot and shell wheeled about unlimbered and fired over the heads of our own men at the enemy and last but not least, how the gallant infantry had charged with the bayonet, \nand\n routed the enemy and were still pursuing him. After which having cadged a cigarette and a light our wounded hero proceeds on his way in glorified mood leaving his hearers amazed and pleased\n\nprobably to write to Mother or My Dear Wife, telling of these wonderful things in a new five-times-magnified manner.\n\nIt is seldom that one man sees all the branches of the army mentioned, in action at the same time as his own. Such a thing was possible however in this battle. We understand that the successes achieved within the past few days are to be exploited for once.\n","8":" a.m.\n\nThe attack has been carried on well ahead of the village of Harbonniers almost up to Pozieres.\n\nOld Bill lost his Box Respirator last night and went nearly crazy. Bill \nwou\n will go into an attack or into the line\n\nanywhere minus his steel hat \nor\n Shells, machine guns and rifles do not worry him in the least but to be without his Box Respirator, his protection against gas poisoning, is unbearable. He had the \"wind up\" a treat and went around with a lighted candle in his hand cursing and swearing the while The gas guard yelled at him to \"Put that light out\", as Jerry was overhead in a plane and had already dropped several bombs near by. In the midst of his trouble Lieut Adams who is O.C. A Coy. temporarily called for his batman of whom Bill inquired frantically if he had seen his \"gaz\". He evidently had for presently\n\nBill’s head appeared in the door of dugout with the precious article in his hand. His expletives during the search had both John Adams and myself in fits of laughter. His English is very imperfect and some of his sayings are screamingly funny. They are composed chiefly of English slang, real curses and swear words, besides his own lingo mixed up in it.\n\n10th\n\nEnemy aeroplanes have been very active nearly all night dropping \nplanes\n bombs on our cantonments in rear here. We lost one man killed and one wounded as a result. Our planes have \n\nbeen returning the compliment over his lines with interest.\n\n7.50 The day has opened up fine again.\n\nWe buried the dead germans lying \na\n near by and the graves were marked with little wooden crosses and their steel helmets placed at each end. No names were put on the graves as it was impossible to distinguish one word from another as being names. How many fallen heroes on either side have thus passed into complete oblivion during this terrible war.\n\n4.30 pm Orders have come along for the battalion to move back to Fouilloy near Corbie-\n\nSur-Somme. We left our reserve position and marched back in artillery formation so as to minimise the danger of casualties from bombs or shell fire from the long range guns which the enemy is using to harass our communications though with practically no results whatever, as there are acres and acres of country in which the shells may drop without doing the slightest damage to anything or anybody. After a hot march we reached some fields just behind Fouilloy. French shelters were provided and \nwe\n the battalion camped\n\nunder the shelter of trees and alongside hedges to prevent as much as possible being observed by enemy aircraft. Bill has been down to the village and interviewed the French police and secured a billet for A company’s officers. Unfortunately all ranks have been ordered to keep out of the village as it subject to frequent bombing raids by Jerry.\n","9":"\n\nActing under instructions from John Adams I took A. Coy. down to the River for a swim. It was the first swim I have had for many moons.\n","10":"\n\nMove again. We left Fouilloy about 10.30 A.M. and\n\nafter a long hot and dusty march reached the village of Caix. I was looking forward to a good wash and a rest when the Major (Trickey) came along on his horse and informed me that I was to go to the 60th Battalion as soon as possible and report to the Commanding officer as Signal Officer for the impending attack. Of course I was highly delighted to hear it I don’t think. I had been looking forward to going through this battle in the company under Lieut. Adams, a very gallant leader and a good comrade. I was extremely displeased\n\nover the matter as was also John. But such are the ways of the army. So away I went with the faithful Bill over the hills and far away to the 60th Battalion.\n\nAfter a very long tramp we arrived at a dugout in a huge bank which appeared to be the Head Quarters of some show or other. I nosed along a passage and came upon a lighted candle and a pair of sleepy eyes. I stated my business in no gentle manner as I was \na\n not in the mood for conversation of any sort much less the amount of talking necessary for the taking over of a new job\n\nhaving with Bill, walked over 20 kilometres today. The \"sleepy eyes\" I found out belonged to no less a distinguished person than the Colonel himself. Layh by name D.S.O. and bar to same.\n\nAbout this time a message came along from 15th Brigade Hdqrs. to move up to the assembly position for the attack at 12 midnight. It was now nearly 11 p.m. so I decided to turn in for some sleep toute suite. About 11.30 p.m. a notice came from Bde cancelling our move for the night much to the intense satisfaction of all concerned.\n","11":"\n\nI went to the Bde Hqrs. in \n\nGuilleaucourt to glean what information I could of plans for communication. But could learn nothing so I have my own initiative and the cooperation of the boys under my command to rely on.\n\n15th\n\nOrders for our \"hop over\" here have been definitely cancelled. We are to go into a reserve position instead, behind the village of Morcourt on our immediate left about 8 kilometres distant.\n\n8.30 p.m. We left our position below Guillaucourt and marched to up here to Morcourt. The enemy bombed the road in our vicinity\n\nwith light and heavy bombs, his planes flying very low. He also fired a number of small calibre shells near us but did no damage. We crawled into holes in the side of a bank and did our best to sleep. We are here to relieve some Tommy crowd in front of Mericourt Sur Somme.\n\nAll ranks expected a relief from the line after the recent hard time. The whole of the Aust Corps has been going strong since about","12":" this year with a relief of no more than one week from the actual firing line. We wonder sometimes what they would \n","13":" without us. The fact is however that present situation opens a favourable opportunity to first class troops of the allies to get in a smashing blow against the Hun as he is falling back at all points now. As Australians troops are reckoned second to none in the whole world it is not surprising that we are kept at it. It is a great strain on the men though.\n\nWe have done a considerable amount of marching \ntoday\n of late and I find that my staying power is \none in\n a good deal under strength since\n\nbeing gassed.\n","14":"\n\nWe relieved the 7th Border Regt. from the support position in \nbehind\n front of Mericourt about 11 p.m.\n\n17th\n\nI slept in the chateau last night in one of the roomy cellars. Like all other Chateaux in the battle area this one has been sadly torn by shell fire. Only the ground floor remains intact.\n","15":"\n\nThe thoughtful Hun placed a heavy shell on top of our dugout last night right above where Doc. Simons, Lieut. Wootton and myself were playing bridge. There was a roar as of an engine passing and a loud crash as \nit\n the big brute\n\nexploded. It slightly displaced part of our over head cover but did no other damage beyond putting the lights out and covering us in dirt. We soon cleared this from off the table and carried on with our game. The shell must have come \ndone\n down at a very sharp angle to have been able to miss the high bank in front of us. It was a fluke shot \nbut\n and might have had very disastrous consequences for all of us.\n\nI took a walk forward this morning with L\/ cpl Grinter of my Signal Section. It is very monotonous here nothing to do, nothing to read\n\nnothing to write about Matches have been terribly scarce. The Mess Sergeant came back today with \nout\n a box of cigarettes for us.\n","16":"\n\nI went forward again this morning and after climbing the hill opposite Jerry’s position pulled out my glasses and had a good look round the country. Nothing was discernible over Jerry’s way however except a few of our shells bursting in a wood. Instead, a grand panorama of majestic hills behind rewarded me. These hills overlook the Somme valley for miles. Away in the distance the battered tower of Corbie Church\n\npresented a mute protest to its Hun marauders. Our people are salvaging a great deal of captured material in this area. The Hun has done himself very well at one time.\n","17":"\n\nI visited the 54th Bn. today proceeding across country on a bike. I passed by a huge dump and cluster of hutments captured by our chaps. It was blazing merrily, the enemy having fired a number of incendiary shells into it for this purpose. I also passed a group of our boys examining an enemy aeroplane. Such common sights still seem to attract a large number of the troops.\n\nI suppose it always will fascinate them.\n\nI found Mr. Wheen blankly staring over the top of a trench. He managed to see and recognise me however and greeted me with his \nq ac\n custom \n ed \n ary smile and quiet way. I found out that some letters were waiting for me at A Coy’s Hqrs. but as my time was limited I decided to return to the 60th and send Bill along to collect them for me. I called in at B Company’s Hqrs. on my way back where I saw the O.C. Capt. Downing and John Adams, the latter in extremely exasperated mood.\n\nOn my return to the 60th I despatched the good Bill \nto\n for my mail. He had been gone about half an hour when I heard a commotion at the entrance of the dugout. On going to investigate I found Bill Casimir between two tommies with fixed bayonets speechless with rage. I was informed by one of the tommies that their Captain had come across Bill and noticed his strange speech in some way and at once suspected him of being a spy. Poor Bill’s angry protestations to the contrary were of no avail and although he had produced his pay book and the note signed by me, was\n\nplaced under escort and sent along to Hqrs. I at once cleared him, cursed his tormentors and the idiot of a captain. The tommies \nh\n were only to pleased to be gone as I fancy Bill had them a trifle shaky. I sent Bill off again and he returned about dusk, but minus my mail as he said they had been sent back to the post office readdressed to me here. So I expect I shall receive them sometime. This is the second time with in a week old Bill has been arrested as a spy. He is beginning to regard these episodes as a joke as although he is naturally \n\nvery indignant at the time he realizes that his strange manner must at times give rise to suspicion. I am afraid though, one of these days some body will come a cropper as Bill is very quick tempered and a thoroughly roused Frenchman is a very dangerous person.\n","18":"\n\nCool evening, baby breeze, stately \nstately\n trees twinkling leaves and – peace.\n\nIt has been a glorious day. In view of our being relieved tonight by the \nfr\n 1st Bn. I was sent with a couple of men to Vaire-Sous-Somme to arrange billets for the Battalion. We went to Bde.\n\nHdqrs. \nwhere\n in Morcourt where I told the men to lorry hop it to Vaire whilst I would follow with the Staff Captain I found Capt. Salmon on his way to dinner and Capt. Gollan in the throes of soap and water after a hot and busy day. Capt. Gollan was at one time \na\n Adjutant of the 54th Bn. and is now acting Brigade major to the 15th Bde. I had a cup of tea with Bobbie Salmon \nand\n after which the brigade staff assembled on the grass in rear of Hqrs. The General told us that the French had made another big advance before Soisson. He seemed in a communicative mood.\n\nI reached Vaire with the Staff Capt. and he allotted the eastern portion of the town to my Bn. \nto\n as billeting area. I accordingly began the task of allotting the different habitable \nd\n houses to the companies. In this I was ably assisted by Lieut. Mountford of ‘B’ Company. We then waited along the tow path of the canal for the incoming tired battalion.\n","19":"\n\nThe last company marched into billets this morning at 4.45 A.M. I reported \"all in\" to the C.O. and turned in myself at 5.30 A.M. Had breakfast about 10 A.M. and took a stroll in the direction of Vaux. The day being swelteringly hot I decided to have a \n\n-ment. I paid the officers this afternoon and had a good swim. The water is simply Snodge about this time.\n\nThe 1st and","20":" Divisions have made another attack in the direction of Bray Sur Somme.\n\nHere are a couple of incidents worth noting. During the recent advance of the Australians near Harbonniers a german general was captured and he demanded an escort of his own rank. One of the Diggers stepped up to him pulled out a pack knife, cut off his shoulder straps with the remarks, There you --? You are reduced to the ranks, now get a --! move\n\non, at the same time handling his rifle and bayonet menacingly. The Hun got a move on. It is a language which they understand thoroughly. A grave bore the inscription \"Two dead huns buried here\". Another grave, \"Dead horse buried here rest in peace\". The dead horses are gradually being buried as we \nf\n move forward. Many of the cemeterys round about these villages are minus their headstones the hun having taken them to build machine gun positions with. This is particularly noticeable in the cemetery here in Vaire. In others the family vaults have\n\nhave been opened, ransacked and otherwise reviled, deliberately and bestially.\n","21":"\n\nThe band of this Battalion arrived this evening and gave a few selections which were greatly appreciated by the boys.\n","22":"\n\nIt has been cooler and inclined to be showery today. A voluntary church parade was held today for all denominations. A parade was also held for inspection by the Brigadier Gen. Elliot. \n\nThe","23":" Divisional Concert Party gave a very good concert in the open air this evening. Towards the end of the performance it began to rain and the crowd began to melt. An old policeman aeroplane\n\ncame over the crowd and the observer stood up in his seat to catch a good glimpse of the performers. As a bogus girl was on the stage at the time he was evidently rewarded for his trouble and waved his hands frantically to us.\n","24":"\n\nTo prevent ourselves from going stone crazy the Doctor and I went for a bike ride into Daours passing through Fouilly & Aubigny. We called in to see a friend of the Doc’s a Major Copplestone of the Sanitary Detachment, also a Medical Officer. He invited us inside his luxurious billet & played a piece of Schuman’s to us on a very grand and beautifully toned grand piano.\n\nIt was one which the civilians in their flight had left behind in their once beautiful home. How many times have I wished that I could play a piano and play it well.\n\nWe returned via the old tow path along the Somme River all the way. The water was dark and sombre looking with a quiet smooth surface except where it rushed over the weirs.\n","25":"\n\nNews still good. The germans have retired a long way and the 8th Bde. is following up. I came off parade at 12.30 p.m. and was told to report B.O.R. as soon as possible which I did and after a hasty meal bolted off on a cycle with L\/cpl. Grinter to meet the Staff Captain in Proyart\n\nabout 14 kilometres distant. Having met the S.C. we were ordered to push on Foucaucourt where I was told to go further on still by one of the Bde. Staff as the huns were retreating at a great rate. I had to select a position for my Bn. near the ‘site’ of the old town of Estrees which I did. It rained like blazes and I found that pushing a bike along muddy roads and sticky fields was a great joke I dont think. I had a look round and dashed back as hard as I could to meet the Bn. whom I found having tea just outside Proyart. I gave Major Kerr all the dispositions and information I was able to and he sent me back again to wait for the Bn. and\n\nguide them to their positions.\n\nThe Bn. came in about 10 p.m and after seeing them all O.K. reported to the C.O. and crawled into a hole and had a sleep or rather I tried to. The sky had cleared by this time and the night turned out to be one of the coldest I have ever experienced.\n","26":"\n\nBreakfast was issued at 5 A.M. and all ranks prepared to move by 9 oclock. Information has been received from the front line to the effect that the huns continue to retire. At 9 A.M. we moved across the old shell torn Somme country in artillery formation. Many fine sights were witnessed in the air. Our planes are\n\npredominant, which is very inspiriting to troops moving up to the attack. The enemy shelled our area with light and heavy guns without doing any harm. His retreat is a very masterly and systematic one.\n","27":" stalwart huns of the Alexander Regt.","28":" Div. gave themselves up this morning early. They were very pleased at being out of the row.\n\nTransport difficulties present themselves now that we are back in the Somme battle ground and \nwe\n these difficulties will increase as & when the bad weather begins.\n","29":" p.m. The enemy shelled us with tear gas shells and we had to move to higher ground.\n\nOur Bde. has been ordered to attempt a crossing of the Somme and push the germans off the high ground beyond.\n\n5.30 p.m. Attack cancelled and the Bde. ordered to stand fast until further orders.\n","30":"\n\nRaining again.\n\n4.30 a.m. Orders have been received for the Bn. to move at 6 A.M. The men had a good hot meal and we started off. We are to follow up the 6th Aust. Bde. who are to make an attempt at crossing instead of us.\n\n11 a.m. Message has been received saying the 6th Bde. attempt to cross has failed. We moved back to a position in rear of the town of Barleux on receipt of this news.\n\nArrived there the C.O. was called to a conference at Bde Hqrs.\n\n2.30 p.m. The C.O. returned with the news that we are to attempt the crossing after all tonight.\n\n5.30 p.m. Attack cancelled again. Patrols only have been ordered to establish \ned\n themselves on the opposite bank. The difficulty lies in the marshes which exist for a considerable distance on the other side of the river. We moved forward about 1000 yards along the trench about dusk.\n\nMr. Gannon the Intelligence Officer of this Bn. whilst reconnoitring along the trench was severely wounded by a gas shell. The enemy shelled this area fiercely with H.E. and Gas Shells about this time.\n\nWe are wondering when our next orders will come to move. I have never known so many orders to be issued and cancelled as has been the case during the last few days.\n\nA little gas shelling this evening.\n","31":"\n\nThe 14th Brigade attacked and captured Peronne this morning about 4.30 A.M. Prisoners surrendered freely and all seem to be \"fed up\".\n\n1 p.m. We moved again about 1000 yards nearer the Somme. We are to expect orders to cross the River this afternoon. We anticipate a \"sticky\" time.\n\n2nd\n\n3.30 A.M. We moved from our position and crossed the Somme about 4.30 A.M.\n\nContrary to expectations we suffered no casualties whatever during our approach to, and the crossing of the River though the enemy shelled fairly heavily. We had an exciting run \nthe\n through the main street of Peronne under Machine Gun fire. It was during this period that we had our first casualties in the battalion during the action. The 14th Brigade had cleared the town pretty well. Though most of the credit must go to the 54th Battalion of this brigade as they had the task of making the initial crossing of the River and marshes on the roughly constructed bridges and they did their job well.\n\n12.30 p.m. Heavy Machine Gun and Rifle fire and Shell fire encountered from North Eastern end of Peronne.\n\nThe adjutant Capt. J. Haddon and the Intelligence Officer wounded; both rather badly. Lieut. Veal has been wounded slightly and gone out. Enemy dead testify to the havoc wrought by our barrage earlier in the morning.\n\n4.30 p.m. Major Kerr received a slight but nasty wound between the eyes.\n\n5.30 p.m. Orders have been received for our brigade to relieve the 14th Bde. who have suffered very heavy casualties. We are to relieve the 53rd Bn.\n\nMajor Kerr went forward\n\nto see the C.O. of this Bn. Col. Cheeseman and make arrangements for our relief tonight. Lieut. Howells has arrived to take up duties of adjutant of this Battalion. Our Bn. Hqrs. at this time were \nat\n in rear of one of the huge ramparts which were built to defend the town against invaders with more primitive ideas of waging war.\n\n6 p.m. I went forward with Sgt. Armstrong to 53rd Bn. Hqrs. having decided to move our Hqrs. here. Major Kerr arrived soon after we got there having fixed up the sectors for each of our Companies. Up till now things have been very obscure on our left flank\n\nand it is not quite clear yet who is on our left. Our job is find out and get close \nt\n with them. The 2nd Aust. Division is over there somewhere having captured Mount St. Quentin about the same time \nour\n the 14th Bde. took Peronne. One thing which I must make a note of here. Whilst moving up this morning through Peronne a runner brought a despatch along from Bde. Hqrs. marked urgent. It contained several names of men of this battalion who are to go on Blighty leave. Imagine the joy of these chaps at receiving leave passes when on the verge of going\n\ninto battle. An Officer in the 54th Bn. Lt. Rowe by name who also received a leave pass from England had the misfortune to be wounded whilst going out though only slightly. \nfor\n\n10.30 p.m. Relief complete. What a weight of anxiety is lifted from the Commanding Officers concerned when this message is received. The relieved people make hurried preparations for clearing out as soon as possible while the incoming people prepare to settle down and \nenjy\n enjoy a comfortable night.\n\nThe men have all had a good hot meal.\n\nCapt. Gleason our Quarter Master is a clinker on his job. Rations are plentiful and very good.\n\n11.15 p.m. I turned in and tried to sleep but the events of the day kept churning over in my mind.\n\nI forgot to mention that Capt. Steele and Lieut. Cookson \nwer\n of A company were both wounded about 2 p.m. A fragment of shell struck Mr. Cookson on the steel hat and stunned him. It then glided off on to Capt. Steele’s right arm and rendered it useless. Mr. Cookson was severely shaken by the blow but \nme\n both men remained on duty.\n\nHad it not been for his steel hat he would certainly not be alive today. The steel hats have saved thousands of lives in like manner since they \nwere\n first were adopted by the British early in 1916.\n\n3rd\n\n10 AM. I awoke and had a look round the dug out. I found John Howells at the table with a blanket over his knees \nand\n a pencil in his hand and a long screed which he had been writing. He had been up all night and was very sleepy. He turned in as soon as I came along.\n\n12 noon. Tragedy of tragedies. Poor old Bill Casimir\n\nhas been very badly wounded. I left him with two other batmen in Peronne yesterday afternoon and whilst the three of them were coming along this morning to Bn. Hqrs. a shell exploded on the road near them wounding all three. Poor Bill had his right knee almost shot away. He will have a hard time I am afraid.\n\n6 p.m. Our Bn. has been ordered to move forward and establish a line about 1000 yards further on.\n\nMajor Kerr, Sergeant Armstrong and myself went forward to see Company Commanders about the\n\nmatter after which we returned to Bn. Hqrs.\n\n7.45 p.m. The enemy heavily gas shelled this area giving our transport a bad time coming up with rations.\n\n4th\n\n4 AM. Reports from Captain Roberts in charge of last nights operation states that the advance was carried out \nby\n successfully by \"B\" and \"C\" Companies under Capt. Cahill and Lieut. Thorburn in the direction of St. Denis Wood.\n\n12 noon. I was ordered to report to Staff Captain 15th Bde. at 2 p.m. I took L\/Cpl. Grinter with me again and went off. We found the Bde. at lunch and was given a good meal by one of the menials there.\n\nAfter lunch the Staff Captain (Captain Bobby Sammon) gave us an area near Barleux in which to arrange to put the 60th Bn. on their return from the line. I did this and about 11 p.m. received word to report back to the Bn. again with all haste as instead of now coming \nma\n out for a rest the whole brigade will make an advance in the direction of the town of Doingt. \"A\" Coy who have already arrived here and are now \nsug\n snugly rolled up in their blankets are to remain here under the orders of 59th Bn. C.O.\n\n5th\n\n2 p.m. The whole Bn. less \"A\" Coy. moved forward\n\nabout 2000 yards without any opposition and took up a position below St. Denis Wood. Having gone ahead a little with Sgt. Armstrong I selected a position for Bn. Hqrs. and brought the Major and Mr. Howell’s along.\n\n5 p.m. Mr. Wellington having just returned from an Intelligence School I was ordered to go with him to report to Bde Hqrs. again and arrange billets for the battalion which we understand are to come out at last. We came back along the main street of Peronne. This street is about 80 yards wide. It has been a wonderful old town with its grass covered ramparts and moat. The old battlements\n\nare scarred \nwith\n from the recent batterings of our own guns and the hun’s. Not a house remains \nun\n intact, though the streets themselves are in good order as it takes a lot of blasting to damage these cobbled roads which the French are experts at making. We arranged billets for the Bn. in \nthe\n hutments near Bde. Hqrs. and \"turned in\" within a few yards of an eight \nyear\n day \na\n \"dead\" neddy.\n\n6th\n\nOnce more the order for our Bn. to come out has been cancelled. We wonder sometimes what our staff can be dreaming about. They do \n\nnot seem to be able to think the same thing twice these days. It is hard to say who is responsible for the conglomeration of orders which are received. \nthese days\n\nThe 3rd Aust. Div. went through our Div. last night and captured St. Denis Wood and the high ground around and beyond it.\n","32":" A.M. Our guns seen \nrus\n rushing up this hill early this morning.\n\nBig columns of black smoke have been rising up over these hills for some days past. The enemy is reported to be burning dumps of ammunition and other material which he considers he will be unable\n\nto remove before we are down on him. Aeroplanes report bridges and cross roads blown up by the enemy. He intends to carry on his big retirement along the front. \"A\" Coy. arrived this morning and were guided to their billets.\n\n3 p.m. We all went down for a swim. I sat on the Bank of the Somme while one of the boys cut my hair before going in.\n\n11 p.m. I received orders to rejoin my Battalion (the 54th) urgently. As I had not the faintest notion where my battalion was and nobody could tell me definitely and as I had not got a map of the area they were\n\nsupposed to be in and nobody could or would oblige me in this respect, also as I was comfortably installed in bed I decided to wait till daylight before making a move of any sort.\n\n7th\n\nI left the 60th Bn and after a long tramp going almost due east the whole way I caught my battalion. They were at rest in support of the","33":" Aust. Bde near the town of Estrees. I found that the Bn. had suffered heavily during the Peronne Stunt, Lts. Macarthur and Holder being killed and \nthe\n John Adams badly wounded though after doing good work. Many of the officers\n\nin this Bn. greatly distinguished themselves and are I believe to be rewarded. Lt. Wheen the Signalling Officer has been wounded by a bullet from \nt\n an enemy aeroplane and I am to carry on his job.\n\n8th\n\nLt Upfold and I went across to Vraignes to find our Y.M.C.A. which we heard was over there. We found it. Our Y.M.C.A. men are pearls on their jobs. The man in charge of the 14th Bde Y.M.C.A. Edwards by name is a very energetic chap and pushes well forward with the unit.\n","34":"\n\nWe moved back today to a place near Les Menil after being relieved by the 51st\n\nAust. Battalion\n","35":"\n\nIt rained heavily all night. The men \nt\n in the trenches had a cold wet night. \n\nLieut. Steber and myself went for a walk into Peronne and crawled about amongst cellars and up on to the ramparts from where we had a good view of the ruined town. We finished up with visiting our Y.M.C.A. as a branch had been established there also. We bought some biscuits and were given some magazines to take back to the Battalion with us.\n\nMajor Kerr has very kindly sent along a commendatory letter to the C.O. here about\n\nmy work with the 60th Bn. as Signalling Officer. I have obtained a copy. Gen. Elliott has also added a few words to the letter.\n\n11th\n\nI have been appointed Sports Representative for this Battalion. The weather at present is decidely unfavourable for sports of any \nsp\n sort. It may fine up a bit, later. I attended a meeting of Battalion Sports Representatives at 53rd Bn. H.qrs. at 5 oclock this afternoon. Major Lucas of the 53rd presided. He was commanding officer of this Bn. for a time at Villers Bretonneux in April last when a crowd of us were badly gassed.\n\n12th\n\nWe had our Sports Meeting this morning at 10 A.M. Major Trickey presiding. I was appointed executive for the Committee.\n\n13th\n\nWe commenced training though not for the Sports at which many of the men were very much disappointed. I spent all the afternoon making a football ground, clearing it of rubbish and filling in shell holes.\n\nLieut. Albert Smith our Transport Officer has just received word that his pass has come through for Australia. He is highly delighted. He came away in the 2nd Bn. the same time as myself on 18th October 1914 and has a wife and family in Aust.\n\nWe witnessed a thrilling sight about 11 p.m. The sky was clear and the moon and stars had a look down at us for a while Several hun bombing planes came over head and about a dozen searchlights were at once switched on to them. The efforts of the anti aircraft guns to bring them down was futile, but one of our own planes went up and after signalling to our anti aircraft guns to keep quiet he dived at \nthe\n one of the Fritz ‘planes and brought him down in flames. It was a great sight and the boys gave a cheer and yelled with\n\ndelight. The hun airman brave as he may have been received no sympathy. We prepared for bed but the droning of powerful engines was again heard. We went out hoping to see another display of lights and skilful work by our own plane and were not disappointed. In less than a quarter of an hour we saw another one of the raiders coming down in flames. Again a great cheer broke out from the boys and this time we all went to bed and were not again disturbed during the night.\n\n14th\n\nA wire has been received saying that poor old Bill Casimir had died of his terrible wounds.\n\n15th\n\nThe Bn. played off a couple of \nthe\n its football and cricket matches this afternoon.\n\nAn enemy aeroplane came over flying at a great height and knocked down a couple of our observation balloons in flames. The two observers floated off with the breeze hanging on to parachutes. It must \nmust\n be a sickly sensation and is one of many incidents of its kind of daily occurrence. One of our planes brought down five enemy balloons not\n\nlong ago and the enemy balloonists had in their turn to jump out with parachutes.\n\nBoxing was commenced at the Bn. Stadium this evening between \nthe\n several competitors from the 55th Bn. and three from our own. They were only scratch \nmatches\n contests but provided a good hours entertainment for a large crowd of officers and men from both Battalions.\n\n16th\n\nA beautiful day. The weather seems to have taken a tumble to itself.\n\nGood news from both French and American Armies. Gen. Pershing has made his \n\nfirst big attack with the 1st American Army in conjunction with the French and they have wiped out the St. Mihiel salient and recaptured a great number of villages which the Bosche has held for over four years. Tanks participated \nlar\n and assisted largely in clearing up the old first line of trenchworks. It was a limited objective stunt and was highly successful.\n\nCricket and football matches were carried on this afternoon.\n\nEvents for the Bn. Sports were decided by the Bn. Sports Committee \nthis\n\nat a meeting held this evening at 7.30 P.M. It was decided to hold the Bn. Sports on","36":"\n\n18th\n\n1st and 4th Aust. Corps attacked again this morning. The 1st were extremely successful reaching all objectives in good time, taking over 2000 prisoners and 28 guns. The 4th were not so successful but did well. Good news from French, British and Serbian fronts. Our Battalion Sports were cancelled today on account of bad weather. We have decided to hold the Battalion Sports tomorrow. An elaborate programme has been prepared for \"\nthe day\n\". The poor old Secretary has been going like blazes to prepare programmes etc. Invitations have been\n\nsent to all other Bns. in the Brigade, Brigade H.qrs. and the Brigadier and the C.O. 60th Bn Most terrible of all catastrophies nearly happened tonight Names \nfor\n of all 1914 men were \nto\n submitted today to Bde. H.qrs. and mine was omitted somehow and it was only by a streak of luck that I managed to have my name sent in at the eleventh hour. Lieut. Upfold saved the situation by asking accidentally if I were a 1914 man.\n\n19th\n\nThe Battalion sports have come off at last and were a pretty good success The General attended with his Brigade Staff.\n\nThe Commanding officers of 53rd 55th \nand\n 56th and 60 Battalion attended also. Captain Joe Gleeson and Major Tom Kerr came along from the 60th \nSome\n A number of our fighting ‘planes gave another exhibition of flying above the crowd and waved and yelled from a height of only a few hundred feet. These beggars thoroughly enjoy \nthemselves\n themselves in the air.\n\nA large group of Hun prisoners passed within a mile of the sports Ground captured by the 1st and 4th Divisions this morning. Our boys are well established\n\nin the Hindenburg Line once more.\n\nOne of our bravest and cleverest Colonels walked into the Bosche Lines sometime early this morning whilst reconnoitring beyond the outposts. The Bosche Battalion who took him prisoner were \naf\n soon afterwards captured by our boys and their Colonel confirmed one of his Company Commanders statement that our Colonel had been taken prisoner \nha\n that he had been wounded slightly and that he had refused to give\n\neven his name when asked for information by the Bosche Intelligence Staff. I should not be at all surprised if this Colonel of ours (who is C.O. of one of our Machine Gun Companies) \ndid not\n were to attempt an escape as he is absolutely fearless. \n\nWell to return to our sports. The Horse race was the last event. There were 9 entries and the Colonels Horse won by about half a length with the Generals horse second. I think everybody is very pleased with the whole show especially the boys. The winners of any of the \n\nevents are to receive \ngood\n substantial prizes.\n\nMany cryptic remarks were passed by the diggers on different \na\n incidents of the day.\n\nIn the officers Race Lieut. Bach of ‘B’ Coy. came first and fell over the tape at the finish and hurt his arm. One of the boys poked his head over another chaps shoulder and said \"They can’t stand much can they?\"\n\n20th\n\nWe played the 53rd Bn. at cricket today and were defeated by 9 runs scores being at the conclusion of the match 53rd \n80\n 70\n\n54th Bn. \n7\n 61 runs. Col. Marshall played in our team and did very well. A couple of our best men were very sore and stiff after yesterdays \nfight\n sports. It was a good lively match and elicited a good deal of excitement towards the finish. The Daily Mail has a couple of fine headings for the Australians again, for instance – Huns counter attacks crushed by 3rd and 37th Div. (English) \nAustralians go farthest\n. Another heading says – Non-stop Australians and gives a great account of the\n\nexploits of the 1st and","37":" Australian Divisions. Our chaps are extremely popular in England as fighting men but are still \"socially impossible\", though the English people do all in their power to give any who happen to be over there a real good time.\n","38":"\n\nH.Q. played ‘D’ Coy. Rugby League this afternoon. Ended in a draw. H.Q. also played ‘C’ Coy. at cricket and won scores being 140 runs H.Q. 37 ‘C’ Coy.\n\nA good display of boxing should have been witnessed but one battalion failed to send along their competitors and rather made \nter\n the affair\n\na \"dud show\".\n\n22nd\n\nRotten news. It has been on the cards for some time now that the 54th Bn. should be broken up to reinforce the other Battalions. The crash has come at last.\n\nThe colonel called a meeting of all officers and \ntold\n gave us the \"dinkum oil\". He was very much upset himself over the matter and considering that he has \nbeen\n commanded four battalions up to the present date he must feel \nthe f\n it keenly. A wonderful leader a good comrade and thorough sport Colonel Marshall is and always will be one of the most popular\n\nofficers in the A.I.F.\n\n2.30 p.m. All companies were paraded and the news broken to them. The Battalion has to be split up amongst the other three battalions in the","39":" Bde. and the men had to be allotted as evenly as possible. The men were all asked on parade which of the other three Bns. they would like to go to. Some stated that they would like to go to the 56th as the C.O. is to go to that Bn to take command, but the majority of the Battalion refused to state what Bn. they would \ngive\n go to and further stated that they refused to go to any other Battalion.\n\nI remember in Egypt at Tel-El-Kebir when the \ny\n 2nd Bn was split up and I was sent to the 54th never had I felt so miserable or friendless. After going through all the training with the old 2nd Bn. at Mena through the Gallipoli campaign and then to be cast into another unit like a derelict ship at sea. It was a rotten business and caused many good men to go to \"the bad\" one in particular whom I knew very well. Dick Carley by name.\n\nMy sympathies therefore \nwere\n are with the boys, but duty must be done and the\n\nmen are simply being allotted by the company Commanders to the various battalions. The men are all standing together like good Australians and I admire their spirit but of course they are quite wrong in taking up such an attitude I am looking at it from an officers point of view of course.\n\nAll officers have \nto\n already been allotted by the Brigadier \nI believe\n and I am to go to the 55th Bn. I have a very shrewd idea that the Bde. Signal Officer is responsible for this as they require a Signalling Officer in that Battalion However I am booked\n\nfor a trip home to Aussie so I don’t care a damn.\n\nThe men all held a meeting about 5 p.m. to discuss the matter and decide what they should do. It rained heavily all the while but the meeting lasted a full hour out in the open near the Stadium. After the meeting a deputation of ","40":"\n representatives of all Coys. waited on the C.O. to put their case before him. I asked the C.O. what their case was and he told me that the men took a reasonable view of the whole affair but that they did not wish to be broken up without a \nprotest\n making a protest.\n\nCaptain McNabb of ‘A’ Coy. Q.M.S. Macdonald and two other N.C.O.s all 1914 men are to leave for \"Aussie\" tomorrow morning.\n\nCapt. McNabb was carried home on the last night of his stay with the 54th Bn. well oiled and properly stunned after making a futile effort to pummel the old Doc’s head and \nlosing\n winning 12 francs at poker.\n","41":"\n\nThe Battalion was formed up on the Battalion \ng\n parade ground and addressed by the Colonel and later on by the Brigadier (Gen. Stewart). He could tell us nothing beyond what we already knew and\n\nsympathised will all concerned. The Colonel then told everybody to be prepared for the break up today or tomorrow and the parade was dismissed. The other Battalions in the Brigade sympathise with us deeply as \nit\n they realize it would have been equally hard for their own bns to be split up like this. Most of the boys look at it in this light too though of course it is no consolation to them. I feel like a wet rag myself.\n\nCapt. McNab who is going to Australia on the 27th of this month paid us a farewell visit last night got well oiled\n\nand amused everybody for about three hours being finally carted off by Capt. Benson to the Reinforcement camp.\n\nA big percentage of all officers in the Bn. came across to H.Q. and associated for perhaps the last time – certainly the last time in the history of the dear old 54th Bn. The Col. and Jerry Upfold engaged in a little playfulness with the gloves. Lieut. Alex Bates, M.C., D.C.M. came along about 10 p.m. \nab\n having returned from the Training Battalion in England. Toby Barton returned from an Infantry School where he had earned the reputation of one-hit Barton and Lieut. Agnew returned from leave.\n\n\"Peace and quietness reigned about 12 \np\n midnight\".\n","42":"\n\nA\n The companies were paraded under their respective company commanders at 10 A.M. and the men told to move off to their respective battalions but not a man budged an inch. They refused to recognise any other Bn for themselves \nf\n but the 54th. The C.O. therefore called a muster parade and told the men that their efforts to reform the Bn. would be fruitless and asked representatives from each company to \ncome\n go out to him and state their reasons for not obeying orders. After a little talk with these men the C.O. advised them to rejoin\n\ntheir companies and ask the men if they would go to the other units straight out. The reply was a unanimous \nNo\n. The Brigadier came along and addressed the Bn. again and again advised them to obey orders but to no purpose. The Acting Divisional Commander then put in an appearance and also appealed to the men to go over to the battalions to which they were allotted pointing out the futility of their present \na\n course of action. Still no response from the men.\n\nThe officers were called out and dismissed after the general had gone, and ordered us to fall in with the men\n\nat 2.30 p.m. The behaviour of the men throughout was extremely good. They are quietly determined to carry on with their present attitude. They say that they are willing to go into \nthe\n a fight tomorrow if they are allowed to go as the 54th Bn. but they absolutely refuse to \ngo\n fight with another unit.\n\n2.30 p.m. The men paraded but still refuse to budge. The Brigadier came up again and tried to detail the men off himself but \nto\n nothing doing. The N.C.O.s were asked to volunteer to go and some went and a greater number didn’t. The officers were called out and formally\n\ntold off to their Bns. by the Colonel himself and we were asked to report there immediately which \nall\n we all did. That is how matters stand up to the present. How long the men will hold on to their present policy nobody \nwill\n can say.\n\nIt has been one of the most beautiful days of the year. Something big is doing up at the front. Americans are being pushed in up here in big numbers and it looks as if some of the A.I.F. will be having another say also shortly. \"Blast the flamin’ war.\n\nWe late 54th officers were welcomed into the 55th Battalion officers\n\nMess tonight in the old style, though the welcome was a dry one, which was just as well perhaps.\n","43":"\n\nThe 53rd Bn. held their Bn. Sports today.\n\nOur boys still on strike.\n","44":"\n\nThis morning I watched the boys of the 54th that is the strikers as they might be termed hold a battalion parade under the command of a full blown private and they behaved splendidly. Bde sports were held this \n evening\n afternoon and went off O.K. I was assistant starter and bawler out until my throat got sore when \nthe\n Major Lucas took on the job. A \nn\n despatch came along about 5.30 p.m.\n\nordering all 54th Bn. officers and N.C.O.s to rejoin their unit and reform the Bn as soon as possible as the Div. Commander decided that we could not go into action without them and the Div. has to cooperate in a large attack. Great news from Palestine, Macedonia and the French Front.\n","45":"\n\nThe boys have had a win though we are assured that is only a temporary \nly\n arrangement. However that may be we are going into action as the 54th Bn. The good old 54th. Every body is delighted. The men are taking it \nmore\n very soberly though.\n\nI was sent down to Bde. H.Q. to attend a lecture given by\n\na tank officer. It proved to be a rather uninteresting lecture but a useful one. We are to move to Hervilly tonight at 6 p.m. a distance of about 10 miles. In less than 24 hours this battalion has been re-equipped ready for action. Everything is swinging again as if nothing unusual had happened. \n\nAfter a rotten march we arrived \"somewhere in France\" and told that this was our billeting? ground. Fortunately the night was a fine one otherwise we would have had a rotten time. Mr. Steber who left early \nthis early\n this morning with an advance party to arrange\n\nbillets? had done wonders with his small party in the way of putting up shelters and making pozzies. Yanks are very numerous about here but considering that we are to do a ‘hop over’ with them this not so surprising.\n","46":"\n\nIt rained like blazes today. The C.O. and I went for a stroll to Bde H.Q. in Hervilly We had an \na\n interesting yarn with some artillery diggers on our return journey. We saw a lot of anks in Hervilly They appear to be a very likely looking lot.\n","47":"\n\nWe moved forward in a heavy ground mist and smoke barrage. The 30 American Div. attacked and swept through the\n\nHindenburg Line about day light and had passed through the town of Bellicourt by about 8 A.M. The attack was preceded by a horrific bombardment. Some God damn shootin’ gallery right enough. Unfortunately the ground mist which \nhitherto\n had been of friendly aid in the past only served to confuse the Yanks as it was scarcely possible to see more than a few paces ahead of one. We are reserve Bde to our Div. and wandered in gaily amongst traffic of every description finally wandering into a host of hun shells which put us to rout to \na\n the cover of some trenches close by. Tanks were scuttling along. Guns and limbers were \n\nhopelessly mixed up on the \nBlack Road\n and ye good old footsloggers plugged along through it all. One very noticeable feature of this attack was the very few prisoners which came back and when an odd one did hove in sight he was usually guarded by at least half a dozen ferocious Yanks. Some how things didn’t seem to go right and I wondered if for once the mist and smoke clould which our guns had put up were to be our undoing. My surmise was partly correct. As we neared the town of Bellicourt we found batteries hung up on the road and traffic\n\nof every war description sitting tight when they should have been moving ahead. Nobody not even the Yanks themselves seemed able to \ncab\n give a coherent account of the \nthe\n situation ahead! We saw a great many parties of the Americans going back to where they had started without officers and very few N.C.O.s. Asked how things were up in front and where they were going to they replied: Everything gwan orlright \nwe\n but we had our Captain and our two Lootenants killed and we guess we’d better find our Regimental Headquarters. This sort of thing was not exactly encouraging to supporting\n\ntroops. A large ridge runs round just in rear of the town of Bellicourt and we wondered if this had been cleared by the Americans or the enemy. We were not for long in doubt. A few tanks began to move across our path and these moving masses evidently caught the eye of some hun observer Before we could wink a terrific salvo of shells fell amongst the column wounding only one man. As we were directly in the line of fire we judged it best move to the cover of some trenches to our left and promptly moved.\n\nWe remained in trenches\n\nall day and came in for a good deal of attention from Fritzy’s \nheav\n heavies. Lieut. Twomey had a leg blown off, Capt. Shaw was wounded in the face and Lieuts. Robinson and Gilligan were also slightly wounded. Sergt. Major Redding a very old identity in this Bn. was severely wounded He was an extremely capable N.C.O. and his place will be very hard to fill.\n\nAbout 4.30 P.M. I went with the C.O. to see the Commanding Officer of the right supporting Battalion (Col. Street) for the purpose finding out the position of things in the line and also exactly where the line now ran\n\nWe lit fags in the open and walked on leisurely commenting on the disconcerting state of affairs existing. Suddenly a \"toute sweeta\" (77\") shell fell near. It was swiftly followed by a second and third each getting nearer to us. The C.O. looked at me and remarked that these were evidently meant for us. I felt quite sure that they were and said so. We made a break for a large shell hole and waited until \nthe\n Jerry had satisfied himself that we were blown to atoms and then dived into a trench. These little sprints always find a fellow’s weak spots.\n\nWe reached the","48":" Bn. H.Q. and saw Col. Street. He was unable to tell us anything of a definite nature but stated that he would be able to do so before the end of the day. He told us one thing which greatly excited our curiosity namely the existence of a very wonderful tunnel. We decided to have a look at it and were astounded at what we saw. However this is a story \nof\n on its own. Returning to Bn. H.Q. we passed a tank officer lying on a stretcher in a trench. He had been very badly burned all over. Evidently his tank had been knocked out and set on fire. We carried him\n\nout and after some trouble managed to get some Yanks to take him on to a dressing station.\n\n12 midnight\n The C.O. received an urgent message to report to 53rd Bn H.Q. to attend a conference. He trudged off through the mud slush and rain and pitch dark. \nto\n He returned about 2.30 A.M. and had a game of cards. The rations having arrived during his absence he had a good meal and turned in after a very strenuous and worrying day after first informing all Coy. Commanders that our Bde. was to do a hop over, but that our Bn. would not as at first intended be one\n\nof the attacking battalions. The Yanks have made a hopeless mess of things, though perhaps we should not be too hard on them as they \nwere\n are inexperienced at the game and the mist baffled them. Towards evening a strong cold wind blew up from the South West and brought with it a miserable drizzle which continued nearly all night.\n","49":"\n\n12.30 A.M. All snugly rolled up in Blankets and waterproofs when the adjutant Lieut Harrison woke everybody up and told us to prepare to move as the Bn. had at last bought a fight and we had to be in position\n\nfor attack on the left of Nauroy by 6 A.M. sharp. As usual on all occasions in the line when a \nBattalion\n C.O. received an order affecting the \na\n movement of the whole Bn. Coy. Commanders were called to report to Bn. H.Q. as soon as possible. They came along from their dug outs in the slushy trenches with a look of confidence and determination in their faces, knowing that such a call meant a battle ahead. A company commanders lot is a hard anxious and usually a thankless \nta\n one. Detailed instructions were given them by the C.O. as to the\n\norder of battle, zero hour, \nbarra\n barrage, what the objective was and what had to be done when the objective was reached. The amount and nature of equipment to be carried by each man and pack horse and a rationing scheme was decided on. Guides were to meet our companies \nfro\n (supplied by the Battalion \nfrom\n on whose front we were to attack from) at a certain spot in Bellicourt and guide the Bn into position. Company commanders were then asked if they had any suggestions to make after which they left to issue their own necessary\n\ninstructions to their \nof\n respective companies. H.Q. reached their new position about 5.30 A.M. We passed the Coys. waiting for their guides on the outskirts of the town at about 5.15 A.M. Three quarters of an hour to zero \ntime\n and the attackers not yet in position The C.O. with \nfo\n his usual foresight and quick perceptibility promptly guided them into position himself. He had scarcely done so when our barrage came down and the men hopped off the tape. The morning broke clear and fresh. By 7 A.M. our our boys were on their objective 2000 yards ahead. Very few prisoners were taken for the \n\nreason that very few were seen. \nW\n Most of the few huns who were holding the line made a clean get-away when our barrage came down. It was a very successful little stunt. If the Bosche only knew of the small numbers of his \nat\n persecutors he would never retire again – until this same small crowd came at him at again. Our casualties were extremely light about 30 in all; two men only being killed and these by our own barrage. \n\nWe are now well away from the battered \nand\n shell torn barbed wire \ncountry\n Hindenburg Line area. The country ahead presents\n\nan aspect of peace and quietness. A gruesome story of Hunnish atrocity is to hand from some of our officers. For some time past it has been alleged \nin the\n by certain English papers that the germans have been using their dead bodies \nas\n for the purpose of extracting fat from them which commodity, it is commonly averred to, is \nthe\n extremely short in Germany. Our people say that they came across \nsuch a\n a plant in a tunnel in Bellicourt which they declare must have been used for this purpose as dead bodies lay around a chopping block two boilers\n\none with a man in it and a number of buckets of fat close by. Two officers in this Bn. had a look at this spectacle to satisfy their \nselves\n own curiosity and also if possible to settle one way or another the controversy on the subject. Both differed in their views on the matter and it still remains a matter for much argument.\n\nNews has just come along of Bulgaria’s unconditional surrender to the allies, under the French General, General D’Esperes. The first link of the enemy chain is broken and in such a spot as to \nthrow\n leave the remain-\n\n-ainder of the chain in \nto\n a \ndangerous\n very weak position.\n\nGen. Allenbury has wiped out the Turkish Army \nat\n in Palestine out of existence The Allies are advancing along practically the whole of the western front. The Belgians with Gen. Plumer’s","50":" Army have made a very big advance up North taking many prisoners and guns. So far they have reached Roulers which town we \nare\n were only able to see last year from Passchendaele Ridge or on the map. The last six months have been momentous ones but the last week things happened \nlike\n with lightning suddenness. Turkey is\n\nexpected to \"throw in the towel\" any old time now. Austria will be next and then we shall have the Huns to deal with alone. The Japanese are moving swiftly over in Russia and have seized many positions of strategic and \npr\n tactical value besides many prisoners and \nso\n much booty.\n\n2nd\n\nI went forward with Col. Marshall to have a look at our new front line. Everything is in order up to date with the exception of the rations For some reason or \nthr\n other they did not turn up last night and as nothing has been heard of our Quarter Master (Capt. Hunt) since \n\nlast night we are afraid that he has been wounded or perhaps worse whilst returning from Bn. H.Q. to the transport lines.\n\nReturning to Bn. H.Q. the C.O. began messing about with bombs which the Bosche had left behind.\n\nAnother attack is pending on this front.\n\n3rd\n\nThis morning \nabout\n at 06.05 A.M. \nthe\n our artillery put over a heavy strafe on the hun positions and the 2nd Aust Division passed through our front line and attacked in the same manner that we attacked on the","51":" They were equally as successful but suffered slightly heavier casualties.\n\nThe C.O. and I were watching the barrage and it was some barrage. The huns retaliated fairly heavily. The \nhuns\n row caused by a few hundred guns barking and the shells exploding caused a happy devilish sort of thrill to run through \none\n a chap It was a fine morning, the ground was firm and the \nar\n air nippy. I felt like \"hopping over\" myself?\n\nWe left our spacious Head Quarters about 7.15 and went back to a position in rear of Villeret as Corps Reserve. This is now the orthodox method of being relieved from the front line in the A.I.F. at least.\n","52":" p.m. Turkey has surrendered. It is extremely welcome news. We are now playing the Hun \ns\n and his Allies their own game – namely crush the weaker adversaries first. Both Bulgaria and Turkey have been thoroughly thrashed. Gen. Allenbury is the leader of the Victorious Army in Palestine which is entirely British. On top of this is the good news that we are to go out of the line for a long spell.\n","53":"\n\nWe marched back through beautifully undulating country to our recent billets near Le Menil. It was the best marching day which I have ever\n\nknown and we covered the distance of about 20 kilos at an average pace of 114 paces to the minute. Capt. Joe Gleeson of the \nlate\n 60th Battalion has arrived to take over duties of adjutant for this Battalion.\n","54":"\n\nLt Wark & I went into Peronne on bikes to the C.F. Canteen to buy a few luxuries We saw a great crowd round an old dilapidated house in the main street waiting for the late paper which contained the news of Turkey still being in the fray and not knocked out as reported by our own military people a few\n\ndays ago. Peronne is now a very busy military centre. Plenty of trains and sidings and full of soldiers of England Ireland Scotland Wales Australia Canada \nand\n America and France. It \nh\n always has been a big centre of activity and it is only right that such a fine old city should come into its own again. It was worth fighting for.\n","55":"\n\nWe marched down to Peronne station to the lively tunes of a first class Yankee Military Band and entrained about 10.30 A.M.\n\nAfter a very tedious train journey we arrived at Oisement where we detrained and did a sprint of a mere 12 kilos to our present quarters here in the little town of Tours. It was about 12.30 when we arrived, raining and blowing a bitterly cold wind. Mr. Steber had a heavy task billeting the Bn on his own. It is a very thankless task and requires a good deal of common sense and patience both of which virtues this very worthy Officer possesses to an exceptional degree.\n","56":"\n\nUnable to find a billet last night Joe Gleeson\n\nand I camped in the bar room of an estaminet, the old ladies kindly providing us with blankets. They were very good to us when we arrived giving us a hot drink and attending to \nus\n our little needs late into the night until we all retired somewhere.\n","57":"\n\nI had a look round the men’s billets \nd\n today. They were somewhat cramped but were able to spread out and make themselves comfortable later in the day. Good billets are scarce as most of the sheds have been filled with the recent harvest.\n\nMany refugees from Amiens and Abbeville are living with their children in filthy hovels being dependent on the inhabitants here for practically everything except I believe bread. Many of these poor people are extremely ill and our Doctor has \nd\n already a very large bakshee civilian practice.\n\nThis village abounds in apple orchards, the fruit of which is being gathered by the people for cider making. They are good eating nevertheless and better still for pies as every one in our mess can testify.\n","58":"\n\nI went for a pleasant bike ride through Rogeant and Moyenville this afternoon. The country round about is extremely pretty and peaceful. France must have been a happy land in pre-war days.\n","59":"\n\nIn accordance with Corps Orders received at Le Mesnil re the re \ndirection\n organising of each brigade \nof\n into only three battalions instead of four, the 54th Bn. were amalgamated \nto\n with the 56th Bn this afternoon. The 56th Bn. marched over to our village here and both Bns. formed up on the one parade ground as one Battalion.\n\nCol. Marshall \nis\n who is to command us spoke to us and then Gen. G Stewart came along and inspected each platoon, after which he also spoke a few words of encouragement to the Battalion. We \nafter\n then marched past the General at a salutingbase. It was a good turnout and then all appeared to be satisfied with this arrangement. The Bn. is to be known as the 56-4th Bn.\n","60":"\n\nTo a person of literary talent and abnormal powers of observation \nmight\n many things could be found of which to write really interesting accounts, but with\n\nmy poor abilities as a penman it is out of the question to fill in a space in this diary from day to day, therefore I find it nescessary to allow two or three days to elapse \nbefore\n when I am usually able to find some subject worthy of consideration in these pages.\n\nThe affairs of the late 54th Bn. having been successfully wound up, the C.O. asked for and was readily granted two days leave to Abbeville. He promptly disappeared in company with the Quarter Master Captain Joe Gleeson. His absence caused a \ncertain\n fair amount of \nue\n uneasiness in certain quarters, but he\n\nturned up \nthis morning\n safe and sound this morning and gave an interesting account of how he managed to hit Dieppe accidentally and helped \nthe\n a French lady in that fine city sweep \nup\n out a drain pipe and push a perambulator for some other woman. Having done both those jobs to his own satisfaction and, I have no doubt, to the satisfaction of the good dames themselves he proceeded to help some French yokels to load a cart with wheat or some other grain. The Yokels finding assistance so ready and cheap left him to do the lot on his own or as much as, for he avers that they did the grunting\n\nwhilst he did the lifting. His description of the Hotel Metropole in Dieppe was a vivid one and I have no doubt that \nt\n his experiences above mentioned were subsequent to his visit to the Hotel.\n\nHe was informed on his arrival back \nthe\n by the Divisional Commander that he had been awarded a second bar to his D.S.O. We were all very pleased to hear this and drank his jolly good health in sparkling champagne. The D.S.O. is awarded solely for \nyo\n great gallantry under fire. I think Col. Marshall has a unique reputation as a leader \"in action\"\n\nNothing of note has happened\n\nin the town and the only knowledge of life here is the news that a baby has been born two streets away and that two other children have died in another part of the town. To use a Flying Corp term we are having a \"dud time\" just now. No training to pass the time away, we are too far from any \nt\n main route to be able to \"lorry hop\" to any of the more important towns for a day \"or so\", no letters to answer and nothing to write about if we had. We are simply rusting. Fed-up-ness has set in. Papers contain flaring headlines \nof\n about the great war and whole pages of monotonous war news by the\n\nRenowned Beach Thomas, the Bulsh King. The Headline of most importance is – \"Wilson leaves it to Foch\", this in connection with the recent peace talk. This will most probably mean another twelve months of war at least. Sir Eric Geddes in a speech recently is alleged to have said that we want to be prepared for another two years of war at least. He is probably right but I hope he gets wet in the next storm that’s all.\n\nThe French papers two days ago contained a lot of talk of an armistice and \na\n the end of the war and as usual \nther\n their spirits jumped to a \n\ngreat height and just about cracked the glass I should think for they \"shouted\" all the \"domestics\" in the village wine and caiffe and did a lot of shouting in the literal sense. However they have since decided that the war will \"fini bientôt\" (finish soon) anyway. \nI\n have even gone so far \nto\n as to state in contradiction to my discretion that the war would certainly end soon and being an \"officier\" I am supposed by the worthy dame and her daughter to be able to see through all the ways of the wily hun and trick him. But my statement has been an ambiguous and a common one ever since the commencement of the war.\n\nToday I sat ? on a board of enquiry with Capt. Benson \nLt\n and Lieut Pollock to determine whether two men of this battalion (who have outflanked several stunts in an unsoldierly manner and have not since been seen) are illegally absent or not. After having \"run\" all our evidence to earth we brought in a finding which was to the discredit of both these birds.\n","61":"\n\nWith Lieut Dickenson and some old hands of the","62":" Bn. I had a wild day in Abbeville at the officers Club. I think this is the best Club in France. I finished up by walking home a mere biscuit toss of 18 kilometres. I reached my billet\n\nat 2 A.M., noticing whilst entering that a light was showing in Madame’s room.\n","63":"\n\nI was accused this morning by Madam and her daughter of being \"zig-zag\" last night. Apparently this was the only way in which they could account for my late arrival \"home\". I stoutly denied the charge hem! but am afraid I did not convince mine host. Today is the anniversary of the Embarkation of the","64":" Bde. \nfrom,\n at Sydney. I am therefore entitled to wear 1 red and 4 \nf\n blue service chevrons which the village tailleur very neatly stitched on for me.\n\nIt is fearfully dull in this village. No amusement of any kind, no sport and the weather is turning very wintry. It \nwas\n must be extremely boring for the men. I went over to the Bn. Hd.qrs. this morning and Major Cameron spoke of having a concert party and sports days but \nat\n this is practically impossible with the men scattered in billets in different villages as they are.\n","65":"\n\nThe sun having condescended to shine out once more upon this dam-p \"city\" I feel inspired to write a few more lines. Refugees are numerous about here and the sights some of them present are pitiful.\n\nFor the past week a young woman dressed in tatters and slippers has been trudging about in the rain through the wet and muddy streets with a very young infant in her arms begging for food. She has paid regular visits to our Mess for food and she has not been denied I am pleased to say What soldier could? The last time I saw her was yesterday morning and she had somehow \ngage\n acquired a perambulator for her child and seemed a good deal happier than on other days. Several times I have spoken to her and she has answered in a voice so low and so full of misery that I have been unable to \"compree\"\n\nher reply. A kind word goes a long way \nto\n towards raising a sinking heart at any time. A little help goes considerably further. This girls eyes have shown a world of gratitude when I have merely spoken to her. The misery of these poor creatures is far beyond the comprehension of \nene\n even we who are amongst it. How ignorant of France’s troubles must those we who are \nfour\n thousands of miles across the \nwo\n sea. How little must the people of Australia know what their good work for the French people \nare\n is doing! Many of these people have been rendered so wretched and utterly miserable by the war\n\nthat they do not seem to care whether they live or die. They accept help \nwith\n passively, almost with indifference. Little wonder. But the Boshe must be made to pay and pay very dearly.\n\nLatest news as to the effect that the hun has been cleared out of the whole of the Flanders coast district and that to avoid capture 15000 huns pushed into Holland and were promptly interned.\n","66":"\n\nPresident Wilson, the Allied plain speaker and hard hitter \nor\n in reply to Germany’s last peace note says that he will not carry on peace negociations with the present ruler and government in Germany and demands\n\nsurrender\n unless \nrepresentatives of the people\n are chosen \nby the people\n of germany for the purpose of discussing peace terms. This is a heavy blow at the prestige of the Hohenzollerns.\n\nNothing changes in this damp little village except the weather. Ten minutes sunshine perhaps then a dull misty atmosphere followed \nfrom\n by a drizzle. Occasionally one is lured \non\n out of doors without a rain coat by a bright blue patch in the sky, but before going many hundred yards that blue patch has mysteriously disappeared, completely changing ones outlook on life. A few preliminary\n\nsprinkles is a reminder that a shower is coming and before one can retrace ones steps to that raincoat or a sheltering barn one is considerably wet.\n\nThe people in this village are the most industrious of any \nof\n I have come across in France. No loafers are ever to be seen round estaminets and on street corners here. All hands from old grandpapa (if he be still alive and able to walk) \nrit\n down to the petit fil or garcon who have just left school, rise about 6 A.M. and toil out in the fields of mangelwurzels. All the marriageable maidens both\n\nfair and homely have to do their share of graft \nin the\n \"dans la champ\" and they are all or appear to be healthy and happy.\n\nMy hostess’s name is Mme Davergne. She is alone here with her daughter Mlle Clare who I have been given to understand has a fiancée somewhere in the \"tranchee\". Very likely he is \"swinging the lead\" many miles in rear, but that is of no consequence, so long as he is a la guerre. My batman George \nDavies\n has several times expatiated at great length on the wonderful smoothness of Mlle Clare’s apple face. George tells me that he \ng\n acquired\n\nthis interesting piece of information at the risk of her fiancee’s righteous anger who is many many kilometres away which probably accounts for George’s persistent attempts to indulge his little weakness. But it has been the custom \no\n in all the wars of the ages for soldiers to love, or take a violent fancy to some other poor devil’s girl and as Madame only laughs and calls him \na\n (George) a \"brigand\", why shouldn’t he keep up the custom?\n\nOne thing which has always puzzled me about the french people is that there is never any evidence that they ever have a bath in \nd\n spite of\n\ntheir shiny faces and otherwise clean appearance. This idea has been further strengthened by the fact that when, soon after arriving here from the line I asked for a tub in which to have a good old scrub down \nand\n the only available one was a half of a 123 litre barrel. Naturally I was going to bath in my room and placed the half barrel there for that purpose but Madame protested against such a crime so vigourously that I had perforce to use the large drafty barn adjoining my room as a bath room. I bathed therefore in much fear and trepidation lest\n\nMademoiselle Clare should at an unlucky moment come into the barn looking for eggs as a hen raised such a cackling at sight of me and Mlle Clare always made a point of inspecting the nests when a hen cackled. I finished and reached my room with my teeth chattering but thankful to have escaped without any embarrassment. However to balance any of the little failings here stated I must say that Madame is a good motherly soul and her apple dumplings are the finest I have ever tasted.\n\nWe managed to get off a \n\nBn. Sports Programme near the village of Guebil-Mesnil The 54th half of the Bn. carried off most of the events. \n","67":"\n\nInter-Company rugby football matches have been going on for the last week. On","68":" D Company team played A Company team at Rugby League and were beaten 9 points to 5. It was one of the most exciting matches I have ever seen and for an inter-coy. match was \na\n wonderful to watch. A Coy. team had the advantage in speed and combination otherwise \nbut\n the teams were evenly matched. The spirit in which it was played was really that of the\n\n54th Bn. against the 56th not as an inter Company match \nwas\n which probably accounted for a great deal of the noise made by the barrackers of both sides. \nIt\n As a result of the amalgamation of the two Bns. the 54th Bn. forms \"C\" & \"D\" Coys of the \nnew\n 56th Bn.\n\nAutumn is gathering her carpet of leaves. All day long the brown and yellow leaves are fluttering to the ground.\n\nJust now the country is looking its prettiest I think. Yesterday I walked into the town of Fressenneville about (9 kilos) with Lieuts. Dickinson and Pollock of \"C\" Coy. Having quenched our thirst at\n\nan estaminet which Dick ‘wotted of’ they tried to persuade me to stay to dinner \nand\n but I refused and came home which I might add \nwas\n is a very unsportsmanlike thing to do \nbeing\n in the army. Having dined sumptuously at the mess I returned to my billet where I donned my slacks and best tan boots and set out through wind and slush to visit some friends of \nwho\n mine who had requested me to come along and see them, ce soir. Arrived at the ‘maison’ my friends jumped up quickly to receive me and I had the greatest difficulty to persuade them to sit down again. Indeed\n\nthey would not do so until I was comfortably installed in \na\n one of their best chairs. English hospitality is a scientific, methodical business but in France here it is part of their natural charm. This opinion is not based on the \nopinion\n incident just mentioned above but on – vast experience. Hem! Ahem!\n\nThe draftboard (the only form of amusement) having been produced I was challenged to a fight to the death by mine hostesses and in spite of my efforts to the contrary I managed to win four games out of five. Such unchivalrous conduct however is not becoming an officer\n\nand a gentleman of his majestys forces, therefore I \nprof\n propose making another visit in the near future with a view to allowing my fair opponents to have their revenge. And such is life in this village of Tours en Vimeu.\n","69":"\n\nTodays paper contains flaring head lines. Turkey has accepted the Allies very fine conditions for an armistice. Austria is in revolt and the Allies on the Western Front are advancing like wild fire and remarkable to relate the whole A.I.F. is out resting. There is every indication of of another big row in Russia being started. Germany I\n\nsuppose has a number of nice men over there giving valuable assistance. However Germany will be very small potatoes soon and then the Allies will be able to turn their attention to helping Russia solve her \ncountry\n problems. But how on earth are all their different ideas of right and wrong to be sorted out and all the idealists pacified? They are like \nly\n a family of badly spoilt children.\n\nGen. Sir Talbert Hobbs inspected our Brigade this morning The \"Digger\" in a long speech delivered in his characteristic halting way mentioned that the war was going on alright and that we would probably be off up the line\n\nagain in a few days after which he galloped off with his long retinue of underlings stringing out in rear, the whole outfit being followed by rude epithets from \nthe\n diggers.\n","70":"\n\nI have to hold myself in readiness to proceed to a gas school.\n","71":" ","72":"\n\nI received orders this morning 9 oclock to pack up and get to Div. H.Q. at Oisement (about 9 kilos away) by 10 oclock with my valise and batman. Being Sunday morning & having nothing to do I was still in bed when this news came along. However I managed to reach Divisional H.Qrs. about 12 noon where a red-decked and apparently greatly concerned Staff Captain asked me many\n\nrude questions. The party with whom I was to \ng\n have gone away with 10 A.M. having left I was allowed to crawl into a lorry which was taking a merry hockey party (of \nmen\n Div. H.Q. Staff) into Abbeville to do \npla\n mortal combat with some nurses there. Lieut Tuckerman of our Bn. was a privileged member of this team I noticed and he was quite certain that he would be opposed to an interstate player and had regards for his shins therefore. We met the poor old donk. on the way with my valise and I had the valise thrown into the lorry and we proceeded on our way I hoping to pick up my \n\nfaithful George on the way. We did catch sight of him but afar off. \nand\n Too far alas to have asked the party to wait lest the fair ones be kept waiting on the hockey ground.\n\nArrived at the Railway Crossing in Abbeville willing hands threw my valise out for me (very willing hands) and I left it on the side of the road, charging a bespectacled tommy to guard it with his life, which he after many salaams swore to do.\n\nI saw an R.T.O. who gave me a movement order for St. Roche where he instructed me to change trains for Montieres. He also told me to be at the passenger station at\n\nat 7.30 p.m. and I would \nweew\n be able to catch a troop train. I accordingly hired another Tommy to cart my valise through the main street to the station. I swore never to travel with such a bulky valise again. The confounded thing seemed to get bulkier every time I looked at it and so I was extremely pleased to be able to dump it in \nto\n the Cloak Room where I was unable to see it.\n\nI dined in highly respectable society at the Club and wandered to the station at 7.30 only to find that my train was not scheduled to ‘arrive’ until 8.30 p.m. It did eventually turn up\n\nabout 9.10 p.m. and we pulled out about 10 p.m. The carriages were packed with troops so I squatted down on my valise to leeward of a broken window. Arrived at Romescamp I began to ask questions and found that the train had passed St. Roche without stopping and further, that it was not \nbeen\n even \nsupposed\n to stop there. I rained curses down on the heads of \nthe\n all the R.T.O’s in France and dragged my valise forth in the mizzle \nwhere\n and dumped on the side of the line.\n\nRomescamp is a large siding and is used by the military authorities as a \n\nstaging camp for troops passing from North to South and vice versa. I managed to find two stalwarts who brought my valise to the Kit Room and I turned into a bunk in the Rest House but failed to sleep. George’s failure to turn up worried me considerably as I knew he would be tired after his walk into Oisement and not finding me there might \nbe\n begin walking to Abbeville after me a distance of about 25 kilos.\n\n4th\n\nI arose early, had a clean up and breakfasted in company with a couple of English tank officers and a happy Canadian Medical officer who said he\n\nhad been attached to our 4th Div. for some time and had never enjoyed himself better in his life, which was as it should be. I talked the R.T.O. into giving me an Ordre de Transport with which to travel by the French passenger train to Amiens. Once more the valise called for head work as the station was about a mile away. I managed to get another poor innocent to cart it down for me however.\n\nThe train was about 20 minutes late but we got along to Amiens in good style arriving about 2 p.m. I had given George up for lost or at least had hoped that he had gone back to the Bn. but\n\nwho should I meet on pushing my way through a crowd of leave men but my one and only He had walked into Abbeville on the morning of the 3rd after having missed me at Oisement and had covered a total distance of about 35 kilos on foot and yet managed to reach Amiens as soon as myself. He was very tired though.\n\nI had a good look around Amiens. It looked busier than ever it did in the old days. It is estimated that there are well over 20,000 civilians back in the town again. Shops are all open \nagain\n and the streets are perfectly clean. Hun prisoners are being\n\nemployed in pulling down all the \nold\n ruined houses and clearing up debris. I had a peep inside the fine old Cathedral. It has not suffered as badly as I had thought or indeed as badly as it might have done. Workmen have repaired a good deal of the damage of course. Many of the beautiful windows have been completely shattered. Amiens will leave Abbeville in the shade as a commercial city soon. All the people have a business like appearance and are very business like in reality as I found to my cost. Everybody walks about briskly, not because winter is at hand for it has been a beautiful day, but from the pure joy of being back in the dear\n\nold city again. All are wearing a Parisian smile and so we must win the war.\n\nI reached the Gas School at Montieres here about 4 p.m. and found that I had missed one day’s \nd\n work and nobody was annoyed about the matter. Capt. Harrison a dear old soul and an extremely capable officer is the boss cocky here and he has an adjutant with a very aristocratic nose, and a german name. His nose shoots out from the eyes at an angle of about 120 ° and then drops \nsho\n almost due south to 180 ° or thereabouts.\n\nI have said that I had (through no fault of mine of course) missed one day’s instruction. This is slightly incorrect as we had to\n","73":" a tortuous march of about one hours duration with gas helmets on, commencing at 5 p.m. along pitch dark lanes through tunnels along trenches over improvised shell holes and through wire man traps.\n","74":"\n\nWe continued our training this morning, he of the aristocratic nose taking my squad. The taking of notes seems to be the chief item of interest and excitement during the periods of instruction. All of the practical work was familiar to me but the lecture delivered by Capt. Harrison contained a lot \ne\n of foreign matter with high sounding names. It was extremely interesting though.\n\nAustria is definitely out of the war now and the emperor has \n\n?8\/11\/18 fled.\n\nA notable feature of this war has \nthe way\n been the dethroning of all the emperors of our enemies in addition to the one-time friend and ally Russia. We need only to kick the Kaiser out now to complete the list and we shall probably not be long in doing that.\n","75":"\n\nGerman delegates are on their way to meet Marshall Foch in accordance with the terms laid down by the Allied Governments – viz Germany must plead for peace with Marshall Foch.\n","76":"\n\nThe German delegates were met at Houdroy by Marshall Foch and Admiral Weymiss\n\nlast night. The French people are highly elated over the turn of things. They all declare that terms for an Armistice have already been signed But they are always very optimistic under these conditions and will believe anything.\n\nWe had our final lecture followed by the exam. this morning and have the afternoon off.\n\n8th\n\nSpent the afternoon in Amiens with some pals. There is no amusement there as yet. I left the town by the 5.30 p.m. passenger train for Abbeville and we arrived about 7.30 p.m. rather a decent trip as trains are at present.\n\nManaged to secure a lorry which brought me out to St. Maxent and I soon reached Tours en Vimeu once again Unfortunately it was then about 12 midnight and I found the gate to my billet locked and another place where I did manage to enter the yard I was angrily refused a bed by an extremely irate lady who did not appreciate being dragged from her bed very late \nat\n on a clear starry Winter’s night. I managed to find a bunk in the Canteen however, thanks to the Corporal there (Burgess by name, and another man named Taylor.\n","77":"\n\nThe papers all say that we are to have the dinkum oil about the armistice on Monday morning at 11 o’clock as General Foch has given the Germans 72 hours in which to decide as to whether they will accept our terms or not.\n","78":"\n\nGreat excitement in the village. The fate of many lives is being decided by the hun slaughter mongers.\n","79":"\n\nThe Huns have been reasonable for once and have accepted fully the terms of the Allies for an armistice.\n\nIt is the end. Flags were hung in \n\nThe Kaiser and Little Willie have skipped across to Holland.\n\nthe village early this morning and the old church bell was rung heartily nearly all day, but as a great number of people have died in this village within the last couple of weeks from the dreaded Spanish Influenza, the joy making was not quite as keen as it might have been. It was quite keen enough for me however.\n\nI was walking past an estaminet from the open doors and windows of which great sounds of revelry proceeded and I was dragged into an excited, half intoxicated mob of froggies of all\n\nages and toasted with vin blanc and cigarettes. The old mairie here did a war dance and spluttered out the Marseillaise in company with several other beefers.\n\nI was slightly bewildered \nwith\n by the whole show but managed to get madame’s eye and pointed to the bottles. She compreed right enough, smiled largely and produced the necessary.\n\nI had a good look at the person who had forced me into this mess and found him to be an elegant sous-lieutenant of the French\n\narmy.\n\nI got out as soon as I could but not before he had extracted a promise from me to visit his home for a drink of coffee. Not knowing whether this entailed eating a dinner as well, to be on the safe side I had a large meal at the mess first but found to my horror on visiting my friend’s house that \nT\n he had a large dish of salad and boiled eggs for me to work on. I did justice to the whole lot nevertheless and now I must close this book.\n\nThe war is over and nobody quite realises it yet.\n\n"}}