{"Document Name":{"0":"Diary_0502","1":"Diary_0502","2":"Diary_0502","3":"Diary_0502","4":"Diary_0502","5":"Diary_0502","6":"Diary_0502","7":"Diary_0502","8":"Diary_0502","9":"Diary_0502","10":"Diary_0502","11":"Diary_0502","12":"Diary_0502","13":"Diary_0502","14":"Diary_0502","15":"Diary_0502","16":"Diary_0502","17":"Diary_0502","18":"Diary_0502","19":"Diary_0502","20":"Diary_0502","21":"Diary_0502","22":"Diary_0502","23":"Diary_0502","24":"Diary_0502","25":"Diary_0502","26":"Diary_0502","27":"Diary_0502","28":"Diary_0502","29":"Diary_0502","30":"Diary_0502","31":"Diary_0502","32":"Diary_0502","33":"Diary_0502","34":"Diary_0502","35":"Diary_0502","36":"Diary_0502","37":"Diary_0502","38":"Diary_0502","39":"Diary_0502","40":"Diary_0502","41":"Diary_0502","42":"Diary_0502","43":"Diary_0502","44":"Diary_0502","45":"Diary_0502","46":"Diary_0502","47":"Diary_0502","48":"Diary_0502","49":"Diary_0502","50":"Diary_0502","51":"Diary_0502","52":"Diary_0502","53":"Diary_0502","54":"Diary_0502","55":"Diary_0502","56":"Diary_0502","57":"Diary_0502","58":"Diary_0502","59":"Diary_0502","60":"Diary_0502","61":"Diary_0502","62":"Diary_0502","63":"Diary_0502","64":"Diary_0502","65":"Diary_0502","66":"Diary_0502","67":"Diary_0502","68":"Diary_0502","69":"Diary_0502","70":"Diary_0502","71":"Diary_0502","72":"Diary_0502","73":"Diary_0502","74":"Diary_0502","75":"Diary_0502","76":"Diary_0502","77":"Diary_0502","78":"Diary_0502","79":"Diary_0502","80":"Diary_0502","81":"Diary_0502","82":"Diary_0502","83":"Diary_0502","84":"Diary_0502","85":"Diary_0502","86":"Diary_0502","87":"Diary_0502","88":"Diary_0502","89":"Diary_0502"},"Date":{"0":"unknown","1":1932.0,"2":1933.0,"3":1934.0,"4":1935.0,"5":1936.0,"6":1937.0,"7":1938.0,"8":1939.0,"9":1940.0,"10":1941.0,"11":1942.0,"12":1943.0,"13":1944.0,"14":1945.0,"15":1946.0,"16":1947.0,"17":1948.0,"18":1949.0,"19":1950.0,"20":1951.0,"21":1952.0,"22":1953.0,"23":1954.0,"24":1955.0,"25":1956.0,"26":1957.0,"27":1958.0,"28":1959.0,"29":1960.0,"30":1961.0,"31":1962.0,"32":1963.0,"33":1964.0,"34":1965.0,"35":1966.0,"36":1967.0,"37":1968.0,"38":1969.0,"39":1970.0,"40":1971.0,"41":1972.0,"42":1973.0,"43":1974.0,"44":1975.0,"45":1976.0,"46":1977.0,"47":1978.0,"48":1979.0,"49":1980.0,"50":1981.0,"51":1982.0,"52":1983.0,"53":1984.0,"54":1985.0,"55":1986.0,"56":1987.0,"57":1988.0,"58":1989.0,"59":1990.0,"60":1991.0,"61":1992.0,"62":1993.0,"63":1994.0,"64":1995.0,"65":1996.0,"66":1997.0,"67":1998.0,"68":1999.0,"69":2000.0,"70":2001.0,"71":2002.0,"72":2003.0,"73":2004.0,"74":2005.0,"75":2006.0,"76":2007.0,"77":2008.0,"78":2009.0,"79":2010.0,"80":2011.0,"81":2012.0,"82":2013.0,"83":2014.0,"84":2015.0,"85":2016.0,"86":2017.0,"87":2018.0,"88":2019.0,"89":2020.0},"Entry":{"0":"\n\n \n\nMarcinelle\n\n","1":"\n\nUp at 7 a.m. and had breakfast with Harold Smith, Howell and G. Hughes. Then met M. Peters and he took us down to the mine at Marcinelle Nord near which there is an ancient Roman tumulus. At the bureaux of the mine we were presented to the chief Engineer who agreed to take us down. Went into cubicles and changed all clothes dressing in ones supplied by them. Rough shirts dungarees and neckerchief. To crown all a smart skull cap and a leather helmet not unlike our steel helmets in shape. Then drew miners safety lamps and went to the pithead. Here girls in breeches were slaving pulling trucks out of the cages and running them along tracks. For 10 hours daily (or 12) they work thus and get a wage of 3\/10. Crouched\n\n \n\nMarcinelle\n\n11\/3\/19\n\nup in the cage we descended the mine going down over a kilometre in depth. The cage went fairly fast and the first levels were wet and dripping. Reached the bottom at last and walked along the galleries. The increased atmospheric pressure caused a slight pain in the ears. The roof of the gallery revetted and struts had given in many places under the pressure. On small rails trucks were being hauled by ponies. The only light was from our lamps. After a long walk we found the heat so intense as to be uncomfortable and we came at last to the coal faces. The air full of dust and the miners crouched up picking almost naked and holding their lamps between their teeth one boy nearly nude buried waist deep in coal shovelling hard.\n\n \n\nMarcinelle\n\n11\/3\/19\n\nSweating black faces – an awful existence. Long hours & poor wages are causing intense dissatisfaction and unless demands are granted a revolution is promised after our Army is pulled out. Coming up to surface again discomfort to ears was again felt. Visited the engines – all electric and all made in Charleroi. All black we had a group photograph taken and then a good bath and glass of beer prior to saying au revoir. Spring is here. Today on the trees is the first green blush of buds. Walked up the street this afternoon and had a shave. The present strength of the Brigade is such that amalgamation into one big battalion is now the next pressing consideration. Evening went round to Jack’s billet and find him on the mend.\n\n \n\nMarcinelle\n\n12\/3\/19\n\nA mild springlike but dull day. To the 22nd and fixed up divers things and then round to see General Robertson at D.H.Q. where we made preliminary arrangements for the final winding up of the Brigade. Put in the morning completing the arrangements. G. Bailey having done us in the eye for 1000 francs I arranged to bring him to book at a Court of Inquiry. The afternoon was showery. Visited Charleroi & then trammed to Mont-sur-Marchienne where the 2nd beat 4th Div at football. Dined at Bde.H.Q and then did a round of the town where Mme Germaine was taking a walk. Called for some photographs and then went to Thewlis billet and then to the Officer’s Mess where I had a good talk to Frenyer and others. Tonight V.N. Moore was running a dance.\n\n \n\nMarcinelle\n\n13\/3\/19\n\nCol. G. Murphy presided at Court of Inquiry today re 1000 francs that Bailey cannot account for. Round at the 22nd there was nothing fresh doing. Made preliminary arrangements for commencing Orderly Room & for 6th Bde Battn tomorrow. After lunch went up round the streets of Charleroi and saw a rather amusing auction sale of army horses conducted all in French by an aged auctioneer. The sun shining today and all the trees bursting into bud – the very feel of Spring is in the air. It has indeed been a mild winter compared with those we experienced in the past. Spent the evening chez Mme Marcelle Bertrand and old Mme Crochelet was there – quelle affaire!\n\n \n\nMarcinelle\n\n14\/3\/19\n\nAt 9.30 addressed about 30 reinforcements on their duty to their Battalion and upholding its dignity and then wandered round to the Echo office. Colonel Geo. Murphy C.M.G, D.S.O was with us to lunch and afterwards came up to the University de Travail to see the finals for the Boxing Championship of the Corps. There were some good fights. At its conclusion General Rawlinson made a good quiet speech to the troops and said he was prepared to say publicly that the Australian Corps was the very best in the British Army. This naturally pleased the troops. At mess tonight we drank the health of the 6th Brigade as from tonight it ceases to exist after 4 years active service. Colonel Linton its first Brig. – myself the last. What changes. Tomorrow the 2nd Dvn Inf Group commences & the","2":" Bde becomes a Battn.\n\n \n\nMarcinelle\n","3":"\n\nLeft Bde.H.Q this morning and set up a new place called","4":" Bde Bn of which I am C.O. and Baldock","5":" is Adjutant. Yarned with Major Davis and mooned about doing nothing or less than that. In the afternoon corrected a good deal of Gormans History and then met Major Davis and went up to the Museum Anatomique up the town. These waxworks are ghastly & gruesome physiological show of sexual matters and the lifelike representation of maladies nearly make one sick. In Australia such a thing would not be allowed to exist for half an hour. One loses perspective here and it will be hard for us to get once more used to the strait laced ideas of Australia. Dined at the 22nd mess and afterwards took wine with Monsieur Cornil & went to bed at 11 pm.\n\n \n\nMarcinelle\n","6":"\n\nSunday. Did a little work and then met General Robertson in the Place. Yarned with for a while corrected some history and then dined at D.H.Q very well with the G. afterwards accompanying him to Thuinno where we saw horseracing and gambling. Great crowds bookmakers and canteens. A pleasant run back in the car and then had afternoon tea with the General before going to mess where Greenaway and Harrison entertained me with Weisbaden & Rhine experiences. To the Varieties theatre and saw a very good representation of Faust. The filthy public urination here is disgusting. In the intervals out in the street long rows of women fouling the walls in all shaded places and men doing the same.\n\n \n","7":"\n\nMarcinelle\n\nTook a walk round the cooks this morning and visited the Echo office and other odd places until lunch time. Dr Daniel then went over me for life assurance – a rather long operation after which we went up the town together and had some afternoon tea. Read and wrote until mess and then afterwards went to Dr Mathys to spend the evening. They seem truly a happy couple and we drank wine and coffee and ate biscuits & a tart. Here in conversation we discuss all sorts of topics that otherwise would be absolutely forbidden. They are fine openhearted folk full of hospitality and cannot be too kind. Gorman and myself have asked them to come with us to the Opera next Sunday evening.\n\n \n","8":"\n\nMarcinelle\n\nThe usual morning round except that I met little Les and inspected all his Lewis guns. An impressive sight this morning was the funeral of a Belgian soldier killed in 1914 & whose exhumed body was now being buried. First came our firing party with arms reversed followed by band playing Dead March in Saul and then altarboys crucifix and priests. The coffin was carried by Belgian soldiers and the came relatives and spectators. Church bell tolling all the time. After went up the town to try and learn dancing and made rough weather of a waltz. From there went to the Berlitz school and put in an hour with a detestable Belgian chap who teaches there. We mess nowadays at 5.30 which seems early and 7 pm finds it still light. Went and teased Little Les.\n\n \n","9":"\n\nMarcinelle\n\nAbsolutely damall to do. Went round and saw General Martin about quotas and other things and then wrote and read till lunch. After lunch had a bath at Charleroi station and then went up the town and met Tommy Roberts. Messed and then took a Berlitz lesson and went round and saw Bertrand. \n","10":"\n\nAttended a lecture by one sharp Victorian Immigration Expert in London and then went and saw General Martin about some odd matters. The afternoon read wrote and went up the street after mess taking a Berlitz lesson. The wooden sabots are in universal use here and are clumsy – the average price appears about 4 francs. Dancing is a hobby \nwhe\n with the troops now.\n\n \n","11":"\n\nMarcinelle\n\nThe usual round of odd jobs done during the morning and after lunch went up the town with Dr Daniel to take tea or rather chocolate and cakes at a pastry shop where the waitress and a demoiselle sitting in a corner were evidently in league at the oldest profession in the world. Had mess and then tore away to have a dancing lesson with a little Belgian teacher who must be sick to death of clumsy people. Then returning to my billet found any amount of papers for signing. Spent the rest of the evening talking to Beith and his French friends (Belgians) – kind hospitable people. There are said to be many of our chaps marrying Belgian girls but I have only signed one lot of papers. \n\n \n\n22\/3\/19\n\nMarcinelle\n\nOrders arriving for Davis to leave for England I took over the 22’s again tried a case at Orderly Room and put in a fairly busy morning. Lunched and with Gorman Scales & Selleck found Major Charlton A.T.C good enough to take us in his car out to see the 1st beat the","12":" Division at Chatelet. A splendid ground and a good day out. The first Divn proved altogether too good. Motored home in quick time and dined fixed up some papers and went to the pictures. Today we hear of all leave stopped again on account of English strikes and I am sorry all the more because I hear talk of the men getting rather dissatisfied and citing the Canadians as an instance where force brought good results. The necessity for a finger on the pulse of the men becomes a need.\n\n \n","13":"\n\nMarcinelle\n\nChurch parade after which an Archdeacon from Lincoln gave a lecture on Industrial Unrest. Had the pleasure of rousing Gorman up because this parade was late. A lovely Spring day today. Took a promenade after lunch and after evening mess visited the town. Quiet.\n","14":"\n\nSnowing all the morning and raining hard all the afternoon. Tried a couple of cases at Orderly Room and was reasonably busy up until lunch time. After lunch read and wrote before going up the town. Bought a guide book to the Rhine and another to Switzerland and was home at 5.30 for mess.\n\n \n","15":"\n\nMarcinelle\n\nSnowing when I woke up with a leaden head and a violent cold in it. Dies irae! Fairly busy on routine till noon and afterwards about all the battalion was fooled up over a band concert which made us all very annoyed. Bad staff work. After evening mess I roused up the officers about language. Stayed in all the evening. Rotten.\n","16":"\n\nA fairly busy day. Dealt with many matters during the morning – a range from fining a chap 10\/- for not wearing colours to dealing with cinemas and other things. Afternoon went up to the E.F.C Officers club and then had afternoon tea at our mess. Word for 18 subalterns to leave the Bde for home. Picked them and then found several not so keen to go – cherchez les femmes. Dined with Dr Mathys.\n\n \n","17":"\n\nMarcinelle\n\nSome snow fell this morning. I found myself very busy until 11.30 – holding orderly room and attending to matters of routine. The Higher Command leaves well alone here and visits from the G.O.C are rare. Afternoon said farewell to a few officers leaving for Australia and had a dancing lesson which broke me up. Stayed home correcting history.\n","18":"\n\nAnother cold and snowy day. Spent a busy morning mostly in argument with Selleck about the next draft. Afternoon read a while and then went up the town to go and buy a Petit Parisien and then aimlessly come back. Dr Milleu came to evening mess and said he goes home soon. In the evening I went back to the Cinema and saw some good pictures.\n\n \n","19":"\n\nMarcinelle\n\nWoke up to find the world in white. Rooves and trees weighted with snow and large heavy flakes drifting down. Spent a fairly busy morning on routine odds and ends and at lunch had some things of interest to discuss with a Y.M.C.A lecturer. Smythe came in for a talk after lunch and then I went round to DHQ and had a long talk with General Robertson fixing up a number of things. While there Major General Tivey came in as Robertson goes to England. We all had afternoon tea together and talked a good deal about military life in Australia. After evening mess took a walk up the town and had a good look round. Snow on the ground and in the air sent me to bed ravenously hungry.\n\n \n","20":"\n\nMarcinelle\n\nSunday and cold and snowy in the morning. Kept fairly busy till 11, then had a few words to the 21st Band before they left and then had a talk to General Martin on the subject of 1916 men. I put the case very strongly and after lunch also wrote him a note. Our draft figures are the ridiculously small 296! There were several heavy snow storms before evening and the place looked remarkably beautiful so deeply covered with the flakes. Took a walk around the streets after dark. Lots of people abroad on Sunday you would hardly recognise in the smart fashionably dressed people - especially the women the slatterns of week days. To my billet about 9 and wrote before going to sleep.\n\n \n","21":"\n\nMarcinelle\n\nThe snow still lies about fairly thick. At my billet two lambs have put in an appearance and the children are in high delight. Saw General Martin again this morning and then kept extremely busy right up until noon and most of the afternoon too. Went to the Green Diamonds for the evening. Their “girl\" is good. Picked next draft to go. The people here are very scrupulous about locking all doors at night.\n","22":"\n\nAttended a conference at Group H.Q. where General Martin discoursed in platitudes and nothing very much eventuated except that I may get away by 7 May and that it is officially estimated that all Australians will have gone by 20 May. Afternoon interviewed different people and in the evening had a long walk around Charleroi.\n\n \n","23":"\n\nMarcinelle\n\nToday was fine and ideally Springlike. Fairly busy all the morning doing the usual things until 10.30 when a Miss Baxter, an Australienne, arrived to give the troops a lecture or rather a talk about Australia. She was very interesting and afterwards came over to the mess and had a cup of tea. Afternoon went up to the Charleroi Railway Station and had a hot bath. This place has some remarkable wall paintings over which much trouble has been taken – one very obscene and so elaborate as to show a deliberately low mentality. Had afternoon mess and after went down to Jack’s billet to find him well and much invigorated by his trip to Germany. Cold and frosty tonight.\n\n \n","24":"\n\nMarcinelle\n\nVisited the Printing office this morning and then tried a case at Orderly Room – Lennon a real criminal. Went round and had a talk with General Martin for a while. After lunch went up round Charleroi High Town and, being a fine Springlike day, the walk was very enjoyable. Returned across the canal bridge pausing to see how the locks are worked – a rapid manner they have here. At 5 p.m. went to a dinner of the 24th Battalion to their departing draft. It was very successful and I made a short speech to the men. Afterwards one of the Euroa Liddells came up and had a talk. Tonight is beautifully calm and mild and the green on the trees and the feel in the air proclaim that Spring is here.\n\n \n","25":"\n\nMarcinelle\n\nUsual round of routine and a visit to the “Echo\" Printing office. Dealt with several matters which included no less a circumstance than the loss of 500 fr from Cinema profits by the Staff Capt. Ordered that he pay it. Afternoon had a visit from one of the Liddells and then saw various people and wrote until 5 pm when I walked down to the Maison du Peuple where the 22nd had a jolly good dinner to their departing draft a show which went off in fine style, I made a fairly long speech on the deeds of the 22nd and the 5th Bde concert party added to the programme. After 8 o’c Jack joined me at my billet and Mme Cornil played operatic tunes and others. Monsieur produced choice Burgoyne.\n\n \n","26":"\n\nMarcinelle\n\nA delightful day. Completion of arrangements for our departing draft filled in the morning & I also paid a visit to General Martin regarding Brevet rank in the C.M.F. A short walk up to Charleroi after lunch. In the square there were many market booths erected and the people were crying their wares & evidently doing good business. At 5 pm went to the 23rd dinner and arrangements were by no means as good as they might have been and the sting and zest was absent from proceedings. Met Jack afterwards and we promenaded up to the University de Travail. Streets full of people and shops are getting bright & well stocked. After some cakes and chocolate we walked home. Went to bed but was \n\n \n\n5\/4\/19\n\nMarcinelle\n\nsoon pulled out by Miles and Harold Smith with news that little Georgie Hughes, Freddy Howell, Jackie Cowan and young Binns were all in the A.P.M’s clink at the Charleroi barracks! Quelle affaire! I went up with Gorman and “Scotty\" the 24th RSM and found it only too true. Interviewed the A.P.M and got his leave to see them. The doctor & myself had no hesitation in pronouncing them all quite sober but (unofficially) Freddy & Georgie were really very drunk – so much so that I decided that they must stay in the place all night. So we left them there in a dark room under lock & key with one lone wraith of the 42nd Division floating round in his white riding breeches & chamois waistcoat like a nocturnal spectre!\n\n \n","27":"\n\nMarcinelle\n\nSent up to get the boys out of clink. Busy with preparations for the draft the young devils are going on. Put in worrying day about them and eventually had to warn other officers for draft in their room. Late in the evening I had to give Fraser about 3 hours notice to go. Took supper with the Mathys’.\n","28":"\n\nUp at 6 and saw our draft off. Spoke to the men before moving and expressed thanks to them. Then with bands playing and flags flying the draft moved off and looked very well. At the station met General Tivey and he spoke to the men before entrainment started. Walked along the train shaking hands with various ones till at last it steamed off the band playing Auld Lang Syne. Took a \n\n \n\n7\/4\/19\n\nMarcinelle\n\nFord car down to H.Q. 2nd M.F.Coy and there met General Cam Stewart with whom I sat as member of a G.C.M on an officer charged with stealing Govt. goods cycles etc. Brought Col. St Clair home to lunch and then returned to the same place where we sentenced our friend. Returned and had a short rest before dinner engaged on matters of routine. After dinner Selleck proceeded to take a Summary of Evidence in the case of Cowan & Coy. A.P.Ms and all sorts of other people came too. I spoke my bit at about 11 p.m.\n","29":"\n\nA busy morning. Heard several Orderly Room cases and awarded punishments. A fine sunny day. Our mess very funny with silence – the naughty Jacky, Freddy & Geo. now very quiet.\n\n \n\n8\/4\/19\n\nMarcinelle\n\nAt 6 pm Colonel Davis called with sidecar and took me over to Marchienne au Pont where we went to a café and sat down at a table – full was the café. The waitress solemnly brought us our coffee cups full – of whisky and we as solemnly sipped it. There is much traffic going on between civilians and canteens. Men buy and resell. Went to Dr Hiernaux’s and spent a pleasant evening. Alix will be fat later and is petite. The Madame laughs insincerely. Drank wine talked and had some music. Tasted here mint tea for the first time. Left about 10.30 and had a quiet run home – a fine mild night. Read for a while before going to bed. \n\n \n","30":"\n\nMarcinelle\n\nWent to see General Martin & had long discussion there re Mont St Quentin memorial with Col. Chalmers & Major McCall. After met Cols. Forbes and Davis at Bde H.Q. and discussed demobilization questions with the Staff. In early afternoon walked round Charleroi – the pleasant day made this enjoyable. Barges marked Ghent Rotterdam and Antwerp on the canal and the usual curious crowd watching the locks at work. At 4.30 took afternoon tea with Dr Mathys and ate gauves. Then took them to see the 5th Bde Concert party who were very good but too much for the Mathys to understand. The “girl\" of this party is very good and makes up splendidly. Put all our bad eggs into Charleroi barracks today where they get rough treatment.\n\n \n","31":"\n\nMarcinelle\n\nFairly quiet morning fixing up small matters. At 2.30 paraded Freddy & Co. round to General Tivey. In the presence of Genl. Martin he gave them a good rating and they all then went home. Bill May came over during the afternoon and had some afternoon tea. Word of further drafts 14th 21st and 28th. Ellwood goes on leave to the Rhine tomorrow. At mess of an evening now we get about 15 officers all round one table – a change to other times when 30 to 40 would at one time sit down to dinner. The bonne at this house is a perfect slave going day and night. No wonder many prefer the streets to this kind of economic slavery. Took a tour round the Old Town before dark – days are longer now.\n\n \n","32":"\n\nMarcinelle\n\nTook a couple of Orderly Rooms and saw Staff Capt Hale about getting rid of our Transport. Met Father Campbell and there passed a car containing R.C. bishop who got out very gorgeous in a purple cassock and tiny surplice. Had a good bath at the Railway station about 2.30. After evening mess went to the Concordia Hall to see the “Smart Set\" 4th Divnl. Concert Party. They were very good indeed and gave a fine programme but their “girl\" is not as good as the one in the 5th Bde. Party. The hall is a Catholic institution. Home about 9 just in time to see the Cinema coming out. Orders for 167 people to go on draft on the 21st – put in some time picking them and so to bed.\n\n \n","33":"\n\nMarcinelle\n\nTried a couple of Orderly Room cases. One McCormack of 23rd came before me handcuffed and was remanded for Court Martial. There is a lot of traffic now in military stores and the canal bank in front of the station is the mart after dark and known as Rue de Combien. Saw General Martin afternoon and arranged several matters with him. Afternoon tea in the mess and then a walk round the Charleroi streets to buy a couple of papers. After mess went to Pictures at the Cinema Hall – very poor show and a great barrage of tobacco smoke. Took another walk up the street. The mildness of Spring is in the air and the buds are green and bursting. Filthily casual in their habits of sanitation are the Belgians.\n\n \n","34":"\n\nMarcinelle\n\nChurch parade at 10.30 a.m. was poorly attended and a wretched farce. The officers & men only go under compulsion & we find that voluntary parades fail. At 1.30 a draft of 70 men paraded in the Square to be seen off by me. I spoke the usual few words and then Band at head they marched off to report at the Divisional Reinf. Wing. In the evening went to “La Traviata\" with Gorman – a fairly good show but weak orchestra & a bad mannered audience. Entre actes the usual mingling of the sexes insanitarily. To Café Central full of officers and some evil looking ugly girls dancing. Prostitution in an ugly industrial town like Charleroi is a nakedly ugly thing.\n\n \n","35":"\n\nMarcinelle\n\nUp betimes and to the Station to see off a small draft of about 60 all told and including Charlie Hutton. Generals Hobbs Tivey and Martin were all down at the station. Travelling is done in German trucks marked “Stettin\" “Breslau\" etc and all comforts and other gear is put aboard by Hun prisoners. Such is the irony of War! At 9.30 the trains teamed out somewhat rapidly and it took a lot of scrambling before the troops got aboard. Farewells were exchanged from the moving trucks and one chap passing a group of Hun prisoners called out “Au Revoir, Fritz, you bastard!\" in cheerful pleasantry. Met Colonel Forbes later in the morning and with him saw General Martin about several matters. Lunched and then\n\n \n\n14\/4\/19\n\nMarcinelle\n\ntook a walk up the street looking at the shops & killing time till afternoon tea hour. It came on to rain heavily in the late afternoon – a steady growing rain. The heavy green buds of the trees only want this to make them burst. In the evening had dinner with the Mathys and Jamsins. An exquisite dinner. The Belgians are rather angry with England for supporting Geneva as the seat of the League of Nations. Madame Mathys was a little disappointed at not being asked by us to come to “La Traviata\". The wine very good 6 bottles to 5 persons the doctor says is his measure of Burgoyne. Very tasty. A finale of coffee and Benedictine sent everyone home just pleasantly elated. They speak of parties of 3 who can polish off 15 bottles.\n\n \n","36":"\n\nMarcinelle\n\nTook a walk up towards the Waxworks but did not go in. An attempt was made to steal our horses last night but failed and I tried a foolish looking chap of the 17th Battalion & remanded him for Court Martial. From the Cavalry Barracks last night twelve birds escaped. In days past this never happened – now corruption is rife. \n\nAt midday went up to the Waxworks and had a look at the horrors there. Took afternoon tea at the mess having first wandered out and done some shopping. A windy thundery and showery day. Spent the evening with the Cornils.\n\n \n","37":"\n\nMarcinelle\n\nAn unexciting day at the close of which I went to the Peter’s house and heard them curse the and their party.\n","38":"\n\nSwiss leave said to be thro! Saw the General and arranged to get away tomorrow provided the pass turns up. Had 4 o’c tea with the Mathys and arranged to go the Fille de Regiment and Noces de Jeanette with them this evening. Ate many gouves with coffee and custard. Went to Varieties with Madame and the doctor and there saw an act of Les Noces de Jeanette and La Traviata. The latter was put on instead of La Fille de Regiment owing to an actor having failed to turn up. The chief singer here was once the principal of Amsterdam. The performance on the whole was fair to medium. Found no pass for leave.\n\n \n","39":"\n\nMarcinelle\n\nUp very early and had breakfast. A lovely mild Spring day it would have been ideal for commencing a leave. C’est dommage que le passport n’arrive pas! Went down to D.H.Q at 10 a.m. and saw Roberts who rang up Corps who said my leave had been passed. He had the authority and it said that passports had to be gotten in Paris so must needs go there. The R.T.O rung up says next train 9 pm tonight. Visited station later on and got concession ticket at 10 fr but no couchettes. Went to the M.P.’s and found that bribery would get a bunk for 40 francs – not worth it but requested M.P. to try and reserve a seat. A lovely warm sunny afternoon. After mess went up the street and had a shave. Remarkable how scrupulously clean these\n\n \n\n18\/4\/19\n\nMarcinelle\n\npeople are about their houses. They scrub the outside front walls and lintels daily with soap and water and the scrubbing of the flags is an event of two or three times a day. Their care in this respect is a marked contrast to their filthy lack of sanitation and their dislike to washing their bodies. On the canal this warm pleasant evening are many barges and the watermen and their wives sit yarning. Got away from Charleroi station at about 9 pm on a packed train. The journey all night was one of the most wretched I ever remember. Had to sit on my suitcase crouched up against the heater of a wagon lit. All night had no sleep – there were women (some elderly) crouched in the corridors.\n\n \n","40":"\n\nParis\n\nReached Paris at 7.40 a.m. and took a taxi to the Continental where I got a room. Then tore off to the British Embassy after passport had the devil’s own job getting it, tore down to Prefecture of Police in a taxi and could not get a visa. Went then to Swiss consulate and they definitely refused me leave to go there. The Champs Elysees were looking lovely this morning all the trees out in bloom and a light sunny blue haze hanging round the Arc de Triomphe. Wonderful the number of really beautiful women and girls of all ages one sees here. Walked round all the old familiar streets this afternoon some of the boulevards are a lovely blush of green. Then went down to the Luxembourg Gardens all full of kids. And so home by tube feeling tired. Went for\n\n \n\n19\/4\/19\n\nParis\n\nDinner to Arrigonis and along the crowded boulevards for a while. Gay crowds in all the cafes. To Folies Bergeres and got into the promenade – a poor show but rather good stage effects. Girls wear nothing on their backs above their waists and only two narrow bands in front.\n\n \n","41":"\n\nParis\n\nDid not wake up until ¼ to 10. Had a hot bath dressed in mufti and walked through Place Vendome to Opera and then along to Madeline. A great crowd was going in and out the old churches and an American was taking bioscope pictures of it. Went in and found a great mass being celebrated this Easter Sunday. The music was exquisite both vocal and instrumental. The crowd was like an Opera audience. The old cocked hat sacristans are well known identities here. Tubed to Gare de L’Est and booked through to Strassburg tonight. There was a little excitement on one of the platforms between a man & a woman. Came back to Opera and walked along Bde. des Italiens to an Italian café (Poccardis?) opposite Arrigonis. Lunched here and then made for the Louvre\n\n \n\n20\/4\/19\n\nParis\n\nexpressly to see the Venus de Milo. She was not there when I had previously visited the place. This celebrated statue is impressive. Wandered round the Galleries and then came out into the Tuilleries near the Arc de Caroussel. From here there is a prospect that cannot be equalled anyway. All round are gardens & statues & the long wings of the mighty Louvre. The green trees of the Tuilleries garden continue till the Concorde obelisk coming into view – then the green of the Champs Elysees and further on straight ahead the Arc de Triomphe. On the left is the Eiffel Tower and on the right the essentially French architecture of the shops and arcades of Rue de Rivoli. There are a number of wooden in the Tuilleries in preparation for a fair. Bought a few things\n\n \n\n20\/4\/19\n\nParis\n\nbefore returning to hotel to pack up. With about 5000 a year Paris would be a delight – the home of the wealthy. Rested and read until about 6.30 p.m. and then paid my bill and got myself and baggage put on a taxi for the Gare de L’Est. Took what will probably be the last look for a long time at the Opera and all the other old familiar places. Reached Gare de L’Est and got a place for Strassbourg. The carriage of this train (and many others now) was German and bore the Imperial arms. On French lines there now seems to be abundance of Hun material. The carriage splendidly comfortable and each passenger has much more sitting space than other nations seem to give. Latrine & other arrangements all seem good. Each “place\" gives ample room only 2 on each side of the carriage. 2 French Majors & A.F.C. Lt. as companions.\n\n \n","42":"\n\nStrasburg\n\nNot a bad night – slept sitting up travelling all the time. Dawn found us going through Alsace Lorraine and we passed some old trenches much barbed wire and some ruined villages. At last we got into the Vosges and mountainous pretty country with heavy woods. Glimpses of streams and wooded valleys. Ran out into open land and made Strassbourg about 9 a.m. A porter took me to Hotel du Poste a cheap lodging. This is Easter Monday and all the shops are closed. Walked up the street as far as Place Kleber where there is a statue to the General of that name who was killed at Cairo. From here to Cathedral a fine building on whose tower flies a tricolour. Entered and found a service in progress some good stained \n\n \n\n21\/4\/19\n\nEaster Monday. Strassburg\n\nglass. Bought a couple of tickets and climbed the tower. A fine sunny day but strong wind made the tower seem rocky & cold. Narrow stairs and open sides – one could easily get giddy and fall over. From the tower a splendid view and one realises that the town has many very old houses. The various churches and squares show up plainly from this great height and then all round are open fields. The Rhine runs about 2 kilos away and high mountains in distance are Vosges and Jura. A ground haze was hanging but I thought I could distinguish the Black Forest. Descended to the street and went in to see the celebrated Clock of Strassburg which is in a sort of side chapel. It is a wonderful affair\n\n \n\n21\/4\/19\n\nStrassburg\n\nand while I was there struck 11 & a little figure walked gravely out and rang a bell. The seasons moon etc are all shown. Tried to see it again at noon when all the figures appear but there were too many other people crowding and crushing. Took a walk round Quai du Sable and then back round old Middle Age streets to the Broglieplatz found the State Theatre here and then walked round to the Cathedral Square to Maison Kammerzell and there had lunch. A wonderful 5 or 6 storied place (Stiftskeller) of the 16 century. Had a good lunch & good pint of red wine for 9 francs. Now walked back to Broglie Platz and rested a while sitting down before going up and getting a seat of “Mireille Mirabella\" tonight. Many Alstian girls wearing\n\n \n\n21\/4\/19\n\nStrassburg\n\nTheir national Costume and headgear which is very nice. Now to Square at the back where are Kaisers palace Library etc. Everyone is speaking German & I can see that the people here seem to be much more German than French. Strassbourg seems a clean well kept and fine city. Had a ridiculously cheap early dinner at the Hotel du Poste and then went up to the State Opera House and at 8pm saw a splendid performance of “Mireille\" in French followed by the ballet play “Coppelia\". The music scenery and production of these could not have been better. Met an elderly American gentleman who was very interesting to talk to & who says the religious question here is one the French want to treat sympathetically.\n\n \n","43":"\n\nStrassburg\n\nUp and out by 9.30 and went up to the Place Kleber. Walked round all the streets with their well stocked shops and came to the conclusion that this city (excepting a small portion of Collins St.) is much better than Melbourne. To the Cathedral stopping for a minute to admire its façade & then going inside to watch a service. Then to the great clock and saw it strike the hour. Who should I run into here but Pat Gorman and Y. Miles!. They were as surprised as myself. We went and had a beer and some cake and then did the Broglie Platz and the Kaiser’s Square where the Palace is. Returned to my hotel and got ready to leave by the 12.20 train for Mayence. Today is sunny and fine but a cold wind blows off\n\n \n\n22\/4\/19\n\nStrassbourg\n\nThe Vosges mountains. In the shops they sell postcards of storks building their stork’s nests in the Strasbourgian chimneys but I saw no storks. We left by a train at 12.20 a.m. and had a good run to Hagenau and Landau. The latter place is backed by a blue mountain range and all the way along we could see the Mountains of the Black Forest in the distance. We reached Neustadt passing pleasant & intensely cultivated fields and vineyards with low blue Vosges close by and made Ludwigshafen about 3 pm. Here we got a glimpse of the Rhine for a few minutes but soon swung back to more densely plotted fields full of workers – the most intense cultivation I have seen since Egypt. Passed Worms – a little quiet city once the scene of religious strife and up along the river to\n\n \n\n22\/4\/19\n\nMayence\n\nOppenheim. Now ran right alongside the Rhine into Mayence – a lovely wide River and the city has good bridges. Took train for Weisbaden which we reached about 6 p.m. and put up at the French Club at the Palace Hotel – a most imposing and luxurious place. The porter (like so many other folk on the Continent) spoke perfect English. This luxurious hotel has lovely rooms and mine is a gem for 7 marks (3\/6) a day. The exchange is still all against the Hun and for 20 fr I got value for 40 marks. We had dinner for 3 fr and then went to the Opera “Samson & Delilah\" arriving during the first act. All in German and during the interval it was a German crowd that thronged the foyer. Many bald squareheads & the girls lack the chicness of the French.\n\n \n","44":"\n\nWeisbaden\n\nThe luxurious surroundings of the Mess des Officiers prepares one for the luxurious surroundings of a town which much resembles Monte Carlo as a home of pleasure. Went first to the Kochbrunnen baths and walked through the gardens there prior to doing some shopping. Walked then to the gardens of the Kurhaus where we met a gentleman (the Consul for Chile) and his American wife who observing us studying Baedeker got into conversation with us and invited us to their house. We then went through the fine gardens of the Kurpark full of lovely trees and flowers and then went up the streets and bought some German goods - Iron Cross razor etc etc. We then returned to Palace Hotel for lunch and then walked through the streets to a higher and residential part called\n\n \n\n23\/4\/19 \n\nWeisbaden\n\nthe Neroberg having first gone to the Kochbrunnen and “taken the waters\". They well up nearly boiling hot in a sort of open well and taste like salts. We climbed a winding path up to the top of the Neroberg where a hotel with a tower is situated. From this delightful lookout one could see Mayence and the Rhine and one the other side the Taunus mountains and the intervening forests and white winding roads – not unlike the panorama from the Crieff Knock. Then walked down and through the town to Luisenstrasse where we located the flat of our Chilean consul and his American wife. We met his three fine little boys and had afternoon tea with the family. Very nice people who had met many Australians\n\n \n\n23\/4\/19\n\nWeisbaden\n\nin Chile and having lived in Germany all through the war had much of interest to tell & were inclined to the German view point. Our host proved to be ultra-hospitable and poured strong ten year old Rhine wine into us and then insisted in coming along and buying some Hockenheimer champagne for us in Wilhelmstrasse. He boldly announced that he was out for an orgie so Gorman and myself boldly cleared out to our rooms for a lie down before dinner. Dined and then went out to the Rhinegeld - a dance hall where there many girls. All rather dowdy in dress and not made up at all. The “chicness\" of the Parisienne is totally absent. Dancing & music here but all over by 10.\n\n \n","45":"\n\nWiesbaden\n\nUp early and caught train \nto\n at Wiesbaden with Gorman & Miles to Mainz. Saw them off from the station and then did a round of the streets. It was raining and rather unpleasant so one’s impressions of the town would not be the best. Still it seems much dingier than many other towns we have lately seen. The bookshops in Germany are very attractive and the books beautifully bound. Went to Mainz Cathedral which dates from 1000 in parts – inside it is dingy and not very good except for one or two good carvings of statuary. On the other hand there is an unusual lot of 16th century skeleton horrors. Had lunch at the French Officers Club and then walked up to the station ready to go to\n\n \n\n24\/4\/19\n\nWiesbaden\n\nFrankfurt but the dismalness of the rain and the fact that the hour was afternoon put me off it. Walked down to the Rhine where a flotilla of English minelayers was at moorings. Met some of the officers and arranged to go up to Coblenz with them tomorrow on one of their trips. Then returned by train to Wiesbaden 45 minutes journey. Bought an opera ticket and then had a read until 6.30 when I went across and saw “Aida\" played. It was a splendid representation and I had a good talk to an old German who spoke English & 5 other languages well. Met 2 American canteen girls and took them to dinner with us at the Palace Hotel. Afterwards yarned with them until after 11 oc.\n\n \n","46":"\n\nMainz\n\nGot into Mainz from Wiesbaden early and went down to the Quai and got aboard H.M.M.L 519 Lt R . As part of a flotilla we cast off and steamed down the Rhine. General Mangin was going to Cologne escorted by a French and part British flotilla and we were the advance guard. It was a lovely sunny morning and the whole day voyage to Cologne is one to live in memory forever. At many parts bodies of French troops were drawn up and received us with the salute of presenting arms bugles etc. In one place we got a salute of guns. The River is lovely and the high banks are a mass of cultivation. The Banks are all marked with kilometre signs in white stone – a great idea. Passed Johannesberg\n\n \n\n25\/4\/19\n\nBingen\n\nbut could not be definitely certain that I located the celebrated chateau. It is wonderful to see how every tiny plot of ground here is under cultivation. The Rhinegau stretch of the Rhine is very lovely but I like it best above Rudesheim and Bingen because it is more wild. Passed the gigantic statue of Germania – each nostril of her is said to be large enough to receive a man. Bingen (“sweet Bingen on the Rhine\") is faced by a terraced bluff of vineyards and on the opposite side we passed Bishop Hatto’s Mauseturm – a low tower now used for navigation signals. The old ruined castles seemed to become more frequent in this gungy part. Burg Rheinstein the Enemy brothers and the Stolzenfels were all noticeable ones. The large cliff of La Lovelly\n\n \n\n25\/4\/19\n\nCoblenz\n\nWith its legend of the enchanted maiden was worth seeing. At Coblenz we saw the junction of the Moselle and the Rhine. From here to Remagen it was very fine and then we came in sight of the Siebengebirge and the Drachenfels. Perched right on top of a high peak the Castle of Drachenfels looks worthy of its story of the dragon. Passed Godesberg and Bonnaud ran through the uninteresting level country up Cologne. Once here took leave of the Naval Officers booked up at the Officers Club & went up to the Opera where we saw the heavy “Orpheus\" of van Gluck – one long magnificent sorrowful lament. Dined at the Club & went to bed at 11 very well tired with what has been a really wonderfully interesting day.\n\n \n","47":"\n\nCologne\n\nUp betimes and caught 7.30 train for Mainz. Though dull the journey was a most beautiful one. The lovely fruit blossom is covering the country just now. Reached Mainz 12 & Wiesbaden 1pm. Had some lunch and then did a promenade round the streets buying a few things before coming back to the hotel and having a few hours sleep as I was tired. Then got up and went to Opera and saw a rather good operette called “Die Gfwadasfurten\" but could not understand the dialogue. Met a French officer in the same loge Lieut. Boisgelin of the 86th Artilliere as charming a chap as one could wish to meet and fluent English speaker – a nephew of Lord Lucan. Went and had dinner with him at the Palast Hotel Cercle and yarned afterwards.\n\n \n","48":"\n\nWiesbaden\n\nHad a good bath in the waters of the place which are saline and refreshing. The bath of marble into which one goes by steps and towels almost red hot. Had breakfast and then tried to get a place for “Lohengrin\" tonight and am afraid I made a mistake in not booking up yesterday. Sunday morning. The Opera colonnade looks out on to another the same over fine gardens with splashing fountains. Read until lunch and afterwards got my place alright by paying double price to the porter at the Hotel. All the various ticket offices reported having sold out but I had to tell the porter pretty straight that he would benefit financially and then the tickets were forthcoming. My friend the French Lieut. who “opraed\" and dined with me last night also took a seat. Today was fine so after lunch took a walk up through\n\n \n\n27\/4\/19\n\nWiesbaden\n\nthe pretty gardens of the Nerotal to the Neroberg. Climbed once more to the top of the tower and was rewarded by a truly magnificent view of all the Rhine basin round here. The Taunus mountains of adjacent slopes are heavily wooded and the cleared spaces are a vivid emerald green. One can see as far as Bingen, can look down on Mayence and Wiesbaden and can look back as far as the Vosges. Came back to hotel and at 5 pm went to a magnificent representation of “Lohengrin\". Had an interesting talk to the German in the same box as me. The Opera was wonderful. My French Lieut friend turns out to be Comte Hentri de Boisgelin of 5 Rue Masseran Paris and 86 . Had dinner at the Cercle with the Count and a few others – a happy little party.\n\n \n","49":"\n\nWiesbaden\n\nWas called at 6.30 had breakfast and at 8 a.m. caught the train at the station here for Rudesheim. The journey took an hour and the course lay through pleasant villages embowered in fruit blossom. From Rudesheim made the ascent to the national monument of Germania by a winding path which twisted among vineyards all terraced and highly cultivated. The top of the hill is covered with woods and Germania stands on a large commanding platform from which a most glorious view can be obtained. Bingen lies exactly at the feet and the Mouse Tower of Bishop Hatto on a little island. Straight out to the West one looks over towards Luxemburg. The sun was shining but now and then clouds came over &\n\n \n\n28\/4\/19\n\nWiesbaden\n\nlittle “grelons\" fell. Continued along the crest by a delightful path through the green sweet smelling woods and noticed a squirrel tamely playing. Reached another look out which gave yet another panoramic view of the country and the absolute beauty of the scene made me nearly say that it was the loveliest I had ever seen. For half an hour stayed here and then wended a way down through the terraces of vines to Rudesheim station and took a train which after an hour landed me in Mayence. There dined at the Cercle des Offficiers and took a walk around the streets. The old Cathedral has no spire and is weatherworn. A great crowd on the tram for Wiesbaden. Went to the\n\n \n\n28\/4\/19\n\nWiesbaden\n\nKurhaus to an excellent concert of classical music free. After doing the rounds of the streets I went and had dinner at the Club yarning with two Canadians. Again to the Kurhaus to another excellent free concert. A crowded house. Remarked that the audience does not applaud at all at these performances. We are a long way behind the Huns in culture of this kind. Between acts at the theatre they eat as well as drink but their War Bread is very bad. On account of first communions there were many little girls going round with white wreaths on their heads and wearing white dresses. The Hun ladies freely fraternise and accompany Allies while their brothers lie dead.\n\n \n","50":"\n\nWiesbaden\n\nSlept in this morning and then took a bath in the saline waters of the town down in the hotel basement. Promenaded after breakfast in the Kurpark which stretches for more than a mile back from the Kurhaus. Here the trees are delightfully green with the young shoots of Spring, the grass is spangled with daffodils and the garden is well tended by curators. It is in the garden arrangements that this place surpasses Monte Carlo. I did not reach the end of the gardens and evidently they continue until the green fields come. Walked back to the Wilhelmstrasse and was looking in a shop window when Herr and Frau Gesswein came up and took me off for a “smile\". Cracked a bottle of Rhine wine and ate a couple of sardines on Kriegs-bread. Then went with Herr to a Biergarten snugly concealed behind a barber’s shop &\n\n \n\n29\/4\/19\n\nWiesbaden\n\ndrank a tankard of famous beer – a Munich Pilsener. From here we walked round to Lusienstrasses to the flat and had a German war lunch. Very nice people they are and they have three fine boys – the eldest a splendid chap. Our meal consisted of a good soup, German war bread, some sausage served up with Chilian black beans and helped with shredded German bully beef and onions. The whole very nice. There followed a dish of prune conserve with a little cake. The whole washed down with coffee and Pilsener. A jolly good meal but I know they shall go shorter than usual for supper. They say that it has been pathetic to see people pining here. Went up to the Kurhaus after taking leave but found no concert so returned to the Hotel. Delilah was there with room door open and a cough. Today a balmy mild\n\n \n\n 29\/4\/19\n\nWiesbaden\n\nSpring day. On my trip I have indeed been lucky with the weather. Went to the Opera “Die Judin\" (The Jewess?\") at 6.30pm. It was very good indeed. In the intervals all the audience promenade and eat. Remark – the number of bald men, the number of men with shaven or close cropped heads and the number who have heads peculiarly shaped. The girls are not blondes as one might be excused for expecting but they are rather light brunettes. Their clothes are neat and there is nothing daring about their evening toilettes. The “chic\" touch of La Petite Parisienne is absent. There is no make up. At the Opera the bouquets to the singers took the form of boughs of fruit blossom – all the trees are now in bloom. To the Cercle des Officiers at 10 pm for dinner and wined well before writing this.\n\n \n","51":"\n\nWiesbaden\n\nRose at 6.30 a.m. with the intention of catching an 8 a.m. train here and going up to Konigswinter in order to climb the Drachenfels and then going on from there to Cologne later in the day. After dressing a glance out of the window showed light snow and a little rain falling. Had breakfast and then decided to go into Mayence and catch the 9.17 rapide for Cologne. A pleasant walk up from the Pont Principal to the Station. The whole place is laid out in gardens and there is a fine big church which seems to be a Prot. The German policemen wear cloaks and swords and appear a smart military lot of chaps. Arrived in good time at Mainz station and got a good seat in the train. The sun now came out and I regretted not going to Konigswinter as at first intended. Had a good trip\n\n \n","52":"\n\nCologne\n\nup to Cologne. Once more passed Bingen, Lovelly and all the glory of masses of fruit blossom. Came into Cologne at noon and put up and dined at the Officers Club. Afterwards walked round till 5.30 when I secured a ticket for the Opera and met two Aust. nurses whom I took to afternoon tea. Then went to a final performance of “Rigoletto\" which we much enjoyed. Afterwards went to the Officers Club but they would not allow the girls in so I took them round to the VIth Corps Club where after a bit of trouble I managed to get fixed up. Did some tipping afterwards. Coming back to our billets noticed many people drunk both soldiers and civilians – one well dressed woman escorted by her husband staggering across the place of the Cologne Cathedral.\n\n \n","53":"\n\nCologne\n\nA wet morning. Boarded the Boulogne express at 9.15 a.m. and the route lay over uninteresting scenery until Aix-la-Chapelle. This romantic old favourite resting place of Charlemagne seems a fine clean town but the surrounding scenery is not much. The scenery just about the Belgo-German frontier is rugged and craggy. Liege we passed on the outskirts and towards Namur the landscape got pretty again. Along the Meuse in places it much resembles the Rhine. Reached dirty Charleroi at about 5 pm and notice that Spring is far more backward than in Germany. To Cornils and Monsieur must needs crack two bottles of wine – toper that he is. Dined en famille with Miles, Freddy & Co – good to be back “home\" again. Spent the evening reading mail and papers.\n\n \n","54":"\n\nMarcinelle\n\nA wet day. Busied myself about the composition of next draft going away. In the evening went and drank a bottle of wine with the Bertrands.\n","55":"\n\nA fine and pleasant day. The blossom on all the fruit trees is very pretty. Engaged on odd jobs all the morning, held interviews and tried at Orderly Room a handcuffed prisoner. In the afternoon S\/C Corney came and showed me an order holding up my demobiliztion. Must get on to this. A lovely mild sunny evening. Met Colonel Davis and after a long talk we went up to Charleroi met some people and put in the rest of the evening drinking port and talking with them at their flat. Food and the War combined with Belgium’s bad treatment are favourite topics.\n\n \n","56":"\n\nMarcinelle\n\nGorman left with me in a YMCA Ford car before lunch and we went to Gourdienne. The country exquisite dark emerald green. Received a warm welcome in the little place and was much kissed by aged Madames. Had lunch with the Crochelets and drank just the correct quantity of their good wine. Raoul and Marthe were both there. Gorman and the Brasserie folk came over later and joined us at coffee. Made adieux and left laden with a parcel of gallottes. Walked to Nallines along winding roads and took tram back to Marcinelle. Through some very pretty country this tram passes – a good playground for the Carolegiens. Had a bite to eat at the mess and fixed up some one or two routine matters. Met Gen. Martin and Davis up the street & “did\" Charleroi with them.\n\n \n","57":"\n\nMarcinelle\n\nExquisite sunshine – the best we have yet had. Loafed about all the morning and the best part of the afternoon. The Duke of Connaught visited here today for lunch at Siebertz’s but I did not bother going to see him. Some of the walled back gardens round here are veritable pictures with their masses of fruit blossom. We have two murder trials soon coming off. One is our one and onlyBanks. Some files at BdeHQ this morning were interesting dossiers of crime and violence with photographs of handcuffed and shackled desperadoes with vice written all over them. The celebrated Broncho is said to be so rotten with syphilis that one cannot touch him. Went to splendidly hospitable house of Mathy’s relatives at Mont Sur Marchienne & returned just mellow – this is hospitality.\n\n \n","58":"\n\nMarcinelle\n\nLast night Madame Mathys a propos wound stripe – Quel galon glorieux! The wine, weeping like oil, all of very old vintages. Early we were formal – we finished arm in arm. They stop at the right stage – this is true hospitality as opposed to excess. In the afternoon went out in a car to Mont sur Marcienne to a good Sports meeting and then returned with Colonels Armand and Davis to Hotel Europa for a cognac. At 6.30 commenced dinner with the Mathys and Jamsins. It was a veritable work of art and the wonderful hospitality of the people passes words. I made a speech in French and there were other responses. A wonderfully good & pleasant evening. The hospitality of the people passes powers of description. To bed well after midnight.\n\n \n","59":"\n\nMarcinelle\n\nA day of loafing. Afternoon went to the Railway station and had a good hot bath. The percentage of khaki to civil clothes is getting perceptibly less. The canal is very pretty now with the bursting green leaves. An aged beggar sits on the big bridge a mass of dirt. Returning via back streets there are slummy houses and dirty children – but we have these also at home. At mess we discussed the fact of tomorrow being 4th anniversary of leaving Australia. I am now the only original officer left with the 22nd Battalion. Talk today of a gratuity to the A.I.F. later on. With Gorman spent a very pleasant evening with M. Cornil who produced his “nonante huit\". Went to bed and slept more than soundly.\n\n \n","60":"\n\nMarcinelle\n\nLoafed until 4 p.m. and then “gouted\" at Mathys with cakes and icecream assisted by white wine. Then to the mess and had dinner the fourth anniversary of our departure from home. Met the Mathys at 7 and went down to Jamsin’s at Marcinelle Haies. Commenced “gouting\" here and Monsieur produced really the most wonderful wine – every bottle was of delightful flavour & bouquet. Also had two bottles of champagne. Started off a bit formal but by midnight this ornament of the Belgian bar was not only singing but dancing too. Everybody came home in the best of moods and I had Madame Mathys arm in chancery all the way back. Turned into bed about 1 a.m. and slept the sleep of the just.\n\n \n","61":"\n\nMarcinelle\n\nA warm summery day. Went round and saw General Martin twice about different matters and at lunch time visited the Mathys who presented me with a fine little statuary group in Saxe ware. Met Colonel Davis at 3 p.m. and took the tram out \nof\n to Marchienne au Pont where we visited M. le Docteur Emile Hiernaux and had afternoon tea with the fair Alix and a dark friend. These people show the same genuine sentiments that others here show. Towards evening it came on to rain a little in thundery storms. M Cornil eager for a final reunion and beaucoup a boire and he takes not a little watching. Went to the Mathys for supper and some Bourgoyne & then had a bonnet de nuit with M. Cornil.\n\n \n","62":"\n\nMarcinelle\n\nA somewhat close summery day. Up at 6 and had breakfast etc. Great preparations among the troops on account of departure. Formed up in the Marcinelle Square and left at 7.30 headed by the band and colours. Many entire families of civilians had turned out to farewell the troops. Arrived at the station our entrainment was completed quietly & without incident. A feature of our departures was the embracing. I kissed Doctor Mathys, the children and his wife. The latterly, in tears, naively said she had much wanted to kiss me the night before. At Cornil I commenced with the little Marie Antoinette and finished with the old Mme and Monsieur. A great crowd at the station. All the men embracing the different families – many in tears.\n\n \n\n10\/5\/19\n\nMarcinelle\n\nOne funny incident – a Belgian rushed forward and kissed one of the men. Her fiancé (a man) standing by smacked her face in jealousy and promptly “stopped one\" which knocked him out. Got well away at last and had an uneventful to Mons. Here we stayed for an hour. The town looked pretty in its dress of verdant green spring leaves and seems to have some good public buildings. Continued all day through very pretty country and crossed the Belgo-French frontier. Piles of comforts for the troops in each truck – a kitchen van and halts for meals. Spring seems further advanced in this portion of the country than round Charleroi. It was moonlight when we passed ruined Arras. From now on our train took us over the\n\n \n\n10\/5\/19\n\nFrance\n\n“devastated area\" miles of shell holes full of water tangled wire and ruined villages like a scar in the moonlight. As our train went slowly on one thought of the army of ghosts lying in the cold scattered wet graves. At dawn we passed the familiar La Motte and Blangy Tronville just near Villers Bretonneux and ran down to Amiens where the market gardens now once more appear to be in full crop again. Our train now took the Rouen line passing through splendid woods fruit blossom and grass of deepest green. At 11.30 we had reached Romescamp where Chinese coolies were busy cleaning up the station yard. Had some lunch and tea here – the troops cannot complain about scarcity of comforts\n\n \n","63":"\n\nRomescamp. Havre\n\nThe remainder of our journey was made uneventfully through very pretty country. Pulled into Triage siding at about 5 p.m. – there were some hundreds of very well dressed and smart Hun prisoners here including some of their jacktars. Marched through the streets of Harfleur which has an old church to a Cleansing Camp. Here formed up and told the men off to their companies & lines. Then went to the mess and had some dinner. The surroundings of the camp are very beautiful at this season owing to the wonderful shades of green the woods and fields take on. In Australia there is certainly nothing to rival the verdancy of these old world countries. The troops were soon all well and comfortably settled down. One sees W.A.A.Cs V.A.Ds & Red Cross girls walking round. Good to sleep after hard bench in truck last night.\n\n \n","64":"\n\nHavre\n\nToday the men were put through a cleansing process – bathed reclothed steamed deloused and all their equipment taken from them. For me there was nothing doing and it was simply a day of loaf. In the evening we moved about ¼ mile to another camp. The surrounding high ground all wood covered and very pretty. The Frenchman seems to place his houses very artistically and chooses fine vistas.\n","65":"\n\nAnother very fine summery day. Motor lorries busily puffing about with kits & blankets. Did nothing all day but at 5.30 pm went down to No. 3 Camp and met Major Storey and Red Cross Hayes. By motor lorry went into Havre. A nice run to the old port of Harfleur which is rich in historical memories. Saw an old field where one of the Henrys had a battle hundreds of years since. Reached Havre about 6\n\n \n\n13\/5\/19\n\nHavre\n\nand went round the Quais in our lorry. Returned to Tortonis café which seems the centre of gaiety of Havre. Walked through disreputable and old streets to an old place called La Grosse Yonne a place famed as the headquarters of the Scarlet Pimpernel. Dark dingy and low looking but they serve up a meal here better cooked than you will find anywhere else in Havre. We dined very well. The other people were of varying types. Afterwards walked along the seafront and the moonlight on the water was very pretty. Had a “bonnet de nuit\" at the Tortoni place and then lorried home. From an elevated place near Harfleur one gets a fine view of water, twinkling lights and moonshine – something a little like the Napolitan bay. From Havre to the camp is about 6 miles.\n\n \n","66":"\n\nHavre\n\nHot summery day. The men were reissued with clothing etc and in the afternoon went to a Repatriation lecture. I took a book and walked after lunch up a hillside into a wood of beech and oak through which the warm sun filtered in a score of colours. Lay down here and tried to read. To avoid going to sleep returned to camp and came near to sweltering in a small Armstrong hut there. After mess with Elwood I took a walk along the valley passing through several pretty peaceful little villages and walking along quiet pleasant lanes and roads. It was nearly dark when I again reached camp and before turning in watched the drifting traffic of men returning home from the estaminets and places of revelry.\n\n \n","67":"\n\nHavre\n\nOvercast and cold in the morning it came on to rain in afternoon. Absolutely nothing to do but loaf. Sat long over lunch talking with Colonels O\"Donnell & Heron. In the afternoon more idleness. In the evening went out for a walk with Elwood round pretty winding roads twisting English like lanes and quaint little villages. \n","68":"\n\nAll our baggage went in at 9 a.m. A rather overcast day. In the camp many Hun prisoners hard at work tarring the huts. My batman now is Private Scotty Watson M.M. 15 Star a wild dag. Left camp by motor lorries at 2 p.m. and made for Havre. At the quai we found the embarkation staff and I went ahead first and inspected the ship SS Londonderry. Cabins were soon allotted to some\n\n \n\n16\/5\/19\n\nHavre\n\nof the officers and the men stowed away in all sorts of place – some on the open deck. At about 4.20 we cast off with the band playing the “Marseillaise\" and “Auld Lang Syne\" the troops cooeeing and onlookers from the shore replying. This was our last sight of France and one felt it was an event. The sea did not appear rough although the roll was quite perceptible. The ship’s crew at once commenced their business of exploitation. £1 for a room & 1 franc for a dixie of tea. The confirmed gamblers spent the evening at cards and I felt a bit squeamish so got into my berth and read until late. At about 11 p.m. we passed the Isle of Wight and before midnight dropped anchor in Southampton waters off Netley Hospital.\n\n \n","69":"\n\nSouthampton\n\nA fine sunny morning, the precursor of a hot day. The water still and calm and the gentle slopes of English shores covered with low woods and houses embowered in trees. We got off the boat at 7.30 formed up in a big shed and got breakfast there. At the same pier was the mammoth Aquitania and in a few minutes gallant Anzacs of an exploratory turn were all over her until ejected by an anxious ship’s staff. One Billjim excited much mirth by putting his hand in his pocket and solemnly asking a decorous and dignified purser how much he wanted for the ship. Entrained at 9.30 and had a pleasant run through very fine country to Salisbury. One is struck by how heavily wooded the \n\n \n\n17\/5\/19\n\nSalisbury – Sutton Veny\n\ncountryside is and notices the oaks as especially beautiful. I have not remarked these trees on the Continent to the same extent. A march of 2 ½ miles from \nSutton\n Warminster brought us to Sutton Veny Camp where all we soon installed. Met General Robertson after lunch and again at 3 p.m. when he arrived with General Rosenthal who gave an address to the quota. Spent the remainder of the afternoon in the Camp. Dined. Early to bed.\n","70":"\n\nBatman Scotty Watson is not satisfactory and was late this morning. Afternoon went up to No. 1 A.G.H and passed the afternoon with the sisters finishing with a stroll in the woods of the Marquis of Bath. Very lovely shades of green as usual. Being Sunday the camp was more quiet than ever.\n\n \n","71":"\n\nSutton-Veny\n\nHot but pleasant day. Men were paid and handed in certain articles of kit. Held a conference of company commanders and rubbed home a few points. Sacked my batman Scotty Watson. Rumour that Hawker has flown Atlantic announced at cinema tonight. \n","72":"\n\nFirst thing met James and in a car went about 5 miles with him along narrow winding lanes fringed with beautiful trees. The beauty of this country side is a regular gardenlike beauty. We passed through the small hamlet Longbridge Deverill and drove up to a plain kind of manor house with several gardeners working in front of it. Inside met the Duke and Duchess of Somerset with whom I dine tonight. The Duke is about 65 and his \n\n \n\n20\/5\/19\n\nSutton-Veny\n\nwife is a nice woman who speaks without stilted affectation. In fact they might be Australians so free are they from accent. Tonight I go to dinner there with General and Mrs Robertson. Returned to camp at 11 and went to the Orderly Room for a while. Saw Jack after mess. General Robertson called in a car. I introduced Crawford Vaughan late Premier S.A to the party and the car then left. We were received by footmen who took our wraps & then announced us. The Duke and Duchess introduced us to their niece Mrs Loder and we had a very merry little dinner party and there was no restraint at all. Left at about 10.30 and the run home was a little cold but dustless – these roads are so good. About midnight an attempt was made to burgle my cubicle but an alert batman frustrated it.\n\n \n","73":"\n\nLondon\n\nUp at 4.45 and at 6.30 marched 1000 men out for their leave. Motor cars flew up and down the column getting well freighted and about 200 of the men must have solved the transport problem in this manner. A good smooth run to Paddington. Not far from Warminster cut into the turfy side of the hill is an old White Horse in chalk. The scenery en route was the usual soft garden scenery of England. At Paddington I got a room at the Norfolk Hotel and after a wash up sallied forth to the Tube and went up to the Bank. A lovely morning. At the Bank of A\/sia got my letters arranged an overdraft saw old Blogg and took over all my diaries. To the A.Ms and in 5 minutes was insured for an extra £300. back to Paddington to dump my diaries & to lunch. Then tubed to Blackfriars\n\n \n\n21\/5\/19\n\nLondon\n\nWalked up to Cooks at Ludgate Circus and arranged re my trunk. Bussed to Horseferry Road saw Chief Auditor and did other business there before going round to Berkleys in Victoria St. where I made a row about an illfit in my tunic. Tubed to Piccadilly Circus and had a shave and haircut in the usual place there. His Royal Highness of something was receiving a lot of attention and looked an ordinary person & a foreigner – Perhaps one of the Russians. Tubed back to Hotel and changed into civil clothes. The London tubes are dreadful compared with Paris and no wonder many women faint here. The girls – one sees many pretty ones but always give me La Parisienne. Went into town again for dinner and dined on pigeon pie at the Olde Cheshire Cheese which is full\n\n \n\n21\/5\/19\n\nLondon\n\nexpensive and they charge for the old ways. Sat in Dr Johnson’s seat. Afterwards did the Strand, Leicester Sq & Piccadilly where much bargaining was going on. I have seen no city where prostitution is so brazenly evident as in London. The hotels are now open till 10.30 and there were many people a bit merry. In the bars women mingle with the men draining their pots and smoking. In Paris women take their drink in a more refined way – sitting at a table. The tubes are handy but antiquated and vilely ventilated. Went to Trafalgar Square and paid a guinea for a balcony stall at Therese & Pagliacci at Covent Garden tonight. Returned to the hotel at Paddington – the Norfolk – and was fast asleep by midnight. The moving stairways in London tubes are a great idea and could be extended and made to move faster.\n\n \n","74":"\n\nLondon\n\nWearing mufti today. Went to Berkleys at Victoria St and left my tunic etc. went up to Covent Garden. The Opera is situated in a slum – how unlike Paris! Looking in a side door could see all the scenery – a science in itself is the provision and management of this. Porters running everywhere carrying boxes of fruit. The scene not unlike Les Halles in Paris. From here tubed to the Strand and up towards Drury Lane. Wandered round among the many second hand bookshops of this funny old quarter. Lunched in a Lyons café for 1shilling - quite a good meal. Then walked up toward St. Pauls and did some more shopping before returning to Hotel. A pity that they let Australia House be as placarded with posters and surrounded by huts and sheds of YMCA etc.\n\n \n\n22\/5\/19\n\nLondon\n\nWent into Victoria again about 5 and had a look at Westminster Cathedral which is vast but like an enormous barn. When it is marble lined it will be wonderful. Went to some gardens facing Buckingham Palace – they were very pretty. This is a fine stretch here – good streets and open spaces with statuary. Returned to Paddington changed into uniform and then went to Covent Garden Royal Opera. The Opera House is a vast ugly theatre miles behind Cologne even and not within imagination of Paris. Saw “Therese\" and “A Pagliacci\" played and the performances were superb. The audience claps when the conductor of the orchestra comes into his little desk. Neither of the performances was in English. After tubed right out to Paddington at once and got to bed after midnight. Meeting my trunk from Cooks is like seeing an old friend.\n\n \n","75":"\n\nLondon\n\nCaught a train at Paddington Stn opposite my hotel at 10 a.m. and had a swift and agreeable journey out to Windsor. Coming into the station the view of the old castle perched aloft is fine indeed the circular massive tower with flag flying is very striking. Went across the Thames about 10 minutes and came to Eton College – some of the old buildings not unlike Oxford. Here were boys running round ridiculously clad in bell toppers and frock coats. Saw one of the famous playing fields looking very well in warm summer sun. Walked back towards the station rounding the Castle but did not go inside. To the Long Walk – a fine long drive edged with huge elms foliaged & magnificent. At the far end of the drive is a statue – whose I don’t know as energy gave out and I lay on\n\n \n\n23\/5\/19\n\nLondon\n\nthe grass under a tree and dozed for an hour or two. Before boarding the return train at 2.40 had a pint of ale at an hotel and was disgusted to see a woman leaning over the bar drinking gin with all the foul and filthy language of the bar room sullying her ears. Back at Paddington at 4. Got to the Royal Academy about 5 – not far from Piccadilly and went in to see what pictures have been hung this year. Sargent’s picture “Gassed\" is perhaps the most striking one there but, on the whole, in my poor opinion there are few good pictures this year and a great lot of bad ones. Went to Berkleys Victoria St and was by them robbed of 5\/6 for putting a few stitches into a pair of breeches. Tubed back to Paddington – I cover\n\n \n\n23\/5\/19\n\nLondon\n\nsome ground every day in tubes etc. In the evening went down to Soho – a dirty quarter but like stepping into France or Italy to see the signs “Epicerie\" “Ristoranto\" etc. Had dinner at Café d’Italie – a very warm close night and the place ill ventilated. From here round to Leicester Sq. and then to the regions round Horseferry Road a low dingy dark locality full of brawling women. Tenements and drunks. And some of our men when on leave never get out of this beastly quarter. Things on the whole seemed fairly quiet and until about 11.30 I wandered round Piccadilly – too hot for theatres so crowds were promenading. I have seen a good many places but for pure mercenary cold vice give me this city of London. A hard cruel place and a hell for a man or woman without money I should think.\n\n \n","76":"\n\nLondon\n\nInto the Bank to get my letters. How many people daily notice that large text which is engraved above the Stock Exchange of London “The Earth is the Lord’s and the fullness thereof!\" From here went to Horseferry Road and fixed up a number of matters with the Auditor. Then by bus to Euston. Our route lay via Bond Street and Oxford Street teeming arteries of commerce & lined with fine shops – truly London is the vastest of cities. Then to Kings Cross where I had much chasing round over my tickets to Scotland. Back to Paddington lunched and then slept all the afternoon. A hot tiring day. Dined at hotel. Went into town and after reading paper in the gardens of Leicester Sq took a stroll to the Regents Palce & then along Piccadilly. Was stopped and interrogated by M.P.’s APM and a civil policeman. Back home before 11.30 pm.\n\n \n","77":"\n\nLondon\n\nBy tube to Piccadilly and then via Pell Mell walked to St James’ Palace, and to the gardens on the Westminster side of Buckingham Palace Road. A few drops of rain falling. Read the paper in the gardens and then walked to Westminster Abbey which was crowded at a service. Stood just under the monument erected to Wm. Pitt Earl of Chatham. Went across into St Margarets Westminster. The altar window has now been replaced as air raids are finished. A grand old church this and full of funny old tablets and epitaphs. Reading the fulsome flattery of some of these one is almost afraid that all the good people of the world are dead – no one living could hope to come up to the character these dead people have. The Houses of Parliament are fine and fit in well with the old places around. They go to show that the moderns can match the work of olden times.\n\n \n\n25\/5\/19\n\nLondon\n\nHad lunch in a Lyon’s shop and then tubed to British Museum only to find it shut so then went back to Oxford Circus to the Palladium to a good concert by the Royal Artillery band – but London is dead dull on a Sunday. Back to hotel and packed up ready for tomorrow’s trip. Dined and then went into town knocked around the Strand and Piccadilly. The Regent Palace was crowded out and no seats were to be had. Round at the Strand Palace the reverse was the case and there was ample room. One sees all nationalities round the streets – the sound of an occasional phrase of French is agreeable. The tube delivered me out to Paddington at about 10 p.m. Ill smelling crowded tubes these – the moving stairs the one good feature.\n\n \n","78":"\n\nLondon\n\nTubed to Kings Cross and there caught the first Scotch express leaving at 9.45 am. The day was fine and the journey to Scotland was a pleasant one – the whole land is one ravishing green, heavily wooded. As usual I found Durham with its fine Cathedral and its old castle to be particularly impressive and wish time would allow of a stay here. Newcastle-on-Tyne black smoky and repellent but Berwick looks stern and looks warlike. The train reached Edinburgh at 6.30 and I went at once to Abercromby Place there to find the Colonel and Audrey Craig but Mrs. & Sheila were away. Dined with them tete-a-tete with the Revd. Hunter Smith and then, after a little music we drank Scotch and after the Revd. had gone we got on to religious topics.\n\n \n","79":"\n\nEdinburgh\n\nA fine sunny day and hazy. After breakfast yarned in the gardens with the Colonel and then went up the town for a shave etc. Princes Street is undoubtedly one of the best of streets and it is the craggy height of the Church of St Giles and the Castle that makes it so good. After lunch the car called and took us out to the Glen of Rosslyn – a delightful glen through which flows the little North Esk brook or river. The shades and colours here were very pretty. The Rosslyn Chapel dating back to the 13 century was intended to be a very much larger church. Inside the roof is remarkable for elaborate carving and so is the terminal point of the chapel. One of the carved pillars is called the Master Mason’s but the most elaborate and beautiful was that carved by his ‘prentice who, so\n\n \n\n27\/5\/19\n\nEdinburgh\n\nlegend says, was killed by the jealous master. We had a most interesting drive back through pleasant country – a Scotch severity & sameness being visible in all the buildings. As regards Edinburgh I was regretfully compelled to admit that German streets are much cleaner. Midshipman Jock Hughes Hallett of HMS Lion was in to afternoon tea and is a fine lad much grown since last we met. What a down a lot of these people in these old countries have on the poor unfortunate worker! We dined and afterwards went into the gardens immediately opposite and there sat and talked until late. Came back and listened to a deal of music and drank several w’s and s’s with the Colonel before going to bed. Today Miss Thompson – under sentence of death from the doctor in 3 mos. brave unconcerned but taking little drug tabloids.\n\n \n","80":"\n\nEdinburgh\n\nThe city was very gay this morn and Princes Street especially so with flags flying noticeably the white St Andrews cross on a blue background. All this because Sir D Haig was to be received in style here today and laureated at the University. Went up the street about noon and found crowds of people about waiting and an airship cruising round and doing a hover over the city. Soon Sir D. looking (as usual) wonderfully well groomed passed in a carriage and got a good reception. The General Sir Henry Horne also passed and Lady Haig. Returned to 27 Abercromby Place and lunched and the car took us off at 2 with Hector Menabl. We went out to North Berwick. The country was looking well this fine spring day. Passed through the\n\n \n\n28\/5\/19\n\nLondon\n\nvillage of PrestonPans – a dull dirty looking place. Skirting the beach we noticed that all the trees were bent one way and twisted by constant winds. Aberlady was a good village but Dirleton was really good. An old castle, fine spreading trees, a large village green and flower surrounding dwellings earn for it \nfor\n the title of the prettiest village in Scotland. From here an excellent view of the famous Bass Rock which I am glad to have seen and then a quick and pleasant run home in the Colonel’s fine car. Passed in fullest view of Arthur’s Seat, Salisbury Craigs and the Palace of Holyrood so beautifully placed. Dined well with the Colonel and Audrey and after a walk in their garden we prolonged music and discussions over real Scotch & went to bed at 11 pm.\n\n \n","81":"\n\nEdinburgh\n\nThere is a solid severity and prosperous sombreness about the look of places here that has its charm. Left at 12.30 in the car for Alloa. Our route took us over lovely green country trim stone walled fields and any amount of splendid green trees. We soon left the outskirts of Edinburgh and the next large place of note was Linlithgow with its old castle. We passed many schools and specially remarkable was the number of red headed youngsters. At Stirling the aspect of the country changed. Its old castle dominates the town a little dour but the aspect of the country changes. Here are high craggy mountains with heads wreathed in mist and emblems of Highland character. We went close to the field of Bannockburn and remarked Wallace’s Monument.\n\n \n\n29\/5\/19\n\nEdinburgh\n\nFrom here to the industrial town of Alloa was not far and we had afternoon tea with Moir the factor for the Earl of Moir. Very nice people whose son was a Lt.Col. with DSO MC commanding a battalion of the Seaforths. Our return journey brought us back to Edinburgh at 6.30 and after dining at 7 we passed an evening at cards and conversation. The Col. today has been given command of the Territorial 7th Argyle & Sutherland Highlanders and though protesting unwillingness “methinks the lady doth protest too much!\" Imbibed a not inconsiderable quantity of port and the national heathen dew of this hospitable country. A great assembly of kirk folk is now in congress and N.Fs Wee Trees and other weird sects are all around the town.\n\n \n","82":"\n\nEdinburgh\n\nUsual morning promenade around the streets evoked nothing of more than passing interest. After lunch went out in the car to Hawthornden. Unfortuanately a hazelike smoke hung over the whole countryside and restricted view. The many little glens we passed had small rocky brooks trickling through them. The roads all lined with stone walls and the fields (rather larger holdings than in England) marked out with hedges. Noticed a monument where the Covenanters were dispersed and also on a wall (this latter near to Edinburgh) the stone of Flodden Field – a tablet showing where a rally had been made round some standard or other. Dined with the Colonel & Audrey and thereafter wined and had music.\n\n \n","83":"\n\nEdinburgh\n\nShopped and filled in morning. Midshipman Jock Hughes Hallett came to lunch and went out in the car with us. We went out nearly as far as Peebles the road taking us through scenery very like the Highlands. Bare hills, heather covered fields bounded by stone walls. The tops of the hills brushed by the clouds and sheep and Highland cattle on the slopes. Turned down to Romans and ran back into Edinburgh passing close under the Salisbury Craigs and Arthur’s Seat. The Palace of Holyrood is typically Scotch and its environs have severe uniformity also impressed on them. Dined with Jock & the others and he recited after we had had music. A fine kid – we would laugh at him in Aust. but he is the true metal.\n\n \n","84":"\n\nEdinburgh\n\nWent with Audrey to 0St Johns Church in Princes St – the fashionable church full of well fed unctuous and eminently respectable folk. After we had lunched we had a turn in the gardens and there met an officer of the Argyle and Sutherland Highlanders and his wife. Their little youngster afforded us much amusement all the rest of the \nmorning\n afternoon. We dined quietly in the evening and then we talked all till bed time. This morning the view of the Castle from Princes Street was superb – the embodiment of Scotch character standing up on its stern crags. There used to be a loch at its feet but now there exists a fine garden which today was ablaze with tulips and rhodedendrons. To bed after 11.\n\n \n","85":"\n\nEdinburgh – London\n\nMade Adieux and left Waverly Station at 10. Amusing to see the Station Master wearing a top hat. The run to London uneventful and pleasant. A good view of York Minster and the Peterborough Cathedral on the train. It is the ordered regularity of the fields etc here that constitutes the difference between our country & this. In their paddocks there is no “picking up\" to be done. In Paddington at 7.25 after a tube run from Kings Cross. Got my hotel room and dashed off to catch a train for Hammersmith. Went to the Kings Theatre got a ticket dashed up the stairs and took my place just at the exact moment the curtain went up on a good rendering of “Mignon\". Bed midnight.\n\n \n","86":"\n\nLondon\n\nA very busy day. Found in “Times\" that a C.M.G had come to me so made for tailors and had it sewn on. Then to the Bank and then down to Buckingham Palace where a crowd had already assembled to see a march past. Saw Queen Mary, the Princes, Queen Alexandra drive up and then the head of the column of troops came in sight having left Hyde Park where the colours had been trooped. The massed bands in full glory looked very fine preceded by their drum majors. The King rode behind them escorted by the Prince of Wales and Duke of Connaught. Sir Douglas Haig came later and got a good reception from the people. The Guards then marched past. Lunched at the old Cock Tavern and went to Horseferry\n\n \n\n3\/6\/19\n\nLondon\n\nRoad and did other errands all the afternoon. The business people seem to be a gang of robbers and cheerfully ask the most exorbitant prices. Went out by tube to Elliot & Fry’s at Baker Street and had my photograph taken. Dined at hotel and then went out to Hammersmith and saw La Tosca well done.\n","87":"\n\nDid much tearing about London until 11 a.m. looking in at St. Pauls where scaffolding was still erected and work going on in the interior. This seems to be a semi perpetual job as every time I have been in since 1916 the chisels have been busily sounding. Left London at 12.15 in rain and reached Warminster at about 3.15. Settled down in camp very soon and had a yarn with Colonel James. News of Grand Parade winning Derby at 23-1.\n\n \n","88":"\n\nSutton-Veny\n\nA hot day and I did little beyond wandering round and talking to different people. Shifted over into a new camp and by the evening had accomplished quite a lot of work and arrangements in connection with the quota.\n","89":"\n\nFair and warmer. The remarks for yesterday apply equally to today. Held a conference of company comdrs. In the evening went down to No. 1 A.G.H. with Colonel James and there met a number of sisters two of whom we took to a concert given by a 3rd Divisional concert party. It was exceedingly good. Afterwards James and myself walked home along leafy sweet smelling roads in the moonlight. Nightingales & cuckoos singing – the latter are so numerous as to be a nuisance with their calls.\n\n"}}