{"Document Name":{"0":"Diary_0308","1":"Diary_0308","2":"Diary_0308","3":"Diary_0308","4":"Diary_0308","5":"Diary_0308","6":"Diary_0308","7":"Diary_0308","8":"Diary_0308","9":"Diary_0308","10":"Diary_0308","11":"Diary_0308","12":"Diary_0308","13":"Diary_0308","14":"Diary_0308","15":"Diary_0308","16":"Diary_0308","17":"Diary_0308","18":"Diary_0308","19":"Diary_0308","20":"Diary_0308","21":"Diary_0308","22":"Diary_0308","23":"Diary_0308","24":"Diary_0308","25":"Diary_0308","26":"Diary_0308","27":"Diary_0308","28":"Diary_0308","29":"Diary_0308","30":"Diary_0308","31":"Diary_0308","32":"Diary_0308","33":"Diary_0308","34":"Diary_0308","35":"Diary_0308","36":"Diary_0308","37":"Diary_0308","38":"Diary_0308","39":"Diary_0308","40":"Diary_0308","41":"Diary_0308","42":"Diary_0308","43":"Diary_0308","44":"Diary_0308","45":"Diary_0308","46":"Diary_0308","47":"Diary_0308","48":"Diary_0308","49":"Diary_0308","50":"Diary_0308","51":"Diary_0308","52":"Diary_0308","53":"Diary_0308","54":"Diary_0308","55":"Diary_0308","56":"Diary_0308","57":"Diary_0308","58":"Diary_0308","59":"Diary_0308","60":"Diary_0308","61":"Diary_0308","62":"Diary_0308","63":"Diary_0308","64":"Diary_0308","65":"Diary_0308","66":"Diary_0308","67":"Diary_0308","68":"Diary_0308","69":"Diary_0308","70":"Diary_0308","71":"Diary_0308","72":"Diary_0308","73":"Diary_0308","74":"Diary_0308","75":"Diary_0308","76":"Diary_0308","77":"Diary_0308","78":"Diary_0308","79":"Diary_0308","80":"Diary_0308","81":"Diary_0308","82":"Diary_0308","83":"Diary_0308","84":"Diary_0308","85":"Diary_0308","86":"Diary_0308","87":"Diary_0308","88":"Diary_0308","89":"Diary_0308","90":"Diary_0308","91":"Diary_0308","92":"Diary_0308","93":"Diary_0308","94":"Diary_0308","95":"Diary_0308","96":"Diary_0308","97":"Diary_0308","98":"Diary_0308","99":"Diary_0308","100":"Diary_0308","101":"Diary_0308","102":"Diary_0308","103":"Diary_0308","104":"Diary_0308","105":"Diary_0308","106":"Diary_0308","107":"Diary_0308","108":"Diary_0308","109":"Diary_0308","110":"Diary_0308","111":"Diary_0308","112":"Diary_0308","113":"Diary_0308","114":"Diary_0308","115":"Diary_0308","116":"Diary_0308","117":"Diary_0308","118":"Diary_0308","119":"Diary_0308","120":"Diary_0308","121":"Diary_0308","122":"Diary_0308","123":"Diary_0308","124":"Diary_0308","125":"Diary_0308","126":"Diary_0308","127":"Diary_0308","128":"Diary_0308","129":"Diary_0308","130":"Diary_0308","131":"Diary_0308","132":"Diary_0308","133":"Diary_0308"},"Date":{"0":"unknown","1":1574.0,"2":1575.0,"3":1576.0,"4":1581.0,"5":1582.0,"6":1583.0,"7":1584.0,"8":1585.0,"9":1586.0,"10":1587.0,"11":1588.0,"12":1589.0,"13":1590.0,"14":1591.0,"15":1592.0,"16":1593.0,"17":1594.0,"18":1595.0,"19":1596.0,"20":1597.0,"21":1598.0,"22":1599.0,"23":1600.0,"24":1601.0,"25":1602.0,"26":1603.0,"27":1604.0,"28":1605.0,"29":1606.0,"30":1607.0,"31":1608.0,"32":1609.0,"33":1610.0,"34":1611.0,"35":1612.0,"36":1613.0,"37":1614.0,"38":1615.0,"39":1616.0,"40":1617.0,"41":1618.0,"42":1619.0,"43":1620.0,"44":1621.0,"45":1622.0,"46":1623.0,"47":1624.0,"48":1625.0,"49":1626.0,"50":1627.0,"51":1628.0,"52":1629.0,"53":1630.0,"54":1631.0,"55":1632.0,"56":1633.0,"57":1634.0,"58":1635.0,"59":1636.0,"60":1637.0,"61":1638.0,"62":1639.0,"63":1640.0,"64":1641.0,"65":1642.0,"66":1643.0,"67":1644.0,"68":1645.0,"69":1646.0,"70":1647.0,"71":1648.0,"72":1649.0,"73":1650.0,"74":1651.0,"75":1652.0,"76":1653.0,"77":1654.0,"78":1655.0,"79":1656.0,"80":1657.0,"81":1658.0,"82":1659.0,"83":1660.0,"84":1661.0,"85":1662.0,"86":1663.0,"87":1664.0,"88":1665.0,"89":1666.0,"90":1667.0,"91":1668.0,"92":1669.0,"93":1670.0,"94":1671.0,"95":1672.0,"96":1674.0,"97":1675.0,"98":1676.0,"99":1677.0,"100":1678.0,"101":1679.0,"102":1680.0,"103":1681.0,"104":1682.0,"105":1683.0,"106":1684.0,"107":1685.0,"108":1686.0,"109":1687.0,"110":1688.0,"111":1689.0,"112":1690.0,"113":1691.0,"114":1692.0,"115":1693.0,"116":1694.0,"117":1695.0,"118":1696.0,"119":1697.0,"120":1698.0,"121":1699.0,"122":1700.0,"123":1701.0,"124":1702.0,"125":1703.0,"126":1704.0,"127":1705.0,"128":1706.0,"129":1707.0,"130":1708.0,"131":1709.0,"132":1710.0,"133":1711.0},"Entry":{"0":"\n\nOpened evening of ","1":"\n\n1.\n\nDay of rumour. Peronne and Bapaume in the hands of the Boche, and hard fighting in High Wood, then Peronne has been recaptured by the French, and big bagging of prisoners. Bapaume still being defended hardly by Byng’s Army, and High Wood the scene of more warr.\n\nBut the greatest rumour of all, Paris being shelled! The Boche have a new gun, of wounderful sizing, and its shells are travelling to Paris. Yesterday we heard of Calais being shelled! – we substituted bombs for shells, but …\n\nIt looks as though John Masefield’s \"The Old Front Line\" is a little early as a guide book, as though \"The Old Front Line\" will be our New Front Line. Word is rumoured of La Somme again for us.\n\nThis morning a tremendous sky of still clouds: a cold evening and rain.\n\nMet here the R.C. Padre of Dranoutre, yarning a while with him of Francis Thompson\n\nMarch 25\n\nand loaned him Clarke’s \"The Vengeance of Fionn\", Shelley his favourite poet.\n\nPosted to T.B.C. £2 on account, ordered Alec Waugh’s book of poems, and Gilbert Frankeau’s, both \"in the press\".\n\nA Book list. \"Limehouse Nights\", \"The Tenth Verse\", \"Rebel Songs\", \"Dorian Gray\", Rupert Brooke, Keats, and \"Songs Before Sunrise\", \"The White Stone\", \"English Cathedrals\", \"Walter Pater\", \"Belgium’s Agony\", \"Fler d’Lys\", \"Pastorals\", \"Cadences\", \"Under the Greenwood Tree\" and Ruskin, in A, B and C Section Panniers, in Dispensary Cases, Orderley Room Boxes, and on the Cars.\n\n2.\n\nLater. Heavy fighting in High Wood, and the Boche dead number 200,000. The French counter-attacking now. From Corps.\n\nThe shelling of Paris by 9.5, and the nearest point of Boche land to Paris 60 miles away, so the gun must be within our lines!\n\nOur counter-attack on the Somme still to come: still for these there are intact the Guards, Scots and Australians.\n\n3.\n\nRadio back, so lose my babbling job, reserve dresser, as turning in. Raining again, and for the last half hour a heavy bombarding. The first for some days on the sector.\n\nMarch 26\n\n4.\n\nTurning read \"The Queens Room\" Scene of Chastelard. Bobby left the book with Murph, he giving it me yesterday.\n\n5.\n\nA talking this morning around the stove – a cold day after a cold night – of the Somme, and a retelling of old happenings, of Bib at Longueval the night we were back from Flers, Bib who naked and swam through the lagoons of mud by Delville Wood, full of rhum, back to the A.D.S., in the hut, sleepily murmuring, \"Christ! but I’m cold – m’ feet are dead!\" – and cupping the candle with his hands, of the Becordel celebrations, of the light rail stunts between Factory Corner & Byzantin – joy rides down hill and over valleys, taking all before us, to the tune \"Yer silly barstard!\". That line killed none of us, but our casualties about it were heavy.\n\nMorning’s rumours, only of the French taking over charge of our Armies in the Somme, in which case there is the reasonable hope that some imagination will be shown beforehand – and less in the official \nafter\n reports.\n\nPosted home \"The Tenth Verse: & to Mrs. H. \"Walter Pater\" and \"Belgium’s Agony\".\n\nEric G. Passed to me Daudet’s \"The Nabob\", Lotus Library.\n\n6.\n\nMail: from T.B.C., John Davidson’s \"Holiday and Other Poems\" and T.L.S. of March 21.\n\nHodder & Stoughton publishing collected ed. of Leonard Merrick and of Barrie’s plays. Heineman two new books of Masefield and verse book of Siegfried Sassoon.\n\nMarch 26\n\nFrom Davidsons essay \"On Poetry\" in \"Holiday and O.P.\",\n\n\"Rhyme is a property of decadence: but decadence is always the manure and root of a higher manifestation of that art.\"\n\n\"The world will yet know more essential personalities than Buddha and Christ, greater men than Caesar and Napoleon, deeper passion and wider humanity than Shakespeare’s, a music still more elemental than Wagner’s, a sadder soul than Schopenhauer’s, a more triumphant intellect than Nietzsche’s, beauty more enthralling than Helen’s.\"\n\n\"Blank verse is rude poetry, barbarous and beautiful, or athletic and refined, but always naked and unashamed.\"\n\nT.B.S. announces new book of George Moore’s, to be published presently, and of a book of Irish verse from Fisher Unwins. Will write to T.B.C. for both.\n\n7.\n\nFrank K. and Bib back from Paris and speak of shelling and of Amiens being heavily bombed & shelled, and Abbeville shelled.\n\nRumour takes the Boche to Pozieres, and on to Albert. If our flanks hold, and the rumour of the French bringing up new divisions, there should be shortly rumour of a coup.\n\n8.\n\nStart today at end of journal, a collecting of heard fragments.\n\n9.\n\nA night of full moon, and sharp frost-clearness, planes over and across and over, anti aircraft and M.G. tracer bullets.\n\nThere’ll be long raiding tonight!\n\nMarch 27\n\n10.\n\nHand-to-hand fighting in Albert: Noyon won from the French, and 85,000 Boche cut off by the British and French. (\"Lies, Lies, all lies!\")\n\nYesterday paper admits \"some tanks have been lost\".\n\n11.\n\nThis morning through Bailleul on Ambulance to 2nd C.C.S. Shelling has been directed only at the square, at the two tower buildings, the Church and the Hotel de Ville, the tower of the Hotel de Ville across the square, and each end of its buildings crushed in and wrecked to heaped debris, the organ loft, and aisle and nave roofing of the church jagged open where shells have landed, and the tall windows \nfull of\n full of broken glass. Somehow the tower has stood: now it stands lonely across from the ruin of the Hotel de Ville.\n\nThe wrecked tower was not beautiful: but it was strangely typical of its builders, stolid and crowned by a fantastic belfry and tower, the small even old stonework of its lower building, till it lifted from the high steep roof to a deep frieze of bare brick tracing, full of quiet beauty, and contrasting well with the red brick of the building it rose from. The Café de la Marie, with its steep roof sweeping up to it, a heaped wreck by the tower ruins.\n\nA colder day than yesterday: sky of even luminous grey, and fields brilliant under the clear light, a lovely loveliness and majesty about the Church’s tower. Its bells should toll for Bailleul’s useless destroying, there\n\nMarch 27\n\nwould be a world of pain in their slow clanging.\n\n12.\n\nMail, a letter from Mother, no date, but of January, a cheery letter of the facinating \"little news\".\n\n13.\n\nA reading by the fire of two of the tales of \"Limehouse Nights\". \"The Paw\" that opens with a full page exquisite writing of spring –\n\n\"Beyond London, amid the spray of meadow and orchard, bird and bee were making carnival, but here (Pennyfields) one still gambled and waited to find a boat…. Lusty spring may rustle in the hedgerows; golden-tasselled summer may move in the meadows. In Limehouse there are only more seamen or less seamen. Summer is a spell of stickiness, and winter a time of fog.\"\n\nSome may perhaps desire to escape from the \"who long .. to kiss their faces to the grass, to lose their tired souls in tangles of green shade…\"\n\nSo to the telling of ..\"the most shuddering tale that the Chinese quarter can tell\". It is a tale of full of horror, only de Vere Stacpoole’s grotesqueing in \"The Pools of Silence\" can approach to it: Poe is out-Poed. Burke exquisitively tells of horror.\n\nFrom \"The Paw\" to \"The Bird\" a,\n\n\"Tale they tell softly in Pennyfields, when the curtains are drawn, and the shapes of the night shut out.\"\n\nMarch 27, 28\n\n\"Gina of Chinatown\" opens exquisitively,\n\n\"Memory is a delicate instrument. Like an old musical box, it will be silent for long years; then a mere nothing, a jerk, a tremor, will start the spring, and from beneath its decent covering of dust it will talk to us of forgotten passion and desire.\"\n\nSo to the tale of Gina of Chinatown, a Reminiscence of a dirty theatre near Blackwall, and the inspiration of Burke’s second novel, \"Twinkletoes\".\n\nBurke has the loveliness in his prose of Materlinck and of Pater, the realism of Ghorki and Artzebashof .\n\n14.\n\nThere’s rumouring of Amiens being shelled, of the Boche strong to get there. Then there’s the danger the Cathedral shrine of the loveliest windows of the world, the rose windows of Christian saints, Paganly magnificent, falling by the bloody beastliness of a country without a soul.\n\nMarch 28\n\n15.\n\n11 a.m. Rumour is trend: the Boche are past Albert by three miles. Henencourt of our last summer’s spell is theirs.\n\nRumours dying telling is of Kitchener travelling from the East leading 3 million Japs. How is the Boche bringing up his heavy artillery? Perhaps he’s using ours as its captured.\n\nPosting away books, it’ll be travelling light for La Somme shortly.\n\nMarch 28, 29\n\n16.\n\nAfternoon: Our 4th Division, the N.Z. and the Guards are holding the Boche by Beaumont Hamel. Good old 4th, they’ve been in every stunt of the fighting in France and Flanders, with the exception of Vimy Ridge and the Beaumont Hamel. So Henencourt is still ours, so \"Ginger’s all right\". \"I’ll bet she’s P.O’d long before this!\", says Sol.\n\nProbably we leave here on April 2. Tommies doing forced marches to relieve us.\n\nPosted away \"The White Stone\" and \"Rebel Songs\" home.\n\nA grey day, and cold hard winds.\n\nMarch 29\n\n17.\n\nGood Friday, and agonies of gas amongst Artillery chaps through the M.D.S. Two dead here this morning, two dying in Buck’s car.\n\nThrough Bailleu with cars. Bailleul with her deserted streets and lovely tower has the air of a mourning woman whose beauty and lovers are gone. The utter feeling of loveliness is as poignant in its way as the tragedy and desolation of grey Ypres, but Ypres in her death is expressive of a tragedy that mourning would demean, in her grey ruin wander quietly and sadly the artists of her buildings.\n\nBapaume in her ruin, had a horrible air of thwarted terrible intention, and the cold hatred of the retreating Boche being about her ruin buried streets.\n\nAlbert?, the ruin of her cathedral expressed blatant pretentious grief, a shallow proud vanity being about her ugliness, the quiet poor silence of the little village was far more heart-rending than all Albert’s \nwork\n ruins.\n\n18.\n\nPosted away Diaries IV and V and the old Henencourt sketch book, to Mrs. H. Will post home \"Holiday and O.P.\" of J. Davidson. \"Fleur de Lys\" (M.F. book) and \"Ginger Mick\". Will have to chance the losing of \"Ginger M.\" and the Henencourt Rue de Bas autographs and Dranoutre Xmas Day page.\n\n20.\n\nAdamson back to unit two days ago.\n\nMarch 29\n\nMail: receipt from Davies & Oriole for 141.\n\nRain blown across the country, sun, and brief patchings of blue amongst great deep clouds, cold.\n\nEvening: yesterday and today, a cleansing out of panniers, medical cases, and O.R. boxes, equipment all cut down, for move to La Somme, so tonight have \"Songs Before Sunrise\" again.\n\nPosted to Mrs. H. package of first four numbers of \"Gheitz\", the first three of \"Aussie\", Hunt’s \"Cadences\" and Sydneian of Dec. 1917, and home to Geoff copies of late Anzac Bulletins.\n\nRead today chapter of \"St. Pauls, London\" of Bond’s, some good theory of Architecture in it, and an interesting essay.\n\nTonight a short sudden bombardment, flicker of light around the black sky, flickers passing in even waves.\n\nWhat is the position of the 4th Divy.: reports following official reports place them at Beaumont Hamel, north of Beaumont Hamel, and now at Dernancourt.\n\nThe \"Rumour\" of note is some point of the bayonet charge by us, and a bag of four Divisions and the French somewhere attacking, taking 3,000 prisoners.\n\nMarch 30\n\n20.\n\nRumour lifts her lying head. The Boche is on the offensive in the Somme, and the 3rd Divy. has driven him back 2,000 yds. 10 divisions have been flung against Vimy Ridge, and luridly she whispers our troops have lost it.\n\nRusty comes in very snooty, at the 2nd Batt., a Major coming up to him asked, \n\n\"Do you belong to the Transport?\" \n\n\"No sir!\" \n\n\"Then why have your putties tied around the ankle, what do you belong to?\" \"1st Field Ambulance!\" \n\n\"Ah!\"\n\n\"It’s all these Tommy-inspired – think about: saluting and damned imitation disception – we must bloody well win the war y’ know!\"\n\nYesterday on the way back from one of the C.C.S. trips, by the road to Loche, nailed against the trees, was a great notice, \"all wastage drags the war out\", and about 40 staff cars pass it in a half day.\n\n21.\n\nBack from 11 C.C.S. – Tommy, with 1st Pioneer chaps, head wounds, arm and leg. On the way down took his boots off, and threw them down in the car, and forgot them. At the C.C.S. after the Bearers had taken him in, one of them sighted the boots, and fancied them – arrogantly: so I told him he couldn’t have them, and he brought the Sergt. out. So my\n\nMarch 30\n\nname’s been taken for removing and detaining gear from a patient. It grates me horribly to see a Tommy wearing our gear: for a while at the 2nd C.C.S. some had the damned nerve to wear our hats, all wore Australian boots, taken from stretcher cases.\n\nNo mail, and a cold dully raining day. Finished the reading of the last tale of \"Limehouse Nights\". Basil up from C. Section post and gave to him Verhaeren’s \"Plays\".\n\n22.\n\nToday Sol was speaking to some of the Tommies up from the retreat on the Somme, and they tell of a terrible debacle – more terrible than the retreat from Mons, of staff officers full of wind and contradicting orders, of roads lined with abandoned limbers and wrecked G.S. wagons, of loose flying about the roads & about. But the worst is their telling of the Airmen, of the Boche planes ruling: all that has been reported of our Flying Corps. standing true for the Boche. Has the Mons stunt been played again? When will the English realise they have no genius for tactics and warr managing. If the French would only take over our decoratively useless staff, cut down their and use them as office boys. \n\nIn the whole warr, not one great sweeping advance has been made by the English, and their successes have not – considering numbers – touched even the faint fringe of the successes of the French.\n\nYesterday’s Daily Mails Black Type heading was – \"Hurling the Germans back\". Hurling? How did the Germans get over line where it runs now?\n\nThe greatest British victory was the Cambrai stunt – when bells tolled the Nation’s joy, at a terrible loss to us of men, guns and tanks: another debacle.\n\nIf only we had a French supreme command! but the British narrow vanity of Sir Douglas Haig and his generals would carry them to a following of General Robertson’s example.\n\nI wonder if,\n\nEngland is what England seems \n\nAnd not the England of our dreams,\n\nBut only putty, brass and paint? \n\nKipling’s last line seems a horribly ‘Tommy’ ending! Swinburne was right.\n\n23.\n\nAt De Zon camp in O.R. saw new clay copying press and box of coloured inks, these the Col. promised to req. for, so now as soon as we’re next settled will bring out a No. 5 Gheitz – a \"Back to the Somme\" issue.\n","2":"\n\n24.\n\n\"Limehouse Nights\" holds the favour beyond Mlle. de Maupin. Sol’s criticism, after a pause following \"Tuppy’s reading it\" – \"awful book\", as good as Sully’s summing up of de Maupin – \"its melopticious!\" \"Dauter\" holds favour well. I’d intended sending it to Geoff, but will leave it for unit reading.\n\nNo confirming of losing of Vimy Ridge, report of midnight 29 admitted attack by six divisions supported by force, but reported are still holding. Saxons have been in the front, a raid last night brought prisoners – Boche labour men and pioneers. Its evident our Pioneers and theirs are of different standings.\n\nUp at 6.30 and its raining hard: now, about 9, clouds are coming up over an April sun. The sky of evening full of strange lovely colourings – grey clouds over the bowl, and delicate reflections and of lights about the horizon, now a deep sky of soft stars.\n","3":"\n\nTonight out of D.R. met on duckboard Capt. Murphy and a yarning of the loveliness of the evening, of etchings – suggested by the fine silhouettes of the trees: of poetry, and the novel. So straight to Hut, and by the fire, am here listening to Sol’s tales of the College, then half a dozen about us, general yarning of syphilis.\n","4":"\n","5":"\n\nBack from De Zon Camp, hearing there of A. Section moving today to Renescure.\n\nLosing two years, today we arrived in the mist of the morning at Marseille, and spent a day in the stream wondering at all the colours of the sun over Marseille. Losing one year, today we left Buire for Aveluy, land where the Boche rules.\n\n27.\n","6":" dumping of books commences. This from Act 3 of Chastelard,\n\n\"Have you read never in Fr. books the song\n\nCalled the Duke’s song, some boy made ages back,\n\nA song of drag nets hauled across thwart seas\n\nAnd plucked up with rent sides, and caught therein\n\nA strange-haired woman with sad singing lips\n\nCold in the cheek like any stray of sea,\n\nAnd sweet to touch? So that men seeing her face\n\nAnd how she sighed out little Ahs of pain\n\nAnd soft cries sobbing sideways from her mouth,\n\nFell in hot love, and having lain with her\n\nDied soon? One time I could have told it through,\n\nNow I have kissed the sea-witch on her eyes,\n\nAnd my lips ache with it: but I shall sleep\n\nFull soon, and a good space of sleep.\"\n\nCompare with Wilde’s \"Fisherman and his Soul\".\n","7":"\n\n28.\n\nTurning in, still at La Clytte: ‘De Zon’ Camp emptied of its men, and all A Sect. there now at Reninghelst. Several shells have passed over us here – and seemingly landed at R.\n\nAerial activity this morning. Boche planes over, and one chased to earth by Vllamertinghe .\n\nThis afternoon to Gottesveldt – to 11th C.C.S., back through Mt des Catz , Mt Deveden, and home.\n\nPadre O’Brien returned \"Vengeance of Fionn\". He’s a fine type of man, richly tolerant and popular all round: he’s the one Padre I would enjoy a confiding with: he is well read, a poet, and the ideal R.C. and his manner is charming.\n\nT.L.S. a quite interesting issue.\n\nOh for the hot sun and the golden days, today’s been warmer than usual, the sky a milky tourquoise, well clouded about the horizons. But I long for the days that burn brown the face and hands \nthat\n and the nervy knees, for the old Henencourt days of training when the beauty of our chaps was one with the colour of the days, and their marching to a high and band more splendid than life.\n\nApril 2\n\n29.\n\n10 a.m. No word of our handing over M.D.S., probability of our holding here for few days, before leaving for the South, rumour strangely silent as to our destination. Arras? or Nieuport?\n\nWriting a slow letter to Mother, nothing seems to provide news, started to write of the R.C. Padre, Father O’Brien and half commenced a censoring of the general Padre, but even if Mother would understand my attitude its not worth while.\n\nPerhaps the three Padres dodging about the Resuscitation Tent at Dickebusch were exceptions but they were \"bloody nuisances\".\n\nWrite to T.B.C. for Moore’s \"Story Tellers Holiday\" and after a deal of thought, for Stephen’s \"Crock of Gold\".\n\n30.\n\nTurning in, move tomorrow from here at 10 a.m.\n\nThe Seaforths and Camerons have arrived from the Somme. During the afternoon Dick H. and self to the Y.M. and a meeting them there, and a long listening to their yarning and telling as only the Jock can tell, tales of retreats and stands, tales told in splendid rapid phrases, brilliantly impressionistic.\n\nTonight with Eric G. a yarning with two\n\nApril 2, 3\n\nof the Camerons: one a short stocky Scot, broad and rich in his phrases: the other of medium height, and lovely build; his face, hands and knees burned golden, with rich blood under: a slim grace about his body, and nervely splendid legs – \"shewed splendidly, and sunburned to the bone!\" His voice soft and clear, and his expressions following each word – a mythopoem of all Scotland!\n\nHeavy rain after a day of sun and passing clouds.\n\nApril 3\n\n31.\n\nHoograaf, Billets\n\nM.D.S. La Clytte taken over this morning by Tommies: left there about 11 and arrived here about midday – in hut Billets in a cold camp. Rumour of waiting here till 5th then entraining for --? The villagers tell us we’re \nnot\n going to the Somme, usually they know more than we, so the old rumour of Nieuport resurrects itself.\n\n32.\n\nThe last incident of La Clytte: at 2 a.m. the night-staff got even – inspired by \"that – Woodbiner\" – with the day staff. At 2 about four on either side of the long bow hut, arrived with short iron staves, at a given word started a running of the staves over the iron corrugated roof.\n\nI lay stiff and dead in the instant, striving to feel the falling all over of bricks and tangled iron, the next instant I knew the Boche was all round us, riddling the hut with M.G. bullets, then we all recovered, and the curses of a full hut rang down the night.\n\nThe moment of sudden awakening was the worst I’ve ever known. Five minutes later shells of long range guns purred over us.\n\nTonight a sleeping with one blanket, and a great coat. It’ll be trooper fashion again.\n\nShort letter written & posted to Mother, and letter to T.B.C. written yesterday.\n\n33.\n\nTime and again, in reverie, or walking alone the last line of one of William Watson’s poems has gone singing through my ming . \"The throb of the bliss of the rose, and the pomp of the nightingale’s pain\". Tonight on the grout for safety pins to manipulate a single blanket. Charles T. passed me – from Basil – the Dec. Today with the full poem and a sketch book. So I copy tonight the poem on the first page of this journal.\n\nApril 4\n\n34.\n\nBack from a route-march about towards Pop. H.V. shells landing there.\n\nDull misty threading rain. This afternoon a full marching order parade for kit inspection. If an officer’s kit inspection were to happen, at least one of our G.S. wagons would be free for unit gear.\n\nIf there’s a retreat when we get to the Somme, hope to God the Col. and Interpreter lose their various flash uniforms.\n\n35.\n\nSmith tells a good tale of an Englander. In a railway carriage two Australians and an Englander..\n\n\"And you boys are from Australia?\" \n\n\"Yes sir!\"\n\n\"Then I’m glad to meet men who have come so far to fight for dear old England!\"\n\n\"For England? we’re fighting for the Empire, and England’s only a very little place!\"\n\nSam ends the tale – \"Oh poor old – was completely euchred!\"\n\n36.\n\nIn top bunk, thankful for the night. All dullness with the mist and rain, and a dirty muddy camp.\n\nAfter tea for a walk by self, through Abeele and back. Tonight even a ballad of Chopin’s would stop dead at my ears, and a song of Schumann’s would depress me the more.\n\nI’d like to be in a high dull-days-blue room, turning a great black folio of drawings by Ricketts or Beardsley or color sketch of Conder or Whistler or etchings by Brangwin or Pennel , and the light two high solitary candles in silver candlesticks, then the Chopin melody, and H. playing, but then I’d leave the folio, and when the melody lingers …\n\nDamn this bloody war!\n\nTo bed to read, \"Lazily she lingered –\". Hope Austin Clarke soon publishes some more poetry.\n\nRumour of the 2nd being by Dixmude, and the Boche reorganising and massing on the Somme for new attacks. No rumouring lately of the 3rd or 4th, but last night sorrow in the hut – Sam W. said he’d heard that the 35th Batt. had been wiped out.\n","8":"\n\n37.\n\nA wet dirty day, no parade blown – after the five minutes.\n\nGave to Clarrie \"Songs before Sunrise\" and received back \"The Renaissance\".\n\nI wish I were of the bearers again: A. Tent sub. is only bearable while Les is here, the three others constitute the most ridiculous clique of the unit, their world is their own and their charm is for and amongst themselves alone. \"Mother\" with her Reubenesque buttocks and affectedly girlishly motherly manner is the least ridiculous, possessing some sense of humour.\n\nApril 5\n\nBuckholz – to use his own mouthed adjective – is despicable, he holds in his narrow nature all the characteristics of his people. Johnny seems all he cannot understand as heresy, hardly a day passes but \"Oh you sorts\" damn sore lad. More than once he has honoured me with the distinction – most amusingly even when I expressed wonder at the dressing of the miners women of Newcastle. \"—Oh you sorts think that because a man works he can’t dress well!\", etc. etc.\n\nThere’s a wounderful compassion with the bearer cliques. A Section, Toby, Ridge, Clarrie and John – with the newly admitted Joe G. The old clique was good – Nicki, Toby, Bill F., Ridge, Clarrie and self. \n\nB clique holds two of the representative men of the unit, Wilk, and Billy, Les, Caff., Mick, Jimmy, \"Olli\" and Murph compleat.\n\nC’s is charming, half a dozen whose days pass laughing, Ernie S., Les C., Mac, Eric P., Gil, and Harris.\n\nIt grates me horribly this compassion that’s always in my mind. What I only imagined when I joined A sub., now is proved, and this constant self eulogies, and belittling of B and C subs., grates the more. \n\nThank God for a diary, what a terrible inflection this would be on Les or Eric or any of the chaps.\n\nApril 5\n\n38.\n\nFor a folio of Edmund Dulac’s illustrations of exquisite tales. The books that hold his drawings are too bulky for their contents, so the idea is good, to collect the plates from his editions of Hans Anderson and the Arabian Nights, and remount them to a book of stiff Whatman paper – a paper of ivory black, with the plates mounted on an ivory or a powdered gold slip.\n\nWilly Pogany’s books are beautiful throughout, the decorative page-endings being as fine and sometimes more beautiful than his coloured drawings.\n\nArthur Rackham’s illustrations and the books containing these are supplementary.\n\nThere is some new illustration in black and white: one of his drawings from a book of Hans Anderson, I saw at . Must look this book up, published by Harveys.\n\nAll I look forward to immediately is the sun and the days of green and gold, and the future après – a surrounding to a study of building and architecture, and all that architecture means, and a designing of a den and a carving of panels and furnishings for it.\n\nAnd writing this the rumour comes of the Boche stealing from our Pozieres cemeteries our crosses – for the gaping Berliners to sneer at!\n","9":" 5, 7\n\n39.\n\nLeaving Hoograaf tomorrow at 8 a.m. to entrain at Gottesveldt midday.\n\nThis afternoon with Roley K. walking to .., in this tiny village three separate butcher shops – two with real meat, joint signs hanging by the doors.\n\nA sky of wove grey all day: not a sign of white cloud or sun.\n\nLa Somme\n","10":"\n\n40.\n\nLongpre Les Amiens\n\nA long journeying in cattle trucks from midday yesterday till midnight, in the early hours unloading train, then a marching to school house billets in Longpre les Amiens.\n\nTurned in at 5 a.m. and slept till near midday.\n\nThis afternoon with Adj. to the Madeline Cemetary by Amiens.\n\n41.\n\nAt Godi. our truck was deep in fresh horse dung and piss, past St Omer we were lying in deep fresh straw – grouted near Hazebruck from trucks alongside: in the station at St Omer by us was a coal train: half a kilo from St Omer we’d a glowing brazier on an iron stand: and at Calais we burnt the step half through, a good trip and a comfortable one, spoilt by the hurried detraining in thin rain. Detraining would have made a finely coloured impression – a swift lyric of gold and silver, a Dudley Hardy rather than a Frank Brangwin.\n\n42.\n\nThere’s a lot of loose talking of a bomb or a shell having got Amiens Cathedral; but Les F. hears today from local people that yesterday closed with the Cathedral whole. Don R. tells of the great white building opposite the Musee de Picardie being a compleat ruin.\n\n43.\n\nToday – remembered it talking to Adj. – Geoff’s birthday, and no letter written to him.\n","11":"\n\n44.\n\nLate afternoon: a day spent in the Billet drawing and reading. The stack of folding chairs violated and the Billet like a Euchre hall, only Bridge the game. Tables, old school picture lesson wall cards, on the four’s knees.\n\nRain and dull cloud.\n\nThe Boche over last night, and bombs dropped by the village: but slept through it all.\n\nNo pay yet, though its been available since yesterday. Tucker bad: Neeve has evidently taken to heart England’s great effort – boards and notices over France and Flanders, \"Eat less and save shipping\", \"Waste prolongs the war\", etc. etc. Must rub him in next issue of \"Gheitz\".\n\nColoured sketch – yesterday’s – of Amiens from the village hall.\n\nRumours: the Boche attacked two of our Brigades with 4 Divisions, he came a large abdominal. A vague whispering yesterday was of his attacking at one point and losing 10 kilos of his new territory.\n","12":"\n\nBertangles, Bivouaced in the Fields\n\n45.\n\nWe arrived here yesterday afternoon at 3. Wagons unloaded in an old deep grassed orchard, and camp of canvas pitched by 4.\n\nThen till past 8 o’clock the three sections were on parade, waiting the arriving of two Swiss Cottage tents: shortly after 8 they arrived and were pitched, then the parade was dismissed to the tents. All our gear damp from the fine mist rain, and all the while of our waiting, the officers were comfortably tented, and in an operating Tent emptying a case of whisky. For almost five hours they kept us away from tents that would have taken half of us.\n\nSo they still endeavour to follow the orders of Gen. Birdwood, read to us at Quehen last December.\n\nGod help us as a unit if McCrae get W.O.’s promotion and he’s going strong for it – in every detail anticipating a typical Bremensque order.\n\nWe have a trinity of evil geniuses, the Col. M.C., Maj. Lee, D.S.O., M.C. and Sgt. McCrae, D.C.M., M.M., the Q.M. man Neeve runs hard to an M.C. his inner mind dreams of.\n\nApril 10\n\n46.\n\nIn the little cemetery we’re camped alongside, a quiet and lovely ground, hedged from the old orchards. Its avenue of sombre heavy greened trees breaks to a circle, to a transept-like arm for the heavy wood calvary. From the gateways the dully painted Christ and the deep shadows of the roof arching trees, tiny clusters of violets and primroses – pale gold and mauve and angry red, wander like the decoratings of a Florentine brocade over the grass of the avenue, of the side paths and the graves.\n\nAfter breakfast, before parade, by a lone tree by the Calvary I lay and watched the building of a tiny nest, and in a reverie I felt the presence of the dead: of quiet comely dead peasants, who watched me with their souls, wondering at the strange living.\n\nThe only noise is of the trees and wind, and a faint beating of planes, and far behind all, a dull drumfire: all day yesterday, all night and all this morning, the heavies have been firing, and at breakfast outside the tent, three long hospital trains passed across the valley behind the hills.\n","13":"\n\n47.\n\nYesterday’s rumour was of the French and English attacking on long fronts, and taking from the Boche, 7 and 5 kilos of his newly gained ground. And today she speaks cynically of the Portuguese being broken. And tonight: the Boche on Messines again: at Armentieres and Fleurbeaux .\n\n48.\n\nFor a long walk after tea, met Murph by the first hill: around and through a lovely forest – lovely with a carpeting of yellow tall primroses – and the most wounderful of greens: the trees undergrowth a dull madder, and the trees only alive by a faint hazing about their branches.\n\nNo mail again.\n","14":"\n\n48.\n\nMorning: A copy of yesterday’s Daily Mail arrives at the camp: in big headlines the Flanders fighting is dismissed: the greater part of the paper is full of a speech by Lloyd George – of the recall of General Goth and drastic man-power enforcements.\n\nTwo paragraphs of his speech I read, that at this time of the Boche offensive, we were as 3:2, and that the Boche success was explained partly by their having a supreme command.\n\nIt is the last damned English newsdoper I read, our only chance of any success in the war is by a compleat scrapping of all English staffs, and a supreme command \nall French\n.\n\nAll the tents are emptied, our packs lined outside. Last night at 10 orders came from A.D.M.S. of early moving off, and reveille at 5.30. Later they were altered, and now the rumour is of no move till tomorrow evening, then a march to entrain, and back to Flanders, possibly Hazebruck way.\n\nIn bed last night before orders came around of the early move, Basil to the tent, and a yarning over an issue of Gheitz, a new typewriter in the O.R. saves the printing.\n\nCover decided on – Neeve painting a binding – \"Eat less\" notice – just compleating the \"and save shipping\". Book sketch a few bell-tents and bivouacs. Writings, general rules – of McCrae’s charmingly spoken orders – of Maj. McKillop’s losing us yesterday afternoon – losing us with his map. Long discussing as to wether it would be desirable to use \"Gheitz\" to launch A.B. and C’s complaints about slackness in cookhouse, and our never changing mince of stew and uneatable curry.\n\nEarly this morning a long heavy bombardment, the day dull with wet mists.\n\nApril 11\n\n46.\n\nThree times during today’s lovely sun – afternoon – the Boche planes have been over dropping bombs, now, in the blue of the evening shrapnel flashes over the aerodromes.\n\nThe sky’s of darkening blue, and heaped clouds, every little while a white bright flare rises and slowly falls a mile from us across the valley.\n\nTonight we’re sleeping in waterproof bivvys. I chose Lyttle with everyone.\n\nTomorrow we move: the Notice Board today carried an order by Gen. Birdwood: the gist of it was \"Lads, take the strain!\". What a splendid man he is: it is impossible not to involuntarily compare the Tommy stiff orders of this occasion. There’s no doubt with any of us but that we’re going to a big and a deciding stunt, before us stands a battling that will decide our conditions of living, or existence after. God that wounderful after! Oh, if only those who go home still realise their country and do not stand aside to the places made for themselves by the men who have shirked behind – who have deliberately and coldly shirked, and who have shirked under the cloaking of an old complaint, long forgotten till war came, but remembered after.\n\nWhat has my work of these two years amounted to! Not a role of fighting have I lived compleately in: while I was in the bearers justified my name as Australian, as a direct and active fighter I would have been useless, the field offers no other work I could justify myself in but dressing, and then I feel every agony and anger the man feels.\n\nSearchlights, shrapnel and sharp whipping noises, thank God for Rhum – tonight our first issue for months.\n\nApril 12\n\n47.\n\nMorning: a clear sky and a warm sun, after a night of rain and frost. A deal of raiding about, and bombs dropped. Early, a big column of smoke over Amiens sent the rumour of Amiens being afire.\n\nBivvy a great success: a whispered telling of several sleeping under wreath glass house of the cemetery.\n\nApril 12\n\n48.\n\nAt Amiens.\n\nDinner just outside Amiens by the south of the Cathedral, with mean little minds some have whispered of shells landing in the building, but I think it is still a lie: God knows how long though this will be – even while we were there a great shell burst between it and us, and for half an hour several guns were all the while trained on the City.\n\nOne Boche plane was brought down – from quite 8000 feet a long uninterrupted nose dive, our three planes spiralling above him.\n\nMarching through – only three dead horses by the boulevard, and a lovely white-faced girl sitting on a seat loaded with two sheeted bundles, all the sorrow of the city on her face.\n\nSince midday we’ve been by a narrow stream: a fair number were in swimming, but lovely as the day is and warm the sun, the dirty mud of the bank is horrible.\n\nThe 2nd Field have entrained and gone.\n\nLast night a big number of the 2nd Batt. knocked here, about 12 killed from bombs. Evening: In the train, trucks. The 2nd Batt. are an unlucky crowd. At B.B. Corner bombs lost them over 80: and last night bombs here in Amiens, and shells lost them 12 dead, and 40 wounded.\n\nIn Train just out saw Vim Colours: but he’d gone on by an earlier train with B. Coy. Must look him up.\n\nBasil B. brings cutting to truck of 2nd Lieut Alan Waugh being reported missing: he was engaged to a daughter of W.W. Jacobs.\n\nBack to Flanders!\n\nApril 13\n\n49.\n\nIn the train: past Hazebruck, all the little villages passed in daylight show shell and bomb wreaking: and looking down through long roads, thin lines and groups of refugees. Passing one little farmhouse by the line, through the open door and window an old woman and a girl were sorting and tying bundles: bomb holes were new in their fields.\n\nOnce we passed the wreakage of a truck of a Tommy troop train, two hundred yards further along, lying stripped to the waist, a splendidly built Tommy lay half over a stream washing.\n\n50.\n\nFor a long while last night. Boche planes dropping bombs – about 50 dropped – by the line and station held up our going. The Artillery were in the station: and just as we’d entrained saw amongst them young Street of the Grammar. I saw him last awaiting the tram in College St., two back his year – yesterday he had some little more.\n\n?\n\nBillets\n\nApril 13\n\n51.\n\nA detraining at midday and after Mess issue, C Section up to establish A.D.S., A and B back to reserve – for mobile Dressing Stations for Advance or Retreat.\n\nAll the afternoon 18 pounders have been firing by us, and the chorus behind has been of Machine Guns.\n\nAnd tonight the elatant rumour comes of the 3rd and 4th having driven the Boche back from Strazeele 1½ miles. Good old First.\n\nWere supported by the old 29th Division. This afternoon a drinking fraternising with Newfoundlanders in a small estaminet.\n\nA Billet above cows and fowls: deep straw’d and a deeply thatched roof.\n\nA Bearers turning in with warning of being earlily needed.\n\nWe’re newly equipped, last night midnight saw the brilliant retreat of the 1 A.C.C.S. At least we can answer well the \"what have you salved today\". Half of us have new tunics, new puttees, new underwear and luxuries we can never carry. A whole C.S.S. has been abandoned, full of hospital gear and R.C. Comforts, Towels, sox, new holdalls, lovely soft woollen jackets and books, even new Swiss Cottage Tents, bedding and lounge chairs – with three pianos, and a great library.\n\nFrom a library I salved \"The Sentimental Bloke\" – with an inscription from some Padre, Ruskin’s \"Modern Painters\", Wilde’s \"Charmides\" and \"Ballade of Reading Gaol\", \"Bindle\", \"Lost Tribes\" and Marian Crawford’s \"The Witch of Prague\".\n\nNeeve sent a guard down there when he’d heard of it – and incidentally salved some stuff: they acted to us as \"shopwalkers\" – so saving a \nmost\n deal of walking.\n\nThere’s not the slightest doubt there’s a most severe vertical breeze blowing hereabouts, two C.C.S. – splendidly equipped and compleat, have been abandoned almost entirely, to our benefit immediately, but with a scandalous callousness to the chaps in the line.\n\nA rumour comes from the Somme of the Boche having been forced back over 20 kilometres.\n\nSo to bed, trooper fashion, with boots & gas bag handy.\n\n52.\n\nEvening 10 p.m.\n\nApril 14\n\nA.D.S., Borre\n\nA moving up from by St. Silvestre at 3 this afternoon: the morning a sharp long route march with Capt. Blackall – severely criticised by Georgie Parker for galloping: but a good morning’s march. Through one of the villages a column of French passed: they splendid men, and full of smiles for us passing. There’s a great feeling between they and ourselves – for the first time of two years we’re recognising each other.\n\nBack to Billets orders to A. Sect. Tent for A.D.S.\n\nThe A.D.S. again in a Brewary. Brewaries are our strong point, we are night duty relieving C.\n\nOn our left is the 29th Division, on our right the 33rd, Tommies. In command of the three is our 1st Brigade Brig., General Leslie. There’s not the slightest doubt in our Infantrymen’s minds that our arriving here was only just in time. Seemingly the retreat by the Tommies has been another stampede: B.G. Leslie rounded up here over a Batt. of stragglers – Tommies, N.Z.’s, Americans and Australians, including about 39 Tommy officers who’d but the vaguest of notions of their Companies and Divisions whereabouts, and the net result is Australia’s in charge.\n\n53.\n\nBlue H. blew in an hour ago, full of a happy confidence and elation at a day of excitement: he’s attached to 1st Bgde. Sigs. The greatest telling of 7 waves of Boche, coming against the 3rd Batt., about 70 prisoners taken, and same Machine Guns. He tells a yarn of some Tommy Artillery: he with the Sigs. were attached to the first of reserves from the Somme. Here they found chaos. By Strazeele yesterday, he tells of an R.F.A. Capt. hailing him:-\n\n\"I say Australia, are the Boche where they were two days ago? I’d like to have a pot at them with my eighteen pounders!\"\n\n54.\n\nAfter tea walked over to the Church: an old stolid Flemish building of the 17th Cent.: inside a well arranged number of plaster coloured saints and pictures, just as after an early Mass the whole church stands, its vestry chests full of stiffly poor materialed capes of red and purple heavily embroidered, and censors and great candlesticks, one window of the High Altar apse smashed through.\n","15":"\n\n54.\n\nTonight our first casualties, M. Gleeson 17534, and F.H. Clausen 17709. Gleeson died an hour after arriving here: has wound in S.W. Left thigh: but there had been a severe hemorrhage. Clausen’s a S.W. R. arm. One shell, and their patient was rewounded with them.\n\nFrom the dead face of Gleeson I could not place him: but Les C. showing a photograph I recognised him at once. A splendid type and an Australian. Requiescat.\n\nApril 15\n\n55. a.m.\n\nJust through, one Green of the 4th half filled according to Bacchanalia’s custom of rum-rich mates, with deep dark rum, his wound a small shell splinter through the forehead by the eyebrow and in the eye-lid. Made him a stretcher-case, Maj. Stewart holding his good eye closed.\n\n\"Can you see me lad?\"\n\n\"I can see half a dozen of you!\"\n\n\"Joyful\" didn’t even flick an eyelash. This our night Serg. and he wanders around as a lost ghoul.\n\n56.\n\nTwo Boche through – prisoners to the third Batt., one a boy of twenty, tall and golden, M.B. bullet through both thighs. His legs well built and clearly drawn, but his body thin and his shoulders narrowly poor.\n\nApril 15\n\n57. 11.30 p.m.\n\nA long and deep sleeping from 10 a.m. till 7, our last case of the morning forgotten before sleeping by Moet & Chandon.\n\nAt 8 from the next village a car brought in an old woman and her man, his right foot blown away at the ankle, his poor right leg doubly fractured, and his arms riddled with small shell fragments. Even the terribly dead – writing ten yards away there’s the dead body of a 6th Batt. boy whose brains were filling his throat, even the terribly dead are soon forgotten by a memory that closes its eyes, but the primitive tragedy of an old Flemish woman and her dying man sent us silent to bed. Even if her love for him had shewn itself by the holding of their hands, or of a sweet caressing, the agony would have been human, but their agonies seemed their own – their accepting and monosyllabic speaking made the tragedy of terrible pathos. I had to go out of the Dressing Room: and on the road an old old peasant slowly passed, she bid me \"Bon jour, M’sieur!\" and I longed to hurry her away, but there’s nowhere for her to go, her home is in ruin.\n\nApril 15, 16\n\n58.\n\nwounded today: Capt. Symons detached from us temporarily to the 1st Batt.\n\nThe first mail in today for about a week, for self two T.L.S., but barren numbers. No announcement of Alec Waugh’s \"Resentment and O.P. \" yet nor of Masefield’s two books.\n\n59.\n\nWe have today taken on strength, two cows, two pigs, and a family of cats.\n\nFor tea tonight – tongues (from 1 C.C.S. abandoned) boiled chicken, leeks and milk and Café au lait, in stock, Muscat and Champagne.\n\nStill outward mail is closed.\n\nApril 16\n\n59. a.m.\n\nDarkes of the Transport blew in to Dressing Room about midnight – silk hated and arrayed from an evening in Strazeele. Full of Champagne, and Rabelaisian tellings of drinking and shells, eating and groutings.\n\n\"We had eleven fowls between eight of us, an’ we had to have the B. for tea too!\"\n\n\"A man ought to get up to strength in horses with these Tommies here – like rabbits aren’t they!\"\n\n\"An’ we were picked up as stragglers! A Tommy picquet bailed us up coming back – an’ we with a pig between us!\"\n\n\"Was he dead?\"\n\n\"Yes, we shot him – a howzer rifle we grouted, and cut his head off with a razor! But I was telling you, the picquet halted us –\n\n\"Alt! where are you men going to!\"\n\n\"Get ---!\"\n\n\"Come on! all stragglers are to report here!\"\n\n\"Go an’ get ---!\"\n\nSo tomorrow our bacon or ham will be home grown.\n\nThe night quiet: a black night of mist drizzle: every while the eighteen pounders by us open out. Hazebruck is being shelled by the Boche.\n\nReading \"Notre Dame\", but so far prefer \"Les Miserables\".\n\n60.\n\nTwo 2nd Batt. chaps through, and a yarning with them over Leon Chandon 1892. Their confidence in an early ending amazing almost, yet half our Inf. seem the same way. Am I a most perverted pessimist? An ending in three months! Yet if only the Tommies were well led! Or is this optimism a resurrecting of last years when we were closely following the Boche retreat to Cambrai!\n\nApril 16, 17\n\n61.\n\nOne of the \"skeleton Batt.\" in, - for a dose of \"something to stop this bloody --!\" We gave him a dose of oil, told him it’d cost him a bottle of cham.!\n\n\"Well, I wish I knew where it was old man\", he says, \"but its – scarce now, I haven’t seen a bottle for over a day!\"\n\nApril 17\n\n61. 2 a.m.\n\nTill an hour ago a long unbroken night of dressings, about 60 of our Division in, mostly 1st and 4th Battalions.\n\nLast night the night of a stunting, of Australians, Scotties, and the French. It has been a success. By the Infantry’s word the Artillery has been good, and all our objectives have been taken. But of the tellings of the 4th wounded there are contradictions: it is evident that at one point of their front the Artillery Barrage was thin, and their casualties heavy. By report the French hold all their objectives.\n\nEarly in the evening, the Col. was interrogating two 1st Batt., M. Cummins,\n\n\"And the French, did you see them?\"\n\n\"Oh the French are going for their lives!\"\n\n\"What?\", sudden surprise from the Col. and the answer, surprised at the question –\n\n\"Oh, the right way!\"\n\nApril 17\n\n63.\n\nMail yesterday: from the T.B.C. note and receipt for £2.0.0, and invoice for Frankeau’s \"Judgment of Valhalla\". Alec Waugh’s poems not yet out of press. Mail out open yesterday.\n\nB. Section Bearers up from Billets early last night – for emergency bearing: but so far there has been no need for them.\n\n64. 10.30 p.m.\n\nStill wounded of the 1st Batt. have been coming through: this morning the Boche counter-attacked, and came a G.\n\nBorre shelled! Another day of almost no sleep, and the promise of a busy night. Twice during the day for long while he dusted us with H.V. shells and shrapnell. Shrapnell he seems to favour more of late, black whip tail stuff of terrific explosion.\n\nYesterday evening I made a sketch note of the church of Borre with our lads’ graves below. Today the church struck. Tower being used as O.P.\n\n65.\n\nToday’s rumour. The last issue of John Bull, the cover notice reads,\n\n\"Will England support the Australians.\"\n\nMenu rather good,\n\nBreakfast, Cold Chicken & Pork\n\nTea, Salad, Champagne & Bread, Butter & honey & cream.\n","16":"\n\n66.\n\nIn the first hours of this morning, a 4th Batt. lad disembowelled, he died at 8, conscious till an half hour before, he told us he’d write to us from Blighty and if he got to Australia, he meant to stay there. Alongside him we dressed another man whose arm was shot away: who having his arteries tied, let a hard gasp escape him. With pain on his own face, the","17":" lad stiffly turned his head, \"You’ve got all my sympathy Dig!\" and he closed his eyes and his mind wandered again on getting home. Slowly he died, occasionally he’d ask again for another sip of Coffee, then a rambled sentence, then \"Gee, am going dopey, that stuff, is it?\" Then, \"This ammunition getting heavy, Jack\" and oblivion. \n\n \"Requiescat in Pace\".\n","18":"\n\n67. a.m.\n\nA Padre in brings the rumour of France decorating the","19":" Division with the Legion of Honour. What a bonser distinction, and a well earned one.\n\n68. p.m.\n\nA mail up today: from the T.B.C. Frankeau’s \"Judgment of Valhalla\". From home, a long letter of Mother’s from Narrabeen of","20":" and of Betty’s from Woollahra of Jan. 31.\n","21":"\n\nMother writes again after a long silence of Geoff’s enlisting ..\n\n\"I have given Geoff my consent to join the Flying Corps: so I expect him any day to let me know if he intends going: I thought and thought about it, and felt I was not fair to him, as I have an idea how others think of it, and I have heard people talk about boys who have gone – only sons of widows, and then there’s always the feeling of shirking: so I settled it in my mind, and if he really must go he may feel free\".\n\nSo he’ll have his desire at last: and he’ll know what a bonser race he belongs to.\n\n\"Betty\", Mother goes on, \"has her first sweetheart: last week she had Aileen Foley to stay, and this boy came out on Sunday for tea – the reason to take Aileen home, but there were great preparations to meet him, and when he arrived I saw where the attraction lay. Bett is very funny and last Wednesday, last Wednesday he called to take Betty home for tea. She has gone to Burwood this week and he lives at Strathfield. He is a nice looking lad, goes to Newinton ,\n\nApril 18\n\nabout 17 and I believe clever. Anyway he plays well. Its Bettys first, and if she is anything like I was, he wont be the last, the coincidence is he is a chemist’s son, and myne was ditto: now \nmyne\n holds a big position here – one of the leading solicitors.\n\nDarling I hear of him for the first time. I’d like to hear of one or two others. Broderick I know, and meeting him he smiled when he mentioned he’d known you well, and he’s now the City’s Architect, that’s a coincidence too.\n\nBetty’s telling is funny, hardly camouflaged – in fact almost brutally frank.\n\n\"A little while ago Phyllis had an evening, and it went off jolly nicely too: I met such a nice boy there, called Norman Orr. He has a brother over there where you are, he is now doctor for the 27 Batt, I think – have you heard of him?\n\nYes, I have taken quite a fancy to Norman. He goes to Newington, and plays the piano rippingly. Up at Aileen’s I saw him again and he came up every day. As I said before I went up to Aileen’s for a weekend, and stayed till yesterday (Wednesday) and Norman saw me home.\"\n\nApril 18, 19\n\nI read both extracts in the D.R., to a general laughing and a following extract reading all round. Mother would enjoy Betty’s, but if Bett ever heard she’d never let her notes go so fully. No, I’ll leave the telling till \"après\".\n\n69.\n\nTonight quiet, but for a five minutes shelling with crunchers hereabouts, the station empty of cases and a general air of waiting. A big counter attack of the Boche is possible: after supports our chaps man a reserve lines and behind us here the salvaged Tommies – \"Lester’s Own\" man a fourth trench reserve. The deep cellar across the yard cleaned out today, a case of such another barrage over the village as yesterday – which lasted for 4½ hours.\n\nA parcel from home, sox and a cake.\n\nApril 19, 2 a.m.\n\n70.\n\nAt midnight such a short blizzard of snow and rain as the 2nd Batt. charged over with the 3rd at Hermies last April, now the sky is clear again and starr’d and vividly deep in a rich black-blue.\n\nQuiet, with occasional ‘crunchers’.\n\nApril 19\n\n71.\n\n\"The Judgment of Valhalla\" read. A book to shelve with these, a representative collection of the writings of men who will pass… through the seven circles of flame … to the little gate of Valhalla.\n\nThe City of Fear, Frankeau\n\nPoems, Alan Seeger\n\nLetters and Diary of Alan Seeger\n\nPoems, 1914 and others, Brooke\n\n\"Letters of a Soldier\", Anonymous\n\nFairies & Fusiliers, Graves\n\nWar Poems, Vernide\n\nWith Masefield’s \"Gallipoli\" and \"The Old Front Line\" – though he’s not of, \"The men who drive, to blade-ring home, behind the marching shell.\"\n\nThree other books would be – judging from scraps read in magazines,\n\n\"Ardours & Endurances\", Nichols\n\n\"The Old Huntsman\", Sasoon \n\n(and yet to be published – \"Counter Attack\")\n\nPoems, Leon Ghellert , 3rd Bgde.\n\nand Alec Waugh’s \"Resentment\",\n\nLater … and Verhauren’s \"Belgium’s Agony\".\n\n72. 10 p.m.\n\nA Tragedy, a losing of Fountain Pen in Chateau at Pradelles. There after 10 this morning with Buck and Les, after a secret cellar of Champagne and Liquers. The result, a splendid discovering of Moet & Chandon and fine white wines.\n\nThe chateau abandoned as when lived in, well furnished and equipped, but full of the showings of a poor and flash taste. Some rich linen and embroideries and some remnants of handmade lace. Wreckage all about and over the Chateau and its village. Some terrible barrages have fallen over it – of the whole village, not a farmhouse nor building but hasn’t been partially wrecked. Brought away two fine old 17 Cent. engravings of ordnance maps of Louis – of his soldiers about Armentiers .\n\nMail – after three months waiting, from Hendersons the Jan. 16 parcel of books.\n\n73.\n\nTonight clear and a star-brilliant \nnight\n sky, for the last few minutes the guns about the hedges have been furiously firing. Last night a big counter-attack was expected of the Boche, but so far the front has been comparatively quiet.\n\nAll the while, and I worrying, my pen was in the bottom of my writing paper box – the white and green paper of Paris. But I only last remembered holding it, in the Kitchen of the Chateau, when I casually wrote in an old book, to camouflage from Mac, our being interrupted. Turning in I only recollected putting aside a few pencils from my pocket, making a pillow of my tunic. ‘Laus Deo!’\n","22":"\n\n74. 1 a.m.\n\nQuiet, but for planes over, all supper sudden pause for close listening, then more Moet.\n\nTo rejoin our section this morning: whether this means going back to reserve, or to the new A.D.S., no-one knows.\n\nCaestre, New A.D.S.\n\n75.\n\nArrived here about 2 p.m., in time for an hour’s shelling, the same sensitive shells of Borre – of terrific explosion, and velocity. Les, Buck and self to the joint cellar, before leaving, and a bringing back of about 24 bottles of Moet and Leon Chandon, and after tea here, I to the Church in the village, there in the Cure’s garden a grouting of a great bundle of spring onions. Out again, a finding of a great champagne dump – of Carte d’Or and a dozen other brands, and Prunellas and Liquers. So an orgie of a minor character.\n\nA. on Night Duty, self with Dresser of Walking Wounded. Narnsby and self just back from the village proper, after a grouting of three chickens from a ruined wrecked farmhouse, for breakfast tomorrow morning. While in the hen-house the second barrage of the evening over. Champagne, Carte D’Or and Prunella a most delightful cocktail.\n\nMail today, a parcel from Mother – sox & shaving soap and ordinary, and a note,\n\n\"Did I ever tell you Angus and Robertson’s rang up and asked your address, as you had ordered some books: well I told them not to send them, as you had applied to come home, but now I’ll go in and tell them to send them on.\"\n\nSo there’s the possibility of an early receiving of Adams’ Plays and some other decent Australian stuff. And from the Commonwealth Bank a notification of money being received.\n\nPosted to Beaumonts order of","23":" for \"Oracle of Colour\" and J. Freeman’s new Morland Press book. Also a letter written to Commonwealth Bank.\n\nApril 21\n\n76. 10.20 p.m.\n\nLast night by the line of the Gods moderately quiet, early a terrible opening up of our guns. We have heard nothing of its meaning.\n","24":"\n\nOut after breakfast, with Bill F. grouting, a good bag of coffee, sugar – sweet lump stuff, and macaroni. Supper – and candles brass sconced to heighten the illusion, cold chicken, champagne cocktails and liquers and – so to bed.\n\nTonight a most delicious soup – from the boiled chicken – with macaroni.\n\nMail, a letter from Elsie B.\n\nApril 22\n\n77. a.m.\n\nTalking of home mails, Eric G. brought out a newly arrived snapshot of three bonser girls. Narne is inspired..\n\n\"I’ll show you some I just received\", and a batch of half a dozen are intimately produced. Groups of old fashioned, fashionably dressed queer people and places, most difficult to enthuse over – especially when they’re produced with such outline sketches. We all bit: they were remnants of an old photo album from the Caestre Chateau!\n\n78. 2 a.m.\n\nA great glow of fire behind Caestre, far back over us Boche shells, and a barrage that has passed us twice, travelling from the line noises of machine guns and about us our guns alive. There’s an expectation of a Boche attack within the next twelve hours.\n\n79. Evening\n\nSettling down to evening’s passing, after composing a dish of macaroni cheese. Today some good groutings – the lower part of the village afire, no fire engines to interrupt, so a splendid seeing. Loot, a phonograph and a great collection of Masters Voice records: about six doz. yellow apples, and macaroni and a big sandbag of young cauliflowers. Our room is overloaded with unexpected comforts.\n\nThe A.D.S. is a rather pretentious three-storied box-house, shallow cellared, and practically intact – though standing alongside the rail, & surrounded not remotely by guns. Regularly we are shelled, now a commencing has opened. Two cellars are our Dressing Stations, a third our cookhouse, and close alongside it a narrow space, our day sleeping quarters.\n\nOn the first floor, a room of dull green – a rich and good colour – and white, once it was a Mess, so the green curtains still are there.\n\nWe have furnished it and hung it with pictures – which include three Medici prints, and \n","25":"\n\nsupplements from Pears, an open grate, and a mantel, silver candlestick flanked, and loaded, with incense and two friendly ticking clocks. \"A room – more like a whore’s than a man’s\". All have our own individual easy chairs, our places at table, our own champagne and liquer glasses. The room will be spotlessly clean and the talk free of all – for five minutes: then glasses innumerable, champagne & sinister liquer glut in the soft lighting of candles. And there’s a war on! and he’s shelling us!\n\nMail: from T.B.C., James Stephens \"The Crock of Gold\".\n","26":"\n\n80.\n\nMore shelling has added to the ruin of Caestre: from there this morning a set of Liquer glasses, and two bottles.\n\nTonight there’s expectation of a rush: today has been busy, and the stunt is for Meteren.\n\nAn entry omitted. The day we arrived here, Greenwood of Transport wounded, and this morning Bert Canty.\n\nApril 24, 25\n\n81. a.m.\n\nTo midnight fourty through: now a slackening at 4 a.m. A cold clear night, of loud warring: for a while at midnight we received our shell ration. Wounded 90% Machine guns.\n\nThis evening a sky of rare loveliness: as though all the rich wonders of the skies had been massed to forget and hide the world’s war, and a terrific orchestred gunfire of all our guns trained on Meteren.\n\nApril 25\n\n82. 1 a.m.\n\nA salute to the Landings anniversary of five salvos for the Boche: about the A.D.S., no casualties.\n\nFrom 4 yesterday morning one long unending line of wounded to the A.D.S. and some terrible wounds: the attack on Meteren a failure: and by the Infantries telling, a failure of the staffs. Last night’s long roar & bombardment by rumour to level Meteren, in any case it was a firing that will live in the Boche’s memory.\n\nMail yesterday: from T.B.C. note of \"The Crock of Gold\" and of Moore’s \"A Story-Teller’s Holiday\" still printing.\n\n83. 10 a.m.\n\nWriting, for the first time in our \"Living Room\". The remote and serene beauty of the Medici Print of Perugino’s The Crucifixion,\n\nApril 25\n\npinned high above a tawdry mirror and alongside poor photogravure of the Philistine, and contrasting so well with the good green of the walls, the phonograph circling out 90% pure noise, and visions of a room of self-expression pass by the mind. Books of course will be the keynote and the colour riot: Black walls, gold ceiling, brown floor and green book shelving, but the black and gold is old, and its original beauty has been tawdried by brothel use, then the green shelvings would add the richer riot, and green hangings and rugs. Two pictures – in gold framings – the two grouted engravings from Pradelles.\n\nGreen walls and faint yellowed, ivory dull shelvings and room fittings. Curtains of dyed Chinese blue and a Persian rug of multi-colourings.\n\nBrown-gold-fawn walls – from Winsor & Newton’s wash colours, and deep Court blues and Chinese blues. Walls of paper and an eye-chosen colour. And only beautiful books and favourite books visible – all others in cupboards of fine panelling. Candles, brass or silver serviced, and deep friendly chairs, and an Irish Terrier, and a grey cat or a black one, and quiet.\n\nA room of no violent originality or futurism: but a room of beauty and quiet and comeliness. Now I only owe allegiance to beauty, to Pan of the lovely brown boy-body and the shaggy goat legs: to the beauty my senses dictate: full nakedness, form and colour. This morning only, I realised fully for the first time, the beauty of the simplicity of the steel helmet – one of the 21st M.G. boys wounded this morning: and his helmet, and black mat-hair across his forehead and his brown-gold face, made him more beautiful than a Greek bronze.\n\nFrom now I take as my hero, Savage whom I never knew well enough, who I worshipped from my first seeing him at the University Junior of 1910: I only persuaded Father to send me to the Grammar so that I could meet him: and he left as I joined, and I met him in Liverpool in the Y.M. Tent in 1915, he in the Infantry and I in the Army Med. He died of wounds in 1916.\n","27":"\n\n84. p.m.\n\nAustralians against Four Times their Numbers.\n\nThe Australians who were still holding the hills fought certainly at least four or five times their own numbers. In yesterday’s fight Australians killed or wounded about four thousand Germans; in to-day’s they must have accounted for far more.\n\nWhen a full history comes to be written the Australian Empire will realise what a magnificent buttress the Australian Imperial Force has been to the cause of our race and to humanity and civilisation in this, its darkest hour. This week’s work, if nothing else, will give our children the right to glory in calling themselves Australians. There was never a finer fight in the history of our army than that fought by Australians to-day. (Cutlark)\n\nFrom Anzac Bulletin of April 12, of April 5th and 6th, the Battling of Villers- Brettoneux on the Somme.\n\nAgain \"The Australian Empire!\", and if those who come after are true to the men who are dead and are fighting, the youth of our Empire of the Pacific will be more splendid & fruitful than the age of England’s youth, the age of the Elizabethean. \"The Australian Empire of the Pacific\", the words sing in the heart.\n\nApril 26\n\n85. a.m.\n\nEarly in the evening of 24th the French by us sent over gas, and gas came back to us all that night and yesterday morning. So last night Bucholtz and self on Gas Treatment, and all the night only 7 in gassed – all slightly.\n\nA quiet night: two straffes – the last at 5 about the A.D.S. and one shell on our ration limber, standing between a line of Ambulances.\n\nApril 26\n\nLast night a Celebration Dinner – the eight of us – and Champagne Toasts to the Dead. B. Section’s Toasting lasted well to midnight when the old,\n\nGood-bye Cairo! Cairo!\n\nGood bye Cairo! Cairo!\n\nGood bye Cairo, good-Bye!\n\nwas resurrected and finally damned.\n\n86. 1 p.m.\n\nAnzac Bulletin, April 1918\n\n\"A Change from Bully Beef\".\n\nApril 26, 27\n\nToday back to unit, Billy Kid, Bert Reynolds, Owen Burston, Finnes, and four others: so another celebration, & in Carte D’Or and Cassis Liquer.\n\nMail today brought Anzac B., April 19, and the cover photograph pasted on last page. A most intimate A.I.F. snap: all needed to compleat the recording of the present would be a Dressing Station, and women’s underwear being cut from hairy brown thighs. Saville has a drawing in the issue –\n\nW.A.A.C.: \"Did the wound in your foot hurt very much?\"\n\nAussie: \"Oh, no! – but I’d rather a whack on my arm!\"\n\nA brilliant camouflaging!\n\nApril 17\n\n87.\n\nMidday: Today changing from night to day duty, so in till 3 this afternoon.\n\nEarly this morning, three gassed 5th Batt. men in: a premature burst of one of our own gas shells directly above them. Two died after an hour’s oxygen, bleeding and one artificial respiration, the third was sent in to C.C.S., our oxygen cylinders ran out. The sequel was the morning after breakfast, another 5th Batt., a young boy. He was a stretcher case, but protested his fitness, he was one with the party over where the shell burst: one died almost immediately he told us: \"I ran down to the Bearers, and had to go down again: but stayed on outpost duty, an’ I must have gone out a while because I woke up at the R.A.P.\" The name was Rance of A. Coy. and the memory comes of Frankeau’s \"Then Rifleman Brown came to Valhalla\".\n\n88.\n\nA reading finished today of James Stephens \"Crock of Gold\", an exquisite and charming essay in fine writing.\n\nApril 28\n\n89.\n\nEarly yesterday morning, up to the village: and found in an old milliner’s shop the floor strewn with gold and scarlet and purple and gold brocade robes of the Catholic Church: great\n\nApril 28\n\nstiff elaborate hanging cloaks clasping with jewells across the breast.\n\nUpstairs is a gem a caret: an ivory Christ exquisitively carved and clear. It is only five inches high, mounted on a tall \nbrass\n black wood cross heavily pedestelled.\n\nToday – it seems beastly: but if its left it will only be powdered or burnt: all yesterday the regular shells fell in Caestre, and from the very assoccian of it only does this hesitation come. On the High Altar of the Church is a small thin silver cup, daintily embroidered all about with a tiny intricate dotting, and a tiny shield, \"M45\".\n\nBut the Ivory Christ: it would fit so beautifully to a carved bas-relief design of the Crucifiction – a cross with flanking of the two side pieces of the Crucifile of Perugino.\n\nAnd an hour after this entry, when I went up to the terrace, the pedestal was on the floor, and in the next room the empty cross.\n","28":"\n\n90.\n\nErnie Succo through early this afternoon – his left arm blown away at the elbow: amputated here. The \"Laughing Squad\" is broken.\n\nThe rumour that the Boche have won Kemmel Hill and Dranoutre seems confirmed today. It seems from this the whole of the salient will have to be evacuated, it will be \"a stragetic victory\" for the Tommy Press. Rumours too of another big attack bracing.\n\nThe day dull, and a faint mist low in the sky: quiet till now – 3 p.m., a big long bombarding has just broken out.\n\n91.\n\nAbout five days ago Major Stewart was detached from the Ambulance for duty with the Artillery, 1st Bgde. He was killed today. Requiescat In Pace. He was only lately from the Base, a Victorian, and a good man in the Dressing Room.\n\nApril 29\n\n92.\n\nFrom 3 a.m. till 10, almost uninterrupted shelling about the A.D.S., the rail and the old empty encampments: and behind the sudden burstings\n\nApril 29\n\nfrom the line one long roll of terrific concentrated fire has come down: from the noise of it, it is the Boche’s barrage. Now, still without interruption the guns are firing and recoiling and to the dull distant roll, our guns have added their fury, no cases have come down from the line: at 6 a.m. a big batch of locals in and some terrible wounds and six deaths.\n\nComme-ca has been killed: Cliff of the bonser manner and urbane smile: Cliff, Cliff the thinking of you brought you clearly to the mind, and your smile and voice takes the harshness of death from the reverie.\n\n\"Proud then, clear eyed and laughing, you have met death as a friend.\" Requiescat.\n\n93.\n\nIn the Dressing Room, met this morning Frank Middleton. I recognised him at once, though I’d only known his face and \nsincerity\n manners at Woollahra. In the 4th Batt., today’s his first wound for 2½ years.\n\nApril 30\n\n94.\n\nMorning.\n\nKemmel Hill rumours: The much abused Tommies stampeded, the Boche swung around behind the French, and took 6000 prisoners. Later – the French greatly counter-attacked, won back the hill, and took 3000 Boche.\n\nDull again: a few of the heavies going, and the Sanitary Party using 5.9 shell holes for refuse. Now a rumour or a whispering of all yesterday’s gunfire.\n\nLast night yarning awhile to Rowe – back from evacuation of last Oct. He is a second Frank Hungerford – a slow \npermanent\n smile easy charm, and a beautiful body. He is a trifle heavier than Frank, more beautiful in movement than in easy repose.\n\n95.\n\nA mail in yesterday – T.L.S., Ap. 18. Two from Mother, Feb. 25 and March 10, and one from Mat, Feb. 24. Mother on \"Twinkletoes\". \"I read Twinkletoes and I really can’t say I enjoy reading of low life and bad English. But it takes a lot of different people to make a world. I liked her, but didn’t find any pleasure reading the book.\"\n\nMother myne! Bad English!! and those wounderful pictures of night about Limehouse – of the terrible types made beautiful, and of the great passions.\n\n96.\n\nApril 30\n\n118\/551\n\nHeadquarters\n","29":"\n\n1st Aust. Division\n\nI desire to express my deep appreciation of the work of the Division since it came into its present sector. The zeal and energy shewn by all ranks is beyond all praise. We took over a sector scarcely touched as regards defensive preparations. Tho’ much remains to be done, we have now a position on which we can confidently engage and defeat the enemy should he be rash enough to attack us, and every day’s work will add to our security. I thank all staff, Commanders, and the members of every unit for so ably maintaining and adding to the reputation of the 1st A. Division. Yesterday the Field Marshall Commander-in-Chief paid a visit to Divisional Headquarters and expressly desired me to convey his personal thanks to the Division for all they have done, and his confidence of their being able to hold their line against any attack.\n\nI have the greatest pleasure in now conveying his message to all ranks of the division.\n\n(Sgd.) H.B. Walker\n\nMajor General\n\nCommanding","30":" Aust. Division\n\nOn the notice board this morning.\n","31":"\n\n97.\n\nIt now appears that the great bombarding of yesterday was about Zonnebeck and that the French have retaken Kemmel Hill with some prisoners, and have broken a big number of Boche counter-attacks.\n\nThe Generals of France – colour plates from \"L’Illustration\" – now decorate the walls of our Gas Treatment Dressing Room.\n\n98.\n\nT.L.S.,","32":" reviews Leon Gellert’s \"Songs of a Campaign\" and claim him,\n\n\"As a poet, in spite of many derived excellences of craftsmanship, he is nearer akin to the American Alan Seeger than to the more fastidious singers of the great war, whose eyes are so often reverted from the monstrous terrors of the half-mechanical struggle to the quiet and gracious loveliness of the great English countryside.\"\n\nObviously the critic has in his mind Rupert Brooke as representing the \"singers of the great war\" – but Rupert Brooke only wrote five sonnets of war, and who are the fastidious singers – ‘of the great warr’. Frankeau is a singer – hardly fastidious. Sassoon is another, and Nichols, Graves. Only Leslie Coulson carries the reviewer’s point, and why the American Alan Seeger. Alan Seeger would be quite sufficient – though possibly the paragraph\n","33":"\n\nof local influences justified to an extent American: Mexican would have been more correct.\n\nFollows the smirking lying Englanders self appreciation above all other peoples of the earth.\n\nThe sentimentality is gone, it may be, but some of the racial sentiments still flourish, though transplanted afar. For example, the English joy in comradeship which has been the strongest influence of all in gathering our powers together from all parts of the globe and preserving the serried patience that cannot even dream of defeat. It was this that won us all our wars in the end – the English sentiment that all Englishmen, earl or churl, are wrought of the self same clay and must be all Englishmen together in times of danger.\n\nI read this aloud to a couple of Inf. lads and the A. dressers last night.\n\nObviously Leon Gellert’s \"Songs of a Campaign\" contain more of the \"Oh England – Alma Mater\". Patriotic slush. Almost the impertinent reviewer has lusciously exclaimed, \"Oh how quite Colonial!\"\n","34":"\n\n99.\n\nPhilip Gibbs’ new book, announced by Heinemans, \"From Bapaume to Passchendaele\". Its sub-title will add, \"and back again with the English\".\n\nAlan Seeger’s Poem has gone into a second impression. \"The Vengeance of Fionn\" is in a second edition: Frankeau’s \"City of Fear\" in a","35":" impression. Masefield’s \"Old Front Line\" in its 20th Thousand. Drinkwater’s \"Prose Papers\" 2nd Imp., Brooke’s \"Selected Poems\" in its 2nd, \"Stray Birds\" 2nd, \"Wild Swans of Coola\" out of print and by Baker’s last catalogued 25\/-.\n\n100.\n\nEvening: The A.D.S. is built within a great ring of old trees new with green, and by an old wood grown orchard, by the orchard hedge there’s a battery of 4.5 guns, now regularly beating their shells out: a hundred birds are in the trees and they’re whistling as in the early morning, by one of the orchard trees, I lay awhile listening to a blackbird’s bonser singing – I think it was a blackbird, though it may only have been a black bird. The guns beating and the singing – \n\n\"You say a thousand things persuasively\n\nAnd with strange passion hotly I agree,\n\nAnd then a blackbird sings\n\nBy April lilac …\n\nAnd what is all your argument to me!\" \n","36":"\n\n101.\n\nTwo years ago May was the month of days of gold and blue by the hills of Mousset by the Mediterranean, days when I first knew the Pagan Jake and went swimming with him from the breakwater by the Cornish Coast. They were days of ballad colour, and only Jake could have painted our nakedness in the hot sun.\n\nJake, standing to his knees deep in the water, leaning his hands on a ledge of rock, looking up with the sun full in his eyes, at two sturdy Provencal girls, looking down at him laughing, and his laugh as he hopped up and turned.\n\n\"Jove some people haven’t much modesty Frank1\"\n\nRussel Hunt could manage the first part. It was an episode from the golden Age.\n\nMay was splendid with colour and action at Mousset.\n\nMay 1\n\n102.\n\nA four page letter written to Mother.\n\nThere’s a rumour going the rounds of Blighty leave opening this week, if its true I’ll be early on the list.\n\nEvening: Another dull grey day: the usual shelling – searching for the hedge guns.\n\nRead walking by the orchard wall along the poplar walk Keats’ \"Ode to a Grecian Urn\". Last night’s shelling snapt in half one of the even trees: now their lovely even perfection is broken, and a stump spoils their perspective.\n\nToday read first three chapters of Lethaby’s \"Architecture\". He quotes Prof. Reisner’s theory of the Sphinx and Cephron being contemporary. Prof. Petrie’s name only is quoted, but the discovery I think was Prof. Reisner’s.\n\nB. Bearers came down late last night, relieved by the 2nd, they have gone down to H.Qtrs. and Cliff was to be buried there today.\n\n103.\n\nMail, T.L.S., April 25. Uninteresting reviews: Alec Waugh reported prisoner of war and well. Grant Richards publishing Artzybashef’s \"War\".\n\nAlgernon Blackwood is collaborating with Violet Pearn in ‘Karma\" a re-incarnation play, Macmillan publishing.\n\nMay 2, 3\n\n104.\n\nThis morning late, to Caestre villiage with Nanc: from our gates to the church the road is straight and tree flanked: at the centre of the villiage it breaks to the right, and throws the church tower to occupy the centre place between the end of the trees. Today the sun in a grey blue sky made a shadow under the trees and a warmth in the air.\n\nEvening – and another day of no gassed through: but for occasional salvoes from the hedge guns, and one sudden salvo from the Boche, the day has been quiet.\n\nTonight at 9 there’s a late supper – and a great white and blue primitively decorated vase in the centre of the table carries a small garden’s yield of white and red double tulips.\n\nPerugino’s \"Crucifiction\" – a media print, a bottle of Crème de Prunelle, and a bowl of tulips: there are not many rooms here that could offer better.\n","37":"\n\n105.\n\nMorning: There’s a bright sun today, and a clearer blue sky.\n\nLate last night our first gas patient through: one of the R.F.A. lads from one of the nearby Batteries. He was rather a beautiful animal, and his laugh and grace made him pleasant company.\n\nThree 5th Batt. in early this morning before 9.\n\n106. \n\nEvening.\n\nAll day long a memory that has become an obsession, nothing to relieve the monotony, nothing to clear for any while the mind.\n\nA mail of two home letters, from Mother, Feb. 29 and Betty March 4: Betty’s a dull disappointment, on horrible exercise paper, and uglyer written, and the letter itself as dull and poor as an illiterate: I’ll send her some decent paper from Blighty.\n\nA day of patch-reading: a few pages of Lethaby’s \"Architecture\", of \"Thais\" and Keats two odes and the Sphere of April 20. I’d like to read tonight one of Aristophanes’ comedies, or Suetonius. I’d give a guinea to hear that R.F.A. had of last night, read \"The Golden Ass\" – to watch him read any of the sun burned Pagan tales. Instead I’ve to watch Buck and wait for gas patients. I’ll to Thomas a’Kempis turning in tonight.\n\nLater: in bed.\n\n\"He who only declineth them outwardly and doth not pluck out the root will profit little: nay, temptation will sooner return to himself in a worse condition.\"\n\nThomas a’Kempis, Book 1, Chap. 13.\n","38":"\n\n107.\n\nMidday: since early in the morning the sun behind clouds thin over the sky.\n\nA year ago we spent today on a hill by Veaux, all day till evening hearing of big casualties amongst the bearers in and waiting for our need, and at dusk we moved off towards the line, to arrive at the embankment point by Bullecourt when all the world seemed in a haze of brown, yellow and green, all the skies full of callous rising and falling flares, and the air filled with circling shrieks, and whirls, and then close following sighs and hisses. It was a lucky stunt for the 1st Field, but we payed in the Ypres salient later.\n\nToday it would be good to receive James Stephens new book of poems, \"Reincarnations\" by the afternoon mail, from Beaumonts shortly \"The Oracle of Colour\" and \"Memories of Childhood\".\n\nA three page letter of utter rot to Betty: but from her letters of late, it seems writing to a stranger: once her letters were of pure delight – like her two snapshots I carry in my wallet.\n\nWould like to see this much written Norman – would like to see him as slim, dark, with sudden laughter in his eyes – a youthful Jake.\n\n108.\n\nFrom \"Thais\",\n\n\"God is unity, for he is the truth, which is one. The world is diverse, because it is error. A person must turn away from all the spectacle of nature, even those most innocent in appearance. Their diversity, which renders them agreeable, is the sign that they are bad. For that reason I cannot see a bunch of papyrus under the sleeping waters, without my soul being veiled in melancholy. Everything which the senses perceive is detestable. The least grain of sand brings a danger. Each thing tempts us. Woman is simply composed of all the temptations floating in the air, upon the flowering earth, and in the clear waters. Happy is he whose soul is a vast seal! Happy he who knows how to become mute, blind, and deaf, and who understands nothing of the world, as to understand God.\"\n\nAll the passion of the temptations of the Column and the Mastaba, and the terrible realising of an insurmountable obsession is in Paphnutius’ confession to the abbot Zozimos.\n\nMay 4, 5\n\n‘Hermodorus’\n\n\"… For man, who sees only a part of everything, evil is a blessing. Without doubt, ugliness is ugly and not beautiful: but if everything was beautiful, everything would not be beautiful.\"\n\n109.\n\nWith horrible regularity, all day long the hedge guns have been smashing like sudden hell claps.\n\n110.\n\nI saw Father O’Brien again tonight – the first time since our M.D.S. at La Clytte; last night and the night before in the mood almost deliberately brought on, I’d half started a long letter to him. I had the thought to write of it all, a compleat confession.\n\nTonight I talked with him in the hall, and asked him of some book of the essential of the Catholick faith, he gave me \"The Faith of The Fathers\" by Cardinal Gibbons, and one of M. H. Benson – \"The Religion of the Plain Man\".\n","39":"\n\n111.\n\nLate in the evening in the Hall a yarning with the C. of E. Padre – Maj. … a casual talking of all things, of Kitchener he told of his diverting reinforcement troops from the Pinnacle when Gen. Hamilton had urgently called for them.\n\nAbruptly he broke casual talking, and announced his intention of holding early this morning a service: It was my opportunity, but I did not take it: he is genuine, and would be good to talk to – but his long and close association with the Military outwardly seems to have imbued him with some of its detestable \ncustoms\n spirit. For a long while after, I thought the matter out, and meeting him again, almost spoke to him.\n\nThis morning I met him after his service: I should like to have spoken to him, but even if I had last night, still I could not have taken the sacrament.\n\nPerhaps some while in the future I may yarn to Father O’Brien: I think he would see my position better than any other Padre I’ve met.\n\n112.\n\nPart of Caestre afire from shells at the beginning of last night: a shell somewhere amongst the buildings opposite the church.\n\nA day’s Egyptian blue sky – the shell packed tower taking all the colour of the fire, and seen from our gates at the end of the long perspective of black-green trees, a great monolith of rose colour, with wreathings of white-blue mist above it.\n\nA fantasy by Charles Guerin.\n\nMay 5\n\n113.\n\nToday reading Hugo’s chapters of Waterloo in Les Miserables. ‘Hugomont’ ,\n\nThe sunshine was enchanting: the branches of the trees had that gentle tremulousness of the month of May which seems to come from the birds’ nests rather than the wind. A spruce little bird, probably in love, was singing desperately in a tall tree.\n\nThe storm of the battle is still in this court: the horror is visible there: the overturn of the conflict is there petrified: it lives, it dies: it was but yesterday. The walls are still in death agonies: the stones fall, the breaches cry out: the holes are wounds; the trees bend and shudder, as if making an effort to escape.\n\nSo the gloom of its agony over Bapaume when we entered it, and passed quickly through it.\n\nThere was a massacre in the Chapel. The interior, again restored to quiet, is strange. No mass has been said there since the carnage. The altar remains however – a clumsy wooden altar, backed by a wall of rough stone. Four whitewashed walls, a door opposite the altar, two little arched windows, over the door a large wooden crucifix, above the crucifix a square opening in which is stuffed a bundle of straw, and a little church of Baulencourt , where Toby and I walked awhile the day we joined up the 2nd coming out from Bullecourt. In that quiet little village, its only life lovely newly green trees, all the sadness and quiet of the world seemed held.\n\nThe flames filled this ruin: it was a furnace: the door was burned, the floor was burned, but the wooden Christ was not burned. The fire ate its way to his feet, the blackened stumps of which only are visible: then it stopped.\n\nSchopenhauer in his essay on the makings of a classic, says that to become a classic, a book must hold qualities to appeal to all ages, \nand\n to remain of consequence to changing manners, a hundred little wayside chapels, and wayside calvaries and church ruins follow the way of the Chapel of Hugomont.\n\nSkeletons of dead trees abound in this orchard. Crows fly in the branches: beyond it is a wood full of violets, a brook made of English blood, of German blood, and of French blood, mangled in fury: a well filled with corpses, and all this in order that today a peasant may say to a traveller: \"Monsieur, give me three francs; if you like, I will explain to you the affair of Waterloo\". \n\nOf the Somme Battles, already the first guide book is out!\n\nMay 5\n\nIII\n\n\"The 18th of June 1815\"\n\n\"Had it not rained in the night of the 17th of June 1815, the future of Europe would have been changed.\n\n… the ground was soft. It was necessary to wait for it to acquire some little firmness so that the artillery could manoeuvre.\n\nV\n\n\"Note a circumstance: There were in the English Infantry, particularly in Kempt’s brigade many raw recruits. These young soldiers, before our formidable infantry, were heroic; their inexperience bore itself boldly in the affair: they did especially good work as skirmishes: the soldier as a skirmisher, to some extent left to himself, becomes, so as to speak, his own general: these recruits exhibited something of French invention and French fury. This raw infantry shewed enthusiasm. That displeased Wellington… Its been noted several times: but the Englander, labouring under the delusion that his character and way of life are only admired and not understood by the Continental refuses the recognition.\n\nVI\n\n\"All about the plateau, the English had cut away the hedge here and there, made embrasures in the hawthorns, thrust the mouth of a cannon between two branches, made loopholes in the thicket. The hedge gun batteries by us.\"\n\nChapters IX and X – quite inseparable, and a disruption full of splendid phrases, as splendid as a great Greek ruin.\n\nWas it possible that Napoleon should win this battle? We answer no? Why? Because of Wellington? Because of Blucher? No. Because of God … Napoleon had been impeached before the Infinite, and his fall was decreed. The vexed God. Waterloo is not a battle; it is the change of front of the Universe.\n\nWhat is Waterloo? A victory? No. A prize. A prize won by Europe, paid by France.\n\nIt is not much to put in line there.\n\nNo, it is not much to put in line there, but it is typically English. When they were stampeding on the Somme, the Daily Mail headed its news, \"Hunting the Hun back\".\n\nMay 5\n\nChapter XV, \"Cambronne\" stands with Chapters IX and X.\n\nWhat is truly admirable in the battle of Waterloo, is England, English firmness, English resolution, English blood: the superb thing which England had there – may it not displease here – is herself. It is not her captain, it is her Army.\n\nWellington, strangely ungrateful (but true to all of the Englanders instinct) declared in a letter to Lord Bathurst, that his army, the army that fought on the","40":" was a \"Detestable army\". What does this dark assemblage of bones, buried beneath the furrows of Waterloo, think of that?\n\nEngland has been too modest in regard to Wellington. To make Wellington so great, so to belittle England.\n\nBut this great England will be offended at what we say here. She has still, after her 1688, and our 1789, the feudal illusion. This people, surpassed by none in might and glory, esteems herself as a nation, not as a people. So much so, that as a people they subordinate themselves willingly, and take a Lord for a head. Workmen, they submit to be dispersed: soldiers, they submit to be whipped.\n\nTo add the remainder of the paragraph is unnecessary. Hugo has judged well, and has admired clearly. But now, after all these years, the selfsame condition obtains, still the soldiers submit to be whipped and the \nLord\n officer looks upon his men as his \"detestable soldiers\".\n\nI wonder how England herself and her people will come out of this war.\n\n114.\n\nMail tonight brings back sketches posted to War Records from Kemmel.\n\n\"I regret to inform you that you were not among the successful applicants\" … the sketches were returned, all with the one exception of Bailleul’s Hotel de Ville and the tower of the church, and both now are in heaped ruin.\n\n115.\n\nNancy has delivered to the Ambulance four puppies: it is sincerely to be hoped Dian’s jealousy is not arroused. Dian’s sons and Nancy’s tho’ will move in different societies – the M.T.’s and the Cookhouses.\n\nMay 6\n\n116.\n\nReal rain – big heavy splashing rain and then clear air, and clearness over the fields: this last night. This morning clear but dull leaden skies, and a heat in the air from a hidden sun.\n\nEarly – about 3 a.m., a great bombardment, and the early morning of yesterday another. But the casualties from the line, keeping well down.\n\n117.\n\nTurning in I read a short tale of Balzac’s in \"Christ in Flanders\" – \"El Verdugo\". It’s a tale I’ve read of – referred to in some essay of Wilde’s or some such writer – of a Spanish noble family – sentenced to death, meeting death at the hand of the family’s firstborn. That the line might be unbroken, at the commands of the whole family, the eldest acts as executioner.\n\nIt opened up a long argumenting in the cellar as to the most desirable method of death – by hanging or beheading, Les and self favouring beheading, the majority for hanging. There is something grotesquely horrible about the gibbet and the disjointed marionetting of a neck-hung corpse.\n\nThe block is definite and clean from grotesquerie.\n\nMay 6\n\n115.\n\nMail, T.L.S., May 2, and a Balaclava from Australia! T.L.S. good in announcements but poor in reviews. Francis Ledwidge’s last book – posthumous \"Last Songs\" received with J. Stephen’s \"Reincarnation\". J.C. Squire’s \"The Gold Tree\" announced in a limited signed edition of 500 copies at half a guinea! Wrote to T.B.C. for it and Cardinal Gibbons’ \"Faith of Our Fathers\", and to C.W. Beaumont a 20 F. note for \"Tale of Igor\" & \"The Little School\" of Sturge Moore’s. (Payed today!)\n\nAnother half guinea book – books are the two volumes of Herbert Trench, \"Poems: with Fables in Prose\": no review but the publishers Constable. Grant Richards definitely announces Waugh’s Resentment and two books of S.P.B. Mais – \"A Schoolmaster’s Diary\" and \"Lovers of Silver\", both at 6\/-.\n\nJames Joyce is seemingly of the moderns, his novel \"The Portrait of the Artist as a Young Man\" broke the old orders in its title, and by a few reviews seemed good. Two of his plays are now out, \"Dubliners\", 5\/- and Exiles, 3\/6, both by G.R.\n\nNow \"The Oracle of Colour\" from Beaumonts is overdue: but always books from him have been long delayed, then the charmingly written letters of apology accompanying the books at last are as enjoyed as the parcel itself.\n\nMay 7\n\n119.\n\nMail – two pairs of sox from home, wrapped in paper that originally came from T.B.C. around books received at Quehen: I sent it home around \"Twinkletoes\" and Vernide’s ‘Poems’. From Commonwealth Bank remittance of £10 and I’d expected £20, so will have to wait now if leaves opened till £5 more arrive: wrote today for it. My own fault in changing amounts asked for: but I wrote from Paris for another £20: so perhaps it may be shortly with the Bank.\n\nWrote letter to Jake. Day of showers and dull sun: now – evening – D. Bearers up from H.Q. and into the line. Killjoy – Killjoy no longer since his first appearing at our late dinners, today away to 2nd Field to take place of one of their Sergts. killed.\n\nBombardments on the left: the rumour is of the French putting two Army Corps against the Boche with the objective – Kemmel Hill: seemingly all this while when we’d believed it ours, the Boche has still held it. Last week’s rumour – the Division in till the 18th now in till the 28th.\n","41":"\n\n120.\n\nFrom Anzac Bulletin, April 26.\n\nBy F.M. Cutlack\n\nWar Correspondents’ Headquarters,\n\nFrance, April 16th.\n\nIt is now possible to state that the Australian divisions hurried down at the beginning of the last week of March to block the German advance on Amiens were the Third and Fourth. The Fourth Division holds the reputation throughout the force as the most travelled Australian Division about France: it has fought in every field, and invariably with the greatest distinction. The Third Division is the newest of all, never having fought outside Flanders. It came to the Somme country with the keenest enthusiasm. Its battalions long withstood the friendly chaff of other divisions as not being \"dinkum\" Anzacs, because they had never seen the Somme. They had the honour of bestriding the ridge between the Somme and the Ancre in the direct path of the Germans, and were sent in to battle individually as they dismounted from omnibuses. They flung themselves against the enemy advance guards coming on along the Somme with the utmost exultation.\n\nOn March 27th and 28th two brigades made a brilliant skirmishing advance south of Mericourt and drove in the enemy’s advanced lines, and clearing the large Treux Wood, established a firm well-sited line running down in the direction of Sailly, which was held against all attacks. In this advance a Tasmanian battalion made a particularly gallant fight.\n\nFourth Division in Action.\n\nNorth of the Ancre the Fourth Division came into action contemporaneously to the west of Albert, after the magnificent forced march previously described. One of its brigades went in to action to support a tired British Division. This brigade, like the other two west of Albert, met with heavier fighting then the Third Division, especially at Albert, where it was called upon to withstand heavy German massed assaults, especially in the great battle of Dernancourt on April 5th, when, after an all-day fight it threw back the storming infantry of four German divisions.\n\nApril 4th and 5th were days which will long live in the history of Australian arms. They were days on which the Germans tried their utmost, with what forces remained to them, to hack their way through to Amiens. On April 4th was the effort south of the Somme against Villers Bretonneux, when the British cavalry and New South Wales battalions fought tooth and nail a heroic battle against great odds. Their flanks were constantly hard pressed; the town itself, the centre of their position, was deluged with shell-fire; nevertheless, giving ground only by inches, and repeatedly counter-attacking, they finally saved the position, after eighteen hours’ fighting, with a magnificent advance of the New South Wales battalion at one o’clock in the morning.\n\nSince that day two New South Wales brigades among British troops from south of the Some to the French junction near the River Luce, having repeatedly engaged in skirmishes, wherein a little ground was lost among the woods, but only at the cost of the severest losses to the enemy.\n\nIn the same issue Bean again calls general attention to \"Enemy Intrigue\" –\n\nGerman war correspondents have been instructed to proclaim that Britain, as usual, is placing colonial troops in the hardest and most difficult positions. Of course, this ponderous sympathy is handed out to us with the sole object of delivering us a crushing blow on the head if we fell into the trap, but it is worth while to state frankly what truth there is as to the employment of dominion troops during the present battle.\n\nand concludes – referring to what the 3rd and 56 did at Arras, the 57 at Givenchy, & the 9th beyond Peronne –\n\nAustralian troops far prefer to be classed as they are classed, with divisions which made these glorious stands, than to accept double-edged compliments which the Ger-\n","42":"\n\n121.\n\nAbout 9 last night a shelling about the A.D.S. and big iron in place of the sensitive \"daisy-cutters\": the closest by the old bandstand arrangement where the salvage is dumped: the concussion in the cellars as though the world had broken. A yard from the edge of its hole, one of our limbers, and beyond earth, not a scratch on it: in the ripped off tarpolin a dead sparrow. In a half hour he kept us listening and waiting for the hit on the building.\n\nTurned in and slept till very early this morning: then a long laying awake, expecting and listening for the bursts: just as a great bombardment opened up about the line, our issue arrived – long salvoes of gas shells by the embankment.\n\nMidday, and still the noise of guns: on the left – probably about Kemmel, heavy and consistent rolling.\n\nThis morning gave the promise of a full sun day, but a breeze has taken half the warmth from the sun.\n\nYesterday morning the Boche was expected to attack here: his infantry, massed behind his lines, were got into by the Artillery, and the attack came to nothing. Today trenches being dug by the orchard hedge.\n\nMay 8, 9\n\n122.\n\nMail: from C.W. Beaumonts \"The Oracle of Colour\" and \"Memories of Childhood\" - the last the first of a Green Pastures Series of cheap books from the Morland Press. Two announcements of Press books – \"New Paths\" an illustrated annual – with a limited edition: all sold, pencilled by limited edition prospectus, ordinary copies 7\/6, edited by C.L.B. and M.T.H. Sadler – the author of \"Hyssop\" and translation of \"Belgium’s Agony\", \"Raptures\" by W. H. Davies, the other Press book, probably the third of the Georgian Poet Series. Borrowed 20 F. from Les and wrote for it.\n\nOf the 40 contributors to \"New Paths\" only 16 well recognised by self.\n\nAn afternoon spent playing golf – with hockey sticks – in the sun with Les, a game interrupted by the landing by our links of a shell that had lost its way.\n\nMay 9\n\n123.\n\nTurned in reading Freeman’s \"Memories of Childhood\", a dainty collection of pieces of real charm, \"Childhood Calls\", \"The Fire\" – the most beautiful of all – \"The Swing\", \"Fear\" and \"When Childhood Died\" all full of old child memories made perfect by compleat recalling.\n\nMay 9\n\nCome over, come over the deepening river,\n\nCome over again the dark torrent of years.\n\n…\n\nCome back to the time when time brought no burden,\n\nAnd love was unconscious knowing not love.\n\nThe mornings far too full of sun to spend writing: and today some time we leave here – handing over to either the French or the English, B. Sect. probably to Borre, A. back in reserve to H.Q.\n\n124.\n\nA yarning at dinner of ways & means of living \"Apres la Guerre\" without working. Les favours a dependence on a gun, and a life of a primitive: Norm suggests going to Burns Phillips and asking for an Island job, \"But the bastards might expect you to work!\" – and he changes his hopes. Together with Buck, he’s for running a Prophelactic Depot – at the Railway, King St. and the Quay: so followed loud talking of side lines, but the idea is good – good to be taken up by the Government. Certainly it is one of the most plausible methods of combating V.D.\n\nA bonser morning, spent walking up and down in the sun, by one of the paths in front of the A.D.S., scheming for the production in Sydney of a series of representative cheap books – of prose and poetry. So far nothing in this line has yet been attempted.\n\nMay 9\n\nTyrrel would be the man to interest, and perhaps Adams of the Bulletin. Certainly an annual – after the \"Melba Gift Book\" style of the year’s most representative clippings of prose and poetry – with half a dozen plates of The Society of Artists’ most suitable exhibits would in a very short time come to take a high place in a collection of Australian Literature.\n\n125.\n\nAn afternoon spent basking like a lizard in the sun, half stripped on the wall by the orchard.\n\nIt is a long while since we have heard of any of America’s war paint: a promise was that by January a great school of planes would be ready, and for the spring her fighting men. Today an Inf. chap of the 6th Batt. – a bar M.M. spoke of some French spoken opinions. It is over a year since the Americans declared war – now they profess a readiness early in 1919. Truly they are \"hustlers\". Move off at 6.\n\nToday the monestary of Mont des Cats shelled.\n\n176.\n\nLethaby’s Architecture: Forms are nothing in themselves, they are only envelopes of the spirit of Architecture. The Greeks first freed the spirit of Beauty from the hieratic: Architecture was purged of terror: they aimed at what was gracious and lovely.\n\nMay 9\n\n127.\n\nLa Kreule, Billets\n\nOver to my right above a grouping of tall heaven-aspiring willows about a pool where the transport water their horses, there’s a sky of lovely tiny light-catching clouds, above them specks of pale red-gold sky, of salmon and pink – blue green fading blue and the silhouette of trees below.\n\nWhen a man is drunk, there’s the laugh of satire in his mind, and the desire to compleately surrender to his natural inclinations, if Jake were here I’d worship his beauty as a God’s!\n","43":"\n\nI have been drunk, but all the while my inner mind is sober – fully appreciating, and still looking for physical beauty. The passion of Narcissus for his own reflection was no weak love, but the culmination of a passion to worship of beauty, too terrible and sensual for the modern world to think of, too wounderful for them to dream of.\n","44":"\n\n128.\n\nYesterday a French Flying Corps man brought down by an English squadron, there’s some mystery about the affair – two of the English were brought down too: no Boche in the sky. The telling is that he failed to answer signals, & being out of the French arc, the accident is dismissed as explained.\n\nToday A. Section Pall Bearers and Honour Guard: a long funeral well attended by French staffs and their Flying Corps. He was buried by the side of Cliff and Maj. Stuart, 6th Batt. the Firing Party. Two of the English staff and two R.F.C. men represented England. Henri Renault, R.I.P.\n\nMay 10\n\n129.\n\nA dull day of deepness: no mail, no sun. Reading selections from \"Modern Painters\" from Johnny J.\n\nYesterday Harold N. back to unit: he attached for a while to 2nd A.A.H. pined for the line again: so he’s back to A. Bearers.\n\nEvening, turning in after the 9 parade.\n\nTried this afternoon for a while a reading of \"The Beautiful\" – one of the selections from \"Modern Painters\". I read one single page, then a definition of Taste set me lazily wondering.\n\nPerfect taste is the faculty of receiving the greatest possible pleasure from those material sources which are attractive to our moral nature in its purity and perfection. He who receives little pleasure from these sources wants taste: he who receives pleasure from any other sources, has false or bad taste.\n\nWilde’s old \"There is no such thing as a moral or an immoral book: books are well written or badly written: that is all\" immediately came to mind reading this, and it almost applies to \"Taste\", there is no such thing as good taste or bad taste. Taste is an instinct, possessed by all – and a faculty realised by all, it is a realising of the fitness of things, by the individual, it is his impression of hope against the barrenness of his surroundings. Taste is not preference: preference is limitation, taste embraces all.\n\nMay 11\n\n129.\n\nRuskin is very contradictory: His definition of the Beautiful read, \"Any material object which can give us pleasure in the simple contemplation of its outward qualities, without any direct and definite exertion of the intellect, I call in some way, or in some degree, beautiful\", which is as happy a definition as is possible. Then this is hardly to be reconciled ..\n\nThe mere sensual pleasure of the eye, received from the most brilliant piece of colouring, is as nothing to that which it receives from a crystal prism, except as it depends on our perception of a certain meaning and intended arrangement of colour, which has been the subject of intellect.\n\nSpots of blackness in creation, to make its colours felt.\n\n130.\n\nThe Billet – the usual grouping of thatched barns and stables about a brick, tiled cottage, stands well back in a great tree bordered and hedged field: but the big difference from other Billetings is the trained tree lined road dividing the field in two, from the road to the barns, and the stagnant pool is here clear, closely bordered by new-green willows & away from the billets, in the clear grass land, alongside the straight road from the entrance, and two tall poplars at the gateway flanking pillars, contrast happily with the ordered trees of the drive.\n\nAnd all over the brilliant green of the deep grass great clumps of small white golden-eyed daisies pattern with giant dandylions.\n\nAll the afternoon the sun has been brilliant, and there’s been a worshipping lying deep in the grass. \nTed Ackland back with the unit, and the brilliant colour of a full sun on\n\n131.\n\nTurned in. Our billet is a great thatched barn, wide and high and large as a church. The deep high roofing, beautifully built of roughly axe-dressed timber, tie-beams and struts and braces swung with perfect rhythm from the brick foundationed mud-plastered walls, and a\n","45":"\n\nskeleton – frame partitions screening across the centre from the tall double doors of either side, add intricacy to the low tie beams and their struts. The far end gable – a brick wall strutted outside by a buttress pier – has a round window, filled with a primitive spoking of bricks, in the night a luminous sky fills it with a rich colour, and the shadows of the roofing, with the framings catching of light all the more suggests an old villiage church turned to a Billet. A rumour tonight of two landings at Zeebrugge and at Ostende: but it’s a tall telling – the Boche is not asleep on the coast, and his defences are there surely something to wounder at. B. Bearers up to the war tomorrow, we perhaps to Borre.\n\nMay 212\n\n132.\n\nBorre, A.D.S.\n\nFrom La Cruele this afternoon to A.D.S. to work with C. Section. Night Duty clerking with the dark Assryian . He reminds me always of \"The Cup Bearer\" of the wall painting of the Palace of Knossos. His features full of the beauty of the Assryian carvings, but without that strong character of cruelty: as the wounderful Jake is full of a Greek Paganism transplanted to Australia, so Watts is the Assryian after centuries of the sun and blue of Australia. Though he’s been in the unit since Ypres, he’s practically a stranger.\n\nMay 13\n\n133.\n\na.m.\n\nJust for a minute saw Vin Davis last night: he passing the A.D.S. going up with G.S. wagons.\n\nMail yesterday a barren choice in Books Catalogue from Holland Bros. and List No. 3 Clearance List from Davis and Oriole, the morning damp and a grey cold windy mist about the billet: and the afternoon a sun through the clouds that cast no shadows. So I wrote to Davies & Oriole for the only book of their list of any appeal – the 1st edition of Georgian Poetry 1913-15,","46":"\n\n134.\n\np.m.\n\nAn enthusiasm growing again for a No. 5 Ghutz. Basil down to La Cruele today and saw Owen B. – he sending up a book of copy: but its stuff published in several rags, and the idea of Ghutz was to only hold original stuff, so Owen to write up something during the next few days. Capt. Murphy expresses interest, promises article, also Capt. Scolds.\n\nThe press down with B. Tent Sub. but the Col. promises to have it sent up to us.\n","47":"\n\nMail: T.L.S., May, but still no \"Reincarnations\". A review of two volumes of Trench’s \"Poems & Prose Parables\".\n\nAll day dull, rain and drizzle, and no sun.\n\nLast night of the Assryian. I wrote his suggestion in a manner of Jake: tonight he is Jake.\n","48":"\n\n135.\n\np.m.\n\nThis morning two 2 L.T.M.B. men through: after the few bad stretcher cases through during the night, they with their accidental wounds caused by badly set guns, brought from the line some of the manner and attitude of the Infantry.\n\nAnd today the sun was brilliant and warm: all the morning I lay out in an adjoining field deep with new grasses and buttercups – lay awhile reading, then half sleeping. Shells going over seemed reluctant sacrileges and ‘crunchers’ in the villiage ashamed even in their bursting.\n\nIn the late afternoon planes over, and balloons droping phamplets : a small white globe lazily and slowly drifting across the blue and slowly smiling below it great branches of loosened leaves, visible when the sun flicked them, making them like great shoals of tiny fish on the water surface.\n\nMay 14\n\nMail: \"To-Day\", May number: an article on James Joyce, his \"Exiles\", a play I’ll write for as soon as I’ve settled somewhat of my account with T.B.C. Would like to read his \"Portrait of the Artist as a Young Man\" and \"Dubliners\".\n\nFrom Rusty T. my \"English and Welsh Cathedrals\". I’d given up hope of its reappearing – thought the Boche would have it from La Clyte.\n\nThe rumour of the day is of the Boche massing in front of us: but its obvious truth takes greatly from facinating elaboration.\n\nBill F. down to H.Q. today brings back the telling of C. Section being relieved by B. – they back from . The super-egotists seem our inevitable \"second half\".\n\n136.\n\nHungarian Melodies, Vol. 1. Jack Raisbeck had them first at Durnshire Lines, and he played them to George Eaton’s singing. Tonight I rescued our \"Ghutz\" copy from the Musick and read through the book. The old favourite, the first Jack played – and then only on the Dulcitone but most exquisitively – still stands out from the others. \"Mourning in the Villiage Dwells\" with its sobbing melody and passion and its strange terrible words all that indescribable beauty of old legends and Gothick carvings.\n\nMay 14\n\n1.\n\nMourning in the villiage dwells: \n\nHear the shepherds mourning bells!\n\nYester-morn he led\n\nTo the pasture sheep he led – \n\nNow he sleeps beneath the church-gate dead.\n\nMother to the pasture come,\n\nBid your shepherd-lad go home!\n\nMother, not tonight,\n\nAt the inn there’ll be a fight,\n\nAt the inn I’ll bathe in blood this night.\n\nTo the inn I go to-night,\n\nShepherds three they seek to fight:\n\nAnd a fourth stands by,\n\nAnd to quell the fight shall try:\n\nHe must quell it though he live or die.\n\nMourning in the villiage dwells:\n\nFor the fourth they toll death bells,\n\nMother go thou home,\n\nTo thy shepherd never come,\n\nFor he hears not when you call him home.\n\n2.\n\nCome in my rose, my rose come in,\n\nI stay alone here in the inn.\n\nOnly three poor gypsies play for me,\n\nLonely dancer I to their minstrelsy,\n\nOnly three poor gypsies play for me,\n\nLonely dancer I to their minstrelsy.\n\n3.\n\nThere was none to match Ke-re-Kes\n\nIn town or about it;\n\nWhen drafted to battle he was,\n\nGirls all cried about it.\n\nTho! – who cried the most was one oh!\n\nHis own sweetheart Rosi Panna!\n\nHis own sweetheart Rosi Panna.\n\nMany a bloody battle fought,\n\nGlory, honour earning,\n\nDealing death to right and left \n\nbut for his sweetheart yearning,\n\nTho! while he fought, faithful keeping,\n\nPanna ceased to go a weeping,\n\nPanna ceased to go a weeping.\n\nGlorious scars on breast and forehead,\n\nWeary he returned,\n\nMore than all his wounds, his true heart,\n\nFor his sweetheart burneth,\n\nTho’ but with another man, ah!\n\nGone – to church is Rosi Panna,\n\nLost to him is Rosi Panna.\n\n\"Come in my rose\" would make a most exquisite Russian Ballet motif. No. 3 suggests the complementary addition from a letter of Edward II to his son – from \"Royal Letters\" (belonging to House).\n\n\"Also, fair son, we charge you by no means to marry till you return to us, nor without our advice and consent now for any cause either to go to the Duchy, or elsewhere, against our will and command.\"\n\nFor an essay on \"Wars Sudden Weddings\" both these could be worked in.\n\nMay \"To-Day\" includes extracts from \"Stray Birds\", a companion book to \"Pawns\", \"Vengeance of Fionn\" and \"When\".\n\nMay 14\n\n137.\n\nTonight there is either shelling or bombing about Borre: wither shelling or bombing – here is an attitude of ignoring: it seems like bombing. I have gone on with, completed and read half of the May \"To-Day\" – yet each explosion has jarred me – for the instant obliterated the appreciation of the Hungarian Melodies, of Arthur Symons \"A Reading at Count Prismola\" , of Ezra Pound’s \"Chinese Poetry\" – a militant essay of his appreciation against the poor understanding of the multitudes. What is Fear? I am afraid – in my imagination I see my own body torn and bloodied from a shell’s bursting, yet from a purely selfish feeling of vanity I am afraid to show my fear. In \"Deutsche Dekoration\" – or in \"The Studio\" years ago there was a decorative panel Fear – of Hound-like man crouching terribly before the pictures of his own imagination. But cowardice and fear can never be described, can never be defined, they are as abstract in their concreteness as Taste and Beauty and Morality.\n\nNo cases yet, but still this monstrous shrieking and Hell clapping that paralises the intellect and sends along a brain and blood-slippery path a rioting imagination. \n\nIn the last hour Norm and Billy have fixed with a new spring the phonograph grouted from Caestre, now the Dressing Room a concert hall with a programme of the usual records.\n","49":"\n\n138\n\na.m.\n\nPosting this morning letter to Mother. Must write to Grandma and Betty and Geoff: Mat I owe two letters to and Hazel, and to Mrs. H. and Aunt Louie and Elsie. Posting \"The Oracle of Colour\" home. From midnight a fair stringing out of stretchers and walkers, a fair number of sick evacuated from supports looks like something doing. A night of sudden shelling and isolated replying.\n\nToday’s slipped back to the old greyness.\n","50":"\n\n138A.\n\na.m.\n\nWith Les F. in the morning down to H.Q., at 10 the grey cleared away and the day was full of summer and colour.\n\nTook down to Ruthven the grouted Tunic and down again by self in the evening received it back with the collar altered.\n\nNo mail yesterday. Today posting 5 Francs to Smiths, Paris for James Joyce’s \"Exiles\".\n\nThis morning the sun – a great enormous ball of misting red behind the trees promises another brilliant day.\n\nMay 16\n\n139.\n\nGas shells about the D.S. early last night, but no casualties.\n\nThe rumour was that we were sending over gas during the night: but their guns have been comparatively quiet, so probably nothing was done.\n\n140.\n\np.m.\n\nUp early in the afternoon, and a bath in the field in the hot sun, then after tea a listening to Vern’s singing, to an accompaniment of Basil at the Piano and Scold with the violin. Sitting on the steps from the room to the road, and the door open, each small party of Infantry, coming down to the Y.M. for a bath, then passing back again, were our changing audience. For an hour yarning there to a 2nd Batt. chap on spotting for Artillery work, a yarning of Paris, of Gaby Dislys and all the lovely dancers, he’s a French Canadian, a Vaudeville Rag dancer, he full of quiet appreciation of enthusiasm for the right songs, of Vern singing. To meet for a while one of these facinating chaps, to meet them suddenly and in a natural manner when in a yarning mutual loves are revealed is one of the happiest happenings here, but they’re rare – but as memories precious as old friendships.\n\nNo mail.\n\nMay 17\n\n141.\n\na.m.\n\nSince midnight the Dressing Room filled, emptied and filled again, some had woundings, and two deaths. Got Murphy and Cato on, and two good men. We are well officered now, better than since the Factory Corner stunting of early 1917. Major McKillop, Capts. Blackall, Murphy, Cato are all good men – good in their work and in their manner in the Dressing Room. Capt. Conner is the same.\n\nHas the stunt from the Boche – rumoured for Sunday morning – started? Early today he attacked in front of Meteren. Just the bare word of the attack is ours: Caestre will probably be the A.D.S. of the stunt.\n\nToday will about compleat our stronghold: from trenches about the fields and about the station, signs lead to the main cellar, saps for stretcher bearing: but if there’s a big list of casualties it will be of very little value, and bearers and patients will have to take their chance.\n\nShelling last night close about the Brasserie. Concussion in the D.R. from anything even moderately close would be rather solid!\n\nThe sun above the quiet still trees richly red, and already the sky shows clear of clouds, above the church blocking the end of the road the two Boche\n\nMay 17\n\nballoons clear: straight down the road they look: a hundred yards up the road there’s a billet of Traffick and more guard: on their doors the notice,\n\n\"Any Aussie who thinks he can thump the ivories is invited to hop inside.\"\n\nand in the sun a half a dozen laze in front of the door, through the Brasserie’s gates to the D.R. there’s all day a fair travelling through, and two hundred yards down the road the Y.M. walls make great backgrounds to resting wayfarers.\n\nSo there’ll be more shelling.\n\n142.\n\nYesterday Les received a letter from \"Kellysy\", written even in his slight lisp and full most funnily of his ‘staff’ manner, he has not heard from his ‘dear wife’ since leaving us, a bit rough!\n\n143.\n\nBreweries and sugar factories far more than Chateaus seem naturally to become our Dressing Stations. Pozieres A.D.S. was the Warloy Chateau: Meteren the railway Chateau of Caestre. Flers were encampments at Longueval, and at Byzantin le Petit, but by Byzantin were the ruins of an old sugar refinery: Bullecourt A.D.S. was a couple of Dugouts along the side of the road from Veaux to Noreuil. Hermies were by the 2nd, seemed a collection of old Farmhouses and tents in La Becquiere, Kemmel was an old Brewery and Borre is a late Brewery. The cellars though are poor and unstrengthened by any additional piers or girders but the old long girders of hardwood – whole trees roughly squared and spanning over 30 feet, the D.S. is hardly a cellar – simply the old \nblack\n bulk store, a foot below the ground level. Kemmel Brewery cellars were good – strongly strutted and pillared, and deeply buried by the buildings debris, and pilings of sandbags, good finding for the Boche.\n\nWriting for the sake of soiling paper: entry 143 heralds the mood of wasted wonderings – la Guerre!\n\n144.\n\nThis morning in the D.R. Harry spoke heresy of the lovely Gaby, but Harry’s a Methodist. I told him God had fully realised himself creating her. That a person should be a consumate work of Art. H. quite failed to realise.\n\nIt would be rather an unique experience to take to his home for his appreciation a folio of Beardsley’s courtesans or Degas’ Ballet Girls: but he’d close the door & appreciate them as \"hot\".\n","51":"\n\n145.\n\nIn Sully’s Buffet, some friend of his there reading a batch of home letters, finishing one, he turned to Teddy with,\n\n\"That’s a letter a list of people would like to get hold of – it’s a letter to my wife from her sister asking her to come and stay with her as long as she likes, but she won’t take any money for it!\"\n\nSays Sully, gently and agreeingly,\n\n\"Oh most people are like that that are properly brought up!\"\n\nMay 18\n\n146.\n\na.m.\n\nEarly, to the R. of Meteren the 5th raided for identification, there was a barrage over the raided trench, so perfect that most of the funk holes and shelters were blown well in, but it was an empty front line that was shelled and raided! Nine of the raiders through early, one with a vivid telling of excitement.\n\n\"The first hole was empty: I put my bayonet into the next and struck something soft – thought I had him! it was a waterproof sheet, and all of a sudden I was blown up into the air, landed, and somebody grabbed me shoulder strap – started to cut it off!.\n\n\"What the bloody –\"\n\n\"Who’s that?\"\n\n\"Dunstan!\"\n\n\"Christ I thought it was!\"\n\n\"Everyone seemed going all over the place: we made back to the flare – it went out and the M.G. opened, back over the trench, then into a strongpoint.\"\n\nIf Dunstan had read Pepys he’d have inevitably ended – \"and so to the R.I.P.\".\n\nMay 19\n\n147.\n\na.m.\n\nYesterday morning with Watts to H.Q. and a leaving there of boots. In the Billet Capt. Neeve brought over to me some paper for \"Ghutz\" – good bright surfaced stuff and over a hundred sheets.\n\nTill an hour ago from 9 last night printing front page – \"Salvage\" by Sharp and compleating drawing of back page: 50 copies of front page completed: Basil to go down today to H.Q. to fix for typing.\n\nYesterday a day of hot burning sun: in the late afternoon to the Borre church, and a sketching of plan on next page: a plan interesting from its suggestiveness, from the pulpit all the church well within range of voice and vision.\n\nMay 19\n\nThe big gas shelling for tonight seemingly postponed again. Now about 2 a.m., only one stretcher case through – a 3rd Batt. officer, with the tiniest of wounds in the thigh, carried in from the car. Les put him on a stretcher, and the shell dressing removed, revealed a scratch and faint spotting of blood.\n\nTwo Tommy runners, down from Pradelles through Borre, wearing shorts. Three R.S.B.’s going up to Strazeele: one mouths an oath with –\n\n\"Got them bloody running pants on – only want them spiked shoes!\"\n\nPassing the M.G. Camp this morning, they doing physical jerks under an instructor, and the sun burning down, coming back they were ranged in parties about other instructors – they swinging loaded ropes in a circle, the chaps jumping over them as they swung under their feet.\n\nLate yesterday afternoon a 1st Batt. chap through, Ted, asked him what they’d done down at Sercus.\n\n\"Oh drilled Christ out of us!\"\n\nThe 1st Brigade were \"resting\" and the M.G.s are in reserve.\n\nMay 19\n\n148.\n\n10 a.m.\n\nLeaving \"Ghutz\" to Basil to compleat cover: roughed out a page of \"Salvage\" pars. Wilk. bit seeing the cover – he took it for a \"sling off\" at his goat episode of \"Strazeele. He had salvaged a she goat, and bringing it across a field the Boche started iron salvoes: the telling is of Vic throwing the goat into a shell-hole and mounting guard: Vic was richly mellow with old wine. A sacrilege to turn in, the day so full of sun and colour, this morning the Boche was to have started here his great attacking: but beyond the heavy rumbling of far away guns, the early morning has been unusually quiet.\n\nYesterday no mail again: Today?\n\n149.\n\np.m.\n\nThis evening with Les F. to the end of Borre, and a flower grouting – white Lilac and pale mauve, pink and brilliant cerise stock, a white bag of young lettuce from the garden by the new cemetery by the trenches.\n\nFound too a vellum manuscript book of cataloguing. Velum? It is more of a fine skin texture, and there are pages of living and wounderful comliness. Item 61to its ending, \"Laus Deo\" varying in its colouring as the brush has emptied of its colour mellow with age and beauty. Entries fill the deep margin, some in Gaelic. It is a book that has seen the early 17th century.\n\nMail: From T.B.C. James Stephen’s \"Reincarnation\", from the T.L.S. revue and its quotations from \"Righteous Anger\", \"The Weavers\" and \"Peggy Mitchell\". I’d anticipated a second book of rather difficult translation, but just a brief lazing through it cutting the leaves and a finding of a book of good reading.\n\nBlue H. in tonight, and talk of the Boche attack rumoured for tomorrow night, and of a high confidence, the lone weak point is the Tommies front: but even if they break the stage managing is good and the French and 1st Division will join again.\n\nMay 20\n\n150.\n\na.m.\n\nThe 5th relieved in the front line by the 4th, and two 5th casualties through. A quiet night, guns about here silent with breaks of occasional sudden salvoes, rumblings from the flanks. Planes over and over.\n\nThe morning full of sun, but I’ll turn in early for a sleep today.\n","52":"\n\n151.\n\n\"The Queen’s Room\" scene from Chastelard would be great in sepia and Blue in vellum, in the manner of the old parchment book I found yesterday, three other great parchment covered tomes of stiff tough paper, in manuscript, and near a hundred smaller phamphlet books – all about the 17 and early 18th Centuary are scattered amongst debris of broken boxes and tiles of the attack of the Cure’s house. \"The Golden Asse\" would be wounderful in this manner.\n\nNow with the two engravings of Armentieres, this parchment book is strapped in waterproofing, and till I can carry it to England I’ll have to carry it without seeing it, the engravings as soon as we’re back I’ll try and send along to Mrs. H.\n\n152.\n\nA 2nd M.Gunner in early before breakfast, and he full of good tellings: his wound a through and through shell fragment of R.Am., down to square the M.O. to let him stay on duty.\n\nThe impression he gives of the first arriving here and advancing from Hazebruck – of a travelling forward against stragglers and retreaters and refugees, of arriving by Nieppe Wood, and establishing posts, and an evacuating with no flanks, of evacuating their guns mounted on froggie barrows, along roads flanked at intervals by hospitable estaminets, of posts temporarily established by them, and a general skirmishing of all Flanders. Then more \"Tales of The Tommies\" …\n\n153.\n\np.m. midnight.\n\nA second drawing of the back page of \"Ghutz\". Basil promised yesterday to compleat it, and today had a mood for playing. The day hot for sleeping, so tried my hand at printing, and tonight had to draw out another slate. A. Bearers up to relieve B. All the afternoon the first wearing this year of shorts lying in the sun.\n\nMail, letter from C.W. Beaumont of shortly sending along \"Tale of Igor\", \"The Little School\" and \"Raptures\".\n","53":"\n\n154.\n\na.m.\n\nGas shelling over the 1st Batt. and its effect strange. Am bad, terribly delirious, with none of the old gas symptoms: all others comparatively light, only cordite the smell in the air, but gas heavily with 5.9 H.E.\n\nPradelles heavily shelled during the night.\n","54":" a.m.\n\nA barrage over the railway below us, and the road to H.Q.\n","55":"\n\nIn shorts, in the sun burning the last of the white away. Yesterday H.Q. Canteen sold a batch of Khaki shorts – shorts that cover \nquite\n down six inches from the loins.\n\n155.\n\np.m.\n\nTonight coming into D.R. a long yarning of an hour with Roland K. Somehow the talking turned to Limehouse Nights and so to a long arguing on \"The Chink and the Child\", it was an enjoyed argument – the first of its kind since the old nightly ones of the Nelson St. verandah with Harry.\n\nAn arguing roughly terminated by sudden salvoes from the Boche, and a rapid retreating to the trench by the Brewery.\n\nPayed today, drew 270 Francs, 150 down to Tommy for £5 order for T.B.C. No mail.\n\nMay 22\n\n156.\n\nEarly afternoon. A whole morning spent in the field by the tall tree flanking, full in the sun deep in the grass with Les. Then an hour sleeping in the tangled shade: looking up into the trees from under their shade they are green & luxuriant growth of maiden hair fern: each leaf lies flat, each stem and branching is black, and the light of a clear sky lends a shining brilliance to the green. White dryads bathing in the green leaf flecked pool would be the most natural happening in the world.\n\nThe next field to us is livid with the yellow gold of high buttercups: here are daisies, last night’s shelling has left broken black in the colour, and in the field of gold are two machine gun positions.\n\nJust from lazy habit the guns are firing.\n\n157.\n\n10 p.m.\n\nMail, from Commonwealth Bank, notification of money arriving. Gently they break the good tidings –\n\nDear Sir,\n\nWe beg to advise having received a cablegram from Australia, in which your name appears to be mentioned.\n\nA letter written asking for a holding of money.\n","56":"\n\n158.\n\nFrank K. today typed and completed 56 copies of central pages of the May \"Ghutz\". Tomorrow must to H.Q. and get Frank D.’s cartoon of the Intelligence Bureau to compleat number.\n\nWill give list to Wilk for B. Section copies – then the representative men will have the copies before the duds.\n\nMay 23\n\n159.\n\np.m.\n\nThis morning to H.Q. with Les, but found Frank D. with R. arm in a sling: got from him rough sketch of Flint – and tonight a roughing of it to a ‘Night Idyll’ – at Caestre Flint having a dog!\n\nMail. T.L.S. May 16 and notice from Davies & Oriole of \"Georgian Poetry\" being sold. Les down with the Dog Disease! Supper with the Padre, he receiving parcels from Vic. The whole day cold and sunless, so a sleeping in till 9.\n\nWilk has been evacuated from H.Q., general debility and boils.\n\nTalking to the Padre last night, he recommended me to have a year with Burdett, \"he’ll put you on to some good Fresh books\".\n\nHappy song\n\nI am too much alive to sing.\n\nI want to shout and leap and fling\n\nMy laughing arms into the air\n\nAnd dance on tip-toe everywhere.\n\nWith not a thought and not a dream,\n\nI want to skip beside a stream\n\nIn Arcady, in Arcady,\n\nAnd woo the wood-gods all to me.\n\nI want to feel them chase me down\n\nAmong the grasses green and brown,\n\nWith many a mad and merry cry\n\nOf Youth and Gladness ringing high,\n\nTill reeling frolic, drunk with mirth,\n\nSinks to exhaustion on the earth.\n\nIn Arcady, in Arcady!\n\nTra-la-la-la, who catches me?\n\nN.S.W.\n\nZora Cross\n\nMay 24\n\n160.\n\na.m.\n\nHow many of the A.I.F. carry somewhere or at sometime small snippings from the Bulletin! Murphy at La Clytte shewed me from his pocket book Alex Allan’s \"White Bled White\" and spoke of carrying some of Adams, at La Kreule, Burton produced a batch of M. Forrest’s Bulletin pieces. Tom Richard – new Lieut. In 1st Batt. carried collectings from Bulletin’s verse.\n\nI’ve felt a predujice against Zora Cross – they compared her to Swinburne when I adored him more passionately than I do now: but after this bonser little song, I’ll read more of her.\n\nTonight we have put over the Boche line over 1200 gas cylinders, now and earlier in the night he has shelled about the Brewary and Rail by the Road dull gas shells.\n\n161.\n\nThe Dressing Room is becoming as bad as the Cookhouse for hot arguing and impromptu war councils, now Bill and Harry and some of C. Bearers are the specialists – in Artillery!\n","57":"\n\n\"The Thrush\"\n\nA Thrush sings in the rustling wood\n\nJust as in time gone by\n\nWhen underneath the bough there stood\n\nA vastly different I.\n\nIn other woods, where no leaf grows,\n\nWhere never thrush sings clear\n\nThe song of Iron rang clear for those\n\nWho heard or could not hear.\n\nTo-day because of some who would\n\nBut cannot hear the call,\n\nA man stands where a boy once stood\n\nAnd hates to hear it all.\n\nRobert Nichols.\n\nIn the Sphere, May 11.\n\n162.\n\nA reading commenced of Shaw’s \"Getting Married\".\n\n\"She never understood that married people should take holidays from one another if they are to keep it all fresh.\"\n\nThat would sound terribly like heresy to Roby, in the mood brought about by enjoyed arguing a few nights ago, Roby said –\n\n\"That’s one great thing I look forward to\", night of close discussing and talking, of the things of interest with my wife. Perhaps we’ll get married on my next leave!\"\n\nAt Dranoutre at the crossing of the Loche-Kemmel roads, Roby told me of his engagement: and he told me in the face of my confessed predujice against our chaps marrying Englishwomen.\n\nShaw is very right in the public confession of the necessity of a holiday from marriage.\n","58":"\n\nEven six years ago, always the wonder was how two people bound for the term of their natural lives together should manage such friendliness & comradeship as they do.\n\nIn the wounderful sense, do I love ---? Yet I hardly know her! But over all my senses she holds rule, her playing will be a power to demand only reverence and a passionate love, her body is lovely with strong splendid drawing.\n\n163.\n\nT.L.S. of May 16, one announcement of interest beyond others, a forthcoming monograph of Ivan Mestrovic, publishing by Williams and Norgate: a limited edition, containing sixty four collotype plates.\n\nHe is the sculptor of magnificent torsoes, and of splendid men.\n\nWill Dyson’s \"Australia at War\" with a dedicatory poem by W.D., and an introduction by G.K.C., Palmer and Hayward the publishers.\n\nThe first printing of Alec Waugh’s \"Resentment & O.P.\" will be ready in a fortnight, 500 copies printed.\n\n164.\n\np.m.\n\nA dull day, restlessly slept through. On Duty in a mood of dopeness and moodiness. The guns smashing breaks clear to the nerves at the back of the head.\n\nMay 25\n\n165. a.m.\n\nStill a wind, but thinner clouds about the sky: the sun faint but of colour. Gas shells over – from Pradelles to La Kreule all night, casualties amongst 1, 2, 3, 4th Battalions.\n\n166. p.m.\n\nEarly down to Dressing Rooms talking to R., the Col. blew in ..\n\n\"Give us a bandage! How’s the Drawing getting along Moony? Come outside, I’ve something to say to you!\" All in one breath, as none other could possibly manage. The something, an order from the A.D.M.S. that I be \"made available\" for work on Maps, so tomorrow porter from A.D.S. to D.H.Q., and tomorrow Vin was coming across during the morning.\n\nMail, home letters and \"Tale of Igor\" and \"The Little School\" from Beaumonts. Letters from Mother, March 17 and April 1, from Betty Mar. 28, from Grandma, April 1, and Geoff’s letters to Mother of","59":" and 16.\n\n\"How about this for an idea! I address all my letters to you, you read them, and pass them on to Frank. Then he’ll get one a week from me, and you’ll get one a week, and I’ll only write one. See the idea, you post them on. If I start writing to Frank as well as to you, I’ll have to buy my paper, so I’m really economising.\"\n\nSeemingly the economy campaign has set in badly with Geoff – he’s given up reading the Automobile, so 9d. a week saved, and sleeping on blankets!\n\nPosting away to Mrs. H. \"Tales of Igor\" and \"Memories of Childhood\".\n\n\"Tales of Igor\", a most unusual book, but certainly well arranged, though not up to the beauty of the Poet Series.\n","60":"\n\nD.H.Q.\n\nSt. Silvestre Cappel\n\n167.\n\nAfter a morning waiting at La Kreule, an arriving here at D.H.Q. at 2 p.m. and a commencing right away at joining up maps from fragments, then on to a detailing of defences between Strazeele and Pradelles, Borre and Hazebruck.\n\nIt’s a facinating work and full of interest: but there’s a strain on the eyes that will limit my working.\n\nFirst impressions of the men on the job – mostly men of middle age, and of a good crowd, but I’ll miss Les and the family – miss more the working with chaps of my own age.\n\nA cold change, and one blanket on a hard hut floor! All day long a heavy bombarding. I wonder how they are at Borre, by the maps she’s a citadel!\n","61":"\n\n168.\n\nA long day of broken working: maps rolled for distributing to unit H.Q.s, minor clerking, printing notes for adding to Sheet 36 A.N.E. – the map of our area corrected to May 22, printing from map press and pasting to map headings: still about 50 to do, and a folio made for Patrol Maps.\n\nMail up by Blue D. from La Kreule from T.B.C., J.C. Squire’s \"The Gold Tree\", a beautiful edition with title page by Spare, and type of the style of The Riccardo Press.\n\nA day of full sun loveliness: a crime to deny by working.\n\nA big attack in progress by Soissons, and still yesterday’s bombarding here continues.\n\n169.\n\nThe Americans are introducing to France a new and deadly gas, it is so strong that getting into your pay book it will kill your next of kin!\n\nMay 28\n\n170. 7 p.m.\n\nFinishing a tracing of Reserve Brigade’s position in the case of the Boche penetrating beyond Borre. Tom asked me if I wanted to go out! I told as great a lie as I’ve ever managed when I said, \"Not if there’s anything you want doing!\" (\"I’ll do your plan Serj.\" – I could hear in my mind Les’ irony.) But there was nothing he’d particularly for me, so I’m out at last and in a field deep in gold: but the sun’s gone. Blue brought no mail with him.\n","62":"\n\n171.\n\nAfter an hour back and a while adding notes to Maps of Reserve Assembly, then a letter written to Mrs. H. and one to Geoff and one to Mat enveloped.\n\nToday I heard a good yarn.\n\nAn American asks a Monser what the ribbon is he is wearing,\n\n\"That’s a Mons Retreat Ribbon.\"\n\n\"Sure, well you’ll be getting some bars to it?\"\n\nRead out in the field \"The Gold Tree\", a dainty little essay of colour and quiet.\n","63":"\n\n172.\n\nSoon the old pleasure of writing here will go, days tied to tracing boards – drafting and printing leave no times for wandering about in the sun, reading and lazing, and you’re as far from the Infantry as you are from Australia, for a while there’ll be no more listening to their wounderful impressionistic tellings of stunts, patrols and the line, no more with half a dozen others bathing, and baking, no days of gold and green.\n\nTonight, I’m wondering on the unit I’ve lost, and\n\nMay 29, 30, 31\n\nwondering if after all I’ll carry on here, for at least a month I’ll be tied \nhere\n then I’ve a vision of the Amb. again. But so far I’ve seen nothing of what \"Maps\" has to offer, only 12 to 14 hours at the board a day.\n\nComing here I was coming to a great experience! I left all adventure behind.\n\nComes the smile – I confess! Homesickness for the old 1st!\n","64":"\n\n173.\n\nOut of the hut for an hour this afternoon, so a bake and a swim: in the adjoining field a long narrow high tree flanked field of buttercups, there’s a good deep pool, a duckboard project as a springboard, and another acts as a climber from the water: others in were a dozen Engineers.\n\nShelling hereabouts early this morning, and D.R.A. shelled out. No casualties.\n\nStill working at the great series of Defence Scheme Maps.\n\nAs reports are of abnormal dumps well strung out along hedges and shell-holes, and of great new dumps growing, so the sooner these maps get to Brigade the better.\n","65":"\n\n174.\n\nBy order of G.S.O. II, today starts new issue of one day a week away from the board, compleat to yourself. A day of lovely sun, sun through a window!!!\n","66":"\n\nD.H.Q.\n\n175.\n\nFor an hour this afternoon in the sun and bathing, the same crowd \nas\n that all afternoon seen, and they for the most part finely built and sunburned, the green by the pool with they baking, wrestling and standing balancing on one another’s shoulders brought suggestion of old Spartan playgrounds.\n\nNo mail up.\n\n176.\n\nThis, from today’s Patrol Report. Summary No. 48, 6 a.m. 31\/ to 6 p.m. 1\/. Daylight Reconnaissance. Pte. Knight of Left Btn. left our post at midday and moved towards enemy post at X. 26 & 25.80 (map ref.). He crawled through a wheat crop to within a few yards of the post, and not observing any movement, he entered the post. Numerous stick bombs were lying about and some equipment and a rifle. A small possy was then examined and found occupied by a German who called out in alarm. He was shot. This aroused the remainder of the sleeping garrison who made for the intruder. Knight waited long enough to shoot the foremost man, then turned and ran out of the trench to the wheat field, and from there fired again at the enemy. Lewis gunners in our posts\n\nJune 1, 2\n\nwho were observing all this, then opened fire on the trench, keeping the Germans down whilst Knight made good his escape.\"\n\nThis a word for word copy. As soon as I’ve the while I’m going through Mac’s file of Patrol and Brigade reports. Knight would be in one of the Btns. of the 3rd Brigade.\n","67":"\n\n177.\n\nWhen Ted was expecting early this morning this was to be his ‘issued’ day, Tom coming in after breakfast turned me out! So a pass for Borre, and a setting out at 9, a day to La Kreule and to Borre, and back to La Kreule for Tea with Harold N. and Toby, so back to D.H.Q.\n\nLast night out for a walk with Ken, we passed an estaminet full of hilarious and fraternising Australian services and French: Ken doesn’t drink, so tonight back towards the same place early, only to find the shutters up and the dull notice tacked to the door, \"No Beer till tomorrow\"! So back to St. Sylvestre Cappel to the swimming pool, and to the hut.\n\nCalled at the Pioneer Transport lines, but Vin away with another section.\n\nMail at La Kreule only the Anzac Bulletin and a letter from Jake. Jake in hosp. somewhere in France, three woundings in the thigh: a note of two pages with a promise of more detailing when he gets to Blighty.\n\nB. Sect. Bearers at Borre, and they with A. Bearers from La Kreule going in tonight to bear for the stunt, 300 casualties are expected.\n\nFrom Willie a photograph of Wilk and himself, long promised since R’Avelsberg .\n\nToday through the A. Div. two of our bearers, new men who I’d only casually known.\n\nBrought back the two books, \"Building Constructions\" and English Cathedrals, & a P.C. from Smiths of Paris notes their sending to England for James Joyce’s \"Exiles\".\n\nTells the word in of the Boche advancing on the Marne! but at La Kreule all the interest is centered on the scandal case being tried in England. Toby adds a name, to the 47,000, Billy Hughes!\n\nPost tonight letter to Mother.\n\nJune 2\n\n178. \n\nFrom \"Anzac Bulletin\", May 17. Another of the \"Time for another retreat\" notes.\n\nMust try another sketch for A.B.\n\nJune 2, 3\n\n179.\n\nA Patrol note ..\n\n12th Btn. Night of","68":" Sgt. Turner & 10 O.R. Object: To raid enemy post located at E11. D.46, and to get identification if possible. Report: Enemy post was scuppered. Three huns killed and machine gun captured. The enemy shewed resistance, and would not surrender, so they were all killed except one man who ran away before the post was rushed. He gave the alarm, and heavy M.G. fire was brought to bear on the party, and reinforcements were seen coming up. Party had not sufficient time to get identification. The M.G. was brought back to our lines. The party reached lines without casualties. Time, 12 midnight. Return 2.45 a.m. Patrol Leader, Sgt. Turner.\n\nJune 3\n\n180.\n\nThe raid at 1 this morning a compleat success: for the area regained – a 500 yds. depth on a small front merely to straighten out part of the line, a big bagging of prisoners and guns. Five Officers and over 230 O.R., 40 Machine guns, a T.M. Battery, and an Anti-Tank gun and its crew, our casualties comparatively light.\n\nToday’s official report of the stunt cold and even quite uninteresting. I’d have given a pound to have heard the tales at the A.D.S.\n\nJune 3, 4\n\n181.\n\nA letter posted to T.B.C. for Venus Pencils, and James Joyce’s \"Portrait of the Artist as a Young Man\".\n\nEarly in the day a wind blew clouds across the skies, and all the day they have been passing and passing the sun. No swimming today and no baking: the pool deserted.\n\nIn the late evening a walk with Ken to St. Marie Cappel, and there in a tiny farmhouse eggs and coffee, Madame a sinister, short and heavy limbed, her sole dressing is a deep print dress and blouse.\n\nToday the Pioneers commence a camouflaging of D.H.Q. Huts, till now half have been half under a battery screen, and the remainder black by the deep hedge have remained innocent of all but rusting paint.\n\nJudging from Aerial photographs, camouflaging – but the most elaborate, is almost useless.\n\nJune 4\n\n182.\n\nToday the winds wasted: a day of cloudy skies and sudden cold passing winds. Mail up from the Amb. Letter from the Commonwealth Bank of £10 standing to my credit, and Francis Edwards’ catalogue of \"Privately printed editions of Old English Authors\", but a cataloguing of books only to be read through: a letter to her acknowledging the receipt, and asking for the more understood book lists.\n\n8 p.m. and of the instant a sudden drumming of gun fire: Meteren way probably on our own front.\n\nPosting away Moore’s \"The Little School\" – George C. going to the Amb. tonight was to take it to Tommy, but in the A.D.M.’s office met Capt. Cato, so he censoring it, post it here.\n\nJune 5\n\n183.\n\n(179)\n\nA raiding party of 1 N.C.O. and 10 men of the Australians crawled to an enemy post E. of Le Paradis and rushed it. The enemy garrison of four men put up a strong resistance: three were killed, the other ran away. Owing to the quick appearance of strong enemy reinforcements and heavy M.G. fire it was impossible to search the bodies for identification, but a M.G. was brought in and our party returned without casualties.\n\nSuch is the official reporting of the Patrol note 179.\n\n184.\n\nTom away to Cassel: a day of little working – of general lazing. Mail, two of Bakers Catalogues but rather disappointing.\n\nJune 6\n\n185.\n\nWhere is the value of a diary when day following day strings endlessly the same routine, the same work, and the same outlook!\n\nA day of sun and massed slow-moving clouds of gleaming white.\n\nNo mail up from the Amb. Greatly looking forward to Alec Waugh’s \"Resentment\" and from Beaumonts Davies \"Rapture\"..\n\nDunsany (Lord): Selections form the Writings of. Cuala Press. 1912. 35s.\n\nTime and the Gods. With 10 illustrations by S.H. Sime. 1st edition. 1906. £2.2s.\n\nTales of Wonder. Illustrated by S.H. Sime. 1st edition. 1916. 15s.\n\nFifty-One Tales. With portrait, 1st edition. 1915. 21s.\n\nThe Gods of Pegana. Illustrated by S.H. Sime. 1st edition. 1905. £:2.10s.\n\nThe Sword of Welleran, and Other Stories. With illustrations by S.H. Sime. 1st edition. 1908. 12s.6d.\n\nBeardsley (Aubrey): The Story of Venus and Tannhauser: A Romantic Novel. 1907. £:3.3s.\n\nThe Eighteen ‘Nineties. By H. Jackson. With illustrations by A. Beardsley, W. Rothenstein, Max Beerbohm, W. Crane and others. 1913. 21s.\n\n186.\n\nThis from the list from Bakers of Birmingham received yesterday.\n\nFrom Beaumonts early this year – while we were at Ravelsberg – the Cuala book I payed","69":" for. In Edinburgh Dunsany’s Plays, 1st ed. 3\/6, Baker lists this at 18\/-. H. Jackson’s \"The Eighteen Nineties\" from Tyrells, about the end of 1913 either 5\/- or 6\/-.\n\nA yarning with George by the pool of Waugh’s \"Loom of Youth\" and as to McKenzie and Mais. Must get hold of something of Mais – in the novel line.\n\nJune 6, 7\n\nDavidson (John). A full and true account of the wonderful mission of Earl Lavender, which lasted one night and one day, with a History of the Pursuit of Earl Lavender and Lord Brumm by Mrs. Scamler and Maud Emblem, with frontispiece by Aubrey Beardsley, 1st Edit. cr. 8vo, cloth, scarce, 18s., 1895.\n\nFrom the old S.H. shop of the Arcade from Castlereagh to Elizabeth St., either 1\/- or 2\/-. J. Davidson’s Plays with the Titlepage and Cover of Beardsley must get hold of.\n\n187.\n\nWriting tonight for Symons \"William Blake\" – 6\/- and \"The Elizabethan Playhouse\", two vols. 15\/-, to Bakers.\n\nTonight I’ll read \"The Eve of St. Agnes\".\n","70":"\n\n188.\n\nAt 7.30 this morning a coup by the 5th Btn. At 7.30 Corp. Schwab and another chap went out and surprised two Boche who had repaired to a quiet spot by their post for a rest, they were quietly awakened, and brought in, then followed the close sequel. Serg. Thompson with two others on information received from the two prisoners, went out, surprised a post of 9 men: they surrendered themselves and their L.M.G. and passively followed to our trench.\n\nMust watch for their individual Patrol reports that will be in tomorrow.\n","71":" 7, 8\n\n189.\n\nMail up. Art Kinsons \"Catalogue of Rare and Interesting Books in all Departments of Literature from valuable Libraries recently dispersed\", but in all its 38 double columned lists, not a book to covet.\n\nTonight to the Farmhouse Ken mentioned as serving Eggs and Chips, but only eggs. There a French encampment about, and officers messing in the Farmhouse: a bonser little snack served up by Madame – a ruddy Flemish Madame of thick wrists, and afterwards Rhum and Coffee with the Froggies, so back to D.H.Q. and this entering of today.\n\nPosted to Mrs. H. \"The Gold Tree\".\n\nA day with a leaden haze and a stillness in the air. All the afternoon at C.R.E. taking some prints of one of the 3 Bde. ‘Maps’ Tracings.\n","72":"\n\n190.\n\nFor a walk this evening with Ken: through Sylvestre on the road towards Caestre. All about the main road shell holes and smashed villiage houses: at the Estaminet on the corner where the turn is to Hazebruck, we had coffee – without sugar. Only a young girl, a slenderly modelled girl with tiny breasts, but with an expression of terrible things clouding her white face. She told us they were refugees from Mont des Cats and that they were not going further back till Monday or Tuesday. Mont des Cats is a ruin she told us, and the monastry one big heap of torn timber and stone.\n\nAnd she still had smiles for us, and asked if the coffee was good.\n\n191.\n\nEach morning from Corps and Army summaries it is my work to add to an \"Enemy Dump Map\" notes of the Boche’s new light rails, dumps and Road Screens. It is greatly to be hoped that the prisoners the Boche takes do not give the same amount of information the Boche prisoners we capture do, and from the times I have seen and listened to these interrogating of prisoners, it seems to me that they give their information so readily, being treated as men and not bullied as animals. Comes the memory\n","73":"\n\nof an Officer amongst a batch of wounded Boche we captured at Leusenhof Farm by La Barque last year, he could speak fair English, yet though two of his own people were slowly dying of head wounds, he would have nothing to do with them. And at Hermies the arrogance of two supermen was the amusing episode of a day of long dressing.\n\nNo Mail up again, surely something must shortly turn up!\n\n192.\n\nLater, Mac has come in with a great tale of promotions and moves, and of an Army Corps to be made up entirely of Colonials – Australians, N.Z.s, S. Africans, etc., so it will be good-bye to the damned XV Army – and if we’re a Corps on our own, some credit for our own stunting.\n\nMust keep my ears and eyes well open.\n\nTom tonight procured me a permission paper to do any sketching about the area from June 1 to the end of July. Tomorrow, possibly to Steenvoorde or to Cassel: D.V.\n","74":"\n\n193.\n\nToday out, and a pass for Cassel and Steenvoorde, left G.H.Q. early after breakfast, and a rained-about walking through the fields, towards Steenvoorde. Through Hondeghem, and there for a while, till the church began to fill resting in the cool old building. A scrupulously clean church, white plaster walls, and a corner altar in an apse of three brilliant glassed windows: embroidered banners of scarlet and blue all about the altar and Nave, and crowdings of flowers everywhere. Just to the left in front of the High Altar a temporary affair, and between two great columns of white artificial lilies, a white Madonna, with palely coloured face and hands, and a bright turquoise sash: an immense ecclesiastic golden crown weighed the small head down.\n\nOn to Steenvoorde: and there a city of blind silent houses, smashed building debris and shell pock-marks all about,\n\nJune 9\n\nonly a French soldier and a Tommy picquet there. On to Cassel, and two kilos along the road a lift to the town in a Tommy lorry.\n\nAt Cassel dinner with two 8th Batt. lads and an Artilleryman.\n\nA morning full of a burning sun, but a hazing afternoon, and in the early evening rain, so back early, tired and disappointed with the whole day’s outing.\n\nI often wonder how the seeing of their own womenfold under shell bombardment must affect the French soldier, towards the Hondeghem church passed me an old couple the old wrinkled peasant woman carefully slinging her gas mask, the piquet in Steenvoorde told me the Boche had shelled lately with gas.\n\nSo with the wrecking and creating desolate the bonser old town of Steenvoorde he adds another rose to his skull’s garland.\n\nJune 10\n\n194.\n\nToday clouds in the sky, and heavy raining all the early afternoon: then at 5 a clearing of the clouds, and a sun over a brilliantly clear countryside, out with Ken, to a farmhouse for Eggs and Chips, so on walking and a yarning on the influence of art, of morality and immorality as conceived by the people of no sight. Ken holds the usual view of the nude and the naked – differentiates between them as the nude being expressed only by art, the naked by artfulness, but I think they are the same thing, only the difference is the beauty of the naked body, if it is ugly, it is obscene either nude or naked.\n\nFrom Davis & Oriole D’Annunzio’s \"The Virgins of the rocks\" and note of J. Davidson’s \"Ballads & Songs\", 7\/6, so tonight a writing for it.\n\nStill no mail from the Unit. Today it is two weeks since the arriving of the last T.L.S.\n\nGeorge has Butler’s \"Way of All Flesh\" and Waugh’s \"Loom of Youth\": must borrow later.\n\nJune 10\n\n195.\n\nIn Cassel yesterday bought Phillpott’s \"Old Delabole\", now its finished, a well written tale and of the manner following Thomas Hardy’s, it is a tale of – as Jake would call them, ‘cousin Jacks’, a tale of a slate quarrying district of Northern Cornwall and of the villiage leaders and followers, but the perfection of drawing comes with the detailling of their religion and their life.\n\nSalute to the Dead\n\nIf any ponder in their bitterness,\n\nDoubting the struggle is of little worth\n\nThat robbed them of the dearest thing on earth,\n\nBrooding in desolation and distress\n\nUpon a sorrow no man can assess –\n\nA flaming hope may lighten all their dearth:\n\nThat through these throes shall rise to glorious birth\n\nA ransomed world the centuries shall bless.\n\nSalute the dead! the dead who died so young\n\n(Let each mind lay aside its private pain!),\n\nWho put adventure to the touch, and flung\n\nTheir opening lives abundant life to gain.\n\nSalute the dead! From such seed shall be sprung\n\nRich harvests from the armies of the slain!\n\nTheodore Maynard\n\n4, Ruskin Gardens, Ealing, W.\n\n196.\n\nMail in, his \"Shakespeare to O’Henry\" hailed Maynard as one of the great Georgians: and from the samples of his work – \"The Good Atheist: and \"The Bad Atheist\" he justifies all praise. This from \"The Sunday Times\" of yesterday.\n\n\"Elites\" from Paris should arrive shortly: will keep \"The Virgins of the Rocks\" for next day issued.\n","75":"\n\n197.\n\nToday, the most terrible G. this year! Old resurrecting of cables sent from Cairo. So I’m out of the credit of £4 I was holding to, £1.14.1. Its useless grouting in writing a protest – there’s been a whip around the whole Div. of cable contracted sending from Cairo, and the form in use there plainly stated payment would be from deferred pay, the change though – all to our inconvenience is typical of the whole damned Military. Thank God it will have no strong standing at home \"Apres la Guerre\".\n\nIn future I’ll dodge the Commonwealth Bank in the matter of cables, the Military there, \"for our convenience\" have taken a hand, and forbidden the posting of registered letters to France!\n\nJune 11\n\n198.\n\nAll the afternoon till evening making great semi-prints of the Strazeele Map for the 2nd Brigade. Frank brought across to me at the C.R.E. receipt from T.B.C. and from Beaumonts the third book of his press – \"Deux Raptures\", the book a disappointment: \"Tides\" the\n\nJune 11, 12\n\nfirst book was a beautiful one: \"The Sunken Garden\" the second book was good, but \"Raptures\" is merely \"pretty\", though the poems are good and \"Molly\" is amongst them.\n\nWho will be the next Beaumont Poet: Squires? Bottomley?\n\nJune 12\n\n199.\n\nAt 9 this morning an officer and 4 O.R. of the 4th attempted to raid an enemy post. The post was manned by 20-30 of the enemy who shewed fight. Our party succeeded in killing several – but then had to rapidly retire, followed up by heavy M.G. rifle and bomb fire. Two of the enemy were brought back, but owing to volume of the incoming fire they were both killed in ‘No Mans Land’. There was just time to bring in (follows detailling of meagre identifications and deductions). Papers, identity discs, etc. will be collected form the bodies of the dead Germans at nightfall tonight: then to establish identification.\n\nFrom Today’s intelligence R.\n\n200.\n\nThe only working today, the morning dump map correcting, and a marking of Divisional boundaries in master map. Tom away for the day, so in the afternoon a washing of clothes by the pool, a swim and a sunbake reading \"Old Delabole\". The afternoon hot, amid a crowd of bathers.\n\nSince yesterday afternoon and all today a feeling of dopiness and a heavy headache.\n\nNo Mail up.\n\nJune 13\n\n201.\n\n(a) A sequence …\n\n10 p.m. last night, Cpt. Laughlin on the phone to C.R.A. arranging and confirming time and place of Barrage fire.\n\n\"Zero, 1 ak. emma!\"\n\n(b) A slow waking and sleeping early this morning and a hearing of concerted gunfire.\n\n(c) At 4 a.m. on the phone, Cpt. Laughlin.\n\n\"Can you send down here fifteen of the best of the prisoners? – and the remainder on to the Corps?\"\n\nA bagging of the Boche posts attacked, with casualties numbering 20, and 42 Boche prisoners taken.\n\n202.\n\nMail:\n\nUp from the unit, two Anzac Bulletins, two of June 6’s T.L.S., June \"To-Day\" and from Paris James Joyce’s \"Elixles\" : addressed to D.H.Q. letter from Mrs. H. of June 9.\n\nCut from \"Sydney Mail\": noted there as a \"Battlefield Picture of Northern France\", there’s a great subject for a sketch here – in the manner of Conder.\n","76":"\n\nMrs. H. writes, \"My Betty will be able to take you to see several historical bits of Bristol\" – and I’d carried the idea that both Betty and Cyril were kiddies of somewhere about 14.\n\nLetters written to T.B.C. for first of the three books of \"The Sheldonian Series of Reprints\" and M.T.H. Sadler’s announced book \"The Anchor\" – a sequel following \"Hyssop\" and to Smiths of Paris for Turner’s \"The Dark Fire\".\n\nA slow day dragging the hours.\n\n203.\n\nOverheard in the Engineers Billet …\n\n\"The papers write of the Boche reserves being used up: but by the time his are through, ours will be too, so then we’ll have a peaceful war again!\"\n\n204.\n\nTonight to St. Sylvestre with Ken, to our strawberry garden, but only two berrys ripe. Then back to the pool, reading there awhile June \"To-Day\", to the hut, and George C. coming in after 5 minutes yarning a remembering of the beer farmhouse opposite so a wayfaring there and over glasses of beer a yarning of Tom and his super-conscientiousness.\n\nJune 14\n\n205.\n\nTom, this morning early,\n\n\"The Boche attacked last night – early this morning –\n\nInterrupting: Ken –\n\n\"Did he do any good?\"\n\nTom, continuing,\n\n\"An we took 9 prisoners and two Machine Guns\".\n\nToday’s intelligence reports it – a heavy barrage at 2.50, and a raiding party of 100 Boche: their casualties heavy: ours light.\n\n206.\n\nStill misty clouds all across the skies and a pallid silver sun, heavy shelling of St. Sylvestre and Hondeghem, yesterday’s shelling of Hondeghem the first time, and two barns set afire.\n\nAll the morning and afternoon printing Strazeele Maps for 3rd Bde.: reading the while \"The Virgins of the Rocks\", a book of loveliness and exquisite writing, it is of the school of Verhaeren’s \"The Cloister\" and \"Philip 1\": of Wilde’s Essays and Pater’s \"Imaginary Portraits\".\n\nPayed: drew 40.\n\nNo Mail up.\n\nRumour of a Mail from Home, and an attacking by Boche tomorrow.\n\nJune 14\n\n207.\n\nBack from evening promenade. The first farmhouse tried for coffee, we knocked and opening the door Madame, a most neatly dressed dame stood with her hands loosely held over her apron, \nstood\n timidly before us, as a poor peasant before a savage master. But she had no coffee, she was a refugee and stemmed by a fear grown tired.\n\nOh the silent terrible mourning of these poor peasants: at the farmhouse across from H.Q. where beer is sold, yesterday afternoon the thin brown woman was sitting hardly holding to herself a round-eyed dog, keening with tears falling her broken deserted home, and today when St. Sylvestre was shelled, across a great field of green-golden buttercups, two black dressed old women hurried slowly.\n\nWhere French troops are billeted, we found a farmhouse, and there black bitter coffee. Madame was old and ghnarled – a brown face of sinister laughing wrinkles – from a long laughter at the\n\nJune 14\n\nfollies she has forgotten. Two full blooded Flemish girls – heavy limbed and long armed – animals hard from long working, and capable of sudden fiery passion, and two golden little kiddies, grubby and laughing-eyed.\n\nLetter posted to Mother, and cuttings from A.B. May 24, 31, of Meteren stunt and stunts of 4th and 3rd by Villers Brettoneaux.\n\nThe 3rd move up from resting to close support, now all things point to an early hard contesting, if only the Left and Right Divisions stand with the","77":"\n\n208.\n\nA reading of Brooke: but a turning to \"Oh love\", they said, \"is King of Kings\" – a sudden seeing again of Val – as she told of Chu Chin Chou – and as our happy interchange of literary likes and dislikes passed. Oh Val tonight I’m hungry to see you again, to laugh and love and foolishly forget warr and maps. And now happily and freely we’ll never know or meet one another. Val, Val, why did you marry and so soon forget all your grave freedom.\n\n\"- And then you suddenly cried and turned away.\"\n","78":"\n\n\"Until perhaps some day when I’ll need your help and sympathy\", all by heart I know it, and since the night Jake brought it up, full of excitement at a week’s strange ending.\n\nVal, Val the memory of you I love and tonight I’m sad for it, oh what a fool I was.\n","79":"\n\n209.\n\nA long day ended: another morning printing for 1st Bde., and in the afternoon a general clearing of the stock of Maps by a distribution about Division.\n\nMail, direct to H.Q., none from the Ambulance. From Mrs. Howes a letter on black-edged paper, and a snap of Jack. He is buried by Hill 60. From Mother, on a page of Geoff’s \"stud news and notes\", a letter of April 21.\n\nMother myne behind your arguing against my book buying easily I know how you feel and how you’ve wondered to put your advice easily, but Dear when I’m unable to see and hear of books that will be my damnation.\n\nAnd the mail brought books too, from Bakers Symons’ \"William Blake\" and \"The Elizabethean Playhouse\" – two comely volumes well filled.\n","80":"\n\n210.\n\nThe 5th have had another \"Minor operation\" today: at 5 tonight a raid on an out-post and eleven prisoners taken.\n\nPosted away this morning \"Raptures\" and \"Reincarnation\".\n\n211.\n\n\"How can we find?\" how can we rest? how can\n\nWe, being Gods, win joy, or peace being man?\n\nWe the gaunt zanies of a witless fate\n\nWho love the unloving, and the lover hate,\n\nForget, the moment ere the moment slips,\n\nKiss with blind lips that seek beyond the lips\n\nWho want, and know not what we want, and cry,\n\nWith crooked mouths for Heaven, and throw it by.\n\nSo Brooke fills the accounting of a mood.\n","81":"\n\n212.\n\nA pass to St. Omer: so away early. Down through the fields, full of a splendid sun in a ballade blue and heaped cloud sky, walking was perfect and an elation held me all the way till I struck the main road below Cassel, it was only a short while walking, but each step hardened the thighs for a long marching.\n\nJune 16\n\nBy Bavinchove rain filled clouds were low, and for a while it rained heavily, then passed to Cassell, and the sun was a hundred times more beautiful after. Out of a lumbering lorry at Arques, and walking again. Then St. Omer strung across the fields, and church towers clearly grey solidly standing from massed roofs red and grey and purple, \nfull\n and a tremendous sky of white and gleaming blue. It was more exciting than the first seeing of Amiens. Now Amiens is a dead city.\n\nThen a short two hundreds yards of high poplar flanked road, and the outer edge of the city. Streets like Bailleul’s and occasionally narrow, high, steep-roofed old buildings.\n\nIn the cathedral – a walking around about it, and then in through the southern doorways, through the deep high porch, with the strange Judgment carvings above the doorways.\n\nJune 16\n\nMass was being celebrated by a tall green and gold caped Priest at the High Altar – a great all golden altar, with golden candles and golden flames. It is a beautiful Altar, and a beautiful church.\n\nBut St. Omer is a wondering city: her people are silent and they hear always the noise of night planes, and the compacted crashes of hellish bombs, a great many of the houses and shops are blind dead places, and Lorries and ambulance cars make nearly all the traffic.\n\nBack at Cassel at 6, and a tea at the tea shop where they sell all the food control prohibits – pastry, preserved fruits, chocolate and tea.\n\nA slow slow lazying from Cassel to H.Q., reading in a field \"Exiles\" and lying watching the clouds and the sun sinking behind Cassel. Back at H.Q. the two black windows flanking the hut door, were the black eyes of a vicious gloating monster.\n\nNow a half moon, whiter than silver, dazzling in a deep luminous night blue sky, over by Strazeele sudden gold star flashes and silence all about us. Ends a day enjoyed and lived through, of sudden impulses and fresh impressions following one upon the other.\n\n\"Day that I loved, day that I loved, the night is here.\"\n","82":"\n\n213.\n\nFrom T.B.C. notification of Waugh’s \"Resentment\" being available, so wrote for it, also from them six Venus Pencils.\n\nTonight the first of \"The Elizabethan Playhouse\" essays read, interesting and full of facination, must read it well and fully.\n\nWith Andy C. to farmhouse, and a supper of \nEggs\n Chips.\n\nEarly this morning heavy shrapnelling about Sylvestre Cappel.\n","83":"\n\n214.\n\nTalking awhile to Frank D.: Basil is preparing another \"Ghutz\" and wants a back page: so will probably do again last night’s sketch of one of the big windmills by Sylvestre Cappel.\n\nNo mail, and an uninteresting day, further evidence of a coming attack with Hazebrouck as an early objective.\n\nMr. Priestly has gone away for a short rest, and from R.V. Corps a cold cultured Tommy, heavy lidded, wasp-waisted, and the manner of a minor royalty newly elected by a blinded people, has taken his place.\n\n215.\n\nLast night dreamed for second time of late of the Boche bombing us at Bondi, a curious dream of a hundred changes.\n\n216.\n\nRe entry 127 – Tonight I reread it lazing through old entries: it was merely an entry closely following an issue of rum, so I blacked it out.\n\nYears ago in an old exercise I once started a journal of books read, and their personal appeal, going into camp I destroyed part of it, perhaps the whole book, but I forget. But I destroyed it for one entry before others. Coming to the ending of the first of Pater’s \"Imaginary Portraits\", I knew how fully that concluding sentence applied to myself, still it does, but reading it, I wrote a confession of its truth, and a growing desire to surrender fully to the Catholic Church, to put away desire and the world, and to find a silent comeliness and beauty.\n\nNow I am without religion, and I know now it is in her wisdom that Rome will only have compleat surrender, far too personal an attitude is allowed amongst the protestants – it seems even amongst our congregations there is a mutual criticism and an unexpressed wonder at the individual’s belief.\n\nSo I seek my soul’s salvation in Beauty and poetry, and now I am dead if I have not one or the other, and still there comes the desire to have the benediction of Rome, and the peace after the confession.\n\nWould I then be happier? But perhaps that peace would pass, and all quietness too.\n","84":"\n\n217.\n\nTill 8 this evening working on large scale detailing of the Meteren Becque: from photographs and Intelligence, completed, out with Ken, and supper at the Farmhouse below in the valley. French are billeted there, and a fine crowd: they’re a happy company, irrepressible and full of a Rabelaisian humour.\n\nMadame \"put the hard word\" on us for a new pair of Australian Boots: \"I will buy them: I will give you twenty five Francs?\"\n\nRain early in the morning, and all day broken whiles of sun through great clouds and showering rain.\n\nA Boche plane over at the baloon above us: brought down by Hondegem , he and the two observers down together, he nose-diving, they swinging in parachutes, while the show was on, one of three Boche baloons down in flames and coiling smoke over by Meteren way.\n\nJune 20\n\n218.\n\nFrom an American journal in today read of the church of St. Gervais opposite the Hotel de Ville being the scene of the terrible Easter Friday shell burst from the boche Paris guns.\n\nJune 20\n\nSemi-detached cottage residences for seaside letting.\n\n219.\n\nIn theory it appears a great scheme for a good investment, and as a side line from ordinary architecture practices: to commission with a pair of good semi-detached cottages – at some such\n\nJune 20\n\nnew growing suburbs as Maroubra. Must get hold of some details as to laws of property, and theory of loans and mortgage.\n\n220.\n\nAll the day dull, and tonight rain: an hour’s sun in the afternoon brought to the pool the usual engineers.\n\nFrank D. up today for sketch: but it will have to wait over for the July \"Ghutz\". Copy 6 may be out tomorrow.\n\n221.\n\nLater. Back from a long walk in the wounderful colour of the evening with Ken, a walking to the outer fringe of Marie Cappel and there supper of chips, Golden brown chips, served by a girl full of the strange stolid beauty of the Flame, a fine small headed brown cat there – a cat of a pure Egyptian build and manner.\n\n222.\n\nWhen all Patrol Reports come to be collected and edited for publishing, there will be such a collection of such daring episodes that will almost appear as overdone satires of full blooded adventure yarns. These from \"The Times\" of June 18, each day’s report from the Divisional front holds at least some such episode – as a ‘Minor Operation’. Today’s report from the Centre Bttn. adds – \"—he is very nervous during the day, and on several occasions threw bombs into the crops by his post ..\" \"At 12.30 a.m. Lieut. – of the 3rd Bttn. and 8 other ranks left our line to locate enemy forward positions, and to engage enemy patrols. An enemy post from which flares were being fired was located at about x.y.z. Our party rushed the post, but the garrison withdrew before they could be engaged. The post was occupied and consolidated. At 3 a.m. the enemy, supported by flanking fire, and M.G.s made a bombing attack with the object of regaining the post. The enemy was run off.\" These notes in reference to cutting of the over page.\n\nThe camouflage of the trenches of the locality is brilliant. Apparently the trenches wander aimlessly through crops of wheat, hay and clover, and to camouflage their naked earth the crops were planted over the parapets and trenches, now they are dead and yellow in the deep green. The Art of Camouflage! C. Smith.\n\nWar Correspondents’ Headquarters\n\nJune 16\n\nOf three raids reported yesterday, one, which cut out a post to the north-east of Villers-Bretonneux, was performed by a party from a New South Wales battalion, which, unassisted by artillery, defeated the garrison and brought out two prisoners. The whole operation was over in six minutes.\n\nTwo raids near Ville-sur-Ancre were performed by parties from two Victorian battalions. The garrison in the southern end of the two posts, attacked at the entrance to the Morlancourt Gully, deserted their machine-gun and fled into our barrage, being fired on also by a Lewis gun. Six only stayed to fight, and all were killed, as they refused to surrender. In the northern enterprise against a position consisting of three posts, the raid was divided into three parties, one against each post. The right and centre parties killed nine Germans and chased the remainder into the artillery curtain fire, which inflicted heavy losses. The party on the left met with considerable opposition and was forced to kill 13 before the remaining four surrendered. About 20 other enemy dead were seen on the ground killed by artillery fire. The Australian casualties were very small.\n\nLast night, again, the German lines were raided in two places between Villers-Bretonneux and the village of Hamel, north-east thereof. The northern raiding party, from a West Australian battalion, met a large German garrison in a strong pear-shaped trench-redoubt to the west of Hamel village. The raiders divided into two parties and bombed up their way along the forking trenches, while the artillery shattered the farther end of the defence work. The raiders killed about 50 of the enemy and brought in five prisoners and three machine-guns. The southern raid on trenches at the south-end of Vaire Wood was carried out by a party from a Victorian battalion attacking at three points. The garrison at the centre hurriedly fled, but the enemy flanks stayed to fight and suffered heavily. The right Victorian party dashed in upon the enemy on the exact second that the artillery fire was lifted off them. The enemy had no time to man positions, and were unable to offer much opposition. Twelve were killed and nine prisoners were taken here. The centre party found that the garrison which had fled was located in a large dug-out, into which they flung down a bomb. The bomb set the dug-out on fire, and steps had to be taken to dispose of any inhabitants. The attacking party on the left met with a lively rifle and bomb fire from the advanced position before the enemy wire. These positions were promptly rushed and the defenders killed except two, who were taken prisoners, and the machine-gun was captured.\n\nThe enemy casualties in these two raids were heavy, and 16 prisoners and four machine-guns were taken. The prisoners include men of all three regiments of the German division. One German battalion has been unfortunate in its experience. It came up yesterday afternoon to relieve the line battalion. Our aircraft spotted it marching up when far behind the lines, and called down the heavy artillery upon it. As the column, after frequent scattering, got nearer to the ground, observers invoked our field artillery, which also pummelled it. Finally, it had hardly taken its positions in the line last night when the Australians raided it and cut two companies about severely.\n","85":"\n\nUnder the heading \"Some Recent Australian Raids\". F.M. Cutlark in \"The Times\", June 18, Entry 222.\n\nOn the 16th, one of our planes was brought down by Strazeele Station, one of our heavies was firing at the time, and word goes, it was a direct hit from one of its shells.\n\n223.\n\nAn argument today with Tom. Some of our propaganda falling on our own lines was sent up by Brigade. One page of it I happened across, a page of four Baloon photographs of Boche dead – a great collection of dugouts evidently first hit directly, and then sudden salvoes amongst men collected about, a trench after a barrage falling, and outposts after bombing. They were photographs of horrible pieces of warr, as familiar to either side as the sun’s shining, as propaganda they appear even blatant. Considering them as Boche photographs of our own dead: how would they affect us? Only one way: they would arouse a dumb animal fury at their seeing, and on the night that followed the nearer and listening posts – and perhaps the whole immediate opposing trenches would be fiercely attacked. But propaganda of any kind is hardly worth while – that is of course leaflet sheets from planes, their only value is a souvenir one. At Ravelsberg the Boche baloons emptied upon us illustrated journals of collectings of Cambrai booty captured by them in Dec. They would have fetched high prices if they’d been auctioned.\n","86":"\n\n224.\n\nIn the afternoon saw Scott – the Divisional Artist (he’s from the 50th Battn.) with his easel set by the General’s hut, and sketching in the huts of H.Q. Though at first I decided against going across, in the end I walked over, and spent a good yarning with him, his sketch was roughly outlined, and a groundwork of green massed worked in. I think his rough work is full of richness, and his detail is good though his style appears almost impressionistic – after Brangwin. I mentioned the pool in a full sun day, and its bathers: he is waiting for the day.\n\nKen to St. Omer so a walking alone to the Marie Cappel farmhouse for supper, full of Tommies: but I was hungry. Waiting one confidentially leaned over towards me, \"Ohoi Chooum, do ‘e billong to ‘ochi’ company?\" I denied it, denied \"B\" and \"C\" Companies, out of his pocket came an old letter, slowly he read through it, then carefully folded it so that only an address remained, and he handed it across. On it was a name and number – a Wilson of the 30th Bttn., \"My sister met him two years ago, and’ I’m lookin’ fohr heim!\"\n\nLater they were arguing: but they were all arguing on the one side, and each definitely stated our warr hopes, one turned and asked if I thought it would be over this year, and I was outside the pale, one moon-faced youth held awhile his eating of chips and eggs, and pausing reflectively combed with his fork a pale golden moustache.\n\nI went out furious at Tom’s map mania and came back smiling.\n\nHeard Loughlin tell the General that Cutlark was here: so will look out for his accountings from Patrol reports.\n\nNo mail. Eleven days now since writing to Davis & Oriole and 8 to the T.B.C. and Smiths at Paris.\n","87":"\n\n225.\n\nHome mail.\n\nFrom Mother: April 7, and enclosed from Geoff of April 4, and a letter from Betty enclosing five snapshots, of Mother,\n\nJune 22\n\ntwo of herself, and ‘our dog’ and ‘our cat’.\n\nThe cat and dog are not ours, but they practically live with us: the cat is the Henwicks, and the dog belongs to Miss Pockley.\n\nFrom Rev. Barber, a note, ‘I am writing to all the boys in the hope that many of them may be thinking seriously over things and may be inclined to desire to be attached to the old home Church as a full member. This can only be done in profession of faith’, and a duplicate tract – an appreciated creed, with below it a space for a signature.\n\nI’ll not sign it, all these pledges and blatant confession of faith are foreign to my ideas, yet not signing it, Mother will wonder, and Grandma for a while unhappy, so it means double letters and to Barber, fine though he may be in his desires, I’m wondering how I’ll write.\n\n226.\n\nBack from a walk to St. Marie Cappel with Ken, and Scott – the Divvy Artist: he’s interesting and good company. I spoke to him recommending a trip to the Ambulance Billet at La Kreule: today he commenced a small sketch of the loft Billet across the field, and confessing a preference for interiors. I remembered the fine billet at our H.Q., also spoke of the A.D.S. cellar at Borre.\n\nScott talking awhile of our ‘Records’, and the slow manner of their work till lately: but now it seems our collection is full of fine pieces, and well towards bettering the Tommy Records. So I’ll send in to them my two Louis XIV Armentieres engravings.\n\nIn Marie Cappel a full Trumpet and Brass band of one of the French regiments, they played some fine stuff, and the trumpeters, Drummers and instrument players in concerted marches stirring as full Scottish Pipes and Drummers.\n\nSince we’ve been back Hondeghem and about heavily shelled: regularly the shell purrs over, and the loud explosion following ecohes back to the clouds.\n\nToday an aerial photograph squaring and cataloguing for easy reference.\n","88":"\n\n227.\n\nTo St. Omer – to Cassel Station in a French lorry & then the leave train to St. Omer.\n\nA day’s wandering about the town, and an afternoon lazing and half-heartedly sketching of the Cathedral. Back at Cassel for tea – and there bought de Vere Stacpoole’s \"The Lady Killer\", a facinating little novel of the bizarre, read it on the way back, lying in a wheatfield.\n\nBut the most enjoyed hour of the day was the last 500 yards across the closely growing crops to H.Q., the sun had set behind Cassel Hill, and the rich day’s greens of the hill silhouetted against a great screen of more grey – and above it most wounderful blue-greens, looking up to the camp’s line of trees, a faint line of mist crossed them: at first I thought it was my eyes’ mistake, then I saw the ground mists slowly and faintly rising all about and around. The quiet of the fields and the beauty of their sombre colouring, and one of the Boche H.V. guns opened on Steenvoorde.\n\nNo mail: disappointed at not finding Waugh’s book of poetry.\n\nYesterday, Tom the M.S.M.\n\nJune 24\n\n228.\n\nAt 12.30 a.m. a stunt by two platoons each of the 2nd & 3rd: successful, and 11 prisoners and 8 M.Guns taken. On the night of the 22 200 strong the Boche attacked and even though he put down a 45 minutes barrage, he failed to reach our line. This morning’s stunt opens the way to a stunt for Meteren.\n\nNo mail and rain, again this evening to St. Marie Cappel: the French band again for a good and enjoyed hour.\n\nYesterday Scott outlined and commenced a fine sketch of the \"Maps\" Hut, it makes a good subject and in his sketch he’s been splendidly successful.\n\nLaying large scale map of the Divisional Sector.\n\nGood news from the Italian front wires through today.\n","89":"\n\n229.\n\nA Dull day of little jobs, and no mail. Frank up from the Amb. with a proof copy of No. 6 \"Ghutz\" – and a good number: in fact the best of the collection.\n\nJune 26\n\n230.\n\nA good day. Scott in the hut all the day till six, working at his oil-sketch: I am in an official drawing – in the R. Corner at the table opposite Mac. At six away with him (Scott) to La Kreule, to Ambulance Billets, and a happy yarning there with half a dozen - Ellis, Clarrie, Frank D. and others. Nick and Toby with a Baseball Team.\n\nMail there, \"The Portrait of the Artist as a Young Man\" and the 1st Impression of Alec Waugh’s \"Resentment\" – in its 3rd edition.\n\nAlso T.L.S. of June 13, and the damned educational supplement of June 20, write to them tonight.\n\nSketched this morning from a Post Card, a back cover design for Ghutz. So far Basil hasn’t sent me up my copy.\n\nPost away tomorrow \"William Blake\" home.\n\nCalled in at Pioneer Transp. and saw Vin Davis awhile. The same Vin, and the same manner of charm.\n","90":"\n\n231.\n\nBack, by the pool, after a long walk alone, by Hondeghem, to the M.D.S. and on by S.A. Scottish Camp.\n\nComes memory tonight and wondering: lying this afternoon for a while in the sun, a memory came of the men who are dead, and names passed in my mind, and faces of old friends, calling from the old past a hundred happenings. Jackie and the gold and blue of Bondi, and he the leader of a dozen pagans of life. At Woollahra P.S., Jackie was in the band, and from Jack Fraser I’d heard of him, and seeing him, I wanted to know him well, that was in 1906 – or before. Then I came to know Jackie well, and to envy him his passionate live and easy happening living.\n\nJackie is dead: buried by Hill 60.\n\nAnd Gil Homes follows, Bondi again, and Gil fresh from the showers, standing wet in the sun, a myth-paen of the sun and the surf.\n\nGil is dead, in Mesopotamia, and Ernie, and Paddy. Freddy Flowers, and N.H., Norm Reed, and Snowy, Dick Seymour and Mark.\n","91":"\n\nFaces pass and pass, each calls vividly to mind days of the dead years, passes Hansen and a brown-gold tense figure flashes from the high scaffolding to the water.\n\nHansen is dead.\n\nPasses McDoig, he’s at the mess at Ghezireh, reading Mother Arnold as he eats, silent till Jonas comes in, then commences an argument on theology, then at Moussot there were long evenings of book talk, and at Wimereux.\n\nAll these pass in full lustiness and colour, their eyes have sight and their blood is red, none of the grey coldness of death, none of the mud and bloodied kharki, none of their bodies are gashed open, their heads are all clear of wounds. MacDougal’s head was half blown away, and Nix’s and Freddy Flowers: Snowy had his shoulders smashed to bloodied pulp.\n\nAnd as they pass two others pass too: two who have died, Father and Harry: Harry dead ten years and Father one.\n\nJune 28\n\n232.\n\nLast\n At 6 this morning – to direct attention from the R. Flank where the Tommies were making a stunt, the 11th Batt. put up a show, captured 31 prisoners 6 M.G.s and two French Mortars.\n\nLater, by midnight.\n\n233.\n\n\"Talk about funny!\", so Ken serves it telling Tom, but it was an hour of sheer enjoyment – a forgetting of dull happenings, and an appreciation of wine and laughter and an abandoning of all to the hour, along the railway embankment, coming back to the camp from an evening spent lying deep in the grass with the S.African, Scottish at a concert to them by the 9th Divl. Concert party. We met four S.A. roysterers full of wine and song: one was a Canadian, another an Australia, both in the S.A. 4th.\n\nFlares rising and falling arching exquisitively and breaking to splendid white stars: and the embankment’s cut down trees, dark shadows by the side of silvered rails.\n","92":"\n\nFive of us sat down, and drank to \"The Barstards of the World\", and for an hour there was only tellings of stunts, and of happenings when the S.A. join us on the left Flank.\n\nWhat a night: and now back here in a bloody office, where the men of the line are only mechanical figures, peopling our damned detail maps.\n\nGod, my only prayer is this: that the rumour of a Corps, only of Australians and South Africans is the reality to be.\n\nOn Sunday I’ll to Borre, and know the Ambulance for a day again.\n","93":" today ends, but a memory will remain: tonight I have loved men more than things: for a while I forgot self and discontents, and lived in the minute, now back again to the old wonderings, the useless tortures and doubts.\n\nThe S.O.S. has gone up in the night, now the guns are awake.\n\nJune 29\n\nBulletin","94":"\n\nA Melbourne art show:-\n\nThe show of the Australian Arts Club is solid and decorous, except where Norman Lindsay hangs his sections of Girl. Norman is more gleeful than ever in his keyhole confidences. Also his color has become richer and more sensitive to the charms of flesh, and in pictorial description is like the purple vocabulary of a Huysmans or a Wilde. His etchings, \"Don Juan in Hell\" and \"The Lady with a Fan,\" show that he has found another outlet for his pagan fancy. Lionel Lindsay’s performances are mostly in water-color, but he has employed his needle on brother Norman’s visage and ticked off the contours of a well-fed girl. Hans Heysen’s worship for the Australian gum surges in rapturous mixtures of timber and sunlight, but he is just as entertaining when he changes the subject to a ploughman or a hilltop covered with sheep. W.B. McInnes has dyed the landscape olive-green and has covered some of the richest country with a sort of radiant gloom. Nevertheless the combined result is very high and adds extra celebrity to the exhibition. Etcher Sydney Ure Smith is the old taking Ure of wood and drawer of water in his studies of buildings and harborside wharves. W.J. Macnally has found the woodscape erecting itself into a series of triumphal arches, and relies on lavishness of detail to secure economy of effect. All the same, he is an improved colorist and would be a greater success if he took more risks in his choice of views. There is manifest quality in the seaside impressions of Elliott Gruner, but the ordinary bloke will consider that he is lending a new distinction to monotony. And really it looks as if he finds it hard to extricate his meaning from the swirling pigment. John Shirlow is stronger in etching facades than faces, whilst Percy Leason’s art in \"The Farm\" is only colored photography. Albert Collins’s temperament, which is subdued in the achievement of some enjoyable little landscapes, gets out of control in a bilious vision of a lady with a lantern. The Norman Carter panel is a moderately gifted summary of delicate times of day, most arresting in his sketches around the Kurrajong heights. James R. Jackson sprinkles sunlight on a couple of ladies without keeping the eye from wandering elsewhere. G.V.F. Mann’s set of smaller canvases might be memoranda for larger productions, but they are all painted in a convincing manner. Lloyd Rees, J.D. Banks, the two Clints and H.M. Burton fill in the remaining wall space with some modest efforts.\n\n234.\n\nFrom Mother, Leon Gellert’s \"Songs of a Campaign\" with Lindsay’s illustrations, a pair of sox and a note with them from Jessie. After the bad paper, and cheap appearing books of England, this from Angus & Robertsons a book of delight, and a brief hurried reading of a few pages confirms the finenesse of the few read extracts in criticisms.\n\n235.\n\nAll the old defense scheme maps are out of date, new schemes arrive today so there a commencing on new maps.\n\nScotts completed sketch of \"Maps\" disappointing: yet he has the details of the hut and the subject carries its own interest.\n","95":"\n\n236.\n\nOver to the attic where Scott is to see his sketch of \"the Dingbats Retreat\": a good little sketch, far more pleasing than his others. For a while yarning of Rodin and de Chavannes and the Amiens gallery.\n\nThen on to Borre: dinner there with Toby and Nick.\n\nThe old Dressing room a forest of heavy wooden stanchions under the old wooden beams, and new steel girders: the floor above being buried four feet under old cobbles and bricks – brought down from Strazeele.\n\nA sub on night duty again, changing yesterday.\n\nAt midday a sudden opening out of our guns: early this morning a small (12) party of the Boche attacked one of our strong posts: for a while he held a footing in one end of the short trench, but was eventually driven out: again he attacked – 40 or 50 strong: again failure, and again failure with his third attempt, at Borre the guns awakening told of another attack, but it seemed hardly likely that after showing such unexpected enterprise as he had shewn, he would rashly attempt a daylight stunt, it was a destructive shoot on Outtersteene.\n\nThe 3rd Batt. shew genius. Report tells of their shewing on one of their Billet doors a cartoon of General Birdwood reading through Intelligence Files, the calendar shews the year 1926. Turning the summaries, suddenly he comes to one of the 1st Division ..\n\n\"Great scott! I’ve forgotten the First Relief!\"\n\nToday General Walker from the 1st, and General Birdwood from the Corps.\n\n237.\n\nEnds June, and a day of burning sun and sun hazes, out by the pool in the lovely quiet of the evening a demonstrating just ended, of all the Boche night planes, lovely \nbulbs\n dazzling flowers, falling before a great rippling of gleaming sparks and colour.\n\nNothing we do can ever die:\n\nAll that we have seen & heard, \n\nEvery moment we have known,\n\nEvery dream, and deed, & word,\n\nGrowing one with memory\n\nIs embedded in the brain;\n\nOften when we are alone\n\nWe must live it all again:\n\nOften through the dark I see\n\nA puppet stage, a shadow play\n\nAnd phantoms acting wearily\n\nThe tragedies of yesterday:-\n\nAlec Waugh \"Introspections\"\n","96":"\n\n238.\n\nCommences July, and a hot, sun beating silent day, and till this evening on new defense scheme maps of M.G. barrages.\n\nToday I covenant with myself to break away from my mind the feverous accumulations of poison and disease: my sins have been against myself, and they have fed a stranger within myself, lately I have come to know him.\n","97":" I covenant to school my senses, my imagination and my brain, and strangely the most difficult schooling will be my quick irritation at Tom’s maps, windiness, and his anxiety to see always great sheets of details growing before each draftsman.\n\nSo I covenant to clear my body, my mind and my soul, that dying I may look the deed in the face.\n\nChrist God hold this blackness that I may lose it.\n\n239.\n\nPosted to Angus & Robertsons order for two books they’re publishing, \"The Pen Drawings of Norman Lindsay\", 12\/6, and \"The Art of J.J. Hilder\", £2.2.0. A letter to Mother and another commenced.\n\nJuly 1, 2\n\n240.\n\nStill the daylight stunts go on, still the Boche is full of a wondering when our stunt is to take place.\n\nThe 10th follow closely the 5th on the 28th at 6.10 a.m. on a patrol went out and captured a post and a prisoner. They reported other posts nervously manned could be occupied, so tenative excursions proving successful, the whole of the enemy outpost system was attacked and thoroughly \"mopped up\" – with a haul of 35 prisoners, 6 M.G. and 2 T.M. Today the T.M’s captured and their ammunition are still being used from the new line.\n\nJuly 2\n\n241.\n\nAnother splendid sun day, and the pool’s field again full of pagans, this morning before breakfast the General in too.\n\nOn Defense plans.\n\nWith Ken to St. Marie Cappel, but the band away. By the pool reading Keats \"Endymion\" sudden beatings of machine guns above the\n\nJuly 2\n\nclouds the winds brought over, their planes breaking through to the sky patching, disappearing, others following, passing behind again, then suddenly through the violet cloud, a broken plane tumbling over and over, down, down to behind the trees, another nose dived through and kept straight for the trees, a long thousand feet, then slowly recovering bore for home.\n\nLater. Sigs. tell of three planes downed, but wether theirs or ours remains to be seen. Again, on the phone,\n\n\"Oh yes! was it ours then?\"\n\n\"Both dead?\"\n\n\"Um, well we’ll have those photographs tomorrow evening: there’s a plane going up early.\"\n\n\"Good night Major!\"\n\n242.\n\nA reading ended of \"The Portrait of the Artist as a Young Man\". So, and from a long medley of sudden brilliant notes the character of the Artist remains indistinct, he is closely myself in places, in his realisation of sins, destructiveness, and in his compleat religious belief, then again in his he is myself. But in his living and his senses, he is cold where I am afire. I’ll read it again, and follow with \"Exiles\".\n","98":"\n\n243.\n\nTom up to the warr, so a quiet day.\n\nDefense plans completed. Printed off mud press 50 copies of Bapaume Hotel de Ville for July \"Ghutz\" and sent them on to Basil.\n\nTo a long walk with Ken to La Kreule.\n\nAngry skies and coldly clear countryside, the trees blackly green and silent and the yellow wheatfield strangely still.\n\nLater. A letter written to T.B.C. for a sketch book – near 10\" x 8\", and as an afterthought added vol. of Hauptmann’s play – by Seeker, the\n\nJuly 3\n\nfine dull blue bound edition.\n\n244.\n\nAt a Farmhouse coming back coffee with some Ulstermen, their speech freer from exaggeration than the average Tommies, and their expression changing and good, and their complexions burnt finely brown with richness about the cheek bones, one with the build and features of Jake whose voice had the faintest murmur of musick in its rich slowness.\n\nChanges at La Kreule: saw Willie L. and he now B. Sect. Supernumerary: from Frank S. hear of he having Stretcher Bearer’s Heart, if he can persuade Wilk from the Bearers they’ll both go to B. Sect. Will W. be persuaded ? then his love for Willie will be greater love than I thought.\n\nNews today of another Hospital ship sunk: a Canadian ship travelling back from Canada.\n\nAnd Heine, Goethe and Schiller and Wagner were of these peoples!\n\nJuly 3, 4\n\n245.\n\nFrom George borrowed copy of the March Tread for its review of \"The Pen Drawings of Norman Lindsay\". Illustrations for Boccaccio, Rabelais and Casanova not yet published: books of his illustrations include Hugh McCrae’s \"Satyrs\", \"Sunlight\", L.E. Petronius (put at £5.5.0) and Leon Gellert and Francois Villon.\n\nJuly 4\n\n245.\n\nThe first entry of the morning since leaving Borre, but word comes through of the 3rd, 4th and","99":" advancing in the Somme on a 4 mile front and a penetrating to an average depth of 1½ miles. The wire reads,\n\n\"We attacked at 3.10 this morning and captured Hamel, also Vaire and Hamel Wood, A.A.A. We are consolidating, etc. etc. Aust. Corps.\"\n\n246.\n\nA long evening, after a walk alone, spent in an improvised estaminet at St. Sylvestre, with one of G. Staff and a 3rd Batt. man.\n\nToday a home mail, letters to May 12th, and one of Mother’s letters write of Burke’s \"London Lamps\" and J.B. Yeats Letters (Cuala Press), and from T.B.C. T.L.S. of June 27, a dull number.\n\nJuly 4, 5\n\nA good play reviewed, \"The Liberators\" by Srguan Tucic, from The Shakespeare Head Press, 8\/6. Will write to Paris for it, Siegfried Sassoon’s \"Counter-Attack\" circled in Heinemann’s list 2\/6.\n\nGeorge today, \"The Oxford Book of English Verse\" and in it are a number of William Blake’s. Just a glance through it, and I brought away,\n\n\"Summer set lip to earth’s bosom bare,\n\nAnd left the flushed print in a poppy there\".\n\nT.L.S.’s review of \"Resentment: Poems\" of Waugh’s fair and a good summing up of his verse.\n","100":"\n\n247.\n\nA day of no sun, a day of lovely twilight: sitting, the sun richly stained through the curtain of cloud.\n\nAfter tea with Capt. Laughlin to Bde. H.Q.s and a good joy ride about Borre and Caestre. Passed on the Borre road, Blue H. moving up with Sigs.\n\nJuly 5\n\nOn part of an old abandoned line branching from the Caestre main line, an old rust-corroded and shell marked railway engine: its breast door open on its half hinge, facing the road, as a battered shield. Across it, in white chalk,\n\nLeave train.\n\nAnd a mile-stone bears,\n\nHazebrouck, 2.5K.\n\nBailleul, 15 K. and chalked below\n\nSydnes, 40000000K.\n\nNo mail.\n\n248.\n\nRead awhile George’s \"Oxford B. o E.V.\" and find I’ve a hundred feasts ahead. John Donne and Ben Johnson, Wordsworth and all the \"Minors\", Crashaw, Herrick, and Crabbe, and Alice Meynell and Davies, and de la Mare and Johnson and Middleton, all only just tasted, with Flecker and Stephens and Yeats and the minor Irishmen.\n\nLooking forward greatly to Turner’s \"The Dark Fire\" and Cross’s new book with Lindsay’s Illustrations. \n\nBasil ringing up tonight tells of Basil Mac being made L\/Cpl. at the 2nd, must write and gratulate him, he’s to be inundated with notes.\n","101":"\n\n249.\n\nA quiet day.\n\nAddition to 207, Notices, (254),\n\nAcross from us the Sigs. have a small rusted iron bivvy, sheet corrugated iron loosely \nleaned\n hung together, with a chalking across the side –\n\nStorm Troops.\n\nNo Mail: bankrupt of light reading matter.\n\nPosted yesterday Series 11 of \"the Elizabethan Playhouse\" to Aunt Louie.\n\n250.\n\nLate night.\n\nOut alone till after sunset quietly wandering about the fields and the new trench system. From 8 to 10, as the sun slowly dies behind Cassel, when the ground mists slowly start from the fields across the lines of darkling trees, there is a lovely quietness of peace about the world and the only noise will be a faint carrying down the air of a high plane’s machine, a lark’s last lyric, or the music of far away voices. And as the day’s colour leaves the sky for the night, over the low valley from the misting horizon, a great star of white arches above and slowly exquisitively falls, and all around the softly rise and reluctantly fall, and the guns that have been silent suddenly lift, and drown the world’s silence, and in a field ahead, a stiff fan-fountain of earth fills in a clouding of brown and red, and an instant arching shriek ends in a crashing bang.\n","102":"\n\n251.\n\nYesterday to Borre: the morning and early afternoon about through the fields between Caestre and Borre, and a sketching of the \"Leave Train\". On to Borre a wandering about the villiage and the fields by Pradelles. Tea with Nick and Toby, then till 9 with Les and Basil playing: back at H.Q. near 11.\n\nPassing the Ulstermen’s Billet, the farmhouse door opening and closing showed a patching of light, so in for coffee, the only light a yellow flame lamp on the long table by the wall, and the table littered with Champagne bottles, and about the room a dozen of the Camerons celebrating – down from Mont de Cats. \"Such a bloody place that we’re down here for the night risking a court-\n\nJuly 8\n\nmarshall.\"\n\nDeep shadows about the black beamed roof, and along the floor and the walls: a yellow light gilding and shadowing brown burned faces and richly colouring splendid knees. One lad had thick black hair, and its lustre over his forehead reminded me of one of Sautars masks in the Amiens gallery.\n\nNo coffee.\n\n252.\n\nWriting today to British Aust. for Lindsay’s book of Pen Drawings: and current numbers of \"Art in Australia\". Basil shewed me yesterday four specimen plates from the book, also tells of a book of M. Forrest’s verse being on the way from Q.\n\nMail: from T.B.C. of July 5, and invoice for the first three of \"The Sheldonian Series of Reprints\", from Davis and Oriole of July 5, a receipt for payment of the D’Annuzio’s book and note of Davidson’s \"Ballads & Poems\" having been forwarded, also a list of books written for – Housmann’s \"Green Arras\", 7\/6 & Masefield’s \"Gallipoli\", 7\/6, 3\/- less than three other cataloguing prices – viz. 10\/6.\n\nJuly 8\n\n255.\n\nIn the night: a day of home’s January ended – and in rain, all day long a still haze over the world and a sun of hot fire slowly travelling the skies. No movement in the trees or across the fields still unscaped, then a thunder clap, lightning and heavy reluctant rain.\n\nTo Hondeghem and met there some of the Seaforths just from the line, about the country till we found a farmhouse where pale yellow wine was selling.\n\n254.\n\nOn a doorway in Strazelle,\n\nStop! Look!! Listen!!! And Then -- !\n\nAt Borre, across a closed door,\n\nGone to the Races,\n\nand on another\n\nNo women, Free Beer.\n\nOn the church at Borre, a direct hit, this is the second, the first being on the apse of the High Altar.\n\n255.\n\nHigh stunts today by the Btts., in daylight two M.G. positions taken and the crews wiped out, with the bag of 2 M.G.s and prisoners – who tell of vast preparations for a stunt from Hazebrouck to the coast about the middle of July!\n\nJuly 9\n\n256.\n\nThis afternoon at 4 over to the farmhouse for Coffee, in the Kitchen Madame and her man seated unconscious of all but their own selves: reading awhile Waugh’s book of verse, looking up, the man was dozing to sleep, and the woman, leaning listlessly back in an old wicker chair, her right arm holding her head, and the light from the window behind her throwing her face to the shadow made a sad picture.\n\nBut on Friday Beer will arrive from Dunkerque, and Madame will be happy again.\n\nRain again after a morning of wounderful clearness and colour: early not a cloud in the skies blue and the sun’s shadows sharp and cool.\n\nIt is a year today since Father died.\n\nNight.\n\nA long walk to La Kreule alone, all the way through the wet fields: for a while leaving D.H.Q. rain, then a clearing of the skies to pale gleaming satin blue with silver cloud lines. Mail there, Davidson’s \"Ballads, & Songs\".\n\nBuire?\n\nFrom the Somme photographs, A.B. June 28\/18.\n\nJune 10\n\n257.\n\nArrives with midday’s mail, the first three books of Blackalls, \"Sheldonian Series of Reprints\", and three bonser little books that are beautiful. The \"Initiate\" series of Poets is in the same type – the Dolphin Old type – as are the books of \"The Adventurers All Series\".\n\nIn the Sheldonian Series would like to see Hume’s \"Gods in Exile\" and \"The Gardener’s Story\" from Anatole France’s \"The Revolt of the Angels\".\n\nMorning, sun and clear skies: afternoon Clouds, Thunder & Rain. Tonight? Rain!\n\n258.\n\nAt 11.30 last night companies of the 4th and 6th Btts. attacked and advanced the line to a depth of about 300 yds., capturing 6 M.G.s and 19 prisoners.\n\nThe sun setting, broke through the clouds, and across the trees and the fields under a blue grey sky, coloured whitely the trees and fields, \nand\n shadowing deeply away from its light the rain falling the while, catching the light high in the air, and throwing a splendid rainbow across the world by the line, then the cloud over and colour fading.\n\nJuly 11\n\n259.\n\nAnother day of sun changing to rain, and wounderful skies. Working on Borre’s and Pradelles &amp. Rouge Croix D. Areas.\n\nAn hour with George C. down at the A.D.M.S. Hut yarning of \"Erewhon\" and Butler and Shaw, left there \"Francois Villon\" and \"Pericles Address to the Athenians\".\n\nNo Mail.\n\nMidday came down from the line a wire of 39 prisoners being taken, followed an amended message five minutes later of a growing to 70. Tonight it has grown to over 120, and our patrols are still on the warpath. An added note to today’s summary runs.\n\nDesign – not completed for James Gordon Bennett’s monument.\n","103":"\n\nAt 9 this morning four men went out along the Railway Embankment, and brought back with them some 30 or 40 prisoners. They had come into the line last night, and apparently imagined this sector to be a quiet one: this haluscination was immediately exploited by the 1st Bn., and later by the 4th.\n\nAt 2 p.m. the bag included two Company Commanders.\n\nStill the guns are quiet, and they have been all day.\n\n260.\n\nA definition of \"On the grouter\". At 5.30 p.m. L\/Sgt. Lockhart and L\/Cpl. Farrel of 6th Batt. entered a trench, they saw an enemy post which they stealthily approached. When almost on the post they were observed by an N.C.O. who sprang to a M.G.: before the M.G. could be brought into action the post was rushed, and the garrison of eight captured and brought back to our lines. Later the two Machine Guns were brought in, the Heavy M.G. by the","104":" Bn. and the Light by the","105":"\n","106":"\n\n261.\n\nPayed: out in the early evening with Ken to the farmhouse of the woman whose arms are like dwarfed legs, then out to the Farmhouse billet of the Ulstermen for Coffee.\n","107":"\n\nMail, a letter from Aunt Louie, a bonser little personal note of her charm and generosity. \"The Elizabethean Playhouse\" arrived safely – and,\n\n\"We were only saying this week it was a long time since you had sent any books.\"\n\nTomorrow will post away home the two books of James Joyce: and later to Aunt Louie the first of \"The Elizabethean Playhouse\".\n\nStill prisoners are being rounded up, and the A.D.S. report for the last 24 hours shows a nil return of wounded passing through.\n\n262.\n\nThis from Borre,\n\nLes Membres de la 1 Ambulance Australieme out beaucoup plaisir in demandant l’attendance de le Frank Molony, au Reception de Bal Artistique et Diner a la maison Quatre Filles d’Amour, Rue a Hazebrouck a six heures en sou","108":" 1918, R.S.V.P.\n\nBought tonight P.O. for 8\/- for Davis & Oriole, but on consideration will wait till posting till the two books of July 8 arrive.\n","109":"\n\n263.\n\nPasting from Anzac Bulletin: to supplement pastings 86, 178 and the cover of Ghutz No. 4.\n\nA day of ordinary workings, but for once, an altering and bringing to date the G.O.C.’s map: usually Mac’s job, but he’s away.\n\nStill the usual patrols, and more prisoners today.\n\nNo Mail.\n\nMadame opposite charges 5’ for her beer, so a boycott!\n","110":"\n\n264.\n\nYesterday to Cassel. In the evening met one of the M.G. men and we spent till 9 drinking with some , a good night and enjoyed.\n\nThe Boche attack has developed again – on a 50 mile front about Rheims, midday.\n\nJuly 16\n\n265.\n\nMidday: to the west of Rheims the Americans have counter-attacked and taken 600 prisoners, taken till today, the third stunt of the Boche has not been any definite success: the French are well holding him.\n\nJuly 16\n\n266.\n\nYesterday afternoon from H.Q. at 4 to Borre, and an arriving here again this morning at 10. Tom cold to freeziness, and only my getting in first word held his anger from breaking. Without expression, he held up his hand, \"You might have arrived here before 9!\" So I held my explanation.\n\nA good night at Borre, only blue Herring missing from the reunion. Mother served up to 13 of us a dinner of 8 courses. Beers, wine, champagne and an improvised liquer – of Brandy, pepper, cloves and other stuffs. Dancing till past midnight so slept there.\n\nAt 5 Len pulled me out of bed – \"to come and have a look at the storm brewing and the colour of the skies\", a sky of darkling green and veiled flashings of pale summer lightning, the rain in torrents – a flooding of the road, and rushing water all about.\n\nBobby at La Kreule going to Borre loaned me the May, June \"Poetry Review\". Basil sending down as soon as read Balzac’s \"Tragedy of a Genius\".\n\nJuly 16\n\n267.\n\nNight, a muggy terrible day – the iron hut an oven, and all day working.\n\nAll the morning and the afternoon, the pool and splashing bathers and sun bakers: in the evening, with a half moon pale in a dove blue sky, heavy with great shadowing clouds, the pool still full of bathers, the bodies white in the grey light.\n\nSince 4, and still heavily rumbling, the guns from the line firing sullenly and in concert.\n\nNo Mail: yesterday, the T.B.C. of July 4, the July \"To-Day\" – with a Mais critique of Siegfried Sassoon’s Poetry, & a damning \"End-paper\" in Beaumont’s \"New Paths\", a letter from Gerald – of his going home, and a rather good snapshot, and the Anzac Bulletin – one note today though – from \"Mother\" asking for monies for the Dinner of last night!\n\nAt the Irishman’s Field P.O. cashed for 10-90 the P.O. bought last Friday, payed it to Ken – borrowed for Cassell.\n","111":"\n\n268.\n\nWritten for and posted – Siegfried Sassoon’s \"Counter Attack\", Theodore Maynard’s \"\"Folly\" & J.B. Yeats’ \"Essay: Irish & Amer \", to T.B.C.\n","112":"\n\n269.\n\nAnother sunburning day. At 5 away towards Hondeghem and there with the S.A.s till 9, swimming in their pool, there all the others while yarning to one of them, a splendidly built lad golden brown in the sun, with eyes the colour of copper sulphate, and a face burned and finely freckled. Met again those we were with in the earlier evening of June 28 – the dark Dutchman of the S.A.s – he of the slow lazy smile.\n\nRain again – at 10 p.m. All day long at slow intervals, the booming of the heavies: long distance guns on to the Boche’s dumps about the Lep Valley?\n\nToday two Frenchmen cycle 40 miles to the Estaminet here, to tell their people of the Boche attacking in Flanders on the 18th.\n\nNo Mail!!!\n","113":"\n\nLetters to Billy and Mother posted, and today to Aunt Louie the second series of \"The Elizabethean Playhouse\".\n\nLibrary now – \"Resentment\", \"Songs of a Campaign\", \"English Cathedrals\", \"Building Construction\", Keats & Brooke.\n\n270.\n\n\"One who died\"\n\nEight days suns and rains & troubled nights,\n\nAnd now the grasses slow\n\nAbout your body grow,\n\nQuietly she dreams, remembering your smile,\n\nAnd you lie dead the while.\n\nTo \"Aussy\".\n\nJuly 18\n\n271.\n\nA sky of green hazing to blue: above Cassel one long thin cloud line of deep full blue: the trees of the camp’s field still and of silent loveliness. An hour ago in the pool, and the water still warm from the day’s sun.\n\nMidday brought a wire from the Aisne-Marne front of French successes against the Boche’s attack in force, and tonight another of further advances – 4000 prisoners and the Boche artillery retiring.\n\nToday the guns quiet, the guns firing of yesterday all harassing. No mail.\n\nJuly 19\n\n272.\n\nA day of general successes, the 9th Div. – and the S.A.s leading attacked and won Meteren – capturing 7 officers and 259 O.R. Our Left Brigade quick to follow, and joining the S.A.’s won to their credit, 90 prisoners, 10 M.G. and M.W. And from the Aisne-Marne Front, still word comes of the French advancing and official capture of 6 last night over 14000 prisoners & 200 guns. Midday’s rumour brought the prisoner tally to 17000, and tonight to 22000. But since the confirming to last night, no wire has arrived to the present.\n\nOn Wednesday night at the S.A.s Pool, the yarning was of possible \"Blighties\" on the taking of Meteren: it was the stunt they were drawn for during their last turn in, but unfavourable winds and weather had held the attack, they went in yesterday, and their stunt was today. My hope above all is that ‘Sandy’ will come out when they are relieved.\n\nOur casualties for the day below thirty.\n\nJuly 19\n\n273.\n\nMail – from T.B.C., M.T.H. Sadler’s \"The Anchor\" – a continuing of the Portrait of Laddy McAllister – the continuing from \"Hyssop\".\n\nDown from Liverpool in 1915 – Hyssop I bought at Dymocks, and read in the night at home on leave: and I placed it with McKenzie’s \"Sinister St.\" that I’d read earlier in the year. I’m hungry to read it through – but must ration it to last to the arriving of Hauptmann’s Vol. 1 of Plays, or the return to George from Eric G. of \"The Way of all Flesh\".\n\nInterrogated Boche tell of no offensive – then of the day of their travail the 24. But I’ll back our side, and the Frenchman Foch.\n\n274.\n\nCommences today a fourth \nday\n year of wasted days. But I’ve seen beauty in Egypt, in France and in England and the greater beauty of our Island’s men.\n\nFour tonight of the 1st Batt. – I met them on the rail by the fields, and left them with a memory ful of the Gods of Australia.\n","114":"\n\n275.\n\nMac staying in: and the morning so splendid with sun and colour decided to take today instead of tomorrow. It was to be a day of bonser lazing, of reading and lying in the sun.\n\nBut a pass to St. Omer, dinner there with three Artillerymen and two Emma G’s, back to Cassel, tea and an afternoon in the Y.M.’s Reading Room taking books from their shelves, opening them and reading a line, dipping into old English Reviews and back to the shelves again. Midday saw heavy rain that lasted the afternoon through: then at 5 a wounderful chequering of sunlight and shade over all the tapestried land about Cassel.\n\nPast Bavinchove, a great company of Chinese, stripped to the waist, wearing bright dungaree bloomers & wide hats, working on entrenchments through a field of yellowing wheat, under a golden sun in a blue burning sky.\n\nFrench well advancing; now 18000 prisoners and 300 guns.\n\nJuly 21\n\n276.\n\nA day of vagrant winds, still in the damned 5000 detail of the southern part of the sector.\n\nMail – only a P.C. noting from Smiths of Paris that \"The Dark Fire\" was O.O.P. So tonight writing for McKenzie’s \"Poems\" or \"The Bubble\" O.P. by Willoughby Weaving – with books from Blackwell’s catalogue received last night.\n\nReading \"The Anchor\", but not with the enjoyment of \"Hyssop\", here Sadler does not \nseriously\n take Laddy in himself seriously, rather he attempts aloofness when writing of his real concerns.\n\nWire from the Aisne received midday contained, \"The whole of the 6th French Army are advancing: A.A.A. line now runs …\" Official prisoners to 6 last night number 20000: the Boche claim an equal number of . A quiet day here, and yesterday.\n\nLater. \"The Anchor\" completed: disappointing and not particularly clever, though full of clever affectations. \"Hyssop\" left an impression, \"The Anchor\" is merely an ordinary novel, with a sprinkling of chattered names.\n\nJuly 22\n\n277.\n\nFrom the Corps in the Somme, a map arrives today, of the advance work of each individual Brigade. Tom working on one of the Strazeele sector.\n\nMail: dating their letter July 19, the T.B.C.,\n\nWe thank you for your letters of June 16 and 29 resp. and now beg to hand you an invoice for \"A Book of Saints and Wonders\" ..\n\nAnd the invoice reads the charge – 5\/7. Damn them, they forward an ordinary edition when I’d particularly written for the Cuala Book.\n\nAnd from Davis & Oriole, a P.C.,\n\n\"We are sending you the Masefield and \"Green Arras\" on","115":" as our assistant is on holiday …\"\n\nOver the slackness of the London firms, a yarning on the duckboard by the huts with George of the possibilities of an agency in London for buying for the troops, of the scheme a book agency would form a great section, by a sub of 10 Francs, of decent and readable novels could be forwarded to any of the forces at a rate of one a week: even to the most casual readers this would appeal, and for ordinary buying – extra underclothes or any items – the scheme holds endless possibilities.\n\nFrom G. \"The Way of All Flesh\".\n\n278.\n\n8 p.m. By phone, the telling just in of patrols surrounding Merris, and the day’s two wires, midday and early afternoon from the Aisne-Marne tell of the French, still advancing against terrific fighting.\n\nNow it is quite certain they are towelling the Crown Prince’s armies: still there are the armies of Prince Rupert, possibly the next few days will see them attacking about Ypres, and here.\n\nMap from the Times, July 2, to the taking of Meteren \"by the Scotts\". Blue the line after their advance and our Infantries hunt.\n","116":" paper contains good accounting of the sinking by submarine of the Aust. returning Transport – H.M. Baringo , no lives lost.\n","117":"\n\n279.\n\n10 p.m. Rain, rain pinning on the iron hut through the camouflage, always the rain after our successes, rain that turns the outposts to churned mud holes, and the carry tracks to a sliming place of slithered walking, and for the last hour H.V. shells in and about Sylvestre. Today in there, in one of the low cottages with their high steep roofs, an old man and his woman, they were selling, sunning in the doorway, animals in the warmth.\n\nFlares in the rain: the loveliness of white blossoms on dark water, moon through a haze of falling mist.\n","118":"\n\n280.\n\nAll day the rain: and in the evening, a wind and great lovely clouds of steel blue heavily passing over and over, the air sweet and fresh, and the flat country faintly clear, Cassel and the fields from Marie Cappel full of rich sombre colourings.\n\nA long quick walk with Ken, and at Germains chips and coffee. Germain in an excited mood, the room full of 29th Tommies, Marie too was having a high old time. Germain’s, \"come on with those bloody chips!\" was his least coloured attempt at \"Diggerism\".\n\nWaiting for their coffee there were three of a perfect English beauty: rich lips, clear dark eyes, and a natural fairness burnt by the sun: one was as lovely as the page of the wounderful costume of black and white, in the picture by E. Board of \"Latimer preaching before Edward VI\", (1541).\n","119":"\n\n281.\n\nTonight to H., but a walk of no episode, and only enjoyed for the evening’s coolness and the loveliness of the countryside. Supper from a garden on the way back – young lettuce and small sweet onions.\n\nNews from the Aisne-Marne good, and today’s wire gives us some further ground: the paper – yesterday’s date - mentions an attack with the French of the Australians and Scots, N.E. of Chateau Thierry.\n\nNo Mail today.\n\nJuly 25\n\n282.\n\nArrived from T.B.C. ordinary book of Lady Gregories: I’ll return it. With mail T.L.S. of July 18, and noting by S.J. of the compleat book of Rupert Brooke, with memoir by E.M.: the today’s Chronicle has a column of reviews – and the book is the \"Poetry and Life of R. Brooke\", so a writing to T.B.C. for it, and answering their letter of July 19 – \"in answer to your letters of","120":" and 20 resp.\".\n\nSadler’s The Anchor reviewed of Laddie: \"Mr. Sadler has sketched him only, not painted him, and … a well-written short story could have told us as much about him as does this full length novel\". \n\nAt best it is a poor combination of a good novel, at worst a readable and quiet tale.\n\nMcKenzie’s \"Sylvia Scarlett\" I’m looking forward to: it was the disappointment in \"Guy and Pauline\" that Michael Fane was not in the tale. If \"Sylvia Scarlett\" takes him from Rome, there will be the facinating combination of \"Sinister St.\".\n\nJuly 26\n\n283.\n\nSlow heavy rain.\n\nTo the farmhouse on the flat below, where the madame of the thick short forearms frys chips and eggs. On the way down we covenanted – Ken and myself to fag French together: but now I think I’ll find out some system of working up planing and designs of buildings. I have Mitchell’s Building Construction, and at the beginning of the month promised myself a knowledge of Masonry before July 31, in the meantime I’ve reviewed half a dozen of some sixty pages.\n\nNews from the Aisne of further slight advancing: wire reads of no prisoners. Today, to compleat the map of the areas won by us since the 13 April, a long studying of Patrol Reports. Early in April, amongst a couple of prisoners brought in by patrols, one was lately a schoolmaster.\n\nHis capture in his own words, \"I was in a post by myself, and suddenly heard three rifle grenades pass over my head: they gave me the shudders, I started to put\n","121":"\n\nmy coat on, when lo and behold – three staunch Australians stood before me – and they brought me safely to your lines\".\n\nParcelled for posting – to Mrs. H., Gellert, Waugh and two Sheldonian books. To T.B.C. Lady Gregories \"Book fo Saints and Wonders\" return.\n","122":"\n\n284.\n\nCoffee in the farmhouse five minutes ago compensated for a horrible day.\n\nIn the kitchen no lighting but the stove, and the blue light of the night through the tiny-paned window: two old men, madame, and her mother, each in their corner, all silent. Madame poured coffe out, and sank back in the chair: still silence, and I forgot the day’s disappointments and became one with the quiet. Then a blundering voice outside, and a demand for \"Coffee Madame?\" The usual flat platitudes, then he left and quietness came again.\n\nLeaving Madame gave me the \"good oil\" – the French are coming here, we are shortly leaving.\n","123":"\n\n285.\n\nFrom Davis & Oriole, Masefield’s \"Gallipoli\" and Houseman’s \"Green Arras\": also a bill. In the evening to the Billet by Hondeg.: then back and a listening to two thickset lads of Wales arguing and \"Tearing\" one another over the cleaning of their harness, when they last came out of the line: the bout started on one of them telling me of their ins and outs of the lines. So to the farmhouse: Coffee and quiet. Then I am in my own dream room: ivory, yellowed walls, and cobalt-black curtains, and books, books, and books.\n\nBobby sent up from the Amb. a copy of Conrad’s \"Typhoon\" and Lethaby’s \"Architecture\".\n\nTonight a small notebook of Construction notes commenced.\n\nIn the Aisne Marne war, the French cavalry are in, and ground is still being won.\n\nJuly 29\n\n286.\n\nMidday. A pale sun without rays and a leaden haze of pale light. The pool: the pool.\n\n287.\n\nAndy C. reading a new Bulletin. I asked what was in the \"Red Page\":\n\n\"A book of Hardy’s\".\n\n\"What do they say about it ?\"\n\n\"Oh, considering his age, they say its pretty good!\"\n","124":"\n\nNight, a sullen day of haze and stillness ended: working on M.G. Dispositions.\n","125":"\n\n288.\n\nToday has been like the last day of the term at school: mid-morning brought word of an early move, and the order to cut down for \nmobile\n transporting.\n\nA hot sun-haze day. \n\nFrom T.B.C. a sketch book: tonight with it to Hondeghem but nothing done.\n\nAt the Farmhouse yarning to some of the Gordons: they tell of a second Etarples \"M.P.\" stunt, at Calais.\n\nTom last night told the tale of our stunt at Hondeg., two months back. Kilts, bare knees, Aussy hats, dust and stoush.\n\nAn Aussy sights the A.P.M.,\n\n\"Have you seen the new star?\" A swing and a mark, \"—well sort it out of those!\"\n\nMerris circled again last night by the 10th and a baging of prisoners and material, 4 officers, 165 O.R., 10 ps. From the noise of the guns, a counter attack.\n","126":"\n\n289.\n\nAfter all our swimming the pool’s kept its cleanness: today the Jocks newly arrived discovered it, and tonight, no swimming. A hundred paddlers and splashers have churned it to muddiness and tangled weeds.\n\nIn the afternoon they kept a long unending stream to its banks and from it, and stripped of their kilts they lost their apparent beauty of build. With kilts well girt and beribboned hose-tops, and tanned knees and faces, they are good to see: but in the sun stripped of their uniforms their beauty is gone. And naked, they are even more modest than the posing Venus de Milo, one wore full bathing costume.\n\nTonight to H.: an hour yarning to two S.A.s: they in clink awaiting D.C.M., for desertion. One, in his short kilt knickers and loose open shirt, a lad of fine black haired bronze, and full of splendid movement.\n\nJuly 31\n\nThe guns again, a cold night after a sun hot day. Most of gear parked and ready: posted to Mrs. H. the book of Villon and Masefield’s Gallipoli, Keats in a tube with a roll of Tracing liner, the old maps of Armentieres, the centre of a roll of drawing paper.\n\nToday’s work: the morning map list for G. Officer, enemy dump and supply maps corrected to date, and a legend for the sten man.\n\n290.\n\nJim brought down from Borre, his last sketches. Three large canvasses, one of the O.P. of the O.P. Billet, and an episode of the 1st Btn. stunt by the railway, and a bonser little colour sketch of the full morning sun on the Pradelles church tower, and an estaminet alongside and passing a group of Infantry, the brilliant colours of the morning, the sun on the shell pocked red brick tower, the roof of the estaminet with its few remaining tiles and its bright green window shutters and doorway, and the debris and broken ground of the road made a fine little picture!!\n\nAugust\n\n291.\n\nThe sun and his colour. Back to the hut after our last ‘chips’ at Germain’s. Marie told us her sorrow at \"all the Aussies going, I love the Aussies ..\"\n\nAway from Marie Cappel, through the fields of yellow ripe wheat – great patching of pale gold hazed about with the colour of redded brown, and the deep strong green of potato and bean fields, and above a Wedgwood sky, \nand\n edged about the horizon the quiet still trees.\n\nMail – from the Unit – George Moore’s \"The Story Teller’s Holiday\". Pearce gave it me in the fields so I took it across to the pool, and opened it in the shade of one of the willows, half bound in parchment, blue board, hand-made paper, and labelled back, opened the invoice, 2.4.8.!!! Already well started on its reading, and a taking to Moore as a fawn to the sun.\n\nBut now the transport, problems doubly involved.\n","127":"\n\n292.\n\nT.L.S., July 25, a good review of James Joyce’s Exiles ending. Will not the stage society or the Pioneers let us and the author see this play, so that its shortcomings may become apparent to him, and its virtues be brought home to us with their full force? Grant Richards, in his ad. letter quotes a review of Alec Waugh’s Resentment. Robert Lynd writes of him as,\n\n\".. a writer critical, quick of feeling and zestful; but, he cuts the corn while it is still green …\"\n\n- a phrase that seems perfectly one of the aspects of Waugh’s verse.\n\nGood announcements are of two books: an edition deluxe of Beerbohm’s \"The Happy Hypocrite\", and by Rackham a book of Swinburne’s \"Child Poems\".\n\nPrisoner list to today lacks 15 to compleat the 1000 captured since taking as ours their sector.\n\nLater: now from a later addition through the A.P.M.’s list our surplus is 3, 1003. Return them to their units? One of this morning’s prisoners stated over 30 of his crowd were waiting to desert, but our M.G. fire was too heavy for them.\n","128":" 2, 3\n\n293.\n\nAll day the rain. A mail up in the afternoon – Hauptmann’s Plays from T.B.C.\n\nPacked for moving: Hauptmann in the Instrument Box: Moore with the Maps, Dieppe, Lens, Amiens and Abbeville: Cathedrals with a mixed crowd. To read in the train – Balzac’s \"The Tragedy of a Genius\", and R. Brooke. To move in the morning, and a long route-marching with packs up and blankets.\n","129":"\n\nWardrecques\n\n294.\n\nWith the A.P.M. board as a writing desk, out \nside\n in the ground of our quarters. Soft deep grass about, an old yellow brick building, poplars bordering the high wall, and a great splendid chestnut by the shallow Becque through the \ngrounds\n fields behind. A day of silver, and clouds of a wounderful blue: rain as we marched, but light rain, rare rain, that kept sullen heat from the air.\n\nTwo women are here, one who has just spoken to me of \"taubes\" a beautiful dame of near 60, good in her figure, and a Frenchwoman. \nAmongst\n Before the peasants we have been amongst, she stands as an home woman, and sets the mind dreaming and quietly recounting old faces.\n","130":"\n\n295.\n\nMorning to the Ambulance, there dinner with A. Sub., in the afternoon to the Canal, and bathing, with green dark water, straight \nlined\n banked by steep terraced grass banks, \nand\n guarded by tall trees: and a long springboard, and a hundred men bathing.\n\nThe carnival of tonight postponed, tomorrow at 10 to see its commencement.\n\nYesterday a letter – and an account \"941\" from the T.B.C. Brooke’s verse invoice dates July 31.\n\nIn the afternoon from Basil a book of the verse of Miss Forest: its fly-page scribed –\n\n\"Glad the song o’er the land shall flow\n\nBy peaceful farmhouse, and flower tall glades,\n\nBut the bravest thing,\n\n(as all men know,)\n\nWas the way that the song was made.\n\nFrom \"A Song of Peace\", M. Forest, Bulletin, Brisbane,","131":"\n\nAugust 4, 5\n\n296.\n\nOur Billet, the loft of a long barn by the Church, the Div. observers and ‘Maps’. Reading last night, and completed to the beating of the electric light engine, Hauptmann’s \"Vor Sonnenaufgang\" – the first of the plays of Vol. 1. A splendid play, and good reading, its dialogue strangely natural, and the art of the love scene exceptionally good: the conclusion perfect too, and well handled.\n\nAugust 5\n\n297.\n\nThe canal, with the 1st Bde. Carnival in progress by de Chavannes. A morning of grey, a haze of twilight low above the ground.\n\nIn a small house by the station, coffee: refugees from La Motte, and one a girl of 17 – the colour of the sun’s gold in her deep hair, and on her face and boyishly muscled neck and shoulders – drawn after Lord Leighton’s \"Juggling Girl\".\n\nThe relay won by the 4th and some good swimming: 2nd came in a bad fourth.\n","132":" 5, 7\n\n288.\n\nA place made for poetry: by a wide circling pool of bright green tiny-leaved covered water, a splendid tree of branches that bend again to the ground – black branches tracering the live green of their leaves. Another tree, standing sentinel before the main building, a mauve clear trunk, and branches that fantastically twist and turn, and leaves as large, and more gracefully pointed than those of the grape: in yesterday’s sun the colour of the trunk and branches, mauve green and gold dappled. Now in the pale sunned afternoon sheep are grazing about: but the shepherd is \nnot\n by Millet rather by Hassal .\n\nDisappointed at the Rupert Brooke book not arriving.\n\n289. Allonville,","133":"\n\nThe last entry, to compleat to the midnight arrival at Allonville.\n\nYesterday a long day, packs up and away from Wardrecques by 4.30, and in the deep grey of the morning along the wet road to St. Omer.\n\nA long day in the train, twenty of us in a clean cattletruck, so full room for sleeping.\n\nDetraining in the early evening, clear skies, sun and roads under the thin Somme mud.\n\nPacks up and away again: once we followed a Tommy’s directions, and lost a mile in the approach direction.\n\nClimbing a great hill by the country lovely in the shadow, the sky by the sun’s setting a flaming cloth of gold.\n\nIn the narrow dark hedged, sunken road by a lorry collected \"Maps\" and a scattering of other staffs, and carried us in: on to the rear H.Q. where we collected papers and gear.\n\nThen till 2 this morning along main roads and bye roads, past the Madelaine, on through dark country, the morning mists, slowing rising and growing.\n\nThen to the Chateau: all the deep\n\nAugust 7\n\ncolour of the skies, glinting with stars, gold in the clear air, and the Chateau and its trees, its broken roof silhouette against the stars, and the vines and plants about its masses, promised some of the unrealised beauty of French old buildings, but this morning, its beauty was gone, and remained only the fine colour of old bricks and stone dressing slowly decaying.\n\nGrounds overrun with deep grass: trees in groups, great splendidly foliaged chestnuts.\n\nA Drafting room under the slates, on the corner tower, from the line the irregular guns beating hollowly and deeply. Tomorrow? All today on its plans.\n\nTonight by the water point met Frank Hungerford: he now, since the first Somme stunt in Corps Sigs. Changed and pale, all his old fine colour is gone: and he is thin and lacking in all his old animalism.\n\nThe telling tonight is of leave increasing. August 9 sending the first lot of twelve a week.\n\nAgain with the dark comes back the old beauty of the place: standing on the steps, in the high doorway, spread in front a broad drive terrain and a great lawn behind: and full fronting the building centre, from the cleaness of the lawn two great chestnuts of black-blue stand sentinel, and behind the long line stretches of darkling green and blue, breaking at the left and right, to far stretchings of misting country: the sides are deep tread, and the soft colourings\n\nof the façade are grey stone and deep fading rose brickwork: the steep tiled roofing carries the fantasy of Tartanaldean .\n\nSo an ending of Diary VI, in a better content from today, being back to the Australian Corps, in a passing Hospital Train yesterday two strange shaped colours seen: the oval of the 3rd and the high colours of the 5th, and tomorrow – tonight commence our first Corps stunt.\n\n"}}