{"Document Name":{"0":"Diary_0315","1":"Diary_0315","2":"Diary_0315","3":"Diary_0315","4":"Diary_0315","5":"Diary_0315","6":"Diary_0315","7":"Diary_0315","8":"Diary_0315","9":"Diary_0315","10":"Diary_0315","11":"Diary_0315","12":"Diary_0315","13":"Diary_0315","14":"Diary_0315","15":"Diary_0315","16":"Diary_0315","17":"Diary_0315","18":"Diary_0315","19":"Diary_0315","20":"Diary_0315","21":"Diary_0315","22":"Diary_0315","23":"Diary_0315","24":"Diary_0315","25":"Diary_0315","26":"Diary_0315","27":"Diary_0315","28":"Diary_0315","29":"Diary_0315","30":"Diary_0315","31":"Diary_0315","32":"Diary_0315","33":"Diary_0315","34":"Diary_0315","35":"Diary_0315","36":"Diary_0315","37":"Diary_0315","38":"Diary_0315","39":"Diary_0315","40":"Diary_0315","41":"Diary_0315","42":"Diary_0315","43":"Diary_0315","44":"Diary_0315","45":"Diary_0315","46":"Diary_0315","47":"Diary_0315","48":"Diary_0315","49":"Diary_0315","50":"Diary_0315","51":"Diary_0315","52":"Diary_0315","53":"Diary_0315","54":"Diary_0315","55":"Diary_0315","56":"Diary_0315","57":"Diary_0315","58":"Diary_0315","59":"Diary_0315","60":"Diary_0315","61":"Diary_0315","62":"Diary_0315","63":"Diary_0315","64":"Diary_0315","65":"Diary_0315","66":"Diary_0315","67":"Diary_0315","68":"Diary_0315","69":"Diary_0315","70":"Diary_0315","71":"Diary_0315","72":"Diary_0315","73":"Diary_0315","74":"Diary_0315","75":"Diary_0315","76":"Diary_0315","77":"Diary_0315","78":"Diary_0315","79":"Diary_0315","80":"Diary_0315","81":"Diary_0315","82":"Diary_0315","83":"Diary_0315","84":"Diary_0315","85":"Diary_0315","86":"Diary_0315","87":"Diary_0315","88":"Diary_0315","89":"Diary_0315","90":"Diary_0315","91":"Diary_0315","92":"Diary_0315","93":"Diary_0315","94":"Diary_0315","95":"Diary_0315","96":"Diary_0315","97":"Diary_0315","98":"Diary_0315","99":"Diary_0315","100":"Diary_0315","101":"Diary_0315","102":"Diary_0315","103":"Diary_0315","104":"Diary_0315","105":"Diary_0315","106":"Diary_0315","107":"Diary_0315","108":"Diary_0315","109":"Diary_0315","110":"Diary_0315","111":"Diary_0315","112":"Diary_0315","113":"Diary_0315","114":"Diary_0315","115":"Diary_0315","116":"Diary_0315","117":"Diary_0315","118":"Diary_0315","119":"Diary_0315","120":"Diary_0315","121":"Diary_0315","122":"Diary_0315","123":"Diary_0315","124":"Diary_0315","125":"Diary_0315","126":"Diary_0315","127":"Diary_0315","128":"Diary_0315","129":"Diary_0315","130":"Diary_0315","131":"Diary_0315","132":"Diary_0315","133":"Diary_0315","134":"Diary_0315","135":"Diary_0315","136":"Diary_0315","137":"Diary_0315","138":"Diary_0315","139":"Diary_0315","140":"Diary_0315","141":"Diary_0315","142":"Diary_0315","143":"Diary_0315","144":"Diary_0315","145":"Diary_0315","146":"Diary_0315","147":"Diary_0315","148":"Diary_0315","149":"Diary_0315","150":"Diary_0315","151":"Diary_0315","152":"Diary_0315","153":"Diary_0315","154":"Diary_0315","155":"Diary_0315","156":"Diary_0315","157":"Diary_0315","158":"Diary_0315","159":"Diary_0315","160":"Diary_0315","161":"Diary_0315","162":"Diary_0315","163":"Diary_0315","164":"Diary_0315","165":"Diary_0315","166":"Diary_0315","167":"Diary_0315","168":"Diary_0315","169":"Diary_0315","170":"Diary_0315","171":"Diary_0315","172":"Diary_0315","173":"Diary_0315","174":"Diary_0315","175":"Diary_0315","176":"Diary_0315","177":"Diary_0315","178":"Diary_0315","179":"Diary_0315","180":"Diary_0315","181":"Diary_0315","182":"Diary_0315","183":"Diary_0315","184":"Diary_0315","185":"Diary_0315","186":"Diary_0315","187":"Diary_0315","188":"Diary_0315","189":"Diary_0315","190":"Diary_0315","191":"Diary_0315","192":"Diary_0315","193":"Diary_0315","194":"Diary_0315","195":"Diary_0315","196":"Diary_0315","197":"Diary_0315","198":"Diary_0315","199":"Diary_0315","200":"Diary_0315","201":"Diary_0315","202":"Diary_0315","203":"Diary_0315","204":"Diary_0315","205":"Diary_0315","206":"Diary_0315","207":"Diary_0315","208":"Diary_0315","209":"Diary_0315","210":"Diary_0315","211":"Diary_0315","212":"Diary_0315","213":"Diary_0315","214":"Diary_0315","215":"Diary_0315","216":"Diary_0315","217":"Diary_0315","218":"Diary_0315","219":"Diary_0315","220":"Diary_0315","221":"Diary_0315","222":"Diary_0315","223":"Diary_0315"},"Date":{"0":"unknown","1":1064.0,"2":1065.0,"3":1071.0,"4":1086.0,"5":1089.0,"6":1092.0,"7":1095.0,"8":1096.0,"9":1097.0,"10":1098.0,"11":1101.0,"12":1106.0,"13":1108.0,"14":1109.0,"15":1110.0,"16":1111.0,"17":1115.0,"18":1116.0,"19":1118.0,"20":1119.0,"21":1123.0,"22":1125.0,"23":1129.0,"24":1131.0,"25":1136.0,"26":1140.0,"27":1143.0,"28":1144.0,"29":1145.0,"30":1148.0,"31":1153.0,"32":1154.0,"33":1158.0,"34":1159.0,"35":1160.0,"36":1161.0,"37":1171.0,"38":1173.0,"39":1182.0,"40":1198.0,"41":1204.0,"42":1209.0,"43":1211.0,"44":1222.0,"45":1224.0,"46":1232.0,"47":1233.0,"48":1234.0,"49":1235.0,"50":1252.0,"51":1259.0,"52":1260.0,"53":1261.0,"54":1265.0,"55":1266.0,"56":1285.0,"57":1286.0,"58":1294.0,"59":1302.0,"60":1307.0,"61":1317.0,"62":1319.0,"63":1323.0,"64":1331.0,"65":1338.0,"66":1342.0,"67":1348.0,"68":1351.0,"69":1364.0,"70":1366.0,"71":1367.0,"72":1368.0,"73":1369.0,"74":1384.0,"75":1385.0,"76":1387.0,"77":1389.0,"78":1391.0,"79":1392.0,"80":1393.0,"81":1395.0,"82":1398.0,"83":1399.0,"84":1400.0,"85":1402.0,"86":1406.0,"87":1419.0,"88":1420.0,"89":1421.0,"90":1425.0,"91":1440.0,"92":1450.0,"93":1451.0,"94":1462.0,"95":1463.0,"96":1468.0,"97":1470.0,"98":1505.0,"99":1513.0,"100":1514.0,"101":1515.0,"102":1519.0,"103":1529.0,"104":1541.0,"105":1546.0,"106":1547.0,"107":1582.0,"108":1599.0,"109":1605.0,"110":1614.0,"111":1619.0,"112":1627.0,"113":1636.0,"114":1639.0,"115":1661.0,"116":1677.0,"117":1678.0,"118":1682.0,"119":1688.0,"120":1689.0,"121":1690.0,"122":1693.0,"123":1697.0,"124":1701.0,"125":1705.0,"126":1715.0,"127":1717.0,"128":1719.0,"129":1721.0,"130":1722.0,"131":1728.0,"132":1729.0,"133":1730.0,"134":1731.0,"135":1732.0,"136":1733.0,"137":1734.0,"138":1735.0,"139":1736.0,"140":1737.0,"141":1738.0,"142":1740.0,"143":1745.0,"144":1751.0,"145":1762.0,"146":1763.0,"147":1768.0,"148":1769.0,"149":1770.0,"150":1771.0,"151":1772.0,"152":1773.0,"153":1774.0,"154":1775.0,"155":1779.0,"156":1785.0,"157":1792.0,"158":1801.0,"159":1808.0,"160":1820.0,"161":1821.0,"162":1822.0,"163":1823.0,"164":1824.0,"165":1825.0,"166":1827.0,"167":1829.0,"168":1845.0,"169":1846.0,"170":1847.0,"171":1848.0,"172":1853.0,"173":1858.0,"174":1863.0,"175":1871.0,"176":1892.0,"177":1896.0,"178":1902.0,"179":1911.0,"180":1915.0,"181":1916.0,"182":1917.0,"183":1923.0,"184":1926.0,"185":1944.0,"186":1967.0,"187":1976.0,"188":1991.0,"189":1992.0,"190":1993.0,"191":1995.0,"192":1999.0,"193":2000.0,"194":2005.0,"195":2016.0,"196":2018.0,"197":2022.0,"198":2034.0,"199":2039.0,"200":2040.0,"201":2041.0,"202":2108.0,"203":2124.0,"204":2130.0,"205":2131.0,"206":2132.0,"207":2133.0,"208":2134.0,"209":2139.0,"210":2140.0,"211":2141.0,"212":2145.0,"213":2146.0,"214":2150.0,"215":2151.0,"216":2154.0,"217":2155.0,"218":2156.0,"219":2171.0,"220":2172.0,"221":2173.0,"222":2179.0,"223":2181.0},"Entry":{"0":"\n\n","1":"\nDuring the early hours of the morning the troops assembled at Moore Park. I myself with reinforcements to the 54th infantry battalion. We were marched to Wooloomooloo wharf to embark on the HMAT \"Suevic. The friends & relations that came to get the last glimpse of their loved ones, before they set sail were stopped at the gates of the wharfes, and a person would not forget the sad & anxious faces one passed,while marching to the boats side. They were allowed on after the troops had all embarked, but too our great dissapointment we were all ordered below to recieve our pay books, but as the boast was leaving its moorings streamers were thrown from the shore, and the ship must have looked well from the shore. The \"Suevic then anchored in the harbour for a few hours, but finally started on the long journey at 12 noon with a calm sea for an introduction for a number of troops on board\n","2":"\nThe sea remained calm. In the morning we all had to attend church parade; but the remainder of the day passed along quite uneventfull. The next two days brought a little excitement for the troops The seas was a little on the rough side whilst passing through the Australian Bight and one could not refrain from laughing at the others misfortunes in the way of falling down the stairs with the troops stew, providing a shower bath on their way & then one would have a meal with the one hand as it required the other to keep the plate from slipping away down the table\n","3":"\nWe were passing Cape Leuen and as it became lost to view I think I can safely say the same thought passed through the boys minds, namely how many of us will have to fortune to see it again. We also had a little news by wireless telling us a little of the war news, and of the coal strike in New South Wales. The latter half of Nov. we were on the sea enroute to Durban, and there is very little happening ofinterest on a troop ship just the daily routine.\n \njust \nThree rough meals & a little physical exercise to keep fit, and the troops can make their own amusement to pass away the evenings, some with cards,others boxing skipping reading etc\n","4":"\nOne of the boys was taken from us during the night and the burial service was performed during the afternoon, and we were astounded whenthe Chaplain told us that eight pound notes had been stolen from under the lads pillow whilst he lay dying. There was a colection made amongst the troops to send to the boys mother but I am not sure of the amount collected.\n\n\n","5":"\nWe were all very pleased to get sight of land again. The coast of Africa could be plainly seen at 8am, and we landed at Durban at tenoc. It being a new experience for most of us we were all very eager to get a look around the town. We had quite a joyfulltime with the blacks, by throwing hot pennies, buckets of water, cooked rabbit and various other articles onto the wharf and put the hose on while they were all in a scramble for pennies. We were taken on a route march, but were dismissed at the Durban town hall and given leave until 11pm. The Y.M.C.A and other charitable institution, treated us very wellinthe way of meals and touring trips, and Durban is a very pretty place at that time of year. It began raining toward evening, but that only damped out clothing, not our spirit as we were only too pleased to have a little spell on land. The rick-shaws were one of the favourites with the boys I expectthe blacks think the Australians rather wild drivers but it is amusing to watch them looking for\n\na fare,prancing & shying around like a young horse. They trot along at a fairly brisk pace, at a charge of 3d permile, and the colored police are on duty at every corner to see they do not overcharge, and another strange thing or at least worthy of note is that a colored person is not allowed to travell in them. We spent the next two days looking around the outskirts of Durban. The Zoological Gardens are well worth a visit.\n","6":"\nOn waking we found ourselves out to sea again, and the sea was a little on the rough side going round the coast to Cape Town, but most of us had our sea legs by that time.\n","7":"\nDuring the morning we sighted Table Mountains. We were allowed ashore in the afternoon, but it did not take long to assure ourselves that it was not as good as Durban, but still during the during our stay I think most of us enjoyed ourselves. We found a number of the people hospitable, but the Australians did not have too good a name in Cape Town. and the people were a little afraid to be too friendly till they found a person to be of good Character.\n","8":"\nI was advised to take a tram ride round the table mountains, and I was rather pleased that I did, as it is a findtrip and a fine view from the top. The tram makes a round trip and one can have a haltat Camps Bay for refreshment and bathing then return by the tram travelling round the seashore back to town,it is really a good afternoons outing.\n\n\n","9":"\nA large boat of African soldiers arrived, some wounded but mostly malaria fever cases, and we were marchedto town to line the main street while they were conveyed to the hospitals. We were promised to be dismissed after the parade, but was marched back to the boat for dinner, it was a bad humoured march back as a number had made friends and accepted invitations to dine.\n","10":"\nWe were informed that we were to spend a couple of weeks at Cape Town, there were all sorts of rumours as tothe reason why but I am now aware of the facts. So the officers found a space suitable for a parade ground, so the troops had to indulge in a little physical and rifle exercises, not forgetting the soldiers friend route marches,but the afternoon we were generally given leave I visited the museum & art gallerie, They have a rather interesting collection & behind the building there is a skeleton of a whale 100 feet in length. The park and avenues surrounding the building looked very well and were kept in good order.\n","11":"\nAnother large boat arrived with more fever cases aboard, but we were not asked to parade.In the afternoon I took the train from Cape Town to have a look at the suburbs, I left the train at wynberg, and was shown the base hospital that they used in the boar war. The park there was at its best little squirrels hoping from tree to tree. The silver leaf avenues looked well with the sun shining on them.\n","12":"\nWe had a little excitement that evening, firstly we were not allowed on shore on account of a band concert on the deck, but the troops got together and broke off and got up into town. Secondly the troops had a riot with the niggers. We were all warned against being in the nigger quarters, but some of the lads found their way there, & were getting into difficulties, when the news got around the streets and things were rather lively for the blacks when the troops arrived in cabs, motors, or any kind of conveyance that could be procured about the streets.\n","13":"\nBeing Christmas eveour leave was extended to 11pm, and the eve is well kept up in the main street \"Adderley St\" The people have a supply of confeti and makes things merry while it lasts. The streets are cleaned again before daylight by means of large hoses, and it is all washed down to the sea,\n","14":"\nMost of the troops had made friends during their stay in C Town, so there were plenty of invitations to Dinner, but I believe those those that stayed on ship were treatedexceptional well for meals that day. I visited the Cape sea side resort namely Muisenberg. It is a fine place for bathing, but fruit refreshments were an extraordinary price. there was an order sent out for all the troops to report\n\n\n\nback to the Suevic by by 10.30 to prepare to sail. so we considered ourselves fortunate to have our Christmas ashore\n","15":"\nWe left the wharf early in the morning, but anchored on the bay to leave the wharfs clear for the transports that left Australia a week after us, there were four in all. When the lads got ashore they hired boats and paid us a visit, a few of the boys got away on the visiting boat, but were brought back by the piquet.\n","16":"\nWe started on our journey at 7.30am, seven transports, five Australian, two New Zealand and the auxiliary cruiser Glasgow , as our escort. The Suevic was the flag ship of the convoy.\n","17":"\nThe food started to alter a lot toward the later half of the journey. we were given sausages for breakfast, but they all went to the fish with a ceremonial parade, one fellow walking in front with an open book, a couple with a dish of sausages, and a party with brooms as reversed arms, the parade halted in front of the officers mess. The acting parson read with a loud solemn voice as they were dropped in thesea. Ashes to Ashes , Dust to Dust, the soldiers cant eat you, So the fishes must, That was a common occurrence with most of the food we were given.\n","18":"\nBeing New Years day the officers tried to make things a little Merry by organizing sports, boxing & concerts.\n","19":"\nWe anchored at St Helena, the place where Napoleon spent him time of exile. It is only a small place, and in the distance just looks like a large rock in the water. We did not get ashore, but had to get water brought out on lighters.\n","20":"\nWe sailed again in the morning, with a boat load of African troops added to the convoy.\n","21":"\nWe crossed the line about one oclock in the morning, so no one felt the bump, as the troops were all too well assleep toplay tricks on travelers.\n","22":"\nWe sighted Sierra Leone about 11 am, and finally dropped anchor at 1pm nearFree Town, but were not allowed on shore there. We anchored there the next three days and provisions were brought to the boat in small steamers. The niggers rowed out with fruit at a very reasonable price, cocoanuts, oranges & bananas, about seven of the lads got ashore on the provision boats, but were brought back later on in the day, and were given seven days in the guard room. The cruiser Glasgow signalled good bye, good luck and left us.\n","23":"\nWe again made a start to reach out destination, the sea was calm, but the heat was fierce it would have been easy to bake an egg on the deck, boards, our whole attire was pair of shorts, and\n\nsomething on our feet, as the deck was too hot for bare feet.\n","24":"\nThe ships gunner was to drop a cask, and have a little gun in practice. Those that were not in the know got rather a shock when the shotwas fired, there was a rush for the deck to see what had happened, the following day our escort cruiser that came with us from Free Town, had a shot & blew the cask to splinters\n","25":"\nWe had to have our church parade in life belts, as we were in the danger zone. from then onward, no one was allowed to sleep on the top deck, no light showing, no cigarettes alight, all port holes closes, & blackened, so the atmosphere was very uncomfortable downthe lower deck\n","26":"\nThere was a great change in the condition of the sea, it was reported that two men were washed off the cruiser, but I am not sure, but I would not have been surprized there was the water was breaking over the bows. The Pt Napier stopped & buried two bodies, then caught up to us again.\n","27":" \nWe entered the English channel it was reported that a man was lostoverboard one ship. The weather was icy cold, and we felt it very much after the tropical weather.\n","28":"\nWe expected to land before night, but for some unknown reason we did not and everyone carried a dissapointed expression, as we had had nothing but biscuits full of weavels for tea, and all blankets and hammocks had been handed in, and one could guess we were eager to get ashore after being eleven weeks & two days doing the trip, but however we laid on the cold deck & made the best of it.\n","29":"\nWe were taken off the boat in ferries the following morning, & was landed at Devenport.The troop trains were there in readiness , and we were entrained without Delay. We travelled by train all day arriving at Dinton after dark, from there we had a five mile march with our pack and the ice was cracking under our feet, the last mile seemed like five itself, as it is hard marching after being on the boat for so long. But we were more satisfied when arriving at Hurdcott Camp, we were given a hot meal & five blankets each, and we could just manage to get warm by getting in pairs with about eight blankets over us, and two underneath The fire bucket filled with water turned out a solid block of ice in the morning, so that was ourintroductionto the Salisbury Plains, Medicall inspection was all that was asked of us the following day.\n","30":"\nWe were taken on a route march in the morning and our feet got very sore & swollen, by the time we got back to camp. Saturday Sunday we were given a spell to give our feet\n\n\n\na chance. The snow fell very heavy all day sunday, and we kept ourselves warm snow fighting. The next two days they drilled us in the snow, and made us strip off most of our clothes to do physical exercises, with a cold wind blowing off the the thawing snow, so drill was not a success that day.\n","31":"\nThe route marching was on the cards again,but quite a number had to stay in camp as their feet was still sore & swollen. The next few days half the company were on sick parade with swollen feet.\n","32":"\nBeing sunday evening a couple of us took a walk to the little village church at Barford, much out of curiosity,& to pass a little time away, but we were rather amused & surprized,to see how old fashioned they were. They were mostly local farmers & real old methodists. The reverend gentleman was dressed quite ordinary with a handkerchief round his neck, navie fashion, and he was preaching how the land lords were sitting on the poor farmer. It would liken one more to a Mothers Meeting than a church service.\n","33":"\nWe were marched to the train at Wilton to proceed on our four days disembarkation leave. it was late by the time we reached\n\nLondon, and had our lecture at Horsferry Road Head Quaters, all one had time to do was look for lodgings.\n","34":" \nI went with a dragparty from the YMCA to all the principal places of London, such as Westminster Abbey, St Marys, Albert Hall , Tower of London, The Royal Stables. The trip cost 4\/- per man, but it was far the best way to see the sights, and we had rather an interesting day. The Albert Hall was beautifull inside all the seats circular except a square center. The Royal Stalls were fine. The Hall was where madam Melba used to sing before Royal parties. The Albert Memorial opposite is well worthy of mention. It represents sculptors of all parts of the world, and it is a great piece of work. The tower of London is very interesting, There they have a full collection of all the old weapons of war, the crown jewels, execution block, prison towers and the tower where the two princessis were murdered, one cannot help but notice the thickness of the stone walls. But what appealed most to me was the visit to the Royal Stables; The horses looked beautifull and groomed to perfection. The coronation carriage is very large and fancy with gold mountings. We finished the evening at the play call the Boy'e which put a good finish to the days outing.\n","35":"\nWe went out to Woolwich to see the damages done by the big explosion at the munition factory, and it was hard to find a sound window within a radius\n\n\n\n of two miles from the spot. The afternoon we spent in looking over the Zoological Gardens there is a good collection on view there.\n","36":"\nWe had a look at the change of guard at Buckingham Palace, It is a sight worth seeing as they are well trained soldiers, and they all move together as one man. After dinner we were advised to see the wax works. There is a fine display of figures, everything looked so real that some of us were taken in by finding ourselves speaking to a wax figure, taking it for a person on duty there, at one entrance to the big hall there is a girl at the door selling tickets done in wax and quite a few walked up to buy a ticket, thinking one has to pay to go in. There is a wax attendant quite handy & some being doubtfull about the ticket make straight for the attendant to ask and of course receive no reply. There was rather some queer sights to be seen in the chamber of horrors, and I am told a large sum of money would be paid to the person that would sleep there of a night. We had to return that night with an officer in charge of the leave train. When We left the train at Wilton, the officer in the lead took the wrong road\n\nfor home, after he got us well lost he let us find our way to camp between then & morning, so from when we left the traintill we reached the camp, we walked about ten mile. The morning found us at physical drill and we were all eager for night fall,to make up for the lost sleep during our leave. The next few days I was away from camp on guard duty at the hospital at Fovant\n","37":"\nWe had a rather exciting night, We were living 34 in a hut there and at 11octhat night half of the number came home much the worse of liquer, and brought some visitors from other huts in the same condition, and it was a battle scene before long. The hut sargent was the desperado of the crowd, He threw a form from one end of the hut to the other, at one fellow but luckily missed his mark, broke two ribs for one other, threw one on top of me in my bunk. They finally quitened down about midnight, but that was a common occurence in those big huts.\n","38":"\nOne of the inmates was a supposed case of Meningitis. So the doctor made his appearance with his swabbing instruments. They kept us in contact for six days, but took us out after the parades had moved off and made us dig up the ground, between the huts for potato growing.\n","39":"\nWe were released from contact and the training thenwas getting a little more advanced, and a great deal more interesting. lectures were given on thedifferent kinds of bombs & explosives, Gas Helmut practice which did not appeal to us, but came in very usefull to us later.\n","40":"\nThe funeral of an Anzac sargent was held at salisbury , there was a great number attended the funeral. He was very popular amongst the boys., He was accidently killed by a passing motor on the Salisbury road near Wilton.\n","41":"\nWe began our shooting test at the range. The snow was falling all day so it was not the best,. We spent four days at the range and it was raining or snowing all the time.\n","42":"\nA party of us hired a car to visit some of the other camps on the plains, and we came back feeling satisfied that we were fortunate in having the best camp, as the other were even to muddy for ducks. All the men had coughs & cold, of course that was the worst winter that england had known for some time.\n","43":"\nWe started on the advanced stages of our training, such as assembling & throwing live bombs and going through the gas chamber to test our helmets, we were give a snif of the different kinds of gases, and a little tear gas in our eyes. The following day were were transferred to a draft company ready for France. We were all eager to get over to see what France was like, and to have a change from the camp.\n","44":"\nI took a trip to Salisbury, but there is nothing much to be seen there excepting the cathedral , and it is very well built the interior looks very well\n","45":"\nWe left Hurdcott to go to the Kings Review at Bulford. It was a three days trip and a rough one, We marched in the rain all that day, and camped in the mud at Roolestone that night, with nothing to eat but cheese & biscuits. The next morning we were up early and marched to the grounds at Bulford. The review was only a matter of the king riding along the front of the column, Which I expect looked well to the crown of onlookers, as there were a good few thousands men engaged in the review. We were asked to cheer as the king rode away, but the men were not in cheering humour. They wanted something to eat, but all was carried for the trip was a very inadequate supply of cheese biscuits & salmon.We camped at Roolestone again that night and started for Hurdcott the next morning. quite a number\n\n\n\nfell out sore footed & tired on the road back to camp\n","46":"\nWe were warned to go to France that night so we had a busy day preparing. We were marched to the station headed by theDept Band. We were given hot cocoa & pudding at the station, and extrained at 10pm. We had a few hours rest and a good hot breakfast at folkestone.\n","47":"\nWe crossed the channell to\n Bollgne Bologne\n Boulogne. It was very cold crossing but the trip was done under two hours, life belts had to be worn onaccount of submarine dangers, arriving at Boulogne we had a big hill to climb, christened and well known by the soldiers as Blanket Hill. as we had our pack and two blankets to carry and I can assure you they felt like six before one reaches the top.\n","48":"\nAs there was a shortage of rail transport, we started about about 10am on a march to the Aust Base at Etaples, a distance of about 20 mile, carrying our pack & blankets, The first seven mile the road was very hilly. We reached the camp at 7pm or at least some of us did others were picked up along the road by lorries etc.\n\n\n\n\n\n\n","49":"\nWe were medically examined and issued with fighting materials. The next fortnight we had to go through another course of training, at what was called the Bull Ring. It was very heavy training in the loose sand, a three mile pack march to & from it,but at times it was an interesting illastrations of liquidfire & gases model trenches etc and they were men from the front that were instructing.\n","50":"\nWe had an early rise, and moved off about seven thirty for the train to Albert, The scenery was very pretty all the way up. The banksof the canals looked very well & we were all pleased to get away from the base. but I must add we were then inexperienced. When the train pulled in at Albert we got our first idea of what war meant. The building ruined with shell fire , we were put in a camp at Becourt just out of Albert to wait till we were wanted in the line, Just below the camp could be seen the charred cross where the germans crucified a scottish officer. We could hear the guns and see the flashes of a night. we waited there till the","51":" we did a little training to keep us fit, but spent quite a lot of time looking round the old trenches, craters & graves which were very numerous not far from a large craterthere was a division of Tommies buried and quite a lot of Australians aboutsome of the battle fields around those parts.\n","52":"\nWe were warned to go up the line & join our battalion. The trip was interesting we went in open trucks on the light railway passing through the shell shattered country to Bapume Posiers included, from there were marched to a village named Vaux. we were supposed to stay the night, but fritz was shelling the villiage so our officers thought it advisable to move back a mile to a trench in an open paddock. A few shells came over but at a safe distance , as far as we were concerned a couple of horses were killed a few hundred yards from us. It was raining fairly heavy, and there was no dry spots and the heavy guns were firing near us, so we did not sleep too well being our first experience, and not used to the noise\n","53":"\nWas a day of waiting, as we were to move on up to the line at dusk, and I could not explain ones feelings going onto action. the first time one does notnot know the real dangers. and it is a novel experience, but it was rather a rough trip on, The battalion had to hold the line in the salient at Bullecourt.\n\nthey had suffered very heavy casualties just before we joined them, as they had had thirteen counter attacks to beat off, We had to stay inthree days but it was fairly quiet during that time, just enough to give us an idea of things. There was only one of our company killed. Drinking water was a precious article, we were lucky if we got a sip each day. There was not a great deal of shelling from either side just enough for us to get to know the different kind of shells and & their power. There was a number of dead bodies about the trenches especially in No mans land - as they could not be buried without loss of life. The trip out was not so bad there was only one incident that could have proved fatal, as we were crossing a small ridge, someone coming the opposite way spoke to our officer & got him to halt us there for a while for some reason or other he dissapeared in the dark and a few seconds afterwardswe started to get a hail ofMac Gun bullets which made us hug the ground very closely, but fortune favoured our own party and no one was hit. We went back as far as Vaux that night, there we had a good hot meal & a sleep which were both appreciated.\n","54":"\nWe moved back to Beauncourt , not far from Bapume .we had a stay there as reserves for the Tommies, that were holding the line onthat sector. There was very little of interest happened during our stay there, a few less shells a day used to go overhead & fall in Bapume, intended for the rail way lines. There we plenty of\n","55":"\n\namusements in the way of football cricket boxing concerts and there was a picture show in Bapume, although still in gun range, The fields were very pretty with buttercups& other flowers, and it was not shell shattered, as the Germans evacuated that portion . Villa las Floss looked very pretty from the distance but on walking through the villiage, one would not find a sound wall but it must have beenexceedingly pretty before it was bombarded, it seemed a shame to see the fruit trees cut down but the germans did that to get better observation of us advancing, perhaps ﻿other motives also We stayed around those parts till the middle of June\n","56":"\nWe left Beauncourt in the morning to entrain at Bapume, to move back into civilization for a three months spell from the action, which the men that hadbeen fighting all along well deserved, of course us reinforcements had to have the spell wether we deserve it or not. While we were waiting to entrain a couple of shell damaged the line, and we hadto wait till evening. a couple of scout planes followed us driven by australian airmen, & they were very clever with their machines, & would swoop down right along the train & shout to us. We detrained at Varenness and Marched to Warloy, we were put in a leafy\n\nbarn swarmed with rats, and did not get any rations till morning, but we made ourselves comfortable and had our sleep.\n","57":"\nWe were given the day to ourselves to get cleaned up and have a look around the villiage. eggs & steak could be bought fairly cheap, milk 3p per qt, so the soldiers made up for lost time while the money lasted, there were a fine lot of cherries & raspberries around our quaters, and we were all liberal to ourselves.There was a wedding held in the villiage church, and their way of getting married was rather curious to us, they just walk arm in arm, and all the relations arm in arm behind them, and when the knot is tied they all go to the nearest \"estaminet\" and have a good old drink up, & sing song. Most of us made friends with the french civilians, and see a little of their ways and how differently they do their work to what we do in australia. Their thrashing machines are worked by a horse stepping on moving steps, and churn their butter by means of dogs in a revolving wheel, Most of the houses are built of mud & straw. The stables in the front of the street, and the house at the back, and the drainage of the stables runs into the street, & lies about, It would turn on off eating to see some of them at meals, it takes a great deal of getting used to, Modesty is out of the question with them,\n\n\n","58":"\nI paid a visit to the church as it was a special day of the year in the church, There is only the one church of France \"Roman Catholic\" But I had a look to see how they had their service. I could not understand it, but the girls & boys all dressed for the occasion looked very well marching in & out the lighted candles. During the afternoon a few of us went to have a look at the aerodrome, and we were surprized at the size of the battle planes when standing along side of them, to what they looked in the air, It is quite easy to spend a few hours sitting watching them rising, & landing. We were not allowed to go up for a ride.\n","59":"\nA party of us had a pass to visit Amiens., It was a fair days outing. The Cathedral being the most interesting building, it is beautifully worked inside but the most valuablepartswere all sandbagged for protection against bombs. The price of food & fruit was very high, very small peaches 5\/- a doz, so the troops did notget sick through eating too many peaches\n","60":"\nWe made anothermove to a place named Beaussart, and spent nine days there, it was a very quiet villiage, but there were, two picture shows at the the next villiage and we could get aplace for a little swimming at a villiagealong the line.\n","61":" \nWe then left for Herrisart a fair days march, our section was billeted at a farm house, so the troops tried their hand at farming, The farms are not fenced off one from the other, and the cattle are all tethered on chains, on the lucern patches the linen crops look very pretty with the sun shining on them, They grow a great quantity of broad beans & dry,plant & all for horse feeding in the winter months,\n","62":"\nThe troops had to do three days marching to go to the river at Corbie, to learn about pontoon work, as they expecting to do a lot of river crossing in the big advance we \nwere\nto make the next time in action,\n","63":"\nWe had a visit from General Birdwood he came & spoke to the boys full of praize &expectations for the future, & also presented medals to the winners when in action at Bullicourt.\n","64":"\nWe left by train in the early hours of the morning & after travelling eleven hours we detrained at Arquex ,then marched a distance of ten kilos to a quiet little villiage by the name of Renescure. The\n\n\n\nbillet given us there was an \"estaminet\" or in English, wine shop, and the owner gave us a barn full of straw to make ourselves comfortable, and the use of the bake house to do our cooking, so we were in the clover that time. There was a good canal, below the villiage so we spent a lot of time in swimming.\n","65":"\nRevielle was sounded at 4am much to the disgust of the troops and we were taken in motor buses tolumbres, each division had to go in turn to go through a course of training to attack the strong posts and pillboxes, the germans had round Ypes The training was pretty heavy mostly sham fighting.\n","66":"\nWe returned to Renescure but had to march a lot of the distance, but was pleased to get back to the old spot and canal.\n","67":"\nA soldier was found drowned in the canal, it was supposed that he walked into it while under the influence of drink.\n","68":"\nThe german planes gave us a visit at night, but did not do any damage the civilians were very afraid if they heard the planes overhead,\n","69":"\nI was interested to see a book showing how the french hospitals notify the parents of the progress of their sons wounds. A flesh coloured photograph is taken of the\n\n\n\nwounds, every two weeks and one can see how the wounds are slowly healing, the particular collection I am speaking off was bound in book form and dated.\n","70":"\nIn the early hours of the morning, there was a big air raid on St Omer which did a fair amount of damage,one shell hitting the 58th General Hospital which killed some of the staff, and a sentry on the gate way. while were were standing on the road watching a shell seemed to come from no where and blew part of the building just in front of us. one of our platoons was billeted there but only one got a slight wound, there was about nine more after that but we could not understand where they were comingfrom, as we wereabout 26 miles behind the nearestfiring line. The following day fritz was over &he dropped one on the the troops parade ground, but luckily it was a dud.\n","71":"\nWe began on our march to the Ypes front, travelling as far as steinboarde that day and camped at a farm house just past the town although very tired we had to have a look round & see what could be had in the town, we procured plenty of tomatoes fruit & eggs to carry us on our journey\n\n19th Sept\nWe proceeded on out march, and crossed the border during the day.We passed a big duck board factory & the girls were\n\n\n\nhard at it with their hammers, & light trucks, We arrived at the","72":" anzac area nearPoperhinge \nthat night,and had a treat in finding places to sleep in, it was a big farm,but all out houses were all occupied with pigs, fowls etc. It seemed strange for people to be living so close to the line, because they were in shellingrange, and there were shells falling in poperinge each day, & the civilians still stayed, on in the villiage. We stayed there in reserve to the 1st &","73":" division for two days the we were to relieve them\n","74":"\nWe left to go forward at seven pm. Its turned to be a rather exciting trip. We had to move after dark for fear of observation. When we got as far as Dickie bush the fun began, a fritz plane came over & set an observation balloon alight, the observer came down safely in his parachute, the balloon a ball of fire of smoke. our search lights caught the plane in their rays. There were about ten lights, plenty of archies & tracer bullets going, and it was a pretty sight &well worth seeing, but Fritz was clever, He pretended he was hit he turned over & over & fell a few hundred feet, then got clear of the lights, afew seconds afterwards the road was bombed, and an ammunitionwaggon took fire, the explosion neary shook us all off\n\nour feet. We slept on holes dug in the ground with canvas covers over the top.\n","75":"\nWe were taken to the support line, & camped in the seven mile tunnell, which the Germans had builtto get his men up to the line in safety & without observation, Fritz was in one end of it & we in the other, from there a party of us were taken to go on gas duty at the Bdg H Quaters at Hooge Crater. There was a little YMCA cocoa stall there but, the shell fire got rather strong & they were obliged to leave& beat a hasty retreat. There were a number of batteries around the crater and we were heavily gassed each night with tear and mustard gas, The tear gas is sent over to hamper the artillery and the mustard gas tocatch anyone sleeping,\n","76":"\nFritz kept the shells going all day,and cause a fair number of casualties about the crater as the crater was situated at the junction of two roads. The road to Ypes. There was a line of lorries & mules destroyed along the road and, ammunition dumps burning.\n","77":" \nWas the day of the hop at the Polygon wood for our battalion ,and it was a grand baragethat fell on the germans line, but I was kept at H Q& did not see the stunt itself. But Fritz made it like a young hell for us behind our own line, trying to stop the transports. I was burying the dead through the day, & on gas duty at night. The Generals\n\n& staff had a 30 ft dugout with three entrances, each of these had blankets (wet) to make the entrances gas proof, once we detected gas in the air or heard the shell, a gas shell makes a lot different sound in its flight than any other shell. There was 150 prisoners brought into the crater during the morning, and the majority of them seemed pleased to be there, a number of them can speak english& they told us that the barage we sent over was awfull to be under, & that we did not know what it was to be in one like that one that they got that day. The following day passed by very quiet untill nightfall & then we got heavily shelled and gassed.\n","78":"\nOne of our aeroplanes had a mishap at a great height, A shell from one of our guns met it & cut both wings off. The body came straight down like a stone, & little pieces of wing took about ten minutes to drift to the ground,The germans planes were flying very low over us and were using their machine guns very freelyalong the roads, one place they shot two stretcher bearers, while carring a wounded soldier to the dressing station.\n","79":"\nWas a pretty rough day for our part of the world, Fritz was hovering pretty low in a scout plane taking photographs then succeeded in getting back over his own lines\n\nand things were very warm for us, The rest of that day, he blew down the wireless station, & absolutely extinguished a couple of batteries & ammunitiondumps, and belted the crater into a different shape , but we did not have heavy casualties.\n","80":"\nI had occasion to go along the road toward Ypes , and it was just a long strip of shell holes splintered waggon & carcasses of mules, & horses, The battalions were relieved about 8am that night, and the party of us on gas duty were relieved at ten, and told to report back to our batt. We asked where our batt have moved too, & all the information we could get was that they were somewhere six miles behind the line. We succeeded in finding them about 1am then lied on the grass till daylight.\n","81":"\nWe were given the day to have a sleep which we all sorely needed as we had very little chance of sleep the previous ten days and we had not washedduring the ten days, as the shell hole water was full of mustard gas, The following day we marched to theanzac area, to have a good rest to prepare to go into Pachendale ,out of seven hundred that went into Polygon Woodstunt only three hundred answered the roll when we came back, but the casualties were mostly wounds.\n","82":"Oct\nSeveral of us look for a walk into Poperhinge & had refreshments, there were quite a number of shops still going although ﻿the town was shelled daily. We got a supply of christmas cards & silks there to send to Australia , but we were very surprized at being able to procure them\n\nthem there & very little dearer than back in the big town, that was our only chance as we were to go back into action on the","83":"\n","84":"\nOur rest that day resulted in fourteen kils route march in soft mud, They would not allow us a whole week without a march.That evening I had a look at an old fashioned flour mill, When the wind is blowing it is worse than a boat at seaup on the top platform where the mill is grinding.\n","85":"\nWe moved our camp a couple of mile nearerthe line to cornwall camp, The batt stayed five days but did very little except a few games football, cricket, etc. by wayof exercises the officers & Padre would join in with us & pass the time away.\n","86":"\nI had been detailed for guardduty, andhadspent the night with the guard, but felt a little off butby the morning, I collapsed & I was taken to hospital finding I had taken a rather sudden attack of trench fever, so I left the batt just as they were to go back into action, I spent the day in the ambulance & waiting for doctors, but got put inbed at the CCS at 11 that night, I was put in an ambulance train at Poperhinge and taken as far as StOmer.\n\n\n\ngeneral hospital. The ambulance trains are very comfortable, and it is rather pleasing to find oneself in clean white clothes, and the sound of the guns gradually becoming fainter. The St Omer hospital was very comfortable, & the staff very attentive. I spent two weeks there and was feeling very contented. two or three nights Fritz was a little aggravating, It is not a pleasant sensation to be lying in bed & hear his planes above but however the hospital remained safe but seven civilians were killeda little lower down the street.\n","87":" \nI had improved in health so the doctor sent me across to England. It took the ambulance train some time to get down to Boulogne but we were carried on to the hospital ship that night, but anchored tillmorning The ship was a Belgium one, named Antwerp & it was very comfortable.\n","88":"\nWe sailed about 10am, The channell was was very rough that day and it affected most of the patients, most of the cases with fever, &gas On arrival at Dover the red cross met us with refreshments, and we were taken to on to Horton War Hospital Epsom Surrey arriving at seven at night, I was very pleased to get settled again as the travelling is a little trying,\n","89":"\nI felt very well & was please to think I wasback over the chanell for awhile. The hospitalwas a very large building contain seven miles of corridors and would accommadate thousands of patients\n\n\n\nthe treatment was very good, no one could complain\n","90":" \nThe Red cross people gave us a visit and supplied us with fruit, biscuits, writing material etc,but as the visitors went out a few more ladies came in the ward collecting off the sick and wounded patient for \"our day collection\" for the wounded soldiers: The hospital staff were indignant about it, No doubt is was a strange place to come collecting.\n","91":"\nI was still in my bed, but a party came to the ward & gave us a very good nights amusements and broke the monotony a little.\n","92":"\nI was allowed up little while after being in bed from the","93":" of Oct, I still remained at the hospital till","94":" I should have spent Christmasthere only word came through that all Australians had to be moved to their own hospital, there was 13 of us to leave out happy home.\n","95":"\nWe went by train to Dartford Hospital, On arrival we were put in the contact quaters for a couple of days then we were transferred to a ward, but I only stayed a day, then asked to be let out.\n\non furlough, The Doctor said I was not strong enough, but consented to let me go. I wanted to be on leave for Christmas, That night there was a picture show atthe hospital, and at the interval vote conscription was screened and it was howled down & counted out.\n","96":"\nI started on my furlough, and I spend four days about London. which did not appeal to me very much, as Londonis too busy a place to spend sick leave &have a rest. One afternoon I paid a visit to Brighton, one of England's seas side places. No doubt it is very nice but they have no the sandy beach that we have in Australia,\n","97":"\nI met my brother in London \nThe\nwho was also on sick furlough. The last we saw of each other was 9 months previous in the base of France, so we spent the remainder of our leave together\n","98":"\nWe left London for Bristol to spend Christmas with some friends.The people there were very good to the Australians very willing to make friends &treat us well. Bristol is a very fine place the suburbs are very pretty, The suspensions bridge is well worth seeing and they have a railway up the cliff quite a novelty, We spend a very good holiday and Christmas day was favored witha perfect day\n","99":"\nMyleave had expired and I had to report to Sutton Veny depot, It was not very pleasing to be back to camp life and hard boards for a bed.\n\n\n","100":" \nAll men returning to camp from sick leave had to be examined by the doctors, and I was marked for light duties which were practically nothing, then we had to be reclassified each week. I was still light duties for the next month, and spent a week in hospital during that time.\n","101":" \nThere was a little excitement at night in the way of a fire. There was a concert hall just below the camp. but the proprietor has take the lads in with poor shows, but this eventfull night he advertised a party that usually gave a good performance, but when they seethe hall they refused to show. It was roughly built of timber &tarpaulins, but was fairly well furnished. However he led the lads to believe the show was to be,and after keeping them waiting some time showeda few pictures that could hardly be seen. The lads demanded their money back but were refused. They then threatenedto pull the place down, but got no satisfaction, there was an old caravan outside. They used at a stage room,so the boys threw petrol over it & set it alight,then pushed it against the building which was soon burning freely, they got the piano out & played a few appropriate songs, Keep the home fires burning. Goodbye etc,. The buglers stood too & blew the last post\n\n\n\n\n\nas the flames were dying down, and the piano was finally thrown on. The villiagers were rather pleased to see the place burnt down out of the villiage.\n","102":"\nI was given four days good conduct leave which I again spent at Bristol, as it was handy from Camp & I had made good friends during my last leave.\n","103":"\nThere was a wedding held at the sutton veny church, that was a little curious. an Australian that was serving time in the camp guard room. applied for leave to be married. He was taken to the church with an a military escort. The ceremony was performed & he was marched back to the guard room.\n","104":"\nWe were allowed to get a weekend road pass and I rode to Bristol sat on returning sunday evening, I met with an accident and was taken to the B Hospital. I remained there for 5 weeks. I received the best of treatment. The Red Cross gave me a visit & taught me basket making, which passed the time away very well.\n","105":" \nAn australian Colonel visited the hospital to see any patients, to get us out as they were trying to get men for france, I said I would soon be fit for camp but the English doctor kept me five weeks & marked me unfit for service with fluid on the knee.\n\n\n","106":" \nThe colonel gave me three days easter leave before discharging me from the hospital. The English hospitals always treated us well.\n","107":"\nI returned to camp and the doctor classified me for three months no duty, and I was send to Hurdcott convalescent camp.\nThe first two weeks I got light duties and then I was put on the digging ground to grow potatoes.\n","108":" \nI was given two days leave to proceed to Weymouth, to see my brother leaving for australia per hospital ship, I stayed a few hours at Poole, & both places are very pretty & fine holiday places.\n","109":"\nBeing Anzac Day there were some very good sports held at the camp, some of the events were a great success & caused a great deal of fun everyone seemed satisfied with the days performances.\n","110":"\nI was again given four days leave so we had no reason to complain on that score. I paid a visit to Weston super mare,another seaside place, and very pretty and the surrounding district looked well as it was all under cultivation,\n","111":" \nOn returning to camp I asked to be send but to France but I had to have dental treatment with kept me eight days.\n","112":"\nI left by train from Wilton, to go to the overseas training camp at Warminster. I remained there a week thenthey called for Machine Gunners, I put in for the schooling &was transferred to Grantham.\n","113":"\nWe had reveille at 4am to proceed to Grantham, It was a fine place for a camp far different to Salisbury Plains. The Camp was situated in a deer park, three mile from town. The town was in bounds and the swimming baths were handy after training.\n","114":"\nWe began our school and found the gun work interesting, especially the target practice. We were also taught the use &differences in the German gun\n","115":"\nMuch to our dissapointmentwe had to move our camp to Salisbury plains, and we were all kept busy packing and carting. The influenza broke out in the new camp and the men were droping about the camp as many as 15 cases in a day from the one camp we spend the remainder of the month in training &shooting test.\n","116":" \nWe had finished our training and was awaiting to be drafted to France, A final leave was granted but only a certain percentage & to men with clean conduct sheets, I was fortunate enough to be one of the number.\n","117":" \nI statedon my leave and spent a little of my time at Swindon, but not very much impressed with the place. I got back to camp on the","118":" and the\n\nfollowing day we had a last days shooting test. then we were innoculated,and waited to go overseas.\n","119":"\nWe formed a small draft and left for France but only proceeded as far as London that night, The Salvation Army institute gave us lodgings and meals.\n","120":"\nWe had a 4am reveille, and went to the Victoria station to entrain for Folkeston. We were given a good breakfast and we embarked at 10am, and had an uneventfulltrip across the channell,then followed the usual climb up the blanket hill to the rest camp, there westayed the night.\n","121":"\nWe entrained for Camiers machine gun base, On arrival we were very dissapointedto learn that we had to spend four days in contact, in case of having any fluegerms with us, but it was only a matter of form as as we could get out and about the place most of us spent over four days at the surf, as we were not far from the coast.\n","122":" \nWe were moved to the training camp, and the first parade we got was a swimming parade. Then we were given plenty of shooting practices which is always interesting with a mac gun &revolver.\n\n\n","123":" \nIn the afternoon there was a base ball match between Americans &Canadians. The Major gave us the afternoon to see the game, but the game did not seem to appeal to the australians, but a man needs to be clever to be an expert at it. The night was more exciting as Fritz gave us a visit and stayed a round quite a time, He did not do any damage round our quarters, but killed forty at the Tommy camp about three mile away near Etaples. There were one hundred casualitiesfor the night,\n","124":"\nI had a days leave to visit Paris Plage, a tram ride from Etaples it is supposed tobe occupied by the Elite of France. It is a very expensive place, The promonade &beach it the best part of it, and that is where Jack Johnson the boxer did his training.\n","125":"\nWe were taken to the shore for swimming parade, and it was very rough and we had a rather good time, but the remainder of the week we were kept busy out on the sand hills, digging gun pits and practicing baragework.\n","126":" \nIt was a sunday but nevertheless the Tommy officers organized a days sports. The Australians won most of theevents but the sport was spoilt with militaryism, piquets all over the place and everywhere was only for officers & nurses.\n\n\n","127":"\nWe had another call from fritz this time bombing the american camp just below us, there was a couple of anti aircraft guns stationed there, but the bombs fell on clear ground.\n","128":" \nThey called for 25 men to go to the second division gunners, and I went with the 25 We travelled in cattle trucks from Etaples to , the soldiers had a very up to date picture show there showing \"the old folks at home\"\n","129":"\nWe travelledon the small anzac railway to Lamottepassing through crops &farms there was a lot of crops destroyed, there was a fine canal to have a dip after the days trip.\n","130":"\nWe were told the the Mac Gun head quaterswas at Villers Breatnaux and to get there as best we could, it was some distance from Lamotte, but we broke off into small parties and got on motor lorries, and met up again at H2, there wewere detailed for seperate companies, and send to them I was sent to the sixth and had to go to , and did a fair amount of walking till I found them in a field outside the villiage, or what was once a fair villiage. The company had just came out for a spell, so we had time to get know a few of the officers &men before going into action.\n","131":"\nThe sectionI was attached to were put on aeroplane guard, as fritz was over to have a look at us each night, as the moon was at its best, During the day the machine gun Batt held swimming sports in the canal.The late Cecil Healy who was then an officer in the","132":" Batt won the 100 yards championship\n","133":"\nThe division was taken forward in motor buses, one hundred in number. We had a fair march after we left the busses, and finished up in a trench minus coverings, not even our overcoats. We rested all the next day, but moved further on that evening, A couple of fellows were firing at german planes with a fritz rifle, they picked up there, The magazine exploded and wounded one of the gunteam in the arm &leg.\n","134":"\nWe started forward to go as supports to A Coy of the","135":" Batt, we were to follow them in the hop over, but there was no opposition the troops advanced through Merricourt wood, but could not locate the german position. The bridges over the Somme River were alight,so we could guess he had retreated to the other side,. so all excepting a a few infantry patrols just waited about till early morning\n","136":"\nThe moppers up found sixty nine Germans & two limberload ofmachine guns in the wood we passed through the night. We moved on again but did not see many germans. There was a stray shell now & again. We crossed the canal on a floating plank, we were then on aslip of ground between\n\nthe canal & the river, The Germans started to shell us &tried to blow our bridge away, but to no effect. There was a row of trees a little ahead of us and a few germans a were seen moving about there and the lads tried their hands with rifles, We stayed at the bank of the canal all night, as the only remaining bridge over the river had been blown away.\n","137":"\nThat next morning we had to move back a couple of mile to cross the river, by a bridge the engineers has rapidly erected, but Fritz had moved back nearer the Mount called Mt St Quinton , well known to most of the diggers. We moved on to a sunken road then waited till day break, as Fritz had pulled up in front of us.\n","138":"\nJust as the day broke the infantry creaponto fritz without the assistance of artillery fire, the gunners had to follow them closely as support if nessasary, We got around him along the river bank and took a few prisoners. There were plenty killed &wounded on both sides, The machine gun fire was rather strong, but only two of our boys got wounded. We got as far as a trench just below the Mount that night, The trench was shelled heavily as we moved up but we to the gun into position for the night.We had moved up a step and \nand\n theenemy\n\nflares were going both sides, so the night watches were not over pleasant. We were fully expecting a counter attack, &if fritz had know how really short of menwe were he very likely would have came over over, The night was fairly cold & the ground was crumbling chalk, and it was hard to make a dug out. The shells falling round would shake it in on top of one. There was a railway crossing just ahead of our position, and the machine gun bullets greeted everyone that tried to cross, most of the casualties happened there. Fritz was above us and he had a stone wall & a wood to hide himself from view, and the german gunners will generally stick to the last & then take their chance, but they generally get killed on sight as there is the knowledge that they are the fellows that have been doing the mischief . The last of the fighting was more machine gun fighting than heavy artillery. The Lewis gun did very good work.\n","139":"\nWe stayed in our position with the gun while the infantry attacked the crest of the hill, and were successful in gaining their objective. While the attack was on Fritz kept a barrage on our own bit of trench, We got well covered with earth but got through safely That night we had to move back for a spell, We had a number of trenches to pass through with our guns & gear and we were glad of a halt, it was too wet & cold for sleep so we waitedabout for day break.\n","140":"\nWe had a better day we received plenty of rations and one of the officers set too & did the cooking to give us a spell, as he had not been in with us all the time -but Fritz would not leave us alone He sent along plenty of gas shells & bombed us & killed &wounded some of the boys, I had to take the OC up the line to look for one of the sections that got lost the previous night, I was tired but Idid not mind the trip over the ground we fought over. I had a chance of taking notice of things of interest, such as his gun positions, &the german dead, The captain was interested to see the positions where we had our guns. We found the sections whereabouts &brought back a bundle of german blankets, to make ourselves comfortable,but then could not sleep without leaving a gas helmet on.\n","141":"\nWe were informed we could spend the daythere, So we got a couple of fritz hand grenades &tried the river for fish, but was not successful as there were too many big shells falling in the river. The next morning we moved back to the wood, we started from. We had a good wash &sleep and that works wonders after a week up the line\n","142":"\nWe marched back another five miles to Cappy, &made ourselves at home in the bank of a big gully. When the cook house bugle sounded\n\nIt put one in mind of a lot of rabbits leaving the burrows, but when we found we would be staying awhilewe built ourselves some good little huts out of timber &iron we gathered from the ruined villiage. We were given a little drill each morning, then we had the afternoon to ourselves. There were plenty of mushrooms &odd vegetables about the deserted gardens so the troops did a little cooking on their own account.,\n","143":"\nA party of us took a walk to have a look at the big gun that had been bombarding Amiens, it was a great size of the barrel 75 feet with 16\" caliber and not far from it a trainload of ammunition had been exploded. \n","144":"\nThere was a divisional sports held and it turned out avery successful day, athleticsracing, the mule races were very exciting, and the hurdle races were well worth while\n","145":"\nWe started to march forward again we started at seven am &halted at 2ocnear Hamel, we had carried our pack &blankets and were weary on arrival.\n","146":" We were allowed to sleep in till 10am then we had to move on without pack or blankets. We only travelled a few mile then camped at a shell shattered villiage. We remained there a couple of days a large number of cavalry passed us, and went forward. thatnight see a good sight over the villiage, they hadthesearchlight on a fritz plane,&one of the ours chacing and firing tracer bullets, Fritz did not retaliate but, made a bee line for home he seemed to be slightly damaged.\n\n\n","147":" \nWe moved on again and camped in trenches in an over field near Bellicourt, just past the canal we passed through the Hindenburg trench system &wire during the day &passed a few captured guns, there was a number of horses lying dead, full teams in some places, There was reported to be a boiling down place in the canal tunnell,and a number of us went to have a look round. It was a horrible sight and after seeing it one could hardly form an opinion of what it really wasthere for, We had to walk over dead bodies with a candle light, There was one in the copper &pieces of human bodies cut with a knife, &bodies on stretchers outside the place, but I believe it was a soup kitchen and a shell got a lot while in there\n","148":" \nWe had a rather disturbed night, we hadlittle positions made for our nights rest and got as comfortable as possible, but we could hear the message of death, the thud of a Fritz plane and he bombed fairly close to us, but he kept returning and dropping closer every time a number left the trench &made for the canal, He came again &shook our little dugout in on top of us, and then let us rest in peace after about midnight.\n","149":" \nJust on dusk that evening we made a move for the line, when we got within a mile of it we had to wait a few hours till morning, the limber came with the guns &we had to unload in the quickest possible time, as we were getting shelled with gas &explosive shells, The limber driver got a piece of shell in the leg while we were unloading, We had to remain in little pot holes fritz has , started the night before, &they were only knee deep The artillery started to pull in to prepare for the morning barrage, and a fritz plane came humming over just as he got over head he dripped and incendiary bomb, which lit up the whole place, We then knew what to expect He dropped right up between the lines of artillery, He then turned &was dropping &coming straight for us, the next few moments were anxious ones, but it dropped a few yards off us but shook us upa little and knocked my steel hat off.\n","150":" \nWe proceeded up to the hop off tape just before six am, as the barage was to commence at six., While we were waiting at the tape the gas was hanging about very heavy, and we had to keep our Helmets on, but as soon as the barage lifted 100 yds, the lads pulled the helmets off put a cigarette in their mouth and started off. there was four of our gun teams to go along with the first wave but two of the teams got caught with our own barage &were all killed or wounded except one man, and he followed up with a gun\n\n\n\n\n\ntripod &two boxes of amunition When Fritz sent his counter barage he misjudged our position and dropped his shells well behind us. so we had a safe distance to follow up the barage. As we were getting over the rise toward the villiage the sun was coming up. and the machine gun bullets were cutting the grass, we creapin short rushes one at the time till we found a position for our gun, there was a short bit oftrench &observation post that fritz had been using, &knew the range of it too well, but we were compelled to use it as a shelter we had no chance of mounting our gun where we were, We also made use of it to lift in a few wounded and for a signal post as it was concreatedat one end, and a wooden look-out at the other, where the wounded were lying waiting till things got a bit better,&the bearers were able to to take them out A large tank was doing good work at the corner of the villiage, but somehow or other the occupants of the tank got a little mixed &played their guns on ourposition, and driving straitfor us &they were dangerously close, before they found they were wrong. It was a very clear day &the scout planes were busy aboveus and the artillery kept up pretty constant all day, one shell came right into the look out &killed &\n\nwounded five out of seven of us, that was in that corner at the time three of the casualties were the 24 Batt boys, & twoof our gun team things in general were anything but pleasant, The Americans were to relieve us at eight that night and were anxiously waiting, We only had three left on the gun &there was was only officer out of six that was not either killed or or wounded, The americans relieved our team at 9pm &we had a very fair trip out as things had quietened down.We made our way back to the old trench near the canal, and the worthy cook had a good hot stew waiting for us which was very acceptable, we rested till morning in a bit of broken trench.\n","151":" \nWe march back to head quaters where our blankets were stored and then given till the morning to have a good sleep which was sorely needed\n\n7th\nwe had a ten mile march to the train then travelledin cattle trucks till eight that night &entrained at Amiens findingwe had another sixteen mile to march &carry blanket &overcoat about half dropped out along the road, &slept in the hay stacks sheds etc.and came staying at all hours next day. We were well tired and the last mile seemed like five, The old villiage school hall was our billet, &we were soon spread over the floor and dead to the world\n","152":"\nIt was grand to wake &hear the noise of school children &the villiage bells instead of the noise of the battle fields. St Ledger was not a big villiage but it was a good changeand we were told we were there for three month spell, and we had an idea we would not see fighting again, so the","153":" was last day theAus Inf was in action the artillery remained longer.\n","154":"\nThe next few days we had very little to do, it was the better part of soldiering \"waiting to return\"\n","155":"\nThe French military sports were held in the villiage, as the lads become of agethey have to attend these sports &they class them by racing &jumping and exercising etc.\n","156":"\nThree of us set out to visit Abbeville, which was thirty mile away, the only wayto there was to take a chance of getting picked up along the road. We succeeded in reaching there and had a look round, The place had been severely bombed by fritz. All of the soldiers had to be clear of the town by eight or we managed to get a motor about half way and arrived back to St Leger very tired & wet through in the early hours of the morning.\n","157":"\nThe M GBatt held sports on afield just outside the villiage athletic sport fancy dress, mule &horse racing, It was\n\n\n\nasuccesfuldays sports, especially for myself I won first prizesfor a sack race& fancy dress representing a french farm girl, There was a good attandance of civilians from St Leger &St Ouen\n","158":"\nThe Mayor suggested having a debating evening once a week, the opening night the subject was Should Australian soldiers marry english brides and it was the cause of a good nights fun no ladies being present. The decision on the debate was given as a draw.\n","159":"\nWas armistist day We received the news atthe villiage in the morning, or just at lunch hour and the French people all ceased work, and was outup &down the streets drinking &shouting. The aussies were not too bad, a few got merry but behaved well, I see a transport sargent &a couple of lads ride their mules into a woman front room &back out again. The following week I was neutral and in bed.\n","160":"\nThere was a little fun for our section, We weresleeping in a loft like the French fowl houses,and as all troops were moving the next day a few paid a visit to the farm where we were bilited looking for fowls,they tried one shed &a pig rushed out then, they started up into the loft and we were surprizedwhen the boys started to shake the ladder, they called us some pet names &about six of our fellows chased them down the villiage in their shirts only they came back shivering as it was a extra frosty night.\n","161":"\nWe left in the evening to entrain at Hangest that night. but when we arrived we had to wait about in the cold till 10 am next day.The lads had big fires going with any timber they could\n\n \n\nfind about the station, but it was a miserable night\n","162":"\nWe set off in the cattle trucks 24 per truck, we had our blankets but could not stretchout too well, and the train was rougher than a boat at sea, one couldnt not stand adrink of tea down it would spill so we were well shook up at the endof the journey, but we only had a small march after leaving the train, and was given an old german hospital as a billet with wire beds.\n","163":"\nWe marched another twelve kilos and stayed at a broken down hay shed, hundred miles from nowhere, but burrowed in the straw like mice, &had a good nights sleep, I omitted to say we were supposed to be on a march to Germany as garrison troops.\n","164":"\nFound us on the tramp again marching as far as Petit Fayt, there we were given a good private residence for our nights rest with a fine creek runing through to have a clean up.\n","165":"\nWas an easier day only travellingfive kilos to Bologne the villiage was very intact as those parts had all been evacuated just prior to the armistist, but the germans had taken all their stock with them, the farm we were staying at had lost 14 cows &several horses, and one of the women folk was blinded, for refusing to work for them, and during our stay one of the sons returned with a horse &turnout the germans made him move some things back as they retreated then kept him prisoner,\n","166":"\nAll we had to do was to look over the guns &get them cleaned, we were told we would have a couple of weeks there before we continued out march to Germany\n","167":"\nThe King and sons were to meet &inspect all the troops at Marbaix, so the troops had to have an early breakfast &get shined for the occasion. I think for the only time in history the King has to wait for us, but the inspection was not ceremonial,he just walked along as as we marched into position &spoke to ones here &there, and said we were the lads for the souvenirs, The Remainder of our stay there passed by quite uneventfull, just a few exercising games &lectures to fill in the time.\n","168":"\nWe made another start at 8.30 and passed through Haut Lieu, Avesnelles, and camped at the next small villiage just outside Avesnelles, there was a couple of german ammunition trains, &a very large dump exploded the civilians said the British planes did it, but there was a lot of unexploded bombs &shells amongst it, and men that shouldhave known better walked back &stated getting about amongst the debris, when one fellow dropped abig bomb he was looking at, which was the cause of one death &and four others seriously wounded The railways railway lines had been severely mined as he retreated.\n","169":"\nWe moved on again as far as Sivry, just on the french &Belgium border, a distance of 20 kilos &passing through Flaumont, Felleries, Lepine & Clairfayts. The people about those parts could not do enough for us. they gave us coffay along the road &wanted to know if we were going to stay in their villiage\n","170":"\nWe had a march of ten kilos passed through Solre St Gery, and bilited in a good hay shed at Barbenconduring the day We passed the last gun captured from the germans in that section.\n","171":"\nWas rather a good days march, It was wet &snowing We passed through Walcourt, Selennieux, Doyinee and came to a hall at Yves Gomezee. They alloted some very decent billets to us and we were not long in getting some fires going &making ourselves comfortable, The villiage was very quiet &20 kilos to the nearest town.\n","172":"\nAlittle snow fell in the early morning but the sun came out warm, &kept nice all day. There were about fifty in the transport section, and wedenotedfive franckseach for a Christmas dinner to be held at six at night. We borrowed tables &chairs &the orchestra was an old frenchman avec accordian. If it has not have been for the dinner, Christmas day would have passed unheeded. The next few days we had to take limbers to Walcourt &carry 70 ton of coal for the civilpopulation.\n","173":" \nI had the opportunity of visiting Charleroi 22 kilos get there how one pleased, but I hopped on a motor lorrie and passed through a number of small villiageson the main road, namely Fraire, Laneffe, Somzee, Nalinnies, Loverval, &Marcinelle, The town was worth the visit, but things were an astounding price, An officer spoke to me &\n\nasked me would I like to work in the town, so he took me name &claimed me from the battalion for a waiter at the divisional HQmess\n","174":"\nI got word to leave for the division but only reached the first villiage that night as I could not get a motor lorrie along the main road, so I arrived at noon the next day&was shown my duties. I visited a \nthatre\n theatre that night and saw some clever acting but could not understand it all.\n","175":"\nI took a walk down the town, and I was surprized tosee the crowds about. Sunday is the busiest night for the picture shows &plays. I met some English spoken civies &passed awaya pleasant evening. The remainder of the month passed away quite uneventfullexcept for a few officers &some of the staff leaving fordemobilization.\n","176":"\nThere was a very heavy snow storm and it was lying aboutfour days. The civilians started snow balling, &half the windowsabout the town were smashed. The snow gets very hard at times and I scored a black eye, and my cheeks cut, but it was all in the game\n","177":"\nThere was a civil riot in town. It started amongst a dance party in a \"estaminet\" and was finished in the street, the women tore each others clothes off, It was very lively while it was lasted.\n","178":"\nI paid a visit to yves Gomezee, and it was extraordinary quiet, as the troops had all left there. I was rather sorry I went when I had to walk home 20 mile the next morning.\n","179":" \nThere was a big strike on in the town, from the coal miners round Charleroi, but the men were very orderly &did not cause much trouble.\n","180":"\nI started on two days leave to Brussels, which was a interesting place to look round. The first evening I went to the opera called The maid of the regiment, in english The scenery &singing was beautifull but my knowledge of French was not good enoughto follow it through.\n","181":"\nI visited all places of interest namely Kings Palace, Palace of justice , Cathedral, Art Gallery, and the spot where nurse Cavell was shot.The Kings Palace is very fair but the guard were very untidy and dilitary looking they could not stand without a post to lean against. The Palace of justice is a fine building& overlooks the whole town. There was some fine pictures in the art gallery, that were worth the visit,. All trams were free to Soldiers and the service is very good. I spent the evening at the Place êtê a vaudiville show, The turns were very good.\n","182":"\nIn the morning I went to the swimming baths, Warmed fresh water and they were very well laid out &clean, I had to return to to Charleroi that day andthe French porter would not sell mea ticket as the train\n\nwas too full, but I managed to get on the train without a ticket. The French Railways were very disorganized at those times.\n","183":"\nCharleroi was put out of bounds to all Soldiers for a couple of days, as there had been a few revolvers used and fights in the Cafes, and they had a round up to catch all the men absent without leave and the catch was very successfull.\n","184":"\nThe town was open again to the troops, It was pretty quiet about the suburbs to pass the evenings away, but there were pictures boxing theaters &civilian friends with daughters and anyone that picked up a little knowledge of their language could get around fairly well. The next week or so the troops were leaving for home at the rate of 1000 per day, so the town was pretty busy with troops every evening\n","185":"\nWehad to move into a new mess as the woman where the mess was, was that disagreeable that the officers decided to move, so being Sunday we had a busy day moving as you will always find Sunday moving day in the army.\n","186":" \nThe officers invited civilian guests in dine with them, The dinner went along very well &so did the spirits, and the evening that followed very amusing, to a sober person , thing were getting muddled the cook was tickling the colonel under the chin,\n\n \n","187":"\nBeing Easter the officers held a dance and invited Belgium lady friends, They had a very good evening but the young ladies Chaperone's often got where they were not wanted\n","188":"\nI had to return to my batt to leave for home. It was rather pleasant news to know I was crossing the pond for the last time.\n","189":"\nWe were given the day to prepare our kit, and we moved to the reinforcement camp at the station that evening &was given leave till eight in the morning.\n","190":"\nThe train pulled out at 9am carrying 1001 troops, There were was an ample supply of comfort funds in the last truck, in the way of cigarettes, chocolates, dates reading and writing material. We travelled till 5 pmthe following day, the only characteristics of the trip were the civilians saying goodbye to their soldier friends there, &families seeing the boys off &half crying like when leaving home for the war, and the train stayed awhile at Mons,and some fellows got looking around off the train, &only half dressed &they were left some caught up in a passenger train other met at crossings by motor,but they were all on again under two hours as the troop trains are awfully slow. The band played us to the base camp at Le Harve, where we had to remain for four days.\n","191":"\nWe had to go through the changing &disinfecting rooms &hand in all our fighting gear &old clothing which we were very pleased to do.\n","192":"\nWe were taken to the ships side in motor buses, and we sailed at 4am bound for South Hampton.The trip was very cold one &we did not get ashore till 8 the next morning.\n","193":"\nWe were given tea and cake, and a small parcel of biscuits &chocolate for the train journey. We entrainedat Warminster, then march to Sutton Veny camp. We had very little to do only wait for out leave as we were all entitled to fourteen days leave in England.\n","194":"\nI proceeded on leave, I travelled to Liverpool via London and I spent ten days there &had a very good time along the shore at Seacombe, &New Brighton\n","195":"\nI came back to to London, them on to Bristol to bid all friends goodbye.\n","196":"\nWas our day to return to camp, but there was a fair absentee list from the draft. A soldierwas a dont care sort of person those times.\n","197":"\nA party of us took a walk to a fine lake about three mile from camp, the grounds were owned by the Marquis of Bath. It was a fine place for a swim, but he wrote to the military &said it was a beauty spot for years andhe would not have us spoil it, the time was dragging in the camps, there were very few parades and nothing much to do.\n\n\n","198":"\nI left camp for another fourteen days leave and I had a busy time till the","199":" as a soldier getting married then had to have full proofs, as there had been too many serious tricks played in the marriage line\n","200":"\nWas the eventful day, I spent a few days in Sussex by the sea, &had to return to camp on the","201":" July, but not too stay long as a man married in England was given indefinite leave, and","202":" a day extra as ration allowance,\n","203":"\nfound me on my way back to Liverpool, where I stayed till I had to report at ships side but Ihad a rather long wait as I did not leave till","204":" duringmy stay the police strike was on and one street in Liverpool hardly had a sound window left, The tramway men then went on strike, They brought tanks machine guns, &a battle ship up the river and piqueted the town with soldiers but there were thousands of pounds worth of damage done before the strike was settled.\n","205":"\nA party of us too a marqueat Morton a good bathing spot, the fields all round looked like a military camp.I enjoyed a couple of weeks there.\n","206":"\nI was warned to be be at the ships side by four o'clock that day, We went on board but anchored all night (on HMS Makara)\n","207":"\nThe Makana Sailed at 12 noon, carrying about 150 married couples, with a number of dependents, and a few hundred troops for West Australia, before we were many hours out to sea the side of the ship was the busiest part\n","208":"\nThe weather was good and the sea calm, so most of the sorry ones were feeling themselves again. The treatment on the ship was very fair, to what I hear of others, but we were not without our g\nreviences\n grievances.\n","209":"\nWe passed close by Teneriff that night, and the lights of the town could be plainly seen.\n","210":"\nThere was a little argument on deck abut deck space, The officers had a portion alloted to them &sargents and some of the privates wives met with an officious \"Sgt Mjor\" on the officers portion, which caused a very exciting gathering, the SM was obliged to quit before some ofthe women were finished with him.\n","211":"\nThey held sports on deck,but there was hardly enough space; only a few could get close enough to see, and the day was very hot, so the sports were not a success.\n","212":"\nThere was a fancy dress carnival &dance and some of the competitors got up very well, considering theywere at sea and had nothing much to dress up with,\n","213":" \nWe crossed the equator at 5am, some of the ones that were new to travelling were seeing the line through glasses etc\n\n\n\n\n","214":"\nWe had a little rough weather, and there were quite a number of pale faces again,\n","215":" \nA young baby was buried, there were three babies buried on the trip,and three born.\n","216":"\nWe arrived at Cape town, and were given leave till eleven pm. The restaurants did very well as everyone was tired of ships food, fruit was a luxury, and a reasonable price, and there was a lot carried on board, nearly everyone getting a supply to last till arriving at the West.\n","217":"\nWe had a few days leave but the weather was against sight seeing. Pictures &theatres were the dryest of places of all.\n","218":"\nWe sailed at eight in the morning and the weather turned very cold &continued that way for the remainded of the trip, it actually snowed early one morning and everyone had prepared for a hot trip.\n","219":"\nWe arrived at Freemantle, and there was a crowd on the wharf, as the boat pulled in. after the troops has disembarked we were allowed ashore, and we were much interested in the differences in prices of things compared with England, boots &shoes were only half price, but the town was very quiet, so we returned to the\n\nship quite early that night\n","220":"\nWe were given leave till 4pm, so I took the train to Perth, and had a look round. I liked Perth very well, and I am satisfied the cost of living is cheaper there thanNSW. The Muriel Starr theatre party came on board, as the strike had them held up from going by the trans continental railway, but the woman folk of the party looked at their cabins, &then left the ship, the men stayed on board but were very dissatisfied, a little taste of the brighter side of soldiering was enough for them, We sailed during the night,\n","221":"\nWe arrived at Adelaide, but did not get ashore just anchored on the outer harbour and small ferry boats took the troops ashore, We sailed again at five pm.\n","222":"\nWe arrived at Melbourne in the morning, and was not allowed past the wharfentrance. The troops &wives were driven away in motors, It seemed very quiet on the ship then. We sailed again at 3pm,\n","223":"\nwe reached the heads between nine &ten am and after being piloted in anchored till the doctor examined the sick, and after lunch we started for Wooloomooloo wharf and was very pleased to land. I was surprised to find how easy it was to get out of the army, as all in this book is the truth, I may as well conclude by saying truthfully, that my time in the army has been a wonderfull\n\n\n\nexperience and it has only left me slightly affected, but now I am a civilian, I always wish to remain so.\n\n"}}