{"Document Name":{"0":"Diary_0256","1":"Diary_0256","2":"Diary_0256","3":"Diary_0256","4":"Diary_0256","5":"Diary_0256","6":"Diary_0256","7":"Diary_0256","8":"Diary_0256","9":"Diary_0256","10":"Diary_0256","11":"Diary_0256","12":"Diary_0256","13":"Diary_0256","14":"Diary_0256","15":"Diary_0256","16":"Diary_0256","17":"Diary_0256","18":"Diary_0256"},"Date":{"0":"unknown","1":1752.0,"2":1753.0,"3":1754.0,"4":1755.0,"5":1756.0,"6":1757.0,"7":1758.0,"8":1759.0,"9":1760.0,"10":1761.0,"11":1762.0,"12":1763.0,"13":1770.0,"14":1771.0,"15":1772.0,"16":1773.0,"17":1774.0,"18":1808.0},"Entry":{"0":"\n\n","1":" Time 6 pm. A beautiful bright Palestine moon shines on a troop of dismounted horseman. They are hastily adjusting their accoutrements before moving out on \nwhat proved to be\n that memorable advance against the Turks when three Turkish Armies where anihilated in less than two weeks and which ended the \nwar\n great war as far as Turkey was concerned.\n\n\"\nLine\n \nup\n \nhere\n \nSig\n \nTroop\n\"! We lined up, about 40 strong. Four ^Tele operators, farrier, limber drivers, visual signallers etc including one officer one sergeant & 2 corporals.\n\n\"\nGet\n \nmounted\n\"! I place my foot in the stirrup and give a mighty heave. My foot strikes \nit\n my rifle butt on the other side and I assume a very unsoldierlike & undignified position across the old mares rump. She doesnt take\n\n2\n\nkindly to this method of being mounted & proceeds to show her displeasure in lashing out violently at the poor unoffending steed next door, whose rider is in about the same predicament as myself. After several violent gymnastic exercises I succeed in getting into the saddle. I \ncalm\nsooth my noble steed and order is restored.\n\n\"\nTell\n \noff\n \nby\n \nsections\n\"! \"\nAdvance\n \nin\n \nsections\n\"! \"\nRight\n \nwheel\n\"! and we are off.\n\nWe follow on behind Brigade Hqrs Staff which comprises about 50 men viz General. Brigade Major, Staff Captain, Intelligence Officer & Vetinary Major, with their grooms batmen & orderlies. \"How far are we going tonight\"? Nobody knows. The Turks are about 15 miles away. \"are we going right on tonight & is the \nstunt\n starting tomorrow\"? No one knows excepting the \nHeads\n & they keep it religiously to themselves. The ^14th & 15th regiments\n\n\n\nleft the night before & the French Regt\n\n3\n\nwent ahead \nthe Previous\n last night & the French Regt are just ahead of us ^now We cannot see far ahead or behind for the dust. We are going towards Jaffa & ^we thank God that it is not towards the Jordan Valley. We get on to the Jaffa Road & there discover British Cavalry going the same way. They are the 4th & 5th Cav Divisions. We leave them & go through a ploughed field, down an avenue of good old Australian Gum trees & halt in a field by a tall hedge. We unsaddle, \n&\n feed \nup\n and tie up our horses & . I spread my horse \nrug\n blanket on some hard clods & seek repose. It is my first night on trek.\n\n18th We stay in this spot all day. A tanker comes over about 11 am & we are ordered under the hedge. We dont want him to notice anything unusual. I have 3 pipes & I break one today. My saddle wallets are not fixed properly & I\nproperly properly properly\n\n4\n\nseek the advice of an old campaigner who fixes them (curse him). At sunset we saddle up and are away again. It is nearly as bright as day & would be pleasant but for the dust. Hour after hour passes & my knees are getting sore rubbng against the wallets. I silently curse the man who strapped them on. We turn a corner sharply & I look back along the road we have traversed. One long line of horse-men as far as the eye can see - the regiments are behind us. Now we catch up to a dust cloud in front & discover it is a camel water transport. It takes us two hours to pass that transport, & my knees are getting worse. I am in agony. \"Halt\"! \"Dismount\", \"Pass it along\". The welcome order comes along that we halt for 10 minutes & we are to overhaul our leather gear etc. Thank God. I struggle ^frantically\n\n5\n\nwith my wallet ^straps & just get them fixed when - \"Get mounted\" - & we are off again. We ride on until about 11 pm & unsaddle on a plain near a grove of trees. Mulelbis - but we didnt know at the time. We feed up & wait for our limber which contains our picketing rope. \nNot a sound is heard & one would never have dreamt the enemy was\n We do not hear a sound & can hardly realise that the front line is only a few miles away. Midnight - & the limber hasnt arrived so I fill my old \nkit\n canvas kit bag with sand and hitch the old mare to it. The saddle cloth is rather damp but . It is strange that on this never to be forgotten night with all the excitement, I am asleep as soon as \nI laid my head down.\n my head touches the ground.\n\n19th 3.30 am. starlight & all is quiet. Feed & saddle up. I am shaking with excitement, for this is the beginning of\n\n6\n\nthe great day. I have considerable difficulty fixing my equipment in the dark. I am anxious, for I dont want to lose any of it as every article is necessary. I am munching bully beef & biscuits & washing it down with water at 4.30 a m when suddenly there is a crash & the bombardment has started. For 15 miles the horizon is \nstabbed\n aglow with sheets of flame, like the sky in Qland during a severe thunderstorm. The great warships have joined in from the Mediterranean and the noise is terrific. We jump to our horses heads but they only prick up their ears & go on munching. x(You can imagine my thoughts at this time.x) After about 20 minutes the firing slackens & almost dies away save for the ^crash of an occasional 60 pounder. Then we move off just as \nthey\n the\n\n7\n\nday dawns. (\nI understand.\n the 60th 7th & 54th Infantry Guns are in the front line between us and the coast. \nWhen\n As the bombardment starts they \nwent\n go over the top & advance\nd\n under cover of the artillery barrage. If the Turks reply then trenches \nwould be\n are empty. Immediately the barrage lift\ned\ns they charge\nd\n, \n??? Turks were left.\n but only dead men ^are there \nBut few Turks were \nFor Jacko is retiring (& at breakneck speed \ncavalry came in.)\n on Tulkeram & Haifa \nand never stopped again only to be taken prisoner.\n The 4th & 5th Cav Divs are between us & the coast supporting the 54th & 7th Infantry) & we are supporting the 60th Inf Divn. \nOf course we knew nothing of this at the time).\n We come to a barbed wire fence soon after we start and \nfrom the language of our General I judge him to be of an\n judging from his language our G seems to be of an irascible temperament & I note the fact for future guidance. I make\n\n8\n\na resolution to evade any act that will call down his wrath upon me. We jog along steadily in the dust across \na\n ridgy country not a sign of life or habitation anywhere. Occasionally we hear the crack of a 60 pounder but they are now in our rear. We come to the River Anja (about the size of a Cabbage tree Creek). We cross over a small bridge & lead our horses down a steep bank to water. Here a tra\nd\njedy happens. I lose another pipe. I have now only one. \nleft\n We pass our trenches & here the 14th & 15th Regts go ahead & the Frenchies spread out on our left and right but where are our Infantry and the enemy. We cannot hear a sound. A little further on we meet the 1st batch of prisoners with Tommy guards. And here is an officers horse being led away with the blood running down its side. A little further & we are\n\n9\n\nin enemy country and crossing the Plains of Sharon. Here are Jacko trenches & entanglements. Here is where our shells landed in the early morning. The ground looks as if smitten by an earthquake. the prickly pear hedges are hacked to pieces and the ground pitted with huge shell holes. \nA\n dead Jackos \nlies here &\n dot the ground \nthere\n. A little further on I get a shock. The horses in front of me swerve to the right to clear some object on the ground. \nI\n as I come abreast I see that an enemy shell has exploded in a group of our Infantry. They are Indians - 8 of them & the glimpse I get of them as I ride by turns me very queer. These are the first dead I have seen of our ^own side & I steel myself to meet what lies ahead. Here and there we pass a wounded Indian by the\n\n10\n\nroadside waiting for the Ambulance. About midday we draw near to some ridges & the order comes to don our steel helmets. I can see bursting shrapnel ahead & can hear the shrill scream of the pellets as the shell bursts. We get the order to spread out and gallop. My old mare is excited with the noise and the accoutrements \nthat are\n flogging her sides. Through a cloud of dust I see a French Officer (who is attached to our Brigade) just ahead of me & I follow him. I opine that he knows more about warfare than me but I \nsecret\n fervently hope that he is not seeking the \nLegion of Honour\n Cross de Guerre. I can still hear the shrapnel screaming but to tell the truth I am more concerned about my steed & whether I \nwas\n am losing any gear. I flash pass an MP \nstanding by\n attending to his horse ^which is down & wonder if he has been shot. I am\n\n11\n\nhanging on to the Frenchie & by now we are out of range, but it is some time before we ^all get together again. I discover here that I have lost my precious water bottle. I have now ^only a water bag slung round the old mares neck but alas it contains hardly a teacupful of water. \nI\n God only knows when I am to get more. It is very hot & the dust helps to parch my mouth. We ride on to another ridge when there comes the rattle of machine guns \nnot far away\n in front & then ping-ping-ping as the bullets fly past & we are off at another gallop, truly things are getting very interesting. A little further on we see another batch of prisoners and these are ours, taken by the 15th Regt which has just been in action. We cross the last ridge & descend on to a plain. Far away in the distance I see the white homes of a large village, from\n\n12\n\nthe midst of which a column of smoke arises. We can see nothing of the 14th or 15th but the French are advancing on our left on our right stretches the empty plain, but I can hear firing from the direction of the village. We are on the look out for Taubes & can see some 'planes in the distance. Two of them approach us swiftly but we see the red white & blue rings & know that all is well. On the way across the plain small groups of Jackos pop up from the long grass waving dirty white rags & we pass them along to the rear. We now come to some stony \nhills\n foot hills on the left of the village. Here I am detached with \n3\n 2 others as a signal station and we try to get in touch with the 60th Divn ^ (by heliograph) \nwhich was\n on our right. I am holding the 3 horses & on hearing the hum of a 'plane\n\n13\n\non\nI glanc\ning\ne fearfully skyward \nI note with joy the\n I see him making straight at us at a low altitude. \nI begin\n I look around for cover but as he gets nearer I note with joy the two rings. He \npauses\n hovers right over us & then suddenly swoops ahead & as he dives I hear the rat a tat tat tat of his machine gun. As he disappears over the brow of the hill another takes his place & repeats the performance. Evidently Jacko is getting somewhere ahead. We fail to raise the Divn so mount & proceed ahead. We run into Hquarters on the brow of the next stony hill, a part of one of the Regts are with them. & the remainder are surrounding about 2000 of the enemy in the hollow beneath. They have good cover & will not surrender & these are what the \naero\n planes are x\nxxx\n machine gunning.\n\n14\n\nA few minutes after we arrive up goes the white flag & ^they come out of the hollow & file past us to the rear. I am nearly mad with thirst and bless the man who offers me his water bottle. My two mates endeavour to raise some of ourparty by Helio & I sit on a rock & hold the horses a little distance away. The village is just on our right. An officer rides past me & yells \"A Squadron follow me.\" They folllow him round a bend of the hill & I lose sight of them. I speak to one of them 2 hours later & he tells me that 6 of them were wounded when they charged through the town but alas they left the officer there shot through the head. \nX\n The French have ^now captured the six guns that shelled us (earlier in the day) on a hill at the back of the town.\nX\n I dont \nwhere these guns were and was sitting\n\nThe\nse\n guns that have been shelling us all day have not yet been captured but I am ignorant of this and am sitting on a rock holding the three horses \nwhere\n and am just lighting my pipe when an officer rides up & yells\n\na6666018.html\n\n15\n\nas in a dream on a rock holding 3 horses. I was just lighting my pipe when an officer rode up & said\n \"damn it man take those horses off the hill at once. ^ do you want to be blown off it. I replied \"this is a signal station.\" He went purple & roared. ^ I should hate to see him so upset so I take the horses below. We now hear\nd\n that the village \nwas\nis ours. ^and the French have captured etc The 60th Divn ^has charged one side & our Brigade the other. \nOnly xxxx\n We ^have only lost one man - an officer. - Night has now fallen & we \nmarche\n move on to the plain just in front of the village. ^ Neither Horses nor men had had \nnothing\n anything to eat since 4 a m & the horses are mad with thirst. \nWe\n I put the nose bag on the old mare but she is too thirsty to eat. We \nstood\n stand by our horses until about 9 pm & then ride into the town to water \nour horses\n. The town \nwas\nis Tulkeram & the people\n\n(mostly Christian Syrians\n\n16\n\nwere\n are exceedingly glad to see us. The Turkish Hqrs \nwere\n are still burning. We water our horses a bucketful at a time. I hold the two horses & my mate fills the bucket. There is only one tap & the horses smell the water & are frantic. A Brigade of \nCavalry\n Light Horse watering at one tap. At 11 pm we are on the plain again & standing by our horses. The old mare eats a bit of feed & I am glad. We sit, stand or lay by our horses until about 1 am \no'clock in the morning.\n\n20th Sept 1.a.m. \"\nGet mounted\n.\" I drag my weary body into the saddle & we are away again we know not whither. Oh if I could only have had a few hours sleep. It is moonlight & we ride along past the village. Outside the village we are halted and the order is passed -\n\n17\n\nno smoking no matches to be struck & no talking. This is getting interesting I think. I have lost my only pipe in the struggle for water at Tulkeram , but a kind friend has given me an old corn cob\npipe\n. There is a hole in the bottom of the bowl but it is covered by a piece of gummed paper. It requires very careful handling & I act accordingly. I have also a water bottle & it is full to the top & I am taking religious care of it. We jog along & then strike off into a donkey track. Dear oh dear shall I ever forget that track. The old mare slithers and slides & stumbles & several times I find my heart interfering with my larynx. Onward mile after mile & hour after hour now up now down. I am dead beat & notwithstanding the fearful track my head droops on my\n","2":"\n\nchest & I doze. I woke up suddenly & clutch frantically at the pommel of\nthe\nmysaddle. Several times I\nwas\namwithin an ace of slipping off. Thank God the old mare is still fresh & surefooted. No one speaks, in fact my comrades must be as fatigued as myself. At last just as day is breaking we come into a wadi &\nwe\nstrike a level track. With the new day I feel a little fresher. About 8 am we pull up & have bully & biscuits. We commence to climb again & this time the track is so bad that we have to lead our horses. Several times my horse slides & falls on the slippery rocks but the only damage is the loss of a few strips of skin & hair. Eventually we reach a small village at the top of the hill. Here we fill our water bottles & water the horses. \nI feel rather f???. ???\nWe proceed, still leading our horses.\n","3":"\n\nDown hill this time & the track^isas rough as ever. I throw the reins over the saddle & the old mare follows me picking her way along. At last we descend into\na\nanother wadi & further on we halt for an hour. We now discover that the 14th Regt has gone ahead to blow up a length of Railway between Tulkeram & Haifa. We follow on for another hour\nwhen we\nandmeet the Regt returning after having accomplished their objects. They have with them about 300 prisoners. We halt for a while and then on again hour after hour across a black soil plain. We see nothing & hear nothing & we dont know where we are going. I wonder if we are going to travel all night again & I am certain that I shall never do it. Just before dusk we sight a\nvillage\ntown & skirt around it. \nWe are told that it\n","4":"\n\n^ we find that it is Tulkeram .\nJust at dusk\nAs darkness falls we pull up, amidst a lot of transport wagons. Thanks be to God our limber is amongst them with feed for the horses & rations for ourselves. \"Off saddle\" How welcome that order \nwas\n is. \"Reveille at 3.30 am.\" Thank God for a few hours rest. I hitch the mare to an iron girder & feed her. The cooks have some hot tea ready. \nBut\n I am too knocked up to eat much,^ so after a drink of hot tea I spread out the \nwet\n saturated with perspiration saddle blanket \nout\n & drawing my own over me I go into a trance.\n","5":" Dawn finds us jogging along a dusty road with a Railway line \n& hills on\n running along the side^ of it \n& hills on each side of us\n. About ½ a mile from Tulkeram we turn off the road & travel along side, \nof it.\n for grim death is on that road in the shape of a slaughtered Turkish transport. It is the work of British & Australian\n\n21\n\naeroplanes and they have done their work well. Motor car horse, mule & bullock wagons lie there in shapeless heaps. Some of the drivers have not had time to leave their vehicles & lie in huddled heaps amongst the wreckage. Some of them have tried to escape to the hills but the deadly machine Guns \nwere\n have been too quick for them & they lie dotted all around. Now & again we ^see the limbs of some of them quiver & contort in their final agony. Here & there a little group of poor wounded wretches are huddled together waiting for an ambulance which \nwill be \nis \nfollowing us\n behind. For 8 or 9 miles the road \nwas\n is strewn with corpses. We are collecting prisoners as they we go \n& once\n including a Turkish offer & a doz men with four machine guns \nsurrendered to us \n. About midday a British 'plane\n","6":"\n\nhovers over head & drops a message. We pass \nfield\n about 20 abandoned field guns & some motor bikes, also a motor wagon which has evidently been a Travelling post office, for letters \nwere\n are strewn all around. We approach the foot of a large hill & here find the horses of one of our regiments & M Gun section. We dismount amongst them & stand by our horses. Shells are screaming above our heads & we hear the machine Guns rattle not far away. \nWe hear are told\n that there is a scrap on beyond the hill. I sit down beside a M.O. Doctor & a Transport officer. Everybody is hazarding a guess as to our whereabouts but we are practically lost. I dont feel very comfortable & \npray\n hope that the shells dont drop short. By & by they pass the word for the \ndoctor\n M.O. Dr \nhe\n who grabs a leather case & a ^beer bottle ^of iodine & departs in a\n","7":"\n\nhurry. He returns shortly & states that a man has been shot through the neck - \"only a flesh wound\" he says & \"\nhe is lucky to get off so lightly \n\"but just missed the carotid artery\". \nIt\n is a parching hot day & I keep wetting my lips with water for I have only a little left & have no idea when I will get the next \nX\n \nlot.\n The firing gradually ceases & about 4 pm we move on. \nX\n See back. We round the hill & jog along up a winding road & suddenly come into a large city. The population are crowding the streets & we have some difficulty in proceeding. I ask the name of the city & the reply is \"Nablus\". & so we have just taken the town that we have been trying for for nearly a year.\n We have been after this town for nearly a year. We enquire for water & are escorted by a crowd of excited & cheering natives. Three boys come to blows as ^to \nwho\n which one shall lead my horse. We water our horses\n\nMy old corncob pipe is about finished and I am feeling down hearted.\n\nJust before we move off a trooper hands me over an \nspare\n old pipe & I am saved.\n\n24\n\n& replenish our bottles at a public fountain. Dear oh dear how good that water tasted. ^ I simply poured it down my parched throat. We push on through the city & descend a road leading on to a plain \nthe other side\n. We are jogging along quietly when \nCrash! Crash!\n just ahead of us. we hear the scream of the shells but no explosion & as we round a corner, come on to a British 60 pounder Battery. They are shelling a hill in the distance & we can see the shells exploding on the crest\n of the hill\n. It is now dark & we halt near the battery & unsaddle & feed up. We are to move on again in 3 hours. After a while we get the order to turn in -- we are not moving until next day.\n\n22\nnd\n We move off after breakfast & ride without a stop until midday. The dust is fearful & I cannot see the horse in \n\n25\n\nfront of me nor can I recognise the men next to me. Our mouths are parched & our eyes sore. \nWe\n I am very sparing with the water but dear oh dear I could drink buckets of it. After an hours spell ^at noon we are off again. We pass village after village & I refil my water bottle at a well. We come to a large town about 7 \no'clock\n pm & find that it is Jenin. This has been captured by the 3rd Brigade the previous day. They \ncapt\n surprised the garrison & captured 10,000 prisoners, also a large German Hospital & staff & a Aerodrome with 11 Taubes. I see 2 uninjured Taubes the next morning. Whilst approaching Jenin we passed \nthe\n what is left of another Turkish transport. 2 miles of dead Jackos horses & mules. I am smothered in white dust & the atmosphere is thick with decayingTurk. We spend the night in a ploughed field & the aroma\n\n26\n\nof \ndecayed\n decomposing Turk haunts me in my dreams.\n\n(23rd Sept)\n\nAwaking at daylight I discover a Jacko - very dead - near our lines & am very glad when we shift our camp ^on to a ridge some distance away. Here we open our first signal office. I sit on a rock with my telegram pad on my knee & a bivvy sheet stretched over'head. We work like blazes all day & night as there is a lot of back work to make up\n","8":"\n\nAt \ndinner time\n midday we are off again. More rotten dust & decayed Turk. The bodies by this time are getting very ripe. We reach Wadi Jordin about dusk & relieve the","9":" Brigade who have on hand about 10 000 prisoners. Signal office again & plenty of work.\n","10":" I am dirty & unshaven. Dirty — God. I was never so dirty \nbefore\n in my life ^before. I havent washed nor shaved for a week.\n","11":"\n\nWe \nwere staying\n stay here all day & when I am relieved, I discover a waterhole about a mile away. I have a beautiful swim & don a clean shirt. On reaching camp again I have a shave - and – I am myself again, but I wonder when & where I shall have the next wash & shave. We move off again at dusk. Our objective is Tiberias. The","12":" Regiment have taken Samakh, but have had to fight for it. They have lost 3 officers & some 30 men but the town is ours & the enemy are escaping by motor boat across the sea of Galilee & by motor lorry to Safed. Tiberias has also fallen after some resistance. I learn all this by listening in on the \n????\n line\n\nWe jog along the dusty road the atmosphere still redolent of decomposed Turk. It is quite dark & I can see nothing through the clouds of dust. About 9 pm we pass\n\n54\n\nConvalescence home until the Hospital ship arrives. About 500 of us are here. I may state that B & B has been the diet all through with an occasional bit of custard. They have one cook here for 500 sick men so you can imagine the rest. Remain here until the","13":" when we board the Red Cross Ship Dunluce Castle. What a relief to sleep on a spring mattress & oh what joy to get some stew & bread & butter.\n","14":" I arrive at Alexandria & hear that the War is over. We board the Hospital Train at 10 pm & arrive in Portsaid at 8 am 12th Nov \nwhere\n just when all the ships in the Harbour have let their whistles loose.\n\n19256 Sapper J H Lowe\n\n5th Signal Troop\n\n5th L H Brigade\n\nA I F\n\n28\n\nthrough Afula. Afula with its large aerodrome \nwas\n has been captured by the British & Indian Cavalry on the 21st. The moon rises about 10 pm & we halt for an hour to let a wagon transport get ahead of us.\n\nWe now commence to climb, & continue climbing for hours. About midnight we pass Nazareth. It lies on our left & looks calm & beautiful in the moonlight. Another hour brings us to Kaffr Kenna (Cana of Galilee) & here we halt amongst a grove of trees. We off saddle & snatch a few hours rest.\n\n6th Sept. 8 am. We are jogging along again through the hills hour after hour. I am in my shirt sleeves as usual with tunic strapped in front of me. My water bottle is full & I have breakfasted heavily off bully & B as usual. I have my old pipe & plenty of Tobacco\n\n53\n\nKoniak. His luggage consists of a \nnose\n nose bag containing his wardrobe etc & a roll of blankets. He \ntalks from\n monopolizes the conversation from Zahle to Beyroute where we arrive at 4.30 pm. A few minutes afterwards I see him at the entrance of the Hospital sitting on his blanket roll with a dozen Askaris round him still going strong. In his hands is the Koniak bottle which still contains about one nip. We are at the 32nd CCH, a large building originally a barracks. It is crowded with British Australian & Indian Askaris. I sleep little that night for the Indians make a fearful row Coughing & Groaning & singing.\n\n2nd Novr Still at the 32nd CCH & I Have a look around the City.\n\n3rd Am transferred to a kind of\n\n29\n\nThe old mare is going \nfine\n strong. No saddle sores & her feet & legs are still sound. The pace is telling on some of the other nags though & one or two of their backs are raw. We halt for our midday meal & about 3 pm we sight the sea of Galilee miles below us at the foot of the hills. In front of us is the mountain on which Christ preached is sermon. The road winds down the hills, like a corkscrew & we see Tiberias nestling on the shore of the Sea of Galilee at the foot of the hills. On the way down I recall how this part is noted for its sudden storms & strange to say, as we ride along a large black cloud comes along. The rain falls heavily for a few minutes & we have to don our overcoats. Tiberius is the spot where the historical haul of fishes was made. Parts of\n\n52\n\na Syrian named Elias Antoni who was 15 years in Qland. The lower story of the building is occupied by sick Turks & Indians & their groans echo thro the building all night. \nX\n I here of the Armistice with Turkey\n1st Nov.\n\nI leave per Motor Lorry for Beyroute at 10 am. Our route lies through the Lebanon Hills & it is a picturesque journey all the way. The Turks have blown up a Viaduct & we see the Canadian Bridging Corp at work repairing it. Our trip is spoilt by a loquacious & semi intoxicated Australian Askari who climbs over the tailboard at the last moment. He is in possession of a hatful of tomatoes & Indian bhupatties also a large bottle of Koniak Brandy. His condition signifies that he has already consumed a fair amount of\n\n30\n\nthe town look very ancient. Several large buildings are flying the white flag & we pass small groups of Turkish & German prisoners. We \noff\n water our horses at the Lake off saddle in a ploughed field & establish our Signal Office.\n\n27th Sept. Away again early in the morning. The road winds along the sea shore for some distance & we fill our bottles & water our horses along the shore. The water tastes good but by now I could drink \ndrain\n sewer water. We pass a grim object - very dead - lying across the seat of a buggy. The two horses are also lying dead. A little further on an old Bedouin with a long grey beard lies dead \nin the gutter\n by the roadside.\n\nWe commence to climb & \nkeep on\n continue climbing for hours. Occasionally we halt to breathe our horses. I look back, & what a wonderful sight it is. The \nwon\n road\n\n51\n\n& Indians. The engine\ns\n \nare\n is stoked with wood & we stop at several stations to procure fuel. It is an up hill pull for about 30 miles, alongside the Barada river all the way. About 3 pm we reach the summit of the eternal hills & commence to descend. We cross a large plain & about 4 o'clock we arrive at Ryaak. The station buildings have been burnt. A large Aerodrome \nwas\n has been captured here with a number of planes. At 4.30 we arrive at (Zahle) & we transhipped into the Clearing Stn. It is a two storied building & has been used as a Turkish Hosptl. It was originally a hotel & a signboard testifies that it was the Hotel Orient Madame Antoni.\n\n31st October\nI stroll through Zahle which is on a hill & meet a Yankee girl, also\n\n31\n\nwinds below us for miles & \nthe\n is crowded with Light Horsemen, transport wagons, ambulances etc. I think what a splendid cinamatograph picture it would make. About midday we reach Safed, a small jewish colony nestling amongst some Aust. Gum Trees. We halt for an hour and then onwards again. \nJust before\n Another hours ride & we hear the sound of battle. The enemy have blown up the bridge across the Jordan and are holding up our advance. Our Battery comes along at the Gallop and is soon in action. All the afternoon we stand by our horses & listen to the battle sounds. Near dusk we move again & we pass behind our regiments who are in action. ^The bullets are pinging all around us & I get a considerable move on. It is a little too close for my liking & I take \nconsiderable\n great care to keep off the sky line. We lead our horses down a narrow goat track. Slipping stumbling & sliding all the way down. At the bottom we find a ford across the\n\n50\n\nThere is a cemetery in the making here fenced in with barbed wire. It is filling up far too fast. Every day I see fresh mounds. One of my mates lies here a wooden cross on his \nhead\n grave. Poor Harry I saw him alive & well just after we crossed the Jordan River. This place is called and is about a mile outside Damascus. 150 Turkish officers are billeted in a house here with a Tommy guard.\n\n30th October\n About 100 of us are taken to a small Rly Stn per motor ambulances. \nWritten\n on a notice board on the platforms in chalk is the legend. \"Captured by the 4th Regt ALH\" We are stacked in covered trucks (similar to our C wagons) & we steam out about 10.30 am. We are a mixed crowd. Auzzies Tommies\n\n32\n\nJordan. We water our horses & cross - up to our saddle \ngirths\n flaps. Up a goat track again dear oh dear what a track. I pass 2 horses who have slipped & broken their necks & wonder when my turn will come, but the old mare carries me safely onward. It is now dark & the \nsound of\n firing has ceased, but we are riding over boulder strewn ground & I marvel how the old mare keeps her feet. I am dirty & hungry & weary & praying that we may halt. Eventually we pull up & sit by our horses. How has the scrap gone? we dont know but sit & nod & smoke & chew B & B. 10 pm we make another move but have to stop again as the going is too rough. The order comes along, \"Lay by your horses until daylight.\" I fastnen the reins thro my shoulder strap & stretch out with my head on a boulder. \nNow & a\n Occasionally\n\n49\n\nSpanish Flu, I report to the Field Ambce.\n\n24th Nov. My eyes are bad with the dust & I cant shake the Turkish fever off so\n I am to be evacuated to the 14th AGH Portsaid & I bid farewell to the old bob tailed nag pack up my kit & depart per motor ambulance to Div Rcvg Stn Damascus. Here they allot me a 6 by 2 space on the cement floor. The building is crowded with sick Tommies & Auzzies suffering from malaria Pneumonia Spanish Flu & dysentery. The staff is shorthanded as half of them are down with the same complaints. Turkish Red Crescent orderlies are commandeered & go about their work as if they had been attending to sick Britishers all their lives. I am to go on to Beyrout 100 miles away but word comes that Beyrout Hospitals are overcrowded & I stay here for 5 days\n\n33\n\nmy neighbours nag wanders on to my stomach & legs in his search for a bit of picking, & ^occasionally my old nag snorts & blows down my neck \noccasionally\n & tugs at the shoulder strap. I cant say that I \nslept\n sleep peacefully & I \nwasnt \nam not sorry when I \nsaw\n see the dawn.\n\n28th Septr We climb down the steep &rocky side of a ravine and cross a bog at the bottom. On the other side we halt in a boulder strewn ploughed field for breakfast. Hitherto we have seen no Taubes, but now as I sit nibbling at the good old B & B I hear a whirr - r - r - r - r - whush & 2 Taubes come sailing up the valley dropping bombs as they come. One of them \nstrai\n flys straight for us. I hear the order \"Lie down by your horses\" & I lie on my back with my arm thro the reins. He swoops straight at us & dear oh dear\n\n48\n\nTurkish stretchers for firewood & when they are finished we start on the doors & window sashes. \"(necessity knows no law) I have several trips into Damascus. On the","15":" the same dead Turk ^that I saw on the 2nd is still \nlying on the road\n there. He has increased in size. Next day they tip him over the side & burn him. All the way into \ninto\n Damascus I see the remains of fires & amongst the debris I notice the charred portions of Turks ^ & Horses that have not been quite consumed by the fire. At one spot I see the skinned carcase of a horse & around it are a dozen dogs some feeding & some glutted lying asleep alongside. All along the road are abandoned transport & machine guns not yet collected. \nX\n \nowing to the dust\n & strain my eyes are troubling me & as I haven't quite shaken \nthe\n off the\n\n34\n\nhow helpless I feel. I glance at two chaps near me & their faces are white & I suppose mine is ^of the same hue. Rat a-tat-tat-tat our machine gun is at him. Why he hasnt fired at us is a mystery but he suddenly veers around & disappears in the distance \nwith\n Another plane, with the good old red white & blue rings is following him up . I hear later that the ^two Taubes \nwas\n are brought down further on. Off again across the stony fields till we strike the road. Here we find the 3rd Brigade. We \nknow\n now \nthat\n ascertain that the force that held us up have been captured & the road is clear. There were about 1000 Germans & Turks occupying a well concealed position & their object was to \ndela\n hold us up & give the retreating armies a chance to get away. The regiments go on ahead towards Kunietra \nwhi\n which\n\n47\n\nSig Troop. The heavy rain has swollen the river & it is overflowing its banks. There is a rush & tear for the next ½ hour saddling up in the dark up to our knees in water. We stand by for an hour whilst another position is found for us. This is in a lane further up the road. I push open a gate in the lane & discover a garden with trees, at the back of a house. Whose it is I neither know nor care. I lead the old nag through the gate, tether her & crawl under \nthe\n my blanket, just about knocked out.\n\n5th October to \n18th\n 24th\n Still in the garden of which has been a Turkish Hospital. Working in sig office & cooking our own food. Eggs are 2 PT each but tomatoes are there for the picking. Now we get a little fresh mutton which is a Godsend. We break up\n\n35\n\nis captured & we reach & off saddle there about 3 pm. Kuneitra is a picturesque Circassian village situated on a plain. The men \nwhere\n ^wear a large black fur head gear similar to a British soldiers busby. 3rd \n4th\n & 5th L H Bdes & the 4th & 5th Cav Divs concentrate here for the move on Damascus about 40 miles away. A dozen 'planes swoop down & land back of our horse lines. As far as the eye can see is one mass of men horses & wagons.\n\nI am by a stone wall with my instrument & the Brigadier is on the other side of the wall. Two French Algerians with their red caps struggle by with a bleating sheep they have looted. Others come along with squawking fowls. They are making it too hot & the Brigadier sends for the French Commdt. & the looting ceases. Incidently, the Froggies have to\n\n46\n\n3rd October\n I crawl into the saddle & we are off again just after daybreak. Through the choking dust again until at midday we reach Khan were we unsaddle on a stony ridge. I see the M O who marks me no duty & I lay on my blanket & suffer with the Turkish fever Spanish Flu or some outlandish disease \ntill next morning\n.\n\n4th Oct\n The 5th Cav Divn relieve us and we return to Damascus (20 miles). We meet a heavy thunderstorm on the way & reach our old camping spot beside the Barada at Dumar at dusk & wet to the skin. We off saddle feed up & prepare our tea. I have saved a few rashers of nice lean bacon & have just put them on the fire when along comes the order \"saddle up\n\n36\n\npay for the sheep and fowls. My two hours are up at 5 pm & after I shave wash boil the billy & have tea & groom & feed the old mare, I am free until midnight. The horses are not getting enough to eat & I forage in the village & get my nose bags full of good chaff & grain. The old mare gets a good feed that night & is sure of one the next day. By this time I am regarding that mare as my dearest friend & would rather starve myself than her. She has had all my spare biscuits & doesnt she like them. She noses round my haversak like a child after lollies. At midnight my mate wakes me to go on duty. He tells me that there is no business doing at present, and he has blown the candle out as a sniper has fired two shots at it. Needless to say I do not rush over to the office and light\n\n45\n\nmile after mile the atmosphere redolent of dead Turk as usual. At night fall we camp on a ridge near the road & outposts are put out. \nIt is my first turn on\n I am first for duty & I sit with the receiver to my ear. A cold wind is blowing & I hear the occasional crack of a rifle & the rat a tat tat of a machine gun. The Brigadier is lying on his blankets just near me & I hear him ask the Brigade major if he would like some jam on his biscuit. Just then I get the news through that Bulgaria has surrendered & call out to the General, who thanks me & passes the good news on. I dont feel very well tonight & am aching & shivering all over. When relieved I scoop the rocks away with my foot & lay down by the old mare & sleep a feverish sleep.\n\n37\n\nup. Fortunately I have no reason to use a light & cheerfully wake up the next man at 2 am & pass the cheering news ^re the sniper on to him.\n\n29\nth\n Off again at 1 pm. The enemy are in force some where ahead as our armoured car patrol has been machine gunned & shelled. We jog along until dark & we halt at the sound of gun fire ahead. All night along we dismount & mount & forge ahead a little every half hour or so. It is a night of misery & we would feel better if we could keep going. The firing is intermittent all the night. ^30th At daybreak we get \na go\n a move on & pass captured guns & dead Jacko's. Just near Sasa we come on to about 400 prisoners both Germans & Turks. They have held us up all night, \nbut\n they retreated in a hurry at daybreak but were soon overtaken. The road \nwas\n is strewn along here with discarded packs overcoats\n\n44\n\nDIII and then the poor operators work starts.\n","16":"\n We are told we are to spell here for a few days & rejoice for we are weary & worn & dirty & hungry & the smell of decomposed Turk is ever in our nostrils. A little way up the road there is a dead Turk. He is lying with his head on his arm as if asleep. I discover a tibbendump & the old mare gets a good feed & not before it is \nwanted\n needed. I am ashamed to look her in the eye some times when I can only give her two handsful of grain. She seems to say \"so this all you give me after all the way I have carried you\". About 11 am the order comes. \"be ready to move off at 3 pm. Dear oh dear. are we never to have a rest. On again along the dusty road.\n\n38\n\nrifles & bayonets etc. we \nstopped\n halt for an hour by a stream at Sara. I have a pint of hot tea & some good old B & B which puts new life into me. Off again at 9 am & we learn that our next objective is Damascus. (Damascus lies on a plain surrounded by bare hills.) After a while we leave the road & travel through the stony ploughed fields at the foot of the hills. On our right lie the outskirts of Damascus. Amongst the green trees lies a small white village & as we get on a line with it enemy machine gun fire commences. I listen for the bullets but fail to hear them so they are evidently not firing at us. Suddenly our guns bark out & we watch the shells bursting in the village. A 2 storied house suddenly disappears - it is pretty shooting. Now the village is blotted out by smoke & the guns cease fire . As the smoke\n\n43\n\nJust then\n Now the Turks ^have fired a big petrol & ammunition dump in Damascus which burns for hours. The explosions shake the ground like an earthquake & the flames make the night like day.\n","17":"\n We are up and saddled by daybreak for we expect\ned\n snipers in the hills & \nwe","18":" want to be shot in our blankets. If we \nhad\n ^only knew though, \nit\n the enemy have had enough & we neednt worry about snipers. We descend into the village below for water (Dumar) and meet a string of prisoners. They ^have escaped the slaughter last night & are just about done. We can hear the sounds of firing in the distance & shortly after learn that Damascus is ours. We stay in the hills until 4 pm then descend into Dumar & camp alongside the Barada river. We join up our\n\n39\n\nlifts. I see the flash of swords & lances as the Australian & \nIndian Cavalry\n & Indians charge at the gallop. They disappear amongst the trees & we have no doubt as to the result. The French Regt has gone ahead of us & we receive a message to hurry up the M Guns as the Froggies are likely to be cut off. \nWe gallop\n We get along at the gallop for awhile till we come up with the Froggies on a ridge overlooking a \npart\n suburb of Damascus. We are jogging along quietly when rat-a-tat-tat-tat & the bullets sing past us on the left. We right turn - \nspread\n open out & dismount. The Brigadier sends back for the guns & I fancy we are in for something hot this time. Our machine guns now chip in just in front of us but of course we do not know whether the enemy is charging or not & we dont feel very\n\n42\n\nbelow us, with here & there a grey form lying on the edge of it. I hear a bullet whiz past & suddenly remember that the enemy have guns also. As I have no business xxxxx here I do not linger. It is about 4 pm and the firing continues until night fall. \n(\nThe result of \nthe m gunning\n our fire is that only about 300 ^of the enemy got away that night & these \nwere\n are caught early next morning. ^The remainder \nwea\nre killed or \ntaken prisoner\ncaptured. (The next day, the road shows a veritable shambles. About 400 hundred dead are counted. Motor drivers are \nfound\n sitting there dead clutching their steering gear & ^we see a dead ^Syrian girl \nwas found in a\n in a Gharrie. Scores of the wounded have crawled away & died each side of the road.) \nThe uninjured at the rear were taken prisoners\n.) We off saddle & settle down for the night. My horse has been without water all day & we discover an old well near by & take our horses to water\n\n40\n\ncomfortable. I set up a helio & await orders. In the distance the ^Damascus wireless Station is on fire & one after another the two tall masts collapse. It is one of the largest wireless stations in the world & is in circuit with Berlin. We wonder what message they flashed to Berlin before they destroyed the station. We are trying to signal our Divisional Hqrs but cannot locate them - they are evidently on the move. A helio flashes away in the hills & we ask him who he is. A P Z Colonel Force. We dont want him. The \nmach\n bullets are still spurting up the dirt behind us. Johnny now opens on us with a field gun. We cannot hea the gun & he must be firing at extreme range. I watch the shells burst & throw up a cloud of dirt & they are getting\n\n2873\n\n41\n\nunpleasantly near. One bursts on a line with us about a hundred yards away, but that is the last for our guns \nback\n have arrived and are making an infernal din. I love those guns. What confidence they put into a man. I have very little recollection of what occurred in the next hour. I have a blurred memory of heliograph Brigadier Generals artillery etc. I can remember watching our shells burst on a Rly Stn in the distance & then we are off again into the hills. We are going to \nxx\n block the enemy retreat along the Beyroute road. Our Machine Guns are behind us & as we reach a gap in the hills overlooking the Beyroute road, I see an officer frantically waving his arms & yelling \"Machine Guns at the gallop\". In a few minutes they are in action. I sneak up alongside to have a look & see a cloud of dust\n\n"}}