{"Document Name":{"0":"Diary_0331","1":"Diary_0331","2":"Diary_0331","3":"Diary_0331","4":"Diary_0331","5":"Diary_0331","6":"Diary_0331","7":"Diary_0331","8":"Diary_0331","9":"Diary_0331","10":"Diary_0331","11":"Diary_0331","12":"Diary_0331","13":"Diary_0331","14":"Diary_0331","15":"Diary_0331","16":"Diary_0331","17":"Diary_0331","18":"Diary_0331","19":"Diary_0331","20":"Diary_0331","21":"Diary_0331","22":"Diary_0331","23":"Diary_0331","24":"Diary_0331","25":"Diary_0331","26":"Diary_0331","27":"Diary_0331","28":"Diary_0331","29":"Diary_0331","30":"Diary_0331","31":"Diary_0331","32":"Diary_0331","33":"Diary_0331","34":"Diary_0331","35":"Diary_0331","36":"Diary_0331","37":"Diary_0331","38":"Diary_0331","39":"Diary_0331","40":"Diary_0331","41":"Diary_0331","42":"Diary_0331","43":"Diary_0331","44":"Diary_0331","45":"Diary_0331","46":"Diary_0331","47":"Diary_0331","48":"Diary_0331","49":"Diary_0331","50":"Diary_0331","51":"Diary_0331","52":"Diary_0331","53":"Diary_0331","54":"Diary_0331","55":"Diary_0331","56":"Diary_0331","57":"Diary_0331","58":"Diary_0331","59":"Diary_0331","60":"Diary_0331","61":"Diary_0331","62":"Diary_0331","63":"Diary_0331","64":"Diary_0331","65":"Diary_0331","66":"Diary_0331","67":"Diary_0331","68":"Diary_0331","69":"Diary_0331","70":"Diary_0331","71":"Diary_0331","72":"Diary_0331","73":"Diary_0331","74":"Diary_0331","75":"Diary_0331","76":"Diary_0331","77":"Diary_0331","78":"Diary_0331","79":"Diary_0331","80":"Diary_0331","81":"Diary_0331","82":"Diary_0331","83":"Diary_0331","84":"Diary_0331","85":"Diary_0331","86":"Diary_0331","87":"Diary_0331","88":"Diary_0331","89":"Diary_0331","90":"Diary_0331","91":"Diary_0331","92":"Diary_0331","93":"Diary_0331"},"Date":{"0":"unknown","1":1691.0,"2":1692.0,"3":1693.0,"4":1707.0,"5":1708.0,"6":1711.0,"7":1712.0,"8":1713.0,"9":1714.0,"10":1715.0,"11":1716.0,"12":1717.0,"13":1718.0,"14":1719.0,"15":1720.0,"16":1722.0,"17":1723.0,"18":1724.0,"19":1730.0,"20":1731.0,"21":1732.0,"22":1737.0,"23":1739.0,"24":1742.0,"25":1743.0,"26":1745.0,"27":1746.0,"28":1747.0,"29":1748.0,"30":1749.0,"31":1752.0,"32":1756.0,"33":1757.0,"34":1758.0,"35":1759.0,"36":1760.0,"37":1761.0,"38":1762.0,"39":1768.0,"40":1770.0,"41":1788.0,"42":1789.0,"43":1795.0,"44":1796.0,"45":1797.0,"46":1799.0,"47":1800.0,"48":1801.0,"49":1802.0,"50":1806.0,"51":1807.0,"52":1808.0,"53":1810.0,"54":1813.0,"55":1816.0,"56":1817.0,"57":1818.0,"58":1819.0,"59":1820.0,"60":1822.0,"61":1830.0,"62":1834.0,"63":1835.0,"64":1836.0,"65":1837.0,"66":1838.0,"67":1839.0,"68":1840.0,"69":1841.0,"70":1842.0,"71":1843.0,"72":1845.0,"73":1848.0,"74":1851.0,"75":1852.0,"76":1853.0,"77":1861.0,"78":1862.0,"79":1866.0,"80":1868.0,"81":1871.0,"82":1872.0,"83":1877.0,"84":1878.0,"85":1879.0,"86":1881.0,"87":1882.0,"88":1883.0,"89":1884.0,"90":1891.0,"91":1922.0,"92":1923.0,"93":1924.0},"Entry":{"0":" \n\n","1":"\n\nOrdered to report at D.A.H.Q at Glisy for the position of the relieving Draftsman, as the other chap was going on “Blighty\" leave.\n\nDrawing office and my sleeping quarters were in a “Dug out\" about 50 feet under the surface. Dozens of rooms in this dugout and all lit up with Electricity. The room I slept in had eight beds, and they were very comfortable, only a bit damp. \n","2":"\n\nOut of bed 7-30am. Breakfast 8am and into the office at 9am.\n\nNot much doing in the morning except marking up the maps in the Staff Captains office. Dinner 12-30pm Tea 4-30pm. Then my troubles started to come in re. the days shelling, etc. and I had to peg in, and make out charts of “Hostile shelling\" and “Harassing Fire\" for General Phillips. My work had to be checked first of all by Lieut Murray. Kept going till 11-30pm.\n","3":"\n\nIn my spare time I had a read of some of the Intelligence which I kept in my Office, and the news was very interesting. I began to see daylight, as the saying goes. This job will do me for the Duration. I am always to be in the office incase I am wanted, and I have to be polished up like a new pin, but that is not difficult as I am never near any mud etc.\n","4":"\n\nThe Draftsman is due back from Blighty today. I don’t wish him any harm, only I would to hear that he has gone into the Hospital with some trouble. Stiffitis has set in. \n\nHe has returned and I have been told to return to my section. (So this is the end of a perfect job.)\n","5":"\n\nTook a load of Machine Gun ammunition up to Villers Brettoneux, and while unloading Fritz was bursting Coal Boxes over head. The Dirty Dog. Coming home I nearly knocked over a tank or should I say the tank nearly knocked us over.\n","6":"\n\nMounted guard at 10am. In the evening we were told to fall in and a letter from some General was read out to us about the Big Push which starts tomorrow morning, and asking the Boys to do their duty etc. etc. etc. \n","7":"\n\nStill on Guard, went on the 4 to 6am shift this morning., and the roar of the aeroplanes passing over our camp in the hundreds going in the direction of the front line, made one wonder how Fritz was faring.\n\nThe horizon was lit up by the flashes from our guns, and just on daybreak I could see thousands of Cavalry going along the road. The rumble of the tanks, and the ammunition one could see going up to the line, made one say Well Fritz you are going to get something you have been asking for, for quite a long time.\n","8":"\n\nTook a load of Small Arms ammunition to Villers Brettoneux. On the way up we passed a great number of German prisoners, some of them driving their own guns under Australian escort.\n\nSome of the prisoners seem quite happy and others would give us a very sullen look, which made one almost inclined to get off his mule, and get into them. At Villers Brett. We heard the boys had made a great advance and were still going strong. Good Luck to them. And I hope they tear them to pieces. Arrived back to our line at 1pm. As the Infantry have advanced so much, we have to follow them up, so packed up and left Lamotte at 4pm. Camped outside Villers-Brettoneux for the night. Where we camped was ground which was held by Fritz about 24 hours previous, among his machine gun positions and dead Fritzs were lying dead all over the place. After fixing up our mules, and warned by our O.C. not to touch anything, as he (Fritz) had \n\nleft a few traps behind, we were dismissed. Had a look through some of Fritzs “Dugouts\" and machine gun positions. After going through the dead Germans pockets (for souvenirs and found someone had been there before us, and in most cases the very buttons were cut off his tunic) we would put him in one of his own trenches, and put some earth over him.\n\nSlept under my waggon at night which was a silly thing to do as my load was Gun cotton, which we carried in case of emergency (for blowing up dumps etc.) It would not take much to make it go off and Fritz was very close during the night with his bombs.\n","9":"\n\n2pm on the move again, as fritz was shelling the main road, we had to take a track across country top Bayonvilles. By the look of the \n\ndead Germans which we passed, our boys have been doing some good bayonet work.\n\nIn the gully a battery of Fritz guns were out of the pits, and turned around, and it appeared to me as if our boys had been firing his own shells at him.\n\nCamped just on the outside of Bayonvilles, and Fritz made it too warm with his bombs during the night. O yes, it was cool, in fact I was shivering all over\n","10":"\n\nWhen we got out of bed in the morning a battery of Naval Guns were lined up agains our camp, so we had to shift as we were right in front of them. Instead of getting well out of the road, (as Fritz was sure to send a few back when those guns opened up) our O.C. (Captain Mitchell) pulled right behind the guns, and told us to dig in, which we did. Shortly after the naval started firing, and it was not\n\nlong before Fritz started to send back a few high velocity shells. Five came very close to our unit and one dropped right into a unit which was camped just alongside of us, and still we did not shift.\n\nWe had our own mules grazing while we fixed up lines for them. Things were a bit quieter by this, when Bang one landed at the end of the line I was working on, killing one “Donk\" and wounding a few. This was no good to us, so we started to chase our mules away, when over comes another and bursts a few yards in front of me. I was so close that the concussion knocked me spinning and in falling, somehow my hands went over my head. I lay there untill most of the earth etc. had come down again, then got up to see if I was all in one piece and by God I was, but with a \n\nhole in my left fore arm which was giving my clothes a bath of blood.\n\nSome A.M.C chap got a hold of me and dressed my wound. The next shell landed right into one of our waggons which was loaded with bombs. I heard later that the wheel was left. As soon as my arm was dressed I got. Being windy was not in it. Blue Funk was more like it. \n\nAbout 15 minutes later my brother found me and dragged me to the Dressing Station, where the Doctor had a look at my arm then after redressing it, was told to go over and have something to eat and have a smoke, as I had to wait for an ambulance to take me to the C.C.S. (Casualty Clearing Station) while waiting there some more of our boys came in., and from them I was told eight or nine were wounded and one killed with the same shell. I was very lucky as I was nearest to the shell yet I think had the smallest wound.\n\nGot into the Ambulance and taken to No 53. C.C.S. On the way to the C.C.S. we changed motors, and where our wounds were again examined by a Doctor. After taking all particulars (such as, our unit, Rank, married or single etc. etc. the usual army questions) we had a tag tied on our tunic or in my case my braces as I had no tunic on. After that I was inoculated (against blood poison)\n\nWhen we were finished with the Doctor the Y.M.C.A. had hot cocoa, biscuits and cigarettes waiting for us.\n\nThere was also a few wounded Germans waiting for the motor, and they received the same treatment as our boys, and the Y.M.C.A. also gave them refreshments.\n\nGot into the motor & passing through Villers Brettonneux, saw one of my old pals Billy Herbert.\n\nWhen I arrived at the C.C.S. my wound was again examined\n\nUp to the present I did not have much pain with my arm, but when I lay down on the stretcher at night, it gave me What for.\n\nOne of the Fritzs plane flying over the Village near our dressing station, but he came a Big G. as one of our planes got on to him & brought him down in flames.\n","11":"\n\nGot into Red Cross Train at noon, on our way to Rouen. While travelling all the boys received the best of attention from the Red Cross Staff on board the train. \n","12":"\n\nArrived Rouen at 2am. Taken from the railway station to No 5. General Hospital by motor which I would say was about three miles from the station. After a few Army particulars were taken, those who were able had to have a hot bath, and I can safely say we enjoyed it. I could use one arm, so managed to scratch along.\n\nThere was an attendant helping some of the boys. I was put into a marquee where I was not long in getting into bed, just on day break.\n\nBeds do feel strange after the old Dug out.\n","13":"\n\nHad the X Rays on my arm this morning, and the piece of shrapnel is still in it. I am classed as walking wounded, I was allowed out of bed, after the Doctor had examined me.\n\nAn hour after getting into bed, the Air Raid warning was sounded, and we had to get out of the marquee into a sand bagged hut. Fritz dropping bombs near Rouen. Raid over in an hour, allowed back to bed.\n\nAbout an hour later the warning went again, but I was not getting out of bed, as I was too comfortable. The O.C. came around & found a\n\nfew of the boys still in bed, and he did roar, so we promised we would not get into bed untill the raid was over. We kept our promise but we did not leave the marquee, we got under the bed, and went to sleep there.\n\nThe Doctor came back but no-one was in bed, but soon caught sight of us , so he made us all go into one of the huts, and stood there till we were all in. We marched right along the hut and out by the other door, but the old “Quack\" was up to these little jokes, so we had to stay in till the raid was over.\n","14":"\n\nAm examined by the Major this morning and as the Operating Theatre is so busy with very urgent cases, I was warned for “Blighty\" and that will do me. In the afternoon I was issued with a Tommy uniform for the trip over. Fritz paid us another visit at night.\n","15":"\n\nLeft No 5 Gen Hospital at 12 noon and motored to Rouen station, where we entrained and left at 2.30pm.\n\nBefore leaving Rouen, a lady came through the train, asking for any Australians (We had all kinds of troops on board) She had a large basket on her arm filled with writing paper, playing cards, cigarettes and chocolate, which she was distributing among our boys.\n\nHad the best of tucker and attention from the staff on board the train. Arrived at Le Havre at 6.30pm and as the hospital ship had not arrived, we were taken to the Casino Hospital on the Promenade for the night.\n\nHad to get out of bed again as the Air Raid warning was sounded. Put into the cellars for over an hour, and we could hear our guns putting up a barrage, but\n\nI dont think Fritz got near the place, as Le Havre is too valuable, to let Fritz get into, Le Havre is, the main Base for guns and ammunition\n\nLeft the Casino at 3.30pm and boarded the “Gloucester Castle\" at 3.45pm. Pulled out from wharf at 5.30pm. and lay off till 10pm. when we left for Good Old Blighty\n\nGreat number of wounded Germans on board, and they were put on the bottom deck and had one of our boys, guarding them, in case anything should happen to the ship they would be the last to leave.\n\nThis shipping company issued men with a box containing pipe, 2 ozs tobacco and a few packets of cigarettes, and they were jolly acceptable.\n","16":"\n\nArrived Southampton 10am, Entrained and left Sth Hampton at 5pm. arriving Brighton at 7pm. Here special electric trams were waiting for the walking cases, and we were taken\n\nto Right to the entrance of Kitcheners Hospital. I was put into D.3. ward, and after a good hot bath we were shoved into bed.\n","17":"\n\nAfter inspection by the Doctor I was allowed out of bed\n\nAll Canadian Staff in this hospital and they will always do me for kindness.\n","18":"\n\nAs I am a walking case (and not bad at that) The Doctor said I could have leave into Brighton from 2 till 9pm. Free train to all wounded soldiers, and we could get onto the piers, and into the concert for free.\n\nThe Brighton people are very good to the boys, giving them papers and assisting them in every way.\n\nThe following few days I had leave into Brighton, and I will be sorry to leave.\n\nWe are to be kept here untill there is room for us in an Australian Hospital. \n","19":"\n\nLeft Brighton this morning and arrived in London about 11.30am. As we have to change stations, we were taken from one to the other in our own Ambulances. We had an hour to wait for a tram, so had a walk over to a Church hut, where we had a Blowout.\n\nLeft London about 12.30pm and while travelling in the train, I began to feel jolly funny. Arrived Harefield about 2pm. and as soon as the Sister saw me, she shoved me straight into bed, and sent for the Quack. Said it was French Fever. (In ward 2.","20":" A.A.H.)\n","21":"\n\nFelt a lot better, so was allowed up.\n\nHad X Ray on my arm again.\n","22":"\n\nDown again with French Fever\n","23":" Up again, and feel A.1.\n","24":"\n\nOnce again I am into bed, tried to stay up, and after a few words with the Sister, I was shoved in.\n","25":"\n\nVisit from Miss Golding, who came to get some particulars of how Bombd. Fox was killed. As Fox was in the same “Dug out\" as myself in France and was hit by a piece of the shell that got me, I was able to give her full particulars\n","26":"\n\nAs I feel “Good O’\" and out of bed, I have been warned for 14 days leave. It is hard to take. I dont think.\n\nAs the piece of Shrapnel in my arm is very small, and giving\n\nno trouble, the Doctor advised me to leave it in, as it had lodged between muscles and sinews and to get it out, they would have to cut them, and it might leave me with a stiff arm.\n","27":" \n\n7-15am, Drew my kit and left Harefield at 9-50am. Got my pass, money, etc at Horseferry Rd, then spent the rest of the day in London. Caught the 10-15pm. train from Kings Cross for Edinburgh\n","28":"\n\nArrived at Edinburgh 8am. and received a great reception from my relations.\n","29":"\n\nPaid a visit to the Forth Bridge, Art Gallery and Sir Walter Scotts monument.\n\nWent to the pictures at night, and I was glad to get into bed, as I had been flying all over the place during the day.\n","30":" \n\nChumed up with a Canadian Officer, while looking over the Castle, and we had a very enjoyable day together.\n","31":" \n\nLeft Edinburgh this morning & arrived in Glasgow at 11-45am. Stayed 4 days in Glasgow with my sister and was sorry when I had to leave as I was having a great time.\n","32":"\n\nLeft Glasgow at 5pm arriving Edinburgh 6-15pm.\n","33":"\n\nMet Fred Mechif in Princess St and took him to my Aunts place for tea.\n\nMun","34":" \n\nLeft Edinburgh (Waverley) at 7pm for London.\n","35":" Arrived in London 7am and had a fly round as this is my last day of leave\n","36":" reported to H.Q at Horseferry Rd. at 11am got another days leave on account of the railway strike. No trains to take the boys to camp. \n","37":" \n\nReported again to Horseferry Rd, and received another days leave. Spent the day seeing some of the sights, and having a good time\n","38":" \n\nRailway strike still going strong, so had another days extension\n\nWhile walking along the Strand the street started to jump up & down, so I thought the best thing was to see the Doctor at Head Quarters, so got on to a bus top Horseferry Rd. After medical inspection I was sent out to Southall hospital","39":" A.A.H. and put straight into bed. (in G. Ward) The old French fever again A few days later I got Bronchitis so that will be a few more days in bed.\n","40":"\n\nWas getting on nicely, and like a big fool; I had to get up, and catch another chill, so that will mean more bed.\n","41":"\n\nAllowed out of bed for two hours,\n","42":"\n\nAllowed up for two hours, and ordered not to leave the ward, but I had enough of it, so cleared off into London for the afternoon. I got some words from the sister when I returned.\n\nThe following few days I spent in London.\n","43":"\n\n12-30am Left Southall with party and went to see “Shanghai\" at Drury Lane Theatre. Train from “Southall\" to London. When we got out of the train at London one of the Red Cross ladies was waiting on the platform for us. \n\nWe were put into a Dray and driven to the Theatre. Where Ivy Schilling, Dorothy Brunton, were acting and after the show the Dray was waiting for us. We then drove to the Anzac Buffet where we had tea. Then we went back to Hospital. The expenses were all by the members\n\nof the Melbourne Stock Exchange\n","44":"\n\nWent to see “The Law Divine\" at Wyndham Theatre. After the show taken to the Victoria League for tea. All expenses paid by the Australian Red Cross.\n","45":"\n\nWent to harry lauder’s concert at the Pavilion\n","46":"\n\nSpent the afternoon in London with Miss Golding and Miss Prestwick.\n","47":"\n\nMiss Prestwick carting me all over London.\n","48":"\n\nHad a change today by staying in the Hospital\n","49":"\n\nWent with party to Windsor Castle and after going through all the Sate apartments and stables, etc. we had tea, and on by Princess Alice and a few ladies\n\nI thought we were in for a good old feed, but no luck. Tea, bread & butter and cake, so we made the best of it. Got Princess Alice to sign my invitation card.\n\nThe following few days I spent in London.\n","50":"\n\nWent with party to the Alambra Theatre. After show met by one of the Red Cross ladies and taken to the Victoria League for tea. (near Leicester Square) \n","51":"\n\nTaken to concert at the Palladium by Miss Golding\n","52":"\n\nGoing into London the guns started to fire at 11am just as I arrived into Ealing Broadway. Armistis has been signed and it was not long before the flags were flying from every window, and people crowding into the streets. \n\nWhen I got into London the streets were packed with men, women & children waving flags and singing. The excitement was high.\n","53":"\n\nWent to the London Opera House (Pictures) The people in great spirits over Peace. \n\nAfter three o’clock no motor busses allowed along some of the main streets as they were so crowded. It was a common sight to see girls dancing to the music of a street organ, others again dancing on the roof of a taxi as it slowly moved along. \n\nAfter a very exciting day I got back to the Hospital about midnight.\n","54":"\n\nWent to the afternoon performance at Drury lane Theatre. Ivy Schilling sent her photograph round to every one of the boys. Tea at the Y.M.C.A. Alwich Theatre (off the Strand).\n\nLondon still upside down with excitement.\n","55":"\n\nWent into see King George. Queen Mary, Prince of Wales & Princess Mary driving along the Mall.\n\nMet one of my old Paisley chums (W. Beaton) in the Y.M.C.A. Hut\n","56":" 290th November.\n\nSpent the afternoon in London, but had to return to the Hospital on account of the fog. Got a lift from Ealing Broadway to Hospital in one of our motor ambulances. Would never have got home otherwise as all traffic was stopped. The fog was so thick that we could hardly see the gutter when looking out of the car and we had to go dead slow.\n","57":"\n\nDischarged from the hospital this morning. In charge of two other boys. \n\nWhen we got to Paddington Stn. London we decided to have another day in London, before going into camp. And we did have a good fly round\n","58":"\n\nMet the other boys at Paddington Station at 11-45am and left there by the 12-15 pm train, for Warminster where we arrived at 3pm.\n\nGot a motor car to No 8 Camp No 1. Command depot Sutton Veny Wilts.\n\nAfter some fooling about I was shoved into No 13 Hut.\n","59":"\n\nUp before Dentist & Doctor for Classification\n","60":"\n\nResult of classification B.1.A.2.\n","61":"\n\nUp before the Doctor again, still B.1.A.2.\n","62":"\n\nPut on the “Nestor\" boat roll for Australia, and warned for draft.\n","63":"\n\nInoculated and medical inspection at No 5 Camp. Spent the rest of the afternoon in Warminster buying a few things for the voyage.\n\nWhen I got back to camp, I was told not to leave the hut, may be marched off any moment.\n","64":"\n\nTransferred to No 2 Camp. \n","65":"\n\nHanded in some of our kit to Q.M. and issued with extra uniform\n","66":"\n\nAfter packing our kit bags we handed them in to that they would be sent on ahead and put in the ships hold.\n","67":"\n\nFinal medical examination before going on board.\n","68":"\n\nRevielle at 2-30am breakfast 3am, fell in 3-30am and marched to Warminster. Our days rations were put into each carriage. Left Warminster at 5.30am. Arrived at Oxford 8am where we had hot tea and coffee. Passed through Birmingham at 10am. Crewe 12-15pm and Liverpool wharf at 2pm.\n\nWent on board the H.M.T.S. Nestor at 2-30pm. Tea at 6pm. on “A\" Deck No 7 mess Cast off 6.30pm and lay off in the river over night. Issued with hammocks & blankets.\n","69":"\n\nSailed at 4-30am Breakfast 7am. Dropped the Pilot at Hollyhead. Dinner 12 noon. Tea 5pm\n","70":"\n\nVery heavy swell, and only a few of the boys came down for meals. Went to bed at 7pm.\n","71":"\n\nEvery soldier on board received the following from the Australia Red Cross. 2 suits pajamas, one flannel undershirt and underpants, one shirt, pair of white canvas shoes 2 cakes soap, tin of tooth soap, packet of writing paper, one pair socks, stick of shaving soap handkerchiefs and soft white hat. All these goods were tied up in a pillow cover, and was valued at @pound;2\n","72":"\n\nArrived Gibralta 9am and left again at 10-30am. “Nestor\" averaging 14½ knots per hour. 1500 troops on board.\n","73":"\n\nPassed Malta about 8am.\n","74":"\n\nArrived Port Said at 9am. The anchor had hardly touched the bottom, before the natives were all round our boat selling fruit and silks. Left Port Said at 4-30pm. Going through the canal we had a searchlight fixed on the bow.\n","75":"\n\nCame out of the canal and dropped anchor off Suez at 8am.\n\nThe Transport “Burma\" arrived two hours after the “Nestor\" At 11-30pm The Sisters, Officers and Men started to sing carols, and we had a few words from Col. Springthorpe.\n\nAt midnight one of the boys started to ring the ships bell, and as this is the fire signal the crew were running all over the ship looking for the fire. And the other ships lying near us started to signal to us. Do you want any help. The Digger only gave the ball a few rings, then got for his life.\n","76":"\n\nEvery soldier received a parcel from the Red Cross this morning, and we had an A.1. Xmas Dinner, consisting of roast meat, oranges, chocolate, cigarettes and a bottle of Sydney beer for every man. We were able to get some coloured paper from one of the crew, so we decorated our Deck, and we were a \n\nmerry party. Left Suez at 8-30pm.\n\nVery funny at night some of the officers were well gone, otherwise three sheets in the wind, and they would insist on giving the boys a speech. It was as funny as a circus.\n","77":"\n\nTried to sleep on deck, but it was so windy that I was kept busy chasing my blanket all over the deck, so got down below.\n","78":"\n\nArrive Colombo at 8am, not allowed ashore on account of the “Flu\"\n\nTaking on water and coal\n","79":"\n\nLeft Colombo at 6pm.\n","80":"\n\nAs the boys complained about the tucker yesterday we had a lecture from the O.C. Our complaint did a lot of good. Had Ham & Eggs for breakfast this morning.\n","81":"\n\nPassed Cocas Island about 4pm. Did not see any sign of “Emden\"\n","82":"\n\nKit inspection and filled in form for the Repatriation Dept.\n","83":"\n\nArrived Albany 11am. Laborers refused to coal our boat, as they have got the “Flu\" scare. Not a case of “Flu\" on the “Nestor\"\n","84":"\n\nSome of the Troops coaled the ship. They put 600 tons on board, Finished about 4pm.\n","85":" Jan\\W.A. Boy, disembarked at 6-15pm and we sailed at 6-30pm.\n","86":"\n\nI have got the job of Table Maid, otherwise known as Mess Orderly for A.7. table, Cutting up the meat and washing up.\n","87":" Medical Inspection (B. Class) Blanket & Hammock inspection in the afternoon.\n","88":"\n\nSighted land at 3-30pm and passed \n\nthrough the Melbourne Heads at 6-30pm Dropped anchor 7pm.\n","89":"\n\nAs one of the boys reported sick last night, and had a bit of a temperature the “Quack\" says it is “Flu\". So the “Nestor\" has to be quarantined for seven days, at Portsea. When this news travelled round the ship the language was, ---Nuff sed.\n\nEvery morning we have to parade before the Doctor and have our temperatures taken, then into a room, and fumigated for a few minutes.\n\nThe Boys do not like this quarantine business, but taking it quietly.\n\nEvery day the Salvation Army and Red Cross sent cases of cakes and fruit on board, for the boys.\n","90":"\n\nUp anchor 3-30am. Reveille 4am arriving Port Melbourne 7-30am. Disembarked at 9.30am. and was taken in motor cars through the City, (where we received a great reception) to Sturt St Barracks, where my mother and sister were waiting for me.\n\nI had to have a medical inspection etc. before leaving the barracks\n\nWhen I did get out of the barracks (at 1pm) a few of my friends were waiting for me. Well I don’t think I have been kissed so much in my life.\n\nIt was worth coming home for.\n\nGot leave till the","91":"\n","92":"\n\nReceived my discharge from the A.I.F. also the large pension of","93":" per fortnight.\n\n"}}