{"Document Name":{"0":"Diary_0296","1":"Diary_0296","2":"Diary_0296","3":"Diary_0296","4":"Diary_0296","5":"Diary_0296","6":"Diary_0296","7":"Diary_0296","8":"Diary_0296","9":"Diary_0296","10":"Diary_0296","11":"Diary_0296","12":"Diary_0296","13":"Diary_0296","14":"Diary_0296","15":"Diary_0296","16":"Diary_0296","17":"Diary_0296","18":"Diary_0296","19":"Diary_0296","20":"Diary_0296","21":"Diary_0296","22":"Diary_0296","23":"Diary_0296","24":"Diary_0296","25":"Diary_0296","26":"Diary_0296","27":"Diary_0296","28":"Diary_0296","29":"Diary_0296","30":"Diary_0296","31":"Diary_0296","32":"Diary_0296","33":"Diary_0296","34":"Diary_0296","35":"Diary_0296","36":"Diary_0296","37":"Diary_0296","38":"Diary_0296","39":"Diary_0296","40":"Diary_0296","41":"Diary_0296","42":"Diary_0296","43":"Diary_0296","44":"Diary_0296","45":"Diary_0296","46":"Diary_0296","47":"Diary_0296","48":"Diary_0296","49":"Diary_0296","50":"Diary_0296","51":"Diary_0296","52":"Diary_0296","53":"Diary_0296","54":"Diary_0296","55":"Diary_0296","56":"Diary_0296","57":"Diary_0296","58":"Diary_0296","59":"Diary_0296","60":"Diary_0296","61":"Diary_0296","62":"Diary_0296","63":"Diary_0296","64":"Diary_0296","65":"Diary_0296","66":"Diary_0296","67":"Diary_0296","68":"Diary_0296","69":"Diary_0296","70":"Diary_0296","71":"Diary_0296","72":"Diary_0296","73":"Diary_0296","74":"Diary_0296","75":"Diary_0296","76":"Diary_0296","77":"Diary_0296","78":"Diary_0296","79":"Diary_0296","80":"Diary_0296","81":"Diary_0296","82":"Diary_0296","83":"Diary_0296","84":"Diary_0296","85":"Diary_0296","86":"Diary_0296","87":"Diary_0296","88":"Diary_0296","89":"Diary_0296","90":"Diary_0296","91":"Diary_0296","92":"Diary_0296","93":"Diary_0296","94":"Diary_0296","95":"Diary_0296","96":"Diary_0296","97":"Diary_0296","98":"Diary_0296","99":"Diary_0296","100":"Diary_0296","101":"Diary_0296","102":"Diary_0296","103":"Diary_0296","104":"Diary_0296","105":"Diary_0296","106":"Diary_0296","107":"Diary_0296","108":"Diary_0296","109":"Diary_0296","110":"Diary_0296","111":"Diary_0296","112":"Diary_0296","113":"Diary_0296","114":"Diary_0296","115":"Diary_0296","116":"Diary_0296","117":"Diary_0296","118":"Diary_0296","119":"Diary_0296","120":"Diary_0296","121":"Diary_0296","122":"Diary_0296","123":"Diary_0296","124":"Diary_0296","125":"Diary_0296","126":"Diary_0296","127":"Diary_0296","128":"Diary_0296"},"Date":{"0":"unknown","1":1245.0,"2":1247.0,"3":1248.0,"4":1249.0,"5":1250.0,"6":1251.0,"7":1252.0,"8":1253.0,"9":1254.0,"10":1255.0,"11":1256.0,"12":1257.0,"13":1258.0,"14":1259.0,"15":1260.0,"16":1261.0,"17":1262.0,"18":1263.0,"19":1264.0,"20":1265.0,"21":1266.0,"22":1267.0,"23":1268.0,"24":1269.0,"25":1270.0,"26":1271.0,"27":1272.0,"28":1273.0,"29":1274.0,"30":1275.0,"31":1278.0,"32":1283.0,"33":1285.0,"34":1286.0,"35":1287.0,"36":1288.0,"37":1289.0,"38":1290.0,"39":1291.0,"40":1292.0,"41":1293.0,"42":1294.0,"43":1295.0,"44":1296.0,"45":1297.0,"46":1298.0,"47":1299.0,"48":1300.0,"49":1302.0,"50":1303.0,"51":1304.0,"52":1305.0,"53":1306.0,"54":1307.0,"55":1308.0,"56":1309.0,"57":1310.0,"58":1311.0,"59":1312.0,"60":1313.0,"61":1314.0,"62":1315.0,"63":1316.0,"64":1317.0,"65":1318.0,"66":1319.0,"67":1320.0,"68":1321.0,"69":1322.0,"70":1323.0,"71":1324.0,"72":1325.0,"73":1326.0,"74":1327.0,"75":1328.0,"76":1329.0,"77":1330.0,"78":1331.0,"79":1332.0,"80":1333.0,"81":1334.0,"82":1335.0,"83":1336.0,"84":1337.0,"85":1338.0,"86":1339.0,"87":1340.0,"88":1341.0,"89":1342.0,"90":1343.0,"91":1344.0,"92":1345.0,"93":1346.0,"94":1347.0,"95":1348.0,"96":1349.0,"97":1350.0,"98":1351.0,"99":1352.0,"100":1353.0,"101":1354.0,"102":1355.0,"103":1356.0,"104":1357.0,"105":1358.0,"106":1359.0,"107":1360.0,"108":1361.0,"109":1362.0,"110":1363.0,"111":1364.0,"112":1365.0,"113":1366.0,"114":1367.0,"115":1368.0,"116":1369.0,"117":1370.0,"118":1371.0,"119":1372.0,"120":1373.0,"121":1374.0,"122":1375.0,"123":1376.0,"124":1377.0,"125":1378.0,"126":1379.0,"127":1380.0,"128":1381.0},"Entry":{"0":"\n\noccasional glimpse at the beaming countenance of some lady or gentleman from England who has come over here to entertain us and to minister to our higher needs, reminds me of those who are doing a similar tack in another corner of the great vineyard; the old hymns that we sing quicken every fibre in my being as I recall the times, former occasions upon which I have heard them sung.\n\nTo-day has been particularly full of such messengers of joy & consolation amid a world of sand & sorrow. The morning’s service was mentioned in my last book. In the afternoon Les & Ron & I went to a Bible Class for Soldiers in the S.C.A. Hut. The meeting was conducted by a grand young woman from England. She spoke very earnestly & beautifully to us & invited us all back again. She also asked us our names & Battalion etc.\n\nWe next drifted across the sand to the Y.M.C.A. for afternoon tea and had a chat with the Secretary there. He was a bright little spark & has a son at\n\n.\n\nCapt. Chaplain Oakley.\n\nthe front. He told us in the course of our conversation a bit of a yarn about men and heaven. A child once asked his mother if there were any gentlemen in heaven. She was surprised, at first, at the question & asked the boy his reason for making this inquiry. He replied that none of the angels which he had seen in pictures had moustaches. His mother quickly grasped the situation by saying that men only get to heaven \nwith\n by a very close shave.\n\nAfter tea we had a bright sing-song in the large Y.M.C.A. Hut. One of the hymns was \"When the roll is called up yonder, I’ll be there\". It was sung well by the boys; the chaplain pertinently remarking that there will be no A.W.L. up there.\n\nWe were then addressed by Chaplain - Captain on \"The Sentimental-Bloke’s religious Views\". The evening was completed by a \"Social Hour\" & a free bun & tea from the Institution.\n\n","1":" Dental Parade in the morning, and a Fatigue parade to remove the A.M.C. tent in the afternoon. The latter was capped by a fine cup of tea from the hospital. (Tres bon!). S.C.A. Hut in evening.\n","2":" \"Bull-Ring\" again!\n\nWe were lectured concerning Patrol work and also had exercise at entrenching with the small entrenching-tool which we carry on our equipment. The afternoon was occupied with lectures on fire control & discipline and also visual training.\n\nA gentleman gave us a fine lantern-lecture during the evening on Egypt and surrounding countries.\n","3":"\n\nI was detailed as a picquet along the road South of the camp this morning. While on duty I saw a number of Hun prisoners working on the railway line. They seemed very decent chaps & the boys seemed to think so too, for, after passing a few not very complimentary remarks about them they tried to speak to them & gave them\n\nsome Spearmint & cigarettes, much to their mutual gratification.\n\nThe women here, especially those of the poorer classes, have to work very hard. Little children are always to be seen on the thoroughfares with great baskets of eatables which I would scarcely care to carry. This morning I passed an old women & a tiny girl each laden with a great load of sticks which seemed just about as much as they could bear, and with these they had trudged at least a couple of miles. It seemed cruel that their lives from the cradle to the grave, so to speak, should be so full of suffering, but such seems to be the normal lot for them & they take it quite as a matter of course.\n\nIn one corner of our camp a number of girls & women from Etaples have a row of stalls at which they sell post-cards, chocolate etc. These people\n\nhave been there for quite a long while now with the result that they are as brazen & cheeky as one could possibly imagine. It is very amusing nevertheless to hear the boys talking to these market-people and to hear their replies, some of which, I might add, are by no means choice. It pains my heart to think that Any of Australia’s Sons should come away over here to fight for Right etc. & yet to spend their time teaching these helpless ones all the filth that they know. Who is in fault I can scarcely say. However, some of the post-cards which I have sent home, came from this market.\n","4":" Dental Parade in morning. Alan & Norman came from England to Etaples to-day.\n","5":" Dental Parade again. A fairly good concert was given by the \"Tommies\" in our mess-hut this evening.\n","6":" Our draught passed as \"efficient\" at the \"Bull-Ring\" to-day & we were immediately warned for departure to join our Battalion. As there was very little doing this morning I scaled out of camp and took a walk across the fields. These were at their best and looked grand. Along the roadsides and along the river banks were rows of tall green trees and \namongst\n amidst the beautiful grasses violets & daisies scattered themselves. I sat on the rail of a small brick bridge for a while and admired the running brook & the quietude of the scene & then wandered on again until I came upon a tiny village nestling beneath the sheltering poplars. The red-tiled roofs characterise French villages, as compared with the straw roofs in England. From the distance on can generally discern the red patches between the trees & the church spires peering above them all. Most of the houses in French villages have a large court in front in which\n\nthere invariably lies a great pack of manure straw etc. ready for use on the farms when necessary. A few fowls & a couple of dogs and a dozen or so pigeons and perhaps a cat as a rule disport themselves herein, while on either side are the stables for the horses and cows. Bails for cows seem out of the question. The milker merely ties the cows along a fence in the open field & milks them there quite easily.\n\nIn the middle of the village I saw the children playing in the school play-ground and managed to get a little boy to show me where I could get a bit of lunch. In a few minutes I found myself inside one of the village houses & Madamoiselle was not slow in placing a couple of eggs and a glass of café before me.\n\nWhile trying to put myself outside the eggs etc. a Boch Aeroplane came into sight and from every side the anti-aircraft guns started\n\nfiring their shells at it. The spectacle of an enemy plane so close to one faded into mediocrity as compared with the excitement which its presence engendered in the hearts of the Frenchies. Mam’selle & her sister rushed out to see it, and Madame came waddling out behind and for a few minutes they seemed very much purturbed. Little wonder, indeed, in view of the desolation which the invader has sown in this country.\n\nAfter lunch I returned to camp, went to the bath-parade, and then packed my kit ready for the morrow. Evening in S.C.A. Hut.\n","7":" Sunday. Breakfast was held at 6 this morning and half-an-hour later we attended Church Parade, a few of us remained for Communion. At 8.30 the draught was inspected, and by 11 we were in the train ready to start. We were in cattle trucks, but these were not at all bad. In order to improve matters a good number of us climbed onto the \n\nroofs of the carriages and from this point of vantage we saw everything that could be seen. On the way an aeroplane dashed down eagle-like and passed us within a hundred yards or so. It was close enough for us to plainly see the driver and even the details of his dress, such as goggles etc.\n\nWe passed through Amiens & got a glimpse of the Cathedral in the distance. At 3.30 we arrived at Albert. This town had been badly shelled in the earlier months of the war and is still rather desolate. Its Cathedral tower was shattered by shell fire and can be seen for miles around as an emblem of Hun outrage.\n\nAt Albert we had our tea on the green, and after being issued with box-respirators we marched 3 miles to Fricourt where we found our Battalion. The camp here is on the site of last years hostilities as can be easily seen.\n","8":" We were detailed into our Company & Battalion this morning. I am now in 1st. Platoon, ‘A’ Coy of the 19th. Battn. We did a little drill for the rest of the day, just to pass the time away. We saw a number of Fritz prisoners working, down here. They seem to have a good time and most of the boys are rather envious of them.\n\nIn the cool of the evening Alan & I sat at the end of our new home and there \"mooched\" the delightful gloaming hours away.\n","9":" After doing a few hours drill Alan & I went for a walk around the camp over some of the battle-fields of last year & the year before. All the signs of the battle still remain. The trenches, dug-outs, ammunition dumps, shell-holes etc. etc. both those of Fritz & of the Allies, bear ample witness of the bitterness of the contest. The trees that once were, are now mere phantoms, the fields are rubbish heaps & what houses there were, can only\n\nbe found with difficulty. Alan & I had walked half-way across a small village before we realised that such had ever existed. Not a tile or brick has been left intact. We came across a damaged well here, amid a mass of debris, down which a plough was suspended by its handle; apt symbol of the invaders ‘Kultur’. (at Contalmaison)\n\nWe also came across a small Church-yard with headstones etc shattered and in ruins. At the cross-roads about four shells had hit a large cross there and the figure of Christ had been knocked off & was half-buried in the debris.\n\nThe numerous little wooden crosses that are to be found all over the place tell a far sadder tale still. Even in the corner of our parade-ground, one of these stands at the end of a small mound on which a helmet still rests to remind future generations that a\n\nsoldier rests there; \"harbour after so many storms\", as one of our Latin quotations says.\n","10":" I made one of the guard which mounted at 9.30 A.M. today. My first shift was alright but during the night the rain came down rather heavily and made rather a mess of us. A few of us sat up all night around a fire which had been improvised in an old oil drum. A few of the old hands entertained us by relating their experiences at the front line. Blood-curdling stories some of them have to relate, but it is a peculiar thing that the more we hear about the horrors of war the more anxious we become to see these things for ourselves. Such is human nature.\n\nTonight we can hear a heavy bombardment taking place. The big guns are banging away incessantly. They keep\n\nthis going for hours, and at a merry speed all the time.\n","11":" At 9 this morning we left Fricourt in order to retire further behind the line for a rest. Of course we did not expect this so soon but the Battn. has had a lot of hard work lately & deserve all they can get in the way of \"holidays\". Being on guard, we acted as escort to the nine prisoners whom we had and as such followed in the rear of the Battn. as far as the Rest Camp at Senlis. We passed La Boisselle and Buizencourt on the way and put up in huts & billets at Senlis for the night. We were given leave there during the afternoon and evening. Alan & I visited several coffee houses here & imbibed of this favourite French drink. We then walked along to the villages of Hedauville & Forceville and did likewise at both places.\n\nAll of these villages have been used at one time or another \nfor\n as billets for soldiers. Practically every house has a large barn in front and therein accommodation is found for the privates. As the Front line advances however, the Allies are enabled to established proper camps at more advanced points such as Fricourt & the villages are only used as real rest-places for troops out of action.\n\nI slept out in the open with Frank Hays during the night as our quarters were over-crowded. Frank was rather drunk, having sampled too much French champagne, & accordingly he was able to supply me with plenty of amusement till sleep came upon us and lead us beyond the limits of wars & troubles & weariness.\n","12":" We continued our migration today & marched five miles through Warloy to Contay. At the latter we were billeted in a large barnhouse. About three platoons out of our company occupy\n\nChez-moi \"Contay\" and No. 6359 and No. 6390\n\nthis one dormitory. A rough frame-work has been erected inside & we sleep two deep, those underneath being on wirenetting, those on top on plain boards. The billet holds just twice the number indicated on the plan. \n\nIn the afternoon we walked to Beaucourt, and there had some café & biscuits. On the return trip we visited a windmill near Contay & saw it at work.\n","13":" Our Kits were inspected this morning and then Alan & I had a splash in the Creek that runs alongside our village. It is a beautiful little streamlet bordered with trees and with lilac bushes covered with sweet-smelling flowers, and the coolness from the sheltering boughs is altogether delightful, even on the warmest day. After lunch we had a route march for about six miles, passing through the villages of Esbart & Beaucourt. After that I walked to Molliens-aux-bois and visited a café house for tea. There I met \n\nMademoiselle Irma-Marie Andrieux.\n\nMolliens-aux-bois\n\npar Villers-Bocage\n\nSomme\n\nFrance\n\na sweet Mademoiselle (of 21 years). She is very pretty, with pink cheeks and bright eyes and quite captivated me for the time being. I promised to return & see her again before we left Contay.\n","14":" Sunday. Rest in shade by the creek during the forenoon. After lunch Alan & I walked to St. Gratien Village and after \na cup\n having a cup of café we went to the Catholic Church there. We then walked across to Molliens-aux-bois, had more café & went to church again. We returned through Beaucourt and arrived at Camp an hour late, but were let off on the first offender’s plea.\n","15":" \"Physical Jerks\" before breakfast, drill & route march during the day. After tea we walked to another village & there had some cafe-au-lait and bought a few post-cards.\n","16":" No parade in morning on account\n\nof the rain. In the evening I went to Molliens-aux-bois and had a café and biscuits at a diminutive Estaminet. After that I met M’selle Irma & spent an hour at her place. I met her mother & quite a number of others who seemed to regard me as quite a curio. I believe that no Australians have ever been billeted here before & so the appearance of one is quite a novelty. I like M’Selle partly on account of the fact that she supplies me with cider and café gratis.\n","17":" Usual drill in morning and half-holiday in afternoon, I walked to Molliens-aux-bois and visited a quiet home in a side street for a cup of café. I love visiting these places, for by so doing, one is enabled to see into the inner side of a French home & to hear, from the lips of those most deeply concerned, opinions upon the war. And besides one’s heart is\n\noften set going pit-a-pat by the sweet smiles of some mademoiselle. But at this particular place my expectations did not tally with my realisations. Instead of a smiling \"damoiselle, an elderly, rather bulky old dame prepared my coffee, and when I was drinking it she asked me about my doings etc. She then proceeded to tell me how dreadful she thought the war was & how she wished it would end. For, she told me, three of her sons had gone to the trenches, and brushing aside a tear from her eyes, she said that one had been Killed in September 1914, and she pointed, half in sorrow, half in pride, to the picture on the Kitchen wall of a fine, strapping young soldier, in the prime of existence; that was what the war had cost her. And every home in France is the same.\n\nI said ‘good afternoon’ to Madame with a heavy heart, despite my endeavours otherwise.\n\nMademoiselle Irma-Marie received my next visit, and we enjoyed one another’s chatter for a couple of hours. While there I was one more reminded that there is a war on. A neighbour came running through Irma’s house & across the street in a great flurry. The two letters in her hand suggested the cause of her haste & Irma showed me the photos of her two sons, both of whom were at the Front.\n\nIn the evening I went on to Rainneville, and returned home through St. Gratien.\n","18":"\n\nMounted guard at 9.30 today.\n","19":" I was granted leave for this afternoon, and so cleaned myself up after changing guard at 9.30 and took to the road by 11 o’clock. I intended going as far as Petit Cardonnette & only had a pass for that distance. On the road, however, I \n\nmanaged to get a lift in a village cart, and as the Mam’selle who was driving was going to Amiens I decided to go there too, especially as a lift home again was promised me. The cart seat was fully occupied & so yours truly sat on the floor in front. When near Amiens the ladies put me down behind the seat in order to dodge the Military Police. Shortly after, we arrived safely in Amiens & I dodged around for a couple of hours. I promenaded the canal & river bank for miles & saw much of the dwelling quarters of the middle & poorer classes here. The city is very large & one could walk for miles in it in any direction. It has American Electric Cars & so forth. I met an English Tommy there & he invited me to his mess for dinner & gave me plenty of good stew & bread. He asked me back for tea but I did not turn up. At one place I had a bit of fun by giving a few sous to some little\n\nMademoiselle Th. Labateux\n\nSt. Gratien\n\nPar Montigny\n\nSomme\n\nFrance\n\nFrench Piccaninnies who clustered themselves around my feet. They were very interesting to watch & to hear talking & I got my full money’s worth from them. At 6.30 I returned to the house where I had left Mademoiselle & she harassed the horse & drove me back as far as St. Gratien. There I helped her unload the sugar etc. that she had bought & then walked home the rest of the way after having squeezed her little nut-brown hand, and called forth a twinkle from the deeps of her blue eyes.\n\nOn the way back I got very hot & thirsty, but all the shops had closed & so I took the bull by the horns & asked an old gentleman, who was having an airing outside his homestead, for a drink. He took me in & sat me at a large table where the farm hands were having dinner (9.30) and put a glass & a jug of good cider before me. I drank all I wanted, said \"bon soir\", \"au revoir\" etc. &\n\ntook my leave.\n","20":"\n\nWe took our lunch to the rifle-range early this morning & returned to the billet at 2 in the afternoon after a good morning’s shooting. \n\nI went for a walk in the evening. There are a couple of French customs which struck me as rather strange at first. At about 6.30 each morning a girl goes along the village streets blowing a horn & about ten minutes later, as she returns, all the cows from the different yards turn out & follow her. She then takes them out to the fields & minds them all day & returns them as she got them. The boys call this horn the \"Cow’s Reveille\".\n\nThen again it is rather quaint to see many of the people driving their horses with one rein. However, Mlle.. Labateux explained\n\nto me that it is the nature of the pull on the rein that tells. Thus, for a steady pull the horse turns in one direction & for a jerked pull he turns the other way. Q.E.D.\n","21":" In the morning I had a fine rest under the trees by the village stream. After dinner I strolled across to St. Gratien to see Mademoiselle there. She is a fine girl of 21 summers (\nand winters too\n) and has the advantage of being able to speak English very well. Early in the evening we went together to feed the cows, and she told me how much she loved country life, & I thought country life very fine, - in contemplation or imagination, perhaps.\n\nMlle.. remembers well the retreat of 1914; she saw her own countrymen return defeated & out classed; she also saw the wounded being brought back to their lines of \nsaftdy\n safety. The Germans had gone\n\npast her village, their patrols getting as far as Amiens, 10 miles back. Out of her tiny village 40 men have been mobilised & are now fighting; at least those that \nare left\n are fighting, for 12 of these have been killed, & two others are injured so as to be unfit for further service. One of these latter I saw in the street. His arm is taken off from the elbow. Such is the price that war demands of a quiet, secluded, beautiful little country village in the midst of a wonderful landscape.\n\nAnd so one could detect in Mlle’s.. character a ring of sincerity & depth, which, methought, this baptism of sorrow had brought her. And, yet, through it all, like every other Mlle.. & matron in France, she had continued at her toil, day in, day out, from morn to eve until her hands & face were tan & her chubby fingers like bundles of steel fibres. bon esprit!\n\nin\ncomprehensible humanity\"; or join with Scott in the words of \"Solitary Reaper\".\n\n\"Behold her single in the field\n\n\"Yon solitary lass.\n\n……………………….\n\n……………………….\n\n\"The lake, the boy, the waterfall\n\n\"And \nshe the spirit of them all\n\".\n","22":" It was necessary to get an early start on this morning, for four of us had to escort 2 prisoners to Albert, which is ten miles away. On the road we were lucky enough to pick up, or to be picked up by motor lorries & so had an easy time. Our platoon was on town picquet in the evening.\n","23":" Drill all day & walk round fields in evening.\n\nTheses have been written upon many strange subjects; some have been learned, some otherwise; some humorous, some natural, some philosophical, some short, some long, but I doubt if ever the subject of \"Chats, domesticated, or in the field\" has ever received attention by student seeking renown. And yet, it has been suggested, that the chat is the one, the only, the great link that exists between the armies of a world-at-arms at this present era. We don’t know one another very well, we can’t speak our allies’ languages, etc. etc. but we are all as one in our life-long chagrin at brother Chat’s incursions into our peace of mind, and piece of shirt.\n\nStrange to say he does not realise his importance, for he invariable betakes\n\nhis well rounded form into corners of intense seclusion. How bashful! what humility!\n\nNevertheless, numerous investigators have with system & with care perused divers shirt collars, shirt-seams & shirt-tails with the result, valuable to science and to civilisation, that one is able to describe fairly clearly the general nature & habits and appearance of the \"Soldier Friend\".\n\nOriginally, I believe he was transparent in color, - if there is such a colour as transparency in the spectrum, - but, like the frog, or the Chameleon, he can & does change his spots, and stripes too. Whilst roaming abroad in forests or in the grass he is green, and as a rule wears a hungry look; when, on a monkey’s back, he is brown & looks as though\n\nhe were afraid of coming to an untoward conclusion; while on a shirt he is always the colour of dirt, to avoid detection. In this latter form their looks vary. I have known some to smile all the time; others have no time for such an extravagance; their faces are too full of soldier.\n\nBy the way, a fine, fat, full specimen was sitting on the edge of my thumb the other afternoon; he had a red streak along his back, evidently being a staff officer. He was quite offended at something; perhaps because I had not saluted him. However, it simply had to be done, and so I closed my eyes for a second, and ………… His skeleton was presented to the British Museum.\n\nIt sh\n It seemed a shame to have to act so impetuously, \nbut, his\n comrades were calling me,\n\nAnd I heard them\n, also.\n\nVarious detectives, Conan Doyle included, have suggested means whereby the hunt for \"Soldiers Friend\" may be brought to a successful conclusion. The systematic man says that the only way is to take your shirt into the light & there, stitch by stitch, & inch by inch, examine it from the start to finish, making sure that no corner is missed. Another investigator, who has thoroughly mastered the subject of \"Chat psychology\" asserts that if the operator merely stands still & makes a noise like a new shirt, \nhis will will be quickly justified\n he will be as successful as the \"Pied Piper of Hamlin\".\n","24":" A Parade to the Bootmaker comfortably occupied the forenoon and a walk through Molliens, Rainneville, Petit-Cardonnette & Allonville pleasantly passed the afternoon & evening.\n","25":" Drill now takes the form of practise stunts, or attacks. We are organised either as a platoon or Company & at the given signal, go through the process of taking an imaginary trench with fixed bayonets etc.\n\nEvening kindly granted me a few quiet hours in the Y.M.C.A. writing room.\n","26":"\n\nWe spent the day in the fields in order to see a demonstration trench-mortar barrage.\n\nIt is said that the Americans have an enormous class of gun ready for use in France. Its shell will kill anything within 8 miles of the burst & the recoil of the gun will bring up provisions for the troops.\n","27":" Alan, Ron, Norman & \"Bindy\" spend the day at Amiens.\n\n \n\nI visited the Writing Room in the morning and went for a walk to Villers-Bocage (14 kilos), returning through Raineville, in the afternoon and evening. To-day I met Lt. Cook. He is an old High-School boy & belonged to the Public Service when he enlisted.\n","28":" Writing in the morning. After lunch I visited the village of Coisy, returning through Allonville.\n","29":" We had further practice today in \ncharg\n attacking & trench-taking.\n","30":" Umpty doo! nothing doing. Will Vane is A.M.C. Sergeant.\n","31":" I had a ride in the Motor ambulance to the Divisional Rest Hospital at Warloy \nand\n today, and preliminaries over, was installed in B. Ward. This consists of two large tents joined into one and fitted up with two rows of \n\narmy stretchers. The hospital is situated in a garden and after the dirt & dust of the billets, life here is very easy & pleasant. After the first day or so I felt all right and quite able to take the full benefit of this new-found liberty. \n\nThe boys here wish they could find a brand of cigarette that would keep their temperature up, in order to be kept here for a good while.\n\nThe orderly of my ward, \"B. Pyrexia\" is Murray Sinclair, whom I knew at the Varsity. & strange to say the local Y.M. Rep is Harry Peake, also of the Uni.\n\nDown here I have noticed some of the \nfield\n toilers of the fields at work. All the cultivation is done by the old men, the women & children. In the heat of the mid-day sun I saw a man & woman & boy at it for all they were worth. The woman looked about 50, most likely with 3 or more sons at the Front and occasionally\n\n\"C’est la guerre!\"\n\nhad to take a rest, and she would lie down full length in the middle of the field. And this is not an exception; every one in France is the same; hard toil is the order of the day.\n\nA copy of \"Ruskin\" by Collingwood, borrowed from the Y.M. proved very interesting for a couple of days. The more I think of the man’s doctrine of Truth & Sincerity in all things, the more I admire his life & example. \n\nThe fact of his constant friendship with the ‘seer of Chelsea’ sufficiently commends him to my sympathy. I think his efforts to improve the outlook upon life of the world’s workers are of most noteworthy significence.\n","32":" Practically better now. I took a walk to Contay to see Alan. After meeting him, we two and Jim Brooks had café together.\n\nMiss wrote, speaking of Ken’s death. I did not,\n\nFrom \"Le Petit Chose\", Daudet. (p. 255 Collins)\n\n\"The bells of Saint-Germains also visited me many times a day. Their visits cheered me. They entered noisily through the window & filled the room with music. Sometimes joyous, giddy chimes, hastening in their semi-quavers; sometimes gloomy knells whose notes fell one by one like tears. Then I had the ‘angelus’, the midday ‘angelus’, an archangel with garments of light who arrived all shining – the evening ‘angelus’, a melancholy seraph, who rode on the moonbeams, and made the chamber humid as he shook his mighty wings.\"\n\nbecause I could not, believe her.\n","33":" Daudet’s \"Tartarin of Tarascon\" & \"Le Petit Chose\" provided good reading to-day. The former is a clever farce, Tartarin being as stupid as Mr. Winkle.\n","34":" The 56th Battalion came to Warloy last night & this afternoon I found out that Ken’s sacrifice has been accepted; his trials have ended, he has found a haven after so many storms. And yet I cannot realise that he has gone; after all, he has \nnot\n left us. I know that his presence will accompany me throughout my life, be it long or short; that which I most loved in him can never die.\n","35":" Our Battalion moved up towards the Line on Thursday morning but the doctor didn‘t think it advisable for me to join them then, in view of the long march entailed. \n","36":" Discharged from Hospital this afternoon. I travelled by the Red Cross motor to Albert & thence proceeded on the back of a three-ton motor lorry to Bapaume and eventually found the Battalion about half a mile from that town. The Second Divn.. is here as a third (?) line of defence, about 7 miles behind the front line. We are camped in tents on the downs outside Bapaume across which Fritzie imshied whilst evacuating his front line some time back. From here we can see the aeroplanes and observations balloons at the Line and at night we see the flares; and cannon-flashes and can hear plainly the roar of the artillery. At night especially things are generally pretty lively up that way, and one is apt to experience rather a queer sensation as a result.\n","37":" It rained consistently in the morning and so there was no parade. After dinner\n\nAlan and I made a tour of the ruins of Bapaume. We first visited the Cemetery. It has a great collection of fine family vaults, with suitable monuments. The work on these is wonderfully neat and very artistic in general design. Some of the brass work especially attracted our attention.\n\nOf course Fritz occupied the place for some time and buried his dead here too, and, not content with the usual wooden signs, he has erected a fine stone monument to the memory of his fallen heroes, inscribed fully with German characters & dated 1914-15. It is, roughly, 14 feet in height & represents a good deal of work of no mean standard. Needless to say, Australian & British soldiers have considered that they too had an equal right with Fritz to inscribe their names here\n\nand this they have done in grand style with indelible pencils.\n\nWe next investigated the remains of the Beet Sugar works, the railway shops & the gas works, all of which are hopelessly demolished. And, in fact, it seemed to me that it would be much easier to build a new town in the centre of the fields than reconstruct the one that once stood, so thorough has been the work of the destroyer. Not content with the devastation wrought by shells, Fritz mined the town-hall & blew it to atoms. Not a brick of it remains in place.\n\nOn one side of the town stands a huge Norman Redoubt which commands a magnificent view of the surrounding country as far as Vimy Ridge. Here Fritz had fixed his vantage point and only after fierce\n\nSome say that these skulls are French Revolution souvenirs, but this may, or may not be the fact of the case.\n\nfighting was he ultimately driven out. The bitterness of the conflict is written indelibly on the face of the landscape.\n\nBeing a bit weary we then spent an hour in the Pictures, which are shown in an old hall which has been roughly patched up for the purpose.\n\nNext door to the Picture ‘Palace’ is the ruin of a huge church, also sadly suffering as a result of shell fire. Its roof & floor are at present bundled into one huge heap of bricks, tiles & splinters, and the walls, riddled with holes, alone remain. The vaults beneath the floor are gaping open and down we went. There we found scores upon scores of human skulls which interested us exceedingly. We tried to examine them but our ignorance concerning such things obtruded itself and so\n\nwe amused ourselves by bouncing them against the vault walls. For a souvenir I procured a tooth from one of them & still have it in my pocket.\n\nAt the Y.M.C.A. we then had tea, which consisted of biscuits & preserved fruit, eaten by \nmea\n aid of the fingers, & tea, drunk from the fruit tin when it was empty.\n","38":" On account of the mid-day heat, we rise at 4:30 here & cease drill for the day at 11. Being on ‘light duty’ I did nothing during these hours.\n\nIn the afternoon Alan and I walked about 2 kilos to the Railway town of Achiet-le-grand and commenced our business there by visiting the Expeditionary Force Canteen. After that we went strawberry hunting, no altogether without success, although I am afraid many of our finds were not as ripe as they might have been. We visited the motor transport repair\n\ndepot and also had a look round the station at the various locos there. The most interesting was a petrol loco on the small guage line. This light line can be laid at the rate of 2 miles per diem and is used whenever the Front Line is pushed forward a bit. Tea was procured at the Y.M.C.A. Tent. Finding the picture show over-crowded we returned to Camp early in the evening.\n\nThis afternoon we came across two pigeon stations. The pigeons are kept in large vehicles, something like old buses, and are used for carrying messages. They are taken to and from these depots in large baskets carried by motor-cyclists on their backs.\n","39":" Drill, musketry, etc.\n","40":" This morning we were put through the details of a Battn. in attack, & \n\nin correct battle formation we stormed an imaginary objective. No opposition being put up, we were completely successful.\n\nAlan & I later went over to one of our observations balloons & made a thorough tour of inspection. The balloon itself is of the ordinary type with square basket suspended. An officer and a sergeant make the observations. Today it was 2,200 feet up, exerting an upwards pressure of 5 cmts. The most interesting part of the plant is the winding machinery below, which is mounted on a motor lorry and driven by a petrol motor specially designed for the purpose. A number of ropes hang from the sides of the balloon & when it descends the Tommies catch these & take their huge captive into a nest behind the trees. A Vickers’ machine gun, mounted on a tall tripod is always kept in readiness below in case of aeroplane attach. Fritz was shelling one of these balloons very\n\nheavily the other day, but, although he must have fired 50 shots at it, no damage was done. There are about 13 of these observers within sight from here, and about 6 or 7 of Fritz’s. However the numbers vary according to the nature of hostilities.\n\nAt 11 P.M., when we were all sound asleep, the \nalarm was\n S.O.S. alarm was sent up from the front line & we were all turned out in battle-order. Within half-an-hour, or less, the battalion was ready for the road, with transports, cookers, ammunition, bombs, officers mounts etc. complete. Messages to the effect that \nwere\n we were not needed came along almost immediately & we turned in again. An unsuccessful German raid had been made against the division to the left of our Front. As it was we were within an ace of hastening forward & everybody was quite expecting this, especially after hearing the terrific roar of the\n\nartillery bombardment which was taking place.\n","41":" Our drill to-day consisted of patrol, scout & sentry work. This diversion was easy and interesting, and I don’t know whether the officers or the privates loafed the hardest.\n\nAfter lunch we were taken for hot bath and while we were under the water our clothes were thoroughly fumigated in patent disinfecting tanks which are fitted on a steam lorry. Good-bye to the chats, …… till the next generation is bred.\n","42":" Brigade Church Parade was held in the morning by the C. of E. Chaplain in the open air. We sat around him and in the hymns were accompanied by the Band. By way of diversion Alan & I went looking for fruit, and for our pains, found a few green strawberries and some red-currants. (It is not, necessary to explain why there were not many\n\nripe fruit to be found).\n\nOur camp here is rather a novel sort of home. Although we live under canvas, a great number of the boys don’t possess regulation tents. Some live under a few slabs of bent iron, \nwar\n edifices more like dog Kennels than otherwise; others have stretched sheets of canvas over a few sticks, and in one of these places, which is about 4 feet high the middle, half a dozen lads doss. The Battalion clink was made out of a small sheet of canvas, a scrap of flat iron and two scraps of corrugated iron and in all is about 3’ 6\" high. Somewhat different from Darlinghurst!\n\nTo add to the variety, the tents have been bedaubed with a kind of cheap paint in order to protect them from aeroplane observation. The party entrusted with this decorative task had an eye for beauty, and their work deserves recognition by the Royal Academy.\n\nExtract:- \"A Magic Stone\" Robert Blatchford.\n\n\"I love diamonds – love them for their beauty, for their fire, their colour, their sparkle, their distinction. Rubies are splendid; opals have mystery; sapphires remind one of the sea; pearls are pretty in their purity. But diamonds for me. Diamonds are like stars and roses and peacock’s tails and summer clouds: they are royal; they are alive; they have souls; they drink up sunshine like champagne, and then flash out marvellous and valiant dreams. I love ‘em.\" etc.\n\nThere is imagination there!\n\nThe Y.M.C.A. hut is perhaps the best shelter here and is a fairly decent concern. Its seats & tables are very rickety and one needs to exercise a deal of care when seated \nat\n thereat. Of crockery there is none, and one has to come armed with an empty jam-tin if he requires anything moist or wet.\n\nA Battalion is a fairly complete unit in itself. Our camp thus can boast of a post-office, a carpenter’s shop (proprietor makes wooden crosses mostly), a tailor, a barber, an armourer, a bootmaker, & a canteen, most of which \nestab\n are established in impromptu tin & canvas huts about the size of a large rat-trap. The cook-house is not a fixture but is mounted on wheels, each company having its own complete outfit. The same remark applies to the transports. Thus, \n\nwithin half-an-hour’s notice, day or night, any Company can move away to any part of France, and have a hot meal ready directly a halt is called.\n","43":" Drill in the morning, 4.30-11 A.M. After dinner three of us went shooting. We picked up a hundred or so rounds of ammunition between us & erected a few bottles etc., as targets behind a bank, and let fly to our heart’s content.\n","44":" Drill and recapitulatory bombing work. At 8 P.M. our section mounted guard.\n","45":" A heavy artillery bombardment took place last night and during my 12-2 midnight shift I had a fair view of the cannon flashes & of the flares. There are a good few large\n\nnaval guns & howitzers close to our camp & these were especially active. At every shot a flame like a jagged sheet of lightning tore the darkness asunder and shortly after the roar of the explosion followed. There is something grand, even sublime in this terrific sound. Machine-guns sound like the hiss of a serpent, small cannon are common place, but the heavy artillery is imposing; like the pedal stops of a great organ. All night long & well into the next day these mighty machines rattled away, doing their best, paradoxically speaking, to save the world \nfrom\n destruction. Our artillery can alone win the war; the infantry of a modern army merely supply gun-fodder.\n","46":" Drill as usual. Our anti-aircraft guns were very busy today, and the sky was\n\ndotted in places with the smoke of the explosive shells. The planes usually keep so high that it is very difficult to hit them, but our end is attained if we can keep them to their elevation by our fire.\n\nAt night-fall we were stormed by the elements & it took all our strength to hold our tent down. Rain leaked-in everywhere. A number of tents were blown down, and their occupants suffered accordingly. When the vehemence of the downpour lessened somewhat, a few naked wretches crawled forth from beneath the canvas to readjust the tent-pegs & ropes, much to the amusement of their more fortunate \"comrades in arms.\"\n","47":" No parade before breakfast on account of dampness of lines, clothes etc. Morning’s drill consisted of live-bomb throwing.\n\nIn the afternoon the Brigade (5th..) turned out in review order to be inspected etc by Mr. Holman (N.S.W.) & Genl. Birdwood, but the gentlemen failed to present themselves. The unpleasant weather kept the thirteen inmates of our tent \"indoors\" during the evening. Of course we were soon \"in bed\" for comfort’s sake & spent the time singing. Some of the boys sing well and Ron & \"Birdy\", especially, entertained us with good & sane pieces such as \"Daddy\" \"Jerusalem\" , and some of the well-known hymns.\n\nSuch hours are to me of more than normal interest. Such tete-a-tete entertainments make one realise something of the infinite mystery & finesse of human sentiment & emotion …… \nAs we finally -over to drop \n \nWhen the sing-song ceased someone remarked \"that’s tres bon\" & we all agreed in \n\nthis & dropped to sleep in perfect contentment.\n","48":" Too wet for parade. Alan & I took a short walk around the camp. We examined an old aeroplane, a six inch reserve howitzer and a four-wheel drive motor lorry, by way of curiosity. The evening again found our happy family, like sardines, in the tent. Heavy firing continued all night.\n","49":" Church Parade in the open-air. The day was cold & inclined to be wet & we stayed in the tent most of the time, \"arguing the toss\" about one thing and another. After tea I went looking for Fritz bullets etc. as souvenirs \"de la guerre\". There are hundreds of German bullets, shells, bombs, etc etc everywhere & I only wish I had some means of sending them home.\n","50":" Drill again, in fact , \"interum iterumque\"\n\nwith ceaseless ceaselessness.\n\nAlan persuaded me to go & see Charlie Chaplin in the Bapaume pictures in the evening. On the way home we revisited the demolished church & after 40 minutes hard work succeeded in dragging down an old torn paining from one of the walls. This we tore into sections & washed & \nare\n we are going to try & post the best parts of it home as souvenirs.\n","51":" A gas-alarm was sounded sometime in the middle of last night & we all scrambled in the dark for our P.H. Helmets & wore them ‘at the alert’ for the rest of the night. In the morning we watched a demonstration ‘stunt’ by one of our platoons.\n\nAt 2 o’clock the Brigade turned out for a Memorial Service in honour of Genl. Holmes who was killed whilst in company with Mr. Holman 5000 yards behind the lines. Mr Holman, I believe,\n\nwas wounded at the same time. Four clergymen conducted the service & the band lent its very able assistance and played for us Chopin’s Funeral March. The performance was fine; a baritone reed especially made its mellow tones felt.\n\nThe atmosphere created by the afternoon’s demonstration put the boys in a happy & thoughtful mood, and correspondingly we spent a pleasant evening together \"chez-nous\". \n","52":" No parade today on account of the wet.\n\nAt 5 P.M. \"A\" Coy. was warned to get kits ready and at 6 P.M. we moved off, tents, kitchen & transport complete, and camped again about four miles on the safe side of Bapaume. Directly the tents were set Alan & I went off in search of anything we could find and soon managed to fill ourselves with fresh red currants.\n","53":" Reveille at 5.50, breakfast at 6. Our platoon then went through a ‘stunt’ with ball ammunition & moving targets. After dinner 80 of us moved off and marched to Martin Puich. This village is about 3 miles past Pozieres & is a total wreck, being literally razed to the ground. The fighting was very severe in this quarter as can easily be detected. Dud shells lie everywhere, and bombs of every description, both British & German, are as common as stones. We came upon one huge unexploded shell on the side of a dug-out. It was 15\" in diameter and about 4’ 6\" long and every time I pass it I feel somewhat awe-stricken.\n\nOur quarters here would remind one very much of a ranch. We live in tin huts, dug-outs or anything else we can\n\nfind. Our stoves consist of old oil-drums, and everything else is in harmony with these. Alan & I live in a \nshell proof\n bomb-proof dug-out lined with bent corrugated steel. It is 6’ wide 3’ 6 high and 8’ long with wood at one end and sand bags at the other, leaving a door way 2’ 6\" wide through which we gingerly crawl. With scraps of corrugated iron etc. we have constructed a rough kitchen – dining-room – etc. and in it installed the remains of a small Froggie stove. With the aid of a few Fritz bayonets & the top of a large cartridge case we fitted up a table & with a spare length of chimney pipe Alan made a drain. Our dining table is the zinc lining of a tea case and our seats are inverted oil-drums. Our axe is an old pick, our tomahawk, a Fritz bayonet. Half a \n\ndozen empty petrol tins, a \nfritz\n Fritz dixie, a Rum jar, divers pieces of iron, wire etc, complete our household belongings.\n\nTo make this Kennel more like home I have placed a photo of the family on the dug-out ceiling & Alan has put some fine big poppies in a jar which he picked up and which adors\n now adorns our main – and only – entrance. \n\nWe purchased a few things at the canteen this afternoon & so we able to enjoy \n‘some\n supper’. Alan made \nsome\n café-au-lait & this washed down very comfortably with a few biscuits. \n","54":" We all slept in till \"Cookhouse\" went at 8 A.M. At 9 we were divided into two parties, to work in shifts from 9-3 & 3-7 respectively. We were detailed to salvage certain articles from the ruins for use at the Front. These things we pulled out, loaded\n\non to motor lorries & from these transferred them to railway trucks about half a mile away. This railway is on a miniature scale with a very small guage & tiny loco’s and it runs right through the village at which we are camped and makes the place look a little bit civilised.\n\nTo-day I was on the earlier shift & our job was to salvage angle-iron and ‘corkscrews’.\n\nAfter work Alan & I \nfound\n a small truck & put it on the rails & five of us set out for the Pozieres canteen. About 3 miles away, pushing our truck uphill & riding it down. We enjoyed the latter more than the former.\n\nComing home, we were flying down a steep hill at a terrific ‘bat’ when we caught sight of a petrol loco, coming in the opposite direction on our line.\n\nIn a second we capsized our carriage, groceries & all, and waited till our opponent had passed; after that reinstated ourselves and sailed home triumphant.\n\nFor tea, Alan & I treated ourselves to sausages (tinned) and cocoa (own brew). Later on we boiled a petrol tin of water on our stove & had a fair-dinkum wash; - quite a novelty now-a-days.\n\nA quiet smoke in bed ended the day, and our \nconscien\n consciousnesses floated away amid the languid wreaths of smoke & left us, as helpless as the sons of Clovis, in the arms of the Infinite.\n","55":" We loaded timber for sleepers, angle-iron & wire to-day. We also visited and inspected a ‘Tank’ which had been put out of action & a Fritz 6\" howitzer that had suffered the same fate.\n","56":" Heavy storm last night, violent lightning and thunder.\n\nWe commenced unloading angle-iron but became drenched to the skin very quickly & had to retreat to our dug-outs. There we soon sought the warmth of our blankets & kept under them till tea- time called us forth. That function duly performed, we proceeded to Pozieres on our truck and there mounted a goods train that happened to be standing by. In this we went as far as Meaulte, about two miles from Albert. This Village is somewhat cleaner than most of its kind and its inhabitants have not been compelled to evacuate by reason of hostilities. Safely landed therein we quickly sought a shop & had a couple of eggs apiece, café etc to taste. From there we crossed into Albert by motor lorry and at 10.30 were picked up by another lorry which took us to Pozieres & there we again\n\ntook to the rails on our truck & rattled home at a great pace. We were home at 12.15 and, after a supper of dattes muscades, turned into bed.\n\nJuly 9. On the 3-9 P.M. shift to-day. During the afternoon four of the boys had an accident with one of Fritz’s ‘cricket-ball’ bombs & one of them had his right hand blown to pieces. The others were ","57":"\n not so bad.\n\nWe had an addition to our household to-day in the shape of an extremely thin cat. The rats here, however, proved too good for it and succeeded in sending the old ‘fuinmy’ back to cover with its tail between its legs – to speak in dog language.\n","58":" \"A little more sleep, a little more slumber\" was my motto this morning & the thought of a good, rich army stew alone could stir my dormant parts. Angle-iron work then occupied the rest of the day. Café-au-lait in grand style was served\n\nup for supper, & then more sleep; lazy boy!\n","59":" About ten of us missed our breakfast this morning as a result of oversleeping ourselves by an hour, and rising at 9 instead of 8. Alan & I warmed a tin of sausages for ourselves, instead, and did the mysterious concoction full justice. I think that these sausages would be very nice for our next Como picnic. We salvaged wire in the evening.\n","60":" Early shift again; wire salvage. In afternoon we visited the canteen in Pozieres & our booty included Pineapple conserve, biscuits, jam & Custard. Alan made a dixie-full of custard when we returned. He also made the jelly which was sent to me from Australia.\n","61":" I was detailed as mess orderly\n\nto day, my only duty being to ladle out the good-stuff & to wash the dixies. As a result I was able to spend most of the day writing. It is impossible to get books of a readable nature out this way & so reading is out of the question. For tea Alan & I had home-made rissoles & custard.\n\nShortly after dinner, while I was scrubbing the dixie at the water-point, King George passed through in the miniature train, about 6 feet from where I stood. Being in shirt & trousers only, I don’t supposed he thought me a very respectable sort of soldier, but, of course we all can’t be kings, and dixies \nmust\n be kept clean.\n","62":" No lorries & consequently no work to-day. I am afraid that we were somewhat of Epicurean mood as a result of this enforced idleness and, having invited\n\na visitor to tea (Norman) we promptly polished off a large quantity of custard, pineapple conserve, boiled potatoes – we found these pommes-de-terre in the village – fish, biscuits, jam, butter & tea. Not satisfied with this we had toast & café-au-lait, cheese & biscuits for early supper, and smokes & biscuits in bed last thing. The troops \nmust\n be fed, you know.\n","63":" No lorries! no work!!!\n\nAlan, Norman & myself went into Albert by lorry (motor). On the way we visited a huge mine crater (La Boiselle I think). It is so wide across that we could only throw a stone about 2\/3 \nway over it\n of the distance from one side to the other. Albert itself is quickly improving now. It will shortly be handed back to civil rule by the military authorise and already a great\n\nnumber of French families have returned and are again fitting up their homes. Shops too are again filling up & the town is quite decent already. A few months, even weeks ago, it was deserted and half in ruins.\n\nAfter visiting a few of the shops we walked through to the village of Buizencourt & there had some eggs & café. We returned to our camp by motor lorry.\n","64":"\n\nAt 11 A.M. we packed up kits & marched back to the Battalion at Bapaume.\n\nOur Battalion now has a band of its own. It is true that man cannot possibly live or even exist upon bread alone. The need for better things is strongly evidenced in the desire of each unit to have a little music ever to hand. Although still in its infancy, the band gives us a few very \n\ndecent selections each evening and during this time I really enjoy life in the fullest degree. Soft strains of harmony in a world of apparent discord! what a pleasing contrast!\n","65":"\n\nA section of us \nwere\n was picked for special bayonet instruction to-day. A Scots Sergeant, of the Guards, is our instructor and for three days we are to be put through a course of physical training and bayonet work. The course is strenuous but very interesting. It will help us to be confident in any hand-to-hand encounter which may come our way.\n","66":" Too wet for parade.\n","67":" Physical training & Bayonetting. After lunch I walked to Achiet-le-grand to have a look at the magazines etc in the \n\nlarge Y.M.C.A. there & returned home by lorry.\n","68":" Drill again in morning. At 10 P.M. we were awakened and the Brigade went out \nfor a s\n on a stunt across the fields. After a bit of night-manoeuvring we returned at 1.15, and had a cup of tea before turning into bed again.\n","69":" No drill; Sleep in to make up for the work last night. I was a bit tired, having acted as scout for our officer during the stunt.\n\nAt 8 P.M. I was one of a trench picquet. This duty was an easy snap.\n","70":" Picquet all day. At night we went to a good concert given by the local \"Tommy\" transport (?) corps.\n","71":" On Picquet till 8.30 P.M.\n","72":" drill per usual.\n","73":" Wet day, therefore no drill.\n","74":" Drill in morning, bath-parade after dinner.\n","75":" We went through a stunt today in trench work, especially with regard to the relief of bombing parties against counter-attacks.\n\nWe marched three miles to the scene of operations, (which, by the way, was one of the trenches actually occupied a few months ago,) and returned after dinner feeling very hot & tired.\n\nA cool bath proved to be an excellent antidote.\n","76":" We packed up camp this morning and by 3 P.M. not a stick or a stone was to be seen on the ground which we had occupied. At this hour we set out on an 8 mile march for the railway line. As the day was extremely hot we felt the march\n\nvery much & a few score of the lads fell out before reaching the destination. At the end of the march we had a dip in a stream which ran near by & after having a bit of tea entrained at 9. The whole Battn. including transports & horses went in the one train which was about as long as the average goods train in N.S.W. We were in cattle trucks, of course, but made ourselves very comfortable, and slept all night like a litter of kittens, with legs & arms & heads & bodies \nin an \n tangled in every possible manner. In this way we are able to keep warm, and also with a little difficulty, to find a soft, warm pillow.\n\nOn the trip we passed through Albert,\n\nAmiens, St. Pol (6 AM) Berguette and","77":" arrived at St. Omer at 10.30. Here we detrained and proceeded 3 ½ miles a pied to Arques. On the way we marched along the bank of a fine canal, crowded with barges and bordered with tall green trees. At the Village itself, our billet consisted of a clean large, airy hay store, the floors of which were covered with fresh straw for us. The village is much cleaner and better looking than any we have yet seen. This is due partly to the fact that the war never extended its devastation here, \nas d\n partly to the fact that the district is a manufacturing one as well as agricultural, whereas the other districts were purely agricultural. The people also treat us much better\n\nsince they have not been \"spoiled\" by countless battalions of our troops beforehand.\n\nIn the afternoon I had a good tour of inspection through the village, and tasted their eggs & café.\n","78":" At 10 our sergeant, a private and myself set out as an escort party to Amiens, in order to bring one of our prisoners from that place to the Battalion. We spent an hour in St. Omer and left by train at 2.15. Calais was reached at 4. On this trip, which we had expected to be a short one, we were without provisions \nand\n but willingly shared a couple of loaves of bread & sausage meat with some soldiers who occupied the same carriage as ourselves.\n\nWe saw a couple of women unloading\n\nbricks from a railway truck, in this way \"doing their bit\".\n\nWe later passed Boulogne & Etaples and detrained at St. Poch at 2 A.M.\n","79":" from there we walked abour four miles to Amiens and after reporting to the R.T.O. I had a walk around the place while the other two had a nap in the Y.M.C.A. I had a glance at the Cathedral, at the \nmarkets\n city markets, (which are much like Paddy’s) also at the markets on the canal. These latter are very busy and it is interesting to see all the Froggies bargaining for their carrots, plums, cabbages etc.\n\nOn my return an M.P. questioned me re a pass & not being satisfied with my explanation he accompanied me back and woke the sergeant\n\nin order to identify me. Of course he may as well have saved himself the trouble.\n\nThe Provost authorities allowed us to remain in Amiens until 11 next day and so we had ample opportunity for having a good rumble round the city. The only hindrance was the fact that we were soon penniless & none of the banks would assist us in our dire need.\n\nNevertheless we saw everything that was to be seen, and smiled at all the bright \"froggy\" girls, and looked at the shops, and parleyed with the French \"soldats\". We had decent meals at the barracks, & also slept there at night.\n","80":" We escorted our prisoner to the train at 11 A.M. The train was a French passenger one, carrying, for the most part, holiday makers from Paris to the various \"plages\", and mutually, we had quite\n\na bright time. Two dogs, one a very small one, the other very large, helped to add to our amusement, especially as the very large one would not keep still & persisted in annoying the Melles.. We spoke to a very nice young married woman, with a little boy about 4 years old, both of whom were proceeding to Switzerland to see their wounded prisoner hero. He was the boy’s father, & had been captured early in the war, by the Germans.\n\nOur \nwhite\n military bread was quite a delicacy in the eyes of our civilian friends & we shared our rations with them, much to their delight & to our surprise.\n\nAt 6 P.M. Calais was reached and as \nthe\n our next train was not due till 6.40 we slipped off to the nearest Church Army Hut for a drop of tea. As we only had 3d between four us, we had to \"borrow\" 1d from an \"Ausie\". By the time the war is over, we will all be professional bludgers. In the train from Calais to St. Omer some French soldiers\n\nMlle.. Louisa Papillon.\n\na Journy\n\npar Licques\n\npas de Calais\n\nFrance.\n\nkept us company. After reaching St. Omer at 8.30 we walked to Arques, to find that the Battn.. had moved away. Back to the Provost at St. Omer we came & he put us up in the Barracks for the night & breakfast. \nAt 8.30 we\n","81":" At 8.30 we returned to the train & went 11 kilos to Lumbres & thence a four hours walk across country to the small village of Journy, where our Company was billeted. Here we were paid and went off immediately in search of fried eggs. We soon found a lady who was willing to supply our need to the extent of three eggs apiece. She also had a nice wee daughter.\n\nThe district here is much more hilly, and the weather much wetter than the Somme. In fact, parts of the valleys remind me of the Kangaroo Valley in N.S.W. The village is well removed from military incursions & is beautifully quiet & undisturbed. The people likewise are much more straightforward towards us than are\n\nthose in places constantly visited by troops.\n\nOur billet \nwas\n is of the usual type, with plenty of straw on the floor. In one compartment of this building the straw was heaped up to the height of about 8 feet & on top of this Alan & I made our nests. The proprietor turned us off it once but directly he turned his back we were up again & there remained to the end of our sojourn.\n","82":"\n\nThe day being too wet for parade, lectures were given us by the officer & N.C.O.\n\nIn the evening, we again sought our egg-house & after that I had tea with the family there & wrote for the rest of the time on a little round table which Mlle.. placed near the fire for me.\n","83":"\n\nWet again! lectures again in the forenoon. After dinner we had a short route march. The country crossed was grand. The red roofs of the villages in the green\n\nvalleys looked extremely picturesque.\n\nIn the evening, more eggs & chips at M. Papillons’.\n\nthe\n Nearly all the lads were very drunk tonight & for a few hours the mirth ran very high in the billet.\n","84":" The Brigade turned out for an all-day stunt, which proved not too successful.\n","85":" The Brigade Stunt was repeated to-day. I was on the Village Picquet till 10 tonight.\n","86":" We returned to Arques today, marching, in all, about 28 Kilometres.\n","87":" A parade was called for today, and we were marched to a lake near by & had a fine swim in it. The fact that bathing-pants were lacking did not embarrass us in the slightest, indeed it added to the pleasure of the swim.\n\nIn the afternoon I went for a walk along the canal to Renescure, 5 Kilos away & after buying a few cards & a cup of tea, returned to camp.\n","88":" The Battalion went through a stunt this morning which consisted in advancing through a wood in scouting order. After lunch we had another swim.\n","89":" More wood-stunts, scouting & skirmishing etc.\n\nIn the evening Norman & I walked in to St. Omer, 5 Kilos each way.\n","90":" I went on leave to St. Omer today from 9 A.M. to 8 P.M. Not being interested in the Estaminets etc, I wandered all round the city, up the main streets, down the lanes, along the canal banks, & in fact everywhere imaginable. The town is of a fair size & can boost of a fine cathedral and several large churches. The cathedral has a magnificent pipe-organ, the richest in design\n\nby far that I have ever seen. One of my post-cards shows it. The edifice itself is several centuries old & its great walls & beautiful ornamentation are very striking to the casual visitor. I should guess that one could purchase a house almost for the money that was spent on the pulpit alone!\n\nIn looking around a town such as this, one is touched by the thought that these streets & many of the dwellings & public buildings belong to past generations; tradition here has a significance unknown in the land of my birth and one’s soul is filled thereby with vague imaginings. What wonderful tales some of the tenements could tell, if only they had tongues!\n\nThe park & gardens are especially delightful. The trees are wonderfully shaded in colour, & the flower beds are superb; in fact I \nwhole gr\n must confess that the few hours spent in this spot are amongst the best I have yet known in this country. Far from the madding \n\ncrowd, left alone to my own meditations, in the midst of nature’s rarest beauties, what else \ncould\n one desire? Much, of course, but for the time being I was satisfied.\n\nI had tea at the Church Army Hutt & \ngot b\n was back at Arques by 9 o’clock.\n","91":"\n\nChurch Parade was held this morning in a \"Froggies\" Courtyard. \n\nIn the afternoon I went again to St. Omer, and heard an English Military band playing in the Gardens. The music was really good and with \nthe\n its admirable environment, quite captivated my fancy. For the time being I was in the land of phantasy & delight & felt something like a Khaki Alice in Wonderland.\n\nOn returning to billet in the evening I discovered that Jack Rew had been waiting for me since 3 o’clock. However, I \n\n- La France. –\n\nI.\n\nConnaissez-vous les plaines.\n\nLes plus riches au soleil,\n\nLes coteaux paris de chenes!\n\nOu de ceps au grain vermeil?\n\nlee pays d\"abundance.\t\t\t)\n\nC’est la Patrie, oui, c’est la France \t) bis\n\nII.\n\nConnaissez-vous la terre\n\nOi l’honneur suit le drapean?\n\nOi plus grands aux gris de guerre.\n\nLes enfants sont des heros?\n\nlee pays de vaillance\t\t\t)\n\nC’est la Patrie, oui, c’est la France\t) bis\n\nIII.\n\nConnaissez-vous encore\n\nLe pays d’egalite?\n\nLe pays ou lui l’aurore\n\nDes grands jours de liberte!\n\nlee pays d’esperance\t\t\t)\n\nC’est la patrie, our, c’est la France.\t) bis\n\nCopied from Mlle.. Papillon’s exercise book\n\nstill was able to spend half-an-hour with him & it was many a long day since I had had such a grand little chat. I felt tremendously proud of him, with his fine outfit & stars & horse & no doubt his mother would have been as proud had she been there too. He is camped about 10 miles from us.\n","92":" Wood stunts today.\n","93":" Route march today; fairly tiresome. Mounted guard at 8.P.M.\n","94":" On guard all day. Pay of 40 F.\n","95":" A \"bull-ring\" has now been improvised for us in an old quarry about 3 kilos from the billets & here we were put through a series of trench-bombing-raids, including reliefs of bombing sections & platoons. We also did a bit of range-shooting. The evening was spent in the new\n\nY.M.C.A. tents here, which are being managed by Harry Peake B.A.\n","96":" Bull-ring again! The platoon made an attack on a supposed \"strong-point\". Physical exercises, organised games on the grass & bayonet-work occupied the rest of the day.\n\nI finished \"Farewell, Nikola! by Guy Boothby to-night. It is a weird story, and its weirdness is hardly justifiable, in my estimation. I am reading novels at present, because I can’t get anything better.\n","97":" We had our blankets etc. fumigated in the portable disinfect machine this morning. After dinner we were inoculated. Sore arms are the fashion now! Beastly fashion, isn’t it?\n","98":" St. Omer attracted us to-day. It being Sunday, I expected to hear the Cathedral organ in the evening, & for this reason particularly I visited the place. The day was perfect, & in the afternoon the N.Z. Military Band played some selections in the park. Towards tea-time my inoculation made itself felt & I had to clear back to billet as quickly as possible, procuring a few pills from Willie Vane on the way.\n","99":" I went on sick parade this morning and had the day off & passed the time reading \"Under the Red Robe\" by S. Waymen. It is an historical romance of the early 17th Cen. & gives a glimpse of France under Richelieu’s strong hand. The tale is a good one, and the plot is poetically just.\n","100":" Wood stunts & drill to-day. I turned into bed early & had a read by candlelight before going to sleep.\n","101":" We marched to the canal-bank & there heard a lecture on the latest German gas, commonly called ‘mustard’ gas.\n\nThe afternoon was a half-holiday.\n\nAlan and I visited the Arques glass-works & saw the complete process entailed in producing tumblers, wine glasses, liqueur glasses, lamp-funnels etc.\n\nThe process itself was exceedingly interesting, but my attention \ndirected\n was drawn chiefly to the workers themselves. There were worn out, emaciated-looking men, girls, and boys, many of very tender years, like so many \nother earthly\n devils in a little hell of their own. Some worked around the furnace filled with molten glass, others carried bits of this on long blow-tubes, others blew it & so on. (Of course all our cigarettes & matches soon leaked out of our pockets.)\n\nI noticed, one wee chap in particular: he had to set a mould for the blowers & was kept busy\n\nall the time, without a moment’s respite & when we saw him he was dead tired & could hardly keep awake, and yet he worked on, scarce noticing what he was doing, with mechanical exactness, and the monotony therein entailed. I almost wished that I could change places with the child, in order to let him see & feel & know something of what life \nholds\n can mean, but, alas, circumstances bind him perhaps for all his earthly days to nothing but ceaseless toil, & without hope of attaining anything better than his present condition. Any yet he smiled sweetly at us as we watched him. \n\nWe tried our hand at some of the jobs which the young girls do and were amazed to find how heavy were their tasks.\n\nIn the evening a few of us joined in a Felllowship discussion on ‘Prayer’ with Mr Peake. I finished \"Salthaven\" by W.W. Jacobs, but \n\ndid not think much of it. It lacks strength & is somewhat scrappy in \nmy\n opinion, although it has been favorably reviewed by others.\n","102":" We marched along the canal-bank this morning & at one point were reviewed by Lt. Gen. Birdwood as we passed.\n\nThere was a bath parade after lunch.\n\n(Birdwood is in charge of all the Australians on the Western Front).\n","103":" We had an easy time in the wood today, and chiefly occupied our time in throwing bombs.\n","104":" Boot-Parade in morning, followed by a lecture after lunch.\n\nFrom 6.30-10.30 P.M. we were on town-picquet and slept in another billet for the night. Supper, consisting of tomatoes & French brown bread was supplied by the officer of the picquet.\n","105":" Sunday. I took a stroll along\n\nthe canal bank & saw the locks working. I then had lunch of steak & chips in St. Omer and heard the band in the afternoon.\n\nIn the evening we held a little sing-song service in the Y.M. & I had the pleasure of playing the hymns for the boys & this reminded me vividly of old times.\n","106":" The 2nd Divn. was inspected by Major. Genl.. Smythe this morning, and we had a half-holiday after dinner. Ruskin’s \"Unto this last\" was finished this afternoon. We held a Fellowship meeting in the Y.M. after tea.\n","107":" ","108":" Divn. was reviewed by Field Marshal Haig to-day. He remarked on the good turn out & clean equipment.\n","109":" I was on picquet at a street corner in Argues, commencing at 10 A.M. \nWe sl\n The picquet slept in the school.\n","110":" Picquet changed at 10 A.M. & I had the rest of the day to myself, \nand woke\n writing in the morning & walking to St. Omer in the afternoon.\n\nWe had a bright & merry evening in the billet during the evening hours.\n","111":" Another day in the wood. We had quite a picnic there, very little drill and plenty of blackberries.\n\nFellowship meeting in evening.\n","112":" Church Parade in morning.\n\nAfter lunch I walked through Renescure (5 K.) to Ebblinghem (3K.) and thence to Blaringhem (5.2K.) At the latter town I had tea of four fried eggs & coffee. During the trip I visited two churches and found the pictures especially, rather interesting. The various interpretations of the \"Stations of the Cross\" by different artists are rather quaint (to the non-conformist mind, at any rate.).\n\nI called to see Jack Rew at Ebblinghem on \n\nRuskin:-\n\n\"We need examples of people who, leaving Heaven to decide, whether they are to rise in the world, decide for themselves that they well be \nhappy\n in it, & have resolved to seek – not greater wealth, but simpler pleasure; not higher fortune, but deeper felicity; making the first of possessions, self-possession; & honouring themselves in the harmless pride & calm pursuits of peace.\" \"Unto this Last.\" p 191\n\nthe return trip, but accidentally missed him. After 10 this evening several Fritz planes bombarded St. Omer & for a while things were very lively; search lights were playing & anti-aircraft guns booming quite incessantly, and machine guns rattled like Kettle-drums. The planes returned twice and did a fair amount of damage in the town.\n","113":" Wood-stunts again, the new method of attack being explained to us by the Brig-Genl..\n\nFellowship meeting in evening.\n\nAnti-aircraft guns very much alive all night.\n","114":" Route march & ‘march-past’ the Brig. Genl..\n","115":" Route march all day. In the evening we were looking forward to a little more bomb excitement but it did not come.\n","116":" A Long march and a divisional\n\nstunt occupied the whole of the day. We went through an advance similar to that shortly to come off in the line.\n","117":" Drill in morning and holiday in afternoon. After tea three of us escorted a prisoner to Renescure. (4K.)\n","118":" \"Bull-Ring\", all day. We went through a series of trench-raids etc.\n","119":"\n\nSun. 9. Writing in morning. Walk with Alan afternoon & evening along canal & round. tea at St. Omer.\n","120":"\n\nDental pde. Pde 11.30 A.M. & Stunt shortly to come on explained to us. Details \nfor not wri\n lost not written.\n","121":"\n\nUp at 2 A.M. to go through the stages entailed in the stunt. General rise of spirit in anticipation of coming event, which will be a big thing. \n","122":" Pack up & march Arques to Steenvoorde & sleep in barn on hay, walk in evening.\n","123":" up at 5.30. \nmarch in battle order\n leave pack & march two kilos past Dickebusch in \nBelgium\n & abt 6 miles from line Sleep in building, no room in tents.\n","124":"\n\nHouse too far from rest of Coy. canvas humpy to big \nwire stilts & canvas\n few shells about\n","125":"\n\nNothing to do all day. About 15 Fritz planes lively time, M.G.’s & antis heavy bombardment all night.\n","126":"\n\nvery cold last night guns going all day long, heavy artillery duel for few hours in morning - 14 friz planes over, I gather dozen of planes, both sides, everywhere in clouds etc. \n& direct a\n pay of 40 Fs.\n","127":" stand by all day & go into reserves in evening. past guns etc. hell-fire corner gas-alarm (false), bags of tucker.\n\nReserve trench very rough. plenty of shelling all the time, day & night. very little sleep.\n","128":" Artillery \nbombardment\n duel for about 1 ½ hours continuous. shells everywhere, planes directly fire men very cool, walk about in open. member of one party reading paper on the way up, dirt & water flying \nthree\n three of our boys buried in dirt.\n\n"}}