{"Document Name":{"0":"Diary_0005","1":"Diary_0005","2":"Diary_0005","3":"Diary_0005","4":"Diary_0005","5":"Diary_0005","6":"Diary_0005","7":"Diary_0005","8":"Diary_0005","9":"Diary_0005","10":"Diary_0005","11":"Diary_0005","12":"Diary_0005","13":"Diary_0005","14":"Diary_0005","15":"Diary_0005","16":"Diary_0005","17":"Diary_0005","18":"Diary_0005","19":"Diary_0005","20":"Diary_0005","21":"Diary_0005","22":"Diary_0005","23":"Diary_0005","24":"Diary_0005","25":"Diary_0005","26":"Diary_0005","27":"Diary_0005","28":"Diary_0005","29":"Diary_0005","30":"Diary_0005","31":"Diary_0005","32":"Diary_0005","33":"Diary_0005","34":"Diary_0005","35":"Diary_0005","36":"Diary_0005","37":"Diary_0005","38":"Diary_0005","39":"Diary_0005","40":"Diary_0005","41":"Diary_0005","42":"Diary_0005","43":"Diary_0005","44":"Diary_0005","45":"Diary_0005","46":"Diary_0005","47":"Diary_0005","48":"Diary_0005","49":"Diary_0005","50":"Diary_0005","51":"Diary_0005","52":"Diary_0005","53":"Diary_0005","54":"Diary_0005","55":"Diary_0005","56":"Diary_0005","57":"Diary_0005","58":"Diary_0005","59":"Diary_0005","60":"Diary_0005","61":"Diary_0005","62":"Diary_0005","63":"Diary_0005","64":"Diary_0005","65":"Diary_0005","66":"Diary_0005","67":"Diary_0005","68":"Diary_0005","69":"Diary_0005","70":"Diary_0005","71":"Diary_0005","72":"Diary_0005","73":"Diary_0005","74":"Diary_0005"},"Date":{"0":"unknown","1":931.0,"2":932.0,"3":933.0,"4":934.0,"5":935.0,"6":936.0,"7":937.0,"8":938.0,"9":939.0,"10":940.0,"11":941.0,"12":942.0,"13":943.0,"14":944.0,"15":945.0,"16":946.0,"17":947.0,"18":948.0,"19":949.0,"20":950.0,"21":951.0,"22":952.0,"23":953.0,"24":954.0,"25":955.0,"26":956.0,"27":957.0,"28":958.0,"29":959.0,"30":960.0,"31":961.0,"32":962.0,"33":963.0,"34":964.0,"35":965.0,"36":966.0,"37":967.0,"38":968.0,"39":969.0,"40":970.0,"41":971.0,"42":972.0,"43":973.0,"44":974.0,"45":975.0,"46":976.0,"47":977.0,"48":978.0,"49":979.0,"50":980.0,"51":981.0,"52":982.0,"53":983.0,"54":984.0,"55":985.0,"56":986.0,"57":987.0,"58":988.0,"59":989.0,"60":990.0,"61":991.0,"62":992.0,"63":993.0,"64":994.0,"65":995.0,"66":996.0,"67":997.0,"68":998.0,"69":999.0,"70":1000.0,"71":1001.0,"72":1002.0,"73":1003.0,"74":1004.0},"Entry":{"0":"\n\n","1":"\n\nChurch Service in paddock close to our billet this morning. The remainder of the day was spent in writing and strolling about the village. Big guns are still booming, some being of large caliber judging by their distinctive very loud reports. We now learn that an offensive has commenced on the Somme, hence the firing lately. This gives some idea of the distance sound will carry.\n","2":"\n\nRumours that we may shortly expect to be moving up near Armentieres. All our Divisional troops round this district were today put under tests in ordinary Chorine Gas and Tear Gas. For the former, men were massed in the centre of the paddock, ordered to put on gas helmets, and then the yellow\n\ngreen clouds produced by the liquid being allowed to escape from large cylinders, enveloped the body of troops. They remained under those clouds for some minutes but the helmets everywhere proved successful. Whilst awaiting our turn the wind changed bringing some of the gas over to where we were standing. We only waited there long enough to get one sniff. With regard to the \"tear\" gas we were marched past a hedge behind which weeping gas bombs were exploded. As we approached one particular spot our eyes began to show the effect of the gas. It is perfectly harmless except that the eyes are painful for days afterwards. The guns on the Somme are still going and this morning’s papers report good news.\n","3":"\n\nHearty firing at times \n\nOn Piquet all day and writing letters in spare time.\n","4":"\n\nIssued with 2 Gas Helmets each and a satchel to carry one in. The other is to be kept in a pocket we have been told to sew on the inside of our tunics. Small bottle of Iodine and weeping goggles issued. Guns still to be heard. First pay in France resulting in many cases of drunken disorder.\n","5":"\n\nRoute march. In afternoon inspection of Gas Helmets and more pay. The scene at our billet was disgraceful tonight. Half the unit were under the influence of drink. The officers didn’t know what to do about it. Numbers were . Antiaircraft guns again busy.\n","6":"\n\nRaining. In morning filling water tanks of Ambulance Waggons preparatory to moving off tomorrow. Steel Helmets issued. The roads are fearfully muddy.\n","7":"\n\nStarted out at 9 a.m. carrying all our belongings and two blankets and entered upon a heavy march of 11½ miles over rough cobble-stone roads. 1000 out of 4000 dropped out up to mid-day. This refers to infantry. Of our Section none dropped out. Passing through Merville we reached Estaires about 4 p.m. and slept in the old Town Hall building for the night. There was an air fight this afternoon resulting in the Fritz plane backing out.\n","8":"\n\nEstaires a busy sight\n\nthis morning with military movements. We marched out at 10.30 a.m. passed through Sailly, Bac St. Marn & Font Rompu to a farm house in Erquinghem. Observation Balloons and aeroplanes busy overhead. We made ourselves comfortable on the straw in a barn. Milk butter & eggs are plentiful and the Farm People are very nice. Guns hidden amongst the trees nearby opened up but had not fired many shells before Fritz returned a few which landed so close to our guns that they remained silent for the rest of the evening.\n","9":"\n\nSlept well during the night and did not hear the gas alarm which sounded about midnight. Fattening up on eggs and milk throughout the day. Helping the house people to milk cows and make butter. 4 new\n\n60 pounders arrived today and have been put in a paddock close by. Germans again located a battery well. Not moving tonight – postponed till the morning. We were to have taken over the Brewery at Fort Rompu from the 4th Field Ambulance. Heavy bombardment opened up tonight.\n","10":"\n\nMarched out about 9 a.m. in small groups to the Brewery at Fort Rompu noticing in the distance the battered Church spire of Armentieres. All this district is occupied by civilians. In fact they live closer to the line than Fleurbaix and this village is only about 1½ miles from Fritz. The Brewery is in good working order. Some parts of the buildings are occupied by the Ambulance and other parts by Wireless Headquarters and Artillery Headquarters. Most of our\n\n\"C\" Section men have been sent to the trenches whilst our \"B\" Section are running baths at Erquingham. Wounded are now coming in from the line. Our billet is a concrete floored loft in a huge two storey building. Heavy guns kept me awake for hours.\n","11":"\n\nNothing to do all day – writing etc. More of \"B\" & \"C\" Sections sent to trenches. Wounded continue to come in, some in fearful condition. Conversing with \"Tommy\" Artillerymen this afternoon. They say that before the Australians & New Zealanders came to this part of the front things were pretty quiet. A kind of understanding seems to have existed between the Tommies & Fritz. If one didn’t fire the other wouldn’t, but now the Australians have started knocking things about.\n\nOn Piquet tonight and for the first time I saw star shells. They make a fine fireworks display.\n","12":"\n\nOn Piquet all day in charge of Gas Gong. Three of us, whilst walking through the village tonight were hailed by civilians to do a little favour which required \"First Aid\" \"experience\". London Rifle Brigade arrived from Ypres, also the Shropshires. Some of our division came out of the trenches today, having been relieved by the \"Tommies\". Antiaircraft shelling throughout the day.\n","13":"\n\nGuns have been silent for two nights. Royal Garrison Artillery with 60 pounders leaving last night and this morning. More arriving to take their place. More of the Rifle Brigade & Shropshires arrived.\n","14":"\n\nMore guns arriving. The wounded who came in today were a grim sight – two having died in the Ambulance Motor.\n","15":"\n\nTwo of us were given a job of making the Operating Theatre Gas Proof. Later in the afternoon we were asked to make two operating tables as fast as we could. Evidently something is expected. The arrival of troops and guns seem to suggest it.\n","16":"\n\nOrders this morning stated that an offensive movement had been planned for today but it has been postponed till Wednesday. It is rather strange that such orders should be circulated when they are generally kept secret.\n\nAeroplanes were very busy today.\n","17":"\n\nAssisting in the making of letter boxes for our O.C. and then commenced to make the big dugout behind the Brewery gas-proof. The sky was spotted with numerous planes including a few Germans.\n","18":"\n\nWorking hard at dug-out and finished it in the afternoon. 12 Aeroplanes up. On Piquet at night. Just before 6 p.m. a frightful bombardment opened up indicating that the attack is being made. The deafening roar and clatter of these guns was such that I shall never forget it.\n\n20th July (Thursday)\n\nI had just settled in bed when, at 1 a.m., every stretcher bearer was ordered to dress and fall in prepared for the trenches to assist in clearing\n\nthe wounded away. We moved down the sides of roads under shelter of the hedges to the Rue du Bois, Fromelles, known to us as Rifle Farm. Star Shells were flashing out in the darkness and guns barked from all round us. When least expected, a terrific report form a heavy gun would almost throw us off the earth. We watched with a look of dread the artillerymen with their tunics off, charging the guns as fast as they possibly could. It was a fine sight. Down this road we continued, passing a parapet behind which the reserve troops were sheltering, whilst every step seemed to be a dangerous one. Surely the world has never before known such a terrible night as that which confronted us. The awful din and chaos in the trenches were\n\nproceeding from the spot we would have to enter in a few minutes.\n\nWe reached a battered building known as Two Tree Farm where a heap of stretchers awaited us. The order given us was something like this \"Two men to a stretcher and get across this piece of land to Rifle Villa\". Well, we started off – doubling for about 20 yards then falling on to the ground and so on to our destination. Bullets were flying past in hundreds. My word they had me bewildered. My friend Stan Wilson & I on arriving at Rifle Villa saw the frightful result of war. Here the wounded were lying in dozens and dozens were arriving from the trenches in front. We picked up our patient from amongst these\n\nmangled human beings & carried him right back to the Motor about 1½ miles along the road, but this time we took no notice of bullets or snipers. Prior to coming into action we had been ordered to leave our \"Red Cross Brassards\" off because they present a target. This first trip of ours was too far altogether considering that we might have to carry thousands out. However, luckily enough, the Motors were brought closer to the line thus shortening our carry. The first trip I have referred to was very exhausting - On returning to Rifle Villa my mate and I were included in a party of six sent up the communication trenches to the Regimental Aid Post up in the support trenches. We carried stretchers with us passing on the way a large\n\nbatch of German Prisoners being escorted out, one of whom exclaimed \"Trip to London\". Continuing up this trolly line to old battered walls we at last came to the sap that leads on to the R.A.P. No sooner had I entered this sap \"Piney Avenue\" than a bullet struck my steel helmet and nearly knocked it off my head. The sound caused my mates in front of me to look round. Happily the bullet came at an angle so that the roundness of the helmet caused it to glance off. Moving on up \"Piney Avenue\" to the R.A.P. we kept pretty low and at times nearly lost our breath dodging high explosives and bullets. At the R.A.P. Stan Wilson & I in company with two of the others were told to go up into the firing line and bring wounded out. The long\n\ncommunication trench which took us into the firing line was torn about with high explosives. Shrapnel was bursting in the air above us and machine gun bullets hit the sides of the sap in hundreds. Dead lay about on all sides and wounded were coming through though very slowly on account of the trench being used by so many troops. It is also frightfully narrow. On arriving at the firing line grim sights confronted us. Dead & wounded lay in heaps behind the parapet and worn-out Australians crouched close under cover. The looks in their faces and on the faces of those lying on the ground greatly impressed me. Chaos and weird noises like thousands of iron foundries, deafening and dreadful, coupled with the roar of high explosives on coal-boxes as they ripped the\n\nearth out of the parapet, prevailed as we crept along seeking first of all the serious cases of wounded. Backwards & forwards we travelled between the firing line and the R.A.P. with knuckles torn and bleeding due to the narrow passage ways. \"Cold sweat\", not perspiration, dripped from our faces and our breath came only in gasps. The communication trench was about 1½ miles long. By the time we had completed 2 trips (six miles) with the numerous zig-zag turns in the trench and the stoppages caused by the traffic up and down, we were weak and completely exhausted. Stretcher-bearing is no light work. After this second trip the regimental doctor happened to notice our condition and those words of his will remain stamped in my memory for all time. Gaining a second wind we did two more trips\n\nto the firing line and were then sent back to Rifle Villa with a patient to enable us to get a drink of tea. It was now 10 a.m. and we hadn’t had a drink or anything to eat. Things were quietening down a bit in the front line and the rush was gradually dying off by now - Another party from our Ambulance were sent up the line and we continued from 10 a.m. till 6 p.m. carrying the wounded across to the Motor Ambulances at Two Tree Barn from Rifle Farm. The distance was not very far and the bullets had ceased to fly about - Earlier in the day one of our men was hit in the leg about this spot. After 6 p.m. Motor Ambulances left with only one or two stretcher cases inside, indicating that the wounded had been nearly all evacuated. The remainder of our troops, those who managed\n\nto get back from the German Lines were being relieved from action and quietness prevailed as darkness set in. So the adventure proved a failure though at different stages of the battle cheerful messages came through as follows \"They are into the 4th line\" – \"Complete system of German trenches taken and being held at all costs\" – \"Some are through into the village of Fromelles\". Then, when we finally heard of the failure, various reports and opinions flew round. There is no doubt, however, but that orders were not adhered to, inasmuch as some troops went further than they should have gone.\n\nNote In this report of our first engagement I am able to give it more fully than was possible at the time, seeing that this account is being rewritten months afterwards. Therefore I am able to include \n\nextracts from papers which I consider the most reliable information.\n\nAt midnight we returned to the Brewery after a strenuous and never-to-be-forgotten event. The only meal we had throughout the 24 hours consisted of a few dry and hard biscuits.\n\nLast night at 6 p.m. just before the attack commenced Fritz hoisted a notice over his parapet reading \"Why so much delay Australia? You are a few days late\". He therefore knew that we were informed about the event having been postponed to Wednesday from Monday. The best opinion here is that we purposely read that out in orders, knowing that spies would give Fritz particulars. This, coupled with the fact that empty ammunition cases had been stacked along the railway line for days beforehand, and troops were daily\n\nmarched about behind the lines in large numbers (some being taken to the trenches in daytime & marched out at night) led the Germans to get well prepared for something big. Therefore we really did render great assistance to our other divisions at Pozieres by holding reinforcements up in the North. It is said that the Germans brought up 11 divisions for this encounter. Whatever results were attained ours was the first Australian Battle in France. Disgust and feelings of angry disappointment reigned for days afterwards when a report something like this appeared in the \"Daily Mail\". \"A raid was carried out south of Armentieres in which Australians took par. We captured 140 prisoners\". What an insult!\n\nThe total casualties numbered 7800 out of no more than 1200 troops if there were that many.\n\nMore than the losses at the landing in Gallipoli, and one of the hardest fought fights in the war to date. Men who were in Gallipoli told me personally that Gallipoli was a picnic to it.\n\nExtracts\n\nThe Australians\n\nBattle in France\n\nAdvance and Retirement\n\n\"The 19th July will be a date to remember for the A.I.F. We hoped that it would be a lucky date, and that we would repeat the achievement of May 19th 1915, when we drove the Turks back over the hills at Anzac, with a loss to them of 7000 killed. But the conditions were different now that we were attacking. One reassuring fact, however, stands out. These new Australian Divisions possess the same spirit as the Anzacs – a proportion of them are Anzacs. The whole movement shows that where Australians\n\nfight there will be an advance at all costs.\"\n\n\"We had been taken out of the trenches to organise for the movement. British regiments, just relieved from Ypres, were put in to hold the lines whilst the attacking party, composed of a British division, some Canadians, and Australians, were to make a push on a front of 2 miles.\" \"We hoped that it might mean an advance, for at least the extent of the enemy’s first line; at all events it would be a valuable demonstration and would prevent the Germans continuing to remove guns and troops to assail our advancing army in the south.\"\n\n\"In our battalions a final meeting of officers was held on the morning of the 19th July, so that all might have clear orders, and then the Colonel issued his final message to the battalion\":-\n\n\"Best of good luck!\n\n\"What you are asked to do, do quickly and quietly.\"\n\n\"Keep Cool!\n\n\"Conserve your water supply.\n\n\"Trust in God and do your duty, and all must be well.\"\n\nThe Advance\n\n\" – Proceeding in single file along the hedge side of the country roads, with long intervals between the companies to prevent observation from the air we soon came to the communication trenches – deep saps zigzagging to the front – and we took up our position.\n\n\"Punctually at 6 p.m. the first wave went over the parapet, being at once subjected to a tremendous cannon fire from the Germans; high explosives shattering our works and doing much damage. In a similar way, and with the same\n\ndiscouraging experience, two other battalions went over.\"\n\n\"The Germans were not surprised, for we had subjected \nsubjected\n them to an artillery preparation of varying intensity for three days. For the whole of the afternoon our Australian artillery had been wire-cutting; now they lifted their range so as to form a barrage of fire and thus prevent the Germans sending reinforcements up to their front. Already our guns were hot and the oil in them was boiling. The German Artillery was wonderful, and in many cases they were \"on to\" our batteries, and crews had to be removed. In one case the gun was struck and the whole pit wrecked. Here not a man was lost, but in another case one of our guns was hit and several men were killed including the Captain.\"\n\nIt has been advanced as a criticism that, in addition\n\nto the barrage of fire, our guns should have directly engaged the big guns of the enemy which were firing high explosives. ---- The men were willing enough, and we found that when we came up to the German machine guns the Boches were quite ready to surrender or flee. Such prisoners as we took at this stage were abject in their fear.\"\n\n\"Soon there was a shortage of bombs, not because there were not bombs enough on the ground, but already the communication trenches were choked with traffic, and it was impossible to get the wounded out and the material in with sufficient speed. We were handicapped by having to fight in a system of trenches and ways which we had not time thoroughly to understand.\n\nTerrible Fighting\n\n\"Now followed hours of confused and terrible fighting. Individual\n\ndeeds of heroism were common. ---\"\n\n\"Meanwhile our men suffered. Germans dressed in Australian uniforms came out of dug outs and turned machine guns on the backs of our advancing men. Many were thus wounded in the back. It is said that Boches who spoke English and were dressed in Australian overcoats gave bogus orders. But our men were not to be denied, and they fought on till they had captured the whole system of German trenches.\n\n\"All during the night the wounded kept coming into the dressing stations exulting in advance, and we thought we had indeed made good, for the positions were being consolidated, a trench having already been dug behind the German line, and facing them.\"\n\n\"---- But the \n\nGerman has always something up his sleeve. They had flooded many of their trenches with water, and our men had to go through the muddy water up to their waists. Hour after hour the enemy guns were playing right and left, and during the night the right and left flanks were forced to withdraw. This left the Australians \"in the air\" and the Boches began advancing down their communication trenches on each flank until they almost enveloped our men, who by this time had fully occupied the German works in the centre. To be enfiladed with machine guns and field guns, to be bombed by rifle grenades from both flanks was our unhappy lot, and yet there was no thought of retirement in the minds of our men.\"\n\n\"When the order was at last given it was only by discreet\n\ninstructions, and even ruses, and then with difficulty, that the officers managed to secure an orderly retirement, so anxious were our men to stay. It was not, however, until much booty – machine guns, maps, official orders, material of all sorts, and over 100 prisoners – had been passed to the rear first.\n\n\"During the fight we unfortunately lost one of our chaplains – Captain Rev. S.E. Maxted M.A. B.D. Dog tired with running for stretcher-bearers\n\nduring a fierce cannonade, he turned aside for refuge and rest in a trench, and sitting down in the corner he immediately fell asleep. It was a front line trench and by-and-by a high explosive landed on the parapet, a fragment killing him instantly.\"\n\n\"The fight lasted from 6 p.m. on the 19th to 2 p.m. on the","19":" inst., although there were still a few\n\ncasualties after that hour through artillery. At that time I walked round the aid posts in the front line, and hardly a stray bullet was fired on either side. Both sides were tired out, and the difficult work of getting the wounded and dead out of \"no man’s land\" was proceeding.\"\n\n\"The work of the Australian A.M. Corps was good. Getting the wounded up the mile and a half of narrow trenches was very difficult, and the regular number of stretcher-bearers was inadequate, but the A.M.C. did all that was possible. The motor ambulance service was perfect. The vehicles were made more or less shell proof by being covered with meshes of expanded steel, and they drove right into the zone of fire.\"\n\nA Raid, or a Battle?\n\n\"Of the whole movement we are told that the result has been to force the Germans to bring reinforcements and leave their guns here, thus preventing them adding to the forces which our army in the South would have to face. Our men, however, are disgusted to find the operation described in brief paragraphs in the London papers as an Anglo-Australian Raid. They think that fierce fighting for eight hours under terrific gunfire might be considered a battle.\"\n\n\"We now learn that the Canadians were subjected to such artillery fire that they were unable to leave their trenches. The British got out but only reached the first line of German trenches. The Australian division, it appears was the only one to capture and occupy the German lines.\"\n\nIn these extracts which\n\ncome from a Captain’s letter to one of the Australian Papers I think the information is really good and reliable.\n\nHaving got to this stage I was almost forgetting one of the most outstanding and brilliant episodes of the fight. While working in the firing line when the fray was at its height we passed Major Williams of our Ambulance carrying a stretcher with a Private from the infantry. With no headgear on and perspiration running off him I was simply astounded, so much so that I paused to watch him. Yes, a Major silently working in the very front line and doing a private’s work. Until I saw him I understood that he would be back at the Brewery to perform operations and rearrange dressings as required.\n\nHere we have the White Man so well remembered and respected by everyone since the memorable great march in Egypt.\n\nLate in the afternoon we witnessed fine aerial manouvres by 8 of our planes.\n","20":"\n\nRelieved at 1 a.m. feeling like birds let loose on the way back to the brewery. Here we had a drink of tea and something to eat, then went to bed tired out. In the afternoon Fritz bombarded the Brewery, throwing shells in the front yard and just a few yards behind it but no damage was done. We retired to trenches in the field behind the brewery while the music was going on. Later in the evening I was included in a party despatched to Port de Cleus for more Active Service Duty. When we arrived at this old farm house we learnt that shells had been thrown into it during the day so naturally we felt a bit disturbed. We waited some hours for the\n\nofficer who was to have come to join us, then word reached us ordering our return to the Brewery as this idea had been cancelled. A little nearer the trenches the sky was alight with the reflection from a burning building, the place having been hit by shells. German searchlights were also scouring the district.\n","21":"\n\nThis morning a letter of congratulations from the A.D.M.S. (Asst. Director of Medical Services) was read to us, highly praising the work performed by our Ambulance in the recent engagement. It appears that we put up a record by clearing 3,075 wounded between the hours of 2 a.m. & 6 p.m. on Thursday last. Unlucky again – this time I was included in another party of 10 and sent to the trenches at Wye Farm.\n\nThis part of the \"line\" is approached through the village of Fleurbaix. It lies to the right of Bois Grenier where O’Leary won his V.C. A road runs through Fleurbaix past Elbow Farm and then down to Wye Farm. Both these Farms are considerably battered about but there is a strange feature about the latter. This is Headquarters of the Battalion in the trenches and yet not one shell has been fired at it during the past 18 months. So far as I am able to understand Fritz has a similar building behind his lines and if he fires at ours we will soon make short work of his. This Wye Farm is therefore pretty safe notwithstanding that the communication trenches or saps to the firing line commence here. Machine Gun bullets at night get a bit troublesome. The A.M.C. aid post is in a big brick barn building. Round the wall outside sandbags are stacked, whilst an extra strong\n\nroof has been erected in the inside about half way up. The London Rifle Brigade are occupying the trenches at present but Australians will be taking over in a day or two. Only 9 out of the original battalion of this Rifle Brigade are here now but it would be hard to find a merrier party than these. They kept us laughing for hours tonight.\n","22":"\n\nLast night we learnt that other creatures occupy the building besides troops. The place is alive with rats quite the size of a cat. Whilst lying awake several ran over me. It’s a relief to fall asleep. The New Zealand Field Ambulance Men have not yet been called away so we do not take over until they go. A few casualties came through during the night. Another farm house\n\nwas set alight back near Fleurbaix. It seems that this is the exact place where British & Germans shook hands last Christmas, to the annoyance of the French people. Kemp & I went down to Elbow Farm for tomorrow’s rations. This was at about 9 p.m., and on the way back, just in rear of the farm on the road nine bullets flew past us.\n\nYesterday’s paper \"The Daily Mail\" refers to our recent fight as a raid.\n","23":"\n\nSlept in till 10 a.m. There were a few bad cases during the night – not much hope for them. Took over from the New Zealanders. The method of evacuating wounded is as follows:- One party carry from the R.A.P. (Regimental Aid Post) up in the support\n\ntrenches down Gunner’s Walk sap to Wye Farm. Here another party wheel patients on \"spiders\" to Elbow Farm. From Elbow Farm a third party is allotted the duty of loading the Motor Ambulance when it comes down or if it is daylight they have to wheel the patient in to Fleurbaix and put him on the Ambulance there. These duties at the three posts are undertaken turn about. Four men occupy a dug-out at Jay Post in the supports near the R.A.P. for 2 days, another 4 stay at Wye Farm, and the last two at Elbow Farm in a small dug-out for 24 hours.\n\nAt mid-day my mate Kemp and I were sent to the R.A.P. now occupying a dirty little dug-out which has previously been used as a fire place. Rats are numerous so also are shells and bullets.\n\nWe carried down a few cases this evening.\n","24":"\n\nPractically no sleep during the night. The Germans were shelling heavily – 150 H.E.’s into our front parapets killing numbers and wounding a few. There were 20 casualties altogether. A Shell nose cap dropped at the door of our dug-out.\n\nIn the afternoon we changed over to the new dug-out. Two of our men who have been here for 2 days are being relieved by another two so we hopped into the better dug-out.\n","25":"\n\nOnly one case to carry down today. Two were shot through the head but they died shortly afterwards. We never carry dead unless they have passed away while in our hands, in which case we\n\nsend them right on to the Ambulance Dressing Station.\n\nAt 6 p.m. returned to Wye Farm. Another trip for rations which proved very lively with machine guns sweeping the road and shells flying on all sides. Glad to get into bed.\n","26":"\n\nOut of bed at about 10 a.m. It was mostly artillery firing today. Fritz knocked our trenches about a bit. Machine Guns & snipers dangerous at night.\n","27":"\n\nBeautiful Day. Had to get up early this morning to prepare for an inspection by Mjr. Gen. McKay but he didn’t come. Instructions referred to the General as Lance-Corporal so as to ward off any spies. Our Artillery and a few 75’s\n\nwere very busy today. Germans shelling Fleurbaix and roads behind us. 11 of our aeroplanes were up, one performing wonderfully. This was The Mad Major’s plane so we watched him very closely. He dived to within 100 ft. of the German trenches and opened up the machine gun. In this manner he carried on throughout the whole afternoon and Fritz had painted the sky black & white with shells but couldn’t hit him. The man is indeed a marvel. An artillery man told me today that during last night they knocked a German armoured train off the line.\n","28":"\n\nAnother lovely day. I went to Elbow Farm for the rations. We have decided that it is better to go for them in\n\nthe mornings. Today the sky is beautifully clear for aerial observation and planes made the best of it. A great fleet of our aeroplanes passed across the German lines on a bombing expedition. Fritz fired wildly at them but without success.\n\nIn the evening we had another trip to the R.A.P.\n","29":"\n\nUp at about 10 o’clock. Only two cases to carry down to Wye Farm. Our Artillery battered the German trenches about and we were surprised that Fritz didn’t retaliate. Aircraft busy.\n","30":"\n\nAbout 6 a.m. took serious case down to Wye Farm – this man was shot through the head after sniping a few Germans. These cases are very unpleasant especially\n\nbefore breakfast. My clothes were splashed with blood. The poor fellow died later I understand. A sergeant was also shot in the head but not seriously. There were 6 cases altogether. During last night the boom from our Naval Guns in the rear shook the earth. One of Fritz’s big guns was hit yesterday. My mate & I are now at Elbow Farm in a solid little dug-out. We have had rather a happy evening in company with two signallers and an A.M.C. detail man from the machine gun section.\n","31":"\n\nThe cook from the Machine Gun Section brought us our breakfast in bed – cocoa and ham. Trip in to Fleurbaix with patient. Shells coming over this way pretty heavily today. Top blown off the Church. Back to Wye Farm Post,\n","32":"\n\nUp at 10 a.m. Walked right back to the Brewery at Fort Rompu with a sick man. Germans shelling both sides of the road. Ambulance packed up – \"C\" Section moved. Lucky to have been back at the Brewery today for Fritz was shelling our supports heavily. Our dug-out in the supports narrowly escaped. Returned to Wye Farm from the Brewery in the ration car tonight.\n","33":"\n\nRoused out to take serious case at 5.20 a.m. – man shot through head. Germans still shelling our supports. 3rd turn at the R.A.P. An intense bombardment opened up by our guns.\n","34":"\n\nWe passed through a night of anxious terror, sitting huddled up in the small dug-out – four of us. For days past Fritz has been exposing a notice \"Keep your heads down till August 4th\". Yesterday he threw over some heavy shells. At exactly midnight terrific crashes broke forth. All our guns fired at the same time, some having been connected together so that they would go off at the one moment. Fritz got an awful introduction into the 3rd year of the war. The guns hammered away for hours in intense fury. We got no rest at all. This morning there were 4 casualties to carry down. A few more shells came close to us during the day. 8th Fld. Ambulance have moved from the Brewery to an unknown destination & \n\nwe are left isolated. No news of relief.\n","35":"\n\nLay awake for hours last night troubled by large mosquitoes, guns and machine guns. A few more patients this morning. One man was hit by an explosive bullet. The infantry here are being relieved today. My friend and I before settling down at Elbow Farm after changing over were required to take some dressings to an officer at Port de Cleus, between Fort Rompu and Fleurbaix. We had handed the dressings over and were having our tea in an estaminet close by when two shells came over with an awful crash. They landed in a farm yard not far behind us and the concussion shook the building we were in.\n\n20 men were wounded by these two shells.\n\nAn aeroplane decended in the fields near us on the way back to Elbow Farm. It seems that the airman was hit whilst over Lille and he volplaned down to our lines. Today we had a look round the ruins of the Fleurbaix Church. No sooner had we got into bed at Elbow Farm than we heard the call for A.M.C. men. We went over to where the man was lying, carried him into our dug-out and soon decided that drink was the only complaint. He couldn’t return to his unit in this state so we put him to bed.\n","36":"\n\nThe bird gave trouble all night. We got rid of him at daybreak and slept in till 11 a.m. Quiet day\n\nexcept for aeroplanes. At night on returning to Wye Farm things were terrifying in the fields to our left. Guns and bursting shells made a fierce chaos. Looking out from the porthole in our building the scene was awful. We had no sleep till 3 o’clock in the morning.\n","37":"\n\nWent to Elbow Farm for rations & mail. Fritz shelling the batteries behind us also Fleurbaix which is already in ruins. Numbers wounded in the village.\n\nBritish squadron of planes passed over. There were 8 altogether & Fritz failed to hit any. No doubt we have the superiority here in aeroplanes.\n","38":"\n\nCase at about 5 a.m. Back\n\nto bed and slept till 11. Not much doing today except for aeroplanes and artillery. Light Horse entered the trenches today to reinforce infantry.\n\nIn the afternoon we returned to the R.A.P.\n","39":"\n\nNo cases to carry down. Left the trenches at 3.30 p.m. having been relieved by another party from the Ambulance. Fleurbaix shelled. Guns knocked out and roads torn up. Walked to Fort Rompu, had tea, then proceeded off to Doulieu to rejoin our unit. We passed out on a road through Sailly and were stopped by a representative of the Divisional Staff. This officer marched us back to Div. Headquarters without giving a reason. Here we were informed that\n\nwe shouldn’t have used this road, but they allowed us to go on this time seeing that we had commenced \non the\n and it would mean lengthening our journey to go by the proper route. Arrived in camp at Doulieu 11 p.m. and slept in a bell tent.\n","40":"\n\nNot asked to do any work. Looked round the local Church which was destroyed by the Germans. It is said that the Germans put their dead inside the building, threw petroleum over the bodies and then set them alight.\n","41":"\n\nOn Piquet and wandering round the village when\n\noff duty. Stan Wilson, my particular friend in the Ambulance and who carried with me in our first engagement today got shell shock in the trenches to the right of Wye Farm. The Regimental Aid Post was blown in by high explosives and a party had to dig themselves out.\n","42":"\n\nDigging grass from round the wards all the morning. In afternoon marched to Sailly for a bath and rode back on motor lorries.\n","43":"\n\nOn Water Piquet. Went with Gillies to a village behind Doulieu and to Estaires in the afternoon\n\nfor water. All these villages have their well somewhere in a prominent place and the water is drawn up chiefly by a pump. This district is looking beautiful at present now that the crops are ripe.\n\nA special parade was called this evening in order to notify us about moving tomorrow. The Colonel also announced that T.W. Howard has been awarded the Military Medal for distinguished bravery on 19th July.\n","44":"\n\nMarched out at 6.30 a.m. It was a lovely morning. We halted close to Laventie and sat down on the side\n\nof the road waiting to see the King. He, however, came by a different road. Some managed to see him but I didn’t. Returning back a few miles along the same roads we billeted in \na\n buildings part of which are being used as a school for little girls. It is rather a fine place to live in. So here we are in Estaires again, and right in the centre of the town.\n","45":"\n\nSquad drill morning and afternoon up and down the yard. Its amusing to hear the boys \"going crook\", as the saying goes. They don’t like the idea of cleaning boots every morning & shaving to do squad drill. Tommy Artillery going in Armentieres way. Orders today contain reference to assisting civilians in harvesting whenever troops can be spared.\n\nLeave from 5 p.m. till 9 p.m. Had a look through the beautiful church in the town.\n","46":"\n\nIn morning marched to Baths. Afternoon march to Sailly and back, then paid. Two of us were yarning with a family of refined French people who own a large shop in the town. They were in Lille previously but fled when the Germans came through that city. These people speak remarkably good English, especially a son who has been discharged from the French Army minus a hand. It seems that the French detested the Indians and were glad to get rid of the dirty black men, as they are termed. The Indians were practically useless in France as everyone agrees.\n","47":"\n\nRaining last night and wet today. In morning more squad drill. Afternoon off. T.W. Howard was today decorated. Newspapers report King George under fire in France. This is a source of great amusement here because the King didn’t go any further than a nervous child would go. This evening we went to the Pictures in La Gorgue. New Zealand Artillery moving in Somme direction.\n","48":"\n\nWent to the dentists’ at No. 1 Clearing Hospital this morning. More agony in the shape of squad drill this afternoon. Out for tea as usual after 5.30 p.m. Rumours that 22,000 Tommies arrive on Sunday. Not very pleasing to the inhabitants.\n\nRaining hard tonight.\n","49":"\n\nStill raining. By a little bit of headwork managed to secure a very soft job – sweeping a room out after meals. This is all I have to do daily. Letter writing cut down to three letters a week each one not to consist of more than two pages.\n","50":"\n\nRaining. Church Parade at Y.M.C.A. Everyone in this village seems to go to Church. The chiming of the church bells is beautiful. Kit inspection. 22,000 Tommies arrived from the Somme. They are a merry lot notwithstanding the heavy losses.\n\n21 August (Monday)\n\nIn morning the A.D.M.S. visited our Ambulance &\n\nasked for 6 carpenters to be sent to erect buildings at the Nouve Au Monde Rest Station, at present being carried on by the 15th Fld. Amb. My name was mentioned by someone, without referring to me first. Marched to Sailly, (or, to be more precise, Nouve Au Monde) and commenced work. The first building to be erected measures 99’ x 12’ of 5 rooms. In evening walked to Fort Rompu, halting on the way to have a look through a small but new cemetry where numbers of victims killed on","51":" are buried. Tommies are leaving this locality on their second trip to the Somme and they don’t like the idea of it at all. An operation that has been provided for us to live in while working here.\n","52":"\n\nStarted work at 9 a.m.\n\nIn evening went to Picture Show in Sailly. Scotch on their way to Armentieres from the Somme. Gas School in the paddock near by – experimenting today. Thunder storm tonight.\n","53":"\n\nA.D.M.S. came and expressed his satisfaction with the progress we are making. Cutting out roof plates all day. In the evening huge guns on caterpillar wheels and drawn by two tractors arrived to strafe La Bassee. Aeroplanes report the presence of civilians in the German trenches so the Tommies are going over the bags tonight. Gas Alert. Terrific bombardment opened late at night. Poor Fritz must be getting on rather badly.\n","54":"\n\nA lovely day. Four cart\n\nloads of timber arrived & we got a good bit of the framework up. Planes & battle planes up all day. As darkness set in the sky was spotted with shell marks & it was a great sight watching the flashes from a machine gun on one of our planes.\n\n25th August (Friday)\n\nGuns & aeroplanes again busy. Party of 12 more men arrived from our unit to dig a drain. 2 9.8 howitzers dragged along the road by tractors. One of our planes brought down.\n\n26th August (Saturday)\n\nHeard that Wilcox & Stanton who enlisted and were in camp with me in Aust. both suffered on 19th July. The former was wounded & the latter is a prisoner of war, also wounded. Advance Guard of 1st & 2nd Aust. Div.\n\npassed through from the Somme. Went to baths at Bac St. Maur this afternoon and met Middlecoat from Mosman.\n","55":"\n\nAt 2 a.m. the cooks were roused out in order to get breakfast ready for the 15th F. Amb. bearers at 4.30 a.m. These bearers were rushed down to the trenches to be in readiness for a raid which had been planned. However, nothing transpired and the men returned, later in the day. Some of our unit are out harvesting. More guns arrived today.\n","56":"\n\nTaubes up. Residents of Fleurbaix warned to leave the village. ","57":" F.A. bearers off again to the trenches. ","58":" Divisional troops going over the bags at midnight.\n\nFive of our carpentry party went in to Estaires to see a concert given by our unit. I, however, went into Sailly with Roy Middlecoat and visited the picture show. Later in the night we were called upon to assist in the operating theatre, working in shifts. A heavy bombardment was going on till after midnight.\n","59":"\n\nCompleted the roof of our job, then commenced putting malthoid round the walls. Rain & mud made conditions miserable. A.M.C. Comforts distributed, consisting of Salmon, Tomato Sauce, Fruit etc. Again the guns and trench mortars got busy.\n","60":"\n\nThe attack last night was a failure on account of the barbed wire not having been\n\nout sufficiently. Stretcher-bearers came back at midday. Heavy rain fell during the evening and increased to a thunderstorm. Guns however could be heard distinctly above the noise of the storm.\n","61":"\n\nCouple of our planes brought down. We are now using High Explosives in the air.\n","62":"\n\nBuilding. In evening went into Estaires.\n","63":"\n\nShould have been sent to Baths at Sailly this afternoon but the 15th Colonel mixed things up & we were therefore beaten for our usual bath. Some of our unit are doing traffic police duty in Estaires.\n","64":"\n\nNo work. Saw a magnificent sight in the air – 25 of our planes were performing and Fritz was firing frantically at them. Went into Estaires again this evening.\n","65":"\n\nA cold day. Laying flooring on job. Orders have been sent to us requesting the return of the pocket patches which we have previously had sewn inside our tunics. Another satchel is being issued instead to carry the second gas helmet.\n","66":"\n\nRaining all day and the guns are still hammering away. They seem to take advantage of the rain. Still on flooring.\n","67":"\n\nOn job. \"B\" section have been recalled to Estaires to run the baths. At night guns from all round us, though I couldn’t locate many, made a terrific commotion till after midnight. A stray shell dropped near Estaires. Cavalry came through Estaires tonight in large numbers apparently bound for Ypres.\n","68":"\n\nBombardment opened again. Pieces of shrapnel from Fritz whistled near our tent.\n","69":"\n\nOn Job. Went into Estaires again after tea. The intense bombardment of yesterday opened again today. Airman brought in by 15th F. Amb. stretcher bearers. He flew from over Lille wounded badly in arm and leg. More\n\npieces of shrapnel came over our way.\n","70":"\n\nAfternoon off to visit baths at Bac-St.-Maur then a few of us went on to Fort Rompu. German planes dropped circulars round Estaires for the citizens to read. Heavy bombardment in the night.\n","71":"\n\nNothing doing in morning. In afternoon we had to erect a bell tent and leave the operation tent because it was required for patients. One of our chaps \nchap\n was fool enough to sprinkle too much formalin in the tent. The fumes caused considerable trouble for hours. Rumours of a big offensive from Ypres to Arras.\n","72":"\n\nTommy Artillery replacing\n\nours in this district. Went to Estaires in evening. \"C\" Section leaving the Rest Station at Doulieu and coming in to headquarters at Estaires. 80 men to be held in readiness for use in the trenches when required.\n","73":"\n\nBombardment opening round Armentieres way. Laying floor of the 4th room at the building today. Beautiful day. It is rumoured that we would have attacked Fritz on this front last night only that the light was too bad for aerial observation. Tonight the conditions are bad but planes are up.\n","74":"\n\nOn job. Tents in camp were all stained red today to ward off aerial observation by Fritz. Raining & Cloudy. Concert in evening given by\n\nthe 15th Fld. Amb. and every item was exceedingly good.\n\n"}}