{"Document Name":{"0":"Diary_0301","1":"Diary_0301","2":"Diary_0301","3":"Diary_0301","4":"Diary_0301","5":"Diary_0301","6":"Diary_0301","7":"Diary_0301","8":"Diary_0301","9":"Diary_0301","10":"Diary_0301","11":"Diary_0301","12":"Diary_0301","13":"Diary_0301","14":"Diary_0301","15":"Diary_0301","16":"Diary_0301","17":"Diary_0301","18":"Diary_0301","19":"Diary_0301","20":"Diary_0301","21":"Diary_0301","22":"Diary_0301","23":"Diary_0301","24":"Diary_0301","25":"Diary_0301","26":"Diary_0301","27":"Diary_0301","28":"Diary_0301","29":"Diary_0301","30":"Diary_0301","31":"Diary_0301","32":"Diary_0301","33":"Diary_0301","34":"Diary_0301","35":"Diary_0301","36":"Diary_0301","37":"Diary_0301","38":"Diary_0301","39":"Diary_0301","40":"Diary_0301","41":"Diary_0301","42":"Diary_0301","43":"Diary_0301","44":"Diary_0301","45":"Diary_0301","46":"Diary_0301","47":"Diary_0301","48":"Diary_0301","49":"Diary_0301","50":"Diary_0301","51":"Diary_0301","52":"Diary_0301","53":"Diary_0301","54":"Diary_0301","55":"Diary_0301","56":"Diary_0301","57":"Diary_0301","58":"Diary_0301","59":"Diary_0301","60":"Diary_0301","61":"Diary_0301","62":"Diary_0301","63":"Diary_0301","64":"Diary_0301","65":"Diary_0301","66":"Diary_0301","67":"Diary_0301","68":"Diary_0301","69":"Diary_0301","70":"Diary_0301","71":"Diary_0301","72":"Diary_0301","73":"Diary_0301","74":"Diary_0301","75":"Diary_0301","76":"Diary_0301","77":"Diary_0301","78":"Diary_0301","79":"Diary_0301","80":"Diary_0301","81":"Diary_0301","82":"Diary_0301","83":"Diary_0301","84":"Diary_0301","85":"Diary_0301","86":"Diary_0301","87":"Diary_0301","88":"Diary_0301","89":"Diary_0301","90":"Diary_0301","91":"Diary_0301","92":"Diary_0301","93":"Diary_0301","94":"Diary_0301","95":"Diary_0301","96":"Diary_0301","97":"Diary_0301","98":"Diary_0301","99":"Diary_0301","100":"Diary_0301","101":"Diary_0301","102":"Diary_0301","103":"Diary_0301","104":"Diary_0301","105":"Diary_0301","106":"Diary_0301","107":"Diary_0301","108":"Diary_0301","109":"Diary_0301","110":"Diary_0301","111":"Diary_0301","112":"Diary_0301","113":"Diary_0301","114":"Diary_0301","115":"Diary_0301","116":"Diary_0301","117":"Diary_0301","118":"Diary_0301","119":"Diary_0301","120":"Diary_0301","121":"Diary_0301","122":"Diary_0301","123":"Diary_0301","124":"Diary_0301","125":"Diary_0301","126":"Diary_0301","127":"Diary_0301","128":"Diary_0301","129":"Diary_0301","130":"Diary_0301","131":"Diary_0301","132":"Diary_0301","133":"Diary_0301","134":"Diary_0301","135":"Diary_0301","136":"Diary_0301","137":"Diary_0301","138":"Diary_0301","139":"Diary_0301","140":"Diary_0301","141":"Diary_0301","142":"Diary_0301","143":"Diary_0301","144":"Diary_0301","145":"Diary_0301","146":"Diary_0301","147":"Diary_0301","148":"Diary_0301","149":"Diary_0301","150":"Diary_0301","151":"Diary_0301","152":"Diary_0301","153":"Diary_0301","154":"Diary_0301","155":"Diary_0301","156":"Diary_0301","157":"Diary_0301","158":"Diary_0301","159":"Diary_0301","160":"Diary_0301","161":"Diary_0301","162":"Diary_0301","163":"Diary_0301","164":"Diary_0301","165":"Diary_0301","166":"Diary_0301","167":"Diary_0301","168":"Diary_0301","169":"Diary_0301","170":"Diary_0301","171":"Diary_0301","172":"Diary_0301","173":"Diary_0301","174":"Diary_0301","175":"Diary_0301","176":"Diary_0301","177":"Diary_0301","178":"Diary_0301","179":"Diary_0301","180":"Diary_0301","181":"Diary_0301","182":"Diary_0301","183":"Diary_0301","184":"Diary_0301","185":"Diary_0301","186":"Diary_0301","187":"Diary_0301","188":"Diary_0301","189":"Diary_0301","190":"Diary_0301","191":"Diary_0301","192":"Diary_0301","193":"Diary_0301","194":"Diary_0301","195":"Diary_0301","196":"Diary_0301"},"Date":{"0":"unknown","1":1163.0,"2":1164.0,"3":1165.0,"4":1166.0,"5":1167.0,"6":1168.0,"7":1169.0,"8":1170.0,"9":1171.0,"10":1172.0,"11":1173.0,"12":1174.0,"13":1178.0,"14":1179.0,"15":1180.0,"16":1181.0,"17":1182.0,"18":1183.0,"19":1184.0,"20":1185.0,"21":1186.0,"22":1187.0,"23":1188.0,"24":1189.0,"25":1190.0,"26":1191.0,"27":1192.0,"28":1193.0,"29":1194.0,"30":1195.0,"31":1196.0,"32":1197.0,"33":1198.0,"34":1199.0,"35":1200.0,"36":1201.0,"37":1202.0,"38":1203.0,"39":1204.0,"40":1205.0,"41":1206.0,"42":1208.0,"43":1209.0,"44":1210.0,"45":1211.0,"46":1212.0,"47":1213.0,"48":1214.0,"49":1218.0,"50":1219.0,"51":1220.0,"52":1221.0,"53":1222.0,"54":1223.0,"55":1224.0,"56":1225.0,"57":1226.0,"58":1227.0,"59":1228.0,"60":1229.0,"61":1230.0,"62":1231.0,"63":1232.0,"64":1238.0,"65":1240.0,"66":1241.0,"67":1242.0,"68":1243.0,"69":1244.0,"70":1245.0,"71":1246.0,"72":1247.0,"73":1248.0,"74":1249.0,"75":1250.0,"76":1251.0,"77":1252.0,"78":1253.0,"79":1254.0,"80":1255.0,"81":1256.0,"82":1257.0,"83":1258.0,"84":1259.0,"85":1260.0,"86":1261.0,"87":1262.0,"88":1263.0,"89":1264.0,"90":1265.0,"91":1266.0,"92":1267.0,"93":1268.0,"94":1269.0,"95":1270.0,"96":1271.0,"97":1272.0,"98":1273.0,"99":1274.0,"100":1275.0,"101":1276.0,"102":1277.0,"103":1278.0,"104":1279.0,"105":1280.0,"106":1281.0,"107":1282.0,"108":1283.0,"109":1284.0,"110":1285.0,"111":1286.0,"112":1287.0,"113":1288.0,"114":1289.0,"115":1290.0,"116":1291.0,"117":1292.0,"118":1293.0,"119":1294.0,"120":1295.0,"121":1296.0,"122":1297.0,"123":1299.0,"124":1300.0,"125":1302.0,"126":1303.0,"127":1304.0,"128":1305.0,"129":1306.0,"130":1307.0,"131":1308.0,"132":1309.0,"133":1310.0,"134":1311.0,"135":1312.0,"136":1313.0,"137":1314.0,"138":1315.0,"139":1316.0,"140":1317.0,"141":1318.0,"142":1319.0,"143":1320.0,"144":1321.0,"145":1322.0,"146":1323.0,"147":1324.0,"148":1325.0,"149":1326.0,"150":1327.0,"151":1328.0,"152":1329.0,"153":1330.0,"154":1331.0,"155":1332.0,"156":1333.0,"157":1334.0,"158":1335.0,"159":1336.0,"160":1337.0,"161":1338.0,"162":1339.0,"163":1340.0,"164":1341.0,"165":1342.0,"166":1343.0,"167":1344.0,"168":1346.0,"169":1347.0,"170":1348.0,"171":1349.0,"172":1350.0,"173":1351.0,"174":1352.0,"175":1353.0,"176":1354.0,"177":1355.0,"178":1356.0,"179":1357.0,"180":1358.0,"181":1359.0,"182":1360.0,"183":1361.0,"184":1362.0,"185":1363.0,"186":1364.0,"187":1365.0,"188":1366.0,"189":1367.0,"190":1368.0,"191":1369.0,"192":1370.0,"193":1371.0,"194":1372.0,"195":1373.0,"196":1374.0},"Entry":{"0":"\n\nx Flers\n","1":" After a lapse of sometime I record a few instances worth while.we had avery tough time at x first time & also the rainmud and slughsa treat. I joined the batt up again onNew years day. We lost C. Acklingour first time up onthelines here, in fact all the coorp'swere caught, but sofarC.A is the only one who has died from his woundsa lot of people seem to think that the end of this warwill soon come now. I hope they are right, for I'm surenearly everybody is pretty full of it now. We havefound it very cold here but to-day it is not to bad. I think lastlight is the first night it missed freezing for sometimeconsequently the mud is beginning to get about againbut I suppose we shall have more snow before long, anyhow france under different circumstances mightbe alright. Some of the 10th Batt fatigue party had casualties last night 3K & 4W it is roumored that the 3rd Bgdego over the top to-night to take a trentch, went tocanteen to-day, expect to hear shortly good news re-war.\n18\/2\/17 Have heard nothing about the chargelast night; hear now that it was the 2nd Bgde thatwent over.I thought this strange, for the 3rd Bgdeare now on our old front, and if there was anythingdoing, our guns would have woke me up, it isvery muddy again & to make it worse it raineda little last night. went to Ftry Cr this morning itwas very foggey to start with, but the fog lifted a gooddeal by the time we got to Cgh Dr we thought webe caught but the fog came on again, it lifted andfell all day. got back about 1\/2 past 12 o'clock Theground along this valley has been shelled a lot & heas found the line in a lot of places. never went outlast night, it was quiet.","2":" Foggy again this morninghear that we are in here untill the","3":" of next month.if we are I\nthink\nwe must be going into the linebefore we go out went to Ftry Cr this morning had a badtrip started shelling after we left, things are fairly quietexcept for occasional shells hear that some of the 3 Bdeand some of the 2 Bde are being releived to-nightthis must finish our Div done no trip last night.\n\nwent with another load this evening to TK'sDP got back about 6 o'clock, and found my mategone. G.P. was pretty bad & I fancy he will beaway for sometime, have heard nothing newand things go on in the same old way!","4":"It is fog\ne\ny again & it is also raining. So the mudwill be bad enough now, the guns opened out fora while last night. went to TK's Dr this morning had afair trip considering the weather it was raining andvery muddy","5":" Our guns were pretty buisy lastnight on our sector & the arty fire was heavy on our leftbeyond Pozieres by the sound of it, it is again very fogeyI think this morning is the heaviest fog we have hadyet: it rained a lot last night and there is mud atreat this morning went to Swt Dpwith a load this morning. he was shelling BT. H.Q. a treat when we got to theDLo & started shelling toward's our trackwhen we were comingback but there were no causataliesas far as we new, thenbit after we got back to the dp we saw 3 wounded comingalong; another tale going about that we will begoing into the line next satuarday I hear now thatwe are under order's, to be ready to move off at8O'C to-morrow morning and that we are goingout for a spell. our artly has opened up, & fritz'sis very buisy with his flare's to-night. went tothe dp at 6'O'C to-night but nothing doing, the fogis on again,quite remainder of night.","6":"Foggy again this morning went to Swt DP done a nightlast night, no good of a trip to Fty Cr there were alot of trucks on the line and we had a long trip of it.it was very dark. got back about 9 O'C quite remainderof night.","7":" Foggy again this morning. amM.O. to-day. hear that we are going into the line Sunday night & are going over the top,a raid I suppose, wellwe will see. heard last night that we will be rejoycingwithin 25 days. L.G. is reported as having said so. there aretales upon tales to hear & it is worth while to record somewhat this rejoycing might be. it is hard, if true to sayunless it might be overthe 'big spring meeting.\n\nquite remainder of day. arty opened out heavy on ourleft, but very quite on our sector.","8":" Again foggythis morning. went to Fty Cr, came back I wasinformed that we had to report to batt. we packedup & left CK's Dp about 5 O'C. & got back to battabout 1\/2 past 6 O'C.\nhear\nwas told that we wouldhave an 8M march, tomorrow & that we wouldbe going back for a spell for a day or two.","9":"Got the order this morning to stand too. about2 O.C. full battle order, we heard this morningthat fritz's has left a good part of his front. wealso heard that our patrol as goneas far as 7 M.D.got & not come up against him. Of coursewe are now awaiting orders & we expect to go upto the line any time now & hunt for fritz. we hearall sorts of tales now I will not be surprised atanything, those events happening of course haveupset all otherintentions, we await movementswith intrest. There were a lot of our aroplanesupfor a short time this afternoon. it came out finebut only for a short time, some of our heavy guns\nare pretty\nhave been pretty constant.but have notheard much from fritz's guns. last night we we sleptfull MO.D but nothing came of it. The big gunsjust on our left were very buisy.","10":" It isfoggy this morning & also a misty rain. weexpect to go into the line this evening,haveheard nothing new up till the time of writingthis, got pd last night.","11":"Cameinto reserves they are on the old lineposition.","12":" Still in reserve.","13":"Still in reserve but expect to go up to \nabove\nsupports to-night.","14":" Came into6ths Trentch supports last night itisquite & the line seem a good way off.","15":" the P.G. made a raid this morningthey captured a M.G. crew, but we killedand captured some of them. 17Prs and a number Wd & K.\n\nAll the boys were keen on the bit ofa brush with the enemy remainder of day quite.","16":" Still in supports but expect to move up to one of our poststo-night.","17":" We are now in ourout post.","18":" Still in our post butexpect to go out to-night it as been verycold things are much the same butthere was a heavy arty fire last night","19":" We came out last night & got intocamp at Baytein about 1\/2 past 2 O'C","20":" moved again to-day to another campwe expect to be here only for a day or two &go back to our old front in Belgium.","21":"hear now that we are likely to stop herefor a day or two longer.","22":" Still in thesame camp and hear now that we arelikely to go back to the firing line soon","23":" Still in same camp","24":" Wentdown to A.1st D.G to-day and brought backMTL who has finished 21.D. it is a fairwalk from here about 7M's the way wewent, but we came back a shorter route.Fritz sent over about 40 9.2's last nightbut no damage was done. Yesterday was myfirst day in my new job we heard to-daythat Bagdadhas fallen","25":" Confirmednews reaches us to-day re Bagdad, still in thesame camp. it was patchy to-day, rain and thenfine for a little while at a time.","26":" It is rainingthis morning. Fritz sent over the usual shellsbut they were a good distance off, hear thatwe are moving back to billets to-morrow.quite remainder of day.","27":" Went to-dayto Div 9 Bgde H Q with 6 Prs six of us wentit was a good walk & we were away allday. coming back one of our aroplanescame down about three hundred yds offof us the machine was damaged\n\nhe came down and glided along theground at a great pace almost immediatelyafter landing he turned a complete somersaultand appeared to breakin halves there was nobody near them at the time,but after a shortwhile both pilot & observer came from underthe wreckage & to allappearancesunhurt, awonderful escape, we arrived back incampat 5 O'C. remainder of day quite.","28":" Left camp this morning for Dernancourtvia Beault came along with three Prs got toour billet about 11 O'C it is not much of avillage, a C guard some called out last nightby Prs Lorry to take away 3of the prs that wewere down to D.Q with this is an unusualthing we expect to stop in there billetsabout 6 or 8 days, then up to the line againdone a PT to-night -","29":" Its a lovelymorning this morning went out to P.G groundthis morning but left after about 10'M therethen we went to Fricourt via Albertto bring back 4 Prs from there we gotback about 3 O'C after a good sharp walkwe hear to-day that Bapaume has fallenand also that there is a revollation inRussia, this I think will cause sometrouble. I noticed to-day that the civil populationis beginning to return to Albert, it is muchbetter getting thro there now than when wewent there for the first time in July lastdone the usual Pt to-night. they were very noisybut nothing doing remainder of night quite","30":" It was fine first thing this morning butit came over very cloudy of a sudden about 10 O'Csent toblighty last night for the . Find outthat the trouble in Russia is all for thegood of the entente, also heard that we are likelyto move off of this front that is to say we willnot go in this time, time will tell the newsof Bapaume is correct, it is occupied now \n\nby our troops;it is reported that there was somevery heavy street fighting, which is surprisingto me;sent letter home yesterday C. Prd washeld this morning. heard this morning thatour troops penetrated the hun lines at Bhancourtthis is a place, if anything a little N.E. from Bapaume Brownand Twyman were sentenced this morning the formerto 60 DYS23d Fld the latter to 30 DYS 2nd Fld.","31":" Wentto Beauelthis morning with 2 Prs. seen by thepaper to-day of the great British advance 770.S.Mof country taken and 60 towns one town Noyonhad 10,000 inhabitants in it.expect to hear goodnews to-morrow re the advance it has been asplendid day we expect to go back to the linewithin a day or two\n20\/3-17 It rained prettywell all the night and about 7 O.C this morningit snowed a little, we heard\nto\nyesterdaythat the hun's are closer to Poperinge and hadthe town shelled almost to the ground, so if thisis true, they must have got throsomewhere on ourold front, that is about Ypres.I do not beleivethe yarn myself for I beleive it is just a yarn.heard this morning that Cambari hasfallen, but have not seen anything in the paper about it, heard that the 29th D entrainedtoday, or some of them did, this too of course isonly romour but if they have, I think they areheading for the Ypres front, our troops are stilladvancing along with the french, hear that weare likely to move any day now, it was cold tonightotherwise quite. 21-3-17 Hear today that weare likely to moveout to Riboumont(?) tomorrowthis is a village about 4.M. from here. Mc Lo got 90 dys this morning. it is\na fine\nthis morningfine but a bit cold, see by the paper thatthe Ypres news is wrong they have been onlyhaving raid's, we expect to eventually getto Ypres front this time, it will be a changefrom this front. I never did care for thisfront of the line, this is our 7th time in\n\n \n7\n\n\non this front, we should have liked to go up here again if it was only to go thro Bapaume. We have had it staring us in the face for some time, and at Fler's last time in. Could see it quite plainly, it was about 2 1\/2 M distant & with a good pair of glasses you could see the time by the town clock! Heard last night, but seen nothing in the paper about it that Lille had been taken at the point of the bayonet, went to Beaull with Mo L this afternnon, it was a fine after-noon. It was quiet to-night, the 4th D passed thro here to-day for Barzentin we hear, probably they are going to releive the","32":" D.","33":" It is a splendid morning, it snowed last night a lot of troops are passing up and down here. the fourteenth batt passed to day with Jacka V.C. M.M. Lieut, he was at the head of his Coy. left here about 12 O.C. for Bibemont we were billeted here before, left it last time about","34":" it is well over 2M since we were here, we had a good walk to-day and arrived here about 3 O.C. it is about 4 M from our last billets (Dernincourt)","35":" It is a splendid morning altho a bit chilly first thing seen last night by the paper that the British have broken thro the main german line & have taken 46 more villages, also in the paper that the turk's are being pushed back a lot. all this news appears to me to be the best we have heard since we have been here let it continue we say, remainder of day quite.","36":" It is a fine morning again we hear that we are likely toi be here for a week or more yet, and then move up to a new front. there was a batt attack to-day, went with 8 prs this morning to the outskirts of Heialy, see by the paper that the germans are putting up a strong resistance against our troops in their advance, also learn that the prince Karl of Prussia has been killed while up over our lines in an aroplane done a fire to-night. things quite.\n(Sunday -25-3-17 Fine morning, church Pde this morning went for a walk this morning from here\n\nRibemont, which by the way is on the Ancre riveras far as Merricourt, there are just a few tommysbilleted here, the village is very quite, crossed theAncre again just below the flour mill, on the out-skirts of the town and came back past some woodcutters who are felling logs for some mill or other, itdoes seem a great shame to fell all the fine trees thatare along the river and on the flats here, my mate andI who was G.T. saw about 25 aroplanes while we wereon our walk making towards the firing line, we alsovisited some graves British & french along the roadbetween here & Merricourt . went for a walk againthis afternoon thro Heilly. through to the cemetary wherewe seen our late Col's grave. we then followed railyline back to within a couple of hundred yds of Merricourtand took a short cut home. It was a lovely day, couldhear a very bombardment in the distance, it soundedtowards our old front, very likely between Bapaume andPeronne. The Ancre riverabout theseparts is about","37":" Chnwide, but there is a great flow of water and very fast. got Pdthis morning! quite remainder of night","38":" It was cold this morning and raining, have heard no startling newsabout the British advance, but see by to-nights paperthat a big battle is expected in the vicinity of Saint-Quentin. we hear that they are massing all on the Armentierefront that is the British I mean G.T and I went to boxingmatch this evening at Merricourt, remainder of night quiet -","39":" It was cold this morning and continued sothro out the day two of the prs were tried this morningthings are quite as regards to our moving anywhereG.T left us this morning, to go to Bty. Brigade Concertheld to-night in hall at Merricourt quite remainder ofnight.\n28-3-17 It is now 12 month's to-day since we landedin france, we went to Bauieux this morning and broughtback Paget & Parnelfrom D.H.Q. it was a fine morningit was quite remainder of day.\n29-3-17 It rained agood deal last night. had a trip Meault this morningit is about 5 M from here via Dernancourt we gotback about 1\/4 past 12 O'C. left here at 1\/4 to 9. O.C. A.M.\n\n \n9\n\n\nbut we got a lift in motor transport part of the way back. have had no news of any startling naturethis last day or two. Dky. S. reported back yesterdayevening! we have had no news of shifting from here yet -remainder of \nnight\n day quitewent on Ptl to-night","40":" Raining this morning, went again to Meaultto bring back Mrry left here at 1\/2 past 9 O'C and gotback at","41":" past 1 O.C A.M. we again got a lift in atransport waggon, but, walked all the way back, itis about 10Mls in amd out. got caught yesterday afternooncoming back from Meaultin a very heavy shower andby the time we got to some haystacks, we werepretty well wet through. there are a lot of german Prsworking along the road from here to Meaultand themajority of them look well and in good conditionwe called in atthe bath's at Meaultfor a bath, butfound out that they had been broken; so we couldnot wait untill repairs had been completed. done Ptlto-night, quite.","42":" Lovely fine morning this morning, but it came over \nto\nvery cloudy about 10. O.C andstarted to rain, about 11 O'C. and continued showeryremainder of day. we had Crt MTL this morning andtook D Sth this afternoon. hear that we are likelyto move, about monday or tuesday. See nothing startlingby the paper to-day was at Crt MTL this afternoongot back about 1\/4 to 4.O.C. went on Ptl to-night, quiet.","43":"Sunday) Fine morning church pde hear that when we domove we go down near Arras. Lens is the name of theplace this is near where the hun's started their retreatwent this afternoon to Beauiex with Dell who got 1 -0yrs it was showery this afteroon done Ptl to-night quiet.\n2-4-17 We expect to move towards the line to-morrowit is cloudy & showery. inspection by GL-WKr thismorning went on Ptl to-night, quite.\n3-4-17Clear this morning, but a cold wind blowing a gooddeal of snow fell yesterday evening, it came downin very big flakes, we left here this morning forBapaume direction. we left about 10 past 10 O.C.and arrived at Montauban where we camped in\n\ntinhuts. we travelled about 11M. P.M.O. and it wasfar enough for the 1st day. we came via Dernancourtand Meault were we called with D.S. but broughthim on with us, it turned out a fine day. theroads were in fair condition, we expect to move on to-morrow.\n4-4-17 Left this morning about 8. O.C.we had a good trip for about 1\/2 the distance thenwe struck some mud. And had some very heavywalking for a 1 1\/2 here we again got on duck boardswhich led us onto lane this brought us on to themain Bapaume road about 5 Kilos from that placethere is a village here, we stopped in an old estamet and had dinner, then we came on about 1M alongthe main road, then left it to our left, continuing onwe came thro another village Reinecourt then oversome uncutvitaded ground leaving another villageon our left, we arrived here Heimincourt about 1\/2 past3'O'C after a good march, it started snowing thismorning early, and continued till about 2.O.Cwhen it stopped. this did not improve the walkingfor it was very slippery untill we struck the firstbit of road about 3","44":" M from here, the hun's havecompleted their work of destruction in the villages here and trees are also fell across the main thorofares.At the cross rd's before entering Reinecourt they blew abig crater in the rd, but this was almost repairedwhen we passed it this village Hienincourt is atotal wreck, we expect to move on a little furtherto-morrow, the hun's are shelling Bapaume occasionallywith a big gun we heard some big shells going overon our way here this afternoon, the church here is atotal wreck mined & blown up by the look of it. this hasbeen a fair sizedplace and the place we are campedin for the night, an old cellar has been sadly knockedabout. there are a lot of big out buildings, all more orless levelled to the ground. the place on top of us themain building facing West, has been a fine place.we are within sound of our own guns again,hear that we are releiving our sister Batt \n\n\n","45":" It was a lovely morning, hear that fritzis still moving back. heard late last night thatAmca isat war with them, also heard that theBritish & French had broken the Hinburg line on afront of 7 M. we came about 4 M across some fine countryall the xrds have been mined and blown up. they haveremoved every thing of any value & use to them & destroyedthe rest there are a few lines of Dmy trenches here and Mupon M of B.W.","46":" Have been here all day doinggd A.P Grd artly fire heavy on our left, itsnowed to-dayart fire pretty constant to-night \n7-4-17 Cold first thingthis morning have done g and C.P. grd 2 hrs on 4 off dayand night fritz sent some shells pretty close to us first thingthis morning, art fire very heavy in front & on the leftof us, we hear that we are likely to attack to-nightto take another village, the rail stn near this villageis blown to pieces, the rails have all beentaken and most of the sleepers. bridges all blown upand a fine cheauteu in front of the rail stn has beenblown to bits, it must have been a fine building, thevillage near it is a little better than the rest, for itas a few decent roofs left. there is no mistake the ctryas been stripped & if it was not for the green fieldsround us, after been used to mud & shelld groundthe ctry would look properly devestated, all poles & wireshave been destroyed along the rail line\n(8-4-17 SundayWe are still in this village & doing the same workart fire was fairly constant last night and early thismorning a very heavy barrage was put up and alot of heavy with it, heard since that the 3rd Bgdehad taken a position, we expect to attack to-nightit has been a lovely day, but gets cold towards eveningheard that the sister batt had along with the 53350 Ctles the night before we releived them, we do relisha sunny day, & the days are getting quite a lengthnow; we left this village & went into the rail cuttingabout a 1 M distance from here. hear that we attackat a 1\/4 of 4O.C to-morrow morning, the arty fire continuesheavy on our left. it is cold to-night.\n\n9-4-17 Well this is Easter monday the attack lastnight was a success, we were on fatigue till 1\/2 P.2.O.Cthis morning, it was a silent advance, the village was captured but it is left like the rest, in ruins. Jelisis the name of the rail Stn opposite the cheauteu thisvery likely is the name of this estate.I have had a lookthro it. it has been a splendid place, a lovely drivedown from the stn. passing thro a beautiful parkbut of course the park is destroyed. the best of thetrees have been felled among the others givingthe place an almost undescribable damagedappearance. I beleive the owner of the estatewas here the other day, And he stood andcried over what seems to delight the germanswhen they were here. they need the cheauteu fora big hospital there are a lot of german deadburied here including from GL downwardsiron X men of the 1st grade downwards. that is too","47":" class iron x. So after flying the red +\nand\nover thislovely place, they have blown the lot to kingdomcome. the name of the village captured is Hermiesthe attack won early this morning not last nightas I have wriiten above, souvenir, de-mission I.N.R.I. I picked up in a village lately held by thehuns we stopped and had dinner on our way too Ferincourt. during the advance we took a 150 Prs ourown casuailties were light. Leiut. McManus K, SergGd was K. wehear now that Hamt I.C. is missing- find out now that our casualties were about60 about 8 or 9 K. rest wounded somesay 3 M.C. others 11 werecaptured. I seen 4 M.G . myself, so I think more than 3 were capturedthe gunners were taken Prs Len Mc was K. about12 yds from the gun and was riddled. I pickedup as a momento a clip of empty hun M.G. cartridges 2 \nIn the\nin the Post of the gun that killed himAnd god knows how many more. The","48":" BattI hear had heavy losses.\n","49":" It is snowing again this morning &hear that the canadians attacked the same timeas we did & it was a success too, it is reported theytook 2,000 prs, so according to this the huns had somelosses when the K9 W are reckoned with & of coursewe have had our share too but they never got toomany of our chaps prs.I doubt if they got any atat all, if he did it is only someone who happenedto stray too far & got lost. went this afternoon backto with Mjr Ctr. the arty fire still continuesheavy on our left this is towards Arras. went backwith G.C. too this evening and called backat the cheauteu on our way back we are still inthe raily cutting G.T. came back last night, hearthat the hun have left the next village ahead ofus.","50":" There is a cold wind blowing thismorning, the sun thois showing itself. this is something to be pleased with. it snowed continuallyyesterday, combined with \na\nstrong blizzard attimes, we hear now that they have made someadvance on the Arras sector. have taken 10 000prs and 100 odd guns. if this news is correct, and we have every reason so far to beleive it to be, it isgood, to say the least of it, the bombardment stillcontinues on our left, things are fairly quite otherwisewe shift to another sunkenrd later, it snowedagain this evening & came down heavy for awhile. hear now that we are likely to be in fora few days yet.","51":" We are in anothersunken rd came here yesterday evening. J.V.Land I got lost coming here & wandered down onto the canal. there is a fine canal here all along agood metal rd. just about the canal the hunshave done the usual, that is destroy everythingand fell trees across the rd. it was very muddyafter it thawed this morning. it started to snowagain to-day about 3'O'C, but not for long it issnowing off and on a lot lately sometimes accompanied with blizzards & then even sunshine\n\n\n\n\n\nWe continue to do Son here. heard that there were a great aerial fight at Arras yesterday. we got43 of enemy machines & 28 of our own were broughtdown. Things are fairly quite here\n13-4-17 We hada good night last night it was very cold firstthing this morning and fire very heavy on our leftagain. We hear now that the 4th D have beencut up a lot there, but we do not give muchcredence to the tale,wecontinue on the sentword came thro late last night the 2 hun prshad escaped from their escorts, and firstthing we hear about it this morning, is thatthe number has risen to 12. we kept a sharplook out last night and halted every thing -but had no luck.","52":" Cold this morninganother attack last night, as far as we knowyet, there was no opposition and they gained theirobjective and were dug in at 3 O C this morningstill hear good news as regards things on theArras front, we are still in the sunken roada six inc How drew up near us last night, I supposethere will be a batry here before long, artly fire wasvery heavy on our left last night, in fact onthis sector it is continual, being extra heavyat intervals, hear now that thro the advancethey made last night we had some casualtiesN. was badly wounded besides some otherswent to Bapaume left here this morning about 10 OCAnd got back about 1\/2 P. 8 O.C we called in athecheauteu each way it is about 10 to 11 M from hereit as been a lovely day, and to-night is bright andclear and for a wonder things are quite justan occasional shell going home to rest, theBatt with others from Bde are expected to advceagain to night, seen some of the prs at Bapaumeto-day that were captured in the first attackand a Cpl. reconised the sergand saluted, oneof these prs a red cross nurse dressed our ownwounded, under the german shell fire for \n\nseven hrs, so there must be some of them in spiteof their M.T. something approaching humane, they stillsend an odd shell or so into Bap yet they are comingalong with the rail first rate. the light rail willsoon be to Frienecourt, the first village we campedin for one night, when coming to this front, wepassed over some fine ctry to day and it doesseem a pleasure to see itfor miles, after the mud and shell shook ground we have beenused too. Still in same SK'rd.","53":" The firstthing that woke me this morning about 3 O'C wasfritzs shells, I guessed he was beginning for a Ctrattack. I was not far out for about 1\/2 an hr after 9 by this time the arty fire had got pretty heavy theword came thro to stand too, we soon heard thatis, as soon as the critical time had passed, that hehad been beaten back with heavy losses, of coursewe had our own calties , but they were light. Poor old F, Frt got killed this morning I heard this whenI was up too the line with ammunition and B. Gdrgot wounded not seriously. he had just comeback to us, about 2 dys before we left Ribermont to comehere one man was blown to poeces in front ofwhere we dpd our ammunition this morning the shellmust have got right close to him, we expected to goout to night, but on account I suppose of the counterattack this morning we will not go till to-morrow night, two prs huns were taken away from here thismorning, they said that they had only come up Ofrom Cambari last night and went in the chargethis morning. They are now I suppose in Bapaumenot a bad advance for 1 day if their mates cameto grief. they made up for them in putting theline behind them by miles, fritzs are layingabout very thick in front of our lines now, it asbeen a miserable day cold piercing wind blowingaccompanied with rain, of course this monthhere is always very changeable\n","54":" It was cold last night and towardsmorning it began to rain. there was nothingdoing, but we expected it about 1\/2 P 3'OC. Iheard from a reliable source this morning thatup to the present CGr casualties are 43 about 40 P\/Cof these are killed, arty fire on our left still continuesbut not quite so heavy as usual, we left here forBeaumetz this afternnon about 5O'C. fritz wasshelling the ruts Kirsts of itwhen we got near itthere are some heavy guns here, he serches allabout for them . the villiage itself is shelledto the ground in places, but we are luckyfor we have got a decent room, that is decentas far as things go here. it is a wonder anything like the room we now occupy is left. the","55":" batt releived us to-night. I was up all nightwaiting for them but they did not turn up. wehave no idea how long we are to be here.","56":" It was a dark cold and wet nightlast night, we started G.G. this morning theusual time on and off. have heard nothingstartling.","57":" It was a cold morning thismorning \nstill on G.G.\n got releived off of GGabout mid-day, we are comingarty here & somebig guns came from Arras way last night. Stillin village, but expect to go out into SKn rd soon, also expect big movements here on this frontshortly, it is roumored that fritz is massingtroops here. 4th batt store blown up to-day asfar as I could gather there are 4 K. it wasmined, a place down from JelisRail Stn. nearthe cheateau","58":" A cloudy day with rainat intervals. hear now that the mine that wentup yesterday K 9 & W 8,I also learn that whenthe batt attacked my old Plt lost 9 K & 10 W3 of the W are doubtful cases. fritzs attackedthis afternoon on our left. we had to stand toobut he was repulsed, the news we hear fromdifferent Qrs is good and proves to be true\n\nwe also learn that there has been heavy fighting in Lens, we hope soon to hear of ouroccupation of this place soon, arty fire was heavyon our left. J.I.L.& G.Cp went to Bapaume to-dayfor H.N. they got back about 4 O'C remainder ofday quite\n20-4-17 It is a fine morning we haveheard nothing yet about moving altho there areroumors afoot about this went to-day to the cheateauto see a paper seen one of the 19th that is yesterdaysthenews we gotwas good the french advance at is good combined along with the british moveat Arras, it is reported in the paper that the Britishcaptured 226 big guns at Arras some, 8 in & a lotof 5.9, the guns had ample ammunition some of thebatteries of 5.9 had as much as 2000 rds with themthey are using the guns against the huns now, itcame thro late last night that the french hadcaptured 92 guns, we also see by the paper thatthe turks are still on the retreat we are still in thisvillage Beaumetz les Cambari but expect to leave itsoon for the firing line again arty fire very active on ourleft, some arty activity on our sector, our occupation of Lensthat is the british is confirmed by the paper that we sawto-night, fritz sent some HE over towards us this eveningit was quite close enough some of our long toms spokethis evening got warrned to stand too to-morrow morning.\n21-4-17 A cloudy morning arty fire still constanton our left it must be near Lens and towards Arraswe stood too at 4.30 this morning but there was nothingdoing, we are to move to the firing line to night do notexpect to be in for long\n22-4-17 Came here last nightin Suken Rd cloudy to-day arty fire not so heavy as usualwe are on G G here\n23-4-17 It was a fine morningfritz opened out for a while this morning he also putsome quite close enough 1 & 2 O'C this morningwhile we were on G G we expect to go out sooner now than we thought, Bdy was here and he said we would get a good spell this time so we will see. we are being releived by Tommy's the 11th Division\n\n\n\nIt turned out a fine day and fritz had 6 balloonsup aircraft were fairly buisy, we hear now thatAustria is suing for a seperate peace & that theyhave stopped for talks on that front, and that L.Ghas gone to Paris on some secret business, if all thatis true, things must be coming to a crisis, thereis one thing certain that is fritz is getting all he wasasking forall along, things opened out for a whileon our sector\nlast\nto-night it was not for long, otherwiseit was quite\n25-4-17 It was a lovely morning andcontinued so all day G.T& myself came here lastnight about 10 O'C(the cheateau) to act as gds forthe releiving party Tommys, the batt came out tonightour big guns were constant last night andwe learn from roumour that they are shellingCambari. took the Ty's up and brought our own partyback. got to bed about 1\/2 past 1 O'C things were verylively while we were up with the Tmy's. arty fire camefast and furious & fritz's H.Ewas very constantup till the time I went to sleep. we leave here foran unknown desternation to-morrow morning, 2 ofthe tomys were wounded while going into the trenchto-night\n26-4-17 It is cloudy this morningand looks very much like rain; we left the cheateauabout 10 O'C and got here Beaulencourt at 2 O'C it is notsuch a long waybut we had to do a lot of windingabout on account of the immense lines of barb wirefritzs put down here, he had some good position. Justabout this part, we passed while coming along todaythe remains of 2 of our aroplanes probably broughdown by fritz; we are camped in tents here, but do not expect to be long here before we move again, hear that Austria has finished fighting and thatRoumania is suing for a seperate peace but ofcourse we take no notice much of this, today is thesecond anniversary of the landing, there was nothingsaid about it to us altho I heard a band playingBoys' O.D I suppose there was a great day in Londonfor some of them. It was a wonder nothing was\n\nsaid about the event, things were very lively on thefront to-night, it is roumoured that the 2nd D attackedwe have heard nothing about the result yet, it wasquite on the front facing us, I received a letter fromV.R. dated 4-3-17 day before yesterday, this is the firstletter I have had for some time.\n26-4-17 It is coldand cloudy this morning. There is nothing doing asfar as we know yet, arty fire is active, a taube came overus this morning he was very low, this is unusualfor them for they generally keep well up. but theone this morning kept low, he did not stay long andour guns gave him a lively time. word came throfor us to be ready to move up battle Oder to support the 2ndD we moved away from here at 1\/2 p 12 O'C. P.M andarrived at our desternation at 1\/2 p 5 OC PM it wasinto reserves we went. not supports as expected the artyfire here is very constant & heavy & there are guns uponguns of all calabris,","59":" It was cloudy thismorning, we did not do anything last night asexpected. but our guns are very constant herethere was a couple of 9.2 Bty right near us and oneof them was speaking pretty well all night the 18pds hardly stopped, there is no getting away fromthe fact that we are giving fritz plenty of iron,rations, ammunition of all sizes up to 12 & 14 lbshells are seen everywhere, on this front is where the4th D had severe losses, we expect it tobe a big battle, we did G.G. here as usual, we lefthere about 1\/2 pt 10 O'C AM the name of this placeis and is about 5","60":" M'S from our campBeaulencourt, we hear that the british havemade another advance at Arras on a 10M frontArras is about 10 to 15 M from here.\nlast night\nwe expectto go up again to-morrow afternoon but to a different place, so we shall see, it is roumoured that 1000000men take part in the attack, of course it will be on abig front.","61":" It is a fine morning: the artyfire was very constant & very heavy last night\n\nwe hear that the battle near Arras as been oneof the fierciest since the war. fritz still sends aBertha over to Bapaume; we expect to go to reservesto-morrow things quietened down a lot this eveningit as been a lovely day","62":" We gotorders last night late to be reddy to move off at 9.30'AMthis morning to releive the 18th Batt who are in the sameplace as we wentto last friday we expect to be here4 days, we got here at 20M past 12 O'C, after a goodtrip. things are extra quite to-day, our planes thoare fairly buisy, 1 of fritzs was right over our linesthis afternoon. it as been a beautiful day withevery appearance of another to-morrow, the church inthe village like the rest have beenmined & blew upthere is a german cemetery at the back ofthe french cemetery. the french cemeteryis attached to the church like most of them are, we cast our voteto-day. the arty fire opened out on our left \nlast ni\nabout","63":" P 12 O'C we were on G.G.","64":" It as been another fineday arieplanes have been very buisy mostly our own this morningtwo of fritz's came over but they were up a great height, oneof ours brought down two of fritz's this morning, but they fellin their own lines, the plane that brought these down cameto grief later coming down near Friemincourt GT and Iwent over and had a look at it the plane itself was notdamaged much, but apparently the observer had had aroughtime , there was a good deal of blood about the partof the carriage where he sits. but the pilot got off lucky hencethe safe landing of the plane, one of fritz's planes was alsobuisy during the afternoon. we left here this morningand went down to the transport to look after some ammunitionthe railways are coming along at a great bat. The O'G is nowas far as the village while the -G is almost there too, we expectto be here until wednesday. we hear no news, much lately","65":" It has been another fine day the baloons areup to-day fritzs aroplane was over us again to-daybut he did not stop long, we heard, a roumour thisafternoon that within 16 days we will be at Salonikawhat tales wedo hear and we are all expecting\n\nto go up north, the trip will do me let us hope it is true. I will chance all the tin fish, today left us. it is roumoured for a staff job, good luck to himhe was a gentleman and I'm sure anyone that knowshim wish him all sorts of luck Mr C--n has taken hisplace as ad--t, the arty fire is constant today andabout 4 O'C this morning along our front, but more especially on the left of us the bombardment was heavyit lasted untill daylight. we surmise there was anattack but have heard nothing yet our aroplaneswere buisy to-night , stll on amm G.","66":" Anotherlovely day. fritz was shelling the B- rail this morninghe also put 2 or 3 into a transport camp our balloonsare buisy again today also our aroplanes fritz was over again this morning but did not stop long ouranti air craft guns soon got buisy we expect a heavybombardment to start tonight at 10 O'C by our guns we makea big attack in the morning. there are a lot of troops movingabout here just at present. G Bd & our Bgd.G. was herethis afternoon we all hope that the affair whichis a big one will be a great success' still here with ammdo the usual Gd tonight\n3-5-17 At 1\/2 past 3 O'C this morningour guns opened fire and continued a constant & heavy fireuntil about mid-day when they eased off a little There is nodoubt that the quantity of shells over to fritz have been greatfirst prs came along about 9O'C a lot of them were woundedhear this morning that the first one was a Leuit of the F.C hewas the piolt, while an observer & a Photographer were killed. it isroumoured that he is the one that as been over so much latelyhe was brought down with MG fire. troops & transports arevery buisy here at present, up till about mid-day a lot of ourown wounded have passed here in ambulances, motor lorries &omnibuses our casualities apparently have been pretty heavybut a lot of them are not serious cases. it as been a lovelydayand I beleive at last we are in for a spell of fine weatherwe are expecting a counter attack to-night or first thing inthe morning, fritz Ct Ad this evening but got repulsedwe left here to go back to HQ in J\n \n got there about","67":" P. 10 O'C and went on G.G.\n\nour guns were fairly buisy and fritz was shellingsome","68":" It is another lovely day fritz again Cd ATbut got repulsed, our own batt are expected to chargethis evening, roumour says that we have had 80 Ctiesup to the present Cpt T\n \nn, as died from woundsarty is pretty active to-day and I also notice thatthe Red + cars are buisy, see the 3rd Bgde moving upto-day, our aroplanes are buisy to-day, hear thatwe had some 18 pdrs blown out and some gunnersKld, it turned quite warm as the day advanced andmust have been 25dg in sun, if this continues we willsoon do away with some of our things, arty still active","69":" It is nother fine day, got orders to move from hereto-day to do ration fatigue to the firing line. got uphere about 1O'C PM and left with water for the firingline about 2 O'C got back about 4 O'C it was a roughtrip and pretty warm the arty fire on both sides,was constant there are 3 of our aroplanes flown firston the way up & a tank past the one on the rightsome of the trenches are just A\n \ny for some andcannot be improved just yet the lads are havinga rough time this trip","70":" It is another fineday, last night it came over cloudy and rainedjust a little but soon cleared off, we were oncarrying all last night, and got back hereat 5 O'C this morning, carried water againdry rations up and came back with stretchercases, we were all pretty tired on it when wehad finished the last time up we went throa barrage which was no fun, we expect to go upagain this evening,the arty fire is not quite asactive up to time of writing as it as been wentup as far as supports with water, the shelling isjust as constant & fritz as found the trenches in agood many places","71":" It is another fineday we went first thing this morning to close supportswith & Shls. The shelling is if anything moreheavier than yesterday, the Scottys made anattack this morning which was a success\n\n \n\nalso the 9th Batt which was also a success, we heardthat all are connected up, the scottys took asunken rd near the villiage, which, is quite closeto the villiage, fritz is shelling the villiage this morningvery heavily, our casualties seem to be pretty heavyby all accounts we are likely to be in the line againto-night, fritz as countered Atk. (Later fritz counteredatk but got a severe check, we are being releivedat 7 O'C this evening by the 2nd Bgde, got outhere Jaluex, at 1\/2 past 8 O'C. expect to be here tonight and to-morrow night, I hear now that ourbatt had 50% casties, it started to rain this evening","72":" It was a dull morning and continued soall day with odd showers, fritz again C. Attkabout 2 O'C, but got repulsed, there is somevery heavy fighting going on on our sectorif we shift back from here, I do not expect we shallpass the tents at Beaulencourt, B-HC got Kd thistime so did Sl-Pl both out of the old Pltoonthere will be a good many marked missingon this front, one thing I noticed our aroplanes held the surpremcy of the air, they were up inlarge numbers. I only seen fritz once whilewe were up there & then he did not stay forlong, arty fire was very heavy about mid night musthave been CT or Chg have not heard anything defentieabout it yet. it was very dark 55th and that part ofthe D passed thro here about 11 O'C. on G.G. here -","73":" It was a lovely morning arty fire stillconstant, this is one of the toughets battles yetfought on this front. I hear this morning thatD Chas now 39 and that one Pltas only got 2in it we have had apparently a heavy casualtylist, but fritz must be heavier, a lot of leavepasses are being granted to Bty. we left hereafter dinner to-day and went to the tents that weleft, near Beaulencourt, we expect to hear aboutgetting a spell, there was a lot of troops passingus when we were coming out, the front we\n\nhave just left was the hottest we have experiencedyet, bar P\n\n , first time.","74":" It was a splendid morning & got hot as heat goes hereduring the day, we expect to hear soon aboutgoing into the line again, roumour has it thatwe will be wanted again soon, up on theH\n \ns front. Could hear the arty fire lastnight from here it seemed to be fairlyconstant. had a visit from Gl. B\n \nd to-day remainder of day quite","75":" It was anotherlovely day, we hear now that we are likely togo out from here a bit further, the arty firedoes not seem quite so heavy now, news fromother fronts does seem scarce now, for wecannothear anything much, or even see a paperit continued fine & at times a bit warm all day ----we had a bath to-day, the arty fire was heavylast night about 12 O'C.","76":" It is anotherfine day and we hear now that we are likelyto move back a bit further, there was a machineover us this morning, but the anti-craft soon turned them, we hear that the 5th D. S----tys andanother B----h Bg went over and took early this morning, arty fire\nseem\nis constant rightalong the line t0-night.","77":" We were up at 3 O'Cthis morning, and moved out at 5 O'C. we arrivedhere Bazentin Le Grand \/ about 10-45 O'C. A.M. we passedover the old battleground, and came thro Fl.....rs my word not so long ago. fritz was heaving someof his coal-boxes into this villiage. we passed rightthro some of our old haunts, that is quite close toour dug-outs one time, past the maize, fritzs follywe could see on ahead Le SarsLigny-Thloy , theseplaces have been under our eyes for a longtime, but under different conditions the , just on the entrance to Fl...rs then onealong the sunken rd made me wishIcould delay and have a good look around.I could have found a lot to interest me here\/\n\nThings are quite different here now nice green grass, the camp's the are all desertedwe passed close to De------e wood also H--H woodand could see the old hun M.G posies and thetank, it would be of great intrest to look roundthe whole show, we struck A----y corner insteadof taking the old rail route we swunground& took the sunken rd. things down here too areon the quite side now, not so long ago my wordthe trafficthat was here, and the guns and ammunition that was here, it is great workwhenone looks back, and sees the positions thatfritz held, to say that they have pushed himso far, the captive balloons both quite smallat the back of us, we reckon we came about8 M this morning. done W--r. G. for day. we can justhear the big guns from here, expect now to be here aday or two.","78":" It was a lovely morning altho itrained some during the night& a light shower thismorning, we got ordered late last night to be ready togo back to Bapaume to the A----c, D---n C---p for two Psrsso we left just after breakfast, we came over the old trainroute via Clarks Dp & then over the old Btt-e ground viaYarra bank my word there are a lot of dead here, especiallyalong the first ridge there are a lot more fritzs here than anyothers, one place at the enterance of a big german dugout there is a heap of them buried, that is with a bit ofdirt thrown over, it seems as tho they had been bombeddown the dug-out, then had been thrown out on top ofthe parapet and buried as aforesaid. O--rs, S---r, B'sand all sorts are to be found along this particularridge, and then they are featured right across toLigny-Tholoy , we pased thro this village, on our wayto the main rd. here we picked the main Bap---e road up, it is about 1 M from this point to Bap---e we had dinner at D---n - C-P and brought back 6 - Kand while here we seen one of the prettiest piecesof work we have yet seen, by a fritz aviator hegot away clear, hear to-day that we are likely\n\nto go up Nth, also heard that the R---- n's arelikely to posh star, if this is true, then wethink that things are looking serious for usIt does seem strange to walk to-day over the railway trackto the firing line, last time we werehere things were alto different, there was a extraheavy bombardment this evening and continued till I went to bed then you could hear thedistant rumble, we reckoned that it is a good6M from here to B---me , got back to camp about5 O'C and got caught in a heavy shower, C---lH-----e went on leave to-day.","79":" It is a dullmorning this morning, G.T. went to Ribemontthis afternnon. hear that the 4thD for certain havegone Nth, our own movements are uncertain -nothing startling have we heard.","80":" It ismorning & the change was quite suddenit came on to rain about 1\/2 P. 1. O'C combined witha piercing wind, we hear now that Bellingcourt as fallen into our hands, but that the huns areattacking with great force, but get beaten backeach time, with of course heavy losses, we alsohear that the french have taken another villiage& also that the british captureda small villiagenear Yepres , remainder of night quite -","81":" It was a cold morning this morningit rained a good deal last-night and alsoto-day at intervals. expect to move fromhere soon, but have not heard yet where we arelikely to go, there are some fine samples of hundug-outs just across the road from here, theyfully intented to hold all these postitions by the trouble they went to, our arty hereagain played up with them, and judging bythe damage done to the light raily's here itwould be hard to get better shooting, not far fromhere the rail is along with a lot of track soknocked about a lot, this againprovestheaccuracy of our arty\n","82":" It was a fine morning, went this morning with P--N for a walk we have heard nothingstartling a roumour tho is in circulation that we goto when we move, quiete remainder of daystill in same camp.","83":" Cloudy this morning, but we have heard nothing startlingbut all the same it seems to be a known factthat we move out from here in a day or soThere was an aroplane up for a considerabletime to-day, an hostile one of course, there wassome great shooting done by our anti-aircraftso needless to say that the hun aroplanesoon evauacuated, remainder of night quiet.","84":" It was a fine morning this morningwe went for a walk with Po---r and wentto the old position, that is at P-------s, but sorryto say that we could not find the time tohave a good look round, we went totheold trench, that is the front line where the3rd B----n first held a position on this memorial battlefied, we could see in the distancethe old german trench, and the continuationof our own communication trench, of course needless to say the villiage as it now stands to-day after nearly 12 M-S has elapsed is practicallythe same as on the morning when we chargedfor that goal, the main A----T and B----me turns thro the head of the villiage andwas to-day buisy with motor transport ofall discriptions running no doubt to B----me the grass around here is wonderful and is in places is knee deep, we leave this camp according to all accounts for Beauhtomorrow morning.","85":" Left here this morningBazentin Le Petitfor ,we had a good journeydown it is about10M got here for dinner startedabout 7 O'C lost packto-day, we are now in this is were I went on leave fromTwo were taken last night for being\n\n\n\n very dis-orderly and d--k, saw here to-night, have not heard how long we are likely to be here, it started to rain after we got here & we also had a shower along the rd town P--k and turned in about 11 O'C","86":" It rained a good deal last night and were raining this morning when we got up, we heard last night that we are likely to go back to H--'s front, but myself i do not think so, remainder of day quiet","87":" it was a lovely fine day went this morning for a walk with P--r, we done to this morning the first for a long time, have heard nothing about my pack. I think it is a B--d. Things are beginning to brighten up a bit but we now have which opened to-day a H--C--r, leave to started to-day.","88":" It was another fine day P--r was Se--ed this morning to H--d L--r , hear now that we are going back on our old front, hear nothing startling as regards the war, received a letter this morning from home dated 2.4.17, went thro this afternoon to B---x with P--r returned about 6 O'C we had a good walk","89":" it was another fine day. G.T went to A--s to-day, went with L.D. Now to cemetery expect to go to A---s to-morrow, remainder of day quiet.","90":" It was another fine day in fact it was quite warm and what added to the affects of the Sun was the dust that rose from the rds, don't feel to good to-day and refused leave to A-s it is no use going there the way I feel am thinking to parade sick to-morrow. Quite remainder of day. There were aroplanes up last night, and could see one when we were on the rounds here however nothing yet about a move.","91":" Another fine day, church pde this morning. P-er went to A-s this morning, did not bother myself, as I was not feeling quite up to it. Nothing strtling to record, other than that I find\n\nout that my difference between the and myself will be balanced by the 8th of August. P-er came back from A-s to-night, C-ten had poor staff to-day expect to get better to-morrow.\n","92":" Another fine day, our C-el is back with us again. Mjr C-ris a most popular man among us, some of our lads are going down on a sea side trip, which took a fortnight the rds here now are getting quite dusty, & it is more like the thing that suit us now, it is hard to think of the winterwe put in what with mud etc, but it is a lot harder to have done it, good weather is a great asset, to have of course we cannot expect it always, went to Es-nt last night when on p-l, ha no trouble, it turned chilly early this afternoon, see by the paper that the Austrians are making a great advance, nothing else startling except the great air rd on Blighty","93":" It is cloudy this morning and looks like rain it rained some last night, our serg went to A-s yesterday we are likely to be out fr some time according to all accounts, remainder of dayquiet","94":" P-d sick to not to good think I have a touch of trench fever nothing startling to enter up","95":" Fine day am still cruck and do not expect to do much to-day, things are quite","96":" P-d sick again this morning but feel a bit better our serg & P-er went to A-ns this afternoon Our serg & P- went to A-ns, but they returned, remainder of day was quite & the weather as been quite hot. Sometimes we find it quite to cope with France's inclement wether however this is not quite the state of things as we would wish to see them as the present. Re note the date. to-day & good luck to them, that is way that it seems to meet me. - what then is it - now to here \n","97":" Another fine day, went sick again this morning got L.D. remainder of day quite","98":" Another fine day, Chr-P-de this morning felt a bit better came back last night, hear nothing startling remainder of day quite,","99":" It was a fine morning hear that we go from here in about another 9 or 10 days time, there are D-sports coming off next Friday. Could hear a bombardment this evening but could not say where it is Sounds near Arras front remainder of day quite;","100":" Another fine day, there is a rumour going the rds now to the effect that we leave here in a day or two that is we expect about Friday, remainder of day quite.","101":" Another fine day it rained first a few drops early this morning, we expect to go from here soon, but to where we do not know, up Nth we think: troops passed thro here this morning, 1st D E-ers, but could not find out where they were off to - remainder of day quite","102":" A fine day again, Goods news from the North, where the british have made a good advance, (cat police-coome soo) to-night about 1\/4 past 10 O'C remainder of night - quite","103":" It was cloudy to-day, but sultry & it rained a little last night it is thundery weather, we can hear the bombardment here now it sounds in the direction of our old front, and it must be good size stuff, for we are a long way from our old front, here (Beauah) good news again from the Nth","104":" Another cloudy day & sultry too, Bgde stunt this morning went out to near Albert, in the old trenches there, it was more for aroplane sighting that we were out, the country\n\nlooks just lovely about here. Met C-n, still going, I am still at the same job","105":" Another cloudy day, was up at 2.30 this morning and went back to the old trenches and made a capture 3 one more of the 51st batt, and they had been out 11 Wks. Church pde was held to-day, we took the prs down for a bth this afternoon good news still from the North. We expect to move within a day or so.","106":" It is a dull morning, we had a severe thunderstorm last night, which came on very sudden, and the lightening was was something terrific, we heard to-day of course the usual roumour that we are likely to go on our same old front that is Bullecourt and not up Nth a all well time will tell. D sports are held to-morrow we hear, they should be good","107":" Went to D sports to-day it is a good walk via Henencourt","108":" Went to D sports again to-day","109":" Went to-day to first Anzac D.C. had a good walk and got back again about 1\/2 past seven O.C it was fairly warm","110":" Got paid to-day our serg turned up this morning. Can hear bombarde it as been going on fairly constant for some days now.","111":" our serg went away to-day to hospital it has been pretty warm to-day and one can get quite enough of it without any pack or in fact the rifle is quite enough to carry hear we move soon","112":" Another fine day, can still hear the bombardment, heard yesterday that freddy M-n got killed this time in line. Bgde church Pde this morning, had tiff with C-n Cpl to-night. hear nothing much now about a movement.\n","113":" Twelve months ago to day we were at Sailly, it is my birthday to day had a good one last one, but I'm thinking this one will not be so good, it was very sultry this morning a thunderstorm came on about 1\/4 to 3 O'C this afternoon accompanied with plenty of lightening","114":" Another fine day went on pde this morning. Things are quite.","115":" Another sultry morning went on a bit of a route march this morning, it came on a thunderstorm this afternoon but it did not last long. No news much of anything","116":" it rained a lot to-day & some last night went went early this morning that is 2.30 O.C. to old trenches again, but did not do any good, we do not hear anything about going away yet, nor do we hear any news much about things in general, that is what concerns us the most (the war) we would like to see something more defenite about . Otherwise things are quite.","117":" Cloudy this morning, heard to-day that the huns have evacuated 17 kilos bhind Cambari , rained during the afternoon nothing startling to enter","118":" Another cloudy morning see nothing in paper about evacuation rained during the afternoon, but not for long and cleared up things are much the same","119":" It was a lovely morninghad b-n concert last night and it was a great success hear now that we are likely to move next Thursday& get Pd Tuesday, but where we are likely to move to is not forthcoming Ch-h Pde this morning continued fine to-day\n24.6.17 Cloudy this morning first thing, but fined up as the day went on. Went to Warloy to-day it was not a bad trip. We got back here at 1\/4 to 3 O'C P.M. G.T. the Corp and myself went. We expect to move from here next Thursday","120":" Another fine day, nothing doing, have heard no startling news.\n","121":" Another cloudy morning a few of our B-n are going to Paris for 4 days mostly N.C.O's are going, nothing else to record worth while.\n27.6.17. Cloudy again this morning. Hear that we are likely to move from here shortly, nothing startling to record \n28.6.17 Another cloudy morning, we got orders late last night to be ready to move off last night, there was a kit inspection yesterday afternoon, but nothing was certain, however last night we got the right thing, and left Beauh this morning about 7 O'C and after a tough * march arrived here, on outskirts of Mailly, about 1\/2 past 11 O.C so it is a good step from here to Beauh for we did have much of along the road. We are here camped in dug outs. They are good and substantially made they are our own make, and are the best I have seen of the road, according to roumour we are to be here for 10 days and are going to get a stiff bit of training. the D-ke of Cr-gh visited our grd, picked from the 3rd B-n it was a grd of honor representative of the 3rd Army, the","122":" B-n band was also complimented on their playing. We are surrounded here by villiages & Mailly are actually villiages just a nice walk away a little better than a mile\n\n* write more about this when time affords the opportunity.","123":" It was cloudy this morning and also very sultry, we went on a attack stunt, and were away from camp about 4 hrs every thing appeared to go off pretty well excepting the last of it when on the sunken Rd and officer gave the order for our to - * remainder of day quite -","124":" it was raining this morning when we went on pde, we found out it was to be an inspection of the 1st Bgde by we marched about 2M then brough up in review order on the Pde ground, & after waiting for about 1\/2 an hour, the rain had stoped by this time and Gl off-r inspected us after this he made a short speech -*, we then marched part of the above mentioned accompanied by the massed bands, wet C-n opened here yesterday we can hear the constant rumble of guns here in the distance, remainder of day quite","125":" It rained last night and was cloudy again this morning we expect to go on a night stunt to nigh. It continued cloudy thro out the day and also turned very chilly, remainder of day quite.","126":" Another cloudy day, was on Gd last night. Another C- in the C-k brought from the village close by. Dick-en is his it turned out a fine day, we left here for Mailly after dinner to day and got her about 5 O'C, it is a fair sized place & it is about 2 1\/2 to 3 M's from where we left, it jas been neglected a good deal & some of the buldings are almost falling down * Gone ptl to-night but things were quite, hear now that we are likely to go back to B-\n","127":" it was cloudy first thing this morning but fined up as the day wore on, in fact it got quite warm after dinner. We were up this morning at 4 AM and left the villiage @ 5.30 AM we went on a D. S-P and had a long route march, we passed thru Hamel en route this we came back on to which completed a good journey and arrived back at our billets at 1\/2 past 2 O'C remainder of day quite.","128":" It was raining this morning and started to rain last night or early this morning and we got caught, fruit trees - * hear that we are likely to have a night stunt to-night the guns on our left could be heard quite distantly early this morning. See by the paper to-day that the Russians have started a big push & captured 10,000 prs, remainder of day quite.","129":" It turned out a fine day, we left here (Mailly about 1.30 O'C and went on a night stunt we arrived back here about 1\/4 to 9 O'C, the ground we went over to-day, has been the of some heavy fighting, there are plenty of dead here huns, never noticed any of our own, altho i expect there were plaenty of them here too, but we could not the hun for we seen plenty of evidence to tell us they were hear - * we are expected to to move from here to-morrow back to the villiage that we left, when we came here, remainder of day quiet.","130":" It turned out a fine day we left Mailly at 7.30 this morning and after a good march got back into our old billets about dinner time, our next move we expect to be Nth, we can still hear a heavy bombardment from here Beauh sounds of here to be on over the front. Bullencourt, done Ptl here to-night things quiet","131":" Another fine day hear that we are likely to move anytime now, Gnl and a few more details otherwise things are quite","132":" There was a heavy thunderstorm last night and it was raining this morning, and continued showery.\n\ntill about 2 O.C this afternoon when it fined up we went to Warloy to day and brought back Sw-n See by paper to-day account of another big air raid on London. Cas's 178 all told K and W, great success of air raids by french on german towns te rats here are a pest","133":" It is cloudy again this morning it also rained last night! continued cloudy all day with occasional showers; have heard nothing startling as regards war, but read in paper of the shock that Mr H-rn got when Genl-H-es got K yesterday, we expect to move from here next week up Nth with the best of luck. we hear quite a different lot of romours, as to what we do when we get thee, one romour to the effect, that we are make a new landing but i think this is not likely. but whatever it is, it will be pretty stiff. I favour Lille myself the taking of which will be in itself a big undertaking, table talk this morning in billet - * remainder of day quite.","134":" Another cloudy day, bombing accident this afternoon on Pde Grd 11 injured, including 1 D-r. Fritz still goes backwards and forwards to work thro here every day, they look healthy and big enough the lot of them. A roumour going the rounds that an A-n mail, that is from A-a to the front has been sent, but we have seen nothing in the paper about it yet, remainder quite.","135":" it was a fine morning and continued fine thro out the day had alarm at 2nd Batt to-night -* otherwise things quiet.","136":" it was a lovely morning and turned ou a beautiful day, hear to-day that we are going away for a couple of day's & then back here. We are it is roumoured to be inspected by the K-g at a place called Bray. A concert was held to night and was a great success.","137":" It was a fine morning and continued fine thro out the day, we left here this morning for Bray, but\n\nbut pulled up at some huts about 2M's from Bray the name of this place is Plaetaran we came via Fricourt and Becordel and left Albert on our left. After a good march we got here about 11.30. The troops were inspected yesterday along teh rd near Albert by the K-g, and not at Bray as expected, got Pd this afternoon, we expect to be here about 4 days & hear that we do not go back to Be-h as we expected. heard this evening that the huns had broken the line near , and captured 1200 prs including 32 Oers, but that the position had been retaken & some of the Prs taken back again.","138":" It was cloudy first thing this morning, it is two years to-day since I left Australia, all came up from Bruie last night. It rained this evening.","139":" it rained a lot last night. Just over the ridge from this camp in the village of Susanne just over the next ridge and near the villiage of Capplet was our front line 12 M's ago and when we advanced at P-ers they were fighting here, they also put the huns back from here last September, we went to Baricourt this afternoon which is about 1 1\/4 from here, the ground here is not shelled near so much as some we have seen, could see the baloom from here a long way off tho.","140":" It was cloudy this morning, our and Bldy went to Warloy this morning it was showery all day and continued so untill lights out, heard today that Holleweg had resigned, retired. big gun in the woods here -* name of woods","141":" It rained a lot last night and was raining slightly at revallie, find out that the news of Holleweg is correct, things quiet to night.","142":" it was a wet morning, went went on a route march this morning, and passed on our road Troano Wood, got back to camp at 12 O.C midday, it is a bit muddy at times it continued cloudy thro out the day with odd showers.\n\n19.7.17 Another cloudy morning the 1st and 2nd B-n went on a night stunt last night, we expect to go to-night on one, we hear nothing startling about the war. The roumours about the british forcing a landing at Zeebruge on the Belgium coast is not true, the remainder of day quiet.","143":" It was a fine morning, hear that we are likely to be here for a day or so yet. Went on a route march again this morning passed Mem-z Siding. This is on one of our old tracks that we used to come along last winter going into the firing line, these rds now that had so much traffic on them then are quite different now, not near the traffic & of course then they were covered with mud. C-t-M-l held by one O.C to-day. At the Rail Hd just about 1\/2 M from here was one time one of the biggest dumps on this front - * can hear arty fire and it must be very heavy stuff for we are a long way from the firing line here, things otherwise quiete.","144":" It was fine this morning, we went on another route march, it was a bit longer this morning went thro Maricourt, on the rd to Paronne. Got back to camp about 1\/2 past 11 O'C, it turned out a sultry day after we got back, and came on a heavy rain about 3 O'C this afternoon, a roumour is in circulation the the british have made a unconditional surrender at Saloniki, but do not beleive it. The bombardment still continues on this front.","145":" I was a lovely morning, we hear that we are likely to move on wednesday, and are going to the north again, Ebblinghem. This is the first villiage we billited in, after landing here last March 12 months. The arty fire is still going strong it was very pronounced last night, heard that the B-n's got a check, last news we got was that they were advancing at a great bat, remainder of day quite.\n","146":" it was a cloudy morning again, we hear now that we are likely to entrain@ Edge Hill Boa-ty was sentenced this morning to 60 days 2nd F-d -* remainder of day quite.","147":" We left Plet-en camp camp this morning at 7 O'C and arrived here, Beaurie at 1\/4 past 11 O'C after a pretty good march, we expect to be here only a day or so and then go up north, remainder of day quite.","148":" It was a fine morning, a very heavy thunderstorm came on this afternoon about 1\/2 past 6 O'C it lasted about","149":" an hr and was very heavy while it lasted, expect to move from here to-morrow evening, one of the band's men broke a blood vessel this afternoon while playing football remainder of day quite.\n","150":" It was a cloudy morning, expect to move from here this night or early tomorrow morning. See by the paper that the hun are giving our front from coast to Ypres a terrific bombardment, got orders last thing to be \nable\nready to move early in the morning.","151":" got in the train at Edge Hill about 3 O'C this morning and left soon after, got to Cassels at 3 O'C P.M this afternoon, then had a route march of about 4 M's to here Nieppe this place is about 3 Kilos from Ebb-m, where we billited last March twelve months, when we first came to france, the country here just looks splendid, we can hear the guns from here and they seem to be very constant, aircraft also are extra buisy seen today 5 of our aroplanes coming in to be repaired. We expect to route march from here to belgium. We are not likely to go south again for some time to come, it turned out a lovely day in fact it was quite warm in the afternoon, done Ptl to-night","152":" It was a nice sunny morning we are billited here in a big barn, it was a fine day thru out, the aroplanes are very buisy here. There is a big arodrome just at the back of this villiage. We seen 8 of our aroplanes come in\n\ntoday I think they must come off a big front the rds here are splendid, and motor cars & cycles scorch along at a great bat. Things here are a bit different to what they were further south, cleaner homesteads) And things are neater altogether, a lot of the people speak fair english.","153":" Sunday, church pde this morning was not held, on account of a very thunderstorm came on just about when it was time to form up, we are doing night duty here combined with fire picket. There was a heavy bombardment about 1\/2 past 3 O'C this morning, on the flemish front it would be, it continued dull & showery thro out the day.","154":" It was a dull morning and rained at intervals during the day. The arty fire still continues heavy. Seen some more of our aroplanes come in to day they were knocked about a good deal * - quite otherwise.\n","155":" It was another dull morning, the ba-n went on a route march this morning am still on P.L. duty, received from Bhty the needful this evening. We hear of great roumours about our troops making a great advance, it rained off an on during the day.","156":" It was raining again this morning, and rained very nearly all the night, things are still lively on the front here according to the papers. And the arty fire is heavy, passed over this afternoon needful to an officer, hear that we are likely to move again soon, it rained more or less thro out the day.","157":" It rained pretty all the night and continued thru out the day, have heard nothing yet about the needful hear that it is saturday we move, see by the paper that another big offensive as started, and so far is a success, the arty fire we can still hear.\n\nJust up the rd there is a Y.M.C.A which was robbed on the night of the 31.6.17 -* 400f. he same night the german shelled Hazel-ck with a long range high velocity gun. We could hear the explosions which seemed extra strong for aieral bombs, which we thought thay were at the time, could not here what damage was done, but very likely he was after the rail head, continued raining thro out the day.","158":" It rained pretty well all night and was raining this morning at 5.30 had a funny experience last night with Call-en -*, our came back this morning, done the usual P.T.L last night heard to-day that the German shells did not do any harm to Haiz-ck, done the usual P.T.L. to-night.\n4.8.17 It was cloudy this morning, we left here at 1\/2 past 10 O'C this morning with 3 prs Pull Beasl-y and another for the 1st Anz D.C. we went via Ebb-m, Lyon to Steen-que, it is 15 Kilos from here we arrived there about 1\/2 paast 2 O'C had a bit of a snack and while we were so occupied one of the heviest showers came on that, we have experienced here it lasted for about","159":" of an hr, we left after it finished for the return journey we caught a Amb- at the D.C. and came back via Haiz-k here we had a look at the damage of fritzes shells for ourselves -* we caught a rid in a M-Lorry for about 4 Kilos and got back here at 7 O'C. It continued fine for the remainder of day. Can hear the bombardment again there is a roumour about that we move next tuesday, and are going away\n\nfor a day or two, and coming back to here.","160":" It was a foggey morning, Church pde this morning. Bill Mc-le & Sam came back to the job this morning. The day was quiet, it never rained & was fine thro out the night.","161":" It was cloudy this morning & continued so thro out the day Crt Martl to-day at Bgde, hear that germany as put a new peace offer out but have not seen the paper to-day, remainder of day quite.","162":" Another day of clouds, our L.C. C.Cp went to Blighty this morning do not hear much of the arty fire now done the usual P.T.L. last night, remainder of day quite.","163":" It was very sultry this morning. And continued untill about 7 O'C this evening when a terrific storm came on accompanied with very heavy rain. Horatio V- got 4 days 2nd F another got 42 & Smi-th got 90 dys 2nd F. for overstepping leave in Bl-hty, we are under orders to move off from here in the morning, and roumour as it that we will be in teh firing line on Sunday, somewhere in belgique. It rained a lot during the evening, but was quite otherwise.","164":" It was a fine morning, fritz dropped about 100 bombs at 4 O'C this morning on Haz-k we were up at 4.45 this morning. I seen for I was on P.T.L only one anti aircraft gun fire at the huns this morning. We left here at 7.30 O'C and arrived here Sec Boisat 1\/2 pst 12 mid day after a long march *- we hear now that there were some casualties as a result of the air raid this morning, the fritze were shelling with a big gun 17in naval gun H.V. when we were nearing the town this morning there were a lot of civilians getting out of the place as we approached it\n\nand some of them looked quiet bewildered and it is no wonder women with children & just a few little nick nacks that they apparently gathered togeather in a hurry * - it is such a pity that such people should suffer * - things were quite this afternoon we wentfor another march this evening. Done P.T.L. as usual & got to bed 12 O.C","165":" It was a cloudy morning again but the sun came out at times more bombs were dropped in this vicinity early this morning, heard later that 44 were killed as a result of the raid, Haz-k was shelled again this morning, about 8 shells were sent over, they make a terriable noise going thro the air, and the explosion of them is terrific when they land, heard to-day that we are likely to go on to the coast from here. We are not far from Hetram where we were camped last year. Got Pd this evening, got the return of the need to-day after a lot of trouble. Done the usual P.T.L to-night, our aroplanes were very buisy this evening.\n11.8.17 It was another cloudy morning no bombs were dropped last night by fritz in this vicinity. The shelling was very heavy on our right in the direction of Lille front by the sound of them, big guns they must have been for we are at the nearest point to the trenches, front line, between 16 & 19M, no big shells were sent over to H-k last night, our aroplanes were very buist during the night. Came off P.T.L. at 1.30 this morning, expect to hear shortly of a big advance, & us in it, our & commie along to went to Steenkecque this morning with H.N-son & two more Prs they got back about 1\/4 past 4 O'C this afternoon, they reckon it 10 kilos from here, quite to-night, came on a very heavy thunderstorm about","166":" past 9 O'C to-night. Seen a woman and her son apparently *","167":" it was a fine morning. Ch Pde this morning, can hear nothing yet, definate as to\n\nwere we are likely to go remainder of day quiet. Another cloudy sultry morning hear that we are likely to move in a day or so Went today for Puel-en, it is about 10 kilos from herelec Bois Rail stn to Steen-que, and 10 kilos back we got back about 7 O'C this evening after a good walk, remainder of day quite","168":" It was a cloudy day thro out, but did not rain much, have heard nothing startling.","169":" Another cloudy day. Got new pr of boots to-day, a good many are going on leave to Blity now, remainder of to-day quiet.","170":" Cloudy this morning, but no rain. B-n went on a 15M route march to-day. Dris-l and Thom-son went to Steen-que this morning with Burns who got 90 days, the 1st Anzac D.C is still a Steen-que . Fritz shelled H-k again today sent about 8 shells over, there were also some bombs dropped on a big arodrome about 16 kilos from here - a lot of people got away from H-k to-day and to-night woman bein carried away from the town to a farm house close by here, H-k is 4.6 kilos from here, remainder of day quite.\n17.8.17 It was a lovely morning our went to B-ty this morning we do not hear anything about shifting yet. 4th B-n had sports to-day, had a 3M rd race otherwise things quite","171":" Another lovely day. Fritz was over last night, but did not stop long for the anti air craft guns, soon made a scatter, and fritz soon made himself scarce, there were no bombs dropped, he was also over here early this morning but did not stop long, there were 4 people K as the result of the big shelling from fritz , that were all old people & civilians, 3 old men & 1 woman, the arty fire is getting constant and heavy again, heard that up on the Ypres front last night, 250 D-rs Arty\n\n, also about 250 other causties among the infty, while changing over, also some found out that the huns did drop about 6 bombs on Trazalle * villiage last night, but do not hear of anyonebeing caught our Bgde H.Q. are there & the 1st &","172":" B-tnsare billited there. constantly hearing different reports now of the Ypres front, but at the same time are convinced that it is a much hotter corner to be in than when we were there last year. Sec-Bois is 1k from here, remainder of the night was quite.","173":" Another fine morning & our L.C. C-p came back to-day. Wehear that we are likely to move from here next wek, C-ch Pds, was held this morning - it turned out a lovely day thro out. more bombs last night from fritz, but they were dropped a good distance from here, remainder of night quite.","174":" Another fine day, went to Steen-beque & brought Beas-ley back. more bombs were dropped to-night but well over, the huns did not stop long. Our arty fire again active along the front","175":" Another fine day things were quite the were no taubes over this evening done the usual P.T.L.","176":" It was a lovely day, went on a march this morning & was inspected by Gl. Bir-d, this battalion * we went via Sec-Bois villiage. We got back to billets at a 1\/4 to 11 O.C, also passed thro Velue Be-que it turned out a very sultry night, fritz's was up again to-night & came right across here, but did not drop anything handy, some bombs were dropped by the sound of them, think 9K 6 from - one big trench light got right on the first machine *- things quite remainder of night.","177":" It was cloudy this morning & sultry later on during the morning, it came on to rain but\n\nwas only a shower, one of our aroplanes was forced to land nearby this morning in a wheat field, the machine turned over but the piolet did not get hurt * it came on very cloudy this evening & there were a few showers. No Bocher over to-night, met a O-r, after talking about Sec-Bois etc *.","178":" Another cloudy morning G.T. went to Steen-bque this morning, saw C. Tea-ny to-night. No aroplanes were over to night, turned out fine but was windy.","179":" It was fine this morning and continued fine thro out the day, went to the A.M.P's this afternoon D.H.Qrs for lecture the are in the villiage of Vaulers B-que, this is a fair size place there were no taubes up to-night, it was a beautiful starry night. A lot of our planes were up, and the flares they drop as signals are very brilliant.","180":" Church-Pde was held this morning. It turned out a lovely day, towards night it came up cloudy & about 1\/2 past 8 O'C it came on to rain very heavy & continued on for about an hr heavy when it eased off things otherwise quieter.","181":" it was a cold morning & also cloudy, hear no arty fire much now went down to the mill this morning * came on to rain this evening & continued to well into the night, still on P.T.L.","182":" It was very windy & squarly this morning, been on duty G. Bird & G. W-pass this morning another march past, hear that we are likely to move again soon, it continued showery thro out the day heard heavy gun fire this afternoon. Thunder like on the coast, otherwise quite.","183":" Another cloudy day, it rained early this morning, continued cloudy & rained at intervals during the day it was raining when we went to bed, arty fire is getting lively again on Ypres front remainder of front seems to be quiet.","184":" Another cloudy day, see by the paper of the great Italian advance, and expect to hear some good news soon as regards our front\n\nour returned from B-y to-day heard this afternoon that we move for the trenches in a day or two, we expect to be in only for an attack, then out again, it came on very cloudy this evening, still on P.T.L.","185":" It was cloudy this morning & started to rain about 8 O'C. See by the paper that I-ns are still advancing, that the R-ns are still going back & that the Ub-t menace is still keeping up a good average. S.T & D-ll went to Steenbecque to-day with prs, it turns out a lovely night, our aroplanes were up to-night, the bombardment was heavy by the sound of it, it was right along the whole front from Ypres to the coast, otherwise quite. I forgot to add before the for the last 3 or 4 days, red cross ambulances to the No. of about 30 each day, have passed us on the bridge, this is the results apparently of the H-ls being cleared out to make more rooms for more cases, about 10 cars were stretcher cases, otherwise things quite.","186":" It was another cloudy morning, there are movements, which point towards us moving shortly, more than likely into the trenches, it was cloudy thro out day with occaisonal showers. Arty fire still constant. Seen one of our aroplanes up this evening - * windy) still on P.T.L.","187":" It turned out a moderate day but was cloudy & rained first thing this morning. There were some of our aroplanes up first thing this morning. Chr-Pde held this morning fritz was up to-night, came across here about 10 O'C but did drop any bombs handy.\n3.9.17 I was a lovely morning, and our aroplanes were very buisy from the word go. The arty fire was very constant & gained in violence thro out the night. See by the paper that the Italians are still advancing we expect to move from here Wed next. There is a roumour afloat that a german squardron is out in the Baltic, so something might come from this, continued thro out day, fritzs was over again about 1\/2 past 9 O'C, but did not drop any bombs handy, remainder of night quite\n\nas regards raids, but aroplanes were up all night long, mostly our's, still on P.T.L. G. W-r presented a cup this morning to D.Coy of this b-n, won at the sports some time ago.","188":" Divn sports at Heenin-crt, & cong-ted, this bat-n as the premier b-n of the division.","189":" it was a beautiful morning. G.T left us for to go to his Coy to-day, had a letter from H. P-er yesterday afternoon he is at Le Havre, aroplanes were very buisy all day, the huns were over again but did not drop any bombs handy. They were across in large numbers.","190":" Another beautiful day about 8 O'C the arty opened up, but up to this time it had been very quite, in fact one time last night we could not hear a gun on the whole front, between the time it started 8 O'C this morning the gun fire got to a very heavy bombardment by 10 O'C. B-n went on a march this morning full Pks, there is a thrasher just across the road at the next farm & they do work women & old men mostly. Fritz did not come to-night.","191":" It came on a very heavy thunderstorm first thing this morning, the thrasher is thrashing now for people that own this place. We do a little helping when we have time. We cannot get any papers at all lately, hear bad news as regards R-a do not expect to hear much else as regards them, we expect soon to hear good news as regards this front, the arty to-night about 8 O'C. got to a terriable drum fire, this seemed to be about the Lens sector, remainder of front seemed to be fairly quite.","192":" It was a dull morning, hear very bad news in fact read account in paper this morning of R-n retreat. My own opinion of the R-n crisis, is, it opens doors to great prospects for the en-my, which he will not fail to seize, we expect too to hear news very soon from the Meso-pina front, heard to-night of the air raid on London.\n\nthis is the third in 3 consecutive nights, also heard of bombardment of Scairoborough by german torpedo boats no aroplanes over to-night; got Pd to-day. Arty fire opened out very heavy again about 10 O'C to-night.","193":" It was a very cloudy morning and things were dead quite first thing, but later on during day, things were a bit livelier, our aroplanes were very active, fritz did not come across to-night, arty very constant on parts of the front, done usual P.T.L.\n9.9.17 It was a lovely morning Chr pde held this morning, our aroplanes are buisy, expect to move from here Tuesday write more 3rd & 4th * fritzy was not over.\n10.9.17 A lovely morning went too Steenbeque but found the Anz D.C gone! so we had to go to Hazebrouck & from there to Poperinghe in Belg-um, & found it about 4 kilos the other side of Pop-ge near Heri-vrart, got here about 1\/2 P 8 O'C to-night after a long day, it is close on 45 kilos from Haz-buck to Pop-he by rail we noticed going along in the train, about 5 kilos from Pop-he where fritz had got a train, & a good lump of the stn also, he is more active here now behind the lines than he was last year there are a lot of tr-ps around this place & things present a very active appearance, exepect to be back here before long.\n11.9.17 It was a beautiful morn we left here 1st A.D.C about","194":" P 8 O'C & was lucky in catching a train for Haze-cke at 10 O'C fritz was over just after we left Pope-ghe but nothing doing, we got back here Sec Bois at a little after 1 O'C and had dinner, there is a roumour that we are likely to move from here any day now re,","195":" &","196":" Regt the , we brought 3 back with us to-day aroplanes buisy. And serch lights, to-night but nothing doing, hear that we are to leave here on Thursday for Castire roumours have it that there is to be a big advance made on the front that we are going too soon, otherwise we expect to go in and just hold the line.\n\n"}}