{"Document Name":{"0":"Diary_0232","1":"Diary_0232","2":"Diary_0232","3":"Diary_0232","4":"Diary_0232","5":"Diary_0232","6":"Diary_0232","7":"Diary_0232","8":"Diary_0232","9":"Diary_0232","10":"Diary_0232","11":"Diary_0232","12":"Diary_0232","13":"Diary_0232","14":"Diary_0232","15":"Diary_0232","16":"Diary_0232","17":"Diary_0232","18":"Diary_0232","19":"Diary_0232","20":"Diary_0232","21":"Diary_0232","22":"Diary_0232","23":"Diary_0232","24":"Diary_0232","25":"Diary_0232","26":"Diary_0232","27":"Diary_0232","28":"Diary_0232","29":"Diary_0232","30":"Diary_0232","31":"Diary_0232","32":"Diary_0232","33":"Diary_0232","34":"Diary_0232","35":"Diary_0232","36":"Diary_0232","37":"Diary_0232","38":"Diary_0232"},"Date":{"0":"unknown","1":1717.0,"2":1718.0,"3":1719.0,"4":1720.0,"5":1721.0,"6":1722.0,"7":1723.0,"8":1734.0,"9":1736.0,"10":1737.0,"11":1738.0,"12":1741.0,"13":1742.0,"14":1743.0,"15":1744.0,"16":1745.0,"17":1755.0,"18":1756.0,"19":1757.0,"20":1758.0,"21":1759.0,"22":1760.0,"23":1761.0,"24":1762.0,"25":1767.0,"26":1772.0,"27":1773.0,"28":1774.0,"29":1775.0,"30":1776.0,"31":1780.0,"32":1781.0,"33":1782.0,"34":1784.0,"35":1787.0,"36":1792.0,"37":1793.0,"38":1794.0},"Entry":{"0":"\n\nLesson I.\n ","1":"\n\nAm on night duty tonight, and as we commenced receiving patients as a Main Dressing Station, today, we have been fairly busy.\n\nAm tired, because most of the day I was helping to fix \ning\n up a habitable apartment (as one of four) out of a cellar filled with rotten turnips. It is at least clean & wholesome, not to say artistic now. The main source of supply of the appointments was the vicar’s house, or what is left of it, where we got oil cloth for the floor; blue & black cloth for the walls; & a flower stand & card table with other small additions for general comfort. The cellar is just over the road from our Main Dressing Station which is a fairly big block of what once were buildings. The reason we took the cellar was that the llar of our own building, our normal\n\nsleeping quarters may have to be used as a dressing room if the town is shelled much.\n\nOn Sunday night, after several hours of shelling the back areas, Fritz suddenly got on to the village. The second shell (a 5.9) landed in our garden at the back, the third in the yard and next door, and the fourth behind the second one. I was in the cellar. While the last two were creating a disturbance, for the Colonel ordered us all below, as there was no work at the moment, nor likely to occur. Very ugly few minutes.\n\nEvery night Fritz bombs. The difference from the first night is that he now bombs in an organised way with squadrons instead of cutting & running with single low flying machines.\n\nAlso, he is using mostly aerial torpedoes instead of the small grass cutters\n\nSome have been near enough to cause momentary anxiety, but none near enough to do our place harm.\n\nWent over to the east side of the village again yesterday. Noticed that our trenches, after the original taking of Villers Bretoneux, were just on the edge of the village. Facing this side is a small ridge limiting the view to a distance of about a mile. half way down this ridge was the German front line, & it was from this relative position that the beginning of the present advance took place.\n\nApparently the 18 pounders advanced as soon as the infantry had captured his front line, for I saw where they had stood in the open just behind our old front line, the place here marked by heaps\n\nof ammunition.\n\nThe tanks were kept in a field near the back of the village & rushed up at the last moment at a great speed. It was possible for me to trace their tracks up along the railway until they struck across the open country at the end of the village.\n\nA dozen supply tanks, containing benzine etc for the replenishing of the tanks’ stocks were arranged in an orchard just in our support line on the edge of the village. A small shell struck one; blew it up & then the whole of the others one by on blew up. The shattered & torn carcases are lying there still surrounded by blackened & torn petrol tins, Lewis gun cartridge cases, Mills’ bombs & plenty of small arms ammunition.\n\nIt was a loss for us but apparently made no difference to the work of the tanks.\n\nI have spoken to some cavalry men & they tell me that Fritz made not show of opposition against them at all. He had the \"wind up” badly & fled or else put up his hands.\n\nToday at one oclock the King came through Villers Bretoneux. For about a quarter of an hour beforehand the traffic was held up by cleaned up M.P.’s, supervised by prodigally red-tabbed official, prominent among whom was our Provost Marshall.\n\nWhen the King came (in a touring car from the direction of Corbie), it was sudden. An anxious face looking hurriedly from side to side in order to get the details as far as possible, of all the ruin\n\nApparently he went first up to the left part of the battle front, thence to Corbie & back to Amiens through Villers Bretoneux.\n\nHe looked a little worried, but very dignified\n\nThe Somme battle has developed to quite a decent offensive. The German reserves have been dropped into the battle, yet he is still retreating. At the presen moment we are fairly near the original 1915 battle line. Up in the north a little good has been done.\n\nThere have been thirteen casualties among our bearers, mostly from gas. Cooke, who got the military medal up at Hill 60 after I had been gassed, has been killed; George Walton, the most enthusiastic of the Christians (if it is possible to pick one of the circle out) has been wounded rather badly\n\nthrough the lung.\n","2":"\n\nDead tired when I came off duty, although only a few cases. Slept all day till 4.30 when I got up & had some tea.\n\nAmerican Field Ambulance arrived just after tea to take over from us. They had just done a stunt a few days before, & now are expecting another on this Sector. This particular Yankee division was in the fighting at Villers Bretoneux when the town was a death trap. As for us we are expecting to leave here today or tomorrow, have about four days’ spell & then go into a big stunt for a few days,\n\nThe Australians have been badly overworked. Our division, for instance, has not been out of the fighting zone since last December. We as an army do such good work that we a\n\ngreatly in demand at such a time as the present. All the troops, more or less, have had a rough time, but we have undoubtedly done our share.\n\nSince I was gassed I have been continually on the go. When things were quiet, as up in the north, I worked hard at the Education scheme, & now, what with marching every few days, opening new dressing stations & working, I am feeling just a little in need of a rest. What must the infantry be like?\n\nLast night things were not particularly busy. We had two terrible wounds. One chap had a leg off & the other badly shattered, in addition to wounds elsewhere; while the other had the thigh bone absolutely smashed & a wound of a foot diameter round one side of the thigh. They decided to amputate, but he died under chloroform He must have \nhave\n had a great constitution\n\nto reach as far as here.\n\nThe gun which used to fire on us has ceased, so it has either been captured as rumour says, or else it is out of range. Still Fritz comes over every night & drops aerial torpedoes. So far none has fallen very near us.\n\nThursday 15 Aug. ’18\n\nSlept till about 3 p.m, then read a peculiar book on the prophecies of the Revelation, till tea-time.\n\nThe Yanks were still about; gambling, joking in loud nasal tones, but not on any duty as yet Nothing had transpired about our projected move. Probably when our division is relieved we shall go out with them, the Yanks will take over & we shall go to the new front nearby where we are expecting to run another big stunt.\n\nAs a matter of fact there was to have \n\nbeen a big hop over this morning but it was put off. Yesterday morning a large number of whippet tanks went up to the line, & this morning a number of the big sort passed on the way to another sector. These latter have been improved wonderfully: they have no little wheel at the back for steering; instead, they stop one of the belts when they want to turn. This is effective & does away with the handicap of depending on a part for steering which could easily be shot away. On the top gear they can go at a man’s running pace, & the whippets are much faster still.\n\nMore bad wounds tonight. Went down to C.C.S. with a car load of bad cases. One was delirious & unconscious, & two others were in great pain; so that at each jolt of\n\nthe car on the bad and interminably long road they cried aloud. I tried to steady the worst of the two by holding the splint containing his fractured leg free from the stretcher, but one could not ease him much. The semi-unconscious one was very restless, & I found almost impossible to prevent him kicking the bad leg about. He would turn from side to side & moan for water...\n\nI longed for the end of the journey to free them all. This chap suddenly became quiet about three quarters of the way there, relapsed into gasping & died. Poor fellow, he destroyed any chance he may have had in his delirious struggles. I think he was almost bound to go.\n\nThe combined effect of working & sleeping in ill ventilated stinking places, & of the awful ruin of this town has produced weariness & slight depression in me. It is only the effect of\n\nphysical unfitness, produced by the bad conditions.\n\nRumoured the Yanks are in a German village the other side of Alsace. There is still plenty of hard knocking in front of us, I am afraid; but given good weather we may seriously mix things up for the Bosche. At least our chiefs are not doing things in a hastily prepared or over \nconif\n confident spirit: they are very careful & long-sighted now I think.\n\nFriday 16th Aug.\n\nThis morning we left Villers Brettoneux & marched near Corbie by Chatelet to the village of Vaire. Here we were joined by the bearers, (who had arrived before us,) in a camp surrounded by trees on the bank of the Somme. Although this was just behind our old front line, it is a tremendous contrast to Villers Brettoneux. The former place encompassed us in a scene of desolation & an atmosphere of abominable stinks; here, outside the village & in a perfect woodland retreat we have nature again near us. It is temporary wonderland; only temporary for we are going up the line again tomorrow, I believe.\n\nThere are certainly dug outs in the woods, & along the river, & here & there \n\na shell torn wall or tree mars the scene, but \ncomparatively\n it is splendid. I have found a hollowed out bivouac foundation large enough for four men, &have sheltered one corner from the dew to make me a beautiful fresh resting place. Under me as I write is straw freshly gathered from the field on the edge of which, in the fringe of the wood, I am sitting. Beyond my waterproof sheet roof are trees whose foliage is prettily pierced by the light of the setting sun.\n\nx x x x\n\nGeorge Walton is dead & so is Jack Cook. Both were quiet good chaps. George Walton has been referred to in my diaries before as the fine strong christian, leader of the bible study circle, & wonderfully helpful\n\nmodest & faithful personality. What a remarkable thing it is that of the last three deaths, two of them were very prominent members of the Literary Circle, & the other was one who was becoming identified with the Sunday night services. We have lost three of the best men in the unit. There is food for thought & conjecture in that.\n\nThere were 13 casualties: all but two by the same shell; a high explosive gas one. Out of a group of bearers resting or waiting in a trench only two were left untouched, – \nEva\n & Maynard. The latter had huge gaps torn out of his tunic.\n\nSaturday 17th Aug. ‘18\n\nMade up for loss of sleep by staying in till nearly dinner time, when Freddy Cocks came round to see what had become of me. There had been a parade at 9 oclock, but no roll had been called, so nothing \nwould\n was said. In any case they could hardly have taken exception to such a thing on the first morning after a very strenuous fortnight.\n\nI am in a new bivouac (which is more of a dug-out & a good one at that) tonight, having got it from a vacating horse-transport man, who had to be nearer his horses. Freddy Cocks will probably be in with me tomorrow. There is plenty of room for two. It is dug about 3 feet into the earth, is walled & roofed with planks & earth, & has a nice entrance & two steps. I can almost stand upright in it. If I only had a table\n\n& chair I would be able to write this in a comfortable position, instead of screwed up on the floor.\n\nWashed clothes & had another swim in the Somme this afternoon. In the evening I discovered a canteen, had a little cake & some chocolate, & relieved the cigarette famine (born of the sudden advance) for myself & some of the tent sub. as well.\n\nThe village of Vaire, where the canteen was situated was originally just behind the firing line after the March offensive of Fritz. Considering this it is not very much knocked about. I fancy that when we captured Villers Brettoneux he must have fallen back here as well, to readjust his line. Even that would not explain its comparative immunity from wholesale damage.\n\nI have noticed other parts of his line that had to be withdrawn on account of the commanding position Villers-Brettoneux gave us. Add to this the fact that both in 1914 & 1870 it was proved to be the key of Amiens, & some idea of its importance can be gained. On both occasions Amiens was taken on the following day I believe. I know from experience that from the \nwestern\n ridge on the western side of the village the whole stretch of country round Amiens can be seen, & from another ridge nearer the city but still about 5 miles from it, the who of the city can be seen, with the spire of the cathedral predominant in the centre When we halted the march up & I looked back at the city, it reminded me of the view one gets of Salisbury from the Stonehenge road.\n\n+ +","3":"\n\nNo early morning parade. Got up in time to receive a good rousing from Sgt. Stacey for being late. The only point that was telling was the fact that lateness if general may produce an early morning parade, so I must go warily.\n\nChurch parade. Text: \"I know that my Redeemer liveth”. After a short reference to the recent battle, & the fact that once again the Australians had given the world something to admire, & the home folks something to be proud of, he gave a practical proof of the text. One of his most telling points was an every day explanation of the meaning of personality, & how monstrous a thing it would be if each individual personality was finished when the carcase was dead.\n\nNaturally Les Burnett the empty must nudge me at the Spiritualistic reference.\n\nAfter dinner I had a sudden desire for a long walk in the beautiful Somme valley precincts. They are not really beautiful, for all this country has been fought over, & bears unmistakeable signs of war, such as signal wires to trip one up at every few yards; pontoon bridges across the canal; dug-outs everywhere; heaps of ammunition for guns at unexpected places, & rubbish in odd corners. Still the summer \nspring\n mantle of nature is only sullied by such things, & when seen from an eminence loses not very much of its beauty. The Somme splits up into many branches here, some of them having become mere lagoons, so the canal was evidently\n\nconstructed to give a clear waterway. The result is several pieces of water & one fairway under a roof of trees. The whole valley is well wooded while the \nsurrounding\n bordering hills are mostly bare.\n\nRoy St George knew of a hill which gave a beautiful view, so he, Dick Barlow, Ob. Grey (Long Grey of Caestre days) & I started out along the canal. We crossed it by a pontoon bridge, met the artist who was with us in the Caestre Camp (coincidence), went through the village of Vaux, along a dusty road, up a hill & arrived at some trenches that gave us food for thought. They may have been used in the March retreat, but in any case they were ours & were on a bluff which gave a wonderfully commanding position.\n\nFrom here we reached the top of the hill, saw Sailly le Sec, & Corbie church distinctly through glasses, & made a short cut across an erstwhile no-man’s land which had suffered a barrage, to the Corby-Bray main road. Then we went along the road towards Corbie, passed a couple of chimney stacks that had suffered three direct hits between them & still stood, until we reached a clump of trees behind which Roy informed us much might be seen.\n\nIt certainly was a wonderful view. We had left the Somme in the valley from which we had climbed; the main road ran along the top of the hill, & from this clump of trees we looked down the opposite side to the Ancre River.\n\nSuch was our view that we could look right up the Ancre valley to Albert. On the opposite bank we saw Ribemont, Buier, Hanacourt, & Albert, while on our side were Treux & away on the sky line – the Morlancourt battlefield. The first mentioned villages were knocked about but recognisable, but as we looked further away the country became more desolate until Albert appeared as a patch of ugly which on a blue grey background; \nbeyond the\n Treux as a red & white collection of (apparently) bricks; & Morlancourt as a bare hill with one or two tree stumps. Over the latter shells were falling often: I think a stunt is on over there.\n\nShrapnel & high explosive were falling from time to time further up the main road towards Bray.\n\nOn the way back we climbed a hill & through one gap in the trees, seated on chalk, we saw a lovely view of the Somme valley, oddly reminiscent of the Richmond Hill view. Instead of Windsor Castle there was the ugly battered twin towered Corbie church, & instead of the plain Thames waterway, the broken Somme. The trees were there in abundance, but white trenches unexpectedly appearing on the bare slopes around were hard to account for in the comparison.\n\nI wonder if Fritz will see this part of the Somme valley again.\n\nTuesday 20 Aug 1918\n\nYesterday (Monday) I swam in the morning & after dinner, went for an afternoon’s sport on the river (or Canal rather) with Bert Cunnington from the Q M Store, & George Goode from B Section Tent Sub.\n\nThey had commandeered a wandering bridge section or span composed of planks & barrels. This was very useful as a punt for use from bank to bank of the canal, saving a long walk round by one or other of the pontoon bridges. We got oars, however & rowed down river to the next bridge below, then took it in turns to tow up the river from the tow path, the others fending the boat off the bank with oars.\n\nToday, with the exception of a little digging this morning, we have been at the\n\nsame game.\n\nOur dress is composed of white shorts & a shirt, – not plentiful but very easy.\n\nWe have now been here about four days, & there is no word of leaving yet; although there are rumours of a sudden trip into the Bray sector for a stunt. The 3rd Division are moving off to night, but no word has reached us of 1st Division moving off.\n\nFritz comes over on zonking expeditions when it is fine; but so far no disturbance of our peace of mind has occurred. He was shelling the village about half an hour ago.\n\nSaturday 24 Aug. 1918\n\nOn Wednesday the bearers moved up the line, (Hall & L. O. Walton being left behind, to my pleasure), & on Thursday morning we moved off to a place about 2 kilometres away from Vaire, just outside Hamelet. The latter village is only visible as a battered heap of ruins, little better than razed to the ground. We found \na couple\n three of huts let into the ground about a couple of feet & heaped up all round with earth, in the usual manner as some protection against splinters from bombs. These, with a couple of marquees plus a quartermaster’s marquee constituted a main dressing station. One of the former was for sick parades & the other for dead bodies.\n\nFritz came over bombing that night & let a few drop all round, but none on or very near\n\nus: – apparently between us & our last camp.\n\nThe stunt was due to start at 5 the following – Friday – morning, & just about that time a terrific barrage opened out & lasted for about an hour.\n\nOur tent Sub had breakfast & went on duty at 8 oclock, about which time the first car loads of wounded began to arrive. To make things rather more interesting, we had a blood transfusion section, with a surgeon major, for attending to bad cases & operating; these occupied the third hut.\n\nAbout five of A & B sectors combined did dressings, & the rest of us loaded & unloaded the cars as they arrived one after the other in quick succession. For five hours we worked solidly without a break, dust collecting on our faces, & sweat pouring down, for it was a hot day. Still, one \nfound\n felt that good work was being\n\ndone.\n\nThe stunt was for certain commanding positions to the right of & beyond Bray, which had been the cause of much trouble, by their resistance, during the time we were operating in the night, in the last stunt.\n\nAt ten oclock news received that the objectives had been reached by the 1st & 2nd Brigades & that the 3rd were going to leap-frog over them & go on. A Section was detached from duty with us & sent up further to establish a main dressing station nearer the A.D.S.\n\nMeanwhile we worked on till 1 oclock or more when there was a slight lull & one after another bolted a little dinner & came back to relieve somebody else.\n\nAbout this time word arrived that no\n\nmore cases would come after about four when we were to pack up & join A Section. Someone had made a mistake however, for when we were half-packed the constant succession of cars recommenced, & we had to unpack again & carry on.\n\nSomewhere about 6 oclock however the arrivals ceased & we commenced the tiresome job of packing up. Then stretchers, salvage & all kinds of things that littered the green fronting the roadway, were collected, lorries & cars were filled with stuff & sent off.\n\nI found myself with the last group of people, & we had a weary wait from dusk to dark, & a (luckily) fitful moonlight, until at about 11 oclock the last lorry came, & we loaded it & left.\n\nWe found \nthe\n A Section in three huts bordering the road, hard at work on the last of a large number of Fritzes that they had found\n\nlying out in the fields, awaiting the transport. Most of our wounded had been evacuated by then & things had quietened down as far as our work was concerned. Not so the battle area. Fritz evidently counter attacked in the late evening for there was a tremendous commotion & even when we arrived at the new M.D.S. he was shelling the roads in front & at the right, while high shrapnel was bursting all round the country in front of us.\n\nAs soon as we had unloaded the lorry we got a tent & were just carrying our gear over to it when we heard bombs dropping away in front of us, & the rattle\n\nof machine guns firing at aircraft: A minute later a huge Gotha, shape like this came over.\n\nIt flew absolutely directly towards us, & must have seen our huts & tents with the long line of waiting motors. We held breath & waited for the bombs we felt sure would be ours for no asking, but he flew straight over. He may have seen that it was a dressing station. A moment later he dropped five bombs to the right & behind us, apparently on the main St Quentin road\n\n(which runs forward on our right \npassing about\n passing within about a couple of hundred yards of our \ncamp\n dressing station). After that bombs dropped all over the place, but I got to sleep fairly quickly for I was very tired.\n\nRose ready for a heavy day this morning, but found that things had quietened down & although they had had a busy time for the first part of the night, it had been more calm after 3 oclock.\n\nDug latrines, & made incinerator, & burned rubbish all morning; rested during the afternoon.\n\nWe have\n I have found a bivouac let about a foot into the ground, & this is a certain amount of protection against bombs. In any case one would be very unlucky to be hit, considering the amount of space there is for them to fall in.\n\nStill one feels happier below the level. Freddy cocks & I will occupy it for the night.\n\n9\n","4":"\n\n333\n\n66.6\n\n32\n\n98.6\n\n444\n\n89 – 9\n\n37\n\n98\n","5":"\n\nMostly digging & heavy work till ","6":"\n Monday. On this day we began to dig in, & the usual result followed: we went away that evening.\n\nOn Sunday night Fritz came over in his droves, & bombed the whole of the locality as thoroughly as he possibly could for about three hours. Apparently he bombed roads more than anything else, or we should surely have caught it; unless he recognised our bunch of objects as a main dressing station. On this type of country such a collection of huts & tents as we had there was the only landmark for miles, & on a bright moonlight night such as Sunday must have showed up well.\n\nThe landscape consists of bare hills relieved here & there by small bunches of trees. Except for the ruined villages there is not a sign of a\n\nfarm or building of any kind. Near the dressing station was the dead straight tree lined St Quentin Road a short way back along which was Warfusee in ruins, & a smashed civilian cemetery. At a military cemetery outside this Darcy Dickson, Fred Cocks & I buried a chap on Monday afternoon.\n\nAway in the distance, to the left & opposite side the trees in the \nvalley\n basin of the Somme could be seen. Otherwise, dusty grass criss crossed by roads & improvised old front line tracks, littered with smashed ploughs, limbers, waggons shells & the usual paraphanalia.\n\nUnlike the Ypres salient nature here is only half & not entirely killed. Shell\ns\n holes, though frequent, are not next to each other as in the former & the fighting has been too transitory over here to have played such awful havoc.\n\nThe dug outs are mostly just bivouacs dug down a foot or so, although here & there very deep German dug outs can be found, going down about 20 feet\n\nOne of the worst aspects of the evacuation of wounded from the dressing station near Hamel on the first day of the stunt was the thirst of bad cases. It was very hot & all clamoured for drinks. We had hot coffee & a certain amount of water, but they passed through so quickly that with the bearing of them in & out, it was hard to keep them all supplied. Some of them too, having chest or abdomen wounds could only have their lips moistened with wet gauze. All the time there was a continuous moaning, which affected one, despite the rush & hurry.\n\nWe left the Main Dressing Station, relieved by the","7":" Field Amb., on Monday afternoon, marched about half a mile, & erected tents on the brow of a hill just outside Cerisy, & nearer the Somme than we were before. The position is very exposed for moonlight nights, but the two nights we have been here have been cloudy, & the aerial warfare has, however, been modified by a new factor.\n\nFritz was pushed back a couple of kilos in the first push last Friday, a little more since then, & now he appears to be retreating, for they have lost touch with him.\n\nWe shall be moving up to the A.D.S very shortly I expect.\n\nI am now about 35 or so on the leave list & 5 are going every week, so I should be over in a couple of months. After I return & have got the education scheme into proper\n\nworking order, I think I shall look about taking advantage of the possibility of a transfer to a Base hospital. Naturally the moving about & impossibility of getting to work in the odd days resting during such times, makes me rather dissatisfied with the life. Still, if I am still alive, next year I shall be quite justified in going back.\n\nV Friday morning","8":"\n\nThe push that has been made since we came down from the north has now reached Peronne on this front. Apparently Fritz is retreating to his Hindenburg line where he should be able to collect his resources & hang on till ready for another smashing blow. Since our division was pulled out of the area they went into first, they have accomplished good work slight to the left of that position & nearer the Bray potion. They were again pulled out after capturing & going beyond St Martin’s wood. Now the other Aust. divisions are carrying on a kind of hunt after Fritz who has begun to retreat so rapidly that they cant keep in touch with him.\n\nThe result has been that this area has slowly changed from a very active one to a comparatively quiet & peaceful one: As I write a barrage which \n\nstarted two nights ago & has been almost continuous ever since, can be heard from the direction of Bapaume. – perhaps nearer – say Combles. It has been continuous but become a little fainter, which leads us to hope that the very strenuous opposition he was offering there has been overcome.\n\nI did not expect our stay in this camp to last longer than about four days, but there is no word or rumour of moving yet. Relations between Hall & myself are of course nothing more than just friendly. Personally I would like to resume the old footing because in our tent sub. division decent discussion is out of the question & the effect on one is very deterrent from a point of view of work. They are more or less drifters. I am afraid that it would do no good to do so however. He seems to have taken the position of allowing me to dictate what\n\nour relations shall be. I hear that he has started the course on economics about which he spoke to me & which caused the outspoken advice of mine which he disliked. I think I shall go back to a hospital when the \"scheme” is in full working order, for then there will be no reason why I should stay with the unit longer, & I can then get to work in earnest.\n\nMy present necessity is to overcome a very strong disinclination to work, & get on with any shorthand & English on very possible opportunity.\n\nWent to a canteen appertaining to the 3rd Battalion yesterday & got some chocolate. On the way back I met Paddy the ex. M.P. of Weymouth. He is a hard faced Irishman of exceedingly amiable disposition. Then I listened\n\nto the 3rd Batt. band which \nwas play\n practised \"The Arcadians” & \"Cavalierio” by the side of the road which runs between cliff & marsh to Moscourt. \n\n Chippily\n\nThe landscape there is a trifle more inspiring than ours here. The white cliffs under which the chaps were camped in dug outs, & the green rushy marsh with plenty of fairly healthy looking trees combined to vary my outlook & made me feel more confident & less bored. Even there, however, I discovered a horses hoof & broken limber wheel hidden in the grass. It reminded me of XXX\n\n\"Such things you know must always be\n\nAfter a famous victory.”\n\nThere has been an epidemic of arguments in the B Tent sub lately, and without allowing for war time nerves, & war weariness the result has been pretty rough for me if not for my logic. It is all part of the game, & it is all experience. When a chap is in the right & knows it well, I think he should give up the idea of trying to reform even his immediate associates & keep his mouth shut. The more one lives, the stronger one feels & the more capable one feels of meeting general difficulties, the less is one able to meet real difficulties.\n","9":"\n\nYesterday we were turned out of our tent, in which we had dug down a foot or so for protection against bomb splinters, & so, in preference to going into a marquee most of us decided to build bivvies. Joe Ritchie & \"Kak” Smith had one already.\n\nI asked Freddy Cocks \nat which\n if he would join in with me, but, as usual lately, he hesitated agreat deal, so George Goode joined forces with me. Fred Grey gave us some very valuable help & we made a very good one with sand bags & curved iron, salvaged from an old artillery position on the opposite slope.\n\nThis diary is getting far to egotistical for my liking. I have ommitted, I find, to mention our casualties from the\n\nlast stunt, although they were very important. Two of them were chaps that at one time or another I had come into contact with a great deal. One of these was O. H. Gray who came from England with me, & during the long stay at Caestre was my sole companion. I first met him on the Peninsula, then & ill from the severities of some months of that campaign. The incident that sticks out in my mind is the appointment of him to a light job as runner, owing to his state of health. Everyone then referred to him as a fine chap, brave, & a striker. \n\nThe next time I met him was at Parkhouse when I, one night, became aware of him as a listener at one of our debates. Later Sgt Clarke & I got into touch with him, & he took part in the memorable \"Reprisals” debate.\n\nThen I went over to France in his company\n\n& we saw it out together at Caestre. When we joined the unit he went to C section & his brother & so I lost touch with him, until the services & the education scheme brought us together again. He was a very energetic member of the literary circle.\n\nI remember how on many occasions he voluntarily helped me in my activities, as when he did the printing work for the drama at Dimonts.\n\nBoth he & his brother are or were Quakers, & he was very simple in regards to worldly affairs. With my usual thoughtlessness & self satisfaction I more than once lost patience with him because of some apparently silly lack of judgement. If only I had as much insight as I occasionally fancy I have, I should not quarrel so often, should lose patience much\n\nmore seldom.\n\nHowever he is gone now. I am glad to think that at Vaire, where we joined the bearers after the first stunt, we greeted each other all the more heartily for our brief separation & were on excellent terms for the few days.\n\nDamper Hampson & Grahame Pearson have also gone: blown up by a land mine.\n\nThe former was an original man shortly going back to Australia, & the latter was with me in the hut when a few of us were isolated at Parkhouse with mumps. Both very fine men\n","10":"\n\nThis morning we went for a long march across the hills of this plateau, in a fresh breeze, until we came near to a village (La Motte) whose rugged silhouette had been noticeable on the way. We arrived at a semicircular chalk quarry where Bishop Long was waiting to address the","11":" Brigade on the Education Scheme of the A.I.F. He is the man who so impressed me by his personality, at Le Havre recently. His speech was good, for in it he gave us a clear idea of \nhow\n the extent to which the promoters of the Scheme want it to grow. In short it is to bring the educational facilities from Australia to France for the purpose of giving the soldiers every chance.\n\nIt may be that by this scheme, I shall be able to get the chance to do a university\n\ncourse, which seemed so hard in pre-war days, & so difficult to me in perspective of ante-war days. The question of doing the course & earning my living at one & the same time has been a very perplexing one to me. I have never mentioned it in my diary, strangely enough, & yet that might be called the very essence of the cause of my uncertain philandering with study. I have tried to get to grips with the subjects of the matriculation, but the difficulties of spare time work have always beaten me. Yet I know I shall win through in the end, & perhaps here is my salvation at last.\n\nOn the way over to La Motte we passed many signs of both ours & the German’s retreat. There were half buried aeroplanes, bombed lorries in skeleton, fragments\n\nof guns, limbers, equipment, boxes of ammunition, & the never failing brown or browny white shell holes everywhere.\n\nLa Motte is in as bad a state as Villers Brettoneux. The church is represented by the same amount of masonary: a small portion of one of the walls with a gothic window in it. One cannot observe from a fragment of wall, so they left it at that.\n\nWe are going to start classes again tomorrow, & I feel glad of something to do. Lately I have been argumentative, bad tempered, & wishing to get away from the line; but now with something to do I am happy. Also, I might mention (for danger has something to do with bad temper) that Fritz does not bomb round here now so much, since it is a long way behind the line. We may move up any day on account of the fact\n\nthat we are in reserve, & too far back to go in quickly if required.\n","12":"\n\nIn the three days since I last wrote in this diary, I have been busily engaged in holding elementary & advanced English classes, & two committee meetings; writing letters & practising shorthand (halfway through the Reporting Stage); & arranging the many details of organisation for the holding of classes, particularly in arranging a new system of French classes. There is a slight falling off in the \ninterest\n number of the elementary English class, but the advanced class consisting of my original English class is still keen. I think I shall be able to retain about 8 or 10 keen chaps in the elementary class.\n\nChip\np\nilly was pointed out to me yesterday Facing the line (that is looking towards Peronne) one has bare hills at the back, in front, & on the right; while on the left is the valley of the Somme a kilometre away, & just beyond Cerisy. This is wooded along its whole course as it flows away towards Peronne, &, in addition on this side it has a line of cliffs following it & then receding & running at right angles to it & in front of us. Between this line of cliffs where it runs in front of us beyond the opposing hill, is the village of Chipilly. It is possible to mark its position by the wrecked roof of the church which is just discernible on our left front, in a fold of the opposing hill. \nRound about\n\nFrom this village to the wooded hills on the \nleft\n opposite bank of the Somme, represents the section where the Germans made\n\nsuch a strenuous resistance while we were on the right (following the Harbonniers, Lihon line of attack). He chose a good position for his centre of resistance, & it is no wonder that the Tommies were held up there, for, although the cliffs referred to defend the country from this side, the wooded hills \nover\n on the other side of the Somme, & the hills facing the cliffs far in front of us are splendid, & one would think almost impregnable positions. In this style of fighting, however, every use is made of outflanking tactics. The main attack is very rarely made in front. We would have done better on the Somme in ’16 had we remembered that.\n\nChipilly is finished one would think. There are many unburied remains still lying about the hills. About five miles away or less is the famous 15 inch gun which we captured recently.\n\nThe news continues to be good. Fritz is retreating all over the front from Rheims to the north, & the Hindenburg has been reached in parts & broken in one place. We are, in fact, threatening Douai, Cambrai & St Quentin. Lens has fallen & so has La Bassee. The only doubt that exists in my mind is whether he will be able to hold out on the remainder of the Hindenburg line: (that is whether we shall fail to outflank it); or whether he has some retreating line up his sleeve.\n\nOne is inclined to look a gift horse in the mouth after so many weary months of bad news. As a matter of fact, we have, without reserve, done excellently on this front, & so have the French & Americans in the south. The strategy appears sound, & there is an excellent chance of his evacuating the Hindenburg\n\nLine, in which case it is impossible to say what good results might not come \nfrom\n to pass. If the weather holds good for the next two months we might be able to finish a brilliant year with a brilliant stroke.\n","13":" ’18\n\nYesterday morning, when we awoke, we found that most of the transport had packed up & we were due to leave at 10 oclock. On the previous evening Barlow, George Goode & I had strolled over the hills at the back to a concert given by the Sentimental Blokes, & enjoyed a rare treat.\n\nSo we marched out at about 10 to the road turning to the left of Cerisy, past waiting batts \ngroups\n of infantry men of our Brigade until we reached the end, then we got aboard some motor lorries that arrived at that moment. We understood that we were going up the line, probably as a reserve division at first, & to go in later.\n\nAlong the terribly dusty road we travelled through Morcourt & Mericourt, both of which villages were not knocked about so much as those further\n\nback, probably on account of the decrease in the severity of the fighting at this point.\n\nLater, however as we followed the Somme valley we came to one hill steeper than the rest where the resistance had evidently been more severe, \nthan\n for the wreckage & ruin, were dismal. We passed the point where our boys were killed in the last stunt, & then got into a region where there had been severe fighting either in our retreat or in the earlier Somme battles. This was patent from the grey tree stumps & desolated country.\n\nAfter that, \nthe\n despite the terrific jolting of the lorry on the shell torn road, I fell asleep in dozes, & finally woke up when we reached our destination, which was within sight of a town, which to my utter surprise, proved to be Peronne.\n\nOur camp site was a field which bore traces of the recent fighting in the shape of shell holes, hastily dug graves (marked by rifles with identity discs hung thereon) & a couple of huge huts which were half ruined. The boys completed the destruction by pulling off the tar clothed boards of the roofs to make bivouacs. We were rather anxious to find out exactly where Mont St. Quentin was, having an interest in it because of the historic capture a day or two previously by the 5 Div. As a matter of fact, while in the camp I discovered that we were half way up the slope of Mt St Quentin on its Peronne side.\n\nExplored Peronne, both alone & with Dick Barlow & George Goode. Sketched the citadelle, & had a few good shots with rifles we found lying around.\n\nNoted the old fortifications & the moat, in which curiously enough there were some good\n\ndug-outs. Many dead Fritzes & Australians lying in & around the town. The latter were mostly buried the day of our arrival, but the former were left till later, for there were still some about when left on Tuesday morning. There were even live men in the cellars in Sate.\n\nPeronne is smashed utterly. Hardly a habitable house remains. This is not remarkable, for in this war alone it has changed hands three times. Dead Fritz in Town Hall.\n\nLeft Peronne on Tuesday, in a miserable drizzle, & tramped across country to a main road, which we followed through Hamel (a new Hamel) & the smashed remains of Marquaix to a \nrelay post\n the other side of the last village. This relay post was to be the new A.D.S. We took over from the 11th Field Ambulance.\n\nWednesday 11 Sept.\n\nSpent all yesterday afternoon in stringing up a false roof of blankets for, & in fitting as a dressing room, an almost intact brick building with a courtyard. We stayed on duty till 10 pm when we were relieved by C Section on night duty. Fritz shelled fairly near, but evidently was trying for a camp, on the ridge to our left front. Our brick building is backed by four Nissen huts, & across a field, about 50 yds from \nit\n the building, is \nthe\n a collection of huts dating from our 1917 existence here, – now dismantled with iron roofs rusted. On the fringe of this, underneath a bank on the side of some ruined huts I share a dug out with Freddy Cocks, George Goode & a couple of others.\n\nLast night & early this morning Fritz was over flying low. Last night he dropped a large number of \n\nbombs in Hamelet, a couple of hundred yards away, and unfortunately caught some of the 3rd Division (\n4\n 6 Batt, I think) while they were resting at a Comforts place, on their way out. This morning he bombed a battery just over the road from us, but unlike last night I was half asleep & did not notice it much.\n\nThis afternoon we discovered some men digging a gun position about 100 yds from our dug out, so we shall have to consider clearing out \nsoon\n before he starts shelling & bombing it. (Proved to be a searchlight position)\n\nAt daybreak this morning the 4th Batt attacked the German position with the idea of advancing about 1000 yds I believe. Fritz was rather better in his defence, evidently because he is desirous of hanging on to a particularly high hill in front of our lines. We had one or two Fritzes through.\n\nAs far as I can see, the main trouble\n\nhere is likely to be the bombs, for he flies so low: still he shells all round here by day, so its hard to say which is the more dangerous.\n\nI had a chat with Freddy Grey yesterday about a feeling I have had lately that Ob (his brother) seems to have left his influence behind him, or perhaps still is with us in spirit. I have felt greatly encouraged & comforted lately by the feeling that he is still with us in spirit – encouraging, helping & soothing. Freddy has felt the same, he told me. I have still to write to his father.\n","14":"\n\nYesterday morning Sgt Kerry of the O. Room told me that a nomination\ns\n had been called for from the Colonel for \none name\n the position of Education Officer with a unit in the 1st Division Each Battalion will have one & the whole of the other details such as AA.M.C. & A.AS.C., one each to a division. The Colonel wanted to see me at 2 p.m in his tent, & when I went he told me that he had decided to nominate me. My lack of degrees or diplomas is distinctly against me, but my organising ability will give me a dog’s chance. Sgt Kenny gave me a copy of the order, to judge \nmy\n the wording of my application form, & on it I noticed the names of Sgt. Woodyard, Pte Dalton, Pte Maynard, Pte Barlow & Pte Holt, with the latter underlined. I would like to get the job, but the chances are not great.\n\nYesterday Fritz increased his shelling a great deal, rain notwithstanding, & before long was dropping grass cutters all round & in the camp. Luckily nobody was hit, but one exploded right on the side of Tom Pollack’s dug-out, while he & Roberts were lying in it. Some dropped round our dug out also, & Ted Purchase (Staff Serg on Gallipoli), heard pieces dropping on the roof. He, being on night duty was sleeping there.\n\nJust at dusk Fritz put up a barrage on a position a couple of hundred yards from our camp.\n\nWhat with shelling & bombing I am getting in a bad way in regard to getting off to sleep. Last night it took me a very long time to get to sleep, & as soon as I had succeeded he started\n\nshelling again. Thereafter he kept going at intervals of about an hour, all night. Pieces fell on our roof, & some shells sounded near, but it was not till this morning that I saw how near. One had landed about four yards in front of the dug out, & others on the sheds round about. During the night eight \n\nhorses were hit, Joe Dobbins got a piece in the head (slight), & another shell (a dud) landed beside Tom Pollacks dug out again. He & Roberts had shifted.\n\nThis morning the transport & bearers are to move further back, & there is a possibility that the A.D.S., also, will be shifted. At the present moment Major Watch is remarking that he thinks this place stands more than a fair chance of being bombed. What a nice comforting reflection. The transfusion Captain added that one notices that whenever he shells a particular\n\nposition by day, he attempts to bomb it as soon as the weather clears. Good!\n\nThe nomination of me for position of Education officer by the Colonel came in the nature of a pleasant surprise. It coincides with the feeling I had not long ago that I may be getting a chance to realise my ambitions before long. The feeling remains even if I fail to get the position, for the point is that it is the first time since the boat journey over, that an officer has \nsingled me out for\n of his free will tried to help me, I used to work & try in Blighty, but the old French proverb sets me right again: \"L’homme propose mais Dieu dispose.”\n\nSaturday 14th Sept\n\nAt midday yesterday it was definitely decided that the ADS should be shifted. Bearers moved off with transport first; then we packed up & waited the usual hour or two. Shelling round about, but not near.\n\nWe were to keep the building as a reserve A.D.S. \nbut\n when we could get Fritz out of his position.\n\n Refers to big guns all round the A.D.S.\n","15":" \n\nWe are now established as A.D.S. at the Sugar Refinery, Tincourt, just behind Hamel. The remainder of B Tent Sub. – Burnett, Tom Smith, Kak Smith & I, walked back just before dark, & found a marquee in use as A.D.S. on the border of the village next to the Sugar Refinery. Most of the bearers had made bivouacs on the opposite side of the hill, & some had established themselves in cellars. Of the latter Snowy Eva came up & offered me a pozzy in a cellar occupied by him & a few others. We finished cleaning up & lit a fire to smoke \nto clear\n the cellar of foul air, before the Gothas came over.\n\nThese were over fairly \nsoon\n early, but they were met by a very stiff barrage of Archies & machine gun bullets. Still we waited for the inevitable ker-rumps & zonks which would follow as usual the humoring of their\n\nhovering over us. What we heard was, however, a loud cheer & a sudden cessation of the barrage. It proved to be caused by the fact that a Gotha had been brought down in flames. We laughed & felt quite cheered up thereby & then settled down again to sleep. Soon the next relay was heard – wirzz-a-wirzz-a-wrzz-a – in the distance, & again a barrage opened up, then zonk! zonk! zonk, & again a sudden silence & a cheer: Another one had been brought down.\n\nThere was a certain amount of discussion concerning the means of their destruction: whether by Archies or planes. As far as I can see the point is doubtful, but a good many of our planes have been used for night fighting, especially in view of the fact that Fritz would like to get the Peronne bridge, as we did when he had them.\n\nOur Tent Sub are not working this week – A & C Sections having commenced the work in this new position, so I spent yesterday in helping to fix up the cellar. Eva & I got a roll of tar cloth from a camp beyond the railway, & made a linoleum use of it.\n\nYesterday we were very rough on any stray Fritz planes the came over observing. One was brought back by three or four of ours, & another narrowly escaped destruction & had to clear away for his life. We got three balloons during the day.\n\nIn the evening I went to a concert party which was showing in a Nissen hut next the Sugar Refinery. The show was given by the Boomerangs (3rd Brigade) & Jimmy Dowling, one of our concert party good at ragtime, showed for the first time. Frayne, also is joining them.\n\nToday is fine & in complete contrast \n\nto Wednesday & Thursday. Although we are only a couple of kilos away from Marquaix, we dont get shells near us except at long intervals, & we are able to get a drink of tea at the Y.M.C.A., & also such a pleasant way of spending an evening as a concert. It is the first time I have ever known a concert party to show so near the line as an A.D.S.. They start at 8.15 & was to be finished before Fritz comes over.\n\nI feel lazy & happy today.\n\nMonday 16 Sept 1918\n\nThe latest news is that there is going to be a big stunt here in the course of a day or two after which we may expect to be relieved for our long rest. Judging by the guns & other war material we have here, our mutual friend is going to have a hot time. There are five divisions of artillery on a one division front, & the 9.2 guns are within a couple of thousand yards of the front line.\n\nThe greater \nnumber\n part of our guns \nhave\n has not yet been tested but is lying camouflaged & unknown to the enemy. I have watched ammunition dumps growing, & the increase in size, despite the drainage of stuff to the line, is remarkable. Tanks too are in abundance somewhere near here, so there will be a few hours of excitement.\n\nWent to the concert again last night, came into the sugar refinery for letter writing purposes & then returned to the Nissen hut for a church service which was very inspiring.\n\nThe day before mother died I was in the front room at Hanover Buildings, leaning out of the window in the still twilight while she lay in bed seemingly asleep. Everything was quiet & it seemed desolate. I thought of the loneliness she must feel if she were awake, & of what thoughts were passing through her mind. How miserable & lonely she must feel, I thought, pondering on the happier periods of her life, & as I thought I hummed the tune of \"Abide with me”. It touched me so much at the time, that whenever I have heard the hymn since, the tears have come to my eyes. It seems\ned\n as if it were a prevision of the end, in looking backing on the incident\n\nlast night we sang \"Abide with me” very impressively, & it affected me in the same way.\n\nX Tuesday 17 Sept. 1918\n\nI understand the stunt is to come off tomorrow morning. This afternoon B & C \nthe\n bearers went up the line, & we have stacks of stretchers ready. This morning, Freddy Cocks & I made a large number of walking wounded notices, with the help of Bugler Easther who made the stencil.\n\nI understand that tanks & the usual side shows are all ready, & from observation I can quite believe the rumour that 700 shells per minute will be the extent of the barrage. Fighting on the same scale will take place north & south of us, so I can see it developing into some big battle.\n\nLast night the planes came over & did a bit of zonking, but they had to keep very high on account of the sad ending to one or two of their raids\n\nlately. No sooner had he finished zonking than he sent over a large number of high velocity shells \non the\n round the wood below us (evidently aimed at the railway), shelled the main road (apparently), & put over high bursting shrapnel \nover\n on our ridge. As I learned this morning he put pellets through the Q.M. tent & an Operation Tent. \n\nThe next excitement was a very fierce storm, which was a natural result of the oppressive evening. Thunder claps created far more noise than the crashes of near bursting shells, & the wind & the rain tore at everything with terrible fury. Tents collapsed or had to be held up in one camp, & a wall (ruined) collapsed on the Sergeant’s cook house, I was immune from discomfort in the cellar, but the noise prevented any sleep.\n\nA Section has just had orders to move up so I am left alone in the cellar.\n\nWednesday 18 Sept.\n\nFirst night of duty in this station last night. Kept going off & on till 3 oclock, when it became known that zero for the stunt would be 5-15.\n\nAt about 5 oclock I went into the village to wake up Staff Sergeant ney of the 2nd Field & warn him that breakfast would be at 6 oclock. On \nthe\n my way back I heard the barrage start, and although the wind & rain deadened the sound somewhat; it was quite evident that it was a terrific bombardment. The whole sky was alight for minutes at a time, although there was no sign of the dawn breaking.\n\nThe arrangements for dealing with the wounded were that walking cases were to go to Marquaix, the we had previously been shelled out of, & \n\nthe stretcher cases were to come to us.\n\nAt 6.30 the first cases had begun to arrive, & by 8 oclock the \nwere\n was a queue of cars waiting for their turns to unload patients. The first batches were all walkers, & the method adopted was for an M.O. to pick out the serious cases, & give instructions concerning them, while we put fresh dressings on all who needed them. Later the cases came down mixed together – walkers & stretchers –, & then the M.O. (Rutledge or Watch) stood at the car stand & sent all serious cases straight on to the M.D.S. at Buire, while we dealt with the others. Most of the cases had not had their dressings changed since they were hurriedly patched up where they fell, & many had not seen a doctor, so there was much to do in putting\n\nclean bandages on in place of muddy, & hurriedly adjusted ones.\n\nThe first news that came to hand was that the barrage was lovely & effective; then we heard that the first objectives had been easily reached, & that the boys were going in in great style. We had not time to get corrected accounts from any of the patients, but this much was given us by practically every one of the early cases.\n\nThen word drifted through that the final objectives had been reached in almost every case. They had to advance, in all, about 5,000 yards to a position just overlooking the Hindenburg Line.\n\nAt ten oclock I was pretty tired, so I\n\ndrifted off to the first dug out I could find to sleep for a time. Most of our section had gone, relieved by A Section. At about dinner time I was awakened by a banging about outside the dug-out, & then a face appeared to my sleepy gaze. It was a 1st Field Ambulance man, & he immediately apologised for having put his kit in my dug-out. I didn’t correct him, but just got up & had a little dinner.\n\nThen, as the cases were coming in in large numbers I went over to give a hand. Besides A Section, there were cooks, batmen, the postman & bugler hard at work helping, besides a few bearers left behind for the purpose.\n\nThere were four marquees, on the opposite side of the road from the Sugar Refinery, so that the station was on one side & the car stands on the other, the road being the loading \n\n& unloading place. As it was a side road running \nat\n parallel with the front between two main roads, there was no traffic to congest things.\n\nWhen I arrived I found large numbers of wounded lying in the open between the two top marquees & the road, while the lower marquees were being used by the 2nd Field Ambulance for walking wounded. In our dressing tent two cases were dealt with at a time & these were selected from the worst of those in the open. Cases were left as they were, provided that the dressing was clean & comfortable, & that there was no reason to deal with the case at once.\n\nThe actual work that had to be done was the dressing of the more serious cases, putting\n\na blanket underneath everyone, seeing that all had drinks & biscuits, if not penetrating wounds, & the loading & unloading. The bearers told off for the work were doing \nthat\n the last, so I started on dressings. There were plenty of A Section to do that however, so I transferred my help in the direction of those outside, helping to put blankets under cases, giving drinks & seeing that no serious cases were overlooked.\n\nAfter I had been going for some time, finding plenty to do, & only too glad to be taking so active a part, Mr Garland the W.O. told me I had better get some more sleep, because there was likely to be a rush through the night; so I accordingly went back to the dug out & slept for an hour or so. Then Sgt Woodyard came along & thanked me for looking after his dug-out, which\n\nlittle dig was the first intimation I had received as to the owner of the dugout.\n\nWhen I got up for tea the rush had only slightly abated. The balloon which had been in the camp next to ours had moved forward & the whole district was quiet, for the immediate communications had moved forward & we were well behind the front.\n\nDuring the night we were kept very busy up about 2.30 a.m. when everything became quiet. Taking advantage of the lull we had a dose for a couple of hours & nothing much happened before breakfast.\n\nAfter that we were told that we would have to continue on duty during the morning\n\nwhile the rest of the Ambulance went forward & opened a new station.\n\nAt about 1 oclock we finished receiving patients, & commenced to pack up. Then I went on a burying party with the Padre to bury two Australians & one German that had died on our hands during the night. One of the Aussies was Corp. Campbell of the 9th, & the German was a Schartzee of the Bayreuth Regiment. The latter was a youngster only, no weight & 18 years old. The cemetery was an old British one of 1917 & curiously enough had no suffered the slightest damage either in the retreat or in the advance. Certainly Fritz had made a machine gun pozzy \nout\n use of a \nten\n trench ready for his dead, but of the four or five belts that were there \nready for use\n, only one had \n\nbeen used, so he did not stay long. This cemetery was on the hill opposite to our camp.\n\nAfter the heavy work of packing, carrying medical panniers & marquees over to the waggons etc, we lay about awaiting orders to move. Finally, as nobody seemed to know what we were to do, Tom Smith Ritchie & I led the way by depositing ourselves & our kits in an Ambulance waggon about to move off to the A.D.S.\n\nWe went at a walking pace along the main road from the sugar refinery, through Marquaix & then Roisel, which village had been, in the three offensive, shelled to atoms:\n\nThe other side of Roisel the road commenced to go upwards, & at the top of the hill we found the village of Herbilly & the A.D.S. This was in the grounds of what had evidently been before the war, just \nthe\n a Chateau & then a manufacturing works, for installed in a big shed we found several engines or their remains. It is possible the the gilt topped railings (mostly gone) & the remains of the ornamental gateway are true criteria, & the place was a chateau, for there is a heap of bricks in one corner of the grounds that might easily have been one. As this place has been the German back area for some months, it is possible that he built the sheds & installed the machinery for some purpose. The main shed has a sand-bag protection round it, which is at least 8 feet high.\n\nAs soon as we arrived we were sent to a good dug-out a hundred yards along a by road overlooking a large valley, & it is there that I am writing this on Friday afternoon.\n\nJust down in the valley we can see a battery of howitzers; on the opposite hill in patches of green other batteries of howitzers, & at least one big gun; & on\ne\n our left on another hill some 60 pounders. These are firing all day & part of the night, & I suspect there are many other heavy guns here that are lying doggo.\n\nOn the opposing hill there is a triangular wood, & before the advance of yesterday, Fritz held that, so in those times this by road was under direct\n\nmachine gun & sniping fire, although at a long range. This country has broad effects, & often when a position is under direct observation, it is too far away for accurate machine gun or rifle fire. Still the 18 pounders would do plenty of work in such positions.\n\nThe place where the 4th Batt had such a rough time on the","16":" night we spent at Marquaix is just to the left of the wood, & the hill on which both positions stand was responsible for a great deal of the gun fire we suffered last week, because he had good observation from it.\n\nNow the positions are changed, for we are overlooking his front line, although it is the world famous Hindenburg line. This lies, facing our doorway between the\n\nsecond & third ridge from here.\n\nYesterday evening Freddy Cocks & I went into the grounds of the French Cemetery opposite our A.D.S. to see an example of German ghoulishness. In the chapel which is still standing we saw where a flag stone giving admittance to a vault had been taken away. We went down into the vault by means of \nan\n iron rungs let into the wall, & found ourselves in a chamber about 12 feet deep & as much square. Two walls, away from the ladder which was on the wall \naway from\n at the front end of the Chapel, were filled with coffin sized apertures like ovens. There were three rows, & about four apertures in each row in each wall. About half of\n\nthese were still open, & off those bricked up, only two had been named. Of this two one had been broken open with picks, & the coffin inside had been broken open at the end, the wood & zinc lining torn away & the head of the corpse tampered with. It was the corpse of a woman, for it had long hair, which was all that one could see of it through the broken end of the coffin. The other named grave had also been interfered with, but only a small hole had been made.\n\nWhat the object of this awful deed was I cannot tell. I was told of a similar case at Roisel, where, however the coffin had been taken right out, & the lead lining removed. \nTwo alternative\n In this case the corpse, also that of a woman, was left out in the\n\nopen. Two alternative theories are either that they were after jewels which might be found in the vault of such a great family,– or that the object was to gain the lead lining from the coffins. Considering that the lead was taken from the coffin at Roisel, while the zinc \nlining\n lined coffin here was untouched makes the latter seem reasonable.\n\nThe vault had been used as a dug-out by the Germans (probably in the last retreat), who had even slept in the apertures, & there were signs that the ghoulish work had been done very recently probably when they were quartered there.\n\nHere again I found German soldiers buried in a French civilian cemetery,\n\nand\n but here they had improved on their collossal impudence. They had even appropriated parts of monuments that had been standing on French graves, & inscribed the names of their own dead thereon. The churchyard had been heavily bombarded, & many of the monuments had been \nsmashed\n broken where they stood, or smashed to the ground, so it is possible that Fritz, with his usual lack of common decency, thought he would make use of these fallen monuments.\n\nA heap of bricks by the side of the cemetery might have been the church. After his advance Fritz evidently built huts over the ruins of the church, & when he left this time burned these huts in common with the other remains of \nthe\n habitation in the village. Roisel also had been burned out.\n\nI was on Gas guard last night till 11 oclock, & so slept in this morning till dinner time. This was the first night’s sleep I had had since Monday. Now I am feeling fresh again & ready for the stunt we understand is to take place the day after tomorrow. If it is true it can only be an attempt to smash the Hindenburg line up.\n\nDuring the last month rumour has said \nthat\n of each stunt that it was the last before the long rest, but it has been falsified so many times that I am beginning to believe that we shall have to get well beyond the Hindenburg line before we go out resting. Rumour says even now that\n\nthe Corps will be relieved on the","17":" but on the other hand we are believed to moving our A.D.S. nearer the line, tomorrow.\n\nQuiet this afternoon\n","18":"\n\nLast night there was a full moon making the landscape show up as clearly as in daylight. I was able to read a letter received from Hicks (the American artist), with ease, outside our dug-out. The natural result was that Fritz came over in relays, & bombed our valley, & all round our ridge no less than three times. Nevertheless he did not have things his own way. We heard one plane steadily coming towards us, but before he had time to open up we heard a cheer from numerous \"diggers” on the hills around, & rushing to the entrance of our home, saw the plane coming down in flames. Before \nhe\n it reached the ground we head his bombs go off, evidently dropped in the crashing fall.\n\nIn the early hours of this morning a barrage was commenced on our front, for a stunt was due to come off. It seems that we advanced further than either flanks in the last attack, & now they are coming up to straighten the line. This morning’s attack was made with the object of helping the left attack. No word has yet come through concerning the result.\n\nAt regular intervals lately batches of 1914 men have been leaving for 6 months furlough in Australia, & yesterday a list of men to leave tomorrow was made known. It contains the greater part of remaining \"originals”, so that Hughes’s promise that all 1914 men should be on the way back by Christmas is evidently to be fulfilled. At one time when it was rumoured that 1915 men would follow my heart rose, but since\n\nthen it has sunk again, for I think there is little chance of my getting home before the war ends. I fancy the war may end in about a year’s time.\n\nAt the same time an interesting situation is opened. With the departure of \nthe\n a Staff Serg Dispense, Freddy Smith, I am brought one step nearer to the position for which there is now only one other claimant. Then there is the possibility of my getting the position of Education Officer for which I applied, so there is no need to say that the future holds nothing.\n\nNevertheless I would sacrifice all the chances of furtherance in the Army for a trip back to Australia; to the sky that is always blue, & the sea that speaks of nothing but pleasurable commerce & idle pleasure; to the combined urban & sylvan delights of Sydney with its intellectual life & \n\nits sporting & picnic life on the Harbour; to the fascinatingly scented bush with fierce work & energetic pleasure between virgin bush & verandah lined township streets; to the whole glorious future that lies before me if I am able to take my added knowledge of life back again.\n\nThe predominant thought in my mind in competition with the wondering about our Corps rest, is of leave. I am now about 30 on the list so, with five going per week I have only 6 weeks to wait for mine.\n\nOnes thoughts are almost always divided between leave, the end of the war & returning home. Yet it has been said that there will be no possibility of the Australians being all home under eighteen months from the declaration of Peace. Still, being a 1915 man I should be among the first, unless I get nabbed for\n\nthe education scheme that is going to fill in that period.\n\nThe wood facing our dug out, but on the opposite side of this valley, is Carpet Copse, & with the glasses today I had a good view of the enemy wire round it. To the right of this wood is another, beyond which the plane came down last night, & the name of this \nwood\n is Hervilly Wood, \nnamed\n after our village.\n","19":"\n\nAt last we are going to leave the line for our long expected Corps rest. Yesterday afternoon the Colonel came to the dug-out in company with some American officers, who were on the look out for billets for their men. That could only mean one thing – relief by Americans, & the immediate result of this visit was the performance of an impromptu jig round the wooden pillars of the dug-out, by everyone who inhabited at the time. Stan Dalton, the clerk, who is on night duty, & therefore was sleeping at the time, was unceremoniously wakened up to hear the good news, & to our performances.\n\nYet we have far less cause for pleasure than the poor old growsing brilliant & unbeatable infantry. Certainly we work during the whole of the time that the Division is in the line, whether on a quiet or a \n\nnoisy front, while they work in reliefs, but our bearers are not in the whole time, & there lies the point. The bearers, while not fighting, run almost as many risks as the infantry, taking good times & bad together, but what they miss in hopping over, patrol work, advancing against opposition & the rest constitutes the difference. And, as I said, the bearers are not always in the forward area so long as the infantry. Out of the line our chaps get a far better time than the drilling, marching & polishing infantry. They are the ones who might truly be said to do the dirty work of war, whether it is fighting or working.\n\nTherefore, one or two caustic remarks that the","20":" Batt. boys made the other evening when, having marched from the front line in the rain they found us in possession of a good dug-out, & only bivouacs on a trench for them were understandable. I wanted to get out when \n\nI heard them enquiring, although I was at the extreme end of the dug-out, & one of our chaps was on guard, because I felt they were worthy of the utmost consideration.\n\nThoughts have come to me lately of doing the supreme thing & joining the infantry, but I am barred completely because of the C classification on my eyes that was made at Hondeghem. The reason for this desire of mine is that I feel I could not do what they do, & therefore rather than be a shirker \nof\n on the last point, I should go through it, fear or not, to be true to my ideals. Many men have gone through the horrors of infantry work, notably the boy leaders, & some no doubt had afflictions as bad as mine. I dont think it will come to pass. Perhaps if I stuck to what I am doing till the end of the war, I should \nbe the\n be doing all that could\n\nreasonably be expected of me. Perhaps more – yet hardly that, for a man’s duty is to his ideals, and Army classifications should not ","21":" sway\n turn a man away from what he knows he can do. The hardest part of having ideals is the living up to them when only you & God know what you are doing & why. It is so easy to accept the world’s verdict. How often has some sincere & struggling soul been tortured with the worldly advice. \"You’ve done your bit; so why worry.”\n\nFritz shelled the ridge at the back of us last night, & round about here during the night. The weather was far too dull for aeroplane work, thank goodness.\n\nx","22":"\n\nWe left the A.D.S relieved by the Yanks at about 6 p.m on Monday. I was part of the advance guard, for the main body of the Division did not leave till about midnight. We marched halfway to Roisel where we were picked up by a passing lorry & conveyed to the German shell dump the Hamlet side of Tincourt\n\nOn the way back we passed the American infantry on the way in to relieve our boys, & there was, one long stream from the A.D.S. to Tincourt, (where we stayed), & beyond. Since then, the number of Americans moving towards the line was tremendous. In addition, on both evenings there has been a move towards the line of numbers of tanks. If this was not sufficient we soon learned from other sources of a projected attack on the Hindenburg Line, which is to take place, I believe, on Friday morning.\n\nThis morning, having heard that an attack would come off, I was not surprised to hear a terrific barrage open up at daybreak. Later, I heard it was not an attack by us that was thus heralded, but a determined attempt by Fritz to break through, by the aid of tanks, armoured cars, & every device he could use. Well, our Yankee friends soon found work to be done, & did it in fine spirit, for Fritz was easily held in, I understand, after the first rush. I am not sure whether he has gained ground or not, but if he has, it must be insignificant, for the All Clear came through to the units standing-to, & nothing but forward movement of transport has taken place this morning.\n\nWe took over our old hillside camping ground, & some English transport men who were occupying our bivouacs, very obligingly went into tents, although \nthey\n only courtesy (which does not prevail greatly in the \n\nArmy) required it. I am in with Sgt. Woodyard, who, since Sgt Kenny will soon be leaving for Australia, will shortly be in charge of the orderly room: In a confidential chat he gave me an idea of the changes that are likely to occur in filling the vacancies created by the exit of 1914 men I gathered that it would be possible for me to get a position as orderly room clerk. The objection is that my time would be taken up so much, that the Education Scheme would suffer unless somebody was found to take my place as chairman. However, things will take their course for Jack Woodyard knows my views.\n\nI am not sure, even now, if the Yanks managed to straighten the whole by pushing up. Some say that the went back instead of forward, & some, that they went forward. It seems to me impossible that\n\nthey can have gone back without our little lately held front being cut off for it ran like this:– \n\nHave spent the time in reading & in shorthand practice, most of the latter being with Vic Hall. I can do 15 words easily per minute, & yet have a number of abbreviations to learn, so I am getting on.\n","23":"\n\nYesterday morning we left Tincourt by train, & this morning I am writing my diary at a table in front of an open window which faces the hilly part of the village of Etoile. This is the village where we halted for a day on our way up to the offensive, and, arriving a little before the others because I was part of the baggage guard, I was lucky enough to \nfind\n be able to hire a room at 5 francs a week. There is a sheeted, & eiderdowned double bed & other little luxuries which make the room a veritable paradise after the horror of the Somme country.\n\nBeing foolish enough to let the cat out of the bag to Garland (the W.O.) I am now faced with the possibility of an order from the Colonel prohibiting \nthe\n sleeping in private rooms. I must try to circumvent such an order, I think, at least the room would be worth the money if\n\nI kept it for day work, & slept in the bed on alternate nights. I shan’t give it up without a struggle.\n\nMadame is 62 years old & lives alone with her husband who is 65, & who works at a factory in the village. She is suffering from conjunctivitis in the right eye which necessitates the wearing of a bandage to exclude the light. This bandage gives \nher\n quite a droll appearance \nto\n with her squat figure She seems almost a female counterpart of my old Turkish friend Mustapha of Ma’adi Camp.\n\nI am already conversant with the current gossip of the village. It seems that some of the soldiers who have billeted here since the beginning of the war have, as is often the case, made lasting friendships with the villagers. The Sgt Major gas instructor who had this room last has \n\nparticularly endeared himself to these old people. On the other hand there is one Mlle who has a young child of English parentage, & another who had a child (who subsequently died), which was a freak, having the lower part of the face dark & the upper part white. Two very smart mademoiselles whom I noticed in an adjacent cottage, are, so madam says, refugees from Amiens; very ladylike & aimiable, – milliners by profession. One of them came to inquire for the paper as Madam was talking of her, & I noticed the typical black dress & almost blonde hair of the French modiste. She was pale faced & looked rather sad, I thought, unless her dignity of bearing as an Amienois amongst provincial would account for the calm cold expression.\n\nWhen we were here before, I thought the village was very quiet & dull, but then we\n\nwere at the other end on the outskirts. This part of the village, just underneath the hill, is the main & busy portion of the village. Part of it has apparently pushed itself partly up the hill, the church being highest, just below the summit; & the Town Hall & school, – two similar buildings in modern style white & drab effect – just below, as if governing bodies \nof\n had determined have an overlooking position, to keep an eye on their charges. \n\nThat the church should be the dominating feature is at once an emblem of its position in all villages – a position of dominance one imagines the church should have. Psychologically the building of a church in such a position as to be in constant view, must have a good effect, apart from the problems outlined above.\n\nIt was a pleasant surprise to entrain at Tincourt, for, although we knew the line was in working order (it has been since four days after the Germans had left it despite the fact that by systematically mining every other joint they had destroyed practically every rail back as far as Villers Brettoneux), we expected, all the same, to have to march to Peronne.\n\nOn the flat expanse where once stood the station house & buildings, there was a large collection of German artillery captured in our final stunt, & alongside the rails all the 3rd Brigade baggage, a constant stream of waggons, lorries & mules. It was a busy & a happy scene because of arrival of our long hoped for rest; and it was made happier by the playing of regimental bands, who were entrained in their trucks & waiting for the move off.\n\nFreddy Cocks & I with Jack Sharp of the Q. M. Store, were baggage guard, & it was\n\na piece of good fortune we were, for our mess had given bread away to temporarily deficient Yanks, & no preparation was made for the journey, until we could draw rations at night. Therefore it was with pleasure that I beheld Jack Sharp, the good trencherman that he is, produce, bread, butter, \n&\n jam & milk. The latter, with water from my bottle made a good drink.\n\nSoon after leaving Tincourt we passed Buire rest station with its Red Cross flying gaily in the sun, & entered upon \n a most desolate\n the woods & barely war worn fields of the Chaulney district. After Chaulney, however, we came to the awful desolation that exists right the way to Villers Brettoneux. \n\nSoon the country became flat & desolate\n\nmasters have yet appeared to represent the civilian population. I saw one R.T.O.’s office in a railway truck, & that speaks volumes for the lack of accomodation & the ruin.\n\nThe trench scarred country continued till we reached Roisel where our eyes were gladdened by the sight of the tremendous German dump which was captured about the second day of the offensive","24":" or thereabouts). There was of timber alone enough to go a long way towards representing the value of the dump, which was given at 4 million pounds. There were countless stacks of railway sleepers ranging from a few feet to many yards in height; besides the many other stacks of military stores.\n\nSoon after passing Rosieres we saw the relatively untouched church of Harbonieres & caught a glimpse of a few damaged houses of\n\nthis village, which is near the St Quentin Road & not far from our Old Main Dressing Station near Warfusee.\n\nThen we began to traverse the German back & forward area (of the Spring offensive), & although the villages were in ruins, the country, being slightly hilly & wooded in the middle distance where the Somme flowed, did not look so desolate. There were the same old gun positions, stacks of German ammunition & trenches, \nwhich\n but these are to be seen everywhere on the Somme battlefields. There had been a great amount of clearing up & salvaging in these regions further back, since we first advanced.\n\nSoon, to our right & in the distance we caught sight of the dominating white twin towers of Corbie church, which told us we were \n\nnear Villers Brettoneux. Not very long after we passed this town, & noted the cleaning of the streets that had been effected, & also the fact that the \nremaining\n wall fragment of the church \nwas\n had been pulled down. So far the only persons other than soldiers that we had seen, were a couple on nurses above Peronne (from a C.S.S.) & the railway \nworkers\n officials. After Villers Brettoneux, however, we saw our first old lady, & thereafter, solitary civilian vehicles\n\nAt Amiens we found the civilian railway people working at full speed, & noticed two or three trains full of civilians, & some trains full of French soldiers. I spoke to one French soldier who had just arrived from Soissons. What struck him most about that front, & what aroused his displeasure was the number machine guns Fritz was using. There is no doubt that he is very short of guns & shells, & is \n\nrelying more every day on long range guns & machine guns for defensive work. By this means he probably hopes to safeguard his lighter field guns from capture, but from what I have seen & heard of our gun captures, the method is not very successful. Machine gun positions soon lose their power if the occupants have no desire to fight. With those who will fight to the last we have two or three very effective ways of dealing.\n\nAfter Amiens we entered upon the glory of smiling fields, pretty & untouched houses & civilisation again. Many girls & women waved to us from their cottages or from the road; & it seemed like old times again. I am sure we did not realise what a desolation we had been in, the length of our sojourn there, till our hearts were touched by the \n\ncheerful greetings of these grateful country folk.\n\nOn arrival at Longpré we unloaded our baggage in to an Ambulance car, which Birnie had brought for the purpose. & got a ride to L’Etoile a couple of kilos or so away.\n\nI am finishing this account off on Friday night, after a long gossip with Monsieur & Mdme over the good war news, & a shave & clean up. We are to commence classes on Monday, & this afternoon I made a notice & prepared a timetable. An order has come out that no men shall sleep in any but authorised billets, but I shall hang on as far as possible & chance orderly room & such terrors.\n\nxxx","25":"\n\nThe situation regarding the private rooms has improved I now find that the order was made more as a matter of form than a desire to restrict the men’s comfort, & the Colonel is, on the other hand, rather in favour of private billets than against them. Therefore the only point to consider is the question of being found out glaringly by missing parades.\n\nThe night before last the Colonel sent for me to tell me that he had been to Abbeville & arranged with the Y.M.C.A. man there to let us have forms & tables, books & other material, & that he wished me to go to Abbeville the following morning & see the Education Officer & find out if he could help us in any way. I went by car, specially arranged to take me, & managed to get some very great help from Mr Braddock. He was an M.A. B.Sc., pale & lisping, speaking with rather a labouring effect after correctness. He was not the sort of man\n\nwith whom one would feel instantly at ease, because he had had obviously more experience of the lecture hall than of the world. Nevertheless he was not snobbish with me, although he might be capable of it under different circumstances, & he set himself out to help me.\n\nMeanwhile we have started our classes, & notwithstanding a certain number of difficulties in the way of smooth running & good attendance, are progressing. In fact I am fairly certain that if I keep my nose to the wheel, & do not slacken off, there will be quite a good amount of useful work accomplished if we stay here.\n\nTonight we had a committee meeting of the Study Circles, followed by a Literary Circle Committee meeting, & it was arranged to re-open the meetings with a Lecture by\n\nDick Barlow on the Balkan Question. After the meeting was over Dick, Vic Hall & I returned to my chamber, discussed a Christmas pudding that Dick had received, as well as many other interesting phases of our literary activities, & our respective pasts & futures, before they went off back to their respective homes. Incidentally I touched Vic on the raw rather, by dwelling on his part withdrawal from the good work, but the unpleasantness was only evident long enough to recognised as such before all was happy again.\n\nDick contemplated transferring to the infantry, but his transfer was refused much to my pleasure, so he will have to remain with us. As a man of tact Dick shines in a very definite matter. He is fat faced\n\nspectacled (though not very short\ned\n sighted), & inclined to tubbyness. His tact & unfailing good humour (of a trifle heavy variety) cause him to appear easy going, yet he is quite the reverse when occasion demands. This morning for instance, he was very wrath with Mr Garland for suggesting that (as temporary librarean) he had not got the class room & reading room clean by a certain hour, for inspection. \n\nConsidering the amount of work that is in front of us Garland showed an utter lack of thought by speaking about such a thing, & Barlow would almost have been justified in doing what he hinted at, – throughing the whole thing in, & going on parade, when his time would be more his own. Such a thing would be a fitting punishment for Mr Garland.\n\nThe Ambulance head quarters is situated in a row of white alms house looking cottages, back from the road, on high ground immediately below the cliff above which the church stands. The houses on either side are separated from the square in front of the \nhouses\n cottages by two rooms & cellars, which were evidently used for pigs poultry & produce. We now use them for Q.M Stores & other military offices.\n\nOur class room is the \ntop f\n upstairs portion of the extreme right cottage (they are all in one block) & the letter G on the door signifies that it is the","26":" cottage (& last) in the row. We have two room connected by doorway with no door, & by putting blankets on the tables, & gauze at the little latchet window we have made it rather comfortable. Many pictures are ready for the walls when\n\ndrawing pins are available.\n\nx 6 – (55 – 9)","27":"\n\nOur class room is now \nin\n looking pretty comfortable with blankets on tables, pictures up & a blackboard. Having taken on Literature as an extra subject I donot find time heavy on my hands. In addition to the new subject I have a burlesque to prepare for the concert party. By slogging hard today I hope to be able to have more spare time for reading this week. Last week it was one incessant rush despite the fact that Barlow & Witcombe are both also off parades. \n\nOn Friday Mr Braddock came out & lectured on \"Sanctuary”. It was rather a bad subject for Australians (although I think they were interested: at least I assured him they were), but I noticed that he tackled the subject very skilfully from the technical point of\n\nview of lecturing. On the other hand he did not suit his delivery or exposition of the facts to his audience (which happened to be a few of the","28":" & a few infantrymen. I tried to get a good audience, but I fancy the title \"An Old English Institution” frightened most away.) preferring not doubt to give it in his own way. This made it more dry than it need have been, for a lot could have been done with a little humour. He smiled once & then quickly recovered himself.\n\nThe art of expression by means of lecturing is very important, & cannot be treated too painstakingly. Since one who lectures is attempting to help his fellow men, it should be worth while studying exactly how to get into intimate touch with them.\n\nBarlow is lecturing on the Balkan Question on Tuesday (tomorrow), & it will be interesting, I feel sure.\n\nLooking at the war news, it is astounding how great a change has been brought about since Foch as Chief in Command beat the Germans on the Marne.\n\nIn the East Palestine has been rid of the Turk, a victorious army in the Balkans has compelled Bulgaria’s surrender & is menacing Turkey. In the West, we have retaken all the ground that Fritz took in March; broken through the Hindenburg Line, straightened out the St. Mihiel Salient & menaced the Ironfields & Metz; taken the Argonne forest; & advanced in a way dangerous for Fritz in Belgium.\n\nYesterday the paper contained news of the \noffer\n application for an armistice on the part of the Central Powers. They desire, with the armistice, a discussion on the basis of Pres Wilson’s 14 points. The appeal was made to Pres. Wilson. According to comments this has not made a very favourable impression\n\non account of the fact that they do not actually accept the terms (in fact Prince Max von Baden, the new Chancellor, referred rather bombastically to the \nneed\n fact that, if we refused they would enforce it). Still, the appeal is significant because it clearly shows that Germany is anxious. If all goes well she will climb down still further in the future. I am afraid that it will be almost impossible to finish up before winter, although it is by no means quite impossible.\n","29":"\n\nTo my great surprise, I was informed yesterday by the Orderly Room Chief (who is now Sgt Woodyard – my Arithmetic Instructor), that I was to be a Lance Corporal. In accordance with his news it appeared in todays orders as \"while Organising the Education Studies. It is amusing because \nI\n it is given, I understand, because, our classes being regarded as parades during the afternoon, I am in charge of a parade & have to submit names of absentees. Nobody can have charge of anything in the Army except an N.C.O. or officer, & so I am raised to the giddy height for the","30":" time. On the two previous occasions I both wanted promotion & expected it, but now it is completely unexpected & not particularly desire. The last clause is qualified \"because it might possibly lead to higher things.\n\nGermany’s Peace Note to America was answered in a very brilliant way. Pres Wilson said that he wanted to know first of all if the Central Powers definitely accepted his ","31":"\n 15 points, & whether the Chancellor represented those who commenced & are carrying on the war, or not.\n\nThis effectively shows the significance of the German note, & will have the effect of making the Chancellor admit his duplicity or else the complete defeat of Germany. Incidentally it will bring the Chancellor right up against the 15 the Clause, which, states definitely that we will not treat with Hohenzollerns.\n\nAt present I am feeling rather stale as the \neffect\n result of overwork & under-exercise. To-morrow I am due for Leave to Abbeville so I shall try to shake the cobwebs off my head.\n\nVarious special things such as medical inspection or bath parades, \nhave\n or the unit dinner, have occurred to interfere with the smooth running of the classes. Also they have to a certain extent interfered with the attendance. With a new time table next week, & the reporting of absentees, a more definite attendance should be possible.\n\nx Sal","32":"\n\nSince last Thursday I have been working at top speed, & have collected a cold which has made matters rather worse. On \nSunday\n Monday I had a little straffe from the Colonel which was easily bourne but concerned an annoying affair.\n\nLast Saturday’s Committee meeting was attended by two delegates from the 2nd & one from the","33":" Field Ambulance as a confirmation of the inter Ambulance discussions which were commenced when we were at Hondeghem. These had been invited as a result of the previous weekly Committee meeting, but by an oversight the Colonels signature was not obtained to the invitations, although the Minuite of Meeting which would have given him the invitation was sent down for his perusal, which it, however did not get.\n\nThe result was that he was taken by surprise by the arrival of Major McKillop as one of the delegates. This annoyed him, but the straff he passed on to me was quite friendly, & ended happily, the phrase of it stuck in my mind, however, on account of its apparent superfluity \"I dont think” said he \"that it was meant as a snub to me: If I thought so I should know how to act.”\n\nAs a result of information gained at that meeting from the delegates, we are now having a number of forms prepared to get educational information from each man in the unit. A parade will be called by the Colonel, certain vital points will be given to them by him, & then we shall proceed to collect the information, & to draft the outsiders into the classes which may assist them.\n\nThere are fresh rumours of the near approach of a definite clearing out of private billets of those occupying them. I hope it will clear over.\n\nThe weather during the past few days has become much colder, & dull. Today it is drizzling & the outlook is far from inspiring.\n\nOn Sunday afternoon the sun shone for a time & the village had the usual happy & holiday look. News arrived at midday on that day, of the acceptance by Germany of the points of Wilson’s speech, & of his willingness to evacuate the conquered territory. In stipulating for a mixed commission to arrange the evacuation, however, she gave a bad impression. This was not appreciated till Monday when the full comments came out, so it appeared on that sunny Sunday afternoon.\n\nas if the war really was practically over.\n\nIn any case, the wonderful advances we are now making, confirm my suspicion that Germany really is breaking up, & that such diplomatic troubles as these will soon clear up before the certainty of impending collapse which faces her. Naturally she will try to make the best of a bad job, but we, I am sure, will not allow her to dodge one iota of the consequences of her own acts.\n\nIt is amusing to read some of the silly letters which are written to the \"Times” & \"Daily Mail” (particularly to the later) by people who want German towns razed, or else suggest some fanciful scheme for making Germany repair the damage she has done.\n\nx ","34":"\n\nYesterday afternoon the Colonel held a parade at 2 p.m. when he gave the unit (or such of them as were there) a talk upon the Education movement, prefaced by the reading of some notes which I had prepared. Then the chaps filled in forms which I had ready for them, & all was finished.\n\nThese forms have mostly been collected, & the information tabulated, so that we have a pretty comprehensive idea of the various demands which the men of the unit need filling. We have sorted them all out into professions & trades, & now we are going to commence fresh subjects where instructors can be found, or where simple discussions would help matters at first.\n\nAll this time I have been working hard & so has Barlow, & in a lesser degree Witcombe. Hall has been pretty busy with plan drawing & other artistic work for the unit, besides his own class work, & private study. By tackling the problem of decreased attendances (owing to football matches etc.,) with a readjustment of the Time-table, a slight improvement has been effected. I believe that the report for October will show considerable improvement.\n\nMeanwhile the weather is rather dull. Occasionally we get a fine hour during an afternoon but on the whole the weather, though not cold, is depressing.\n\nWe are to have a Review in about a month’s time, & this fact is causing a great\n\namount of worry to me. It means that every week an entire afternoon must be taken up by drill with the Colonel in charge, & packs & buckles clean or bright. In addition, as many men as are available are needed for a morning drill, which means that only one is allowed to remain in charge of the Education work. As we are up to our necks in compiling the statistics, I have referred to, & in arranging new classes, this hampers us.\n\nA direct result of the putting on parade of every available man, has been the \"striking” of the concert party \"en masse”. I do not think that everyone works with the right spirit in these matters, but it is becoming increasingly clear to me that the W.O. is untactful in his methods, & shows an\n\nan apparent total lack of sympathy both with the sporting & recreation pastimes of the unit.\n\nToday was \"Sports Day” & it fell rather flat. The cause may be attributed, I think, to the same source, for men have been refused permission to go & prepare certain team races, & to train, on the plea that they were needed for drill. However just such a plea may have been, there is no doubt that a genuine resentment has been caused by it, & that it produced the unhappy sequel of a dead day’s sport.\n","35":"\n\nJust finished a hard day’s graft with more worry than was necessary. The cause of this was the fact that Mr Garland notified me that there would be two afternoon drills this week: Tuesday & Friday; & after we had made the necessary alterations in the time table, he came along with the news that only Wednesday was to be used for special drill. This put us in a funny position, for all alterations had to be cancelled, & that made matters more difficult for us although it was done, I think, (by the Colonel) as a help to us. Probably it will turn out to be better for the classes.\n\nHave felt worse this afternoon than for a long time, on account of the beginnings of worry. Work is not harmful except when\n\none does not get sufficient exercise; but worry is bad in any case.\n\nFrom now till next Monday, when I hope to go on leave, I am going to quit worry, & let things take their course. We have got two new subjects down for this week: Farming & Commercial Law, & probably we shall commence Motor Engineering next week.\n\nI came over to the house to do some preparation for Literature, this afternoon, & found Madam gone, so I went in search of her. I found her doing some sewing in a cottage on the hill & below the church. This cottage belongs to a grand old gossipping dame who has called here twice since I have been here. It was amusing to see Clemence (my land lady’s name in the village; it is her Christian name) holding\n\nher own with the other dame. Clemence is no mean gossipper when she gets going, but she has a worthy adversary in the other one. Clemence relies for effect upon swift dialogue form of narrative, with plenty of \"qui dit’s” interspersed in exactly the same degree as English gossips repeat the English equivalent: \"he says says he”. The other depends more on dramatic gesture, & sudden raisings of the voice.\n\nFor Literature tonight I dwelt on the Arthurian Legends & read the \"Morte D’Arthur”. Being rather fagged, however, I spoiled what I had hoped would have been a good lecture, by lack of spirit. Pay caused a slight postponement.\n","36":"\n\nTomorrow morning I go on leave to England, & despite my overwork of the past few weeks, I am feeling in tip top condition, & just ready for a fortnight’s abandon. I am not really in tip top condition, but I feel it & that is the main thing.\n\nSince last week, although I have had plenty of difficulties to contend with, principally in connection with Barlow & Witcombe being wanted for parades – with the W.O. of course, still everything has cleared itself & all is going well.\n\nToday we were inspected by the DMS (a General) & he had some good things to say about the Education system in our unit. Later on a Capt. Crotty – chaplain to the","37":" Batt – who had called to see the Colonel earlier, came along with an Education Officer who\n\ndesired some information as to the working of our scheme. They were both impressed, of course as they jollywell should be. It is rather curious that I who had been definitely passed over by the Educ. Dept. (I have gathered this from the fact that the officers have been chosen & have undergone a course at Cambridge) should be giving advice to one who was fresh from their course. Still, he was an infantry officer, & one can feel no grudge against such people: as a matter of fact he was a fine fellow\n\nI mentioned to the Colonel the other day that I intended with his permission to call at H Quarters when in town, with the object of getting information as to the possibility of getting leave as a B class man, to pursue\n\nmy studies at a College in England. He was very kind & has given me a letter of introduction which may help me to something. I dont feel very anxious to leave the","38":" but now is the time to try my luck, – if ever.\n\nVic Hall took the Literature lecture tonight, as I had anticipated being away to-day. Freddy Witcombe is going to take charge of tings while I am away.\n\nHow strange it will be to me when in England to look back on all our struggles to establish a live educational system in the unit, & \nof the\n to see in its true perspective, the success that has been granted us.\n\nVic Hall, Barlow, Roy St George & Witcombe have, between them done sufficient\n\ngood work to make the result certain, I have been able to supply the very necessary organising power, & energy, & they, by their backing my efforts & their unselfishness, have \nhelped\n caused the results.\n\nDuring the week we commenced Farming & Business Principles, & Telegraphy will probably be commenced this week.\n\nI have written to Dad & Lily giving them my time of arrival in London as Wednesday night, but they may not receive the news in time. They have been expecting me to put leave off until the middle of November, but I wouldn’t do that for pounds, if it were practicable; I have been too much dependant at the prospect of leave as a relief from work, to do that.\n\n"}}