{"Document Name":{"0":"Diary_0129","1":"Diary_0129","2":"Diary_0129","3":"Diary_0129","4":"Diary_0129","5":"Diary_0129","6":"Diary_0129","7":"Diary_0129","8":"Diary_0129","9":"Diary_0129","10":"Diary_0129","11":"Diary_0129","12":"Diary_0129","13":"Diary_0129","14":"Diary_0129","15":"Diary_0129","16":"Diary_0129","17":"Diary_0129","18":"Diary_0129","19":"Diary_0129","20":"Diary_0129","21":"Diary_0129","22":"Diary_0129","23":"Diary_0129","24":"Diary_0129","25":"Diary_0129","26":"Diary_0129","27":"Diary_0129","28":"Diary_0129","29":"Diary_0129","30":"Diary_0129","31":"Diary_0129","32":"Diary_0129","33":"Diary_0129","34":"Diary_0129","35":"Diary_0129","36":"Diary_0129","37":"Diary_0129","38":"Diary_0129","39":"Diary_0129","40":"Diary_0129","41":"Diary_0129"},"Date":{"0":"unknown","1":1437.0,"2":1438.0,"3":1439.0,"4":1440.0,"5":1441.0,"6":1442.0,"7":1443.0,"8":1444.0,"9":1445.0,"10":1454.0,"11":1455.0,"12":1461.0,"13":1478.0,"14":1479.0,"15":1481.0,"16":1482.0,"17":1487.0,"18":1496.0,"19":1497.0,"20":1502.0,"21":1503.0,"22":1509.0,"23":1510.0,"24":1512.0,"25":1514.0,"26":1515.0,"27":1516.0,"28":1520.0,"29":1524.0,"30":1527.0,"31":1535.0,"32":1553.0,"33":1554.0,"34":1562.0,"35":1563.0,"36":1564.0,"37":1566.0,"38":1567.0,"39":1572.0,"40":1574.0,"41":1575.0},"Entry":{"0":"\n\nEsdud. ","1":"\n","2":"\n15-30\n miles up the coast from Gaza\n\nWe have caught up with the Brigade & are now camped just behind a village. There is a battery firing just a few hundred yards in front of us & a half battery of heavies firing a few hundred yards behind us so I expect we shall get shelled out of here soon. \n\nThe Turks have made a stand here & held us up for two days & now the 52nd Inf Division is up here attacking them. There is an enormous amount of material & guns abandoned back on the road & there must be at least &pound;3000000\n\nworth of shells alone. So we have got our own back from the Peninsula if all continues to go well. There is I am told a division of Turks surrounded away back behind us at Gaza somewhere so we ought to get the lot of them. This gun going off behind me will give me a headache if we don’t go soon.\n","3":" 30-35 miles above Gaza & about 8 below Jaffa.\n\nWe did not get shelled after all. but in in the evening went back to the Beach for a supposed reorganisation. However next day (yesterday) we were sent off from the beach\n\n& slipped through a little neck between the Turks & the sea, caused by the Turkish Right flank surrendering & came on up the coast about 10 miles or perhaps more. Now we are into it again close to a Jewish settlement which is here, it is a pretty little town quite clean & English in appearance full of Russian French & English Jews, who were delighted to see us & gave us oranges & bread etc etc, very acceptable.\n\nWe had our battery on a hill just above the town & it was very funny to see the womenfolk – which are very pretty\n\nby the way – shriek & run when they opened fire. A crowd of them got round me asking \"If there was any afraid of being out of the house.\"\n\nThe Turkish Sanitation was practically non-existent I think, as the flies are very numerous & my hands have both gone terribly septic, which is a great nuisance as, besides being painfull, when on the move like this one cannot get them properly attended to.\n\nHow the scrap is going today I have not the faintest Idea, we seem to be pretty stationary. Was up at DHQ last\n\nnight & heard that there were 13000 Turks between us and Jaffa.\n","4":" place Same day 7.15pm.\n\nI am now sleeping at the Telephone, or, should I say, about to sleep at the telephone. The firing has died down with the advent of night, and everything is quite still now, but I expect that we shall be woken up by shells in the morning as we are very much within range. However I believe we are going directly after stand to, which is at 4 ac emma.\n","5":"\n\nOutside Jaffa.\n\nThe last two days have been very quiet, we did not get woken up by shells after all, as the Turks departed in the night.\n\nWe stayed most of the next day at Deiran eating up big on the wheaten loaves of bread which we bought there, & then came on to Ramleh which is a large but very dirty town with only one or two large buildings in it. We passed through that\n\n& came straight on to Lud, chiefly interesting for a fine old Greek Church containing the tomb of St George. Here two troops of the","6":" Reg charged into the place & \nfound\ntook 309 prisoners in a bunch & 4 MGs, with only three casualties.\n\nI suppose tomorrow we shall investigate Jaffa. Noone seems to know yet whether the Turk intends to hold it or not.\n","7":" \n\nSidrat el Harariyeh\n","8":" miles south west of Esdud.\n\nFrom Nov 17-21st we remained outside Jaffa the NZs having just beaten us into the town & so we were just holding an outpost line a few miles ahead of Jaffa & then we were relieved by two regiments of the","9":" Bgde. and then came back here which is about 20 miles below Jaffa taking two days to do it in, whether for a rest, which is badly needed, or because they cannot feed us I dont know.\n\nThe horses have been living on neat\n\nbarley & peas for nearly a \nweek\n month now & need tibu very badly. Of course we managed to beg borrow or steal some from the various villages on our way but it does not go far.\n\nAll around Jaffa are these Jewish settlements and I must say that they have certainly made quite a little paradise of the place. One might almost be in England again in places everything nice & clean & sweet smelling such a relief after these dirty arab villages.\n\nThere is no doubt that Palestine \n\nwould become soon a very valuable country if all the arabs were hunted out of it & the Jews settled here. After what I have seen I am all in favour of letting the Jews have the place. Perfect little paradises they create for themselves.\n\nAyunkara ","10":" \n\nWe left Sidret el Hareriyeh on the","11":" & came up here in one day. There is quite a big war on here now. The turks seem to be making their first stand here on a line roughly Jaffa-Jerusalem.\n\nAnyway there is some very heavy stuff being bandied about here now. We are up here in reserve acting I believe as divisional troops for infantry.\n\nI am a pitifully sordid object just now, bandages are very scarce now & so we have to keep our ad infinitum.\n\nI spent most of the halts on the trek up here tenderly undoing one sceptic sore after another & spitting on it to keep the swelling & pain out of it. Imagine me, all one\n\nhand & the thumb of the other a repulsive looking mass of frayed & filthy bandages, another filthy bandage around my forehead & divers other repulsive looking sores left uncovered. I have given up washing as a daily habit simply because I am too much enveloped in bandages, but I wash whenever I dress my hands which may be anything from 24-56 or 60 hours. In fact I look & feel a pretty miserable object.\n","12":"\n\nTonight I am sleeping in a tent 60 miles in rear of the line. The reason being that I have been sent back here to superintend the shifting of our dump.\n\nI rode down last night to where the motor lorries bring the rations on the Ramleh-Jaffa road & then waited until midnight, then they turned up 50 of them.\n\nWe went to Ramleh and \"parked up\" for the night & then came on by apparently a succession of enormous \n\nbumps to Talis where we changed cars & then to Deir suneid which is at Present Railhead, Then the rest of the day on the train coming down through Gaza to Belah where we got ourselves i.e. I & the L Cpl from the Bgde Eng. invited to tea with the YMCA man & then proceeded through the usual channels to Anzac Details et Nous voila.\n\nAyunkara Dec\n\nI came up from Deir el Belah yesterday taking 3 days to do it in owing to the bad roads from the heavy rain which we had all the time I was down at Belah. Now we are camped right in the village of Ayunkara around the town hall which is being used as a hospital by our tent division.\n\nIt is quite a good little building about the size of the Masonic Hall at BS with quite an up to date little stage & gallery in it.\n\nNext to us on one side is a beautiful little orange orchard studded with palms which makes a most beautiful effect.\n","13":"\n\nOn the Ramleh Jaffa Road.\n\nA week ago they came to me & offered me a job as Tempy Cpl to go in charge of details at Div Train.\n\nAs the rumours of being dismounted have continued to grow in strength & volume I decided that I would take the job. So for the last week I have been here with the Div Train. When I got over here I \n\nfound there was no horse for me. So I decided to go to the Colonel & beg for Bernard. I did not think that I had a chance of getting him but to my surprise the Colonel agreed immediately so now I have him here with me.\n\nThe R.M.O. who is of course my O.C. here drinks like a fish & is a most queer person to handle. He is a Scot & while I have been here has given two men the sack & so I expect he will do the same to me any day especially as he recommended \n\na Tpr who is here to be Cpl. instead of my coming over. The other day the","14":" Bgde went into the trenches to support the Infantry here, so at any rate they are being dismounted but it is I think only temporary.\n","15":" Night 1917\n\nWell, this Xmas has been a little better than last at any rate though not very much. I have at any rate been able to overeat myself twice today & owing to the Jews’ distilleries there has been plenty of liquid refreshment.\n\nOn the night of the","16":" we were kept awake \nall night\n for about 4 hours by a tremendous bombardment & that night & the next our infantry attacked. The Turks and their positions were literally blown sky high & the next day they were in full retreat from Jaffa to Jerusalem. Now they are from 20 to 30 miles away It appears that the Anzac Div is not going to be in this advance as tomorrow\n\nwe ie the Div Train are moving back to Esdud. (&the Div I think \n\nIt is horrible weather for a move as it has been raining all day & for about 5 days preceding this, However one must pray for the best.\n\nBoxing Night ‘17\n\nYebnah\n\nOn our way down to Esdud through a sea of Liquid mud my outfit - a cart & two horses managed to get us as far as here & then the two horses, both suffering from Lampas & as \n\npoor as crows, gave up the unequal contest with the result that we drew in here for the night. There are wagons stuck here and there along the road for about 4 miles, one of them came in here with us & we made a common mess for tea with the result that a plum pudding came to light – the third I have helped to eat in two days!\n\nFor liquids there was \nRum, Gin \n Tom Thumb, Mothers’ ruin, & pinkey\n\notherwise Rum, Gin, & wine the latter the remains of two gallons which we bought at Richon for Xmas day. So we did pretty well, all things considered.\n\nIt rained this morning but cleared off in the afternoon & at present it is a beautiful moonlit night – in fact I am writing by it – so we are hoping that the weather is going to clear up.\n","17":"\n\nEsdud\n\nWe stayed that night at Yebnah & reached here late in the afternoon of the following day not without much agony & bloody sweat on the part of the horses. Here we have quite a nice little camp inside a sort of paddock bound on three sides by a prickly pear hedge & on the fourth by the railway & altogether encloses about an acre, so it makes a nice tight little camp. The RMO who is\n\nmy special cross, got lost (as they tell me is the usual thing) & did not turn up until two days afterwards you would have laughed if you had seen me taking sick parade. I made it a point to give them all something anyway & then trusted in their faith.\n\nWell old 1917 goes out in a few hours & he has not been such a bad year either for me at any rate. Battle of Rafa on","18":" then out of it & on the beach most of the summer until the hard work in this advance.\n\nagain, yes it has been quite a good year for me.\n\nLet us pray that 1918 will see the conclusion of this nomadic & uncomfortable life.\n","19":"\n\nToday was to have seen us moving out of here in company with the Division to Yebnah where the brigades were to be temporarily dismounted & take over a part of the line; but now that scheme has been changed only one regiment is going to Yebnah & here there is a strong rumour that \n\nthe mounted troops are leaving this front & that we are going to Yudia for garrison duty. Certainly most of the yeomanry have gone down to Deir El Belah. But I think all this retrograde movement \nhas a great deal to do\n is largely due to the difficulties of transporting fodder when we have so many divisions of infantry in front of us as well.\n\nThis is a very sedentary life here now, the sick & ailing usually keep us working in the morning\n\nbut after that there is nothing whatever to do. I usually take Bernard out for exercise in the afternoon & in the evenings read.\n\nI was amused by one fellow the other day when rations had been very short for some days. There were several men present & the conversation turned on Conscription, which is said here to have failed, \"well\" he said with many strange oaths \"I voted yes the other – day but now I’m – glad they turned\n\nit down, if all the -----s had come over here there would be nothing to eat at all!\"\n","20":"\n\nDeiran\n\nMy Job at the Div. Train fell through last Sunday week at about 3.30pm when the former holder of office turned up to take charge once more\n\nOn the Wednesday I returned to the bosom of the","21":" LHF Amb at my usual salary viz six denarii a day. On Sunday we moved from Esdud to here. The day dawned fair &\n\n& promising but we had not gone more than a few miles when it began to rain with great gusto. On our arrival here at almost 3.30pm quite empty & not a little wet, we were faced with the cheering fact that we would have to sleep minus our blankets, as all the transport was stuck in the mud halfway. I, to my unspeakable disgust was told to take five men & search for a waggon that had broken a swingle bar leaving Esdud \n\n& which had not been heard of since. So we started wet, tired & without rations. I was not told what to do when I got there in fact there was nothing we could do except find out their whereabouts & if merely for that, why six men?\n\nOn arriving at Yebnah a native village some halfway back we were overtaken by night which left three courses open to me, to go on to Esdud & in all human probability get bogged in the fertile plains of Philistea & certainly miss the waggon\n\nII Stay in Yebnah & risk freezing & continue in the morning without horsefeed or rations\n\nIII Go back & wait until morning\n\nI chose the latter, to the gratification of my five trusty henchmen.\n\nStarted out again next morning & rode until 2.30pm when we found the damned waggon & as I anticipated were laughed at for coming & told that we could do nothing & thereupon\n\ncame home again. Bernard fell into a wadi on the way back & life was a very poor thing indeed.\n\nBut the first night was the worst as we had no blankets fortunately we got hold of some tents & I being an old hand at this game & prepared for most eventualities from bitter experience had half a waterbottle full of rum. We turned in & when I woke up shivering I would have a nip & give\n\nsome also to the man next me & doze again for an hour or so & then have another nip & so on. It just lasted the night.\n\nNow I have got my little hand made \"bivvy\" up – the one I made when on the beach at Khan Yunis & should be pretty right now. But may all the powers of heaven preserve us from another move in the pouring rain.\n","22":"\n\nNear Richon-Le-Zion\n\nWe had not been more than five days in that camp at Deiran when we got news that the camp had been condemned & we had to move. Accordingly we came about 4 miles further on to the outskirts of Richon. \n\nI had just got my home put up & drains dug around it when I got orders to take six time expired natives down to Rafa & bring their relief up, So I rode to the station with six natives on donkeys streaming\n\nalong behind my pony’s heels just like a pack of hounds. Arrived at the station I had lunch with a taciturn Scotch artilleryman who was also going down the line. Then we sat down & wished for the train. This we continued to do for some hours. Finally about 3.30 we managed to get aboard.\n\nThe artilleryman left me at Deir sinneid & I proceeded alone (except always for the six natives in another truck) to Gaza.\n\nHere they announced that the train\n\nwould go no further & very meagre hopes of another one so I poked about until I found an empty tin, made a billy of it & put it on one of the braziers belonging to one of the pointsman, no sooner was the tea made than up came a train into which I bundled myself & my charges. Here I fell in with a dishonest old infantryman who was making an apparently lucrative business out of his job ration convoy by selling the rations. Anyway he made about 50 Pt by supplying\n\nmy natives with cigarrettes.\n\nI put a few discreet questions to him & apparently he regarded it as quite the usual thing to do.\n\nArriving at Rafa at about 4.30pm I took the exact opposite road & went about a mile out of my way to the Camel depot. I came back to the station & tryed again but could not find it, so I returned once more to the station – the natives padding along silently & wearily along after me. Then I told them to go to sleep & I myself\n\nturned in in the YMCA tent – which is a sort of free hotel to all travellers on the line.\n\nNext morning I found the place, got rid of the natives & having lazed away the morning in the sun & canteen I got the new natives & caught the five oclock train which unfortunately refused to go any further than Deir sinneid so I spent the night there &, having sent a wire in the morning to announce my arrival caught the seven train and arrived up here about lunch time\n\nBut here on my arrival yesterday I discovered that my wanderings are not yet over, they have made a clearing station at Railhead & I have to go over there in charge of the riding personnel.\n\nI shall be glad when I get settled down.\n\nMeanwhile the war is still going on. As usual I completely forgot all about my birthday until it was over, this makes the fourth birthday which I have not celebrated in this country.\n\nToday I made my last will & testament owing to the fact that the paybook will has been proved valueless & they require everyone to make a formal will which they are going to keep in Cairo. I must find out if it is possible to get a trip up there in order to change it.\n","23":"\n\nat The Full o’ the Moon\n\nGreat rumours going around this morn of a night raid such that one sleeps in suspense these nights.\n\nEspecially to night the","24":" our Secret service is supposed to have announced that a hostile raid will be carried out about 11.30pm it is now 8.30 I am prepared in every possible way – a water bottle full of rum a hole outside my home to get into if things become too bad \n\nBut it is beastly this suspense, last night I thought that I could hear one & lay in frozen stillness sweating gently for about five mins until I discovered that it was a motor in the distance. Tonight\n\nwill be the same I suppose.\n","25":"\n","26":"\n\nThe air raid that we were expecting did not come off after all & today it has clouded over & rained most of the day so tonight I don’t expect he will try it.\n\nWe are spending a very quiet existence now the division being in winter quarters supposedly which same smacks of Caesar \"de bellis gallices\" but is a fact nevertheless. Meanwhile the\n\nwar still goes on but things have changed in many ways.\n\nAt the start everybody was out to help everyone else & all were keen. Now everyone is out to make (as I have heard it expressed) \" a separate peace on their own\" in fact the army version of Dieu et mon droit & more practiced as time goes on. \n\nMeanwhile hundreds of men all over the world are being incontinently hurried into a Beyond of which they know nothing & Poor\n\nold Charon has I hear now turned himself into a Limited Liability company with a fleet of up to date modern motor ferry’s to cope with the overcrowding of his erstwhile barge; and they say he is making a mint o’ money these days.\n\nHere comes the rain again pitter pitter pat on the roof of my home: I don’t mind the rain but it is the gusty wind which accompanies it which raises doleful apprehensions in my \n\nmore gloomy thoughts. Pray God the war ends soon.\n\nThe Salvation Army Captain who was one of my trusty henchmen when I was with Div Train declares that according to the Bible it will end in February. I only hope so indeed.\n","27":"\n\nWent up to Richon this afternoon to get a hot bath but found a regiment waiting so we went to the town hall where the NZ band was playing. Two Enemy planes \n\ncame over. Our guns opened up & one of our planes attacked them driving one down the other went to earth in a cloud above our heads.\n\nThe band was playing \"the Girl in the Taxi\". Women & girls standing about in their best dresses & every time the music softened one could hear the rat tat tat of the M.G. in the cloud above & now & again a sombre WE would burst miles above our heads It made a curious scene.\n","28":"\n\nThe rain is over & we have had a few perfect days but tonight a gusty wind is blowing a hurricane I am afraid my home will not stand it. I am afraid we are in for the usual monthly wind which generally lasts three days.\n","29":"\n\nKilo 295\n\nI am still here eating Lotos off a tin plate & having a very quiet if hardly hilarious time. \n\nMy day is usually spent thuswise\n\nI rise at 6.30 Groom & feed my pony breakfast at 8 at 10 the horses have to be watered & after that besides drawing the horsefeed nothing is done till Lunchtime at 12 when we feed the horses & ourselves again\n\nAfter lunch I have a pipe & then usually go out for a ride – there are one or two quite pretty corners around here – at 4 oclock we water feed etc again tea at 5. After tea we usually make a fire & sit around it until about 8 or 9 & Then I retire to my home &\n\ngetting into bed smoke & read or write until such time as I deem it necessary to go to sleep; then I take five mouthfuls of neat rum blow out the candle & sleep like a top until 6.30 next morning & so on.\n\nThe wind has calmed down a bit to night thank goodness but I am afraid we are to have rain in its stead.\n\nThe country here is quite pretty to our sand glazed eyes. Imagine a hilly down country\n\ndotted here & there with little villages of white cottages with red roofs nestling against a spur in the midst of a cluster of orchards & vineyards. The orange orchards are a mass of golden fruit & every lane or road is hedged with wattle or prickly pear on either side. The farther north you go the prettier & more thickly populated the country becomes. \n\nAt Tel esh Sharia where the \"fertile plains of Philistia\" start the country is rolling flat & monotonous. \n\nwith nothing to be seen save an occasional squalid native village. At Esdud the Jewish villages begin & there is a marked improvement in the scenery while the country becomes more hilly & broken finally when nearing Jaffa there are quite little paradises created, seemingly to the jaded eye.\n\nAlways to the right are to be seen the Judaean Hills, the backbone of Palestine towering up, blue & velvety in the distance\n","30":" \n\nLast night we bought a case of Beer and had what is known as \"a big night\" There were five dozen small bottles in the case & seven of us to drink it, despite which it was all finished at about 9 o’clock, but by then noone minded. I had great difficulty in keeping fairly sober but, even then I was considerably more sprung than I intended to be. However I saw everyone into bed & put the fire out & then retired myself. \n\nThis evening we had a dozen big bottles which we found very difficult to get rid of, in fact I think some were still left, as everyone refused to look at it tonight.\n\nThe weather during the last week has been vile, a high wind & gusty with oceans of rain. I have managed to keep fairly dry but it is most depressing to paddle through sloppy mud to one’s own little oasis.\n\nA new establishment has come\n\nin now for all ambulances and as apparently under it I am going to lose Bernard for there are to be only eleven hacks kept in the whole outfit; I have put my name in for a Base job, as they are asking for long service men for that. I shall be extremely sorry to lose Bernard & all my saddle & things – the former of which I have had two years & the latter three & a half.\n\nLatterly I have been putting Bernard\n\nover some jumps which he does well but rushes them too much. He has carried me when riding well over 20 stone I should be sorry to say how many hundred miles without a complaint or crocking up at all\n\nHe has his faults but they are far outweighed by his virtues Oh well sic transit omnia mundi & & anyway I haven’t lost him yet.\n\nI don’t expect I shall get a base job and anyway I am not\n\nparticularly stuck on it, if one has to walk I prefer to do so at the Base on a metal road rather than on a quagmire. It is bad luck after riding for two years to be dismounted after all: but I suppose it is Kismet and anyhow anything I can do or say won’t make any difference so ma’alesh\n","31":"\n\nLast night we had a most amusing time when Lee, a publican’s son told us while we were seated around the fire, of various bush dances he had been to.\n\nThe tales and the outback diction with which he told them kept us convulsed for about half an hour. He went to one dance at the \"Wilkie’s\" where there were two rooms there was no boards just the --- ground for a Floor, and when I gets there\n\nI can ‘ear the --- orchestra but couldn’t see them nowhere so I says to my mate, Paddy Lonigan was \"is name. Paddy I say, where’s the ---- orchestra ----if I know, sey Paddy. So we ‘as a look around & they ‘ad nailed up as few boards on the rafters as there wasn’t no room in the room & the orchestra a violin & a concertina was up in the ----rafters\"\n\nWell the music starts see? And there was the two Wilkie\n\ngirls there, like Butchers blocks they was, short & stocky little tarts, so I grabs one of them\" ---- & so on & so forth.\n\nOn occasions he was rather breathless too for instance \"Ah you blokes dont know; them bush dances is the place to enjoy yerself; Plenty of Tucker, There was a man bit be a snake once\" and here he could it understand our yell of laughter at his \nsudden\n apparent sudden change of topics\n\nHowever he went on to explain that they kept the dance going to shake off the effect of the snake bite & ended plaintively \"you blokes don’t believe me but its the ----- truth\"\n\nHe would mention every one of the characters by name & business as – halfway through one dance the music in the rafters stopped \" So we fetched in the ladder & props it up & Mickey Farren – he used to keep the barbers shop opposite the pub, he crawls up the\n\nladder & finds the orchestra all asleep, they was drunk\" \n\nThis was about midnight \"So paddy Lonigan gets a horse & rides over to Mulvaneys which was 63\/4 miles down the crick & fetches up Frank Power, who was foreman for Mulvaney, to play his violin\"\n\nAfter that topic was exhausted he began to roam all over New South Wales. \"D’ye know Werris Crick, me mother’s brother Charlie Peachey keeps the white\n\nhart hotel there\" etc.\n\nThen down to Riverstone through the meat works where his cousin was the foreman, then ruminatively \"Ah! manys the time Ive been hit with a bit of gut at Riverstone meat works\".\n\nHe kept us amused for about an hour & did not seem to see anything very funny in it himself.\n","32":"\n\nI am now again with the Div Train as before. And this time\n\nI shall very probably remain unless kicked out which is not beyond the bounds of possibility I brought Bernard over with me by bluffing a bit but today to my great sorrow he had to go back to the unit as they are very short of horses & the","33":" bgde is moving tomorrow towards \nHaifa\n Jerusalem\n\nHowever before I left I got a couple of photos taken of him But it is sad to lose him after two years and I had grown absurdly\n\nfond of him. However \"Transitoriness is written upon all; yet you seek or shun, as though they would last for ever. A little while, and you will close your eyes: and anon the dirge will sound for him who bore your bier\"\n","34":" ‘18\n\nLatron \n\nToday we ie. the \"Divisional train started off from one camp on a supposedly 10 days stunt out Jerusalem way. I am very glad as I have not had an opportunity of \n\ncoming out this way; at 12 noon we struck the foothills of the Judaean mountains. We are now in a country of rocky escarpments & giant boulders amongst which grow the most beautiful and varegated wild flowers a great number of English flowers interspersed with others more delicate subtropical species. Altogether this promises to be a most interesting trip.\n\nWe are now camped by the side of the Jaffa-Jerusalem road\n\na white metal road which winds & zigzags amongst the hills in a most fascinating manner. Latron – as this place is called is chiefly known for its very fine monastery set in the midst of trees & terraced gardens offering a most entrancing picture & said to have used by the Turks as their G.H.Qs.\n\nOutside Jerusalem","35":" ‘18\n\nToday starting out along the Jaffa-Jerusalem road from Latron we advanced into a tortured looking country composed of huge hills & deep gullys. On the hills line on line of twisted strata of white Limestone – or what looks like limestone – rock heaved up by some prehistoric earthquake. The hills appear to be composed of solid rock arranged in terraces upon which the natives plant \n\ntheir crops in the scanty soil.\n\nThe road is really an engineering triumph, beautifully evenly instaled & extremely well graded. It winds along like a huge white snake up around the hills & the majority of the way it is walled up on the outside & cut into the hill on the inside; thus enabling the traveller frequently to look down some 5 or 600 feet almost sheer onto the roofs \nof\n & orchards of some villages\n\nin the valley. At about 1pm we reached Kureyat el Enab one of the highest points from which one gets a stupendous view of the plains of Philistea, Rabuleh, the white sandhills & the glittering Mediterranean in the far distance.\n\nAs 5 oclock struck from the clock in the tower above it we reached Jaffa Gate of the ancient Jerusalem having already traversed about a \n\nmile of the modern Jerusalem composed of hotels shops & the more or less European quarter\n\nLeaving the Jaffa Gate on our left and turning S. along the Hebron Road for about","36":" mile we came to this spot to camp\n\nJerusalem is considerably larger than I expected though of course it is necessarily very scattered. It reminds one faintly of Mata with its precipitate streets & abrupt corners. Anyway it is a very\n\npleasant sight after the weary precipitous & rock envisaged journey from Latron.\n","37":"\n\nAfter spending two extremely miserable days out in the open amidst the pouring rain & apparently unfathomable mud we went into billets this morning. I, with my gear & two men were told off to a room, but at lunchtime we were peremptorily told to shift, & no one could give us anywhere else to go So after worrying our Captain for a\n\nbit he told me that if I could find a place, he would help me to get it. So I wandered about for a while and eventually found a room in a house & told him he said \"Hop in\" & so here we are in positively palatial quarters and with an outhouse to work in. I don’t know whether the people in the house are afraid of us or merely anxious to please, but they are absolutely servilely obliging. I expect that when the Adjutant finds out where we are\n\nwe shall be summarily kicked out, but until we are, we shall certainly \"Live up big\" more anon\n","38":"\n\nStill; in our good quarters & I have got most of my gear dry. The people of the house are German, they sing lugubrious hymns & just now are singing \"There is no place like home.\" or at any rate something to that tune. They are most obliging drying our book & clothes & washing up our dishes after\n\neach meal we shall have to tip them handsomely when we leave \n\nYulia, the daughter of the house a strapping bosseyed wench who goes about habitually in clogs & what appears to be a petticoat, cooked up some bullybeef for us for lunch & tea into the most delicious rissoles. Our only common language is arabic so my knowledge of it has come in very useful after all.\n","39":"\n\nBetween Jerusalem & Jericho on the old Jerusalem road.\n\nWe left our good home in the house & came out here towards Jericho a few days ago.\n\nThe country is the same in the main, all hilly with the road winding in & out amongst them, except that the sterile rocks have been replaced with really quite good pasturage. It has all been downhill in fact the whole country slopes down to the valley of the Jordan which lies\n\nI believe 1200 feet below sea level\n\nFrom where we are camped, if one climbs the surrounding hills, \none\n can be seen glimpses of the Dead Sea to the South East & & valley of the Jordan lying far below.\n\nThe mounted troops have done nothing yet as far as I know. I believe that they are waiting for the infantry to take a place from which they can jump off to blow up the Hedjaz railway which is I am told, the main idea of the stunt. Shortly after leaving\n\nJerusalem we came down one stupendous place from the top of which one can see the road five or six times as it zigzags back & forth in its passage down the face of the hill; and I believe there is even a worse place that takes us down onto the valley at Jericho.\n","40":" In the valley of The Jordan\n\nWe are now right down in the Jordan valley about a quarter of a mile outside Jericho we arrived here from our last camp in\n\nthe hills on the","41":"\n\nThe Dead Sea lies about 8 miles to the SE of us. The whole valley is about 15 miles across & slopes gently down to the Jordan on either side.\n\nJericho is, in the vernacular a dirty little hole containing only one building of any size somewhat grandiosely named the Jordan Hotel. Close opposite Jericho in the hills on the Jerusalem side is the Mount of Temptation where J.C. was tempted of the \n\ndevil and fasted 40 days etc There is a monastery on top and another built into the precipitous side of the hill. Probably the scene which inspired the opening chapters in Scotts \"Ivanhoe\". The morning after our arrival we moved out to carry rations to the Divisions & trekked right across the Valley crossing by a pontoon bridge over the Jordan, which is in flood just now & even so not more than 50 yards across\n\nand only 5 feet deep though fairly rapid & very muddy\n\nNot a very inspiring sight in fact had I to wash even once, I should prefer the Town councils supply rather than the Jordan neat. Having delivered the Supplies we returned to our camp here near Jericho this evening &, as a motorcyclist has just come up, I expect we shall be out again tomorrow. \n\n \n\n"}}