{"Document Name":{"0":"Diary_0254","1":"Diary_0254","2":"Diary_0254","3":"Diary_0254","4":"Diary_0254","5":"Diary_0254","6":"Diary_0254","7":"Diary_0254","8":"Diary_0254","9":"Diary_0254","10":"Diary_0254","11":"Diary_0254","12":"Diary_0254","13":"Diary_0254","14":"Diary_0254","15":"Diary_0254","16":"Diary_0254","17":"Diary_0254","18":"Diary_0254","19":"Diary_0254","20":"Diary_0254","21":"Diary_0254","22":"Diary_0254","23":"Diary_0254","24":"Diary_0254","25":"Diary_0254","26":"Diary_0254","27":"Diary_0254","28":"Diary_0254","29":"Diary_0254","30":"Diary_0254","31":"Diary_0254","32":"Diary_0254","33":"Diary_0254","34":"Diary_0254","35":"Diary_0254","36":"Diary_0254","37":"Diary_0254","38":"Diary_0254","39":"Diary_0254","40":"Diary_0254","41":"Diary_0254","42":"Diary_0254","43":"Diary_0254","44":"Diary_0254","45":"Diary_0254","46":"Diary_0254","47":"Diary_0254","48":"Diary_0254","49":"Diary_0254","50":"Diary_0254","51":"Diary_0254","52":"Diary_0254","53":"Diary_0254","54":"Diary_0254","55":"Diary_0254","56":"Diary_0254","57":"Diary_0254","58":"Diary_0254","59":"Diary_0254","60":"Diary_0254","61":"Diary_0254","62":"Diary_0254","63":"Diary_0254","64":"Diary_0254","65":"Diary_0254","66":"Diary_0254","67":"Diary_0254","68":"Diary_0254","69":"Diary_0254","70":"Diary_0254","71":"Diary_0254","72":"Diary_0254","73":"Diary_0254","74":"Diary_0254","75":"Diary_0254","76":"Diary_0254","77":"Diary_0254","78":"Diary_0254","79":"Diary_0254","80":"Diary_0254","81":"Diary_0254","82":"Diary_0254","83":"Diary_0254","84":"Diary_0254","85":"Diary_0254","86":"Diary_0254","87":"Diary_0254","88":"Diary_0254","89":"Diary_0254","90":"Diary_0254","91":"Diary_0254","92":"Diary_0254","93":"Diary_0254","94":"Diary_0254","95":"Diary_0254","96":"Diary_0254","97":"Diary_0254","98":"Diary_0254","99":"Diary_0254","100":"Diary_0254","101":"Diary_0254","102":"Diary_0254","103":"Diary_0254","104":"Diary_0254","105":"Diary_0254","106":"Diary_0254","107":"Diary_0254","108":"Diary_0254","109":"Diary_0254","110":"Diary_0254","111":"Diary_0254","112":"Diary_0254","113":"Diary_0254","114":"Diary_0254","115":"Diary_0254","116":"Diary_0254","117":"Diary_0254","118":"Diary_0254","119":"Diary_0254","120":"Diary_0254","121":"Diary_0254","122":"Diary_0254","123":"Diary_0254","124":"Diary_0254","125":"Diary_0254","126":"Diary_0254","127":"Diary_0254","128":"Diary_0254","129":"Diary_0254","130":"Diary_0254","131":"Diary_0254","132":"Diary_0254","133":"Diary_0254","134":"Diary_0254","135":"Diary_0254","136":"Diary_0254","137":"Diary_0254","138":"Diary_0254","139":"Diary_0254","140":"Diary_0254","141":"Diary_0254","142":"Diary_0254","143":"Diary_0254","144":"Diary_0254","145":"Diary_0254","146":"Diary_0254","147":"Diary_0254","148":"Diary_0254"},"Date":{"0":"unknown","1":1852.0,"2":1853.0,"3":1854.0,"4":1855.0,"5":1856.0,"6":1857.0,"7":1858.0,"8":1859.0,"9":1860.0,"10":1861.0,"11":1862.0,"12":1863.0,"13":1864.0,"14":1865.0,"15":1866.0,"16":1867.0,"17":1868.0,"18":1869.0,"19":1870.0,"20":1871.0,"21":1872.0,"22":1873.0,"23":1874.0,"24":1875.0,"25":1876.0,"26":1877.0,"27":1878.0,"28":1879.0,"29":1880.0,"30":1881.0,"31":1882.0,"32":1883.0,"33":1884.0,"34":1885.0,"35":1886.0,"36":1887.0,"37":1888.0,"38":1889.0,"39":1890.0,"40":1891.0,"41":1892.0,"42":1893.0,"43":1894.0,"44":1895.0,"45":1896.0,"46":1897.0,"47":1898.0,"48":1899.0,"49":1900.0,"50":1901.0,"51":1902.0,"52":1903.0,"53":1904.0,"54":1905.0,"55":1906.0,"56":1907.0,"57":1908.0,"58":1909.0,"59":1910.0,"60":1911.0,"61":1912.0,"62":1913.0,"63":1914.0,"64":1915.0,"65":1916.0,"66":1917.0,"67":1918.0,"68":1919.0,"69":1923.0,"70":1924.0,"71":1925.0,"72":1926.0,"73":1927.0,"74":1928.0,"75":1929.0,"76":1930.0,"77":1931.0,"78":1932.0,"79":1933.0,"80":1934.0,"81":1935.0,"82":1936.0,"83":1937.0,"84":1938.0,"85":1940.0,"86":1941.0,"87":1942.0,"88":1943.0,"89":1944.0,"90":1945.0,"91":1946.0,"92":1947.0,"93":1948.0,"94":1949.0,"95":1950.0,"96":1951.0,"97":1953.0,"98":1954.0,"99":1955.0,"100":1956.0,"101":1957.0,"102":1958.0,"103":1959.0,"104":1960.0,"105":1961.0,"106":1962.0,"107":1963.0,"108":1964.0,"109":1965.0,"110":1966.0,"111":1967.0,"112":1968.0,"113":1969.0,"114":1970.0,"115":1971.0,"116":1972.0,"117":1973.0,"118":1974.0,"119":1975.0,"120":1976.0,"121":1977.0,"122":1978.0,"123":1979.0,"124":1980.0,"125":1981.0,"126":1982.0,"127":1984.0,"128":1985.0,"129":1986.0,"130":1987.0,"131":1988.0,"132":1989.0,"133":1990.0,"134":1991.0,"135":1992.0,"136":1993.0,"137":1994.0,"138":1995.0,"139":1996.0,"140":1997.0,"141":1998.0,"142":1999.0,"143":2000.0,"144":2003.0,"145":2004.0,"146":2005.0,"147":2006.0,"148":2007.0},"Entry":{"0":"\n\n","1":" 24.1918\n\nFor travels on this day the last diary will give full details. Sufficient it is to say that I returned to night in a car with Major Blake from Salisbury to Codford St Mary\n","2":"\n\nChristmas day & the most miserable I have ever passed. I started the day with disappointment & melancholy followed in its steps! \n\nTo day the Countess of Harrowby was giving a dance & party & I did so much wish to see how an Englishman of the better class spent his Xmas Day & to see with what traditions he had surrounded it this one day. Though last night the Major was agreable to day the adjutant refused to hear of leave as orders had been issued forbidding Officers to travel on the trains on that day. \n\nSo the day commenced filled with regrets for what might have been & the wish of seeing an Englishman of the better type celebrate this festival on his own hearth was lost. \n\nAt dinner all officers were present to see the\n\n2\n\nmen & on return to quarters I found several actresses more or less on the way to intoxication who greeted all & sundry with maudlin mirth. Such was very different to my tastes this day & only excited a feeling of disgust. \n\nAt dinner I was the only silent officer who refused to take part in the hilarity. Everyone had bon bons which gave either trumpets or caps & paper hats. Champagne was supplied & catering arrangement under Richards 31st Bn excellent. Richards address is Tattersalls Club Adelaide.\n\nAfter dinner I retire to my room & with memories of whose case is still proceeding in the papers long for the drugs that bring forgetfulness. Strange it is years since this thought crossed my mind & that it should recur on the happiest day of the Church year. Then I went for a long walk among undulating hills & half closed in valleys which destitute of bush or life well accorded with my gloomy thoughts & when on the way back I was lost the unison was complete. \n\nOne incident will always stand out & that was the “drowsy tinkling of a distant field\". The sheep there are enclosed in little portable\n\nfences & the accumulation of sheep meant a massing of the little different note bells which are suspended from their neck & tinkle as they browse.\n\nAfter dinner Pearce Hook came into my room & we adjourned to bar & made merry for the night. Moore came along afterwards & forgot he was in anothers mess. To night we each got a parcel from the Comfort Fund ctg cheese, lemon butter, cocoa cigarettes & butter scotch. Thus passed Christmas Day 1918\n","3":"\n\nThis morning enjoyed luxury of staying in bed till nearly noon \n\nAs I am piquet officer for the night I am unable to accompany some of the chaps to Salisbury fortunately for me as they got into a grand row with a taxi driver. \n\nOn piquet there is no where I can stay & I yarn with a police man who finally introduces me to a Belgian refugee Malleanna soon to leave for Rue de Voltaire Paris & I have have an interesting yarn with her in French promising to return to morrow night if\n\n4\n\ntime permits as I am going to London to bring a leave party back. There is nothing to do. You catch the same train as party & get out at your destination & go home. It means a pleasant little trip at Government expense though it involves a lot of travelling\n","4":"\n\nRose 5 am as uncertain what hour train will move but a party moves off at 6 am. Train arrives 10 am Waterloo. Report to RTO & meet Clarke who gives me photos of lodge. \n\nI then visit Countess of Harrowby to thank her for my trip to Northumberland. Here I meet Digby who has been out in Mespot & is now in a London Hospital drawing 2 pays until a ship sails for Australia \n\nWe dine at Au Peut Riche & I give a book to Elise Drumont 15 Stacey St London Then with Digby visit Kennedy & say good bye – then to Alcocks but office is closed – to Ballie Tea Rooms St Marys Axe then I leave Digby as I have promised Lady Gore to take tea with her. \n\nHere I met Miss Muriel Seymour of 34\n\nMontpelier Square London S.W. a very fascinating though not pretty girl whom I interested very much by much conversation & who much regrets my departure for a dance which Lady Baker Wilbraham of 34 Lancaster Gate has invited me has invited dancing commence at 6 & my train goes at 7 so I have just one dance make my apologies & catch train to Codford on the mud as it is commonly called. \n\nMeet the Belge who is quite joyful as she has received her passports & leaves for Paris on Monday. Reach home about midnight having travelled since 5 am this morning & then commence to pack as my goods must be ready by 8-30 am tomorrow for France\n\n28 December 1918\n\nIt is not yet certain whether I am to go or to remain for the trial of the orderly who stole so much of my kit & service revolver – & from which I recovered nothing. My goods were sent on & at last minute when others were about to start I received orders to sail but had to get my service issue first ie steel\n\n6\n\nHelmet, codene, leather jacket & gas mask or box respirator. I have not time to collect respirator & sail without it. Train leaves 10.30 am & we take taxi leaving Codford St Marys & St Peter in grand style\n\nThe journey to Southampton is uneventful & countryside I have described before except that now owing to the rains the low lying land is a bog & the streams are slightly larger. The whole land still retains that verdant green.\n\nWe arrive at Southhampton at about 1 pm. – report to Officer & then acting on his advice dine although our movement order stated that it was impossible to get any food on the way. We dined at Princes Restaurant & then marched up & town the town. There is little to see save the old gate through which the trams pass & which congests the crowds through the other two arches. \n\nWe enter Savoy Café a lively place hung with flags. The number of people in the streets is enormous & they seem to have little to do as one meets the same faces over & over again. The results of the elections are due to night & perhaps this accounts for the crowd.\n\nI & an Eng officer dine at the\n\nDolphin Hotel & we report back & go on board our ship “\" a Yankee boat about 50 ft out of water & drawing 15 ft. built for coastal trade & unable to face heavy weather \n\nThe whole superstructure has been strutted to save her falling to pieces on the way across & some passages are impassable owing to struts & in all the top cabins a beam prevents the door being closed. All water & basins have been taken out of cabins owing to their ill use by officers. One & only latrine we can find open has 3 ins of water on floor & is still rising. Soon some one may be interested enough to stop it but at present none of the Yankees seem to care. Blankets are on issue but no one can find that particular officer & the crew are not obliging & will not look for any one for you. The Yank with an eye to business retails coffee & a slice of bread for 1\/- to us. \n\nWe move off about 7 pm but wait down off the Admiralty as we must enter Havre on the high water. I meet two french hospital men & we yarn till late into the night till I turn in. The sea comes up rough & the tub does some pretty\n","5":"\n\nantics but the only thing which worries me is the banging of the door, none of which one can keep fastened owing to the rolling. However I jam it with paper & sleep on.\n","6":"\n\nThis morning at 7 am we entered in France – the land that for over 4 years has been the scence of turmoil & carnage, of stress & patriotism. All seems peaceful here & save for the uniforms & while the activity is such as one would meet in any large seaport town. \n\nWe go ashore like a gang of school girls frightened to lose each other. My importance has increased as I alone can speak French. I have Badeker with me & the names of the streets & restaurants & know where I am going. \n\nWe pass a YMCA hostel & all decide to enter. This was originally the Hotel D’Angleterre but has been taken over by the YMCA as an officers rest house. It is thronged with Americans who seem to be in every little hamlet of this country. After this meal we report & are told to be in camp by 11 am As this is impossible I do not attempt to reach there but spend some hours in Havre with Davies\n\nThe whole life of the town\n\ncentres in one street the Rue de Paris Tortonis the popular café is a great hotel like building with a little square in front of it. The park in front of the imposing Hotel de Ville is simple but forms a pleasant oasis among the buildings & a happy ending to the many streets that converge here.\n\nI visited the old church & thence on to Quay. Plans of the city are in Badeker so I will not repeat. Took tram for Harfleur & then had ½ hour walk to reach No 12 camp only to find this was not our real home but that the AIBD is some miles further on & through mud we flounder til we reach our destination. \n\nWe have an officer returning to duty with us & the camp has contracted since his departure. There are now only two camps one for convalescent & the other is the base. Here we are well received & alloted to little canvas cubicules strange that after 4 yrs the Base should not have some more permanent form of abode. \n\nAfter a short address at 2 pm we were free to go on leave & not knowing how long I shall be here I take full advantage of the leave & with Davies proceed to Havre \n\nThe exit from camp is different to that by which we approached & is between two rows of very high poplar trees which fringe each side of the road which\n\nThe girl conductress on the tram have a running fire of wit & badinage which keeps everyone in good humour & offends no one. On return to camp slept on the floor.\n","7":"\n\nThis morning we have to go through a gas test with our respirators & walk nearly 1 ½ miles to reach the place. The road winds through a picturesque wood up a hill through some old monastery & along to a tear gas shed & then along to chlorine cave & whence we can obtain a splendid view of St Addresse where once stood a Casino now a hospital.\n\nIn the afternoon so that I do not waste any time I go down to one of the quaintest little towns I have seen. In the centre is a large square & on its edge a church now time & weatherworn but still maintaining its grandeur & sanctity which ages have not been able to mar. In the centre of the square is an old village fountain from which every woman draws her water & from an adjoining trough horses are watered. \n\nVisit M. Hoche Rue Cadot but no one at home & return to camp but return to in the\n\n12\n\nevening & then walk back. The French villa is a square edifice ugly but well placed back from the road & seems like a box in a paddock ie in this part. On arrival in camp receive orders to leave for battalion to morrow.\n","8":"\n\nUnable to leave camp as we are under orders. During morning draft is cancelled & then is changed to a stand by & finally we report 7 pm to Camp Adjutant No 12 camp – get into motor lorries & whizz off to station Gare des Maritimes & find the train a collection of goods wagons with one","9":" class carriage & 1 first class with the windows broken. \n\nI find myself in a","10":" The","11":" class here either are a long carriage with wooden seats & backs or else these backs are continued for 5 ft & thus make some little privacy. However sleep save from exhaustion is impossible The soldiers are happier because they can stretch their limbs at full length & have a brazier whilst officers must perish as compartment is too small for a brazier\n\nHappily we finish the journey in 2 days & 2 nights. Formerly the same journey took about 10 days. We started at 7 pm & in the morning found ourselves at Amiens having passed Rouen during \n\nthe night. Rumour had it that we disembarked at Rouen & stayed there a few day but onward ever onward is the motto of our train & after a stay of about 2 hours we move forward.\n","12":"\n\nHaving spent all night in the train we all feel happy that a new year has dawned but wish we were still in our billets in Le Havre. We had all remained awake to see the New Year in \n\nThis day is very interesting for we pass through the battle area & Somme passing Pozieres, Roisel, St Quentin, Peronne, Most of these places are a collection of ruined houses though in some the inhabitants are returning though the buildings are clearly unsafe. Most of these towns will be easier rebuilt by putting the new town in another place as the towns are now only rubbish heaps which must be cleared away first. \n\nAs we approach the battle area we find dug outs in railway cuttings & then isolated shell craters & then ring upon ring of barbed wire entanglements. In fact a barb wire entanglement then open level spaces & trenches interpolated constitute the general aspect of this battle area. Occassionally one sees a mound of earth with a cross on which\n","13":"\n\nis placed a steel helmet which alone tells of some forgotten act of heroism or sacrifice. \n\nCemeteries we pass none. All seems peaceful & deserted on these fields which but lately teemed with armies & \nheard the\n resounded shriek of shell & cries of dying men. So pass away man & his little works to get place in the silent majesty of the Great Architect & his works. Thus they pass these men children of the sword & in their place the grass grows green the greener where the blood has run thickest – the ruined village alone remaining as silent testimony to mans destructive power – & in a few years even these will have passed away. \n\nAlready in Belgium one can see the peasants cutting up the wire entanglements & putting them in little heaps so that the land may once more come under the share. \n\nThat night we arrive at Souslesne or some name like it (Solesmes) We arrive here at 7.30 pm & do not move till 10.30 when we go on till 1.30 & stand still for the rest of the night. Finding during the day that there was a compartment in which there were only 2 officers one of whom was Hatton I transfer here for the night but find that the backs of the seats are not raised as in my own carriage & that a few broken\n\nwindows do not add to the warmth of the carriage. However I get some little sleep.\n","14":" – January 1919\n\n(list of stations passed see","15":" \n\nRibecourt; Marcoing, Noyelles, Cambrai, St Vaast, Solesmes, Le Quesnoy, Valenciennes, Jemappe, Mons, Thielt, Strepy, La Louviere, Managy, Luttre, Gosselies, Jumet, Le Roux, Charleroi) \n\nAt daylight find the train at a standstill & on making a tour find that we have arrived at Mons. I shave with water drawn from the engine & with another officer wander into the town for something to eat or drink. \n\nI ask a man where we can obtain some eggs & he tells me that the Germans have taken all their fowls & live stock & that eggs are unprocurable while bread is at exorbitant rates. I asked him if one could get a cup of coffee at a café whose sign I saw down the street. He said yes but insisted on coming into his house & introduced us to his wife. While she was getting the café he gave us 2 glasses of cognac which put some warmth into us. \n\nThe Belgian with recent memories of German oppression cannot do enough for their liberators. This was not an isolated case of hospitality but only one of many recurring cases. \n\nWe return to train which has already started but only goes as far as station a few hundred yards & rests for another 1 hour during which I pay a visit to\n\n16\n\nthe railway station. Like all stations here the platform is only about 1 ft above the rails & the passengers must needs climb up into the carriage. The number of rails here is enormous, but all the passenger lines pass through an enormous shed with glass ends which constitutes the station. \n\nAbout 9 am the train moves on having been travelling 200 yds. \n\nOur destination is still unknown – no one has been told where we are going though now it seems certain that Charleroi is our destination as some members of train are going there. \n\nUltimately the train arrives there about 4 pm & we report to Corp HQ. Here the procedure is most casual no ones seems to care whether we sleep here for ever or go for a holiday. We go for a walk down the town to reach which we must cross the Canal. The pic give a good description of the town. I am forwarding about 36. \n\nOne passes up the main street into a grand square in which is situated Café Central the popular resort of officers – from a corner of this square a street leads across the river & up the hill to the upper part of the town in which is another square though it is not surrounded by such life or buildings as in the lower part of the town yet it contains the principal church which I took to be the\n\nTown Hall & the gendarmerie. I go there & get a billet for night in Hotel de l’Esperance which costs me nothing. I do not relish sleeping in a rough military blanket on the floor when a comfortable bed between sheets is to be had for the asking. \n\nHowever not liking the look of the hotel & hearing that if I went to any large house & asked for accomodation I could receive it so I walked down the Boulevard near the river & when I had selected the biggest house I went in & asked for owner noting on my way that the word “notaire\" appeared on the plate. Monsieur was not in but Madame told me I could speak before her as before her husband. I explained what I had heard & she immediately showed me a room or rather the maid did. I told her I would be back about 9 & left. \n\nIn the town I met an English officer & together we went to Café Central which consists of one large room with a balcony running round the top. On ground floor dancing takes place & partners are anyone you like. The orchestra renders good music & in intervals there is two or more paid singers who sing & then make a collection on their own behalf. The scene is lively but the mirth is forced a little it seems to me & has not the spontaneousness one finds in a Parisian café perhaps this is due to the English element or to the proximity\n\n18\n\nof Germany & Lenton blood. \n\nLeaving this we wander in the street which is full of people. I speak to every pretty girl I can find on some pretext or another & if I stayed there several days I should be extremely comfortable. Among others I met a widow whose friendship I gain unwittingly by my defence of her in English which it turns out she can understand perfectly.\n\nAmong others I met one Yvonne from 407 Rue de Beaumont Marcionelles with whom I take a walk through the town. There visit the EFC Club just opened & not quite settled down at present. Though it is the cheapest & best place for a meal 4 fr. Then tired out I slip along to his hotel & then after looking at two girls who move up & down the street escorted by a man who walks a few places in front & are probably female detectives I adjourn to my notaires place to find him waiting. \n\nHe greets me in \ncordial\n courtly fashion & ask how I came to select his house. I tell him that I am of the devils brigade like himself We adjourn to fireside & I am introduced to the bosom of the family.\n\n3 January 1919\n\nThis morning I have decided to run up to Bruxelles if I can obtain Coghills permission. Eade & Betts both tell me I am a fool to risk being AWL but subsequently use my idea themselves leaving me in\n\nthe lurch by not saying I am going & allowing me by their silence to be detailed to remain with a party \n\nHowever at this moment I am quite unconscious of the fact & go forth & visit for 1 fr the Music Anatomique a collection of wax figures & pictures illustrating VD in all its hideousness. I used my French to explain to a party of diggers the import of the explanation especially in a fictitious development of the embryo\n\nThen went on to Musée Archaelogique but it closed at 11.30 am & as it was now 11.20 am it had taken time by the forelock & entry was impossible. I then met two girls & asked my way to the university. They were going to Mons in a car & offered me a trip. The ability to speak French does wonders for a man here. \n\nI visit the university to which is attached a Technical school but do not go through the building minutely as it has recently been a German hospital & there are numerous officers still in occupation there. I then return to café Cristal & Café La Rose near canal. \n\nOn going back to Corp HQ I find myself detailed to remain & try to get out of it but find it impossible unless I can find another officer. This is impossible as they had all left. However I waste the whole afternoon at Café Central Club & in the streets looking for another officer but in\n\n20\n\nvain.\n\nWhile at Corps I am told that my pay book has been discovered though I was unaware of its loss. I go to Railway & obtain it & then go to Paymaster to get some cash but find that it is mutilated & the most important pages torn out & that I can obtain no money. This is unfortunate as I had decided to let the duty slide & visit Bruxelles & any other large town that came my way. However the PM promises me an advance if I can get an identification from Corp. \n\nI go to night to Café Central & met Man whom I last saw at Liverpool in the 4th Bn. He introduces me to two of his friends both Gaby one of whom is french & the other Belgian. When Café is closed I go to supper in a little café & met one of the Gabys I dine with a of 2nd Div. & then wander about street & put up in a private hotel\n\n4–1–1919\n\nAs I had seen adjutant & been officially relieved of my command I take my time to day for my trip to Bruxelles with or without pay is decided on. I shave & wash in my rooms at the annexe of L’Hotel de l’Europe & visit Paymaster who generously advances me 200 f (£7.13.4) just on my word that I have cash\n\nin my book. This is quite unusual for Pay Corp but I suppose my face marks me as honest. \n\nI breakfast at Camp where it costs 1 fr. per meal & in town 5\/10 fr. & set out to visit Musée Archaelogique in company with an Eng army doctor whom I picked up on my ramble. The Musée is disappointing inasmuch the articles are not described though the relics from a neighbouring Roman villa are very interesting. \n\nAt 2 pm I go to catch train. It is full but at a platform near by there is another train going at 2.35 pm direct without changing so I get on this train Both trains are without their engines 2.30 pm 3 pm 3.30 pm no engines. Ask guard which train the 2 or 2.30 will start first & he replies whichever engine arrives first perhaps the 2.35 pm train\n\nMeanwhile in the yard several engines are shunting & coupling up until a train composed of 8 engines is formed & they sail up and down yard. At least about 4.45 our engine arrives & we set out after the 2 pm train. We pass nr Ludr where the Germans masses their rolling stock & set fire to it during their retreat lest the stock should fall into our hands. Houses ¼ mile away have been shattered by the force of the explosions which the track has been torn up as if mined or\n\n22\n\nbombed. \n\nThe 2 pm train which has a staff of 5 officials on engines gets as far as Bonlieu & all its passengers transfer to our train. In the carriage I occupy there were 3 Railwaymen & they are like monkeys. They find some netting in the carriage & they tear it all down. Still they are courteous to me & finding a warmer carriage invite me to accompany them & to share their food They were very rough but hospital to a stranger nevertheless.\n\nAfter Bonlieu the carriage is full beyond even standing capacity but this worries no one & eventually I reach Bruxelles at 6 pm. Re my luggage – there is some dispute but as I am a soldier it passes off I then look for RTO but cannot find one only a Belgian Colonel who directs me to Café deil’Ete’ near for all information.\n\nOn arrival I find that this is released prisoners depot in charge of a Scottish officer. He outlines a plan of tour for me & the best way of spending evening. Apparently I can still get in at the Opera & I go without dinner or lodging. Opera is too good to miss. On way I get my hair brushed which costs me f50 & buy a little piece of bath brick alleged to be soap for 3 fr. \n\nOn arrival at Opera where one play La Tosca there is standing room only for 9 fr but two English officers inform me that\n\nit is worth the price to see the theatre & indeed it is. The tiers rise one over the over one mass of burnished gold. Five in number & shallow only accomodating 2 rooms. The whole is aglow with gold & illumed by a grand chandelier in the centre while the whole roofed is frescoed & panels painted wherever possible Cast was\n\nMario Cavaradossi – MM Fanseau\n\nLe Baron Scarpia – H Albers\n\nLe Sacrusian – L Van Obbeigh\n\nCesare Angelotti – Lehantraine\n\nSpoletta – Radoux\n\nSciarrone – Coutelia\n\nFloria Tosca – Mde Edvina\n\nUn Patre – Prick\n\nMde Edvina a very pretty woman, d’une elegance exquise, est une artiste de grand autorite, et son talent, qui est remarquables son art au chant qui est la perfection meme, sa voix dramatique a une belles qualite, tres etendues, firent tres grande impression. Albers acting was really good The conductor was M. Cornell de Lhoran. \n\nWhen Theatre was out about 11 pm I met an Australian officer who insisted we should dine & so at 11 pm we commenced our meal. This is not late as city is only just coming to life & all the night is still before it. We did not eat much 3 courses & yet it cost 43 fr. Food is very dear here & the Princes Restaurant\n\n24\n\nnot an extravagant place. \n\nAfter dinner I go to Merry Grill a cafe full of life & jollity. Here dancing, singing, love making, drinking & gaiety unrestrained gladden the heart of this weary soldier Everyone is so natural that gaiety infects even my sluggish English blood There is no forced laughter or idiotic & clumsy attempts to appear gay. They are naturally gay & enjoying themselves because they are expressing their feelings & not because pleasure is a duty.\n\nI am quite at home in this atmosphere & enjoy myself immensely. One pretty little Dutch girl Lessy Bongen Rue de Brabant 216 contributing much to my pleasure because I am Australian. \n\nDuring the night I wander round in Madrid Cafe in Rue Pont Neuf & Queen Victoria in 40 Galerie de Commerce (Rue Heuve) La Gaiete & Bruxelles Remesse but return to Merry Grill which I leave at 2.45 am though the crowd is still there. Among the crowd are two French aviators & excellent fellows they are. The night has been one of the pleasantest I have passed & though I had no money I \nsaw\n had a lot of fun.\n","16":"\n\nI sleep till 9 am this morning & then set off to Railway to collect my razor & hair brushes. However the station is\n\nclosed & military guard put on so I wander around unshaven till about 3 pm. \n\nTrams here are free & the whole city is encircled by boulevards. By taking certain trams & changing at certain places the complete circuit can be made The Belgian who tells me this goes out of his way to put me on the tram. They are so grateful to be free of the German occupation that nothing is too much trouble for them. The tram pass all the sights Palace, musée, etc (see pic). \n\nI return & get out & visit Palais de Justice the largest building in Europe & who immense proportions stagger the imagination & leave one spell bound & awestrucken. Entrance is forbidden as this is Sunday but I open a door & sail in, find someone & explain my wish & the shortness of my stay & a guide & a Belgian law student show me over. The Place des Pas Perdus under the dome & the vast staircase still more bewilder one with their vastness. The only word I could use to express to my friends was that it was “immense\" \n\nI then take tram to Bois de Cambre a pretty wooded parc with a large lake & wooded isle in the midst on which island is build a rustic village hidden by trees & shrubs. A restaurant with iced drinks exists in the centre though never closed\n\n26\n\na beautiful poplar walk 6 yds wide with tall graceful trees about every 3 yds is truly wonderful while the valleys that cross the wood have been accentuated & the numerous which bubble along add rustic picturesqueness to a woodland scene of unrivalled beauty. Every where bridges have been constructed the handrails are made of concrete in imitation of tree limbs & thus do no jar on ones asthetic perceptions. \n\nFrom the Bois I return to Colonne du Congres a monument guarded by two ?4 lions & surmounted by a stature of Leopold 1 raised to commemorate the formation of the kingdom. It has a balcony round the top which is reached by climbing 185 steps through inky blackness but is worth the trouble as the view from the top is worth the effort. Leaving here I find my way to the Grand Place perhaps the finest in Europe ie surrounded by the finest & most historical buildings (see pic)\n\nThe Hotel de Ville takes ones breath away & before one can appreciate its graceful beauty the Maison du Roi completes the mystification of the intellect. Thence I visit the Church of St Cadulle where a funeral is in progress. The interior of church is as magnificent as the exterior & that is sufficient to say. \n\nThen I visit a lace manufacturing place but disappoint the proprietor as I do not buy any having no cash. Thence I go to Place Royale\n\nso called because there is a stature of the first King of Jerusalem who happened to be one of the Dukes of Brabant. \n\nThence I catch the tram for Le park & \ncolonnade\n arcade de \nQuis\n Cinquantenaire – a colossal edifice erected to commemorate the 50 years of Belgian inaugeration as a nation. It is used as an exhibition building but now as a park for ASC. The view over park & up the Boulevard is a glorious setting to this magnificent monument of inspired commemoration. \n\n.\n\nThe lofty arcade & arch are on the same immense proportions which seem to characterise this part of the world.\n\nI the take the tram to Tervueren & it is the most glorious trip I have ever taken. Away for nearly an hour we pass by parks with rippling streams & cascades & then dive through a grand forest miles in extent whose severed aspect & stems without a branch are of a natural beauty unknown in our part of the world.\n\nAt Tervueren there is a colonial museum much patronised by visiting colonial officers & well worth the trouble of an inspection. I then return to city & running short of funds dine at a cheap cafe but it cost 9 fr for a fish & a glass of beer. Food is very scarce here & prices are out of all proportion to the ordinary. I have had a\n\n28\n\nbig day & am sleepy so go along to Hotel St Jean & find a big room with two double beds & turn in.\n\n6 January 1919\n\nTrain has left as 6-20 this morning & as I arrive at 8 am I do not catch it. There is some trouble with the ticket & it costs me 12 fr. to go as far as Tille for I will not pay fare right through. As Antwerp is near a trip fills in the morning but there is nothing to say about it except that it is a big commercial city intersected by canals & block with punts & shipping. \n\nOn return visit museum of old arms & cannons at Port de Hal one of the old gates of the ancient city of Bruxelles. From here you catch a blue tram to the field of (V) Waterloo which does not repay the time (1 hr) spent in reaching it. The pc gives all that is to be seen. \n\nOn return I take tram to Grimberghen as far as the other side of the city as Tervueren is on south? passing on the way the Royal Park with a grand tower monument & old time plain looking building once a palace, then past Japanese Tower erected as a monument & also a chinese palace.\n\nReturning to city I must look around for dinner & find a friend in need who takes me to several places & finally I dine very well in a little restaurant\n\nunknown to the ordinary world. Here between the hours of 12 & 2 one can dine on 4 frs & get 1 potage & 2 plats meats vegetable & potatoes, cheese. Here beefsteak costs 5 fr & cold meat 2 slices 2 f50 After the meal I walk into a shop & purchase a scent bottle & some pc & yarn till nearly 11 pm\n\nThen I seek an hotel de bon Esperance but there is no hope for me as it is full – However porter knows of another place near by & as close to station as this. I leave by 6.20 am train & do not wish to go up town Here at 64 I find a room 5 fr. & proprietor tells me that 50 centimes is enough for girl who calls me in the morning. Bed is very comfy & room is large as good as any London hotel\n\n7-1-1919\n\n(Amiens, Villers Bretonneux, Bayonvillers, Wiencourt, Rosieres, Lihons, Chaulnes, Fresnes, , Le Mesnil, Peronne, , Courvilles Roisel, Crepy, Gonnelieu, Ribecourt)\n\nThis morning I am called at 5 am & have coffee before leaving ask for a little bread & make a good breakfast for I do not know where I shall get the next. The girl enquires if she shall give me any for the train & I say yes. I do not eat this until 3 days after & then it is all that I have for the day & in my heart I blessed that girl a dozen times over. \n\nAboard the train with my luggage which costs me 1 fr every time anyone touches it. I find a first class carriage & settle down in it. We move off punctually & passed several places more or less destroyed by the Huns or by our airmen. one seems to \n\n \n\npass Hal Enghien, Leuze Lowndi Lille\n\n30\n\nhave had a particularly bad time. All the bridges across the line have been blown up by the Huns & are being rebuilt temporarily by British Railway Units.\n\nOn train meet a Masonic friend alongside of me & am set as expression goes. I arrive at Lille but according to my friend the only railway station in Lille is out of use & this station Gare de Porte D’Arras is where we get out. I have some doubts but as there is an RTO get out. Time is now 2 pm & this train the Bruxelles Paris Express has for the bigger part of journey travelled at about 5 KM per hour. RTO I must travel on to Abbeville by reinforcement day which left ½ hr ap. This gives me a day in Lille so I am satisfied. \n\nLill is a large straggling commercial town but half an hours walk will show you the best part of it Walking from station you meet the Port D’Arras an ancient gateway still intact. Then street leads up to a church round both sides of which the street continues its courses forming a little island of the church Road leads into Place de la Revolution with the Praefecture at one end & the Palais des Beaux Arts on other side which has been stripped of all its contents by the retreating Huns.\n\nThese two imposing building set off the square. Passing thence past a statue to Faidherbe I enter the Grand Place not nearly so large as last square but more the heart\n\nof the city. Here are situated all the Cafes & just off it the Hotel Moderne (where a room for night costs 25f) Bouise, Theatre Taverne Royale (now an EFC Officers Club) are all situated. The main thorofares are all thronged & in the square one finds little crowds assembled & finds singers selling the songs & at intervals singing them & teaching them to the crowd. \n\nFall in with an English officer & with 3 girls with whom we go as far as a cafe & then leave them The proprietor of an adjoining cafe wants 25 fr for bottle of Red Medoc wine.\n\nI return to Club & dine not having had any luncheon for the day Here I met 2 Canadians & have sundry whiskies After dinner meet a Scotch officer & set off for a Cafe Moderne where one can laugh & play & dance. However this place is closed we wander off to (*) Rue de la Bassee where I part company from my friends. I continue to wander round town but cannot get a room though there are plenty in the town because the cafes & hotels have been closed to soldier at 9 pm by APM. \n\nAt Hotel de la Place I met two other Canadian Officer Major McDonald & hearing of my plight they say they will not see me stranded & hunt round with me & then put me in their car after a visit to Cafe\n\n(*)L’entente Cordiale 7 Rue de la Vieille Comedie near Grand Place 5 o’clock Officers, Pianola, \n\n32\n\nModerne upstairs & I am whizzed off to their camp at Le Sart, but which they call Brencq. Here the major produces a bottle & cigars & gives me the palliasse off his bed & unlimited number of overcoats I doss quite comfortably for the night\n\n8 January 1919\n\nThis morning I only wake at 9 am & decide to miss the train at 10.30 & so have breakfast in bed & then have a warm bath with which this private house is fitted, shave & set out for Lille. I had hardly gone very far when the Major overtook me in his car & I got a lift into Lille.\n\nOn way in we pass an anchored balloon round which 5 aeroplanes are circling & passed some Algerian troops leading spare horses. Also some french cavalry with spare horses. Their seats are not good & they ride badly. \n\nI then take tram for Roubaix. Each section costs 5 centimes. The tram ticket is marked on top with the hours & on bottom with days of week (letters only). We pass du Romarin, St Mur, Le Buisson (it is not visible) Croise Laroche, Wasquehal, Le Sart, Velodrome, Pere Barbieux, Roubaix where I get out. Nearby is Tourcoing, Leers & Hem but so far the tram has not commenced to run to these localities\n\nfor the city has not long been liberated & every overhead bridge is in ruins across the track. \n\nRoubaix is more a residential resort from Lille It has narrow streets & 2 squares in one of which is found the Town Hall & the old Church marked like most churches here with the words Liberté Fraternité Egalité, so marked same way as said because these things no longer exist in France & the church is a fitting sepulchure for \nthem\n past ideas.\n\nI return to Lille after passing through Park at Roubaix. In Lille I try to cash a cheque but as it is Australian Bank they refuse. British Paymaster cannot give me money because I am Australian & so I must carry on with what I have. In afternoon I spend at Club with diary notes & dine there in evening for 4fr. Bed costs 2 fr. I go for walk round city after dinner & then turn in.\n","17":"\n\nOn rising this morning find I have lost my cigarette case & thinking it might be at Brencq I set out for it having just enough time to reach there & catch train. Unfortunately the case is not there & it takes me all my time to reach Railway by 10.30. \n\nHowever I need not have hurried as train does not arrive till 12 & is then shunted into a\n\n34\n\nsiding to allow a passenger express with dining saloon & wine on tables filled with civilians to pass through. Peace is not yet signed & yet civilians are taking not equal rights with soldiers but the preference. \n\nAt 3.45 our train moves out & at 8 pm has done 18 KM & anchors for the next 6 hours outside the La Bassee Canal. Night is clear & cold but as I have blankets in my valise I am quite comfy. All this day I have had nothing to eat when I bethink me of the bread & butter I got in Brussels & a pot of cheddar cheese in my valise & this constitutes all the meals I have this day.\n\nI have an ASC officer with me but otherwise the carriage a 1st class is to ourselves & we can stretch out\n","18":"\n\nTrain is alternately crawling & halting & at Calonne Ricquart. When all my friends leave me to catch fast train for which we have been side tracked. Having my valise I remain as it is too much trouble to move it. This day there is nothing to eat & though train often halts 3 to 4 hours yet she may go at any minute & it is not safe to move away from train. \n\nWe pass through Bethune & thence on to St Pol. Here I find some Aust. soldiers in train & ask them how food supply is – tell them I am hungry & am taken given a tin of bully beef & 3 or 4 slices of toast bread & jam – also a cup of tea which\n\nI manage to get down for lunch. \n\nWe pass two depots for tanks at one of which there must have been at least 200 in rows. On return to my carriage I find Col Dicken of Shropshire & Junior Carlton Club in my compartment & we have a good yarn. \n\nAfter much slow progress we reach Etaples. The usual time of journey for a troop train is 7 ½ hrs & yet we are 29 hours late. Have supper at the Etaples Club for 2 fr. I have 2 large plates of meat & chips & go down to station to catch train at midnight. However as she does not go till 2 am I sleep in a YMCA on the station at railway yard & am called at 2. Train however is no hurry & does not leave till 4.20. We have a brasier in waggon there are no carriages on train & towards morning feel the effects so badly that I have to hang outside the train to get fresh air.\n","19":"\n\nArrived at Abbeville. There is another officer getting out here G H Jones 227 Field Coy RE-BEF. He say that if I throw out my valise at the cloak room it will save being carried back. He throws it out & it immediately falls back under the train & is hopelessly cut about & covered in grease. So dirty is it that the disagreeable chap in cloakroom refused to take it\n\n36\n\n& I am thus compelled to leave it on the station but I ask the police to look after it for me. What the extent of the damage is I cannot say at present. Then to EFC for breakfast & find Molesworth who left Havre 10 days after me has arrived at the same time. \n\nThen I have to report to Bienfay where Div. Wing HQ is situated & must find my own way there. No one ASC or traffic police seem to have heard of the place. Tommy soldiers are the most stupid & unobserving creatures on earth & though they passed a place once a day or worked in this locality for nearly 3 years they cannot tell you anything. \n\nHowever I have a map which I borrowed from an ASC office & get my bearing. Hop on first empty lorries & by dint of asking for Blaigny which is some distance on the same road get somewhere further on track. Then lorry turns aside so walk a part of way but finally hop on a limber full of cauliflowers which takes me with 5 KM of places which I traverse per boot. \n\nHere I am told to report somewhere else Feuquieres. Have dinner at wing & then return in a lorry to Abbeville as there is a train leaving at 7.20 pm which will take me right into the village of \n\nFeuquieres. I wander about Abbeville & then go to Club for dinner (4f) as the end of the trip is in sight & I need not husband my cash at the expense of my stomach. Dine with Redfern Jock Stewart & leave in middle of meal to catch train. \n\nOn arrival at station I find my luggage has disappeared & miss train in order to look for it I then proceed to tell off the military police & the french railway official in a way that must have been laughable to any onlooker. However this will not find the valise & I decide to wait till morning to consider what is best to be done.\n\nThere is no room at the Club for a bed & I try Tete de Boef then Hotel de la France & several other places but unsuccessfully & go to Club & sleep in a chair in a warm room. For the last 3 nights I have been sleeping in the train & am so tired that I go to sleep straight away & do not wake up till 6 am the following morning.\n","20":"\n\nAwoke much refreshed after my sleep & breakfast (3f 50). I then travel out to wing to see if my kit has been taken there by mistake but all to no effect – it is not\n\n38\n\nthere. \n\nThen return to Railway & meet one of the police who tells me that my orderly came to him on station & asked where baggage was stored – looked around & picked up my port put it into a cab & took it away to the officers club where I am staying for 3 days. This is the story & I can see straight away that it is all a put up job & that valise is stolen Police can identify cab which took valise away & I spent all afternoon looking for the man. \n\nTowards evening I gave 50c to each of two cabbies & ask them to find out. They succeed & this chap tells me he took the valise to a certain spot near which there are only 4 houses. I try to get gendarmes to enter & search but they need a warrant or “perquisition\" so reluctantly I take the train for camp meeting\n\nLt Shannon who takes me to Battalion HQ – where I am told to billet with A. be alloted to B & detailed to Education officer. I report to B Coy Capt Dixon & find Scotson & Molesworth there. He is a self opiniated crawler but his treatment of me is excellent: Scotson is mess & learning that I have had nothing since breakfast provides what the larder can furnish which\n\nI appreciate in my lonliness I sleep in Beatons room to night with plenty of blankets & a smell of unwashed linen.\n","21":"\n\nCapt Dixon arranges leave for me to go into Abbeville to search for my kit as I intend to search these 4 houses where the previous night the old man who joined in argument with cabbies had made judicious enquiries. I get hold of Roper but he says I do not need him & then go to APM & with 2 men visit the house with green shutters then a house of a Belgian refugee & then the café at . \n\nThis man does not realise that I am an Aussie because I am wearing a cap but he is full up to the neck with Australian who smash in his place. The police tell me they believe there is a gang of robbers working in Abbeville some of whom pose as officers & some as diggers. Disappointed I return to Club & write up diary & then catch train to camp. There are two nice ladies in same compartment one of whom reminds me of Lucia. \n\nAt camp I report to A Coy mess for I have been transferred to this company but\n\n40\n\nfinding no officers in the mess I return to B Coy have supper & then take Beatons billet again.\n","22":"\n\nThis morning I breakfast with A Coy & then visit billets at 9 am am allotted to No 2 platoon. Routine here consists of breakfast 8.15 am. visit billets 9 to 9.30 then loiter around football field till10.45. fall in & route march or battalion parade. \n\nThe whole of the afternoon is free to do as we like. Lunch is 12.30 & dinner 6.0 pm. The night is free The one mania in this battalion is football & it is pitiable to see grown men, pretending to be children & with minds incapable of grasping the larger ideals & so degenerate in a eager childish way to amuse themselves with something that cannot interest them. \n\nThe billets are arranged as artistically as possible as marks are awarded to each company & everyone save the diggers simulate keenness Owing to intervention of my company commander Major Carr I manage to get two suits underwear & towel from Baths. After dinner\n\nI have no billet get alloted & doss again with “B\" Coy.\n","23":"\n\nTo day after inspection of billet Capt Grace & I look for a logement. First house there is none but when it is discovered that I speak French they immediately disorganise the household to give me a room but as room contains 2 double beds & I require only one I do not take it. \n\nThis morning I met an old wealthy Frenchmen who was quite excited when he found I could speak French & wants me to meet his wife. After lunch I meet interpreter with the Sphinx badge & we proceed to sundry billets all of whom have rooms but no beds some are too far away to suit my fancy. \n\nHowever I find one which is very far away (7 minutes) but quite comfy. \n\nHere also my ability to \nread\n speak French makes me at home with the family & the old lady put the room in order & a warm \nwater bottle\n brick in the bed & I am set as the diggers say. The interpreter is an uncouth kind of individual whose\n\n42\n\nknowledge of English is very limited. At one place he knocked & when answered make no reply. Then knocked again & the chap called out is that the Chinese. He merely replied it is not the Chinese but no further information. However the billet he has found me is quite comfy.\n","24":"\n\nI am orderly officer for company today as R Young is off to Chepy. The duties are nil save that you are present at meals Afternoon write up diary & at night have 3 officers for 34th Bn to dinner Capt Gilder & 2 others. \n\nOn return to billet find madame waiting for me with a packet of Creamola which she asks me to translate into French for her so that she can use it & is very grateful when I do it. I talk with them re New Caledonia and other matters till 11 pm.\n\nWhen I said NC people wished English flag because it would make them rich the old chap said Riches are not all it is patriotism love of country which counts.\n","25":"\n\nUsual routine with the exception there is an inspection by some general & everything must be in apple pie order. \n\nThe battalion parade which consists of forming up in lines of companies, \nwheeling\n moving to right in fours – followed by a wheel & a march past in column of coys clearing to left & advancing in line in review order rear rank in front. This is what I mean when I enter up that there is a battalion parade of the usual order.\n\nThe afternoon I spent with my diary & at night we are entertaining guests at dinner English officers from Chinese labour camp near by. They are late in arriving. Mess is to utmost capacity. We have a merry dinner with plenty of whisky & port. The party Lt Childs, Bird, Capt Hollands are soon happy & evening is a great success \n\n on which on arriving the other day he had driven into the mess & get home about 1.30 am only to find lady has locked me out. However I wake up Redfern & get in through his window.\n","26":"\n\nUsual routine only a route march under Dixon the battalion as a whole\n\n44\n\ntaking part. We march out to Hocquelus a straggling little hamlet with entrenched houses & picturesque tree edged pool in middle of verdant paddocks. \n\nAfternoon diary. It is tedious work this recording of events but its now nearly up to date. I have not written it up since 27\/12\/18 when I received orders to move & these 44 pages have been an effort especially as it is some time since the events happened & there are many impressions & events that I have left out.\n","27":"\n\nOrderly officer to day & in honour of the event the sky is clear & sun bright while the ground & hedges are white with frost. Even the ground mud is frozen. Perhaps my ill luck has turned at last. I visit every part where battalion is billeted & often climb up ladders into lofts or wander thro orchards now destitute of leaves along some winding track to the billets. \n\nAll the cooking is done on the travelling kitchens which are detached & put on ground under cover. Scotson has kindly offered me the use of his billet which has a stove in it. This is not the first\n\nkindly action for which I am indebted to him. \n\nAt last my diary is up to date & I am thankful\n","28":"\n\nThis day we hear from Colonel in an address to a muster parade in this grand place the scheme of demobilisation & during afternoon I wash & have a wash in the shower which consist of 5 holes in a pipe. However it is something. Scotson has gone & I am unable to get a fire alright so freeze while my washing remains wet.\n","29":"\n\nUsual routine – afternoon Scotson room in warm sunshine. The country is delightful when the sun is shining. This is now late in January & there has been no sign of snow as yet. \n\nThe style of house architecture is curious & involves a large expenditure of The back of house is always in front & often obscures a pretty building. The rear of house is always a garden enclosed with a strong high brick wall. \n\nOutside the wall of 19 de de Villiers The dead & tangled limbs of trees among which birds are already beginning to twitter & when sun \n\n46\n\nstrikes across this dead forest it lightens up the shade & the effect of sunshine & sombre shadow lends enhancement to the view especially in the early morning when the air is brisk & clear & the noisy clamour of this rustic village does not on the of peace & silence. \n\nThe orchard is surrounded by a hedge of tall trees now leafless but soon to break into a glory of green with kiss of spring. While around the inside of the garden trees have been trained & boughs straightened till they run parallel to ground which when in leaf must enhance the scene. In one place B Coy men. These trees are trained as fence & form a roofless verandah.\n","30":"\n\nBattalion baths this morning & then nothing for next 7 day. \n\nAm leaving De Villiers to day & go to mess building. is taking over my billet. A slight fall of snow last night but not much. Weather is not unbearably cold so far I have not worn an overcoat. Air is keen especially on face but otherwise sharp brisk or exhilarating is the best term to apply to weather. The last few days have been all sunny day though to get any warmth from sun you must get into a corner. \n\nTonight\n\nI attended a lecture on cattle raising & on the way up noticed that among the villagers loves old story is still young & many are the couples (always villagers) who arm round waist walk along this road which is not troubled with street Camps. \n\nToday I have received an issue of tunic, trousers, puttees & boots. The trousers want altering & the boots dont fit but what does it matter.\n","31":"\n\nMuster parade again this morning & some more information re demobilisation. I am among the last to leave as it does not interest me moreover yesterday Redfern forwarded a request for Paris University. \n\nThis morning I have commenced to study & am taking the course in agricultural subjects this morning subject being bee farming. This afternoon wrote up diary & loafed. \n\nLast night I moved my billet into mess quarters M. Boulanger on going home about 10 found M. & Mde drinking vinblanc (or point blank as the diggers call it) with Young & Grace with the lamp out & about 9 candles on a candlebras illuminating the room. \n\nOne thing very noticeable here is the enormous amount of manual labour done by the women even ploughing. Driving lorries often with a big lump of a young man selling\n\n48\n\nin waggons is common sight. The result of this seems a premature ageing of the womenfolk & the spoliation of their beauty & figure. \n\nThe one great lesson that an outsider can learn in this country is that wealth is not the source of happiness. The people here live in absolute poverty & without any of the conveniences necessary to us yet they are happy & contented beyond our visions of happiness. Wealth indeed has little power here to produce happiness as in our & is not regarded or sought after\n","32":"\n\nThis morning lecture on diseases of poultry & then route march to . Then precedence list is issued. I am at bottom Then to Scotson room & remain there till dinner time Expect there will be snow to night It is very cold & the water in streets has now been frozen for several entire days \n\nThe method of pruning fruit trees here is peculiar The idea seems to be to obtain a supply of firewood for winter otherwise the trees would not be touched. The implement used is a butchers cleaver & no saw. Limbs are topped off ad lib & collected for firewood. If we created trees like this in Australia they would all die but here thanks to a cold climate which freezes sap & a\n\nplentiful supply of rain in summer this hacking seems to do little harm. Trees are never pruned for convenience of picking the fruit. Walk in walled garden with Omar\n","33":"\n\nBee farming again. Carr back – route march Day is bitter cold & no sun – & low-lying mist hangs over the face of the landscape. The air has that wonderful silence that only the country knows. Expect snow tonight. Went for a long walk through the inky blackness which only allows you to see the green outlines of the elms against the sky & the general direction of the road.\n","34":"\n\nSunday & anniversary day & it has dawned with a stillness that is oppressive & somehow ominous. On opening the window the whole ground, trees, roofs etc is covered with the whitest of mantles – driven snow. On every spot that will hold it, on every little twig & bud it has lodged & when to this scene of whiteness the church chimes ring out it reminds one of those old time Christmas cards that aunty used to send from England \n\nSunday morning it is & this festival of the Christian years gives the only touch of sadness for the women on their way to \n\n50\n\nchurch are in their best attire which also too often is deep black & flowing veils a silent reminder of the aftermath of war. & in strange contrast to the whiteness around though the snow which seems to command respect for their sorrows.\n","35":"\n\nWent to Chepy our CM asked to be instructed walked out & back. Met Hutchings. Heavy fall of snow, went out in it & reached Scotson like Father Christmas covered in snow. The fall is very heavy. Snow forms an excellent method of catching a drink. Yarn with Scotson re his visit & he promises to give me some shells\n","36":"\n\nSnow ball fighting in mess & when on way to company men lining both sides of roads behind hedges. Then I march to Hocquelus which was a snowball fight en route & snowball battle during rest time. In afternoon chatted with Scotson & then dinner sit round fire which we have at last in our mess room & then bed\n","37":"\n\nBattalion parade & search for culprit who had under threat of revolver\n\nhad robbed a café of 350 fr. By no means so far have located thieves though to day I heard a rumour that some of my effects have reached this battalion so probably thief is same.\n\nThe parade today was over as parade ground covered in snow. Five new officers reported in to day & I am now transferred from No 2 to No 1 platoon. Scotson left this morning detailed for cadre duty at AIBD.\n","38":"\n\nUsual routine has gone to C Coy. Route march this morning was a glida The snow still remains on ground & the roads are frozen hard making it impossible to walk without slipping. The iron shod heels of issue boots greatly aid this process. Days are very cold & the snow lends a sameness that tires – is already becoming tiresome.\n\nThis night my book & razor arrived from Mr Alcock – the book being opened.\n","39":"\n\nOrderly officer to day & went rounds with Coghill & then have the morning off to myself till 3.15 when guard mounts an elaborate process when a band of 25 performers marches up street to Place to . Thence also come \n\n52\n\n9 men 1 cpl which constitute the guard & for whom all this paraphernalia takes place. These four men are inspected by Ord. officer & the band lead them down the street accompanied on each side pass near by the awe strucken populace who do not seem to know what to make of these English\n","40":"\n\nMurder of woman in estaminet – Carr parade on a no parade day – light fall of snow – reply to my application for Paris – fill in 540 Form – row with Chinese at before dinner – snow falling all the afternoon – fine sleet – like drizzling rain only it falls much slower – \n\nMost of the trees & walls have icicles on them as the cold is intense – nevertheless I have not felt the need of our overcoat so far though chilblains are showing on my hands & I have some severe ones on the little toe of left foot.\n","41":"\n\nNothing important\n","42":"\n\nSnow still on ground, chilblains have taken possession of my hand & I have lost use of little\n\nfinger on the right hand. Dr has given me some treatment. tabs & codene on hand. Hand pained so much during night that sleep was impossible.\n","43":"\n\nAt 9 am I am detailed to defend one of my old men who was the sole occupant of the house in which an old lady aged 65 was strangled, stabbed & all her cash taken. I spend the morning visiting the scene of the murder where I meet the French detective in charge of the case & the relatives who are very aimable & give us wine & coffee. The afternoon is set apart for an enquiry which does not take place. \n\nIn the evening I meet Arch Monleith & we walk a long way out to talk of sheep farming & then returned with my chillblains. Have received news of my stolen kit today – Have broken pen – Obtained C.O. approval for Paris\n","44":"\n\nSnowing all the morning – a fine baby snow Ground is soon covered – am detailed to adjust a claim for 300 fr re a fence burned by our company. At midday am detailed to report as Divisional Claims Officers to OISEMENT. This is some of Carrs doing though he refused to admit\n\n54\n\nit. However on seeing Redfern I find CO has cancelled order & said that I was not available so thus far I do not know whether I am going or not at present. Snow is still falling\n\nTonight received word from de Vere that order was temporarily suspended & that I was to go to Brigade with Thomas as Brigade Claims Officer but that in meantime I stand by. After this I attended a lecture on New Guinea & heard that it rains 269 day in year & averages 1 in per day – that place is full of malaria, crocodiles alligators & cannibals – that natives save 3 tribes are treacherous. Just a nice place to avoid I should think\n","45":"\n\nNo news through to day re transfer – so am sitting still – refusing to attend parades or do anything for the company Redfern & have received sudden orders to sail for Australia to day \n\nHave seen the post red robin today Generally there are plenty of chaffinch but no robins. Just now the accumulated snow on the roof became dislodged & tons of snow fell on to ground, Pity help anyone caught below they would have a rather rough time of it Went for a walk after dinner \n\nThe whiteness of the road & the high bank \n\non either side which seem like white walls of sandbags crowned with hedges of white, together with the tall avenues of elms, with their thick trunk & stately high at the top of which the branches, lopped off everywhere else meet like the arches in the aisle of a church only ever so much loftier – All these combined with an uncanny calmness cannot but impress itself on ones memory with a vividness that will not easily fade.\n\nEvery night I take a walk for the quiet beauty of these sepulchral nights appeals more to me than the sordid & silly games of cards & other forms of amusement which men of little intellect employ for fear they might be alone with their thoughts if indeed they possessed any for ever so short a time.\n","46":"\n\nStill no news of my transfer. Redfern is back this morning. Usual routine snow has become frozen & crunches everwhere under your feet. Afternoon Meeken cut my hair, burnt my forehead & skinned my neck for 2f.50. Sun is out to day but there is no warmth in it.\n","47":"\n\nDay is bitterly cold – snow is frozen on ground & wind has sprung up which cuts the face off you. The ears tingle then pain & then seem frozen. \n\nTo day I accompany C.O. on his rounds & a difficult job it is on the frozen ground to keep from falling. In fact early this morning I measured my length The hot water which the orderly brought to my bed had a thick coating of ice over it at 11 am. I had left window open The window panes are all frozen & when I scrap the front off panes it falls as snow in room & remains there all day which shows that the room is not a hot house & you’d prefer this to sitting near a fire with the rest of the officers.\n","48":"\n\nStill bitterly cold. Everything is still in the grip of the snow. A new beauty is given to the old ramshackle buildings & sheds which constitute a French home for they are boldly marked out in spotless white. On the trees the effect is even more beautiful resembling a fairy forest of silver. The ground is still of unsullied white & every branch & stem is picked out in firm white lines tapering away like gossamer on each slender stem. This\n\nbeautiful picture is some compensation for the discomfort of the cold & the inconvenience of the frozen road dangerous alike to man & beast which will assuredly follow. The washing jug in my room once full of water is now one frozen block of about 18 inches thickness\n\nToday I am moody & full of fancies reflecting much on the problems of this passing show called life but paying little heed to the future, trying to explain to myself where truths end & fancies begin or what we think are fancies are not sometimes real truths. For long is the road of life & who knows what awaits us ere we see its end.\n\nNow we are surrounded by mysteries, mysteries of blood, of inherited spirit, of this world generally in which it is probable we are descended from quite a few common ancestors. And beyond these are other mysteries of the measureless universe to which we belong that may be exercising their strong & secret influences upon us as perhaps they have done for millions of years in the infinite whence we came & whither we go.\n\n58\n","49":"\n\nNo snow fell last night but it is bitterly cold. I shaved in warm water & left my razor on table. Returning in half an hour I found the razor parts frozen together & hard to detach. This will give some idea how cold the room is & I dont leave the windows open. \n\nThe roads this morning are impossible as they are frozen hard. Even the sun cannot thaw them The inhabitants are spraying soil over some parts but this is only in a very few places. My chilblains on my left foot are now confining me to my rooms compulsorily & not by choice as heretofore.\n","50":"\n\nHad a warm bath last night in a room in which the standing water froze & the windows were encrusted with ice Washing is done in detachment. First head & face & these are dried – then body – then legs & feet. After which I roll into bed. \n\nThis morning Carr is ill & stay in bed all day. Weather is as cold as before. In addition to agricultural classes I am now attending for one week 9 to noon & 2 to 4 pm each day. Chilblains are deadly\n\nbetter to day. \n\nJackson has gone to Abbeville & wanted me to accompany him in spite of my monetary position as I would be his guest – the first kindness I have had shown to me in this mess among the ill mannered & uncongenial beasts known as officers Their names are Carr, Lyne, Henry, Young, Sheehan, Jackson & Clifton. Grace has gone to C “Coy\" The few make the room disagreeable & I spent most of my time in my room, writing up diary, learning French or studying environs of Paris where if my application is successful I will spend many happy days although it would be more profitable if I went to farm at Sutton Veny. To day I received my pay book\n","51":"\n\nAm now officially claims officer for the battalion & investigate 2 glass windows broken on Place. Then usual routine\n","52":"\n\nIn course of investigating dammage to fence I go to ordinance camp – meet & have a then luncheon with Wardilore Then we make a party. Visit – (Wardilore enters by windows) visit upstairs take café au rhum – then to\n\n60\n\n & seen march then to Café Lion d’or then leave Childs & Lindlay & I continue – visit one of Childs café & do not find it interesting – then pass 4 faces then to end of village & return – knocking on window. Terise Richard 48 Rue St Gilles Abbeville then epicure, then café then home to dinner at Chinese camp. This is my first day out in Fresseneville.\n","53":"\n\nMuch elation at fact that I have returned back to mess & queries asked what happened & envy when I told my story. Internal combustion class this morning Then claims in afternoon –\n","54":"\n\nMade a trip to DORE Capt Saunders this morning on OS waggon which had forgotten to order & for which we had to send a mounted messenger. Arrived at Chinese camp saw Childs proceeding across road & went along & picked up wire & returned with Jackson made a tour of cemetery & then home. \n\nHave received news to day that I am going to Rouen on 2\/3\/19 & I think my Paris application may be through by then & I hope I shall see the last of the set of alleged officers\n","55":"\n\nRain all day long. I have an appointment with Lindlay to go for a walk & a promise to met some friends. True to my promise I trudge along through rain & slush to Chinese Camp only to find that Lindlay has been ordered to Calais quite suddenly that morning. So I postpone my walk & yarn with some retired public house keeper & listen to his career & then take afternoon tea & return to camp.\n","56":"\n\nAnother claim has come in & I interview several ladies M. Callipe wife. He is out I make an appointment with all the witnesses for to morrow at 1.15 not knowing that I will be miles away. \n","57":"\n\nAm orderly officer but on reporting to B.OR am relieved & ordered to stand by for Staff Captain who wants to see me at 11 he comes along & says that I will accompany him & Lt Thomas to Gamaches & then Blangy to adjust some claims I get into big motor lorry & travelling is not of the best class. In car I meet Nowland\n\n62\n\n& an interpreter. \n\nWe proceed over the flat country beyond to Hocquelus & then over more flat country till we enter a wood thro which the road winds downward to Gamaches. Here we descend & decide to dine here but have to mass our money to see if we have sufficient for dinner & on finding that we have interpreter books a dinner at Hotel St Pierre.\n\nWe then visit Mairie & secretariat at his private house crossing the Place now filled with rows of limbers for Gamaches is the area of the machine gun battalion until recently commanded by Blacklow\n\nWe pass a church in very florid style in Rue de la Gore & interview claimants. Then dinner & an excellent meal it was. 2 boule of cider-sauterne & red wine & cheese. – hor d’euvre, fish, culled in cost 8 fr in all. In my present state my finances would not stand the strain of this position\n\nReclimbing into our grand motor we proceeded to Blangy where I met Brissenden & also Biddulph whom I took for Robinson 1st Bn Am afraid that I will be let in for this job. We take afternoon tea & after buzzing about with heads set off again for home\n\nPass an ancient chateau similar in architecture to one here only bigger situated in a valley with its gate over which is a gold crest, running up hill to road. Behind on the hill loom the immense forest of Eu once the domain of the Prince Imperial who mortgaged it & the\n\nFrench govt bought all the equity for £11,000,000 It is said that over £1,000,000 of limber has been taken out of it since war & yet you cannot see where it has been. Forest abounds in deer & boar. Arrived home 5.30 pm not dark till about 6.15 pm.\n","58":"\n\nMen put up fence – met a frenchman who takes me home & gives me some of the finest cider I have drunk. We put away two bottles. \n\nReceived Aust mail to day & send £10 to my account in London which is unworkable at present time owing to small amount reposing there. \n\nTo night mess gave a farewell dinner to Henry. Carr was absent Dinner was the boys farewell & an excellent turn out it was. Most of the officers were chequered especially the Lyne who bibation made him an excellent & loquacious president. Toasts were numerous. Carr was drunk with empty glass. Then the for which the boys were admitted from the kitchen. Then M. & Mde then La France, Les Allies et others. M. produced cigars which subsequently steals. Lyne & his orderly are too drunk to go home so I assisted by Henry see them home & I put Lyne to bed. Sheehan is dragged home by Clifton & Jackson.\n\n64\n","59":"\n\nKitchen staff this morning gives as a meal though they dismissed as from last night. Young is absent & is paraded Lyne will be to-morrow. Jackson & I go to Abbeville as I have today drawn my first pay this year but alas it is all mortgaged & the next few will also be \n\nAt Abbeville make certain purchases try to go up the tower of Church see Parc Boulon, look for Bois sur Scardon then House of Francois premier; then visit ship & invited to dine at Georgette Dumonts 8 Place Cour du Ponthieu 8 but do not. Then home again\n","60":"\n\nAm orderly officer again. Then visit M Calippe & make an appointment at 1.15 pm & keep it & am surrounded by small crowds of men women & girls all wanting to explain at once. I beat the old chap down\n\nThen visit Dr for my cold is increasing & then pay for the remittance of which will leave to morrow. Then to room Mess is now deserted by all officers. Lyne was paraded to day & brought up a lot of complaints against Carr.\n","61":"\n\nUsual routine\n","62":"\n\nWent to Chinese camp this afternoon to tell Capt Grice (West Susssex) that we would be up to dinner on Tuesday & not Monday & to go for a walk with him. He is out so I walk over to Dargnies passing Heyman & another officer on the way. \n\nDargnies is a small village in the wood as straggling as most villages. Here I saw a man in a little carts drawn by two dogs & moving much faster than I could run. He seemed unusual as all the villagers stopped to look at him. Thence I went on to Woincourt through the village & home again.\n","63":" \n\nUsual routine. Lecture on Australia affair – frightened boy –\n","64":"\n\nIntended to ride with major to Blangy this afternoon but owing to some officer coming he could not go but lent me his horse & together with Clifford & the galloper we set out for \n\n66\n\nUnfortunately by taking a wrong turning we went in an exactly opposite direction & found ourselves at Valines Returning to Fressenville we went as far as Freville where we went to Escarbotin. Had a couple of Rhum & coffee at Cafe des voyageurs then returned to camp.\n\nImmediately I had to leave to keep my appointment with the Chinese officers. I went along without Jackson who could not come. After dinner adjourned to Grices billet & went serenaded by Childs, Bird & Petre. Capts Wardilove & Wright joined us & we had a most interesting discussion re Mexico & China at same time smoking excellent cigars & punctuating all speeches with nips of whisky. \n\nI arrive home about 12.30 pm after a very pleasant evening & having made arrangements with Grice for a trip to morrow\n","65":"\n\nThis afternoon we caught the 3.30 train to Eu. The pic describes place better than diary. Went into Cafe de Hesdin Mde Delmoitte, Villa Les Fumlaux, onival par ault Somme had rum & coffee quite a usual ten to Church & Gateau, then to Rue a \nriver\n street with a river in the centre – then to College St Agnes & old city walls. Then took train to Le\n\nTreport, walked to end of town & along pier Views along coast are fine & the near cliffs are overwhelming see pic. The Casino is closed as hospital but last man is leaving to morrow Walked along Plage & over to funicular the railway which goes up & through the cliff to the old Hotel Trianon now No 3 General Hospital. \n\nRetracing our steps we cross the bridge & to Railway Station see pic then back to Hotel des Baises. After this we walked up & down street & then as we had a better chance of catching a goods train from Eu commenced to walk back there & uncomfortable it was as it was raining. I had Jacksons trench coat & the 4 KM were soon covered. \n\nOn arrival at station the lad informed us none too civilly that there were no goods trains & that we must wait till 4.40 am to morrow morning. We go along to Hotel de La Gore & it is complet. We then followed woman who is looking for a room & are finally given a room (5 fr) at Hotel de Commerce where Augustine lives & slept or half slept till 4 am when we arose & caught train arriving home at 6 am. (Mde.\n","66":"\n\nTurned in at 6 am & rose 8.40 am feeling quite refreshed & none the worse for nights outing & went on duty as orderly officer, arriving\n\n68\n\nat HQ 10 minutes late was told that Major wanted to see me. This put the wind up & more when on asking for CO orderly asked me if I had had my breakfast. I thought CO had got to know that I had been away without leave. However it was to act as interpreter. One of our men being accused of stealing from train – the same who had rushed into mess previous night – & french police wished to interrogate him – \n\nAfter this went on duty as orderly officer. Sky is peculiar a greenish yellow & we hurry off guard in fear of hail but none came.\n","67":"\n\n has interfered & stopped my going to Rouen but Redfern rights matter. Get Melhuish for an orderly – & await end of day but have not yet asked permission to go & may be thrown back till Sunday yet.\n","68":"\n\nReceived permission to start & got away by 11.15 train Little Melhuish is almost invisible with his kit 3 blankets, helmet rifle & my pack He reminds of the old cartoon in Punch of the father who would only hear his sons voice out of the mass of material in front of him.\n\nArrived in Abbeville Melhuish gets rid of baggage & I slip-along to club with Capt R in the Chinese camp a missionary from China & therefore somewhat of a contrast with your \n\nhumble servant. During dinner Crudge comes in & he & I spend the afternoon together walking along the banks of the Scardon for a long way & return to town passing on way a very old church situated on a hill very much above the street level.\n\nWe then tried to ascend to Lower of St Wulfram but found permission has been barred by the English authorities who always seem to be interfering where interference is least justified. Then finished up at Elat where we dined 4 fr. Elsewhere in town dinner costs 10 to 30 fr. These EFC are the salvation of officers who otherwise would have less money than they have now.\n\nAfter dinner I visited 43 Rue de la Caseine looking for Crudge & after to Green shutters but he was not in either. I visited Bar of Hotel de la France & had coffee though there is no dancing here to night as is usual. Finally at about 12.30 am I went to Club & was given a bed (2 fr) in the long dormitory called annexe.\n","69":"\n\nHave made arrangement to meet Melhuish at 10 am. I rise fairly late being Sunday have finished breakfast by 9.30 & spend the time upstairs & talk to a WAAC who is cleaning up the room. I tell her that I must meet someone at 10 & she laughs outright & tells me that it\n\n70\n\nwas 10 am an hour ago as the daylight saving scheme is always in force here & all clocks were put forward one hour last night. I then hurry out find Melhuish & away we start for Dev. Wing which after walking every inch of the way we reach just after noon.\n\nI dine here get papers but owing to delays cannot get away in time to catch 2 pm train so must rest to night in Abbeville though there is nothing more to see & I have no friends. However I chum up with some English chap & after tea go for a walk. He leaves me early to visit two friends Leoni et Marie 8 & I return to sleep. To morrow I must rise at 5 as train leaves at 6.7 am.\n","70":"\n\nRoused myself at 5 am – dressed & shaved & as I was setting off found that I might have had breakfast had I desired & also that train left 6.7 am & not 6.20 as RTO had endorsed my movement order. However I had made my dispositions well ahead of time & caught train together with orderly. \n\nIn train met two Tank Corps officers & landed in Amien at 8 am. We all three went along to Hotel de Paris for breakfast The other hotel charged these officers 30 fr a piece for dinner on a previous occasion (Hotel de l’Univers). We had an\n\nomelette & coffee. Opposite a lady with her mother spoke English to us notably while everyone seemed in a desperate hurry & rattled plates & ran away from tables after the waitress to hurry up their . \n\nWe walked up Rue de & visited Cathedral a magnificent structure the finest I have seen seeming all space. A shell has entered roof missed pillars & smashed a named tile on floor & failed to explode a miraculous escape for the building. The windows are the most glorious mass of colours & symmetry that I have seen & this pic do not do them justice. In rear of building is statue of Peter the Hermit \n\nAlongside of Cathedral is Palais de Justice much sprinkled with the effects of shrapnel fire. I then leave my friends & commence a tour of the town along the Boulevards commencing with Belfort, past the statues of illustrations then to Cirque a municipal theatre now badly damaged by shell fire see pic. Opposite is Hospital of St Vincent badly damaged by shell fire. \n\nI then visited the promenade de la Hotore, a raised road flanked on either side by a triple row of trees. The bassin now a long dry field shows the marks of shells holes by which the Germans ranged gradually creeping up till they had\n\n72\n\nrange of adjoining factory when they deflected & smashed it to pieces. In centre of field is large pools 15 ft in diameter at regular intervals similarly ranged & for the same purpose. \n\nI continued on till I reached the Post D’Aval then to Garden des Plantes – where whole glasshouses are devoted to the culture of our common geraniums. Here rain came on & as I had no coat I took shelter with the gardeners & told them all about the great size of our farms.\n\nThen I wander down down & meet a NZ Captain who is visited a Mde Hautecoeur 21 Rue de & after we dine at a tea room \n\nI then go to Railway station & find that my train is starting almost immediately & that I must go in it or wait till 6 am to morrow all trains seem to leave at unholy early hours. There is no other alternate so we go on board leaving at 5-40 pm\n\nOn we go through undulating country fringed on limits with hills or forest reminding me of eastern coast near Poya. The whole country is intersected with filled in trenches & dugouts now of no use but once filled with an importance far beyond their present innocent look. \n\nNight comes & finally at 11.23 pm we land at Rouen & find ourselves stranded the orderly is alright as there is a rest camp for him But for officers none\n\nI find myself in company with a Scotch machine gunner named Johnston. He is not anxious to pay for room & we look for hostel. In search I find a large house well lit up & door open I go in but can find no one In one room I find the unfinished meal of some people & sit down & have a meal on what is left Scoty is afraid to enter & I bring him out some bread & cheese. \n\nThis is all I have to eat since the omelettes this morning as I intended to dine in Amien but proposes etc. At last weary of looking for home we go to Hotel d’Angleterre get a room & a couple of bottles of beer & sit up till 1.30 am yarning.\n","71":"\n\nThis morning we rise late & breakfast at the Club. Then catch No 9 for base du Nord to pick up the batmen. Then No 6 train to Quevilly. Here we find No 6 Vet Hospital & report to orderly room then on to school to Major McColl & Capt MacLennon who is adjutant. The school comprises Cpt Richards, Capt Shaw – Middlesex, Lt Johnston MG, Lt Hall – Manchester, Lt Young (Cameronian, Lt Shelton XV. KH., Lt Mansell RFS ()\n\nThe morning is spent in fixing up quarters & then as afternoon is free\n\n74\n\nI go into Hotel de’Angleterre with Young who has left his things there. We then adjourn to club & met McCartney & More. Then visit Braserie de l’Opera & American Bar back in Rue de Charettes. Then Apollo & Hotel de Paris where we left the others & visited Stephanies Rue de Grosse Horloge opp Hotel du Nord & finally after many adventures walk home arriving here about 2.30 am. To day I draw all available cash & by end of night had spent it all.\n","72":"\n\nAs very few of the 37 expected have arrived the course is postponed one day to await their probable arrival & Young & I again set off for town. Afternoon tea at Club bring Lt Morton 3rd Bn to me & he joins our company: I meet Gabrielle Petit & then go home to dinner with Morton at his billet. \n\nThe old man is very ill. I yarned & he has invited to dine with him. We return to our rendez-vous at 8 pm at St Ouen & then we went to the Apollo a variety theatre with hideous painted actresses who sang English songs in French & throughout the whole performance a modernly dressed man & woman persisted their modern allure contrasting strangely with the costumes say of ancient Egypt in a scene from Cleopatra or the tights of ballet dancers. The boxes here\n\nare little square apartments with sides about 3 ft high & not your own as any comer may be run into them. I left at the interval & found last tram had gone & had to walk home\n","73":"\n\nSchool has commenced today & the routine is lectures 8-12 with ½ hour intervals & 2 to 3 pm rest of day is free to ourselves. \n\nWent down town this evening & visited & climbed Tranbordeur & then went to St Ouen a beautiful Gothic church – we walked round the clerestory & viewed church from various points There are 3 beautiful rose window. We then mounted to the roof climbed around it & then breaking down the door that obstructed us we went to the highest part of the tower – a dangerous thing to do as masonry is not safe here. The tops of the spires seemed to me remarkably unsafe & a good wind should blow over the crowning monuments. In future I shall keep away from churches in case they should fall down. \n\nWe then visited the Lower where Joan of Arc was imprisoned while awaiting trial & the actual spot where she was burned Then I wandered among the back streets & find that Rouen is a centre of much architectural beauty. The old crooked & blind streets running into each\n\n76\n\nother are rich with old relic. In one place I found the wall of an old \nbuilding\n church has been used as the supporting wall of a modern private dwelling.\n","74":"\n\nLectures as usual – went down to Rouen now a daily practice with me & visited American Bar & played billiards\n","75":"\n\nSaturday afternoon is free & I devoted it to sight seeing. Visited the Churches of St Patrice with some magnificent old stained windows. Then went on to St Godards & thence to Palace de Justice a magnificent structure. \n\nSome of the actual chairs put here by Louis XIV still remain in same place. The old meeting room of Parliament of Normandy is same the relief on the oak roof touched with gold is 1 ½ metres in depth & looks fine. The grills show a finish that nowaday we would slur but they were artists in those days & worked for arts sake. This room has a beautiful carving of Christ so beautiful that when all traces of religion were removed from halls of Justice this one was left because it was too beautiful to spoil & so this remains the only\n\nreligious symbol in any court in France. We then entered Salle de Pas Perdu & Court of Appeal. On a back street we stumbled on the remnant of an old castle destroyed in about 1100 AD & this piece still persists.\n","76":"\n\nThis is Sunday & we have been told that there will be lectures rather unusual & unnecessary we think but orders are orders I intended to go out to day but rain has set in & I do not move out at all\n","77":"\n\nThis vet Hospital has been the disposing centre for army horses for some time past & horses are regularly offered for sale Mon & Fridays. The mules average about 700 fr & the horse 1300 to 1400 Many people advocate that these horses should not be sold to french as they do not know how to treat an animal. \n\nWe saw two girls here to day with their father & brought them & their male friends into mess where we had some dancing & some little conversation The girls are awfully jolly Another little girl who was here & who speaks English well has herself in\n\n78\n\nto day on behalf on her father 50,000 fr.\n","78":"\n\nUsual routine – met Behrend – visited Le ontaint so Marie et Musée.\n","79":"\n\nAgain in Rouen – visited various places of no particular interest but quaint – address on Posis 130 Rue de Faubourg St Denis Sonia visited Hotel de la Bourse. I am awfully short of cash & live from hand to mouth. In a way I am sorry I came here for it is eating up my cash & I am always at my wits end to know where to get it. I have decided not to partake of any jollity till I have something in hand\n","80":"\n\nA lecture is being delivered to night by Richards & so no one can go to Rouen ordinary routine\n","81":"\n\nUsual lecture – day again to day & the two girls came again Their escort wanted to shout us all drink & finally we arrange to meet them tomorrow\n\nwhen they will have their horses & if we cannot find horses they will dismount & we can go for a walk. To day I am orderly officer & so cannot go out\n","82":"\n\nRain to day & stayed in all day intending to spend all my available cash tomorrow\n","83":"\n\nLectures as usual this morning & as it is raining our plans for the afternoon are doubtful but Mansell & I decide to go & as it is raining I take Mansells trench coat. \n\nWe catch the little boat “Elan\" see pic & away we swing down river with current we pass for some time through the shipping adjoining the port & then into more open country of manufacturing kind – Then we pass long islands now only a few feet above the level of the Seine which is still in flood. Most of the islands have one or two houses most of them abandoned as a few days ago the islands must have been 2 or 3 ft under water \n\nOn right side we pass many more or less inviting old Chateaux often closed & in many cases without any attempt to beautiful the front though this is not true in every case. Here we pass enormous chalk cliffs & these\n\n80\n\nhave been honeycombed to \ngive\n make a house in the rock the only sign that a house exists is the barred windows. These chalks often come away in large land sides so should not like living under them though in some cases the village is built under them\n\nFurther along the river opens out into a wide pastoral & agricultural country running up to forest clad hills. On a dominating part of the ridge looms up the ruins of the castle of who in & about 1070 prodeused all the & cruelty of hell here. The ruins which I did not visit on this trip seems to have been restored.\n\nThe villages passed include Croisset, Val de Haye? sahens, & La Boulle a pretty little village nestling beneath perpendicular chalk cliffs. The church has a landing place for almost at its door & half the town is separated from riverbank by a narrow street only. In the other parts the streets are so narrow that it would be absolutely impossible for 2 carts to pass & if one cart is in the street the other must back to the next cross street.\n\nThe spot is very pretty & I will certainly make another trip there. The day was not suitable and was very cold & we were nearly frozen by the time we arrived back. The journey took 1 ½ hrs down & 2 hours back. \n\nOn arrival in town we went to Club & dined & then\n\nwent off to Opera though everyone told us we could never get in. However a knowledge of French is handy & things worked well & we got an excellent seat – right in centre of house. \n\nThe theatre is a fine spacious building though one has to mount a flight of stairs to reach even the ground floor. There is no promenoir & one must go outside to smoke. The entrance seemed dirty & draughty & the passage & rooms outside the theatre itself cramped one to the extent of being uncomfortable. The interior is large & luminously gilded the roof pointed with figures in the sky & looks real while the chandelier of electric lights is gorgeous. The seating accomodation I should estimate at 2500 about. There are 4 tiers or . \n\nThe play was Faust & excellent it was the artists being imported from Opera at Paris. Huberty () Valentin (Lestelly an excellent voice) Marguerite (Mareille Berthon). The performance was excellent & the 9f 50 was an excellent investment \n\nIn middle we went to Brasserie & picked up Young & Morton gave him a reserved seat After performance concluded we visited Hotel de Paris on & then to Charley Bar in Peace du Vieux Marche & finally picked up the valiant Cameronian & started off for home.\n","84":"\n\nUsual routine – no lecture in afternoon\n\nas there are about 12 men to be paid & here this takes about 3 hours.\n","85":"\n\nHave decided to go quiet this week in order to amass cash & have sworn off drink. Lecture to night on Rhodesia which was very interesting. Land abounds in parts & wild animals – land is good but little is agriculturally used cattle raising being the main industry. Fences do not exist. Land is freely given but somehow I dont fancy going there. In fact huge wealth is necessary to make wealth while the climate is not exactly nice for a white woman.\n\nIf farm fail you cant hire yourself to next neighbour for manual work is left to the blacks who are given a small piece of land in return for so much labour.\n","86":"\n\nUsual routine – went to town with Mansell.\n","87":"\n\nUsual school with a lecture in evening by Mansell on his air experiences.\n","88":"\n\nAs Mansell has received orders to leave the school decide to go to town, lunch together & go to theatre. As I am orderly officer I cannot go & spent the day in solitude with a fire & a book which I am too sleepy to read. \n\nAt dinner I disclose my real identity to Major McColl & we chat on for some time & write letters. The major is sorry that I am in & wishes he had known & I could have gone – However it suits my purpose to stay in as I have no money & must economise & I get his commiseration\n","89":"\n\nLectures cease at 12 noon to day & Mansell Richard & I sail into down into the Museum of antiquities most clerical from old churches with some old armour. One rifle about 10 ft long & a good collection of spurs. \n\nThence we visited museum with anotomical castes of neck face hand feet & development of foetus. Then to an Exhibition of painting in the Musée in \nLuxembourg\n Solferino Garden. The painting is put on with trowels & the rooms are not long enough to allow the proper effect to be obtained though some of the awful \n\n84\n\ndaubs contain no merit & would look better at 10 miles than 10 paces. One picture in particular struck my eye a park scene with a couple of ladies seated on a seat & a little girl in the foreward\n\nThence we went to Club for afternoon tea & then took 16 tram to Bon Secours & visited its church a magnificent structure without though oppressive within & filled with a wonderful style of glass window. They contain figures & those small & yet the colour effect is magnificent. \n\nThen we went on to Joan of Arc memorial whence a view for miles up & down the river & away in the distance miles away look the green & verdant pastures of Normandie. The visit was worth the vista & I think I shall go there again. \n\nThence we retraced our steps Mansell nursing a French baby in the tram & I holding on my knee my other friend an artillery officer about 6 ft high We dined at Club (4 fr) & then to Opera where Mm Carre was playing the main part in Madame Butterfly – the most powerful representation I have seen the singing & the acting were marvellous & I quite lost myself – Tears were in my eyes at times. \n\nThen to Hotel de Paris for a deep draught of the most delicious beer in town & then the long walk home\n","90":"\n\nInstead of one of the lectures we had a demonstration & a post mortem on a horse. At the killing of the horse Young who had seen bodies in all stages of decomposition & mutilation in the Somme offensive had to go into the open air for fear of fainting. On same Mansell who flies at heights up to 15,000 feet in bombing raids could not mount steps about 50 ft high the other day because he began to feel & had to come down. \n\nAll the lads have gone to a VAD dance to night but as I dont like VAD & am too old for dancing I do not go.\n","91":"\n\nAm very staid & proper this week & have even renounced drinking so that I may accumulate a little cash for bust up on last night & also I purpose returning via Paris & that costs money. Life is very expensive. Egg even in mess cost 60 centimes Whisky 60c Brandy 90c\n","92":"\n\nYesterday I forgot to mention I met in town Germaine & Louise Pegara & had afternoon tea then in a patisserie opposite\n\n86\n\nPlace de la Cathedrale & full of reflecting mirrors – They are two very nice girls & I hope to see them again if possible. They are too respectable to be seen with me & we must needs walk on opposite sides – if mother is with them I ignore them Life is funny is it not\n","93":"\n\nThe date today is 14\/4\/19 & I am therefore trying to write without any memoranda past events & impressions Therefore few of the impressions remain & it is only with difficulty that I can piece the events together & many of this kind is of little interest to anyone even the writer but for the sake of having a complete record I am filling in the days so that the tale may be fully told\n\nThis afternoon I met Germaine & we took afternoon tea in a tea shop 44 Rue de la Republique upstairs. There was a VAD & an English officer also. \n\nDined tonight at Club 4.50 fr with Young & Johnston & then joining up with Cameron & a so-called Capt J Walker a drunken Aussie whom Cameron was trying to avoid. Walker insisted on tapping everyone on the head with his club & the stewards laughingly put up with it having seen him decorously & solemnly seating himself on the floor some minutes earlier \n\nOn the street he assailled a drunken French civilian. Trying to effect a composure the civvy sees my cane & rushes for it\n\n& then ensues a struggle between myself & the civvy only ended by my allowing him to have the stick which otherwise he might break. After pacifying the french & sending the Aussie away I dispersed crowd & then decided that such an exhibition of Australia must cease & so took him back to his rooms at the Angleterre\n\nMeanwhile I had lost my friends but assuming that I should find them waiting for me at the dance made my way back to Hotel de la Poste & find that one cannot enter without a note of invitation from some one. Young however has got into conversation & into difficulties with a slight & delicately formed girl in a scarlet dress with a \nred\n black domino I am called in as the inevitable interpreter & do it faithfully. A very difficult task with a pretty girl especially as she live over Brasserie St Rue Place Cathedrale \n\nHowever we leave about go to Charley’s Bar a dancing cabaret in Market Place at which one gives mysterious knocks & is admitted along a dark lane or channel for it is covered to dancing & bar room. However we do not stay long as place is crowded. \n\nThis is night of & everyone is parading in fancy dress especially the younger element. Leaving Charley Bar we go to Hotel du Nord but find dancing is finished & then go on to \nCafé\n Hotel de Paris where we stay for some time & then walk home via No 6 tram road to Casino Rouennaise\n\n88\n\nwhere there is a grand ball in progress\n\nThere are hundred on floor & though fun & amusement is rampant the class is rather below an officers dignity while the air is hot & stuffy & the hot air rising congeals in beads of moisture on the iron walls. Two girls attired in many colours drink the drinks off another table as fast as waiter puts them down but waiter recovers them for the original order Tired we go home & to bed\n","94":"\n","95":"\n\nWhatever I did on these days other than the school lectures has passed my memory & nothing can be recorded\n","96":"\n\nLectures in the morning & then in afternoon meet at Brassiere Louise et her mother. Go down a side street & then Louise is detached to find me. Then in train together & pick up Germaine & mother – end of conversation alight at bridge & go to Eden picture show & get ticket alongside of her. She whispers location as she passes & get ticket. As performance does not start till 4.30 pm & it is now three they decide not to wait & I clear off & visit St Maclow a church in flamboyant Gothic style often called the miniature St Ouen & then returned\n\nto Cinema & am beckoned to their staircase but am far away & seat is filled when I arrive & I sit elsewhere. At interval I seek with a rapid message having made arrangements for her next door neighbour to move & I spend next arranging to meet them on Tuesday. \n\nIn evening I go to \nCarmen\n by George Bizet who committed suicide on account of half received success of Carmen. Lafont took Toreador but was not pleasing Don Jose, Ovido Zuinga Roujon, Carmen, Alice Raveau, Micaela Mde Arty all from Opera – Comique The play was staged in 4 acts – Cyar Factory, Tavern of Lilas Pasted, Smugglers retreat in mountain & Cirque de Seville Performance is not nearly so good as last Sunday night.\n\nNext Sunday is Louise a very long piece & a piece which I have just missed seeing several times. After theatre went to Paris Hotel for an hour & then home to Petit Quevilly.\n","97":"\n\nAnother day the record of which has passed away from my memory, save that I sent a special pic home as this is the birthday\n","98":"\n\nMet Louise today & later Germaine in our little tea shop, & then go on to Isaackson & Morton at the Bakeries for dinner with 2 girls\n\n90\n\nwhom they have invited down. This is preceded by a concert of Lena Ashwells party & then came the dinner & an excellent one it was Fresh bread is a novelty & much appreciated as our bread is always 4 or 5 days old. After dinner Morton & I saw the girls home. I as far as Bridge & then went to Paris Hotel my usual rendezvous if in town about about midnight.\n\n11-4-19 (Tues)\n\nIntend going to night to Rue St Julien but on arriving at Bakeries am persuaded to go to a fancy dress ball of the “Fragments\" as a sundowner & an excellent one I made \n\nWe arrived too late for much dancing but soon enough to receive an insight into the characters of British officers & gentlemen Two (Major Love + 1 other) seize food & champagne off the table & hurry away to cloakroom to gorge & though their eyes were bigger than they abdominal regions they never contemplated sharing it with the only other occupant of the room – Another Colonel came to his pocket got his flask poured a nip to his friends he looked to Isaackson & with a Heres to your drained it off likewise the Colonel & then departed leaving Isaackson thirsty.\n\nThen a member of committee who sends every day to Bakery for fresh bread & got it told Isaackson\n\nhe could not find partners as he did not know any one, & so on the night was full of similar incidents. This might be the Englishmans idea of showing what his manners are to Australians for some knew Isaackson but I am inclined to think it is just their natural character & lack of courtesy & knowledge of the elementery rules of politness so unnecessary to selfish natures. \n\nAfter this we met the one decent Englishman in the room Twigg & told him he was too good to be an Englishman & we were taking out papers to make him a Naturalised Englishman.\n","99":"\n\nAttended a Masonic meeting in Room 13 Hotel du Nord. Method of examination is slipshop & embarassing. Richards is with me but Isaackson has gone to Paris. Dined with Richards & then went to Brasserie de l’Opera when he left me & I came home.\n","100":"\n\nThis will be almost our last night in camp as school ends tomorrow though passed will not be ready till 7th so we have decided to have a dinner I have invited Isaackson & we arrive\n\n92\n\nlate. There are many guests & old mess is very bright & full of hilarity. After dinner drinks go the rounds & all is merry Young is dancing fling & Johnston sing Hamilton is improvising Isaackson has been lucky enough to. Orgie continues far into the night & we finally go to bed about 2 am very early for us.\n","101":"\n\nThis will be the last night that I will have a free leg in this town as I am booked for Opera to morrow night & on Monday I leave for Paris. Richards will go round with me & I am to meet him at Club. \n\nIn afternoon I meet Germaine & we go to Bon Secours & walk along the lands & orchards of Cote de Ste Catherine & then return to town where I leave here in Rue Jeanne d’Arc near Palais de Justice after putting her on the tram (No 12) \n\nThen to dinner & then Brasserie de l’Opera where I lose Richards & almost decide to go home. However I strike a NZ Captain in street staring idly at a building but really waiting for some one to come out & meet him. I take a walk towards his home & then we decide to go the rounds for the night – \n\nWe go to Paris Hotel & meet Cameron & a New Foundland officers. We then visited Stephanis, Hill 60, Charleys Bar – now overflowing with civilians\n\nthen near Hotel du Nord meet a fair haired girl & go with her to Hotel du Palais & have several drinks but do not stay in spite of invitations addressed to me & then to Lloyds diggings in Rue de Champs Naillot off Rue Thierx & slept in a Major’s room, & comfy indeed it was for at the camp we sleep between blankets not of cleanest & not sufficient quantity in a big cold room. \n\nIn morning I shave with Lloyds gear & breakfast on rolls & jam & then to Cathedrale where we intend to hear the music.\n","102":"\n\nArrived at Cathedral we find all the music was at 10 oclock mass & so we are too late. We then visit St Ouen for sake of seeing the wonderful reflection in colour of the whole interior of the church in the holy water fount. Fount is a dark marble basin & gives a background for reflection. \n\nWe return to Cathedral where Lloyd meets his friend & I wander off on my own to Bois \nthe\n Guillaume which I have some difficulty in finding as the village is named by some name & I stroll into village before I find my mistake. The wood is indeed glorious – a natural forest without any undergrowth which enables the\n\n94\n\neye to travel among innumerable tree trunks till it becomes tired & bewildered & then dropping down sees a beautiful carpet of russet brown caused by the autumn leaves which winter rains have not rendered sodden & through which are innumerable flowers of many colours white & red predominating & coming through the dead leaves remind one truly of the “Flowers of the Forest\". \n\nTired I lay down on the inviting brown & drowse for a while only to be disturbed by two youthful lovers whose cares are all their own. The woods have a good few people wandering among the gaunt limbs or reposing in the shade & I left the woods or the country as it is called before the crowd had arrived. \n\nThis is a glorious day of spring like a day in the islands & everyone is out. I return to city & then out on other side opposite Petit Quevilly & above Croisset on slopes of Mt Bidoret where there is a monastery with beautifully wooded grounds even thicker & more natural than the forest. I remain here for some time with a glorious panorama of Rouen at my feet & in no hurry to move. \n\nFinally I start my now weary legs in motion & start downhill for the tram covered\n\nin dust from every passing car for these roads so beautiful to look upon are damnable in dry weather & every car raises a cloud of dust through which you cannot see for several seconds \n\nCovered with dust I take train & finally reach Club where I manage to clean myself a little & then dine & hungry indeed I am for I have been feasting on natural beauty & have neglected the \nmore\n baser forms of food.\n\nAfter dinner I meet Morton & go to “Louise\" The first two acts are very poor & not all gripping though this may have been due to some extent to imperfect representation but the third act opening with “Depuis le Jour\" & reaching in a climax in a duet of adoration of “Paris splendid et –“ is a masterpiece & justifies the wait. The fourth act while good is not on same high tone.\n\nAfter theatre went to Paris for last time met Madeline also Cameron who wishes to engage me in a salvage case & finally get home about 4 am.\n","103":"\n\nThis morning orderly overslept himself & so missed train. There is another at 4 pm but the objection to catching this is\n\n96\n\nit lands one in Paris at 9.40 pm & it is to difficult to get a room or find one’s way around. A train leaves here at 7 pm & reaches Paris 10.30 pm but this is worse However it means spending night at Quevilly or Paris & I decide for the attractions of Paris.\n\nThe mess here is a profitable institution run by base wallowers for their own profit at the expense of the fighting troops. The two officers decide that any profit in the mess must come into their hands & go on ordering whisky right up till last day. All of which will revert to them. I am glad to get away from such a grasping crowd & hope I have seen the last of the A.V.C. \n\nOn way down lorry containing our kits bolts & after an exciting time finally pulls up without smashing anybody or anything other than the reins & the tail boards. As it will mean missing this train if I wait till fresh harness is brought I take my orderly & small kit on in tram & reach Gare Rue Verte – meet Turgy – get an Ordre de Transport for Paris & off we go.\n\nI have the whole carriage to myself as French RTO has cleared out all 2 & 3rd class passengers. We pass over \nBridge\n Pont des Anglais & circle round town & then swing into Seine valley & follow it stopping at Sotteville\n\n& at St Etienne – exactly opposite St Adrienne. Then where two rivers meet but we are still in full sight of the gully – no hills to cut us off. \n\nNext Gaillon with its old chateau built in 1000 by Francois I – now used as a prison Next Le Goulet where the river bed is flat on each side & the gradually sloping hills on left side covered with little coloured squares remind one of the Thames while in short time the banks become forest lined on one (left) side & other opens into fields like the upper reaches of the Thames.\n\nThen we pass Vernon with its old Tower erected in 1123 by Henry 1 of England then a Norman duke as well To left we pass ruins of Chateauneuf of Phillip Auguste now no longer new. At Rosny I see the Chateau of Rosny Minister of Henry IV & afterwards the residence of the Duchess of Berry. Next comes Mantes – the pretty – where William I was thrown from his horse & subsequently died. \n\nThen we pass Possy the birthplace of St Louis & thereafter it is too dark to see anything till Paris is reached. We arrive about 10 pm. My first task is to find a room for the orderly & this I succeed in doing though it costs even in a YMCA () rest house 7 francs for bed & breakfast & then I start off for a canadian hostel in Place D’Iena This I find little difficulty in doing \n\n98\n\nas Paris is much the same as Sydney I seem to know every street & house as if I had lived here for years. I wonder if I ever did – At anyrate I strolled along to Avenue to Champs Elysees flanked on either side with guns & on the seats many a lover \nof\n from this gay city a strange contrast of love & war. \n\nBut Paris is essentially a city of contrasts in which a dead Past is ever thrusting its \nskull\n hollow eyes on a gay & living Present which smiles to hide the Past. Arrived at I get a room 7 fr & breakfast 3 fr & retire for night. There are two others in the room one of whom is an Australian perhaps I shall see him to morrow. His name is Baker.\n","104":"\n\nMorn & morn such as Paris loves to clothe herself bright warm sunshine & a sky of blue. I join forces with Baker who agrees to follow my lead – in breakfast room I meet Coghill & am afraid as he is my battalion commander & I am really here without permission. He recognises me & is no longer in command of battalion & I arrange to meet him at 6 pm in order to go to the Opera.\n\nI then walk down to that most spacious square the Place de la Corcorde – now filled with \n\nwith German guns whose days are as effectively over as de Guiltonine who once dominated this once Place de la Revolution. \n\nThe view up to the madelin flanked on Square edge with two similar building is magnificent & pigmies other architecture I have seen & loses it in beauty by its uniformity. In fact uniformity more or less according to some fixed plan seems to be the keynote of their architecture & its effect is to raise the general appearance of city beyond any other city in the world –\n\nThere is only one Paris. Looking up the broad Avenue de Champs Elysees 1 ½ miles in length & 400 yds wide crowned at top with the massive Arc di Triomphe or down the other way to those great piles of masonry known as the Louvre whose stupendous proportions numb our sense of architecture & leaves us aghast & awestricken at the wonderful intellects who could construct such works\n\nOn other sides is Chamber of Deputies across Pont de la Concorde Crossing Place we enter the Garden de Tuileries with the Allee des Orangers on the right the orange trees being in & some 500 yrs old. Here once stood the Palais de Tuileries burnt by Communards 1871 & now only a garden & lawns remain to mask a spot more closely bound up with the history of France\n\n100\n\nin the closing years of 18th century than any other edifice \n\nNow we are in the enormous Louvre & in front is the statue of “Quand Meme\" & of Gambetta typical of the latent fire of patriotism which has never been absent from this France – a country filled with dirty habits & unsanitary conditions but all of which is burnt white in the fire of its unquenchable patriotism. \n\nNear by is Palais Royal & Further on we reach Hotel de Ville a renovated replica of the original destroyed in 1871 with numerous little courtyards once the scene of such bloody fighting though now filled with busy people. Behind Hotel de Ville is St Gervais church quite unlike any church I have seen, heavy & squat approached by a flight of steps about 12 ft high. \n\nNext we reach Place de la Bastille – though no ports of old dreaded prison remains save that a ring of white stones marks the perimeter & on one house is a plan of old fortification. In centre stands the Colonne de Junillet surmounted by a globe on which stands the Genius of Liberty with the torch of civilisation in one hand & the broken chains of slavery in the other while around the column are inscribed the names of those who fell in cause of liberty on 27, 28 & 29 in July 1830 Their names are likewise chronicled in the Pantheon \n\nThen along the grand Boulevards past place de Visages to\n\nthe Peace de la Republique once occupied by a bastion of the old fortifications swept away by Louis XIV & now embellished with a stature of the Republic with three figures Liberty Equality & Fraternity \n\nThence I turned into The Boulevards – by streets but hardly sufficient to accommodate the crowds that throng it Passing the Porte St Martin & then Porte St Denis – the latter as dear to my memory from the song & then on through the fashionable Boul de Italiens to Place de l’Opera. \n\nAt end of which stands the Opera House an enormous structure covering nearly 3 acres of ground & costing for building alone £1,460,000. On opposite side of square is a large hotel containing over 1,000 bedroom – \n\nI then follow on the Boulevarde de la Madeline to the Madeline itself – a building in style of a Roman Temple intended for a Temple of Glory by Nap. 1 – it has no windows being lighted from above & is built entirely of stone. \n\nSo far I have had no luncheon & am becoming tired so proceed back to Hotel passing Palais Royal built by Richelien & after occupied by Anne of Austria & the birthplace of Louis XIV. \n\nAt Hotel, I take off my boots & rest my feet & find a big blister under one of my toes. After about ½ hour we set off for Montmartre via the Metropolitan passing Trocadero on our way. This my first experience of Paris Tube is much more to my taste\n\n102\n\nthan the London one for I do not get lost perhaps this is due to my London experience & arrive after after a change at Place D’Anvers where we alight & seek the funiculaire & we are now on the Butte Montmatre whence Henri IV shelled the city & on summit of which is the Basilique du Sacre Coeu the home of which one can mount (260 ft) whence a glorious panorama of Paris can be obtained for the whole city is indeed at your feet. \n\nHastily returning to keep my appointment with Coghill. This means waiting on metro station entrance in Place de l’Opera & a splendid insight can be gained of Paris by watching the faces of passers by & passers home. Meet Coghill & also McColl & Coghill takes us to an to meet some friends of his. These huge shops pour out a stream of happy & tired, serious & gay humanity. \n\nFinally we find our friends & go to their home hoping to take them out to dinner but other arrangements with dressmakers forbid it & we wonder forth alone & tour the Boulevards till 11 pm. These are a mass of seething humanity & in it we lose Coghill.\n\nDoc finds some friends & after leaving them Doc goes to his hotel & I sail home for mine tired after a very long day in which I have covered an enormous amount of grounds\n","105":"\n\nBeing so tired I have difficulty in rising even by 10 am. However I just manage to get down by breakfast which finishes at 10 am & after which no one is served. \n\nThis day I devote to south side of the river & start off by looking round the Palais du Trocadero a huge Byzantine Moorish looking building with two wings each 220 yds long in form of a crescent – enfolding a garden, aquarium etc & also a terrace with a cascade descending into a huge basin with large statues of horse, bull, elepant & rhino. \n\nThe river is then crossed by Pont d’Iena to Eiffel Tower up which I could now ascend though the war restrictions are off & ascents will be made as soon as the café is ready. This is the loftiest monument in the world (984 ft) & indeed it looks it. \n\nPassing then onwards I entered the Champ de Mars supposed to be 550 yds wide but now filled up with buildings devoted to military purposes & machinery necessary to drive the wireless. Thence I visited the Hotel des Invalides this esplanade in front of which is 270 yds wide & embellished with elm trees. It was intended for an aged soldiers home & can accommodate 7000 inmates.\n\nAt the other side of building uses a Dome beneath which repose the remains of Nap 1 “on the banks of the Seine in the midst of the people I love\" as was his oft expressed\n\n104\n\nwish. The gilding of the Dome has entirely disappeared. The Tomb of Nap 1 was not open to inspection this day In fact I am making a flying visit only in order to place everything in a proper perspective & not to minutely examine the treasures that await me & many of which are not yet restored from the secure depths where they have rested during the war. \n\nFrom Place Vauban I pass into the Boul des Invalides by Av de Villars along to Rue de Sevres where I double back to Av de Breuteuil which offer an imposing of the Hotel des Invalides – a rising dome dominating a broad strip covered with lines of trees \n\nThen I pass by Rue Vaugirard to the Jardin du Luxembourg reaching it by Rue de Gunemeyer Rue de Luxemburg. Here I repose in these gardens which are much the same as our gardens with quiet recesses & deeper thickets. A multitude of chairs lie around not yet in use as Spring is not properly here yet & many a private cosy corner where lovers may whisper confidential trifles. \n\nThere a few lawns & less flowers. The trees in the avenue sprouting out of bare soil unrelieved by any green but there are plenty of spaces where children can play & so the whole family comes here & enjoys itself. Madame knitting & Pere reading his paper. In centre is a large basin surrounded with balustrades &\n\nfountain of the Marie Medici who built the palais rises with imitations of stallactites \n\nI leave gardens & cross Boul St Michel into Rue Soufflot or rather I intended to but got into Rue des Ecoles whence I retraced my tracks passed the enormous Sorbonne which unlike our universities does not stand in grounds of its own but is like any other public building & loses it majesty by association & contact with its adjoining structures. The same applies to Ecole de Droit in whose rooms I hope soon to be installed. \n\nThere better situated by itself stands the Pantheon on the highest ground on this side of river. This place was the tomb of St Genevieve the patron saint of Paris. The entrance consists of 22 fluted columns 81 ft in height similar to Pantheon at Rome. The building is empty & seems a vast waste of space, & money. There are painting around the walls in delicate tints a description of which will be found in Badeker. \n\nFrom the Pantheon I went on to find Mde Brisson in Rue Cardinal Lemoine. I located the house easily enough but the concierge was out & asked nearly every individual in place. There is a young book binder here named something like Brisson but no one is sure. Finally she arrives & instead of being the mother of Capt Brisson it is\n\n106\n\nhis sister. I introduce myself & we yarn for a long time. Mde comes in but seems to doubt if I am not a friend of her daughter’s. Brisson is due in Paris in a month or so which will be bon for me \n\nI pass along Rue des Ecole past the College de France into Boul St Michel & passing downwards to the city pass the Thermal baths once belonging to the ancient palaces of the Roman Emperor Constantius Chlorus who resided in Gaul from 292 – 306. The size of these bath gives us an idea of the great size of the palace but even the Baths are now in ruins. The musée de Cluny occupies the exact site of the Palace but I did not have time to enter it \n\nFurther down the street I met the Fontaine St Michel 84 ft high but being placed against a house it loses much of its grandeur. Near by is Rue de la Huchette & Zacharie “penetrating one of the dirtiest & most intricate & yet at the same time the most interesting & best preserved quarters of old Paris.\"\n\nPassing now to the de la Cite one encounters another mass of monumental grandeur. Facing is Hotel the oldest hospital in Europe on \nleft\n right is Notre Dame & on left the Prefecture of Police. All facing on to Parvis of Notre Dame Center the Cathedral whose external air is squat solid & dominating so unlike other Cathedrals\n\nbut yet the mother of many as its façade the oldest of its kind is the model for many in NE of France. Once converted to a Temple of Reason it is still a Christian Church. The interior gives one the impression of great roominess while a pale greenish light pervades the whole. On each side is a double aisles with chapels between its buttresses. It is not the lofty roominess of Amiens but a style all its own.\n\nFrom the church I visited Palais de Justice occupying the site of the old Conciergerie This site is that of the old king & the Roman Governors for this was originally Paris & the rest of city is but the branches. The building is plain but indicative of great strength. \n\nCrossing the river I then take the \ntram\n metro for Porte Maillot & entered the Bois de Boulogne once the resort of brigand & outlaws now the rendezvous of the elect.\n\nI pass the Café d’Armenonville et de Madna but funds will not permit a visit. I then turned to Carrefour au bout des lacs & look up along the lake crowded with boats manned by all countries none of whom have the faintest idea of rowing like our own picnic parties\n\nI do not visit as time is short & I intend to return to Paris if the Gods permit for same reason I do not visit Jardin d’Acclimatation. \n\nI cross between the two Lacs near cascade but do not\n\n108\n\nvisit the Grand Cascades which are some distance away & catch the tram at La for Hotel where I wash my feet & off again to meet my orderly \n\nThis continual meeting of the orderly worries me more than anything else I know. It is not the money required to keep him but the subordination of unformed plans to meeting him at a definite rendezvous. \n\nI go to Astra for Doc but he has not returned & I desire an address from him so return till I find him. He has not been able to find the address but invites me to his room, which even in this moderate hotel costs 20 fr per day without meals. He invites me to dine with him which after a few Oporto flips I do. Dinner is with music & the head waiter chooses our dishes. Meal is very good & costs with a brule of wine (7 fr) 12 for each. \n\nAfter dinner Doc has a rendezvous with Miss Johnson & her home lies in the direction of the Casino de Paris – go there & make an arrangement to meet Doc outside at 11 am. Show is of no interest to anyone apparently for no one pays any attention to it – In the promenoir which is promenade in rear of the dress circle there beauty parades & importunes every lonely man. \n\nI stand by myself a little in rear by\n\nmyself & in succession I am besieged by about 30 young girls at least some are young, Their size habits, beauty & application of paint & powder all vary & their requests are never the same Sometimes it is a cigarettes that is needed & sometimes a flower or a drink & then the inevitable question. But there is no annoyance in a refusal & no complaint for wasting time.\n\nThere is nothing repellant like the same class of English girl. It is their business & while one pities their choice one does not feel disgusted with these votaries of Love or Lust.\n\nWhile waiting for Doc I met Jessie Alosi an acquaintance of my friend & she took me in behind the now closing scenes of the Casino, & a rare sight it was to see these girl – women in age & intellect but romping & skylarking like a lot of schoolgirl. Truly the temperament of the French is hard to grasp. \n\nI wait until midnight for the Doc & many a endeavours to entice me from my tryst. However as Doc does not come I go home to the hotel where I am staying tonight Hotel Mondain 44 Rue Pigalle & am so tired that I do not get up till 11 am though I have to meet Dr at 11 am\n","106":"\n\nHowever I get to Astra later & find\n\n110\n\nDr was detained & had a fine night with many whiskies & sodas & has only just got up. I slip down to nearest coiffeur & have a share & then go off to dinner with McColl & another friend we pick up en route \n\nWe dine at the Café aux Pyramides a restaurant largely frequented by the Yanks. These obnoxious intrusions on the human race are much in evidence here. In fact they are everywhere except in the fighting line but their boasting is beyond all endurance & as they have won the war & saved civilisation & Europe (in their opinion) they consider they are entitled to boss everyone. At least that is what they act up to. \n\nAfter dinner I propose to visit Ciro & Maxims but we meet Isaackson & the three of us promenade to a where McColl wishes to buy some presents for the people with whom he has been staying. We try to seat ourselves in the open air café de la Paix but here one does not sell alcoholic drinks so we must move along to Bar\n\nAfter some more Oporto flips (a drink consisting of nutmeg, whole egg, brandy & some other mixtures) Isaackson clears off & McColl & I set off for Ciro in Rue Daunou off av – de l’Opera. \n\nHere McColl meets an old friend with whom\n\nhe used to ride in the Bois de Boulogne & after presenting me we have a drink though more than one the girls will not take. One is as lively as a cricket & much attracts me. We afterwards make a party of 4 & decide to dine at Maxim much against the girls wishes who declare that it is too dear & not nice. However being men we are obstinate & enter the door & red vestibule of this place so famous Merry Widow \n\nThe walls contain painting for most part of nude women & mirror & glass are everywhere, seats along the side are cushioned & the remainder is chair. If you wish to sit near the wall a table is pulled out for you. Your hats & sticks are pounced upon & everywhere flunkies surround you in the hope of a tip. The girls choose a meal that is not too expensive & dispute one of the items yet cost is 144 fr. & we have had scarcely any wine (2 carafes). \n\nFrom here we wander off without any definite plans. One girl wants to go dancing at Montmartre & this appeals to me but McColl cannot dance so we go in Folies Bergeres, & if a bergere entered into this spacious building she would be overwhelmed. The place is divided into 2 parts the first with innumerable chairs & tables & a band stand in centre on \n\n112\n\nwhich a band plays during the intervals Inside is an enormous carpeted promenoir which is similar in its crowd to Casino the girls are more numerous. \n\nWe go to the upper promenoir which is not frequented by the demo monde & around the exterior edge of this runs a glass promenade scintillating with light on which tight clad girls (50) gambol & on which a danseuse gives a magnificent exhibition. The costumes & staging are far more magnificent than Australia has ever \nscene\n seen \n\nI miss nearly an hour of the performance by going to Gare du Nord (3 frs) auto) to change my instructions to my orderly whom I do not see. Finally I return to theatre & find the cricket or rather she finds me & at end of performance we see girls to their home 134 Rue d’Henri Monnier & slip off to our hotel\n","107":"\n\nMcColl does not rise till nearly noon & as my cash has long ago vanished With difficulty we dressed & without any coffee or midday meal unshaven just catch 1.15 train for Abbeville hoping for the best. \n\nThe train passes out from Nous (du Nord) through pleasant villages amongst forest & undulating hills covered with verdant green, Surrey beautiful as it was on my first\n\nimpressions is lost amidst such beauty its picturesqueness is enthralling & whilst I cannot put it into words as it seemed on this first bright day of Spring still it will remain a memory of beauty \n\nDuring journey I shave & then train passes through the old battlefield area & even now the shell holes close & black serve as a reminder of the storm that has passed over but \nwhose\n the memory of which will remain for many a day. \n\nNear Boves we passed the ruined chateau (now more ruined by Germans) where Henri IV so oft resided with the beautiful Gabrielle d’Estrees & thence into Amien where we obtained a small loaf of bread with a slice of ham (1 fr) in fact several with some substitute for chocolate & some orangers It speaks well for Maxims that we could go till 6 pm the next day without meals doesn’t it & so if meals be divided over the period Maxims was not dear eh!\n\nDarkness has now begun to set in & the way was known to me & is described elsewhere. We reached Abbeville about 7 pm & train leave for Feuquieres I rang Division & they were unaware that battalion had shifted to Gamaches though Coghill had told me that they were there since 10th. \n\nI should report to Div. Wing for instruction & so rang them up. They told me\n\n114\n\nthat battalion was to move though they had no notice of its change & so I must go to Feuquieres though I must not be surprised if battalion is not there Such is our organisation & the wonder is that we have managed to successfully blunder through the war.\n\nHowever Feuquieres means a good bed & meals at Mde Boulingers so I go without wasting time & arrive to find that battalion has gone. Doc goes to his billet & I to mine. I am welcomed in like the prodigal calf & two eggs & coffee & confiture served up for me. After supper (meals this day have only cost 5 fr) I roll into bed & remain there till 11 am the following day.\n","108":"\n\nI have to meet Dr at 11 but remain to breakfast & then say good bye. Dr is not ready but has met the QM Prentice & a waggon will be sent to bring us over in the afternoon. \n\nAs I do not wish to intrude on Dr billet I remain in his room till ready to start & at 2-30 pm we find our conveyance – a Maltese cart ie a cart without springs. There was a lamp in can & during the first minute this was jerked into pieces \n\nWe put up with jolting till we\n\narrived at Chepy Valines & there we found a seat which was jolted to pieces in first few minutes. Thereafter I decided to walk & the private on front gave me his seat & we sat straddled across seat & in this way reached Gamaches having travelled about 7 KM to much in a 9 KM journey because driver was 34th & only knew the way via Chepy. \n\nOn arrival I found the finest state of disorganisation that it was possible to conceive & I have been in the military some years now. No one was in charge. No one knew anything. There was not even a billet & no one seemed to care. The RC padre Major the last of the family of that name in Brittany escorted me round many places but all in vain & in despair I put up at the Hotel St Pierre (4 fr) for the night Little did I think when I dined here last that I should ever see it again much less dine in it\n","109":"\n\nI rose 8.30 pm & proceeded to mess. All that now remain is McKenzie De Vere Sheehan, Padree Major Wheeler & Prentice & subsequently Collier. These will probably all be on the last \ndraw\n draft for home & will probably leave here about 5th May. \n\nI am rather anxious over my Paris course & have written 2 letters to London\n\n116\n\ntoday one to Holmes & the other to Bowden\n\nI strike duty to night in charge of a picket which after searching for town major find that the duties are nil. My orderly has not yet succeeded in finding me though he is here somewhere. The billet is apparently the relic of a rather fine household with garage. The rooms all run one into the other & are not too springy beds. .\n","110":"\n\nThis morning we had a route march The company (150) is also a battalion MacKenzie & myself are all the officers We go to top of hill in a biting cold wind but rain comes on & we return Rain continues all day. \n\nDoc returns & I arrange his transport. His leave has come through & he is bound for a job in blighty.\n\nAfternoon is rainy but this suits me as my diary is away in arrears.\n","111":"\n\nRain – no parade – wet night at camp on hill to night as draft leaves to morrow –\n","112":"\n\nRoute march this morning on Beauchamps road. Brissenden passes on motor bike. \n\nWe spend a halt of half an hour gazing across the alluvial flats of a winding river which separates this Picardy from Normandy. The Normans who do not pray “Give us this day our daily bread\" but merely “Show us this day etc\" A flat topped hill rises across the flats with a ravine on either side & behind the forest of Eu full of deer & boar. Even up on the hill sides the soil is cultivated & no single foot of arable soil is lost \n\nWe return to see draft off at 11.56 am Molesworth leaves with it. Yesterday was pay-day & the drunken songs of over indulged members of battalion comes up from courtyard but my diary is up to date so I can retire to my bed & read.\n","113":"\n\nTo day Capt. Prentice becomes Town Major & I enter upon duties as Asst Town Major & official interpreter. \n\nMy work consists in wandering round all the billets inquiring of all ladies in house – inspecting – & generally amusing myself & making acquaintances with all that is lovely in the town. In this way I make\n\n118\n\nmany acquaintances & receive many invitation some of which I avail myself. \n\nIt is surprising how many nooks & corners this little village possesses. All mills here are run by water wheels & every mill is lighted by electricity but the town & private houses are on a contract with gas Co & there is no gas since 1914 on account of shortage of coal & so if you are out late at night you are not troubled with the glare of street lights but you way is lighted by the dim religious light of the stars.\n","114":"\n\nThis is Good Friday but here it is the same as any other day. There is a voluntary church parade & for the remainder there is a voluntary church\n\nparade so for those who would have clean souls their bodies must remain unclean. \n\nFor myself I set off on my billeting & inspecting job. This morning while I was away there has been a big rumpus. Some days ago I opened the door leading out of my room & finding no one there appropriated a carpet, a chair & a rug. \n\nThis\n\nmorning a search was made for articles & although both McKenzie & Sheehan knew they were in my room yet ignorance of French prevented their saying so. So they were found in my room & as several things have been stolen they imagine they have discovered means of ingress & egress of theif.\n\nAbout 2.30 pm Town Major receives a note from Maire & of course as interpreter I accompany him but no one knows what it is about. On entering the Tannerie which is where Maire spends all his time 2 women, the Maire & a surly looking man all commence speaking at the same time & had my interpreting powers to the utmost\n\nSoon I gave up interpreting & listened & find that I am the subject of all this disturbance. I am now an excellent judge of French temperant & never make a mistake. In the end I am invited to take wine with the ladies & am shown all their treasure trove & post cards. Their front room is chaos. Birds of paradise & foxes and several good specimens are on floor & in all sorts of corners. \n\nHowever I spend a pleasant afternoon & leave the best of friends with an invitation to see them again\n","115":"\n\n120\n\nStill on the stunt of billeting & this morning have to revisit a Dr Courmontagne re soldiers billets Madame implores me to leave her home alone if I can & she is ably supported by her father a Maire of a neighbouring municipality I promise to do my best & on learning that I am an avoca invites me to her home any time I am free to make the acquaintance of her husband. \n\nThis afternoon I am deputed to take a statement from a French girl Germaine Bandelin who witnessed the death of one of our men who fell from a horse & a pleasant interview it was & laughable when a baby on the floor gave a representation of the Mannicken Pis.\n\nThis afternoon I am on a Court Martial a pleasant way of spending Saturday afternoon so we sentenced him to 12 mos hard labour which is subsequently commuted to 90 day F.P. Then I review the French girl & obtain her signature to the typewritten copy.\n","116":"\n\nThis being Easter Sunday we decide to dine in style & really do ourselves well. Dinner consists of Soup Devil kidney & Macaroon, Roast Duck, Roast Pork Roast Beef Potatoes Green Peas\n\nPlum Pudding & Brandy Sauce or Wine Trifle or Baked Custard or Compote Apricots & Cream Macaroons & & Coffee. Whisky Wine & cognac included. We lingered over dinner till about 3 pm. Present were Major Wheeler, Mackenzie, De Vere, Simpson, Sheehan, self, Boyes & Colyer.\n\nAfter dinner I strolled up to visit Dr Courmontagne I was received most hospitably & after drinking several benedictines he suggested that as I had been discussing music with him we might adjourn with him & visit some friends M. a timber merchant from Brittany who possesses a charming wife & two lovely daughters. \n\nWe sit down to a very pleasant afternoon tea & of the nicest cakes I have tasted here. Conversation is very interesting & enlightening one topic being should a man leave his fatherland which the two girl rigorously argued in the negative. They were curious to know all I could tell them of Australia & even if the meal had not been so excellent I should have enjoyed myself \n\nWe lingered on till about 8 pm & as it was too late to retire to mess I thought I should miss my dinner but my hosts decided that I should stay for supper & thereafter we smoke & I finally leave their house about 11.30 pm after one of the\n\n122\n\npleasantest day I have spent here \n\nThe enlightened tone of the conversation was in itself fascinating while the eager & active part taken by the quick witted women was a revalation. \n\nAs I said before one cannot appreciate the race which is greater than even the English race, unless one can fluently speak the language.\n","117":"\n\nAgain I find myself on the billeting stunt & in afternoon receive a letter from Capt E R Holme & immediately forward another S40 form as all previous ones seem to have gone astray. \n\nI then visit my friends & find several ladies present & a barrister brother in law from Abbeville who gives me some good information re law. The conversation between the ladies of whom there are about 7 is quite different from our talk being of a breadth & depth not usually associated with women while the male element is as mercurial as a schoolboy & as light.\n\nWe see the avocat off & then I return to mess at 6.30 as I do not wish to burden them with my presence for dinner\n","118":"\n\nThis morning all officers assembled at HQ & Colonel Farrell outlined a scheme for celebrating Anzac Day. There was to be a dance for Officers with Australian sisters from Abbeville a dance for the men & sports all the afternoon. \n\nAfter leaving here I have to turn out the Sgt mess in compliance with the Maires request as the old couple 73 & 80 years of age are too old to be put out of the even tenour of their way. \n\nThen Col Heron appears on scene & is taking over on Thursday. \n\nAll the afternoon I spend looking for the dentiste but am unsuccessful.\n","119":"\n\nAll this morning when I should be interviewing the dentist I am engaged in putting up a big tent on the hill to be used as a dancing place though how successfully I dont know as the floor is very rough & the girls are hard to find so many troops of different units have been merely passing through the village that the inhabitants are beginning to think that it is hardly worth while to fraternise & so the men are not as happy here\n\n124\n\nas at Fenquieres though as for myself I am more at home here than there for I have condescended to speak French. \n\nTo night I borrow a horse & ride over to the Chinese Camp near Fenquieres to say good bye to friends but find most of them gone Little & are the only ones left. They invite me on to dinner & after dinner I return to say good bye to Mde. Boulinger & then return to join Prentice at old Battalion HQ.\n\nThen we commence our ride home through the inky blackness lighted only by glow worms when road cuts deep into the earth. The sky is clouded & a thick driving mist damps us through & through. You cannot see 3 ft away except when the horses hoofs on the flinty stones strikes fire. \n\nThe road between the trees beautiful by day is as mysterious in its silence by night. Not a sound even of a cricket & the tramp of the horses which seemed alien to the surroundings. Peace Perfect peace indeed it seemed but who knows what awful carnage & tragedy was being carried on in natures realm. \n\nArrived back in camp about 11 pm & put the horses up & retired wet but pensive\n","120":"\n\nStill engaged on the tent on the hill & have not finished putting the floor down by midday. By which time I have handed over the job to the Engineers. \n\nI am on the draught which goes into Camp this afternoon at 3 pm. On reporting I find Capt Seaton (43) is my new OC & Tierney our adjutant. Col Farrell is in command. The draught comprises all states & will most assuredly be split up on arrival in England. \n\nOn returning to the mess for dinner I find the place flooded with a party of French ladies from Fenquieres to whom I am presented but whose acquaintance I could have made in Fenquieres had I desired but it is too late now to do it\n","121":"\n\nAnzac Day – a commemoration service is held in hollow near the draught orderly room & after that we have the sports. I call upon Commandant Courmontagne to see if he wishes to go but as he is too busy with his practice I go alone & met there the Sauret family Marie & Genevieve with whom & the padre I pass the rest of the\n\n126\n\nafternoon & then return to billet to shift my quarters \n& when\n to 72 Grande Rue & when this is completed I speed off to the Dr for I have promised to dine with him. \n\nAfter dinner which as usual is light – soup – eggs – ham – cheese – coffee & liqueurs he receives a call from a patient near the big mill & we all adjourn for a walk where the chestnut trees now bare arch overhead & beside runs the eddying stream which serves the mill for power & the fishermen for trout.\n\nWhen visit is finished we return to house & take our delayed coffee & yarn over French system of Judicature of the Justices Tribunal & Cour d’Appel. \n\nI return to my new lodgings on explaining my lateness to the lady of the house she takes me into kitchen to her sister & we yarn & drink real good French brewed coffee till after midnight\n","122":"\n\nThis morning I wake later & decide that men can feed without my assistance. Before I can get out of bed the lady sends her little boy up with a cup of coffee for myself\n\n& another for my orderly. \n\nOn arriving in camp I find that I am in time to see mens breakfast & then have my own. After breakfast there is a medical inspection & then as day is wet parade dismisses.\n\nIn the afternoon I write up diary & letters. Went to Courmontagne & talked with a Peronne girl & then coffee\n","123":"\n\nSeeing the slackness that is prevailing at the camp I have decided to take advantage of it & stay in my new quarter all day. \n\nLast night after my yarn with the girl who was compelled to work at the point of the bayonet by the Germans during 2 years I yarned with the ladies who keep this house They are 3 sisters 46 42 & 41 but carry their age well \n\nWe chat on & I tell them I intend to sleep in on the morrow. Consequently they send coffee up to me at 7.30 pm & then ask if I should like breakfast in bed which they send up to me. So in spite of the fact that I laid in provisions last night at the cost of 5 fr it was quite needless. \n\nAfter enormous trouble I manage to get up at midday & then having received a delayed Australian mail\n\n128\n\n& letter from Brisson I promptly answer them while I am in the humour. Having finished all correspondence & having written this up to date I decide to make some friendly calls & will probably be invited out to dinner\n\nIn the afternoon I visited Dr Courmontagne & find that his wife has returned & he is waiting for his little boy who is going to the picture show to come in prior to going to a musical afternoon at Saucet. Mde comes down dressed & we adjourn to the bureau of M. Benard who is the possessor of a cello & or rather viola without the E string. \n\nWe then adjourn to Saucet & enter the room which has one side panelled to cover a series of shelves & cupboards within – a handy way of disposing of necessary but encumbering furniture. .\n\nAfternoon tea consists of cake – followed by pastry & then light round biscuits. This is usual afternoon tea. Often a liqueur is added. \n\nThe playing was rather good Benard made horrible face & seemed to get some notes out with his tongue judging from the way he used to roll it it. At 8 pm we adjourned Courmontaigne et supped soup – eggs – chops – cheese – pastry – (chocolate in fingers with cream interior) coffee & liqueurs Red wine through the meals.\n\nAs the family are very sleepy I retire to bed early & on arrival at my billet\n\nfind the lady of the house waiting for me with coffee. We yarn till 12 midnight & then off to bed.\n","124":"\n\nSnow has fallen during night & is still falling – rather unusual for this month which should be springtime weather However it is like a glimpse into the past though it is accompanied by an intense cold – rather unusual when snow is falling. \n\nOur camp in on top of a ridge overlooking the valley in which the town old & picturesque with its water wheels & has snugly ensconced. The panorama is continued the \nsquare\n fields a different shape with lie in almost impossible position on the slopes of the hill while across them runs a bare strip of road.\n\nOn other side of camp stands the hunting home of a residence & on the other side is a slight ravine running into & crowned with the glorious Loret d’Eu. Truly a panorama that I wish I could always keep in my memory. .\n\nSnow or sleet falls all the morning & there is no parade so I loaf around in discomfort till lunch & then come down to town as McKenzie wishes me to translate a French document re Silburn who \n\n130\n\nhas been arrested\n\nAfter this I visit the dentist & with him the café & Vasseur Reclerc, & then to billet. I dine in camp & then home where I write up notes of lectures & letters.\n","125":"\n\nRain & snow with cold wind seems to have set in. However the snow yesterday all faded away by 9 am & to day the fall during the night was not visible when I got up – so we are not doing too badly after all. London has had 1 ft of snow.\n\nVisited the Saucets this afternoon \n\nThe relation of wife & husband here different to our idea where the woman is as good as the husband. Here she acknowledges the of protection that his strong frame & character casts over her & regards her life as belonging to him. His every \ncomfort\n wish is forestalled & every comfort anticipated. His paper is brought to him & his shoes are put down alongside of him. Never have I seen the many little attentions that the wife lavishes on her husband exceeded or equalled among us. \n\nThe daughters seem content to stay at home receive visitor serve & minister to their guests & are quite happy in that duty though they are for most part very intellectual & deeply educated. This afternoon is\n\npay & I have drawn 150 fr & this is to last me till I reach England. How I do not know as it will cost me 100 fr before I leave Gamaches.\n","126":"\n\nThis morning is cold & wind cuts through through while rain clouds burst about every half hour. \n\nThis morning receive an additional 50 men (22.35 ) & in evening – skipper delivers an address on future routine in Eng & repatriation schemes \n\nDr Courmontagne is away all this afternoon & has not returned by 8 pm so after 2 calls I retire to my & drink coffee with the ladies of the house.\n","127":"\n\nUsual routine in morning in rain mud & loafing around awaiting dinner time, so I leave camp about 10 am & come to my billet. Gamaches is out of bounds to our men as it is supposed that there is measles in town & 2 cases have been found in camp one of them of my lot. L’Cpl Cowley.\n\nI am undecided as to whether I shall return for dinner or not but finally do so & am immediately pounced upon as a member of a Ct to inquire into the breaking\n\n132\n\nof a shop window & the robbery therefrom of jewellery of Mr Leveau. When court opens we find there are 13 witnesses some of them French for whom Sgt Major S. R Duckworth has been sworn in as interpreter. Court proceedings last till 6 oclock & then only postponed till 7 which is made 8 as we have a concert party up & mess so postponed \n\nAfter Court finished I make arrangements to sleep in tomorrow morning & then to bed.\n","128":"\n\nArrangements for departure still hold good in spite of measles. Rain all day. Mention to household that I am not getting up & so they send breakfast up to me in bed. Finally get up at 10.30 & have several commissions to perform \n\nI collect 600 franc off Hutching & finally reach camp in neighbourhood of noon. \n\nIn afternoon I say good bye or adieu to all my friends – a somewhat painful task only relieved by the excellent wine that is supplied in honour of our last meeting not as a sign of gladness at my departure. \n\nI visit the Saucet & am entertained by Marie till Genevieve arrives & then sail off to the Maudint. Wine follows again an invitation to dinner which I refuse as I want to dine at Courmontagnes who have proved my\n\nstaunchest friends & have always taken me into the society of their best friends. I leave them about 11 pm. & promise to write some day & adjust a claim for them. \n\nArrived at billet I say farewell to my friends from Armentieres & then to bed leaving all my packing for Melhuish in the morning. I have tried to get Melhuish on this draft but unsuccessfully so he is only a late arrival\n","129":"\n\nThis is morn of departure & the wet weather seems likely to continue so much so that I pay a special visit to town to get my overcoat. Our contingent which is No 45 Quota falls in to time save Welbarn who is in town looking after our luggage & train leaves to time at 3 minutes to 12. \n\nJourney is at first in centre of a wide valley of the vividest green imaginable with a river that winds & unwinds itself in an almost unbelievable manner. Up from the valley rise hills on either side – bare of timber & cultivated forming a smooth & pleasant contrast with the forest clad summits – on both sides here for many is the exterior edges of two big forests. \n\nThen landscape changes to purely farming areas but the speed of train increases\n\n134\n\ntill our combination of cattle trucks moves at a rate resembling a train. Most of the country now resembles English countries in south the villages are uniformly situated in depths of valleys whether to escape winds or on account of water supply I do not know but there are few exceptions to this rule.\n\nThis route is new to me & I have not remembered the names of the stations but we have missed all hitherto well known names. The nearest station to the camp is Harfluer so we proceed about 5 miles further on as this is the usual military way of doing things. We detrain & then have to march back again to boy leading the way. \n\nWe go first to the old Conv. Camp for purpose of being deloused. Here rain has been heavy & everywhere you flounder through mud. As night has come on & lights are scase things are not pleasant but \nlike\n luckily we strike Creighton & he show us round let us wash in his room & finally gives us a supper of preserved fruit & tea in his room. \n\nOur quarters here are damnable after the comfort of a bed for the last 3 mos. However I have the knack of being able to sleep anyhow & anywhere so this not not inconvenience me much\n","130":"\n\nThis camp is for purpose of delousing everyone & organisation is very thorough\n\nClean underclothing is issued to everyone & while they are having a warm bath their clothes are disinfected. Every man who shows signs of chat marks is kept back for special treatment. The whole 1,000 men are put through in the one morning. The details of the scheme I did not master as all arrangements are in the hands of the Base Staff & the officers themselves go in for a warm bath\n\nAt 2 pm we shift camp to AIBD I previously went over in the morning & reserved a bed. Was told none is available but there are many here who recognise me & a bed is forthcoming. Here the company is again taken over & we have nothing to do save go on leave. I & Allen (39th Bn) decide to go in but first we must listen to a lecture by adjutant re leave etc. \n\nThere are no trams running now as there is a tram strike on. So having missed the 1.20 pm train we must walk. It is hot & sultry & we proceed very slowly but manage the trip in 65 minutes Arrived in Havre we take a cool draught of English beer in Hotel de la Gare & most refreshing I find it & now quite. Then we wander around town. \n\nAllan sends telegrams & I encounter old friends from Rouen & then I take Allen down to club where I met Ferguson. Together we visit a photographer & I get 6 pc. & then\n\n136\n\nto Tortoni where I see Egypt & thence on to Gabriels whence we go to stations & catch train home as the leave regulations seem to have put the wind up my friends\n","131":"\n\nI perform all my duties for to day that is I report to the Cpl in the company orderly room & am free for the day except that I must not leave camp till 2 pm which I obey by catching 1.25 train from a station nearly a mile away – Rouelles. \n\nI forgot to mention that yesterday we moved into a new camp & in consequence there is a lecture to day after which I walk in to Havre through the village of Rouelles I might mention here that these stations of Rouelles & Harfleur are quite a long distance from the village of that name. \n\nThe walk is agreeable & we go down not by the steps in Rue Montmorency but through the easy descent of Graville with its old Abbey(?) & its enormous Madonna in the cemetery & then wander round town – afternoon tea at Club a one time French house with a large circular lawn – plain & unencumbered wall Lawns where marked L. a quiet & calm retreat as the street is shut off by a high wall which in France marks so\n\noften a beauty spot even in the middle of area blocks of apparently continuous masonry. \n\nWe visit the Hotel Rue de la Comedie & Monics next to club where there is always dancing but take no part as we have only our heavy boots but the atmosphere is pleasant & some of the dancing is excellent.\n","132":"\n\nUsual hard work in the morning I superintend issue of clothing & find friends which means I get a full issue of all I require for nothing. \n\nIn afternoon visit Havre & take a walk along the sea coast past the beaches in St Andresse see pc a walk of exceptional interest. The beach is of stones as big as clenched fist & the hill is precipitous with a large notice telling people they must not walk up the though only a goat could do so & humans must keep to the paths \n\nOne magnificent building the Regatta Club & the modern residences seems to lack spaciousness in the grounds. One magnificent structure with a glass at end of a grotto & magnificent otherwise is absolutely spoilt by the bareness of the ground. \n","133":" at Club (5 fr)\n\ntonight & then take café at Des Fleurs & then walk out a good way then return to meet Wilson who is waiting for me at Tortonis but miss him. Bethinking me of an address where dancing is reserved for officers a kid of 18 11\/12 yrs who had nearly caused a murder case the previous day. \n\nI hurry on to find Wilson. I find myself in front of a big ship on slips in course of construction & finally get to place only to find that Wilson is not there. Hurrying back to town I meet a French officer entering a theatre & enter with him & find myself behind the scenes with a party in the middle of celebrating some ones birthday. This celebration mingled with professional dancing stunts. \n\nAfter many adventures & after climbing the Montmorency steps (255) with a of Havre a blackness illuminated by myriads of lights by the glare of shunting engines & finally arrive home about 4 am Strange to say I am not to be courtmartialled & I feel justified in ignoring these petty regulations. In fact since I have been in France I have had no official French leave & all that I have seen has been\n\non surreptitious leave. This night I would have stayed out all night if I could have found a congenial companion\n\n7-8-19\n\nI decide to pay a last visit to quant little Montivilliers & visited all places shown on p.c. The Bois a thickly wooded sunken road with a sheen on their newly shed leaves which embrace all shades of green is glorious. All the way on the right land dips into a gully cultivated on both sides & cut by a railway line on which few trains ever run perhaps for fear of destroying the rustic beauty of the place.\n","134":"\n\nOrders for embarkation remain unchanged. Baggage is collected at 9 am. – I ask for a coat from Scanlon but he is unable to issue it though he he QM so I ask a cpl Q.M. Coy & he at once gets me one\n\nAt 3 pm we fall in & are embarked on lorries. The men\n\n140\n\nhave lost their rifles – their equipment & now stand with new uniforms & a kit bag. All that marching is over & here are lorries which could never be found in the days of the war. \n\nAt 4.30 we arrive at Prince George a cross channel steamer built for 25 but only capable of doing 18 & on this trip 14 knots – We pass out through breakwater & look back at Havre glorified in a fading sun which sets tonight at 8.30 pm.\n\nI cannot feel that I am leaving France for good but that I shall see it again though perhaps not Le Havre. In this frame of mind I settle down to dinner & do not watch the shore fade away. The sea is like glass not a wave upon it only a ripple yet many continue to get sea sick I dont know how but they did. Sunset is a failure as there is too much low lying mists \n\nI am on duty on deck till 1 am & then when anchor is dropped turn in. We have anchored at the mouth of river having passed Isle of Wight when passing up the – Though night is clear all that one can see is a succession of lights & lighthouses. The old Boom looms up or rather the connecting Forts.\n","135":"\n\nAt 7 am we breakfast & up anchor. On this boat we pay for meals (3 fr each). There is little interesting in the somewhat flat shores I try to ascertain the name of a point & ask one of the crew & find that still I am unable to speak English as an Englishmen speaks it for his reply was Idenasay & it was only sometime afterwards that I released that this was not the name of the point but his inability to name it. \n\nWe berth alongside the big Olympic & are disembarked into a shed & when all assembled we marched round to another shed & are given a meal in return for a ration ticket which had been issued at gangway. After this we are reassembled & then put through a , given a train ration & entrained by embarkation staff & we are off.\n\nWe duly arrived at Codford & are shunted back to a siding but even this leaves us ½ hour march in the hot sun for weather is very sultry & our camp is No 3. which turns out to be tents only with 12 men to a bell tent. Administration here seems to be always the same high(?) order. \n\nWhether from the day or the night watch or the travelling I am very tired & turn in.\n","136":"\n\nUsual camp routine – inspection by Rosenthal which I do not attend as I \n\n142\n\nam Captain of the day but try to get leave for France & at leave office find an old Cpl of the Fieldmarshall & everything is fixed up but I must call for pass to morrow.\n","137":"\n\nCollect pass – big robberies of officers gear discovered this morning. My hat was stolen & then replaced. Otherwise I am intact. I pick up my pass & sail off with Thompson by afternoon train arriving in London at 7.45 pm after waiting nearly 2 hours at Westbury. \n\nAt Carlton Gardens find that leave officer has moved & we inquire at Regent Palace. These have no rooms for 3 mos but send us to a place Park House 16 & 17 Bayswater Tce, overlooking the Kensington Gardens & kept by an Austrian (once) named Hardy \n\nThe search for this place involves some effort as houses here are divided into sections & each section is numbered on its own. So that numbers may be running down & suddenly you get a heavy throwback & as usual London people are too stupid to explain anything & police we could not find. People are too respectable here perhaps. We find light refreshments nearby & then to bed.\n","138":"\n\nAs we are both going to France we set off for Horseferry road for our passports\n\nOn arrival at Horseferry I find that I can get leave for Venice Rome & Naples just as easily & do so \n\nAt sometime I try to collect the money that was due to me in Rouen on March 13 but was not paid as value of franc had decreased but found that even now it was impossible to draw it. \n\nThen aimed with letter from Horseferry visited War Office. A most formidable place. You enter write yourself a pass state nature of business & Room this is initialled by by a flunkey & you are handed over to a little girl who takes pass & conducts you to your room \n\nRoom 114 is out at 12.45 & will not resume his arduous labours till 2.30 pm so I am given my pass & walk out the way most people are going & being in uniform though wearing Australian hat am taken for staff & am allowed to leave while the all important pass rests in my pocket. \n\nOn arrival back at 2.30 I march in & surprise the police by informing them that I still have a pass & am told where room is but go straight & do not appear lost or ask questions & I can go then without the guide. The whole place swarms with youngsters & flunkeys\n\nAt 3.30 the overworked staff adjourns for tea. During the hour I put in the only person who did any work was the typist. The wonder is how anything is ever done in this asylum for Englands incompetents. Of course\n\n144\n\nafter this it was too late to go on with passport as all offices close at 4 \n\nIn evening we went to Chu Chin Chow now in 4th yr. & were disappointed. It contains all the of barbaric display & has natives from different parts of world.\n","139":"\n\nGet passport issued but not vise Thompson having wired to Codford decides it will be best & quickest to ride 300 miles in the train & bring the reply himself which turns out best as telegram does not arrive till 3 day after he has returned with the permission. \n\nI visit Museum, Art Gallery & generally wander over London into places that I have not seen, & dine at night at Gustaves who chat with me & drink cognac till 11.40 pm\n","140":"\n\nContinue my wanderings of London but forget exactly where. Get passport vise for nothing this usually costs 8\/- Thompson leaves for France. I dine Au Petit Riche & say farewell to Elise. Get NME approval & am told to report back \n","141":"\n\nBought shirt etc at Ordinance for £1 – no uniforms Saw funeral of Cavell – Band playing Chopin – visited army & Navy stores – Alcocks Kennedy – on way home met some French ladys on way to Elysee dance near Queens Rd. \nLond\n","142":"\n\nHave breakfast in bed always at this place – it is the only meal they serve & catch train back to camp. \n\nThe countryside is a glorious patch of enclosed fields with yellow buttercup lawns & flowering white hawthorn hedges whilst everywhere trickles small rivulets. \n\nI arrive at camp & no one knows anything of NME & I wish I had stayed in London as this trip has cost me 16\/- & a fatiguing walk of nearly 3 miles to camp. After dinner I wander up on the hill which rises steeply in rear of our quarters. \n\nThe whole side is covered with primrose & daisy & a small blue flower a glorious \ncoloured\n carpet of colour while as if this were not beautiful enough, every flower is connected with silvery threads of spiders forming a silken avenue stretching away to the setting sun. The scene below is beautiful. \n\nAll fields now covered by the young crops are carpets of vivid green below like a snake amongst the lovely winds with many a twist a little rivulet which somewhere perhaps becomes a river. The picturesque train (now normal length 10 carriages) in the distance with typical white steam – the hedges now irregular with over hanging boughs – here & there a thicket or copse and a plantation denser by its very isolation form a picture that one only expects to see in a book. \n\nAlthough it is 8.45 the sun\n\n146\n\nis a long way from setting though the drowsy tinkling of the little squares of sheep suggest that is time for repose. Along the river bank flourish the populas with knobby heads picture like, while overhead the lark thrills out his song.\n\nTo the left thro dense tree top glimpses can be seen of Wylie & it square church tower & the only blot on this beauteous landscape is the silent & abandoned camp beneath. There is another aspect & that is the economic. There is much waste land here not as France is the ground used to its full advantage.\n\n17-5-19 (Sat)\n\nNo new has so far arrived so I decide to finish my leave. Exchange a hat & start off for station – find that I have just missed the 10.36 & must wait till 1.5. Then arrive at Salisbury & porter takes charge of my gear, & I buy some pc to replace those I lost. Met a NZ & we drink several vermouths the only drinks I have on this leave, arrive in London & find my room kept.\n\n18-5-19 (Sun)\n\nIntended to go to Brighton but do not rise till nearly 3 pm & then not knowing where to go I ask a policeman & he puts me on to Hampton Court As this is Sunday the day\n\nwhen all the old trees in the avenue that is ¾ mile long thro Busby Park are all in bloom all the world is going there & after waiting an hour for a bus with standing room on it I take Tube to Shepherds Bush where no bush exists & then tram.\n\nI enter into the Court itself & pass through the building See guide – then go thro the room Then see the Great vine 5 ft in girth at its root & 4 ft 7 in 1 ft above ground Then the pretty Italian garden with its arches in shrub & in centre its low fountain & at far end its Venus hidden grotto. Then I go along the three grand avenues all opening from Kings window and edges with magnificent – a quicker growing tree than beech. \n\nThence I pass along to Chestnut Avenue & walk along to Teddington & then retrace my steps & walk to Knightsbridge (2 Kingston) & meet a Socialists who yarns with me & tells me to call in at Socialist Club Fitzroy Square & ask for Mr Keel & say Hayes sent me. These men I found for the most part to be idealists with impracticable philosophical ideas but a few of them were bomb throwers Hegarty.\n\nFinally reach home having had nothing to eat since breakfast & having walk about 8 miles or more\n\n19-5-19 (Mon)\n\nVisited Lady Harrowby & make arrangements to stay at Manor House Surrey \n\nMrs Rutson\n\n148\n\none of the Buxtons of South African fame & Miss Davison & Bartlett Matthews give me some addresses at Paris. Arrange that I set out to morrow. I then visit many places & people in London, the order of which I have now (28\/5\/19) forgotten. \n\nI dine tonight at Chinese café & find it very agreeable to be eating bamboo again. The meal they give is one of the biggest in London. \n\nThe previous evenings I have dined at the Restaurant Espagnol 27 Dean St. Soho Sq.W. Bill Coverta 3 Tortilla 1\/6 Staeck 1\/9 Fritto 6 Compot 9 Coffee 4d = 5\/1. Previous evening Coverta 3 Sopa 6 Filet Plaice 1\/6 Cocido 2\/6 Compot 9 Coffee 4 =","143":" In evening I visit Socialist Club & am present at a big fire in Tottenham Ct Road.\n","144":"\n\nVisit tailors in Savile Row & find their prices for uniform is 11 to 12 gns far beyond my purse & then catch 1.15 train to Weybridge which is about 2 ½ miles from the Manor House but is nearest station I am met by a South African officer who is staying there & driven in a little cart with a small wee pony just like a big dog.\n\nWe pass Brooklands & finally reach the House an old royal hunting lodge used by Ed.II & then presented by James I to his Queen Anne of Denmark who enlarged it. Much of the original building is said to remain but I doubt it. The grounds are beautifully\n\nlaid out so enraptured am I that I have taken plans & intend to copy it if I can when I get home. \n\nThe back with its formal garden & rectangular paths, square plots of grass & ornamental yew flanked by hedges & yew gateways is very pretty whilst in the centre a huge hornbeam gives a lovely shade where afternoon tea is enjoyable below is a terrace & then lower still the tennis court flanked by 6 scotch firs 300 yrs old & then the river or rather back water & in the distance the far stretching field though not too far for Surrey is always hedged in\n\nOn left is a wilderness full of Rhodendron & azaeleas in full bloom which has completely caught my fancy for in a small space it has very long walk & 4 rustic bridges over a lake full of water lilies. The very fact that it has gone wild adds to its beauty in my eyes. \n\nIn the afternoon Miss Heaton Ellis & Miss come over & we start off with tennis for which I am very much handicapped having no slacks. Then follows afternoon tea in the shade of the thick hornbeam in the formal garden & the cool breeze that comes across while we recline in easy cane chairs reminds me of our cool breezes\n\nThe weather is delightful here. Bright sunshine & cool breezes, hot if you are working but pleasant if you are loafing around. \n\nTonight there is a dance & although I do not intend to dance I go & meet\n\n150\n\nthere a Miss Stoops daughter of a Judge & one of the knobs of the neighbour . She is pretty-ill-mannered & swollen with ideas of her own importance. The Pinches are girls of the Australian type while Miss Ellis is coarse physically & mentally but seems to has caught & landed a neighbour named Lt Cpl Barnes DSO at present at Foxholm\n\nThe rooms have glorious beds with sheets as soft as down. Electric legal & reading light with a little book case attached A bay window open over a clump of lilac in bloom & a small walled garden with arches in walls. Electric bell is at side of bed.\n","145":"\n\nBreakfast at 9 for which I am late due to the big plunge bath near my door. Style of service is help yourself though there is no fire to keep plates warm. Boiled egg, fish or fish puree, bacon form usual menu with coffee or tea & jams (often black currant). \n\nMrs Rutson has gone to London to day & I loaf round & bask in the sunshine & examine the wilderness with its little lawns & flower bed & wild overgrown paths of lilac & rose. \n\nIn afternoon we drive over to Pinches in the dog cart & after inquiring of all & sundry including tradesmen who do not know the Pinches though they have resided in the same house for 20 yrs – a usual example of English intelligence – we find Louise & play tennis in middle\n\nof which I have to in pony & go to Byfleet to meet Mrs Rutson & finally dine at 8 pm & spend evening in the library.\n","146":"\n\nMrs Rutson goes to London again but leaves Harris & myself a job of falling trees as we are going on the job we find several pieces of Italian marble evidently a pillar & groping around find all the pieces & erect the pillar\n\nWhile working at trees the old housekeeper Cruickshank, a scotswoman who has already taken a fancy to me because I am so jovial & cheery & decides I must be Scotch why even my name is scotch & all my good points are Scotch. She speaks of \nour\n folks & their habits so different from the English etc. She bring lemon drink & retails all the ghosts she has seen in the house the jester (responsible for rich panelling) Henry VIII, , Queen Anne, & tells us she has actually seen the ghost of a woman in room next to mine but I do not see or hear her during my sojourn here.\n\nIn afternoon we row up the river Wey to Mrs Horthams who takes us over the gardens of the Royal Horticultural Society. These gardens present a beautiful display of every possible kind of flower the Rhodendrons & azaleas being particularly fine but taken as a whole garden is not beautiful I prefer Mrs Rutsons wilderness. The river is pretty but I prefer the wildness of the Lane Cove\n\n152\n\nto this insipid & regular beauty.\n\nWe return early & play tennis with the Pinches & then dine about 8 pm, egg & – liver with puree & – prunes etc – beer.\n","147":"\n\nHarris goes to station to meet Miss Wade a pretty doll who might have been a woman if she had lived in any other country than England & had allowed her natural temperament to develop & not be warped by the bonds of conservatives & reticence. \n\nI spent the morning making plans of the wilderness. In afternoon Coller, Ellis & another nurse turn up & play tennis. I take walk down the river to the mill rail but pass no place more beautiful than the Manor House. \n\nNight we \nplay cards\n row up the river with Mrs Rutson & Miss Wade.\n","148":"\n\nYarn on lawn with Miss Wade – Weather is delightful warm with a cool breeze & air languid. In the afternoon some S. African friends arrive & I row them up the river to the currents that are as swift that navigation ends especially with a girl steering. The river is pretty or rather it is only a creek with a strong current.\n\nAt night we play a game of cards called or some such name & then off to our rooms where I write till 1.2\n\n"}}