{"Document Name":{"0":"Diary_0307","1":"Diary_0307","2":"Diary_0307","3":"Diary_0307","4":"Diary_0307","5":"Diary_0307","6":"Diary_0307","7":"Diary_0307","8":"Diary_0307","9":"Diary_0307","10":"Diary_0307","11":"Diary_0307","12":"Diary_0307","13":"Diary_0307","14":"Diary_0307","15":"Diary_0307","16":"Diary_0307","17":"Diary_0307","18":"Diary_0307","19":"Diary_0307","20":"Diary_0307","21":"Diary_0307","22":"Diary_0307","23":"Diary_0307","24":"Diary_0307","25":"Diary_0307","26":"Diary_0307","27":"Diary_0307","28":"Diary_0307","29":"Diary_0307","30":"Diary_0307","31":"Diary_0307","32":"Diary_0307","33":"Diary_0307","34":"Diary_0307","35":"Diary_0307","36":"Diary_0307","37":"Diary_0307","38":"Diary_0307","39":"Diary_0307","40":"Diary_0307","41":"Diary_0307","42":"Diary_0307","43":"Diary_0307","44":"Diary_0307","45":"Diary_0307","46":"Diary_0307","47":"Diary_0307","48":"Diary_0307","49":"Diary_0307","50":"Diary_0307","51":"Diary_0307","52":"Diary_0307","53":"Diary_0307","54":"Diary_0307","55":"Diary_0307","56":"Diary_0307","57":"Diary_0307","58":"Diary_0307","59":"Diary_0307","60":"Diary_0307","61":"Diary_0307","62":"Diary_0307","63":"Diary_0307","64":"Diary_0307","65":"Diary_0307","66":"Diary_0307","67":"Diary_0307","68":"Diary_0307","69":"Diary_0307","70":"Diary_0307","71":"Diary_0307","72":"Diary_0307","73":"Diary_0307","74":"Diary_0307","75":"Diary_0307","76":"Diary_0307","77":"Diary_0307","78":"Diary_0307","79":"Diary_0307","80":"Diary_0307","81":"Diary_0307","82":"Diary_0307","83":"Diary_0307","84":"Diary_0307","85":"Diary_0307","86":"Diary_0307","87":"Diary_0307","88":"Diary_0307","89":"Diary_0307","90":"Diary_0307","91":"Diary_0307","92":"Diary_0307","93":"Diary_0307","94":"Diary_0307","95":"Diary_0307","96":"Diary_0307","97":"Diary_0307","98":"Diary_0307"},"Date":{"0":"unknown","1":1458.0,"2":1459.0,"3":1460.0,"4":1461.0,"5":1462.0,"6":1463.0,"7":1464.0,"8":1465.0,"9":1466.0,"10":1467.0,"11":1468.0,"12":1469.0,"13":1470.0,"14":1471.0,"15":1472.0,"16":1473.0,"17":1484.0,"18":1485.0,"19":1486.0,"20":1487.0,"21":1488.0,"22":1489.0,"23":1490.0,"24":1491.0,"25":1492.0,"26":1493.0,"27":1494.0,"28":1495.0,"29":1496.0,"30":1497.0,"31":1498.0,"32":1499.0,"33":1500.0,"34":1501.0,"35":1502.0,"36":1503.0,"37":1504.0,"38":1505.0,"39":1506.0,"40":1513.0,"41":1514.0,"42":1515.0,"43":1516.0,"44":1517.0,"45":1518.0,"46":1519.0,"47":1520.0,"48":1522.0,"49":1523.0,"50":1524.0,"51":1525.0,"52":1526.0,"53":1527.0,"54":1528.0,"55":1529.0,"56":1530.0,"57":1531.0,"58":1532.0,"59":1533.0,"60":1534.0,"61":1535.0,"62":1536.0,"63":1537.0,"64":1538.0,"65":1539.0,"66":1540.0,"67":1541.0,"68":1542.0,"69":1543.0,"70":1544.0,"71":1545.0,"72":1546.0,"73":1547.0,"74":1550.0,"75":1551.0,"76":1552.0,"77":1553.0,"78":1554.0,"79":1555.0,"80":1556.0,"81":1557.0,"82":1558.0,"83":1559.0,"84":1560.0,"85":1561.0,"86":1562.0,"87":1563.0,"88":1564.0,"89":1565.0,"90":1566.0,"91":1567.0,"92":1568.0,"93":1569.0,"94":1570.0,"95":1571.0,"96":1572.0,"97":1573.0,"98":1574.0},"Entry":{"0":"\n\n1.\n\nA sunny windy day, to the high hill nearby, for a walk. A clear blue sky, white clouds like great galleons sailing across, their shadows richly chequering the small hill, meadows and low valleys.\n\nEvening: the afternoon with Frank S. to Courcelette, then to the third estaminet for Café et Curacao, a continuing of the walk, then back to second estaminet and tea, savoury omelette, chips, Bread, Butter and Apple Jelly. Met there Roy F., Arthur T. and Charlie. A long yarning, with Arthur, of models generally, or Greek and Aegyptian legend, of the beauty of the Venus de Milo and de Medici – opposed to the David of Michael Angelo, the old argumenting of the two beauties, of the woman, of the man. So to the third est. – all five of us with two men of the Transport, café et curacao, again to the second, Red wine and sugar.\n\nThen in the clear cold night a quick steady walking to Billets, so to bed, reading \"The Shadow Line\".\n\nMail – T.L.S. – the first receiving of it on a Sunday.\n\nDecember 2, 3\n\nMet early in the afternoon, three of the 1st Pioneers, they anxious for a game, we to arrange with Maj. Anderson, of A. Coy. We had café et curacao with them and a while yarning.\n\n","1":"\n\nToday B. Section have opened up alongside Billet, a small D.R.S.\n","2":"\n\n\"The Shadow Line\", Conrad – \"The creeping paralysis of hopeless outlook\", and \"Jude the Obscure\", Hardy, \"The Hell of conscious failure\".\n","3":"\n\nToby evacuated - ? Dyp., only yesterday he and Syd arrived back with the unit from Renescure, there guarding salvaged marquees, which afterwards turned out as belonging to the 6th Field.\n","4":"\n\n5.\n\nBlue H. from Boulogne brought last night copy of Sunday Times, news in it confirmed of a retreat before Cambrai and a losing to the Boche of 4000 prisoners. The Scotties took the new ground, and on relief by Tommies, they unable to withstand Boche counter attacks. After the demonstrating of last April in that sector, it should have been quite obvious to H.Qtrs. that Tommy regiments alone could never hold the ground. The General opinion here – expressed in, \"serve them bloody well right!\"\n\nThe Sunday Times correspondent commenting says –\n\n\".. it is believed that such of the guns which had to be abandoned under pressure of the first onrush were blown up, so that our proud claim that the Germans have not taken a single gun in tact since the beginning of the Somme offensive probably still holds good …\n\n- simply demonstrating the Tommies inability to live in worship of anything but trajection – and their need of emitting a shrill calling of attention to a minor and inconsequential boasting.\n\n6.\n\nYesterday Major Frizelle died of his wounds, received at the Menin Road Battles of Oct. Requiescat in Pace.\n","5":"\n\n7.\n\nA finishing of the ‘harness’ job – so back this afternoon to parades: working then – carrying to R.S. ‘fire’ buckets water filled.\n\n \n","6":"\n","7":"\n\nTonight with Frank D. to Pont de Brique to Salvation Army Soldiers’ Hostel – the best and most appreciated hut I’ve come across, there two charming French women serving tea – P & M chips well fried, bread and butter, Bread pudding and coffee – one Franc, and papers galore – Sketch, Bystander, Graphic and London News and Spectators and \"Land and Waters\". Brought home to Billet copy of L. & W. with an essay of Symons \"Venice\".\n\nA clean clear cold night & a high bowl of rich blue finely and brilliantly powdered with star points.\n\nCartoons on the Door today – Brennan – \"How about another trip to Boulogne – etc. etc., Kirky?\" and Radis – \"Likely to depart at any time\".\n\nA rumour of Kirky’s leaving the unit – when we’ll lose the last of our good men.\n","8":"\n\n Arrived","9":"\n\nPosted today to Mrs. H. \"Second Diary\" and \"Philip the King\". Wrote yesterday to T.B.C. for Padraic Pearse’s 2nd vol. of works and \"Songs before Sunrise\" in pocket edition by Heineman.\n\nDecember 4, 5\n\n10.\n\nAt the hostel tonight saw announcement of new Cuala book of W.B. Yeats – \"The Wild Swans at Coole\" – the volume including \"The Hawk’s Well\" originally pub. in \"To-Day\". Will write for this tomorrow. No mail today.\n\nTwo changes, Blue H. trans. to A. Sect. Bearers, and Eric G. and Jack M. from B. Bearers to B. Tent Subdivision.\n\nDecember 5\n","10":"\n\nA morning’s fatigue about the R.O. early finished, read awhile some of Masefield’s Prose Anthology and so to dinner.\n\nAfternoon a match, union against 21st M.G. Coy. – they pulling up a good game but losing to us – 11-Nil. With Clarrie and Dick H., Joe G. to Soldiers Hostel, Pont de Brique and tea – eggs, sausages, bread & tea, so to second hostel, pudding and coffee, and still here – in the Reading Room writing after an evening of illustrated papers.\n\n12.\n\nRodin died early last month, so he joins immortally Phidias, Donatello and Michael Angelo\n\nDecember 5\n\n13.\n\nArrived mail today Drinkwater’s \"Prose Papers\". Parcelled for sending home \"Twinkletoes\" and Vernide’s War Poems, worth keeping for poem, To an English Sheep Dog.\n\n14.\n\nBack at Billets. A brisk walk back with Clarrie, the night clearly brilliant, full of a heavy frost, the stars high and wounderful. Reaching the crest of our hill, looking over Picardy, great patchings of deep and deeper shadows under the rich night sky – the guns lightning flickering coldly on the horizon, and we yarning of typists, of suburbia, and of urbanity, tellings of pleasant memories of daily living, little episodes made rich by time.\n\nTurning in, to cut the pages of \"Prose Papers\".\n\nBlue D. remembers by the richness of wine, a school reading of \"Twelfth Night\", and of he reading and being asked to explain certain lines, embarrassed utterly, he delightfully confessed as being \"too young to understand them!\"\n\nPosted letter for new Cuala book of W.B. Yeats.\n\nDecember 6, 7\n\n15.\n\nIn the third estaminet of Courcelette, by the big warm open fire awaiting the boiling of coffee. There are more little children about this tiny village’s streets today I’ve seen. By myself – with Brooke and Drinkwater’s Prose Papers. The estaminet’s one room is quiet today – last time it was a merry fire’s light and seven of us drinking and all talking.\n\nNow in the second estaminet, after a tea of bread, Butter and Coffee, after a full pleasant reading of two of Drinkwater’s Prose Papers, & an answering of Miss Edward’s letter of Sept. 3.\n\nSo now the road again for Quehen Isques.\n\n16.\n\nToday the Referendum vote taken, a general voting I think of ‘Yes’.\n\nDecember 7\n\n16.\n\nMail: Drinkwater’s ‘Tides’ and Phillip’s \"Christ in Hades\". Tides a Press Book, the first from the Beaumont Press of Charing Cross Road, the format and manner of the Cuala books, but not to the exquisite manner of that perfect press.\n\nA dull day: to Hardelot with Frank D.\n\nDecember 8, 9\n\n17.\n\nPosted today two book parcels – Vernide and Bourke to home, and Phillips, Tagore and Roberts to Aunt Louie, also letter to Bernice, written day before yesterday in the Courcelette estaminet. Read on receiving introduction by Lewis Hind to Christ in Hades, and at night the compleat poem.\n\nNo mail.\n\nMatch against 1st Batt. this afternoon, 11-5 against us.\n\nA grey day without sun.\n\n18.\n\nRumour speaks of another damned impertinent kit inspection parade – the third of late.\n\nDecember 9\n\n19.\n\nIn the big stone stable where our billet is, a motor garage about 20’ x 40’ – for a brazier fire of cheerfulness we have a patent kerosene lamp – as much use as the sun reflections of an outside fire on glass windows.\n\nAround this lamp a few nights back were grouped half a dozen of us when Reddy – Gotha Reddy – joined us. Les F. was one of the half dozen about the lamp, and R. seized the golden opportunity of imparting to him new material for his autobiography Les is by report known to be writing. So the entertainments of the evening were a series of personal confessions – all with the crude background of the Militarie ‘clink’, escapades that lodged R. there, from the alpha to the omega were minutely outlined – defended and explained.\n\nR. was once crucified and his telling of it was infinitely pathetic, and his descriptions blasphemously impressionistic. \"… an’ there was I …\" Slowly the brutally thick arms were raised from heavily hanging by his side, till they were outstretched by his shoulders, and as his head drooped to the side, \"poor old Jesus Christ!\"\n\nHis tellings before had been ridiculous and vainly exaggerated, but for his finale, he created his atmosphere, where the cruelty of the punishment was well brought out. Thomas Bourke would have appreciated R. now as he loves to be appreciated. It was on the march from Renescure to Ecuire R. charged Les with the writing \"a book about me\" – \"Gotha Reddy – his experiences\" chimed in Johnny, and R. agreed.\n\nDecember 9\n\nLes had taken his hat off – and his black long hair was over his forehead, he was like a Shannon drawing of W.B. Yeats. \"D’you know what you remind me of? – like some bloody orfan!\" So R. shewed his appreciation for the beauty of Les that day.\n\n20.\n\nNo afternoon parade, a dull grey misting afternoon, cold and sad. Read Drinkwater’s \"Tides\" and Squire’s \"Twelve Poems\" & \"The Poet and his Vision\". \"Prose Papers’ is a goodly and rich book of rare prose. Before parade this morning read Keats, \"I stood tiptoe upon a little hill\" – a first reading of Keats for some while.\n\nMail: John Hassals book of his correspondence course for £15.15.0, for a while seriously inclined towards taking it up but winter is no time for serious attempting of drawing and the fee is rather high for a pay of 40 F. fortnightly.\n\nWrote to Beautmont acknowledging receiving of \"Tides\" and asking again for list of Cuala, Vale and Moreland Press books.\n\nRumour is of our leaving here next Tuesday, Amentieres front relieving 5th and 3rd Divisions.\n","11":"\n\n21.\n\nA full reading of \"Chastelard\" and I’ve been carrying it in my pack since Ecuire, all unknowing of its rich loveliness. Tonight I discover Swinburne and I have read passionately beauty I’ve just come across, singing elation of loveliness.\n\nDecember 10\n\n22.\n\nA march that took us to the close outskirts of Pont de Brique. In the afternoon out with sketch book to the high hill overlooking Pont de Brique – where Harry D. and self spent a long afternoon last summer twelve months. Waiting by the crossing, a train of Chinese labour passing up, each window of carriage and open doors of trucks framing crowding faces, faces of the east, of even yellow-walnut complexioning, wearing strange skull caps of close fitting brown, low over the forehead, and with long ear flaps, some wore the forehead piece turned back, and the ear pieces loose, revealing three tuft linings of a squirrel-like fur.\n\nMail: T.L.S. Dec. 6, a barren dull paper. Masefield’s \"The Old Front Line\" publishing today. Read Mary Beaton’s scene with Chastelard.\n\nA grey cold day. Tonight the sharp bite of frost in the air, a clear deep night.\n","12":"\n\n23.\n\nToday Paddy Burk, looking through Hassals book, and remarking on the Fish drawing, mentioned Beardsley’s name as the greatest of all moderns, so a long yarning opened up of Beardsley and of Wilde, and of the Irish Renaissance and W.B. Yeats. Knowing people of the Abbey Theatre, and knowing Synge and others, an interesting facinating yarning. Must read Synge.\n","13":"\n\n24.\n\nIn the afternoon leave to Boulogne, so to Wimereux to the second for a bath. Sister Farquahar on night duty, so again unable to see her, back to Quehen early, and at 7 a unit dinner. Tommy surpassed himself and the result made us all merrie.\n\nNow in the billet a hot argumenting of conscription and reinforcements, an arguing running in a circle, all in the hands of the 18 thousand editions. They hot for conscription, to get over here men who are shirking, one offers his opinion, that the first call to war will find all decent men ready: he heard ‘the call’ late this year.\n\nIt would be interesting to find and collect the real and true reasons and motives of the men of the first contingents, ‘from a sense of duty’, would not run first, nor second. The decision for a new experience, for sheer great adventure and its novelty, and the apparent prospects of a rich freedom of wide old worlds.\n\nMail: from the Anzac Bulletin a return of the \"I say Digger\" sketch, and notification of the \"Dear Liza\" appearing in the next week’s Bulletin. \"To-Day\" not with the mail so disappointed of a good hour’s reading.\n\n25.\n\nBoulogne: a city of Officers in full elaborate dress, and of their exclusive eating houses, of W.A.A.K’s on the insinuating arms of Kharkied hospital youths; and of slim dark blue clad V.A.D’s aesthetically posed, sipping coffee with callow souls: of secret blind apartments, of scent, cheap champagne: a city of nympths of the sidelong glances, and of black veiled mourning women, joy rides in staff cars, and long convoys of silently lying men in Ambulance cars.\n\nBed to read J. Drinkwater, \"Tides\" or \"Prose Papers\".\n\nDecember 12\n\n26.\n\nA frost last night just sufficient to half dry hard the day’s mud about the roadway. A morning’s fatigue, clearing from by the Dispensary tent a heap of straw, burnt from the R.O., later to a yarning of old stunts.\n\nNow in the V.D. Tent – which Namby and Buckholz are away at Boulogne. Frank D. has been sketching here, now leaves for tea.\n\nMail, December copy of To-Day. Reading \"Elissa\", R. Haggard. Later: somehow all the old enjoyment of Rider Haggard’s books of imagination gone, though I would enjoy \"Cleopatra\" again, and \"The Ghost Kings\". December ‘To-Day’ rich with a poem of William Watson’s, Ernest Rhys, \"Some Dead Poets: A Causerie\", a most idle sing-song of meetings with the great: such an essay as Drinkwater dissects in his Art and the Artist.\n\nAn idle day: and I’ve not written to Mother for too long a while.\n\nRumour tells of our moving up again on Friday or Saturday to the old area, about Ypres and our opening there a D.R.S.\n\nToday, over the low valleys noise of big guns firing.\n\nDecember 13\n\n27.\n\n(a) \"You think I’m an impressionist?\"\n\n(b) \"You were such a stickler for truth.\"\n\n(a) \"Truth? Truth?\". He laughed harshly. \"Honest work? That means staring at a thing till you’re dazed and colour blind. That means,\" he grew excited, waving his thin hands, \"seeing the outside, the mere rind and letting the great thing escape\".\n\nFrom \"The Face of Clay\" by H.A. Vachell, and a one side statement of the impressionistic school.\n\n28.\n\nA route march through Courcelette full (?) packs up. Delivered up to Frank S. books \"Tides\", \"Prose Papers\", Diary IV and sketch book I, \"Twelve Poems\" and \"Lily of Malud\", \"Chastelard\". Reading this afternoon \"The Face of Clay\".\n\nNo mail today: expecting two overdue parcels from T.B.C.\n\nA compleated reading of \"Face of Clay\".\n\n\"I have met men who regarded the sufferings of Christ upon the Cross as inspiring not the worship of the world, but the masterpieces of the Renaissance.\"\n\nThe chapter heading fine with the back, and richly fine.\n\nDecember 14\n\n29.\n\nYoung Marley, in our squad and wounded at Bullecourt when Scotty Leask was killed, died in the transport half way to Australia. R.I.P.\n\n30.\n\nEvening: now all loading wagons and limbers compleated, and all tents down, packed and wagoned. A walk to the hill with Clarrie and Frank S. Fine rain today has ended but the skies are full of it, in the clear evening light, the land of Picardie rich with the colours of Syd Long, seen through a mist of hanging haze.\n\nTomorrow we leave here for a village the other side of Desvres, a route march of near 18 miles, then to entrain – or only after another marching of 8 miles, for the North, for a station near Bailleul.\n\nAll my books distributed – carrying only Brooke’s \"Selected Poems\" and Dec. ‘To-Day’. We lose the Transport for 5 days. Bob S., Caffin and Eric G. back today from Paris leave.\n\n31.\n\nLast entry at Quehen, turning in. Ready almost for the beginning of march, feet bandaged and boots dried and powdered inside, sleeping full ‘troops fashion’ and kit ?, Blanket, 1 shirt, shaving outfit and greatcoat, 1 pr. sox, sandwiches cut from rations.\n\nSenlecques\n\nDecember 15\n\n32. \n\nWe are in wounderful luck: A. Tent subdivision are billeted, six of us with a most charming & sweet old dame: already we are fine friends – she received us with smiles and café. Australians have been twice billeted with her before – it is evident from her manner, her charm has well told, she is a sweet featured old dame, rosy cheeked and all the little graces of a good & long life are here: she wears a white coif – spotless linen in multi-regular folds & of little graces of embroideries. We have had tea in her living room – now she and six of us are in cane chairs grouped round the warm fire – in its days blue-tiled recess. Madame has no sons at the war but many nephews, these – their photographs grouped in honour around the clock – she has sweetly shown us.\n\nDear women and their warr stories, of inconsequential mementoes, and photographs. We have told her our sincere admiration for the Poster – she has honoured us by associating our names with the winning back of much territory.\n\nDecember 15\n\nTomorrow when we leave, men of the 3rd Division arrive here – their third resting in this area. May those billeted here by those who remember their nationality.\n\n33.\n\nThe march a wounderful success, a perfect day, and an enjoyed march. Passing Samur by one mile, a lorry took our packs, a march of singing progression, loved melodies & old songs, full choruses, and Gyppo band-singing. Marching by Blue H., he the song leader: his voice full and rich of harmony, and full of mood. The masterpiece of the march,\n\nI feel, I feel, I feel, I feel,\n\nI feel like the morning star,\n\nI feel, I feel, I feel, I feel\n\nI feel like the morning star\"\n\n\"\n\n\"\n\n\"\n\n\"\n\nMy Mother told me,\n\nThat she would buy me,\n\nA rubber dollie,\n\nIf I were good:\n\nBut when I told her,\n\nI was a soldier,\n\nShe wouldn’t buy me\n\nA rubber doll.\n\nTomorrow the roads again.\n\nWavrans\n\nDecember 16\n\n34.\n\nAfter-entry, 32.\n\nAnd early this morning, waking us at 6.30 - because it was so greatly cold – she brought us café, in the candlelight her sweet face was smiling as she poured it to six little cups on a small tray, we sitting up fresh from sleep, even so early she was wearing her snowy cap, its white stiff bow compleating the framing of her face, saying good-bye she blessed us with her line, a blessing worth the full treasuring.\n\n35.\n\nAt Wavrans, after a full morning’s marching, also here close about 1st, 3rd and 4th Battalions. Saw for a while Alek Wilson and Malcolm Miller of 4th Details. A lovely morning – the early afternoon cloudy skies, and faint falling of pellety snow, now the sun is out of the sky the night will see a heavy fall. Again for Billets we’re lucky – eight of us in a small luxuriously straw’d stable. Madame has invited us to share the fire of her kitchen, so the whole eight of us are in possession.\n\nThe rumour has been all the afternoon of reveille at 2 a.m. for marching to entrain, now word of a 7 a.m. breakfast.\n\nDecember 17, 18, 19\n\n36.\n\nWisenes – Hommes – 40, Chevaux (en long) – 8 – Bailleus\n\nDranoutre\n\nDecember 18\n\n37.\n\nA mail today from ‘Aunt Louie’ – a Jersey cake and cigarettes, & from the T.B.C. invoices of B. Const. and Georgian Poetry 1916-1917.\n\nHere B. and C. Sections running a D.R.S.: A. a Dressing Room for local sick parades: so far no definite duties set, nor any instructions for work. The whole of A. Section in a long service hut – made cosy with the warmth and colour of two full size braziers.\n\nDecember 19\n\n38.\n\nAll night long the guns loud: clear lovely night and this morning a heavy frost. Duty in the D.R. Dressings from small sick parade. Bill F. joined the N.S. for first duty since transfer at Devonshire Camp.\n\n39.\n\nAn afternoon half spent at the Y.M. opposite, by the warm fire, watching and studying the beauty of faces: of Australians & N. Zealanders. One of the 1st Engineers – or the 1st Coy. – medium short, full built and still brown faced from the summer: all his features wounderfully clean cut and fine: his eyes large and brilliantly blue, and long lashed, his neck thick and its muscles lithe in fine flesh. The N.Z. hat with its narrow rim, waving from its lying folded in a kit, full of decorative lines, & a fine headpiece to a typical N.Z. face. Met George E. there: for a while yarning, Gen. Birmingham and musick.\n\n40.\n\nMail three letters from Mother, Gerald in London when she last heard from him, suffering from nerves and homesick.\n\nFrom Mrs Hadley – Dec. 12, Conder has delivered her the IIIrd Diary – and other books have arrived: evidently Alan Seeger and Certain Noh Plays.\n\nStrange questioning – \"Does any one ever tell you your writing is \nrather\n difficult to read – I often think it a puzzler and have to guess a lot\". conder has been well sized up: \"I thought he was a very nice boy, he seems a very easy going fellow, quite ready for anything that turns up.\" He is at Oxford – and \"we shall be seeing him again\". \"I am sending you a cake.\" !!!\n\nDecember 19\n\n41.\n\nBooks from Frank S., so library compleat again.\n\nExpecting from T.B.C. B. Construction, Georgian Poetry 1916-17: Padraic Pearse Collected Works, 2nd Vol.: The Wild Swans at Coole, Cuala Press: and Swinburne’s \"Songs Before Sunrise\".\n\nDecember 20\n\n42.\n\nThe frost of last night the heaviest of two winters: and all day long the grey cold mists have further whitened the trees and doubly hardened the ground. Tonight I have written to Mother: still I owe letters – about half a dozen: they can wait.\n\nToday C. Section to the 1st C.C.S.: Les, Johnny, Bert, Buckholz and Namby up to the D.R.S. Billy F. and self running dressing room for local parades and casualties: a good soft snap of a job.\n\nPay’d today: drew 40 F., pay’d certain debt. No mail.\n\nFinished the reading of \"Blinds Down\". George E. in today leaves me promised book of the Poet Ghorki’s \"Heart Ache\".\n\nTonight to read J.C. Squire.\n\nDecember 20, 21, 22\n\n43.\n\nThe Boche by drop’ed notes in Bailleau promises his presence there for Christmas ? All day the guns have been quiet.\n\nDecember 21\n\n44.\n\nAnother day of close heavy white Frost, Mists.\n\nMail: Batsfords Elementry Building Construction, and half an afternoon reading confirms the vague idea of slackness. Fagging now will mean double it did a year ago, and its damn dry stuff to write the least of it.\n\nDecember 22\n\n45.\n\nMail: a bonzer letter from Ron – in hospital in Cairo, dated","14":"\n\nHomesick? Jove, Ron so am I! What a bonzer time we’d have, those few nights meeting in Cairo, by the Egyptian Bar, just for one more of them. And all the others are dead, oh Ron, keep alive and live through this damned war.\n\nCatalogue from C.W. Beautmonts and a writing at once for 1st edition of J.E. Flecker’s \"Coll. Poems\" and a setting aside of James Stephens \"Five New Poems\", 1913, 8\/6\n\nT.B.C. arrives, \"Georgian Poetry, 1916-1917\" and Christmas T.L.S. Letter from Ron gem of day.\n\nDecember 23, 24\n\n46.\n\nIn the Anzac Bulletin, Dec. 14 – the only mail today – the sketch I sent in from Belgian Battery Corner just before we were relieved.\n\nSent in today the rejected of Anzac Bulletin – \"I say Digger\" – to the new A.I.F. paper coming out – \"Aussy\".\n\nTo the pictures tonight with Frank S., Bob S., and Eric G. So! So!\n\n47.\n\nThere’s the rumour about that conscription has so far in the counting failed – by a vote of 200,000 against. Oh God make this a lie. If it is turned down this year as last year, where is the honour shewn to our dead, the poor lonely ghosts of the men who were all Australian. If the country we love denies us. Damn their dirty mean minds, and their littleness. The Dead will give us more honour than our living.\n\nDecember 24\n\n48.\n\nSeemingly the NO vote will head the poll.\n\nChristmas Eve, well its under better rulings than last year – or the year before for that matter: though Egypt’s certainly more cheery and exciting.\n\nThere’s been more preparations than ever before: all the afternoon I’ve been tying small pieces of doubly cyanide gauze to old fruit branchings: Blue singing \"Spring is Here!\". Tonight down at the D.R.S. printing out half a dozen Christmas Cards for Division, Brigade and the sister Ambulances. Borrowed paper off Frank D. Groutings for dinner tomorrow night – about 14 Fowls, so with rations and Fund extras we should ‘feast’ well at all account. The meaning of Christmas has gone, to think and to collect my thoughts I made across to the village church, it was closed and in utter darkness.\n\nA letter from Aunt Louie – written during an air raid, full of her own individual charm.\n\nDecember 25\n\n49.\n\nA most un-Christmas like day – but for the unusual decorations of the hut. Tonight a dinner, and by preparations success should be assured.\n\nDecember 25, 26\n\n50.\n\nMail, \"Songs Before Sunrise\" and a charming little edit. also T.L.S. and letter from Mrs. Hadley.\n\nDecember 26\n\n51.\n\nLast night’s dinner the most successful and enjoyed of a year’s dinners, a full swinging success and a goodly company. A starting at 4.30 and an ending at 8, then down to D.R.S. and a challenge snow fight with the officers, A. Section alone remaining in the field, vanquishing all comers.\n\nToday the snow heavy on the ground, and a full sun shining. We look out from the D. Room over a low valley. Yesterday in the afternoon when only a thin layer of snow had fallen, the scene was of soft pale apple green and the veiled pink of red roof tiles, today it’s a scene from the primitives, farm houses and trees grouped as fine tapestries and open spaces of pure gleaming white, lovely in the sun.\n\nToday dressings, all sprained ankles, black eyes and bruises.\n\nDecember 27\n\n52.\n\nPater’s \"Renaissance\" and Swinburne’s \"Songs before Sunrise\", jove what loveliness of writings.\n\n53.\n\nTwenty of A. Bearers up, Blue H. up where Francis should have gone. F. at first rather attracted me – a masculine Daisy Jerome Type in build and colouring, but his personality and manner not too prepossessing.\n\n54.\n\nDecided upon, if the Paying O. will stand it, a drawing of 80 F. this coming pay – to get Dowson’s \"Decorations in Prose and Verse\", 1899, 30\/-, the 1st edition of the cover design of gold, probably by Ricketts or Shannon.\n\nAnother cold grey day, and a long morning of dressings. The Tommies have at last discovered us, and they arrive with all the ills of the Military world.\n\n55.\n\nWrite tonight to Export Manager, T.B.C., to procure Dowson’s \"Decorations\" and Beerbohm’s \"More\". And to Gerald, and to Harold N., replying to R. letter of last Oct. or early November.\n\nDecember 28\n\n56.\n\nThis morning bombs dropped and the raiders away without harm. If they were as near as they sounded they’d have been much nearer.\n\nAll night long heavy and heavier intervals of fire, and till mid morning they’ve continued. Tonight the 1st Brigade are stunting – either a raid on a large scale or a minor stunt. This is a quiet front – the quietest we’ve been on this year. It has been well accepted that the Boche will sooner or later make some attack – an effort to break through. The idea is that this will be his attacking front, and today big preparations have been made for the clearing of wounded. ‘Tonight’s the night’.\n\nAfternoon: stunt postponed, an 11th Batt. runner captured with all plans and arrangements of the attack.\n\nBill just down for mail, expecting Cuala Book of Yeats new Noh plays, and Padraic Pearse’s new volume.\n\nA few days back arrived the Christmas catalogue of C.W. Beaumont, a catalogue in two parts & of Books of Thomas Hardy, and Book of the 1890’s. A limited edition of this lovely catalogue – on H.M. paper of 50 copies, 2\/-.\n\nAll of Hardy’s 1st editions are catalogued – from his first book \"Desperate Remedies\" published anonymously 1871, catalogued £45, to \"Satires of Circumstance\", 1914 – 12\/6. Follows then \"Handyman\", a list topp’d by Lionel Johnson’s \"Art of Thomas Hardy\", Part II. The Association Books include the M.S. of Stephens’ Green Branches - £3.10.0, & the limited 500 editions of this – published last year at 2\/6 is priced 21\/-.\n\nThe first number of \"Farm\" stands 12\/6, for it six months ago I paid half a guinea. \"Gypsy\" stands 7\/6 first No. and 5\/- Vol. II. Max Beerbohm is listed, \"Works\", 1896, 15\/-, \"More\", 15\/-, \"Happy Hypocrite\", 15\/-, \"the Poets Corner\", 6\/6 and \"Quest of the Gilt-Edged Girl\" 7\/6. Three of Ernest Dowson’s \"Decorations\", 30\/-, 1899, \"Dilemma\", 1895, 15\/- and \"Verses\", £2.10.0, 1896. The first edition of the three of the ‘Pawns’ plays of Drinkwater are priced £1.10.0.\n","15":"\n\nJames Stephens, Davies, Hodgson, de la Mare and Masefield figure well, Masefield especially. Masefield is the one poet whose 1st edition I seek, already have Lollingdon Downs\" – 8\/6, Philip the King, 5\/- and \"Good Friday\",","16":" Next week may add \"The Tragedy of Nan\", 25\/-. His \"J.M. Synge: Some Personal Recollections\", Cuala, I bought last August for half a guinea: listed here 25\/-.\n\n58.\n\nSo? um. The Glorious Damned Decadence!, after the Factory Corner stunting of last March.\n","17":"\n\n59.\n\nThe Col. back: and expecting his arrival shortly on an inspection. A cold grey day, and a quiet night last night: hardly a gun fired and no bombs dropped hereabouts.\n\n60.\n\nThe first journal I ever kept was started after reading Ibsen’s \"Lady Inger of Ostrat\" and I opened it with an attempt at Dramatic Criticism, with a reading of Schopenhaur essay on style – in a writing in my memory Schopenhaur at the time greatly impressed me, and all he had to say in writing pleased me as though I’d first said it myself. And I read Walter Pater, it was the first of the Imaginary Portraits, and in the journal I wrote the last sentence of his Imaginary Portraits of Watteau’s lover, the words appealed to me then as affecting myself, and now I think their truth was more than I then realised. And tonight I feel lost in a melancholy I can’t put aside, even the good books I have seem ridiculous and quite useless, the days are monotonous, the prospect of a change is as it was a year ago. Tonight there’s a rumour of the American planes having dropped bombs on one of the Rhone towns, & their success counts to over a thousand dead, hideous bloody horror dropped suddenly from nowhere and a thousand human bodies blown to tattered animal palpitating meat, bones in bodies that crunch quietly as they are moved aside, and naked grotesque revelling revelling in blood. A machine callowness – the proud product of man.\n","18":"\n\n61.\n\nTonight a stunt by Fritz is expected, this from the prisoners captured yesterday.\n\n\"Any mail today?\"\n\n\"No mail!\"\n\nFinished the reading of another of George Birmingham’s \"Lalage’s Lovers\", a good reading, a book in the manner of Lewis Baumer’s drawing the ‘Nuts’! \"General John Regan\" I read some while ago.\n\nDecember 30\n\n62.\n\nY.M.C.A. ink.\n\nPayed today: drew – so now overdrawn 50F., 40F. with Tommy – instructions to procure a 26\/- P.O., then to Beaumonts for Masefield’s \"Tragedy of Nan, and Other Plays\". No mail again. Wrote – this time for posting – letter to Mother.\n\nReading Swinburne’s \"Eve of Revolution\". Talking to one of the Kookaburras who had come around for dressings, spoke of Frank D. and cartooning. F. to go around some day after today as its probable some Kookaburra cartoons may appear in one of the early ‘Aussy’ numbers.\n\nRumour today of the Cambrai front for the 1st Division after their stunting. Another prime report is Aust. Base at Brindisi, and Blighty leave every six months!!!\n","19":"\n\nClarrie H. down today for mail and with letters to post, speaks of a second Factory Corner position.\n\n63.\n\nThis morning on S. Parade, a lot of Artillery men – colds: husky spoken, from gas. Diagnosed by M.O. as colds on chest! Talking to one tonight who’d come back for inhalation, find him to be of the company of the Trench Mortars gun the Boche scored a direct hit on the night of the advance of March last. The two left of the crew, Capt. Drummond and myself dressed at Edwards Post. Pendlebury died later.\n\n64.\n\nTonight in mind for supper, a tin of Pork and Beans, to be heated up with Ideal Milk and seasoned. P. and B. anathema since Spotty’s been cooking – to the satisfaction of the majority.\n\nNo mail again, nor any report on rumour of its arriving.\n\n65.\n\nMartyn at the D.R.S. today more than ever like a Beardsley drawing – badly smudged. Beaumonts have a book of Davidson’s Plays designed by Beardsley: would like to have it.\n","20":"\n\n66.\n\nToby B. back from Hospital, evac. from Quehen a while back. Toby would make a great subject for miniature, his colour is especially fine and clean and his eyes full brilliant blue.\n\nDecember 31\n\n67.\n\nPosted to Beaumonts order for \"Tragedy of Nan\", 26\/-, P. Orders from F.P.O. 35.50.\n\nFrom T.B.C. Alan Seeger’s \"Letters and Diary\", in format uniform with the lively translated \"Letters of a Soldier\", this I’ll have to buy again, it would make a fine book to bind well – without the two commonplace introductions.\n\nThese two books would shelve finely with Masefield’s \"Gallipoli\", Verhaeren’s \"Belgium’s Agony\" & Bean’s \"Letters from France\".\n\nTonight its freezing again: the sky is luminously blue, brilliant without stars; a while back bursting shrapnel made sudden flashes of brilliance.\n\nWrote to Aunt Louie.\n\n68.\n","21":" ends tonight the fourth year into which the war has run. In a few hours the will be into the fifth, and the guns that have all day layn dormant are now awakening: of a sudden a big gun’s speaking will shake to the cellars our house and those by us. Farther off another hollow echoing boom and the shells quick life’s elation.\n","22":" 1, 2, 3\n","23":"\n\n69.\n\nI read last night scattered paragraphs through \"Letters and Diary of Alan Seeger\", today I’ve parcelled it up, with J. Drinkwater’s \"Prose Papers\" & addressed it to Aunt Louie.\n\nNo mail again.\n\nTonight at the Kookaburras: D.O.\n\nJanuary 2\n\n70.\n\nPosted away Diary, A.S. and \"Prose Papers\". P.P. I’d liked to have kept by me, their reading is good. \"Tides\" I’m keeping but thought some have to make place for Flecker & Beerbohm.\n\nNot so cold again today, faint easy rain broke the morning’s greyness, and took some of the snow from the slippery roads.\n\nReading this afternoon Pater’s Luca Della Robbia\". No mail, but the report of some shortly arriving.\n\nJanuary 3\n\n71.\n\nThere was heavy bombarding last night, and early this morning, bombing stunts about this sector: we here were blissfully ignorant of both. The morning sun is lovely and the clouds are few: a day like those days of February, when six of us were at No. 1 Relay on the N. Road, Factory Corner.\n\nJanuary 3\n\n72.\n\nHe was on our first sick parade, and he came into the dressing room mufflered and overcoated, and his hands deep in his pockets, of his left hand his third finger was half septic and his fourth had a great festering sore round the nail. His face is a death mask of a man dead after years of wasting, and years of terrible anguish, his cheeks are sunken and his eyes, his nose sensitive, and over his lips a deep black moustache, his hat is well over his forehead. Never a word he says, and always – except when he is actually being dressed, his hands are always in his pockets. When the M.O. ordered his going to the D.R.S. to have his finger lanced, the last of his vitality seemed to go, and all fear was in its place. Three times a day he suddenly appears without notice in the Dressing Room and brings with him always his air of haunting.\n\n73.\n\nFrank D. to the Kookaburras last night and put in some good cartoon sketchings.\n\nJanuary 3, 4\n\n74.\n\nMail: \"The Wild Swans at Coole\", W.B. Yeats new book.\n\nAn argument with Bill F. that ended disastrously – the Art of Augustus Johns, for reproduction in sepia in The ‘Sketch’ – in ‘Tatler, I forget which.\n\n75.\n\nGoing down to hut from D.R. \nfrom\n for Rhum issue with Toby across the deep sky the most wounderful streaked line of pure white rushing light – as brilliant and large as a flare: a frosty clear night with bright stars.\n","24":"\n\n76.\n\nMail: one solitary home letter from Mother, Nov. 4, so all letters since Oct. 12 missing. Bag not yet arrived from Jays: wish I could remember if it was after buying the bag or before, I bought the two Cuala books and the Bound books, at any rate with the bag will be Lord Dunsany’s book of Plays and a book of William Watson’s. ‘I bought you Dennis’ last book which I hope you will like: I must confess I couldn’t make much sense out of it: however I knew you love poetry, so hope it will give you a happy hour or two’. What a delightful flattering of the Muse.\n\nJanuary 4, 5\n\n77. \n\nAnother fine and sunny day, heavy frost last night again, and bombarding on and off late and early. Disappointed at non arrival of Flecker’s Collected Poems from Beaumonts: hardly a prompt firm at forwarding but their stock is so facinating: hope it wasn’t Napoo when the order arrived.\n","25":"\n\n78.\n\nInnoculation today T.A.B. and tonight one solid ache over the arm, from Toby a double Rhum issue, so at all accounts the first half of the night will pass in sleep.\n\nToday Tuppy and Radis down from supports, and read from them a letter of Peter Mac’s and of Sol’s, both so entirely typical of them both, that I’ve seen the two of them ever since.\n\n P.C. from Elsie, and promise of a long letter following.\n","26":"\n\n79.\n\nA mail in today – and from Mother the news of Jackie Howes and Viv Waters being dead of the war. Two more to join the men of Brooke’s sonnets, and two I’ve loved. Requiescat in Pace.\n","27":"\n\n80.\n\nWritten tonight a letter to Mrs. Howes.\n\nNo mail in.\n\n81.\n\nMail yesterday added to – a Press book library on active service – \"The Sunken Garden\", W. de la Mare from Beaumonts, Flecker’s Poems sold: damn. P. Books are, \n\nWild Swans at Coole, Cuala\n\nTwelve Poems, Moreland\n\nTides, Beaumonts\n\nSunken Garden, Beaumonts\n\nRain last night and no frost in the air today made the roads wet with mud: cold tonight, a freezing again hoped for.\n\nReading yarn of Ghorki’s.\n\n82.\n\nA new patient in, the Y.M.C.A. Belgian ‘Kiddie’: last night in the dark he ran into a post. He’s a bonzer little chap full of quick smiles and quaintly – yet correctly worded phrases. This smiling face and quick manner suggest the fair drawings in La Vie Parisienne.\n\nJanuary 7\n\n83.\n\nA yarning till late around the stove in the Dispensary – Jim S., Jim L., Bill and self – of many and all things: of Lloyd George’s new Peace Speech & his great claiming – of what made the stove smoke – of the officers taking stoves from the wards to warm their own domiciles – of the bonzer weather, of our next sector, and of the flying corps. Touristing France and Italy and Germany on bikes – push V motor. God it’d be great to carry these arguments without the faint wonder if there’ll even be an Apres la Guerre for you, then in the mind arises the memories of the dead, of Eric standing stripped and quiet in a full rich sun by blue skies and green water, a lovely figure of perfect form and colour: of Ernie as he was after Bullecourt when we joined the 2nd Ambulance, or leaning yarning over a brazier: of Snowy Watters coming laughing down the Rue de Bois at Henencourt: of Jackie Howes and Gil at Bondi, beautifully built and sun-browned both of them, shooting in on a great wave, or sun basking, of a hundred others, all of them dead. And still, and just close here, there’s a world of slinking and sudden terrific death, and we talk laughing of the times that are golden merely to dream on.\n","28":"\n\n84.\n\nA parcel from Mother – two pairs of sox – Laus Deo! and Dennis’ \"The Glugs of Gosh\" and I’ve just finished the reading of it, a bonzer book of whimsical nonsense ? full of quaint humour and fools’ folly. ‘Emily Ann’ is a pure delight, and so is \"The Little Red Dog\". I’ll have a hard try to keep the book clean – but it’ll be the most difficult task in the world. Not lending it seems pure selfishness – all who have seen it are promised their anxiously asked loan & one reading of it demands the recommending to another.\n\n85.\n\nHeavy snow today: this afternoon with the red setting sun, a wonder of vivid colouring. Then the evening star like a frozen flare held brilliant against the luminous blue of the sky.\n","29":"\n\n86.\n\nTwo letters written: one to Mother, one to Ron. No mail in.\n\n87.\n\nNo papers today: so the wild thing is told us – the papers have been suppressed in France by the Military – their contents are too startling.\n\nFrom the Divy P.O. though, it’s simply owing to mail falling back one day.\n\nWhat will the next news be: surely Lloyd George’s speech should lead somewhere, by earlier speeches, if Germany had offered her speech first a haunting refusal would have been answered.\n\nI’ll to Swinburne, his \"Songs Before Sunrise\" beat Peace Talk – and a hundred conferences have been held here today – into cocked ridiculous rubbish – if there exists such rubbish.\n","30":"\n\n88.\n\nA day of pure dopiness. A thaw set in during the night and mud thinly slimes the frozen ground.\n\nYarning awhile with George E. of M. Forrest – whom it appears Basil B. knows, and with Toby of the old Cairoian days.\n\nNo mail, and I’m looking forward to Pearse’s \"Rebel Sings\" – the 2nd vol. of his collected stuff.\n\nJanuary 11\n\n89.\n\nThis morning found the mail of yesterday with Les F. at the D.R.S. A letter from C.W. Beaumont and a regret that \"The Tragedy of Nan\" was sold early last months. A list of Cuala Press Books included \"Selections from the writings of Lord Dunsany\" – so wrote for it and for James Stephens \"Five New Poems\" – imagine & hope it’s a \"Flaying Flame\" Chap. book.\n\nPosted two letters to Mother and to Ron.\n\n90.\n\nPayed: so drew only 20F. Cabled home for Twenty pounds – in hopes of a Paris leave. Posted to Mrs. Hadley the two Beaumont Books – and parcelled ready the Moreland and Cuala books.\n\nNo mail today – where I’d anticipated the January \"To-Day\".\n\nRain in the air, and a poor grey day.\n\n91.\n\nRusty T. around this afternoon - & talking of our forming a book club: to each, say, twelve of us, pay in 5F. and 2F. each pay: to each be given the opportunity of listing books. A meeting to be held shortly. It is a good idea, and with the Motors carrying is a solved problem.\n","31":"\n\n92.\n\nToday to the Dispensary, with Malcolm Miller, Joe Rout: from him hear of Harley Lambert’s and Hughies being killed early in the Menin Road stunting of Oct.\n\n93.\n\nA 2nd Batt. chap in to D.R. again tonight yarning of stunts and war, a fine type, and a service man. Tells of little episodes of the day in a front-line trenches, in advanced posts and pill-boxes. His telling full of rich sudden phrases, and full of the evidence of a good nature, & a full liver. He one of the bearers of the wounded of bombs, at Belgian Battery Corner last Oct., speaks of the way all pulled so well together, and the well getting away of all knocked early in the night.\n","32":"\n\n93.\n\nFive years ago – Jan. 13, 1913, full of a woundering and good intentions, I started the first year of articles to Lindsay Thompson. Five years! – and in those years ? – well my taste in pictures, books and peoples has certainly progressed, but how much nearer am I towards the set out for goal! – how much nearer towards the earning of the name of Architect. All I possess – a slight smattering of the styles and building manners, a happy appreciation of Gothic and the Classic schools – and a facination towards the exotic and bizarre – the Saracenes and Byzantine.\n\nHere is my desire – to partnership with Vin D. – or perhaps with Court: though with Vin preferably, then to build up a connection and so individually designing all works, that a certain amount of specialising could be gone in for – in good Domestick and Civick. Theatrical Art strangely attracts me, the designing of plays and their staging offers a world for such exotic magnificence as is nowhere else possible: and the modern stage – where supreme – almost Japanese simplicity is not aimed at – seems more and more to aspire towards in most voluptuous . Two other Arts attract, and there’ll be hobbyising there if the Gods allow, Sculpture and Drawing.\n\nFor the present, Dressings and a close following of war.\n\n94.\n\nMail: letter from T.B.C., \"Decorations in Prose & Poetry\", Dowson 1899 from Beaumonts forwarded, 1st edition 30\/-.\n","33":"\n\n95.\n\nA clear star night, air full of frost: a lovely day from early till late – one of the best of the Hermies days of last March when the 1st Division were advancing before Cambrai.\n\nSupper in the hut with Toby and others: porridge & cake from the Civil Service. Vin Sellers singing in the Musick Room of our Villa Billet: old songs of full and lovely melodies: Basil B. at the piano.\n\nA good day’s ending to sleep on. Finished the reading commenced yesterday of Ian Hay’s \"The Right Stuff\", a pretty and a light amusing novel and well written.\n\nPut in for Paris leave.\n","34":"\n\n96.\n\nDeep snow and fine snow falling turning out this morning: then a faint sun, and skies of faintest blue – merging to the colour of the gleaming snow.\n\nMail, T.L.S. and some good announcements: a new book of W. W. Gibson’s ‘Whim’, & a new book of James Stephens \"Reincarnation\": also two new books of Tagores. Wrote to Beaumonts for \"Whim\".\n\nRoland K. tells of his being engaged to an English girl. Toby & Bill from home hear of there being \"memories\"!\n\nJanuary 14\n\n97.\n\nLetter to Beaumonts, Jan. 15 (dated),\n\nDear Sir\n\nTonight a few readers of the ambulances have decided upon the forming of a miniature Book Club: so – would you be so good as to act as our Bookman?\n\nYou will easily understand our position: we are constantly on the move – sometimes a party established as an Aid Post in the lines – at the Advance Dressing St. – or behind the lines at the M.D.S. So our books will be the cheap editions and pocket editions.\n\nI am assuming you will act for us, so am enclosing a Postal Order of £2 to be placed to our credit and a list of the first books asked for – to be forwarded under my name to the 1st Aust. F. Amb.\n\nWe would deeply appreciate too catalogues of S.H. Books, and inexpensive and pocket editions.\n\nThanking you\n\nI am sir\n\nYours sincerely\n\nFrank H. Molony\n\nAct. Secretary\n\nNever forwarded.\n\nTonight the meeting and little discussed: selections made of Books, and my mentioning Beaumonts is the shop decided on.\n\nJanuary 15\n\n98.\n\nRain and wind: and tonight a while of thunder and lightning.\n\n99.\n\nInstead of posting the last page’s entry – letter to Beaumont, wrote tonight another, asking if the supply of such books, cheap editions that we’ll be wanting would be out of his line, also asked information of The Flying Flame Press books, and for W. W. Gibson’s \"Whim\". Mail brought the 1899 edition - Leonard Smithers publisher – of Dowson’s \"Decorations\", a pretty book and in fair condition, but I am wanting his earlier \"Poems\".\n\nAndy brought back after his and George E.’s reading of it, The Glugs of Gosh. \"The Glugs\" would be a rather good name for our Book Club.\n\nToday posted a 15\/- P.O. to Hendersons for our first list of books,\n\nRusty F., Tolstoy’s \"Resurrection\"\n\nBasil B., Daudet, \"Tartarin of Tarascon\"\n\nEric G., Ruskins Sesame & Lilies\n\nEric Gibson, Balzac’s \"Christ in Flanders\"\n\nBob S., Byron’s Don Juan – in favour of Rousseau’s \"Emile\".\n\nJimmy O’T., Hugo’s Toilers of the Sea (you’ll do me, Jimmy)\n\nJack U., Lyttons \"Runzi\"\n\nRube P., Marcus Aurelius\n\nWatts, Dickens’ Tale of Two Cities\n\nTom Y., Thackeray’s \"Vanity Fair\"\n\nand self, Balzac’s \"Tragedy of a Genius\"\n\nArthur should join us to tone down our conventionalism – with Charles or Nat!\n\n100.\n\nWord of Tibby Cotters being killed: Palestine. When he joined up the A.I.F., Mrs. Cotter told Mother \"he’d joined as a Light Horse!\"\n\n101.\n\nThe January To-Day a poor number – save for one fine little poem of Davies: \"Molly\". Copied it into the \"1916, 1917 Georgian Poetry\".\n\n102.\n\nThe rumours telling of our going to Egypt still strong. It is strange how this still holds – the same charming us at the end of 1916. Now it is of all of us bar the Artillery shortly moving – they to remain here in support to the Americans.\n\nAnother rumour speaks of their relieving us here: another of one being in support to the other – which is most \nmost\n improbable. The two peoples will never join their loves. The Scotts – especially the Gordons and the A.I.F., yes, the Americans and the A.I.F., evidence up to date all against it.\n\nJanuary 15, 16, 17, 18\n\n103.\n\nPosted to Mrs. H. \"Wild Swans at Coole\" and \"Twelve Poems\" and written 4 pages to ‘Dear Mother Myne’.\n\nJanuary 16\n\n104.\n\nLast night a raging tempest – wind and deep rain. Today dull, but a day of magnificent rain cloud skies and massed colouring and all the land lovely in a wounderful light. To Bailleul: a fast walk there, and a drive back in one of H.Q. cars.\n\nPaddy Burke tonight at mess passed along – and I read it while I ate sardines and bread – Frances Thompson’s \"Hound of Heaven\".\n\nJanuary 17\n\n105.\n\nA wet drizzly day: early light snow that melted at once on muddy ground. Tonight to the Y.M. and heard a lecture – lantern – by Y.M. man by name of Brown, so, so, but interesting. Sketched and posted to A.B. pencilling of the Huts on the Kruisstraat.\n\nAnd so to bed.\n\nJanuary 18\n\n106.\n\nA day of greyness: a day of early Spring coolness and colouring.\n\nNo mail. Sketched a while.\n","35":"\n\n107.\n\nYesterday the Bearers down and a minor celebrating about Dan Mac’s and Blue’s bunk.\n\nMail: letter of Oct. from Aunty Gertie, and from T.B.C. Grave’s \"Fairies and Fusiliers\".\n\n108.\n\nParaded this morning to O.R. Some note through from D.M.S., H.Q., of some private enquiring as to my health and condition. Col. to fully report on it to D.M.S. Another day of mild weather. Brilliant sunrise and setting and superb skies of green-blue and grey. Mail, letter from Mat. and from T.B.C., Poems 1908-14 by John Drinkwater. Wrote to Mother, to Geoff, to Betty and to Bakers after report on books.\n\nJanuary 21\n\n109.\n\nAt 2 a.m. the Colonel’s hut burnt to the ground and everything in it compleately destroyed, about £140 damages – a personal loss that is. A fire burning in it ready against his turning in. How does the H.Q. order affect a Col., the one making it a crime to leave a fire in any hutment or Billet without someone to watch it? Mr. Poole’s tent being burnt at Quehen, Col. announced it a gross carelessness!\n\nJanuary 22\n\n110.\n\nMail yesterday brought report from T.B.C. of 1st edit. of Burke’s Limehouse Nights, wrote for it, and an hour later declining it, a dozen times I’ve decided for and against: the price though is really too high. But Twinkletoes was a fine and richly written book. Limehouse Nights was the first of the Limehouse sketches, I’ll for it! Will write after receiving of T.L.S. today.\n\n111.\n\nLast night with Frank K. and Bill F. to Kookaburras: a special programme there being amongst the audience a live and tame general and his staff, and recognised an old enemy amongst that most brilliantly band’ed staff, a Maj. who at Ribemont in Nov. ’16 put Clarrie and self out of one of the A.D.M.’s lorries when we were travelling down to Buire to join up the unit.\n\n112.\n\nToday a grey mild day as yesterday, rain clouds low in the sky and each morning lovely colourings about the hills before the sun.\n\nRead last night Masefield’s sonnet \"Roses are Beauty\".\n\nJanuary, 22, 23\n\n113.\n\nWritten to T.B.C. declining offer of 1st edition of Limehouse Nights at 18\/-. Ordered \"The Vengeance of Fionn\" by Clarke, and \"Appreciation and Depreciation\", Boyd. From them my full account since 1916 – starting with the order for Raemaeker’s cartoons by The Fine Art Society. (41710)\n\n No. 151, Diary IV.\n\nAlso for Masefield’s \"The Old Front Line\". ‘War Poems’ of Vernide in 2nd edit.\n\n114.\n\nIt was Henderson of Charing Cross Road who first shewed me Pearse’s Collected Works Volume and who recommended me to read it – he first told me of Pearse being of the Easter Risings victims, now in the Jan. 17, T.L.S. appears –\n\nOn the Irishmen Executed in Dublin. A Poem to which is added a Note on the Present State of Ireland. By Albert Clement White, 7¼ x 4¾, 11 pp. Henderson’s. 2d. n.\n\nA poem of six quatrains, reprinted from the New Witness. Mr. White wishes to show that \"the dead who died for Ireland in Easter Week … died in precisely the same cause as the Irishmen who – like Professor Kettle and Major Redmond – have died in the war.\"\n\n Arrived Feb. 4.\n\n Maj. Redmond’s grave near here – in the grounds of D.R.S. run by 3rd at Loche.\n\nJanuary 23\n\n115.\n\nPosted today letter of Mon. 26, asking for a couple of Venus Pencils: one I’m using so used down that even with holder it’s difficult to work with: last night sketched in \"Fairies & Fusiliers\" below \"I wonder what it feels like to be Drowned\": roughed out another \n\nJanuary 23, 24\n\nfor \"S Dead Boche\" – on Mametz Wood: but destroyed it: dead Boche at any time – any dead – are terribly coloured and hideously fantastick.\n\nFound the note of Beaumonts of Jan. 4 re Cuala books, suitably it was on \"Songs Before Sunrise\".\n\nThis morning a grey world of low sky and faint mists: saw Roy F. at Mess – he just back from leave.\n\nTurning in last night read half of J. Drinkwater’s 1908-’14 Poems, June Dance\" three times.\n\nNo mail in: expect tomorrow Cuala Book of Dunsanys and Stephen’s \"Five Poems\".\n\nJanuary 24\n\n116.\n\nMail: letter from Mr. H. and enclosing a list of the books that have arrived with his: compleat to the date of his writing: Wild Swans and Twelve Poems not listed.\n\nPosting 3\/- to Hendersons for Stephen’s \"Insurrection\" and \"The Irishmen executed in Dublin\". Do up for posting \"Georgian Poetry\" and \"Fairies & Fusiliers\". A Spring sunny day.\n\nJanuary 25\n\n117.\n\nLast night – back to Dispensary from Y.M. Concert, met one of Jim S.’s friends: he talked – to us generally – of Germany and France, and then of German Art and Letters to 1870. I defended the German Modern Art as having so absorbed old styles, and making them their own, they had evolved a very fine school of architecture – in art of course their productions have been rather too brutal and dull. After he’d gone found I’d been arguing with a late Prof. of the Sydney Uni. – prof. of German and French. An abdominal – a horizonial – an exceptionally large G.!!\n\n118.\n\nDreamt last night of having received from Beaumonts only ‘Five Poems’, he reported Dunsany out of stock.\n\n119.\n\nMail, from Mother letter of Nov. 23: the bag has arrived, have my diaries? jolly glad that bag has turned up and it was liked. Photographs too of Mother & Bett and Russel’s address, Lieut. 45 Batt. Must look him up. From Beaumonts answer of letter re Book Club, no word\n\nJanuary 25, 26\n\nof Dunsany or Stephen’s books.\n\nFrom Davies & Oreiole catalogues. Comparisons are interesting.\n\nBeaumont – Davies & Oriole\n\n10\/6 – The Bull R.H. – 5\/-\n\n7\/6 – Last Blackland R.H. – 4\/6\n\nBakers, B. – Davies – Oriole\n\n4\/6 – Odes, W.W. – 3\/6\n\n4\/6 – Father of Forest, W.W. – 3\/6\n\nDirect, for two of Watsons – \"And the pump of the Nightingale’s pain\" – part of a line of one of his poems in Today have haunted me since I read it – and heard the Nightingale at Henencourt early in the night-morning of the Somme – and W.W. Gibson’s \"The Golden Helm\", 3\/6, 1903. T.B.C. for two of Hodgsons and John Davidson’s \"Holiday and O.P.\", 1906,","36":"\n\nPayed: drew 40, in hand about 18.\n","37":"\n\n120.\n\nSaw last night first number of \"Aussy\", I say Digger, the only drawing of","38":" Divvy’s pages. If I send in any paragraphs they’ll be under \"Valthick\".\n\n121.\n\nA cold day full of grey mists, and no mail that was expected, but from A.B. note of their keeping with other A.I.F. sketches the one of the Kruisstraat. P.C. from Mat.\n\n122.\n\nWith Ridge to Y.M. Concert by Tommy party \"The Dabs\", the audience splendid!\n\n123.\n\nWriting tonight.\n\nJ.D.H. K.I.A.","39":"\n\nGrey clouds roll on a great grey sky\n\nAnd the mist from the ground’s breast high\n\nAnd a sad song’d breeze\n\nBlows by bare torn trees,\n\nAnd the ghosts of the dead pass by.\n\nTier’d guns beat the whole night long,\n\nOver the hills their poor tired song.\n\nI lay by his side in the white flare’s light\n\nAnd his hands were cold, and his face was white,\n\nAnd the beauty of all things woke in me,\n\nAs I lay in the rich dead company.\n\nAs I lay by his side in the night.\n\nAnd the tier’d guns beat the whole night long\n\nOver the hills their poor tired song.\n","40":"\n\n124.\n\nDavid MacKenzie’s full this morning of impending revelations: last night in the hut he betted his next week’s rum against the crowd that a four days armistice would begin today. In the Breakfast came to Bill he says, full of ernestness – \"Can ye tell me why there’s no gunfire this morning?\", and so we heard of his prophecies.\n\nThe war in the D.R. a while\n","41":"\n\nback, looking at Vin’s A.I.F. Book, Radis in sweeping out discussed Jock’s peace with us, needless to say David bit, and he defended the dying rumours of our moving to Egypt. I said, \"Well as a matter of fact, I suppose England’s got the wind up, and doesn’t fancy the idea of the A.I.F. declaring against her.\" David lept into lurid flames but Radis saved the situation, \"Why if the Germans offered me a couple of bob more a day, I’d join them!\"\n\nDavid dropped the A.I.F. Book and stormed out.\n\n125.\n\nAt the Dabs Y.M. last night, amongst the new items, \"The Green Eye of the Little Yellow God\". All the tragedy and bathos of the world in it, and in a long silence between two eloquent phrases – in the audience a whimper – \"Oh, don’t put the wind up us digger!\" When some R.M.O. came in just before the show’s starting a hoarse voice – \"Have you found my voice yet Don?\" – and a louder voice judged – \"Medicine and Duty!\"\n\nWill try \"J.D.H.\" in A. Bulletin & if its turned down in \"Aussy\".\n\nJanuary 27\n\n126.\n\nD.H.Q. are offering odds of 7:1 that we’ll be in Palestine or Egypt before three months are gone, according tonight to Jim W. But so many times have these most desirable of rumours been accepted by us that a time of eternal doubting has come to pass, so that if we do move for the East, it will come to us as a wounderful surprise.\n\n127.\n\nToday a day of wet day’s mist. Yesterday – mists then – some of the 4th Div. went over on the front, and by surprise captured 40 Bosch, and discovered almost in the front line preparations for heavy gun emplacements.\n\nThe Kaiser’s birthday.\n\n128.\n\nTonight I’ve read the two last instalments of John Galsworthy’s \"The Apple Tree\" in Nash’s, a three part novel, and full of Spring charm and poetry. One of the prettiest pieces of writing Nashs have printed.\n\nNo Mail.\n\nIn the paper the German Chancellor answering speech to Lloyd G. and Wilson, a surprise to the blatant optimists – what half of us had expected. And possibilities of offensive by us next Spring?\n\nAmerica in full force 1919.\n\nJanuary 28\n\n129.\n\nGod: for the sanctuary of a great cathedral, for the silent rich benediction of its choir and the soft ease of its alar , just for an instant to catch up again the ecstasy of a morning last August in York Minster. Tonight all things conspire to haunt me and I’m in a hell of melancholy. Could God come in to such an ugly church as Dranoutre?\n\nAnd it is so easy: the mere swallowing of a few tiny insignificant tablets – sleep and eternity! .. and the horrible thought! – wrapped in a grey or brown dirty blanket – safety pinned – and buried across from here with a mute collection of listeners! – woundering why he did it, \"funny – he seemed all right when I saw him!\" – \"he was out with Frank T. – and seemed full of a joy at a brilliant sun!\" – \"I saw him later walking in the night by himself!\". \"Oh God! and I woundered if the Padre was in, and sneered at what I could confess to him, and he seemed when he came into the O.R. to us that day a bonzer chap: of full sympathies and appreciations.\n\nOh God for compleat unconsciousness. They’d bury me and wounder. Frank would say – \"Yes, but he always was a bit crazy about the fitness of things and beauty!\" Frank D. would be lost in a maze of fancies, and a half wounder would steal over his senses. Toby would wounder too. \"I thought his ending would be queer! – he was always so full of intercourse for all that didn’t matter – but …!\"\n\nAnyhow I won’t swallow them, but tonight I’ll be drunk and probably put to bed by Bill. Oh but I’d love to spend the full terrible night in a gothic cathedral – let the whole night’s beauty stealing through great traceried windows, lull all ugliness away, let the prayers of gothick art clean my soul and ease my sense, to be alone by one of the clustering apse altars of Amiens – one of those slender tall windowed apses clustered about the ugly high altar - or at Aix, kneeling lost to all but beauty by the\n","42":"\n\nsteps of the high altar of the cathedral of Aix, in the dream church of Aix lost in a wonder and a worship. Tapestries, tall burning candles that are prayers, and in an ecstasy of worship, for God? – and I don’t know, perhaps only a worship for a beauty that drugs and is sensual.\n\nThe damned lights flickering, the wicks clotted and I’m alone. The creeping paralysis of a hopeless outlook!\n\nJanuary 29\n\n130.\n\n\"It is a poor heart, and a poorer age, that cannot accept the conditions of life with some heroic readiness\". R.L.S.\n\nLast night the first frost for weeks, today lovely as yesterday with a golden sun and blue skies.\n\nBondi – and the gold and the blue.\n\n131.\n\nThis afternoon I’ve been reading the \"Songs Before Sunrise:. Only partly can I understand them, I not knowing their driving motives – their allusions. But what ill mood could last passing a reading of this.\n\nInside this northern summer’s fold,\n\nThe fields are full of naked gold, \n\nBroadcast from heaven on lands it loves: \n\nThe green-veiled air is full of doves: \n\nSoft leaves that sift the sunbeams let \n\nLight on the small warm grasses wet.\n\nFall in short broken kisses sweet,\n\nAnd break again like waves that beat\n\nRound the sun’s feet.\n\nThe fields are full of naked gold – so they were to us after the Bullecourt stunting when all that remained of us joined up with the 2nd at Boulencourt near Bapaume. Then the gold and new green green over and by great shell holes of the summer and we all stripped naked by full shellholes and bathed clean in water and golden in the sun. Ten of us by two triumphant over war & brilliantly green trees. We were sunworshippers all that day – and have been since. Ernie Brown was there, and Mathieson and Nicko and Paddy and Snowy and Selwyn, all of them dead or returned to home.\n\n132.\n\nTo Beaumonts.\n\n\"Daffodil Fields\" & \"Dauber\"\n\nPosted No. 123 to A.B. as \"Night Piece\".\n\n133.\n\nAdvance Party of","43":" Field up today from Quehen. B. Sct. to move as an advance P.\n","44":"\n\n134.\n\nAnother April day.\n\nNo mail. Books from Hendersons overdue five days.\n\nWrote today, had censored & delivered to Jim W. letter addressed to Windsor & Newtons for one of their Press Sketch Books. Rumour of our moving back near Bailleul tomorrow morning.\n\nYesterday Jim Mitchell back – and B. Section celebrated. Jim knocked with Algie, were the first of our wounded at Ypres in September. Looking well, and has hip wound well healed.\n\n135.\n\nBook distribution. In F.M.P. No. 1. Diary IV and Sketch I: Keats, Ginger Mick and B. Constr. With Eric G. \"Songs Before Sunrise\" and Brookes. With Frank S. Sketch Book II and \"The Achievement\", F. Thurston – from Y.M.C.A. today.\n\nNo. T.L.S. this week.\n","45":"\n\n136.\n\nLast night the guns that have been so silent for the last wounderful weeks opened out heavily bombarding and all the night kept continually speaking.\n\nWe are in our new position, leaving Dranoutre at 4.30, relieved by 15 Field.\n","46":"\n\nIn the R’Avelsberg D.R.S. by Bailleul.\n","47":"\n\n137.\n\nWorking in Dispensary with Jim S. and Staff Ford. New D.R.S. not a patch on Dranoutre but better than A.D.S.s in Dressing Posts.\n\nYesterday coldest day – full of cloud mist – of the first of 1918, today chilly after a heavy frost fall, but the sun out, and a clear fine day.\n\nMail: From Mat letter of","48":" and from Lindsay and A.B. of Jan. 25. None of the expected books, a mail now that brings me a book will be a temporary annihilating of all these damned that mentally torment.\n\n138.\n\nIs it the sensual element that has my appreciation of art? Certainly in such drawings as Spares and Ricketts it is that blood-utility, that superb nakedness that fascinates: but Alan Odles sensualism merely quietly amuses, and Beardsley? – it has the fascination of the obscene – the brilliant obscene: yet for all that, even though it is so far removed from life itself, it remains always true to life and reality.\n\nFebruary 3, 4\n\n139.\n\nNo Book Mail: but a slight letter from Mother of Nov. 28, written on back of reply to Lindsay by R.B. Orchard re my returning, so that seemingly was \"the private enquiring as to my health\".\n\nTonight an hour listening to Vern and Frank K. singing in Rec. Hut – to Basil B.’s accompaniment: Vern in splendid form and \"The Floral Dance\" and \"The Blind Ploughman\" ripping.\n\nCold: grey mists and faint stars, last night heard the Archies twice – planes over three times, tonight?\n","49":"\n\n140.\n\nAt last the looked for mail – \"Whim\", W.W. Gibson, Stephen’s \"Five New Poems\" (Flying Flame) & \"Selection from Writings of Lord Dunsany\" – a Cuala book of 100 pages: Baker’s catalogue priced at 35\/-, Beaumonts 12\/6. Five New Poems a surprise – and a disappointment. From Hendersons \"On the Irishmen executed in Ireland\" and Stephen’s Insurrection: the more I read of Stephen’s the more I surrender to his wounderful charm.\n\nTonight with Eric G. and Basil B. for a walk towards outskirts of Bailleul, yarning of Ashe & his marvellous staging: \"Choo Chin Chou\" and \"Kismet\" argued on and compared – and a cataloguing of – but what I liked – a pleasant walk: rich high stars, and away towards Poperinghe searchlights pencilling the dark.\n\nBack in admitting hut, a continuing of talking – B.R., J. and Jack W. Halford there too – Cathedral and Gothick & Byzantine, Religions and Ceremonial and Church stage management, and books. Bob reading \"The Loom of Youth\" and MacKenzie spoken of, so the Sinister St. and the rich impressionists, back then to religions – and a serious and genuine note introduced by Jack W. and \"argument about it and about\".\n\nEric G. this morning meeting self in Chart Room 1 (more of it later) spoke of publishing of Dyson’s A.I.F. sketches, an edition de luxe at £1.1.0. This I’ll get before any more Cuala Books.\n\nPosted to T.B.C. order for Anatole France’s \"White Stone\" or \"The Sapphire Ring\" – and reminded them of a late ordering of the second book of Padraic Pearse.\n\nThe first volume comprises to me the most perfect self confessing and true autobiography.\n\nFebruary 5, 6\n\n141.\n\nMail – letter from A.B., possible accepting of \"Night Piece\". Others have home mails dated as far forward as Dec. 15. Evidently Blue H. did forget posting of letter to Davis and Oriole for Watsons and W.W. Gibson’s books.\n\nFrank D. back from Blighty yesterday – O.R. this morning in \"overstaying leave\"!\n","50":"\n\n142.\n\nWith Frank S. to Bailleul – and so to Anzac Coves’ Concert – the last of the season (!), they to open next week in London at Court Theatre, if their show’s no better than it was last night – the same programme almost to an item that was last March in Albert.\n\nNo Mail.\n\nDentist, back filling for root treatment, arsenic filling and a solid aching!\n\n143.\n\nBailleul disappointing from architectural standpoint: the Hotel de Ville and the Cathedral (?) Towers merely built up and ugly detailed roofed piers, crudely strutted with indiscriminative iron and loosely repaired with fine brickwork. From here towards the right, at the end of the long heavy Chateau buildings there’s a finely silhouetted church tower, grey and of a Florentine suggestion.\n\nFebruary 6, 7\n\n144.\n\nTo Dranoutre by self – to Y.M. to exchange \"The Achievement\" in the hopes of \"Sinister St.\" being in: but it was out, so brought away \"Essays of Elia\".\n\nEarly in the dark of the morning rain, till midday grey deep clouds seemed full of snow, and the wind was cold, then great breaks over Bailleul, and an afternoon of blue skies and full sun.\n\nBasil has from George C. a copy of Nina Murdoch’s \"Songs of the Open Air\".\n\nTonight I’d wish to lie and listen to a good reading of Boccaccio, of Apuleius, of \"Physce’s visit to Hades\", or \"The Song of Songs\".\n","51":"\n\n145.\n\nIn the hut billet: at 8 oclock, a hut of about 30’ x 14’, in its centre an iron stove with its improvised chimney of tins, a hipped roof of lean construction and a scleroid covering. Along each side kits and blankets, now the light by ten waving candles, in a corner by me. Toby B., Johnno and Ridge, lying on made beds, eating bully and bread. (Bread rations the last few days have been a loaf to 2.) Down from me five straightly laid kits, and Brooke in bed reading, on the opposite side\n\nFebruary 7\n\ntwo in a corner yarning, and Harold L. writing, three kits laid as for inspection: then two bridge parties, just the low monosyllables of the players, and a low murmuring of quiet yarners. I’d lay’d down with the intention of reading \"June Dance\", but what an impossible atmosphere, outside the faintest of faint drizzles. Basil and Vin, Rory and self have been yarning in Rec. Room – of W.W. Gibson’s \"Whim\", so perfectly suited for low quaint melodies, \"Merry Eye\", \"Fallowfield Hill\", Northleach – they almost call for the accompaniment of such musick as a Hungarian Folk Song, Vin particularly charmed with the pieces.\n\n146.\n\nWrote tonight to Beaumonts – cancelling order of Jan. 29, asking for setting aside of Lady Gregory’s Cuala book 21, and to Poetry Bookshop after Chapbook Catalogues.\n\nNo Mail!\n\nHoping to receive shortly from Mrs. H. Venus pencils. Basil tonight asked me for a sketch – suggested a portrait of himself. Would like to try it, but think it’s rather above my head.\n\nHope Jim posts letter to W & N for Sketch Book. \n\nFebruary 7, 8, 9\n\n147.\n\nW. has just come in and standing with Maitland by my bed. Now ponderously at once – in the course of an argument with M. all sorts of avenged darts poisoned with damning adjectives. His case against me is that I fail to appreciate Britain’s superiority over the races of the earth. My argument is against England’s damned hypocrisy.\n\nGermanias cartoon Englander is a compliment, compared with England’s Germans.\n","52":"\n\n148.\n\nNo Mail. Payed, drew 30F. Sketched from photograph belonging to Arthur B., Snowy Walters.\n\nTurning in to read awhile, Stephen’s Insurrection or Drinkwater.\n\nPosted today letters to Beaumonts & ‘Poetry Bookshop’.\n","53":"\n\n149.\n\nLast night turning in…\n\nWhite gleaming white on either side\n\nOf a duckboard track to the line\n\nBlack, smudged black, & a new hole wide\n\nBy the duckboard track to the line.\n\nSnow, white and soft as a new made shroud,\n\nOn a duckboard track to the line,\n\nWhite flares arch, and the guns are loud,\n\nBy the duckboard track to the line\n\nFebruary 9\n\nAnd fatigues to up, & fatigues come down,\n\nThe duckboard track to the line,\n\nTen men go up, and six come down,\n\nThe duckboard track from the line.\n\nHuddled shapes four,\n\nOn the black-smudged snow\n\nAnd a broken track to the line\n\nAnd the wind tells a tale\n\nThat is whispered low,\n\nOf a duckboard track to the line.\n\n150.\n\nThis afternoon, searching for a Venus pencil in Ballieul, some wounderful Brussels lace in one of the square shops & a half hour spent there, my eyes are bad, the lace’s exquisite designs half lost in a blurr. Bought \"Guy and Pauline\" (Mackenzie 2.50). I’ve read it, but it’s worth the re-reading, also in a deluxe harlot shop Mais’ \"Shakespeare to O. Henry\" – the 1st edition, 10 Francs.\n\nTonight in the Rec. Hut a concert, Vin S., George D. and others. George down for the evening.\n\n151.\n\nToday I’d my desire of the last month, but the result not up to expectation. When he joined the unit at Bois St. Julien, I noticed him before all the others, today after dinner in the Rec. Hut I made a rough sketch, when I’ve good pencils & paper, I’ll do him again. A fine star night.\n","54":"\n\n152.\n\nAgain no mail.\n\nRead awhile Mais’ \"Shakespeare to O. Henry\", of Masefield & The Modern Novel, Stage & Poetry, a good book for occasional reading.\n\n153.\n\nYarning this night with Basil, of \"Gheitz\" our new-born unit rag, it’s to be suddenly, and without warning, laid in an unsuspecting ambulance. Frank to do the Colonel for page, then overleaf an \"Old Song\", of Brasse, so to Basil’s satire \"A’s\", to personal notes and Decoration to Bob’s socialistic note to a verse (149) and a finishing sketch of \"Bailleul\".\n\nTonight we blocked out all the matters: tomorrow printing and composing starts.\n\nSupper of Welsh Rabbit, Toast and Beer, to an arguing on syphilis and its permancy under the present social order of things.\n\nFrank S. has from Paris a fascinating ‘City Plan’ – full of tiny sketches of lovely buildings: and long boulevards.\n","55":"\n\n154.\n\nNot a damned suggestion of a reply of a book from T.B.C., feel inclined to write them cancelling all unfulfilled orders and suggesting a less blatantly hollow ending to their damned polite notes. If T.L.S. doesn’t arrive tomorrow will write to them.\n\n155.\n\nThis morning on the road to Bailleul a small batch of Boche prisoners newly captured, between 30 and 40 in all – young boys and young men, one lad of not more than 16, a lovely boy of soft golden colouring, tired expressioned, a great ugly grey helmet weighing his head. Some of the unit walked casually down to the road to watch them, and incidently to enquire of the A.P.C. guard if they were responsible for the bug. I should like to fully realise – not by experience though – the inner feelings of that golden land.\n\n156.\n\nA Realisation! Tonight 30 copies printed of Pages 1 & 8 of \"Gheitz\" and a commencing of pages 2 and 7.\n","56":"\n\n157.\n\nThis morning \"Gheitz\" published – and the 20 copies for sale sold before 10 a.m.\n\nTonight I read awhile in the Rec. Hut, Mais’ \"Shakespeare to O. Henry\", Richard Middleton’s The Paragraph on page 225 of the book of a great author applies almost to the unit’s reception of \"Gheitz\".\n\nNow outside Rec. Hut we’ve a cigar box for contributions, notices up existing notes & insults.\n\nAfternoon: with Basil B. to Bailleul seeking stuff for \"Bal Masque\" of Friday.\n\nMail today – T.B.C. invoice of books of entry 113, and yesterday Max Beerbohm’s \"More\" – 6\/-, Beaumont’s cataloguing 15\/-, no T.L.S. No \"To-Day\" yet.\n","57":"\n\n158.\n\nThe same dull day: but mail brought with it from T.B.C. Masefield’s \"The Old Front Line\" – the 1st impression and its already in its 20th Thousand. \"The Vengeance of Fionn\", from Maunsel, and \"Appreciation and Depreciation\", a book of Theo Talbot since and well printed and of pleasantly designed format. Tonight I’ll read \"The Old Front Line\".\n","58":"\n\n159.\n\nTomorrow night the Battalion celebrates Christmas, we here are holding a Bal Masque, enthusiasm seems well spread over the unit, and some good costumes should appear. Les and Ray C. are Two Ballet girls – costumes of fancy paper, Namby is taking her children, accompanied by Cowboys – in the hut here, now there’s isolated yarning, and a general working at ‘laidite’ endurance and at the trimming of weird hats.\n\nWe’re hoping to produce a second number of Gheitz – with the Bal Masque as the item of interest, Cartoons by Frank and self, and paragraphs generally. Contributions to date in Gheitz Box are – a well-worn half penny and the enquiring \"Who was it who bathed in Villian St. lately with a ---?\"\n\nHowever, all things going well, a second number is in the air, and there has been several enquiries.\n\nBack from 3rd Batt. Details, Eric Saxby.\n\nFebruary 14\n\n160.\n\nFrom a Boche plane dropped into the ground by hut a balloon loaded with illustrated papers – printed in French. Some fine photographs of prisoners at Cambrai, the high Boche Council and of captured French towns. Also some rather good Boche Cartoons from Lustige Blatter.\n\n161.\n\nTurning I yesterday read an hour of \"Selections from The Writings of Lord Dunsany\".\n\n162.\n\nAnother of Ray’s bulls, he talking to another chap who questioned answers \"Well my answer to that is in the \naffirmative\n negative!\" Ray – \"Never mind your negative or adjectives, I want a plain yes or no!\" Telling it to Basil, heard another of two chaps at Buire – \"What’s a deux Franc\", \"Two Francs you silly --!\"\n\n163.\n\nAlthough I’m stronger now in books than I’ve been since at Wimereux, I’m disappointed still at not receiving books from Davis and Oriole, and the pencils from B. In\n\nFebruary 14\n\nLyttle’s face there’s a great fascination, his features are not generally good but all defects are lost in the beauty of his mouth and dimples, he has a most extraordinarily happy expression when he looks up alertly – and a devilishness when he curses. Must try and sketch him well.\n\nFebruary 15\n\n164.\n\nLast night – till midnight dancing: the Bal Masque a success beyond all other Fetes of the Ambulance. We are publishing during the coming week a special No. of \"Gheitz\", working at it tonight.\n\nToday a Boche plane brought down – falling behind Bailleul.\n\nNo mail.\n\nFebruary 17.\n\n165.\n\nThe last days have been full of the working out of dresses for the carnival and the publishing of Gheitz I, and the beginnings of Gheitz 2. Yesterday Shepherd handed me a fine drawing of the Col. in his Nigger costume, and box contributions shewed appreciation by the genuine note of its contents. Number Two is to be almost entirely a souvenir number. Between ten and eleven last night, I posted on door of Rec. Hut notice of its early appearance – and the necessity of handing names early to the Canteen, now – 10.30 a.m., there are over 50 names in, and our issue cannot possibly exceed 80, perhaps 50 will represent our limit.\n\n166.\n\nPosted yesterday to Mrs. H. \"Selections from Lord Dunsany\", \"Whim\" and \"Five Poems\", 70.\n\nYesterday Jim back from Blighty leave – he posted letter to W & N during his second day in Glascow , probably there is a block somewhere in the postal lines, letters are very late & a few bombs over the H.Q. P.O. might possibly shake them up.\n\n167.\n\nToday rich in colour, but cold. Heavy frost again and iron ground.\n\nMasefield’s \"Old Front Lines\" last Chapter magnificent, stands with parts of \"Gallipoli\".\n\nFebruary 17\n\n168.\n\nMail, 1.30 p.m. From Mother of 13 Dec. written at Mark Foys, Mrs. Pockley’s evidently in the Flat and by accounts seems happy in her choice. Harold Reed is on his way back to N.Z. Greg Hoope is home. From Grandma, 16 Dec., headed \"Muston Flats No. 2\", a newsy dear letter, and from Mat, Dec. 16 six pages of coloured impressionism, she received Hodgson’s \"Poems\" and seems to have enjoyed them, hope Mother receives the lace handkerchief, probably she will, since it was posted by the same mail, at Dickebusch we heard all the Christmas mail had been sunk, by the home mail this is contradicted.\n\nFrom J. Hassal a letter inquiring if the Drawing Course is attracting me, must answer his letter and feel inclined to try it during the summer, L.U. But no Books.\n\nGrandma writes of the Referendum: \"But you seem to take more interest in books\". \"Am glad you have something to take the terrible strain your mind.\"\n\nUnfortunately when there’s a \"terrible strain\" on your mind Books are entirely out of the question, anticipating a bomb, or half listening for a shell is a trifle distracting.\n\n169.\n\nHeard the Infantry’s rumour, they not leaving Meteren till March 6.\n\nFebruary 18\n\n170.\n\nEarly this morning and last night sudden heavy rolls of gunfire, and silence. Last night raiding over the sector. Till 11 working at supplement for \"Gheitz\", a success.\n\n171.\n\nMail. From T.B.C. notification of forwarding of Hodgson’s \"The Last Blackbird\" & \"The Bull\", \"Holiday\" of Davidson’s unprocurable, but \"this we hope to secure and forward shortly\". From Commonwealth Bank notification of money arriving, writing today for its forwarding here through P.Mster. Also writing to Davis & Oriole and enclosing list –\n\n\"Plays\", Davidson, 1893, 5\/6\n\nPater, Benson, 1906, 10\/6\n\n\"Cadences\", Flint, P.B., 2\/6\n\n\"Belgium’s Agony\" Verhaeren, 3\/-\n\nAntar & Zara, Aubrey de","59":"\n\n\"Amore\", D.H. Lawrence, 6\/-\n\n- of D.H. Lawrence, Mais in his studies says, \"Is a Poet originality: still achieves beauty at intervals, but there is an undercurrent of morbidity which destroys whole true current of his arts.\n","60":"\n\n172.\n\nYesterday afternoon down to see the Hobos play the Rouen team – the Hobos winning 12-6. Arthur B. played a splendid game, and a solid one all through, he to Blighty on leave this morning. Basil this afternoon to D.H.Q. to type written matter for \"Gheitz\", drew our cover design, poor but it will have to suffice.\n\nA heavy frost this morning, but again a full sun day, clear and brilliant, eyes still bad.\n","61":"\n\n173.\n\nEarly last night raiders dropped a Bomb by Bailleul, this morning hear of it killing two of our chaps who were going on leave and seriously wounded three others – also on leave.\n\nTill 10.30 we worked at \"Gheitz\" No. 2. Basil back early from D.H.Q. with 96 copies of pages 3, 4, 5 and 6 – typed sporting news and a full account of Carnival. This morning working at pages 2 and of finishing 45 copies. Paper’s our difficulty. I’m to go now to B. for a further supply.\n\nMail: invitation to R.A.S. show in Victoria Markets, Sydney.\n\nFebruary 19\n\n174.\n\nAfter a good night’s work, 45 issues of Gheitz, of which about 20 remain with the Canteen for distribution. A success beyond all our first expectations. Till we’re able to procure 45 more sheets of smooth paper further printing will have to stand.\n\n175.\n\nThis afternoon Union team played Engineers – 6:0 in our favour. Tomorrow we play the 1st Batt. Chances are about even, but it will be a most solidly contested game. The last time we played them they beat us – for the first time since the Ambulance have had a team.\n\nTomorrow ?\n\n176.\n\nThe guns are heavily bombarding, a train of Scotties passed here two hours ago, the report reached us last night of the sudden bombarding of the","62":" report had it the Boche had attacked, our barrage had caught him, and he had lost to us 1000 prisoners, no confirmation, only rumour of this as yet.\n","63":"\n\n177.\n\nDull: a grey day of fine rain, and tonight the even ticking on the hut. The 1st Batt. badly beat our team, 22 nil.\n\nA rumour early in the day whispered of a big Boche attack, by St. Quentian and Arras, on a 17 mile front, and a deep breaking through. Later this changed, a breaking through by the French, and good ground gained.\n\nNo English mail.\n\nTo the Canteen 40 copies of Gheitz. This afternoon to Bailleul for paper & there bought of the ivory harlot in black furs Maarten’s \"The Price of Lis Doris\", 3.75.\n\nPosted letter to Mother.\n","64":"\n\n178.\n\nLetter from Mrs. H. of the pencils being posted and two parcels of books arriving, \"The Wild Swans at Coole\", \"Twelve Poems\", \"Decorations\" and \"The Glugs of Gosh\".\n\nA magnificent sun day. The Rouen team left early this morning. Jim W. with them so Jim S. and self only on Dispensary.\n\nReading this morning \"The Price of Lis Doris\", well written.\n","65":"\n\n179.\n\nToby this morning called to O.R. – something of entering in Pay Book monies for cable sent from Egypt. Probably I’ll be up shortly on same case, since the understanding from H.Qrs. was that cables could be charged against deferred pay, will question entry in P. Book.\n\n180.\n\nAfter tea for a walk to the Border with Basil, yarning of beauty and an average appreciation, of emotion felt and expressed, of genius and inspiration and of imagination.\n\nArguments that arose out of expressions of admiration for Maude Allen’s musick interpretations – \"quite unnecessary efforts\" – to quote Basil.\n\nWalking back a yarning of personal room decorations and designings discussed – green white and brown – brown, white and vermilion – endless combinings of colour.\n\nBack at D.R.S. to the Rec. Hut for Musick: the crowd at the Euchre party so a half empty hut. Yarning then to Rusty, I of Shaw and on to Alec Waugh, to London theatre and home theatres, only in one line can London shew us a lead – pure vulgarity.\n\n Payed 40 F. drawn.\n\nFebruary 22\n\n181.\n\nDull, and fine faltering rain, cold and a little wind.\n\nMail brings Ralph Hodgson’s \"The Last Blackbird\" and \"The Bull\", a Flying Flame Chapbooks. If \"The Down by Moonlight\" were the only poem of \"The Last Blackbird\" it would be worth every penny of 4\/6, it suggests it is almost the inspiration piece of his \"Song of Honour\".\n\nAlso Christmas \"Land and Water\" – W & N sketch book – a most abominable specimen, and six Venus Pencils from Mrs. H. for which Dear Mrs. H. a million thanks. Now I’ll be able to try hard a lining of Lyttle’s fascinating face.\n\nBasil and self were last night yarning of the fascination of faces. I asked him to name two of the unit who still lacking perfect features, held in their expression and manner a beauty lacking in the remainder. Almost pat came his reply, \"Well Lyttle certainly! – and Macdonald!\"\n\nLetter from Gerald: in Blighty Act. Adjt. at some Aerodrome.\n","66":"\n\nLoaned Clarrie’s \"Guy & Pauline\" – half read, but reading Maarten Maarten’s \"The Price of Lis Doris\".\n","67":"\n\n182.\n\nFrom early last night till just before dawn heavy gun fire beating – and a fire that ended in a terrible roll.\n\nIn the evening’s mist with Basil to Bailleul: the great square beautiful with its fantastick tower lording its grey openness. To quarter moonlight its loveliness would be full.\n\nSpent there about 10 F. in Magazines for Rec. Hut – from \"Gheitz\" money – and B. sends this morning the remainder – about £1.10.0 to London for Musick.\n\n183.\n\nNow thanks to a slack morning, I’ve written to Mrs. H., Aunt Louie and to the Poetry Bookshop.\n\n184.\n\nIn \"Aussie\" No. 2 – the first published drawing of Frank Dunne – a caricature of Sapper Smedley of \"The Sentimental Bloke\".\n\nDrawings Frank shewed me yesterday are evidence of the enthusiasm he’s put into his work, but he fits well in cartooning.\n\nFebruary 23\n\n185.\n\nSketched awhile, and L. sat for me, if I’ve to tackle him a hundred times I’ll at last get a good note of him. Today’s though quite a likeness, but without his lively expression.\n\nTonight in Rec. Hut, Brookes asked for loan of pen, had to refuse so he asked me to fill in form for him, did so, he gained his pound and borrowed for his signature, then asked me to witness it, did so, but would infinitely have preferred to have had nothing to do with any of his papers.\n\n186.\n\nA yarning tonight in Rec. Hut with Les F., of work in stunting and of work done at the Westhoek Aid Post during Oct. And we agreed on the elation following a long span of bloody dressing – and the enjoying to the full that spirit of perfect feeling that exists between men in the field. I count a night at Belgium Battery Corner when the Boche dropped bombs amongst the 2nd Battalion, and dressings were done standing and kneeling in deep mud, the most marvellous experience of my life, and at Flers too, my first experience of carrying across the valley, then the \"Thank you Cobber – Good luck!\" of the chap on the stretcher, was more wounderful than a cathedral benediction.\n\nOh, if only our people at home realised the natures of our men: if they saw only one tiny part of their infinite tenderness towards a wounded mate, times have been when my soul has exalted to have known beauties of deeds in ugly places.\n","68":"\n\n187.\n\nA dull damnable afternoon. Drew new - altering it for Paris leave. Frank has his money £20 – mine may arrive tomorrow.\n\nNo mail again but the damned Anzac Bulli.\n\nBasil received Verhaeren’s \"Plays\", must read \"The Cloister\" again.\n\nFebruary 25\n\n188.\n\n\"No Parade\" just blown. Heavy rain early, now wind and day’s sleet and the old Flers weather.\n\nThe Rouen team back early: Mr. Poole reports to Reinforcement Camp for \n","69":"\n\nimmediate return to Australia. Vin announces he’s going in hut while we were breakfasting – carries to us \"Mr. Poole regrets at not being able to say good bye personally\". A five minute’s notice to Return to Australia!!!\n","70":"\n\n189.\n\nLast night early Frank D. asked if I were going to try for the jobs open to Artists in A.I.F. Saw Frank S. at O.R. and read particulars – three men wanted, one for H.Q., D.H.Q. and G.H.Q. After three months at present rank, now rank of Lieut. and I dreamt last night of wearing larger stripes and apologising and defending my wearing them to myself.\n\nBut I intend to have a try for it, as does Frank D. and Shepherd. I’ll send the best sketches of sketch book and some more – one probably of the Hotel de Ville, Bailleul.\n\n190.\n\nMorning a brilliant sun, now it’s cold and grey. All day long planes have been up, going and returning, last night a terrible bombardment.\n\nRumour of leaving here 29th. Mail, Davis & Oriole only. \"Father of The Forest\" available. Wrote today for Verhaeren’s Belgium’s Agony, and one of Aubrey De Vere’s book of poetry.\n\n191.\n\nA dozen times I’ve placed out those drawings I have – contrasting them and trying to see them impartially. Lyttle sat awhile here during the afternoon, and I sketched him, that I’ll include, and the profile I did of him two days ago, and I drew one out of a shell hole grave at Flers: its cross was a rifle with two bayonets forming the arms of a cross – and a still mirror tied to the muzzle, deeply engraved with the dead name. \n\nTomorrow to Bailleul if the day’s fine, and a sketching there of the church, the tower, gable and ugly porch. Frank shewed me tonight his sketch of the Hotel de Ville, but it’s too hardly lined and too ungraceful.\n\nBasil at A.D.M.S. office could not procure any particulars but I’m woundering at the ‘camaflage’ note in the orders notice.\n\nYarning while with E. Green on Paris!\n","71":"\n\n192.\n\nA day I’ve enjoyed. Early left camp, to Bailleul with Eric G., he going on leave to Blighty. Called in at Town Mayor’s Office, and had request for permission to sketch turned down with blatant insults, then to A.P.M’s, his minions ridiculed the idea of permission being granted, so wrote short application and asked his damned insulting office boy – a Tommy – to hand it in. Unfortunately I quoted on application the wrong order – it should have been ‘Corps’ instead of ‘General’. So to O.R. 2nd Field and there borrowed a copy of the order: so back to A.P.M. and after sending it in, he saw me. He was a jolly pleasant chap, a Major, and after a while talking, he granted me – \"permission to sketch Tower and Porch of the Bailleul Church\". Then to corner of Hotel de Ville, but lorries blocked my way: so across square to Fish Market, and from an upstairs window sketched till 1.30 – then to dinner. Dinner of fried Sole, Eggs and Chips and toast . Back then to Fish Market, and after an hour’s further sketching, back to camp, a Bath and a change – Tea, and with one of the untarred Motormen to Steenwerck for French foot soap, a magnificent drive along quiet roads. And the evening ended in Rec. Hut, Vin singing and Basil playing.\n\nTomorrow we pack up.\n\n193.\n\nWillie L. has the most beautiful hands I’ve seen since noting one of the Artillery chaps, when he was holding about his head an inhalation cloth. W’s finely slender, full of rich slow movements. Basil has from St. Omer a book of Chopin.\n\n194.\n\nAfterthought –\n\nIn the Recreation Hut: it’s the first Rec. Hut we’ve had in France: from the R.C. we received at Dranoutre a poor timeless piano. Here a blind Bailleulean tuned it for us – now its fine. A clean warm hut and a great iron stove: a dozen deck chairs, and half a dozen deck stools, papers and old magazines. Night, and always it is crowded – Bridge fours,\n","72":"\n\nreaders, and quiet yarners, then Basil at the piano, and Vin or Roy singing, the evenings here have passed quickly and well, now for war work again, and the faint ticking of rain is over the hut.\n","73":"\n\n195.\n\nLast night the best ‘rough house’ for ages. Johnny under compulsion \"Why Whunded\".\n\nA night of hellish nightmare, and today a slight touch of Trench Fever. Packing all finished – C Section already moved off for M.D.S. Kemmel. We tomorrow morning.\n\nBooks distributed amongst Drugs, with A.A.D. Room staff, and O.R. boxes. A lovely April day of sun and white clouded skies, twice it has snowed slightly and now the light over the country is clear and rich with fine colour.\n\nNo mail, expecting W. Watson’s \"Father of The Forest\".\n\nEnds February at R’Avelsburg.\n\nMarch\n","74":"\n\nAt the M.D.S. in Kemmel, Belgium.\n\n196.\n\nOn the 1st at 10 a.m. relieved at Ravelsburg by 4th Field and a marching to here taking over M.D.S. from 13th F.A. Arrived here with Temp. of 102.5° and a fair dose of Trench Fever, admitted to hosp. and \"still going strong\". The Col. just blew in. \"How are you, Sergt.?\" to Frank K, - down with Flue\" – and you, Molony, both feeling better? eh, eh?\" – and he had blown far along the duckboards.\n\n197.\n\nThis is a quiet front. On the night of the","75":" the Boche raided as our Battalions were changing over – 1st Div. relieving the 4th – he broke through to a Company H.Qtrs. and our guns opened the concerted argumenting and for over an hour the world trembled to their individual recoils.\n\n\"Gheitz\" of the stunt are vague: but evidently he attacked up to Passchendaele and by reports his losses far heavier than ours. Snow fell yesterday.\n","76":"\n\n198.\n\nMails in yesterday: early directly after breakfast two Muston letters, one long dear chronicle of home from Mother of Dec. 16, and one from Billy, same date.\n\nBetty’s reminded me of the paragraph of Guy & Pauline – \"Pauline put the letter in its crackling envelope with a sigh for the unformed hand in which it was written. Nothing brought home to her so nearly as this hand-writing of hers the muddle she was always apt to make of things. How it sprawled across the page, so unlike Monica’s that was small and neat and exquisitely formed or Margaret’s that was decorated with fantastic and beautiful affectations of manner.\"\n\nThe lace Handkerchief from Poperinghe and \"The Letters of a Soldier\" arrived safely – and already Mother has read and loves them. They are lovelier than all Russkin’s prose, and as lovely as parts of Pater.\n\nFrom Davis & Oriole \"The Father of The Forest\", W. Watson’s – with one lovely Lyric. Later in the day arrived letter from T.B.C. – note on Drinkwater’s 1908-14 being despatched and Stephen’s \"Reincarnations\" not being yet published. From Poetry Bookshop word of \"Trees\" being despatched and report of Chapbooks –\n\n\"The Old Ships\", 4\/-\n\nSpring Morning, 2\/-\n\nFarmer’s Bride, 2\/-\n\nChildren of Love, 1\/-\n\nAntwerp, 3\/-\n\nStrange Meetings, 1\/-\n\nDavis & Oriole saving me \"Cadences\" – 2\/6.\n\nMarch 4\n\n199.\n\nUp today, saw Sheppherd drawing for G.H.Q., good drawing but hard.\n\n200.\n\nPrinted out pages 4, 5, 6 and 7 of 3rd number of Gheitz: under \"Digger\", Capt. Barbour sent in good account of Rouen Team’s trip and comments.\\\n\nMail. Letter of Jan. 3rd, Betty, from Bank and T.B.C. of renewal of T.L.S. subscription. Later arrived Munro’s \"Trees\", a beautiful book with some fine woodcut drawings, bound in black and well printed.\n\nHarold L. in today.\n\nRain.\n","77":" 4, 5, 7\n\n201.\n\nA French Interpreter comes in wet and tired – \"All day I have been on night duty: I am wet, I am tired and I am ‘angry’, give me something to eat, I am fed up!\"\n","78":"\n\n202.\n\nThree great bombardments during the night of","79":" Slept brokenly. Today up, but still in hosp. Read \"Thomas Hardy\" by Mais in \"Shakespeare to O. Henry\". Must get hold of some of his poetry.\n\nBasil getting on with \"Gheitz 3\". No Mail.\n\nRead again \"Trees\" that arrived yesterday: glad I know some of Munro’s stuff other than that in Georgian Poetry 1916, 1917.\n","80":"\n\n203.\n\nWith Frank K. for a walk to the O.P’s Kemmel Hill, lying on fresh clean grass, full in the sun, well sheltered from the cold winds. Just before leaving M.D.S. took from pannier \"Keats\" and read awhile in the sun.\n\nSlept in A. Sect. Bearers Hut and this morning with Les F. cleaning instruments of surgical cases.\n\nLast night Sheppherd gave us cover of Gheitz 3 – a good well drawn joke. Page 8 to be compleated tonight by Basil.\n\n204.\n\nLast night the Boche towelled the 9th with gas shells, this afternoon dressing gassed men, about 150 in all passed through. Eyes sore, with slight irritation from gas on clothing.\n\nA grey day with a poor faint sun occasionally. No mail again, time books from Davis & Oriole arrived. Arthur Bull back from England.\n\n205.\n\nThere’s a cold crispness in the air, and the great gun firing has its noise long carried by the shells hot breath. Flames are softly rising and falling – swiftly arching and falling with dazzling brilliance. Guns are intermittent, occasionally a burst of machine gun fire, then a moment’s silence. A Gas Alarm is on.\n","81":"\n\n206.\n\nTwo letters from Mother, Jan. 3, 7. Three pages written in part reply, and two page letter to Lindsay posted, G. Envelope. \n\nTaken over gas treatment with Les F.\n\nPosted away \"Trees\", \"The Bull\" and \"Last Blackbird\".\n\nWashed breeches and grouted pair of Aussy puttees and new greatcoat Aust. issue.\n\nMarch 8\n\n207.\n\nThe village church – half its slates off and a few torn holes in its roof, and all its hipping and ridging torn from over the Apse – is very pathetick. All over its tiled floor, old prayer chairs still stand grouped in huddled silent fear about a pew despoiled of its rain soiled plaster, or closely hug the low panelled walls. The altar rail is of roughly carved oak, from the carvings the old hope arises that here is genuine peasant work, carved with enthusiasm and love, and still the red prayer cushion is half along its length.\n\nThe altars are broken, rain soiled and all despoiled, on the high altar still stands a crudely coloured Christ. On one altar there has great knife gushes about its keyhole. The windows of stained glass are fantastick traceries of colour and open spaces, and still is the litter of the old piece over the rough floor tiling.\n\nThis afternoon Basil B. and self climbed the bell tower, one corner has fallen to a shell, but the great bell’s scaffolding is unbroken. What a wounderful place to watch a night barrage bombarding from.\n\nPoor churches of Belgium, crude designing and unlovely shrines for the terrible sacrifice of the Mass, but they are true entirely to their peasant worshippers, brilliantly coloured and devoid of any aesthetick beauties, still they remain a true impression of their dull faith.\n","82":"\n\n208.\n\nWriting in the P.L.M. Express between Calais and Boulogne en route for Paris.\n\nSlept last night in Bailleul, in a quaint tiny room in a house of old woman, they invited us in and charmingly received us, and sent us off early to catch leave train with all wishes for \"a good \".\n\n209.\n\nToo good a night to miss its entry. Yesterday at Kemmel a Boche over photographing for one of our planes & suddenly 4 of ours started chasing him. Jove it was a magnificent\n","83":"\n\nexhibition of fast perfect flying, sudden dives, climbs and feints, hell for leather they swooped over our station not higher than 150 feet, swept higher, across and around, machine guns barking and all exhausts open, and they drove him to earth, one swept mightily around him and then straight down over him, and the four slackened, climbed and drifted lazely in the even blue.\n\nToday the first day of our leave: passes came through O.R. at 1.30 yesterday afternoon. \n\n210.\n\nIn the compartment with us is one other Australian, an impish Aust. Cockney. He’s given the \"Gheitz\" an half a dozen war subjects, and against the questioning last night English. Boche raid being helped by the Aurora Borealis, he’s of the opinion that \"anyhow their spy system isn’t as good as that!\" He is the first Australian I’ve heard refer to Haig as \"Doug Haig\".\n\nParis\n\nMarch 11\n\n211.\n\nMidnight, and a raid on. The programme of the \"Folies Bergere\" cut short and the house emptied: by exit doors amateur auctioneers recited long lists of the places of refuge: the streets black, filled with a hard darkness, by a series of miracles we found our Rue de Arcadie and our Hotel Belmont.\n\nLast night we arrived at 8.30 – and in motors to reporting H.Qtrs. – a lecture, and a presentation of a mystery: tube, supper at the Y.M. and to the Hotel Bretaigne, where we’d intended staying at the Hotel Grand Bretaigne: 2, 1, 1, 1, 1, 1, Bombs! Left there early this morning, a day full of grey deep mists, even the opposite side of the roads’ buildings were only looming shadows: the sun over all, a clean cut deep orange ball, devoid of fire. The Hotel Grand Bretaigne full, so to Hotel Bedford – a two bed’d room of red, gold and mirrors: comfortable though and beds luxuriously linen sheeted and sumptuously white.\n\nThe morning passed walking about, and I have found a shop selling books of fine reproductions.\n","84":"\n\n- a book of Rodin and Degas amongst the window’s show. To the Medaillane and to the Louvre, closed! Dull disappointments everywhere, fine monuments sandbagged, and a mist hiding all long lovely vistas of buildings and statues.\n\nBooked seats for tomorrow’s \"Hamlet\" at the Opera and at the Y.M. seats for \"Paris trip No. 1\" tomorrow at 11.\n\nAt Smiths bought book of Edward Thomas’ \"The Tenth Muse\" and later a book of Poulbot’s exquisite drawings of kiddies.\n\nSome part of Paris is getting a fair towelling tonight! God how futile these raids are. And so To Bed!\n","85":"\n\n212.\n\nA splendid sun day, last night slept long & soundly loving the cool kindliness of sheets forgetting \"the rough male kiss of blankets\". Now waiting for breakfast.\n\n213.\n\nBack from the Opera, turning in. A splendid night and a fine show. The plan of Hamlet cleverly twisted and designed to present a rich and far less terrible ‘Hamlet’ than Shakespeare’s. Hamlet, responding to the third sudden appearance of his father’s ghost in the last act, kills his uncle, and the finish is \"Vive la Roi\". Hamlet is king.\n\nA fascinating and gripping play, and magnificently seeing & a wounderful art in the stage lighting.\n\nDuring the day the Paris No. 1, a good trip and enjoyed tremendously. We are foreigners in a lovely city: that is our tragedy, these lovely buildings I cannot grip hardly in my mind, their loveliness overpowers, numbs all appreciation but a dim almost abnormal one.\n\n214.\n\nBooked for Versailles tomorrow, Paris No. 2 on Thursday and the Opera \"Faust\" on Saturday, \"Aida\" on Thursday night, must work Frank to a desire for it and if possible Materlinck’s \"Pelais et Melisande tomorrow night. And so again to bed\n","86":"\n\n215.\n\n8.30 a.m. The talk at the Opera last night of big casualties during the air raid, 60 are said to have been killed at one place, and a rumour too, of two spys having been caught giving signals to the raiders by the Office of the Minister for the Interior, where several bombs dropped. At the Madelaine and the St. Agustine, heavy black and silver drapings were over doors and altars. We were in the Madelaine and great mourning clothes covered half the church, all the altars’ candles glimmered, all lights were glowing and in a forest of steady tapers high on its pedestal draped was a coffin, leaving a minute later another coffin was being carried up the steps, covered and accompanied by great massed grouping of violets, roses and tulips. Were they air raid victims?\n\n Over 100 killed in raid, and a big number wounded.\n","87":"\n\n216.\n\nYesterday: To Versailles, a good trip, but disappointment. The legend of Versailles broken, the imagined beauties of interiors lost in an orgie of gold and painted ceilings.\n\nHalf of the Palaces closed, and the bronzes of the fountains and walks sandbagged against raids, and tapestries leaving bare dull walls carrying overwhelming ceilings. No time for the seeing of the Petit Trianon: by photos the loveliest gem of all. Sunday we are for Fountainbleu – and I’m looking forward to an appreciation I did not feel for Versailles. There almost a burst of gold, and a coldness of unnatural affectation left only the impression of a wounder at the period that had produced it.\n\nThe Louvre remains the loveliest building of my love.\n\nNight to the Alhambra – an empty theatre and a charming drawing by Poulbot at the back of the programme.\n\n217.\n\nToday for Paris No. 2 Trip.\n\nBack at Hotel after a second trip, to Notre Dame, Musee de Cluny, and the Parthenon, three wounderful experiences but spoilt by shortness of time.\n\nThe Notre Dame a beautiful cathedral, less full and\n\nMarch 14\n\nso suggestive of a crouching vitality as Amiens: windows wounderfully rich, especially 4 small windows in the trancept sides, magnificent fire and flame, red and gold cloistory windows, and the two trancept rose windows full of loveliness of colour, but not touching Amiens for autumnal brilliance of gold and green, the plan of the church appeals more than that of Amiens, a double row of heavy deep columns beautifully capped makes an interior of deep lovely shadows in which the windows are splendid. Will walk there tomorrow, also to Parthenon, which we only saw from the motor. Rodin’s ‘Thinker’ has the place of honour before the perfect building, and a cursory glance ever leaves a fine impression.\n\nMusee de Cluny a gem of a building, a fine restraint and selection of detail, and full of the spirit of a great age of appreciation. Content wounderful, some fine carvings, chimney piece and a staircase.\n\nTonight for the Opera \"Aida\". Frank booked for Casino de Paris but since tomorrow in the Olympia. I’m full sick of damned sandwiches.\n\n218.\n\nAmongst the chaps on leave in Paris, that are doing the Y.M. trips, three stand out as fascinating figures. One, a 4th Brig. M.G., slim, dark and small featured, is full of sudden graces and rare smiles: there’s a strange suggestion of pain often faintly behind his smile. A 4th Divisional Artillery Signaller, fascinates by a splendidly proportioned build and a wounderful neck. The others, a Canadian, with a deal of Indian blood in him, his features are cruel and hardly carved, his hips of iron wounderful curves, his face is full of an intensity of expression hard to define, difficult to ignore. He would be perfect if suddenly struck in bronze. And so to Dinner.\n\nBack from Aida, and a splendidly enjoyed evening. Written a six page letter to Mother.\n","88":"\n\n219.\n\nOur 6th day ended. Tonight to the Olympia and another mid-victorian show of bicycle stunts and juggling.\n\nTo the Notre Dame, through the gardens of the Louvre, to the Parthenon, and to the Eglise St. Etienne-de-Mont, a beautiful building full of Italian influence and design. Lunch at the Medici Café by the Luxembourg and on through the gardens to the Musee.\n\nNot 50 yards from the Gallery, alongside a great bronze group of Bacchus and nymphs, on Monday a bomb fell, and the gallery is full of most wounderful bronzes, and encircled by them. One gallery entirely directed to etchings by Brangwn and Rodin statues. The Age of Bronze, John the Baptist, a Burghers of Calais, and Eve, besides six busts. One drawing of Beardsley’s of Dulais and of Rackham’s, a splendid collection of lovely pictures, Conder and a hundred others.\n\nMarch 15\n\nSo through St. Germain and to St. Surplice. There was at about 2 p.m., there was a long explosion in the distance, followed by another and another, a panic started, people fearing bombs, but to us it was more like a great cannonading heard for an instant and lost.\n\nIn the church I was surrounded by women in black and one fine old matron earnestly asked where the ‘bombs’ were falling. I assured her they were not bombs, and believing me she did a deal to prevent a panic.\n\nThe explosions were at St. Dennis, in the heart of the Munitions factories, and tonight’s terrible rumour is of over 3000 being dead by the fire. At Sacre Coeur one of the doors was thrown from its framework. Sacre Coeur a fine building, but unappealing. Heard there a beginning of a service and some rich chanting.\n\nOpposite the Louvre this morning discovered\n\nMarch 15\n\na lovely extravagant Gothick church, some of the interior designings of doors and windows very lovely: I think it would be Italian design partly.\n\n220.\n\nPosted home books of Versailles and of Musee de Cluny and half of Post Cards of Notre Dame – bought about 190 in all, or ‘full’ set.\n\n230.\n\nThe harlots of the Olympia parades disappointing beyond writing. Gaiety of their affectation is charming if well carried out, but half heartedly as it is, mean and piteous. Those who fail in the house and on the promenades during the shows urgently seek company on the boulevards, and somehow the agony of their failure seems to pass to you as they flaunt their sex.\n\nLicentiousness in the abstract is charming: in the horrible.\n\nThe very expression of these women repels and physically nauseates: somehow it is difficult to find beauty where a hunger lives behind. \n\nOne contradicted her deep crepe mourning veil with white rouged cheeks, black eye, and a long cigarette between vermilion lips.\n","89":"\n\n231.\n\nThis morning to the Musee Gugerli Galleria: there an Exposition D’Art Decoratif, disappointing, but some fine exhibits, made some rough sketch notes on cover of Saturday’s Evening Post. A fine cover design by Legdendecker , through the Champs a Elyee, dinner at Hotel, and out again. To Smiths and bought two Erskine McDonald books of verse, a book of English Cathedrals by Bond, and Thomas Burke’s \"Limehouse Nights\", to be sent on to the Ambulance. Later bought there a Riccardo and a Florentine Press book – \"The Heroes\", 72F. and \"Little Towns of Flanders\", 18.50.\n\nTo the Opera, Faust, good singing and a fine Ballet.\n\nOur last night in wounderful bed sheets, we’re to leave tomorrow at 5.30, meeting at Place de Concorde for Fontainbleu. Great Expectations.\n","90":"\n\nKemmel M.D.S.\n\n232.\n\nArrived Bailleul at 5 and back to M.D.S. – being shell’d H.V. about 7 p.m.\n\nFor some days the Boche has been shelling Kemmel, and yesterday morning blew up our Pack Store, only wounding Johnno, who was in it, & trussing Capt. Barbour, also in it. Library blown to the four winds.\n\nAs we arrived last night at intervals shells were falling, super whiz bangs.\n\nBailleul has suffered too, we seeing as we passed through several houses completely demolished. Last night’s nearest shell was by the corner of the old Mess Hut.\n\nBig batch of \"Gheitz\" Musick has arrived while I was away: some fine stuff amongst it, and a book of English Folk Songs by Vaughan Williams.\n\nMail awaiting – two home letters of Christmas day, one splendid note from Mother, and a parcel of Davis & Oriole books: A.C. Benson’s \"Walter Pater\", Flint’s \"Cadences\", Verhaeren’s \"Belgium’s Agony\" and a book of Aubrey de Vere’s Poetry, also packet of sweets and gloves from Mat.\n\n233.\n\nReconstruction of Sunday. Up at 3.30 a.m. and to Place de la Concorde, left there at 7, to Gare d’Lyons and train to Fontainebleau. Arrived there at 10, to the Palace.\n\nA splendour of Architectural Ceilings and room designing far lovelier than Versailles. The Palace buildings and design appealing before Versailles. The afternoon through the Bois on wagons, and an enjoyed drive.\n\nBack to Paris by 6 to the Hotel, and a settling of bills and tips, and to the Canadian Y.M. hut for supper. Train from Gare du Nord at 11.40 and a long travelling to Calais arriving there at Midday. Train to Hazebrouck and changing on to Bailleul.\n\nSo home, to a hot corner and sleeping in cellars, a llistening to sudden tearing sways and krumpings.\n","91":"\n\n234.\n\nEvening. A day of insistent rain and periods of shelling: One of the morning’s shells wreaked the house of the only Belgian in the village – the house of the Belgian M.P. and his two women, casualties, their dog.\n\nMail: Literary Supplement of March 14, March 7’s contains announcement of a new book of war verse by Gilbert Frankeau, writing tonight for it, will post it after payday, and enclose £2 on account. From Paris leave, out of £20.18.0, 50 odd francs left.\n\nA parcel today from Mother, sox, handkerchief and chocolate and pastes.\n\nBailleul, Hazebrouck, Reninghelst and all villages of back areas receiving an issue of shells. Bailleul’s great, stolidly beautiful towers may perhaps follow the towers of Dranoutre and Ypres. Today reading awhile Verhaeren’s \"Belgium’s Agony\", it is a splendidly true book of a great man, and to place aside \"The Letters of a Soldier\" and Masefield’s \"Gallipoli\". Posted away home books of Synge & Aubrey de Vere.\n","92":"\n\n235.\n\nBack after wounding at the Menin Road, Lofty H. & Sapper, and from Blighty arriving today Willie L. and Wilk.\n\n236.\n\nOn night duty – all A.N.S. – in hut: station kept cleared on account of shelling so only four in, 10th and 17th Batt. chaps, dead to the world.\n\nTalks of rumours of our shortly leaving the line, going out for a 16 days reorganising – one Batt. to be cut out of each Brigade, and then a big hop over stunt, to clash hard against the one we’re expecting from the Boche.\n\nMarch 20\n\n237.\n\n10.30 p.m. Shelling Dranoutre, shells passing over and seeming to land there.\n\nThis morning a deep mist around the hill and Kemmel, up at six, the sun shining, and a clear sky. Tonight a ¾ moon in a deep sky.\n\nBoche planes passed over about an hour ago. Station empty. Keeping clear owing to regular shellings.\n\nMarch 20\n\n230.\n\nNo mail: written to Mother, to Gerald, and to Davis & Oriole paying 12\/-, clearing now parcel received on Monday.\n\nReading \"The Tenth Muse\", a jolly fine and fascinating essay: must read Donne and Chaucer.\n\nAt the P.O. found the","93":" number of the Sydneian, Roll of Honour numbers listing of 1461 names.\n\nQuoted in Notes & News is part of a poem of an old Harrovian,\n\n\"And the boy’s beauty passed off the face,\n\nAnd manly tears made mist upon their eyes,\n\nAnd thoughts beyond their thoughts the spirit lent\n\nAnd to them came a great presentiment\n\nOf high self sacrifice.\n\n231.\n\nAt the University Junior Exam, I first saw him – sitting behind him to the side. Then in Manly. I knew every change of expression on his lovely face. To have known him well I would have been happy, but it was only a casual acquaintance. His name is in deep lettering on the Sydneian Honour Roll – Arnold Drysdale Savage, Pte., Inf. He was a very great friend of Cliff. Requiescat.\n","94":"\n\n232.\n\nBreak of day – a hellish bombardment carrying down from the line, and about Kemmel a hundred birds whistling and singing.\n\nA night of black whipping shrapnel and shelling, shraps. through half of the huts, and from shells more alarms than casualties.\n\nAt midnight started a furious line bombardment, lasting over an hour, a rumour of our sending over gas, and of stunting heard from chaps in last night.\n\n233.\n\nEvening: before turning in \"Shelled out of Kemmel\". The unit now somewhere about three miles from the old M.D.S. Shelling that has lasted a week with last night’s ration and today’s made evacuation imperative.\n\nA. Tent subdivision with Chud here still in Brewery Cellars as Dressing Station for Artillery and Local Casualties.\n\nSelf on clerical work, day, so tonight a sleep.\n\n234.\n\nA round trip through the Stations found me Masefield’s \"Dauber\". I’ve read the first canto, & could go straight through losing all sense of time, but my eyes are bad: today\n\nMarch 21\n\ntreating a lot of gassed chaps from the last night’s stunt. I started reading, with a handy pencil, and first marked,\n\n\"Dim with green bubbles and twisted water meets\"\n\nand found later the reader before me had read with a pencil, saith,\n\n\"Wind-steadied arches leaning on the right\".\n\nIt’s great to read a book marked by an unknown, there’s the fascination of constructing an \"Imaginary Portrait\". \n\nMasefield at Kemmel, escaping long bombarding, by the strange ironies of change, casualties have been a dog of the Belgian killed. Two days ago, their house was wreaked & the dog killed. Blowing sky – high over Pack Store. Johnno has a broken nose, today the temporary pack store – an operating tent, lost itself and its packs, leaving only a great shell hole. Davies’ Bagpipes were there. Davy will never believe their murder is at the Boche’s door, if he does he’ll declare war, and join the Infantry.\n\nNow for bed and the feeling that sleep will be heaven. Today a day of severe vertical breezes!\n\nMarch 22\n\n235,\n\nEvening, one of shells of last night’s accompaniment through the Brewery and out a window. Slept with only one waking, when the bricks fell. Shelling today caught one of 55th Bty. chaps by the Y.M., and severed leg by ankle, another shell killed one orig. 4th chap at baths & wounded others, we there at the toot with lbs. of dressings. Last night one of Y.M. men knocked. Report is of Dranoutre being heavily shelled and one of Y.M. men killed, also about a dozen horses.\n\n235B.\n\nBullecourt lives in war again – falling it is now reported – by rumour – having been taken by the Yankees. \"So the Yanks have had a win!\", one of our Engineers told us.\n\nWe’ve found here, and taken to our company, a war cat with only three legs. A bonser old cat, asleep by the fire.\n","95":"\n\n236.\n\nRoy just brings mail in – a book from T.B.C., Padraic Pearse by the format. \n\nI intended to enter it yesterday, Harry J. was responsible, seeing Lofty reading Oxenham’s book of verse –\n\n\"John Oxenham! oh it was Harry Oxenham I used to with!\"\n\n237.\n\nA reading finished of \"Dauber\", read by a split wood fire in a great open grate, and sitting on a deep cane salvaged chair – like the old one in my old room, comfort even to the cat purring on my lap.\n\nCanto VI\n\nDauber the most thrilling narrative poem I’ve read, must pass it to Les F.\n\nA splendid spring day: but we stayed inside!\n\nMarch 23\n\n238.\n\nA mail up, Australian to date of Jan. 23, none for self.\n\nLast night’s shelling caught Y.M. building and wrecked one side, also blew in windows of old Medical Hut. Other shells seemed red, but no casualties.\n\nMarch 23\n\n239.\n\nEarly evening of a splendid summer day. This afternoon we lay in the Ambulance, full in the hot sun, yarning of surfing and days of sun. Vertical breeze – so to dugout. Out again, Les finishing Dauber, self reading Pearse’s Rebel songs.\n\n240.\n\nThe rumour comes of the Germans being in Veaux, an advance by them on a twenty mile front – Bullecourt, Lagnicourt and Noreiul falling. Wireless sets free the rumour of Veaux falling at 11.15 this morning. Part of Passchendaele reported lost, Bailleul out of bounds to all but Despatch Riders, they using its roads at a big risk. Rumour earlier whispered of the tower of Bailleul’s Hotel de Ville being knocked. Our reserve Division moving for Somme front.\n\nY.M. evacuated this morning, only an Artillery encampment, Traffick and ourselves left.\n\n241.\n\nEntering in bed, when the Ambulance left, we salvaged half a dozen R.C. set of pyjamas, bonser soft fine flannel ones: mine fawn patchy blue striped, their softness on the body a most exquisite sensation,\n","96":"\n\nHow must they feel to the wounded Infantry men – half exhausted travelling from the line, after a clean dressing over his woundings and in place of mud-sodden sweat-dried lousy dirty underwear. More than we can realise, the R.C., the Comforts Fund and the Y.M. work for us.\n\nThere’s the drone in the air of Boche planes: since I’ve been back from Paris the days skies have been clear from their planes, the nights full of moonlight, and quiet but for the slow intermittent guns’ firing. Lately line bombardments seem to have been lost in the back area shelling.\n\nSo to read on, \"The Vengeance of Fionn\", far more fascinating and beautiful than Keats’ Endymion and worse luck, not half so long.\n\nLa Clytte\n\nMarch 24\n\n242.\n\nAt 8 this morning a sudden leaving of the Brewery, Kemmel, and a marching to the temporary M.D.S. by La Clytte. A day of rumours and splendid sun.\n\nMarch 24\n\nThe Boche at Veaux and an official statement of our losing 200 guns and 16000 men, rumour adds 400 guns to the official report.\n\nA rumour early this afternoon of his being in Le Sars! – nothing before him, our side mainly defending the flank. Now this seems generally contradicted. A rumour of the French taking 50,000 prisoners, closing in and out flanking him on his weighty advance.\n\nCasualties by the B must be heavy, our M. Gunners reaping a terrible harvest, a rumour talks of the Boche asking for a 12 hours armistice to bury his 80,000 dead: his casualties ranging from 150,000 to 200,000, 4 hours said to have been granted him (?).\n\nRumour riots, and a dozen tales are told.\n\nIf his casualties are so heavy, and his advance created such a salient, if we have guns, this advance of his will not so badly defeat us. It is certain he has\n","97":"\n\nbeen frightfully callous in throwing forward great masses of men, sheer weight for his success.\n\n243.\n\nMail, from Smiths, Paris, \"Cathedrals of England & Wales\", two E.N. books of Georgian Verse, and \"Limehouse Nights\", a bonser letter from Mother of Jan. 27, one from Hazel, and one from Mat.\n\nDetailed for Night Duty – in Cookhouse.\n\n244.\n\nLying full in the afternoon sun finished reading of \"The Vengeance of Fionn\". I’ll read it again.\n\n245.\n\nC. Section to a station by Ravelsberg, to take over a section station. 4th shelled out. \n\nTonight saw Mick B. and Jimmy O’F., they down from Reserve, go into line posts tomorrow.\n","98":"\n\n246.\n\nDuty last night - Babbling and a damn dirty job, would sooner the Infantry than Cookhouse. Turning in after a long night.\n\nMet in Dressing room old Woollahra boy – Hoptroph (spelling’s wrong). He in the 1st Bgde. French Mortars. A yarning of old Woolahrians and a long list of them dead here.\n\nBombing during the night, mostly towards Dickebusch, 3 kilos away. Major Lee brings in late rumour of Peronne falling to the Boche.\n\nReading Burke’s \"Limehouse Nights\", two yarns read and two gems, but for loveliness of description I like his \"Twinkletoes\". Writing 4 pages of letter to Mother, 4 pages to Mat.\n\nSo to sleep, brought from A. Camp \"’Dorian Gray\", Ruskin and Murdock, but too tired to read.\n\n"}}