{"Document Name":{"0":"Diary_0102","1":"Diary_0102","2":"Diary_0102","3":"Diary_0102","4":"Diary_0102","5":"Diary_0102","6":"Diary_0102","7":"Diary_0102","8":"Diary_0102","9":"Diary_0102","10":"Diary_0102","11":"Diary_0102","12":"Diary_0102","13":"Diary_0102","14":"Diary_0102","15":"Diary_0102","16":"Diary_0102","17":"Diary_0102","18":"Diary_0102","19":"Diary_0102","20":"Diary_0102","21":"Diary_0102","22":"Diary_0102","23":"Diary_0102","24":"Diary_0102","25":"Diary_0102","26":"Diary_0102","27":"Diary_0102","28":"Diary_0102","29":"Diary_0102","30":"Diary_0102","31":"Diary_0102","32":"Diary_0102","33":"Diary_0102","34":"Diary_0102","35":"Diary_0102","36":"Diary_0102","37":"Diary_0102","38":"Diary_0102","39":"Diary_0102","40":"Diary_0102","41":"Diary_0102","42":"Diary_0102","43":"Diary_0102","44":"Diary_0102","45":"Diary_0102","46":"Diary_0102","47":"Diary_0102","48":"Diary_0102","49":"Diary_0102","50":"Diary_0102","51":"Diary_0102","52":"Diary_0102","53":"Diary_0102","54":"Diary_0102","55":"Diary_0102","56":"Diary_0102","57":"Diary_0102","58":"Diary_0102","59":"Diary_0102","60":"Diary_0102","61":"Diary_0102","62":"Diary_0102","63":"Diary_0102","64":"Diary_0102","65":"Diary_0102","66":"Diary_0102","67":"Diary_0102","68":"Diary_0102","69":"Diary_0102","70":"Diary_0102","71":"Diary_0102","72":"Diary_0102","73":"Diary_0102","74":"Diary_0102","75":"Diary_0102","76":"Diary_0102","77":"Diary_0102","78":"Diary_0102","79":"Diary_0102","80":"Diary_0102","81":"Diary_0102","82":"Diary_0102","83":"Diary_0102","84":"Diary_0102","85":"Diary_0102","86":"Diary_0102","87":"Diary_0102","88":"Diary_0102","89":"Diary_0102","90":"Diary_0102","91":"Diary_0102","92":"Diary_0102","93":"Diary_0102","94":"Diary_0102","95":"Diary_0102","96":"Diary_0102","97":"Diary_0102","98":"Diary_0102","99":"Diary_0102","100":"Diary_0102","101":"Diary_0102","102":"Diary_0102","103":"Diary_0102","104":"Diary_0102","105":"Diary_0102","106":"Diary_0102","107":"Diary_0102","108":"Diary_0102","109":"Diary_0102","110":"Diary_0102","111":"Diary_0102","112":"Diary_0102","113":"Diary_0102","114":"Diary_0102","115":"Diary_0102","116":"Diary_0102","117":"Diary_0102","118":"Diary_0102","119":"Diary_0102","120":"Diary_0102","121":"Diary_0102","122":"Diary_0102","123":"Diary_0102","124":"Diary_0102","125":"Diary_0102","126":"Diary_0102","127":"Diary_0102","128":"Diary_0102","129":"Diary_0102","130":"Diary_0102","131":"Diary_0102","132":"Diary_0102","133":"Diary_0102","134":"Diary_0102","135":"Diary_0102","136":"Diary_0102","137":"Diary_0102","138":"Diary_0102","139":"Diary_0102","140":"Diary_0102","141":"Diary_0102","142":"Diary_0102","143":"Diary_0102","144":"Diary_0102","145":"Diary_0102","146":"Diary_0102","147":"Diary_0102","148":"Diary_0102","149":"Diary_0102","150":"Diary_0102","151":"Diary_0102","152":"Diary_0102","153":"Diary_0102","154":"Diary_0102","155":"Diary_0102","156":"Diary_0102","157":"Diary_0102","158":"Diary_0102","159":"Diary_0102","160":"Diary_0102","161":"Diary_0102","162":"Diary_0102","163":"Diary_0102","164":"Diary_0102","165":"Diary_0102","166":"Diary_0102","167":"Diary_0102","168":"Diary_0102","169":"Diary_0102","170":"Diary_0102","171":"Diary_0102","172":"Diary_0102","173":"Diary_0102","174":"Diary_0102","175":"Diary_0102","176":"Diary_0102","177":"Diary_0102","178":"Diary_0102","179":"Diary_0102","180":"Diary_0102","181":"Diary_0102","182":"Diary_0102","183":"Diary_0102","184":"Diary_0102","185":"Diary_0102","186":"Diary_0102","187":"Diary_0102","188":"Diary_0102","189":"Diary_0102","190":"Diary_0102","191":"Diary_0102","192":"Diary_0102","193":"Diary_0102","194":"Diary_0102","195":"Diary_0102","196":"Diary_0102","197":"Diary_0102","198":"Diary_0102","199":"Diary_0102","200":"Diary_0102","201":"Diary_0102","202":"Diary_0102","203":"Diary_0102","204":"Diary_0102","205":"Diary_0102","206":"Diary_0102","207":"Diary_0102","208":"Diary_0102","209":"Diary_0102","210":"Diary_0102","211":"Diary_0102","212":"Diary_0102","213":"Diary_0102","214":"Diary_0102","215":"Diary_0102","216":"Diary_0102","217":"Diary_0102","218":"Diary_0102","219":"Diary_0102","220":"Diary_0102","221":"Diary_0102","222":"Diary_0102","223":"Diary_0102","224":"Diary_0102","225":"Diary_0102","226":"Diary_0102","227":"Diary_0102","228":"Diary_0102","229":"Diary_0102","230":"Diary_0102","231":"Diary_0102","232":"Diary_0102","233":"Diary_0102","234":"Diary_0102","235":"Diary_0102","236":"Diary_0102","237":"Diary_0102","238":"Diary_0102","239":"Diary_0102","240":"Diary_0102","241":"Diary_0102","242":"Diary_0102","243":"Diary_0102","244":"Diary_0102","245":"Diary_0102","246":"Diary_0102","247":"Diary_0102","248":"Diary_0102","249":"Diary_0102"},"Date":{"0":"unknown","1":1519.0,"2":1520.0,"3":1521.0,"4":1522.0,"5":1523.0,"6":1524.0,"7":1525.0,"8":1526.0,"9":1527.0,"10":1528.0,"11":1529.0,"12":1530.0,"13":1531.0,"14":1532.0,"15":1533.0,"16":1534.0,"17":1535.0,"18":1536.0,"19":1537.0,"20":1538.0,"21":1539.0,"22":1540.0,"23":1541.0,"24":1542.0,"25":1543.0,"26":1544.0,"27":1545.0,"28":1546.0,"29":1547.0,"30":1548.0,"31":1550.0,"32":1551.0,"33":1552.0,"34":1553.0,"35":1554.0,"36":1555.0,"37":1556.0,"38":1557.0,"39":1558.0,"40":1559.0,"41":1560.0,"42":1561.0,"43":1562.0,"44":1563.0,"45":1564.0,"46":1565.0,"47":1566.0,"48":1567.0,"49":1568.0,"50":1569.0,"51":1570.0,"52":1571.0,"53":1572.0,"54":1573.0,"55":1574.0,"56":1575.0,"57":1576.0,"58":1577.0,"59":1578.0,"60":1579.0,"61":1580.0,"62":1581.0,"63":1582.0,"64":1583.0,"65":1584.0,"66":1585.0,"67":1586.0,"68":1587.0,"69":1588.0,"70":1589.0,"71":1590.0,"72":1591.0,"73":1592.0,"74":1593.0,"75":1594.0,"76":1595.0,"77":1596.0,"78":1597.0,"79":1598.0,"80":1599.0,"81":1600.0,"82":1601.0,"83":1602.0,"84":1603.0,"85":1604.0,"86":1605.0,"87":1606.0,"88":1607.0,"89":1608.0,"90":1609.0,"91":1610.0,"92":1612.0,"93":1613.0,"94":1614.0,"95":1615.0,"96":1616.0,"97":1617.0,"98":1618.0,"99":1619.0,"100":1620.0,"101":1621.0,"102":1622.0,"103":1623.0,"104":1624.0,"105":1625.0,"106":1626.0,"107":1627.0,"108":1628.0,"109":1629.0,"110":1630.0,"111":1631.0,"112":1632.0,"113":1633.0,"114":1634.0,"115":1635.0,"116":1636.0,"117":1637.0,"118":1638.0,"119":1639.0,"120":1640.0,"121":1641.0,"122":1642.0,"123":1643.0,"124":1644.0,"125":1645.0,"126":1646.0,"127":1647.0,"128":1648.0,"129":1649.0,"130":1650.0,"131":1651.0,"132":1652.0,"133":1653.0,"134":1654.0,"135":1655.0,"136":1656.0,"137":1657.0,"138":1658.0,"139":1659.0,"140":1660.0,"141":1661.0,"142":1662.0,"143":1663.0,"144":1664.0,"145":1665.0,"146":1666.0,"147":1667.0,"148":1668.0,"149":1669.0,"150":1670.0,"151":1671.0,"152":1672.0,"153":1674.0,"154":1675.0,"155":1676.0,"156":1677.0,"157":1678.0,"158":1679.0,"159":1680.0,"160":1681.0,"161":1682.0,"162":1683.0,"163":1684.0,"164":1685.0,"165":1686.0,"166":1687.0,"167":1688.0,"168":1689.0,"169":1690.0,"170":1691.0,"171":1692.0,"172":1693.0,"173":1694.0,"174":1695.0,"175":1696.0,"176":1697.0,"177":1698.0,"178":1699.0,"179":1700.0,"180":1701.0,"181":1702.0,"182":1703.0,"183":1704.0,"184":1705.0,"185":1706.0,"186":1707.0,"187":1708.0,"188":1709.0,"189":1710.0,"190":1711.0,"191":1712.0,"192":1713.0,"193":1714.0,"194":1715.0,"195":1716.0,"196":1717.0,"197":1718.0,"198":1719.0,"199":1720.0,"200":1721.0,"201":1722.0,"202":1723.0,"203":1724.0,"204":1725.0,"205":1726.0,"206":1727.0,"207":1728.0,"208":1729.0,"209":1730.0,"210":1731.0,"211":1732.0,"212":1733.0,"213":1734.0,"214":1735.0,"215":1736.0,"216":1737.0,"217":1738.0,"218":1739.0,"219":1740.0,"220":1741.0,"221":1742.0,"222":1743.0,"223":1744.0,"224":1745.0,"225":1746.0,"226":1747.0,"227":1748.0,"228":1749.0,"229":1750.0,"230":1751.0,"231":1752.0,"232":1753.0,"233":1754.0,"234":1755.0,"235":1756.0,"236":1757.0,"237":1758.0,"238":1759.0,"239":1760.0,"240":1761.0,"241":1762.0,"242":1763.0,"243":1764.0,"244":1765.0,"245":1767.0,"246":1768.0,"247":1769.0,"248":1770.0,"249":1771.0},"Entry":{"0":"\n\n","1":"\n\nBreakfast at 7.30 and drill order parade at 9. 1st Coy no parades. Then dismissed and told to clean billets. Some on wood fatigue and P. & Ed on loading. Read paper and passed morning. Dinner at 12. In aftn. chopped wood and read surveying. At 5.30 walked with P. & Ed to Steenwerck and bought magazines and beer. Home and bed at 9, after reading.\n","2":" \n\nBreakfast 7.30 & drill order at 9. To clean transports but I read paper & cleaned boots in morning. Mail in. Aftn. read magazines and in evening wrote letters till 10. Day sunny, frost in morning. 14 per week for leave. Slight cold developed.\n","3":"\n\nParade at 9. No officers and dismissed. Chopped wood and read in morning, gained pass with bike to Locre and started at 1.30 to Bailleul. Hodgson had just gone up from aerodrome and I went on to Locre. Light Horse had moved so returned to Bailleul and had a good look round and to Y.M.C.A. for tea and then spent an hour with Hodgson. Previously had watched Handly Page ascend from aerodrome close by and was also interested in the Scout (R.F.C.) . Hodgson showed me his bus & I got home about 7. Very interesting &\n\nenjoyable promenade. Spent evening reading and writing. Fine, cool night.\n","4":"\n\nNo parades and went to Steenwercke dump for wood with Edmonds in morning, Bland driving. Back a 10.30 and put out blankets, got inoculated and chopped a good deal of wood before dinner and afterwards carried on. Wrote letters in evening. Sunny.\n","5":"\n\nGeneral clean up in morning and set out with Burkitt for Bailleul at 1.30. Caught lorry right in and had a good look round town, & then met Sidman & Phillips and had tea. Went to Anzac Coves, crowded but poor show, last of series. Caught lorry home. Cloudy. Enemy plane over B.\n","6":"\n\nWent down to fumigate blankets to Neuve Eglise with 5 of No. 4 at 9 arriving 2 hours early. Got back at 3.30. Rest out working near Neuve Eglise. After tea played bridge till 10 & wrote letter and diary till 12. Cloudy and windy in evening.\n","7":"\n\nWork at 8.30 in motor-lorry to Neuve Eglise. Spent day digging till 4 o’clock, dinner in between and showers of rain. Good view of Armentieres from there. Home at 4.45 and after a hurried tea went to Steenwerck to see Dons. Trifle late, good artistic programme & skit on\n\nChu Chin Chow. Home at night. Supper and read and wrote before bed. Day cloudy.\n","8":"\n\nWork at 8.30 and did some more digging. Home at 5 and after tea and a clean up played bridge and after read and wrote this. Day cloudy.\n","9":"\n\nUsual. On to job at 8.30 and worked with carpenters all the day. Lorry late so I caught another and came home. After tea & clean up had to go on guard with Edmonds & two reinforcements who came yesterday and worked to-day. Seems a good game. Cloudy and windy.\n","10":"\n\nUp at 7.30 and passed day writing & reading. Off at 6 and went down & got washing and afterwards had a bath privately 1fr. Spent evening reading. Cloudy and windy.\n","11":"\n\nUsual times. Went out with No. 1 to Corps Farm past Neuve Eglise & all day worked on bow huts and floor nearly completed after pulling up once by A.P.M. 4 prisoners working with us. Hard work. Saw about 20 germans caught apparently in raid last night. Home at 4.30 and read in evening. Cloudy and windy.\n","12":"\n\nBack on Y.M.C.A. again with 10 others. Did some digging and roof. Bill came to see me at 4 but was out. Hurried off after tea to Nieppe to 3rd Div. show, Cooees. Got seats alright. Fair show. Home & bed at 10. Cloudy.\n","13":"\n\nUsual work. Did some roof work and completed the wood of roof. In evening Bill came over and I went to his billets and spent evening with him. Heard lecture by Chaplain Major on Palestine fighting. Home at 10 and wrote diary & went to bed.\n","14":"\n\nDidn’t get up till late and wrote letters in intervals. No. 2 on guard to-night. Inoculated at 12. Trip to Steenwerck to see Don but had gone to England. Arm sore. Cloudy. Took some pills in even.\n","15":"\n\nFeeling ill to-day and diarrhoea very bad. Could hardly work. Some job. Cloudy. Ill all night.\n","16":"\n\nWent on sick parade so didn’t get up till late and didn’t do much all day. Hayward gave a course of treatment for diarrhoea. Spent a slightly better night. Fine day with fair frost.\n","17":"\n\nDid nothing all day. Still weak and inclined to be sick with cramps all over. Can’t eat at all. Frost.\n","18":"\n\nSaw doctor again. Slightly better. Still can’t eat. More pills. Didn’t do much all day. Frosty.\n","19":"\n\nWent out to work as usual & went very gently and worked with \nRosewarne\n Marchant on hut\n\nputting in partitions. Home alright and wrote some letters in evening. Tug of war stunt which we lost to 1st Coy who \nwere\n beat","20":" Nothing of import. Rained in evening. Frosty rest of day.\n","21":"\n\nFinished partitions with Rosewarne and nearly completed hut. Some H.V. shells on Neuve Eglise Road. Frosty and misty.\n","22":"\n\nOut on new Y.M.C.A. at Vierstraat. Fiddled about on doors and roof till 11.30 & came home. Past Kemmel Straight road. After dinner were to have our photos taken at 2.30 but parade dismissed as too wet and dull. Wrote letters in evening and guard at 6. Dola and White. Very quiet.\n","23":"\n\nQuiet all day and wrote more letters and did sundry odd cleaning up jobs. Off at 6 and played bridge in evening with Phillips & Edmonds who came home in morning.\n","24":"\n\nCleaned up in morning and wrote letters for rest of day. Day mild.\n","25":"\n\nOn to Vierstraat job and coverd kitchen roof and odd jobs. Fairly fine with high wind. Some surveyors gone out.\n","26":"\n\nDown to compound at Corps Farm and put up latrine. Home at 4 and played bridge in evening. Fine & windy in aftn. Frosty\n","27":"\n\nFine slight frost, was to go out with Fraser at 9.30.\n\nCompany moving to-morrow. Fraser went out at 10.30 so I missed him and saw him in evening.\n","28":"\n\nGot up about 8 and at 10 went out with company on motor lorries and followed Fraser to Spoilbank. Some shelling just above us. Came back with","29":" Company and landed at 1.30. Had dinner and in evening went to Steenwerck and saw pictures and purchased bread. ","30":" not much of a crowd. Home at 8 after seeing Bill on way out. Cloudy.\n","31":"\n\nWas called by guard at 5.30 and met leave train in Bailleul at 7.20. No captain. Home again and back to Bailleul at 12 with the others and met leave trains at 1 after buying lunch. Met train at 5 and Sinclair & Major came. He went to Rest Camp and we went home. Sinclair a bit silly which certainly was not our fault. Also Sidman & Burkitt back so arranged to meet at 9 next morning. In aftn. Edmonds & I went down to R.F.C. and saw some of the boxing. Walked home, tired and to bed. Have to meet Sinclair at 9.30.\n","32":"\n\nMet Sinclair at 9.30 & he made me accompany him to Kemmel, by motor lorry to Dranoutre and walked rest. Rotten arrangement he said but he made it. Back at 12 with limber to Bailleul and he went to station to pick up the gear.\n\nI caught a lorry to Watts lines and got kit ready and had dinner and limber came soon after. Snowing heavily and walked and caught lorries. Arrived at Kemmel at 3 and after a cup of tea went out to Spoilbank. Fair bunks in deep tunnels and fair amount of room. Went to bed very tired. Heavy fire on sector.\n","33":"\n\nStayed in bed till 11 and got up and cleaned things. In front of Major at 2 but nothing happened. Put in application as chemistry & physics for gas school. Had to go out to-night at 10.30. Extremely dark and couldn’t see till half way out. Went out along light Railway to Oak Tree Dump and not a good track. Met infantry party with my seven sappers and on good duckboards (double) to supports. Out a bit further to a wood where there is a camouflaged trench and we started work throwing up a revetment. Raid started on right at 11.45 with a heavy bombardment and soon spread to our sector. We got some lively shells and one dud fell right in our parapet. We moved down supports but he followed us and things were very lively. M.G. bullets were very bad all night and we stood to. Started again at 1 and worked till 3 and home a good deal lighter. Boot slight wound in chin & evacuated. Dull & cloudy.\n","34":"\n\nHome and had breakfast at 4.30 and slept more or less till 3 & cleaned up rest of day. Rosewarne & I only going out to-night.\n\nWent out at 11 with Jensen and Rosewarne to dump. Extremely dark and couldn’t see 6\" in front. Fell off duckwalk several times and got considerably wet and muddy. Rifle clogged this side of dump and and tin hat full of water. Same job with party of 30 and on the dugouts. Some fairly heavy artillery on right and later Fritz opened up a heavy reprisal bombardment but we didn’t get much hate. Stopped at quarter to four and back home in fair light. Some rain.\n","35":"\n\nHad breakfast at 8 and slept on till 12 when we had lunch. Then slept till 3 and cleaned up. Stott going in as cook to horselines, Kinnear on leave. Out again with Rosewarne, Strain & King and did some more parapet and accomodations. Starlight going out and I only slipped once. Fairly quiet & some rain during day. One burst of machine gun bullets was had but most of us under cover. Out at 11.30 and stopped at 3.30 and hurried home arriving at 4.15. Rosewarne down hearted. Am sleeping in Stott’s bunk which is much more comfortable after argument with Sidman.\n","36":"\n\nBreakfast at 8 and slept on till lunch time. Slept on till 3 and got up and wandered about. To stay home to-night and go on guard to-morrow so woke others at 12. Meanwhile reading Pelman. Day fine and night clear & rest go out at 12, Perkins at 12.45, Baily home to-night and Marchant last night. Sidman leaves section clerk and Endersby down to D.H.Q. prospective cooking for Sig. Coy. Stott back but luckily I retain bunk.\n\nShelling fairly heavy on left bank of canal where there are some batteries & rumours of him attacking to-night but all quiet. Two shells lobbed in canal.\n","37":"\n\nUp at 9 and relieved Nagle. No daytime guard to-day as rest worked last night. Procedure 1 man from each section & we provide an N.C.O. every 4 days. Read and wrote diary in morning. In aftn. wrote letters and in evening stayed with guard till 11. Fine day. Gas clouds sent over on right and heavy artillery on left from here to Ypres and again in morning early.\n","38":"\n\nLovely day. Up at 9 and write letters, all artillery fairly quiet till 6 when started heavily on left again. Groth & Tanza back and 9 others to company, Groth & Walsh to No. 2. Perkins got transfer to E & M Company to-day. Small amount of mail. Going out to-night at 12.30. Quiet on job and only one burst of M.G. and long distance shells. Only worked till 4 when the infantry stood to and we came home.\n","39":"\n\nDidn’t sleep well during day and wrote and read a good deal. M’s letters. Summer time to-night. Fairly quiet all day and fine. M.G. post raided this morning successfully, 2 killed & 2 prisoners, our casualties nil. Party didn’t arrive till 2.15 and they are moving and going into line to-morrow. Did a fair amount of work and finished nearly two possys. Stott drunk\n\nand didn’t go out. Paid.\n","40":"\n\nSlept in after breakfast at 5.45 until 2 as I was very tired. Mail and before going out wrote up diary. No parties to-night and only sappers going out to-night at 9.30. Time altered again to 12.15 and waited at dump for party which didn’t come so went out on our own. Jensen, Groth, Rosewarne & Walsh, Kernot came out and Jensen went home. Did a little sandbagging. Supposed to work to 5.15 but stopped at 3.45. Quiet and fine day & frosty in night.\n","41":"\n\nBreakfast and got up at 2 and was put on guard again. Spent afternoon out in glorious sun and read and wrote. Quiet guard and played bridge till 11. Slept well on a frosty night. Quiet all next day & had a good rest\n","42":"\n\nand came off at 2. Out to work at 6.15 to-night. Heavy shelling all round to-night and tramway and double walk blown to pieces several times during day. Out with Jensen, Bailly, Hoskyns & Stott with party of 10 to work till 12.45 until relieved by Groth’s party. Shelling up there quiet but M.G. active and we went out much too early. Gas hanging low on our left and not a breath of air. We got it slightly. Arranged to come home at 11 and 5.9 H.E. shrapnel hurried us twice pieces falling all round us. Had supper & to bed at 12.30.\n","43":"\n\nSlept till breakfast at 8 and rested remainder of \nevening\n morning. Visit from MacNamara. Looking well with two stripes. Lovely day. Carter, Taylor & Sarre expected back to-day and arrived with rations. Read and wrote till time to go out at 11.45 with Stott, Hosking and Bailly. Met other party coming home. Shelling very heavy and others seemed very shaken. Inglis, Griffith shrapnel wounds and Berry gassed. Waited at dump until shelling stopped at about 1.15 and went up with party of 3 men & Corporal. Communication Trench badly broken in one place and parapet scattered all along. Passed one prisoner & numerous casualties. However evening fairly quiet. On to job and did some digging and repairing. Trench badly broken in parts and a good few casualties on our jobs. Another raid at 3.30 on right and officer told us to clear out so we came home at 3 and just got in after bombardment. Went to bed in good time.\n","44":"\n\nStayed in bed all day and have to go out at 6. Some rain. Raid last night a complete failure on Fritz’s part. Also 10th raid did not come off & they lost 4 casualties. Went out at 6 and up to supports and had to wait there until about 7.30 as too light. Fair amount of shelling and only 12 men. Didn’t do much work and knocked off at 10.30 and home quiet. Fine in evening.\n\nOut with Sarre, Stott who was ill and came in early and Hosking.\n","45":"\n\nStayed in bed all day but started after breakfast and read and wrote a good deal. One letter to Melv. Out at 12 with Sarre, Clow & Hosking.\n\nFairly lively going up and also some minnies and M.G. Couldn’t get a party after waiting a while at dump so worked on our own and dug a small trench to pill box and filled in a possy. Rest of evening quiet and stopped at 10.30 after starting at 7.30. Took out ten men and spent a quiet evening on two possys although other shift was fairly rough and home at 4.\n\nNo party for us and we were supposed to use garrison. However, no garrison. Sarre & Hosking went out to platoon headquarters for awhile to fix up a pump and on return we did a little camouflaging for Jensen and came home at 3. T.M. barrage.\n","46":"\n\nSlept all day and going out at six. Went out but couldn’t get a party so went up and at 7.30 started on trench to pill box and after filled in a possy. Stopped at 10.30. Fairly lively going up and quiet afterwards. Home to bed.\n","47":"\n\nStayed in bed till 12 and in aftn. wrote some letters, cleaned up and read a little. To go on escort duty with\n\nSidman for King and Strain and going down to Horse lines to-night for trial to-morrow. Welcome change. Fritz’s artillery very active to-day. Fine warm day. Set out after tea at 6.15 and walked down to Brasseye camp taking several short cuts. From there on to Pioneer Farm and drivers arriving about 8 soon after dark. Saw Brenner and got a space with Sidman and King on floor with drivers. Bed about 10 but couldn’t get to sleep till about 2 in morning. Heavy bombardment on our front of gas shells all along by our tunnels and our guns replied. Two heavy guns also firing.\n","48":"\n\nGot up in good time and rolled blankets and went out at 9 with Thomas & Jensen and the others. Went through La Clytte to a camp a little further on to left. Not very many for trial and two were well guarded and handcuffed together and we were first on list. Very short trial as each pleaded guilty and we left shortly afterwards and arrived back after 20 min. walk at 11.30. Had dinner at 12 and in afternoon after a spell on grass in sunshine went up Mount Kemmel. Excellent view to Merrin, Roulers, Ypres and Warneton but rather a bad mist. The H.V. gun opened on us and one shell fell just behind observatory. Kemmel\n\nwell intrenched and fortified. Back in time for tea after a visit to 10th canteen and after tea Sidman and I went down to pictures but didn’t go in as too much of a crowd. Bremner told us not to go up on ration cart and to plead that trial didn’t come off till afternoon. After a short stroll and a coffee went to bed. Bremner gave alarming casualties which were wrong of last night. Fine.\n","49":"\n\nGot up about 7.30 and after breakfast left our blankets for limber and set out at 9. Raining during night and very wet and some rain going up. Arrived about 10 and after dinner had to go on guard at 2. Usual thing Nelson, Collings and Downey who got badly drunk in evening and mixed with mud. Had to put Hinds (gas picket) to call the cooks. Fairly quiet all day & misty.\n","50":"\n\nStayed late in bed and had to get up at 10 as Colonel expected. Nothing happened & I read a good deal. Off at two. Still wet & miserable but in afternoon slight sunshine. To go out to-night at 11.45. Played bridge in evening. Went out with Clow and Hosking and got a party of 10. Worked improving two dugouts and vetting in M.G. post.\n","51":"\n\nFine. Slept in till about 3 and had breakfast and didn’t worry about dinner. Cleaned up and left at 7 with Clow & Hosking.\n\nNo party so continued sandbagging on two possys. M.G. bullets pretty lively. Left at 10 and home. To move out for a rest to-morrow at 12.30.\n","52":"\n\nUp at 9 and spent morning cleaning up and getting gear together. 2 Cooks and Sparkes’ gone from gas. Ran gear down on trollys and put them on pontoon and walked down to Basseye Camp. Two huts and on floor. Good camp. Spent evening in making wash tins, chopping wood etc. and \nnext\n afterwards had a game of bridge. Foggy in evening.\n","53":"\n\nSlept badly and guns fairly lively. Heard Bullecourt was recaptured. Lovely day & in morning made some buckets and prepared for washing in afternoon. Washed all afternoon and got clothes clean and dry. In evening wrote some letters. Think we’ll have to move to D.H.Q. to-morrow to build huts at La Clytte.\n","54":"\n\nFine day. Not moving yet. Helped to chop up wood for cooks all day long and in evening wrote some letters.\n","55":"\n\nOut on salvage work at 9 o’clock and spent morning on other side of road salvaging 6’ angle irons from old trench. Stopped in afternoon and told to pack up and moved to Murrumbidgee Camp at 3 on pontoon wagon. Had tea and organised a bed and various other gear\n\nto disgust of Tommy Convoy Warden. Slept well. Fine and cooler.\n","56":"\n\nStarted work at 8 and on building some salvaged huts. I surveyed the ground and levelled up. Stopped at 5. In evening saw paper at Y.M.C.A. and wrote letters. Bed tired at 12. Fine and cold.\n","57":"\n\nUsual work at 8 and did digging all day on two huts with Edmonds and Sidman. In evening played bridge for awhile and bed at 10.30. Fine.\n","58":"\n\nUsual work at 8 and in afternoon with Storr went with Kernot to D.H.Q. and did some surveying for moving hospital behind hill. Back at 4 and had to work till 5. In evening wrote some more letters. Fine till evening with rain.\n","59":"\n\nMoving to Spoilbank to-morrow. Worked as usual till 11 and then had to go to Elzenwalle dump for 20 lbs nails. Back at 1.30 high wind but clearing again. Work at 2.30 and finished one floor. In evening played bridge.\n","60":"\n\nAfter clearing work last night. Fine. Packed up and to move at 9.45. Wagon came at 10.30 so loaded it with some gear and sappers moved off to Brasserie to load pontoons. Walsh and I stayed behind to load second limber. Went to\n\nY.M.C.A. and loaded at 12.20 and moved down to horse lines. Changed horses and out to Spoilbank at 1.15. Fritz shelling road at Brasserie just ahead of us. At Bus House Cemetery one shell just missed the road opposite to us and badly wounded off side horse. Other I think also wounded. Horses taken back to horse lines and Hardacre took both limbers. Back in No. 3 billets and good bed. No work in evening so slept at 10.\n","61":"\n\nOut to work at 8 with all section except Edmonds and Taylor who will be wiring. Working in supports on saps for running off dugouts. Very quiet all day. Fine and good view over enemy’s lines. Back at 5 and after tea bed at 9 after reading Pelman.\n","62":"\n\nVery fine. Slept in till 11 and cleaned up and after dinner spent afternoon writing on embankment as on guard from 5 yesterday till 2 to-day. In evening did more Pelman and went for a walk to see 15\" Howitzer firing. Two shells very close so cleared off and back and read before bed. Fine.\n","63":"\n\nUsual. Out at 8 and same job, some shells on A & B good distance away. Back at 5 and did some more Pelman. Bed at 10.\n","64":"\n\nBreakfast at 8 and\n\ngot mobile. To move at \n9.45\n 1.30 after dinner so carted down cooks gear and blankets and loaded limber and started out in sections by road and marched all the way with pack. Arrived about 3.30 at Brasseye and had tea and afterwards went for walk to canteens to drivers and home by Kemmel. Bed at 10.30 and slept well. Rainy, showers.\n","65":"\n\nUp at 8 and soon mobile. Played bridge a bit. Cleaned up rifle and had a bath before dinner. After dinner set out with packs and marched beyond D.H.Q. and after an hour’s spell at side caught 6 lorries. Had a good seat in uncrowded lorry and came through Locre, Bailleul, Meteren, Fletre and Caestre and turned off at Hazebrouck road and camped about ½ a mile down in big old barn with No. 1. Fairly comfortable but still pretty wet and rained a good deal during the evening. Went for a short walk to a quiet estaminet and bed at 10. \n","66":"\n\nUp at 8 and inspection at 9.30 for blankets with drill order. Lots of blankets lost but I kept both and have to carry one in an overcrowded pack. Wrote and bridge in morning and afternoon got mobile again. Moved off at 5.30 and sundry excitement caused by drunks and Groth shooting ducks. Arrived at\n\n7 and boarded train and got away at 9.35. We had a brazier which however was emptied out on account of smoke. Played bridge and read bystander to pass the time. 30 in a truck and no room and I did not sleep. \nArrived\n","67":"\n\nArrived at St. Roch at 11 and marched about 400 yds to vacant spot where we had cocoa from a Y.M.C.A. and something to eat. Set out to march about 11 kilos about 1.30 and arrived at St. Sauveur. Had tea at 4 and again at 7. Billeted in school very good with electric light etc. and slept about 10 after some argument about accommodation. Fine.\n\n6.4.18\n\nUp at 7 and breakfast at 7.30 and prepared for drill order at 9.30. Collected 50 more rounds of S.A.A. and disappeared to an estaminet where we spent morning with Edmonds. In afternoon fatigue dress at 2.30 and washed down section carts. In evening spent a while in estaminet read and wrote and bed at 10 after roll call.\n","68":"\n\nUsual and not moving. Raining nearly all day so stayed inside for check parades.\n","69":"\n\nUsual. Fine and paid in evening. Several fairly drunk and Clow badly.\n","70":"\n\nTo move at 10 and set out not striking any villages and arriving at Flesselles at 12. Visit to an estaminet and in afternoon got things more comfortable. Parade at 3 and had to wash tool carts again. However address to N.C.O’s by Major and got away at 6. In evening read a little and slept at 9.30 after demonstrations by Stott & Gillett. Fine. On exploder for 5 mins.\n","71":"\n\nCheck parade at 7.30 and reveille at 7 but check parade didn’t happen. Breakfast 8 and drill order at 9. Kernot made fools of us on exploder till 12 and Savage on 2 parade (drill order) continued till bout 4. N.C.O’s then packed tool cart till 5.30 and late again for tea. Bed tired after reading some red book.\n","72":"\n\nUsual. Fine. No check parade and drill order at 9 and dismissed at 10 after usual tomfoolery by Kernot. Then took 10 men to shift wagons at horse lines and eventually 4 horses used, back for dinner at 12.45. In afternoon got boots fixed up to escape frightfulness. Some still fooling with exploder and others with Kernot drilling. News of capture of Messines, Sailly, Bac-St-Maur and we are standing to for entraining, presumably for there.\n\nGot boots fixed up rest of afternoon spent in reading and resting. Bed at 10. Fine.\n","73":"\n\nLovely day. Up at 7 and gradually got mobile at 10, marching order and then cleaned up billets. Moved off at 11 and marched with numerous rests with pack up past Longchamps and a big R.N.A.S. aerodrome. Stopped at 1 just outside Amiens and had tea for our dinner. Hot tea at 5 and during wait several went down for a swim and rest of us watched aeroplane scraps. Not moving till dark. Played bridge again till light failed. Just before full darkness a good few Fritz’s bombers came over and started bombing Amiens. About 4 fires were started and one incendiary shell dropped. Searchlights picked up about 3 planes and they got a warm reception from A.A. guns & M.G. Two fine parachute flares were then dropped after bombing the station and approaches, the planes must have seen our transport. One big bomb dropped only about 50 yards away making a hole in chalk 50 feet across and wounded a W.O. & Sergeant of A.M.C. passing by on horseback. 8 more smaller bombs were dropped making holes about 15 feet on cross roads near our transport and wounded two of our horses. Just before these bombs were dropped\n\nsearchlights picked up a plane and a heavy fire was opened on it and during this the bombs were dropped. It turned out to be one of our planes and it came down in a slow spiral nose dive and 3 M.G. went over to capture plane. The pilot was shot in head and observer wounded. This was the end for awhile. Edmonds & I walked over and had a look round. Carter was very active in dodging round a tree and telling us when things were safe. We walked down towards the town and didn’t find anything so came back and got some straw and rested. At 11 we fell in and marched down to the station at St. Roch. During the bombardment the railwaymen cleared out and traffic was disorganised and we will be lucky if we get away at daylight. Fine day.\n","74":"\n\nCamped where we arrived when we got out and some tried to sleep. I had to walk up and down with Edmonds to keep warm and couldn’t sleep. Just before daylight Fritz came over again and moved down railway line about 4 planes dropping bombs which fell on other side of line about 100 yards away. We were covered I think by the trees and at the same time a gun put over some shells. Things quietened again and we moved over towards yard to load our transport. One big shell fell\n\nabout 50 yards away just after we had passed and tore up a big chimney stack killing Borg & wounding Barley, Gatehouse and two others of No. 1. Moved down and loaded pontoons and other transport with 1 & 4 and Bremner got roared up by Major and in turn roared at Dave. Most of Officers drunk. Got onto train after a hurried meal and moved out at 9 through usual route, Doullens, St. Pol, Bethune. At Bethune we were only about 6 miles from line and railway torn up in places where we had to wait and travel on a rickety loop line. One shell must have landed on a truck and made a bad mess and pieces of men scattered about. Further on we passed closer still and some 4.2 shells fells about two hundred yards off and guns firing behind us. We passed over two canals which were heavily mined on to a siding said to be Ebblingem and got out and after waiting about 1½ hrs for transport moved off about 12.\n","75":"\n\nPassed through Hazebrouck in column and told to step out. However all quiet and arrived at billets at a big hut on Aire road about 1½ kilos from Hazebrouck. 1, 2, & 3 in hut & 4 and rest of company in other. Were not allowed at first to open blankets so I got to sleep about 2 and\n\nfairly cramped using Stott’s blankets. Slept till about six and got up and had breakfast. Half of section moved out at seven with rest and through Hazebrouck towards Strazeele. Turned to right at Borre and after some wait moved back close to canal where we worked with 10th digging reserve trenches. Good job but very tired and worked till 12 and then had dinner. Every farm deserted and in morning got plenty of foodstuff to carry home, including potatoes, fowls, eggs, rabbits and various other souvenirs. Places all evacuated in a big hurry. Very quiet where we were but Strazeele and other side a fairly hot bombardment all day and stopped at 4 and came back on Strazeele railway and through Hazebrouck. Trains running all the time only about 4 miles from line but very foggy. Some shells in Hazebrouck & railway station and we had to hurry. However others visited some evacuated houses (very few living there) and brought home all sorts of gear. Beer, wine, biscuits, food of all descriptions, and beds and various other gear. Plenty of police but not very energetic. Had some beer near home and some more shells fairly close. Our pack horse bolted and upset all our eatables.\n\nHowever got back all right. Cleaned up and got to bed about 9 and slept well. Foggy.\n","76":"\n\nUp at 5.30 and left at 7.30 for same job. Took a roundabout way and picked up a can of paraffin. Usual work and things very quiet. Met Laurie and worked till 3 o’clock and back same way salvaging an old woman who was evacuating on way. Home tired and fowl etc. for tea with pudding afterwards. Walked to Morbecque for canteens in evening but no luck so went to bed. Foggy & dull. On guard at 5.\n","77":"\n\nSlept well and taken off guard at 7. Whole section is moving out to an evacuated farm closer to job at 11. Cleaned myself up and wrote diary before moving out. Hazebrouck heavily shelled last night and this morning and I believe with gas shell also. Moved out about 12.30 and had to go back for rations so followed Jacobs who was on limber. Quiet going out but many places badly knocked in Hazebrouck and a lot of shops manifestly broken into. Took wrong road going out and had to wait for limber’s return. However arrived about 2.30 and settled down as we are not going to work. A farmer & his son came back to collect the remnants\n\nof his furniture so we helped. Quite a comfortable place for us and well isolated. Heavy bombardment on our front after tea. Turned in about 10 after reading paper. Misty.\n","78":"\n\nUp at 7 and on to job at 9 on 3 and 3A on right of previous work. Heavy bombardment at about 10 all along line and hear 1 & 2 brigades put up S.O.S. Some H.V. shells rather close. Cooled off at 1 o’clock but don’t know what is happening. At 3 Infantry were called in and soon afterwards moved off. We were recalled at 4 and marched back to our billet and told to pack up and have tea tout suite. However limber was late & we had plenty of time. Some shells (2) fell right on canal bank during strafe. Moved off with big load on limber at 5.30 including 3 pigs. Kernot divided us unnecessarily into parties of 6 past Borre and onwards arrived at new billet at 6.30 in a house west of big railway siding and between Caestre & Hazebrouck near Le Peupler . Fairly comfortable and slept at 9. Cloudy & dull.\n","79":"\n\nA good few 4.2 shells fell very close starting about 3.30 and continuing till 5. One fell on road about 10 yds from us and two more in paddock about 50 yds away. Plenty of splinters but no casualties. Up at 8 and guard under Groth was on last night. Jensen & Jacobs out to jobs. Very cold wind and\n\ndid no work. Wrote one letter but couldn’t do anything else. Supposed to go out to-night at 7. So stood to but nothing happened and stood to till 10.30 and then were told we could go to bed. No. 4 went out. Quiet all day. A battery of 6\" howitzers pulled in at next house to us and batteries of French 75 close by. French hold a sector on our left. Bed and slept well. To go out next day all N.C.O’s at 9.\n","80":"\n\nUp at 8 and got mobile and ready at 9. However nothing happened till 10 and walked over railway line, back and forth 4 times then Major came along and told us to wait in billet. At 11 got orders to move after lunch. Some snow and sleet fell in morning and still windy and slight sunshine. Limber came at 2 and packed up everything and then found orders cancelled again. So unpacked and played bridge till tea. After tea saw Taylor and then sat up till 11 frying chip potatoes. Bed happy.\n","81":"\n\nUp at 8 and spent morning cleaning up and washing towels and writing some letters. In aftn. played bridge and wrote some more. Orders at 4 to move at 7. So packed up and loaded limbers and off at 6.30 each carrying a shovel. 5 men Robertson, Groth, Strain\n\nGillett, & Toogood arrived at 5.30 loaded with champagne from cellars in Caestre all fairly drunk. We all had several drinks before moving and carried rest. Marched down to headquarters and got paid and marched on to Caestre and I was left on one corner as guide till sections went through. Amusing sight watching Australians & Frenchman going in all directions loaded with champagne. Same 5 badly drunk and Jensen called on Kernot for assistance. Some excitement with Toogood and Kernot broke several of their bottles on way out. I followed on with No. 3 with Gillett who was badly drunk. All No. 3 had bottles and infantry gave away champagne lavishly. I got two and Edmonds 2 but I dropped one of mine unnoticed and lost it. On skirting Fletre on left to No. 3 billet in a farm house and Bremner afterwards took us to No. 2 who were digging in by a hedge on sloping ground. All N.C.O’s bar Groth, myself & Linton gone out to front. Gillett a sore trial and Stott, Strain & Endersby only came along later. I was left in charge as Groth incapacitated and had to make an extra dugout and clean up before daybreak. Cooks in farm below us. Got everything fixed fairly well\n\nand bed at about 4 o’clock. Everything fairly quiet and we weren’t warned at all. Sarre home early also Bailey & Storr. Rest later. Fine night but fairly dull during day.\n","82":"\n\nBreakfast at 8 and got up and had a wash. Stayed in bed rest of day and dinner at 12 and tea at 6. To go out at 5 to front with shovels. Sarre, Bailey & Anderson & Storr on camp jobs. Rest going out, 20 in all. Long walk out about 4 miles & very circuitous route. Waited at Batt. H.Q. & again at C.H.Q. & then went out with guide to No Man’s Land to connect up trench on our left to French, 100 yds long, Arras. Eleven dozen. I worked all over place with Linton & Jacobs. Fairly quiet and did work well getting down to 3 ft. by 1.30. Then got a message so came home. Kernot stopping at C.H.Q. 4 whizz bangs fairly close in hollow. Back with Edmonds and started improving dugout, widened & lengthened it and we sodded and roffed it and completed by daylight, very tired. Finished bottle of champagne & turned in Sunday. Fine but cloudy and chilly in evening.\n","83":"\n\nStayed in bed all day. Cold wind & cloudy. Much more comfortable.\n\nMail in. Out at 9 and with whole section but 2 carpenters Doyle & Carter stopped at C.H.Q. and some others on wood chopping to block road. Followed trench round on right after having some hurry up past C.H.Q. as the fire shewed us up coming over rise. Whizz bangs and machine guns. Digging a new hop over trench on right and did about 6 yards each. Told we would have to work till morning. At battalion one shell fell very close and during night snipers and machine guns were rather disconcerting. However stopped at 2 and home with some argument by Jacobs & Sarre about way. A lot working on trench including miners, and infantry. Home old way very tired and soon to sleep. Bailleul as last night still burning very fiercely. Drizzle all night.\n","84":"\n\nStayed in bed all day and only left time for a wash and to clean my rifle which was in a bad state. Out at 8.15 but some of us, myself included at 8.45. Most going out with No. 4. Toogood & Bailey with me and usual carpenters and woodchoppers. Went out with Kernot new way straight through crossroads and over fields. Past battalion and straight on over hill to \"C\" Company headquarters.\n\nM.G. bullets lively but we started work alright digging a hole in a road for a mine to prevent passage of armoured cars. Hard going but got down 4’ in a 6 x 3 hole. Snipers, M.G., whizz bangs & flares lively all night and one man had leg broken by sniper. Saw Laurie at C.H.Q. who told me 9 & 10 going over to try and outflank Meteren at 2.30 and he was going too. Worked till 1.15 and came home quietly with a few stray M.G. bullets. Many varied flares going up and M.G. active. All rest home before us and went to bed at 2.30.\n","85":"\n\nSlept till 12. 4-7 batteries heavily shelled by 5.9 during morning. Shave and clean up and wrote diary etc. before tea. To go out usual parties at 8.30 but No. 4 party at 8.15. Extremely heavy barrage on left and some over our way so Kernot went to Brigade for orders. However went out at 8.45 and fairly quiet when we got out. Dug down a little more to 6’ and then started tunnel and finished 3’ at 1.15 so came home although told to work to 1.30. All rest home before us. About 2.30 heavy gas barrage started all along front by Fritz but we were just out of range & didn’t get any. However, I kept awake till nearly daylight but we were alright although some fell short and close from us. Some rain during early part of\n\nevening otherwise fine.\n","86":"\n\nStayed in bed all day and at dinner time wrote some letters till time for tea. Jacobs & Preston going to England for six months school. Grose going to horse lines for awhile and Linton now gas N.C.O. Went out at 8.45 on to No. 4 job and had to help them on a task job. Got finished shortly after 11 and home by 12.30. M.G. bullets lively on job, otherwise fairly quiet. Fine but misty & cloudy.\n","87":"\n\nStayed in bed till dinner time and then finished off letter writing. Out again as usual at 8.45 and on to same job. No. 4 on new job and we were given a task of 2 yds per man to dig trench. Very quiet and got home about 1. Evidently another bucksheesh job. Inclined to rain and cloudy. Edmonds in.\n","88":"\n\nStayed in bed most of day as feeling very tired and had an argument with Jensen. Had to go out with Sarre and Kernot at six and went to 11 B.H.Q. and waited there till nearly dark. Sarre fired shots at aeroplane & burst his rifle. Out with works officer and marked out trench for connecting up and also found where our wire was to go. Sarre waited for party and I went down to cross roads dump to wait for them. Slow in coming and then growled continually when they did come. However did strips of carrying wood pickets and wire. Rotten mob to work with.\n\nWhizz bang shells going near dump all evening and a lot too close for comfort. One burst right under their Sergeant who got across paddock very quickly afterwards although he said he was used to shell fire. I smiled. I was glad to get rid of them. We weren’t allowed to go home and had to work on till 1.30 when we finished. Bed very tired. Cloudy.\n","89":"\n\nStayed in bed all day and at 6 reported to Avery with Anderson, Burnop, Burns, Toogood, Robertson and Boot for making dugouts for No. 3 by our cookhouse who were shelled out of the farm. Extremely heavy barrage on left. Raining a good deal but I didn’t work and knocked off at 11 and went to bed tired. Wirers not home till 3 at which time Fritz started an area bombardment by howitzers and continued on.\n","90":"\n\nBarrage on left going heavy all the time till 3 \nnext\n to-day and heavy shells falling thickly all round us and very close. Storr and Carter’s dugout blown in but they weren’t hurt although had a rough time twice afterwards as well. All a good bit shaken and couldn’t sleep much. Enemy aeroplanes over many times during morning and things pretty rough. Hardly any damage done although the place churned up everywhere.\n\nStarted a long letter to Melv. while waiting for George. Cloudy and fairly cold wind. Letter from Fanny last night. Told I needn’t go out last night but afterwards Kernot told me to go out for blowing mine. Went out at 9 taking 4 tins (25 lb each) of blasting. Had to make a wide circuit round house as Fritz shelling pretty heavily. Jensen got a slight wound in knee and went home but is still staying with us. Edmonds, Bailey, Toogood, Clow and Read with me and walked out to trenches at company headquarters quietly and waited there for Kernot. \nwho\n I & Edmonds waited at the house and Kernot didn’t come till three quarters of an hour later. I got down the hole and tied tins together and set them and Kernot came and fixed two fuses. Some whizz bangs rather close. He posted the 4 sentries and tried to light the fuses. One he lit the covering which went out and when the other caught he got such a scare that he didn’t wait for the first and hopped right out and hurried back. Walked back to company till she blew making a good explosion and a lot of dirt came out. Roads completely blocked. Went straight home and arrived at 1.30. Quiet. Cloudy still.\n","91":"\n\nCloudy and dull all day and stayed in bed tired but couldn’t sleep much. In aftn. read Pelman and wrote diary. At 4 o’clock a fair number of small shells were sprinkled close to road and our dugouts. Don’t think any damage and again at 5. Don’t have to go out to-night so when rest had gone I wrote letters till 3 o’clock when Edmonds returned. Bed very tired.\n","92":"\n\nStayed in bed till 2 except to get meals & then to go over with Cpl. from First Coy to act as liaison to-night. He went over first & located company and then I came over with all my gear. Camped about 10 mins away so I came back with all my gear and had tea. Went over at 7.30 and and out at 8.20 to Battalion and then to Coy H.Q. No work so came home \nhome\n short way and rest went home arriving at 9.40. Wrote letters till tired and finished off other odd jobs and bed very tired. Rest at Croix rouge.\n","93":"\n\nStayed in bed nearly all day and at 6.30 went out with Kernot near Croix Rouge and marked out trenches, 100 men party at 9.30 and carried on in two places. Carter in charge of one. Some 4.2 wire thrown all along our trench and a lot too close for me. Home about 12 chased by shells.\n","94":"\n\nSlept most of day. Had a good bath in afternoon, cold water yesterday. Today Edmonds and Linton went out at 2.30 to new billets at Borre\n\nand at 6.30 I went out with Tucker, O’Neill and Nagel & marked out some more trench for our nightly amusement. 60 men came and did a 2 yd task each. \nHome\n Knocked off at 12 and walked about 5 kilos to Borre. Fairly comfortable in a room between Edmonds & myself with a good soft bed. Slept well.\n","95":"\n\nUp at about 9 and after breakfast started looking round. Before tea had a table, 4 chairs, 2 (armchairs) with wine glasses, decanters, butter and jam dishes, tablecloth, lamp kerosene, a big mirror and other comforts. Lots of gear left behind and a lot ruined. Went out with 4 others with Avery No. 3 and spitlocked out some trenches for tomorrow’s work. Back at 1. Fairly quiet. Cloudy. Paid in afternoon. Very quiet here. Also boiled some water in aftn. for drinking and made some cocoa. Sultry.\n","96":"\n\nUp for breakfast and in morning cleaned up and wrote diary. Some rain and sunshine & fresh breeze in aftn. A battery close by was heavily shelled in morning and afternoon by 10\" shells. Only about 400 yds away some of the shells. Out at 8 o’clock with Sparkes, Sidman and Toogood and completely finished the spit-locking. 7 Infantry digging in the trench. Kernot did not come round so stopped at 12.30. Fairly rough coming\n\nhome and had to dodge some gas shell craters. About 4 heavy shells also fell very close and Sparkes did a break to disgust of Sidman. Home tired.\n","97":"\n\nStayed in bed till 12 and N.C.O’s interview with Kernot re blinds & shelling & work. A thunderstorm in aftn. and some raining coming home. Out at 8 & to get a party at dressing station however it did not turn up so dug some 3 yds ourselves with about 12 off the post. Home at 12.30 and fairly quiet all night.\n","98":"\n\nUp at 11 and completed letter writing. Day sultry with some sunshine. Out at 8 as usual after spending time on Pelman and letters and organised for party, 1 Off., 7 N.C.O’s & 15 others. Rather heavy shelling on road at time lasting for about 15 mins. Whole party of engineers, some growling but got on alright and home fairly quietly at 12.45.\n","99":"\n\nAfter breakfast spent day on Pelman and washing socks and in evening on account of changeover no party so Carter took my party and I stayed home with Edmonds, Toogood off colour. Edmonds & I boiled copper and had a good bath just before dark and spent evening at bridge with Jensen & Phillips till 12 and to bed pleasantly tired. Fine day, a trifle hazy.\n","100":"\n\nPerfect day. Spent in\n\ncleaning up and washing underpants and sox and reading some magazines. In evening went out by myself with McGlaughlin & Campbell to hand over job to No. 3. Rest of party with Carter. Quiet. Got a good party of 12th although they had had a bad time and finished fairly early. Home tired. Edmonds gone away with scabies.\n","101":"\n\nCloudy all day. Cleaned out the room and other mobile duties and in evening out with Kernot on bikes at 8.30 after recalling Carter’s party who went out at 10.30 to give infantry more time for tea. Out through Pradelles and on to Battalion and on to Groth’s job over road and marked out about 200 yds tape. Officer came back with Kernot to Battalion who spent about two hours there. Rather heavy gas bombardment on right of Strazeele and we got a slight quantity of mustard gas at Battalion and going home. Calm and got home before twelve midnight.\n","102":"\n\nFine day heavy fog in evening. Spent day reading and feel a little lonely and unhappy. To go out at 9.30 with Reid, Appleton, Doyle and Bailey with party of H.Q. Arrived safely at Battalion although very foggy and some bother getting shovels. Did 4 yards 2 ft. deep and got home by short tracks safely although he was\n\nshelling Pradelles going out and we made a detour and he just stopped. Home about 2.\n","103":"\n\nFoggy \nin\n & cloudy in morning and sunny in afternoon. Slept till after dinner and read a magazine to fill in time Sunday. Saw Kernot in evening at 7.45 and out with him almost at once. Many balloons up and visibility very clear and had to wait some time before going up to battalion. Thence out to supports and marked out 240 yds in front of Hotel de Cow Shed and on its left. Then on to Carter’s job on left and back again to Battalion. Kernot told me we wouldn’t be going home till daylight and mentioned something about me not having to go round outposts and getting a doss for a few hours. I climbed on to some filled sandbags and tried to doze but hardly slept at all. Extremely quiet and daylight very early at about 2.30. Got home at 4 and to bed tired.\n","104":"\n\nStayed in bed till tea time and got Pelman from Linton. Cloudy and rainy day. Heavy rain in evening and only four of the section out as changeover. I read some Pelman and bed at 12.\n","105":"\n\nLovely day spent in writing two Pelman exercises, one letter and doing odd jobs. One shell fell quite close to\n\nambulance but it was an orphan. To go out at 8.45 with Walsh. Got party of 20 at usual meeting place and working near hedge in front of old billets. Very slow but good workers from 6th I think. Some shelling on right front and left. Home feeling very tired and giddy at times.\n","106":"\n\nSlept all day and not feeling at all well. Temp. 102.2 and in evening saw Major at F.A. who gave me no duty. P.U.O and many piles. Can’t eat and heavy pains in head like influenza. Fine & warm.\n","107":"\n\nRestless night. Saw Hayward at 11. Stayed in bed rest of day after shaving and a wash before side parade. Can’t eat anything. In evening very clear and two planes over and saw transport ready to move up long before dark. A good few shells came over about 9 and a number of shrapnel. One dud in next billet No. 1. Most fell in back but some quite close and everyone went over to shelter of church except Burkitt, Sidman, myself. Pretty warm on job according to accounts. Slept alright at 1 after reading magazines. Very warm and fine.\n","108":"\n\nFine & hazy. Stayed in all day. Pains in back otherwise not bad. Edmonds came back in afternoon. Also Dola & some others. Quiet. Everyone in this floor cleared out to more congenial billets headed by Linton and Carter. Slept all right.\n\nByrne killed by H.E. on job. Rest all right and quiet.\n","109":"\n\nWarm & hazy. George very careful. Eat a bit this morning. Saw amb. doc. in evening & very good, no duty. Mob out as usual but all home by 11.30 and calm.\n","110":"\n\nWarm. Moving to-day. After breakfast gradually got ready and after dinner moved off about 2.30 on pontoons & G.S. I was placed by Kernot on G.S. front seat and comfortable though tired on arrival. \nThrough Hondeghem and about\n Camped Hazebrouck side of Hondeghem on west side of main road in huts vacated by chinamen. Rough & not many conveniences. Bed tired. Groth, Gillett, drunk & with a fowl. on arrival & major threats.\n","111":"\n\nHot. Didn’t sleep well & pretty cold. Reveille at 7 & check parade 7.30. Breakfast 8 & drill orders at 9. Inspected by Major, Q.M.’s inspection and some drill & gas ins. till 10.15 & dismissed. Feeling rather shaky. Drill order at 2 and dismissed. Saw doctor & 2 days light duty. Wrote letters in evening.\n","112":"\n\nMissed all parades. In morning and afternoon rested in shade on grass and in evening wrote more letters, diary and Pelman. Hot but cool in shade.\n","113":"\n\nHot but good breeze in shade, spent day in shade resting and doing a little reading.\n","114":"\n\nWent on parades usual. Hot, drilled till 10.15 and played bridge in intervals. After dinner strong west wind which\n\nchurned up the dust and made things very unpleasant. No parade. In evening had a short game of cricket and bed as usual.\n","115":"\n\nStarted to rain last night & fairly heavy. On guard at 9 and prisoners in section billets, 6 men all going smoothly.\n","116":"\n\nOff guard at 9. Pontoons coming at 11 to take us to sports. Day fine, getting warm again. Sports off and cricket match between drivers and sappers. I played, caught one, one caught off bowling & made one. First innings 49 each, second they made 32 and we won by 8 wickets & 8 runs. Bed at 11 after talk with S.M. \n\n26.5.18, Sunday\n\nUsual parades at 7.30 & 9 and in morning I umpired for match between 1, 2 & 3 & 4 sections won by 3 & 4 by a good few runs. In afternoon umpired against R.F’s. We won 114-54. Warm & fine. Artillery fairly lively and 2nd Brigade gone out and 3rd came round here. ","117":" closest. Mail in. Bed at 11.\n","118":"\n\nUsual parade at 7.30. Warm and fine. Rolled blankets and got gear ready and left our packs at horse lines again. At two loaded up and set out for Borre on the pontoons by La Kreule road. Nearly got bogged in ditch and Bailey and Robertson fell off. Arrived before 4. Billets same and nothing much altered but in very dirty state. Wrote letters all evening till 11. Supposed to go out but wasn’t warned & left behind. Rest of section out together. Edmonds on bike to\n\nhorse line and Carter, Stott and Burnop also home.\n","119":"\n\nBreakfast at 10 and spent morning writing and also afternoon and had a game of cards in evening before going out. Saw Kernot at 5 and to go out at 9.45 with Sparkes (2), Edmonds & Appleton. Got party of 20 and on to job by new and better track and much shorter starting on switch support & long walk. Digging in wheat crop and ground very hard but got down alright in about 2¼ hours. Very quiet and home very tired. Rum issue.\n","120":"\n\nStayed in bed till about 3 and then cleaned up and finished writing. Strain back. Fine day. Saw Kernot at 6 and to go out at 9 with Edmonds, Appleton, Burnop on same job. Stunt on at 11.30 by 10th Bn. Got party of 20 at usual rendezvous and on to job safely. Very wet and hard digging. Stunt supported by shrapnel and very quiet but half an hour after we caught a heavy barrage of 5.9 and two shells just missed our trench. As soon as it eased off we got home & had to go through trench a lot of way. Troubled by M.G’s also. Home at 2 tired and read before bed.\n","121":"\n\nFine day. Stayed in bed till after dinner and in afternoon wrote diary and had a shave and bath. Out at 9.30 with Edmonds, Burnop & Appleton and got party of 20 at 10.10. Very nervous officer and wanted\n\nto go in trench all way and bobbed down for flares & M.G. although a long way off. He led us some of way & trying to get party along I missed the switch and went on to road. Fritz started shelling so party took cover on other side of road. Later on went back \"to find way\" with officer but encountered some 5.9 fairly close again and came back. Then out with one of his men & I took Edmonds. Found trench as expected and waited while the Infantry went back to bring party. Went through trench some of way and on to job at 11.40 meeting Kernot & Major. Started improving trench as officer said he would only work till 12.30 and got roared up by Major. Officer disappeared so worked till 12.30 and came home fairly quietly. Bed at 2 very tired as had to walk through trench about half of way.\n","122":"\n\nFine day. Stayed in bed till after dinner and then cleaned up and read Pelman. To go out as usual and do connecting up. Out at 9.30 and again with McInerney who however was much quieter, did some work linking old trench and home fairly early.\n","123":"\n\nFine, stayed in bed most of day and in evening out at 9 with 12 others. Groth, & Sarre, Burnop & Stott drunk. Got shovels for a start but replaced them and helped Bailey & Doyle at Battalion making overhead\n\nburster protection. Knocked off at 12.20 as gas coming over Blue Cross. Home & to bed.\n","124":"\n\nFine. Stayed in bed till dinner. 17 of us first to go out in stunt to-night but after reduced to 8, with Jensen & 8 new chaps. Carter to go with Kernot. Did wiring in afternoon with Stott, 2 sparks, Burnop & Walsh and read all evening. Edmonds & mob went out at 10.30. To go on Brigade cookhouse erection to-morrow.\n","125":"\n\nFine. Edmonds home at 5 and full of stunt, which they all enjoyed. Very quiet & 200 prisoners taken and everything satisfactory. I read all day & to go out at 8.20 to Strazeele dump. Getting relieved to-morrow. Fairly lively all round & a few M.G. bullets but we were fairly quiet. Two trips & had to load 7 wagons & heavy work. Extent of dump very great and a lot of material left. Home at 1. Two more posts taken at 11.30 and arrived back by 1. About 20 of second company in billets & wanting breakfast in morning. Bed tired.\n","126":"\n\nUp at 9 for breakfast. Fine day. Cleaned up and got ready to move and Edmonds very slow. After dinner moved off about 2 and had to walk. Rest rode on wagons. Camped on cross roads between Hondeghem & Caestre, Hazebrouck & St. Sylvestre. Capped \n\nin barns. Plenty of room but not much comfort. Rested in aftn. but after tea went out at 6.50 with Clow, Reid, Doyle, Dola, Edmonds & Bailey & met Kernot and Jensen at old billets after ¾ hour wait. Went out overland route and on to hollow on right of Borre to Front line and zone trenches. Gathered all picks & shovels together and after yarn with S.O.S. Battery men came home arriving at 10.30 and after supper to bed tired with long walk.\n","127":"\n\nFine. Up at 7 for breakfast and then cleaned up. Most of section out on day work. Beck & Hardy killed by shell landing at their feet. Started out for work at 7.30 with same party and met McNamara and on to job before 9. No sign of Kernot or Jensen till 10 o’clock and party came about 90 men. Worked till 1 and home tired.\n","128":"\n\nFine. Stayed in bed till after dinner and then read and played bridge in evening and to bed as not going out.\n","129":"\n\nFine out at 7.30 & working on left off Pradelles defences. Worked till 11 and home for dinner early as supposed to be moving. However, no move & played bridge in \neven\n aftn. On guard at 6 with Bailey, Clow & Burnop. Carter & Linton both off duty. Good and quiet. Cloudy & inclined to rain in evening. Slept in our billets and bed fairly early.\n","130":"\n\nFine & warm and carried on guard till 1 and got mobile.\n\nMoved about 2 and marched skirting Hazebrouck and zig zagging towards Wallon-Cappel. Very hot and dusty march and arrived in camp in a field with two trenches surrounded by trees and hedges with water. No. 3 & 4 in barn. We got up 4 tents after unloading pontoons & comfortable with 7 in tent & 7 in ours, Linton, Sarre, Carter, Edmonds, Phillipps, Rosewarne. In evening rested and read Pelman. Edmonds home drunk and didn’t get to sleep till late. Marchant amused but not drunk.\n","131":"\n\nFine. Check parade at 7.30. Edmonds & I weren’t there. Drill order at 9 and did a little drill and dismissed for fatigue work. I didn’t have to work long & spent spare time in reading, writing & playing bridge. Drill order parade at 2 and dismissed. I got a bike and at 3.30 set out for horse lines. Some trouble to find. Coming back lost way & had some trouble arriving at 6 after getting clothes, hat, etc. & seeing Crocker and Dunstan. After tea bridge with Phillips & Strain and bed.\n","132":"\n\nParade at 7.30 & drill order at 9. Did some drill & N.C.O’s & Lecture (Series by Price) then played bridge and sewed clothes and hat. Rained all dinner time & parade (fine) at 2 and to be a concert at 6 near 12th Batt. Cricket off. Cleared up in afternoon and played cricket after all. I spent all the evening washing clothes and got a good deal done and dried all right next day. Bed late and Edmonds late again.\n\n11.6.18\n\nFine day slightly cloudy. Usual parades. At 9 came back and spent about an hour sawing timber. In afternoon on parade at 2 was late but joined in and nothing happened. Loaded a G.S. of timber and iron for 9th Batt. and finished for day. In interval \nread\n letters and read Pelman. Bed late George as usual.\n\n12.6.18\n\nStarted for 9th Bn. with Clow, Reid & Strain and waited about till 11 while people hunted up orderly officers for location of bayonet gallows. Carried posts down and dug one post hole. Had dinner at 9th & then went down to","133":" & met quite a number of old saints. In afternoon watched the sports (good) till 5 & came home a long way out of road & in evening finished washing and bed early with headache. Fine & warm.\n","134":"\n\nCloudy. On to job at 9 and found one of posts gone & had to get timber from forest. Finished at 12 and home & had lunch. Rested in aftn. and cricket match in evening v R.H.A. Return match. I took Sarre’s guard while he played cricket. First Innings 21 & 33,","135":" 73 & 40, we won. Bed tired.\n","136":"\n\nUsual parades & fine till late at night when we got a heavy shower. At 9 did some drill and lecture on wiring & M.G. by Price. In afternoon dismissed at 2 and played cricket match 2 teams between sections. Our side won easily. I made 22 top score. In evening played some bridge &\n\nwrote letters. Roberts over and got Edmonds drunk & came home late & harangued us on various topics. However got him to bed in end.\n","137":"\n\nUsual parades. Lovely day. At 9 went for hours route march with Tuck round & home through forest and paid on return. Infantry moving up and our advance party goes up to-night and we move to-morrow. However, orders changed and had tea at 4 and moved at 5 through Hazebrouck on to pontoons to reserve camping ground. Camped in trench and put ground sheet over our heads. Just before dark Robb took us over about half a mile away & showed us trench we were to occupy if an attack came and to organise the infantry. Great fear of him coming over in the morning and tales of his massing going round. Very cold sleeping and only one shell and a couple of bombs were heard all night. Extremely quiet.\n","138":"\n\nBreakfast at 7.30 and spent morning getting mobile and writing letters. Fine day and cool west wind. Yesterday propaganda balloons were being sent over all day from right of us & back of Nieppe forest. Some showers during morning which prevented letter writing. Moved at 4 and back to old billets quietly and spent rest of evening cleaning up mess left by 2nd Coy. Work at 9.30 and out with Price & rest of section except Sarre, Edmonds\n\nHosking & another. On to support line outside Battalion where we waited for Price. About a dozen 4.2 shells fell quite close and we had to move down trench. Then up trench and working close by Battalion on deepening dugouts. Worked until 12.30 and home very quietly. A lot of new wire out and our path crossed in places. Bed after supper. Mail.\n","139":"\n\nFine day. Slept till 11 & had a wash & slept in afternoon again. Up for tea and afterwards wrote letters. Out at 9.15 as usual although not warned till late. Heavy barrage just as we got to Battalion on support line but rest of night very calm. Same job and some more digging and home at 12.30. Indignation at Linton and others. Home to supper & bed.\n","140":"\n\nAfter breakfast up and wrote Pelman. Fine with one shower in morning. Some of section busy on dugout frames. In aftn. wrote more Pelman and out at 9 with Boot, Sparkes, Burnop, Williams & Stott and walked round trench to new switch support. Turned to left to Bde. O.P.C.T. until we came to Rouge Croix Switch. Trench dug by 2nd Coy and very bad. Had a spell here & then got 4 shovels each and back after one spell overland past Cowshed and Estaminet quietly. Going got some M.G. very close. No parties for us so we got to work on putting bridge for horse traffic across trench at Battalion, taking us till 12 and then home. Supper and bed.\n","141":"\n\nFine and up after dinner. In aftn. had a bath hot and spent\n\nevening reading Pelman. Trouble with Jensen again & after lot of trouble found I was going with Boot to meet party at 10.10 below Battalion & to get tools there. Party came alright but pontoon wagon went past so we went over to estaminet. One shell fell close so I sent party back to trench & officer waited while Jensen marked out job. Infantry party went home. Had to wait a good while & when he returned went to Linton’s job and then to Groth who had gone home. We went home then about 12. Raid at 12.30 but very quiet and heard 80 casualties & failure. Supper & bed. Enemy plane dropped 6 bombs quite close to village but no damage apparently. Bed.\n","142":"\n\nUp at dinner time & in aftn. wrote diary & Pelman. Fine. Carter taking Sarre’s place and Sarre going on to job I left last night. Out with Groth at 9 and very lively near Battalion. I had Sparkes & Stott & 3 infantry carrying cupolas from dump and very lively with M.G. One bullet just touched my neck near spine and another hit a man’s equipment in front but none did any damage. Gas shell fell about 20 yds from us and we just escaped fumes. Left at 12.30 and home to bed after supper. A good deal of rain during evening and ground sloppy so came home by road through Pradelles.\n","143":"\n\nFine but some rain in evening. Got up at 12 and spent leisure on reading mail.\n\nOut at 9 with Groth and took sappers ahead to clear way. No shells but a good deal of M.G. Small party but worked well and we hurried as another raid expected. Home about 12.30 and bed after supper.\n","144":"\n\nFine. Up after breakfast and did Pelman and read letters. In aftn. spent on Pelman and evening going out with Groth again, although Sidman on a new job with Newberry. Out at 9 and put in 9 more dugouts and sandbagged up. Home at 1.30 & bed after supper.\n","145":"\n\nFine. Slept till dinner and a little in aftn. & finished No. 8 Pelman in evening. New job to-night & out with Sparks at 9. Party late but got 30 at 10.30 & proceeded to estaminet for shovels which hadn’t come. So went on down to trench on support line where it cuts the road & below battalion. Managed to get some shovels on job from post and started work. Also took back 4 men and got some shovels from estaminet. Good deal of growling and left off at 12 as stunt coming off at 12.30. Left Battalion at 12.20 & stunt started as we got to R.A.P. Not very heavy fire. Home to bed after supper.\n\n24.6.18\n\nUp at 11 and visit from 2 of 10th Batt. In aftn. washed & shaved and wrote letters. Out as last night but also change-over & may not get a party.\n\nOut at 9 and parties late as usual. Two parties went ahead with wrong men as we found afterwards. Heavy shelling started on right as centre but a lot of shells fell on our support line and near estaminet and battalion. Robb told us to meet our party who were waiting at Estaminet & Sidman to meet his waiting near Linton’s job but he refused to take party through barrage. I went out to Estaminet with Sparks & Robb & though no shells fell near plenty of splinters. Party disappeared but found officer on Linton’s","146":" Battn. job so waited until all was quiet & then on to job. Rest of evening quiet usual few shells & M.G. Party very slow working and kept them going till 1.45 and job fairly respectably done. Home quietly to bed. Fine.\n","147":"\n\nFine with one or two misty showers. Stayed in bed till late aftn. then got up and after clean-up wrote letters. All available men on A.M.C. job & Battn. headquarters’ job and all to work to complete before day after to-morrow evening ready for stunt. Battalions very weary. To work from 10 to 3. I got Sidman’s bike and rode with Linton to Battalion. Saw Major of R.A.P. who told us he had been shelled out of estaminet possy by 8\" shells so we told Major & he went back to R.A.P. to investigate 8\" shells still dropping near estaminet and we waited in trench. Found estaminet job\n\nwas to be scrapped so all went out to Bn. H.Q. right round Merris Street through supports and on through Merris Street till we reached a house on east of Mont de Merris. Thus about 80 yds overland to job. Shelling now stopped and we got to work on excavations and assisted at intervals by Robb & Major. Heavy work and couldn’t do all we wanted to. All of timber up and some other gear & pontoons drew machine gun fire. Robb sent me down Merris Street near Battn. to collect some camouflage by myself. Got back safely after long walk & got some from covered in trenches containing T.M.C. gas cylinders. Just before last wagon left a heavy bombardment started all round us and some shells fell very close but no damage. Major told us to stop soon afterwards so camouflaged up and started home. Strain walking on top had a M.G. & 4 snipers on him till told to get down. Home quietly & to bed tired.\n","148":"\n\nStayed in bed till nearly tea time. Fine then up and washed and in evening wrote letters & diary. Only Linton, Edmonds & Reid going out, 10th raid at 11 o’clock. Edmonds fairly nervous. Linton stayed in and Strain, Reid, Edmonds & another out. Wrote a good few letters and bed at 12. Barrage at 12.30 and fairly heavy.\n","149":"\n\nUp after dinner and after cleaning up wrote letters rest of day.\n\nSupposed to go out at 9 with Sarre but afterwards altered and to go out myself to camouflage Edmond’s job but with Sarre’s help got a private from infantry party who was very windy and scared by attack on right which he thought was at 12.30 and came off at 6 or 7 in morning. Was going out but saw Jensen & had to go back to get camouflage from Battalion. Hard to get up and Major on job and some shelling. Major rather in a bad temper & tried to show me my job. Spent until about 12.30 putting in stakes by myself. Infantryman no good at all. Rest knocked off at 12.30 & I thought of getting more camouflage but shelling very heavy in forward area so came home. Met Linton in trench towards R.A.P. which was being shelled and rode home on bikes. Fairly quiet when we reached home. Artillery getting considerably livelier. No shell near here though.\n","150":"\n\nUp after dinner and in aftn. had a bath and washed some clothes. Also wrote more letters in evening too. Barrage on right very heavy and heavy till dinner time. About 7 o’clock shelling very heavy with a number of guns towards Pradelles & round batteries and roads. Out at 9 although not warned till late to go out section who had already gone so out with Reid & Edmonds. Met rest at Battn. No parties at all so all went out to Forward Battn. H.Q. Some 8\" shells fell near road and busted wire this side of Pradelles searching for 6\" battery.\n\nFairly quiet going out and got on job and started filling sandbags. M.G. very lively from two directions all night. Saw Roberts going out & M.G. very close just outside battalion. Had to retire to dugout several times as shelling pretty heavy. I filled a few bags & spent rest of evening fixing on wire for camouflage & at about 1.30 started to cover up. Unloaded both pontoons although very hot once & had to volunteer to leave dugout. Robb had wind up badly while camouflaging & then had to run to trench and Sarre & Linton stayed behind & still warm. Got down safely to Vieux Berquin Road and more shelling there & had to wait. Then home more quietly to bed very tired. 10th successful raid of 500 yds.\n","151":"\n\nHeavy bombardment early in morning and continued to dinner time. Also again in even. Didn’t get up till after dinner & cleaned up. To go out with Sarre at 9.30. Got party of 15 men from 11th & rest of party went on with Edmonds. Also Groth out & lost party for awhile Quiet night & some very close M.G. bullets. Put in two dugouts and filled in and rest did a little gentle digging. Left at 12.30 & home quietly. Fine.\n","152":"\n\nStayed in bed till 12 without dinner & read Pelman & practised it. Continued in afternoon. Out at 9 with Appleton and on same job with Sarre on a new one. Parties late as usual & got 18 men who didn’t have any definite orders. On to job\n\nand worked on completing old dugouts and preparing others. Pontoons came but no gear for us. About 10 5.9\" very close aimed at road and pontoon turned and bolted and broke harness. Rather uncomfortably close. Visit by Major and stopped at 12.30 and home quietly.\n","153":"\n\nFine. stayed in bed till dinner & saw Major re last night parties. In aftn. read. Same job to-night. Spoke to Robb going out re parties & he was sympathetic and will see Major to-morrow. Got party and had to go right round trenches as too light and aeroplane up. Excellent party and worked well. Finished two more dugouts. Also prepared others. Quiet all night and left at 12.30.\n","154":"\n\nFine, dusty & howling wind. Up at 12. Argument with Edmonds. Cleaned up and went to see Major at 5 but will see him after tea at 7. Feel nervous. Saw him & got a good hearing but don’t think it was very effective. Out at 9 with Major & Robb in lead & got party from","155":" living on other side of Borre. Not much work but finished the lot by 12.30. Bombardment by us started at 11.30 & we had no warning. Fitz’s S.O.S. red & 2 greens. Then 3 red parachutes by us said to be objective signal. Stunt by 8th Battalion. Very heavy machine gun fire everywhere and some scattered barrage. Stopped work for half an hour but finished job and home quietly. Cloudy in evening, no rain.\n\n3.7.18\n\nFine cloudy and wind. Up at 12 and in aftn. washed & went\n\ndown unsuccessfully to Y.M.C.A. for notepaper. Wrote letters on return. Walkers farewell order. Out at 9 as usual with Bailey who took 3 men for loading pontoon at Botha Farm. Worked this side of Post deepening and widening. Some shells about 11 and chased us from job and two 5.9\" very close. Started work again and did about half an hour’s work and shelling started again. Dropped tools and mob cleared off home. Not very dangerous shelling and home quietly with Finter & Sergeant & Bailey rest going their own way. Caught pontoon on road and rode all way home, arrived about 12.30 with Groth & to bed.\n","156":"\n\nFine but cloudy. Up at 12 and read in afternoon and wrote some letters. About 8.50 Fritz heavy barrage came down just behind Pradelles and a lot of gas shell. Could only get just outside Borre and Groth & Burnop returned from Pradelles with nose & eyes running. Waited for about half an hour & rest went home & Groth & I went up to turn parties back if they came up. Lot of gas going up and and shells in Pradelles. Waited about half an hour & came back meeting Robb & 1st Coy men and Walsh, Reid, Burnop & Sparkes near 4-5 forward batteries and had to go back with them. Took Reid & to take shovels etc. back to Linton’s job. However tools all claimed as trench stores so straightened up and after talk with 10th Batt. came back and home about 12.30 & to bed.\n\nFritz attacked but got badly pushed back and we used a smoke screen.\n","157":"\n\nFine but cloudy. Up for breakfast & spent morning cleaning up. Rumours of moving right back in 4 days. Edmonds very dopey. Got all ready after dinner and were to move at 1 but played bridge until pontoons arrived at about 3.30 with 1st Coy. Rode all way and followed railway line then to right, left & right camped between Hondeghem & Wallon Cappel in tents and fairly clean & comfortable. Mail in and Pelman & read in evening, played tennis & read magazine before bed. Couldn’t sleep till late although fairly soft. Linton’s Guard.\n","158":"\n\nFine & cloudy. Up at 7 and prepared for parade at 9.30. Dismissed and spent morning digging cess hole for cooks. In aftn. watched 1st A.A.S.C. sports, read & wrote. Our scout flight exhibition flying over us and tricks very fine. One came down with engine trouble & broke wrist. Read in evening. Slept badly.\n","159":"\n\nOut to work at 7.45 & had to wait for wagons. Mess up. Worked till one on formation for light railway at Dump & railway crossings. Very hot. In aftn. cricket v Artillery. Won by about 30 runs, 19 & 110. 19 & 110. In evening wrote some & played bridge. Warm.\n","160":"\n\nVery warm. Out on job at 7.45 & worked till 1. Linton, Edmonds & Reid gong to Field Ambulance to superintend road. In aftn. cleaned up,\n\nwrote diary, watched cricket & in evening wrote letters.\n","161":"\n\nFine. On job as usual and carried on filling holes till in some clod fights. Remains of artillery dinner. On guard at 5. Match with drivers won by us, 20 runs on 1st innings. Quiet guard and did a small amount of letter writing. L.\n","162":"\n\nOn guard, some showers during day. Off at 5 and down to drivers on bike. Back and to canteen & to cricket match v A.S.C. drawn. In evening heavy showers. Moffitt back.\n","163":"\n\nOn to job as usual and filled in light railway till 1. In aftn. cleaned up and prepared to go to St. Omer to-morrow. Did a good deal of washing. Saw finish of football against A.S.C., won by Artillery and had several games of tennis. Read before going to bed.\n","164":"\n\nHeavy rain in morning and heavy showers all day and sunny with a strong wind the rest of day. Decided not to go to St. Omer and didn’t go out to work. Spent day reading and wrote two letters and dried clothes. Moving to Light Brigade front to-morrow.\n","165":"\n\nOut to work as usual at 8 and only No. 2 going out. Worked till 11.30 filling in line and home to dinner and packed up and moved about 1.30. Only 3 pontoons. I took 9 men on to one pontoon and we moved to new place on left of Borre and off parallel road. Living in fairly good dugouts with Edmonds. Nothing doing for us but No. 1 out on supports & lost coming home. No. 4 on mines. Read till bed time. Fine but cloudy.\n","166":"\n\nBreakfast at 8 and only Jensen\n\ngoing out at 9. Didn’t do much all day and read & improved dugout. Bed after game of bridge.\n","167":"\n\nUp at 8 and nothing doing. Out at 3 and with Jensen who showed us job on front line 2nd zone. However, cancelled and had to carry in shovels. Out at 9 and long walk to Courte Croix Switch and no orders. Bad mess up and had to dig dugouts for \"C\" Coy, 12th Batt. Home at 1. Tired. Very hot & sultry.\n","168":"\n\nStayed in bed till 1 and in aftn. read and rested. Very hot & still sultry and some rain in night. Out at 9 with Reid and Sparkes & Boot together. Very slow party and dug 4 dugouts. Some H.V. shrapnel & gas on left. Home at 1.30. Very tired. Sarre back.\n","169":"\n\nDidn’t get up till 5 and then cleaned rifle and things, wrote diary before going out as usual. Hot & sultry & tired. Out at 9 and with Reid and got 4 dugouts finished. Very good work but didn’t get home till 2.30. Fairly quiet although some shells on support lines. Very dark coming home and took another way home. Rumours of Scots going over against Meteren but didn’t come off.\n","170":"\n\nBonza day. Cool breeze. Up at 12 and in aftn. wrote some letters and read. Argument with Jensen. Out at 9 and got Sparks & Sarre also with us. Only small party and did part of 3 excavations. Home fairly early & got cocoa at Rouge Croix. Meteren stunt on.\n","171":"\n\nFine. Slightly muggy and thundery in evening. Up at 4 and cleaned out dugout. Edmonds gone\n\nwith Strain to new Battn. hqs. to live. Meteren, Merris & Outersteene taken at 8 and only a smoke barrage. Rumours of French success retaking Soissons & advancing on 15 kilos, 17000 prisoners and 200 guns. Out at 9 with Sparks and Reid. Some rain and only a small party. Most gone up carrying. Nearly missed party and caught unloading pontoons. Robb out & next to last night. Home fairly early quietly although good deal of shelling on supports & we struck a wounded S.A. and I brought his rifle home. Cocoa at Rouge Croix on way back.\n","172":"\n\nPretty heavy showers all day. Up at 2 and no breakfast as wasn’t called. Cleaned up generally and finished letters before going out. Out at 9 with Sparks only. And 25 in party. Finished dugout and rest on draining and improving trenches. Some shelling and one landed right on parapet opposite us. One dugout on left blown in and one killed and two wounded during day on Sarre’s job. Home at 12.30 and shelling Rouge Croix. Went round to \nRouge Croix\n outer line & on Caestre road and had to ask directions. Good deal out of road. Home by 2.45. No rain during evening.\n","173":"\n\nUp at 2 and Dinner and good breeze. Went over with Burkitt to Caestre and got 3 of Laurie’s grave. Home for tea and not going out to-night. In evening read Pelman and bed at 11 but couldn’t sleep at first. Edmonds home about 12.\n\n22.7.18\n\nFine and warm. Only called at 7.45 to go out at 8 and got away at 8.30 and walked to mined crossroads\n\nthen on to Nord Street. In front left of Strazeele & support line. Some shelling on job nearly all day. Only Dola & myself working there and dug away in the 7 ft. trench until 3.30. 11th Battn. there and very windy. ","174":" brought in 9 Fritz’s who gave themselves up. Home & some water at Comforts Fund. In evening read Pelman and bed at 11.30.\n","175":"\n\nUp at 7 but breakfast late & on job with Groth on left. Raining nearly all day and got fairly wet. Found I had to go to Dare’s job so went over and arrived about 11. Worked till 12.30 and then home as too wet to work in aftn., dried clothes and cleared a bit so rode to Borre for paper. Bed early and tired F.C.\n","176":"\n\nOut at 8 and got some work done. Fine day and had to stop at 1 as couldn’t throw dirt up on parapet. Heavy shelling and 2 killed & 2 wounded just over road. Scrambled home over mud track. In aftn. cleaned rifle and some Pelman in evening. Fritz Planes over. Got paper from Borre on road home. Bed tired.\n","177":"\n\nOut at 8 in good time. Work much easier and worked on both sides till 12.30 when work ran out. Only a few shells. Followed road round to left job and got a good deal of shrapnel and H.E. and one miner wounded & another slightly. Had dinner and came home about 1. In aftn. cleaned up, read paper and Pelman.\n","178":"\n\nUp at 8 and to go on left job, Carter on right. Showers all day. Out alone with No. 3, Fancote, Mozzat, Sands. Fooled around a lot after quickly getting work done and\n\nhad dinner. Home at 2. Bombardment by our heavies but fairly quiet on job except for some 4.2\" about 70 yards up. Amused myself in aftn.\n","179":"\n\nSome more showers and up at 8. However no material gone up so didn’t go out to work. Played bridge in morning and in aftn. did Pelman and also in evening. Finer in aftn. Fairly rough for night workers on new line last night and Stott wounded in shinbone by M.G. bullet. Rest very muddy. Paid.\n","180":"\n\nStill no work and up at 8. Fine day spent in writing Pelman and trip to Borre for papers. Wrote more in evening and cleaned up dugout.\n","181":"\n\nFine. No work. Change over to-morrow. Did Pelman and wrote letters in intervals of preparing to move. Edmonds & Co. back. Support work still, with Tommies.\n","182":"\n\nWarm and fine. Got ready to move and finished letters. Moved at 1.30 to old billets left in filthy state by 1st Coy & reported on it to Robb. Spent rest of day cleaning up. No one out except Groth, Carter gone to D.A.D.O.S. to put up Nissen huts.\n","183":"\n\nPerfect day, warm. Up at 10. Cleaned up and made sundry improvements and read in intervals. To go out to Nord Street at 8.30 with Sparks. Rest except Sarre on day work. Got 15 men and worked till after 1. Good men 6th Battn. Very noisy night but not much near us and many shell holes in road near batteries. Rumours of moving in 2 days time for spell.\n","184":"\n\nBurkitt woke us at 7 for graves and told us we were moving in aftn. Breakfast at 9 and had to get up and prepare for moving although very tired. Dinner at 11.30 and moved down to Horse line at 1.30 relieved by 29th Division. Marched down and very hot and camped in open air. Kit inspection at 6 and I have very heavy pack with blanket. No news except move about 1 in morning to La Kreule for motor lorries to \nHazebrouck\n near Saint Omer. Rumours of spell but mostly to go down for stunt on Somme with other divisions. Tried to sleep but couldn’t get any sleep at all. Bombs were dropped fairly close and fairly cold.\n","185":"\n\nCalled at 1 and started at 1.30 and marched to Hazebrouck, Godewaersvelde Road by railway and caught lorries. Fairly comfortable and no time to wait. Good journey but very roundabout and arrived at Henringhem at 5.50 & got some cocoa & biscuits at Comforts Fund. Marched to about 4 kilos from village & some trouble with No. 3 about billets. Spent all day cleaning up etc. & had to move again to new billets, not very good and very crowded. Got 2 hours sleep in \nevening\n aftn. and then went down to Wardeckes on bike for ride. Home at 9 and to bed very tired. Slept well and had to get up twice. Some rain till 3 o’clock.\n","186":"\n\nFine but cloudy. Up at 6.30 and prepared for drill order at 9.30. Did an hour’s rifle drill & dismissed. Read in morning & going to St. Omer in aftn. Caught lorry in and had to change a few times. Not much doing and walked about all time. Home by 8.30 and to bed about 10.\n","187":"\n\nUp at 7.30 for breakfast and\n\ndrill order at 9.30, dismissed and in morning cleaned up and enjoyed life. Wrote letters and read in aftn. & in evening went for ride with Linton to Pont Aston and back by Bandringhem . Some rain in night.\n","188":"\n\nShowers all day. Up at 7.30 & drill order at 9.30. Rest of morning cleaned limbers etc. and in aftn. watched cricket versus Tommy A.S.C., won by us easily. In evening rode to Arques with Sarre along canal & got some tobacco & beer. Very wet coming home. Bed. Move to-morrow.\n","189":"\n\nFiner, strong wind and only one shower. Up at 7.30 and drill order at 9.30. Dismissed & spent morning getting mobile. Marching order at 12.30. To entrain at Arques about 8 for Hangest between Abbeville and Amiens. Wrote letters in intervals. Lunch at 11.30 and marching order at 12.30. Packed gear and cleaned up and played bridge till time to move. Moved at 2.20. Price had a fall from his horse. Marched to Railway Station at Arques and had some A.C.F. cocoa and again before leaving. Nothing to do until train moved. No. 3 doing some loading. Two-up going strong. All sections in one truck and pretty crowded. Train started at 8.30 and via Calais to Abbeville. Couldn’t sleep at all as rest all sprawled out.\n","190":"\n\nGot more cocoa before Abbeville and got into A.S.C. truck & only Co. in it. Arrived at Abbeville at 3.20 & our train ran into","191":" Battn. train backing on to loop in front of us and upset 3 big trucks and partly two others. Nobody hurt. Some delay and arrived at Hangest about 6. Waited for transport and got going at 9 and marched through Flixecourt, long & steep hill to Mouflers\n\narriving about 11.30 and got settled to fairly good billets and prepared for dinner. However got orders to move again and had to pack up straightaway. Transport moved straight away but we we waited till 5 and took lower track through L’etoile and across Somme to near Pont Remy where we got motor buses. Big convoy about 140 cars, 11th Battn., 10th, and some of 9th, waited for about an hour started at 9.30. Through Flixecourt again & Longpre and roundabout track to Catennets, arrived about 2 and put in bad billets 1, 2 & 4 together. I slept out under a wagon. Got to bed about 3.30 and slept on till 9 when we had breakfast. Fine.\n","192":"\n\nGot mobile and I snatched a short rest before moving again. Fine. Moved about 3.30 and on through Allonville to Vaire. Stopped on road at about 5 for tea and several long stops. Following behind M.G. 21st Coy and 11th Battn. and arrived coming through Corbie & Hamel at Vaire at about 9.30 just after dark. Corbie shelled a good deal but otherwise not much sign of war. Good few shells round Vaire but roads very good and hardly any guns going bar 2 or 3 heavy and long range 6\" guns. News of us doing very well and attacking at 4 in morning and various rumours of advancing 10 miles capturing 19000 prisoners & 200 guns etc. Extremely quiet and not many wounded coming down and many troops going up but very little extra transport. Got straight to bed after piling arms and\n\nhaving everything mobile and slept out in open on grass and slept very well although very heavy dew. Fine.\n\n9.8.18\n\nCalled at 6.30 and had breakfast and got mobile straight away and then waited about & wrote diary and had a look at part of the village. Fine. Moved about 9.30 and up through Vaire wood and on to tracks towards Bayonvillers. However went past and camped near railway line on left front of Guillaucourt. Moved up very slow with numerous rests & in artillery formation apparently acting reserve to the attack. Big dump of wood, wire, etc. just behind us near railway line and a good few dumps of shells along line. Also one 8\" howitzer in distance. Camped alongside 10th Batt. cookers. Very quiet coming up except for 3 H.V. L.R. guns firing near balloons. One balloon was continually moving but in end something happened & 2 men came down in parachute drifting quickly towards Fritz and soon after balloon came down in flames. No tea or anything and dug in for night in open air bank and soon slept although some doubts of moving several times. All night aeroplanes were over dropping a good few bombs.\n","193":"\n\nFine. Called at 6 although I didn’t get up till later and got mobile and kept so all time. Bad breakfast and afterwards cleaned up and watched 11 tanks going up into action on right. Moved about 9\n\nfollowed line & then straight to close right front of Vauvillers. Very interesting German dugouts hurriedly abandoned and well camouflaged in a wood. Also a motor car and some transport and a big headquarters with wires going in all directions all well dug in. Got to some old abandoned dugouts and some doubt as to moving. However brigade held up by artillery & M.G. so staying for present. Tea for dinner & in afternoon dug in and got a german groundsheet for cover and had a look at an old trench and stables in a wood. Only about 3000 yds from line under observation. Went down to our cookhouse in a house and had a lovely wash and filled water bottles. Then got in shade and rested. 2nd Coy on right mostly salvaging and on reconnaissance work. Advance going well on right. Many German new guns brought up and making it pretty lively. Fremondville smashed to blazes. One of our observers brought down close to road both being wounded and Fritz planes very active. Had a good stew for tea and nothing doing so went to bed soon after dark. Bombing severe as usual and towards morning much gas put over and woke me up and set us all sneezing.\n","194":"\n\nBig bombardment at about 4 and hopped over again going about 3 kilometres by 9 & very heavy going and plenty of M.Gs. Still nothing doing. In aftn. did a little salvaging and dug some\n\nmore of the hut. Bed at dark & bombing as usual. Fine.\n","195":"\n\nFine. Nothing doing. Read & general clean up. Quiet. Papers and letters. Passed time and bed at dark. Scarcity of matches & tobacco & all canteen goods. Framerville heavily bombarded and also batteries round Vauvillers.\n","196":"\n\nFine. Nothing doing. Painting captured trophies. Bed as usual & heavy barrage put on us just before daybreak. Carried over two cupolas.\n","197":"\n\nMore painting but I didn’t have to go over. Fine. Were to move but postponed till 15th. Passed day. No letters. Artillery very active.\n","198":"\n\nGot ready for moving. Fine & hot. Dugout built last night and more comfortable. Counter attacked this morning & badly knocked back. Leaving at 2.30 & rumours of only out for a few days and going near river to practice pontooning. Left about 3 after waiting for wagons to take blankets. \nNo. 2 went alone and marched to Villers Brettonneux. Very hot & dusty. Waited there till pontoons found and then loaded up.\n Very warm and marched to Dump at Wiencourt at horse lines and had to dig in for night. Very hot and spent before dark digging in and had a wash, a talk with some Americans and made some tea before going to bed on own. Some planes over but some way from us and not very exciting. Slept well. Fine.\n","199":"\n\nUp at 6 and had to hurry to be ready. Started about 8.30. No. 2 going ahead separately to Villers Bretonneux to load pontoons. Very\n\nhot and dusty and warm pace. Arrived about 11 at Villers Bretonneux and rested while pontoons were being discovered. Loaded up & got some tea for dinner and had to go some distance to get water. About 20 H.V. shells fell in town and caused some disturbance amongst Tommies & our wagon bolted. Off at about 1 and down to river at Vaire arriving about 3 and had dinner and afterwards swim, very enjoyable. Camped in open under canvas trench tent not too comfortable. Bed at dark after getting mobile. Fine & warm.\n","200":"\n\nUp at 7 and drill order at 8.30. Put gear away and spent morning on pontooning. Very rough go. Drill order again at 2.30 but were dismissed and spent afternoon and evening washing clothes and cleaning up and trip to canteen. Rosewarne out of cookhouse. Cloudy but warm.\n","201":"\n\nWindy during night and slight rain. Clearer to-day and some sun. In morning bath parade at 8.30 but went down to river instead. Spent rest of morning writing this & letters and dodging cleaning of limber. Pope gone on leave. Expect to go up line again shortly. 2.30 parade in drill order but dismissed & spent aftn. cleaning up, reading & writing. Review by Glasgow at Vaux practised.\n\n19.8.18\n\nUsual. Finer. In morning drill order and marched to Vaire at 9. Inspection at 10 and all fairly good. 2nd Coy absent. In aftn. fixed greasy pole\n\nfor 3rd Brigade swimming sports to-morrow. Worked late and rested in evening & bed after game of bridge.\n","202":"\n\nUsual parade about 9 and dismissed after a little squad drill and went down to swimming at near Vaire. Sparks won neat dive and got 3rd in Teams race. Didn’t go in aftn. & wrote instead till evening. Also bridge before dark. ","203":" Battn. chap drowned in under water swim and first event cancelled. Fairly fine.\n","204":"\n\nDrill order at 9.30 and dismissed soon afterwards & got packs ready for dumping. After dinner fell in at 1.30 and stacked gear. Went down for swim & rested till time to move up line about 5. Another stunting trip and right already advanced. 25 reinforcements and 7 to our section. Moved off with everything and marched through Hamel towards Warfusee-Abancourt and then cross country. Extremely warm and dusty and camped in a bad set of dugouts near a road and edge of wood between Cerisy and Bayonvillers. Had a drink of tea and settled down in makeshift dugout for night with Sarre.\n","205":"\n\nVery warm all day. May move up, up at 7. Got to work on dugout & made bigger & rigged up temporary shelter for C.T.U. . Dunstan in aftn. Very hot work and not much water. After tea got orders to move up and big job on Brigade when arrived at new camp.\n\nStarted off at 8, Nos. 2 & 3 going & other sections coming up in morning. Marched about 3 miles nearly on to job & found we weren’t wanted so went back arriving about 10.30. Good few planes up and 11 bombs dropped about 400 yds from us on some batteries. Passed some captured 5.9\" on way. Bed after some supper at 11. To move at 4.15 in morning forward and reveille at 3.30. Slept well.\n","206":"\n\nUp at 3.30 and had breakfast. Barrage started at about 4.15 and we marched off about 4.30 after waking Bailey. Marched same track and camped in front & on right of Morcourt & Mericourt in an old French trench near a copse. Settled there and I was left in charge. Sarre, Groth & Jensen & Robb gone out to see some new work at forward Brigade & also 16 men for a big job. Got cooks gear over and only about 5 left. Shovels very short and I started digging an open air place, level for sleeping in trench. Dinner at 12 and party came back as job cancelled. Got to work on dugout and very warm & extended it. Standing to wait for work. However nothing much doing so after tea went down to river and got some drinking water and had a good wash. Some material up so on return set to work and made a rough cupola dugout after some argument about style. Finished about 10 and to bed fairly comfortably and slept well. Fine day.\n","207":"\n\nLovely day with beautiful breeze. Told off in morning to go out at 11 o’clock and given hour’s warning. Groth, Sarre, Jensen & Robb gone out and two parties. However home at 12 o’clock and again job cancelled. At 1.30 took my party out and digging officers mess 13 x 10 in trench & tarpaulin covered and camouflaged and also officers cookhouse. Worked till 5 and had good tea and finished job about an hour’s work after tea. Cleaned up and to bed after short game of bridge.\n\n25.8.18\n\nBreakfast about 8 and Sarre and rest of other party out on dugout job for M.O. Lovely day with gentle breeze and spent morning cleaning up, writing this and letters.\n\nSunday. Stunt seemed perfectly satisfactory and about 2,500 prisoners. 1st Brigade rather heavy casualties & also","208":" Battn. again. Passed aftn. reading and bed at dark.\n","209":"\n\nLovely day and aired blankets. Nothing doing and spent day reading and cleaning up. 2nd Div. up here and expect to move to-morrow. However orders to move at 7.30 came at 6.15 and got mobile. Set off at 8 and marched down to Cerisy on left & Amiens side in a sunken road. Bad dugouts but makeshift for 3 for night in 6 x 6 and to sleep.\n","210":"\n\n2nd Div. supposed to move to attack but heard no more. Fine, but slight showers.\n\nBreakfast at 8 and short parade at 9 and spent rest of day spare time in digging in. Living alone and Linton & Sarre prefer own dugouts. Hard work but by nightfall had a bunk in and armchair. Worked on bomb proof horse lines from 3 to 5 and bed at dark tired.\n","211":"\n\nUp at 8 and drill order at 9.30. Hurried to shave and clean rifle. No other work for me and spent rest of day making curtain and putting finishing touches to dugout. Swim at 4 fair and walk to Cerisy. Read and bed at 10 tired. May be here 14 days. Packs in. Reached to ½ mile from Peronne and 2½ miles past Hindenburg line at Arras. Bed at 9.\n","212":"\n\nFine & some wind. Parade at 9.30 & free rest of day. Swim in aftn. Nothing else doing so read & went for short walk in aftn. Bed at 9.\n","213":"\n\nFine. Usual parade at 9.30 and had to take digging party. Slow work and finished at 3. Spent until dark doing washing. Bed tired after some reading.\n","214":"\n\nSlight showers in early morning. Fine & windy rest of day. Machine gun in morning & in aftn. cleaned up and read & wrote and also till 11 at night.\n","215":"\n\nCool wind. Church parade at 9.30 and marched down to gully to 9th Batt. H.Q. About 10 min. farce & heavy shower and meeting broke up. Marched home & some\n\nabsurd on right form company by Major. Dismissed at about 11.15. Bath parade at 2 and marched down to Gailly. Cold water and rotten clothes. Didn’t take either. Back and guard at 5. Everything quiet and bed at 10.30. Extremely cold and couldn’t sleep properly.\n","216":"\n\nCloudy and cold wind. Quiet, guard all day. Wrote late in evening. Bed at 11.30. Football won v 2.\n","217":"\n\nFiner. M.G. practice in morning after some squad drill & may move to-morrow. In aftn. printing & letters written.\n","218":"\n\nUsual. Fine. Squad drill.\n","219":"\n\nBath in morning. Heavy storm in evening.\n","220":"\n\nUsual. Fine. Dismissed at 9.30. Blanket fumigated at 1.30 and home at 4.30. Sentimental Coves Concert at 6. Fair & uncomfortable. 3rd Brigade concert farce. Home at 10 & bed. Moving to-morrow.\n","221":"\n\nFine. Up at 6 and transport moved at 7.30. We moving at 10 by bus from Cerisy. Had to go down as marker and buses arrived about 10.15. Got in, reported to transport officer & moved off about 10.30 and passed through Morcourt, Herbecourt, outskirts of Peronne where we arrived about 3.30. Marched to Mont St. Quentin about ¾ mile and camped in old trench. However, before dark, Sarre, Linton & I fixed up doors of old german hospital & formed humpy above ground. Bed at dark. Inclined to rain & strong west wind and some showers. Aeroplanes over dropping bombs and gas. No danger.\n","222":"\n\nHad a swim last night in pond and dozens of big fish dead through concussion. No move to-day and rested. Still some showers and strong west wind. Paid in afternoon and did some Pelman finishing course. Bed at dark.\n","223":"\n\nUp at 6 and got mobile and loaded limber and moved at 8 through Doingt and on to left of road opposite Tincourt in half dug german trench near woods. Spent rest of day digging possy and finished before dark. Also went down to Tincourt for water and bed soon after dark. Fair possy, Tincourt burnt down and cellars blown up. Some rain during night and Bombs dropped in early morning.\n","224":"\n\nUp at 7.30 and out to work with whole section at 8 to First Brigade. Some waiting about and showery windy rain. Pulled down two bow huts and loaded foundations in wagon. Home at 12.30. Out again at 1.30 and took over Reid, Hosking, Sparks and Clow to erect huts. However No. 3 on job so went blackberrying. Went to find Tuck but found Major who grabbed me for motor lorry stunt. Lorry came after hour’s wait & unloaded & went down to 1st Brigade road at 5. However couldn’t carry so far and couldn’t use mud track so home to tea at 6.30. After tea some of section had to go down again for loading.\n\nHumpy fallen in so rebuilt before bed. Bed tired.\n","225":"\n\nUp at 5.30 and down to D.H.Q. at 6. Still windy and showery clearing in aftn. and cold. No work before 8 when we had breakfast except to clear paths. After breakfast worked on two latrines and home for dinner at 1. Started again at 3 and D.H.Q. arriving. Worked till 7 on 5 latrines and 2 cookhouses and home tired, parcels. Bed soon after.\n","226":"\n\nStayed in bed till after dinner and in aftn. wrote diary, showered and general clean up. Nothing doing and still cloudy, windy and cold. Supposed to stand to for work in evening but nothing happened and bed at 10.30. H.V. 5.9\" gun firing very close round here. Two new men Phillips & Killick No. 4 were killed and Hague wounded in muscle of arm. 1 mule killed by splinter through eye. Nearly everyone scattered but I stuck it.\n","227":"\n\nStill cold, windy and cloudy. H.V. gun going at hour intervals all night but no damage. Stayed in bed all day reading etc. Claude & some of section on dugout for H.Q. More shelling. McDonald, Burgess, McKenzie going to Australia. 6 gone on leave and am now 6th on list. Read and wrote in evening.\n","228":"\n\nCloudy. Up at 6 and on to D.H.Q. job at 7 and worked till 12 on bomb revetments on mess. In aftn. loading pontoons with 8 men, 3 trips to new horse lines and unloaded.\n\nThen loaded some material. Home at 5.30. Rumours of up line to-morrow. Quiet. American success. Jensen gone to Australia. 5th on list now, not feeling too bright. Read a little in evening.\n","229":"\n\nNothing doing all day and quiet. Fifteen of section out at 6.30 with Sarre & Scott on forward Battalion H.Q.s and home quietly at 11. Played bridge in evening, good game and wrote letters in aftn. Not moving.\n","230":"\n\nSome small fatigues in morning with spare men and no one going out to-night. Bridge again good. Rained heavily during good part of night.\n","231":"\n\nNobody working and stunt to-morrow. Read in spare time. Windy but fine. All sections in stunt and all day laying out tape track for mules to Ziln copse and perhaps dig Battalion H.Q’s later. I may not go up. Bed after game of bridge.\n","232":"\n\nNot going. Some rain in night & pretty heavy & misty in morning. Mob up at 4. However didn’t get up and spent day writing letters and some small jobs. Mob home at 9 and good stunt. Some souvenirs and all pleased. Bed at 11 after hot dinner.\n","233":"\n\nFine. Orders for all to move up at 8 cancelled and only 12 from each section going. I stay back. Bustled round getting tools before mob left and afterwards played bridge most of day. In morning sent out 25, made fatigues and\n\nin aftn. out on pontoons to Hamel, Marquaix and Roisel for windlass material. Back at 5.30 quietly. Played bridge in evening and also Rummy. Bed at 12.\n","234":"\n\nUp at 7.30 and parade at 8.30 and spent day making windlass with Batten, Dola and Reid. Good job well done. In evening finished diaries, letters, etc. and expect pass in morning. Bed at 10.30.\n","235":"\n\nFairly fine. Some rain during night. No pass through all day and in morning went out to Roisel and salvaged timber flooring and 3 x 2. Got some good mineral water. Rested in afternoon and played bridge in evening.\n","236":"\n\nFine. Timber stunt again to Roisel & brought gear back to camp. Read in intervals. Batten a nuisance. Only 4 went on leave this afternoon.\n","237":"\n\n8.15 parade usual and only some odd jobs. Spent rest of day playing cards and reading.\n","238":"\n\nSome odd jobs and usual Sappers came home late in evening.\n","239":"\n\nWashed wagons in morning and other part of section, loaded pontoons in aftn. Drill order parade at 4 and inspection of gear for back areas. May move at midnight but probably to-morrow.\n","240":"\n\nBreakfast at 8 and after cleaning up moved off about 9.30 to Tincourt railway Sta. However had to wait till 12 before getting away and crowded in truck. Moved\n\nthrough Chaulnes, Rosieres, Amiens to Longpre arriving at 6.45. Everything desolation until between Amiens & Rosieres and Amiens badly knocked about. Started at 7.15 on 6 mile march through L’etoile to Surchamps arriving about 10 and in a long room with bunks and fairly comfortable although no water. Bed after supper and tired at 12.15.\n","241":"\n\nSlept in till 9 and had breakfast. Nothing doing till dinner and cleaned up afterwards getting some walnuts. In afternoon some sanitary fatigues and on guard at 5. Some trouble with Ferguson and Cook going on when home from leave. Quiet and good guard room. Newington up village but all well. I slept upstairs but couldn’t go to sleep till after 1. Spencer, Robertson, Warren and several others drunk and some noises. Gentle told me leave was through. Some showers.\n","242":"\n\nShowery. Up at 8 and spent morning getting ready and fixing up pass. Off at 12 and went to St. Ouen. Had some stout and caught train to Longpre at 1.30. Lobbed at 2.30 and had some dinner in village. Met 11th Battn. Sergt. and found train, left at 6.51 for Abbeville. Spent some time at Y.M.C.A. and caught train at 7 and got to Abbeville at 8. Found no leave train till 8.30 but by skilful wangling to go on Paris passenger at 4.30. Spent night getting some supper & then trying to sleep in rest hut but\n\nvery hard and rather cold.\n","243":"\n\nSome showers and cloudy. Couldn’t sleep at all and after a snack went down to station at 3.30. Train late and didn’t arrive till 5.45. Very slow and got to Boulogne at 10. Walked down to leave boat & wangled successfully & going in aftn. Had dinner in Boulogne and waited till 2 when boat started. Sergeant knocked back early pass. Good crossing two hours. Left Folkestone at 5.30 and Victoria at 7.30. Took till 9.30 to fix up and driven round to Jacksons in West End and bed very tired.\n","244":"\n\nUp and good breakfast at 9 and down to H.Q. Money & shopping and a walk round. Dinner at Aldwych hut. Some showers and cloudy. In aftn. War Chest and more promenade. In evening Coliseum, good show but not so good as expected. Home at 11 and bed tired.\n","245":"\n\nUp at 9 and saw dentist at 9.30 at New Oxford Street. Walked round most of day, dinner at Aldwych & tea at War Chest. Bus ride to Roman Road. In evening Shaftesbury, Yes Uncle. Very good and funny with Chapman.\n","246":"\n\nUp at 9 and waited about till 11. Saw dentist and then dinner at Aldwych Hut & met Chapman. Went to You Never Know Y’Know at Criterion and fairly rotten. Had tea at War Chest and saw Maid of Mountains in evening. Excellent. Walked home straight after a little fuss at Tube and to bed about 10. Cloudy but fine.\n","247":"\n\nCloudy a little part of day. Walked round a bit in morning\n\nand saw Maintee, A Naughty Wife at Playhouse at 2.30. Very nice little play. Back to War Chest Club and had tea and caught a taxi to Fenchurch Street. Very slow and had to change at Pitsea at 7.30 and no train till 8.27. Must have hopped into an earlier train. Caught train at 8.27 and landed at Southend at 9. Found place alright and very lovely. Had some supper, wine, and cigar and went for walk along sea front. Back and had a glorious bath. Bed at 12.30, beautifully furnished place. Very tired.\n","248":"\n\nCloudy in morning but cleared into lovely day. In morning got up at 7.30, tea in bed and after good breakfast short walk round before going to station. Caught train at 9 and landed at 10.15. Mr. Nortier showed me round Royal Exchange and Guildhall. Dinner at War Chest and in aftn. walk round streets. Tea at Aldwych and went to Palladium. Very poor show, and went to Jacksons for necessary. Started for Kings Cross at 9.30 for Edinburgh. Two trains went and I caught second at 10.30. Good seat but big crowd on board. Slept very little and got to Edinburgh at 8.30 after a fast and good run. Train didn’t leave till 9.30 so went down Princes Street, had breakfast\n\nand purchased some cold cure. Caught train at 9.30 and travelled over Forth Bridge and saw the shipping in Rosyth. Arrived at 10 and walked a good way out of road before finding place, rather tired. Lovely place and fine bedroom. Had lunch at 1 and in aftn. went for walk with Smith to Rosyth and home by tram. Some shooters to lunch and 2 ladies to tea. After tea some gramophone and bed at 9.30 tired. Very wild day and some showers.\n","249":"\n\nVery wild day and up for breakfast at 8.30. In morning read as too wild to go out. Invitation to tea on Tuesday and Thursday. In afternoon walked to Dunfermline catching tram at hospital Hill and back same way. Some heavy showers on way & still very windy. In evening had some good gramophone records and bed at 9.30.\n\n"}}