{"Document Name":{"0":"Diary_0449","1":"Diary_0449","2":"Diary_0449","3":"Diary_0449","4":"Diary_0449","5":"Diary_0449","6":"Diary_0449","7":"Diary_0449","8":"Diary_0449","9":"Diary_0449","10":"Diary_0449","11":"Diary_0449","12":"Diary_0449","13":"Diary_0449","14":"Diary_0449","15":"Diary_0449","16":"Diary_0449","17":"Diary_0449","18":"Diary_0449","19":"Diary_0449","20":"Diary_0449","21":"Diary_0449","22":"Diary_0449","23":"Diary_0449","24":"Diary_0449","25":"Diary_0449","26":"Diary_0449","27":"Diary_0449","28":"Diary_0449","29":"Diary_0449","30":"Diary_0449","31":"Diary_0449","32":"Diary_0449","33":"Diary_0449","34":"Diary_0449","35":"Diary_0449","36":"Diary_0449","37":"Diary_0449","38":"Diary_0449","39":"Diary_0449","40":"Diary_0449","41":"Diary_0449","42":"Diary_0449","43":"Diary_0449","44":"Diary_0449","45":"Diary_0449","46":"Diary_0449","47":"Diary_0449","48":"Diary_0449","49":"Diary_0449","50":"Diary_0449","51":"Diary_0449","52":"Diary_0449","53":"Diary_0449","54":"Diary_0449","55":"Diary_0449","56":"Diary_0449","57":"Diary_0449","58":"Diary_0449","59":"Diary_0449","60":"Diary_0449","61":"Diary_0449","62":"Diary_0449","63":"Diary_0449","64":"Diary_0449","65":"Diary_0449","66":"Diary_0449","67":"Diary_0449","68":"Diary_0449","69":"Diary_0449","70":"Diary_0449","71":"Diary_0449","72":"Diary_0449","73":"Diary_0449","74":"Diary_0449","75":"Diary_0449","76":"Diary_0449","77":"Diary_0449","78":"Diary_0449","79":"Diary_0449","80":"Diary_0449","81":"Diary_0449","82":"Diary_0449","83":"Diary_0449","84":"Diary_0449","85":"Diary_0449","86":"Diary_0449","87":"Diary_0449","88":"Diary_0449","89":"Diary_0449","90":"Diary_0449","91":"Diary_0449","92":"Diary_0449","93":"Diary_0449","94":"Diary_0449","95":"Diary_0449","96":"Diary_0449","97":"Diary_0449","98":"Diary_0449","99":"Diary_0449","100":"Diary_0449","101":"Diary_0449","102":"Diary_0449","103":"Diary_0449","104":"Diary_0449","105":"Diary_0449","106":"Diary_0449","107":"Diary_0449","108":"Diary_0449","109":"Diary_0449","110":"Diary_0449","111":"Diary_0449","112":"Diary_0449","113":"Diary_0449","114":"Diary_0449","115":"Diary_0449","116":"Diary_0449","117":"Diary_0449","118":"Diary_0449","119":"Diary_0449","120":"Diary_0449","121":"Diary_0449","122":"Diary_0449","123":"Diary_0449","124":"Diary_0449","125":"Diary_0449","126":"Diary_0449","127":"Diary_0449","128":"Diary_0449","129":"Diary_0449","130":"Diary_0449","131":"Diary_0449","132":"Diary_0449","133":"Diary_0449","134":"Diary_0449","135":"Diary_0449","136":"Diary_0449","137":"Diary_0449","138":"Diary_0449","139":"Diary_0449","140":"Diary_0449","141":"Diary_0449","142":"Diary_0449","143":"Diary_0449","144":"Diary_0449","145":"Diary_0449","146":"Diary_0449","147":"Diary_0449","148":"Diary_0449","149":"Diary_0449","150":"Diary_0449","151":"Diary_0449","152":"Diary_0449","153":"Diary_0449","154":"Diary_0449","155":"Diary_0449","156":"Diary_0449","157":"Diary_0449","158":"Diary_0449","159":"Diary_0449","160":"Diary_0449","161":"Diary_0449","162":"Diary_0449","163":"Diary_0449","164":"Diary_0449","165":"Diary_0449","166":"Diary_0449","167":"Diary_0449","168":"Diary_0449","169":"Diary_0449","170":"Diary_0449","171":"Diary_0449","172":"Diary_0449","173":"Diary_0449","174":"Diary_0449","175":"Diary_0449","176":"Diary_0449","177":"Diary_0449","178":"Diary_0449","179":"Diary_0449","180":"Diary_0449","181":"Diary_0449","182":"Diary_0449","183":"Diary_0449","184":"Diary_0449","185":"Diary_0449","186":"Diary_0449","187":"Diary_0449","188":"Diary_0449","189":"Diary_0449","190":"Diary_0449","191":"Diary_0449","192":"Diary_0449","193":"Diary_0449","194":"Diary_0449","195":"Diary_0449","196":"Diary_0449","197":"Diary_0449","198":"Diary_0449","199":"Diary_0449","200":"Diary_0449","201":"Diary_0449","202":"Diary_0449","203":"Diary_0449","204":"Diary_0449","205":"Diary_0449","206":"Diary_0449","207":"Diary_0449","208":"Diary_0449","209":"Diary_0449","210":"Diary_0449","211":"Diary_0449","212":"Diary_0449","213":"Diary_0449","214":"Diary_0449","215":"Diary_0449","216":"Diary_0449","217":"Diary_0449","218":"Diary_0449","219":"Diary_0449","220":"Diary_0449","221":"Diary_0449","222":"Diary_0449"},"Date":{"0":"unknown","1":840.0,"2":841.0,"3":842.0,"4":843.0,"5":844.0,"6":845.0,"7":846.0,"8":847.0,"9":848.0,"10":849.0,"11":850.0,"12":851.0,"13":852.0,"14":853.0,"15":854.0,"16":855.0,"17":856.0,"18":857.0,"19":858.0,"20":859.0,"21":860.0,"22":861.0,"23":862.0,"24":863.0,"25":864.0,"26":865.0,"27":866.0,"28":868.0,"29":869.0,"30":870.0,"31":871.0,"32":872.0,"33":873.0,"34":874.0,"35":875.0,"36":876.0,"37":877.0,"38":878.0,"39":879.0,"40":880.0,"41":881.0,"42":882.0,"43":883.0,"44":884.0,"45":885.0,"46":886.0,"47":887.0,"48":888.0,"49":889.0,"50":890.0,"51":891.0,"52":892.0,"53":893.0,"54":894.0,"55":895.0,"56":896.0,"57":897.0,"58":898.0,"59":899.0,"60":900.0,"61":901.0,"62":902.0,"63":903.0,"64":904.0,"65":905.0,"66":906.0,"67":907.0,"68":908.0,"69":909.0,"70":910.0,"71":911.0,"72":912.0,"73":913.0,"74":914.0,"75":915.0,"76":916.0,"77":917.0,"78":918.0,"79":919.0,"80":920.0,"81":921.0,"82":922.0,"83":923.0,"84":924.0,"85":925.0,"86":926.0,"87":927.0,"88":928.0,"89":929.0,"90":930.0,"91":931.0,"92":932.0,"93":933.0,"94":934.0,"95":935.0,"96":936.0,"97":937.0,"98":938.0,"99":939.0,"100":940.0,"101":941.0,"102":942.0,"103":943.0,"104":944.0,"105":945.0,"106":946.0,"107":947.0,"108":948.0,"109":949.0,"110":950.0,"111":951.0,"112":952.0,"113":953.0,"114":954.0,"115":955.0,"116":956.0,"117":957.0,"118":958.0,"119":959.0,"120":960.0,"121":961.0,"122":962.0,"123":963.0,"124":964.0,"125":965.0,"126":966.0,"127":967.0,"128":968.0,"129":969.0,"130":970.0,"131":971.0,"132":972.0,"133":973.0,"134":974.0,"135":975.0,"136":976.0,"137":977.0,"138":978.0,"139":979.0,"140":980.0,"141":981.0,"142":982.0,"143":983.0,"144":984.0,"145":985.0,"146":986.0,"147":987.0,"148":988.0,"149":989.0,"150":990.0,"151":991.0,"152":992.0,"153":993.0,"154":994.0,"155":995.0,"156":996.0,"157":997.0,"158":998.0,"159":999.0,"160":1000.0,"161":1001.0,"162":1002.0,"163":1003.0,"164":1004.0,"165":1005.0,"166":1006.0,"167":1007.0,"168":1008.0,"169":1009.0,"170":1010.0,"171":1011.0,"172":1012.0,"173":1013.0,"174":1014.0,"175":1015.0,"176":1016.0,"177":1017.0,"178":1018.0,"179":1019.0,"180":1020.0,"181":1021.0,"182":1023.0,"183":1024.0,"184":1025.0,"185":1026.0,"186":1027.0,"187":1028.0,"188":1029.0,"189":1030.0,"190":1031.0,"191":1032.0,"192":1033.0,"193":1034.0,"194":1035.0,"195":1036.0,"196":1037.0,"197":1038.0,"198":1039.0,"199":1040.0,"200":1041.0,"201":1042.0,"202":1043.0,"203":1044.0,"204":1045.0,"205":1046.0,"206":1047.0,"207":1048.0,"208":1049.0,"209":1050.0,"210":1051.0,"211":1052.0,"212":1053.0,"213":1054.0,"214":1055.0,"215":1056.0,"216":1057.0,"217":1058.0,"218":1059.0,"219":1060.0,"220":1061.0,"221":1062.0,"222":1063.0},"Entry":{"0":"\n\n","1":"\n\nJust outside Marseilles harbour at daylight & alongside by breakfast. All hurry & bustle then until disembarkation at 1.30. Train left at 2.30. Thro’ Arles, Orange & Avignon which we reached abt. 8 pm & stopped at for tea.\n","2":"\n\nRailway journey across France.\n","3":"\n\nRailway journey across France, reaching Etaples in afternoon.\n","4":"\n\nA rather warmer night & slept comfortably through it. During the morning got my things straightened out & then had a parade for inspection by the camp commandant, but at the last minute he sent word to say that it would not be held until the next day. It turned out a dull grey day & was taken up with getting the men settled in their tents & handing in lists of shortages. In the evening went down to Etaples for dinner.\n","5":"\n\nA beautiful bright day with a very decided nip in the air. The postponed inspection by the camp commandant was held, the massed parade of the 3000 or so men on the hillside making a fine picture. After passing up & down the lines he addressed the men calling attention to the fine work already done by Australians & to what yet remains to be done. After the inspection 50 of my men who had been taken from us at Aerodrome & sent on by the \"Saxonia\" to the 2nd Divn. joined up again with the company. The tents for officers were put up & in the afternoon we moved into them from the hut, Mr Prescott & I being together in one : he had just been appointed Q.M. Stayed in camp for each meal & at night – a beautifully clear starlight night with a nip of frost in it – went down town to purchase eatables, getting back about 9 o’c.\n","6":"\n\nA grey morning giving place to a beautiful day. A Church Parade had been arranged for, but word came that on a\/c of the outbreak of mumps – of which 3 or 4 cases occurred in my company – the whole of us were placed in isolation & the Church Parade consequently was cut out. Before breakfast went for a smart walk with our Adjutant (Lt. Moy) & immensely enjoyed the typical rural scenes of Europe. \n\nOn either side of the lane (which in places was hedged in) were the undulating fields either fallow or with cereal abt 8 in. high in which I noticed several pairs of quail & 1 or 2 hares. Farmers here & there were ploughing & altogether it was a very peaceful picture. Writing & attending to Co. matters during the day, a good deal of excitement being caused in the afternoon by the appearance of 3 French dirigibles abt. a mile away proceeding out to sea over Paris Plage.\n","7":"\n\nA beautifully clear fine day. Company parade in the morning & was then detailed to go with another officer & 60 men to a spot 3 ½ mls. away to act as advance party clearing ground & pitching tents for the new isolation camp. The other officer did not come along at the time & I had to take the party out with only a plan to guide me. It afterwards turned out that this sketch was entirely wrong, so the mistake that occurred was not my fault. We marched on along the road indicated but failed to find the spot, & had recourse to asking where it was, being quite confidently directed further on, but when at 5 o’clock we landed at the machine gun camp at Camieres, I got the commandant to ring up Etaples & was told that the camp was not to be moved at all & to return. Half way back I was met by the Orderly Officer & directed to a totally different spot to that shown on my sketch. Hot tea was ready, & then there was just time to put up a few tents temporarily for the night before darkness fell. It was a cold spot between the railway line & the coast, just opposite to Paris Plage.\n\nTuesday 11 April 1916\n\nUp at 6 & at once got the men at work clearing the furze & scrub on the ground for the tents. They did splendid work with their short bill-hooks & spades. By breakfast time the rain had started & with short breaks it continued during the day, accompanied by strong cold winds. About 9 a message came to march the men back to camp, & in reply to a progress report & query that we returned, further word came telling us to stay. \n\nIn consequence I went back to H.Q. to find out what they really wanted. Got orders to proceed with the work & after considerable trouble was able to get further rations for the party. Meantime they & the 4 transport waggons that had arrived were standing by, but after some lunch we pushed on with the aligning & pitching in the rain, & were amazed abt. 4.30 pm to see our (1st Bde) battn. march in. Extra fatigues were at once got going & the tents pushed up so that by dark all hands were under shelter, most of them with floors to their tents. Had it not been for the twilight allowing us to work until 7 o’clock we should never have managed it.\n\nWednesday 12 April 1916\n\nAnother cold wintry day with wind & rain nearly all the time. In spite of the wet had the men clearing the furze & scrub, then aligned the tents & got them put up, this being a difficult job in the wind. About 10 o’clock the Victorian (2nd traing) Battn. came along. Hardly any of their tents were up & the men had to cram into our tents while my party pushed on with the erection of our own tents on our allotted ground. This meant that the men had to move all their gear (& themselves) in the heavy rain, & it was hardly to be wondered at that next morning out of the 170 men in my company 43 reported sick.\n\nDuring the afternoon Major Short (Camp Q.M.) collared me to set out the ground allotted to the","8":" Bn., & at this work I got soaked in the lower extremities, the cold rain driving clear thro’ the putties & running down into the boots. Was glad at 5 o’clock to knock off.\n\nAt night a rum ration was issued & hailed with delight by most of the men.\n","9":"\n\nA beautifully fine day after all the rain, but cold in the easterly wind. In all directions could be seen great-coats, rain-coats, boots, & clothing of all descriptions spread out to dry. Was very glad to get my saturated things dried.\n\nIn the morning the","10":" Battn. moved into the tents erected on the ground I laid out yesterday, & headquarters also came along. I had to get 4 marquees put up for them & was all day at this & similar work in the camp. Most of the men were on various fatigue duties, but a few companies had their men on parade during the afternoon.\n","11":"\n\nFirst time I have used this book, but am compelled to let the big diary go for the rime, hoping as occasions offer to try & write up impressions of France gained on our overland trip.\n\nStill in the isolation camp on the railway side between Etaples & Camieres. With the exception of one or two light but driving showers, a fine sunny day but quite unpleasant in the cold biting wind blowing in from the sea all day.\n\nAgain on battalion duties, detailed to beautify the camp. Erecting a rustic fence round officers’ quarters, making ground decorations with sea sand & shells round battalion orderly tent & Q.M.Stores &c. Numerous train-loads of artillery with their field guns passed during the day bound N.\n","12":"\n\nA dull grey day, cold in the wind. A full parade on the Training Ground was held in the morning but after we had been there a short time several of our companies were sent back because the heads were not ready for us. Reached camp just in time to escape a heavy storm during which some very light snow fell. \n\nUntil 3 in the afternoon busy at the fence, erecting marquee & similar work, & then with 3 other officers walked round the beach to Etaples where, after ½ hrs wait we caught the narrow gauge electric train out to Paris-Plage, a fashionable little watering place on the Channel, the train line taking us through a \"forest\" nearly all the way. Saw the \"Socotra\" in the process of being salved on the beach, the bow being quite apart from the remainder. \n\nLooked round the promenade, fashionable but deserted houses, bathing machines now idle, & streets full of officers, then had tea of ham & eggs, another walk round & train back, reaching camp abt. 9 o’clock in the moonlight.\n","13":"\n\nA bright sunny morning, overcast later & turning to rain at night. Parade at Training Ground in the morning, the officers going thro’ a short machine gun course while the men were taken in hand by Imperial instructors. Was given a huge admiration for the Lewis gun by the young officer in charge of our party. Back to camp for lunch & in the afternoon had to attend to a number of company crimes & other urgent matters which took up to tea time, after which Prescott & I went for a short stroll on the beach near the camp before settling down to letter-writing.\n","14":"\n\nA dull grey day with a light drizzle of rain in the morning & a heavy rainstorm in the evening. The wind was of course cold & biting. At the training ground during the morning until 1.30 & during the afternoon censoring letters & fixing up company matters, the men getting their first pay of 15 francs since they left Egypt. \n","15":"\n\nAnother wintry day with rain & wind. During the morning was at the Training Ground doing bayonet-fighting chiefly, & in the afternoon in the company lines.\n","16":"\n\nA cold & showery morning & as I was not feeling too good did not get up early. As orderly officer stayed in the lines instead of going out to the Training Ground. Not very much to do during the morning & stayed in tent most of time. In the afternoon went up to Ordnance with Prescott to get some clothing & on the way back called at Etaples for afternoon tea & going home we were caught in a very heavy storm of rain. Glad of a hot bath in a wash basin of water.\n","17":"\n\nVery heavy rain was falling at & before reveille, followed by a glorious burst of sunshine which put quite a fresh heart into one. Unfortunately it was merely a break & at 8.30 when we marched out to the Training Ground the sky was quite obscured & a little later the showers again commenced. During the morning was at a bombing class, followed by machine gun work. The afternoon was fine & was spent in company work followed by a short walk on the beach with Prescott; after tea practised bomb throwing with stones as long as the light lasted. More N.Z. artillery going up N during the day. The height of the Spring tide was very noticeable. \n","18":"\n\nA Good Friday in many respects vastly different to any yet spent. The morning was clear & still, the sunshine being glorious after the weather experienced recently. A special parade to a steam laundry in Etaples was arranged so as to enable the men to do their washing, but I got permission to remain & attend the Church Parade at 10 a.m. It was taken by an English C. of E. chaplain who spoke on \"Greater love hath no man…\". Between the hymns (led by the band) came the joyous songs of sky-larks, high up above us in strange contrast to the bang of bombs being used by bombing parties on the training ground on the sand dunes some little distance inland. Later on in the day this gave place to the far distant boom of heavy guns seemingly from out at sea. Most of the afternoon was taken up with company affairs. A mail in from Aust. bringing me 1 (W.E.C. No. 7). Drizzling again during the evening. Rumours of 500 000 Russians landing at Marseilles. \n","19":"\n\nIt was raining heavily when we woke, & steady rain continued right thro’ the day until sundown, making it a very miserable day. Some of the companies had to go out to the rifle range, but for the remainder parades were very rightly cancelled. Most of my time was taken up with censoring &c., & late in the afternoon I went into Etaples to buy some methylated spirits for my little stove. Amid many interruptions tried to get some letter-writing done after tea. \n","20":"\n\nA most glorious Easter Sunday, bright & clear, with hardly any wind but with plenty of joyful sky-lark songs. Went to the C. of E. Communion Service in the Y.M.C.A. tent at 7 & found abt. 70 present. At 8.45 the Presbyterian Parade was held, & the C. of E. at 9.30. As Divl. Orderly Officer had to take charge of both parades. Formen took Acts 17:32-34, & latter the exhortation to Christians to rise to things above, seeing that Christ is risen from the dead. \n\nIt was a most helpful service. Just afterwards saw a British battleplane passing overhead. During the morning a trainload of Belgians passed thro’ going N. Had to do the inspection rounds, turn out guard &c. but spent remainder of time writing. Visited by Leo’s friend Percy Limn, now one of the A.M.C. details.\n","21":"\n\nA fine day but not as clear & bright as yesterday. Had rather a troublesome night & abt. 10 o’c. set off to find a dentist & made an appt. with him (a Canadian Capt.) for 2 p.m. Went on into town with Prescott & the other officer who was with us (Moy) & stayed with them transacting business for our Officers’ Mess, & then had lunch there with Prescott, having sardines, boiled fowl & sauce, fried steak & potatoes, tinned apricots & tea for 3f. each. Had rather painful attention from the dentist who started to kill the nerves of a large back tooth, & then went out to Paris Plage to get some photos left there, coming straight back by the same train. Not equal to any dinner & glad to turn into bed. The blowing of \"Retreat\" altered to 7.15 p.m. showing how much the days are lengthening. \n","22":"\n\nA beautifully fine day. The usual training for all Aust. troops was cancelled to enable all to take part in an \"Anzac Anniversary\". The whole division marched up to a spot near Etaples: a gently sloping old cultivn. field ending in an abrupt embankment with pine trees growing on it on one side, the isolation ward being on the other, the field stretching back to the sky-line 300 yds. away. On the embankment a gay colouring contrasted with the dark green of the pines, red capes & grey dresses of the Austn. nurses, grey of the English some of whom had the neat white head-dress & VAD’s the red cross on the apron, brown of the Americans, the Canadian light blue dresses & navy capes with scarlet lining, making with the light blue uniforms & red ties of the convalescents & the kharkis of English officers a most gay picture. The other 3 sides of the square made up of troops. Fine memorial service by Senior Chaplain, address by Commandant, & the March Past. After lunch attending to company matters. Had a bathe in the little stream: it was fine. Mail in but none for me. \n","23":"\n\nAnother glorious Spring day, quite warm in the sun. Last night had a most exciting time on a\/c of a Zeppelin raid. Just after midnight was dimly conscious of 3 explosions followed by Prescott saying \"There are anti-aircraft guns!\" At once hopped outside into the starry night, several other officers also appearing. The distant hum of the engines could clearly be heard & there at an enormous altitude we could distinguish the cigar-shaped ship. It was fearfully uncanny to see it manoeuvre & come, at it seemed, exactly overhead, then a whiz of a descending bomb was verified by a tiny streak of light as it dropped, ending by a blaze of light when it landed. The alarm was sounded in Etaples, trains stopped, afterwards running thro’ in a bunch. We watched the airship disappear in the direction of England & then went to bed again.\n\nIn the morning we examined the hole where in the estuary abt. 300 yds. from us the incendiary bomb had struck. Another dropped at No. 26 Hospital & others elsewhere, but no serious damage was apparently done. Most of the morning was at the dentist’s, & in the afternoon company work, football & a swim (?) in the stream. A lot more mail in but only one (G.H.) for me. A French (?) aeroplane carrying lights patrolling the stretch from here to Boulogne during the night. \n","24":"\n\nA glorious day, distinctly warm in the sun. Went to the dentist in the morning, most of the time being taken up thus. Busy censoring &c. during the afternoon. An aeroplane marked with British symbol passed over at a great height following the same course as the one that came on Easter Monday : we suspected it as a German. In the evening, as Guest Evening of the mess we had 5 nurses from the American Hospital over & spent a most enjoyable evening. \n","25":"\n\nLeo’s birthday & a continuation of the glorious spring weather. The day was clear & fine, quite warm in the sun, & the evening really delightful. The sunset scene with the sandhills in the foreground between us & the estuary, & the very calm Channel with a fleet of sailing vessels fishing across the outside of the bar, the whole screened against a pretty evening sky, made one long to be able to paint. The twilight noticeably lengthening, it being fairly light until ¼ past 8.\n\nDuring the morning had the company out on the estuary flat doing work in anticipation of Sunday’s reinspection. An officers’ lecture & company matters occupied the afternoon. \n","26":"\n\nStill glorious weather, sunny & warm but with a rather strong wind from inland which raised a good deal of sand & dust. Went to the dentist & thence into Etaples on mess business in the morning & in the afternoon was kept going censoring letters & attending to matters. \n\nAt night had a joke on Prescott who had gone to Boulogne for the afternoon, fixing his bed up & turning the tent about as it stood.\n","27":"\n\nA beautiful day. Had to take the company out for re-inspection at the Training Ground, standing by them while they were being put through. They passed well. Did not get back until noon & then went down & had a good bath in the little stream. A church parade was held for those who remained in camp, but of course I missed it. In the afternoon got on with a little writing as far as numerous interruptions would allow. \n","28":"\n\nSame spring weather. At the dentist’s in the morning while the company was up on the range. Before lunch went down to the stream to have a bath & had the misfortune to cut my right toe on a piece of bottle. Got it fixed up by the doctor & then had to lie up, missing the May Day Sports held by the Canadians on the football ground on the other side of the line. Also missed the \"Society\" dinner held in Etaples. A heavy storm with drenching rain worked up about 8.30, the rain continuing most of the night.\n","29":"\n\nA dull grey day with intermittent showers. Did not get dressed but stayed in pyjamas censoring letters, reading &c. A foggy night, but I heard next morning that the instruments on Etaples hill had recorded the presence of a Zeppelin during the night. Alone & with a sore foot made my first attempt to smoke a cigarette before turning over to sleep.\n\nOutward mail for Australia.\n","30":"\n\nA fine day. Dressed & stayed in the tent, in the afternoon going across the railway line to watch a football match, Officers & NCOs V Men; the latter won by 9 to 6. It was a good game, the C.O. & Adjutant (Lt. Chaffey) of the 2nd Division coming down to watch it. Just as it got dark Prescott & Moy were called away by 2 sergts. who had noticed peculiar flashing of a light on the other side of the embankment about 20 yds. from Headquarters. It proceeded from a small hut facing the decollate sand dunes ¾ mile away, so the party rushed the place. The operator of the light at once took to his heels, but after a chase over the football ground & ploughed potato field was run to earth & brought back to H.Q. a prisoner. Of course nothing further was heard of him but it is almost certain that he would be dealt with as a German spy. This is the tale as told by Prescott & generally believed until the truth leaked out that the \"signal\" light came from the cottage. They made up the yarn to compensate for their disappointment.\n","31":"\n\nA dull day with occasional showers but little heavy rain. Stayed inside censoring letters &c. The camp was visited by Brig-General Carruthers & his A.A.G., special steps being taken to tidy up the place & have things looking well. At mess-time the band from the 3rd Battn. played outside, the music sounding lovely in the twilight. Visited by 2 of the American sisters in the evening.\n","32":"\n\nA beautifully fine day, quite warm in the sun. Stayed inside, the company going up to the laundry for a washing parade. Had a few shots with the revolver behind the camp in company with Prescott. Big Australian mail came along in the afternoon bringing 30 letters for me. The greatest treat since I enlisted.\n","33":"\n\nA fairly fine day, one or two light showers falling. Re-reading letters, censoring &c. during the morning & in the afternoon watched a football match,","34":" V 12\/2 resulting in my company being beaten by 6 to 3. In the evening went into Etaples with Prescott & several others to a little dinner. Coming home at 10 o’c we saw lights above the clouds in two places, in all probability Zeppelins. One appeared to be over Boulogne & the other S of Etaples. Later on in the night while lying awake I thought I heard one or two explosions. \n\nA \"Methodist\" (E.H.) & pair of socks (W.E.C.) had come to hand during my absence. \n\nSunday 7 May 1916\n\nA wet day with occasional bursts of sun. The Church Parades were all cancelled on a\/c of the rain. Stayed inside writing as well as interruptions would allow, getting very little done in reality.\n","35":"\n\nA cold windy day with driving rain at frequent intervals. Busy censoring letters & trying to get a few of my own written.\n","36":"\n\nA wintry day with a good deal of rain at intervals. As soon as breakfast was over had to go up to Etaples Old Camp to the Court Martial Hut to attend a court martial on one of my men. Was kept standing outside in the rain for over 3 hrs., & when the case was over went into Etaples with Lt. Moors for lunch at the \"Ioos\", a picturesque old inn with quite grotesque paintings on the wall, an abbe drinking liqueur & taking snuff, 2 Parisian ladies discussing latest fashions, a French officer thoughtfully taking his wine, & a heterogeneous assemblage of officers & N.C.O.s. On arrival at home found trouble from the sgts awaiting me.\n\nOutward mail for Australia.\n","37":"\n\nA beautifully bright clear day, the camp consequently being a busy scene with men drying clothes &c. Up at reveille & going hard during the day fixing up company matters with the exception of ¾ of an hour taken up at the dentist’s. A block in the railway traffic occurred in the early morning & it was very astonishing to see how the trains backed up. \n","38":"\n\nAgain a fine clear day. Got instructions that 60 of my men were to be told off to proceed to the front, & was kept very busy going thro’ the roll detailing the men & then getting them fully equipped. Missed mess at night thro’ having to inspect them to be sure that all was correct. \n","39":"\n\nA beautifully fine day following a dull grey morning. At 9 o’c there was a battalion parade at which the sentence of the Court Martial on my man (O’Hea) was read out, viz. 6 mths. hard labour. Then came a company parade & in the afternoon inspection of the draft of men to go onto the front. Was paraded & told by the Div. Adj. that I should be reqd to accompany the party as 2nd in command. Visited the dentist to try & get my tooth finished, but without success.\n","40":"\n\nA wet cold day. Was orderly officer for the battn. & kept going during the day, having the final equipping of the men to attend to as well. On the go until 11 o’clock getting my own pack &c. ready.\n\nSunday 14 May 1916\n\nAnother strange Sunday. Reveille at 2.30, my sergt. waking me quarter of an hour earlier. Heated some coffee & had bread & butter, jam & bully beef for breakfast. Fall in went at 3.30, & then on the parade ground we were kept waiting some time for the men from the 3rd Battn. Marched to the station with the band, hurried the men into the cattle trucks & off the train went thro’ Boulogne, Calais, northwards, thro’ St. Omen south-east, then east thro’ Hazebrouck to Steenwerck, the railhead W of Armentieres arriving there about 1 o’c.\n\nA delightfully pretty trip thro’ fertile low-lying country, the exquisite peacefulness of the scene at the villages being only broken by the distant crash of big guns at irregular intervals. Much of the country was traversed by waterways & canals & it was interesting to see the barges being towed or pushed along by poles. At the railhead we were met by an officer who guided us out over rough cobble roads covered with slush & muck to the H.Q. It was a most trying march & many of the men knocked up badly: did not feel too good myself with topboots on: toe pretty sore.\n\nFrom H.Q. took the party along one of the lanes & there issued the rations that had been brought, & at 7 o’c handed the drafts over to their battn. guides. Reported to H.Q. managed to dig up a cup of tea & then bed in an 11th Batt. billet. Heavy small gun firing & flares all along the salient abt. 3 to 5 miles distant from Sailly.\n","41":"\n\nA dull threatening day but fine towards dusk. Up early & had things ready for the return to camp. Breakfast in the billet with the 11th Bn. officers & then had to go to D.H.Q. to wait for Capt Hearder, seeing Lt. Lindsay Cunningham while waiting there. Free about noon & then hunted Leo up finding him at the house where Col. Shudeo dined, getting a surprise in also seeing there Major Matson a former lecturer in Vet. Sci. & Mr. Beaurepeare, Y.M.C.A. by whom I was invited to stay for lunch. An old home surrounded by nice garden bounded by a hawthorn hedge outside which were German entanglements, & a sand-bogged trench inside. In one corner 2 wooden crosses marking the graves of 2 R.E. English officers killed in action","42":" Stayed yarning to Leo in his attic until abt. 4 o’c, then had afternoon coffee together keeping a sharp look-out for Rid meantime. \n\nAt 5.30 left Sailly in HQ car & driven to the railhead at Steenwerck, noting 2 aeroplanes high up. Had to wait until 7.20 for our train from which we had to change into another one at Fontaine (?). A fairly cool journey, reaching Etaples at 2.10 a.m. & thence having to walk out to the camp with an almost full moon just setting in the west & the first light of dawn showing in the east. In bed soon after 3 a.m.\n","43":"\n\nVery tired during the day which was a perfect spring day, clear & still. Had breakfast in bed & then got up spending the day in attending to company affairs. A mail of 8 letters in from Australia, together with papers & a pair of socks from Father. \n","44":"\n\nA dull morning but a gloriously fine day, - absolutely perfect. A second draft of men, this time accompanied by 10 or 12 officers went up to the front.\n\nCompany parade in the morning broke into my letter writing for the outward Australian mail. In the afternoon went over to the trenches on the training ground for practice in the relief of trenches, getting back to camp about 7.30. A beautiful sunset. An aeroplane showing the Allies’ colours flew over the camps in the afternoon & caused some excitement by dropping 2 smoke bombs, possibly for practice purposes. \n\nOutward mail for Aust.\n","45":"\n\nA summer’s day, quite hot in the sun. In the early morning heard an English cuckoo for the first time. Company on fatigue so went to dentist in morning. On the go during the day at little things & at night again went over to the trenches, this time to carry on with night operations using blank ammun. Quite an interesting little piece of work which got us home abt. 10.30.\n\nMore Austn. letters in.\n","46":"\n\nAnother warm day but with much more breeze blowing. The company had a washing parade in the morning, the afternoon being devoted to a company parade. An exquisite sunset. \n","47":"\n\nA summer day, quite hot about midday. On the go as orderly officer but managed to get up to the dentist in the morning. Handed over the balance of the company in the afternoon to the other 2nd Battn. (12\/2nd) company. Col. Foote visited the camp & talked at considerable length to the officers about what to do at the front. At 6’oclock as we were about to go to dinner a new batch of abt. 1100 men came along from Marseilles. \n\nA further batch of Aust. letters arrived.\n","48":"\n\nA summer’s day, the heat being rather trying & the little stream near the camp was very well patronised by hundreds of the men bathing. \n\nChurch Parade in the morning was taken by the Presbyterian padre who preached on \"Hobab the Midianite\"; a very helpful service. Did some writing during the day & in the afternoon went up to the hospital & looked up a few of my old men. \n\nA glorious evening & warm night.\n","49":"\n\nHaving handed over the company was not attached for any particular duty but at little unimportant things when not taking things easy. A warm day with a light shower towards evening. After tea went to a concert given in the Munay Hut by an English party, & enjoyed it immensely. A detail of officers to proceed to the front came out just after tea, my name being included. Much excitement & bustle caused by it.\n","50":"\n\nA bright summer’s day. Busy getting things packed, going into Etaples to Ordnance & town to make some purchases in the morning. It happened to be market day & the town square presented a very busy scene with sellers of all kinds of wares displaying their goods in temporary booths & on wheelbarrows. Prescott purchased some strawberries at 1f. pr lb. : they looked fairly good but he said they had little flavour. \n","51":"\n\nDull, but no rain altho’ there was every indication of it. Up soon after 2 a.m., got sleeping bag &c. packed & had breakfast by 3.\n\nMoved out at 4 for the Etaples siding, entrained & left by 5 on a crowded troop train which went thro’ Boulogne to Calais, then E thro’ St. Omer to Hazebrouck which we reached at 10.30 & detrained. Luggage left in cloak room when word came that we were not to move on until 6.30 in the evening, & then we were free to wander thro’ the town at will : quite a typical French town of rather large size with cobble-stone roads having exactly similar verandah-less houses abutting the footpaths which were more or less busy with women & children passing up & down, but hardly any men. Numerous casualty clearing hospitals in the place, & a good deal of military activity. Fine old church. Bought & sent \"Fragments from France\" home. At 6.20 our train left for Steenwerck, & thence we had a 5 or 6 mile march out to Sailly, arriving abt. 9 o’c & going into temporary sleeping quarters in a school belonging to a shelled & ruined church. Found a place for a cup of coffee & bread & butter & then turned in : it was commencing to rain lightly. The flares along the front could quite clearly be made out. \n","52":"\n\nAwake early, got things packed & went along for breakfast to the butcher’s shop. At 9 o’c we went to Div. H.Q. & after a wait were spoken to by Maj. Gen. Walker, commanding the division. Thence to Brigade H.Q. & after that to our battalions. I was at once allotted to \"A\" Co. & on finding the O.C., Capt. Herrod, was very pleased : the other 3 officers, Lt. Hunter, Lt. Dewinton & Lt. Cullenward are also very nice fellows, the latter having a brother living in Mowbrary Rd. at \"Glenorkie\", a place he frequently visits. \n\nStayed with Capt. Herrod till lunch which we have in a cottage : one little tiled room is for the time allotted to me. The house where Leo was quartered last time I was here is only abt. 400 yds. away. Repacked the gear I brought in order to send part back again. Censoring letters in the afternoon. At tea word came that we were to supply a night fatigue & I was sent with one party to a spot some distance behind the lines where a set of trenches that were overgrown & therefore invisible had to be cleared & made visible to enemy aircraft. Had some of my old men in the party, & all worked splendidly, getting thro’ with the job much quicker than was expected. March home thro’ dark & drizzling rain to welcome bed.\n","53":"\n\nA bright clear day. Slept in & had breakfast in bed. Censoring letters & similar work during the day, the company being off parades on a\/c of the night work. Was innoculated for paratyphoid in the afternoon. In the evening was out with a fatigue party on the same work as last night, really completing the job : a clear star-light night for the work & good progress made enabling us to get home by abt. 11 o’c. \n","54":"\n\nA perfect day. Soon after breakfast Leo put in an appearance, looking well & fit : thought he had gone to London & was surprised to see him. He knew where Rid was billeted & together we walked out the couple of miles thro’ glorious country. Cereal crops from a foot to two feet high & beautifully green : potatoes strong & healthy, the rows being hilled at the time : beans in rows 10\" apart just thro’ : peas in full bloom, having a general white colour : marigolds 6\" high & just thinned out : clover 15\" to 18\" high & in bloom. All these crops looked their best. Peaceful farm-houses nestling among poplars, elms or beeches broke into the landscape here & there, the green hawthorn hedges picking out the roads leading to or past them. Found Rid at home & after a minute we all walked home to Sailly together, Rid wheeling a bike on which to ride home. In the afternoon censoring letters – then had to bike down to a spot where the night’s fatigue was to be done. After tea marched down there & kept the party busy clearing trenches until 1 a.m., reaching home an hour later just as dawn was lighting up the east. \n","55":"\n\nAgain a perfect day. Slept until 9.30 & then had to take the reinforcements to an inspection by Bgdr. Gen. Smyth, who did not show up. Leo came along for awhile in the morning bringing a home letter that had just arrived. After lunch wrote one or two letters & had just lain down & dropped off when Rid came in. Had a great old yarn. He stopped for tea, which we had early on a\/c of Capt. Herrod leaving for London, & then as the night fatigue was cancelled at the last minute, walked out home with Rid, arriving just in time for his 6 o’c service. On a\/c of the brigade being on the point of departure for the front line, very few men were available for the service, but I enjoyed it immensely. A calm, perfect evening with a cloudless sky. Rich pasture thickly bespattered with daisies & buttercups growing under the big old pear & cherry trees. Cattle lazily browsing in an adjacent field. Rid seated at his baby organ in front of ½ a doz. of us sitting on the grass. \n\nIn contrast to it all a captive obsern. balloon high up to the E & presently an aeroplane flying over the lines : later quite a heavy bombardment was opened on it. Had a great little service & then walked along to another billet, but no service was possible, so together we walked home, Rid returning on his bike. \n","56":"\n\nA rather dull day. In the morning had to take a fatigue party out to the Bombing School to work on a set of practice trenches that are being prepared. Got in soon after 1 o’c. & in the afternoon had to turn up for an inspection parade of the company. \n\nA good deal of firing at aircraft during the day. On a\/c of having an early morning fatigue the next day had no night fatigue & was glad to be able to turn in. \n","57":"\n\nA dreary wet morning fining up about midday & giving place to a most glorious afternoon. Was up at 4.30, had a snack & then moved out with a fatigue party to the Bombing School : worked at the trenches there until after 8, & then as the steady rain continued, we came back to billets. Changed wet things, had breakfast & was about to snatch 40 winks when the Adjutant came round & stayed chatting for some time. \n\nIn the afternoon walked over to the town of Estaires to buy a watch in place of mine which I got Lt. Hunter to take over to London for attention. A nice evening walk which I thoroughly enjoyed, taking abt. ½ an hour each way. A good deal of aerial activity, the bursting shrapnel looking very pretty. At dark quite a heavy artillery bombardment was started & our artillery retaliated. We all had to stand to arms for a while in anticip. of an attack, but soon after 10 o’c. everything became quiet & we were allowed to stand down. \n","58":"\n\nA gloriously fine day. All the morning was kept over a minor court martial case at which my part actually took abt. 3 minutes. In the afternoon had a parade to take, & coming back from it I found Leo waiting to see me. While we were talking who should walk in but Jocelyn & Arnold Hazlewood. It was a lovely surprise. We went down town to have tea together but Leo had to get back to his work so that the three of us had to make the best of a snack in a little French eating house, & after it had a great old yarn.\n","59":"\n\nA glorious day again. Had to take a fatigue party out in the morning & so missed a big brigade parade & inspection by Mr. Hughes & Mr. Fisher, other heads as Gen. Birdwood also being present. From what I heard I did not miss much. The day was evidently a very special one with the French, a number of girls in pure white throughout & boys with white bands & rosettes being seen everywhere, & the people in their best clothes. Got back from fatigue before lunch & went up to the divisional baths where I had a lovely hot bath followed by a cold shower. Great aerial activity on our part while the inspection was on. \n\nBusy censoring letters &c. during the afternoon & evening. Very heavy bombardment away to the SSW towards St. Eloi(?)\n","60":"\n\nA lovely day. In the morning had a parade of the company, the CO coming round to inspect them. It was the first opportunity I had had of speaking to the Colonel & I thought he was fine : one could speak quite freely to him. In the afternoon as we were about to sit down to lunch word came that the company had to go out at once to take part in a little tactical scheme. This took us out to Estaires & thence along the River Lys as far as Bac St. Maur & back to Sailly. My party on the river bank had the best position of the 3, & I quite enjoyed the march altho’ it was nearly 5.30 by the time we reached home. \n\nFound that Rid & Leo had been in to see me, & later the former called in again & I was able to give him a cup of tea before he left on his bike ride back to H.Q. It was good to see him again.\n","61":"\n\nA rather duller day with a steady NW wind. In the morning had to take the reinforcements who had recently joined up along to the gas school at Nouveau Monde, abt. 1 ½ mls. away. The school is held in a most beautiful residence where it is stated the Crown Prince was billeted when the Germans held this part. A large house beautifully appointed & furnished & surrounded by delightful gardens & shrubberies kept in perfect order. The beeches, elms, poplars, acacias (in bloom) & conifers looked their best, & in the beds were good roses (Earl of Dufferin) in bloom, pansies, geraniums, lupins &c. In the vegetable patch were peas, beans, carrots, tomatoes, lettuce, globe artichoke, onions &c., with several rows of sturdy strawberries on which the fruit was just turning colour. Altogether a lovely home. \n\nHad to take the party down to the river bank where they were put thro’ gas, & on reaching home found that Capt. Cotton (2nd in command) had returned from London leave. The company was on fatigue in the afternoon & after tea Lt. Cullenward left on leave to London. Had a \"Society\" gathering & tea together in Sailly, getting home abt. 9 o’c.\n","62":"\n\nA fine morning but a very light drizzle in the afternoon. After breakfast had to take the company to the divl. laundry to have their helmets inspected, getting back in time to fall in for Church Parade at 11 o’c. in the Sailly hall. It seemed strange to have men in battle order for a church parade : padre was 20 min. late turning up & then it was a most formal service without any sermon or address : there was something in the united singing &c. however, & I was glad of the opportunity of attending. Soon after lunch Rid came in for a short time after having held 2 or 3 very successful services : as usual was so glad of a yarn. A small mail came in from Aust. just as he arrived. Soon after he had gone Leo put in an appearance & together we set out to go & hear Gipsy Smith who was down to speak in the Sailly hall : however met 2 officers en route & by the time we reached the hall the meeting was over. \n\nHowever I met Gipsy Smith & shook hands with him. Writing letters during the evening.\n","63":"\n\nA dull morning, leading to a very changeable showery day, though in all but little rain fell. There was a high wind & no aeroplanes were visible during the day. As soon as breakfast was over got my gear packed up & reported out to the Bomb School, ½ mile or so out of Sailly. Left the gear there & then went back to the old billet for lunch, & there being nothing to do during the afternoon went round to Leo & with him walked out to Fleurbaix where Rid was stationed. On the way out passed numerous billets that had been shelled, there being plenty of shell-holes & other evidences of Hun attention all along the road. The people were working in their fields just as if no war was going on. \n\nFound Rid after abt. a 4 mile walk & in the same building, acting adjutant to the 2nd Brigade was Lt. Lindsey Cunningham. He remembered Leo & me at once : after a cup of tea Rid took us round to one or two of the gun-pits but there was no firing going on. It was, however, very interesting to see the 18 pounders & howitzers & to see the shell holes made all round one of the batteries in a vain attempt by the Germans to get our guns. Walked home & after tea reported out at the Bomb School to sleep.\n","64":"\n\nRaining steadily when we woke, & it kept on pretty continuously during the day. Parade from 7 to 8 was changed into lectures indoors. There are abt. 40 attending the school, of whom 5 are officers : did not know the others previously but we soon got to know each other. During the forenoon it was too wet to do anything outside, so the time was spent at lectures. There was a break in the afternoon & we went out for our first lesson in throwing bombs by hand, an hour at this & an hour at further lectures. Quite a strong cold wind blowing & no sign of aerial reconnaissance during the day. A cold night, altogether quite a windy snap. The people at the farm house here were busy emptying the drainage tank from the stable & cow stalls to water over the fields, & the smell was awful.\n","65":"\n\nFine again, but a good deal of wind, dying down in the afternoon when the aeroplanes again appeared. Physical drill in early morning & lectures & throwing during the day. Much excitement over the news of the loss of Lord Kitchener. After tea started to walk into Sailly to hear Gipsy Smith when I met Leo coming out to meet me. Together we went to the village hall to find that the meeting had started with the singing of hymns, a good crowd of men being present. A solo \"He died of a broken heart\" was sung by one of the men & was the basis of the talk given, very straight & good & well received. From the start he got the attention of the men & held them right through. The whole meeting was a treat. Afterwards we walked out towards home together, the view with the sun just setting at 10 past 8 being glorious. One little peep of 2 men hoeing in a field & a church spire standing out on the horizon against the setting sun, reminding us both of Oll’s pictures of \"The Angelus\", was very lovely & the whole sunset glorious. \n","66":"\n\nA lovely day. Bayonet fighting before breakfast & use of bombs at the morning & afternoon parades. In between times got 2 or 3 letters off. School visited by the Premier of Q’nsland, General Birdwood & others. We did not see them but heard afterwards that during an exhibition with trench mortars there was very nearly an accident with serious results.\n","67":"\n\nWet last night but a nice day followed it : storm clouds worked up once or twice but practically no rain fell. Bayonet work before breakfast & a continuation of the course during the day. In the afternoon when the work was done I walked up to the Div. baths & much enjoyed a thorough clean up. It was a glorious evening & the ½ hr’s. walk was most enjoyable. After tea I went in to Sailly to get instructions about joining up with the company at the completion of the school, & stayed at the old billet for some time chatting to Capt Herrod & the other officers. A very interesting bombardment of an enemy aeroplane in which our guns must have fired over 200 shells was clearly on view as I walked out. A most lovely sunset going on all the home. \n","68":"\n\nStorm clouds during the morning, but a fine day, the afternoon being specially good. Work of the school continued, live grenades & bombs being used & found very interesting. At 4 o’clock Leo came over bringing a mail that he had just received, including home letters dated 17th April which were most enjoyable : my own have probably gone down to the base so I may not receive them until after coming out of the trenches. \n","69":"\n\nThundery with one or two sharp showers, but sunny for the rest of the time. Heavy rain during the night making the place very sticky & muddy under-foot. The work of the school was continued, no difference being made for the Sabbath. Use of live bombs & grenades the main work. Leo came over for a short time in the afternoon & I was glad to have a yarn. £5 handed to him for safe keeping during my visit to the front line.\n","70":"\n\nA wintry day with no sunshine & drizzling rain most of the time. No early morning parade but at ¼ to 9 the exams in the ground covered during the school were commenced. Nothing very difficult in them & got a \"Very Good\". The squads of men were not completed until nearly 3 o’clock when we fell in & moved off to the firing line near Fleurbaix. It was drizzling as we marched out & the slush & mud on the cobble-stone roads made marching heavy & difficult. Met Capt. W. Hindmarsh (Vet. Sci.) en route. At Fleurbaix picked up a guide from Bge. H.Q. & was taken thro’ the shell zone to the start of the communication trench, & here again the walking on the slippery wet duckboards was very heavy & difficult. At one spot we were stopped by an artillery observer because the enemy were shelling the commun’n. trench further along. It was abt. a mile over the duckboards & then we suddenly came upon the front-line breastworks arriving abt. 6.30. After tea went out into Noman’s Land for a little way, but awfully wet & muddy. Raiding party meant a bombardment & standing to. Received Aust. mail. \n","71":" 1916\n\nAt midnight all had to stand to & soon after the artillery started to breach the enemy parapet. Raiders went out & we afterwards heard that they took 6 prisoners & a machine gun & only had 2 of their men wounded. Our trenches were shelled & I did not enjoy my first taste of it, altho’ we received no casualties. Was on was from \"Stand down\" (3 a.m.) until 7, & after breakfast tried with but little success to get some sleep. \n\nOn in the afternoon until 9 p.m. & then turned in until \"Stand to\" at 2 a.m. Capt. Cotton away in Sailly : Lt. Hunter killed by sniper abt. 4 a.m. A most miserable wet day with short breaks only when rain was not falling : worse than ever underfoot. Very little artillery \"straffing\" during the day, a few shrapnel shells only being burst over our communication & some St.E.s used in searching for a concealed gun behind us. \n","72":"\n\nSteady rain during the night & in the early morning, conditions underfoot being execrable. \n\nLt. Cullenward returned from leave. An extremely quiet day, very little firing taking place on either side. A fair NE wind in the afternoon together with a little sunshine dried things up considerably & by evening it was fairly pleasant, though cold. Visited by Lt. Newth & Lt. Moy during the day, & also by Arnold Hazlewood who came along from B Co to have a yarn. \n","73":"\n\nNot on duty during the night & so had a really good sleep from 10 p.m. until 3 a.m. things being very quiet right through. In accordance with the daylight saving scheme the time was put forward to 12 midnight at 11 p.m. The day turned out to be very dull only a slight drizzle of rain falling. Trotting round & doing odd little hobs, having an hour’s sleep as well. The wind was very cold from the NW & the day altogether quite wintry. \n\nIn the afternoon Rid came along about 4 o’clock & stayed for a couple of hours. He had rather a nasty cough but promised to get some stuff for it next day. It was quite a treat to see him. \n","74":"\n\nThe night was quiet except that in the early part we sent out a patrol under Mr . Taylor (14\/2nd) but unfortunately Fritz was expecting them & very effectively bombed the party, 6 out of the 8 having more or less serious wounds, Mr. Taylor being amongst the injured. It was a most weird scene as, with occasional machine gun & rifle-fire going on, the stretchers were placed on the truck & sent back. Only at the last minute did Mr. Taylor take my place on the patrol. The day was fine with a fair drying NW wind blowing which dried the place up wonderfully. It was lovely to see the sun again. On the go during the day but nothing more strenuous than the exploration of some old trenches leading back to our reserve trenches. Very little \"straffing\" done, everything being extremely quiet. \n","75":"\n\nA quiet night at our part but heavy bombardment on left followed by a gas attack as a result of which we had to get up & be ready with our helmets. It turned out to be a gloriously fine day & the aerial activity was great, squadrillas of our machines scouting round & being most heavily peppered by the enemy. One air encounter took place over the German lines opposite to us & was most exciting, the machines being wonderfully handled : it looked as if one Taube was forced to descend. The ground very quickly dried up & then the sunshine & warmth were taken full advantage off, I myself having a bath in my half kerosene tin of water. A little straffing in the afternoon resulting in 5 casualties from their trench mortars. \n","76":"\n\nMy first Sunday under fire. The night was cold with a very faint drizzle of rain from time to time. Very quiet here tho’ a gas attack was launched some distance away. The morning was dull. Before breakfast I had my first view of \"Fritz\" : was studying a portion of his breastwork with periscope & glasses when head & shoulders of one popped up & stayed there for some seconds. The afternoon turned out to be a beautiful one but some artillery \"straffing\" disturbed its calm very considerably altho’ the company had no casualties. \n","77":"\n\nA fine day & again very quiet. Some \"straffing\" with trench mortars & artillery during the day but some little distance from us. Last night was again very cold & disturbed by a pretty severe little bombardment fairly close to us : it was reported, too, that gas had again been used. The day was a decidedly cold one. \n","78":"\n\nA quiet night followed by a nice fine day. Very little doing along the line.\n","79":"\n\nA good deal of \"straffing\" with artillery during the night. A beautiful day & fairly quiet. In the morning I happened to catch sight of a small working party of Germans our side of their parapet & got the trench mortars on to them. There was a pretty violent cannonade during the afternoon on our right. Capt. Herrod’s birthday, & Father Macaullife came to lunch. In the evening there was a very pretty sight, four of our battle planes sailing over us on their journey home : at the time there were no less than 9 planes up, 7 of ours & 2 of theirs.\n","80":"\n\nA simply glorious day, clear & sunny with a slight breeze from the enemy lines. In the early morning an enemy \"plane\" flew very low over our lines but made off on the approach of one of our machines. The morning was very quiet but in the afternoon a fairly heavy artillery duel took place. After it had died away the scene was so lovely & so still that it was well-nigh impossible to imagine that the war was really going on. Enjoyed an open-air bath in my half biscuit tin. Aust’n. mail of 30 Apl. received.\n","81":"\n\nA clear starlight night but with a fairly heavy bombardment a little further along the line & a double gas alarm that came to nothing, got but little sleep. Quiet during the morning but in the afternoon a good old artillery straff opened up, being cut somewhat short by a very heavy thunderstorm accompanied by hail & torrents of rain which made the place a quagmire. A most unpleasant task doing duty over the slippery duckboards in the dark. \n","82":"\n\nAn artillery straff in the night which was misty & awfully wet underfoot. The morning was fairly clear but more rain fell later, then giving place to a bright sunny day. Everything underfoot was still fearfully wet & slushy. About 3 o’c. in the afternoon a heavy bombardment, the severest we had during our term in the trenches, was opened up on the company next to us, & just as it was past its climax Rid & Leo came along. They got thro’ safely was I felt a little sorry that they had come because the bombardment was so heavy that I was afraid it might develop into a serious attack. They left as soon as the shelling ceased, the evening then being beautifully calm & peaceful. At night the 4th Bn. relieved us & we went back into \"close supports\". It was an anxious walk back thro’ the communication trenches, but all went well & we were in our quarters by 12.30. \n","83":"\n\nNow quartered in a little weatherboard hut built at the back of an old farmhouse which serves as a billet for the men. It has not received much attention from Fritz so far but sooner or later will almost certainly be reduced to ruins as have the other houses hereabouts. Great care has to be exercised constantly lest men moving about be seen by the enemy. The company is stationed at 3 such places not very far apart but there is a good deal of trotting about from place to place. A bright sunny morning but the ground was still very wet underfoot. In the afternoon while having a rest we were rudely interrupted by Fritz sending a number of shells over at an observation station immediately opposite our billet. Fortunately he spent some time over his sighting shots & thus gave us an opportunity to duck out into the trenches close by whence we watched his bombardment, shells landing all round the place. After tea went with Capt. Cotton down the route that we shall have to follow in the event of an attack. It was a perfect evening & a lovely walk with the exception of the parts taking us over duckboards in the trenches. Fairly quiet night later broken by a heavy bombardment from our side. \n","84":"\n\nA fine day but towards evening very heavy rain set in. Fairly quiet during the morning but livelier in the afternoon when Fritz again opened up on the observation post opposite our billet, landing some shells very close to us & forcing us again to take to the trenches. In the afternoon had to go up to H.Q. at Fleurbaix for a gas lecture. Saw Rid as we were passing his H.Q. but found he was out when I called in on the return journey. At Fleurbaix met 2 old Uni. men, Capt (AMC) Roy Winn & Capt. Barton. A heavy bombardment during the night.\n","85":"\n\nVery wet & miserable day making everything underfoot in a fearful state. Not much other than censoring & writing a few letters during the day, excepting when Fritz started to shell the place just opposite, landing shells all round our place & making us get out into the shelter trenches in a violent hurry. A very quiet night.\n\nWednesday 28 June 1916\n\nStill showery in the morning. In the strafe of yesterday evening the brother of Major Watson who came over as a private in the 14th of the","86":" was killed. I wished to attend his funeral & to find out particulars had to ride up to Sailly on a bike to see Major Watson, by no means a pleasant ride in the rain & over slushy rough roads. Came back to supports for lunch & at 4.30 had to ride up again to Sailly cemetry, but owing to an alteration in the time just missed the service. Rested for a while & then bought some lovely strawberries to bring back to the mess & en route called in to see Leo for a minute or two & reached home at 7 p.m. About midnight 2 very severe bombardments in front of us. \n","87":"\n\nFine again & by evening once again possible to walk about in comfort. About midday Fritz again shelled all round our billet, putting over 57 shells of which 20 were \"duds\", one of which landed safely on the parapet without exploding. Very little damage done again. When examining the place later we found one of the shells which had lodged on the top of the parapet & failed to explode. It was a 4.2, painted blue with a yellow band near the nose. During the night heavy firing again kept us awake for awhile, combined with a gas alarm which came to nothing.\n","88":"\n\nJust before daybreak heavy firing away on our right indicated an attack launched by the British but with what success we could not discover. A cold windy morning with occasional driving showers, but clear in the afternoon & ground drying up quickly. Censoring & writing letters all available time. Aust. mail of","89":" arrived. In the evening there was a flight of no less than 18 of our aeroplanes which appeared to have been out on a raiding expedition. The sky was absolutely speckled with the bursts of shrapnel, more than 1000 shots being fired in one sector. The night was expected to be very lively but turned out to be exceptionally quiet.\n","90":"\n\nA glorious day, clear & sunny so that the ground dried up well. Had another very quiet day & got together some field flowers to press & send home. In the evening was another great flight of planes, 14 being up at one time, & a scrap between 2 of Fritz’s & some of ours enlivened proceedings, terminating quickly in the Germans descending & disappearing. The control that the airmen have over their machines is marvellous. \n\nAs soon as it became dark a relief from one of the other companies came along & took over, enabling us to march back another mile or so to a large billet on the main road, still well within shell fire. Here we are able to sleep in our pyjamas, a very great treat after the last 2 or 3 weeks when we have had to be in our clothes - & boots & putties – all the time. Settled in bed soon after midnight. \n","91":"\n\nSlept until nearly 9 o’clock & did enjoy it. The day turned out to be beautifully fine with a fair breeze blowing. Remained quietly inside & got a little mail written, but found that the sitting yarning hindered me a good deal & really very little writing was done. A beautiful peaceful evening & lovely sunset. Very quiet night.\n","92":"\n\nRather dull in the morning but a lovely day, inclined to be warm. In the morning walked up to the Divisional Baths & enjoyed a good steaming in a hot bath followed by a cold shower & change of underclothing. This system is undoubtedly a splendid one & gives the men who come out of the line one of the greatest possible treats. \n\nGot word that we were to move back at night & had to get gear together in the afternoon & then tried to get a little sleep. An officer from the relieving battalions came along & a good deal of time was taken with him. The company taking over moved in after dark & about 11 o’clock we started to march out : just as the advance party was moving thro’ the village several shrapnel shells were sent over, but no damage done to our company. There was some drizzling rain as we marched up past Sailly to our new billet, a pretty stiff march for us, out of practice as we were. We were by no means sorry to get in by about 3 o’clock.\n","93":"\n\nAble to sleep in & were heartily glad of the lie-in. The morning was fine but soon after lunch the rain set in & continued till dark. The new bullets are much the same as the others, perhaps quieter in the way of being away from any village & amongst the fields – close to where Rid was camped when I first visited him while his Bgde. was resting. There are fine large cherry trees just now loaded with lovely fruit : the pears & apples are very tiny still. The crops of wheat, oats, potatoes, marigolds &c. have come on splendidly, the oats looking specially well. The clover in many cases has been cut & the little circular ricks with their thatch caps look quite unique. Meadow hay is being made too, & the force of the familiar saying came home to one when one considered the weather being experienced at present. There was a gramophone at the billet so that we had quite a good time. In the afternoon we had an officers’ meeting at Bn. H.Q. which took some time. \n","94":"\n\nA lovely fine day. Plenty of cherries were supplied to us during the day & we had a really good \"feed\". Parades were held in the morning & afternoon, the first since the company went into the line, so that the men were pretty rusty. Good progress was, however, made. \n","95":"\n\nA fine day with a slight drizzle of rain towards evening. Was up at 5.30 for physical drill, & parades were also held in the morning & afternoon. Halfway thro’ morning parade had to take a party of men to the Divl. Baths, a fair walk & a rather warm one. Unfortunately was not able to have a bath myself, the division that has taken over the baths not having completed their arrangements. \n","96":"\n\nA dull morning which about midday worked up to a fairly heavy fall of rain which continued at intervals during the afternoon. In the morning took the company bombers to the Bomb School for practice throwing, & in the afternoon was on ordinary parade. The evening was specially beautiful, gorgeous sunset & peaceful surroundings being very noticeable. \n\nAppt. as Brigade Gas Officer in orders.\n","97":"\n\nA rather threatening morning turning into a lovely summer day, distinctly warm in the afternoon. In the morning reported to Bn. H.Q. re my new appointment, & in the afternoon had a company inspection by the Colonel. Austn. mail up to 15 May received at afternoon teatime & specially good. Rode round to Sailly to see whether Leo was still there, word having come thro’ that we were to move in the morning. It was a lovely ride, but found that Leo had moved some days previously. Busy in the evening arranging details for move : a particularly lovely sunset. Shaved in order to save time in the morning, & as far as possible got my gear together.\n","98":"\n\nAnother Sunday very unlike a Sabbath. There have been very many such since I joined the A.I.F. Was up at 4 o’clock getting the men out & having the place cleaned up : breakfast at ¼ to 7 in order to get the mess utensils away & fell in at 9 o’clock, moving off at 9.30. It turned out to be a most beautiful morning & day, & had we not been so heavily loaded up would have had a most delightful march from our billets outside Sailly in a general northerly direction to billets outside Oudesteen. We had the band, & of course as \"A\" Co. marched in front of the other companies we got the full benefit of the music which helped the march wonderfully. The roads lead through fields in which lovely crops of oats & wheat were nearing maturity, looking very pretty with the scarlet poppies & yellow mustard scattered through them. \n\nNearing the railway line we came to a field of hops in which the vines had reached the tops of their wires, & thence onward this crop was not uncommon. Passed a number of people returning from church. Reached our destination beyond Oudesteen about midday but had to bivouac in a field until the battalion in occupation moved out. Rested during the afternoon. At night slept between sheets, a most delicious sensation. Most hospitable people at the farm.\n","99":"\n\nA short early morning parade was held but I did not get up for it. The day was again gloriously bright & fine, although some threatening clouds worked up about midday. At the morning parade a short route march was carried out after an inspection, & again I was impressed by the splendid crops of hops, potatoes, wheat, oats, marigolds, & rye, was scarcely a man to be seen anywhere. The women & old men are doing magnificent work. A very short parade to let the men know what was anticipated was held in the afternoon & they were then free to rest. Fell in at 9 o’clock in the evening & marched out at 9.30 for Bailleul. The moon was abt. ½ full & the night clear & starry with a cool fresh breeze. A Taube dropped several bombs as we were en route but they were some distance from us & did not affect our march at all although we could clearly hear her. The latter part of the march thro’ the cobble streets of Bailleul was far from pleasant & we were glad at 11.30 when we reached the station & entrained. Train left at midnight, & tho’ I was very comfortable in a carriage with 3 other officers the men were tightly packed in covered trucks.\n","100":"\n\nA very pleasant night & I got a very fair sleep missing most of the scenery. At 6 o’clock started to take an interest in things & found that we were passing thro’ fairly undulating country in which the cultivated fields alternated with wooded uplands. The poppies & field flowers looked very bright & gay. Passed through Doullens & about 7 detrained at Feinvilliers-Chandas, & after waiting for the transportn. to be ready, started to move out thro’ the township & past fields most gaily coloured with poppies, cornflowers, mustard, \"pin-cushions\" &c. Crops of crimson clover were quite common & looked splendid. \n\nThe undulating country thro’ which the road passed was a change to the extremely level plains we had become accustomed to further north, & some very pretty peeps of villages nesting in hollows with hills sloping down to them on all sides, or in a densely wooded valley along which a little stream found its way were had. \n\nStopped at 9 for breakfast, & soon after midday reached our destination, Domart. The billets were very poor & took a lot of fixing up for the men : we were fairly comfortable, & in the afternoon I had a lovely bath in a washbasin. Turned in early & had a great sleep. Leo came in for a few minutes as we were about to have tea. Nelson Slee joined up. \n","101":"\n\nUp fairly early & got all the gear packed up & ready for the transport & after breakfast had the usual rush round to get the billets cleaned up. The battalion moved off at 9 o’clock the day being a fine one for the march, a cool breeze & an overcast sky being appreciated. The route lay along the bottom of the valley in which Domart is situated, a fine clear streamlet flowing along the bottom & in one place providing the power for a flour mill on the outskirts of a little village further on. Beyond this the road led over the railway line, through a small forest of very tall trees (poplars, beeches & elms) at which point Leo buzzed past on the front seat of a motor car, & then commenced to wind round the opposite hillside, climbing to the top through fields of crimson clover in full bloom, wheat & oats with the delightful intermingling of field flowers as poppies, cornflowers, mustard &c. Crops much poorer. Charming view looking back along the valley to where Domart nestled amongst the trees. After a final stiff pull of an hour & 40 min. without a spell, arrived at Vignacourt about midday & then had to chase round after billets. A big straggling town. Billetted in a billiard-room. Took things easy during the afternoon. \n","102":"\n\nHeavy shower about 7 o’clock in the morning & once or twice during the day we had light drizzles, but not enough to check the march. Nothing much doing in the morning, & after a very early lunch had to get all gear ready for a move at 12, subsequently altered to 1.30. Moved in a general SE direction over undulating country which gave beautiful peeps of landscape, through the usual fields & villages. Cuttings showed that the surface formation was chalk, & this on the roads, worked up into a fine dust, made marching somewhat unpleasant. Altogether it was a stiff march & I felt about done at the end. The men stood it well but a number of them knocked up, & for the first time during this series of marches, men fell out from \"A\"Coy. Reached Allonville about 6 o’clock to find it about full of troops belonging to our brigade, & soon settled down in our billets, this time ours being in a small room belonging to the village blacksmith : the boys were in barns & sheds & were comfortable. There are not very many shops in the place & what there are were besieged by men vainly trying to purchase goods, the small stocks carried being very rapidly depleted. Glad to turn into my sleeping-bag early & slept well.\n","103":"\n\nA showery morning but a fine, if grey, afternoon. No early morning parade but one was held in the morning & another in the afternoon, both being short & taken easily. Everyone was prepared for a move at short notice but was glad it did not come as the spell was much needed. The good news of progress in our push has put everyone in good spirits & I am sure that our boys will do splendidly when their turn comes. In the afternoon parade we went for a short route march along a country road leading through the usual pretty fields on one side & a high brick wall enclosing an unkempt copse on the other : the fir trees especially looked well. After parade the men were paid & soon commenced to make things a little lively. Turned in early again. The village is quite close to a big aerodrome & machines of various descriptions were to be seen at all hours & at all altitudes, frequently flying very low & making a great row.\n","104":"\n\nA grey morning but a perfect afternoon. After breakfast reported to Brigade Major for gas duties & was at brigade all the morning wading through literature to find out what is required, while the company went for a route march. Not much doing in the afternoon, the O.C. keeping the men together & giving them a talk about the probable developments & what will be expected of them. Lieut. Cullenward went into hospital. A visitor in the person of Pte. Nicol Graham, 3rd Bn. of Chatswood came to see me during the afternoon.\n\nAustn. mail received.\n","105":"\n\nAnother broken Sabbath as seems quite customary in the battn. After breakfast everything had to be packed up & abt. 10.30 the battn. moved out in a general NE direction. The day was fine & fairly warm & the amount of traffic passing along the road we traversed meant that there was plenty of dust flying. The country passed thro’ was very similar to what we have gone through the last few days. It was not very long before we once more came within sound of gun fire, but fairly distant. Several villages were passed through, our destination being Warloy-Baillen, at present a big hospital clearing centre, & a medium sized village. The main road at almost all times of the day is a busy scene with the lines of transport passing outward to the Front. A large number of troops are quartered here. Our own billet is a single room belonging to an old couple who have a nice garden in which the currants are just ripe : we frequently buy a couple of pounds. \n","106":"\n\nA grey morning giving place to a showery afternoon. Running round in the morning looking after bombers, & trying to see about gas work, & then started out on a route march over very slushy roads for a short distance, having to turn back & form up on a battalion parade at which court-martial verdicts were announced. Had a hurried lunch & then had to take a party to divisional baths some distance away where the men were able to have a cold bath : unfortunately they were not able to get a change of clothing. A shower as we marched home wet a men a bit. After tea attended a lecture at Bn. H.Q. Awakened abt. midnight by messenger with word to have things packed up & ready to move at 6 a.m.\n","107":"\n\nAnother dull day with drizzling rain at times. Up at 4.30 getting men out & my gear packed : early breakfast & then a long wait until 11 o’clock when we went for a short march : roads fearfully slushy. In the afternoon company parade, & after it had a practice in the use of the Lewis Gun. At night, lecture at Bn. H.Q. terminating in a discussion about the coming attack, particulars of which were given as far as was possible. Very glad of a couple of home letters which were waiting for me. \n","108":"\n\nA clear day, inclined to be muggy after the rain, & hot in the afternoon. Expecting orders all day & so more or less on the qui vive. Just before lunch was delighted to see Rid coming along : he had come into Warloy from his camp in the Vadencourt wood in order to buy some things for their mess, & had been directed to my billet by DeWinton. From Rid learned that Leo was close by & well. Much enjoyed the yarn with Rid. About 4.15 in the afternoon we got word to move out at 4 & after a big scramble got under way, having a tremendous rush to catch up with the rest of the Bn. Halted outside Albert, close to a battery of 9.2 guns, for a spell for tea & then marched through the town with its famous leaning image on the church again halting on the far side on Tara Hill. Much interested in Tommy battalions coming back with German trophies. At dusk moved up to the front line in front of Pozieres & took over from the Northumberland Fusiliers, finishing the taking over about 1 o’clock. \n","109":"\n\nIn the trenches in front of Posieres under more or less shell fire all the time. Our company was in the communication trench leading from the sunken road to the trenches. Very cramped & crowded but had to make the best of it. Round about were the bodies of scores of tommies who had been killed in the capture of the trench we were holding, & numbers of Germans also. At various spots were German rifles, bayonets, equipment &c. & some of the boys got some fairly good souvenirs. Was glad to find that Arnold Hazlewood was on duty in B Co. quite close by & had several yarns with him. \n","110":"\n\nIn the same spot under much the same conditions. Had one or two narrow escapes, one piece of shrapnel puncturing my great coat, while on another occasion a pellet hit my ankle a glancing blow without doing any harm. Great aeroplane activity, it being not unusual to have 15 or 20 planes up, & 20 or more sausage balloons. We saw one German plane brought down & fall end over end into our lines far to our right. Several casualties in the company from shell fire, but fortunately only a few. \n","111":"\n\nIn the same trenches, but busy during the day going round the front lines & communications to be sure of their positions, access &c. Terrific bombardment of Posieres by our guns & mortars during the afternoon. We got our orders of attack at this time & then had to make everything clear to the sergeants & section commanders who in turn passed the information on to their men. To this knowledge that every man had of what was expected of him in the attack, I largely attribute the ultimate success of the venture. The attack on Posieres is described on loose pages.\n","112":"\n\nConsolidating the Pozieres positions won the previous night. Captured the German stronghold (\"Gibraltar\") in the morning. Doings described in loose leaves.\n","113":"\n\nConsolidating the Pozieres positions & most intensely bombarded. Experiences described in loose leaves.\n","114":"\n\nHanging on in front of Posieres but had to withdraw to the stronghold in the afternoon. Relieved by 2nd Bde. at night & moved back to Tara Hill. \n","115":"\n\nVolunteered to go back to Posieres to try & get Capt. Cotton’s body, one of the captured machine guns, & the company’s great coats & the waterproof-sheets, returning to the transport paddock. \n","116":"\n\nSpelling in the transport paddock outside Albert during the morning, once being awakened by someone who proved to Jocelyn Carr paying a visit to see how I was getting on. In the afternoon we got our orders to move & by a very roundabout route we went to a thick wood on a hill near Contay & there camped in Canadian huts. My duty was to bring along cripples in a motor lorry in rear so I was saved the tramp. Visited by General Birdwood & Lord Northcliffe & cinematograph pictures of the visit were made. \n","117":"\n\nDuring the morning waiting for orders to move, but nothing doing until in afternoon when I went down to see about the loading of a motor lorry with packs of the men, afterwards coming on in charge of it : was thus saved a 9 mile march & was not sorry for it. We reached La Vicogne about midnight & had very rough & crowded billets.\n","118":"\n\nUp fairly early to pack things &c. A real summer’s day, bright, hot & dusty. Our march to Bonneville led us thro’ one particularly lovely avenue of poplars where the shade was lovely, & past the main aeroplane depot behind the present push. About midday we reached our destination, the men having fair billets, but the officers had to camp outside in a well-grassed paddock. My canvas sleeping-bag was much appreciated at night. During the afternoon had to fix up the pay for the company & H.Q. & was kept going for a while. \n","119":"\n\nUp fairly early to get ready for the move. A gloriously fresh morning followed by a bright hot summer day. Left Bonneville about 9.30 a.m. & had a dusty march through the usual class of fertile country through Canaples to Pernois, a village on the Nievre, a little stream in which I later enjoyed a wash. My billet was a specially good one, by far the best I have seen. In the afternoon Leo came along & stayed yarning for a while, & later Oscar Gosling of S.H.S. & the H.A.C. & now with A.S.C. came along. Took things very quietly during the afternoon. To turn into a good bed with snowy sheets was indeed a treat.\n","120":"\n\nA very hot day quite similar to our early summer weather at home. In the morning had to attend a lecture at Bgde. H.Q. while the company was on parade, & in the afternoon took the parade to free Capt. Herrod. When it was over borrowed a bike & rode over to Vignacourt to buy some necessaries : it was a very heavy drag & for the greater part of the way I had to push the bike : the downhill ride on the return journey was compensation for this.\n","121":"\n\nAnother hot summer’s day. Parade in the morning & immediately afterwards I had to take the company down to the banks of the river Nievre where a pit had been dug & covered with tarpaulins to render watertight, & water pumped into it. The men greatly enjoyed a bath in it, but were late getting back for their lunch : on this a\/c the afternoon parade was cut down, my time being spent principally at censoring. In the evening had to report to the Bde. H.Q. to take over the job of Gas Officer, but was allowed off until the next morning. Glad to have dinner with the company once again & to afterwards turn in between the clean sheets.\n","122":"\n\nSame weather. After breakfast moved down to Bde. H.Q., my new billet being merely a bare room without a stick of furniture, & not too clean at that. Getting things straight generally during the morning : met Cousin Ray, now Transport Corporal to the Bde., who made himself known to me. In the afternoon rode round on a bike to see Divl. Gas Officer, & on the way back met Rid who is quartered in St. Leger, the next town but one, & was looking for me. Delighted to see him & have a yarn, & afterwards rode out with him to their bivouac, returning in time for dinner at night. \n","123":"\n\nAgain hot. Busy with Div. Gas Officer in the morning & in the afternoon going round to battalions seeing abut gas helmets. Before tea rode out again to St. Leger to try & get the collar for my shirt : it was not done & I went on to see Rid to get him to fix it up if possible. Had to wait some time to see him & afterwards rode back most of the way with him. After tea moved my belongings back to my old billet, permission to do so having been obtd. from the brigade major. \n","124":"\n\nStill summer weather. During the morning was kept busy with clerical work & in the afternoon lectured to all company Gas N.C.O.s, choosing a grassy spot close to the main road under the shade of some tall poplars. Writing home in the evening, several home letters having come to hand during the day.\n","125":"\n\nSummer again. Trotting round to battalions in the morning & afternoon, going also to Division where I looked up Leo & had a nice cup of tea in the kitchen with him. He was well. Coming home I had the good fortune to meet Rid who was being towed behind a motor lorry on a bike in a cloud of dust. In the evening put on a spurt with letters because the mail was to close in the morning. \n","126":"\n\nA glorious Sabbath day, but rather warm. In the morning a Church Parade of the brigade was held by our two C. of E. chaplains, one of whom preached from Joshua 1:9. The General was present & it was a good service, though the brigade was sadly depleted in numbers. Spent most of the remainder of the time letter-writing, in the afternoon having a surprise visit from Rid as he returned from holding some services. \n","127":"\n\nSummer again, but much cooler at night. Lecture by Div. Gas Officer to reinforcements in the morning, & during the day I visited our Engineers & other units to see about helmets &c.\n\nIn the afternoon rode out on bike to Fresselles to try & get a refill for my electric torch from the canteen there. A hot & dusty ride over a pretty bad road. Demonstration in use of SOS rockets at night.\n","128":"\n\nStill dry & hot. Going round units & attending a lecture at St. Ouen by the Army Chemical Adviser during the morning. In the afternoon rode out to Vignacourt to try & get refill for my electric torch & one or two other things. A heavy pull going out but much better returning. \n\nWednesday 9 August 1916\n\nSame weather continued. Up early getting things packed, & immediately after breakfast was ready for the move. Left Pernois at 9.30 & had a hot & very dusty march out to La Vicogne, one very steep hill at which some of the transport animals baulked having to be climbed. En route we passed the 5th Bde. Inf. & a bde. of artillery on their way to occupy our old billets. Arrived at La Vicogne abt. 12.30 & in the afternoon went round to 2nd Bn. Very limited accommodation & we had to sleep outside under a trellised arch. \n","129":"\n\nHad an early breakfast in order to be ready for a motor-bus which was to take us to a demonstration of an attack a few miles distant : it was pretty late in turning up but as it turned out it did not matter much. The day was dull & there was drizzling rain more or less intermittently. At the demonstration there were many generals, staff officers & others, everything going off well. Had to return by a roundabout route, arriving at Herissat a little after 1 o’clock. We were told that the king was close by & might pass thro’ our village, but only the 2nd Bde. had the chance of seeing His Majesty. Billetted in a usual type of cottage & fairly comfortable. \n","130":"\n\nFine again, & very warm. In the morning attended a demonstration in the use of smoke in attack for the purpose of masking the troops. Quite successful & very interesting. Afterwards biked out to Rabaumpre where the 2nd Bn. is billeted, & after lunching with them continued on to Vignacourt in order to try & get refills for my torch. A fairly long ride besides being warm. Home in time for mess. \n","131":"\n\nHot & sultry. Moving about the units during the day, again biking out to Rabaumpre to see the 2nd Bn. While with the Machine Gunners got one of their sergeants to hurriedly run over the gun so as to give me some idea of its working should it fall to my lot to want to work one. The Vickers is certainly a wonderful little gun. After tea again rode out to the","132":" Bn. with Cuthbert, & before returning looked Leo up, but as it was very late he was, as far as I could learn, in bed. \n","133":"\n\nStill summery. Church parade in the morning, attended by our Brigadier & by General Birdwood who, after the service, presented ribbons of medals won some little time since. His speech was very good & the cheers given afterwards were very hearty. Took things easy in the afternoon, before tea biking out to Rubempre to see Leo : he was well.\n","134":"\n\nThere was a fair fall of rain during the night & the day turned out dull with intermittent showers. Lectured to reinforcements in the morning & after coming in got word that we were to move up to Albert in the afternoon. Got things packed, & just as we were on the point of setting out at 2.30, word came that we were to stop at Vadencourt, not quite half-way out. Waited for a heavy shower to pass over & then had it fine for our 4 or 5 mile walk. Very poor billets, but much better than open air at Albert as we thought we should be experiencing. \n","135":"\n\nShowery throughout the day. After breakfast we moved off to Albert, following a somewhat different route to that taken the first time. Roads wet & slippery & going heavy. Billetted in a deserted place in a fairly bad state of repair, but managed all right to be comfortable. \n\nLate lunch & then spent the afternoon trotting round. \n","136":"\n\nAgain showery. During the morning moved up to Bde. H.Q. in Sausage Valley. As we walked up along the Bapaume Rd., branching off at Ovilliers we were surprised at the amount of work that had been put in since we left, the place being cleaned up, a new road made, & great improvements effected. The way in which the guns, both field & heavy, had been moved forward was very noticeable. The travelling kitchens, too, were now taken right up to Ovilliers. Our H.Q. were in a deep dug-out in which there was not overmuch room for us all, but quite safe. Meals were taken up on top in a small screened off enclosure. \n","137":"\n\nHad a little sleep last night being well off because of having blankets & waterproof with me & room on the floor to stretch out. Several showers during the day & the ground everywhere extremely slippery. A lot of noise as we were almost surrounded by guns, those behind being especially troublesome. A number of premature bursts occurred during the time we were in, but I do not know whether any casualties were caused. The aerial activity was remarkable : one afternoon I counted 18 sausage balloons & 20 aeroplanes in the air at one time. A German machine was quite an unusual sight, but on one of the days we had the chance of seeing one brought down in flames by one of our airmen.\n","138":"\n\nAgain inclined to be showery. Up at ¼ to 3 & with Cuthbert went up the line with the General to spy out the land. The morning mist was fairly heavy & underfoot things were wet & slippery. The shelling was fairly quiet & we reached the old stronghold in Posieres without trouble : it is now named \"Gibraltar\" & above ground had been a good deal battered since I last saw it, the Germans knowing full well that we must be making use of it. Trenches had been dug round about making communication a good deal safer : the ground round about was more torn up than ever by shell fire, but burying & salvage parties had been at work. We worked right up to the front, the guides really losing us &landing us in a forward sap in No Man’s Land, but fortunately the mist obscured us. With little shellfire we made our way back thro’ the mucky trenches, arriving just abt. breakfast time. Immediately afterwards had to again go up the line to reconnoitre, getting back abt. 4 p.m. At night at C.E.R. during the attack by us on positions close to Mouquet Farm. \n","139":"\n\nRight through the night was in the dug-out in the advanced position really acting as orderly officer to the General. \n\nIn replying to our very intense bombardment the Huns sent a few shells very close to us, but the possey was quite safe. The attack was only partially successful, our own artillery fire really doing a lot to hinder our advance : the 4th Bn. reached their objectives & gained some ground, but the 3rd were held up. Casualties were heavier in the former. About 6 o’clock in the morning returned to our Bde. H.Q. in Sausage Valley. Forgot to say that during the stunt a runner arrived with 4 or 5 letters for me amongst his messages : they were a fine treat.\n\nHelping with intelligence work during the morning & immediately after lunch was sent back to Albert to fix up billets for the brigade. Had not much trouble but was kept waiting until after 11 o’clock for the units to arrive. Then turned in abt. midnight. Day had been finer, with only one or two showers. \n","140":"\n\nBreakfast was an hour late, but not knowing it I got up at the usual time, much to my disgust. During the day took things quietly, strolling round or lying down. Bright & sunny.\n","141":"\n\nFine & clear. Immediately after breakfast we moved back to Warloy Baillon. A motor lorry was attached to us to pick up sick men who fell out of the march, & I rode in it. As we moved out of Albert 3 German planes flew over & as we afterwards heard, dropped a bomb on some artillery positions doing some damage. Arrived in time for lunch, & took things easy in the afternoon. Just after mess I spied Jocelyn riding along & was so glad to have a yarn with him. He was looking splendid : heard that Wes Wade was killed but that the others were all right. \n","142":"\n\nA warm summer’s day. Left Warloy Baillon about 9 o’clock & came through Vadencourt, Herissait, & Val de Maison to La Vicogne, arriving about 1.30 after a dusty march. \n\nCrops along the route were quite ripe for the most part, & in many places harvesting was in full swing, binders & scythes being operated by very young or very old folk. One wished that a few battalions of our men might be put on to the ground to get the crops all in before it is too late. Lunch was ready for us, & during the afternoon took things easy, going to C Co. of the 2nd Bn. for dinner. Slept out under the trellised archway behind the house. \n\nWednesday 23 August 1916\n\nAgain very warm. On the go at odd jobs during the morning & after lunch had to report to the 2nd. Bn. for General Birdwood’s parade. It was held in a heavily grassed meadow, the whole of the 1st Bde. attending, being drawn up in a hollow square, in the centre of which the \"victims\" were placed. In the absence of the","143":" Bn. I was the first to be called up, General Birdwood shaking hands & saying several nice things as he handed each one the ribbon of the medal won. Afterwards he made a short speech extolling the exploits of the Austns. The parade over, I rode out on bike to Vignacourt, having tea there & returning to La Vicogne by dark. Forgot to say that during the day I met Dr. (Major) Goldsmith who used to attend us at Chatswood.\n","144":"\n\nA heavy shower or two during the night followed by a sunny, muggy day. About 10 o’clock we left for Gezaincourt, a town very close to Doullens passing on the way a fairly big aerodrome & a barbwire prison for German prisoners. The country traversed was extremely fertile, the undulating fields all carrying good crops of cereals, marigolds, turnips &c. \n\nWe reached Gezaincourt about 1 o’clock, finding it much the same type of French village that we are accustomed to. In the afternoon I biked the 3 or 4 kilometres into Doullens, quite a large town outside which is a quaint & interesting old Citadel. One wondered what tales history had to tell about this old relic of former days. \n","145":"\n\nA rather muggy day with one or two showers of rain. During the morning on the go in Gezaincourt & after lunch rode on horseback in to Doullens with Mr. Watson to see about some entraining items. Back by 4 o’clock & at 5 marched out with H.Q. details for Doullens where, after fixing up entrainment we had dinner at one of the hotels, getting back to the troop train about 8 o’clock. The train left Doullens about 9.30 p.m.\n","146":"\n\nA very broken rest only obtained owing to there being 4 of us in the compartment. About 4a.m. the train pulled up at a new siding close to Poperinghe in Belgium. It was raining, & this showery weather continued right through the morning but gave place to a perfect sunny afternoon. It took some time to get the transport off the trucks & everything ready to move off, & then we had considerable difficulty in finding our camp. \n\nHop fields with hops in bloom very noticeable after having been down south. People apparently low bred & talking an unknown language. Had breakfast by the roadside as best we could & eventually reached our quarters in ruberoid huts about 11 o’clock. In the afternoon went with the Brigade Major on horseback to meet the 4th Bn. at the station, & greatly enjoyed the couple of hours ride, reaching home about 5 o’clock. A perfect evening. \n","147":"\n\nA beautiful morning & day with one or two light but sudden showers. This weather is said to be quite typical of this part at this season of the year. Church parade was held at the 4th Bn. but being slightly upset I stayed at home & during the day got some letters written. \n","148":"\n\nA sunny day with several showers at intervals. The General & B.M. were down the line & the others out so I had to stay in for greater part of the morning & then biked out to look for Division, just happening to find it as I was on my way back. Country round about is flat & fertile. Hops look splendid, cereals mostly cut & stooked, apparently good crops having been obtd. Many more men noticed about than was the case in France. In the afternoon had to meet the Div. Gas Officer & kept on the spot by him. After tea in the gloaning biked the 2 or 3 miles to the spot where I had noticed the sign \"ADMS\", & had a few minutes yarn with Leo : he was well & in good spirits. \n","149":"\n\nA dull wet day : heavy showers occasionally. Was called for at 9 a.m. by an A.M.C. motor & with several others was taken thro’ Poperinghe to a large town named Cassel where an army Gas School is situated. It was an interesting ride thro’ long avenues of elms & poplars, across the border & back into France. Had a good morning dealing with the new type of gas mask, then had lunch at a very nice place & stayed there for some time waiting for the rain to abate. Found parcels from Evie & from Lawry waiting for me & was glad to have them : a real treat, the excitement of opening them & then the pulling out of one article & then another. A Gas alarm at night. \n","150":"\n\nA miserable cold & wet day. Immediately after breakfast set out on the bike to find the Div. Gas School & after a lot of trotting round managed to locate it. Was there all the morning, & the afternoon being more boisterous than ever, I stayed inside getting a few letters written. \n","151":"\n\nAwakened at 3 a.m. & after a cup of cocoa got in the car with the General & was soon speeding over the main road through Poperinghe to Ypres, a cobbled road with a fine avenue of trees screening it. It was a 6 or 7 mile drive along an almost deserted route, - for the time of day, - the traffic police being practically the only people awake. The city of Ypres seen in the soft starlight was a very pathetic sight, the remains of the once magnificent cathedral standing out in bold relief above the ruins of the houses : the streets are carefully kept free of all debris from the daily shelling. The ancient city was surrounded by a solid wall & moat : at one of the gateways we left the car & went on by foot to visit the front line trenches on the left (N) of Hill 60. Trenches in a fearful state after the rain. Reached home abt. 8.30, finding the parcel from \"Cairnleith\" waiting. A fine treat.\n\nIn the afternoon Leo came up on a bike so I took a half-holiday & together we rode into Poperinghe, had our photos taken & then afternoon tea. The weather was glorious & the day most enjoyable. A lovely mail of 8 letters rec’d.\n","152":"\n\nAbout midnight had received word that I was to set out at 9 a.m. to the Army Gas School as Cassel. It was a dull morning but very little rain really fell. At the Field Ambulance a car was waiting to take us the 13 to 15 miles. 3 doctors went, our route taking us up Mont des Chats. We reached Cassel just before 10.30 & at once were started off with a lecture which lasted till abt. 1 o’c when we had to find our billets, mine being in the little village of Bavinchove, not much of a billet really. Got some lunch there & then walked up to Cassel a large town built on a hill from which it is said one can see from Dunkirk to the Somme. Unfortunately it was dull the whole time we were there so that it was not possible to get a really good view. Lecture again in the afternoon & then dinner at the main hotel. Long walk to billet.\n","153":"\n\nUp in good time & walked over to Oxelaire for breakfast at a very fine class billet where 3 RAMC men were staying. It was close to the school where at 10 o’clock we had a lecture followed by practical work with gas in the field. Free in the afternoon & spent the time with Capt. Minty going round Cassel looking for several things we wanted : several good shops in the place. A lecture just before dinner & then a tramp home. There was very little light rain but it was a dull hazy day. \n","154":" 1916\n\nA similar dull day. Breakfast at same place in Oxelaire. People everywhere in their best clothes & turning out in large numbers to Church. A lecture & demonstration in the morning, followed by lunch at the place in Oxelaire. We then had to wait until 3 o’clock for the motor ambulance to turn up, & then we driven back into Belgium. \n\nI was taken out to Ypres where with a little difficulty I found Bde. H.Q., my dug-out, shared with Cuthbert, being quite a comfortable one. A large corrugated iron cupola, sandbagged outside covers a floor with an area abt 10’ x 10’, the max. height in the centre being abt. 6’. There are 2 bunks in it & a couple of tables. It is built against a railway embankment abt. ¾ mile out of the city, & at night time the sight of star shells on 3 sides almost gives one some impression of what \"the salient\" really is. Altogether very unlike a Sunday. \n","155":"\n\nA dull miserable day with a fair amount of rain in light showers. After breakfast went up to the line where the right battalion is, a very historic piece just in front of Hill 60. Things very quiet, fortunately, & was able to get the alarms &c. fixed up. In the afternoon attending to gas-proofing of Bde. H.Q. dug-outs, rigging wind-vanes, &c. \n","156":"\n\nUp at 3.30 a.m. & went round part of the line with the General. It was beautifully starlight & the early morning fine but everything underfoot was fearfully wet. An interesting walk round, landing us back at H.Q. a little after 8 o’c. Rain commenced soon afterwards & continued more or less constantly throughout the day. Was able to remain under cover attending to gas alarms &c. \n\nA real tragedy happened in the 2nd Bn. through a \"minnie\" landing in a Co. H.Q. dug-out & killing Capts. Murray & Chant, Lieuts. Callaway & Dabbs & 2 4th Bn. officers, together with several N.C.O.s & men. At night Padres MacAuliffe & McKenzie conducted the burial service in the darkness – a weird experience. \n","157":"\n\nFairly fine. Visited 2nd Bn. & found the trenches awful. During the afternoon was kept in by the Div. Gas Officer who wanted certain information about alarms &c. Gas alert on during the day. \n","158":"\n\nA glorious day but with wind still in favour of the enemy. A flight of a dozen or more of our aeroplanes passed over soon after breakfast, & was a pretty sight. During the morning visited the right battalion to fix up alarms &c. The ground was drying up well but in places there was still plenty of mud. After lunch went up to the left battalion for a similar purpose & at 6 o’c. had to go all round the left bn. lines with the General : the trenches in places were awful, mud & slush being 10 or 12 inches deep. It was a beautifully clear moonlight night & I enjoyed the trip, everything being very quiet. \n","159":"\n\nFine but misty in early morning & at night. Busy during the day fixing alarms, visiting the line &c.\n","160":"\n\nBeautifully fine. Fixing up ventilator for my dug-out during the morning, & in the afternoon doing some clerical work for the General. About 6.30 p.m. set out with him to go up the line. Bright moonlight at first but by degrees it became foggy. Went with him into Noman’s Land & across \"The Gap\", a rather perilous walk for a General. Came through safely but wet through up to the knees. Had dinner abt. 10.30 & then found an Aust. mail of 9 letters waiting. Devoured them in bed, taking past midnight in doing so. \n","161":"\n\nA dull grey day with a light shower of rain in the afternoon. Feeling off colour I took things easy during the day, only going up the line in the afternoon & afterwards turning in early. \n","162":"\n\nUp early to attend a Gas Conference. A horse was sent in to Ypres whence I rode out to the Div. Gas School. After the conference borrowed a bike & rode along to see Leo for a few minutes. He was busy fiddling with a primus stove, - well & happy. He made me a lovely cup of tea. Rode back to Ypres in the early afternoon, not bothering about lunch. A light shower of rain in the afternoon, otherwise a dull day. \n","163":"\n\nA dull day with drizzling rain at intervals. In the morning the 3rd Bde. Gas Officer & Gas N.C.O.s came out to take over gas appliances & I was kept busy taking them round showing the area, positions of gas alarms &c. &c.\n","164":"\n\nAgain wet & miserable. The new brigade was taking over during the day but I did not bother much, feeling off colour & lying down most of the time. About 8.30 at night set off with Cuthbert from H.Q. & walked along the railway line, being just in time to catch the train, which fortunately was 15 minutes late. Only a very short run in it & then a march of abt. 3 mls. to 2nd Bn. H.Q. where we had a cup of tea & then came on the other 1 ½ miles to our old Bde. H.Q., arriving cold & tired at a late hour. Bert Thompson called to see be during the morning.\n","165":"\n\nA bright morning but afterwards very cold & changeable with several heavy showers. During the morning went to the Div. Gas School & in the afternoon was fixing up a number of necessary gas matters. Cuthbert left for England on leave in the morning. Nice to hear the bugle calls again, more especially some of the cavalry calls. \n","166":"\n\nBright & sunny but cold : last night was extremely cold. During the morning was at Div. Gas School where part of the brigade was being fitted with the new respirators. Met the 2nd Div. Gas Officer, Capt. McNiven who used to be an evening student of one of my Geology classes. Finished by lunch time & in the afternoon trotted round fixing up matters & visited Poperinghe to have a bath, but had to come away unwashed. \n","167":"\n\nA gloriously bright morning but overcast later, then bright again in the afternoon & evening. At the Div. Gas School in the morning & then walked to the Div. Baths at Hoppoutre where I enjoyed a good wash. In the afterward busy with the fitting of new respirators in the 1st Bn., & in the evening writing home. \n","168":"\n\nA beautiful day. Took things easy not attempting any helmet-fitting with units. Felt inclined to go out for a stroll but thought that Leo might come along during my absence & so decided to remain in. Got a little letter-writing done but was not in the mood for much. \n","169":"\n\nA miserably wet & dreary day. Unable to do any fitting of helmets owing to the rain, & remained inside getting a few letters written. \n","170":"\n\nA beautiful bright day but with a distinct nip in the air. In the morning fitted the M.G. Co. with the new respirator, lectured to the 1st Bn. officers & after lunch fitted out the H.Q. details. In the evening biked down to the ADMS to see Leo, & from there went into Poperinghe & got the photos taken on 31st Aug. Very heavy rain during the night.\n","171":"\n\nEverything underfoot was fearfully wet & slushy but there were only a few driving showers during the day. Went round battalions in the morning & in the afternoon stayed inside for Leo’s visit. Most crops of hops have now been harvested, also chickory : maize sown in drills 10\" apart is abt. 3’6\" to 4’ high & being used as greenfeed. \n","172":"\n\nFairly fine but very wet underfoot after last night’s rain. In the morning lectured at the 2nd Bn. & after lunch, as there was only an inspection of the units by General Plummer, went into Poperinghe to the pictures. Missed seeing Leo through being a little later that arranged but saw him afterwards & rode home with him. The pictures were quite a change & I enjoyed them much. \n","173":"\n\nA glorious day, all aircraft taking advantage of the good visibility. A Hun came along way back over our lines amid a storm of shrapnel, & some of our planes visited the German lines. The remainder of the bde. staff were up the line & elsewhere & I had to remain in after going round to Division to draw pay. Lectured to the Gas N.C.O.s in the afternoon & was also able to put in a fair amount of time letter-writing. \n","174":"\n\nAnother perfect day. Busy with the new respirator in the morning, & then went over to Reninghelst for a bath. In the afternoon the 2nd Bn. sports were held in the Gas School grounds & attended by most of the brigade. The grounds were very well set out, abundance of refreshments were supplied, & altogether the function was very successful. Unfortunately I arrived just too late for the officers’ race in which I was to have run. Col. Heane presented the money prizes at the conclusion. After the sports a grand dinner was given, attended by General Walker & other notables. Also a highly successful function.\n","175":"\n\nFoggy early but otherwise a perfect day. A combined Church Parade was held in the morning on the Gas School grounds attended by the whole brigade. The service was taken by Padre McKenzie, General Birdwood, General Walker & their staffs, & Mr. Andrew Fisher being present. At the conclusion ribbons & a few medals were presented by General Birdwood who made a very characteristic speech to his \"boys\". The 3rd Bn. band was present & it was fine to hear the old hymns played by the band. Most of the remainder of the day I spent letter writing as the Aust. mail closed in the afternoon. A fair-sized home mail in also.\n","176":"\n\nMisty early but otherwise glorious. Had to attend a Gas Conference in the morning, & the rest of the day was attending to odd hobs at brigade including a bike ride to the A.M.C. for a bottle of formalin. The General came back from leave to England in the early morning. At night 2 battalions went up into the line. \n","177":"\n\nStill a continuation of the fine spell. Was to have gone to a lecture at St. Omen on \"Gas\" & made arrangements accordingly but then found that the lecture was cancelled. During the morning went to Hoppoutre & had a splendid bath, & in the afternoon was packing up for the move. Had early dinner at 6 o’c. & then walked over to the train at Brandhoek, going with the 2nd Bn. & M.G.s by it to Ypres, arriving at dark & thence having to walk out to Bedford House stopping at Lille Gate to have a cup of tea supplied by the Comforts Fund people. Arrived about 9 but did not get to bunk until after midnight, sleeping in the Gas Sergt’s little dug-out.\n","178":"\n\nUp at ¼ to 4 to go round the line with the General, quite an interesting walk. The trenches are much better in most ways than those on our left bde. front. Everything was very quiet & the sunrise effects beautiful. Got back in time for breakfast & after it moved into my dug-out, a much larger one than the pokey little chap. Much admire the immediate surroundings, especially in the way of the forest trees. In the afternoon went out getting an idea of the positions of units. One or two showers of rain towards evening. Cuthbert arrived from England & told me that Rid had come over to Bailogne by the same boat. It was very good news. \n\nThursday 28 Sept. 1916\n\nAgain most beautifully fine. After breakfast went up to the 2nd Bn. & was there all the morning looking to gas measures. During the afternoon attended to clerical matters & went over to the","179":" Bde. at our old position in railway dug-outs. Some artillery strafe during the afternoon. \n","180":"\n\nA dull day with drizzling rain at intervals making it very slippery underfoot. During the morning was kept going visiting the 1st Bn. their part of the line in the neighbourhood of the craters being extremely interesting. Did not get home for lunch until about 2.30. At inside work during the afternoon. \n","181":"\n\nMost beautifully clear & fine, thus causing great aeroplane activity. All the morning going round the front line, being again late reaching home for lunch. In the afternoon walked back to the 4th Bn. in reserve, a long tramp over what must have been very fertile fields on each side of the Ypres canal, past lovely chateaux now wrecked & ruined, & through woods & avenues in a similar state. Raiding stunt at night. Watches put back from 1 o’c. to 12 midnight so that we had an extra hour’s sleep. \n","182":"\n\nMost unlike a Sunday & difficult to realise that it was. A fine day keeping me busy up the line & at strong points during the morning. During the afternoon had to carry out tests with a new tear bomb which proved very satisfactory. At 7 p.m. attended the Burial Service in the dark of Major Rowlands & others killed the previous day, the R.C. padre reading the service for one of his men in a very poor style I thought, Padre McKenzie taking the Protestant service. It was a weird scene. \n","183":"\n\nA very dull morning later turning to rain which continued throughout the day. The morning spent in going round the line, again being late home for lunch, & in the afternoon, after changing into dry things took things easy.\n","184":"\n\nA dreary wet day, with short breaks. Through the line during the morning, staying in at clerical work during the afternoon.\n","185":"\n\nUp at 4.15 & went round the line with the General. Rain started soon after we got back & continued with some breaks all the morning. Stayed in until after lunch when I again went round the line with Cuthbert. A very heavy bombardment on to our right brigade was opened up by the enemy towards evening causing us to shelter in one of the tunnels for a while. Later we heard that the artillery strafe was followed by 2 raids, both unsuccessful.\n","186":"\n\nNo rain during the day but very muddy underfoot in most places. In the morning went right along the line testing the pressure of the horns &c., & was interested to see the results of the enemy’s bombardment the previous night. Had to stay in during the afternoon on a\/c of the Brigade Major & others being out. Later went to the M.M.G. Co. H.Q. to arrange about their respirator fitting. Brigadier went to Division temporarily in command. \n","187":"\n\nA dull grey day, but with little rain. In the forenoon went round the line with Col. Heane going into the most forward positions & practically everywhere. In the afternoon fitted & tested half the mobile machine gunners with the new respirator & as soon as this was over went up the line with Cuthbert, being very interested in the arrangements for the private raids intended to capture a prisoner or two for identification purposes. \n","188":"\n\nWeather changeable, spells of sunshine in the morning alternating with wild gusts of wind. In the early morning was awakened by talking & commotion caused by the arrival of a German prisoner from the line : he had been taken while caught in our barb wire, & found to be slightly wounded in the right wrist. A middle-aged man & rather a miserable specimen.\n\nIn the forenoon was warned for duty at Army H.Q. & after getting things packed up waited all day for the car to come. During the afternoon completed the issue & fitting of new respirators to the mobile machine gunners. \n","189":"\n\nDull with a wintry wind blowing most of the day. During the morning was kept standing by in anticipation of word coming to leave for Army H.Q. & when the message did come the morning was done. After lunch went part of the way up to the line & then had a bath & change before the car came at 6.30. It was a lovely motor ride : the sky was rather overcast, but the moon was almost full & lighted things up fairly well. \n\nRuined Ypres was really weird. The road was crammed with transport of all kinds bringing stuff up to the people in the line, big waggons, limbers, lorries, watercarts, motor cars & motor bikes were intermingled with horsemen, all confusion being saved by the traffic police at the busy points. Lights put out passing thro’ one or two towns where are big ammunition dumps, & finally reached Cassel a little before 8. Dinner, & late to bed. \n","190":"\n\nFine, but not many patches of sunshine : again windy. After breakfast walked down the steep hillside to the gas school to keep a general supervision over some practical work being done by a Gas N.C.O.s school. This was over by 12.30 & I then rode home on the horse sent down by Capt. Barley. After lunch went up to H.Q. to read up some matter on late attacks, & abt 4.30 rode down to the school & lectured for an hour on the precautionary orders laid down. Rode home in the dusk & much enjoyed it. Went down the town before dinner to get one or two necessaries, & when it was over stayed up completing preparations for the next morning’s lecture. \n","191":"\n\nSimilar weather. Took the car down to the school for the 9 o’clock lecture on \"Gas Shells\" which as usual was followed by practical work in the field. Capt. Barley had left in the early morning on a visit to the Somme. In the afternoon a gas attack on a small scale was carried out, real gases, bombs, explosives & so on being used. It was rather good. \n","192":"\n\nStill fine, but dull & hazy & with a strong wind blowing. After breakfast went down to the school in the car for the 9 o’clock lecture which was followed by a break for revising the notes & then the N.C.O.s underwent a short oral exam which was not, however, completed until the afternoon. Results generally were good, & in some cases exceptionally so. Capt. Barley got home from the Somme in the evening about dinner time, his visit to the neighbourhood of Pozieres being most interesting : he brought back several souvenirs. \n","193":"\n\nFine but dull with a strong wind blowing that was decidedly cool. In the morning went down to the school at Oxalaere to run through a few tests & after lunch went down again to the village. Trying to get souvenirs to send home, but did not meet with much success. \n","194":"\n\nDull with several drizzles of rain which were hardly heavy enough to wet one but which made the cobble roads very slippery. After breakfast went by car to visit 2 English Divisional Gas Officers (55th & 38th Divs.) & very much enjoyed the run round. In the afternoon walked down to the Oxelaere school with Cart. Barley, going by a new route thro’ beautiful park lands, very steep, but very pretty. \n\nLeft Cassel by car about 5 o’c. & reported to the 1st Aust. Div. being sent by them to Busseboom to await the Bde. H.Q. which was to come out that night. Found that Rid’s Art. Bde. was camped close by & went up & spent a couple of hours with him. It was great to see him again. Forgot to mention that I called in to see Leo on the way from Div. to Busseboom.\n","195":"\n\nDull & overcast, but no rain until late at night. The Bde. H.Q. had arrived abt. 11 o’c. the previous night, & we had to be up in good timed to have breakfast & get things packed up preparatory to the move. Just before we moved off Jocelyn came along & we were able to have a few minutes yarn. He was looking splendid & I was so glad to see him again. We got away from Busseboom abt. 10 o’c. & this time I was mounted, riding the interpreter’s horse. It was abt. 8 mls. march to Steenwoorde, quite a large town close to Cassel : had a very nice billet with an old couple who remembered well the 1870 campaign & who had been compelled to take refuge in their cellar when the Germans overran this place in Oct. 1914. Delighted to receive a mail of 16 letters.\n","196":"\n\nDull in the morning, later clearing & giving place to a bright afternoon : quite a nip in the air all the time. Left Steenwoorde on bike about 9.30 & came through Cassel to Arneke, abt. 13 miles from the starting point. At Cassel called at my old billet & enjoyed a cup of tea & bread & butter about 12 o’c. After the pull up Cassel hill the going was good, over level roads through numerous villages in which the villagers were all in their Sunday best. Some of the churches were very old, one, I hear, dating back to 1116. Reached Arneke about 2 o’clock, coming the last few miles with Staff Capt. in his motor car. Quite a cold night.\n","197":"\n\nA glorious day in spite of a very few drops of rain in the morning : quite cool but bright & sunny. Left Arneke abt. 9.30 & on horseback I branched off at Ochtezeele to have a look at the old 1116 church. Came through really magnificent fertile country of an undulating nature : mangolds & beet being pulled : potatoes being ploughed out : maize being cut for cows : beans being stacked : lovely cabbages being cut : in one place wheat being thrashed, a horse on a treadmill supplying the power. The route was for a large part through lanes bounded by hedges where the hawthorn & brier berries looked beautifully red, & the intertwining blackberries were laden with lovely fruit which for some reason did not seem to be appreciated by the local people : not so by the soldiers! Gorgeous autumn tints shown on chestnuts & certain other trees.\n\nNearing Watten the road skirted a steep slope below which was a fairly large canal & on its banks the populous town where a good deal of manufacturing seems to be done. From here we went on to Westrove, a very small townlet with scare & scanty billets. A cold night.\n","198":"\n\nAnother beautifully clear & enjoyable morning with an overcast afternoon during which some rain fell. After breakfast went to the A.M.C. to try & get relief for a neuralgic complaint that was worrying me & by them was sent in to the English stationary hospital at St. Omer for examination & preferred to come back to camp rather than go into hospital, which seemed a very nice place, situated in an old spacious building. Had some lunch in town & then went inside the adjacent grand church in which were some 13th century statues & an inscription on the wall stating that in 1553 Chas. XV had entered that particular portal. The stained glass windows were exquisite. Came out again in an ambulance & lay down for the rest of the afternoon. \n","199":"\n\nA miserably wet day, heavy showers falling at intervals. Stayed by the fire during the morning & in the afternoon lay down & had a sleep. The face still troublesome.\n","200":"\n\nDull, & wet. Intermittent showers throughout the day & everything underfoot was in a filthy state. After lunch biked in to Division on business & was fortunate enough to meet Leo there, carrying a bag of coal up to their mess. This was at Tilques. Thence rode on to St Omer & got one or two things I needed from Ordnance, afterwards having a fairly stiff ride home against a head wind, & arriving abt. 6.30. A frost at night, the first I have seen this season.\n","201":"\n\nFine & beautifully clear. During the morning got some Xmas cards purchased yesterday addressed & by lunch time got packed up, immediately afterwards pushing off on horseback to St. Omer to act as Bde. Entraining Officer. This meant a fair amount of attendance at the station, but with the Bde. H.Q. staff went up to an hotel for dinner & later on fixed up for a room at the Y.M.C.A. where are beds, baths, billiard rooms, reading room, breakfast room, etc. Greatly enjoyed a good hot bath. Had only broken sleep & not too much of that. Again a heavy frost. \n","202":"\n\nBeautifully fine & clear. In St. Omer on the go until 2 o’clock when the last train left. Had been able to get light breakfast & lunch at the Y.M.C.A. McClintock from South travelled by the last train & we had a yarn before it moved off. The journey was thro’ Audriques, Calais, (Etaples) Abbeville to Longpre, & while the light lasted (sunset abt. 4.45) was very interesting. Harvesting of beet & other roots in full swing : ploughing for winter going on, (one-way ploughs, i.e. reversible mouldboards, being chiefly used) : low-lying land round St. Omer a network of small canals & ditches, but south of Calais much more broken country. Light had just gone when we reached Etaples but I was interested in the changes there. Very cold travelling. Reached Longpre at 10.30 & found groom with horse for me, but he lost the way & did not know the name of the town we were billeted in : after a lot of aimless wanderings reached Bde. H.Q. at Brucamps at 3 a.m. Heavy frost again. \n","203":"\n\nVery heavy frost & cold morning & day, but with no rain. Breakfast at the usual time & was rather sleepy after the previous 2 night’s broken rest. Had to get the gear away by 8.30 : it was to go on a 2 day’s journey while we rested 1 day & went the double distance by motor bus the following day. Had to remain in during the morning in the absence of the brigade major & others, & was glad of a fire in the mess room during the day. It did not seem much like a Sunday.\n","204":"\n\nAn overcast night & no frost, but nevertheless quite cool. Early breakfast & then marched abt. 2 miles to the starting point where we got on motor busses & lorries driven by French soldiers. The sight of the 300 or 400 busses gave one new insight into the resources of the Allies. Some of the drivers were blacks (?Senegalese) & as we journeyed through part of the French area we saw many of these troops. The route lay through the outskirts of Amiens, along the Somme to Buire, & the drive, if cold, was better than marching. Owing to the mist one saw very little scenery. Having left Moufflers at 10 we landed at Buire at abt. 2 p.m. & thence had a 5 mile march to Fricourt where was a very poor apology for a camp. Got in by dark & was quite ready for a good tea before turning in, Cuthbert & I having a tent between us. \n","205":"\n\nA cold miserable day with MUD everywhere, & a good deal of drizzling rain. Left Fricourt abt. 9 o’c. & very slowly & with many blocks made our way along crowded roads, indescribably muddy, to a hillside close to where Mametz once stood. Here was another sort of camp capable of giving shelter to abt. 50% of our brigade. We reached it abt. 2 o’clock & found the mud simply awful. 5 of us had a tent pitched in the mud, & were fortunate to have that much. Although within distant shell fire, here was a brigade massed together, but no shells came over. In spite of all the hardship & discomfort the men were cheerful & in a remarkably short time made some sort of shelter for themselves, some digging dug-outs in a bank, others covering shell-holes with waterproof sheets, & so on. After some hot tea turned in & slept well. \n","206":"\n\nDull & threatening morning with rain later in the day : miserably cold & MUDDY. During the morning stayed in the tent & got my Xmas cards away. In the afternoon went up some distance towards the line to try & find an unoccupied tent to bring back, but without success. A cold night again & during it a number of enemy shells landed round about us. In one short break in the weather counted 38 aeroplanes up & abt. 20 sausage balloons. \n","207":"\n\nRain during the night & miserable during the day, the mud being even worse if that were possible. Took a walk round in the morning & in the afternoon went up on to a hill close by whence one obtained a fine view of the heavy artillery, a very impressive sight, the whole slope being speckled with it. Clear for a short time about nightfall, but then rain came on again later. \n","208":"\n\nStill cold, wet & muddy. Drizzling rain driving in everywhere, & more mud than ever. Hardly possible to do any work during the day, but walked round a good deal mainly for the sake of the exercise. The General came back from division in the afternoon, & 4 of us had to move out of the bell tent into a tarpaulin shelter. \n","209":"\n\nA bitterly cold night but got a good sleep. One or two showers during the day but in general it was fairly fine & our planes were not slow to take advantage of the opportunity of spying out enemy territory. More or less on the spot all the day with very little to do. Mud still atrocious. \n","210":"\n\nA day most unlike a Sunday : it seems ages since I have had a real Sunday. Awake at 4 a.m. to go up the line with the General. A cold dreary morning, the horses being 35 min. late in arriving from the transport lines so that it was after 5.30 when we left the Mametz camp on horseback. Our route for abt. 3 miles way along a road in a fearfully sticky & muddy state & as my pony was frightfully lame my progress was painfully slow & delayed the General. Horses left at Bde. H.Q. & thence pushed up the 2 mls. to the line & right round it, really a tremendous task, increased by reason of rain coming on so that by 10 o’c. & reaching camp I was wet thro’, also cold & hungry. The 3rd Bn. band was struggling thro’ \"O God our help in ages past\" at a very wet church parade. 2 bus. had moved off & we had to get things packed & ready to move off by lunch time, 3 of us walking & arriving at Bde. H.Q. abt. 3.30, the rain then having stopped & the sky cleared. 4 of us in a chalk dug-out, & slept well, tho’ very cold outside. \n","211":"\n\nA most distressingly miserable day which for the front line men must have been the absolute limit. Throughout the night a battery of 4.5 hows. just outside H.Q. barked & brought down bits of chalk &c. each time, to say nothing of jarring & shaking us as we lay. During the morning a biting cold wind with showers at intervals reminded us of winter, & in the afternoon heavy rain continued incessantly so that the sea of mud extended its borders, if that were possible, & dug-outs & trenches were afflicted with landslides everywhere. How the front line men hang on under such conditions makes one wonder, for on Bde. H.Q. we are comparatively cosy & comfy. Cuthbert left for Division, Newth of the 4th taking his place. \n","212":"\n\nA good deal of rain during the night. Up at 4.30 to go up the line with the General. After a cup of tea had to wait some time for General Walker to come along, setting out about 6 a.m. Strong cold wind but no rain during the morning. The ground was quite a bog & the trenches in an awful state, the sides falling in on all hands & the mud & slush being in places up to the groin. Dugouts of course were flooded excepting where they had quite fallen in, & in the trenches were rifles, equipment & all manner of gear, simply smothered with mud. And yet shortly after the sun had appeared the men were all bustle & seemed as cheerful & happy as possible. General Walker soon turned back, but the Brigadier & I were along the line for a long time, arriving home wet & muddy abt. 11 o’clock. Had to lie in a blanket & get breeches dried as well as possible, the afternoon, with the exception of 1 or 2 breaks when rain & hail fell being clear & fine. One of the men counted 52 aeroplanes up, besides 20 odd sausage balloons.\n","213":"\n\nUp at 4 & breakfast by 5, then up the line with the General & Major Dyer. The morning was fine but towards midday the sky became overcast & a little rain fell in the afternoon which was followed by a wet night. Conditions up the line were simply awful, & we arrived home in a fearful state, mud everywhere. Stood by here during the afternoon, there being very little to do. \n","214":"\n\nThe General did not go up the line in the early morning so I was able to sleep in until 7 oclock. The morning was very misty & there was drizzling rain throughout the day, the one or two bright breaks being most enjoyable. On the go looking after minor jobs. \n","215":"\n\nUp at 4 & went up to the line with the Brigadier, the morning being fine. There was some rain about midday & then a clear beautiful afternoon very fully taken advantage of by our own & the enemy aeroplanes. They somewhat resembled a swarm of mosquitoes : the enemy planes were very bold & seemed rather to do as they pleased. \n","216":"\n\nUp at ¼ past 3 & had a long tramp with the General, meeting Colonel Blamey & Cuthbert. Heard from latter that his brother died of wounds 2 days previously. Back about 9 & pottering about during the day, abt. 3 o’c. in the afternoon having to again go up the line to select a site for a forward dump. Ran into some hot artillery fire & had several very narrow escapes, coming through, however, untouched & thankful to reach home about 7 o’c. \n","217":"\n\nA minor operation on our front was attempted just after midnight last night, the artillery fire from neighbouring batteries being very heavy. Our attack was held up, our losses totalling abt. 150 all told. The morning was showery, then the sky cleared & a cold nipping wind sprang up : about the coldest day we have yet had. The General did not go up the line in the morning but in the afternoon I went with the Brigade Major up to the two Bn. H.Q.s just missing a shelling. A heavy barrage & an attack by the 2nd. Aust. Div. on our far left took place during the morning. \n","218":"\n\nUp a little before 4 o’clock & set out with the General, but owing to the darkness & greasy going caused by the drizzling rain, progress was so slow that the General soon decided not to go on, so we turned back & went to bed again. About midday we went up to Bn. H.Q. getting back for a very late lunch. There were some showers & a little hail, but in general the weather was fair. A mail came in from home & was oh so welcome. \n","219":"\n\nA most miserable day to adequately describe which would be difficult. The rain was icy cold & drove in everywhere, falling in torrents occasionally, then giving place to hail, then to sleet. The mud was worse than ever & one felt full of pity for the poor frontline fellows. The General did not go up the line so I was hardly out at all. \n","220":"\n\nA fine day in general, bright patches of sunshine being most cheering, sandwiched between the driving showers. The cold S wind continues. After breakfast set out with the General during a spell of rain, but did not go past Bn. H.Q. which was fairly heavily shelled while we were there, Bde. H.Q. also receiving some attention during the afternoon. \n","221":"\n\nA simply glorious day, bright & clear with quite a fair amount of warmth in the sun. During the morning there was a breeze but later even this died down. Underfoot the mud was of course atrocious, but the bight sunshine did a world of good in reviving the spirits of the men. Aircraft were of course exceedingly active 2 of ours & 1 of theirs being brought down during the day : the enemy showed quite an unusual amount of boldness & daring. About midday went with the Bde. Major to 4th Br. H.Q. in Delville Wood & on coming home very narrowly escaped a meeting with a 5.9 shell. Full moon & clear night when turning in.\n","222":"\n\nAgain a perfect day with a clear cloudless sky & warm sunshine, which, like yesterday was most appreciated by all. The mud was still very bad but is slowly drying up : if only the weather continues good the ground will enable a fresh push to be made. Was up at 4 a.m. to go up the line with the General, & as the moon was full & the sky clear going was quite good. Only went to Bn. H.Q. & reached home abt. 6.30. Much aerial activity during the day, at least 1 German being brought down in flames. \n\n"}}