{"Document Name":{"0":"Diary_0085","1":"Diary_0085","2":"Diary_0085","3":"Diary_0085","4":"Diary_0085","5":"Diary_0085","6":"Diary_0085","7":"Diary_0085","8":"Diary_0085","9":"Diary_0085","10":"Diary_0085","11":"Diary_0085","12":"Diary_0085","13":"Diary_0085","14":"Diary_0085","15":"Diary_0085","16":"Diary_0085","17":"Diary_0085","18":"Diary_0085","19":"Diary_0085","20":"Diary_0085","21":"Diary_0085","22":"Diary_0085","23":"Diary_0085","24":"Diary_0085","25":"Diary_0085","26":"Diary_0085","27":"Diary_0085","28":"Diary_0085","29":"Diary_0085","30":"Diary_0085","31":"Diary_0085","32":"Diary_0085","33":"Diary_0085","34":"Diary_0085","35":"Diary_0085","36":"Diary_0085","37":"Diary_0085","38":"Diary_0085","39":"Diary_0085","40":"Diary_0085","41":"Diary_0085","42":"Diary_0085","43":"Diary_0085","44":"Diary_0085","45":"Diary_0085","46":"Diary_0085","47":"Diary_0085","48":"Diary_0085","49":"Diary_0085","50":"Diary_0085","51":"Diary_0085","52":"Diary_0085","53":"Diary_0085","54":"Diary_0085","55":"Diary_0085","56":"Diary_0085","57":"Diary_0085","58":"Diary_0085","59":"Diary_0085","60":"Diary_0085","61":"Diary_0085","62":"Diary_0085","63":"Diary_0085","64":"Diary_0085","65":"Diary_0085","66":"Diary_0085","67":"Diary_0085","68":"Diary_0085","69":"Diary_0085","70":"Diary_0085","71":"Diary_0085","72":"Diary_0085","73":"Diary_0085","74":"Diary_0085","75":"Diary_0085","76":"Diary_0085","77":"Diary_0085","78":"Diary_0085","79":"Diary_0085","80":"Diary_0085","81":"Diary_0085","82":"Diary_0085","83":"Diary_0085","84":"Diary_0085"},"Date":{"0":"unknown","1":1249.0,"2":1250.0,"3":1251.0,"4":1252.0,"5":1253.0,"6":1254.0,"7":1256.0,"8":1257.0,"9":1259.0,"10":1260.0,"11":1266.0,"12":1267.0,"13":1268.0,"14":1269.0,"15":1270.0,"16":1275.0,"17":1276.0,"18":1277.0,"19":1281.0,"20":1282.0,"21":1283.0,"22":1284.0,"23":1285.0,"24":1286.0,"25":1287.0,"26":1288.0,"27":1290.0,"28":1291.0,"29":1293.0,"30":1294.0,"31":1295.0,"32":1296.0,"33":1297.0,"34":1298.0,"35":1299.0,"36":1300.0,"37":1302.0,"38":1303.0,"39":1304.0,"40":1305.0,"41":1306.0,"42":1307.0,"43":1308.0,"44":1309.0,"45":1310.0,"46":1311.0,"47":1312.0,"48":1315.0,"49":1316.0,"50":1318.0,"51":1319.0,"52":1320.0,"53":1321.0,"54":1323.0,"55":1324.0,"56":1325.0,"57":1326.0,"58":1327.0,"59":1328.0,"60":1329.0,"61":1330.0,"62":1331.0,"63":1332.0,"64":1333.0,"65":1334.0,"66":1335.0,"67":1336.0,"68":1337.0,"69":1339.0,"70":1340.0,"71":1341.0,"72":1342.0,"73":1343.0,"74":1357.0,"75":1358.0,"76":1359.0,"77":1360.0,"78":1361.0,"79":1362.0,"80":1363.0,"81":1364.0,"82":1365.0,"83":1379.0,"84":1380.0},"Entry":{"0":"\n\n","1":"\n\nOrders were issued to leave Camp at 5 a.m. on Friday 10\/5\/17 at Bordon in Hants. Naturally excitement was high amongst the boys at the thought of leaving for France. The day passed of gradually, some writing letters & others packing their Kits after Tea we were paraded at 8 p.m to receive our Rations for 24 hours which consisted of 4 Rounds of Bread & Meat & our Water Bottles full of Tea. After receiving same we were dismissed for the night & prepared ourselves for rest but as I anticipated we had very little sleep. The sappers in our hut had previously decided that they were going in for some skylarking with the result that all hands had to join in the fun. As our beds were in two partitions the boys could pull out the front portion & double it over the back portion when one was in bed. This skylarking mingled with Singing was kept up till nearly 2 a.m. when they exhausted themselves & all hands settled down for 1 hours rest as Reville was sounded at 3 a.m. Breakfast was served at 3.30 am & we paraded\n\nat 4.40 am","2":" When everything was ready we marched out of Camp at 5 am, carrying our Kit Bag to the Station, we were all glad to arrive at the Station as our Kit Bags were very heavy & having our Heavy coats rolled up & across our Right shoulders we had to carry our Kit Bag on our left shoulder all the way. We arrived at the Station at 5.30 am & was lined up on the Platform. When the Train of 12 coaches was shunted to the Platform we formed ourselves into parties of 10 for each compartment & on a whistle being blown we all entrained. Our Coy in the front portion 254 strong & a Coy of Royal Engineers 254 strong in the Rear. On the stroke of 6 am we moved off on our journey. After a few minutes run we arrived at Bently. After the Engine ran around to the rear portion we started off on a different line, having a Time Table I soon found out what directions we were going. The Scenery along the line was grand to gaze on. As it was spring Time the foliage & Trees & grass dotted here & there with Houses of Bricks & Red Roofs made a lovely panorama. In the Fields one could see a \n\nlarge numbers of partridges & Rabbits running about. All the crops were about 3 inches high & coming on well. On passing through Ropley Station the Ornamental Trees were trained & cut into the shape of a spire with an imitation Rooster on Top, other Trees were like a bottle shape doing great credit to the Station Master in charge. A Station called Northam roused a cheer from the Boys as nearly all hands were acquainted with a large Town in Western Australia of that name. After passing through several stations we arrived at Southampton at 7.50 am after twisting & shunting around several buildings we entered the Dockyard Gates & into a large shed when we received the order to detrain & form up into our platoons, after Orders of our Boundarys were read out we were dismissed & allowed to ramble about the Docks for a while & see the Sights. On my rambles I noticed a Hospital Ship named the Glocester Castle which had been Torpeoded in the Channel, one could see at a glance the hole it made by a large patch of wood put on the side of the Ship; A large number of women were \n\nemployed by Coy to clean all the Fittings which had been damaged by the water after the Explosion. I had an invitation to inspect the damage done in the Engine Room. It appears the Torpedo hit the ship on the Starboard Side amidships & exploded in the Engine Room. Twisting & smashing the Machinery also infortunately killed two Engineers & a Greaser. As all the Water Tight doors were closed instantly helped to save the Ship & she was towed into the Docks. On going in another direction I had a look in at the women taking the levels of big Guns in a large building. As several units arrived during the morning the space of our liberty was considerably cut down & a strong guard was placed outside the sheds & we had to amuse ourselves the best we could. On having a good look around I noticed drafts of several units namely. Canadian Railway Construction Corp & a Coy of Royal Garrison Artilllery. Also Royal Horse Artillery with a large number of horses. I was given to understand that about 2000 horses were loaded on to different boats during the days & of what I \n\nsaw of them they all were pure bred & fine specimen’s. I had a good look at a Dry Dock which contained a Hospital Ship which was receiving a general Overhaul. As this was my second Dock I had seen naturally I was interested. Parade was called for at 5 Pm & after falling in & the Roll called we were marched off at 5.40 Pm out of the Shed & across the Dry Dock & along the Wharf to our Boat arriving there at 5.50. The name of the Boat was “Mona’s Queen\" a Paddle Steamer of 20 Knots. We were marched on board & down below to the Second Deck & placed our Kit Bags & other effects on the Sides & in the Centre & then up again on deck to receive our Life Belts all the other units doing the same. At 7.50 Pm the Boat left the Wharf & proceeded down Southampton Waters, the Sights passing down the Waters were very interesting to us all. Netley Hospital was passed on our left, a Magnificent Building with spacious Lawn’s running down to the Waters edge. I would have like to have had a closer view also further down Portsmouth Barracks was also passed on our left, another fine\n\nbuilding. After passing through Portsmouth we arrived at a narrow channel where a Four Funneld Hospital Ship was anchored. At the Mouth of the Channel on each side was a Barge with Torpedo Nets stretched across it a Foot & along to the shore to keep out Enemy Submarines. At dusk every night a Net is drawn across to each Barge completely closing the waters. As the light was fast drawing in & we were proceeding out to sea I could not see the number of Boats in our convoy, but still there were a large number with Torpedo Destroyers on both Sides. We passed the Isle of Wight on our starboard side & proceeded across the Channel at full speed, doing about 20 knots. Our Boat made very little motion & nobody was seasick as the Sea was calm. As we had a long day previous the Boys were all tired out & laid down anywhere to sleep down below & up on Top. As for myself I could not rest so wandered about till nearly 2 am on deck when La Havre Lighthouses were sighted. I then laid down & had a sleep until 3 am when we passed them & proceeded up the River\n\nSeine to a Wharf alongside of No.2 General Hospital tying up to the Wharf at 4 am. I then had a sleep till 6 am when Tea was served out to the Troops with Biscuits & Bully Beef. Before we went ashore the Nurses of the Hospital came out on the Balcony to see us & as there were several Australian Nurses the Boys soon started Cooeing to them which they acknowledged. This Hospital is built alongside of the Wharf & has one storey. The Hospital Trains run right inside of the Ground Floor, & all serious Cases are taken upstairs by a lift & the rest are placed straight on to the ship for transport to England. On the opposite side of the River is a large number of Buildings, Shops & Dwellings. We were all marched ashore at 7.30 am & at 8.30 we started off to our Camp, our Kit Bags were loaded into Transport Wagons. After a long March of 5 miles we arrived in No.1 Rest Camp. On passing along the Wharves & sheds we had our first glimpse of German Prisoners working in the Sheds & outside. After passing over several Canals we marched through the streets which\n\nwhere very dirty. The Roads were all paved with square blocks of stone making it very hard on ones feet. Several Cafes passed had English spoken written on the windows. The Customs of the People were very dirty. The slops of the Houses were thrown out into the Gutters & dirty water laying everywhere. There were several fine buildings to be seen on the way. We passed a large Church, where a Bell was tolling & a Hearse standing outside & over the front Door a large black cloth was hanging, the Mourning Coaches were around the corner in the next street. A Funeral service was being held inside. As our camp was right on top of a Hill it was a stiff climb but still the Scenery & Private houses were a grand sight to us. \n\nThe Walls in front of several houses were about 8 ft high & Pear Trees were trained up the Sides & in the Gardens very large cherries trees were growing having a large leaf & white Flowers. On reaching the Top of the Hill we were halted for a spell \n\nnear a long Water Trough & several of us had a sit down on the Sides. After sitting on the side a few minutes I started to fill my pipe when I over balanced myself & fell backwards into about 2 inches of water, causing a great laugh from the boys. I took it all in good part & made the best of my mishap. Naturally I had to continue my march into Camp with Wet Trousers which I soon changed. We arrived at our Camp at 11 am & was tolled off into parties of 14 for each tent. Then the grumbling started, too many men in one Tent, still we had to make the best of it. After we had our Dinner of Iron Rations we had to empty our kits out on our Water Proof Sheets for Inspection by our O.C. Then we were dismissed for the Day. This Camp is on the Flat portion of a Hill overlooking the Entrance to La Havre & commands a splendid view. one could see a large number of steamers each day anchored outside, waiting a Berth which had arrived at Night time. In one corner of the Camp is a large Grave Yard, on our left is a large Compound containing.\n\nGerman prisoners who are employed about the Camp & making & repairing the Roads in the vicinity. They caused a lot of amusement first to our boys but they eventually got used to them. As no leave was granted to the Troops to go into the Town also as we had not been paid for some time, we took it in good spirit. Still some broke camp & went for a stroll. As for myself I went out once for a stroll for about a mile, but as I could not speak French & had no cash I soon went back again. \n","3":" Morning","4":"\n\nMedical Inspection took place at 9 a.m. by the Chief Medical Officer, we had to show our Arms & hands. At 11 a.m. the Camp Commandant inspected our tents & kits likewise ourselves & then we were dismissed for the Day & passed the time away laying about chatting. In the afternoon a large Air Ship passed over head very low down also several Airplanes in fact they were continually flying about scouting from the Sea & up the River. The Seaplanes were a sight to look at, planing down on to the water & rising again \n","5":" passed off quietly, nothing to do & all day to do it in.","6":"\n\nAt 10 a.m. a large number of Machine Gun Troops with a Brass Band & 60 Coy of the A.R.O.D. marched into Camp in dirty weather, raining on & off all day. All hands gave 60 Coy a cheer on their arrival & after they were allotted their Tents they were dismissed & soon both Corps were together again relating their trip to each other. \n\nWednesday.16\/5\/17.\n\nAfter Breakfast we were paraded for a Route March through the Town. At 10.30 a.m. the Bugle sounded & we formed up in our Platoons & marched out of Camp & followed the Train Route down the Hill on the way down we were further charmed at the beautiful scenery & private Residences as we passed the Casino a very large building some one Cooed & several Nurses came out & cheered us they were Australians & the Casio was being used as a Hospital, we noticed a few of our Lads walking about, as the streets were very narrow & not to clean & the Roads very rough we soon began to feel tired. \n\nWe continued our March until we reached the Esplanade which is fairly wide & nicely laid out we passed another Hospital were one of our Coy was & he came out to see us, so we gave him a cheer also the other Tommies, along the Esplanade we passed several Pretty French Ladies also Belgian Officers & Men who had been laid up & now convalescent. After proceeding some distance we turned up a street & up hill we went back to our Camp, arriving there at 12.30 Pm with a good appetite for Dinner. At 2 P.m. we formed up again & went for another route March This time through the Agricultural portion of La Havre were a great treat was in store for us after leaving the Town we made off along a long road only about 15 ft wide & crops of all descriptions. People here don’t bother about dividing fences the crops are all open likewise Vegetable plots & the Men & Women were all busy digging & planting. We passed a fine crop of Barley about 3 ft high & growing strong. After walking some distance we were halted for a spell for 15 minutes alongside\n\na small pine Forrest, on resuming our March we came to the end of the road & on to the Cliffs which were very high & commands a splendid view of the Sea. An old wreck was lying some distance out & judging by the Colour of the hold, it looked like a Hospital Ship. After retracing our steps some distance back we turned up another Road & passed the Royal Garrison Artillery Camp which contained a great number of Guns, Limbers & Mules, this Camp is a very large one alongside of the This Camp the Train line was running & we followed it up hill & eventually arrived back at our Camp at 4 Pm when we were dismissed for the Night. \n","7":"\n\nNo Parade in the Morning so I spent some time down at one end of the Camp chatting to a Belgian Soldier behind the Wire Fence in a Belgian Hospital for Convalescent Soldiers, as he could speak fairly good English we made ourselves understood, there were several men with one arm & one Leg & looking very haggard which no doubt showed the rough time they had been through. After Dinner we packed up our Kits at 4 Pm & had Tea at 5 Pm & \n\nmarched out of Camp at 6 Pm for the Railway passing through several streets which contained a lot of People we began to arrive in a better class of “streets\" & Houses, along one street we passed a large number of German Prisoners under a strong escort, they all seemed in good health & condition & appeared to have been fairly well fed & clothed. Several had a smile & appeared to be pleased to be out of the Conflict. We arrived at the station at 7.40 Pm after walking about 4 miles. As I was one of 25 picked out as advance Guard we had to draw rations & load them on to a truck to be given out en route, After the Kit arrived by Motor Lorry & we unloaded, we had to load them into a Truck with the Rations, & then at 9 Pm we entrained ourselves into Coaches holding 40 men each. Before the Train left we amused ourselves watching a large number of Mules being loaded into Trucks. 8 in each truck, 4 at each end. They were very stubborn & gave the Tommies a lot of trouble jumping about much to our amusement, the Tommies would lead\n\none Mile up to the Gang Way & then a Rope was passed behind the Mule’s Hind Legs & the Tommies would haul him into the Gang Way & up the Mule would go. At 12 midnight our Train which contained our Coy (59) also Coy 60 also a Coy of Tommies. Artillery Boys. The Train consisted of about 20 coaches, Covered Vans & a number of Waggons containing Guns. We travelled during the night very slow averaging about 15 miles per hour passing Rouen during the Night at about 12 noon we passed through Abbeville, a large Town where a large number of Japanese were building a new Railway also a lot of German prisoners working on an embankment. The Country & Scenery en route was beautiful. From what I have seen France has very little unoccupied Land, every available piece was under cultivation of some kind. Abbeville has a very large Locomotive Depot & we expected to be detrained there, any how we were dissapointed as after a few Minutes stoppage for Loco Purposes we left again at 12.15 Pm & still going slowly we arrived at Etaples \n\nat 2 Pm, after a stay there for 30\" we were off again & arrived at Centreau at 4 Pm where a large Iron Works is in full swing. A large number of French Women could be seen working about, some with Shovels & others with Wheelbarrows. They were all dressed in Trousers & looked comical to us, they all seemed to be of a hard working class of women. On proceeding further on for some little distance we crossed the River La one could see several Bridges built of stone fairy low only allowing Barges to go up & down the River. At 4.40 Pm we arrived at Boulogne & had a 10\" spell. This is another fine Town & contains another large Loco Depot, Leaving there at 4.50 Pm saw a large Air Ship Hangar but could not see the Air Ship but noticed several Anti Air Crafts Guns about for the Ships protection. We arrived at Calais at 6 Pm. we steamed through the Goods Yard & did not go near the City much to my dissapointment. There is a long Canal which\n\nruns paralell with the line for a long way. There were a large number of Barges & Tugs proceeding in both directions. After passing through Audruick we arrived at Watton at 7 Pm & had to detrain there as we had been overcarried & ought to have stopped at Audruick. Arrangements had to be made for our conveyance back again, so we waited & waited & gradually got tired & sleepy & all hands laid down anywhere to sleep some on the Platform, some under the shelter shed & some inside the station. I found my way in to the station & slept for about 3 hours at 3 am Tea & Rations was served out to the boys who were all in a very bad humor, nobody seem to know who was at fault for our position. At 4 .20 am our Train arrived although Trains were passing both ways all night the Station Master did not have the power to stop any going in our direction. Anyhow at 4.40 am we left for Andruick & arrived there at 5 am & after detraining & forming up we marched across the line into our Lines & Tents & after \n\nwe had our Tents alloted to us we soon made ourselves comfortable & turned in for a few hours sleep. At 10 am we had some more Tea & Iron Rations & then at 10.30 am were marched over the line to the Depot Head Quarters to give in our names & what Railway Experience we had. This was necessary so as we could be placed in our positions. After Dinner all the boys rested, & after Tea I had my first stroll in the Village near by called Audruick, On leaving our Camp we take a narrow Road bounded on one side with a Crop of Wheat & on the other a Fruit Garden enclosed by a Hedge. The Trees are mostly cherries & grow very large & are now loaded with cherries. After walking abut 150 yds one comes to Houses & then around the Corner one finds himself in a large Square paved with Square stone blocks about 2 acres in circumference in the Centre is a Round pavilion & on every Wednesday it is the People’s Market Day Caravans come in from Distant parts to dispose of their \n\nWares. There are a large number of Estaminets (otherwise Drinking houses in fact these places are in abundance all over the Village, Beer can be had for 1½ Per Glass & Wine about the Same. The Streets round about are very narrow & dirty in fact dirty house slops are thrown every where in the Streets. All things in the shops are very dear & the People don’t forget to put up the prices to the Australian troops. We are granted leave after 5 Pm Daily until 9 Pm to wander about. After walking up the Main Street from the Square you cross over the Railway Line & on your left is the Big Railway Operating Division Yards with Engines & Trucks in abundance. All the British Locomotives are brought here to be made fit for Traffic, their rods replaced etc. I believe there is about 500 Locomotives here. In these yards are the Steam Bathrooms, one takes his clothes off in a room & then enters another Room where steam is playing all about & as the Moisture covers the body the Soap is applied, it is very hot but no mistake it brings the dirt out, after Soaping oneself you enter\n\nanother room where Three Hot Showers are & you walk through a Race under them until you come to a fourth which is luke warm & the","8":" is cold to finish off with, it is altogether a splendid idea & quite up to date. After Passing through the Railway yards you come to the Ammunition Dumps which are placed everywhere & are protected by Sand Bag Dumps in between each Dump which is called Hangars. These Hangars have shells & Cartridges of all sizes from boxes of 18 Pounders to Shells of 4ft long by 18\". Down to 60lb by 6\". These hangars are everywhere & are full of Amunition the Roofs are covered with Iron & Sandbags, like wise the Sides. They run from A to Y. On","9":" – all hands in the morning were busy washing & in the Afternoon writing their letters. From","10":" to","11":" we have been loading Shells also sandbags to make more protection from hostile Aircraft. In our Camp on the East Side of the Railway line are Royal Engineers, Canadian Engine Men, also 59 & 60 companies of Australian\n\nEnginemen altogether there must be over 5000 Men in this Depot. A lot of our Mechanics have been employed in the Workshops fitting Engines & Repairs all the Week. We parade at 7.50 am & march off at 7.45 am to the Amunition Hangar’s & work till 12 noon & return for Dinner until 2 Pm & load again until 4.40 Pm when we marched home finished for the Day. Every Evening this week we have been visited by an Aeroplane coming from the West & travelling to the East. He arrives here while we are having Tea, he goes over in the Morning with an Old Aeroplane to England & returns with a new one in the Evening & also drop correspondence to Headquarters here. Yesterday Saturday he gave us a splendid Exhibition of Flying he would hover around & around & then he would soar up a good height & loop the loop for us several Times. It was marvellous work & all hands appreciated his efforts. Once he came down to about 25 ft & we gave him a great cheer. He gives us a display of Volplaning every evening last week but last \n\nNight, it was a real Treat. He would drive straight down & then he would be upside down for an instant & then he would right himself, all these movements being done; likewise his volplaning while his Engine was going & then off he would fly again on his way. Yesterday Saturday was Boxing Competitions for the Boys. A Stand was erected during the Week between the lines which serves as a Cricket ground & after Tea several Bouts were decided. A Contest was being decided when the Aeroplane appeared on the scene & the combatants stopped while the Exhibition of Flying was on. We are encamped in Tents 12 men to each Bell Tent, & we have to sleep very close together of a night. We are crowded too much but still all hands make the best of it & are in a healthy condition. Although the rations are cut down to what we had in England we have to be contented. For Breakfast we get a slice of Bacon & 2 loaves for 12 men a loaf cut up into 6 Parts, less \n\nthan a quarter each, not nearly enough for each Man for Dinner we get a stew of Tinned Meat with preserved vegetables & every other day Rice Pudding. For Tea 2 loaves ½ lb Margarine & 1 Tin of Jam (1 lb) We buy Bread in the village 3 lbs for 8 to supplement our rations. These rations are not nearly enough for the Men so therefore we are all disgusted at being brought here on false conditions. In England we nearly always had enough but here it worse. Now & again we get Biscuits, very hard some of the boys have had their false Teeth broken trying to eat them, & had to go into Calais to get new Teeth. Just close by we have a Amunition Factory & every evening at 6.30 Pm the girls knock off work, they dress comical all wearing very baggy Trousers & we all laugh at them. They don’t care, so there is no harm done. About ½ mile past the works the Boys bathe in the Canal which runs from near the Village for about 1 Mile & then joins another Canal. There is also Fishing done by the\n\nResidents, Silver Bream & Eels are the Fish. I intend next week taking a line & trying my luck. Traffic along the line here is very busy Every Day Sundays & all the Trains are passing as fast as they can some going up to the Fireing line & some the other way. As soon as one clears the Section (short distant one at that) another Train is ready to leave this goes on day & night. The Engines are all of a splendid Type. Belgian French & English. As this Depot is the distributing Centre we are only here temporary until our Depot is ready to receive us. No body knows where it is. There is no Horse Traction done here all Powerful Motor Waggons. Only the Residents’ have horses & some have Donkeys very small, it is fun to see a big French Women driving a small Donkey in a cart, we tell them to get out & push. The other evening a little Donkey in a Cart was tied up to an Iron Gate across the Footpath (3 ft wide) & some Tommies coming\n\nalong did not bother to cross around so they just walked over the Donkey which did not move & the French boy in charge sang out. Num Bong Massuer (meaning (no good Mister). We are gradually picking up the French language by degrees. Up to date I have not seen any French beautiful Women, but I believe that is a Treat in store for us all. The Moving Pictures are all written in French so it is hard to understand them.","12":" passed off very quietly, nothing of any importance.\n","13":"\n\nAs my name was not called out for loading Amunition I had a day off but during the afternoon I was notified for Corporal of the Night Guard having 3 privates for duty. They mount Guard at 9 Pm until 6 am & their work is to walk about between the Companies Tents, & report any unusual \n\nSounds, Fire, & Keep order when an alarm is raised. Two Privates are on from 9 Pm to 12 Mid. 1 on from 12 to 4 am & the first two do \n\nDuty from 4 to 6 am. This work is very easy & one is off duty all day & has not to go & work in the Amunition yards. The First Night passed off quietly except that several boys had what we called a Birthday & kept up arguments to nearly 11 Pm. As Tatts or Roll call is taken every night at 9 Pm all lights are to be out by 9.30 & strict silence is to be observed although a certain amount of latitude is allowed.","14":"\n\nAfter Breakfast I applied for & was granted a Leave Pass to go into the village, it being Market Day from 7 to 12 noon. The Market is held in the large Square. On approaching the Square one is struck by the large number of portable stands containing all sorts of Goods, The arrive overnight from Distant parts. I believe they travel from Village to Village. Pigs are sold in large crates & cattle at one end. There must have been nearly 1000 People made up of fully 90% of Women very near all dressed in Deep Mourning, it brings home to one the results\n\nof this terrible conflict. There were very few men in Civilian Clothes what there were were old Men. A large number of Women were standing in a long line with a small basket in front of them on the ground which contained Butter & Eggs, & people walked up & down the line making their purchases Agents from large Cities come & buy for their Firms & repack the butter & Eggs in large boxes & send them away by rail. Eggs are very dear 2\/6 per dozen & Butter in Francs 20 Centimes for 1 Kilogramme which is a little over 2 lbs. Oranges were 5 C too dear. It was very amusing to see the way they handle the Rabbits, of course they are born in Captivity & they sit in open baskets & not a move out of them, they are handled by their owner & replaced again & they seem quite contented n their baskets. Fowls & ducks have their legs tied & are placed on the ground. Clothes are in some cases are laying on a canvas covering on the ground & dust & filth is blowing all over them, the owners don’t seem to mind. They pay so much for the use of the grounds from 50 Cents \n\nup to 2 Francs. A French goes around & collects the Fees giving a Slip stating how much is paid. After spending about 2 hours wandering about, I made back to camp, very much amused at my experience. At 11 Pm at night we had our first alarm. The Siren blew one long blast, which indicated that Fritz was over our lines, All lights are at once put out & Trains & Shunting operations are stopped at once. Strict Silence in all tents has to be observed. Flashes of light could be seen over towards Ypres, The lads were all interested & some came out of their Tents & others stood in the Door Way looking up. After about 15 minutes the Bugle rang out all clear & all hands retired to their Tents although conversations of possible Air Raids were discussed in several Tents, at 12 Mid Night Silence once again reigned supreme. As the Weather is very clear & Moonlight we can now expect alarms every night. When Fritz with his aeroplanes or Zepplins cross the line the Anti Air Guns ring out in every direction.\n","15":"\n\nAfter resting all day I went for a walk out past the Munition Works & while I was passing the works the girls were coming out. It being 6.30 Pm the time they finish work for the day.There are a fairly large number of Women employed there, they dress strange. They all wear baggy overalls & look like a lot of old Men from a distance. I noticed a few men here & there. After continuing my walk along the Canal I came back through the Village to Camp & took up my duties at 9 Pm. Everything was quiet until when the Siren again blew one blast, in a few minutes shells were exploding away to the North and Search lights were seen in several directions. The Shells were exploding up very high & gradually worked around in a Westerly direction likewise the Search lights were playing up amongst the clouds looking for Fritz who evidently was somewhere about. The Siren sounded at 11.35 Pm & the Shellls were bursting in the Air until after 1 am. No doubt it was a great sight, & reminded me of a Fire Works display.\n\nAs nothing happened worthy of note between the 31\/5\/17 to the","16":" I skip over these periods. It was a very hot & muggy day on","17":" Thunder could be heard a long way off but gradually it came closer until about 5.45 Pm when the Thunder & Lightning over head was very strong Rain began to fall at this time & a general down pour lasted until for over an hour the water rushed around the Tents & in some cases it overflowed into the Tents, all hands kept to their tents & passed the time away singing. Although trenches of 6\" had been dug around each tent they soon overflowed the water under our flooring gradually arose until it was level with the Boards but did not overflow. The Lightning was very vivid & was dancing about in all directions, as soon as the storm passed off the water soon was clear of the Camp & the Lads walking about soon stirred up the mud & the place was in a terrible condition. As there were no wind no damage was done to the Camp. Having the position of Corporal \n\nof the night picket, I now occupy the Tent which the Company’s Bootmaker does his work in, he sleeps in the Tent & being an old friend of his, he invited me to keep him Company, his name is Corporal G. Wiltshire & a good companion so were are very comfortable being the only two in the Tent. I can have a good rest every day. I take up my duties at 9 Pm I can always have a few hours rest in the early Morning.\n","18":"\n\nOur Friends the Canadian Broad Guage operating Company No 58 received word to pack up & be ready to march out of Camp at 9 am. They were very busy this morning getting ready & we mingled amongst them saying Good Bye to several Boys who had been great chums while in our lines. They are very much like us in their ways & habits. Their Twang amused us very much. They use the words Gard Darne very frequent & Sure & I Guess, when I am having a Chat with them their Twang amuses me as a rule more than the yarn they tell. All our boys like them very much & we trust to meet them again.\n\nI believe they have gone to a place called Strazeele about 30 miles from. If rumor is true we are going to Borre a big Railways Junction of 4 lines about 1 mile out of Hazelbruick a big town, we are going about Saturday. Strazeele is further on about 3 miles so we may yet meet the Canadian Boys again. As the boys marched out of Camp our lads gave them a good Cheer as they moved off & it was just as heartly returned as given. I then went over to have a Hot Bath on my way over I heard Guns firing in several directions up in the Air. Although we could not see any Taube Aeroplanes they being to high we could distinctly see the Shrapnel & High Explosives shells bursting around. The bursting of the Shells got further away as the Anti Air Craft Guns took up the firing so therefore Fritz must have been having a Fly for Observation purposes, after a little while Shells were bursting in another direction, First in the South then West & around to North where the bursting of the Shells became fainter until\n\n \n\nthey were out of Sight. While Tea was on a humming Sound could be heard & on looking up a large number of Aeroplanes could be seen flying in a South Eastern direction. I counted 12 in all & they were very high up & looked grand gliding along so gracefully no doubt they were out Scouting for Fritz.\n","19":" 1917\n\nOrders came out that we would depart at 8 am next Morning for our permanent Headquarters. All day we were loading up equipment & stores into trucks over in the Railway Yards. After Tea I went into the Village to buy a few articles & went around to say Good Bye to some French People who I was introduced to by a Belgian Sergeant. These people have an Orchard of 5 acres under cultivation which unfortunately is sadly neglected for want of labour cherries & Pear are in abundance also strawberry, Raspberry & Gooseberry bushes everywhere. Having spent 2 hours I said Good Bye & thanked them for the kindness they have extended to me. I made my way back to Camp to took up my duties for the last time.\n","20":" 6\/17\n\nReveille was sounded at 5 am all hands soon was busy packing up their Kits & carting the Flooring from the tents over into the trucks to be used in our new Camp. Breakfast was served at 7 am & we all had to parade at 8 am. The Railway Operating Division Band came over to play us out of Camp. At 8.30 am we marched off behind the Band which played a Familiar Air (Here we are again) We were cheered by No 60 Company N.S.Wales Boys as we departed & we returned the cheer. After Marching with our Kits on our back for about ¼ Mile we arrived at our Train. What I mean by our Train it was our own trucks and Engine also one of our Drivers & Fireman. The Engine Number was 2763 a Midland Railway Company’s Engine. I omitted to state on the Saturday previous 5 sets of Engine Men was sent away with 5 Engines to our new quarters also our Armed guard. They were to be employed in erecting the new tents. After we were all placed in our trucks & the Balance of the Material was loaded we were pulled\n\nout of the yard into the large Marshalling yard were a large number of Small Engines loaded on D Trucks were attatched to our Train. At 9.30 am when all was ready we departed on our journey, travelling very slow having been up nearly all night I laid down on my Kit & soon was fast asleep. At 11 Pm we arrived at St Omer a large city which was crowded with Soldiers from all parts. The City has several fine buildings very large & the Country around it was a treat to gaze on, nearly every available piece of ground was under cultivation, Potatoes, Sugar Beet also Wheat everywhere. The Land everywhere is very fertile & the gardens are now looking at their best, the Peasants are very industrious & are seen everywhere in the Fields, After the Engine had taken water & line clear ahead was given, we left on our journey & arrived at Hazelbruick at 12.15 Pm another large City likewise a Locomotive Depot which contained a great number of Engines. Tea & Iron Rations was served out to us here also a Truck of Oranges which were on a Road very handy, Our Boys soon helped themselves\n\n& we all enjoyed the Oranges after the Biscuits & Bully Beef. We were here for nearly an hour during which time several train loads of Soldiers passed up going in different directions. Two Hospital Trains full of wounded soldiers passed up going to Calais. Hazelbruick is a Junction four lines branch off here, one to Dunkirk, one to the Arras District one to Abbeville, & the last up to Popering which was our direction. At 1 Pm. we left for Borre another Loco Depot, while travelling along we could see a very large number of Motor Lorries loaded up going along one could not see the Head or the Tail as the Convoy was to large. After a few minutes run we arrived at Borre where we shunted off the Small Engines into a Siding we had another long wait there & eventually arrived at our new Camp at 4 Pm Peselhouke is the name of our new depot there are only at present a few Roads & a platform. Our Camp Site is about 3 chain from the line, a small crop of Wheat is in between. Here we heard \n\nfor the first time the Big Guns booming nearby as we are only about 5 miles from the Fireing line. The concussion now & again makes the Earth Tremble. After placing our boards in our tents we had our Tea which the Cook who had proceeded ahead of us had provided. A few yards away from our Camp is another Camp which had be vacated by the artillery who had a few days previous had been shelled by Fritz killing several horses. Our Boys soon wandered around & commandeered pieces of Timber also several Safes & Tables which the Artillery had left behind, & they were all busy erecting places to have their meals on. As I occupy the Tent with our Bootmaker we both brought over a stretcher each & we utilised the bags what the new tents came in as coverings we soon made ourselves snug. Having no flooring I brought along several lids of Cases & nailed them together & made a flooring. Our Tent is a Real Home from Home. We are surrounded by bush several lads sleep out in the open. Up to date there\n\nis two little houses built by the Boys of old timber & Iron & several more are under construction. Near the Railway platform we found a large heap of Tins with handles on which formly contained Gun Powder, they make excellent buckets for carrying water & each tent had two or three. At present we have to carry our water some distance from a Soak, we must not drink the water as it is too brackish. Our first Evening was spent in watching the Observation Balloons & Aeroplanes. Those Balloons are everywhere they are shaped like an egg & had 3 flaps like Rudders one on each side & one on the Top at the rear. They have a long chain also a Telephone Wire all worked from a large Motor Car, the go up about 20000 ft in the air. As it is daylight now from 4 am to 10 Pm we have plenty of time in the Evening watching the Sights. At about 8 Pm we heard a lot of Explosions in the air which was our Anti Aircraft\n\nGuns fireing at a German Taube Machine which was very high up in the Air & looked to the naked Eye like a spec. The High Explosive Shells bursting all around it. The Taubes are soon driven back over their lines.","21":"\n\nAll day long a lot of the boys were busy unloading Material from the trucks & building a Telephone Room also a Blacksmith Shop & others continued building places to have their meals on, all sorts of boards were brought in, some where doors which they made use as tables & pieces of Canvas from everywhere were put up for shade during the afternoon I had a rest & after I had Tea I took a stroll into the Town of Poperingie about 2 Miles away. Our Camp lies in about 100 yds from the Main Road. This Road is made of Square stones blocks & very hard to walk on, it is an everlasting Road & I believe it continues on to Brussels, as we are now some miles in Belgium the People all speak Flemish & we can understand them better than we did in France. The Traffic along the Road is very heavy consisting of Motor Wagons\n\nTeams of Artillery also teams of Amunition one after the other all making towards the fireing line each man wearing a Steel Helmet & carrying a Respirator in Case of Gas Attacks. Right behind us & into the Town are soldiers of all sorts & Camp’s, in fact the place is alive with Soldiers, some going to the Trenches & others coming in for a spell. I passed several Estaminets (Beer Shops) & they all had written on the Door (No Beer). There had been such a run on it lately that they could not get sufficient supplies forward. All the pedestrian Traffic is alongside of the road & it is very dusty by the time I arrived in the Town I felt inclined for a Wash and Brush up. As I approached the Town I could see the Damage on all sides done to Houses. Windows & Side Walls blown away everywhere & very few civilians about. There were houses empty everywhere & a lot were occupied as billets for Officers & Soldiers. After leaving the Main Road I passed down a narrow street & came into the Market Square just the same here destruction everywhere. After doing some shopping I turned down a side street for \n\nabout 200 yds passing a lot of houses all Knockabout & not a souleiiiiiiiiiiii living in them. I then came out near a large Cathedral which had been bombarded. The large Door was smashed in & I could see where a large Shell had come through the Dome above the Pulpit & smashed it all up up on the Sides were some Sacred Figures on pedestals & others had been all & half blown off, I did not know how I felt at seeing the Destruction of a beautiful Building also alongside is a another large building used in connection with the Cathedral that likewise had been very much damaged. On passing along a little way I came to another building I believe it is the Town Hall it had a large Tower which there were a Clock & it had stopped at 6.30 parts of this Tower & building had been blown away & bricks & Mortar lying everywhere. I was informed this damage had only been done last Thursday while we were attacking the Enemy & driving him out of Hill 60 & Messines. The People beleive that the town is now safe from Bombardment. After having some Supper & it was near 9 Pm all Troops have to be out of the Town by that Time I & my Pal \n\ncame back to Camp & turned in.\n","22":" 6\/17\n\nDuring the Morning I wandered about the Bush which they call here Woods, I was charmed at the numerous Flowers especially the Wild Honeysuckle which is very plentiful & smells very sweet. The Brier Rose grows everwhere also wild violets, As for Bird life there are several kinds, they are very numerous, one Bird whistles like a Canary they are everywhere also the Cook Koo he calls out now & again, especially in the Morning early he is at his best. As I am writing these lines I am sitting on a Box amongst the Honeysuckle & Briar Rose & the birds are flittering about me everywhere, as the weather is fairly hot there is plenty of shade. After I had Dinner I had a bush bath. I got a Bucket of water from the soak & took it into the bush & stripped off & had a good sponge, of course bye and bye we will have all these conveniences provided. Every night there are trucks of Timber arriving so it wont be long. As I was booked on Duty at Midnight which they call here 24 oclock Driving\n\nthe Shunting Engine, I laid down after Tea for a Rest. & was called at 11.30 Pm. I had a very quiet night on the Shunter as there is not much doing, having a Pilot Driver to learn me the yard. My Engine No was 2364 a Midland Railway Coy Engine brought over from Blighty there are at present 6 Eng. In our Depot & we have 3 runs, one does all the work for the","23":" Canadians, one for the Northumberland Fusiliers, & the other on the Shunter in the yard, as we have a large staff of Drivers available I work one day in about 4. A Certain number of Sappers are employed as Guards, Flag Men at the Main Road crossing, Shunters, Messengers, Number Takers. Engine Cleaners, & Point cleaners. All night long the Guns were banging away at Fritz but as the day broke it came up very Foggy so Fritz in his Aeroplanes did not give us any trouble. We now have very long days it is light at up 10 Pm or 22 oclock & daylight at 3 oclock. I finished my shift at 8 am when I was relieved by Driver Dick Albury of W.A. my mate was Sid Morgan a driver from W.A. he came from the Timber Mills. My Pilot was Vickery also of W.A. We only have a few miles to work on about 5 all told up to date, I hope my\n\nnext shift will be out towards the Fireing line as it will be more interesting. After Breakfast I slept on & off all day & after Tea I went along to where they send up an Observation Balloon. I just arrived when it was going up with General Murray & I waited for it to come down. The Balloon is an Oval Shape & has 3 Flaps on each side & one on the Top to balance it, it has several long ropes hanging from it which the Flying Corp Boys hold on to when it is down. There is a long steel Chain which works from a very heavy Motor Car as the Balloon goes up a Blue Flag is hooked on to the Wire in two places, for the purpose of giving Aeroplanes warning that a wire is there. The Balloon goes up over 2000 ft & has a separate wire which is connected with a Telephone up above – on the ground. After a little while it came down & the General stepped out, he had leather straps about his body to couple on to a Parachute, There is a large Basket hanging underneath about 4 ft square & 3 ft deep. There are two Parachutes on each side hanging down ready for use & on one side of the Basket is a board which has a Map\n\ntacked on which is the Observer’s Sector or Portion of Country he has to take notes from. The Observer has a large leather overcoat on over his straps. After remaining down for a few Moments it arose again & the fun was all over. Those Balloons go up every evening also a large number of Aeroplanes, & Battleplanes, the latter fly around in number from 6 to 10 in numbers, they travel very fast & very high. After getting a quart of Fresh milk for 5d & 4 Ginger Breads for 6d my Tent Mate & myself had cupper. There is no mistake I enjoy a good drink of Milk before retiring & it is about the only thing reasonable here, Biscuits are sold at 2 – 3 a Penny about 5d for a ¼ of a lb.\n","24":"\n\nI was awakened about 4 am by quick fireing close at hand & I jumped up & looked out of the Tent & saw shells bursting up in the air, Fritz was over the lines & the Air Craft guns were trying to bring him down with what result I could not say. It only lasted a few moments & it ceased. During the afternoon an Observation Balloon came down in Flames, the pilot jumped with his Parachute\n\nbut Balloon in flames overtook him & he was burnt to death. I saw the balloon up in the air & all of a sudden I saw it in flames & the Pilot coming down in the Parachute when the Balloon seem to envelop him & he & the Flaming Balloon descended together. I heard later he was named Captain Night & he perished. All Saturday night things were very quiet likewise\n","25":"\n\nOrders were issued for a Bathing parade the names of the Men had to be in by 8 am. After Dinner the parade was called & about 80 men turned out & we went over to the Trucks 4 in number & an Engine. We soon started & got out about 1 ½ miles where we had to detrain & walk nearly a mile along another line to a junction where we had to wait about 40’ for a Bathing special from Poperingie which contained 8 Coaches full of Royal Engineers we soon scrambled on board & after about 5 miles we arrived at the Canal at Harrangie were \n\nwe all detrained & scattered ourselves along the bank & soon was in the water which was very deep in the Centre also very muddy there were over 1000 Men bathing. The majority of Men had no costumes so we had to bathe without them although on the opposite side of the Canal Belgium Women were walking about, they did not seem to mind & we did not care, there is evidently no modesty in these People. After I dressed I had a stroll around a Camp & Farm house which contained a large number of Belgian Soldiers, one of them gave us a drink of Coffee which was acceptable, when the came along we all entrained & soon was on our way back to Camp, on arriving back at the junction a lot of us went to a farm house for a drink of water & we were supplied with Milk instead, Butter Milk which was a bit on the sour side but still we all enjoyed it. We had to walk back to were we left our train and in a few minutes was back in Camp. After Tea I was notified that I was on at Midnight on the Shunter so I had a quiet nap after Tea & was called at 11.30 Pm or 23.30 oclock. I took over\n\nat Midnight & as there was nothing to do I had a lay down on the Engine until 2.30 am when we had to do some shunting about 3 am as it was breaking day.\n","26":" The Anti Aircraft guns in the vicinity started fireing, Fritz was about we stopped our shunting & we could hear the hum of an Aeroplane & 6 shots fired down from the air when our guns stopped, a few minutes later we heard an Explosion away about ¼ of the mile but took no notice of it until a Tommy came up to the Engine & told me a bomb had dropped in a Tent & several men were hurt, we got out an Empty Truck & started for the scene, on the way down they were bringing a lad along on a board who had his arm shattered also several Scotch Tommies were coming along on a Trolly who had been injured, we did not pick them up but after the Trolly was removed we went along to the Camp & what a scene. The Bomb had struck the top of the Tent Pole of an empty tent & blew the Tent to pieces & the pieces of the bomb spread out & had killed outright 5 of the Scotch boys, injured Men were\n\nlaying everywhere, some were hurt in the Face & head. one poor chap had his Eyes blown out, another had a very weak eye & the good eye was destroyed. After first Aid was rendered by the Men about they were placed on Boards as there was more men than the truck could hold we had to go on further to a Ammunition Dump to get another Truck & some boards when we came back they placed the boys on the boards & into the 2 trucks & we was off to a hospital about 1 mile up the line, one poor Chap died in a Truck & on arrival at the hospital all the Wounded was carried & others assisted into a large Ward. The moaning of the poor fellows was awful to listen to, one poor Chap who had his face badly shattered made a sign to me for a Cigarette by making a motion of his hand & mouth as I had some in my Case I lit one & gave it to him & he evidently enjoyed it, a few minutes later another poor fellow passed away making 7 deaths in all, the number of wounded & killed totalled nearly 40 before we left the Hospital the A.M.C Boys invited us to a Meal as it was nearly 5 am & we were all tired &\n\nhungry with our first experience of what Fritz does. The Wounded who could walk came in also for a Meal they were seated at one table & the Train Crew & assistants at another. The A.MC. Boys gave us Bacon & Bread & Majorine & a good cup of Tea which we all enjoyed very much. After thanking them we came back stopping enroute at a Waterhole where a pump is stationed & filled up our Tender with Water afterwards we came back and finished our work. I signed off at 8 am & slept on & off during the day. After Tea about 6.30 Pm Fritz gave us a taste of his shells they started dropping them about 100 yds from our lines, & what a scatter there were, we did not know where to go for shelter, the Boys ran in all directions with fright as it was our first experience of being under fire. I started to make for the Town but Fritz landed a few towards, there after staying out of Camp until 8 Pm I came back likewise the boys & we decided to sleep out of Camp, some went away into the bush & I made for a heap of \n\nsleepers & several of us made ourselves a shelter & I laid down underneath them, I could hear the shells bursting all night, every time one burst I expected a bit of them anyhow I slept in between each shell until daylight. Then I took my kit back to the Tent, after Breakfast we were lined up & told off in two parties to dig two Dugouts for shelter, after the previous nights experience all hands were only too pleased to make some shelter & we worked with a Will under Two Sergeant Majors & by tea time our Dug Out was safe & shell proof. We dug a trench about 30 ft long by 4 ft deep & made it half round & we put 5 rows of Sand Bags on Tops of the bank of sleepers across the bags, we filled in earth on top for about 3 ft high & banked it around & covered it over with leaves & inside we put up sleeper supports to strengthen it also sleepers on the floor. I made up my mind if Fritz was troublesome I would sleep in the Dug Out although he had been sending over shells on & off all day they were not in our direction, I was booked to go out to the end of the line on a special\n\nif required at 9 Pm but it was cancelled the last minute so I turned in at 10 Pm in my Tent. I laid awake for a little while then fell asleep & at about Midnight Fritz started sending them in our direction only a bit short & the Boys who were in their tents stated to shift for their dugouts, I likewise quick & lively, I found our dug out full up so I had to lay down in the passage way on slopeing ground. I slept there sound until abut 4 am when all seemed quiet I took my Rugs back into my Tent & had another two hours rest.\n","27":"\n\nAll the Morning was spent in strengthening the Dugouts with Sand bags & loose earth. Several of the boys have built small dugouts of their own, as there were plenty of Sand Bags & sleepers available. I was notified to go out with an Engine at 9 Pm to remove a Gun if required so I spent the afternoon in having 40 winks & writing a letter home, just before Tea\n\nit came on to rain so my work was cancelled so I made up my mind to sleep in our dugout as my nerves were not to good as the Gun fire of our Big Guns likewise Fritz’s Guns got on my nerves so I took my Rugs down early & turned in, you could not hear any noise in the Dug Out, everything was quiet so I slept very sound until 7 am feeling a lot better & my nerves were more settled. On Tuesday Morning one of our Boys received a great shock from the shells & he dressed himself & went into the Town of Poperinge to get away from the noise but he no sooner reached there when Fritz started sending his shells there so to day Thursday we heard he had been sent away down the line for a rest.","28":"\n\nAll day Fritz was sending his shells all around the Camp although a lot of them were Duds which failed to explode practically no harm was done but in the Town of Poperinge he sent several which done some damage, one shell burst at the Railway Station injuring a lot of Soldiers several were going on Leave to Blighty, Rumors were that\n\nthe Town was out of bounds to Soldiers although there is a large number quartered there. I was notified for a Special Train to remove a Big Gun at 9 Pm After the Petrol Engine which goes up to the end of the line with material & stores for the troops had left we followed a few minutes later, we had two Officers & two Guards riding on the front of the Engine, we have to have a Tarpaulin right from the Tender over the Cab of the Engine to prevent the Glare from the Firebox showing above the Cab, we cut small a hole in the Side for us to look out for Signals en route from the guard. We went along the Main line steady & turned into the South loop about 2 Miles from Camp & up into a Dead End were the big gun was I am told it is 9 ft longer than any gun along our part of the line. After coupling it on to our Engine we pulled it out of No 4 Dead End slowly & shunted it along into No 5 Dead End, we placed it behind a Clump of Trees where there were a screen of Wire Netting behind & above\n\nus covered over with Grass to prevent the Taubes seeing it, along No 5 Dead end Road I could see the ground torn up in all directions by the shells, this Gun has not been fired here yet, awaiting for the next push, I could see the Star shells in all directions in the Sky lighting up the Country around, from where I was it is only about 900 yds from the Front line trenches, things were quiet hardly any Fireing going on. After returning to the Yard we had to go out again to No 1 Kao Siding for a load of Empty Trucks, while we were standing on the Empties shells commenced to fall close handy so we soon beat a hasty retreat back home again arriving there safe. I forgot to mention that at about 6.15 Pm Fritz landed a Dud about 200 yds to the left of our Camp & the next shot he put a good one right in the middle of our platform making a hole of about 4 ft Deep by 8 ft wide sending the stones in all directions two of the Royal Engineer Boys were hit & badly injured & were taken to the hospital, this shell passed just over our O.C. Van giving him a great shock so he decided to have \n\nseveral trucks including his staffs trucks taken down the line about 1 mile from the Camp for the boys to sleep in as the Shelling was getting on their nerves. The trucks were placed in a Siding, I shifted my Kit & instead sleeping until after the next push in one of the trucks all day Friday his shells did no damage. On Saturday afternoon","29":" Fritz started having a try for our big ammunition Dump about 1 mile away he was landing the Shells near our Motor Wagons & they soon made themselves scarce, clearing out in all directions. One shell burst about 20 yds off a Dump we could see it from our Vans anyhow after trying for about an hour he gave it up. At 9.30 Pm or 21.30 oclock I had to go out to a Siding called Dirty Bucket for Empties also to Pottenhook but could not get to the latter as we were told that the Main line further up was broken so we went into Dirty Bucket Siding & pulled out 37 Trucks, we had to wait for a while while the Tommies were unloading them, all the time Fritz was trying his best to\n\nblock up the Dump but his shells were a long way short & no damage was done. During the Morning I went over to the Aerodrome & saw some beautiful Machines in the hangers, several Machines went up & several came down while I was there. One pilot I was talking to showed me one scout Machine which was capable of Flying at 140 miles per hour & it can carry enough petrol to last on a Fly for 4 hours, it was only a one man machine. It is a pretty sight seeing a Machine starting to fly after the Motor was started two men hold it back from starting & the force of the wind from the propeller blows the grass under the plane flat on the ground. When all is ready the men let go & the Machine runs along with a slight incline until a certain speed is gained then it assumes a horizontal position & then in a second up it rises & off it goes, they are painted all colors, Red White & blue all over them also a number on both sides. I saw a Two Man Machine going up these planes carry a number of Bombs 5 or 6 at a time, on the Back of each Machine is a Vickers Machine Gun. There are a \n\nlarge number of Machines in this aerodrome. One Pilot was pointed out to me who had brought his 40th Machine down & he was just over 20 years of age. After spending about 1 ¼ hours looking around I came back to Camp well pleased at what I saw. ","30":" After finishing at 1 am I went along to the trucks & turned in, after sleeping for about 2 hours I was awakened by a lot of Fireing in the air, Fritz was about as it was a good Morning, clouds being scattered things were willing, he dropped several Bombs but did no damage also the big Gun started Fireing & landed a shell in the Middle of the Station yard making a big hole in the Road way near some amunition trucks, my Chum who was on duty got a great scare as he was only about 20 yds off it, shunting on his Engine. & Dirt & Stones likewise shell was flying in all directions but no one was hurt, again Fritz came over at 10.30 am & dropped a Bomb in a field about 100 yds from our trucks, Soldiers were running in all directions Bullets from our Aircraft guns were falling all \n\nover the yard & striking the Engines & Trucks. One Bullet bounced off a truck & struck one of our boys on the leg but did not hurt him. I am afraid we will have to get away from this place as Fritz has our range & he is making things very willing for us all, it is bad enough being under shell fire away up towards the Fireing but it is worse in the Camp where we have to have our Meals also working about. Fritz did not bother us this afternoon as his shells were being sent in another direction. After Tea he started having another shot for the Dump, putting shell upon shell all around it, he kept up the Bombardment until nearly 10 Pm when he stopped for the night. I went for a walk up the line to a Artillery Camp & into a Wet Canteen for a Drink & then along towards the Aerodrome for coffee & biscuits, Biscuits 2 a Penny & coffee 1d a small cup & had a chat with some Belgian Women & then down towards the Camp stopping half way down & sat on a heap of sleepers enjoyed the beautiful scenery of the Crops of Wheat, Rye, Barley, Potatoes & Hops also the Lights of the Observation Balloons & the planes flying about made the Sight to the eye some-\n\nthing never to be forgotten. The Red Tile houses in between the Crops makes a beautiful panorama View likewise a painting. Early this morning","31":" Fritz came over towards our Camp & he received the usual peppering from our Guns also he was chased by our Machines he soon beat a hasty retreat up to now 3 Pm Fritz with his Big Gun has been very quiet, not one shell has been sent over our way, I hope our Guns have silenced him. as he is a perfect nuisance. After Tea I went for a stroll into Poperinge with a pall, on the road down I passed several Batteries on their way to the front also numerous Mule Trains evidently on their way to remove Batteries to new positions in fact there is one continually stream of Transports & Men of all descriptions on passing through the town I passed a number of Busses full of soldiers going out to the Front lines on reaching the Railway Station I was just in time to see a large number of Scotch tommies detrain all were dressed in Kilts after seeing them march off we went & had \n\nsupper, two Eggs & Bread & Butter & Coffee for 1 Franc which was fairly reasonable considering the times, on coming along the road back to Camp we saw Fritz having a lively time from the Air Craft Guns he was making for the town but was driven off, shots flying around him everywhere he turned & made off up towards our Camp, still being chased by our Guns when it got too hot for him, he turned off & made for his own lines, we arrived back at Camp where everything was quite & turned in.","32":" Fritz awoke us up at 3 am with his usual visit but although he dropped several Bombs near by he did no damage, Fritz with his big Gun was quiet all day I signed on at 8 Pm to take up Amunition for the Guns, we left here at 9.30 Pm for Pottonhook Siding & after a quiet run we arrived there at 10.15 Pm after picking up a Construction Gang in case the line is blown up. We remained at the Amunition Dump while the Boys unloaded the trucks, as the Shells were unloaded & stacked they were covered over the leaves\n\nand Grass out of Fritz’s Sight, all the time we were there Fritz was sending over all sorts of shells in fact they were falling all around us, it appears a few days previous a Battery near by & shelling Fritz for a while & then cleared out to another position & now Fritz was giving the Ground where they were what for he had missed the Bus, which is one of the tricks of War.\n\nWhen unloading was finished we left there at 12.30 am & came along slowly to Hospital Farm about 2 miles where we found some trucks of Amunition on the Main Line, the Officer in charge told us to push them back into South Loop lower down which was soon done & we got safely back to Camp at 2 am & signed off.","33":" After turning in at 3 am I did not get up until Dinner time, at about 3 Pm quite a stir was in the Camp, the Boys were watching Fritz making for a Balloon, the Observers saw him coming so they got clear with their Parachuets & Fritz flew over the Balloon & set fire to it & it soon was\n\ndestroyed & came down in Flames, the same thing happened at 5.45 Pm another Machine came out of the clouds & made for another Balloon & the Observers both got clear of the Balloon. Fritz flew just over the top & dropped something on the top but missed it, he then turned & used his Machine Gun on it & soon it was in Flames, giving off volumes of Smoke, the Guns all around him gave him nothing but he took little heed of them, several of our Machines gave chase but he rose into the clouds & soon was lost to view. This is one of the Experiences I enjoy seeing Fritz with the Guns banging at him although Bullets are flying all around us & pieces of shell from the Explosives, nobody up to date has been hit & having our steel Helmets on, we feel a certain amount of Security. After all the fun was over I went for a stroll along to the Aerodrome & saw some interesting sights, I was shown over a Hanger which contained 4 Machines each one having space for two Men. A Young Mechanic \n\nexplained the Fireing of a Gun which is placed on the left Side of the Biplane. The Sight is taken from a Telescope a little above it & the gun is controlled by some mechanism which regulates the discharge of the bullets which pass between the propeller Blades while it is travelling around at a terrific rate, a really wonderful invention. Another Machine Gun is operated by the second Man which is fixed on a round bracket behind him on the Top of the Machine & raised & lowered by two Rachets, it can be handled very easy. I could not find out the Weight of these Biplanes, by it took me all my strength to lift the Tail of it. Where the pilot sits is a Register to record the Speed another the Height & a Wireless apparatus for Sending Messages. It was explained to me how they loop the loop, there is a movable Flap on each side of the Rudder & when they are raised when the Machine is in the Air, enables the Machine to turn a Circle, also a Movable Flap on each Side of the Wings which makes the Machine turn on it side, all these contrivances are used for the purpose \n\nof Fighting Fritz in the Air. After thanking our Guide we made our way back to the Vans & turned in, but could not sleep as Fritz was sending his shells over after the Dump now & again just enough to annoy us, several shells burst very close to our Vans I was on the point of getting up & shifting my Camp but as it was raining very hard I stopped where I was although when a shell burst very close, the Van shook with the concussion, I expected every minute to be my last. I dozed off to sleep after he stopped but was woke up again at 4 am Fritz with his Machine was close, in fact I jumped up & looked out & saw him just above a Hop Field near by, he was very low down. The Guns & Machines were at him & he was fireing his Machine Gun in return, the lights of the bursting shells made it a grand sight, anyhow after dropping two Bombs close by he cleared out & all again was silent.","34":" Fritz started sending his shells over after Breakfast so I adjourned to the Dug\n\nout to write up my Diary, while I am here in the Dug Out I can hear the shells whistling over head & exploding some distance away.\n","35":"\n\nThings all day were quiet except that the continuous Road of the Big Guns, a Big Gun close by seem to be playing Lawn Tennis with Fritz as the Gun would send over a shell to Fritz & in a few minutes Fritz would send another back & that’s how they amuse themselves. After Tea I went along to our O.C. quarters for my Pass to go & see my brother over at Steinvercke after obtaining the Pass I met a Company Sergeant Major who was after a Pass also & waited for him & when he received his pass we both came back to our Camp & I drew two days rations consisting of 1 Tin of Meat & vegetables 1 of Bully Beef, 1 Loaf of Bread, Tea & Sugar, Cheese, some Butter & a Tin of Jam. We left word for the Guard to call us at 4.45 am & the Night Cook promised to have something\n\nhot for our Breakfast. After a fairly good sleep I was called at 4.45 am by the Guard & after having some Fried Bacon & Bread & Butter & Tea we set off at 5.20 for the Railway Station in Poperinghe.","36":" 1917. It was inclined to be wet now & again a drizzly rain would fall, as it was 2 miles to the station & having plenty of Time, both of us jogged along quietly. Traffic on the Road is very quiet this time of the Morning, eventually we arrived at the station at 6 am & after producing our leave Pass in the Railway Transport Office, we were both issued a Moving order from Poperinghe to Steenwerck & return. This order is like a Consignment Note, & it is issued instead of a Railway Ticket. We made our way on to a Platform which was very long & low only about 12 inches high. When our Train was brought to the Platform a Militiary Police asked to see our Orders & Passes, after showing them he put us into a Second class Compartment which was very comfortable. at 6.18 the Train started, having a fair\n\nnumber of Soldiers on board after a good Run of a few minutes we stopped at a station called Abbede where a lot more soldiers got aboard, after a few minutes delay, we were off again until Caistre was arrived at where more boys joined up & then off again & made one more stop at a Big R.O.D Depot called Borre for a few minutes when more boys joined & then into Hazelbruick arriving there at 8 am. After reporting ourselves at the R.T.O. Office they told us the leave Train would be in any minute, so we waited for a while when we decided to adjourn to the Y.M.C.A. for a Cup of Tea. Hazelbruick is a fine Station but no conveniences from one Platform to another, Passengers have to cross over the lines. As a Goods Train was blocking the Main Platform, the People had to walk down the line over Rails & stones to cross behind the van, there is no mistake the people are behind the times. After drinking our Tea we waited about for our Train\n\nAs it was coming from Boulogne with Soldiers returning from Blighty, nobody knew where it was. Anyhow after waiting about it eventually arrived at 11 am, it was full of Soldiers from all parts going to all parts a regular mixture of Regiments. After we joined the rear portion & the Front portion was taken off, we started at 11.20 for Steinwerck. The Weather now had set in wet, so I expected to get a wetting looking for Brother. An Australian Soldier in our compartment happened to know exactly where No 3 Divisional Motor Transport Workshops were stationed, so he directed me successfully. The First Station we stopped at was Strazede were the 58th Coy of Canadian Railway Men were operating they having a small Depot to handle after stopping there a few minutes we proceeded on to the next Station called Baileau where a lot of Australian troops were quartered, a lot of Australian Soldiers detrained there & after a few minutes travelling we arrived at Steinwerck where I said Good Bye to my Companion I made my way to some Transport Wagons in the yard.\n\nI soon found one with the Rising Sun on the Front & marked No 3. On asking the Driver if he knew my brother & as luck was with me, he happened to know him so he gave me a lift into the Town & right up to the Workshops. It was still raining & everything was wet & the Roads & yds were very Muddy. As my brother was away at Dinner I went to his billet & met him as I had not seen him for 10 years our Meeting was one of pleasure. As I was hungry he soon procured some dinner & he got leave for the Afternoon so we spent the Afternoon in his room chatting & exchanging views. After have a good Dinner at 5.30 we went for a stroll around the own. All the French Towns I have been have a Big Square which is used as a Market place. This one is used for the Motor Waggons & the Workshops staff & other ranks use some of the buildings for their quarters, My Brother’s quarters are A1 he & two other chums have a room upstairs in a building & they have a stove in it for Winter use also a Wardrobe for their clothes & a Kerosene\n\nlamp to use at Night. We walked about during the Evening & had a few drinks & was introduced to several of his chums, It was amusing watching the Militiary Police who were only over from England a few day previously. They were ordering the Boys to take their hands out of their pockets & button the lids over their coat pockets, the Boys about took it as a joke & started barracking the Police. They anyhow got a hot reception from the troops everywhere. This fun was kept up until 9 Pm when all Troops had to be in their Billets, so we made our way to our quarters after an enjoyable evening, My Brother brought 5 blankets from their Quarter Master for me to sleep in & as they had a spare bunk I soon made myself comfortable & after talking until nearly 11 Pm I soon was fast asleep.\n","37":"\n\nI awoke at 7 am after a good nights rest although the Guns were booming over in that sector but not so bad as over our way I was not disturbed. After having breakfast I amused myself walking about the workshops & watching people going to Church until 11 am when I said Good Bye\n\nto my Brother & his chums & walked to the Station about 1 mile away when I reported myself to the R.T.O. Office, I was told to board a Goods Train which left at 11.30 am for Hazelbruick, My Companion was in the front portion & I was in the rear & we did not know until we arrived at Hazelbruick. We left Steinwerck on time & after making one stop at Strazede we arrived at Hazelbruick at 12.15 Pm. After reporting to the R.T.O. there he gave us an address where we could have a good Dinner, as we had 4 hours to wait for our Train to Poperinghe, we went along & had a good Dinner for 3 Francs each & afterwards we went around for a stroll to look at the Town. Hazelbruick is a pretty place nicely laid out. Trees growing in several streets & the Footpaths wide. The People are more refined there than any town I have been in. As it was Sunday afternoon the place was full of well dressed people, although black is the predominating colour but still the French style of Dress was very pleasing to the Eye, We both halted at the front of \n\na large Cathedral to watch the Orphan Boys & Girls going to Sunday School they were all dressed in black the Girls from 4 years to 14 years wore black Silk dresses with straw hats trimmed with Black Silk in tucks & they look very pretty, their sweet faces blended well with their dresses & the boys wore back Serge Suits with black caps with shiny peaks & they all looked well which shows that the Authorities look after their child folk, the Elder Folk also were in large numbers going into church, after satisfying our curiosity we went along further, we promenaded the streets until close on 4 Pm having spent the time very pleasant we made our way to the Station & into the Y.M.C.A. for a Cup of Tea & chocolate & had a rest. Our train soon came alongside the Platform & we were soon seated, it was fairly well crowded & started off well to time & after several stops to put down Soldiers we arrived in Poperinghe at 6 Pm & walked steady back to our Camp where we had Tea & a chat to all the boys inquiring where different Battalions were, having brought a list of the 3rd & 4th Divisions with me, I gave a lot useful information\n\nwhere their friends & relatives were. As I was tired I soon turned in & slept like a top till 7 am.\n","38":" &","39":"\n\nNothing of importance evenuated.\n","40":"\n\nI was booked on duty at 4 Pm (16 oclock as an Emergency & after signing on I was notified to run a special of Stone at 9 Pm (21 oclock) After the Petrol Engine had cleared the first Section I followed on with Eng & Van to South Loop Siding where I had to pick up about 20 Trucks of Stone & about 100 New after making the Trucks good I pulled them out on to the Main Line & proceeded cautiously ahead with the Trucks in the lead, on passing Pottenhot Siding which was on a stiff grade the load was too heavy for my Engine & it pulled me up, it was then necessary to come back about ¼ Mile & have another try when I succeeded & eventually arrived at Trois Siding about 400 yds from the Canal near Epress. On entering the Siding I had to push the trucks up a short loop\n\nto a Dead End where a Big gun was located & leave 3 trucks there & bring the remainder back on to another loop where the Tommies had to unload them, it was necessary to remain there until they were emptied which took about 2 hours all the while Fritz was straffing the vicinity looking for the Big Gun, Shells were dropping all around us & bursting in the Air but fortunately no one was hit, after coupling all the trucks together again we started for home cautiously. I had not proceeded far when I noticed the lights of another Train not far off. I applied my Steam Brake & brought my Train to a Standstill & my Guard came along & went to find out the Block, I found out that the Amunition Train had failed to push his load into Pottenhot Siding so therefore had to place half his load on the Main Line, after a little delay the Trucks were removed & I proceeded on my way, After going some distance in the next Section I saw a Black Object across my line, I instantly applied my brake & steadied up & as I approached the spot it turned out that an\n\nEngine & Trucks of the Light Railway on the 2 ft guage was attempting to cross my line & seeing my Red Tail Light they shunted back & cleared my Engine by about 4 ft, a very close shave, I continued on my journey to the next station where I was blocked by the Fish Train which is another name for the Tank’s, They had been unloading the Tanks in the Dead end off of the South Loop when Fritz stated bombarding them & unfortunately had killed 3 Officers and seriously wounded another, when it was decided to come back out of his fire until he had stopped, then they went back again & completed the unloading. These Tanks are loaded on to the long Trucks, one on each Truck which have no sides or ends & they run the Trucks into a Dead End which has a ramp built & the blocks holding the Tanks secure are removed & on a Signal being given the Tanks one behind the other move along over the Trucks & off the ramp at the ends away into the Bush over stumps, shell holes or any other obstacle which come in their way, they are then placed under screens to prevent \n\nFritz’s Aeroplanes from seeing them, While the Trucks containing the Tanks 12 in all where in the yard at our Depot I had the opportunity of examining the outside of one which was not properly covered over with a Tarpaulin. They are of an Oval shape having an endless plates of steel which serve as a flooring for the Cog Wheels to grip, the plates of steel have groves inside for the Teeth of the Cog Wheels to grip which causes the Tank to move along & the whole weight is I am informed is 20 Tons. They are about 9 ft high, & each Tank has 1 Lieutenant, 1 Sergeant, 1 Corporal, & 4 Gunners. Each man inside has an important part to play, also each man can take up the duties of another in case of a casualty. There has been up to date 4 Train loads of them passed through our Depot, & still more to follow, for the Big Offensive which will take place in the immediate future. As I stated previously that they blocked me, after the line was clear I proceeded on my journey to the South where I stopped to put out the Tommies, & then came back to the Depot safely when I signed off at \n\n1.30 am:\n","41":"\n\nAfter having Breakfast I was called to the Orderly Room & was informed that I am appointed to the position of Sanitary Engineer and Second Ambulance Officer for the Company & my duties are to see to the Health of the Camp & assist the First Ambulance Officer if required, which means that for the time being I will not be going Driving on the road so therefore my experiences of an Engine Driver will cease for the time being, but I will endeavour to carry on my Diary with other experiences so here goes.\n\nWhile we were having Tea at 5 Pm we were treated to a magnificient Aerial Display for about ½ an hour. As the White Clouds in the heavens were scattered & fairly low, Fritz came over with their Aeroplanes hiding behind the Clouds until they were near their Object, then they swooped down low when our Anti Air Craft guns started fireing at them, then the fun started as their were 4 Observation Balloons \n\nup about 3000 ft. Fritz came at them, one flew towards a Balloon when out jumped the Observers with their parachuets & got away clear in the meantime one Aeroplane Flew over the Top of the Balloon & dropped some Liquid Fire on to it & in about 30 sec the Balloon burst into flames & came down, the Basket underneath kept clear of the Flames, & was not destroyed, as our guns were making the place too warm they cleared away amongst the clouds for a while. When an opportunity afforded Fritz he came at another Balloon & the Observers tooked to their Parachutes, on coming down one of them fouled the line of another Balloon & twisted around the Cable but fortunately twisted back again & swung clear & eventually alighted near the same spot as his Mate Fritz tried to fire their Balloon but the Guns were too solid for them as they tooked to the Clouds & cleared off. While all this display was taking place, our lads including myself were in a great state of excitement some rushing for the Dug Outs, other running about getting their Steel Helmets on & others taking cover in\n\nthe Drains because Fritz was all over the Camp & we expected a few Bombs to drop, but Fritz was not on a Bomb Dropping Expedition so there fore no harm came to us. This Aerial Display was the best we had witnessed up to date, & we all enjoyed the fun. There is no mistake Fritz has beautiful machines, they appeared to us to be like Large Dragon Flies bearing down on their prey. & as their colour was of a silver Grey they glittered beautiful in the Sun, we could distinctly see the Black Cross on the planes. Eventually all the other Balloons were hauled down, Fritz had 7 Machines taking part in the Display. After the Excitement abated I went out for a stroll until Bed time & then turned in.\n","42":" 8th\/7\/17-\n\nAfter Dinner my chum & myself decided to take a stroll into Poperinghe, so we dressed & as the weather was unsettled & rain had fallen making the Roads in a terrible condition as the Traffic at all times\n\nis very heavy, the centre of the road is blocked with Cobble Stones & the sides have about 2 inches of Mud it is a case of walking along on the Cobble Stones until some transport comes along & then one has to jump over the Mud on to the Bank, by the time we reached Poperinghe our Boots & leggings were in a dirty state, it absolute disgust one trying to get into Town clean. Anyhow we made the best of a bad job, After strolling along a narrow street we came to the Square where the Traffic is particularly heavy. One has to wait their chance to cross over, the Militiary Police controls the Traffic at each crossing, what with Traction Engines, Transports, Artillery Batteries & not forgetting the old London Bus which there is plenty of them full of Soldiers from the Trenches, these boys are as a rule covered in Mud with their steel Helmet on their head & the Gas Respirators slung in front of their chest, they look a sorry lot although cheerful, they are as a rule all \nfed up\n with the War. We passed the time until 5 Pm when we looked around for a place to have \n\nsome Tea, eventually we found one although it was crowded with soldiers, On entering the Side door you find yourself in a Kitchen where 3 women are busy frying eggs, you take your turn to order what you want, We ordered chop & Eggs & after waiting about 20\" at the Counter we received our portion with two small pieces of Bread with Marjorine scraped on very light & a cup of Coffee, a very small cup at that, they charged us 2 francs & 40 cents each, an imposition. Eggs can be bought retail at 2 ½ d each & they buy them by the gross & they have the cheek to charge us 10d for two also a small chop about","43":" of a lb also 10d anyhow after paying for them they gave us a fork, no knife & we went into the next Room. There is no body there to clean up after one is finished so therefore the tables are very dirty. As we were both hungry we soon put our supply away & got out of the dirty hole, as we had not sufficient we decided to look around for some cakes or Pastry & eventually bought about a Block of Ginger Cake for 2 francs & went into the Y.M.C.A. nearby & paid\n\n1d each for a large Mug of Tea & sat down & finished our Tea, the whole lot costing us 3 francs & 5d each, Anyhow that is the last time I intend having Tea in Poperinghe. The style there does not suit me. After a quiet stroll until 8 Pm we started on our return journey, but tried another Road, we followed a Train line along a narrow street walking along the sides on a pathway of ashes & it turned into a wide road although the Traffic there is also Heavy one could walk along in comfort, we kept going for about 1 mile & eventually arrived at a point where the line crosses our line & we turned & followed our line into Camp although it is a little farther but still when the roads are bad it is the best. After getting into Camp we made ourselves a cup of cocoa each & having some of the Ginger Cake left we had a nice supper, & eventually turned into bed. We had only been in bed a few minutes when an alarm was given of Gas, the Hooters & Engine Whistles & Bells ringing soon aroused every body, the alarm is for all hands to be on the alert, that is place our Gas respirators on our chest, opened & ready to put the mask\n\non should the gas come over as far as our Camp. Anyhow it did not reach our camp nor anywhere near it, but still we had enough excitement what with the Anti Air Craft Guns blazing away at a Taube, you could hear him but not see him. The Search lights were shining in the sky in several places, & the Incendiary Shells bursting over the Battle Front lighting up the country for miles around, it all looked beautiful, All of a sudden Fritz with a High Explosive Shell exploded one of our Amunition Dumps & what a roar ping Ping, Bang, Bang, for a long while, we all thought at first about a Dozen Batteries were in Action, anyhow it was too consistent for them so in the morning we were told that it was in Dirty Bucket Siding where the Dump was blown up. One of my mates has been notified that he has to take up the Tanks every night until they are all up & in their position, he has a very exciting time every night, Fritz seems to know when they are about & starts shelling them, but up to now no harm has been done to the\n\nEngine or Men & today","44":" – an Armoured Engine has come to our depot to stay, as if he works here, the danger is not near so great, This Eng is 6 wheel couped & has steel plates up both sides & the Cab is covered in with steel plates only a direct hit would do any harm, it is absolutely Shrapnel Proof. There is now standing in the yard two very big Guns, they are built each on a long Iron Frameing, a Bogie at each end & the Gun is supported in the Middle, they each weigh 80 Tons, & can throw a shell 7 cwt in weight 11000 yds & fire each 16 Rounds per minute. They are painted all colours to look like the Bush & each have a large number of Wire Screens to be erected to conceal them, they are going out tonight to their positions for the Big Push.\n","45":" Night","46":"\n\nFritz with his Big Guns have been throwing shells over all day in all directions, continuing up to Midnight. He is an absolute Pest, Keeps us all \n\nawake with the Explosions.\n","47":"\n\nI took the opportunity this morning to go over to the Hospital with the Sick parade, I desired to get an idea of the Routine in connection with the Parade. The Hospital is over a Mile from our Depot out towards the fireing line. On arrival at the Hospital which is practically a clearing station until their complaints are diagonised when they are transported to other Hospitals, Our Sick Report is handed in & as there are a large number of Units paraded there each unit takes their turn, As a rule there are from 100 to 150 men paraded daily, it takes the Doctors some time to look at them all, Anyhow I got tired of waiting & had a good look around, the Orderlies there are erecting large Marques everywhere to accommodate about 2000 Men for the Big Push. There are only 4 or 5 huts for ordinary use, so the Marques will be required to handle all the Cases which will bound to come in. I spent about 1 hour looking around & decided\n\nto come back. As I started to return, 3 poor soldiers were to be buried, they were laid out on stretchers covered over with the Union Jack. I waited a few minutes & the Funeral procession started for the Cemetery, as they passed me I stood to attention & saluted the Dead, likewise all other soldiers the same out of respect. I followed in the rear, to pay my last respects to our fallen heroes, the stretchers were being carried by a squad of Seaforth Soldiers, on arrival at the cemetery behind the Grounds 2 Ministers of Religion were waiting after the Dead which were sewn up in their Blankets & Oil Sheets were lowered the Ministers said the Prayers, one Minister for the R.C. & the other for the two C of E Bodies, after the Ceremony was finished I came back to Camp.\n","48":"\n\nAfter obtaining a Pass to proceed into Town which now for some reason has to be obtained, I got a lift in a Motor Lorry & arrived in Town at 2.30 Pm. or14.30 oclock, having some purchases to make I first went into a Chemist Shop, after knocking &\n\nwaiting awhile, nobody came so I investigated through the building & could find nobody & was just leaving when in walked a dilapidated Man & asked of whom I wanted, after telling my wants he served me & told me that the owner cleared out as the Germans were shelling the Town, the civil population are in a great state when shells are falling although the Town is full of Soldiers & vehicles of all sorts & they don’t seem to mind. I went along afterwards to the Y.M.C.A. Building for a read when all of a sudden a large report of a Gun was plainly heard then a Whizz of a shell approaching & then a terrific explosion in the Air, & then everybody rushes out to see where the shrapnel has fallen, anyhow if any damage was done it was over to the West near the station, I learnt later that a High Explosive had fallen on the road opposite the Railway Station & had struck a Motor Van, killing the Driver & threw out his companion on to the Roadway, seriously injuring him also another shell\n\nhad penetrated the house of a Civilian & exploded in the Cellar where a Belgian Man & Women & two children were killed outright. Shrapnel was falling about on the Roofs of houses all the afternoon & Evening. After having a light Tea I went to the Tivoli Theatre where a variety show is held every evening the Performers were from a certain Division now quartered there, they are all splendid artists from the London Theatres & had been called up & they do fatigue work behind the Lines & perform in the Evening for the Troops although a charge is made, all proceeds go to the Red Cross funds as their Division moves away other artists from the Releiving Divisions take their place & so on. The charge is reasonable 1 franc for Officers 50 Cents for Warrant Officers, Sergeants& amp; corporals & 25 cents for Privates. The Show starts at 6 Pm & finishes at 8 Pm two good hours of fun. After having a couple of Drinks I caught a Motor Transport & soon was back in Camp.\n","49":"\n\nThe Break Down Train & Men was called out at 1am\n\nto go up near the Fireing Line as the Petrol Engine after taking stores up to the Trenches had been derailed & fallen into a Shell Hole, Fritz had hit the line in two places & had blown the Rails & Sleepers in all directions & had left a large hole which the Engine had fallen, the Gang was out from 1 am till 5 Pm rerailing the Eng & Fritz was shelling them all day until a Battery of ours had to open up to draw the Fire so they could get on with their work, as our luck is still with us, no one was hit although many had escapes. Another Train consisting of a 12 inch Howitzer Gun & several trucks were going up to a Gun loop pass Pottehook, Fritz somehow had known all about these movements as when they were passing Pottenhook Siding he started shelling the Train, the time was about 11 Pm & the night was dark still he somehow had known & he hit the ground near the leading truck & the concussion blew the Guard out & he fell into a shell hole, & luckily he only hurt his leg, the Train stopped & another shell\n\nburst near the second truck & set it on fire, it was loaded with 12 inch shells, the Sergeant Major in charge, a South African War D.C.M. Man, he rushed forward & cut off the two trucks leading & pulled the remainder away clear in a few minutes the shells in the truck exploded & blew the vehicles to pieces, by his quick action the Ser Major had saved the other trucks of shells & Provisions also the Gun, he has been recomended for a Bar to his D.C.M. Medal. They brought the Gun & Trucks back into the yard where they now remain. The Guard on his return at Midnight came into our Tent for First Aid & I painted his bruised leg with Iodine, he is alright this morning & has got over his shock & escape.\n","50":"\n\nAll the afternoon Fritz had us in a state of excitement he was continually throwing shrapnel shells all around the Camps. I was laying down reading at 3 Pm when one burst overhead, you hear the report of the Gun then a sudden whiz & Crack goes the shell, the first shell overhead exploded & in a second or two down comes the \n\nbullets all around. I jumped up & got under the Overcoats hanging on the Tent Pole but luckily none struck the Tent, the second shell bursted a few minutes later when I was outside & the bullets were whizzing around like large Hailstones, I took shelter behind a Wooden Hut & several Bullets struck the hut & the nose cap of the shell came whizzing down making a sound like an ordinary skyrocket when it goes up in the Air, only a few yds away in the thick bush. It is marvellous the number of Camps & Men about & nobody was struck, again at 9 Pm another \nshell\n High Explosive Shell burst some distance off & a piece about 1 ½ x ½ dropped on the tent next to ours but the force was spent & instead of it penetrating the Tent it was stuck in the Canvas. Anyhow that was the last & things were very quiet all night & the Camp was not disturbed. We all saw a strange Sight just before Tea away up high in the distance could be seen 4 Aeroplanes 3 on Top & 1 underneath, I watched the movements & it turned out\n\nto be 3 of our Planes were over the top of 1 of Fritz’s & they were forcing Fritz down gradually the kept closing down on him & preventing him from escapeing, gradually Fritz was forced down by a bit of wonderful work of our Aeroplanes, after a while they were out of our gaze owing to the Trees & I learnt from one of our Train Guards that he was brought to earth & taken prisoner & his Aeroplane was taken charge of by an Officer.\n","51":"\n\nAbout 12 noon one of our Aeroplanes which belonged to another Aerodrome ran short of Petrol & they made for the Aerodrome behind our Camp about 2 mile off they volplaned down from a great height gradually & struck a Hop Field with the result that the Machine fell from a height of about 12 feet & the Propellor jambed into the ground & broke the Blades into Pieces, fortunately they were not hurt, several of our Boys rushed over to their assistance but it was not required anyhow one got a piece of Blade as a momento & intends making the piece into a Cribbage Board. \n","52":"\n\nHaving obtained a Pass to go into Poperinghe I left the Camp at 2 Pm & as I felt inclined for a walk I took my time, the weather lately had been fine consequently the Roads were very dusty & after 30 “ walking I arrived at the Village, as it was fairly hot I went into a small shop, for a cool Drink of Grenardine, a kind of French Syrup also a Brush up as my Boots & Leggings were covered with white Dust after having a rest I made for the Militiary Baths to have a warm Bath & a change of clothing. As I had not been there before I had to inquire my way & gradually I found the place, on entering the yard there were a large number of Soldiers Haversacks & Rifles piled in heaps while the owners were having a Bath, I went then & stood behind a number waiting & had a conversation with a Private who told me they had just come in from the Trenches for a clean up & rest after being in the Front Trenches for 9 days without having a Wash & my word they\n\nwere dirty, I pitied the Boys, while they had been in the Trenches they had lost a good number of Mates & the unit who releived them were going over the Top about Tuesday so they did not know how long they would be resting, it all depends on the Casualties. Gradually they filed in & I followed & I was directed to a Table where two soldiers were seated, I asked permission for a Bath also a Towel, clean shirt & socks when I was given a Ticket for each article. I gave the Lad a small tip for obliging me, then I had to go a Window & hand in my three Tickets when I was given a clean Towel, a New Flannel Shirt & new socks then I went into the Room & undressed myself. This Room accomodates abut 100 Men at one time. Forms were provided to sit on & Nails to hang the clothes on. After Undressing I went under the Shower of luke warm water, the Boys revelled in the Showers & Soap was consumed in galore. The Boys were naturally dirty & wanted a wash bad, After I finished & dressed I handed my Towel, Shirt & Socks in on a Table provided to be washed & repaired by the Women at the Militiary \n\nLaundry. As you pass out a Canteen is provided where the Boys can buy Biscuits & Tea or Cool Drinks. A little further on is a place where heaps of Dirty Clothes were being sorted out also 3 Steam Boilers where they are fumigated to destroy all vermin. I stood & watched the clothes go in one & out of another Boiler in Iron Baskets. I must say these Baths & change of clothes is a God send to all the Troops & are well appreciated. After leaving this place I went around to see the damage done to the Tivoli Theatre, having asked permission & granted I went upstairs & saw where a Shell from Fritz’s Gun had come through the Roof, Ceiling & down under the Stage & exploded on the Ground Floor, blowing up the Stage & Scenery & Walls, making a great Mess, anyhow the Boys were all busy repairing the damage so as to be able to reopen on Monday Night. This explosion occurred at 4 am on last Sunday Morning","53":" & the Stage Manager was injured badly & an assistant slightly. I visited this place the Night previous & little did I think\n\nin a few hours it would be hit. I met a N.S.Wales Artillery Boy there so we both came away together & as it was his first visit to Poperinghe I showed him around until Tea Time then we both went to see a variety Show at the Soldiers Theatre, where a good programe was presented to a packed house. After the show was over I said Good Bye to my friend & made arrangements to meet him next Saturday Afternoon if possible. I caught a Motor Transport & soon was back in Camp & retired for the Night. but had very little sleep as the roar of the Guns all night was terrible. The Offensive has now started & I beleive a 4 days Bombardment takes place, then over the lads go, during the Night we had another Gas Alarm & all was on the Alert for some time, but no gas reached our vicinity.\n","54":"\n\nI awoke at 7 am this morning & still the Guns were Booming & continued all day. During the Afternoon & Evening our Observation Balloons were up & Fritz was sending Shrapnel over which continually explodes\n\n \n\nall around them, one of the Balloons is right over head & I was awoke up from a sleep by one shell bursting over the Top of the Balloon, I jumped up & covered my head under the clothes hanging on the Tent Pole for protection from the Bullets, as it was none came through the Tent although they were falling on the Roofs of the Huts close by. A little later on Fritz judged a shell nicely & damaged the wings of the balloon overhead & it was pulled down & another sent up, As I write these lines Fritz is trying to hit another balloon near by & is getting very close to it. As there is about 20 Balloons which I can see Fritz has plenty of targets to shoot at, I don’t pretend to be a hero, still it is not to comfortable to be sitting in your Tent while the Shrapnel is bursting over head, As a shell bursts you can hear the Nose Cap hissing as it falls in the bush so when a shell bursts you dont know where the Cap or Bullets are going to fall. There are a large number of Aeroplanes patrolling up above at \n\npresent also the Anti Air Craft Guns are fireing up at a Taube, he is too high to be seen by the naked Eye, these Machines fly very high & the Guns keep him there so that he cannot see down below & take notes of what is going on. As the light began to fade, down came all the Balloons gradually & as far as Shrapnel was concerned they ceased. I made up my Bunk & turned in about 9.30 Pm my Tent mate was reading a Book sitting at the door & I was laying in my Bunk reading a book by Candle light when all of a sudden there was a loud report & a flash of Fire outside. I jumped up immediately as I realized it was a Bomb dropped from a Taube, & on going outside I could see the smoke in the Bush about 30 yds away, I stood behind a Hut in case another one fell & after a few moments I went over to see the Hole it made likewise a lot of others, I did not hear the Machine approaching although others did & also heard another Bomb dropped but did not explode, all hands expected an exciting Night which evenuated. About\n\n10.30 Pm I awoke\n\nsuddenly by loud reports of Fireing in the Air. I could hear several Machines overhead & I went outside & what a Sight. The Guns were booming all around in the Bush & lights of shells exploding up above also a number of Search Lights 12 in all were scanning the Heavens everywhere looking for Fritz. I could hear several Bombs dropped in the vicinity. This went on for about ½ an hour making a great Sight, what with the Search lights, shells exploding in the Air, flashes of light from our Big Guns & the Liquid Fire lighting up the heavens it reminded me of a Gigantic Fireworks display, gradually Fritz dissapeared & things quietened down somewhat, but only temporary, I turned in again & tried to sleep but was continually being aroused by shells exploding close to our Camp or the report of our Big Guns near by sending shells over to Fritz. One can always tell when a Fritz shell is approaching, you hear a soft report then come’s a hissing sound when you know that it is travelling away from you & then come’s the Explosion, as for our shells going over, you hear\n\na loud report then a rumbling sound as the Shells travel away over the Lines.\n","55":"\n\nAt 3 am this morning Fritz was over again, but this time I did not stir I simply sat up & put my Steel Helmet & lit a Cigarette & had a smoke & listened to the play outside after awhile things quietened again & I dosed off & slept until 7 am, feeling tired as I had very little sleep all night. ","56":"\n \n","57":"\n\nAfter a quiet morning the Bombardment increased in violence & continued practically all night, word came from the Front line this evening that Fritz has cleared back 3 or 4 miles but our Lads are not advancing for a while as a trap may be set for them anyhow we are pummelling his Trenches to make sure We can guage how things are advancing by our Observation Balloons. ","58":"\n As soon as it got dark this Evening & as the sky is clear Fritz came over in his aeroplane, you can hear his Engine, Search lights were up in all directions looking \n\nfor him you could hear him flying around looking for our Railway Depot & Gun positions also the Bombs he dropped, four Bombs exploded in quick time away over from our Camp. This performance usually only lasts for about 30 minutes. I am sorry to say that my companion the","59":" A.M.C Officer had to go into Hospital on Wednesday Evening, he had been aching for 2 or 3 days & finally went & saw the Dr who pronounced his complaint as Trench Fever & ordered him at once into Hospital. & now I have to handle the A M C work on my own, I devote all my time to the work having been releived of the position of Sanitary Engineer temporarly until my Mate returns, which I hope will be soon. \n","60":"\n\nA large 12 inch Howitzer Gun was brought in this morning having seized somewhere when it was being fired, it’s Muzzle is pointing up very high & they cannot move it, it is going somewhere down the line. The Bombardment still continues \n\nfiercely, I went down to No 134 clearing Casualty Hospital in the Morning for supplies for the Medicine chest, they have made great preparation there for cases Marques put up everywhere & now there is accomadation for over 2000 casualties, I noticed two Marque’s filled with Boys who had been gassed, the sides of the Marques are let down to give the boys plenty of Fresh Air, also another Tent \nwith\n full of Boys with their Eyes bandaged up also gassed. I was told that their Eyes swell up and they cannot see out of them. A Balloon which had been stationed by the Hospital has now been removed nearer the Line which means that they have taken some more ground from Fritz. There is no mistake there is something doing shortly as we are practically surrounded by Amunition Wagons everywhere also on going over to the Load in the Evening I saw several families of Belgium people with their goods & chattels coming from near the Fireing line & going towards Poperinghe for Safety. There must be a large number of Troops Etc now \n\nin this district, every day more are coming up from other Parts. \nLast\n \n","61":"\n\nLast night we had our usual visit from Fritz also heard several Bombs dropped, I did not hear of any casualties. he only came over once & with the exception of the Guns booming things generally were quiet all night. Several Amunition Teams came into our Camp this morning & took up some vacant ground near by, they are from Bullecourt in France. One Lad told me this morning at 3 am they had to gallop through Fritz’s Fire & a shell caught one team & killed the Horses & Drivers & exploded the Amunition which blew up the Wagon. I admire these Men they have a perilious job to perform, they have to go every evening up to their Batteries with Amunition & stores under continual shell Fire. Sometimes the Road is blown up & they have to go around the holes & through the Bush, they have to get there hook or by crook, & continually\n\nlose horses or Mules & Men, they start early in the Evening & are away all night, & they do not get the best of rations either. After Breakfast a heavy thunderstorm came up, the clouds were very thick & made the place quiet dark, I put the flaps of the Tent down & closed the opening up & had to light a candle to read with. The Thunder & lightning was very severe, Rain came down in Torrents for a while, anyhow it stopped the Bombarding, everything was quiet while the storm was on but as soon as the storm passed Bang Bang went the Guns again & continued until Tea then they eased off a little & now at 7.30 Pm one would hardly know a War is on except a shell or two now & again Fritz sends over to let us know he is awake. I hope we will have a quiet night as it is to cloudy for Fritz & his Machine to disturb us.\n","62":"\n\nMy wish was gratified for a quiet night, the Bombardment eased off considerable & I had a good\n\nnight sleep. As we were having Breakfast 8 more Ammunition Teams came in & took up a position in front of our Mess Tables. As soon as the lads unharnessed their Teams, all our Boys offered them Biscuits & Cheese & Tea which they were very thankful as they had been on the road all night & were tired & hungry in fact just about knocked. After they finished & had fed their horses they had their Breakfast & down they laid everywhere some under their Wagons & others in the open, there were a drizzly Rain fallen & it made no difference to them they slept through it all until Dinner Time. They took things easy during the afternoon & evening. The Bombardment was very quiet all Day & Evening. It was freely rumored that the Big Push would start at 4 am next Morning. I invited two N.C.G’s to camp in my Tent for the Night which they accepted & I learnt from them that they had orders to move off at 5 am next Morning up to their Guns to move the guns \n\nwith the advance. \n","63":"\n\nAt 3 am the Bugles sounded the Reveille & all the Ammunition Columns around about were up & getting ready. I bade my Companions Good Bye & Good Luck & they left me. At 4 am the Bombardment started in real ernest, it made a Terrific Noise, I got up & put on my Big Coat & went outside & had a look. What an awful although grand sight the Flashes of Fire all along the Line as far as the eye could see was wonderful, reminding me of a Huge Bush Fire. The Heavens were lit up with Red Fire & the Booming of the Guns were making a Terrific Noise. There were no more sleep for me so I turned in & listened to the Noise until 6 am, when I dressed & went over to the yard to hear of any news. Out of Ten Engines stationed here only one was left, One Engine was off the Road up near the Canal & another failed in one of the roads at South Loop & the\n\nBreakdown Train went out at 2 am to pull the Engine on again. After Breakfast several Engines came back also the Breakdown Train & what a story they had to tell us. The Barage started as I said at 4 am & at 5 am it lifted & over our lads went, Fritz hardly put a shell over in fact only one here & there, he evidently had to warm a time & was busy clearing back. Only 2 shells from Fritz came over our way after the Bombardment started & up to now 9 am he is still silent. One \nTrain\n Engine brought a Train load of Prisoners down to the Compound a little way up from here, Another Engine brought a Train load of wounded down to 134 Casualty Clearing Hospital, amongst the wounded was a German Prisoner a lad of 16 years who had a Bayonet Wound in the back, it is awful only a Boy, fighting they must be getting short of Men to have Boys in the Trenches. I hear that at 6 am the Scotch Regiments in our \n\nsector had possession of Fritz’s third line of Trenches & had gone to far & as our Barrage was storming the","64":" line they had several of their Men injured & had to come back to the Third line, One of our Balloons broke away at 5 am & sailed away over our Camp, there were a good length of Wire hanging from it & \nit\n one of our Aeroplanes collided with the Wire & came down in a field near by. I did not hear if the Men were hurt. The Machine dived to earth so I am afraid they were killed, the Observers in the Balloon jumped away in their Parachuets & came down safely. They are still pummelling away but are getting away from us as the reports are not near so loud now. ","65":"\n Rain commenced to fall yesterday this evening & continued all night, at about 9 Pm \nlast night\n there was a great Artillery Duel. Our Guns could be heard sending some heavy shells over to Fritz & he was returning \n\nthe Fire, I could distinctly hear his shells bursting in fact he extended his range & two of his big Guns we sending Shells over our way \nin fact\n dropping them all around our Camp, some were duds which failed to explode & some made a terrific noise, this duel lasted until about midnight when both sides seem to have had enough & as it was raining hard, things quietened down, & I fell off to sleep, when I awoke in the morning it was still raining & naturally it stopped all fighting as far as the Artillery was concerned, during the Morning a large number of Prisoners came into our yard to be entrained away. I went over & had a look at them, there were a good number of Officers, also Red Cross Men & Privates, the Authorities put 50 Men in a Truck & as ther were 40 Trucks the Train contained 2000 all\n\ntold & some were left behind, they all looked a sorry lot, being Wet through to the skin, one Private smiled at me & said Plenty more Fritz coming which was only to true as another lot of Officers & Men came in during the Afternoon, about the same number & they likewise was wet through. Up to dinner time I heard from a Driver that we had Captured St Julien a Village about 4 miles in Fritz’s Country also that the French who were operating alongside of us had taken Steenstraate. We are now holding the 4th line of Fritz’s Trenches, All day Thursday St Julien changed hands several times & as it is still raining the Artillery is quiet, also no Aeroplanes neither Observation Balloons are about. This rain has been unfortunate for us as we had Fritz pretty well on the run & now he has a chance to recover. Today","66":"\n\nstill raining & nothing doing, I heard today that Fritz has captured St Julian & is now holding it. Our Casualties up to date have been very light & from reports Fritz has had a lot killed.\n","67":"\n\nWe attacked Fritz again today & forced him out of St Julien & now we are holding it & it will not revert again to Fritz. I obtained leave & went into Poperinghe for a change, while I was walking about I noticed some Purple Ribbon in a shop. I bought ½ yard & was directed to a Tailoress who had some Terricotta Red in stock, so I got her to make me our Regimental Colours, as up to date Headquarters had not supplied us with them & as all the other Australian Regiments had theirs I decided to buy my own. They cost me 1 Franc each, the Colours are Red 2 ¼ inch square with 1","68":" inch diamond of Purple with the number of our Corp 59\n\nplaced in the Centre after they had been sewn on my Tunic I went along & had Tea & then into the Cinema Theatre to see the Pictures which were splendid & was packed with Soldiers. When I arrived back at 9 Pm in Camp, my colours caused a stir & I was \ncriticised\n critisecized anyhow several wanted me to get them theirs. I turned into bed at 9.30 & was reading when Fritz started sending over High Explosive shells close to the Camp, the first shell did not do any damage but the second shell hit a Motor \nTransport\n Wagon standing \non\n near the Road & set fire to the Petrol there was a great flare up & the Petrol in the Tanks & Supply Tins as it exploded it made the flames & smoke shoot up in the Air; the Motor Wagon contained Cartridges & as they exploded they made a loud report this kept up for about ½ an hour then all was quiet again altogether there were 2 wagons & 1 Traction Engine destroyed, one man killed 4 seriously wounded\n\n& a lot slight. Fritz put no more over that night so all hands had a good rest. \n","69":"\n\nAfter Dinner I went into Poperinghe to make some purchases also to get some Colours for the Boys. having to wait for the Colours I went into the Cinema Theatre to see the Pictures. The place was crowded & a good programme was presented including a Charlie Chaplin Film, a very laughable one after coming out I went along for the Colours & Fritz started shelling the Town, while I was waiting in the shop the Lady in charge went along to get some milk \ninto a building\n & while she was coming back a Shell burst close by & some Bricks & Mortar fell on her injuring her severely, some Australians handy rendered First Aid & summoned the Motor Ambulance & she was taken to the Civilian Hospital in Proven a few miles away. After seeing the Lady in the Car & having my colours I left & came back to Camp. \n","70":"\n\nAfter a couple of quite days, Fritz leaving us alone as far as putting shells over, he woke up & started at 1.30 am sending High Explosives over. They were pretty close to the Camp as a lot of dirt was thrown over & rattled on some of our Iron Camps, one shell burst only a few yards off a Signal Cabin near the Main Road, the Signal Man had a narrow escape, dirt flying all over him,, but he was not hurt. Several of Fritz’s Aeroplanes came over afterwards & Bombs were dropping everywhere but I did not hear of any damage done nearby, up the line further one Bomb dropped amongst a lot of horses & killed 59 outright also a shell burst in a Artillery Camp & killed 7 horses & one Man, also wounded 2 Officers & a Batman severly. After Breakfast we saw an Aeroplane Fight. a Fritz Machine was coming after one of our Balloons & two of our Machines after him, the Men in the Balloon jumped clear in their Parachuete’s & came down safe, in the \n\nMeantime Fritz went behind a cloud & our Boys after him & they were out of sight but only for a while, when Fritz came down & set fire to the balloon, with our boys in close persuit, one of our Machines got under Fritz & the other on top & they closed in on him, they were all using their Machine Guns, eventually our boys hit Fritz in a fatal spot & down came his Machine head first & I was told by one of our Guards that the Machine buried itself in a field six feet deep, he helped to pull the Dead German out of the Wreckage & took his skull Cap as a sovenier of the Fight. An Officer who was there remarked to the Guard that he was sorry that the German was killed as he certainly put up a great fight against our two machines & he was a brave man as he had a good chance to clear out in the clouds but he was determined to get the balloon at all cost which lost him his life. As the Front line is further away now we only hear the Guns \n\nbooming now & again. As soon as my Mate returns from the Hospital I intend taking a day off & going up the line to Eypes to have a look around. Our Colours arrived from London on Saturday Evening & as I had taken several orders for the Boys & supplied them, there will be no more wanted although I still have 12 sets on order, we hoped to get the numbers of our Coy (59) but they did not come so I have got a lot in Poperinghe & sold them to the Boys, altogether I have sold 15 sets at 1 Franc 2d each, they cost me 1 Franc each, that is 5d for the Colours & 5d for the number so I make 4d on each set, also I got a lot of Red Cotton & have sold enough to sew a set on at 1d a time, they cost me 1 ½ a card & I get about 12 lots off a card. Also I have sewn 8 sets on their Uniforms at ½ Franc a set so I have done well out of the Colour business. Several of the boys intend sending out the Sets I have supplied them to Australia as Soveniers from Belgium. \n\nThursday 15th 1917\n\nAll last night our Guns were making a great noise, when I went to sleep they were banging & when I awoke at 7 am they still were fireing. After Breakfast word came in that the Boys went over at Daylight & gained their Objectives. They took possession of Langemarch, a fairly size village & had advanced for about 2 miles, & had taken close on 2000 prisoners, Fritz evidently got wild of this offensive as he put his spite on us & started after Breakfast sending over High Explosives & kept it up until nigh Dinner time, the shells exploded all around the Camp & Railway, one made a big hole about 20 ft from the Control Office in a Crop of Oats, another fell behind the Camp about 50 yds off one fell in a shed where a man was grooming a horse he was blown out of the shed & the horse & another near was killed outright, fortunately none of our boys were hit. After dinner I got a Pass & went into Poperinghe for a change. I had several things\n\nto buy, I wanted some Red Cotton also some more numbers of 5 & 9, I could not get them in Gold so I got 2 sets of Silver ones, one set I put on two colours for a lad & the other set I put on two colours & put them in a letter and sent them home to Australia for my two eldest Boys, their Mother will put them on their coats also a little Belgian sovenir for the girl. After I had Tea I went to the Tivoli Theatre to see a variety show and spent a very enjoyable evening there as usual it was crowded afterwards I came back to Camp, & as Fritz was hovering about, the Camp was astir, he dropped several Bombs away in the distance, he made himself scarce & we had a quiet night.\n\nFriday Aug 16\/17.\n\nThings were very quiet all day in Camp no shells coming over, during the Afternoon our sporting material arrived & the boys started playing Cricket also kicking the Football on the block of ground between the Camp & the Railway. The Belgian People came\n\n& cut the Crop of Oats during the day so now we have a nice patch of ground to amuse ourselves on, it is about 1 ¾ acres. At 7 Pm I was sent to see a Sick Lad in one of the Huts, after seeing him I gave him a good rubbing with Camphor Oil also a cold Mixture, he had pains on the chest, back & legs & I took his Temp which was 102, I felt a bit uneasy about him so decided to take his Temperature at 9 Pm which I did & it read 102.6 so I decided that it was a case for the Hospital & saw one of the Officers who gave me an order to the Medical Officer in the Hospital at Steenjemill about 1 mile away, asking them to send along an Ambulance Motor for the Sick lad. I straight away put my Tunic on & Gas Bag & off I went along the line to the Hospital. As I was approaching the Hospital I could distinctly hear Fritz coming along in his Aeroplane & soon the Search lights were up looking for him there were 9 lights scanning the Heavens & when I \n\narrived at the Hospital my attention was drawn by a Corporal who pointed out Fritz in the light, as soon as the Search lights picked him up, what a cannonading there were, Anti Air Craft & Machine Guns were fireing from all directions. The Shells were bursting all around him, it was a beautiful Sight, The aeroplane in the light looked like a huge Silver Bird gliding along, he was making straight for the Hospital then he turned and made for Poperinghe & soon was lost in the dark. Having shown my Order at the Hospital I was directed to a Motor Car & the Driver brought me back to the Depot for the Sick Man. On our arrival at the Depot, there were great excitement two of Fritz’s Machines could be heard up over head, they dropped several Bombs in the Bush & then they were picked up by the lights & off they went dropping Bombs, One Bomb exploded in the Royal Engineers Camp 268 Company & Killed 5 Tommies & wounded 20 others, rather a strange thing the 5 who were killed ran out of their Tent when \n\nhe was approaching & were killed between the Tents & the 20 Wounded were hit laying down. Also along further Bombs were dropped amongst the Niggers of the Jamacian Labour Company, & caused several casualties there. After making the Sick Man comfortable in the Motor Car, we set off for the Hospital. After a few delays we arrived at the Main Entrance & out came several stretcher Bearers, one switched on the light in the Car & assisted the lad into the Receiving Rooms, where he was handed a cup of Tea & Sandwitch, & awaited the Medical Officer, I felt hungry myself so I went through to the Buffet & obtained a nice mug of Tea & a Sandwitch which I enjoyed. They have a large staff of Stretcher Bearers standing by with straps on their sholdiers. the Receiving Room is a large Barn about 100ft X 20ft & is divided into 3 compartments, the first is the Arrival Room, then comes the examining & deciding Room where the cases are told off, some goes away to the C.C.S & others are taken through the 3rd Room \n\n& away into the Marquis or Huts. Having received a Receipt for my Patient, I came back to Camp feeling tired & turned in at 11.30 Pm & slept like a Top.\n","71":"\n\nAs we had fine weather for the past day or two the Aerial work by our aeroplanes was very interesting, all day long you could hear & see our Boys flying in amongst the clouds & now & again in the distance hear their Machine Guns fireing. After Dinner I witnessed an Aerial Fight very high up, you could see two machines skirmishing about, one would climb up high & the other following & you could hear the Rat Tat, Tat, of their Machine Guns, all of a sudden one dropped down turning side to side & the other following & then came the chase up again as they were rising along came 4 more of our Machines & the one who was leading of the two climbing slewed off & was lost in a big cloud \n\n \n\n& all the others following & soon was lost to view but you could hear their Machine Guns fireing continous, I could not say if they caught their victim, After Tea one of our Drivers came home & related an exciteing time he had on his return journey from Ypres Canal with a Train of Empty trucks, when he was nearing a Siding called Arrival Farm about 1 mile from Ypres he noticed 9 Taubes flying towards his Train & coming low down, our Anti Air Craft Guns & Machine Guns were fireing at them. The Driver decided to stop his Train & seek shelter under the Tender of the Engine, as it is about the Safest place from Bombs, As soon as he stopped the first Bomb dropped & exploded covering them in the Cab of the Engine with dirt & pieces of the Bomb struck the Eng in several places leaving marks here & there. They soon made them selves scarce & barely got down & under when several more Bombs dropped all about them on both\n\nsides, but none struck the Engine or Train. In getting under the Tender it is the best place because if a Bomb struck & exploded on the Coal it would have to penetrate the Coal & then the Water, which both would offer a big resistance to a Bomb. If they had kept going they would have been a better Target for Fritz as they can judge their mark better on a Moving Object as they have to keep going as our Guns could easly hit them if they slowed up to hit their mark. After dropping their Bombs all about they cleared away towards their lines & the Train proceeded on its Journey. While this Driver was telling me about his experience sitting in his hut & it being nearly dark, the Night armed Guards blew their Whistles, 3 long Blasts which means Fritz is approaching & all lights to be put out also all Shunting Operations to cease at once, we at once put out our light and went outside to see the fun. As Fritz was coming nearer & nearer you could hear the Bizz, Bizz Bizz of his Engine, we can\n\nalways tell if it is our Machines because they sound like a Top humming & continually drop white lights & sometimes they have two lights showing on the side of their Machine. As Fritz approached close, the Search Lights 9 in all from all directions were scanning the Heavens to try & pick him up, after a few moments the Biggest & most powerful light, picked him out & instantly all the other lights were trained on to him, making him very clear to the Eye. There is no mistake it is a wonderful sight. The Machine looks like a Huge Silver Bird gliding gracefuly along, the lights on him continually as soon as he is seen what a Row there is, the Anti Air Craft Guns blazeing away at him & you can see the shells bursting around him also the bullets from the Machine Guns going up giving off lights as they travel upwards. Of course the lights dazzle Fritz as he seems to stop & go slow, after a few seconds of fireing a Bright Light covered his Machine which was the sign that he was hit by an Exploding\n\nShell, & it had set alight his petrol Tank, he slewed to his left for a while & then started to volplane down in flames the search lights keeping on him all the time until he was below the Trees. On going down to the Hospital next morning I was told that several of the Orderlies went over to were he alighted & found the Machine all burnt & the charred remains of the Pilot laying in the bottom of the Machine, these pilots no doubt are brave men as if they are once picked up by search lights they are continually fired on & are passed from one light to another until they are brought down or lucky enough to escape. They do not deserve any sympathy as they drop their Bombs on Hospitals & Dressing Stations any where, they have a good idea as a rule where they are & know where these places are, as they come over in the Day time occasionally, so there is no excuse for them Bombing the Hospitals & Dressing stations, it is not certainly playing the game fair. After this Machine was destroyed, the all clear \n\nWhistle (1 Blast) was blown & all hands turned in & had a quiet night. Thursday 22nd\/8\/17. All Day we could hear the Big Guns bombarding Fritz’s line, it was one continually roar, as our Front line had gone ahead some 5 miles on this offensive & the 18lb Guns of course moving with the Advance, they are too far away for us to hear, & it is only the 12 inch Guns we can hear from our Camp, we are now about 12 miles from the Fireing line. After Dinner one of our Drivers who had just returned with an Empty Sand Train told me that the wounded men he spoke to the other Side of Ypres who were able to walk in along the Duck Boards that we had got possession of half a ridge beyond St Julien & that they expected to push Fritz over during the Afternoon. They were having a hard time of it although their casualties were very slight due no doubt to the wonderful Barrage put over by our Artillery, from reports coming in byTrain Men during the Evening proved it to \n\nit being correct as we have advanced our line in our Sector 2 miles further, & had taken a large number prisoners, as they were seen marching along the Ypres Road to Poperinghe. As usual after Tea Fritz paid us a visit but the lights could not find him in fact they as there were two, one continued flying over our Camp although he dropped no bombs, he went on until he came over a clearing station about 4 Miles away some where near International Corner & dropped several Bombs on to the Station & did a lot of damage, unfortunately the Bombs killed 7 of our good Nurses & also Orderlies & wounded a lot of others also the other Machine went away over Poperinghe & dropped Bombs onto another clearing station & killed 15 Wounded German Prisoners & further on at another Hospital he killed 2 Nurses & wounded seriously 5 other Girls also a lot of orderlies. It is a standing disgrace how he picks on to these places to do his dirty work, as there is plenty of other \n\n \n\nmarks for him, such as Ammunition dumps & Transport Wagon & Ammunition Columns all over the country. When he was over the International Corner he was picked up by the Search lights & fired on but not until after he had dropped his bombs on the clearing station, he had the luck to escape although his Machine must had been riddled with bullets, as usual the rest of the night was quiet except the guns booming in the distance. As I have been very busy for the last 4 weeks which will show as I proceed to write further in my Diary. On the Sunday following my last remarks I received a surprise, as I had mentioned previously that I was releiving the 1st A.M.C. Officer who is ill in Blighty, well after a certain time his name was struck off our strengths which left a vacancy for a Sergeant. I thought all along that doing his work would receive the 1st appointment but was dissapointed as a Driver Corporal was made\n\nSergeant & as I told our","72":" Warrant Officer who through out a suggestion that I should control the Chinese Sanitary Men on my own & release a Sapper who all along had the handling off. I told the","73":" W.O. that I could not manage the two positions at once & he said that he had 15 waiting for my position. I told him there & then to put one in my place as I was as just as pleased to go out Driving again, with the result that on","74":" I was releived of my position by a Sergeant who held a First Aid Certificate & I took up my old duties next day. During Sunday my Chum the Bootmaker & I proposed to build a Hut for ourselves as soon as possible, so as I was not booked up on the Road until Monday night during the morning of the","75":" I went about the bush looking for some material to build with. I came across several old Huts which had not been occupied for some time built\n\nof Wood & Iron & decided to if possible obtain about 30 sheets of iron, I got a hammer & chisel & a Tommy Bar & soon set to work getting the Iron off on one side of the roof, while I was removing an Officer came along & asked me if I was pulling the Huts down. I told him No. I was only getting a few sheets of Iron to make a hut for myself for the Winter. Anyhow he did not stop me so I continued working. After Dinner several of our lads on the lookout for Iron saw me & they started getting some & soon there were a rush. My Chum came along & we decided to take a third of the Hut complete & erect it in sections, any how by Tea Time we had pulled down & carted over to our site a Third of the Hut & then went on duty on the Shunter till 4 am in the Morning.","76":" After having a sleep & my Mate had finished his Boots we both stated to erect the Frame work & put down the Floor, we \n\nworked merrily along until tea time & finished our work before dark & as I was not on duty again until the next evening, I decided to put the Iron on the Roof before going to work. \n","77":" After I had breakfast I put my tools together & made for our Hut, when I arrived on the Site I got such a shock as during the Night previous some mean theives had stolen every one of my sheets of Iron They never left me one, I was dumbfounded as the Iron was placed alongside of another Chums Hut & worse luck he & his Mate was on duty so two others sleeping in the same hut never heard a sound all night, so they said, anyhow I was of the opinion that they both knew what was up & did not worry, so after a few words with my chum I intended going around trying to get a few sheets for the Roof I managed to get 12 & I put them on the Roof & went hunting in the bush for any\n\nwhat may have been planted & I dropped on two plants, one had six sheets laying in a ditch, covered over with Bushes & the second had 3 the same, I soon brought them over and covered one Side & partly the other & put canvas up at the back. I got 3 more sheets giving to me after Tea & I put them on the Side & a chum gave me a door he brought home, so in spite of the Mean Theives I slept in my hut that night not being required for duty.","78":" 8\/17. I was called out for duty as Pilot which meant that I was standing by my Engine all day to work any specials if required anyhow nothing doing so I never turned a wheel. All day long and during the night things were quiet, nothing happening worthy of note.","79":" . my Chum during the day brought his stretcher over & camped with me in the Hut. I was booked again on duty at Midnight on the shtr, when signing on\n\nI was told that one of our Drivers & his Fireman & the Guard had been injured up the line. As it was Moonlight, Fritz had been giving us a bit of trouble when the nights were clear, as he had been dropping Bombs all along the line. These 3 chaps were working for the 268 Coy of Royal Engineers up at Arrival Farm about 5 miles from here. There work was Laying & Ballasting the line as our Boys advanced. At about 10 Pm these 3 Chaps were sleeping in a Dug Out at there Depot & as the end of the Dug Out was weak a Bomb dropped by Fritz exploded & blew the end in & seriously injured all the three & they had been taken to the Hospital. We received several rumors that they had been knocked about very much but as events turned out they had only been slightly hurt & up to date are somewhere in France in a Hospital if not in Blighty. I had a easy time all night until about 7 am\n\nnext morning","80":" when I was ordered to assist another Eng out to E.8. Siding with Ballast. As I only had been previous out as far as the Casualty clearing station during daylight as all my runs had been out at night, anything past there was of interest to me. After coupling up the Eng on the Train we started away slowly. E.8. Siding Branches off at a station called South Loop about 1 ½ miles from here we soon arrived there & was turned into the Siding & as we were propelling the Train we continued along cautiously we passed the Main Road which was crowded with Troops coming in for a spell & Motor Transports who had been up to the Fireing line with stores & Material, it is a wonderful sight for anyone to see. Vehicles of every description on the Move a little further on we came to a Gun Loop which contained a 9 Point 2 Howitzer which was amongst some Trees & covered over with with Tarpaulin of all colours. The Ammunition trucks\n\nwere on another line about 100 yards away for safety, the Gun so concealed was hard to see from a distance the colours blending with the scenery in the vicinity, further along we came to a training Siding where the Tanks & Troops are unloaded one could see at a glance that Tanks were not far off as the ground everywhere was flattened down, the Tanks themselves were cleverly concealed amongst the Trees also covered over with Tarpaulins of all colours, they looked like Earth Mounds all about. A little further on we passed some old Trenches which were used by our Troops in 1914 They were winding in all directions. The grass & bushes now obscured them from view, after proceeding for about another ¼ of a mile we came to the end of the Siding where a very large amount of Material was stored to be converted into Huts for the Winter if necessary, just on the Right of the Siding is a beautiful Chateau in a \n\nwood, from the line I could only see the top of the building, it was well sheltered & must have been some beautiful home in Peace Time, I was informed that it is now only a ruin after placing our Trucks we came back home again & booked off duty. Sunday Afternoon","81":" our Football Team went down to Borre about 15 miles away to play a Team there, as I was on duty again at 4 Pm I could not go. They had a grand time, my Mate was with them & told me that they had been beaten by 2 goals to Nil but still they did not mind as the Boys there gave them a good tea & the Royal Engineers Band there gave them a Musical Treat as the Band had only been formed 3 weeks they gave a splendid account of themselves which was appreciated by all, our Boys left for home at 8 Pm & after a lot of delays enroute they arrived home singing merrily in the Trucks at 10 Pm. From","82":" until this week things \n\nin general had been quite & during that period we were busy making the inside of our Hut comfortable we procured a Tarpaulin & lined the inside & I obtained some more sheets of Iron from the R.E. Park close by which is full of Material & covered the back and built a Fireplace at the end also we put up a Wash house 6ft X 6ft at the Front, the Hut is a Gable Shape & is 12ft long x 10ft high & 10ft wide, & we made a table 3ft x 4ft & covered the top over with Green Canvas & it looks very nice also I nailed a box on the wall above the table at the end & put a strip of canvas over the front & use it for putting food in, we draw our food from No 1 Mess & bring it over to our hut about 20yds away & we have all our meals on our table, I obtained a Lamp from a Friend & we are very comfortable & prepared for any cold weather the Winter brings along. Last Friday Night","83":" after we came home\n\nfrom a variety show in Poperinghe which we enjoyed very much we decided to go Bandicooting for Potatoes as there are any amount growing about, & as the supply of Potatoes from the Supply Depot is very erratic, we decided to cook our own, Bandicooting means digging down under the plants & pulling out the Potatoes, we filled nearly 2 Sand Bags in about 40\" & they are very nice & we boil & fry them & we can obtain now & again a Tin of Bully Beef & make a stew for Tea also we have now toast for Breakfast & buy Cocoa which is very dear at 1 Franc 20 cent for ¼ lb, Sugar 2 franc 20 Cent per Kilo Condensed Milk 1 Franc 60 Centimes, Sauce at 1fr-20ct so we have cocoa for Supper. Last Monday Night","84":" we knocked up a Tea from our Surplus food in our Cupboard with Potatoes, Onions & Bully Beef & had it at 4 Pm & left here at about 4.30 Pm & got a lift in by Motor Wagon & when we arrived at the Soldiers Theatre at 5 Pm. I now conclude No 2 Diary & continue on No 3. \n\n"}}